[{"comment_id":"1129560600439389","commenter_b":"Why doesn't everybody wake up and send them back to their own country WTF","commenter_a":"Peaceful What?! No such thing! All vicious rabid ranting carnivorous things from hell! Satan has sent them from the burning sands of the deserts to murder, rape and pillage all others! Be gone you vermin from the bowels of perdition!","post_message":"HIDDEN CAMERA: This Is How Moderate Muslims REALLY Treat Peaceful Christians!  wow!"},{"comment_id":"10155220975479218","commenter_b":"@username tell that to a nun","commenter_a":"You wouldn't need to be pro choice or pro life if people were just responsible when it comes to their sex lives. Both men and women, responsibility!","post_message":"Thousands of people demonstrated in the annual March For Life, marching from the Washington Monument to the Supreme Court, advocating the right to life >> @webpagelink"},{"comment_id":"760883910715426","commenter_b":"We will give her up to you Iran! Go let her ruin your country!","commenter_a":"Don't you need a brain to be a spy?","post_message":"Is Kim Kardashian West a secret agent?"},{"comment_id":"10153830335904087","commenter_b":"Course they won't. They just coronated their queen.","commenter_a":"The most transparent \"administration\" in history.... LOL","post_message":"#BREAKING: The State Department is refusing to hand the House Oversight Committee any email messages as part of the panel’s investigation into eight deleted minutes from a 2013 press briefing video."},{"comment_id":"1730897643856292","commenter_b":"who cares she just a slut","commenter_a":"Yes by a long shot","post_message":"Scandalous Photos Of Donald Trump’s Wife Leak To The Public [SEE PHOTOS]. Regardless, she is 100x classier then Michelle Obama. Do you think Melania Trump would make a good first lady?"},{"comment_id":"2088211734736585","commenter_b":"Stupid cow!","commenter_a":"Your a stupid person","post_message":"Cokie Roberts called supporters of Donald Trump \"morally tainted\" on MSNBC's \"Morning Joe,\" then received a heavy dose of push back."},{"comment_id":"10154459002469714","commenter_b":"Heaven forbid, but you are right. She has bought and paid for this election, horrible, corrupt hag that she is.","commenter_a":"Hillary Clinton is going to be our first woman President.","post_message":"ICYMI: FBI director James Comey said Hillary Clinton was \"extremely careless\" in handling classified information, but recommends to the Department of Justice that Clinton not face criminal charges."}]
