[{"comment_id":"10150668295129999","commenter_b":"She ugly","commenter_a":"Colleen Crann Generation Z is going to college.","post_message":"“In short, there’s a strong ‘you do you’ ethos among teens today.”"},{"comment_id":"10154474483213812","commenter_b":"Arrested for saving lives........?????? Your mother should have swallowed you.","commenter_a":"Why don't you take care of them too. He should be arrested for illegal immigration. Try and bring Mexicans through the US border and see what happens.","post_message":"Privately owned search-and-rescue company owned by American millionaire has saved 500 refugees and migrants at risk of drowning after only 2 days of searching."},{"comment_id":"1790704097809032","commenter_b":"Pssst when's the last time the KKK has assassinated a cop in the streets? When's the last time the KKK burned down and looted their own towns? Who do you think BLM are voting for? Btw, do a Google search of who created the KKK. Democrats. Who freed the slaves? Republicans. Who passed a law allowing blacks to vote? Republicans. Who's the only candidate that voted against Civil rights? Hillary when she was a Goldwater.","commenter_a":"Yes. Except it is his supporters who are the real embarrassment. Buying into the lies of this conman. Feeling empowered, the violent white national (KKK) movement is showing itself in daylight. Embarrassment is not a powerful enough word.","post_message":"Yep.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1167920019941418","commenter_b":"@username and real men don't use emojis to other men over the Internet","commenter_a":"Donald trump used to endorse boxing a lot. That's why don king and Tyson support him. They actually know him instead of judging him based on the Internet and tv","post_message":"#DonKing is advocating for #DonaldTrump now! #WSHH"},{"comment_id":"10154090778463822","commenter_b":"@username Ummmm So your a priest and admitting being a child molester? Sound like a real POS...Find someone of legal age","commenter_a":"Penn State fans must be proud to cheer for a POS coach that condoned child molestation and rape. \"We Are....Child Molesters\"","post_message":"As soon as Paterno’s familiar image – shirt and tie, thick glasses and rolled-up pants – appeared,fans erupted and kept cheering...  GAME RECAP: @webpagelink"},{"comment_id":"10156823156490594","commenter_b":"I don't want my great-granddaughters going into to bathrooms where males are also present. I'm not talking about transgender; there are sick people that will use that as an excuse to be were they shouldn't","commenter_a":"I never really shopped at Target's, I will now. I'm glad your taking a stand for the transgender population. So sad that people's lack of knowledge or fear make them judge.","post_message":"\"Inclusivity is a core belief at Target,\" said the retailer in a statement. \"It's something we celebrate.\""},{"comment_id":"10153180553634071","commenter_b":"ohh this one","commenter_a":"@username Teresa Oanh Hoang","post_message":"She had something much better in mind."}]
