[{"comment_id":"10154262289194877","commenter_b":"And this the female who said it.","commenter_a":"Put your picture up there probably a dog","post_message":"Not today Satan."},{"comment_id":"10155786065335329","commenter_b":"I sincerely hope you don't have children or grandchildren. Do not reproduce. You know who needs serious psychological help? People who are so close minded that they can't see out their \"perfect little bubble\" and judge anyone and everyone different than them. I love my generation because we are some accepting individuals. We want equality for all because WE ARE ALL HUMAN!! why does it matter to YOU personally what genitals someone has/wants. Who they lay down with behind closed doors. Why is considered \"crazy\" for the parents to support THEIR child's dreams and aspirations. Like got damn lady. Worry about your own snatch and keep your negativity to yourself. ✌💚","commenter_a":"Wow that family needs serious psychiatric help.","post_message":"\"By four, Samuel broke out in hives when we tried to cut his hair, and at five he told us, through tears, that he wanted to burn his face off because it wasn a girl face.\""},{"comment_id":"911888578926545","commenter_b":"@username SO WHAT ITS LEADING TO THAT WE NEED TO TAKE OUR COUNTRY BACK AND PUT THEM IN PLACE THEY CAN T GET OUT OF OR PUT THEM IN MEXICO","commenter_a":"Civil Disobedience is totally fine and I salute those who stand by their beliefs. Perpetrating violence, burning, looting, damaging property etc. is not and those folks should be arrested and prosecuted.","post_message":"***The Radical Hard Left is plotting a Soros-funded plot to spark upheaval across America***"},{"comment_id":"588617531328826","commenter_b":"She is a joke","commenter_a":"Yes she should keep her mouth shut. She is not the president (neither is Obama). She mouths off and there are Americans starving and dying because they cant get medicine. They both need to just go away. They dont need to be in the US.","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with. Nobody cares. What a joke. Do you agree Michelle Obama should keep her mouth shut?"},{"comment_id":"880520761983346","commenter_b":"Perfect pic of her with her mouth wide open.","commenter_a":"She is scum.","post_message":"Tom Selleck is awesome!"},{"comment_id":"10152808314825736","commenter_b":"Hope everyone has their General Lee from \"The Dukes of Hazard\" cause you can't buy one from amazon, ebay or etsy now!","commenter_a":"Confederate flags have just become collectable.","post_message":"More retailers, including Amazon and eBay, joined Walmart to remove rebel-flagged items from their shelves and websites."},{"comment_id":"405687699555825","commenter_b":"They all do it, he was just to stupid and got caught.","commenter_a":"SOP,,,,,since forever!!!! Most all are getting away with it and have since day one!!!!","post_message":"How many politicians are getting away with this every day?"}]
