[{"comment_id":"10152869358831336","commenter_b":"We should get rid of the Kkk. This is not their land either.","commenter_a":"We should Deport Obama and his Kind back to Kenya or where they all came from this is our Land Not their's!!!","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad? Watch and weigh in: @webpagelink"},{"comment_id":"10154227254693256","commenter_b":"So give your vote to Hillary. Obama lover!","commenter_a":"\"NEVER\" - Trump, and that's not a \"Suggestion\" Mr. Trump, and that goes for \"John Miller\" either. What a Joke not him....... LOL! I say GO for it Mitt!","post_message":"Conservatives, even those not all that enamored of him in 2012, are beginning to entertain the possibility of Mitt Romney."},{"comment_id":"970465326346278","commenter_b":"Bitch!","commenter_a":"LMAO,at STUPIDITY","post_message":"Elisabeth Hasselbeck doesn't like that Pelosi left the conclusions about the videos to the scientists."},{"comment_id":"1139840619402033","commenter_b":"Hey, if he wants them in California, I thonk we should let him have them. While were at it, lets build a wall around California too.","commenter_a":"What a POS he is","post_message":"Even the FBI says they can't propertly vet these migrants..."},{"comment_id":"10152744164338645","commenter_b":"@username....Sounds like you are the racist here calling @username \"Mr. White Man\" with the pea brain...maybe you are the one with the pea brain!","commenter_a":"Please don't shoot the young black ARMED CRIMINAL, it might start another riot!","post_message":"Police investigate an early morning armed robbery at an area Wal-Mart store."},{"comment_id":"10153476790357490","commenter_b":"Rachelle that the way it was in the day...just saying...thank you for being a stupid bitch!!","commenter_a":"Oh Lord...way back in my day they got an Admin or Medical discharge...if the Navy wanted you to have a baby they would have issued you one with your seabag...","post_message":"MATERNITY LEAVE BOOST, ICYMI – Female sailors to get up to 18 weeks in the year after their baby is born:"},{"comment_id":"1044585922265355","commenter_b":"Poor little Marco.","commenter_a":"Senator Rubio, please stop getting in the gutter. Your recent comments make you sound like like you are 5 years old. You are better than that and I am so very disappointed.","post_message":"\"And you know what they say about guys with small hands...\" Marco Rubio said of Donald J. Trump."}]
