[{"comment_id":"10154346663693734","commenter_b":"Send this post to the wife's Lawyer. I'm sure the husband wouldn't put up with that if the rolls were reversed.","commenter_a":"This dude can't be serious😕😐😕.","post_message":"\"They need to learn to get along. If they love me the way they say they do, they will learn how to coexist in peace. That's not asking much.\""},{"comment_id":"10154462240499087","commenter_b":"No, former president Bush didn't listen to the Intelligence Community and he didn't wait for their final report: he ordered them to leave to start his war!!","commenter_a":"It seems funny to me that all you Democrats were screaming with President Bush took the intelligence community advice on \"weapons of mass destruction\"! How quickly we change our minds....but now we are to trust the intelligence community?","post_message":"\"Lesson #1: don’t mess with the intelligence community.\""},{"comment_id":"456493334475707","commenter_b":"Fuck u bitch and that pedophile country PISSRAEL","commenter_a":"PISSRAEL","post_message":"In the following report, we’ve replaced references to Israel with the Islamic State of Iraq and Syria (ISIS) to make a point about how differently they are treated by the media and politicians."},{"comment_id":"1370390752974540","commenter_b":"Please go after Hillary next.","commenter_a":"None of them in Washington are honest anymore. Only to themselves lining their pockets.","post_message":"We thought Democrats were supposed to be the honest ones!"},{"comment_id":"10153248513449087","commenter_b":"Stupid liberals so hope you run that old white socialist ass wipe.","commenter_a":"and democrats blame all the world's problems on Republicans, you old fart shut up","post_message":"\"In their world, every problem that you can possibly imagine is caused by Barack Obama,” Bernie Sanders quipped at a campaign rally in Boston. \"If there is rain, if it’s too hot, if there’s a mosquito in the room, it is all Barack Obama.”"},{"comment_id":"10153300908534411","commenter_b":"She doesn't want the truth.","commenter_a":"Blacks kill more blacks if you really want the truth.","post_message":"An analysis released last week shows that more white people died at the hands of law enforcement than those of any other race in the last two years, even as the Justice Department, social-justice groups and media coverage focus on black victims of police force."},{"comment_id":"1066271903469061","commenter_b":"Illegal drugs are banned.","commenter_a":"None; simply ban them! ..... instead of thinking on wasting American lives and huge amounts of money in pointless wars, we should tackle our home problems first....and gun control is the main one!","post_message":"\"What could possibly be the argument for allowing a terrorist suspect to buy a semi-automatic weapon?\"  - President Obama  More from his address here: @webpagelink"}]
