[{"comment_id":"899754210061920","commenter_b":"What do you care what she does or has? She doesn't have 2 brain cells to rub together!","commenter_a":"From what I understand, they don't drink alcohol at all. So I don't think she would fit in. Sad thing is that because of the alcohol and drugs she uses, she looks a lot older. I'm actually older than she is!","post_message":"Is Lindsay Lohan converting to Islam?    See what she was photographed holding."},{"comment_id":"606850699417060","commenter_b":"What a pussy","commenter_a":"Remember these Libatards,I never forget !","post_message":"List Of 31 Democrats Who Will Be Giving Netanyahu The Middle Finger, SKIPPING His Speech ⋆ UFP NEWS... @webpagelink"},{"comment_id":"10158098604455192","commenter_b":"Awww look at the snowflake. Upset because she can't find the safe room.","commenter_a":"Who really cares what these celebrities think.","post_message":"Streep noted that \"Hollywood\" is a reviled place. But in reviewing the backgrounds of several of her colleagues surrounding her at the Globes, she said that it's really a community filled with people from other places united in the mission to show different people and make audiences feel what they feel."},{"comment_id":"451531238383723","commenter_b":"she also thinks we can't deport 20 million illegal parasites. boy is she in for a big surprise. a needy, insecure, unaccomplished , doormat to a serial women abuser.","commenter_a":"Have fun I will not hand mine over","post_message":"Hillary Clinton is Coming for your Guns!"},{"comment_id":"10155902934120294","commenter_b":"I agree, if its fact its clearly ok to say it. That chick had no place in that store","commenter_a":"They said it loud enough for her to hear. She heard it and it hurts. Just be kind. If you can't say something nice don't say anything.","post_message":"This woman knew what she had to do after the hurtful conversation she said she overheard between a teenage girl and her mom at Old Navy."},{"comment_id":"10153860707103812","commenter_b":"@username So she should just be allowed to sit there and disobey?","commenter_a":"Guess you should do what your told instead of thinking your above the law because your a minor. This should happen more often. It is no wonder law enforcement is backing down because everytime they do thier job they get ridiculed.","post_message":"WATCH: Video shows uniformed deputy grab a female high school student and wrestle her out of the seat and to the ground. @webpagelink"},{"comment_id":"2196085043950203","commenter_b":"When is she moving. Shut her up","commenter_a":"She needs ducktape","post_message":"The Left in America is unhinged: why is this woman on TV?"}]
