[{"comment_id":"1357769630924322","commenter_b":"This story is a distraction tactic to pull attention away from the real story. Americans seem to fall for it every time. Next week it will be something else..keeps us divvied and look we are.","commenter_a":"Oh, and another thing Far Left Liberals. The Head Muslim wants to destroy USA with his crazy Muslim immigration scheme so the U.S. \"can be lowered to the standard of the rest of the world\" is lunacy! Obama is a Muslim, this is not a Muslim state although he is trying to make it so..that is his Legacy. That is why Trump was elected. We are not the Muslim States of America!","post_message":"Hell has officially frozen over. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"510721549087800","commenter_b":"Ok 1. Lets ask ourselves do they want to destroy capitalism answer (no) 2. Will they take the means of production from the capitalist answer no 3. Do they want to destroy the upper class answer no","commenter_a":"The progressives will next demonize God and Jesus then they'll start pushing multiculturalism and diversity so Ireland get ready","post_message":"\"Abortion has been demonized and criminalized in this country and older generations think there's something really wrong of it... but it's something that should be available to people.\""},{"comment_id":"735565289967382","commenter_b":"Dear God, kick this ignorant African so hard he gets back to Africa. He needs English as a second language. Also needs to be taught to not make threats. What a POS. Go back to where you came from.","commenter_a":"This guy is a fanatic. He'd better be stop or someone s going to get Bharat namely, him","post_message":"Knife wielding Muslim attacks Trump, but watched what happens next. I bet he never expected this. Let's show him our support. Can we get 30,000 'LIKES' Donald Trump?"},{"comment_id":"534617120056639","commenter_b":"Mike Bassenti This is what they get for coming here !! We have to pay for this ! @webpagelink","commenter_a":"Big news is Trump is earning MAJOR support from segments of the population which almost exclusively vote for Democrats. SurveyUSA announced that Donald Trump would receive 25% among black registered voters. That is news that has Hillary Clinton terrified, and is shaking the political establishment to the core!","post_message":"I had an incredible time in Detroit yesterday. A great experience - learned a lot by listening to everyone. I am grateful for their support - and time. You can catch what I had to say to everyone, right here. Thank you! -DJT"},{"comment_id":"10153393698278606","commenter_b":"The statement would they would have been fired if it was a white man is stupid,they should have been either way and the point is it wasn't, if this is the kind of judgement they you I wouldn't trust them to protect and serve","commenter_a":"It looks like two hunters with a deer...what's racist about it?","post_message":"One of the two police officers who was fired after posting this photo wants his job back: @webpagelink"},{"comment_id":"10154830070756337","commenter_b":"I feel good Hillary is going to win","commenter_a":"I'm with her!","post_message":"We're counting down to Tuesday's election. Tell us how you feel..."},{"comment_id":"10153250160727235","commenter_b":"sue and angela, dumb bitchs","commenter_a":"I'm a gun owner and have a permit to carry. I'm also sick and tired of the gun nuts. There is absolutely no accountability on their part for the tens of thousands who die by guns every year. The NRA can kiss my ass also. Just a bunch of crazies and I'm sick of their crap. I also used to be a member. Time to grow up America and hold people accountable.","post_message":"What kind of people would be enraged because of a benefit for dead children? OH."}]
