[{"comment_id":"10153127223956800","commenter_b":"Jodi, you are a serious bitch. And an ableist, uninformed, obnoxious bitch at that.","commenter_a":"I urge every parent with a child with autism (I have two children dx autism) to seek out proper IGenex testing for Lyme. Lyme mimics autism. Both of my children recovered from autism w proper Lyme treatment.","post_message":"\"The whole show is about raising money -- not to cure autism. Because a lot of people are working on biomedical research. My wife and I couldn't get our kid into any kind of school or program that was adequate for him until he was 7 years old. And people with fewer resources than us -- it's unimaginable to us what they have to go through. And the kids. They deserve better.” — Robert Smigel discusses Night of Too Many Stars   ► Watch the interview: @webpagelink ► Support autism programs: @webpagelink"},{"comment_id":"1144427122283701","commenter_b":"Seriously this woman obviously needs help.","commenter_a":"My cat thinks she's a human","post_message":"She hisses at dogs and often crawls on all fours"},{"comment_id":"10154111897691813","commenter_b":"Do illegal aliens have constitutional rights?","commenter_a":"Good to know. But I was told one time, Border Patrol agents can effect a search of your vehicle WITHOUT a warrant, and up to 12 miles from an international border.","post_message":"ICE is targeting families who have fled some of the world’s deadliest countries – escaping persecution and uncontrolled domestic and gang violence. Know your rights.  More information at: @webpagelink"},{"comment_id":"10153101958805329","commenter_b":"I love that now it's called \"fat shaming.\" She made a choice to eat healthy, work hard and raise her kid. What is wrong with that? Society is annoying sometimes.","commenter_a":"What it's bad is telling people what to fucking do!!!","post_message":"“I have a kid, a six pack and no excuse.”"},{"comment_id":"10152906901509270","commenter_b":"Unreal !!! This makes me sick !!!","commenter_a":"It's just Wrong. Wanna bet the Commander in Chief authorized this crap..","post_message":""},{"comment_id":"1485464441513680","commenter_b":"ASICK woman needs to be jailed","commenter_a":"Hang them both!","post_message":"What kind of woman could do this to her own child?"},{"comment_id":"10154263730768271","commenter_b":"Perhaps MaryAnn Kosimko would like to be grabbed by the pussy too and go to war while she's at it... what ever you're smoking STOP...","commenter_a":"Yes! We need him for president! Strong! Cares for this Counrty. He's not doing this for the money- he has Money. He can't be bought!! ( not like some one) He is doing this because he wants to make American strong. We have been brow beaten for 8 years. I'm tired of that, aren't you? We need to be Strong and Proud of who we are: Citizens one a great country. We need Trump as our Leader. We don't won't a dictator.","post_message":"JUST IN: Donald Trump will hold a campaign rally in Denver Saturday night as the cherry on top of a busy week in Colorado politics, filled with visits from both major campaigns."}]
