[{"comment_id":"10158083946035206","commenter_b":"Then clean your ears out!","commenter_a":"Can someone please tell me what the heck Trump stands for because to this day i haven't heard anything positive come from out of his mouth.","post_message":"Donald J. Trump supporters describe why it's sometimes hard to be for Trump. @webpagelink"},{"comment_id":"10153265527170950","commenter_b":"Oh stfu","commenter_a":"The blood is on their hands. This is a typical reaction from a Liberal Democrat.. Like a small child they point the blame on some one or something else.. The Democrats have made California a safe haven for Illegals, Criminals and Terrorist with their Sanctuary and open border polices.. The Blood is on your hands Moon-beam.. You and your Lawless Democrats. @webpagelink","post_message":"\"Increased surveillance, creating relationships with mosques in the Muslim American community across the country. We did that after 9/11 and prevented attacks in New Jersey and all across the country.\""},{"comment_id":"1100432766685506","commenter_b":"F**k Obummer and his illegal aliens...","commenter_a":"Prayers","post_message":"OBAMA'S LEGACY: Veteran Kills Himself After Call To VA Suicide Hotline Goes To Voicemail    Meanwhile Obama Hotline For Illegal Aliens To File Complaints About Border Patrol Remains Fully Staffed"},{"comment_id":"10153583881674087","commenter_b":"What Hillary Clinton is going to do about the unpaid maternity leave that women have to take there is no coverage for that in the United States","commenter_a":"Nancy was backing trump","post_message":"Hillary Clinton will leave the campaign trail on Friday to attend the funeral of Nancy Reagan and pay her respects to her fellow former First Lady who passed away this week at the age of 94."},{"comment_id":"465878743536720","commenter_b":"Wake up lady.","commenter_a":"if you think Trump loves America, why does he insult everyone and everything??? And Obama has done more for the middle class than many previous presidents.","post_message":"U.S. Democratic presidential candidate Hillary Clinton says she's \"appalled\" after Donald Trump declined to correct a man who called President Obama a Muslim and non-American during a town hall event. Was she right?"},{"comment_id":"10153391344478352","commenter_b":"Crazy mother sucker","commenter_a":"Oh boy! Here we go! Before it starts, dont blame nothing on Islam.They went blowing up people out of their own desires.Islam had nothing to do with it.","post_message":"Car-jacking victim of Boston bombers tells court how they admitted to terror attack, demanded GPS to get them to New York and played CDs of ‘religious music’"},{"comment_id":"10153559640036051","commenter_b":"This post gave me cancer all over again....","commenter_a":"I support guns. I love them. I have some. They are for Huntin. I believe we should be able to own guns. But this Type of rifle. I think our militry And police is the only ones who should have this kind of gun. What does a deer hunter need with somethin like that. I think somethin like a 30-06 is plenty of gun. Or somethin similar. Not just that kind. But Nothin like Whats shown. There should be a limit. But not banned","post_message":"A federal court just ruled that a Maryland law banning citizens from owning military-style rifles is unconstitutional. Do you support the court's ruling?"}]
