[{"comment_id":"1656175608015779","commenter_b":"You go girl get the pig rapist","commenter_a":"Another one 😂","post_message":"WATCH LIVE: Donald J. Trump to face lawsuit from woman alleging sexual misconduct."},{"comment_id":"1800550493547458","commenter_b":"Good idea but im barefoot anyway","commenter_a":"@username would you use it?","post_message":"The iron horseshoe is now a thing of the past."},{"comment_id":"10154100932456968","commenter_b":"Has Steve Bannon taken over the POTUS Twitter account?","commenter_a":"Suggest that Trump and co. start keeping their mouths shut and start listening to America.","post_message":"He also threatened federal funds to UC Berkeley."},{"comment_id":"10152925844701336","commenter_b":"Yay!!! Nice yes one girl!!","commenter_a":"I've read the back of the book... And I hate to break it to ya, but the Christians win!!","post_message":"ISIS has released a new beheading video which includes a direct threat against President Obama."},{"comment_id":"10154013744111378","commenter_b":"Facepalm! So because we have rapists in this country, we should import more?","commenter_a":"No more refugees! Too many of them seem to be mentally ill.","post_message":"Olango arrived in the U.S. in 1991 as a refugee from Uganda."},{"comment_id":"10154412077781323","commenter_b":"Italy isn't doing anything, yeah neither is Nigeria, or the Nigerian women that are the madams of these places.","commenter_a":"Italy allowing this to happen in plain sight. It's blatant and brazen and on the roads in broad daylight. The country should be in uproar, but no one does anything about it, not the government, not the vatican.....shameful.","post_message":"Thousands of women and girls are being trafficked to Italy from Nigeria, into a life of forced prostitution. Abused and desperately vulnerable, they have a champion in Princess Okokon, who was herself trafficked from Nigeria in 1999. Okokon fled her captors, and, with her husband, set up the NGO Piam Onlus Asti. Together they have helped hundreds of women in Asti and Sicily to escape their traffickers, giving them refuge and support."},{"comment_id":"10153438446318984","commenter_b":"Give her nothing she encouraged the animals","commenter_a":"hire the thugs who destroyed, burned, looted and rampaged in your streets...serves 2 purposes, gives them a job, gets them off aid, and the plus........your city gets cleaned up by those who wrecked it, with your permission..so use your dollars, not mine","post_message":"The fact that she expects Americans to do THIS for her after the things she's said and the way she handled the riots is truly mind boggling. Are you outraged by the Baltimore mayor's request?"}]
