[{"comment_id":"10153686388831320","commenter_b":"Disgusting these women","commenter_a":"I know it's o.k.-u know it's o.k.-get over it. body paint is o.k.- don't go if it's NOT o.k. w/u!- nuff said??","post_message":"Art or offensive? Women in nothing more than body paint and a thong are taking pictures with tourists in Times Square. How do you feel about what they do? @webpagelink"},{"comment_id":"996887350366269","commenter_b":"Democratic Presidential Debate CLINTON vs SANDERS --- @webpagelink","commenter_a":"I drove 4.5 hours to Flint, Michigan, this week from Toronto, Canada, to volunteer my time on the @username campaign in the days leading up to the Michigan Primary. The people who work in Bernie's Flint office are passionate people with a strong desire to change America and help the people of Flint. I have actually never seen such an example of government neglect in my life. I spent a significant amount of time handing out water, door to door, and I still can't shake the feeling of being helpless - I felt helpless that I couldn't do anything to help them and I felt even more helpless that no one else was doing anything to help them either. I am not an American, but I know that America is better than this. No civilized society should allow hundreds of thousands of their own people to be neglected and abandoned ...","post_message":"The governor of Michigan must resign, but more importantly we must take action to help the people of Flint. Children in America should not be poisoned. The federal government must act. No one should pay a water bill for poisoned water. #DemDebate"},{"comment_id":"838491256240234","commenter_b":"Please go back to whatever planet you came from!!!! Haven't we had enough of her?","commenter_a":"Oy! She is no longer relevant, though she keeps trying to be. Now just looks foolsih. Very sad.....","post_message":"They're back! The Palins are trying to horn in on the Duggar spotlight, regardless of how grimy."},{"comment_id":"1223281327711322","commenter_b":"PUT HER IN JAIL.","commenter_a":"They couldn't vote for her if she was in prison where she belongs America needs JUSTICE","post_message":"Read WHY!! @webpagelink"},{"comment_id":"10153266614821336","commenter_b":"California has been sicking for some time! One of the things liberals in CA like to do is drive companies out of the state! Also turn off the water to the small farmers, that put 40,000 farm works out of work! Keep building houses when they don't have the water to supply to them. Build a high speed rail road that no one wants or needs!","commenter_a":"Hard to find anything dumber than a California Democrat.","post_message":"Nobody's laughing, Rep. Loretta Sanchez."},{"comment_id":"10153573907066509","commenter_b":"She couldn't bring women down, only herself!","commenter_a":"I don't want to swear.... but.....way to go bringing the equality movement down a peg! !!! You really didn't think that one all the way thru!!!! :(","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"},{"comment_id":"10153302141658812","commenter_b":"women wearing tuxs are on fashion runways @webpagelink so why can't she wear one?","commenter_a":"Every single girl should show up in a tux, and every single guy should show up in a dress.","post_message":"Principal says gay student can't wear tuxedo to prom. @webpagelink"}]
