[{"comment_id":"10153573991208132","commenter_b":"Officer Donahue is a true hero","commenter_a":"My cat Quacks too!","post_message":"So. Many. Feelings."},{"comment_id":"10153326562398812","commenter_b":"Oh really? If that had been me, or any other black woman in this country, our black asses would have been thrown under the Jail the first time it happened and my children would have been taken from me with no chance of hardly seeing them let alone getting them back! They would charge me with felony endanderment also! But these two ol'birds get a second chance to do it and even have entitled it 'Free Range Parenting'! Ain't that somethin'! Exploring their independence would happen when they are of the age of independence. If you still write them off on your taxes, you are responsible for them! And just what are these wonderful parents doing while these babies are at the park and walking alone through town for any demented minded criminal to snatch?? SMH! I tell you, it must be nice to live by your own laws and ...","commenter_a":"So it's now a crime for parents to let their kids go to the park? What are they suppose to do put them on a leash and take them out for walkies.","post_message":"UPDATE: 2 Maryland \"free range\" children taken into custody again: @webpagelink"},{"comment_id":"1571850159771728","commenter_b":"Wish you would replace Pelosi!!!! Sick of her!","commenter_a":"Hopefully she'll endorse the only true Constitutionalist Conservative, Ted Cruz.","post_message":"This campaign was always about citizenship—taking back our country from a political class that only serves the big, the powerful, the wealthy, and the well connected. Election after election, the same empty promises are made and the same poll-tested stump speeches are given, but nothing changes. I've said throughout this campaign that I will not sit down and be quiet. I'm not going to start now. While I suspend my candidacy today, I will continue to travel this country and fight for those Americans who refuse to settle for the way things are and a status quo that no longer works for them. Our Republican Party must fight alongside these Americans as well. We must end crony capitalism by fighting the policies that allow it to flourish. We must fix our festering problems by holding our bloated, inept government bureaucracy accountable. Republicans must stand for conservative principles that lift people ..."},{"comment_id":"10153973412478854","commenter_b":"Move your black Ass ,no one cares.","commenter_a":"U Have Become Despicable & Have No Class.","post_message":""},{"comment_id":"1197872970239356","commenter_b":"Whites will not destroy their own houses and businesses. Waste of time and money.","commenter_a":"Where is the outrage from Obama on this regarding this racial hate crime? Where are the white rioters?","post_message":"Let's hope that Obama expresses sympathy for the white victims of the #VirginiaShooting and not for the gay black shooter."},{"comment_id":"905819366142682","commenter_b":"@username if u want to have sex, pay for your birth control. If u don't want to take the chance on getting pregnant, keep your legs together. We should not have to pay for your wants or needs.","commenter_a":"Blunt doesn't think women should have access to birth control and then blocks them from getting an abortion for an unwanted and unplanned for pregnancy.","post_message":"Every day, families in Missouri and nationwide provide loving and safe homes to children in need through adoption. I’m proud to serve as the co-chair of the bipartisan Congressional Coalition on Adoption, and I’ll continue my efforts to help children in need."},{"comment_id":"519948784859162","commenter_b":"They should be deported","commenter_a":"yes","post_message":"Students Replace ‘Under God’ With ‘Under Allah’ In Pledge. If you are going to live in our country, you should respect our culture. Do you think this is wrong?"}]
