[{"comment_id":"1061299707312818","commenter_b":"What an ass! Leave already.","commenter_a":"yah these dumbASSES are going to tell me to be tolerant with the beheading of CHRISTIANS in the MIDDLE EAST, hay DUMBass just cause a lot of people cannot believe that you are a focking muzlum dose not mean I'm going to kiss the muzlumz assss as they behead more Christians, BTW who the fock are you to tell us to be tolerant with the shayton muzlumz? name one Christian that has beheaded a muzlum this month, or this year, or even this century, you bass TURD have allowed so many innocent Christians to be killed by your demonic muzlum family, you have their blood on your hands, and their blood is crying out to GOD ALMIGHTY FOR JUSTICE. allahoooo ACHK BARR and GRILL YOU FOCKING BASS TURD.","post_message":"The Obamas have always gleefully kicked Christians to the curb during Christmas. This year was no different."},{"comment_id":"829690333773863","commenter_b":"The black community needs to clean up their act, plain and simple.","commenter_a":"This type of person should not be free.","post_message":""},{"comment_id":"10152800082481051","commenter_b":"Should have killed the scumbag the first time !!!","commenter_a":"It was a domestic violence crime, that should have kept him behind bars. You figure out why.","post_message":"This guy was released after admitting to stabbing a woman to death in front of her children. Guess what he did one month later."},{"comment_id":"1456373527716006","commenter_b":"secede already and take your cousin wife with you and all the other uneducated ignorant trash with you. Republican policies fail every time and only uneducated idiots do not see the truth that is why your state doesn't believe in education","commenter_a":"Once again......Trump was right!!! And that kills the over sensitive lefties.....","post_message":"Trump once remarked to a \"Celebrity Apprentice\" contestant that it \"must be a pretty picture, you dropping to your knees.\""},{"comment_id":"10153573127079268","commenter_b":"then get up lock n load and go fight..i dint want my kid dying for your stupid ass. Wordy @username","commenter_a":"\"Republicans trying to find a way to go to war and make their sugar daddies happy.\"","post_message":"The House is looking for a loophole."},{"comment_id":"10153526773721350","commenter_b":"Those hips are MALE hips!","commenter_a":"She look so stunning & beautiful tonight","post_message":"Caitlyn Jenner shared some very powerful words from the podium."},{"comment_id":"1750956915163116","commenter_b":"Leave voters have woken up, it's time for these people to accept this country belong to people who have been here for centuries. The racist abuse that comes from people who have no rights to be here, is killing our country. EU is based on lies and corruption, people need to be protected from people who have no respect for the British people. Immigration need to be stamped out people who are not suppose to be here should be returned home. Enough of the rubbish people keep trying to push the boundaries of the country to an extent of hatered breeding in a peaceful country. Stay campaign maybe help all those who have no rights to be here, leave campaign had been made to rebuild their country for those who live for the moment.","commenter_a":"A \"so-called\" majority can be wrong. The referendum was a bad idea. The parliament are the elected representatives meant to lead and decide. It's a bad outcome for everyone, and is a very bad example to all in the world on how to get along in the global economy, and especially from a social perspective. We live on the same planet. We're not going anywhere else soon. We should share it. Borders are historically recent and arbitrary. Nationality is random (not a choice where you are born, just luck). It is not the most important thing. We all belong to the same human race.","post_message":"Join our live debate and tell us where you stand on a second referendum on leaving the EU."}]
