[{"comment_id":"640946546065952","commenter_b":"So support Hillary who takes millions of dollars from countries that practice Sharia law that kill women and kill gays for no reason! Also who's husband is a known sexual abuser and a rapist and she persecuted the sexually abused victims of her husband. Yet Hillary said she supports women's rights, what a joke. Wake up ladies!!! I'm wondering if Hillary hired these people to go there and start riots. Hillary Clinton is a evil corrupt woman who is mentally, physically and morally unfit to be our commander in chief!","commenter_a":"Go Trump.","post_message":"We're LIVE from Trump Tower New York, where the National Organization for Women (NOW) is leading an anti- Donald J. Trump protest."},{"comment_id":"10154077308573128","commenter_b":"would they let someone come in and do this to the liars Scruz and Ruby!","commenter_a":"When's the next GOP Debate?","post_message":"Republican leaders who had hoped Trump would stumble on Super Tuesday now face tough choices, writes Gerald F. Seib."},{"comment_id":"10153126250487452","commenter_b":"But she could've let the staff know so they wouldn't bother her. Or find a private, cleaner place than the toilet to do it. Why do people feel so goddamn entitled? People relieving their bladders are important, too, and they can't do that at their seats. Some people need to grow up and realize the world doesn't revolve around your areola","commenter_a":"I have one kidney and would hate to have to sit and wait and wait and wait to use the restroom because she wants the bathroom for an extended period of time. This has nothing to do with breastfeeding and everything to do with being inconsiderate.","post_message":"An Arizona mom claims she was reprimanded by a flight attendant for pumping breast milk in an airplane bathroom."},{"comment_id":"1781647542076913","commenter_b":"I know that's Ivanka on the right, who's that chick on the left side?","commenter_a":"We need a food addict intervention for Mr. Moore. A good barber, too.","post_message":"Michael Moore is a ____________."},{"comment_id":"10154058784600044","commenter_b":"Classy fucking skank whore right there. Haha","commenter_a":"Kick her in the pussy","post_message":"Feminist Protestor Assaults Infowars Reporter Owen Shroyer"},{"comment_id":"10153475591131051","commenter_b":"What a real sick bitch needs to go down for good she dont need her other kids go down bitch","commenter_a":"Prayers for that baby girl","post_message":"When residents here stumbled across an alcoholic mother trying to eat her own daughter alive, they decided to handle the situation personally."},{"comment_id":"1180323918655284","commenter_b":"My cats r broken, both are at best apathetic toward boxes, at worst terrified of them, depending entirely on size and location","commenter_a":"Elizabeth Dain","post_message":"Happy international cat day!  Here's a question for you - why do cats love boxes so damn much?  Find out: bit.ly/1zUeu4c"}]
