[{"comment_id":"1859871360913002","commenter_b":"Can we please build that wall around his ugly face and throw dirt in his mouth!","commenter_a":"GEEZ LET THAT MAN BUILD THE WALL ... @webpagelink","post_message":"\"We will build a great wall along the southern border,\" Donald J. Trump told a crowd in Phoenix, Arizona, during his immigration speech. After a long pause, he continued: \"And Mexico will pay for the wall.\" @webpagelink"},{"comment_id":"1139554482745590","commenter_b":"@username our military is nothing aftef these last 8 years and you are truly misinformed and your misunderstanding what is goin on..he wants open boarders to legal immigrants..he doesn't want to stop legal immigration he wants to stop the illegals so we know who is coming into our country...you are the problem..the Lord gave you a brain..please go exercise it..","commenter_a":"It's my first time voting and I'll be voting for Trump today in Arizona!","post_message":"I have proven to be far more correct about terrorism than anybody--- and it’s not even close. Hopefully Arizona and Utah will be voting for me today!"},{"comment_id":"10153340865359087","commenter_b":"MONEY KEEPS U OUT OF JAIL QUILTY OR NOT u can make bail u are out","commenter_a":"Don't want to go to prison, don't break the law. It's that simple!","post_message":"“It is wrong for corporations to be making profits from the incarcerations of their fellow Americans,” Bernie Sanders said. “I want to see incentives to get people out of jail or prevent people from going into jail.”"},{"comment_id":"10153021428690399","commenter_b":"Karma is a bitch","commenter_a":"Bet he declares bankruptcy and sticks us with the bill. Typical freeloading conservative.","post_message":"smdh"},{"comment_id":"1661235427481336","commenter_b":"We need the wall Canada has a wall but i forgot all the famers might lose there free lador","commenter_a":"hahaha... a very accurate comparison! Lol.","post_message":"\"On Feb. 9, we trust New Hampshire Republicans will send 'Biff Trump' back to somewhere — anywhere but on the road to the most important elective office in the United States at a most crucial time for this nation.\""},{"comment_id":"835204176588028","commenter_b":"Girl really baby get check","commenter_a":"Its that flu you cant shake.","post_message":"Oh my"},{"comment_id":"10153070826933701","commenter_b":"hes a fag it","commenter_a":"Nope!","post_message":"Heisman winner Marcus Mariota on the loss of wide receiver Darren Carrington to a failed drug test: \"We'll get another guy that's ready to go.\""}]
