[{"comment_id":"10153421775308352","commenter_b":"oh you beat me to it....damn,are those tits real","commenter_a":"I'd raid her too, looking like that!","post_message":"Police raid pot club of Alaskan reporter who quit her job live on air to fight for legalized weed, after reports surfaced of illegal marijuana sales"},{"comment_id":"10153407342318352","commenter_b":"I meant, Beast-like BITCH.","commenter_a":"Nothing these beasts say even shocks me anymore.","post_message":"'I just don't like the black kids': Middle school vice principal is suspended after being filmed making outrageous comment on camera"},{"comment_id":"820349888068915","commenter_b":"No she does not!","commenter_a":"@username Melinda Caskey @username Angela Fisher Claudia Billings @username","post_message":"Hillary Clinton says she’s tired of Bernie Sanders’s campaign lying about her. The only problem is he’s not lying, she is."},{"comment_id":"1032023936930784","commenter_b":"Dear God if people did this to the Obama girls everyone would be pissed","commenter_a":"Sick freaking guy that Spinola..Ugh.","post_message":"Oh, Hell no..."},{"comment_id":"10153617313036051","commenter_b":"Lazy ass bitch","commenter_a":"Is this for real?","post_message":"This 61-year-old woman and her jobless boyfriend live entirely off government benefits. Now, they have yet another request. When you find out what they want, you're going to be outraged."},{"comment_id":"10154563644004087","commenter_b":"With the illegals being deported Shitlarys vote count drops","commenter_a":"Funny but if you libturds went to Mexico and tried to live and work there illegally you would end up in prison. Libturds want open borders for cheap votes, no matter how much it harms America. See: \"The Reason Trump Got Elected\" for further reference.","post_message":"The Congressional Hispanic Caucus is requesting a meeting with U.S. Immigration and Customs Enforcement after more than 300 undocumented immigrants were arrested in raids over a 48-hour time span."},{"comment_id":"685062714983869","commenter_b":"So...when will they let Ted Nugent or Trey Gowdy be a moderator?","commenter_a":"Why Matt Lyer? What a CREEP!","post_message":"CLINTON, TRUMP SQUARE OFF"}]
