[{"comment_id":"10153254451090671","commenter_b":"and that's why you women are pathetic ladies should not twist my words around","commenter_a":"most women are less productive as far as in the construction field is concerned but in the construction field I think they are paid the same I don't like working with women every time I do I have to work harder just to keep the same production schedule going","post_message":"Under the new law, an employer must show the “differences in wages are due to factors other than gender, that the factor is job related and reasonable and that these factors, rather than discrimination, account for the difference in pay.”"},{"comment_id":"745823678941543","commenter_b":"get her out","commenter_a":"Bye dumbass!","post_message":"Whoopi Goldberg To Leave The Country For THIS Awesome Reason It's about time. We don't want you here anyway. Can we get 30,000 'LIKES' to have Whoopi leave the country?"},{"comment_id":"1661235427481336","commenter_b":"We need the wall Canada has a wall but i forgot all the famers might lose there free lador","commenter_a":"hahaha... a very accurate comparison! Lol.","post_message":"\"On Feb. 9, we trust New Hampshire Republicans will send 'Biff Trump' back to somewhere — anywhere but on the road to the most important elective office in the United States at a most crucial time for this nation.\""},{"comment_id":"10154362181546077","commenter_b":"Put her in jail","commenter_a":"Go Trump!!","post_message":"Donald Trump rally live in Greeley"},{"comment_id":"10153505844154714","commenter_b":"But THEY can't have their own..male with male doesn't make babies","commenter_a":"You made a typo. You said \"her family\". You mean Bruce spent the day with his family.","post_message":"It was Caitlyn Jenner's first Father's Day as an out trans woman."},{"comment_id":"10154944401159641","commenter_b":"Build your 100ft wall and I'll show you the 100 ft ladder what a waste of tax payer dollars America your Fired!","commenter_a":"Mexico needs the US more than we need them- they will pay- one way or another- leverage is a powerful tool and Mexico doesn't have a leg to stand on","post_message":"JUST IN: President Donald J. Trump says construction on a US-Mexico border wall will begin \"as soon as we can” adding that US taxpayers would foot the bill initially, but Mexico will eventually provide reimbursement funds @webpagelink"},{"comment_id":"545649178956022","commenter_b":"I've held that Cruz is probably more dangerous than trump because he has all the bigotry and hate but he is actually serious about it as opposed to trump who is just a bizarre orange man who is saying what he needs to get elected.","commenter_a":"Is that so? Then he's an even bigger idiot than I thought","post_message":"Ted Cruz knew exactly what he was doing by not outright endorsing Donald J. Trump."}]
