[{"comment_id":"550023351824286","commenter_b":"Funny Denis.","commenter_a":"Good for North Korea, we have missiles why can't they","post_message":"The rocket was launched on a southward trajectory, as planned, passing over Japan's southern Okinawa islands."},{"comment_id":"1056254801076607","commenter_b":"That's funny but I don't think you could trust Rubio on the border. He's too in to amnesty and letting illegals in.","commenter_a":"Won't it be great when Trump is President , and Rubio is reassigned to mixing cement on the Mexican border ?","post_message":"BOOM!!!"},{"comment_id":"10154593126179614","commenter_b":"Kassandra Alvarez","commenter_a":"Women beater no mercy for him","post_message":"Update: Chris Brown has been transported to downtown Los Angeles where he is expected to be arrested on suspicion of assault with a deadly weapon.   The singer initially refused to come outside and was not allowing police into his home, an LAPD official said."},{"comment_id":"541947015995878","commenter_b":"Impeach this peace of crap in the WH !","commenter_a":"boo the windbag muslim !","post_message":"Americans are furious after Obama hammers christians on TV.  What disrespect. He's gone too far with this.   Do you think Obama is out of line?"},{"comment_id":"10153000077314197","commenter_b":"I prefer the old style plates. And I believe undocumented residents should not be allowed to obtain a driver's license. There must be a hidden agenda here.","commenter_a":"The old one is much better!","post_message":"Which Connecticut license plate do you prefer?  What do you think about undocumented residents getting driver licenses? Watch Dennis House interview the new DMV Commissioner today at 11 on Face the State @webpagelink"},{"comment_id":"1057942617592596","commenter_b":"@username go choke on some bacon goat humper","commenter_a":"Just so I'm clear, Hillary supports illegal aliens coming over here and doesn't support Donald J. Trump wall, but builds a wall to keep Americans out of the DNC? OK, that makes sense....","post_message":""},{"comment_id":"895006600536681","commenter_b":"You gotta wonder where all these 'virgins' are supposed to come from... What a bunch of head-banging fools.","commenter_a":"They might be running out of virgins soon... The LEO that sent them packing, Thank you","post_message":"Officer who was shot by two gunmen outside free speech event in Texas has reportedly been released from the hospital.   The two gunmen are dead."}]
