[{"comment_id":"10153991017722235","commenter_b":"If you give a lady $10 and rape her, it doesn't make her a prostitute. It makes you a rapist.","commenter_a":"Georgia, Georgia, what are you doing. You were devastated in the civil war for your enslavement of people now you demonstrate you might need another lesson. Someone dig up General Sherman.","post_message":"YES!"},{"comment_id":"10152987199648645","commenter_b":"We are fed up with illegals and their anchor babies.","commenter_a":"What an idiot!! Those poor children! Obviously the program was already english hence the translator for the parents. Have some compassion and MANNERS!!!","post_message":"Witnesses at the Kindergarten concert said the man stood up as a Spanish translator began speaking and repeatedly shouted ! English only!"},{"comment_id":"10153832600184087","commenter_b":"She is simply unwilling to burn her country to the ground with a Trump presidency. That makes her a phony? Good grief.","commenter_a":"Elizabeth Warren is a phony. I am so disappointed. I wish I had never donated to her campaign. She is trash. They can put her on the ticket as their little bone to throw at progressives, but I am not biting. #stillSanders","post_message":"Elizabeth Warren will meet with Hillary Clinton Friday morning just hours after hinting she would be open to being Clinton's vice president."},{"comment_id":"1241458632577946","commenter_b":"@username I speak the same to everyone. But no one slaps me. And a pussy like you certainly wouldnt be the one to slap me. But as I stated in the original post. Plant some fucking trees if you don't like it.","commenter_a":"Yea and collapse the economy in less than 2 years. Get educated dumb ass. If you care for trees so fucking much then get the fuck off of Facebook and go plant some trees.","post_message":""},{"comment_id":"997862486926485","commenter_b":"She also set up a GoFundMe account. It's a publicity stunt to make money. She's a nasty person","commenter_a":"She showed she had class. Love this story.","post_message":"Two women called this mom a \"whale\" because of her size, what she did next is truly remarkable: @webpagelink"},{"comment_id":"1078205312195129","commenter_b":"She will walk! MSM will guarantee it.","commenter_a":"She served on the Watergate committee. That's where she got the idea. Hillary did get fired from that commission for lieing. She is the original old crony.","post_message":"Hell, Nixon only erased 18 minutes. Hillary erased literally everything."},{"comment_id":"10154247175501680","commenter_b":"I've seen you post this exact thing, verbatim, on another posting. Are you just copy/pasting on all the posts? If so, I would spend some time on grammar and punctuation because this is completely incoherent. I've tried 2xs to understand what you are saying but i give up by the second run on sentence...","commenter_a":"Trump return dodd-frank law to gang of bail out banks to reduce their power and to transfer it to the people of usa and to stop fraud in the stock market stealing from workers ,middle class investors and retirement funds and reduce USA world's record inequality ,legacy of lawless obama.They will have to pay you your part anyway because if not you send them to jail for using privileged info all together for stock trading,take gang of bail out banks the license to steal with stock market and reduce their money to pay for protests ,lies, to bribe GOP politicians and to own Democrat party.take the financial resources from the establishment.FREE USA.return power to USA people.Make america great again.,there is more freedom in china than usa ,with gang of bail out banks holding power here since they brought obama to powerThere was another fair solution for banks ,was to bring ...","post_message":"The best guide to what Donald J. Trump would do as president appears to be what he said he would do as president."}]
