[{"comment_id":"10153950458738690","commenter_b":"Actually another problem is that we have a long border with Afghanistan which is called Durand Line and Afghanistan does not accept it as an International Border and those terrorists move in between both countries and attack and then we blame to each others.","commenter_a":"This the same Pakistan my country Nigeria, training army to fight terrorism, have Pakistan already solved there Taliban terrorist? Terrorist are political party, negotiations is the solution to terrorism.","post_message":"At least 12 dead as suicide bomber on a motorbike crashes into government office."},{"comment_id":"10153572357110667","commenter_b":"Penny Henderson can you imagine all the hysterical women...","commenter_a":"There are no wrongs or rights in that situation.. But... I wish everyone had gone quiet and not screamed out, if everyone was silent I wonder would the animal have behaved differently.. Just a thought.. And if the animal was not scared by the screaming, perhaps a tranquilizer shot could have been used... Perhaps we need to have some strict guidelines for us humans visiting zoos,","post_message":"If a tranquilizer dart, which takes five minutes to 10 minutes to work, had riled Harambe, the child might have been killed. Imagine the uproar then.  More from USA TODAY Opinion:"},{"comment_id":"1040915009338084","commenter_b":"@username your argument fails in a few ways. 1. A child is not a child until it is born. 2. Her body, her right. 3. What if she was suffering complications from said pregnancy? What if she was raped? What if it was incest? Would you still argue that she hasn't the right? Because if so, you're giving a living woman less bodily autonomy than a corpse.","commenter_a":"good","post_message":"There has been no time since Roe v. Wade when abortion hasn’t been under attack... But this moment is different."},{"comment_id":"716711075186137","commenter_b":"Then go back home. Get out of America. We don't want you Islam or Sharia law.","commenter_a":"If that is what they want, I would assume they would be buying airline tickets for a flight back to a Muslims country.","post_message":"Muslims Try To Pass Sharia Law In Alabama So Citizens Do THIS.  We live under the law of the constitution. They are taking a stand.   Do you support these patriots?"},{"comment_id":"10154244618664205","commenter_b":"Hillary Clinton is the Jerk of the year, because she put her personal ambition to be President, ahead of the welfare and safety of the vast majority of the American people!!!! Now we are all faced with the train wreck, of Donald Trump, with the nuclear launch codes at his incompetent finger tips!!!","commenter_a":"I vote Yank Jerkin \"off\" as #1. :-)","post_message":"Get in your last minute votes, before it's too late. @webpagelink"},{"comment_id":"724107867720000","commenter_b":"send thim all home, they dont belong in the USA.","commenter_a":"you dont like our flag go home","post_message":""},{"comment_id":"10152845458146336","commenter_b":"you must be of yourr meds you moronic female","commenter_a":"A million and a half babies aborted each year in the United States and we are horrified by this?","post_message":"Zookeepers were horrified to discover 5-week-old cubs had been killed and eaten by their mother."}]
