[{"comment_id":"1739251936290298","commenter_b":"exactly. Women belong in the kitchen, this is stupid.","commenter_a":"Great. Ahmed, the suicide bomber, will be next. Anything to appease the muslims, right?","post_message":"The six-year-old girl is the first-ever Afghan Muppet, and she is aimed at promoting female empowerment in Afghanistan."},{"comment_id":"10153210976889726","commenter_b":"The love affair begins","commenter_a":"How much are the promises he made going to cost us this time?","post_message":"WATCH: Obama and Castro sit side by side!"},{"comment_id":"1181915768493312","commenter_b":"This bitch is just flat out stupid.","commenter_a":"Die cunt!!!","post_message":"Hillary Clinton on Wednesday again criticized Sen. Bernie Sanders, for his stance on legal immunity for gun manufacturers."},{"comment_id":"10155060869437439","commenter_b":"(HOW DID A MUSLIM GET IN THE POLICE FORCE ANYWAY WE ARE AMERICANS????????????","commenter_a":"a phony bitch sitting next to an absolute idiot.....","post_message":"Police officers are being targeted for murder. Black Lives Matter has put a bounty on their heads. NYC Mayor Bill de Blasio has not supported the police. But Mayor Bill de Blasio calls an urgent press conference on \"anti-Muslim\" crime after a Muslim police officer claims to have been offended."},{"comment_id":"985965458116748","commenter_b":"Crazy witch","commenter_a":"This is murder , God forgive us if we don't stop this","post_message":"Pro-abortion Congresswoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb. baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"1000913466673540","commenter_b":"Trounce her lying ass!","commenter_a":"Don't run like Romney....","post_message":"Take our new CLASH Poll. Should Donald J. Trump play nice or ... should he put The Hildebeest on ICE? @webpagelink"},{"comment_id":"10152826899201051","commenter_b":"How would she like if someone caught her on fire in a cage! This woman is sick!","commenter_a":"Put her in cage, set on fire","post_message":"First she made sure the puppies were securely locked up in the pet shop. Then she set it on fire."}]
