[{"comment_id":"10154948296594203","commenter_b":"all the illegals voted too..","commenter_a":"Hillary has 2,017,563 extra votes then Trump. The difference of extra Two Million+ vote which can give a decisive victory to a candidate 'anywhere else in the world' has ZERO value in America?","post_message":"BREAKING."},{"comment_id":"10155314611590652","commenter_b":"hahaha! this is amazing","commenter_a":"'@username apparently the jar of mayonnaise episode anticipated this.","post_message":"'Life is best when it's a bit strange.'  This weird new reality show has millions of people pretty much watching paint dry:"},{"comment_id":"1858209934411861","commenter_b":"She just needs to fuck off and die!!!!","commenter_a":"You should be out of Washington altogether forever..and out of California. We really don't want you here or representing us in any way.","post_message":"Pelosi calls FBI Director Comey's letter about the investigation into emails related to Clinton's server before the election a 'foul deed' and should be investigated. Do you agree?"},{"comment_id":"10152603189787894","commenter_b":"She's Just NASTY & wants White people to think it's a Race thing","commenter_a":"Nasty bitch","post_message":"Say What Now? Naya Rivera Insists White People Shower More Than 'Ethnics' on 'The View' [Video]"},{"comment_id":"10153672286196336","commenter_b":"Round em up and send them back to where they come from all illegals","commenter_a":"we are fed up with you're racist personality and we are fed up with you're disrespecting toward women","post_message":"'People are fed up. They're fed up with incompetence and they're fed up with stupidity.'  This morning, Donald J. Trump called in to 'FOX & Friends Weekend,' and shared his take on the national mood and the Iran deal."},{"comment_id":"1761764947438429","commenter_b":"'@username you do realize Hilary wants to deport illegal immigrants too right? She announced it this last week.","commenter_a":"Women should feel insulted that the first female ever to be nominated also happens to be a corrupt, cold, calculating, ruthless, lying crook. If we're going to give the distinction of 'first woman nominee' or, God forbid, 'first woman president' to anyone, she is, quite literally, the last woman in the country who deserves the honor.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1763955337222403","commenter_b":"Women over 65 don't have to wear them...lol","commenter_a":"If there was a young Muslim man in America...and Donald Trump was elected by popular vote to pass hateful laws against Muslims...How easy would it be to radicalize them against a nation that has rejected them? Trump is exactly what ISIS wants.","post_message":"Donald J. Trump campaign chair Paul Manafort fired back after President Obama said the New York billionaire's comments about Islam are 'ultimately helping do ISIL's work.'  @webpagelink"}]
