[{"comment_id":"10152918950086336","commenter_b":"What a doll!","commenter_a":"What a cutie and smart too!","post_message":"An incredibly brave 4-year-old girl is being credited with saving her pregnant mother who suffered a seizure and couldn't reach the phone."},{"comment_id":"632963596894219","commenter_b":"No one with half a brain watches her ANYWAY!!!","commenter_a":"WHO'S OPRAH","post_message":"People are finally getting fed up with Oprah... Great. Let's get this hack off the air once and for all. Should Oprah be kicked off TV?"},{"comment_id":"10153185971496955","commenter_b":"shoot the illegals","commenter_a":"...and they wonder why we don't trust the police...!","post_message":"California Deputies Are Taped Beating Man in Bizarre Desert Horse Chase... 'Ugly'..."},{"comment_id":"1329814237089560","commenter_b":"These seem so handy","commenter_a":"This feels like a Savannah thing.","post_message":"If there's one thing we can all agree on, it's that tying shoelaces is the worst: @webpagelink"},{"comment_id":"10153043180073984","commenter_b":"Finally someone with a backbone. Why is the rest of the media supporting this evil by not showing the world their true nature?","commenter_a":"Close this guy and his mosque DOWN...","post_message":"Wow, what this guy tells Hannity about the awful Paris terror attack - how he defends the killers' actions...well, see for yourself.. Do you believe radical Islam is the enemy of civilization?"},{"comment_id":"970408816303922","commenter_b":"John, women don't care what you think is acceptable. Abortion is a legal medical procedure. Women don't need your approval, your acceptance, or your opinion. Do you expect women you've never met to weigh in on your private medical decisions? Of course not! Stop being so arrogant. What isn't acceptable is your flawed thinking that you can control a woman. You can only control yourself.","commenter_a":"\"Birth control\" is a misnomer. If one thinks about it, it signifies controlling an already conceived being. Therefore, i do not embrace birth control. Like stopping birth. I do embrace control prior to the embryo attaching itself to the wall of the uterus. We need to find a name for that.","post_message":"How you REALLY stop unintended pregnancies."},{"comment_id":"10154008919327439","commenter_b":"I cant stand these lying disgusting woman abusing savage animals MUSLIM MEN","commenter_a":"Didn't take long for \"moderate\", \"peaceful\" muslims to take on a new tactic. One that the liberal media will blame on Christians. These followers of allah/satan are true examples of evil!","post_message":"ISIS has issued a handbook for Muslims in the West. The gist of the instruction booklet is the necessity to blend in with the western way of life and to avoid ‘looking like a Muslim’ - pretend to be Christian -- so as to stay below the radar of the security services. This is important. It is key to understanding the enemy and their tactics. The media and the Democrats are deliberately misleading the public. You must educate yourself and those around you. Share this article on Facebook, Twitter, email. Build our army."}]
