[{"comment_id":"10153363875728352","commenter_b":"We all need a break dumbass bitch but you don't see us throwing our kids out the car !!","commenter_a":"Yep she look like she need a BREAK!","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"},{"comment_id":"820349888068915","commenter_b":"No she does not!","commenter_a":"@username Melinda Caskey @username Angela Fisher Claudia Billings @username","post_message":"Hillary Clinton says she’s tired of Bernie Sanders’s campaign lying about her. The only problem is he’s not lying, she is."},{"comment_id":"1507272636242022","commenter_b":"@username, that is exactly what Americans are so angry about , is our own traitorous bunches of Bureaucratic terrorists that not only has funded but brought into our own country on our own American soil, these terrorists that they somehow continue to push on the public and is why Trump stood up and heard American peoples complaint, not one politician up in that white house is a true American, or else they would have long ago removed the terrorists as well as not funded them with the peoples hard earned tax dollars, all Trump is saying is know whom we are allowing into our country, something the now Manics in the white house are not doing..","commenter_a":"Yeah Donald Trump is protecting Americans. Maybe if some of his supporters read a little about Hitler and Nazi Germany, they would see some similarities. I mean, the Jews and Communists were plotting against the Germans, right? They did start that tragic Reichstag fire, didn't they? Oh! And let's not forget the gay people and the mentally ill! America has a problem with them too! Yeah and women too. We've just gotten all uppity during the last 40 years, trying to steal men's jobs. Send us away too. And while we're at it, let's round up the Japanese again. I mean, they attacked us once, what's to stop them from doing it again? Of course, we should forget they were mostly citizens and born here! It absolutely amazes me how many people believe this!!! It's unamerican! It's dangerous. When you start sending a group of people off like that, where ...","post_message":"This is one of the most powerful segments we've ever seen. Tom Brokaw compares Donald Trump's call to bar Muslims from America to Japanese internment, Nazi Germany, McCarthyism, and Jim Crow - and he didn't stop there. This amazing video is well worth taking a moment to watch, via NBC News"},{"comment_id":"10152597227421615","commenter_b":"Thank you....so are y'all! Oh I forgot...so is Y'all @username!","commenter_a":"Please use proper English...y'all is not a world in the English language! I guess I am racist, also!!","post_message":"#BREAKING NEWS UPDATE: A 17-year-old boy has been arrested and is facing adult charges in connection with a shooting at the Monroeville Mall last night. @webpagelink"},{"comment_id":"10153472169705667","commenter_b":"Such a wonderful thing to do.","commenter_a":"Thank you, may the Lord Bless you and your family","post_message":"Napster founder Sean Parker's cash infusion is the largest ever for cancer immunotherapy"},{"comment_id":"10153243727475667","commenter_b":"@username Ireland built America, because the locals were too lazy. Shall we continue with stereo types, girls?","commenter_a":"I assume none of you gun-lovin' yeehars will ever come over and visit civilised nations. Just keep your gun addiction fetish stateside, and you won't have a problem. Try and set foot outside of your bunker, and your shiny, highly polished barrels will be removed from you. And so your manhood shall be no more. Bless your cotton socks. :)","post_message":"You can now open carry at ticketing and baggage claim."},{"comment_id":"1032281423464900","commenter_b":"Oh please. You gotta be kidding. I will say Madcow needs the ratings for sure.","commenter_a":"When you get the guts to go on Rachel Maddow's show, please let me know.","post_message":"I talked with Fox News’ Gretchen Carlson this afternoon about the House passage of the Homeland Security Appropriations bill. As I told her, we made a commitment in December to seek to block President Obama’s lawless, unconstitutional amnesty using the \"power of the purse.\" Today we upheld that promise by doing our part to pass the strongest, most conservative bill that we could. I hope you’ll take a moment to watch."}]
