[{"comment_id":"10154089965446336","commenter_b":"Yeah, lice likes very clean hair. If you put products in their hair it's likely they won't get it. Oily hair care products are","commenter_a":"It's not super lice it's called...ignorance. Schools inform by sending a note that lice has been found in the classroom. The person is not identified at all..not even to the parent. Infested child goes untreated. Why? The same reason some are abused and some are not, the same reason some parents care about their children and others don't. Children are going untreated and/or not treated properly. This has been going on for years.","post_message":"What can you do if your child is affected?"},{"comment_id":"10154385390083132","commenter_b":"GORGEOUS","commenter_a":"'@username kitchen","post_message":"We can't decide which we love moreBritney Spears' marble kitchen or her breathtaking view.  (via People Great Ideas)"},{"comment_id":"10156788493850389","commenter_b":"My family and friends in Utah are behind Trump!","commenter_a":"Please Utah vote Trump!! He cares about We the People.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1012656692115433","commenter_b":"Is it a female? Lord have mercy she's dog ugly","commenter_a":"Racist woman","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system.  Why? Because it's against a white guy. #DNC2016"},{"comment_id":"10154897891195530","commenter_b":"'@username you kiss your mama with that nasty mouth?","commenter_a":"Trump is frightening for everyone. Period.","post_message":"There are up to 127,000 undocumented immigrants in Michigan, many of them anxious about Donald J. Trump."},{"comment_id":"10155518343016729","commenter_b":"This is a repost .....As For Barack Obama, We watched him sit for 20 years in a Church whose preacher condemned America . We watched him travel the globe apologizing for America's greatness .We watched him allow guns to be shipped to Mexican criminals so they could later turn up at crime scenes to mislead American opinion. We watched him use the IRS to punish those with opposing views . We watched him shrink America's military defences ,We watched mistreatment of our veterans , We watched the Ambassador and his protectors be left to die and be covered up by a lie , We watched our nation debt be doubled , We watched the nation's food stamps recipients climb to 25% , We watched a health care system nearly implode to promote some utopian fairy tale. We watched our police be disrespected , race relations fall to an all time ...","commenter_a":"Facebook is so liberally biased. Had this been a post by a Conservative toward Clinton or Obama supporters, the account would have been terminated. Also the person would have been fired from their position immediately. So the school not yet terminating him is garbage.","post_message":"Despicable!"},{"comment_id":"349180888539647","commenter_b":"Yeah, women's lib.","commenter_a":"I'd rather have her NOT have a romance - I thought that was the whole point!","post_message":"The hashtag #GiveElsaAGirlfriend began trending as many Twitter users voiced their support for a gay character in the Disney movie. What do you think?"}]
