[{"comment_id":"10154394638207042","commenter_b":"Christianity in mind? But what Christianity type of Christianity was happening through the genocides..? Lol never been to prison or even arrested but thanks for the weak statements 😁","commenter_a":"Crosses don't belong in public spaces much less public institutions. If you truly believe in your faith, symbols and manmade objects shouldn't matter. Actions and kindness to your neighbors should be more than enough of a display.","post_message":"CROSS COVER-UP: After one family's complaint about a cross displayed on a public school in Staten Island, it was covered up. Now, a community is outraged.   Do you think it should have been covered?"},{"comment_id":"10152697644391770","commenter_b":"Thank you for giving me a laugh at your attempts to be of value to society","commenter_a":"Honesty is not an option in Obamas picks.","post_message":"Cruz explains what McConnell SHOULD have done."},{"comment_id":"10156070915820354","commenter_b":"We all know what Jorge Ramos is full of !!","commenter_a":"No, sir you are a loud mouth rude, obnoxious piece of shit!","post_message":"Reporter?   Or Activist?"},{"comment_id":"10153447411644087","commenter_b":"Sexist.","commenter_a":"Jennifer Pinto","post_message":"“It’s imperative that you vote. I want you to vote for [Hillary Clinton]. It’s time for women to be seen as real equals,” soccer hero Abby Wambach said at an event for the Democratic front-runner. “That is one hell of a badass woman in my opinion.”"},{"comment_id":"10153053153366717","commenter_b":"I can't believe how selfish this woman really is! How can she make a whole office and try to make the whole county think the way she does?! She gives no condition the others in her office that have to work under these stressful conditions. Amazingly selfish. God must be so proud.","commenter_a":"The Devil is your boss and no she is not going to let this die","post_message":""},{"comment_id":"10153711323820695","commenter_b":"Girl, STOP!","commenter_a":"A true example of faith. My prayers go out to him and his family. They'll get what they deserve, evil doers do not prosper.","post_message":"FORGIVENESS: That's what the wife of a man shot during a home invasion is expressing as her husband recovers."},{"comment_id":"517121775126150","commenter_b":"@username. Lucile's an idiot. Just ignore her.","commenter_a":"I never defend Obummer but it's probably better to keep him out of the White House and on the golf course.","post_message":"\"There was no movement away from the golf course, according to the White House Press traveling pool, which monitors the president’s movements.\""}]
