[{"comment_id":"10153229988242293","commenter_b":"And who would that lady be? Certainly not this four times married adulterous who're?","commenter_a":"It takes lady to show the world what TRUE VALUES are; and how STAND UP in those VALUES ...!!","post_message":"Kim Davis entered the Carter County Detention Center under cover of night five days ago. She emerged to Survivor’s “Eye of the Tiger.”"},{"comment_id":"1552075435096764","commenter_b":"She is the queen of lies! Talk about incoherence!","commenter_a":"POT CALLING THE KETTLE..........(hiding fear and jealousy)","post_message":"Hillary Clinton went after Donald Trump's ideas, calling them 'dangerously incoherent' and a 'series of bizarre rants, personal feuds, and outright lies.' What do you think?"},{"comment_id":"497111050479475","commenter_b":"She's a sellout to her own race, taking everything that white people gave her, and then spews her racist anti white nonsense to make blacks think she actually cares about them.","commenter_a":"She described racism other countries not ours.","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy.  She's the biggest racist we know, and we won't stand for it.  Do you agree Oprah is racist?"},{"comment_id":"1749284951998475","commenter_b":"I love this","commenter_a":"'@username @username me in second year","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"1735291753418932","commenter_b":"Tyler","commenter_a":"Julia Lynch yay","post_message":"Wristbands allow festivalgoers to return to the empty field after a trip to the parking lot to retrieve more MDMA, mephedrone, 2-DPMP, Benzo Fury, Adderall, or synthetic cannabinoids."},{"comment_id":"10155239787299411","commenter_b":"Says the Muslim cunt !fuck you and Muhammad","commenter_a":"Is Denmark a Christian or Pagan country?Seems like a dictator country. Forcing people to embrace religion against their will. Sad to see another country being brainwashed to reject the immigrant after all the destruction they had done to their country. Evil system being employed by the world government to spread hatred and misery for their own expenses. Screw the Minister!!! Bunch of hypocrite running the top country post. N shame on the citizens whom do not do a about it/opposing the motion. U are just as two faced ass***e just like your leaders.","post_message":"'Un-Danish?'"},{"comment_id":"10153189347462550","commenter_b":"Filthy pig","commenter_a":"You almost wanna teach you child at home what's going on these days","post_message":"#BreakingNews - Former Cumberland County school principal David Edwards pleads guilty to sex offenses with students.  More here shortly ---> @webpagelink"}]
