[{"comment_id":"10153994126946337","commenter_b":"Loved it!! These 'Million Moms' need to stop clutching their pearls & promptly remove the sticks wedged up their tight asses.","commenter_a":"What do you think about the show Lucifer?","post_message":"NOT HAPPY! One Million Moms is beyond ticked at Lucifer and Olive Garden..."},{"comment_id":"10153127374764753","commenter_b":"Pig drug whore doesnt deserve kids","commenter_a":"And I feel like a bad parent because of my mountain of dirty laundry... some people don't deserve children!","post_message":"Kodi Faircloth, though she may look quit a bit older, is only 38 and already the mom of 12 kids with another on the way. But it’s a safe bet that this Tulsa, Oklahoma, woman won’t be winning any Mom Of The Year awards anytime soon — not after what police report that they found in her home last Thursday."},{"comment_id":"10153065871694138","commenter_b":"It was just an upgrade to walking 5 miles each day for water...","commenter_a":"He could have bought a car, he chose not to.","post_message":"He kept a perfect attendance record walking 21 miles to work every day for 10 years."},{"comment_id":"1254290281276196","commenter_b":"He prefers giving the jobs to refugees and Muslims what a POS","commenter_a":"What is he on Obama didn't do anything to create jobs","post_message":"Yesterday, news swept the nation about the amazing feat President-elect Donald Trump was able to accomplish before even taking office. Trump, along with Vice President-elect Mike Pence, forged a deal with Carrier, keeping 1,000 jobs in the US. However, not everyone is taking the news quite so well, and none other than the current president and his administration had a sickening response.  @webpagelink"},{"comment_id":"700735873407794","commenter_b":"No you dumb whore check history That would be the other dumb whore Hillary","commenter_a":"Why don't you just sit down and be quiet, because you haven't a clue hat you are talking about. You never experienced a thing of what you suggested, and doubt you know that history!","post_message":"According to the great celebrity-turned-philosopher Cher, Trump is now a genocidal murderer..."},{"comment_id":"10153619308152235","commenter_b":"'@username a racist comment about baking!?? Okay, surely you jest. You don't know what you're talking about so you're automatically excluded. @username I agree it could be seen as sexist except I am a female and bake all the time, but MORE IMPORTANTLY Men are known to be the best chefs😉. @username she didn't make any valid point when she stated 'nothing new, threats made against students daily' She's out of touch with the article and with reality if she is trying to compare unspecified kids being threatened to a RACIST threatening to kill only BLACK KIDS posing with ak47 on the school grounds!! ARE YOU FREAKING KIDDING ME!??? The generalization she attached to this comment is uncanny, disturbing, and I'm sorry RACIST in an of itself. Because the DENIAL of racism IS racism also.","commenter_a":"This is nothing new. Threats are made against students daily! We went through this last year and most kids were kept at home until the instagram poster was identified.","post_message":"Another effing beautiful day in post-racial America."},{"comment_id":"10157919704880354","commenter_b":"Any woman is capable of cheating","commenter_a":"Deplorable in State Of Jefferson!","post_message":"LIVE: Behind-the-Scenes Look of the New Store with Breitbart's Alex Swoyer,  Sonnie Johnson and Charlie Spiering"}]
