[{"comment_id":"10153163216675950","commenter_b":"What...like it's hard?! #illegallyblonde","commenter_a":"This nonsense is in the same category as the Nobel Peace Prize nonsense. Victory is awarded by decree. Neoliberals in higher education are waging an aggressive campaign to destroy meritocracy.","post_message":"\"There are few teams we are prouder of having lost a debate to than the phenomenally intelligent and articulate team we faced this weekend,\" students on the Harvard team wrote."},{"comment_id":"675517259277271","commenter_b":"And now you know .......the rest of the story","commenter_a":"Good questions","post_message":"Hear, hear!"},{"comment_id":"1100594890039116","commenter_b":"Hillary would've crapped herself... oh wait she probably already did...","commenter_a":"Another fake attempt 2 lure in sympathetic voters?","post_message":"Trump’s top aides baselessly pushed the idea that it was an assassination attempt."},{"comment_id":"1783804358520815","commenter_b":"Shut up....","commenter_a":"As reprehensible as Dylann Roof's crimes are, the death penalty is simply a barbaric act that brings a blood-lust satisfaction. There is no Hell to which criminals are consigned that is worse than lifetime confinement.","post_message":"Defense attorneys for Dylann Roof, who is accused of killing nine people at a church in Charleston, South Carolina, filed a legal challenge to the constitutionality of the federal death penalty."},{"comment_id":"10152834207221130","commenter_b":"Suzie Mills when all the GB is gone xx","commenter_a":"Mark O'Halloran","post_message":"Practice makes perfect, little buddy."},{"comment_id":"10153305796441162","commenter_b":"Hilary you go girl love you. Women, remember Jane Burn? She were a woman Mayor, lets get Mrs. Clinton for President. We made it with a black President, lets get get Mrs. Clinton in.","commenter_a":"Hillary Clinton for President 2016, all the way!!!!","post_message":"HILLARY 2016? It's officialHillary Clinton is running for President, and she's already considered a front-runner. We have the full story coming up on our 5:00 news. Tune in to ABC 7 Eyewitness News or watch LIVE at @webpagelink"},{"comment_id":"10153666146819099","commenter_b":"Shut up you dumb broad","commenter_a":"Get guns off the street. It's time for stricter gun laws.","post_message":"A 30-year-old wanted criminal with 12 prior incarcerations allegedly shot a 33-year-old NYPD officer in the head in East Harlem, authorities say ----> @webpagelink"}]
