[{"comment_id":"1280477518640408","commenter_b":"Who cares,he is nobody.","commenter_a":"Who can respect this so called intelligent person (jerk), wearing a batman tshirt making important statements? My 5 year old grandson loves to wear his batman tshirt to the play ground. Makes me think Cuban is doing this for publicity. Yep...his money success has gone to his head!","post_message":"He's rooting for..."},{"comment_id":"1001534043242046","commenter_b":"Nice thought but it's an AMERICAN FLAG on a WHITE MAN'S PROPERTY that's also a VETERAN. Need I say more Nick as sad as it is he is still defending his FREEDOM, his CONSTITUTIONAL RIGHTS, the AMERICAN FLAG and this ONE NATION UNDER GOD.","commenter_a":"I just hope he called the cops because it could be a hate crime, and its attempted arson,","post_message":"Marine Vet Who Flown an American Flag in His Front Yard for 15 Years Wakes Up to a Sad Sight:  Can They Do That? (VIDEO)  PROUD AMERICANS ARE UNDER ATTACK!   @webpagelink"},{"comment_id":"964951150247780","commenter_b":"Prove it!","commenter_a":"I support our troops; I support allowing them the victory over our enemies...","post_message":"BOOM!! If I were ISIS, I'd already be looking for cover. The U.S. Military isn't messing around here.   Do you support our troops?"},{"comment_id":"468867053307454","commenter_b":"Transgender are idiots knockem in the head throw em in a ditch.","commenter_a":"This world is filled with way too many idiots. Please EDUCATE yourself. All of a sudden this is a problem? Where do you think trans people have been going to the bathroom? But ACTUAL pedophiles who like boys is okay? Stop being hypocrites and spreading hate","post_message":"A pledge calling to boycott Target has now reached over 1 million signatures. @webpagelink"},{"comment_id":"511818058979535","commenter_b":"Good they dont belong there. Its for shoppers and family time keep your zoo off all streets and malls! If black lives mattered so much to them why are they not stationed in the community?? #enoughalready","commenter_a":"They are a nuisance.","post_message":"The Mall of America is seeking a temporary restraining order that would bar the group from protesting. It also wants the group to post a message on social media saying the protest is cancelled."},{"comment_id":"952645251457544","commenter_b":"I would kick they asses!!!","commenter_a":"Somebody goin down tuh-dey d'ere boy! This is a sign that everybody is not equipped to run a daycare. Idiots!!!","post_message":"Cornelius Jones went to pick up his one-year-old daughter, Journee, from daycare... only to find the facility closed. After hearing his daughter’s cries, he flagged down police who found the young one crying & crawling in the dark.   Employees said they thought Journee was a doll. DETAILS ----> @webpagelink"},{"comment_id":"612030692317870","commenter_b":"HAHA Austria also has an entire budget that is smaller than America's military budget is alone. I'll keep my 19% tax rate thank you. You all had your damn kids, pay for their college yourself. I'm not paying it just so they can go out and buy a new BMW when they graduate.","commenter_a":"Those poor bastards...they will be stuck in an Obama like environment.","post_message":"Austria's election gives hope that the far-right wave sweeping the West can be stopped."}]
