[{"comment_id":"870399723007863","commenter_b":"Her and Her Husband are a disgrace to America.period!","commenter_a":"She think it ok i am obama wife","post_message":"Is it her?!"},{"comment_id":"589804961210083","commenter_b":"If they don't like it then they can suck chuck","commenter_a":"Love my Marines.","post_message":"These Marines make huge stand and show Muslims they're not afraid. Love it. We need to spread this and show these Marines we have their back. Do you support our troops?"},{"comment_id":"1082059028539299","commenter_b":"And whites don't hey dumbass All lives matter you would know that if you stayed in school 😬","commenter_a":"Because Black LIES Matter to those thugs.","post_message":"It's no surprise that the people at Black Lives Matter aren't exactly known for their ability to stick to the facts. However, this new data about black \"victims\" absolutely DEMOLISHES their whole agenda. I guarantee the media doesn't report on this... let's spread this everywhere."},{"comment_id":"10153186192812550","commenter_b":"Oh @username its so sad. First of a talking back is not a threat. Second if he wanted to arrest her , he did not need to throw her on the ground & pull her hair. Those kids were running up to save their friend & I would have done the same thing. Third she was all ready sitting down , it was no need to push her head down in the dirt & sit on her. Apparently the kids were invited by a guest. They didn't start the fight at the party some old ladies started it.","commenter_a":"Absolutely NOT! 1.The video is incomplete. 2. The cops appeared to be outnumbered at least 4:1 3. He did not use lethal force. He restrained an individual who was not obeying his directive. 4. When another individual came from behind him; he did as any police officer would and drew their weapon. He then quickly holstered it when the threat was lessened. 5. If these kids showed proper respect for law enforcement; this would have been a different story.","post_message":"Call for cop to be fired after pool party video @webpagelink"},{"comment_id":"10153068896931323","commenter_b":"Real Women Have Pulses.","commenter_a":"All this \"Men like curves\" stuff is crap. Most men will fuck anything with a pulse.","post_message":"\"There is no better way to celebrate and show off than by donning a bikini. When the #CurvesinBikinis ad in Sports Illustrated is released, the world will be watching and they’ll like what they see.\""},{"comment_id":"10154493614517235","commenter_b":"How about just sending all of the whites back to their mother countries and leave the Americas to the Natives!","commenter_a":"I've always believed conservatives would destroy this country and it would appear they are well on their way to doing it - maybe we should boot the old confederacy out and let them make it on their own - if Mexico wants texas back, if france wants louisiana, spain wants florida or great britain wants the southern colonies, hey guys don't call us yankees - you got what you wanted LOL","post_message":"BUSTED."},{"comment_id":"10154350204712994","commenter_b":"Have mercy. We need the capital punishment you kill you should be killed","commenter_a":"Carl. , I feel the same way .","post_message":"She was with a friend, and they got in an argument with some people at a liquor store. They left -- but the group followed them for a few blocks and then started shooting."}]
