[{"comment_id":"10153188126467293","commenter_b":"What is this, then? 'That multicolored background is not gonna save you.'","commenter_a":"That qualification was executed with a double standard.","post_message":"For all those who doubt the women's accomplishments."},{"comment_id":"1658721937683357","commenter_b":"It is a machine for women. Google it.","commenter_a":"Who's Sibian?","post_message":"This may be  to a beach near you!  @webpagelink"},{"comment_id":"929346133862318","commenter_b":"If a bank (any bank or business) is going broke, such as Lehman Bros., how is it up to We the Tax payers to bail it out? A business either prospers of fails on its own merits, period! None should be 'too big to fail'! Throwing trillions of dollars at a sinking ship is madness, it just prolongs the inevitable and hurts those that are being forced to pay for using their stolen tax paid monies, and harming the entirety of the economy, we are here to bail out the billionaires and globalist elites delusional scam they are perpetrating on man kind!","commenter_a":"What an asshole and she probably makes a 6 figure salary, time to clean house","post_message":"Not sure about you, but this REALLY pisses me off!   H/t: Emancipated Human Subscribe: @webpagelink  Join Us: The Free Thought Project"},{"comment_id":"10153953968561491","commenter_b":"'@username: get it right. SAD!","commenter_a":"when in the hell? @username @username","post_message":"'Trump’s message to young people of color is simple: what do you have to lose? In my young optimistic eyes, after the last eight years of the Obama presidency, there is little left to lose.'"},{"comment_id":"10154364961931320","commenter_b":"I don't like seeing fat chicks in spandex but yet I'm made to tolerate it.","commenter_a":"Was she covered up or like in the article picture? I am a mother and have no desire to see someone breastfeeding. Cover it up. That experience is between you and your baby and no one else.","post_message":"The sight of a woman breastfeeding her baby was enough to cause a male Target shopper to go off in a series of verbal assaults. @webpagelink"},{"comment_id":"1157175910989546","commenter_b":"Why would ANYBODY admit they were a Republican after this years parade of idiots, never mind vote for them?","commenter_a":"Assholes are use of SHIT !!!!","post_message":"Three Republican presidential candidates befriend a pastor who just went on stage and gave the most bizarre anti-gay speech ever."},{"comment_id":"704049616452283","commenter_b":"fuck that stinky black ugly bitch","commenter_a":"She maybe a First but NO LADY..","post_message":"Our first lady just disrespected all the white women in our country. She is a hypocrite and a racist. We miss Laura Bush. Do you agree Michelle Obama is a disgrace of a first lady?"}]
