[{"comment_id":"10153071705477093","commenter_b":"^ Alex I almost did but I knew she as well as many others wouldn't grasp that concept.","commenter_a":"\" AGAINST HATE\" in Dallas,Texas SEPTEMBER 14, 2015- MONDAY At the American Airlines Center At 5:30pm....all those that want to stand against hate are welcomed. march to the... American Airlines Center In Victory Square...from Cathedral of Guadalupe Off Ross St in Downtown. Police Department will be on site but I would like to note that everyone should be very cautious & on guard. There have been reports that peaceful protesters have been attacked by Trump supporters & some dressed like protesters & assult others within the crowd & reported spitting in their faces. Have your groups be alert & camera rolling just in case, if this happens, attackers can be on record & prosecuted! Thank you everyone & remain peaceful yet boldly stand for Justice. Arm & Arm. Wearing Red,White & Blue colors.","post_message":"A \"Dump Trump\" rally is now scheduled ahead of Trump's rally in downtown Dallas tomorrow."},{"comment_id":"10155275257336037","commenter_b":"Bahahahahahahahaha your trendy hashtags will change everything. Lmao. #CryHarderBitch #YouStillLose","commenter_a":"Trump is the new media now.He is telling us like it is.Lame stream media wasnt telling us about Sweden.They didnt tell us about Bowling Green.They didnt tell us about Atlanta.They didnt tell us about the massive voter fraud.They even said he lost the popular vote.They falsly reported on the size of his inauguration.Biggest ever.He was there to tell us that Barack Obama’s birth certificate was a fraud.Without trump we wouldnt have know that thopusands cheered from the roof tops of NJ when 9/11 happend.He's in charge now so suck it snowflakes.Trump 2018!!!","post_message":"FOLLOW LIVE: Coverage of upcoming Presidents’ Day protests in New York, D.C., and Los Angeles @webpagelink"},{"comment_id":"990398314328597","commenter_b":"Fucking what the hell why u have to hit a poor guys damn this US is freedom fucking basdard try to find me I kick their ass to hell","commenter_a":"That fuck up stupid cop","post_message":"Listen to an MMA fighter break down the poor training of law enforcement. Source → @webpagelink Filming Cops (Y) Police The Police (Y) H/T Gracie Breakdown"},{"comment_id":"1041804329212648","commenter_b":"The same family will bring in refugees, no doubt, and will regret that as well.","commenter_a":"At the shelter in my city they put all pits and even half pits to sleep, they don't even adopt them out.","post_message":"Pit bull rescued from 'death row' attacks daughter just minutes after arriving at family home"},{"comment_id":"1607217966231983","commenter_b":"Both are trash , miley gross she nuts to she better grow up !","commenter_a":"Both are idiots","post_message":"Hillary Clinton and Miley Cyrus are a match made in Hell"},{"comment_id":"729261537208194","commenter_b":"Not for criminals!!! More sheeple...","commenter_a":"When is everyone going to realize that gun control laws only apply to the law abiding citizen's? Criminals could care less what law is out there that says something is illegal, such as murder, drugs, ect.","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.” Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"10153659682115399","commenter_b":"Really? In what way could Trump have forestalled the Syrian refugee crisis?","commenter_a":"If Trump would have been in charge before this, these horrendous wars and humanitarian crisis may not be going on. It appears that Obama is way out of his league. #trumpforpresident","post_message":"Reminder: More than 100 people were killed and more than 350 injured in the coordinated terror attacks."}]
