[{"comment_id":"10156260216170725","commenter_b":"Michele the only thing dirty here is your pussy","commenter_a":"The media is always unfair to you @username but we are supporting you and what you will do for this country!!! Make Amerca Great Again in 2016!!!","post_message":"After a great evening and packed auditorium in Iowa, I am now in Colorado looking forward to what I am sure will be a very unfair #GOPdebate!"},{"comment_id":"10154592640014411","commenter_b":"actually, feminists hate people forcing women to wear/do anything, which is kinda what a ban amounts to.","commenter_a":"Burkini is everyrhing that a feminist hates,so how can feminists agree for that?","post_message":"'...attempt to raise profits and exploit a gap in the over-saturated clothing market is selling and promoting allegiance to ISIS?'"},{"comment_id":"10152892388271749","commenter_b":"oh, that makes sense, you live in bankrupt California.","commenter_a":"more uninformed people are stating that whites killed blacks (KKK) and somehow this means whites should have no say in the current crisis. However it is necessary to point out the gross inaccuracy of the white vs black default position that is happening. The KKK was started by none other than the Democratic Party. They even held meetings in THE WHITE HOUSE. It was not a white vs black terror group It was A Republican vs Democratic terror group. All blacks were Republican at that time for reasons that are obvious and for some that are not obvious Democratic party wanted to enslave and/or lynch blacks and go figure, Republicans had a problems with that. However of the estimated 5000 people killed by the KKK, 2000 were WHITE Republicans who, just like the Black Republicans, were fighting for equality and liberty that the dems were opposed to. So get off ...","post_message":""},{"comment_id":"10153242618583132","commenter_b":"First Dr. Nancy Snyderman and now Brian Williams betrayed us!","commenter_a":"Yea a permanent one lol","post_message":"Brian Williams tells staffers that he is taking a break from NBC Nightly News amid his recent scandal."},{"comment_id":"860452347398311","commenter_b":"What an idiot, can she really be this stupid? If this passes for high intelligence, I must be a genius","commenter_a":"You really cannot fix stupid","post_message":""},{"comment_id":"503579846468637","commenter_b":"Why argue with this man child?","commenter_a":"Remember the outrage over the clock kid? Let us see if libtards and media worry so much about Christians being singled out to die.","post_message":"\" He seemed skittish, always looking over his shoulder to see if anyone was watching.\""},{"comment_id":"974047066004855","commenter_b":"These tanks could easily create the blast heard around the world. Should that take place, this nation will erupt in a revolution unseen for hundreds of years. The resident of the white house should have his escape plan worked out because We the People will coming to evict him and his whole family .....and his mother in law too......!!!!","commenter_a":"Be afraid, be VERY afraid!!!!!","post_message":"FBI ON ALERT: Theft of dozens of propane tanks, purchase of 150 prepaid cell phones  [READ MORE]"}]
