[{"comment_id":"10155175769803984","commenter_b":"and we are not giveing up our freedom just stoping people entering oir country...our constitution does not apply to immigrates","commenter_a":"*\"B4 you blame Trump read this\"* ******************** *I still DO NOT understand why there's so much noise about Trump's decision to ban refugees from Muslim countries?? There are '100,000 empty fully air conditioned tents' in Mina- Saudi Arabia capable of housing 3 million people yet Saudi Arabia refuses to take the refugees, who speaks same language, same culture, same tradition, same religion, yet Saudi Arabia feels it's 'a security risks to accept the refugees' but wants the Christian world to do so? I'm trying to understand this thing called 'common sense', how it's been used. Is Saudi Arabia not too wicked for turning it's back against its own? Why blaming the US? Remember it is part of Trump's election promises, yet the Americans voted for him, meaning dats what they want.* *Germany took over 1 million refugees and Saudi Arabia came up with a proposal of spending billions to build ...","post_message":"Donald J. Trump gave Iran 1 chance to straighten up, and they defied him.  So now he's made a massive move to teach them we're the ones in charge.  Thank the Lord for a president with an actual backbone!"},{"comment_id":"10158477951920206","commenter_b":"Hillary needs to be arrested, tried and thrown into a dark cell!","commenter_a":"It's Donald Trump for the New chief of Command...","post_message":"The man once known as “Obama’s favorite general” has now pleaded guilty to the felony charge of lying to the FBI during its investigation into the leaking of classified information."},{"comment_id":"10153059782796770","commenter_b":"She's a lier","commenter_a":"She is a crook always has been!","post_message":"Hillary Clinton: “I have gone further than anybody that I’m aware of in American history … to try to be as transparent as possible”"},{"comment_id":"10153987502144087","commenter_b":"Hillary is by no means a \"girl\". She's an old mentally disturbed hag.","commenter_a":"Wait, Hillary's a girl?","post_message":"Elizabeth Warren: \"[Donald Trump] makes death threats because he's a pathetic coward who can’t handle the fact that he’s losing to a girl.\""},{"comment_id":"10152910071581130","commenter_b":"@username, cry me a River. You don't see that those women keep on having babies that they can't take care of and are sold into prostitution. Oh, but im wrong for believing in controlling the problem. And no bitch, I got my tubes cut and burned, because I dont believe in having more then what I can take care of.","commenter_a":"Since they don't have protection & clearly can't afford children why not find alternatives to intercourse? Or maybe idk use some self control & abstain from sex altogether? They are consenting adult women fully aware of the possible outcome/consequences of their choices. Only people I feel sorry for are those babies born into a piss poor life because they have SELFISH parents.","post_message":"“Sharing a bed is fine, it’s okay to share and be all together. But it’s tough because what if the person next to you is sick? What if they pass that illness on to you and your baby?”"},{"comment_id":"936644226390980","commenter_b":"The typical holiness young woman will argue with a tree and maybe this is why they got together and removed this mother from the church the reason refused to listen to anyone else way of thinking you be bless and I hope you live as long as the 103, may the same happen to you","commenter_a":"From what the article said... she thinks he's trying to change the denomination of the church. .. this beautiful 103 mother misunderstands that Holiness is a way of life.. not a denomination.. the Pastor could have handled this better. .. there's no need to put her out of the church. . To be sanctified means to live a life separated from sin.. that's not a denomination either. .. sounds to me that teaching through love and kindness is in order.. people seem to fear what they don't understand. . To call her names and disrespect her by leaving her in a dark church is not right and does not reflect Holy living . They need to repent of that.. always respect your elders regardless. .. but also remember .. just because your old does not mean you know all the way of the Lord... no one does.. that's why we ...","post_message":"A 103-year-old Georgia woman was banned from the Elberton church she’s served for 92 years after she voiced concerns about the pastor’s sermons.  After ignoring the ban and attending church the weeks after getting the letter, the pastor dismissed the service and left her sitting in the pew with the lights off. Police were notified, but refused to throw a 103-year-old woman out of church.   She was also subjected to slurs from their former fellow churchgoers. MORE ----->  @webpagelink"},{"comment_id":"10153548896611323","commenter_b":"Ban all religion, ban all religious dress so all pupils wear the same uniform, then paint all children green ......... There you go, sorted.","commenter_a":"When a system (Teachers & Parents) is not focused on a child's future but instead going through the motions and meeting the targets with least amount of positive role models (especially in single parent families) you are not building future generations that think rationally where the brain itself arrives at a conclusion at a very young age that race is just a social construct, you are instead building a worker drone filled with prejudices and presumptions on top of entitlements that things are owed instead of earned.","post_message":"\"Education should provide an inclusive curriculum that teaches the students respect for other cultures. If schools provided such an education, the climate that allows racist language and behaviour would cease to exist. Promoting such an education should be a priority for government, however in Britain we have a school system that has little interest in education.\""}]
