[{"comment_id":"10154530724213645","commenter_b":"Yes Ryleigh this is really awesome. Great job !","commenter_a":"Nam Breanne Ewing NAM @username did you see this? Ryleigh @username and I are sooo proud of you. This is fantastic! Congratulations!!! I hope we are going to see you again this year in June!!! @username","post_message":"Meet Ryleigh!   Despite her physical challenges, she's beating the odds and inspiring everyone she meets with her story."},{"comment_id":"1749063398683963","commenter_b":"Shut up- you're just another puppet of clinton. There is no way in hell that trump is more dangerous than that witch Clinton. How much were you paid?! Were you threatened. Clinton must be stopped. Clinton is the threat! She is in with muslim radicals and is going to move toward removing guns from the citizens and let terrorism continue! Give trump 4 years- he will do better than Clinton!","commenter_a":"I wouldn't trust the CIA or the FBI if my life depended on it.","post_message":"'Donald J. Trump is not only unqualified for the job, but he may well pose a threat to our national security,' he said."},{"comment_id":"677415119050364","commenter_b":"Yes....","commenter_a":"yes","post_message":"Take the poll!"},{"comment_id":"10153265498530047","commenter_b":"'@username over 5million LOL. Dead people and illegals","commenter_a":"SIGN THE PETITION / CLICK ON WEB SITE Justice Scalia one of the most brilliant and ardent defenders of the Constitution has just passed away. This is a huge, deeply felt loss. We must not forget that the next justice could impact the Court and the direction of our nation for decades. The American people deserve a voice in this decision: @webpagelink","post_message":"President Obama will stop at nothing to force his nominee for the U.S. Supreme Court through the Senate before his last year in office comes to an end.      But we can stop this from happening.  SIGN & SHARE our urgent petition to the U.S. Senate today: @webpagelink"},{"comment_id":"10153181342983812","commenter_b":"I do agree not to go looking for trouble. Often times, ya get more than ya bargained for ;)","commenter_a":"You can not go looking for trouble, find it, then decide you don't want said trouble. Its already too late!","post_message":"Relatives held a candlelight vigil to honor the life of Tammy Meyers. @webpagelink"},{"comment_id":"10152534767705047","commenter_b":"Revoke their passports and citizenship! Traitors should not be allowed to live here !","commenter_a":"Amen","post_message":"American citizens must not be allowed to fight alongside jihadists, only to then return to the U.S. to spread jihad here.   Sign & Share our petition to protect our homeland:  @webpagelink"},{"comment_id":"10153254400059228","commenter_b":"What a Negative Nancy!","commenter_a":"This is prolly the biggest lie I have heard yet.","post_message":"An Ohio woman searching for her biological mom got the surprise of her life Monday when she learned her mother was a coworker."}]
