[{"comment_id":"1097911176909250","commenter_b":"So... Nazis ok? It's the very nature of Islam that poses the problem isn't it? Do you really want to populate your country with people who follow a religion that is also a supremacist ideology? Is it your argument that it's hate that motivates people to not want to allow mass immigration of people that follow this system of belief? I would say that's a very irresponsible and naive view. Who do you have a greater duty to? If you think it's to the millions of immigrants living in countries with terrible histories of violence, terrorism, misogyny, and rape I have to say that is not kindness at all. Don't you understand that real people in your country are going to die and get raped because people think like you? Where do you draw the line. There are billions that would love to pour into our countries because our values ...","commenter_a":"Go back home and fight for your freedom instead of coming to western countries and committing crimes and raping.","post_message":"This photographer traveled by raft with refugees headed to Europe. The images he captured are a rare glimpse into the greatest refugee crisis since World War II."},{"comment_id":"10152702805232452","commenter_b":"No!!! Go away. ...far away","commenter_a":"Crystal Porras...No!!! Not SB!!","post_message":"A person who was being monitored by the Santa Barbara County Public Health Department for Ebola was being taken Sunday night to a Los Angeles area hospital as precautionary measure after displaying signs of illness. @webpagelink"},{"comment_id":"10153266988046636","commenter_b":"Nah that doesn't bother me, I'm a risk taker the rest of the time","commenter_a":"things like this make me nervous of going to London most weekends","post_message":"Police say they are treating it as a 'terrorist incident'"},{"comment_id":"10153588391460667","commenter_b":"@username: you basically need a nice warm cup of shut the hell up.","commenter_a":"Don't feel sorry about those ... These soliders maybe killed 300 kids and 300 from elderly people in Palestine , but we say Islam say don't kill innocents people even from your enemy ...","post_message":"\"Terror will not silence us, we will return to work tomorrow,\" Tel Aviv Mayor Ron Huldai said."},{"comment_id":"10153547862267894","commenter_b":"This bitch cant act bye","commenter_a":"I think Nene should focus on her acting career. I enjoyed just having her pop up on a few episodes as a guest and not a wife.","post_message":"NeNe Leakes Reportedly Offered $2.5 MILLION to Return to ‘The Real Housewives of Atlanta’"},{"comment_id":"947484675311281","commenter_b":"This is why so many people are against Muslims. I've sat and ate meals with people from all over the world with differnt faiths and never had a cross word. It's all about give and take yet some Muslims can't grasp the idea of peace and harmony. The reason why they all want to come to England and screw our little island up is the free hand outs. VOTE UKIP and maybe we can stamp the minority out and make it harder for these people to enter our island.","commenter_a":"This not surprising. What surprising is he is not in jail for what he just said.","post_message":"Sean Hannity: 'You want her to die!?'"},{"comment_id":"760324150750635","commenter_b":"You sons a bitches!! Lmao","commenter_a":"Thanks a lot sister that was my favorite soda!! Gross! Jessica LeAnn Miko","post_message":"Disturbing Thing A Man Says He Found Inside A Freshly Opened Pepsi Can"}]
