[{"comment_id":"10153647598586077","commenter_b":"Put her back in prison!","commenter_a":"Welcome home Mom!","post_message":"Demaryius Thomas' mom, Katina Smith, will be wearing this custom made jersey today. (photo courtesy Michelle Martinez)"},{"comment_id":"10153611791381509","commenter_b":"These MEN stand out from the rest. These MEN want there city back. Notice how I capitalize MEN because that's exactly what they are. Black or white it doesn't matter they are sticking up for what they believe in and not backing down no matter what others think of them. These MEN are making a much more powerful statement then all the little thugs running around the street pretending to be billy bad a** that disobey laws and creating acts of domestic terrorism and getting nothing out of it in return. This is a great representation of American pride and power....Stay strong. Respect","commenter_a":"Ijs.... Sounds about right","post_message":"Charred cars and buildings. Hospitalized police officers. Looted and damaged businesses. No school, because it might not be safe for children. That's the stark reality today after a night of riots in Baltimore: @webpagelink"},{"comment_id":"1124522294289594","commenter_b":"Well to be fair, she didn't do a very good job raising you.","commenter_a":"@@username, You watch what you say about my mother you no good peice of garbage!!!!!!!","post_message":"Would you do this if you saw a dog trapped in a hot car? A new Ohio law makes it perfectly legal."},{"comment_id":"930392377095536","commenter_b":"He is only talking about hoes and gold diggers people.","commenter_a":"Black women are steadily climbing the social ladder. I think this hostility stems from a fragile male ego and jealousy of the women's hard work and progress. A woman's progress only threatens weak men because now he sees the woman as competition when all she is trying to do is make something for herself and better her life. I've seen the mentality of these types of men. They think it's a competition and accuse black women of \"competing with black men\" by excelling in their careers and succeeding academically. Its really all jealousy. I've heard these types of men complain that \"An educated black woman will render the black male useless, and produce less babies, thus destroying the black race\", which really reveals that they rather you be stupid and uneducated and a baby factory, than self sufficient and educated. Ive literally heard black males argue AGAINST black women furthering ...","post_message":"Rapper Trick Daddy Thinks Latina and White Women Will Make Black Women 'Useless'"},{"comment_id":"10154069182538128","commenter_b":"You're disgusting!","commenter_a":"Disgusting crap Chris Rock!!","post_message":"Chris Rock didn’t waste any time diving into the controversy over the lack of diversity at this year’s Academy Awards."},{"comment_id":"1003928746312028","commenter_b":"Trump for President. Get rid of the Muslims","commenter_a":"Wasn't it said that you are either with us or against us and any nation found to be harboring terrorist or terrorist training camps will be dealt with as an enemy of the state? If nothing is going to be done about these confirmed training camps by Obama and his administration does this not make them enemies of the American People.? Perhaps it's time for the Knights Templer to return. Take back America Trump 2016!","post_message":"It is confirmed there are 22 Jihadi Training Camps in the USA, but the FBI says nothing can be done about them. This new map shows exactly where they are so you can see if there's one in more in your state."},{"comment_id":"10154836011454641","commenter_b":"Muslims should be exterminated..ambassadors of evil!","commenter_a":"And now he funds terrorism, giving weapons to the same people that have just been found to of made a mass grave in Aleppo of civilians. Scumbag.","post_message":"He was broke after running a losing campaign, his credit card was declined and he was quickly losing hope on pursuing a career in politics."}]
