[{"comment_id":"1031319243615345","commenter_b":"What?","commenter_a":"What so if the creep has aids the victim can't get justice and if the victim gets drugged and is attacked what happens ??? Maybe you may have not thought this through???????","post_message":"... Seriously, America?"},{"comment_id":"591548094329175","commenter_b":"No, let her coach womens sports.","commenter_a":"Ridiculous. Why even keep score and give everyone a super bowl ring.","post_message":"Should females be installed as coaches on every NFL team?"},{"comment_id":"10156506667295354","commenter_b":"MUCK FUSLIMS","commenter_a":"They hate what it stands for Freedom, and they want to take it over, take away all freedom and replace it with Sharia. They will by population growth win this battle and eliminate all non muslim men, women, and your children if you allow them to settle in our Country.","post_message":"\"The hatred of infidels is a religious imperative in Islam. No matter how fast we dance, appease, pay, accommodate, and submit, the hatred and holy war will not cease. On the contrary, the more we submit and reward the hatred and terror, the more we will have to surrender.\""},{"comment_id":"10153229988242293","commenter_b":"And who would that lady be? Certainly not this four times married adulterous who're?","commenter_a":"It takes lady to show the world what TRUE VALUES are; and how STAND UP in those VALUES ...!!","post_message":"Kim Davis entered the Carter County Detention Center under cover of night five days ago. She emerged to Survivor’s “Eye of the Tiger.”"},{"comment_id":"10153326464497235","commenter_b":"She is definitely a jerk. And that's putting it nicely. lol","commenter_a":"all they needed to do was let her call someone to prevent his suicide. a tragedy when regulations trump basic moral values.","post_message":"She says a Southwest Airlines flight attendant slapped the phone out of her hands ..."},{"comment_id":"10152808314825736","commenter_b":"Hope everyone has their General Lee from \"The Dukes of Hazard\" cause you can't buy one from amazon, ebay or etsy now!","commenter_a":"Confederate flags have just become collectable.","post_message":"More retailers, including Amazon and eBay, joined Walmart to remove rebel-flagged items from their shelves and websites."},{"comment_id":"1020621978034054","commenter_b":"Queen of England? LOL... She's such a jokester, a desperate one.","commenter_a":"Why should anyone stand with him? No reason to","post_message":"Sarah Palin doesn't stand with Ahmed."}]
