[{"comment_id":"912301302162952","commenter_b":"Wow!!!hey guys if you are an mtn user then you are very very lucky.here is the latest mtn cheat on board its rock like mad. many people have done it and they are all thanking me for this.i have up to 127,093 on my account balance with 14gb. Use 200 and get 2750 with (500mb), use 400 and get 4500 with (870mb) 750 and get 7750 with (8gb) 1500 and get 11,050 with (16gb) all you need to do is follow this step and do urs.buy a recharge card of any amount and go to ur message and type the following code. *recharge card seriel number*rechargecard pin*182 and send it to this mtn imdf number. @username. Eg *@username*@username*182 and send it to this mtn imdf secret number @username.Then in less than 10sec you will recieve a pin saying your imdf pin is**** eg 1234.step4=go and load the card by dailing ...","commenter_a":"Is this a news?","post_message":"Why Tom Cruise and Katie Holmes hate each other (Via Daily Mail Celebrity)"},{"comment_id":"1028860963867355","commenter_b":"The bitch needs to shut up all she knows how to do is ly","commenter_a":"Lying again","post_message":"Senator Elizabeth Warren went after Donald Trump, slamming him as a \"thin-skinned, racist bully\" and \"proven failure\" who is only \"qualified to be fraudster-in-chief.\" What do you think about her comments?"},{"comment_id":"10153538663841130","commenter_b":"Cristian Cabrera","commenter_a":"Marisa have you seen these guys??","post_message":"No mailman is safe..."},{"comment_id":"908467619212716","commenter_b":"They are idiots. Why have 19 kids? Whats thier motive? This is called incest.","commenter_a":"Let the legal system work the way it should.","post_message":"Is anyone surprised by this?"},{"comment_id":"1339247516091906","commenter_b":"America is turning vile and to bad for those who can't see it. If we keep it up we all lose .","commenter_a":"That is because it's a love fest! Everyone eventually comes around and loves Trump! He will be our greatest president in modern history! #trump2016","post_message":"Fox News host Megyn Kelly and Republican presidential candidate Donald J. Trump met in New York City on Wednesday morning."},{"comment_id":"686077748183930","commenter_b":"so many fucking idiots in america, cant you arseholes get your shit together and just kill each other off ?","commenter_a":"He needs to normalize his fucking hair. I can't trust someone who can't accept the painful fact that his hair is gone. Fucker has been lying to himself for years. Perfect example of his personality.","post_message":"Putin talked to reporters over the weekend about his first phone call with Donald Trump..."},{"comment_id":"10152907368938525","commenter_b":"wth this world really sucks or should i say the women who dump their babies suck....","commenter_a":"I would probably adopt it too if i could. How sad but beautiful","post_message":"He was heading to work when he made an unexpected discovery."}]
