[{"comment_id":"10152781007061615","commenter_b":"Our veterans go without while lazy a**es and foreigners collect cash, food stamps and free medical. What's wrong with this picture??? VETERANS AND ALL MILITARY SHOULD COME FIRST! They put their lives on the line so the lazy idiots and illegals don't have to. WAKE UP AMERICA AND GET YOUR PRIORITIES STRAIGHT!!! Rant over.","commenter_a":"but it was OK that he put his life on the line for this country give the man what he deserves","post_message":"DENIED. An American hero, unable to collect his military benefits when he needed them most. WPXI Rick Earle gets help for this veteran. His story is coming up tonight at 5:45 p.m."},{"comment_id":"1128341107201309","commenter_b":"Hillary is a very evil woman.She will do anything for power.","commenter_a":"I would love to see a truly in depth report regarding The Clinton Foundation. I do believe if the truth was revealed about the Clinton's and their corruption that surely more people would not vote for Hillary Clinton.","post_message":"FINALLY!!!"},{"comment_id":"1341308765907356","commenter_b":"Al Franken was a terrible comedian and an even worse senator. What a worthless piece of crap!","commenter_a":"Ouch!","post_message":"Stuart Smalley never had a chance."},{"comment_id":"1557909130909006","commenter_b":"Go watch FOX bitch...","commenter_a":"Because guns cure racism and misogyny. Vice you are officially the retarded wing of journalism.","post_message":"What radical black womanist politics organized around self-defense actually looks like, and why it matters."},{"comment_id":"1837165426513406","commenter_b":"Kiss my white ass","commenter_a":"and let me tell you something about being poor we were poor when i grew up i was very lucky we had food on the table there were times we didn't have ckristmas cuz we didn't have the money so when the democraps say we dont know how it feels to be poor they are so fucking full of shit minimum wage was less was about 3.00 an hour so you people today dont know how it is to be really poor","post_message":"Black Lives Matter Co-Founder Makes SICKENING Demand For Whites To Do THIS [VIDEO]. She is a bigot, her demands are creating racial tension. Do you think she is the racist?"},{"comment_id":"10156091000625354","commenter_b":"White Trash ...Bastard .... Hoe Bag.... She has Evil Eyes.....Ugly Bitch.....!!!!!!..","commenter_a":"That's this fat slobs 2 seconds of fame, congrats your grandkids will tell stories","post_message":"Here's what we're dealing with, folks…"},{"comment_id":"10153491120417869","commenter_b":"How ironic, mike; YOU are the one that's \"done\". You know what I'm talking about. This was your swan song, buddy.","commenter_a":"All Presidents are natural born to eat the dirt and breathe the air within USA soil ONLY!!! President\\tDOB\\tPlace of Birth George Washington\\tFebruary 22, 1732\\tWestmoreland County, Virginia, British America John Adams\\tOctober 30, 1735\\tQuincy, Massachusetts, British America Thomas Jefferson\\tApril 13, 1743\\tShadwell, Colony of Virginia, British America James Madison\\tMarch 16, 1751\\tPort Conway, Virginia Colony, British America James Monroe\\tApril 28, 1758\\tMonroe Hall, Virginia, British America John Quincy Adams\\tJuly 11, 1767\\tBraintree, Province of Massachusetts Bay Andrew Jackson\\tMarch 15, 1767\\tWaxhaws border region between The Carolinas USA Martin Van Buren\\tDecember 5, 1782\\tKinderhook, New York United States William Henry Harrison\\tFebruary 9, 1773\\tCharles City, Virginia Colony, British America John Tyler\\tMarch 29, 1790\\tCharles City County, Virginia United States James K. Polk\\tNovember 2, 1795\\tPineville, North Carolina United States Zachary Taylor\\tNovember 24, 1784\\tBarboursville, Virginia United States Millard Fillmore\\tJanuary 7, 1800\\tSummerhill, New York United States Franklin Pierce\\tNovember 23, 1804\\tHillsborough, New Hampshire United States James Buchanan\\tApril 23, 1791\\tCove Gap, Pennsylvania United States Abraham Lincoln\\tFebruary ...","post_message":""}]
