[{"comment_id":"10153607443456130","commenter_b":"She is a fucking war criminal.Are you guys fucking high?","commenter_a":"I hope when this all over H.A. Goodman writes Hillary Clinton a thank you letter, because writing about how bad he thinks she is regardless of the facts is basically his entire career.","post_message":"\"The only leading candidate in 2016 (Ted Cruz, like Trump and Clinton has a negative favorability rating) with positive favorability numbers is Bernie Sanders. Think about that for a moment.\""},{"comment_id":"10153631022078812","commenter_b":"When my sister and I owned a dual outboard, she had the ridiculous idea to do this exact same thing. We were fully grown women. I told her in no uncertain terms that she would do that one alone. The water between FL and the Bahamas is full of unsavory people, weather, and sea life.","commenter_a":"The ocean is cruel. Regardless of how prepared you are for anything, the ocean is unpredictable as well as man. Anything could have occurred. Rouge wave, pirates, drug runners, etc. Either way it must be Hell on that family right now as you start to wonder \"what if\"? From one parent to another that has lost a Son God Bless and I hope this story has a happy ending but it doesn't look good. Nature, sadly, normally wins in the end.","post_message":"UPDATE: The missing teens' boat was found capsized off the Florida coast. @webpagelink"},{"comment_id":"10153194136535329","commenter_b":"Shut the fuck up bitch.","commenter_a":"OMG nobody is obligated to come to your kids birthday party people always run to FB for sympathy get over it & yourself","post_message":"“I know this might be something silly to rant about, but my heart is breaking for my son. We invited his whole class (16 kids) over for his 6th birthday party today. Not one kid came,” Ashlee posted on a local Facebook group."},{"comment_id":"10153624513811336","commenter_b":"Now the world knows what Cheryl is all about when it comes to black people..","commenter_a":"We also have a president who has made it open season on our police officers.","post_message":"This week on Fox News Sunday: Gov. Chris Christie discusses his 2016 strategy, the government and more. Check your local listings or tune in to Fox News Channel at 2p/6p ET."},{"comment_id":"920858977949524","commenter_b":"Hillary is a whore!","commenter_a":"What does this say about Hillary Clinton?","post_message":"BREAKING - Hillary Clinton's Sex Scandal"},{"comment_id":"1105833282843058","commenter_b":"@username, or not the MAJORITY ., not even close.. also if your so worried about illegals taking jobs, tell like Trump to stop breaking the law, by hiring them.","commenter_a":"NO, Obama has NOT divided America, You Mr. Trump are responsible for dividing our Country & bringing out the UGLY in everybody!!!","post_message":"If anyone is dividing America, it's Trump. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154359999193132","commenter_b":"She is bigger in size for sure","commenter_a":"Even though he won, I think La'Porsha is going to be a bigger star. We haven't seen the last of her. :-)","post_message":"Congratulations to the fifteenth (and final!) winner of American Idol!"}]
