[{"comment_id":"452100988313815","commenter_b":"Oprah is on her way out No one watches her American people don't like racist people like her","commenter_a":"I've thought she's been racist for years!!","post_message":"Do You Agree Oprah Is A Racist? Comment 'yes' or 'no'."},{"comment_id":"1807222879565696","commenter_b":"This is the most disturbing thing , what a monster , someone needs to cut his intestines out while his mouths tied up","commenter_a":"I hope that scumbag get his f**king hands chopped off the f**king scumbag thing like that really makes me so made !!!!!!!!!","post_message":"Chinese man live-streams himself DISSECTING a puppy as revenge."},{"comment_id":"10152774943488717","commenter_b":"Women drivers..","commenter_a":"hmmm - am I the only one who doesn't \"buy\" the foot caught on accelerator? I feel for anyone who reaches the point where they should no longer be driving - this appears to be one of them.","post_message":"Watch as a driver in Wisconsin slams into nine cars in a parking lot: @webpagelink"},{"comment_id":"1848439335433149","commenter_b":"Keen 😜","commenter_a":"@username @username Mari Funfax","post_message":"Put us on the next plane to Dubai."},{"comment_id":"10153646192799342","commenter_b":"I hope they have to serve every minute if those 60 years! What trash!","commenter_a":"So sad......","post_message":"The details of this case are just awful."},{"comment_id":"10154111304162541","commenter_b":"Shut up","commenter_a":"Like Trump, Steve Harvey is also a racist and mysognist. Between his extremely offensive dating advice for women and his extremely offensive comments about Asians, Steve and Don the Con have a lot in common.","post_message":"\"I walked away feeling like I had just talked with a man who genuinely wants to make a difference in this area,\" Steve Harvey said."},{"comment_id":"10153994656339714","commenter_b":"I'm sure God told her. ;-)","commenter_a":"And how would Carly know how the Clinton's feel about each other. PLUS -- what good for the country was Carly's statement suppose to serve??? It sure didn't make me want to vote for her. We don't need more petty.","post_message":"Carly Fiorina had it out for Hillary Clinton at last night's #GOPDebate."}]
