[{"comment_id":"10152985971730090","commenter_b":"Hillary wouldn't have stayed with bill if he was not president. She lies about every thing . Her lies got 4 good Americans. Killed in Benghazi now she is running for president again. She don't deserve it.","commenter_a":"She didn't do a good job when Bill was in office, what makes you think she could now?","post_message":"Why don't you want Hillary Clinton to be President? @webpagelink"},{"comment_id":"10153977079018717","commenter_b":"@username i agree there certainly is an issue which needs to be on a high priority list.","commenter_a":"Come on everyone!! Cut the crap!! Humans lives matter!! Nuff said.","post_message":"The owners thought it was a good idea at the time, but a slogan for a restuarant menu item has turned into a controversy!"},{"comment_id":"958393367537826","commenter_b":"All blacks destroy their housing and no whites do right Shawn?","commenter_a":"Yeah how dare those desperately poor people in Africa decide what they can do with their own resources to get some income from wealthy people who want to spend it.","post_message":"52 percent of all lion trophy exports end up in the U.S., and its share of the trophy trade has been growing. #CecilTheLion"},{"comment_id":"1154585737915740","commenter_b":"She wasn't going anything wrong. Shame on these liars!!!!!!!","commenter_a":"No class . Needs to move to Detroit where she belongs .Lol Trump for president","post_message":"What Michelle Obama Was Caught Doing At Nancy Reagan's Funeral Will Make You SICK The Obama's have absolutely no respect. Do you think she is the worst first lady ever?"},{"comment_id":"10156021598895354","commenter_b":"And she is a witch and should be hunted-certainly not a good witch-her broom needs to be parked","commenter_a":"To think Obama and Bill Clinton are playing golf tpgether. I guess they feel shes going to jail anyway.","post_message":"So wait, you're saying Obama's Justice Dept. is conducting a politically-motivated witch-hunt via the FBI??? #NiceTry #LiberalLogic"},{"comment_id":"10156625671370354","commenter_b":"Dork....","commenter_a":"He's a black man who don't no shit about running a country","post_message":"“I’m a black man who sometime wears his hat on backwards,” Obama said. And the rest is, well, you'll see..."},{"comment_id":"10152655147557267","commenter_b":"Plain english","commenter_a":"No bill should be over ten pages long, nothing else added and in plain English a fifth grader could read","post_message":"I voted ‘no’ on final passage of H.R. 240, the Department of Homeland Security Appropriations Act of 2015, which was ultimately stripped of provisions to stop the President’s executive action on immigration. Read my full statement here: @webpagelink #idpol"}]
