[{"comment_id":"10153333221058984","commenter_b":"illegals cant vote and thats a fact","commenter_a":"yes especially with this crap happening in europe w radical muslims id say def close the borders latin americans dont want that crap either","post_message":"If you don't believe immigration is going to be THE issue in 2016, read this. My eyes were opened in a big way.  Do you support securing our borders?"},{"comment_id":"1619415335012246","commenter_b":"Who do they think they are that they can come over to our country and try to change it? When they come here they have to obey our laws! This is our country not there we were to go to their countwe would have to obey their laws!","commenter_a":"Love the US & abide by our beliefs & the law of our land. Under God we trust & our constitution. Or GET OUT period.","post_message":"Here response is sickening.  These radicals must be stopped."},{"comment_id":"1756628007939155","commenter_b":"Stop and think!....before you vote for Hillary just to have a female as President...You are hanging yourself for women making it again in the future. Stop and think!","commenter_a":"DUNP THE TRUMP & GUILIANI!","post_message":"MAYOR RUDY GIULIANI STATEMENT ON LATEST CLINTON FOUNDATION DONOR SCANDAL:                           (New York, NY) – Former New York City Mayor and U.S. Attorney Rudy Giuliani today released the following statement on the Associated Press’ analysis revealing that 55 percent of Hillary Clinton’s non-government meetings while at the State Department were Clinton Foundation donors whose contributions totaled at least $156 million:   “From the facts revealed to-date, it is impossible to figure out where the Clinton Foundation ends and the State Department begins. It is now abundantly clear that the Clintons set up a business to profit from public office. They sold access and specific actions by and to them for money. This makes a mockery of her promise to Congress and the President to keep the Clinton Foundation and the Clinton State Department entirely separate. In other words, they merged the two into the Clinton Family racketeering enterprise. The need for a Special Prosecutor to investigate these apparent crimes mounts with every passing day and the revelation of new sets of e-mails and phone logs. I’m sure all we’ve seen is the tip of the iceberg and there will be more to follow.” -Rudy Giuliani"},{"comment_id":"478833062241288","commenter_b":"We all know O-ass is reallllly stupid","commenter_a":"Obama'smass army of Murders.","post_message":"Here's what the NYPD Commissioner thinks of President Obama's plan to reduce overcrowding in federal prisons."},{"comment_id":"10153286809849726","commenter_b":"She is a racist","commenter_a":"What a loser ..Disgrace to the United States..","post_message":"WATCH: Ann Coulter Blasts Michelle Obama on Race: 'I Think She's Just Letting Out Her Reverend Wright Now'"},{"comment_id":"10154064486021509","commenter_b":"Sure they alienate all woman","commenter_a":"A lot of you folks are so quick to follow the narrative. There has not been a debate in years. Just mud slinging and popularity contests. One thing is true though, the only thing the Clintons should be doing is life in prison. What a dirty dirty dirty duo.","post_message":"Could the GOP's opposition to Planned Parenthood at the #CNNDebate be a general-election vulnerability? Hillary Clinton's top aides seem to think so: @webpagelink"},{"comment_id":"10153663698070950","commenter_b":"I am not goin any where...I am a women of God and you need to read your bible,and as far as my gun,i carry it every where i have a permit and the right to carry it","commenter_a":"All of these peoplev are goin to hell if they dont frepnt,And im not giving my gun up for noone,im a responsable gun owner and its my right to carry a gun.....All these gay people need to repent cause he is coming back!!!","post_message":"Motorcyclists, parade-goers march on in L.A. march on during their annual gay pride parade:"}]
