[{"comment_id":"10156282327890294","commenter_b":"screw u u hateful witch\\\\","commenter_a":"Society isn't the problem. Men dressing like women and visa versa is the problem. Also, walking in to traffic is a problem. Don't walk in to traffic. Don't blame other people for your actions.","post_message":"“From a very young age I was told that people like me are freaks and abominations, that we are sick in the head and society hates us. This made me hate who I was, \" she said in the post.    She asked others to share her story and said, \"Please help fix society;\" then she did something heartbreaking:"},{"comment_id":"472935749563672","commenter_b":"Able bodied people that are on welfare should be required to work. Taxpayers have to work, why not the leeches on welfare.","commenter_a":"If they are able to work,then yes. They should have to work. Same as they should be drug tested.","post_message":"These free loaders just got some very bad news.  Awesome. It's about time these people are put to work.  Do you agree that people on welfare should have to work?"},{"comment_id":"10156924432505354","commenter_b":"No! What people do sometimes astounds me!","commenter_a":"@username did you hear about this?","post_message":"Tree Hugger Causing Seattle Traffic Back Up  “Issue appears to be between the man and the tree,” Seattle police tweeted...  #ManInTree"},{"comment_id":"995007177263648","commenter_b":"@username if you are still pro refugees after this video, I don't know what to do with you.... And this are things that are not only happening in France, but in Austria, Germany, and several other countries","commenter_a":"All you Obama haters suck!! Just another bunch of racists who want to vent there vile shit.. Any excuse.. Like yeah if your Muslim your a terrorist if your black your a mugger or rapist.. Retards!!","post_message":"Obama Doesn't Want You To See This: The Muslim Refugee Crisis in Europe"},{"comment_id":"10154244033251519","commenter_b":"So @username does not use gas. Good for you.","commenter_a":"Hey they lost a war. Get over it. Ppl been fighting ppl over land since the beginning of our time, even animals do it. What makes Indians so special?","post_message":"Salon's Charlie May was at Standing Rock as protesters celebrated the recent #DAPL news. Veterans, including Wes Clark Jr., bowed and asked Native elders for forgiveness.  Read more: @webpagelink"},{"comment_id":"10152781007061615","commenter_b":"Our veterans go without while lazy a**es and foreigners collect cash, food stamps and free medical. What's wrong with this picture??? VETERANS AND ALL MILITARY SHOULD COME FIRST! They put their lives on the line so the lazy idiots and illegals don't have to. WAKE UP AMERICA AND GET YOUR PRIORITIES STRAIGHT!!! Rant over.","commenter_a":"but it was OK that he put his life on the line for this country give the man what he deserves","post_message":"DENIED. An American hero, unable to collect his military benefits when he needed them most. WPXI Rick Earle gets help for this veteran. His story is coming up tonight at 5:45 p.m."},{"comment_id":"494982004030385","commenter_b":"The towers that Donald Trump built ... Border Patrol endorses you to build that wall too, Mr. Trump ... A BUILDER ... not a destroyer ... of American liberties/freedom FOR POTUS!!! @webpagelink @webpagelink #DONALDTRUMP #POTUS #REPUBLICANPARTY #GOP #2016ELECTION #BORDERWALL #BORDERPATROL #TRUMPTOWERS #PRESIDENTIALPRIMARIES #VOTETRUMP #TRUMPTRAIN #MAKEAMERICAGREATAGAIN","commenter_a":"7% lead is good but you know that you need to win by double digits to shut ted up. IF you have any last minute secret weapons or anything you haven't used now is the time. Win NY huge and then take Cali and then proceed to destroy the liar and the commie.","post_message":"Thank you, California! I will see you soon! Have a great day - and remember - - TOGETHER WE WILL MAKE AMERICA GREAT AGAIN! #TrumpTrain"}]
