[{"comment_id":"1405534516411777","commenter_b":"Yet, @username, the GOP has declared their Cleveland Convention a Gun-Free Zone!","commenter_a":"Senator Murphy, when will you learn about guns and understand the meaning of the 2nd Amendment? When will you stop infringing on legal gun owners and take the guns away from criminals? When will you outlaw gun free zones, which are obviously attracting all these liberal lunatics wh commit these horrendous acts against innocent people? When will you and other democrats come up with common sense ideas that punish criminals and not legal law abiding citizens? I'll wait for your response!!","post_message":"Taking your questions live with Senator Cory Booker"},{"comment_id":"10153151656451336","commenter_b":"Prayers for our Country. This woman is a tyrant!","commenter_a":"The last person on earth we need as president.","post_message":"BREAKING NEWS: Hillary Clinton announces 2016 presidential campaign. @webpagelink"},{"comment_id":"10154264665781336","commenter_b":"No @username My dad is a legal immigrant my dad learned today that his vote is worth crap and the party will NOT listen to his vote and they will do whatever unless you bribe politicians You can take your negativism and stuff it up your butt","commenter_a":"Why even be a Republican or Democrat when they throw away your vote and DO NOT LISTEN No LONGER a party member of anything","post_message":"\"We don't feel that this was a fair process. The Trump button got checked more than any other, so why do we have so few delegates?\" said State Treasurer Jeff DeWitt."},{"comment_id":"10153865270269749","commenter_b":"Gillian..you too are vermin! We must make sure that you do not breed indiscriminately!","commenter_a":"Foxes are vermin and very distructive for farmers, not the cuddly toys as always portrayed by the media. However what is the most humane way to cull them.. A bullet is best but only if you are a very good shot as a wounded fox can take days to die. Poisoning is also a slow death. Trapping is just as bad as they can take days to die or try and chew off their own paws. So it looks like there is no easy answer, and no we cannot just let them breed indiscriminately without some control as you would understand if you saw the havoc they can cause especially in the lambing season.","post_message":"\"Fox hunting is a pursuit from the past and like the overwhelming majority of the population I believe that is where it should stay, consigned to history.\""},{"comment_id":"10154204245296770","commenter_b":"This woman belongs in an asylum!","commenter_a":"She is a freaking idiot and that's fake news","post_message":"House Minority Leader Nancy Pelosi called for an official probe into President Donald Trump’s ties to Russia Sunday."},{"comment_id":"10153198531370950","commenter_b":"Yes, she was just hoping some cop would come in and throw her across the room. See how stupid that sounds?","commenter_a":"def smell a get rich quick scheme in the works :( ugh ...........it was all her own damned fault ,,,,,,,,,,,no payment is deserved !!!!","post_message":"\"She now has a cast on her arm, she has neck and back injuries. She has a Band-Aid on her forehead where she suffered rug burn...,\" the student's attorney told ABC's \"Good Morning America.\""},{"comment_id":"10154420186151194","commenter_b":"Allah is shopping like à sodomized bitch right now","commenter_a":"who just saw that giant fuckin orb?","post_message":"LIVE: Anti-ISIS military op near Mosul, Iraq"}]
