[{"comment_id":"1371535832866166","commenter_b":"What's wrong with strippers? Lol","commenter_a":"I cant believe you fools who support absolute political corruption.... you will lose your homes and jobs, mark my words, she is Obama part 2, choose wisely sheeple","post_message":"ELECTION DAY: People are casting their ballots across the country today. Have you cast your vote yet? Who do you think will win? Our coverage starts at 4 p.m."},{"comment_id":"10153836514883797","commenter_b":"Why don't young ladies have enough sense to do background checks on these idiots before they shack up with them, have kids with them...","commenter_a":"Omg that's so sad","post_message":"HEARTBREAKING: Cecelia has just moved with her two children from the Detroit area for a better life. But Friday night, her ex-boyfriend used a dog leash to strangle her and her two boys. The last thing she ever said to her mother before her death will break your heart:"},{"comment_id":"10154607163603124","commenter_b":"Awww! You know me","commenter_a":"@username look how cute!","post_message":"Feline stressed? Try to stay paw-sitive! @webpagelink"},{"comment_id":"10154796550641509","commenter_b":"Liberals must leave the country !!!!!","commenter_a":"Are you interested in joining the illuminati to be rich and to achieve your desires in life? If yes, Add me and Message me now so I can introduce you to the gate way to success.","post_message":"Experts warn that these labels do not really mean very much and can even be misleading in some cases"},{"comment_id":"10153924016401130","commenter_b":"Oh grow up all of you. Why should she need to put a cover over her breasts. You put a cover over your mind and give thanks that mothers can feed portably whilst not being excluded. I'm sure you can train your mind to manage to view a pair of breasts as a feeding devise and look at how your own mind processes this function. Women relinquish enough do to our biology - can't we at least feed and belong at the same time?","commenter_a":"She should have stayed home. Not her day.","post_message":"Now THIS is a cool mom. 😎"},{"comment_id":"1331853210182520","commenter_b":"Yay fast food workers making more money then military let's go.","commenter_a":"I hope everyone that vote yes on this realizes that wage increase comes from somewhere and it isn't going to be from your employers share of the profits. So when you get laid off, loose your paid vacation or other benefits.... you only have yourself to blame.","post_message":"PROP 206 ON A MINIMUM WAGE INCREASE HAS PASSED!"},{"comment_id":"10153958527368822","commenter_b":"apparently you havent done your homework or been around long enough to have seen and heard her bigot comments in the past. She stated she will raise all taxes and healthcare. unless you are wealthy and dont care about others who are not your ok with paying more. Also I would still love to see Bush in prison right beside OBUMMER and KILLary. She is not for woman. She was the lawyer for a man who raped a 14 year old girl and got him off. Do some homework. Ive studied both sides and a liar , a cheat and a murderer for president of my country. our country that so many have died for no F_G way. Your so hung up on a stupid wall and blinded on real issues. Our parents and grand parents have worked all there lives for ss and its a loosing battle because the ...","commenter_a":"So to the people that are angry by this. You are willingly admitting that you are and support racism, bigotry, homophobia, xenophobia, getting rid of women's rights, allowing abuse of children and women to be legal. To literally rounding up whole races of people tagging them and putting them in camps. Exactly what the Nazi's did. You are saying that you are unable to think for yourselves, that you think there is this america that you are being held back from that doesn't actually exist. If so I hope you are proud of being a horrific human being. You are a traitor to America and all that it stands for. You are scum, a filthy plague on human society. You are the embodiment of everything that you hate.","post_message":"\"We are a city of bridges, not a city of walls,\" said Congressman Mike Doyle, referencing Donald J. Trump, at Clinton-Kaine rally in #Pittsburgh."}]
