[{"comment_id":"10153724968238145","commenter_b":"Wow the desperation of perverts grown woman don't want you so you seek a teenager . Get rid of scum bag .","commenter_a":"Glad they got him.","post_message":"BREAKING: This happened at the Publix on SR-434 and Wekiva Springs Road. Angela Jacobs will have a live report at 12pm."},{"comment_id":"1420936454624649","commenter_b":"I hope that this administration will figure out how to keep us safe without becoming totally isolationist. Not all immigrants or Muslims are terrorists. Weed out the bad but don't turn away those who honestly need our help and who only want to make this counrty a better place.","commenter_a":"Do you know you have done more than every other country to help?","post_message":"Senior Politics Writer John Haltiwanger is at JFK International Airport where there's a massive protest against President Donald Trump's refugee and Muslim traveler ban."},{"comment_id":"1803336319885605","commenter_b":"'@username 'She can watch the oath from a cell like she deserves' Proof or you're a dirty liar.","commenter_a":"I borrowed these words from Daniel Greenfield who wrote them a few months ago in Front Page Magazine: Clinton has spent a third of her adult life trying to become president. are hoping that Hillary will go to jail. But the anger, frustration and bitterness that will gnaw on her after wasting decades and a small fortune on two failed efforts to win the White House in which she had every advantage only to lose before even leaving the starting gate will be worse than any prison. January 2017, Hillary Clinton will be sitting in front of a television set watching someone else take the oath of office. Nothing the penal system has to offer would be a harsher punishment than that moment.","post_message":"Six of the biggest takeaways from the FBI's investigation."},{"comment_id":"10154324969511729","commenter_b":"How are they terrorists again ? Becus your tv said so ? They were where they shouldn't have been ...if Iran had war ships on the American shores America would nuke that country please stop with that bull shit all of a sudden people care for their army but when they come back broke homeless and jobless no one bats an eye no one takes time out of their lives to do shit about it no one protests to get them help ...so please shut the fuck Up with this false emotion","commenter_a":"A real president would have removed any hope of sanctions relief upon hearing reports that a terrorist regime had abducted any of our service personnel and had a carrier group steaming its way to the gulf with an ultimatum that those sailors be released immediately or else. But instead we get incompetent pandering from Lurch and Oblivious.","post_message":"Quite possibly the most ludicrous thing yet we've heard from this White House..."},{"comment_id":"10153810976206680","commenter_b":"Lock that vandal up!","commenter_a":"Way better than perjury charges, obstruction of justice, mishandling of classified documents, racketeering (Hillary) or fraud charges (Trump.) Jill spray painted a bulldozer and I would have too had I been there. They were bulldozing ancient barrial grounds and putting in pipelines without concent or respect for international law. #imwithjill","post_message":"Green Party presidential nominee Jill Stein is facing vandalism charges in North Dakota."},{"comment_id":"491174087737551","commenter_b":"Muslims offend me. Ban them from the U.S.","commenter_a":"BS!","post_message":"Muslims Want to Change Our Nation and Obama is letting them..."},{"comment_id":"1782160282048254","commenter_b":"She needs to her big ass and I'll out of the country.oh I'm probably on the hit list now.","commenter_a":"guess time will tell....when he wins it will be interesting to see how some of these people deal with all they've said and done. i wonder if hillary is getting packed to leave the country on the 9th. i heard she's transferred big bucks out of the foundation to another country just in case!!!!! her plans for the white house will be plans for the big house when she looses!","post_message":"Karl Rove says there is no way Trump can win the election because of 'the campaign he's running'. Do you think he is right?"}]
