[{"comment_id":"10153860953039614","commenter_b":"Total fool.......actually wore than Hitler. Hitler is dead. Trump is still with us. For now.","commenter_a":"Clown","post_message":"A heckler interrupted Donald J. Trump at a rally in South Carolina, as the billionaire presidential candidate called for a 'total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what the hell is going on.'  'They have no respect for human life,' Trump said, referring to 'people that believe only in Jihad.'  He has previously called for surveillance against mosques and said he was open to establishing a database for all Muslims living in the U.S.  Read KTLA's story here: @webpagelink"},{"comment_id":"1638130873118424","commenter_b":"'@username we have to save American lives and that means keeping Hillary Clinton out of our WH!!!","commenter_a":"Desperate - can't stop the 'Trump Train'! It's way too late - you GOP establishment idiots are the ones who are making it possible for the democrats to get 4 more years to continue to destroy this country! Just because Mr Trump doesn't lean to the 'far' right, doesn't mean he's not a Republican! I don't lean to the 'far' right, but I am a Republican! It's time for some real middle of the road compromising - more real and true policies will get passed and the stagnant economy, security, and the best welfare of Americans will come to fruition! Won't buy national review ever again - especially since they have nuts like beck involved!","post_message":"As it's starting to look more like Donald Trump will be the Republican nominee, some in the conservative movement are viciously attacking the NYC businessman. Trump supporters are going to be furious when they see the cover of this magazine...  Will this attack influence who you support for president?"},{"comment_id":"10153642816391130","commenter_b":"Fk this bitch","commenter_a":"What a horrible article.","post_message":"One reason? Bernie Sanders is 'too old.'"},{"comment_id":"817910918313603","commenter_b":"there in panic mode now. they will say any thing in hoping it will stick. Trump 2016!","commenter_a":"We been speaking out against racist police since 1776.......","post_message":"'For the past 7 years the folks have been witness to ... intense verbal attacks on police officers, labeling them racists ... a culture that now demands political correctness, even if it goes against sincerely held religious beliefs.'  In his 'Talking Points' tonight, Bill O'Reilly explained why he believes Donald J. Trump is appealing to voters. Do you agree? bit.ly/1TuevKb"},{"comment_id":"10155521409275354","commenter_b":"Europe is more evil but we r getting there","commenter_a":"The US is so backwards when it comes to nudity. It's commonplace in Europe.","post_message":"Free the Nipple!"},{"comment_id":"592533384204588","commenter_b":"Matt, she's just another dumbass liberal !!","commenter_a":"TRUMP THE GREAT {ONE AWESOME GUY }","post_message":"Trump: 'We must replace the present policy of globalism....and replace it with a new policy of Americanism.' How do you feel about this?"},{"comment_id":"1245719035484009","commenter_b":"Is the translation is correct? If yes why he should bother. He can marry any time and breed","commenter_a":"This is why America has never nor should have open borders.","post_message":"Video captures a Syrian mother and father preparing their two daughters, ages 7 and 9, for jihad suicide missions."}]
