[{"comment_id":"10153726432609087","commenter_b":"I'll buy her plane ticket","commenter_a":"Bye","post_message":"“I know a lot of people have been threatening to do this, but I really will,” Lena Dunham said about moving to Canada if Donald Trump is elected president."},{"comment_id":"860972087426701","commenter_b":"ABSOLUTELY NEEDS TO GO TO PRISON FOR LIFE WITH HARD LABOR . MAKE HIM CLEAN TOILETS WITH A TOOTH BRUSH .","commenter_a":"Good Luck Generals....he's pretty slick...watch out for the fall out!","post_message":"Obama has betrayed our country. These generals are moving in to arrest him. Do you think Obama should be put behind bars?"},{"comment_id":"10153665753806336","commenter_b":"That was THEN! This is NOW! The law of the land NOW is all that matters! Let go of the past and get with what needs to be done now! NO more illegals. I don't care if they are baby's or adults, they have to go back! They don't belong here period!! Stop saying we are all here illegally too, it makes it clear you think it is ok for these things to happen. I see most of your last names are hispanic.","commenter_a":"The correct term is illegal alien not illegal immigrant...read the constitution..those people have no rights here and neither do those born here from illegal aliens...the constitution says they are not citizens of this country.","post_message":"Border Patrol officers near San Diego noticed that the driver, a U.S. citizen, was acting weird, so they used imaging technology to inspect the car."},{"comment_id":"10152745228401615","commenter_b":"being lesbian doesn't make them superior... they could easily end up divorced single mothers too.","commenter_a":"Most marriages end up in divorce and children are raised mostly by struggling single mothers. Those mother's present the mother And father role. Having two mothers appears to be a blessing! :) Children need love, structure and room for growth. So, haters just sit down and if you love children so much the foster care and group homes have many of your neglected and abused children waiting to be adopted and loved.","post_message":"Yes, they're both pregnant, but about a year apart..."},{"comment_id":"10153147282168701","commenter_b":"Shut up Leah Jesus Christ.","commenter_a":"GUILT BY ASSOCIATION! I GUESS IN AMERICA YOU CAN BE HELD RESPONSIBLE FOR WHAT OTHERS DO, I THOUGHT YOU WHERE INOCENT UNTIL PROVEN GUILTY, BUT THE WHORES OF SOCIETY-AKA THE NEW STATIONS, REPORTERS, OREGONIAN, HAVE TRIED, COVICTED, AND SENTENCED A MAN FOR CRIMES HIS GIRLFRIEND COMMITTED, SOME PRIOR TO THEM EVEN MEETING BUT SOME HOW IT IS HIS CRIME, SHAME ON YOU WHORES!!!!","post_message":"Here's the full resignation letter from Gov. John Kitzhaber, who says: \"I understand that I have become a liability to the very institutions and policies to which I have dedicated my career and, indeed, my entire adult life.\""},{"comment_id":"10154848442742235","commenter_b":"Duh, you think! Not a difficult prediction","commenter_a":"I'm sorry but GOOD. I hope this country is brought to its knees. Then maybe. Just maybe people will get their heads out of their asses","post_message":"A sociologist who predicted the collapse of the Soviet Union and 9/11 attacks warns that American global power will collapse under Donald Trump."},{"comment_id":"1088028091217546","commenter_b":"They'll just keep those desperate women safe in prison","commenter_a":"To all of the people who believe in blocking a women's right to choose by making legal abortions harder to obtain and want women to travel hundreds of miles to get one, if the law in Texas passes, I shudder to think how many \"complications\" (as if that was *really* the GOP's concern at ALL) there will be when desperate women resort to desperate measures. #keepabortionsafeandlegal","post_message":"The Supreme Court, two days after hearing a major abortion case from Texas, on Friday temporarily blocked a Louisiana law imposing regulations on doctors who perform abortions in a move that would allow two recently closed clinics to reopen."}]
