[{"comment_id":"1558275617531277","commenter_b":"NICE PERSON..SHE LIES, ARGUES LIKE HE DOES. INTERUPTS,ALL SHE DOES IS TRASH HILLARY","commenter_a":"She really seemed like a nice person and I am hoping she gets as far way from that idiot as she can. She is way too good for him. She was going down the tubes with him.","post_message":"The wheels are falling off!"},{"comment_id":"10157409839305389","commenter_b":"CROOKED HILLARY everytime she Open her Mouth LIES come out !","commenter_a":"definition of a liberal: liar, thief, flip-flopper and now CORRUPT","post_message":""},{"comment_id":"10156323895095354","commenter_b":"@username Your not aware of everything that went on or was said. I \"ASSUME\" he told her to GET UP and being Defiant and Arrogant she decided \"I'LL DO WHAT I WANT TO DO\" . She should have STOPPED what she was doing when she was TOLD TO. It was Harsh but perhaps the rest of the Class learned a Lesson. Crap like she pulled Disrupt a Class ands children that WANT to LEARN can't.","commenter_a":"Yes good for the cop, if you do not like this then do what your told to do by the cops.","post_message":"The FBI and DOJ have jumped in..."},{"comment_id":"10150953576709999","commenter_b":"I know plenty of women who do this kind of thing in their little girl circles. It's just ridiculous that men get penalized for acting this way and women can do the same thing and nothing happen. This nation is full of reverse racism and reverse sexism. The things women say to each other in private can be just as dirty as what men say. On that note. TRUMP2016!","commenter_a":"Ivy League males can be pigs too. Well done. Now can we please raise the bar for male behavior ? Starting with the one running for office, by kicking his chauvinistic but off and continuing with everyone else, please ?","post_message":"A 9-page document contained photos and numeric ratings of female players at Harvard University in sexually explicit terms."},{"comment_id":"10154551576694030","commenter_b":"White people love mayo and ranch. I lovvee ranch bruh.","commenter_a":"I didn't see this as particularilly white. Like people of color don't use mayo?????","post_message":"You can't help who you are. Kyle Kinane's Loose in Chicago premieres tonight at 12a/11c."},{"comment_id":"10153745927208635","commenter_b":"So did these heterosexuals just go about Christians with strong beliefs just to cause trouble? @webpagelink","commenter_a":"It is funny how LGBT people seem to go after christians with strong beliefs in this area just to cause trouble.","post_message":"Wyoming Supreme Court may dismiss Judge Ruth Neely for refusing to preform gay marriage due to her religious beliefs"},{"comment_id":"10153445196113984","commenter_b":"She has no right to control any thing!","commenter_a":"Not only does she not have any class, she is ugly and gross! I do not care if she is republican or democrat she is just nasty!","post_message":"This has to be very embarrassing for the First Lady. Hopefully this doesn't make her try even harder to control Americans... Do you think Michelle Obama as First Lady is bad for America?"}]
