[{"comment_id":"1131104760243867","commenter_b":"Because no feminist says that.","commenter_a":"So when feminists say, genders should be separated in school, it's just a valid opinion. But if a straight white male says the same thing about science labs, it's sexist? How does this logic work? Oh, sorry, I forgot it isn't logic, it's stupidity. ;)","post_message":"I'm crying with laughter over some of these."},{"comment_id":"892938524096132","commenter_b":"Don't hate immigrants--- hate law breakers. Invaders have to be stopped. Tax payers can't afford them. Do it legal or don't come at all.","commenter_a":"Why do you all hate immigrants? Your grandparents were immigrants.","post_message":"In the U.S. House Judiciary Committee, we introduced legislation to strengthen the interior enforcement of our immigration laws by allowing state and local governments to enforce federal immigration law. By doing so, we remove the ability of this or future Presidents – of either party – to systematically shut down portions of the law to suit their political purposes. WATCH:"},{"comment_id":"10153806670970329","commenter_b":"No. I'd rather have this Screw spiders","commenter_a":"THIS IS WORSE THAN 100 SPIDERS","post_message":"Always look under your bed! (via BuzzFeed Trending)"},{"comment_id":"10154428184215695","commenter_b":"Marely Hernandez leaving a baby alone in an apartment is neglect. I may tell my next door neighbor to watch my dogs while I am gone but if I leave a child I will have someone in the residence with that child. You will see what the definition is when she goes before the judge and faces charges. No one should ever drive without a license regardless of why they are doing it. Breaking the law is breaking the law. A criminal is a criminal! You leave a child alone and all children should be removed from the home until you can prove you are capable of providing a safe environment. It seems that many people need to take parenting classes!","commenter_a":"Just wondering , why did the officers randomly walk into her place ? .. Or should I read the article ? Lol","post_message":"Officers say they found the door unlocked and the child sleeping alone on a bed surrounded by pillows."},{"comment_id":"10158072025935354","commenter_b":"I'm for @username!!! How does the left even get through the day?!!! So brainless!!!","commenter_a":"This campaign has shown us how truly mentally ill a large part of our population is.","post_message":"America is seeing the Left for the hate machine it truly is.   #Exposed"},{"comment_id":"10157577335255389","commenter_b":"Gonna rain in wall street. The same ones you took millions from you pathetic lying hag","commenter_a":"its hard to listen to her speaks! the first thing came out of her mouth was Trump says did and Trump says that and what Trump did! nothing change she offer nothing! she looks doll up but still a liar!!","post_message":"Journalism. Is. Dead."},{"comment_id":"485248075011731","commenter_b":"thats one ugly he bitch","commenter_a":"To damn bad","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"}]
