[{"comment_id":"1043277849065296","commenter_b":"Stupid cow! Needs to get over herself","commenter_a":"What a cow!!!","post_message":"'His career won't suffer, but I've been told I'm ruined'"},{"comment_id":"939907909435597","commenter_b":"Aren't most Americans 'Economic Migrants'?","commenter_a":"Then we have to accept everyone that comes to America theyre refugees well so are people who are running from drug cartels","post_message":"It's the American thing to do. What better way to show Trump and the rest of his racist rivals that they do not represent us?"},{"comment_id":"10153106076119255","commenter_b":"We have so many publications on both side that are mudslingers with out facts--about time both sides clean up their act and print thing to promote and support","commenter_a":"'@username only wants to stir the pot recently!","post_message":"They were insiders. Home grown. Godly. Our neighbors, friends, and kin. People like us.  By Bill Moyers"},{"comment_id":"10153909407028598","commenter_b":"Girls, start being more selective of your boyfriends. Think first and maybe you won't regret your actions later.","commenter_a":"I hope someone puts him out of commission!!!","post_message":"Boyfriend and Two Others Assault Pregnant Teen, Punch Her Stomach to Kill Her Unborn Baby"},{"comment_id":"10154973344274166","commenter_b":"'@username my daddy would never. Then again he's only had one wife and never talked about groping his children.","commenter_a":"They about to get cozy. He is so in lust with her.","post_message":"Here's a look at Pres. Trump and daughter Ivanka as they departed Washington unannounced to honor slain Navy SEAL Chief Petty Officer William 'Ryan' Owens. Read more: @webpagelink"},{"comment_id":"530424503814796","commenter_b":"I'd be out of a job!","commenter_a":"what is illegal is letting ASS HOLE groups like the GAY patriot put their STUIPD SHIT on facebook they should be put in jail for life","post_message":"A popular company is forcing their employees to wear head scarfs.  This has to be illegal.  Would you quit if they tried to force you to wear a headscarf?"},{"comment_id":"630472157108961","commenter_b":"'@username you too bitch","commenter_a":"This is not a man.........he's a crazy kid........wanting notarization. Why not go after Obama who continues to destroy our country and it's citizens!","post_message":"Here is the man who tried to kill Donald Trump yesterday:"}]
