[{"comment_id":"1836028549960584","commenter_b":"She is our next President.actually Trump made it easier for her .","commenter_a":"Yeah, it pisses me off ... but my respect for her has just gotten greater.","post_message":"She and her supporters smile and thrive despite a daily avalanche of hatred."},{"comment_id":"10153451761433701","commenter_b":"That is NOT a tranny yo gooF! WOWO!! how do you not know a drag queen when you see one.. and btw... he would knock you out for identifying him inappropriately. so your surround sound is broken Debbie","commenter_a":"Seriously posting this in that manner is bullying. Wild interview? About to go viral? More like a compassionate individual & who cares what she looks like or which way she swings.","post_message":"It's a story about a bad crash in Mississippi, but the animated eye witness is stealing the spotlight. This is one wild interview that's about to go viral. Take a look"},{"comment_id":"10153543784611130","commenter_b":"Bitch where?","commenter_a":"Why are some Android users so concerned with Apple? I know as an Apple user, I could care less about what Android does. It's not really the competition some make it out to be if it's one-sided...","post_message":"Great news for Android."},{"comment_id":"1267539270005791","commenter_b":"@username , is it all intelligent, competent and strong women that intimidate you, or just Hillary? Hillary 2016","commenter_a":"He can only intimidate weak people... She's the exact opposite of that! #VoteBlue","post_message":"BOOM."},{"comment_id":"10153312021701756","commenter_b":"Please Sharon, share sources of actual statistics/studies for this belief. Thanks.","commenter_a":"How about environmental impact? How about helping ourselves? It seems apparent to me that most people truly do not care about animal welfare.","post_message":"Three activists, three answers on how veganism — or vegetarianism, or even just cutting way back on meat consumption — can actually make an impact for animals, and for global inequality."},{"comment_id":"10153183400371336","commenter_b":"The 3% are not in love with the wealthy. We are in love with the constitution of this land. The wealthy like Gates want to enslave the world, how does that fit into the constitution? It don't. Lets bring the USA BACK TO HER ROOTS","commenter_a":"Your govt at work folks. Remember when you vote don't vote because of the party line vote because of principles. This country needs a wake up call really bad. We need a revolution badly in America but the problem is the Americans are too scared to do anything.","post_message":"The report asserted that “spending decisions entirely under the IRS's control led to 16 million fewer taxpayers receiving IRS assistance this filing season.”"},{"comment_id":"10153614097404199","commenter_b":"Victim or not, that was still unacceptable behavior. She tried to attack her! That lady could have just kept going.... BUT she chose road rage.","commenter_a":"That mom wasn't scared. She was pissed at the person driving recklessly. If she was scared, she could of pulled herself out of the situation at many different side roads and pull offs. She choose to keep following someone she new was driving aggressively putting herself and child in more danger.","post_message":"UPDATE:"}]
