[{"comment_id":"920944947962651","commenter_b":"soo then Michael is right , those other species of plants are no good , , chop em down & replace them with hemp.","commenter_a":"they need to fix this, and they can, if every person in China planted even just one tree, imagine :) Jude","post_message":"This documentary film went wildly viral with over 200 million views in it's first week online. Now Chinese officials are afraid that you'll see it too."},{"comment_id":"10153889238948984","commenter_b":"Send them BACK to Syria!","commenter_a":"Go back....","post_message":"You would think that Syrian \"refugees\" wouldn't be able to make many demands of their host nations. However, they have -- and some of them are completely RIDICULOUS. This should put the lie to the myth that these migrants are only coming to the West to escape persecution... and this is what Obama wants to import HERE?"},{"comment_id":"10153880483259705","commenter_b":"Samantha, this is your life.","commenter_a":"The driver?","post_message":"Mind... doesn't... understand..."},{"comment_id":"1100039356678391","commenter_b":"Worthless; wait, that's an insult to worthless people......","commenter_a":"what an idiot the reason for this is all the race baiting he and Sharpton an d Holder and his other mouth pieces have preached and preached while they comdemn America.","post_message":"What happened in Ferguson, New York City? Doesn't matter where it is, it's the result of slavery. It is the result, lingering effects of slavery, Jim Crow."},{"comment_id":"10153067188779312","commenter_b":"your a funny hoe if u wanna live like that so be it","commenter_a":"No junk food or soda Should be like the old days . Meat, cheese, bread, can goods , fresh fruits and vegetables . THATS ALL","post_message":"A Florissant lawmaker wants to prevent the ability to purchase energy drinks with food stamps. Thoughts?"},{"comment_id":"1155384687884221","commenter_b":"That's what you get for working for him.....I wonder if he ever payed the little girls who sang and danced for him for a rally","commenter_a":"Trumps motto : if you're stupid enough to trust me you get what you deserve.","post_message":"If you work for Trump, you're going to get burned."},{"comment_id":"10154007252811770","commenter_b":"It's like they forget that these idiot elitists make up 1% of the population and those of us who are her \"deplorables\" pretty much loathe Miley, Gaga (she makes me gag), Madonna and the rest of her low class disgusting amoral favs. These truly deplorable people have the OPPOSITE effect on decent hard working people and especially those who love God.","commenter_a":"Bull. bull. bull. SHE'S THE QUEEN OF CORRUPTION!!!!!!How the libtards don't get this is beyond me???Nasty woman.","post_message":"It's a real wonder how Lady Gaga didn't win the election for Hillary"}]
