[{"comment_id":"10153380129759087","commenter_b":"The countries that ban him should take the refugees. If they want to stand up for them so bad, take them. Oh ya, Dubai won't take any refugees. They are just hypocrites.","commenter_a":"Another great endorsement to vote for Donald Trump. Way to go Dobye.","post_message":"Donald Trump's name has been removed from a multi-billion-dollar luxury golf course project in Dubai in the wake of public outcry over the GOP presidential candidate's proposal to ban Muslims from entering the US."},{"comment_id":"10153644186381336","commenter_b":"If our courts allow Muslims who demand to be tried under Islam law, to actually be tried under Sharia law - why can't Christians demand be tried under Christian Biblical law? Courts allow it for Muslims. This raises a constitutional question - Under the 'Equal protection Clause' of the 5th and 14th Amendments, should Christians be afforded equal protection under the law - to be tried under Biblical law equal to Muslims demanding to be tried, and their case(s) adjudicated for crimes under Sharia law?","commenter_a":"Why can't another clerk do it ??? Problem solved !","post_message":"“Some people have said I should resign, but I have done my job well,” Rowan County Clerk Kim Davis said in a statement."},{"comment_id":"10153578446431509","commenter_b":"Africa's a mess. Look what happens when the USA forces the colonials out early. If Britain has still been in control these things wouldn't be happening","commenter_a":"Let's not forget what's happening in South Africa too.","post_message":"ISIS operatives beheaded two groups of prisoners, believed to be Ethiopian Christians, in Libya, according to a video released by the terror network's media arm. @webpagelink"},{"comment_id":"10153807094811336","commenter_b":"Maybe this woman wants the truth about Hillary's evils be known .","commenter_a":"Fox news keeps exploiting this poor woman","post_message":"“[Hillary Clinton] lied to my face at a very, very hard time, and she’s been lying since.” – Patricia Smith"},{"comment_id":"10152602108687061","commenter_b":"And a fat hoe","commenter_a":"Michelle looks more like a hoe everyday","post_message":"Pres. Obama: \"I have no more campaigns to run.\"  (audible clapping in chamber; pause)  Pres. Obama: \"I know, 'cause I won both of 'em.\" #SOTU2015 -- (click for audio) abcn.ws/1JbdOLY"},{"comment_id":"793004177467954","commenter_b":"cuck","commenter_a":"Go take some selfies Obama you fucking disgrace","post_message":"Obama is a _______________."},{"comment_id":"760883910715426","commenter_b":"We will give her up to you Iran! Go let her ruin your country!","commenter_a":"Don't you need a brain to be a spy?","post_message":"Is Kim Kardashian West a secret agent?"}]
