[{"comment_id":"1521185254588608","commenter_b":"You're talking dt supporters, wd you expect anything else?? RFLMAO!!","commenter_a":"Honest to god this is the dumbest shit I've ever seen.","post_message":"Starbucks is probably guffawing over how effective this isn’t."},{"comment_id":"10153277427691756","commenter_b":"Bitch","commenter_a":"@username: 28 years too late","post_message":"They can reshape within weeks."},{"comment_id":"10153430194047042","commenter_b":"To answer your question politically I don't like Hilary and I don't believe I would care for her personally either.","commenter_a":"How did Americans become so Dumb? No matter what kind of Facts you show them they will still support this Fool of a President.There is a Health Care Crisis is Puerto Rico yet they love this Fool.Israel will soon be whipped off the map by Iran yet Jews Love this President.Not a single Latin family has been untouched by this Man and his Policies yet we are about to elect someone worst Hilary.The Mexicans don't understand that there being used like a mule to further a democratic Political agenda.The president could have made millions of illegals legal yet there left in limbo and now he is gonna lecture us on race relations when he is the most divisive of Presidents..","post_message":"\"RACISM, WE ARE NOT CURED OF IT\": President Barack Obama used the n-word to make a point about the reality of racism in America."},{"comment_id":"795518530581327","commenter_b":"There is definitely something wrong with this lady...","commenter_a":"Bully like Hily Holbrook from \"The Help\" except for the racism.","post_message":"I can't stop laughing.....at HER."},{"comment_id":"10153071705477093","commenter_b":"^ Alex I almost did but I knew she as well as many others wouldn't grasp that concept.","commenter_a":"\" AGAINST HATE\" in Dallas,Texas SEPTEMBER 14, 2015- MONDAY At the American Airlines Center At 5:30pm....all those that want to stand against hate are welcomed. march to the... American Airlines Center In Victory Square...from Cathedral of Guadalupe Off Ross St in Downtown. Police Department will be on site but I would like to note that everyone should be very cautious & on guard. There have been reports that peaceful protesters have been attacked by Trump supporters & some dressed like protesters & assult others within the crowd & reported spitting in their faces. Have your groups be alert & camera rolling just in case, if this happens, attackers can be on record & prosecuted! Thank you everyone & remain peaceful yet boldly stand for Justice. Arm & Arm. Wearing Red,White & Blue colors.","post_message":"A \"Dump Trump\" rally is now scheduled ahead of Trump's rally in downtown Dallas tomorrow."},{"comment_id":"10153581173261337","commenter_b":"Get fucking jobs you fucking losers ass faggots !!!!!","commenter_a":"I'm pretty sure these people have more money than God! Please don't help them in there time of wrong doings!!","post_message":"DUGGAR DISASTER: After TLC cancelled 19 Kids and Counting, the Duggar family is asking for donations..."},{"comment_id":"10154382058398606","commenter_b":"These chicks will walk on hot stones for me but keep disrespecting their sisters","commenter_a":"@username Smdh. Why would anyone do that?","post_message":"More than 30 people suffered burns to their feet and lower extremities at a Tony Robbins seminar after the motivational speaker encouraged them to walk across hot coals. @webpagelink"}]
