[{"comment_id":"999929080073847","commenter_b":"Lol 1800 slap both of y'all bitches","commenter_a":"@username @username this is whats gonna happen whenever yall talk shi, ima walk my hoes lmao","post_message":"Really Out Here Walking Them On A Leash!"},{"comment_id":"10155746665275968","commenter_b":"@username so....that leaves people working and travelling abroad virtually unprotected.","commenter_a":"Those were the people in charge of the safety of all ambassadors. Wouldn't that constitute treason or gross negligence on the Trump cabinet that they don't have people in place in transition?","post_message":"😠 😨 😬"},{"comment_id":"10153293825958132","commenter_b":"Yes, she's milado so she needs to stop.","commenter_a":"She's black and white..so this always confuses me. I guess you can pick your race when it suits you.","post_message":"Halle Berry admits she's \"disappointed\" that no other black women have won the top acting prize."},{"comment_id":"1332991433380908","commenter_b":"All im saying is some people shouldnt breed .","commenter_a":"poor skinny white Jesusy guy.. HOW COME I'm THE CHUMP !! ==========>.\"roll tide/ @webpagelink","post_message":"Counter-demonstrators outnumbered attendees of a \"pro-white\" rally at Stone Mountain Park in Georgia, home to a divisive landmark that pays tribute to Confederate leaders."},{"comment_id":"10153699957431336","commenter_b":"Muslims need to stay in the Middle East. Or hell. Same thing.","commenter_a":"The Tsarnaev brothers were \"refugees\". Don't forget that.","post_message":"Secretary of State John Kerry says the U.S. will accept 85,000 refugees from around the world next year, up from 70,000, and the number will rise to 100,000 in 2017."},{"comment_id":"10153332639166350","commenter_b":"I think either Dianna Elizabeth or Elizabeth Diane","commenter_a":"Congratulations William and Kate!!","post_message":"It's a princess! Congratulations, Duchess Kate and Prince William! on.today.com/1DRmS6f"},{"comment_id":"487880261407401","commenter_b":"He got her ass good","commenter_a":"@username bruhhh lol","post_message":"Barack Obama just hilariously roasted Bernie Sanders and Hillary Clinton. #WHCD"}]
