[{"comment_id":"10153896841896636","commenter_b":"Let's talk about what about ... 1. What about Christian imperials from England who colonized, enslaved, stole and murdered people during their colonialism , don't they have Christian knowledge, 2. What about Christian Europeans colonizing America and stealing their land, murdering millions of natives, 3. What about white Christians enslaving blacks people in America treating them like animals and killing blacks for sport. Can you blame these crimes against humanity on Christian faith , NO you cannot , and you cannot blame Islam for the actions of ignorant people. Don't lower your intelligence to the level of ignorant people of past and today who are enemies of humanity .","commenter_a":"Are you trying to defend Islam by claiming that, ISIS recruits have very poor knowledge of islam ? ok, what about the radical Muslim clerics all over Europe, Asia and USA, don't they too have any knowledge on Islam ?","post_message":"Incredible"},{"comment_id":"10155816958010354","commenter_b":"GOD gave some ladies a bushel of beauty and a teaspoon of common sense.","commenter_a":"What a cruel thing to say","post_message":"Desperate..."},{"comment_id":"10154303194092042","commenter_b":"Id take anyone over Hillary. Shes a liar, a deceiver and manipulator and its all on record.","commenter_a":"That is what Donald Trump gets for once again trying to go after Hillary Clinton. If he keeps it up, well then, it's absolutely over for him. No one, I mean, NO ONE, would ever trust Donald Trump as president of the United States. It just isn't going to work.","post_message":"#DeleteYourAccount: Hillary Clinton has had enough of Donald J. Trump's comments on Twitter."},{"comment_id":"985301294841116","commenter_b":"@username woman you dip.","commenter_a":"Can’t we call Ted Cruz by his real name Rafael Eduardo Cruz? He never misses a chance to call the President “Barrack Hussein Obama“. including his middle name to make sure we all know he’s a “Muslim“….and good old “Ted” was born in the united states of CANADA!","post_message":"Do you agree with the ruling?"},{"comment_id":"10153047179116051","commenter_b":"What does being a feminist have to do with anything?","commenter_a":"WHAT an awful person. Take the baby and give it to someone who will love it.","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"756897567834154","commenter_b":"Bitch","commenter_a":"We all talk on facebook but it does no good.The women can't see what Hillary is or they haven't Google her.She was not brought up poor.never went one day without food clothes or shoes .She is a liar er and a traitor. And those who are voting for must be as bad as she is She will end USA as we see it.Hasnt the zebra done enough destroy our country? Apparently not for you dumb asses voting for the murder.I guess you have no relation in the armed forces. Because if you do there's no way you would even consider voting her in.Open your eyes","post_message":"Hillary Clinton's Career Could Be Over After She Was Caught Endorsing The KKK [VIDEO]  She is doing everything she can to get this video taken down. Let's spread it.  Do you think Hillary Clinton is not fit to be president?"},{"comment_id":"954480501354785","commenter_b":"After all the bitching and complains that one guy did I'm so happy to see this.","commenter_a":"Please don't start with you there goes the racist comments because you're a racist to say","post_message":"LIVE: Special announcement expected at Little Caesars Arena around 10am, regarding \"another Detroit franchise announcement\" - MORE at ClickOnDetroit.com (UPDATE: Kid Rock will open Little Caesars Arena with 4 shows in September 2017)"}]
