[{"comment_id":"10152942742574753","commenter_b":"I have learned a lot about you guys","commenter_a":"this goes to show you the high levels of stupidity and ignorance that exist in the white race. they think they are so smart; that they know everything. yet, they do not know that there are people as Black as me with full heads of blonde hair in this world. she should have gotten more money. there is no excuse for this degree of ignorance, today.","post_message":"An arbitrator awarded an ex-Hooters waitress $250,000 in lost wages and attorney compensation after she was allegedly fired for having blond highlights in her hair. Hooters denies the allegations and says many African-American women have worked at the chain of restaurants while having various shades of hair, including blonde, without any difficulty whatsoever."},{"comment_id":"10154362826911323","commenter_b":"In Bulgaria women sunbathe topless. Older women, too. At first it seemed a bit strange to me, then I thought \"Oh well, if a 60 year old can do that, I can, too\". That was when I stopped caring. As for underpants, not enough fabric, so I'll pass.","commenter_a":"Stupid debate. Why should it bother me how people sunbathe? I don't care if they are dressed, half naked or naked. Let everyone do what they are comfortable doing, it's not like you have to look.","post_message":"“It all depends on what type of underwear it is. If they had an Ann Summers crotchless type affair then that would be a touch odd.\""},{"comment_id":"1012141178845630","commenter_b":"She owes no one a child. Her womb is her business.","commenter_a":"maybe she used off gone on injection or pill or something instead off using nothing knowing there could be a small chance she could fall pregnant also there are alot of good people in this world who cant have kids she should off kept baby them given baby up to a loving family instead off killing a innocent life","post_message":"Woman uses IVF to conceive three kids - then has abortion for a natural pregnancy"},{"comment_id":"10155696474235389","commenter_b":"Not sure, police officers have a great sense of duty and honor.","commenter_a":"Neuter the police, this is the result.","post_message":"Question of the Day: Do you think Baltimore cops are now less likely to put themselves at risk?"},{"comment_id":"1172990589388617","commenter_b":"Bitch","commenter_a":"Marjolaine Morin","post_message":"Shouldn't their legs relax? Why do they curl up?"},{"comment_id":"10152650786516491","commenter_b":"^^hoes got problems","commenter_a":"Dont like him, Dont Respect him can care less where , Rapist, Thief and total idiot goes except to jail","post_message":"Winston lost only one game as a starting quarterback."},{"comment_id":"1555862094712251","commenter_b":"@username your mom should be happy because I will leave the country","commenter_a":"@username and by the way why is he paying his staff 12$ an hour??","post_message":"\"If you're both screaming at each other, the viewers won't be able to hear either of you\": Bernie Sanders and Hillary Clinton trade back-and-forths on minimum wage.   Live updates from the #DemDebate: @webpagelink"}]
