[{"comment_id":"519056438282649","commenter_b":"cair can go to hell","commenter_a":"Our country. .USA..AMERICA","post_message":"PLEASE SHARE AND HELP PROTECT OUR VETERANS!"},{"comment_id":"10154725067651341","commenter_b":"Now I wonder which side is truly the terrorist nation","commenter_a":"\"Netanyahu Warned New Zealand It Was Declaring War\" - what, by adhering to international law which was administered to PREVENT war?? Repeatedly violating resolutions and stealing land on some warped justification of ancestors IS a declaration of war!!! Thanks Israel for finally showing your true colours to those who remained unsuspected and blind to your callous actions.","post_message":"EXCLUSIVE: New details on Israel's last-ditch scramble to stop the UN settlements vote"},{"comment_id":"1576025939362143","commenter_b":"This is America not European dont like America go back to European take DONALD TRUMP with you ok gringo","commenter_a":"Why are people dumb enough to think people who do not want illegals in the US hate Mexicans? Or any other foreigner? It is ILLEGALS that they want to regulate, no those entering the country legally. We could do without the wall, just get more Border Patrol and more bullets...and do like other nations, shoot those crossing illegally, maybe that would satisfy the supporters of illegal immigration... Read up on Mexico's illegal immigration law.","post_message":"Former Mexico President Vicente Fox is sorry, not sorry about his big middle finger to Donald J. Trump and his proposed wall along the U.S. southern border."},{"comment_id":"10153224902339411","commenter_b":"Jonathan Toothman","commenter_a":"75% of that data is outdated wrong and non existent. i always give fake info when they ask","post_message":"Quick before NSA snaps it up"},{"comment_id":"10153331361449228","commenter_b":"I give up on our government and justice system. You mess with me or my family I'll kill you! There is no more calling the cops to help. I'm done! I can't belive this. My advice to every woman is get your cc and protect yourself!","commenter_a":"Police were still looking for him....I believe he will now be found dead from suicide..","post_message":"She was found with her teenage son.  Police are looking for this man"},{"comment_id":"10153011050796717","commenter_b":"Exactly what does that have to do with anything!","commenter_a":"Why does it matter what his sexual orientation is?!","post_message":""},{"comment_id":"10154763479136037","commenter_b":"No surprise to Hillary. She pays for this stuff. @webpagelink","commenter_a":"No matter who ultimately did this, and I hope they are caught and prosecuted, the way both the candidates reacted tells you everything you need to know about how they will govern.","post_message":"Donald J. Trump immediately blamed \"animals representing Hillary Clinton\" for the attack."}]
