[{"comment_id":"1163757976970226","commenter_b":"The man was certainly considerate in this instance.","commenter_a":"During his eight-year presidency, [George W.] Bush did take 879 days of vacation, including 77 trips to his Texas ranch.","post_message":"Wow. I never knew this about George W. Bush. When he was in the White House, he would never leave for Christmas vacation until the day after Christmas. His reason for doing so was simply amazing...  This story really illustrates the difference between Bush and Barack Obama..."},{"comment_id":"10153552105389087","commenter_b":"What an undemocratic woman.","commenter_a":"I can't stand her. She had no ideas other than the ones she stole from Sanders.","post_message":"Jeff Johnson, the head of the Washington State Labor Council, was scheduled to speak in at a pro-Bernie Sanders rally, but a pro-Hillary Clinton union affiliated with AFL-CIO threatened to take away funding from Johnson's group if he spoke at the event, forcing him to back out."},{"comment_id":"10157525764140293","commenter_b":"These people need to back off, no one understands the loss of a child much less one that is missing and not knowing if the child is alive or dead...this is their way of dealing...let them alone..","commenter_a":"I can't imagine how you go on with the uncertainty of their situation. The banner isn't hurting anything. Empathy is what's needed here.","post_message":"FEEDBACK: The parents of a child that's been missing since 2011 just want her back, but their plea is apparently someone else's eyesore.  What do you think about the way this is being handled?"},{"comment_id":"1661303277474551","commenter_b":"Municipalities the masses? Did you maybe mean manipulates? Lol","commenter_a":"The more bias tords trump just show how mutch media manipulates the masses and is shooting themselves in the foot","post_message":"'On Feb. 9, we trust New Hampshire Republicans will send 'Biff Trump' back to somewhere — anywhere but on the road to the most important elective office in the United States at a most crucial time for this nation.'"},{"comment_id":"1758550144422291","commenter_b":"73% approve and still got 4 more months. Dam fine job sir! Hillarys new add kids are watching is stupid thats all she has. Ok hillary kids are watching as you say who cares soldiers are dieing! What a piece of garbage she is time to take out the trash Trump we love you. Voters get out and vote Trump 2016","commenter_a":"Finally a strong leader to be. Mr Trump a country with no borders is not a country. Make America great again.","post_message":"I will not let this country down. I am grateful for everything I have ever been able to accomplish. I want to give back. I want to MAKE AMERICA SAFE & GREAT AGAIN!  -DJT"},{"comment_id":"10154586781928598","commenter_b":"Good for them, proud of you both, goes to show you how much they really respect themselves","commenter_a":"Blessings for your marriage!!","post_message":"#6 most-read LifeNews story of 2016: After Abstaining Until Marriage, NFL Star Russell Wilson and Ciara Get Married: “We Did It Jesus’ Way”"},{"comment_id":"10153396293173525","commenter_b":"'@username, yes I do know that. It has never happened despite 45 of 50 states allowing open carry, and some that have NEVER PROHIBITED it since they became states. No open carrier has ever been 'taken out' by a criminal.","commenter_a":"Kinda think it's dumb. Makes you a target basically. Someone will see ur gun and be like let me take them out first... Ya kno... Element of surprise is better.","post_message":"OPEN CARRY: The same law that's being proposed here in Florida just went into effect in Texas, and to celebrate, several groups rallied at the State Capitol carrying their guns.  STORY: @webpagelink"}]
