[{"comment_id":"10156088559505294","commenter_b":"In my opinion, the collarbone issue and sleeveless tops or dresses are a bit over the top. The women in most offices I've worked at wore sleeveless dresses and tops that were tasteful and appropriate. Even the women news anchors wear tasteful sleeveless outfits. I don't see a problem with that. I do however agree a dress code should be in place for kids in school. When they get out in the real world, there are rules, and they have to be followed. 48-50 years ago, we had to wear skirts or dresses that touched the floor if kneeled down. If it didn't touch the floor, we had to change. The guys had to wear belts. If they didn't have a belt, they had to pay 50 cents for a piece of masking tape with the word belt on it and tape it to their pants, and they better have ...","commenter_a":"I say all schools should have a dress code and make sure all students adhere to it. It teaches them to accept things in life their not happy about, but rules must be followed.","post_message":"It's back to school time, and we're hearing more stories about dress code violations. Students at one school in Chicago are protesting a rule that they wear only shirts and dresses with sleeves.   Click below for more, and tell us: Are dress codes these days fair? Unfair? Do they go too far?"},{"comment_id":"827935373908552","commenter_b":"A straight shooter, she would do this country good","commenter_a":"Barack Obama is NOT furious about anything Sarah Palin does or says; he is the President of the United States, and she is a moron.","post_message":"Sarah Palin lays into Obama for this reckless call!  Do you agree with her?"},{"comment_id":"10155004670634203","commenter_b":"I can't stand the smug bitch. Liberal fake news network is perfect for her.","commenter_a":"She's got 11.5 months to decide whether Santa is still white.","post_message":"Note Megyn Kelly's use of the word 'journalists' here..."},{"comment_id":"10153394437991336","commenter_b":"Illegal aliens aint welcome to merica deport them back!!!","commenter_a":"Univision responds to Mexico or the US? These guys are wrong. AMERICA first! If you dont like it, go back.","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"1017654374977457","commenter_b":"But if you don't punish them and just deport them, they will be back in a matter of days ! Secure the borders and then release them all back to mexico !","commenter_a":"Depends, they should first pay the consequences for their criminal behavior and then be immediately deported. Maybe the consequences should include the death penalty, financial remuneration, work to give back to the community, such as the CCC did under FDR and the DNC.","post_message":"Donald Trump and Ann Coulter think that immigrants that commit crimes should be deported right after being convicted. What do you think?  Vote in the poll and have your voice heard!"},{"comment_id":"10153640013936636","commenter_b":"O questo o un procione non voglio altro siamo io e te li vedi li vedi Dio pinolo?!","commenter_a":"Luca sparati in bocca con me","post_message":"Red pandas have an adorable wrestling competition  Via Detroit Zoo"},{"comment_id":"986949048053489","commenter_b":"Yes take her to Court","commenter_a":"Do it! Do it!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
