[{"comment_id":"10153336327911770","commenter_b":"She looks like a c#m dumpster.","commenter_a":"Hillary is a liar murder a criminal and mocks them what a shame","post_message":"Hillary Clinton's campaign mocked the Thursday Republican debate, calling it a \"dumpster fire.\""},{"comment_id":"1061814317192373","commenter_b":"Also...let's not forget...Obama is to blame for your mama giving birth to a shit head like you....you should have been aborted","commenter_a":"Another Jack A**** heard from","post_message":"Frequent Fox News guest Jesse Lee Peterson says that Obama is to blame for the South Carolina mass shooting at a black church because he insists on pointing out that racism is a problem in America."},{"comment_id":"10154534822598132","commenter_b":"The only way,she should have stop him is by calling the authorities. She need to go to jail,knonkle head","commenter_a":"She is as guilty as that stupid dude!!! She knows a thing or two she should be charged!!!!","post_message":"The second wife of #Orlando killer Omar Mateen has reportedly said she pleaded with him not to do anything violent."},{"comment_id":"10154069512515329","commenter_b":"Georgie McCarthy","commenter_a":"That moment in \"Dilemma\" when Kelly Rowland uses excel to text Nelly.","post_message":"\"Life is one big party when you're still young, but who's gonna have your back when it's all done?\""},{"comment_id":"10153862948491523","commenter_b":"You think women put these objects in themselves? This was a product recommended and approved by from their doctors. STFU","commenter_a":"Stop putting foreign objects in your body!","post_message":"Some of the women experiencing adverse affects from Essure are relieved to get hysterectomies to get the coils out."},{"comment_id":"10154001175786336","commenter_b":"She should be held to the same standards as men. Clearly she thought that since she's a 100lbs 5'0 female she should get away with it. She should be held to even higher standards because she is a doctor.... For now at least","commenter_a":"Don't complain about equality between the sexes as long as your OK with women not being held accountable for their actions. A man would be in jail right, now where she belongs. We giggle when women break the law and demand justice when men do the same thing.","post_message":"The confrontation reportedly began when the woman got into the Uber car without a reservation."},{"comment_id":"10153435939769087","commenter_b":"@username Sorry you feel that way. She'll cheat and lie to you also.","commenter_a":"Who cares anymore what Bill Clinton has to say? He has no influence anymore. Why doesn't Bill & Hillary Clinton follow the law? why are they exempt from following the law?","post_message":"\"It's important that we not be chumps when we decide what security provisions should be employed to check people's background,\" former President Bill Clinton said. \"America is a place that welcomes all people who are willing to treat people the way they want to be treated, willing to follow the law, willing to create a common community.\""}]
