[{"comment_id":"10152826329111130","commenter_b":"Women are a different race?","commenter_a":"Arrogant and controlling and not smart enough yet to hide it. Did anyone else who watched this wonder whether he would have shushed a male reporter?","post_message":"Unbelievable."},{"comment_id":"1945808648983136","commenter_b":"This Fucking pussy","commenter_a":"What a freak thus guy is!","post_message":"Must-watch. Morning Joe, a Republican, was left speechless by top Trump advisor Stephen Miller's dictatorial, lie-filled performance on the Sunday shows.  Shared by Occupy Democrats, LIKE our page for more! Video from MSNBC."},{"comment_id":"10153044187631717","commenter_b":"No one wants to physically hurt her, we just want her to do her job. Such exaggeration!","commenter_a":"well they need too cuz this B*tch is Crazy!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154358010096037","commenter_b":"why would u put this animals pic on here??u people r the problem,neither his name nor his pic should be glorified","commenter_a":"Coward, plain and simple. Bury him in a casket of gay smut and pork.","post_message":"Omar Mateen, identified as the Orlando gunman, pledged his support for ISIS in 911 calls made amid his attack, according to the FBI. @webpagelink"},{"comment_id":"10153846533754641","commenter_b":"A VOTE FOR HILLARY WILL BE THE END OF WHAT WE KNOW OF A FREE AMERICA , NO MORALS, ONLY PROMISES AND MORE LIS ! I WAS SHOCKED AT HOW MANY PPL STILL VOTED FOR HER AFTER KNOWING SHE HAS COMMITED TREASON ALONG WITH OBAMA AND THOSE TOP SECURITY TAPES BEING EXPOSED FOR JUST ANYONE TO SEE , THEY CAUGHTBOTH OBAMA AND HER IN LIES WHEN ASKED ABOUT THOSES TAPES . EVEN IF SHE DID MAKE IT TO BE PRESIDENT SHE BETTER NOT GET SETTLED IN TO QUICK , iI HAVE A FEELING SHE WILL BE INDICTED AND OBAMA WILL BE ALSO !","commenter_a":"Every other one is a liar and owned by big $$. What will they do to help you directly? I don't know any millionaires so I guarantee #Bernie2016 s policies will give you more spendable money. He's not really giving anything away, we already pay for most of it and he's found ways to pay for MORE than the rest, the excess will pay down the deficit. He will create jobs and raise wages, which will lift millions of people out of poverty and they will rely less, or not at all, on welfare. (No, this will not cause massive job loss or inflation. When poor people earn more money, they spend it, giving businesses plenty more money to use to pay the higher wages, usually with little to no increase in price.) He will implement a small tax on wall street transactions and other UNEARNED income, and will invest ...","post_message":"Donald J. Trump after a projected 2nd-place finish at Iowa caucuses: 'We will go on to easily beat [ Hillary Clinton ] or [ Bernie Sanders ], or whoever the hell they throw up there.'   Live updates from the Iowa caucuses: @webpagelink"},{"comment_id":"1115619658459044","commenter_b":"Yep. We're all whiney bitches to the gov and they'll find any means of manipulation and control. Welcome to the machine as we're all it's little bitch.","commenter_a":"You all are just a bunch of whining bitches!!","post_message":"Go California!"},{"comment_id":"901951363197946","commenter_b":"Does this Kate Hopkins woman realize how ugly she is?","commenter_a":"i think thie so called woman shoudl keep her many nasty comments too her self ,she must have a very unfilled life ,becuase she comments and has ago at everybody ,stut up Katy Hopkins .","post_message":"Kelly Clarkson admits she didn't even know who Katie Hopkins was  (Daily Mail Celebrity)"}]
