[{"comment_id":"10153666209640399","commenter_b":"Fire her!","commenter_a":"I've always liked Debbie, and had a lot of respect for her, but if this thing has legs, it could spell big trouble. There is enough dishonesty in Republican Ranks, we don't need any in Progressive Ranks. We all need to watch this carefully.","post_message":"Debbie Wasserman Schultz said the DNC needed to suspend access until they can be sure that the information hasn't been \"manipulated.\""},{"comment_id":"10154963463661320","commenter_b":"Prayers yes! How about the right time defend themselves with firearms?????","commenter_a":"Praying for peace once again. Sorry for all the victims and their families.","post_message":"The people of Berlin are in our thoughts after today's deadly truck attack at a Christmas market."},{"comment_id":"10153687843588854","commenter_b":"She has less worth than a used condom","commenter_a":"She deserves a place in cellblock B","post_message":"Unreal: Susan Rice Calls Benghazi A “False Controversy”…"},{"comment_id":"10152785745546130","commenter_b":"Also this will happen @webpagelink","commenter_a":"This will end the first girl who gets into a HS foot ball team and the guys decide they're not going to pull their hits for her and hit her like a man twice her size. Look women can be tough. BUT the toughest women are weaker than the toughest men. it's called gender dimorphism. Most mammals have it. That isn't to say that somewhere a woman isn't going to show up that can play running back, but with thinner, softer bones she's also more likely to get killed or seriously hurt.","post_message":"She's not going out without a fight."},{"comment_id":"10154172121273010","commenter_b":"They are moving the focus to have room to build a new ranger...","commenter_a":"This is disgusting. All respect for Ford, gone. After 2 Rangers, no more.","post_message":"It's cheaper and more profitable to make the cars in Mexico."},{"comment_id":"777311705792740","commenter_b":"FUCK YOU BITCH!!!!","commenter_a":"What a tool.","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"10155239787299411","commenter_b":"Says the Muslim cunt !fuck you and Muhammad","commenter_a":"Is Denmark a Christian or Pagan country?Seems like a dictator country. Forcing people to embrace religion against their will. Sad to see another country being brainwashed to reject the immigrant after all the destruction they had done to their country. Evil system being employed by the world government to spread hatred and misery for their own expenses. Screw the Minister!!! Bunch of hypocrite running the top country post. N shame on the citizens whom do not do a about it/opposing the motion. U are just as two faced ass***e just like your leaders.","post_message":"'Un-Danish?'"}]
