[{"comment_id":"292042534545715","commenter_b":"Ur so dead and sure its ur bear belly","commenter_a":"It's @username's butt ;)","post_message":"What could it be?"},{"comment_id":"10154735959309575","commenter_b":"How fatherly of him to want to murder his kids along with himself. SMH! This world is SICK.","commenter_a":"for the children and the family God bless them","post_message":"A 1-year-old boy and a 3-year-old boy survived after their dad threw them off a 100-foot bridge during a murder-suicide attempt. They suffered concussions but were awake and conscious when police arrived."},{"comment_id":"982612308510776","commenter_b":"@username killary LIED to the FBI, congress and all of America, she's perhaps the BIGGEST LIAR and MOST CORRUPT politician ever in America, she cares for NO ONE but herself and power, wants OPEN BORDERS, over 600 thousand more refugees to come into this country, continue obummers FAILED agenda, supports abortions up until time for birth and you support her. Neither candidate is a good choice but a vote for killary is a vote to destroy America, soon socialism and like obummer she supports the New World Order, please open your eyes and use some common sense before you vote to destroy America","commenter_a":"No, Hillary is not completely rattled. She's going to win in a landslide and is now closing in on a Democrat-controlled congress. You all need to get real, regroup, and try again in 2020. Good luck.","post_message":"Hillary is completely rattled after Trey pulled this out... It's over. No one can hide from him. Let's him know he's not alone. Can we get 30,000 'LIKES' for Trey to bring Hillary to justice?"},{"comment_id":"1045699632192955","commenter_b":"Women can make it!","commenter_a":"Sneaker is sneaky.","post_message":"Clinton inches above Sanders in a key swing state ..."},{"comment_id":"1032281423464900","commenter_b":"Oh please. You gotta be kidding. I will say Madcow needs the ratings for sure.","commenter_a":"When you get the guts to go on Rachel Maddow's show, please let me know.","post_message":"I talked with Fox News’ Gretchen Carlson this afternoon about the House passage of the Homeland Security Appropriations bill. As I told her, we made a commitment in December to seek to block President Obama’s lawless, unconstitutional amnesty using the \"power of the purse.\" Today we upheld that promise by doing our part to pass the strongest, most conservative bill that we could. I hope you’ll take a moment to watch."},{"comment_id":"10154496837959170","commenter_b":"Only LAZY UNEDUCATED PEOPLE BELIEVE IN A LYING WHITE WOMAN-hillary.","commenter_a":"BOOM killary!","post_message":"Hillary promises to continue Obama's economic policies. The latest results of those policies came out this morning. Splat!"},{"comment_id":"10154629464758797","commenter_b":"She also needs to be medically sterilized so another child cannot be born to this vicious murderer","commenter_a":"7 YRS R U FUGGIN KIDDING ME SMH I HOPE HE AT LEAST DIES IN PRISON","post_message":"TODDLER MURDERED: Prosecutors say the beating was so bad that part of the 17-month-old boy's skull broke off in the medical examiner's hand during the autopsy..."}]
