[{"comment_id":"10154480088981636","commenter_b":"female subjugation, taught from birth, how disgusting","commenter_a":"I hope they wear something to let people know they are the police","post_message":"Brilliant"},{"comment_id":"10156350810355354","commenter_b":"Deport these little bastards ASAP","commenter_a":"and the dems what these people in this country!","post_message":"Brace yourselves. Amnesty activists just launched a VIDEO that EVERY American should WATCH..."},{"comment_id":"1832240316996227","commenter_b":"Since you took the time to report this, why not put the effort to fix it? or educate us how to prevent this? Or are you one of those assholes that like to stir up nonsense to get recognitions?","commenter_a":"When I was young I vowed to kill all the bees. I see my plan is working.","post_message":"Do NOT scroll past this!! ✋✋ Source → @webpagelink #WakeUpCall | #SaveTheBees Join Us: The Free Thought Project"},{"comment_id":"1768080320145861","commenter_b":"She is a criminal to her core","commenter_a":"TRUMP will protect LBGT people from the moSLIMEs. Hitlery will always side with iSLIME because that is who keeps her rich. VOTE for TRUMP!","post_message":"On June 18, 1983, Sally Ride became the first American woman and first LGBT astronaut to go to space."},{"comment_id":"1098939776819315","commenter_b":"Does your Mommy know she raised a selfish, irresponsible, inhumane twat?","commenter_a":"A good majority of those 31 thousand people that are shot to death are killed in self defense and line of duty shootings by police. So that number should be adjusted down. Many of those killed tried to kill some one else. Back to Abortion. End it. End it now for the love of God. I lost a child to abortion. I don't know how my ex-fiance goes to sleep at night.","post_message":"There is no outrage in the media regarding how many lives are taken by abortion."},{"comment_id":"1170836056328262","commenter_b":"The last time I posted something about the politics of these bitches, I got dozens of whining bitches, men? and women, extolling on the vitues of these sacks o shit. Piss on 'em. Bring it on bitches!!!!!!!!!!","commenter_a":"GO DIXIE CHICKS--FREEDOM OF SPEACH-TURN TEXAS BLUE--","post_message":"Some Donald J. Trump fans attended this concert wanting to get away from politics and just have a good time listening to music. But then they noticed what the Dixie Chicks has in the background during one number. After that, Trump fans in the audience were absolutely furious... and for good reason. This is sick."},{"comment_id":"10153502208726350","commenter_b":"Too bad they don't pay the woman as much as the men. Men.... 9 million to make it to 16 round. Women.... 2 million for Championship win.","commenter_a":"Congratulations ...Great team","post_message":"\"It was just an epic journey. One we'll never forget.\" - Carli Lloyd to Matt Lauer. #WorldCup #SheBelieves #USWNT Cc: FIFA Women's World Cup"}]
