[{"comment_id":"10153039009502217","commenter_b":"The pussy is slanted trust me","commenter_a":"Tradicional woman japannese, very good","post_message":"Japan really isn't that strange"},{"comment_id":"791067471028294","commenter_b":"1. Leviticus 25:44 states that I may possess slaves, both male and female, provided they are purchased from neighboring nations. A friend of mine claims that this applies to Mexicans, but not Canadians. Can you clarify? Why can't I own Canadians? fair price for her? 3. I know that I am allowed no contact with a woman while she is in her period of menstrual uncleanliness - Lev.15: 19-24. The problem is, how do I tell? I have tried asking, but most women take offense. 4. When I burn a bull on the altar as a sacrifice, I know it creates a pleasing odor for the Lord - Lev.1:9. The problem is my neighbors. They claim the odor is not pleasing to them. Should I smite them? 5. I have a neighbor who insists on working on the Sabbath. Exodus 35:2 clearly states he shuld I ask the police to ...","commenter_a":"Yes, Jesus Loves Murderers as well but this does NOT mean He condones the murderer to continue to murder. God created us ALL but the murderer was not created that way just as Homosexual was not either...a sin is a sin. The BIBLE is very clear in this. Sin is delighful & addictive & we tend to consume ourself in our sins hence why it's hard to detour ourself from sin...that's why we NEED Jesus Christ in our hearts. Jesus Christ was tempted in the dessert with everything you can think of yet he continued to tell Satan no & to flee. When Jesus was thirsty & hungry in the dessert & Satan tempted him with food & water He still said no. We have to do the same with temptation/sin. There is ALWAYS a way out of sin if we put ALL our faith/hope/strenth in Jesus Christ He will ...","post_message":"Trey Pearson, Christian Rock Star, Comes Out As Gay. On the other hand, we reported on Jackie Hill-Perry, ex-lesbian, on how God helped turn her life around. Her Story >> @webpagelink"},{"comment_id":"1188535021166526","commenter_b":"This is ridiculous! Impeach her and be done with this !","commenter_a":"\"Just because 5 Supreme Court judges make a ruling, it not a law,\" said Kim Davis's 4th and evidently very well-read husband","post_message":"Kentucky clerk Kim Davis’ husband Joe says his wife will never resign and calls out the judge who ordered her behind bars. @webpagelink"},{"comment_id":"930922740261239","commenter_b":"This will be great and a good female leader not like the arrogant bitchthat we have in BC.","commenter_a":"Albertans are the dummies of politics, what happened the last time a female was in power in that province","post_message":"A ray of hope for Alberta's NDP MPs? via The Huffington Post Alberta"},{"comment_id":"1245500588795529","commenter_b":"Clinton thugs!","commenter_a":"@username-- You proud of this?? After watching this, I'm gladly giving my vote to Trump now. These Mexicans don't represent me, & aren't \"Americans\" acting like thugs.","post_message":"MUST WATCH: Video documents months of violent attacks by the radical left on Donald Trump supporters that are COMPLETELY ignored by the mainstream media. This video compilation shows Trump fans assaulted all ACROSS the nation. Worse and not surprising, the media, the left, and Hillary Clinton herself BLAME Trump for these violent assaults when they should be blaming those attacking the Trump supporters. Show your support for Trump by getting the TRUMP: REAL HOPE, REAL CHANGE bumpersticker! --> @webpagelink"},{"comment_id":"1247936331966085","commenter_b":"So tired of explaining this exact sad truth.","commenter_a":"Learn the difference.","post_message":"It was clear from the start the criticism wasn't about the flag."},{"comment_id":"10154527914443690","commenter_b":"Wolves under the goat skins are those who invaded their countries; not them; refugees!","commenter_a":"They are terrorist not refugees, two years from now their host community will be destroy....","post_message":"\"Failure to address serious abuses appears to be a deliberate policy to deter further asylum seekers from arriving in the country by boat.\""}]
