[{"comment_id":"669424226515949","commenter_b":"lol anybody can change it to anybody wiki is less secure than pussy around trump","commenter_a":"Ben Ellison thought you might like this","post_message":"So, this happened yesterday."},{"comment_id":"1060479207341941","commenter_b":"@username you are stupid and Crystal takeaway from drugs looking for help never is to late for live free of drugs jajajaja jajajaja jajajaja.","commenter_a":"Hillary for Iowa the best candidate for president and 2016. Go @username go.","post_message":"5 days to Iowa!"},{"comment_id":"10153540508969087","commenter_b":"@username BY THE WAY BITCH, YOU ARE THE LOSER!","commenter_a":"HOW ABOUT WHEN YOU CHEATED ON YOUR FIRST WIFE WITH MARLA MAPLES AND GOT HER PREGNANT, DUMPED YOUR EIFE, MARRIED MARLA, THEN DUMPED HER TOO!!","post_message":"\"I have a very good marriage now. Melania's fantastic,\" Donald J. Trump told Anderson Cooper at the CNN town hall in South Carolina. \"But I had two women that I never blamed because I worked so hard that my job came first. Maybe I work too hard. I was a better father than I was a husband. But I worked very, very hard and I love doing it.\""},{"comment_id":"1353412211336912","commenter_b":"Women outlive men because they don't marry women!","commenter_a":"Good grief, it's been known for eons that women have greater endurance, etc., etc. I'm reminded of a book written in the 1950s by noted anthropologist Ashley-Montagu, entitled \"The Natural Superiority of Women.\" The male anatomy excels in only one area: upper body strength, a left-over from prehistoric humans. Ashley-Montagu is not by any means the first to recognize and write about this. It should be obvious to anyone, really, when you recognize that, despite the physical ravages of child-bearing, women live longer than men.","post_message":"Questions about Clinton’s health just won’t go away — partly because they fit so neatly with longstanding sexist tropes about women’s weakness."},{"comment_id":"10154113028645329","commenter_b":"Does this mean we all just became best friends?","commenter_a":"Wow. Completely true. Very accurate quiz.","post_message":"It really will. (via BuzzFeed Quiz)"},{"comment_id":"1260485777320174","commenter_b":"I can't wait for President elect Donald Trump to take office and start tossing out the undocumented illegals..........I hope this joker is the first to go.","commenter_a":"that is so sick they should kick them all out","post_message":"BOOM! (WATCH)"},{"comment_id":"10152826020480927","commenter_b":"It;s simple sex, between a man and a woman burns calories.","commenter_a":"CRAZY","post_message":"Remember, these are your taxes at work."}]
