[{"comment_id":"10153196584554091","commenter_b":"Go marry donkey who cares","commenter_a":"As a Christian..I feel she's out of order...do your job!...and let God deal with anything else.","post_message":"She told the couples and activists that her office is continuing to deny the licenses \"under God's authority.\""},{"comment_id":"1295782043794583","commenter_b":"Let them fear! BE TERRIFIED! Trump will deport you! Americans WANT illegals and Moslems DEPORTED!","commenter_a":"\"I going to stand up for the 11-year-old girl in Nevada, who worried that her parents would be deported under a Trump presidency. For the Muslim family in Queens whose young children are terrified of how their family would be treated if Donald Trump becomes their Commander-in-Chief.\" What about the FIVE YEAR OLD GIRL in Idaho who was gang raped by SEVEN of your precious muslims,Hillary? What about the families in NY & NJ who are terrified that they will be blown up by ANOTHER muslim who has stolen and benefited from America's generosity,only to turn their islamic hate on us?!? Go to Hell,back where you came from,Hillary.","post_message":"HILLARY EMAILS HER DEBATE STRATEGY. AND ON THE HEELS OF A MUSLIM-LED TERROR ATTACK, HILLARY'S EMAIL COULD NOT BE MORE ANTI-AMERICAN. Read it. @webpagelink"},{"comment_id":"10154264315237550","commenter_b":"Yes you and your mother, @username! You old goat!","commenter_a":"They look real stupid with riot gear on outside a stadium!! There's no bomb threat! That Chief Of Police is a idiot. People are coming to enjoy a football game. Don't bring unnecessary rhetoric to this.","post_message":"Police are in riot gear outside of Bank of America Stadium in Charlotte ahead of the Panthers game. Read more here: abc11.com/@username/"},{"comment_id":"1100137706687990","commenter_b":"Couldn't she have just not threatened him with scissors? Criminals need to be held to their actions","commenter_a":"Why were the police called? Where is the audio to the video? Why doesn't the video show the shooting? In the video, she is obviously advancing on the officer. And it doesn't matter how big the person is or what they have, a weapon is a weapon.","post_message":"If a 100lb woman makes you fear for your life, perhaps your to much of a coward to be a cop!!"},{"comment_id":"885152951544454","commenter_b":"I am parra phrasing as I am not really comfortable with the terms \"richer and poorer\" x","commenter_a":"How can she handmake 3000 items a day???","post_message":"Meet the richest seller on Etsy"},{"comment_id":"10150815152779999","commenter_b":"Hahah Welcome to the team","commenter_a":"@username :P","post_message":"Hold the Door. Hold the Door. Hold the Door. Hold the Door. (Hold off on reading this recap until you've watched the most recent episode of \"Game of Thrones.\")"},{"comment_id":"1186457031407058","commenter_b":"I say we give it to them. not one cent of White money, black doctors, black hospitals, black colleges, black cities, and build big walls and let them deal with their own people","commenter_a":"This is what happens when you erase history just like the Confederate flag","post_message":"Strange for those that call themselves 'progressive'..."}]
