[{"comment_id":"809196999209345","commenter_b":"you are so full of it jeb - and you don't stand a chance. even insane republicans are done with the bushes. what's the policy on a presidential candidate's brother being a wanted war criminal????","commenter_a":"I am saying \"boo,\" not \"boo Jeb,\" though I AM booing Jeb. Boo!","post_message":"Most passionate moments of #DemDebate are always about who will ban more guns and who will give the gov't more control over your health care."},{"comment_id":"616410835216162","commenter_b":"Yes sure don't give a dam for that racist ass nigger whoopy","commenter_a":"Those with limited intelligence often resort to cursing.","post_message":"Whoopi tries to take on Ann Coulter on live TV, big mistake. This awesome. Whoopi needs to learn her place. Do you support Ann Coulter?"},{"comment_id":"10152775428266051","commenter_b":"Tell the Moms to buy it themselves.","commenter_a":"How low can you get.","post_message":"These moms decided to e-mail their daughters’ class and ask for everyone to pitch in for their birthday gifts. Here’s how one mom responded to that."},{"comment_id":"1044706655577881","commenter_b":"She know she be giving up the boot-Tay lmao","commenter_a":"This isn't even news! Yes fox 10 just post BS stories that are none of our business....","post_message":"SOUND OFF: This is Chelsea. She's 20, lives in Florida, and travels the world with men she meets online... on their dime. She says there's no pressure to do anything other than hang out with these men. What do you think? Let us know, and we'll share your comments on FOX 10 Arizona Morning!"},{"comment_id":"10156334612930354","commenter_b":"P.S. \"Illegals\" cannot vote.","commenter_a":"Good for Hungary for putting up the fence. It is their country and they have every right to protect it from any invaders. It's too bad our Golfer-in-Chief and the rest of the liberals don't feel the same concern for our country. They don't want to stop illegals because of the votes they can bring. 'Bleeding Hearts\" are a really sick bunch of people.","post_message":"This can't be right... Obama--who lives in a home surrounded by a fence--says border fences don't work. How can this be?!"},{"comment_id":"525940174197243","commenter_b":"And that is why we need to vote for Trump...with Cruz you will get an open southern border and amnesty.","commenter_a":"No vote for Cruz, he is a politician, just cannot trust politicians democrat or republican. Politicians will tell you anything to get you to vote for them, they get into office and do not follow thru.","post_message":"Agree or disagree?"},{"comment_id":"927319353970153","commenter_b":"Who cares about whatever Sarah has to say....she's a nobody. Good grief !!","commenter_a":"BO doesn't care he's in office as a fraud perpetuating and feeding the muslime brotherhood on our dime","post_message":"HA HA!"}]
