[{"comment_id":"10153502199714087","commenter_b":"If I had any faith in Clinton. Sure. But I don't. So....","commenter_a":"My dream is that Bernie Sanders agrees to run as Hillary Clinton's vice president on the condition that Elizabeth Warren be appointed Secretary of the Treasury and Bernie gets to focus on one main goal: voter turnout! Bernie can build the revolution he's been talking about by getting everyone more involved and then we can pick up some democratic seats this year and take back congress in 2018 with progressive candidates. Bernie's task would be non-partisan voter turnout and involvement supported by a strong democratic machine finding good candidates in local state governments and for congress. This is a long term plan, one that ultimately paves the way for President Warren. Bernie wouldn't get to be president but he would give us a good 16 year trajectory to push progressive policies. Wouldn't that be lovely?","post_message":"“In the last election, the mid-term election, 80 percent of young people didn’t vote,” Bernie Sanders said.“I’m very proud we’re bringing a whole lot of young people into the political process [and] that we’re revitalizing democracy. If we’re going to change America, that’s what we’ve got to do.”"},{"comment_id":"10153190438888812","commenter_b":"Plus many red states consider sand and salt a slippery slope toward Socialism.","commenter_a":"All the Yankees talking about \"that isn't snow!\" Must not realize how right they are. It's ice. It's infinitely more dangerous and icy in the south than it ever gets in the north.","post_message":"WATCH: \"It's over\" -- Snow and ice are still triggering dangerous, cringeworthy conditions on roads in much of the eastern US, including this Huntsville, Alabama, neighborhood - ABC News Weather"},{"comment_id":"1790748334489343","commenter_b":"So go.","commenter_a":"Goodbye to all the rif-raf. America will be great again!","post_message":"SHARE THIS IF YOU WILL BE HAPPY TO SEE THEM GO!"},{"comment_id":"1202111446538878","commenter_b":"Ain't none OF these HOES VIRGINS!! EVERY GIRL BEEN WITH SOMEONE BEFORE YOU GOT IT . THIS DAY AND AGE..","commenter_a":"Everybody saying he having diddys seconds are dumb by that logic every girl you've been with is technically seconds sometimes more than seconds 😭😭😭😭 might be hundreds","post_message":"Damn! #WSHH"},{"comment_id":"962147223853010","commenter_b":"Femmie=carpet munchingg","commenter_a":"And this is why I don't identify as a feminist. Yes, periods should not be stigmatized, yes womens sanitary products should not be taxed, yes we should try and supply women without access to sanitary products but publicity stunts like this are what give feminism a bad name. Let's all grow out our armpit hair and show it off on Instagram, not wear deodorant and bleed all over the place and while we're at it let's just devolve a little as well.","post_message":"'I ran with blood dripping down my legs for sisters who don’t have access to tampons...'"},{"comment_id":"899136066791297","commenter_b":"What? C'mon! Can the girls join the Boy Scouts?","commenter_a":"This says nothing good for Girl Scout leadership. If the leaders were of strong character, they would say \"he'll no\".","post_message":"Why would ANYONE think this is a good idea?!"},{"comment_id":"1648797488740697","commenter_b":"Sadie is a lady Miley is a joke!!","commenter_a":"LOVE LOVE LOVE!","post_message":"America needs more Sadie Robertson and less Miley Cyrus."}]
