[{"comment_id":"536487383205696","commenter_b":"Here's some facts for you Gerry - I NEVER want to be someone's \"arm candy\", I will NEVER marry for money and I don't have relationships with people because of the way they look. I do agree with you when you say we are our worst enemies, but that doesn't give you the right to generalise all women. Unless you're happy to be lumped with the guys that are shallow and only date women with big breasts","commenter_a":"Who the hell cares if she is pregnant? unfortunately women are their own worst enemies, happy to be arm candy of some of the most groteste males alive,providing they are millionaires, fact!","post_message":"Jennifer Anniston has said we’ll be the first to know if she's pregnant. Writing for The Huffington Post, the actor blasted the “sport-like scrutiny” she lives under, saying it’s indicative of society’s warped view of women which sets a dangerous example for girls."},{"comment_id":"1147055582023224","commenter_b":"She is a thief put her in jail","commenter_a":"She is obviously enjoying her new found freedom . Notice there is no hajji .","post_message":"Muslim Welfare Queen Loses Benefits After Cops See THIS On Her Facebook Page..WOW!  Do you agree that Muslims come to America just to soak up free money?"},{"comment_id":"10153638805358598","commenter_b":"Abortion is NOT legal!","commenter_a":"just go above the supreme court and ban all abortions.","post_message":"BREAKING NEWS: Supreme Court Won’t Let North Dakota Ban Abortions on Unborn Babies After 6 Weeks"},{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"},{"comment_id":"10155005314954062","commenter_b":"@username Gale Adams @username @username Christina Marie 👀😒😔","commenter_a":"Justin Irwin","post_message":"Please be careful to all of our friends in the Conroe area. This was shared by Heather Dungan from Conroe 105 and I45 near Home Depot.  If you encounter high water, turn around. @webpagelink"},{"comment_id":"10152884101260950","commenter_b":"Day. I love all animals.....and the nice part is.....nobody can stop me.","commenter_a":"Burn her ass. Grrrrrr. My compassion for animals is soooo much stronger than it is for humans.....karmas a bitch","post_message":"The woman allegedly set a terrier mix named Brownie on fire; the dog's burns were so bad, he had to be euthanized."},{"comment_id":"1727548687496080","commenter_b":"HILLARY CLINTON IS AN ARROGANT NARCISSISTIC SOCIOPATHIC LIAR AND VERY EVIL WOMAN !!","commenter_a":"Time will tell","post_message":"We'll see what ends up happening..."}]
