[{"comment_id":"978050422232298","commenter_b":"NOT A FAN of this pro-Muslim woman PERIOD!!","commenter_a":"She is the new definition of cool. Drop that mic and walk away.","post_message":"Mic drop."},{"comment_id":"10153715993757293","commenter_b":"Make it a felony to hire anyone illegal","commenter_a":"I've watched illegal immigrants take construction jobs from my fellow Americans for years. Build the wall.","post_message":"In a two-page memo to The Washington Post, Donald J. Trump detailed his plan to force Mexico to pay for a border wall"},{"comment_id":"1393293527430364","commenter_b":"Run us over girl. I'd love to have universal healthcare and lose this moron in command.","commenter_a":"All of this it's so true I've said this exact thing to you @username being Canadian fucking rocks 🇨🇦🇨🇦🇨🇦 y'all could learn a bunch from us if you could see past the orange dildo standing in front of you guys.","post_message":""},{"comment_id":"10153374833224497","commenter_b":"I miss that trashy bitch.","commenter_a":"whatever happened to amber richardson?","post_message":"\"I had some great drugs in my day, but seeing my baby for the first time? I wouldn trade that for all the ecstasy in the world.\""},{"comment_id":"1202675816432455","commenter_b":"Anyone is better than Killary. I'd rather look at and hear him than her.","commenter_a":"Guess Rush has already forgotten all of Trump's promises to \"cut deals\" with all the Reids and Pelosis out there. The left probably won't have to worry very much.","post_message":"I want you to fast forward to November to Trump winning the presidency in November. I want you to think, using your intelligence guided by experience, what's gonna happen that night? What's gonna happen the next day? What's going to happen every day thereafter? What's gonna happen the day Trump gets inaugurated? What is the left gonna do? They're not gonna just sit idly by and accept this and say, \"Good fight. We gave it everything we had, but we lost.\" They're gonna do everything they can to undermine it. And I think we're gonna see levels of violence that we have not seen."},{"comment_id":"1324418074301084","commenter_b":"And his nephew is married to Chelsea Clinton.","commenter_a":"This EVIL, sob needs something to happen to him, and take him out of his misery. As long as he is around ,this Idiot will keep causing trouble. He needs to go away forever.","post_message":"Take a look at the list... You will be shocked at some of the names on it!"},{"comment_id":"695871927257910","commenter_b":"Josiah Meek","commenter_a":"Laurie Fink","post_message":"DESK GOALS. @webpagelink"}]
