[{"comment_id":"10154151629042507","commenter_b":"Says the white bitch with a job and a Beamer....Dorothy saloum.....ha-ha!","commenter_a":"Hey @username liberals, Thanksgiving looks like gratitude. It's all about money to you socialists.","post_message":"If you have $50,000 you can join them."},{"comment_id":"10153895768928132","commenter_b":"Showing your butt in public doesn't empower women. It's the opposite. It shows women as sex objects. It shows little girls that is ok to post pictures of them naked. It shows those real woman with curves that if they don't look like that, they are not\"normal\".","commenter_a":"Beautiful!","post_message":"You rock, Demi Lovato!"},{"comment_id":"1388314524545146","commenter_b":"Someone should kick this Muslim Animal out of our country years ago.","commenter_a":"Delusional moron!","post_message":"Just another scumbag black leader who hates Jews...boy, sure glad we helped them with their civil rights in the 60's - WE WERE THE ONLY ONES!"},{"comment_id":"995597563869829","commenter_b":"@username you are free to get the hell out","commenter_a":"Nobody takes Huff po seriously . I read it to see what liberal homos think.","post_message":"Should news sites cover Donald Trump as politics or entertainment?"},{"comment_id":"1744752812466666","commenter_b":"He can't he has to pay for all of Obama's muslims he let in here during his presidency. Also, all the illegals. Unless we get rid of all the illegals there is no money.. Oh and the muslims that Obama let in here..LOL","commenter_a":"Mr. @username, Like where you're going. I would 1st Cut Welfare 100% and give it all to the Vets, they have earned it. Close the border and start kicking out un-documented, non tax paying illegals. Bring jobs back to the U.S.A, and repeal oshitcare. Also free up the 2nd A. If you Hate this Country Ask the Government for a ONE WAY TICKET to anywhere in the world. Free of charge.","post_message":"A NATION WITHOUT BORDERS IS NOT A NATION AT ALL. WE MUST HAVE A WALL. THE RULE OF LAW MATTERS! -DJT"},{"comment_id":"953522348018789","commenter_b":"I demand that the offender's stop offending me. I'm tired of being offended. They get offended over Merry Christmas they get offended over In God We Trust, offended over the Ten Commandments... And the list goes on and on well if they don't like it move out of America.","commenter_a":"Why make something as general as a Cracker Barrel a racist issue? Stop creating trouble and problems needlessly! Enjoy this holy season and spread love and goodwill, not hate!","post_message":"Liberals are demanding that Cracker and Barrel change their name to this. We can let this happen. Let's show them our support. Can we get 30,000 'LIKES' to keep Cracker and Barrel the same?"},{"comment_id":"576110785930150","commenter_b":"@username did she grab them by the pussy?","commenter_a":"Read stories that when Slick Willie was president, the spent more of their time protecting him from Killary than anything or anyone else when she went on her ballistic tantrums.","post_message":"Not only is she corrupt, she's also beyond rude and disrespectful to those who protect her very life. So many who've worked for her attest to her nasty nature. natl.io/ghciVB"}]
