[{"comment_id":"421520308036263","commenter_b":"What is this group that has an American flag on the ground to be trampled ?","commenter_a":"stupid ASS COPS.","post_message":"\"I went to pick it up because it doesn’t deserve to be on the ground.”"},{"comment_id":"10153043089801519","commenter_b":"Right? Because...ick.","commenter_a":"#dontbethatguy","post_message":"\"He then sent me five nude photos of him lying in bed, his penis prominently displayed...\""},{"comment_id":"10152670187577483","commenter_b":"Or two women","commenter_a":"All of you people that back same sex marriage wouldn't even exist on this Earth right now if it wasn't for a man and woman making you like GOD intended for it to be. Just think if all of yalls parents would've been gay yall would have never existed.","post_message":"If you're trying to get married, check out this map before you go to the courthouse. The majority of counties have either suspended the issuance of all marriage licenses or are only accepting applications."},{"comment_id":"10154010252346350","commenter_b":"The kid didn't make a mistake. If she was driving drunk then she committed a crime. Having someone plow into your home is not only traumatic at the time of the event, but then there are all of the repairs to deal with. It can take months to get it all put back together. And insurance doesn't cover all of the costs. Guess who gets to pick that up. Not the kid. She wasn't over reacting. If anything, she was quite conservative. I would have gladly beat the stuffing out of the one that hit us.","commenter_a":"I'm probably the only one who is think Kim... Is.. Well... Being a little actress like in all these tweets. We get it. The kid made a mistake. One that could of been fatal. One tweet is probably good enough (if at all) but like 4? Get a grip Kim. Ridiculous.","post_message":"\"This young girl could have killed herself, her friends, and me. Frightening.\""},{"comment_id":"10152833385031749","commenter_b":" .","commenter_a":"You are right Brent!","post_message":"\"America’s resurgence is real. And now that we’ve got some calmer waters, if we all do our part, if we all pitch in, we can make sure that tide starts lifting all boats again. We can make sure that the middle class is the engine that powers America’s prosperity for decades to come.\" —President Obama  Watch the weekly address: @webpagelink"},{"comment_id":"10154575658114255","commenter_b":"The women who want to be at the beach fully clad should be left alone. Why is this an issue?","commenter_a":"Those women would be sentenced to death for not respecting the laws and religion of some countries.","post_message":""},{"comment_id":"10153793026628010","commenter_b":"@username Try entering Mexico illegally and see what happens","commenter_a":"Most illegals can't come on work permits or marry for papers. Most hope to just work and return home. Lebanese, Greeks, Armenians and Syrians, Salvadorians are fleeing their countries do to violence. Are they criminals for entering the USA, and other countries in order to want to survive? Wanting a better life isn't a crime.","post_message":"It is the fourth immigrant detention facility in the U.S. where protesting detainees have refused food in recent weeks."}]
