[{"comment_id":"1215065415200595","commenter_b":"That one black girl would have kicked their ass","commenter_a":"All it would've taken is 1 black girl and no one would give a shit","post_message":"These young racists aren't laughing anymore."},{"comment_id":"1104371989582553","commenter_b":"Don't kiss any bugs, Suzanne--even if they swear they'll turn into a handsome prince. Only frogs for that.","commenter_a":"Thanks for that. I'll be obsessing on this for weeks now.","post_message":"“Kissing bugs” may sound sweet, but they have infected at least 12 people in Texas with a parasite that causes a deadly disease. >>kiro.tv/KissingBug"},{"comment_id":"587779548050076","commenter_b":"NO NO NO NO NO !!! AND HELL NO! Keep them out and send all illegals back!!!!!","commenter_a":"Hell no","post_message":"I'm thinking ... uh ... duh. But then again, we have the SFB Liberals who see 'no wrong' in Sharia. Vote in our CLASH Poll and let the US know how u feel. @webpagelink"},{"comment_id":"10153828733732235","commenter_b":"LOL ... You people are so screwed up it amazing. You don't have to go to a fracking town to get raped ladies. Just go to any sanctuary city. There will be plenty of Mexicans willing to do the job that no American will do. LOL","commenter_a":"I have read about this .... disgusting .... assaulting women shows cowardice from these men ... shame, shame on them and the legal authorities!!","post_message":"This interview is heartbreaking."},{"comment_id":"1006601726066242","commenter_b":"It is her own fault due to not following the rules- do not get closer then 25 yards!!!","commenter_a":"Stupid people, I do enjoy them.","post_message":"Pictured: Moment bison selfie went all wrong"},{"comment_id":"1219604621413341","commenter_b":"A very large dick","commenter_a":"I was born and raised on Ohio and this man embarrasses me","post_message":"Here's a clue: She's not a 62-year-old man, but that's not all. It gets worse. Much, much worse."},{"comment_id":"10153190313663984","commenter_b":"Get the bitch away from our kids school's.","commenter_a":"She fills up on bananas! Hard to keep her out of the tree!","post_message":"Ouch - Michelle Obama will not be happy to hear this. Are you sick and tired of the Obamas telling us all how to live?"}]
