[{"comment_id":"10152956267682061","commenter_b":"Congratulations, Ginger!!! We love you in Atlanta!","commenter_a":"Congrats","post_message":"Ginger Zee is pregnant and we couldn't be any more thrilled for her! Same with Lara and Amy Robach! @webpagelink"},{"comment_id":"1980759552150599","commenter_b":"Or maybe he was trying to check on the deer...i'd kick the deer too if it attacked me. Get over yourselves people","commenter_a":"Looks to me that he was scared and didn't know where he was going....not \"coming back to attack the driver\". LOL! Poor deer!","post_message":"STARTLING: Video shows a deer come back and attack the driver who struck it. But the driver fought back. It happened in Howell, New Jersey. Details: @webpagelink"},{"comment_id":"10152979046217690","commenter_b":"Hoes","commenter_a":"Looks like that abstinence only thing isn't working out so well.","post_message":"At least 20 cases of chlamydia have been reported at a small West Texas high school. @webpagelink"},{"comment_id":"879835912051831","commenter_b":"I wish her big mouth would go away ; what a disgusting woman","commenter_a":"A message for Rosie. It is one thing for people to think you ignorant and it is another for you to open your mouth and prove it.","post_message":"Tom Selleck is awesome!"},{"comment_id":"10158194484645725","commenter_b":"Dis bitch don't even answer","commenter_a":"@username @username Melissa F Hernandez @username MaFe Ndz We are going to take Matthew to Navy Pier again this year. You guys should come too!","post_message":"Tonight feels like the perfect night to see some holiday lights, don't you think?"},{"comment_id":"10153337610537093","commenter_b":"Lol !!! Nice comeback April. #SpokenLikeATrueTenYearOld","commenter_a":"Not surprised at all Texas is a racist redneck controlling state!","post_message":"Rick Perry's good name has been restored... @webpagelink"},{"comment_id":"10153590500421409","commenter_b":"she is full of herself","commenter_a":"Wow what kind of so called \"FRIEND\" is she. Can't even be happy for Michael. So much drama. Nobody needs a friend like that.","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."}]
