[{"comment_id":"440337219424652","commenter_b":"If your not Born in Africa, how are u African, He's right, I dont say I'm scottish, I say i'm an American, People need to stop playing this devide and conquer game the rich is playin thru the Media, which they own, thru the military with constant wars which profit the rich, and of CORSE MONEY, the one and only thing the rich care about. EAT THE RICH! They are the enemy!","commenter_a":"This is a very poorly written article","post_message":"A Florida Sheriff is in hot water after a 2013 racist rant he recorded on video has surfaced just before he begins to gear up for re-election. Watch the video then read our commentary by Lou Colagiovanni"},{"comment_id":"639206099603302","commenter_b":"trump chooses palin for vp he loses my vote pay attention america to this family","commenter_a":"why would a person with any common sense support ANY ONE who assaults anohter person? that does not even make good sense. no matter why she assaulted the other person, you do not strike another person. she could have just left the party if she was offended by something said. it was a crime.. crimes are punishable by arrest and payment for that crime no matter who you are.","post_message":"Bristol Palin is in trouble with the law after this incident at a party.  We need to show Bristol our full support. We support her and the entire Palin family.  Do you support Bristol Palin?"},{"comment_id":"10156349547100354","commenter_b":"Conservatives learned the lessons of MLK. I think the left needs to review what he preached. It is not the color of the skin but the content of character.","commenter_a":"These people just say what they think and then if it bites them in the rearend they come back with some ridiculous other story which nobody believes but they seem to think that we will.","post_message":"FIRESTORM: MSNBC Liberal Claims She Wasn’t Calling Dr. Ben Carson Racial Epithet...\"Safe Negro\"...Backpedals Quickly...Dr. Carson Campaign Blasts...MORE..."},{"comment_id":"992416424184745","commenter_b":"Well I know it wasn't a baseball stadium or shopping mall","commenter_a":"Remember that first moron who said \"maybe, just maybe the earth is round\"? Unless there's a time machine, people can have their own thought who built the pyramids in what year, and for what purpose.... My theory was that aliens or time travelers built them as some sort of energy source....","post_message":"Wow.. and he's supposed to the SMART Republican? Reality check: the EGYPTIANS -- not the Jews -- decided to build the pyramids for the pharaoh's graves -- NOT to store grain!  “My own personal theory is that Joseph built the pyramids to store grain,” Carson said. “Now all the archeologists think that they were made for the pharaohs’ graves. But, you know, it would have to be something awfully big if you stop and think about it. And I don’t think it’d just disappear over the course of time to store that much grain. And when you look at the way that the pyramids are made, with many chambers that are hermetically sealed, they’d have to be that way for a reason.”  Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153560917566615","commenter_b":"Get off of here Martha","commenter_a":"Who cares he got away with rape.","post_message":"WELCOME TO STEELERS NATION, BABY BODIE!  The newest addition to the family of The Pittsburgh Steelers QB Ben Roethlisberger is right along side the rest of the City of Champions tonight, cheering on the Pittsburgh Penguins to a Game 7 win! LET'S GO PENS!  (Photos courtesy of Ben Roethlisberger - BigBen7.com)"},{"comment_id":"988932794475475","commenter_b":"black so slap on the wrist and tell her NO NO","commenter_a":"Thanks Obama! This is how you are destroying America! I hope you and all of your kind are happy. No wonder this nation is falling apart.","post_message":"She will pay for this!"},{"comment_id":"519056438282649","commenter_b":"cair can go to hell","commenter_a":"Our country. .USA..AMERICA","post_message":"PLEASE SHARE AND HELP PROTECT OUR VETERANS!"}]
