[{"comment_id":"10153101911354877","commenter_b":"Give an inch and they take a mile.... true, but knowing that why even give an inch? She's just trying to get attention. If she were a normal woman she would be on every comment feed talking about \"like me on instagram\"","commenter_a":"I don't understand why some celebs consider sharing EVERY aspect of their lives but when they are judged or talked about they immediately ask for 'privacy'.","post_message":"'I demand that I climax': Nicki Minaj gets candid about her sex life in Cosmo - and where she sees herself in ten years.   Grio fam, do you find it refreshing when celebs open up like this? Or is it T.M.I?"},{"comment_id":"10153922019898812","commenter_b":"Anyone but Hillary!!","commenter_a":"The only thing I fear is a Republican getting elected in 2016","post_message":"President Barack Obama: \"We cannot and we will not succumb to fear.\" @webpagelink"},{"comment_id":"10154476200391037","commenter_b":"Experts still deny Free trade causing poverty joblessness....they still maintain America cant make its own goods that we must import or fall into some economic abyss! At the same time they back Hillarys claim that she can create some kind of new jobs that doesnt involve manufacturing?? Lets speculatefor a moment that 25 years ago our govt agreed to stabilize China by implementing Free trade...it created a middle class helped create a market for us to trade with down the road... they have enough money to buy from us but 25 years ago the large population was mainly poor. and it made Chinese govt more stable...Govts make these kinds of trade offs everyday...greater good it will pay dividends we have to think of the future all of that kind of nonsense while sentencing 3 generations of American workers to a deadend future.","commenter_a":"obama has done a great job dividing people...Time to fix that!!..TRUMP 2016!!","post_message":"\"We need more love and kindness in this country,” Hillary Clinton said. \"The last thing we need are leaders who try to divide us even more than we are.\""},{"comment_id":"10154289975556336","commenter_b":"She agreed to follow the dress code if she was unable to wear heels then she should have asked for an accommodation.","commenter_a":"Dress code violation..if you don't like the dress code find another job. I'd rather not wear pants to work, but I have to anyway because it's the dress code. Suck it up.","post_message":"Dress code violation or sexism?"},{"comment_id":"841503402609382","commenter_b":"IDIOT!","commenter_a":"Fat White Asshat","post_message":"Shame on him.  \"According to New Jersey Watchdog, Christie reportedly spent over $82,000 of taxpayer money on concessions at MetLife Stadium.\"  Read more here: @webpagelink Image by Occupy Democrats"},{"comment_id":"631709593654535","commenter_b":"Just left Great Lakes Navy Recruit Center and such pride in our country and military on full display....folks from all backgrounds. Hillary does not support our troops and I can only pray that my son does NOT have to have that woman as his CIC","commenter_a":"The irland of cyprus to .with u trump","post_message":"I am truly honored and grateful for receiving SO much support from these military leaders -- American heroes -- who have defended our freedoms. THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"},{"comment_id":"10154083173838132","commenter_b":"They're usually thrown in an institution from a young age. They don't get job or skill training being they are looked at as \"useless.\"","commenter_a":"This is an awesome story and I am so thankful for the children that have found forever homes. I have one question if these children were left in China would they receive an education?? Or are they just forgotten about?","post_message":"What an incredible moment for these children. "}]
