[{"comment_id":"10155811623205594","commenter_b":"You are $hit. This is about a little girls recipe. keep your poitical agenda where it belongs. in the crapper","commenter_a":"Must look like SH!T...","post_message":"Barack Obama told her it was a standout dish for him."},{"comment_id":"10156623129805389","commenter_b":"He wrote an entire book about it. Would you like copy?","commenter_a":"Great. How? How exactly is he going to create jobs? This guy just says he's going to make things great without details. He is making hollow promises. You know who else did that? Obama. He did the same thing. Actually, he did it without insulting people and sounding like the middle linebacker of a high school running for class president on the platform of beating up nerds and gym class all day long.","post_message":"“I am going to be the greatest jobs president that God ever created.” WATCH the highlights from Donald J. Trump’s New Hampshire primary victory speech. #Hannity"},{"comment_id":"10153775896719087","commenter_b":"Nope they're Staying with her!","commenter_a":"Actually, the superdelegate system was designed to stop a primary candidate such as HRC from getting the nomination. They were put in place to prevent someone like her who wins the popular vote but is un-electable in the general election from costing the Dems the WH. The question is are they too corrupt and blind to fulfill their intended purpose which is to give the nomination to Bernie.","post_message":"“I think clearly that the superdelegate model was designed to stop outsider candidates like [Bernie Sanders], and in that sense, they’re doing what they’re designed to do,” said Former House Speaker Newt Gingrich."},{"comment_id":"10152941804948869","commenter_b":"Women in bed with marxism again...","commenter_a":"No, the world needs more female rockers...not more critics","post_message":"\"The problem for women is that our role in popular music was codified long ago.\""},{"comment_id":"10153774153353145","commenter_b":"hello your in AMERICA","commenter_a":"If this sign dictated what language I spoke at home or with my friends, I would take offense. But if this sign was at work, I think it is appropriate to expect English. You shouldn't be off carrying on non-work related conversations anyway, English or not.","post_message":"English only? Many Hispanics who use the Deltona Community Center took offense to this sign. How would you feel if your job tried to enforce this rule? The organization said the sign was necessary for safety reasons. @webpagelink"},{"comment_id":"1697473917208999","commenter_b":"Joel, We have to pull together!! Please help us get Donald Trump to the White House! We started a small group and we are looking to build it up and educate people Pleaseee pop in from time to time?!? @webpagelink/ Please help us unite!!","commenter_a":"Go Trump! Make America Safe and Great Again!","post_message":"WOW! Great poll. Fox News just released their new GOP national poll - THANK YOU AMERICA! Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10154557066322908","commenter_b":"feelthebern.org :)","commenter_a":"Do not vote for Bernie Sanders, he is VERY MISGUIDED!!!","post_message":""}]
