[{"comment_id":"10155299383400354","commenter_b":"Those of us who are legal US citizens in need can't get help yet we give those who are illegal help. When I fractured my neck in 3 places and shattered my leg all I got was 200 in food stamps. I was 55 and I lost everything. Stop giving this country away to those who disrespect with their very first action. Coming here illegally.","commenter_a":"They are giving them ids and other things so they can once again steal the presidency through illegals voteing. Get out and vote stop the craziness. Our president is in office illegally as he is not a US born citizen. So of course he is for illegals.","post_message":"NYC's New Illegal Alien ID Program Includes Free Membership to 33 Top NY Venues, Including the Metropolitan Museum of Art."},{"comment_id":"10155602222490354","commenter_b":"I would let my daughter be a part of this group, it has been infiltrated by radical lesbian feminist. Children are not safe with them!!!","commenter_a":"Is this a great country or what?","post_message":"It's not clear how this will affect cookie sales...."},{"comment_id":"1019752221480019","commenter_b":"@username then leave!!!!","commenter_a":"Trump does not represent most people in America and he certainly does not represent me. He may be in office 4 years, but I can guarantee you he will not be in another 4 years after that. We will have war in America because of this!","post_message":"President Barack Obama and President-elect Donald J. Trump just met for the first time — and this is what happened. @webpagelink"},{"comment_id":"1774855949444875","commenter_b":"Really are we surprised??? He has been committing political suicide for over a week now and handing it to Hillary with the comments about over weight women, his tax evasion, and then of all things to attack the vets???? Pitiful win if you ask me and sad that she is not winning with a landslide.","commenter_a":"Pence is going rogue! :):) He's pulling a Sarah Palin....he's running in 2020! :):):)","post_message":"A new poll in one key battleground state shows Donald J. Trump's campaign facing some trouble ..."},{"comment_id":"1045431208809965","commenter_b":"This is not news worthy.","commenter_a":"Who cares?","post_message":"BREAKING> Beijing wins bid to host 2022 Winter Olympics. China's capital will be first city to host summer & winter games."},{"comment_id":"10156359711135354","commenter_b":"Take the fuckin niggers too.","commenter_a":"Yeah screw Obama and the Obama does not care health insurance bull crap. He can get the hell out of America and take his illegals, criminals and Muslims with him.","post_message":"“We’re going to be aggressive…”"},{"comment_id":"1493294134044387","commenter_b":"She is pure evil & should be put to death.","commenter_a":"Hillary is done the writings on the wall god look at the rallies know it's there for her no signs no bumper stickers no T-shirts and say Hillary for prison. She's a criminal and should prosecuted","post_message":"Wow!"}]
