[{"comment_id":"1707295909299362","commenter_b":"During WWII there was a very true saying: \"Loose lips sink ships.\"","commenter_a":"Nope","post_message":"This whole thing is ugly."},{"comment_id":"10153829711751523","commenter_b":"Eirik, shut up ya punk ass bitch","commenter_a":"I seen him, but I'm not saying nothing!!!!","post_message":"UPDATE: Donald Rozga has been found safe!"},{"comment_id":"10153245276305950","commenter_b":"Right clown ass hoe bitch go die","commenter_a":"And we call these animals humans??! Disgusting how they are getting away with treating the people who put their lives on the line to defend them. We should allow them to continue to kill each other ... that would mean less barbaric, meaningless, animals taking up valuable oxygen","post_message":"WATCH: Some \"angry\" protesters clash with police in Chicago video of #LaquanMcDonald's shooting released @webpagelink"},{"comment_id":"10153858416863271","commenter_b":"Sick woman. I mean the one who posted this comment.","commenter_a":"I've been looking at her Facebook pages(she has two), I'm not justifying her actions and believe it's absolutely disgusting but I'm pretty pretty sure she's special needs. I'm not saying she shouldn't be punished or condoning her behavior but I honestly don't think she knew any better. I'll be willing to go out on a limb and say she was sexually abused. She probably did to him what had been done to her or what was told to do. I can't even imagine what's going on behind those walls.","post_message":"Jessica McCain told investigators that she recorded the sex act on a borrowed cell phone, according to court documents."},{"comment_id":"10154102502686509","commenter_b":"haha at all you hatin mf'rs Trumps winning we gonna get that wall built and these isis mf'rs taken care of whether y'all like it or not","commenter_a":"Obama should contest this and say its forged..","post_message":"Donald J. Trump says it's complete with his mother's handwriting inside the cover and the address of his boyhood home. @webpagelink"},{"comment_id":"1369042613147367","commenter_b":"@username and us tax payers get to pay for double security bc the poor widdle brat can't move and change schools like every other American kid has to do when they move🙄🙄","commenter_a":"I mean Donald did say if she wasn't his daughter he would marry her so essentially it's what he wanted.... still Creepy AF!!! 😷😷😷","post_message":"Did you see this coming?"},{"comment_id":"10153554129132452","commenter_b":"#motivation","commenter_a":"Leydy","post_message":"Congratulations, Alfonso! The 96-year-old World War II veteran graduated from USC and is the oldest graduate in the school's history."}]
