[{"comment_id":"10154203393907994","commenter_b":"Cut their dicks off.!!","commenter_a":"Wow","post_message":"THIS JUST IN: Police have released a picture of the second man wanted in the abduction and rape of a woman from a Walgreen's parking lot. Police say the two drove around and took turns raping her. More info:"},{"comment_id":"10155111433599614","commenter_b":"@username in Oregon not her she stinks hahah","commenter_a":"Jessica @username Davenport what an idiot lol","post_message":"The woman said she tried to get her pet ball python -- \"Bart\" -- out using cooking oil, but that didn't work.  She went to the hospital, where her ear was numbed and stretched even more, freeing Bart.  \"He acted like nothing even happened and was totally chill,\" she said."},{"comment_id":"10155047636614657","commenter_b":"AND SHE WANTS EVERY WOMAN TO BARK LIKE A DOG !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Should every single woman in America have a federally mandated abortion, too? Is that where we're heading?","post_message":"A specious, simplistic pander."},{"comment_id":"10153644679730927","commenter_b":"Of course, if you are a dissenter, you will be eating in prison. If it's so great in Cuba, why do we still have Cuban refugees fleeing to the US? Could it possibly be due to the oppressive Marxist-Leninist Castro regime? Leftist fools admire their heroes, communist revolutionaries Fidel Castro and Che Guevara. Patterson should stick to writing novels.","commenter_a":"So go live there James......it's called socialism, or communism. New cars are 1958 chevies, and you forget the rationing lines weekly for food? Plane flights now available for you James, and don't let the door hit you in the a$$.","post_message":"WATCH--\"I think in this country we should at least take care of the basics. So we doing a bad job in that area. Really bad ...\""},{"comment_id":"1100928479922812","commenter_b":"Do you even beleive in smart women?","commenter_a":"Maybe compared to all the stupid people who support them they seem smart. The one eyed man is king in the land of the blind !","post_message":"I am not one of these people that thinks Hillary Clinton is The Smartest Woman in the World.  I don't think Elizabeth Warren's The Smartest Woman in the World.  What happens here is that whatever liberal female rises to prominence, it's just standard operating procedure that the media and everybody's gonna refer to them as The Smartest Woman in the World."},{"comment_id":"10153672504893812","commenter_b":"Demonstrators showing their ignorance.","commenter_a":"Jade helm time to test what you got","post_message":"JUST IN: State of emergency declared in St. Louis County due to Ferguson unrest: @webpagelink"},{"comment_id":"10153397476831336","commenter_b":"What do we do when Hildebeast gets elected? She certainly has no opponent in Jeb.","commenter_a":"What he meant to say was this was another victory over the people of America","post_message":"President Barack Obama called today’s Supreme Court ruling on gay marriage “a victory for America.”"}]
