[{"comment_id":"10152957013791336","commenter_b":"It's NOT HEALTHY to break into their homes or rob them or attempt To hurt their families......","commenter_a":"Why are all Americans so obsessed with guns, it's not healthy.","post_message":"Bonnie and Clyde's infamous pistols of choice — What are they worth? Find out tonight at 8:30p ET on Fox News Channel. (via Strange Inheritance)"},{"comment_id":"10153885650817061","commenter_b":"@username , please take the tin foils off. For Benghazi, blame the Republicans. All of what you are saying about HC is all conspiracy based. EVERY investigation ha cleared her of wrongdoings. She is not perfect, but far better than that lying rapist BIGOT woman hater thief (ask the thousands of people he stiffed out of their money) IDIOT DT.","commenter_a":"Oh...don't mention Indiana! We are not proud that we have idiots voting for him!","post_message":"Sign of the times: Donald J. Trump supporter from Indiana says he's gone to great lengths to protect his yard sign with the candidate's name on it. So far, he says, \"I'm 2 and 0.\""},{"comment_id":"493286290862389","commenter_b":"Now if we could just get her to STAY in Africa. ..and her little pea brained spouse. .","commenter_a":"I believe Hillary and Bill did something similar before they left office, milked the system for all they could and stole hundreds of thousands of dollars worth of White House furniture and art work.","post_message":"First lady Michelle Obama's family trip to Africa, Spain and Morocco to promote her \"Let Girls Learn\" initiative, and cut a CNN documentary on the effort, has already crossed the $1 million mark with many more expenses still to be tabulated. According to the bills that have already come in, Obama, accompanied by an entourage that includes her mom and daughters, has spent about $1.06 million: $512,737 for hotels and $252,471 for limos and transportation. - via Washington Examiner"},{"comment_id":"10152964045994753","commenter_b":"I must be living wrong, that bitch","commenter_a":"This is in England so who cares","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"1169723563063063","commenter_b":"SHES ONE HELL OF ALOT BETTER THAN THE TRANNY AMERICA HAS PARADING AROUND AS A WOMAN NOW! THE TRANNYS NAME IS MICHAEL! ODUMBASS LOVES HIS GAYS! DAMN THAT IS ONE BUTT UGLY GORILLA FAVED TRANNY! MELANIA HAS MORE CLASS IN HER CRAP THAN THE TRANNY HAS IN HIS WHOLE BODY! P.S. TUCK THAT SCHLONG TRANNY!","commenter_a":"Agree","post_message":"I agree!"},{"comment_id":"10154261314153525","commenter_b":"He had it made on Howard channels. Then double crossed hogan with the tapes etc. Dirt bag. How many times can he use the connection with tony Stewart. He is a Howard copy cat with less talent.","commenter_a":"Jimmy","post_message":"JUST IN: Bubba the Love Sponge is off the air in the Tampa market. MORE: @webpagelink"},{"comment_id":"10153465168796162","commenter_b":"She shouldn't have said anything. Should not have been on social media while working.","commenter_a":"It's not racist it's just ignorant, she could have just said these rude people","post_message":"Brookfield Zoo responds after an employee posted what some may call a racist comment on social media... @webpagelink"}]
