[{"comment_id":"1796249287363379","commenter_b":"Khloe would put this midget bitch on blast.","commenter_a":"So what","post_message":"She really don't like the Kardashians. #WSHH"},{"comment_id":"10154298930434497","commenter_b":"Also, I don't appreciate you insulting my intelligence without provocation and based on assumption. You should work on how to prevent yourself from treating people like shit who don't deserve it.","commenter_a":"I know this is satire, but they broke my suspension of disbelief, with the suggestion that a television company actually covered Bernie's campaign...","post_message":"Via Onion Politics:"},{"comment_id":"1001149379923298","commenter_b":"Watch out folks, she will give you the evil eye!","commenter_a":"HillbillyHillary at the Arkansas Pig festival,stumping for votes","post_message":"The video Hillary doesn't want you to see. This could sink her campaign! [Watch below]"},{"comment_id":"10152776226595047","commenter_b":"stupid anti Christians !","commenter_a":"Can't let them get away with this.","post_message":"General Craig Olson thanked God for his military successes, and asked for prayer for those being deployed at a National Day of Prayer event. Because of his public declaration of his beliefs, an anti-Christian group is demanding he face a court martial. This is outrageous. SIGN & SHARE the petition to fight back: @webpagelink"},{"comment_id":"10152738013846135","commenter_b":"I didn't even know there were still idiots who thought like this....holy crap. What is WRONG with people?!","commenter_a":"Blacks got their way again!!!!!!!","post_message":"Today's Baltimore Orioles game was the first ever game to be played without fans. It led to some crazy pictures! PHOTO GALLERY: @webpagelink"},{"comment_id":"10154382279344497","commenter_b":"Aye. Fuck bitches, make money.","commenter_a":"Single man enjoying free milk, basking in savings after not buying cows.","post_message":"Via ClickHole:"},{"comment_id":"10152574431526636","commenter_b":"but its ok for females to tell us how to sit? bit sexist.","commenter_a":"Alright, then women have to stop wearing leggings without a skirt..leggings by themselves looks trampy.","post_message":"Men, here's why you should close your legs on public transport..."}]
