[{"comment_id":"10153554129132452","commenter_b":"#motivation","commenter_a":"Leydy","post_message":"Congratulations, Alfonso! The 96-year-old World War II veteran graduated from USC and is the oldest graduate in the school's history."},{"comment_id":"10153932824095575","commenter_b":"If you have bones in your closet be sure they will come out.","commenter_a":"BS alert!","post_message":"National Enquirer parent company refutes Ted Cruz--- DONALD TRUMP had nothing to do with our story...."},{"comment_id":"1108523962492406","commenter_b":"Illegal aliens 62%!","commenter_a":"Most people on welfare are in a red state and are white. @webpagelink @webpagelink Undocumented immigrants pay taxes all the time. \"The 11.4 million undocumented immigrants currently living in the United States collectively paid $11.84 billion in state and local taxes in 2012. ITEP’s analysis finds their combined nationwide state and local tax contributions would increase by $845 million under full implementation of the administration’s 2012 and 2014 executive actions and by $2.2 billion under comprehensive immigration reform.\" @webpagelink","post_message":"Fighting off anti-immigrant myths with FACTS."},{"comment_id":"520985371427355","commenter_b":"Come get it I live in bend oregon I will be waiting","commenter_a":"come and take it buckwheat","post_message":"They are demanding that we give them money for their ancestors slavery. 'LIKE' if you will REFUSE to pay slave reparations!!"},{"comment_id":"10153164083911770","commenter_b":"Good, she needs to leave the country too","commenter_a":"Good","post_message":"An atheist councilwoman in a town amid New Jersey’s suburban sprawl stormed out of a council meeting on Thursday and quit her job after the council decided to name the town’s Christmas tree-lighting event a “Christmas Tree Lighting.”"},{"comment_id":"10153075013704342","commenter_b":"And then she'll leave...","commenter_a":"idiots, so the what are they going to pay for their new animal sanctuary now that the livestock are not bringing in enough money to feed or maintain the ranch? oh yeah, they'll just do another gofundme scam and a bunch of idiots will pay their bills for them. crap like this is getting ridiculous","post_message":"CATTLE RANCHER GOES VEGAN: For four generations, cattle have been raised on the Sonnen Ranch in Angleton. A few months ago, that tradition ended when the current rancher got back together with his ex-wife, and she pressured him to go vegan."},{"comment_id":"10158083946035206","commenter_b":"Then clean your ears out!","commenter_a":"Can someone please tell me what the heck Trump stands for because to this day i haven't heard anything positive come from out of his mouth.","post_message":"Donald J. Trump supporters describe why it's sometimes hard to be for Trump. @webpagelink"}]
