[{"comment_id":"948371528584407","commenter_b":"They will never be Americans .. They are all murders and need to go home..","commenter_a":"His typical BS. Lie Muslims. Don't belong here !!!","post_message":"Do you think there was anything wrong in saying this?"},{"comment_id":"555137491342104","commenter_b":"HELLARY ROTTEN CLINTON IS A SEXUAL PREDATOR AND A RAPIST CRY BABY","commenter_a":"We won fairly and stop saying it was the russians and trump. Stop filling your head with media lies","post_message":"WATCH LIVE: Members of the Electoral College in Texas gather at the statehouse in Austin to vote for the president and vice president of the United States. One Republican elector, Chris Suprun, has revealed his intention to vote for John Kasich instead of Donald J. Trump."},{"comment_id":"1700674326840051","commenter_b":"Leave our flag alone!","commenter_a":"Leave it alone!","post_message":"Men and women have died defending our flag, don't mess with it. Do you think the flag should be left alone?"},{"comment_id":"10153952900813984","commenter_b":"She should Benin jail!","commenter_a":"How many of those radical Islamic terrorist countries donated to the Hillary fund. She knows they did.","post_message":"Hillary thought she'd jump on the opportunity to steal some attention from the Republicans during the debate, but it did NOT go as planned. Critics immediately fired back and pointed out something hilarious... Is Hillary Clinton one of the last people you would ever want to become president?"},{"comment_id":"1275116595847182","commenter_b":"@username You pathetic asswipe.","commenter_a":"Look at the number of blacks commiting crimes and try to tell me the only reason it's so obviously more blacks than whites is because of racism.","post_message":"Only White skin deserves justice?"},{"comment_id":"1155155194501829","commenter_b":"Get over it. There are two different justice systems, if not more; operating within one....","commenter_a":"white privilege","post_message":""},{"comment_id":"1119860174747403","commenter_b":"I don't need friend like that... Whend they go to my home they got everything and more.. and whend I go to they shiet hold I have to wayting.. I don f think so... don't invite me no more.. I got my own park in my house.. .. is my house and I live here. Jajajajaja... fucking IDIOTS...","commenter_a":"Lydia Taylor lol so you 😂😂😂","post_message":"The struggle"}]
