[{"comment_id":"1842076306034200","commenter_b":"But the opinion of a lying, misogynist, braggart like Trump is worth listening to ? Some people . :-(","commenter_a":"Worst acceptance speech ever Be appreciative of the award. Nobody watches the Golden Globes to hear your multi million dollar opinion","post_message":"WOW! Meryl Streep just brought down the house at the Golden Globes..."},{"comment_id":"10155094693558628","commenter_b":"Yes! Illegal is illegal. He is enforcing laws that have been ignored far too long! If they want to be here then do it the right way and not look to us to support them!!!","commenter_a":"No","post_message":"Like Opposing Views for more!"},{"comment_id":"10158129645930015","commenter_b":"We don't want a wall.","commenter_a":"I live in mexico , but do you know that all the money invested on that stupid wall , it will come out from your pocket , American taxpayer will pay for that wall ,not us, we ain't paying that thing, we have bigger problemas than that ,good luck with your wall","post_message":"Do you support a border wall with Mexico?"},{"comment_id":"1008697665856648","commenter_b":"Deport them now ,let them go to enjoy Saudi Arabia!","commenter_a":"GOOD the muslims have NO right to tell others what to do and what not to do and no one has any right to attack anyone over an imagined religious superitory","post_message":"In protest, hundreds are posting photos of themselves wearing swimsuits in public places"},{"comment_id":"585837851590068","commenter_b":"Unlike Hillary taking the china!","commenter_a":"No matter your political views, Mrs. Reagan always showed great class and dignity to the Whitehouse. The love for her husband was extraordinary. May you rest in peace.","post_message":"Nancy Reagan died this morning of congestive heart failure at the age of 94. She will be buried at the Ronald Reagan Presidential Library in Simi Valley, California, next to her husband. @webpagelink"},{"comment_id":"10154787098266438","commenter_b":"@username exactly, many of the \"1%ers\" are pro choice liberals, they can fund it.","commenter_a":"Just goes to prove, don't make women angry. We don't get even, we get revenge. Elected officials had no idea what they did. This is just a start. With Elizabeth Warren, Bernie Sanders, Schumer, and many others we will take our rights back. Ryan and Trump need to be scared, very scared.","post_message":"Huge crowds everywhere from D.C. to New York to Chicago to LA to Memphis to Nashville to Raleigh to Denver to Idaho ..."},{"comment_id":"10153224417118984","commenter_b":"Both sides of her mouth - she's guilty and she knows it","commenter_a":"YES; An Orange Pant Suit would do just fine!!","post_message":"The irony is unbelievable. I don't think I could have said it any better than Hillary did in this 38-second video... Should Hillary be punished for her email scandal?"}]
