[{"comment_id":"1211790348838313","commenter_b":"Punk ass bitch mo fos!","commenter_a":"You people who are shooting these schools and theaters up aren't proving nothing to nobody except your a bunch of punks bitches and cowards.","post_message":""},{"comment_id":"10153714584104087","commenter_b":"She's a pure Red in disguise.","commenter_a":"The PEOPLE are speaking. She's winning by a lot of votes.. doesn't matter what the internet thinks. Real people are voting, and real people are voting for her.","post_message":"Fresh off a commanding win in New York, Hillary Clinton has a 13-point edge in the biggest state up for grabs in next week's primaries."},{"comment_id":"10153258826178812","commenter_b":"women are such babies","commenter_a":"Is it necessary to show this photo? This was someone's child, a little more respect would be great. Rest in Heaven, thank you for your service","post_message":"Navy officials: Navy SEAL killed in parachute accident in California: @webpagelink"},{"comment_id":"1205762199443808","commenter_b":"#trump2016","commenter_a":"Oh boo hoo. Poor baby.","post_message":"\"Fox News has been treating me very unfairly and I have therefore decided that I won't be doing any more Fox shows for the foreseeable future.\""},{"comment_id":"10153578446431509","commenter_b":"Africa's a mess. Look what happens when the USA forces the colonials out early. If Britain has still been in control these things wouldn't be happening","commenter_a":"Let's not forget what's happening in South Africa too.","post_message":"ISIS operatives beheaded two groups of prisoners, believed to be Ethiopian Christians, in Libya, according to a video released by the terror network's media arm. @webpagelink"},{"comment_id":"10153866679791002","commenter_b":"This is what happens when the majority of nursing moms thinks it's ok to expose their breasts while nursing. No, use a cover please. Yes, it's natural and better for your baby, but that's still a nipple being shown to the public...","commenter_a":"I don't think John was saying that children should be denied a family fun day. But, he is right, when the children are hot and fussy, they are no longer enjoying the event. They are miserable and they are making the person next to them miserable and you too. That's not fair to your child or the patron sitting next to you. I know parents want to see the rest of the game but, that's one of the sacrifices we make for our young children. Changing a soiled diaper in such close proximity is rude and plain nasty!","post_message":"The Cincinnati Reds are opening a nursing suite at their stadium for nursing moms who want to feed their little ones during the game.  Do you think the Detroit Tigers should have something like this?"},{"comment_id":"549294818565391","commenter_b":"Its not a womans choice to kill an unborn child if you dont want a child dont have sex its that simple","commenter_a":"It's each woman's choice.","post_message":"Today marks the 43rd anniversary of the Supreme Court's decision in Roe v. Wade. On this somber day, I know it's difficult not to be discouraged that the Supreme Court's decision in Roe still stands. But now is not the time to give up. We must work together to continue promoting a culture of life in Arkansas and America. Read more:"}]
