[{"comment_id":"10153540366322061","commenter_b":"It's not. But I've never seen it happen. Making laws to protect the rights of others is NOT discrimination. Even if you find the laws offensive.","commenter_a":"So why is it alright to discriminate against Christians?","post_message":"Charles Barkley pushing the NBA to move the All-Star game from North Carolina due to state's so-called \"anti-LGBT\" law. \"As a black person, I against any form of discrimination.\" @webpagelink"},{"comment_id":"1374717489237646","commenter_b":"Deport all Mexicans","commenter_a":"Alot of snowflakes on here. Trump!!!!!","post_message":"LIVE NOW: Donald Trump speaks at a \"Thank You Tour\" rally in Mobile, Alabama."},{"comment_id":"10153933838211756","commenter_b":"Feminazis will not be happy either way","commenter_a":"I don't think Super Girl is all that great. You have to have special, super powers to be a strong, useful woman? Not a good role model in my opinion.","post_message":"One bright spot: Strong female-centric shows like \"Supergirl,\" \"Quantico\" and \"Blindspot\" are doing well."},{"comment_id":"870644459698474","commenter_b":"Hillary will win. I'll take more Clinton any day.","commenter_a":"That is disgusting! They just don't get it! We don't want another bush! But their greed will get the better of them!","post_message":"Getting closer to announcing?"},{"comment_id":"10153772983356813","commenter_b":"Does that mean pardoning him for his rape accusation that he fled the country for as well?","commenter_a":"Snowden deserves a pardon. More than Obama deserves to be POTUS.","post_message":"Now's the time for Barack Obama to pardon Snowden."},{"comment_id":"1432027056824713","commenter_b":"PUSSY","commenter_a":"Canada doesn't want these idiots any more than we do.","post_message":"Progressives always break their promises."},{"comment_id":"10152747219056051","commenter_b":"This is soooooo wrong and why can't these cases be corrected immediately when the proof comes out. The women who do this should be prosecuted and pay for All damages!","commenter_a":"Back in 1990 I had to pay 400 a week child support for 3 kids the courts let me have custody of my oldest boy gave the ex-wife custody of the three youngest the day that we walked out of the courtroom the ex wife let me have the other three children two years later the welfare department came to me and told me that I have to pay back the last two years of u living expenses that they was giving her she forgot to tell them that she was getting 400 a week the last 2 years took me 2 years in the court system to fight it the system does not like to put women in jail so I know what you are going through","post_message":"This man had an arrest warrant issued for him and got threatened with jail time over unpaid child support. There's just one problem."}]
