[{"comment_id":"1299697093430376","commenter_b":"Snaaaaacks forreal. Them ladies looking like 4 course meals family","commenter_a":"So we all goin to ignore all the female snacks 😍😍👅 in this video ...","post_message":"Mike Tyson going in on Soulja Boy! #WSHH #MikeTyson #SouljaBoy"},{"comment_id":"633140033543242","commenter_b":"That's Ok She will BURN IN\"HELL\" Along with All The Rest of the Sheep That Followed HER !","commenter_a":"Ugly inside and out AND GETTING WORSE EVERY DAY","post_message":"People are finally getting fed up with Oprah... Great. Let's get this hack off the air once and for all. Should Oprah be kicked off TV?"},{"comment_id":"1027758113945859","commenter_b":"What a bunch of liberal pussies you all are.....keep smoking that pot and living in your mom's basement LOL","commenter_a":"I love you Bernie!","post_message":"In just a few days, voters across New York will make their choice for the presidential nomination on Tuesday, April 19. The entire country will be watching as the results come in. And with your help, New York will send a profound message to the political and economic establishment in this country. That's why we're asking you to commit to vote for Bernie."},{"comment_id":"1209490769090378","commenter_b":"Hillary is no lady she is more of a whore.","commenter_a":"We've already learned that this lady is a huge liar. What she says, and what she can do, are 2 different things. Obama just got blocked, so, hopefully this we won't have to worry about it and Trump will just be elected. Fingers crossed.","post_message":"DON'T let this woman be elected!!! @webpagelink"},{"comment_id":"10153860714632098","commenter_b":"Ok people get real speeches are written for them and each one has something from another as their are only so many things that can be said in a speech such as this. No I am not in favor of our politics right now and feel that neither are a good choice for the US. But that aside do we not have more important things to worry about then what a speech writer gave to the wife of a running mate? Move on and let's get things going in a better place for our country, with so many loosing their lives recently I feel this is a low priority. Let's make change for good elect Mickey Mouse. Lol","commenter_a":"Give her a grade F - fail, flunked, fake !","post_message":"Melania Trump accused of plagiarizing Michelle Obama's speech"},{"comment_id":"10150666434674999","commenter_b":"Haters are a sure sign that future President Trump has hit the nerves of all those left wing panty waste liberals that pulled their heads out of the sand just long enough to realize that Hillary isn't the omnipotent goddess they thought she was. Dry those tears little babies. Like.....wipe it with a cloth.","commenter_a":"This country is such a mess, it would probably take a Donald Trump to get us back on track. Shows how far we have sunk. Thanks Obama.","post_message":"Something unmistakable has happened to Donald J. Trump since he announced his campaign for president in June: He has become a better candidate."},{"comment_id":"1813306192269436","commenter_b":"Clinton lost because she is Hillary. End of story","commenter_a":"I don't understand why this is just going past everyone like it's ok! We need to do something. If a democrat did this they'd be ridiculed left and right","post_message":"EXCELLENT question! Image by Occupy Democrats, LIKE our page for more!"}]
