[{"comment_id":"1190297117696296","commenter_b":"What did she do ? Omg we're in trouble with these idiots able to vote.","commenter_a":"Shut up Bob Marlee's sister!!! BLM lol","post_message":"Let's Talk... tonight's debate. We're live at Union Square asking people to sound off.  Be sure to watch The Countdown: Hofstra Debate at 8pm here on Facebook and @webpagelink/  We'll have live coverage of the debate at 9pm here: @webpagelink"},{"comment_id":"10154340193151509","commenter_b":"Hillary has an estimated 70-80 pct of Hispanic votes , but only needs 40-45 pct according to experts. I'm just the messanger. Rand Paul is my pic.","commenter_a":"Not that I care for this socialist , but the Latino vote will bring Hillary over the top.","post_message":"Donald J. Trump has been tearing away at Bill and Hillary Clinton for more than a week"},{"comment_id":"938211592934866","commenter_b":"Kick His Ass Anyway, besides it was one of Jesus's Crew","commenter_a":"Jesus says an Eye For an Eye. Someone down there kick his ass Please and Thank You","post_message":"Remember, nothing says \"Soldier for Christ\" like giving a child a black eye!"},{"comment_id":"10153352835244384","commenter_b":"I love Nancy Pelosi. Her farts smell like broccoli.","commenter_a":"I love Nancy Pelosi, she is a superb role model, and tireless worker for all Americans!","post_message":"Today, under the leadership of Congresswoman Rosa DeLauro, House Democrats are again taking the lead in addressing one of the most pressing economic challenges confronting our country by re-introducing the Paycheck Fairness Act. Securing a fair shot for women in the workplace is critical to ensuring prosperity for our nation. Rather than continue their cycle of obstruction and dysfunction, House Republicans should join with us to close the gender wage gap so we can provide bigger paychecks and better infrastructure for all Americans. @webpagelink"},{"comment_id":"922507297858399","commenter_b":"Ms. Miller, I'm a proud supporter of Mr. Trump. I'm so concerned that with Ms. Clinton's ability to \"Fix\" things she may have the ability to fix the election. I'm a true believer that this also happened in the current Pressident's second election. I am afraid that the Dem party will be in place for many years to come with the young and uninformed youth being targeted supporters through free things offered to them as well as dead people and illegals voting. . I'm hoping I am very wrong though. God help us.","commenter_a":"Wow!! While speaking on fox news live right now Mr trump actually seems presidential. This is the tone and demeanor we, the people have been asking you for. Let hillary bury herself. She will!!!! Be a better man. Be the man America needs. We want to believe that you can lead us but not unless you can start to act and sound like a good president.","post_message":"Radical Islamic terrorism threatens our world. Anyone who cannot name the enemy - cannot fix the problem!"},{"comment_id":"10153549006508984","commenter_b":"Never mind i remember now ......she made one bad porn with that BIG A!!","commenter_a":"I side with Meg Kelly. Kim's a dumb fat ass bitch!","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with...  Do you side with Megyn Kelly on this one?"},{"comment_id":"10155033056251350","commenter_b":"you alice are the lame one.... bet u r fun at parties....not!","commenter_a":"how can americans put the flynn event in context. flinn's entry into the trump power structure was vigorously opposed from the beginning: one might even consider his a marked man. part 2: media has propogated trump's comments on intelligence agencies extensively. so one could ask the question how does the leak on flynn occur in the first place: NSA surveillance or other. it would appear a US intelligence agency leaked to the anti trump news media:))) could one consider that a direct attack on this nation to influence American government: yes. trump must drain the swamp in the intelligence community now. the entire establishment apparatus that supported the status quo is now actively working against change middle class voted for: start the purge. there is an outlier that must be considered: Israel. trump is surrounded by Israel firsters. was flynn one of those or was he an American firster. did ...","post_message":"On this Valentine Day, watch George H.W. and Barbara Bush share their touching love letters on TODAY in 2011 (and try not to cry!) @webpagelink"}]
