[{"comment_id":"10153987793981320","commenter_b":"She is such a bimbo","commenter_a":"They have to be kidding! She is a joke! Tina Fey would do a better job!","post_message":"Sarah Palin has officially endorsed Donald Trump for President, but does it matter? Thoughts?"},{"comment_id":"10153765705598132","commenter_b":"Don't care what her point is/was... No woman should do that. It's nasty and probably a health hazard as well. Koo koo.","commenter_a":"Should have been declared a Health Hazzard and disqualified. What a disqusting thing to subject others to. And can someone tell me how being a ragless woman is going to get sanitary napkins to 3rd world woman? I bet if they don't have tampons they don't have TV either... Stupid Stupid Stupid","post_message":"She thinks critics only prove her point."},{"comment_id":"10152883726561491","commenter_b":"No..I am retired military..my tune is if there were ZERO GUNS...if you remember Archie Bunker : his daughter said :\" daddy do you know how many people are killed with guns every year?\" And Archie said : \" would you rather they were pushed from windows\"! No my friend I only mean Yes we need guns for protection and they great out door sports.. I only wish we didn't need such deadly force. It is , to have a gun or guns an important right. Especially in other countries where many citizens cannot defend themselves from thier own evil corrupt governments who kill thier own citizens..like Assad in Syria..awful oh yes own constitutional right to have arms and guns is one of the best rights and part of free speech..that's how we won the revolutionary war and became our very own UNITED STATES OF AMERICA..if ordinary citizens had no guns ...","commenter_a":"Guns mankind's worst invention.","post_message":"The course of the bullet corrects midair."},{"comment_id":"542298055958487","commenter_b":"That shouldn't come as a suprise.There is alot more where that came from. JAIL HILLARY 2016","commenter_a":"If this was only true. If she is arrested she should be put it with all the other criminals and NO special treatment","post_message":"She looks good in orange..."},{"comment_id":"1220911264593201","commenter_b":"@username who is illegal stupid!!!","commenter_a":"FINAL, now THAT is something to celebrate because: #BarackObama is a sociopathic liar, a national disgrace, an enemy of the Constitution, racially divisive, a promoter of black genocide by abortion, denies the threat of radical Islam and then supports that threat, a communist sympathizer and a traitor to civilization. That is his legacy.","post_message":"SATURDAY: Watch President Obama's final White House Correspondents' Dinner - LIVE on C-SPAN (TV) and here on C-SPAN's Facebook page. More here: @webpagelink"},{"comment_id":"1234184189935923","commenter_b":"Júlia, por favor, não vire uma crazy cat lady!","commenter_a":"Se encontró una asociación entre tenencia de gatos a temprana edad y desarrollo de trastornos siquiátricos en la adultez. Según el journal of schizophrenia research. Doble de probabilidad de desarrollar esquizofrenia, post infección por Toxoplasma gondii. (Por arañazo de gato) Cuidado con quedar como la vieja de los simpson. Paulina Santander","post_message":"A parasite common in house cats has been linked to mental illness."},{"comment_id":"1184765668249575","commenter_b":"Bye bitch","commenter_a":"Please stop giving her attention","post_message":"Poor Sarah, she has a boo-boo and it's all Hillary's fault."}]
