[{"comment_id":"784349154999752","commenter_b":"Bitch","commenter_a":"Another racist liberal what does she have against Orange people. Ray","post_message":"Oh, Meryl...."},{"comment_id":"10153573907066509","commenter_b":"She couldn't bring women down, only herself!","commenter_a":"I don't want to swear.... but.....way to go bringing the equality movement down a peg! !!! You really didn't think that one all the way thru!!!! :(","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"},{"comment_id":"10153507690103812","commenter_b":"They attack to eat. It's a risk of going into an ocean. Yet millions do multiple times yearly. Safely.","commenter_a":"I wish they could stop telling the lie... 'Sharks don attack humans'.... Yes they do!!","post_message":"UPDATE: Officials: Girl and boy may have lost parts of limbs in separate shark attacks on same stretch of NC beach: @webpagelink"},{"comment_id":"10152526898447623","commenter_b":"No. The statue was in HONOR of our fallen heroes. You are a disgrace.","commenter_a":"King should be ashamed. ..","post_message":"The kneeling soldier statue will be removed from the King Veteran’s Memorial after Tuesday night's city council meeting."},{"comment_id":"468706906587237","commenter_b":"She is a Dumb Idiot!","commenter_a":"We dont need awoman Preident .that is for immigration ....","post_message":"Carly Fiorina just had these harsh words for Donald Trump. Do you agree or disagree?"},{"comment_id":"895487660544289","commenter_b":"I wanna find the actual article sited for this one","commenter_a":"Tiffany Rae 😐","post_message":"Another colossal Republican waste of taxpayer money."},{"comment_id":"1920926941484648","commenter_b":"Worst president ever... and she's never been a First Lady... low class trash is what she is!","commenter_a":"Not at all","post_message":"Are the Obamas a good representation of the American people?"}]
