[{"comment_id":"10155189729959199","commenter_b":"Kill the mother.or hang up.her...","commenter_a":"Sick twisted and very disturbing","post_message":"Police say this mother killed her baby by feeding her a teaspoon of salt in order to get back at the child's Dad >>> via.q13fox.com/zXtwH"},{"comment_id":"1153087074711321","commenter_b":"we need more sex workers to solve crimes the cops can't","commenter_a":"They should give her an award. She has saved countless lives.","post_message":"Police found what they described as a 'kill kit' in the trunk of Falls' car — including handcuffs, several long knives, a box cutter, two axes, a machete, a sledgehammer, a bulletproof vest, another gun, shovels, a rubber tub large enough to hold an adult, and bleach and other cleaning supplies."},{"comment_id":"10154548445633854","commenter_b":"OMG when will the lame lies end???? I'm highly offended that she thinks that we're ALL that stupid!!!!","commenter_a":"If she didn't remember taking required security training, how in the heck would she be able to know what (c) stood for? and how can she be qualified to be POTUS?","post_message":"She thought it had to do with alphabetizing emails. And she thinks she is fit to lead?! 😂"},{"comment_id":"1007038892685973","commenter_b":"Liar liar","commenter_a":"'@username for President of the United Sates of America, 2016-2024!!","post_message":"Read the texts Hillary sent some friends last night during the GOP debate."},{"comment_id":"1514026052232145","commenter_b":"Omg can you just shut it, you selfish brat!!!!","commenter_a":"Hey I thought he was leaving this country cause he did not like here. Well be gone with your bad self","post_message":"An expletive-filled clip of Kanye West's alleged tantrum has leaked."},{"comment_id":"467147946806146","commenter_b":"Gary McGowan, an interesting read!","commenter_a":"That headline...shame on you, @username.","post_message":"'When we get the wrong answer, in medicine, that not a matter of academic sophistry  it causes avoidable suffering, bereavement, and death.'"},{"comment_id":"10153120807760671","commenter_b":"I think it a historical landmark and therefore cannot be torn down and if its not it should be. Even in its dilapidated stated it is still beautiful and the history that building has is a part of everyone who grew up on this area. #SAVETHEHOTELMARYSVILLE!!!","commenter_a":"Make it a church","post_message":"What should happen to this hotel?"}]
