[{"comment_id":"1723416237718117","commenter_b":"In my book, Angela Merkel will go down as one of the greatest people to have walked the earth. She opened the door for strangers when everyone else closed theirs. There were far worse atrocities happening in Germany and Europe before the arrival of immigrants. Xenophobes that previously had no excuse for their hate are happy to see their own people killed by minority terrorists just to justify their hatred for the rest of humanity.","commenter_a":"Merkel should be tried for treason. She is directly responsible for all of the sexual assaults and murders that have taken place!","post_message":"You can ban the burka, Frau Merkel. But what are you going to do about banning the migrant boats YOU encouraged to come and which are destroying your country?"},{"comment_id":"1429289687105057","commenter_b":"I'm going to beat your ass why you do that to me sis lmao","commenter_a":"Omg sis imagine this! VVanesha Williams","post_message":"This is the incredible moment a mother gives birth to her baby son - in a groundbreaking delivery procedure."},{"comment_id":"10154003076373812","commenter_b":"Actually women STFU if you can't take the heat dont attack....he has just as much right as her","commenter_a":"When it comes to women, Donald should just STFU.","post_message":"Donald Trump ramps up his attacks against Hillary Clinton and former Pres. Bill Clinton: \"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!\""},{"comment_id":"10152705151371234","commenter_b":"He has a temperament ill suited to public office.","commenter_a":"That's because he didn't bring me KandyKakes, a cheese hoagie, and soft pretzels. Serves him right, loser.","post_message":"\"I think the trip was an utter failure... It should have been a trip of 'good behavior' instead of showing a short fuse,\" said a presidential historian at Rice University of Governor Chris Christie's trip to the U.K."},{"comment_id":"10152943147236680","commenter_b":"Nowadays we have male, female and family bathrooms!!! If you can't hold it in look for a tree!!!","commenter_a":"There's a term called friendly fire...","post_message":"The senior member of the Senate Armed Services Committee opposes the plan announced last week by the Pentagon to allow transgender troops to serve in the military, saying “it wouldn’t work.”"},{"comment_id":"10155044912398010","commenter_b":"Trump doesn't want any more tunnels, after he builds his wall.","commenter_a":"Maybe it is true? Trump appointed him to head the DEA and he is going to pay for the wall??","post_message":"The Sinaloa cartel boss was recaptured a year ago after his second jailbreak."},{"comment_id":"744192892380562","commenter_b":"Jerome-- a mole? Are they all?","commenter_a":"Close the borders. With all due respect congressman, only idiots would even consider calling military age men \"refugees.\" Our borders have been poorly managed that it is impossible to tell who has infiltrated my America. Seems that Congress has chosen to remain totally mute on this issue. Obama bashing does not hide the fact that inaction equals compliance.","post_message":"It's frustrating that President Obama refuses to shift his strategy to defeat ISIS. The horrific attacks in Paris are evidence that the current strategy to defeat ISIS is not working. I discussed this earlier today on Fox Business' Varney & Co.. Watch below:"}]
