[{"comment_id":"10153574681028010","commenter_b":"To bad DHS doesn't enforce our laws...she should be returned with millions more just like her.","commenter_a":"Go back then.","post_message":"“I thought I came to this country to escape abuse, mistreatment and disrespect. But it's the same here.”"},{"comment_id":"10153135004736756","commenter_b":"Henry Gallo- happy belated birthday! You have a lot of styling still to do!","commenter_a":"Great story Joe! Thanks for sharing.","post_message":"Zoe Spawton used to waitress at a café in Berlin where she would see Ali Akdeniz walk by every morning. He caught her eye because of his put-together, plucky apparel. She was so taken by his du jour ensembles she asked to take his picture. It became a daily ritual and the photos form the blog What Ali Wore."},{"comment_id":"10154769907171509","commenter_b":"But but, the Internet thinks for us so we don't have to!","commenter_a":"People need to start doing a little research. If @username (the actor) was dead, it would be on every single news outlet. And @username's wife (Jada) is darker than Raquel (who is lighter) Sad I have to edit my comment because people are getting bent out of shape.","post_message":"Before he died, Will Smith was part of an 18-month Executive MBA program at the University of Miami. His wife, who was shot in the legs during the attack that killed her husband, received it in his honor."},{"comment_id":"10155280506710329","commenter_b":"Things real vaginas eat","commenter_a":"I read that as \"vagina\" and then saw a picture of the cupcake looking thing...didn't think twice until I read the caption again. =)","post_message":"It's tastier than you think it is."},{"comment_id":"10154569592984497","commenter_b":"@username GO FUCK YOUR MOTHER","commenter_a":"Mom really in love with new fat penis-shaped exotic veggie.","post_message":"\"Carol from book club told me about it and sent me a recipe to cook it in a skillet.\""},{"comment_id":"10153222292274877","commenter_b":"She is a woman. End of story.","commenter_a":"Ok this is the dumbest post I've seen by you guys. Trans woman? correct yourself its a trans man and will never be a woman.","post_message":"Body of 25-year-old trans woman found beaten to death in park. She was studying to be a cosmetologist. Get the full details of what happened below. Grio fam, let's keep the victim's family in our thoughts/prayers."},{"comment_id":"10154387073057894","commenter_b":"Bitch she would get demoted hard !","commenter_a":"Good! Let Honda go, she has no relevance on the show! @username","post_message":"NeNe Leakes and Kim Zolciak-Biermann in Talks for a FULL-TIME Return to 'The Real Housewives of Atlanta' for Season 10"}]
