[{"comment_id":"972010302845037","commenter_b":"Sick evil hag","commenter_a":"Someone should MOUNT HER, OR STUFF HER","post_message":"Why one big game hunter is NOT backing down: @webpagelink #CecilTheLion"},{"comment_id":"10153961148192869","commenter_b":"such a vile, vile woman.","commenter_a":"I don't understand how any woman that has a daughter could vote for Hillary Clinton, sorry she is the poorest excuse for a champion of women and children that I have ever seen.","post_message":"In the war of the Presidential candidates, Donald Trump has taken some heat for his over-the-top characterizations of Hillary Clinton. Admittedly, this is the first campaign in my memory in which one candidate actually called the other a “monster.” But one woman who finds Hillary’s behavior truly monstrous has finally put her name and face behind that charge. This required courage, not just because it goes against the Clintons --- that’s always a scary thing to do --- but also because it relates to the fact that she was raped at age 12 and Hillary defended the man who raped her. The man pleaded guilty to a lesser charge and spent just a few months in jail. This was early in Hillary’s career, in Arkansas, in her one big courtroom trial. (The defendant had reportedly requested a female lawyer.) Certainly every defendant has the Constitutional right to a legal defense, ..."},{"comment_id":"10153605782047522","commenter_b":"@username THE MORALS OF THE DEMOCRATIC PARTY AND IT'S FOLLOWERS HAVE RESORTED TO THE MOST LOWLY TO SPEAK IN PUBLIC...LENA DUNHAM SPOKE AT DNC CONVENTION. SHE ALSO WROTE A BOOK AND HEREIN IS A PASSAGE...NASTY...NASTY...GIRL...In the book, Lena Dunham describes an incident during her childhood in which she leaned down between her sister legs and spread open her vagina, saying the behavior did not alarm her mother and was the spectrum of things I did. At another point, she writes that she would try to bribe her sister with candy for a kiss on the lips, joking that a sexual predator might do to woo a small suburban girl I was trying.","commenter_a":"Not surprised. The media has been so bias lately, Clinton doesnt even need the DNC. She has the press. The hatred for this man by the media is astounding. The globalist and globalism will do anything, say anything, to remain in power.","post_message":"The latest in the polls:"},{"comment_id":"10154742351861336","commenter_b":"Insane b.s. But Hillary is a free woman. Wtf","commenter_a":"When I went to vote in the primaries, there were people wearing Hillary shirts and they had signs and were giving out stickers. Oh I guess it's OK for Democrats. :/","post_message":"A Donald J. Trump voter in Texas was arrested Monday for wearing a T-shirt to the polls that mocked Hillary Clinton’s infamous comment in which she said half of Trump supporters were “a basket of deplorables.”"},{"comment_id":"548865588651254","commenter_b":"How touching❤️","commenter_a":"Love this and will remember when choosing between Home Depot and Lowes!","post_message":"This disabled vet was having trouble finding a job because of his service dog — so Lowe's hired them both."},{"comment_id":"549044465305156","commenter_b":"You mean illegals who want free shit? Trump 2016 Killary Corrupt and OSUCKO Shitbag for Prison 2016","commenter_a":"To all the Hispanic and women out there, we all need to VOTE!!! Our vote has to be the one that makes the difference of who will be our new President Mrs. Clinton.. lets all make sure that we the piggy, uglys fat black and hispanic show Mr. Trump that we where the ones we the power for him not to be our new President, trust me he will always remember us women.","post_message":"This is Alicia Machado, the former Miss Universe who Trump bullied and harassed, calling her an \"ugly\" \"Miss Piggy\" and \"Miss Housekeeping\" -- just because she is Latina. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153483045518812","commenter_b":"She just wanted to be a hoe","commenter_a":"Is she right or is she wrong? If the male students have some privileges, so should the female students.","post_message":"High school graduate, who says she was penalized for what she said teachers and administrators described as “distracting” clothes, uses yearbook quote to strike back at school dress code: @webpagelink"}]
