[{"comment_id":"10156401528845725","commenter_b":"@username pretty sure thats illegal and unenforcible","commenter_a":"I support you from India, they are welcoming muslims while one of muslim countries Brunei just banned Christmas..not to mention all most all muslim countries have banned isrealis and most of them hate america after jews..","post_message":"Thank you Franklin Graham! I have always appreciated your courage, but now more so than ever!"},{"comment_id":"10154130033413797","commenter_b":"so she should keep her legs together","commenter_a":"you have a brain tumor and you are suing bc you want your tubes. out.. are you sure you are just not brain dead?","post_message":"A woman suffering from a brain tumor is threatening legal action against a Catholic health system because the hospital is allegedly refusing to tie her fallopian tubes based on religious belief. The procedure could be life saving for the woman..."},{"comment_id":"896237380506542","commenter_b":"Guess what all you fools there are just as many women that talk a hell of a lot worst then Trump dreamed of all you holier-than-thou women out there quit acting like Polly pure bread get a grip. What's worse is that all that comes out of Killarrys mouth is diarrhea 💩💩💩😈😈😈😈","commenter_a":"If Hillary & Supporters are so butthurt over something Trump said 11 yrs ago, then why would Clinton accept endorsements from \"Rappers\" who had said FAR Worse things about Women then Donald said in Private 11 yrs ago? Some of the Vile things said by these Musicians is so demeaning to Women but yet Clinton doesn't reject their Support?? Nor does Her Supporters?? Calling the Kettle black!!! Copied","post_message":"“It’s the kind of locker room and frat house talk that personally infuriates me. But guess what? I still, without a doubt, support [Donald J. Trump].\"  Watch Judge Jeanine Pirro's full opening statement."},{"comment_id":"866625743399544","commenter_b":"Shut up you dumb f*** spread your poison somewhere else","commenter_a":"Ever wonder why it is that for two millenia Christians and then Moslems have pillaged, raped and murdered millions of people in the name of God? Ever wondered why Christians and Moslems, both claiming to own the truth, have no qualms about trying to force others to believe as they do? Holiness is not spread by force, and people that attempt to do so are not holy. Jesus was not a prophet. He was a religious Jew and political activist who was against Roman rule and the political establishment that existed in Judea. Years later his followers rewrote history and invented a religion. Christianity is not divine and it is therefore falsehood. Mohammed was not a prophet. He attempted to gain a following among the Jews, but when he failed he became violent. Mohammed, like his followers, was a murderer, a thief and apparently psycholigically impaired. Islam is not divine ...","post_message":"ISLAMO-REALISM: ISIS Defends Burning Jordanian Pilot: Mohammed Burned People Alive, We  The Footsteps Of Allah Messenger  @webpagelink"},{"comment_id":"10155268022544411","commenter_b":"What a stupid bitch","commenter_a":"China honestly USA and South Korea will do for their security what they will - your threats are useless because guess what your citizens have had exposure to west and they will fight against you to keep their freedoms- your on the downward spiral of communism!!","post_message":"Beijing 'will definitely take necessary measures to safeguard its security interests'"},{"comment_id":"610661985768228","commenter_b":"white kids of lower middle class know what it is like to be in those areas of transformation and watch their towns become unsafe ghetto's. These immigrants always come forcefully in the streets to establish turf and whites have dealt with it from every race that comes in. don't know ghetto's eh, some of us know and were forged in them. what an ill guided statement to make","commenter_a":"Love the positive comments here, and even if theres negative comments bernie will always have a great comeback as he did in the debate last night. This man deserves the title of president. So much can come from this stop thinking about it & vote for him","post_message":"I am very proud of being Jewish, and that is an essential part of who I am as a human being. My father’s family was wiped out by Hitler in the Holocaust. I know about what crazy and radical, and extremist politics mean. I learned that lesson as a tiny, tiny child when my mother would take me shopping, and we would see people working in stores who had numbers on their arms because they were in Hitler’s concentration camp."},{"comment_id":"10152892453289342","commenter_b":"Texans have had a better record than the cowgirls since they became a team up until the last 2 yrs.","commenter_a":"Come over to a winning team THE DALLAS COWBOYS!!!","post_message":"The greatest offensive player to ever wear a Texans uniform will play somewhere else next season.  The team has reportedly freed Andre Johnson up to pursue other options"}]
