[{"comment_id":"484838455040068","commenter_b":"Yes, ban Sharia Law in the USA","commenter_a":"I hope tsa patted her down throughly to make sure she wasn't carry bombs, I think the whole thing is a set up!","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake. Shariah Law is dangerous, we support the patriots that stand against it. Should Shariah be banned in all 50 states?"},{"comment_id":"10153135004736756","commenter_b":"Henry Gallo- happy belated birthday! You have a lot of styling still to do!","commenter_a":"Great story Joe! Thanks for sharing.","post_message":"Zoe Spawton used to waitress at a café in Berlin where she would see Ali Akdeniz walk by every morning. He caught her eye because of his put-together, plucky apparel. She was so taken by his du jour ensembles she asked to take his picture. It became a daily ritual and the photos form the blog What Ali Wore."},{"comment_id":"995099337179781","commenter_b":"Crazy dumb old witch.","commenter_a":"I think democrats are more like terrorist. Terrorist maim and tear people's bodies apart. Democrats do the same thing to unborn babies by allowing Planned Parenthood to Harvest baby body parts. As far as I know no terrorist organization sells body parts. Guess that makes Democrats and Hillary Clinton worse than terrorist.","post_message":"BREAKING: Hillary Clinton says GOP candidates are like terrorists because they're...pro-life?"},{"comment_id":"1275116595847182","commenter_b":"@username You pathetic asswipe.","commenter_a":"Look at the number of blacks commiting crimes and try to tell me the only reason it's so obviously more blacks than whites is because of racism.","post_message":"Only White skin deserves justice?"},{"comment_id":"10152699029652377","commenter_b":"Idiot comment of the day","commenter_a":"Top reason. He is not Obama!","post_message":"Marco Rubio for President 2016?"},{"comment_id":"10152813699938145","commenter_b":"R u ok, smiling with a chainsaw in your hand.","commenter_a":"I know this guy. He's out of his mind","post_message":"Daytona Beach police are hoping you share this picture. They're looking for Allen Phillip Fike. They say he may be armed with an AK-47 and has threatened to kill officers if they approach. Fike is wanted on several outstanding warrants. He could be driving a white Toyota Camry."},{"comment_id":"547324122108733","commenter_b":"Hearing her, and the rest of these contemporary crashing bores, causes me macroaggressions","commenter_a":"This nation no longer understands the cause of anything. We have managed to create a group of retards who are only concerned with their own personal agenda, while at the same time, they have abandoned common sense and common decency...","post_message":"\"One day, these privileged snowflakes armed with their microaggressions will be in charge of HR departments all across the fruited plain,\" says Todd Starnes."}]
