[{"comment_id":"10155858979227619","commenter_b":"She should stick to singing and acting. That's her expertise. She's no great brain and what she opines about politics is meaningless.","commenter_a":"I dont care what either one of them think or do.","post_message":"Streisand said in an interview that Trump's actions are \"so beneath the dignity of the presidency, let alone any respectful person.\""},{"comment_id":"1076328745721469","commenter_b":"I got bafar as well","commenter_a":"Woooow @username","post_message":"This is really, really weird. Check out the explanation here: bit.ly/1bRZ7nn Via by AsapSCIENCE."},{"comment_id":"10153208409382093","commenter_b":"She asleep in the kitchen ?","commenter_a":"So just because you invite someone over that person has the right to have sex with you? No means no! And even if she was too drunk to say no, if she never say yes, then it is a freaking no! I didn't know that just because you let someone in your house you're automatically saying \"you can come in my house and rape me :)\"","post_message":"The victim said she woke up to find the suspect forcing himself on her.... so she fought back with what she could find... @webpagelink"},{"comment_id":"10153208171456167","commenter_b":"A Ass is a Ass .","commenter_a":"We should promote his show on our facebook....","post_message":"Warning: These are some truly disturbing and vile remarks."},{"comment_id":"10152594286750779","commenter_b":"I hope she never gets a boob job","commenter_a":"Did she trademark small breasts as well?","post_message":"If you want to \"Party Like It's 1989\" to \"This Sick Beat,\" you better ask Taylor Swift's permission first. The pop star has trademarked those phrases – along with \"'Cause We Never Go Out of Style,\" \"Could Show You Incredible Things\" and \"Nice to Meet You, Where You Been?\" – with the U.S. government."},{"comment_id":"10155605832169657","commenter_b":"Lock her up","commenter_a":"When you see it written out like this, it is nothing short of stunning. Clinton emails. Trump admitting sexual assault. Clinton emails. Trump charity fraud. Clinton emails. Trump calls for nuclear proliferation. Clinton emails. Trump calls for national stop and frisk. Clinton emails. Trump violates trade embargo with Cuba. Clinton emails. Trump sued over Trump U fraud. Clinton emails. Trump bribes DA. Clinton emails. Trump doesn't pay taxes for 20 years. Clinton emails. Trump employs campaign manager involved in illegal corruption with Russia. Clinton emails. Trump calls for ban of an entire religion from entering US. Clinton emails. Trump lied about support for Iraq War over and over in debate. Clinton emails. Trump in court for rape of a minor. Clinton emails. Trump unaware of Russia's Crimea occupation. Clinton emails. Trump unaware of situation in Syria. Clinton emails. Trump penalized for racist housing discrimination. Clinton emails. Trump files for bankruptcy ...","post_message":"Hillary wants you to believe that there's nothing to see."},{"comment_id":"10153503664933132","commenter_b":"Kourtney hasn't helped things along with Scott. If she thinks enough of him to be with him unless he's a horrible snored and she can't get any sleep her place is in bed with her husband! I love kourtney the most but I think shes too controlling. Scott is using his parents death as an excuse for anything he does wrong and that's not right either. But in my opinion Scott is gorgeous!","commenter_a":"They do make cute kids","post_message":"Cute alert!"}]
