[{"comment_id":"10155007854069170","commenter_b":"Suck it up and move on lady","commenter_a":"this occurs when they go off their medication","post_message":"Enjoy this video. Watch it repeatedly. Savor it like a fine wine..."},{"comment_id":"1022617317773941","commenter_b":"Is the virus an illegal alien?","commenter_a":"Where's you sense of urgency to find and deport illegal alien fellons!","post_message":"Unlike Congress, Zika infected mosquitoes aren’t going to be on recess next week – they’ll be working. The emerging Zika virus poses a serious threat to our public health, and members of Congress should not leave for recess without passing President Obama's emergency funding to fight this virus."},{"comment_id":"1844880965799014","commenter_b":"Despicable, she has done this before....","commenter_a":"How long have these two been doing that kind of stuff? Looks kind of brazen to me! If that were my property, it would have been a totally different outcome.","post_message":"Totally. Busted. Sure, they're caught red-handed, but just wait until you see how they respond..."},{"comment_id":"10153969905469575","commenter_b":"Translation ?","commenter_a":"The bus should not pass that test bc there was something wrong if bus driver try back out but it's still jump forward an hit students an a frav principal an it's be proof on wthr new long time ago when they was look why bus have problems pass the test!","post_message":"In their inspection last night, police found nothing mechanically wrong with the bus involved in the fatal crash at Amy Beverland Elementary School.  Police are still awaiting the toxicology results from the mandatory blood draw, but the bus driver showed no signs of impairment."},{"comment_id":"885760648126024","commenter_b":"Such a wonderful hero to me. He's human, makes mistakes and humbly admits it. That takes a real man. Thank you, \" W\".","commenter_a":"he is a moran.","post_message":"So funny, and 100% class..."},{"comment_id":"1013388188713944","commenter_b":"All the illegals !!!","commenter_a":"All this happen cause of sin of Obama take our flight mh370 and keeping our passanger","post_message":"Will the blue helmets arrive to relocate tens of millions of Americans?"},{"comment_id":"10152956045287093","commenter_b":"Don't leave the drawers open","commenter_a":"@username pretty sure this is my dresser lol","post_message":"RECALL ~ IKEA is recalling 27 million adult & children’s dressers because of a tipping hazard…2 toddlers were killed when their dressers tipped over on them… @webpagelink"}]
