[{"comment_id":"10153842971535950","commenter_b":"Mary, please remove yourself from the gene pool. Don't reproduce.","commenter_a":"Many western people feel targeted and afraid of muslims. You never know what they have underneath all that crap they have on. Why don't they go back to Muslims countries?! If they can't adapt them should not migrate.","post_message":"In Nice, a city with the ban, police can fine any woman wearing a burkini -- or force her to disrobe."},{"comment_id":"10152579324632093","commenter_b":"especially coming from a girl who's spent plenty of time barefoot in the kitchen pregnant...","commenter_a":"That's what makes Texas so awesome.... everyone here knows their place..","post_message":"Same topic... different take. A man claims a bakery discriminated against his religious beliefs by refusing to make an anti-gay cake. @webpagelink"},{"comment_id":"10153809969273984","commenter_b":"Keep the apology. Fire her.","commenter_a":"Professors are the most ignorant people out there","post_message":"Unbelievable. The left is always calling conservatives bigots, meanwhile they're saying things like this? Should this professor apologize?"},{"comment_id":"719541998236378","commenter_b":"Happy birthday keesh!!!? Love you and am so proud of all of you Guy's","commenter_a":"40,000 likes, is that going to help?","post_message":"Putin is firing on all fronts after news of a Russian plane being shot down. Russia is doing good work. Can we get 40,000 ‘LIKES’ for Putin bombing Syria?"},{"comment_id":"587167334791713","commenter_b":"Stand with her point of view, and share her perceptions with your friends! @webpagelink","commenter_a":"I am with hillary","post_message":"One candidate delivers catchy lines—the other delivers results. Add your name to say you're with Hillary. #DemDebate"},{"comment_id":"10153052525021748","commenter_b":"Does she know how many Muslims Obama kills every day?","commenter_a":"She's really losing it.","post_message":"\"Muslims would like to take over the world and establish their caliphate, and Obama has let so many Muslims in.\""},{"comment_id":"10155131365895231","commenter_b":"Girl preach!","commenter_a":"She will go when He calls her Home...we've all been on Life Support from our Day 1...","post_message":"Prayers for the Houston/Brown family: Bobbi Kristina will reportedly be taken off life support on Feb. 11th to allow her to pass on the same day as Whitney Houston."}]
