[{"comment_id":"880698808638574","commenter_b":"Bilble is all about sex","commenter_a":"This is done in public? Wonder what goes on in private.. But Wait! Do we not hear of the domestic violence in this country also. Christian , Jewish, Hindu as well? Religion is not true religion if it practices such violence.","post_message":"A Saudi female victim of a gang-rape is sentenced to 200 lashes and six months in jail More details: @webpagelink"},{"comment_id":"1385974011422625","commenter_b":"Yet Hillary and bill take in millions in her fraudulent Clinton foundation. They take millions from foreign governments and in return she grants them government cobtracts","commenter_a":"Of course not.","post_message":"Donald J. Trump likely won't reveal how much money he makes, or how much he pays in taxes until after the election."},{"comment_id":"10153179541492014","commenter_b":"Who cares? She's giving a great Christmas! Good for her!!!!! People need to butt out and mind their own business!!!","commenter_a":"What's the problem? It's her money she works for her family.","post_message":"Sound Off: Is this a great Christmas or way too much?"},{"comment_id":"10153253183992690","commenter_b":"Hispanic Race Mexican Race Human Race Everyone is a Race!","commenter_a":"I do not hate Mexicans! So get that straight! Illegal alien does not necessarily mean \"Mexican\"! Seriously????","post_message":"A former Texas DPS employee at the Irving office is sentenced Thursday for selling driver's licenses to dozens of unauthorized immigrants. @webpagelink"},{"comment_id":"1068900079796837","commenter_b":"Right on..","commenter_a":"Guitar picks of course, a pick pocket!","post_message":"Who knew? (via HuffPost Canada Style)"},{"comment_id":"525718480886525","commenter_b":"Go home angelia you're drunk","commenter_a":"Yesterday 100 innocent dead in Lebanon Attack, 500 innocent dead in Palestine, 200 Dead In Yemen, last year 400,000 dead in Syria, 5 years ago 1.5 million dead in iraq, Yet No one Says Word , The world Stands silent. And In Paris Attack Today 150 Dead And World Goes Crazy . Obama's statement after attacks in Paris: \"This is an attack not just on Paris...this is an attack on all of humanity\" Mr . Obama Wake up Humanity Has Been Getting Attacked and it dead long time ago. R.I.P To All those innocents Who Died In Paris Attack Today, and R.I.P To All Those innocent lives Who were never Mentioned In The Attacks , and Still Being Killed and not Being Mentioned .","post_message":"Our worst fears have been confirmed. #ParisAttacks The Free Thought Project.com (y)"},{"comment_id":"10153885650817061","commenter_b":"@username , please take the tin foils off. For Benghazi, blame the Republicans. All of what you are saying about HC is all conspiracy based. EVERY investigation ha cleared her of wrongdoings. She is not perfect, but far better than that lying rapist BIGOT woman hater thief (ask the thousands of people he stiffed out of their money) IDIOT DT.","commenter_a":"Oh...don't mention Indiana! We are not proud that we have idiots voting for him!","post_message":"Sign of the times: Donald J. Trump supporter from Indiana says he's gone to great lengths to protect his yard sign with the candidate's name on it. So far, he says, \"I'm 2 and 0.\""}]
