[{"comment_id":"10156625299625354","commenter_b":"Give that girl a cigar!","commenter_a":"Oh, look everyone! It's another one of Obama's useful white idiots. She's never held a job in the real world. She's one of those who teaches, because she cannot do, and that's a trend that needs to come to a screeching halt worldwide. Meanwhile, the Muslim in Chief can use the foul mouthed, petulant child to help further his agenda of U.S. Islamization, because using dummies as incidious devices is what radical Islamists do best","post_message":"Liberal Values on grand display..."},{"comment_id":"395997370588557","commenter_b":"all these weman want is his money and 15 minutes of fame ,,,REALLY","commenter_a":"Had to tell her name because not getting any attention.","post_message":"Do you believe Jane Doe #2, Jennifer Thompson, considering she said she took the $700 Bill Cosby reportedly gave her after this act???"},{"comment_id":"969742843072343","commenter_b":"Women shouldn't get a free pass to kill.","commenter_a":"After a speech, pro-life activist Penny Lea was approached by an old man. Weeping, he told her the following story: \"I lived in Germany during the Nazi holocaust. I considered myself a Christian. I attended church since I was a small boy. We had heard the stories of what was happening to the Jews, but like most people today in this country, we tried to distance ourselves from the reality of what was really taking place. What could anyone do to stop it? A railroad track ran behind our small church, and each Sunday morning we would hear the whistle from a distance and then the clacking of the wheels moving over the track. We became disturbed when one Sunday we noticed cries coming from the train as it passed by. We grimly realized that the train was carrying Jews. They were like cattle in those cars! Week after week ...","post_message":"Wise words from one of our Founding Fathers. Do you agree?"},{"comment_id":"10154264988769062","commenter_b":"Outta place.","commenter_a":"I hope they put trash bags in his cell.","post_message":"CORRECTION: The Harris County Sheriff's Office released a corrected mugshot of Shannon J. Miles. The mugshot displayed at the HCSO press conference was incorrect. Miles is charged with capital murder in last night's shooting death of Deputy Darren Goforth.@webpagelink"},{"comment_id":"457420381115209","commenter_b":"NO Never they Are NOT The Only Ones With Slavery in their History/Background Stop the Hate All People in JESUS NAME Ps139 Amen","commenter_a":"Hell no","post_message":"Should Blacks Be Compensated For Slavery?  Comment 'yes' or 'no'."},{"comment_id":"1879145055641043","commenter_b":"I bet her husband can't wait to their son Ben turns 18 so he can leave this psycho b****","commenter_a":"She went from 102 pound to 104 pound woman in a matter of minutes. Proves that she's full of shit and gaining.","post_message":"I bet she has at least seven cats.   -Admin Rick Birdsall"},{"comment_id":"10152526323082377","commenter_b":"Go away","commenter_a":"a gubbament BIG ENOUGH to GIVE you everything you WANT, is also BIG enough to TAKE EVERYTHING you have!! see what happens when you DONT VOTE!","post_message":"Oh Really..."}]
