[{"comment_id":"10153572381213984","commenter_b":"Real Americans care, libtards don't give a damn, want more illegals here!","commenter_a":"So sorry......","post_message":"One man whose life was forever changed the day his teenage son died at the hand of an illegal repeat offender is now embracing one 2016 candidate's message. Do you agree with what he said here?"},{"comment_id":"622739101214748","commenter_b":"Yes, what has she done in her young life to deserve a 900,000 dollar a year job? Oh ya, she works at mommy and daddy's \"foundation\", sorry, money laundering facility!","commenter_a":"Is she billys daughrer or NOT","post_message":"Multiple Choice Quiz time, kiddies! Which answer did you chose? A or B? @webpagelink"},{"comment_id":"559222970918198","commenter_b":"#WomenForTrump","commenter_a":"Wow, I worked for two presidential campaigns, also as a journalist covering campaigns and in the White House. If I had a dollar for every time I was pushed, grabbed or shoved. Campaign events are feeding frenzies, if you're a reporter covering a campaign event and you don't get pushed around a lot, literally, then you're not cut out for the job. It's par for the course! Thousands of people show up at campaign events and everyone is pushing and shoving to get a piece of the candidate and their staff has a duty to protect the candidate. I was in the White House in the Oval Office with the press pool one time and an aide or SS agent pushed me after I got too close to then Vice President Dick Cheney. It never even crossed my mind to file assault charges. If you watch the video, you can ...","post_message":"\"The culture of this campaign is – as Mr. Trump mentioned from the very beginning – it's not politically correct, and sometimes telling the truth inherently is belligerent.\" Trump campaign spokesperson Katrina Pierson defended campaign manager Corey Lewandowski, saying the incident \"is a '#NeverTrump' idea.\""},{"comment_id":"10154683791611002","commenter_b":"Gross. She needs to be locked up and throw away the key","commenter_a":"Lock her up and throw away the key.","post_message":"A 38-year-old Dearborn Heights woman is accused of attempting to arrange a meeting for sex with whom she thought was a man and his underage daughter."},{"comment_id":"993863733987432","commenter_b":"Shut up Meg","commenter_a":"If only this call had been made in September 2001.","post_message":"That's probably not the kind of congratulatory phone call Netanyahu wanted."},{"comment_id":"963694916975312","commenter_b":"Actually, Pro-Life is fighting for the rights of unborn females while Pro-Choice believes that unborn females have no worth. If anybody is hating women, it is those who don't mind if they are killed while still very young.","commenter_a":"go ahead and have your abortion if you want it, but one day the consequences will come back to you, there are consequences to everthing","post_message":"\"People need to know that women have abortions every day and they go on and live their lives”"},{"comment_id":"10154542525666051","commenter_b":"So we get rid of all the illegals and we pay $5.00 for a head of lettuce cause who is going to do all this work?","commenter_a":"Sneaking into our country is explicitly illegal. Why is Mexico allowed to have a wall on its southern border with strictly enforced immigration laws but America isnt? What would happen to 100% of Americans caught illegally entering","post_message":"The Trump Administration's latest deportation plan is explicitly illegal under international law. Here are the details:"}]
