[{"comment_id":"10153222476276323","commenter_b":"Breasts are breasts. get over it.","commenter_a":"The fact that womens nipples are considered porn and men's not, given the fact that ours are literally NEEDED as a vital source of nutrients for children is a notion that needs to be challenged. How can something that provides the best source of nutrients for a baby be considered too obscene to be observed in public where as men's which are just another body part be considered fine?! Free the nipple doesn't require a woman to bear all. I won't be, I've had no reason either functionally or otherwise to display mine in public (it's a bit cold in this part of the world) but my body is not obscene. I totally support the women doing this. If nipples are so provocative it's the sexualisation that society places on women not the female nipple owners that are the problem.","post_message":"'It has to be said that, to the casual observer, the #FreeTheNipple campaign is a very confusing thing. Let’s just get this straight, one might say, it’s a feminist movement that encourages toplessness, and which has led to an Icelandic MP, respected as a serious parliamentarian, getting her boobs out for everyone to see. And you’re telling me this is one in the eye for the patriarchy?'"},{"comment_id":"1057065101012919","commenter_b":"Those camps are for the Ameriicans. The illegals are going to be slaves & the muslims will be living in your house.","commenter_a":"Not nearly enough room for all the democrats,liberals,communists ,illegals .ect....afterwe start to round them up.","post_message":"The 800 FEMA camps across the U.S. can only hold 16 million..."},{"comment_id":"10153939704691178","commenter_b":"With this huge influx of illegals and radicals the REAL AMERICANS are in danger of extinction , wise up Hollywood!","commenter_a":"Must have fallen fron his star ship and landed on his head.","post_message":"Kind of hypocritical coming from a guy who owns tons of planes."},{"comment_id":"894010200634440","commenter_b":"I'll call him a she once he's a female according to the dictionary.","commenter_a":"Caitlyn Jenner's award acceptance speech. Uplifting, heartfelt, inspiring... Courage, intelligence, compassion, awareness, education... Caitlyn pointed out many of the crucial life and death issues facing trans folks nationally and globally. She made an impassioned plea for acceptance and respect for all of humanity and the trans community in particular. For such a new figure in the global trans community, she did an excellent job at getting the truth across. Her speech had me in tears early on and particularly when she addressed her family and her mom. Something additional: twenty percent of transgender people have served in the military, which is double the percentage of the U.S. general population that has served. Close to 16,000 trans folks are currently serving in the U.S. military. Close to 135,000 trans Veterans have served.","post_message":"'Oh you know, just in the kitchen by myself crying because of Caitlyn Jenner's ESPYs speech.'"},{"comment_id":"1425446234154201","commenter_b":"That chick Greenville Reece is crazy","commenter_a":"Is an idiotic argument when people say that the world is flat take some Physics classes in college and you will actually do experiments to look at this phenomena. Don't educate yourself off YouTube actually read some Physics books, even physics 201 and 202 in college will answer this a question.","post_message":"Kyrie Irving got defensive when a reporter asked him about his recent comments on the idea of the Earth being flat."},{"comment_id":"10153939365405329","commenter_b":"Las lamparas y el cosito para escurrir los cubiertos <3","commenter_a":"Invente o si te gustan los elefantes @username","post_message":"Because elephants are beautiful and lovely and perfect. (via BuzzFeed Animals)"},{"comment_id":"706998779490700","commenter_b":"I'll help her pack!!! Don't let the door hit your big fat ass on the way out!!!!","commenter_a":"She is as big a piece of shit as her husband","post_message":"Michelle Obama was caught bad mouthing America in this newly surfaced video. If she doesn't like America, she can leave. Would you be happy if Michelle was gone?"}]
