[{"comment_id":"774995235932418","commenter_b":"^Oh Lord, the grammar/spelling in that last response. Anyway,saw photos, she's white but husband and kids arent, for those who care one way or another.","commenter_a":"Why doesn't the headline read white officer killed by a person of color?","post_message":"A very sad story."},{"comment_id":"10154038574341337","commenter_b":"Fuck, fuck, fuck a duck Screw a kangaroo Sixty-nine a porcupine And hope he blows you too....","commenter_a":"South Park did it best. See: Mystery of the Urinal Deuce","post_message":"MURDERED BY OBAMA? These Antonin Scalia conspiracy theories are insane..."},{"comment_id":"718460845008873","commenter_b":"never happen... if they couldn't massage their egos with those little golden idols... their would dry up and blow away.... or perhaps blow each other (y)","commenter_a":"Oscar - a trophy given by actors to actors for being actors. Like it makes the world a better place - NOT.","post_message":"Hollywood SCUMBAGS Might CANCEL the Oscars to Protest Trump"},{"comment_id":"1003834523018162","commenter_b":"Fuck her she hates white's. She only hires blacks.","commenter_a":"she had made millions off the white people and i do mean millions.let her take some money and give it to street people or vets which i doubt she will she would only let them starve!!!!opra disappoints me as i thought she wouild be the last person to say something like that!!!!!!","post_message":"Oprah Claims White People Are The Cause Of Racism In America.  What a hypocrite, she is the racist.  Do you think Oprah is bigot?"},{"comment_id":"10153232684759030","commenter_b":"\"Run, bitch! RUN FOR YA LIFE! GET SOME HELP!\"","commenter_a":"Kristian Pollard Elisha Lloyd","post_message":"#ThrowbackThursday to Wayne Brady using the ATM on Chappelle's Show. #TBT"},{"comment_id":"1213204015381722","commenter_b":"Trash talk was and currently still is part LJ personality. Nice try though . Gotcha bitch","commenter_a":"STICK TO BASKETBALL.","post_message":"LeBron is leaving no room for interpretation here."},{"comment_id":"10155080239376037","commenter_b":"Wow, just wow! How much tin foil DO you go through a week???","commenter_a":"Being \"sold to us\" as home Terrorist attack.... Each minute the MSM spews more misinformation pushing their Naritive. My guess , MK Ultra mind control at work...., , distraction? Agenda? To be determined. ?..","post_message":"Suspect Esteban Santiago, who was carrying a military ID, allegedly opened fire, killing at least five people before being taken into custody."}]
