[{"comment_id":"1153087074711321","commenter_b":"we need more sex workers to solve crimes the cops can't","commenter_a":"They should give her an award. She has saved countless lives.","post_message":"Police found what they described as a 'kill kit' in the trunk of Falls' car — including handcuffs, several long knives, a box cutter, two axes, a machete, a sledgehammer, a bulletproof vest, another gun, shovels, a rubber tub large enough to hold an adult, and bleach and other cleaning supplies."},{"comment_id":"363657737155854","commenter_b":"She needs to die","commenter_a":"Don't watch her either to me she is just stiring up trouble","post_message":"Is Oprah a race-baiter?"},{"comment_id":"10153638768074062","commenter_b":"And take your bimbo wife with you!","commenter_a":"Kanye, please listen to the voices in your head and leave the country!","post_message":"Kanye West opens up about rushing the stage during Beck's acceptance speech at the Grammys.   He says the voices in his head told him to do it.  He's also now calling Beck one of the nicest and most respected people in the industry.  Check out what else Kanye had to say and let us know... Is this really just too little, too late? @webpagelink"},{"comment_id":"10154432896669342","commenter_b":"The first 2 females that get drafted if there is one better be his kids.","commenter_a":"What they need to do is send all the government babies to serve leave the women alone","post_message":"The timing of Obama's support for women registering for the draft makes it mostly symbolic, but where do you stand on the issue?"},{"comment_id":"10154350184251336","commenter_b":"She won the nomination because of Super delegates like Nancy Pelosi. Should have done in on pledged delegates only. The AP announcing her win the day before the final primaries didn't help, but that was her plan all along. How many Sanders supporters stayed home and didn't vote because of that well planned news flash. This woman will do ANYTHING to get her way. God help us all if this Country elects her as President.","commenter_a":"Killary is done and she knows it!!!","post_message":"“The stakes in this election are high, and the choice is clear. Donald J. Trump is temperamentally unfit to be president and commander-in-chief.”  Hillary Clinton took shots at Trump during her victory speech after clinching the Democratic nomination."},{"comment_id":"10153024604841037","commenter_b":"Black people should pay more TAX","commenter_a":"Poor Bill, women coming from everywhere trying to get a payout. I believe you Bill.","post_message":"A model who claims #BillCosby assaulted her at the Playboy Mansion met to pursue criminal charges"},{"comment_id":"1602106276760398","commenter_b":"Yeah well Thats all she does. Thats why she'll never be president.","commenter_a":"Donald J. Trump, Gary Johnson & Hillary Clinton's position on #StandingRock is clear: they ALL support Wall Street's attempts to rape & plunder the natural world (and us) to death. The ONLY candidate who TRULY supports clean energy & kids health is @username. #InvestYourVote #NoDAPL #SilenceIsConsent!","post_message":"My running mate, Ajamu Baraka, and I stood in September with #NoDAPL water protectors at Sacred Stone Camp in North Dakota, where the Dakota Access pipeline is being built in violation of a 19th-century U.S. treaty with the Standing Rock Sioux.  The desecration of sacred land and the 500-year violence against indigenous people must end if we are ever to see a just society that works for all of us, not just the 1 percent.  jill2016.com/standingwithstandingrock"}]
