[{"comment_id":"10153762472156337","commenter_b":"Id smash her tuppence!!!","commenter_a":"Whatev","post_message":"HOW MUCH???"},{"comment_id":"648946631962582","commenter_b":"NO. This will never happen to me.","commenter_a":"No","post_message":"Every single American is to be microchipped within the next year.  This is a violation of our rights.  Will you let them do this to you?"},{"comment_id":"1248098948547994","commenter_b":"When does he go back to court for fraud? Trump is no better than Hilary, they're both dirty.","commenter_a":"Oh come on Donald. Your shocked a rich, privileged, well connected, manipulative say whatever you want to hear white women got away with a crime. You should have seen this coming. Bill helped her out big time, guess we all have a price ...right Loretta?","post_message":"'We have a rigged system, folks.' Donald J. Trump addressed the FBI's Hillary Clinton   investigation while speaking in Raleigh, North Carolina. @webpagelink"},{"comment_id":"10158086481670389","commenter_b":"Good! She needed ti be fired!","commenter_a":"Glad that person was fired.","post_message":"In Case You Missed It"},{"comment_id":"10153817887769203","commenter_b":"Michelle will body slam Barry!","commenter_a":"Coming from the first female POTUS this is funny. Obummer, you can't handle your own angry wife let alone Putin....get out of the White House you effeminate jackass","post_message":"can handle a bunch of CNBC moderators at the debate. Let me tell you, if you can handle those guys, then I don think the Chinese and the Russians are going to be too worried about you."},{"comment_id":"10154241082384170","commenter_b":"'@username, I like you a lot, but how is this woman good, when we had sanctions against Iran, she was selling to them like crazy....of course she was trying to save herself and get her numbers up, but just so wrong of her....that's just another one of the many things she did, she couldn't even win the Senate seat in CA...how could she help him win the Presidency? We just all need to stick with the best....TRUMP!","commenter_a":"Uh--oh! I hope he has a portable stage and plenty of microphones. That's her specialty.","post_message":"Smart move, if it pans out."},{"comment_id":"1162468617182722","commenter_b":"The magic number is 2026, half of 4051 . Bernie gets to that number the superdelegates have to support him.","commenter_a":"Bernie could win every state from here on out and Hilary would still be leading in the polls and delegate count. ..","post_message":"Hillary Clinton's margin narrows to just 6 points over rival Bernie Sanders."}]
