[{"comment_id":"10156568887000725","commenter_b":"@username STOP dreaming about Hillary, she's bad news, and will never get elected...thief, lier, does NOT care about the American people, WAKE UP !! TRUMP, 2016...","commenter_a":"Today - One Year from Today - Donald Trump will be in his second day in the White House as POTUS and the Obamacare bill will be burning in a barrel on the south lawn.","post_message":"Donald Trump 1st Republican Presidential Candidate to Beat the Iowa Bureaucracy and Figure Out How to Easily Access Caucus Locations. #Trump2016"},{"comment_id":"10153179398831051","commenter_b":"I wouldn't make my daughter wear a sign as punishment. I would just give her a spanking.","commenter_a":"I like it!","post_message":"This is how a dad decided to punish his teenage daughter. Good idea or bad idea?"},{"comment_id":"10155463122287908","commenter_b":"They have BEEN doing this for years. My Mom (bless her soul) was very inept with her money and defaulted on her student loans. Her SS WAS garnished. 15% came out every month. Luckily she lived with me so she was OK. We calculated what she owed and what was taken from her...... tax refunds and garnishes..... she paid that loan over and above YEARS before. But, they are like the IRS they charge interest for every day, week, month and SECOND you owe them money. I told my daughter, it's better to work and pay as you go and maybe take a few years longer to get an education than EVER take a loan for it.","commenter_a":"So what has Obama and the DNC been doing about this?","post_message":"How absurd! The very rich get richer and receive giant tax breaks, while low-income seniors see their social security benefits cut to pay off decades old student debt. We should be expanding social security benefits, not punishing seniors for the \"crime\" of getting a higher education. Garnishing social security benefits to pay off student debt is a crystal clear example as to why we need fundamental changes in our national priorities. In the richest country on earth, we should make life easier for seniors, not hard"},{"comment_id":"10153199106634071","commenter_b":"Get her a group of body guards while you're at it","commenter_a":"M","post_message":"A $48.5 million diamond for a 7-year-old girl."},{"comment_id":"684886304977884","commenter_b":"I wonder the same thing when I see those clowns busting out the tricorn hats and teabags.","commenter_a":"Don't these people protesting have jobs?","post_message":"I wish there was a LOVE button on Facebook."},{"comment_id":"1052877944789070","commenter_b":"Hillary Clinton is more smarter and experienced lady rather than her opponents, she worked in government on different positions as well as in different conditions. As soon as she become President, she will require very short time to implement her plans. #Germany has Lady Chancellor, #UK has Lady PM, now it's time for #US to have Lady President. I am not against Donald Trump and also agree with his views regarding migrated people's who cause Terror activities, Hillary too must think on this issue. No one can't risk it's own people's life for other nations innocent people. In Europe, France and Germany already paying for it...","commenter_a":"Yes!!! And then you can try to explain to your child why the first \"Woman President\" is being investigated for her actions. Then you get to try to explain impeachment. And then how to dig out of the hole of \"Well I guess girls can't do the job.\" Little kids don't get politics. That is the job for adults. And if you as an adult vote for a woman who lies, cheats, and puts her privacy above the security of the nation, then you get to pay for it down the road. But you have a choice vote Jill Stein. 2016.","post_message":"\"Mommy, how come they're all boys?\""},{"comment_id":"10153434994756636","commenter_b":"I do hope she gets all the care she needs. These countries are very poor and need all the help they can get. Imagine if you lived over there and your own children where sick. This is just heartbreaking no matter what.","commenter_a":"Her immune system must be shot to pieces - I do hope they can sort out the problem and eventually cure her. She deserved the best possible care.","post_message":"Pauline Cafferkey's in hospital for a third time"}]
