[{"comment_id":"10154088875521717","commenter_b":"Omg what a pig","commenter_a":"'@username read this, what an arsehole","post_message":"The student said she has never been more terrified of being outed than when Milo Yiannopoulos berated her on stage at a college event."},{"comment_id":"10153489141693984","commenter_b":"No that bitch crazy","commenter_a":"Hope she isn't elected.....","post_message":"With what we know about Hillary's perfectly planned events, it is not too far-fetched to believe what these people are accusing her of...  Are you hoping all the Clinton controversy will force Hillary out of the race?"},{"comment_id":"1002765619855375","commenter_b":"She's not that classy oh wait well anyways lmfao whatever get off the trip people smh","commenter_a":"I think it's funny how she's trying to show 'modesty' When we've all seen her naked already. Lmao","post_message":"Social media thinks Melania is channeling Jackie O this morning. Your thoughts? @webpagelink"},{"comment_id":"10154172121273010","commenter_b":"They are moving the focus to have room to build a new ranger...","commenter_a":"This is disgusting. All respect for Ford, gone. After 2 Rangers, no more.","post_message":"It's cheaper and more profitable to make the cars in Mexico."},{"comment_id":"10153255153245329","commenter_b":"Jason Winter you must","commenter_a":"'@username eeeeee","post_message":"These dogs don't know what to do now."},{"comment_id":"10153837028166130","commenter_b":"I have a right NOT to have a gender confused individual peeing next to me ! What about MY rights as an average Joe peeing in 'comfort' like I have my entire life . Yes, peeing next to a drag queen is disturbing - no difference in my mind .","commenter_a":"For all you folks who think people just wake up and decide to become a different gender just to be a pervert - think about this: why would anyone want to put themselves through all of that ...hormones, family dynamics, ridicule from idiots, discrimination? Just for fun? Because they are some sort of sexual deviant? For all of you who say women should be women and men should be men because that's what God created...he created us all as individuals with our own thoughts and feelings - and yes, he even created those who feel trapped in the wrong body. Respect people for who they are, not where they came from, or who they become. Discrimination disgusts me.","post_message":"Yep, this pretty much says it all."},{"comment_id":"10156528431575354","commenter_b":"Screw her","commenter_a":"Boo-fucking-hoo! Lifes tough on EVERYBODY! And not everyone drives their car up on the sidewalk! Now the media will make her out to be the victim! Put her ass in prison and throw away the key!!","post_message":"Changed Name from ‘Lakeisha Holloway’ to ‘Paris Paradise Morton’…"}]
