[{"comment_id":"1202725173156591","commenter_b":"@username Seriously? Class, the next one? Give me a break. Michelle has more class in her pinky than Trump's wife has in her entire body.","commenter_a":"You would make me proud if you would return all the millions and millions of taxpayer money you spent on vacations! p.s. Your fired!","post_message":"Michelle Obama chokes up in final speech: 'Being your First Lady has been the greatest honor of my life.' @webpagelink"},{"comment_id":"10153561445142093","commenter_b":"Really lady? Liberals and Muslims want to rewrite history? @webpagelink","commenter_a":"There are already people who say the holocaust didn't happen. With today's trend of re-writing history for political correctness, it may disappear in the next 50 years!","post_message":"A WW II vet was reunited with a Holocaust survivor who he helped liberate and the incredible moment was caught on camera...@webpagelink"},{"comment_id":"10153023436556051","commenter_b":"Yep, as long as she is consenting, I couldn't care less.","commenter_a":"lol,,, BDSM. They must be on www.fetlife.com","post_message":"Mall-goers here were genuinely disturbed when they saw who this guy had on his leash."},{"comment_id":"10153624584662235","commenter_b":"Ewwwwwww, Leonard...I don;t know any self respecting lesbian that would be in the room with her much less touch it.","commenter_a":"Usually, those that \"doth protest too much\" likely have closeted feelings and are gay themselves.","post_message":"NAILED IT."},{"comment_id":"506081702885118","commenter_b":"Fuck you too. Bitch ass gringo","commenter_a":"Im mexican and even i say fuck mexico.","post_message":"\"When you're in danger, they're the last people you think to go to.\""},{"comment_id":"929005763900127","commenter_b":"Not as pathetic as your lying Hillary.","commenter_a":"Trump even takes a GOOD idea like term limits at EVERY level of elected governing and ruins it with his hate, ignorance, and by being the WORST candidate for President ever his pathetic nothingness and lack of depth daily shows how weak and what a fraud this TRUMP is. Pathetic. LISTEN LEARN THINK FEEL and VOTE smart.","post_message":"Donald J. Trump has vowed to limit House members to a 6 year term and Senators to 12 as part of his broader plan to \"drain the swamp\" and reduce the amount of influence lobbyists have in Washington.  Read more: @webpagelink"},{"comment_id":"1056647814370639","commenter_b":"Let's be honest. HE is not confused. HE is still a MALE. And absolutely a disgrace.","commenter_a":"NO, are you kidding me?","post_message":"Do you agree with MAC's decision? Yes or no?"}]
