[{"comment_id":"10154010909024916","commenter_b":"I said it first along time ago. Its better for her to be Sanders VP then Hillary's. Two women running is dicey for guy voters. Plus hillary is too conservative for Elizabeth. it wouldn't work. Just Sanders/Warren. and secret service knows they would work to protect them the same as blacks running for president.","commenter_a":"Elizabeth Warren would make a great Vice-President and the next great President after Bernie!","post_message":""},{"comment_id":"10155065453241323","commenter_b":"You still refuse to answer the question.","commenter_a":"An admirable academic for sure . But; one line in the video had me chuckling \"And then population growth will stop\". Naive to think population growth will ever stop. Deluded dreamy lefty thinking.","post_message":"\"Let me show you the world\", said Swedish academic Hans Rosling, who has died aged 68. Here he demonstrates the dynamics of population growth, child mortality and carbon dioxide emissions. The challenge for the world is to get everyone out of extreme poverty and get the richest people to use less fossil fuels, he said."},{"comment_id":"1102034899855986","commenter_b":"You all want a Muslim hater so kinda breaks out even don't you think?","commenter_a":"Fuck 'em.","post_message":"American Islamophobes are beside themselves because human rights activist Sadiq Khan was elected mayor of London."},{"comment_id":"10154471007837577","commenter_b":"They'll come here get a bunch of \"free stuff\", infest our country, infect our people, then go back to where they came from on vacation with all of the money they \"illegally\" obtained. Vile Criminals........Build that WALL!","commenter_a":"Say no to drugs TB","post_message":"Illegals With Drug-Resistant TB Allowed Into US Schools - @webpagelink/ Large amount of illegals entering US with diseases is alarming"},{"comment_id":"571789942944915","commenter_b":"Mentall illness--- the narcissist doing his thing..I only hope the damage he IS going to do is NOT catastrophic.","commenter_a":"Egomaniac?? That is being kind. He is certifiably insane. I am calling all my congressional reps on Jan 21 to demand a mental health evaluation. He is crazy.","post_message":"Trump's 'Twitter feed is remarkably bananas this morning. Something bad must be coming.'"},{"comment_id":"632506653599570","commenter_b":"Montreal did not support his effort to start a war","commenter_a":"What mosque shooting in Montreal? That never happened. You guys were pretty quick to condemn Conway for her comments about Bowling Green, yet you don't even know where the mosque shooting occurred.","post_message":"We couldn't agree more. Image by Occupy Democrats, LIKE our page for more."},{"comment_id":"10152814040437293","commenter_b":"Especially among Liberals.","commenter_a":"It's not a surprise that Fox 'Faux' news should top the polls as the most trusted because most people (sheeples) are obviously dumb because common sense isn't in fact that common.","post_message":"Even among independents."}]
