[{"comment_id":"10152816607284877","commenter_b":"Girl you better zoom in! Boom","commenter_a":"Yet not a word about the lady in black. They can all kick rocks!","post_message":"Oh boy, they're coming for Michelle Obama for not wearing a headscarf in Saudi Arabia. Read more about her critics below. Grio fam, this seems foul to us. What do you think?"},{"comment_id":"10152765716636028","commenter_b":"What an effen B-tch I see why he cheated on her weird @$$","commenter_a":".","post_message":"\"That's what you get for cheating on me,\" said a woman who allegedly lured her ex to a drug house where a group of men robbed him at gunpoint, according to a judge. @webpagelink"},{"comment_id":"1239053882772316","commenter_b":"@username They are ALL connected. Mcain, Obama, Hellary, Bush. If you think it is the \"other party\" that is bad, then they have been successful at controling your mind. The Dem/Rep thin is a HOAX!! Stop blaming obama. He is terrible, but he is just a puppet! Cut the strings of the puppet masters. vote for the guy they hate! Trump!","commenter_a":"As did the decision to try to overthrow Syria by giving unlimited weapons to \"rebels\" of unknown origin.","post_message":"\"Obama's decision to pull the troops out of Iraq may have helped to create ISIS. As did the decision to disband Saddam's army. As did the decision to invade a country that had nothing to do with 9/11.\" -- Jon Stewart @webpagelink"},{"comment_id":"10154083377471433","commenter_b":"Good keep your foreign diseases in your own countries","commenter_a":"Oh you mean the country that out right said ....\"Death to America\"??? WHO CARES!!!!","post_message":"BREAKING NEWS: Iran suggests it will limit issuing visas to American tourists in retaliation for President Donald Trump's ban on refugees from Muslim-majority countries."},{"comment_id":"10152954070746336","commenter_b":"She is an idiot","commenter_a":"More hot air.","post_message":"In a speech at the The Brookings Institution on Friday, Obama's National Security Adviser Susan Rice said while ISIS is dangerous, it is not a threat of \"existential nature\" like World War II or the Cold War. @webpagelink What do you think of her comments?"},{"comment_id":"10153509891501051","commenter_b":"Oh ya.....that'll stop the criminals from getting illegal guns!","commenter_a":"AGREE all the way","post_message":"Do you agree or disagree with the majority of Americans on this?"},{"comment_id":"1334924336529627","commenter_b":"@username that's great except sometimes the child is tricked by a family friend, a coach, a counselor, etc... people that don't appear to be creeps. I'd like to help children see the signs, know what type of lies these predators tell them, and know how to get help if it's a family member or someone else. Killing the perpetrators after the fact will do nothing for the victims. Especially this little girl... she's already dead","commenter_a":"When I was young and in school we had the D.A.R.E program, trying to educate youth about drugs and help us make good decisions not to do them. We need a program now to educate our children on sexual predators, how to watch out for them, to be aware of how they manipulate, etc and where they can call for help and a safe harbor. I would happily volunteer to speak at any school. We need to protect these children and let them know they are not alone and that where someone may have failed them, we will not.","post_message":"Awful"}]
