[{"comment_id":"497892010370754","commenter_b":"I should be arrested for the nuclear bomb I just dropped in the women's bathroom at my work. You'll never take me alive!","commenter_a":"I hope his family sues the shit outta that school so his entire future is paid for, Racists fucks","post_message":"\"Cool clock, Ahmed. Want to bring it to the White House? We should inspire more kids like you to like science. It's what makes America great.\"  - President Barack Obama"},{"comment_id":"10154249392839445","commenter_b":"date on picture is July 2008 took almost 8 years to figure out he was a fraud no wonder this country is going to SH-T","commenter_a":"Shame on him","post_message":"In his application for disability benefits, John Caltabiano claimed he couldn’t drive, cook for himself, exercise at the gym, move around his house or even shave without help."},{"comment_id":"10156401528845725","commenter_b":"@username pretty sure thats illegal and unenforcible","commenter_a":"I support you from India, they are welcoming muslims while one of muslim countries Brunei just banned Christmas..not to mention all most all muslim countries have banned isrealis and most of them hate america after jews..","post_message":"Thank you Franklin Graham! I have always appreciated your courage, but now more so than ever!"},{"comment_id":"693891444077370","commenter_b":"a lib angry bitch...","commenter_a":"First of all, she's just an angry bitch....second of all: who?","post_message":"Who does THIS Remind you of...."},{"comment_id":"10154055005061167","commenter_b":"Oh God! !!! really this happened! What a nasty Woman!","commenter_a":"Artistry, get a clue humans.","post_message":"Beyoncé and JAY Z appeared with Hillary Clinton -- and Fox News completely lost it."},{"comment_id":"10154226374872894","commenter_b":"Kim better stop bcuz money can dry up. At the rate that she is spending it.","commenter_a":"...but Andy Cohen has had work done himself so what's his point??? *sips Brandy and Eggnog*","post_message":"Andy Cohen Grills Kim Zolciak About Plastic Surgery: Sweetie, You Need to Stop (Video)"},{"comment_id":"10153833789564411","commenter_b":"Israel has been there 3000+ years as proven by archaeology. it's palestine who are the invaders. It's the SECOND palestine if you've studied history. They're Syrians and Egyptians as confessed by the PA itself. They even use the flag of Jordan.","commenter_a":"Guys Guys Guys u no one thing turkey is number one trading partner of isreal....And turkey is first country who excapt isreal as a brother Nation......And turkey is N.A.T.O mamber what N.A.T.O did in libya Afghanistan Iraq and somaliya u no batter then me......Down with Erdogan Down with Turkey...long live Palistayin","post_message":""}]
