[{"comment_id":"10153950706953132","commenter_b":"This is why people suck.. who the hell does that?? why??? WTF.. really man!!????","commenter_a":"Autumn Baker","post_message":"But it's the little boy who won the game."},{"comment_id":"10155150563786320","commenter_b":"English is patriarchal oppression Orla, please check your privilege!","commenter_a":"@username @username Bout time😂","post_message":"Hmm... Lena Dunham is crediting her recent weight loss to President Trump. (Image: AP/Fox News)"},{"comment_id":"921294477938692","commenter_b":"Damn that bitch is fugly.","commenter_a":"Rothschild , Soros, Bush, Hillary, Bill, Hubbard, Gore, Planned Parenthood all are illuminati members. Sold their Soul to Satan","post_message":"“We don’t know all of the details about this particular incident, but we do know that our national epidemic of gun violence must be addressed,” Debbie Wasserman Schultz said Saturday after 3 people were killed at a Planned Parenthood in Colorado."},{"comment_id":"10154827367754197","commenter_b":"@username your a tart.","commenter_a":"Trump's ignorance is astounding. He should stop tweeting narcissistic nonsense and start reading the security briefings. We are the laughing stock of the world now that we elected a buffoon as president. God help us.","post_message":"Donald J. Trump is very upset with the United Nations after a recent vote. Read his comments on WFSB.com and the Channel 3 app. Then, tell us your thoughts on the statements by the president-elect."},{"comment_id":"10153561426376135","commenter_b":"we know this lady is","commenter_a":"Why would I answer those stupid questions to see this story? WXYZ are you crazy?","post_message":"In 2015, in Troy, she was charged with assault and battery. She later pled to disorderly person and, two weeks ago, she was ordered to pay a $500 fine and attend anger management."},{"comment_id":"1091133320986005","commenter_b":"Hillary should be jailed as well","commenter_a":"Austin no your ignorant","post_message":"WATCH LIVE: Donald Trump on the final day of campaigning in North Carolina"},{"comment_id":"1356822761024859","commenter_b":"I agree. What a Bitch.","commenter_a":"shame all those parents whose children have been murdered by Obama can't sing to their dead children... wake up this man is a bastard","post_message":"This is the most beautiful thing you will see all week."}]
