[{"comment_id":"1033066763409083","commenter_b":"Maybe we could stop the flow of heroin coming into the U.S.","commenter_a":"To associate with Hillary Clinton, you are an EMBARRASSMENT to the residents of VA and to the military who live and serve here!! DISGUSTING!!","post_message":"I’ve seen firsthand how significant an impact the opioid and heroin abuse epidemic is having on communities and families in Virginia. More Virginians now die from these overdoses than car accidents, and law enforcement currently lacks the tools to save more lives. I’m pleased the just passed Comprehensive Addiction and Recovery Act (CARA) will encourage co-prescribing of naloxone – a life-saving drug – alongside opioid prescriptions and also implements a measure to protect the elderly from medication abuse. I worked with a bipartisan group of colleagues to draft and introduce these provisions. Lastly, while I am pleased Congress was able to work in a bipartisan way to address this crisis, we should keep working to provide emergency funding that is critically needed for state substance abuse programs, law enforcement, treatment and other priorities authorized in this bill."},{"comment_id":"10153161008224087","commenter_b":"Yvette Eva Hirsch. Where does everyone come up with this comparison? Hitler wanted to kill any non white people. If you weren't blonde haired with blue eyes you were killed. And even then if you meet that criteria and a Jew you where still killed. Trump wants to build a wall and establish a true border which should have been done long ago. He wants to have illegals leave. They are illegal after all and by the current laws shouldn't be able to work due to its illegal to employ a illegal. Notice there is no killing, no rounding up of people based on race. Mexico's constitution doesn't even allow citizens from Mexico to be given citizenship to a child born in another country citizenship in that country. This all started when everyone stopped trying to offend illegals by calling them UN documented to make it sound better. The fact ...","commenter_a":"Maybe the establishment should sign a pledge to treat him fairly, and honor the will of their base!","post_message":"Donald J. Trump said that if he signed the pledge not to run as a third-party candidate, he expects to 'go up 10 or 15 percent' in polls."},{"comment_id":"10152693166980047","commenter_b":"Get out of our lives and leave us alone you can not even run your own country leave our children alone also","commenter_a":"No way","post_message":"Schools are forcing our children to 'pretend' to be Muslim for a day?  We must stop Islamic indoctrination in our schools.   Sign and Share the petition to defend the religious liberty of our students:  @webpagelink"},{"comment_id":"709650085834839","commenter_b":"Exactly why I pointed it. Most like her, only dodge and deflect.","commenter_a":"This is not even true and amounts to propaganda plain and simple. And of course this is coming from Florida where an election was rigged. Why don't you educate your fellow man instead of scaring them and filling their tiny little minds with this ignorance; there are so many untruths in this article, number one being the use of the term 'body parts'. Since the majority of abortions are performed at the 12 week mark, these are embryos with no body parts to speak of. There are no videos that show any of this yet that is the main point of your argument. Second, fetal tissue is donated to medical research which is legal and most republicans voted it in (look up fetal tissue for medical research law) and had been, most recently, used very successfully in the treatment of Parkinson's disease. Since most conservatives don't believe in welfare, Planned ...","post_message":"I Freaking KNEW it."},{"comment_id":"1357661384272094","commenter_b":"Good, go ahead and secede, build another wall.","commenter_a":"Who the hell cares?Let them go.","post_message":"A new poll shows 1/3 or Californians want to secede from the USA over Trump  Here's EXACTLY what would happen if they got their way!"},{"comment_id":"1299379106804981","commenter_b":"Uh, she should be arrested!","commenter_a":"Sorry, but if didn't want anyone to see it, he should have put it in a folder, or face down, or taken it with him when he got up.","post_message":"You should be mortified - Post Updated *******************"},{"comment_id":"1104163209700456","commenter_b":"Is she as dumb as a rock or what ?","commenter_a":"Just take this ignorant ass in jail.... Trump!!!!!!!","post_message":"Even after being caught cheating in elections, check out Democrats' excuses."}]
