[{"comment_id":"10153238696686813","commenter_b":"'@username Oh yea you and and stupid California is a payer State... you dumb asses pay twice as much to live in pollution surrounded by painted hills of immigrants. You people have made mad bank off the backs of Immigrants, thus the reason you want more. Dumb Blonde wow, I thought that was a cliche!","commenter_a":"The people of this Country are tired of being worked into Slavery to merely exist... The continuous need to help outsiders with no regards to the effects of the US Citizens that do not need anymore competition for jobs and affordable housing is Un-Patriotic and a spit in the face to every working class American and their children and grandchildren. We are asking the Federal Government to listen to the People's request but they are blatantly ignoring and denying our request to stop this invasion. Anyone that stands for the Big Federal bully tactics should go down with them when the Civil unrest begins.... It's coming, just wait for it! There are far more Citizens on this land than the Police, Military and Government goons combined! KEEP POKING THE BEAR! NO REFUGEES OR IMMIGRANTS are Welcome here don't you get it.... Take your ass to California and mooch off the ...","post_message":"GOOD NEWS: Court denies Texas motion to block Syrian refugees, and finds Texas unlikely to win lawsuit.   “There is nothing in the law that gives the state veto power over any decision of the federal government or permits any state to discriminate against certain refugees based on their nationality, in fact the law says just the opposite,' said ACLU of Texas’ Rebecca Robertson. #refugeeswelcome #allfaithswelcome"},{"comment_id":"10153278165616336","commenter_b":"Put down the assault fork and nobody will get hurt!","commenter_a":"Ummm.. Say what fattie? You can't handle food ownership.","post_message":"'Americans do not seem to be able to handle gun ownership in a way that permits maintenance of a civil society.'"},{"comment_id":"506647236198456","commenter_b":"That will get her dinner at the White House.","commenter_a":"I want proof. Then it's not just a vague fb post...","post_message":"Beyonce Posted Letter Hours Before Dallas Shooting, Calling Blacks to  Against Police, That Murder Should Not Go   CHARGE HER WITH INCITING VIOLENCE!   Let's get 5000 SHARES if you think she should be held accountable!"},{"comment_id":"10153001751980950","commenter_b":"Sarah, please elaborate. Because you've lost me completely.","commenter_a":"Hahahhaha so crazy.... Muslims are peaceful people ..its TERRORIST who are the killers.... And if ya haven't noticed there are white people in ISIS","post_message":"The gun shop owner says he's making changes immediately to 'make America a safer place to live.'"},{"comment_id":"1769292306444953","commenter_b":"With you in that thought...sad but so true. In jail all his basic needs would be met and even medical. Sad we treat jailbirds better than the homeless.","commenter_a":"Imagine if he'd actually been trying to steal the food so he could go to jail and have a roof over his head and food in his belly. But good on the judge anyways for showing some compassion in a world that is lacking these days.","post_message":"A bit of compassion in the courts can go a long way."},{"comment_id":"452202411637006","commenter_b":"There here in the us feed them pork to hell with them if they don't want to eat pork go back where they come from keep the. Lunch day she should not of been fired that bull shit vesta","commenter_a":"pork them all!!!!!","post_message":"Lunch Lady Fired For Serving Pork To Muslim Student.  'LIKE' if this is WRONG!!!!!!"},{"comment_id":"1242790859084298","commenter_b":"She's a wife and mother. Needs to grow up, cover up, and act like a lady!","commenter_a":"Fortunately the majority of police officers are good, hard working people serving/protecting their communities. Are there a few bad ones? Of course! The media really hypes the bad police officers, the knuckle heads looting and destroying communities 'in protest'. Not highlight the wonderful police officers laying their life on the line to protect our butts. Not highlighting the people that truly feel stepped on and are peacefully coming together with all to promote positive changes. 'Be the change that you wish to see in this this world.' This is what I live by and teach my children. We should be brought together by love, not torn apart by hate.","post_message":"#EntertainmentNews  And the #BoycottBeyonce battle continues...the singer is being accused of using her recent Super Bowl performance 'to divide Americans by promoting the Black Panthers and her antipolice message.'  Do you agree?"}]
