[{"comment_id":"10154800367722293","commenter_b":"@username Human rights should always supersede law otherwise we are no better than the Muslim extremists we criticize so much (for good reason). Yes, we need to have strict immigration laws but due to our decades of non-existence of it due to the fact that we can profit from it, people shouldn't be punished and exceptions to the rule would exist. There are undocumented people who have been here all their lives, kids who know no other home than here and good tax paying people. Criminals - yes get them out. Instead of a wall use technology and more man power at the border. Create temporary work visa give. By employer, families who are working and are not a burden to the system can stay. There are better ways.","commenter_a":"\"let us all unite. Let us fight for a new world - a decent world that will give men a chance to work - that will give youth a future and old age a security. By the promise of these things, brutes have risen to power. But they lie! They do not fulfill that promise. They never will! Dictators free themselves but they enslave the people! Now let us fight to fulfill that promise! Let us fight to free the world - to do away with national barriers - to do away with greed, with hate and intolerance. Let us fight for a world of reason, a world where science and progress will lead to all men happiness. Soldiers! in the name of democracy, let us all unite!\" - Charlie Chaplin, \"The Great Dictator\" (1940).","post_message":"Trump vow of mass deportations could soon become a reality."},{"comment_id":"1702951239953812","commenter_b":"Go to hell","commenter_a":"a liar and corrupt & a socialist what a pick for dems.","post_message":"Now it’s Hillary Clinton who has taken up the “white privilege” banner. During a recent Q&A she asserted that white people need to “recognize our privilege” and “practice humility.” Do you think Hillary is totally out of touch with reality?"},{"comment_id":"10153224178386336","commenter_b":"You cannot deport american citizens out of america, it makes no sense. lol","commenter_a":"Gather them up and ship them out of the country. Anyone who doesn't respect America should leave. No one is asking them to stay.","post_message":"A new social media \"challenge\" is encouraging people across the country to disrespect and stomp on the American flag."},{"comment_id":"1163032473715499","commenter_b":"I hope Trump builds a wall 200 ft tall to keep these loosers out!!!!!!","commenter_a":"did the donald get him deported yet??","post_message":"Worker says he took a stand against Donald J. Trump and his immigration policies by hanging a Mexican flag at the Trump International Hotel in Vancouver. \"From the concrete pouring, finishing, drywall, taping, wood forming and general labour, Mexicans were there, building it.\""},{"comment_id":"10153406887426955","commenter_b":"Can't wait until someone drops a house on Hilary.","commenter_a":"I'm no detective, but my guess would be Hillary, I mean the wicked witch of the east.","post_message":"WHO STOLE DOROTHY'S SLIPPERS?"},{"comment_id":"10154392654096509","commenter_b":"Hotel California!!!!","commenter_a":"my prayers ...rest in peace","post_message":"Glenn Frey played guitar and keyboard and took lead vocal duties for the Eagles on tunes like \"Take it Easy\" and \"Tequila Sunrise.\" What's your favorite song from the band?"},{"comment_id":"10153721033369575","commenter_b":"Karen Crowder what the hell does immigrants have to do with it?!","commenter_a":"What's low gas prices have to do with bed bug's? Are they in the gas?","post_message":""}]
