[{"comment_id":"1021502754552734","commenter_b":"Sammy Rose Dunaj Emmett Lally","commenter_a":"Serge Ermakov","post_message":"Save $26 on an Amazon.com Prime subscription."},{"comment_id":"1006224616090150","commenter_b":"Game ko anything basta sugtan lng ko hahahhahahahahaah","commenter_a":"Make ta tonight?!? @username @username dalhun ugma?!","post_message":"Learn how to make chocolate chip cookie dough ice cream sandwiches."},{"comment_id":"10153866679791002","commenter_b":"This is what happens when the majority of nursing moms thinks it's ok to expose their breasts while nursing. No, use a cover please. Yes, it's natural and better for your baby, but that's still a nipple being shown to the public...","commenter_a":"I don't think John was saying that children should be denied a family fun day. But, he is right, when the children are hot and fussy, they are no longer enjoying the event. They are miserable and they are making the person next to them miserable and you too. That's not fair to your child or the patron sitting next to you. I know parents want to see the rest of the game but, that's one of the sacrifices we make for our young children. Changing a soiled diaper in such close proximity is rude and plain nasty!","post_message":"The Cincinnati Reds are opening a nursing suite at their stadium for nursing moms who want to feed their little ones during the game.  Do you think the Detroit Tigers should have something like this?"},{"comment_id":"1772229929682875","commenter_b":"'@username In defense of Donald Trump : Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not starting a race war. Trump did not leave any US soldiers in Benghazi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion ...","commenter_a":"Trump represents everything that is wrong with America. A narcissistic opportunist, a pathological liar, a clueless idiot, an unashamed con man and an unapologetic bigot!","post_message":"Imagine this man in charge of our men and women in uniform."},{"comment_id":"10152930337971749","commenter_b":"Gramma Cankles will NEVER be President...","commenter_a":"Can't wait for Hilary. All the brain dead idiots heads will explode.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154206928052431","commenter_b":"Politicians are non caring, or deliberately killing us. After all look at what Jackson did. Small pox ridden blankets. Yep and their attitude has not changed since. Maybe we should force better care of our people and not of these illegals.","commenter_a":"This is so very true. I was a cancer patient. Actively seeking medical help for confirmed CANCER in my body. The doctor at my clinic simply didnt show up for my first 3 appointments. All I needed was a consult, so they could refer me to an oncologist and behin treating the cancer. The first appointment was scheduled 1 month out, when the doctor didnt show, they had me see a nurse who confirmed I needed to be seen as soon as possible, and they scheduled me for 2 weeks later. Then, the same doctor didnt show for that appointment and it was another 2 week wait. Finally, on the 3rd no show I threw a fit and the clinic agreed to let me see a younger doctor who was actually in the clinic. And finally, after 2 months I got my referral to see the oncologist. In addition, because ...","post_message":"Natives Are Dying Because IHS Can’t Assure Timely Access to Health Care  @webpagelink"},{"comment_id":"1769361876675571","commenter_b":"Chinguen su puta madre ,al igual sigana trump nos seguiremos pasando i cruzando la frontera ,pongan ipongan sercas siempre los burlaremos 100% mexicanos gustele aquien leguste somos los #1 .","commenter_a":"Nice honest, rich family.","post_message":"In an impassioned speech, Eric Trump called on Americans to 'vote for the candidate who can’t be bought, sold, purchased, bribed, coerced, intimidated or steered from the path that is right and just and true!' @webpagelink"}]
