[{"comment_id":"10153393698278606","commenter_b":"The statement would they would have been fired if it was a white man is stupid,they should have been either way and the point is it wasn't, if this is the kind of judgement they you I wouldn't trust them to protect and serve","commenter_a":"It looks like two hunters with a deer...what's racist about it?","post_message":"One of the two police officers who was fired after posting this photo wants his job back: @webpagelink"},{"comment_id":"533139670207659","commenter_b":"She can take her sorry ass over there and live bet they wouldn't let her stay long","commenter_a":"she is a complete WASTE AND NEEDS TO BE PUT IN JAIL ALONG WITH HER COHORTS..","post_message":"She is DELUSIONAL..."},{"comment_id":"10153231600851491","commenter_b":"Well the last 3 harry Potter movies should had been directed by a woman then","commenter_a":"thats not how sexism works. Sexism is if there are qualified female directors available to direct, and they choose to hire a less qualified male director. If there are no qualified female directors available thats not sexism","post_message":"Emma Watson: 'I have been directed by male directors 17 times and only twice by women.”"},{"comment_id":"10153950585516491","commenter_b":"I really wish it had been 'Let the bodies hit the floor' by Drowning Pool","commenter_a":"What this guy have to do with music? This show is a joke nothing to do with real music talent onlyma bunch of show offs","post_message":"Michael Phelps:  'I might have a lot of gold but this guy’s got all the platinum.'"},{"comment_id":"683824238474821","commenter_b":"STFU you pussy. Why don't you go join ISIS.","commenter_a":"Really? This is just pathetic. Who in their right mind would even think if suing someone because they offered a book bible or not. The soldier is not fit to be in the military. All he had to say was he was an atheist. Unless he is to ashamed too.","post_message":"An Atheist soldier is suing a Christian soldier for recommending the bible. This is blown way out of proportion. Let's backup this christian soldier. Can we get 50,000 'LIKES' for this soldiers commitment to god?"},{"comment_id":"10153072554446037","commenter_b":"Feed her to the hogs","commenter_a":"Bye bye","post_message":"#Jordan will execute Wednesday a woman on death row over a failed bombing after the government vowed to avenge the murder of a pilot by the #IslamicState group, an official said."},{"comment_id":"10152895696909342","commenter_b":"shoot her in the face..","commenter_a":"Smh","post_message":"Police: Woman tosses baby out of car window during traffic stop. abc13.com/@username/"}]
