[{"comment_id":"10152775426692217","commenter_b":"The US has millions of illegal Mexicans to care for, sorry we're full.","commenter_a":"Am sure Canada and USA will come forward and agree to accept these poor immigrants. These countries unlike our crowded little island have plenty of space to accommodate these poor souls, tho having said that Scotland is pretty sparse.","post_message":"Video shows the moment migrants are rescued from a boat in the Mediterranean @webpagelink"},{"comment_id":"10153344961531336","commenter_b":"With the negros and the muslims,America is done.","commenter_a":"Someone \"finally\" says that they noticed the male charging up to the officer put his hand behind his back! Was that officer supposed to \"WAIT\" & see if the guy had a gun ??Plus,we DON'T know what he said to the officer! Don't be idiots & think the officer shouldn't be ready to protect himself just because \"THEY WERE TEEN AGERS\"!!!! AND IT ALL GOES BACK TO...\"LISTEN & DO WHAT THE OFFICERS SAY\" INSTEAD OF THINKING YOU'RE \"ABOVE THE LAW\".......","post_message":"JUST IN: Cpl. Eric Casebolt has resigned from the McKinney Police Department after almost 10 years on the force. His resignation was confirmed by his attorney, Jane Bishkin of Dallas."},{"comment_id":"10153814451294203","commenter_b":"Rebecca shut up","commenter_a":"Nicki Minaj's dad was a financial executive. She's not exactly on Lil Kim's level. Plus she attacks Taylor swift and Miley. These kids are 10 years+ younger than her. It's a little pathetic","post_message":"\"You in videos with black men, and you bringing out black women on your stages, but you don want to know how black women feel about something that so important?\""},{"comment_id":"10153148221999087","commenter_b":"Close the Border why are they allowed to get all this free stuff, when we have people in this country who need help??","commenter_a":"get it back TRUMP!!","post_message":"\"People are walking across the border right now, right in front of these great people we have,” Donald J. Trump said. “We have wonderful Border Patrol people. They can do their job, but they’re not allowed to do the job.”"},{"comment_id":"10153306499856770","commenter_b":"She's pathological. Plain and simple.","commenter_a":"Yeah Hillary, you are just the best liar around!!!","post_message":"Hillary Clinton claimed, \"I have tried in every way I know how, literally from my years as a young lawyer, all the way through my time as Secretary of State to level with the American people.\""},{"comment_id":"10153463081456336","commenter_b":"So all that is wrong with this country is the Hispanic Illegals?","commenter_a":"People need to realize something, Donald J. Trump is the only person so far in the entire field of presidential candidates who is willing to take on the genuine issues that the other candidates are so afraid to talk about. The truth hurts, medicine never tastes good. Whether or not he would deliver is another subject altogether. #Trump2016","post_message":"Donald J. Trump says Joaquin “El Chapo” Guzman's escape from prison is evidence that his past comments on Mexico are true. Read more of Trump's tweets and tell us your thoughts. @webpagelink"},{"comment_id":"465989180258329","commenter_b":"HELL NO FUCK THAT BITCH","commenter_a":"I wouldn't take them if they were free.","post_message":"Will You Refuse To Buy These Stamps?! Comment 'yes' or 'no'."}]
