[{"comment_id":"1308350412560406","commenter_b":"She looks like a black snowman... Where's her neck..?","commenter_a":"Who cares what this fat cow thinks???","post_message":"Whoopi Runs Her Big Mouth at Mike Pence GETS A BRUTAL RESPONSE! Wow... she should just shut her mouth! Lets get 5000 SHARES if you agree she should be FIRED!!!"},{"comment_id":"10152962676067060","commenter_b":"ASSclown !","commenter_a":"Mitch, Moon the coon's little boy people are begging to have their streets fixed, once you remove the monuments your murder rate and black on black crime will disappear.You are a special kind of stupid","post_message":"WATCH: Mitch Landrieu's full Confederate monuments speech he delivered to the City Council today."},{"comment_id":"1372039169498167","commenter_b":"Illegal aliens out of my health care","commenter_a":"Politics is what got you your \"free\" healthcare. We the people are tired of being forced to pay for it, So please feel free to sit down and STFU.","post_message":"HERE IT IS!"},{"comment_id":"1602376966724515","commenter_b":"@username I am fully aware of who I have voted for since 1992. Hillary Clinton put herself in this position by NOT doing what's right and serving HER own interests. Public Service is a privilege and shouldn't be abused. I look forward to more ethical women running for President in the future, hopefully in my lifetime.","commenter_a":"She puts herself in a coma just hearing herself!! Her own husband is so unimpressed, HE doesn't know her campaign slogan!!","post_message":"LIVE NOW: Hillary Clinton early vote rally, Cedar Rapids, Iowa"},{"comment_id":"10156484375905354","commenter_b":"MmmmHmmm so should welfare bitch!","commenter_a":"Chicago thugs on welfare should be fedubded.","post_message":"\"One of our major demands is that police be defunded and that that money used to fund police be used to fund black futures....\""},{"comment_id":"10152922353911051","commenter_b":"Someone should dangle her nasty evil ass with their hands around her fu****g neck!!!! evil bitch","commenter_a":"I'm sure the mom had a tight grip on the child when she did that. In saying that I'm hoping the kid was being punished for doing something really fucking stupid for her to take it that far","post_message":"Neighbors couldn't believe that a mother would do something like this to her young son."},{"comment_id":"900665266646768","commenter_b":"abortions have been going on before obama ever took office","commenter_a":"Abortion is indeed murder, and he is the ring leader behind it all.","post_message":"Eight years with a pro-abortion radical is eight too many. No more pro-aborts in the White House!"}]
