[{"comment_id":"674830109374234","commenter_b":"This America and every body should be able to fly our flag and if any muslim feels threaned then they can just leave your country and go back to where they belong and stay there","commenter_a":"I say- \"TOUGH\"","post_message":"You'll never believe why this man was forced to remove his flag.  This is absolutely wrong. If you're offended by the flag, LEAVE.  Can we get 20,000 'LIKES' in support of the American Flag?"},{"comment_id":"990765034279620","commenter_b":"Not empowering ,because ur shity woman","commenter_a":"I love them","post_message":"Photoshop this."},{"comment_id":"1357029221003198","commenter_b":"Some more cry babies who need their blankie and bottle and their safety pin get over it!!!! God BLESS AMERICA AND GOD BLESS PRESIDENT TRUMP!!!!","commenter_a":"Like the cops dont have better things to do! Should arrest the little bitch \"barista\"!","post_message":"The anti-Trump movement enters Starbucks.  @webpagelink"},{"comment_id":"1788331291434935","commenter_b":"She is a nasty woman","commenter_a":"If those liberals ever lost their middle fingers they'd never be able to drive in Oklahoma.","post_message":"Leftist Amy Schumer battling charges of racism..."},{"comment_id":"10153596385394740","commenter_b":"She lied on the form. If she is able to pass a background check she is going to pass a background check. It's not going to stop her from buying it for someone who can't legally buy it. Criminals will get guns no matter what laws are passed.","commenter_a":"This can't be! Everyone knows that background checks stop gun crime!","post_message":"Prosecutors say her boyfriend, a convicted felon, gave her money and told her what to buy."},{"comment_id":"10153105510381336","commenter_b":"I elected Obama twice. You wingnuts act like Hillary did some sinister dastardly deed that caused 4 people to die at Benghazi.Not true..The US lies and spies and tortures and misleads as a matter of policy.J ust like Bush Rumsfeld and Cheney did. I will never vote for a conservative. Politic is a tough business. acvtually governing is something the GOP has forgotten about.","commenter_a":"What truly amazes me is that State Communications Security let her first use a personal e-mail for government business and second they let her keep an unsecured server at her home. This is a complete violation of all government communications security regulations and practices. There is no way possible that she did not send classified e-mails during her entire tenure as Secretary of State and there is no way possible that they can say that unsecured server was not hacked by outside sources. What kind of a moron would think that? The idiots that are defending this woman are absolutely CLUELESS as to the magnitude that this Security Breach is. People go to jail and/or get fired for much less than this. It is absolutely mind boggling and staggering to me that this server was not turned over and now has supposedly been wiped. This server should be confiscated and ...","post_message":"Rep. Trey Gowdy said the former secretary of state has failed to produce a single new document in recent weeks and has refused to relinquish her server to a third party for an independent review."},{"comment_id":"1730793227218701","commenter_b":"My dad years worked in the fields of Arizona I whent with him knights we would spent checking the water pipes it's hard work but he was a proud man I learned a lot from him the truth is they won't last a night it day in the fields they beg that's all they do lazy","commenter_a":"Yeah right !","post_message":"They wouldn't last a day!  Video by Occupy Democrats, LIKE our page for more!"}]
