[{"comment_id":"10152992734357894","commenter_b":"I hope Nick Gordon get the Death penalty lazy Ass Bastard","commenter_a":"Praying for her...","post_message":"Nick Gordon Could be Charged with Murder for the Impending Death of Bobbi Kristina"},{"comment_id":"10153381837831770","commenter_b":"SHES A PROFESSOR ==== HEY KIDS DONT GOT TO THAT SCHOOL SHE WENT TOO SCHOOL WITH OBAMA AN HILLERY,","commenter_a":"Ladies and gentlemen if you want to see the face of Satan then look at this woman see how she can lie like that and never change her facial expressions. This woman I believe is either a muslim or a muslim symphothiser where do these people come up with such outlandish lies like this. This woman should be locked up. Make her produce evidence of her accusations and if she cannot then Lock Her Up For Slander.","post_message":"A queer theory professor in the department of women’s and gender studies on the Rutgers University campus in New Brunswick, N.J. believes that Israel has plundered the internal organs of dead Muslims."},{"comment_id":"822546624556646","commenter_b":"Trying to straight-wash and white wash the situation is terrible. Not only was this guy scoping out gay bars before, he also chose to go on Latinx night, when most of the patrons were PoC, generally of Latin descent. So this was a hate crime. It had to do with race, it had to do with sexual orientation. You trying to bury those facts is deplorable.","commenter_a":"This isn't a gay attack. It's a terrorist attack that's being portrayed as homophobic because that's a cause people will rally for. Anything to further your agenda. No one wants to believe it's radical Islam, but that's what this is. Of course his family and even his own tweets blame gays. A gay bar is a perfect target so we can blame homophobes and call it a a hate crime. Well terror is also a hate crime and gay or straight these people are dead.","post_message":"President Obama on Sunday morning's mass shooting at a gay nightclub in Orlando, Fla. It's the deadliest mass shooting in U.S. history. @webpagelink"},{"comment_id":"10152691502210927","commenter_b":"I agree they are just like his kids - Brats who think they deserve everything on a silver platter.....Put them back on the top of train cars headed for Central America","commenter_a":"Y r yall so against latinos/ mexicans last i checked they were here n mingled with natives b4 many of urs ancestors, when did they push, steal, lie, march families out of their lands","post_message":"Illegal aliens are just like our kids according to Obama."},{"comment_id":"10155182978984369","commenter_b":"We are animals no different then lions killing each other in self self-defense. i believe killing for money power drugs and such is a sin. Killing for self-defense would be justified","commenter_a":"A few people on here are saying that a gambling debt or drug debt isnt a good enough reason to kill someone. Maybe not for you but obviously a good enough reason for someone who kills...","post_message":"NEW INFO: The victim girlfriend told investigators she drove her boyfriend to the location of the shooting to collect on a Super Bowl bet and when he exited the vehicle, he was shot"},{"comment_id":"10154617717319255","commenter_b":"\"...ignorant and moronic assumption...\" \"...liberal mindset of free everything...\" I'll just leave that there where it belongs.","commenter_a":"I am a conservative who volunteers for children's charities, doesn't care if same sex couples marry, is pro-choice, owns a hand gun but doesn't believe any private citizen needs an Uzi, am a military spouse so obviously vehemently support our military (active and retired) and work in the public school system and believe those who work hard and succeed in high school deserve a break in college tuition. I'm sorry I don't fit in to your ignorant and moronic assumption that all conservatives are alike.","post_message":"Pretty much.   Thanks to Northern Michigan Progressives for sharing."},{"comment_id":"1204517232921065","commenter_b":"he's not alone. He has a lot of support!","commenter_a":"He is not alone..he has millions on his side... You got this Mr President..","post_message":"Can Trump do this alone?  @webpagelink"}]
