[{"comment_id":"868568856511870","commenter_b":"Chuck is right!","commenter_a":"You go Chuck.","post_message":"Chuck Norris puts Hillary to shame!  His liberal fans will hate what he said about her candidacy! But you'll love it!"},{"comment_id":"10153598853368984","commenter_b":"How many bullets are flying in your direction in the United States of America from Muslim extremists? How many IEDs are you avoiding on your way to the grocery store? I know we all know on any given day we could face gunfire from our neighbors from all different Christian faiths. If anything you're much more likely to be attacked in the U.S. by an angry Christian than by any other group of faith. The by the number argument that you're safer over seas from terrorist attacks than at home in the U.S. is based on comparing thousands of attacks on militarized institutions over seas and a small number of attacks directed at low security military institutions & personnel in the U.S. I feel for our solders at home being attacked. Just as I mourn for those children being attack in schools around our country. The people in the malls ...","commenter_a":"\"Radical Muslims are now the rule, not the exception\".... Let's talk about this. The Muslim faith has the largest number of believers in a world full of different faiths. To consider turning against all Muslims quite literally means to turn against over a billion people. She said this was the 21st attack. So roughly 21 people of the millions of Muslims living in the U.S. are radicals. I'm no math wiz but that sounds like an extremely small percentage. Secondly, Christians around the world have killed millions of people in the name of a God that most Americans demand our president to believe in. Who are the real radicals? Continuing, a soldier serving/living in the Middle East is absolutely not more safe there from terrorist attacks than one living in the U.S. That comment should be heard clearly as one of the dumbest things ever said. This Ignorance being spread ...","post_message":"This 22-year-old news anchor's brutal beatdown on Obama's \"half-way, half-baked, tip-toe, be-friendly-to-Jihadis mentality'' has been viewed more than 1.4 million times on YouTube, and overnight --  a viral sensation.  Now, she's just revealed what made her speak out.  Do you support Tomi Lahren and her message to Obama?"},{"comment_id":"10152813313326523","commenter_b":"Glad everyone shared that video and got this no good nasty tramp bitch arrested!","commenter_a":"Black lives matter","post_message":"“It’s almost like they plan these fights, they want these fights to be on tape where they can put it on social media. This is horrible.”"},{"comment_id":"10153240103694575","commenter_b":"Don't nobody wanna hear that mess they need to charge her as an adult.","commenter_a":"You failed at parenting now it's time the state steps in with a real punishment!!! I don't know why that woman is trying to act like if someone beat her kids like that she wouldn't want to beat the crap out of them! Fact is you raised the one that did it. SHE MADE HER BED NOW IT'S TIME TO LAY IN IT!!","post_message":"Russ McQuaid spoke today with the mother and grandmother of the teen girl accused of attacking another girl and a young boy in Brookside Park.  The suspect's mother says her daughter suffers from PTSD and other ailments.  See more of the interview here: @webpagelink"},{"comment_id":"10153203713812894","commenter_b":"She's a damn lie! Ain't nobody stupid! That's what's wrong with her lying ass all them babies and surgeries!","commenter_a":"What did she do to her face? She looks weird","post_message":"Kim Zolciak Reveals Doctors Discovered a Hole in Her Heart While She Was Hospitalized After Her Stroke"},{"comment_id":"10153477974742217","commenter_b":"When u search at this matter, u will find that these are european muslims.... not arab muslims or the east muslims. they misunderstood the islamic religion. I hope return to their mind.","commenter_a":"We reject and condemn terroristic attacks which happened in Brussels today. These attacks make our travel to the Union Europeans' countries a more difficulty, and will sufer the syrian refugees and arab muslims who work there from a compulsive procedures at this regard from now on. These actions obstruct anyone wants to travel so as learning and resume his study and those that travel to enjoy short trip. #Islam is a peace religion. we will find your media tell u that muslim persons commited these actions..... but these persons don't believe in any religion, yes. they are extremists. they don't belong to us. All of us feel sad for u","post_message":"Belgian PM calls for \"calmness and solidarity\" in \"black moment\" for country. #Brussels   Latest: bbc.in/21ENlj8"},{"comment_id":"10153171348750736","commenter_b":"Yeah, I want my 30 cents! in a check.. pronto!","commenter_a":"Instead of someone winning, split thee winnings with everyone who bought a ticket!!","post_message":"#BREAKING  No winner in tonight's Powerball Jackpot.  Wednesday's draw will be worth at least $1.3 BILLION.  Is there a billionaire's equivalent to the Dollar store??"}]
