[{"comment_id":"873173032819817","commenter_b":"Why are so many women that insecure? Come on...","commenter_a":"No thats called someone having mental issues lol","post_message":"Warning to all couples."},{"comment_id":"10153526411091350","commenter_b":"I don't eat in private, why should my kid have to? Most women who choose to bf in public are so good at it, you don't even notice, so don't wore about averting your eyes. When I'm at target I'm busy shopping not looking for a nip slip.","commenter_a":"I completely support breastfeeding mothers but would prefer not to see it happening while shopping. Target should be providing private respectable areas for this if they really supported breastfeeding moms.","post_message":" policy supports breastfeeding in any area of our stores, including our fitting rooms, even if others are waiting. See why moms are swooning over the retailer breastfeeding policy."},{"comment_id":"10153831676802377","commenter_b":"Trump and him are a great team and those Trump have lined up will make The A team! Everyone that loves this country has to realize now this Election is about saving this country! Do yourself and loved ones the most important thing and vote Trump! Obama is letting illegals in to vote the Americans have to stand up and fight for their own freedom!","commenter_a":"No he lives in a bubble","post_message":"Following Mike Pence's remarkable performance at the vice-presidential debate, Republicans wish they could swap their presidential candidate as the Indiana governor now appears more promising than Donald Trump, according to Politico."},{"comment_id":"842641039186009","commenter_b":"Do that to me, and I would turn you into a girl!","commenter_a":"What a bunch of cowards that's what we need not","post_message":"Here's the 'poor refugees' just looking for a 'better life' as they piss on women. Check this out... @webpagelink"},{"comment_id":"10152739505691028","commenter_b":"YEAH!!CONSEQUENCES!!! Let's round up all the Muslims and throw them in camps and just gas them!!!! Because that works out so well for society,you know.","commenter_a":"If they are not savages, what are they then - klilling innocent people? There should be consequences for this!","post_message":"\"Statements like these cause mistrust and fear of Islam and Muslims. It is unbecoming of a public elected official to issue such bigoted statements.\" @webpagelink"},{"comment_id":"10154403521603132","commenter_b":"I haven't read the article but I believe he is saying that he feels the death of Prince is a tragic loss as was 9/11. I know I haven't stopped crying since Thursday and I never met the man or knew him other than his movies and music. He was a beautiful soul and will be truly missed. @username take things so out of context it's unreal and always have to make things a issue where they should be no issue. Prince was a sexy, talented, giving man and I know I am devistated and I am a fan that will truly miss him.","commenter_a":"Prince was an amazing human being for so many reasons, but really??? 1) Comparing his, or any singular death, to 9/11 is crazy! 2) Why is this a race issue? It's like saying that only us Minnesotans are truly grieving.","post_message":"Dave Chappelle once impersonated Prince for a now-infamous Chappelle's Show skit."},{"comment_id":"1184256164945951","commenter_b":"Feminists are the worst lays!!!","commenter_a":"You are lame and you shouting that you're a lesbian is boring. Try something beneficial? Go suck a big one.","post_message":"You can't make this stuff up, folks!"}]
