[{"comment_id":"990398314328597","commenter_b":"Fucking what the hell why u have to hit a poor guys damn this US is freedom fucking basdard try to find me I kick their ass to hell","commenter_a":"That fuck up stupid cop","post_message":"Listen to an MMA fighter break down the poor training of law enforcement. Source → @webpagelink Filming Cops (Y) Police The Police (Y) H/T Gracie Breakdown"},{"comment_id":"1565960626752926","commenter_b":"With 12 to 15 million illegal Aliens in this country there is no way of knowing how many votes she got illegally.","commenter_a":"without California...Trump would would have won popular votes...snowflakes in cali...put on your diaper pin & pet a puppy !","post_message":"Hillary Clinton lost the presidency in 2008, she lost in 2016, she lost the 2016 recount, and she's gonna lose the Electoral College today. Four times Hillary Clinton has lost the presidency in eight years, a modern American record."},{"comment_id":"10154230829439877","commenter_b":"@username that's horrible Florida teachers do get raises the website says the pay is negotiable but I only co-teach so my salary is non negotiable. I suppose it depends on what one perceives as good pay the teacher I work with gets grants and other stipends but she also buys many things. My aunt who's taught for about 11 years in Arkansas buys many items but keeps her recipient for discounts and tax write offs I imagine you don't get nearly back what is put in. I subbed for a little over a year and I found myself buying many items I didn't care to file on my taxes even though the district gives you that option. I understand","commenter_a":"I've worked at many schools many of them teach our babies and cannot stand them this is a fact. I will add I chose my profession after having my well behaved straight A children repeatedly coming home telling me their teacher was mean or did not appreciate their good behavior and Good citizenship. So I began to substitute and get an inside view. 68 job assignments later I saw many teachers that were jaded not just by the lack of parental involvement but by the lack of pay. I think more parents should better discipline and I also believe teachers lacked empathy and understanding. I will add prejudices and biases had a part as well. I really noticed it at mostly white schools that had few Hispanic students and it is truly heart breaking. Therefore, I am pursuing my teaching certification with everything in me to become the/an advocate for ...","post_message":"Who are we allowing to teach our babies?"},{"comment_id":"1645437002375216","commenter_b":"i like thin women but umm. no, just no","commenter_a":"That is just grotesque","post_message":"Hot or not?"},{"comment_id":"1265414436832359","commenter_b":"SHAME ON THOSE ASSHOLES","commenter_a":"Alabama - the best argument in favor of mandatory abortion.","post_message":"From Restricting the right to vote to using $1.8 million to renovate his beach house, Republican Governor of Alabama now sinks to a new low with awarding his staff with $73, 405 raises after blocking a minimum wage increase in Birmingham."},{"comment_id":"10153649800077894","commenter_b":"Such a hateful bitch","commenter_a":"So Janet Jackson cancels her tour, gets pregnant and then has the nerve to drop a new video that was basic as all get out......Janet will see you after the baby because 2016 is not for you.","post_message":"Janet Jackson – Dammn Baby [New Video]"},{"comment_id":"10156200412990354","commenter_b":"Well she just proved what a stupid twat she is!","commenter_a":"Who?","post_message":"So loving and tender, those pro-abortion activists."}]
