[{"comment_id":"1025129017543627","commenter_b":"Preoccupied? Can women still vote? $$ facebook doesn't want you to see this $$ As long as America's richest 1%, who now possess 70% of the wealth and don't bother to vote, have the Senators in their pockets the United States Government isn't representing the will of the people, it's the 1% that's running the show. I stand with Bernie Sanders, \"We're governed by an Oligarchy.\" The number of Americans living in poverty will continue to grow while the middle class will continue to shrink and working women will continue to enrich the wealthiest 1% for the next 20 years easily! (Able to afford the best and brightest, Hillary is a great political actor with a well rehearsed script.) Hillary Will make another Fortune!","commenter_a":"VOTEHfor both of US","post_message":"Women deserve access to the health care they need—without interference, intimidation, or violence. #StandWithPP -H"},{"comment_id":"772068809592966","commenter_b":"the woman is not nearly as smart as a bucket of horse manure but is as pretty as one.","commenter_a":"Cher is still alive? ??","post_message":"As always.....leave it to Cruz to craft the most perfect response. ;)"},{"comment_id":"10154959360378812","commenter_b":"She's a nasty nasty woman","commenter_a":"charge her for what.......whats the charge...stop interfering in the election......","post_message":"Congressman Bob Goodlatte: FBI – Federal Bureau of Investigation Director James Comey \"very conscious of the controversy\" within the bureau over decision not to charge Hillary Clinton. @webpagelink #thisweek"},{"comment_id":"10156197809660725","commenter_b":"I think you mean deports the illegals","commenter_a":"thank you Donald Trump...for being the voice of and for \"the people\". liberal media and politicians are not used to truth...refreshing to hear you vs the politicians not in touch with Americas condition and needs!","post_message":"An updated POLL tracker (with all polls thru the weekend) reveals I maintained a double digit lead at 34.8%. Not only that, my poll #'s are double that of 2nd place candidate. #Trump2016 #MakeAmericaGreatAgain"},{"comment_id":"10153814688651337","commenter_b":"Fox might dump it if these rating keep up.","commenter_a":"Nah since fox has money.","post_message":"YIKES!   This big ratings drop should concern all Family Guy fans..."},{"comment_id":"916567641696749","commenter_b":"Book should have been titled; Chicken Shit in the Mango Tree. Married 31 years raised by a mother 2X divorced and once widowed. The families do not get over these Selfish POOR ME decisions. Families are for life.","commenter_a":"Why don't you profile some of the people who have not just dumped their inconvenient families? Let's see a profile of couples who have been bored, or \"grown apart\" and worked at their marriages instead of taking the easy and selfish way out. This guy \"gained so much more\" because he cared only about himself.","post_message":"\"I thought 'I have to do this ... it will be horrible for all the people I love most in life. But I have to do it.\""},{"comment_id":"1012314152218696","commenter_b":"Ungly Chelsea looks just like her father , Webster Hubble. What s slut that crooked Hillary!!!!!!!!","commenter_a":"Yes. Beauty & the beast think you can figure this out for yourself.","post_message":"Is turnabout FAIR play? This deserves about 25,000 'LIKES & SHARES'. Enjoy... @webpagelink"}]
