[{"comment_id":"10154030392435329","commenter_b":"Hahahaha this is so us","commenter_a":"This is like 95% us! @username","post_message":"♫ People, let me tell you about my best friend. ♫"},{"comment_id":"1198460870230286","commenter_b":"Women have it Harder then men? Who has to work in construction for his whole life if he doesn't have an good education? men do. Who has can't just suck dick and flash their tits or be a stripper or be a prostitute to get easy money? Men can't. So listen here you ugly fucking single mother in practice bitch you should've been caught in the condom.","commenter_a":"Stop boner shaming! Girls get to flaunt their sexuality. They get to show off their nipples. Then guys have to hide boners. You know how uncomfortable it is to flip a boner into your waist band Only some people breast feed. None of you would be here without a boner FREE THE BONER","post_message":"You! #WSHH"},{"comment_id":"10153122527121051","commenter_b":"Freedom bitch do something about call for help911 ..","commenter_a":"Hey Gonzalez: take your ass back to Mexico since you think you should fly the American flag upside down and the Mexican flag next and in equal position to the American flag. I was born in Cuba but will never fly a Cuban flag. I am an American and there is only one flag for me. You want to disrespect my flag and fly that rag of yours, go the hell back. BTW, you think there is racism against Mexicans, look at the way you act and then see if you can come up with any reasons American citizens might have a problem with Mexicans.","post_message":"An outraged military veteran took one look at this man's flag display and intervened. Soon after, he got a visit from the police"},{"comment_id":"756120254539294","commenter_b":"Dont \"let\" her leave America, MAKE IT LEAVE AMERICA! !!","commenter_a":"I thought Rosie was leaving?","post_message":"It's no secret that Rosie O'Donnell and Donald J. Trump don't like each other very much. But what she just did took things WAY too far..."},{"comment_id":"10153373946241833","commenter_b":"HE is a mental defective!","commenter_a":"he can leave anyday and take his moron buddies with him.","post_message":"The chairman of the Senate Judiciary Committee wants Attorney General Eric H. Holder Jr. to explain why a Department of Justice gun ban list has a defective category consisting almost entirely of names belonging to military veterans and their dependents. disturbing to think that the men and women who dedicated themselves to defending our freedom and values face undue threats to their fundamental Second Amendment rights from the very agency established to serve them, Sen. Chuck Grassley, Iowa Republican, said in a statement Wednesday."},{"comment_id":"10153738741461491","commenter_b":"women, so weak they shouldn't even be acknowledged in movies as worthy of a fight...","commenter_a":"I don't see it as offensive. It depicts two super heros fighting. Although everyone has a right to voice their own opinions.","post_message":"\"The fact that no one flagged this is offensive and frankly, stupid.\""},{"comment_id":"10152984157398598","commenter_b":"If she didn't want to get pregnant and ruin her career she should have kept her legs closed!! Selfish pos","commenter_a":"All u negative people will never understand...a baby can dampen your career...or just job if u have one...just think that if the mother is single...she will be out of work for six weeks...how do u pay rent..carnote..bills..ect..then when its time to go back to work how are u going to pay for daycare after being out of work..oh not to mention in todays society how many sick perverted people there are in the world and to know u may possibly give ur child up to one of those...SMH. shame on all of u who judge this woman....A REAL woman knows whats best for her and a child...and is certainly no ones place to judge...y dont all u negative people become a social worker and go find the real children who need help from a parent who decided to have them for their own sick pleasure! Thousands of children being born ...","post_message":"She Aborted Her Baby Twice and Both Abortions Failed, So She Aborted Her Baby Again"}]
