[{"comment_id":"10154273166073445","commenter_b":"Justin Ruffino build that wall!","commenter_a":"Hilarious!","post_message":"Role Reversal. Mexicans Are Smuggling American-Grown Weed South of the Border."},{"comment_id":"10156334612930354","commenter_b":"P.S. \"Illegals\" cannot vote.","commenter_a":"Good for Hungary for putting up the fence. It is their country and they have every right to protect it from any invaders. It's too bad our Golfer-in-Chief and the rest of the liberals don't feel the same concern for our country. They don't want to stop illegals because of the votes they can bring. 'Bleeding Hearts\" are a really sick bunch of people.","post_message":"This can't be right... Obama--who lives in a home surrounded by a fence--says border fences don't work. How can this be?!"},{"comment_id":"1850200075215990","commenter_b":"@username and ur moms va jj. And i was being sarcastic you simpleton","commenter_a":"No roof? Im telling you this is deeper than you all realize. Doesnt add up. Id evacuate","post_message":"Chopper 6 was over the foam spill and hazmat situation in Center City around Juniper and Lombard. The foam spilled from a fire supression system at PECO substation. More information: @webpagelink"},{"comment_id":"10153385020755329","commenter_b":"don't talk that way about yourself.","commenter_a":"Pathetic idiot","post_message":"\"Growing up, I thought of Bruce Jenner as the kind of man I could never become. Now, I think of her as the kind of woman I try to be.\""},{"comment_id":"1229197387109219","commenter_b":"Putin to Obama stop protecting Muslims I know Putin he is insane. What do you want from 1st a Muslim then a racist 1/2 black 1/2 white that own family owned slaves. And a bi sexual with a jar of Vaseline in his side table","commenter_a":"And so how is this different from supporting Israel which is pro-pro abortion? How does the GOP electorate square Israel's pro-abortion record with U.S. Southern Christian position on abortion? @webpagelink","post_message":"\"If I told you in 2008 that Barack Obama would negotiate a deal that he acknowledges will fund terrorism, you'd have thought me a conspiracy theorist.\""},{"comment_id":"10153379588172377","commenter_b":"TRUMP vs HILLARY?? Trump Illegals out, creates jobs - Hillary Illegals left here, job losses? Trump build a wall, welcome new legal citizens and make them pay taxes. Hillary let em stay and use all our stuff for free. No wall ?? Trump going to bring companies back to America - Hillary could care less ? Trump supports all woman's programs, equal pay and job growth. Hillary supports only women's programs that give to her foundation and supports habitual adultery from her husband?? Trump support our allies in the Middle East & make new deals - Hillary does not support our allies and no new deals? Trump get rid of Obama care and have open insurance plans that people are allowed to pick from - Hillary supports Obama care and it will literally bankrupt itself in 3 more years ? Trump protecting other countries with our military & now earning ...","commenter_a":"why would Obama do that? His hero is Bil Ayers, terrorist bomber.","post_message":"President Obama should have insisted on Cuba returning a group of fugitives accused of killing police officers."},{"comment_id":"538835082988240","commenter_b":"Yes it would 😂 cause you a hoe","commenter_a":"@username this is how we would be with Mr kitty 😂😂","post_message":"\"I pay puppy support...\""}]
