[{"comment_id":"1357303384289688","commenter_b":"Well how black do you have to be to be considered black... Since you have a PHD in biology","commenter_a":"\"If celebrating my roots and culture during Black History Month made anyone uncomfortable, those feelings were there long before a video and long before me,\" - Beyonce I totally agree!","post_message":"\"I'm an artist and I think the most powerful art is usually misunderstood.\""},{"comment_id":"1383945224964701","commenter_b":"Go away lady","commenter_a":"She definitely needs a half dozen chill pills....","post_message":"Sen. Elizabeth Warren has taken to Twitter to attack what she calls presumptive Republican presidential nominee Donald Trump's toxic stew of hatred insecurity."},{"comment_id":"10154168585709726","commenter_b":"She will be worse and any of the others. Idiots","commenter_a":"Whoever gets the nomination could run a brilliant series of ads about Hillary's War on Women.","post_message":"Abortion rights group looks to spend big to secure Clinton victory in November."},{"comment_id":"1707811955905494","commenter_b":"Sara are you looking in the mirror while you type???","commenter_a":"Yea its stressing me out my gosh what more does this man have to do before he actually gets in trouble??? OH AND THE FRUSTRATION THAT WE THE PEOPLE OF THE USA HAVE NO VOICE","post_message":"Two-thirds of Americans say that the future of the nation is a significant source of stress, according to a new poll."},{"comment_id":"809196999209345","commenter_b":"you are so full of it jeb - and you don't stand a chance. even insane republicans are done with the bushes. what's the policy on a presidential candidate's brother being a wanted war criminal????","commenter_a":"I am saying \"boo,\" not \"boo Jeb,\" though I AM booing Jeb. Boo!","post_message":"Most passionate moments of #DemDebate are always about who will ban more guns and who will give the gov't more control over your health care."},{"comment_id":"10156318897435354","commenter_b":"Guess what Ms. Wilde, past immigrants came to this country in a legal fashion. That's why we call people who enter otherwise illegals. What a house ape you are.","commenter_a":"Olivia you ignorant slut, you and your liberal harpy friends wouldn't like if those trespassers came over here with their broom handles. Then again Olivia, maybe you would","post_message":"Wrong. What's \"really sickening\" is seeing innocent Americans murdered and raped by criminal illegal aliens and having a president who cares NOTHING about the victims and their families. THAT is what's \"really sickening,\" Olivia Wilde."},{"comment_id":"10153146090320667","commenter_b":"Watch out she's going to report u lmao","commenter_a":"Go get a life,","post_message":"In about three days, the group has collected 30,000 signatures."}]
