[{"comment_id":"1554742308153991","commenter_b":"IM A WOMAN...A STRONG WOMAN...AND I SAY TRUMP 2016!!!!!!!!!!!!!!!!!","commenter_a":"Classless joker","post_message":"What do you think about President Barack Obama's statements regarding Republican women and Donald J. Trump?"},{"comment_id":"10154247544237894","commenter_b":"Damn yo mama mean BUSINESS!","commenter_a":"one year my brother and i unwrapped all our Christmas presents before Christmas and my mom found out and took everything back, i would've much rather gotten the ASS whooping instead.","post_message":"Say What Now? Indiana Woman Arrested After Beating Kids for Opening Christmas Gifts Early"},{"comment_id":"10153230871447708","commenter_b":"It's a good talk but you shouldn't make promises u can't keep. But you still have my vote","commenter_a":"Until AFTER election.....Read my lips...All the same","post_message":"I will oppose and veto ANY and ALL efforts to increase taxes. Join me in standing up for American taxpayers.  Click here now!"},{"comment_id":"10153240911786491","commenter_b":"Women spend 25 percent of their lives menstruating. That is the biggest reason we spend more time in the bathroom.","commenter_a":"The only way to have bathroom equality is for women's toilets to have the same turnover rate of women coming out of the bathroom as men. Just because it's the same physical size restroom doesn't mean it's an equal situation.","post_message":"\"Many public restrooms continue to be facilities that are equal in physical space, while favoring men’s bodies, experiences, and needs.\""},{"comment_id":"10153161460796051","commenter_b":"You're stupid","commenter_a":"He's promoting this cause he knows him and his racist wife will end up in a cell very soon.","post_message":"Here's why President Obama says it's time to end mass incarceration in America. Do you agree or disagree with his message?"},{"comment_id":"10153790527131336","commenter_b":"Coming in your town soon.","commenter_a":"Beyond stupid","post_message":"Critics have pointed out that the Obama administration has taken a different position when it comes to defending Christians' religious liberties."},{"comment_id":"10152996747985950","commenter_b":"look at the KKK what a bunch of ugly losers... lmao...","commenter_a":"Good","post_message":"More rallies have been planned..."}]
