[{"comment_id":"10152774422166051","commenter_b":"Why are some people allowed to have kids??","commenter_a":"Please, can we eliminate these sh*tbags from the gene pool?","post_message":"Police found this 3-year-old boy sitting in the backseat of a car in freezing cold temperatures. His dad and babysitter had something more important to worry about."},{"comment_id":"1160205933989715","commenter_b":"You must want Hillary as president....","commenter_a":"I have to say I am ashamed to call myself a Republican...they need to stop crying and support the leader and stop this!!!! If they do this they would elect the Democrat and then away goes all our freedoms!!!!","post_message":"Gingrich: Trump is a natural ally of conservativism"},{"comment_id":"10154119835601770","commenter_b":"Give those real freaks, real deplorables if you will... a hand they know Clinton is one of them!!","commenter_a":"They feel sorry for the looser and I mean a dirty looser","post_message":"Remember when Vice President-elect Mike Pence was booed at 'Hamilton'?"},{"comment_id":"10153268434242061","commenter_b":"we're proving it as we speak. record rainfall here in texas and it's still not over. weather is weather, period.","commenter_a":"Kevin Michael Wahler","post_message":"This is Buffalo in 2014 and 2015. First time the city has had no measurable snow in 116 years."},{"comment_id":"10153264748117690","commenter_b":"I Hope she gets fired! She obviously can't do her job.","commenter_a":"Why does she still have a job? Bottom line she should of been fired end of story.","post_message":"A Kentucky courthouse clerk who refuses to issue same-sex marriage licenses is scheduled to appear before a federal judge Thursday. @webpagelink"},{"comment_id":"937660539681364","commenter_b":"He did not say the wall was to keep you or anybody else in...but to keep out Drug Dealers...I agree !!!","commenter_a":"What the hell? Now Trump want to build a wall both Mexico and Canada boarders. So the Americans are going to be imprisoned in his Presidency?? Dump Trump","post_message":"Drug dealers are pouring in from the southern border. We will build a wall on time and on budget. #GOPDebate"},{"comment_id":"1024079497651798","commenter_b":"She's not a model , clearly, unless she is modelling Down Syndrome !","commenter_a":"Yes it's great and all but why does she constantly be labelled as the Down syndrome model, just call her a model.","post_message":"'People with Down syndrome can do anything' (via Daily Mail Australia)"}]
