[{"comment_id":"592897514209538","commenter_b":"That'll get a lot of these men shot in the ladies room !!! Hey ladies , keep shooting till you're sure they're dead","commenter_a":"A bunch of idiots!","post_message":"A bill to repeal a rule allowing transgender individuals in Washington state to use public bathrooms based on their gender identity has cleared a state Senate committee."},{"comment_id":"10152870782829091","commenter_b":"Who kill innocent people ... Im just saying .. Encourage them America ....this is why the world is crazy cuz of the way y'all( liberal whites ) think ..filthy animals","commenter_a":"What the hell is wrong with people..... She should of had her students send letters to our troops","post_message":"SHOCKING: A teacher in New Jersey has been suspended for having her third-grade class to write get well letters to a sick inmate convicted of killing a Philadelphia policeman: @webpagelink [PHOTO: Forest Street School]"},{"comment_id":"10153245787992507","commenter_b":"I never liked that women .","commenter_a":"She is Just not a good person ......","post_message":"Ann Coulter brought knives to a gun fight on The View."},{"comment_id":"1168639523214582","commenter_b":"Just another paid for asshole who got caught with his dick in his mouth. Now disbar this worthless piece of shit and scum.","commenter_a":"You cannot believe the media at all they're just liars liars and Liars and they make up s*** and tell it like it's real you can't believe nothing they say think or do and as far as thinking I think they're incapable of thinking anything they're being paid to Railroad this guy and they're going to do it for the money","post_message":"The judge in Donald J. Trump's Trump University case was just HUMILIATED... here's why he just had to undo his own ruling. This shows exactly why he shouldn't be on this case... it's time for him to recuse himself."},{"comment_id":"10153687088042235","commenter_b":"Quit giving him attention...if you quit he will kill himself sooner.","commenter_a":"Georgie got a death wish.","post_message":"Seriously. F this douchebag."},{"comment_id":"10153650702998984","commenter_b":"The evil corrupt white witch.","commenter_a":"It's about time,","post_message":"All I can say is wow. I didn't think this was ever going to happen, but here it is. Hillary has to be terrified right about now... Are you glad the FBI is taking action against Hillary?"},{"comment_id":"10153291171784203","commenter_b":"Jews and fat women.","commenter_a":"Yeah, bring back the jokes about Gays and Blacks.","post_message":"Why can we all grow up and just let comedians be comedians again?"}]
