[{"comment_id":"10153461006671717","commenter_b":"Welp since all the lesbians I see on here basically think its hilarious, and a silly hearted statement meant with no hate or bias I guess you're just one of those super bitchy \" right to be offended\" people that wake up everyday looking for a reason to be Cunty.","commenter_a":"I'm not buying it. I don't think the joke was just in good humor. There's enough language here to clearly see that he was being hateful towards the LGBT community. After all, he did say the word \"lesbian\". Isn't that enough to ban him and boycott him from everything? Shouldn't we be calling him hateful names for his aweful transgretions?","post_message":"Funny or die?"},{"comment_id":"1033603779993966","commenter_b":"Please guys, read it again. \"The VIRUS'agrees that vaccines cause autism. Maybe vaccines cause stupism?","commenter_a":"Viruses are not to be trusted.","post_message":""},{"comment_id":"10153567910251130","commenter_b":"I think you're Ricky Gervais pretending to be a guy a named @username! (Please do not take that as an insult! You look like an incredibly fun dude)","commenter_a":"Kid admiring hard working men before society pollutes his brain with the sad gift of being judgemental. Future empath right there. Well done son.","post_message":"Starstruck!"},{"comment_id":"787208168094254","commenter_b":"That woman's a little unhinged!","commenter_a":"You are a has been. Good luck in finding work. You might need President Trumps help in finding a job.","post_message":"Classy!"},{"comment_id":"10153553698421323","commenter_b":"I'd rather be surrounded by happy refugees , than miserable right wing morons.","commenter_a":"Have you seen most of these refugees? Not the kind of people you want living near you. They've already turned many areas into hellholes for the residents.","post_message":"\"Anyone who tells me Germany is full up, or that we can’t afford them, I say think of our past, and of the future. Of course we can afford them – we’re a rich country, and we have a duty to help those in need.”  The German mayor desperate to welcome immigrants to his town."},{"comment_id":"10155745966725354","commenter_b":"She is a twatwaffle","commenter_a":"WIGGER WOMAN","post_message":"Instead of just admitting \"I'm really white,\" we get a bunch of jargon like \"the dialogue has unexpectedly shifted internationally to my personal identity in the context of defining race and ethnicity.\"  Check out the full woe-is-me open letter:"},{"comment_id":"663264380530807","commenter_b":"Yes! Disgusting!! Vulgar!!","commenter_a":"Yes,don't wish to see their underwear or ''butts''.keep them covered","post_message":"These thugs were arrested after refusing to pull up their pants.  Hilarious. Let's make this a law, who agrees?  Should excessive sagging be illegal?"}]
