[{"comment_id":"10150849465384999","commenter_b":"Canada only lets rich Asians in obsessed with money!","commenter_a":"Keep letting Hordes of Immigrants into Europe!!!...Same goes for the U.S. of A., Canada & Australia!!!","post_message":"Victims of the terror attack on Bastille Day were honored on Friday in Nice, Paris, Rome, New York and Moscow."},{"comment_id":"10154037878823984","commenter_b":"Mr. Trump from the time he started his campaign he has always states that all the illegals have to go back have to go back to Mexico and Central America but yet he is one of the largest employers in the Real Estate , Casinos , Hotels, and Golf Courses business, has bragged about hiring illegals to including his contractors and subcontractors and they love him 1. did he use e-verification to see if he or his contractors and subs to see if they had a work permit or they are who they say they are. 2. you claim you want to help the veterans but your company hires more illegals than vets. 3. if you are serious about what you are campaigning on why not be the first to fire or dismiss the illegal aliens and fill those jobs with veterans lead by example and make America great again ...","commenter_a":"Yup another lifer. GET RID OF POLITICAL LIFERS THAT ARE FEATHER BEDDING Stump for Trump. You Go Don, Go Don all the way to the WHITE HOUSE.","post_message":"Wow. The governor of Iowa is actively working against one of the GOP's most popular presidential candidates. This is very unusual for the Iowa caucus... the Iowa governor must feel very strongly about this. Do you agree with the Iowa Gov.?"},{"comment_id":"1374717489237646","commenter_b":"Deport all Mexicans","commenter_a":"Alot of snowflakes on here. Trump!!!!!","post_message":"LIVE NOW: Donald Trump speaks at a \"Thank You Tour\" rally in Mobile, Alabama."},{"comment_id":"1733106183573180","commenter_b":"Liar, murderer and thief! Hang that bitch.","commenter_a":"She is such a P.O.S. lol, if there is nothing to hide then why not release them, it's ridiculous! No one is asking for others transcripts, just her's because she is a proven liar...anyone supporting this woman needs to really see the truth and stop denying what she really is.","post_message":"During last night's debate, CNN moderator asked Hillary three times why she won't release transcripts of her speeches to Wall Street banks if there's nothing that she's trying to hide from voters. Do you think Hillary Clinton is hiding something in those speeches?"},{"comment_id":"870399723007863","commenter_b":"Her and Her Husband are a disgrace to America.period!","commenter_a":"She think it ok i am obama wife","post_message":"Is it her?!"},{"comment_id":"10153856262981167","commenter_b":"And what do they show? Nothing in the previous 30K!","commenter_a":"Fixtion(sic) for Fox viewers like screaming \"fire\" in a theater.","post_message":"Really scraping the bottom of the barrel here"},{"comment_id":"936073656538031","commenter_b":"She is the one for the job. Let's go forward not backward.","commenter_a":"HILLARY will be a GREAT PRESIDENT.. #PRESIDENTHILLARYCLINTON2016","post_message":"Matt Lauer asks Hillary Clinton about the qualities that make her qualified to become Commander-in-Chief. More coverage on @webpagelink"}]
