[{"comment_id":"10153115763853690","commenter_b":"The fundamental pillars of many so called western democracy is to build terrorist groups to fight a government that doesn't serve their needs. But guess what, immediately these terrorist got training and weapons they starts killing their masters Americans and allies. Then the next day their X masters will come out with a BLANK SPEECH called War on Terror. Well am never gona be part of any War on terror coz I never creat any terrorist. Look at Libya; they trained and armed them and later the terrorist killed their diplomat. They trained and armed Bin Laden; we all knows what follows next. They created ISIL; that one is more than I can write. Now U are creating another dead squad in Syria so what follows next no complain please. How can u call others \"Rebels\" and others \"Good Rebels?","commenter_a":"Isn't dat supporting rebellions on another country samething they accuse Russia? ?!","post_message":"Pentagon says 400 troops & support personnel will be sent to train moderate Syrian rebels | @webpagelink"},{"comment_id":"10153492850468984","commenter_b":"Tear them down! Burn them - just get rid of them and start a mass deportation of Muslims!!!","commenter_a":"First time I see one I am going to the ACLU and sue Islam is a dangerous cult and it offends me...","post_message":"Some of these claims seem quite bizarre. I wonder how this will be received by the American public.  What do you think?"},{"comment_id":"1114818335281084","commenter_b":"Go, Hillary! #I'mWithHer","commenter_a":"Democrats who support Hillary have the same mental disconnect as Republicans who deny climate change","post_message":"Sanders was shelling out more than Clinton on Nevada airwaves just a week ago."},{"comment_id":"1256658817687479","commenter_b":"Lady I think you need a snickers bar.","commenter_a":"Yeah be on the lookout! They have white skin, blondish hair, blue/gray eyes and they shoot up movie theaters, churches, schools and clinics! Oh my bad, wrong terrorists!! Please continue! Smh....a bunch of fucktards.","post_message":"After masquerading for months as a newly Americanized housewife, Tashfeen Malik dropped the facade in a burst of gunfire."},{"comment_id":"10153778472068984","commenter_b":"She doesn't owe anyone anything, much less a fucking apology lol","commenter_a":"Carly, how can someone so well versed on most subjects, be so uninformed on Muslims? Even Muslims know Islam is not a religion but an ideology of submission only. Therefore you owe Ben Carson an apology for being correct when he said they are not covered under OUR constitution. READ the Quran for yourself Carly and you will find out that you are an Infidel and are to be killed if you do not SUBMIT to Allah. Does that sound like someone our constitution would support? I think NOT!","post_message":"Carly Fiorina just revealed what she thinks about Ben Carson's comments about a Muslim serving as President of the United States - and you might be surprised with where she stands...  Do you think Fiorina is showing her true colors?"},{"comment_id":"10155164817270093","commenter_b":"Hilarious. And I can't even fault people for mistaking it as serious because that IS how absurd feminists sound most of the time.","commenter_a":"Good one!","post_message":"Talking about mansplaining, manspreading and manslamming is not enough. We also must fight against manterrogating, manpacking, mansulting, and bropen-mouth chewing!"},{"comment_id":"512225352297167","commenter_b":"put that baby arm away bitch get tight hoooeeeee","commenter_a":"Savage","post_message":"It be like that "}]
