[{"comment_id":"596850543832294","commenter_b":"They can. And you have, traitor. I've gone from 80k a yr. income to less than 30k because of your bullshit. F you Brock insane obozo","commenter_a":"They're doing it you idiot. Must live under a rock.","post_message":"On the recent attacks, President Obama says no terrorists 'can ultimately undermine our way of life.' Do you agree?"},{"comment_id":"930249893698207","commenter_b":"'@username tell that to these women and many more @webpagelink","commenter_a":"Hillary takes millions from country's that rape girls at 9... Legally. And where woman can be beat stoned or imprisoned just for reporting rape.. What happened to the war on woman? Oh, big $$$$$$$$ Oops, my bad","post_message":"Hillary can't do it without you. Sign up to volunteer: @webpagelink"},{"comment_id":"1055345397919589","commenter_b":"Natural selection for the girl that's in the bikini","commenter_a":"Wow","post_message":"LIVE FROM HOLLYWOOD BEACH - Take a look at LIVE video from our Hollywood Beach Cam where the outer bands of Hurricane Matthew are making their presence felt."},{"comment_id":"1119811948055147","commenter_b":"You want a female hero? You've got Samus! Leave Link alone and stop this feminism in video games. Ghostbusters already died and they want all of the world become female, not just video game characters...","commenter_a":"while we're at it, should we change harry potter to female as well?","post_message":"Nintendo's reasoning makes zero sense."},{"comment_id":"519399201582629","commenter_b":"I hope one of hillary Clinton refugees knocks on your front door. . . You will probably be dead after that tho. . . She will continue to destroy this country and you want her to. . . Good job","commenter_a":"To bad his parents and Trump feed the poor kid lies. She has not been found guilty of anything and in this country you are innocent until proven guilty. You need to get of the Benghazi kick. The ambassador's family has come out and said it was not the State Department or Secretary Clintons fault. Grow up people. You would rather have a racists , hatred spewing, women hating asshole in office?","post_message":"BOOM!"},{"comment_id":"367420580112903","commenter_b":"Rot in Hell B#$%H !","commenter_a":"Good for him !!!!","post_message":"INSTANT Justice: Judge: 'I Hope You Die in Prison!'  Watch the video!"},{"comment_id":"10153280384163812","commenter_b":"Stfu bitchass","commenter_a":"Time to eliminate this threat to life.","post_message":"He's back, but this time, instead of just going for a leisurely stroll, Goliath the massive alligator is spotted trying to eat an entire turtle on his Florida golf course: @webpagelink"}]
