[{"comment_id":"10153272244859071","commenter_b":"Women RUN the World.... All Hail the Queen....","commenter_a":"Ana Clara Mello","post_message":"Kurdish fighters have said ISIS is \"afraid of girls.\""},{"comment_id":"900994056627010","commenter_b":"@username if it's their religion then they shouldn't have been lesbians in the first place but your comment speaks volumes about you","commenter_a":"Nothing to do with religion.","post_message":"Muslim lesbian and her vampire-loving girlfriend, then it gets weird"},{"comment_id":"959266487466433","commenter_b":"O girls have brains too?","commenter_a":"Only frustrated sick person can prefer physical fearure otherwise normal and true men appreciate beauty with brain","post_message":"Men care more about a woman’s brains than her bust, allegedly"},{"comment_id":"10156240783770389","commenter_b":"It was painful to watch! How annoying is Bernie??! Good Lord!!","commenter_a":"#PresidentTrump","post_message":"Dumb, dumber, and dumbest?"},{"comment_id":"10153270179214087","commenter_b":"Wrong @username, when people come across any countries borders without proper papers in hand they are criminals hence they commit a crime. Trump is correct illegal immigration is the most pressing problem for this country of whi h it is not in the least ludicrous. If you are much wanting illegals here then why don't all you democrats join together, invite them to live with you and pay their way instead of demanding we tax payers pay for all the freebies they get, not to mention all those ancor babies that we have to pay for to be born then pay for them and all the freebies they will be getting for the rest of their live.","commenter_a":"real change like we have never seen before. Go Trump!","post_message":"When immigration activists began heckling Donald J. Trump for his remarks on illegal immigration at a rally Wednesday night, his supporters came to his defense."},{"comment_id":"823822871141623","commenter_b":"Every intelligent person knows about Hillary what she is. LONG TIME AGO SHE HAVE lost people trust","commenter_a":"YES, I SURE DO!!","post_message":"Once considered for Hillary's VP, this Navy Admiral wants nothing to do with her. Hillary is a criminal and belongs in jail. Do you support this Admiral's act of defiance?"},{"comment_id":"10153233810444087","commenter_b":"She is lying","commenter_a":"They didn't bring their girlfriends","post_message":"“I think there are lots of people who wanted there to be a race for different reasons and they thought the only way to make it a race is a full-scale, frontal assault on her. This email thing became the biggest story in the world.\" said President Bill Clinton about the controversy over Hillary Clinton's email."}]
