[{"comment_id":"10153357248947061","commenter_b":"silly girl","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"10152994930245671","commenter_b":"Because she knows she can get a pay day from the police.","commenter_a":"Her brain is definitely injured. She says she wanted the cops to back off, but if they hadn't been there she would be crying a different tune - saying they should have been there. She really thinks with all those guns and ammunition, that they would have just found there way home? They would have executed her.","post_message":"“My hopes for the whole thing were the cops would just back off, let these guys get where they needed to go, so me and Misty could find our way home somehow.\""},{"comment_id":"1756660697910009","commenter_b":"I hate everything about this wannabe she makes me sick","commenter_a":"I think I throw up in my mouth every time this convict opens her trap.","post_message":"\"Don't let anyone tell you that our country is weak. We're not. Don't let anyone tell you we don't have what it takes. We do. And most of all, don't believe anyone who says, 'I alone can fix it.'\" Hillary Clinton slammed Donald J. Trump, saying his words \"should set off alarm bells for all of us.\" @webpagelink"},{"comment_id":"891775107623863","commenter_b":"Michelle isn't a woman for women. Let someone rape one of her babies and watch out!! And of course Bill Clinton may try! I've worked with sex offender's like Bill all my life and they DONT change. They like white, black, Asian, and ALL the girlees. Even baby girls. Bill is a threat to our children. Hillary doesn't stand for the security of our babies... she hands them over to Bill to be F...!!","commenter_a":"two faced .... you heard what what she said when Obama ran for office","post_message":"Michelle Obama did not get emotional for Juanita Broaddrick. Michelle Obama did not get emotional for Kathleen Willey. Michelle Obama did not get emotional for Paula Jones. Michelle Obama did not get emotional for Connie Hamzy. Michelle Obama did not get emotional for Eileen Wellstone. Michelle Obama did not get emotional for Sandra Allen James. Michelle Obama did not get emotional for Christy Zercher. When will Michelle Obama get emotional about all of Clinton's alleged sexual assault and rape victims?"},{"comment_id":"10153019047726130","commenter_b":"Not every cheerleader is a slut.","commenter_a":"meeting the cheerleader at the dance so you can go someplace else and apply what you have learned!!!!","post_message":"Young people still aren't getting much from sex ed."},{"comment_id":"10153406573360329","commenter_b":"Crocs get the pussy wet.","commenter_a":"There's nothing wrong with my crocs.","post_message":"Welcome to the nope zone."},{"comment_id":"870644459698474","commenter_b":"Hillary will win. I'll take more Clinton any day.","commenter_a":"That is disgusting! They just don't get it! We don't want another bush! But their greed will get the better of them!","post_message":"Getting closer to announcing?"}]
