[{"comment_id":"631726717035650","commenter_b":"You go girls don't let them do something that you dont want to do","commenter_a":"We should be WAY past forcing women to perform (in any capacity) against their will. Especially for a degenerate like Trump!!! Resist ladies. A stand must be taken against this. Millions of people are are your side. Let Trump hire his knucke-dragging Klan supporters for entertainment if he wants to get his jollies.","post_message":"These Rockettes are NOT taking this lying down. You go, ladies!"},{"comment_id":"1250005395092512","commenter_b":"Damn, please fire her & throw her in jail.","commenter_a":"Ugh...","post_message":"Just another day in America."},{"comment_id":"1113541475361229","commenter_b":"Killary is a delusional lying bitch","commenter_a":"No Trump was right on","post_message":"Clinton: \"Donald Trump spent his time attacking when he should have been apologizing\" at the debate. Agree or disagree?"},{"comment_id":"10156088559505294","commenter_b":"In my opinion, the collarbone issue and sleeveless tops or dresses are a bit over the top. The women in most offices I've worked at wore sleeveless dresses and tops that were tasteful and appropriate. Even the women news anchors wear tasteful sleeveless outfits. I don't see a problem with that. I do however agree a dress code should be in place for kids in school. When they get out in the real world, there are rules, and they have to be followed. 48-50 years ago, we had to wear skirts or dresses that touched the floor if kneeled down. If it didn't touch the floor, we had to change. The guys had to wear belts. If they didn't have a belt, they had to pay 50 cents for a piece of masking tape with the word belt on it and tape it to their pants, and they better have ...","commenter_a":"I say all schools should have a dress code and make sure all students adhere to it. It teaches them to accept things in life their not happy about, but rules must be followed.","post_message":"It's back to school time, and we're hearing more stories about dress code violations. Students at one school in Chicago are protesting a rule that they wear only shirts and dresses with sleeves.   Click below for more, and tell us: Are dress codes these days fair? Unfair? Do they go too far?"},{"comment_id":"10153101958805329","commenter_b":"I love that now it's called \"fat shaming.\" She made a choice to eat healthy, work hard and raise her kid. What is wrong with that? Society is annoying sometimes.","commenter_a":"What it's bad is telling people what to fucking do!!!","post_message":"“I have a kid, a six pack and no excuse.”"},{"comment_id":"1218431098240658","commenter_b":"May be time for this earth to be cleansed ethnically.... all with religions other than HUMANITY should be wiped off...","commenter_a":"When will it all fcking stop!!! I think when religion stops their will be peace once again","post_message":"BREAKING: Russian ambassador shot dead in Turkey by gunman screaming 'We die in Aleppo, you die here'"},{"comment_id":"10153813340919342","commenter_b":"I am also. But unfortunately not all women have that same luxury.","commenter_a":"They don't do thorough background checks?!!!!!!! My heart hurts every time I see stories like this! That's why I'm a stay at home mom. Can't trust anyone now a days.","post_message":"A parent's worst nightmare comes true. #abc13"}]
