[{"comment_id":"102418186941623","commenter_b":"'@username 99% of the Republicans that seem to comment in these venues seem to share the same ugly views. Those that aren't like that need to speak up more.","commenter_a":"That's because Republicans are selfish, self-righteous, hypocritical pieces of shit who are blowing loads over their new ability to grab power.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"636847006505878","commenter_b":"who said she was a lady","commenter_a":"She is by far the worst First Lady of all time.","post_message":"What Michelle just said is one of the dumbest things we've ever heard.  This is just absurd. Michelle is moronic and un-American.  Is Michelle the worst First Lady of all time?"},{"comment_id":"979014955531025","commenter_b":"Yes yes Milana the porn star.","commenter_a":"Did anyone besides me have flash backs to Jackie Kennedy when Melania walked out Classy dressed to the nines This lady loves America This lady will be a great first lady","post_message":"Donald J. Trump made a dramatic entrance at the GOP convention and introduced his wife Melania Trump. #RNCinCLE @webpagelink"},{"comment_id":"482294165294497","commenter_b":"Our home, our laws. Get out of our country!","commenter_a":"Kick islam out of America.","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"10152998065516037","commenter_b":"Of course men are trying to tell a woman what to do with our bodies. Go shove it!!!","commenter_a":"The silent holocaust, women and men who are irresponsible killing a life because of inconveinence. They will pay for it if not in this life the next one.","post_message":"A new report out today from the Guttmacher Institute shows that 57% of women now live in a state considered to be hostile or extremely hostile to #abortion rights."},{"comment_id":"1793346000922790","commenter_b":"The only women that believe that they shouldn't be checked out are the ones that don't have to worry about it anyways.","commenter_a":"I got dress coded while still in school for my skirt being to short when i argued this saying that it was well pass my finger tips she agreed but since i had long legs the skirt looked short so i would have to change","post_message":"Portland just completely flipped the script on sexist school dress codes."},{"comment_id":"10153039923756037","commenter_b":"^ pathetic.","commenter_a":"Tranny.","post_message":"#MichelleObama relished watching children ride their bikes and walk their dogs inside the White House as she pushed her 'Let's Move' campaign forward."}]
