[{"comment_id":"1754762228138614","commenter_b":"If you think things are bad now if Hillary get in a wall, illegal immigrants and whatever you want talk about are going to be the very least of your (our) problems. She will destroy anything and anyone plus she will cheat, lie and steal and never think twice about it! She not even be in the running! If she gets in everybody better run like hell!","commenter_a":"Actually, Clinton was talking ABOUT trump since trump HIRED illegal immigrants! Clinton didn't put anyone down when stating this. Every president/candidate has said this. It's how and what you say that make a difference. Trump wouldn't be called a racist etc. If he didn't put a whole country/religion down with name calling. There's a HUGE difference between what bill said and what trump says. Whoever can't see that needs help...","post_message":"Do you think this sounds a lot like Donald J. Trump? MORE: @webpagelink"},{"comment_id":"10153709575791378","commenter_b":"@username Good call momma!","commenter_a":"They need to ban children from beaches and parks, too many dirty diapers and clothes left behind by irresponsible parents.","post_message":"JUST IN: New Jersey lawmakers have approved a ban on smoking on public beaches and parks, sending the measure to Governor Chris Christie's desk. 6abc.com/@username"},{"comment_id":"1841357016150669","commenter_b":"Coming out now? It sure is a convenient time. Why is she reading it?Another thing if Trump was sexually abusing her why did she stay ? Why didn't she leave when he first kissed her. She stayed and he kissed her again. He put his hand on her breast and she still stayed? Give me a break! This woman is big time lying. This never happened!","commenter_a":"So many people are so stupid and are going to vote for Hillary but when she cause a war and all your children are sent to war and dying don't complain.","post_message":"\"I stood up and he came to me and started kissing me open-mouthed as he was pulling me towards him. I walked away and I sat down in a chair.\" - A former contestant on \"The Apprentice\" describes alleged unwanted sexual advancements made by Donald J. Trump. More: @webpagelink"},{"comment_id":"10154453575369087","commenter_b":"I love it.","commenter_a":"And Trump is right once again! Meryl Streep is a piece of s***!","post_message":"Donald J. Trump: \"Meryl Streep, one of the most over-rated actresses in Hollywood, doesn't know me but attacked last night at the Golden Globes. She is a Hillary flunky who lost big.\""},{"comment_id":"10153512388783812","commenter_b":"She is not dark skinned!!! I sorry she is screwed up!","commenter_a":"Love her tan. What's her secret? Lol","post_message":"A timeline of Rachel Dolezal's transition from a young white girl with blond hair to a darker-skinned leader in the country’s oldest civil rights organization: @webpagelink"},{"comment_id":"532815796909000","commenter_b":"Shut up lady","commenter_a":"STOP THIS.........these are two little girls that are living under the worst conditions possible at this time............leave them alone. Can you imagine how hurtful your stupid post are to them? They are teenagers.........they don't need their friends or the public to read your lies and innuendos. The site the the Patriot should be burned at the stake........stop your disgusting posts and leave innocent people alone............","post_message":"The White House is in uproar after Obama daughters caught doing THIS. This is outlandish. These are the daughters of our president. Would you vote to kick the Obamas out of the White House?"},{"comment_id":"10154558604929411","commenter_b":"dont worry Ann, no one would wana rape your fat ass","commenter_a":"What I find terrible is that if anybody wears a bikini they \"have chances of being raped\". Sorry, but France has to keep their country free of this BS. Next time a french woman steps into a pool in a bikini, will she be molested by this woman hating monsters?","post_message":"The pool park has allowed bathers to wear burqinis and jilbab de bains as way of exception"}]
