[{"comment_id":"918539948208123","commenter_b":"I say we hand this trifling hoe to ISIS","commenter_a":"Another oxygen water","post_message":"DISRESPECT for our military and nations heroes is out of control. This is straight up disgraceful! READ HERE---> @webpagelink/ HONOR CHRIS KYLE!"},{"comment_id":"1013860195337176","commenter_b":"Vanessa: Do give Hillary's accomplishments that make you so proud. Are you proud of being lied to?","commenter_a":"The republicans are bunch of jokers ,am so proud to be a hillary supporter.","post_message":"If you're proud to be a Democrat after watching tonight's Republican debate, add your name here: hrc.io/1L9yvI6"},{"comment_id":"10153075316564440","commenter_b":"Sarah, maybe if your homegirl wouldnt act so tough against the cops and complied, she would be alive. she rammed a car towards and now she's dead!","commenter_a":"Wow these damn cops can do what they want that's a damn shame","post_message":"BREAKING: No charges against Denver cops who fatally shot 17-year-old Jessica Hernandez dpo.st/1dSxAU8"},{"comment_id":"10153308250786770","commenter_b":"Even if a guy is into that, I can't imagine him liking those freaky legs.","commenter_a":"If he wants to live as a woman, that's on him, but could someone please tell him if he's going to wear short skirts to put on pantyhose? His legs are ugly & weird looking.","post_message":"\"That will always haunt me,\" Caitlyn Jenner said."},{"comment_id":"10154820857971438","commenter_b":"It's got nothing to do with controlling women, it's got to do with being the voice of the silent unborn. Who protects the unborn when they are being ripped apart because the woman who decided to have unprotected sex asks to butcher the unborn. No one has listen to the unborn small scream when they are being tortured inside their mom's womb. Look it up, and after you hear it and see it, you'll realize that a life, no matter how small, MATTERS.","commenter_a":"They don't. It's about control.","post_message":"I am sympathetic to the pro-life argument, but anti-abortion rallies leave me baffled."},{"comment_id":"10153614987044199","commenter_b":"Disagree. I think she's a hero. Get this psycho off the road.","commenter_a":"I just watched the whole video and I call bs on the mom. She had 4 opportunities to take a turn and drive away from this woman. If you have your kid in your car it's not your time to stand your ground. Let her drive on, pull over let them go on their way, turn down another road go another way home. Don't keep following them especially when they keep randomly braking.","post_message":"UPDATE:"},{"comment_id":"10157177074000354","commenter_b":"And she will continue where he leaves off","commenter_a":"We've had more terrorist attacks on our soil during the Obama administration than on GW Bush's watch. I think Obama is doing a fine job of recruiting terrorists.","post_message":"So the basis of Hillary Clinton's corrupt candidacy is that she is more popular with terrorists? WATCH:"}]
