[{"comment_id":"10153563509195329","commenter_b":"Obviously if you're not as fat as a cow then you're not a real woman","commenter_a":"Dammit! What EXACTLY is a 'real' woman?!?!","post_message":"After years of admiring the models in Victoria's Secret catalogs, we decided to make ourselves into models."},{"comment_id":"1610722349214878","commenter_b":"wow beautiful.......","commenter_a":"Beautiful","post_message":"Wow. I've got chills. God is so good."},{"comment_id":"10153842022041336","commenter_b":"@username. You are a blooming idiot fool!!","commenter_a":"Too egotistical! He will never resign but, he will go down in history as the most Anti-American and incompetent man ever to reside in Our White House without doubt!!","post_message":"“We are in World War III,” Michael Goodwin said on 'The Real Story.' “And if America is not going to lead, who is?”"},{"comment_id":"10152774797039877","commenter_b":"She still in hot water","commenter_a":"So wait a min. Im from cleveland lol. So this boy was 5'7 195 lbs bundled up pointing a fake gun at people in the park with his little sister..... Yea the cops did not have to kill him but no one thinks the parenting is to blame ??","post_message":"Extended Tamir Rice Video Shows Cop Tackle His 14-Yr-Old Sister As She Rushed To Her Dying Little Brother's Aid. Watch the heartbreaking video here. Grio fam, sound off with your thoughts on this extended video."},{"comment_id":"1602376966724515","commenter_b":"@username I am fully aware of who I have voted for since 1992. Hillary Clinton put herself in this position by NOT doing what's right and serving HER own interests. Public Service is a privilege and shouldn't be abused. I look forward to more ethical women running for President in the future, hopefully in my lifetime.","commenter_a":"She puts herself in a coma just hearing herself!! Her own husband is so unimpressed, HE doesn't know her campaign slogan!!","post_message":"LIVE NOW: Hillary Clinton early vote rally, Cedar Rapids, Iowa"},{"comment_id":"560649254116954","commenter_b":"Lady you are just plain stupid.","commenter_a":"I want to see a Sanders-Trump debate. If you think Hillary would wipe the floor with Trump, Bernie would \"bern\" the floor with Trump! Either way, Trump is a Loser.","post_message":"Wonder what a Hillary Clinton/Donald Trump debate would look like? Take a look."},{"comment_id":"10153987186985329","commenter_b":"Fuck off bitch","commenter_a":"Dorotea Lazio Batistoni I'm ded","post_message":"It's finally happened."}]
