[{"comment_id":"1265082296896088","commenter_b":"Women get no opinion in Adolf Trump's amerikkka. So stfu and get back in the kitchen","commenter_a":"But not the recount in Detroit, where there r more votes than voters now. Not Russian--democratic votes.","post_message":"Trump supporters are calling the effort undemocratic. What do you think?"},{"comment_id":"1027693250616162","commenter_b":"Suck","commenter_a":"@username 1mbps","post_message":"The technology is able to transmit up to 224 gigabits per SECOND."},{"comment_id":"1059194827547028","commenter_b":"He is not even their president. Or that is what their signs say. Besides, they will not be part of the US for much longer.","commenter_a":"Richmond? Bwahahahah! Crime central.","post_message":"So this just happened..."},{"comment_id":"425066681021905","commenter_b":"That woman should of been kicked out.","commenter_a":"Look what we just missed- Wendy Rowe Ristine-#noblackfriday #somepeoplejustsuck","post_message":"Look at what a woman just did to a child at a Black Friday Sale."},{"comment_id":"10153075316564440","commenter_b":"Sarah, maybe if your homegirl wouldnt act so tough against the cops and complied, she would be alive. she rammed a car towards and now she's dead!","commenter_a":"Wow these damn cops can do what they want that's a damn shame","post_message":"BREAKING: No charges against Denver cops who fatally shot 17-year-old Jessica Hernandez dpo.st/1dSxAU8"},{"comment_id":"10152522846320163","commenter_b":"She look real old","commenter_a":"I understand you wanna be different usher but pleases you should've stayed with Chili at least she's older but don't look it.","post_message":"It’s Official: Usher is engaged to longtime girlfriend Grace Miguel... check out her gorgeous ring here @webpagelink"},{"comment_id":"10153373038333855","commenter_b":"Kill this witch","commenter_a":"She wants every legal consequence possible so she can be a Christian Martyr!","post_message":"BREAKING: Kentucky clerk defies Supreme Court."}]
