[{"comment_id":"774112892726570","commenter_b":"Shit up traitor go suck on Hillary's nipple","commenter_a":"Know why? Because your last name means he who sands as in sandpaper.","post_message":"Boom. #DemocraticDebate #DemDebate"},{"comment_id":"10156566417190354","commenter_b":"Lets oblige her in a dumpster; place for Islam garbage.","commenter_a":"Did you know bullets and explosives have pig by products in them ?","post_message":"Her full statement is unbelievable..."},{"comment_id":"486025081592014","commenter_b":"I really really want her to go to jail","commenter_a":"This lying bitch only knows how to take care of her greedy self!!!!","post_message":"Hillary Clinton criticizes Republican Donald Trump's tax plan, calling it \"trickle down economics on steroids.\" Do you agree or disagree with Clinton on this?"},{"comment_id":"1143510442327091","commenter_b":"I will personally go to the Springs to make sure this woman is defeated in her next election period!","commenter_a":"Time for her resignation!","post_message":"“The true instigator of this violence and all violence at any Planned Parenthood facility is Planned Parenthood themselves.\""},{"comment_id":"10154414829691051","commenter_b":"You've been programed on 30 years of BULLSHIT that has not stuck, she's not perfect no politician is but to have this mfer win is just off the fucking charts people will suffer from this including me but these racist mfers will suffer a rath of bs way worse when Gw was in office.","commenter_a":"I think it's a good thing. I honestly don't think that America would have a problem with a Female President, I just don't think that America wants Hillary Clinton to be that First Female President. She's got a rough track record, a record that has a lot of corruption and lies written upon said track record, and the American people see that. She's done a lot of great things in her life, but alas, being President will not be one of them.","post_message":"It looks like Hillary Clinton is done with politics for good. Is that good or sad news to you?"},{"comment_id":"1493513274041749","commenter_b":"what a whimp","commenter_a":"The people of france must be so hurt by the utterings a man who surrendered his citzenship because he refuses to pay french taxes and became a Russian citzen instead. Comrade Dipstick needs to shut up","post_message":"'France is populated by imbeciles making wine and stinky cheese for tourists'"},{"comment_id":"663875460469699","commenter_b":"American news you suck! This story in all of their stories are not real! I cannot believe how many people fall for this b*******! Laughing my f****** ass off! Get a life people go spend some time with your families and try to figure out what you can do to help the country! Unbelievable! American news you suck!","commenter_a":"If they don't like our traditions don't come here...That was easy...","post_message":"The Obama administration is trying to ruin your thanksgiving. This is absurd. We can't let him get away with this. Will you still call it Thanksgiving no matter what?"}]
