[{"comment_id":"662547200602525","commenter_b":"When she is burning in hell she will want to change her mind.. buy the way. Put some damn clothes on you look like a tramp.","commenter_a":"She is so gross!","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'. This is unacceptable, we stand against Miley 100%. Do you agree Miley should be kicked out of the country?"},{"comment_id":"1609547186014156","commenter_b":"#BELIEVELAND","commenter_a":"Believeland! Cleveland! Go Cavs!","post_message":"A BIG day for your Cleveland Cavaliers ! They were honored at the White House:"},{"comment_id":"10153565687858984","commenter_b":"JAIL HER","commenter_a":"LIAR like her husband.","post_message":"Hillary’s been caught in another blatant LIE regarding her private email server. In a recent interview, Hillary said she had not been subpoenaed by the Select Committee on Benghazi, but records indicate she was subpoenaed in March 2015. Even the press covered it! Rep. Trey Gowdy won’t tolerate her deceit, and neither will we. Send a message to Rep. Trey Gowdy telling him what you think!"},{"comment_id":"1317863694976546","commenter_b":"She is not his type","commenter_a":"Hillary paid them","post_message":"BREAKING Trump campaign adviser A.J. Delgado tells Brian Williams the allegations of inappropriate touching against Donald J. Trump aren't credible."},{"comment_id":"896920230364507","commenter_b":"Never mix hillerie with religion, she's a sinner !","commenter_a":"Love has no bias, gender, race or labels. First Corinthians chapter 13.","post_message":"\"I was thrilled when you recently urged the Supreme Court to rule in favor of marriage equality. I was like 'That’s our gal.'\"—Mike Yowell, having coffee with Hillary in Council Bluffs, Iowa"},{"comment_id":"989405267747483","commenter_b":"Wrong woman for Obama.....","commenter_a":"What's wrong with Hamilton??","post_message":"Can you imagine? Heads would explode! I am no Randian but she IS the most important female thinker of the 20th Century not to mention the most influential."},{"comment_id":"974401272656125","commenter_b":"If he is not im sure he has been watching and waiting for his next money making endeavor.","commenter_a":"And here come the riots.","post_message":"JUST IN."}]
