[{"comment_id":"10154280774612690","commenter_b":"Maybe you're not an American and you wouldn't understand anyway. Your fear is what leads you.","commenter_a":"After this election, the world has truly changed the way they see us. We have become a laughing stock for electing this idiot. If you can truly say you're okay, and you feel safe with Trump as president and his supporters on anew high, then I envy your privilege. Sit back and watch the fall of the American empire.","post_message":"In the largest Texas border city of El Paso, many people are reacting with fear and anger to the election of Donald Trump as president: @webpagelink"},{"comment_id":"1244894375530590","commenter_b":"all the illegals are not accounted for, so this is false!!!","commenter_a":"Hope it's true","post_message":"There was one big reason for leaving."},{"comment_id":"672876839554418","commenter_b":"'@username that's a stupid comment. Hillary supports killing Gods baby's.","commenter_a":"Hillary would throw her own daughter under the bus to save her own skin! America look out cause Russia is getting pissed at her and sees Hillary as Obama as a white woman.","post_message":"'11% of the American people say that [Hillary Clinton]'s honest and trustworthy. To compare that, the same poll found that 14% of Americans believe in Bigfoot. Now that's what kind of trouble she's in.' – Mike Huckabee"},{"comment_id":"602527166571478","commenter_b":"Certain ppl should stop reproducing","commenter_a":"'@username fuckin retard","post_message":"So Dumb: She Thought She Found A Hack To Charge Her Iphone!"},{"comment_id":"1250451044993129","commenter_b":"Her supporters are indebted to her for what she has connected them with of course you're not going to spit in her eye the whole group including her supported just crave Power by any means necessary and feel they are much Superior to all other beings and should be allowed to run the world according to their plan blow them all out of the water please go vote for the one who loves his country it's the only hope we have","commenter_a":"The love of money is the root of all evil. They should be in jail. Anyone else who did this would be.","post_message":"This is important."},{"comment_id":"1769034086717767","commenter_b":"and this is terrifying","commenter_a":"It's here @username","post_message":"This robot wants a family...and to destroy humans."},{"comment_id":"10153370720431509","commenter_b":"Well the real word is cold and full of corruption and greed. This type of harvesting happens on a daily basis in 3rd world countries, poor desperate individuals selling their kidneys in back allies to rich benefactors. Most illegal organs are stolen form human trafficking.","commenter_a":"Organ harvesting and transport is complicated. You can't just slash a body and grab them out. This sounds like a ploy by the Iraqi govt to get headlines","post_message":"It's a startling claim. If true, what could be driving increasingly extreme tactics #ISIS is employing? @webpagelink"}]
