[{"comment_id":"480718348785412","commenter_b":"She needs to take her husband and leave go back to were ever their home is","commenter_a":"She has no right to tell anyone what they can or cannot eat. She needs to worry about herself.","post_message":"What Michelle Obama is banning now is just plain unacceptable.  The American people are tired and finally fighting back.  Do you agree Michelle Obama should mind her own business?"},{"comment_id":"560732980781661","commenter_b":"GOOD, SHE IS SUCH A RACIST, GET HER OWN SECURITY.","commenter_a":"Good for them let her pay for the security and take a little less pay home...she'll get the message","post_message":"HAHAHA!!! THIS NEEDS 10,000 LIKES!!!"},{"comment_id":"10153901332209411","commenter_b":"Russians shout their own feet. We do not export our high quailty fruit and veggies anymore. Go and import from china the plastic one !","commenter_a":"We have banned all Turkish produce on our global operations since last week...and will never have any trade relations with that country. May it be Diplomatic or Corporate! For as long as it's erdogan's administration.","post_message":""},{"comment_id":"10153647495544877","commenter_b":"@username is fine. Off subject. .but i had to get that out there. Hey boo...","commenter_a":"Let's try something new black America. Let's not break the law and put yourself in a position to get shot and I bet pretty good money u will live. Lol","post_message":"Thousands of Asian-American Protesters Rally in Support of Officer who Killed Unarmed Man in Housing Stairwell. Watch how it all unfolded below.   Grio fam, protesters said this is '1 Tragedy, 2 Victims.' What's your reaction?"},{"comment_id":"10155548661776509","commenter_b":"You are right, it isn't Trump supporters, this latest hidden Veritas video will give you a hint: @webpagelink","commenter_a":"I don't think it was Trump supporters who did this, everything is spelled correctly.","post_message":"Vandals set this black church ablaze and scrawled the words \"Vote Trump\" in crude, white spray paint. @webpagelink"},{"comment_id":"1007038892685973","commenter_b":"Liar liar","commenter_a":"@username for President of the United Sates of America, 2016-2024!!","post_message":"Read the texts Hillary sent some friends last night during the GOP debate."},{"comment_id":"1750245355240943","commenter_b":"While the twins are cute. How's this building the black community? She is in dishonor. She dishonors her ancestors.","commenter_a":"See what happens when we come together as a people? We produce beauty!","post_message":"These cuties went viral after their emotional discovery of their age difference. Now, we get to meet the adorable #McClureTwins & their parents!"}]
