[{"comment_id":"10157098525125354","commenter_b":"OR...build a wall to protect OUR country. Go back to Kenya - YOUR HOMELAND!","commenter_a":"Fuck him!","post_message":""},{"comment_id":"439880426200251","commenter_b":"Awesome we need more women like her.","commenter_a":"I would done same","post_message":"Don't mess with this mom..."},{"comment_id":"10153043842829411","commenter_b":"This Germans are only the progeny of the stupid Jews that survived the holocaust.","commenter_a":"Look the Nazi are back.","post_message":""},{"comment_id":"1289522947781268","commenter_b":"Spoiled racist brat","commenter_a":"Michelle Obama is the most bitter, most racist First Lady in recent history.","post_message":"First lady Michelle Obama implied this week that many Americans no longer have hope because of Donald Trump's victory.  Thoughts?"},{"comment_id":"1726486197616166","commenter_b":"She needs a male beside her. They wont vote for","commenter_a":"Love my Senator, Tim Kaine. But Elizabeth Warren should be the Veep pick. Please make it happen, Madame Secretary!","post_message":"Watch live as Hillary and Senator Tim Kaine take the stage in Virginia ⬇️"},{"comment_id":"10153177262869205","commenter_b":"Christmas is actually a pagan holiday as is Halloween.","commenter_a":"Saying public schools shouldn't close for holidays includes Christmas people therefore if schools were to remain open on that holiday you'd end up bitching because your kids had to be in class on Christmas! Everyone should have the right to observe religious holidays due their beliefs even if its just a personal day off!","post_message":"Should Schools Close on Muslim Holidays?  h/t AJ+"},{"comment_id":"531107707082073","commenter_b":"What a bunch of trash. Next time get up and yell back and pin them against the wall. Come on white people stop taking this shit from these thugs!","commenter_a":"We need to start taking care of business.","post_message":"\"...screaming racially motivated chants such as, “F*ck you, you filthy white f*cks!”, “F*ck you and your comfort!”, and “F*ck you, you racist sh*ts!” One girl was even reported to have been pinned by protesters against a wall, who allegedly shouted “filthy white b*tch” in her face.\""}]
