[{"comment_id":"1284879431547513","commenter_b":"ve que no es vara :)","commenter_a":"@username Sergio Boudet lo que hablabamos el otro dia","post_message":"Colorado kept $1 billion away from drug cartels last year."},{"comment_id":"1174393302606728","commenter_b":"I want my money back it is ugly and doesn't make her any better","commenter_a":"She could wear a 100,000 and it wouldn't help her looks","post_message":"Woman of the People"},{"comment_id":"10153517390897293","commenter_b":"TRUMP KNOWS HOW TO NEGOTIATE! Politicians see how you get things done! Everyone is talking about Trump, and he doesn't have to pay a penny! Awesome! This is a Revolution for Trump like I have never seen in my 63 years! Go Trump! The man with COMMON SENSE! Obama was bought by the Communist Billionaire George Soros. Soros' main objective is to destroy America. Soros is now buying Hillary. NEWS MEDIA IS BRAINWASHING AMERICA TO HATE TRUMP! The people who have ruled America behind the backs of Politicians they have paid to win will lose a lot of MONEY if Trump gets elected. Who are these people, well some of them OWN NEWS MEDIA STATIONS! How many World Leaders have been paying Politicians to run so they could have a payback when the Politician got into power? Notice how much money America sends to other Countries? Think about it, WHO ...","commenter_a":"Waaaaah.","post_message":"He's out of Thursday's debate."},{"comment_id":"458998460955114","commenter_b":"Jamie....... Your mamma should have swallowed !","commenter_a":"I got to admit governor Abbott has some big huevos and strong backbone exactly what is lacking in congress n Senate to stand up to that pos obama","post_message":"Texas is not playing GAMES..."},{"comment_id":"10153417590345329","commenter_b":"Nah,cause then feminists will bitch.","commenter_a":"Stop that already! Or make MomBodies a thing!","post_message":"DadBody goals right here via Leonardo DiCaprio."},{"comment_id":"10153727755939117","commenter_b":"@username If Trump were a cat, he would be licking his own balls.","commenter_a":"And the Republican leaders of the past, McCain, Romney, and the entire Bush family? They recognize a fraud when they see one and won't even bother attending, endorsing or having anything to do with a bully liberal like Trump.","post_message":"The list of GOP convention speakers includes a bunch of people better known for harshly criticizing Donald J. Trump, in some cases unambiguously pronouncing him unfit for the presidency. They say he's a \"con artist,\" \"narcissist,\" \"bully,\" and \"pathological liar\" whose candidacy is \"a cancer on conservatism.\""},{"comment_id":"10153243300499087","commenter_b":"She's a flaming idiot","commenter_a":"She is one sick BITCH !!!!","post_message":"\"I am a devout, practicing Catholic. I’m a mother of five children. When my baby was born, my fifth child, my oldest was six. I think I know more about this subject than you, with all due respect,\" Nancy Pelosi told a CNS News reporter. WATCH:"}]
