[{"comment_id":"10152847470758869","commenter_b":"that's pure BS... ok, Stewart is above the silly vampire stories here, but Binoche is one class above her throughout the film ... and in general","commenter_a":"I haven't seen the film, but I highly doubt that Binoche is nondescript: her screen 'presence' is astounding.","post_message":"“It is [Stewart], rather than Binoche, who lingers in your mind when the film is over.”"},{"comment_id":"10154963089002619","commenter_b":"basically right","commenter_a":"Israel will have no true peace except for a short while when the Antichrist sets up his kingdom there during the tribulation period Israel will have a false peace for 3 1/2 years.Jerusalem will again be trampled down by the gentiles for a short spell and then Armageddon.and then Christs return to stop the madness.","post_message":"“The chain of attacks from Paris to San Bernardino, from Istanbul to the Ivory Coast and now to Brussels, and the daily attacks on Israel, this is one continuous assault on all of us.”"},{"comment_id":"10154945952871037","commenter_b":"Wow, I honestly thought I was the only one.😢","commenter_a":"I was diagnosed with PTSD after being sexually assaulted as well. It disgusts me that so many people dismiss it as someone playing the victim card or seeking attention. Believe me, no one wants PTSD or to be sexually assaulted.","post_message":""},{"comment_id":"849791398402742","commenter_b":"Well you be sure to let all those people know where that magic land is where all those wonderful jobs are just growing on trees!","commenter_a":"I think this is great. People will no longer abuse welfare and will actually get up and find a job.","post_message":"Arizona's Legislature cut $4 million from the budget by reducing the maximum time you can be on welfare from 5 years to 1 year. Critics say that it will cut funding for those who need it and can't find jobs. Supporters say it will encourage more to get off welfare and find work. What do you think?"},{"comment_id":"10153915924607217","commenter_b":"The most and popular muslim holy wars, were against the Romans and Persians. because they were arrogant and in face of God wills.","commenter_a":"Not forgetting the millions of Hindus killed by Muslims in India ..one of the world's greatest forgotten genocides","post_message":"The fire at the Islamic Center of Fort Pierce may have been timed to coincide with the Muslim holiday Eid al-Adha and the anniversary of the 9/11 attacks."},{"comment_id":"1820054648241595","commenter_b":"I agree the farther him an his tranny wife are from the white house the better !","commenter_a":"What is wrong with you people. Thank God he's on vacation and not going to get involved and make things worse!","post_message":"Nothing gets in the way of Barack Obama's golf game."},{"comment_id":"442004659257462","commenter_b":"Go home!","commenter_a":"The only thing that fat slob would bring to the White House is big-Big-Big Plate to feed his fat ass off of.","post_message":"Will Chris Christie's tough political style work in the White House?"}]
