[{"comment_id":"10153279358959087","commenter_b":"You're a stupid bitch","commenter_a":"Democrats have become the party that endorses Corrupt Liars. Next time a Democrat points a finger at Republicans they should point 5 back at themselves first.","post_message":"Nearly twice as many Americans say they are unsatisfied with Hillary Clinton’s response to the 2012 attacks in Benghazi as say they are satisfied, according to a new NBC News/Wall Street Journal poll released today."},{"comment_id":"1054816387945602","commenter_b":"Watching these comments I can't help but notice that Obama is almost as popular as burlap toilet paper....","commenter_a":"Will he be pausing to pray to the east immediately following this speech?","post_message":"President Barack Obama comments on #Brexit at the 2016 Global Entrepreneurship Summit."},{"comment_id":"10153389153527169","commenter_b":"Don't despair. I have a niece named Gretchen. You are not alone! ;)","commenter_a":"Try being a Gretchen. I was literally the only one in my entire school all through k-12. I NEVER encounter tiny Gretchens but I'm only 31 so maybe there's still time?","post_message":"Is Your Name Going the Way of the Dodo Bird? (From OZY)"},{"comment_id":"10157133614025354","commenter_b":"Put the bitch in jail once and for all","commenter_a":"It's better to wait until after Obama is president to do anything to her. If something was to happen before then, he would give her a pardon.","post_message":"Don't worry, Hillary. The FBI is just getting all the findings from its one year investigation in order before giving you the chance to lie yet again about how you committed HISTORIC breaches of national security and auctioned State Dept. policies through the Clinton Foundation. #ClintonCash"},{"comment_id":"1272259289466246","commenter_b":"@username, go ride your tricycle on the freeway!","commenter_a":"Funny you take this seriously. Simultaneously dismissing ISIS. REALLY shows your common sense level.","post_message":"Thank you, sir."},{"comment_id":"943485965686825","commenter_b":"Hillary wants to have DNA test to see if Chelsea is hers!!! DUH!!!","commenter_a":"Lol..she looks like Bill.","post_message":"Incredible!"},{"comment_id":"10153866356179087","commenter_b":"@username elillegal means\" elite illegal immigrants living in comfort due to free dows from Obama government, at the expense of us tax payers!","commenter_a":"LOL...Trump is a con artist...serial adulter...pathological liar...crooked businessman who preys on the less fortunate . He uses our vets as campaign props and lies about giving them donations. He funds his own businesses with his political campaign. He refuses to make his tax returns public. Be serious. Trump is the most corrupt individual to be running for office.","post_message":"Donald J. Trump gets standing ovation after saying Hillary Clinton \"may be the most corrupt person ever to seek the presidency of the United States.\""}]
