[{"comment_id":"10154766410094714","commenter_b":"Let us wave a wand and turn you into a woman...then comment about this. Have a nice day!","commenter_a":"Wow! All of a sudden women in distress coming forward. I wonder how many more will jump on the dollar filled band wagon? Doesn't this look a little suspicious? Clinton filling their pockets!","post_message":"The Donald J. Trump campaign is planning to fight fire with fire: “We’re bringing out tactical nukes now, with thermo nukes later.” @webpagelink"},{"comment_id":"1194953337245391","commenter_b":"😂😂😂","commenter_a":"'@username... it's all about perspective","post_message":"'[Donald J. Trump] was contributing to America by regrowing his business, which now employs thousands of people ... I think that's a better contribution to the economy and to America than pumping into the government, which wastes an awful lot of it.' – Stuart Varney"},{"comment_id":"638502853006960","commenter_b":"I love this picture, can you see michael adams apple. Women do not have one.","commenter_a":"I wonder if she refers to her own mother that way. Btw, the mother who also lives in the White House at our expense.","post_message":"Michelle Obama just insulted mothers everywhere... You'll be furious.  We're sick and tired of hearing about her. Let's make her go away forever.  'LIKE' if we should kick Michelle out of the White House!"},{"comment_id":"1098657656855065","commenter_b":"She's a DOPE, I don't know about Doped up.","commenter_a":"So stupid Andddddddddddddddd Hillary nearly fell stepping off the podium She looks doped up","post_message":"UNREAL! WATCH JOE BIDEN Point Out The Guy Who 'Follows' Him Around With The NUCLEAR CODES Right After Saying TRUMP Couldn't Handle The Codes [Video]  And we have THIS clown in charge?"},{"comment_id":"10153866102494160","commenter_b":"Guess he ought to have plenty of money to go on vacation about ten times a year.","commenter_a":"'@webpagelink payments By Morgan Chalfant Published March 18, 2016 Washington Free Beacon President Obama sought to increase the amount of money available for the federal government to spend on former presidents in advance of his White House exit. In his budget requests for fiscal years 2016 and 2017, Obama proposed hikes in the appropriations for expenditures of former presidents, according to a report from the Congressional Research Service published Wednesday. The report, which discusses the pensions and other federal benefits offered to former commanders-in-chief by way of the Former Presidents Act, specifies that Obama’s 2017 budget proposes a nearly 18 percent hike in appropriations for expenditures of former presidents. He successfully requested an increase in such appropriations for fiscal year 2016. “The President’s FY2017 budget request seeks $3,865,000 in appropriations for expenditures for former Presidents, an increase of $588,000 (17.9%) from the FY2016 appropriation level. The increase in requested appropriations ...","post_message":"Barack Obama's new digs come with a huge price tag."},{"comment_id":"1229955423699206","commenter_b":"Kick there asses and give them thirty days in jail and a ten thousand dollar fine.","commenter_a":"Dump the Trump - Really? - Obummer has divided this Country for the past 7 years.","post_message":"How would you deal with these protesters?"},{"comment_id":"1078464325543429","commenter_b":"'@username , no not dictating whatsoever. She can spend as much as she wants; I won't vote for her.","commenter_a":"You're spending so much personal time with this little girl. Are her parents campaign contributors?","post_message":"I’ll do everything I can to make sure that DREAMers like Karla never have to worry about being separated from their parents."}]
