[{"comment_id":"10153563127821680","commenter_b":"Gotta love how she tries to spin this. No other SOS ever had a orivate, unsecured server in their house. Morning Joe shows her lie repeatedly. @webpagelink She needs to drop out. Even Politifact.com found her statement to be a lie. @webpagelink/ #NeverHillary #BernieOrBust","commenter_a":"I lied and I'm going to lie some more.. Hillary2016","post_message":"\"There may be reports that come out, but nothing has changed,\" Hillary Clinton said. \"It's the same story.\" Read more: politi.co/1P0pUQK"},{"comment_id":"1729018337314031","commenter_b":"Hello everyone,my name is sandra from the united state,getting my lover back was what I least expected and could never imagine,my lover and I were together for five years,but all of a sudden he changed completely and turned away from me and I had no idea what was going on,I tried asking him why but he refused to tell me what the problem was,as time went on he sought for a breakup,I was so worried and confused but I never gave up on him until I met an old friend of mine who had a similar problem,she told me about a spell caster called alakijaoogun who helped her situation,I never used to believe in spell casting in my entire life because I never taught it could work for me but to my greatest surprise it got me a positive result and I was able to get my lover back,even after ...","commenter_a":"i think she has thrush","post_message":"Miley Cyrus delivered quite a statement to Donald Trump..."},{"comment_id":"10150782154259999","commenter_b":"I'm a woman and I am voting Sander's. Actually MOST women I know are voting Sander's. I won't vote for Hillary. I'm done with the Clinton's.","commenter_a":"Cue 8,000 virtually identical comments by Bernie Bots, clogging up the comments so no one else can be heard. All nearly identical, all arriving at the same time. Almost like some sort of organized social networking plan. Feel the burn.","post_message":"\"Some folks may have the luxury to hold out for the perfect, but a lot of Americans are hurting right now, and they can’t wait for that. They need the good, and they need it today,\" Hillary Clinton said today."},{"comment_id":"517613611762552","commenter_b":"@username must be an ignorant stinking liberal!","commenter_a":"Why can,t we ban liberals ???????","post_message":"Liberals are trying to get rid of one of your favorite snacks. Stop being so sensitive. We need to put a stop to this. Do you agree Liberals pushing their beliefs on you?"},{"comment_id":"930468930346189","commenter_b":"It's an interesting idea but she is much older. Re pose these with young girls and I guess there would be little difference.","commenter_a":"Stop making stupid people famous","post_message":"Fashion ads recreated by a normal woman"},{"comment_id":"10153437934696943","commenter_b":"Hillary did. She locked herself up in closet to take him down. That was when she lost her bar license for being both unethical and lying.","commenter_a":"Frankly, the Obama presidency, with all its scandals/crimes, has set incredible legal precedence for defendants to get away with almost anything, from lying, to destroying evidence, to treason, to tax evasion, you name it. Now, anyone accused of anything can simply demand equal protection and have their attorneys cite any one or all of the Obama Defenses.","post_message":"*** UPDATE *** This was a very big week for us, with tremendous results! As has been widely reported, we found almost a five-month gap in the emails Madam Hillary reluctantly returned to the State Department last year. But there more to the story..."},{"comment_id":"10158461091345206","commenter_b":"I wouldn't put it past that liar!!","commenter_a":"Dan Elsa","post_message":"“Early in Clinton’s tenure as secretary of state, she and her staff were observed removing lamps and furniture from the State Department which were transported to her residence in Washington, DC.\""}]
