[{"comment_id":"521171901404436","commenter_b":"No I sure hope they stop these refugees from coming to our state in Arizona!!! Don't want them here!!!","commenter_a":"Come on fla...join texas","post_message":"Is your state in this MAP?"},{"comment_id":"10155082864963690","commenter_b":"India and rape can't seem to stop. :(","commenter_a":"indian armies ..............thuuuuuuuuu........","post_message":"\"Victims gave the names of the policemen involved in the barbarity - but nothing has happened.\""},{"comment_id":"1711755495764368","commenter_b":"Where all her pussy friends at doeeeee 🤔😂😂","commenter_a":"@username 😂","post_message":""},{"comment_id":"620966654718777","commenter_b":"She is the most horrible stupid idiot that has ever lived. Look at all the destruction she has caused even after her death.","commenter_a":"Neither did Karl Marx.","post_message":"Two attempts -- one small, one large; one entirely private, one government-backed -- have both come to the same conclusion: Ayn Rand didn't understand squat about real-world capitalism."},{"comment_id":"1838073153099439","commenter_b":"Well, she's certainly dum enough for the part!","commenter_a":"But she looks like Hulk Hogan","post_message":"Amy Schumer has been cast to play a blonde doll with impossibly perfect physical proportions...."},{"comment_id":"10158325140525725","commenter_b":"Yea !! Thank god that I wouldn't waist my time on those losers !!","commenter_a":"If they gave them to me I wouldn't go !!","post_message":"Looking to get out of last-minute Christmas shopping or away from your in-laws? Then Saturday's Chicago Bears home finale could be your answer."},{"comment_id":"10153904419513984","commenter_b":"She's an ass","commenter_a":"Yeah the photo says it all...\"wha happened?\". Stick to acting, your moral compass is effed up. Be a kinder human being to your fellow humans, not to tou 1%er peers. Thiugh phony and shallow does fit you well","post_message":"She's the biggest female star in Hollywood right now, and she just made a sickening claim about Christians and the cross of Christ.  This is just disgusting.   She has a new movie out. Let's make sure she doesn't make a dime off of us!"}]
