[{"comment_id":"10156788493850389","commenter_b":"My family and friends in Utah are behind Trump!","commenter_a":"Please Utah vote Trump!! He cares about We the People.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154239816884197","commenter_b":"'@username Oh, you're so right. High capacity horsepower cars are designed to kill people. High capacity weight vehicles are designed to kill people. We need to ban all cars. They are designed to kill people.","commenter_a":"Maybe we should hold automobile manufactures accountable for deaths caused by automobiles. We should hold knife manufactures accountable for stabbing deaths. Train manufacturers accountable for death by trains. I can keep going on but the PERSON is to blame not the object.","post_message":"It's been a hot topic. Where do you stand? Vote in our poll: @webpagelink"},{"comment_id":"10154265505298188","commenter_b":"Ugly woman???","commenter_a":"Ugly jacket!","post_message":"The hypocrisy of these progressives is beyond shocking."},{"comment_id":"10153044647531680","commenter_b":"For such a homely woman, she certainly is getting a boat load of dates all of a sudden.","commenter_a":"Go ahead and meet her! Just turns off every moderate republican and makes him that much more of a joke.","post_message":"Ted Cruz, whose staff has been in touch with her lawyer, plans to visit Davis at the Carter County Detention Center, where she is being held, in the early afternoon."},{"comment_id":"10153165727051770","commenter_b":"No to Muslim Migrants..call congress..made four calls today..totally agree..Europe is in chaos..rapes and violence..and the media does not talk about it","commenter_a":"Yes sir, exactly what we need. Thank you for caring for the true Americans.","post_message":"BREAKING: Donald J. Trump calls for a moratorium on allowing Muslims to enter the United States.  'Until we are able to determine and understand this problem and the dangerous threat it poses, our country cannot be the victims of horrendous attacks by people that believe only in Jihad, and have no sense of reason or respect for human life.'"},{"comment_id":"1041402059258074","commenter_b":"But Brandon. . .who do you think PAYS for their jail time? You do and are you willing to pay for all illegal's jail time along with all the criminals we already have in our prisons?","commenter_a":"Why we would give anything to a illgale alien is news to me.don't get me wrong immergration is great if done legaly. All illeagle aliens need is about 5 years in prison then immeaditly deported.","post_message":"Ready for Americans to put American priorities first!? It's that easy!  FOLLOW US!----> Freedom Daily"},{"comment_id":"1391871914162547","commenter_b":"U r an Angela,go take every Muslims come back ur home","commenter_a":"You guys are all so worried about making jokes about Obama. How about we worry about the children who lost their lives and the parents that have to adjust to a life without their babies? My goodness!!!","post_message":"Witness describes seeing the gunman at Munich, Germany, McDonald's, killing children. @webpagelink"}]
