[{"comment_id":"903161916494805","commenter_b":"'@username because of disparate impact and disparate action. White people can get up out of bed, run a comb/brush through their hair and be out the door in five minutes. Blacks cannot do that so much, unless their hair is cut to their head--shaved. The rules negatively impact Blacks because without those styles, there isn't much left without using relaxers or paying for extensions. When rules or laws are placed for everyone as is here, but negatively impact one racial, religious, gender group, then it's discrimination and needs to be stopped.","commenter_a":"Can I ask an honest question? In that school, is there a ban on long slick hair, mullets or any other 'white hairstyles'. If so then I can actually understand the ban. But if there is no ban on 'white hairstyles' like long slick hair, but there is a ban on 'black hairstyles,' then yeah, i agree, it is discriminatory.","post_message":"This school just banned traditionally black hairstyles  and people are outraged.  #MicBrights"},{"comment_id":"10154236917854726","commenter_b":"Hillary must never be allowed into the White House.","commenter_a":"What about these rides on that billionnaires plane!","post_message":"Media pushes war-on-women narrative against GOP while ignoring indiscretions of Bill Clinton."},{"comment_id":"10156250216360354","commenter_b":"Twisted woman","commenter_a":"So, she is trying to say she is with them as a fellow commie? I think someone farted.","post_message":"Yeah, so, um, this happened..."},{"comment_id":"421520308036263","commenter_b":"What is this group that has an American flag on the ground to be trampled ?","commenter_a":"stupid ASS COPS.","post_message":"'I went to pick it up because it doesn’t deserve to be on the ground.”"},{"comment_id":"10153199106634071","commenter_b":"Get her a group of body guards while you're at it","commenter_a":"M","post_message":"A $48.5 million diamond for a 7-year-old girl."},{"comment_id":"10153602906656509","commenter_b":"You can buy them too.","commenter_a":"I think she means she wants to make a lot of money. Those GEDs aren't cheap.","post_message":"Is America ready for #marijuana moguls? Follow one young couple's journey as they attempt to franchise legal marijuana  @webpagelink #HighProfits"},{"comment_id":"10153091761007016","commenter_b":"Please take me off Your facebook","commenter_a":"Obama: Pardon Chelsea Manning","post_message":"'The U.S. intelligence community is in a very poor position to be trusted with protecting civil liberties while engaging in intelligence work,' writes Manning. 'When you’re a hammer, everything looks like a nail; when you’re a skilled intelligence professional, everything looks like a vital source for collection.'"}]
