[{"comment_id":"10155832964064062","commenter_b":"But you're gonna pay for that wall?? Here's some facts no fake or false ones where are you getting your info?? Russia? @webpagelink @webpagelink And if you make that much good for you hire trumps tax attorney trump hasn't paid for taxes you're crying about in 20 years, It'll help offset the insurance cost. I'm sure you can afford it.. And again democracy is majority of the vote as for the illegitimate vote why don't you believe the fact it was tampered with to make trump win? Guess 2+2 never equals 4 ..he won with little more than 25% of actual registered voters now tell me how that works?? As for God's being in government it's expressly written to be kept out by our founding fathers ..called separation of church and state.","commenter_a":"I feel sorry for the people who actually believe in him. They need God in their lives, seems as nothing in this earth can convince them they are being screwed lied to and alienating half of the world. Keep drinking that kool aid let's see what shambles we are left in.","post_message":"President-elect Donald Trump defended a plan this morning that would see the U.S. initially pay for a border wall with Mexico and be reimbursed at a later date."},{"comment_id":"10152922353911051","commenter_b":"Someone should dangle her nasty evil ass with their hands around her fu****g neck!!!! evil bitch","commenter_a":"I'm sure the mom had a tight grip on the child when she did that. In saying that I'm hoping the kid was being punished for doing something really fucking stupid for her to take it that far","post_message":"Neighbors couldn't believe that a mother would do something like this to her young son."},{"comment_id":"10153580246221636","commenter_b":"Where we going? X","commenter_a":"@username when that degrees done, emigrate xx","post_message":"It's getting more and more expensive being a student"},{"comment_id":"1701853746697814","commenter_b":"Dan Chow I maybe a old , but I am not fool !! I been follow Hillary since She was First Lady !! I know how amazing She is !! If you care to know the true about this Lady !! Check: ADDICTINGINFO.ORG list of @username accomplishments !! This are the Facts !!!","commenter_a":"2008 was a President Obama Time !!! <3 Hillary is that Leader for this TIME !!! <3","post_message":"In 2016, everything we’ve accomplished together is on the line."},{"comment_id":"735303209993590","commenter_b":"Goog God.Shouldnt there be a law against ugly girls in bikinis?","commenter_a":"Probably wearing a swimsuit!!!","post_message":"What Chelsea Clinton Was Just Caught Doing Could Destroy Hillary's Campaign This puts Michelle Obama to shame. Do you think Hillary Clinton would make a horrible president?"},{"comment_id":"10154161190123837","commenter_b":"Some psycho wife probably found out and messed it all up for everyone, typical.","commenter_a":"Lock her up!","post_message":"DOLLS BEAUTY SUPPLY: This business wasn't attracting women to buy cosmetics. Detectives believe it was attracting men to pay for sex."},{"comment_id":"10153747063291336","commenter_b":"I agree with him we don't need any more illegal Mexicans in the US","commenter_a":"Even dead Trump is making money! Trump 2016!","post_message":"A former NYPD commissioner is warning Donald J. Trump to not take the purported threat lightly."}]
