[{"comment_id":"10154113353450329","commenter_b":"@username the souls one makes me think of you lol","commenter_a":"Elyse Landolfi","post_message":"keep it simple"},{"comment_id":"10153950585516491","commenter_b":"I really wish it had been 'Let the bodies hit the floor\" by Drowning Pool","commenter_a":"What this guy have to do with music? This show is a joke nothing to do with real music talent onlyma bunch of show offs","post_message":"Michael Phelps:  \"I might have a lot of gold but this guy’s got all the platinum.\""},{"comment_id":"1052426431445034","commenter_b":"You do realise the Weasel is trying to kill the Woodpecker, right ?","commenter_a":"Nature is amazing! Humans could learn from it.","post_message":"This amazing photograph shows a weasel RIDING a woodpecker!"},{"comment_id":"10154140456978256","commenter_b":"Sara Califf.....Illinois doesn't have a taxing problem... They have a spending problem.... Bloated government is Illinois problem.... Too bad the pensioners are the ones who will suffer","commenter_a":"Democrats need to raise taxes to keep Illinois, and Chicago government revenue stream to maintain the bloated government.... Probably need to build a wall around Illinois first, to keep resident's from leaving for other states","post_message":"Election-seeking Illinois Comptroller Leslie Geissler Munger plans to delay monthly paychecks for lawmakers and statewide officials, saying there isn't enough money to pay the state's bills and other services should go to the front of the line."},{"comment_id":"10153961468913132","commenter_b":"@username she better step away from my man","commenter_a":"@username @username @username I'm sure you've already heard, but it's foreal.","post_message":"So it IS true! Happy for Gwen Stefani and Blake Shelton. <3"},{"comment_id":"539522582917416","commenter_b":"Well screw the NBA Players . . . pansy ass bitches!","commenter_a":"WHO GIVES A BIG RATS ASS WHEN YOU BACK A LOSER !!!!!","post_message":""},{"comment_id":"10152921219620090","commenter_b":"@username , do not believe Florence , we everybody chosen by God. Not Jew , only, hahahaaaa","commenter_a":"Israel can take care of itself! We need to take care of USA and quit spending, spending, spending!","post_message":"We're proud to stand with Israel & stand against terrorism.  We're calling on Arab governments throughout the Middle East to help advance this goal. Join us, here: @webpagelink"}]
