[{"comment_id":"10153513530884456","commenter_b":"Yeah right. @webpagelink","commenter_a":"I have learned through the years that you initially say what is in your heart. Her statement trying to brush away her post is BS and everyone including herself knows that. Her feelings will not change, she will simply do a better job of hiding them. The commission and the public should call for her resignation.","post_message":"An elected Montgomery County official has released a statement following a controversial post on Facebook, which has sparked outrage among Montgomery County leaders and citizens. @webpagelink"},{"comment_id":"466812640175338","commenter_b":"Hang tee bitch.","commenter_a":"Close all borders indefinitely. NOW","post_message":"Muslim Refugee Beats And Rapes Woman In North Dakota While Yelling 'Allahu Akbar' [VIDEO] It's starting to happen in America. We cannot allow any more refugees into the U.S. Do you think we should close our borders to refugees?"},{"comment_id":"859144567515130","commenter_b":"I did walk in the shoes of a LEGAL immigrant. We get that money gets you here either way legal or illegal. But when you lack respect for laws you come here illegally when you respect them you come here legally. Trust me I get the escaping from violence and your family is in danger side of it. There are avenues if that is the case in these days for emergency immigration if you fit the criteria.","commenter_a":"Si se puede! We are all immigrants and thats what makes up the USA !","post_message":"\"We love this country. We want to belong. We want to come right with the law...we don't like living in fear. We want to be out of the shadows.\" -Gaby Pacheco, DREAMer"},{"comment_id":"1786545848249097","commenter_b":"@username What's that? No one has been able to get him to say what that is. Oh I forgot, he's going to build a wall.","commenter_a":"Agree Obama put us in a real position with his foreign policy. Now all the people saying Hillary should be our next president she is just as bad or worst then Obama. We need Trump to get in office and try to clean up there messes !!!","post_message":"House Speaker Paul Ryan says \"Our enemies no longer fear us and too many of our allies no longer trust us,\" all because of President Obama's foreign policy. Do you agree or disagree?"},{"comment_id":"10153832289717061","commenter_b":"Wow. This mf","commenter_a":"Only 1 million?","post_message":"Taylor Swift vows to donate $1 million to relief efforts in Louisiana after devastating flooding damaged 11,000+ homes."},{"comment_id":"396542397200035","commenter_b":"And that's why Racism is continuing on!","commenter_a":"RACISM IS ALIVE AND WELL! However, I DON'T CARE. PEOPLE OF COLOR ARE MOVING UP! YEP! Moving on up. 👍👍🇺🇸😛","post_message":"One of the most dangerous myths about hatred of black people is that it will disappear on its own. Dylann Roof was born in 1994."},{"comment_id":"10153432953951130","commenter_b":"Its not hard at all. Check craiglast there everywhere. I can sell you mine. Thats the point!!","commenter_a":"It's such a pain in the ass to get guns now. Why would anyone want more gun laws?","post_message":"A majority of Americans want stricter gun laws, and now we have the poll numbers to prove it."}]
