[{"comment_id":"1769368463122894","commenter_b":"I mean, I don't know who tf this woman is but I'm guessing she didn't mean it how everyone thinks she meant it","commenter_a":"People have blown what she said way out of proportion. Please read the article and really absorb what she actually said, a lot of people read but don't understand what they are actually reading.","post_message":"What a moron"},{"comment_id":"902999723068783","commenter_b":"The ones he just released did return to the battlefield and for a traitor that is a fact ! Stop with Bush,","commenter_a":"Impeach him now ! Sending prisoners to the battle field is treason !","post_message":"The WORST!"},{"comment_id":"10153874605884270","commenter_b":"Jagdeep Singh Jagge sir, you need to study english literature. Also, Japan is/would be a US ally over China. You can not live in the past. Basing a country's actions on what happened nearly 100 years ago now is folly. The world and possible battlefield is ever changing.","commenter_a":"Japan technology is far ahead thn china, just they don't showof or not interested in military anymore after world war2(japan use less than 1% of his gfp for military).","post_message":"There has been a dramatic increase in sorties for the Japanese in the past year."},{"comment_id":"10153075666953812","commenter_b":"Inhuman barbarism was the assassination in Paris. Please accept honest condolence to families.","commenter_a":"Prayers for all!!","post_message":"BREAKING: French president: 12 dead in \"terrorist operation\" on Paris-based satirical magazine: @webpagelink"},{"comment_id":"10150636075789999","commenter_b":"Lmao is this satire","commenter_a":"@username remember when we were talking about this at work the other day","post_message":"The tyranny of \"resting bitch face\" is real."},{"comment_id":"485867691579702","commenter_b":"Sad to say but our state has that stupid caucus! Thanks to our friend Reid!","commenter_a":"Amen @username!","post_message":"Greetings from Ben Carson High School."},{"comment_id":"401586413362986","commenter_b":"Cut off her welfare check!","commenter_a":"and they raised a boy? No wonder","post_message":"Michael Brown’s mother decided to show her true nature when she said this..."}]
