[{"comment_id":"2205226956370072","commenter_b":"OK so pack your bags and GO...Your people didn't come here to dominate the world and spread hate.","commenter_a":"He was born in New York and he says he's an immigrant? I'd say this chap has been sniffing too much airplane glue. Yeah, if he wants to be deported, make him the first astronaut on Mars.","post_message":"NY-Born Governor: 'If There is a Move to Deport Immigrants, I Say Then Start With Me' [VIDEO]"},{"comment_id":"10153286761179586","commenter_b":"The same with all Zoo's and not only seaworld. But if he or she is born in a Zoo or seaworld, they will have hard time to survive the real world and maybe die of hunger. So what to do? let them live in seaworld or zoo? kill them now? or let them free so they my die a slow dead of hunger because they never have learn how to hunt and survive?","commenter_a":"Assholes!","post_message":"How much space does an orca at #SeaWorld REALLY have? @webpagelink   THIS is why they swim in circles in their tanks.   The chart at 0:20 seconds explains it ALL."},{"comment_id":"1172990589388617","commenter_b":"Bitch","commenter_a":"Marjolaine Morin","post_message":"Shouldn't their legs relax? Why do they curl up?"},{"comment_id":"1262067313806885","commenter_b":"@username ...You are a very smart Lady... 100% correct","commenter_a":"Chris Christie is a bully like Trump. Senator Marco Rubio owned him, Rubio was just trying to get across the truth about what Obama has been doing all along. Is Rubio perfect, NO, but show me one politician who is please. As for his youth, remember John F. Kennedy anyone?","post_message":"The pundits expected a pile-on at the #GOPDebate Saturday night, but Chris Christie was relentless in his attempt to take down Marco Rubio."},{"comment_id":"10154511519316337","commenter_b":"So you're mad cause you're a poor bitch?","commenter_a":"They didn't add he is sitting on a seat worth about $10,000 every on of his jet/ helicopter has gold leaf in on it and don't won't to get it dirty","post_message":"Donald J. Trump tried to be an everyman... on his private jet."},{"comment_id":"1142049429235281","commenter_b":"I'll unzip my dick for you, gurl","commenter_a":"#VoteJillStein!!!","post_message":""},{"comment_id":"470081979849049","commenter_b":"Sure try take away all our guns but let the criminals still have them way to go","commenter_a":"Terrible First Lady","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"}]
