[{"comment_id":"629437257246853","commenter_b":"All I can say she is a stupid bossy bitch. Wtf they need to be kicked out of the whitehouse on their ass and put in prison all the laws they have broken. Don't know why they haven't impeached him yet. It's not racist.","commenter_a":"ugly worthless nigger","post_message":"You'll never guess which word Michelle is trying to ban.  This is ridiculous. Michelle needs to be booted OUT of the White House immediately.  Would you be happy if Michelle was kicked out?"},{"comment_id":"922573247835730","commenter_b":"Two women had enough of him, despite his wealth, and headed for the hills.","commenter_a":"I dont understand how a man with everything can be filled with so much hatred","post_message":"Yep, that just about sums up Donald Trump's campaign.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1412807245405968","commenter_b":"Again....she attacks her husbands victims. She's a POS female.","commenter_a":"Says the woman who stood by her philandering husband on numerous sexual misconduct occasions. And then she attacked the women. She is the one who set women back!! I want a much better role model for my daughter.","post_message":"'When Donald J. Trump says, 'Let's make America great again,' that is code for 'Let's take America backwards,'' Hillary Clinton said."},{"comment_id":"10153049677426051","commenter_b":"She's in her 20's?? Seriously at first glance she looks like an old woman, she needs to lay off the drugs","commenter_a":"Damn.!!!","post_message":"A customer was walking through the Walmart parking lot when she noticed something odd about a nearby green Hyundai. After taking a quick peak inside, she immediately called 911."},{"comment_id":"1559763640995949","commenter_b":"What the hell is wrong with this women? What the hell was she thinking? She is going to jail. What a slime bag.","commenter_a":"Good! She should!","post_message":"Dani Mathers could now face criminal charges"},{"comment_id":"10153774717459726","commenter_b":"She's an angry heifer","commenter_a":"Cows go... MMMMOOOOOOOOO","post_message":"WATCH: GOP consultant Liz Mair says she's going for big money now to sink the GOP front-runner"},{"comment_id":"892938524096132","commenter_b":"Don't hate immigrants--- hate law breakers. Invaders have to be stopped. Tax payers can't afford them. Do it legal or don't come at all.","commenter_a":"Why do you all hate immigrants? Your grandparents were immigrants.","post_message":"In the U.S. House Judiciary Committee, we introduced legislation to strengthen the interior enforcement of our immigration laws by allowing state and local governments to enforce federal immigration law. By doing so, we remove the ability of this or future Presidents – of either party – to systematically shut down portions of the law to suit their political purposes. WATCH:"}]
