[{"comment_id":"10153564532183984","commenter_b":"@username All immigrants who enter LEGALLY are welcome!! We dont need or welcome ILLEGALS. There is a difference.","commenter_a":"I don't understand good, law-abiding Latinos taking a position against following our immigration law and supporting programs that shelter criminals just because they too are Latino. I would be incensed that my good name and that of my race was being damaged by those lawless usurpers.","post_message":"Donald Trump isn’t backing away from his position on illegal immigration and his disgust for sanctuary cities. These policies endanger the lives of innocent Americans, and they must be put to an end.   Obama needs to rethink his plans for amnesty before more Americans die at the hand of violent illegal immigrant criminals.   Sign the petition to block Obama’s plans for amnesty!"},{"comment_id":"10155690406614199","commenter_b":"She started it. First of all she knew it would take her long so why didn't she let him go first. Second of all she poured her drink on him. At it sounds like she isn't very honest. And sorry but she looks like she's on drugs. This is what happens when you push people to far","commenter_a":"I think because she lied and she threw the first thing to get the conflict from verbal to physical either she gets punished or he gets off free. This is soo sexist if a guy threw a drink at a lady and she smacked him in response pretty sure she would get away with it.","post_message":"Police have released surveillance video from an alleged attack at a grocery store that tells a bit of a different story than the one the alleged victim gave."},{"comment_id":"469971939860053","commenter_b":"look its him the bitch","commenter_a":"No way Michelle we have the right. Guns don't look for people to shoot look and see who are the vandals and thieves that are doing the shooting killing their own people","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153879601166545","commenter_b":"Thugs.","commenter_a":"Sometimes it's the company you keep, parents need to know who their kids are hanging out with...and for the people with the insults etc it could be very well your child, then you would think differently, and you will still be help accountable for your ill words against another.","post_message":"Arrest warrants have been issued for three more teens believed to be connected to the Aug. 2 robbery."},{"comment_id":"1195945367091729","commenter_b":"Totally unacceptable. They should be arrested. Deport. Send them back to their country. Can u imagine what they would do if we destroyed their Quaran?","commenter_a":"Kick them out of our country now they do not need to be here","post_message":""},{"comment_id":"10154362042947756","commenter_b":"I would like to point out, this is myself debating with other women, not only do they act insane, but they will hate on any woman whom has a different opinion, get rid of the illegals, they are a drain on our economy...period, if you don't like, then let them live in your home, your a bunch of rabid animals acting like crazy people...how can anyone ever take you seriously...this was an experiment for my college professor whom wanted us to learn abouy equality...lol","commenter_a":"Well once all the blood sucking illegal's are gone, we can put money towards our vet's and the wall, we all know Mexico is to cheap and lazy to pay for it.","post_message":"President Donald Trump is expected Wednesday to move forward with plans for border wall, increased deportations."},{"comment_id":"10154278216444138","commenter_b":"Ridiculous. Killing all of these gators will not accomplish anything","commenter_a":"Let this had been a black family in a gorilla cage. The media would have been outraged about these alligators lives being snuffed out because of these negligent parents! If is says restricted or no swimming, then they should have checked with the lifeguard before putting their child in harms way!!! Not fair to those alligators and MOST DEFINITELY a tragedy for that child. There are terrible parenting skills on both sides. Black and white. Animal rights should have been on this just like Harambe. But then again, it was never about the animal. These parents should have been charged with the endangerment of their baby. Period.","post_message":"A total of six alligators were removed."}]
