[{"comment_id":"10153811917026162","commenter_b":"Uhhh no!","commenter_a":"@username @username told me you like spiders!!","post_message":"NIGHTMARE FUEL: A puppy-sized spider with fangs strong enough to punch through bone is discovered in the South American rainforest.  For stories you care about -- \"Like\" ABC 7 Chicago!  PHOTOS: @webpagelink"},{"comment_id":"10154390282749411","commenter_b":"Yeah, only to let them in later since we have open borders with yhem","commenter_a":"@username Lessa Katherine but sure.. let them into europe haha","post_message":"'This is my sincere thought'"},{"comment_id":"1226004427434976","commenter_b":"Get rid of her please","commenter_a":"Anyone else would have been fired.","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"572406196218003","commenter_b":"@username bigotry people?!? First learn to compose a literate sentence, then read your comic book.","commenter_a":"Unfortunately, anti-gay bigots never seem to go away since we're still dealing with them 40 years later. When will we, as a people, learn to stop hating people who are different than us?","post_message":"TV's \"All in the Family\" was way ahead of its time.   Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152982491580927","commenter_b":"She is only interested in Pelosi.","commenter_a":"She wouldn't know, hers never started","post_message":"Pelosi:  think I know more about this subject than you, with all due respect."},{"comment_id":"10153113933254071","commenter_b":"Anders Rojas","commenter_a":"Jeyhun OrujovMalek MasAdil Mirzayev","post_message":"$10 million over the already insane $50 million asking price."},{"comment_id":"10153904904228812","commenter_b":"Yes Danold deport all the white supremacist, terrorising the USA. Too.","commenter_a":"this is not even our country lol. Native Americans were here first. If Trump says he will deport all immigrants, he should deport himself first.","post_message":"\"Anybody that's brought into this country from the migration is going to be out,” Trump said at a rally in Knoxville, Tenn., Monday night. “We’re not gonna do it. We’re gonna have a country again, we’re gonna have borders, we’re gonna have a country again, right now we don't have a country.\""}]
