[{"comment_id":"799386623536836","commenter_b":"I guess those two hundred people needed to find a safe place?","commenter_a":"Come to St. Petersburg...right across the bay!!! We're much smarter HERE!","post_message":"\"Of course, we're in Florida, you're going to boo.\" - Amy Schumer after being booed for making jokes about Donald J. Trump"},{"comment_id":"10153014611669138","commenter_b":"\"Land of the free\"? Should be able to go where ever the hell we like! A sign isn't going to stop me","commenter_a":"Sheesh. Just did this last year and yeah it was slippery but everyone knew you did it at your own risk. As for the stairs being closed well you could step over the chain they put to block it. I'm actually taking my boyfriend in the next couple weeks since he's never been.","post_message":"\"The Park Board is disappointed that local media is encouraging this behavior by covering it without explaining that it is dangerous and illegal.\""},{"comment_id":"10156393524070389","commenter_b":"Isis , of course,climate change is a myth! It gives obama something to talk about beside the real problem, his muslim brothers.","commenter_a":"Odummy is the Threat!!!!!!!!!!","post_message":"Question of the Day: Which do you think is a bigger threat: Climate change or ISIS?"},{"comment_id":"1521502694809851","commenter_b":"And once again we don't riot , block busy streets and and make up bullshit like a certain group of people--- absolutely this is murder and a hate crime!!","commenter_a":"absolutely","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news. No riots, no protests, no media coverage. Do you think he should be charged with a hate crime?"},{"comment_id":"10155148038011336","commenter_b":"Trump doesn't refute facts in any logical way. He doesn't present evidence to the contrary, just declares that anything negative about him is fake news. Does this not concern any of you?","commenter_a":"Funny how people have forgotten the numerous times Obama called @username out during speeches, press appearances, and other forums. But Trump doing the same thing is suddenly \"horrible\" and shocking...","post_message":"\"He has EVERY RIGHT to call them out.\" On \"FOX & Friends Weekend,\" Herman Cain discussed President Donald J. Trump's often contentious relationship with some in the mainstream media."},{"comment_id":"10153477021199087","commenter_b":"Needle dick","commenter_a":"What will Obama give them for his release?","post_message":"#BREAKING: North Korea announced Friday that it had arrested an American student for allegedly carrying out \"hostile acts\" against Pyongyang."},{"comment_id":"973671239335036","commenter_b":"She always has been a racist bitch. Where have you'all been?","commenter_a":"Get your head out of your ass and do something productive with your life.","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"}]
