[{"comment_id":"10155086902812235","commenter_b":"UK agrees Americans you created this problem now fix it Europe do not want a war","commenter_a":"How much longer are the American people, the ones who didn't vote this idiot in, going to let this go on, this ego maniac is ruining your beloved country, it is the laughing stock of the world thanks to him, how can any government anywhere take this moron seriously and trust him with anything, he lies through his teeth, blames everyone else for whatever is going on, it has only been 4 weeks and look at the state of things ! My thoughts are with the American people who didn't vote for this buffoon, i hope your country can get rid quick and recover from his dreadful influence !","post_message":"\"I was hoping you could tell me what the f*ck is going on over there?\" - European security services ask."},{"comment_id":"1087648897921955","commenter_b":"Strange how our country hasn't been blown to pieces if all these Muslims are strapping bombs to themselves. I see your high school education didn't get you far. Must have been a sympathy pass..","commenter_a":"Send these filthy vermin back to the cesspool they came from","post_message":"The project was \"totally different from anything the government has ever done,\" Immigration Minister John McCallum said Wednesday."},{"comment_id":"10152731282606051","commenter_b":"She is one sick bitch.","commenter_a":"She takes care of a disaled child and sick husband , I would worry aout what she would do to them as well. The punishment is far to lienient.","post_message":"This lady arranged to have a woman raped after she outbid her for a home. Some say her punishment should’ve been more severe. Decide for yourselves if that’s true."},{"comment_id":"1156510771035618","commenter_b":"Maybe criminals should stop shooting people unwarrantedly","commenter_a":"Maybe police officers should stop shooting people unwarrantedly?","post_message":"Authorities are hunting for the gunman."},{"comment_id":"10153605944168984","commenter_b":"No more abortions no more planparnthood","commenter_a":"My niece had a baby at four months completely formed , she is still so sad about it death , they held and took pictures. I don't know how this is not murder in the womb ? Cause a abortion is! !!","post_message":"Even with all evidence going against them, Planned Parenthood keeps on coming out with one unbelievable excuse after another.  Do you think it's time to defund and get rid of Planned Parenthood?"},{"comment_id":"711540485694496","commenter_b":"The noose tightens.","commenter_a":"Deport him to Russia","post_message":"Dems bringing pressure."},{"comment_id":"538334903023756","commenter_b":"Yes....throw her ass in jail.","commenter_a":"That's what happens when you engage you mouth before your brain","post_message":"The Baltimore prosecutor is about to go down in flames after this.  She is a criminal, just like the rest of them.  Do you agree she should serve time?"}]
