[{"comment_id":"10154377654466729","commenter_b":"parents need to stay in contact with reality when it comes to their kids. pay attention to what schools is teaching our kids. it is all coming together. womans lib, moms are not home any more to pay attention to what kids bring home. homes have been destroyed.","commenter_a":"Those who can, do.","post_message":"Bingo."},{"comment_id":"10155094877376037","commenter_b":"She deserves the same treatment.... sick sick sick nasty woman. She doesn't deserve life","commenter_a":"Where's the picture of the mother?","post_message":"14-year-old Grace Packer was beaten, raped, poisoned and strangled."},{"comment_id":"838447029619520","commenter_b":"Why is that ugly cat so moist.","commenter_a":"Brittany Gallo","post_message":"WATCH: Obi the baby pygmy hippo has splashed into the water with his mother for the first time in front of viewers at the Melbourne Zoo in Australia."},{"comment_id":"10152940506506051","commenter_b":"Put her in jail","commenter_a":"If You all had ids in that school and there was some evidence of wrong doing you would all change your tune you have no right to judge the system until you know the true circumstances","post_message":"A dad went to school to pick up his daughter’s confiscated phone. The school principal refused to return the phone, but offered a different sort of exchange."},{"comment_id":"10153378871661130","commenter_b":"'@username get a life and get out of the reproductive business of women.","commenter_a":"Planned Parenthood is more than abortions and those who only focus on that are very closed minded. I support planned parenthood.","post_message":"The REAL truth."},{"comment_id":"10153792015980695","commenter_b":"Why white woman","commenter_a":"I'm just saying. I would stop if I hit a deer or a white woman. I can tell the difference also.","post_message":"“For someone to know you hit my mom and never even tried to stop or brake, I don't understand that.'"},{"comment_id":"621850294655889","commenter_b":"She's a mean old lady!","commenter_a":"So I wonder who the hater is in this election? Who the bigot is? Who is the person that calls black people Super Predators? Who calls half of America a Basket of Deplorables? Who calls all human beings but elites Little People? #BasketofDeplorables #Superpredators #LittlePeople #HillaryHates","post_message":"When you are president, you are president of all the people."}]
