[{"comment_id":"1142065182546406","commenter_b":"Bye... That just means another wall.","commenter_a":"California can secede from us like texas did. Theyre their own entity but it comes with a price to pay. The time when earthquakes peel it off the rest of the world they can b their own saviour!","post_message":"They're calling it #Calexit"},{"comment_id":"10154791254721756","commenter_b":"And cue the superficial bitch...","commenter_a":"He's ugly as fuuuuck though. Great actor though... Turkey neck goes gobble gobble","post_message":"\"It's a perfect role,\" Jeffrey Tambor says. \"... I thought I was gonna do Lear, but I'm gonna do Maura.\" Season 3 of Transparent comes out on Friday."},{"comment_id":"586245841541886","commenter_b":"Murders need to go to prison!!!","commenter_a":"Thank you Dr Carson","post_message":""},{"comment_id":"10153271515149087","commenter_b":"Stfu old bitch","commenter_a":"God help America if Hillary or Sanders ever become president","post_message":"Bernie Sanders is leading Hillary Clinton by a stunning 30 points among voters under 30, according to NBC's first post-debate poll."},{"comment_id":"10152897950463445","commenter_b":"To steal God is an oxymoron! Obviously your ignorant! God is there for everyone. It says in scripture that God will call up people from every nation on earth. After the rapture and 1000 yrs of destruction The promise land will be restored in all it's glory. And it's ridiculous to say everyone is Muslim, there were religions that worshipped idols and had orgies as part of their religious beliefs. This is what angered God and he wiped out the wicked in the great flood.","commenter_a":"My God doesn't reward murder , or threaten that if a person doesn't repent according to the Koran they will be killed. My God wouldn't reward living a just and Godly life with going to heaven and having 72 virgins!!! God would never give a sexual gift as a reward. Muslims treat women like shit, just like a woman has no civil rights. In America we have the right to practice whatever religion we want and freedom of speech. If this country sucked so bad immigrants wouldn't risk their lives to get here.🔯 Shalom😇","post_message":"#Cannabis Legalization Goes Mainstream in Israel"},{"comment_id":"10153537073428352","commenter_b":"Lol she is a freak","commenter_a":"Still dont see why he should loose his life over trafficking drugs, after all he didnt commit murder. I hate indonesia and its stupid laws","post_message":"‘My life is a perfect example of an absolute waste': Andrew Chan’s haunting letter to schoolchildren around the world, warning them about the dangers of drugs"},{"comment_id":"1136331029759977","commenter_b":"Stupid Brazillian woman. I hope she was arrested.","commenter_a":"Karen Ramsden","post_message":"Don’t mess with my man!"}]
