[{"comment_id":"1349633901749900","commenter_b":"'@username, real women protect their babies, not kill them","commenter_a":"Any 'man' who wants to try to control what women do with their body is a worthless piece of feces and they will be treated as such.","post_message":"The gift of life must be protected from the slaughter!  Click here to sign your petition in support of the Life at Conception Act!  @webpagelink"},{"comment_id":"875104725882610","commenter_b":"muslims are worthless anyway..","commenter_a":"go ahead we will be happy for that!!","post_message":"And Turkey says the whole site will be banned if it does not obey"},{"comment_id":"877406769042769","commenter_b":"Idiot ASS CLOWN","commenter_a":"President trump will take care of that","post_message":"ClashDaily.com"},{"comment_id":"10153155550251051","commenter_b":"Oh Erika bitch still has vagina","commenter_a":"HUGE.....SORRY ISRAEL...OUR PRESIDENT IS SETTING US UP FOR WAR....SORRY HES SUCH AN EVIL P.O.S....an i for one stand with my people an Israel....suk it obama....rot!!!!!","post_message":"Israel came out and called President Obama's nuclear deal with Iran a big mistake. Here's how they're going to respond to it. Do you agree or disagree with the idea that the Iran deal is a mistake?"},{"comment_id":"10153260664437885","commenter_b":"Phuck that man cunt.","commenter_a":"I thought traitorous dogs got shot!","post_message":"Not a DuffelBlog....this is real"},{"comment_id":"10153304270661051","commenter_b":"(Sigh) Non sequiturs everywhere.","commenter_a":"So. Arrested him for killing a lion and thugs that kill cops are going free what's wrong with picture so animals are more important than people's lives","post_message":"Cecil the Lion's hunter has been arrested."},{"comment_id":"102418186941623","commenter_b":"'@username 99% of the Republicans that seem to comment in these venues seem to share the same ugly views. Those that aren't like that need to speak up more.","commenter_a":"That's because Republicans are selfish, self-righteous, hypocritical pieces of shit who are blowing loads over their new ability to grab power.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
