[{"comment_id":"10155571867589062","commenter_b":"She's a thug communist married to a drug pusher.","commenter_a":"She's a Texan so I can't say anything bad about a fellow Texas gal.","post_message":"Beyonce will be performing tonight at the CMA Awards. Do you think she was a good choice?"},{"comment_id":"1384915431551722","commenter_b":"Sorry dear i said this woman is really DISGUSTING ohh","commenter_a":"is she speaking from experience?","post_message":""},{"comment_id":"10153197262606336","commenter_b":"Only GOD, could to do it.!! IN GOD, WE FROM MORE CHAMPION: GOD BLESS YOU Beautiful Family. THE MIRACLE EXISTING, IF YOU BELIVE.!!","commenter_a":"Rest in peace little Angel 👼🏼","post_message":"\"He is now cancer free and running and playing and laughing with God and all of the other precious children,\" a post on \"Danny's Warriors” Facebook page read."},{"comment_id":"1191980840884045","commenter_b":"Seth Rich, DNC staffer, suspected of leaking information to WikiLeaks about the Clinton campaign randomly gets shot in the back walking down the street.... Why are so many Americans blind to the corruption in the Clinton campaign? People with credible evidence against Hilary are turning up dead. This is not a random instance. @webpagelink","commenter_a":"Trump will make changes, and yes Obama Trump doesn't think we faked the moon landing.","post_message":"Barack Obama’s greatest strength? “Probably that I’m always early.” hillaryclinton.com/makeaplan"},{"comment_id":"1758501704379005","commenter_b":"That cow can't just shut up can't wait till she moves to Canada","commenter_a":"yes she is","post_message":"Whoopi Goldberg Insults TV Host For Being White, See What Happens Next. She is the biggest hypocrite. What a bigot. Do you think Whoopi is a racist?"},{"comment_id":"752107674943648","commenter_b":"Loretta Lynch is a corrupt dirty rotten scoundrel is about to be charged herself for crime. Why? Stay tuned for more Wikileaks coming to a theater near you.! Loretta and Obama on the hit list for being nasty dirty people who have smirked and abused their positions in the greatest country. They will meet their maker on earth.","commenter_a":"HilLIARy has already admitted guilt and felonious actions??? She has admitted that her staff reviewed all her emails so they could delete her \"Personal emails\", right? Since this occurred AFTER she left the government, it is an admission of guilt!!! Why? It is a violation of law to reveal or share classified information with anyone that does not have a current active security clearance equal to or exceeding the classification of the material. Further it is required that the person have a \"need to know\" even if they have security clearance. Since her staff has neither a current and active security clearance or even if some did they did not have a need to know. Since it is now known that some of those emails were Top Secret SAP it is virtually certain none of those staff were listed as having access. The argument that none of the released emails ...","post_message":"President Bill Clinton – whose wife is currently in the crosshairs of the Justice Department over her use of a private email server – met privately with Attorney General Loretta Lynch."},{"comment_id":"1004538792920312","commenter_b":"@username I'd love to hear your thoughts on the post from Kylelebrius Kennethius Jenkonious","commenter_a":"Hey friends, just wanted to highlight part of this post for those who aren't able to read the whole thing or watch the entire video. I really want this post to get people thinking about how we talk about these issues but also what causes these situations, not just the consequences of them. I know this is a tough situation and one that provokes lots of emotion and passion, but I hope we can talk about this in a productive and respectful way. Thanks in advance. \"Violence of any kind is wrong. But there's a serious problem when white students rioting after the annual Pumpkin Festival are described as \"rowdy\" and \"unruly\" but black protesters rioting in response to police brutality are portrayed as \"violent thugs.\"","post_message":"If you replace \"white\" with \"black,\" suddenly it doesn't sound so far-fetched. That's precisely the problem with the way folks are talking about the Baltimore riots. - Franchesca \"Chescaleigh\" Ramsey"}]
