[{"comment_id":"10153448155621045","commenter_b":"Sure","commenter_a":"Elizabeth Kidd can we please please please go see this in 3D when it comes out ? Without the kids the first time lol","post_message":"Cannot wait! \"Keep on swimming.\""},{"comment_id":"988452247844232","commenter_b":"If you have a daughter tell her to free her nipple in public and the pervs will come flocking to take pictures. Which will be legal if in a public space. Maybe you should look up Voyeur on pornhub or something and girls of all ages are being creep'd on.","commenter_a":"These sexist comments are appalling. Especially from the women. Keep letting society tell you what's proper and where your naked parts belong. As long as I'm concerned breast were designed to feed a new born. A man can do whatever the hell he wants but a woman has to be restricted to pretty much anything that might make her comfortable because revealing clothing means she's \"asking for it\" and showing her nipples, which are both called the areola on both men and females by the way, would just make men go into a frenzy. Instead of instilling this belief that breast and skin of women are meant to appeal to the eyes of men, teach men and instill in them self control, consent, and respect for women.","post_message":"Here are the nipples so scandalizing that Facebook won let us show them to you. (To see the uncensored version, click here: @webpagelink) #FreeTheNipple"},{"comment_id":"1086763938002529","commenter_b":"\"The dangers of muslims...\" Yes, because American muslims have just been attacking other Americans day after day for years. Oh im sure theyre just waiting right? And in 10 years theyll still be waiting? And in 20, still waiting...","commenter_a":"Trying to desensitize the American people of the dangers of muslims.","post_message":"\"Mohamed Ahmed is not at a disadvantage because he's Muslim: On the contrary, as the reaction from Obama and the fawning media shows, he's privileged.\""},{"comment_id":"10153709060366037","commenter_b":"She is a disgusting hypocrite!","commenter_a":"That's OK, Kim. You're getting what you really wanted all along. Attention. May your 15 minutes be over soon.","post_message":"\"What probably hurt me the worst is when someone tells me that my God does not love me.\""},{"comment_id":"1022630587845203","commenter_b":"Trump is not racist. He wants to build a wall so he can get criminals out, and keep them out. No way would he, or would congress allow, deporting 11 million illegals. He doesn't hate Muslims, just wants to keep ISIS out. Look what refugees have done to Germany. Hillary has the media in her pocket. Wake up America!!","commenter_a":"Considering all that confetti at Hillary's nomination was the shredded up emails...I would say for honesty and safety...Trump won hands down.","post_message":"Now that all the balloons have fallen, who won the convention ratings race, Donald J. Trump or Hillary Clinton?"},{"comment_id":"837004389725950","commenter_b":"Oh so sad.","commenter_a":"Amen!!!!!","post_message":"Absolutely! Thanks to our friends at Democratic Memes for this great image. Give their page a like and let them know we sent you!"},{"comment_id":"1114642831881306","commenter_b":"We Can't seem to Pin Point The Problem!!! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The Underwear Bomber was a Muslim The U.S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bali Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Muslims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The Besian Russian School Attackers were Muslims The first World Trade ...","commenter_a":"Where are the women & children ???","post_message":"A sound strategy, considering Obama's strategy is basically, \"You're a bigot if you don't accept Islamization of America.\""}]
