[{"comment_id":"10155152237477042","commenter_b":"Everyone without documentation will get deported.","commenter_a":"Here in NY, we have a huge population of illegal immigrants from China, Russia, Israel, and the Middle East. Will they be rounded up too, or do the deportations apply only to Latinos?","post_message":"New guidelines under President Trump greatly expand the amount of people considered a priority for deportation.   Undocumented immigrant suspected, charged, or convicted of a crime (including minor traffic violations) will be at the top of the list."},{"comment_id":"1009004349187234","commenter_b":"first she needs to be a lady","commenter_a":"Watch out she will pick your pocket ...","post_message":"Michelle Obama Invites Muslim Refugee To Sit With Her At State Of The Union  She should invite a soldier who fought for our country. This is ridiculous.  Do you think Michelle Obama is the worst first lady ever?"},{"comment_id":"10157646411850093","commenter_b":"But a woman who puts dow","commenter_a":"Who wants to manage him? It is just human nature to defend yourself when someone tells lies about you. There is no proof that he called this lady Miss a Piggy and Miss Housekeeping. The video showed him defending her and complimenting her. I don't believe her story. She just wanted her 15 minutes of fame and the Clinton campaign probably paid her. I want a President who stands up for himself when attacked. I certainly defend myself when someone lies about me!! We need a strong leader!!!","post_message":"Leading conservatives are engaging in wishful thinking."},{"comment_id":"876368172456238","commenter_b":"You are so foolish. You must be a Hillary supporter? That nasty woman has direct ties with Monsanto. Do you realise that? She is one of the biggest crimals you could ever imagine. Put Google to good use and research just how evil Hillary really is.","commenter_a":"Amen!! Thats how you hurt a man with money right in his pocket. I had told myself i was not going watch nothing with his name on it.","post_message":"Kudos to NBC for doing what's right!  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153974318380496","commenter_b":"Let them protest but not riots, vandalism and violence. These people r starting to scare me. Saw a sign outside trump towers saying rape melania and kill trump. What kind of people r they. Trump has to stay cool and not start tweeting.","commenter_a":"Thank God someone with common sense.","post_message":"While protests in Atlanta and around the country have been peaceful, that isn't the case for all. Now a major city's officials are saying that enough is enough.  “If you’re upset with the election, please don’t come out and protest,” the city's police chief said. “We are done with criminal activity in this city. It’s time to move on and to move forward.”"},{"comment_id":"1206961029346060","commenter_b":"You still haven't answered the RACE question","commenter_a":"He sounds like when I BS for word count in an essay.","post_message":"Donald J. Trump and Hillary Clinton faced off in their first presidential debate. TELL US: What questions did you want them to answer? Your comments may be used on our newscasts. You can also watch the debate live on CBS2 or on CBSNewYork.com, Join us on CBS2 at 11. #Debates2016"},{"comment_id":"10154938661994328","commenter_b":"She is so cold look at her eyes they are evil!!!! They are illegal they have already committed a crime breaking our law.","commenter_a":"These left-wing liberals keep saying illegals should not be asked about their immigration papers, or lack of, because then they won't bear witness against criminals. HeII, they don't anyway! The last thing illegals are interested in is going into a Court of Law! These people will suffer in silence before testifying against one of their own. It's time for a change. In Europe, everybody has a PassPort or legit I.D. And cops and soldiers can stop you at any time. You produce that I.D. or you go to jail. Simple. Time for a national I.D. in the States!","post_message":"Democrat leader sides with illegal aliens over mom whose son was murdered by one."}]
