[{"comment_id":"10153234607601491","commenter_b":"Imagine... First lady of America has a sex video. No please!!! Cant call kim a lady!","commenter_a":"Lol","post_message":"Kanye and Kim Kardashian West are looking forward to redecorating the White House."},{"comment_id":"10153059782796770","commenter_b":"She's a lier","commenter_a":"She is a crook always has been!","post_message":"Hillary Clinton: “I have gone further than anybody that I’m aware of in American history … to try to be as transparent as possible”"},{"comment_id":"10153724968418598","commenter_b":"She must have been taught by Satan himself.","commenter_a":"Who taught her about Jesus? Wow.","post_message":"Abortion Clinic Owner: “The Jesus I Was Taught Would Hold Women’s Hands” as They Abort Their Baby"},{"comment_id":"10153431181609497","commenter_b":"Get rid of her for your own future. You can never be president if you only eat pizza.","commenter_a":"Dad's girlfriend orders pizza every night.","post_message":"'One time, she even let us get cheesy bread and watch an R-rated movie.'"},{"comment_id":"10153319556628352","commenter_b":"She's got meth face.","commenter_a":"Fuck y r sum moms like dat not fair for children they deserve better","post_message":"Mother arrested for child neglect after her young daughters traveled barefoot trying to sell their toys door to door as she slept"},{"comment_id":"10153154056999087","commenter_b":"I dont believe Obama is favorable in other countries eyes as i have seen some of what other countries say about him bowing to the arab king,,while not saluting our countries flag that many died for.. as far as the immigrant worker.. maybe in yester year they took menial jobs but now i know plenty that take 20,00 hr jobs from americans who are willing to do it...just by being here being here illegally oh and should i mention the illegals get paid cash so most collect welfare and food assistance along with housing , wic and health benefits the whole time....im tired of seeing my fellow americans collect welfare and food assistance cos they cant find a job to support their families.. Being illegal is breaking the law..if they cant follow our law to stay out unless processed properly and not enter illegally do you really believe they will ...","commenter_a":"Donald Trump is on his way to offending every nation, we deal with.... want to really watch us lose our standing in the world? Elect this dufus.","post_message":"'Negotiating with Japan, negotiating with China, when these people walk into the room, they don't say, 'Oh hello, how's the weather, so beautiful outside, isn't it lovely? How are the Yankees doing? Oh they are doing wonderful, great,' ' Donald J. Trump said. 'They say, 'We want deal.' '"},{"comment_id":"10154524280341955","commenter_b":"She's corrupt to the core.","commenter_a":"More of the trash that needs to go.","post_message":"Loretta Lynch 'Pleads Fifth' on Secret Iran 'Ransom' Payments..."}]
