[{"comment_id":"954543751267694","commenter_b":"First of all she did NOT hit the officer first.. He had his arm around her neck before she hit the arm he had wrapped around her throat.. That's a natural human reaction.. Before HE touched her, she was seated in a chair","commenter_a":"Does anyone notice the difference?","post_message":"#AssaultAtSpringValleyHigh: The SC school resource officer who slammed a teenaged girl on the floor was sued twice in federal court. Cops charged in fatal shootings reaches a nationwide high in 2015. #CoreyJones’ final phone calls may detail the moments before his fatal shooting. Check out these stories and more in today's edition of the NewsOne Top 5, our rundown of the viral stories that we are still talking about today. ------> @webpagelink"},{"comment_id":"1578057615587695","commenter_b":"10 Days and she will be our president","commenter_a":"@username am I right Cody Martinez","post_message":""},{"comment_id":"10156528764475594","commenter_b":"shut up, entitled lady","commenter_a":"Wow! A plethora of opinions...negativity abounds! What happened to \"if you can't say anything nice, don't say it at all\". I usually don't post but...","post_message":"#BREAKING: According to a report, Scalia arrived at the ranch Friday and attended a private party. When he did not appear for breakfast, a person associated with the ranch went to his room and found a body."},{"comment_id":"632124420311470","commenter_b":"Of all the garbage o n tv every night and they r bitching about this, cmon really! This right here is the reason we need to get rid of the shit in govt","commenter_a":"That's funny, Liberals complaining about a woman uncrossing her legs When has this been an issue for them? This is why liberalism equals hypocrite.","post_message":"Liberals want FOX News taken down after yet another wardrobe malfunction. This is ridiculous. FOX News hosts are classy, we support them! Do you support ALL FOX News hosts?"},{"comment_id":"582484121909678","commenter_b":"Man she need to stop with her owe puppy monkey baby looking ass","commenter_a":"Donte Grant","post_message":"She's not ready for a tattoo"},{"comment_id":"10156663842160354","commenter_b":"KILL THEM Europe.","commenter_a":"This is what the fool, Obama wants for America .","post_message":"A DOZEN PHOTOS... \"Parents have been advised to keep their children indoors as migrants roam through playgrounds, while on residential streets police wearing riot gear stalk gangs of migrants.\""},{"comment_id":"10153327625216833","commenter_b":"She's a puppet","commenter_a":"Seems to me that the police that have been in danger are in the black communities.","post_message":"On March 28, MSNBC Melissa Harris-Perry suggested the push away from gun control and toward expanded gun rightswhich means more armed, law-abiding citizensactually puts police lives in danger."}]
