[{"comment_id":"1605375073100237","commenter_b":"Fuck him and his family. Good job lady and sorry you had to as nobody wants to kill someone. But they will kill, torture, and rape you. Good you were armed. God bless you.","commenter_a":"Why do we allow people like this to contribute to the GENE POOL? His whole family should be spaded and or neutered. Why because of IDIOTIC lines like \"he needed money for clothes\" what happen to all the government hand outs this family was getting, cause sure as shit they all were on welfare and not one ever held a job. As to whether or not it was the home owners fault is by far the most asinine thing ever spoken.","post_message":"This teen punk broke into a woman's home and tried to rob her. But she defended herself, and left him dead.  Now the punk's family is asking an absolutely sickening question, that left the woman and her friends shocked.  Only in Obama's America..."},{"comment_id":"604709916395876","commenter_b":"Is it all the bleach that makes Trump women stupid? They should do a study...","commenter_a":"This speech is ridiculous he's supposed to be a leader he's dividing people thinking he has power I'm embarrassed to say he thinks he represents all of us","post_message":"\"We are going to be the first state in the country to fight back on Washington.\" Boston Mayor Marty Walsh gave impassioned remarks at the rally ahead of the Boston Women's March for America.  @webpagelink"},{"comment_id":"511284652397563","commenter_b":"@username Riddle me this Kat Can you please enlighten any or all of us exactly what it is that Trump can and will do for us? BESIDES build that wall and MAKE AMERICA GREAT AGAIN????","commenter_a":"Serious question: Hasn't there been enough debates? Cruz has had plenty of opportunities and has yet to take advantage.","post_message":"\"Let’s make it a two-hour debate. CNN has already scheduled it. You’ve got a venue. You’ve got a location. You’ve got TV cameras. The only thing missing is Donald Trump because he’s too scared to debate.” —Ted Cruz"},{"comment_id":"611841178976490","commenter_b":"Ha.....snake in the grass. Call her out.","commenter_a":"send Hillary to live with the Arabs.","post_message":"FUNDING TERRORISM --- AND THE CLINTONS."},{"comment_id":"1806351676274393","commenter_b":"My body is mine Mario, and a pregnancy I would carry, would also be my decision. You get no say. Your ignorance proves you shouldn't have any. You think no women in your country get abortions? No, they get unsafe back-alley or home abortions. Men should absolutely not get to make legal decisions over what occurs within a woman's body.","commenter_a":"Your body is your choice only when your body will have 2 heads 4 arms 4 legs..if you want a choice you should buy a pack of condoms or close the oval tubes..stop abortion in Gods name.","post_message":"In Mike Pence's name"},{"comment_id":"788206447982585","commenter_b":"The trump train is heading for the trump wall. toot toot.","commenter_a":"Hurry Hillary call Wall Street call @username call AL Sharpton because your gunna need all the help you can get. The Trump Train is rolling straight for the White House !!!","post_message":"Hillary Clinton and her allies are preparing for the fight against Donald J. Trump."},{"comment_id":"1404359436262533","commenter_b":"Craigslist HIRED HACKS.","commenter_a":"Sorry not happening!","post_message":"WATCH LIVE: Local organizations are protesting at Phoenix City Hall to call upon Mayor Greg Stanton to make Phoenix a sanctuary city, among other actions."}]
