[{"comment_id":"1414146828610887","commenter_b":"If he can't deal with everyday life maybe he should be committed to a facility that can help him. In other words he is nuts.","commenter_a":"Oh boo hoo, here is a tissue, grew up your in college time to man up","post_message":"College Kid Demands Counseling After Being 'Traumatized' By Seeing The Confederate Flag Sticker Our society is getting out of control. Do you think this is ridiculous?"},{"comment_id":"455416051331721","commenter_b":"Bullish*t. That articulate enough for you?","commenter_a":"If there is one thing that is inescapably true about President Obama compared to the many predecessors that came before he is this: President Obama will be considered by history's standards as the most articulate president to ever occupy the white house! Period!","post_message":"President Obama's last State of the Union address is January 12th—don't miss it. @webpagelink"},{"comment_id":"1027313147330802","commenter_b":"Jerry, I hadn't thought about Arab nations not taking them for that reason. So-called common wisdom has it that they don't want them because they're potential troublemakers. Your idea makes more (and scarier) sense.","commenter_a":"I don know if anyone realizes what is going on. I always tried to grasp the larger picture; go from the general to the specific and not the other way around. Europe and soon America are under invasion. None of the typical Arab countries have taken the Syrian refugees. Fact. Why? Because they want them to overwhelm the western nations. Infiltrate the society. Surround the culture and change civilization as we know it. At that point, it done. Pretty simple, isn it? Sorry, not if I can help it. Islam is a political movement masquerading as a religion. Smell any coffee?","post_message":"Muslims Tried To Go Big In This U.S. Town, MAD Patriots Shut Them Down (VIDEO) @webpagelink"},{"comment_id":"10153111641514138","commenter_b":"Bitchassniggas","commenter_a":"I'm glad they stopped him because he would go there get training and come back!! We already have had too many of them do that there's a lot that get caught that we don't know about.","post_message":"Arrested at Minneapolis-St. Paul International Airport with a one-way ticket to Somalia + a fake passport"},{"comment_id":"10153866253733984","commenter_b":"Neurotic sad women","commenter_a":"Go TRUMP","post_message":"This is exactly what makes Donald J. Trump such a polarizing figure. Some people love him for this sort of thing, and some people hate him for it. Are you one of the ones that likes him?"},{"comment_id":"10156524668125293","commenter_b":"Tony: I doubt most American wives want to work a job. Friggin stay at home cows!","commenter_a":"weather the job is a career or just to put food in your stomach. Your wages has to match the cost of living and the cost of living is going up and so should the wages. KEEP Protesting it because they are wrong!!!!!!!!!!!!!!!!!!!!!!!!!!!","post_message":"\"He's interfering in other cities' business.\" A bill passed the Alabama House today that would outlaw local minimum wage laws. Tonight, protesters are lining the street in Mountain Brook, the home district of the bill's author. More on the bill at 9:30, more on the protestors at 10."},{"comment_id":"1085651791446290","commenter_b":"I say shut them down. There are many clinics for health reason, but NOT abortions! We need to STOP abortions (murder)!","commenter_a":"health screenings,fine..but why do our taxes have to pay for birthcontrol??Tell me again, I don't understand....","post_message":"Americans want funding for women's health."}]
