[{"comment_id":"10153752964580575","commenter_b":"I'm ashamed of you Mary, rape is rape. Lord help you if you ever get in that situation.","commenter_a":"I don't doubt Bill Clinton and Bill Cosby were with these women. My doubt comes from what is rape. When a woman wants something from a man and is willing to give sex for it , is that rape ?","post_message":"Bill's past is coming back to haunt Hillary. . . ."},{"comment_id":"377454052442889","commenter_b":"Let's BAN Muslims, this is our country and our freedom of religion!!!! They need to go back home where they belong to do this in their own country!!!!😡😡","commenter_a":"If the Muslims choose t o.live here, Don' t tell us what you want. This is America and a lot of us are Christians and we don't need or want immigrants telling us to change our beliefs. If you don't like our beliefs and our freedoms, maybe you should g o back to you country and try to get along. If you choose to stay here and enjoy our life and freedoms, then stop telling us to give up.our beliefs. I suggest you join a branch of service and share the responsibility of living here instead of holding your hands out for every thing you can get for free. It's time we stand up to you and what you want. I'm tired of it. God bless America!!!!","post_message":"The want to change Easter in 'Spring Break'..."},{"comment_id":"1747275395512005","commenter_b":"'@username if it isn't Mr. Trump YOU will be voting in Hillary","commenter_a":"The only thing that needs to change is HIM OUT OF THE WHITE HOUSE.","post_message":"Obama says 'we' need to pray for the 'strength to change.' It's yet another of his disgusting refusals to acknowledge the realities we face."},{"comment_id":"10153320570936509","commenter_b":"The $2.1 billion isn't what I'm talking about...., keep reading.","commenter_a":"Tax break? He promised not to raise taxes on anyone making less than $250,000 then slams Obamacare down the throats of every American which is one of the largest tax increases in the history of our country aimed directly on the shoulders of the 'middleclass'.","post_message":"Many in the middle class, particularly the single and the elderly, won't see any tax breaks under Barack Obama's Middle Class Economics plan: @webpagelink"},{"comment_id":"10153294760143984","commenter_b":"Who gives a flying flip of these two self serving godless people? They are both the horse's ass and should be ignored! !!!","commenter_a":"I wonder how it got that way ???????","post_message":"It seems as though Wild Bill's love life wasn't the only thing that was out of control in the White House during the Clinton's tenure..."},{"comment_id":"667242780097527","commenter_b":"YES!","commenter_a":"Yes","post_message":"Would Donald Trump be a better president than Obama?"},{"comment_id":"10153905516506178","commenter_b":"I always say Merry Christmas at that is just the way it is.","commenter_a":"Fitting that a NUTCRACKER be in the back ground. :-)","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
