[{"comment_id":"10152940333217061","commenter_b":"@username shes a hoe","commenter_a":"Hi Guys :) I'm Ashley :) 19 years <3 , I m Single and beautiful <3 girl <3 please like my page :) in 2 secs and i'll send you a friend request and inbox you <3 you will never regret, :( i promise you, please support me by just 1 like <3 1 Like (y) = 99 Help <3","post_message":"Police: Jake Lloyd, the actor known for his role as young Anakin Skywalker in 'Star Wars', arrested: @webpagelink"},{"comment_id":"1346176708775407","commenter_b":"Tell that to the two","commenter_a":"God had promised us He will not wipe out humans on the face of the earth any longer therefore the doomsday theory can NEVER happen. It is just a figment of imagination in the mind of the writer of this article. I will rather suggest he asks 'what would happen if Rapture takes place now?","post_message":"What the world would look like if doomsday struck and humans were wiped out"},{"comment_id":"10153449417193984","commenter_b":"She is a loser!!!!","commenter_a":"Her Poor daughter .. I bet she was totally humiliated .. and then to have mom remove her from her class mates .. Brutal :(","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"1189675974461986","commenter_b":"@username she will not loose","commenter_a":"The real problem is Bernie Sanders is NOT a democrat! No wonder he and democrats are having a problem. He should have run on his own party-- as the socialist he is.","post_message":"It's not just the Republican Party that seems to be having a problem uniting..."},{"comment_id":"10152817308146491","commenter_b":"She's a fatass skank","commenter_a":"We don't have a first lady. She is a low class idiot.","post_message":"“If Barack was a helium balloon, Michelle was the one holding the string.”"},{"comment_id":"865539350258452","commenter_b":"Just keep trucking along well have a good president in the office finally","commenter_a":"Vote Trump","post_message":"Thank you Connecticut! See you this evening!! Lets MAKE AMERICA GREAT AGAIN!!"},{"comment_id":"495256197331627","commenter_b":"She can't ban nothing she is just a picture hanging on the wall so tell her to stay out of Americans business","commenter_a":"So sad","post_message":"What Michelle Obama is banning now is just plain unacceptable.  The American people are tired and finally fighting back.  Do you agree Michelle Obama should mind her own business?"}]
