[{"comment_id":"927400923975122","commenter_b":"Lol. Kinda harder for a white person to flee the country. Try again. If your illegal then you are ILLEGAL. Their is no right about it.","commenter_a":"For all of you saying if the man who caused this accident was an \"illegal\" or \"undocumented\" man, what if the victims were illegal? Is that going to change how tragic and sad this is? Jeez, you would think the older the wiser but it seems to be the older the dumber and ignorant","post_message":"MCSO: \"ONE OF THE WORST DUI CRASHES WE'VE EVER INVESTIGATED.\" 5 A-M Sunday morning, Sheriff's deputies say 23 year old Cesar Villanueva, driving a white truck, slammed into the back of a Honda waiting at a stoplight in Avondale. The impact virtually destroyed the car. The young man and woman in the Honda were pronounced dead at the scene near Avondale Blvd. & MC 85. Detectives say Villanueva was speeding and was impaired. He is in custody. Details at 5."},{"comment_id":"10153351201607439","commenter_b":"We the People have our lives going and We the People aren't the ones waging war on other countries. It's the government. They want to go to other countries and spend trillions of our tax dollars on them and try to get those mid east countries to be more civilized. Well, you can't teach a baboon how to talk and you surely can't teach these primitive thinking tribes to be civil. So the only thing they know is to try to rule the world and get the whole world to be on their level. As for that Boston Bomber mother.....your fu*kface son will burn in hell way before your 'people' get a chance to try to burn America down! And you'll be under ground too and will never see America burn. America's too strong of a Nation for that. Even with this Muslim president.","commenter_a":"Hey, your religion aint working.","post_message":"@webpagelink"},{"comment_id":"10153621323058812","commenter_b":"oh grow up Jennifer!","commenter_a":"the cop over reacted why would she have to put her cig out. Give her a fine and move on!","post_message":"At press conference, Sandra Bland's sister shared that she believes Sandra's arresting officer Brian Encinia was \"picking on her. Point blank, period.\" @webpagelink"},{"comment_id":"1041804329212648","commenter_b":"The same family will bring in refugees, no doubt, and will regret that as well.","commenter_a":"At the shelter in my city they put all pits and even half pits to sleep, they don't even adopt them out.","post_message":"Pit bull rescued from 'death row' attacks daughter just minutes after arriving at family home"},{"comment_id":"889771817799697","commenter_b":"Stupid. All this shows is the truth ... guns don't kill ... criminals kill.","commenter_a":"How many of the guns featured in the film were bought by good law abiding citizens in a legal way. Hmmmm I'm going with NONE!!!","post_message":"These people, who claim to have innocent people's best interest at heart, are sicker than the people in their disgusting film. THEY are the gun crazies."},{"comment_id":"1154241914613147","commenter_b":"Maybe that dickwad should of been aborted.","commenter_a":"The faux outrage is big with this one. Who gives a crap.","post_message":"“How the hell do you think this joke is OK?”"},{"comment_id":"10154233578003352","commenter_b":"Right! Stupid lady. No man is worth that.","commenter_a":"Here we go again....... The Childs mother is dead, the side chick is going to Jail and the Man is sleeping with a New Woman TONIGHT. IJS.","post_message":"Woman Allegedly Murdered Boyfriend’s Baby Mother Because He Got Her A Valentine's Gift!"}]
