[{"comment_id":"10153170586384255","commenter_b":"Yay!! We already have enough leaking pipelines crisscrossing America...","commenter_a":"Eight treacherous Democrats. They should have to fight for their seat sin primaries.","post_message":"As expected."},{"comment_id":"10154078689087894","commenter_b":"Smh! I find it hard for woman to think they can touch people and think its ok. Everybody don't like to be touched. Yes his a artist performing, not for you to be there grabbing all on his or her clothes just to say \"Oh I grabbed his pants\"!! Sit back and enjoy the show....without touching me!","commenter_a":"Oh please he didn't take his foot and shoved it down her throat! He tapped that girl with the top of his shoe. And because he's a big dude it look harder then what it probably was. She still stay at the show, so she must wasnt hurt that much! 6months is ridiculous!!!","post_message":"Kevin Gates Sentenced to Six Months in Jail for Kicking Female Fan [Video]"},{"comment_id":"836581726388456","commenter_b":"I've always respected women.","commenter_a":" declare to you today that you shall surely perish. You will not prolong your days in the land where you are crossing the Jordan to enter and possess it. 19\"I call heaven and earth to witness against you today, that I have set before you life and death, the blessing and the curse. So choose life in order that you may live, you and your descendants, 20by loving the LORD your God, by obeying His voice, and by holding fast to Him; for this is your life and the length of your days, that you may live in the land which the LORD swore to your fathers, to Abraham, Isaac, and Jacob, to give them.\" Now you anti's are taking the Bible out of context.....","post_message":"Powerful words to live by."},{"comment_id":"10153377243163812","commenter_b":"Criminals go to Jail not to a coffin u c u n t","commenter_a":"Never in my entire life did I see so much racism!!! And it's NOT whites against blacks but the other way around!!!! Freddie gray was a criminal as was Michael brown!! Both got what they deserved in my opinion! Both had rap sheets a mile thick! Don't break the law and you won't get arrested! Simple logic! Don't get me wrong in today's society many cops coming are only there for the power but there are more that truly want to make a difference and it's sad when they're charged for trying to remove scum from the streets!","post_message":"BREAKING UPDATE: Warrant issued for arrest of 6 officers in Freddie Gray case; various charges including murder, manslaughter, assault being leveled: @webpagelink"},{"comment_id":"10154596759964166","commenter_b":"Only applies to men though... Women can murder their babies. Just ask killery","commenter_a":"What is \"feticide\" ?","post_message":"JUST IN: The man accused of killing a pregnant teacher and dumping her body has bonded out of jail. His bond was set at $500,000."},{"comment_id":"726323540858316","commenter_b":"Meryl shut your hole, no one cares what you have to say. Matter of fact put your money in California and pay their way. You are a dried up old hag from the movies and you didn't get their by yourself. We put you there. Get the hell over it and go get laid. LOL you probably can't even get that.","commenter_a":"Dodo. She will not only in be hibernation but soon will be extinct","post_message":""},{"comment_id":"10152650775565496","commenter_b":"Agreed. They gave that lady not one, but TWO! black eyes. They liked to beat her brains in.","commenter_a":"Why are they out on bond? If I were the D.A. I would be pushing for attempted murder charges.","post_message":"The trio of woman accused in a brutal beating over a squished hamburger were scheduled for court this morning. UPDATE on the case: @webpagelink"}]
