[{"comment_id":"1126887640660229","commenter_b":"If she's black, the barry is white !","commenter_a":"You will always be that lovable little fuzz ball, however you identify yourself!","post_message":"You know, I think I'm going to \"identify\" as skinny.  That way I will not have to ever go on a diet. I'm just gonna identify as skinny.  I just am.  You think I'm not?  Screw you!"},{"comment_id":"1077509702340944","commenter_b":"She's a vulture.","commenter_a":"She is disgracing American's right to vote. She is labeling anyone who is not a Democrat. In other words we are \"basket cases\"! It's one thing to bash Trump, quite another to degrade voters.","post_message":"Hillary Clinton is taking heat for saying \"you could put half of Trump’s supporters into what I call the ‘basket of deplorables’. Right? The racist, sexist, homophobic, xenophobic, Islamaphobic — you name it.\" What do you think?"},{"comment_id":"1652238444998373","commenter_b":"White girl runs around in black face and its fine, yet if I were to do it the liberals would lynch my saltine american hindquarters.","commenter_a":"She went full retard","post_message":"Wait,... what?  @webpagelink"},{"comment_id":"10153551674003984","commenter_b":"Latino's vote democrat most of the time anyway. Illegals shouldn't be voting. Lets crack down on cheating. voter ID.","commenter_a":"So now conservatives have to worry about the huge amount of Latinos who will vote Democrat in the 2016 elections, just because Trump voiced the truth about those coming here illegally. We have over a year to go before a candidate is chosen, giving the criminals who came over the border illegally plenty of time to change the minds of Americans.","post_message":"These days, Donald Trump seems to be at the center of every controversy.  He might just be in the midst of another one after this actress just thanked him for his stance on immigration...  Do you agree with Donald Trump's views on immigration?"},{"comment_id":"10153318704229614","commenter_b":"This is why women live longer than men..","commenter_a":"The stupidity is strong with this one","post_message":"A shirtless man got himself into quite a predicament after climbing up a basketball hoop in Seattle and somehow managing to get stuck upside down.   Hanging by a foot, the man flailed and thrashed about while officers tried to figure out how to get him down.    Eventually, a couple of firefighters came in with a ladder, cut the net down and rescued him.   \"He may be arrested for property destruction, or at least goal-tending,\" the Seattle Police Department tweeted on Friday.   Read KTLA's story here: @webpagelink"},{"comment_id":"1003873189632434","commenter_b":"When you take into account what these 2 young men did taking beer from a grocery store well there's going to be consequences plus swinging a skate board well the Police have to do something...I wish I were standing holding a sign I Support the Police Department !!","commenter_a":"I hate to say this but the store video does not lie. Now hopefully they'll release the bodycam video too. Now would be a great time to prove just how successful those are.","post_message":"The Olympia police officer who shot two men last week has given his account of what happened to investigators, and the department isn't releasing information.   More than 100 people packed city hall tonight demanding immediate changes in police accountability >> @webpagelink"},{"comment_id":"10153206999136336","commenter_b":"I love it. She should have her wooden spoon with her","commenter_a":"She is going to be arrested. She beat him that is abuse. Some Social worker will have her arrested.","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"}]
