[{"comment_id":"1554742308153991","commenter_b":"IM A WOMAN...A STRONG WOMAN...AND I SAY TRUMP 2016!!!!!!!!!!!!!!!!!","commenter_a":"Classless joker","post_message":"What do you think about President Barack Obama's statements regarding Republican women and Donald J. Trump?"},{"comment_id":"1001794969843293","commenter_b":"Feminism is cancer.","commenter_a":"Sorry lady but I put my arm around my wife because I lover her. She does the same to me and we have been married for 49 years. Maybe you ought to try a little bit of love instead of hate.","post_message":"The Dame has spoken."},{"comment_id":"588976734614882","commenter_b":"She couldn't sexually satisfy ol slick willy either","commenter_a":"Don't want her in the War Room...Remember Benghazi!!!","post_message":"Ahead of President Obama's speech to the Democratic National Convention tonight, The White House released excerpts touting Hillary Clinton's experience."},{"comment_id":"10154227931919087","commenter_b":"They can have the goof!","commenter_a":"Fake polls Hillary is up 5.6 pats in NH","post_message":"The most recent New Hampshire polls shows Donald J. Trump with a slim lead."},{"comment_id":"883354948459698","commenter_b":"Literally you're the only person I could think of that would find this as interesting as I did.","commenter_a":"'@username this cell has no mitochondria and is kicking, but my phone dies on 15% #whatatime","post_message":"Time to rewrite the textbooks again."},{"comment_id":"10153871706276051","commenter_b":"Who wears Crocs anymore?","commenter_a":"Debbie Pruitt French","post_message":"Do you wear Crocs? If so, you're probably going to want to stop ASAP."},{"comment_id":"1267683656603525","commenter_b":"She has totally lost it, poor woman.","commenter_a":"Why can't the average Democrat see the pattern of off the wall psychotic behavior that has plagued the left for decades? Conservatives don't riot in the streets, have 'safe spaces' where only we are allowed to speak, give participation trophies, or any of the other garbage. Conservatives use facts to make their points and progressives use emotions to emphasize their fake news and rally the infants rally the indoctrinated. The mass hysteria on the left is causing the country to lose focus on the threat of the real danger of the three prong attack on America and the one person at the center of all three. Barack HUSSEIN Obama is race baiting with his attacks on white cops which spurred into BLM attacks on all whites. He openly aids and encourages illegal immigrants. He built and carried in the Trojan Horse Muslim refugee program. Each of these are for the ...","post_message":"Jill Stein's crazy recount effort is over, and the realization of her epic failure launched her into a nutty rant. Stein seems drunk as she starts to shake and yell about Donald Trump, and it's really bizarre. During this strange outburst, she demands Trump  'put down' one thing that proves she is also delusional.  @webpagelink"}]
