[{"comment_id":"652127268253788","commenter_b":"To you Mrs. Michele Obama I say name me just one all white college. I am not racist, I do have several black friends. Being white of course I do have more white friends, then black friends. They seem to under stand my point. But for blacks to say they can't go here or there. I don't see those barriers. I wish we all can stop this racist name calling g and pointing fingers, at each other. I know I can name at least 4 black colleges. I just want to know if anyone can name me just one all white college.","commenter_a":"why is she there? go home & drink some tea","post_message":"A race baiter who is not proud of her country."},{"comment_id":"10153572356905329","commenter_b":"Yeah Cheryl. You stupid bitch.","commenter_a":"Not very honest of you @username - you have deliberately failed to mention the marginalization & persecution of christians & other groups who morally oppose same sex marriage, & the hardship & tyranny they now endure. You have also quite 'conveniently' chosen to ignore the increasing body of evidence that is emerging of the sense of loss, disadvantage & suffering, those raised in same sex relationships, & who have now reached adulthood, have & are experiencing - nor the vilification & persecution they can face for daring to speak out....","post_message":"Eighteen other countries have legalized same-sex marriage before America. Let's see how some of them are holding up."},{"comment_id":"10153656346543352","commenter_b":"I could careless about all that bullshit it's a proven fact your ugly ass hell & I damn sure look better than you on my bad day, you look old & wash up do your hair & get some better make up stop acting like your a model , you don't have ninjas checking for you mines face looks. Better than yours hoe","commenter_a":"Remove this dumb bitches ovaries make sure she doesn't get the chance to even enjoy a child if she ever wanted one after you take her shit out throw her away in jail","post_message":"Woman Hit With Murder Charges For Aborting Her Own 5-Month-Old Fetus In Her Car With Illegal Abortion Pill, Causing Baby To Die 30 Minutes After Abortion"},{"comment_id":"1194513290647275","commenter_b":"Yep and a drunk driver that got behind of the wheel of a car but didn't hurt anyone should not be taken away from their family and put in jail when they were caught????","commenter_a":"She's a threat to no one. They just took a mother from he children who were born in this country!! We are the one's who are threatening the lives of people who trusted us and came here to make their lives better, just like Trumps mother did. Just think, if they had sent her back we wouldn't be dealing with this heartless man! What a blessing that would be. He's done more damage in less than 3 weeks than Nixon did in about 6 years and he wasn't this bad!!","post_message":"Immigration agents “said she’s a threat, but my wife isn’t a threat,” her husband said in an interview."},{"comment_id":"10156716294680725","commenter_b":"Trump is a scum bag who steals from Veterans!!! @webpagelink","commenter_a":"Never liked Cruz and I thought Rubio seemed like a nice guy. Not anymore...give em hell @username, your the only man that can pull this off. You have had my vote from the beginning.","post_message":"THANK YOU #TrumpTrain! Lets make it a great day! Preparing now for rally at Macomb Community College- here in Michigan!"},{"comment_id":"1210507815635913","commenter_b":"No cop killers are by definition an individual who's killed a cop..An old lady with no criminal pass and bake cookies for the local fire department can be a cop killer if ever she kills a cop doesn't make her a thug though.You see by definition there not the same you can be one and not the other.","commenter_a":"RIP, condolences to his family. And, NBC would you please refer to him as a police officer and not a 'Cop'? That's disrespectful","post_message":"Officer Gregory Alia was shot and killed after responding to a call about a suspicious person inside a shopping mall."},{"comment_id":"1049317721755905","commenter_b":"full retard mode: engaged","commenter_a":"This is the evidence of existence of Allah !!!","post_message":"Our brains are truly amazing.  By Emily's Quotes, via AsapSCIENCE."}]
