[{"comment_id":"10155422567365615","commenter_b":"Assholes","commenter_a":"I hope Greg Abbott gets HIV.","post_message":"They say a budget is a document that turns values into money."},{"comment_id":"1517455414941150","commenter_b":"So what was the cause of death?!-","commenter_a":"I think they were drugged while at the hotel bar. It is becoming more and more common in foreign countries to drug and even use ether to sedate people so they can rob them. I find the guy suspicious that said when he saw in the AM that their door was as he had left it he became worried. How did he leave it...closed like every other hotel room door? It's not like housekeeping found them. This guy called mgmt and they went in. Sounds suspicious","post_message":"The autopsy for the two American sisters found dead in their luxury hotel room determined there were \"no visible signs of injuries found on the bodies.\""},{"comment_id":"10153885803644411","commenter_b":"Those UkraNazi cockroaches belong in the trash bin.","commenter_a":"Ha! The \"Trash Truck.\" lmao... Never was there a more worthy chariot for such an unworthy set of a-holes.","post_message":"It is also not certain how much protection the new tank will be able to give those operating it, as its armor is a mere 40mm thick."},{"comment_id":"897791007078142","commenter_b":"Shes ugly","commenter_a":"Gosh is she going to lose in PA again?","post_message":"Hillary makes disturbing announcement about development in Pennsylvania. We could be looking at history right now. Will you refuse to let Hillary be your president?"},{"comment_id":"1537745596485739","commenter_b":"Got it STOCKINGS !!!!!!","commenter_a":"salt","post_message":"Riddle of the day! What is it?   Quiznatic Media"},{"comment_id":"10153897957233352","commenter_b":"Stfu","commenter_a":"He was a menace to the world. He destroyed so many lives so that he can so call keep the children of Columbia to stay away from drugs. What a bum. He destroyed lives right here in the USA., way too many.","post_message":"My life with the world’s most infamous drug lord: Pablo Escobar’s son reveals the heartbreak, fear of violence and how his father once burnt $2MILLION in cash to keep warm one night on the run"},{"comment_id":"10154165530049087","commenter_b":"Ironic. Very. Seeing as his white queen did the exact thing he's bitching about","commenter_a":"Who gives a SHIT? I certainly don't care about Podesta's emails...not from before, during or after....fuck Wikileaks. Here's a thought, Mr. Assange, perhaps if you surrendered to the British Authorities for violating the terms of your bail, returned to Sweden to face the rape charge against you and STOPPED being a puppet for Russian Intelligence, maybe I'd take you seriously? The fact remains you broke the law and you lose all moral high ground when you want others punished but not yourself.","post_message":"BREAKING NEWS"}]
