[{"comment_id":"10152973367828271","commenter_b":"Now he will have to keep finding more blondes that look like his ex wife","commenter_a":"Where do I apply for this job. I have a lot of worthless information that I would love to be paid for. 😂","post_message":"It's over: @webpagelink"},{"comment_id":"1222586881085915","commenter_b":"I can't believe a woman would even consider voting for Trump unless they are Transgender.","commenter_a":"It's pretty obvious that TRUMP will be President --- and I can't wait -- Hillary would be a disaster ---No one can say that TRUMP would be worse than Obama or Hillary --- Remember don't listen to polls or media -- they are just media bias--- TRUMP TRAIN all the way to DC ---- Don't forget to VOTE in the remaining Primaries","post_message":"An honor to receive the support from golfing legend, Jack Nicklaus. I will defeat Crooked Hillary Clinton in November, and we will MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"634938303363415","commenter_b":"god i hope his on his way to you for judgment","commenter_a":"Hey Obama time for you to step down!!!","post_message":"Obama's health is at risk, he may not finish his presidency.  He should resign. If his health is becoming an issue, it's a no brainer.  Would you be happy to see Obama resign from the presidency?"},{"comment_id":"10153165521747217","commenter_b":"Yes.. haha true because their women are so beautiful ;) :)","commenter_a":"Next time Netanyahu - global warming also caused by Palestinians","post_message":"Germany steps in after Israel's prime minister claimed a Palestinian leader told the Nazis to kill Europe's Jews"},{"comment_id":"10154550859487464","commenter_b":"There are much better health coverage alternatives out there. Feel free to private message me for details.","commenter_a":"We tax payers all got fleeced big time.","post_message":"“The reality is the Affordable Care Act is no longer affordable for increasing numbers of people.”  #FullRepeal: @webpagelink"},{"comment_id":"1064573833613565","commenter_b":"So much hate is was fuels the violence like what happened in Orlando .for all that keep on with with Muslim need to die why hide your face if your so though to say thoughts words only cowers hide behind masks .....","commenter_a":"Gun control does not work and this is proof","post_message":"The FBI, Orlando Police and officials gave an update on the Pulse terror attack. Here's the latest: @webpagelink"},{"comment_id":"10152833752231130","commenter_b":"Hell yea older woman know what's up:) Amber Gray","commenter_a":"Lol. Ian.","post_message":"Yet women prefer to be younger than their partner."}]
