[{"comment_id":"10153716736973984","commenter_b":"That's one ugly girl","commenter_a":"This is more disruptive than any dress-code the kids could break. If a kid can't wear a t-shirt with our STARS & STRIPES, for example, then this person should not be allowed in the girls restroom and locker room. Period. There is no reason an alternative restroom shouldn't suffice.","post_message":"These students just sent a BOLD message to this school after a transgender classmate said he should be allowed to use the girls bathrooms and locker room. And it's not a message that the school can overlook... Do you support what these students did?"},{"comment_id":"10153277383852098","commenter_b":"It's not typical. Do you think people don't need to know?","commenter_a":"Wow, sharks are seen in their natural environment!! How shocking!😱😱😱","post_message":"SHARK WARNING: Experts say a school of some 20 great white #sharks was recently spotted by the U.S. Coast Guard off a Bay Area coast. READ MORE ---> @webpagelink"},{"comment_id":"10158500628960389","commenter_b":"As a Hispanic born in the US, no Jorge Ramos! This country does not belong to illegals! You're are crazy and delusional, if you love Mexico so much go back there and see how it goes for you! We are not against legal immigrants, it's the criminal illegals that should go back! So screw off and shut up!","commenter_a":"Deport Ramos. I'm an immigrant and can't stand him.","post_message":"Univision anchor goes on an ethno-nationalist tirade."},{"comment_id":"902649573193973","commenter_b":"And the nasty muslims rape goats","commenter_a":"There are police outside Catholic services in NYC right now. And Jewish services. But not allowed at mosques because it's insulting.","post_message":"“If you've got nothing going on [in mosques] but a beautiful religious service, why in His name would you not want to have police officers?” – Rudy Giuliani reacts to the #OrlandoShooting and Donald J. Trump's push for more surveillance"},{"comment_id":"10154404411899877","commenter_b":"Well said","commenter_a":"We have a long way to go when race and sexual identification are listed when recognizing someone for a new position. Only time sexual orientation should be consider is when trying to hook someone up on a blind date.","post_message":"A black, queer woman being named EIC is one of the biggest media brands in the world is EPIC!"},{"comment_id":"10155256275191002","commenter_b":"She's a cunt","commenter_a":"I was there! It was great! So exciting, so much energy, great speakers and it was wonderful to see our future President in person! :) She is marvelous!","post_message":"LIVE: Hillary Clinton is set to speak at a rally in Eastern Market Corporation."},{"comment_id":"1291488564240340","commenter_b":"Sorry but she is an unhinged dingbat.","commenter_a":"I'm concerned after reading today's Buzzfeed Report that the now well publicized 1986 letter by Coretta @username was not made a part of the Record then (in apparent subterfuge by Committee Chair Throm Thurmand ?). Now Sen. McConnell, by invoking Rule 19 may well have prevented the inclusion of this letter in the official record once again, in spite of the continued publicity it has received during the hearing. Our History is thus written by the \"Vicors\". Maybe it is still possible to insert that letter into the official Record of the Debates.","post_message":"I’m deeply disappointed that the Senate voted to confirm Jeff Sessions as Attorney General tonight. Deeply disappointed that the Senate confirmed an AG whose record does not show he will faithfully and fairly enforce the law. Thanks to you, everyone now knows the concerns that Coretta Scott King had about Jeff Sessions. Concerns that millions of people still have. There’s no Rule 19 to silence me from talking about Jeff Sessions anymore. So let me say loudly and clearly: This is just the beginning. If Jeff Sessions turns a blind eye while Donald Trump violates the Constitution or breaks the law, he'll hear from all of us. If Jeff Sessions makes even the tiniest attempt to bring his racism, sexism, and bigotry into the Justice Department, he'll hear from all of us. And you better believe every Senator who voted to put Jeff Sessions’s radical hatred into the Justice Department ..."}]
