[{"comment_id":"10153866253733984","commenter_b":"Neurotic sad women","commenter_a":"Go TRUMP","post_message":"This is exactly what makes Donald J. Trump such a polarizing figure. Some people love him for this sort of thing, and some people hate him for it. Are you one of the ones that likes him?"},{"comment_id":"898756240177140","commenter_b":". . . and it's just going to get worse until we deport them all ! ! ! !","commenter_a":"LOL. LOL. These retarded Liberals! Can't we all just get along... you stupid liberals have brought this into our country... and now it will be like the middle east... Socialist DEMOCRATS SUCK!","post_message":"(Video) Is 2015 the year we see outright war between radical Muslims and Americans on our streets? As exemplified by the actions of these Texans, Americans will push back against Islamization with highly provocative moves. Will Obama be able to keep his jihadists in check until he declares Caliphate? Read More + Video: @webpagelink"},{"comment_id":"10154522973374102","commenter_b":"She may be the lesser of two evils, a female, a scapegoat, but she's still a nut job.","commenter_a":"I'm not saying she doesn't deserve disciplinary action, because she does. But I find it disgusting that they are targeting ONLY her, and not Trump's tweets against Nordstrom. I get that she's an easier target for the GOP, but grow a pair of balls, please.","post_message":"BREAKING: The Republican chairman of the Oversight Committee is recommending disciplinary action against Kellyanne Conway for promoting Ivanka Trump products from the White House, including \"reprimand, suspension, demotion, or dismissal.”"},{"comment_id":"588476011355911","commenter_b":"I've actually flushed stuff better looking than this retarded skank!","commenter_a":"Why don't you leave like you said you would?","post_message":"Loud mouth Whoopi and her co-hosts are making serious unfounded accusations and demanding Trump step down. Let's get 5,000 'SHARES' & 'LIKES' to show that Whoopi is the one that America wants to see \"STEP DOWN!!!\""},{"comment_id":"10153552144846636","commenter_b":"Wow.. boo hoo. There's no \"controversy.\" Just a few crybaby parents who probably don't like soccer. This team is generating money in the Yukon community and also generating money for the school during a time of need. People should be thankful, not critical. This team isn't cutting into the school budget in any way, chill out.","commenter_a":"KFOR you need to get rid of the pop up ads your page uses!! Can't read a complete story or watch a video without getting a redirect to somewhere else. You are the only news station page there are issues with!","post_message":"\"By no means was it ever intended to say hey this is ours now.\""},{"comment_id":"10153513922564087","commenter_b":"Typical obfuscation from a serial liar & all-around nasty woman,","commenter_a":"Bernie will release whatever you ask him to. He has nothing to hide!","post_message":"“Let everybody who’s ever given a speech to any private group under any circumstances release them,” Hillary Clinton said on ABC’s “This Week.” “We’ll all release them at the same time.”"},{"comment_id":"10153356571252093","commenter_b":"Pretty sure I could peel an orange by age 6. (Or if they just CAN'T, that's what mothers are for!","commenter_a":"That people are so lazy they'd pay for a peeled orange is discouraging.","post_message":"If only nature had a way to cover and protect these oranges.... @webpagelink"}]
