[{"comment_id":"1131664770254026","commenter_b":"You should try to get one. Aiden needs a service dog as well.","commenter_a":"@username you need one!","post_message":"✔ Laundry ✔ Dishes ✔ Shopping WATCH: This service dog in training is wowing the internet with all the ways she helps her chronically ill owner @webpagelink"},{"comment_id":"10154143941493984","commenter_b":"OF COURSE IF THEY FIND BLOOD FROM THE VICTIMS ON THE KNIFE, IT WILL BE TO LATE TO USE AGAINST OJ! BUT CAN ANYONE IMAGINE, IF THE PRISONERS FIND OUT ABOUT THAT, HE'LL NEED ALOT OF MONEY TO KEEP HIM SAFE IN PRISON!","commenter_a":"This must be the month of truth telling in EVERYTHING!","post_message":"Wow. What was found buried on O.J. Simpson's former property could change everything. This is a HUGE twist..."},{"comment_id":"10154680684123797","commenter_b":"Lisa Austin","commenter_a":"Okay, now this stupid game of Chicken is getting out of control! 😡😡 Someone needs to blink or all of the children in Illinois are going to suffer!!😡😡","post_message":"#BREAKING: Chicago Public Schools will not open in the fall if Illinois fails to approve an education budget, CPS CEO Forrest Claypool told the Chicago Tribune Wednesday."},{"comment_id":"761832037248738","commenter_b":"The Dell was your first mistake buy a Mac or a HP","commenter_a":"Bubba killed the jukebox last night...","post_message":"\"Man Kills His Computer.\""},{"comment_id":"10156527615820206","commenter_b":"She's getting my vote. I want a woman in the White House.","commenter_a":"Seeing Carly on Tuesday, can't wait!!","post_message":"Such a great welcome from supporters in Mackinac Island, Michigan today!"},{"comment_id":"10152582982555950","commenter_b":"Im guessing she's a real bitch...","commenter_a":"he could have just said he wanted a divorce,","post_message":"The man's wife didn't know about or give permission for the demolition, police say."},{"comment_id":"10152967857461519","commenter_b":"Yeah, I am sure all the female open carriers/ gun owners are using firearms to compensate for their small penis'","commenter_a":"Tari, have you ever actually read the second amendment? It calls for a WELL-REGULATED militia. Not just any white supremecist or Al Qaida operative who goes to a gun show. In Vermont you have fewer urban areas. It is like saying nobody gets mugged on a row boat. I am a gun owner and I really wish that buttholes like you and these NRA pimps with your illiterate interpretation of the second amendment would go help someone else. Ammosexuals are giving responsible gun owners a bad name.","post_message":"\"A law requiring people to apply for a permit before buying a handgun helped Connecticut quietly reduce its firearm-related homicide rate by 40 percent.\" Imagine how many lives could be saved if other states passed similar laws."}]
