[{"comment_id":"10154211754086509","commenter_b":"Immigration, no; Illegal invasion, yes!!!","commenter_a":"I get that people are against immigration. But some of these comments go to show how Inhumane people are. Sickening. (Since people don't know how to read and have messaged me ugly things saying how I should take them in...I'm going to state that I agree with immigration restrictions but I do not agree with having them DROWNED or KILLED.) Jeez.","post_message":"A Polish teacher asked students to calculate how many Syrian refugees had to be thrown overboard for a boat to stay afloat and reach Greece."},{"comment_id":"1231960196816235","commenter_b":"Europe and America is being invaded...Those invaders who want to hurt us are being helped by our own president Barrack Obama. I have compiled videos and links that when put together, you will have a full understanding on how our country is being invaded. Please help spread this around the country--Radio stations, tv stations, governors,mayors, groups,unions, etc. Let's not act as democrats or republicans. we all need to unite and fight for our country as Americans. @webpagelink There is no refugee crisis. The six wealthy Gulf countries Qatar, the United Arab Emirates, Saudi Arabia, Kuwait and Bahrain have offered to receive exactly zero Syrian refugees. Did you ever wonder why these countries won help their fleeing Arabic Muslim companions? One word: Hijra. Hijra is the Arabic word for , used to besiege new territories.Those travelling are able bodied strong men who are very capable of doing harm. If there are ...","commenter_a":"Let them resettle with the Federal judge in his secured gated community!!!! But not on Texas!!!!!","post_message":"Texas hit a major setback on Monday after a federal judge rejected its efforts to block Syrian refugees from resettling in the Lone Star State."},{"comment_id":"10153322219778188","commenter_b":"@username......... you're making me hungry!!!!!!","commenter_a":"Should they be wearing ball caps and tennis shorts? You equip with the best available to protect yourself.","post_message":"Local police are now often seen equipped with the same gear and weapons you would see in a war zone. How did this happen? @webpagelink"},{"comment_id":"1284242998285633","commenter_b":"Proving they are not protesting anything really. They are just out to murder anyone they can for fun! Thugs paid for by Soros, Clinton's, Obama and others wanting one world government. Just like the Nazi regime but it will be 10 times worse. Liberals are too stupid to realize that. Until something they voted for creates a bad situation for them. Then they blame everyone else.","commenter_a":"That is really beneath everyone.","post_message":"So basically, this is incitement to murder and cops should treat them accordingly...what should they do?"},{"comment_id":"10154710996716800","commenter_b":"HHHHHHHHHHHHHH MRDOH hhhhhhhhhhhhhhhhhhh","commenter_a":"Ilyass darori tchouf had lvid XD","post_message":"Ronny Chieng makes a desperate plea to a batch of undecided voters ahead of Election Day. #election2016"},{"comment_id":"10153058205158984","commenter_b":"Good job, give the woman a raise.","commenter_a":"Would her employer be happier if she was the one who was shot??? I commend her for having the courage to stand up for herself","post_message":"I don't think this robber thought that holding a woman on the ground at gunpoint would land him a bullet to the face, but this gal delivers more than just pizzas! Do you think this woman should be afraid of getting fired for defending her life?"},{"comment_id":"771105652991563","commenter_b":"It would be a GREAT PLACE TO START.","commenter_a":"Yes","post_message":"It is widely known that George Soros was affiliated with the Nazi Party, and he's also a major financier of a number of democrat programs."}]
