[{"comment_id":"351086708348331","commenter_b":"All about the MONEY Honey.","commenter_a":"It has profited as much as it can.","post_message":"“One source confirmed to me Caitlyn Jenner has made whispers of ‘sex change regret,’ hinting she might go back to being Bruce Jenner.” - Ian Halperin"},{"comment_id":"10152950589906051","commenter_b":"Let's throw her away with out anything too hope she go to hell","commenter_a":"This is true evil!","post_message":"Even the police were a little surprised that someone could be so cruel for no reason."},{"comment_id":"10150887913809999","commenter_b":"Ya and she is going to jail if she don't win so she will say anything to get her way! She will do what ever it takes.... Murder . lie . steal. #Trump2016 #MakeAmericangreatagain #GodblessAmerican","commenter_a":"I can't believe Americans will vote for this idiotic woman, but they will and bring another 4 years suffering to the world","post_message":"\"Donald Trump has built his campaign on prejudice and paranoia. He is taking hate groups mainstream and helping a radical fringe take over the Republican Party,” Hillary Clinton said."},{"comment_id":"10157410522280294","commenter_b":"Love these type of storms..","commenter_a":"Thanks for the pictures. Please stay safe. If you have reports of any damage please let us know","post_message":"Dark storm clouds roll into the Cleveland area"},{"comment_id":"10154876019385329","commenter_b":"Better fat than a dumb Mexican. Have fun once trump is elected. Fool. Lol","commenter_a":"\"Fat\" the word you are looking for is \"Fat\"","post_message":"Simone Mariposa told BuzzFeed News she created #WeWearWhatWeWant to \"highlight plus-size girls making unconventional fashion choices, and looking amazing\"."},{"comment_id":"868880693208184","commenter_b":"She is a liar","commenter_a":"You idiots have hit the bottom of your now famous SKUM barrell!!!! Cant you all find anything on the first woman president to be besides a cell phone E-MAIL really!!!!","post_message":"Blackberry-toting Clinton is now an action figure."},{"comment_id":"872299812875772","commenter_b":"Hillary is spreading disgust. She's a shameless, pathological liar with no morals at all.","commenter_a":"She is a complete idiot as well as a liar.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"}]
