[{"comment_id":"1251904504850405","commenter_b":"scum. I hope someone cuts your dick off. Then you can really be a women. Until then stay in your own damn bathroom and leave us women alone. One of these days yours is coming.!!!!!!!!!!!!!!!!","commenter_a":"single occupancy facilities is the only sensible answer. But that ain't good enough for the terminally aggrieved.","post_message":"👏 👏 👏 (via The Huffington Post)"},{"comment_id":"10153712165499138","commenter_b":"I'm not a hunter, however, anyone who eats meat has no right to be against hunting your own meat. At least the animals being hunted have a chance and have a good life in the wild. Anyone who eats grocery store meat should try going to the farm that the meat came from, those animals have it far worse than a dear dying from a quick shot.","commenter_a":"Stop this hunting that's what he gets","post_message":"A reminder worth sharing. Have a safe hunting season."},{"comment_id":"1168211463199863","commenter_b":"It's there. (Fuscia)","commenter_a":"I couldn't find New Zealand in there either. I suppose with a population of only 4.5 million...it's no wonder why.","post_message":"Where did Australia disappear to ..."},{"comment_id":"10154261283691350","commenter_b":"Yes, those dang gators.","commenter_a":"@username, is this the real reason you're leaving Florida lol","post_message":"Is that thing real?!"},{"comment_id":"586488074867632","commenter_b":"There needs to be at a 10 yr moratorium on any immigration!! From 1920-1965 there was no immigration whatsoever. The reason was: from around 1889-1920 there were 14 million immigrated allowed into the USA & the Govt said they needed to get acclimated & learn English, to become Americans. This needs to start again!!","commenter_a":"None we are full up","post_message":"Currently, the U.S. allows 1 Million legal immigrants every year. New poll of voters found most want the number cut at least by half. What do you think?"},{"comment_id":"10154725381070579","commenter_b":"You may want to look into Stein or Johnson... Hillary is a corrupt habitual liar and anyone that does not see it, is not the sharpest knife in the drawer...","commenter_a":"I'm a United States Army Veteran and I'm With Her. Trump's complete failure to understand basic foreign policy concepts, his relationship with Putin, and his out-of-control ego are a one-way trip into a third world war. His kind of \"leadership\" is the last thing America needs. Clinton isn't perfect but she's better than any of the other candidates today.","post_message":"Active & Retired Military: Your choice in 2016?"},{"comment_id":"10154321620193188","commenter_b":"When are women going to start taking responsibility for their choices?","commenter_a":"Does this mean @username is going to stop telling women what to do with their bodies?","post_message":"While we may disagree on specific issues, if we stop trying to control each others’ lives, those issues (for the most part) become irrelevant."}]
