[{"comment_id":"653037578220154","commenter_b":"We always saluted the flag every day at school. And sais the Pledge of alligence. Also prayed.","commenter_a":"YOU CANT BE SERIOUS !!!! RULED AGAINST' THE AMERICAN FLAG ???? NO WAY IN HELL SHOULD THIS HAPPEN !!! NO WAY !!!! .","post_message":"The court has just ruled against the American flag.  This is un-American. We stand for the flag forever and always.  Can we get 30,000 'LIKES' for the American flag?"},{"comment_id":"10152933046001051","commenter_b":"Lady get it straight..stay home Granny! No, i'm not following you...Really!!!","commenter_a":"I sure hope not","post_message":"Here is Hillary Clinton's first campaign video. Simple question: Will she be the next President of the United States?"},{"comment_id":"10154434943826323","commenter_b":"The Arab trade was on a larger scale mate.","commenter_a":"The British Empire and other European nations were not the only ones responsible for the suffering of blacks. For centuries, Arab and Berber traders made big profits from the highly lucrative 'business' of slavery. Millions of black Africans were captured/kidnapped from their homes, abused and sold in slave markets. Today, In places like Saudi Arabia and Qatar de facto slavery still exists. People from the Philippines, Indian subcontinent etc. live and 'work' there in subhuman conditions. This is not a history lesson. It is happening right here and now. None of this justifies in any way the crimes committed by European colonialism in general and the British Empire in particular against indigenous peoples. But I do hope Mr. Gayle (whom I respect) will not hesitate to write/speak about injustice and racism that still exist in other parts of the world - including in African and Arab nations - with the ...","post_message":"Howard Gayle: \"The education system told me nothing but lies about Africa.\""},{"comment_id":"1603977773244161","commenter_b":"Revoke her clearance!","commenter_a":"BREAKING: HILLARY SET TO RECEIVE SECURITY CLEARANCE ANY DAY NOW!!! She broke the law. She exposed our nation secrets. She lied to the American people countless times. And yet, this week she is set to receive access to information she already proven she can handle. We cannot allow Hillary to put America safety at risk. Demand the FBI revoke her security clearance","post_message":"Tom Fitton is LIVE to discuss our Judicial Watch weekly update on the Obama IRS Scandal and more!   [touch sound icon at bottom right to increase the sound or turn your own volume up. Thx! . ]"},{"comment_id":"10155050454914469","commenter_b":"White girl wasted","commenter_a":"I'm chocolate wasted","post_message":"BABY GIRAFFE WATCH: We are waiting for April to have her calf! Will it happen today? bit.ly/2l14Zin (Video via Animal Adventure Park)"},{"comment_id":"10153203722519614","commenter_b":"You must talk a lot huh? I said NOT ALL Pitts... Damnnn women take a deep breath. Move on peace out, relax.","commenter_a":"Another Pitbull attack! Unfortunately we all probably knew this was the case even before reading the story. I'll be shouted down by Pit defenders as is their norm, but I don't care. No other breed is killing other dogs and humans like this, and this breed needs a re-set NOW.","post_message":"A French bulldog puppy that died after being attacked by another dog while in the care of a Petco-owned dog-boarding facility has prompted calls for #justiceforboggs.  The Pooch Hotel Hollywood representatives initially told the dog's owner that Boggs was taken to a vet as a precaution after an altercation, according to the owner's roommate. About 45 minutes later, an ER vet called to say the puppy was in critical condition with a torn trachea and multiple internal injuries.   Described as \"13 pounds of pure joy,\" Boggs was put down as her out-of-town owner listened helplessly on the phone. Now she is considering legal action.  Read KTLA's story here: @webpagelink"},{"comment_id":"2033407076758008","commenter_b":"Ghetto Trash !!!!","commenter_a":"Why would the \"demoncrats\" dump Brazil's ... nah ... to start with she's black like ODUMBER and after all she fits right in with CROOKED KILLERY ...","post_message":""}]
