[{"comment_id":"497623757113047","commenter_b":"He doesn't lie almost as much as his father. Considering his age, he and his father are even in the lying department.","commenter_a":"I'd like to have that much nothing.","post_message":"Eric Trump lies almost as much as his father. --Andrew"},{"comment_id":"10153565125016162","commenter_b":"Evil. What is so sick about our world is that moms and dads kill their babies every day by the thousands. It's called abortion. We should be as offended and grieved at the kids killed in the womb and out of the womb.","commenter_a":"Typical crackhead POS!!!! He should commit suicide.","post_message":"CHARGED: Young parents arrested after newborn found to have 20 fractures, police say: @webpagelink"},{"comment_id":"10153243727475667","commenter_b":"@username Ireland built America, because the locals were too lazy. Shall we continue with stereo types, girls?","commenter_a":"I assume none of you gun-lovin' yeehars will ever come over and visit civilised nations. Just keep your gun addiction fetish stateside, and you won't have a problem. Try and set foot outside of your bunker, and your shiny, highly polished barrels will be removed from you. And so your manhood shall be no more. Bless your cotton socks. :)","post_message":"You can now open carry at ticketing and baggage claim."},{"comment_id":"538555889666037","commenter_b":"SHE IS NOT A SMART WOMAN","commenter_a":"She fails at everything'. We need #Trump2016","post_message":"She NEVER learns..."},{"comment_id":"10153101656568717","commenter_b":"You call that a women?","commenter_a":"I was always taught that women are to be loved honored and respected. So she hit him any Real man would have walked away and let the cops handle it","post_message":"This video may be hard to watch. Officials in Florida released surveillance video of Florida State University quarterback De'Andre Johnson punching a woman in the face: @webpagelink Johnson was dismissed by the team today: @webpagelink"},{"comment_id":"10154537125069024","commenter_b":"Bunch of boobs.","commenter_a":" Congratulations America!!Finally...a leader!!!! @webpagelink","post_message":""},{"comment_id":"862139507221510","commenter_b":"Obama and Trump should get along splendidly then.","commenter_a":"Hillary is running a close second or maybe she is in first place.","post_message":"Yes he is! Do you agree with Trump?"}]
