[{"comment_id":"10154239882011509","commenter_b":"So is everyone just supposed to sit back and watch how ISIS does whatever the hell they want? I think not. War is a terrible thing, innocent peolle die just like they did in France and just like they did in other wars. It can't be justified, but if nothing is done about the situation we will all be required to memorize the Qu'ran soon, not to mention have our way of living destroyed by these pigs.","commenter_a":"French warplanes take off from an aircraft carrier,killing #InnocentChildren in #Syria and #Iraq","post_message":"French warplanes take off from an aircraft carrier, attacking #ISIS in #Syria and #Iraq.   The latest: @webpagelink"},{"comment_id":"875288902530859","commenter_b":"I think she looks much better than that freak of nature.","commenter_a":"No no no no no! Wrong in so many ways... You need MUCH MORE Booty gf.","post_message":"My weekend as Kopycat Kim Kardashian."},{"comment_id":"10153981552219641","commenter_b":"I could care less how racist this is, but Belgium needs to deport every last Radical Muslim!","commenter_a":"Jai shri krishna Namaste.ji","post_message":"\"We will do whatever is necessary to support our friend and ally Belgium...\": U.S. President Barack Obama comments on Brussels terror attacks. @webpagelink"},{"comment_id":"10153850185846770","commenter_b":"Women talk about men in all women groups too.... no one ever talks about that but women can get raunchy too....","commenter_a":"So guys can't be guys and talk in private? I bet 100% of the people whom have a problem with this are guilty of doing the same thing in some fashion in there own lives but let's make a big deal about ABSOLUTELY NOTHING","post_message":"Her name is..."},{"comment_id":"10154154214551509","commenter_b":"Hahahahaha","commenter_a":"All I know is, if I ever overdosed in a whorehouse and my wife and my mama found out, skip the cpr. I am better off dead.","post_message":"After ex-NBA star Lamar Odom was found unresponsive in a brothel owned by Dennis Hof, the reality TV star swung into damage control mode.  \"My business is built on privacy and discretion,\" he said. \"But when the ambulance pulls out and five minutes later TMZ calls me, you have to deal with it.\""},{"comment_id":"10153695940741955","commenter_b":"Does she get virgins too?","commenter_a":"ew....that is all...","post_message":"UNDER THE BURQA"},{"comment_id":"877314922325204","commenter_b":"What would you expect him to say? I wonder how this country got to where it is today since we need more immigrants on welfare to advance us.","commenter_a":"rose colored glasses ? Go talk to your Dad and brother !!!!","post_message":"Don't you agree Jeb Bush is WRONG on immigration?"}]
