[{"comment_id":"10154287048884205","commenter_b":"TYT hello from Juneau Alaska! We are on the watch out here! Trump might sell us off back to the Russians, for a few barrels of oil!","commenter_a":"Hi Joe!!","post_message":"The Young Turks LIVE! Hosted by Cenk Uygur and Ana Kasparian"},{"comment_id":"1040915009338084","commenter_b":"'@username your argument fails in a few ways. 1. A child is not a child until it is born. 2. Her body, her right. 3. What if she was suffering complications from said pregnancy? What if she was raped? What if it was incest? Would you still argue that she hasn't the right? Because if so, you're giving a living woman less bodily autonomy than a corpse.","commenter_a":"good","post_message":"There has been no time since Roe v. Wade when abortion hasn’t been under attack... But this moment is different."},{"comment_id":"10154502608806051","commenter_b":"Shut up","commenter_a":"Chelsea sorry to say don't qualify as woman she is a pig .only flilthy mouth people it would draw to the show . Its isn't either from the species called human the bag she has she took from garbage dump she lives in","post_message":"Chelsea Handler is sparking some serious controversy over what she's holding in her hands outside the White House in this viral picture."},{"comment_id":"974409115948951","commenter_b":"Yes I have! She'll make an excellent prison wife. So biblically submissive.","commenter_a":"Have you seen this yet, Guy?","post_message":"Marriage equality is the law of the land. Officials should be held to their duty to uphold the law—end of story."},{"comment_id":"1058553324165678","commenter_b":"That's it women take everything, soon they'll be complaining about not competing against men in the olympics, #equalityformen","commenter_a":"Yea thats cute... but look at developers these days... 99% are men. you wouldnt be on facebook talking crap right now without men.","post_message":"Margaret Hamilton was the lead flight software designer for Project Apollo. Just 31 when it landed on the moon, and her code has been credited for preventing an abort of the mission.  #womenyoushouldhaveheardof"},{"comment_id":"997010993718412","commenter_b":"Islamic Terrorist, go home, stop trying to change the U.S.A.","commenter_a":"No true American is safe as long as Islam is allowed to exist in our nation! We true Americans must unite against this plague and the liberals who allow them to destroy our lives and wipe them from our nation so we can ensure the safety and security of our nation and the American people!","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack.  He is a hero, and will always be remembered as so.  Can we get 150,000 'LIKES' for this brave boy?"},{"comment_id":"520761104778849","commenter_b":"Muslims are taking over united states they run all motels and 7 elevens in the country I don't know if its cause our government gives them a break on payinv taxes!","commenter_a":"political correctness......","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
