[{"comment_id":"982153291907152","commenter_b":"The wall wont be anywhere as effective as you think. All it will do is provide more cover for traffickers.","commenter_a":"Texas here! We NEED THAT WALL!! 1 million dollars worth of drugs just confiscated last week that came from Mexico! Happens ALL the time! It must stop!","post_message":"Watch: Donald J. Trump addresses the American Legion National Convention in Cincinnati, Ohio"},{"comment_id":"1414911755215699","commenter_b":"Stupid bitch","commenter_a":"Taylor Paton @username Barrett Paton @username Clint Paton So the house will always smell like a fuckin' bucket.","post_message":"No, you cannot eat the candle."},{"comment_id":"1113705405389179","commenter_b":"Why do we have 400,000 permanently disabled Americans? Oh because of the 2,996 people killed and more than 6,000 injured during 9/11? So we lost more Americans in good health because war mongers like Hillary Clinton wanted to strike back? Thanks Hillary for your vote on the Iraq War.","commenter_a":"Thank you, Obama...we love you as a President!","post_message":"Excellent news for 400,000 Americans!"},{"comment_id":"850731841652961","commenter_b":"Another inbred rightwing BITCH! lmao.. Throw her to the lions! :) I wouldn't wipe my ass with the satanic black book of lies she learns from.. \"C-NT!","commenter_a":"One ugly MF !!!","post_message":"Her lawyer says it's not about bigotry. She says it's about her faith. But bigotry comes in many forms, and she's using her faith to justify it:"},{"comment_id":"949176475215531","commenter_b":"The some bitch had a beautiful bitch at home dammit quit taking up for this clown","commenter_a":"But he only talked about fuckin another chick. Shit people left and right young and old talk about wanting to bang women. I do it all the time? Bill followed through, no confirmation of trump cheating and/or raping/fucking another women. Hop off the high cloud, and take a step into reality.","post_message":"This is just horrible..."},{"comment_id":"10153866253733984","commenter_b":"Neurotic sad women","commenter_a":"Go TRUMP","post_message":"This is exactly what makes Donald J. Trump such a polarizing figure. Some people love him for this sort of thing, and some people hate him for it. Are you one of the ones that likes him?"},{"comment_id":"1062576617115128","commenter_b":"I think if Americans knew the reason and how our fresh produce(picked by illegal and legal migrants) become contaminated with ecoli and other harmful filth- we would all choose trained Americans to harvest our FOOD. People pay more for organic produce, unsoiled produce is just as valuable.","commenter_a":"The farmers did it to themselves. They gave those jobs, back in the 60s, to illegals who worked for cents on the dollar - and American families were shoved out of the industry. Don't say there aren't people out there who won't do the work. There WERE people out there doing the work - and they threw them away. Let's FIRST - get rid of them ALL - and give it a year to play out to see where we actually NEED work visas. If american companies (and farmers) can show that they diligently TRIED to hire Americans and could not get the skill or number of people they needed - FINE, then they can apply to bring people in on VISAs.","post_message":"THE #1 ISSUE FACING AMERICA Recently, I joined Dr. Carson to discuss immigration. We met for 90-minutes. I shared my experiences, opinions, concerns, and solutions with him. Topics ranged from border security, terrorism, drug and human trafficking, the impact on jobs, wages, welfare, education, culture, and healthcare. HIGHLIGHTS OF WHAT I SHARED: 1. Last year, after announcing I’d explore running for president myself, Megyn Kelly asked why I wanted to be president? I replied, “I hold the sort of conservative values which America needs today. And in the same way Reagan kept his word by bringing home the hostages, I promise to secure the border and solve the immigration problem. I went on to say I'd protect the American people, their lives, their jobs, their health, and their children in the same manner I protect my own. I told her audience I was in love with America. Later that night ..."}]
