[{"comment_id":"1247598538653217","commenter_b":"Cheap wages and NO regulations. So tell us, what's unreasonable? Are the international businesses really hurting that bad? Oh, right, it's the \"shareholders\" that are burdened","commenter_a":"Government caused the exodus of manufacturing. 35% corporate tax, EPA regulations, inflated wages, high energy costs. Don't let government fix anything. All they do is break things.","post_message":"Too many working families in the Midwest have been left behind because of the outsourcing of American jobs. I led a letter with Rep. Debbie Dingell and 24 other colleagues to urge Congressional Leadership to expand opportunities in manufacturing communities harmed by outsourcing. It is critical Congress takes immediate action to jumpstart the economic prosperity of our communities."},{"comment_id":"10153117633836051","commenter_b":"I think Cindy is jealous cuz her double wide doesn't have a closet! And Barbara, don't join the dumbass train, I clearly cannot teach this old dog new tricks, but if she has the right to call people queer then I have the right to call her stuff, correct?","commenter_a":"Shame on the Queers.","post_message":"A CNN host went on a lengthy rant about spotting an ISIS flag at a gay pride event this weekend. There's just one problem."},{"comment_id":"938149182885501","commenter_b":"I lived in a place in LA and I'm a clean freak but the apartment on the other side of the wall was dirty people causing me to get roaches. Now I moved outta Florida for one of those reasons. Thankfully I don't see them in Washington state","commenter_a":"Thanks for the report as high as rental apartment are they should have pest control ridiculous!!","post_message":"Imagine opening up every cabinet and drawer, and seeing nothing but roaches... Mark Rivera took the residents' concerns straight to management STORY: @webpagelink"},{"comment_id":"856436467738235","commenter_b":"Hang her!","commenter_a":"I'm a cabbie and I wish I could catch every person that skips on me","post_message":"A judge told this teen she could either walk 30 miles within 48 hours--or go to jail. She chose the long walk. See what she did below. Do you think the punishment fits the crime?"},{"comment_id":"1401035306583488","commenter_b":"Trump was sneaking in another drug shipment.","commenter_a":"Well government systems are remarkably insecure compared to the sensitivity of information on them. If Republicans would stop slashing operational budgets maybe we would have security of information across government. So shortsighted. So small minded.","post_message":"U.S. Department of Homeland Security employees in the Washington area were unable to access some agency computer networks on Tuesday, according to three sources familiar with the matter."},{"comment_id":"10153167321611519","commenter_b":"Appealing still to fear & hate.","commenter_a":"Dislike!","post_message":"This is why he's shooting to the top of GOP polls..."},{"comment_id":"10153238484143984","commenter_b":"Screw the bitch and her lying ass husband.","commenter_a":"Move out bitch","post_message":"People are furious, and I can understand why. Do you think Michelle is an out of touch First Lady?"}]
