[{"comment_id":"998045550284803","commenter_b":"i i think trump should have an abortion and have his you know w hat removed along with his tongue","commenter_a":"Is he going to waterboard women too?","post_message":"BREAKING:"},{"comment_id":"1547490425548819","commenter_b":"Hillary is worse than any of that and if elected she would be appointing supreme court justices who are in there for life. It is unfair to say that we need to re evaluate our values because we want some one who can beat her. In the end America as a whole is not voting evangelical prudence and wisdom would say pick any one who can beat her. My one and only comment. Blessings sister...","commenter_a":"Christians who support Trump need to reevaluate their values. I've never heard of Christians supporting a strip club owner who defends Planned Parenthood and doesn't care about marriage, but that's just me. Oh yeah, and swears continually!","post_message":"Editors' Note: The Christian Post has not taken a position on a political candidate before today. We are making an exception because Trump is exceptionally bad and claims to speak for and represent the interests of evangelicals."},{"comment_id":"10153507125536749","commenter_b":"So tell me how more gun laws are going to stop criminals and terrorist? or are going to do the only thing you do best Lie ,cheat and screw Americans! @webpagelink","commenter_a":"TURCIA = TU Rusia CIA","post_message":"The Clean Power Plan is part of American leadership on climate change."},{"comment_id":"1305722922778581","commenter_b":"Sean Connolly","commenter_a":"Logan Laybolt","post_message":"Tian Tian the panda enjoyed the snow this morning! Video via the Smithsonian’s National Zoo and Conservation Biology Institute"},{"comment_id":"1303998932977651","commenter_b":"Your a straight up pussy for that one. News flash dumbass your girls a ho","commenter_a":"A \"real nigga\" dont sneak shit..look like he aint wake dude up till bout the 5th punch..weak shit 😂😂","post_message":"He beat his a$$! #WSHH"},{"comment_id":"897936806940850","commenter_b":"DUMBASSES!!!!!!!!!","commenter_a":"People take note of these 18 cities and steer clear.","post_message":"ALERT: These 18 U.S. Cities Just Made Terrifying Announcement About Muslim ‘Refugees’… Do YOU Live There? @webpagelink"},{"comment_id":"10154379818081509","commenter_b":"Go away Judy womble","commenter_a":"Shut up Donald...go away","post_message":"\"I think she's right -- I am angry.\" In an interview on Erin Burnett OutFront, Donald J. Trump responded to Nikki Haley's remarks about him after #SOTU. @webpagelink #TrumpOnCNN #SOTUresponse"}]
