[{"comment_id":"548856361983005","commenter_b":"Yes","commenter_a":"Yes","post_message":"The NFL, coaches, and fans are sick of him and his garbage. The league has had enough. Do you think Kaepernick should be ejected from the league?"},{"comment_id":"10152602108687061","commenter_b":"And a fat hoe","commenter_a":"Michelle looks more like a hoe everyday","post_message":"Pres. Obama: 'I have no more campaigns to run.'  (audible clapping in chamber; pause)  Pres. Obama: 'I know, 'cause I won both of 'em.' #SOTU2015 -- (click for audio) abcn.ws/1JbdOLY"},{"comment_id":"10153636980216135","commenter_b":"I can't believe an older women like your self could be so ignorant. I've always been taught if you don't have anything nice to say DON'T SAY NOTHING AT ALL! How can those words even come from your mouth. Where is your morals?","commenter_a":"I'm so sorry for his family and friends, but what can you say about someone that stupid...?","post_message":"Police say the man was driving his car in reverse with the door open when he fell out."},{"comment_id":"10152955099256336","commenter_b":"They sound like a bunch of babies saying the same thing over and over again. Do it don't just say words.that mean nothing. You are not scaring these animals do something.","commenter_a":"Lt. Col. Peters ,just another fool on FOX, Susan Rice.... heads the NSA.","post_message":"“Secure, expand, defend, leverage – her four points. Bill, that’s not a strategy, that’s a bumper sticker. The yogurt I had for breakfast had more intellectual structure.'   Lt. Col. Ralph Peters slammed National Security Advisor Susan Rice’s speech on the United States’ national security agenda."},{"comment_id":"10153184020474726","commenter_b":"What a disgusting a hole.","commenter_a":"what a piece of dog feces","post_message":"'He didn't win, did he?'    Harry Reid confronted on his lies, with no regrets."},{"comment_id":"999687850098947","commenter_b":"FGM - Female Genital Mutilation. The stats about it: @webpagelink","commenter_a":"The awkward moment where liberal values clash with Islam and no one wants to stand up for the gay man to avoid insulting Muslims...","post_message":"“My religion is very clear about what happens to gay people...'"},{"comment_id":"1604805479806565","commenter_b":"millions ,,,makes a star,,,,i like her,,she is a sweet little woman,,,,i am very thankful her husband had millions ,,,to get her where she is,,,she dont need of nothing ,,to even had started singing.............it was a joy seeing her perform","commenter_a":"'@username you may need to read this","post_message":"YES!!!  We support you Shania Twain."}]
