[{"comment_id":"10153675997090779","commenter_b":"Dumb ass","commenter_a":"Good for him.","post_message":"Joe Walsh has revealed that, come November, he won't be casting his vote for Hillary Clinton or Donald J. Trump. Watch him explain why below."},{"comment_id":"915008615188661","commenter_b":"The other race of women say the same things, they just not on here.","commenter_a":"Good for him, this happens to men all the time. The women on here that are outraged are the type of women that men should stay away from. Nothing worse than a hypocrite. I can't help but notice that the women that are upset are mostly black. Very telling","post_message":"Tasha Smith forced to pay ex-husband $7K a month, in addition to the $50K she gave him last year @webpagelink"},{"comment_id":"1276333032401449","commenter_b":"And your first lady has a dick","commenter_a":"Haters are real, she is beautiful as fuck with a clown ass husband, I enjoy having a crazy First Lady because I DONT GIVE A FUCK ABOUT A FIRST LADY! STAY FOCUSED ITS ABOUT VOTING FOR THE PRESIDENT NOT THE FIRST LADY YOU FUCKS!","post_message":"This HAS to be said!"},{"comment_id":"10154362175295329","commenter_b":"In the meantime, STFU. :P Because see below? Where she says, \"I considered myself a feminist before it was cool, now everyone is claiming it?\" She said that a while ago. First, tell that to Gloria Steinem, honey. Second, I think it's not really feminism when one woman decides to deride another because she decides that she's not doing it right? Yeah, no. Sorry. That sucks a lot.","commenter_a":"Stfu demi","post_message":"\"How the fuck am I making this about myself?\" – Demi Lovato"},{"comment_id":"1755557531334252","commenter_b":"I love how the racist cunt doesn't realize Africa isn't a country lol","commenter_a":"Good. GTFOut. Go to Africa where it's guaranteed you'll have a black president. This half white didn't work out so well.Alec baldwin made the same statement. Liberals whine and cry when they don't get their way. About time to unleash that Trump ttain.","post_message":"\"The View\" host Raven Symone says she's leaving America if a Republican becomes president. Will you miss her?"},{"comment_id":"10153863416478812","commenter_b":"Lmaooo @username","commenter_a":"@username @username @username Abbas Maki @username @username the title and the caption are hilarious! I feel bad laughing lmao","post_message":"UNEXPECTED VISITOR: An 83-year-old thought the loud noise she heard was just the weather. When she looked outside, she found a Ford Mustang parked…on her roof. @webpagelink"},{"comment_id":"10154539619803433","commenter_b":"he has never cared about facts, just rambles, surprised that so many people are taken in...oh wait many people were taken in by Hitler also, very similar","commenter_a":"Trump, pay attention; you are wrong!","post_message":"In an attempt to defend his recently linked offensive comments, Trump claimed Clinton laughed at a 12-year-old rape victim. False. @webpagelink"}]
