[{"comment_id":"456392161152491","commenter_b":"i dont spank my daughter and she is extremely well behaved. she says please and thank you and your welcome at the appropriate times. she is VERY advanced for her age. I am enrolling her in MMA classes to teach her not to be a little 'bitch' as you put it. and because she came from my loins, she will be a force to reckon with","commenter_a":"Spanking children teaches them consequence for actions. It also teaches you not to be a little bitch.","post_message":"So what are the alternatives? We look into them:"},{"comment_id":"10154306785891130","commenter_b":"Hillary's crimes against women will get the best of her.","commenter_a":"Bush was 33, Trump was 59, its easier to fall and be impressed by a rich man at that age Trump should have act like the grown up. Trumps ego will get the best of him yet.","post_message":"But Donald J. Trump is still a presidential candidate."},{"comment_id":"1683425098577634","commenter_b":"It will never happen to that cockroach!","commenter_a":"Yes, it should have happened a long time ago.","post_message":"BREAKING: GOP Threatens Obama With Active Impeachment.  Stop threatening, and just do it already.  Would you be happy if they actually followed through with this?"},{"comment_id":"1338517659516985","commenter_b":"I call Bull!!! On that one!!! I have to perform and work twice as hard than my Caucasian counter part and still make less money. Do the 'work' of a title position but not get the position because the Caucasian has it and can't do the job!!!","commenter_a":"Always like this Guy best of movie real actor love him I see most of his movie .","post_message":"So accurate, it’s SCARY!"},{"comment_id":"10157991607240354","commenter_b":"Get them out of our country!!!","commenter_a":"Can't wait to have Trump in the White House soon enough. Obama and Hillary both want to stuff America with these sexual Islamic deviants in thousands. #SaveAmerica #VoteTrump","post_message":"Had they not been allowed in the country, it never would have happened."},{"comment_id":"10154039827188984","commenter_b":"I hope it was a woman that pulled the trigger","commenter_a":"I am so grateful to my Lord that I do not have to live in a war torn place like this... never feeling safe and never knowing when you went to market if a suicide boomer was going to show up and kill you and others!! Never knowing when you rhusband was going to demand sex or molest your little daughter!! What a horrible life that would be!","post_message":"This terrorist fighter was excited to show off his machine gun skills to his buddies.  He stepped out beside a building, started to open fire, and then there was a CRACK followed by a dull thud."},{"comment_id":"10154438861719726","commenter_b":"While I can understand the basis for some of these observations, the main thing I firmly believe is that perhaps just over half the Democrats who actually voted for Obama in the last election will turn out to vote this cycle. I do not see near the support, energy, emotion, or urgency that I saw in the last two Obama campaigns, and lets be honest here folks... Hillary Clinton IS NOT barak obama. She does not have the well-oiled campaign machine Obama had. All she has is a character-assassination campaign, that's it, and it's exactly what I expected from her too. It honestly would not surprise me if Trump carried a lot of the swing states simply because democrat voters know she's a damaged candidate. Add to that that about half of the Democrat voter bloc in play this cycle was Bernie Sanders supporters of which many of them won't ...","commenter_a":"HIllary doesn't want to talk about the issues because she has no plans except what Obama has told her to say.","post_message":"This is the strategy Trump can use to defeat Clinton:"}]
