[{"comment_id":"981060928642821","commenter_b":"are these women important? I never heard of any of them.","commenter_a":"Disappointed","post_message":"Television producer and writer Shonda Rhimes joined forces with the leading actresses from her various ABC shows in a campaign ad for Hillary Clinton..."},{"comment_id":"10153906190670667","commenter_b":"Neither Chelsea, Hillary, or Bill receive a salary from the Clinton Foundation.","commenter_a":"Clinton Charitable work done in house? Don't you mean Charitible to the Clintons, with Chelsea receiving hundreds of thousands of $$ as an administrator? Gee Ya got me there Sparky!","post_message":"Mike Pence claimed that “less than 10 cents on the dollar in the Clinton Foundation has gone to charitable organizations.” That’s misleading. @webpagelink"},{"comment_id":"10153628855141336","commenter_b":"What is wrong with this girl?","commenter_a":"Her poor parents. Bet they wish they could raise her all over again.","post_message":"What did you think of Miley Cyrus' barely-there ensemble?"},{"comment_id":"505124579675835","commenter_b":"Kiss my ass!!","commenter_a":"You have no rights!","post_message":"The most chilling and honest interview about Islam you’ll ever watch…"},{"comment_id":"1130900020321866","commenter_b":"@username, it's a meme, I'm not a cop. Ignorant women these days, geez.","commenter_a":"I don't see a problem. Carson is honest and leaves room for error. The ONLY perfect man was crucified. Trump/Carson. Make America Great Again","post_message":"Dr. Ben Carson just made an absolutely stunning statement about Donald J. Trump.  What Carson said has some asking if he's really on Trump's side at all.  NOBODY saw this coming..."},{"comment_id":"10153127568784877","commenter_b":"This whole story interests me lol. This lady clearly has some issues, as u said. Smh","commenter_a":"They couldn't tell she is white? We need to be questioning the people who voted her in more than her!!!","post_message":"Rachel Dolezal gave lectures on ‘nappiness’ and ‘the brown paper bag test’, once told student she didn’t look ‘Hispanic enough.’ People from her past are coming out of the woodwork!   Grio fam, do you think the claims that Dolezal is a hypocrite are valid?"},{"comment_id":"1062158903821449","commenter_b":"And your a scrub. And Beyonce don't want no scrubs.","commenter_a":"Don't be scared of a bunch of freaking thugs, Beyonce is a thug herself .","post_message":"Tomi Lahren doubles down."}]
