[{"comment_id":"1360247024053830","commenter_b":"Get these bastards out of our country they are worse than maggots","commenter_a":"Ship her sorry ass back to the Middle East. She will be the one spit on.","post_message":"This Muslim did something absolutely SICK to white Americans at Walmart... She's now facing hate crimes charges over this... wow."},{"comment_id":"10153809413306101","commenter_b":"Oh give me a break. This silly leftist woman is acting like a jerk.","commenter_a":"I cannot believe what you have said. I myself really don't care what she has to say and I would disagree 100% with her!!!!","post_message":"Donald J. Trump may want to listen to Eva Schloss about what racism looks like."},{"comment_id":"1561091183908226","commenter_b":"I'll contact everyone of these cunts. I'll fly our and found your bitch ass into the ground since they are so profoundly sure I am not the face of death they never danced with. Boom...","commenter_a":"Boo hoo, my pussy hurts because I didn't get my war queen!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"957758620983859","commenter_b":"I don't mean to sound rude on the subject but I'm soooo tired of women having kids (multiple times) and complaining about life is so hard for them. Like honestly, if you wanna take cum and get pregnant maybe you should think before just doing","commenter_a":"If you have kids you deserve the struggle. Don't have kids until you feel ready or accomplished enough to bring a new life into the world. If you have kids before the age of 21 then you are a complete idiot and shouldn't get help from anyone cause stupidity isn't worth saving","post_message":"Great point!"},{"comment_id":"1307596852595922","commenter_b":"Bangkok, Thailand","commenter_a":"Seoul","post_message":"Check out this LIVE rocket launch! Shortly, a Russian rocket will launch from Kazakhstan and travel to the International Space Station, and you can watch it LIVE right here. This is an uncrewed rocket, and it will deliver food, fuel, clothes, and other supplies to the astronauts on board the ISS. Where in the world are you watching from?"},{"comment_id":"10153765423589170","commenter_b":"'@username you are spot on 100%. You don't allow a foreign entity into your country and let them have an area nor let them 'work it out'. Because that area gets a little bigger then a little bit more before soon they are running the country.","commenter_a":"Rahm assisted his Muslim brother Obama in degrading the police when they did do their job. Now the police are afraid to do their jobs.","post_message":"The irony here is that it's HIS ideology that has cops afraid to do their jobs.  His ilk spent the last eight years calling everyone racists.  Now he has the nerve to complain about the outcome?"},{"comment_id":"10153256940195736","commenter_b":"God forbid we put them in shelters and feed them.","commenter_a":"I have advocated for helping the homeless for a decade but it has gotten out of hand over the last couple years...which is to be expected, given we've mostly ignored the problem. These folks belong in Wapato and Wapato needs to be converted into a mental health care site.. They commit crimes against society -- leaving garbage around is just a visible symptom but when folks aren't looking, they misbehave in more destructive ways. They need to be 'rebooted,' in the computer sense, not the kick-in-the-pants sense. Though some of them need that as well...","post_message":"Mayor Hales said today was the first of several in which the homeless will be moved out of city parks."}]
