[{"comment_id":"882717625081928","commenter_b":"Keep negotiating with Muslim terrorist and they will only become more determined. The world needs to unite and eradicate this cancer.","commenter_a":"Life for a life,Peace talks Needed.","post_message":"Japan has vowed to work with Jordan to secure the release of a Japanese journalist held by Islamic State militants in a crisis that has become a test for Prime Minister Shinzo Abe. Read more: @webpagelink"},{"comment_id":"442634665940047","commenter_b":"A phony through and through. All she cares about is herself and power","commenter_a":"Indeed","post_message":"ICYMI - Hillary Clinton an Expert at being Fake"},{"comment_id":"10153002038827894","commenter_b":"She has a disrespectful spirit lol","commenter_a":"@username I am still laughing 😂","post_message":"Coko of SWV Throws Shade at K. Michelle & Tamar Braxton's BET Awards Performance, K. Michelle Claps Back 'You're at Home!'"},{"comment_id":"10152944080940950","commenter_b":"You cant tell he has an accent?what a bitch!","commenter_a":"I know law enforcement still search for david sweat and richard matt 20 days after escape from Clinton Correctional Facility. I know correctional officer Gene Palmer has already arrested for possible help to david sweat and richard matt escape from prison. I say correctional officer, prison workers and prison staff never help to some inmates escape from prison. If correctional officer, prison workers and prison staff help to some inmates escape from prison and could be arrested add prosecutor attorney will announce charged against correctional officer, prison worker and prison staff.","post_message":"A guard charged in the New York prison escape \"knows that he made a mistake,\" his lawyer says: @webpagelink"},{"comment_id":"608368836001258","commenter_b":"Rigged? Really?? LOL!! Of course ir was and the next ones will be also! Did you notice the \"Hill\" isn't even wearing an American Flag pin? She didn't have any American flags at the convention either till the media mentioned it. A real pice of S===!","commenter_a":"yep when hillery was wired so she could be told what to say","post_message":"A rigged election!!"},{"comment_id":"10152960138411051","commenter_b":"Good woman","commenter_a":"I would do that too. He deserved to be punished for that horrible incident. Great mom.","post_message":"As soon as this teen's mother saw the pictures that were being circulated, she immediately grabbed him and dragged him to the police station."},{"comment_id":"1582505828713381","commenter_b":"@username That is right on the money but it goes even further than that. The phrase well regulated militia did not mean the same thing that people understand it to be now. At that time well regulated meant that every man was to be completely equipped on his own dime. Every citizen was expected to be armed and ready to defend their community. Consider that at that time there were still unfriendly hostiles that raided towns and farms. Each citizen was expected to be armed and would have been quite foolish not to be. These days as civilization seems to be degenerating we are also faced with the dangers of criminals and terrorists and yes even perhaps our own government. People have been conditioned to be drones who don't bother with thinking so they let the government do it for them. What they fail to realize is that the government ...","commenter_a":"People have rights, not militias. Militias depend on people having rights, people's rights do not depend on being in a militia. Let's parse this: The 2nd Amendment consists of two clauses. The first clause \"A well regulated Militia, being necessary to the security of a free State\" is a dependent clause, because it is not a complete sentence. It cannot stand on its own. The second clause \"the right of the people to keep and bear Arms, shall not be infringed\" forms a complete sentence, it is an independent clause. The first clause is dependent on the second clause. Or, in simple English, the existence of a militia (which is essential to the security of a free State), is DEPENDENT on people having un-infringed rights, not the other way around. No laws, licenses, permits or taxes that by design are designed to keep Americans from exercising their 2A right can ...","post_message":"California Lt. Gov. Gavin Newsom, who's pushing more gun control in The Golden State, recently appeared on Chelsea Handler's show. Not only did they slam the NRA (not surprising), Handler also said American gun owners are \"embarrassing.\""}]
