[{"comment_id":"10158188671665231","commenter_b":"Not to change the subject but is the android in the picture holding a giant marshmallow or giant roll of toilet paper?!?!?! Just asking","commenter_a":"Rich Jones","post_message":"Google wants you to know that #BlackLivesMatter."},{"comment_id":"10153878226241336","commenter_b":"Yes Dave this is true and sickening","commenter_a":"This is Islam: the religion which teaches that there is only one god, Allah, and that Muhammad is god's prophet, the religion of Muslims. The religious faith of Muslims includes belief in Allah as the only god, (deity) and in Muhammad his prophet. And if anyone does not believe in Allah, they must be killed as infidels (non-believers)! Their goal and ideology world wide since the inception of Islam in 700 AD is to convert the world to Islam or kill them as non- believers! Notice what's been happening worldwide the past eight years? The Quran is their teaching book ALL Muslims learn from and live by daily. It makes up 99% of who they are and how they live. Most do not assimilate, (change) they make others assimilate (when their population becomes large enough) they are instructed in the Quran to kill you by any means necessary if you ...","post_message":"“When the President stands up and says ‘the Islamic State isn’t Islamic,’ that’s just nutty. Even schoolchildren can figure that out.” – Sen. Ted Cruz MORE: @webpagelink"},{"comment_id":"1857171411229870","commenter_b":"Apparently Madonna thinks about blowing a lot.","commenter_a":"She should be arrested for making terroristic threats!","post_message":"Madonna said she \"will not back down.\""},{"comment_id":"10154153426863812","commenter_b":"I'm praying!!","commenter_a":"Pray for a safe return","post_message":"Amber alert issued for 2-month-old girl who was abducted from her home by armed kidnappers: @webpagelink"},{"comment_id":"1410720895627548","commenter_b":"DISMANTLE THE USELESS ORGANIZATION CUT THEIR FUNDING !MONEY TALKS,","commenter_a":"I hope so!","post_message":"Is Trump getting closer to supporting H.R. 1205, the 'American Sovereignty Restoration Act,' to cut ties with the UN?"},{"comment_id":"10153742878600575","commenter_b":"Deport them","commenter_a":"Aren't we all supposed to be brainwashed by the communist media maggots that this is the \"peaceful religion\" ?","post_message":"Muslims blew up city Christmas tree."},{"comment_id":"10154151758449087","commenter_b":"@username Oh, please. Where are the arrests, the charges, the trials? Where are they? When did they happen? Where are the files? The proof? And here's the thing: Bill Clinton is NOT running for president. Whatever did or did not happen in the past is a \"he said, she said\" situation at this point. Or really a \"she said\" situation, and sadly, a LOT of women go after powerful men, married men, etc., and then cry \"rape\" when they don't get what they want. And I say that as a woman who would f**king kill a man who raped me. And once again, Bill Clinton is NOT running for POTUS. Donald Trump is a low-class disgusting creature who should NOT represent this great nation on the world stage.","commenter_a":"Let me know when Trump does something as bad as LEAVE 4 AMERICANS TO DIE..then you will hear my outrage..but you won't hear it over some locker room crap that Trump said.. Toughen up cupcakes..","post_message":"#BREAKING: Mike Pence was reportedly \"beside himself\" after hearing Trump's obscene remarks about women, and Pence's wife was \"furious.\""}]
