[{"comment_id":"1640584582874588","commenter_b":"Arnel, stay away from my dog. Haaaaaaaaa!","commenter_a":"We should not reward liars... reject Hillary.","post_message":"“We should not reward people who use inflammatory rhetoric, who use the kind of derogatory comments, whether it's about Muslims, or Mexicans, or women, or people with disabilities, whoever it might be,” Hillary Clinton said, referring to Donald Trump. “That is not a sign of leadership. That's a sign of, you know, showmanship, of desperation, that should be rejected roundly by the American people.”"},{"comment_id":"497560420446120","commenter_b":"By voting for @username, you are wasting your vote. There is no way he can win the presidency. Besides, why would you vote for a person who supports amnesty. Amnesty is bad for America. It is bad for the state of Ohio. It lowers wages. And takes jobs away from Americans.","commenter_a":"We're just 3 days from Ohio. Chip in $10 or more right now to support our TV ad & critical grassroots programs! JohnKasich.com/TV","post_message":"Kasich Works Town Hall live from Heath, Ohio"},{"comment_id":"1200823989996135","commenter_b":"@username I, for one, will not miss that evil animal at all!","commenter_a":"Lets just Eliminate him ... can't understand why he has not been removed already ... Oh Wait , people are to afraid to do anything !","post_message":"Obama now want to eliminate another of our national symbols. Just wait until you see this!"},{"comment_id":"1420083668051377","commenter_b":"Oh shes a female.. whoops","commenter_a":"Muslims r like a football team. The radicals /terrorist r the strikers. The extremists r the midfielders who feed the radicals. The defenders r the moderate Muslims who create diversions, deflect, defend and save Islam from legitimate criticisms n any accusations. They work as a team though they create the perception that the defenders have nothing to do with the strikers. The Liberals r the goalies who jump in when the situation gets worse with statements like Islam is a religion of peace @ De Joe Int'l ur comment had to be repeated.","post_message":"'We march through the night to cut and behead... Allahu Akbar'"},{"comment_id":"1691864404387315","commenter_b":"Omg ....how adorable!! You want one Mark? Do you still have your hot tub?? You're all set! I'll baby sit for you!","commenter_a":"Signe Nielsen tror jeg har fundet dr - at passe denne lille pige","post_message":"Welcome to Chicago, sea otter pup! At 10 weeks old, this little lady was found on a California beach all alone. Now, she's got a new home at the Shedd Aquarium. See the full video and photos here: @webpagelink"},{"comment_id":"10153603915850667","commenter_b":"Thank you sir. You are right. Prayers for the family.","commenter_a":"Prayers^^^ These parents have to live with this loss for the rest of their days.This isn't the time to be judgemental or self righteous. Prayers and condolences are in order.","post_message":"The father struggled with the alligator to try to save his son, but was “unsuccessful.\" @webpagelink"},{"comment_id":"10153974541414575","commenter_b":"Poor pup glad he's doing well now just hope he finds a family asap","commenter_a":"How bad is Peyton hurt, I'm looking for a small dog, but low maintenance, I'm disabled my self an single","post_message":"Peyton the dog was found horribly injured along a Kentucky highway after being attacked by a coyote or large dog and hit by a car. Now, thanks to a local rescue group, he's getting much-needed medical care."}]
