[{"comment_id":"1018807534853645","commenter_b":"RIP what a good man","commenter_a":"Inspiration for more acts of random kindness towards strangers. What an amazing guy. So sad :(","post_message":"\"I still cannot believe it. I thought for sure I would get the chance to see him again, give him a hug and thank him at least once more in person.\""},{"comment_id":"10154515564959657","commenter_b":"Get a big boat and ship them back.","commenter_a":"Not sure if I'm buying this, I've heard multiple different stories from a couple of families to 10k of them.","post_message":"VIDEO===> Bus loads of refugees arrive in New Orleans today."},{"comment_id":"10153416119358203","commenter_b":"WTF is wrong with these people? How could they do that to such an innocent life","commenter_a":"that's outright murder!","post_message":"‘This baby won’t stop breathing!’: Abortionist strangled baby born alive while nurses stood and watched"},{"comment_id":"10153270822682061","commenter_b":"My neighbors steal them!","commenter_a":"I had a neighbor take mine. To prevent it from getting stolen. I'm glad I had neighbors watching out for me.","post_message":"WATCH: 'Bait packages' used to catch thieves stealing deliveries from front doors. What is being done to stop this from happening as we enter the holiday season: @webpagelink"},{"comment_id":"1017021978357279","commenter_b":"Her daughter is a whoring little bitch.","commenter_a":"She is a screwball & her daughter is just like her. What is sexy about a big mouth drunk who is an idiot. I don't know any men who think she is hot stuff, they all say she is stupid & loves herself.","post_message":"Sad but true."},{"comment_id":"783518591838718","commenter_b":"Hillary needs to change her tampon..","commenter_a":"Eat shit bitch","post_message":"Hillary Clinton Says ‘Christians Have To Change Their Beliefs’ Or Else… [VIDEO].  She is the one who should change her beliefs.  Do stand strong behind your faith?"},{"comment_id":"10153171665732235","commenter_b":"LMAO!","commenter_a":"you know who else loves snow days? SATAN.","post_message":"Good grief."}]
