[{"comment_id":"10153660069974456","commenter_b":"You never know what goes on behind closed doors... He probably threw all disgression out the door after she found out about it and agreed to wait. A woman will only take so much and then it's Katy bar the door!!!","commenter_a":"A Sad Story Here...He Broke His Vows...I Want 2 Know Why He Cheated On His Wife...They Look Like They Was Very Happy 2 In There Marriage!!","post_message":"JUST IN: Gov. Bentley says recent allegations that he misused state property aren't true, and he will show that."},{"comment_id":"413560098853531","commenter_b":"How can any woman murder a baby like this??? @webpagelink","commenter_a":"Well, when they intentionally murder babies and sell their body parts, what do they expect to happen? They are murderers, spiritual people do hate that. Here is a 18-week old baby, how can folks not get upset about murdering innocent babies? If you don't want to get pregnant, close your legs or be responsible. Stop using abortion as birth control; it's that simple.","post_message":"\"We've seen an alarming increase in hateful rhetoric and smear campaigns against abortion providers and patients over the last few months. That environment breeds acts of violence.\""},{"comment_id":"10153436441037439","commenter_b":"STFU mooslins and go back home.","commenter_a":"Not me Jesus is Lord.We are not under any bondage to fear any thing.They are fighting a losing battie.","post_message":""},{"comment_id":"10153051114747550","commenter_b":"I did when I was a teenager! Moms are hot!","commenter_a":"True it's sick but boys that age will bang a mom especially to show off.","post_message":"Mother accused of having sex with minors at her teenage daughter's party--> @webpagelink"},{"comment_id":"1088253067851669","commenter_b":"Sure.. The Democratic party will take votes any and all ways possible. Even if it means a threat to National Security. Anybody supporting this refugee program should have mandatory sign for being a host household and paying for ALL clothing and food out of their own pocket. When I bring this up on Gov Tom Wolfes page you can here the crickets chirping. There were a load of dems in support until I said this. Then \"SILENCE\". Why should the MAJORITY of the state who don't want them here have to pay? Incidentally, not all dems want them here niether.","commenter_a":"Obama & Hillary Clinton created this whole refugee problem.","post_message":"Professor: Refugee crisis is result of Obama's Syria policy"},{"comment_id":"10152609562277452","commenter_b":"Can you believe woman these days","commenter_a":"Wtf Hurray for this man.. bless his heart, and for a better woman to come to them..","post_message":"After a father refused to give up his newborn son, who was born with Down syndrome, the mother left both of them. abc7.la/1DEs3a0"},{"comment_id":"10154589090613132","commenter_b":"I thought the same thing...wow, she's just like every other woman!!","commenter_a":"I'm not gonna lie, I'm glad her mascara runs too hahaha!","post_message":"A pregnant Blake Lively and husband Ryan Reynolds were caught locking lips in Rhode Island over the weekend."}]
