[{"comment_id":"10153233810444087","commenter_b":"She is lying","commenter_a":"They didn't bring their girlfriends","post_message":"“I think there are lots of people who wanted there to be a race for different reasons and they thought the only way to make it a race is a full-scale, frontal assault on her. This email thing became the biggest story in the world.\" said President Bill Clinton about the controversy over Hillary Clinton's email."},{"comment_id":"10153936646970329","commenter_b":"The American government steals from us and treat its American citizens like crap.","commenter_a":"Everyone's shit scared of the Americans cause they lie, are arrogant, have big weapons, invade any country and are religion obsessed. Same as Islam extremists. The thing they say they hate.","post_message":"Including some disturbing news for America..."},{"comment_id":"485555318301715","commenter_b":"All muslims need exterminated","commenter_a":"That will be a good time to take more out they will be together","post_message":"Gunman accused of hate crime in slaying of three Muslim students. Brace yourself, more race riots to come as angry Muslims prepare to march. Should all race rioters be wiped out?"},{"comment_id":"10152969196420796","commenter_b":"So?!","commenter_a":"I am very pleased not to be surrounded by poorly educated, I'll healthed, no skilled illegals and newly landed muslims. Maine people do well to care for Our own. Let the world work it out. America is not a dumping for human trash. Coe with skills and be ready to fly our flag, defend our Constitution, and become a citizen.","post_message":"The state's current demographics resemble what the rest of the country used to look like. In 1940."},{"comment_id":"1271166009570419","commenter_b":"Get some sleep pretty lady","commenter_a":"The story that will never die.","post_message":"The DNA analysis that prompted a Colorado prosecutor to exonerate the family of 6-year-old beauty queen JonBenet Ramsey in her 1996 murder was not as clear cut as she portrayed it at the time, a newspaper reported on Friday."},{"comment_id":"10153442848704474","commenter_b":"She gives women a bad name.","commenter_a":"Bah bye! Don't let the door hit ya where the good Lord split ya! JUST LEAVE!","post_message":"REPORT: House Democrats ready for Pelosi to retire. Where do you stand?"},{"comment_id":"10154246472810695","commenter_b":"I thought poppies grew from the earth","commenter_a":"Plz worry about the heroine statistics that are rising and rising. And stop giving people life in prison for a plant that grows in gods green earth.","post_message":"This family-friendly Easter event took a pretty surprising turn."}]
