[{"comment_id":"611608348972347","commenter_b":"You just broke the Internet with that post!!!! Lmao! I DESPISE HER! And her INNER GODDESS! Freakin lunatic!","commenter_a":"Just seeing Oprah made me want to take a dump.","post_message":"Absolutely brilliant write up."},{"comment_id":"10153687843588854","commenter_b":"She has less worth than a used condom","commenter_a":"She deserves a place in cellblock B","post_message":"Unreal: Susan Rice Calls Benghazi A “False Controversy”…"},{"comment_id":"10153370562061336","commenter_b":"Drugs are illegal. I bet you could buy all the drugs imaginable in an hour. Guns would be the same if outlawed","commenter_a":"He is such a big fat piece of trash !! He always point out stuff that is the most stupidest crap Iv ever seen !! That boy could have made a bomb or took a knife or a bat in there and killed people also ! So should we take away knifes and bats ! People around this guy didn't know he was crazy ? I feel like people are trying to set it up where they take away all guns then they could do what ever they want to to us ! Guns don't t kill people crazy people do and if it wasn't a gun itd been some thing else he'd killed people with ! I hate that this happened I'd never want any one to get hurt or killed we all need to be as one !! We are all Americans first !!!","post_message":"“We do know that once again innocent people were killed, in part, because someone who wanted to inflict harm had no trouble getting their hands on a gun.”  President Barack Obama spoke moments ago on the #CharlestonShooting: @webpagelink"},{"comment_id":"10153002585681770","commenter_b":"All conservative women are stupid!!!","commenter_a":"All liberal women are stupid!","post_message":"During a keynote address at the New York State Fair Wednesday, Democrat New York Senator Kirsten Gillibrand erroneously referenced the Constitution’s Fourteenth Amendment as the law that gives women the right to vote."},{"comment_id":"10153494218169705","commenter_b":"If only we had as much passion directed towards stopping child slave hunters around the world","commenter_a":"Betty is a National Treasure and girlfriend can let loose whenever she wants","post_message":"Betty White has some harsh words for the Minnesota dentist."},{"comment_id":"10153386538275326","commenter_b":"How is he going to run his hotels,if he reports all illegals??","commenter_a":"He mean kill them.","post_message":""},{"comment_id":"10153345798428717","commenter_b":"@username Sweet cheeks maybe you should learn about history rather than remaining ignorant @webpagelink","commenter_a":"Be happy Manchester, your taxes won't get raised beyond the cap.","post_message":"#BREAKING NEWS: The unofficial final results in the Manchester mayoral race are in. Incumbent Ted Gatsas defeats challenger Joyce Craig by 75 votes. -- @webpagelink"}]
