[{"comment_id":"10152929837961130","commenter_b":"He would be a hero. If he were a girl, she would be a heroine","commenter_a":"'Hero' or 'heroine' or are you undecided?","post_message":"This just made our week."},{"comment_id":"10153247148866130","commenter_b":"I am educated and that's my opinion and I stand by it !!!!","commenter_a":"I don't believe in post pardum depression !!! I believe it's women loosing their precious freedom and freaking out about it !!! That's why there are a limited amount of cases!!!!!!","post_message":"New research could allow women to get help before they even give birth"},{"comment_id":"1377566012257306","commenter_b":"Sarah Elizabeth Pool like I said all that Shit is fake babe","commenter_a":"Janine April May","post_message":"Americans literally lose billions on weight loss scams."},{"comment_id":"485248075011731","commenter_b":"thats one ugly he bitch","commenter_a":"To damn bad","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"10155026953658812","commenter_b":"lol except this lady started it in 2000 so moms the stealer lol","commenter_a":"'@username it's like moms!!","post_message":"“Back in 2000, I got out this plain white tablecloth and put it on the table and my teenage kids looked at me like I was crazy when I said, ‘I want you to sign this tablecloth.’ Then a few years later the [grandkids] came along and now we have 16 years of memories on the tablecloth.”"},{"comment_id":"10152714612441519","commenter_b":"Go back..","commenter_a":"People have a choice where they want to work. Not enough money offered? Go work for someone else.","post_message":"'$10 an hour? Does Wal-Mart really think this is enough to live on?'"},{"comment_id":"533708806819699","commenter_b":"All ready know this she part of the problem","commenter_a":"This is no surprise. Have to be living under a rock if you don't know she's muslim. Her relatives are members of the muslim motherhood and muslim brotherhood.","post_message":"An extremely influential American political figure was just exposed to be a Muslim.  This changes everything. Obama isn't even our biggest problem.  Do you agree Islam is a dangerous religion?"}]
