[{"comment_id":"10154739043556336","commenter_b":"Did you read her comment, Michael? Kapernick has his rights, we have ours. But our rights aren't as relevant?","commenter_a":"And yet again, we have the right to not patronize the NFL that allows players to disrespect our military, LEO and country.","post_message":"\"If you have the platform to speak up and you choose to do so, then that is your prerogative,” Derek Jeter said."},{"comment_id":"1704317133188732","commenter_b":"What's he going to sound like when he is eight? Just unreal! God Bless you buddy, keep it up","commenter_a":"Wow now that's something you don't ever see or hear unbelievable so beautiful never would of thought a 4 year old could sing like that.I think singing is in the future for this young child.","post_message":"Oh MY! This little guy knows his Dolly Parton."},{"comment_id":"726130267546926","commenter_b":"Bitch go make me a sandwich hold the mustard.","commenter_a":"I love how a bunch of \"men\" feel so threatened by strong women!!!!","post_message":"Demonstrations took place in England, Ireland, the Netherlands, Italy, Kenya, Mexico, Canada, Brazil, the United States, Australia and many other countries."},{"comment_id":"1820420311530016","commenter_b":"Feminazis!!","commenter_a":"Again Liberals at their stupidest.","post_message":"Women's protest"},{"comment_id":"1245131405583109","commenter_b":"Hillary said she carries hot sauce with her to pander to blacks and said they are predators. New leaked emails said that democrats were making fun of black women names. Yep that's what the democrats think about you. You have been played","commenter_a":"all he really concentrated on is how the speakers totally dogged him out....lol...I loved it but thats all he heard...he didnt hear them talk about Isis...he didnt see them bring up 4 star generals..he didnt hear a thing about what Kareem Abdul- Jabbar said...he didnt see the father of a Muslim man who fought and was killed while serving in our armed forces...he didnt hear them address Black Lives Matter and the Police...he didnt hear them talk about our criminal justice system...so t makes me wonder what convention was he watching..","post_message":"\"They're not talking about radical Islamic terrorism. They're not talking about borders where people just pour across. They're not talking about the crime,\" - Donald J. Trump"},{"comment_id":"1529265630712432","commenter_b":"This lady is a nut job and probably has some deep issues that she needs to work on.","commenter_a":"#DavePirnerProblems","post_message":"\"You're saying that I can't have a hairstyle because of your culture? Why?\" the man, who is white, says in the video. \"Because it's my culture,\" says the woman, who is black."},{"comment_id":"10153110239287093","commenter_b":"It should be removed","commenter_a":"Wow anyone that wears this is a sorry person. I fully support our men and women in Blue. I think the teacher made a great call . Better safe than sorry . I expert even looked at the \"clock\" and said it is a count down read about it. Also who makes a clock these days that looks like it would be a bomb.","post_message":"It was only a matter of time!! If you wear this costume to school, be careful who you show it to. @webpagelink"}]
