[{"comment_id":"1929449190619936","commenter_b":"Trump will not get a record number of votes. No way. This is going to be the biggest landslide in modern American history.","commenter_a":"My prediction in this election is that Trump will get a record number of votes beating Hillary. But Hillary will get the electoral vote giving her the presidency. The electoral is there so the establishment gets final say. Sad but true. Isn't that right Bernie Sanders.","post_message":"Donald J. Trump says he would \"promise and pledge\" to accept the results of the election --- if he wins."},{"comment_id":"10154655814574411","commenter_b":"just give them what they wont , then the migrants can all go back home and rebuild","commenter_a":"Bill Jos","post_message":""},{"comment_id":"1508488155837876","commenter_b":"Kelli Foltz-Daniels the Bkacks","commenter_a":"Because Latinos live off the welfare system. When you start talking jobs, they tend to get pissed off thinking your gonna take away their government funds","post_message":"Nearly 80 percent of Latinos have a negative opinion of Trump."},{"comment_id":"2070583743040341","commenter_b":"Go Back to your own Country!!!","commenter_a":"What scum is voting these things into office?","post_message":""},{"comment_id":"10157252417295354","commenter_b":"TRUMP...Build that wall!","commenter_a":"Ten accused, 3 convicted, 2 still not apprehended. One was going to use his \"Federal Education Aid\" money. Didn't see their citizenship status though. Planned to show ISIS how easily they can cross through our Southern Border. What say critics of a wall or temporary ban of refugees now?","post_message":"They're here."},{"comment_id":"1782906415286798","commenter_b":"Old bitch","commenter_a":"I have to believe this woman is mentally ill. I can't find any other way to wrap by head around it. I mean can sane people be this cruel?","post_message":"So awful."},{"comment_id":"10153377992812426","commenter_b":"Typical female...never satisfied.","commenter_a":"Wish he'd do something else other than banning microbeads","post_message":"Thanks, Obama! ;) More than 8 trillion microbeads were entering the country’s aquatic habitats daily; the volume was enough to coat the surface of 300 tennis courts every day -- according to a Sept. study."}]
