[{"comment_id":"10155266404471756","commenter_b":"I bet the indigenous Indians would love all of us to go home and leave their water alone !!!","commenter_a":"Bull! Obama and Clinton too!","post_message":"Protesters 'March to the Arch' to oppose Trump immigration order"},{"comment_id":"1357661384272094","commenter_b":"Good, go ahead and secede, build another wall.","commenter_a":"Who the hell cares?Let them go.","post_message":"A new poll shows 1/3 or Californians want to secede from the USA over Trump  Here's EXACTLY what would happen if they got their way!"},{"comment_id":"10154900824501037","commenter_b":"Obama is playing on Americans. He wants to play a nice guy. He knew all powers for executive orders has been striped off him. He wants to turned american workers against trump's adminstration. And gain cheap popularity from clueless workers. Obama's intentions for america is bad. this is just a cover up. Watch out. He will try something like this again even wen he knew that he doesn't have power to do so. Just to make names for himself n pave ways for his wife 2020. Am one person obama can't fool. All his doing is to put trump in a tight corner n make him look like a bad guy. His a hypocrite and no one shud take him serious. Hilary and obams wants to make sure that trump did not succeed.","commenter_a":"I hope this judge dies of pancreatic cancer.","post_message":"A devastating blow to one of Barack Obama's signature achievements for boosting wages."},{"comment_id":"10154736458587300","commenter_b":"Clinton's own faith says she should not be elected. For it is told in the bible, \" For the love of money is the root of all evil; which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows.\" ...and Jesus said to the Money Changers that his house was a house of prayers and they had made it into a den of thieves\" There is no Baptist, Catholic, or any other Christian that should be voting for Hillary Clinton. Next class...Murdering children in the womb!","commenter_a":"Geraldine Donze Berlingeri this is amazing mom!","post_message":"Protons destroy cancer cells while avoiding healthy tissue and minimizing side effects."},{"comment_id":"1387099161383134","commenter_b":"No, your mother giving birth to a bitch was","commenter_a":"Oboma is a scared ass chicken shit bitch","post_message":"CHECKMATE."},{"comment_id":"1322741314433625","commenter_b":"MORE POWER TO THE AMERICAN PEOPLE AND GO SUCK AN EGG TO U DAM MUSLUMS.","commenter_a":"If that's what they want, let them start their own school, with their own money.","post_message":"JUST IN..."},{"comment_id":"1187762051262009","commenter_b":"Build a defense wall also protects from evil ducks.","commenter_a":"President Trump will think of something.","post_message":"China have finally confirmed that they have lost control of their space station."}]
