[{"comment_id":"258747511232468","commenter_b":"Struck a nerve didnt I @username? Don't dish out what you can't take Snowflake. Now, y'all enjoy picking those grapes.............","commenter_a":"you and your fucking fox news like spin...he requested...not begged. you are as bad as the right wingers with your lies. is your position so weak you have to spin it? you are why trump is in office because you cant be straight up. fuck you occupy democrats.","post_message":"It's obvious that hypocrisy runs in the Trump family."},{"comment_id":"1622307121406726","commenter_b":"Jeff the Killer","commenter_a":"Kevin Mccaston this is another reason I won't move to Florida lol","post_message":"\"I now have an alligator in my sewer.\" #FloridaProblems  @webpagelink"},{"comment_id":"10153719642089091","commenter_b":"@username so you've gotten an infection from using a public restroom ?","commenter_a":"Why would you let your 8 year old daughter go to a public bathroom by herself??!! Smdh.","post_message":"Thank goodness for the customers and staff members who helped rescue the 8-year-old after her mother heard her scream. Police say the man was caught carrying the unconscious girl into a bathroom stall."},{"comment_id":"821114344592574","commenter_b":"She doesn't owe anyone an explanation!","commenter_a":"Mustn't piss off the militant feminists","post_message":"\"Anyone that truly knows me, knows my heart and knows what I meant.”"},{"comment_id":"10153440650715329","commenter_b":"What the fuck? Did you just call yourself a whore?","commenter_a":"This chick needs to get over herself. My mother was a lathe oporater at a pipe yard in the 70's and never whined about the way she was treated. Obviously this girl ain't from Texas. Suck it up buttercup.","post_message":"preach"},{"comment_id":"10152691502210927","commenter_b":"I agree they are just like his kids - Brats who think they deserve everything on a silver platter.....Put them back on the top of train cars headed for Central America","commenter_a":"Y r yall so against latinos/ mexicans last i checked they were here n mingled with natives b4 many of urs ancestors, when did they push, steal, lie, march families out of their lands","post_message":"Illegal aliens are just like our kids according to Obama."},{"comment_id":"10153162579468908","commenter_b":"Unfortunately A LOT of people fall into this category. Sex is everywhere and to too many it is everything.","commenter_a":"When sex rules your life you have zero power and nothing to contribute to society. No better than an addict. No power No control over your own life. Puppet. Set yourself free.","post_message":"Something we should all consider when it comes to porn.."}]
