[{"comment_id":"10154720750937235","commenter_b":"Michael M you r an ass hole !!! No one cares what you think !! You r ugly and evil with no soul just like Hillary !!! You and Meghan r made for each other !!! You r a disturbed individual !! Making fun of hard working people struggling because of Obamas policies !!!. We all should boycott. All your crap . I will . Those hard working people paid to see your movies ! Thats how u got rich !! Thanks to the deplorable's. You 😤😤ASSHOLE !!","commenter_a":"Michael Moore will do anything for media attention and money.","post_message":"You've no doubt seen folks in your Facebook feed who believe Michael Moore is making the case for Trump.   That is a LIE."},{"comment_id":"1119954238024715","commenter_b":"I'm for Trump! Politicians are afraid they will not get to keep lining their pockets if we vote OUT the good for nothing's. All they seem to do while in office is keep running for office. Raising taxes. They have good insurance. Do most of the people??They don't care about the American people! Let's get rid of them. Let's break up the good ol boys club!","commenter_a":"Trump Trump Trump! All the way!!!!!","post_message":""},{"comment_id":"10154691366756130","commenter_b":"She should be ashamed of herself!","commenter_a":"Funny and sadly accurate","post_message":"She got answers all right."},{"comment_id":"10152728783180950","commenter_b":"No China, it comes from China !","commenter_a":"Florida.. of course..","post_message":"\"We're starting to see a rash of cases of a syndrome referred to as excited delirium.\""},{"comment_id":"10156128714545725","commenter_b":"About time he helped his teammates out","commenter_a":"Them mugfucken Cubs been killen","post_message":"What a game! Let's hear it for the Cubs ----> @webpagelink"},{"comment_id":"1087900891233676","commenter_b":"The country would be safer if deported the republican/Tea Party.","commenter_a":"Thats why this year to come. I invite all registered voters to hit the polls. So this son of biatch don't win.","post_message":"After seeing Trump on TV, 8-year-old Sofia was terrified that the army was coming to take her away."},{"comment_id":"642298305928438","commenter_b":"she needs to bait Bill to keep him away from other lady`s","commenter_a":"Even if this is true, what does it say about Trump that he is so easily baited. Trust me Little Miss Bimbo, Trump doesn't need anyone to bait him, he finds ways to be an ass all by his lonesome.","post_message":"It isn't like he makes it really hard. I don't think he needs any help."}]
