[{"comment_id":"10155453199626729","commenter_b":"Illegal immigrants big issue here too, handing out drivers licenses that look identical doesn't help with the voter fraud issue we definitely have, but don't acknowledge.","commenter_a":"We have the same problem in Nevada. My guess would be 25% of the plates are Californian, maybe an exaggeration, but at least 10-15% are, and these aren't tourists because they're parked and driving out in our neighborhoods. These are just the ones that haven't bothered to register their cars here. Overwhelming people you talk to are Californians and most have come within the last 5-10 years. Majority of true Nevadans, natives and long time residents, are embarrassed by the color our state was on that election map. I wish the infestation would retreat to their looney state but it appears we've been overrun.","post_message":"So simple, a liberal could understand it"},{"comment_id":"533413536846939","commenter_b":"They all need to go back to thier countries and fight thier own battles against extremist.","commenter_a":"U GO TRUMP","post_message":"Looks like Trump said what many across the world were already thinking..."},{"comment_id":"10153900140313487","commenter_b":"Nazis are big in SA. Very wealthy, and powerful","commenter_a":"'Baby' Hitler was beaten by his father, and though loved by his mother, she died young. Take away either thing and you have a different adult.","post_message":"What would you do?"},{"comment_id":"10152651937258067","commenter_b":"You're wrong. Red letters mean it was quoted, a parable told by Jesus. If you don't believe the Bible Stephanie Morris, that's fine. But you can't question why a church would make a decision if you don't believe in the book that the church is built around.","commenter_a":"Question is, why did that church invest in money-changers? What would Jesus think?","post_message":"A church in Indianapolis claims JPMorgan intentionally mismanaged church funds and only cared about maximizing fees. @webpagelink"},{"comment_id":"10154200313034411","commenter_b":"@username do explain which nation was exterminated, and you're a unwelcome imigrant in south africa, you will also get what you sow, dickhead","commenter_a":"England never apologized for any war crimes during Imperialism era ...bcoz they are too fucking arrogant and Egoistic goons !!!","post_message":"During the Second World War, Ireland remained neutral and successive Irish governments were openly belligerent to British interests (Op-Edge by Bryan MacDonald)"},{"comment_id":"1844278629192581","commenter_b":"Yep, only the melon and spice tips make sense.","commenter_a":"It's all a bounch of whooie! Put Kerry in the frig and forget about it!","post_message":"Check your fridge ASAP."},{"comment_id":"516357545155952","commenter_b":"I'd be pissed,then sue everybody.Which I'm sure she'll do.","commenter_a":"How did they get the right to determine her mental state?","post_message":"Via Filming Cops -- How would you feel if within 24 hours you go from being a successful corporate executive to being forced to become a patient at a mental ward, stripped naked, where no one believes you? It feels straight out of a psycho thriller, but this is what cops did to her."}]
