[{"comment_id":"1039093332808969","commenter_b":"Probably its the smell coming from your stinky vagina bitch...","commenter_a":"Turkish people smell like fart. In the elevator, I aways have to cover my nose 👃 just to bear with their revolting smell. Russia should retaliate.","post_message":"Should be an interesting next few days..."},{"comment_id":"10153196584554091","commenter_b":"Go marry donkey who cares","commenter_a":"As a Christian..I feel she's out of order...do your job!...and let God deal with anything else.","post_message":"She told the couples and activists that her office is continuing to deny the licenses \"under God's authority.\""},{"comment_id":"10153067301701101","commenter_b":"duh","commenter_a":"I would argue that the rates of children who smoked marijuana, in the states that legalized marijuana, probably were the same. I bet little to nothing has changed.","post_message":"\"9.4 percent of children have used marijuana in states that have legalized medical marijuana, whereas the average in non-medical marijuana states is at 6.7 percent.”"},{"comment_id":"1207240762629769","commenter_b":"She at the very least a pathological lair.","commenter_a":"LIKE if you agree that Hillary Clinton is MENTALLY and PHYSICALLY #UNFIT for the Presidency!!!","post_message":"Today - I outlined a plan for American economic revival - it is bold, ambitious, forward-looking plan to massively INCREASE JOBS, WAGES, INCOMES and opportunities for the people of our country!"},{"comment_id":"1229522020425442","commenter_b":"I don't know about everyone else but I still think she looks good without make up.","commenter_a":"She's so beautiful! Why would she want to cover up that face? Who would, if they actually thought about it?","post_message":"\"Just a little concealer next time.\""},{"comment_id":"10156239205725354","commenter_b":"Let America become a car and truck free nation! and make it against the law to have any types of butter knives, butcher knives, and no hatchets, swords or knives of any shape or form, no sharp spears or sticks of any kind, pointed objects, needles including knitting, or sewing needles and absolutly NO clubs or bats or rocks of any shape or kind!! No ropes or twine or chains or braided objects! If they break the law and have any of these weapons in posession they will be put in prison untill they rot! Now tell me how is the government going to house and feeed all these lawbreakers????????............................................?","commenter_a":"You guys have no frigin idea what your talking about.","post_message":"No word yet on when they will call for a car-free America..."},{"comment_id":"10153229951151130","commenter_b":"Because women are catty.","commenter_a":"Someone needs to get their nails done.","post_message":"\"I never again want to get so caught up in this virtual reality that I forget the physical world right behind me.\""}]
