[{"comment_id":"10153002802946051","commenter_b":"Why do these girls think they can just come and do as they please and disturb ppl....that's good he wacked her off the desk...pinche mocosa pendeja","commenter_a":"Seriously? These kids might as well start applying at the dam circus","post_message":"This student was just sitting there, not taking part in any of the craziness, when one of the dancing girls decided to step forward. It didn't end well."},{"comment_id":"10153807891284062","commenter_b":"He served our country well and is our Founding Father.","commenter_a":"Only one problem with having to be a dead president. Ben Franklin was never president.","post_message":"Which of these women would you like to see on the $20, if any?"},{"comment_id":"1053133688060436","commenter_b":"What!!!???","commenter_a":"We're number 1!! We're number 1!! Oh wait......","post_message":"While the rest of the world is reducing maternal deaths, the number of pregnancy-related deaths in the U.S. continues to rise. In fact, America now has the highest rate of maternal deaths in the Western world."},{"comment_id":"822069341254814","commenter_b":"Two egocentric over weight idiots !","commenter_a":"The best news I have heard for I would have voted for Christie and Trump I know can get us back on track for our money and bill problems. way to go Christie hope you make vice President what a great team you two would make for America.","post_message":"Thank you Governor Chris Christie! It is time to MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10152606948662093","commenter_b":"Idiot get a life","commenter_a":"Huh! Happy to hear that they didn't get shot. Wonder if they were white. ......","post_message":"There are good people all around us.... Carrollton Police officers found a family of three sleeping in a car, and instead of being told to leave, they put them in a hotel and bought them necessities."},{"comment_id":"10154208723663984","commenter_b":"The Clinton's are the world's greatest LIARS and they do not give a Damm about you fools who will vote for her ,this woman is a evil woman , but her sheep are if the dumbest people in this country.","commenter_a":"Boy, the \"free\" press keeping her back. Boy, they do the same for the Republicans, the only difference they erase the good comments.","post_message":"A CBS reporter asked Hillary a question about the Brussels attack, but then after she said this 1 thing they IMMEDIATELY cut her off and cut to commercial. This is absolutely nuts."},{"comment_id":"1157413281045845","commenter_b":"Oh Hillary .... go get a life!","commenter_a":"Stupidty and desperation","post_message":"Remember when Hillary Clinton said refusing to accept election results was \"horrifying\"?"}]
