[{"comment_id":"10154514379914657","commenter_b":"And your answer is to just try to talk them out of killing us Nancy. \"Maybe if we're just nice to them, they won't hate us\". Coward","commenter_a":"Stirring up more hate,the Republican way. Your answer to everything is violence.I have never heard so much vile hate in my life. You are horrible human beings.","post_message":"UPDATE: A Paris prosecutor has also confirmed the passport that was found."},{"comment_id":"10155112416861729","commenter_b":"Just ignore the cockroach she will leave.","commenter_a":"Whoever voted already needs to go and vote again in November 8th! We have learned (thanks to Hillary ) that we can vote multiple times! That way the democrats won't be able to control all the votes!!","post_message":"Your feel-good story of the day, folks!"},{"comment_id":"10153205127216336","commenter_b":"They should be arrested, if any are on welfare they should lose their benifits..!!","commenter_a":"So they riot and loot because they don't have jobs and are poor?","post_message":"\"Because of my faith in God and people in the church that never gave up on me, I was able to pursue my own calling and purpose and destiny.\" Pastor Donte Hickman of Southern Baptist Church (Baltimore) told Gretchen Carlson that the youth in his community are not a lost cause."},{"comment_id":"10153200958788837","commenter_b":"?","commenter_a":"That cop needs to be arrested for having an illegal \"agresive breed\"","post_message":"PUPPY THROWN - Local 10's Michael Seiden has the latest on a poor little puppy that was thrown from a passing car right near the North Miami Beach Police Department"},{"comment_id":"10153287604604753","commenter_b":"but she took the oath of offce before the Federal government made the ruling.","commenter_a":"She is an Apostolic Christian. According to #17 in the Apostolic Christian Church's Statement of Faith \"Governmental authority is respected and obeyed. Members serve in a non-combatant status in the military. Oaths are not taken, but truth is affirmed.\" With that being said, she violated her religious beliefs when she took the oath of office, and is violating her beliefs again by disobeying the law and court orders. Source: @webpagelink","post_message":"Kim Davis is reportedly unwilling to resign her position at the court until she is permitted to deny marriage licenses to gay couples on the grounds of her sincerely held religious beliefs. This means the clerk is planning to stay behind bars until someone grants her requests. Her lawyer, Mat Staver, spoke to reporters outside Carter County Detention Center on Friday."},{"comment_id":"10156583768975389","commenter_b":"Build #TRUMPWALL","commenter_a":"Google Trends data shows Donald Trump was the most searched candidate during the debate, both in Iowa and across the country.","post_message":""},{"comment_id":"736296849894226","commenter_b":"POOR GAS ON THEM AND LET THEM BURN","commenter_a":"He should have the same thing done to him.","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news. No riots, no protests, no media coverage. Do you think he should be charged with a hate crime?"}]
