[{"comment_id":"1681685855452013","commenter_b":"Joke...","commenter_a":"Jail and no bail.","post_message":"President Obama is taking guns out of all forms of entertainment.  This is ridiculous. He can't get away with this.  Do you think he is abusing his power to push his propaganda?"},{"comment_id":"1189264781194585","commenter_b":"Bet you swat flies, stomp spiders and spray bug spray around. Insects are living creatures and so is mold.","commenter_a":"Sick !!! Well no excuse weither crocodiles kill humans or not humans are the sickest living creatures on earth they do things to get kicks and enjoyment","post_message":"Vile."},{"comment_id":"893350990721431","commenter_b":"She's not getting my vote","commenter_a":"Go Hillary!!! :)","post_message":"All across the country, people are working hard and making plans for their futures. Hillary is getting started too. Be a part of her campaign from the very beginning:"},{"comment_id":"10153629118828132","commenter_b":"She is a moron...","commenter_a":"No she did not do the right thing,she was very disrespectful,rude,nasty.","post_message":"Is Jennicet Gutierrez a heckler - or a hero?"},{"comment_id":"835512459884693","commenter_b":"Crazy woman","commenter_a":"The truth is not in her.","post_message":"Pelosi glosses over spiking costs under the ACA for millions of Americans."},{"comment_id":"10153080456176051","commenter_b":"Feral pigs are a huge problem in this country.","commenter_a":"I am NOT a liberal, and do not believe in hunting for sport! Why do people who hunt, feel the need to post morbid pictures of \"their kill\" Is it to prove something?! Not many people want to see that!!","post_message":"These hunters have one message and one message only for their critics: get over it."},{"comment_id":"10153223686721336","commenter_b":"Why is she still walking around and not in an orange jumpsuit?","commenter_a":"Is she resigning? That would help B'more get better.","post_message":"Moments ago, Mayor Stephanie Rawlings-Blake said Baltimore will get through the devastation of the last few days and that the city will only get better."}]
