[{"comment_id":"1375821949123925","commenter_b":"Love and agree with your comment Sandy","commenter_a":"Will not stand for the disrespect and I'm totally disgusted by the inept commissioner. He wanted to fine players wanting to support something positive, Cowboys supporting the 6 policeman killed, but pats Kaepernick and his followers on the back. The entire NFL is ass backwards and I was a huge fan","post_message":"NFL says rating are down because of Trump and 2016 headlines. I think not. Read my op-ed + TAKE OUR POLL: @webpagelink"},{"comment_id":"10152677348991523","commenter_b":"I wasnt there but innocent until proven guilty and its always a bunch of white women","commenter_a":"They are liars. Every time these women have a press conference, I've noticed while they're speaking they have to keep looking down at their notes. Their statements should freely flow out of their mouths if it was true.","post_message":"Phylicia Rashad says she was misquoted on Bill Cosby, and sets the record straight."},{"comment_id":"1146546865428217","commenter_b":"Melania doesn't even know where she is right now...","commenter_a":"Yep preparation H.","post_message":"Donald Trump and Hillary Clinton attend the Al Smith Dinner in New York"},{"comment_id":"1131664770254026","commenter_b":"You should try to get one. Aiden needs a service dog as well.","commenter_a":"@username you need one!","post_message":"✔ Laundry ✔ Dishes ✔ Shopping WATCH: This service dog in training is wowing the internet with all the ways she helps her chronically ill owner @webpagelink"},{"comment_id":"967763486668466","commenter_b":"Smart, educated women are actually voting for Hillary. Don't fool yourselves.","commenter_a":"What is it about the Democratic platform that is appealing? Higher taxes, weaker security, open borders, murdering babies, a very real risk of WWIII... ya'll must really hate America","post_message":"\"Get this Donald: nasty women are smart, nasty women are tough, and nasty women vote.” —Elizabeth Warren"},{"comment_id":"1189693781087315","commenter_b":"so wrong. We need to let Russia have their way with Soros and rid the world of this vermin.","commenter_a":"Soros is behind the refugee flood into Europe. His organizations sent Syrian approx. 19,000 tweets promising them housing and jobs in Europe and telling them how to get around border guards. He also was behind the whole effort led by Hillary to overthrow Middle East governments and replace them with governments of his choice. His influence has cost the deaths of thousands and thousands of people in the Middle East. This is the face of evil.","post_message":"Hacked documents from George Soros’s Open Society Institute state that the billionaire and his foundation helped to successfully convinced the Obama administration into increasing the total number of refugees taken in by the U.S. from 70k to 100k per year."},{"comment_id":"10153373038333855","commenter_b":"Kill this witch","commenter_a":"She wants every legal consequence possible so she can be a Christian Martyr!","post_message":"BREAKING: Kentucky clerk defies Supreme Court."}]
