[{"comment_id":"10152963839226051","commenter_b":"What is going on with these ungrateful wretches. They act worse than animals.Shut down the frat houses, they are all acting disrespectful","commenter_a":"cut their dicks off the young punks.","post_message":"Things just went from bad to worse for the frat boys who spit on wounded veterans and their service dogs before urinating on the American flag."},{"comment_id":"1059501164087223","commenter_b":"a little racists are we? I don't see any white ladies up there dancing with her.","commenter_a":"nope didn't see it,...who is beyonce?","post_message":"Not so subtle."},{"comment_id":"1586029795023236","commenter_b":"all you women who just need to color those grey hairs with Bleach blonde. So Vain.","commenter_a":"Richard Dryfus.....dude...you just lost the majority of your fan base. You must be a Criminal follower!","post_message":"He called Trump small dicked prick a unqualified racist who had for celebrity supporters."},{"comment_id":"10153114280311037","commenter_b":"Obama called isis JV team and gave Iraq back to isis ... Soldiers died for nothing .. Iraq had nothing to do with 9-11","commenter_a":"Probably a bullet. Unfortunately","post_message":"Tomorrow, President Obama will host a summit on \"Countering Violent Extremism\" - focusing on the root causes of extremism and find ways to stop young people from joining terrorist groups. What do you think is the solution?"},{"comment_id":"1160655937308596","commenter_b":"Many Muslim women are sick of being told what they are and what they can be from western women who have no clue about their culture, that's why Muslim Feminism had to develop on its own instead being part of the bigger movement, _that's_ sad if you ask me. Feminism should be about equality not about following one group of women's notion about what you should look, feel or talk like.","commenter_a":"I'm seeing a lot of diversity in the Muslim community about the concept of World Hijab Day (non-Muslim women wearing the hijab for a day in solidarity). Would love to get your thoughts on whether it's cultural appropriation, or upholding the more conservative aspects of your faith. I did participate last year, but not sure if I will again.","post_message":"Her \"Ask a Muslim\" booth was a huge success! - Parker Molloy"},{"comment_id":"10153691446913984","commenter_b":"Trey what the bitch in jail","commenter_a":"Someone should call that witch on the carpet. She's a corrupt liar, but I guess that I am supposed to be OK with that because she is a Liberal.","post_message":"Looks like Hillary Clinton just got another piece of bad news, and it's from one of her least-favorite people. 'Bulldog' Gowdy is hot on the trail! Do you support Trey Gowdy's fight to hold Hillary accountable?"},{"comment_id":"10153767545206002","commenter_b":"My son still has school.","commenter_a":"Schools need a coordinated web site saying exactly what are close or open..","post_message":"Bitter cold has closed schools not already on Winterbreak. School Closings: @webpagelink #Local4Today"}]
