[{"comment_id":"1698523013768491","commenter_b":"Women making decisions over a man's body","commenter_a":"It's not for fucking cosmetic reasons. It's for hygiene and it prevent a large amount of penile infections.","post_message":"Y'all should probably still stop cutting baby's dicks for cosmetic reasons though."},{"comment_id":"1308080519212956","commenter_b":"What's up with all this refugee hate going around? 'They're brown and muslim!! I hate em! They're animals! MURICA!!'","commenter_a":"Until the refugees find it and start using it as there public restroom","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154601974052690","commenter_b":"Could it be that she is still here illegally","commenter_a":"The other problem people need to understand is everyone that is Spanish is not from Mexico. This woman is from San Salvadora. Everyone automatically thinks Mexico. I wonder why? Could it be ignorance taught to them by ignorant people. There are so many 'illegal immigrants' here that people assume are from Mexico when in fact they are not. Stop stereo typing and get educated.","post_message":"An undocumented woman in need of surgery to remove a brain tumor is being held at a North Texas Immigration and Customs Enforcement detention center, her attorney says."},{"comment_id":"10155199620894411","commenter_b":"Unlike in shithole Islamic countries pedophiles actually go to jail here, instead of marry them. Get dunked on bitch.","commenter_a":"Ah yes, Islam propaganda to tell women to embrace their own slavery & destruction.","post_message":"Protesters claim that the full-face veil is an instrument of women 'self-empowerment'"},{"comment_id":"10156243420205389","commenter_b":"For what? So they can keep turning a blind eye to little boys & girls being raped every day over there? If we're not PROTECTING the innocent anymore, it's time to leave.","commenter_a":"I do not believe he is a Muslim, he is a puppet for the Muslim brotherhood without a doubt and he does hate America","post_message":"President Obama will extend the U.S. military’s stay in Afghanistan beyond the end of 2016, casting aside his promise to end the war on his watch."},{"comment_id":"10153199106634071","commenter_b":"Get her a group of body guards while you're at it","commenter_a":"M","post_message":"A $48.5 million diamond for a 7-year-old girl."},{"comment_id":"10153531348054740","commenter_b":"I agree you shouldnt have to justify.","commenter_a":"It is sad that so many don't know the difference between real life and tv.....","post_message":"Here's why cops don't 'shoot to injure':"}]
