[{"comment_id":"1284879431547513","commenter_b":"ve que no es vara :)","commenter_a":"@username Sergio Boudet lo que hablabamos el otro dia","post_message":"Colorado kept $1 billion away from drug cartels last year."},{"comment_id":"852525808271329","commenter_b":"Fire the bitch","commenter_a":"not good","post_message":"She refused to hang his coat, but true patriots stepped in. This is how all of our vets, and active duty should be treated. Can we get 3,000 'LIKES' for our vets?"},{"comment_id":"10153533859861615","commenter_b":"Get that creep off the streets, love that area. People are so sick.","commenter_a":"Diane Fickley Pesci","post_message":"“(He) blocked her so she couldn’t go any further that way and says, ‘Hey, want to have a good time?’” NOW ON CHANNEL 11 MORNING NEWS: A man is being questioned in connection with an attempted luring of a teenage girl -- in the parking lot of South Hills Village Mall. Hear what she and her mom did to help police track him down."},{"comment_id":"861353807244021","commenter_b":"she's a nut fix her she don't need any more kids keep her in prison to the max time","commenter_a":"Kill the witch or let me at her. Wtf! 😡","post_message":"WARNING: The details in this story are extremely graphic. A 26-year-old Missouri mother was sentenced to 25 years in prison for the horrific death of her 4-month-old daughter. @webpagelink"},{"comment_id":"1594655060832823","commenter_b":"Put her out there in the line of duty unarmed and we'll see how fast her mind changes!!!!!!!","commenter_a":"Impressive stupidity","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"1680942268839646","commenter_b":"@username..you're a fucking racist bitch!","commenter_a":"I would like to see in the White House, a president with love for this country. Hasn't been one there for over 7 years now.","post_message":"Would you like to see these two move in to the White House next January?"},{"comment_id":"382957778552770","commenter_b":"Better her than some right wing nut!","commenter_a":"Hoping for someone else - Hillary is too close to big bankers. :(","post_message":"You won't believe how large her lead is now!"}]
