[{"comment_id":"1765015350452806","commenter_b":"This tells the whole story.","commenter_a":"Why can't people understand that the Clinton's are career politicians who amassed millions for themselves while being public servants and working in government? While working \"supposedly\" for we the people, they became millionaires. The same group of 1%s Hillary rallies against she is card carrying a member of.","post_message":"Don't let U.S. Senator Tim Kaine fool you -- the Clinton Foundation is a bastion of corruption."},{"comment_id":"10154526253322464","commenter_b":"Want to bring some refugees? Bring the Yazidi!!!","commenter_a":"We want to live in peace I Yazidi from Iraq There's no one feels Us #StopYazidiGenocide #StandforYazidiWomen #StopYazidiGenocide #StandforYazidiWomen Nadia Murad","post_message":"Washington Examiner: Oklahoma Obamacare plans face 76 percent hike.  #FullRepeal: @webpagelink"},{"comment_id":"895405060572025","commenter_b":"Just like that nut","commenter_a":"Looks to me Democrats are pretty scared of Trump and that way they send these people to his campaigning events and start up problems, fights in crowds. Democrats can't play fair cause they know they are not going to win people are tired of being lied to and their rights being striped away...people this is a wake up call!!!! If you value your freedom you better dig deep in who your voting for...because all Democrats are trying to take our rights away!!!","post_message":"This is hilarious.  Video by the Canadian comedy show 'This Hour Has 22 Minutes.' Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152746114636545","commenter_b":"That's bootylicious","commenter_a":"Kaci, Ryan, Anthony and Cory - get home ASAP but do so in a safe manner.","post_message":"The roads are getting worse everywhere in North Texas and accidents are starting to pile up. Check the traffic conditions if you need to go anywhere.   TRAFFIC: @webpagelink"},{"comment_id":"1692899604103495","commenter_b":"She is a skank","commenter_a":"Chelsea Clinton is the poster child for white privilege.","post_message":"She CANNOT be serious."},{"comment_id":"511888302293280","commenter_b":"this man deserves the right to express himself he fought for our freedom and i thank him and all vets it was not a bullshit war no war is bullshit lives are lost and families are destroyed we need to get back on track in this country starting with respect for each other","commenter_a":"Just because you fought in one bullshit war doesn't mean you automatically get a platform to spout your opinion about crooked cops claiming BULLSHIT on disenfranchised citizens are starting another war! Those killed by cops are ALSO AMERICANS...just FYI.","post_message":"When  asked if he was concerned about his safety, he said, “I’ve seen more than all this. I’ve been through the riots already.”  -Linda"},{"comment_id":"10156442483085231","commenter_b":"Bitter Brother Committee..... If he didn't want a kid he should've strapped up....but since he wanted a souvenir from Ciara the singer, but not from Ciara the woman, he has a fiscal responsibility to provide for his kid....that's so 1940 to say \"she trapped him\" because a man can alleviate all of that by condom, vasectomy or not \"bussing it wide open\".....if they're so worried about \"getting trapped\", they should do something about it...I mean since \"females\" are sooooo devious","commenter_a":"She stay eating off her dudes... First it was Missy, then bow, then 50, then future, then Russell, now future again... That snatch is a trap... Russell better tread carefully","post_message":"Loose lips causes lawsuits. Ciara isn't playing when it comes to protecting her name and son."}]
