[{"comment_id":"10153569375843203","commenter_b":"Unless Rosie O'Donnell is raping you, she isn't forcing herself on you. I know many gays and I must be lucky to have escaped their revenge and then forcing their lifestyles on me since I'm still straight. Rosie O'Donnell is and always will be a loudmouth and a celebrity. Don't like it? Don't watch her.","commenter_a":"..Many of them are miserable, intolerant people hellbent on revenge ,forcing their lifestyles on others, and making everyone else miserable also.....Example : Rosie O'Donnell - one of the most miserable, intolerant people forcing herself onto the public...","post_message":"Study finds homosexuals less healthy, happy than heterosexuals    @webpagelink"},{"comment_id":"883241831711239","commenter_b":"@username another liberal who's mother should have swallowed","commenter_a":"I back the police , i hope they do turn their backs on Obama , he is a worthless piece of sh**","post_message":"PLEASE do this, cops!"},{"comment_id":"382025331922062","commenter_b":"When pigs fly","commenter_a":"Yes","post_message":"Is this good or bad news for the GOP?"},{"comment_id":"10153891528986162","commenter_b":"@username John Koester isn't this by you ?","commenter_a":"Abner Calzada","post_message":"WATCH LIVE: Reports of fatalities in active shooter situation in San Bernardino, sources say --> @webpagelink"},{"comment_id":"10153751767926135","commenter_b":"Burn that bitch.","commenter_a":"Obama will appoint her a Czar!","post_message":"She's accused of stealing to pay for expensive cars, a motorhome and even vacations."},{"comment_id":"1743445975938698","commenter_b":"Devil at work.","commenter_a":"we should not remove any thing if they don't want to come to come our churches let them go back to there country where they can do as they please..","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More ‘Comfortable’.  America was founded on Christianity!  Do you think this is ridiculous?"},{"comment_id":"10154210423796973","commenter_b":"Aleksey Olenin","commenter_a":"What's the deal with this Westworld show? It doesn't look like anything to me... ;)","post_message":"\"Westworld\" has become the kind of watercooler-buzz show HBO loves."}]
