[{"comment_id":"10152800082481051","commenter_b":"Should have killed the scumbag the first time !!!","commenter_a":"It was a domestic violence crime, that should have kept him behind bars. You figure out why.","post_message":"This guy was released after admitting to stabbing a woman to death in front of her children. Guess what he did one month later."},{"comment_id":"1194580720554183","commenter_b":"This is all propaganda to rig the voting pattern and is trashy media reporting.","commenter_a":"THE PEOPLE LOVE TRUMP, WE LOVE AMERICA, WE WILL TAKE HER BACK FROM THE FILTH IN DC WHO RAPE OUR COUNTRY AND TERRORIZE OUR PEOPLE!!!!","post_message":"You've heard all the claims that Donald Trump has no chance of beating Hillary Clinton in the general election. Now, here's how that argument is instantly deflated"},{"comment_id":"684786888378556","commenter_b":"everyone has a right to their opinion, some are better than others, Go Clint","commenter_a":"He is furious with Clint but LOVES all the celebrities that pander to him........","post_message":"Obama wants Clint Eastwood finished, but he is holding his ground. H's in trouble. Let's show him our support. Can we get 100,000 'LIKES' for Clint Eastwood?"},{"comment_id":"10153817855231955","commenter_b":"'@username Dude your girl looks like a dude!","commenter_a":"That's okay. Iowa hasn't picked a winner in 16 years, looks like they are keeping up the tradition. Keep thumping your bibles you inbred corn growing losers.","post_message":"CRUZ WINS IOWA"},{"comment_id":"849277451776263","commenter_b":"im glad he was never my minister...and oprah needs to get the heck off television and go to another country and spread her crap","commenter_a":"The Bible does Not Change over Time. God put forth his Word to his People. He is the Same today as he was Yesterday. She should Read the Bible and see what Gods says.","post_message":"Oprah asked former megachurch pastor when Christianity will embrace gay relationships.  His answer seemed to take her by surprise."},{"comment_id":"10153086379157217","commenter_b":"Paul is absolutely correct. Those are not just mare refugees those are economic migrants that seek to invade Europe and it's borders in order to establish themselves on our continent! They are not here because they need help, they are not here because they are running from War, those are people that abandoned their country , their women and children in order to Exploit Our achievements. To Abuse our LAWS in order to gain access to benefits we have worked for decades! They do not seek help nor assistance nor do they want to return to their country after the War ends. They want to Infiltrate our culture , our lands and when they gain critical mass we will not be able not only to stop them but to even contain them and make them obey the Laws in the countries they live in. This is a deliberate immigration of ...","commenter_a":"Good work to the Hungarians! The only people that protect their country and actually keep refugees in refugee camps as they should ! Good work Hungarian brothers keep strong !","post_message":"Footage has emerged of migrants being thrown bags of food at a Hungarian camp near the border with Serbia"},{"comment_id":"1222382617796158","commenter_b":"Idiot please don't reproduce","commenter_a":"End of the circus... was a main attraction.... They do away with the side shows...then the tent... now the elephants.... Why would one even want to attend.... another bit of America down the toilet...","post_message":"Elephants performed for the last time in the Ringling Bros. and Barnum & Bailey Circus on Sunday, putting an end to the controversial practice. The animals will live at the 200-acre Ringling Bros. and Barnum & Bailey Center for Elephant Conservation in Florida."}]
