[{"comment_id":"10153199034456051","commenter_b":"To whom are you directing the \"Lazy whore\" term, Chieng Yang? Just wondering. ..I think that kind of name calling is unnecessary and unproductive.","commenter_a":"Hey lopsided breast implants are her punishment...","post_message":"This woman says she really doesn't care if anyone is offended by her photos - they're staying up."},{"comment_id":"10152634683050779","commenter_b":"Could be great, i hope so.","commenter_a":"Woohoo!!","post_message":"In a stunning announcement today, Blur have revealed plans to release their first new album in over a dozen years, titled 'The Magic Whip.' UPDATE: Click through to listen to the new song \"Go Out\" and see the track list for the album."},{"comment_id":"1151519384914815","commenter_b":"Bol bitch deserved it","commenter_a":"Mykel Connors","post_message":"Chick knocks out an old lady on a bus!  #WSHH"},{"comment_id":"696420180548560","commenter_b":"Personally I am glad that Texas is not taking any refugees. Imagine the amount of terrorist polluting the state.","commenter_a":"Good for you Texas Gov.!!!! Let's hope that our spineless president doesn't stymie this action.!!!","post_message":"Texas Gov. just released this very bad news for all refugees. The are setting a trend. Let's spread this. Can we get 75,000 'LIKES' for the great state of Texas?"},{"comment_id":"10153476534618721","commenter_b":"You do not turn the Super Bowl into a platform for any agendas. The Super Bowl is about the teams on the field. That is all. If she wants to do that at her concerts, fine. But she was out of line doing it at the Super Bowl.","commenter_a":"Is Beyonce just another ghetto ho?","post_message":"\"Is Beyonce pregnant?\" and other dumb things people Googled during the singer's Super Bowl performance. (via Quartz)"},{"comment_id":"10153949050391037","commenter_b":"One word: uneducated","commenter_a":"Trump has had my vote from the start to finish ... Nothing anyone says can \" change \" my mind .... We need a business person in the seat to lead not be a tyrant.","post_message":"“During anxious times, it can be tempting to follow the siren call of the angriest voices. We must resist that temptation,\" Nikki Haley said."},{"comment_id":"1143690625715878","commenter_b":"Good thing I'm pregnant!!!!","commenter_a":"Jennie!","post_message":"Warning!"}]
