[{"comment_id":"10154584084924166","commenter_b":"no more cover girl for me","commenter_a":"How stupid!","post_message":"The makeup manufacturer calls him a \"boundary breaker\" who will appear in an upcoming commercial. What are your thoughts on guys and makeup?"},{"comment_id":"1587581361533554","commenter_b":"Can we let her off with this one? I think it's in the public interest if we don't see that. The photographs of her having sex in a field were enough.","commenter_a":"I protest to this, I wouldn't wish that sort of cruelty on any sausage. Plus lets face it there would be no room for the sausage when her head is so far up there..","post_message":"On 4th May Hopkins tweeted \"If Sadiq Khan wins London, I will run naked down Regent Street with a sausage up my bum in protest #LondonMayor2016.\"  She later tweeted: \"I'm a woman of my word.\""},{"comment_id":"10153199114815950","commenter_b":"I'd pick up the deal with her in it and put her outside. Call her parents and tell them she's outside. She looked small enough. The cop lost his cool. Out smarter by a brat. Now he is fired and they will sue. Sad all around.","commenter_a":"I was raised very conservatively about manners and respect, and I agree that she was wrong for her actions. However, that deputy does not need to be a SRO if he is going to deal with students this way. It's unprofessional and disturbing.","post_message":"\"I was praying out loud for the girl and I just, I couldn't believe it was happening. I was just crying, and he was like, well since you've got so much to say you're coming too.\""},{"comment_id":"925751947552361","commenter_b":"oul don","commenter_a":"303253143368344u after kellys when kfc was still open","post_message":"Great afternoon in Ohio & a great evening in Pennsylvania - departing now. See you tomorrow Virginia! #MakeAmericaGreatAgain"},{"comment_id":"10154186263231336","commenter_b":"@username how did she give in to he bully? By becoming strong and accomplishing something at 9 that her bullies will likely never even attempt? By showing them that she has more aptitude and resolve in her pinky than her bullies do in their entire body? That she doesn't need to bully someone else to make herself feel better, but instead made herself better? If you ask me, that's not giving, that's stepping up and issuing a whole new challenge. There are 29 year olds in this world that could stand to learn a few things from this young lady.","commenter_a":"We need more parents who inspire their kids to do somethng like this. Instead of creating a safe space for their feelings for those who are bullied or feel bullied by micro agression.","post_message":"✓ 36-mile race ✓ 8-kilometer swim ✓ 25 obstacles   Her reason for completing the race? She was bullied in school. (CC: U.S. Navy)"},{"comment_id":"1052573001452785","commenter_b":"Absolutely fuck a gun i don't hit women but that ghetto trash should've been slapped in the face","commenter_a":"This is the norm for these racist cockroaches, get a gun people because we're at war whether you like it or not................It's all thanks to that sorry POS Obama and his corrupt administration that led us here!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO] Racebaiters will never say anything about this. What would you do in this situation?"},{"comment_id":"10152795603885950","commenter_b":"if i turned into a woman id still want a woman so id be a lesbian, lets all turn to woman","commenter_a":"thats right, if i want to be a woman, ill be a woman, but i kind of like my dick so ill keep it","post_message":"\"If he says he's a woman, then he's a woman.\""}]
