[{"comment_id":"1009175035805692","commenter_b":"Thanks god being a feminist is hip again!","commenter_a":"Sweet","post_message":"A 12-year-old feminist named Olivia wrote Hillary this brave, heartwarming letter. Olivia 2040, anybody?"},{"comment_id":"10154188598828405","commenter_b":"he is fighting to get your gun","commenter_a":"Thank you Rep. Lewis!! From a mother, military spouse and small business owner - I'm happy to see democrats fighting to keep us safe! #goodtrouble","post_message":"On July 5th, we're going to continue to push, to pull, to stand up, and if necessary, to sit down. Don't give up. Don't give in. Keep the faith, and keep your eyes on the prize. #goodtrouble"},{"comment_id":"801744643293915","commenter_b":"#HillNo #HillaRigged #NeverHer #LatinasForBernie","commenter_a":"hillary is going to get the majority of bernie voters to vote for her in the end and trump will be squashed.","post_message":"Of those surveyed, 74% said they have an unfavorable opinion of Donald J. Trump."},{"comment_id":"10153702195241336","commenter_b":"What a WANKER .","commenter_a":"No , they either are true to their faith or to their country , not both !","post_message":"\"Mr. Carson may be a good doctor but he is not ready to lead a great nation.\" Today on \"Sunday Morning Futures with Maria Bartiromo,\" Sen. Lindsey Graham responded to Dr. Ben Carson's comments that a Muslim should not serve as a president. @webpagelink"},{"comment_id":"10155605168240968","commenter_b":"Lock Em up!","commenter_a":"Liberals suck!","post_message":"\"If you see your friends or family falling into the chasm of cable news, perhaps parental lock is right for you.\""},{"comment_id":"893629520678836","commenter_b":"Hi, what do you mean their own kind?","commenter_a":"Why are they attacking their own kind?!","post_message":"At least 37 people have been killed during a #Saudi airstrike on a dairy plant in western #Yemen."},{"comment_id":"1091727720848238","commenter_b":"Those people should be sterilized","commenter_a":"Everyone who is against this is a damn hippje","post_message":"This is HUGE news."}]
