[{"comment_id":"1057199377724507","commenter_b":"Sensing feminists being triggered","commenter_a":"What u gone do now @username??? Does Hillary still own y'all? Who y'all gone brain wash now ??? The swamp has been drained it's time for the real Americans to take back this united States we the people are apathetically sick of corruption!!!!","post_message":"Many people did not believe Donald J. Trump could win the election @webpagelink"},{"comment_id":"10155685513649838","commenter_b":"Build a wall or simply arrest business owners for hiring illegals","commenter_a":"Curtail \"illegal\" immigration.,......why is it so hard for liberals to grasp the concept of \"illegal\" ? Great having a \"difference maker\" with a backbone back in the White House.","post_message":"Trump plans to sign an executive order today to direct federal funds to be shifted toward the building of a wall on the southern border, a signature promise of his campaign. He has argued that doing so is vital to gaining control over the illegal flow of immigrants into the United States."},{"comment_id":"10153353653386051","commenter_b":"Get in his ass!","commenter_a":"No more tacos or carne Asada for this loser.","post_message":"This man killed a police officer – and then laughed about it. Here's what happened to him in Texas yesterday. Do you consider this justice served?"},{"comment_id":"10156170491245206","commenter_b":"Shut up sexy","commenter_a":"I was pro @username but Carly I cant take you seriously unless you attack someone beside Hillary she is not the only one running who is bad for our country and until I see you attack Trump or Jeb who are you major competitors right now I am not going to take you seriously as a serious candidate.","post_message":"What are my thoughts on Hillary Clinton's speech this morning?"},{"comment_id":"993863733987432","commenter_b":"Shut up Meg","commenter_a":"If only this call had been made in September 2001.","post_message":"That's probably not the kind of congratulatory phone call Netanyahu wanted."},{"comment_id":"10153215864872235","commenter_b":"She's just making up the rules as she goes along.","commenter_a":"200,000 dollars so they can keep serving shitty pizza! Yay! Everybody wins!","post_message":"Someone needs to drink a big, tall glass of STFU juice at this point."},{"comment_id":"10152744778310950","commenter_b":"Yeah, the law is very very clear. @webpagelink","commenter_a":"There is no justification for the killing. However, the entire incident could have been avoided if he would have stayed in the car.","post_message":"JUST IN: Newly released dash cam video shows the moments before the deadly police shooting in South Carolina; Walter Scott is seen running from the driver's seat @webpagelink - CBSN"}]
