[{"comment_id":"10153186932521167","commenter_b":"Women who watch faux news confuse me","commenter_a":"Brittany Shelton OMG!","post_message":"We were going to do a \"Top 10 Awful Displays of Sexism on Fox News\" video, but the clips just kept rolling in. Here are 70:"},{"comment_id":"1569798589746550","commenter_b":"Lock her away...","commenter_a":"Common assault","post_message":"This is disgusting"},{"comment_id":"935633429829739","commenter_b":"No woman EVER asked for it.","commenter_a":"Of course her clothing doesn't mean she wants it. But, if she wears something low cut and is hanging those ta-tas out.... then she should not care, not get mad if guys look at them.","post_message":"Women prove that no matter what they are wearing, they are NEVER 'asking for it'"},{"comment_id":"704812552989083","commenter_b":"I would too....she is ugly!","commenter_a":"Poka dots look good on her. Muslim men are just jealous their women dont look like that.","post_message":"What in the...?! And no, it's not a joke. It's a REAL lawsuit. Look at the documents..."},{"comment_id":"10155842055160354","commenter_b":"F**K that Little C*nt , deport the little bitch immediately !!!!!!","commenter_a":"Maybe she should give back all those American dollars she has made from a country she hates so much.","post_message":"Not the sentiment America's past time was looking for..... WATCH the video and hear it for yourself...."},{"comment_id":"10154092058261636","commenter_b":"Did you have to turn on you \"English APP\" to type that?","commenter_a":"Gross! And Then he said: \" I will be dating her in ten years\". His own words","post_message":"She was having none of it"},{"comment_id":"10158129645930015","commenter_b":"We don't want a wall.","commenter_a":"I live in mexico , but do you know that all the money invested on that stupid wall , it will come out from your pocket , American taxpayer will pay for that wall ,not us, we ain't paying that thing, we have bigger problemas than that ,good luck with your wall","post_message":"Do you support a border wall with Mexico?"}]
