[{"comment_id":"457572411058203","commenter_b":"I hate that vile bitch. Dumbest wokman on the planet.","commenter_a":"Sarah and her offspring are all a blight on humanity and whatnot, but the dog doesn't seem bothered. That said I still wouldn't stand on a dog..","post_message":"Just when you thought Sarah Palin couldn't sink any lower, this happens. If this woman can't teach her own kids to have respect for animals, she has no business even thinking about running for anything in 2016.  ~Darrell"},{"comment_id":"10152884468574877","commenter_b":"Happy birthday you beautiful queen","commenter_a":"Happy Birthday!!!!!","post_message":"We are wishing Lupita Nyong'o HAPPY BIRTHDAY today!!  The Academy Award winning actress received her masters degree in acting in 2012 from the Yale School of Drama and in 2014, she was named \"The Most Beautiful Woman\" by People and \"Woman of the Year\" by Glamour.  LIKE and SHARE to celebrate!! >>>@webpagelink"},{"comment_id":"10156367673320725","commenter_b":"@username pull your pants up","commenter_a":"This Latina and my family are voting for Donald Trump all the way to the white house!! Yay for me!","post_message":"I will NOT let America down! Thank you for your continued support of my presidential campaign. Together, we can all #MakeAmericaGreatAgain! #Trump2016"},{"comment_id":"10155043885602908","commenter_b":"Move out of Big Blue high tax, high cost of living Commifornia. Problem solved.","commenter_a":"$7.25/hr equates to about $1250 a month before taxes. After taxes let's say $1000. I live in a studio apartment in CA and it's $885/mo. So $115 remains for 4 weeks of food, utilities, transportation to and from the job? Get real, America. Especially for a family even $15/hr would be a stretch, but it'd be better.","post_message":"It is a national disgrace that millions of full-time workers are living in poverty and millions more are forced to work two or three jobs just to pay their bills. A job must lift workers out of poverty, not keep them in it. The current federal minimum wage of $7.25 an hour is a starvation wage and must be raised to a living wage."},{"comment_id":"10155545705355725","commenter_b":"There should be charges against the lady too for leaving a dog in a hot car!","commenter_a":"hahaha!!!!!!!! I left my dog in my car once with the windows rolled up and a lady stopped and started yelling at me. I told her I'll turn off the a/c in a min..... I'll be right back.","post_message":"A man was arrested after smashing the window of a Mustang to free a dog left inside the hot car in a shopping center. He now faces charges ---> @webpagelink"},{"comment_id":"563855710491041","commenter_b":"Such a PIG","commenter_a":"POS!","post_message":"His response is simply \"deplorable.\""},{"comment_id":"10157254857370354","commenter_b":"Punch that Bitch","commenter_a":"If he had a background like that, other wives would come forward. She wasn't going to get alimony...hummmm","post_message":"The latest twist..."}]
