[{"comment_id":"10153174916561130","commenter_b":"Poor, sad, hatful women. I feel bad for you.","commenter_a":"homsexuals force their wicked ways on everyone. Shame on them. Homosexuals lust not love..","post_message":"Humans aren't the only ones celebrating the SCOTUS decision."},{"comment_id":"10154119887406167","commenter_b":"LOCK HER UP!","commenter_a":"Why hasn't Hillary been arrested for money laundering and racketeering?","post_message":"It's not just Trump that's the problem -- it's his family too."},{"comment_id":"997010993718412","commenter_b":"Islamic Terrorist, go home, stop trying to change the U.S.A.","commenter_a":"No true American is safe as long as Islam is allowed to exist in our nation! We true Americans must unite against this plague and the liberals who allow them to destroy our lives and wipe them from our nation so we can ensure the safety and security of our nation and the American people!","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack.  He is a hero, and will always be remembered as so.  Can we get 150,000 'LIKES' for this brave boy?"},{"comment_id":"10156131502720500","commenter_b":"Joyce think how scary it will be to criminals","commenter_a":"It will be scarey to see people walking around with guns","post_message":"Floridians with concealed carry permits could soon be able to walk around with their guns on display. Would you support open carry? @webpagelink"},{"comment_id":"10153548183098984","commenter_b":"Unless you're Native American, almost all Caucasians have ancestors that were thieves, murderers, and rapists. Shall we remember our horrible history? Shall we remember how Caucasians forced their way through other's land? Shall we remember the genocide that occurred? Shall we remember public lynches? Shall we remember the Trail Of Tears? Shall I go on?..... Who are the TRUE criminals here? Caucasian ancestors FORCED their way through due to greed. Most other immigrants come to America to WORK to provide for their family. So I repeat, UNLESS you're Native American, you come from immigrants as well, possibly even illegal. You're ancestors (Caucasian), if they've been here since the 1700s or 1800s, could have been the murderers, thieves, and rapist roaming around tormenting innocent. An add-in...who will do super low-pay labor? Mexicans are hardworkers, even when we are living in severe poverty, we still try to WORK. Anyone who has common ...","commenter_a":"Donald Trump is to good for any of them....you can't tell a Liberal the truth","post_message":"Donald J. Trump just taught these guys trying to bully him a SERIOUS lesson on why you do NOT try to play hardball with The Donald!   Do you think he has more backbone than Obama?"},{"comment_id":"887553468004375","commenter_b":"What a pig","commenter_a":"The entire \"occupy\" movement is a collection of unemployed, pot smoking, attention strumpets who receive gov. assistance and don't want to lose their free ride.. Morons!","post_message":"Pass it on.  Image by Occupy Democrats."},{"comment_id":"1191417507545813","commenter_b":"HELL, IF THESE PEOPLE WORKED AT A JOB AS HARD AS THEY DO PROTESTING THIS STUPID CRAP, THEY WOULD HAVE PLENTY OF MONEY !!!!!!!!!!!","commenter_a":"So the dems want to shut down Graceland via their personal propaganda terrorist cult Black Lives Matter AND they want to label WikiLeaks a terrorist organization and have put a DEAD OR ALIVE bounty on Julian Assange. These ARE troubling times. I can't believe they think the American people are that stupid. Enough is enough. Stop with the violence and let us now hear what the Clinton camp thought should be deleted. (Despite the State Dept. request for ALL email on server) I think at the end of the day people of all colors and beliefs in America will find they thought we were all stupid enough for them to screw all of us. We really all need to stick together. Unity matters now. #HumanLivesMatter #AllLifeMatters #TruthMatters Now let THAT sink in.","post_message":"Leaders of the protest say they chose Graceland because \"it demonstrates one of Memphis's most common forms of financial inequality and because the site has ties to ... the death of unarmed teen Darrius Stewart.\""}]
