[{"comment_id":"602588076598438","commenter_b":"She's just a confused little child in a bad place with no morales","commenter_a":"She is a pervert and don't have enough sense to know it , she thinks Christianity is a fairy tale but she wont when she gets to hell","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"10153332076309411","commenter_b":"Remove NATO from their borders","commenter_a":"Russia must stop being aggressive by removing all warships, and submarines, from international waters - these waters belong to the US and its allies, even though they are international :)","post_message":"The 'hunt' is on"},{"comment_id":"10156794675835389","commenter_b":"That's what happens when you allow undocumented immigrants flood into your country, Duh....","commenter_a":"So where is the UN? What is the purpose of th UN? How much money does the UN get to do nothing to help","post_message":""},{"comment_id":"10152995709171130","commenter_b":"I suggest we send her subservient hormonal ass straight to the Canadian border now!","commenter_a":"Ridiculous! Comment for someone that should know better Ms. CEO.","post_message":"What the..."},{"comment_id":"1116402168438318","commenter_b":"Darren VM They don't want the imbecile either, probably why he ran here! LOL","commenter_a":"I don't understand how this humiliates Obama. I don't understand why Michelle is included in this. I don't understand why any sane American will be for humiliation of an American President regardless of agreement on issues.","post_message":"Obama may think he's Europe's favorite politician, but Queen Elizabeth just made a stunning announcement that put Obama right in his place.  You know Michelle was furious when she heard about this."},{"comment_id":"529925163864730","commenter_b":"Kool","commenter_a":"This poor (morally) man reminds me of the KKK and how most whites were offended and embarrassed by them in the early 60's.","post_message":"Al Sharpton's career is going to come to a screeching halt after this.  His own people are turning against him. Now is the time to strike.  Can we get 30,000 'LIKES' for Al Sharpton getting fired?"},{"comment_id":"1042991895769865","commenter_b":"Assholes","commenter_a":"The WORST representation of what New Yorker are really LIKE! He's a Schmuck","post_message":"Let's try this again.  (And hey, while you're here, make sure to RSVP for our \"Vote against Trump\" page, and let the world know you are going to vote against him:  @webpagelink/ )"}]
