[{"comment_id":"10155453199626729","commenter_b":"Illegal immigrants big issue here too, handing out drivers licenses that look identical doesn't help with the voter fraud issue we definitely have, but don't acknowledge.","commenter_a":"We have the same problem in Nevada. My guess would be 25% of the plates are Californian, maybe an exaggeration, but at least 10-15% are, and these aren't tourists because they're parked and driving out in our neighborhoods. These are just the ones that haven't bothered to register their cars here. Overwhelming people you talk to are Californians and most have come within the last 5-10 years. Majority of true Nevadans, natives and long time residents, are embarrassed by the color our state was on that election map. I wish the infestation would retreat to their looney state but it appears we've been overrun.","post_message":"So simple, a liberal could understand it"},{"comment_id":"1263844570323065","commenter_b":"yep. Sobbing now.","commenter_a":"Started crying before I even opened the article","post_message":"These Holocaust survivors just regained a lost part of their childhood. - Jon Comulada"},{"comment_id":"10153323546831747","commenter_b":"Now plural marriages are next.","commenter_a":"What a crock! States rights were dealt a severe blow today. Yesterday SCOTUS-care, today five judges ignore the constitution to impose more leftist agenda on the entire country. Overall a bad week for the USA!","post_message":"I've had some time to think about today's historic ruling. Here are my fuller thoughts...  Today, the arc of history bent further toward justice. We are a country that embraces the ideal of life, liberty, and the pursuit of happiness for everyone. With today's Supreme Court ruling guaranteeing the right to marry for LGBT couples, we came even closer to making that ideal a reality.  This decision is a reminder that we should come together as a nation in support of civil rights for all. LGBT Americans and their allies are joyously celebrating today’s landmark decision, as they should. On this same day, in Charleston, South Carolina, Reverend Clementa Pinckney, a martyr to the civil rights struggle, is being laid to rest. He was one of nine African Americans robbed of life in an act of white supremacist terrorism.  Our work to build a more perfect union never ends. Marriage equality is now the law of the land, yet there are no federal safeguards protecting LGBT Americans against employment and housing discrimination. The same Supreme Court that ruled today in favor of marriage equality two years ago gutted the Voting Rights Act, and to this day, Congress has failed in its duty to restore vital voting rights protections. Rights can be won, and rights can be lost.  We’ve helped create a fairer and more just society today, but new and longstanding civil rights struggles are on the horizon. I’m prepared to wage those battles too, because I want my grandchildren to see progress in their time. I want them to believe as I do that America’s best days are still to come."},{"comment_id":"10153039611668984","commenter_b":"Shoot this prick and his offspring","commenter_a":"I support the 25 congressmen that voted against you! And ALL YOU DID WAS PROVE THEM RIGHT MR! JOHN HUSSEIN BOEHNER! YOUR A VINDICTIVE DISGRACEFUL representative!","post_message":"John Boehner may have just sunk to a new low with this move. This is the type of thing I would expect from a 3rd grader, not a supposed leader like Boehner.  Do you support the Republicans who stood against John Boehner?"},{"comment_id":"696420180548560","commenter_b":"Personally I am glad that Texas is not taking any refugees. Imagine the amount of terrorist polluting the state.","commenter_a":"Good for you Texas Gov.!!!! Let's hope that our spineless president doesn't stymie this action.!!!","post_message":"Texas Gov. just released this very bad news for all refugees. The are setting a trend. Let's spread this. Can we get 75,000 'LIKES' for the great state of Texas?"},{"comment_id":"637619203037928","commenter_b":"Screw you DOUCHE BAG!","commenter_a":"Death penalty on her to just for giving birth to him and the other syco!","post_message":"This is upsetting."},{"comment_id":"486861261504454","commenter_b":"She wouldn't make a pimple on the queens ass","commenter_a":"YES","post_message":"The Jordanian Queen just put Michelle Obama to shame.  Good. Our first lady is classless. In no way does she represent our country.  Would the Jordanian Queen make a better First Lady?"}]
