[{"comment_id":"10153774153353145","commenter_b":"hello your in AMERICA","commenter_a":"If this sign dictated what language I spoke at home or with my friends, I would take offense. But if this sign was at work, I think it is appropriate to expect English. You shouldn't be off carrying on non-work related conversations anyway, English or not.","post_message":"English only? Many Hispanics who use the Deltona Community Center took offense to this sign. How would you feel if your job tried to enforce this rule? The organization said the sign was necessary for safety reasons. @webpagelink"},{"comment_id":"982612308510776","commenter_b":"@username killary LIED to the FBI, congress and all of America, she's perhaps the BIGGEST LIAR and MOST CORRUPT politician ever in America, she cares for NO ONE but herself and power, wants OPEN BORDERS, over 600 thousand more refugees to come into this country, continue obummers FAILED agenda, supports abortions up until time for birth and you support her. Neither candidate is a good choice but a vote for killary is a vote to destroy America, soon socialism and like obummer she supports the New World Order, please open your eyes and use some common sense before you vote to destroy America","commenter_a":"No, Hillary is not completely rattled. She's going to win in a landslide and is now closing in on a Democrat-controlled congress. You all need to get real, regroup, and try again in 2020. Good luck.","post_message":"Hillary is completely rattled after Trey pulled this out... It's over. No one can hide from him. Let's him know he's not alone. Can we get 30,000 'LIKES' for Trey to bring Hillary to justice?"},{"comment_id":"10155456219056509","commenter_b":"Both are adulterous stalkers.","commenter_a":"Trump is lying about his own words he says he didn't do what these women say but on tape he brags he did. What a liar, lying Trump calls himself a liar. LOL","post_message":"For some women, Donald J. Trump's denial of wrongdoing has made them feel compelled to speak out"},{"comment_id":"1835427256744336","commenter_b":"Lock her up already!","commenter_a":"It's not important how many people are there what's important is how many VOTE BLUE!!!!!!!!!!! These two ladies have have more integrity in one finger than all of you HATERS.","post_message":"WATCH LIVE: FLOTUS Michelle Obama and Hillary Clinton campaign side-by-side in NC."},{"comment_id":"995099337179781","commenter_b":"Crazy dumb old witch.","commenter_a":"I think democrats are more like terrorist. Terrorist maim and tear people's bodies apart. Democrats do the same thing to unborn babies by allowing Planned Parenthood to Harvest baby body parts. As far as I know no terrorist organization sells body parts. Guess that makes Democrats and Hillary Clinton worse than terrorist.","post_message":"BREAKING: Hillary Clinton says GOP candidates are like terrorists because they're...pro-life?"},{"comment_id":"10153864002342217","commenter_b":"Always the ones left behind, always on the pity party stage, always the why me question, always on the help me podium, it is exhausting.","commenter_a":"Most atletes from other climes left Rio as soon as they completed their stakes. Africa! Africa!! Africa!!! They will never cease to amaze.","post_message":"Kenyan athletes are stranded in a Rio shanty town after the closure of the Olympic village, the team captain says."},{"comment_id":"1569991603060963","commenter_b":"Oprah is a piece of shit.","commenter_a":"Ignorant celebrity","post_message":"It's all about the win for 'your side'."}]
