[{"comment_id":"10154389558756336","commenter_b":"@username LOL! it's the world who runs to, scrambles to get to, imitates and leaves all behind to get to The US not the UK! We don't need to catch up with anywhere, no one's out in front of us!.....hence a hella immigration problem!","commenter_a":"Hey aren't guns illegal there? This must be a misunderstanding I'm sure, take your gun control and stick it up your a$$ Thought Europe(Germany) had very strict gun laws? Just goes to show you that the bad guys will ALWAYS find a way to get guns!!!!","post_message":"Breaking News: There are reports of a “threat situation,” involving \"some sort of weapon\" at a German movie theater in Viernheim, according to police. @webpagelink"},{"comment_id":"10154279210266028","commenter_b":"Don't you say Hey to me you ugly girl!","commenter_a":"@username @username Oh geez!","post_message":"The two classic American novels have been temporarily pulled from shelves in one Virginia school district following complaints from a parent. @webpagelink"},{"comment_id":"1139700699375519","commenter_b":"Stop All Muslims. Send them back where they came from.","commenter_a":"Wrong not here","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"10154092058261636","commenter_b":"Did you have to turn on you \"English APP\" to type that?","commenter_a":"Gross! And Then he said: \" I will be dating her in ten years\". His own words","post_message":"She was having none of it"},{"comment_id":"394094587445502","commenter_b":"No they are everything that is wrong with our world now!! We need to remove them from America!!","commenter_a":"Desert is calling. ...","post_message":"“You Are Everything That is Wrong in America”"},{"comment_id":"947458941975777","commenter_b":"@username Hillary won","commenter_a":"I'm voting for Bernie, Because I give a damn.","post_message":"I got into politics not to figure out how to become President. I got into politics because I give a damn. #DemDebate"},{"comment_id":"1687768148176964","commenter_b":"Just love that woman","commenter_a":"Love it","post_message":"YES This is why we LOVE you, Reba McEntire!"}]
