[{"comment_id":"10153232403476323","commenter_b":"Because, you can fuck over your country. As long as your fucking bitches, smokin cigars, and drinking whiskey, like a man God damnnit","commenter_a":"Why is everything about being gay","post_message":"Gay-rights activist and award-winning author Larry Kramer is 79 and in failing health, but that won’t defuse the impact of his latest bombshell project: the first 800-page instalment of a two-part history of America that tells of the hidden sexualities of figures from Alexander Hamilton, George Washington and Abraham Lincoln to Mark Twain, Herman Melville and Richard Nixon."},{"comment_id":"10153037067141636","commenter_b":"Gays must be slaughtered like pigs","commenter_a":"The most easiest and simplest HIV aid prevention, is don't commit gay, rather is an animals behave. Don't forget you're human kind.","post_message":"The drug successfully reduced the risk of HIV infection by 86 per cent"},{"comment_id":"10153370094858010","commenter_b":"Yeah she really wants equal money lol your dumb lady","commenter_a":"It is the American nightmare regarding the death of our middle class and deeper poverty to our poor and elders. Vote the Repugs OUT!!!!","post_message":"Sen. Elizabeth Warren of Massachusetts got a standing ovation from California Democrats gathered today for the party's state convention. Warren told them: \"This country isn't working for working people. It's working only for people at the top. That's not the American dream. That's the American nightmare.\""},{"comment_id":"10157252246585354","commenter_b":"Lorena Bobbitt needs to take care of this demonic trash creature!","commenter_a":"Deplorable.","post_message":"**UPDATE**  That's it?!"},{"comment_id":"903161916494805","commenter_b":"@username because of disparate impact and disparate action. White people can get up out of bed, run a comb/brush through their hair and be out the door in five minutes. Blacks cannot do that so much, unless their hair is cut to their head--shaved. The rules negatively impact Blacks because without those styles, there isn't much left without using relaxers or paying for extensions. When rules or laws are placed for everyone as is here, but negatively impact one racial, religious, gender group, then it's discrimination and needs to be stopped.","commenter_a":"Can I ask an honest question? In that school, is there a ban on long slick hair, mullets or any other \"white hairstyles\". If so then I can actually understand the ban. But if there is no ban on \"white hairstyles\" like long slick hair, but there is a ban on \"black hairstyles,\" then yeah, i agree, it is discriminatory.","post_message":"This school just banned traditionally black hairstyles  and people are outraged.  #MicBrights"},{"comment_id":"1048840968488441","commenter_b":"Or is the environment of higher education overwhelmingly dominated by dogmatic liberal and neo-progressive worldviews, while openly and often aggressively shunning anything resembling \"conservative.\"","commenter_a":"You're imposing some causality here, @username... Does education make people more liberal? Or do people with liberal tendencies put a higher value on education?","post_message":"One possibility might be the growing numbers of women (who tend to vote for Democrats more than men) getting college and advanced degrees."},{"comment_id":"10153488967916336","commenter_b":"He does not love America, he should be removed from office. The President has a sworn duty to protect the Constitution and the People of this Republic which he never has. He serves illegals, thugs and his fellow Muslims.","commenter_a":"they served our country they need respect but cannot change stupid","post_message":"\"This administration’s decision on who gets memorialized and who doesn’t is puzzling,\" Todd Starnes wrote."}]
