[{"comment_id":"10154818512036729","commenter_b":"Some people are just slow to get it.","commenter_a":"Polls should mean nothing, she should be in jail. She represents everything wrong in government.","post_message":"Whoa!"},{"comment_id":"1428416493869569","commenter_b":"She, that was a woman officer","commenter_a":"watched the video again lucky nobody was shot what people need to remember officers have a family too they want to go home in one piece he should have drawn his weapon but he still would have been the bad white cop","post_message":"MUST WATCH: Two people face assault charges following a wild brawl with a police officer in Nashville."},{"comment_id":"10153617326474032","commenter_b":"William you have good reasonings, I agree that we need to know who's coming in, but remember that we have some sketchy people who shoot schools and movie theatres here in our own country born and raised. I agree we need to have background checks, but they take a while and that's why they risk their lives to find work and live better lives here. Why would an illegal want to just cross the border to cause havoc? They're here to work. An illegal Mexican can just do that all at home with the money they can make from drug cartel business. Like I said, it doesn't matter where you're from, there is bad in every nation and continent across the world. Even Antarctica. Some penguins are not nice birds.","commenter_a":"Personally, I've lived here my whole life in AZ. I've had more problems with the snow birds than the illegals. Last major bill before 1070 was bullshit. They wasted tax money trying to justify denying EMS to illegals when their own research showed a $240 million dollar surplus brought in by taxes and other monies by illegal immigrants in '06-- even after accounting for the expenditure of 'caring' for them. Here's a thought, how bought we reform and streamline the citizenship process so that people who want to be here and are willing to work here can actually do so and not wait 10 years to get citizenship.","post_message":"For Arizonans, immigration isn't just a campaign issue. Learn what's at stake for all of us at a non-partisan event, #OneNation: Immigration. Get your tickets now: @webpagelink"},{"comment_id":"10157563024440206","commenter_b":"Suck my d*ck Un song nia","commenter_a":"@ Mika and @ Alyssa bow wow","post_message":"Lil’ Kim, is that you?"},{"comment_id":"10154088708589087","commenter_b":"Including Melania Trump, she's illegal so vote for Hillary Melania!! LOL!","commenter_a":"the legal immigrants (hispanic and otherwise) should get onboard the Trump train...the illegal immigrants should vote for Hillary.","post_message":"House Hispanic Democrats said Trump is a \"cloud hanging over us\" as they begin celebrating Hispanic Heritage Month."},{"comment_id":"10153231329598855","commenter_b":"She probably extored enough money to live off of so her job is nothing. What a narrow minded turd.","commenter_a":"WONDERFUL! Now if we can get all local, state and federal gay bashing employees to follow suit, possibly the USA will no longer be looked upon as the greatest hate nation on the face of the planet.","post_message":"She'd rather give up her job than grant marriage licenses to same-sex couples."},{"comment_id":"10153524671301323","commenter_b":"If they are dangerous, then stay away!","commenter_a":"So is crossing the street. Let's kill all the drivers.","post_message":"“Everybody thinks we’re cold-hearted killers and it’s not that ... Giraffes are very dangerous animals. They could hurt you seriously, very quickly.”"}]
