[{"comment_id":"10153120507763984","commenter_b":"Quit giving our tax dollars to all the lazy and illegal people, bring industry back from China .","commenter_a":"This is exactly what I've been talking about. They want to raise the gas tax, they want to introduce a milage tax. Who will this hurt the most? The pood and middle class. The Democrats don't care about the poor and middle class, they view them as cannon fodder. And uninformed people keep voting for them.","post_message":"The Obama administration and this Dem like the idea of using taxpayer dollars to study... new ways to tax people. Do you think the idea of this new tax is absurd?"},{"comment_id":"10152910836255779","commenter_b":"Simply stated, the majority of the comments on this thread express what she is all about. Feminism, my eye tooth!","commenter_a":"Remember the days when you had to have talent to make the cover of @username? #TakeMeBack","post_message":"Reality-TV juggernaut, selfie queen, actress, model, mother, Internet-breaker, entrepreneur and video game subject Kim Kardashian has something to say: \"I believe that I am so much smarter than I'm portrayed.\" The 34-year-old megastar talks about her scandals, family, and feminism in our wide-ranging new cover story. Here are 11 highlights you won’t want to miss: @webpagelink"},{"comment_id":"10152748736401051","commenter_b":"To bad. You live in this Country and better ahear to our Laws. If you do not want to do it \"go back out of the US.","commenter_a":"Sucks to be her.","post_message":"This woman is very offended by what police asked her to do. The police say they did nothing wrong. Decide for yourselves who is right."},{"comment_id":"10153914215895950","commenter_b":"Go fuck your cousin you wrong turn hillbilly bitch","commenter_a":"11 kids 10 women(I can only imagine what they look like...) there'll be no problem finding pallbearers for this one...Goodbye & Good Luck...","post_message":"Police say Walker, a.k.a. Shawty Lo, may have been the victim of a hit and run."},{"comment_id":"10154807538199705","commenter_b":"This chick probably enjoys white wine and Xanax every night.","commenter_a":"I cant beleive how you support the use of illegal drugs, they destroy everything, stop pretending it is fun or in to use them","post_message":"Andrew Garfield is living his best life."},{"comment_id":"617240545084050","commenter_b":"Gabe Monfried","commenter_a":"She was checking up on Bill","post_message":"It was really strange when Hillary was missing from the podium last night. Not very presidential!"},{"comment_id":"10154018713024411","commenter_b":"Antony. I don't represent the US government. The US government doesn't represent me. I don't excuse all of the bad things the crooks who call themselves \"my government\" do. And none of that excuses crimes Israel commits. Including the subversion of my country's government via AIPAC and all of its spies, such as the traitor Jonothan Pollard, and dual-citizen Israeli loyalists in positions of influence and power. If you don't like the crimes my country has commited in the Middle East since 9/11, you can attribute a big part of the blame on Israel and its subversives in the US. Not all, but a big part.","commenter_a":"The excuse is always the same. A missile from Gaza lands harmlessly into the Israeli desert. Israel bombs the hell out of Gaza, killing dozens or hundreds of civilians. When are people going to wake up to this scam. Israeli agents shoot off the missile to provide a pretext for Israel's aggression.","post_message":"URGENT"}]
