[{"comment_id":"10153625105923128","commenter_b":"Stop bring toilet in every issue","commenter_a":"India should stop releasing Indian Movies in Pakistan long ago ..i don't knw why still they didn't do that","post_message":"Here's why an alleged Pakistani terror group wants a ban on an Indian movie."},{"comment_id":"10153083493211336","commenter_b":"Exactly. Bills must be payed no matter what.","commenter_a":"This is awful...was he not paying the bill? Because just because we are deployed doesn't mean we stop paying bills....I certainly pay all of mine while I'm deployed..","post_message":"Despite laws in place to protect troops, retired Sgt. Charles Beard's car was repossessed while he was serving in Iraq."},{"comment_id":"1398558810203863","commenter_b":"Stay off facebook lady.","commenter_a":"I'm not a hater, and love fashion, but, this dress is absolutely unprofessional! Why would she do something like this...makes a person wonder!!!","post_message":"'She looks like she's working for an escort agency!'"},{"comment_id":"725790477519561","commenter_b":"Ernest, I agree with 100%. If they were doing their job we shouldn't have so many illegals in this country.","commenter_a":"With all the illegals coming in. I thought they were already shut down!","post_message":"Would you be worried if Homeland Security shutdown?"},{"comment_id":"10153367837094714","commenter_b":"You just don't understand feminism, boys are free to do what they want to do women should be just as free, to have sex, get drunk and behave carelessly just like boys do.","commenter_a":"Why would they take offense? Because they want to protect the image and dignity of young women? Seriously?","post_message":"Wow, we didn't see it until we looked closely"},{"comment_id":"10157601256035594","commenter_b":"I don't know who you are hanging out with but you should protect your pussy...","commenter_a":"Hillary calls Trump supporters deplorable... yet a Hillary supporter does this, this disgusting attempt at a 'protest'. This is more foul than the WORDS Trump spoke.","post_message":"“Dear Mr. Trump, I’m not able to mail you my actual p----, so I’ve included the next best thing. Cheers, Emily.”"},{"comment_id":"10154042161636910","commenter_b":"USA Vets, homeless, the disabled! All of our own meaning legal USA citizens need to be taken care of FIRST. That's what we pay into. Get rid of who is faking it also.","commenter_a":"9th Circuit Court of Appeals issued a decision backing an earlier decision by a federal district court judge in Washington State that put President Trump national security Executive order affecting seven countries that harbor terrorists on hold. Activist Judges intruded into areas reserved by the Constitution powers which unambiguously gives constitutional powers to the President. That is why the 9th Circuit ruling is so fundamentally wrong by assuming the power of the President. It is the 9th Circuit that violated the Constitution under the Separation of Powers with its ruling. The fact is that President Trump clearly has the constitutional and statutory authority to issue this order. It is clear: radical Islamic terrorists are at war with America. President Trump order is a proper and constitutional way to protect America. Again, the directives contained in the President Executive Order are closely tethered to discretionary powers vested in the Executive Branch ...","post_message":"A MAJOR SETBACK FOR PRESIDENT TRUMP: The 9TH Circuit Court of Appeals has ruled unanimously against reinstating Trump's travel ban. Do you agree with the ruling? @webpagelink"}]
