[{"comment_id":"891529944370915","commenter_b":"Yes I'm still for Trump! Put this women in prison. Stupid Women Lost & she conceded.","commenter_a":"Yes","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"10156091000625354","commenter_b":"White Trash ...Bastard .... Hoe Bag.... She has Evil Eyes.....Ugly Bitch.....!!!!!!..","commenter_a":"That's this fat slobs 2 seconds of fame, congrats your grandkids will tell stories","post_message":"Here's what we're dealing with, folks…"},{"comment_id":"10154521519049726","commenter_b":"I'm not especially interested in Mexico paying for it - our wall and WE NEED TO GET IT DONE!","commenter_a":"Trump will not only get Mexico to pay for a wall but he will get them to see it's value to them and want it!","post_message":"From Pence's appearance on my show today — Pence all detailed how he and Trump will make Mexico pay for the border wall:"},{"comment_id":"1263330063738211","commenter_b":"WE ARE STRONGER TO-GET-HER AWAY FROM POTUS! #NeverHillary #DrainTheSwamp","commenter_a":"Seeing you, Obama, your husband and the rest of the democrat crooks, liars and thieves in prison for life or the hanging post!!!!!","post_message":""},{"comment_id":"10153167321611519","commenter_b":"Appealing still to fear & hate.","commenter_a":"Dislike!","post_message":"This is why he's shooting to the top of GOP polls..."},{"comment_id":"1237783792909359","commenter_b":"Now the Muslims are going to come here and outbread us? ....is that their big 1000 yr plan? ....lol","commenter_a":"Tell that to my neighbors in Roanoke,VA that got stabbed this weekend . The terrorist is being investigated by the FBI for terrorism....Only when the national news reported the terrorist attempted to behead not stab the man did the local liberal rag paper update their reporting.","post_message":"The United States faces many threats, but terrorism is not chief among them, according to VP Joe Biden. @webpagelink"},{"comment_id":"10154229231904411","commenter_b":"If a woman have every right to show off her body or hair; then why can't she have the right to cover it? I haven't met any veil wearing ladies that have offended me in the least.","commenter_a":"The Golden Rule of Civil Rights is, One Mans Rights End Where Another Mans Rights Begin","post_message":"Awkward: Laurence Rossignol, who is ironically founder of the anti-discrimination organization SOS Racisme, compared Muslim women who wear veils to 'American negroes' who supported slavery"}]
