[{"comment_id":"10154106990671409","commenter_b":"God help us if this is all they can trawl up for person of the year . He is only out to fill his own own pockets further. This misogynistic , ecogotistical man is only out for himself, and will turn out to be america's biggest mistake.","commenter_a":"He's NOT a PERSON!!! He's an orangatan and inhumane ethnocentric lying bully.","post_message":""},{"comment_id":"1746066945644780","commenter_b":"Sickening","commenter_a":"If Hillary wins we are fucked. All will end for this once dear nation. Adios America this nation is now a dump China & Russia are the leading nations now. Deceiving Hillary is going to backstab everyone. She will do anything to get your vote but at the end you will see her lies.","post_message":"Does Trump's violent rhetoric and bigotry remind you of something? Let's take a look back at history and find out... Big thanks to Marianne DeMarco for making this video."},{"comment_id":"1193853800707672","commenter_b":"Cause she's a lesbian LMAO","commenter_a":"i blam obam lol","post_message":"She has the most pro-LGBT platform ever. Here's why."},{"comment_id":"1029438293779366","commenter_b":"Keep Bill away from those girls Hillary!! You know he acts around other girls!!","commenter_a":"The next Americans president and expected cabinet members came 2015","post_message":"On the set of Broad City season 3 with Abbi, Ilana and Amy! #yas"},{"comment_id":"10155260669520557","commenter_b":"Death row is just fun. ;)","commenter_a":"Death is the easy way out, watch some of the programs on prisons Then you will feel better knowing that each and every day he or she will wake up in their 4x6 house shared with another body, no privacy to use the bathroom or get dressed, no delicious food and if their lucky can get through a shower safely. Every day they will think about what they have done and to me this is worst punishment than death!","post_message":"'I'm disappointed... he did not consult with district attorneys or consult with the families of victims whose lives have been torn apart by the people who have been sentenced to death for their actions,' Berks County DA says in speaking out today against Gov. Tom Wolf's moratorium on the death penalty in Pennsylvania."},{"comment_id":"964183830350156","commenter_b":"Somebody give that girl a sammich!","commenter_a":"Kellyanne looks like she is about to physically break down. I would feel sorry for her, but she brings this entirety upon herself.","post_message":"\"'Alternative facts' are not facts. They're falsehoods.\" Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it. Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"10156267037025354","commenter_b":"Why are illegals allowed to have a drivers license? Utter insanity!","commenter_a":"Jerry Brown is a putz! He should have been out of politics decades ago. Look at California. It's a disaster.","post_message":"It's starting."}]
