[{"comment_id":"10157919704880354","commenter_b":"Any woman is capable of cheating","commenter_a":"Deplorable in State Of Jefferson!","post_message":"LIVE: Behind-the-Scenes Look of the New Store with Breitbart's Alex Swoyer,  Sonnie Johnson and Charlie Spiering"},{"comment_id":"1205762199443808","commenter_b":"#trump2016","commenter_a":"Oh boo hoo. Poor baby.","post_message":"\"Fox News has been treating me very unfairly and I have therefore decided that I won't be doing any more Fox shows for the foreseeable future.\""},{"comment_id":"10153311119075329","commenter_b":"I want to know how many of the women that are saying \"I use soap to clean my vag !\" Are really only using soap on their vulva and are NOT actually sticking soap in their vagina.","commenter_a":"Jonathan Perez hahahzha jk","post_message":"FYI"},{"comment_id":"1283735711683013","commenter_b":"horrible woman","commenter_a":"How bitchy she is...very bad attitude though","post_message":"The Hungarian camerawoman who tripped and kicked migrants has been sentenced."},{"comment_id":"836575966473062","commenter_b":"Crooked Hillary is the scum of the Earth","commenter_a":"His campaign is a trainwreck.","post_message":"Meet Trump's new campaign chief: a man whose \"news\" organization, Breitbart, is known for its racist, homophobic, conspiracy-peddling stories."},{"comment_id":"1276333032401449","commenter_b":"And your first lady has a dick","commenter_a":"Haters are real, she is beautiful as fuck with a clown ass husband, I enjoy having a crazy First Lady because I DONT GIVE A FUCK ABOUT A FIRST LADY! STAY FOCUSED ITS ABOUT VOTING FOR THE PRESIDENT NOT THE FIRST LADY YOU FUCKS!","post_message":"This HAS to be said!"},{"comment_id":"1265448890160011","commenter_b":"Dana, what if it's you who's the bitch and not Hillary?","commenter_a":"There isn't a nail in the coffin. At this point in time either you see her for the corrupt lying bitch that she is and refuse to vote for her or you vote for her in spite of it. No one can say she's not a corrupt liar. Either you admit she is and you're voting for her anyway or you are not. The table is set. The pieces are moving.","post_message":"JUST IN!"}]
