[{"comment_id":"496037443910043","commenter_b":"MR TRUMP WHEN YOU BECOME PREZ> HANG A FEW DRUG DEALERS ON COURT SQUARE THEN THEY WOULD THINK TWICE ABOUT SELLING DRUGS TO YOUNG CHILDREN AND DESTROYING ENTIRE FAMILIES!!!!!!!!","commenter_a":"Get them out!!!!!!!!!!!!!!","post_message":"Drug dealers are pouring in from the southern border. We will build a wall on time and on budget. #GOPDebate"},{"comment_id":"1810345725921055","commenter_b":"Hmmm...either the cop is sissy soft or a female cause they lady whom he/she hit took that B...hit like a Champ","commenter_a":"Someone needs to get at that coward... another good cop right?","post_message":"This police officer was caught punching a woman in the face  the woman was arrested and charged with assaulting an officer and resisting arrest."},{"comment_id":"10153134531845927","commenter_b":"these gals need a long vacation i mean a longggggggggggg vacation.","commenter_a":"Joy, you are old and stupid.","post_message":"As long as the candidate is a committed liberal...this View host will overlook just about anything!"},{"comment_id":"10153171684108352","commenter_b":"Gun or no gun this girl would have stabbed him. And believe me, I would have too.","commenter_a":"And why do kids have access to guns?????","post_message":"Florida sisters, aged 15 and 11, are charged with murder of 16-year-old brother who they shot dead"},{"comment_id":"10152662360374117","commenter_b":"Trevor clearly you're an angry misogynistic ass with your little troll posts. Ha.","commenter_a":"What's really alarming is that around 1 in 3 women will be sexually assaulted in their lifetime.","post_message":"Well, this is alarming."},{"comment_id":"1638898229733425","commenter_b":"Everything good in your speech, but I believe illegals should not be getting welfare or food stamps, or free health care or education it's just a magnet and most of them are not paying into payroll taxes. You are still avoiding what you are going to do with the illegals that aren't criminals. Actually they did break the law if they came here illegally and if they stay here even if they don't get citizenship it's still ammnesty. You need to be up front with what you are going to do.","commenter_a":"Great speech!!!!","post_message":"Thank you for your wonderful support last night- with regard to my Immigration Speech that I delivered at the Phoenix Convention Center. I love this country - and you, the people. Lets MAKE AMERICA SAFE AND GREAT AGAIN! I love you! Donald J. Trump"},{"comment_id":"1074912275882577","commenter_b":"Look at their faces....they're smiling. ...and we're not allowed to be angry about this. All of you bigots need to shut up! Wear your flag ....fly your flag......shove your flag.....who cares ....but you will not see it flying over that government building ever again!!!! Deal with that!","commenter_a":"Are these the same, \"It's Heritage, not Hate\" clowns?","post_message":"South Carolina voted to remove the Confederate flag, and bigots are in a frenzy: 'F*ck black people'"}]
