[{"comment_id":"10152978013416615","commenter_b":"She's an evil monster.","commenter_a":"no way she a good mother she killed the boys and watched them die sje isn't a mother she is a monster","post_message":"After all this time, Susan Smith decides to talk about what happened the day she drove into a lake and killed her own sons."},{"comment_id":"10154285827248701","commenter_b":"Trump build that wall!","commenter_a":"Trump will take care of these ghetto rats . They will be leaving the ghettos to find work so they can eat. Instead of waiting for his kids mothers welfare check .","post_message":"He is the second officer to go on trial for the killing of 25-year-old Gray, who died one week after suffering spinal injuries in a police van last year."},{"comment_id":"10152639623811680","commenter_b":"Illegals do vote. @webpagelink","commenter_a":"Not against legal citizens from voting. It is fraud and illegals voting. You took an oath. You should be against it also.","post_message":"Sen. Bernie Sanders: “An absolute disgrace for Republicans in the year 2015 to work overtime to deny people the basic right to vote.”"},{"comment_id":"483709631819617","commenter_b":"FUCK HER and THEM. NONE of THEM HAVE THE AUTHORITY OR POWER to TAKE OUR GUNS!!!!!!!!","commenter_a":"She wants to dictate just like her husband. Make laws she has no business making, and breaking laws as they see fit.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153274768969312","commenter_b":"Doesn't look like it! !!!","commenter_a":"Dont inmates get free dental care?","post_message":"Police say 32-year-old Jemayle Johnson escaped from St. Ann jail around 11:30 last night."},{"comment_id":"1133219213367232","commenter_b":"Brian spot on brother our country is sick you hit nail on the head God bless you.","commenter_a":"AGREE, 100%. AMEN,","post_message":"YES!"},{"comment_id":"1652752338307075","commenter_b":"Wow what a dumb bitch. She's also so stupid that she thinks all Muslims are from other countries. That's funny. Pretty sure my Muslim aunt was born and raised American and so are her children!","commenter_a":"LOL They must be Muslim, people are loosing their minds, they come to a western country, because they don't like there Muslim rules, now they want to change things hear. Can we petition to Ban all Muslims???? Maybe they are color blind!!!!!","post_message":"Students sign petition to ban the song \"White Christmas.\" This is how crazy political correctness is on campuses today!"}]
