[{"comment_id":"614337382087891","commenter_b":"you people get ready for WW 3 because that's where this is heading","commenter_a":"Hillary not trump","post_message":"Join Ohio State students on their ride to vote early LIVE with Jo Ling Kent.   Get all your election coverage here: @webpagelink"},{"comment_id":"10154087182591409","commenter_b":"'@username Michelle had to keep her legs closed or her dick would fall out!","commenter_a":"Lisa erikson just because Hillary hasn't been charged and found guilty doesn't mean she's not. She's a liar and as crooked as Obama and Michelle on many levels. Keep lying to yourself.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154812464086049","commenter_b":"Folks, it is a well known fact in the mental health community that many folks who take ' street drugs' have an underlying UNDIAGNOSED psychiatric condition , such as depression, anxiety, etc. They are 'self-medicating' themselves with street drugs. It is a shame, because many of these individuals could be helped with an early identification and treatments (therapy preferably and meds if needed).","commenter_a":"They should be charged with manslaughter if any of their 'customers' died from overdoses. Sorry. These guys knew what they were selling kills people.","post_message":"HEROIN BUST: 9 people have been arrested in connection with a heroin and oxycodone drug ring on Staten Island. Prosecutors said they've selling for several months. Names of suspects: @webpagelink"},{"comment_id":"10153368528042217","commenter_b":"i might put some tinfoil hats on eBay...","commenter_a":"if this crap conspiracy rubbish was true, the yanks would of asked us to extradite him, which we would have done. its that simple.","post_message":"A UN panel will conclude the Wikileaks founder is being 'arbitrarily detained' in the UK, the Swedish foreign ministry has said."},{"comment_id":"10152958455739071","commenter_b":"If all the Europe will have lider like her then for sure we would have less problems!","commenter_a":"Made in Germany","post_message":"Angela Merkel is a rarity — she's excelled her entire life."},{"comment_id":"1236561799702931","commenter_b":"No Samantha J Clifford The WAR has already been won. Satan and his followers those that follow unknowingly and those that follow blatantly have lost and satan God and us Christians KNOW this. There is NO HOPE without Christ.","commenter_a":"GOD is making gay marriage licenses invalid.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154892796939927","commenter_b":"Hi Kay Facebook Animal Adventure Park","commenter_a":"When the hooves start to come out they are gonna go live from a ground cam, if u like their page u can turn on notifications for videos so u will get a notification to make sure u don't miss it :)","post_message":"LIVE: Giraffe Cam! We continue to watch and wait for April the giraffe to deliver her new bundle of joy."}]
