[{"comment_id":"10155007854069170","commenter_b":"Suck it up and move on lady","commenter_a":"this occurs when they go off their medication","post_message":"Enjoy this video. Watch it repeatedly. Savor it like a fine wine..."},{"comment_id":"10157793591820354","commenter_b":"Yes He should have been the nominee to begin with. She is crooked and shouldn't have been allowed to run.","commenter_a":"Screw Bernie, he showed me he is an ass, gave my money and vote to Hillary, I have move on, I have become a deplorable American","post_message":"Feel the Bern!"},{"comment_id":"10155018398498258","commenter_b":"Who cares She is not that important anyway","commenter_a":"When they go low , we go high","post_message":"Congresswoman Katherine Clark is breaking from tradition to protest Donald J. Trump by boycotting his inauguration."},{"comment_id":"550590221774115","commenter_b":"Republican presidential candidate @username has admitted to lying about his application and acceptance to the U.S. Military Academy at West Point, Politico reported on Friday. The retired neurosurgeon and current GOP frontrunner has been using the story as a central point of his personal life during his campaign.","commenter_a":"But its just been confirmed that you lied about West Point. You're done in my book. Before that, I supported you.","post_message":""},{"comment_id":"1701375029922619","commenter_b":"tough woman hiding behind a mask and hooded sweatshirt, hopes she wears that same outfit in prison","commenter_a":"Why are most democrats fat, stupid, and ugly","post_message":"Obama has allowed STUPID to take over this country...and it's putting American lives in danger!"},{"comment_id":"709751369215441","commenter_b":"Yea I support Texas and believe no Muslims belong in America","commenter_a":"Rigth on Texas","post_message":"Texas is standing up to the invasion of Muslim refugees. Don't mess with Texas. Do you support the great state of Texas?"},{"comment_id":"1561091183908226","commenter_b":"I'll contact everyone of these cunts. I'll fly our and found your bitch ass into the ground since they are so profoundly sure I am not the face of death they never danced with. Boom...","commenter_a":"Boo hoo, my pussy hurts because I didn't get my war queen!","post_message":""}]
