[{"comment_id":"1687768148176964","commenter_b":"Just love that woman","commenter_a":"Love it","post_message":"YES This is why we LOVE you, Reba McEntire!"},{"comment_id":"438540092994538","commenter_b":"Ron i understand....however Im still not tryin to make excuses but im a single homeowner with a mortgage that works full time and has the same bills as everyone else. I wanted it bad enough and i found a way to do it. If anyone wants it bad enough then they will find a way to sacrifice for the time being. Only reason i origanally commented on this post is because i am proof that a lil sacrifice and hard work pays off. I gave up alot for the year i went to school. Most people will just \"omg i cant give all that up, eh ill just work at a crap job and complain and expect to get things handed to me.\" What bothers me is the sarchasm and name calling ive gotten here from some people haha. Ur the ones that want things handed to you probably!! Stop ...","commenter_a":"Or?? How bout it means get off ur butt and try to better yourself....","post_message":"Let's aim for a living wage."},{"comment_id":"1776428082627538","commenter_b":"I pray to God that people who think she would be a good president, realize how wrong they are. I don't know that Trump would be good, but so far he seems better to me than her. Sadly the Libertarian candidate has too many views that are not on par with me and it is in the areas that matter most to me. Trump shares my stance on all of the issues that have come out thus far.","commenter_a":"TRUMP....you better not bail on us man. You're our only hope!!!","post_message":"Hillary Clinton Finally Tells The Truth: Pledges She Will Raise Taxes On Middle Class"},{"comment_id":"10153194214264411","commenter_b":"That goes to zionist jews pigs from europe","commenter_a":"it's very important to distinguish between real Muslims and crazy fanatics who preach radical Islam. They just hide behind pseudo faith in God to do terrible things...","post_message":""},{"comment_id":"1076328745721469","commenter_b":"I got bafar as well","commenter_a":"Woooow @username","post_message":"This is really, really weird. Check out the explanation here: bit.ly/1bRZ7nn Via by AsapSCIENCE."},{"comment_id":"10152995985561130","commenter_b":"shes such an ass!","commenter_a":"@username lol","post_message":"What the..."},{"comment_id":"10152972519324753","commenter_b":"This bitch","commenter_a":"Nathan Perez @username omg","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."}]
