[{"comment_id":"10153635584924575","commenter_b":"What about rap videos or BET...come on people","commenter_a":"All them white girls in one video.....thats RACIST","post_message":"A University of Alabama sorority has taken down a recruitment video after receiving a lot of criticism. One website described it as, \"Stepford Wives: College Edition. It’s all so…unempowering.\""},{"comment_id":"965007433534716","commenter_b":"2 pussy's","commenter_a":"Freya Mistry Rayan Mistry","post_message":"Donald Trump and Jeb Bush are fighting over who is tougher. What do you think?"},{"comment_id":"1170595402996226","commenter_b":"And the world would be a lot better place without your racist, misogynistic ass in it. Twit begone!","commenter_a":"Most admired my ass this stinking bitch allowed 4 people to die she a corrupt lying useless bitch should been in jail or zoo cage right next to the ape in heels","post_message":"Hillary Clinton just won Gallup's \"Most Admired Woman\" poll for the 21st time. Do you admire her?"},{"comment_id":"1722190664688272","commenter_b":"Go back to your Country!","commenter_a":"Then get the hell out of our country.. go back to your country so you can smell camel s***","post_message":"Muslims Throw Fit Over Odor From Bacon, Then THIS Happened Do you love the smell of bacon? @webpagelink"},{"comment_id":"1104177846295508","commenter_b":"@username Actually the major of women that have Abortions are Christian @webpagelink","commenter_a":"thats is because the democRATs favorite sport is killing our unborn babies...","post_message":"There is something very important missing here..."},{"comment_id":"10154962513977235","commenter_b":"That's Trump's kinda gal. She and Melanoma should get together and compare notes.","commenter_a":"Shows how repub's don't have a brain of their own! The just regurg other people's info and apparently aren't too concerned about the ethics of theft 👎🏼","post_message":"\"The book contained a complete cut and paste job on Keynesian economics taken from off the internet.\" BUSTED!"},{"comment_id":"10152967857461519","commenter_b":"Yeah, I am sure all the female open carriers/ gun owners are using firearms to compensate for their small penis'","commenter_a":"Tari, have you ever actually read the second amendment? It calls for a WELL-REGULATED militia. Not just any white supremecist or Al Qaida operative who goes to a gun show. In Vermont you have fewer urban areas. It is like saying nobody gets mugged on a row boat. I am a gun owner and I really wish that buttholes like you and these NRA pimps with your illiterate interpretation of the second amendment would go help someone else. Ammosexuals are giving responsible gun owners a bad name.","post_message":"\"A law requiring people to apply for a permit before buying a handgun helped Connecticut quietly reduce its firearm-related homicide rate by 40 percent.\" Imagine how many lives could be saved if other states passed similar laws."}]
