[{"comment_id":"942185122493609","commenter_b":"Please, get some more facts before you continue spreading such nonsense. Of course GUN voilence is down - but violence, homicides, etc are NOT. Home invasions are up though... bc criminals know responsible home owners aren't carrying any more. Please, get a clue. Guns are not the big problem, and more gun laws do NOT stop CRIMINALS. You know who gun laws hurt, responsible gun owners.","commenter_a":"Did any of you even read all the way through? Statistics clearly show that stricter gun laws prevent shootings. Look at Australia. They used to have guns. Had a massacre. Made them illegal. No more massacres. Their gun violence is almost non existent since they made guns illegal.","post_message":"So sad."},{"comment_id":"10156411867420354","commenter_b":"@username , NO MORE REFUGEES !! I DO SAY NEVER FORGET WHAT THE islamoCRAPS AND obuma HAVE DONE TO AMERICA ! PROSECUTE obuma & killery FOR TREASON !! DONALD TRUMP/CRUZ 2016 ! AMERICA NEEDS PHOTO I.D. TO VOTE , IDENTIFICATION , FOOD STAMPS , ETC ! TERM LIMITS WITH NO BENEFITS ! DRUG TEST ALL FED. EMPLOYEES AND THOSE COLLECTING WELFARE ! ABOLISH ALL GUN FREE ZONES ! IF YOU AGREE PASS IT ON !","commenter_a":"Political correctness=Nazism","post_message":"When you see the so-called \"politically incorrect\" sign, you'll instantly understand why liberals' heads are exploding...and will want to buy a cupcake from these folks."},{"comment_id":"523996764459649","commenter_b":"She is so full of crap!!!","commenter_a":"Not my husband ... Wrong again Laura !","post_message":"Laura Ingraham makes predictions:"},{"comment_id":"1739262919647781","commenter_b":"Hilary is a Republican. She votes like one on war and trade deals. I can find examples if you would like","commenter_a":"Dear Democrats. Bernie Sanders is \"not\" a Democrat. Bernie applied as a conscientious objector in the Vietnam war and did until he was too old to be drafted. In July 1985, Bernie Sanders traveled to Nicaragua, where he attended an event that one wire report dubbed an -U.S. rally. In 1981, he won a shocking victory by only 10 votes to become mayor of Vermont largest city, Burlington. Sanders was elected on a socialist platform and led a mayoral administration that he boasted was radical than any other in the country. And he had a vision! Sanders believed his work in Burlington could spread socialism throughout America. In April 1985, the Los Angeles Times published a lengthy interview with Sanders in which he outlined his plan to spark change. That is exactly what he is trying to do now. Show a tiny bit of his plan and drastically change America ...","post_message":"Back-to-back poll results suggest that Hillary Clinton is on the cusp of a pivotal victory that would help her regain momentum after a string of embarrassing defeats and that would deliver a blow to Bernie Sanders as the two Democrats gear up for the final stretch of voting."},{"comment_id":"1169496993094128","commenter_b":"Girl, you nuts.","commenter_a":"Don't believe everything you read, folks...apparently Nate Silver got a call from Washington, telling him to \"fix\" his poll numbers from last week. Trump is trumping HRC, and the media is lying to us all. Shoulda picked Bernie when they had the chance. #stillsanders #neverhillary #electionfraud #dnc","post_message":"Our latest polls-only election forecast gives Donald Trump an 17% chance to win the presidency. Polls-plus puts it at 24%"},{"comment_id":"1055649497786607","commenter_b":"I have been doing some serious thinking on this. I have always been pro second amendment, but maybe it is time to take a look at this from another direction. I propose we start here and see how this new gun control thing works. I propose that all people convicted of felonies be banned from owning/possessing firearms. All convicted felons should be made to turn in the guns the legally own now. Once we have all of those, lets move to people convicted of misdemeanor crimes of violence, like assault, sexual battery and so on. Lets get all those criminals that currently legally owning guns to turn those in. I figure it will take a year or so for all these people to disarm and turn in their guns and then we can see if we are having a positive impact on violent gun crimes. If so, then we can ...","commenter_a":"What don't the gun grabbers understand, if you take every gun out of every house hold we have no defense against the bad guys with the guns because they don't give a shit about the laws to start with...","post_message":""},{"comment_id":"1045198175503230","commenter_b":"BS, keep our money home to help Americans who need it.","commenter_a":"What the??","post_message":"Obama pledged millions of dollars to fight climate change abroad. And it comes straight from YOUR pocket!"}]
