[{"comment_id":"10153464723413734","commenter_b":"Take that child away from these monsters! Do NOT allow him back in that 'home'!","commenter_a":"That's the kind of monster that deserves the death penalty.","post_message":"#BREAKING news out of Maryland.  The mom's boyfriend has reportedly been charged.  More details as they become available."},{"comment_id":"614623428725949","commenter_b":"Should of shot the bitches in the fu$king faces, enough of this shit with these animals","commenter_a":"They are racist.","post_message":"Burqa-Clad Muslims Sue For “Racist” Treatment… Get a RUDE Wake Up Call"},{"comment_id":"10154284439844749","commenter_b":"Women should lift each other up? Good luck lifting her up!","commenter_a":"Beauty comes in all shapes and sizes. Women should lift each other up, not let little girls tear each other down.","post_message":"'When I tell people I'm a model, they look at me like I've said I've murdered someone.'"},{"comment_id":"1715229538739557","commenter_b":"True. Plus who would want to see Hillary the Hag naked","commenter_a":"She was a good looking woman, now lets see them run nude picture of Hillary or maybe Chelsea, but then that would be equal and fair treatment and they will NOT be that.","post_message":"NYPOST runs naked pics of Trump's wife... again"},{"comment_id":"1244912678938315","commenter_b":"... Hillary Clinton for 2016 ...","commenter_a":"A terrorist killed your son. A terrorist the FBI removed from the watch list.Sorry for your loss, it must be devastating but Obama and Hillary wants more terrorists to come here.","post_message":"'Christopher's paternal grandparents met and fell in love in a Japanese internment camp, so it was in in DNA that love always trumps hate.'  - Christine Leinonen remembers her son Christopher, who was killed in the shooting at Pulse Nightclub in Orlando  Watch as the DNC took on the gun lobby: @webpagelink"},{"comment_id":"10152633233581680","commenter_b":"women are human beings that can die from forced pregnancy.","commenter_a":"A baby is not a CHOICE its a human being thats alive.","post_message":"“Congrats, you’ve earned this for trying to deny women their right to choice,” the note inside read. “Mind your own uterus.”"},{"comment_id":"10153383373028984","commenter_b":"Why don't you go back to where you came from Asshole!!!!","commenter_a":"President Obama said the right thing.","post_message":"Israelis are NOT happy about this, and it's easy to see why. Whoever becomes president in 2016 will have a lot of work to do in repairing relations with Israel...  Do you support Benjamin Netanyahu - בנימין נתניהו and Israel despite what Obama does?"}]
