[{"comment_id":"900706196692300","commenter_b":"So, David, share some more of your white Texan wisdom. What is a \"real woman.\" Please, mansplain it to us.","commenter_a":"I still have trouble with why anyone would want to become an elderly woman.","post_message":"\"I think [Bruce] Jenner has a right to do what Jenner wants to do, and the way Jenner wants to do it.\" -Jeffrey Tambor"},{"comment_id":"1175706475803156","commenter_b":"But women shouldn't be able to get birth control or abortions...","commenter_a":"Now thats the Paul Ryan I know.","post_message":"WOW."},{"comment_id":"608238889333781","commenter_b":"They can leave this country","commenter_a":"Tell them to leave","post_message":"Texas Man Told Remove His American Flag Because It Was A ‘Threat To Muslims’. Let's show this patriot our support. Can we get 75,000 'LIKES' for his love of his country?"},{"comment_id":"10153102979511545","commenter_b":"I heard of it last night on the news. Disgusting!!!","commenter_a":"@username have you heard about this?","post_message":"Just in: This is gross..."},{"comment_id":"618479561657305","commenter_b":"You should really pay a visit to area 51 theres aliens there","commenter_a":"Why didn't you bring up in your speech how the people at the Bataclan were tortured and videotaped before being murdered - oh and that it was hidden by the media...","post_message":"Hillary Clinton will increase Syrian refugees by 550% without a realistic screening process."},{"comment_id":"975170995873379","commenter_b":"Boo you whore","commenter_a":"She's still a total train wreck? What change?","post_message":"This medicine changes the life of anyone that uses it."},{"comment_id":"1032567170171905","commenter_b":"Remove her ass from the team.","commenter_a":"We are glad you are unhappy here... Please feel free to hightail it home!!! You are an embarrassment to our country!!!","post_message":"Ibtihaj Muhammad - the first American Muslim to compete in the Olympics wearing a hijab - just went on a disgusting rant about how much she hates the United States. This is SICK..."}]
