[{"comment_id":"10153836700616636","commenter_b":" Classic","commenter_a":"Stop your lies and propaganda against muslims! Muslims would never do this cause they are peaceful! Tell the truth! This was an orchestrated conspiracy by the scientologists!","post_message":"He was 84"},{"comment_id":"546309585494081","commenter_b":"Another scenario: Let's raise minimum wage and keep everyone else's the same. That way their money is worthless and means less, as opposed to this minimal skill havin high school dropout with 6 kids with 4 different fathers/mothers so the price of goods will rise and you'll be in the same poverty stricken boat as you were but now you've lowered the entire middle class in it with you. And people can we get over the race thing? It's very tiresome and down right comical.","commenter_a":"This is complete and utter FAIL. If you work hard and make smart life decisions, you absolutely can succeed. What idiot came up with this B.S.?","post_message":"Seems legit."},{"comment_id":"1771730343061531","commenter_b":"@username, no too bad YOUR MOTHER DIDN'T HAVE ONE!","commenter_a":"If anyone is out of touch with mainstream America it's conservatives. What this really should is how liberals are against bigoted, hateful, judgmental, narrow minded christian WHITE CONSERVATIVE IDIOTS.","post_message":"Democrats' threats of violence are intensifying, showing voters  how radical and out of touch Hillary Clinton and Leftist radicals truly are with mainstream America..."},{"comment_id":"10153363571284087","commenter_b":"Gun control is always pushed by angry racist white people @webpagelink","commenter_a":"We lost the battle for gun control when Republicans refused to do anything after Sandy Hook. If over 20 dead children doesn't motivate them to do anything, nothing will.","post_message":"“When are we really going to stand up and do something? Just who has to die? Your mother, your wife, your son or just how many?” Rep. Robin Kelly asked her colleagues in Congress. “We need to stand up, speak up and take action, rather than another moment of silence. It’s deafening, and it’s killing us.\""},{"comment_id":"10153867352421756","commenter_b":"No, it actually wasn't. Students were allowed to carry. The fact that students were allowed to carry may explain how the shooter got to the classroom carrying a long gun without being stopped. He wasn't doing anything illegal until the second he opened fire. Surprise, everybody!","commenter_a":"survived the army to be shot in college, go america","post_message":"It's emerged that the 30-year-old father ran at the attacker, trying to block the door to a classroom to protect his classmates — and suffering several bullet wounds and two broken legs in the attempt, according to his family."},{"comment_id":"1838786586350264","commenter_b":"This is a nothing story, women have been allowed to go topless in Canada since 1995. Grow up and get over the human body.","commenter_a":"Now this is a cause that I can put my hands up and support......Just kidding. I agree that if it's good for one gender, then it should be good for both genders.","post_message":"\"As long as men are allowed to be topless in public, women should have the same constitutional right.\""},{"comment_id":"731938580238084","commenter_b":"We need to look at all facts here. It looks like the victim went looking for trouble. YOU DON'T ASK YOUR SON TO GO GET THIS GUN! I have a feeling she could have been alive today if she had acted like a responsible adult and called the police if he had threatened her. Also, if she was the victim of a gun fight which she started. I WOULD JUST CALL THIS SAD! SAD SHE DID NOT HAVE BETTER SENSE AND LESS ANGER!","commenter_a":"WaaaWaaaa!!!!","post_message":"He suffered a severe head injury, records show."}]
