[{"comment_id":"10152861667311045","commenter_b":"I don't agree with abortion, but when you have an abortion the baby dies, it's suffering is over. Women who do drugs while they are pregnant can cause problems for these children their entire lives. And we foot the bill for it. They should be charged, never given their kids back and the law should stop having these double standards. And if they didn't cause their kids damage then they still did the equivalent of putting a gun to its head and playing Russian roulette, which would also be child endangerment and child abuse.","commenter_a":"Does anybody find it ironic that they can be charged for exposing their unborn babies to drugs while it is legal for them to kill/abort those same babies? Either unborn babies are people with rights or they aren't. Odd how \"the law\" can have it both ways.","post_message":"Two Shoals women are charged with exposing their children to drugs. Both women are pregnant, and are in the community corrections program. Investigators say the two failed mandatory drug tests."},{"comment_id":"878303132360263","commenter_b":"Just like your whore mother.","commenter_a":"That's no lady. It's a MAN !!","post_message":"Here's the ugly truth about MOOCHELLE. This is disgusting. Do you think Michelle is the worst first lady in history? Comment 'yes' or 'no'!"},{"comment_id":"10156239205725354","commenter_b":"Let America become a car and truck free nation! and make it against the law to have any types of butter knives, butcher knives, and no hatchets, swords or knives of any shape or form, no sharp spears or sticks of any kind, pointed objects, needles including knitting, or sewing needles and absolutly NO clubs or bats or rocks of any shape or kind!! No ropes or twine or chains or braided objects! If they break the law and have any of these weapons in posession they will be put in prison untill they rot! Now tell me how is the government going to house and feeed all these lawbreakers????????............................................?","commenter_a":"You guys have no frigin idea what your talking about.","post_message":"No word yet on when they will call for a car-free America..."},{"comment_id":"987975737904514","commenter_b":"obitch isn't happy unless she's ruining things for chidren","commenter_a":"She has no Constitutional authority at all...why do we allow her interference in our schools, homes and communities?","post_message":"Michelle Obama wants to BAN HALLOWEEN!"},{"comment_id":"10153309125991491","commenter_b":"Kerr, it's not the good guns with guns in the US. It's the BAD ones.","commenter_a":"He is 100% right. The attackers would've been shot down where possible. Edited for grammar.","post_message":"\"It would have been a much, much different situation.\" - Donald J. Trump"},{"comment_id":"10153493676581770","commenter_b":"Them bitches will kill you quick as their men.its their belief.","commenter_a":"It's about time!","post_message":"A collection of brave individuals acting on behalf of a little-known non-profit is running daring operations to free Islamic State sex slaves, including literally cutting the chains binding a woman to a bed."},{"comment_id":"783948935040375","commenter_b":"I have seen girls wear a lot worse. Actually the dress is beautiful.","commenter_a":"She's beautiful and the dress is fine shame on the teacher for saying such a thing the teacher should have minded her own business !!!","post_message":"Do you have a problem with this dress? This young lady was shamed for wearing this dress to her senior prom. A teacher claimed it was too revealing and said \"Us big girls gotta cover up.\" More: @webpagelink"}]
