[{"comment_id":"10153653064325575","commenter_b":"Please get rid of this POS","commenter_a":"100% pathetic - Trump 2016 !","post_message":"Talk about OUT OF TOUCH!"},{"comment_id":"10153989537064203","commenter_b":"Lots of women in Iran do not wear head scarfs","commenter_a":"I wouldn't want to land there. They'd want me to wear a headscarf to walk off the plane. Nope","post_message":"If they had not become international pariahs, could Tehran have been to airline routes what Dubai now is?"},{"comment_id":"10153514569274228","commenter_b":"@username, although they were religious and studied the bible, they were vehemently against forming a national religion and/or intertwining government and religion.","commenter_a":"This is garbage. Separation of church and state was never and will never be a thing in the cultural vacuum that is the American bible belt.","post_message":"Not everyone is pleased with the new decals"},{"comment_id":"606223439551496","commenter_b":"Cough cough a lady? Your kidding me! She is one of the most evil murderous woman alive.","commenter_a":"Oh yes Vicente like a mother that does nothing. One who allows her children to run amuck without obeying any rules or following the law. One who lies and deceives others for her own monetary gain. A mother who blames others for her mistakes. Yes Former President Vicente Fox this is your kind of Mother. Your people would continue to invade America. Our country would suffer greatly. Your drugs would kill and maim our children and others. She is just the Mother for you. However in America we want a different leader. We want Donald Trump. He will protect and defend America where others would not.","post_message":"\"I envision the presidency of the United States to be like a good [loving] and caring mother, a real lady,” said Vicente Fox."},{"comment_id":"10153764706938984","commenter_b":"Bring the hostages home AND KILL THE IRAN DEAL!!!","commenter_a":"Anything to stop him is ok","post_message":"Senate Republicans just revealed their bold new plan to stop Obama, and Democrats are NOT happy they're putting up this fight... Do you support what these Republicans are doing?"},{"comment_id":"1337743466286160","commenter_b":"How about we deplorables boycott all of you talentless walking DUMB LIBTURDS!!!","commenter_a":"These slobs have sold their souls years ago on the casting couch of Hollywood! What do they know about the struggle of the everyday @username! Go back to your fantasy world of make believe, most people live in the REAL world!","post_message":"Hollywood Hail Mary: See who's begging the Electoral College to vote against Donald J. Trump."},{"comment_id":"10153828694670779","commenter_b":"So was Hillary's. But don't see you bitching about her. Oh that's right, you're for her, lol. They both suck! And war is coming. Hope you all are ready!","commenter_a":"Poor Frump supporters. At least they have the right temperament. :-D","post_message":"Donald J. Trump's debate conduct is destined to become a future candidate-training video of what not to do. The man dismissed as the most ignorant, uncivil and unprepared major-party candidate in history could not have conducted himself more poorly."}]
