[{"comment_id":"1100490033318081","commenter_b":"Suck it up b**ch","commenter_a":"I thought this family was rich. What gives?","post_message":"Hardly 5 star quality... \"She explained a slight bit of displeasure about her accommodations and I explained to her this a jail, not a resort.\" -Sheriff Anderson @webpagelink"},{"comment_id":"1275473112509215","commenter_b":"#GrabThemByThePussy #MakingSexualAssaultGreatAgain","commenter_a":"Deplorables say don't judge Trump for something he did ten years ago yet they keep bringing up something Bill Clinton did 20 years ago. Deplorables say Hillary is an enabler for standing by her cheating husband.... But Melania is a good wife for standing by her twice divorced husband who cheated on her while she was pregnant? Hypocrisy is the running mate of Donald Trump. And sexual assault. Don't forget that. #GrabThemByThePu$$y #MakeSexualAssaultGreatAgain","post_message":"\"Everyone knows how bright she is and how resilient she is, but...they're going to see how much she cares.\" —Joe Biden"},{"comment_id":"1569798589746550","commenter_b":"Lock her away...","commenter_a":"Common assault","post_message":"This is disgusting"},{"comment_id":"10153155550251051","commenter_b":"Oh Erika bitch still has vagina","commenter_a":"HUGE.....SORRY ISRAEL...OUR PRESIDENT IS SETTING US UP FOR WAR....SORRY HES SUCH AN EVIL P.O.S....an i for one stand with my people an Israel....suk it obama....rot!!!!!","post_message":"Israel came out and called President Obama's nuclear deal with Iran a big mistake. Here's how they're going to respond to it. Do you agree or disagree with the idea that the Iran deal is a mistake?"},{"comment_id":"10153321709602217","commenter_b":"shes dissolving the trends in the fashion world","commenter_a":"Nigeria is looking for their 2016 budget","post_message":"She's fronting a campaign called the \"Face of Courage\"."},{"comment_id":"10152869218796336","commenter_b":"They are illegal!","commenter_a":"Proud of them reporting TRUTH instead of warped pc bs.","post_message":"A California newspaper will continue to use the term \"illegals\" to describe people who enter the U.S. without permission, despite an attack on its building by vandals believed to object to the term."},{"comment_id":"10153609828841051","commenter_b":"and where are these little bastards from ? shot there little asses down like the dogs they are and make there parents pay for this lady for the rest of her life and a huge settlement to her first.","commenter_a":"People are VENDICTIVE!!!! Mean...and must be CRAZY! What makes people want to do these things! We need an island , or send them to the Muslim area. There they will see what CRAZY IS!!!","post_message":"First these boys attacked an 87-year-old woman. Then they raped her. And then they poured bleach down her throat."}]
