[{"comment_id":"1054779971229141","commenter_b":"Shes just crabby because no one will rape her","commenter_a":"And thank here for elevating race hatred to a new high!","post_message":"Ann Coulter actually said Hispanic immigrants were responsible for the \"browning of America.\""},{"comment_id":"980300718729649","commenter_b":"The 2 trillion plus mentioned was already taxed in the countries their products were sold into! Why is it that our government is the only nation that promotes the idea of US companies paying taxes on products they never sold here? That is pure greed and BS! If our government was really interested in repatriation of those funds they would create a tax environment that encouraged companies to keep their plants and wealth here!","commenter_a":"and the moron we have now is no better and the douch bag is not the answer either","post_message":"We have much bigger problems to worry about. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154473389496336","commenter_b":"Hahaha we thought same thing.","commenter_a":"Lmao! So the DNC asked the lady who caused all the chaos in Baltimore to restore order ?? Wow ! The DNC is in trouble","post_message":"Baltimore Mayor Stephanie Rawlings-Blake gaveled in to bring the Democratic National Convention to order, after Debbie Wasserman Schultz excused herself from the role amid controversy regarding leaked DNC emails."},{"comment_id":"10153957663196509","commenter_b":"i would run away too if rosie was my embarassing mother, RUN GIRL RUN......","commenter_a":"Gay parents would make any child go crazy!!!","post_message":"The 17-year-old had stopped taking medication for an undisclosed mental illness, Rosie O'Donnell said in a statement. @webpagelink"},{"comment_id":"1748645152080208","commenter_b":"heck ya we need a woman in the white house","commenter_a":"That's what I'm talking about Clinton 2016","post_message":"BREAKING: NBC News projects Hillary Clinton as the Democratic presumptive nominee. Read more: @webpagelink"},{"comment_id":"1349045918521792","commenter_b":"You have a lot of names there Laurren.. The typical liberal feminist skank.. Way to go","commenter_a":"Just a suggestion for you @username people. If you dislike Trump and hate that he won a fair election then I suggest you retreat into your safe space for the next 4 years (at least). Shouldn't cause you too many problems as you probably don't have jobs anyway.","post_message":"This website is going viral, and Trump is not happy. You know what to do!"},{"comment_id":"10152850999936813","commenter_b":"One thing that strikes me is how people obsess with the LGBT. For some reason it's \"all the Gay's fault\". If only we could get rid of them, all our world's social problems will be solved. NOTICE: YOU DO NOT SEE SIGNS SAYING: \"ADULTERERS/CHEATERS, WIFE BEATERS, ADDICTS, RAPISTS, CHILD MOLESTERS, LIARS, THIEVES, TERRORISTS, CORRUPT POLITICIANS & PASTORS WILL NOT BE SERVED OR ARE NOT WELCOME IN THIS STORE\". NONE! It's always the Gays....","commenter_a":"Actually let small businesses post these types of signs. This tells me to take my dollars elsewhere!","post_message":"Tennessee hardware store owner hangs a “no gays” sign in the front window. It's 2015, not the 1950's. @webpagelink"}]
