[{"comment_id":"10153680783882439","commenter_b":"AMERICA NEEDS TO DEPORT 'EACH AND EVERY MUSLIM' THAT IS HERE TO HARM ANY PERSON!! AMERICANS DON'T WANT THEM HERE!!","commenter_a":"Obama thinks a job will stop these brutes from their evil ways.","post_message":"The devout Muslim began making threats praying to Allah and saying he was going to set off a bomb — “he’s still threatening to kill anyone who isn’t a member of Islam or Muslim.” He’s an Iranian national here on a work visa. Deport him  – now."},{"comment_id":"10153896668671990","commenter_b":"She need the flowjob","commenter_a":"Why didn't this happen to my poll areas","post_message":"Two women, naked from the chest up, bust into a Manhattan polling station early Tuesday, shouting:  of our polls Trump, out of our polls Trump! Donald Trump was expected to show up later to cast a vote himself.  Our reporter Mark Matthews was in the basement of PS 59. @webpagelink"},{"comment_id":"10153967665463984","commenter_b":"This is one ugly woman","commenter_a":"Consider the source folks. Look what she married. Speaks volumes doesn't it.","post_message":"Michelle Obama took to Twitter over the weekend, and posted a disgusting image that features a U.S. Marine.  This is so typical of the Obama White House, and Twitter users everywhere called her out on it.  It's disgraceful that Marines are treated like this by the family they're there to protect."},{"comment_id":"10153933492904411","commenter_b":"lol it makes no fucking difference you whiny bitch","commenter_a":"Miss Universe pageant is all politics.... the Elites crown whichever country they wanna make use of. In this case, the Phillippines in the South China Sea issue. Whereas Colombia is drawing closer to China this year, this is just humiliating Colombia in public.","post_message":"Oops: Steve Harvey crowns wrong #MissUniverse2015"},{"comment_id":"10153277341923188","commenter_b":"I do believe the 'offended' have been organized by an outsider to bombard anyone helping to stabilize the area. It is not Whole Foods, The National Guard or the Police who need scrutinized! It's the Promoters who keep unrest in the media way beyond the time it is newsworthy! Always seems to be when there is a 'Political' issue, Ferguson-illegal aliens, Baltimore- Clinton Foundation and the very questionable donations. Of course the nuke treaty with Iran, etc.! Protesters in both cities started out fairly calm. Then hordes of people started pouring out of the woodwork, looting, burning, destroying, many were not even from that area! How did they get organized so quick? I agree that All Lives Matter in every community. I also believe a huge % of our Police Departments are doing what they have to do with the Thugs who lack any respect for our laws! Rap sheets ...","commenter_a":"So sad they were doing the right thing.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"676289335864353","commenter_b":"'@username that's what I thought. Looks like she would suck a dick for a diet coke.","commenter_a":"I bet not one of you, without google, even knows why the song is racist or if it's even racist at all. You're pathetic. The problem with America is Americans. STOP TRYING TO SHOVE YOUR OPINION ON EVERYONE, just because you don't like what they do doesn't make them wrong. If you really believed in freedom you'd keep your mouth shut but you don't. You believe in shoving your opinion down the throats of everyone.","post_message":"“I don’t even think the song should be our national anthem, because it’s a racist song.'"},{"comment_id":"2071257249766331","commenter_b":"Only American enemies would want to remove it!","commenter_a":"Like","post_message":"There is no reason whatsoever that justifies removing this picture. Can we get 5,000 'LIKES' to keep it in the Museum?"}]
