[{"comment_id":"10153179691834091","commenter_b":"Hmm...not as bright as WE thought, are you???","commenter_a":"See there, its already fixed. I'm sure it's not the first time this has happened. Everyone have a great night.","post_message":"YIKES!!!"},{"comment_id":"10153635432868690","commenter_b":"Its not and has never been your land. You have no heritage nor history there except at best been that of tenant felaheens the Ottomans brought to milk the land for them or at worst; as more than half of you people are, illegal immigrants from the surrounding Arab states who flooded the land from the 1920s to 1940s as migrant workers and mujahideen who came to steal the land from the Jews. That your right of return better get its head swivelled to the Arab states. Besides, the Jews you ran out of the Arab states also has the keys to their doors and need their properties you stole and their own right of return.","commenter_a":"You will return and all Muslims will pray in Israhell won't last more than a decade","post_message":"'For Palestinians to give up the Right of Return- even those who have no intention of ever returning - is to acknowledge that we are lesser beings; that kicking us out of our homes and ripping our hearts out was okay. It is to affirm that we do not deserve our own history and heritage; that it was okay for our proud parents and grandparents to wither in the ashes of their memories inside refugee camps unfit for animals.'  Palestinian novelist Susan Abulhawa explores the meaning of the Right of Return."},{"comment_id":"1174959735872779","commenter_b":"They reported that in Oklahoma only Blue Cross/Shield was still in it and that they will be dropping out as well.","commenter_a":"I hope so...","post_message":"It's official!"},{"comment_id":"10153404039272293","commenter_b":"'@username police kill blacks at a rate disproportionate to their total percentage of the population an assertion supported by The Guardian statistics. Police killed almost five black people per every million black residents of the U.S., compared with about 2 per million for both white and hispanic victims. @webpagelink","commenter_a":"Tamir was a 12 year old boy. TWELVE!!!","post_message":"'I saw the weapon in his hand coming out of his waistband,' one officer wrote in his statement. 'The threat to my partner and myself was real and active.'"},{"comment_id":"10152694344065736","commenter_b":"Stupid woman","commenter_a":"But, it's fine to hire a' doctor' to kill your baby. That's logical.","post_message":"An Indiana woman's self-abortion has thrust her into the debate over reproductive rights."},{"comment_id":"891987007503062","commenter_b":"Death row for that bitch!","commenter_a":"DEATH!!!!!!!!!!","post_message":"The trial has finally started for this officer, after witnesses say they saw him pull out a knife and slit the dog's throat open, even though the dog was already restrained.  If you were the judge in this case, what would you sentence him to?"},{"comment_id":"10152839812269753","commenter_b":"It's the POLIC WHO ARE PAID TO USE EXTRA FORCE (excessive force). It's not the job of employees, unless it's a security guard. They can RESTRAIN A PERSON UNTIL THE POLICE GET THERE.","commenter_a":"no she deserves it","post_message":"Even though she was able to successfully open the driver’s door of her getaway car, the man did not allow her to get much farther than that. He grabbed the shoplifting woman as she opened the door, turned her on her back and slammed her on the ground seconds later.  You think he used excessive force?"}]
