[{"comment_id":"10154089965446336","commenter_b":"Yeah, lice likes very clean hair. If you put products in their hair it's likely they won't get it. Oily hair care products are","commenter_a":"It's not super lice it's called...ignorance. Schools inform by sending a note that lice has been found in the classroom. The person is not identified at all..not even to the parent. Infested child goes untreated. Why? The same reason some are abused and some are not, the same reason some parents care about their children and others don't. Children are going untreated and/or not treated properly. This has been going on for years.","post_message":"What can you do if your child is affected?"},{"comment_id":"1380609545301335","commenter_b":"GOOO NORTH DAKOTA, WISCONSIN, CA. , NEW YORK BRING IT ON IN!!!!! ALL ABOARD NEXT STOP THE WHITE HOUSE!!! ADDING COAL TO THE TRAIN!!! MEDIA,MEDIA, MEDIA!!! NO MATTER HOW YOU TRY YOU CAN'T TRUMP THE DONALD!!!! CRUZ KASICH =ESTABLISHMENT'S COCKROACHES!!! A VOTE FOR THEM IS A VOTE FOR HILLARY OR BERNIE!!!!!! ALL ABOARD !!!! NEXT STOP THE WHITE HOUSE!! T TRAIN R ROLLING U UNITED M MOVED BY THE PEOPLE P PRESIDENT TRUMP","commenter_a":"Any word on royal booze taster Glenn Beeks and his daily abuse of Christianity. I mean what a embarrassment that guy is using God and Christianity to prop up that disgusting philanderer Cruz","post_message":"It's a super religious day or something, he maybe thinks."},{"comment_id":"1046419898744877","commenter_b":"What a total moron !!! This woman really was an Amb. at one time ,what an asshol. she is !!!","commenter_a":"They already did you cow!!!!!!!","post_message":"Former Secretary of State Madeleine Albright says that 'nobody is going to die as a result of' Hillary Clinton's emails."},{"comment_id":"10153652189710530","commenter_b":"Save the geese. Ban airplanes.","commenter_a":"Doug smith- what are they going to do? They can potentially set fire to a blanketed horse causing severe burns or death. It's all fun until it's one of your loved pets. Caroline Torr This horse was in a field when a Chinese lantern landed on top of the horse's blanket and set the horse on fire! Chinese lantern may look amazing when let off but do you know where yours lands after you have seen it fly away??? What do u think happens to the wire frame of the lantern? The ban of Chinese lanterns needs to happen and can't come fast enough for me!!","post_message":"Should there be exceptions to Canton's sky lantern ban?"},{"comment_id":"10156089078040354","commenter_b":"Put The Woman In Jail!","commenter_a":"THROW - HER - IN - JAIL - NOW! What the hell are they waiting for? Drag her ass to jail in handcuffs wearing a sign around her neck that says, 'ALL YOU OTHER CRIMINAL POLITICIANS AND BUREAUCRATS ARE NEXT! NO ONE IS ABOVE THE LAW.'","post_message":"***BREAKING***"},{"comment_id":"10155247657250294","commenter_b":"Flush her down the toilet","commenter_a":"So very sad.","post_message":"When she was told she couldn't board the plane, police say a Florida woman did the unthinkable."},{"comment_id":"883740348483208","commenter_b":"Where are you FBI Ophry openly threatening to Murder White's. Do your duty and arrest her. Where did she get all her Million's from. She is a Racist herself.","commenter_a":"You mean all Blacks are full of hate for Whites including you get your facts straight from one generation to the next on and on forever it is taught to HATE all WHITES","post_message":"Do you think Oprah is a bigot?"}]
