[{"comment_id":"10154170958189586","commenter_b":"Ouiii","commenter_a":"@username on dirait misha","post_message":"Wait until you see Rupert's face when he discovers #vegan nachos. All rats should be this happy! #StopAnimalTests #WW4AIL"},{"comment_id":"10154267425314160","commenter_b":"Another nasty woman on the side of evil...GOOD WINS","commenter_a":"and you are Madeline Not So Bright","post_message":"\"There is a great term the Soviets used to use.\""},{"comment_id":"10153720536124087","commenter_b":"@username I bet you're wife is a illegal ass immigrant. Get ready to never see her again once he wins","commenter_a":"Cool. Soon there will be no minorities left for trump to insult. He'll start insulting the lackof intelligence of his supporters.","post_message":"GOP front-runner Donald J. Trump recalls phoning his credit-card company to see if an Indian call center would answer."},{"comment_id":"10152985971730090","commenter_b":"Hillary wouldn't have stayed with bill if he was not president. She lies about every thing . Her lies got 4 good Americans. Killed in Benghazi now she is running for president again. She don't deserve it.","commenter_a":"She didn't do a good job when Bill was in office, what makes you think she could now?","post_message":"Why don't you want Hillary Clinton to be President? @webpagelink"},{"comment_id":"10154992215446729","commenter_b":"Stephanie Hallstrom Hillary is from Chicago.....send her back there. They grew her. They can keep her.","commenter_a":"You can see her jerking several times prior to falling / collapsing. Clearly from a seizure people know the difference. She should stop her thirst for greed and power and live her life and take care of herself in the private sector for herself and the American People. It was not weather people were there saw others in worse health and heavier clothing...she came out wearing same clothes as before. She is not well. Go Home Hillary!!","post_message":"Help get this out there, folks! People need to know the TRUTH."},{"comment_id":"10154704340591509","commenter_b":"Don't feed the troll people.","commenter_a":"Why didn't this man order a bride from Russia, or a number of countries which pimp put their very ready and willing women.","post_message":"\"When I woke up I didn't know that I was in China.\""},{"comment_id":"1183094928399954","commenter_b":"Hate this woman!","commenter_a":"Imagine that.","post_message":""}]
