[{"comment_id":"1692664807687298","commenter_b":"She is evil...completely stupid","commenter_a":"She needs help that was sick","post_message":"This is SICK!   End the Cop-Hate NOW. #AllLivesMatter"},{"comment_id":"1064050356984826","commenter_b":"Karen why do you want a President that would say, \"single payer will never ever come to pass\"? Despite over 58% of Americans supporting it, knowing it will save us money and insure everyone, and that every other industrialized country in the world has had it for years and years. @webpagelink Or someone who corporate lobbysists know will end up supporting the TPP? Do you know what this trade deal would do to my generations future? If you did you would not be voting for her. @webpagelink Please for my future and my generation future vote for Bernie in the primaries. #NoMoreTradeDealsThatSendJobsOverseas #HealthCareForAll #BernieForPresident #NinaTurnerForVP #WarrenForMajorityLeader","commenter_a":"It's Hillary's time! Bernie is good in the Senate.","post_message":"This is it—the Iowa caucus is today! If you’re standing with Hillary, share this."},{"comment_id":"10154129546231545","commenter_b":"Romo a true gentleman and it took alot for him to do that, better to be up and walking than being in sever pain the rest of your life. Thank you for being a model for the younger players! A true Cowboy. ..","commenter_a":"Luckily, he has someone very close by to talk to about the benefits of being a backup QB on a Super Bowl quality team.","post_message":"Today wasn't easy for Tony Romo.  He's not the starting quarterback for the Dallas Cowboys anymore.  But he handled the situation with dignity:"},{"comment_id":"1374679629226158","commenter_b":"No they are NOT normal. Maybe they are from his neck of the world but the Western world not so much. England needs to wise up and get rid of him and the rest of the muslims that are taking the country over before its too late.","commenter_a":"Can't stand this guy what is he doing in US???","post_message":"The new normal."},{"comment_id":"1162468617182722","commenter_b":"The magic number is 2026, half of 4051 . Bernie gets to that number the superdelegates have to support him.","commenter_a":"Bernie could win every state from here on out and Hilary would still be leading in the polls and delegate count. ..","post_message":"Hillary Clinton's margin narrows to just 6 points over rival Bernie Sanders."},{"comment_id":"748124945338392","commenter_b":"Ima start fukin new bitches","commenter_a":"Kisses from Mar del Plata!","post_message":"We're less than 5 days away!"},{"comment_id":"1791155854463672","commenter_b":"We ARE heading to this disaster because we still hold on to capitalism and free market","commenter_a":"Bobby Schar","post_message":"Thanks for that Brian ..."}]
