[{"comment_id":"1644783155547189","commenter_b":"Not busted, she's been padding HER wallet for a L-O-N-G time! You guys are way late to the game..try doing some reading, I knew this, long ago!","commenter_a":"Meanwhile @ Standing Rock! Energy Transfer Partners, WHISPERS TO THE PROTECTORS YOU CANNOT WITHSTAND THE STORM.TULSI GABBARD, US VETERANS AND THE PROTECTORS WHISPER BACK 'WE ARE THE STORM!!!","post_message":"Busted!"},{"comment_id":"10153962696310950","commenter_b":"Seriously?? You are part of the problem! What she is wearing is irrelevant! She shouldn't have to wear a turtleneck to keep creeps from thinking they have free reign. Just because a woman wears sexy clothing it is not an open invitation. You still have to have permission period end of story!!!!","commenter_a":"She needs to get some self-dignity and wear something that covers her breasts.","post_message":"The soap star notably did not mention the GOP candidate in her statement."},{"comment_id":"1847137338904678","commenter_b":"Everywhere these devils go, they rape and murder the rest of the people. Just ask the Native Americans, the Aboriginies of Australia, and the countless number of African countries that still suffer from the effects of all the death and destruction caused by what the devils call imperialism and colonization. The devil who comes disguised as white people is absolutely disagreeable to live with in peace. It's been proven time and time again.","commenter_a":"Didn't take long for the racial comments on a post that has nothing to do with race. You are the people that make today's issues more of an issue than it needs to be. This man is disgusting","post_message":"SHOCKING! A sheriff's deputy is charged after he allegedly posted video of himself performing a sex act with a dog."},{"comment_id":"1385476598133803","commenter_b":"'@username Total dumb ass","commenter_a":"I say that's bullshit, race problem was minimal until we got this racist Muslim traitor idiot in the white house, Obama administration and his friends are the problem with this country now.","post_message":"The majority of Americans say there's still widespread racism against African-Americans in our country. Do you agree or disagree?"},{"comment_id":"10153096349467377","commenter_b":"I agree with Rush. I'm sick of women pushing themselves to the front of every topic. And using their gender to advance themselves. We who have sons and brothers hate to see the way they are pushed to the back of the bus.","commenter_a":"I have listen to Rush for 20 years!! Love him!! I agree with him.. most people who don't like him have never listen to him!! I like Michael Savage to, talk radio is where you find the real news... wake up people we are losing our country!!!!!!","post_message":"Rush Limbaugh says that too many women journalists have led to the 'chickification' of the news — which gives it a female-friendly slant."},{"comment_id":"10153851389446955","commenter_b":"'@username this guy Julio & Cruz are dangerous crazy nuts that do not understand our European culture & they are racist loonies. BUILD the WALL. Go TRUMP 2016. lol","commenter_a":"Little Jebbie & Cruz is a LIAR & I want to watch sue the crap out of him, maybe Cruz can get another Goldman Sachs loan to pay the damages.","post_message":"FRUSTRATED JEB: 'I Should Stop Campaigning Maybe'..."},{"comment_id":"1057489254266735","commenter_b":"Deport all illegals ..............","commenter_a":"The funny thing is that it's NOT about amnesty. It's about getting control of a situation that's currently OUT of control. If we don't move forward with the current plan, than what? Yes folks we are not in the same situation, but a much worse one. SIMPLE! Think about it, they are already currently living here and paying NO taxes. Unless we can beam these people up bye my calculations, YEP, there still here. Let's look back at what was actually said, the President NEVER said he was going to legalize any body's current status, just give them a chance to apply while working on there current status. Is it such a bad idea to have these people come out of the dark?","post_message":"I've been telling people for I don't know how many years, you know it as well as I do that's what this is all about.  But no Democrat's ever admitted it."}]
