[{"comment_id":"1843613252518265","commenter_b":"Squirting and peeing may release the same fluids but the acts are totally different. You would know if you've ever made a woman squirt...","commenter_a":"Think the only people who care are the women who can't squirt and the guys who can't make women squirt","post_message":"Happy Valentine's Day!"},{"comment_id":"1152891968103883","commenter_b":"She is very cute and beautiful little baby but don't present her like,' world's most beautiful girl'. You are ruining her childhood, i guess it's already been ruined but better late than never. Let her live her normal life please. I could see her turn into justin bieber like child in the future. He was no doubt blessed child but what media attention has done to him?? Spoliled him forever. One thing more how can you claim WORLD'S most beautiful child? World means 200 countries and over 7 billion human beings! Have you seen all of them?","commenter_a":"Not being funny but kids are cute not beautiful..that really sounds wrong unless it's you perents saying it.","post_message":"The controversial ten-year-old has been dubbed 'the most beautiful girl in the world'"},{"comment_id":"1080222498699420","commenter_b":"#FuckYouHillary","commenter_a":"This old fool is the one who needs work , Go Home Bernie it's over !","post_message":"The Democratic Party must go on record in opposition to holding a vote on this disastrous, unfettered free-trade agreement during the lame-duck session of Congress and beyond. If both Clinton and I agree that the TPP should not get to the floor of Congress this year, it's hard to understand why an amendment saying so would not be overwhelmingly passed."},{"comment_id":"1832391937045878","commenter_b":"Don't tell Muslim terrors because all Christian terror everyday kill 1000 children in Syria and no body have tell about that..again I said that don't tell Muslim terror","commenter_a":"I would like to hug this peoples","post_message":"BREAKING NEWS: Berlin terror attack... At least 12 dead as truck ploughs into Christmas market  Full story: @webpagelink"},{"comment_id":"10153502951211336","commenter_b":"Anyone who votes for her does not have a brain!","commenter_a":"She will be the next president","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152904733026051","commenter_b":"I would love to get my hands on the bitch who wrote that! I'm very sorry that there are people out there like that.","commenter_a":"Key their car","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"10154469965885579","commenter_b":"Why would that surprise you Mr. Brown, Mr. Trump becoming the next President of The United States is a blessing compared to it almost not being America at all thanks to all the corruption of this Government and the Politicians letting it be taken over my illegals that pretty much rule OUR COUNTRY, PRAY TO THEIR GOD ON THE SOIL FOUGHT MY THE MEN AND WOMEN OF OUR VETERANS AND ACTIVE SERVICEMEN , THAT WE OURSELVES AS AMERICAN CITIZENS ARE DENIED, BURN OUR COUNTRY'S FLAG AND I COULD GO ON AND ON, BUT LETS JUST SAY 'CHANGE IS COMING, THOSE GETTING A FREE RIDE WILL BE OVER, THE RICH GOVERNMENT WILL NO LONGER BE LIVING HIGH ON THE HUG, THE POLITICIANS WILL NO LONGER BE MAKING DIRTY DEALS AND ROBBING THE AMERICAN CITIZENS OF THE HARD EARN MONEY !! Yep he made it this far because he's one of US ...","commenter_a":"I'm seriously embarrassed that this man can make it so far in our country. He takes what class the GOP had and throws it to the wind.","post_message":"Donald J. Trump: 'Tonight we close one chapter in history and we begin another.' Watch complete speech here: @webpagelink"}]
