[{"comment_id":"10154387073057894","commenter_b":"Bitch she would get demoted hard !","commenter_a":"Good! Let Honda go, she has no relevance on the show! @username","post_message":"NeNe Leakes and Kim Zolciak-Biermann in Talks for a FULL-TIME Return to 'The Real Housewives of Atlanta' for Season 10"},{"comment_id":"1101197406562586","commenter_b":"wheredid they dig these women up she does not know what she is doing..she mite as well givr the city to the thugs, disarm the police and go home and take a nap","commenter_a":"Burn it","post_message":"There are people openly worrying if Mosby's case fails, if Baltimore will burn to the ground."},{"comment_id":"1906434399416299","commenter_b":"Imagine something bit u on ur naked body lolzz","commenter_a":"The restaurant name should change to Animals restaurant","post_message":"Owners describe it as an 'orgasmic atmosphere.'"},{"comment_id":"10152721228310047","commenter_b":"This comes from a woman that laughed as she helped a rapist get away with his having raped a young girl... She knew he was guilty, too.","commenter_a":"If all the babies had a right to choose life or death--hmmmmm!","post_message":"Hillary Clinton and the radical Left believe that protecting abortion is even more important than your religious rights. Read & SHARE about attempts to prioritize abortion over First Amendment freedoms."},{"comment_id":"10153599310496037","commenter_b":"I feel sorry for his wife, NO money in the world is worth having to sleep beside that every night.","commenter_a":"Arise Trump Republicans! Demand that all the other lame Republicans running for the GOP nomination quit AND bow down to The Don.. and boycott Fox News.. (^^^) (y)","post_message":"Donald J. Trump, angered by Megyn Kelly's line of questioning during the GOP debate, later told CNN that she had \"blood coming out of her eyes, blood coming out of her wherever.\""},{"comment_id":"1693802114227741","commenter_b":"The towers that Donald Trump built ... Border Patrol endorses you to build that wall too, Mr. Trump ... A BUILDER ... not a destroyer ... of American liberties/freedom FOR POTUS!!! @webpagelink @webpagelink #DONALDTRUMP #POTUS #REPUBLICANPARTY #GOP #2016ELECTION #BORDERWALL #BORDERPATROL #TRUMPTOWERS #PRESIDENTIALPRIMARIES #VOTETRUMP #TRUMPTRAIN #MAKEAMERICAGREATAGAIN","commenter_a":"We have said that for years,They dont need us to protect them anymore.If they do,they pay for it.","post_message":"Changing times call for changing perspectives. I am proud to have started this conversation."},{"comment_id":"10152911365806336","commenter_b":"That's NOT truth.....","commenter_a":"Open carry does not apply to black men.. No one wants to admit it, but it's the truth..","post_message":"A Florida man thought he was acting heroically for tackling a man with a gun at Walmart. Instead, the vigilante ended up in handcuffs."}]
