[{"comment_id":"10154490507826051","commenter_b":"Absolutely NOT! Lying Ghetto trash Marxists.","commenter_a":"Absolutely did not he's a Muslim has no class.","post_message":"Yes or no: Did the Obamas represent America with class and dignity?"},{"comment_id":"10155092552983797","commenter_b":"I'd rather have all those than Depression :D Wait, you said, \"CORRECTion\"... how do we even know the Bible is correct? Bible stated Jesus is white.. we know that's false. He's Black. The Bible is a contradiction to other verses and such.","commenter_a":"Really??? Lol! Side effects for birth control for women- Intermenstrual spotting. ... Nausea. ... Breast tenderness. ... Headaches. ... Weight gain. ... Mood changes. ... Missed periods. ... Decreased libido. And thats just the 10 common side effects.","post_message":"The shot seemed to be as effective as other forms of contraception, but the men complained of side effects like acne and mood swings..."},{"comment_id":"1124028447686512","commenter_b":"YES She will Win No he will Not be elected. We The People need Bernie Sanders and Elizabeth Warren in The Senate to Protect the Environment The Economy and raise a little hell with Corporate Greed and Global Poverty; End Hunger for Kids, Homelessness and Gun Violence.Heathcare Education and Social Justice For All; VOTE !","commenter_a":"Hillary won nothing I'm voting for Trump","post_message":"TELL US YOUR THOUGHTS! FOLLOW US at Reverb Press and Stories That Resonate <<<"},{"comment_id":"10152816643679877","commenter_b":"She don't need to she's not Muslim","commenter_a":"They would criticize her either way. If she wore it, they would be hollering about how she supports terrorists, then the ignorant right wing tea party types would link it to Obama being a Muslim.","post_message":"Oh boy, they're coming for Michelle Obama for not wearing a headscarf in Saudi Arabia. Read more about her critics below. Grio fam, this seems foul to us. What do you think?"},{"comment_id":"10152948975362434","commenter_b":"SHUT UP BITCH","commenter_a":"Oh I think I don't need to post my thoughts as just the last two comments from Shoshana and Kelly do it for me. But - who the hell does she think she is anyway?","post_message":"Of course she is."},{"comment_id":"10153846244313984","commenter_b":"Dumb bitch","commenter_a":"Well said Rubio!","post_message":"WOW. Out of all the things she could have been doing, or should have been doing - THIS is what she chooses. It's pretty unreal to think that some people actually want her to become the next POTUS... Do you think it's time for Hillary Clinton to drop out of the 2016 presidential race?"},{"comment_id":"946602502043757","commenter_b":"She is not presidential material!!!","commenter_a":"This is one shady lady.","post_message":"\"But we also are extremely troubled by the events...\""}]
