[{"comment_id":"10153363200377452","commenter_b":"Praying for the family, so heartbreaking.","commenter_a":"So sorry can't imagine the pain their families","post_message":"HEARTBREAKING: Just a few months after his sister died from leukemia, a distraught teen was struck and killed while riding his bike by a hit-and-run driver."},{"comment_id":"10156358978545354","commenter_b":"For the record, can't stand the women of the View.","commenter_a":"Too bad she wasn't this sharp in her failed tenures at Lucent and Hewlitt-Packard. She has the nerve to keep getting mileage out of Trump's remarks about her looks. Google 'Fiorina Gaffe'. If the media hadn't kept that video 'under wraps' while at the same time raking Trump over the coals for his remark, the whole flap about her face would have been a 'non' issue. She also left her campaign for Senator 5 million in debt and her staffers high and dry. Do your research before throwing support behind her.","post_message":"WATCH Carly run circles around the ladies of 'The View.' Epic!"},{"comment_id":"665234353646282","commenter_b":"Can't make a silk purse out of a sow's ear.","commenter_a":"#klasssa 👌","post_message":"Do you think the Obamas represented America with class as our nation's First Family?"},{"comment_id":"1058553324165678","commenter_b":"That's it women take everything, soon they'll be complaining about not competing against men in the olympics, #equalityformen","commenter_a":"Yea thats cute... but look at developers these days... 99% are men. you wouldnt be on facebook talking crap right now without men.","post_message":"Margaret Hamilton was the lead flight software designer for Project Apollo. Just 31 when it landed on the moon, and her code has been credited for preventing an abort of the mission.  #womenyoushouldhaveheardof"},{"comment_id":"1477131165645723","commenter_b":"She is a phony douche like her old man.","commenter_a":"Lying runs in the family!!!!","post_message":"Of course it is..."},{"comment_id":"10153148530580329","commenter_b":"It's not a fuckbuddy it's a weak ass pussy who ain't bout shit","commenter_a":"What is a f*ckboy? I must be getting old...","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154323426879778","commenter_b":"Sad!! Rip LP","commenter_a":"Prayers to the family.","post_message":"The 80-year-old may have been found dead, police said Monday."}]
