[{"comment_id":"1233646523418790","commenter_b":"The filthy parasites must get the fuck out of the US","commenter_a":"Both my Great Grandparents immigrated , assimilated, learned English, no gov assistance, raised big families and loved this country for the opportunities & freedom it afforded them. We deserve the right to help those who earn the right to be Americans , but not those who come to take, hate, criticize and try to change America to suit their needs. JFK had it right .. \"ask not what your country can do for , but what you can do for your country \". Our Vets need first consideration when we spend our tax money... ! It's about time to help those who honor this country !","post_message":"Just when you think Trump can't do any better he implements policy like this one that puts AMERICANS FIRST! SHARE & LIKE if you think immigrants should never receive welfare! @webpagelink"},{"comment_id":"818563178203701","commenter_b":"For what? Please elaborate...","commenter_a":"Impeachment now","post_message":"Before we voted to defund President Obama's unconstitutional actions on immigration, Speaker Boehner read 22 direct quotes where President Obama argued, in his own words, that he couldn't act alone on immigration. Here are the quotes: March 31, 2008: “I take the Constitution very seriously. The biggest problems that we’re facing right now have to do with [the president] trying to … not go through Congress at all. And that’s what I intend to reverse when I’m President...” May 19, 2008: “I believe in the Constitution and I will obey the Constitution of the United States.” May 5, 2010: “Anybody who tells you … that I can wave a magic wand and make it happen hasn't been paying attention to how this town works.” July 1, 2010: “[T]here are those … who have argued passionately that we should … at least ignore the laws on the books... I believe such ..."},{"comment_id":"1241458632577946","commenter_b":"@username I speak the same to everyone. But no one slaps me. And a pussy like you certainly wouldnt be the one to slap me. But as I stated in the original post. Plant some fucking trees if you don't like it.","commenter_a":"Yea and collapse the economy in less than 2 years. Get educated dumb ass. If you care for trees so fucking much then get the fuck off of Facebook and go plant some trees.","post_message":""},{"comment_id":"1178752805478081","commenter_b":"Sick the American get off this privacy","commenter_a":"If someone comes to my door wearing that outfit,I will personally egg them.......","post_message":"It's nowhere near October, but one ensemble is already on track to be named the most controversial Halloween costume of 2015."},{"comment_id":"712619718886803","commenter_b":"At the risk of repeating myself, J. McCain turn your back on this blight you call a presidential candidate! You do a disservice to your party, your constituents, your military compatriots and most importantly your moral compass which should be leading you away from rather than to Trump.","commenter_a":"Trup will be lopplllllppp Cidgbelillnnrvrubrg","post_message":"He's mad as hell but is he gonna take it any more? -- Paddy"},{"comment_id":"10154984225302300","commenter_b":"Dee you are what's wrong with white people...","commenter_a":"Those darn white people attacking blacks.. oh wait.. this was black on black crime. Guess there won't be any riots over it.","post_message":"UPDATED: Eight people now confirmed shot Monday afternoon during a Martin Luther King Jr. celebration at a Northwest Miami-Dade Park, according to police."},{"comment_id":"10153283124151316","commenter_b":"Blackie Chan where does a gorilla get his protein? The gorilla does not eat any meat, This beast can throw a 200lb man across the street with one arm....maybe dark greens.....","commenter_a":"What's your protein source?","post_message":"Man says raw food diet has made him 'almost superhuman'... @webpagelink"}]
