[{"comment_id":"1068743996585956","commenter_b":"No deport non americans and those who wish to leave..escort them to Mexico..let themtry their bullshit with them..see how far they get..I am fed up with the demorats/libtards!","commenter_a":"No","post_message":""},{"comment_id":"10153140992043645","commenter_b":"If this a show of 'real women' will they also let the hair on their legs grow??","commenter_a":"Sick.","post_message":"On a less serious note,... Armpit hair is a growing trend for women. Will you participate? Or heck no !?"},{"comment_id":"581181075381182","commenter_b":"@username Many are 'insured' but access to care is more expensive than ever when you add copay, deductible, out of pocket, and actual cost of premium. These \"facts\" are manipulated to make the ACA look \"good\". In reality it is a tax, as defined by our own government.","commenter_a":"\"We’re forcing the president to confront the failures of this law once and for all\" - Speaker Paul Ryan","post_message":"Republicans in Congress used reconciliation to be able to get the Restoring Americans' Healthcare Freedom Reconciliation Act to the president."},{"comment_id":"10153043792241680","commenter_b":"Hillary Clinton 2016!!","commenter_a":"Maybe it's his fault...no cant be.","post_message":"He says it would be \"an unforced error\" if Republicans let the government shut down."},{"comment_id":"1329814237089560","commenter_b":"These seem so handy","commenter_a":"This feels like a Savannah thing.","post_message":"If there's one thing we can all agree on, it's that tying shoelaces is the worst: @webpagelink"},{"comment_id":"10153406065866800","commenter_b":"Already happened. That's the point.","commenter_a":"Wow, ok. So it's ok for a black person. To be racist, but if a white comedian made any of these jokes in reverse he'd be chased off the stage by pitchforks. Really guys? It goes both ways.","post_message":"\"For some reason black people need a white person to get their message out. I'm going to make this work for me, I'm going to hire a helper whitey.\" -- Jessica Williams"},{"comment_id":"10153956285791880","commenter_b":"@username I'm white. I'm not mad bro. But was that kid in Ferguson mo a thug and literally just robbed. Convenience store? Sure back lives matter.. I'm indifferent tho.. Any race, sex or creed comes at me Wrong I'll end you. Period.","commenter_a":"All the white ppl mad!! Lmao, after the 400+yrs of oppression that they weren't victims of, they want to be included in a black lives matter movement... Smh, never been discriminated against, but black lives matter is a racist cult?? Can't c the forest from the trees...","post_message":"The Facebook CEO issued a companywide memo chastising employees who have been crossing out the phrase “black lives matter” and writing “all lives matter.”"}]
