[{"comment_id":"10154637857483188","commenter_b":"He's been doing that since way before anybody else","commenter_a":"When are you going to report on Hillarys emails? Speeches? Ties with foreign governments?","post_message":"Tough situation."},{"comment_id":"928788953880826","commenter_b":"What a dumb bitch","commenter_a":"One less cracker...","post_message":"Because death is better than letting two people celebrate their love for each other."},{"comment_id":"10153653127786336","commenter_b":"Obama should be deported with all of the illegals...","commenter_a":"make me sick","post_message":"\"The Obama administration is very friendly to individuals who are transgendered who are illegal immigrants. They provide them taxpayer-funded hormone treatments [and] special accommodations.\" – Tom Fitton, president of Judicial Watch, Inc."},{"comment_id":"10152810357076130","commenter_b":"Dike supporter? Leave the USA then","commenter_a":"Too bad they can't be fired for being worthless POS's and I'm talking about the people the staffers work for","post_message":"Under current House rules, congressional staffers can legally be fired for their sexual orientation, gender identity or gender expression."},{"comment_id":"10153337726654726","commenter_b":"IF she had ANY self respect, she would NOT be making a fool of herself and making up LIES for obaloser and the rest of the liars!!!","commenter_a":"It disappeared. Hmmm...","post_message":"WATCH: State Department spokeswoman is laughed at while trying to give Obama credit!"},{"comment_id":"10153470149826234","commenter_b":"By a lot !!","commenter_a":"Amy check out HR. Looks like you got low balled","post_message":"Nice work, if you can get it."},{"comment_id":"663264380530807","commenter_b":"Yes! Disgusting!! Vulgar!!","commenter_a":"Yes,don't wish to see their underwear or ''butts''.keep them covered","post_message":"These thugs were arrested after refusing to pull up their pants.  Hilarious. Let's make this a law, who agrees?  Should excessive sagging be illegal?"}]
