[{"comment_id":"10155880374735354","commenter_b":"It sickens me to know that we let Muslim terrorist cowards like that stay in this country under the protection of religious freedom while we tell the Marines and the rest of the armed forces that we don't trust them enough to have a weapon around a civilian population. Ship those goat fuckers out and give our boys some firepower.","commenter_a":"I will always honor them and all that do sooo much to feel us free God Bless","post_message":"Know Their Names, Honor Their Lives. Semper Fi."},{"comment_id":"10153639899983132","commenter_b":"She didnt make the show! Nene thought the show revolved around her, she cant handle the truth!","commenter_a":"Well that show won't last without her, I will not watch anymore.","post_message":"EXCLUSIVE: NENE LEAKES is leaving the Real Housewives of Atlanta but teases an exciting new project: \"I'm actually going to be doing a new primetime television show with a big legend.\" @webpagelink"},{"comment_id":"1049253181797877","commenter_b":"So HRC YOU WILL NEVER WIN CALIFORNIA @webpagelink","commenter_a":"Hillary,we want you back at the White House!!","post_message":""},{"comment_id":"10154566967589369","commenter_b":"She should have got the 11 yrs!","commenter_a":"5 years? That's it? Someone please give her real sentence when she gets to prison.","post_message":"Lethal doses of heroin and fentanyl were found in the body of 14-month-old Annabella Sagstetter last May."},{"comment_id":"1401866033180478","commenter_b":"Well said!","commenter_a":"Only took mass shootings for something to be done! Stop illegal aliens from getting jobs here, no papers=no jobs or sending our money to help other countries when we have plenty of homelessness & poverty here in our own country. Fix this country first b4 you try to fix others.. Children here need help just like across the world, we have Veteran's dieing & sleeping on streets, starving people & animals everywhere. And the only way something is ever done is when there's some sorta tragedy. The whole state (country) is in need of change. We need to correct us b4 we try to help others.","post_message":"WATCH LIVE: Gov. Rick Scott is in Orlando giving a briefing on the Florida Department of Law Enforcement's counterterrorism efforts. Gov. Scott wants to spend $6 million to increase the number of agents dedicated to fighting terror: on.wtsp.com/2j4OSzV"},{"comment_id":"858528920935448","commenter_b":"Sarah Dingle, how do you (or any Arabs or Muslims) have the courage to speak of apartheid when ISLAMIC COUNTRIES ARE WELL-KNOWN FOR THEIR GENDER-SEGREGATED SOCIEITES? That really laughable!","commenter_a":"If any Country refuses to compete in a friendly or qualifying tournament or bans others for racial reasons. They should be banned from all worldwide competitions! This is 2015!! Time to stop the hate against Israel!!","post_message":"Israel judokas were not allowed to compete in Abu Dhabi with the Israel flag on their judo uniform."},{"comment_id":"10153633238805575","commenter_b":"Get those monsters outta here!","commenter_a":"Oh who did not see this coming? Remember in Greece all the guns that were found? This is not refugees this is trying to take over send them back!!!","post_message":"This is frightening."}]
