[{"comment_id":"1731115690475220","commenter_b":"She should just go NOW!!!","commenter_a":"Another nut.","post_message":"Barbara Streissand says she's joining Al Sharpton and leaving the country if Donald Trump becomes president. Would you miss them?"},{"comment_id":"10152570108341770","commenter_b":"She's not upset about the coat, it's that her father is a turd and her mother is a pig.","commenter_a":"I guess so","post_message":"What do you expect when you dress your toddler in a $3,500 fur coat, Kim Kardashian?"},{"comment_id":"1002765619855375","commenter_b":"She's not that classy oh wait well anyways lmfao whatever get off the trip people smh","commenter_a":"I think it's funny how she's trying to show 'modesty' When we've all seen her naked already. Lmao","post_message":"Social media thinks Melania is channeling Jackie O this morning. Your thoughts? @webpagelink"},{"comment_id":"10153640663754205","commenter_b":"#LetThemEatTrump #FuckTheDNC","commenter_a":"Hillary will have us in a war with Iran. We need to avoid Hillary at all cost.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1272259289466246","commenter_b":"'@username, go ride your tricycle on the freeway!","commenter_a":"Funny you take this seriously. Simultaneously dismissing ISIS. REALLY shows your common sense level.","post_message":"Thank you, sir."},{"comment_id":"10153532462028352","commenter_b":"And nobody in those stores were killed btw","commenter_a":"Use your brains people, this story isn't getting plastered all over the news because she's a good mother,AMERICA GETS OFF ON SEEING BLACK MEN GETTING ATTACKED.. And this is a perfect way to hide behind the actions of his mother. They love seeing black men being put in 'check' and being demeaned in public....AND Have you ever seen a black mother hit her son for enlisting in the military to fight some people that has no effect on the oppression of blacks in America ?","post_message":"‘I didn’t want him to be another Freddie Gray': America’s favorite mom speaks out after smacking masked son and dragging him from riot"},{"comment_id":"1056254801076607","commenter_b":"That's funny but I don't think you could trust Rubio on the border. He's too in to amnesty and letting illegals in.","commenter_a":"Won't it be great when Trump is President , and Rubio is reassigned to mixing cement on the Mexican border ?","post_message":"BOOM!!!"}]
