[{"comment_id":"10153265527170950","commenter_b":"Oh stfu","commenter_a":"The blood is on their hands. This is a typical reaction from a Liberal Democrat.. Like a small child they point the blame on some one or something else.. The Democrats have made California a safe haven for Illegals, Criminals and Terrorist with their Sanctuary and open border polices.. The Blood is on your hands Moon-beam.. You and your Lawless Democrats. @webpagelink","post_message":"'Increased surveillance, creating relationships with mosques in the Muslim American community across the country. We did that after 9/11 and prevented attacks in New Jersey and all across the country.'"},{"comment_id":"1025607307502400","commenter_b":"'@username do you not understand what rape is? Many women are unintentionally impregnated by a RAPIST. Involuntarily having sex is what rape is, if you didn't catch that. A women's should be able to choose if she wants to have an abortion, with advanced technology we can safely perform these procedures. Abortion is NOT A contraceptive, it is a last resort and if you wanna take the baby and provide for it along with the thousands of other rape victim babies then go ahead.","commenter_a":"Look I'm not all for abortion, nor all against it, let me just say my peace like everyone else has, and that we are all entitled to.. A females choice about her body, is exactly that, her choice. I'm not saying abortion ahould be used for a form of BC or a contraception, there are other ways, educate your children, its not just the girls in this that need it. All children need to be educated. But lets get surreal, how or what do u know about that female walking in to planned parenthood, little to nothing about her story. How do u know she didn't get raped, or isn't going thru some kind of abuse (whether it be physical or emotional) u don't know. We cannot judge people, who gives another that right, and all I have to say is those doing the judging I hope to hell u ...","post_message":"Hillary's Hypocrisy is Astounding www.eaglerising.com"},{"comment_id":"10152583869080779","commenter_b":"Dig this ditch. Now fill it back in. We'll print some money and pay you with it. Now bread is more expensive for everyone. Brilliant. The New Deal kept my grandfather a hungry child.","commenter_a":"Does Bob Dylan not remember the US government creating the Works Progress Administration (WPA), Federal Project Number One, or the Civilian Conservation Corps? Which created jobs for millions of unemployed Americans? The New Deal? FDR? No?","post_message":"Bob Dylan has a solution for unemployment: Let the billionaires step up. 'The government's not going to create jobs. People have to create jobs, and these big billionaires are the ones who can do it,” he says."},{"comment_id":"10150870773554999","commenter_b":"'@username. And you vote for a killer and a rapist!","commenter_a":"It's become pure entertainment. At this point he's a side show. His numbers are falling. His lies are outright ridiculous. Enjoy that long, long vacation.","post_message":"Donald J. Trump is sticking to his style, even if it meant taking 'a very, very nice long vacation' after Nov. 8."},{"comment_id":"10154064678631336","commenter_b":"'@username I won't vote for trump ! I will support the other republicans !","commenter_a":"Donald Trump understands better than anyone why the country is so much in decline. He understands how our politicians have sold us down the river with trade deals that benefits other countries and lines the pockets of foreign lobbyists who give away our wealth and jobs for their own gain. This is why the Establishment hates and fears Trump so much. Our country is 20 trillion dollars in debt because of all the corruption by both sides that are owned by the same people. Trump understands that if we do not get a wall on the border we will lose the country. Because all of the over 12 million illegals in this country are going to vote DEMOCRAT once some RINO or liberal gets into office and gives them Amnesty- THAT will mean the extinction of the Republican party and we will become a third world socialist nation. The Establishment ...","post_message":"“The lessons of 9/11 are being forgotten by a lot of people. And that is: A human condition elsewhere matters to our national security.”  Do you agree with former President George W. Bush? @webpagelink"},{"comment_id":"10154385047759714","commenter_b":"Mmm seems she has friends in high place above the law she is!","commenter_a":"RIP America....","post_message":"1916: The first woman is elected to Congress.  2016: The first woman wins the Democratic race for president. #Election2016 @webpagelink"},{"comment_id":"10156137722715093","commenter_b":"(If we support refugees by letting them into our country ISIS wins.","commenter_a":"And if we accept Syrian refugees without adequate screening America loses.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
