[{"comment_id":"10153837326772293","commenter_b":"To know how irresponsible and corrupt a candidate is, is worthy to know. Even the main stream news, democrats and the I.A report denouncing Hillary of improper acts in office is added to her bungling of Libya and other important areas. You can't make this up. I'm sure if even convicted of treason her stiff supporters would kiss her ring before she flew away on her broom.","commenter_a":"Thanks for that pearl of wisdom Newt. While you were trying to impeach President Clinton, you and Hyde, Livingston were having affairs of you own..hypocrisy much!!","post_message":"“Part of it is, he’s just trying to throw stuff in the air and keep her rattled,” Newt Gingrich said."},{"comment_id":"1214194218600606","commenter_b":"Coming from a HoeAssNigga","commenter_a":"Is it a horrible thing that Rihanna is a hoe.","post_message":"\"Is it such a horrible thing that she pretended to be black?\" Rihanna said"},{"comment_id":"10153910838991336","commenter_b":"And slap her face!","commenter_a":"Bless her heart...","post_message":"Carly Fiorina says tech companies need to be asked “to bring the best and brightest, the most recent technology to the table.” #GOPDebate"},{"comment_id":"10154382417947293","commenter_b":"Meanwhile Russia is laughing so hard all the way to the bank. Hope everyone who helped put this unstable Trump into this position will enjoy learning their new language of Russian cause now Russia owns us.","commenter_a":"Infighting violence much Washington post?????","post_message":"2016 might really be our own 1914."},{"comment_id":"10153088515381336","commenter_b":"Withdraw so we can finance the terrorist to attack isis....","commenter_a":"Oh, the ones he referred to as JV?","post_message":"President Obama is expected to announce in the coming days a modified plan on U.S. troop withdrawal in Afghanistan to help the country’s new government fight the Taliban and other emerging insurgent groups."},{"comment_id":"1004203859620086","commenter_b":"Awful woman !!!","commenter_a":"I don't want to see this face in my newsfeed.","post_message":"Leave it to Michele Bachmann to exploit a tragedy to take a swing at President Obama"},{"comment_id":"1132646906806453","commenter_b":"That hoe lowkey clean 😂","commenter_a":"Alexis Herrera Heberth Perez Johan Ramirez Luis Olmos Epi Benitez @username bet I won't 😂","post_message":"Too much sauce"}]
