[{"comment_id":"775380562560552","commenter_b":"Your a stupid bitch","commenter_a":"This is the best show on TV. I won't be watching TLC if this is true. We can forgive things stars, football players, and men in charge of our country, but we can't forgive something a 12-year-old boy did. Standing behind the Duggars and praying for them.","post_message":"\"19 Kids and Counting\" has been canceled after Josh Duggar's shocking confession."},{"comment_id":"1378443058862829","commenter_b":"SHES WAVING TO THE CROWD YOU ASSHOLES..","commenter_a":"Conservatives suck","post_message":"Wait till you see what she appears to be saluting."},{"comment_id":"1170571449649992","commenter_b":"A lot of dumb chicks out there..","commenter_a":"Love it!!!","post_message":""},{"comment_id":"10153058052287452","commenter_b":"Scum bags","commenter_a":"Trump be like \" bet they were Mexicans \"","post_message":"Gone in 90 seconds!   A burglary crew crashes an SUV right into a clothing store and dashes off with thousands of dollars in merchandise.  Not even steel security gates could stop this crew. Tonight, the hunt to catch the cunning crooks who knew exactly which designer threads to grab. Tonight at 11 from ABC7 Eyewitness News. abc7.la/1FenO5y"},{"comment_id":"1154229454616510","commenter_b":"Our family women don't fit in that poll.","commenter_a":"Someone is getting the wrong polls . I will only vote Trump . #He gets us","post_message":"2/3 of Women Hold UNFAVORABLE Opinion of TRUMP.  One of his senior advisors says not to worry...  details: @webpagelink"},{"comment_id":"1547140315578990","commenter_b":"She a piece of crap","commenter_a":"Sheboon","post_message":"Michelle Obama proudly stands by the work she's done to get healthier lunches in public schools. Do you support or oppose the First Lady's efforts?"},{"comment_id":"1003201996389936","commenter_b":"Melissa Missael","commenter_a":"Merly Vivanco Albert Perez what a joke Ben Carson is. Lol.","post_message":"This one is for those who ever doubted Trevor Noah's ability to fill Jon Stewart's shoes."}]
