[{"comment_id":"460063127508901","commenter_b":"I bet the GOP hate her since she actually has a heart.","commenter_a":"Well said","post_message":"Wow is right."},{"comment_id":"10153191536946051","commenter_b":"I was thinking of eradication of the scum and I don't care what color they are!","commenter_a":"Doesn't matter what nationality, they need there legs broken, if that was my daughter?","post_message":"This teen was at the gas station with her boyfriend when a group approached them."},{"comment_id":"587779548050076","commenter_b":"NO NO NO NO NO !!! AND HELL NO! Keep them out and send all illegals back!!!!!","commenter_a":"Hell no","post_message":"I'm thinking ... uh ... duh. But then again, we have the SFB Liberals who see 'no wrong' in Sharia. Vote in our CLASH Poll and let the US know how u feel. @webpagelink"},{"comment_id":"10154335098801002","commenter_b":"Amy... are you serious?!?! IQ test?!? A lot of criminals have high IQ's when tested! It has NOTHING AT ALL TO DO WITH IQ! It has EVERYTHING to do with COMMONSENSE!!","commenter_a":"Why is she being charged it was completely the guns fault lol","post_message":"CHARGES: A woman who fired her gun at suspected shoplifters in a Home Depot parking lot has been charged."},{"comment_id":"539553339568579","commenter_b":"Yes. Send them home. They CANT Obey Our laws","commenter_a":"To Syria, no return ever!!","post_message":"Furious Muslim students rush stage during American Sniper showing. They have no respect. If they don't like American Sniper they can leave. Do you agree these Muslims are out of line?"},{"comment_id":"10153078064342994","commenter_b":"we're on that list so maybe. I NEED TO FLUSH SOME ICE","commenter_a":"Alexis Nichole Fortune hoping we close. 😩","post_message":"Our site has the complete list of school closings. Stay warm out there!"},{"comment_id":"10152860079081130","commenter_b":"Her fat neck though!!","commenter_a":"His hair looks like an old lady! This kid has serious issues!","post_message":"Ellen and the Biebs are at it again."}]
