[{"comment_id":"10153174163477452","commenter_b":"he better not get fired. @username","commenter_a":"GET SOME!!!!","post_message":"Big Mac attack!   A McDonald's worker wasn't \"Lovin' it\" when an irate and apparently drunken customer launched into a vicious attack at the drive-thru window. But the worker wasn't going down without a fight. abc7.la/1KYEgIq  It's just the latest case of a service worker attacked on the job."},{"comment_id":"10154019133956045","commenter_b":"Ronald Collier","commenter_a":"They could have let this woman get a ride home,,, or even took her home.. she wasn't on the road at the time.. where is the love in this world? I bet she was writing an unbiased story about the council meeting discussions..","post_message":"A Franklin County teacher has been arrested while working at a second job."},{"comment_id":"828484970520259","commenter_b":"What a stupid cow.","commenter_a":"A new low for commiecrats? Not so! The depths of their depravity know no bounds.","post_message":"A perfect example of the difference between Democrats and Republicans.  This is how they treat allies:"},{"comment_id":"10153268633329197","commenter_b":"They are all dangerous!","commenter_a":"She was a nurse and still went tanning? I'm confused. Surely she knew it was bad","post_message":"This Alabama nurse was an avid user of tanning beds, sometimes going 5 times a week! Now, she has developed skin cancer and she wants to help stop others from getting the disease. See the graphic way she shared her story --->  @webpagelink (WARNING: this story contains graphic content)"},{"comment_id":"10153638763994342","commenter_b":"@username he's not interested in your girlfriend","commenter_a":"Breaking: Lavoy Finicum, Marine, Rancher, father, and grandfather will be laid to rest today. He loved God, the constitution, The United States of America, and his family.","post_message":"Police say the local rapper was shot four times. He is expected to survive. #abc13"},{"comment_id":"909813239056017","commenter_b":"And ya wonder why his kids are so messed up...duh. apple doesn't fall far from the tree.","commenter_a":"Who cares, ?","post_message":"\"I'm so happy after such a long struggle to be living my true self.\""},{"comment_id":"10153941813117042","commenter_b":"Cuz is not her child . evil face.","commenter_a":"My child is 8 n very timid n shy. The minute i find out some one hurt her in any way. God help them cause ima go after them.","post_message":"A day care director was caught on video hitting a child with toys. But then it gets even more disturbing from there.   Warning: Police described the video as difficult to watch."}]
