[{"comment_id":"10154034067333701","commenter_b":"Is that a dude in drag? Or a real girl","commenter_a":"It is a bad eyebrow day.","post_message":"Court documents showed Perry had at least 15 prior criminal convictions, including five felonies and driving violations, along with a felony warrant for ID theft, methamphetamine possession and providing false information to police."},{"comment_id":"10154517651704166","commenter_b":"Ash, Nc","commenter_a":"Hi from","post_message":"Mother of son hit with books at school speaks out"},{"comment_id":"10153977079018717","commenter_b":"@username i agree there certainly is an issue which needs to be on a high priority list.","commenter_a":"Come on everyone!! Cut the crap!! Humans lives matter!! Nuff said.","post_message":"The owners thought it was a good idea at the time, but a slogan for a restuarant menu item has turned into a controversy!"},{"comment_id":"992371087511918","commenter_b":"So she is only part Native American because you think they must have been raped? Um.. I am part Native American because my great grandmother was savagely raped by a Native American, so please tell me how innocent and peaceful they were. And yes illegals now are a different story. Whether you like it or not, when Europeans came here it was a hostile takeover. There was a war. Which the Native Americans lost. So if illegals want to wage war, than they can bring it on. If not, they can go the he'll home to whatever country they came from. I honestly don't care which country it is.","commenter_a":"If Native Americans had @username \"Illegal European scumbags have yet again raided local villages, they crashed their boats into our shores, raped our women and children and then killed them for not turning into Christianity..\" #Talk about several overdue sentences","post_message":"Margarito Quintero didn’t have a license and was in the United States illegally. He was previously arrested and deported in 2008."},{"comment_id":"10155151298004170","commenter_b":"@username And what disappointed me the most was our President never called for people to work together and come together as a Nation. It was like he wanted the divide! So sad for this nation!!","commenter_a":"I figured this out after his first term. If you believe the media, he did a great job. The numbers don't lie. He did zero except stir up racial divide. That is his legacy.","post_message":"Years in office: Eight. Years with GDP growth of 3 percent or better: Zero. The final report on 2016 seals his fate as a historic failure."},{"comment_id":"2027615577464102","commenter_b":"@username you didn't even spell her first name right!","commenter_a":"Ivanka Trump would be the perfect #FirstDaughter! She spoke with grace and dignity about our future President of the United States! #Trump2016🇺🇸🇺🇸🇺🇸","post_message":"Ivanka Trump spoke in support of Donald J. Trump at the Republican National Convention, saying \"no one has more faith in the American people than my father.\""},{"comment_id":"10154322509929087","commenter_b":"Truth Hurts huh you little bitch? go whine and cry somewhere else. you sound like a little girl.. Here I'll give you your wubby","commenter_a":"This is the death of the Republican Party written as a victory. The backlash will be fierce and overwhelming if Trump behaves in office as if he has a mandate.","post_message":"#BREAKING: Hillary Clinton 's popular vote lead over Donald J. Trump is now over 2.3 million or 48.1 percent of the vote."}]
