[{"comment_id":"685160418299400","commenter_b":"He going to build a wall!!!!! What an asshole","commenter_a":"Oh, Jennifer....I LOVE your post....thank you....you just made my day....","post_message":"Oh this is precious."},{"comment_id":"10155791972890725","commenter_b":"STFU","commenter_a":"and a lot of people blame the police in one out of five hundred killings. what happen to hope and change under obama?","post_message":"Police say the victim, identified as Vonzell Banks, was likely not the intended target ----> @webpagelink"},{"comment_id":"10152856815999753","commenter_b":"Lol. A lot of people. A perk of being a sociopath is the ability to manipulate people like butter. She's mentally unstable. The worst they do is put her in a padded room until they believe her meds and treatment are good enough to let her back out in society.","commenter_a":"Smfh.. Good! Let's see who she can manipulate like that behind bars!!! R.I.P.","post_message":"Michelle Carter said all the right things when her friend Conrad committed suicide. She even organized a fundraiser in the teen's name. Then police discovered the texts she had sent him."},{"comment_id":"10153957571836336","commenter_b":"yep video that thieving skank so the whole world and any future possible employers can see that she is a totally untrustworthy pos","commenter_a":"hope she goes to prison!","post_message":"\"We got you on camera yesterday at Ralph's for $200, so just know that the cops are coming up here,\" Juana Martinez told the 19-year-old worker."},{"comment_id":"937512336383801","commenter_b":"What goes around comes around ppl remember that !! They will get theres !","commenter_a":"If I find out you were ask and turned them down I wiil. O longer listen to your music. Bon Joni is off my list. Even Adele since she supported Hillary.","post_message":"Seriously?!"},{"comment_id":"10154801850791509","commenter_b":"Probably all the women appearing on TV to tout his brilliance.","commenter_a":"If relationships toward women was a deciding factor than Bill Clinton never would have been president. Bill had several women accused Bill Clinton of sexual attacks. How many women have accused Trump?","post_message":"Republican National Committee Chairman Reince Priebus says Donald J. Trump \"is going to have to answer for\" his behavior around women — but also says Trump's presidential campaign isn't being judged based on his personal life."},{"comment_id":"10153738419359062","commenter_b":"How about we stop the meth, heroine and cocaine on the streets?","commenter_a":"There's go's the neighborhood","post_message":"Not just limes in the back of this truck!"}]
