[{"comment_id":"10153541850619712","commenter_b":"It's Bush's fault, and you're a Racist. Let's audit the EBT accounts of people to ensure that they are not out selling 2 for 1 groceries, to get their Malt Liquor and Newport's. There is no Free Ride, you Generational Welfare Leeches. Some people shouldn't Breed!","commenter_a":"that what they do","post_message":"Despite calls for his ouster after making controversial comments about lead poisoning, Gov. Larry Hogan's housing secretary will keep his job."},{"comment_id":"549294818565391","commenter_b":"Its not a womans choice to kill an unborn child if you dont want a child dont have sex its that simple","commenter_a":"It's each woman's choice.","post_message":"Today marks the 43rd anniversary of the Supreme Court's decision in Roe v. Wade. On this somber day, I know it's difficult not to be discouraged that the Supreme Court's decision in Roe still stands. But now is not the time to give up. We must work together to continue promoting a culture of life in Arkansas and America. Read more:"},{"comment_id":"10154292908136545","commenter_b":"That claim was bogus. She was an angry girl out to get him. There was supposedly proof of that.","commenter_a":"Seriously??!!! Pray he's ok. He needs to be in protective custody until game time","post_message":"JUST IN: Frisco police confirm Ezekiel Elliott was involved in a minor car crash near #Cowboys practice facility. No injuries were reported.   MORE: @webpagelink"},{"comment_id":"10154740685431337","commenter_b":"Hillary is the whore of Islam.","commenter_a":"If Hillary is elected president, Putin said he will wage nuclear war against the United States, but I guess that's not a big deal...","post_message":"Barack Obama's 10 Essential Sci-Fi Movies And Shows:  The Matrix Star Wars: Episode IV Star Trek: The Original Series Cosmos (...)"},{"comment_id":"10155114776336509","commenter_b":"Yes lets look at all those years Hillary has been in office but she doesn't handle classified information. So what does she do??? Trump has declared bankruptcy 7 times out of over 500 businesses. Pretty good success rate. I would like to see you try and run two businesses and see how you do. NEVER HILLARY!!!!!!","commenter_a":"Let's compare resumes, shall we? Hillary Clinton: 9 years, First Lady of Arkansas 8 years, First Lady of the United States 8 years, U.S. Senator 4 years, U.S. Secretary of State Donald Trump: At least 15 failed businesses Owns casinos that have filed for bankruptcy no less than 4 times 0 years in public service Now, if you were looking at those numbers, who would you hire? Who would you trust?","post_message":"While introducing Hillary Clinton at an appearance in Omaha, Nebraska, billionaire Warren Buffett challenged Donald J. Trump to release his tax returns: \"I'm under audit too. I would be delighted to meet him any place, any time. ... I'll bring my tax return, he can bring his tax return.\" @webpagelink"},{"comment_id":"1759075771038433","commenter_b":"@username...No evidence??? HOW ABOUT 4 DEAD AMERICANS.... HOW ABOUT ERASING YOUR EMAIL TO HIDE IT, WHEN ASKED...HOW ABOUT MISHANDLING TOP SECRET INTELLIGENCE... THAT'S ALL BEEN PROVEN. .. YOU CAN'T PICK AND CHOOSE....YOU CAN LEAD A HORSE TO WATER, THEN HOLD HIS DAMN HEAD UNDER, UNTIL IT QUITS KICKING...THAT'S WHAT IT TAKES, WITH PEOPLE LIKE YOU, IT SEEMS.","commenter_a":"So would we all. As a matter of fact, orange jump suits would look good on all Socialist-Democrats.","post_message":"“Hillary, I’m waiting for what you promised me. All I heard was you getting on TV, calling me a liar. That’s not true, Hillary. I am not the liar. You are the liar.”"},{"comment_id":"620617391457056","commenter_b":"Cleavage queen","commenter_a":"Just once I would love to see Mariah dressed in a turtleneck !","post_message":"It really is the most wonderful time of the year!"}]
