[{"comment_id":"10154001679275927","commenter_b":"Every time she opens her mouth out comes more drivel!","commenter_a":"She owns a vineyard in California, I think she personally does all the wine tasting herself!","post_message":"WATCH-- President Clinton, as well as President Obama, we operating on a pay-as-you-go basis ...\""},{"comment_id":"10153523667426336","commenter_b":"Please don't reproduce, the stupid must stop with you!","commenter_a":"TRUMP ALL THE WAY!","post_message":"The 2016 election kicks off on Fox News Channel August 6th!  Fox News and Facebook are teaming up to bring you the first Republican presidential debate! LIVE coverage begins at 5p ET. Don’t miss it."},{"comment_id":"10153414254384203","commenter_b":"50 cent throws like a girl... Lol. Might as well back one.","commenter_a":"That's the only way he can get his name out without dissing someone...","post_message":"\"Hillary was the president already once. You know what I sayin?\""},{"comment_id":"10154997509084626","commenter_b":"YOU ARE AN INSULT TO ALL WOMEN","commenter_a":"The embryo inside you, is not your body","post_message":"LIVE STREAM: Women's March on Washington"},{"comment_id":"10153378230871770","commenter_b":"You have to be a special gentile stupid to call the protesters racist.read the Talmud you stupid bastards.","commenter_a":"I think I seen that dude on delliverance movie","post_message":"Violent anti-Israel protests broke out at the American Israel Public Affairs Committee’s annual conference in Washington, D.C. on Sunday."},{"comment_id":"10154512331514087","commenter_b":"I don't blame them! I wouldn't want to work with the Chump either. But is that more inexperienced, mindless sheep the Chump can put in their place?","commenter_a":"LOL, I wasn't fired, I quit","post_message":"BREAKING: All State Department senior management officials have abruptly resigned."},{"comment_id":"988263084573780","commenter_b":"Iam not ur bitch","commenter_a":"@username Jøkêå Downey-mccain Kealeo Dixon @username 😂😂😂","post_message":"When Your Whole Squad On F*ckery Level 10!"}]
