[{"comment_id":"10153572834548132","commenter_b":"He fucked his sisters......BIG difference","commenter_a":"She's right. There was virtually no mention from the media of Lena Dunham's admission of touching her sister when her book came out. Complete double standard.","post_message":"Sarah Palin isn't too happy with what she calls \"obvious double standards\" between the Duggar family and actress Lena Dunham."},{"comment_id":"10154833870921336","commenter_b":"The pussy you are referring to is a family who call themselves Lisa, nice safety pin by the way, do they make them in mens?","commenter_a":"If Trump states that 'Nothing will Change', then he should stop being such a pussy and stop belly-aching about the recount. He's a complete WIMP.","post_message":"Reince Priebus slammed Dr. Jill Stein's presidential election recount effort, which was recently joined by Hillary Clinton's campaign."},{"comment_id":"1119811948055147","commenter_b":"You want a female hero? You've got Samus! Leave Link alone and stop this feminism in video games. Ghostbusters already died and they want all of the world become female, not just video game characters...","commenter_a":"while we're at it, should we change harry potter to female as well?","post_message":"Nintendo's reasoning makes zero sense."},{"comment_id":"10153513195292439","commenter_b":"Too bad for the Muslims that look at a natural act of breast feeding as obscene. They can cut off heads and introduce their babies to horrific killings and slaughter and raise their kids as killers. That is what is obscene.","commenter_a":"Muslim women do NOT have tits.","post_message":"@webpagelink"},{"comment_id":"10153634339640695","commenter_b":"Randy isn't even from the south. He's a Yankee. He has no say in whether it would come down or not. Just trying to yank your chains.","commenter_a":"take that dirty monument down!!!","post_message":"Instead of removing the carving, one councilman says they should add to it to better reflect Georgia history. What do you think?"},{"comment_id":"1046205432190874","commenter_b":"Paul, I'm in Columbus, too. Do you think this is a Trump thing?","commenter_a":"At 11:35PM tonight, we lost our feed for your show locally on CBS affiliate WBNS. I missed your monologue, but I'm sure it was just an alternative coincidence.","post_message":"Tonight on The Late Show... from the film 'The Comedian,' actress Leslie Mann, an interview with comedian Lewis Black, and from Schitt's Creek, actor Dan Levy!"},{"comment_id":"10154343672430329","commenter_b":"Well said @username. BTW...@username who are you to judge who's a feminist and who is not? Worry about your own backyard and sit yourself all the way down.","commenter_a":"If you think she's a feminist. Please reevaluate your life EDIT: She is the definition of WHITE FEMINISM. She doesn't care about anyone but herself.","post_message":"It sounds like Taylor Swift responded to Kanye West in her Grammys speech: @webpagelink"}]
