[{"comment_id":"1309663882411384","commenter_b":"Thank you! Someone with a little logic about the abortion! It should not be tax payer funded and it should NoT be past 12 weeks and it should not be used just because some idiot woman didn't use birth control and doesn't wanna deal with the consequences of her actions !","commenter_a":"I can not believe that abortion is a right to be discussed in 2016. It is a womans right to decide! It is our bodies!! As long as it happens before the 12th week...but women need to use their head and not use this as birthcontrol! Protect yourself if you don't want a kid! As I said, it is 2016 and we do have many types of birthcontrol!","post_message":"Obama's last stand"},{"comment_id":"978050422232298","commenter_b":"NOT A FAN of this pro-Muslim woman PERIOD!!","commenter_a":"She is the new definition of cool. Drop that mic and walk away.","post_message":"Mic drop."},{"comment_id":"10153306545444575","commenter_b":"Its hard to trust the justice system when everyone isn't treated equally","commenter_a":"I'm sure anyone could argue \"what the parent should have/have not been doing\"... It only takes a quick look away for something like a car accident or a child to run out in the street to happen. What's unfortunate , is that we as people, don't trust the justice system when we face situations as such and feel the need to take matters in our own hands. Praying for both of the families in this loss.","post_message":"A driver and his teen passenger were shot and killed by an unknown gunman while talking with police. Right before the shooting the driver hit and killed a toddler who ran into the street. “Today is not a good day — when an infant can lose his life, and then someone, a Good Samaritan tries to do the right thing and then all of a sudden a tragedy occurs,” said a city official."},{"comment_id":"694654787391766","commenter_b":"I'm suprised that asshole can even find a bathroom.","commenter_a":"The worst President in US history.........","post_message":"ISIS has officially declared they are coming to America. Obama needs to step up before it’s too late. Is Obama unfit to handle this situation?"},{"comment_id":"10152881862581051","commenter_b":"Fry the bitch","commenter_a":"Sad god be with her","post_message":"When police responded to the 911 call, they saw this woman on her front lawn - covered in blood. But even that didn't prepare them for what was inside the house."},{"comment_id":"1729905883960126","commenter_b":"That's ridiculous! Stupid woman","commenter_a":"As abreast feeding mother of two.................... She's crazy!! Get organised for Gods sake!!!","post_message":"She was breastfeeding her son in the pool while the wave machine was on"},{"comment_id":"1122113947823699","commenter_b":"Her feet are dangling fucking idiot","commenter_a":"And when exactly does he lift her and smash her against the car? Fuckin race baiter, who runs this page yo? Its gotta be a black person, racist bitch","post_message":"He LITERALLY lifted her off the ground and smashed her little body against the car! We just received this, will have more details soon."}]
