[{"comment_id":"10154226374872894","commenter_b":"Kim better stop bcuz money can dry up. At the rate that she is spending it.","commenter_a":"...but Andy Cohen has had work done himself so what's his point??? *sips Brandy and Eggnog*","post_message":"Andy Cohen Grills Kim Zolciak About Plastic Surgery: Sweetie, You Need to Stop (Video)"},{"comment_id":"10156385306200231","commenter_b":"She nonce play a white girl maybe she believe she one of them","commenter_a":"Can she be traded in???","post_message":"Why Stacey Dash? Why?"},{"comment_id":"406947019493592","commenter_b":"Another ride, but this time take obummer out","commenter_a":"Good for them!","post_message":"Enough is enough for these bikers..."},{"comment_id":"10153573077978352","commenter_b":"Christina you're dumb","commenter_a":"Te'ron Walker because most black people blame whites for everything. When no white people alive today had a damn thing to do with the past. Not all white people are racist. There are plenty of black racist people though because all whites 'owe' blacks every damn thing when we're not the ones that had anything to do with anything that happened before. Y'all need to take that shit up with all the dead white people. Oh, and the blacks too since whites weren't even the ones to START damn racism. Ignorance is bliss people.","post_message":"High school principal fired after racist outburst at ‘all the black people’ leaving Georgia graduation ceremony early"},{"comment_id":"10154710318354062","commenter_b":"GTFOH... U don't own this planet girl!! GOD knows no borders right Angie? Get off ur high horse! Stop looking down n help another up!!","commenter_a":"what part of ILLEGAL do people NOT get??? GO HOME!","post_message":"Dozens of protesters have gathered on the University of Houston campus in advance of tonight's debate. Live team coverage coming up at 6."},{"comment_id":"800418456754419","commenter_b":"She shd be in jail","commenter_a":"Nobody in the GOP can't come to Hillary's standards, there is no comparison.. She is one smart and prepared capable Madam President!","post_message":"The #GOPDebate may have ended, but CNN’s Chris Moody is live, taking your questions from the post-debate spin room in Miami."},{"comment_id":"990898310953409","commenter_b":"'Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you'","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas.  @webpagelink"}]
