[{"comment_id":"10152865678521336","commenter_b":"Christ is the answer for the muslims !!","commenter_a":"All muslims are either radical or they support it ! they follow the qoran and that is what the qoran teaches !! their leader was a pedifile and mass murderer !","post_message":"'I think we should cut out the political correctness. This is Islamic extremist terrorism. It is not the entire Muslim religion.'  Former NYC Mayor Rudy Giuliani said President Obama appeared weak for describing Wednesday’s deadly terror attack in France as 'senseless violence of the few.' @webpagelink"},{"comment_id":"675876952588617","commenter_b":"Hillary is a lying bitch.","commenter_a":"Won't hear this at the debate.","post_message":"JUST IN!"},{"comment_id":"480862922104288","commenter_b":"Let them go swim in there on country. We dont need them polluteing our pools.All that goat hair will mess the pool up.You want be able to drain it.","commenter_a":"Send these people packing","post_message":"A judge just ruled that public pools must allow Muslims to swim in 'Burkinis'.  We're tired of Muslims infiltrating our country. This stops now.  Do you agree that 'Burkinis' are WRONG?"},{"comment_id":"1328759877154299","commenter_b":"Karen >>> Integrity is not exactly an attribute of the Leftists. BIRDS of FEATHER, flock TOGETHER!","commenter_a":"My message to these 'journalists'. I don't care if you're talking about Trump, Obama, Clinton, or aliens. Using that kind of language is a disgrace to your job, which you obviously don't deserve. Your blatant disregard for any kind of integrity obliterates any credibility or respect you had with me. If you expect people to listen to you, make your use of language worth listening to or find another career that better employs your lack of ethics, if such a thing exists. Good luck with that.","post_message":"If a journalist said this about Barack Obama, the collective outrage from the press could be measured on the Richter scale."},{"comment_id":"1744722422438798","commenter_b":"Fkn pussy","commenter_a":"BS!!!","post_message":"College Kid Demands Counseling After Being 'Traumatized' By Seeing The Confederate Flag Sticker  Our society is getting out of control.  Do you think this is ridiculous?"},{"comment_id":"1357029221003198","commenter_b":"Some more cry babies who need their blankie and bottle and their safety pin get over it!!!! God BLESS AMERICA AND GOD BLESS PRESIDENT TRUMP!!!!","commenter_a":"Like the cops dont have better things to do! Should arrest the little bitch 'barista'!","post_message":"The anti-Trump movement enters Starbucks.  @webpagelink"},{"comment_id":"10153666209640399","commenter_b":"Fire her!","commenter_a":"I've always liked Debbie, and had a lot of respect for her, but if this thing has legs, it could spell big trouble. There is enough dishonesty in Republican Ranks, we don't need any in Progressive Ranks. We all need to watch this carefully.","post_message":"Debbie Wasserman Schultz said the DNC needed to suspend access until they can be sure that the information hasn't been 'manipulated.'"}]
