[{"comment_id":"10152831511530496","commenter_b":"She is ugly","commenter_a":"While we understand that there are various strong opinions on this topic, we ask that everyone express them with in a respectful manner. Memes and inappropriate comments will be blocked from view. Those posting slurs or otherwise offensive comments will have their posting access to our Facebook page blocked.","post_message":"Caitlyn Jenner, the Olympic athlete formerly known as Bruce, makes her debut as a transgender woman, posing in a swimsuit on the cover of Vanity Fair. Take a look: @webpagelink"},{"comment_id":"628439843967466","commenter_b":"Yep criminals think like that That is why she pointed a gun at the polw. @webpagelink","commenter_a":"Because they don't have anyone to be accountable to!!!","post_message":"This is for all of the victims of #PoliceMurder and #PoliceBrutality who never make national headlines in the mainstream media! @webpagelink"},{"comment_id":"10153352524191179","commenter_b":"B**ches","commenter_a":"No class!...it really starts at home","post_message":"Arizona high school students' racism even offends Arizona"},{"comment_id":"10154156442975443","commenter_b":"We did trust remember all Far East and then look what happened American trained Far East pilots flew their planes into our building now because of ISIS we need to take measures don't take all this personal and if ISIs does get in who will be at fault well oh a big war and then how will you feel this is what happened we are too trusting this has nothing to do with RACE do you all have better way to stop this","commenter_a":"One brave Judge saved Muslims from being discriminated against contrary to the constitution. We really need some brave republican congressmen to save America from heading into disaster by stopping this man making hate and racism a normal thing. What we have seen so far and just today banning CNN and The New York times is no joking mater.","post_message":"\"The situation seems to be pretty bad after Trump took over as the U.S. president.\""},{"comment_id":"10156046301859896","commenter_b":"Romona de Araujo Lol lol lol lol lol lol Lol lol lol lol lol lol You think someone who earned a living from porn and NEEDED TO READ A PRAYER...THE MOST COMMON OF PRAYERS... FROM A TELEPROMPTER IS THE VEHICLE TO BRING GOD BACK INTO AMERICA. OMG ...WHAT THE HELL IS WRONG WITH YOU. IN ADDITION, LET ME REMIND YOU THAT SHE HAS MADE A CONSCIOUS DECISION TO REMAIN MARRIED TO A SELF- PROCLAIMED SEXUAL PREDATOR. MY DEAR GOD WAS NOT SMILING DOWN IN APPROVAL AT MELANIA, AS SHE READ RELIGIOUS WORDS OFF A TELEPROMPTER ... HER ATTEMPT TO BRING A PRAYER INTO HER ACT ....OF ATTEMPTING TO CON US INTO BELIEVING SHE IS RELIGIOUS ....WAS A TOTAL DISRESPECT TO THOSE OF US WHO ARE TRULY RELIGIOUS AND HAVE THE LORD'S PRAYER IN OUR HEARTS AND LIVE BY THE WORDS OF THAT PRAYER. FANTASTIC....YOU NEED TO LOOK UP THE WORD ...","commenter_a":"Of course satan and his demons would be offended. I think she was fantastic!! Take God out of any country and it quickly loses it's greatness. It's about time America's bringing Him back.","post_message":"Progressive \"Love\" and \"Tolerance\":"},{"comment_id":"10154683405811756","commenter_b":"Well what can one expect when they compromise their values to support an incompetent candidate for president for the sake of the Republican Party! I thought you all take an oath to do what's best for our country and the American people. Not sure how Trump could possibly be considered part of this equation!","commenter_a":"@username, what we were talking about","post_message":"It was already a difficult election for down-ballot Republicans, a top campaign aide says. \"The bottom is starting to fall out a little earlier than expected.\""},{"comment_id":"1388401547878144","commenter_b":"They ain't people fuck em and their cars","commenter_a":"Even if its a serious rush it doesnt give them the right to fkin hammer through like that, imo. Yes they should move over more than they do, but to run into every car they can is idiotic. Shows the disrespect of people even if some may be the enemy, everyone isnt","post_message":"More throwbacks at > Afghanistan Combat Footage - Funker530 You think you know road rage? ~Josh"}]
