[{"comment_id":"10153969418599575","commenter_b":"Mike Carter was it ever great? Living on credit was the way to create happiness, no one is talking about the pitfalls!","commenter_a":"None of the other Candidates are even mentioning Veterans! They have already had 6 Debates. I am going to watch the other channel and vote for Trump!","post_message":"Donald Trump is going to skip Thursday's GOP debate.   “We’ll have an event here in Iowa, with potentially another network, to raise money for wounded warriors,” he said. “And Fox will go from probably having 24 million viewers to about 2 million.”"},{"comment_id":"1843613252518265","commenter_b":"Squirting and peeing may release the same fluids but the acts are totally different. You would know if you've ever made a woman squirt...","commenter_a":"Think the only people who care are the women who can't squirt and the guys who can't make women squirt","post_message":"Happy Valentine's Day!"},{"comment_id":"10153026521466955","commenter_b":"Women of the world just took a hit, sorry","commenter_a":"it's all lies and if you even think for a moment it's true then your the fool","post_message":"MAG: Bruce Jenner 'Transitioning into a Woman'... Filming momentous docu-series..."},{"comment_id":"895490467164248","commenter_b":"Married women have abortions too !","commenter_a":"Pro choice is about a woman's right to screw like a whore without any consequences. That's the reason Obama wants it for his kids.","post_message":"Do you agree?"},{"comment_id":"10153495156678132","commenter_b":"Gosh, her voice is so heavily autotuned in this song, it sounds robotic!","commenter_a":"I dont get how she has music contract when literally all of her songs are autotuned. That means you're not a good singer. Anyone can sing when their voice is manipulated like that.","post_message":"Don't expect us to get anything done for the rest of the afternoon."},{"comment_id":"274535909638816","commenter_b":"You are a sick women!","commenter_a":"What's even scarier is Californians that elect her again and again. I was having a discussion with a gent on fb he stated he moved out of the northeast because we were stupid. He stated he moved to the 2nd most intelligent county in the country.I took a wild guess and asked if the state would be California? Bingo! See how these people think. Scary","post_message":"HOLY SMOKES! NANCY PELOSI: Orders People to Clap, Repeats Words Then Calls John Kasich The Gov. of Illinois [Video]  This is embarrassing! She scolds the audience!"},{"comment_id":"10155955897895354","commenter_b":"The nasty b*tch just wanted attention and guess what? Now everybody is giving it to her.","commenter_a":"For the life of me I will never understand killing these magnificent animals. I just don't understand how it can be wonderful, thrilling, exciting or in any way fulfilling to kill an exotic animal. And then chop it's head off or whatever you do with that giraffe and have it mounted. Makes not one bit of sense let alone any kind of satisfaction.... Just don't get it.STOP IT NOW!!!!","post_message":"This hunter is single-handedly breaking the Internet today.   Check out the photos of her other controversial kills..."}]
