[{"comment_id":"1247325575291461","commenter_b":"Third *","commenter_a":"That's a fair shout but we killed them all off and interbred with them now we have evolved and are the last stage you see before your eyes, religion is cool except for when it blinds you and # Christianity is young as fuck compared to other religions fam","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153236165233984","commenter_b":"Someone needs to sew a ZIPPER in her face!","commenter_a":"please STOPP","post_message":"Are you kidding me lady? Stop, just stop, please.  Do you think this new mandate is completely over the line?"},{"comment_id":"925335920856271","commenter_b":"What has she done is any of her 'jobs' ??","commenter_a":"let's see.... do nothing, do nothing. who cares.. liar, philanderer, cheat.....","post_message":"Some familiar faces on Roosevelt Island."},{"comment_id":"1849294941953444","commenter_b":"Illegals don't pay taxes, they may pay sales taxes, but one needs a social security card or a legal visa to get a legal job in America. Illegals are not immigrants, immigrants are people that came to the United States legally. American taxpayers should not have to pay for illegal activity, or anyone that came here illegally. I believe that all illegals need to go back to where they came from and return legally. If a child was born here from an illegal alien they need to go home with their parents, come back legally, they were born here illegally does not make them an American. All illegals should be thanking us for allowing them to stay for long, time for them to take what they have learned here in America and help the people in their homeland/country. Wait your turn like legal immigrants! No Mayor, NO state official, or ...","commenter_a":"Good for you NEW YORK!!","post_message":"'This is New York. We are always New York.'"},{"comment_id":"10153635830302061","commenter_b":"'@username Wow.....you are a wicked mean nasty woman!!!","commenter_a":"It was a great dance to encompass her whole journey on the show, but in no way does it compare to Nyle's or Paige's.","post_message":"WATCH: Ginger Zee & Valentin Chmerkovskiy's take the dance floor by storm in last night's Contemporary Dance to a cover of Coldplay's 'Adventure of a Lifetime.' Dancing with the Stars Season Finale continues TONIGHT!"},{"comment_id":"566067710239006","commenter_b":"Her momma should have sucked it","commenter_a":"Jennifer who!","post_message":"Jennifer Lawrence to Donald Trump: F*** YOU!"},{"comment_id":"10153335826619714","commenter_b":"Finally!!!","commenter_a":"'@username Durrah Afyouni Masah Azar @username Maya Maaytah","post_message":"Vogue shoots & profiles Andreja Pejić"}]
