[{"comment_id":"902740889761333","commenter_b":"Who would want her??","commenter_a":"Oh really that would make for a honest President, not","post_message":"BREAKING!"},{"comment_id":"1009004349187234","commenter_b":"first she needs to be a lady","commenter_a":"Watch out she will pick your pocket ...","post_message":"Michelle Obama Invites Muslim Refugee To Sit With Her At State Of The Union  She should invite a soldier who fought for our country. This is ridiculous.  Do you think Michelle Obama is the worst first lady ever?"},{"comment_id":"10155043885602908","commenter_b":"Move out of Big Blue high tax, high cost of living Commifornia. Problem solved.","commenter_a":"$7.25/hr equates to about $1250 a month before taxes. After taxes let's say $1000. I live in a studio apartment in CA and it's $885/mo. So $115 remains for 4 weeks of food, utilities, transportation to and from the job? Get real, America. Especially for a family even $15/hr would be a stretch, but it'd be better.","post_message":"It is a national disgrace that millions of full-time workers are living in poverty and millions more are forced to work two or three jobs just to pay their bills. A job must lift workers out of poverty, not keep them in it. The current federal minimum wage of $7.25 an hour is a starvation wage and must be raised to a living wage."},{"comment_id":"1380514481968578","commenter_b":"You're way too late. It's all Hillary now #imwithher","commenter_a":"If you live in a state that has yet to hold a primary, join with Sanders and stop both Hillary and Trump. #nevertrump #neverhillary","post_message":"Ohio Gov. John Kasich will suspend his presidential campaign on Wednesday, a senior campaign adviser tells NBC News."},{"comment_id":"10153635150260950","commenter_b":"Create a sanctuary for endangered animals instead of putting them on display for arrogant humans... This mother is at fault.. That simple.. Cincinnati Zoo should have never been given this gorilla.. They aren't equipted to protect him... If a parents negligence causes the death of an animal like this, it should be treated as a crime.. On the parents.. Shameful.. I will never go back to the zoo.. My grandkids can Google animals until they are old enough to one day take a safari...this is disgusting and unessesary..","commenter_a":"I HOPE THE PARENTS OR ADULTS THAT WERE RESPONSIBLE FOR THIS CHILD WAS IMMEDIATELY ARRESTED..","post_message":"The four-year-old boy spent a terrifying 10 to 15 minutes alone with the adult primate before the decision was made to kill it."},{"comment_id":"1191127007601184","commenter_b":"Sometimes it takes longer for the other egg. They don't always lay both at the same time. And if was a bad egg she would get rid of it.","commenter_a":"It's crop never seems to look full?","post_message":"AFTERNOON #HATCHWATCH2017: Anytime now, the second eaglet is expected to hatch. A New Year's Day birth, perhaps? Video courtesy of Dick Pritchett Real Estate @webpagelink"},{"comment_id":"10153176907066130","commenter_b":"And not be forcibly altered. Don't circumcise babies!","commenter_a":"Before picture or nahhh","post_message":"\"We need to remove the stigma. We should be able to alter whatever we please, free of the judgment of others.\""}]
