[{"comment_id":"10152688677486491","commenter_b":"@username Was 9/11 an act of American terrorism? WTC and Pentagon are both on US soil, right?","commenter_a":"Not Polish camp but German!!","post_message":"Hundreds of survivors returned to the Holocaust’s most infamous concentration camp today."},{"comment_id":"10154722156744749","commenter_b":"The 'girl who prepared' has a name. Her name is Hilary. When this 'dastardly' person can be called by name why not this lady?","commenter_a":"What a terrible statement...Clinton is a terrible example. She is a garbage","post_message":"\"Ten inches shorter, she towered over her rival. In 42 days’ time, Dastardly Donald deserves to get beaten by the girl who prepared.\""},{"comment_id":"750991365034044","commenter_b":"Ok idiot if you want to require those mothers on welfare to work \"chain gangs\" to \"earn\" their food stamps does this mean you're willing to pay their childcare while they do so? You think most young mothers WANT to live on assistance you're a bigger Tard than you sound! The only way this maybe possibly would fly is if you held the FATHERS accountable too!!!! Duh.....sorry it's obvious you barely made it through ninth grade TROLLER","commenter_a":"I've been saying this for years, they say our roads suck well get the freeloaders on welfare to go fix them, instead of chain gangs picking up trash make them do it. It's no ones fault but your own if you want kids, make sure you can support them! Welfare should be a times thing like a year after that your done. If you think flipping burgers is beneath you guess what if it means you have food, shelter and clothes it beats nothing at all if you have to work two jobs that's on you, maybe you should have made something of yourself! No more giving illegal aliens good stamps or any kind of government handout. You want to be an American go get a job and pay taxes like everyone else!","post_message":"Take note.....it's damn brilliant."},{"comment_id":"847297252033195","commenter_b":"Girls run the world!","commenter_a":"No on F'in cares except the racist thugs like OFAILURE & OSHARPTON & BSNBC !","post_message":"Who run the world?"},{"comment_id":"600606456772491","commenter_b":"Takeaways from the Texas GOP Debate *Donald Trump looked like an absolute buffoon in a nice suit. It was also clear that he has talked out of both sides of his mouth so much, that he cannot even remember what he has said in the past. We heard all the same old talking points and we heard more insults and name calling designed to shame his opponents; and Trump even classless attacked the moderators for asking reasonable questions. The Trump diehards will rush to the Internet to vote for him as the winner. People who were actually listening to him, will change their vote if they thought about supporting him, or be happy with their decision to vote for someone else. * Ted Cruz was once again the most substantive and clear debater. He was unfairly treated by Wolf Blitzer by Blitzer inability to control Trumps interruptions. Ted Cruz was ...","commenter_a":"Good job tonight I wish we could of heard more","post_message":"Real compassion is providing people a ladder of opportunity to climb up from a state of dependency. #GOPDebate   Visit bencarson.com/issues to learn more."},{"comment_id":"405482309640063","commenter_b":"Sharia is contrary to the Constitution and as such cannot coexist with our laws. If muslims want to live by sharia then they need to return to the hellholes they came from. I can guarantee that if a muslim male were to attack me or even confront me that I would take him out. And he would not get his 'virgins' either.","commenter_a":"yep, we enough corruption without this law adding to it.","post_message":"If you don’t believe that sharia law is already creeping into the United States of America, then you need to watch this video."},{"comment_id":"10153740832391800","commenter_b":"Chris, honey, being a salty bitch isn't going to solve the problem.","commenter_a":"Islamic Extremists: Kills people that don't share their beliefs, Christian Extremist: Kills people that don't share their beliefs! I say, we should worry about these pro-life extremist before we worry about extremists on the otherside of the earth!","post_message":"In the wake of a shooting at a Colorado Planned Parenthood, the media questions whether or not it was an act of domestic terrorism.  ►Watch last night’s full episode now: @webpagelink"}]
