[{"comment_id":"10154974435358812","commenter_b":"Russian Women For Trump ???","commenter_a":"Well rehearsed lol","post_message":""},{"comment_id":"1191285677577713","commenter_b":"The people voting for killary think they,ll get a free pass. Muslims don,t care! Go President Trump!","commenter_a":"If Trump loses I'm going to get a divorce reap all the benefits of a single mother children's free medical care food stamps free housing free utilities free cable free cell phone he will quit his job and work at a 7-Eleven and live in a separate unit from me But will still be together like they do, My kids will get free school lunches and breakfast free sports associated camps free YMCA free scholarships for free college:))))","post_message":"\"She’s going to open the borders, pack the Supreme Court and you are not going to have the same country. Maybe you like that, maybe you don’t. But we’re not going back to the status quo, period. And so Republicans need to understand if Trump loses, it is a new America, OK? A lot is on the line, whether you like him or not. That is real.”"},{"comment_id":"1689272294667942","commenter_b":"@username Bernie raises money for the party too! You didn't hear that right at all. None of Hillary's money goes to Bernie, that would be ridiculously counter productive. Duh! Both Bernie, and Hillary do raise funds for the rest of the Democratic party. This is done, to insure more Democrats get elected. That way we won't have another lame duck president. Bernie still as a very good chance, and with all the controversy, Hillary, and supporters, may have just crossed the line! Don't count chickens before they are hatched! Be ready to vote blue, no matter who the nominee. On that note, I'm voting for Bernie, it's the right choice for the majority of Americans. The wealthy don't mean a damn thing to me, as most of them feel the same about us.","commenter_a":"Wise words my ass. How can you even sit there and tell us to join together with the blatant fuckery Shillary Clinton is doing. The voter suppression. Not releasing her transcripts. Her lies. She's a corporate slug that doesn't even deserve to be in office or the government. She's as bad as the republicans. The worst part is she would probably lose to the republican nominee and y'all keep trying to shove her down our throat. What the hell are we voting for if the DNC is just gonna cheat us. Bernie or bust.","post_message":"Wise words from Robert Reich. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1057489254266735","commenter_b":"Deport all illegals ..............","commenter_a":"The funny thing is that it's NOT about amnesty. It's about getting control of a situation that's currently OUT of control. If we don't move forward with the current plan, than what? Yes folks we are not in the same situation, but a much worse one. SIMPLE! Think about it, they are already currently living here and paying NO taxes. Unless we can beam these people up bye my calculations, YEP, there still here. Let's look back at what was actually said, the President NEVER said he was going to legalize any body's current status, just give them a chance to apply while working on there current status. Is it such a bad idea to have these people come out of the dark?","post_message":"I've been telling people for I don't know how many years, you know it as well as I do that's what this is all about. But no Democrat's ever admitted it."},{"comment_id":"10155013534653734","commenter_b":"There are many veterans that need work. Why not offer them a job?","commenter_a":"Just make sure they got their paperwork together since you made a public announcement.","post_message":"Starbucks Chairman and CEO Howard Schultz announced the move after President Donald Trump's travel ban that applies to Syrian refugees and six Muslim nations."},{"comment_id":"1243497535729399","commenter_b":"Who is this angry old lady?","commenter_a":"500,000 Women march on Washington to protest Trump becoming 45th President march today for the moral core of this nation, against which our new president is waging a war, actress America Ferrera told the Washington crowd. ..... for the moral core of this nation - most curious statement ! Both Presidents Jack Kennedy and Bill Clinton were known womanizers - both had long history of doing so Kennedy had his lovers escorted into the White House late at night while Clinton had a young woman intern give him oral sex right in the Oval office ONLY difference was that Kennedy and Clinton were Democrats while Trump is a Republican At the core of the protest is that Trump won the 2016 election in KEY states and the Democrats could not get their vote out in the KEY states Moore, Garry R - Solutions Inc","post_message":"\"Well, good did not win this election. But good will win in the end,\" Madonna delivered a fiery R-rated, anti-Donald J. Trump speech during the #WomensMarch @webpagelink"},{"comment_id":"10153801598562042","commenter_b":"God this makes me sooo angry I just want to cry and beat the crap out of her. She is a monster and deserves the death penalty!! Rip Little Angel!! 😢","commenter_a":"And That POS is pregnant again","post_message":"DISTURBING DEATH: A mom allegedly punched her 2-year-old repeatedly in the stomach and the child was found dead the next day. What the mother later admitted to police is horrific ..."}]
