[{"comment_id":"10154259987641955","commenter_b":"Lilla Williams","commenter_a":"Good lord. I was watching a news person on Fox this morning lifting off in a balloon and thought, what if it caught on fire. Saw this later and it's so sad","post_message":"HORROR: HOT AIR BALLOON CRASHES IN TX...  16 DEAD..."},{"comment_id":"1052361568153705","commenter_b":"A lot of people who follow this page will probably chuckle at this... But those are actually two very evil women you see picture there.","commenter_a":"#Hillary2016","post_message":"Hillary and Cecile Richards sat down with Refinery29 and talked about everything from “mansplaining” to the future of abortion rights."},{"comment_id":"10153230104286051","commenter_b":"I agree with that woman keep your garbage with you","commenter_a":"Just a ? For all who are being so harsh. Witch one of you would want that sign by the grave of your loved one. I sure wouldn't want it by my nephews grave. He died from a drug over dose. Oh yes I fully understand and can see both sides.","post_message":"These grieving parents went to visit their teenage son's grave one day when they noticed something on a tree behind his headstone."},{"comment_id":"1702389236690262","commenter_b":"#NRAWhore","commenter_a":"Screaming about process that eliminates the ability to make progress is criminal.","post_message":"The sit-in by House Democrats is nothing more than a publicity stunt. The bill they're talking about was already defeated in the United States Senate. It's time for them to #StopTheStunt."},{"comment_id":"10153365008995329","commenter_b":"ew. She's so disgusting .","commenter_a":"Should. Be. Fired. There are plenty of other \"educated\" people to rep ESPN. Or frankly to do her job you don't need a degree. You need decency.","post_message":"ICYMI (via BuzzFeed News)"},{"comment_id":"1001780713207758","commenter_b":"Like we weren't already?","commenter_a":"So how many of his baby-mamas and illegitimate kids do we now have to support? Any more than usual?","post_message":"Protesters Said this Cop Shot an Unarmed Teen for No Reason. Here's the Video."},{"comment_id":"1050187868329829","commenter_b":"Die already you old prick !","commenter_a":"lol I see the libturd heads exploding in here! Deport them all!","post_message":"On the Texas immigration ruling: President Obama is well within his established Constitutional authority and the legal process will bear that out. The only effect of this ruling is to delay justice for thousands of families in Nevada and across the country. Governors, mayors and law enforcement officers have emphasized that these programs are good public policy, help our economy and keep our communities safe.  Courts are only involved in the first place because Republicans have spent years blocking Congress from fixing our broken immigration system. Congress should live up to its responsibility and pass an immigration bill that secures our borders, keeps families together and provides an earned path to citizenship.  There is nothing stopping the Senate from debating immigration legislation immediately. Unfortunately, the Senate is mired in a completely avoidable impasse over funding the Department of Homeland Security. Senate Democrats have a simple solution for getting out of this jam: take up and pass a clean bill to fund Homeland Security, then move on to a robust debate on immigration legislation.  Democrats’ offer to first fund Homeland Security and then debate immigration stands. All Republicans have to do is say yes."}]
