[{"comment_id":"10153916638559753","commenter_b":"Feed the gator Hillary and her pimp Obama kill that gator quick","commenter_a":"According to CNN the gator was a known Trump supporter and a life member of the NRA.","post_message":"News of yet another alligator attack has shaken things up in the state of Florida. A service dog named Precious has passed away after protecting her owner from being attacked by an alligator. Fox News reports the protective pit bill died after jumping in between her owner to save the man from an alligator attack in the southwestern portion of Florida. The alligator attack and death of this heroic service dog from Florida has prompted an inspect to determine whether or not the marina where... @webpagelink"},{"comment_id":"1149843228370020","commenter_b":"1404343676260901house @username","commenter_a":"Chris Weishuhn","post_message":"What happens when you strap a GoPro to a giant sea turtle. Video by the WWF."},{"comment_id":"1063405993707262","commenter_b":"@username by sitting this election out, you will be voting for Hillary!","commenter_a":"The Donald has his whole family there. Oh, and his favorite adviser - himself, his biggest fan - himself, his biggest fan - himself. Who else does he need? He's been saying all along that he will win without support. The truth is that, as much as I dislike these guys, they are basing this on principles. Laura, I used to have much more trust in you, but you've gone over too the dark side it seems. Trump is the worst candidate in my lifetime. And when you consider that includes Dole, McCain, Romney and the Bushes, that's saying a lot.","post_message":"Jeb Bush, John Kasich and company reveal they value their egos more than the GOP's success."},{"comment_id":"10154413353871519","commenter_b":"Nope. Good luck, though!","commenter_a":"They better NOT. You will get the same help you gave President Obama, 0. Now, GTFOH","post_message":"This is an offer they are not likely to take him up on."},{"comment_id":"10152475655222434","commenter_b":"This has never happened at a Steel Panther concert, little disappointed. I'm an actress and I've had people fall asleep in the front row... That was pretty funny. Also Erica, if the band were that bothered by it, they would have got security to remove them from the venue","commenter_a":"Matthew Naughton","post_message":"This woman is what the kids would call \"punk rock.\""},{"comment_id":"10153639382745950","commenter_b":"Clever ladies..some of those pre rape drugs put you out for life.","commenter_a":"Good job ladies, we gotta stick together as women or we'll all parish to the hands of the evil ones. May GOD bless them all","post_message":"It doesn't matter if you're a friend or a stranger. When these 3 women noticed a man allegedly slip something into his date's drink, they couldn't just sit there and watch it happen."},{"comment_id":"10153465235771316","commenter_b":"I guess the woman in this pic is borderline retarded...","commenter_a":"They can store more farts too so that's good","post_message":"Women with larger behinds are healthier and more intelligent, study finds: @webpagelink"}]
