[{"comment_id":"1114298202002104","commenter_b":"What do you mean? It's a horrible thing to say. But we have freedom of speech in this country. Her speech is protected by the constitution. She shouldn't get fired for it.","commenter_a":"So its only freedom of speech if it's against Republicans? If the Democrats played on a level field they would get destroyed even more!","post_message":"The director of a nonprofit agency who called Michelle Obama \"an ape in heels\" has been fired."},{"comment_id":"1712814082319419","commenter_b":"Disbar her. So corrupt!!","commenter_a":"Prison for treason","post_message":"Continuing Live Coverage: Attorney General Loretta Lynch testifies before the House Judiciary Committee on the DOJ's decision not to charge Hillary Clinton over her personal email use while secretary of state."},{"comment_id":"801271216730122","commenter_b":"This piece of garbage needs to go ahead and leave our country and take Kanye with her far far away","commenter_a":"Your the problem,and your friend obummmmer pos.","post_message":"Oprah Claims White People Are The Cause Of Racism In America. She's lost it. What a hypocrite. Do you think Oprah is the racist?"},{"comment_id":"703909133102373","commenter_b":"Keep it going and that shithole country might be cleaned up someday👍","commenter_a":"the result is the same be it honor killing (Indian way) or random shooting of school kids (US way)","post_message":"India reports a spike in “honor killings” — but the numbers are probably even higher."},{"comment_id":"1763050483964389","commenter_b":"@username it's sad that you believe this corrupt liar, she panders to do nothing but destroy American interests. You will have a hard life since you choose to ignore the research that many gave to you on this post. You rather remain blind then actually see the POS that you're defending.","commenter_a":"Here's an idea, everyone who DOESNT like Hillary, don't comment. Go comment on how much you love Donald Trump and how you hate everyone except white people. And how you hate refugees fleeing their countries that are being bombed by USA and how you hate everyone. And if you like Hillary and/or voting for her... Then you comment.","post_message":"Even before his hateful speech this week, Trump has never been vague about his feelings toward immigrants."},{"comment_id":"10157017965955206","commenter_b":"The women will rally and vote for a woman... that will be Killary. Just like Obama got his job because of his race.","commenter_a":"Check the men's response compared to the women's response here. You all k ow so.much about what we think. Well, Much of what she says has merit. Whether you like her voice or her face! She speaks for many women. As long as you make this about her voice or her face, YOU are the PROBLEM! WE are HERE! WE have a VOICE whether you think we're pretty or sexy or pleasing or NOT!","post_message":"My whole life, people have told me to settle and accept the way things are. Now, politicians are asking the American people to do the same thing: to settle for a nation that doesn’t reach our potential."},{"comment_id":"10154037346055329","commenter_b":"See bitch William Huybers","commenter_a":"Andria Gamuza Kimberly C Lin","post_message":"ewww...."}]
