[{"comment_id":"10153912025664030","commenter_b":"Kiss my ass.","commenter_a":"@username lol sleep tight","post_message":"Not Safe with Nikki Glaser asks the questions you didn't know you wanted answered.  All-new episode, tonight at 10:30/9:30c."},{"comment_id":"904031539740409","commenter_b":"@username you are just Jealous because your fat ass cannot wear something like that. Shut the fuck up.","commenter_a":"1. Bitch you know damn well you can't wear that to school shut you're whinny ass up, talking about being oppressed. I'm offended about your damn video. 2. When the your school starts banning something you can't control like how your hair grows then your oppressed until then put a damn t-shirt on and go about your way because if you truly didn't car how you looked you wouldn't have wore a strapless dress.","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."},{"comment_id":"10153943709566509","commenter_b":"Humans ruin everything they touch.","commenter_a":"why kill the bear!!!!!! humans were encroaching on it's territory! makes me ill","post_message":"Fatal human-bear encounters in Yellowstone National Park are rare, a spokeswoman said. @webpagelink"},{"comment_id":"10153880251122217","commenter_b":"No. They should be pure. Virgin skinned, hairless.","commenter_a":"See John for the invisible tattoos.","post_message":"Send us photos of your tattoos! We'll be talking ink in the workplace with tattoo expert Dr Matt Lodder at 13:30 (BST) on #FacebookLive. We'll be showing some of your tattoos as part of our broadcast, so please email your snaps to yourpics@bbc.co.uk"},{"comment_id":"10153150995326051","commenter_b":"You see how gay women are not fully gay . They still want dick !!!","commenter_a":"Is it a dildo? I'm not clicking I want to guess","post_message":"The police here had seen a lot of strange things before, but even they had never witnessed something quite like this."},{"comment_id":"10155234005228984","commenter_b":"Shut off the money! Mandate Everify with suspension of business & huuuuge fines if caught hiring illegals. No Welfare or any other benefits to non citizens. Proof of citizenship to attend schools! They will self deport! As for DACA? Ok. Let those poor kids who were dragged here as children BUT deport the parents that dragged them here!","commenter_a":"They are pissed off because of our policies but let ne of us cross their broader and see what happenes.","post_message":"WATCH LIVE: Secretary of State Rex Tillerson, DHS Secretary John Kelly and Foreign Secretary Luis Videgaray make statements from Mexico City on President Donald J. Trump's new immigration proposals."},{"comment_id":"456287754495819","commenter_b":"She wil not get my vote, Trumps mine.","commenter_a":"I do not agree with old horse face at all.","post_message":"Carly Fiorina has vowed not to send 'boots on the ground' into the Middle East. Do you agree with this strategy?"}]
