[{"comment_id":"10154048575244456","commenter_b":"Joke","commenter_a":"Prayers for Gunn's mom and prayers for Officer Smith. I pray that the whole truth be revealed and this young man will be safe.","post_message":"\"MPD supports their men and women in blue. #it'sok2hitthelikebutton,\" the post on a MPD Facebook page stated.  Here's what we learned today:"},{"comment_id":"628263567364222","commenter_b":"I'll stick with Palin on this issue!","commenter_a":"Sarah Palin is just an nut","post_message":"Americans are now claiming that Sarah Palin is racist.  This is absurd. Sarah is under attack, let's get her back.  Do you support Sarah Palin?"},{"comment_id":"579350648893184","commenter_b":"These other ones need to keep on walking","commenter_a":"At Portland High graduation three young muslim woman remained seated during the National anthem, one of them grabbed the hand of the young muslim man who was standing , trying to get him to sit.He brushed her hand aside and remained standing.Then she turned around to face a large group Muslims and tried to get them to sit.Everyone of them remained standing.","post_message":"Muslim Students Walk Out During National Anthem [VIDEO]. If you don't respect our country, feel free to leave. Do you find this disrespectful?"},{"comment_id":"10153095975513606","commenter_b":"Unreal. Where I grew up the \"N\" word was used frequently. Every time I was called that I retaliated. Im not a thug or a criminal. The teacher has to respect the students and vice versa. In hindsight the student should have went to the principal and then to his parents. Im in no way condoning what the student did but its a 2 way street. Dont bash the student when we dont know exactly what rhe teacher said. Racial slurs or any other forms of racism has no place in society. My kids or the kids I coach cant even say anything like that. Either way whatever was said isn't the problem. It was the lack of respect from the teacher and STUDENT.","commenter_a":"@username you say teachers need to watch what they say. I don't get it. What about the child. Dosen't he need to be taught. I don't like what you said so I punch you. There are other ways of handling verbal abuse. This is disgraceful.","post_message":"Witnesses say a Prince George's County Schools student punched his teacher over a racially insensitive comment: @webpagelink"},{"comment_id":"10153683265791336","commenter_b":"Most illegals do not get food stamps or welfare. Tons of Republicans ARE on welfare.","commenter_a":"That's great all the illegals like to hit Trump..they have money for parties and pinatas thanks to welfare Checks and food stamps! If I was living off the government tit I would hate him too..but I don't and I want my country strong again so I like Donald Trump. Trump 2016","post_message":"“We sell out pretty fast.” - Guadalupe Mendez, salesperson   (CC: Donald J. Trump)"},{"comment_id":"10152929148789342","commenter_b":"That statement coming from a welfare trashy tattooed old skank. Go figure.","commenter_a":"aand let the killings begin...smh","post_message":"BREAKING -- The Texas Senate has given preliminary approval to allowing concealed handguns in college classrooms, a day after passing a measure allowing open carry of guns most everywhere else in America's second most-populous state.  FULL STORY ---> @webpagelink/  What do you think -- are guns on campus a good idea?"},{"comment_id":"974409115948951","commenter_b":"Yes I have! She'll make an excellent prison wife. So biblically submissive.","commenter_a":"Have you seen this yet, Guy?","post_message":"Marriage equality is the law of the land. Officials should be held to their duty to uphold the law—end of story."}]
