[{"comment_id":"674562089401036","commenter_b":"The asshole cant do it","commenter_a":"Yes because the jails are full of Muslims. And what other matters does he have more important. What an absolute joke a president sticks his nose in these matters. Time for the states to push back.","post_message":"Obama administration has decided that they are going to ban pork products. This is just getting ridiculous. They need to come back to reality. Do you think the Obama administration is out of control?"},{"comment_id":"1357245971012470","commenter_b":"I prefer her to LEAVE!!!","commenter_a":"The way you get around those problems young lady is to loudly speak out against radical Islam, disavow any sympathy for them or their cause, encourage other like minded Muslims to do the same. That's how you stop the American people from associating you with them. Or you could just leave the country.","post_message":"She joins CNN's Costello to trash Trump after his victory..."},{"comment_id":"10153742106021167","commenter_b":"The smartest bag of dicks!","commenter_a":"Wow you people are about as smart as a bag of dicks..","post_message":"Conservatives are now demanding the FBI director explain to them why their fantasy version of the email “scandal” doesn’t match his factual one."},{"comment_id":"10153196392273984","commenter_b":"Hey Stupid! Thanksgiving is a day of thanks not a stupid holiday for your illegals and muslin buddies. Let it be! Stop destroying this country.","commenter_a":"Can we get rid of him, NOW!! Outrage doesn't even begin to describe this!! Leave things be!!","post_message":"Unbelievable. There's no way Americans are going to stand for this... Are you outraged?"},{"comment_id":"10154324502466051","commenter_b":"Oh SHUT UP WOMEN!!!!!","commenter_a":"Your shrill voice","post_message":"Hillary Clinton just revealed the big reason why she believes she lost to Donald Trump."},{"comment_id":"10150734990144999","commenter_b":"Now it's time to loathe Coldplay, then in ten years, we can appreciate them again.","commenter_a":"Never heard of anyone hating him I think this is a media thing thought up by some little intern that thinks he was being smart","post_message":"After decades spent as the target of jokes and sneers, Phil Collins is getting a fresh look."},{"comment_id":"10153178842572061","commenter_b":"Give me a break!!! I do NOT want her as a role model for my daughter!!","commenter_a":"So it's for self gratification and not to improve our country? Gotcha Hills. Now go away.","post_message":"Hillary Clinton starts of debate by saying: \"For me, this is about bringing our country together fathers will be able to say to their daughters, you too can grow up to be president.\" abcn.ws/1R9qmZ2"}]
