[{"comment_id":"10156412412225354","commenter_b":"Fire the hoe","commenter_a":"I guess they suspended her because her job, if she is actually a reporter, is just that, report the news and don't add to it or shade it with your opinion. If you want to share your opinion get a job as an editorial writer but don't pretend to be a reporter if that is what you would rather do.","post_message":"What liberal media bias? That's just a figment of your fevered rightwing imaginations."},{"comment_id":"10153548931652550","commenter_b":"my only solution to this and advice to the american government is to stop allowing foreigners to come into the united states... I think this country has the worst imigration problem.","commenter_a":"Who trusts the Obozo regime to make sure no terrorist enter our country masquerading as refugees?","post_message":"Welcome to America: New photo shows newly-married couple who killed 14 people in California last week in a suspected ISIS-inspired attack, entering the U.S. together for the first time last year ... @webpagelink"},{"comment_id":"10152829806276636","commenter_b":"U can't find african american in this kind of situation coz they are at home just waiting for their money from welfare...since when african american have their sense of urgency in going to work?","commenter_a":"Ironically, wasn't there a case in US of an african american single parent who was desperate for a job, left her children (older than this one) in car in car park so that she could attend interview....put in prison and her children removed, that just doesn't seem very fair does it?","post_message":"He'd got half an hour to work before making the realisation..."},{"comment_id":"10153630301063132","commenter_b":"Did they ever catch those fucktards??","commenter_a":"God Bless her and her family!","post_message":"\"I can't understand why they would want the thrill of hurting me like this, hurting my entire family.\""},{"comment_id":"10154497878598145","commenter_b":"So much White Trash in Florida!","commenter_a":"Omg @username I freaked out for a second....","post_message":"Authorities said the couple and the victim's son were having dinner, and when the child refused to eat his food, Stephen Collins became angry."},{"comment_id":"1160655937308596","commenter_b":"Many Muslim women are sick of being told what they are and what they can be from western women who have no clue about their culture, that's why Muslim Feminism had to develop on its own instead being part of the bigger movement, _that's_ sad if you ask me. Feminism should be about equality not about following one group of women's notion about what you should look, feel or talk like.","commenter_a":"I'm seeing a lot of diversity in the Muslim community about the concept of World Hijab Day (non-Muslim women wearing the hijab for a day in solidarity). Would love to get your thoughts on whether it's cultural appropriation, or upholding the more conservative aspects of your faith. I did participate last year, but not sure if I will again.","post_message":"Her \"Ask a Muslim\" booth was a huge success! - Parker Molloy"},{"comment_id":"10155788720365405","commenter_b":"What are you smoking Kate!","commenter_a":"Let's all remember that when Reagan was inaugurated, within hours he was greeting our 50+ hostages held in Iran for more than 400 days. Gov. Walker, you may be the one that will greet them in those hours following your inauguration.","post_message":"In this bad Iran deal, Obama has given up a lot and he hasn't even managed to bring back our Americans currently held hostage in Iran's prisons. We have to stop this reckless and irresponsible deal today. Join me in calling on Congress to stop this deal: @webpagelink"}]
