[{"comment_id":"10156899433320354","commenter_b":"If you're a f****** illegal mexican, get the hell out!","commenter_a":"Illegal immigrants built part of this country cause people like Trumpet hired them! All of a sudden they're bad? Screw you all! Im proud to be a fucking Mexican!","post_message":"“[O]ne party has made it okay to say you can hate people, you can spit on them.” What would you like to tell Julieta Garibay? WATCH:"},{"comment_id":"10156069283810354","commenter_b":"@Kristin ... \"you serious Clark?\" is a quote from the movie Christmas Vacation : )","commenter_a":"Well, when schools in a Tennessee district are banning the USA flag, why not the gay pride flag?","post_message":"“...police reportedly confiscated a gay pride flag…” Will the Left ban the gay pride flag now?"},{"comment_id":"10153702258075779","commenter_b":"Sadly, you're probably right!","commenter_a":"He has been proven over and over to be a business failure, a liar, a walking contradiction, unfit foreign negotiator, bigot, mysoginistist, nuke-happy clown! Does the man have to eat a live baby before people get the hint?","post_message":"We all know for-profit colleges are shady, but how bad can they really get? A former for-profit professor explains why Donald J. Trump's is the worst."},{"comment_id":"849791398402742","commenter_b":"Well you be sure to let all those people know where that magic land is where all those wonderful jobs are just growing on trees!","commenter_a":"I think this is great. People will no longer abuse welfare and will actually get up and find a job.","post_message":"Arizona's Legislature cut $4 million from the budget by reducing the maximum time you can be on welfare from 5 years to 1 year. Critics say that it will cut funding for those who need it and can't find jobs. Supporters say it will encourage more to get off welfare and find work. What do you think?"},{"comment_id":"614711638682250","commenter_b":"So she was stealing from her mother?WTF","commenter_a":"What an idiot...did she say her mom lives there even after he said it was his house?! Also what in the world would her \"niece and nephew\" need from Grainger?? Stop the stupidity people...","post_message":"An attempted package thief who was confronted by a homeowner tried to tell him that her mother lived at the home. The homeowner said he was going to call police, and she dropped the packages and fled. Now the Alhambra Police Department is looking for help identifying her. Read KTLA story here: @webpagelink"},{"comment_id":"1716998008555343","commenter_b":"Me too. Can't concentrate at work","commenter_a":"Sleep in peace. You will be missed.","post_message":"This is what it sounds like when doves cry... #RIPPrince Prince"},{"comment_id":"10153060149946051","commenter_b":"Bitch boy Yu still white nd YUr trash to pussy","commenter_a":"Nothing like white/black trash argueing!","post_message":"When this woman heard what a couple parked near her said, she lost it."}]
