[{"comment_id":"1470099699674042","commenter_b":"And your mom should apologise to the world at large. I think you know why.","commenter_a":"Stfu Ryan. You couldn't figure your way out of a paper bag with both of the ends open. You are an embarrassed part in the political arena.","post_message":""},{"comment_id":"699361250167548","commenter_b":"Terrorist and traitor!!! And an illegal!!","commenter_a":"The Wall of China has worked tremendously for China. Id expect the same results here","post_message":"“Good luck with that…We’ve got serious problems here.”  President Barack Obama addressed Donald J. Trump's plans to build a wall and get Mexico to pay for it."},{"comment_id":"10155151407594575","commenter_b":"Illegals have to hide behind walls to avoid deportation. They build their own walls. Saw absolutely no effects from a day without immigrants, Guess they don't really matter.","commenter_a":"Awesome.","post_message":"Business owners are standing behind their decision to fire workers who participated in \"A Day Without Immigrants\" protests.  They say it's not a political stance but rather a business decision.  \"If you're going to stand up for what you believe in you have to be willing to pay the price.\""},{"comment_id":"677232809133964","commenter_b":"The scumbag needs to be fired .... then she needs to be stripped of her teaching certification!!","commenter_a":"Fire her.","post_message":"This teacher threatened her student if they didn't submit to her beliefs.  She has absolutely no right to try and dictate what her students believe.  Do you think this teacher should be fired immediately?"},{"comment_id":"10153034761287235","commenter_b":"you learn to write, bitch...","commenter_a":"oh boo hoo it's fucking war get a life moron","post_message":"“My uncle killed by sniper in WW2. We were taught snipers were cowards. Will shoot u in the back. Snipers aren’t heroes. And invaders r worse.” -- Michael Moore"},{"comment_id":"382025331922062","commenter_b":"When pigs fly","commenter_a":"Yes","post_message":"Is this good or bad news for the GOP?"},{"comment_id":"10156419008515725","commenter_b":"#VoteTrump #TheDonald #ArrestObama #TrumpTrueAmerican #TheTrumpArmy #TrumpNow #MakeAmericaGreatAgain #TrumpFan #TrumpTrainSNL #TrumpForPresident #CompetentTrump #ItsGonnaBeYuge #NoRefugees #GetOnBoardTheTrumpTrain #BuildTheWall #TakeAmericaBack #Trump #OurVeteransMatter #WomenForTrump #TrumpNation #GeorgiaForTrump #CitizensForTrump #TrumpBreathOfFreshAir #MerryChristmasPresidentTrump #LoveTheDonaldsTone #BalancedBudget #TermLimitsForCongressAndSenators #GodBlessDonaldJTrump #GodBlessAmerica","commenter_a":"Americans are sick and tired of being on the back burner . We are the American people who work and should have a voice . We need a President whos gonna have our backs and Trump your it .","post_message":"People like what I say, people respect what I say. I started a discussion that needed to happen. #GOPDebate"}]
