[{"comment_id":"10153218446741051","commenter_b":"she wont care, she has another kid to take her spot. i bet she will continue to see him, and probly get married. sick nasty world!","commenter_a":"That is one sick family hope that mother feels real good abouit that sex, it cost her daughter and grandchild[s life.","post_message":"A pregnant lady walked in on her husband with another woman. When she realized who the woman was, she killed herself."},{"comment_id":"1440691939283888","commenter_b":"Your point Is right. This woman shouldn't have so many children if she's can't even provide them basic needs for them... oh wait... we the tax payers do that for her!","commenter_a":"I think what Eddie did was fantastic and shows what a caring heart he has. On that note, hell, if it worked for her might as well try. I'm a single mom of a 12 year old. His dad passed several years ago. I'm a veteran of the US Navy and served during Operation Iraqi Freedom. I'm a teacher that works hard for all I have, and I have thousands in student loan debt (like many other college graduates). Would anyone like to give me free money so I can spoil my son with all the latest technological gadgets? *please, before you comment about how I'm greedy, be happy for this woman. I am happy for her and I don't actually expect to receive, nor do I want any money from anyone. It just seems that this story is a \"feel sorry for me\" bit. We all have our hardships, ...","post_message":"Down on her luck, facing eviction with six children hopeful for gifts during the holidays, Tyshika Britten turned to Craigslist for help, and found it with a $10,000 donation from Pearl Jam's Eddie Vedder.  >>@webpagelink"},{"comment_id":"10156568887000725","commenter_b":"@username STOP dreaming about Hillary, she's bad news, and will never get elected...thief, lier, does NOT care about the American people, WAKE UP !! TRUMP, 2016...","commenter_a":"Today - One Year from Today - Donald Trump will be in his second day in the White House as POTUS and the Obamacare bill will be burning in a barrel on the south lawn.","post_message":"Donald Trump 1st Republican Presidential Candidate to Beat the Iowa Bureaucracy and Figure Out How to Easily Access Caucus Locations. #Trump2016"},{"comment_id":"10154379177365579","commenter_b":"Thats illegal zach. You have to come here to get it.","commenter_a":"If only he lowered the debt, defeated terrorists, raised the employment level, etc. as well as he cracked jokes.","post_message":"FULL REMARKS from President Obama at his final White House Correspondents' Dinner."},{"comment_id":"1602376966724515","commenter_b":"@username I am fully aware of who I have voted for since 1992. Hillary Clinton put herself in this position by NOT doing what's right and serving HER own interests. Public Service is a privilege and shouldn't be abused. I look forward to more ethical women running for President in the future, hopefully in my lifetime.","commenter_a":"She puts herself in a coma just hearing herself!! Her own husband is so unimpressed, HE doesn't know her campaign slogan!!","post_message":"LIVE NOW: Hillary Clinton early vote rally, Cedar Rapids, Iowa"},{"comment_id":"796446703862614","commenter_b":"#NoBanNoWall because imigrants, Muslims and refugees are #HeretoStay","commenter_a":"Please Senator, stay strong and resist. Use your resources to unite the Democrats and fight this atrocity! Fight for what is right, just, Truly American.","post_message":"As a child, I witnessed the refugee crisis borne out of people fleeing the Khmer Rouge and Pathet Lao in Southeast Asia with my own eyes. I’m proud that our nation acted during that crisis to take in refugees, but I remain motivated by the knowledge that we could have done much, much more. The Statue of Liberty isn’t engraved with do not enter signs, it is proudly emblazoned with ‘give me your tired, your poor, your huddled masses yearning to be free.’ This is a quintessential American value and though we’ve not always lived up to our ideals, the President would do well to remember that we cannot afford to turn our backs on them, especially today—Holocaust Remembrance Day.   We are a nation that leads with strength—a nation that knows ‘the only thing we have to fear is fear itself’—not a nation that cowers in fear when faced with difficult choices. The America that I know is not one that slams its doors on families and children fleeing barbarism and terror, but one that shines brightly as a beacon of hope for all human beings. Giving in to our fears, as the President has done, is not the action of a strong country. Today’s order will ultimately serve to weaken our own national security, playing into our enemy’s hands and helping convince another generation of young people simply seeking safety that America is at war with them."},{"comment_id":"10152822135907434","commenter_b":"You are no gentleman.","commenter_a":"Sure, dude.","post_message":"\"It’s not just about me. It’s about all of us accepting one another.”"}]
