[{"comment_id":"1244580435606816","commenter_b":"GET THOSE ANIMALS OUT OF HERE ....PLEASE PEOPLE GET THEM OUT.!!!","commenter_a":"30 minute response time? Sounds like they were having their dinner first.","post_message":"So grateful, so eager to assimilate..."},{"comment_id":"10152816607284877","commenter_b":"Girl you better zoom in! Boom","commenter_a":"Yet not a word about the lady in black. They can all kick rocks!","post_message":"Oh boy, they're coming for Michelle Obama for not wearing a headscarf in Saudi Arabia. Read more about her critics below. Grio fam, this seems foul to us. What do you think?"},{"comment_id":"1339369766115783","commenter_b":"There are so many other places to shop.A woman`s dignity is valuable to her self esteem.","commenter_a":"I still think this is another part of Obama's plan to cause unrest and confusion so he can carry on the New World Order Plan. Wake up folks the end is almost here.","post_message":"@webpagelink"},{"comment_id":"859635514085473","commenter_b":"Go home ma","commenter_a":"If she is going to run like a man then she should not be treated any differently than a man would be.","post_message":"After laying out plans to 'run as a woman,' Hillary Clinton is outraged at a Republican for bringing it up"},{"comment_id":"1114940968546374","commenter_b":"One man and one woman, Not 4 men and one woman. Stone her!","commenter_a":"Maybe she have life in prison since she likes jail so much.","post_message":"This is honestly what it's all about..."},{"comment_id":"963331227036554","commenter_b":"So could Samsung actually be catching up?","commenter_a":"Eh...not really impressed enough to upgrade from the 6. I'll wait till the 7!","post_message":"Our first look at Apple's new iPhones:"},{"comment_id":"1513869335297739","commenter_b":"I would like to know how to follow the day to day Congressional sessions. I would also like to know how to find out who in Congress reported for work when Congress was in session. I would like to know the Congressional schedule, pay, vacation time, healthcare benefits including what company handles their care. I would like to know of any other benefits they receive, as an example- I believe there is a gym in the Congressional building. These are the questions I want answered. Please direct me to the places I can find these answers. Thank you and your team for the hard work and excellent reporting all year. I become informed by the you and sound very smart as I share it all. Hah! Rest up and enjoy the holidays.","commenter_a":"We will need you more than ever in 2017. Keep up the critical thinking, it seems to be a lost art with so many. Merry Christmas.","post_message":"Just a quick note to our BillMoyers.com readers that we are going on a much-needed holiday break. Thanks to all of you for reading, sharing and commenting on our content in 2016. We’d love to hear your thoughts on what you’d like to see from us in 2017. Please share your ideas in the comments section below. And have a wonderful holiday! See you in the new year."}]
