[{"comment_id":"985301294841116","commenter_b":"@username woman you dip.","commenter_a":"Can’t we call Ted Cruz by his real name Rafael Eduardo Cruz? He never misses a chance to call the President “Barrack Hussein Obama“. including his middle name to make sure we all know he’s a “Muslim“….and good old “Ted” was born in the united states of CANADA!","post_message":"Do you agree with the ruling?"},{"comment_id":"1216942571674495","commenter_b":"Deceitful lying criminal. God have mercy on those who vote for monster Hillary. She will destroy this country with her crimes.","commenter_a":"How telling!","post_message":"Hillary v. Hillary!"},{"comment_id":"10154432896669342","commenter_b":"The first 2 females that get drafted if there is one better be his kids.","commenter_a":"What they need to do is send all the government babies to serve leave the women alone","post_message":"The timing of Obama's support for women registering for the draft makes it mostly symbolic, but where do you stand on the issue?"},{"comment_id":"1008491449210603","commenter_b":"@username You are scum simple as that!","commenter_a":"she was a drug taking piece of trash...","post_message":"Bobby Brown: 'Bobbi Kristina Brown was and is an angel'"},{"comment_id":"10152881196379753","commenter_b":"So would you rather have the Transgender in the men's bathroom? Chances are SHE Is attracted to men. So would you like HER to go in there and check you guys out? Should lesbians have to use the men's bathroom then? Fucking. Ignorant","commenter_a":"Everyone should boycott planet fitness \" Political bullshit run foul again! Hope the woman sues there ass off.","post_message":"This woman thought she saw a man using the ladies locker room at her Planet Fitness. When she complained to the front desk, they responded by cancelling her membership.  Should transgender men who identify as women be allowed to use women's bathrooms/locker rooms?"},{"comment_id":"10153868585859203","commenter_b":"She wouldn't fuck any of you dude bros anyways.","commenter_a":"She looks great. Bold, sexy, unflinching, human.","post_message":", gross, strong, thin, fat, pretty, ugly, sexy, disgusting, flawless, woman."},{"comment_id":"10152707448786051","commenter_b":"Are you calling ma a stupid whore","commenter_a":"Humans aren't very nice they are constantly making fun of people for every reason possible so don't be shocked","post_message":"When this police officer heard his co-workers mocking special needs children, he lost it."}]
