[{"comment_id":"10153078064342994","commenter_b":"we're on that list so maybe. I NEED TO FLUSH SOME ICE","commenter_a":"Alexis Nichole Fortune hoping we close. 😩","post_message":"Our site has the complete list of school closings. Stay warm out there!"},{"comment_id":"1238344686206387","commenter_b":"This is so nice to see. Females in this world matter very much.","commenter_a":"Jean Daniel Boixo","post_message":"These young Pakistani girls are aiming to knock out gender stereotypes. (via NowThis)"},{"comment_id":"10153010169898984","commenter_b":"Truth or not, IMPEACH him now. He is not good for America or for the American people.","commenter_a":"He's another Teflon Politician!!!! Makes no sense!","post_message":"[Best of 2014 Compilation] Back in Feb. 2014, Steven Seagal had some pretty harsh words for Barack Obama. Surprise! There are actually some actors in Hollywood who don't follow the party line..."},{"comment_id":"10154071183936336","commenter_b":"#obamaville #EVILislam #muslimBrotherhood. #NOmoreDemocrats #SouthCarolinaForTRUMP!","commenter_a":"There is either more to the story or it's the usual Obamma admin ways.","post_message":"\"After acting to protect a child from sexual assault from an Afghan commander, SFC Martland was punished and could be kicked out of the military at any time,\" said Jay Sekulow, of the American Center for Law and Justice."},{"comment_id":"10155222410880354","commenter_b":"Oobama and his stupid bastards.","commenter_a":"Deport EVERY SINGLE ONE!","post_message":"Obama Administration Sets Up Hotline for Illegals Seeking Amnesty Under Obama's New Policy."},{"comment_id":"476672599181287","commenter_b":"Speaking of closet queens... overreact much, Michael???","commenter_a":"This is one of the reasons that many on the right hate him. They believe that when people are treated equally, they (personally) are somehow diminished.","post_message":"President Obama highlights why the Kenyan \"non-issue\" of LGBT rights is an issue."},{"comment_id":"1413505585331340","commenter_b":"YOU are ONE CRAZY WOMAN!!!! You just wait.... Trump is going to eat you alive during your debates! Trump/Pence2016!!!","commenter_a":"I think she has short circuited or blown a fuse.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"}]
