[{"comment_id":"10154462885161636","commenter_b":"The frequency of rape is not higher amongst Muslim migrants Red.","commenter_a":"3 white men gang rape a 15 year old boy while the country is worried about banning Muslims. Unbelievable","post_message":"At a fetish party"},{"comment_id":"527878314072059","commenter_b":"Put her in jail!!!!!!","commenter_a":"To recap: Hillary is \"the devil\" and has \"hatred in her heart\" and Trump is going to appoint a special prosecutor to \"put her in jail.\" This is how a democracy slouches into totalitarianism.","post_message":"Your reaction to the second presidential debate?"},{"comment_id":"884276841629012","commenter_b":"I'm not for it but I will say this: the government has known and has collected millions of dollars from illegals with fake social security numbers. Republicans and democrats both. To work here the illegals have had to come up with a fake s.s. number and pay on every check. This is a fact. I've seen it, known people who pay into it and will never see a dime from it. Our government is full of lies. They take that money and our legal money and blow it. Like I said I'm not for illegals but don't be blinded any side of the aisle in Washington D.C.","commenter_a":"This ia considered buying votes and that's illegal...but then everything Obama does is illegal. ..STOP HIM","post_message":"Thousands of illegal aliens could begin collecting from Social Security as a direct result of the president’s executive amnesty."},{"comment_id":"10153880483259705","commenter_b":"Samantha, this is your life.","commenter_a":"The driver?","post_message":"Mind... doesn't... understand..."},{"comment_id":"1241740062517749","commenter_b":"Keep Hillary & Bernie OUT OF MY STATE!","commenter_a":"Sauce","post_message":"Donald Trump speaking in Denver at Western Conservative Summit"},{"comment_id":"1438259686194057","commenter_b":"Say No to drigs","commenter_a":"I tired this in high school a few times when it was sold in gas stations. Knew a girk that made it too. So dangerous! Just smoke pot. I'm glad Co legalized weed and got rid if this stuff.","post_message":"Everything you need to know about K2, the drug linked to a mass overdose of 33 people in New York: @webpagelink"},{"comment_id":"638139039652611","commenter_b":"They paid her less cause she sucked ass!","commenter_a":"It's true cause Brian Williams was there","post_message":"YEAH!!!!!!!!!"}]
