[{"comment_id":"495888253922598","commenter_b":"I don't know many people that leave the doors to their homes unlocked when they leave for the day, when they go to sleep at night or just go about living with their family and friends. Also I don't know anyone that does not ask guests to leave at some point after a visit. Additionally most people use common sense to screen individuals that enter their homes. If the individual being considered as a guest is affiliated with a suspect group we error in the side of caution to protect or family and do not invite that individual or their affiliated friends into our home. In comparison to legal and illegal immigration into the USA it seems like the Democrats are telling us to unlock your doors while you sleep, don't use the locks on your doors while you watch TV, and when you leave for the day leave your ...","commenter_a":"The parallel is Jews = Christians. Not hitler to trump. Hitler killed the Jews. Not the other way around. Radical Muslims are killing Christians and Americans. Get it ?","post_message":"It would not surprise me either! What I am seeing & hearing from around the country is disturbing. Time for us all to #MakeAmericaGreatAgain. Remember! We need to energize EVERYONE to get out and VOTE!#Trump2016"},{"comment_id":"1099626483393732","commenter_b":"RINO revolt began with Romney. We shall soon see a series of similar dogs.","commenter_a":"Ventura is a jackass!","post_message":"Someone other than Michael Bloomberg is considering a run for president.  Could this controversial figure make an impact on the 2016 race?"},{"comment_id":"10156390039050725","commenter_b":"That would be the best way to guarantee Hillary into the White House!","commenter_a":"I will!","post_message":"A new poll indicates that 68% of my supporters would vote for me if I departed the GOP & ran as an independent.   @webpagelink"},{"comment_id":"1598639267107557","commenter_b":"#2ChroniclesChapter7V14 #DrainTheSwamp #OneNationUnderGod #InGodWeTrust #TrumpPence2016 #UCMJ4President #UCMJ4Congress #UMCJ4Senate #USConstitution #BillOfRightsNonNegotiable #Paperballotsonly w/ID #NoAmnesty #AmericaFirst #PledgeOfAllegiance #NationalAnthem #ProNRA #ProLife #Pro2A #NoUN #MAGA #Election2016","commenter_a":"Why are tax dollars being spent on our so called president campaigning for her. ..should be illegal","post_message":"Donald J. Trump finally did it. After taking a lot of punches from the first lady, he unloaded on Michelle Obama, dropping an epic truth bomb on the president's wife.  What do you think about what Trump said?"},{"comment_id":"939799776150807","commenter_b":"Screw her!!!","commenter_a":"They have been alright with it as long as it worked inn their favorr.","post_message":"Democrat Senator Introduces Bill to Abolish Electoral College @webpagelink"},{"comment_id":"1201176699902507","commenter_b":"Beverly, there's already plenty of porn out there. I highly doubt anybody's going to get their jollies from our veiny mom-boobs. In all seriousness, though, in 99℅ of cases, you can't see any more breast than you would if wearing a bikini. And yet, we don't shun the beach for fear of perverts with cell phones, right?","commenter_a":"There is a big difference between how breastfeeding is depicted here and what the majority actually look while breastfeeding in society. , Here its done Discreetly and beautifully, If all women breast fed like this NO one would have issues with it,","post_message":"\"Let's support mothers to breastfeed anytime, anywhere.\""},{"comment_id":"10153635432868690","commenter_b":"Its not and has never been your land. You have no heritage nor history there except at best been that of tenant felaheens the Ottomans brought to milk the land for them or at worst; as more than half of you people are, illegal immigrants from the surrounding Arab states who flooded the land from the 1920s to 1940s as migrant workers and mujahideen who came to steal the land from the Jews. That your right of return better get its head swivelled to the Arab states. Besides, the Jews you ran out of the Arab states also has the keys to their doors and need their properties you stole and their own right of return.","commenter_a":"You will return and all Muslims will pray in Israhell won't last more than a decade","post_message":"\"For Palestinians to give up the Right of Return- even those who have no intention of ever returning - is to acknowledge that we are lesser beings; that kicking us out of our homes and ripping our hearts out was okay. It is to affirm that we do not deserve our own history and heritage; that it was okay for our proud parents and grandparents to wither in the ashes of their memories inside refugee camps unfit for animals.\"  Palestinian novelist Susan Abulhawa explores the meaning of the Right of Return."}]
