[{"comment_id":"991078264282036","commenter_b":"Tom Schmidt I beg to differ !!!!!! She is very much for woman and for men to!!!!!!","commenter_a":"Women let's unite for Hillary. President Hillary.","post_message":"Raising the minimum wage, paid family leave, child care: These aren’t just women’s issues -- they’re also family issues and economic issues."},{"comment_id":"1183208918440780","commenter_b":"Stupid women. I'm one but Savannah is a regular person, comfortable in who she is. Why must she have makeup on after just having a baby. I'm not going to criticize her for that. Some people just don't know where their nose ends. Leave peoples' business alone. Who are you to make it your business?","commenter_a":"Seriously? People care whether or not she's wearing makeup? Giving birth is one of God's greatest gifts and I doubt He - nor Savannah's precious baby- cares about her beauty routine.","post_message":"\"We don't need any 'tips' on how to look good without makeup. We all look good without makeup. We just don't realize it until we realize what life is truly about.\""},{"comment_id":"1516899938343259","commenter_b":"Yet when guys write this type of stuff all women are emotionally hurt ad need to bitch to the moon. Regardless, these women are virtually worthless. Never date a feminists they have nothing to offer a man at all. Zero. Let them die 60 and single","commenter_a":"I can say with 100% honesty that I would avoid every one of those selfish cunts as if they carried the plague. And i feel certain that these are the same daft cunts that will cry about the matriarchy if men were to make an article just like this.","post_message":"\"If someone was quite a weird child, he tends to be a great date.\""},{"comment_id":"256034241501428","commenter_b":"Hahah aww","commenter_a":"@username it'll be belated but you'll get it lol","post_message":"Pretty much #ValentinesDay #WSHH"},{"comment_id":"10154333697561509","commenter_b":"@username You jsut described yourself and your mother. You crazy old lady","commenter_a":"Have you noticed who the Trump haters are? I have.......Go Trump.","post_message":"\"Six months out from Donald J. Trump's foray into American politics, the national media is finally coming to terms with a hard truth: It's Trump's world, and they're just covering it.\""},{"comment_id":"10153247018494087","commenter_b":"Bad cars cause people to die so do the bad guns!","commenter_a":"Yes it is Donald! The libs are too stupid to realize it! Look at Chicago, the more gun control, the more shootings.","post_message":"“The gun laws have nothing to do with this,” Donald J. Trump said. “This isn't guns, this is about really mental illness. And I feel very strongly about it.\""},{"comment_id":"1546700958971228","commenter_b":"Heaven forbid that us stupid stupid people should be allowed to have some one tell us the truth! Good Grief!","commenter_a":"But why","post_message":"BREAKING: You’ll Never Believe The Reason Greta Van Susteren Is Losing Her Job. This is terrible. We love her. Can we get 5,000 'LIKES' to Greta on the air?"}]
