[{"comment_id":"10153272380601167","commenter_b":"Never trust a liberal woman with three names.","commenter_a":"Obama still has his college records sealed to hide that his grades weren't as good as Bush's.","post_message":"C'mon, conservatives, don't sell yourselves short. You did vet Obama, remember? Obama's a Muslim. Obama was born in Kenya. Obama forged his birth certificate. Obama is the son of Malcolm X. Obama's hiding his gay past!"},{"comment_id":"651967471607752","commenter_b":"How does she stand on marriage! Does she believe it's alright to have girlfriends when you are married??","commenter_a":"I voted for Hillary last time and Ive always been with her until now, and as of now Im unsure thats because of 3 issues...Healthcare, College, and Marijuana. Obamacare is only so so....singlepayer system is possible because I think we are the last 1st world country without it.......free college is possible because we already public school k-12, extending it through college would basically just be keeping up with the times. Heck so State already let their kids go to college their final two years and its included wiht the public system...so we are almost there.......last Marijuana....Hillary needs to be more Democrat and less Grandma on this issue....even the Republicans are seeing the light on this...actually Rand and Ron Paul both Drs say the harsh laws are worse than the usage. The only reason to keep it illegal is if you are being supported by the prison and pill industries both ...","post_message":"Hillary just became the first woman to win the Iowa Caucus! hrc.io/1RYmIp5"},{"comment_id":"10154241082384170","commenter_b":"@username, I like you a lot, but how is this woman good, when we had sanctions against Iran, she was selling to them like crazy....of course she was trying to save herself and get her numbers up, but just so wrong of her....that's just another one of the many things she did, she couldn't even win the Senate seat in CA...how could she help him win the Presidency? We just all need to stick with the best....TRUMP!","commenter_a":"Uh--oh! I hope he has a portable stage and plenty of microphones. That's her specialty.","post_message":"Smart move, if it pans out."},{"comment_id":"10153756549625667","commenter_b":"No Trump No Hillary, any body else, American have the best.#","commenter_a":"like my page awlad nass","post_message":"As the Iowa State Fair got started 20 years ago, two people were shot dead in the exhibitor campgrounds."},{"comment_id":"10154038010859205","commenter_b":"That's because it turns out she actually is a nasty woman. With a lot to hide.","commenter_a":"Robbie Mook is a terrible liar. Look at that body language!","post_message":"A blog called “True Pundit” said there were reports of Hillary Clinton asking why the government couldn’t just assassinate Julian Assange via drone strike. Hillary Clinton’s denial is less than convincing."},{"comment_id":"10153956657931336","commenter_b":"Amen she needs to go to jail u r correct","commenter_a":"112 million raised and supposedly all from minorities and women. This woman is the single biggest threat to our country. She is actually worse than Obama and as we know that is as bad as it gets. The nazi queen needs to go to prison","post_message":"The Hillary Clinton campaign said that puts her total raised in 2015 to spend on the presidential primary campaign at $112 million."},{"comment_id":"10153904419513984","commenter_b":"She's an ass","commenter_a":"Yeah the photo says it all...\"wha happened?\". Stick to acting, your moral compass is effed up. Be a kinder human being to your fellow humans, not to tou 1%er peers. Thiugh phony and shallow does fit you well","post_message":"She's the biggest female star in Hollywood right now, and she just made a sickening claim about Christians and the cross of Christ.  This is just disgusting.   She has a new movie out. Let's make sure she doesn't make a dime off of us!"}]
