[{"comment_id":"10152885727286336","commenter_b":"All women are trained assassins HAH","commenter_a":"If it's true, hopefully he isn't that stupid to actually claim that","post_message":"NASCAR driver Kurt Busch claims his ex-girlfriend, who accused him of assault, is a trained assassin."},{"comment_id":"10155014119221178","commenter_b":"Democrats have always gotten away with MURDER!!","commenter_a":"Accountability was not a word he knew--or enjoyed.","post_message":"Talk about a major understatement from The Daily Beast."},{"comment_id":"10154662154026323","commenter_b":"God help America and American people if these two women get into the White House.","commenter_a":"The nastiest of women. Apparently Nasty women are UN shills hell bent on overthrowing the rule of law in America, and worldwide. Cunts.","post_message":"“Get this, Donald. Nasty women are tough, nasty women are smart, and nasty women vote, and on November 8, we nasty women are going to march our nasty feet to cast our nasty votes to get you out of our lives forever.”"},{"comment_id":"177307306103129","commenter_b":"Wrong! Never said in his first 30 days","commenter_a":"Didn't he defeat ISIS already? He said he would in his first 30 days.","post_message":"Join us as President Donald J. Trump delivers the Weekly Address."},{"comment_id":"10153147185484342","commenter_b":"Bruce Jenner is a woman, this lady is black, and I'm a billionaire.","commenter_a":"Since she was 5? Then this just didn't happen since she entered into adulthood. She had a identity problem since she was a kid and I blame her parents on that because they should've noticed it way back then. To all you parents out there who have little kids, pay more attention to your kids.","post_message":"\"I was drawing self-portraits with the brown crayon instead of the peach crayon.\"  #RachelDolezal has broken her silence, saying she started identifying herself as black around the age of 5."},{"comment_id":"1725539231054043","commenter_b":"Big wall!!","commenter_a":"I read the interview with Kirsten. It was great and it does reveal a side of Donald Trump that we don't see at rallies. Very nice!!! Trump 2016!!!","post_message":"A very interesting piece, by a very good writer, Kirsten Powers."},{"comment_id":"955398181243627","commenter_b":"And we will ship them out idiots","commenter_a":"BIGGEST WANKER MUSLIM OF ALL TIME","post_message":"This is only the beginning..."}]
