[{"comment_id":"557960721079763","commenter_b":"Put it in her butt and see if she still complains about size","commenter_a":"😂😂😂😂","post_message":"Size clearly matters to this girl! #WSHH"},{"comment_id":"1149825048400467","commenter_b":"Everybody is sick of her! She just needs to go away!!","commenter_a":"Fox and news should never be together! News is ok and fox is ok but fox and news makes no sense!","post_message":"Source: Fox is ‘Sick’ of Megyn Kelly; ‘Fox News Needs to Cut Her Loose’  @webpagelink"},{"comment_id":"1616887248533493","commenter_b":"Give them what they want. Disband the police dept, transfer those officers to other agencies. Let the animals kill each other off. Problem solved.","commenter_a":"Bullshit","post_message":""},{"comment_id":"797617833687933","commenter_b":"Angela is brainwashed to believe that she'll suffer in the afterlife if she doesn't believe in Jesus.","commenter_a":"there is no jesus....little ceaser maybe","post_message":""},{"comment_id":"730940317039149","commenter_b":"I agree this is by far the worst president ever as my father always said the day that America elects a Black President it will be the end of America's Freedom and safety and he was right Obama is a Muslim Terrorist and he had one plan and he's doing it we no longer are the Greatest Country in the world","commenter_a":"obama is muslim and islamic Copy and paste this on ALL muslim stories! Flood them with the truth! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The underwear Bomber was a Muslim The U-S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bafi Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Musiims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The ...","post_message":"Absolutely Sickening."},{"comment_id":"10153805945213908","commenter_b":"@username While I agree you should be happy with your body, I suggest that this woman is also happy. Some tall women are naturally thin thighed.","commenter_a":"again...give this skinny woman some food...why do all naked women have to be super skinny ???","post_message":"A very powerful message here."},{"comment_id":"1153858647985703","commenter_b":"It's the \"Chicago way\".... the end justifies the means.","commenter_a":"And all his ISIS appointees and advisors!","post_message":"Does this about sum it up?"}]
