[{"comment_id":"1815590955374804","commenter_b":"@username good luck when the immigrants trying take over your country good luck","commenter_a":"People who don't like DT should move to Canada like all the other celebrities. I forgot nobody is moving. LOL.","post_message":"It's Inauguration week and The Donald is hard at work at Trump Tower making final preparations. Who is meeting the president-elect today?"},{"comment_id":"1297388806970322","commenter_b":"Being ashamed of himself is not enough. Fire this idiot and boycott the idiots who hired him, and him being a professed republican. Rino.","commenter_a":"Con Hannity always a victim! Lester Holt is a registered Republican. FACT!","post_message":"The numbers don't lie."},{"comment_id":"10154251884613701","commenter_b":"Oh my wow...this bitch right here is why we need to stop immigration...","commenter_a":"It kills me that LGBT wants special rights when they are going against God's Commandments. It's a fact that the LGBT have mental illness, look it up. America was not built on Gay rights. Also what about people of color we are still fighting for our rights in 2016.God commanded that Marriage should be between a man and, a woman. We are living in the last days. Sodom and Gomorrah. You can't say you believe in God when God condemns homosexuality.","post_message":"The 1969 riots at the Stonewall Inn launched the modern gay rights movement and the annual New York City pride parade."},{"comment_id":"1117421238280665","commenter_b":"Mary please do your homework. It would be great to have a woman president but not her. She's a chameleon. If she hasn't flip flopped on something that matters to you just wait...","commenter_a":"Hillary Clinton is the single most qualified candidate in the race, and of the last 60 years. she is the right woman for the job, and in 284 days, i will be proud to call her Madam President.","post_message":"EXCLUSIVE: Vice President Joe Biden reveals what he thinks about the US electing a female president. \"This country's ready for a woman.\""},{"comment_id":"10153310258470090","commenter_b":"www.thefightforjustice.com Former bank employee goes head to head in the courtroom against bank and lawfirm-10 years and counting- Many exposed and the list is growing!","commenter_a":"Hideously profane y","post_message":"All of the above. We want to know WHY you don't want another Clinton in the White House. Tell us here: @webpagelink"},{"comment_id":"1187655654624295","commenter_b":"You couldn't even please your husband, what makes you think you can please us? #NeverHillary","commenter_a":"Nice","post_message":"In the presence of practical, tactical brilliance at Hamilton: An American Musical."},{"comment_id":"10153072205104614","commenter_b":"Let us hope this woman wasn't aware of the situation. Because otherwise they're both sick horrible people.","commenter_a":"I hope this pig gets sodomized repeatedly. ......human garbage.","post_message":"BREAKING: A 30-year-old man Newhall man has been charged with sexual assault and murder in the death of his 19-day-old infant daughter. Matthew Brendan Warner led investigators to the baby body less than 12 hours after the infant had been reported missing over the weekend. He was arrested on suspicion of murder. On Tuesday, prosecutors announced he had been charged with aggravated sexual assault, torture and other alleged crimes. Read KTLA's story here: @webpagelink"}]
