[{"comment_id":"894267073955650","commenter_b":"She makes me sick!!!!! Gag!!!","commenter_a":"Not even smart enough to keep her mouth shut.","post_message":"OUCH: Meet the Press plays brutal montage of Hillary Clinton flip-flopping on various issues @webpagelink"},{"comment_id":"1745816418974356","commenter_b":"This woman's head is bad.","commenter_a":"That's the problem, she just let 4 Americans die, you idiot.","post_message":"Whoopi Goldberg: Gee, so sorry that you find the deaths of innocent Americans \"boring.\" But for the rest of America, we find the Benghazi massacre reprehensible and unforgivable. And on behalf of the families who can never see or hug their loved ones ever again, We the People demand transparency, honesty, and justice. So get over yourself and your need for constant amusement, Whoopi. Hillary lied, Americans died. Signed, We the People"},{"comment_id":"1596477097312385","commenter_b":"Illegal immigrants must not vote. That is against the law. All people must be made to show ID to make sure illegal immigrants are not voting and to make sure nobody votes more than once. It is simple common sense. For the very rare citizen who may not have ID they can assist them and pay the fees. It would only be a very few people. But everybody must show ID to vote and prevent voter fraud.","commenter_a":"Why do judges think only black people don't have IDs and considering everyone needs an ID for just about anything else, why would anyone not have an ID? All this law does is make sure there is not voter fraud...so in essence this ruling shows me that the court wants voter fraud, it's the only thing that makes logical sense. I think it may be time for other countries to oversee our democratic process or we need to stop telling them we will oversee theirs because we obviously have no moral high ground to speak on the subject in other countries.","post_message":"Unreal."},{"comment_id":"10154154937686409","commenter_b":"Very smart wife! You'd do well to follow her example!","commenter_a":"Beg to differ tree hugger. My wife warms up her 4Runner for five to ten minutes. I never warm up. Her car is a 2006 and runs like new. I've gone through two cars. And '06 and an' 08","post_message":""},{"comment_id":"691233461036607","commenter_b":"Every \"illegal immigrant should be deported\" good let's start with Malenia Trump","commenter_a":"Every last illegal immigrant in this country should be deported and all charged with a felony for being illegally here. If they come back again, charge the immigrant with two felonies and put them in prison, then deport them again when their sentence is up. If there is a third time for the immigrant to come back, give the natural life sentence. People that come here, should do so legally.","post_message":"Obama deported a record 1.5 million people in his first term."},{"comment_id":"582952285239212","commenter_b":"Vote Trump! Not crooked Hillary","commenter_a":"Trump is nothing but a narcissistic coward. He likes to dish it out but he can't take it. Semper Fi","post_message":"Watch: POWERFUL and MOVING... This WWII Veteran and former POW is literally brought to tears in this impassioned plea to Americans to keep Donald Trump away from the presidency. Let's make this brave veteran go viral. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155879788485354","commenter_b":"Send them all back. Stop immigration period. Let's get a handle on it before starting it back up. We need to police our new immigrants better.","commenter_a":"FOOK AMNESTY","post_message":"Some truly shocking statistics in this article..."}]
