[{"comment_id":"10153065488357217","commenter_b":"Because you are another dependent brain-washed puppet and the worst part of you think you're on the right side! Praying for you!","commenter_a":"Well done Kentucky clerk! And you masonBBC don't try to make real Christians look like some bunch of homophobes! Shame on you @username! You should apologies!","post_message":"UPDATE: AP reports Kim Davis, the Kentucky clerk who won't issue marriage licences, and all her deputy clerks have been called to appear at a federal court hearing on Thursday morning.   County Clerk Kim Davis eventually came out of her office, but she said she would not issue any marriage licences.  \"Under whose authority?\" she was asked. \"Under God's authority,\" she said."},{"comment_id":"552329344892078","commenter_b":"Impeach her! She's suppose to be UNBIASED. What a joke","commenter_a":"Term limits asap","post_message":"Supreme Court Justice Ruth Bader Ginsburg bashes Donald J. Trump, calling him \"a faker\" and criticizing him for not releasing his tax returns."},{"comment_id":"10153152969586955","commenter_b":"She'll never be president.","commenter_a":"She's going way down in polls.","post_message":"HILLARY 'WIPED HER SERVER CLEAN'"},{"comment_id":"10152621933698067","commenter_b":"You nuts lady!","commenter_a":"Of course it is not free but at least your taxes are going to education instead of wars all the time. I can't believe how many Americans are so brainwashed against a little socialism. You guys at \"the top\" gotta get back to basics. The greed in your country is appalling. We are the lucky ones to still have subsidized healthcare. Taxes should go first to education and not onky spelling and writing, but to teaching life-skills, budgeting, health. 2nd to health including dental health. Tax the crap out of the fat and sugar laden processed foods. Start caring for community and stop supporting the conglomerates. Yay for Obama. The best president since JFK, only mote moral in his private life.","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"10153214804429641","commenter_b":"Why are these counties better to mothers?","commenter_a":"Ironic, the top five are all Nordic!","post_message":"These are the best and worst countries for mothers -- how does your country stack up? @webpagelink"},{"comment_id":"971619749553192","commenter_b":"Wtf","commenter_a":"Saudi Arabia is holy land and not a country prepared for war, and have no military status. Iran should know better and could not even beat Sadaam at the time","post_message":"\"Because a war between Saudi Arabia and Iran is the beginning of a major catastrophe in the region... For sure we will not allow any such thing.\" @webpagelink"},{"comment_id":"10153739265778984","commenter_b":"No need to wonder what you are, being from Liberfornia and all.","commenter_a":"I 100% support her staying in jail until she agrees to do her job as ordered by a federal judge.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"}]
