[{"comment_id":"10154476724188352","commenter_b":"On God I'll beat this hoe up!! Sick twisted bitch","commenter_a":"Wth","post_message":"Toddlers found chained up in Texas yard covered in hundreds of wounds are now in an 'excellent' foster home and are 'eating like they have never seen food before'"},{"comment_id":"10154493907103352","commenter_b":"Amen and thank you Lord","commenter_a":"Amen","post_message":""},{"comment_id":"1308041469292102","commenter_b":"Yet he never put anyone first ever in his life. You are believing a con man who is very good at conning people like you!","commenter_a":"All of this hate, all of this rage, against one man because he want to make this country great again, says a lot about those who want to stop him, and should be even more of a reason why Americans should vote for him, because he wants to put us first - I think that's a great idea.","post_message":"Show insiders told the AP that Donald J. Trump rated female contestants by the size of their breasts and talked about which ones he'd like to have sex with."},{"comment_id":"817764698322138","commenter_b":"What Melissa said !!","commenter_a":"You know if everyone hates you, you must be doing something RIGHT. Trump isn't an ASS KISSER.","post_message":"\"I understand why he got angry. She was asking insulting questions.\""},{"comment_id":"10156637699435354","commenter_b":"Political whore?","commenter_a":"If the polls leaned toward Bhudism, Hillary would relate to Buddhists.She tries to relate herself to whichever way the liberal winds blow. If one doesn't agree they are homophobic, racist or worse...a conservative.","post_message":"Haters gonna hate..."},{"comment_id":"10152966322040047","commenter_b":"CRIMINAL","commenter_a":"Next they sell them for food ingrediants!!","post_message":"Planned Parenthood continues to defend its ghastly operations. Abortionists have confessed to changing their practices in order to harvest more body parts. Sign and Share our petition - demand that Congress further investigate the abortion giant and end the sale of babies' body parts."},{"comment_id":"323815704455468","commenter_b":"That's why we need someone who isn't a fool. Lindsey, go home, the adults need to take over.","commenter_a":"He should go home...he's really dumb","post_message":"Lindsey Graham needs to _______________."}]
