[{"comment_id":"10154724621788984","commenter_b":"Hey Walmart has glasses 2 for the Price of one One for your dumb Head and one for Your your brown spot","commenter_a":"Lady you need to get your head out!Quit your job cause you are not of sound mind like Hillary Clinton","post_message":"Attorney General Loretta Lynch just issued a message to Charlotte rioters - and something about it immediately raised eyebrows."},{"comment_id":"2108841499340180","commenter_b":"VICTORY FOR TRUMP ! . .FEDERAL PEN FOR THE LYIN' QUEEN !","commenter_a":"Save your money,this election will not be bought","post_message":"Nigerian billionaire Gilbert Chagoury pledged one BILLION dollars to Hillary and Bill Clinton's Foundation. That's billion--with a \"b.\"   Now why would a Nigerian oligarch with a past like his do such a thing?"},{"comment_id":"647096885477917","commenter_b":"If those prostitutes have balls.","commenter_a":"what could black mail TRUMP","post_message":"It sounded like a major development in the unconfirmed allegations that the Russian government had blackmail material on Donald Trump. It's not."},{"comment_id":"10153521258341990","commenter_b":"Stfu","commenter_a":"Respect to this guy! :D","post_message":"#Update: Police say a man who was arrested for weapons and explosive materials wanted to harm today's LA's Pride Festival. @webpagelink"},{"comment_id":"10153540749847452","commenter_b":"Yousef Danial","commenter_a":"Mariah Morgan Savannah Marshall wtf hahaha","post_message":"A suspect wanted for attempted murder hits multiple cars while trying to escape the California Highway Patrol during a chase on the 91 Freeway in Orange County. abc7.la/1NlhVx9"},{"comment_id":"969122396467721","commenter_b":"i wasnt created to have babies..a lot of women arent..","commenter_a":"God created us to have babies, not kill them he doesnt like it","post_message":"And abortion is NOT healthcare!"},{"comment_id":"1173415112684267","commenter_b":"Society is being destroyed by this abomination! Gay lifestyle brought the AIDS virus, now innocent woman and children are dying because of promiscuity, bisexual acts, and gay relationships! Sin has deadly consequences that all in society pay the price for! That's why Rian!","commenter_a":"I agreed ban same sex marriages.","post_message":""}]
