[{"comment_id":"10153277341923188","commenter_b":"I do believe the 'offended' have been organized by an outsider to bombard anyone helping to stabilize the area. It is not Whole Foods, The National Guard or the Police who need scrutinized! It's the Promoters who keep unrest in the media way beyond the time it is newsworthy! Always seems to be when there is a 'Political' issue, Ferguson-illegal aliens, Baltimore- Clinton Foundation and the very questionable donations. Of course the nuke treaty with Iran, etc.! Protesters in both cities started out fairly calm. Then hordes of people started pouring out of the woodwork, looting, burning, destroying, many were not even from that area! How did they get organized so quick? I agree that All Lives Matter in every community. I also believe a huge % of our Police Departments are doing what they have to do with the Thugs who lack any respect for our laws! Rap sheets ...","commenter_a":"So sad they were doing the right thing.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"482111261979454","commenter_b":"She is in another country Germany . We have No rights there to forbid it. But in our country that's a different story all together. If swimming in a public facilities she should abide by laws of that community or township. If theme parks can refuse for you to wear cut offs then the should forbid that attire, and get out. They have more than enough money to put in their own pools. Our own laws presented by our President is destroying our country from within.","commenter_a":"This is going to far!!!","post_message":"A judge just ruled that public pools must allow Muslims to swim in 'Burkinis'.  We're tired of Muslims infiltrating our country. This stops now.  Do you agree that 'Burkinis' are WRONG?"},{"comment_id":"1415272741824926","commenter_b":"If I was as ugly as her I wouldn't be calling attention to my stupidity too !!","commenter_a":"sounds more like Eva Braun more and more!","post_message":"Less than 30 minutes after Donald J. Trump was sworn in as President, MSNBC's Rachel Maddow was calling him Hitler."},{"comment_id":"697700797087165","commenter_b":"No refugees, there only intent to come here is to bring harm to us and destroy our country.","commenter_a":"Yes..... Take care of our own homeless people","post_message":"The refugee program has resulted in the death of two American soldiers. This is sickening. Should the US deny access to all refugees?"},{"comment_id":"10153216710121051","commenter_b":"Piss poor radical Muslim a$$holes!","commenter_a":"Piss poor life guards...","post_message":"Lifeguards desperately wanted to save this drowning woman - but her father refused to let them do it."},{"comment_id":"1249235748461513","commenter_b":"Hillary laughed after getting a child Racist off with 2 months served !!!","commenter_a":"In 1978, Bill Clinton violently raped Juanita Broaddrick in a Little Rock, Arkansas, hotel room, then, as he was leaving, looked at her bloody lip and said: 'Better put some ice on that. Corroborated by five contemporaneous witnesses Knowing full well about Bill Clinton proclivity to sexually assault women, about three weeks after that rape, Hillary Clinton cornered Broaddrick at a party and said, pointedly, just want you to know how much Bill and I appreciate the things you do for him. Do you understand? Everything you do. In the early 1990s, Bill Clinton invited a young female staffer to his hotel room at the Excelsior Hotel in Little Rock, dropped his pants and said, it. As CEO of an organization, Bill Clinton had a young female intern just months out of her teens, perform oral sex on him while he made business calls. That girl name was Monica Lewinsky. ...","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"902035299831892","commenter_b":"Then don't eat the Damn thing, leave now.","commenter_a":"im so sick of people trying to make racism out of nothing u people r pathetic","post_message":"What do you think? Is this food racist?"}]
