[{"comment_id":"905819366142682","commenter_b":"@username if u want to have sex, pay for your birth control. If u don't want to take the chance on getting pregnant, keep your legs together. We should not have to pay for your wants or needs.","commenter_a":"Blunt doesn't think women should have access to birth control and then blocks them from getting an abortion for an unwanted and unplanned for pregnancy.","post_message":"Every day, families in Missouri and nationwide provide loving and safe homes to children in need through adoption. I’m proud to serve as the co-chair of the bipartisan Congressional Coalition on Adoption, and I’ll continue my efforts to help children in need."},{"comment_id":"1675801449377863","commenter_b":"Better yet: Buh bye racist ahole!","commenter_a":"Buh bye, racist!","post_message":"Serves him right."},{"comment_id":"10154595284389888","commenter_b":"Oh for crying out loud. He's pissed because he can't get his bad people in. OMG. People are so childish. Illegal vs legal.","commenter_a":"Why don't U take your Iranian A$$ back to your country and direct movies over their . U don't like it here LEAVE.Sorry POS. And stick that OSCAR where the sun don't shine","post_message":"\"My absence is out of respect for the people of my country and those of other six nations whom have been disrespected by the inhumane law that bans entry of immigrants to the U.S. Iranian director Asghar Farhadi won an Oscar tonight, but chose not to attend the ceremony in response to President Donald J. Trump's recent travel ban."},{"comment_id":"10154274085621756","commenter_b":"Ok ok all color aside its true that all girls are trouble makers!!","commenter_a":"It's not race, but class. If two parents have to work, there's less support for childhood development. Every problem we have stems from a lack of appropriated resources while a fat cat sits happy.","post_message":"Black girls are punished at school at rates that are even more disproportionate than those experienced by black boys."},{"comment_id":"10154040024789160","commenter_b":"If you got a dick,,,, GO F- - K yourself","commenter_a":"Go sway","post_message":"It's Barack Obama's 55th birthday. What's your birthday message for him? (AP Photo)"},{"comment_id":"10154356306731545","commenter_b":"Nude models are not the same as porn. If so no young person would be allowed in the best art galleries in the world. However I agree, I would not show my child porn.","commenter_a":"If our First Lady can be a print \"porn\" star, you can be a teacher! Don't let anyone tell you different!!!! :)","post_message":"A teacher at an all-girls academy in Dallas ISD says she lost her job after word got out that she appeared in pornographic films over a decade ago."},{"comment_id":"1336033269792120","commenter_b":"Lol mybe we all should get a dogs and then all the Muslims will live.Cause thay thank dogs r evil ant that funny .","commenter_a":"He was acting like a mad dog, so he got what he deserved!!","post_message":"When This Muslim Migrant FAILS To Surrender, Police Let Their K9 SHRED Him To Pieces! (VIDEO) LOL! Sorry! Even \"Beggin' Strips\" can't save you now! LOL!!!!!! :D"}]
