[{"comment_id":"10155104152711323","commenter_b":"Wow how fucking sexist can you get.","commenter_a":"I don't know who any of them are but they are pretty.... boring and vacant looking.","post_message":"'These are the kind of women who take pride in saying things like not into fashion I like style, and by they mean that men like me to wear. They think anyone who criticises Disney fetishisation of princesses is just jealous.'"},{"comment_id":"1363879910298702","commenter_b":"Yeah! Stupid Sheep","commenter_a":"Love Bernie Sanders! #feelthebern","post_message":"Bernie Sanders was cheered for like a rock star during his surprise visit to a Verizon picket line in Brooklyn today. Read full story: @webpagelink"},{"comment_id":"10154005970128967","commenter_b":"I was just about to tag you in this haha","commenter_a":"Jack explains why he wanted out of Star wars :(","post_message":"It's no myth, Harrison Ford and Steven Spielberg are bringing Indiana Jones back."},{"comment_id":"10153400709859474","commenter_b":"she will not tell the truth...","commenter_a":"What difference does it make","post_message":"Breaking: Hillary Clinton to testify before Trey Gowdy and the Benghazi Select Committee. Share to demand the truth!"},{"comment_id":"730165010456352","commenter_b":"@username I love women who are well read xxx","commenter_a":"Is price to paid, for this people, crazy,terrorist! ! I don't blame cpd.just keep us safe!!","post_message":"One minute a Chicago Muslim woman was running to catch her train. The next, she was tackled by Chicago police, and it didn't end there. Itemad \"Angel\" ALmatar said she faced more humiliation at the hands of police before being arrested."},{"comment_id":"970465326346278","commenter_b":"Bitch!","commenter_a":"LMAO,at STUPIDITY","post_message":"Elisabeth Hasselbeck doesn't like that Pelosi left the conclusions about the videos to the scientists."},{"comment_id":"10156520680400354","commenter_b":"Atheists can suck my balls.","commenter_a":"Why do all the liberal atheists shit on Christianity on this page so often? Why don't you dis Islam? Why not any other religion? It's pretty pathetic that you join a conservative page with one intent, to act like complete dicks to anyone with a conservative or a Christian belief. Are you trolls being paid?","post_message":"Not EVERYONE is afraid to stand up and be counted..."}]
