[{"comment_id":"1617460714934208","commenter_b":"Hopefully she'll waste away and go away","commenter_a":"Apparently not","post_message":"Since she's not moving to Canada, Dunham could always try eating all that crow."},{"comment_id":"750259701739305","commenter_b":"Until the GOOD cops police OUT theBAD COPS, these arrogant ignorant asshats will continue to terrorize our citizens. NO EXCUSE!!","commenter_a":"I wish he'd get fired!!!!!","post_message":"His tirade was caught on tape."},{"comment_id":"10153469277832093","commenter_b":"You know right off the back it wasn't a girl bc the rims aren't scraped from the curb lol","commenter_a":"Jeffrey id say that his parking skills are top notch.","post_message":"File this under the 'smart criminals' tab. @webpagelink"},{"comment_id":"10153091643525496","commenter_b":"This woman is unreal and needs to get a life!!!","commenter_a":"Bet he won't be excited to see her any more! What kind of aunt does that! She should be ashamed!!","post_message":"The woman says her nephew, whose mother died last year, was so excited to see her arriving at his birthday party that he caused her to break her wrist: @webpagelink"},{"comment_id":"10153206942041509","commenter_b":"F that Benghazi btch !","commenter_a":"Hillary Clinton 2016!..:)","post_message":"Will we see another President Bush? Jeb Bush's father and brother have both served as president. @webpagelink"},{"comment_id":"10155210015483132","commenter_b":"What about him he deserves a good women she's nasty","commenter_a":"Good for her! She deserves a good guy","post_message":"Things are heating up between Valentin Chmerkovskiy and Amber Rose!"},{"comment_id":"736296849894226","commenter_b":"POOR GAS ON THEM AND LET THEM BURN","commenter_a":"He should have the same thing done to him.","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news. No riots, no protests, no media coverage. Do you think he should be charged with a hate crime?"}]
