[{"comment_id":"1012656692115433","commenter_b":"Is it a female? Lord have mercy she's dog ugly","commenter_a":"Racist woman","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system.  Why? Because it's against a white guy. #DNC2016"},{"comment_id":"10153781629863132","commenter_b":"stupid girl","commenter_a":"I feel so sad for Anna and their four little M's","post_message":"Anna Duggar will likely not be leaving her husband Josh despite his admitted infidelity."},{"comment_id":"1021161244667320","commenter_b":"Thank you Sir for your service. You inspire - Me - to be a better person.","commenter_a":"How very inspiring to Americans!","post_message":"'God Kept Me Alive for a Reason'  Can we get 5,000 'LIKES' and 'SHARES' for this HERO?'  @webpagelink"},{"comment_id":"10154075834221336","commenter_b":"Jen Beth -I'll probably do that too, but if Trump wins the nomination, Hillary becomes President.","commenter_a":"The only ones surprised at this are fox news , democrats and rinos. The people will put Donald J. Trump in as president","post_message":"'I'm going to win states that nobody else is going to win on the Republican side... And we will get a lot of Democrats and Independents to cross over.' – Donald J. Trump"},{"comment_id":"1787231111544405","commenter_b":"She was sucking the hell out that dick! Stephanie Nicole Goad lmfao","commenter_a":"Macie Knisley @username lol ummmm #Merica lol","post_message":"This Veterans Day party gives free tattoos, haircuts and blowjobs to veterans..."},{"comment_id":"10153408271028338","commenter_b":"The mom didn't! The dog was roaming loose around the neighborhood when it attacked the child","commenter_a":"Sue the dog owner...? Why did the mom have the kid there around the dog?","post_message":"The boy's grandfather says he already spoken to a lawyer and plans to sue the dog owner in his grandson death."},{"comment_id":"10153763916386320","commenter_b":"Who cares? All cops should spend one day arresting all the illegals in NJ and we wouldn't have this problem. All illegals should be made uncomfortable by cops and regular citizens alike.","commenter_a":"and again until you've walked in a cops shoes you don't know what it's like! They deal with scum of the earth a lot and there hands are basically tied. It's a shame and it's frustrating. I did not watch the video and I don't plan too. I'm Sick and tired of orople picking on the cops. Yes I'm sure there are some that aren't the best but most of the cops are good. Start celebrating the good cops for a change!! But sadly no one seems to be recording when they are doing something good","post_message":"A New Jersey cop goes off and is caught on video saying racial comments to three Latinos. Watch here: @webpagelink"}]
