[{"comment_id":"897587366974686","commenter_b":"Please don't speak English again your murdering my language. Just keep speaking Spanish.","commenter_a":"Speak English? Good or bad I'm bilingual BITCH","post_message":"Crazy Racist Old Lady Yells At A Woman For Speaking Spanish At An Ihop!"},{"comment_id":"10154063535716813","commenter_b":"Can I grab your pussy?","commenter_a":"I am so grateful for the @username and it's willingness to take a stand. I don't always agree with it's position, but I am always thankful for its existence and its hard work.","post_message":"ACLU Legal Director David Cole's closing remarks at Sen. Jeff Sessions’ confirmation hearing for attorney general. \"If someone applying to intern for one of your offices had as many questions in his record as Sen. Sessions has: racist comments, unethical conduct, padding of his resume, you would not hire him — absent the most thorough investigation and inquiry, if then. Sen. Sessions is not seeking to be an intern. He’s nominated to be the most powerful law enforcement officer in the nation.\""},{"comment_id":"10154040024789160","commenter_b":"If you got a dick,,,, GO F- - K yourself","commenter_a":"Go sway","post_message":"It's Barack Obama's 55th birthday. What's your birthday message for him? (AP Photo)"},{"comment_id":"10153260257844614","commenter_b":"Signed!! And shared!!!","commenter_a":"Let's start a petition to ban this person. Apparently not fit to perform the duty","post_message":"Gabriel Fernandez parents allegedly beat him to death after dousing the little boy with pepper spray, forcing him to eat his own vomit and locking him in a cabinet with a sock stuffed in his mouth, according to court records. Now, the Department of Children and Family Services supervisor who was fired after it was determined he missed opportunities to save the 8-year-old Palmdale boy is close to getting his job back. Gregory Merritt was among those who decided to close Gabriel case shortly before his death even though he knew the boy had written a suicide note and had a BB gun pellet embedded in his chest. A civil service panel recently voted unanimously to reinstate Merritt, imposing a 30-day suspension in lieu of termination, the L.A. Times reported. Read KTLA story here: @webpagelink"},{"comment_id":"10152955356009071","commenter_b":"I know I said LMAO, but really hit me up... could use the help. ;-)","commenter_a":"Dear anyone... please contact me if you're up for some pro bono work to sharpen your skills! Lmao!","post_message":"It's a known fact that hacking makes money. But how much money?"},{"comment_id":"10153316472741336","commenter_b":"Hell no she shouldn't lose her job, she should of took another pic with her legs wide open !!!","commenter_a":"@username I agree!!","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"10153648963644203","commenter_b":"I assure you, Hillary has more political experience than ALL the male candidates. Her being female just makes it better. You men who hate powerful females are gonna be maaaaad! lol","commenter_a":"I think so. It's equally difficult to imagine what Hillary Clinton's appeal to anyone, women included, is.","post_message":"\"Being a woman does not give you the right to be the next president. Whether you Carly Fiorina or Hillary Clinton. It going to be your campaign that matters.\""}]
