[{"comment_id":"10152987846462483","commenter_b":"Stfu fat cunt","commenter_a":"Chattanooga did lower the flags. A presidential declaration is not necessary for every death that occurs unless it is someone who has national level. A state or city can lower the flags without a presidential declaration. People need to inform themselves about the flag lowering issues. If we lowered the flag for every person that got killed, the flag would never be flown at full staff.","post_message":"Former U.S. Navy SEAL Marcus Luttrell pleads on his Facebook page, \"Think on it. RIP brothers, your families will miss you, the country will mourn you, and those still wearing the uniform will never forget you...Oh one more thing, lower the FLAG!!!!!!!! Sir.\"   The flag has been lowered at the United States Capitol in Washington, D.C., but no word yet on whether the flag will be lowered at The White House."},{"comment_id":"10153328314986051","commenter_b":"she a bitch who needs to be euthanized,,,","commenter_a":"Lost a lot of the respect that I was feeling for the pope. I don't care who he decides to visit, but why the \"secrecy\"?","post_message":"Pope Francis’s message to Kim Davis during their meeting was short and sincere: Stay strong. Do you support or oppose the stand Davis is taking?"},{"comment_id":"10153126683228854","commenter_b":"Criminals almost never kill themself.","commenter_a":"So what do you plan on doing about this old info ?","post_message":""},{"comment_id":"1308930149151726","commenter_b":"Smug asshole !","commenter_a":"and why is anyone voting for this self centered fool ....","post_message":"His response is simply \"deplorable.\""},{"comment_id":"10153063718888606","commenter_b":"What would be said if they were male teachers and little girls.... Sick is sick.... They need to go to jail and be on the sex offenders list.....","commenter_a":"Definitely a crazy world we live in!","post_message":"Two California teachers are accused of having sex with students while on trips to the beach, which included one overnight occasion. Police describe what happened here: @webpagelink"},{"comment_id":"10154189668593352","commenter_b":"Husbands fault!!","commenter_a":"She's young and does not realize the damage that she's doing and the fact that she cannot deny it!","post_message":"Sidechick Embarrasses Wife on Social Media – Posts Videos of Her And The Husband Doing 'You-Know-What'! (PHOTOS)"},{"comment_id":"1008491449210603","commenter_b":"@username You are scum simple as that!","commenter_a":"she was a drug taking piece of trash...","post_message":"Bobby Brown: 'Bobbi Kristina Brown was and is an angel'"}]
