[{"comment_id":"10152660058432452","commenter_b":"Why should your taxes pray double to kill her","commenter_a":"Forgive her. Two wrongs will never make a right...","post_message":"The execution of the first female in Georgia in 70 years was on hold as the U.S. Supreme Court reviewed last-minute arguments by her lawyers that they hoped would persuade the nation's top justices to grant a stay. abc7.la/1M2tBxU"},{"comment_id":"907187719304084","commenter_b":"Nope. She shouldn't.","commenter_a":"She shouldn't have to apologize. *kanye shrug* Jay","post_message":"Lindsay Lohan Apologizes For Using The N-Word On Social Media While Referencing New Kanye Song"},{"comment_id":"10154105407999166","commenter_b":"We are getting sick of black crap. Whites will start an uprising. Just wait","commenter_a":"If it was any other student you would be in an uproar...relax! He was wrong and you know it. We don't need this in schools. If they don't protect the safety of students, can you imagine what they would be up against. You don't wait til something happens then act. Let's think like adults here. This is 2016 not the 50s.","post_message":"JUST IN: Police say they have charged this Clemson student after he admitted to posting comments on a popular social media app, comments like \"let's do the Clemson protesters what Ohio did to the Kent State student protesters 40 years ago.\" He said he did it to \"make people mad\"."},{"comment_id":"1741973229385885","commenter_b":"Cus your race isn't nearly as low as the natives or Jews and why do you think you deserve it the Jews didn't get land they might of got paid....but I witness frist hand blacks recive way better benefits then whites or natives.... so natives got land Jews got money blacks got freedom with rights along with benefits what makes the blacks so special to recive more","commenter_a":"Of course, it's okay for them to be racist, but when white people say something we get beat up. Love hypocrites","post_message":"Brian Ogle's mother says her son responded to students wearing Black Lives Matter T-shirts at his school with \"Blue lives matter,\" a defense of police officers. Officers found him bleeding on the ground after a homecoming football game."},{"comment_id":"10153638033307377","commenter_b":"dumb@$$","commenter_a":"Sooooo, did Michelle Obama use any words that Laura Bush used? Hmmm a good listen.","post_message":"Bill Kristol, editor of The Weekly Standard, has delivered an eleventh-hour pep talk to Republicans."},{"comment_id":"10158461091345206","commenter_b":"I wouldn't put it past that liar!!","commenter_a":"Dan Elsa","post_message":"“Early in Clinton’s tenure as secretary of state, she and her staff were observed removing lamps and furniture from the State Department which were transported to her residence in Washington, DC.\""},{"comment_id":"10154714016861509","commenter_b":"Now how is that wall going to work?","commenter_a":"Carlos","post_message":"It even had its own elevator."}]
