[{"comment_id":"1324741860927476","commenter_b":"You need to stop getting your news from the crazy woman on the View!","commenter_a":"No terrorists came out of the 7 countries he banned why doesn't he ban Saudi Arabia where most 911 terrorists were from. Also Egypt and two other countries. Neither was the ban about illegals people with valid visas and green cards were also detained, even the ex prime minister of Norway traveling on a diplomatic passport was detained for questioning..I support Washington states action. The president is not above the LAW .","post_message":"\"We're not going to allow anyone in Washington, D.C. to trample on our rights as Washingtonians, President or otherwise.\" Gov. Jay Inlsee reacts to the judge's ruling to temporarily block President Trump's travel ban. READ MORE >> @webpagelink"},{"comment_id":"10157838985835725","commenter_b":"Woman here voting for Trump too #nocrookedhillary!","commenter_a":"Thank you Mr. Trump. As you know killary used the hurricane to post her commercials on the weather channel! To take advantage of storm victims to campaign, she is one Nut case, how disrespectful. So, we thank you for your concern for our safety!!","post_message":"Thoughts & prayers with the millions of people in the path of Hurricane Matthew. Look out for neighbors, and listen to your local officials."},{"comment_id":"10154277621163279","commenter_b":"Did you not see the video? Or are you just use to defending BS cops?","commenter_a":"If you fight with the cops and try to kill them they will shoot you every time. Still no one in the community says hey man don't fight the cops don;t try to kill cops and wave guns around and you won't end up dead.","post_message":"WATCH: Morehouse College's Marc Lamont Hill reacts to the police shooting deaths of #PhilandoCastile and #AltonSterling"},{"comment_id":"10154326338646336","commenter_b":"I don't have a family or children. I am not offended in the least. It might be a downer for those couples that are trying to start a family but geez........just quit being so sensitive. The world is not fair nor is it perfect. Keep moving forward.","commenter_a":"START A FAMILY, START A FAMILY, START A FAMILY. get over it you big babies.","post_message":"Is the phrase \"start a family\" offensive? Apparently some people think so."},{"comment_id":"1838786586350264","commenter_b":"This is a nothing story, women have been allowed to go topless in Canada since 1995. Grow up and get over the human body.","commenter_a":"Now this is a cause that I can put my hands up and support......Just kidding. I agree that if it's good for one gender, then it should be good for both genders.","post_message":"\"As long as men are allowed to be topless in public, women should have the same constitutional right.\""},{"comment_id":"10153662067420950","commenter_b":"Teresa you need a big fat,one stuck in your mouth so you can't talk but choke","commenter_a":"Trump's mouth is actually helping to elect Democrats in November. I wonder how many Republican leaders were meeting this morning and asking one another \"How in the hell can we shut this guy up?\"","post_message":"\"I'll say one thing about the Democratic Party,\" Trump observed. \"At least they stick together.\""},{"comment_id":"10153567353788984","commenter_b":"I will have one long after your ass is gone","commenter_a":"that just show the driver of the truck isn't paying attention what is going around his ride. That ass hole would be wearing salt rock in his britches","post_message":"I don't care what your opinion on the Confederate flag is, there's no denying that what this guy did is truly insane..."}]
