[{"comment_id":"10153209724819575","commenter_b":"You guys do understand that chickenpox is much worse and more dangerous to adults than children, right? And what about those babies who are too young to be immunized? The point is to vaccinate your children so that diseases like \"only chickenpox\" can be eradicated!","commenter_a":"OH MY GOD ITS THE END OF THE WORLD! Fear porn at it's finest.","post_message":"Carmel Clay Schools sent a letter to parents explaining that cases of chickenpox had been confirmed. The school system has not revealed the amount of confirmed cases."},{"comment_id":"1336076649746676","commenter_b":"It doesn't bother me at all","commenter_a":"Why does everyone need a day? Doesn't this kind of thing really inadvertently promote bias by constantly bringing up the differences between us all? We are all human and we all have strengths and weaknesses in different varieties this should be a strength among us not a divisive problem. If everyone would stop talking about it so much things would get much better. Make your decisions about people on an individual basis.","post_message":"Today is International Women's Day and to celebrate, we will be posting a series of images commemorating extraordinary women in the field of science that we believe you should have heard of. #WomenYouShouldHaveHeardOf Image courtesy Jewish Chronicle Archives/Heritage-Images."},{"comment_id":"1733753426842494","commenter_b":"@username Subtract the illegals and convicted felons that cannot vote those minority numbers are laughable .","commenter_a":"I see Hillary's sheep say Trump will Lose the Latino, Woman, LGBT, Veterans and Blacks votes. I am sure Latinos enjoyed seeing they are called taco bowl voters to the democrats. Women Yeah because Women most likely respect the way Hillary treated women when her husband sexually assaulted them, LGBT yeah because her policies are directly responsible for 49 of there deaths in Orlando and she wants to increase that by 500%, Veterans yeah because every service man/woman wants a women who will abandon them. Blacks yeah because blacks love to be called super predators, The only votes Trump is losing is to brain dead people who care more about a business mans taxes then they do Clinton's proven corruption and lies. and the only polls Trump is losing is broadcast on the same media outlets that have been proven to be corrupt. Watch a Trump rally and then watch ...","post_message":"\"[Hillary Clinton] is bought, controlled and paid for by her donors and special interests.\" Donald J. Trump gave a speech on economic policy this afternoon, saying \"Hillary Clinton will never withdraw from TPP.\""},{"comment_id":"1857128867864045","commenter_b":"What about the insane amount of lying going on in the White House right now? I haven't heard you talking about that.","commenter_a":"So lame.","post_message":"Please check out our 2nd Facebook live town hall right here!"},{"comment_id":"10152946623505399","commenter_b":"Not even worth her effort!","commenter_a":"As an Alaskan, may I just say, \"O please, Sarah. Please just go away. \"","post_message":"Well then."},{"comment_id":"1213471005342343","commenter_b":"Amnesty International can't even help the refugees that are dying in the Mediterranean today, all they can do is pick on Israel which is a democratic country and an easy target.","commenter_a":"Shame on you Amnesty International!","post_message":"This is ABSURD! How could they get away with this??"},{"comment_id":"10153473054219087","commenter_b":"Also you're basically saying someone who has the same democratic socialism plan as MLK Jr is a Marxist. Please don't insult the intelligence of Bernie Sanders supporters. We know the difference and you sir are just trying to fear monger ppl into thinking that.","commenter_a":"Perhaps Bernie will be made to answer tough questions on his absurd views on governance. Bernie Sanders: A demagogue is on the rise The populist fever is now running rampant. A demagogue is on the rise. His appeal is founded in the notion that the professional political class has both failed and ignored the plight of a disaffected but vocal minority. In terms of substance, he leaves much to be desired. In style, however, he captivates and inspires. On the debate stage, he touts his surging poll numbers, spouts unrealistic but tantalizing anti-elitist policy preferences, and berates the moderators for asking him tough questions all to the cheers of his committed band of malcontents. Noah Rothman @webpagelink","post_message":"CNN abruptly announced today that it will hold a town hall with the Democratic presidential candidates in Iowa on Monday -- one week before voters in the state head to the polls for the first-in-the-nation caucuses."}]
