[{"comment_id":"10152909457852869","commenter_b":"*morons* there is not an \"a\" in the word and you do not use an apostrophe in a plural. Have a nice day!","commenter_a":"Please do not compare the rattlesnake to Islamic Jihad. The rattlesnake believes in live and let live. Leave them alone and the rattlesnake will leave you alone!","post_message":"What do Islamic Jihad and rattlesnakes have in common? You don't negotiate with them, you don't feed them...you take their heads off before they bite you. WATCH and SHARE..."},{"comment_id":"1199381900178382","commenter_b":"They were not illegals!!","commenter_a":"#WomenAgainstSessions #LGBTQAgainstSessions #MinoritiesAgainstSessions!!!!","post_message":"WATCH: The Senate Judiciary Committee meets to vote on Attorney General nominee Sen. Jeff Sessions, hours after the firing of the acting attorney general. Read more: @webpagelink"},{"comment_id":"10156120260300354","commenter_b":"Fry his sorry butt !","commenter_a":"Firing squad","post_message":"The appropriate punishment for Bowe Bergdahl is ________________."},{"comment_id":"851657764869646","commenter_b":"Keep on keeping on...........read the Bible verse EVERY DAY! If the atheists/muslims don't like it then let them leave!!!!!","commenter_a":"good-for-this-principal-","post_message":"YES! This school won't bend to the whims of #atheists! This is how they stuck it to #FFRF:"},{"comment_id":"10154791254721756","commenter_b":"And cue the superficial bitch...","commenter_a":"He's ugly as fuuuuck though. Great actor though... Turkey neck goes gobble gobble","post_message":"\"It's a perfect role,\" Jeffrey Tambor says. \"... I thought I was gonna do Lear, but I'm gonna do Maura.\" Season 3 of Transparent comes out on Friday."},{"comment_id":"10153134474569369","commenter_b":"@username so then bill Russell should be the greatest to ever play if where talking about rings you idiot SMH it's not about the rings stupid head","commenter_a":"M. J. Loyal to his team.","post_message":"It's one of the big sporting questions of our time."},{"comment_id":"10154589081180586","commenter_b":"@username YOU ARE A BRAIN DEAD MORON","commenter_a":"Here's the thing- There are plenty of us voting for Hillary, we just don't find the need to scream about it all day long, ya know? And maybe we don't put up signs because we know the kind of needless drama it will start with any childish, loose cannon Trump supporters that happen to come across it... The Hillary supporters are here, we're just too busy working/paying taxes and rocking the good life to yell it from the rooftops everyday...","post_message":"Another national survey shows Hillary Clinton and Donald Trump in a near-even race in the final weekend before Election Day."}]
