[{"comment_id":"886419331393489","commenter_b":"Blacks have been raping, stealing and destroying everything they touch as long as they have existed and are still doing it today but t hey also never create anything. If you don't believe it just look at Africa that they are so proud to be from it hasn't evolved much from cave man days. So STFU Othello you racist douchebag.","commenter_a":"First of all not all black people shoot police, you have a bunch of crazy white people you can include, and also rednecks or countrymen use foul language and abuse women so are they considered thugs considering he said what a thug is ?","post_message":"TRUTH"},{"comment_id":"919874341467572","commenter_b":"WOW...THAT IS A AWESOME BEAUTIFUL PICTURE...GOD BLESS YOU ISRAEL...","commenter_a":"Beautiful!!!","post_message":"#TelAviv by Chief Eran Yerushalmi  #PicoftheDay #Israel #Beach"},{"comment_id":"10154088028351159","commenter_b":"I wouldn't trust her to clean my toilets !","commenter_a":"The same thing she did with Benghazi!","post_message":"In case you missed it..."},{"comment_id":"1332532336775650","commenter_b":"Trump 'Hillary is a Bigot' there you go! This is exactly where this phrase came from~ the Pot Calling the Kettle Black. Okay you Mexicans can stay in the US , But must pay, I will Not build the Wall, Mexico will not have to pay for it , I Love the Mexicans, my African Americans, Muslims and attractive women... I was only Joking, being sarcastic, just a suggestion. I love Rachel Maddow! ha","commenter_a":"I think it is hilarious the Trump supporters come to a Hillary site and post their idiotic remarks. Like their posts have any meaning or validity. It's not like they are going to have any affect on changing Hillary supporters minds.,","post_message":"8 things you can do *today* to help elect Hillary: hrc.io/2bQizDc"},{"comment_id":"787320821458495","commenter_b":"F $(; Muslims!!!!","commenter_a":"Fuck Muslims","post_message":"A&E Tells Duck Dynasty To Cut ‘Jesus’ From Prayers To Avoid Offending... We live in a nation with it's foundation built on Christianity. Can we get 30,000 'LIKES' for Duck Dynasty's faith?"},{"comment_id":"10152727264626051","commenter_b":"This woman is sick, she needs to lose her own child and put into intense therapy with jail time.","commenter_a":"Gross!!!!!!","post_message":"This kid never really thought about why his mom was so excited when his 11-year-old friend came over. Now he knows."},{"comment_id":"1766923240187480","commenter_b":"What is the purpose of the wall on the border of Guatemala, I for one am sick of the illegals working here not paying taxes but taking their wages back to mexico and supporting their families over there.. Is this perhaps why a wall is not in the best interest of mexico?","commenter_a":"'@username that's probably the truest state I have heard yet! Hilary is a monster and yes gets away with anything Would be impossible to impeach!","post_message":"Mexico's foreign minister Claudia Ruiz Massieu dismissed Donald J. Trump's campaign promise her government would pay for a U.S.-Mexico border wall."}]
