[{"comment_id":"1010634062332044","commenter_b":"They are illegal they deserve nothing.","commenter_a":"Obamina will destroy America before he/she lives the building ,unless you beat him to it","post_message":"ENTITLED ILLEGALS: It Now A Crime To Deny Illegal Aliens Tuition Benefits That Most American Don Get @webpagelink"},{"comment_id":"941606182623582","commenter_b":"She is a nut case!","commenter_a":"The state of Arizona was been sued for descrimination by one of these illegals when his daughter died in the desert while they were sneaking into the country. His case: the state had failed to keep a water station open and they suffered from dehydration. The federal court actually allowed this case to be heard. Folks, incompetence is a serious problem in our government and our judicial system.","post_message":"@webpagelink"},{"comment_id":"1023543291017240","commenter_b":"Nappy fake hair bitches.","commenter_a":"Black women aren't hot ! You can't do a fucking thing to me ! White lives matter !","post_message":"Do you think what this college student said is racist?"},{"comment_id":"10155046621507704","commenter_b":"No way these girls aren't boozin b4 these press conferences, no way...","commenter_a":"If these morons didn't play loud music in the background, you might actually be able to hear what the people are saying.","post_message":"They're losing it! In more ways than one..."},{"comment_id":"10154276196928128","commenter_b":"more like a buzzard ,she will eat america alive","commenter_a":"People seem to forget!! This is what happens when you mess with the Clinton's!! You can share this from my page if you want. And I did not write this I copied it from someone else that posted it. And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock ...","post_message":"Aaron David Miller asks: Is Hillary Clinton's hawkish past an accurate indication of how she would behave as president?"},{"comment_id":"952954108073344","commenter_b":"Freaking Cowards !!!!!!","commenter_a":"My heart and stomach hurts..This has to stop and stop now..whos going to do it?..Not Obama cause hes one of them..This madness must stop","post_message":"BREAKING: This is the face of EVIL..."},{"comment_id":"1166954960025334","commenter_b":"You are so right. All this is her own doing.","commenter_a":"Why didn't Hillary say, I have heard the question? Shows character of Hillary.","post_message":"CNN FIRES BLACK DEM Party Chair: New Wikileaks Email Exposes SECOND Question Donna Brazile Gave To Crooked Hillary In Advance Of Debate"}]
