[{"comment_id":"1243601928984608","commenter_b":"Speak for yourself, Bertha. Don't pretend you speak for the majority of women because you sure as hell don't!","commenter_a":"Don't have the right to impose their beliefs on others.. huh? Well, then the religious right should stop right there...","post_message":"Ted Cruz’s tour de transphobia has embraced a new extreme position."},{"comment_id":"10154029279516341","commenter_b":"By the Gods. Now they do have a chance to tell that envoy to give back Roman territory and she fucks it all up ! To the Circus with her !","commenter_a":"Bum nutter","post_message":""},{"comment_id":"10154963089002619","commenter_b":"basically right","commenter_a":"Israel will have no true peace except for a short while when the Antichrist sets up his kingdom there during the tribulation period Israel will have a false peace for 3 1/2 years.Jerusalem will again be trampled down by the gentiles for a short spell and then Armageddon.and then Christs return to stop the madness.","post_message":"“The chain of attacks from Paris to San Bernardino, from Istanbul to the Ivory Coast and now to Brussels, and the daily attacks on Israel, this is one continuous assault on all of us.”"},{"comment_id":"10156605912540389","commenter_b":"They offered it to me!!! What a crock!! We can't have another Clinton in the WH......","commenter_a":"For someone so smart what a waste of a brain. Just greed Is what motivates her.","post_message":"Even the left is calling this one of her worst moments."},{"comment_id":"1142812899111790","commenter_b":"Jade White Ali omg & before ?? Ur a nun then now !","commenter_a":"It's all false to get people to make racist comment, and it's illegal in UK to have more than one wife it's called bigamy","post_message":"Men with more than one wife to get bigger benefits"},{"comment_id":"821893891240198","commenter_b":"Yes she does I don't believe not one of them dumb as hoes","commenter_a":"If Phylicia Rashad wasn't present when these incidents (allegedly) occurred, (but I would bet they did), then she has nothing of concrete value to say.","post_message":"“Forget these women. What you’re seeing is the destruction of a legacy.\" - Phylicia Rashad"},{"comment_id":"10154394163921509","commenter_b":"It's the food were eating gmo and all the chemicals they put on our food","commenter_a":"Rest In Peace Great Grang Pa. How Comes Our Generation Dies Too Young?","post_message":"Yasutaro Koide was born a few months before the Wright brothers made the world's first powered flight."}]
