[{"comment_id":"10154650140738984","commenter_b":"Lol Thomas.. I always look for that very same sticker.","commenter_a":"They could have lost their job after they bought the car. That also could be their groceries for the month. When I worked at Walmart I would see carts like that and see that a lot of people would buy their monthly groceries at one time. So if you broke the cart down into 4 it really wouldn't be that much.","post_message":"This man noticed a difference between his cart and one in front of him in line at the checkout. What he saw next is royally ticking off Americans everywhere."},{"comment_id":"10157648853630389","commenter_b":"I cannot stand this woman! She's an evil individual!","commenter_a":"I think Hillary is in for a very soul awakening! God did not choose and Call a man, Donald J. Trump, to lose! Donald J. Trump, answered God's Call, he did not have to do this! God is still in Control and this is God's Creation, not the Clintons, BHO, Soros, the big bankers, or any government! Look at all of the corruption & evil that has been EXPOSED TO THE LIGHT AND HAS BEEN GOING ON FOR YEARS & YEARS AND GOD KNEW IT!!! Life is like a tapestry, we see the underside, the messy side, but God sees the finished beautiful side and knows the reasoning behind every stitch. We have repented and we have asked God to save this country, ask and it shall be given! Deuteronomy 32:35 'Vengeance is Mine, and retribution, In due time their foot will slip; For the day of their calamity is ...","post_message":""},{"comment_id":"10153242859546636","commenter_b":"i agree women want equal rights go to prison for murder they will get treated these ams as men","commenter_a":"Send Teresa May then!","post_message":"Satire died on Friday 20 November 2015"},{"comment_id":"10154120855527908","commenter_b":"So California can just take water from somewhere else? I thought they already did that... And destroyed the water source. Humans can adapt and migrate with little effort. To dry? Move.","commenter_a":"How about we build a water pipeline instead? Ample areas of the country have excess while others are in drought. The worst that happens if it leaks a little is some flowers or trees grow :)","post_message":""},{"comment_id":"1136461496426173","commenter_b":"She should be tried for treason","commenter_a":"Smart & Tough!","post_message":"Crooked Hillary Clinton wants to flood our country with Syrian immigrants that we know little or nothing about. The danger is massive. NO!"},{"comment_id":"1208679672504821","commenter_b":"She is the most disrespectful woman in the world","commenter_a":"How sick","post_message":"IN CASE YOU MISSED THIS YESTERDAY: @webpagelink"},{"comment_id":"10154169882022061","commenter_b":"Would you rather me say, \"stop your whining and suck it up buttercup!\"","commenter_a":"Good grief, you people kill me. Like it or not he is the next POTUS. Stop with the bashing. If you live in America then he is your President and you will benefit or suffer like the rest, but for crying out loud give him a chance.","post_message":"WATCH: Rick Perry, President-elect Donald J. Trump's expected pick for Secretary of Energy, famously forgot he wanted to abolish the energy department in a 2011 debate: @webpagelink"}]
