[{"comment_id":"10152843996092293","commenter_b":"White mid-western girls fall for it...talk to your daughters about that life...","commenter_a":"are they really women or","post_message":"The caption: \"chillin in the khilafah, lovin life\""},{"comment_id":"10154826896060530","commenter_b":"One more time","commenter_a":"Trump won! Get over it! Hillary lost 2 elections and she accepted the loss once she called trump and congratulated him on his win before all the votes were in!","post_message":"#BREAKING: Michigan's Board of Canvassers deadlocked 2-2 on President-elect Donald Trump's objection to a recount of all presidential ballots cast in Michigan."},{"comment_id":"10153440650715329","commenter_b":"What the fuck? Did you just call yourself a whore?","commenter_a":"This chick needs to get over herself. My mother was a lathe oporater at a pipe yard in the 70's and never whined about the way she was treated. Obviously this girl ain't from Texas. Suck it up buttercup.","post_message":"preach"},{"comment_id":"1672517186342699","commenter_b":"Kiss my white ass.I don't owe you anything","commenter_a":"White lives matter","post_message":"“...white folks actually gotta give up something. You have to actually sacrifice yourself. You have to be willing to give up the things that you currently benefit from.”"},{"comment_id":"10154018245628352","commenter_b":"Why kill the woman?... Just get a divorce and carry on with your life idiots!!!","commenter_a":"he was lying to her crazy ass....","post_message":"‘I want you so bad – if only someone was out of the way': Chilling texts Army medic sent to his mistress weeks before his wife was found murdered"},{"comment_id":"10153363421176438","commenter_b":"Whore = prostitute. Whole other issue.","commenter_a":"yea its true...normal guys care and dont really want to settle down with a past whore","post_message":"Trainwreck says straight men care about their girlfriends’ “number.” Is that true?"},{"comment_id":"10153308747171037","commenter_b":"Failing to report 1,100 donations and $145 million in donations isn't sinister. It's just a small bookkeeping error. This is how totally out of touch this moron and his wife are.","commenter_a":"And, I did not have sexual relations with that lady, Miss Lewinski.","post_message":"Former President Bill Clinton used his first interview since Hillary Clinton announced her 2016 campaign to address questions about the Clinton Foundation - by Dylan Stableford in Yahoo Politics."}]
