[{"comment_id":"1016269761823135","commenter_b":"Disgrace to this country she is a racist bitch of another type BAN this bitch from your cities stop buying her crap she calls music no talent bitch.. Yes I am pissed she is allowed to keep going.","commenter_a":"She has shown her true stripes and needs jail time to think about what she did knowing her idiot followers would try to please her.","post_message":"Beyonce has morphed from pop-star to Jesse Jackson in a D-Cup. Check this BS out. BTW, She foments more hate than any zany right-winger 'the media' makes up. @webpagelink"},{"comment_id":"10152858304201336","commenter_b":"Enough is enough time to start locking these mothers up. They think they can just take over everything","commenter_a":"Man why doesn't this stuff happen in areas I'm in? I would never try to shout these people down. I'm going to physically knock them down. I simply cannot stand, nor will tolerate, this level of open disrespect. You have a right to protest, my right to protest in return is my choice, by the means I choose necessary.","post_message":"The protesters did not stop shouting until 100-year-old U.S. Navy vet Dario Raschio spoke up and said, \"Give me a chance. At least let us show a little respect for this occasion.\""},{"comment_id":"10154165946748606","commenter_b":"Please don't stereotype. You can not speak for all Hispanics. We all don't \"love\" to drink and drive.","commenter_a":"RIP... The Hispanics love to drink and drive. Thank God mo one else involved this time.","post_message":"A car went airborne after hitting a beltway bridge abutment before landing on the roadway below, killing the driver. @webpagelink"},{"comment_id":"10153464911441438","commenter_b":"And What was the point of that weak made up story? if a girl offers a blow job for a ride and decides not to give it, you're still not allowed to rape her. You can tell her to get the fuck out of your car, but no absolutely nothing in her behavior made her deserving of rape. Even if she got in the car ass naked.","commenter_a":"Sexual consent: latent sexism, in the flesh. Hey, bitches, I heard there is a drunk girl on the corner who doesn't want to walk home. Because she is an entitled whore, you taught her that it was ok because whatever she feels is more important than fact, she decides to solicit a random passerby in a car. \"I'll give you a blowjob for a ride,\" are her words. Yet, that interaction, with all of its attendant suggestions & latent sexism & the very fact that it would not have happened without HER initiative, is somehow NOT her responsibility. That's the latently sexist, bullshit truth of femifucktardism & all of you self raping bleeding gashes. 90% of the time, anyway. Protect me because I'm a whore with a bleeding gash and I have to have protection because of the biologically driven imperative, but don't hold me responsible for ANY of my ...","post_message":"Owen Labrie is guilty of sexual assault, but not rape. What?"},{"comment_id":"898473566912365","commenter_b":"@Patty Royer, please do not breed. America already has enough mouth breathing inbred idiots and you, madame, and I use that in it's professional sense, Are their Queen.","commenter_a":"And the Republicans encourage this kind of person.","post_message":"No surprise at all. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1183171455046239","commenter_b":"Who is she to decide who the child should live with","commenter_a":"I just read another story that he had reversed his decision, probably due to pressure from above.","post_message":"SOUND OFF: Judge believes a child is better off with a heterosexual couple."},{"comment_id":"10154734487368352","commenter_b":"You got that right,unless she's a fool","commenter_a":"When they get that paper he'll want a black woman","post_message":"Browns quarterback Robert Griffin III pictured walking hand-in-hand with a blonde Estonian athlete as reports he is divorcing his wife of three years emerges"}]
