[{"comment_id":"1603692309937131","commenter_b":"Hillary got 2 million more votes. Americans REJECTED TRUMP","commenter_a":"\"Why are you really doing this?\" Despite the many rumors swirling on the Internet, the Stein/Baraka campaign genuinely believes in the power of grassroots democracy. Independently funded candidates like @username cannot stand a chance if our electoral system is rigged in favor of establishment, corporate-funded candidates. The evidence so far shows it is easy to hack many voting machines being used in elections. Aside from conducting a recount, we advocate Ranked Choice Voting and federal campaign financing, just a few solutions put forth by the Green Party in it's six-point plan for grassroots democracy. The Green Party Platform, which calls for \"publicly-owned, open source voting equipment and deploy it across the nation to ensure high national standards, performance, transparency and accountability; use verifiable paper ballots; and institute mandatory automatic random precinct recounts to ensure a high level of accuracy in election results.\" jill2016.com/recountfaq","post_message":"I am joined tonight with Kevin Ronca, the director and creator of the incredible docuseries, \"The Revolution Televised.\" Although only 13 minutes in length, each of these episodes get to the heart of the matter: exposing the corruption that has been taking place in our sick political system! I would like to invite you to join the conversation as we will be releasing the 4th episode in this series right now, followed by a live Q&A session between our viewers, me and Kevin about this extraordinary series and where he goes from here. I'm sure you all have heard about the dramatic developments at Standing Rock, including the announcement today by the Army Corps of Engineers (see below). Kevin is willing to go there with his team to bear witness to this very important struggle. --- Press Release from Army Corps of Engineers 11/25/16: @webpagelink -- Here are some of ..."},{"comment_id":"10154424065382885","commenter_b":"If I'm not mistaken your authorized to wear awards from other services you earned. I know in my unit former Marines would wear their aviation badges.","commenter_a":"The officer in this picture is wearing a Navy Fleet Marine Force Breast insignia, Navy Conduct Medal, Navy and Marine Corps Achievement Medal ... weird","post_message":""},{"comment_id":"1029861463715941","commenter_b":"You are wrong about Cruz but, everybody has their own thoughts but if you want a change then start listening to Senator Ted Cruz.","commenter_a":"Who?? Never heard of this guy! Looks like he never heard of a shower? Regardless, I will not vote for Rafael \"Ted\" Cruz, who has only been in this country since 1974!!","post_message":"OFFICIAL ENDORSEMENT... This changes everything!"},{"comment_id":"891611624218799","commenter_b":"That attitude is what spoiled immoral girls, who got caught up in this SEXUAL REVOLUTION\" and forgetting that sex is for married people, and it also leads to pregnancy. They figure,,so what,,if I get pregnant,,I'll just kill my own baby,,,no problem,,,BUT I bet when these young women,,grow older, and marry and THEN do have a child,,,they have guilt like they never knew before.","commenter_a":"Close your legs, ya skank.","post_message":"Um, what? Killing a baby doesn't \"end a pregnancy,\" it just makes someone the mother of a dead baby."},{"comment_id":"10153228124522235","commenter_b":"You scaring kitty. You BAD man.","commenter_a":"Scum!","post_message":"Convicted felon, Tom Delay, crawled out from under his rock to share his very important opinion about rights and liberties."},{"comment_id":"10153451961173717","commenter_b":"Jamie Woods well we don't have any respect or trust in the lying liberals democRATS..who believes in killing unborn babies and selling their body parts, nor allowing illegals into our country so they can suck the life out of America by getting on welfare and to kill,also not support our troops..democrats only care about their own pockets..","commenter_a":"he isnt any worse then the other ones that are running at least TRUMP tells the truth doesnt mince words doesnt try and manipulate and cheat his way through and election.","post_message":"Skywriters stole the show at the 127th Rose Parade in California on Friday, dashing out a message for Donald Trump just as the last float left the gate. \"America is great! Trump is disgusting,\" were the words dotted clearly across the sky on what appe..."},{"comment_id":"10153205140467426","commenter_b":"Lady shut the hell up negative nancy","commenter_a":"Please get some bike helmets for these young riders and teach them to wear it.","post_message":"Inspired by #Richmond2015? Happy riding kids!"}]
