[{"comment_id":"10153017747911130","commenter_b":"Yes, this guy has lost her mind...HA! Nut job liberal.","commenter_a":"God bless him.....dont judge what you dont understand","post_message":"\"I am a woman.\""},{"comment_id":"1715965605357218","commenter_b":"Y E S. I D O. ! ! !","commenter_a":"Of course they should","post_message":"Yes, I agree!"},{"comment_id":"10153400875176833","commenter_b":"my Vote WILL NOT BE FOR HER!!! I want to Keep the Constitution. We she get in the white house you can kiss this Country and are Constitution good bye..","commenter_a":"Where's sirhan sirhan when you need him ?","post_message":"Never mind all the rhetoric about how Hillary Clinton can get the Democrat Party presidential nomination because some fringe elements don think she radical enough. The Hill reports that  for gun control [an increasingly fringe group in their own right] have high hopes for Hillary Clinton presidential run, seeing her as  ally who can finish the push for tightened background checks that has stalled in President Barack Obama second term.  Indeed, Clinton has been a vocal gun control supporter for more than 20 years."},{"comment_id":"10153974959029087","commenter_b":"@username I would be suprised if you cared.","commenter_a":"Funny to read some of the Trump supporters defenses that show they didn't read the article. First, the pictures weren't taken outside of the US, they were taken here. So the argument that they \"could have been taken outside of the country\" doesn't hold weight. Second, yes, models come here and do photoshoots \"all the time\", however, as the article states, there is a way to do it legally, and a way to do it illegally/fraudulently. From her own statements, it seems there might be a case where it was done wrong. And lastly, it does matter because Trump's platform is \"do it the right way, she did it the right way\", and if she didn't do it the right way, then it is yet another lie and makes them hypocrites. I realize she isn't running, but he is so he made this an issue. If this were the Michelle ...","post_message":"Melania Trump has said she first came to the United States in 1996 on a short-term visa, which wouldn't have allowed her to work as a model. But a recently published nude photo shoot shows that she was working in the country in 1995."},{"comment_id":"10153290749172426","commenter_b":"Had he handled it the nasty note wouldn't have been left. Women can be shallow. Personally I pay quite frequently but you can't tell me this dude doesn't know how his wife can be...so just handle it.","commenter_a":"Classic husband who didn't even pay for the meal and the wife had to....lmao","post_message":"\"So Jenny, here's a life tip for you from me...\""},{"comment_id":"10153835209313380","commenter_b":"Outstanding. Congratulations.","commenter_a":"CONGRATULATIONS","post_message":"Today, I want to recognize Commander Zeita Merchant as she relieves Capt. Ryan Manning as Commanding Officer of Marine Safety Unit Chicago. Zeita is a native of Jackson, MS, and a Tougaloo College graduate. She will be the first African-American female commanding officer in history to command a Coast Guard marine safety unit and the first female officer to command Marine Safety Unit Chicago. Marine Safety Unit Chicago comprises 52 active duty, reserve and civilian personnel. Marine Safety Unit Chicago’s area of responsibility includes a fleet of 266 vessels, 118 regulated waterfront facilities, Lake Michigan shorelines of Illinois and Indiana, as well as 186 miles of the Illinois River System segmented by seven locks and more than 250 bridges. Congratulations Zeita! We know you will continue to make us proud. #MississippiMade #MississippiSupports #MyMS02 #BGTMS02 #FeelGoodFriday"},{"comment_id":"779978185438256","commenter_b":"And she is responsible for 100s of men being killed.","commenter_a":"In the Commander In Chief Debate tonight, wondered if anyone noticed that Hillary was wearing an earpiece. See picture here at @webpagelink Only thing that makes sense was that she was being fed the answers. That's why she sounded so scripted and robotic. Donald Trump was Presidential tonight. Hillary's \"in you face\" lies to the Veteran who asked the question about National Security cannot inspire confidence in the American public. How can anyone still support her? Trump is the only choice! America First is the plan!","post_message":"THANK YOU to our fantastic veterans. The reviews and polls from almost everyone of my Commander-in-Chief presentation were great! In addition, THANK YOU for hosting us this evening, Intrepid Sea, Air & Space Museum! -DJT"}]
