[{"comment_id":"10154239816884197","commenter_b":"@username Oh, you're so right. High capacity horsepower cars are designed to kill people. High capacity weight vehicles are designed to kill people. We need to ban all cars. They are designed to kill people.","commenter_a":"Maybe we should hold automobile manufactures accountable for deaths caused by automobiles. We should hold knife manufactures accountable for stabbing deaths. Train manufacturers accountable for death by trains. I can keep going on but the PERSON is to blame not the object.","post_message":"It's been a hot topic. Where do you stand? Vote in our poll: @webpagelink"},{"comment_id":"416896861831941","commenter_b":"I do not think Hillary will win (fairly anyway).","commenter_a":"The even bigger issue is that 46% of people still think he's a good president.","post_message":"I am ONE of them...do you?"},{"comment_id":"10153555053111037","commenter_b":"I bet you any money she can't breathe anymore","commenter_a":"When will people learn the cops will not lose!! I don't care what color u r, she said \" I'm gonna see u in court \"! She baited him. Why would cops kill her in jail? It's another cry baby black!","post_message":"Newly released dash cam footage shows the events that led to Sandra Bland’s arrest."},{"comment_id":"10152557805834071","commenter_b":"Exactly in one game... Ooooh make shift O line because no one else in the league had injuries along their oline and threw for 4000 yards right. With those 4000 passing yards how many tds did he throw???","commenter_a":"Wilson = average Qb with any other team besides the shehawk's...","post_message":"He keeps improving."},{"comment_id":"10153765573361336","commenter_b":"ISRAEL WAKE UP FOR EVER Israel must wake up, get up, 90% Arab are Terrorists !! ISRAEL Must Destroy your enemies, terrorists and traitors in your country and out, do not sleep, do not sleep !! Palestinians & Obama are the Biggest Lie in History ! Jerusalem Never mentioned in the Muslim Koran !! Jerusalem is written thousands of times in the Torah, Jewish Bible !!! No loyalty = no citizenship !!!! Israel You are Lucky !I the Arab leadership Started today to murder Jews.!! in 2020, then the Jews would have found sleeper, wake up ! Never were Palestinians ! tribals killers today call themselves Palestinians ! Different tribes of killers arrived in Israel since 85 years and they want a country !? Please Supreme Power Main, Creator of All the worlds & Souls, please GOD Bless the IDF and ISRAEL for Good. Destroy all the enemies of Israel ...","commenter_a":"It's absolutely BS that I had to go to Afghanistan twice in order to afford college. Making public higher education institutions tuition free isn't a bad idea at all. If we can pay for a war in Iraq then we can definitely pay for college. It's an investment in America. That's the first step on how you make America great again. #feelthebern #bernie2016","post_message":"President Barack Obama's message to U.S. troops in Afghanistan: \"I do not send you into harm’s way lightly… but as your commander in chief, I believe this mission is vital to our national security interests.\" @webpagelink"},{"comment_id":"636085169915395","commenter_b":"Fuck her .Nan I can't wait for her and her worthless ass husband to get out of office.","commenter_a":"I think her and her fucktard of a husband both have lost their fucking minds we are in America people if u don't like it get the fuck out!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"},{"comment_id":"10153348075419255","commenter_b":"who would want texass anyway","commenter_a":"I laugh every time I see these two big wusses trying to play badass.","post_message":"Idiots."}]
