[{"comment_id":"1147470615320800","commenter_b":"For one I'm not a dumb ass.So don't call me names.Im a lady.And I will vote Hillary","commenter_a":"Clinton for president","post_message":"BREAKING: ANONYMOUS Set To Drop MOTHER LODE On Hillary TOMORROW... Here's What We Know [VID] \"EVIDENCE EXPOSING THE LARGEST COVER-UP IN AMERICAN HISTORY!\""},{"comment_id":"1189693781087315","commenter_b":"so wrong. We need to let Russia have their way with Soros and rid the world of this vermin.","commenter_a":"Soros is behind the refugee flood into Europe. His organizations sent Syrian approx. 19,000 tweets promising them housing and jobs in Europe and telling them how to get around border guards. He also was behind the whole effort led by Hillary to overthrow Middle East governments and replace them with governments of his choice. His influence has cost the deaths of thousands and thousands of people in the Middle East. This is the face of evil.","post_message":"Hacked documents from George Soros’s Open Society Institute state that the billionaire and his foundation helped to successfully convinced the Obama administration into increasing the total number of refugees taken in by the U.S. from 70k to 100k per year."},{"comment_id":"163756660695086","commenter_b":"She's unbelievable. I swear she better not get into office. WAKE UP AMERICA!!!","commenter_a":"I think Hillary is channeling Marie Antoinette.","post_message":"Hillary Clinton just landed her plane in Nantucket... Almost immediately after people saw her, this HUGE problem went viral..."},{"comment_id":"10154018789591491","commenter_b":"@username littel girls like that crap thats why.","commenter_a":"Because boys can grow up to be whatever they want, but girls will grow up to only want to look pretty and wear cute clothes...","post_message":"Amy Schumer and Blake Lively are not happy."},{"comment_id":"10156662998260725","commenter_b":"Build that wall!!!","commenter_a":"Trump is going to do a great job 8 years later some other idiot is going to come and ruin it another 8 years Eric Trump is going to run !!! That's the plan!!! Go Trump!!!","post_message":"I have built so many great and complicated projects – creating tens of thousands of jobs in the process. Building a wall is A LOT easier than building a 64 story building! LET'S #MAKEAMERICAGREATAGAIN www.DonaldJTrump.com/Nevada"},{"comment_id":"10154992608754723","commenter_b":"Enter with a Visa is legal so what exactly are you talking about. This woman held in JFK work for US ARMY for 10 years in Iraq and this is how she gets paid.","commenter_a":"Cut this out, you want to come to America come in legally like my parents and siblings did. Be willing to work hard and respect American vslues","post_message":"Protesters gather at JFK airport to fight the refugee ban and detainment of refugees."},{"comment_id":"962171047226860","commenter_b":"She's a loser. She should stay with a loser.","commenter_a":"Well it's about time! Now she and Hillary can be together.","post_message":"Breaking: Huma Abedin announces she's separating from Anthony Weiner one day after husband's new sexts emerge."}]
