[{"comment_id":"10153721427574753","commenter_b":"Devious nasty man woman. Ugh","commenter_a":"1 she is a man...2 who cares","post_message":"Caitlyn Jenner just competed in her first golf tournament where she played as a woman. Jenner has always loved golf and this didn’t change when she transitioned. For some reason, it just took this long for her to do a tournament. ET Online shared the details of Caitlyn’s recent golf tournament. Jenner was in the ANA Inspiration Pro-Am in Rancho Mirage, California, on Friday morning and she played alongside former U.S. soccer star Abby Wambach. Caitlyn did a great job on the golf course today... @webpagelink"},{"comment_id":"10153242618583132","commenter_b":"First Dr. Nancy Snyderman and now Brian Williams betrayed us!","commenter_a":"Yea a permanent one lol","post_message":"Brian Williams tells staffers that he is taking a break from NBC Nightly News amid his recent scandal."},{"comment_id":"1721110158153806","commenter_b":"I wanna see this dumb bitch fight off an intruder in her home with a vibrator","commenter_a":"Pedro Tosta K. Nogueira","post_message":"These students are protesting open-carry laws by handing out dildos.  #Micbrights"},{"comment_id":"1224908530916491","commenter_b":"Kaboom, Kaboom no more Illegal Protesters' .","commenter_a":"Abba Father, we thank You Lord for Your anointed and pray for Your strength for the road ahead to exact Your purpose for such a time as this to UNITE AMERICA, ISRAEL'S DEFENDER, UNDER THE ONE TRUE GOD FOR THE GLORY OF YOUR NAME! In Jesus Name, Amen!","post_message":"The group of seven men and three women stood across the inbound lanes holding banners reading #SomosVisible, or #WeAreVisible, and another reading \"Resist, Organize, Rise Up.\""},{"comment_id":"1281596298596888","commenter_b":"I physically couldn't go eaither. But we can still stand in solidarity on social media. #IBiteGrabbers #MyVaginaMyRules #NastyWomenUnite","commenter_a":"Not starting a fight here, you right I'm old the same age as Madonna but just never followed her. I wish I had gone. What a great way for women to express themselves. Sorry no harm intended","post_message":"LIVE VIDEO: More than 500K are downtown at a rally for the Women's March on Washington MORE: @webpagelink"},{"comment_id":"10153448669913984","commenter_b":"All she had to do was say she was to fat to walk any farther and lazy. Should of called the cops and let them tow her.","commenter_a":"I want to have cards printed that say \"Congradulations! You have just won Jerk Of The Year Award for parking in a handicap parking space. Because of you my Mother could not get into her wheelchair. May you never have to be in the same situation.\"","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"10153208487503124","commenter_b":"A hole where I tried to hang a coat rack and it went clear thru to the bedroom behind the wall.....ooops....two holes...walls need patched now and still don't have the coat rack hung.....#AmazonSweeps #DDIY Thanks for the chance.","commenter_a":"We want to install slide out shelves in our pantry! #AmazonSweeps","post_message":"What project needs to get done around your house? Comment with #AmazonSweeps to enter to win a $250 gift card to be used on Amazon Home Services. Hire a pro to handle the hard work - don't do it yourself. #DDIY  Ends 7/30/2015 at 11:59 pm (PT). We will reply to the winner's randomly selected comment with instructions on how to claim the prize. See Official Rules: @webpagelink NO PURCHASE NECESSARY"}]
