[{"comment_id":"1001794969843293","commenter_b":"Feminism is cancer.","commenter_a":"Sorry lady but I put my arm around my wife because I lover her. She does the same to me and we have been married for 49 years. Maybe you ought to try a little bit of love instead of hate.","post_message":"The Dame has spoken."},{"comment_id":"10153724551069641","commenter_b":"I remember years ago being in Saudi and Riyadh was lit up like Vegas and I thought this place could be nice after all.the reality came a few days later when walking down a shopping mall with some other guys and some women who were covered were heading in our direction .They made a miniscule mistake of revealing the smalles amount of leg.Out of nowhere came the \"Religious police\",who started flogging them with sticks for this horrendous \" crime\",.The reality of the country set in for how women are treat and this was one of the many mistreatments of people in general i saw.The dark ages is what describes the country .if that is what helps to eventually lead you to heaven i am glad i am going to Hell!Though back then i had an early insight into it.","commenter_a":"Let them vote, drive and have some say so, that is more powerful than anything you could give them.","post_message":"How significant is this change for Saudi women?"},{"comment_id":"10153141690015861","commenter_b":"@username she can ride that motorcycle off into the sunset away from here.","commenter_a":"Class act!! Thank you obama for showing Oklahoma some love... Unlike our governor.","post_message":"President Obama released a powerful statement to the friends and family of the people who lost their lives in the Oklahoma City Bombing, referencing the strength and unity of our community."},{"comment_id":"1805298753047564","commenter_b":"I know Jim, I'm a diehard liberal, but when people like this commit these acts they prove that they are complete wastes of oxygen and need to be taken out of society. They are sociopaths and can never change. They must go for the safety of society!! Lethal injection is easy compared to what some people do to others. They actually are dying a much easier death than their victims.","commenter_a":"again everytime i think there should be no capital punishment, assholes like these come along and changes my mind","post_message":"The man had to crawl to save his wife."},{"comment_id":"10152632992600927","commenter_b":"When has she even known what is going on? The woman is AWOL in the brain department.","commenter_a":"Iranians are our enemies you idiota","post_message":"She's backing Obama's Iran response.  What do you think?"},{"comment_id":"10153652043082452","commenter_b":"Ok....we'll make the insect kingdom pay for it.","commenter_a":"We must build a wall to keep them out!","post_message":"Southern California's iconic palm-tree landscape could be threatened by a new invasive pest migrating north from Mexico.  The South American weevil kills palm trees by eating their leaves and spreading disease. It's already made its way to San Diego after devastating palm trees in Tijuana."},{"comment_id":"1626892184281597","commenter_b":"@username I didn't know whiney little bitches played hockey...","commenter_a":"The whole irony in this, is that Trump knew he was never going to be able to get Mexico to pay for the walll...and now im just waiting for some trump supporter to justify this and or blame Obama.....","post_message":""}]
