[{"comment_id":"10152996410034330","commenter_b":"How about if we all carried guns to protect ourselves from worthless losers like this. Just kick them off the planet and they never will rob anyone else, thats for sure...","commenter_a":"Yes Paulette in a perfect world one could go to the ATM, grocery store, or anyplace else anytime at all, however in the real world there are criminals and scum who do prey on people when they make themselves vulnerable. Police and other security people cannot be everywhere to ensure nothing ever goes wrong. It's just common sense to use caution and good judgment when out alone.","post_message":"FRIGHTENING VIDEO: A woman who pulled up to an ATM was kidnapped at gunpoint and forced into her trunk and the whole ordeal was caught on video ---> @webpagelink The suspect even gave police a good look at him"},{"comment_id":"10153855979179099","commenter_b":"The wife is the boss in every house hold, where have you been? #Happywifehappylife","commenter_a":"Hope those who do never get another nomination!! Btw Will, grow a set. We can see who's the boss in your house!","post_message":"Will Smith will join wife Jada Pinkett Smith in not attending the Oscars this year. @webpagelink"},{"comment_id":"10154400564286509","commenter_b":"Delusional much?","commenter_a":"10 dead so far in republicans terrorist attack on Flint. Where is the justice. The serial killer Governor needs to be put away...","post_message":"\"Our mouths were ajar\": Meet Dr. Mona Hanna-Attisha, the pediatrician who exposed lead poisoning in Flint, Michigan."},{"comment_id":"1369207093090488","commenter_b":"The woman is pure evil","commenter_a":"It's time for women to shine, it's Been over due. I'm so proud a women is going to be the next President of the United States 2016 for the 20th century","post_message":"LIVE: Democratic Presidential nominee Hillary Clinton speaks at Democratic National Convention."},{"comment_id":"10152860083811051","commenter_b":"Rene this country still has racism because some blacks won't let it go and grow up And Larry NOBODY wants this president to stay with him tearing down America and acting like a dictator. Remember what happened to hitler???","commenter_a":"Wtf is OBAMA IF NOT A DISGRACE AND EMBARRASSMENT?????","post_message":"President Obama just said that some Senators have become an embarrassment to the United States. And he didn't stop there."},{"comment_id":"585702171625401","commenter_b":"REAL MEN FOLLOW THROUGH WITH PROMISES MADE REGARDLESS OF WHO OBJECTS!!!","commenter_a":"Well fuck you too!","post_message":"Do you side with Garth Brooks? or DONALD TRUMP? Comment your answer below!"},{"comment_id":"1194657977239103","commenter_b":"Yep theirs just as maney glacers now as their was then . But their smaller now then they were then. The Artic ice cap is smaler now then it was then and the Anartic is doing somthing with large chunks braking off.So I guess you all know more then the people that study the weather Maybe almost as much as you know about doing your job in stead of taking money to lie","commenter_a":"The whole global warming crap is a lie its away for rich people to gouge the world for more wealth","post_message":"This is going to upset a lot of people!"}]
