[{"comment_id":"902141793237008","commenter_b":"She didn't deserve this. She was a good hoe...","commenter_a":"@username it appears that maybe, a hoe can get cold","post_message":"Elizabeth Luebke died in Wisconsin after going outside in temperatures as low as as -27.5 degrees with the wind chill."},{"comment_id":"1861987967361615","commenter_b":"This woman is sick!","commenter_a":"PLEASE FRY THIS RAPPER!","post_message":"*** Sarah Palin is About to Teach Rapper Azaleia Banks the Lesson of a Lifetime ***"},{"comment_id":"10153361519746813","commenter_b":"That's the point. You said it yourself. Men have been using the men's room and women have been using the ladies room without an issue since forever without any problems. My point is that the law allows for men to use the ladies room and women to use the men's room, that is the basis of this law.","commenter_a":"I want to know why this is such a \"hateful\" law. The \"party of science\" is arguing against a law that basically says \"You know this restroom that's for boys/men? Only boys/men can use it. You know this bathroom that's for girls/women? It's only for girls/women\". So you think if women feel uncomfortable that a man that says \"Hey, I feel like a woman\" goes into a woman's locker room must hate LGBT people? Really? It's not the trans people I'm concerned about. It's the people POSING as trans people. Why should women be made to feel uncomfortable just so a man that thinks he's a woman can use the women's restroom/bathroom? Wanting people to use the bathroom of the sex they were BORN with (and actually STILL are, as science dictates) does NOT = hate.","post_message":"After nationwide outcry about North Carolina's harmful anti-LGBT law, Gov. McCrory said let's \"work on solutions that will make this bill better\" because NC is \"a state of inclusiveness, openness and diversity.\" Let’s make it clear - that means REPEAL HB2. Keep the pressure on. Add your name: @webpagelink"},{"comment_id":"863004940415197","commenter_b":"Throw her in jail","commenter_a":"Take her down!","post_message":"\"Perfect\" was the response Lerner used about the non-archived messaging system."},{"comment_id":"10156346841015725","commenter_b":"Build the wall","commenter_a":"America should close the borders. You do not lock the front door of your house because you hate the people outside. You lock it because you love the people inside. A country's border is its front door.","post_message":"From South Carolina last night- this is what I call a real supporter! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"10153105977467098","commenter_b":"YUP!! We always Been Here!! Who the Real Illegals!!","commenter_a":"Every race that is not latino or native american is an illegal inmigrant or descendant OF an illegal immigrant latinos ARE from this continent OF AMERICA... North central and south AMERICA ANYONE else their ancestors came on a boat across The Ocean and The atlantic ALL WE Did WAS cross an imaginary Line Lmao.... americans huh..... WATCH WHO u call a wet back we didnt have to cross The atlantic TO GET here wet backs","post_message":"Donald Trump would not say how he would locate, round up and deport the 11 million undocumented immigrants he says must go."},{"comment_id":"10155184641741509","commenter_b":"They wanted that sweet Brazilian booty","commenter_a":"I really think these dudes were out looking for mad hookers and they got robbed because of it LMFAO!!!!","post_message":"JUST IN: US swimmers Jack Conger and Gunnar Bentz were removed from their flight from Rio de Janeiro to the United States by Brazilian authorities, US Olympic Committee spokesman Patrick Sandusky told CNN Sports contributor Christine Brennan. Earlier this week, the two swimmers were with teammates Ryan Lochte and James Feigen, who are wanted for questioning by Brazilian police after questions were raised over their accounts of being robbed."}]
