[{"comment_id":"10156915494530231","commenter_b":"Black woman=weapon of black mass destruction. -END","commenter_a":"Yeah, this dude SHOULD NOT marry you. If you're more concerned about him spending thousands of dollars on some stupid ring (a token of a totally outdated custom that was invented by DeBeers in the first place to sell diamonds that Africans have to DIE to mine) then you are with your relationship -- he should look elsewhere for someone who isn't a shallow golddigger.","post_message":"Here are a few tips if you find yourself in this situation. #AskDemetria"},{"comment_id":"647292048744709","commenter_b":"Only think Muslim country doesnt provide is Security Reason for us to move USA !","commenter_a":"There is a renewed campaign that's getting a lot of attention to get the Equal Rights Amendment (ERA) into the U.S. Constitution. Many candidates talk about their support for fair treatment of women, and this amendment would provide a fundamental guarantee of equal rights. If elected, will you actively support the ERA? #GOPDebate","post_message":"Don Lemon is taking you through the latest in Facebook trends ahead of tonight's #GOPDebate. Have questions? Ask him anything!"},{"comment_id":"1107371389322608","commenter_b":"The bloke with the pube beard is better looking then mwah? Ok STEVIE WONDER","commenter_a":"Looks like he's put glue on his face and rolled around a barbers floor","post_message":"Hug-me-Muslim ‘threatened to bomb MPs house"},{"comment_id":"10154059836575667","commenter_b":"follow please Happiness is not that owns everything you see beautiful, but happiness can see all of its holdings beautifu","commenter_a":"What a nitwit, well good for him, a felony record for life, he earned it and deserves it !!! Hope he gets at least a year to boot !!","post_message":"Will the man who destroyed Donald Trump's star on the Hollywood Walk of Fame go to jail?"},{"comment_id":"1242270725821978","commenter_b":"#MyBodyMyChoice . Oh get over it men.. you have no right over women... You would never stop abortions.. we will find our own ways.. neener neener.. grow up and realize you don't matter..","commenter_a":"Oh yes, women just can't make these important decisions without a man's assistance and approval. Jeez, what's next, taking away women's right to vote?","post_message":"“I believe one of the breakdowns in our society is that we have excluded the man out of all of these types of decisions,” said the Oklahoma representative who wrote the bill."},{"comment_id":"1705740913046354","commenter_b":"Bitch!","commenter_a":"Go whoop, go now.","post_message":"Oh my gosh, I can't believe Whoopi Goldberg said this. Cancel The View right now."},{"comment_id":"1202403033149557","commenter_b":"Greg is right and you Libtards are in denial.","commenter_a":"To understand what Hillary and her leadership will do to America. all you have to do is look at our Democrat run cities. Poverty, Crime, Drugs and Hatred. Syrian Refugees and Open Boarders will only add fuel to the fire! Democrats do not want prosperity for everyone, they want to keep the poor dependent so they can perpetuate their cause of corruption and lies. It is a fact. An obvious fact. Only selfish, bleeding heart liberals could be so ignorant as to the facts and the reality of the situation. It is a joke. @webpagelink","post_message":"The women of the U.S. Senate are fighting to make their firsts the first of many."}]
