[{"comment_id":"541791876011392","commenter_b":"Isnt it still a punishable offense in the eyes of the law if it is then the people who are doing this should be arrested and jailed and fined of course i meen after they get their ass's stomped .","commenter_a":"Needs a beating","post_message":"This liberal thought he could burn an American flag, big mistake.  That's what happens when you disrespect our flag. If you don't like it… LEAVE.  Do you support these patriotic students?"},{"comment_id":"10153461006671717","commenter_b":"Welp since all the lesbians I see on here basically think its hilarious, and a silly hearted statement meant with no hate or bias I guess you're just one of those super bitchy \" right to be offended\" people that wake up everyday looking for a reason to be Cunty.","commenter_a":"I'm not buying it. I don't think the joke was just in good humor. There's enough language here to clearly see that he was being hateful towards the LGBT community. After all, he did say the word \"lesbian\". Isn't that enough to ban him and boycott him from everything? Shouldn't we be calling him hateful names for his aweful transgretions?","post_message":"Funny or die?"},{"comment_id":"596850543832294","commenter_b":"They can. And you have, traitor. I've gone from 80k a yr. income to less than 30k because of your bullshit. F you Brock insane obozo","commenter_a":"They're doing it you idiot. Must live under a rock.","post_message":"On the recent attacks, President Obama says no terrorists \"can ultimately undermine our way of life.\" Do you agree?"},{"comment_id":"10156008718310354","commenter_b":"Omg still an ugly turd inside and out. Who cares what this bitch thinks or says!!!","commenter_a":"Yeah.... there is someone with less class than a pig.","post_message":"Just when you thought she couldn't be any more vile..."},{"comment_id":"745794202277824","commenter_b":"She a fat hoe nuttin moe","commenter_a":"Dumb song.","post_message":"Something DISTURBING Was Just Exposed About Beyonce's Halftime Song  This is sickening. She should be banned from performing at any sports events for this.  Do you Beyonce needs to learn some respect?"},{"comment_id":"10153301098933067","commenter_b":"Both ladies were very graceful","commenter_a":"Mr. Trump, you are really out of your ulo..... it was an honest mistake and it was acknowledged so, just move on..... better luck next time Miss Colombia... congratulations to all the contestants and the winners........ jmtc","post_message":"\"I'll tell you what I think I'd do. I think I'd make 'em a co-winner. It'd be very cool\" - Donald J. Trump @webpagelink"},{"comment_id":"10154002938919749","commenter_b":"Cindy Rhodes go do one stupid cow feminists are scum","commenter_a":"If your still hung up on feminism within the uk and the us then you need to develop your personality. Not your discrimination skills.","post_message":""}]
