[{"comment_id":"10155791972890725","commenter_b":"STFU","commenter_a":"and a lot of people blame the police in one out of five hundred killings. what happen to hope and change under obama?","post_message":"Police say the victim, identified as Vonzell Banks, was likely not the intended target ----> @webpagelink"},{"comment_id":"1131610686905195","commenter_b":"@username back your claims up with citations and credible sources! @webpagelink","commenter_a":"Bernie says it best, \"You've got some middle class people working longer hours for lower wages -- they pay their taxes, they support their schools, they support their infrastructure, they support the military. But the billionaires? No, they don't have to do that, because they have their friends on Capitol Hill. They pay zero in taxes. So Trump goes around and says, 'Hey, I'm worth billions, I'm a successful businessman. But I don't pay any taxes. But you, you make $15 an hour? You pay the taxes, not me,'\" he said. \"That is why people are angry and want real change in this country.\"","post_message":"Millions of Americans work hard and pay their taxes. So why doesn't Donald Trump pay his?"},{"comment_id":"10155542841313362","commenter_b":"Get well soon Senator Susan Collins and Merry Christmas.","commenter_a":"Thank you for the well wishes!!!","post_message":"Due to a slip on the ice, both Rob Gronkowski and I will be on Injured Reserve for the playoffs.  My ankle was broken in two places, but thanks to a successful surgery at St. Joseph Hospital with Dr. Jacob Brooks and his team, I am on the road to recovery."},{"comment_id":"1088733604470282","commenter_b":"If these teachers are not immediately fired, you can assume that there is something pretty sinister going on at that school. And just where are they getting their lesson plans, and who is allowing this?","commenter_a":"Muslims are the fastest growing bloc of Immigrants published by the Center for Immigration Studies. Also another study by American Community Survey (ACS) finds that foreign-born population in the U.S. hit a new record high 42.4 million in July 2014. Since 2008-2013, according to (ORR) Office of Refugee Resettlement, U.S. has admitted 115,617' Refugees from the Middle East and granted another 10,026 asylum. Granted Green Cards to 308,805 immigrants from the Middle Eastern countries identified by ORR as Refugee Nations making them lawful Permanent resident (LPR`s) eligible for citizenship in [5] years and petition their family members to come to the U.S.. Middle Eastern Refugees are immediately eligible for Public benefits -to the U.S. particularly the Syrian Refugees. ORR defines asylaes from the Middle East as being: Afghanistan, Iran, Iraq, Jordan, Kuwait, Lebanon, Saudi Arabia, Turkey and Yemen. As of 2013, top ten Countries for admission to the U.S. were ...","post_message":"Middle school instructs students to create ISIS propaganda"},{"comment_id":"724989260938156","commenter_b":"Honestly I wouldn't blame people for moving to canada if trump got presidency tonette kamakahi-gumapac","commenter_a":"Votefor Trump Happy Easter. Let's spend next Easter with Trump in the White House!","post_message":"Happy Easter to all, have a great day!"},{"comment_id":"1110306035681925","commenter_b":"She's a evil hypocrite","commenter_a":"Good point!","post_message":"'Hillary Clinton doesn’t miss an opportunity to ridicule Donald Trump’s illegal immigration solution of a wall on the southern border — but that’s exactly what she’s deployed to keep undesirables away from her.'"},{"comment_id":"1524820847826715","commenter_b":"Kelly is a disgrace. There hope ,if her head gets any bigger maybe it will blow up.","commenter_a":"Trump is a disgusting, bullying narcissist and anyone with half a brain can see it. At this point anyone that still supports him is obviously lacking in intelligence or hiding under a rock. We are better than Donald Trump, America!","post_message":"An open letter to Donald Trump.  Donald,  I read your string of really sad and sick tweets against Megyn Kelly.   First let me say this:  Leave Megyn Kelly ALONE.  She is brilliant, honest and brave.  I can only imagine the amount of security this mother of three now needs because Donald Trump has gone over the edge with some revenge drama just because she asked a fair question almost half a year ago!  Should a presidential candidate be so thin skinned that he must belittle, abuse and threaten women?  Will we really vote for you?  A man who abuses anyone who doesn't kiss his ring?  I know I will not.  Donald, she is a journalist.  This is what they do.  You don't like her questions?  Fine.    Grow up.     Many of us have problems with the press.  I have been asked questions much worse than what you were asked.  For years.  The people know bias, and I am afraid in your case, eventually, the people recognize sickness.  Get ahold of yourself and stop preying on the worst in man.  A real leader lifts people up, he doesn't tear them down.  I know what I will get from you and your supporters because I dare speak out against you.     I know that your followers will write vile and hateful lies about me for this post.  They will claim, I am a sellout or I have a vendetta against you.  Read the posts below and see if they don't belittle and deflect.  So be it.     I will gladly take a stand against bullies and men who abuse women.  I will happily stand in line to protect anyone from abuse.      I have done it before.   And the abuser and enabler said that the entire family was wrong and that we had a vendetta.  It is what always happens in cases of domestic abuse.  It was the hardest thing I have ever had to do, but I stood up in my own family.   And someone needs to do it now.  You see, Don, I know who you are because I have seen your type before.     Verbal abuse is just as bad as physical abuse.  But men like those who abused the women in my family were smarter, like you, than the man who used to beat my mother.  Words, most think, don't leave marks.  But maybe you don't care, because you deliver your beatings in broad daylight and in full view, daring us to stop you.  We don't because our country is sick.     We, as a nation, have battered spouse syndrome.  We no longer know who we really are, many have given up and a few are about to light the bed on fire.  We have been told that we are no good, hateful, bigots, worthless and powerless by more subtle abusers before you.     Those in Washington and in the media have been verbally and sometimes physically abusing the American people for years.   Mostly to cover the trail of who they have been sleeping with while lying to us.  We are weak, but those of us who see it must begin to stand and offer help and healing for the abused and abusers.  \"America, you are better than this\", is what she needs to hear.  But as always, the abused always breaks it off with an abuser only to find a bigger abuser.    It is their comfort zone.  You, Mr Trump, know this.  It is why you chose this time and this party.   You also know that some of us are on to you.   It is why you poison the enablers against us and isolate the victims.  I am not a doctor.  But I am a survivor and I would bet a specialist in domestic violence would agree that the pattern is here.  Your rage is terrifying to some.  You should know:  ---you don't frighten me and my guess is you don't frighten Megyn.  We know what a little man you are. Women are more than a \"tight piece of @ss!\" As you have called them.  Megyn is a mom, wife, and someone's daughter.    And if I may, the Bible that you so cherish also explains that she is a daughter of God.  Are we as a people not going to stand up for women being abused?  I am not sure, but I want you to know, Mr Trump, that I will stand against abuse and my guess is millions of survivors will as well.  Mr. Trump, what would you do if someone obsessively stalked your daughter on Twitter for months after a minor disagreement as you have had with Megyn?    Wouldn't you question the man's mental health and advise your daughter to get a gun and a restraining order if that very powerful man stalked, reached out to her boss to get her fired, tried to turn her work friends in to enemies and then turned his friends into stalkers as well?  What would you tell one of your beautiful daughters about that man?      Would laugh it off?   Tell her she was wrong for doing her job?     Would you tell her he was qualified for the position of the highest honor and trust?  Your followers will say \"she deserved it\" or words of that meaning.     But, if Ivanka were Megyn, would you tell them to stop their defense of the stalker and harassment of Ivanka.  Of course you would as many say you are a good father.  I know that any man with as much success and power as you have, to spend any of his limited and valuable  time, tweeting all night and day after day for months, like a 14 year old boy, means, to me, that someone must have hurt you badly in your past.  I have been there Donald.  I know.  No one will say it, and you certainly won't admit it, but my guess is, you were deeply hurt or abused when you were young.     It explains your entire act.     It is as if you stopped maturing in the 8th grade.   You are a 14 year old boy trapped in a 70 year old body.  I don't know what your pain is.   But it is okay Donald.   No one can hurt you anymore and you need to see that in your effort of trying not to be hurt you have become the abuser.  What frightens me, is what America is teaching you.  By excusing your behavior, we are only making you more bold and once you \"marry the nation\" I fear what you will become.  We have become enablers.  If this is the behavior when we are \"dating\", what will you do once you have the ring?  I know you love Putin.     You have said you want to open up the First Amendment to curb the speech of the press you don't like.     You bully, harass, and teach your followers to do the same.  But at least, unlike your idol in the east, Putin, you haven't shot any reporters in the elevator.  Yet.  I will protect and defend against all enemies foreign and domestic, and to me, there is now a new meaning of domestic abuse.  #istandwithmegyn #istandwithfreespeech #stopabuse #megynkelly #donaldtrump"}]
