[{"comment_id":"10154589153096336","commenter_b":"The only place Hillary should be is in prison! #trump2016","commenter_a":"MAY HAVE???????","post_message":"Newly released emails suggest a senior Hillary Clinton aide stage-managed her first hearing on Benghazi by feeding specific topics to Democratic Senator Robert Menendez. @webpagelink"},{"comment_id":"1016519435107777","commenter_b":"Yes, and the idea that we should force women to wear a veil in the USA makes me physically ill. Women are NOT 3rd class citizens, which is what they are in strict Muslim households!","commenter_a":"There are many women who are voting republican because they are against abortions and they do not believe PP is anything other than there to do abortions. At age 72 I am with Stevie. I think we worked too hard to go backwards. I remember when I was first married there were states where it was against the law for a woman to use any form of birth control other than abstinence. If abortion is outlawed, how long before birth control will be outlawed.","post_message":"TRUTH."},{"comment_id":"10153797502305779","commenter_b":"I wonder how people react to a naked hillary statue where you get to see that bitch in all her glory. Lol. Bet people would respond differently","commenter_a":"Gross!!!! The looks are uncanny!!!!!","post_message":"New naked Donald J. Trump statues appeared today, and now they're legal, backed by a mega-developer of their own."},{"comment_id":"10153006629032756","commenter_b":"no it isn't all urine its sweat also, you ever lean on a couch and your arms start itching well that usually sweat, other bodily liquids like tears, saliva and other related stuff can cause the burning of the eyes too","commenter_a":"Jason Meade","post_message":""},{"comment_id":"361328087404039","commenter_b":"She is worse than Holder . America keeps going down hill and it will get worse .","commenter_a":"Disgrace to America","post_message":"Squishy and Weak Senate Republicans Lead the Way in Confirming Loretta Lynch as Attorney General  Real Conservatives Outraged"},{"comment_id":"10154604674038690","commenter_b":"#Bilal_yema we terribly hate the western hypocrites who have kept Muslim lands occupied in Afghanistan!!! tell them to leave Afghanistan we Muslims will solve our own problems!!!!!","commenter_a":"Taliban means terrorist and terrorist means Pakistan Pakistan is cancer for the world","post_message":"Based on reports gathered by Al Jazeera from local police, security forces and the Taliban, here is a conservative estimate of the areas in Afghanistan that are contested, under the Taliban, and under government forces."},{"comment_id":"1318642101490448","commenter_b":"No dumbass that's why she lost","commenter_a":"No she is to crooked","post_message":"Honest question: Do you think Hillary Clinton would have been a better president than Trump?"}]
