[{"comment_id":"1729422480677478","commenter_b":"I'm for the wall. Now!","commenter_a":"Immigration across the southern boarder is at an all time low level. President Obama has deported more illegals than any other president.","post_message":"Donald Trump says a border wall is a common sense way to slow the flow of illegal immigration at the border. Are you for or against his plan?"},{"comment_id":"1452185328156583","commenter_b":"SLAVE OF AMERICANS","commenter_a":"Plastic materials","post_message":"Iran's Islamic Revolution Guards Corps Ground Force establishes an organization specializing in using drones in military operations."},{"comment_id":"10152896825378635","commenter_b":"What cowards!!! Five against i woman!! Day of judgement belongs to the Father\" Animals!!! There will be no rest , or prizes , at end of life for you .. How C an you be so dumb!!!! .so so evil ... Under the control of satan, and do not even know it!!!","commenter_a":"There are bad people in every religion.","post_message":"\"The five Muslims took hold of me, and they raped me there,\" the church source quoted the daughter as saying. \"I tried to scream, but they threatened to kill me. One of them said, 'Your father should stop this prayer meeting of trying to change Muslims to become Christians and close the church building — we have warned him several times.'\""},{"comment_id":"10154516919809575","commenter_b":"Actually yes it was.","commenter_a":"Full moon?","post_message":"Police are on scene investigating after they say 2 people were shot on the west side.   Six people have been shot since 8:30 p.m. Thursday."},{"comment_id":"636870959836816","commenter_b":"Good for her they should all be arrested where the heck is the National Guard?","commenter_a":"Need to arrest everyone on street. Thugs have taken over again ??? Let the police do their job . If they have to shoot a few of them so be it.","post_message":"Ferguson Protesters got in the way, so this patriotic driver does this.  Race rioters are out of control. They are the true menace to our society.  Are you sick and tired of race rioters?"},{"comment_id":"1242850115735016","commenter_b":"Please don't put us in danger Mr. President. It doesn't matter where you put these refugees in the US. They can still be a threat. I still can't get over 9/11","commenter_a":"How about taking care of the homeless in the country before letting refugees in? I know it might sound crazy, but give it a shot.","post_message":"After the terror attacks in Paris that killed at least 129 people, the placement of refugees fleeing Syria has come under scrutiny as more than a dozen governors - mostly Republicans - have said the do not want the refugees in their state."},{"comment_id":"10156316346195725","commenter_b":"@username , but Muslims will not vote for him","commenter_a":"We need you now Donald Trump!!!","post_message":"Remember, I was the one who said attack the oil (ISIS source of wealth) a long time ago. Everyone scoffed, now they're attacking the oil."}]
