[{"comment_id":"10153840856185950","commenter_b":"Luckily that woman is not running @username, I wouldn't vote for her either!","commenter_a":"If you believe this false report you're an idiot. If you vote for Hillary Clinton you're an idiot. After all these lies and scandals surrounding this woman I can't see too many bright people voting for her. Trump's going to be our President!!!!!!","post_message":"Hillary Clinton's expansive lead is due to support from women and non-white voters, according to the survey."},{"comment_id":"10154879829717178","commenter_b":"They are not moving anywhere. Btw transgender is not a protected class.","commenter_a":"BOA is in talks to move it's headquarters out of Charlotte because of the discrimination law. Way to go State Politicians.","post_message":"House Bill 2 has just about everything an editorial cartoonist could want: a well-known story, controversy, key players to lampoon, and toilets. Story >> wral.com/@username"},{"comment_id":"1157956670923761","commenter_b":"No can't be true!!! Germans wouldn't let that happen!!","commenter_a":"God help us ALL","post_message":"Goodbye Germany!"},{"comment_id":"878149845586082","commenter_b":":D mu mka kap hernia .. :'(","commenter_a":"Joe Jess","post_message":"This just shouldn't be possible..."},{"comment_id":"1155452914533533","commenter_b":"She has blood in her hands #garyjohnson President 2016","commenter_a":"Hilary Clinton my president of America, I'm so Happy for and all the women's should be able to learn from her. My president Clinton is very professional and smart. Sorry! Trumper's but it's time to be in the top line. \"With great people, we move forward to another level\"","post_message":"Michelle Obama on Donald J. Trump: \"...that's why he demeans and humiliates women as if we're objects meant solely for pleasure and entertainment.\" @webpagelink"},{"comment_id":"10153460362791336","commenter_b":"Trump has Americans interest for once , not what can Americans do for illegals .","commenter_a":"The Silent Majority is COMING OUT FOR Donald J Trump. The PC ERA IS OVER. THE TRUTH ERA IS HERE. Donald J Trump 21st Century Patriot.","post_message":"\"The silent majority is back, and we’re going to take the country back.\" On Saturday, Republican presidential hopeful Donald J. Trump spoke to thousands of cheering supporters in Arizona."},{"comment_id":"1098705460221855","commenter_b":"@username, you are for Hillary because she is all for bringing others like you here. When you come here, what did you get given to you???? I know you didn't come here with your own money, food, clothing, transportation, etcetera.... It's one thing when people came to this country because they had the hunger for the \"American dream.\" All of the immigrants coming into our country NOW, are money grubbing leaches. They don't respect our values, our flag, and don't care to make this country better.... Just to suck off uncle Sam's teet. I don't WANT to buy health insurance!!!!! WHY should I have to??!! What kind of freedom is THAT???? I think YOU need to do YOUR research!!","commenter_a":"We are taught at schools of what @username did for all American,especially The affordable Health cards. I believe that she will make tramandous change if elected. TRUMP is all set to be Casino manager. That's all.","post_message":"This is really happening—Donald Trump just officially accepted the Republican nomination for president. Share this if you agree: We can't let him anywhere near the White House."}]
