[{"comment_id":"10153246280989411","commenter_b":"Why there is nobody helping Palestine. Come on Russia or China. Could you plz give Palestine nukes. Let those two countries to finally start playing a little more realistic games.","commenter_a":"So they are trying to destroy them............fuckers...","post_message":"'Israel cannot maintain military control of another people indefinitely.'"},{"comment_id":"987929541300100","commenter_b":"You guys just don't know anything about Muslims! !!!! Wake up.America they will take over your land People are clapping for her for what????????","commenter_a":"Should be concerned about all Americans instead","post_message":"Watch: Bernie Sanders teaches Republicans a lesson on how to respect Muslim Americans and end racism in America."},{"comment_id":"415787422087411","commenter_b":"Many more American waiting for jobs now, so if your illegal, then bye, bye. If your immigrants better get back to work, that is what you came to America for.","commenter_a":"Carol Johnson","post_message":"#DayWithoutImmigrants: Immigrants across the country are expected to stay home from school and work today to show how critical they are to the U.S. economy and way of life."},{"comment_id":"10154953325678984","commenter_b":"John, trump just said in his speech last night we have to unify. How can we when you make stupid statements like that!!","commenter_a":"President Trump should invite the Haitian Leaders, absolutely. And as a gift to them, hand over the Clinton's to them to face justice there.","post_message":"Obama probably isn't going to like this..."},{"comment_id":"1080954051971524","commenter_b":"We will celebrate when she leaves the White House!","commenter_a":"How about a national party when they move out of our house???","post_message":"Would you be COOL with this? Or does the thought of this make you gag?"},{"comment_id":"10153007291820667","commenter_b":"yes... weed is as bad as crack. and if they made crack legal, will you or anyone you know start using it? if not why? its legal.... everyone will use it if its legal....","commenter_a":"Crack Cocaine is next! Woo hoo!","post_message":"Cloudy with a chance of pot smoke."},{"comment_id":"607183962802381","commenter_b":"@username then maybe you should move out of America if you can't handle it. Bye Felicia","commenter_a":"Only reason big cities elect her is Bc they are the low life's looking for their hand outs... Guess what?! You'll be returning your Obama phones soon :) haha","post_message":"We’re in New York with Chris Moody and Vanessa Yurkevich who are talking to voters about tonight’s dramatic election results. Any questions? Let us know! #CNNElection #ElectionNight #MyVote"}]
