[{"comment_id":"10153625218767464","commenter_b":"That was their land. The other middle eastern countries opened their jails and put those people there to taunt Israel. Know your history if you're going to insult a Nation using their systemic slaughter as a punch line.","commenter_a":"The genocide of the Jews does not justify hem killing the Palestinians. What's the difference between a cow and the Holocaust? You can't milk a cow for 70 years.","post_message":"I'm proud to stand with PM Benjamin Netanyahu - בנימין נתניהו and the nation of Israel. LIKE if you are too!"},{"comment_id":"1090226121037135","commenter_b":"Islam and muslims are biggest threat.","commenter_a":"Israel stands with France against terrorism. Do France stands with Israel against the same terrorism?","post_message":"France's year of terror"},{"comment_id":"1750894945158794","commenter_b":"@username I'd rather be nationalistic than a back stabbing, gutless, two faced, squirming, sissified nonce!!!!","commenter_a":"If you don't support the country you live in, feel free to move to the country you support. Scumbags!","post_message":"WATCH: A police officer takes an American flag away from a protester who was trying to burn it outside the GOP Convention in Cleveland."},{"comment_id":"985335071559547","commenter_b":"Scumbag!","commenter_a":"First of all what was the point in having all of this kids man! Now a days 3 or 4 is a lot of kids man. 19 kids is like your freaking crazy! I only watch half of a episode and I change the channel mighty quick. The ones that are going to suffer are their kids.","post_message":"This \"family values\" hypocrite hoped you'd never see these."},{"comment_id":"10155874943040354","commenter_b":"Black scumbags do not matter !","commenter_a":"I'm sure Al Sharpton and his ilk will spin this as a racial injustice and Obama will write his family. Probably won't claim him as looking like his son as he's been there and done that. All of them are sick sons of bitches.","post_message":"Police say the 82-year-old did one thing that likely saved her life..."},{"comment_id":"1115803781778734","commenter_b":"True, God's judgement may happen just like in Sodom and Gomorah,, Because guy marriage is wickedness,,,","commenter_a":"The rath of God, is not some thing, they want to play with.","post_message":""},{"comment_id":"430918413735174","commenter_b":"No inadiment object kills, ie, knife, gun, car, tire iron. It takes people to pick them up use/drive to kill someone. If y'all did your research, guns are not the leader in killing people. Your wife's Rolling pin is up there. Smh at some of you.","commenter_a":"Just waiting for the \"guns don't kill people\" squad","post_message":"\"More than half the women murdered each year are killed with firearms — and in nearly 75 percent of those deaths, the weapon is a handgun.\" Fault Lines: Death in Plain Sight, tonight at 10pET"}]
