[{"comment_id":"528408970683016","commenter_b":"ghetto skank bitch","commenter_a":"They have,gotten away with it for six years and will keep doing it tell they leave the white house","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"10153712907532483","commenter_b":"@username, you need be aware that the Christian Bible never tells us to go out and kill others or to be vengeful. Any Muslim who believes the Quran as I believe the Bible would truly be a danger to most Americans.","commenter_a":"I want to speak out and let people know that there are a plethora of southern baptist churches that are very diverse. My pastor adopted his kids from Africa and they are black while he is white. It's a fantastic GODLY southern baptist church. Don't condemn all churches or all baptist churches or all southern baptist churches for what these people have done. This is very sad.","post_message":"\"There was pushback about... the types of children we were bringing in, and I was asked to not invite black children to [Vacation Bible School].\""},{"comment_id":"10153372817373812","commenter_b":"Sign me the ef up!","commenter_a":"@username thank gawwwwd","post_message":"FDA approves new drug that claims to eliminate double chins: @webpagelink"},{"comment_id":"1251187991558679","commenter_b":"And a woman who should be in jail should disqualify to...","commenter_a":"This alone should disqualify this poor excuse for a human being from ever getting close to the White House.If I was the parent of that reporter who was mocked I would hurt down Trump and slap the shit out of him.And you can take that to the bank.","post_message":"This tells you everything you need to know about Donald Trump."},{"comment_id":"10153284807073984","commenter_b":"That thing is female !","commenter_a":"Shame on the university for hiring her and for not firing her......something is mentally wrong with her.","post_message":"Surprise, surprise, she is an extreme liberal.  Does this type of behavior from a teacher make you sick?"},{"comment_id":"10153420455089087","commenter_b":"Oh Brett. That's terrible. I am the wife Brett. I live in Texas, 10 generations next door to Mexico. Are there bad people there coming here? yes! Do we need immigration laws? yes! Will a wall stop it. No Brett. It wont matter how beautiful the wall is or how much it cost or who pays for it. Those drugs you smoke are going to make it here. Nothing you can do about it. The cartel will get immigrants and dope here. If anything there will be more killing and keeping that wall up is going to be draining on the economy. It's impossible.","commenter_a":"Trump's ability to showboat and boast out loud has a hypnotic impact on people who should know better. Please don't buy into Trumpmania.... he is all talk and I thought we were tired of that. You people have short memories. He was a full on liberal democrat just a few short years ago. Trump is telling you what you want to hear. He has no intentions of fulfilling these vocal obligations. It's all lip service and he will cater to his businesses before the people. Just because Bush isn't a loud mouth narcissist doesn't mean he can't get the job done. Trust me, you will never be so sick of anything as you will be of The Donald and his ego driven power play.","post_message":"“Donald I’ll take you on one-on-one in a debate, any time, any place,” Jeb Bush declared. “You name it and I’ll do it.”"},{"comment_id":"1170305866326090","commenter_b":"@username you are the number one reason for birth control!","commenter_a":"I'm so glad they had a chance to speak about their loss. Some people don't care that lives were lost because they want to be so against a movement they can't possibly understand.","post_message":"These mothers who've lost their black children to police brutality and gun violence had a powerful moment at the DNC."}]
