[{"comment_id":"10153281993713132","commenter_b":"She's beautiful, they would make a great couple","commenter_a":"What!?!?! Noris Lizbeth Robles","post_message":"But don't expect them to open up about their maybe-relationship any time soon. #Oscars"},{"comment_id":"10153547473805950","commenter_b":"I meant she's about the most ignorant narcissistic female I've ever seen.","commenter_a":"She's about the most ignorant narcsisci femaale","post_message":"He's \"as much a scientist as I am.\""},{"comment_id":"10153755876406337","commenter_b":"Fuck that hoe","commenter_a":"So I guess they're never ever ever getting back together","post_message":"IT'S OVER: Taylor Swift allegedly dumped Calvin Harris because of an, ahem, \"massage\"..."},{"comment_id":"553065348238039","commenter_b":"Boy please!! Your mama gonna beat you stupid!","commenter_a":"I'm black and voting trump. Most of my family's also voting trump. Even most of my friends are voting trump so the news is a joke nowadays. And in case your all wondering yea we are 90% black family and friends.","post_message":"Here's why Donald J. Trump is struggling to win over black voters."},{"comment_id":"10153270898427217","commenter_b":"Wife is an idiot to allow this! Publicity stunt completely!","commenter_a":"Great job, idiot parents. Way to teach your kids how to be sexist, abusive morons early in life.","post_message":"🎄🎄 Funny or offensive? 🎄🎄"},{"comment_id":"544761025684245","commenter_b":"Liars don't smile a lot.","commenter_a":"What Killiary considers a welcome endorsement would be considered a sin and disgrace to any decent human being. Furthermore , what satan's secretary calls the \"extreme\" position of Republican candidates on women's health is really a quite normal position for any one who wants to protect a babies life and quite possibly the life of the mother as well. Of course that position endangers the finances of planned parenthood so naturally Ms. Richards , who would lose her lucrative job if abortion is outlawed, wants to help elect someone who favors her cause. May God have mercy on Clinton, Richards and all like them who promote the culture of death.(MA)","post_message":"The endorsement marks the first time Planned Parenthood has waded into a presidential primary."},{"comment_id":"890208664347927","commenter_b":"That's a woman^ Meant Selena.!","commenter_a":"Everything is so over sexualized in America. That's what the real problem is. If everyone didn't think of pornography whenever they saw a nipple it wouldn't be such a big deal!","post_message":"#FreeTheNipple is fighting against censorship."}]
