[{"comment_id":"1710841849170298","commenter_b":"We cant have a woman as president we need Bernie or a republican","commenter_a":"Hillary is the devil.","post_message":"We did it, New York. Together, there's nothing we can't do. Watch Hillary live from NYC—and if you've got her back, chip in here: hrc.io/1VhzzV3"},{"comment_id":"691233461036607","commenter_b":"Every \"illegal immigrant should be deported\" good let's start with Malenia Trump","commenter_a":"Every last illegal immigrant in this country should be deported and all charged with a felony for being illegally here. If they come back again, charge the immigrant with two felonies and put them in prison, then deport them again when their sentence is up. If there is a third time for the immigrant to come back, give the natural life sentence. People that come here, should do so legally.","post_message":"Obama deported a record 1.5 million people in his first term."},{"comment_id":"10156506667295354","commenter_b":"MUCK FUSLIMS","commenter_a":"They hate what it stands for Freedom, and they want to take it over, take away all freedom and replace it with Sharia. They will by population growth win this battle and eliminate all non muslim men, women, and your children if you allow them to settle in our Country.","post_message":"\"The hatred of infidels is a religious imperative in Islam. No matter how fast we dance, appease, pay, accommodate, and submit, the hatred and holy war will not cease. On the contrary, the more we submit and reward the hatred and terror, the more we will have to surrender.\""},{"comment_id":"10154913521679714","commenter_b":"In the end you can have Nina Dobrev","commenter_a":"Happy the way God made me.","post_message":"This is what \"the most desirable face in the world\" looks like."},{"comment_id":"694654787391766","commenter_b":"I'm suprised that asshole can even find a bathroom.","commenter_a":"The worst President in US history.........","post_message":"ISIS has officially declared they are coming to America. Obama needs to step up before it’s too late. Is Obama unfit to handle this situation?"},{"comment_id":"1233928029975949","commenter_b":"I got it!! She can't open her mouth without lying through her teeth!","commenter_a":"A few reasons not to vote for Hillary: 1. Knowingly and intentionally destroyed evidence in a criminal investigation. 2. Allowed Americans to be slaughtered when they could have been saved, then lied to the victims families and the American people about it. 3. Rigged the primaries against Bernie Sanders. 4. Selling military equipment and other favors for donations to the Clinton Foundation. 5. Threatening victims of her husbands sexual indiscretions. 6. Risked national security by sending classified information over an unsecured server. 7. Has lost her license to practice law due to dishonesty. I could go on and on with filegate, whitewater, etc., but I think you get the picture.","post_message":""},{"comment_id":"619633688227210","commenter_b":"Why do ugly, trashy white women date jiggers??? oH I THINK I HAVE HEARD WHY...","commenter_a":"Its amazing how hes racist agaisnt white men but not white women whats up with that","post_message":"Obama's ex girlfriend just came forward and dropped a shocking bombshell. This comes as no surprise. He can not be trusted. Are you tired of Obama's lies?"}]
