[{"comment_id":"1792755454298802","commenter_b":"Yeh and you and your daughter took some of those jobs to China.. hypocrite..","commenter_a":"Jonathan oh this guy. How many apologies will he have to make?","post_message":"US presidential candidate Donald J. Trump has issued this apology for obscene comments he made about women in a newly released videotape from 2005. Follow the latest on this story: @webpagelink"},{"comment_id":"502672606580208","commenter_b":"Skinny African","commenter_a":"Chris, paddy maybe?","post_message":"Yes, marijuana gives you the munchies...but it can also make you thinner. Learn more here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"555451794642427","commenter_b":"About 40% of the nation supports Drumpf. The educated States should secede from the Union - ignorant racist are a cancer that needs to be excised.","commenter_a":"Suicide by obstructionist behavior.","post_message":"A lot of discussion has centered around the fact that we might be witnessing the death of the Republican Party. What would that look like?"},{"comment_id":"995165647267071","commenter_b":"Ignorant fucking racist bitch","commenter_a":"Today is the first time I listened to his so-called speech, I usually either hit the mute button or change the channel. I sat through his speech and was dumbfounded...The lies were spewing all over the place, he is such a narcissist and egomaniac I could not believe what I was hearing. I hope and pray that Crooked Hillary, the Benghazi Butcher does not get elected because if she does, we are in for four more years of the same!","post_message":"Simple question: Are you happy or unhappy with the way President Obama has responded to the Orlando attack?"},{"comment_id":"10154493614517235","commenter_b":"How about just sending all of the whites back to their mother countries and leave the Americas to the Natives!","commenter_a":"I've always believed conservatives would destroy this country and it would appear they are well on their way to doing it - maybe we should boot the old confederacy out and let them make it on their own - if Mexico wants texas back, if france wants louisiana, spain wants florida or great britain wants the southern colonies, hey guys don't call us yankees - you got what you wanted LOL","post_message":"BUSTED."},{"comment_id":"10153483204295667","commenter_b":"Nardine","commenter_a":"Robert Taylor","post_message":"Do you see a ghost in this photo? Henry Yau took this photo at the Stanley Hotel, the real-life inspiration for Stephen King's 'The Shining.' Yau says no one was on the stairs."},{"comment_id":"10154042547832411","commenter_b":"Let's get rid of the illegal immigrants you wanna come here do it the legal way and learn to speak English too","commenter_a":"Why don't you dream up a way to protect Chicago!","post_message":"Emanuel asked Trump to continue deportation protections for \"DREAMers\" who were brought to the country before they were 16."}]
