[{"comment_id":"950226215018237","commenter_b":"Or a little pussy like @username","commenter_a":"Conor Lopez Micky Mac","post_message":"The first left me drooling, and the last left me shaking my head. - Franchesca 'Chescaleigh' Ramsey"},{"comment_id":"1704424399796624","commenter_b":"Just shows how retarded womens issues are. realsexism.com","commenter_a":"We're all getting a little over-sensitive about these non-issues, no? Politicians need to smile for likability. Likability is crucial in a candidate. It's why a sweating Nixon went down to JFK. It's why the trope of 'kissing babies' became a thing for politicians of any level. When I think of male pols who didn't smile, they didn't do so hot. Your Bob Doles, your Ralph Naders, your Jim Webbs. All pols need to be likable, and I can remember accounts of the 'dourness' of the above males mentioned in the news, but when it's mentioned about a woman, it's not okay? She's running for President, this is fair commentary.","post_message":"Were other (male) candidates called out the same way?"},{"comment_id":"1212344615481226","commenter_b":"WHAT THE HELL IS WRONG WITH THIS WOMAN?????","commenter_a":"Another sold out politician who went off the deep end...","post_message":"Goodness gracious..."},{"comment_id":"10153908258427235","commenter_b":"Clowns with Guns!","commenter_a":"Listen up numbnuts, the oath to protect the constitution against all enemies foreign and domestic means that YOU are the enemy and should be eliminated. YOU are the one threatening the government, YOU are the one who hates America. YOU are a moron and a #faketriot.","post_message":"These guys are treasonous."},{"comment_id":"1772923492974110","commenter_b":"'@username .. Tippu tip, one of the greatest slave traders known to man that had over 10,000 slaves in Zanzibar, grandmother was a muslim slave. The problem with islam is the contradictions. You inherit the greatness of your lineage as well as all of the ills. The first step for Muslims to get passed this & be accepted in the international community is to accept the past for what it is & stop lying, deflecting, & manipulating it. It only creates more RAGE! Everything in this video is FACT and supported with 100's of years of abundant evidence. This video is actually a low ball. The actual number of victims of islamic genocide s 100 - 150 million deaths. Please stop telling me about 'bilal' that was a slave in the first place by an arab. Abu bakr freed 3 personal pagan slaves for bilal's emancipation. Am I suppose to ...","commenter_a":"This is the blind teaching the blind. A ratings based media hub focusing on the impulses of the ignorant. This is not accurate about Muslims and therefore makes it inaccurate of Arabs. All Arabs aren't white. There was a black Arab named TIPPU TIP, he was one of the biggest contributers to slavery. He was very black. Look him up. Also, a Arab can't teach islam. Because Islam isn't synonymous with Arabs, it's more wide spread with Asians. Indonesia is the largest population of Muslims. All Arabs aren't muslim. And there were many Arabs who rejected Prophet Muhammed. I love history but I hate when people try to each topics of sensitive topics but pose a biased view. Black people must realize we are not all the same. Americans aren't the same a all Africans. We know why we're African, but most don't know we're more American than the white ...","post_message":"10 Facts About The Arab Enslavement Of Black People Not Taught In Schools"},{"comment_id":"10153228975447452","commenter_b":"*facepalm* ... She is an idiot. She should have respected their religion.","commenter_a":"Charge the lady for assault","post_message":"Attacked as they prayed?  A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam  “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."},{"comment_id":"1282426895139188","commenter_b":"Build That Wall","commenter_a":"So sad! Blue lives matter","post_message":"LIVE NOW: Procession now underway in the LA area, for an officer who died in a shooting there this morning. FULL STORY: @webpagelink"}]
