[{"comment_id":"10153853920168145","commenter_b":"Athena Marigold absolutely","commenter_a":"Athena Marigold it's in the paper","post_message":"#BREAKING A shot fired during a domestic dispute hit new father Brian Mortensen as he worked on a nearby fence. On Wednesday, he died."},{"comment_id":"10153181017133690","commenter_b":"Okay white terrorist","commenter_a":"Christian Terrorist","post_message":"'This was not a dispute over a parking space, this was a hate crime,' Mohammad Abu-Salha, the father of the two slain women, said. 'This man had picked on my daughter and her husband a couple of times before, and he talked with them with his gun in his belt. And they were uncomfortable with him, but they did not know he would go this far.' @webpagelink"},{"comment_id":"695324637324781","commenter_b":"Get ISIS and obammy out of AMERICA first. We need to protect ourselves and children. Then we can help ours.","commenter_a":"Wipe them off the face of the earth!!!!!!","post_message":"An innocent American girl was found in the middle of this ISIS debacle. America now truly stands with France against ISIS. Do you think that America should wipe ISIS from the face of this planet?"},{"comment_id":"1731050200496998","commenter_b":"Some mothers eat their young!","commenter_a":"Typical!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153535673013352","commenter_b":"Rosey got no pics cuz she is a big fat pig","commenter_a":"Ape in the house","post_message":"The squatter from hell: Woman ‘moves into $800,000 Martha’s Vineyard vacation home and sells the owner’s possessions in a yard sale’"},{"comment_id":"1205762199443808","commenter_b":"#trump2016","commenter_a":"Oh boo hoo. Poor baby.","post_message":"'Fox News has been treating me very unfairly and I have therefore decided that I won't be doing any more Fox shows for the foreseeable future.'"},{"comment_id":"10155894107865389","commenter_b":"I suggested the other day that we send them ours. We send two criminals for every illegal that comes to the U.S.","commenter_a":"We need leaders with strong convictions for the right thing","post_message":"ICYMI: Last night on 'Hannity,' Donald J. Trump doubled down on his stance on illegal immigration, telling Sean that the country of Mexico is “sending us their criminals.”"}]
