[{"comment_id":"10158094006710354","commenter_b":"Great job! This is why some illegals should be deported","commenter_a":"So sad.","post_message":"HORROR:"},{"comment_id":"10153359134519060","commenter_b":"Oh! You are a geographer or a history specialist Scott. Sounds good. For sure you know Europe is more than UK, Latin America is more than Mexico, and that Egypt is in Africa. Glad to know you really understand the reality and the specifics outside US. It is rare.","commenter_a":"When I read 'Latin America' as a generalization in an article, I tend to be skeptic. You can not compare Guatemala with Chile, Argentina with Mexico. Completely different cultures, histories, corruption level, etc, although all of them are Latin American countries.","post_message":"Crisis in Guatemala: the vice-president quits, the heads of the central bank and social-security institute are arrested and three ministers sacked. Corruption scandals are two-a-penny in Latin America. Few inflict this much damage @webpagelink"},{"comment_id":"943824045713848","commenter_b":"It´s not a coincidence why Jeb Bush started his campaign in Miami...All his Cuban friends were drug dealers as Leonardo Martínez; money launderers as Armando Codina; Medicare swindlers as Jose Miguel Recarey; dangerous terrorists as Luis Posada Carriles and Orlando Bosch....... and every Cuban corrupt politician of Miami. When Jeb Bush signed the law forbidding to give the Driver License to illegal people in 2005 (he was the first governor to do it), he wanted to push the deportation of millions of illegal NON Cubans from Florida, who could not continue driving and give their jobs to millions of Cubans rafters newcomers. Bush never thought in unemployed veterans or other US citizens. He only has Cubans in his agenda.","commenter_a":"He will lead this country to a war in the sand...and your children will be buried there.....","post_message":"How a group of hecklers forced Jeb Bush to go off script and talk about immigration."},{"comment_id":"1308657809199446","commenter_b":"Please! Let her stay home.she's not needed there are many others to take her place.","commenter_a":"Let her stay home.","post_message":"One of the dancers felt 'embarrassed and disappointed' by performing at Trump's inauguration."},{"comment_id":"1672517186342699","commenter_b":"Kiss my white ass.I don't owe you anything","commenter_a":"White lives matter","post_message":"“...white folks actually gotta give up something. You have to actually sacrifice yourself. You have to be willing to give up the things that you currently benefit from.”"},{"comment_id":"367411220096110","commenter_b":"Dalia Montosa","commenter_a":"Katherine Cardenas","post_message":"No bridesmaids assistance necessary!"},{"comment_id":"10152881213667894","commenter_b":"Ciara can't sing, same songs to a different beat. She can compare herself to Mya or Ashanti who is and was a bigger artist then Ciara","commenter_a":"Hits yes, talent, no","post_message":"Do You Agree? Ciara Says She’s Had Hits 'Just as Big' as Beyoncé and Rihanna"}]
