[{"comment_id":"1162051423814886","commenter_b":"What is a liberal?","commenter_a":"Keep it up NBC your imaginary war on Trump is backfiring on you and fox! The more you bash the better he appears! He represents the millions you ignored for the last eight years! The people are turning against the press and are taking what he says to heart! Many Republicans and Democrats like him!","post_message":"Trump said the female journalist who moderated the GOP debate had \"blood coming out of her eyes, blood coming out of her wherever.\""},{"comment_id":"1062046730518522","commenter_b":"Hillary To Prison!","commenter_a":"You have my vote, @username. As a United States senator and a cabinet secretary, you learned how to compromise and work with your rivals. With you, we know what we are getting authentic experience.","post_message":"I got into this race because I want to improve the lives of all Americans—and I’m going to continue to work my heart out. I hope you’ll join me. Onward to Iowa. -H"},{"comment_id":"789227971267780","commenter_b":"She's no lady !!!","commenter_a":"I am a democrat, yes a liberal and I have nothing but respect for our law enforcement officers. This young lady has a bad attitude and needs to learn respect. He did his job. No one is entitled.","post_message":"Obama Support Gives Cop Serious Attitude, Immediately Get’s What She Deserves [VIDEO]. Wow, she just made the biggest mistake of her life. Do you support our men and women in blue?"},{"comment_id":"1136350429757739","commenter_b":"She needs to excuse herself from this case.. this is a total conflict of interest!!","commenter_a":"Crooked ass administration...don't force us \"We The People \" have had enough","post_message":"What the WHAT?! This cannot stand."},{"comment_id":"10153516705331337","commenter_b":"I'm sorry but what did he expect...how sad that I grew up.on this family show N all his family n friends stood by him while he lied","commenter_a":"Bye asshole.","post_message":"FALL FROM GRACE: The Bill Cosby saga continues as word has broke that the comedian's talent agency has cut ties with him over his sexual allegations..."},{"comment_id":"10153667125634087","commenter_b":"@username its like talking to children that can't do math.","commenter_a":"Nate Silver has moved Sanders to winning this primary with a close to 60% chance . Mind you, just DAYS ago he had Hillary with an 80% chance of winning. The wider the margin the merrier. The small Wyoming caucus is next. And Hillary's lead in the April 19th NY primary is down from 30 to 40 point lead down to 12 in the latest poll","post_message":"#BREAKING: Another poll shows Bernie Sanders slightly ahead of Hillary Clinton in the all-important Wisconsin primary"},{"comment_id":"1015168871918572","commenter_b":"Build the wall","commenter_a":"Bring it on, freight train.","post_message":"RT U.S. Imam “Muslims Have The RIGHT To Take The Property Of FILTHY Christians And Jews” @webpagelink"}]
