[{"comment_id":"10152939984116680","commenter_b":"Right Dave, when he was running in 2008, did you support him then?? Do you remember what horrible things Dems said about McCain ?","commenter_a":"Im a Democrat embarrassed by Trumps remarks!!!!","post_message":"In a stream-of-consciousness address, the real-estate mogul riding high in Republican polls sticks to his favorite targets."},{"comment_id":"10153212964226336","commenter_b":"Daniel Eskildsen just because this women gave her kid a cookie doesn't mean she fills her kid with junk food.. cookies in my house are a treat to the healthy diets I have my children on..","commenter_a":"Teachers need to worry about teaching and not parenting","post_message":"Cookie crackdown! A preschool teacher sent a note home reprimanding a Colorado mom for packing Oreos in her 5-year-old daughter’s lunch."},{"comment_id":"1642472956011827","commenter_b":"Hillary Clinton is against Christ and she is for anything illegal immigrants bring her money. .","commenter_a":"What would you have us call them, Hillary? They are in our country illegal,,,duh.","post_message":"Hillary Clinton says the term \"illegal immigrant\" is offensive and shouldn't be used. Is she right, or is this political correctness gone too far?"},{"comment_id":"10154315963468812","commenter_b":"Weed makes you hallucinate now? Yeah let's ask the 2 ladies who have obviously never tried it.","commenter_a":"I still don't understand how marijuana is in the same classification as heroine and LSD, even though it's helping people walk! Meanwhile Oxy is prescribed every day and it's ruining peoples lives...","post_message":"Federal authorities are reviewing the possibility of loosening the classification of marijuana, which is currently in the same class of drugs as heroin and LSD."},{"comment_id":"10155086722556323","commenter_b":"@username Will it be a big, beautiful wall?","commenter_a":"I can see the 'Jungle' camps with the immigrants around the NI border already :)","post_message":"Ireland prime minister has warned that avoiding a post-Brexit border is now vital for the republic national interest."},{"comment_id":"1418008091611056","commenter_b":"I bet you a thousand dollars her girls didnt eat that crap they served. Im also sure she herself never ate that crap. She had a full service crew of chef's preparing her gourmet foods 24/7.","commenter_a":"Lunch program? What lunch program? My daughter will never eat lunch at school so I have to fix it for her everyday. On the few occasions where she had to buy it she says it's terrible and she didn't eat it. They serve stuff like corn dog tots with tater tots total processed garbage that doesn't even taste good. What tF is so hard about giving them a piece of chicken on a wheat roll with a piece of fruit?? It ain't rocket science people.","post_message":"Michelle Obama's legacy is already unraveling..."},{"comment_id":"10153454248817377","commenter_b":"That is very wired how has Trump got millions more votes than Lyin' ted? Why does Trump almost have a 290 delegate lead? Why Has Trump won most States? Why does Trump only need 53% of remaining delegates to get to 1237 delegates and Lyin' Ted need all but 50 delegates or 92% of the remaining delegates? You may also want to got to real clear politics and recheck your poll.","commenter_a":"Contrary to the media narratives -New York is not the center of the Country - so, It is not a big deal to win your home state. The cheer leaders want other Northeastern States to fall in line behind New York. Conservatives believe that the voters in other Northeastern States have a mind of their own. This is also not a big deal win for Trump because of the all the votes cast for both the Democrats and Republicans running in the NY Primary, only 20% of the Vote went to Trump, even with his, so called, big victory... Which makes it clear that no Republican running is likely to win NY in the General Election. So - this Primary has very little significance for who should be the nominee.","post_message":"Donald J. Trump on New York Primary win:"}]
