[{"comment_id":"10154244908884778","commenter_b":"So even if u were be low society's best u would deserve to die ? That's where we should bring some type of responsibility to the government for bringing drugs into this country in order to rid certain races but we don't punish the king pin we look down on those trapped by the government SMDH!! Wake up people white black Puerto Rican Asian r all using drugs of some sort the majority of those being punished are black people & this has been going on for decades!! SLL LIVES MATTER @username I guess you & all your family is perfect so go to work or at least get off my post","commenter_a":"That's a COP OUT pun intended !! Those officers need to be accountable for their actions!! Money won't bring Freddie Gray back SMDH","post_message":"#BREAKING: Baltimore officials came to a $6.4 million wrongful death settlement with Freddie Gray's family on Tuesday, our news partners at the Washington Post report."},{"comment_id":"10152697145362144","commenter_b":"Sam. The lowest approval rating ever goes to Obama.","commenter_a":"No he is not. I am so disappointed in how NOT liberal he is and I voted for him twice.","post_message":"Obama is the most liberal president since LBJ. But that's not what conservatives hate. They hate him because he's also the most effective Democratic president since LBJ."},{"comment_id":"10153048928789071","commenter_b":"We have to build a wall...","commenter_a":"@username gute Nacht murica","post_message":"A Univision reporter gets kicked out of a Trump event"},{"comment_id":"987975737904514","commenter_b":"obitch isn't happy unless she's ruining things for chidren","commenter_a":"She has no Constitutional authority at all...why do we allow her interference in our schools, homes and communities?","post_message":"Michelle Obama wants to BAN HALLOWEEN!"},{"comment_id":"937107439663448","commenter_b":"These ladies look forward to the attention of their dress, slot b of time and money is put into finding the perfect dress ,I don't watch the awards I could care less but I know people who watch it just to see what is being worn them turn s it off","commenter_a":"non-story","post_message":"When it comes to the Academy Awards and other red carpet shows, this is what smart, successful women get asked about instead of, you know, their accomplishments. Sigh."},{"comment_id":"1153132958040066","commenter_b":"All 3 should be skinned and decapitated!","commenter_a":"And everyone \"outraged\" are all Vegen, right?!! Where is the outrage for the 100's of 1000's of innocent babies murdered every year???!!!","post_message":"The U.S. tourist who who killed Zimbabwe's beloved lion, Cecil, received global condemnation as news spread. Read more here: @webpagelink"},{"comment_id":"10155013183823984","commenter_b":"And your fat ass bitch!!","commenter_a":"He is a total brain dead idiot. Every state only has two senators. Even tiny little Rhode Island. We have 50 states and 100 senators. Congress is according to population. Actually we need to go back to how the founders originally had it, where the states legislatures picked Senators and when they misrepresented the state they could recall them. Then the Senators wouldn't be persuaded by donors.","post_message":"President Barack Obama just made a staggering announcement about the Electoral College days before the electors cast their official votes..."}]
