[{"comment_id":"901967236585038","commenter_b":"she has blood on her hands !!! Bengazi !!","commenter_a":"AWESOME","post_message":"In the just out Fox News Poll, I easily beat Hillary Clinton - and I havn't even focused on her yet. On our way: MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10152878773282217","commenter_b":"Jeanette is a bit of an obsessed weirdo","commenter_a":"Organised religion is worse than organised crime","post_message":"Why is Magna Carta so important?"},{"comment_id":"10153166532823188","commenter_b":"Women voting for conservatives are the ultimate foolish morons...","commenter_a":"I am a conservative FIRST and there is NO other party to which I can relate...I pray for common sense and decency to prevail but I REFUSE to ALLOW a few bad apples to make me think there is no hope within this party!!","post_message":"It's too late to save it."},{"comment_id":"959728980774046","commenter_b":"This is ridiculous ! We are a Christian based country . Muslims need to get the hell out and take their evil ideology with them ! NOW !","commenter_a":"YES !!!","post_message":"Obama Gave Millions To This Mosque In America, But Look Who Owns The Mosque This shows you exactly where his true allegiance lies. Do you think Obama is a traitor?"},{"comment_id":"10154107303310286","commenter_b":"This has been my home longer than it's been yours.","commenter_a":"Go home","post_message":"#BREAKING: Organizers estimate around 250,000 people flooded the streets for the Women's March on Chicago – more than three times the expected attendance. Details: nbcchi.com/eWVXidj"},{"comment_id":"10157240650595294","commenter_b":"Nice dress","commenter_a":"I hope we get rain.","post_message":"Will rain get in the way of your Fourth of July celebrations? Jenn Harcher, Meteorologist is going to let us know!"},{"comment_id":"10155752505360354","commenter_b":"He is done by wanting Oprah as his VP! He shot himself in the foot in one day;","commenter_a":"A man who's made billions... yea, that's what we need, another corporate hive-mind in a leadership position. Wake up.","post_message":"Think Donald Trump lacks serious policy proposals? Think again."}]
