[{"comment_id":"10153105313784203","commenter_b":"Speaking of Obama not attending a rally in France, how about Bush, Cheney, and other Conservatives not attending the 9/11 memorial in their own country @webpagelink","commenter_a":"Unlike the communists digging up Kathy Griffin and Margaret Cho, Jay is actually funny.","post_message":"Why the hell do Republicans love Jay Leno so much?"},{"comment_id":"10153444568593984","commenter_b":"hillary shouldn't even be allowed to run, she and all her and obamas co-horts should be in jail for treason. and what would be so bad about going back to the 50's. that was a great time to grow up. at least the govt. was 80% honest and not 99% dishonest. if she gets elected then something is diffinitely wrong with this country and the people in it.","commenter_a":"Sorry Mr. Levin but unless the Republicans can come up with a candidate who doesn't still live in the 1950s and can stay out of people's bedrooms, Hillary will win.","post_message":"BOOM! Outspoken Levin just stepped up to the plate and asked what everyone else is thinking. Hillary will NOT like this one bit... Do you support Mark Levin?"},{"comment_id":"614554242047139","commenter_b":"And Bill's a natural player , what a fraud the Clintons are .","commenter_a":"ring a ding, a ding ding, blow it out his smarmy lying blowhole!","post_message":"\"She's a natural leader, she's a good organizer, and she's the best darn change-maker I ever met in my entire life.\" President Bill Clinton said Hillary Clinton is \"worth every single year she's put into making people's lives better.\""},{"comment_id":"1333958173358453","commenter_b":"@username you racist prick","commenter_a":"#FakeNews THIS is what it really looked like.","post_message":"An estimated 700,000-900,000 people attended President Donald J. Trump's inauguration today, about half the number of people who attended Barack Obama's eight years ago. @webpagelink"},{"comment_id":"10153573434494087","commenter_b":"Oh for the love of God, I fear for the United States when that evil emotional vampire gets the keys to your White House!!! Vote Trump. Vote Sanders, for all things decient don't have that evil woman near the White House","commenter_a":"Trump for President and Hillary for Prison","post_message":"Two of the top three most retweeted tweets of last night's Republican debate were from Hillary Clinton, while none of the GOP candidate even entered the top 5."},{"comment_id":"10153686254615653","commenter_b":"\"Poor Catholic Hispanic Immigrants\". Key Word : Illegal","commenter_a":"Donald Trump says he would force Mexico to pay for a border wall as president by threatening to cut off (rob) the flow of billions of dollars in payments that poor Catholic Hispanic immigrants send home to their native country, an idea that could decimate the Mexican economy and set up an unprecedented showdown (Trade War) between the United States and a key regional ally. #NeverTrump #ReverseRobinHood","post_message":"Stronger together."},{"comment_id":"10153840856185950","commenter_b":"Luckily that woman is not running @username, I wouldn't vote for her either!","commenter_a":"If you believe this false report you're an idiot. If you vote for Hillary Clinton you're an idiot. After all these lies and scandals surrounding this woman I can't see too many bright people voting for her. Trump's going to be our President!!!!!!","post_message":"Hillary Clinton's expansive lead is due to support from women and non-white voters, according to the survey."}]
