[{"comment_id":"565700806961575","commenter_b":"Don't they get it! We don't want her!","commenter_a":"Hillary will probably die before then of karma and natural causes!","post_message":"Trump-Clinton rematch for 2020?"},{"comment_id":"10153286761179586","commenter_b":"The same with all Zoo's and not only seaworld. But if he or she is born in a Zoo or seaworld, they will have hard time to survive the real world and maybe die of hunger. So what to do? let them live in seaworld or zoo? kill them now? or let them free so they my die a slow dead of hunger because they never have learn how to hunt and survive?","commenter_a":"Assholes!","post_message":"How much space does an orca at #SeaWorld REALLY have? @webpagelink THIS is why they swim in circles in their tanks. The chart at 0:20 seconds explains it ALL."},{"comment_id":"10153769557012411","commenter_b":"Very few companies offer health insurance to retirees.. very few!!! Probably government retirees is about it..","commenter_a":"Congratulations to her, but did the massive company McDonalds, give her retirement benefits or health insurance after 32 years?","post_message":"“She is one of the most beautiful and upbeat people you could ever hope to know.\""},{"comment_id":"10154130696774087","commenter_b":"PRAYING JUSTICE PREVAILS...After hearing about Obama using a fake name to communicate with Hillary on her unsecured personal server, it explains why Hillary was given a pass and never indicted. Their corruption is as thick as sewage all the way to the top of the White House. This is unacceptable. \"Deplorable\" is Hillary and Obama. Hillary and Obama for prison... Donald Trump for President!! Hillary is not an option... ##TrumpPence'16","commenter_a":"The GOP spent millions of our taxpayer money, and they proved that Hillary was blameless for the response to Benghazi. Just wait, the GOP might just open up yet another wasteful investigation. :D","post_message":"“What Hillary tried to set up and what they apparently spent months preparing is an ambush as false as Benghazi,” Newt Gingrich said."},{"comment_id":"10154603481037994","commenter_b":"How can you kid nap your own kids is as stupid as how can your rape your own wife","commenter_a":"That's messed up. I wish I knew more but she shouldn't have to go to jail. She's a mom and those are her kids. She shouldn't have done what she did but at the end of the day those are her kids too.","post_message":"The mother was scheduled to return the two little girls to their father -- but never came back."},{"comment_id":"1835870700020882","commenter_b":"Woman belong in the streets, your right...","commenter_a":"Every single person that's out there marching there's 10 that wish they could have","post_message":"From CommonDreams: \"The second day of the Trump administration has seen an unprecedented wave of protests swell across the globe, as the Women's March on Washington and its sister marches on all continents—yes, including Antarctica—fight back against the U.S. president's frightening rhetoric.\""},{"comment_id":"1333672556666443","commenter_b":"but know to make tanks and bombs 😅","commenter_a":"Those migrants were never going to fulfill those jobs anyway. The Syrian migrants are larely unable to learn German to a competent level, and lacked basic education before they came. They are just going to be on the taxpayers' dole. Huge mistake bringing that many in.","post_message":"Unemployment in the engine room of Europe is at a 25-year low."}]
