[{"comment_id":"10153373472869411","commenter_b":"Bugger off Rosa!","commenter_a":"Will sodomite marriage replace traditional marriage in Ireland?","post_message":"Check out our interactive map of the #hometovote trending worldwide  inside this article"},{"comment_id":"1307978642581533","commenter_b":"@username,you're lying, white folks were looting,breaking in stores,starting fires at the riots especially in Ferguson. As a matter of fact,the cops had pulled over a pick-up truck with 4 white guys in it with molotov cocktails. And this was Ferguson. In Atlanta, 10 white people were arrested for trying to block traffic,they were the first to do it. During the L.A. riots, white girl made the front page. She was running out of the store arms full of clothes. And you have never heard a black person say they burn and loot because of their culture. So you're lying again. Speak on the whites that loot and burn when their favorite team loses. Stop acting like whites are not out here doing the same. Oh boy, I should have known you was going to bring the President into the post,typical of your kind. Always finding a reason to blame him. ...","commenter_a":"Black on Black crime strikes again. No outrage as usual by BLM or anyone in the racist black groups of Cop haters. Where's the concern for this boy ? No concern since it was a \"Culture\" killing ? Heard that whites don't understand their \"Culture\" I understand you folks don't give two shitts when it's black on black crime.","post_message":"A 3-year-old boy on a shopping trip with his grandmother was shot and killed during an apparent road rage incident, police said. @webpagelink"},{"comment_id":"488489361275658","commenter_b":"Don't think she will get off easy this time.","commenter_a":"She will get off easy because she's a cops wife","post_message":"A cop's wife did this to another cop's wife. I wonder what on earth she was thinking!"},{"comment_id":"10152712712566545","commenter_b":"That was a WOMAN.","commenter_a":"That lady in the van just opened a can of Whoopass","post_message":"Here's the incredible ending to a nerve-wracking chase in Dallas County. We'll have the latest on News 8 at 4.  TO WATCH/READ MORE: @webpagelink"},{"comment_id":"635686593246783","commenter_b":"@username As much as you might want there to be, there is Nothing wrong with Hillary's e-mail account! Just ask Colin Powell and Condoleezza Rice, who operated the same way.","commenter_a":"if I vote, I want it to count and be counted, that's the promise, Every Vote Counts, well except when Bush was elected","post_message":"It is probably way overdue.  Conservatives Are Destroying Our Future"},{"comment_id":"1803773783230243","commenter_b":"This woman is nuts.","commenter_a":"Too bad she failed to get the same treatment for Hillary Clinton.","post_message":"Dems are already talking Impeachment.  Check out this load of BS."},{"comment_id":"855684411135567","commenter_b":"what mexicans smuggling drugs into our country? no WAY! shoot them","commenter_a":"Hmmm... hemp mattresses.","post_message":"Nice try."}]
