[{"comment_id":"1107974842571087","commenter_b":"She lies and lies and lies and lies and . . .","commenter_a":"I AM SO DISAPPOINTED BY YOUR NEW JOB DR BEN CARSON , YOU WERE BETTER AROUND WHITE COAT....[...]","post_message":"Is anyone surprised?"},{"comment_id":"10152882517291051","commenter_b":"Just lie a Black woman to get defensive-----you have a crush on him? Michelle won't like it.","commenter_a":"A lot better the Barack Hussein Obama.","post_message":"The next time you meet someone who doesn't like their name, tell them about this guy and remind them that it could be worse."},{"comment_id":"10153871154220329","commenter_b":"SHE is a WOMAN.","commenter_a":"No man can bear children. She's a woman, fact.","post_message":"\"One came from daddy's tummy and one came from mummy's tummy.\" (via BuzzFeed Trending)"},{"comment_id":"10150603929279999","commenter_b":"Aren't they real women? What's a real woman, and who doesn't qualify ?","commenter_a":"Perhaps a more diverse group by race, ethnicity and cultural but alarmingly the same re: the skinny, young and sullen look of mannequins rather than real women...","post_message":"Meet the woman behind the unconventional beauty of today's most successful models."},{"comment_id":"10153479348993812","commenter_b":"Nobody wants to see your tears lady, we are saving them for the hero you murdered and left to die. Piece of crap.","commenter_a":"She got what she so obviously deserves!!!","post_message":"Woman charged with murder, accused of killing US Navy sailor in fit of road rage: @webpagelink"},{"comment_id":"10154281842244726","commenter_b":"We the people ? ? ? , , , . Give me a break, , , your pigs in a cesspool of immorality . Eat shit and die.","commenter_a":"Hypocrites","post_message":"The Left would call violent protests a ‘hate crime’ if roles were reversed."},{"comment_id":"447409202129260","commenter_b":"She is the best candidate!","commenter_a":"Dear God deliver us from this evil!","post_message":"Slap Yo'self! www.eaglerising.com"}]
