[{"comment_id":"1048428675208939","commenter_b":"'@username What are you reading? How did the US government start this war? The Syrians and everyone else out in North Africa and the Middle East have access to the internet and make their own decisions. When people have access to information freely they act accordingly. People have free will to think and make decisions. No one forced the Syrians to fight or oust Assad. He cracked down on protests violently and this is the result.","commenter_a":"How can Assad sleep at night knowing he is responsible for the deaths of 300,000+ of his own people. It's disgusting","post_message":"What chance is there for peace in Syria? Join our Q&A"},{"comment_id":"10153461070784614","commenter_b":"Yup they should FRY !!! Not next week not next year but NOW !! Those are extremely sick people who can do that and don't deserve to breathe air .","commenter_a":"Sick. There are really some evil people in this world. God rest his soul","post_message":"A good Samaritan who offered his help as an AA sponsor was lured to a downtown L.A. hotel by a couple for the purpose of fulfilling 'long-held fantasy' of dismembering a body, prosecutors say.  Edward Garcia was convicted of murder Tuesday in the torture and dismemberment death of Herbert Tracy White.  Prosecutors say Garcia carved up White's body with a 3 1/2-inch blade and dissected and sliced a piece of leg muscle from the bone.  Hotel employees found White's severed arms and a backpack full of flesh in the room. Under the blood-soaked bed was White's torso riddled with scratches and small punctures.  'It was a bloodbath,' prosecutor John McKinney said. 'They took this man apart.'  Read KTLA's story here: @webpagelink"},{"comment_id":"10153951102966234","commenter_b":"She should had gotten revoke of gun license and probation","commenter_a":"'@username u was jus talkin bout dis , she got 3 years","post_message":"Itiyanah Spruill pleaded guilty to child endangerment charges in connection with the death of her 4-year-old son."},{"comment_id":"1187848264597052","commenter_b":"Do you want to be responsible for a bus full of kids? Better to keep them home than risk it","commenter_a":"Why don't people buy chains? I don't get it","post_message":"JUST IN: Per the Flagstaff Unified School District, all FUSD schools will be closed on November 29th due to icy road conditions."},{"comment_id":"672161809583667","commenter_b":"This gal is a piece of .......","commenter_a":"Nothing quick about judging this one. It's been years in the coming","post_message":"I'm sorry....I'm not a fan."},{"comment_id":"10154151244455579","commenter_b":"A fool and her money are soon parted.","commenter_a":"Just now donated $20 for Hillary Clinton and committed to caucus in my state hope you do the same right now:) I am voting for Hillary because I fell she is the best qualified person. Three Supreme Court Justices will mostly likely be appointed and I want a democrat to be the one to select the appointees. She can do it better than Bernie plus backwards and in High Heels. We have made such progress under President Obama I would like to see how much more we can continue to do and I trust her and honestly know she will be the best Person and successor to Barack Obama additionally she has devoted her 'entire life' to bettering the lives of the American People.","post_message":"Hillary Clinton: 'We are going to fight for every vote in every state.' Full video here: @webpagelink #CSPANfan"},{"comment_id":"480862922104288","commenter_b":"Let them go swim in there on country. We dont need them polluteing our pools.All that goat hair will mess the pool up.You want be able to drain it.","commenter_a":"Send these people packing","post_message":"A judge just ruled that public pools must allow Muslims to swim in 'Burkinis'.  We're tired of Muslims infiltrating our country. This stops now.  Do you agree that 'Burkinis' are WRONG?"}]
