[{"comment_id":"10153217105611336","commenter_b":"Nah he's just a pussy","commenter_a":"If I were on the Baltimore police force I would walk off the job","post_message":"JUST IN: Five of the six Baltimore police officers charged in the death of Freddie Gray are in custody, according to Mayor Stephanie Rawlings-Blake. @webpagelink"},{"comment_id":"958986307470162","commenter_b":"Beware, ladies!","commenter_a":"There's zero evidence supporting that he was filming her. The only harassment caught on film was of the women berating a man. This guy will have a great lawsuit for slander against her.","post_message":"This woman just gave a street harasser a taste of his own medicine."},{"comment_id":"10152709124101545","commenter_b":"And a healthy sex life;) lol love u baby!!!","commenter_a":"Me and @username have been married 13 years.... Trust, communication, honesty, & endless love... Agree on things, if you don't, work it out. Don't keep money from each other, if your having problems sit down and go over your financial obligations. Set a budget. Go to parent conferences together to understand your child's growth and development ... That simple","post_message":"Do you know the secret to a long and happy marriage? We want to hear from couples who’ve been married 25 years or longer to get advice on making it work. Comment below, and we may reach out to you for an interview."},{"comment_id":"952811251478596","commenter_b":"@username how about you go fuck yourself","commenter_a":"Wow, while I agree that both parties are leading us down a rabbit hole. The fact is we have two parties that lead us in this country. The democrats have a criminal and a socialist as front runners in their campaign. So I have no alternative but to endorse the republican party. If my friend that liked this post feels that makes me anti American then I guess we don't know each other as well as I thought.","post_message":"This HAS to be said. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10156293544295354","commenter_b":"@username why don't you move to the UK where you will be safer after all criminals don't have guns because they are illegal there and everyone know criminals obey gun laws .","commenter_a":"I'm a huge 2nd amendment advocate and there are 1000 reasons why the gun control crowd is wrong, but I really don't care for this particular argument. Public people are at more risk than private people to become victims of crime. Any of us can become victims of random crime, stalkers, etc., but overall, the public officials and celebrities draw more risk in that regard. Hillary is so loathesome and widely despised, she probably would have been gone long ago if not for that armed security. I, OTOH, just recently bought my first gun and didn't piss off anyone enough to want to kill me. I like to use that famous Japanese quote in WWII as to why they didn't even consider invading the U.S. - \"Invade the U.S.? Impossible, there's a gun behind every blade of grass\". Our guns keep our nation safer and serve as, I hope, some ...","post_message":"Hillary Clinton: If you truly believe guns don't save lives, why do YOU have armed security protecting YOUR life with guns? We regular folk can't afford to live in million dollar mansions like you and Bill do. Why don't you want us to protect OUR families and children with guns when you use them to protect yours? Signed, AMERICA"},{"comment_id":"10153708234594199","commenter_b":"Then go. If they let you in. Otherwise.... You might end up an illegal alien. Ironic, eh?","commenter_a":"Canada looks better everyday.","post_message":""},{"comment_id":"10155992640990354","commenter_b":"They are none good roll models..they don't need these women as anything but singers..and you need to make sure they are dressing like hos..cause thats what all little girls seem to want to dress like..it's to late anyway..all of us have allowed them to face a world thats gone insane..they wont be in a world like we had..it's over..they will have abortion..hate..sex that kills..and men cutting off their heads and men raping them...so keep worrying about music..clothes..fingernails..princesses..and cutey stuff...they are doomed...and we let it happen.","commenter_a":"Taylor Swift is a good role model. Myley Cyrus is NOT a good role model. Taylor Swift writes and sings her amazing hit songs. What does Mylie Cyrus do? Sing and not good at all. My girls love Taylor Swift!","post_message":"Which is worse: Kiss Kiss or Bang Bang?"}]
