[{"comment_id":"10153448214053984","commenter_b":"That lady has a problem nice in front of kids","commenter_a":"He was absolutely right in what he did. People like her should be called out. They have no respect for any rules, they think they don't apply to them.","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"10154269776132619","commenter_b":"What is ISRAEL SUPPOSED TO DO?????????? let the rest of the world walk all over them????? I don't think so..... If a lot more countries in the world were like ISRAEL the world would be a better place....","commenter_a":"Let's black list the UN. It needs to go. Thugs in suits.","post_message":"A push is currently being made in the United Nations to have the Israeli Defense Forces added to the blacklist of the council for Children and Armed Conflict."},{"comment_id":"10153416181512217","commenter_b":"if I had to go, this is how I'd do it","commenter_a":"'@username this is like your entire sense of humour in one headline","post_message":"Father Stephen Crossan has taken extended leave from the priesthood."},{"comment_id":"483283155193311","commenter_b":"Good ridance! Sorriest show on TV. Sorriest people on a show on TV. Both of the women above should be in a mental institution. Lock them two and Obama in a room together and let them live out their lives in peace. :)","commenter_a":"Hope so , it will be a blessing","post_message":"FINALLY!"},{"comment_id":"10154299130956077","commenter_b":"Trump women are hot","commenter_a":"Shots everytime trump stutters or says he has property there","post_message":"Hillary Clinton and Donald J. Trump meet in St. Louis for the second presidential debate."},{"comment_id":"1349219015129494","commenter_b":"Stfu","commenter_a":"Trumpers 2 days ago: yay Castro is dead! yuge win for free speech and human rights! CheetoJesus: citizens whom use their rights of free speech and ability to protest should be jailed or deported! Trumpers today: praise our Dear Leader! deport those commies!","post_message":"A fiery debate erupted over President-elect Donald J. Trump's proposed penalty for burning the American flag"},{"comment_id":"10153383091468984","commenter_b":"If her mouth is moving she is lieing.","commenter_a":"She will say and do anything to get back in the White House but she really belongs in jail","post_message":"I can't believe she tried to pass this off as fact. Even Bill has to be shaking his head about this one...  Do you think Hillary has a problem being honest?"}]
