[{"comment_id":"10154001365909497","commenter_b":"There are plenty of nice average looking women that \"nice\" average looking guys ignore because they chase hot chicks. It works both ways.","commenter_a":"Local man who would be good provider for area woman`s kid friendzoned while area woman dates unemployed band members. Area woman complains about lack of good men.","post_message":"\"If they find a cure for Zika tomorrow, it not like I can afford to get pregnant under my current insurance plan.\""},{"comment_id":"795368217263025","commenter_b":"I'd go and break it off in her ass, show the Bitch who's Boss","commenter_a":"I think if they are seriously considering removing her, an independent moderator, because Trump backed out of the debate and their worried about ratings, then I think all of this proves what a sham these debates all are. #StandwithRand","post_message":"Should she be removed?"},{"comment_id":"1227725310657052","commenter_b":"Please don't reproduce.","commenter_a":"Trump incites violence. He is bringing the racists out in droves and he is dividing this country. Since he came on the scene, there has been more hate crimes than I've ever seen. Wake up people!","post_message":"The sniper attack on Dallas police officers now ranks among the deadliest against U.S. law enforcement since 1900."},{"comment_id":"1065496103473179","commenter_b":"J.K. needs to mind her business.","commenter_a":"WOW! She shut it down! OMG! Trump is backing down because a writer...no wait! This article isn't about the writer...it's not about Trump. It's about Pierson. No wait, it's about a writer comparing to one of her make believe characters. Jesus, if your going to attack; pick an opening paragraph and stay on topic. If you can't do that...atleast get the headline to reflect the topic...","post_message":"Just 5 words  and they say it all."},{"comment_id":"10153487443061336","commenter_b":"Lawrence and Ruthanne Dolezal parents, both white as snow. Only time she is black is when the lights go out.","commenter_a":"OMG how proud her folks must be. Shes as black as Obama is white.","post_message":"“I wouldn’t say I’m African American, but I would say I’m black.”   Former NAACP leader Rachel Dolezal said in a new interview that she didn’t deceive anyone about her race."},{"comment_id":"10154522868449087","commenter_b":"Fuck this old communist bastard!!!!","commenter_a":"Your anti Muslim propaganda does that! Trump is anti Radical Islamic Jihadists! Got a problem?","post_message":"Bernie Sanders: \"Trump's anti-Muslim order plays into the hands of fanatics wishing to harm America. Love and compassion trump hatred and intolerance.\""},{"comment_id":"760258614149329","commenter_b":"She need to be grabbed by the pussy","commenter_a":"Agree! Stop whining you liberals!","post_message":"Nicole Kidman: “I would just say he’s now elected, and we as a country need to support whoever the president is, because that’s what the country’s based on.”"}]
