[{"comment_id":"1711366762447074","commenter_b":"'@username don't worry when trump gets in office you'll be deported! Hurry up trump get this Mexican out of here!!!! Let's make America great again!","commenter_a":"So unprofessional. What happened to the president being formal. Not making himself a meme. It's pathetic. The Obama administration is an embarrassment to this country.","post_message":"WATCH: In celebration of Star Wars Day, The White House posts video of President Barack Obama and First Lady Michelle Obama dancing with R2D2 and stormtroopers. @webpagelink #MayThe4thBeWithYou"},{"comment_id":"10156224607550354","commenter_b":"Thought she was an illegal immigrant.","commenter_a":"Is it any surprise she is black","post_message":"The Obama Administration continues to deny the food stamp fraud crimewave exists.   Instead, it continues to balloon the already exploding program. Check out the numbers..."},{"comment_id":"10153294543663701","commenter_b":"Lets here the song about an old woman molesting you when you were a kid.. LMAO!","commenter_a":"'@username :)","post_message":"Garth Brooks rocked the Rose City on Sunday! If you missed out, the Moda Center just announced that limited tickets are available for his three remaining Portland performances."},{"comment_id":"939719642754180","commenter_b":"Or he could just drop dead and save his family the embarrassment and the courts the cost.","commenter_a":"IF any of this is even true, if you waited this many years, you own it. Grow up.","post_message":"The once beloved comedian will hopefully not get away with his alleged horrific crimes against women."},{"comment_id":"10152512377042377","commenter_b":"RINO !","commenter_a":"He'd be bad for the workingman","post_message":"Romney 2016???"},{"comment_id":"10154594617592235","commenter_b":"Forgot this","commenter_a":"Typical conservative lack of knowledge. And yes, libertarians are conservatives. They are republicans. Believe me, they are republicans. Believe me. Republicans. Libertarians are republicans. Republicans. (Doing my best Trump impersonation, repeating myself over and over again. Repeating myself. Over and over. Believe me. Over and over)","post_message":"What the hell?  They announced victims right from the start."},{"comment_id":"10154327870086509","commenter_b":"If they did who cares cnn enjoy the holidays merry Christmas to the Muslim world . Leave cnn racism behind .","commenter_a":"and lovebirds don't own February. So wtf is your point?","post_message":"'Christians don't own December,' one atheist writer says."}]
