[{"comment_id":"10153357248947061","commenter_b":"silly girl","commenter_a":"'@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"10152942942461130","commenter_b":"You'd call them 'girls with their vaginas hanging out, ass showing and everything else.' Cool ?","commenter_a":"Good. This needed to happen.","post_message":"Um..."},{"comment_id":"899588953421066","commenter_b":"Even Satan and the demons in Hell believe God exists. They know He does. Why aren't they in Heaven?","commenter_a":"There Will Never Be An Excuse Big Enough To Convince Our GOD That Killing Innocent Babies Is Okay! :(","post_message":"Do you agree?"},{"comment_id":"953451111362414","commenter_b":"Feminists are annoying","commenter_a":"I think there all cunts so I suppose I am humanist ha...","post_message":"Tonight, Ed Sheeran performed a song about his love life. Feminist Taylor Swift wants to know why no one called him sexist. #Grammys"},{"comment_id":"600616960147229","commenter_b":"'@username It was $200,000; and I cannot stand that vile woman.","commenter_a":"This man is broke. He is a fraud.he knows if he loses he will go bankrupt. He cant even carry a sentence. His wife is an ex escort, and hes on his third marriage.","post_message":"WATCH #LIVE: Donald Trump speaks at Polish-American Alliance in #Chicago."},{"comment_id":"1156510771035618","commenter_b":"Maybe criminals should stop shooting people unwarrantedly","commenter_a":"Maybe police officers should stop shooting people unwarrantedly?","post_message":"Authorities are hunting for the gunman."},{"comment_id":"10153443009598984","commenter_b":"She is a total THUG herself. She is helping to take Baltimore down the sewer. She needs to go it there is any hope for that city.","commenter_a":"I think Sharpton should pay it!!! He caused the riots or Jackson.","post_message":"The fact that she expects Americans to do THIS for her after the things she's said and the way she handled the riots is truly mind boggling.  Are you outraged by the Baltimore mayor's request?"}]
