[{"comment_id":"695324637324781","commenter_b":"Get ISIS and obammy out of AMERICA first. We need to protect ourselves and children. Then we can help ours.","commenter_a":"Wipe them off the face of the earth!!!!!!","post_message":"An innocent American girl was found in the middle of this ISIS debacle. America now truly stands with France against ISIS. Do you think that America should wipe ISIS from the face of this planet?"},{"comment_id":"10152867699771636","commenter_b":"how sad that people still think he's anything other than a disaster capitalising tory.","commenter_a":"Don't tell me he plans to run for leader of Labour Party again?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153101255675779","commenter_b":"Tailgate Savannah only time will tell i like ronda but she is getting a bit arrogant t","commenter_a":"ronda rousey is gonna lose to holly like if you agree","post_message":"Ronda Rousey visited the The Tonight Show Starring Jimmy Fallon last night to promote her upcoming fight with Holly Holm and discussed Floyd Mayweather and challenged Fallon to a Mario Kart match. Watch below."},{"comment_id":"10153424148207016","commenter_b":"If she's been forced to left that means that's not what she wants to do I will never ever ever ever ever ever vote for that woman. I'm voting in this election because we have to get rid of Republicans and bought Democrats but I'm writing in Bernie Sanders","commenter_a":"After picking myself off the floor from laughing so hard, I have figured out that one way or another, Senator Sanders will be the real winner no matter what happens in this race. A change is coming in American politics, and even Hillary Clinton won't be able to stop it. Delay it, maybe, but the majority of the American people from all sides have had enough with business as usual at their expense and are mad as hell about it. Just look at the long lines at the polls and the huge turnouts at Bernie Sanders' rallies if there are any doubts - that is the beginning of the revolution which Sanders is talking about.","post_message":"Left enough already?"},{"comment_id":"833282530101334","commenter_b":"Oh Terry your pro pic explains it all lmfao","commenter_a":"Tell me what isn't wrong with this picture.","post_message":"Bush. Romney. Utah. One day only."},{"comment_id":"1746288005610861","commenter_b":"Women do not get kicked out of restaurants because their children cry. What world do you live in ?","commenter_a":"Whatever. If that kid was crying in the middle of some restaurant & the owner told the mother to leave for the sake of the rest of the patrons he'd be applauded. Taking a baby to a political rally is as foolish as taking a baby to a Slayer concert. The exception being Slayer fans are far more courteous than the average politcal junky.","post_message":"'I think she really believed me that I love having a baby crying while I'm speaking. People don't understand.'"},{"comment_id":"598960046961241","commenter_b":"YES, fire him!!","commenter_a":"I agree he definitely needs to be fired","post_message":"Police chief announces that he going to enforce Shariah Law.  He can't get away with this. Shariah law has no place in America.  Do you think this police chief should be fired?"}]
