[{"comment_id":"886400474789539","commenter_b":"so many thugs trying to kill cops what do you expect?","commenter_a":"Crooked cops what would you expect?","post_message":"\"I just tried to cover my face from all the beating that the officer was giving me.\"  -Floyd Dent"},{"comment_id":"10154814008013797","commenter_b":"Why feed nd house this p.o.s just torture em till.hes dead","commenter_a":"Piece of 💩","post_message":"LIFE IN PRISON: In the man's car, police found children's toys, chloroform, sleeping pills, cable straps, thumb cuffs, a stun gun, latex skull masks, gags and various strangulation devices."},{"comment_id":"10156554094585615","commenter_b":"what an ass","commenter_a":"He's so wrong. I can judge him too.","post_message":"He calls declaring same-sex couples \"apostates\" just a \"policy disagreement.\" Meanwhile, LGBTQ kids are dying by suicide."},{"comment_id":"970231249739794","commenter_b":"Wth are you talking about? What woman? What illegal alien?","commenter_a":"The woman killed in San Francisco by an illegal alien will never go out with her father again.","post_message":"Some quality dad time!"},{"comment_id":"902293323230618","commenter_b":"Please put the lying pig in prison where she belongs","commenter_a":"Isn't it ironic the Bill Clinton appointed Loretta Lynch in New York City to her appointment as federal judge there! Obama appoints Loretta Lynch to be attorney general after ever called or left! Barack Obama supports Hillary Clinton for president of the United States saying he doesn't think she did anything wrong! Loretta Lynch Meats with Bill Clinton by coincidence in Arizona Airport where they both went with private planes and just happens to be on this farm at together! After Loretta Lynch meet with Bill Clinton by chance and the Arizona taubat she requests the judge postponed releasing Hillary Clinton's emails for 200 and some days after the November election! How are you folks believe Barack Hussein Obama's administration is not totally corrupt I guess you're waiting for the Easter Bunny, Santa Claus and any other mythical person to come by your side along with the Unicorn! I guess ...","post_message":"An iconic photograph of Hillary Clinton using her BlackBerry while wearing sunglasses on a military plane prompted an official in her office to inquire about whether Clinton had been assigned a government email address...  The information came out in sworn testimony in a Judicial Watch deposition of Karin Lang, a former State Department official. Please SHARE!"},{"comment_id":"1035291306577703","commenter_b":"Science does trump random personal stories. (pun intended)","commenter_a":"I live in Savannah Georgia the South Carolina border is 10 mins away from me, 9 out of every 10 people I meet regardless of sex color sexuality or background supports trump, most support him silently they are not going to run around screaming that they support trump they are not participating in polls their voices will be heard at the ballots","post_message":"Hillary Clinton and Donald J. Trump are tied in South Carolina according to new polling. Rachel Maddow breaks down the surprising development.  More analysis on the latest polling from The Rachel Maddow Show: @webpagelink"},{"comment_id":"853572084739045","commenter_b":"Lol! Wow!","commenter_a":"I agrees with the Judge! Come here by the proper channels! WTH","post_message":"Here's a breakdown of what the immigration ruling means."}]
