[{"comment_id":"1013896902039895","commenter_b":"News flash, illegals don't have state ID's or driver's licenses therefore they couldn't be auto registered to vote. Another case of a republican who pretends to be smart.","commenter_a":"So illegals can vote too? dirty liberals","post_message":"A victory for voting rights!"},{"comment_id":"1685289261757038","commenter_b":"So true. She needs disarm them!!","commenter_a":"not just disarm, but \"quickly\"","post_message":"Hillary said that guns don't keep you safe. If she really believes that she should demand that her heavily armed bodyguards quickly disarm!"},{"comment_id":"1099154366818961","commenter_b":"Hypocrites and parasites all , get them all out now","commenter_a":"Kristian I don't know if you'll catch it","post_message":"#resigncameron demo live in London"},{"comment_id":"10154144112782699","commenter_b":"too bad this policemans life has been changed because of some mouthy teenagers","commenter_a":"With the chief of police not supporting him...most definitely. He can't go it alone.","post_message":"\"Eric Casebolt of the McKinney, Texas Police Department has quit his job, after a video of him pulling his firearm on rowdy teens went viral.\" @webpagelink Do you think the officer should have resigned?"},{"comment_id":"10153373232208984","commenter_b":"Wow!! Such nasty, foul mouth comment from a woman. First Lady has more class than you will ever know.","commenter_a":"Yes we can not wait to get a real first lady again this nasty racist bitch needs to fk off","post_message":"I thought I'd seen every attempt at the race card possible, but this is definitely a new one... Do you look forward to Michelle leaving the White House?"},{"comment_id":"1845364932419184","commenter_b":"Little girl go sit down and shut the hell up.","commenter_a":"she is an bitter root from the tree","post_message":"Not a good choice of words, Bristol."},{"comment_id":"1014897985199658","commenter_b":"A FUCKING MEN!!!","commenter_a":"#ALLLIVESMATTER","post_message":"A new low. #BlackLivesMatter"}]
