[{"comment_id":"10153721168204170","commenter_b":"We have no room for their made up Allah in OUR Country!!!!! Go back to your Motherlands and take Nobama and Moochelle with you!!!!!","commenter_a":"Jeeze. I'm shocked","post_message":"Guess what block of foreign-born immigrants is growing fastest in the U.S?  If you said \"Muslims,\" you win a cookie. Make sure it's halal"},{"comment_id":"10156577141610603","commenter_b":"Now we have another whack job in Washington today. Something is in the air, like desperation.","commenter_a":"According to public records, Ford has an extensive criminal history, including charges for burglary, fleeing police officers, grand theft and an unspecified felony. Most of the incidents occurred in Broward County, Fla., and date back to 1996. His girlfriend said: He is an alcoholic, violent, depressed. It’s my belief he is in desperate need of medical & psychological help!”","post_message":"Cedric Ford was at work when he was given a 'protection from abuse' order roughly 90 minutes before he went on Thursday's deadly shooting spree, according to police."},{"comment_id":"424685420989386","commenter_b":"Not the smartest gal around","commenter_a":"It's a tough way to learn a had lesson. I pray she did and will soon have another job that she will probably appreciate.","post_message":"Was this lady unfairly dismissed?"},{"comment_id":"1836845559870004","commenter_b":"She doesn't deserve to be nominated.. What a laugh..","commenter_a":"Her expressions are the worst.... From her constant head nodding to her wide eyed expressions. And what's worse is when she opens that mouth of hers to spew out a constant stream of lies...","post_message":"Balloons are released to celebrate the official nomination of Hillary Clinton & Tim Kaine."},{"comment_id":"10153241049435950","commenter_b":"SHUT THE FUCK UP...","commenter_a":"Is oboma a member of isis/isil?","post_message":"\"He needs to go after the people who killed Russian citizens,\" Obama said of Putin."},{"comment_id":"10154098589214753","commenter_b":"She could be doing a whole lot worse,she is doing what she wants before going to collage,seems like a good idea to me .She may not be so inclined to act foolish when she gets there and will take her studies more seriously.Enjoy your year off","commenter_a":"Wow! This is not news...who cares?","post_message":"Malia Obama has been embroiled in a pot smoking scandal after footage was released of her smoking at the Lollapalooza music festival in late July. The first daughter opted to attend the Chicago event instead of joining her parents for the Democratic National Convention in Philadelphia. It was a decision that led to big headlines for all of the wrong reasons. Images of Malia twerking and partying it up were posted online. It wasn’t just her wild behavior that got attention, but who she was... @webpagelink"},{"comment_id":"1171676779558735","commenter_b":"What couples?Floyd has a harem of women like this in Vegas!!","commenter_a":"these celebrity couples are getting ridiculous.........i can understand the attraction to cash but at least try to hide it...","post_message":"Floyd Mayweather is dating a 19-year-old New Look sales assistant from the West Midlands."}]
