[{"comment_id":"565742550241188","commenter_b":"She is no different then her mother. Dumb. Maybe she should look into how not to get pregnant..","commenter_a":"Who is she to tell Obama to get out of Alsska. This girl is the lowest form of humanity....typical Zpalin low life....","post_message":"Bristol says no one ever refers to the mountain as Denali.   Except, her own mother did in 2009. Ooops!  But she wants Obama out of Alaska, dammit.   -Conover"},{"comment_id":"1097693670320210","commenter_b":"Triple gross, have their hair all over my sheets, NO WAY!!!!","commenter_a":"Gross","post_message":"One New York couple has successfully acquired a bed large enough so that they and all 8 of their rescue pups can sleep comfortably. \"They love to just be near us. So however we can make that happen, they're happy.\""},{"comment_id":"10153283544784170","commenter_b":"Stick the crust between her buns. She'll never know.","commenter_a":"Straining so hard to see what isn't and not see what is. Sad.","post_message":"A word of advice to the legacy media:  If this is the best the Clintons can do with their \"re-branding exercise,\" you should jump ship immediately.   ...Because this is absolutely pathetic. VIDEO."},{"comment_id":"1647670705273781","commenter_b":"This dude is in trouble. He better start working for the people who elected him, or his ass is grass","commenter_a":"Government that works? Republicans are out to prove to us that government is bad by giving us spectacularly bad government.","post_message":"Jason Chaffetz's contentious town hall in deep-red Utah proves Americans care more about a government that works than partisan politics."},{"comment_id":"10152821365179091","commenter_b":"PERFECT, never let her out!!!","commenter_a":"Lock her up in the crazy house and throw the key away","post_message":"\"If she is desperate, she may do the unmentionable and harm the mother and take the baby.\"  An eerie Facebook post about Dynel Lane seems to have predicted that she would act violently toward an expectant mother. Lane was arrested Thursday after police say she cut a baby out of a pregnant stranger womb.  Read the whole Facebook post --> @webpagelink"},{"comment_id":"1283029891737480","commenter_b":"It is so embarassing to see some women with such low IQ and/or low self-esteem.","commenter_a":"TRUMP for PRESIDENT...GO TRUMP","post_message":"The crowd cheered."},{"comment_id":"1778254899059301","commenter_b":"Someone take care of Bernie so Lizzi shuts her piehole, please.","commenter_a":"Lester Holt seems to be giving Hillary longer time to speak than Donald!!","post_message":"TheDC presents the first debate between Hillary Clinton and Donald Trump. Starting at 9:00PM ET."}]
