[{"comment_id":"10153174741786323","commenter_b":"English people are NOT being RACIST. They dont go to places to live eg Spain. Greece. Australia etc and expect that country to cater to them. You go to a country you respect their way of life. They need to learn English. I used to love the golly on the jam jar brooches. All gone because of so called RACISM. This is a little island. Anyone with a criminal rec ord should not be allowed here and those that commit a crime need to be returned to their homeland. We pay NI out of our wages- not to support freeloaders who offer nothing to this country. What was beautiful historic church buildings-turned into Indian Temples. English Heritage is being destroyed!! Polish people have turned this country in areas to little Polands and this Government have let them. BNP want this country to be ENGLAND and ENGLISH laws and those that ...","commenter_a":"If a white person doesn't roll over and submit, he's a racist.","post_message":"\"Facts in themselves are neutral but their interpretation certainly isn’t. And while on their own facts cannot be racist, the way they are chosen certainly can be.\""},{"comment_id":"1036826173024907","commenter_b":"you mean the way a woman allowed herself to be treated for good money?? wahhhh wah wahhhhhh.","commenter_a":"The way Hollywood portrays women is outrageous.","post_message":"Right on. Go Dame Helen, go! - Eric March"},{"comment_id":"10156550140360354","commenter_b":"WAKE UP AMERICA !","commenter_a":"Go girl!!","post_message":"What in the...?! And no, it's not a joke. It's a REAL lawsuit. Look at the documents..."},{"comment_id":"989149777896374","commenter_b":"Es ist wie . Die REICHEN WERDEN IMMER REICHER UND DIE ARMEN IMMER . Die Schere geht immer weiter auseinander.....und dann sind die Leute noch so naiv und w diese Typen, die keine Ahnung haben, vom wirklichen Leben. ....und Leute wie Bernie Sanders, l man fallen.","commenter_a":"Raising wages does absolutely nothing. If you raise minimum wage to the argued $15 an hour, you would have to raise everyone else's wages the same percentage. Now that it costs more to pay workers, manufacturers now have to increase retail prices to make up the difference. This achieves nothing and you're back to square one. You get paid more, but products cost more. 1 to 1 is the same ratio as 4 to 4. Paying more money for the same exact thing is the precise definition of inflation. This mind set is why recessions exist in the countries that follow this policy.","post_message":"The Walton family, the owners of Wal-Mart, is the wealthiest family in America. Middle class taxpayers should not have to pay billions more in taxes in order to subsidize the wealthiest family in America. That's absurd."},{"comment_id":"1070629882958022","commenter_b":"Look mr. TopHeavy, when you get pregnant let me know lol. I know many women who smoked while pregnant and had/have extremely healthy babies and children.","commenter_a":"Btw.. I'll call bullshit on this","post_message":"Here's what smoking does to your unborn baby."},{"comment_id":"997631186950175","commenter_b":"That would be a terrible thing to do and there are many who would adopt that precious child","commenter_a":"Well if I was pregnant with a fetus with Down's Syndrome I would abort the fetus. Not everyone can raise a special needs child. I would not put it up for adoption, that would not be an option. That's just my opinion.","post_message":"Yes it does!"},{"comment_id":"10153016885814117","commenter_b":"The word you will never hear from your wife, @username.","commenter_a":"Perhaps the costs of CC regulation should be compared to the costs of climate change inaction? CEA finds what economists would call “increasing marginal costs” of delay. If we don’t make a concerted effort to keep the rise in average global temperature within the range consistent with modest costs and instead allow it to stabilize one degree Celsius higher, the annual additional damages would equal 0.9 percent of global output. A longer delay that added another degree would cause additional annual damages of 1.2 percent of global output. That’s a total change of 2.1 percentage points. To illustrate those annual costs more tangibly, 2.1 percent of current U.S. GDP, which is about a fifth of world output, is roughly $360 billion. The story doesn’t end there, however. There’s a lot of uncertainty around these estimates. Acting sooner rather than later is insurance against unpleasant surprises. We’re happy to pay fire ...","post_message":"Today, President Obama and the EPA are announcing the final regulations that would establish President's Clean Power Plan. How much will it cost you?"}]
