[{"comment_id":"1005063259586728","commenter_b":"I don't mean In Syria. Whatever safe country they might be in. Buy them something Since ur gov has voted against letting refugees in the USA.","commenter_a":"Or buy them a home where they are.","post_message":"Kudos to Moore for taking a stand in the name of American compassion."},{"comment_id":"10153311065101167","commenter_b":"Three words: Token. Black. Woman.","commenter_a":"Why does anyone care what Stacey Dash has to say?","post_message":"Today on live TV on two separate programs, Fox News called Obama a \"total pussy\" who doesn't \"give a shit\" about terrorism:"},{"comment_id":"1048569925162760","commenter_b":"Prenup is what he needs he doesnt need ladies he see's to try and take His money.. IMO she isnt all that but hey if he likes/loves her... I dont care how much money she has.. Prenup is always the best way to go if your famous.","commenter_a":"Focus on getting the super bowl ring 1st please! If you get her a ring you better get a prenup.. just saying..","post_message":"Seahawks quarterback Russell Wilson hinted on The Dan Patrick Show that he and Ciara could soon be engaged. When asked which would come first, Super Bowl ring or engagement ring, Wilson responded, “hopefully both.” Check out training camp photos here >>kiro.tv/SeahawksCamp"},{"comment_id":"10151088515799999","commenter_b":"Such a misogynist!","commenter_a":"I was at Smith College when Maher came and spoke in the late 90s. His contempt for women was palpable. Not a surprise that he feels avuncular towards Milo. Once you accept it is okay to dehumanized one group, it is just a hop skip and jump away from demumanizing anyone.","post_message":"Bill Maher's interview with Milo Yiannopoulos was a mostly chummy affair. Then in a segment that ran after the broadcast, Yiannopoulos attacked transgender people."},{"comment_id":"1836032849948227","commenter_b":"I'd say you'll go in for one yourself @username!! Dressed as a lady","commenter_a":"@username I don't feel well","post_message":"😍😍😍"},{"comment_id":"1086256118053035","commenter_b":"So we leave our selves defenseless so that some kid can study underwater fire fighting?","commenter_a":"Spending more money that we don't have, Thank You, so very much!","post_message":"The Perkins Loan Program can be a critical lifeline for many low-income students. I’ve joined 53 of my colleagues, including Senator Robert P. Casey, Jr., in calling for its reauthorization. Learn more below."},{"comment_id":"10153259731496615","commenter_b":"They are grown women they knew exactly what they were doing","commenter_a":"Stop calling these Ppl victims they knew what they were doing everyone knows Cosby is married what type of woman will got to a hotel room for drinks with a married man they had their own agenda miss me with that victim bs","post_message":"BREAKING: Bill Cosby has been charged with sexually assaulting a woman in Pennsylvania more than a decade ago. @webpagelink"}]
