[{"comment_id":"1162763547153229","commenter_b":"Betty White Anyone born after 1507 in America is a NATIVE AMERICAN... Those born before 1507 were not NATIVE AMERICANS.. This land mass was not named America until 1507... So Betty White, you are a NATIVE AMERICAN if you were born in America..","commenter_a":"Iwelcome to America, Ahmad Al-Abboud. I hope you, like many refugees, find the American dream!","post_message":"Ahmad al-Abboud, a Syrian refugee who recently relocated to Kansas City, discusses his harrowing ordeal. Watch more: @webpagelink"},{"comment_id":"10152853063786748","commenter_b":"Know what, dude, if you and Obama went to a lunch counter in the deep south in the '50s, you would both stand an equal chance of getting abused and assaulted. And if the right wing scum you shill for ever get back in power, you'll find yourself right back in the 'separate but equal' category tout suite. :P","commenter_a":"right. cause Alan West is the epitome of \"blackness\"","post_message":"Right-wing pundits claim Obama isn't *really* a black American"},{"comment_id":"10153991299268984","commenter_b":"Make sure he meets his virgins..","commenter_a":"Coming SOON to an ENTIRE COUNTRY near you . . . !!!!!","post_message":"This ISIS supporter had planned something truly terrifying for New Year's Eve... Thankfully, law enforcement caught him just in time. Do we need to do more to support law enforcement against ISIS?"},{"comment_id":"10153520477923132","commenter_b":"Those freaks should have never been on TV anyway!!","commenter_a":"Yep thy absolutely should. Should never have a show on the air that advocates bigotry and hatred while showing women as animals for breeding purposes that are be owned. Also the show advocates for having more children than you can afford (unless you have a reality show to pay the bills) and more kids than you can physically and emotionally take care of.","post_message":"Do you think TLC should cancel 19 Kids and Counting?"},{"comment_id":"10153438712476636","commenter_b":"Good start but we need a lot tougher laws for the sex offenders especially the pedophiles and rapists.... If there is a country to deport them to then fine, if they are British I think we should start new colonies on the barren islands around the uk.","commenter_a":"Hear hear.....send them all home,BLAGGING no good scumbags. Thank god a bit of sense at last they have been taking the k Piss of our system too long","post_message":"Exclusive: Theresa May's response to the uncovering of sex abuse gangs"},{"comment_id":"1089399481081062","commenter_b":"Hahahaha","commenter_a":"Matthieu Sinclair","post_message":""},{"comment_id":"896491237077292","commenter_b":"Give me a break with the martyrdom... I don't think this is an appropriate way to handle this.. Sian is right.. her's will fade and you will be left with nasty looking legs.","commenter_a":"The things you do for love","post_message":"Their daughter couldn't be happier...she even points at the tattoos and yells 'match!'"}]
