[{"comment_id":"920667494692972","commenter_b":"What a piece of shit","commenter_a":"PIG!!!!!!! If his wife had any sense of self worth and wasn't so bullied she would leave his sorry ass!","post_message":"And the saga continues..."},{"comment_id":"1022904834453429","commenter_b":"@username TAKE YOU IGNORANT AGNOSTIC SELF AWAY....AND LEAVE THESE NICE PEOPLE ALONE ....TROLL!!!","commenter_a":"No. I don't think this God has anything to do with politics whatsoever. It's important to keep religion and politics seperate. Besides, this isnt even an important thing to be concerned about. There's a lot pressing matters to attend to than putting a God back into the government.","post_message":"SHARE IF YOU AGREE!"},{"comment_id":"1017722631617599","commenter_b":"@username, you and your daughters are throwing your votes in the TRASH then.......smh @username 2016","commenter_a":"I hope Bill & herself have plenty of room for the Syrian refugees, since She is so kind to the terrorist islamics. #Stupid to BRING THE ENEMY HOME!!! Utterly wrong. SHE HAS #LOST my Vote... and my two daughters Votes. #MARCORUBIO will be my choice now.","post_message":"We cannot allow terrorists to intimidate us into abandoning our values. Turning away orphans, applying a religious test, discriminating against Muslims, slamming the door on every Syrian refugee—that is just not who we are. We are better than that."},{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"},{"comment_id":"1420510454708671","commenter_b":"i wonder if there will be a point when the majority, or at least, SOME, Republicans will grow some balls, and say ENOUGH???.....and i just sent an email to both of my state's gutless excuses for elected officials and pledged my unwavering dedication to get their sorry asses whipped come next election...","commenter_a":"Lol your funny Trump you don't have all the control like u think u do lol","post_message":"Got him!"},{"comment_id":"10152774435682144","commenter_b":"Misogyny FTW !!!","commenter_a":"Suck my pussy hag","post_message":"Another indication the Supreme Court is likely to rule in favor of gay marriage this June, when justices will hear a monumental case deciding if the Constitution provides the right for same-sex marriages."},{"comment_id":"1095436653882721","commenter_b":"Shut the Hell Up!","commenter_a":"this asshole can;t handle protesters and people actually think he can handle trained killers. Yeah DISASTER BELIEVE ME DISASTER IS TRUMP","post_message":"Exactly.  Image by Occupy Democrats, LIKE our page for more!"}]
