[{"comment_id":"1191980840884045","commenter_b":"Seth Rich, DNC staffer, suspected of leaking information to WikiLeaks about the Clinton campaign randomly gets shot in the back walking down the street.... Why are so many Americans blind to the corruption in the Clinton campaign? People with credible evidence against Hilary are turning up dead. This is not a random instance. @webpagelink","commenter_a":"Trump will make changes, and yes Obama Trump doesn't think we faked the moon landing.","post_message":"Barack Obama’s greatest strength? “Probably that I’m always early.” hillaryclinton.com/makeaplan"},{"comment_id":"10152882681411028","commenter_b":"Man ..... She Can Eat LOL","commenter_a":"I just are a bagel this morning and had a great cupe of Coffey.","post_message":"Molly Schuyler ate three 72-ounce steaks, three baked potatoes, three shrimp cocktails, three salads and three rolls in way less time than it'd take for someone to cook all that food at home.  And the reason she turned down a fourth steak? She was sick of the taste -- not full. @webpagelink"},{"comment_id":"10153324881199312","commenter_b":"1 in 100,000 people infected with measles died before the measles vaccine, meaning even if EVERYONE caught measles in the USA today only 3,000 would die, BUT thats if EVERYONE in America caught it, not millions, and because we take care of ourselves and wash our hands and eat slightly healthier that would not be the amount today anyhow, measles does not mean instant death, and if one more person tries to spread \"herd immunity\" crap I'm gonna lose it, it's not real! We do NOT have herd immunity!","commenter_a":"What concern. Everybody got measles when I was a kid.","post_message":"More than 1,000 students are exempted from measles vaccine in St. Louis area schools. Tonight at 10, 5 On Your Side investigates the concern, the controversy and how quickly an outbreak could occur."},{"comment_id":"10154370280236519","commenter_b":"Dear mikka, your existence proves that feminism is still very much needed in this day and age. As long as drooling troglodytes such as yourself still talk shit like this, there still is work to be done. Thanks for confirming.","commenter_a":"modern feminism is not related to feminism of the past..... modern feminism is pointless","post_message":"The plight of the bitter nerd."},{"comment_id":"10153774717459726","commenter_b":"She's an angry heifer","commenter_a":"Cows go... MMMMOOOOOOOOO","post_message":"WATCH: GOP consultant Liz Mair says she's going for big money now to sink the GOP front-runner"},{"comment_id":"10153679733478967","commenter_b":"People really do get butt hurt in SF","commenter_a":"Carlos Salazar","post_message":"Well this didn't go very well."},{"comment_id":"10153935292307434","commenter_b":"Shay shut the fuck up","commenter_a":"\"Transgendered\" sooooo 2013. BOOOORRRING No one cares. We get it, you're edgy. Zzzzzzzzz","post_message":"\"Trans women are not only sex objects or prostitutes,\" said Amiyah Scott, explaining her departure from the show."}]
