[{"comment_id":"1860114807561813","commenter_b":"What a couple of scheisters! They both belong in prison...","commenter_a":"They may have topaysomeback taxes.","post_message":"ANTI-TRUMP REP JOHN LEWIS Skipped Out On Paying Taxes On His DC Townhouse...He must have consulted with Rev Al Sharpton..."},{"comment_id":"1102809566397179","commenter_b":"RACIST .","commenter_a":"Ben is a nice man but he reminds me of my old Catholic priest in high school, out of touch with how other people live and he came up with the most ridiculous things. Voting to me for Carson is like voting for the old priest.","post_message":"Number. Three."},{"comment_id":"10154255486503812","commenter_b":"@username She was talking about your looks (see, that's a joke).","commenter_a":"Because seeing a gigantic animal in front of your car with your own eyes is somehow just too hard these days.","post_message":"Moo-ve over! Volvo shows off its large animal detection system coming to its vehicles in 2017."},{"comment_id":"10153241049435950","commenter_b":"SHUT THE FUCK UP...","commenter_a":"Is oboma a member of isis/isil?","post_message":"\"He needs to go after the people who killed Russian citizens,\" Obama said of Putin."},{"comment_id":"1681685855452013","commenter_b":"Joke...","commenter_a":"Jail and no bail.","post_message":"President Obama is taking guns out of all forms of entertainment.  This is ridiculous. He can't get away with this.  Do you think he is abusing his power to push his propaganda?"},{"comment_id":"10150520498839999","commenter_b":"Sick woman. Sigh.","commenter_a":"WHO CARES","post_message":"The Rev. Dr. Martin Luther King, Jr. would be 86 today.   Photo: George Tames/The New York Times"},{"comment_id":"10154692738382235","commenter_b":"Continue to do what she's done for 20 years, try and destroy the Clintons. Keith Olbermann lays that out bare @webpagelink","commenter_a":"It will be interesting to see what Kellyanne Conway will be doing once Donald is finally embarrassed by getting wiped out in the election, and not only dumps her but blames her for his loss.","post_message":"Kellyanne Conway got A LOT more than she bargained for ..."}]
