[{"comment_id":"1129299917126536","commenter_b":"Hillary is the real war on women.","commenter_a":"Together we Move Forwards Vote to President @username 2016.","post_message":"In ten years, we can generate enough renewable energy to power every home in America. #EarthDay"},{"comment_id":"554226841431375","commenter_b":"Hillary is the dispicable one calling Millions of Americans all kinds of names that do not want her for President . So save all your outrage for Hillary , oh that's right . You hypocrites don't have a problem with Hillary doing it and yourselves as well . Shame on you Debbie and all like you .","commenter_a":"The nasty, inconsiderate, unemphatic comments are disgusting & shame, shame on everyone making them. Hillary has run herself ragged & not surprised she's got pneumonia. Coughing a lot lately. She's exhausted. No wonder. Be careful what you say because it'll come back to you tenfold. #KARMA","post_message":"JUST IN: Hillary Clinton was diagnosed with pneumonia on Friday, her doctor says. The doctor revealed the condition hours after Clinton stumbled while leaving a 9/11 event. @webpagelink"},{"comment_id":"1033897839973602","commenter_b":"God bless you and your mommy","commenter_a":"Welcome little one","post_message":"Do you remember our story of the pregnant woman who was carjacked on the way to the hospital?  Story --> @webpagelink Well, she had her baby yesterday. Help us in welcoming the adorable Malcolm."},{"comment_id":"928522093922469","commenter_b":"The plans he has put in place, is FILL AMERICA WITH MUSLIMS AND ILLEGALS....'GROWTH OF THE ECONOMY IS HIS MUSLIMS AND ILLEGALS IN PLACE FOR A WAR' SO HE DOESN'T HAVE TO LEAVE THE WHITEHOUSE......WHY DO YOU THINK HE SAID HE WAS GOING TO STAY IN WASHINGTON FOR 2 MORE YEARS, SO 'SASHA' COULD GRADUATE THERE? HE SURE IS NOT GOING TO PAY THE COST OF HER SCHOOLING OUT OF HIS POCKET....... WAKE UP, AMERICA....THE REASON HE IS NOT IMPEACHED, IS BECAUSE MOST OF THE ONES WHO WOULD HAVE DONE IT, ARE NOT AMERICANS, BUT ARE MUSLIMS.....","commenter_a":"To have a strong economy you need more Americans working and Obama's policies stand in the way of Americans going back to work again. Obama did place an incentive for employers to hire new workers BUT he also put a heavier tax burden on employers to keep their new hires.","post_message":"WATCH Obama:  is pretty darn great right now, and making strides right now...And I don expect that these facts and this evidence will convince some of the politicians out there to change their doomsday rhetoric"},{"comment_id":"1382876735088925","commenter_b":"This bitch is evil","commenter_a":"I bet bin laden isn't dead. !","post_message":"THIS IS ABSOLUTELY HORRIFYING!"},{"comment_id":"10154807029567293","commenter_b":"Make Racists Afraid Again.","commenter_a":"Have another drink, hillbilly hick","post_message":"not a bomb in your bag, is it? the man said, according to a passenger."},{"comment_id":"1066828243360262","commenter_b":"I agree Diane..... but she is NO Lady!","commenter_a":"are you kidding me lady,Do you not get that Obama started this whole thing between races.there shouldn't be black or white there should be strictly American.","post_message":"VIDEO: Cokie Roberts has apparently gone completely insane."}]
