[{"comment_id":"571795269654273","commenter_b":"Leave America","commenter_a":"Move to Syria.","post_message":"Here you go, peeps! If you're stumped for ideas check the comment section... they have plenty! @webpagelink"},{"comment_id":"10154512685084411","commenter_b":"No copy paste","commenter_a":"copy paste. This is what you do ? Be creative guys.","post_message":"The Big Mac is dead, long live the DonMac!"},{"comment_id":"10154376449396636","commenter_b":"Sorry but the open door immigration you referred to doesnt apply to North Africans. No African countries are in the EU.","commenter_a":"I don't think the opinions of someone who has ruined an entire continent with her open door immigration policy are worth listening to....","post_message":"Strong words"},{"comment_id":"10153106111768717","commenter_b":"Ha Ariana Grande get out of America and don't come back and American people should boy cot all her music","commenter_a":"Well if she can lick donuts then it is the shop's problem in leaving them where she can do this, so the shop should be the ones facing criminal charges.....","post_message":"A doughnut shop owner wants Ariana Grande to face criminal charges for licking and spitting on doughnuts -- @webpagelink"},{"comment_id":"10158220719125203","commenter_b":"Obama allowed illegals to move here, not President Trump. Obama told illegals to vote, not President Trump. During his campaign, President Trump said he was going to build the Wall, and deport illegal immigrants. They were warned. President Trump is not to blame when these criminals are arrested.","commenter_a":"Throw her ass back to Mexico","post_message":"WHOSE fault is this!? ===>"},{"comment_id":"10153322688803132","commenter_b":"I hope she drops dead now in the pits of hell for what she did to this poor girl!","commenter_a":"How stupid can people get ???","post_message":"\"She's going to run till I tell her to stop. She's gonna learn ... I don't play with her.\""},{"comment_id":"1347295655336172","commenter_b":"Go touch your vagina","commenter_a":"I hear bruce","post_message":"Caitlyn Jenner is speaking out after Trump withdrew protection for trans students."}]
