[{"comment_id":"10154743377731037","commenter_b":"Keep 'em coming. Nothing's going to change my mind or anyone else's. The one thing that all of you had in common before today is that Hillary already had you fooled. It's not working on the rest of us, so sit back and enjoy the next four years that not only I know is coming, but SHE CLEARLY KNOWS IS COMING, hence the grasping at straws that we are witnessing this morning.","commenter_a":"It's hard to distinguish between the most rotten pile of trash this morning! You have: -the \"accusers\", who have remained silent throughout the whole campaign until Andy Cooper asked a question that, in his coke-addled and cock-obsessed mind, he thought would surely win him a Pulitzer. -the Clintons. ('Nuff said) -the MSM thinking that we'd all just magically buy this crap. Don't be fooled, America. You see the direction that they are bending over backwards to point you in. Vote Trump and let them know that you're not going to stand for it any longer!","post_message":"A woman alleges she was raped by Donald J. Trump when she was 13 years old in the mid-1990 — and now Law & Order: Special Victims Unit' is taking on the case."},{"comment_id":"10153115245746162","commenter_b":"What a pig!","commenter_a":"Unbelievable!!!!!!!!","post_message":"30-year-old Matthew Warner is charged with sexually abusing and killing his 19-day-old daughter.  How he almost got away with it @webpagelink"},{"comment_id":"823419914360098","commenter_b":"Never,never forget the countless acts of murder she committed by her acts against her brothers and sisters!","commenter_a":"I work hard at forgiving. I just can't forget. God told us in order for us to receive forgiveness, we must forgive. That is a tall order in this circumstance. I am trying. It is up to God to cleanse her of this deed. I had to turn it over to him. I still will not watch any movie or show she is on or in.","post_message":"Jane Fonda has changed her tune. She apologized for her Vietnam photos.   What do you think? Better late than never, or too little too late? Should she be forgiven?"},{"comment_id":"10152935961526717","commenter_b":"Marriage laws are in the USA,not in Africa,this is and excuse to a naked street party","commenter_a":"I'd like to protest Kenya's murdering of gay people for simply being #uncivilizedculture","post_message":""},{"comment_id":"1092995934129991","commenter_b":"Who has Hillary been taking campaign money from? Can you even make the connection lol","commenter_a":"I wonder why @username won't report the latest WSJ national poll. @webpagelink #ImWithHer #HillYes","post_message":"Electability has become a cornerstone of Hillary's campaign."},{"comment_id":"1176004315773372","commenter_b":"And make Texas pay for the wall","commenter_a":"I think we should just let all the gun nuts go to Texas and secede from the Union. They already have their own power grid, so we could build a bullet proof wall around the state and let them shoot all they want.","post_message":"Nugent's response to the San Bernardino shooting is to call for a new American civil war."},{"comment_id":"10153744773906880","commenter_b":"Huge write-up on a banker. He took billions of dollars from loser investors. Enron? Says it all. The greatest corporate collapse in US history. Great spin on a shark.","commenter_a":"Jason Espeseth Scott Arnebold","post_message":"He's taking on the issues that no one else wants to confront."}]
