[{"comment_id":"10154413621893279","commenter_b":"Bet she took the money anyway. How pathetic","commenter_a":"Progressives are all right in the moment Conservatives alway have the best long range strategies for gaining and holding power","post_message":"Hillary Clinton faced protests Monday by Palestinian rights activists outside a fundraising event at the Beverly Hills estate of billionaire Haim Saban."},{"comment_id":"10153242310616336","commenter_b":"Well what does Baltimore have to say now? I just can't believe those two cops were harassing those two nice men.","commenter_a":"They thoght they could get away with it!","post_message":"UPDATE: A third suspect has now been arrested after the shooting prompted a statewide manhunt.   The suspects accused of killing two Mississippi police officers in the line of duty were reportedly arrested early this morning."},{"comment_id":"10154321857710575","commenter_b":"Another loud mouth fat bitch and if you want to live se some weight cut off your head","commenter_a":"If you think this woman is a hero, go get your gun and shoot yourself with it, it is a better choice than what is coming","post_message":"Unbelievable . . ."},{"comment_id":"10153273051101051","commenter_b":"The idiotic responses of this lady, smh","commenter_a":"Really? I've never heard Obama saying anything that is anti police.","post_message":"Ted Cruz just made a serious accusation against President Obama. Do you think Cruz is right about this?"},{"comment_id":"1141182859235076","commenter_b":"I only like woman","commenter_a":"Anyone on this thread that defends the confederate flag or the klan, please kill yourself and do not procreate.","post_message":"'The Klan today is weak, poorly led, divided internally and without any political support'"},{"comment_id":"10153716841688132","commenter_b":"Sorry but he's not BLACK!!","commenter_a":"Ok President Obamas mother was white.His Grandparents were white.How can white people who say he does not care about white people Really ! You r all pissed because our President is Black?thats the issue with ignorant people who continue to blame our President.Im sure George Bush would not have done anything","post_message":"Barack Obama won't be intervening in Kelly Rutherford's international custody battle."},{"comment_id":"1675805602436783","commenter_b":"Wicked prick!","commenter_a":"That is what happens when you try to work 'across the aisle' with a group of people that have no desire to work with you.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
