[{"comment_id":"10153259731496615","commenter_b":"They are grown women they knew exactly what they were doing","commenter_a":"Stop calling these Ppl victims they knew what they were doing everyone knows Cosby is married what type of woman will got to a hotel room for drinks with a married man they had their own agenda miss me with that victim bs","post_message":"BREAKING: Bill Cosby has been charged with sexually assaulting a woman in Pennsylvania more than a decade ago. @webpagelink"},{"comment_id":"10155290808369657","commenter_b":"How can you support Hillary who betrays our Country lies and cheats and breaks the law each day. Hillary who.doesnt defend our Cpuntry our peopke and wants to open our borders and let terrorist enyer our Country freely as they chant death to America. Hillary qho breaks security and shares top secret Information and endangers our Military andCpuntrys and helps arms Isis ?How would anybpdy think its ok to support a lieimg cheating crinal who should be hung for Treason against America be elected President with all the oiruption and criminal acts Hillary has committed. Seems you should be glad to Vote for Mr Trump as he is good american will make a great president.","commenter_a":"So another mindless elected person. stupid is as stupid does","post_message":""},{"comment_id":"10157370299475725","commenter_b":"@username Here in the Houston area too. This is wrong. Build the wall!!!!","commenter_a":"I thank God for Mr.Trump, being I live here on the border in the San Diego area, we need to take our country back, illegals are everywhere, coming up here to have there baby's. its so wrong! Please help us","post_message":"This is a MOVEMENT - to take back our country! We are going to go non-stop -- all the way up to November 8, 2016 --- and beginning in January 17th, we are going to MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"10153194136535329","commenter_b":"Shut the fuck up bitch.","commenter_a":"OMG nobody is obligated to come to your kids birthday party people always run to FB for sympathy get over it & yourself","post_message":"“I know this might be something silly to rant about, but my heart is breaking for my son. We invited his whole class (16 kids) over for his 6th birthday party today. Not one kid came,” Ashlee posted on a local Facebook group."},{"comment_id":"10152823352857093","commenter_b":"Manslaughter is manslaughter no matter who you are or what you got...","commenter_a":"I think she's disoriented by her cash! Not the crash..man so a if","post_message":"YOUR TURN: Nicole Hutchison faces an intoxication manslaughter charge, accused of hitting and killing a TXDOT worker on U.S. 75 Central. Police say she told them she was wealthy, they would regret arresting her & asked about her 3 dogs but not the victim. Her attorney says she was disoriented by the chain reaction crash... WATCH: @webpagelink READ: @webpagelink"},{"comment_id":"444002905787317","commenter_b":"I wish someone would shoot that muslim nigger","commenter_a":"Unfortunately, the mass shootings will continue in the USA as long as the NRA continues to have such a strong influence, through its lobby, with the Republican Party in control of Congress. So many simple steps could be taken...background checks for instance or the banning of multiple-firing weapons ( one doesn't need a machine gun to kill Bambi! ) but the Republicans in Congress blocked even the discussion of background checks the last time it was brought up. With such intransigence in not even allowing discussion of the issue, I am afraid that no gun control law will be passed. President Obama is right to be furious as I am. As an American, I feel distressed, angry and frustrated but also, sadly, resigned. It is simply a matter of time until the next mass shooting. PS: Fewer than half of all Americans actually own a gun but those who do ...","post_message":"President Barack Obama is furious. Watch as he addresses the nation after another mass shooting. At least 10 were killed and 7 injured in a shooting at a community college in southwestern Oregon."},{"comment_id":"1296742057059213","commenter_b":"She is trifling","commenter_a":"This bitch stealing, got caught and now trying to act tough and threaten someone who is working to make a living for themselves. That bitch need to get a reality check and her welfare check taken. Cussing in front of her kid and possibly fighting and then what? Just sad.","post_message":"Rachet behavior at it's finest! #WSHH"}]
