[{"comment_id":"1759425104296851","commenter_b":"So how come she is now for crooked Hillary?","commenter_a":"michelle you said that Hillary was not fit for the white house nothing has changed since 2008 except she committed more crimes","post_message":"The first lady who did pushups on Ellen, whose hubby sang Al Green, claims Trump's immature."},{"comment_id":"10155930528244657","commenter_b":"Little brat!","commenter_a":"Disgusting beyond words!","post_message":"Even kids are joining in on the protesting."},{"comment_id":"10153819979530950","commenter_b":"Hillary has kept blacks where she thinks they belong. I am sick of her lies! Trump!","commenter_a":"What in the FACK is he talking abt? That an that has embraced white nationalism is calling Hillary a bigot.. Hillary has been to many black churches over the years and has many ppl of color as friends. Trump??? Never mind.. What a buffoon!!! Unfit....","post_message":"“We reject the bigotry of Hillary Clinton, which panders to and talks down to communities of color and sees them only as votes,” Donald J. Trump said."},{"comment_id":"977192562373798","commenter_b":"why not a woman","commenter_a":"Great news. Some disquieting news is that Hillie is considering Julian Castro for her VP. He is a good one and I guarantee he would jump. I really wish I knew who Bernie is considering. It should be a person of color imho.","post_message":"The American people are definitely feeling the Bern."},{"comment_id":"891182254405684","commenter_b":"He has already done a better job than Obama ishani August ,why don't you move to Cuba or the middle east,there you would find out what 'raping ' in a country is all about.do you feel safe with open borders?","commenter_a":"I am just so proud of President Trump, he is keeping his promesses, he is a man of his word. Wait until he gets sworn in, things will start moving for great changes.","post_message":"Do you support our president, Donald Trump? Comment YES or NO."},{"comment_id":"10152577798681316","commenter_b":"A percentage will watch Hannity and cry. The rest are busy being free.","commenter_a":"LOL they said this in 1777","post_message":"Freedom hardly exists in America today, where a family man who helped people purify their water naturally now faces 37 years in prison. Read Daniel Smith's story and support his fight against the corrupt US justice system. @webpagelink"},{"comment_id":"10153541363403908","commenter_b":"Ass holes and sexism lol I understand!","commenter_a":"Kendrick- a small reference for the man haters in your life? Idk","post_message":"earlier this year, women were using the hashtag #WomenAgainstFeminism in order to set the record straight about their views on feminism. Here's a powerful response  for the 'not a feminist' movement. What are your thoughts on this?"}]
