[{"comment_id":"1176004315773372","commenter_b":"And make Texas pay for the wall","commenter_a":"I think we should just let all the gun nuts go to Texas and secede from the Union. They already have their own power grid, so we could build a bullet proof wall around the state and let them shoot all they want.","post_message":"Nugent's response to the San Bernardino shooting is to call for a new American civil war."},{"comment_id":"1562229620730818","commenter_b":"Whoopi needs to zip her mouth too!!!","commenter_a":"About time","post_message":"I love ABC for doing what's RIGHT!   Rosie O'Donnell & Whoopi Goldberg have no place on TV."},{"comment_id":"10153516025754705","commenter_b":"No wonder you don't have any friends woman","commenter_a":"I hope this creature is captured and eaten by the Japanese","post_message":"What a spectacular creature."},{"comment_id":"10153366543351051","commenter_b":"why not Thugs Lives matter ... break the law assult others and what happens ??? Blacks Kill more of themselfs than any other ...... My mother taught me to dress for success not emulate Prison population booty call ...","commenter_a":"Racist idiot","post_message":"Here's why President Obama says many people misunderstand what the #BlackLivesMatter movement is truly about. Do you agree or disagree with the president's message?"},{"comment_id":"1092750970772962","commenter_b":"Omg when I hear you little sheep that follow that lying bitch it makes me gringe","commenter_a":"Unfortunately Tronald Dump has his followers their just as dumb as he is at this point Dump can say whatever he wants and he will still have his followers sad what this country has become but we can stop this Dictator in November do the right thing VOTE BLUE","post_message":"LOL"},{"comment_id":"636990926431695","commenter_b":"Let her go to a country that enforces Sharia law and see how she really likes being beat.","commenter_a":"She is insane!","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"1149160438565158","commenter_b":"Only if they are able to drive!","commenter_a":"Go trump","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"}]
