[{"comment_id":"10154883181056509","commenter_b":"Please be honest... Why are 37% of Federal prison sentences illegal immigrants? Tell American's the $100 Billion illegal immigration cost in tax dollars each year, this would pay the college for American citizens. The $12 Billion per year Illegal immigrants cost California taxpayers. The $Trillions Immigration Reform will cost taxpayer's in benefits due to the average 10th grade or less education level of illegal immigrants who will be on additional welfare for the next 50 years, will be receiving more free or low cost healthcare, which is breaking the bank of middle income families now. Tell them that 5,000 come in on a daily basis. Tell them about the identity theft of illegal immigrants who use stolen Social Security numbers to take American jobs and the IRS admitted to Congress that they did not notify the person or business that the illegal alien was again breaking laws and ruining American ...","commenter_a":"Speaking of an etiquette guide to Muslims, what does this particular group of 1.6 billion people believe about homosexuality?","post_message":"There are 7 billion people in the world. And a full 22% of them -- 1.6 billion -- are fasting from sunup to sundown. Every day. For an entire month."},{"comment_id":"10153138369757293","commenter_b":"freedom of religions","commenter_a":"Delaney Lynch","post_message":"“To be the first person to touch something that’s been lost for 300 years is a magical experience.”"},{"comment_id":"10153389153527169","commenter_b":"Don't despair. I have a niece named Gretchen. You are not alone! ;)","commenter_a":"Try being a Gretchen. I was literally the only one in my entire school all through k-12. I NEVER encounter tiny Gretchens but I'm only 31 so maybe there's still time?","post_message":"Is Your Name Going the Way of the Dodo Bird? (From OZY)"},{"comment_id":"452057048331142","commenter_b":"I'm in love I think! She hit the nail on the head.","commenter_a":"You tell'em Grans....","post_message":"Race-Baiting CNN Host Is Shocked At Grandma Answers To His Questions:  is no such thing as  privilege' [VIDEO]"},{"comment_id":"10152991363976336","commenter_b":"We know what we have to do!So what's the holdup !! Being our borders are wide open where just gonna wait till it starts in America! The longer this builds the harder it will be to totally defeat!","commenter_a":"Well, we could talk about why the government is giving Tonto National forest to a foreign mining company. Gold?","post_message":"Attorney General Eric Holder lashed out at Fox News, defending the Obama administration's reluctance to say 'Islamic extremism.'  'If Fox didn't talk about this, they’d have nothing else to talk about,' Holder said."},{"comment_id":"1160001747368578","commenter_b":"'@username What Does Hillary Clinton Really Want? WARNING: up America As you may know, Hillary Clinton mentor was Saul Alinsky. She wrote her thesis based on his writings. Saul Alinsky died 44 years ago and was the author of a piece called for Radicals. He wrote about how to create a State. President Obama prescribe to this philosophy as well as Elizabeth Warren and Bernie Sanders. Don fool yourselves, this is their mission and their purpose! There are eight levels of that must be obtained before you are able to create a social state: 1. Healthcare Control Healthcare and you control the people 2. Poverty Increase the poverty level as high as possible; poor people are easier to control and will not fight back if you are providing them everything to live. 3. Debt Increase the Debt to an unsustainable level. That way you are able to increase taxes which ...","commenter_a":"This information has all been checked, then double checked... It is 100% Correct. Maybe Trump knows something we should That's why there is such an alarm within US government, since Trump's statement about temporary suspension of migration of Muslims to US till US authorities make sure there is a proper concept of safe penetration of US territory. People are stunned to learn that the head of the U.S. CIA is a Muslim! Do hope this wakes up some! Until it hits you like a ton of bricks read it again, until you understand! We now have a Muslim government! John Brennan, current head of the CIA converted to Islam while stationed in Saudi Arabia. Obama's top adviser, Valerie Jarrett, is a Muslim who was born in Iran where her parents still live. Hillary Clinton's top adviser, Huma Abedin is a Muslim, whose mother and brother are still involved in the ...","post_message":"Hillary Clinton belongs in prison!"},{"comment_id":"10153142288487217","commenter_b":"USA is a dangerous place to live in. even Army men are not safe there. the brave men was unhurt in France even in terrorist attack. but in USA he got stabbed. Muslims terrorists are everywhere in USA TODAY","commenter_a":"Ban knives!!!!","post_message":"The airman, who was hailed as hero after the French train terror attack, is in a stable condition after being stabbed in California"}]
