[{"comment_id":"1694209280599095","commenter_b":"Illegal aliens have to register for the draft as do green card holders and U.S. citizens or immigrants who are born male and have changed their gender to female! You want to see a run for the border, get a good skirmish started in NK and use a military draft to man it, you'll see the mad rush to leave the U.S. by freebie wanters.","commenter_a":"And \" The last person that wants to play the nuclear card...is me. But you can never take cards off the table \" - Donald Trump -","post_message":"\"America's commitments to defending our allies remain iron clad.\""},{"comment_id":"1263484480357673","commenter_b":"He emptied out gitmo... FOR himself and KILLARY.... Good IDEA!!!!! NOW JUST go.... YOU horrible DISGUSTING TRAITOR!!!! Plant.... Unlock the docs.... Barry is a CRIMINAL!!!!!","commenter_a":"Their plan is working. Next up, single payer govt. system.","post_message":"IMPLOSION.  Carriers dropping out.  Rates skyrocketing.  UPDATE:  @webpagelink"},{"comment_id":"10155118024265231","commenter_b":"No","commenter_a":"It depends on the relationship the bride has with the mother of her fiance's child. If they get along great! If she is simple and has secret feelings for him then no. There are so many different scenarios. What works for one group may not work for others. And it may not have to do with maturity.","post_message":"Your fiance's 'baby mama' wants to attend your wedding. Do you let her? #AskDemetria"},{"comment_id":"10154888478529714","commenter_b":"#FuckTrump #FuckPence #MelaniaFirstWhoreOfTheUnitedStates","commenter_a":"Boycott the show!! This is truly getting out of control. Did this occur when OBAMA became President? \"Of Course NOT\"!! The left are outspoken to the point of embarrassing themselves on a platform of defeat. Protesting, Chanting, Revolting won't change anything!! The American people have made a choice, that choice is for change. \"Get over it, get with it\" The Liberals power(s) were overturned, \"what a beautiful thing\" & they don't know how to deal with it!!","post_message":"\"Vice president-elect, I see you walking out but I hope you will hear us.\""},{"comment_id":"10152742631486680","commenter_b":"Go Hillary ! Fun to watch these morons head explode!!","commenter_a":"Although I'd love to see a woman president, the very last thing we need is a career criminal like Hillary Clinton (who's currently in violation of Article VI of the Constitution) . She's proven herself time and again to be both incompetent and dishonest. She has no new ideas, and will continue to push Obama's tired old routine of increasing taxes, not for the domestic good, but so that we can send billions to Iran, Iraq, Pakistan, Afghanistan, Egypt and Israel. I would like a President who puts America first, for a change. The only candidate I've seen who shares these sentiments is Rand Paul, and he deserves my vote. By the way, many people are unaware that Obama's Democratic administration added $1.3 trillion in new taxes to small businesses, which lowers both wages and job creation. If you love America, vote Republican.","post_message":"Opinion: When Ayatollah Khamenei speaks, it pays to listen."},{"comment_id":"1724919811095083","commenter_b":"^^ for a woman that's a very clever reply","commenter_a":"I think a more interesting question would be, will women cycle differently on other planets? I'm no scientitian, but it seems to me it's a helluva coincidence (that we take for granted) that the female menstrual cycle is in line with the lunar cycle. Our bodies are 2/3rds water and the moon controls the tides. Am I talking out my ass if I suggest maybe the moon can can influence the fluids in our bodies? So on a dfferent planet, with different moons (and presumably after having been there for several generations), would women cycle differently?","post_message":""},{"comment_id":"1755937964626463","commenter_b":"Then. Fuck u bitch","commenter_a":"He also said white people are the Devil, that Jews and whites are evil and he proposed racial segregation in his speeches to the Ku Klux Klan. Be like him? No thatnks","post_message":"He was truly the greatest, and not just because of his accomplishments inside the ring.  The Free Thought Project  #RIP #MuhammadAli"}]
