[{"comment_id":"1348467338501928","commenter_b":"Totalbitch","commenter_a":"Fake","post_message":"If you had one word to describe Hillary Clinton, what word would you use? (Be nice.)"},{"comment_id":"742295419269809","commenter_b":"Herman. You read my mind. Agree completely!","commenter_a":"Banty McBotox seriously needs a reality check. Watching them as they form a circular firing squad is quite amusing. carry on.","post_message":"Please, Democrats. Keep repeating this. We want you to believe it with every fiber of your being. Don't change course. Don't learn your lesson. VIDEO!"},{"comment_id":"10155231887371037","commenter_b":"@username Proof he has no respect for the other branches of government.","commenter_a":"It's pretty sad that he's got to be the target of all this hate. It seems so many people can't go a single day without being hateful or judgemental. How can a group of people that claim to be loving and caring be so hateful and ugly hearted?","post_message":""},{"comment_id":"836603479863562","commenter_b":"Prayers and positive messages on the Internet along with taking as many polls as possible. Drive elderly Trump supporters to polls and escort them in. BLM and Black Panthers plan to block the elderly and Veterans from voting. Black Panthers alone blocked them last election","commenter_a":"Yes , with all my heart, since I can't help him with money...I wish him good luck..","post_message":"He truly does want to make our country great again. Let's show him we stand behind him. Do you support Donald Trump?"},{"comment_id":"10153122318985950","commenter_b":"The bitch is the devil.","commenter_a":"stand Firm Kim .Dont Backdown .The Devil Never wins unless You let him .","post_message":"Before returning to work today, Ky. clerk Kim Davis said she is being \"forced to disobey her God,\" and that she still won't authorize marriage licenses for same-sex couples."},{"comment_id":"10154111404003132","commenter_b":"They have it bad because Americans won't allow sharia law be submit to cower to Islam . Imagine that we refuse to stupid as the EU had been . OMG we want Muslims to be tested exactly as any other religion here . The nerve of us to refuse to cower grovel to Illegal immigrants or Islam . Imagine that wanting all to assimilate to Our laws ways traditions under our flag only if it offends you LEAVE go to Saudis Iranians enjoy sharia laws","commenter_a":"I didn't read anything about her being molested or disrespected. Maybe she went to the wrong rally? And who the hell says that a muslim woman should be more respected than anyone else? I don't care that she came in peace. As long as she left in one piece. I am sick of these muslims acting that everyone hates them. Some of us are just tired of their fictitious victimizations. There are real people in this country that have been victimized. Lets focus on them, instead of some nut job that is staging a silent protest because she wants to be special.","post_message":"\"I was not afraid of these people, because I truly believe that the decent people would have stood up and not permitted that,\" she said."},{"comment_id":"501076896740857","commenter_b":"Please jailer give that crazy lady a good short hair cut. Get rid of that horses tail.......","commenter_a":"She wants more of the spotlight I do hope that they send her back and let her stay there enough of her do your job or resign enough of you","post_message":"Send her back!"}]
