[{"comment_id":"563277980487645","commenter_b":"What's the difference between Trumps wife's and illegal immigrants? Trumps wife's applied to become citizens through the legal process of American citizenship and now their AMERICANS. Women like u are uneducated.","commenter_a":"Look up the definition of legal immigrants and illegal immigrants... Idiots.","post_message":"Yes, Donald, have you made their travel arrangements yet?"},{"comment_id":"10153310022881051","commenter_b":"Why is this vermin still alive?","commenter_a":"Blow him off the face of this Gods earth!","post_message":"Al Qaeda's leader just called for a 'lone wolf' terror attack on the United States - and that's not even the worst thing he said. (via VICE News)"},{"comment_id":"10153551674003984","commenter_b":"Latino's vote democrat most of the time anyway. Illegals shouldn't be voting. Lets crack down on cheating. voter ID.","commenter_a":"So now conservatives have to worry about the huge amount of Latinos who will vote Democrat in the 2016 elections, just because Trump voiced the truth about those coming here illegally. We have over a year to go before a candidate is chosen, giving the criminals who came over the border illegally plenty of time to change the minds of Americans.","post_message":"These days, Donald Trump seems to be at the center of every controversy.  He might just be in the midst of another one after this actress just thanked him for his stance on immigration...  Do you agree with Donald Trump's views on immigration?"},{"comment_id":"10153706263011336","commenter_b":"Who cares.. She's an old dried up prune!","commenter_a":"Oh dear... Am I surprised or what? NOT!!! :)","post_message":"BREAKING NEWS: After declining to state her position for years, Democratic presidential candidate Hillary Clinton says she opposes the Keystone XL oil pipeline."},{"comment_id":"10153524776247016","commenter_b":"If you want a female president, Elizabeth Warren would be a thousand times better than WHORE Hillary.","commenter_a":"You can dress HRC any way you choose and she still is a corrupt POS. NEVER $hillary, EVER BERNIE~!","post_message":"Wall Street thinks Sen. Elizabeth Warren would be a \"nightmare\" as Vice President of the United States.  You can't ask for a better endorsement than that."},{"comment_id":"1794488717482719","commenter_b":"Entertainers are daydreamer & live in fairytale world. Reality is not their attribute or focusing on oneself identity. Most live in denial & are good at role playing an artificial character. I'm not shocked at their liberal idealism & doing whatever for attention. These are individuals that struggle with growing up.","commenter_a":"Are they all just insane. Who cares if you cut your hair or any other stupid thing. It only hurts you no one else. So asinine.","post_message":"This is how some liberal women are coping with Trump's election win."},{"comment_id":"1692614590979428","commenter_b":"you have to take care of Americans first..children, the homeless, our Veterans. why do our taxes go to m.f. illegals??????","commenter_a":"Come on congress stop stuff like this. He must to have your ok.","post_message":"Obama's budget sets aside $17,613 per unaccompanied minor that illegally crosses the U.S. border."}]
