[{"comment_id":"10153373131878352","commenter_b":"How about us mothers teach our daughters how to take care of themselves and to love their own skin. A little girl will look to her mother for what a woman is and how to act. When you are body obsessed, your daughter will pick up on it. If you're working out, eating decent, and taking care of yourself, she'll pick up on that also.","commenter_a":"The stretch marks are redic. She looks like a Plane Jane. I'll go ahead and keep buying Barbies for my little girl if this is the only other option. Healthy self image starts at home, not the toy store. A for effort, C- for the execution. Please go back to the drawing board.","post_message":"She’s got stretch marks, brown hair and a fuller figure… now Anti-Barbie fashion doll Lammily stars in ad tackling women’s obsession with the perfect bikini body"},{"comment_id":"10154156813446926","commenter_b":"It is indeed a colony of the US, and it cannot survive without Billions of dollars of aid from their masters. Israelis should decide what future do they want for their children, one in which they are perpetually fighting a war, or one in which they can make peace and learn to live with mutual respect. --- As far as ethnic cleansing is concerned..this is again the same issue. It is only ethnic cleansing when the Jews are forced out of their homes, it is not ethnic cleansing when ZIonist militants throw out Palestinians from the homes they were living in for centuries.","commenter_a":"The way I see it Israelis will be in the Palestinian villages for a long time..... society whose leaders campaign for a convicted terrorist to be given the Nobel Peace Prize, a society that teaches its children hatred and violence as part of its standard curriculum, a society that unabashedly teaches anti-Semitism through all means available, a society that puts suicide belts on children during political celebrations, a society that honors, glorifies and funds terrorists, a society that uses a hateful version of religion to poison the minds of its children, a society that engages in widespread jubilation when Jews are victims of terrorist attacks, is not a healthy society that can develop peace of any kind.","post_message":"#Israel's occupation forces in the #WestBank have used at least three Palestinian family homes as military posts in recent months"},{"comment_id":"1081387115239718","commenter_b":"Ill stick with what my doctor reccommends","commenter_a":"so I should not take medicine and just live with acid reflex? I have been taking Nexium for many years.","post_message":"People who take certain popular medicines for heartburn, indigestion and acid reflux may want to proceed more cautiously."},{"comment_id":"1050118365055120","commenter_b":"I couldn't even watch, turned the channel. Didn't need to hear another black actor bitch!","commenter_a":"Too bad there was not a black actor or actress that was good enough to be nominated or win a oscar!!!!!","post_message":"Well, Chris Rock didn't hold anything back. What did you think of his monologue?"},{"comment_id":"796247023857405","commenter_b":"Her mouth is perfectly formed for Donny DOUCHEBAG ...","commenter_a":"DISGUSTING human being !!","post_message":"This woman is a disgusting POS!"},{"comment_id":"10153978622861438","commenter_b":"Of course she is. I could see through that bubbly bs","commenter_a":"Shocker....not.","post_message":"Kelly Ripa’s morning talk-show drama might force us to acknowledge all the work that goes into her cheery persona."},{"comment_id":"10154789513347908","commenter_b":"Bernie concede and join forces with Hillary. We all know this is what will happen anyway. We have to start now if not we will be wishing so if trump wins!","commenter_a":"Thank you, Bernie Sanders.","post_message":""}]
