[{"comment_id":"10153202654871107","commenter_b":"Deport all 30M illegal aliens.","commenter_a":"This makes me so angery that our government cant even enforce laws already there, time to replace everyone of our politicians for not doing their jobs and getting caught up with deal making, sick ,sick of it, PUT MORE INS AGENTS ON THE JOB AND GET ALL OF THE ILLEGALS OUT NOW!! and may I add i'm sick of politicians asking for money to do their jobs this includes you Mr. @username!!","post_message":"Our nation now has whole cities and states who stand up and willingly defy federal immigration laws in order to protect illegal immigrants who have broken our nation’s laws. This must end and it must end now. Today, I introduced legislation in U.S. Senate that would cut federal funding to cities and states who refuse to follow our immigration laws. My bill makes it clear, the American people will not stand for cities harboring violent criminals. But I need to know if you are with me. Please sign your \"Enforce Immigration Law\" petition right away, then consider chipping in $20.16 or more to help me spread my message to voters in early primary states."},{"comment_id":"10153406573360329","commenter_b":"Crocs get the pussy wet.","commenter_a":"There's nothing wrong with my crocs.","post_message":"Welcome to the nope zone."},{"comment_id":"10153574217106509","commenter_b":"And she IS being a butthole!","commenter_a":"I don't know why everyone gets mad at someone's expression of an opinion. Opinions are like buttholes, we all have em","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"},{"comment_id":"10150676513679999","commenter_b":"You're right @username, when I bought my Yankees jersey, I bought the Rivera one. Best closer ever.","commenter_a":"Nothing like the Yankees of my childhood. Subway series, tino Martinez, Alfonso Soriano, David justice, pettitte, Bernie Williams, posada and jeter. It won't ever be the same.","post_message":"The New York Yankees are knocked out of the playoffs after losing, 3-0, to the Houston Astros in a wild-card game."},{"comment_id":"10153619643270329","commenter_b":"Jordan Selph","commenter_a":"Jackie Hollander","post_message":"Bastille Day, As Told By Sloths"},{"comment_id":"1269059086447452","commenter_b":"Can you imagine how outraged the freeloading Obama brown nosers minion would be if that would be the Obama girls.","commenter_a":"But the images of the Obamas as monkeys is ok?","post_message":"Sen. Ted Cruz launched an \"emergency\" fundraising appeal after the Washington Post published a cartoon online depicting his daughters as dancing monkeys."},{"comment_id":"1686879181550201","commenter_b":"It had to be a woman. Why couldn't have just come up with a $3 bill. Leave well enough alone.","commenter_a":"Of all the really great black statesman the US has ever produced, wonder why they didn't pick Frederick Douglas, MLK? Oh yeah, they were republicans and Douglas said any black that would vote democratic was an idiot. Of course people are so ignorant now I have read where people have stated the democrats drew up the legislation for the civil rights act, in reality passed by a republican congress with a reluctant Democrat, Johnson signing it. Ignorance abounds","post_message":"BREAKING: OBAMA SUCCESSFULLY WHITEWASHES AMERICAN HISTORY…”Racist” President Andrew Jackson To Be Replaced With Harriet Tubman On $20 Bill"}]
