[{"comment_id":"1548076978821767","commenter_b":"@username Illegals are already criminals by definition.","commenter_a":"These liberal are making more and more people want to vote for Trump.","post_message":"Top progressives are terrified the Democrat mob attacks on Americans will send millions of voters running to Trump."},{"comment_id":"10150887913809999","commenter_b":"Ya and she is going to jail if she don't win so she will say anything to get her way! She will do what ever it takes.... Murder . lie . steal. #Trump2016 #MakeAmericangreatagain #GodblessAmerican","commenter_a":"I can't believe Americans will vote for this idiotic woman, but they will and bring another 4 years suffering to the world","post_message":"\"Donald Trump has built his campaign on prejudice and paranoia. He is taking hate groups mainstream and helping a radical fringe take over the Republican Party,” Hillary Clinton said."},{"comment_id":"10153839178821636","commenter_b":"What exactly is your barometer for being \"ruined\"? You realise Germany is one of the most successful countries in the world right? In terms of GDP, growth, economic viability, social mobility, lower wealth inequality, higher math and literacy, better education, lower incarceration and homicide rates, lower obesity, drug and alcohol addiction etc etc. If being among the top few countries in the world for such things is \"ruined\", you clearly don't know the meaning of the word. Put aside the right wing and sensationalist news outlets for a moment, who's job it is to highlight every transgression of migrants and Muslims, in order to make things seem much worse than they actually are, and instead take a minute to appreciate just how successful and dominant Germany is right now. Merkel is smart, she knows migration is the key to economic growth and sustainability, even if it has some negative byproducts. ...","commenter_a":"Merkel has not only ruined Germany with her idiotic open door fantasies, she has caused havoc for the rest of Europe. In an ideal world we'd all be free to roam. But the world is far from ideal now is it!","post_message":"For one reason"},{"comment_id":"10153875546363352","commenter_b":"Smh girl please...","commenter_a":"Let's see how much he's kicking out for a settlement","post_message":"RAPPER BRUTALLY KICKS FEMALE FAN BECAUSE SHE TOUCHED HIS SHORTS. REALLY? #DISGUSTING"},{"comment_id":"10154362042947756","commenter_b":"I would like to point out, this is myself debating with other women, not only do they act insane, but they will hate on any woman whom has a different opinion, get rid of the illegals, they are a drain on our economy...period, if you don't like, then let them live in your home, your a bunch of rabid animals acting like crazy people...how can anyone ever take you seriously...this was an experiment for my college professor whom wanted us to learn abouy equality...lol","commenter_a":"Well once all the blood sucking illegal's are gone, we can put money towards our vet's and the wall, we all know Mexico is to cheap and lazy to pay for it.","post_message":"President Donald Trump is expected Wednesday to move forward with plans for border wall, increased deportations."},{"comment_id":"10154244033251519","commenter_b":"So @username does not use gas. Good for you.","commenter_a":"Hey they lost a war. Get over it. Ppl been fighting ppl over land since the beginning of our time, even animals do it. What makes Indians so special?","post_message":"Salon's Charlie May was at Standing Rock as protesters celebrated the recent #DAPL news. Veterans, including Wes Clark Jr., bowed and asked Native elders for forgiveness.  Read more: @webpagelink"},{"comment_id":"10153138055390329","commenter_b":"You're an idiot, Michelle.","commenter_a":"Fuck you buzzfeed. Articles like this are the reason half the country has measles. So irresponsible for you to publish something like this","post_message":"Why would you ever want to get vaccinated? (WARNING: Contains images that some may find disturbing.)"}]
