[{"comment_id":"1753315408263301","commenter_b":"When u ugly as Fuck but because of your money u can fuck whatever hot girl you want! 😒😒😒","commenter_a":"😧we have become the laugh Hurd around the world..","post_message":"Nothing wrong with nude modeling, but could you imagine how they would scream if Michelle Obama had done this? Hypocrites..."},{"comment_id":"470911213097172","commenter_b":"Muslims offend me, so I want Muslims banned from America.","commenter_a":"Your face being covered offends me.","post_message":""},{"comment_id":"10153194467946756","commenter_b":"OH. MY. GOD.","commenter_a":"the 33 1/3 book he did is awesome","post_message":"\"Whether it's a song, or a book, or a conversation you have at dinner, the creative thing is what happens in the process—not the relic of it,\" says the man behind the band the Mountain Goats."},{"comment_id":"10153043162846130","commenter_b":"@username do us all a favor get a vasectomy","commenter_a":"You could skip the asking your boss to buy it for you and just buy it? Saved you a step. :)","post_message":"“Ask your doctor if birth control is right for you… then ask your boss if birth control is right for you.\""},{"comment_id":"10153952322157994","commenter_b":"Stupid young mfs","commenter_a":"#LifeinaPotHole #VOTE #GUNSENSE #VOTE #Hillary2016 #WitchHunt #BroomsUp #BlackLivesMatter #LATINOS #LGBT #WOMANCARD","post_message":"Three teenagers have been charged in the fatal shooting of an 18-year-old at Eastland Mall the day after Christmas."},{"comment_id":"1422614517766820","commenter_b":"Turn off your speakers when Hillary starts speaking or she will break your ear drum","commenter_a":"Maybe every issue liberals care about like letting men in girls showers and rest rooms","post_message":"A Donald J. Trump presidency would pull us backward on nearly every issue we care about. We can't let that happen."},{"comment_id":"10153511062521336","commenter_b":"None of them, should be able to Vote, till they Pay American Taxes for at least 10 years, then They would Understand, how We all feel, about having to Pay for their being here!","commenter_a":"Here is a photo and article - Are our elections being unfairly skewed through legal and illegal immigration ? @webpagelink","post_message":"Show us in one photo what you think needs to change in America and your photo could be featured in the first Republican presidential debate. Submit it here: @webpagelink  Don’t miss the Fox News-Facebook debate live from Cleveland August 6th on Fox News Channel!"}]
