[{"comment_id":"10154654026369160","commenter_b":"HOLLYWOOD ELITES..... TAKE DOWN YOUR WALLS AND YOUR GATES AROUND YOUR MANSIONS. We all want to have the right to walk onto your property, so that we can also enjoy the excessive good life that you live. We want to swim in your pools and relax in your hot tubs..... we want to sleep in your beds and wear your designer clothes.TAKE DOWN YOUR WALLS AND YOUR GATES!","commenter_a":"By the way the police had nothing to do with Nicole Brown and Ron Goldmans deaths. Awful nice of him in a past year how many officers lost their lives while just in their cars and were gunned down, 5 in Dallas protecting protesters against them, and 3 in Baton Rouge. Really thoughtful to attack the police which have been more of victims than offenders in this country.","post_message":"The director of \"O.J.: Made in America\" dedicated his Oscar to Nicole Brown Simpson and Ron Goldman, and then to \"the victims of police violence, police brutality, racially motivated violence and criminal injustice.\""},{"comment_id":"1226252880748515","commenter_b":"Simply disgusting to disregard females.","commenter_a":"Carry the baby, but you'll get no health care, no paid maternity leave, no disability if you have complications, no help with diapers, daycare or anything else. And then for extra shits and giggles we'll say that you're a burden on society and need to pull yourself up by the bootstraps.","post_message":"Not content with being a mere robot who repeats the same scripted line over and over during a debate, Marco Rubio demonstrated that he is a cold heartless robot on Sunday."},{"comment_id":"1120997057921304","commenter_b":"In my way to get wine lol!!!!!!","commenter_a":"Bad science!","post_message":""},{"comment_id":"10153615881104199","commenter_b":"Crazy lady!","commenter_a":"White trash at its finest","post_message":" knew what was going to happen. I wanted it on tape. Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off road first time. She got behind me a second time and then went to go around again. I let her have the road, called 911, reported her and her plate number I started phone video which was in a holder on dashboard hands free"},{"comment_id":"1397527680309345","commenter_b":"Give Facebook some competition techies.","commenter_a":"YOU BETTER LOOK AT THE FACTS ,TRUMP ALLOWS IMMAGRANTS IN ,BUT IT HAS TO BE LEGALLY ,WHATS WRONG WITH THAT ,AMERICAS SAFETY FIRST","post_message":"PISSED Off Facebook CEO Sends Giant YOU To Trump Didn Expect THIS To Happen Moments Later!"},{"comment_id":"1520981961255162","commenter_b":"And this coming from someone that used an \"excuse\" to avoid draft?","commenter_a":"This man is pitiful.","post_message":"Donald J. Trump suggested veterans suffering from PTSD are not \"strong.\""},{"comment_id":"10153047867707452","commenter_b":"Kimberly wirth you're an idiot and very ignorant","commenter_a":"I saw video footage of the man and he was clearly white with a reddish beard. The camera was laying on the ground and caught the bottom of his face. I'll look for the video and will post it.","post_message":"EXCLUSIVE: A Burbank woman says she's sick to her stomach after learning the man she went to junior prom with, Vester Flanagan, is responsible for the fatal shooting of a WDBJ-TV news crew in Virginia. abc7.la/1VbHsIC \"It almost feels a bit numbing because you don't think this would ever happen,\" she said. \"I knew him as a different person.\""}]
