[{"comment_id":"10152764552031491","commenter_b":"Yes. A woman can be a missionary or a nun. But why not be a priest too? Why is this off limits? What is it about women that make them unacceptable?","commenter_a":"Ponder on Mary's llife. have a virtue of humility. For the women, if you have calling to the religious life, you can be a missionary or contemplative nun. Be prayerful anyway, the right of women is not violated instead it is transcen! Pray for the gift of wisdom and understanding. Long live Pope Francis!","post_message":"Pope Francis gave a firm no to female clergy, while saying he wants to see a “greater role” for women in Catholicism."},{"comment_id":"10155266404471756","commenter_b":"I bet the indigenous Indians would love all of us to go home and leave their water alone !!!","commenter_a":"Bull! Obama and Clinton too!","post_message":"Protesters 'March to the Arch' to oppose Trump immigration order"},{"comment_id":"865539350258452","commenter_b":"Just keep trucking along well have a good president in the office finally","commenter_a":"Vote Trump","post_message":"Thank you Connecticut! See you this evening!! Lets MAKE AMERICA GREAT AGAIN!!"},{"comment_id":"10152950800096770","commenter_b":"Why doesn't she talk about the women her husband has been with considering her looks I don't blame him.","commenter_a":"I'm offended by the fact she isn't behind bars yet.","post_message":"At a campaign stop in New Hampshire on Monday Hillary Clinton slammed Donald Trump's recent remarks about Fox News host Megyn Kelly as \"outrageous\" but said that other Republican men running for president have made equally \"offensive\" remarks."},{"comment_id":"10152982959796130","commenter_b":"AMEN!","commenter_a":"Every member of Congress should do the same","post_message":"The #FoodBankNYCChallenge is meant to raise awareness about hunger and the struggle to live on such a limited budget."},{"comment_id":"1016358938401725","commenter_b":"MONEY !!!!! That's all they care about !","commenter_a":"probably worried about all the money they have stashed in offshore funds they may have to pay tax now","post_message":"\"I don't think I've ever wanted magic more.\" J.K. Rowling, James Corden and more British celebrities react to the historical #EURef vote. @webpagelink"},{"comment_id":"1104019902949566","commenter_b":"If she would screw a muslime she would bang anyone , they are animals","commenter_a":"Why does his 15 minutes of fame feel like 15 years?","post_message":"Apparently angry that his girlfriend cheated with a “dirty Muslim,” Zimmerman posted nude pics and contact info for his now ex-girlfriend."}]
