[{"comment_id":"1249235748461513","commenter_b":"Hillary laughed after getting a child Racist off with 2 months served !!!","commenter_a":"In 1978, Bill Clinton violently raped Juanita Broaddrick in a Little Rock, Arkansas, hotel room, then, as he was leaving, looked at her bloody lip and said: \"Better put some ice on that. Corroborated by five contemporaneous witnesses Knowing full well about Bill Clinton proclivity to sexually assault women, about three weeks after that rape, Hillary Clinton cornered Broaddrick at a party and said, pointedly, just want you to know how much Bill and I appreciate the things you do for him. Do you understand? Everything you do. In the early 1990s, Bill Clinton invited a young female staffer to his hotel room at the Excelsior Hotel in Little Rock, dropped his pants and said, it. As CEO of an organization, Bill Clinton had a young female intern just months out of her teens, perform oral sex on him while he made business calls. That girl name was Monica Lewinsky. ...","post_message":""},{"comment_id":"10153931593886336","commenter_b":"Let's add panderer to Hillary's resume after liar. Perfect qualifications to be the next President.","commenter_a":"She has mislead the Hispanic voters by lying to them. Just because they do not understand the law and the BS she has so taken advantage of them. Hillary for Prison in 2016.","post_message":"A campaign post aimed at winning over Latino voters has backfired and instead is drawing the ire of many social media users for purportedly playing up ethnic stereotypes."},{"comment_id":"10155518343016729","commenter_b":"This is a repost .....As For Barack Obama, We watched him sit for 20 years in a Church whose preacher condemned America . We watched him travel the globe apologizing for America's greatness .We watched him allow guns to be shipped to Mexican criminals so they could later turn up at crime scenes to mislead American opinion. We watched him use the IRS to punish those with opposing views . We watched him shrink America's military defences ,We watched mistreatment of our veterans , We watched the Ambassador and his protectors be left to die and be covered up by a lie , We watched our nation debt be doubled , We watched the nation's food stamps recipients climb to 25% , We watched a health care system nearly implode to promote some utopian fairy tale. We watched our police be disrespected , race relations fall to an all time ...","commenter_a":"Facebook is so liberally biased. Had this been a post by a Conservative toward Clinton or Obama supporters, the account would have been terminated. Also the person would have been fired from their position immediately. So the school not yet terminating him is garbage.","post_message":"Despicable!"},{"comment_id":"1684551998460631","commenter_b":"I am not an American, but I and we all are interested in your politics. Because we other part of the world are concern for peace and prosperity. And Why so much hate? Why so many wars? Do you think that is the solution? What is the meaning of diplomacy for you guys? Is it only war? Do you think that in this 21st generation you are again doing politics for religion ? And certain race? Is that how you want to see American politics ? How come you think Obama foreign policy is miss leading you guys? Do you got the proper answer? He talks about climate change, which is happening and strongly scientist also believe that, he try to bring your army back in your country from Iraq and afganishtan, he shown us that diplomacy and foreign policy is not only about to hate and make enemy. He ...","commenter_a":"Trump doesn't back down from our enemies Obama. You are nothing but a coward. Your nuclear and foreign policy has only weakened us, and made it easier for Iran and ISIS to kill us.","post_message":"Speaking at the close of the Nuclear Security Summit, President Obama said Donald J. Trump's nuclear comments show he \"doesn't know much about foreign policy or nuclear policy or the Korean peninsula or the world generally.\" @webpagelink"},{"comment_id":"943670819034115","commenter_b":"lol..that is a joke...that skank aint pretty at all..not cause her skin color..its because shes ugly..Id rather hit precious","commenter_a":"She is the most racist, evil, conniving bitch to ever be in the white house! With her 22 \"assistants\"! And you know most of them are probably white so she can treat them like slaves!","post_message":"Americas Freedom Fighters"},{"comment_id":"10153839178821636","commenter_b":"What exactly is your barometer for being \"ruined\"? You realise Germany is one of the most successful countries in the world right? In terms of GDP, growth, economic viability, social mobility, lower wealth inequality, higher math and literacy, better education, lower incarceration and homicide rates, lower obesity, drug and alcohol addiction etc etc. If being among the top few countries in the world for such things is \"ruined\", you clearly don't know the meaning of the word. Put aside the right wing and sensationalist news outlets for a moment, who's job it is to highlight every transgression of migrants and Muslims, in order to make things seem much worse than they actually are, and instead take a minute to appreciate just how successful and dominant Germany is right now. Merkel is smart, she knows migration is the key to economic growth and sustainability, even if it has some negative byproducts. ...","commenter_a":"Merkel has not only ruined Germany with her idiotic open door fantasies, she has caused havoc for the rest of Europe. In an ideal world we'd all be free to roam. But the world is far from ideal now is it!","post_message":"For one reason"},{"comment_id":"10153939365405329","commenter_b":"Las lamparas y el cosito para escurrir los cubiertos <3","commenter_a":"Invente o si te gustan los elefantes @username","post_message":"Because elephants are beautiful and lovely and perfect. (via BuzzFeed Animals)"}]
