[{"comment_id":"10153780845375530","commenter_b":"You can look it up!","commenter_a":"Columbus is neither hero nor monster. Indigenous people were screwin' each other over long before Columbus arrived. Don't like Columbus Day? Don't celebrate it.","post_message":"It was not clear when exactly the statue was vandalized. Detroit police were still looking into the incident when contacted."},{"comment_id":"438573499666627","commenter_b":"@username. She's an idiot","commenter_a":"Another liberal sheep just voting for a female!","post_message":"Lena Dunham isn’t worried about Michael Bloomberg."},{"comment_id":"689911851133407","commenter_b":"white trash...","commenter_a":"She needs never him also never to have children ever again","post_message":"This man repeatedly beat his wife's 5-year-old and would even send videos and pictures of the abuse to his wife. She refused to step in and both joked about beating and killing the girl. Well, a judge just decided what their punishment will be. Was justice served?"},{"comment_id":"10153876230626130","commenter_b":"Of reported rapes (is estimated that nearly 60% of rapes are unreported), the percentage of false claims is the same as any other crime, which varies from about 2-8%. Rape culture is automatically assuming the victim is lying when it's statistically unlikely, so congrats, you are part of the problem.","commenter_a":"There are no evidence supporting an existence of \"rape culture\". There are rapes. Go to the police. But there are also plenty of lies and no facts aqusation of rape by some women","post_message":"Keep speaking up, Nadia."},{"comment_id":"10154717771869657","commenter_b":"Moving forward..and having some fun goes along way..Go Trump!! Trump Up!!","commenter_a":"Lol","post_message":"Whiplash."},{"comment_id":"10153412068770667","commenter_b":"Ban all muslims from America!","commenter_a":"Muslims are hitting Facebook and other social media to proclaim that Islam is a religion of peace again... The only difference between \"moderate\" Muslims and radical ones is the distance from the suicide vest.","post_message":"BREAKING: Three explosions have left more than 30 dead and dozens injured at an airport and subway station in Brussels. Officials expect the death toll to continue to rise."},{"comment_id":"10153213545451336","commenter_b":"Lady , you've lost all credibility.","commenter_a":"You can't Change what has already happened or bring back the dead .","post_message":"Moments ago, Baltimore Mayor Stephanie Rawlings-Blake defended her decision-making to critics and vowed there will be justice for Freddie Gray."}]
