[{"comment_id":"10153458857456107","commenter_b":"Keep them out.","commenter_a":"As an avid, long-time, supporter of your campaign (I mean... I was hoping you'd run for president back in '04), I am very disappointed to see you taking this fearful and outdated stance. Isis doesn't need refugees to sneak into our country, they have the internet.","post_message":"Today I introduced a bill that calls for an immediate moratorium on visas for refugees. My bill will also stop all refugees as well as others from obtaining visas to immigrate, visit, or study in the U.S. from about 30 countries that have significant jihadist movements. This bill will be paid for with a special tax on arms sales to any of these countries. Read more here: @webpagelink"},{"comment_id":"10155064205902178","commenter_b":"Don't they know it's a \"shark free zone\"! This method works for criminals who take heed to gun free notices.","commenter_a":"Joe Daniel","post_message":"An 11-year-old boy was bitten by a shark off the coast of North Carolina yesterday, the second incident in as many weeks. >>>wral.com/@username"},{"comment_id":"761596003989174","commenter_b":"Sure","commenter_a":"TRUMPET THE SCARIEST ORANGE CAT GRABBING PSYCHOTIC CLOWN AFTER TRUMPET LEARNED A FOREIGN DIGNITARY SAID TRUMPET SHOULD PRODUCE HIS BIRTH CERTIFICATE TO PROVE TRUMPET WAS NOT SPAWNED BY A SCARY ORANGE APE ! TRUST TRUMPET WITH NUCLEAR WEAPONS ?!!!","post_message":"Too soon? Lol. - kyle"},{"comment_id":"10153482895003908","commenter_b":"Diet is unhealthy less u r a ufc fighter needing to perform at peek potential. Im more ripped than 85% of ufc fighters cause i burn more calories than i ingest..","commenter_a":"Absolutely true!","post_message":"A powerful ad exposes everything that's wrong with the diet industry in just 31 seconds."},{"comment_id":"1198972140162838","commenter_b":"Well you sure have a funny way of showing your best wishes for our country yourng woman. Respect is due any President, First Lady, VP and his wife. I hope you have learned from the experience.","commenter_a":"Yeah!!!! Why not you leave too. I can do your job! You do that about obama and tell me what happens!","post_message":"Gigi Hadid says her impression of soon-to-be First Lady Melania Trump at the American Music Awards was \"done in good humor.\" @webpagelink"},{"comment_id":"1142341912527542","commenter_b":"well so are you","commenter_a":"You haven't made a good movie since Good Fellows, sit down and shut up before you piss yourself.","post_message":"Robert De Niro has launched an excoriating attack on Donald Trump. The actor doesn't pull any punches in his criticism calling him a 'fool', a 'bozo' and 'an embarrassment to the nation'. And that's probably the nicest stuff..."},{"comment_id":"1229197387109219","commenter_b":"Putin to Obama stop protecting Muslims I know Putin he is insane. What do you want from 1st a Muslim then a racist 1/2 black 1/2 white that own family owned slaves. And a bi sexual with a jar of Vaseline in his side table","commenter_a":"And so how is this different from supporting Israel which is pro-pro abortion? How does the GOP electorate square Israel's pro-abortion record with U.S. Southern Christian position on abortion? @webpagelink","post_message":"\"If I told you in 2008 that Barack Obama would negotiate a deal that he acknowledges will fund terrorism, you'd have thought me a conspiracy theorist.\""}]
