[{"comment_id":"10154312691707577","commenter_b":"Only cowards suck on another cowards goat dick the system been broken since mr queer got in office the fact that our government already let the enemies in our country soon there will be more of this false flag shootings","commenter_a":"According to Breitart...the Orlando shooter worked as a security guard for a company, G4S who has a contract with Homeland Security to pick up illegal aliens at the border & transport them inland & just release them. No legal repurcussions nothing. Obama's policies are very sinister & treasonous. And why has nobody done anything?!","post_message":"The brother-in-law of nightclub jihadist Omar Mateen hates Donald Trump, works with refugees, and liked a video on YouTube that argued Islam isn’t violent, according to his social media profiles."},{"comment_id":"922573247835730","commenter_b":"Two women had enough of him, despite his wealth, and headed for the hills.","commenter_a":"I dont understand how a man with everything can be filled with so much hatred","post_message":"Yep, that just about sums up Donald Trump's campaign.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1300695323356852","commenter_b":"Get educated. Oh that's right you don't want the truth only lies from the most disgusting pig.","commenter_a":"Hillary supporters, How do you put Syrian refugees before American people? How do you look a homeless vet or child in the eyes and say sorry I won't help you. Oh the same way you turned your back on American's in Benghazi.","post_message":""},{"comment_id":"10155047636614657","commenter_b":"AND SHE WANTS EVERY WOMAN TO BARK LIKE A DOG !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Should every single woman in America have a federally mandated abortion, too? Is that where we're heading?","post_message":"A specious, simplistic pander."},{"comment_id":"914975468564571","commenter_b":"Yup the woman is a <unt","commenter_a":"The mayor told the police to stand down and let them destroy the city so blame her and your president","post_message":"BALTIMORE: Shop Owners called police 50 TIMES  and no one came!  @webpagelink"},{"comment_id":"1050627531700165","commenter_b":"Go Hillary!","commenter_a":"I don't think Republicans even talk a good game. Nothing but LIES and the people who vote for them are too stupid to see it.","post_message":"\"We cannot – and I will not – put our vets at the mercy of private insurance companies without any care coordination or leave them to fend for themselves with healthcare providers who have no expertise in the unique challenges that are facing our veterans.\"   --Hillary Clinton"},{"comment_id":"1369597926402497","commenter_b":"Vote for Ohillary then...you deserve her","commenter_a":"Republicans have been telling trump supporters for months they wouldn't vote for trump. Now trumpsters are acting like it's a surprise. Well...surprise. #NeverTrump","post_message":"Sorry, Rick Scott."}]
