[{"comment_id":"496037443910043","commenter_b":"MR TRUMP WHEN YOU BECOME PREZ> HANG A FEW DRUG DEALERS ON COURT SQUARE THEN THEY WOULD THINK TWICE ABOUT SELLING DRUGS TO YOUNG CHILDREN AND DESTROYING ENTIRE FAMILIES!!!!!!!!","commenter_a":"Get them out!!!!!!!!!!!!!!","post_message":"Drug dealers are pouring in from the southern border. We will build a wall on time and on budget. #GOPDebate"},{"comment_id":"10153173606151602","commenter_b":"Hartford rules, its a silly name just like every other name in the minor league. The only difference is that its unique and stands out a bit because it's so absurd. I'm still going to have to fun.","commenter_a":"I feel like I am constantly defending Hartford - telling people how far the city has come, and all of the neat things there are to do here. But this? This, I cannot defend. I was super excited for this stadium, and now, for the first time, I am truly embarrassed for and by this city that I have grown to love. Temporary attention that derives from a stupid name doesn't breed long term community commitment. It just gives jaded locals more things to complain about, instead of taking pride in their city. Such a shame.","post_message":"After weeks of waiting, we now know the name of Hartford's baseball team."},{"comment_id":"908173805909035","commenter_b":"Absolutely. Although I do remember getting erections as a child when I saw the vaginas of changing women","commenter_a":"If a woman has a problem with a little boy sharing the facilities, she needs to rethink her attitude. No harm done. Children's safety should always be the #1 priority.","post_message":"When SHOULD a child start going into public toilets on their own?"},{"comment_id":"10154735713113132","commenter_b":"She lives for the fame..controversy and all.","commenter_a":"Why discuss this with tabloids? What does her children gain from it? That's private. Quit putting your kids out there to be vulnerable like this.","post_message":"Kate Gosselin is opening up about her son Collin."},{"comment_id":"10154575658114255","commenter_b":"The women who want to be at the beach fully clad should be left alone. Why is this an issue?","commenter_a":"Those women would be sentenced to death for not respecting the laws and religion of some countries.","post_message":""},{"comment_id":"10153765437796336","commenter_b":"Then stop bringing in hundreds of thousands of illegals, then bring the jobs back to America.","commenter_a":"I agree, put people back to work and stop giving them freebees from the Government. Make them responsible for their own lives.","post_message":"Billionaire Charles Koch joined \"The Kelly File\" tonight for a rare interview, and said progress will depend on the American people understanding what is fair and what makes their lives better."},{"comment_id":"10155107351709062","commenter_b":"Grow a uterus then be concerned with this issue.","commenter_a":"The baby killers' excuses are absurd. They claim women's health concerns, yet having access to a sanitary hospital is unfair. And, it it's about health, how does killing a baby make them healthier???? Wouldn't keeping their legs closed keep the baby healthier??!","post_message":"Davis led an 11-hour filibuster of the restrictive legislation."}]
