[{"comment_id":"753223974794383","commenter_b":"I am 70 years old but I still would have tried to kick that POS ass","commenter_a":"I'd love to knock his teeth out.","post_message":"Unreal. Would you intervene if it happened in front of you? Thoughts? @webpagelink"},{"comment_id":"505113796343580","commenter_b":"They reproduce like rabbits, anytime a Muslim gives birth in an American hospital they should be sterilized.","commenter_a":"Screw the Muslims, they are all sheep in the cult of Islam.","post_message":"Watch what happens when Muslim Brotherhood extremists attack journalist in front of the NYPD!"},{"comment_id":"652024288284285","commenter_b":"I'm so glad.","commenter_a":"Yes","post_message":"Muslim Miss USA Chooses Jesus Over Mohammed... Islamic Community FURIOUS  She has the right to believe whatever she wants to believe.   Do you support her choice?"},{"comment_id":"10154184245291943","commenter_b":"This evil woman needs to fall, through what ever means necessary.","commenter_a":"Oh quit messing with us. Either do it or s t f u!!!","post_message":"With 75 days before voters pick their new president, email revelations are threatening to overtake Hillary Clinton campaign  with WikiLeaks founder Julian Assange hurling another log on an already raging fire with a vow to release  Clinton documents.  In an exclusive interview Wednesday night with Fox News Megyn Kelly, Assange was asked whether new information culled from Clinton emails would be released before the general election: \"Yes, absolutely.  - via Fox News"},{"comment_id":"10153127223956800","commenter_b":"Jodi, you are a serious bitch. And an ableist, uninformed, obnoxious bitch at that.","commenter_a":"I urge every parent with a child with autism (I have two children dx autism) to seek out proper IGenex testing for Lyme. Lyme mimics autism. Both of my children recovered from autism w proper Lyme treatment.","post_message":"\"The whole show is about raising money -- not to cure autism. Because a lot of people are working on biomedical research. My wife and I couldn't get our kid into any kind of school or program that was adequate for him until he was 7 years old. And people with fewer resources than us -- it's unimaginable to us what they have to go through. And the kids. They deserve better.” — Robert Smigel discusses Night of Too Many Stars   ► Watch the interview: @webpagelink ► Support autism programs: @webpagelink"},{"comment_id":"1178538995510357","commenter_b":"I would have moved too.","commenter_a":"Ungrateful people if they really look at the whole picture officers are out there protecting us,don't judge the rest because of the other bad apples.Now they got to deal with criminals and the society plus news reporters.Too bad the officers can't close their eyes and walk away and say I don't want to help you guys!!!!!! But they swore under oath they will serve and protect you!!!!!!!","post_message":"The officers even covered the couple's tip."},{"comment_id":"10153222476276323","commenter_b":"Breasts are breasts. get over it.","commenter_a":"The fact that womens nipples are considered porn and men's not, given the fact that ours are literally NEEDED as a vital source of nutrients for children is a notion that needs to be challenged. How can something that provides the best source of nutrients for a baby be considered too obscene to be observed in public where as men's which are just another body part be considered fine?! Free the nipple doesn't require a woman to bear all. I won't be, I've had no reason either functionally or otherwise to display mine in public (it's a bit cold in this part of the world) but my body is not obscene. I totally support the women doing this. If nipples are so provocative it's the sexualisation that society places on women not the female nipple owners that are the problem.","post_message":"\"It has to be said that, to the casual observer, the #FreeTheNipple campaign is a very confusing thing. Let’s just get this straight, one might say, it’s a feminist movement that encourages toplessness, and which has led to an Icelandic MP, respected as a serious parliamentarian, getting her boobs out for everyone to see. And you’re telling me this is one in the eye for the patriarchy?\""}]
