[{"comment_id":"1284879431547513","commenter_b":"ve que no es vara :)","commenter_a":"@username Sergio Boudet lo que hablabamos el otro dia","post_message":"Colorado kept $1 billion away from drug cartels last year."},{"comment_id":"10153606210716509","commenter_b":"she should have given him a stone cold stuner","commenter_a":"We need more moms like this!!","post_message":"What do you think of this mom's actions? Taking matters into her own hands, her son got a heavy dose of discipline on live TV: @webpagelink"},{"comment_id":"1036826173024907","commenter_b":"you mean the way a woman allowed herself to be treated for good money?? wahhhh wah wahhhhhh.","commenter_a":"The way Hollywood portrays women is outrageous.","post_message":"Right on. Go Dame Helen, go! - Eric March"},{"comment_id":"740770189446892","commenter_b":"Close all the borders already!!! Damn Obama!!","commenter_a":"Hang that Mo**ey!","post_message":"BREAKING: Muslim Teen Refugee Charged With Murder For Beating 97 Yr Old WWII Veteran To Death This is what happens if we let refugees into our country. This needs to stop. Do you agree we should close our borders?"},{"comment_id":"10154768873318132","commenter_b":"First off who the hell is she ? I've never even heard of her . Lol like seriously what does she do ? Furthermore nobody really cares about her opinion because it's a very poor one. More important things going on in the world then you crying about someone not hitting on you he probably doesn't even know who she is","commenter_a":"It seemed pretty clear to me that she was poking fun at herself, talking about her own feeling, not bashing the athlete in any way. Can everyone just relax and remember that everyone is entitled to their opinions and their own insecurities and maybe, just maybe, not twist every single thing that anyone says into something offensive? Geeeeeeeez!","post_message":"Lena Dunham is setting the record straight on her comments about NFL star Odell Beckham Jr."},{"comment_id":"10150524320899999","commenter_b":"So once again punish people who are trying to help themselves","commenter_a":"Un-American","post_message":"Millions of families may need to rethink their approach to college savings."},{"comment_id":"10153321016436051","commenter_b":"What kind of a twisted 'person' would do that? She belongs in a lock-up hospital.","commenter_a":"Anyone who does this when they are very young, will be sorry as they get older---","post_message":"Remember the woman who did this to an innocent animal? Well, she just got some bad news."}]
