[{"comment_id":"1081326848578752","commenter_b":"Should have been impeached a long time ago. I will believe it when I see it","commenter_a":"No I don't agree on that or anything he ever says. He should have been gone a long time ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"},{"comment_id":"514464205408539","commenter_b":"I think I'm going to be sick. These cockroaches need to get the hell out of the US and take your brother Obama with you.","commenter_a":"God is watching.....","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153972084976336","commenter_b":"Pretty white chick..Thug?...heck no...let her go....","commenter_a":"Thugs come in all shapes, sizes, genders and races! Thanks to the Law Enforcement for removing this thug from our streets.","post_message":"Abigail Lee Kemp was taken into custody in Smyrna without incident, the FBI’s Jacksonville, Florida, office announced."},{"comment_id":"456493334475707","commenter_b":"Fuck u bitch and that pedophile country PISSRAEL","commenter_a":"PISSRAEL","post_message":"In the following report, we’ve replaced references to Israel with the Islamic State of Iraq and Syria (ISIS) to make a point about how differently they are treated by the media and politicians."},{"comment_id":"10154886159283010","commenter_b":"Hippie bitch is a nobody","commenter_a":"The left is still jockeying for attention...and this is the best they've got..Less than impressive..","post_message":"A political twist on a holiday classic."},{"comment_id":"10153619254387439","commenter_b":"You stupid son of a bitch. She will never do a day in jail. Dream on asshole.","commenter_a":"FBI didn't seize a fucking thing, they were voluntarily turned over to the FBI and justice department. Geller is a rotten crotched liar.","post_message":"// google_ad_client = 'ca-pub-@username'; google_ad_slot = '@username'; google_ad_width = 336; google_ad_height = 280; // ]]> // // ]]> Hillary is such a tool for jihad and a knave to her lover pal Huma Abedin, I don t care how this destroyer gets her comeuppance, as long as she does. Like Capone and tax evasion charges. It was hardly the worst of what he did, but it got him put away. She should be sitting in prison for Benghazi, but if this is the best we can do, so be it. Although I hardly trust the DoJ. WASHINGTON As pressure builds on Hillary Clinton to explain her official use of personal email while serving as secretary of state, she faced new complications Tuesday. It was disclosed her top aides are being drawn into a burgeoning federal inquiry and that two emails on her private account have been classified as “Top Secret.” The inspector general for the Intelligence Community notified senior members of Congress that two of four classified emails discovered on the se"},{"comment_id":"10155894107865389","commenter_b":"I suggested the other day that we send them ours. We send two criminals for every illegal that comes to the U.S.","commenter_a":"We need leaders with strong convictions for the right thing","post_message":"ICYMI: Last night on 'Hannity,' Donald J. Trump doubled down on his stance on illegal immigration, telling Sean that the country of Mexico is “sending us their criminals.”"}]
