[{"comment_id":"1641329602799278","commenter_b":"Black lives matters ass bitch","commenter_a":"This person needs to be arrested!","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"},{"comment_id":"10153778472068984","commenter_b":"She doesn't owe anyone anything, much less a fucking apology lol","commenter_a":"Carly, how can someone so well versed on most subjects, be so uninformed on Muslims? Even Muslims know Islam is not a religion but an ideology of submission only. Therefore you owe Ben Carson an apology for being correct when he said they are not covered under OUR constitution. READ the Quran for yourself Carly and you will find out that you are an Infidel and are to be killed if you do not SUBMIT to Allah. Does that sound like someone our constitution would support? I think NOT!","post_message":"Carly Fiorina just revealed what she thinks about Ben Carson's comments about a Muslim serving as President of the United States - and you might be surprised with where she stands...  Do you think Fiorina is showing her true colors?"},{"comment_id":"766779530124121","commenter_b":"Vile woman","commenter_a":"LUCIFER CAN just go Home--The party is over--GOD BLESS AMERICA","post_message":"Thank you Indianapolis for the welcome. #ChooseCruz tomorrow: @webpagelink"},{"comment_id":"10154812464086049","commenter_b":"Folks, it is a well known fact in the mental health community that many folks who take \" street drugs\" have an underlying UNDIAGNOSED psychiatric condition , such as depression, anxiety, etc. They are \"self-medicating\" themselves with street drugs. It is a shame, because many of these individuals could be helped with an early identification and treatments (therapy preferably and meds if needed).","commenter_a":"They should be charged with manslaughter if any of their \"customers\" died from overdoses. Sorry. These guys knew what they were selling kills people.","post_message":"HEROIN BUST: 9 people have been arrested in connection with a heroin and oxycodone drug ring on Staten Island. Prosecutors said they've selling for several months. Names of suspects: @webpagelink"},{"comment_id":"10153536791141717","commenter_b":"Stupid, dumb BITCH!","commenter_a":"I guess she never met Alexander the Great.. lol","post_message":"A gay man could never be a \"warrior.\""},{"comment_id":"1107309912667398","commenter_b":"Testing , testing , are you awake America , if not you'd better be soon , ISIS is here an they're not gonna wait for us to realize it , to late is to stupid , time to shake the Muslins up to the fact that we've wasted enough time an lives on there nonsense arrest an deport where needed , tolerate nothing , they want changes send them home an let them change there own countries , leave us alone an we'll leave you alone too .","commenter_a":"@username and trump piss off.","post_message":"Donald J. Trump says there may be more terror attacks across the country because \"we've been weak\" and \"our leaders are...stupid!\" @webpagelink"},{"comment_id":"862806877145701","commenter_b":"Well said @username well said. America was built on the backs of immigrants, the indigenous people were treated and still to this day treated worst than the Buffalo. I hear them cry about migrants coming across the border, when they themselves have no right to the land they call home.","commenter_a":"History will judge him to be one of the best presidents we have had. I hope in the near future we will be able to have another such president.","post_message":"We DEFINITELY have Pres. Obama's back. Do YOU?  Thanks to Roy Mark Ramdas and Being Liberal."}]
