[{"comment_id":"10154236917854726","commenter_b":"Hillary must never be allowed into the White House.","commenter_a":"What about these rides on that billionnaires plane!","post_message":"Media pushes war-on-women narrative against GOP while ignoring indiscretions of Bill Clinton."},{"comment_id":"10153373196639877","commenter_b":"Girl bye !","commenter_a":"SIT UR FACT AZZ DOWN ..AINT GONNA HAPPEN .","post_message":"Wendy Williams wants Terrence Howard fired from 'Empire' because of past abuse allegations. Check out the video clip below.  Grio fam, what do you think of Wendy's remarks? Sound off."},{"comment_id":"10154298251075098","commenter_b":"There's a reason why they're called filthy rich.","commenter_a":"This is so typical of corporate America. The C Level staff walk away with millions and everyone else has to suck it up.","post_message":"What a shock. Despite Trump's assertions that he was going to stand up for working people it turns out that Wall Street and Goldman Sachs are still running the show - and the Trump administration. Among many other billionaires in the Trump administration is Gary D. Cohn, the departing president of Goldman Sachs and Trump's new director of the National Economic Council. Upon leaving Goldman Sachs, Cohn just received an exit package of $285 million. Yes, $285 million.  And that's how the rigged economy and oligarchy works. The middle class of this country bailed out Goldman Sachs to the tune of over $800 billion. Goldman Sachs paid a $5 billion fine to the U.S. Treasury for illegal activity, as did virtually every other major bank. Meanwhile, no top Wall Street executive is prosecuted for criminal activity. Instead, the president of Goldman Sachs becomes the leading financial adviser to the President. And, to add insult to injury, Cohn and the Trump administration will soon end up supporting huge tax breaks for the rich while cutting Social Security, Medicare and Medicaid. Can we stop them? Yes. But only through a powerful and focused grassroots movement which tells Congress to represent us all, not just the 1 percent."},{"comment_id":"10157399464465093","commenter_b":"A hun will never kill anyone! Its the people that use them! People kill people! Criminals get them illegally and you can't stop that! It is not possible! Give me a reason why you think criminals should only have guns?","commenter_a":"Yes but 100% of gun crimes involve guns, so start with the legal gun owners because it's way easier, and it looks like we're doing something.","post_message":"Pass it on."},{"comment_id":"1390703587614315","commenter_b":"We have no way of knowing how Bernie Sanders would have weathered the inevitably nasty storm against him if he had been the nominee.","commenter_a":"I'm really angry at Democrats sending the candidate least capable of defeating Trump into the general. What morons. They saw polling showing that Sanders would trounce Trump by double digits and yet decided that Clinton was the 'safe' bet??? Effing morons.","post_message":"Donald J. Trump's campaign tells us a lot about what kind of Commander-in-Chief he would be."},{"comment_id":"790580904351473","commenter_b":"You shouldn't be in office if you can't stand by your convictions! You were elected b/c the voters trusted you! You were given a mandate to turn the tide in this Country! Now do it!","commenter_a":"gutless bast---s","post_message":"What are your thoughts on this reasoning? 'Many' Reps. Afraid of 'Retribution' If They Voted Against Boehner"},{"comment_id":"1072808739397262","commenter_b":"Oppression? You are way off base here. It is oppressive to want it to be 1959. Here is the bottom line. Do what you want but you don't get others to do what your religious Far right cult says. And I am a Christian.","commenter_a":"Alas...another unintended consequence of liberalism. In their quest to 'help' people, they made them worse off. To correct their unintended consequence, what will liberals recommend? They will recommend coercing the college into providing the students with birth control... And class...this is another example of liberalism leading to oppression...","post_message":"What would Jesus do?"}]
