[{"comment_id":"1770955373137836","commenter_b":"Wow what a party","commenter_a":"Eu Cruz i might just join this","post_message":"'I’m staying at the Hilton in Palm Springs, which is hosting the famous Dinah pool parties, and the hotel feels like a homosexual harem.'"},{"comment_id":"686618911486884","commenter_b":"Does this arbitrary terrorism not offend a large number of your customers, therby, justifying, really justifying firing such a dumb asshole?","commenter_a":"How much do he makes,","post_message":"This might be the worst CEO in the country and no, it’s not Papa John this time."},{"comment_id":"10154645130189062","commenter_b":"Woman should be lucky for not being arrested ,for interfering with 'police business '.","commenter_a":"So he was a really nice guy she said. But, let's post this to social media to ensure really nice guy loses his job instead of giving him the opportunity to learn from his mistakes.","post_message":"'The reason I pulled you over today...I just want to know, what's the emergency?' said the woman."},{"comment_id":"10153656490006107","commenter_b":"Mrs. Paul rocks!!!! Ron put down that economics book and take Carol to dinner!!!","commenter_a":"This election cycle by far has been the craziest one I've ever witnessed. The one question I can't seem to get an answer to is this,,, WHY??? Why are both sides attacking Trump? Why is China attacking Trump, Why is the pope attacking Trump? Why is Mexico attacking Trump? Why are the Republicans going against their own pledge and attacking their own front runner? Why is HilLIARy so afraid of Trump? Why does Trump have this Republican Party split? Why is Mitt Romney going after Trump? Why are the Koch brothers dumping in 75 million dollars to go against Trump? This isn't normal, something doesn't add up and we need to be smart enough to see through the the smoke and mirrors why they are quickly exposing themselves as the try to take down Trump before #SuperTuesday Here's my theory, it goes back to the age old question how to ...","post_message":"Happy Birthday to Carol Paul, an amazing woman, mother, and advocate for liberty. Thanks for making me the man I am today, Mom. Happy Birthday."},{"comment_id":"10152739973466519","commenter_b":"The Democrats are the snakes. Here come the eagles.","commenter_a":"At least the Republicans are growing a spine and starting to stand up to the Democrats properly rather than just whining about impeaching Obama.","post_message":"It took long enough, but here's how Obama realized that playing nice with Republicans is a sucker's game..."},{"comment_id":"1016134698454262","commenter_b":"She'll just speak to someone else. Challenge her!","commenter_a":"I hate Hopkins as much or more than they do. But this behaviour is just babyish. If you want to defeat her, debate her with facts and the moral superiority of your argument. This is just forfeiting the chair to a racist moron.","post_message":"Brunel students just gave us all a masterclass in how to deal with Hopkins"},{"comment_id":"609422632593811","commenter_b":"If it is true Hillary said that, she deserves to lose big time and go to jail.","commenter_a":"this is noy the first time she threathenn to kill him. she did little over a week ago","post_message":"Whoa. You do NOT mess with the Clintons"}]
