[{"comment_id":"10154520353580329","commenter_b":"All humans have breasts, relax","commenter_a":"Not all people with boobs/breasts identify as women.","post_message":"I love you AND I hate you."},{"comment_id":"496097670580813","commenter_b":"better yet, remove them from the planet","commenter_a":"Damn muslims.","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"10152955044437293","commenter_b":"The evangelical pastors insist that only God can change the climate and that is an affront to God to claim that Man can do so. The ideologues constantly scream that the scientists, left-wing and Al Gore are in a conspiracy to 'steal our liberty.' using climate change to bring about global government. --- BTW. I am GOP and have been for decades. I also listen to Rush Limbaugh and Mark Levin, but unlike --- what is the word? sheeple? --- I don't check my brain at the door and believe everything I am told, like someon who listens to that \"lamestream media.\" --- As for today's GOP, it is nothing like the one that Reagan led. He would not have tried to squash any talk about climate change, prevent any reference to it in schools, or cut funding for research into what is happening in our climate. But that is ...","commenter_a":"The deniers have wax in their ears and a blindfold over their eyes--because they prefer to think that their ideology or religion is under attack by all of this (and are encouraged by the oil and coal companies to believe just that).","post_message":"And scientists are concerned."},{"comment_id":"1792151467673200","commenter_b":"Right a true nasty woman!","commenter_a":"The only \"educational\" facet in Rosie is her nastiness! Period.","post_message":"Rosie O'Donnell says she posted a tweet questioning whether Donald Trump's 10-year-old son is autistic because she found it \"educational.\""},{"comment_id":"931654693541670","commenter_b":"It's not just barbaric, it is one more tool of the rich used to keep the not-rich \"in their place\".","commenter_a":"I guess when you have universal medical coverage you don't realize what a nightmare our system is.","post_message":"The headline really begs the question, who the hell would ever want to visit the United States knowing they could be bankrupted if they should need medical care while they are here?/"},{"comment_id":"997888900251582","commenter_b":"this lady is crazzy.","commenter_a":"The Amerikan Taliban.","post_message":"Hey you! You should go to church every Sunday! And the government should require it. Because America and morals and stuff."},{"comment_id":"989439721086384","commenter_b":"Thank you, Senator for being on the right side of this issue.","commenter_a":"How dim do the gun owners have to be, make guns so easy to use, and easy to get and they can't figure out why there are so many shooting? Clowns.","post_message":"Our hearts go out to the families of the victims and to the community of Lafayette. Once again the scourge of gun violence has claimed the lives of innocent Americans in a place where they have every right to feel safe. This chilling crime is yet another reminder that gun violence can strike anywhere, at any time.  When will Congress act to reduce gun violence?"}]
