[{"comment_id":"10153619308152235","commenter_b":"@username a racist comment about baking!?? Okay, surely you jest. You don't know what you're talking about so you're automatically excluded. @username I agree it could be seen as sexist except I am a female and bake all the time, but MORE IMPORTANTLY Men are known to be the best chefs😉. @username she didn't make any valid point when she stated \"nothing new, threats made against students daily\" She's out of touch with the article and with reality if she is trying to compare unspecified kids being threatened to a RACIST threatening to kill only BLACK KIDS posing with ak47 on the school grounds!! ARE YOU FREAKING KIDDING ME!??? The generalization she attached to this comment is uncanny, disturbing, and I'm sorry RACIST in an of itself. Because the DENIAL of racism IS racism also.","commenter_a":"This is nothing new. Threats are made against students daily! We went through this last year and most kids were kept at home until the instagram poster was identified.","post_message":"Another effing beautiful day in post-racial America."},{"comment_id":"10156213230310725","commenter_b":"Yes but most came here legally not sneaking across a boarder and none of us got free food free housing free health care or free college. You think all that is fair for us to pay the bills of someone illegally sneaking across our boarder or overstaying there visa. How many Americans have been murdered or robbed or raped by them? Far to many!","commenter_a":"Everyone are immigrants to US America .... Okay!!!!!!","post_message":"Notice that illegal immigrants will be given ObamaCare and free college tuition but nothing has been mentioned about our VETERANS #DemDebate"},{"comment_id":"794164403965442","commenter_b":"F%%+ white people !!!","commenter_a":"This is why I hate white people!!!","post_message":"In an update to our previous coverage; ASU Police Officer Stewart Ferrin's administrative leave has been extended. His case was passed over to the new ASU Police Chief who will decide on the officer's fate."},{"comment_id":"10154373252360329","commenter_b":"Women can wear whatever they want.","commenter_a":"She's very talented & beautiful but please stop trying to normalize the antiquated religious practice of women covering themselves. Women have come too far to regress back to this BS! (That goes for Orthodox Jews, Islam, & Christian nuns.) Little girls all over the world: your body is not shameful! You do not need to be modest to lessen the desires of men or a masculine God! You are beautiful in all of your natural glory!","post_message":"She also does comic book characters and Kardashians."},{"comment_id":"10153963536777235","commenter_b":"And a large percentage of illegal immigrants simply come here legally with a visa and just don't leave.","commenter_a":"The wall is absolutely absurd. See the ocean? You can use it to go around the big ugly wall. See the airplanes? You can go over the wall. Ask El Chappo about going under things. It's nostril flaringly stupid. Ancient technology. Pre airplane, backhoe and no ocean on either side. It would be funny if there weren't so many truly stupid people believing it. Gag, cough, hurl.","post_message":"BUSTED!"},{"comment_id":"765284786938035","commenter_b":"real women respect themselves enough to not get knocked up and then run from responsibility.","commenter_a":"The Colorado shooter's neighbors have been interviewed and his shack has been visited. Turns out he was...drumroll please...AN OBAMA-LOATHING PRO LIFE CHRISTIAN! Now who could've possibly seen that coming? The propaganda videos led the terrorist to carry out his deed. Sound familiar something going down a tad east of here?","post_message":"What a sleaze ball."},{"comment_id":"10153809354827169","commenter_b":"Let's make a new list and start it with Tamir Rice.","commenter_a":"White people in America don't have Race Hustlers disguised as Christian Reverends telling the young men that they can't win in life because they're a victim, nor have Whites exalted bards who glorify violence against sex objects that once were loved as women, violence to police, and street crime. In short, White people are starved for heroes, but Black people have chosen villains for their heroes, and feed their souls on poison. And what people of any age can rise above their heroes?","post_message":"Four out of 10 African-Americans said they doubt the nation will ever achieve racial equality, but as many white Americans believe racial equality has been achieved, according to a national study released by the Pew Research Center (From PBS NewsHour)"}]
