[{"comment_id":"1369855736388104","commenter_b":"Those women are vicious hacks for hillary.they don't care what she did against America or the corruption & lies they are all part of the corruption .","commenter_a":"What a waste of her time. They just want their ratings to increase with all the drama","post_message":"The claws really came out..."},{"comment_id":"1670944519835060","commenter_b":"These women need to learn to lug around bottles with store bought milk that contains half the nutrients in case their baby becomes hungry and fussy and starts bothering everyone around them. They should use their brains!!!!","commenter_a":"Feeding your baby and using your body the way God intended it to be used is absolutely shameful. How on earth could women stand up for such a thing and demand that society accept this!","post_message":"Women are brilliantly standing up to breast-feed shaming.  Read a powerful example right here: @webpagelink  Like ATTN: on Facebook."},{"comment_id":"829690333773863","commenter_b":"The black community needs to clean up their act, plain and simple.","commenter_a":"This type of person should not be free.","post_message":""},{"comment_id":"10153544587506350","commenter_b":"Real women dont need all that! They are content with the gift of life they just grew in their body for months!!!! This is a little overkill.","commenter_a":"Oh good grief...isn't the baby enough to show off? Must one be materialistic to have to have a push ring?","post_message":"Push presents (the bling or gift an expectant mom is given for, um, pushing) are getting more and more popular."},{"comment_id":"962496207173455","commenter_b":"#trumpnation #teamtrump #trump #votetrump #riseup #crushpoliticalcorrectness #getourjobsback #deporttheillegals #stirupwashington #shakeupDC #BANMUSLIMS #rebelflag #no2NikkiHaleytheTraitor #merrychristmas #makeourmilitarygr8again #keepguitmoOpen","commenter_a":"Go F your self Cruz! Voting for TRUMP!","post_message":"\"The truth of the matter is if Donald Trump became president, nobody knows what the heck he would do. He doesn't know what the heck he would do,\" Ted Cruz said."},{"comment_id":"10154340193151509","commenter_b":"Hillary has an estimated 70-80 pct of Hispanic votes , but only needs 40-45 pct according to experts. I'm just the messanger. Rand Paul is my pic.","commenter_a":"Not that I care for this socialist , but the Latino vote will bring Hillary over the top.","post_message":"Donald J. Trump has been tearing away at Bill and Hillary Clinton for more than a week"},{"comment_id":"10154453372292149","commenter_b":"She, Bill are too quiet. Beware: they are coming back.","commenter_a":"Go to Jail........","post_message":""}]
