[{"comment_id":"572844126217923","commenter_b":"Before you build the wall could we please shut down all the tunnels underneath the fence?","commenter_a":"Jason Messenger","post_message":"WOW! An honor to be the first-ever presidential candidate in a primary- to be endorsed by the National Border Patrol Council. WE WILL BUILD THE WALL-- WE WILL MAKE AMERICA SAFE AGAIN! Thank you."},{"comment_id":"10157007310710354","commenter_b":"Arrest her. There is no such Allah.","commenter_a":"Could she be a worse POS?","post_message":"Here's the deleted TWEET..."},{"comment_id":"10153184111444877","commenter_b":"these now women were looking for an easy ride to stardom so was their mothers who allowed them to be around a grown man in some hotel.","commenter_a":"I think she's screwed up!! I can understand her need to defend black folks but this guy??,","post_message":"Whoopi Goldberg defends Bill Cosby: 'He has not been proven a rapist.' Watch what else Whoopi had to say below.   Grio fam, what do you think of Whoopi's comments?"},{"comment_id":"10154655136218984","commenter_b":"Makes you wonder why she's riding in a van! Not very comfortable and certainly not presidential.","commenter_a":"Not a Hillary fan but have you ever tried getting out of one of those van back seats?","post_message":"There's some new footage of Hillary Clinton making the rounds, and it's exactly what her campaign does NOT want America to see. Here's what happened to Hillary when she tried to get out of a van.  This confirms a lot of things that we'd feared about the Democrat nominee..."},{"comment_id":"1598931086790902","commenter_b":"The horrid hag hisses!","commenter_a":"The Blonde Deatheater attempted to weasel out of every single question. She couldn't even keep her lies straight (lies she was telling at the moment).","post_message":""},{"comment_id":"10153880251122217","commenter_b":"No. They should be pure. Virgin skinned, hairless.","commenter_a":"See John for the invisible tattoos.","post_message":"Send us photos of your tattoos! We'll be talking ink in the workplace with tattoo expert Dr Matt Lodder at 13:30 (BST) on #FacebookLive. We'll be showing some of your tattoos as part of our broadcast, so please email your snaps to yourpics@bbc.co.uk"},{"comment_id":"904121959720983","commenter_b":"Lock Her up!","commenter_a":"Behind bars fits her","post_message":"America is waking up!"}]
