[{"comment_id":"10156389241130725","commenter_b":"if the so called good muslims are offened with what Donald Trump is saying why are they not stepping up and reporting the ones that are trying to hurt us,that offens ME!","commenter_a":"On Trump, his blocking Muslim entry is due to terrorists in with refugees, Americans as terrorists coming back not the innocent and good ones, he wants to stop the entering to get the bad ones out first to protect Americans. I agree with @username","post_message":"Statement on Preventing Muslim Immigration:"},{"comment_id":"10153043842829411","commenter_b":"This Germans are only the progeny of the stupid Jews that survived the holocaust.","commenter_a":"Look the Nazi are back.","post_message":""},{"comment_id":"1420287694697641","commenter_b":"So where should she be deported for blatantly taking advantage of British taxpayers?","commenter_a":"Reminds me of my mum 9 kids 3 adopted. 4 in care and 2 stayed with her if you cant look after that many kids don't have them ! Keep your legs closed and get your tubes tied !! Why they didn't do that anyway is beyond me","post_message":"'She should have had her tubes tied'"},{"comment_id":"10153845765260950","commenter_b":"@username are you a woman? No! Then it's not your say!","commenter_a":"Republicans already passed a Zika bill. Democrats voted against it because defunding planned parenthood was attached. Democrats had rather murder the unborn than prevent the born from being deformed. You see stopping Zika is bad for buisness at Planned Parenthood!","post_message":"President Obama blasts Republicans in Congress for refusing to approve requested amount to fight against Zika."},{"comment_id":"10153312043927061","commenter_b":"I'm sure she is a smart cookie, given her education, but why can't these men date women their own age?!","commenter_a":"Such mean comment .. Wow!!! I sure she's a very nice person.","post_message":"Congratulations, Ryan Phillippe! The actor is reportedly engaged to his longtime girlfriend. @webpagelink"},{"comment_id":"10155121941959614","commenter_b":"Over that wall!","commenter_a":"This is how Normal Americans see trump n trump supporters.","post_message":"Far from targeting only  hombres, as Trump has said repeatedly, his new order allows immigration agents to detain nearly anyone they come in contact with who has crossed the border illegally.  People could be booked into custody for using food stamps or if their child receives free school lunches."},{"comment_id":"1119811948055147","commenter_b":"You want a female hero? You've got Samus! Leave Link alone and stop this feminism in video games. Ghostbusters already died and they want all of the world become female, not just video game characters...","commenter_a":"while we're at it, should we change harry potter to female as well?","post_message":"Nintendo's reasoning makes zero sense."}]
