[{"comment_id":"10152794611951636","commenter_b":"It is just that!.we women have no say....we just get on with it!.","commenter_a":"Really?? A marketing campaign for icecream?? You don't know half of what happens .","post_message":"We’re not supposed to break the silence and secrecy surrounding women’s bleeding bodies..."},{"comment_id":"2191617061063923","commenter_b":"It should be lock that jerk up , wth.","commenter_a":"YES","post_message":"Donald J. Trump just tweeted that those who burn a flag should either lose their citizenship or get a year in jail. Do you agree?"},{"comment_id":"10154246472810695","commenter_b":"I thought poppies grew from the earth","commenter_a":"Plz worry about the heroine statistics that are rising and rising. And stop giving people life in prison for a plant that grows in gods green earth.","post_message":"This family-friendly Easter event took a pretty surprising turn."},{"comment_id":"1576897572597356","commenter_b":"The only \"racist\" in this picture is Whoopi ! Chip on her shoulder bigger than her ego!!","commenter_a":"It's time for her to go. She never has anything nice too say and she isn't funny anymore.","post_message":"Will someone please take Whoopi Goldberg off TV?"},{"comment_id":"881915648510562","commenter_b":"Bitch you wanna get arrested????","commenter_a":"@username we talked about this as well","post_message":"The dark history of why cocaine is illegal... (ATTN: is excited to launch a new series about the history of illegal drugs)."},{"comment_id":"1132111446809033","commenter_b":"Anyone who thinks this monster deserves peace to live her life free is more fucked up than she is!","commenter_a":"You people are sad! Leave her alone already, she deserves the right to be rehabilitated. Still watch her closely, but leave her alone.","post_message":"The convicted killer has changed her name several times since her 2005 release."},{"comment_id":"1663552577266891","commenter_b":"Yes--indeed. This woman's behavior is appalling.","commenter_a":"Trump supporter! Makes me sick!","post_message":"Attacked as they prayed? A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."}]
