[{"comment_id":"10155004670634203","commenter_b":"I can't stand the smug bitch. Liberal fake news network is perfect for her.","commenter_a":"She's got 11.5 months to decide whether Santa is still white.","post_message":"Note Megyn Kelly's use of the word \"journalists\" here..."},{"comment_id":"10150689045559999","commenter_b":"Ha, the wife and dog get all the ink.","commenter_a":"@username who's in the photo?","post_message":"Amazon.com is doing 2 predictably unpredictable things this week."},{"comment_id":"541360652655195","commenter_b":"Muslims are buggering parasites that get alone with no one","commenter_a":"NO ONE FORCED THE MUSLIMS TO LOOK. THAT WAS THEIR MISTAKE. KEEP YOUR NOSE OUT OF OTHER POEPOLES BUSINESS.","post_message":"A pastor posted this controversial sign outside his church and it caused a huge stir in the community. His response to his critics was very simple."},{"comment_id":"1046343315386679","commenter_b":"Can two women already have a baby? I mean in a biological way of course...","commenter_a":"Wow","post_message":"No women required."},{"comment_id":"712619718886803","commenter_b":"At the risk of repeating myself, J. McCain turn your back on this blight you call a presidential candidate! You do a disservice to your party, your constituents, your military compatriots and most importantly your moral compass which should be leading you away from rather than to Trump.","commenter_a":"Trup will be lopplllllppp Cidgbelillnnrvrubrg","post_message":"He's mad as hell but is he gonna take it any more? -- Paddy"},{"comment_id":"598960046961241","commenter_b":"YES, fire him!!","commenter_a":"I agree he definitely needs to be fired","post_message":"Police chief announces that he going to enforce Shariah Law.  He can't get away with this. Shariah law has no place in America.  Do you think this police chief should be fired?"},{"comment_id":"1328638283841395","commenter_b":"Generational behavior.","commenter_a":"I've been saying that for over 20 years and people look at me like I've got two heads. Everyone feels entitled including the adults and they pass it on to their children and the problem get exponentially worse. Where and how does one put an end to this......","post_message":""}]
