[{"comment_id":"10152900911316336","commenter_b":"Jane looked to further her movie career ,it didn't work.Scumbag","commenter_a":"Traitor!","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."},{"comment_id":"10154592396721336","commenter_b":"What a concept...build a wall! Did they get the idea from President Bill Clinton?","commenter_a":"All borders need to be secured.","post_message":"In what could be a \"told you so\" moment for Donald J. Trump, the U.K. announced plans to build a \"big new wall\" at a border port in France to prevent migrants in nearby camps from sneaking aboard vehicles heading to Britain."},{"comment_id":"10153071085836051","commenter_b":"Kill that bitch!!!!","commenter_a":"Hell hath no fury, right? Sick, sick, sick.","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"635519663305279","commenter_b":"And cut her off. And see her vagina shut","commenter_a":"Deport her and her whole family","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"10154307546211509","commenter_b":"Joking? Missing a punch line...","commenter_a":"Fox News: Thug tries to jump on three girls, and bullets stopped him. Bill O'reily: What was he trying to do to those three girls before the bullets? We're just asking questions.","post_message":"15-year-old Zaveon Dobson was shot and killed after he jumped in to shield three girls from gunfire. @webpagelink"},{"comment_id":"824242924358757","commenter_b":"You must be an ugly Bastard","commenter_a":"No money no love:)","post_message":"Only A Weak Man Would Make A Woman Love Him And Refuse To Love Her Back"},{"comment_id":"1397496900343360","commenter_b":"\"I support the racist abortion of millions of black and latino children\", that all I see when I see anyone saying the support Planned Parenthood. Sounds like something close to what Hitler did... eugenics, anyone? Margret Sanger? Big fan of Hitler? Come on, it can't be a coincidence that blacks are encouraged by white PP employees to abort their babies, right? #StopRacistPP #ShutItDown #UGetMoreBensWitKids","commenter_a":"Or took their VIAGRA away. Bet we'd get some action then.","post_message":""}]
