[{"comment_id":"1306972999355460","commenter_b":"If they come after our guns we are so screwed...This is something we better not let them do...If ever we need to fight it will be when they do come for our guns....Wake up american's...That Muslim snake in the white house is out to get us and it looks like he will stop at nothing to destroy us and our country...","commenter_a":"Yes it will!","post_message":"“An armed citizen is nothing for me to worry about”"},{"comment_id":"10154133539156509","commenter_b":"She is high on drugs of stupidity!","commenter_a":"Lol..","post_message":"The Donald J. Trump superfan, 'I saw Mr. Trump only in my dreams' @webpagelink"},{"comment_id":"1194513290647275","commenter_b":"Yep and a drunk driver that got behind of the wheel of a car but didn't hurt anyone should not be taken away from their family and put in jail when they were caught????","commenter_a":"She's a threat to no one. They just took a mother from he children who were born in this country!! We are the one's who are threatening the lives of people who trusted us and came here to make their lives better, just like Trumps mother did. Just think, if they had sent her back we wouldn't be dealing with this heartless man! What a blessing that would be. He's done more damage in less than 3 weeks than Nixon did in about 6 years and he wasn't this bad!!","post_message":"Immigration agents “said she’s a threat, but my wife isn’t a threat,” her husband said in an interview."},{"comment_id":"1113331872041003","commenter_b":"Lauren my family worked hard & works hard to pay taxes not to give it away to terrorists & fake MTFs who pretend to be refugees & plus why don't they fuckin claim asylum first point of call instead of wanting to come to UK ! It's not cuz of getting money & free housing is it ? This island is full & like I say open your house to a family than . No ? Thought so another one all talk no action","commenter_a":"Go back & live your life in your home as there's nothing here for you & Europe does not want you . Your president as a lot to answer for.","post_message":"Refugees are forced to travel light, and they have to carry everything they'll need for their journey inside a small backpack. What's inside? AJ+ takes a look."},{"comment_id":"1728040457449467","commenter_b":"She is bad to the bone","commenter_a":"She is bad to he bonem","post_message":"“Here’s Hillary Clinton campaigning in favor of women, while the foundation that she and Bill own pays men 38% more than women.”  Newt Gingrich shared some shocking statistics with Sean Hannity regarding the Clinton Foundation."},{"comment_id":"10152807177319753","commenter_b":"There's a lot that factors into our timely death. We can decide to die early. I.e. Suicide. And we can die cus of our own stupidity... Jumping off a building without a parachute. It can be because of health problems. But even with all these possibilities God is the one who truly decides when we go. That's why we have so many stories that are miracle stories. Ppl surviving when they shouldn't. And sometimes unfortunately we are taken so soon. The reason being that we are all here to serve a purpose on this world for God. And when we have done such... Then God brings us home. If you read her nieces comment she lived a fulfilling life. And what ever the reason may be she completed her life. Losing a loved one is hard. I have lost a dad, and seven friends and my own kid being 23. ...","commenter_a":"GOD MAKES NO MISTAKES. SHE DIED 7 DAYS LATER. THE NUMBER 7 MEANS COMPLETION. HER LIFE WAS FULFILLED. GOD MADE THIS DECISION. I SYMPATHIZE WITH THE FAMILY, HOWEVER GOD WILL MAKE SURE THOSE CHILDREN ARE LOVED THROUGH FAMILY AND ALL THAT LOVE HER. HER LEGACY CONTINUES THROUGH HER SONS.","post_message":"After 20 years of being unable to conceive naturally, the mother had spent a decade going through various fertility treatments in hopes of having children. After 30 long years, Lisa’s dream came true and she found out she was not only pregnant, but pregnant with twins. Unfortunately, the joy was short-lived, as she passed away just seven days after her babies’ births."},{"comment_id":"619582968232282","commenter_b":"She has to go","commenter_a":"Yea","post_message":"Michelle was just caught red handed and is about to be charged with treason.  Good. It's about time she was exposed.  Do you agree Michelle Obama does not belong in the White House?"}]
