[{"comment_id":"10154123509664138","commenter_b":"@username is awesome","commenter_a":"Thank You Fox , great pictures.","post_message":"Our favorite photos of Minneapolis aglow in purple for Prince."},{"comment_id":"571634943014885","commenter_b":"Ya 10 ft wall and make mexico pay for it that wall will never be build","commenter_a":"@username to fucking childish.","post_message":"After vowing to take the high road during his presidential campaign, Marco Rubio changes his stance on making personal attacks against Donald J. Trump. ►Watch last night's full episode: @webpagelink"},{"comment_id":"10153700802697235","commenter_b":"Untrue. Unfair. The DC snipers were/are referred to as mentally ill, not as \"thugs.\" I can't think of another black mass shooter offhand. Most U.S. mass shootings are either non-blacks with histories of mental illness, or gang/drug related shootings committed by blacks.","commenter_a":"It's because he was white. That's why now it's about mental illness next week a black kid will be a thug or a menace to society","post_message":"This is a big lie we're always told so that we can avoid talking about the obvious -- GUNS."},{"comment_id":"10154429240061955","commenter_b":"@username Excellent! Praying everyone in our country reads this!!! Please!!!","commenter_a":"I simply cannot understand how BLIND and Ignorant one can be to support Hillary... She is a Career Criminal with blood on her hands! How can people NOT see this? Just do some BASIC research on her. You will be shocked at the amount of evidence against her!","post_message":"'Fact-checking' becomes opinion journalism..."},{"comment_id":"1104084689647932","commenter_b":"Proabably referring to the 2 black dudes answering the question. If they were rappers they would have bitches and Bentleys haha. These are just 2 really baked or really stupid men. That's it nothing more.","commenter_a":"This how stupid these rapper are today, but if you ask him how much for half of kush he would quote you to the penny. Wow","post_message":"Is That Your Final Answer?"},{"comment_id":"936977403012167","commenter_b":"If they are illegal, how can they vote ?? Just askin'","commenter_a":"Hell no","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"},{"comment_id":"1034345616576908","commenter_b":"Please. Many women CANNOT use those. I never could. Not everyone is the same dear.","commenter_a":"Ladies....Honestly. Get a menstrual cup. You will hate yourself for not doing it sooner.","post_message":"This should not be a thing"}]
