[{"comment_id":"525857150938198","commenter_b":"She is the female anti-Christ.","commenter_a":"Oh but there are plenty of sheep out there that think this idiot is wonderful how stupid can people be???","post_message":"Hillary Clinton's sex slave just exposed her for doing THIS. What a disgrace. She will never be president. Can we get 20,000 'LIKES' to make sure Hillary never becomes president?"},{"comment_id":"10154099091458984","commenter_b":"He is another politician and a big lier as well he cheated in the other debate with Ben Carson he will say anything to get a vote and he will owe a million favors for all the lobbyist sending him,all this money","commenter_a":"Why are people at war all the time with a Democrat or a republican let's change this to U.S. political leaders and vote for a person not a party. They always have to make people take sides and it needs to be changed.","post_message":"With the South Carolina primary right around the corner, Ted Cruz is doing his best to diminish Donald Trump's lead. Cruz's latest attack is getting a lot of attention, and it may cause some voters to ditch 'The Donald.' Is Ted Cruz right about Donald Trump?"},{"comment_id":"10153847287078984","commenter_b":"She's a lying bitch","commenter_a":"Yes I Support Grey I agree He is doing what is expected of any Lawyer expected I","post_message":"BOOM! 'Bulldog' Gowdy just welcomed Hillary to the Benghazi Select Committee hearing in a way that probably had her wanting to run and hide. He had his chance to address her right to her face, and he did NOT hold back. Do you support Trey Gowdy's fight to unveil the truth about Benghazi?"},{"comment_id":"10154189776881130","commenter_b":"I'm ready, bitch.","commenter_a":"Not reading the article--no time for it. But to pass along, a commentator on CNN today said that the Clintons operate from a stance of self - righteousness, thus they cant see what they're doing is oh so wrong. Hit it on the head! Two major party candidates, to major flawed choices!","post_message":"If Hillary Clinton wins in November, brace yourselves."},{"comment_id":"10152768405859032","commenter_b":"Good!! She should appreciate the fact that she got hired & HAD a job!! What a dumb ass!!","commenter_a":"@username talk about #keepingitghetto hahaha!","post_message":"The boss didn't appreciate all those thumbs-down emojis."},{"comment_id":"368323690022592","commenter_b":"Who is this woman","commenter_a":"She is political posturing... Wants to be first Female President. (Well first elected. Hillery was first. Michelle ib second Unelected)","post_message":"Good God, Mr. President, we were once known as the leader of the free world, standing for what is right! You must not let America’s sacrifices be in vain. When will you learn that actions speak louder than your words?”"},{"comment_id":"1609547186014156","commenter_b":"#BELIEVELAND","commenter_a":"Believeland! Cleveland! Go Cavs!","post_message":"A BIG day for your Cleveland Cavaliers ! They were honored at the White House:"}]
