[{"comment_id":"891611624218799","commenter_b":"That attitude is what spoiled immoral girls, who got caught up in this SEXUAL REVOLUTION\" and forgetting that sex is for married people, and it also leads to pregnancy. They figure,,so what,,if I get pregnant,,I'll just kill my own baby,,,no problem,,,BUT I bet when these young women,,grow older, and marry and THEN do have a child,,,they have guilt like they never knew before.","commenter_a":"Close your legs, ya skank.","post_message":"Um, what? Killing a baby doesn't \"end a pregnancy,\" it just makes someone the mother of a dead baby."},{"comment_id":"10155960556545500","commenter_b":"They need protection from poachers! You are really dumb for supporting this.","commenter_a":"Shut down. Place animals in a REAL SANCTUARY.","post_message":"ABUSE ACCUSATIONS against the 'Wild things' - @webpagelink"},{"comment_id":"1786545848249097","commenter_b":"@username What's that? No one has been able to get him to say what that is. Oh I forgot, he's going to build a wall.","commenter_a":"Agree Obama put us in a real position with his foreign policy. Now all the people saying Hillary should be our next president she is just as bad or worst then Obama. We need Trump to get in office and try to clean up there messes !!!","post_message":"House Speaker Paul Ryan says \"Our enemies no longer fear us and too many of our allies no longer trust us,\" all because of President Obama's foreign policy. Do you agree or disagree?"},{"comment_id":"10154047129019749","commenter_b":"then they wanna face Russians? :D :P","commenter_a":"Victoria","post_message":"Graduates from Norway's Royal Naval School in Stavanger have shown the Internet they can do more than just march in formation."},{"comment_id":"10150690692729999","commenter_b":"Maybe this can cut back on oil use?","commenter_a":"They should never have entertained the idea of the pipeline in the first place. Sending that dirty oil through our country was a really bad idea.","post_message":"Barack Obama has rejected the request to build the Keystone XL pipeline, saying it \"would not make a meaningful longterm contribution to our economy.\""},{"comment_id":"758333967690514","commenter_b":"Pure, unadulterated ignorance. Lots of it going around. That guard shut them down","commenter_a":"Some people have no respect. So sad.","post_message":"These two men laughed at a military memorial. This guard shut them up without hesitation. Do you hate disrespectful people like that?"},{"comment_id":"10153580091211601","commenter_b":"This Bit*h has a special place reserved for her in hell.","commenter_a":"HELL IS WAITING FOR HER","post_message":"In a Washington Post feature on Planned Parenthood, Cecile Richards, President of the nation’s largest abortion chain, says every abortion restriction in this nation must be challenged and removed."}]
