[{"comment_id":"902087636648479","commenter_b":"She needs to pack it up and leave!","commenter_a":"Please take her off Facebook I cannot stand looking at her","post_message":"Whoopi Goldberg has done it time and time again. She really needs to learn her place. Do you think she's gone too far?"},{"comment_id":"10153535338020779","commenter_b":"@username Britney is better","commenter_a":"For anybody who has been to shows like Springsteen , Pearl Jam, Metallica, Pink Floyd, it's mind numbing watching Popular music in 2016.","post_message":"Britney Spears opened the #BBMAs with a career-spanning medley of her hits. Watch below."},{"comment_id":"933155700053185","commenter_b":"go Hillary....... TO PRISON!","commenter_a":"I hope Hillary will serve her Prison Time as Gracefully as Martha Stewart did! She might even make some new girlfriends!","post_message":"THIS is who liberals want?"},{"comment_id":"10152828817287426","commenter_b":"Omgosh..I am not a violent person..BUT I would beat the Sh** out of that woman....first of all...I NEVER gave into my kids when they threw fits...that's how they learn to NOT get what they want all the time.....This woman is sick sick sick....part of parenting means to not give in..","commenter_a":"@username U seen this uet","post_message":"“There’s nothing wrong with that child, it just needs to be beat,” the woman, who claims to be Kathleen Smith, said in the video."},{"comment_id":"960803304010619","commenter_b":"That is where it starts. Where does it end?","commenter_a":"For Gods sake, no one is trying to unlock your average Americans phone. They want to unlock the California couple, Christmas party killer terrorists, phone. And for good reason. To find other connections.","post_message":"JUST IN: Donald J. Trump is calling for a boycott of Apple until the company agrees to the government’s demands and unlocks the phone used by one of the San Bernardino terrorists. What do you think?"},{"comment_id":"10153287530191336","commenter_b":"A woman who got it 100% correct.","commenter_a":"As women, we have ruined it for ourselves. We can't act like men and then expect a men to act chivalrous towards us. Be a lady, and you might be pleasantly surprised.","post_message":"Is chivalry dead?"},{"comment_id":"10154437348239087","commenter_b":"Crooked swamp dwellers. Lock them up!","commenter_a":"Let's run a government with a weakened opposition and lack of independent oversight. What could possibly go wrong?","post_message":"BREAKING: Republican lawmakers have decided not to strip the Office of Congressional Ethics of its independence following massive public backlash."}]
