[{"comment_id":"10153425885744255","commenter_b":"Look, bozo, I suggested 68. It's 66 now. That's two years, not nine. That's my answer. Thanks for the cute little story, though.","commenter_a":"Social security was developed when people rarely lived to be 65. It's stupid to keep it at 65 in this day and age. Bernie is a fool.","post_message":"Damn straight. By Daily Kos user Tool"},{"comment_id":"10154565207543812","commenter_b":"A gun can not cause violence. It's harmless. I have several. They have never shot anyone. They have never caused violence against me or anyone. Get it??","commenter_a":"He lost his brother, son and partner to VIOLENCE by someone using a gun. Could have been a knife, a baseball bat or even a suicide vest. Lay any of these items on a table and they do nothing. Let me know what I'm missing here","post_message":"#Dallas Police Chief David Brown Sr., a 30-year veteran and Dallas native, lost his former police partner, his younger brother and his own son to gun violence."},{"comment_id":"10153085748364312","commenter_b":"So it's appropriate for the race card to be thrown here?? Wow","commenter_a":"I bet they don't get gunned down! BC \"white lives matter\"","post_message":"Two teenagers from Kentucky who vanished nearly two weeks ago are suspected in a multi-state crime spree."},{"comment_id":"587659781407559","commenter_b":"I bet those predestinarians didn't know anything about her past !","commenter_a":"Please just drop out Hillary! Give Bernie a shot!","post_message":"A special moment with a (new!) supporter and his mother in Henniker, New Hampshire."},{"comment_id":"1735755160025201","commenter_b":"Hopefully I can get there before someone builds a wall around our entire country!","commenter_a":"I feel so sorry for you Americans!! Come in up to Canada we can have a beer and chat about your presidential candidates lol","post_message":"Donald J. Trump accuses President Obama of being 'the founder of ISIS'... then calls Hillary Clinton the 'co-founder.' @webpagelink"},{"comment_id":"10154691100574369","commenter_b":"Stfu","commenter_a":"Stop showing the younger smiling picture of this kid. Get a current picture...and then imagine it behind a gun. I guarantee this kid didn't look so innocent that night.","post_message":""},{"comment_id":"10153177506924087","commenter_b":"Lmao! My uterus says otherwise but that's fine - enjoy your misogyny!","commenter_a":"Rand Paul is a fool. Trump 2016!","post_message":"\"I don't think you want a nominee that offends whole areas of the public, whole ethnic groups,” Rand Paul said. \"If you paint with a broad brush and you want to say, ‘well, most Hispanics are drug dealers and they’re rapists and murderers,’ well, that’s crazy talk, and that offends a whole segment of our population. I think most people who immigrated to this country are assets to our community and came here seeking the American dream, the same way my ancestors did.\""}]
