[{"comment_id":"962385683823549","commenter_b":"Why in the hell did he stand there and listen to that s*** slam the door in that w**** face after about three words out of her mouth","commenter_a":"Racist","post_message":"HATE YOU WHITE MOTHER F-CKERS': Thug Chick Goes Nuts On White Neighbor (VIDEO)  @webpagelink"},{"comment_id":"10153713644828984","commenter_b":"Yes build it. And people American people will have a job and steel prices go up. And we win!!!!!","commenter_a":"Build the wall. Put censors all along the border and give the border patrols the order to shoot any one who gets over or under the wall. Illegals will stop coming.","post_message":"Boom! Critics of Trump's border wall just got silenced in an EPIC way by The Donald himself. There's no way they can argue this one!  Do you agree with what Donald Trump just said about a border wall?"},{"comment_id":"10154280185019032","commenter_b":"Why are there exceptions made to people who are in the US ILLEGALLY? No other country changes their laws to fit the demands of illegals!","commenter_a":"From a friend.... Friends, I desperately implore you to please please educate yourself on DACA, one of President Obama's Executive Orders which our President-Elect Donald Trump is threatening to revoke. DACA is intended to be a temporary solution because our gridlocked, partisan Congress refused to pass the Dream Act, for which there has been wide bipartisan support. DACA allows undocumented young people whose parents brought them to the US as children to have just a few temporary rights. If these kids meet several requirements and pay about $500 initially and when they renew (after two years), they can defer deportation and be allowed to work legally. DACA is especially important because it allows these young people to legally work and to pay taxes. In my experience, most of these young people quickly find work and use their money to pay for college tuition, to buy school supplies for their younger ...","post_message":"President Obama created DACA as an executive action in 2012. President-elect Donald Trump has said he will 'immediately terminate' it."},{"comment_id":"1279396932093344","commenter_b":"This is why I hate narcan","commenter_a":"Horrible heroin.","post_message":"'This child can't speak for himself but we are hopeful his story can convince another user to think twice about injecting this poison while having a child in their custody.'"},{"comment_id":"1867778023454493","commenter_b":"Yeah, all those vacations, all of that golf. It must have been a real bitch.","commenter_a":"Yes We Can dear President Obama and Yes We Will. Thank you for your service and your hard work for this country, against the constant and relentless Republican opposition, dissent, disrespect, hatred and racism.","post_message":"'I'm asking you to believe... YES WE CAN!'  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1214762191878123","commenter_b":"🙈🙈🙈🙈","commenter_a":"Beynimde... 😱😱😱 @username","post_message":"This was living in her brain."},{"comment_id":"10155498405191729","commenter_b":"That's where he belongs. Back stabbing ungrateful dodo.","commenter_a":"Eeek. What ticket would he be on? Dem?","post_message":"Interesting..."}]
