[{"comment_id":"1061054770617718","commenter_b":"I'm voting for you Hillary!!!","commenter_a":"That will be hard to do from Leavenworth. But if she thinks she can go for it. Bill will be too busy I am afraid to help though.","post_message":"“It’s clear she knows how to get things accomplished in these crazy political times. She’s still standing after decades of Republican attacks, and she’ll force them to the table once in office.” -Iowa Starting Line"},{"comment_id":"10153471802056336","commenter_b":"It's a woman's choice regardless Patricia","commenter_a":"And is a distortion of the truth. No body parts were offered for sale. This is a complete propaganda that Ted Cruz is too stupid to know to avoid. Dumb canuck.","post_message":"\"These tapings of Planned Parenthood selling body parts are grotesque. It highlights the evil of what they're doing.\" – Sen. Ted Cruz"},{"comment_id":"1877847435771618","commenter_b":"Hopefully she'll keel over and die.","commenter_a":"not so easy to back track in our modern age of electronics","post_message":"FRAIL LOOKING HILLARY HITS TRUMP FOR CALLING NYC ATTACK 'BOMBINGS' -- AFTER DOING THE SAME..."},{"comment_id":"1122225431128139","commenter_b":"@username, but I'm sure you was just fine with the Buch admin. Why is it Republicans always try to impeach every Dem president, I gurantee if Hillary wins they will spend her whole time as president trying to impeach her. Why don't they try doing something for the citizens of this country.","commenter_a":"As I read people's comments, I am again dismayed at the length to which the left will go to deny the FACTS.. the info came form a FOIA request. these arent conspiracy documents....they are FACTS... I know..the left loves to discount facts...they can be pesky......","post_message":""},{"comment_id":"725790477519561","commenter_b":"Ernest, I agree with 100%. If they were doing their job we shouldn't have so many illegals in this country.","commenter_a":"With all the illegals coming in. I thought they were already shut down!","post_message":"Would you be worried if Homeland Security shutdown?"},{"comment_id":"464432047077736","commenter_b":"Bye, Felicia....go to that other planet where NOTHING will be different. ...the More of you we get rid of here, the sooner We can straighten the SHIT YOU CAUSED out","commenter_a":"Secondhand rocket for hire. Use at own risk.","post_message":"Elon Musk called the rocket landing \"absolutely perfect.\""},{"comment_id":"1103608743035479","commenter_b":"Just going off the man's statement. And yes some of my statement is assumption because of some of the stuff he has said.","commenter_a":"You do know like every neighborhood in America Muslim community are already patrolled. They patrolled by cops. An if did know this after 9/11 the FBI and NAS already monitor communication it those communities than to the Patriot Act. So what Ted Cruz is talk is already being done. What Ted Cruz really wants to do like communist leaders would do in term of monitor arrest you and in prison you with any form of guilt. He want to doing like Castro. It's funny Ted Cruz father escaped Cuba to get away from communism. No Ted Cruz is advocating the same communist view his father escaped from. If you look at his policies Ted Cruz is nothing more than a communist pretending to be a Republican.","post_message":"Ted Cruz was blasted this week for saying Muslim neighborhoods should face extra patrolling to prevent extremism. Here's why Cruz says those critics are wrong. Do you support or oppose Cruz's plan?"}]
