[{"comment_id":"10153766225688132","commenter_b":"the laws about women showing constant pictures of themselves naked have to change, really sick of seeing all her plastic body parts.","commenter_a":"Please change yourself first phony woman","post_message":"\"These gun safety laws have to change!\" - Kim Kardashian"},{"comment_id":"10153573907066509","commenter_b":"She couldn't bring women down, only herself!","commenter_a":"I don't want to swear.... but.....way to go bringing the equality movement down a peg! !!! You really didn't think that one all the way thru!!!! :(","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"},{"comment_id":"10153438263919087","commenter_b":"Lol what a pussy","commenter_a":"I a Democrat and everyone is making a big deal out of this. Give them their snacks and they will leave.","post_message":"Congresswoman Donna F. Edwards slammed the media for condemning activists protesting the deaths of unarmed black men at the hands of white police officers as “thugs, criminals and drug users” while \"a group of armed men illegally occupying a federal building have been referred to as an ‘armed militia,’ or simply ‘occupiers,’ as though that behavior is acceptable in a nation of laws.\""},{"comment_id":"580176688837290","commenter_b":"Invite a Muslim man into your home and let him do what he would do in his home country. Do you have any idea what he would do to your mother? How about sister, assuming you have one? Go on, have fun. And don't you dare do any harm or call the cops because he would be following the Quran.","commenter_a":"Those who think this is funny, should be ashamed of yourselves. How would you feel if that happened to you. In America we treat each other equally (treating others the way we want to be treated. Think about that) no matter what religion we have.","post_message":"INSTANT JUSTICE..."},{"comment_id":"537038436486736","commenter_b":"PUKEBAG, Tax-evading, racist POS!","commenter_a":"What A Joke HE IS DEFINATELY TALKING OUT HIS ASS NOW","post_message":"Dr. Alveda slams Al Sharpton for comparing himself to MLK on live TV.  Al Sharpton and MLK should never be used in the same sentence.  Do your agree Al Sharpton is a criminal?"},{"comment_id":"1360485817324205","commenter_b":"She is so stuck on herself. She thinks she's some sex goddess that's all she talks about. Blaaaaa get her gone I say!!!","commenter_a":"Dennis, please read the below with your comments","post_message":"SEAN STRIKES BACK AT MEGYN.  Good.  Now she's at odds with Hannity & O'Reilly.  See what Hannity wrote to her:  @webpagelink"},{"comment_id":"10153240747000326","commenter_b":"anything to keep a woman from being elected President!","commenter_a":"#feelthebern !!","post_message":""}]
