[{"comment_id":"895006600536681","commenter_b":"You gotta wonder where all these 'virgins' are supposed to come from... What a bunch of head-banging fools.","commenter_a":"They might be running out of virgins soon... The LEO that sent them packing, Thank you","post_message":"Officer who was shot by two gunmen outside free speech event in Texas has reportedly been released from the hospital.   The two gunmen are dead."},{"comment_id":"1080901341949487","commenter_b":"She let them die","commenter_a":"Donald Trump for President 2016! Make America great again and will work for FREE!","post_message":" Obama administration and Clinton officials hid this compelling Benghazi email for years, said Judicial Watch President Tom Fitton.   The email makes readily apparent that the military was prepared to launch immediate assistance. The fact that the Obama administration withheld this email for so long only worsens the scandal of Benghazi. Please SHARE!"},{"comment_id":"10154738183646336","commenter_b":"But who's the hideous woman in the video?","commenter_a":"Well... he's certainly on the right show","post_message":"\"I understand why you're angry. You have every right to be angry – the system has failed you. But he is not the solution.\"  Filmmaker Michael Moore has a message for Donald J. Trump supporters who feel let down by the government. @webpagelink"},{"comment_id":"546785352178711","commenter_b":"Hey Cliff f u bitch.","commenter_a":"Hey @username go f yourself.","post_message":"Hillary Clinton wants the Fox News host's head, but she's not backing down.  She is in trouble. Let's show her our support.  Can we get 10,000 'LIKES' for this Fox News Host's stand against Hillary?"},{"comment_id":"10153420149016350","commenter_b":"Awesome!!!!!!! Congrats to the graduates!","commenter_a":"This is Awesome!!","post_message":"The seniors only took two days to learn the performance!"},{"comment_id":"1662896673932550","commenter_b":"Her mom's argument is invalid, he's black, cops would have shot him anyway and by the time they got their clerk would be dead too, good job armed guy! (Y)","commenter_a":"Boo hoo my thug piece of shit waste of air got shot. She wanted him in jail so she didn't have to feed his useless ass.","post_message":"Normally, I would be on the side of the shooter in most cases, but this...?...  @webpagelink"},{"comment_id":"1118814734807982","commenter_b":"174742062548592helle Tenney let it first be understood I can care less for evil feminist. My point is why go to a frat house that is known for Alcohol drugs and loose women having sex up stairs, when you know inappropriate things always happen in places like that. Secondly, I'm sure she was there drinking in an unsafe environment but I don't condone anyone being raped but we should ask ourselves why the Hell do women keep going to places that are historically unsafe for women? Lastly, women lie so much about rape and other things that no one knows when they are telling the truth. There has been several times when men have been falsely accused of rape and we found out later that she was just trying to cover up the fact that she decided to sleep with the whole football team at once. I see the police reports ...","commenter_a":"Ok but why was she even there in the first place?!!!!!! Why do girls go into Frat houses?!!!!","post_message":"Sexual assault on US college campuses is a major problem  and we can't ignore it any longer. In an exclusive interview, US Vice President Joe Biden outlines how he's leading the charge to change the way we fight this epidemic  by going straight to the source.  Get the full experience at mic.com/enough"}]
