[{"comment_id":"10153593940166336","commenter_b":"Every woman scares Jorge.","commenter_a":"He did NOT pay kids for sex. He raped children!! Get it right!!!","post_message":"Fogle offered to pay adult prostitutes a finder's fee if they could connect him with minors for sex acts, including some as young as 14 or 15 years old, authorities said."},{"comment_id":"10156197191420354","commenter_b":"A CULT that needs to be extinguished!","commenter_a":"Islam is NOT a religion of peace!!!!!","post_message":"The full statement is SCORCHING..."},{"comment_id":"10154369959116509","commenter_b":"Trump will eat her alive!","commenter_a":"So ... u think u luv Hilary Clinton .... u like Hillary Clinton .. u want to vote for Hillary Clinton ... u r impressed how the liberal media only shows u her smiles ... well.... here is some of her smiles ... enjoy ... @webpagelink","post_message":"Former Rep. Gabby Giffords and her husband Mark Kelly endorse Hillary Clinton on Sunday, she is the only \"candidate for president that has the determination and toughness to stand up to the corporate gun lobby -- and the record to prove it.\""},{"comment_id":"10153855259970329","commenter_b":"So the same saying goes if a female swimmer ... participated with the same enthusiasm. .. in a common wealth games ... yeah menstural blood after all ain't unhygienic. .. its holy","commenter_a":"It's not about it being shameful, it's about it being a private thing. Like going to the bathroom is a private thing.","post_message":"“We’re the ones having a period and we’re the ones having to pretend it doesn’t exist.\""},{"comment_id":"10152998620161770","commenter_b":"She is a liar and cheat .","commenter_a":"That's because thousands of us protested on how the media thinks they can determine who they want on stage and trying to push there own agenda.. This was the absolute right decision on CNN behalf.. Remember CNN, ABC, fox, and the rest of the media scum that keeps trying make decisions on who can and can't be in any presidential debate.. All candidates should be allowed on stage..","post_message":"Carly Fiorina will join the other GOP candidates on CNN's debate stage."},{"comment_id":"10153672821839270","commenter_b":"Illegal aliens, syrian refugees, and every other worthless non-american can get all the free stuff at no cost. WE veterans have to pay for what we earned. There is a revolution coming. WE THE PEOPLE have had enough.","commenter_a":"Lier lier lied,,,, sign here and have free health care for life. I'm so glad I have full VA benefits.","post_message":"Some big changes."},{"comment_id":"1820380214887532","commenter_b":"I will bet you $10.00 to a donut she is a liberal.","commenter_a":"This is insanity, this principle needs to be removed.","post_message":"Angry yet??"}]
