[{"comment_id":"806051249493483","commenter_b":"Republicans....","commenter_a":"What flipping IDIOT would vote for this nut","post_message":"He leads his closest competitor by 11 percentage points."},{"comment_id":"10154526553127550","commenter_b":"@username SORE LOSER","commenter_a":"All of you supposed adults in here crying are ridiculous, Republicans lived through eight years of Obama, you can survive four to eight years of Trump. Grow up.","post_message":"North Carolina has officially cast its electoral college votes for Donald Trump."},{"comment_id":"1371582852881168","commenter_b":"She's definitely a weird bitch !","commenter_a":"Stein you lost by zillions go home and get a job","post_message":"JILL is just fishing for money is all...?  @webpagelink"},{"comment_id":"1099626483393732","commenter_b":"RINO revolt began with Romney. We shall soon see a series of similar dogs.","commenter_a":"Ventura is a jackass!","post_message":"Someone other than Michael Bloomberg is considering a run for president.  Could this controversial figure make an impact on the 2016 race?"},{"comment_id":"941978015839539","commenter_b":"I do like a chick with a beard...","commenter_a":"Hi I am Jessica. I am 17 years old. Inbox me and I'll compromise your account passwords and/or bank account.","post_message":"Penned on sheep skin, this document will have a major impact on the way we view Islam."},{"comment_id":"10154377596014411","commenter_b":"Does anyone realize what is happening? History is repeating itself and no one is taking notice. The Middle East is on fire. Obama and Hillary started this with Libya, they had no business getting involved. Now we have a flood of Muslims who hate American and our culture. They do not want to be equal, they want to dominate and change America and the West to a Muslim country. This is a fact, Turkish President is building mosques all over the West and no one is paying attention. In Turkey they are burning down churches, killing and raping Christians. It's a genocide but Obama only brings in Muslims no Christians. Americans are being told, to take down crosses, take pork from American public schools, allow Muslims to have pray time in public schools, Our children are learning Islam is the faith to be. WAKE UP PEOPLE. They are moving in ...","commenter_a":"I dont think people are comprehending how much people are actually crossing over in europe. its not like in north america. Canada for example scrapes the cream of the crop at 10,000 vs half a million in germany alone. So its full of feel good stories. Whats left stays in europe and the people keep coming and summer has just started. We're talking about a city moving into the EU completely needing of support. At the rate of growth. They'll have a small country entering the EU (mostly unscreened). Europes economy is already weak. Germany has a strong economy, but they're carrying the bulk of the weight. Swedens already cracking under the weight of just one year. Not to mention the culture shock of a sudden mix of two completely different cultures. Hes not saying turn them away. Obviously care for them. But you cant have this number of them ...","post_message":"Dali Lama to Germany: You're doing it wrong"},{"comment_id":"10153823780186051","commenter_b":"No. In fact, I wouldn't piss in her mouth if her teeth were on fire.","commenter_a":"Vote Blue no matter who!","post_message":"Simple question: Will you be voting for Hillary Clinton this November?"}]
