[{"comment_id":"602469266610319","commenter_b":"Your 15 mins of fame is running out!","commenter_a":"She needs help, yes.","post_message":"Sarah Palin was just hit with a massive curve ball, she needs your help.  This is horrible, we love her. Let's show her we have her back.  Can we get 10,000 'LIKES' for Sarah Palin?"},{"comment_id":"685062714983869","commenter_b":"So...when will they let Ted Nugent or Trey Gowdy be a moderator?","commenter_a":"Why Matt Lyer? What a CREEP!","post_message":"CLINTON, TRUMP SQUARE OFF"},{"comment_id":"10157549372250725","commenter_b":"Suck it up buttercup. Should've been a little more gracious and not acted like a douchewagon! Then u go on TV and act all sorry and 'accept full responsibility' , then still weasel and lie around the truth about what totally happened and cop-out of some questions with the 'i was really drunk and don't quite remember' garbage excuse! Pull up your Speedo and get over it! The media and Olympic committee are the only ones who really care about your little hissy fit , the most of us could really give a crap! You won a gold medal and now your sad because your entitlements are going bye bye! Well, if you were more grateful and less of an egotistical stroke then maybe you wouldn't be in this situation! Lessons learned and move on! Accomplishing something as difficult as you have, you would think you can find the gumption ...","commenter_a":"How old is he???","post_message":"The Olympian swimmer, who has now lost all of his sponsorships following the Rio robbery scandal, is 'not doing well.'"},{"comment_id":"699361250167548","commenter_b":"Terrorist and traitor!!! And an illegal!!","commenter_a":"The Wall of China has worked tremendously for China. Id expect the same results here","post_message":"“Good luck with that…We’ve got serious problems here.”  President Barack Obama addressed Donald J. Trump's plans to build a wall and get Mexico to pay for it."},{"comment_id":"1389869284386873","commenter_b":"Nothing, absolutely nothing. Vote them all out, they deserve to be jobless.","commenter_a":"They took a lot of time off, which means they weren't doing even more stupid hurtful stuff.","post_message":"We'll wait.  Like Addicting Info for more great content!"},{"comment_id":"1000192243373586","commenter_b":"The little bitch should serve time.","commenter_a":"It's not white privilege. It's called 'daddy is connected'. Still doesn't make it right","post_message":"This girl had so many drugs that her sentence should be more than 200 years -- read on to find out what she's going to actually get."},{"comment_id":"1213918441976908","commenter_b":"She should step down, even if she did win, God forbid , she won't make the first half year..","commenter_a":"Ken put the straw down","post_message":"She's dying!"}]
