[{"comment_id":"254814161629338","commenter_b":"She is a big mouth stupid bitch . They all are","commenter_a":"Can't watch this show anymore...it's all about political bashing.","post_message":"The View host Joy Behar just launched an attack on Barron Trump. This is terrible. She should be absolutely ashamed. Can we get 10,000 'LIKES' to have The View cancelled!"},{"comment_id":"10152634515646813","commenter_b":"Mind your own damn uterus, mkay?","commenter_a":"ACLU's \"rape culture\" worship, Rape of the child in the womb with instrumentation. rape to death..","post_message":"VICTORY! Federal judge strikes down law that could have closed #Wisconsin abortion clinics, calling the law “a solution in search of a problem (unless that problem is access to abortion itself).\" @webpagelink"},{"comment_id":"10153374833224497","commenter_b":"I miss that trashy bitch.","commenter_a":"whatever happened to amber richardson?","post_message":"\"I had some great drugs in my day, but seeing my baby for the first time? I wouldn trade that for all the ecstasy in the world.\""},{"comment_id":"10155333457725354","commenter_b":"Besides all this...Clinton looks like she needs a facelift! She definitely has not aged well. With all the worries she's had I can see why she looks like this...","commenter_a":"No integrity","post_message":"MELTDOWN: Hillary's Disastrous Press Conference..."},{"comment_id":"10153819870891037","commenter_b":"Build a big hole and build a fence around it. Yeah that outta do it","commenter_a":"A Swatch.","post_message":"“You look at this migration, I said to my wife the other day: ‘You know, they seem like so many men,’” said Donald J. Trump."},{"comment_id":"10154550088456633","commenter_b":"I don't know HOW she got pregnant, she is such a tease!","commenter_a":"Oliver is pacing more this morning!","post_message":"Will today be the day? When will New York's April the giraffe give birth? More info >> @webpagelink Stream via Animal Adventure Park in New York."},{"comment_id":"10153457449933128","commenter_b":"All is Nestle fault. They should be ban from around the world.","commenter_a":"India is member of BRICS (Brazil, Russia, India, China, South africa) and pro RUSSIA. does it make sense?","post_message":"The FDA issued more warnings about snacks imported from India than any other country this year. One import was blocked because it “appears to consist in whole or in part of a filthy, putrid, or decomposed substance or be otherwise unfit for food.”"}]
