[{"comment_id":"10153605570044205","commenter_b":"I held the door for a woman once and she said \" What you think I can't open my own door?\" Aaaaaaaannnnndddd I quit opening doors for women","commenter_a":"Also this bitch is a joke... i live in texas and shes just a narrowed minded republican raised by republicans... look how much make up she has on... lets guess what she cares about. Gtfo with your nonsense... and dont talk about men not holding doors for girls.... you women killed it. Hardly anyone says thank you... you are basically expecting it but not acknowledging it. So we took it away. Bitches always pointing the finger at men like we are always in the wrong. No fuck you.","post_message":"Alexis Bloomer has taken to social media to give a speech on why her generation is so self-centered."},{"comment_id":"10152683402245667","commenter_b":"She must like getting stuff for free.","commenter_a":"He's republican. Enuff said. Lost my vote.","post_message":"Marco Rubio has \"something\" important to say."},{"comment_id":"10155440088805354","commenter_b":"Charlie, I guess it doesn't take much for you. When she stands up her boobs point south.","commenter_a":"Time for that old broad to retire.","post_message":"\"Why is it okay to show ass and no breast?\" - Madonna Fair question?"},{"comment_id":"10157601256035594","commenter_b":"I don't know who you are hanging out with but you should protect your pussy...","commenter_a":"Hillary calls Trump supporters deplorable... yet a Hillary supporter does this, this disgusting attempt at a 'protest'. This is more foul than the WORDS Trump spoke.","post_message":"“Dear Mr. Trump, I’m not able to mail you my actual p----, so I’ve included the next best thing. Cheers, Emily.”"},{"comment_id":"10154394948753494","commenter_b":"When one door close another will open, smh","commenter_a":"I hate to break it to anyone, but unless you own the company very few people can not show up for work and still have a job. There are plenty of others who need a job, that will step right up and be thankful to have a job.","post_message":"Juvenito Quintana and 20 others missed work February 16th. The following day, they all received a termination letter."},{"comment_id":"10153280743327042","commenter_b":"Let them shoot to kill and get shot whilst doing it!!","commenter_a":"Shoot to kill.... I'm talking to the cops !!!","post_message":"GANGS TEAM UP TO 'TAKE OUT' OFFICERS: Video shows \"lawless\" teens destroying police cars and injuring multiple officers. Today, police learned of a new threat from the city's notorious gangs."},{"comment_id":"10155061225139726","commenter_b":"The woman wearing this would probably be beaten to death. Better off carrying a gun!","commenter_a":"Women in America carry guns. What are we back to the middle ages? women at the time wore chastity belts to protect themselves from the muslim ancestors of the same ones today who were terrorizing Europe back then.","post_message":"It's a modern day chastity belt."}]
