[{"comment_id":"793702420758020","commenter_b":"Safer boarders and no more refugees!!!!!!!!!!! WAKE UP AMERICA!!!","commenter_a":"Fox news! Enough said!","post_message":"Two Middle East refugees have been arrested on terror charges in California and Texas. fxn.ws/1Rnioji"},{"comment_id":"10152801044501130","commenter_b":"Mandatory blow jobs. Vomit.","commenter_a":"During womens periods I'm all for mandatory blowjobs and or anal sex","post_message":"The tampon scene, as it’s known, marks an important point in the relationship between Christian Grey and Ana Steele—but it was apparently a little bit too much for an R rating."},{"comment_id":"1583439795280427","commenter_b":"Disgusting, stupid woman.","commenter_a":"This woman and Palin and others like her are enemies of the state in my opinion! Shame on them for spewing their damage.","post_message":"WOW."},{"comment_id":"10152932791740528","commenter_b":"That was before we had so many illegals that thought they deserved the same rights as legal citizens","commenter_a":"You register to vote when you turn 18 or renew you drivers license. Some older citizens have not had a license in years. Many poor don't have vehicles and don't need licenses. Direct deposit and ATM's have changed the way we bank thus eliminating the need for ID. The fact that many don't have birth certificates to get an ID or can't afford to go get both if they were born in the city of Detroit, but you need an ID to get a birth certificate. If you were born out of state good luck, it is so hard to get one, without an ID, it is almost impossible. It is a vicious circle and many just stop trying to jump through the hoops to get an ID, thus, they just don't vote even though they are on the registry to be able to. I remember just walking in and ...","post_message":"On this day in 1965, while thousands marched from Selma to Montgomery, President Lyndon B. Johnson urged Congress to pass the Voting Rights Act. Today, the law has been gutted by the Supreme Court, and we need to fix it. Every American deserves the right to vote and to have their vote counted."},{"comment_id":"10153245787992507","commenter_b":"I never liked that women .","commenter_a":"She is Just not a good person ......","post_message":"Ann Coulter brought knives to a gun fight on The View."},{"comment_id":"10153566690418812","commenter_b":"Get those horny chicks out of there.","commenter_a":"This is a good reason why you don't have them in there or serving in combat.","post_message":"One former female corrections officer is providing an insider perspective on forbidden love behind bars: @webpagelink"},{"comment_id":"704368863070943","commenter_b":"He covered the swamp with scum!!","commenter_a":"Tge ma is a F-ing Con-artist!!","post_message":"Did Trump \"drain the swamp\" like he promised during the campaign? Vote below! LIKE Occupy Democrats for more anti-Trump content!"}]
