[{"comment_id":"10152712220635736","commenter_b":"I'm half native you ignorant land thief!","commenter_a":"Kill it? Really? Greedy ass humans are the reason it has no food. HUMANS catch its food source and deplete rapidly. Maybe the shopkeeper will open up a tab for the poor thing. Maybe the natives should start shooting up all the white people? Doesn't sound fair? Don't go shooting starving animals.","post_message":"Watch: This seal jumps out of the water to search for food inside an Astoria market: @webpagelink"},{"comment_id":"10153674136304641","commenter_b":"true... we just cant equate these refugees with terrorists.","commenter_a":"Its not about religion you fool! It's about your country's safety! Get that through your head!","post_message":"U.S. President Barack Obama's harshest remarks were for Texas Sen. Ted Cruz."},{"comment_id":"10153309026372452","commenter_b":"Please move out of Communist California.","commenter_a":"Hunter 😒😒😒😒😒","post_message":"The more you drive the more you pay? California could soon charge you for every mile you drive. abc7.la/1JjBX9b The state is looking for volunteers to test a new \"mileage tax.\" It's designed to replace the gas tax, but could you end up paying more? And how would they track every driver in the state?"},{"comment_id":"10153332905444726","commenter_b":"you ladies have silly opinions","commenter_a":"Who in the world is this guy? Why does anyone care what he says? Why isn't he doing something. Instead f criticizing, why isn't he doing something?!!!!","post_message":"WATCH: Byron Allen Calls Obama a White President in Black Face"},{"comment_id":"1107115119405265","commenter_b":"I've heard more sense coming from a crack head","commenter_a":"Can't these people realize somebody is going to have to pay for \"free school\"?","post_message":"ClashDaily.com"},{"comment_id":"10154196330336770","commenter_b":"Beverly your character flaw is showing again! You need to get a job at disney oh I forgot your not a foreigner# you need to get a hobby!","commenter_a":"He isn't coming cause Trump plans to change the Visa programs so Disney will not be able to bring over cheaper labor and have Americans train their replacement anymore.","post_message":"Are you buying his reason?"},{"comment_id":"10153576684991323","commenter_b":"Life is harder for women? That's why they live longer on average than their male counterparts? :p Please. That generalisation is painful to read.","commenter_a":"\"... an air of misogyny among her predominantly male colleagues...\" Basically, trivial nonsense that women want to incessantly complain about as always. Guess what: circles of female friends/colleagues will ALSO make misandrist comments about their boyfriends and men in general. The difference? Their remarks are treated as levities and never deemed sexist, whereas men are pilloried for supposed misogyny. Double standards, anyone? Woman to her friends: 'No, I don't do any DIY. I get my man to do that!' (Socially acceptable). Man to his friends: 'No, I don't do any house cleaning. I get my woman to do that!' (Misogynistic).","post_message":"Sometimes leaving a job is easier than standing up to sexism – so what can women do about it?"}]
