[{"comment_id":"10156219984965725","commenter_b":"Go home. You're drunk.","commenter_a":"WE NEED TRUMP!!! #Trump2016","post_message":"Signing my tax return...."},{"comment_id":"10153810976206680","commenter_b":"Lock that vandal up!","commenter_a":"Way better than perjury charges, obstruction of justice, mishandling of classified documents, racketeering (Hillary) or fraud charges (Trump.) Jill spray painted a bulldozer and I would have too had I been there. They were bulldozing ancient barrial grounds and putting in pipelines without concent or respect for international law. #imwithjill","post_message":"Green Party presidential nominee Jill Stein is facing vandalism charges in North Dakota."},{"comment_id":"10152910744010779","commenter_b":"I believe that you're a dumb whore.","commenter_a":"Can you guys just NOT send me this one in the mail? Thanks.","post_message":"Reality-TV juggernaut, selfie queen, actress, model, mother, Internet-breaker, entrepreneur and video game subject Kim Kardashian has something to say: \"I believe that I am so much smarter than I'm portrayed.\" The 34-year-old megastar talks about her scandals, family, and feminism in our wide-ranging new cover story. Here are 11 highlights you won’t want to miss: @webpagelink"},{"comment_id":"880663015326781","commenter_b":"Alex Peterson hahahaha","commenter_a":"Tyler Simmonds @username Ashley Mckendrick","post_message":"Dolphin seduced me, claims man who had sex with marine mammal."},{"comment_id":"1829596377287822","commenter_b":"I don't think Zippy Goldberg never looked up anything and that's why she always sounds like an idiot that hates America I just hope that if white people finally start rioting , go to wherever she lives to take her things and burn her cars so she can get a feel for what it's really like.","commenter_a":"Who watches that nightlight anyway?","post_message":"Whoopi Goldberg just scolded millions of Americans on The View. Apparently if you voted for Trump, it's because you \"didn't do your homework\" on Hillary."},{"comment_id":"1809017339318525","commenter_b":"happened in bosnia too.","commenter_a":"...not the only nor first time.","post_message":"These cowards sat back and did nothing for 4 HOURS while this was going on!"},{"comment_id":"739998596133321","commenter_b":"Jesus Christ the arguments against guns here are fucking stupid. To fellow pro 2a people, don't play into their hands like this. Look. Let's pretend you were right. That the good guy with a gun scenario doesn't really deter anything. fine. Let's pretend you are right. That having guns so that people can defend themselves against tyranny isn't going to do anything. Fine. Let's pretend that we can depend on our government officials to protect us against foreign invaders 100 percent of the time without fail. Fine. Let's also pretend that you get all the gun control laws you want passed. Done. Now let's pretend that so far a vast majority of the recent shootings weren't perpetrated by individuals who up until the shooting had little to no signs of deteriorating mental health and zero criminal history. Let's also pretend that those same individuals did not purchase their firearms LEGALLY ...","commenter_a":"Liberal code. NEVER TAKE RESPONSIBILITY!!! Blame blame blame","post_message":"I know he's a grieving father but this is so WRONG."}]
