[{"comment_id":"1187041288042639","commenter_b":"How is she even allowed to run for president with all of this disgrace","commenter_a":"They all need to be arrested clean the White House and all the corruption--- this needs to be done ASAP","post_message":"In response to the revelations about the pay-to-play scandal tied to former Secretary of State Hillary Clinton non-state.gov email system and the Clinton Foundation, Judicial Watch announced that it will host an educational panel discussion:   Scandal Update  Emails and the Clinton Foundation.  Panelists include author of the New York Times best-seller Clinton Cash and President of Government Accountability Institute Peter Schweizer; Joe diGenova, former U.S. Attorney, Independent Counsel and founding partner of the Washington, D.C., law firm diGenova & Toensing; and Chris Farrell, director of investigations and research at Judicial Watch. Moderator will be Judicial Watch President Tom Fitton.  [for higher volume touch sound icon on screen  ]"},{"comment_id":"10153779431271178","commenter_b":"Go away far away Whoopie aka Karen !","commenter_a":"Just keep diggin your hole, eventually you will all fall in!","post_message":"Actually, there is...and it's a big one."},{"comment_id":"457572411058203","commenter_b":"I hate that vile bitch. Dumbest wokman on the planet.","commenter_a":"Sarah and her offspring are all a blight on humanity and whatnot, but the dog doesn't seem bothered. That said I still wouldn't stand on a dog..","post_message":"Just when you thought Sarah Palin couldn't sink any lower, this happens. If this woman can't teach her own kids to have respect for animals, she has no business even thinking about running for anything in 2016.  ~Darrell"},{"comment_id":"10153384887696491","commenter_b":"Forget you guys, she doesn't go out with peasants from the first lion order..","commenter_a":"'@username yo daisy might be there when it opens","post_message":"Prepare for a smaller world at Disneyland"},{"comment_id":"10153197747769094","commenter_b":"He doesn't shoot them for 30+ seconds.... You have to go out of your way to watch it.","commenter_a":"I made the mistake of watching the video from the shooter as he committed these awful murders. I wish I could take back watching that.","post_message":"Video of the fatal Virginia shootings shocked users of Twitter and Facebook when the “autoplay” function showed them what they didn’t want to see. @webpagelink"},{"comment_id":"10155175983529749","commenter_b":"Not fair to use term feminist for these people...might be better to go on 'feminazzi' :) . It's kinda offensive for the real feminism movement which is still something some part of the world really need no? :)","commenter_a":"Why are they always fat? I have never received a satisfactory explanation.","post_message":"Presenters and staff frantically scrambled to cover the woman's breasts."},{"comment_id":"1849193665299183","commenter_b":"White people are the biggest thieves known to man","commenter_a":"'@username. as u know donny is completely unfit ...u dont care about your grandchildren smh sad","post_message":"WATCH LIVE: Electors are casting their ballots — will Donald J. Trump get the 270 he needs?"}]
