[{"comment_id":"10153305940576051","commenter_b":"If she is guilty, she should get the death penalty...","commenter_a":"\"Parents should be allowed to do whatever they want with their kids,\" we insist. \"It's THEIR children,\" we say. But what happens when the parents are sick and twisted? Huh? Don't kids have a right to be safe from their own parents?","post_message":"Even the grand jury was stunned that a mother could be so cruel to her own daughter."},{"comment_id":"988329747869113","commenter_b":"she should be arrested for making false statement, amd be fired from her job. This crab is getting old.","commenter_a":"She lied","post_message":"WOW this lady...shamelessly LIED about her entire encounter with the Police Officers..and here's the proof! What a fool."},{"comment_id":"10153004529954071","commenter_b":"Bill is a smart man!","commenter_a":"And what did Hillary say? Unless Trump is doing all this show to destroy the Republicans and elect Hillary as POTUS but then again there is Bernie.","post_message":"Former President Bill Clinton called Donald J. Trump in May and \"encouraged Trump's efforts.\""},{"comment_id":"10153228723406336","commenter_b":"Please these Repigs are tooo much..HILLARY CLINTON WILL BE PRESIDENT Regardless of all the BS Faux NONEWS says and EXAGGERATIONS from Hannipig","commenter_a":"Listen for the \"vast right-wing conspiracy\" defense.","post_message":"Hillary Clinton has agreed to testify on Capitol Hill later this month about two controversial issues when she was secretary of state – the fatal terror attacks in Benghazi and using a private server and emails for official business."},{"comment_id":"10154208108446717","commenter_b":"I want to punch that bitch in her ugly face","commenter_a":"Disgusting.....","post_message":"His sympathy is with the first responders, and not the victims."},{"comment_id":"987929541300100","commenter_b":"You guys just don't know anything about Muslims! !!!! Wake up.America they will take over your land People are clapping for her for what????????","commenter_a":"Should be concerned about all Americans instead","post_message":"Watch: Bernie Sanders teaches Republicans a lesson on how to respect Muslim Americans and end racism in America."},{"comment_id":"10154121076339342","commenter_b":"You are sick! Abortion should not be an option, period!","commenter_a":"There are so many people who would love to have kids and can't. But monsters like this get that blessing and go and kill their kids. This world is so effed up.","post_message":"Chilling new details about how a mother allegedly took each of her kids into the bathtub, and took their lives."}]
