[{"comment_id":"1830025417217655","commenter_b":"Maybe he was looking at her pussy to grab it.","commenter_a":"Maybe he needed help figuring out how to fill out the ballot","post_message":"LOL!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154890966160329","commenter_b":"Kacie Rodriguez","commenter_a":"Javier Maisonet oh Neville! ❤️❤️","post_message":"They out here. // Harry Potter"},{"comment_id":"10152837238297483","commenter_b":"If you don't like it stay away, you certainly won't be missed .","commenter_a":"That's the problem in Alabama this history of Republican leadership we need more liberals to vote","post_message":"Columnist John Archibald weighs in on how modern-day Alabama fits into the Bible Belt:  \"Alabama ignores that 'thou shalt not kill' commandment, posting the second highest murder rate in America in 2013, the last full year available. And blessed aren't its poor. According to the National Center for Children in Poverty, half Alabama's children are low income. Yet we still tax groceries.\""},{"comment_id":"10153171684108352","commenter_b":"Gun or no gun this girl would have stabbed him. And believe me, I would have too.","commenter_a":"And why do kids have access to guns?????","post_message":"Florida sisters, aged 15 and 11, are charged with murder of 16-year-old brother who they shot dead"},{"comment_id":"784349154999752","commenter_b":"Bitch","commenter_a":"Another racist liberal what does she have against Orange people. Ray","post_message":"Oh, Meryl...."},{"comment_id":"701341166639263","commenter_b":"Did porky hamas say something. Shame","commenter_a":"(Eo) amaso ne estas felia pro Amnesty International.","post_message":"Hamas is NOT happy with Amnesty International"},{"comment_id":"10153583881674087","commenter_b":"What Hillary Clinton is going to do about the unpaid maternity leave that women have to take there is no coverage for that in the United States","commenter_a":"Nancy was backing trump","post_message":"Hillary Clinton will leave the campaign trail on Friday to attend the funeral of Nancy Reagan and pay her respects to her fellow former First Lady who passed away this week at the age of 94."}]
