[{"comment_id":"238735813255041","commenter_b":"And to think....they probably had children","commenter_a":"When the defendants were acquitted and they were just sitting back in their chairs with cigars in their mouths and everyone was just congratulating them on beating the case they had no remorse for what they did and it's terrible how could you be ok with kidnapping a 14 year old and just dismantle his face and then dump his body in a swamp that was pure evil and hate they had in their souls to just do that to him it's sad.","post_message":"The story behind the photo that exposed racism in America and helped spark the Civil Rights Movement. @webpagelink"},{"comment_id":"1461455587203411","commenter_b":"Some aren't. I guess this is part of \"Make America Great Again\". I'm confused. I'm mad. I'd laugh, but I laughed that Trump was running for President and laughed at the circus the ensued. Now look where he is!!!!","commenter_a":"Seriously? This has gotten completely out of control. We are better than this.","post_message":"After national polling indicated an extreme gender gap among presidential support, some Trump supporters took to Twitter to demand a repeal of the 19th amendment — which in 1920 gave U.S. women the right to vote."},{"comment_id":"1369207093090488","commenter_b":"The woman is pure evil","commenter_a":"It's time for women to shine, it's Been over due. I'm so proud a women is going to be the next President of the United States 2016 for the 20th century","post_message":"LIVE: Democratic Presidential nominee Hillary Clinton speaks at Democratic National Convention."},{"comment_id":"862770227128920","commenter_b":"Ted Cruz loves our country Hilary hates our country and all true Americans!! I would never vote for her or any Dem.","commenter_a":"Yes!","post_message":""},{"comment_id":"10157784004785206","commenter_b":"Those poor girls should be removed from her household. Smh.","commenter_a":"SHe WIggity Wack!","post_message":"Nina Peterson has made over $1 million being a companion to older rich men, but she insists she’s not a prostitute."},{"comment_id":"1170579889643596","commenter_b":"Haha I thought the same thing. She should cover up!!! Lol","commenter_a":"She shouldn't be breastfeeding in public.....she should cover up.......oh wait animals breastfeed their babies out in the open too and no one bats an eye. Sorry just had to","post_message":"Prague Zoo's 24-year-old gorilla, Shinda, gave birth unexpectedly to a baby girl. Zookeepers didn't know Shinda was pregnant; they thought she was just overweight. @webpagelink  Correction: Prague Zoo has not yet released the official name of the baby gorilla. Shinda, its mother, has been living at the zoo since 2001, not 2003."},{"comment_id":"10155463122287908","commenter_b":"They have BEEN doing this for years. My Mom (bless her soul) was very inept with her money and defaulted on her student loans. Her SS WAS garnished. 15% came out every month. Luckily she lived with me so she was OK. We calculated what she owed and what was taken from her...... tax refunds and garnishes..... she paid that loan over and above YEARS before. But, they are like the IRS they charge interest for every day, week, month and SECOND you owe them money. I told my daughter, it's better to work and pay as you go and maybe take a few years longer to get an education than EVER take a loan for it.","commenter_a":"So what has Obama and the DNC been doing about this?","post_message":"How absurd! The very rich get richer and receive giant tax breaks, while low-income seniors see their social security benefits cut to pay off decades old student debt. We should be expanding social security benefits, not punishing seniors for the \"crime\" of getting a higher education. Garnishing social security benefits to pay off student debt is a crystal clear example as to why we need fundamental changes in our national priorities. In the richest country on earth, we should make life easier for seniors, not hard"}]
