[{"comment_id":"10155263002346162","commenter_b":"we have a lyin' idiot Donald Duck, willing to bet with any one, end of this idiot presidency we will have recession, Trump will drive our bus thru cliff","commenter_a":"How can he block news orgs from a 'press' briefing? Are they not 'the press?'","post_message":"JUST IN: White House blocks news organizations from press briefing...@webpagelink"},{"comment_id":"410883789115113","commenter_b":"I don't understand why they are picking on Trump! If I remember correctly the other candidates said the same thing. They did not want anymore refugees brought into to us but only Trump getts STOMPED for it.. DC is so afraid of him. Go Trump!","commenter_a":"Pot calling the kettle black.","post_message":"Trump is being attacked from all sides. He needs our support. Can we get 70,000 'LIKES' to elect Trump for president?"},{"comment_id":"10153365455244087","commenter_b":"@username , that is BULLSHIT! They purchased the assault rifles they used IN CALIFORNIA!","commenter_a":"No one has lost any rights to guns under Obama. No one has had any guns taken away under Obama. If ONLY the right wing could learn to try to GOVERN instead of just doing things that appeal to their right wing base, that would be just great!","post_message":"“Coming in the wake of the terror attack here in Paris, this horrific murder underscores we are at a time of war,” Sen. Ted Cruz said yesterday. “Whether or not the current administration realizes it or is willing to acknowledge it, our enemies are at war with us.\""},{"comment_id":"1807222879565696","commenter_b":"This is the most disturbing thing , what a monster , someone needs to cut his intestines out while his mouths tied up","commenter_a":"I hope that scumbag get his f**king hands chopped off the f**king scumbag thing like that really makes me so made !!!!!!!!!","post_message":"Chinese man live-streams himself DISSECTING a puppy as revenge."},{"comment_id":"10153708553274071","commenter_b":"@username Andy Lee when should we make the reso?","commenter_a":"Eric","post_message":"We ate live octopus at this NYC restaurant — and it was exhilarating."},{"comment_id":"10153622787011336","commenter_b":"Michelle Obama and Obama need to go!","commenter_a":"Both the schooling and the feeding of the children of the USA should remain at the local levels. We don't need an untrained fool to tell us how to raise our kids.","post_message":"Public schools are continuing to serve the federally mandated fruits and vegetables, but a new study claims the fresh produce is going into trash cans more than tummies."},{"comment_id":"10156093588515354","commenter_b":"Not only is she an awful human being but she is hell of ugly too!!!!","commenter_a":"Twitter users: Give a Tweet she will remember. Monica Foy @ monicafoycan","post_message":"***UPDATE***"}]
