[{"comment_id":"10152978013416615","commenter_b":"She's an evil monster.","commenter_a":"no way she a good mother she killed the boys and watched them die sje isn't a mother she is a monster","post_message":"After all this time, Susan Smith decides to talk about what happened the day she drove into a lake and killed her own sons."},{"comment_id":"589887647811084","commenter_b":"Please don't breed...","commenter_a":"Well I'd show an officer my id when asked, but some people feel differently and it's their right to walk away if they've done nothing wrong. Obviously she was never charged with \"jaywalking\", so in retrospect, she did nothing wrong according to her court hearing. Just saying.","post_message":"Are you kidding me?"},{"comment_id":"1651699668460485","commenter_b":"The deficit has no real meaning re the economy. Look it up.","commenter_a":"A big not for 8 years. What a great vacation they have had. Our country has gone to crap. Glad you enjoyed it. The only thing I have left is change in my pocket.","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"1022963947726395","commenter_b":"are all lesbians feminists?","commenter_a":"Fat shaming is a hate crime.","post_message":"A disgusting new low."},{"comment_id":"10155762960395354","commenter_b":"commands...???...commands what....","commenter_a":"Obama's greatest tool in his propaganda arsenal.","post_message":"Hollywood? Check out what he told supporters...."},{"comment_id":"10153155208743010","commenter_b":"Ariel Sharon was the last Israeli leader who sincerely wanted peace with the Palestinians and strived for it despite the war hawks. Only thing the Jews want now is all of the Palestinians lands, without the Arabs of course. They are ethnic cleansing it as we speak. Sad that after the holocaust, modern Jews behave as the Nazis.","commenter_a":"Peace will only come with the return of CHRIST Jesus!'","post_message":"In this Q&A with Los Angeles Times World, former Israeli President Shimon Peres discusses the prospect of peace in his lifetime, plus other issues affecting Israel and the world:"},{"comment_id":"799197103604200","commenter_b":"Um Death, that's a No fucking brainer","commenter_a":"He needs to be in front of a firing squad. He appears to be full of racial hatred.","post_message":"BREAKING: Black Lives Matters Shooter Kills 7, Wounds 30 [VIDEO]. Things are getting out of control. They need to be stopped. What do you think his punishment should be?"}]
