[{"comment_id":"10153026927846051","commenter_b":"Cut down on fraud and kick out the illegals","commenter_a":"I live in Arizona. Thank you Gov. Ducey. So much welfare fraud. So many illegals getting enough benefits, to make you see red! 4 million people waiting in line to come here legally. They have been put on hold to accomodate the illegals. This is sooooo wrong.","post_message":"This state just reduced the amount of time people can spend on welfare to the shortest in the whole country."},{"comment_id":"872932106099872","commenter_b":"Immigrants built this country","commenter_a":"Why can't the homeless get benefits? Or a hostel? but when immigrants come over they get everything at there feet!! How about giving the homeless everything they get and let the immigrants sleep in a fking box!!","post_message":"It has a solar panel to power radio, light and phone"},{"comment_id":"1077284305661431","commenter_b":"Hillary for POTUS! Hillary 2016! THE MOST QUALIFIED CANDIDATE! #imwithher","commenter_a":"You will never be our president, and I cannot wait to see what you do when the FBI files against you! I think your failing political career is dead!","post_message":"“To me, that’s the best of America and it keeps me going. That sense we are all in this together. We all have vital contributions to make. And that when come together, all of us, with a sense of shared purpose and shared humanity, we can solve any problem we face. We can heal any divide. We can build a future that is far, far better than our past.” –Hillary during her speech on breaking down barriers in the African American community"},{"comment_id":"1116798981710579","commenter_b":"She's feeding her baby. Shut the fuck up and move on","commenter_a":"Well it isn't racey,it's natural. This is ridiculous people need to approve of the way babies were intended to eat and get over it. When they do mom's will stop plastering feeding photos all over the internet.","post_message":"An interesting discourse here about nursing in public. What are your thoughts?"},{"comment_id":"556755621195285","commenter_b":"@username y'all race invented HIV and experimented on other races but that heroin epedimic spreading HIV all thru the white folks Hood. Keep sharing needles junky..","commenter_a":"Same white dudes screaming how they would beat her ass are the same ones who scream don't hit a woman when it's a white woman !!! Good news is that it is fact that by 2030 the white race will be a minority ! 😉. So that always makes me smile when I see the racist still holding on to a failed system ! But that's ok the rest of the world has moved on! Just look at the population ... your country is now little Mexico right under you nose while you tried so hard to oppress the blacks you let in millions of mexicans , Muslims , Somalis! Now you mad !","post_message":"She took his crowbar away and went crazy! "},{"comment_id":"1239847632704451","commenter_b":"Hillary is the Unindicted Felon!","commenter_a":"That is exactly what pisses me off the most, to see the wealthy paying zero taxes! I pay taxes so I make my contribution to our government just like millions of Americans do! It sucks, really sucks! And then to say it is smart not to pay taxes on National TV? That is an insult to the American people! Bragging about it makes me think that those who support this clown have something wrong in their heads, period! Is this the kind of Commander in Chief we want?","post_message":"There it is, folks!"},{"comment_id":"1320520624652837","commenter_b":"Minus the illegals AND the refugees AND the dead people!","commenter_a":"California in particular allows illegals to vote. When someone applies for a driver license in that state, they are automatically registered to vote, contrary to Federal Law.","post_message":"TEASE: TEASE: Yeah... about that."}]
