[{"comment_id":"1194657977239103","commenter_b":"Yep theirs just as maney glacers now as their was then . But their smaller now then they were then. The Artic ice cap is smaler now then it was then and the Anartic is doing somthing with large chunks braking off.So I guess you all know more then the people that study the weather Maybe almost as much as you know about doing your job in stead of taking money to lie","commenter_a":"The whole global warming crap is a lie its away for rich people to gouge the world for more wealth","post_message":"This is going to upset a lot of people!"},{"comment_id":"10154262733576615","commenter_b":"The men don't have to be gay .. the killer doesn't have to be gay.. if there even is a killer, it could be male or female.. (although the odds are low of that ) .. I'm just saying it's funny how I feel it would be different if this many bodies were found and they were female. I don't like how ppl instantly assume this many men just walked into the river accidently drunk.. especially when their have been bodies found in garbage cans and other areas as well. It may be a big city but a serial killer theory is plausible and cannot be excluded when this many individuals seemingly \"walked into the river\" accidentally. The men are young mostly college aged looking ... if someone is targeting them it could be for a variety of reasons. The only thing they seem to have in common is they ...","commenter_a":"I can't be the only person that's starting to get the impression there may be a serial killer in Pittsburgh","post_message":"JUST IN: Skeletal remains found earlier this week in a trash can have been identified as Dominick Brown, a Penn Hills man who went missing in 2012, his family tells Channel 11 News."},{"comment_id":"10154898631786729","commenter_b":"But at least she was honest enough to release her tax returns,something that Trump still hasnt done.What damning information is Trump hiding in those returns?Has it to do with his business dealings with the Russian oligarchs.","commenter_a":"The old switch a roo...creative tax scheme?","post_message":"Something's rotten all right..."},{"comment_id":"1799169303666092","commenter_b":"I'm still waiting to hear how sexual relations not involving vaginal Intercourse is not responsible and can't prevent pregnancy if you aren't ready for a child. Allllll ears, lol. Time to find a safe place for you, you can't handle the truth.","commenter_a":"I am 66 years old and I am sick and tired of old white men trying to rule my reproductive life and that of my daughter, and now of my granddaughter. NOT ON MY WATCH.","post_message":"Do you agree with Rachel Maddow? We definitely do."},{"comment_id":"10157700515445294","commenter_b":"Educate yourself. So we rather have criminals holding people up at gun point running the street? Robbing innocent hard working people?. We feel bad for the criminals? However, I don't. Much peace and love.","commenter_a":"Well he won't do that again. Glad he won't be terrorizing hard workers anymore. I don't care if he had a drug problem look at all the people he held at gun point the past 3 weeks. Should feel sorry for those who had to be terrified of their life.","post_message":"Police say the robber was suspected of holding up other Cleveland-area CVS stores for opioids."},{"comment_id":"1062292093806211","commenter_b":"DON'T NEED ANOTHER BILL CLINTON","commenter_a":"Lol! Trumps hands are not looking so small now. Hehehe","post_message":"Breaking News!"},{"comment_id":"1723680187844156","commenter_b":"she is CRAY cray crazzzyyy","commenter_a":"@username ton 2 cents plottale la dessus please","post_message":"On Tuesday’s “The View”, Hillary claimed that a child, on its due date, just before delivery, has no constitutional rights. Are you serious? I believe that life begins at conception and that abortion takes the life of an innocent human being. And I’ve heard all the arguments from the left before, but this idea that a baby on its due date still has no constitutional rights? That really takes the cake."}]
