[{"comment_id":"10155793831095354","commenter_b":"Good. There are plenty of beautiful conservative women.","commenter_a":"LET HER GO","post_message":"'Mexicans, like all Latinos, contribute positively to this great nation. We are the force that keeps the country afloat.'"},{"comment_id":"432105150316631","commenter_b":"Haul her a•s to jail ???","commenter_a":"I would love to jerk the whole outfit off. Would stop a lot of shoplifting for a start😡👳🏾","post_message":"NO SHARIA LAW IN AMERICA!"},{"comment_id":"10153669606379060","commenter_b":"'@username - my point is that Germany is too influenced by its past, too ready to apologize for its past. In the 90s, the extreme right-wing Republikaner and the DVU gained in support because of this blind open-door policy. What is more, Germany expects other EU countries to do the same, irrespective of the cost. I say that this has to stop.","commenter_a":"The Germans typically let in loads of war refugees. More than they can handle. It's their way of apologising for World Wars 1 and 2. In the 90s, they let in 320,000 war refugees from Yugoslavia. What happened in German towns ? Property rents skyrocketed and the crime rates went right up. What's worse, the Germans expect every other country to do the same. Whacky open-door immigration. The UK needs to leave the EU, get sovereignty over its borders and immigration / refugee legisation back and tackle the problem as a single nation. This time, the Germans are letting in 800,000 war refugees from Syria. Absolutely crazy.","post_message":"Ever since Angela Merkel took the lead on the migrant crisis, critics began speaking as though she created it. This is nonsense"},{"comment_id":"876486519053475","commenter_b":"Lmao Andrea the slut","commenter_a":"Lmao. These hoodrats can have armpit hair all they want. They'll be single and starved for cock. Noone wants chewbaccagina.","post_message":"There's a viral discussion being had over sexism..."},{"comment_id":"10153961406315695","commenter_b":"Praying now!","commenter_a":"'@username Redemption Baptist Church Carissa Byrd please pray for this baby. She is Ron's daughter's cousin.","post_message":"“I just laid down with him and gave him one finger and told him to squeeze and just stay with us. Just keep looking at me,' the boy's father said."},{"comment_id":"10156149888525389","commenter_b":"Now they are coming over by sea they are still illegalls","commenter_a":"Oh Great,more people coming in !!","post_message":"A Miami Beach Police spokesperson said it is unknown how long the group were at sea."},{"comment_id":"10155973648509199","commenter_b":"This Woman is money smart. Say it with me. This Woman is money smart. She will wind up moving up at her job to the highest position, paying more taxes, and bettering her life. People around her will be better from her life. She will put out better quality in everything she does or touches. It can all start with positivity here and with acknowledging that this Woman is money smart.","commenter_a":"Those berating the mom...it is her employer who is getting the 'subsidy' by being able to make more profits by paying wages families cannot live on - of course they also can sell things for less, so consumers pay less, so they benefit. Wondering where she lives that that's a years rent, where I live that's a couple of months. Messed up system, but glad for her fam.","post_message":"'Instead of buying my kids the latest Jordans or fancy electronics, I paid my rent for the YEAR. I a single mom and I do it all by myself on a minimum wage job.'"}]
