[{"comment_id":"555636131271583","commenter_b":"I HOPE THE IDIOTS NAME LIST I HAVE SEEN DO! We Will cleanup AMERICA! BY THESE WEAKKNEED BITCHES LEAVING WE CAN HAVE A REVIVED NATION","commenter_a":"If only it were true. Jobs for everyone!","post_message":"28 percent of American voters said they would likely consider leaving the country if Donald Trump becomes president."},{"comment_id":"10152865678521336","commenter_b":"Christ is the answer for the muslims !!","commenter_a":"All muslims are either radical or they support it ! they follow the qoran and that is what the qoran teaches !! their leader was a pedifile and mass murderer !","post_message":"'I think we should cut out the political correctness. This is Islamic extremist terrorism. It is not the entire Muslim religion.'  Former NYC Mayor Rudy Giuliani said President Obama appeared weak for describing Wednesday’s deadly terror attack in France as 'senseless violence of the few.' @webpagelink"},{"comment_id":"793038077515812","commenter_b":"Omg yes","commenter_a":"'@username we need this","post_message":"This is the perfect party game to play with your stupid friends: @webpagelink"},{"comment_id":"10155259941361756","commenter_b":"Yep Aussie too. All true above. Totally embarrassed and ashamed ourselves and our political leaders also often call them illegal immigrants not refugees 😢","commenter_a":"Australia, please know that he does not speak for us. Thank you for your humanitarian efforts.","post_message":"The deal concerns refugees -- not 'illegal immigrants' -- who have been housed in offshore detention centers on Nauru and other islands."},{"comment_id":"10152902010080950","commenter_b":"I am sick and tired of these calls. I get them all the time on my business phone and my unlisted home phone. Especially Google. They are one of the worst.","commenter_a":"You let them know not to call you again usually by hitting 3 but it doesn't matter as they'll call you again using another number. Most are spoofed numbers. I had my own phone number come up on Caller ID one time! there is a site that you can check out numbers, www.800notes.com to let others know about the callers but the telemarketers don't care about that site. I see a lot of people on there saying to 'Stop calling me!' yet don't leave their number. Yes, I'm tired of the 'Lower Your Credit Card Interest' or letting me know about a topical pain ointment. Be aware of those calling saying that they are the IRS or police telling you to pay up using a pre-paid debit card. Callers also try to tell you that your computer has issues and that they are from 'Windows', not Microsoft. I mess with ...","post_message":"'If [phone companies] came out with an ad, 'We're going to block robocalls,' I mean, I don't think they could handle the business they would get,' Missouri Democratic Sen. Claire McCaskill predicted."},{"comment_id":"1859557927611142","commenter_b":"Will be done if u pulled this shit lmao","commenter_a":"'@username lol😂😂😂","post_message":"Cold! #WSHH"},{"comment_id":"10153451640786973","commenter_b":"Regarding your Columbus post earlier, in my school he isn't credited with what you are saying. Blanket misconceptions are counterproductive, especially when it comes to school. Much like the Pledge crap that goes around... we do the Pledge, even if Fox news says otherwise.","commenter_a":"When my children are sick, they'll miss school. When they have dentist appts they'll miss school. If I decide it, they'll miss school. I'm the parent, our family's needs come before school administration's needs. Period. The school is LUCKY to havey children attend and i warch them like a hawk. Our childrens mental health is more important than grades and standardized testing!! And @username you've got to be high on meth if you think for one minute every doorstep wants or needs a social worker or, the GOVERNMENT rather, invading their privacy, trying to make parenting decisions or stomping on civil liberties on even the smallest scale. I wouldn't put up with that for a second. And haven't you been paying attention to what a total, corrupt failure DHS is anyway??? Ridiculous notions.","post_message":"Oregon schools have done little to intervene despite having 94,000 students miss at least 10 percent of the school year."}]
