[{"comment_id":"1767519713512114","commenter_b":"She's a joke","commenter_a":"She is running the lowest, dirtiest campaign in USA history","post_message":"Clinton to voters: \"Reject the dark and divisive and hateful campaign that is being run by my opponent.\" What do you think?"},{"comment_id":"1457146887628950","commenter_b":"She's singlehandedly responsible for the murder of countless unborn babies! She can burn in Hell!","commenter_a":"Rest In Peace Norma. God bless you","post_message":"Norma McCorvey, 'Jane Roe' of Roe v. Wade, dies at age 69"},{"comment_id":"10154314532254218","commenter_b":"Gee thank you,I haven't heard anything about Freddie Grey for at least 10 mlnutes!!","commenter_a":"She's a joke... Disgrace to Maryland","post_message":"The trials of the six Baltimore City police officers charged in the police in-custody death of Freddie Gray are still ongoing."},{"comment_id":"10154306572928812","commenter_b":"Go Peggy... how could anybody vote for her especially women????!","commenter_a":"Hillary has the most experienceand best judgmentof any candidate running for president. Eight years as a team member under her husband Bill. point here is that Hillary Rodham Clinton has been doing this for a long time: seeing the world through a political lens and revealing an uncommon solidity of judgment and perspective. ... just because she has risen higher than any woman in American politics, but because she is by far the most experienced candidate of any of those running in either party this year. In fact, she is one of the most experienced people to ever run for president.","post_message":"As the remaining candidates turn their attention eastward, the style and locations of events are going to look different than they have in the past."},{"comment_id":"667242780097527","commenter_b":"YES!","commenter_a":"Yes","post_message":"Would Donald Trump be a better president than Obama?"},{"comment_id":"10155447745046509","commenter_b":"HAHAH NNeta Fitria","commenter_a":"She works at Comcast now and has hung up on me 7 times.","post_message":"\"Ain't nobody got time for this.\""},{"comment_id":"10154380401494071","commenter_b":"Uh oh, there it is again \"Nasty woman\". But she is right.","commenter_a":"Hannity. Your rating might be high among poorly educated Trump supporters who love seeing you licking his butt.","post_message":"Sean Hannity railed against Joe Scarborough in defense of top Trump advisor, Stephen Miller."}]
