[{"comment_id":"1068743996585956","commenter_b":"No deport non americans and those who wish to leave..escort them to Mexico..let themtry their bullshit with them..see how far they get..I am fed up with the demorats/libtards!","commenter_a":"No","post_message":""},{"comment_id":"1113532561997426","commenter_b":"@username you are dumb idiot. W. Bush was the want that gave the tax break to the richest and the big corporations. Do you think that the MF Republica will go along with that, has much they hate like you the President. Went you moron , stupid and idiot use the word SOCIALISM find first the meaning of that word MORON. THE LUCKY ONE IS THAT MF BUSH THAT SEND OUR KIDS TO BE KILL FOR HIS GREED. BUSH NEED NOT THE BE IN JAIL , NO BE PUT IN THE ELECTRY CHAIR, TOGETHER WITH CHENEY AND HIS ADMINISTRATION.","commenter_a":"More for the rich..less for the poor..thanks a lot.","post_message":""},{"comment_id":"989708387731249","commenter_b":"Are these women that butt ugly they need to completely cover up","commenter_a":"The people that thinks this is right need to wake up","post_message":"NO Sharia in America!"},{"comment_id":"10154184073372093","commenter_b":"Are you kidding ? Mom said NO. Who knows what that WOMAN has exposed that baby too.","commenter_a":"Oh.. now shes just doing the most wonderful beautful natural thing that God as given women the best thing for a child...what's wrong with that ..bad mom for sayng no to someone wanting to be so generous and giving......","post_message":"The mom says the daycare worker asked if she could breastfeed her son. Disgusted, the mom said no. But as soon as she left the room, video shows the worker did it anyway... bit.ly/2kEuI1v"},{"comment_id":"10154296658174411","commenter_b":"@username Actually, no it wasn't in response to that comment. I wasn't responding to Andy Shitman anyway.","commenter_a":"imagine a group of 4 thousand russian troops on a boat alongside new york..... and then telling the us theyre acting aggressive.. LOL","post_message":"'Russia is acting in an extraordinarily provocative behavior'"},{"comment_id":"1988963441329253","commenter_b":"LOL I never ever listen to any of her crap music.","commenter_a":"Thats right America! Keep giving your money to hollywood libs! Making them millionaires! She and her thug hubby laughing all the way to the bank...","post_message":"***FIRESTORM*** An online #BoycottBeyonce campaign to boycott Beyoncé and her music has picked up steam since the pop star performed a controversial tribute to the Black Panthers during the Super Bowl halftime show on Sunday....Developing..."},{"comment_id":"10154962513977235","commenter_b":"That's Trump's kinda gal. She and Melanoma should get together and compare notes.","commenter_a":"Shows how repub's don't have a brain of their own! The just regurg other people's info and apparently aren't too concerned about the ethics of theft 👎🏼","post_message":"\"The book contained a complete cut and paste job on Keynesian economics taken from off the internet.\" BUSTED!"}]
