[{"comment_id":"10153877840551337","commenter_b":"I always hated rousey I'm glad her ass got knock the fuck out","commenter_a":"Truth is holly Holm is a real fighter n Dana white thought he picked another easy girl for Ronda to destroy well plan back fired ,Holm is a real fighter and real champion now let's see her n cyborg fight two top fighters Rousey is finished","post_message":"DAMN: Holly Holm didn't hold back with these comments about Ronda Rousey."},{"comment_id":"10154683405811756","commenter_b":"Well what can one expect when they compromise their values to support an incompetent candidate for president for the sake of the Republican Party! I thought you all take an oath to do what's best for our country and the American people. Not sure how Trump could possibly be considered part of this equation!","commenter_a":"@username, what we were talking about","post_message":"It was already a difficult election for down-ballot Republicans, a top campaign aide says. \"The bottom is starting to fall out a little earlier than expected.\""},{"comment_id":"10154021624482464","commenter_b":"Adultery is one of the ten commandments thou shalt not commit adultery","commenter_a":"I vote biblically, for someone who stands for righteousness and one who cares about the things of God and not his own ambitions. A true servant of God's and the people of this nation. My vote and prayers go to @username. Proverbs 29:2 says when the righteous rule, the people rejoice. God is giving the body of Christ another chance to get this right in 2016! Cruzin all the way to the White House! My president is @username!!","post_message":"\"The only person running for president to publicly admit to have been bitten by an octopus.\""},{"comment_id":"10154634366371729","commenter_b":"so now we support the lazy mongrels","commenter_a":"FLORIDA EVEN BETTER, NO INCOME TAX LOW SALES TAX AND NO COMMUNISTS.","post_message":"Of course they're moving to Texas!"},{"comment_id":"1658663710820319","commenter_b":"The Obama presidency wasn't a failure. Facts suck if your opinion differs, but it doesn't mean you get to have your very own truth.","commenter_a":"After seeing our FLOTUS on Oprah and seeing once again her \"attempt\" to divide our nation.... She had me thinking.. It was nearly nine long years ago that Michelle Obama stated, \"for the first time in my adult life I am proud of my country because it feels like hope is finally making a comeback.” After nearly eight years of failed policies, I feel I can nearly say the same.... For the first time in eight years, I am proud of my country because it feels like hope is finally making a comeback.”","post_message":"As First Lady Michelle Obama prepares to depart The White House, here's a look back at the moments that made her go viral. Watch more here: @webpagelink"},{"comment_id":"571789942944915","commenter_b":"Mentall illness--- the narcissist doing his thing..I only hope the damage he IS going to do is NOT catastrophic.","commenter_a":"Egomaniac?? That is being kind. He is certifiably insane. I am calling all my congressional reps on Jan 21 to demand a mental health evaluation. He is crazy.","post_message":"Trump's 'Twitter feed is remarkably bananas this morning. Something bad must be coming.'"},{"comment_id":"1037656442936422","commenter_b":"@username , I agree .","commenter_a":"Absolutely! This is the first campaign I have been able to follow totally since I retired, and I am sickened by how words that I have heard myself are mis-quoted and lied about, mostly by the Democrats. The lies are really incredible to me. Do they think nobody is paying attention?","post_message":"Huckabee says the mainstream media is making sure Clinton is \"presented in the best light,\" and goes out of their way to make Trump look bad. Is he right?"}]
