[{"comment_id":"1131244553635264","commenter_b":"#BernieOrBust #BernieAllTheWay #DropOutHillary","commenter_a":"Either way it will be a Democrat all the way to the White House again for another eight years along with a Democratic majority in Congress! Many thanks to the GOP for putting up unelectable candidates election after election,those dumb idiots will never learn","post_message":"Trump must be stopped.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1470099699674042","commenter_b":"And your mom should apologise to the world at large. I think you know why.","commenter_a":"Stfu Ryan. You couldn't figure your way out of a paper bag with both of the ends open. You are an embarrassed part in the political arena.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"910100355702699","commenter_b":"She should have gotten the death penalty!!!","commenter_a":"Hey like they say, you get what you sew!","post_message":"Convicted killer Jodi Arias will now spend the rest of her life behind bars. Watch Travis Alexander's sisters beg the judge for a maximum sentence: @webpagelink"},{"comment_id":"10155018116889371","commenter_b":"She broke the Law, simple as that","commenter_a":"Wait, did Kelleyanne get a new job? Is she now a spokeswoman for Ivanka? 45 will have to fire her. She can't do two things at once. Especially since at least one would be illegal.","post_message":"This is completely unethical and may even violate federal law. Kellyanne Conway—counselor to the President of the United States—just went on live TV to urge people to 'go buy Ivanka's stuff.”"},{"comment_id":"1017702978286400","commenter_b":"It's a true testament to J.K. Rowling's writing that I can read that passage, and, nearly 9 years later, still feel the same goosebumps I felt the first time I read the book in July 2007. Very sad day today.","commenter_a":"'Look... At... Me...' He whispered. The green eyes found the black, but after a second, something in the depths of the dark pair seemed to vanish, leaving them fixed, blank and empty. The hand holding Harry thudded to the floor, and Snape moved no more. '","post_message":"'It is an ancient need to be told in stories.'"},{"comment_id":"10153773357374877","commenter_b":"WTF... Where I live... White people be blasting they music so cut the crap!","commenter_a":"Ugh","post_message":"Driving While Black: Cops drag black man from his car and Taser him for playing loud music.   Grio fam, this is wild!"},{"comment_id":"10153588995871943","commenter_b":"With her I the White House nothing will change. Don't forget we will get a sexual predator along with her. What a deal.","commenter_a":"I WANT TO KNOW WHY - OUR PEOPLE WERE ABANDONED?!!! Just like Clinton's hubby refused adequate forces for BlackHawk Down - I'll NEVER get the images of OUR PEOPLE BEING DRAGGED THROUGH THE STREETS.....NEVER. That's the REAL RECRUITING Message: 'America is WEAK!!!'","post_message":"Obama administration and Clinton officials hid this compelling Benghazi email for years, said Judicial Watch President Tom Fitton.   The email makes readily apparent that the military was prepared to launch immediate assistance. The fact that the Obama administration withheld this email for so long only worsens the scandal of Benghazi. Please SHARE!"}]
