[{"comment_id":"367420056779622","commenter_b":"she should be in jail","commenter_a":"This is not right","post_message":"THIS is where tax money go..."},{"comment_id":"10153394444588984","commenter_b":"Reminds me of a script from Steinfeld when Kramer tryed to lie and win his lawsuit which he lost. What a pair they are. Wonder how she got the money for the trip? .","commenter_a":"So the Apple doesn't fall far from the tree huh ??? Lmaooo good one lol","post_message":"Shakedown artist Al Sharpton’s eldest child wants damages for “loss of quality of life,\" but looking at her recent photos, something seems a little fishy about the claim... Are you glad to see the younger Sharpton outed for this?"},{"comment_id":"1164891623572953","commenter_b":"No Obama, is a Muslim and I say screw all Muslims!! Trust No Muslim Ever!! Remove all Muslims from the United States. Trump, 2016, for 8 years!!!!","commenter_a":"Hell NO","post_message":"Another Muslim Holiday, And another Speech From Obama Greeting Them... Obama said he sides, with Muslims, maybe he should side with America FIRST! Do you side with muslims? take our poll!"},{"comment_id":"10153819870891037","commenter_b":"Build a big hole and build a fence around it. Yeah that outta do it","commenter_a":"A Swatch.","post_message":"“You look at this migration, I said to my wife the other day: ‘You know, they seem like so many men,’” said Donald J. Trump."},{"comment_id":"10153725146380667","commenter_b":"no one cares I'm tired of heading about him","commenter_a":"People get punched in the face everyday.","post_message":"“He said he was going to kill me.\""},{"comment_id":"1703634343208850","commenter_b":"Demo's must be high on something, another unquaified and under accomplished democrat running for the highest office in the land. Jail is where she belongs.","commenter_a":"Clinton should be in jail!!!!","post_message":"Sen. Jeanne Shaheen says there's no question Hillary Clinton is the most qualified candidate in the presidential race. Would you like to see Clinton become America's next president?"},{"comment_id":"1676227239104065","commenter_b":"What a pig","commenter_a":"Suck it buttercup had your crap 8 years give us 4","post_message":"How classless can you get?"}]
