[{"comment_id":"1807147956208492","commenter_b":"All of the above?","commenter_a":"@username. We should try this..","post_message":"Winter just got a lot more bearable."},{"comment_id":"1729274910624261","commenter_b":"@username well then","commenter_a":"Donate this to where the world needs 😩","post_message":"Science at work - The LifeStraw.  The LifeStraw removes at least of 99.99999% of waterborne bacteria and 99.9% of waterborne protozoan parasites. It can filter up to 1000L of water.   Throughout the world, an estimated 884 million people still do not have access to clean sources of water. This device contains no chemicals or batteries and makes it possible to drink safely from any river, lake or puddle.  Buy them here: bit.ly/1YbTja9  For every unit sold, two children in the developing world will be supplied with clean drinking water for a year."},{"comment_id":"10154311715577293","commenter_b":"DUMP IS A BULLY BUT ONCE HE IS CHALLENGED, HE CAVES. REMEMBER HOW MEXICO WAS GOING TO PAY FOR THE WALL?","commenter_a":"I worry about it probably in a southern state. sTrump supporters have suspended all logic and common sense. I am sure that professionals in the mental health field can talk about group hysteria. sTrump is already stirring the pot in an effort to incite his supporters. They've already suspended logic so I expect that some will act. Look at sTrump rallies...","post_message":"Half of likely voters fear violence either on Election Day or after."},{"comment_id":"1602419506718167","commenter_b":"Ah yes blame everything on women. Typical","commenter_a":"Maybe because women control everything and dont put out these days unless you're a fucking broke ass bum loser with no future","post_message":"So higher house prices, higher tax, higher tuition AND less sex??"},{"comment_id":"10154048881589753","commenter_b":"They both need to be charged she was sorry as hell to let him do that your kids come first","commenter_a":"I sure hope they don't place that child back with her. Lock her up until she is too old to bear any more kids. Where are the Fathers nd Grandparents of these abused kids?","post_message":"An Arkansas mother and her boyfriend were taken into custody and charged with first-degree domestic battery after the woman’s four-year-old daughter was found zip-tied to her bed, reports KTLA. Jennifer Diane Denen, 30, and her 47-year-old live-in boyfriend, Clarence Eugene Reed, both residents of Hot Springs, were taken into custody last week after a staff member at the Cooper-Anthony Mercy Child Advocacy Center found Denen’s daughter to be severely malnourished and abused, according to The... @webpagelink"},{"comment_id":"10154265505298188","commenter_b":"Ugly woman???","commenter_a":"Ugly jacket!","post_message":"The hypocrisy of these progressives is beyond shocking."},{"comment_id":"10154292449213525","commenter_b":"She didn't sleep with babe in bed purposefully by the sounds of it... She fell asleep. Big difference in that one is purposeful, one is accidental. New moms are exhausted.","commenter_a":"So sad..so dangerous. I had my baby in his crib until he was 1","post_message":"\"Do not co-sleep with an infant,\" Sheriff Grady Judd insists.  \"Co-sleeping with infants is just an absolute no.\"  His deputies have arrested a Winter Haven woman after they say her \"horrific negligence\" while co-sleeping with her newborn baby led to his death -- for a second time: @webpagelink"}]
