[{"comment_id":"1041407739283520","commenter_b":"Where's BEYONCE crying out against these BLMers?? Or is she FOR IT ALL???","commenter_a":"When will America wake up these people must go","post_message":"\"We must continue working to build trust between communities and law enforcement.\"   Watch Attorney General Loretta Lynch address the #Dallas sniper shooting that killed five police officers."},{"comment_id":"1703915029828450","commenter_b":"Mitt you looking for your10 mintues of fame????.... you lost get over it.....How can you allohw a Party to say mine and millions of people vo te don't count.....????..we don't like Rubio.and by the way llook hard in Flordia about his pass!!! we don't like Ted Cruz.. which i think thie Chistian voter shows that... Donald Trump for President 2016 has grown your Party... I am 60yrs old i have been a Dem all my adult life.. this year,, i changed to Rep Party....to vote for Donald Trump for President 2016... and now it doesn't matter?? because the GOP says so.... pure Goverment !!! trying to hold on to there ways the hell wi th the people e.... ok i you keep your crap up.. just won't vote.....and we can have another 4 years of Obama... and i am sure i am not a lone on this....th an you have ...","commenter_a":"And I put a hundred hours and a lot of cash working for Romney. A RINO at heart and a man that can't close the deal.","post_message":"Donald J. Trump responded to Mitt Romney, calling him \"one of the dumbest and worst candidates in the history of Republican politics.\""},{"comment_id":"10153951102966234","commenter_b":"She should had gotten revoke of gun license and probation","commenter_a":"@username u was jus talkin bout dis , she got 3 years","post_message":"Itiyanah Spruill pleaded guilty to child endangerment charges in connection with the death of her 4-year-old son."},{"comment_id":"10153294760143984","commenter_b":"Who gives a flying flip of these two self serving godless people? They are both the horse's ass and should be ignored! !!!","commenter_a":"I wonder how it got that way ???????","post_message":"It seems as though Wild Bill's love life wasn't the only thing that was out of control in the White House during the Clinton's tenure..."},{"comment_id":"10155117976876002","commenter_b":"Lets do a story on bum tenants....thats where it is","commenter_a":"Hanks a tool lol","post_message":"Help Me Hank: Landlord's secret launches investigation (Full story: @webpagelink"},{"comment_id":"875716175906497","commenter_b":"No Muslim majority country throws gays off of buildings (unless you want to recognize the legitimacy of the \"Islamic State\"). Genital mutilation has no semblance of a relation to Islam. It's a cultural problem endemic of Northern Africa, not Islam (Christians and Jews from this region have the same problems with this practice).","commenter_a":"Yeah, except this ancient religion doesn't through gays off buildings, mutilate female sexual organs, and and want to kill anyone who doesn't become a Jedi! DUMBASS!!!!","post_message":""},{"comment_id":"10153141650912093","commenter_b":"Look it up chick","commenter_a":"3200 people died in car accidents today in the US, everyday","post_message":"A man is in a coma after an electronic cigarette exploded in his face... @webpagelink"}]
