[{"comment_id":"712854462154600","commenter_b":"Abe Foxman is a puppet and does NOT speak for most intelligent Jews!!","commenter_a":"We should HOUND their offices and call and support OREN","post_message":"“In the days leading up to the forthcoming release of a memoir of his experiences as Israel’s Ambassador to the US, Michael Oren appears to be using the very legitimate and sharp policy disagreements between Israel and the US as an insensitive and unjustified attack on the president,” Foxman said in a statement. “We hope that Ambassador Oren will walk back these unjustified attacks.\" -- ADADL - Anti-Defamation League Abe Foxman"},{"comment_id":"10152876671446336","commenter_b":"Lol really woman. I think its sweet","commenter_a":"Davetra Fleary","post_message":"Twenty years ago, Brittney Husbyn and Briggs Fussy walked down the aisle as flower girl and ring bearer at a wedding. Saturday, they did it again… only this time as bride and groom."},{"comment_id":"1630331337026989","commenter_b":"@username Yes. That is certainly a tragedy which no one denies. These people were murdered and their sacrifice should be honored. This article is stating that obama could have stoped it and deliberately did not. This is fake news at its highest degree and is shameful because it uses the dead to tell a lie.","commenter_a":"Fake news: Moreover, the majority report issued by the House Select Committee on Benghazi plainly stated that, minutes after learning about the ongoing attack at the U.S. diplomatic compound, President Obama and Secretary of Defense Leon Panetta issued \"clear orders to deploy military assets\":","post_message":"Here's the proof folks. Both Hillary Clinton AND Barack Obama are now exposed for not pulling the trigger to save anyone's life in Benghazi, when they could. This is the end of their careers! Let's get 5,000 shares if you think they should both be locked away for war crimes."},{"comment_id":"10154680168205575","commenter_b":"@username that's a woman I would vote for","commenter_a":"You know, enough with this BS, I hope Trump wins again in 2020, and then Pence follows. These deranged off the rails nut cases think they lost now, just wait.","post_message":"Uh oh . . ."},{"comment_id":"10152983591416491","commenter_b":"Lena did it for 10 yrs. She's gross!!","commenter_a":"Lena was seven. Not 14 or 15. And Duggar raped his own sisters many times over many years. And who the hell is Palin? An irrelevant person seeking relevance.","post_message":"“I’m sickened that the media gives their chosen ones a pass for any behavior as long as they share their left-wing politics.”"},{"comment_id":"949193028544815","commenter_b":"BLM is a terrorist organization, lets call it like it is.. Also the New Black Panthers are no better then blm..","commenter_a":"Good","post_message":"The Real Showdown with the BLM is about to Begin!. @webpagelink"},{"comment_id":"1524641694504572","commenter_b":"@username Bernie wants you to suck off all the boys in Chicago so their bitches can have a night off","commenter_a":"All the protesters want the other candidates only one protester in question was for Trump and he was 87 and still willing to fight for what was right","post_message":"John Kasich is a _________."}]
