[{"comment_id":"1057273917621602","commenter_b":"No lol","commenter_a":"One world order ?","post_message":"You can't possibly understand America's greatness if you look at this country as nothing more than a series of grievances that need to be addressed.  You can't see greatness at the same time you see that."},{"comment_id":"877314922325204","commenter_b":"What would you expect him to say? I wonder how this country got to where it is today since we need more immigrants on welfare to advance us.","commenter_a":"rose colored glasses ? Go talk to your Dad and brother !!!!","post_message":"Don't you agree Jeb Bush is WRONG on immigration?"},{"comment_id":"10156608436570354","commenter_b":"We need to STOP celebrating arrests.... and STOP the influx of these fuckers (LITERALLY) in the first place.... They breed like rats.... Once they infiltrate, there's NO GETTING RID OF THEM.... Think of the rat problems in NYC! How about cockroaches? How about emerald ash bore? Zebra snails? Asian carp? GET IT????????????","commenter_a":"There is no such thing as \"Moderate muslims.\" They all read from the same Quran.","post_message":"German police have now made a staggering 379 charges for the attacks in which women were sexually assaulted by migrant gangs on New Year’s Eve.  All the latest DETAILS here..."},{"comment_id":"10153034720411130","commenter_b":"Biggest problem, IMO,is the black daddies who make kids then disappears.The moms are just as bad with 5 kids and 5 different Fathers.","commenter_a":"All lives matter, saying only one race matters is why there is much violence going on. Race should not factor in to it. LIFE matters period, unborn baby, elderly, black, white, or purple with pink polka dots.","post_message":"\"How many more minorities have to die at the hands of the police who are supposed to protect us before we finally wake up? How many?\""},{"comment_id":"10152570556535496","commenter_b":"Oh that's right. IT'S ALL ABOUT THE MONEY!","commenter_a":"Some of you should mind your own business and stop throwing judgement at how others live their life.","post_message":"Accumulating reports are suggesting Bruce Jenner is transitioning to female and plans to document the change for a TV docu-series later this year.  See more: @webpagelink"},{"comment_id":"870530659649023","commenter_b":"This seems to imply, the next President has to be a woman...","commenter_a":"I completely agree with her that Hillary is not the woman for the WH. And I'm looking hard to find the one who will do all they can to put us back on track as a Nation, restore our economy, and undo the damages done to our International Affairs across the world. We need to sure up our relationships with our friends and work harder with the ones who threaten the peace and safety of this world to ensure they do not get nuclear capabilities and the ability to use them. We also need to clean up our Nation from illegals and close our Borders so that they are not so easy for illegals to cross them. We need some common sense leadership for this Nation instead of all the socialism and liberalism, lies and corruption that is tearing this Nation apart. Hillary Clinton has already proven she can not ...","post_message":"Want a female president?   Skip Hillary. Look at Carly Fiorina!"},{"comment_id":"1470713222988421","commenter_b":"Typical British woman. No morals, no values.","commenter_a":"Is this worthy of a news item? I think not.","post_message":"She text him the picture weeks later after not seeing him again"}]
