[{"comment_id":"10153075316564440","commenter_b":"Sarah, maybe if your homegirl wouldnt act so tough against the cops and complied, she would be alive. she rammed a car towards and now she's dead!","commenter_a":"Wow these damn cops can do what they want that's a damn shame","post_message":"BREAKING: No charges against Denver cops who fatally shot 17-year-old Jessica Hernandez dpo.st/1dSxAU8"},{"comment_id":"1169765843057166","commenter_b":"Leave them alone, they have to live somewhere!","commenter_a":"DON'T CARE.... Kids are hungry.. Will be more hungry when school out !!!!! Focus on important things in the Community!!!!!","post_message":"Rumors are flying! Are Beyoncé and Jay Z living in Tampa? Our news partner the Tampa Bay Times went to check out the rumors and here's what happened..."},{"comment_id":"1207405515987329","commenter_b":"HappyBirthday, Sir, \"It's one more candle and a trip around the sun\" !","commenter_a":"Happy Birthday Dr. Carson!!!","post_message":"#keepcalm"},{"comment_id":"10154188982011954","commenter_b":"illegals only come here for free money ..stop the flow","commenter_a":"Can we cover the 2 million illegals registered to vote?? That has just been proven??","post_message":"Watch LIVE: Press Secretary Sean Spicer briefs reporters after the DHS secretary moved to implement immigration changes ordered by President Donald J. Trump. @webpagelink"},{"comment_id":"10153330006631051","commenter_b":"11 died in the C130 crash in Afganistan today, thats 11 more murders for Obama.I had more respect for the Black Panthers than Obama.The Black Panthers at least admitted to being Racist and they did not murder our troops, as Obama has.","commenter_a":"More guns = less violence","post_message":"Does President Obama have a point here?"},{"comment_id":"857951050917630","commenter_b":"She needs to be beaten and slammed on the floor, I VOLUNTEER TO DO IT !!!!","commenter_a":"Linda that's not meth,bad acne","post_message":"A 26-year-old mom is accused of beating her son and slamming their 1-month-old puppy against the floor, because she did not want to clean up after the pet: @webpagelink"},{"comment_id":"1016709065044307","commenter_b":"Camille Valdez I don't think nothing would of happened if she was there unless she a trouble maker","commenter_a":"Cesar Chavez beginning down 9 days and not going to that school and it's Mexicans vs. blacks that's what it is there's going to be War","post_message":"#ALERT Police are at the scene of Cesar Chavez HS where several fights have broken out."}]
