[{"comment_id":"1318881848134860","commenter_b":"Suck it up Buttercup","commenter_a":"Good , If the press would stay neutral, as they should, and report only factual information, instead of just what creates more drama, then they'd get the respect they want.","post_message":"For a year and a half, the press smeared, attacked, and belittled Middle Americans supporting Trump. Now they want respect? Sorry, that's a two way street."},{"comment_id":"1718297721743930","commenter_b":"Lmao","commenter_a":"Lmao....stupid. but let's give them $15 an hour @username @username","post_message":"PRANKSTER: Someone called a Minnesota Burger King and convinced employees there was a gas leak - and they needed to smash the windows to release the pressure. So they did. STORY: @webpagelink"},{"comment_id":"10154089645681336","commenter_b":"Seriously Paula??? Smh! Pathetic!","commenter_a":"It's lice. We all got it in the 70's while in school. It's not life threatening. So it's harder to kill. If it's bad, I agree with shaving the head. It's hair. It will grow back. On average hair grows an inch per month. You can't stop kids from being kids and rolling around on the ground or jumping into leaves. So they get lice. Deal with it.","post_message":"What can you do if your child is affected?"},{"comment_id":"441828512816456","commenter_b":"You're not fucking kidding.Damn sum bitches,making us all look bad.fuck them @username.I plan to fuck with them every day and at every turn without mercy.","commenter_a":"Tear them a new ass @username","post_message":"EXACTLY! CNN's Jake Tapper just SHREDDED Trump for banning them and other mainstream news outlets from the White House press briefings. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152796636027217","commenter_b":"where are the women","commenter_a":"Check their passports and visas ...","post_message":""},{"comment_id":"1202395043109110","commenter_b":"betty you need to get your facts checked for you are off your mind. over the past 6 years the number have increase and a large number that was to be send back Obama administration let them go. don't listen to the libs press unless you can't think for yourself. a American life is worth more then sending illegals back. and it's the free stuff they get is why they come. so next illegal that was charged for federal crimes and sent back to their country comes back and kills an American why don't you go tell the family that there was nothing that could have been done to stop them because the illegal is more important then their love one. why don't you use your head and read both sides of the story instead of only one side unless you are an illegal yourself.","commenter_a":"Harry Reid is right. This bill is not the answer to a difficult problem. Some of the folks that have posted think this is a great bill. They aren't stopping to realize that it will cost more to house, feed, and send these people back to wherever they have come from, which is probably a very unsafe place or why would they have left in the first place? I hope this bill is seen for what it is, a terrible step in the wrong direction and hopefully our Senators will have more sense than to pass it into law. If you will check the numbers, in recent years more undocumented people have left the United States than have entered.","post_message":"The vile legislation that is now before the Senate might as well be called the \"Donald Trump Act.\" Like the disgusting and outrageous language championed by Donald Trump, this legislation paints all immigrants as “criminals and rapists.” Local law enforcement officials, domestic violence groups, immigrants’ rights groups, mayors, faith leaders and labor groups all oppose the \"Donald Trump Act.\" This bill does nothing to keep Americans safe, and it certainly does nothing to address our broken immigration system."},{"comment_id":"477777845756672","commenter_b":"Bull Crap, Hillary.","commenter_a":"Please take a good look at Chicago !!!","post_message":"Hillary Clinton's answer to crime is always to just crack down on law-abiding gun owners - not law breakers. But the American public is seeing through her gun control lies for what they really are: meaningless rhetoric."}]
