[{"comment_id":"527866774028766","commenter_b":"Are you a feminist?!?!? Yea!","commenter_a":"Every time you read or hear this story it changes ... The parents are frickin LIARS ! They knew about this years ago and MORE WILL COME OUT .... He's a pervert ! So much for feeling \"SAFE AT HOME\" . He isn't the only one that should be charged ... Mom and dad .... Hi Ho , Hi Ho ... OFF TO JAIL YOU ALL GO ! SHAME ON BOTH OF YOU PARENTS ! ( to bad you don't know what the hell that means ! Mom you look up at the thing you call a husband and act like a little puppy, what , believes get everything he says , GET A BACKBONE AND WATCH OVER YOUR CHILDREN , you made them and GAVE BIRTH, ACT LIKE A MOTHER ! There would be HEADS ROLLING if this happened in MY HOUSE , believe me ! Your son should ...","post_message":"And the Duggars and police COVERED IT UP!"},{"comment_id":"10153815674903299","commenter_b":"Funny how y'all are judging but if you think you're perfect you're wrong. Trump may not be perfect but at least he's not selling out to the ones trying to take away our Christian beliefs.he wants Christian morals back in our schools and families and I don't care about the rest. God will handle the rest. If Hillary gets in you better learn Sharia law because shes already sold out. At least we have a chance with trump.","commenter_a":"1168434116541793maybe you should research Hillary 100% lies","post_message":"\"What you really have to do is you have to pray to get everybody out to vote for one specific person.\""},{"comment_id":"10153542094851509","commenter_b":"@username wow your German? That sucks Germans can't reproduce, their birthrate is below 0% by 2060 there will be more muslims in Germany than Germans. LMBAO enjoy your day.","commenter_a":"Oh yet another white on black crime receiving national.media coverage. Way to keep the racial divide strong. But i am glad to see some justice is being served.","post_message":"Demonstrators have flocked to North Charleston City Hall to protest the shooting death of Walter Scott. The following report contains graphic content. Viewer discretion is advised: @webpagelink"},{"comment_id":"1118814734807982","commenter_b":"174742062548592helle Tenney let it first be understood I can care less for evil feminist. My point is why go to a frat house that is known for Alcohol drugs and loose women having sex up stairs, when you know inappropriate things always happen in places like that. Secondly, I'm sure she was there drinking in an unsafe environment but I don't condone anyone being raped but we should ask ourselves why the Hell do women keep going to places that are historically unsafe for women? Lastly, women lie so much about rape and other things that no one knows when they are telling the truth. There has been several times when men have been falsely accused of rape and we found out later that she was just trying to cover up the fact that she decided to sleep with the whole football team at once. I see the police reports ...","commenter_a":"Ok but why was she even there in the first place?!!!!!! Why do girls go into Frat houses?!!!!","post_message":"Sexual assault on US college campuses is a major problem  and we can't ignore it any longer. In an exclusive interview, US Vice President Joe Biden outlines how he's leading the charge to change the way we fight this epidemic  by going straight to the source.  Get the full experience at mic.com/enough"},{"comment_id":"10153598743328984","commenter_b":"We need a MUCH STRONGER policy for Illegals. These two should be Executed then they will not sneak back in the Country!","commenter_a":"Her family should sue the dept. Of immigration!","post_message":"While this 41-year-old grandmother and nurse slept in bed, she was tragically robbed of ever waking up. Our thoughts and prayers are with her family.   Do you think more needs to be done in the U.S. to prevent this from happening?"},{"comment_id":"1305769832812876","commenter_b":"Lock that b@tch up","commenter_a":"TODAY'S WIKILEAKS..Donna Brasile, GO READ UP! She got advance questions from CNN Debate, Hillary v. Bernie Sanders for Democratic run. She is the most corrupt politician possibly in our Country's history.","post_message":"As secretary of state, Hillary restored our reputation around the world and made us safer."},{"comment_id":"10153221748849087","commenter_b":"@username,where are you from?? You pig!! Photoshop your KKK outfit on your daddy...hahahahahaha","commenter_a":"IT WAS YOU, OBAMA who spoke these words at an Islamic dinner - \"I am one of you.\" IT WAS YOU, OBAMA who on ABC News referenced - \"My Muslim faith.\" IT WAS YOU, OBAMA who gave $100 million in U.S. taxpayer funds to re-build foreign mosques. IT WAS YOU, OBAMA who wrote that in the event of a conflict -\"I will stand with the Muslims.\" IT WAS YOU, OBAMA who assured the Egyptian Foreign Minister that - \"I am a Muslim.\" IT WAS YOU, OBAMA who bowed in submission before the Saudi King. IT WAS YOU, OBAMA who sat for 20 years in a Liberation Theology Church condemning Christianity and professing Marxism. IT WAS YOU, OBAMA who exempted Muslims from penalties under Obamacare that the rest of us have to pay. IT WAS YOU, OBAMA who purposefully omitted - \"endowed by our Creator\" - from your recitation of The ...","post_message":"“I do not believe Sharia is consistent with the Constitution of this country,” Dr. Ben Carson told The Hill. “Muslims feel that their religion is very much a part of your public life and what you do as a public official, and that’s inconsistent with our principles and our Constitution.”"}]
