[{"comment_id":"1405783259444718","commenter_b":"Nothing will be done. The past muslim made sure plenty of others were in charge before he left to keep it that way.","commenter_a":"I remember last year someone was sentenced pretty harsh for putting bacon on the door handles of a mosque. They called it a hate crime. Let's see what they do about this if they even do anything at all! Sickening","post_message":"Can you imagine the outcry if something like this had been done to a mosque?"},{"comment_id":"1420023134696147","commenter_b":"She really believes she has the right to treat that man disrespectfully because she disagrees with his views. What is wrong with people? Great job by the airline.","commenter_a":"Need to see more in many other places.","post_message":"WATCH! Anti-Trump Hag Gets Kicked Off Flight After Threatening TRUMP Supporter...Passengers Clap! [Video]"},{"comment_id":"1525170294448172","commenter_b":"DECLASSIFIED PROPHECIES AND VISIONS : A GREAT EARTH QUAKE IS ABOUT TO HAPPEN . A MILLION AMERICANS WILL DIE , AND OVER A HUNDRED AND TWENTY MILLION PEOPLE WORLD WIDE . THE UNHOLY AND GAY PUSHING OBAMAS MUST LEAVE THE WHITE HOUSE NOW . GOD CANNOT BE MOCKED . USA WILL BE GREATLY DESTROYED BY ASTEROIDS , EARTH QUAKES AND NUCLEAR STRIKES BY 2047 . PREVIOUS PROPHECIES THAT CAME TO PASS INCLUDE 911 , RUSSIA ASTEROIDS, JAPAN TSUNAMI , HURRICANE SANDY ( INFORMED WISH TV TWO WEEKS BEFORE IT HAPPENED ), PHILLIPINES TYPHOON , TERROR ATTACKS ETC . THESE ARE THE END OF DAYS - THE ANOINTED PROPHET z( I WAS SENT BY GOD)","commenter_a":"That would be the best dinner ever. How can I get invited!!??","post_message":"President Obama will deliver a lavish welcome to Canada's new Prime Minister Justin Trudeau at the first state dinner of 2016"},{"comment_id":"401994746592233","commenter_b":"I haven't done any unlawful thing at all not that big too get my ass in trouble but I get tired of how they treating everyone","commenter_a":"I don't believe they should have their guns taken away. Their are some good cops haven't seen it with my own eyes but, their are some. I want to know why they so scared now. I know their was a dog in this case but, what about the other case where people don't have are unarmed and the officer fears for his life. Cops are pussies now a days this shot didn't happen this often just a few years ago","post_message":"This story is as appalling as it is tragic. The Cop Logic and pure stupidity of this officer is staggering. I still can't wrap my head around it. Yet another case why some people suggest police should be unarmed.  Read more: @webpagelink Via - The Free Thought Project.com <-- (y)"},{"comment_id":"1267659423273512","commenter_b":"JUST SHOOT THIS BITCH==PLEASE.","commenter_a":"SOMETHING TO THINK ABOUT -- do you know that Hillary will be bringing into the USA thousand of Refugees and Illegals just within the first year. ISIS has told the US that they will be sending in ISIS men and Rascal Islamic's in with them. Do you want to keep your family safe from the Radical Islamic's and the Illegals along with the threat of Sharia Law . Also the threats that the BLM has made to all Americans and Hillary is behind them also. Then you need to put your family first and vote for TRUMP . Because if you vote for Hillary you might just as well kiss your ass and the USA goodbye. We need to take our Country back Hillary has already proven that she is trying to destroy us. Don't forget our men in Benghazi and all the Email scandal and the Clinton Foundation . ...","post_message":"It's even WORSE than you thought!! @webpagelink"},{"comment_id":"1027522093954929","commenter_b":"And she REALLY makes Alaska look like it's full of idiots. How else did she get elected Governor in the first place?","commenter_a":"And to think that was John McCain's pick for VP. Embarrassing.","post_message":"This one is a CLASSIC."},{"comment_id":"1676343909290795","commenter_b":"I wish these other stories would come out! I read another one about a guy she accused of hacking her account and he said he would pass on all his emails etc to Trumps campaign guys lawyer. I think this chick is unbalanced and has issues","commenter_a":"You idjits are just gonna love the hell out of it when we burn this BS Republican party to the ground if a hijacking takes place at the convention in Cleveland. Tired of this party bending over and letting Obama drive deep, then talk about conservative values during the election. If Hillary wins this, look in the mirror. #TRUMP2016.","post_message":"\"We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,\" Katie Pavlich said. \"This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.\""}]
