[{"comment_id":"595052750663656","commenter_b":"So RACIST I used to really like her. Now o can't stand her..","commenter_a":"And we don't want to hear you talkm","post_message":"THE VIEW’S Whoopie Goldberg To Co-Host: “This Is Why Black People Don’t Wanna Talk To White People” [VIDEO]"},{"comment_id":"1238390432847651","commenter_b":"Shut up Head","commenter_a":"THE FACTS ABOUT MUSLIMS ------ MUSLIMS are not here to assimilate. Muslims have NEVER assimilated to any society. ... THEY COME TO: ... * Force THEIR\" traditions, beliefs & political system upon us. * Delete our Traditions, Beliefs, religions & political systems. TECHNICALLY SPEAKING: Islam is NOT a religion. Islam is a \"political ideology/government\" hell bent on erasing all OTHER religions & ruling the world. Islam is hell on Earth... Eradicate this so called religion. SPREAD THE WORD, COPY & PASTE!!","post_message":"Seven civilians, including three women and a child, have been beheaded by suspected ISIS-linked militants in southern Afghanistan."},{"comment_id":"10152969085332623","commenter_b":"Lock up your wives.","commenter_a":"Filling out that trophy case.needs that one for the set!lol","post_message":"Tiger Woods has entered to play in next week's Wyndham Championship in Greensboro:"},{"comment_id":"10154774250570575","commenter_b":"He is the ugliest woman I have EVER seen!","commenter_a":"He is a women himself","post_message":"LOL..."},{"comment_id":"1182572491799444","commenter_b":"Mj we are talking about the ones that come here and are here illegally. You became a marine and I bet you did it the right way. Now we have a big problem with terrorist that are sneaking into all the countries. Sorry but we have to take care of all Americans first. You have to admit a country can only hold so many. Thank you for your service I am a vet myself so are my son and daughter.","commenter_a":"All these racist comments and generalizations. You should all be ashamed. I am cuban and came to the US. Im sure not many of you can say the same but i actually benefitted from government programs. I served our countries military as a marine, i hold three different degrees - accounting, finance and im a registered nurse- sonif an immigrant is taking your jobs then you didnt take full advantage of what the US has to offer, no just arrived unprepared laborer will ever take any of thoae jobs from me. I love thia country but i hate people like you that put down immigranta that only want to make a better life for themselves and family. You are whats wrong with the US today!","post_message":"Right?"},{"comment_id":"10154097450244641","commenter_b":"She legally can't give consent if she was drunk so it would still be considered rape......","commenter_a":"\"The alleged perpetrator initially told police that the sex act was consensual, but the girl told them that she had no memory of it\". She is suing although she doesn't know if she consented. I wouldn't be surprised if she had consented when she was drunk. This isn't your average \"She was raped. Case closed\" case. She shouldn't drink like an animal and have sex like one and then sue someone...If you can't handle yourself when you drink, you shouldn't drink! At 16 it is illegal to drink alcohol, so she should be charged as well for her own offense.","post_message":"The court dismissed the charge because unconsciousness and intoxication are not mentioned in the state's forcible sodomy law."},{"comment_id":"10153221769812894","commenter_b":"Bitch u jealous","commenter_a":"I think this is wrong she was not a president she did some great things yeah but to change it from what it is is in my opinion just wrong see this is what's wrong with people they vote for stupid shit like this but don't vote for education or something we really need Gosh America where are your priorities????","post_message":"Harriet Tubman Wins Vote to Replace Andrew Jackson on the $20 Bill"}]
