[{"comment_id":"10150802483299999","commenter_b":"Takes one to know one.","commenter_a":"Takes one to know one!","post_message":"Ted Cruz called Donald J. Trump a “pathological liar\" and a “narcissist at a level I don’t think this country has ever seen.”"},{"comment_id":"10153332297102061","commenter_b":"What's racist about putting Americans protection FIRST from illegal alien Mexican criminals and potentially ISIS infiltrated refugees?","commenter_a":"Trump is a racist piece of trash. He needs to just step down and hide for a few years","post_message":"TOP STORY: Trump rally draws hundreds of protesters in Bernie Sanders' home state of Vermont: abcn.ws/1JxW5UZ -- see more on GMA..."},{"comment_id":"1704753069786736","commenter_b":"THEY SHOULD BE TAKEN TO GITMO NEVER TO GET OUT!","commenter_a":"Need to be hung by the balls","post_message":"If you were in charge, would you have these deported back to where they came from? @webpagelink"},{"comment_id":"10153161231757411","commenter_b":"She should have thrown herself out the window!","commenter_a":"Saven Haven laws.... she could've just walked to the nearest church, hospital, police station etc and said \"Here\" as she handed over the baby and walked away ..... so heartbreaking !","post_message":"Woman charged with killing her newborn baby, after throwing it out of an 8th floor window in Chicago's Uptown neighborhood. Full story: @webpagelink"},{"comment_id":"10154422800373132","commenter_b":"These women are smart?? Lol OK.","commenter_a":"This show is a flake need to be cancel asap.","post_message":"That's quite the family heirloom, Kim Kardashian West. (via PeopleStyle)"},{"comment_id":"10153050457656037","commenter_b":"Oh poor thing she cant make her 10,000 a month rent and shes too good for an average joe apt what a predicament and if its not acting or showbiz im not working they are all the same","commenter_a":"Come over to my house free rent plus all the free SEX you can get x10 =!","post_message":"66-year-old actress #DianneWiest, who begins previews Tuesday for off-Broadway production Rasheeda Speaking, told the New York Times she is facing money issues due to a lack of high-paying work."},{"comment_id":"10153010169898984","commenter_b":"Truth or not, IMPEACH him now. He is not good for America or for the American people.","commenter_a":"He's another Teflon Politician!!!! Makes no sense!","post_message":"[Best of 2014 Compilation] Back in Feb. 2014, Steven Seagal had some pretty harsh words for Barack Obama. Surprise! There are actually some actors in Hollywood who don't follow the party line..."}]
