[{"comment_id":"556485904539702","commenter_b":"Will her top fall off?","commenter_a":"What about the Blonde girl on the right? I didn't see anything unusual about her.","post_message":"TAKE A CLOSER LOOK A THE BLONDE GIRL ON THE RIGHT..."},{"comment_id":"10154162076211943","commenter_b":"'@username IF 60 % of conservatives and church goers stay home and do not vote. She will win. In 2012 they did not want to vote for a Mormon. SO they allowed a muslim sympathizer to stay in the White House.","commenter_a":"Lold she will just put it in Chelsea's name......","post_message":"The Boston Globe Wednesday demanded that Hillary Clinton shut down her family foundation if she wins in November because the entity 'will always look too much like a conflict of interest for comfort.'  'The Clinton Foundation is also clearly a liability for Hillary Clinton as she seeks the presidency,' the newspaper said in an editorial. 'The foundation should remove a political  and actual  distraction and stop accepting funding.' - via Newsmax"},{"comment_id":"10157168676140293","commenter_b":"Get off it already. There are bigger issues in our country to deal with such as gun control, racism and all these shootings, immigration, abortion, same sex unions, and the list goes on. Not whether or not she used the same words as our current first lady or not. I don't care if she copied the whole speech word for word as long as he can put our country in better shape than out current president and first lady.","commenter_a":"Not her fault...She just read what they gave her.. Don't blame her...","post_message":"Melania Trump's speech last night at the 2016 Republican National Convention is now the subject of a plagiarism controversy.  READ why some are saying some of her words were lifted from the current First Lady:"},{"comment_id":"1732772313625197","commenter_b":"Screw those DUMBASS muslims Go to Jail,, Go to Hell,,, Go back to the desert,,,,, JUST GET OUT OF OUR COUNTRY !!!!!!","commenter_a":"If muslims want to live here then they must adhear to our laws, period. If they don't, they can move on to an islamic country..","post_message":"Muslim Woman Refuses To Take Off Head Scarf In Court, So No-Nonsense Judge Does THIS    In our country you have to follow the laws of our court. If not,  suffer the consequences.  Do you support this no-nonsense judge?"},{"comment_id":"10153815226441636","commenter_b":"'@username, I think you and @username are on the same side..","commenter_a":"Western propaganda won't stop! Imagine of a situation if the coup would succeeded?! It would be worst than Egypt, killing of thousands in one night!","post_message":"Warning: graphic mages"},{"comment_id":"10154339068600399","commenter_b":"'@username keep drinking the kool-aid, Ms. Deplorable.","commenter_a":"As Trump himself is a serial philanderer, I can't fathom how he figures the presence of Gennifer Flowers would hurt Hillary. To me, it just proves that the Great Orange Misogynist sees women as pawns and does not hesitate to try to use them to hurt each other. He is the textbook definition of a male chauvinist pig.","post_message":"'If dopey Mark Cuban of failed Benefactor fame wants to sit in the front row, perhaps I will put Jennifer Flowers right alongside of him!'  Cuban is the leading skeptic when it comes to Trump's claims about his wealth."},{"comment_id":"978112395570641","commenter_b":"Did all Muslims commit those crimes ?","commenter_a":"It's disrespectful not all Muslims are terrorist or bad people it's in terrible taste it's like me driving around with a plate that says fgirlscouts just cus one gave me the wrong cookies","post_message":"A personalized license plate in Minnesota which read 'FMUSLMS' has received condemnation from many, including the governor. Read more about how and why it was issued: @webpagelink"}]
