[{"comment_id":"10155232882540093","commenter_b":"I'm speaking about illegals, from 3rd world countries coming over our border and infecting the liberals who love them with diseases. There is a reason the government won't allow the American Citizen know where all those illegal kids and familes went to in OUR country. I'm sure the CDC would show there is a correlation between this outbreak and where these illegals settles. Look to those liberal states that have santuary cities.","commenter_a":"Funny we had nothing like this going on until illegals flooded our border.","post_message":"For many conservatives, resolving issues of faith and science can be tricky. What excuse do Democrats have?"},{"comment_id":"997010993718412","commenter_b":"Islamic Terrorist, go home, stop trying to change the U.S.A.","commenter_a":"No true American is safe as long as Islam is allowed to exist in our nation! We true Americans must unite against this plague and the liberals who allow them to destroy our lives and wipe them from our nation so we can ensure the safety and security of our nation and the American people!","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack.  He is a hero, and will always be remembered as so.  Can we get 150,000 'LIKES' for this brave boy?"},{"comment_id":"1302575163172066","commenter_b":"'@username and why isn't Hillary in jail right now? Oh yeah, dirty politics.","commenter_a":"He's a fraud. Last night he said he would (be able to) release his tax returns if Hillary released the emails. So according to Trumb...HE CAN RELEASE HIS TAX RETURNS IF HE WANTS Period","post_message":"“If not paying taxes makes him 'smart,' what does that make all the rest of us?”  - Hillary Clinton"},{"comment_id":"1655285394531583","commenter_b":"Salty tears are most delicious. Is it January yet??","commenter_a":"A BIG thank you to the 53% of American registered voters who chose NOT to vote; because of YOU and only YOU, Donald J. Trump will be our next POTUS.","post_message":"This is the real reason Barack Obama is going against Vladimir Putin, two weeks before he leaves. This is what the mainstream media won't tell you. Make sure every American knows the truth."},{"comment_id":"1128964310481999","commenter_b":"Dayton Huebner thank you for proving yet again that one can't cure stupid or open a closed mind. Just once I wish people who are still stuck in the 50's definition of communism would educate themselves. You aren't even close.","commenter_a":"I've never contributed any financial assistance to a political campaign before. Couple days ago, I did, and it went to the campaign of Bernie Sanders. I don't usually trust politicians, and I don't ever remember being as excited as I am today about a candidate running for the White House. Bernie Sanders has not only earned my vote, but also my contribution to his campaign. Bernie Sanders has raised millions of dollars from small contributions from middle-class, ordinary families, unlike most politicians that go to their Wall Street buddies to beg for big cash donations. Bernie Sanders doesn't flip-flop on issues like most politicians do, his message was the same back in the 1990's. You can youtube it, it's incredible how honest and passionate he is, and has been about the need for our government to work and represent all Americans, and not just those at the very top. I ...","post_message":"In 1944, President Franklin D. Roosevelt presaged Bernie Sanders by calling for a 'Second Bill of Rights' of an economic nature. They were:  The right to a useful and remunerative job in the industries or shops or farms or mines of the nation; The right to earn enough to provide adequate food and clothing and recreation; The right of every businessman, large and small, to trade in an atmosphere of freedom from unfair competition and domination by monopolies at home or abroad; The right of every family to a decent home; The right to adequate medical care and the opportunity to achieve and enjoy good health; The right to adequate protection from the economic fears of old age, sickness, accident, and unemployment; The right to a good education.  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153437491481130","commenter_b":"Arrogant bitch","commenter_a":"Hilary is a dumb lying bitch!!","post_message":"Sick burn, Hillary Clinton!  Video: NowThis"},{"comment_id":"10152747797741051","commenter_b":"Not a nun no more now she's a sum cause that's what she got","commenter_a":"I thought nuns were sworn to celibacy","post_message":"A nun was rushed to the hospital with extreme pains. When the doctors told her what was happening, she couldn't believe it."}]
