[{"comment_id":"607183962802381","commenter_b":"@username then maybe you should move out of America if you can't handle it. Bye Felicia","commenter_a":"Only reason big cities elect her is Bc they are the low life's looking for their hand outs... Guess what?! You'll be returning your Obama phones soon :) haha","post_message":"We’re in New York with Chris Moody and Vanessa Yurkevich who are talking to voters about tonight’s dramatic election results. Any questions? Let us know! #CNNElection #ElectionNight #MyVote"},{"comment_id":"10158633377120725","commenter_b":"Funny, president Obomba deported more people than any president in us history. Liberals worship him. Trump deports people and out come the crybabies and the protests.","commenter_a":"Why deport the good people? I don't get this ine","post_message":"Advocates believe the roundups and arrests mark a shift in enforcement under the Trump administration."},{"comment_id":"588870771303502","commenter_b":"He should be deported. Hillary should be charged for her recent money scam","commenter_a":"lmmfao","post_message":"Obama is formally being charged with treason. He is getting it from all angles. Now is our time to push. Should Obama serve time for his crimes?"},{"comment_id":"10153805458826337","commenter_b":"Is that chick is his girl?","commenter_a":"Vanessa Delgado where was this ride when we went damn man that looks cool","post_message":"Watch DeStorm Power escape Call of Duty's Black Ops 3 Shadows Of Evil Ride at Six Flags!"},{"comment_id":"10154242244603635","commenter_b":"\"I agree you can still do all those things.\" So then you were making things up before. Glad we got that straightened out. \"I've known of kids getting suspend from school for praying before they ate lunch\" If that actually happened, the school involved broke the law. \"Employees were not allowed to say Merry Christmas it was happy holidays. She told me that.\" Right, because saying \"happy holidays\" is more inclusive. Of course, while not on the job, she was completely allowed to say \"Merry Christmas\" to her heart's content. \"There has been a huge change in this country for the last 25 years of Christianity being slowly phased out by our government.\" Not really. Christianity has never been part of our government, since it's not supposed to be. The first amendment makes that clear.","commenter_a":"I guess this is another step on kicking God out of this country.","post_message":"Indiana city renames Good Friday \"Spring Holiday\" to be more inclusive"},{"comment_id":"10154627182156509","commenter_b":"287877634908162s, as a native (Blackfoot) I encourage you to stay out of 'our' business. Immigrant......","commenter_a":"Does @username cares even a bit about Sanders? All this channel talks about is Donald Trump.","post_message":"This is the decade when Donald J. Trump thinks America was great."},{"comment_id":"10154043389689411","commenter_b":"well.... you can still get it from my throat and eat it eh? #NoWaste Stop world hunger lel","commenter_a":"Robert Pavle Dulić how my life will die prob. lel","post_message":"His last words were 'Watch this'"}]
