[{"comment_id":"10153203722519614","commenter_b":"You must talk a lot huh? I said NOT ALL Pitts... Damnnn women take a deep breath. Move on peace out, relax.","commenter_a":"Another Pitbull attack! Unfortunately we all probably knew this was the case even before reading the story. I'll be shouted down by Pit defenders as is their norm, but I don't care. No other breed is killing other dogs and humans like this, and this breed needs a re-set NOW.","post_message":"A French bulldog puppy that died after being attacked by another dog while in the care of a Petco-owned dog-boarding facility has prompted calls for #justiceforboggs.  The Pooch Hotel Hollywood representatives initially told the dog's owner that Boggs was taken to a vet as a precaution after an altercation, according to the owner's roommate. About 45 minutes later, an ER vet called to say the puppy was in critical condition with a torn trachea and multiple internal injuries.   Described as \"13 pounds of pure joy,\" Boggs was put down as her out-of-town owner listened helplessly on the phone. Now she is considering legal action.  Read KTLA's story here: @webpagelink"},{"comment_id":"662069217316990","commenter_b":"Sorry Bitches !!! Go to jail !!","commenter_a":"Yes!!yes!!!!!yes!!! that;s a shame!! just think?? if that was your mom! or dad????","post_message":"These thugs tortured nursing home patients for an insane reason.  These two are monsters. Let's lock them up and throw away the key.  Do you agree these thugs should do life?"},{"comment_id":"10155091022728734","commenter_b":"Look at these white American men!! Hahahah! Look at these savages","commenter_a":"Disgusting","post_message":"A 37-year-old man has been arrested after allegedly trying to pay a mother to have sex with her seven-year-old daughter."},{"comment_id":"729187697271808","commenter_b":"A Hot MESS","commenter_a":"She should be in jail. Who is protecting this criminal and why.","post_message":"Like if you agree."},{"comment_id":"787010171427640","commenter_b":"so much for tolerance","commenter_a":"I'd of accepted her resignation effective right then!","post_message":"Citing \"separation of church and state,\" the councilwoman resigned.  What she did almost immediately afterwards is raising eyebrows."},{"comment_id":"1055977171151281","commenter_b":"What do you expect from this Muzzie piece of shit.","commenter_a":"...and what did Obummer fight...Oh I know...golf par...didn't happen !","post_message":"***PATRIOT ALERT*** \"It is the inescapable duty of the Congress of the United States today to censure President Barack Obama for casting doubt on the sacrifices and motivations of the Americans who fought the Second World War—on the eve of Memorial Day, no less.\""},{"comment_id":"1205517149514372","commenter_b":"Go away, Racist, Tax Evader, Liar, Sharkton! No more White House Visits! Hopefully Sharkton and Hillary share the Big House soon!","commenter_a":"Loser!","post_message":"Rev. Al Sharpton warned that \"all that many of us have fought for all our lives is at stake\" following Donald Trump's victory in the presidential election and vowed that \"we are not going down without a fight and Donald Trump needs to know that.\""}]
