[{"comment_id":"10153143510309575","commenter_b":"That's a woman?","commenter_a":"Good","post_message":"An Indianapolis mother was sentenced to 60 years Friday in connection with the death of her 2-year-old daughter.  In January, she was found guilty of murder, battery and neglect of a dependent."},{"comment_id":"10154096555057452","commenter_b":"@username Hillary lost, get over it.","commenter_a":"This man needs to be brought up on charges of treason! He's against his own country and has sold his soul to the devil. How can he take an oath to uphold and defend this country and the Constitution when he doesn't even know what it says?","post_message":"President-elect Donald Trump tweeted that China should keep the U.S. Navy drone they seized in international waters.  China has already agreed to return the drone after the United States objected to the seizure."},{"comment_id":"1172821626098535","commenter_b":"She needed to be shut down 20 years ago!!!!","commenter_a":"What kind of a statement would you expect from somebody as stupid as she is. Her brain is lacking in intelligence","post_message":"Whoopi Goldberg got shut down."},{"comment_id":"10156224607550354","commenter_b":"Thought she was an illegal immigrant.","commenter_a":"Is it any surprise she is black","post_message":"The Obama Administration continues to deny the food stamp fraud crimewave exists.   Instead, it continues to balloon the already exploding program. Check out the numbers..."},{"comment_id":"1108095542598003","commenter_b":"@username please lady shut the hell up!","commenter_a":"O'Reilly won't stop spewing rubbish. He expected Obama to make same mistake like Bush and Blair by drafting thousands of troops to Syria like Iraq. If Obama has made that misstep, more than a thousand of finest American soldiers would have been killed there by now. Bill needs to be grateful to Obama by not being a blood thirst. There are more than 12,000 gun violence related death in America annually, he won't even address that. Funny old man!","post_message":"\"There's no question the Obama administration's greatest failure is allowing the Islamic terrorist group ISIS to run wild.\"  Bill O'Reilly criticized President Obama's response to the terror threat, adding he doesn't \"define the ISIS threat accurately.\""},{"comment_id":"1342320752468340","commenter_b":"Happy to see a change in the Mayor's house! See ya!","commenter_a":"if first lady gets this, what can common man expect,...","post_message":"The mayor said she was merely expressing happiness for \"change in the White House.\""},{"comment_id":"1147435038611171","commenter_b":"Really then why are they successfully managing to pay this in states,who have adopted the 15.00 an hour wage. Stop the lies. The people on top are only concerned with their grossly extravagant life styles. It's time to say enough is enough! No one is buying this line of crap anymore pay people a damn wage they can live on!!","commenter_a":"just read poll conducted....sample of just over 3,000 small business owners with 25 or less employees.....67% said they would sell out if could receive a purchase price of 20% loss of amount of capital invested.....wow.....would sell out if offered 80% of capital investment, going concern.....\"going concern', a reference to business in operation.","post_message":"He doesn't say it but a $15/hour minimum wage will crush many restaurants. Even higher end restaurants."}]
