[{"comment_id":"1325820547439790","commenter_b":"I would've knocked this old bitch out, no joke @username","commenter_a":"\"If you don't know the language learn it \"she says.........ok .....maybe this old woman should re-learn her own language but properly because......you're a nobodies......isn't quite right and \"just because you come from another country it don't make you nobody\"....what does that even mean? Double negatives in sentences and conjugation the verb \"does\" wrong,,,,,smart woman yup","post_message":"This woman's racist rant just got her banned by the mall for life."},{"comment_id":"1528246223862069","commenter_b":"@username Pink pussy bow","commenter_a":"I am so glad that someone finally said all of those things directly to her smug, lying, corrupt, evil face!!!! That was awesome! All of us \"deplorables\" wish we could have the opportunity to do exactly the same thing!","post_message":"A notable percentage of voters changed their mind on Trump's attitudes toward women after the latest scandal."},{"comment_id":"650574988427913","commenter_b":"Marco Judilla bwahahahahaha","commenter_a":"Michelle Balisado","post_message":"Ewwwww."},{"comment_id":"10153694817752293","commenter_b":"All they have to do is ask and I'd let a nurse snap all the dick pics she wanted.","commenter_a":"And her name is Johnson ....","post_message":"Police discovered a photo and video on the nurse’s laptop."},{"comment_id":"1746481058744968","commenter_b":"Get out of here","commenter_a":"Traduction: Our thoughts are with the people of ISIS","post_message":"Our thoughts are with the people of Aleppo"},{"comment_id":"10154877505644351","commenter_b":"Build it electrify it arm the wall with automatic weapons cameras night vision electrify deep into the ground to kill tunnellers pass new deportTion laws make it a felonie criminal act to border hop punishable by years in a very bad prison","commenter_a":"His whole campaign was based on building a wall!! Of course he should, we need secure borders!!","post_message":"Thoughts?"},{"comment_id":"491174087737551","commenter_b":"Muslims offend me. Ban them from the U.S.","commenter_a":"BS!","post_message":"Muslims Want to Change Our Nation and Obama is letting them..."}]
