[{"comment_id":"10154016611014087","commenter_b":"I agree but Jill can't win. It'd be impossible. So Hillary because of the Supreme Court","commenter_a":"\"The dems candidate is a disgusting violent criminal who should be locked up\" - every republican. \"The Republicans candidate is a disgusting violent criminal who should be locked up\" - every Democrat. \"You both are right\" - every sane person in the country #jillnothill","post_message":"Minnesotans have not voted in a Republican at the presidential level since Richard Nixon's landslide victory in 1972."},{"comment_id":"921846451264234","commenter_b":"Hey al sharpton you and the guy next to you with the dorkey looking glasses on why don't you preach for colored people to be good instead of hate or is it because your so friggin stupid . I never realized that years ago back when you were a fat boy some one tried to kill you I guess your were spared so into the future you could spread your hate .","commenter_a":"Pay your taxes Deadbeat ! plus penalties, plus interest, You will when Trump takes over !","post_message":"\"...offensive and insulting.\""},{"comment_id":"10154800990580575","commenter_b":"Lock her up.","commenter_a":"Terroristic Threat","post_message":"This Has Got To Stop..."},{"comment_id":"10153454248817377","commenter_b":"That is very wired how has Trump got millions more votes than Lyin' ted? Why does Trump almost have a 290 delegate lead? Why Has Trump won most States? Why does Trump only need 53% of remaining delegates to get to 1237 delegates and Lyin' Ted need all but 50 delegates or 92% of the remaining delegates? You may also want to got to real clear politics and recheck your poll.","commenter_a":"Contrary to the media narratives -New York is not the center of the Country - so, It is not a big deal to win your home state. The cheer leaders want other Northeastern States to fall in line behind New York. Conservatives believe that the voters in other Northeastern States have a mind of their own. This is also not a big deal win for Trump because of the all the votes cast for both the Democrats and Republicans running in the NY Primary, only 20% of the Vote went to Trump, even with his, so called, big victory... Which makes it clear that no Republican running is likely to win NY in the General Election. So - this Primary has very little significance for who should be the nominee.","post_message":"Donald J. Trump on New York Primary win:"},{"comment_id":"10153354138131680","commenter_b":"Any evidence statistically of that. Or is that what you think as a HRC supporter. Also I voted for Obama and I support Sanders this election.","commenter_a":"Her decision is very unpopular in Hawaii. Hawai'i Democrats are Obama Democrats. I would expect that she will face a primary challenge as a result.","post_message":"\"I’ve decided I cannot remain neutral and sit on the sidelines any longer.\""},{"comment_id":"566696260200553","commenter_b":"They can go now","commenter_a":"Hope she goes","post_message":"It appears Bill and Hillary Clinton are making plans to flee the country to Qatar in the event Donald Trump wins this election."},{"comment_id":"1387168331361699","commenter_b":"its always the ugly chicks that hate trump... wonder why. lol","commenter_a":"PLEASE HE ISN'T THE PRESIDENT ANY MORE N PEOPLE STILL TALK SHIT. HE N HIS FAMILY WERE THE BEST","post_message":"America's fighter pilots have had enough. They say Barack Obama is helping the Islamic State group, and they have the evidence to prove it... Do you think that the president is helping our most hated enemy?"}]
