[{"comment_id":"10154689577603812","commenter_b":"He also has many lawsuits in the 80's and 90's for discrimination against blacks and people of color.","commenter_a":"TRUMP STOOD UP FOR BLACKS AND JEWS: About 20 years ago the rich elites ran Palm Beach and wouldn allow Jews and blacks to use the golf and country club facilities. When he bought Mar-a-lago, MR. TRUMP WENT TO COURT TO END THAT DISCRIMINATION, won in court and forever changed how minorities are treated in Palm Beach. That THE REAL Donald Trump. What has Hillary or ANY politician done? @webpagelink","post_message":"A potentially record-breaking gap between two groups marks one of the most striking elements of preferences in the 2016 presidential race: college-educated white women for Hillary Clinton vs. non-college white men for Donald J. Trump."},{"comment_id":"1058553324165678","commenter_b":"That's it women take everything, soon they'll be complaining about not competing against men in the olympics, #equalityformen","commenter_a":"Yea thats cute... but look at developers these days... 99% are men. you wouldnt be on facebook talking crap right now without men.","post_message":"Margaret Hamilton was the lead flight software designer for Project Apollo. Just 31 when it landed on the moon, and her code has been credited for preventing an abort of the mission.  #womenyoushouldhaveheardof"},{"comment_id":"1065496103473179","commenter_b":"J.K. needs to mind her business.","commenter_a":"WOW! She shut it down! OMG! Trump is backing down because a writer...no wait! This article isn't about the writer...it's not about Trump. It's about Pierson. No wait, it's about a writer comparing to one of her make believe characters. Jesus, if your going to attack; pick an opening paragraph and stay on topic. If you can't do that...atleast get the headline to reflect the topic...","post_message":"Just 5 words  and they say it all."},{"comment_id":"10153304044791336","commenter_b":"Hope they show up in mine, I'll send them to hell.","commenter_a":"Please study these faces they could turn up in your neighborhood","post_message":"The five Taliban leaders traded a year ago for Sgt. Bowe Bergdahl could be free to travel as early as Monday as the terms of their supervised release are set to expire."},{"comment_id":"10154607123003984","commenter_b":"Get a fucking rope around that sorry bitch's fucking neck. Treason is punishable by the death penalty!","commenter_a":"So why aren't we hearing this on all the news channels? This is serious enough that it should be out there! Why are they even allowing her to run for President?","post_message":"Hillary has dodged this way and that on Benghazi, hoping her lies never caught up to her.  But they just did in a huge way.  A high-level, bombshell email was just uncovered by a watchdog group, and it PROVES beyond a doubt that she left those brave men to die in agony, knowing full-well she had a chance to save them. How sick."},{"comment_id":"912811708762070","commenter_b":"Carole finally you sound like a smart girl see you're not an Idiot after all. I like that kid Rubio. send all illegals home including Obama. By the way carole you look like the nurse who use to work for me she was an idiot but she was nice to my patients.","commenter_a":"Since voters usually vote for charisma instead of experience and intelligence, I would expect Rubio to be the greatest challenge.","post_message":"We’re now a little more than a year away from the 2016 presidential election and Hillary Rodham Clinton, long-time Democratic front-runner, has set her sights on the Oval Office. Who in the potential Republican field can beat her? Take our poll. @webpagelink"},{"comment_id":"10153444924104312","commenter_b":"Because it would cost pharmacutical companies lots of money if they didn't have cancer and other illnesses. Basically, all it is is reducing the amount of acid you put into your body from drinking soda, etc. They even make stuff you add to your water to alkalize it. Things like soda, obviously, and even milk although it is alkali in the container, once ingested it turns acidic and wreacks havoc on your body. Lemons, albeit acidic on the outside actually turn alkaline once ingested. You can actually look up guides to acidic and alkaline type foods. If you go to a Walgreens, health store, or wherever and pick up a roll of test strips in the health aisle, you go home, pee in a cup/container, dip the test strip in and look on the chart to see how much acid is in your body, then you take the steps necessary ...","commenter_a":"Want the cure? Eat right and use alkaline test strips until you test as alkaline as possible. Cancer feeds off the acid in the body, the more acidic you are, the better chance of the cancer spreading. If you are alkalized, cancer has nothing to feed on.","post_message":"A young woman has become the first person in the world to give birth to a healthy baby using ovarian tissue that was removed and frozen when she was still a child."}]
