[{"comment_id":"613869622133977","commenter_b":"She wants to, if you see the full speech, it is quite clear.","commenter_a":"I didn't vote for Angela Merkel but I have to come to her defence. I don't believe her aim is to discriminate anyone. She is speaking about \"Vollverschleierung\" which means to completely cover the face. I don't think she wants to ban all veils.","post_message":"Elizabeth Plank explains her opposition to German Chancellor Angela Merkel's proposed veil ban."},{"comment_id":"10152938707421130","commenter_b":"So did God fall of his throne and let Obama take over until he's better . I think not Obamas words are and have the hissss of a ankle butting supreme.","commenter_a":"I agree with the president. BB is a dick","post_message":"President Barack Obama tells HuffPost that he dismisses Israeli Prime Minister Benjamin Netanyahu's backtrack on Palestinian statehood."},{"comment_id":"10154681794980329","commenter_b":"@username Cringe worthy.. Sounds like a super basic bitch thing to say lol","commenter_a":"As a 6 foot tall lady who is all leg, YAAASSS, SEND THEM ALL TO ME.","post_message":"\"I might keep the jeans for fun now,\" one recipient told BuzzFeed News."},{"comment_id":"10153532246695779","commenter_b":"She looks ugly with that hairdo","commenter_a":"This was a beautiful version! She added her touch yet kept the timelessness of this classic in tact. Bravo","post_message":"Sia has covered the Nat King Cole standard \"Unforgettable\" for the upcoming Finding Dory the long-awaited sequel to the Pixar hit Finding Nemo. Watch her debut the track below, during an appearance on 'The Ellen DeGeneres Show.'"},{"comment_id":"10154130637278352","commenter_b":"I'm positive with all the comments you got some backlash lol, but keep in mind they're fucking disgusting bitches ha ha ha ha","commenter_a":"There's nothing wrong with breast feeding, but this is disgusting to put your almost 4 year old on the boob.... Want your child to drink your breast milk? invest in a pump....","post_message":"Mother defends breastfeeding her three-year-old son claiming cows' milk is bad for children as she encourages more women to feed toddlers this way"},{"comment_id":"10152857531566491","commenter_b":"Dustin I spelled behaviour perfectly fine. Only AMERICANS spell it your way. And that's not saying much","commenter_a":"WHAT?! maybe influencing spoiled, childlike behaviour!","post_message":"Kanye West is on TIME's list of the world's most influential people #TIME100 @webpagelink"},{"comment_id":"796247023857405","commenter_b":"Her mouth is perfectly formed for Donny DOUCHEBAG ...","commenter_a":"DISGUSTING human being !!","post_message":"This woman is a disgusting POS!"}]
