[{"comment_id":"10153540575624411","commenter_b":"with Californias massive extreme drought, its like a match head waiting for a strike anytime any place.","commenter_a":"accidents happen anywhere why blame beautiful California. Nothing like California in this whole WORLD!!!!!!","post_message":"Watch: Huge forest fire sweeps highway in California"},{"comment_id":"10153218585709614","commenter_b":"You're right .... She probably knew he wouldn't leave his wife ... She needs death penalty ....","commenter_a":"Her \"married boyfriend\".... So 1 baby couldn't keep him, she needed 2??","post_message":"This 3-week-old baby, kidnapped and discarded in a trash dumpster, was the innocent pawn in an \"evil\" woman's elaborate plot to convince her married boyfriend that she had given birth to his twins, police said.  Giseleangelique D, 47, of Thousand Oaks allegedly sought out young mothers under the guise of a charitable organization looking for women with 1 to 2-month-old infants to assist.  That's how D found Eliza Delacruz, police say. She allegedly stalked the infant's mother and then had a co-conspirator snatch the child. Three other people were also arrested in the alleged plot, which includes an attack on another mother and child in El Segundo.   What investigators say they can't figure out is why 3-week-old Eliza was killed.  Read KTLA's story here: @webpagelink"},{"comment_id":"10153176859780667","commenter_b":"Yep..that's what it comes down too. Ungrateful brat & worse money hungry parents !!! Deport them now...but demand payment for his education& for being allowed to live in this great land of opportunities !!! Seriously !!!","commenter_a":"It figures about the money ,but they won't even get 10,000","post_message":"\"The school and city officials involved knew what they needed to do to protect Ahmed's rights. They just decided not to do it.\""},{"comment_id":"905085592863011","commenter_b":"I got 8 right","commenter_a":"Yes","post_message":"Let us know how well you do!"},{"comment_id":"919874341467572","commenter_b":"WOW...THAT IS A AWESOME BEAUTIFUL PICTURE...GOD BLESS YOU ISRAEL...","commenter_a":"Beautiful!!!","post_message":"#TelAviv by Chief Eran Yerushalmi  #PicoftheDay #Israel #Beach"},{"comment_id":"10153066527856336","commenter_b":"Please woman go troll somewhere else","commenter_a":"Poor guy","post_message":"Bristol Palin is engaged to Medal of Honor recipient Dakota Meyer – the Kentucky native is credited with saving the lives of 36 Marines, Army soldiers and Afghan soldiers."},{"comment_id":"10154744279541323","commenter_b":"ooh, you bitch you. i wouldn't invite you to your own funeral","commenter_a":"Hillary looked like she could use a shower and some crayons when she slithered out from under her rock last night.","post_message":"\"None are without controversy.\""}]
