[{"comment_id":"532019336988646","commenter_b":"I'm not catching that disease from her","commenter_a":"Fuck that bitch","post_message":"Michelle Obama thinks you should do this instead of going to church.  She is a disgrace. Get her out of the White House please.  Do you agree Michelle is an embarrassment?"},{"comment_id":"782798865146503","commenter_b":"Bitches be bought and paid for once by us and once by Kocks.","commenter_a":"Greedy bastards.","post_message":"This is a prime example of why we need to get big money out of politics."},{"comment_id":"10153329101624087","commenter_b":"Shut em down and bulldoze em!","commenter_a":"HAHAHAHAHAHHAHAHAHAHAH HE HAS 0% CHANCE TO WIN!! WORRY NOT NON- RACISTS!!!!!","post_message":"\"You're going to have to watch and study the mosques, because a lot of talk is going on at the mosques,\" Donald J. Trump said. \"I would hate to [shut down the mosques], but it's something that you're going to have to strongly consider because some of the ideas and some of the hatred, the absolute hatred, is coming from these areas.\""},{"comment_id":"10154140456978256","commenter_b":"Sara Califf.....Illinois doesn't have a taxing problem... They have a spending problem.... Bloated government is Illinois problem.... Too bad the pensioners are the ones who will suffer","commenter_a":"Democrats need to raise taxes to keep Illinois, and Chicago government revenue stream to maintain the bloated government.... Probably need to build a wall around Illinois first, to keep resident's from leaving for other states","post_message":"Election-seeking Illinois Comptroller Leslie Geissler Munger plans to delay monthly paychecks for lawmakers and statewide officials, saying there isn't enough money to pay the state's bills and other services should go to the front of the line."},{"comment_id":"631130463744199","commenter_b":"Obama don't care what \"Our\" Constitution says!!!!!","commenter_a":"unconstitutional","post_message":"Obama said that America wants him to run for a third term, here's how they responded.  What a joke. This is absolutely ridiculous.  Do you think Obama should run a third term?"},{"comment_id":"10153553565406955","commenter_b":"I can't wait until a loonie lib woman gets attacked by a filthy Muslim","commenter_a":"Muslims versus liberals...this is going to be fun.","post_message":"Topless protesters disrupt Muslim conference in Paris..."},{"comment_id":"10157319779090093","commenter_b":"That's because she likes women better!","commenter_a":"Loving wife, he'd boink anyone in a skirt except Hillary!!!","post_message":"\"The biggest problem is that the more he talked the weirder it was that he didn address the elephant(s) in the room.\""}]
