[{"comment_id":"10153796772929411","commenter_b":"They kill civilians anywhere they go. Worse butchers then IS nearly..","commenter_a":"Terrible.","post_message":"US special operations analysts investigated #Kunduz hospital for days prior to the deadly October 3 attack, describing it as a base of operations for a Pakistani agent coordinating Taliban activities, despite despite repeated pleas by the MSF."},{"comment_id":"10153982977694411","commenter_b":"This old bitch is an asswhole ..am sure you are having sex with your boy aren't you?","commenter_a":"go the hell home.. you are nothing but a bunch of bitchers, bellyachers.. shut up and get a life.. stop moaning and groaning and playing the pity card.. there's millions around the world that are worse off than you are.. keep moving until you find where it is Allah wants you.. dang.. are you all stupid ignorant imbeciles? can any Muslims think for themselves or do they all wait on what their God Allah/Poop Francis says.. rub your rosary beads and pray 5 times aday towards Mecca or better yet go there and shut the hell up.. freaks.","post_message":"'We were just standing outside and we all just started coughing and our eyes were burning. We were really confused about what was going on'"},{"comment_id":"163756660695086","commenter_b":"She's unbelievable. I swear she better not get into office. WAKE UP AMERICA!!!","commenter_a":"I think Hillary is channeling Marie Antoinette.","post_message":"Hillary Clinton just landed her plane in Nantucket... Almost immediately after people saw her, this HUGE problem went viral..."},{"comment_id":"10153660392802217","commenter_b":"Some of London does not speak for all of London.","commenter_a":"London didn't care when the rest of the U.K. Suffer so why should we care about london","post_message":"A mad half hour as \"Biblical\" rain hits London."},{"comment_id":"1007314029311396","commenter_b":"You stay where ur at and fight ur own dirtiness.... we dont owe u nothing!","commenter_a":"\"We have to reject any politics that targets people because of race or religion\" For brighter future, Americans can't afford Trump to walk into the Oval Office!","post_message":""},{"comment_id":"865762326792523","commenter_b":"She needs to go home and git her dildo and go for a ride","commenter_a":"I'm sure Netanyahu is ignoring them...","post_message":"Why does the Democratic Party hate #Israel so much?"},{"comment_id":"10153504055809024","commenter_b":"If she is that ugly let her hide.","commenter_a":"It dies offend me that someone would hate women so much to do this to them","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"}]
