[{"comment_id":"10154455424349445","commenter_b":"Tons of them in cod","commenter_a":"I used to see them and had to pick them out of sole filets when I worked at a major New England grocery store fish market years ago.","post_message":"This video will make you squirm.... but the retailer says its actually a natural phenomenon. @webpagelink"},{"comment_id":"10153899931145575","commenter_b":"Wow, I wonder how many high school graduates are up in here!","commenter_a":"Now his voters will get behind the only true conservative in this race, Ted Cruz. This is not good news for Trump.","post_message":"Breaking: Rubio Drops After Florida Defeat..."},{"comment_id":"555063404660130","commenter_b":"That is right stop and look at what separation of State and church really is it was there to protect the church.","commenter_a":"@username is the ideal photocopy/ carbon copy of the fore fathers vision for America dream as a POTUS!!! BenCarsonWin!! GodWin!!! The Operation Heal!!! Inspire!!! Revive!!! The revival had begun, don't be left behind!!! Onward ever, backward never!!!","post_message":"You, Lord, keep my lamp burning; my God turns my darkness into light. (Psalm 18:28) We must not close our eyes when evil presents itself, for we allow darkness to abound -- it is only with open eyes that we can see His truth and calming presence. Revealed in the midst of chaos, He stands beside us as we stand with each other. With Him, together, we will be made stronger. -Ben"},{"comment_id":"551369591720287","commenter_b":"She is a disgrace to every First Lady America ever had, not to mention every woman in America. neither she or her husband know their ass from their elbow.","commenter_a":"They need to be GONE !!!!!!!!","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"},{"comment_id":"10153341236279170","commenter_b":"This guy needs to stay in London. I do not exactly agree with what Pam Geller did, but she was well within her rights. It's just like when the muslims were building their mosque down the street from the 9/11 Memorial. They were within their rights, even though that definitely was the wrong thing and wrong place to put it. Islam has no tolerance and so America should stop being tolerant to Islam.","commenter_a":"So according to the traitor liberals it is fine to offend Jesus Christ but it is wrong to offend Mohammed , only in the bs traitor mind of the socialists this makes sense.","post_message":"If you're one of the people saying we need to rein in the First Amendment so we don't offend Islamists, just watch this VIDEO and know that THIS is what you're trying to coddle."},{"comment_id":"10153295619909384","commenter_b":"I beg to clarify this situation. As we all know, Pelosi has been psychotic for several years. I think the question that should be answered is this: How many blind and ignorant lemming liberals have kept this shameful person in the powerful position she is in, for as many years she has been elected? That is where the real shame lies.","commenter_a":"Since when do you care about Homeland security, Nancy. You who totally have supported all that obama has done to destroy the security of our nation's borders and let millions in including criminals whose own country does not want them. You are a joke and a puppet whose love of our nation was destroyed by your love of power and party. Just shut up.","post_message":"We shouldn't wait another day to remove all doubt to our enemies, to American families and to the affected workers that we will fully fund the Department of Homeland Security. My full statement: @webpagelink"},{"comment_id":"1284879431547513","commenter_b":"ve que no es vara :)","commenter_a":"@username Sergio Boudet lo que hablabamos el otro dia","post_message":"Colorado kept $1 billion away from drug cartels last year."}]
