[{"comment_id":"1152081494853966","commenter_b":"Well if men are allowed to use ladies rooms why didn't he just go in and guard her stall there. Maybe he didn't feel like a mommie that day.","commenter_a":"I don't shop at target, so...no big deal","post_message":"WOW! Father Guards the Door While Daughter Uses Target Restroom..Then This Happens. (VIDEO)"},{"comment_id":"698823633563273","commenter_b":"Well then stop her. Isn't that your job?","commenter_a":"Yes a female Eric Holder,","post_message":"GOP leadership should stop the Loretta Lynch nomination by not reporting it to the floor for a vote. We must reject lawlessness, outright."},{"comment_id":"861148387265123","commenter_b":"Female racist-in-chief.","commenter_a":"-who is she to make that decision, no man has that right - God creates life!","post_message":"What sorts of \"populations\" does it sound like Ruth Bader Ginsberg is interested in \"controlling\" here?"},{"comment_id":"654574044733174","commenter_b":"Forget you Hillary!!!! REMEMBER Benghazi????????? YOU'RE NOT GETTING MY VOTE!!!!! Rot in hell you piece of shit!!!!","commenter_a":"Fuck that Bitch.","post_message":"Hillary Clinton wants the Fox News host's head, but she's not backing down. She is in trouble. Let's show her our support. Can we get 10,000 'LIKES' for this Fox News Host's stand against Hillary?"},{"comment_id":"1275765532466713","commenter_b":"THIS IS WHAT america going to get if hillery elected .. this Muslim imam funded to Hillary clinton campaign.@webpagelink.. have a great islamic future for Americans","commenter_a":"thie is a foto shop pic trump u moron","post_message":"ANY FELLOW JEW VOTING FOR CLINTON IS A DISGRACE TO OUR PEOPLE!"},{"comment_id":"10153053091263984","commenter_b":"HOW ABOUT MOVE OUT OF THE WH!!!!","commenter_a":"all the kids should pack their lunch","post_message":"Alright Michelle Obama, 'Let's Move' on to you finding a new hobby. Preferably something that doesn't involve pushing this agenda on Americans..."},{"comment_id":"1495322403831141","commenter_b":"please God help them find this little man let him be safe please let him go home with his family and friends","commenter_a":"Does anyone know where we meet tomorrow to volunteer to search?","post_message":"KPRC2 Robert Arnold is headed out with a couple of people who are helping with search efforts for Marcus McGhee in Pearland. MORE-->@webpagelink"}]
