[{"comment_id":"10153727755939117","commenter_b":"@username If Trump were a cat, he would be licking his own balls.","commenter_a":"And the Republican leaders of the past, McCain, Romney, and the entire Bush family? They recognize a fraud when they see one and won't even bother attending, endorsing or having anything to do with a bully liberal like Trump.","post_message":"The list of GOP convention speakers includes a bunch of people better known for harshly criticizing Donald J. Trump, in some cases unambiguously pronouncing him unfit for the presidency. They say he's a \"con artist,\" \"narcissist,\" \"bully,\" and \"pathological liar\" whose candidacy is \"a cancer on conservatism.\""},{"comment_id":"10153519290756336","commenter_b":"Good He caught Her now She cannot steal Anyone Elses's Identity","commenter_a":"You are a thief ! .... end of story","post_message":"\"You picked the wrong guy.\" FOX 4 News reporter Steve Noviello confronted a woman who allegedly stole his credit card on camera."},{"comment_id":"10153389361142061","commenter_b":"Lady Gaga, great job.","commenter_a":"Oh Yes She Did!!","post_message":"Lady Gaga absolutely crushed her performance of the national anthem at Super Bowl 50. @webpagelink"},{"comment_id":"10152574431526636","commenter_b":"but its ok for females to tell us how to sit? bit sexist.","commenter_a":"Alright, then women have to stop wearing leggings without a skirt..leggings by themselves looks trampy.","post_message":"Men, here's why you should close your legs on public transport..."},{"comment_id":"10153018351676336","commenter_b":"Disgusts me to see girls acting like this and the bystanders with the cell phones out! Come on now","commenter_a":"As a parent, I would be MORTIFIED to see my child standing there videoing the fight! Doesn't anyone have compassion any more? \"Mean girls\"... smh... it's out of control! We should have evolved beyond this.....","post_message":"A shocking photo appears to show the moment a Texas mother pulled out a gun and pointed it at a high school student."},{"comment_id":"1179451428768183","commenter_b":"Blacks on a welfare leash! also remember the KKK WAS STARTED BY THE DEMOCRATS. the first RUNAWAY Slave tracked down by a Democrat Government and the first legal slave was owned by another BLACK MAN ,, SO WHO YOU VOTING FOR ??","commenter_a":"Bastard, who opened the vault holding our Social Security.","post_message":"Here's the HARD TRUTH about what the Democrat party has REALLY done to the Black community,."},{"comment_id":"510721549087800","commenter_b":"Ok 1. Lets ask ourselves do they want to destroy capitalism answer (no) 2. Will they take the means of production from the capitalist answer no 3. Do they want to destroy the upper class answer no","commenter_a":"The progressives will next demonize God and Jesus then they'll start pushing multiculturalism and diversity so Ireland get ready","post_message":"\"Abortion has been demonized and criminalized in this country and older generations think there's something really wrong of it... but it's something that should be available to people.\""}]
