[{"comment_id":"10153361395611107","commenter_b":"Class on the left, and no class on the right. She is just another, inept, liberal, lying skank. I put her in the samne group with that traitor, Hanoi Jane.","commenter_a":"Better yet , hit her at her cankles. Paul/Trump ... Trump/Paul for America, not the establishment","post_message":"Guess who I ran into? Tune in to @CBS now to find out why I think she should forever be precluded from being potus"},{"comment_id":"571127086402504","commenter_b":"Come on guys, the woman is desperate and nervous. You will see very soon who will come out on top. It's time for some real change.","commenter_a":"Look like this page is also scrambling to save Hillary. It's good to know sanders is getting to her. #feelthebern","post_message":"Bernie and his campaign are misleading voters about what Hillary said."},{"comment_id":"1132568873502832","commenter_b":"Dont know. You went baiit an switch. Its about keeping these men out. Want more? @webpagelink","commenter_a":"To keep men pedophiles out womens bathrooms? Yes. I agree!","post_message":"How does this make ANY sense? Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154358631096943","commenter_b":"Put her in jail with her boss","commenter_a":"So..yeah.. Legit question here @webpagelink/ So yeah can we?? If this were a case involving weed or oil on national historic sites or someone's private lands etc the Feds would be KNEE DEEP in it!! Or at the very least CA's electoral points be split 50/50!","post_message":"This is serious. We are investigating now."},{"comment_id":"10153620760216028","commenter_b":"From the Bible: (who cares about what verse, you know it's in there!) If your own full brother, or your son or daughter, or your beloved wife, or you intimate friend, entices you secretly to serve other gods, whom you and your fathers have not known, gods of any other nations, near at hand or far away, from one end of the earth to the other: do not yield to him or listen to him, nor look with pity upon him, to spare or shield him, but kill him. Your hand shall be the first raised to slay him; the rest of the people shall join in with you","commenter_a":"Quran (2:191-193) - \"And kill them wherever you find them, and turn them out from where they have turned you out. And Al-Fitnah [disbelief or unrest] is worse than killing... but if they desist, then lo! Allah is forgiving and merciful. And fight them until there is no more Fitnah [disbelief and worshipping of others along with Allah] and worship is for Allah alone. But if they cease, let there be no transgression except against Az-Zalimun(the polytheists, and wrong-doers, etc.)\"","post_message":"UPDATE: The death toll has risen to 63 people, with more than 300 others injured. The Pakistani Taliban has claimed responsibility for the suicide attack. BREAKING: At least 52, mostly women and children, were killed and around 150 others were injured when an explosion ripped through a crowded park in the Pakistani city Lahore, a few feet away from children's swings, officials said. @webpagelink"},{"comment_id":"10153259644748984","commenter_b":"Counting the days when that POS Imam con black theologist of hate is out of our WH!","commenter_a":"Can you say\" concealed carry\"?","post_message":"Let's hope police catch this creep and wipe that cocky smile off his face!"},{"comment_id":"1728764820743963","commenter_b":"That lady is just jealous because she is a mean n nasty lady n because she COULDN'T do it she has to be a d-bag....good job Bindi","commenter_a":"People are very cruel. God bless you bindi and your family. You were amazing and your dad was watching you sweetie .","post_message":"Oh no... I'm praying for Bindi Irwin."}]
