[{"comment_id":"10154079570861130","commenter_b":"What do you have against us fat lesbians ?","commenter_a":"He looks like a fat lesbian Neil young.","post_message":"\"...I think Donald J. Trump is gonna win.” --Michael Moore"},{"comment_id":"10153238674498984","commenter_b":"this bitch will have blood on her hands","commenter_a":"good now i have more reasons to cut myself and attempt suicide.... this really set me off ..","post_message":"What she said about \"fat white Americans\" and \"racist white conservatives\" is absolutely sickening... Are you outraged by these comments?"},{"comment_id":"256901098085552","commenter_b":"So don't f with me I am from Louisiana I'll give u he'll and make ur ass cry like a baby are u still running don't say shot to me pat I won't say shot to u u ever meet a woman that hunt a allerigator I don't think so I can't hunt any thing we woman from Louisiana that hunt and fish are strong woman we don't take shot for nothing .","commenter_a":"Same could be said of Obama and his executive pen, but I didn't hear you snowflakes complaining then.....so why now? Because your criminal didn't win?.....boohoo! Get on with life.....you didn't see us doing the crap that is going on now when Obama was president......God help us......for 8 years. Quit crying and get on with it. I think Trump is going to do some great things for this country. Things that should have been done a long time ago......even before Obama came to be. I am looking forward to a better America....go get em Trump!!","post_message":"AMEN! This one is a MUST READ."},{"comment_id":"10153292022111051","commenter_b":"Keep the statue,ignore the STUPIDS !!","commenter_a":"Again, if they don't believe why do they spend so much time removing evidence of God.... I really do believe that Atheist DO BELIEVE in God but don't want reminding that God is Holy and we are not. If God does not exist then sin does not exist, and thus they can live the way they want without worry of sinning...Sad! Our children and our country have paid the price of Atheists and their faithless and evil ideals.","post_message":"Should they have to remove the statue?"},{"comment_id":"10154390572299749","commenter_b":"@username suckers.","commenter_a":"@username Nope....that is all...nope","post_message":"About 400 fen raft spiders have been set free in the UK."},{"comment_id":"542901459225067","commenter_b":"Go Hillary !","commenter_a":"She is honest and I am tired of people accusing her of everything when she has been for the USA since Clinton was President and after that, etc. She loves her country and will be an excellent President. Grow up world!","post_message":"The people of Iowa versus pollsters and pundits. The people win."},{"comment_id":"1339410646123872","commenter_b":"Now I'm calling her a turkey! At least she could've let us see the eggs before she got comfortable again","commenter_a":"Somebody say bugs","post_message":"EAGLET WATCH! Getting closer, it could be any time now! We are watching and waiting as mom (Harriet) and dad (M15) take turns incubating the two eggs. Live video: Southwest Florida Eagle Cam MORE: @webpagelink"}]
