[{"comment_id":"1552829708351782","commenter_b":"Nor do any of you have the full story like I do, so please don't speculate on what you don't know.","commenter_a":"in this day and age, a woman shouldn't lose her life during childbirth, I surely hope there is a huge investigation","post_message":"He was at the wake for his wife and 5-day-old baby when he got word that his sister had lost her battle with cancer. Many of you saw the heartbreaking story on NewsCenter 5 and have asked, “How can I help?” Here’s how: @webpagelink"},{"comment_id":"1338072722922864","commenter_b":"Boooo she's a TRUMPIDIOT!","commenter_a":"This lady knows nothing all she knows 200 million dollars is in her account for sitting there and talking s*** oh my God good job","post_message":"Senator Chris Murphy (CT) asks Education Secretary nominee Betsy DeVos, \"Do you think that guns have any place in or around schools?\" Check out her answer for yourself:"},{"comment_id":"163756660695086","commenter_b":"She's unbelievable. I swear she better not get into office. WAKE UP AMERICA!!!","commenter_a":"I think Hillary is channeling Marie Antoinette.","post_message":"Hillary Clinton just landed her plane in Nantucket... Almost immediately after people saw her, this HUGE problem went viral..."},{"comment_id":"560286244096415","commenter_b":"Conversion to Christianity. Messing with the Germans so the tribes demolished Rome. (Where we get the word vandalism from... The Vandal tribe.","commenter_a":"Hmmm how did greece burn this year...","post_message":"Does this seem familiar to you?"},{"comment_id":"697839387073306","commenter_b":"She should have been arrested months ago!!!! Arrest her now and put her away for good!","commenter_a":"Our Justice Department is corrupt. They will not take appropriate action.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"},{"comment_id":"10155053985253545","commenter_b":"No job, old, divorced, and very ugly ignorant from the inside... She needs a complete make over inside and out and in need of a man You say you know everything can you please direct us to facts ? Post them on here please... @username","commenter_a":"He had 23 years to make his American dream legal no feeling sorry for him sorry illegal is illegal look up the word illegal it doesn't say you get rewarded for doing illegal actions","post_message":"Daniel Ramirez Medina, who was brought to the US illegally as a child but allowed to remain under an Obama administration policy, is suing the federal government over his arrest and detention by immigration agents."},{"comment_id":"10153959018846341","commenter_b":"The problem that Islam faces is that it is continuously moving backwards. Even in the Islamic golden era, the economy was reliant on slaves and infidels. The only successful Islamic countries today are the ones that have massive oil reserves. Muslims living in countries with no resources tent to live in poverty. This is why you always see Muslims migrating into infidel lands but you don't see infidels moving into Islamic lands. I do believe that Islam will dominate Europe. I have no doubt. Firstly the countries will be split into two with one being Islamic and the other being Christian but the Muslims will continue to migrate into the Christian countries because they will be poverty stricken. Because sharia is so retrograde Europe will imminently turn into another failed Islamic state as they have no resources. European winters can be very hard If everyone wants to pray 5 times ...","commenter_a":"unfortunate though, but this is the same way Palestinians are wailing, groaning and moaning everyday yet no one seems to care. Let's not unite in periods like this alone but all the time.","post_message":"The residents of Belgium capital city woke up Wednesday morning to a new reality, on the day after the terrorist attacks that killed at least 31 people."}]
