[{"comment_id":"10154407674347756","commenter_b":"Muzzie lover go eat crap","commenter_a":"key word temporary oh maybe we republicans should go burn a few cities down now too and a few police cars right! Hmnnn oh thats right we like law and order imagine that.. Good things take time go TRUMP go we have your back...","post_message":"A Federal Appeals court Thursday evening ruled against the Trump Administration’s controversial transportation order, upholding a district court judge’s ruling to block the order."},{"comment_id":"1109408939099898","commenter_b":"yaaaassss bitch yasss","commenter_a":"Angela Swartzel Melinda Bailey Mallory Brogli Chelsea Pande Roma Rispoli Kunia Rodrigues Carmel Rae Anne Mellies @username Jackie Smith fucking dyingggg😂😂😂","post_message":"That Voice Over! (Free The Monkey Though)"},{"comment_id":"10152987213175090","commenter_b":"She is a liar!!","commenter_a":"'What difference does it make'!","post_message":"Why don't you want Hillary Clinton to be President? @webpagelink"},{"comment_id":"969471999775996","commenter_b":"You're stupid lady","commenter_a":"yes! Possessing a gun doesn't make you American. Leaving your pride behind for the safety of others does. European countries are proof gun control is effective.","post_message":"Heartbroken and angry. We must act to stop gun violence, and we cannot wait any longer. Praying for the victims' families in Virginia. -H"},{"comment_id":"10154980459782235","commenter_b":"I would suspect it was an operation right out of the Kremlin. If so it's an act of war.","commenter_a":"C span has confirmed it happened and operating right now under the theory that it was an internal routing problem on their end. They advised they will update if they find out anything different happened.","post_message":"What the hell just happened?"},{"comment_id":"485911244932789","commenter_b":"be head her","commenter_a":"Yes , l support our police","post_message":"A woman is suing the police department... over a hijab? This woman broke the law, the police are completely in the right. Do you support our police?"},{"comment_id":"10153618006223721","commenter_b":"But it all depends on your reason to carry. Most women who would carry a knife in their bra wouldn't need it because they can normally defend themselves better than most blokes.","commenter_a":"One more place to put my knife! Sweet. Sometimes I like to carry a couple, one in the pocket, one on the necklace and now a surprise bobbie blade heck yes! Though this was certainly a man's idea as no woman would go \"lets put something sharp next to my breasts and have it not be an underwire. This is going to be a selling point for women's active wear.\" When in the high thigh sheath for when I wear a mini skirt coming out? Not all skirts have pockets you know.","post_message":"Activewear with an extra punch. (via Glamour)"}]
