[{"comment_id":"929207217205367","commenter_b":"It's up to the voters! United we will not let her get away with this! she's another OJ Simpson in my book....","commenter_a":"I sure hope so. This makes me sick. She is above the law. This is so shameful and just so wrong. Unbelievable.","post_message":"Today, the FBI admitted that Hillary Clinton endangered the American people—and confirmed that the worst things any of us imagined about Hillary’s email server were true. FBI Director James Comey concluded that Clinton was “extremely careless” in handling our nation’s secrets. He admitted that no reasonable person could have believed putting these emails on a private server was at all appropriate or acceptable. He admitted that 110 emails on the server were classified at the time they were sent—showing that Hillary not only lied, but knowingly endangered national security as Secretary of State. He admitted that Hillary deleted work-related emails before turning them over to the State Department, despite her claims otherwise. And most shocking, Mr. Comey even admitted that it’s likely foreign governments hacked her emails--and that our adversaries could know critical secrets about the U.S. government because of Hillary’s actions. But when you’re a Clinton, none of this ..."},{"comment_id":"10154796550641509","commenter_b":"Liberals must leave the country !!!!!","commenter_a":"Are you interested in joining the illuminati to be rich and to achieve your desires in life? If yes, Add me and Message me now so I can introduce you to the gate way to success.","post_message":"Experts warn that these labels do not really mean very much and can even be misleading in some cases"},{"comment_id":"10154099091458984","commenter_b":"He is another politician and a big lier as well he cheated in the other debate with Ben Carson he will say anything to get a vote and he will owe a million favors for all the lobbyist sending him,all this money","commenter_a":"Why are people at war all the time with a Democrat or a republican let's change this to U.S. political leaders and vote for a person not a party. They always have to make people take sides and it needs to be changed.","post_message":"With the South Carolina primary right around the corner, Ted Cruz is doing his best to diminish Donald Trump's lead. Cruz's latest attack is getting a lot of attention, and it may cause some voters to ditch 'The Donald.' Is Ted Cruz right about Donald Trump?"},{"comment_id":"10153000605642060","commenter_b":"The way all states should be.","commenter_a":"When purchasing a firearm in a Louisiana gun shop, a buyer will encounter limited procedural barriers. Louisiana is commonly referred to as a \"gun loving state.\" The only necessary requirement for purchase is a valid driver's license, which can prove the buyer meets the federal age limits: 21 for handguns and 18 for shotguns or rifles. There is no gun permit required to purchase a firearm in the state, nor is a gun license mandatory to detail ownership. Registration of long guns or handguns is also not required under Louisiana law. There are no restrictions on long guns in the state; the only areas where an individual cannot carry a loaded shotgun or rifle are on college campuses, or properties that specifically designate the barring of weapons. Areas such as schools, hospitals, municipalities, and places of worship often disallow carrying privileges. It is also permissible to transport loaded long guns ...","post_message":"Gov. Bobby Jindal believes Louisiana law is strong enough to prevent people with mental illnesses, like the Lafayette shooter, from purchasing a gun."},{"comment_id":"10155357191987439","commenter_b":"No thanks in representing the USA. Just another Linda Sarsour.","commenter_a":"Pretty sure this was found to be another muslim playing the victim","post_message":"Muhammad, a lifelong American citizen, claimed in an interview last week that she was detained \"just a few weeks ago\" by U.S. Customs and Border Protection agents. She said she was held for two hours without explanation."},{"comment_id":"10153769957503984","commenter_b":"get rid of her .","commenter_a":"Couldn't have been too quiet, you know about it. She quietly sign with them because old agency smart enough to drop her?","post_message":"Megyn Kelly very quietly just made a huge move that could change everything for her and Fox News. What do you think? Should Megyn stay or go?"},{"comment_id":"1226169560742155","commenter_b":"In other words what you want is to shut her up like Christians have been doing for too long in order of political correctness. And accept this mockery of a gay marriage. All religions in the world are against gay marriage. Its unholy, unatural and discusting and a general majority agree with that. Look at how muslims treat them lol. You wanna be a fruitcake? Fine, but stop throwing your discusting life in normal ppl's faces with ur ridiculous parade of freaks and now want to step into normal familly life of husband and wife. Its not for you. Adam and Eve. Man and Woman. NOT adam and steve! Marriage is between a MAN and a WOMAN. Amen to the sister with enough conviction to stand her ground. This is just the beginning. Her stand has awakened MANY. Its about to get nasty for a few :)","commenter_a":"Kentucky Christians should march for her. Don't remain silent, be there for the sister. Amen","post_message":""}]
