[{"comment_id":"427202340738140","commenter_b":"Pharmaceutical companies cannot profit so much that's why they do not do what they are supposed to do is protect the public","commenter_a":"Lauren Martin","post_message":"This video is from a new documentary The Culture High which looks at both sides of the marijuana prohibition argument."},{"comment_id":"1159189937449759","commenter_b":"WHAT DOES THE OBAMAS AND CLINTONS HAVE TO HIDE FROM THE VOTERS. THEY ALL REMIND ME OF ALI BABA AND THE 40 THIEVES BUNCH OF CRIMINALS DON'T TRUST ANY OF THE CROOKS.","commenter_a":"Gee, funny they can tell who hacked emails showing Democratic corruption but, they have not had any luck finding Hillarys missing 30,000 emails.","post_message":"Whoa!"},{"comment_id":"944125178989101","commenter_b":"Not unless the Bush Administration moonlighted at 7-11!","commenter_a":"That's an easy mistake to make, he thinks the guys that work at 7-11 were responsible for 9/11....sheesh.","post_message":"Donald J. Trump mistakenly refers to 9/11 as 7-11: “I was down there and I watched our police and our firemen, down on 7-11, down at the World Trade Center, right after it came down, and I saw the greatest people I’ve ever seen in action.\" READ MORE: @webpagelink"},{"comment_id":"1263042020429217","commenter_b":"She started the whole thing ...she spit on him and was calling him a n***** ...she even lied and said she didn't even hit him or anything and begged for the video to not be shown.she is also suing the restaurant and this is not the first time she assaulted someone and lied about it .she is scum and a money hungry bitch","commenter_a":"Everybody saying she deserved it, just hope your daughters don't instigate something and get her ass beat.","post_message":"Totally uncalled for!  #WSHH #Oklahoma #JoeMixon"},{"comment_id":"10155378344568132","commenter_b":"As phoney as her boobs...","commenter_a":"That fantasy world u r capable of living in will soon have u filing for bankruptcy Missie!","post_message":"Mariah Carey says she's \"incapable of being in the real world and surviving."},{"comment_id":"982872948473970","commenter_b":"These people are what is wrong with America! I can't wait for them to occupy Canada","commenter_a":"these are the hate american soros funded kids who still live at home and hacve ebt cards and dont pay for health insurance..","post_message":"DEVELOPING: Leftist Radicals in New York City and Arizona launching anti-Trump uprisings...TRUMP PROTESTERS BLOCK ROADS TO PHOENIX RALLY....MORE..."},{"comment_id":"10155131143925389","commenter_b":"Can't deport an American born stupid","commenter_a":"In a Court of law your reporting would be \" hear say \" Sean","post_message":"One of the two brothers suspected of gunning down 12 people in Wednesday’s attack in Paris traveled to Yemen in 2011, where he was in touch with Al Qaeda training camp leaders, U.S. officials told Fox News."}]
