[{"comment_id":"10152600779162217","commenter_b":"How is it funny how we'll let an aeroplane be controlled by a computer, when we all know of the very high general standard of trained pilots we have flying our passenger aeroplanes who are there too? Just thought I'd point out one of the stupidest thing I've ever heard.","commenter_a":"I didn't think it would be long before we had driverless cars. I am a terrible driver so this would suit me right down to the ground.","post_message":"Driverless pods, set to hit the streets of UK cities, are unveiled for the first time. Would you be able to relax and trust technology to take you for a ride? @webpagelink"},{"comment_id":"544768002395182","commenter_b":"No election has ever seen such sore losers! And they were accusing Trump of this type of behavior if he lost.","commenter_a":"what a jerk and pathetic American---","post_message":"He's crossed a line."},{"comment_id":"10155578716975354","commenter_b":"Wouldn't it be nice if if \"christians\" practiced what they preach?","commenter_a":"Good on him, but you know he's gonna die soon.","post_message":"“I think this is the first time in history a leading Middle Eastern religious leader has embraced the forms of popular culture to advance the Christian message of love and hope,” WATCH THE VIDEO"},{"comment_id":"10154558927621323","commenter_b":"Sex is a biological need. If I'm in a relationship, I am entitled to sex. If she won't provide, I can find someone who will. Using sex as a weapon against men is ABUSE.","commenter_a":"Problem is there are too many uptight women out there. Articles like this don't help either. 'Intimacy'. Words like that make sex sound like some mythical state of enlightenment that we are trying to achieve. When the fact is its just some good old hard core fucking. Get all the mind fuck thoughts out your head and get sucking or licking and you'll soon get into it. We've had hard core porn for years now showing us how to get down and dirty with it so stop making a big deal about it. And if all else fails there's prostitutes who can do the job for you so just sub contract it out and let your partner get some for a change instead of walking round like a sex starved idiot.","post_message":"\"Drink is not the answer.\""},{"comment_id":"10153128873081051","commenter_b":"What a crazy bitch that is","commenter_a":"Some people shouldn't be allowed to breed.","post_message":"This man was worried when his girlfriend took off with their baby, but he tried to remain calm. Then he noticed the text messages she had sent him. That's when restraint went out the window and he called 911."},{"comment_id":"10154326726666729","commenter_b":"None... Technically. I do think they may have accidentally drifted into their waters..","commenter_a":"Why did our sailors surrender and why didn't we have any support for our sailors such as a helicopter? Something isn't right here, this stinks like Benghazi.","post_message":"We REALLY wish we didn't have to show you this, but this is what the results of feckless foreign policy leadership look like..."},{"comment_id":"10154185145943132","commenter_b":"Sue happy! These ladies are cracking me up. They have no clue.","commenter_a":"OH so this is how they make a living. Hard work paying off there. Unbelievable.","post_message":"It's always polite to ask permissionjust ask Kendall Jenner."}]
