[{"comment_id":"10153815392947293","commenter_b":"She have bipolar disorder.","commenter_a":"Please be kind when commenting. Even if you don't like her, she is a real human being, who has had significant struggles with mental illness. She has family and friends who are worried and scared.","post_message":"Sinead O'Connor has been found."},{"comment_id":"1078684138859436","commenter_b":"How far out to sea is that wall going to stretch? Must be like that wall in Game of Thrones that can keep all the nasty people from taking to boats. Once Trump develops this wall technology he will make billions selling the idea to Europe and I bet they let him put his name on it in big gold letters!","commenter_a":"There will be no wall","post_message":"Thank you for the incredible amount of support last night- San Jose, California. I love you all - we will deal with the thugs & criminals -- we will build the wall --- and Mexico will pay for it!"},{"comment_id":"10154082976562464","commenter_b":"Build that wall!","commenter_a":"(yawn) No, thanks. I'm voting for Trump, like everybody else.","post_message":"ICYMI: This Amazing Ted Cruz Ad That Came Out A Few Days Ago Is MUST-SEE -->"},{"comment_id":"1444053418948017","commenter_b":"That's why those guys never meet a MULAN their whole life. They could not handle a strong woman anyway.","commenter_a":"He's blaming Mulan for progressiveness and equal woman's rights. Someone thinks we belong in the kitchen barefoot and pregnant.","post_message":"Donald J. Trump running mate Mike Pence slammed the kid's film as the brainchild of a 'mischievous liberal at Disney' bent on causing 'a quiet change in the next generation's attitude about women in combat.'"},{"comment_id":"10152659082871717","commenter_b":"And don't forget daughters who talk back to their fathers. They get stoned to death too.","commenter_a":"Here's an idea: since many want gays executed according to biblical law, how about following biblical law to execute adulterers, pedophiles, fornicators, tattoos, and et al?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1016358938401725","commenter_b":"MONEY !!!!! That's all they care about !","commenter_a":"probably worried about all the money they have stashed in offshore funds they may have to pay tax now","post_message":"'I don't think I've ever wanted magic more.' J.K. Rowling, James Corden and more British celebrities react to the historical #EURef vote. @webpagelink"},{"comment_id":"10153832983220950","commenter_b":"Bitch u just said a bunch of racist shit now","commenter_a":"Yes, he did behave badly but, those two athletes who chose to speak out against the country they were sent to represent, the country that has supported their goals, trained them and gave them the tools they needed to succeed in their sport, should face the same fate as Lochte.","post_message":"Speedo wished Ryan Lochte well, but said it 'cannot condone behavior that is counter to the values this brand has long stood for.'"}]
