[{"comment_id":"10153623259427623","commenter_b":"@username coming here isn't a right. And yes, it is the same thing. Building a wall to keep people who don't belong here out is no different than you locking your door. You lock your door to keep people out.","commenter_a":"If you lock your doors at night then you agree with Donald J. Trump. I expect my government to be at least as security conscious about my country as I am about my family. This is not racism or rudeness, but common sense safety measures in a time such as this.","post_message":"All of Donald Trump's talk of constructing a wall between the U.S. and Mexico has inspired an artist to build a little border wall around Trump's star on the Hollywood Walk of Fame."},{"comment_id":"10153315040146336","commenter_b":"If the engine can take the stress of lifting a couple of hundred ton into the air at 700 mph I think it's ok after this girl sat on it......just me but then again I'm not STUPID either.........","commenter_a":"Absolutely not!","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"1508167409203284","commenter_b":"They'd kill all the children if it possibly meant no adult terrorists.","commenter_a":"Build them a safe place in their own country!!!","post_message":"“Every now and then, I’ll get a bad Skittle – but I don’t ban them all.”   - Rep. Luis Gutierrez made a dig at Donald Trump Jr.'s tweet about refugees and Skittles by chewing on the candy during a House Judiciary Committee hearing.   Read more here: @webpagelink"},{"comment_id":"10155015963219199","commenter_b":"Always use condoms jeez you never know who has it.","commenter_a":"This senseless act could have been avoided if we would have banned all Mustangs after the first Mustang ran into a crowd.","post_message":"Surveillance video shows a man on a bicycle in the Phoenix area being run down by a Ford Mustang."},{"comment_id":"10153261650152507","commenter_b":"Not enough! We need more dogs killer their dumbass, redneck, gun-loving owners. Arm Fido!","commenter_a":"It's not guns that are the problem, it's the dogs!! So don't regulate guns, regulate dogs.....er, wait.....don't regulate dogs right to guns, because guns don't kill people, dogs do.....wait, that's not what I meant.......oh what the hell do I mean?","post_message":"This is just awful."},{"comment_id":"10153670710614255","commenter_b":"Nitwit with not very many followers - whew!","commenter_a":"Check the 14th Amendment Mike - you are dead wrong.","post_message":"Facepalm."},{"comment_id":"10153396919359087","commenter_b":"X Liberal Pussies who Pimp for Islam! It's Simply one of the MOST Bizzzzaaarre Psychological Spectacles of our Time! The ODD Relationship (do I say \"Love Affair\") between ISLAM and LIBERALISM is a WEIRD thing to watch. HELLO!! Liberal FEMINIST Women!! Islam is a SEXIST Male Dominated, Woman TRASHING \"Religion\"!! Liberals MOCK, RIDICULE Christianity, then turn around and Protect Islam's 1400 Year \"War on Women\" which Treats women like Chattel, and Stones Women to DEATH for adultery. \"Honor Kills\" women when their men feel their women aren't obedient, Muslim MEN FORCE Women into castration, Slavery, to wear scarves, and Burkas!! Muslim Women aren't allowed to Drive and be Educated yet Liberals want to be \"tolerant\" to Islam, but want Christianity to CHANGE!!?? Oh, and GAYS end up on the wrong side of the Stones/BladesToo!!","commenter_a":"Thank you President Obama. I'm so glad I'm not a pussy like most of the commenters here that live in fear of the great big scary Muslims. It must suck to go to bed at night clinging to their guns and religion wetting their pants afraid that Muslims are coming to kill their family. I'm glad I have a president that rises above that childish fear. I'm blessed that God hasn't made me a coward like so many of my countrymen who would gladly trade their freedoms for the veined vail of security. Cowards all of you. And I already know their response. They will call me a delusional libtard that loves Muslims. Without realizing the irony that these were the same people that called white civil rights activists \"n***ger lovers\". This generation of dolts, will too, be wiped away with time.","post_message":"“It was so moving for Michelle and myself in part because it was so representative of the country. You had people from every background, every faith,” President Barack Obama  said after meeting the families of San Bernardino victims.  “Some described their loved ones who had come to this country as immigrants; others who had lived in the area all their lives — all of them extraordinarily proud of the work they were doing to keep people healthy and safe here in this community.”"}]
