[{"comment_id":"10153447810474575","commenter_b":"Krista, i sure hope your child don't get molested, seems all you Duggar nut huggers have kids.","commenter_a":"Drive into traffic, Palin. Nitwit.","post_message":"Sarah Palin is lashing out against ‘radical liberals in media’ and their portrayal of the family behind the popular TV show “19 Kids in Counting,” after reports of Josh Duggar's sexual misconduct surfaced.  Palin said there was a double standard, stating actress Lena Dunham did not receive the same backlash after she revealed in her book that, as a child, she used ‘anything a sexual predator might do’ to bribe her young sister for kisses and more.   Palin began her rant on Facebook in all caps, writing 'HEY LENA, WHY NOT LAUGH OFF EVERYONE'S SEXUAL 'EXPERIMENTS' AS YOU HAUGHTILY ENJOY REWARDS FOR YOUR OWN PERVERSION? YOU PEDOPHILE, YOU.”"},{"comment_id":"10154166607743352","commenter_b":"Jail needed for sex scum","commenter_a":"Troubled ladies-counseling needed.","post_message":"What sort of school IS this?! Geography teacher is now accused of lesbian affair with teenager after two colleagues 'had threesome with boy'"},{"comment_id":"530005010538423","commenter_b":"Hey @username! U must identify yourself the opposite of what you were born as!?!?!?","commenter_a":"There are SO many other REAL issues the VA should be working on, and this is NOT one of them.","post_message":"A proposed rule would end the U.S. Department of Veterans Affairs' longstanding ban on gender reassignment surgery."},{"comment_id":"10157731504125354","commenter_b":"why are our prisons full of illegal aliens who have broken the law? why don't we deport them? why? why? why?","commenter_a":"She should be held personally liable.... but she won't.","post_message":"So many acts of love..."},{"comment_id":"10153187905664087","commenter_b":"If posting in the comment section of a facebook page is being 'involved in politics' then we really are in trouble.","commenter_a":"For better reasons why we should have retention elections of these SCOTUS. Congress can't be trusted to impeach these first year lawyers in black robes!!","post_message":"#BREAKING: Rowan County Clerk Kim Davis was released from federal custody today and ordered not to interfere 'in any way, directly or indirectly, with the efforts of her deputy clerks to issue marriage licenses to all legally eligible couples.'"},{"comment_id":"1684251881603765","commenter_b":"Both if possible. The Press. Too much disregard for the truth.","commenter_a":"Can we drain them together ?","post_message":"Which swamp would you drain first?"},{"comment_id":"1739251936290298","commenter_b":"exactly. Women belong in the kitchen, this is stupid.","commenter_a":"Great. Ahmed, the suicide bomber, will be next. Anything to appease the muslims, right?","post_message":"The six-year-old girl is the first-ever Afghan Muppet, and she is aimed at promoting female empowerment in Afghanistan."}]
