[{"comment_id":"10157544266265206","commenter_b":"Pervert","commenter_a":"Manzoor Hassan @username ye kon ha ?","post_message":"“My heart dropped into my stomach, and I was immediately hysterical,' the woman said."},{"comment_id":"556591217846893","commenter_b":"America needs alot less hate as well as banning corrupt career politicians, NWO,Open borders to fill there own greedy pockets Clinton the lieing witch with soldiers blood on her hands","commenter_a":"To all the hateful mean trolls, seriously and you call yourself an American. Maybe you skipped the part in school that teaches you to be human and love humanity. You can disagree with political views but when you just get mean spirited about a person...thats just wrong!! I think Americans need more love and a lot less hate!!!! Next time you call someone something, look into the mirror and see if you ever sinned yourself. 'Those without sin...cast the first stone'!!","post_message":"A smiling Hillary Clinton just arrived on Capitol Hill for meetings with Democratic lawmakers. @webpagelink"},{"comment_id":"10154339330179087","commenter_b":"'@username, who is afraid of immigrants? There are laws. Laws need to be followed to become a citizen. Do you want a POTUS ignoring federal laws?","commenter_a":"The left just can't help themselves. They have to cast this Trump... They have to portray him as somebody that's a walking mental midget, that literally has no idea what he's done here by winning the presidency, that has no idea how to talk, has no idea how to behave. They continue to make the mistake of plugging him into their model. They're plugging him into what they think an accomplished politician is, and he's not that, he's never been that, and he's not going to be that.","post_message":"“Trump and Pence, they pulled a dog and pony show on the numbers. I almost threw up in my mouth.”"},{"comment_id":"10155997067345354","commenter_b":"Hopefully, Palin and her Carnival Midway Freaks family will return to obscurity soon. Surely she's spent all the money she collected for running for political office by now.","commenter_a":"China is killing us just like Donald Trump said, and our country's leaders do act like that are stupid who are only interested in staying in their cushy jobs in Washington DC, and who keep lying to the American people about race, gender. And all the other social things that will distract the American people from really noticing that your country's Government is crashing our country's economy. And that the media is playing hand and glove along with the Washington DC establishment of both political Parties. Because the media likes their cushy jobs also, and really don't want to change how our country is run, for no reason. So we the American people Ladies and Gentlemen were always on our own and we just never realized how bad these guys were, and simply trusted in the wrong people. Who would believe that all three branches of our country Government Institutions ...","post_message":"“It is such a sham business. This BS of them touting all the medical services they provide women and the free healthcare–They don’t provide all these services.'"},{"comment_id":"10153265498530047","commenter_b":"'@username over 5million LOL. Dead people and illegals","commenter_a":"SIGN THE PETITION / CLICK ON WEB SITE Justice Scalia one of the most brilliant and ardent defenders of the Constitution has just passed away. This is a huge, deeply felt loss. We must not forget that the next justice could impact the Court and the direction of our nation for decades. The American people deserve a voice in this decision: @webpagelink","post_message":"President Obama will stop at nothing to force his nominee for the U.S. Supreme Court through the Senate before his last year in office comes to an end.      But we can stop this from happening.  SIGN & SHARE our urgent petition to the U.S. Senate today: @webpagelink"},{"comment_id":"10153883413908797","commenter_b":"Wayne if weren't a firefighter then don't offer an opinion you don't know anything about, the twit woman had it coming!","commenter_a":"They didn't have to do it. .could've went over her car and just give her a ticket","post_message":"DRASTIC MOVE: Look close. That’s Yasmine’s car. The windows are smashed and a fire hose has been pulled through it. Firefighters say they had to do it to get to a house engulfed flames. And they point to what Yasmine did just minutes earlier as the reason. Do you think she has any right to complain?"},{"comment_id":"10153623259427623","commenter_b":"'@username coming here isn't a right. And yes, it is the same thing. Building a wall to keep people who don't belong here out is no different than you locking your door. You lock your door to keep people out.","commenter_a":"If you lock your doors at night then you agree with Donald J. Trump. I expect my government to be at least as security conscious about my country as I am about my family. This is not racism or rudeness, but common sense safety measures in a time such as this.","post_message":"All of Donald Trump's talk of constructing a wall between the U.S. and Mexico has inspired an artist to build a little border wall around Trump's star on the Hollywood Walk of Fame."}]
