[{"comment_id":"10152994930245671","commenter_b":"Because she knows she can get a pay day from the police.","commenter_a":"Her brain is definitely injured. She says she wanted the cops to back off, but if they hadn't been there she would be crying a different tune - saying they should have been there. She really thinks with all those guns and ammunition, that they would have just found there way home? They would have executed her.","post_message":"“My hopes for the whole thing were the cops would just back off, let these guys get where they needed to go, so me and Misty could find our way home somehow.\""},{"comment_id":"10153053080376336","commenter_b":"She should have been thrown put on her fat a**.","commenter_a":"How about firing the witch for inappropriate behavior toward our Veterans! She's disgusting!","post_message":"\"Had she been a veteran herself or served in the military, she would probably have a different thought on how she treats our veterans.\" The Veterans Affairs manager in Indiana who mocked her patients’ mental health has been placed on paid administrative leave."},{"comment_id":"1012223128870741","commenter_b":"Finally, someone says something. Geez, spot on Sean Penn 😊","commenter_a":"All trash talk by liberal wimps","post_message":"He's right. America must never forget who is truly responsible for creating ISIS. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152932277682093","commenter_b":"Ppl who support a rapist are ignorant! PERIOD !","commenter_a":"I think rape is a very good reason to take a star off the walk of fame. Rape is not just any thing. You're right people do bad things all the time. Rape is not a bag thing. It's one of the worst things. And he did it over and over. He is a sick man. And they should take it away. And if any other rapist are there let's get rid of them all","post_message":"COSBY CONTROVERSY – Activists call for the removal of Cosby’s star from the Walk of Fame. Thoughts?"},{"comment_id":"742612555896157","commenter_b":"We need women unless you enjoy cocks in your ass","commenter_a":"FINALLY WE CAN GET RID OF THE PLAGUE CALLED WOMEN","post_message":"The infants were carried to full term, and seem to have no health problems."},{"comment_id":"10158010051555354","commenter_b":"I like the way you think. You are a strong ,smart woman. Hillary? Not so much 😎","commenter_a":"That's funny....I'm a woman and I don't feel the least bit threatened by the FBI Investigation. I felt violated when Comey gave her a free ride the first time around - this time, not so much!","post_message":"THIS is the best the Left can do?!"},{"comment_id":"388738841314410","commenter_b":"Go home , get out of USA !","commenter_a":"GOAT HUMPERS","post_message":"Muslim Leaders Show How ALL Muslims really think...."}]
