[{"comment_id":"483635665160347","commenter_b":"Ban it out of our country!","commenter_a":"These black robe people are not making decisions that we like they need to Go.","post_message":"The Supreme Court just made a shocking ruling on Shariah Law. We must voice ourselves publicly, Shariah Law has no place in America. Do you agree Shariah should be banned?"},{"comment_id":"10153286169819705","commenter_b":"No, they aren't talking about Snow.","commenter_a":"Thanks for the spoiler","post_message":"For once, Game of Thrones didn't kill off a character when it looked like it was going to."},{"comment_id":"755708104563829","commenter_b":"And what happened when bush was president. This woman is going to do what's best for our country","commenter_a":"Didn't isis grow under her watch, and lybia burn. Nothing was accomplished while she was secretary of state.","post_message":"There's one candidate who's ready to be Commander-in-Chief on Day One."},{"comment_id":"10155295844155354","commenter_b":"And you should get absolutely NOTHING if you are here illegally.","commenter_a":"If you did not go through the proper legal channels to enter this country, you are illegal and your ass should be deported!","post_message":"NYC's New Illegal Alien ID Program Includes Free Membership to 33 Top NY Venues, Including the Metropolitan Museum of Art."},{"comment_id":"10157365304615389","commenter_b":"If the Democrats can do it they will try! These are the most evil people I have ever witness! Just like I have said many times it's Good and Evil fighting now! The good (Trump) will win!","commenter_a":"100% yes","post_message":"Question of the Day: In light of Donald J. Trump's comments, do you think the general election could be rigged? Weigh in below."},{"comment_id":"10152888732626680","commenter_b":"This recent ruling by the Supreme Court on gay marriage is only about civil unions. Those who are making this about church unions could not be more wrong as the Majority Opinion of Justice Kennedy points out: \"Finally, it must be emphasized that religions, and those who adhere to religious doctrines, may continue to advocate with utmost, sincere conviction that, by divine precepts, same-sex marriage should not be condoned. The First Amendment ensures that religious organizations and persons are given proper protection as they seek to teach the principles that are so fulfilling and so central to their lives and faiths, and to their own deep aspirations to continue the family structure they have long revered.","commenter_a":"Here come the lawsuits from the States!","post_message":"The Supreme Court has legalized gay marriage nationwide by ruling that the U.S. Constitution bars states from denying marriage licenses to same-sex couples. Full story: @webpagelink The landmark, 5-4 decision split the court along the usual ideological lines, with Republican appointee Justice Anthony Kennedy joining the court’s liberal wing to back same-sex marriage rights and the court’s remaining GOP appointees dissenting. Before the court acted Friday, 37 states authorized marriages by same-sex couples, but most of those states did so due to court rulings that could have been overturned if the Supreme Court reached the opposite result."},{"comment_id":"1157956670923761","commenter_b":"No can't be true!!! Germans wouldn't let that happen!!","commenter_a":"God help us ALL","post_message":"Goodbye Germany!"}]
