[{"comment_id":"1663552577266891","commenter_b":"Yes--indeed. This woman's behavior is appalling.","commenter_a":"Trump supporter! Makes me sick!","post_message":"Attacked as they prayed? A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."},{"comment_id":"692830987553004","commenter_b":"Fr we were running thangzz up in that bitch","commenter_a":"@username i don't miss Carrows but I miss working with you. 😿😻","post_message":"Too lit! #WSHH"},{"comment_id":"560952214097169","commenter_b":"These mf's white mf's think it's funny","commenter_a":"Whats the story? Video is not working... Someone pm me!!!!","post_message":"#BREAKING: There are reports that a #Chicago school bus driver has been shot in the head in the West Garfield Park neighborhood... @webpagelink"},{"comment_id":"776943375772176","commenter_b":"Nope definitley not a lie lol, I was biologically born female.","commenter_a":"I'm a conservative on most issues, but I disagree big time on this one being a trans male as well (my original biological sex being female). You really want me to go in the women's room and make people there uncomfortable?","post_message":"Are you freaking kidding me..."},{"comment_id":"699044636944748","commenter_b":"But will he be deported!","commenter_a":"Kill them all!","post_message":"HORROR IN MINNEAPOLIS! Somali Refugee in U.S. for Only 3 Months RAPES American Woman! This is what OBAMA has done to our cities! He imported this Muslim rapist!! TRUMP WAS RIGHT!"},{"comment_id":"10153385022372426","commenter_b":"@username-this is for that mouth of yours. It won't cure your racist stupidity, but it will shut you up. PLEASE let make it shut her up!","commenter_a":"Hmmm... I wonder what the outcome is going to be... You mean to tell me an armed militia has takened over a Federal building and not one shot fired as of yet but a 12 year old with a toy gun could not be extended the same courtesy.... Oh the hypocrisy!","post_message":"An armed group is occupying a building at the Malheur National Wildlife Refuge Federal Preserve in Oregon. \"We will be here as long as it takes,\" said Ammon Bundy, the 40-year-old son of Nevada rancher Cliven Bundy, who is well-known for anti-government action. \"We have no intentions of using force upon anyone, (but) if force is used against us, we would defend ourselves.\""},{"comment_id":"10153286881669641","commenter_b":"Suck my metaphorical dick @username","commenter_a":"Apparently people are paying more for cooking... Tess O' Connor @username","post_message":"Wealthy millennial women are more likely to make at least as much -- if not more -- than their husbands: cnnmon.ie/1HNES88"}]
