[{"comment_id":"10153106152611336","commenter_b":"Imagine, Christian leaders to lead a Christian group? Lol!","commenter_a":"Maybe Cal state I should be recognized","post_message":"A Christian organization at California State University, Stanislaus has been de-recognized because the group wanted its leaders to be Christian."},{"comment_id":"10153408065894087","commenter_b":"Think all of you are missing the point. Women does it , Throw the book at her !!!!!!! Guy does it , oh yeah no problem .","commenter_a":"All these criminals need to go down, Hillary included","post_message":"Congressional Republicans are largely brushing off the news Defense Secretary Ash Carter used his personal email to conduct business at the Pentagon, in stark contrast to the scrutiny that has fallen on Hillary Clinton."},{"comment_id":"10154493614517235","commenter_b":"How about just sending all of the whites back to their mother countries and leave the Americas to the Natives!","commenter_a":"I've always believed conservatives would destroy this country and it would appear they are well on their way to doing it - maybe we should boot the old confederacy out and let them make it on their own - if Mexico wants texas back, if france wants louisiana, spain wants florida or great britain wants the southern colonies, hey guys don't call us yankees - you got what you wanted LOL","post_message":"BUSTED."},{"comment_id":"10153383704554411","commenter_b":"Examples?","commenter_a":"Texas has always been a disaster.","post_message":""},{"comment_id":"10153543812088812","commenter_b":"She was too busy preaching abstinence.","commenter_a":"did she ever hear of birth control? apparentally not","post_message":"Bristol Palin announces second pregnancy; says she knows it will be \"huge disappointment\" to many: @webpagelink"},{"comment_id":"909853555777564","commenter_b":"7 officers injured and one unresponsive..... Rioting, looting and destroying public and private property is not the answer. Attitudes of revenge and justification only feed into the hatred.","commenter_a":"Has anyone died from a spinal injury from one of these rocks? Oh...","post_message":"Developing: Reports of youth throwing rocks at police in Baltimore."},{"comment_id":"758122781044966","commenter_b":"Pack it up asshole your fired","commenter_a":"Traitor","post_message":"While Everyone Was Distracted By Super Tuesday Obama Secretly Did THIS We can't let him get away with this. He needs to be stopped. Do you think Obama is running this country into the ground?"}]
