[{"comment_id":"1295164193914868","commenter_b":"Then her skin is too thin. I'm sure she's seen and heard much worse. Does she know what Muslims do to women?! And she wants them here sooooo bad.","commenter_a":"She is selling her soul to the devil. She can push the likes of Clinton on us. You can't be gone soon enough!","post_message":"First Lady Michelle Obama says the revelations about Donald J. Trump's treatment of women have “shaken me to my core.”"},{"comment_id":"10153700669189586","commenter_b":"I think you are an idiot. Zoos are bad conservation centres are good! You want to show your children animals in far too small spaces and teach them this is acceptable? Why don't we then put our toddlers in gages where we can keep better eye on them.","commenter_a":"That's totally insane! BAN ZOOS!","post_message":"The kids' faces say it all."},{"comment_id":"10152906505382169","commenter_b":"Fascist pigs always think they'll be spared by the police state for being boot licking authoritarians. Never really works out that way though.","commenter_a":"America is a complete mess right now because of the Flower Power Generation, Obama, and liberal lunatics. Way to go, @username, just fanning the flames even more with this story. I'll be glad when the Flower Powers die off and we can have America normal again.","post_message":"TONIGHT: Return to the most divisive moment in American history since the Civil War, and witness the mayhem that followed the Kent State shootings.   THE DAY THE ‘60S DIED airs at 8/7c on PBS as part of a special programming block commemorating the Vietnam War. #VietnamPBS Learn more: @webpagelink"},{"comment_id":"10153449417193984","commenter_b":"She is a loser!!!!","commenter_a":"Her Poor daughter .. I bet she was totally humiliated .. and then to have mom remove her from her class mates .. Brutal :(","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"1671785493043668","commenter_b":"Bitch..... Get a life. Stop using racism.","commenter_a":"Tactical shit is racist... says the man who uses \"Redneck\" over and over and over and then blankets all veterans as being PTSD, drunks, llamaphobes, ect. the ignorance level is... OVER 9000!","post_message":"What he says about Red White and Ben is priceless."},{"comment_id":"1392014810811452","commenter_b":"That is so inspiring.","commenter_a":" I despair, I remember that all through history the way of truth and love have always won. There have been tyrants and murderers, and for a time, they can seem invincible, but in the end, they always fall. Think of it--always. Mahatma Gandhi","post_message":"Just when you thought it couldn't get any worse!"},{"comment_id":"937962582913649","commenter_b":"I think Not... Voting is suppose to be a privilege, illegals don't have that privilege, they are illegal!!!","commenter_a":"I say if they vote, then they should work and pay taxes","post_message":"More than half the voters who identified themselves as Democrats in a recent Rasmussen poll said they believe illegals should be allowed to vote. Among all voters, more than one in three believes illegals should be allowed to vote. What do you think? @webpagelink"}]
