[{"comment_id":"10153443298156051","commenter_b":"Go to hell","commenter_a":"She a moron. You hate kids then don't work at a day care idiot.","post_message":"A few hours before she began her new job, this mom posted something on her Facebook account. Before she could even get to work, her employers called her and told her not to come in. Decide for yourselves whether she should've been fired."},{"comment_id":"10153559970697093","commenter_b":"@username you shut up.","commenter_a":"See how good it feels to see good black hard working men...and the children have no hate for them big black men see hatred is taught we are not born with it. Love this interaction this should be a wake up call to any one steriotyping.","post_message":"Apparently they get this excited every pickup day... they're now good friend with the garbage men... @webpagelink"},{"comment_id":"10153440859824411","commenter_b":"Fascists? LMAO!","commenter_a":"Both obama & hillary are fascist pigs !","post_message":""},{"comment_id":"10155009134559411","commenter_b":"So why can't they do the same over here when the terrorists return","commenter_a":"Danes are fucked-up in the head except her. Brave and lovely lady ! You should run for whatever kind of Governmental election and you`d do very well. All the best to you .","post_message":""},{"comment_id":"10153503495739087","commenter_b":"Shut the fuck up bitch","commenter_a":"Bernie lost, give him money, make bernie feel better with money, Bernie wants peoples money. Trump came in second and didn't ask for a dime. Trump 2016!","post_message":"Bernie Sanders presidential campaign had its \"best day ever,\" raising $3 million since the Iowa caucuses on Monday -- most in the form of small online contributions, averaging about $27 each."},{"comment_id":"531497917040788","commenter_b":"What a Dixie chick.....","commenter_a":"Dope head","post_message":"Tim Mcgraw fans shocked after he bowed down to Obama in this sickening way. Sorry Tim, you lost our business forever. Will continue to support Tim Mcgraw after he did this?"},{"comment_id":"10153617872056636","commenter_b":"Islam isn't but a lot of it's exponents use it as an excuse to kill.","commenter_a":"No religion is peaceful, it divides opinions which leads to violence.","post_message":"Show this next time someone claims Islam is violent"}]
