[{"comment_id":"10155050570035329","commenter_b":"I'm the biggest pussy out","commenter_a":"'@username you have to read these!! Ouch","post_message":"Exposed nerves, unexpected orgasms, and a whole lot of blood."},{"comment_id":"10153138411643717","commenter_b":"FULL SAILS!! SHE CAN TAKE IT!","commenter_a":"Capt. Kenway ?!","post_message":"El Galeon Andalucia, the only galeon class vessel in the world sailing today, will be in Portsmouth Harbor beginning this week: @webpagelink"},{"comment_id":"10154563720189087","commenter_b":"Religion and government is intertwined...Muslim ban that include pushing Christian refugees to the top of the list. Unconstitutional violates church state seperation however her trump wanta to also allow tax exempt churches to be allowed to donate to politicians. And if you don't understand why that's wrong please re-read your constitution.","commenter_a":"I am so proud of Muslims, Hispanics & Women. To be abused and treated so badly by Mango Mussolini, and to still hold their head so high, is truly wonderful!'","post_message":"President Donald J. Trump: 'I am so proud of my daughter Ivanka. To be abused and treated so badly by the media, and to still hold her head so high, is truly wonderful!'"},{"comment_id":"10153100399077377","commenter_b":"We The People, continuously have said, 'Impeach Obummer Now!' He has by far surpassed any former president with impeachable offenses, but not one congressman has started the process! Do we sit here yelling in vain? What are we waiting for? We all know he is not looking out for our best interest. And yet our congress wonders why Donald Trump is FIRST in All POLLS! Let's MAKE AMERICA GREAT AGAIN! VOTE FOR DONALD TRUMP","commenter_a":"They are always talking about working and being hard working. When someone tries, the republicans shut them down. Make up your freaking minds , republicans. Or is it you people to work at what you say, for the pay you say, when you say, without any remarks or compensation . That's called slavery. Republicans ended that years ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"},{"comment_id":"10154243110114228","commenter_b":"I would of peed on that mf","commenter_a":"'@username is it wrong that I laughed 😅😂😅😂","post_message":"Wait  it gets worse."},{"comment_id":"10153595542620575","commenter_b":"If its pure crap please backup that statement with facts. America is importing more Muslims than ever before in history.","commenter_a":"He IS scary with his beliefs and agenda for Muslim takeover of the world.","post_message":"The Gateway Pundit - Obama Blasts FOX News, Conservative Media for Making Him Look ‘Scary’"},{"comment_id":"487670684715042","commenter_b":"because someone has to protect your pansy ass","commenter_a":"If these guys are so tough with their guns, why aren't they serving right now in The Middle East?","post_message":"Who will save us from tyranny in the produce section now? -Linda"}]
