[{"comment_id":"1848439335433149","commenter_b":"Keen 😜","commenter_a":"@username @username Mari Funfax","post_message":"Put us on the next plane to Dubai."},{"comment_id":"10152932277682093","commenter_b":"Ppl who support a rapist are ignorant! PERIOD !","commenter_a":"I think rape is a very good reason to take a star off the walk of fame. Rape is not just any thing. You're right people do bad things all the time. Rape is not a bag thing. It's one of the worst things. And he did it over and over. He is a sick man. And they should take it away. And if any other rapist are there let's get rid of them all","post_message":"COSBY CONTROVERSY – Activists call for the removal of Cosby’s star from the Walk of Fame. Thoughts?"},{"comment_id":"10153385022372426","commenter_b":"@username-this is for that mouth of yours. It won't cure your racist stupidity, but it will shut you up. PLEASE let make it shut her up!","commenter_a":"Hmmm... I wonder what the outcome is going to be... You mean to tell me an armed militia has takened over a Federal building and not one shot fired as of yet but a 12 year old with a toy gun could not be extended the same courtesy.... Oh the hypocrisy!","post_message":"An armed group is occupying a building at the Malheur National Wildlife Refuge Federal Preserve in Oregon. \"We will be here as long as it takes,\" said Ammon Bundy, the 40-year-old son of Nevada rancher Cliven Bundy, who is well-known for anti-government action. \"We have no intentions of using force upon anyone, (but) if force is used against us, we would defend ourselves.\""},{"comment_id":"455232604658620","commenter_b":"Hillary Clinton!!!","commenter_a":"Bernie Sanders!!!","post_message":"Listening is always better."},{"comment_id":"10153913587481341","commenter_b":"@username The fact is Israel is the nation of Israel since the time of David , Palestinian come here from Syria and Jordan bf 48 , The Things there is no one to talk peace , PA are feeding the money from Eu countries by cover of charity organization , Some money go to Games to take care of the poor but the majority go to weapons against Israel , i'get u the gov link who provide evidence , but u still won't believe cause u are dreaming in Lala land","commenter_a":"Israel has no moral or ethical values. It only knows how to oppress and terrorise people.","post_message":"Canada will be a frank voice in the Middle East, even if it means criticizing Israel, said the country's new Prime Minister Justin Trudeau."},{"comment_id":"1012689648797790","commenter_b":"Lmao she getting that good shit. 😂😂😂😂😂","commenter_a":"Leslley Santana Raudel Flores","post_message":"She's not ready for a tattoo"},{"comment_id":"10153344418725326","commenter_b":"Me too..they are owned by Time Warner her 7th largest donor!?!?!","commenter_a":"THE QUESTION IS THIS. DID CNN FEED HILLARY THE QUESTIONS IN ADVANCE. IF YOU LOOK AT HER BODY LANGUAGE AND LACK OF PONDERING THE QUESTION HER RESPONSES WERE CANNED. I FIRMLY BELIEVE CNN FED HER THE SCRIPT.","post_message":"Hillary Clinton was put on the defense Tuesday for her ties to Wall Street. While Sen. Bernie Sanders has been saying for years that the Wall Streets are contributing to the overwhelming income inequality in America. Ed gives Commentary. Don't forget to Subscribe to Ed's YouTube Channel at: goo.gl/ScLQVu"}]
