[{"comment_id":"10153483912132522","commenter_b":"If only the two big candidates this election were Johnson and Stein. Either of them would be nice.","commenter_a":"Libertarians should all be required to live in Syria for a year. That is essentially what their government is (or lack there of).","post_message":"Gary Johnson and his running mate, Bill Weld, were equally dismissive of \"huckster\" Donald Trump and political status quo. \"The two-party system is a two-party dinosaur, and they're about to come in contact with the comet here,\" said Johnson:"},{"comment_id":"10150858630504999","commenter_b":"Watch out you may be deported!!!!!","commenter_a":"Go Trump for 2016","post_message":"\"There has never been a man or a woman — not me, not Bill, nobody — more qualified than Hillary Clinton to serve as president of the United States of America,\" President Obama said. Read more: @webpagelink"},{"comment_id":"10153465334273132","commenter_b":"This case may seem cut n dry but so much time has gone by plus they never found his body.. I would not want to be a juror on this case","commenter_a":"They had a convict in prison who was even more than likely this little boy's killer. I think this is why this guy's 'confession' is so questionable. The investigators refused to admit they made a huge mistake, not surprisingly. I don't think they have the right guy, as for the real killer, I believe he died in prison. The whole thing is tragic.","post_message":"The jury has already been deliberating for 11 days."},{"comment_id":"395107284010899","commenter_b":"asshole mother fuckers wow","commenter_a":"Democrats are acting like children.","post_message":"Democrats LASH OUT at Netanyahu, Tell Him to Go Home, Call Him “a Child”"},{"comment_id":"1051374008255409","commenter_b":"Oh please. half a million is chump change to those guys. BUY A CLUE.","commenter_a":"People, We're talking about Goldman Sachs here. Don't think for an instant that they'd shell our half a million with no expected returns on their \"investment\". Besides, hillary said she'll look into releasing those transcripts. so I'll hold my breath until I see them(getting a little lightheaded tho\")","post_message":"Another lie about Hillary Clinton goes down in flames."},{"comment_id":"1034492959948582","commenter_b":"Strike one for Bernie. This has been well refuted many times over. Besides the feminists will vote for Hillary only for the fact she is a woman.","commenter_a":"All you brogressives claiming the wage gap doesn't exist don't deserve to have Bernie as your president.","post_message":"Women are making 79 cents on the dollar compared to men. For women of color it's even worse. African American women earn just 63 cents for every dollar a white male earns, while the figure for Hispanic women is just 54 cents. That's nothing but sexism and discrimination."},{"comment_id":"2159179167640729","commenter_b":"Shut up you liberal ugly lying witch that THINKS she's as beautiful as Melania Trump (secretly jealous of her) get off the tv cause no one wants to look at or listen to you skank!","commenter_a":"Boo👀jk😊","post_message":"\"I feel like it was an attempted bullying.\""}]
