[{"comment_id":"1600782096895914","commenter_b":"Well yeah that's because she'd probably have a bomb, so...","commenter_a":"if she was wearing hejab, the story will definitely be different. meanwhile continue laughing.","post_message":"\"I've flown all over the world and I've been on lots of really long flights and I've never experienced anything like this,\" a passenger said"},{"comment_id":"10157044490065093","commenter_b":"The only con-artist is Hillary!","commenter_a":"Wow. You work so hard to justify your position. What a word smith. What's your answer. Third party's ? Just how would that work? How would you fix it. You complain but you don't have any idea of merit to beat Clinton except trumps is wrong. A lot of us know he is a jerk and all the other adjectives. But unfortunately in life we have to make unsatisfactory choices when there are no other options. We have no other options except staying home and electing Clinton.","post_message":"\"I'm talking about his core supporters, the people who didn just enthusiastically buy his con, they helped sell it to the rest of us.\" -- David French"},{"comment_id":"10153546751448352","commenter_b":"Annissa stfu bitch...whites use welfare in illegal ways too...fuckin idiot","commenter_a":"why are people saying \"good job?\" Yes what officers are doing out here is wrong but this guy has nothing to so with that. Innocent cop murdered for someone else's wrong doings. Not right!!!! He had his whole life ahead of him. Truly sad.....we need justice for all who die for nothing. This crap needs to STOP now.","post_message":"NYPD officer, 25, who was 'shot in the face by a career criminal' has died from his injuries after two days in hospital"},{"comment_id":"1031698180201852","commenter_b":"why did this piece of shit get a job on T V anyway ??????? tampons for ear rings that is one sick hoe !!!!!!!!!!!!!!!!!!!!!","commenter_a":"Good","post_message":"\"While MSNBC may believe that I am worthless, I know better.\""},{"comment_id":"10153459562633445","commenter_b":"No jail time and no probation for less than ounce....Wasted time n court's and jail space.....GET REAL GO FOR CARRIER CRIMINALS ,AND MURDERS ,LOCK THEM UP NOT A POT SMOKERS GETTING BELIEF N PAIN MANAGEMENT ,NO PILLS ,DAAAAAAA","commenter_a":"www.premierepotpourri.com","post_message":"#Pot Matters: Marijuana, the Courts and Probation"},{"comment_id":"10153918436462619","commenter_b":"God have mercy on those who hate","commenter_a":"Revenge is mine says the Lord!! Definitely a different God!!","post_message":"An Islamic State terrorist praised Wednesday's attack on Charlie Hebdo, telling Reuters the attack was revenge for insults against Islam."},{"comment_id":"1061299707312818","commenter_b":"What an ass! Leave already.","commenter_a":"yah these dumbASSES are going to tell me to be tolerant with the beheading of CHRISTIANS in the MIDDLE EAST, hay DUMBass just cause a lot of people cannot believe that you are a focking muzlum dose not mean I'm going to kiss the muzlumz assss as they behead more Christians, BTW who the fock are you to tell us to be tolerant with the shayton muzlumz? name one Christian that has beheaded a muzlum this month, or this year, or even this century, you bass TURD have allowed so many innocent Christians to be killed by your demonic muzlum family, you have their blood on your hands, and their blood is crying out to GOD ALMIGHTY FOR JUSTICE. allahoooo ACHK BARR and GRILL YOU FOCKING BASS TURD.","post_message":"The Obamas have always gleefully kicked Christians to the curb during Christmas. This year was no different."}]
