[{"comment_id":"1231536326885822","commenter_b":"She's not getting in the White House !","commenter_a":"The real sad thing is that Hillary won this election a long time ago with lies , blackmail, payoffs etc. The list goes n and on. She and her party are so dangerous and I fear our world will never recover from her.","post_message":"SHADY KAINE @webpagelink"},{"comment_id":"10153535805923352","commenter_b":"You dumb wet back bitch and @username you ugly bitch go ahead. Pink monkey bitch","commenter_a":"He is though. What happened to \"freedom of speech\"? Oh it's selective I see.","post_message":"Female middle school teacher forced to resign after telling students that President Obama is a ‘Muslim baby killer’"},{"comment_id":"456327834562277","commenter_b":"They are a matched set, failed business woman and failed politician.","commenter_a":"As for CARLY supporting Cruz SHE wants the VP spot and this is her ONLY chance! Tying herself to Cruz who will allow lying, half truths, whatever it takes to get into OUR White House! Carly Fiorina said BEFORE this establishment endorsement, that she found it that fellow candidate Sen. Ted Cruz, didn renounce his dual citizenship until 2014, and that Cruz one thing in the drawing rooms of Manhattan, and another thing in the living rooms of Iowa ! NOW it seems, Cruz brokered a deal with Carly AND SHE WAS BOUGHT! Talk about a SHILL Fiorina is a TOTAL GOP ESTABLISHMENT SHILL!","post_message":""},{"comment_id":"10152929906987377","commenter_b":"Kendal , another stupid liberal !","commenter_a":"You're OUT, Bobby..!","post_message":"Bobby Jindal is calling for tougher gun laws."},{"comment_id":"1437463806270353","commenter_b":"Can Hillary come to Texas?","commenter_a":"We don't care much for you here in Houston either, Trump. Just wanted to let you know that before you get down here and make ya self at home","post_message":"Heading to Houston, Texas now -- just informed that two police officers in Fort Worth have been shot. Please join me in keeping them in your thoughts and prayers this evening."},{"comment_id":"10153491925881756","commenter_b":"Hey, this sounds like Republican America; an obsession with lady parts.","commenter_a":"Indonesia, defender of morality.","post_message":"The virginity test \"is a measure of morality. There's no other way,\" Gen. Moeldoko said. The test — which, for the record, is scientifically invalid — is internationally regarded as a violation of human rights."},{"comment_id":"971579579554776","commenter_b":"Trump.. love him","commenter_a":"The hugs he remembers were on September 11th? I believe what rand Paul was talking about was when New Jersey got slammed with a hurricane and he was thanking Obama for sending assistance so quickly. That isn't anything more than being an adult professional. Something 99% of republicans are incapable of being.","post_message":"ICYMI: Here are the top moments you were talking about during the #GOPDebate. Who do YOU think won? @webpagelink"}]
