[{"comment_id":"1662896673932550","commenter_b":"Her mom's argument is invalid, he's black, cops would have shot him anyway and by the time they got their clerk would be dead too, good job armed guy! (Y)","commenter_a":"Boo hoo my thug piece of shit waste of air got shot. She wanted him in jail so she didn't have to feed his useless ass.","post_message":"Normally, I would be on the side of the shooter in most cases, but this...?...  @webpagelink"},{"comment_id":"10150745246359999","commenter_b":"More difficult than jamming his shirt into his pants","commenter_a":"*Insert Fat Jokes Here*","post_message":"Governor Chris Christie must now cram his vast political ambitions back into a space the size of New Jersey."},{"comment_id":"10153541248725950","commenter_b":"Rape and borders. @webpagelink","commenter_a":"If it had been for Berniestan or Queen Hillary, then nobody would have noticed it and @username would not have written any articles on it.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"},{"comment_id":"10153594349921162","commenter_b":"Yolo","commenter_a":"Cesar Orozco @username @username","post_message":"Tomorrow could be the hottest day in nearly 2 years - if we reach 93!"},{"comment_id":"957903450911743","commenter_b":"Muslims are still using the jiihad to increase their power and stupid European leaders are letting it happen.","commenter_a":"LanceBell fox loves you","post_message":"Spread this everywhere:"},{"comment_id":"10153703347009714","commenter_b":"No. And neither is the attraction to the opposite sex.","commenter_a":"Its high time for America and the entire west at large to know that its not a Right to be Gay ! It cant be one's right to do wrong or evil ! Else we shall soon have murderers, thieves and all sorts of hooligans claiming its their right to do so.","post_message":"Kentucky clerk Kim Davis, who has been denying marriage licenses to gay couples, has a turbulent marital history."},{"comment_id":"583491245168645","commenter_b":"Yup @username, same old Hillary, will say Anything. Flippity Flopping as usual.","commenter_a":"Well Hillary Wallstreet Clinton, your group phot does Not contain any Important popular opinions!! Now on to a question for you. If Nothing to hide regarding your emails, why would you destroy evidence after a Subpoena? Why did You lie to Congress and the FBI? Why did your aides plead the 5th? Why did some of your aides receive Immunity? Why did you recently Under Oath answer 21 questions with,(I Don't Recall ), and other questions with,( I Object) ? These Issues are VERY CONCERNING, and you're Ignoring these!!","post_message":"Nobody knows better than these five people what it means to be president—and not a single one of them believes Donald Trump has what it takes to do the job."}]
