[{"comment_id":"10153822005111519","commenter_b":"It doesn't fit her","commenter_a":"Plus not just only black ppl have this done. White and other colors do 2.","post_message":"Lil’ Kim’s bleached skin and blonde hair are the tragic result of sexism, racism, colorism"},{"comment_id":"10153812435979218","commenter_b":"Watch out these Fkn MUSLIMS WILL BURN THEY'RE WAY INTO TOWN!!!?? MAKW EVERYONE LEAVE!?? GOOD JOB SHO EVER LET THE BLOCK GET BUSTED !!!?? I'D LOVE TO KNOW HOW MUCH INSURANCE WAS ON IT!! POOR DAMM FIRE FIGHTERS FIGHTING FOR NOTHING!!! GOD BLESS THE AMERICANS. UNITED WE STAND!!??","commenter_a":"Yeah arson. Hmmm.","post_message":"UPDATE: More photos from SkyTeam 11 of a large fire that has engulfed the old Milford Mill Swim Club >> @webpagelink"},{"comment_id":"10153503971232464","commenter_b":"That's an awesome plan, and repeal Obamacare! Defund Planned Parenthood & NO to Iran Deal! Cruz/Trump--2016","commenter_a":"@username 2016!","post_message":"If I'm elected President, the very first thing I intend to do is rescind each of President Obama's illegal and unconstitutional executive actions! #CruzCountry"},{"comment_id":"1214715148582648","commenter_b":"That IS NO lady!","commenter_a":"This is one sick lady","post_message":"WHOOPIE GOLDBERG: Right To Abort Baby Same As Right To Celebrate Birth Of Jesus Christ [VIDEO]"},{"comment_id":"1341782245865041","commenter_b":"Wow!!!! Clearly a Muslim traitor...... Like Barry and Michael, maybe they can all room together......Prison 2017 !!!!!!","commenter_a":"\"Farking Nuts\"","post_message":"YES, POLITICIANS HAVE LITERALLY LOST THEIR BRAINS..."},{"comment_id":"804744199625733","commenter_b":"The Progressive white wash is to say \"America did this\" No You Progressives did this!!!","commenter_a":"BOOM!!!!","post_message":"Watch me take down Cenk Uygur from The Young Turks LIVE at Politicon! Cenk should be a little less smug after this debate. #Politicon2016  Learn more about Hillary's America, in theaters on July 22: hillarysamericathemovie.com."},{"comment_id":"1495765340483209","commenter_b":"Wow ease up on the drugs girl, you're delusional.","commenter_a":"Hillary, is the only sane choice. Trump is the village idiot. Daily mail must be endorsing trump. Plus, what's wrong with being short?!!","post_message":"She hasn't got her way...and she won't get commercial breaks for coughing fits or fainting spells"}]
