[{"comment_id":"10153025279926491","commenter_b":"What's the deal with communist people looking at all the post in this feed? Makes me wonder if they sent people like in Ukraine to start protest and eventually riots and killings. So far 5 have msg me and I've called their bluffs. Busted","commenter_a":"American Folks are in desperate need of a National Refresher course on the Civil War and American Reconstruction, so with that been said, let just stop framing the Confederate Battle Flag issue as a \"free speech\" issue and call it what it is, TREASON !!, and that's a fact jack","post_message":"Many still support the current flag."},{"comment_id":"10154335459871509","commenter_b":"Bret, insults show a lack of intelligence, but continue.","commenter_a":"10 Reasons for Supporting Trump 1. Donald Trump is immune to special interest lobbying because he has accepted no donations or special interest money. No other candidate can make this claim. 2. Trump knows how to negotiate. No one builds an international business empire the size of Trump without being able to win at the negotiating table. 3. Donald Trump is an executive. The President of the United States is the Chief Executive Officer of our nation. We don need a policy expert or a legislator we need someone who knows how to run an organization. Trump is the only candidate who has a proven record as a successful executive on a large scale. 4. Trump is a man who tells the truth. He may not always say it in the most polished way, but our country has had enough suave liars. It is time for some straight forward honesty. ...","post_message":"Emotional scenes at Vancouver airport."},{"comment_id":"10154348215444609","commenter_b":"You only want your daughter to learn to suck dick?","commenter_a":"This is very wrong. If someone like same sex that's cool jus don't teach my child about it!!!!","post_message":"In case you missed it: Read about these newly approved changes in classroom instruction, put in place to comply with the nation's first law requiring public schools to include prominent gay people and LGBT rights milestones in history classes."},{"comment_id":"10155292793551509","commenter_b":"Look at all the zombies/paid trolls. #imwithher at the hospital HitLIARy will never be president.","commenter_a":"Hillary can't attend a simple ceremony without collapsing, can't lead a nation and not fit to be president! One more reason to vote Donald J. Trump 2016! Those who plant injustice will harvest disaster, and their reign of terror will come to an end. Proverbs 22:8. Hey liberals?? Look what has happened to your Hillary Clinton!! Karma is real!! And justice is being served!!","post_message":"Hillary Clinton's exit from Sunday's September 11 commemoration set off a flurry of questions and concerns about her health.  For the reporters who cover her, there was also frustration."},{"comment_id":"10153396131721130","commenter_b":"Some chick stealing ya flow.","commenter_a":"@username, you could do a better job at this! But either way, I like it.","post_message":"“This s***t was dope as hell.”"},{"comment_id":"10156336306105354","commenter_b":"She has pretty skin like a white woman, she talks like a low- information angry blue-gum.","commenter_a":"Melissa Harris Perry should be worried about her ideology. She's in the minority.","post_message":"Melissa Harris-Perry: You know what Americans worry about? They worry about their kids and families being terrorized, raped, robbed, and murdered by criminal illegal aliens--people who should have never been in our country in the first place. THAT is what Americans worry about."},{"comment_id":"875288902530859","commenter_b":"I think she looks much better than that freak of nature.","commenter_a":"No no no no no! Wrong in so many ways... You need MUCH MORE Booty gf.","post_message":"My weekend as Kopycat Kim Kardashian."}]
