[{"comment_id":"1366518346740365","commenter_b":"Emilie Frost & your not even ginger anymore","commenter_a":"....","post_message":"Fans of Prince Harry and Ed Sheeran will be celebrating soon!"},{"comment_id":"1089512117777571","commenter_b":"YEP CLINTON RAN TO CANADA","commenter_a":"Blame Carter. If he hadn't pardoned Clinton for draft dodging we wouldn't be in this pickle.","post_message":"SHOCKING VIDEO: US Marine Booed, Removed From Clinton Rally For Asking Legitimate Question WATCH THIS! @webpagelink"},{"comment_id":"10156001387100354","commenter_b":"I would prefer you be hung, Stabbed, set on fire, tar and feathered, AND THEN DECAPITATED. SAD THING, Americans NEVER GETTING WHAT THEY WANT OR NEED!","commenter_a":"How do so many of these guys have zero brains when it comes to breaking the law. They are truly brain dead about this!","post_message":"How, again, did this guy break into the top 10?"},{"comment_id":"10152610651920667","commenter_b":"This girl is beautiful. Mrs. Rancic is just trying to make herself relevant by saying idiotic ridiculous comments. Amazing what people will do to try and get noticed.","commenter_a":"E! Should cancel the show, before they cause more trouble for them selves","post_message":"In dishing about all the red carpet looks on E!'s Fashion Police, Giuliana Rancic cracked that Zendaya probably \"smells like patchouli oil ... or weed.\" And an angry Zendaya took to Twitter to say there is a \"fine line between what is funny and what is disrespectful.\""},{"comment_id":"10154615218080530","commenter_b":"@username-Fequiere Wait, so now black on black violence is due to INEQUALITY????","commenter_a":"When are people going to start protesting the deaths of 9 year old girls executed in Gang warfare in Chicago? It's like we're protesting something that happens 1 time out of 1,000,000. And nobody cares about something that happens like everyday. The media has got the people riled up about a very small issue while ignoring major problems. That's why I don't understand this movement. It's like if the government was repossessing everyone's home and moving them to refugee camps for no reason, but I was protesting the governments estate tax while ignoring people's homes being taken.","post_message":"Does the Michigan Football players' silent protest make you uncomfortable? Does that interrupt your Saturday afternoon of escapism? Sorry. That’s the point. @webpagelink"},{"comment_id":"1201354526579759","commenter_b":"Can't turn a hoe into a housewife should of known that!!! Smh Anyway in other news?","commenter_a":"When the goin gets tough the fake show true colors","post_message":"\"She's felt trapped for a while... She doesn't want to stay married.\""},{"comment_id":"957541017614653","commenter_b":"I think she's a class act!","commenter_a":"I like all three of the non professional politician candidates and Ted Cruise and Scott Walker.","post_message":"Whoa..."}]
