[{"comment_id":"1066627293358281","commenter_b":"You killed a clumsy one. No more clumsy spiders","commenter_a":"How is that possible? The spider isn't going to breed after it gets killed. Shouldn't TRYING to kill spiders have that effect?","post_message":"Just sayin."},{"comment_id":"10155173773771320","commenter_b":"Barbie has Ken what's the difference....","commenter_a":"Good grief!! My oldest granddaughter collected them, but this is plain stupid! Why don't you make an American Boy series???","post_message":"Big news in the world of toys. One of the newest American Girl dolls is... A BOY! It is the brand's first boy character. He is a drummer in a Nashville band. Thoughts? @webpagelink"},{"comment_id":"2169846419907186","commenter_b":"Don't listen to Nikki's Parra she needs to go back to school and take a history class or two cause slavery wasn't about a protest and it didn't end cause of one as well","commenter_a":"These people doesn't really know anything. They only wanna learn and hear what they want to hear and learn that is not against to them. Shame on you all! Get back to class and get a better future rather than this. Best revenge is to get educated!","post_message":"Students at East Los Angeles College and more than 100 colleges across the country walked out of classes and held rallies in protest of Donald Trump’s election as president. @webpagelink"},{"comment_id":"1706384232981728","commenter_b":"5his woman is so evil ,.","commenter_a":"Explain that one...Obama, State Dept, FBI DOJ. If something isn't done to Hillary, than Eric Snowden should be allowed back in the US and not charged.","post_message":"#Petraeus was ruined for one leaked email. #Hillary deleted thousands of emails and sent multiple classified ones—indictment time!"},{"comment_id":"10156260216170725","commenter_b":"Michele the only thing dirty here is your pussy","commenter_a":"The media is always unfair to you @username but we are supporting you and what you will do for this country!!! Make Amerca Great Again in 2016!!!","post_message":"After a great evening and packed auditorium in Iowa, I am now in Colorado looking forward to what I am sure will be a very unfair #GOPdebate!"},{"comment_id":"375119059510655","commenter_b":"This woman is very wicked. You can see the evil spirit in her face. She is a demon from 'hell'!","commenter_a":"Worst people you can meet in your life are LIARS! This administration is full of them!😏","post_message":"CNN has HAD it with Conway and her lies."},{"comment_id":"1803612926545625","commenter_b":"I agree ...where they trained to beat the crap out of people because they ran....smh","commenter_a":"What they fail to mention is that even if this man was the actual perpetrator it's still inexcusable for the cops to beat him unless he was resisting. The police's job in this case is to apprehend suspects. Suspects are innocent until proven guilty and should be treated as such.","post_message":"'I've never been cursed, physically abused, beaten and treated like a slave as I was two days ago.' A retired corrections officer says he was assaulted by Garden City Police in a case of mistaken identity. CBS2's Carolyn Gusoff shares his story: @webpagelink"}]
