[{"comment_id":"10157751782920500","commenter_b":"BUILD THE WALL!","commenter_a":"I don't get how everyone assumes all those people are unemployed, on government assistance and have no education... who the fck are you.","post_message":"This is live footage from Oakland where people are protesting Donald Trump's election."},{"comment_id":"1420761931270891","commenter_b":"I'm just annoyed that girl had to post it. The minute she posed with it and posted it made it a trophy kill. She didn't pay all that money to go to Africa to feed the orphans, cause if that was the case, she would have gone about it a different way. Don't get me wrong, I think it's great that a lot of people got fed, but in her mind this was all about the trophy.","commenter_a":"@username, @username, did you see This? Hopefully there isn't protesting in CV","post_message":"12-year-old hunter speaks out after facing backlash online for posting photos with big game. \"I'm never gonna stop.\" @webpagelink"},{"comment_id":"908989295805078","commenter_b":"She was discriminatory to Israel in her tweet islamaphibia Israel. The middle east wants us wiped out! She is lucky she is in the USA where she can say what she wants as a woman in her country she would be stoned for the same accusation. Get over yourself lady!!!!!!","commenter_a":"Better yet, just stay home","post_message":"\"This discriminatory and disgusting behavior.\""},{"comment_id":"10154043300342577","commenter_b":"All women do!!","commenter_a":"is it just me, or has this woman got the most annoying voice in the world? I just wanna punch her in the face","post_message":"Hillary Clinton's Greatest Hits! Vol:1- infowars.com/show"},{"comment_id":"2191617061063923","commenter_b":"It should be lock that jerk up , wth.","commenter_a":"YES","post_message":"Donald J. Trump just tweeted that those who burn a flag should either lose their citizenship or get a year in jail. Do you agree?"},{"comment_id":"418030251654903","commenter_b":"Why not, she gets away with murder!!","commenter_a":"Bad, evil, lying laugh quack! 👎","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"},{"comment_id":"10153604770703984","commenter_b":"I know that Obama was slow to react. The main reason is the fallen were White and Hispanic soldiers killed by a Islamic terrorist. He has zero respect for our military and would be very happy if all military members that don't support his new direction for this country would resign. We have a President that wants to convert America into a third world country that will allow him to remain its Dictator. Everyone needs to remember the USSR and how it broke up into many small countries that are loaded with the rich leadership and the overtaxed people who just want to live in peace. Russia's streets are ruled by gangs and the mafia. WAKE UP AMERICA!!!","commenter_a":"Obama is some commander in chief NOT!! He should be ashamed! What happened to freedom of speech?","post_message":"What just happened in a crowd of veterans during an Obama speech says a lot about his presidency. The bold veteran who stood up even after he was dragged down is attracting a lot of attention. Do you support what this veteran did?"}]
