[{"comment_id":"10153884962054228","commenter_b":"They need to die","commenter_a":"They should be beat to death","post_message":"The child was locked in a room, bound with duct tape over his eyes, beaten with belts and a hammer.  That is not the worst part."},{"comment_id":"1673203152922095","commenter_b":"Fucktards.","commenter_a":"Oh come on....we have laws for a reason..I don't care what color your skin is...if you urinate in public..you need to be arrested!!! What is this world coming to???","post_message":"New York City’s city council is set to dilute a host of criminal laws including laws against public urination and excessive noise because council members believe too many members of minorities are getting arrested."},{"comment_id":"10153724968238145","commenter_b":"Wow the desperation of perverts grown woman don't want you so you seek a teenager . Get rid of scum bag .","commenter_a":"Glad they got him.","post_message":"BREAKING: This happened at the Publix on SR-434 and Wekiva Springs Road. Angela Jacobs will have a live report at 12pm."},{"comment_id":"10154378006503352","commenter_b":"What is a thot?","commenter_a":"Why do they have to call her a thot??? Ridiculous article","post_message":"New photos of Amber Rose Doing Naked Sunbathing Indicate She Might Have Been Wearing Booty Pads All Along – Her Behind Disappeared! (PHOTOS)"},{"comment_id":"508257596043081","commenter_b":"His wife destroyed that college but gave herself $200k severance pay. They are crooks","commenter_a":"If Sanders were to be nominated and elected in Nov, big problem is that he has not raised money, or campaigned for, congressional Democratic candidates. In other words, Sanders will be no better off than Obama has been if he can't get enough members of Congress to pass his initiatives.","post_message":"The attacks are going to get more unhinged."},{"comment_id":"492872274234399","commenter_b":"Yes , but if an illegal begets an illegal. Guess what it's still an illegal in titled to nothing.","commenter_a":"Just because an illegal baby is born on uur soil does not make them a US CITIZEN. ........","post_message":"Breaking...WAY TO GO TEXAS!"},{"comment_id":"10154556133417235","commenter_b":"Good bye you old hag","commenter_a":"It could only have happened more quickly. Thank God for small miracles. Goodby. God Bless, where ever \"He\" .Kisses.","post_message":""}]
