[{"comment_id":"10154555938529411","commenter_b":"Deeick Foley Kiss my Muslim American ass you scum.","commenter_a":"A failed colonial Zionists nuclear power have learned a lot and definitely exceeded the Hitlers Nazi's regime. Free Palestine. #BDS","post_message":"For those who are 'murdered with a knife in the heart it does not matter if the child is 12 or 15'"},{"comment_id":"1006112072821407","commenter_b":"Demand Justice..Hillary doesn't deserve a Free ride.....","commenter_a":"Clinton Mafia is on the Move #NeverHillary #NeverAgainBill!!!","post_message":"FBI Director James Comey detailed Hillary Clinton massive destruction of government records and grossly negligent handling of classified information. Frankly, there a disconnect between Comey devastating findings and his weak recommendation not to prosecute Hillary Clinton. Federal prosecutors, independent of politics, need to consider whether to pursue the potential violations of law confirmed by the FBI."},{"comment_id":"10154291814626178","commenter_b":"Everything she touches goes to h**l.","commenter_a":"Well if they have a remake of the Munsters she might have a chance. Looks like a cross between Grandpa and Eddie.","post_message":"Michelle Obama to appear on another television show. Is this an appropriate role for the FLOTUS?"},{"comment_id":"10153465235771316","commenter_b":"I guess the woman in this pic is borderline retarded...","commenter_a":"They can store more farts too so that's good","post_message":"Women with larger behinds are healthier and more intelligent, study finds: @webpagelink"},{"comment_id":"1643657415907529","commenter_b":"Literate people too lazy to read...","commenter_a":"And...this thread has made me loose hope for humanity.","post_message":"What is it and why is this happening?"},{"comment_id":"1771115309794499","commenter_b":"Lock that b@tch up","commenter_a":"Obama did not even TRY to fix anything. He continued with the corruption at DC. And after 8 years his answer is \"vote for Hillary so she can\". And some people are actually falling for it. Pathetic!","post_message":""},{"comment_id":"10152878773282217","commenter_b":"Jeanette is a bit of an obsessed weirdo","commenter_a":"Organised religion is worse than organised crime","post_message":"Why is Magna Carta so important?"}]
