[{"comment_id":"1011931832233204","commenter_b":"They don't really care about fetuses either. If they did, they'd be storming fertility clinics, demanding that leftover embryos be implanted in someone's uterus. No, this whole thing is about controlling women.","commenter_a":"The Republicans & Right Wing Christians are trying to take woman back to the 50's. Women should know their place, sit down & shut up.","post_message":"After seeing all the pro-lifers cheer the attack on Planned Parenthood yesterday, it's time to remind ourselves of how they really feel about human life.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1603818663247762","commenter_b":"The Lying Queen","commenter_a":"The Clinton Crime family song Dirty deeds done dirt cheap AC/ DC Clinton Crime family song","post_message":"WATCH: Hillary Clinton news conference on FBI investigation."},{"comment_id":"10153101086445736","commenter_b":"a burnt pussy lips","commenter_a":"Shannon Linda Harman","post_message":"Thanks to some \"Sound Prosthetics\" Honey and Badger are on a roll."},{"comment_id":"10153680098799772","commenter_b":"Support SAFE ACT 1214 hr 1942","commenter_a":"That's just a dummy computer. There is no glow on her face from the screen. There is no reflection of the screen in her eyes. Maybe even she is just a mannequin?","post_message":"Getting ready to start this Facebook Q&A!"},{"comment_id":"10153233984390950","commenter_b":"Did you think women are incapable of evil","commenter_a":"And the people who are saying the women and children are safe, check out who blew herself up with the suicide vest","post_message":"Police give update on raid near Paris: • Woman wearing explosive suicide vest blew herself up • 7 suspects taken into custody; 2 suspects dead • 5 officers reportedly injured; police dog killed"},{"comment_id":"10152641066602061","commenter_b":"She not mom she don't deserve kids.","commenter_a":"No true mother would ever give up her child she should not be allowed to have any more children!","post_message":"UPDATE: Mom calls decision to give up newborn with Down syndrome \"hardest moment\" of her life. @webpagelink"},{"comment_id":"10153424148207016","commenter_b":"If she's been forced to left that means that's not what she wants to do I will never ever ever ever ever ever vote for that woman. I'm voting in this election because we have to get rid of Republicans and bought Democrats but I'm writing in Bernie Sanders","commenter_a":"After picking myself off the floor from laughing so hard, I have figured out that one way or another, Senator Sanders will be the real winner no matter what happens in this race. A change is coming in American politics, and even Hillary Clinton won't be able to stop it. Delay it, maybe, but the majority of the American people from all sides have had enough with business as usual at their expense and are mad as hell about it. Just look at the long lines at the polls and the huge turnouts at Bernie Sanders' rallies if there are any doubts - that is the beginning of the revolution which Sanders is talking about.","post_message":"Left enough already?"}]
