[{"comment_id":"908359942543967","commenter_b":"I'd love to meet and spit in her face. What a sick bitch","commenter_a":"Beast","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"10154754635023352","commenter_b":"Bridgette,u r s/o but ur lettin dem bitches knw wat it is.","commenter_a":"Her vagina is probably getting dry and can't keep up with him anymore..jk","post_message":"It’s over! Jennifer Lopez, 47, splits from toyboy Casper Smart, 29, after five years together"},{"comment_id":"1147292828682585","commenter_b":"Go to Hell Bitch!","commenter_a":"Her earrings are real classy. Hah!","post_message":"The Black Lives Matter crowd gets crazier every single day. Now the woman who co-founded the group says that \"white folks\" need to make a special sacrifice to everyone else. You won't believe what whites are supposed to give up..."},{"comment_id":"905390669594112","commenter_b":"@username you must have a patheticly small one if it turns into an innie","commenter_a":"If you have an innie, use the women's. If you have an outie, use the men's. That's not difficult.","post_message":"BREAKING: The Supreme Court just ruled on their first transgender case..."},{"comment_id":"1349378628409086","commenter_b":"If the left gets anymore crazier than it already is, they will probably force all heterosexual women who got impregnated the natural way from a heterosexual male to undergo an abortion, and only lesbians and transgender \"men\" can have babies. They want a world where only lesbians, homosexual men, and transgenders exist.","commenter_a":"The day is going to come when it will be possible to determine if your child will turn out like \"They\" before they are born. We shall see how much the left loves abortion then.","post_message":"This is getting out of hand..."},{"comment_id":"1258250390858975","commenter_b":"She's trash too,","commenter_a":"No jobs or their boss refuses to buy group health insurance and a heavy extra tax next year for not having health insurance. All those young healthy folks need to buy premiums so the insurance companies keep up their profits.","post_message":""},{"comment_id":"1080954051971524","commenter_b":"We will celebrate when she leaves the White House!","commenter_a":"How about a national party when they move out of our house???","post_message":"Would you be COOL with this? Or does the thought of this make you gag?"}]
