[{"comment_id":"1250167005050052","commenter_b":"Fuckgirls. Yep.","commenter_a":"Aja can fuck girls be one word? Lmao","post_message":"Let us know! #2016 #WSHH"},{"comment_id":"1708135839246157","commenter_b":"Wasn't British ppl rebuilt London Coventry Liverpool after WW2, immigrants can have their place IF they have something to offer in return","commenter_a":"The multicultural experiment hasn't worked ... ethnic ghettos are the proof. People like to live amongst like minded people, it's just natural behaviour.","post_message":"Swear oath to live in Britain"},{"comment_id":"10153154397831051","commenter_b":"Trump is absolutely right. Illegal aliens are not immigrants by the way. They are merely common criminals. Criminal is not a race.","commenter_a":"I don't want their jobs but we need our benefits. Would you let your kid go hungry to feed a stranger?","post_message":"We went to the Donald Trump protest this week to speak to his supporters and critics. Here's what they had to say. Do you agree or disagree with Trump when it comes to immigration?"},{"comment_id":"10154138437276323","commenter_b":"Did the author ever hear about choice. this is the kind of thing that drives one crazy about women","commenter_a":"It's our choice","post_message":"“We’ve been groomed – by the media, by advertisers, and now by ourselves – to understand that our gender has to try harder, to consume more, when it comes to our appearance. We’ve been taught to fear growing old.”"},{"comment_id":"10156072867635389","commenter_b":"Ramos was rude but so was Trump.","commenter_a":"Trump of course","post_message":"Question of the Day: Who do you think won last night’s exchange: Jorge Ramos or Donald J. Trump?"},{"comment_id":"10153638033307377","commenter_b":"dumb@$$","commenter_a":"Sooooo, did Michelle Obama use any words that Laura Bush used? Hmmm a good listen.","post_message":"Bill Kristol, editor of The Weekly Standard, has delivered an eleventh-hour pep talk to Republicans."},{"comment_id":"10152984478206130","commenter_b":"That woman looks so pissed in every photo I have seen of her lol","commenter_a":"There is no \"key\" to living a longer than average life span. It's all about good genetics and being healthy","post_message":"“I feel good. I don’t feel sick. I’m still trying to do the right thing is all.”"}]
