[{"comment_id":"10155273231713132","commenter_b":"She has medicine that causes it, you hateful witch!","commenter_a":"Umm not a role model for my child, sorry. Good dancing though, kid seems happy","post_message":"You go girl!"},{"comment_id":"10152814946648822","commenter_b":"Should have been three to six YEARS ! This woman is NUTS !","commenter_a":"I love the people on here, who claim to be about humane treatment of animals; but, they want this woman to get beat to death, while in jail. Hypocrites.","post_message":"The woman accused of stealing and euthanizing her neighbor's dog is headed to jail. Today she was sentenced to 3-6 months for killing the husky named \"Thor.\""},{"comment_id":"10153126119146770","commenter_b":"You aint no Woman Be otch","commenter_a":"What a joke, your no hero you did this by choice!","post_message":"Protesters hurled insults at Caitlyn Jenner as he left a Chicago hotel yesterday."},{"comment_id":"614667495400588","commenter_b":"although she used the same structure as the \"hero myth\" that Joseph Campbell taught us to be a structure present in all traditional cultures","commenter_a":"Yeah, gonna have to disagree with this article. Just because whiny liberal twenty-somethings are hijacking the HP narrative for their agenda does not mean that the series is poorly written or guilty of propagating a false view of the world. Sure, Rowling is loudly liberal herself. But as a conservative I can, and do, greatly enjoy her books.","post_message":"Let's be honest, J.K. Rowling isn't a very good writer."},{"comment_id":"989628607749873","commenter_b":"Lord have mercy, poor little baby, may he rest in peace.","commenter_a":"HOW?!?! HOW DOES THIS HAPPEN?!?! I just can't wrap my head around it. I have tried to understand but I am also a busy/working mother and I just can't understand how you can forget about a child in a car.","post_message":"Parents, grandparents and caregivers of any kind - PLEASE remember to always check your vehicle: @webpagelink"},{"comment_id":"1746177368955196","commenter_b":"she's full of it","commenter_a":"WTF this is what she said in her tweet: For the record, my book \"Settle for More\" does not suggest Trump had any debate Qs in advance, nor do I believe that he did. -","post_message":"MEGYN's LATEST CLAIM. @webpagelink"},{"comment_id":"812922865409803","commenter_b":"Imagine being the daughter of the two biggest a$$es in recent history - how would YOU react?","commenter_a":"she is a teenager, let her alone .... I am as anti-obama as the hext person, but geeeeeeeeeeez ... don't attack a kid","post_message":"Why is she supporting this?"}]
