[{"comment_id":"1002700983109302","commenter_b":"Someone should ducktape her mouth","commenter_a":"Somehow, that doesn't look \"allegedly\".","post_message":"Woman facing animal cruelty charges after allegedly duct taping her dog’s mouth shut, then posting photos on Facebook: @webpagelink"},{"comment_id":"614337382087891","commenter_b":"you people get ready for WW 3 because that's where this is heading","commenter_a":"Hillary not trump","post_message":"Join Ohio State students on their ride to vote early LIVE with Jo Ling Kent.   Get all your election coverage here: @webpagelink"},{"comment_id":"1336023863131032","commenter_b":"Ppl crazy af time for u ta go","commenter_a":"Renata","post_message":"The female had to get some  in too. #WSHH"},{"comment_id":"1191489804269278","commenter_b":"angelina illegal aliens? they want nothing more than death? you are so ignorant!! i dont recall illegals shooting up schools bombing up marathons or commiting any acts of terrorism. People like you make me sick. People dont come to this country to just commit crimes they come the same reason you or your ancestors came. your opinions are ignorant af","commenter_a":"America is now the land of sore losers and cry babies!!!","post_message":"Workers remove the Trump signage from 3 Trump Place apartment buildings in New York City after successful petition calling for removal. @webpagelink"},{"comment_id":"890384730998868","commenter_b":"They need to be sterilized so they can't reproduce themselves!","commenter_a":"Obama and Sharpton seeing this would say \" these fine young gentlemen were just defending themselves from her whiteness. She was in the wrong place at the wrong time and they have a right to do this. They were the victims here for the media was recording them acting like a bunch of crazy violent animals. So, in self defense, they mugged her and her cameraman. It's only fair after all since the white man has being doing this forever. Isn't that right Mr President, the most powerful man in the world elected by these white oppressors to be so? At any rate we believe these fine young gentlemen, who could after all be our sons, all deserve scholarships for 4 free years of college, extra food stamps, and free cases of colt .45 malt liquor each.\"","post_message":"\"Stop!\""},{"comment_id":"10155173773771320","commenter_b":"Barbie has Ken what's the difference....","commenter_a":"Good grief!! My oldest granddaughter collected them, but this is plain stupid! Why don't you make an American Boy series???","post_message":"Big news in the world of toys. One of the newest American Girl dolls is... A BOY! It is the brand's first boy character. He is a drummer in a Nashville band. Thoughts? @webpagelink"},{"comment_id":"760149437402889","commenter_b":"She's a fucking looney bitch","commenter_a":"Right wing shrieking is true.","post_message":"Chris Hayes throws down with Americans for Prosperity's Jennifer Stefano over the right’s relentless focus on destroying the health care law. #BestOf2014"}]
