[{"comment_id":"10153436827584153","commenter_b":"very often though.","commenter_a":"it's burning 24/7 don't even try to go there.","post_message":"Would you go vacation in Greece now, despite the economic crisis?"},{"comment_id":"1167192579994034","commenter_b":"Hi joannie.","commenter_a":"Yet John Calvin believed and taught that murdering a baby in the womb was an act of the god that he worshiped. That god is the cause of everything including sin.","post_message":"Amen!"},{"comment_id":"10153055275424877","commenter_b":"How can a woman rape a man..??","commenter_a":"interesting turn of events","post_message":"Mother of 3 arrested for breaking into a man's apartment and raping him while he slept. Grio fam, if she was a man do you think her sentencing would have been more severe? Sound off below!"},{"comment_id":"10155065453241323","commenter_b":"You still refuse to answer the question.","commenter_a":"An admirable academic for sure . But; one line in the video had me chuckling \"And then population growth will stop\". Naive to think population growth will ever stop. Deluded dreamy lefty thinking.","post_message":"\"Let me show you the world\", said Swedish academic Hans Rosling, who has died aged 68. Here he demonstrates the dynamics of population growth, child mortality and carbon dioxide emissions. The challenge for the world is to get everyone out of extreme poverty and get the richest people to use less fossil fuels, he said."},{"comment_id":"10156046301859896","commenter_b":"Romona de Araujo Lol lol lol lol lol lol Lol lol lol lol lol lol You think someone who earned a living from porn and NEEDED TO READ A PRAYER...THE MOST COMMON OF PRAYERS... FROM A TELEPROMPTER IS THE VEHICLE TO BRING GOD BACK INTO AMERICA. OMG ...WHAT THE HELL IS WRONG WITH YOU. IN ADDITION, LET ME REMIND YOU THAT SHE HAS MADE A CONSCIOUS DECISION TO REMAIN MARRIED TO A SELF- PROCLAIMED SEXUAL PREDATOR. MY DEAR GOD WAS NOT SMILING DOWN IN APPROVAL AT MELANIA, AS SHE READ RELIGIOUS WORDS OFF A TELEPROMPTER ... HER ATTEMPT TO BRING A PRAYER INTO HER ACT ....OF ATTEMPTING TO CON US INTO BELIEVING SHE IS RELIGIOUS ....WAS A TOTAL DISRESPECT TO THOSE OF US WHO ARE TRULY RELIGIOUS AND HAVE THE LORD'S PRAYER IN OUR HEARTS AND LIVE BY THE WORDS OF THAT PRAYER. FANTASTIC....YOU NEED TO LOOK UP THE WORD ...","commenter_a":"Of course satan and his demons would be offended. I think she was fantastic!! Take God out of any country and it quickly loses it's greatness. It's about time America's bringing Him back.","post_message":"Progressive \"Love\" and \"Tolerance\":"},{"comment_id":"10154274085621756","commenter_b":"Ok ok all color aside its true that all girls are trouble makers!!","commenter_a":"It's not race, but class. If two parents have to work, there's less support for childhood development. Every problem we have stems from a lack of appropriated resources while a fat cat sits happy.","post_message":"Black girls are punished at school at rates that are even more disproportionate than those experienced by black boys."},{"comment_id":"1353412211336912","commenter_b":"Women outlive men because they don't marry women!","commenter_a":"Good grief, it's been known for eons that women have greater endurance, etc., etc. I'm reminded of a book written in the 1950s by noted anthropologist Ashley-Montagu, entitled \"The Natural Superiority of Women.\" The male anatomy excels in only one area: upper body strength, a left-over from prehistoric humans. Ashley-Montagu is not by any means the first to recognize and write about this. It should be obvious to anyone, really, when you recognize that, despite the physical ravages of child-bearing, women live longer than men.","post_message":"Questions about Clinton’s health just won’t go away — partly because they fit so neatly with longstanding sexist tropes about women’s weakness."}]
