[{"comment_id":"10153864924433984","commenter_b":"she should be sent to self defense classes .","commenter_a":"Sadie, the bully, should be charged with felony assault. Punishment: lengthy juvenile detention and expulsion from school AFTER standing in front of her school during AM student drop-off and PM student pick-up wearing a sign stating, \"I am a BULLY!\" Her parents should also be made to stand beside her donning signs stating, \"We raised a BULLY!\" and have to pay restitution to the victim's family.","post_message":"A 5th grade bully decided she was going to throw her weight around to torture another student at her school. However, she was about to find out that's not how things work...  She got justice, and she got it fast."},{"comment_id":"969742843072343","commenter_b":"Women shouldn't get a free pass to kill.","commenter_a":"After a speech, pro-life activist Penny Lea was approached by an old man. Weeping, he told her the following story: \"I lived in Germany during the Nazi holocaust. I considered myself a Christian. I attended church since I was a small boy. We had heard the stories of what was happening to the Jews, but like most people today in this country, we tried to distance ourselves from the reality of what was really taking place. What could anyone do to stop it? A railroad track ran behind our small church, and each Sunday morning we would hear the whistle from a distance and then the clacking of the wheels moving over the track. We became disturbed when one Sunday we noticed cries coming from the train as it passed by. We grimly realized that the train was carrying Jews. They were like cattle in those cars! Week after week ...","post_message":"Wise words from one of our Founding Fathers. Do you agree?"},{"comment_id":"10153372677575950","commenter_b":"And Kaye Townsend you are an example of an ignorant Bitch","commenter_a":"Screw going to the hospital to better anymore. Lets post getting shot and see how many likes i get","post_message":"Shortly after being shot in her car, a woman turned to Facebook to send a video message to loved ones: \"Mama I'm bleeding. I know they shot me but it's good. It's good.\""},{"comment_id":"569853826519212","commenter_b":"So how was your nap after clearance today then?","commenter_a":"@username this is you","post_message":"Facts"},{"comment_id":"1843613252518265","commenter_b":"Squirting and peeing may release the same fluids but the acts are totally different. You would know if you've ever made a woman squirt...","commenter_a":"Think the only people who care are the women who can't squirt and the guys who can't make women squirt","post_message":"Happy Valentine's Day!"},{"comment_id":"547509162098460","commenter_b":"I can t push like I push agree!","commenter_a":"sounds like you support clinton ted","post_message":"Our nation is at war. From 9/11 to the Boston Marathon, from Fort Hood to Chattanooga, from San Bernardino to last night’s horrific attack in Orlando, radical Islamic terrorism has declared jihad on America. Early reports indicate the Orlando terrorist had pledged his allegiance to ISIS, and he had previously been investigated by the FBI. And yet, as with the prior attacks, we were not able to act to stop this act of vicious terrorism that has now murdered 50 and injured more than 50 others.   Our hearts go out to those killed and wounded last night. Our prayers are with their families, and with all their grieving loved ones.      It is a time for action. We need a Commander in Chief who will speak the truth, and who will unleash the full force and fury of the American military to utterly destroy ISIS and its affiliates. We need to pass the Expatriate Terrorist Act, so that known ISIS terrorists cannot use U.S. passports to return to America and wage jihad. We need a President who is serious – who will identify the enemy by name and do everything necessary to defeat it.   The next few days will be sadly predictable. Democrats will try to use this attack to change the subject. As a matter of rigid ideology, far too many Democrats – from Barack Obama to Hillary Clinton – will refuse to utter the words \"radical Islamic terrorism.\" They will claim this attack, like they claimed every previous attack, was isolated and had nothing to do with the vicious Islamist theology that is daily waging war on us across the globe. And they will try to exploit this terror attack to undermine the Second Amendment right to keep and bear arms of law-abiding Americans.   Enough is enough. What we need is for every American – Democrat and Republican – to come together, abandon political correctness, and unite in defeating radical Islamic terrorism.   ISIS doesn’t just target soldiers. They don’t just target Republicans. Or Jews. They also target Christians and fellow Muslims. They target each and every one of us. As we saw this morning, they target the gay and lesbian community. Their objective, which they broadcast worldwide, is to murder or forcibly convert every single American.   For all the Democrats who are loud champions of the gay and lesbian community whenever there is a culture battle waging, now is the opportunity to speak out against an ideology that calls for the murder of gays and lesbians. ISIS and the theocracy in Iran (supported with American taxpayer dollars) regularly murder homosexuals, throwing them from buildings and burying them under rocks. This is wrong, it is evil, and we must all stand against it. Every human being has a right to live according to his or her faith and conscience, and nobody has a right to murder someone who doesn’t share their faith or sexual orientation.  If you’re a Democratic politician and you really want to stand for LGBT, show real courage and stand up against the vicious ideology that has targeted our fellow Americans for murder.   Today, all of America stands in solidarity with the people of Orlando. All of us should lift them up in prayer, demand action, and if you have any information about the Orlando shooter or potential radical Islamic terror plots, please act to keep us safe by using the FBI tips website: @webpagelink"},{"comment_id":"10153231132726336","commenter_b":"they should leave and not allowed back","commenter_a":"Look all black","post_message":"\"If you don't like what that flag stands for... leave!\"  On 'Fox & Friends,' Medal of Honor recipient Dakota Meyer called for a social media campaign to counter a movement encouraging Americans to stomp on the flag."}]
