[{"comment_id":"973103659397159","commenter_b":"Those girls have shallow, ugly, pugnacious souls. All that effort they put into making their hair into rat's nests would have been better spent reading something other than grocery store gossip rags.","commenter_a":"It's really frightening to see, how intolerant and religiously fanatic people can be. I can't see any difference between Christian or Islamic fundamentalism. Both are as dangerous and frightening. It's really sad, that people will believe more in something people has written ages ago, instead of in the scientific facts we have nowadays, and that they will judge people according to some moral standards from the Middle East (by the way the same moral standards as in Islam), instead of thinking for themselves. And before anyone says the Bible is God's word, show me ONE sentence that is written by God, or Jesus, or even anyone living at the same time as Jesus. There is no such sentence.","post_message":"George Takei says it right. Let's \"kick the ick\" out of our public discourse!"},{"comment_id":"10153775506759203","commenter_b":"@username Look over this list....Drugs & guns to YOUR front door, so tell me again how gun control works!!!! @webpagelink","commenter_a":"Gun bans have always had the same effect once implemented: none. They do not create a (sustained) period of increased murders, nor do they reduce the rate of homicides.. @webpagelink","post_message":"\"We can toughen background checks and stop the sale of firearms to folks who have a violent history or history of mental illness.\"  Amy Schumer"},{"comment_id":"10153838476451509","commenter_b":"We \"poor people\" are richer than she'll ever be. Shallow, vapid tart.","commenter_a":"Grande opening, Grande closing. Hopefully her career.","post_message":"Security footage showed singer Grande appearing to \"maliciously lick\" a donut in a shop: @webpagelink"},{"comment_id":"1436141653072527","commenter_b":"Europeans, that's a joke all in its self.","commenter_a":"For all those that think protests didn't block traffic in MLK days. Stop using him as your go to pawn thinking you know something about civil disobedience and fighting for rights.","post_message":"It's the image that is defining a protest movement."},{"comment_id":"10153459562633445","commenter_b":"No jail time and no probation for less than ounce....Wasted time n court's and jail space.....GET REAL GO FOR CARRIER CRIMINALS ,AND MURDERS ,LOCK THEM UP NOT A POT SMOKERS GETTING BELIEF N PAIN MANAGEMENT ,NO PILLS ,DAAAAAAA","commenter_a":"www.premierepotpourri.com","post_message":"#Pot Matters: Marijuana, the Courts and Probation"},{"comment_id":"1255092294541839","commenter_b":"He could be doing Mexico a favour by building this wall. Just think of how many tourists will flock to see this Great Wall of Mexico. Just like in China with their wall it could be worth millions of dollars every year to the Mexican economy. Also if he thinks that building this wall will stop people crossing the border into America every year from Mexico he's deluded what's he gonna do build it sky high to stop them coming in by air or build it around the coast to stop them coming in by sea and check every single shipping container coming into the country to make sure they aren't hiding inside or close off the border with Canada to make sure they haven't flown north first and are then coming in from the North. Get real people. This guy is deluded and the people who believe him are ...","commenter_a":"WTF !!!","post_message":"\"We will build a great wall along the southern border,\" Donald J. Trump told a crowd in Phoenix, Arizona, during his immigration speech. After a long pause, he continued: \"And Mexico will pay for the wall.\" @webpagelink"},{"comment_id":"10154275931541509","commenter_b":"Do all the chicks look like you?? Pass....","commenter_a":"Welcome to the best dating agencies believed Malaysia We have a wonderful effect RICH SUGAR MUMMY / DADDY / IN MALAYSIA be among the people to get our exclusive link We are reliable and efficient in our work get a chance to meet with them we have a sugar mummy throughout Malaysia who are willing to lavish money on your car and home a contract extension.. To help get the job started., start calling right now to get in touch within 24 hours and make more money noted., applicants must be 18 years or older and must have a significant personality dinner with mummies , and wealthy Daddies .. Each of the night you spend with her or your daddy , will pay you RM5,000 .. This is a bonus for every interested applicant available . Every interested applicant for a hook up meeting appointment, must contact our Agency Mrs ...","post_message":"\"They were robbed of their stage. ... Tonight, we give them ours,\" Bono told the crowd.  For the first time since  #ParisAttacks, Eagles Of Death Metal make an emotional return to the stage alongside U2 @webpagelink"}]
