[{"comment_id":"10153534003896336","commenter_b":"He's also a Democrat","commenter_a":"our Massachusetts senator markey voted not to defund planned parenthood","post_message":"BREAKING NEWS: Senate blocks Republican legislation to defund Planned Parenthood. @webpagelink"},{"comment_id":"10154378724845575","commenter_b":"This woman is pathetic","commenter_a":"Yet if the employer gets caught with them they are breaking the law. Obama's people have to go. Trump 2016","post_message":"Unbelievable . . ."},{"comment_id":"10152982959796130","commenter_b":"AMEN!","commenter_a":"Every member of Congress should do the same","post_message":"The #FoodBankNYCChallenge is meant to raise awareness about hunger and the struggle to live on such a limited budget."},{"comment_id":"487739541416626","commenter_b":"She is an Ass","commenter_a":"Ann is not afraid to speak out she is a very brave lady","post_message":"This brave woman just called Obama a primate on national television.  She made a huge stand against our president, let's show her our support.  Do you endorse her public defiance against Obama?"},{"comment_id":"1553360474683977","commenter_b":"This sellout Hispanic wants to sell you some crappy shirt","commenter_a":"As American hispanics, we are tired of how all of these coward racist liberals that hate America like Obama, Clinton, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, we're supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of our skin... disgusting. That's why we support Donald Trump. Show everyone your support for Trump by buying the fantastic Trump Strong t-shirt at: www.teespring.com/trumpstrong . And let's Make America Great Again! Thank you.","post_message":"During a Colorado rally on Sunday, Trump unfurled an upside-down rainbow flag with the words \"LGBTs for Trump\" written on it."},{"comment_id":"723743707725776","commenter_b":"@username Marco can't stand ya!","commenter_a":"Why don't they go after his immorality.. Didn't he cheat on two of his wives. He is no Christian and then also said he has never had to ask for forgiveness OMG Adultry is a Commandment","post_message":"Donald Trump started a mortgage company (that failed) at the worst possible time -- when the housing bubble was about to burst."},{"comment_id":"10153639008667098","commenter_b":"Down the street prima","commenter_a":"@username @username not near you guys?","post_message":"WOAH, that's a big sinkhole. It's over in Madera near Fresno and it's almost 20 feet deep.   Read more: kron4.com/2016/04/12/video-giants-sinkhole-swallows-street-in-madera/"}]
