[{"comment_id":"10153218890796336","commenter_b":"^ baseball, hockey, and wrestling","commenter_a":"Should white people riot the NFL Draft?? 95% black were drafted last night","post_message":"JUST IN: Five of the six Baltimore police officers charged in the death of Freddie Gray are in custody, according to Mayor Stephanie Rawlings-Blake. @webpagelink"},{"comment_id":"10152740114462623","commenter_b":"He dumb sis","commenter_a":"Bos Larry look...","post_message":"A Greensboro teen has been charged with inciting a riot for allegedly using social media to encourage followers to meet at a mall to loot stores and attack police this weekend."},{"comment_id":"10154362244534778","commenter_b":"This is a symptom of disrespect. Did the office overreact, perhaps. What do you do with a teenager that doesn't listen to authority? Continue to let her disrupt the class? This girls deserves to be punished. She may have gotten hurt because of her initial defiance but she is not a victim. They should review the incident and I hope they clear the officer of everything and I hope they give the girl detention. If we don't stop the disrespect, the result is anarchy.","commenter_a":"This kid did not attack anyone she may have ignored commands peacefully as most protestors will do but in no way is that a crime. The violent attack from this cop was in fact a crime.","post_message":"About 100 students wore T-shirts reading \"Free Fields\" or \"#BringBackFields.\""},{"comment_id":"914542602012252","commenter_b":"Communist asses back to Europe? That's a pretty racist thing to say isn't it. That's like me telling you to take your racist american hating ass back to africa","commenter_a":"The black community should be ashamed of backing this criminal","post_message":"People are going to EXPLODE on Fox."},{"comment_id":"930011010437419","commenter_b":"Lady u need help fuck grump","commenter_a":"\"Semame?\" Really, is spell checking really that difficult? I'm only pointing this out because it's a constant with your memes and videos. As funny as they are and as much as I enjoy them, please, for the love of God, use spell check. You look like buffoons when you misspell such easy words.","post_message":"WATCH: 10 years ago, Sesame Street called out trashy Donald Grump. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154111974819726","commenter_b":"check out her multiple lies prior to this...this chick is no journalist","commenter_a":"I can believe a liberal reporter pulling this nonsense stunt, but not someone from Breitbart! Conservative commentators have lost all respect from me if theyre going to pull these moves against anyone.","post_message":"WATCH: The now infamous video of Trump's campaign manager Corey Lewandowski allegedly grabbing Michelle Fields. What do you think happened?"},{"comment_id":"10153861358541680","commenter_b":"@username killary has had her head inside hitlers butt","commenter_a":"He'd tap that","post_message":"President Bill Clinton and Melania Trump greet one another before the first presidential debate begins."}]
