[{"comment_id":"10154153036124369","commenter_b":"She confuses common core with curriculum. Anyone against common core is against preparing kids for the job market. The curriculum used implementing common core was written by the text book companies and approved by local school boards. It's OK to be angry at that but Kasich has nothing to do with curriculum so hopefully now you can vote for him again.","commenter_a":"Wake up Ohio.. vote Trump. You need to understand everything Kasich stands for.","post_message":"Authorities in North Carolina say they are looking at Donald Trump's behavior as they continue their probe of a violent altercation at one of his rallies last week."},{"comment_id":"10153128305820933","commenter_b":"Kasich and Taylor can't be responsible when a trusted employee breaks rules behind their backs. Taylor has come out strong against the actions and has expressed deep disappointment that the Trust of the people was broken... as for Spencer (Tim) Balls crazy assertions. Kasich had nothing to do with the ordeal. Spencer (Tim) Ball has a vendetta against Worthington Christian Schools. Kasich's daughters attend the school. That is the only connection between the 2.","commenter_a":"Today's Columbus Dispatch (newspaper) had a good article revealing problems in the Lt. Gov.'s house.","post_message":"Gov. Kasich stopped to greet a small group in beautiful Peterborough, New Hampshire to end the week. See you again soon, New Hampshire! #nhpolitics #fitn"},{"comment_id":"1626581144301352","commenter_b":"Amy shular should just go do porn. Nothing else it will shut her pie hole with a dick in her mouth.","commenter_a":"Of course they won't leave. They won't be treated like \" royalty\" ( said sarcastically ) anywhere else 😩😩😩","post_message":"It was only a matter of time..."},{"comment_id":"997010993718412","commenter_b":"Islamic Terrorist, go home, stop trying to change the U.S.A.","commenter_a":"No true American is safe as long as Islam is allowed to exist in our nation! We true Americans must unite against this plague and the liberals who allow them to destroy our lives and wipe them from our nation so we can ensure the safety and security of our nation and the American people!","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack. He is a hero, and will always be remembered as so. Can we get 150,000 'LIKES' for this brave boy?"},{"comment_id":"10152987522331336","commenter_b":"Hahaha stupid white girls","commenter_a":"Wish we could deport him..","post_message":"Moments ago, President Barack Obama vowed to appeal a federal judge’s ruling to block executive action on immigration. @webpagelink Don't miss Texas Governor Greg Abbott's response tonight at 10p ET on 'Hannity.'"},{"comment_id":"1352088188153471","commenter_b":"So Trump is going to run the country so great but can't keep tabs on his own tower? ( a case he was guilty in) it's not even about that though, it's more his hypocrisy and saying he'll bring jobs back when he's hiring illegals.","commenter_a":"This showed me how Cruz an rubio are like.senators who are liars.Trump is the only one to make America great again.","post_message":"One word: FINALLY."},{"comment_id":"576110785930150","commenter_b":"@username did she grab them by the pussy?","commenter_a":"Read stories that when Slick Willie was president, the spent more of their time protecting him from Killary than anything or anyone else when she went on her ballistic tantrums.","post_message":"Not only is she corrupt, she's also beyond rude and disrespectful to those who protect her very life. So many who've worked for her attest to her nasty nature. natl.io/ghciVB"}]
