[{"comment_id":"749014911913950","commenter_b":"Is it possible..he can sink much lower? any bets.....again I'm speechless..he gets to just say things like this with absolutely no consequences at all!!...well..here's one consequence: VOTE BLUE UP AND DOWN THE BALLOT AND GET ALL THESE BIGOTS OUT OF OFFICE; OUT OF HOUSE AND SENATE ...","commenter_a":"Scum . Bottom feeder","post_message":"Now Trump's after dying people. See if you can stomach this. -- Annkia"},{"comment_id":"569853826519212","commenter_b":"So how was your nap after clearance today then?","commenter_a":"@username this is you","post_message":"Facts"},{"comment_id":"10153816352544726","commenter_b":"This dumb bitch deserved it!!!","commenter_a":"I'm sure it was a hate crime right?","post_message":"WATCH: Trooper Orders Woman To Leave Florida DMV, But She Refuses...Then Goes Nuts!"},{"comment_id":"881686708534340","commenter_b":"Still doesn't eliminate the fact that your router has been hijacked.","commenter_a":"Ad Block Plus add on for Chrome and Firefox","post_message":"If you're seeing scammy ads on legitimate sites, hackers may have gotten to your router."},{"comment_id":"10153201571853812","commenter_b":"Hes a witch!","commenter_a":"Ahmed Shannon Nathan Jake Conrad Robert Ya Ron Ronaldo","post_message":"WATCH: In Portland, Maine, it is cold. Very cold. THIS cold. -- [ VIDEO: Portland Police Department] - ABC News Weather"},{"comment_id":"10153859068156955","commenter_b":"Leave the mug and leave her alone.","commenter_a":"She didn't like the interview either, (\"Not one bit\"). Did they ask Ms Flossie if & when SHE wanted to be interviewed? It was all very awkward. They gave her a station coffee mug (shameful)... Put flowers on her lap that she can't hold... The kicker to me was the opening where the interviewer held up the newspaper RIGHT IN FRONT OF HER FACE!!!! The whole thing was disrespectful.","post_message":"BEST INTERVIEW EVER"},{"comment_id":"10152906075606336","commenter_b":"@webpagelink In case you wanted to read the rest of what Seth Rogen had to say, not just the original tweet that was blown WAY bigger than it needed to be.","commenter_a":"Well said craig","post_message":"Country music singer and military veteran Craig Morgan fired back at Seth Rogen for his American Sniper comments. @webpagelink"}]
