[{"comment_id":"10154660100050575","commenter_b":"Is she one of those nasty girls with nasty feet","commenter_a":"Funny how Americans don't like crooks","post_message":"Oh, my!!"},{"comment_id":"10150734990144999","commenter_b":"Now it's time to loathe Coldplay, then in ten years, we can appreciate them again.","commenter_a":"Never heard of anyone hating him I think this is a media thing thought up by some little intern that thinks he was being smart","post_message":"After decades spent as the target of jokes and sneers, Phil Collins is getting a fresh look."},{"comment_id":"10153573907066509","commenter_b":"She couldn't bring women down, only herself!","commenter_a":"I don't want to swear.... but.....way to go bringing the equality movement down a peg! !!! You really didn't think that one all the way thru!!!! :(","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"},{"comment_id":"10153844066851770","commenter_b":"******* PENCE WHIPPED WITH A KAINE *******","commenter_a":"Not too much for me to say, I hope they both lose. God bless the U.S., amen.","post_message":"The #VPDebate is over, but there's still a lot to talk about. Like that rumor that Trump is mad about Mike Pence doing so well, or all those times Tim Kaine interrupted him. Keep watching for a special round of trivia, starring a giant tub of Nutella. Your hosts: Christopher Bedford, Christian Datoc and Katie Frates."},{"comment_id":"1288081714641540","commenter_b":"This is scary","commenter_a":"What kind of sick prople dream up this stuff are people so afraid to die that they will go to these means to create life just to torcher and kill it. Sick sick sick!!!!!!!!","post_message":""},{"comment_id":"1266833826777136","commenter_b":"I think this is the only remaining British cultural heritage??it should be nurtured and taken good care of.","commenter_a":"It's ceremonial !","post_message":"The campaign's gaining thousands of supporters"},{"comment_id":"10150666434674999","commenter_b":"Haters are a sure sign that future President Trump has hit the nerves of all those left wing panty waste liberals that pulled their heads out of the sand just long enough to realize that Hillary isn't the omnipotent goddess they thought she was. Dry those tears little babies. Like.....wipe it with a cloth.","commenter_a":"This country is such a mess, it would probably take a Donald Trump to get us back on track. Shows how far we have sunk. Thanks Obama.","post_message":"Something unmistakable has happened to Donald J. Trump since he announced his campaign for president in June: He has become a better candidate."}]
