[{"comment_id":"10153434470306323","commenter_b":"Vahan alko tanssijalkaa vipattaa :D","commenter_a":"Nora ootkos tanssinut taas?","post_message":"Five passengers were injured after a train derailed at Mumbai's Churchgate station on Sunday. CCTV shows the local passenger train crashing into the barriers and partly mounting the platform. Officials have blamed human error for the incident."},{"comment_id":"10153723467413984","commenter_b":"Wow what a woman","commenter_a":"You FOOLS! Let this American citizen out of jail and start concentrating on REAL illegals in this country! You have totally lost track of reality! In my 65 years on this planet I have never seen the U.S. Government be so dysfunctional as it is right now!","post_message":"Amazing. Kim’s 21-year-old son has just stood up for his mother in a HUGE way after she was ordered to jail, and it speaks volumes. Do you support Nathan Davis?"},{"comment_id":"952585388112135","commenter_b":"That is true @username however they will find no virgins on the other side.","commenter_a":"only way to deal with those ISIS thugs.","post_message":"“A tall bearded man emerged and drew a long knife...He began addressing the crowd and slapping the father and his son around the head and kicking them onto the floor.” That's when three shots rang out."},{"comment_id":"628439843967466","commenter_b":"Yep criminals think like that That is why she pointed a gun at the polw. @webpagelink","commenter_a":"Because they don't have anyone to be accountable to!!!","post_message":"This is for all of the victims of #PoliceMurder and #PoliceBrutality who never make national headlines in the mainstream media! @webpagelink"},{"comment_id":"10154008998213797","commenter_b":"Whites wouldn't understand discrimination lol you sound stupid how about the jews they were white how about the Irish when they came to America they were white what about any German that came over after ww2 they were white now tell me again how ur comments are relevant","commenter_a":"It's not like she labeled their ticket with racial slurs. I guess I don't see what the big deal is. If the waitress had put \"white couple\" on a ticket, no one would care.","post_message":"WAITRESS LABELS CUSTOMERS: Kimberli Wilson went out to eat, and when the bill came, she couldn't believe what was written at the top. The waitress labeled her table by race. Here's what happened when she confronted the manager:"},{"comment_id":"10153053091263984","commenter_b":"HOW ABOUT MOVE OUT OF THE WH!!!!","commenter_a":"all the kids should pack their lunch","post_message":"Alright Michelle Obama, 'Let's Move' on to you finding a new hobby. Preferably something that doesn't involve pushing this agenda on Americans..."},{"comment_id":"10153322688803132","commenter_b":"I hope she drops dead now in the pits of hell for what she did to this poor girl!","commenter_a":"How stupid can people get ???","post_message":"\"She's going to run till I tell her to stop. She's gonna learn ... I don't play with her.\""}]
