[{"comment_id":"10156742886720354","commenter_b":"Maybe they will accept the migrants destined for the USA.","commenter_a":"Good luck. You can have ours tooo","post_message":"The government of Canada has ordered its military to draw up plans for migrant camps that will allow more than 6,000 Muslims to be housed on a long-term basis at several Canadian Forces Bases...."},{"comment_id":"10153518944503984","commenter_b":"It's the Holy Spirit's job to convict or convince the unbeliever that they need a Savior. We can share the GOOD news that Jesus died and took our punishment for our sins but it is not our job to make people feel bad. Their hearts will know because of the Holy Spirit. We can share the news that we, too, were once sinners but now we are saints. People who come to God out of fear or condemnation usually won't stick around long because those emotions go away. People need to know that Someone has taken their punishment for sin for them and that they are loved more than words can say. We ALL are searching for love. Hope this helps.","commenter_a":"The Bible says it is the KINDNESS of God that leads people to repentance which is what it sounds to me like Joel Osteen is giving. Read the Word!! Jesus was not a hater no matter what people did. Paul or Saul, killed Christians too.","post_message":"Mega-church TV pastor Joel Osteen just made a sickening announcement about Muslims... Spread this absolutely everywhere... the REAL Joel Osteen needs to be exposed. Do you agree that Osteen is a fraud?"},{"comment_id":"1047357948654067","commenter_b":"Hopefully your girls won't grow up to be ignorant fools like you.","commenter_a":"While watching this video my four year old daughter asked, \"Who is that?\" I answered, \"@username, hopefully the first woman president.\" To that she replied, \"I love her. She's beautiful. I like her necklace.\" Can't wait for you to shatter that glass ceiling for my girls!","post_message":"An expectant mother in Iowa asked: What are your plans for parental and maternity leave?"},{"comment_id":"10153273305921051","commenter_b":"Sick ass Mother fucking Bastard, needs to be castrated and beat to death so he can feel the pain that poor baby felt, it just sickens me to hear of these evil people in the world.","commenter_a":"Convicts will likely shove reality up his ass!","post_message":"This guy did something awful to a 19-month-old girl. Now he's going to face the consequences."},{"comment_id":"10153157843033984","commenter_b":"I am thrilled! I pray someone stops the madness. We must enforce our immigration laws abs seal our borders.","commenter_a":"A judge with Balls","post_message":"Obama received a major smackdown last week! Amnesty plans halted!! Are you as happy about this ruling as we are?"},{"comment_id":"10154279210266028","commenter_b":"Don't you say Hey to me you ugly girl!","commenter_a":"@username @username Oh geez!","post_message":"The two classic American novels have been temporarily pulled from shelves in one Virginia school district following complaints from a parent. @webpagelink"},{"comment_id":"10154523609503984","commenter_b":"oh, Spanish ought to set you off too, especially those who want to make it our official language, after all it was Spain that did the most detriment","commenter_a":"Cynthia, America is not racist. There are racist people that live in AMERICA. Obama is a race baiting man stop being BLIND. It was VERY INAPPROPRIATE for the speech he gave in Dallas. If anyone has the TRUE right to be angry about racism it is MY PEOPLE, NATIVE AMERICANS. I don't see any blacks living on reservations in America.","post_message":"This guy hits the nail on the head. I'm sure race baiting liberals will be fuming after watching this. A lot of people took aim at Michelle Obama in 2015, but no one hit the bullseye harder than he did..."}]
