[{"comment_id":"610661985768228","commenter_b":"white kids of lower middle class know what it is like to be in those areas of transformation and watch their towns become unsafe ghetto's. These immigrants always come forcefully in the streets to establish turf and whites have dealt with it from every race that comes in. don't know ghetto's eh, some of us know and were forged in them. what an ill guided statement to make","commenter_a":"Love the positive comments here, and even if theres negative comments bernie will always have a great comeback as he did in the debate last night. This man deserves the title of president. So much can come from this stop thinking about it & vote for him","post_message":"I am very proud of being Jewish, and that is an essential part of who I am as a human being. My father’s family was wiped out by Hitler in the Holocaust. I know about what crazy and radical, and extremist politics mean. I learned that lesson as a tiny, tiny child when my mother would take me shopping, and we would see people working in stores who had numbers on their arms because they were in Hitler’s concentration camp."},{"comment_id":"1064050356984826","commenter_b":"Karen why do you want a President that would say, \"single payer will never ever come to pass\"? Despite over 58% of Americans supporting it, knowing it will save us money and insure everyone, and that every other industrialized country in the world has had it for years and years. @webpagelink Or someone who corporate lobbysists know will end up supporting the TPP? Do you know what this trade deal would do to my generations future? If you did you would not be voting for her. @webpagelink Please for my future and my generation future vote for Bernie in the primaries. #NoMoreTradeDealsThatSendJobsOverseas #HealthCareForAll #BernieForPresident #NinaTurnerForVP #WarrenForMajorityLeader","commenter_a":"It's Hillary's time! Bernie is good in the Senate.","post_message":"This is it—the Iowa caucus is today! If you’re standing with Hillary, share this."},{"comment_id":"10152963225776135","commenter_b":"I don't have daughters. I have sons. I teach them to keep their hands to themselves. When they're old enough to date, they'll be taught not to touch a woman unless invited. We shouldn't have to tell girls how to not get raped. We should be teaching our boys to not rape.","commenter_a":"When I was becoming old enough to go to parties as a teenager my mother started giving me the heads up about how to act when I went to out. One of the things she taught me was never drink so much that you lose control of yourself, watch who you accept drinks from, don't go to rooms with beds with men, etcetera. I'm curious as to what other mothers tell their daughters? And as a mother of sons around this age I wonder why the guy gets charged with rape if they're both drunk? Doesn't seem quite right to me.","post_message":"Former Tigers pitcher Evan Reed has been sentenced to probation after accepting a plea in his assault case. The victim strongly objected to that plea in court. VIDEO here: @webpagelink"},{"comment_id":"10153885880700667","commenter_b":"His wife is an idiot","commenter_a":"He is still body shaming this woman? Really Trump?","post_message":"\"I saved her job because they wanted to fire her for putting on so much weight.\""},{"comment_id":"10152781007061615","commenter_b":"Our veterans go without while lazy a**es and foreigners collect cash, food stamps and free medical. What's wrong with this picture??? VETERANS AND ALL MILITARY SHOULD COME FIRST! They put their lives on the line so the lazy idiots and illegals don't have to. WAKE UP AMERICA AND GET YOUR PRIORITIES STRAIGHT!!! Rant over.","commenter_a":"but it was OK that he put his life on the line for this country give the man what he deserves","post_message":"DENIED. An American hero, unable to collect his military benefits when he needed them most. WPXI Rick Earle gets help for this veteran. His story is coming up tonight at 5:45 p.m."},{"comment_id":"10153206668181162","commenter_b":"I'm understand u Julie I feel the same sometimes I hate my own race the Humans!! I gonna try to adopt him.","commenter_a":"Are you kidding me??? I. HATE.HUMANS!!! Find the SOB who did this and shoot them! Disgusting! People make me sick. Praying for this poor dog <3","post_message":"\"SWEET SURVIVOR\": After being was shot twice, this dog will still survive. Police found her tied to railroad tracks and rushed her to the vet.   Once she is healthy, she will be up for adoption @webpagelink  Officers have named the dog R&R. (Photo via Twitter @TampaPD)"},{"comment_id":"1803612926545625","commenter_b":"I agree ...where they trained to beat the crap out of people because they ran....smh","commenter_a":"What they fail to mention is that even if this man was the actual perpetrator it's still inexcusable for the cops to beat him unless he was resisting. The police's job in this case is to apprehend suspects. Suspects are innocent until proven guilty and should be treated as such.","post_message":"\"I've never been cursed, physically abused, beaten and treated like a slave as I was two days ago.\" A retired corrections officer says he was assaulted by Garden City Police in a case of mistaken identity. CBS2's Carolyn Gusoff shares his story: @webpagelink"}]
