[{"comment_id":"10153270058159497","commenter_b":"We are all snacks, can't we get along?","commenter_a":"Oh SO SNACKS DON'T HAVE THE RIGHT TO DEFEND THEMSELVES?","post_message":"From our sister publication, ClickHole:"},{"comment_id":"10154282373471636","commenter_b":"@username the uk intends on putting it's own citizens first. .to achieve this we intend to control the flow of immigration here ( not close them) the problem with the EU free movement is that the poorer member citizens prefer to go and live in the more welthiest members causing a flood in the labour market. .all other countries outside the uk have this policy","commenter_a":"They realise they can't risk all the british emigrants in the EU, the majority of them being pensioners, returning to the uk and putting a financial and physical strain on things like the health service.","post_message":"Excellent"},{"comment_id":"614198468735487","commenter_b":"They died due to your lack of investigation! !!!!! Say it it was a terror attack. We MUST STOP THE MUSLIMS COMING IN.","commenter_a":"So sad","post_message":"FBI – Federal Bureau of Investigation Director Comey and Deputy Attorney General Yates brief on the latest in the Orlando shooting investigation. @webpagelink"},{"comment_id":"10152758680722144","commenter_b":"Racist pigs","commenter_a":"What the hell are these people thinken DO THERE DUM ASSES KNOW THAT CHILD ABUSE","post_message":"WTF."},{"comment_id":"10153068105811316","commenter_b":"That had to have been written by a 12 year old republican. Lol.","commenter_a":"hes telling the truth most dont want to hear","post_message":"Rapper: Caitlyn Jenner & MSM Promotion of Poor Values A Rebuke To God - @webpagelink"},{"comment_id":"10152776917200779","commenter_b":"Bitch please...","commenter_a":"Too late, President Obama, you should have spoken out earlier!","post_message":"President Barack Obama voiced his disapproval of the recent rioting in Baltimore in a press conference today. \"There is no excuse for the kind of violence that we saw yesterday,\" he said. \"It is counterproductive.\""},{"comment_id":"1157413281045845","commenter_b":"Oh Hillary .... go get a life!","commenter_a":"Stupidty and desperation","post_message":"Remember when Hillary Clinton said refusing to accept election results was \"horrifying\"?"}]
