[{"comment_id":"404025676388694","commenter_b":"Hes a piece of shit its not there country and the middle class has suffered enough from its temp wages and illegal pay for us we cant get all the benefits illegals do we do not qualify lol he just wants votes for liberal Democrats","commenter_a":"At this point ,what difference does it make","post_message":"Is President Obama breaking the law with Immigration Reform measures?"},{"comment_id":"10153010796814586","commenter_b":"Stop the dog slaughter. Stop killing,our animals. MONSTERS!!!","commenter_a":"Sigurd Rognan","post_message":"Dogs are speaking out for their friends being KILLED FOR LEATHER in China & sold all over the world. SHARE if you never WEAR your BEST FRIEND! JOIN THE MOVEMENT: @webpagelink #DogLeather [By posting your photo on Facebook, tagging PETA & using the hashtag #DogLeather, you are acknowledging that you have read & agree to our terms of submission: @webpagelink"},{"comment_id":"10152998486166680","commenter_b":"BRAVO TO TRUMP!!!! We LOVE your IMMIGRATION POLICY!!! But, you \"must\" repeal the 1965 Immigration Policy to make sure things go back to normal!! Those who use the \"RACE CARD\" and cll names are really part of the problem!! Place them on \"BLOCK\"!! Of course they will rant and scream racism, because that is the very tool and threat they use that they are so used to getting their own way with! THEY are also destroying this Country! What is unconstitutional is what is being done NOW! Deporting ILLEGALS is the LAW!!! The LEFT are out in droves to slander, to name call, to label, to smear, to relentlessly attack all supporters of Trump and anyone else who is trying to save this Country!","commenter_a":"2016 TRUMP FOR PRESIDENT 2016","post_message":"Donald J. Trump's three-principle plan: “1. A nation without borders is not a nation. There must be a wall across the southern border. 2. A nation without laws is not a nation. Laws passed in accordance with our Constitutional system of government must be enforced. 3. A nation that does not serve its own citizens is not a nation. Any immigration plan must improve jobs, wages and security for all Americans.”"},{"comment_id":"412948288893465","commenter_b":"An ugly skank. . . . living off tax payer money!!!","commenter_a":"POS !","post_message":"They just exposed the disgusting hotel bill Michelle Obama ran up in Cambodia... this is inexcusable. Hardworking Americans deserve better than her."},{"comment_id":"1725694384382380","commenter_b":"Where have you been sweet thing? We have been giving black people reparations for decades. Who do you think has been putting money into your welfare accounts all these years? Come to me for reparations and your welfare will be permanently cancelled.","commenter_a":"They can kiss my white non-slavery butt","post_message":"All White People Owe Us Reparations, 'If You Don't Give It, We Are Coming To Take It' [VIDEO] They are demanding that we give them money for their ancestors slavery. Will you pay African Americans reparations?"},{"comment_id":"10152600779162217","commenter_b":"How is it funny how we'll let an aeroplane be controlled by a computer, when we all know of the very high general standard of trained pilots we have flying our passenger aeroplanes who are there too? Just thought I'd point out one of the stupidest thing I've ever heard.","commenter_a":"I didn't think it would be long before we had driverless cars. I am a terrible driver so this would suit me right down to the ground.","post_message":"Driverless pods, set to hit the streets of UK cities, are unveiled for the first time. Would you be able to relax and trust technology to take you for a ride? @webpagelink"},{"comment_id":"824242924358757","commenter_b":"You must be an ugly Bastard","commenter_a":"No money no love:)","post_message":"Only A Weak Man Would Make A Woman Love Him And Refuse To Love Her Back"}]
