[{"comment_id":"705870246236573","commenter_b":"Muslim Bakeries also refuse same sex marriage cakes as well it was done under cover and yet No Punishment!","commenter_a":"Yet Muslims can get out of delivering beer on religious grounds and awarded damages. Seems Christians are not afforded the same religious protection.","post_message":"A sweet slice of JUSTICE!"},{"comment_id":"1263312547023087","commenter_b":"James Walters watch it","commenter_a":"I feel deceived. I thought he was going to explain the theory briefly with the popcorn.","post_message":"It's the 100th anniversary of Einstein's theory of relativity this year. Here's an explanation so good, it won $400,000"},{"comment_id":"882172088504463","commenter_b":"Do you guys know Bernie is a SOCIALIST.. A SOCIALIST !!!! why do you guys hate America so much, I tell you why, because YOU HAVE NO IDEA HOW IT IS TO LIVE IN A SOCIALIST SYSTEM , go to any South American Coutry , tell any parson who have lived under this system that YOU support a Socialist in America, be careful you might get your ass kicked due to stupidity ...pick a Socialist country, live there for 6 months then wee talk ....IGNORANT!!!!!!!","commenter_a":"It's one thing to get elected as Mayor of Burlington, VT, then, Congress, and the US Senate with a population of 800,000 where $5 or $10 makes a difference and running for President. We all know the game is fixed. And, as an incumbent, it was fixed in his favor.","post_message":"Five years ago, the Supreme Court issued what I think is one of the most disastrous decisions in its history, Citizens United v. FEC. Billionaires buying elections is not what our Constitution stands for. Add your name to my petition if you agree that our democracy is not for sale: @webpagelink"},{"comment_id":"10154130696774087","commenter_b":"PRAYING JUSTICE PREVAILS...After hearing about Obama using a fake name to communicate with Hillary on her unsecured personal server, it explains why Hillary was given a pass and never indicted. Their corruption is as thick as sewage all the way to the top of the White House. This is unacceptable. \"Deplorable\" is Hillary and Obama. Hillary and Obama for prison... Donald Trump for President!! Hillary is not an option... ##TrumpPence'16","commenter_a":"The GOP spent millions of our taxpayer money, and they proved that Hillary was blameless for the response to Benghazi. Just wait, the GOP might just open up yet another wasteful investigation. :D","post_message":"“What Hillary tried to set up and what they apparently spent months preparing is an ambush as false as Benghazi,” Newt Gingrich said."},{"comment_id":"10153494540359641","commenter_b":"Good decision. No one wants to take the chance of harboring snakes on their own homeland, before long this migrant group would breed like crazy and before long their population would be 40 p.c or more and they might get some enlightenment and start bombing the locals.. The problem with most muslims, is they are always muslims first. They are not british, germans, australians, americans..There identity is muslim first and that's why its hard to trust loyalty of someone whose citizenship comes second to the God..These people can easily be blinded. From birth they are taught to prepare for heaven, if only they had such devotion for their mother land. Be it, wherever they are born, what ever citizenship they hold. The greed of heaven and fear of hell has done more bad to man than good.","commenter_a":"Oh no, of course not!","post_message":"Slovakian minister insists it's not discrimination."},{"comment_id":"817179565047318","commenter_b":",the problem is that these companies take too much Shit from their UNRULY customers.Customerst first..What about employees?","commenter_a":"The manager did NOT make the right call which is why they are out of a job!!!! You don't reward bad behavior. Companies don't have certain people to service certain customers!!! You have problem resolution departments or resolution specialist but in this case the customer was the problem!!! Options being \"mam we can certainly deliver your item(s) or we can refund your money but we do not have special delivery people\".","post_message":"The driver says he was told \"you are black, and they don't want you at the house.\""},{"comment_id":"10153067387865329","commenter_b":"Stupid bitch","commenter_a":"Anytime a guy says \"my dick is too big for a condom\" just tell them \"well, my uterus is too small for a baby.\"","post_message":"\"To all the guys saying \"my d*** is too big for condoms,\" TAKE A SEAT.\" // BuzzFeed News"}]
