[{"comment_id":"10153649615904199","commenter_b":"The employee aint do nuthin wrong. she got hit. ole white girl lucky she didnt get stomped harder.","commenter_a":"The employee should be fired. People need work ethics. Call for the customer to be removed!","post_message":"Warning this video contains graphic language."},{"comment_id":"10155939290119012","commenter_b":"No he's creating a disaster!! You cannot fix something that has been left go for decades! You can find a way to manage it and try and prevent the same things to keep happening! That is why Obama was smarter about it! He deported the ones that were a threat not a mother with kids! But I don't expect the right to understand this! You think acting like a dictator is going to help this country your dumber than I thought!","commenter_a":"Yes.","post_message":"YES or NO: Is President Trump making America safer?"},{"comment_id":"10153851827136336","commenter_b":"Deport. Muslin. And. Religion. Stop. Terrorist. America. Now","commenter_a":"Pretty sure there's a lot more than one already in the US.","post_message":"\"We know that ISIS is deliberately using the refugee crisis to insert fighters into Europe. Why wouldn't they do the same in the United States?\"  Tonight on \"The Kelly File,” Sen. Marco Rubio explained that if just one ISIS fighter manages to slip into the U.S. among the refugees, it's a big problem. @webpagelink"},{"comment_id":"10153666209640399","commenter_b":"Fire her!","commenter_a":"I've always liked Debbie, and had a lot of respect for her, but if this thing has legs, it could spell big trouble. There is enough dishonesty in Republican Ranks, we don't need any in Progressive Ranks. We all need to watch this carefully.","post_message":"Debbie Wasserman Schultz said the DNC needed to suspend access until they can be sure that the information hasn't been \"manipulated.\""},{"comment_id":"10153540502734411","commenter_b":"Wow--look at that face. That woman needs to smile more.","commenter_a":"Links of blood and marriage tied Battenbergs/Mountbattens to Germany/or.also Saxe-Coburg-Gotha into \"Windsor\" didn't transform Edward..","post_message":"'She was a child when this film was shot, long before the atrocities of the Nazis became widely known. But Edward was already welcoming the regime as Prince of Wales in 1933 and remained pro-Nazi after war broke out in 1939. He could well be teaching the Queen and Princess Margaret how to do the salute.'"},{"comment_id":"10153335826619714","commenter_b":"Finally!!!","commenter_a":"@username Durrah Afyouni Masah Azar @username Maya Maaytah","post_message":"Vogue shoots & profiles Andreja Pejić"},{"comment_id":"1639738129419643","commenter_b":"@username he hasn't done anything yet. He is the President elect. He won because People are tired of the false unemployment rate Obama is pushing. Tired of the rising cost of Insurance except for people like you who probably get it for free. Tired of the war with radical Islam that he has no strategy for winning. Tired of illegal aliens pushed on us and tired of sanctuary cities and tired of people like Kate Steinle being murdered by them. You certainly can't blame Trump for any of those things. Have a nice day in your la-la land world.","commenter_a":"Actually, Barack Obama is responsible for Trumps win because he has screwed this country so badly and people are sick of his shit and knew that Killary is not only unqualified, dishonest as hell, and a total liar but that she would continue Obamas agenda to destroy our country.","post_message":"Barack Obama said that Russia is responsible for Donald J. Trump's win, but he didn't expect Sean Hannity to knock his lies right back in his face. The democrats just got schooled.  Let's get 2,000 shares to show that America can't wait to get Obama out of office."}]
