[{"comment_id":"10154584084924166","commenter_b":"no more cover girl for me","commenter_a":"How stupid!","post_message":"The makeup manufacturer calls him a \"boundary breaker\" who will appear in an upcoming commercial. What are your thoughts on guys and makeup?"},{"comment_id":"1777971925823252","commenter_b":"She's cheating with a cheater, duh.","commenter_a":"Can't stand him. Good voice but once a cheater, always a cheater . Maranda your so much better without him. Keep up the good music. He's trash and so is She. .","post_message":"Whoa..."},{"comment_id":"843581439108369","commenter_b":"I hope God rolls videotape. I HAVE to see this evil bitch explain this at Judgment Day.","commenter_a":"I hear a lot of people saying that abortion should be legal in rape cases. I tend to disagree. We shouldn't punish an innocent baby because of the sins of the father. I mean how many of us would be here if we were punished for the sins of our mothers and fathers?? Murdering your baby doesn't make you any less raped. My opinion is the morning after pill should be available with every rape kit.","post_message":"What the hell is wrong with this woman?"},{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: \"Oh for goodness, that is not going to happen. I'm not even answering that question.\" #DemDebate"},{"comment_id":"10155080239376037","commenter_b":"Wow, just wow! How much tin foil DO you go through a week???","commenter_a":"Being \"sold to us\" as home Terrorist attack.... Each minute the MSM spews more misinformation pushing their Naritive. My guess , MK Ultra mind control at work...., , distraction? Agenda? To be determined. ?..","post_message":"Suspect Esteban Santiago, who was carrying a military ID, allegedly opened fire, killing at least five people before being taken into custody."},{"comment_id":"1616996585254121","commenter_b":"Now keep the fuckers from being immigrants in this country","commenter_a":"\"The Brig it is.\"","post_message":"These pirates never saw it coming..."},{"comment_id":"10153967377745894","commenter_b":"She has some fat tits. Lets be real","commenter_a":"I don't know why she feels the need to show her tits Wherever She Goes.","post_message":"See how Mariah Carey's relationship with billionaire James Packer began to fall apart on Mariah's World."}]
