[{"comment_id":"954958944620884","commenter_b":"all fuckin jerks,","commenter_a":"WORD","post_message":"ClashDaily.com"},{"comment_id":"10153281917270090","commenter_b":"And what does that have to do with what his stand on immigration has cost all tax payers!","commenter_a":"Illegal immigrants!","post_message":"All of the above! Choose Obama's #1 failure as president: @webpagelink"},{"comment_id":"1247936331966085","commenter_b":"So tired of explaining this exact sad truth.","commenter_a":"Learn the difference.","post_message":"It was clear from the start the criticism wasn't about the flag."},{"comment_id":"10153050457656037","commenter_b":"Oh poor thing she cant make her 10,000 a month rent and shes too good for an average joe apt what a predicament and if its not acting or showbiz im not working they are all the same","commenter_a":"Come over to my house free rent plus all the free SEX you can get x10 =!","post_message":"66-year-old actress #DianneWiest, who begins previews Tuesday for off-Broadway production Rasheeda Speaking, told the New York Times she is facing money issues due to a lack of high-paying work."},{"comment_id":"643301722461533","commenter_b":"Does the American flag represent millions of people that have done nothing wrong and try to survive under a fucked up government? Or does it represent something else? See, that's the beauty of this flag. It holds different values for different people. You don't value yourself, others, anything? You more then likely will despise what I say and verbally attack me.You blindly support atrocities committed by our shit-for-brains leaders, you'll probably verbally attempt to attack me. My point remains clear, for those with a mind to think for themselves.","commenter_a":"Just for shits and giggles. I want to see the love we all profess for one another.","post_message":"This is epic."},{"comment_id":"10156669278135354","commenter_b":"Evil disgusting whore","commenter_a":"GRANNY couldn't tell the difference between LOVE and KINDNESS if her life depended on it!!! Her own husband had to go find love in someone else's arms cause she knows NOTHING about love!!!!!","post_message":"There was no \"love and kindness\" in Hillary's lies about Benghazi. It wasn't \"love and kindness\" when Hillary transferred 20% of US uranium to Russia for $145 Million in Clinton Foundation cash. \"Love and kindness\" don't describe her treatment of Bill's sex victims. Exposing US secrets through your server and destroying emails isn't \"love and kindness.\""},{"comment_id":"10153992655564740","commenter_b":"Both groups are basically the same and it's sad that people can't or won't stand up and think for themselves.","commenter_a":"Story was after the 30 protesters souround the 6 kkk and begin getting violent the 6 defended themselves... 4 of the 6 were arrested... Wtf is going on here.","post_message":"Anaheim police have said “one or two” self-described KKK members have been seen in the city in the last two years."}]
