[{"comment_id":"962496207173455","commenter_b":"#trumpnation #teamtrump #trump #votetrump #riseup #crushpoliticalcorrectness #getourjobsback #deporttheillegals #stirupwashington #shakeupDC #BANMUSLIMS #rebelflag #no2NikkiHaleytheTraitor #merrychristmas #makeourmilitarygr8again #keepguitmoOpen","commenter_a":"Go F your self Cruz! Voting for TRUMP!","post_message":"'The truth of the matter is if Donald Trump became president, nobody knows what the heck he would do. He doesn't know what the heck he would do,' Ted Cruz said."},{"comment_id":"10152950800096770","commenter_b":"Why doesn't she talk about the women her husband has been with considering her looks I don't blame him.","commenter_a":"I'm offended by the fact she isn't behind bars yet.","post_message":"At a campaign stop in New Hampshire on Monday Hillary Clinton slammed Donald Trump's recent remarks about Fox News host Megyn Kelly as 'outrageous' but said that other Republican men running for president have made equally 'offensive' remarks."},{"comment_id":"10154051432298445","commenter_b":"Listen you little bitch ur just mad because","commenter_a":"Come on they just want to get paid like everyone else....shut the fuck up and give them their chop...before you end up paying an arm and a leg for mr.college degree but cant find a job in the field i studied for...to show up and try to charge u 30% of ur crop this is America only place they have buffets js","post_message":"#TBT to 2015. 'trimmigrants.' had trouble finding work, created tension after arriving in Humboldt expecting trim jobs.   Humboldt friends - has the atmosphere changed?"},{"comment_id":"10153885914416336","commenter_b":"Because of the way, they TREAT WOMEN!","commenter_a":"This woman is totally ignorant. How many Muslims live in the US? Are they all terrorists? How many such shooting have taken place in the US? Are these all terrorist acts done by Muslims? Why dont you open your eyes and find out that all these terrorists have links with Pakistan and Saudi? Why nobody dares to say where all these terrorists come from or have link with? Why do you stamps all Muslims as terrorists?","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.”  Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"10153114659021336","commenter_b":"i just hope she is prosecuted for her crimes, and they let her know she is NOT above the law....she is a disgrace.","commenter_a":"Right on schedule.","post_message":"Let us know your thoughts on Rep. Trey Gowdy asking that Hillary Clinton agree to a transcribed interview over her deleted records and tune in to 'Special Report with Bret Baier' at 6p ET."},{"comment_id":"10153539209048487","commenter_b":"Oh please tell us what you know about Locheed /Martin!","commenter_a":"Cuz Lockheed Martin sucks","post_message":"The F-35 was supposed to be inexpensive, adaptable, and reliable. How did it become the most expensive aircraft in history?"},{"comment_id":"10153256940195736","commenter_b":"God forbid we put them in shelters and feed them.","commenter_a":"I have advocated for helping the homeless for a decade but it has gotten out of hand over the last couple years...which is to be expected, given we've mostly ignored the problem. These folks belong in Wapato and Wapato needs to be converted into a mental health care site.. They commit crimes against society -- leaving garbage around is just a visible symptom but when folks aren't looking, they misbehave in more destructive ways. They need to be 'rebooted,' in the computer sense, not the kick-in-the-pants sense. Though some of them need that as well...","post_message":"Mayor Hales said today was the first of several in which the homeless will be moved out of city parks."}]
