[{"comment_id":"10154154880759087","commenter_b":"And if Bill's affairs are on the table, so are Melania's published nude photos, including her lesbian poses.","commenter_a":"Stupid people can't even see that their party is in shambles because of this animal. PS- Bill isn't running for President, HRC is. If you're gonna judge spouses for their lack of control or influence in their marriages, then where's your criticism of Melania?","post_message":"\"They will elect Donald Trump and Mike Pence because they know that this is our last chance to keep our nation from plunging over the cliff into an abyss of debt, weakness, and servitude.\""},{"comment_id":"10153401491811323","commenter_b":"Talentless bleeder only got a gig in the first place because she was a woman.","commenter_a":"Was this the same BBC that was busy implementing their towards 2000 policy at this time?","post_message":"“I was told by the producers that they preferred my version, but the channel decided they couldn’t have a woman in charge.”"},{"comment_id":"10158500628960389","commenter_b":"As a Hispanic born in the US, no Jorge Ramos! This country does not belong to illegals! You're are crazy and delusional, if you love Mexico so much go back there and see how it goes for you! We are not against legal immigrants, it's the criminal illegals that should go back! So screw off and shut up!","commenter_a":"Deport Ramos. I'm an immigrant and can't stand him.","post_message":"Univision anchor goes on an ethno-nationalist tirade."},{"comment_id":"10153829560109062","commenter_b":"Illegals dont fil lout any forms,","commenter_a":"Who tell him Illegal immigrates do not pay taxes, there are special forms most of them pay by the end of the year simce they know if there a possibility to change their status they will have to show they paid taxes... Ignorance makes people say atupid things... sad!!!","post_message":"What do you think of the sign?"},{"comment_id":"10153061482070326","commenter_b":"I don't care who the media whores are in love with or paid to pretend they are in love with. If people would just vote for who they really want to win, we would beat them. Stop listening to the media tell you no one can beat Hillary.","commenter_a":"Thats because the media no longer represents the people. They want to talk about emails, when most of us are worried about just making it. I wouldn't sit down with you either.","post_message":"This is what Hillary Clinton does NOT do with the media."},{"comment_id":"10152903989921336","commenter_b":"Just say your sorry, it'll be ok, long time ago let it go.","commenter_a":"The sooner the better","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."},{"comment_id":"10154569293118132","commenter_b":"Her eyes are evil!!","commenter_a":"I think she was beautiful. This story has haunted me since it broke. Her and her daughters seemingly had a lot of love for each other. This is so tragic and so sad.","post_message":"5 things you need to know about Christy Byrd Sheats, the Texas mother who shot and killed her two daughters. (Via People True Crime)"}]
