[{"comment_id":"10153992409688132","commenter_b":"Bet she can't do it again! Lol","commenter_a":"Bye Felisha","post_message":"The force of the blast tore her body apart, complicating officials' efforts to identify her."},{"comment_id":"10153484724071509","commenter_b":"Jason, go tell it to your momma, she's use to your hot air, and I don't have time for idiots. Go get your daily fertilizer. Move along!","commenter_a":"They will get unsupervised probation. Maybe six months tops in lock up. 'Privileged monsters' just itching to kill!","post_message":"Five teens have been charged with planning a classmate's murder. Their plot was discovered when another student talked to school administrators, police say. @webpagelink"},{"comment_id":"10155086902812235","commenter_b":"UK agrees Americans you created this problem now fix it Europe do not want a war","commenter_a":"How much longer are the American people, the ones who didn't vote this idiot in, going to let this go on, this ego maniac is ruining your beloved country, it is the laughing stock of the world thanks to him, how can any government anywhere take this moron seriously and trust him with anything, he lies through his teeth, blames everyone else for whatever is going on, it has only been 4 weeks and look at the state of things ! My thoughts are with the American people who didn't vote for this buffoon, i hope your country can get rid quick and recover from his dreadful influence !","post_message":"'I was hoping you could tell me what the f*ck is going on over there?' - European security services ask."},{"comment_id":"10153497102100163","commenter_b":"His wife","commenter_a":"I don't believe this..","post_message":"Waka Flocka Flame's longtime girlfriend explains why the couple decided to part ways"},{"comment_id":"1139241312762564","commenter_b":"Woman? Never will be. With or without IT.","commenter_a":"Be happy Caitlyn. You are a strong woman.","post_message":"Monica Lewinsky: 'BEAUTIFUL' Rosie Perez: 'Wow' Questlove: 'Respect'"},{"comment_id":"10154496192470329","commenter_b":"Jools pls","commenter_a":"'@username u at ginger boy","post_message":"Are hand jobs back and better than butt stuff? Is this 9th grade? LET THESE TWEETS DECIDE."},{"comment_id":"1493733267320483","commenter_b":"Please go to Danney Williams-Clinton FB page he posted a video called Banished. We need to help this young man by spreading his message far and wide. He may or may not be Bill's son.","commenter_a":"Donald Trump continually tries to deflect his inappropriate behavior towards women by turning it back onto Bill's indiscretions. One issue that everyone seems to be missing is that Bill is NOT running for President. Donald is.","post_message":"Thank you, Michelle Obama."}]
