[{"comment_id":"10153269295123352","commenter_b":"That last statement not only make her a dumb bitch but a ignorant one at that. Please use some of that money your boyfriend is making and educate yourself.","commenter_a":"So fake she has 3 kids no where does she have the time to make all of this stuff.","post_message":"Meet Etsy's richest seller: Mom-of-three sells 3,000 items a day and earns $65,000 a month from handmade socks and scarves"},{"comment_id":"10154330734419087","commenter_b":"Shes a half wit scrub striving for brownie points. Bitch needs to go home and make a peanut butter sandwich and shut the fuck up, we ain't got her candy.","commenter_a":"@username not enough money or incentive","post_message":"#BREAKING: The Green Party is dropping the case spearheaded by Jill Stein to request a recount of the election results in Pennsylvania, citing an inability to pay a $1 million bond required by the court."},{"comment_id":"1724892717782853","commenter_b":"We are in America! Speak English woman! Lol","commenter_a":"@username they read my post!","post_message":"\"Hail Hydra\" are two words no one ever expected Captain America to say."},{"comment_id":"10155829380115354","commenter_b":"Give it up Rubio!","commenter_a":"Of course he did!","post_message":"16 days after Trump gave his speech... why not stick his neck out before the media created this bandwagon?"},{"comment_id":"1118389778239557","commenter_b":"The question is, \"Is there a discernible difference between \"Radical Muslims\", and Muslims?\" When people close their eyes, get on their magic carpets five time a day and pray to Mecca, it is clear that Islam is the most important thing in their existence. Far above Nationalism, for the country they are in. For our own security, we must stop Muslims from entering this country. In addition, existing Muslims here should be asked and paid handsomely to leave. Finally we should ban all business dealings with Muslims and abandon the Middle East.","commenter_a":"Non't kid yourself islam is all radical at the core.","post_message":"This guy is EXACTLY right about radical Islam. Let's share this everywhere, because you know the media never will."},{"comment_id":"1272205819459623","commenter_b":"Trash. Sex film that she herself leaked and a nude photo? No!","commenter_a":"I agree with Bette Midler for once.","post_message":"\"Kim Kardashian tweeted a nude selfie today. If Kim wants us to see a part of her we've never seen, she's gonna have to swallow the camera.\" - Bette Midler"},{"comment_id":"612643332237670","commenter_b":"It's really crazy that some men are coming up with more excuses for this kid","commenter_a":"What, now alcohol is being used as an excuse to rape a girl. People still know right from wrong, drunk or not. Rape is illegal. Justice needs to be served. Disbar that judge, also.","post_message":"The judge, also a Stanford alum, noted that the defendant was intoxicated at the time of the assault."}]
