[{"comment_id":"687121244811787","commenter_b":"She can go and join Isis!","commenter_a":"Fuck this traitor bitch","post_message":"Woman goes on TV and points the finger at Americans for this. She has some nerve. What a ridiculous statement. Does this infuriate you?"},{"comment_id":"10150808006769999","commenter_b":"Minority women...","commenter_a":"i get the point about not many women in software engineering.. but, minorities? umm..just looking around my office floor right now, all i see are minorities (asians and south asians)","post_message":"Why do so few women and minorities work in software engineering? We’re discussing reasons for the gap and what can be done to improve it.  Join filmmaker Robin Hauser Reynolds, whose new documentary, “Code,” explores the issue; Nick Rockwell, CTO at The New York Times; Minerva Tantoco, CTO for New York City; Myrna Soto, Senior Vice President Global Chief Information Security Officer at Comcast; and Jazmine Hughes, Associate Editor at The New York Times. If you have questions, leave them in the comments.  For the second half of this live stream, click here: @webpagelink"},{"comment_id":"10156684390715354","commenter_b":"Pussy.","commenter_a":"Yikes...say goodbye to England","post_message":"Prime Minister David Cameron announced: “I want London to stand alongside Dubai and Kuala Lumpur as one of the great capitals of Islamic finance anywhere in the world.”"},{"comment_id":"10153082331816600","commenter_b":"I agree Kaliah Nichole! I am not a fan of what Obama is doing either, however, to say that vaccinations don't work is absolutely ridiculous! The comment about hippie is because there are so many people \"hippies in the 70s\" that thought that we were all invincible and that we shouldn't have any restrictions and that the whole world was all about \"love\". This is not a game and even though our children get vaccinated and should be immune and resilient to certain viruses, this is not a game and not all immunizations are foolproof! So it's better to be safe than sorry and if people don't want to have their children vaccinated then they should all go to a communal area and go to school with each other and spread diseases amongst one another.","commenter_a":"Let's BAN @username! Go to a foreign country and bring back all types of diseases and parasites because of your lack of knowledge! Clearly by the looks of your picture you're a hippie who thinks that every thing you do is okay and that your indestructible because you smoke weed! Get an education and do your research!","post_message":"If a parent refuses to vaccinate their child and the child goes on to spread a deadly illness to others, do you think there should be consequences?"},{"comment_id":"10154964857609885","commenter_b":"Stfu","commenter_a":"Best. Winter. Classic. Ever.","post_message":"St. Louis and the Blues nailed this one."},{"comment_id":"10153141686007093","commenter_b":"No she isnt..cause when you see a 400 lb woman wear them and you can see through them then you will be on her side! !!!!!!!!!!!!!!!!!!#!!!!!!!!!","commenter_a":"She's just all butt hurt because she doesn't have a nice body to pull off wearing leggings like they're pants ;)","post_message":"It's leggings season. But according to one woman's viral rant, a lot of people don't wear them correctly... @webpagelink"},{"comment_id":"10152920340851051","commenter_b":"What we can't stand u either ghetto bitch","commenter_a":"Sad part is my son is mixed with white......I wish I could do magic and make that part of him disappear.........cant stand white racist mtfhs","post_message":"This woman decided to break up a fight by taking out her gun and shooting into the crowd. The problem is, her son was in the crowd."}]
