[{"comment_id":"10153197491081051","commenter_b":"She's already proven she's delusional","commenter_a":"Nancy - Have Another Drink !","post_message":"Nancy Pelosi says President Obama's Iran deal is simply brilliant. Agree or disagree with her?"},{"comment_id":"10153707771213598","commenter_b":"Oh wow, so I guess she never felt them moving around in there for the last FOUR months of her pregnancies. That was probably a monkey or a frog moving around in there. Right. Stupid, evil excuse for a woman.","commenter_a":"Her remarks don't make a bit of sense. What in the world she thought was growing in her body got 9 months, and she is swelling and gaming weight, etc. did any of her babies kick and move around? Was she skinny when her children were born? She just instantly gave birth to a baby out of the blue! Wow! Just plain stupid.","post_message":"Planned Parenthood President: My Childrens’ Lives Began at Delivery, Not Conception"},{"comment_id":"481672038690043","commenter_b":"Muslims can all go to hell were they came from,they don't belong in this country","commenter_a":"Time for a million dog March, please don't clean up after your dog's at this March.","post_message":"Muslims are telling Americans what they can and cannot do. They have gone too far with this. We need to stop this madness now. Do you agree Muslim immigrants should abide by our laws?"},{"comment_id":"905233582940760","commenter_b":"So they can rape your children","commenter_a":"No way","post_message":"Obama Admin Proposes Plan for Americans to \"Adopt\" and \"Sponsor\" Muslim Immigration into the US @webpagelink"},{"comment_id":"10153802989025927","commenter_b":"If you are here legally you have nothing to fear, stop listening to liberals who pander fear...If you are here illegally than yes, you might wanna vacate before being made to leave...This is not a hard concept, it's quite simple, if you are here illegally leave and immigrate back legally, if you are here legally ...What are you worrying about?","commenter_a":"If these people want to engage in disrespecting this country by burning the American Flag and demonstrating allegiance to another the authorities should round them up and deposit them in that country they love so much. This is getting to be far far too common and needs to be stopped. They can go to these countries they love so much and demonstrate and destroy things there","post_message":"PROFESSOR: am getting many heartfelt notes from students who are in shock over the election returns and , rightly or wrongly for their families ..."},{"comment_id":"10152932184944753","commenter_b":"BTW wasn't she on her way to see her Bf why not just let him pay for a cab instead of letting her ride on the subway while she's drunk and tired from all of the dancing in the party. I bet most of the people on that car where on the way to work and did not want any problems that early in the AM","commenter_a":"The foo recording is a straight both would've at least socked that lame ass predator","post_message":"What would you do if you witnessed this happening?"},{"comment_id":"10155881705845389","commenter_b":"Scary? I'd rather say Trump is just plain hilarious!","commenter_a":"I imagine he did, and that's why he is doing so well in the polls! He's a smart man, unlike most RINOs who don't have the guts to speak out about illegal immigration! Donald Trump is gaining support because of his honesty and it scares Republicans and democrats!","post_message":"Tonight, Gov. Rick Perry reacted to the controversial immigration statements made by Donald J. Trump, telling me that he is critical of the \"disrespectful language\" that Trump used."}]
