[{"comment_id":"1153087074711321","commenter_b":"we need more sex workers to solve crimes the cops can't","commenter_a":"They should give her an award. She has saved countless lives.","post_message":"Police found what they described as a \"kill kit\" in the trunk of Falls' car — including handcuffs, several long knives, a box cutter, two axes, a machete, a sledgehammer, a bulletproof vest, another gun, shovels, a rubber tub large enough to hold an adult, and bleach and other cleaning supplies."},{"comment_id":"988837027845081","commenter_b":"It seems to be about control imo. Religion has had so much control in history that by taking a little bit away they think the world is persecuting them. In my opinion they should let gay people do what they want just like they think Muslims should mind their own business about others eatting pork.","commenter_a":"wow - I am honestly confused as to how gay couples marrying really affects your lives? whether it be against your religious beliefs or whatever your reasons are for hating these people, does it truly affect how your life is going? There are so many other things in this world that should be worried about, like how our veterans are being treated and cops being stalked and killed, does two people being in love and wanting to be married change your life? and btw, no, I am not gay. I would just rather see more love in this world than hate and violence.","post_message":"North Carolina and Utah Laws Allow Clerks to Refuse Same-Sex Marriages  More than 30 magistrates in North Carolina have legally refused to perform weddings for gay couples.  @webpagelink"},{"comment_id":"10153896144132061","commenter_b":"Women get it done.","commenter_a":"Husband leaving town at a bad time","post_message":"\"This is what happens when you are 35 weeks pregnant, husband leaves town for the weekend, childcare for your 3-year-old falls through, and you have a game to cover!\""},{"comment_id":"10153228353231336","commenter_b":"Hawraa is unaware of the meaning of the word AND. Grow up little girl.","commenter_a":"This is dead on right...but the morons and libs will be outraged!!! If you can't handle the truth","post_message":"“It is the behavior of individual human beings, not big daddy government that leads to success.” — Bill O'Reilly  WATCH Monday's Talking Points Memo and weigh in: @webpagelink"},{"comment_id":"1090152371065873","commenter_b":"NO! All the illegals should be put there until they can be legalized.","commenter_a":"No,never.","post_message":"The White House says it is committed to closing Guantanamo Bay and will overcome the obstacles Congress is causing to prevent this. Should Guantanamo be closed?"},{"comment_id":"1777728085804631","commenter_b":"What she did isn't even funny. He needs to leave if she thinks that little of him. Bitch.","commenter_a":"WTF? I can't imagine getting that upset about shampoo. There has to be other problems.","post_message":"Don’t mess with a girl and her beauty products."},{"comment_id":"475516605979471","commenter_b":"Getting a little tired of the, \"MUSLIMS\" trying to change our great country of AMERICA!!! If you infidels don't like our country, please feel free to go back to where you came from or if you're an American muslim, get used to our way of life or ship out & go to a muslim country from which they came. I'm sure they need you in those countries since so many have migrated here.","commenter_a":"So then go eat at Camel humps grill","post_message":"McDonalds, KFC, And Pizza Hut Say No To Halal Meat And Muslims Are OUTRAGED  There is no reason why they should have to change their business for them.  Do you support these food chains?"}]
