[{"comment_id":"1228480800579306","commenter_b":"also don't worry about the food, mods gave another interesting fact Eagles do not waste food they will eat it!","commenter_a":"Watching from Buckley Michigan","post_message":"SNUGGLE TIME: Fuzzy eaglet is snuggling as lunchtime approaches! VIDEO: Southwest Florida Eagle Cam"},{"comment_id":"10153113291310667","commenter_b":"He needs nothing...but some of his followers want to contribute anyway..Trump for president 2016!...","commenter_a":"Only person that can change America.","post_message":"He says he doesn't need the money -- he's getting it anyway."},{"comment_id":"10154872503577042","commenter_b":"If the child is deemed not viable for life outside the womb they will grant an abortion however get this there is nothing written into this law to protect the mother or take her health into consideration at all. It is a disgrace!! Turning women into human incubators whose body is controlled by the government.","commenter_a":"Wow are people really so uninformed? What if the baby has a condition incompatible with life or if the mother's life is at risk? What if it's an ectopic pregnancy that isn't always known by 6 weeks?","post_message":"Ohio lawmakers have passed a bill that would ban abortions in that state from the moment the heartbeat of a fetus can be detected."},{"comment_id":"1183772531660175","commenter_b":"However, he will be a much better President for the nation then fumbling Obama. Rather have competent than classy.","commenter_a":"I agree","post_message":"AMEN."},{"comment_id":"10153762734254087","commenter_b":"All this woman does is lie her ass off 24/7","commenter_a":"Republican Hypocrisy !!","post_message":"FBI Director James Comey dismissed Hillary Clinton's claim that his agency's probe into her private email server was a routine “security inquiry,\" telling reporters \"I'm not familiar with the term 'security inquiry.'\""},{"comment_id":"859635514085473","commenter_b":"Go home ma","commenter_a":"If she is going to run like a man then she should not be treated any differently than a man would be.","post_message":"After laying out plans to 'run as a woman,' Hillary Clinton is outraged at a Republican for bringing it up"},{"comment_id":"1528359970798514","commenter_b":"Hillary is a traitor!","commenter_a":"At what point do you recognize the whole process is a farce and Hillary's presidency has been predetermined and bought since 2008?","post_message":"What questions do you have about the Democratic and Republican primary races? We are live with WSJ's Aaron Zitner and Dante Chinni now."}]
