[{"comment_id":"995007177263648","commenter_b":"@username if you are still pro refugees after this video, I don't know what to do with you.... And this are things that are not only happening in France, but in Austria, Germany, and several other countries","commenter_a":"All you Obama haters suck!! Just another bunch of racists who want to vent there vile shit.. Any excuse.. Like yeah if your Muslim your a terrorist if your black your a mugger or rapist.. Retards!!","post_message":"Obama Doesn't Want You To See This: The Muslim Refugee Crisis in Europe"},{"comment_id":"10153017747911130","commenter_b":"Yes, this guy has lost her mind...HA! Nut job liberal.","commenter_a":"God bless him.....dont judge what you dont understand","post_message":"\"I am a woman.\""},{"comment_id":"10153910150514657","commenter_b":"Go home","commenter_a":"GITMO","post_message":"One doesn't have to think long or hard about how this would play if Hillary Clinton were a Republican (which she once was)."},{"comment_id":"10156887460220093","commenter_b":"@username @webpagelink","commenter_a":"Trump is a die hard Liberal","post_message":", I lived in New York City and Manhattan all my life, okay? So, you know, my views are a little bit different than if I lived in Iowa, perhaps. -- Donald J. Trump"},{"comment_id":"10154085235841717","commenter_b":"I believe two females can already, though not commercially available and always produces girls","commenter_a":"Perhaps a little off topic, but I wonder how long it will be- or indeed if it's possible now- for a same-sex couple to have a natural child using a similar method. I imagine it would be complicated, but not impossible for, say, two men to have a biological child using a \"blank\" egg cell.","post_message":"To help women with mitochondria problems from passing them down to their children, scientists remove the nucleus DNA from the egg of a prospective mother and insert it into a donor egg from which the donor DNA has been removed."},{"comment_id":"10153402845063352","commenter_b":"Sheila cant make a hoe a housewife lol","commenter_a":"Sheila Ryan Jonathan omg","post_message":"Boyfriend Sets Up GoFundMe Account Begging For $325 to Follow Girlfriend to SpringBreak to Make Sure She Doesn't Cheat!"},{"comment_id":"10152698000912452","commenter_b":"I would still as long as she doesnt talk.","commenter_a":"Jessica acting like she ain't asking for attention lol girl you would be doing the same crap. Earn the beads Jessica","post_message":"UPDATE: The girl in the photo had been identified. She is 17 years old and does not attend college. Although she says her interaction with the group was consensual, she did not realize her photo was being taken. @webpagelink  Do you know her? Police in Florida are concerned this spring breaker, spotted in naked photos, may be in danger."}]
