[{"comment_id":"1369855736388104","commenter_b":"Those women are vicious hacks for hillary.they don't care what she did against America or the corruption & lies they are all part of the corruption .","commenter_a":"What a waste of her time. They just want their ratings to increase with all the drama","post_message":"The claws really came out..."},{"comment_id":"10155047636614657","commenter_b":"AND SHE WANTS EVERY WOMAN TO BARK LIKE A DOG !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Should every single woman in America have a federally mandated abortion, too? Is that where we're heading?","post_message":"A specious, simplistic pander."},{"comment_id":"1377436272296841","commenter_b":"Go girl.","commenter_a":"Iowa thanks you Hillary! God, what an embarrassment King is to our great state.","post_message":"Clinton isn’t letting this bigotry go unnoticed."},{"comment_id":"10154341988949203","commenter_b":"Hillary can gfh, I'm writing Bernie in!","commenter_a":"If you are for Clinton then you are for more jobs moving abroad. NAFTA, TPP, etc. It might be your job or your town next that is affected.","post_message":"Hillary Clinton has long pushed to regulate access to guns."},{"comment_id":"10154201387086037","commenter_b":"How many people did Jesus kill? How many sex slaves did Jesus have?","commenter_a":"In the Quran Mohammed said to \"cut off their heads\". That's the Islamic role model. Just be glad that role models Jesus and Gautam Budhha didn't say the same about \"infidels\". There would be even more chaos...","post_message":"\"He was brainwashed but we do not know by whom, when or where,\" said a family friend."},{"comment_id":"1069939893102262","commenter_b":"Agree ^^^","commenter_a":"More far right wing Christian terrorism supported by fox news and the NRA.","post_message":"Anti-Muslim rhetoric has spiked since San Bernardino."},{"comment_id":"596781463820482","commenter_b":"IF YOU HAVE A PENIS YOU DO NOT BELONG IN THE WOMAN BATHROOM! GIRLS NEED TO LEARN FOR THEIR OWN PROTECTION TO KICK A GUY IN HIS BALLS IF HE MAKES ANY MOVES TOWARD HER!","commenter_a":"Just asking for big trouble to start","post_message":""}]
