[{"comment_id":"1662312500687681","commenter_b":"She can leave now!","commenter_a":"Thats the best news I've heard all day. !","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"476672599181287","commenter_b":"Speaking of closet queens... overreact much, Michael???","commenter_a":"This is one of the reasons that many on the right hate him. They believe that when people are treated equally, they (personally) are somehow diminished.","post_message":"President Obama highlights why the Kenyan \"non-issue\" of LGBT rights is an issue."},{"comment_id":"937107439663448","commenter_b":"These ladies look forward to the attention of their dress, slot b of time and money is put into finding the perfect dress ,I don't watch the awards I could care less but I know people who watch it just to see what is being worn them turn s it off","commenter_a":"non-story","post_message":"When it comes to the Academy Awards and other red carpet shows, this is what smart, successful women get asked about instead of, you know, their accomplishments. Sigh."},{"comment_id":"856883727746819","commenter_b":"She's a lame person...disgusting!","commenter_a":"c'mon and drink the kool-aid already!","post_message":"\"They are not a basket of anything. They are Americans and they deserve your respect.\" Today, Mike Pence slammed Hillary Clinton's \"basket of deplorables\" remark, stating that \"no one with that low opinion of the American people should ever be elected president of the United States of America.” @webpagelink"},{"comment_id":"10152907368938525","commenter_b":"wth this world really sucks or should i say the women who dump their babies suck....","commenter_a":"I would probably adopt it too if i could. How sad but beautiful","post_message":"He was heading to work when he made an unexpected discovery."},{"comment_id":"10153871094319705","commenter_b":"@username guys, also keep your pants up, before an INDIAN decides to rape you !","commenter_a":"Only one religion is at the ROOT of so much misery on this planet... STATISTICS that highlight the problem: In 2011, Sunni Muslims accounted for the greatest number of terrorist attacks and fatalities for the third year in a row. Over 5,700 incidents were committed by Sunni Muslims, responsible for nearly 56 percent of all attacks and about 70 percent of 12,533 fatalities.* Another 24 percent of the fatalities are on Shi Muslims. So in 2011, Muslims were responsible for 94 percent of the fatalities in terrorist attacks. Since 2011, with ISIS on the scene, the number of the fatalities victims of the Muslim terrorist attacks- sharply grew, together with Muslims share in the world terrorism that is steadily closing in on 100%. In 2013, according to the US Department of State, a total of 9,707 terrorist attacks occurred worldwide, resulting in more than 17,800 deaths and more than 32,500 ...","post_message":"So devastating."},{"comment_id":"10153748697767629","commenter_b":"If white women didn't flunk every black and Latino out we might have the blacks in college and in education that we need.","commenter_a":"When are we going to start making teachers uncomfortable and scared? its a white, more privileged profession with more time off. Especially at the college level. Shouldn't they fear being shot in the head too? Thankfully we are getting guns on college campuses so that all authority can be radically challenged with an in your face confrontation. The Russian left has always known the power of confronting authority so I'm glad America is catching up. War and Revolution baby! Just like the founding fathers intended.","post_message":"This is beautiful."}]
