[{"comment_id":"10157311512285294","commenter_b":"So... she's not a plagiariser, she's a liar. Guess her and Hillary have something in common after all.","commenter_a":"But didn't Melania say she had no help? Now this? I'm confused I call bull on this one","post_message":"\"I asked to put out this statement because I did not like seeing the way this was distracting from Mr. Trump's historic campaign for president and Melania's beautiful message and presentation.\""},{"comment_id":"1328476607175126","commenter_b":"Lachy are you mad?! Let's do the gym like this next year! A Christmas wonderland","commenter_a":"@username Lachy Munro","post_message":"You think you love Christmas? This couple has more than 100 Christmas trees in their house."},{"comment_id":"10153530016051051","commenter_b":"@username So the child who was raped matters less than a nonsentient parasite?","commenter_a":"I am pro-life but in a case like this, there is no reason on the earth that this 10 YEARS old girl should have to endure any of this, and if anyone says other wise they need to have their heads examined, Rape is never, ever, the victims fault and if that results in pregnancy she should most deff be able to end the life of the baby. In other things abortion is still the womans choice and she and she alone decides weather or not to carry the baby, no one else has the right to say yes no or maybe on the situation at hand including the father, it is not his body that has to go through any of the complications. while i am Pro-Life and think that they should choose to let the baby live and give it up for adoption, i would never, ever tell ...","post_message":"A 10-year-old girl was raped and impregnated by her own father. Now she has learned whether or not she can terminate the pregnancy."},{"comment_id":"1130182300405839","commenter_b":"Sorry about the lies aren't going to work she won the debate she will be our president get over it","commenter_a":"He is a tax cheat. What makes him think he is ok not paying taxes. I truly believes he hates our country. He is scum","post_message":"Absolutely deplorable."},{"comment_id":"10153615779772452","commenter_b":"Fake IDs are already illegal. It's a third degree felony.","commenter_a":"17 and in a nightclub? Maybe now we should BAN fake ID'S. Should of never been there!","post_message":"One of the youngest victims of the #OrlandoShooting was 18-year-old Akyra Murray, a recent graduate of West Catholic Preparatory High School in Philadelphia. She graduated third in her class just last week. She was in Florida to celebrate her graduation and visit her brother."},{"comment_id":"1069162493180002","commenter_b":"Black LIES Matter!","commenter_a":"Life is what you make it....if you obey the laws and live a clean life none of this would happen....put the blame where it belongs.","post_message":"\"The idea that there are tensions between police and particularly black youth is something that kind of went without saying.\""},{"comment_id":"1203529499735652","commenter_b":"Shut the fuck up","commenter_a":"I guess none of you that are bashing Trump know enough history to know that China has a pattern of testing US resolve after every election. (usually between feb and march) Trump brilliantly turned the tables on them. It will be even clearer when she visits trump next month. Chinese government has a mouth that writes checks it can't cash and Trump has called their bluff.","post_message":""}]
