[{"comment_id":"1835391226744152","commenter_b":"Def not girl lol. I liked her back in the day but when she got that diva attitude and had the nerve to kill some of my brain cells with Glitter, I was done lol.","commenter_a":"Whether it was her fault or not, I'm glad she fell on her face. Maybe it will bring her diva attitude down a couple notches because she is annoying.","post_message":"WATCH: Mariah Carey's New Year's Eve mishap; what really happened during performance? abcn.ws/2hHJaGj"},{"comment_id":"10153307488209087","commenter_b":"Read it again, silly bitch.","commenter_a":"Clinton was the one who started the whole \"birther\" movement against Obama. I wonder what she has planned for Sanders.","post_message":"“She is very much trying to put Bernie Sanders on the defensive, and it may be that she feels she has a chance to put this race away,” one Democratic strategist said about Hillary Clinton. “I think a lot of this is trying to end this campaign as early as possible and basically blow Bernie Sanders out of the race.”"},{"comment_id":"485625238294723","commenter_b":"Deport her ass","commenter_a":"This woman is a trouble maker and more behind her... Send her back if she cannot obey our system. This goes for anyone, anyone's religion. By the way does she have automobile insurance>> Is she a Citizen of the USA??????","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"1001645919925097","commenter_b":"why don't she shut the f up and leave","commenter_a":"Open her mouth.","post_message":"Rosie O'Donnell isn't qualified to ___________."},{"comment_id":"1694121650829136","commenter_b":"@username the immigrants themselves cannot legally however once they have a child in America we won't kick them out because they have to raise there American born child this is the idea called anchor babies","commenter_a":"What about his son? His wife is from Hungary right and his other kids had a Mother not American. How does that work?Ship them back I guess.","post_message":"\"No, it’s not in the Constitution. If you read and if you look, and if you go to the real scholars, like different people that I can give you, they will tell you.\" – Donald Trump  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153221736289087","commenter_b":"Hey Reid we do not want this BS in our country!! YOU GET IT?? WE THE PEOPLE WANT ALL OF YOU TO FOLLOW THE CONSTITUTION! WE STILL HAVE FREEDOM OF SPEECH IN THIS COUNTRY! WE WILL NOT BE PUSHED AROUND! WE DO NOT WANT SHARIA LAW HERE! WE DO NOT WANT ANYONE WHO WANTS IT HERE TO LIVE IN THIS COUNTRY! GET IT? GOT IT? GOOD!!!!!","commenter_a":"When will,Dirty Harry apologize for his Viscious atracks,insultscandvcharges,against innocent republicans like mitt Romney ????? Reid is a very bad person.","post_message":"“I call on every Republican to denounce Ben Carson’s disgusting remarks,” Senate Minority Leader Harry Reid said. “That shameful intolerance and bigotry should have no place here."},{"comment_id":"10154490094079342","commenter_b":"@username so it's okay for a woman to put her hands on a man and act like a man but the second she get treated like a man she wanna cry and say, \"I'm a girl!\" FOH! Keep your hands to yourself. Period!","commenter_a":"Kindergarten lesson, first rule. Keep your hands to yourself.","post_message":"The video shows the woman shove Mixon, then he punches her in the face."}]
