[{"comment_id":"1512686248764628","commenter_b":"Oranges are offensive, they resembles balls, likes men's balls! such a coincidence that white males eat oranges?! patriarchy for sure","commenter_a":"This article is very misandrist and perpetuating the matriarchy. All men are handsome inside and out. Try being more accepting, less shallow, and do less femsplaining UGG #triggered","post_message":"\"If someone was quite a weird child, he tends to be a great date.\""},{"comment_id":"10154845355999705","commenter_b":"Omg this is perfect","commenter_a":"@username lolol we need one","post_message":"Someone reverse engineered the umbrella - and it totally works."},{"comment_id":"10153161008224087","commenter_b":"Yvette Eva Hirsch. Where does everyone come up with this comparison? Hitler wanted to kill any non white people. If you weren't blonde haired with blue eyes you were killed. And even then if you meet that criteria and a Jew you where still killed. Trump wants to build a wall and establish a true border which should have been done long ago. He wants to have illegals leave. They are illegal after all and by the current laws shouldn't be able to work due to its illegal to employ a illegal. Notice there is no killing, no rounding up of people based on race. Mexico's constitution doesn't even allow citizens from Mexico to be given citizenship to a child born in another country citizenship in that country. This all started when everyone stopped trying to offend illegals by calling them UN documented to make it sound better. The fact ...","commenter_a":"Maybe the establishment should sign a pledge to treat him fairly, and honor the will of their base!","post_message":"Donald J. Trump said that if he signed the pledge not to run as a third-party candidate, he expects to \"go up 10 or 15 percent\" in polls."},{"comment_id":"490645967790363","commenter_b":"Trump thought better of it and he was invited in. Jorge Ramos is a U.S. Citizen, a gentleman and a great reporter for Univision. Shame on Trump!","commenter_a":"trump was right","post_message":"He just got SCHOOLED!"},{"comment_id":"1040367212665366","commenter_b":"Suck a dick Diane.","commenter_a":"TRUMP will close our borders to illegal people. TRUMP will rid us of common core curriculum! TRUMP will temporarily ban Muslims from entering our country.. TRUMP will build up our military to its once held position! TRUMP will dump obamacare! TRUMP will allow the 2nd amendment to stand! TRUMP will negotiate with foreign countries like a hellstorm! And will NOT back down! TRUMP will in for America! DONALD TRUMP loves America! TRUMP will get jobs... DONALD TRUMP is The ONLY CHANCE we have to stay a FREE NATION!!! That's ALL why we NEED DONALD TRUMP for PRESIDENT of these UNITED STATES of AMERICA!!!!!!!!","post_message":"Breaking...  This changes EVERYTHING!!"},{"comment_id":"1172990589388617","commenter_b":"Bitch","commenter_a":"Marjolaine Morin","post_message":"Shouldn't their legs relax? Why do they curl up?"},{"comment_id":"1696261590644336","commenter_b":"Why don't you take down your wall and move the migrants in... Such hypocracy!!!!!","commenter_a":"Despicable imposter of the Catholic faith.","post_message":"POPE PUSHING OPEN BORDERS, AGAIN  details @webpagelink"}]
