[{"comment_id":"967920213241731","commenter_b":"Stay out of Florida's business.","commenter_a":"Yes","post_message":"A bill to require a 24-hour waiting period for abortions passed the Florida Legislature and is now heading to Gov. Rick Scott's desk. Do you think he should sign it?"},{"comment_id":"928579767188091","commenter_b":"and by the time the police come the dog is probably dead by then.","commenter_a":"Whenever you take justice into your own hands you're committing a crime, call the police that's what they're there for and that's what we pay our taxes for, if we didn't pay the taxes to have those brave police officers do their jobs and we all win that round doing vigilante justice what we paying taxes for","post_message":"Charges against the veteran who was arrested for breaking a window to save the life of a dog left in a hot car have been dropped: on.hln.tv/2QzbEY"},{"comment_id":"10154647269064024","commenter_b":"You must be dumber than dumb to believe a fake news story. And the folks in Hamtramck are laughing their asses off at you, and everyone else, who believes this codswallop. Hamtramck is NOT under Sharia law.","commenter_a":"You folks in Hamtramck, Michigan must be dummer than dumb, now you can live and enjoy what you have done. Happy Days are NOT in your future.","post_message":"First Muslim City Council In U.S. ENFORCES Sharia Law... Too Late Now! - BB4SP"},{"comment_id":"10153310258470090","commenter_b":"www.thefightforjustice.com Former bank employee goes head to head in the courtroom against bank and lawfirm-10 years and counting- Many exposed and the list is growing!","commenter_a":"Hideously profane y","post_message":"All of the above. We want to know WHY you don't want another Clinton in the White House. Tell us here: @webpagelink"},{"comment_id":"1160749183945110","commenter_b":"Lol, the next president will be Hillary!","commenter_a":"One of candidate from these group will be the next president of United of America. The name of that candidate is ......................... ?","post_message":"Here's what some of the candidates have been up to."},{"comment_id":"827024174060503","commenter_b":"@username you move and take that communist Kenyan creep with you","commenter_a":"You libs are pure , unaldulterated \"mush\"! Your president is taking us down the road to nowhere and you are worried about the police killing a wonderful young \"punk\" who stole and bullied and tried to kill an officer? Get off welfare and get a job!","post_message":"\"The power to kill is the most awesome power that any government worker could possibly have. We have given that power to police, and then we have refused to monitor it.\" - Lawrence O'Donnell"},{"comment_id":"10153128633786323","commenter_b":"I think you're getting a bit sadistic Sanchita. \"Lowered into vats of acid\"? You should hear yourself. That's inhumane. They should be put in prison, like they already are. And women CAN rape, though sadly this country's rape legislation is inadequate when it comes to women-perpetrators. What about a woman-on-woman rape? Or when a woman in her 30s rapes a 13 year old boy?","commenter_a":"Stop demonising men","post_message":"“I began this film with a narrow focus: ‘Why do men rape?’ I discovered that the disease is a lack of respect for gender. It’s not just about a few rotten apples, it’s the barrel itself that is rotten.”"}]
