[{"comment_id":"556591217846893","commenter_b":"America needs alot less hate as well as banning corrupt career politicians, NWO,Open borders to fill there own greedy pockets Clinton the lieing witch with soldiers blood on her hands","commenter_a":"To all the hateful mean trolls, seriously and you call yourself an American. Maybe you skipped the part in school that teaches you to be human and love humanity. You can disagree with political views but when you just get mean spirited about a person...thats just wrong!! I think Americans need more love and a lot less hate!!!! Next time you call someone something, look into the mirror and see if you ever sinned yourself. \"Those without sin...cast the first stone\"!!","post_message":"A smiling Hillary Clinton just arrived on Capitol Hill for meetings with Democratic lawmakers. @webpagelink"},{"comment_id":"903279336444237","commenter_b":"Sigh","commenter_a":"Joshua William Grant told you 😂","post_message":"Misogyny is misogyny."},{"comment_id":"533721010147110","commenter_b":"Or maybe we should learn from history instead of repeating the same mistakes over and over. Illegal immigration didn't work out too great for the Native Americans. Has illegal immigration worked out for any culture? We all have a set of keys for our lives, hence I believe we all can agree on a measure of security. I say who comes into my home, you say who is allowed into your home. We can decide on who we let into our community. I wholeheartedly welcome people wishing to be an American. I am against the culture of Islamization and separatists who don't value American principles or agree with our civil rights. There are many different developmental frameworks: Republics, Monarchy, Communism, Islam, etc. Islam is an entire framework of religion, social, economic, legal, political, and military standards which is completely incompatible with American laws, Bill of Rights, and the principles I ...","commenter_a":"I believe this is a good moment to revisit Donald J. Trump policy on going after the families of known terrorists. Seddique Mateen supported the Taliban. His son Omar Mateen should have been deported already. Trump Fan Network get the word out. Donald J. Trump will institute policies to prevent these tragedies. Furthermore, the laws designed to go on the offensive for this threat should be a mix of \"aiding and abetting felons\" with counter-terrorism.","post_message":"The FBI interviewed him twice in 2013 and again in 2014, but determined he was \"not a threat at that time.\""},{"comment_id":"10153409431986336","commenter_b":"Give it a rest ! Donald Trump has every right to his opinion. I agree that this country has had an influx of illegals for years. Be informed and know that Mexico and Guatemala have cut a deal to send thousands more to cross our borders illegally. The monies they send back to Mexico and Guatemala is $120 Billion dollars. This president wants to give them a free pass plus $35 thousand tax refunds? So they cross illegally, burden our health centers, schools, and oh only so you get my disgust! All I used to hear at the hospital is people telling other relatives of theirs to \"Come to the U.S., because this country is so stupid. They give you money for living, food stamps and oh if you have your babies in the U.S. , then they are citizens and you can stay\"... So these so called nice people ...","commenter_a":"Its a PR move. All they really care about are the $$$$$$ NBC and MSNBC are financially hurting. Low ratings low viewership.","post_message":"Breaking News: NBC is ending its business relationship with Donald J. Trump due to his \"recent derogatory statements\" regarding immigrants.   DETAILS: @webpagelink"},{"comment_id":"10153068133586135","commenter_b":"Nope kids do not belong at wedding receptions! Especially with the cost of plates being so expensive!","commenter_a":"Can't stand the non-kid weddings. Just bring them. HA!!","post_message":"After their babysitter cancelled, Jessica Baker and her husband didn't attend the wedding because kids weren't invited. A couple weeks later, they received a bill for $75.90 in the mail to cover the meals they would've eaten at the reception."},{"comment_id":"835512459884693","commenter_b":"Crazy woman","commenter_a":"The truth is not in her.","post_message":"Pelosi glosses over spiking costs under the ACA for millions of Americans."},{"comment_id":"953133518031452","commenter_b":"Wow, county officials must be really threatened by gays getting married. We should tie them to chairs, and make them watch gay marriage ceremonies for weeks on end, to desensitize them.","commenter_a":"Go to the gulf and marry on a ship!","post_message":"They just cannot deal"}]
