[{"comment_id":"10154004285427061","commenter_b":"She is so ugly put a sack over her face","commenter_a":"I tried a similar comment above in my own post. Ppl are to busy thinking they are better or truly know or believe in the government to see the truth right in front of them. A little less attacking the comments of others on Fbk, an you could be smart enough to see the truth. Sure everyone deserves to dress lovely; however people continue to starve. Until you have walked a mile as I have struggling to feed your family/children; enjoy your fancy clothes. I will enjoy feeding my family!","post_message":"WATCH: Fashion forward First Lady Michelle Obama stuns at last night's White House State Dinner: abcn.ws/2ejwQwD"},{"comment_id":"10153591914773132","commenter_b":"Ha","commenter_a":"Well I don't think prada makes sandals his size","post_message":"Looking good, Caitlyn Jenner!"},{"comment_id":"509597579189019","commenter_b":"Her Christ has lice...","commenter_a":"good, hope they all empty their bank accounts and go belly up","post_message":"Hate can make people do stupid things... - Andrew"},{"comment_id":"1676347295991211","commenter_b":"Of course she would praise him. He is a lying louse like her husband.","commenter_a":"Libtard !!","post_message":"Michelle Obama is sending a message to Donald Trump."},{"comment_id":"838126822975658","commenter_b":"I think it is very interesting when you look closely at all the photos of the refugees....you men, military age. ISIS? Muslim Extremists? Frightening to say the least.","commenter_a":"It is with glee and satisfaction i'm watching Europe's descent ito Islamic morass.They want to replace 6 million killed Jews with 40 million Arabs. Europe's punishment is Islam.","post_message":"\"Generous welcome by Germany created a strong magnet to bring millions of migrants from Asia and Africa to Europe.  This is sheer madness and it is dangerous,\" says Daniel Grynglas."},{"comment_id":"1695653017364810","commenter_b":"@username And she is not even bad.","commenter_a":"careful how you word that, don't say \"The GOP is the Party of White People,\" it implies all white people are Republicans. I am white, definitely not Republican.","post_message":"Because of Donald Trump, Republicans are finally being forced to admit that their party is a racist haven that caters to whites only."},{"comment_id":"595624923955506","commenter_b":"yesssss bitch","commenter_a":"@username thought of you bb","post_message":"♫ I'm dreaming of a cheesy Christmas.... ♫"}]
