[{"comment_id":"10153049947289170","commenter_b":"From the info I have seen, they have entire areas that could just be surrounded and taken out......all those \"unsafe for non-muslims to enter\" areas......","commenter_a":"At least someone in power will acknowledge these Muslim terrorists need to be taken out! The problem is they have almost completely taken over France at this point. Apparently France has over 750 No-Go zones in which only Muslims are allowed to live and travel in these territories. Sadly the govern has let them take over like this.","post_message":"I guess this was some reality check."},{"comment_id":"10153500345233352","commenter_b":"Real women make it happen!! (:","commenter_a":"10.50 ???? I make $8.00 hr with 4 kids and a grandbaby,no child support,no housing I can tell a story","post_message":"Single mom, 22, reveals her struggle to live on McDonald’s wages of $10.50 an hour… and how she and her young son have to live in a moldy basement"},{"comment_id":"1275021955856646","commenter_b":"They just need to stay out of our vaginas!","commenter_a":"Talk about several steps back for women's rights. Then women will need permission to use birth control, to vote, to get a job ... And if you are foolish enough to think permission is only going to apply with abortions, you are mistaken. This is Christian right wing control. Can you say Sharia Law, anyone?","post_message":"Oh look, more people not minding their own business."},{"comment_id":"10153194256163812","commenter_b":"humanity at it best.","commenter_a":"Anaa Rodriguez Jesus Rodriguez Beto Rodriguez no salgan!","post_message":""},{"comment_id":"1149894398400704","commenter_b":"Another flip flop by trump,,he once said she would be a great president,,he's pro choice,,he says he's going to deport all illegals,Obama has deported more illegals then any president & it doesn't make any difference,,they just come right back,,Hillary is the only hope we have for the average American,,","commenter_a":"Never killery","post_message":"Trump has no problem with the idea of having a female president in America -- as long as it isn't Hillary Clinton. Do you feel the same way?"},{"comment_id":"10154567902453812","commenter_b":"Another Illegal Alien Speaks","commenter_a":"He's gonna sue again and ask for emergency federal money again!","post_message":"Texas Gov. Greg Abbott sustained \"extensive second- and third-degree burns\" on both legs and could miss next week's Republican National Convention."},{"comment_id":"716079211915990","commenter_b":"Shirley you. Ignorant bitch","commenter_a":"How many mof these post DO WE HAVE TO SEE BEFORE IT IS DONE???? IMPEACH NOW!!","post_message":"House GOP is officially voting on the impeachment of Obama. Let's push this through. Please let this pass. Can we get 75,000 'LIKES' to have Obama impeached?"}]
