[{"comment_id":"1090370634418986","commenter_b":"'@username lol nah it's the bitchy women that make good men run from all women.","commenter_a":"The man is my younger brother and this girl is a psycho. She broke into his house, they WERE engaged but not living together, and she stole $2.1 MILLION worth of jewelry. And this stuff happened AFTER he paid off her house and bought her a business, (just a nail salon). My brother was married for over 20 years and his x will tell you just as I will that he is the most laid back and passive guy you'll ever meet. She sent the jewelry to her parents via UPS and now they're in just as much trouble. The stolen merchandise was never recovered","post_message":"This woman has said her ex-fiance hit her, causing a black eye and other injuries. But now his attorney says this home surveillance video tells a different story.  It's the latest round in a legal battle involving allegations of millions of dollars in stolen jewelry that's unfolding in a Bay Area courtroom: @webpagelink"},{"comment_id":"10154563993751336","commenter_b":"No illegals. Period. No other country puts up with this crap. Not even Mexico. No more paying Welfare, etc., for these people. They break our laws and then steal from us. Those of us that actually pay federal taxes are sick and tired of working so they can have Free Medical, welfare, EBT cards, educate THEIR children, Welfare..Etc., Out they go. Deport them and build the wall.","commenter_a":"I'm all for Trump winning this upcoming election, but building the wall is a joke, and thinking he can make Mexico pay for it is a bigger one. Wall or not you're going to have illegals come in.","post_message":"'[Donald J. Trump] has stuck to his guns on the idea that we're going to have a border, we're going to enforce the border.'  Gov. Mike Huckabee joined Howard Kurtz on 'MediaBuzz' today to react to the GOP presidential nominee 'softening' his tone on immigration. @webpagelink"},{"comment_id":"1588672124482344","commenter_b":"Shut up phonies","commenter_a":"U need to find out mr trump how much killary and obama paid her to do that","post_message":"Meryl Streep blasted Donald Trump and the people who voted for him at the Golden Globes. She received thunderous applause from most of the celebrities gathered there. Do you agree with Trump's assessment of her career?"},{"comment_id":"1696261590644336","commenter_b":"Why don't you take down your wall and move the migrants in... Such hypocracy!!!!!","commenter_a":"Despicable imposter of the Catholic faith.","post_message":"POPE PUSHING OPEN BORDERS, AGAIN  details @webpagelink"},{"comment_id":"10153810976206680","commenter_b":"Lock that vandal up!","commenter_a":"Way better than perjury charges, obstruction of justice, mishandling of classified documents, racketeering (Hillary) or fraud charges (Trump.) Jill spray painted a bulldozer and I would have too had I been there. They were bulldozing ancient barrial grounds and putting in pipelines without concent or respect for international law. #imwithjill","post_message":"Green Party presidential nominee Jill Stein is facing vandalism charges in North Dakota."},{"comment_id":"10153273876007377","commenter_b":"Lady!!1 It's Jail time !!!","commenter_a":"She is a LIAR and TRAITOR.","post_message":"This is a clear violation of federal law that has put these agents in harm's way."},{"comment_id":"1781541005401492","commenter_b":"Praying","commenter_a":":(","post_message":"Live coverage from Eyewitness News: NJ Transit train crashed into the station at Hoboken Terminal.  More details: @webpagelink Photos: @webpagelink"}]
