[{"comment_id":"543124655889625","commenter_b":"How much more money does she need ??!!!!!!!!??","commenter_a":"Is this really Hillary Clinton? @webpagelink","post_message":"This is truly shocking..."},{"comment_id":"1015238835192369","commenter_b":"Not that she's seeming to give a flying bigoted spit spatter regarding the education of people in that group however. Still a power bred over privileged crusty plantation damsel. Like seven generations later. She still wants her back washed by the maid.","commenter_a":"Batshit crazy.","post_message":"Nancy Pelosi identified what she called the \"three G's\" – reasons why white males favor Donald J. Trump over Hillary Clinton. @webpagelink"},{"comment_id":"10154996547968010","commenter_b":"Let the muther fucker SUFFER!","commenter_a":"Think he'll be well enough in time for Trump to appoint him to the SCOTUS?","post_message":"A source said Manson was seriously ill and it was unclear how long his treatment would take."},{"comment_id":"10153858416863271","commenter_b":"Sick woman. I mean the one who posted this comment.","commenter_a":"I've been looking at her Facebook pages(she has two), I'm not justifying her actions and believe it's absolutely disgusting but I'm pretty pretty sure she's special needs. I'm not saying she shouldn't be punished or condoning her behavior but I honestly don't think she knew any better. I'll be willing to go out on a limb and say she was sexually abused. She probably did to him what had been done to her or what was told to do. I can't even imagine what's going on behind those walls.","post_message":"Jessica McCain told investigators that she recorded the sex act on a borrowed cell phone, according to court documents."},{"comment_id":"10150836955014999","commenter_b":"there is nothing more damaging to black community than RACISM!","commenter_a":"There is nothing more damaging to the Black community that the BLM movement. By defining racism and things like \"cultural appropriation\" as the reasons for failure of African Americans to succeed fundamentally points to solutions in the wrong place. If tomorrow, every last vestige of racism were lifted in society, would Blacks suddenly be elevated? No. The cultural deficit of the Black community is the key. Lack of educational attainment, intact families, communities with massive violence, lack of role models all are the key reasons for failure. These problems may stem from historic racism but they are not solved by eliminating racism today. So, when the BLM movement focuses on racism they are actually focusing in on the wrong items. Lifting small racists issues without fixing the basic cultural failings will do nothing. In 10 years, we may have few elements of racism left and a black community with problems ...","post_message":"\" ‘You’re free,’ they keep telling us. But she would’ve been alive if she hadn’t acted so … free.' \""},{"comment_id":"10154095475454575","commenter_b":"Fry him.with low power so he feel the pain .","commenter_a":"Just fry him. No need for him to live another day","post_message":"The toddler and the 14-year-old have been diagnosed with HIV, genital herpes and chlamydia."},{"comment_id":"1569633279990452","commenter_b":"U a fat bitch.u hater.k.k.k.","commenter_a":"Oprah is a racist bitch","post_message":"Way to go Carrie Underwood!"}]
