[{"comment_id":"1283090895060069","commenter_b":"You don't know what you talking about a****** Hillary love douchebag","commenter_a":"Eric Reynolds","post_message":"Every Trump supporter should see this.   Video by Gavin Newsom. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152816135991130","commenter_b":"This isn't funny... Only simple minded people would find it funny. I am not a fan but think this was not necessary.","commenter_a":"Leave the kid alone, can he live? I'm not even a fan I just hate hateful people like the media and evil bloggers ugh","post_message":"WOW. Just wow."},{"comment_id":"10153486926096770","commenter_b":"Conservative Populist? Lmfao","commenter_a":"Trump your next President.","post_message":"After acknowledging he will now raise money for the general election, presumptive Republican presidential nominee Donald J. Trump has named a national finance chairman who has a history with some organizations that could clash with his conservative populist message."},{"comment_id":"1677567089166752","commenter_b":"See ya later Bye! Oh and by the way give all the money back that you made from us Americans who made you rich! That wouldn't happen in any other country they would kick her out. Maybe if all the people who doesn't like america would leave, then we would have a better america! I love my country","commenter_a":"Why are you still here??? Please don't wait any longer, you and your racist, hate mongering friends are NOT welcome here!!!","post_message":"Whoopi Goldberg is planning to move out of the country if Donald J. Trump is elected the next president of the United States. @webpagelink"},{"comment_id":"1748877948703805","commenter_b":"Always been there for women? She doesn't even pay equal to men in her own foundation and campaign. Bernie's \"socialist destination\" is s fulfillment of FDR's vision. Hillary will fulfill the Koch brothers and Walton family's vision. I don't revere poverty, nor do I support buying an election and using electoral fraud to gain office. No, Bernie won't \"part the Red Sea,\" but the electorate he is inspiring will effect a revolution.","commenter_a":"It seems to me that the Super Bernie people are caught up in useless passion over issues that are neither new or original. I distinctly recall when Mrs. Clinton went to capital hill and pitched for universal healthcare on live television. She was eaten alive, but she stood her ground as she has on the grassroots level many many times. She's always been there for women especially where wages were concerned. And there is so much more. Mr. Sanders is not a bad person but it is a bit disinginuous to ride the democratic train to get to a socialistic destination. It's also unfair to insist that anyone who has made the system work for them is a bad person. Bernie is no more deserving of reverence for the money he doesn't have than Hillary for the money she does have. She worked for hers' and he worked for his. ...","post_message":"Time to unify the party."},{"comment_id":"629437257246853","commenter_b":"All I can say she is a stupid bossy bitch. Wtf they need to be kicked out of the whitehouse on their ass and put in prison all the laws they have broken. Don't know why they haven't impeached him yet. It's not racist.","commenter_a":"ugly worthless nigger","post_message":"You'll never guess which word Michelle is trying to ban.  This is ridiculous. Michelle needs to be booted OUT of the White House immediately.  Would you be happy if Michelle was kicked out?"},{"comment_id":"10155007911979228","commenter_b":"Couldn't agree more. This is a global women's health issue and we put so many women at risk by this gag. Women will be dying from this order.","commenter_a":"Thankyou for showing positive leadership against these attacks on women's rights! This is the kind of action we need in DC right now!","post_message":"Two days after millions of women marched to oppose the new president's backward policies, he reinstated the Global Gag Rule, a federal ban that will directly affect a woman's access adequate healthcare in the U.S. and abroad. It's up to Congress to permanently repeal this dangerous rule and I've cosponsored the Global HER Act to end this outdated policy once and for all.  @webpagelink"}]
