[{"comment_id":"10154019133956045","commenter_b":"Ronald Collier","commenter_a":"They could have let this woman get a ride home,,, or even took her home.. she wasn't on the road at the time.. where is the love in this world? I bet she was writing an unbiased story about the council meeting discussions..","post_message":"A Franklin County teacher has been arrested while working at a second job."},{"comment_id":"10154632790424705","commenter_b":"Isabel Galindo","commenter_a":"@username xx","post_message":"Flawless."},{"comment_id":"609328869267784","commenter_b":"Racist woman","commenter_a":"It's always been great.","post_message":"Beyoncé appeared Monday night at the Grammys and led a visual and musical performance celebrating motherhood."},{"comment_id":"10153545478606162","commenter_b":"She is a fake little creep","commenter_a":"hmmmmm, if she hates the way Americans eat why was she in a donut shop?","post_message":"ARIANA DRAMA: \"What the **** is that? I hate Americans. I hate America! That's disgusting,\" Grande said when a tray of doughnuts appeared in front of her."},{"comment_id":"667325733458005","commenter_b":"Gloria I agree. Get their muslim butt back where they came from","commenter_a":"Muslims if you don't like the way America's are then leave. Clint Eastwood has every right to be artistic and make true movies about who you really are then leave AMERICA. We have freedoms you do not have so leave because we will not stop being Americans. The movie was very well done and true to the ooint.","post_message":"This angry Muslim group wants Clint's head, but he's not backing down.  He is a true American, and a real patriot.  Can we get 125,000 'LIKES' for Clint Eastwood?"},{"comment_id":"10153523927041162","commenter_b":"Go marry him.","commenter_a":"I need the money to get out of debt Lord help me omg","post_message":"BIG WIN! A suburban man who likes to play the newest games bought a Golden Casino instant ticket and won $4 million. @webpagelink"},{"comment_id":"10153370562061336","commenter_b":"Drugs are illegal. I bet you could buy all the drugs imaginable in an hour. Guns would be the same if outlawed","commenter_a":"He is such a big fat piece of trash !! He always point out stuff that is the most stupidest crap Iv ever seen !! That boy could have made a bomb or took a knife or a bat in there and killed people also ! So should we take away knifes and bats ! People around this guy didn't know he was crazy ? I feel like people are trying to set it up where they take away all guns then they could do what ever they want to to us ! Guns don't t kill people crazy people do and if it wasn't a gun itd been some thing else he'd killed people with ! I hate that this happened I'd never want any one to get hurt or killed we all need to be as one !! We are all Americans first !!!","post_message":"“We do know that once again innocent people were killed, in part, because someone who wanted to inflict harm had no trouble getting their hands on a gun.”  President Barack Obama spoke moments ago on the #CharlestonShooting: @webpagelink"}]
