[{"comment_id":"10153285470317994","commenter_b":"Rights? RIGHTS? LOL.","commenter_a":"If the son paid for them he had no right. If he paid for them then the joke was on him.","post_message":"Kurin Keys just got his pair of Air Jordan 11. He also just got his grade card and it wasn't good."},{"comment_id":"879108405613069","commenter_b":"He better watch his back. Killery has a lot of time on her hands now.","commenter_a":"Although Comey has a 10 year term, he can be terminated at the Presidents request. He truly needs to go, as well as his assistants. Trump should start with a new regime that will be loyal to the actual rule of law and not a puppet. Thank God lynch is history.","post_message":"James Comey just received the worst news of his life. America demands answers, and you better bet we're going to get them. Do you think Comey needs to come clean?"},{"comment_id":"10155456219056509","commenter_b":"Both are adulterous stalkers.","commenter_a":"Trump is lying about his own words he says he didn't do what these women say but on tape he brags he did. What a liar, lying Trump calls himself a liar. LOL","post_message":"For some women, Donald J. Trump's denial of wrongdoing has made them feel compelled to speak out"},{"comment_id":"10153933838211756","commenter_b":"Feminazis will not be happy either way","commenter_a":"I don't think Super Girl is all that great. You have to have special, super powers to be a strong, useful woman? Not a good role model in my opinion.","post_message":"One bright spot: Strong female-centric shows like \"Supergirl,\" \"Quantico\" and \"Blindspot\" are doing well."},{"comment_id":"571795269654273","commenter_b":"Leave America","commenter_a":"Move to Syria.","post_message":"Here you go, peeps! If you're stumped for ideas check the comment section... they have plenty! @webpagelink"},{"comment_id":"10153071601427434","commenter_b":"Some black women are hot","commenter_a":"You KNOW it was provable, terrible, and criminal when the nearly all white, all male jury found him guilty. Even they were horrified enough.","post_message":"A jury has found Daniel Holtzclaw guilty on 18 of the 36 charges he faced for allegedly assaulting at least 13 black women. He faces up to 263 years in prison."},{"comment_id":"560649254116954","commenter_b":"Lady you are just plain stupid.","commenter_a":"I want to see a Sanders-Trump debate. If you think Hillary would wipe the floor with Trump, Bernie would \"bern\" the floor with Trump! Either way, Trump is a Loser.","post_message":"Wonder what a Hillary Clinton/Donald Trump debate would look like? Take a look."}]
