[{"comment_id":"10152919448276636","commenter_b":"May I remind people of this classic. I used to watch it at my Granny's house every Saturday. @webpagelink","commenter_a":"Racism is an intentional act. This is not racism. Just because it sounds the same does not make it a slur on Pakistani's in any way shape or form. It's a different spelling with a different meaning entirely. whomever started this nonsense needs to be kicked in the butt for trying to stir up trouble.","post_message":"The WHAT are out of containment?"},{"comment_id":"10152885774891130","commenter_b":"Someone needs to tell that to most of today's feminists","commenter_a":"True Feminism exhibits equality. Real Feminists are not extremists seeking to belittle others. Liberal or conservative politics have nothing to do with that. Real Feminism exists on a daily basis through all walks of life. It incorporates normal women rising to challenges at work, at home, and in their communities, who expect equal treatment and equal compensation. It's sad that people can be so ignorant to this definition and can only judge radicalism with radical judgement.","post_message":"Long before feminism was a Hollywood buzzword, these films were way before their time."},{"comment_id":"10153691446913984","commenter_b":"Trey what the bitch in jail","commenter_a":"Someone should call that witch on the carpet. She's a corrupt liar, but I guess that I am supposed to be OK with that because she is a Liberal.","post_message":"Looks like Hillary Clinton just got another piece of bad news, and it's from one of her least-favorite people. 'Bulldog' Gowdy is hot on the trail! Do you support Trey Gowdy's fight to hold Hillary accountable?"},{"comment_id":"10153502208726350","commenter_b":"Too bad they don't pay the woman as much as the men. Men.... 9 million to make it to 16 round. Women.... 2 million for Championship win.","commenter_a":"Congratulations ...Great team","post_message":"\"It was just an epic journey. One we'll never forget.\" - Carli Lloyd to Matt Lauer. #WorldCup #SheBelieves #USWNT Cc: FIFA Women's World Cup"},{"comment_id":"10153105313784203","commenter_b":"Speaking of Obama not attending a rally in France, how about Bush, Cheney, and other Conservatives not attending the 9/11 memorial in their own country @webpagelink","commenter_a":"Unlike the communists digging up Kathy Griffin and Margaret Cho, Jay is actually funny.","post_message":"Why the hell do Republicans love Jay Leno so much?"},{"comment_id":"1371652822850169","commenter_b":"Shut the fuck up dum bytch","commenter_a":"a policemans job is hard and they have to put up with alot of verbal abuse and it takes alot of self restraint, thats y it is important for the good brave cops who really care about what they do to take pride and turn in the bad cops who do not care or are just burnt out","post_message":"This DJ just said it's time for good cops to start calling out bad cops."},{"comment_id":"392535437595004","commenter_b":"What a misogynistic jerk!","commenter_a":"WTF? what a loser! how is this guy in politics? what a loser!","post_message":"No, there's no GOP war on women."}]
