[{"comment_id":"10154959360378812","commenter_b":"She's a nasty nasty woman","commenter_a":"charge her for what.......whats the charge...stop interfering in the election......","post_message":"Congressman Bob Goodlatte: FBI – Federal Bureau of Investigation Director James Comey \"very conscious of the controversy\" within the bureau over decision not to charge Hillary Clinton. @webpagelink #thisweek"},{"comment_id":"10153663698070950","commenter_b":"I am not goin any where...I am a women of God and you need to read your bible,and as far as my gun,i carry it every where i have a permit and the right to carry it","commenter_a":"All of these peoplev are goin to hell if they dont frepnt,And im not giving my gun up for noone,im a responsable gun owner and its my right to carry a gun.....All these gay people need to repent cause he is coming back!!!","post_message":"Motorcyclists, parade-goers march on in L.A. march on during their annual gay pride parade:"},{"comment_id":"585287011661878","commenter_b":"We don't need Muslims here for s*** this is America... They need to stay the f*** home...","commenter_a":"Get out of my country.","post_message":"Furious Muslim students rush stage during American Sniper showing.  They have no respect. If they don't like American Sniper they can leave.  Do you agree these Muslims are out of line?"},{"comment_id":"10152864725267623","commenter_b":"Bajajajajaja!!!! Girl white isn't in it either! Lol","commenter_a":"Lmfao!!!! I am loving how pressed these folks are over this!! Get over it people...and move on!! I'm so happy with my President!","post_message":"Check out what the Obama administration did to the White House:"},{"comment_id":"10153940302636770","commenter_b":"Hillary need to be placed in jail","commenter_a":"Trump is going to say , Hillery u'r Fired !!!!!!!","post_message":"TheDC Election Night: Race is tight!"},{"comment_id":"1582128638759914","commenter_b":"Normal people don't put bombs in dumpsters......terrorists do....","commenter_a":"Tell us again how this isn't an act of terror?","post_message":"Breaking News: FBI releases a 'Wanted' poster identifying 28-year-old Ahmad Khan Rahami, a suspect in the bomb blast in New York City Saturday night.   The FBI's wanted poster identifies Rahami as a naturalized U.S. citizen of Afghan descent. MORE DETAILS: @webpagelink"},{"comment_id":"10153892680026680","commenter_b":"Get a grip Republicans! Don't get weak and give up on Trump! The stakes are much too high! Our lives as we have known them will never be the same if Hillary Clinton wins this election! Donald Trump apologized for things that were said in private 11 years ago but Bill Clinton has yet to apologize for putting his cigar in places it shouldn't be while in the Oval Office and being paid by the taxpayer! There is no low that Killary and team will not stoop to in order to steal this election! October 6, 2016 Clinton Foundation HACKED – Now We KNOW Hillary Clinton Stole More Than Taxpayer Dollars! barney-frank Americans may have been disappointed when Julian Assange announced that he didn’t have an October Surprise for Hillary Clinton, but they weren’t disappointed for long. Another hacker stepped up with an explosive leak. Going by the name “Guccifer ...","commenter_a":"This is too far. You can't start talking about someone is father specially if they are deceased.","post_message":"The file is all of eight pages in length, suggesting the bureau never subjected Fred Trump to any serious scrutiny prior to his death in 1999."}]
