[{"comment_id":"10153406887426955","commenter_b":"Can't wait until someone drops a house on Hilary.","commenter_a":"I'm no detective, but my guess would be Hillary, I mean the wicked witch of the east.","post_message":"WHO STOLE DOROTHY'S SLIPPERS?"},{"comment_id":"10153581092769087","commenter_b":"give us a number, @username. How many Americans should be murdered, raped, robbed or maimed by asshole criminals who should not even be here in the first place? Here are some crimes committed against Americans by Illegal ALIENS The Sanctuary city of San Francisco protected the previously convicted illegal alien gang member charged in the murder of Michael Bologna, 20, his brother Matthew, 16, and his father Anthony, 48 @webpagelink Illegal alien stabs to death 24 year old college student Lauren Bump @webpagelink Illegal alien charged with murder for vicious stabbing death of Kathleen Byham in a Wal-Mart parking lot @webpagelink Twice deported illegal alien charged with murder of Sheriff's Deputy Josie Fox, 37 @webpagelink Mary Nagle - was raped and murdered by illegal alien who then uses her cell phone to brag about crime to her friends and family @webpagelink Illegal Alien Kidnaps, Rapes, and Buries Alive an 8 ...","commenter_a":"\"I have been thinking a lot about Donald Trump, people say that he doesn't have a platform, that he just wants to make America great again. I have something to say about that, Donald Trump is not telling you his plan, he's giving you an outline. Why? Every time that he has brought something to the table, the other candidates take it and run. Such as, immigration, \"the wall\" and other issues. I can guarantee you that he won't give you his full plans in detail until he is standing at the podium, next to one of the Democrats. THAT is when he will reveal everything. He doesn't need to do that now. Donald Trump is a visionary. He doesn't go into business, without a strategy, and a form of negotiation already set. This man is prepared in business and will be fully prepared when the time is right, in ...","post_message":"Republican front-runner Donald J. Trump leads his rivals by double digits in Michigan on the eve of the primary, according to a new poll."},{"comment_id":"1010634062332044","commenter_b":"They are illegal they deserve nothing.","commenter_a":"Obamina will destroy America before he/she lives the building ,unless you beat him to it","post_message":"ENTITLED ILLEGALS: It Now A Crime To Deny Illegal Aliens Tuition Benefits That Most American Don Get @webpagelink"},{"comment_id":"10153899191016770","commenter_b":"another nasty women I guess..","commenter_a":"Real smart people those LDS folks, sarc. Seriously,when the Supreme Court turns liberal full progressive, your little LDS church will be doing homosexual marriages, allowing non Christians to come to your places of worship, oh, I can't imagine the world of hurt the LDS is in for. Oh well, principles and all. Good for you, bless your heart, y'all just so pure as the wind driven snow.","post_message":"Latest Poll: This Conservative State Now Has Trump In Second Place. Wait. What? @webpagelink"},{"comment_id":"10153076397462452","commenter_b":"Yikes!!! Kill it with fire before it rapes again.","commenter_a":"Why do child molesters look so child molestery?","post_message":"A former drama teacher at Sycamore Junior High School in Anaheim has been arrested on child molestation and child pornography charges. @webpagelink"},{"comment_id":"10153278870867217","commenter_b":"Some woman wear a hijab out of choice !","commenter_a":"With a Hijaab. . ? 1st education they need. . Is to get out of hijaab slavery m8, , Pls convey this to them","post_message":"\"We want to inspire young girls to stand up for their rights.\""},{"comment_id":"773502486092553","commenter_b":"The profit mohammad is a pedophile goat raping POS.","commenter_a":"Even Hitler would hate Obama.","post_message":"OBAMA THROAT: FOLLOW ISLAMIC MONEY? If you look into Obama’s foreign student status the subject is quite involved. It is not just if he was a foreign student, but was he an American posing as a foreign student? Is Obama an American that received funding from foreigners? Did he just get student loans and work hard? Is Obama keeping his records confidential to cover something even bigger than Obama himself? Ask yourself this question, would opening up Obama’s Harvard records cause people to closely examine the influence of oil rich Arabs that may want to impose Islam on the United States? In 1979 Vernon Jarrett, father in law of Valerie Jarrett, wrote about expecting Arabs to help disadvantaged black students. Khalid Abdullah Tariq Al-Mansour, formerly known as Donald Warden, had apparently been working with “rich Arab kingdoms” for this very purpose. Jarrett insisted that this is coming. @webpagelink So a ..."}]
