[{"comment_id":"420220894769172","commenter_b":"Yep and anyone else. Crazy bitch","commenter_a":"If she can't take it, get out of the kitchen!","post_message":"Republican Presidential candidates are all ganging up on Hillary Clinton. Is this fair?"},{"comment_id":"10152926251994071","commenter_b":"Their porn is awesome. Fully filled girls, unlike the skinny twigs the US has to offer.","commenter_a":"Small wonder. Have you ever seen their porn? Horrifying.","post_message":"It's a \"time bomb.\""},{"comment_id":"528240787342392","commenter_b":"she looks like a fat ape","commenter_a":"What a wonderful First Lady!!! Prayers for Candy & Ben Carson!!!","post_message":"Candy got to meet some great people this weekend in New Hampshire! #BC2DC16"},{"comment_id":"10153146701373984","commenter_b":"Scumbag","commenter_a":"He will never get impeached. He has to many people in his pocket. He started crap the second day in office and it just snowballed, and here we are today. Happy you liberals and the people who voted twice for this Muslim","post_message":"This new plan could spell disaster for America...  Should Obama be impeached before he does more damage?"},{"comment_id":"898264413641666","commenter_b":"He shortchanged everybody Diddy! Everyone who isn't a 1%-er.","commenter_a":"Sometimes silence is golden. Our President has done an Excellent Job! Take the Plank out of your own EYE!!","post_message":"Sean 'Diddy' Combs Says President Obama 'Shortchanged' Black People"},{"comment_id":"1021126491243474","commenter_b":"And yet a student did intervene verbally and is still alive.","commenter_a":"Shame on that teacher for not standing up for that student. Even if she was being disruptive in class she still deserves to be protected and treated with decency.","post_message":"When a white Spring Valley cop brutally assaulted her classmate, Niya Kenny sprung to her defense.  How could she have known what would happen to her next  just for speaking up? #AssaultAtSpringValleyHigh"},{"comment_id":"10153009843726378","commenter_b":"A female can't be a predator","commenter_a":"So if a forty year old woman had sex with your sons you'd cheer him on and joke? What about a forty year old man that had sex with your 15 year old daughter? Because according to these comments no one cares about female predators.","post_message":"GUILTY PLEA: A former Baltimore Ravens cheerleader pleads guilty to raping a 15-year-old boy."}]
