[{"comment_id":"10153203581878984","commenter_b":"Didn't a bunch of people get in trouble for using their own private email accounts for using government email accounts during an election. Why is it different with this woman she should have to open up every single email ever written or received just because it was her so called private account she did government business on it so that exams her from any protection","commenter_a":"God Bless you, Trey Gowdy !!!","post_message":"Hillary’s private emails could contain the smoking gun regarding the scope of her involvement in the Benghazi attacks… Send an email to Rep. Gowdy demanding answers from Hillary and the State Department!"},{"comment_id":"821899111236478","commenter_b":"My wife would have really liked you","commenter_a":"I believe in god, i believe there is something good and benevolent surrounding all of the miracles of life....... I believe we all have a connection to god, and that means every, single, last, one of us........ No matter what race, color, sexual orientation, or faith. I refuse to believe god (a being of pure benevolence) would ever discriminate....... I believe god is the personification of good in people.... If you are gay, atheist, and black, and are someone who does good, you are far closer to god than someone who is straight, catholic, and white and spend your life discriminating and spreading hatred to those around you..... It's time to grow up, to live and let live, and to try to lead a life of compassion and understanding rather than judgement and contempt. People will be different, but people with good souls, deep inside, are always aligned, we are ...","post_message":"Share if you agree. Image by Occupy Democrats"},{"comment_id":"764116903756422","commenter_b":"@username I don't see you birthing a baby out of your pee hole.","commenter_a":"I see all of these people shaming women for having an abortion, but it takes two. The woman just has to walk around with the evidence. So many are so quick to hold up signs and protest against a woman's choice yet we have so many unwanted children waiting to be adopted. Caring for children doesn't stop at a fetus. If you're going to protest and shame a woman for making, for some a very difficult choice, how about you go through an adoption process, pay for children's education and medical, etc. If you're not out there trying to adopt unwanted children, then you really shouldn't be shaming a woman for having an abortion or taking her right to choose. Perhaps if people and the government put this much attention toward education, and giving equal opportunities to all, we would have more successful people and less unplanned pregnancies.","post_message":"\"Women's health and rights are now one of the first casualties of the Trump administration.\""},{"comment_id":"10154473881370329","commenter_b":"Ivan Roy Rasmussen YESS!!!!! Hahahahaha","commenter_a":"Katie KocajSierra Weiner squid ward tortellini","post_message":"\"Am I a pretty girl?\" // SpongeBob SquarePants"},{"comment_id":"384888735032754","commenter_b":"Beautiful.","commenter_a":"just awesome just like his dad great job","post_message":"Just like his Father...AWESOME!"},{"comment_id":"10150572291974999","commenter_b":"Ok head in a pressure cooker, she chop the guy? that is cold, women have alternatives like \"the police\", runing away, any place she runs to will be better than prison for life or death. So she did the crime, now do the punishment she had her choice.","commenter_a":"....she killed the guy, put his head in a pressure cooker and then chop the rest of him before telling anybody. Do you know how long that must have been? china did exactly what was right and her sentence isnt harsh at all. Anyone asking for a lighter sentence is out of their mind. She needs to sit in jail for a while and maybe see a head doctor.","post_message":"Women in China who killed abusive spouses were once routinely executed, but as the scale of domestic violence began to emerge in the early 2000s — officials say one in four marriages is affected, activists say one in three — lengthy prison sentences became the norm instead."},{"comment_id":"10152800411296051","commenter_b":"Nice with her hands","commenter_a":"Good.","post_message":"This guy noticed a 12-year-old girl walking alone and thought she’d be an easy target. He had no idea who he was messing with."}]
