[{"comment_id":"10153314267037434","commenter_b":"\"Just fly to the UK, no biggie\" except this woman couldn't raise the money to fly to the UK and pay for the procedure that others get for free, and so she ended up in the above situation. \"Fly to the UK, prpblem solved!\" Easy to be callous and glib when its some other poor sucker's life and you're ignorant of the facts, isn't it?","commenter_a":"Yay, Ireland. I live in terror of an unwanted pregnancy because of this kind of insanity. :/","post_message":"Had the woman been living anywhere else in the United Kingdom, she would not have seen a courtroom. However, abortion remains illegal in Northern Ireland."},{"comment_id":"10152922886022377","commenter_b":"Lock her up and throw away the key!!!","commenter_a":"Her mug shot will be her best picture.","post_message":"Criminal charges coming soon for Hillary Clinton?"},{"comment_id":"1309394412429310","commenter_b":"Cameron, it is obvious that you are not a Student of Roman Empire History. One of the last accepted practices, prior to the down fall was homosexuality and everything associated with it. The Citizens of Rome lost direction, they became more interested in Entertainment and the Entertainers that the health of the Nation. Want to know more, it is available","commenter_a":"Roman civilization didn't have God they worshiped abunch of gods and mainly themselves and there the longest most prosperous civilization in history","post_message":""},{"comment_id":"1257260354293992","commenter_b":"You are illegal go away","commenter_a":"Oh yeah more guns to START shooting over the least thing or person ASSumed to be Muslim....................","post_message":"\"If more good people had concealed carry permits then we could end those Muslims before they walked in killing,\" Jerry Falwell Jr. said Friday."},{"comment_id":"10153850610670575","commenter_b":"We will see...won't we? Vote Trump and Mexico will pay for the wall. All the others will not put up a wall. All the other candidates don't care about how many drugs are coming across the borders to ruin America and her children. Trump 2016.","commenter_a":"If he doesn't check his tone, he'll be out there with shovel in hand building the well.","post_message":"Maybe not you sir, but Mexico is paying for it!"},{"comment_id":"10154336382586729","commenter_b":"What a bitch...","commenter_a":"Maybe she could watch it from her prison cell!","post_message":"This woman...SMH"},{"comment_id":"10155053775333984","commenter_b":"Maybe someone should shove a fork up your ass bitch","commenter_a":"I hope the government is checking the silverware and other furnishings of the WH before the Obamas leave...... we all remember what happened when the last democrat family left the White House.......","post_message":"As the Obamas leave the White House, Congress has some bad news for them... and this time, they're delivering it to MICHELLE Obama. See the bad news they have for the first lady while she's on her way out the door..."}]
