[{"comment_id":"10153469800395671","commenter_b":"The fact she had felony DUI charges in the waiting... leads one to think she has done this more than once. \"...facing felony drunken driving charges and cruelty to a child stemming from a previous incident.\" I doubt that she was so unlucky that the one time she went drinking then driving, she got into an accident and was arrested for DUI. This is usually a pattern behavior.","commenter_a":"Your not innocent when you drive drunk, multiple times. Your a murderous person that cares less about others even your own children! Wake up !","post_message":"The woman who was driving a car that crashed and killed five people this past weekend was facing felony DUI charges and cruelty to a child stemming from a previous incident."},{"comment_id":"10155170466528984","commenter_b":"Hire American instead of illegals","commenter_a":"COWARDICE","post_message":"This just in..."},{"comment_id":"841387199293221","commenter_b":"Lol bitch ass no life","commenter_a":"Who cares about a road named after we want justice for her and her killer or killers in jail for murder so sad hoping we get justice sad it takes this to game a road names after you praying for your family and friends rip Sandra justice 4 Sandra","post_message":"It is the same stretch of road on which she was arrested."},{"comment_id":"10154363998161756","commenter_b":"You're right @username, it's easier to lie to the people and then change nothing. #sheisworthless","commenter_a":"The mainstream media - and @username is that - has done the work of the status quo establishment and convinced the American people that nothing can be done anymore because it's too hard and too complicated. Anything is possible, but it will take the will of the people to continue the political revolution. Change is coming, but it will be a long struggle. A hard fight against the establishment. Bernie or bust. Don't ever give up.","post_message":"The effort ultimately would rely on Sanders getting stalwart backers of his plan into key positions, followed by a difficult, drawn-out fight with the powerful industry."},{"comment_id":"10153912824075579","commenter_b":"This women reminds me of what I leave behind in the toilet!!!!! And It really stinks! FLUSH!","commenter_a":"Whatever her stylist is doing, keep doing it. Love that green leather jacket!","post_message":" had a pretty long day yesterday. Hillary Clinton addresses the DNC Women Leadership Forum.  Watch complete video from the event here: @webpagelink"},{"comment_id":"10153353457471037","commenter_b":"@username he fondled them vaginally. He violated them. Fine line when denying it is rape...","commenter_a":"How can they know he touched his sisters and allow him to continue to live in their home?","post_message":"Josh Duggar of 19 Kids and Counting is embroiled in scandal"},{"comment_id":"540837429437883","commenter_b":"They reap what they sow ! Don't allow them in your country. Deport the ones there .","commenter_a":"Lets not allow these problems with muslim REFUGEES in europe keep us from doing our duty for the safety of america. Our president asked that we turn in our guns so we really need to get moving and take care of that!","post_message":"COMING SOON in your city and town..."}]
