[{"comment_id":"1658924690814663","commenter_b":"And last time I checked, Treason still carries the death penalty! That would certainly get rid of a bunch of \"bad actors\"! It would go a LONG WAY towards \"making America great again\"!!!","commenter_a":"Trump and Bannon are complicit in Flynn's actions. Does anyone remember Trump tweeting about how \"smart\" Putin is after Putin chose to not retaliate against the sanctions?? This was all coordinated at the highest levels. The whole administration should be in jail for conspiring with a foreign government against America's interests both before and after the election. If all of this put together isn't treason, I don't know what is.","post_message":"Bet Trump knew about this...."},{"comment_id":"10153842022041336","commenter_b":"@username. You are a blooming idiot fool!!","commenter_a":"Too egotistical! He will never resign but, he will go down in history as the most Anti-American and incompetent man ever to reside in Our White House without doubt!!","post_message":"“We are in World War III,” Michael Goodwin said on 'The Real Story.' “And if America is not going to lead, who is?”"},{"comment_id":"907515899315838","commenter_b":"Thought it was Vermont?","commenter_a":"And yet the latest FBI Uniform Crime Report shows that Maine is the safest state in the US. Hmmm...Coincidence?","post_message":"They're quarantining themselves!"},{"comment_id":"928764863812971","commenter_b":"She would be a nightmare! She can't even run a business.","commenter_a":"No.","post_message":"It's official."},{"comment_id":"1029861463715941","commenter_b":"You are wrong about Cruz but, everybody has their own thoughts but if you want a change then start listening to Senator Ted Cruz.","commenter_a":"Who?? Never heard of this guy! Looks like he never heard of a shower? Regardless, I will not vote for Rafael \"Ted\" Cruz, who has only been in this country since 1974!!","post_message":"OFFICIAL ENDORSEMENT... This changes everything!"},{"comment_id":"1758399887778329","commenter_b":"Hillary Clinton is as corrupt as they come, she needs to be held accountable and put in a prison cell. Corruption in Washington is running rampant and WE THE PEOPLE are sick of it.","commenter_a":"Lol... At least she appears to be truthful with her daughter","post_message":"Hillary Clinton told her daughter in an email that there was a terror attack in Benghazi, according to an email provided to the Benghazi Select Committee. @webpagelink The GOP-led committee will discuss the report in a news conference at 10a ET."},{"comment_id":"10156202756245354","commenter_b":"@username, lol, I'm doing just fine sitting here on the beach. Awful life? Bitch please.","commenter_a":"How much did the Pope's dress cost?","post_message":"Pro-Tip: When bashing capitalism is your brand, it's best not to wear dresses that cost $2,300.00."}]
