[{"comment_id":"1186165314729122","commenter_b":"She can afford it. Why do taxpayers pay for her ?!!!! She needs get over herself.","commenter_a":"All cops should refuse ,let her pay for her own security.","post_message":"Several members of the Pittsburgh Police Department have refused to work security at Beyoncé's concert tonight."},{"comment_id":"1195858527119048","commenter_b":"That is what we call \"seasons\" in Texas. LOL","commenter_a":"No it is not. Just look around us fire in one state floods in others and earthquakes in others lakes dying up and animals dying from bad water and no food.","post_message":"This is important."},{"comment_id":"10152818238035927","commenter_b":"LOL! Funny..I've never seen a Good Looking Gay Couple...Lol!","commenter_a":"How can this be a gay Marriage? The one on the right looks like a man!","post_message":"This Ohio judge may take some heat for his recent decision on gay marriage ..."},{"comment_id":"10153463881442235","commenter_b":"Wow @username aren't you just a little dick. I bet you work at fux news you pathetic bitch","commenter_a":"This report was completely one sided. Where were the interviews of white people who are homeless. Bill you just showed your true colors. If this report is not racist i don't know what is. O'REILLY can kiss the center of my ass.","post_message":"This could be the most despicable, manipulative report Fox News has ever produced ..."},{"comment_id":"712854462154600","commenter_b":"Abe Foxman is a puppet and does NOT speak for most intelligent Jews!!","commenter_a":"We should HOUND their offices and call and support OREN","post_message":"“In the days leading up to the forthcoming release of a memoir of his experiences as Israel’s Ambassador to the US, Michael Oren appears to be using the very legitimate and sharp policy disagreements between Israel and the US as an insensitive and unjustified attack on the president,” Foxman said in a statement. “We hope that Ambassador Oren will walk back these unjustified attacks.\" -- ADADL - Anti-Defamation League Abe Foxman"},{"comment_id":"10153644073950861","commenter_b":"They can get married with benefits now. What the hell else do they want?","commenter_a":"The Florda man is at it again","post_message":"The display, based on the holiday depicted in \"Seinfeld\", will be 6-feet tall, wrapped in the colors of the gay pride rainbow flag and topped with a disco ball."},{"comment_id":"10152909457852869","commenter_b":"*morons* there is not an \"a\" in the word and you do not use an apostrophe in a plural. Have a nice day!","commenter_a":"Please do not compare the rattlesnake to Islamic Jihad. The rattlesnake believes in live and let live. Leave them alone and the rattlesnake will leave you alone!","post_message":"What do Islamic Jihad and rattlesnakes have in common? You don't negotiate with them, you don't feed them...you take their heads off before they bite you. WATCH and SHARE..."}]
