[{"comment_id":"565742550241188","commenter_b":"She is no different then her mother. Dumb. Maybe she should look into how not to get pregnant..","commenter_a":"Who is she to tell Obama to get out of Alsska. This girl is the lowest form of humanity....typical Zpalin low life....","post_message":"Bristol says no one ever refers to the mountain as Denali.   Except, her own mother did in 2009. Ooops!  But she wants Obama out of Alaska, dammit.   -Conover"},{"comment_id":"10156497004350294","commenter_b":"Looks like we need to start banning vehicles. All of these vehicles just hitting and killing people is unacceptable!","commenter_a":"So sad... prayers for the families","post_message":"The woman and a man were crossing the street when a vehicle hit them. Anyone with more information is asked to step forward:"},{"comment_id":"1525021640848139","commenter_b":"Connie your argument makes no logical sense. You can't have it both ways. There are no voter suppression laws. Requiring an id is not voter suppression.","commenter_a":"Where was all your outrage over the treasonous Clinton pay for play entanglements? This page is so ridiculous","post_message":"Trump's not going to like this one bit!"},{"comment_id":"917835871594729","commenter_b":"This is a very old photo of Hillary...she has become too old and out of date to be the Democratic President we need!","commenter_a":"Be nice if She would make up Her mind!","post_message":"Are you supporting Hillary 2016? Then go to DemStarter.com right now and show your support: @webpagelink  Hillary is in 3rd place in pledged support behind Elizabeth Warren and Bernie Sanders on DemStarter.com, but we're still just days into it.  Go to DemStarter.com, and show your support for Hillary, or for your favorite Democrat!"},{"comment_id":"10153588117402235","commenter_b":"An abortion is cheaper than kids...just sayin","commenter_a":"Ummm...2 things here...this jail is ridic for withholding/failing to administer medicine for an inmate...but also, stop having kids if you can't afford them...now these kids will be a burden on the system and are at risk to perpetuate this same cycle...aren't condoms like $5 wtf","post_message":"He was arrested for unpaid child support.   Now he's dead."},{"comment_id":"839838619485613","commenter_b":"this is as serious as it gets , shes going to bring muslims to America whose religion dictates they rape women and behead the men ,NOT A JOKE","commenter_a":"your listening to the woman that will destroy America , its NO JOKE , ITS NOT BULL CRAP wake up this crook doesn't care about you , MONEY AND POWER that's all shes after","post_message":"WATCH LIVE: Hillary Clinton speaks at an organizing event in Florida — will she bring up Donald J. Trump's tweets?"},{"comment_id":"10153510348059411","commenter_b":"serious lips on that lady, shes got Grace Jones beat even.","commenter_a":"She has no ideas worth repeating-FIRE her.","post_message":""}]
