[{"comment_id":"990898310953409","commenter_b":"'Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you'","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas.  @webpagelink"},{"comment_id":"10153220467940950","commenter_b":"Lets hope for something known as KARMA, mf'r.","commenter_a":"That's so wrong","post_message":"A video showing a McDonald's drive-through worker offering a reportedly homeless man a burger and then throwing water in the man's face is quickly moving through social media waves."},{"comment_id":"10153929399138598","commenter_b":"she does NOT belong in prison","commenter_a":"You pig","post_message":"Woman Who Killed Her 25-Week-Old Unborn Baby and Threw Him in Dumpster Appeals Conviction"},{"comment_id":"10153541648111336","commenter_b":"Trump is in favor of obumercare or something like it.","commenter_a":"WE HAD AN ELECTION AND WERE PROMISED BY THOSE WHE ELECTED THAT THEY WOULD DEFUND AND REPEAL OBAMACARE they haven't done either or even tried looks like both sides are out to destroy us!!!!!TRUMP FOR PRESIDENT!!!!!!","post_message":"The first Obamacare-created insurer to go under could cost federal taxpayers up to $140 million, according to a new court filing."},{"comment_id":"10153199106634071","commenter_b":"Get her a group of body guards while you're at it","commenter_a":"M","post_message":"A $48.5 million diamond for a 7-year-old girl."},{"comment_id":"10153750072683352","commenter_b":"Or she was a trashed up slut waiting to get picked up by anyone..","commenter_a":"She was probably a law abiding citizen he only calls felons and degenerates","post_message":"‘We’ve not heard a word': Relatives of woman shot dead on San Francisco pier criticize Obama for not contacting them as they demand tougher immigration laws"},{"comment_id":"710250332447494","commenter_b":"She's an idiot and should get out of our country","commenter_a":"what drug is she on ?","post_message":"Woman Goes On National TV And Blames Americans For Banning Sharia Law And Executing Kids In...  This must be some kind of sick joke.  Do you think she has completely lost her mind?"}]
