[{"comment_id":"914387928629071","commenter_b":"Send all illegals home now","commenter_a":"YES YES YES","post_message":"Americas Freedom Fighters"},{"comment_id":"10153053091263984","commenter_b":"HOW ABOUT MOVE OUT OF THE WH!!!!","commenter_a":"all the kids should pack their lunch","post_message":"Alright Michelle Obama, 'Let's Move' on to you finding a new hobby. Preferably something that doesn't involve pushing this agenda on Americans..."},{"comment_id":"10152750349506130","commenter_b":"Wow your a dumb bitch","commenter_a":"All these comments about donating the dress are so retarded. If a bride can't afford a dress she shouldn't be having a wedding. There's enough poor people getting married and procreating which is gross lol get your own dress and she can do whatever the hell she wants with hers","post_message":"\"I knew that a pity party was the farthest thing from what I wanted or needed.\""},{"comment_id":"1073897729311987","commenter_b":"@username LOCK HER UP!","commenter_a":"@username. First American woman likley to pardon her self for her many crimes if ever elected.","post_message":"The women of Team USA broke through glass ceilings, wrote history, and showed the world what it means to represent the red, white, and blue. Read some of their stories: hrc.io/2bQa5y3"},{"comment_id":"892607410865802","commenter_b":"As far as an analogy, this is not \"I don't agree with you so I get to beat you.\" This was more like \"you're an abusive boss and I will not be quiet about it.\"","commenter_a":"I find it funny how these pro Trumpers freak out and say how violent Bernie supporters are when in reality it is Trump's hate filled rhetoric that instigates this reaction. God help us all.","post_message":"Californians are having none of Donald Trump's bigoted hate speech."},{"comment_id":"1335775503144117","commenter_b":"Very well said, @username! Plus, people just didn't vote in the primaries enough. It was a simple matter of numbers. But he's still out there and I'm hopeful for 2020!","commenter_a":"i was a die hard Bernie supporter, but I would like to know the truth. Was Bernie placed in the primaries to gain the young vote knowing he would drop out only to hopefully hand the votes over to Hillary. Was he truly conspired against by the DNC or as this post says why didn't he stand up to his constituents? What went wrong Bernie, can you please tell the ones who like me, wrote you in on the ballot even though you weren't registered aS a write in. Your true believers.","post_message":"If you don't have the guts to face your constituents, you shouldn't be in the United States Congress. If you need police at the town hall meetings, that's fine, have police at the meetings, have security at the meetings. But don't use that as an excuse to run away from your constituents after you support repealing the Affordable Care Act, doing away with protections for pre-existing conditions. If you're going to do all those things, answer the questions your constituents have."},{"comment_id":"10153157400746130","commenter_b":"I gained a lot of weight on women food.","commenter_a":"Savanna Bailey","post_message":"\"I quickly learned that food 'for women' just isn’t enough food. It's designed to starve you.\""}]
