[{"comment_id":"1777601655795113","commenter_b":"Hilary is such a hypocrite. She is lighting the matches.","commenter_a":"But hey, Hillary over Trump for sure.","post_message":"The divisive rhetoric and encouragement of violence we're hearing from Donald Trump isn't just wrong—it's dangerous."},{"comment_id":"10152796011681130","commenter_b":"That's right. You. Cant Your not a football fan. Just some bitch with a uneducated opinion. Sad...","commenter_a":"So they should be disqualfied and the Colts should get in.","post_message":"So it wasn't just some weird conspiracy theory."},{"comment_id":"1657660854509683","commenter_b":"His wife was from Saudi Arabia the home of Isis and bin ladan. She radicalized him! These people mindset are very scary","commenter_a":"Islamic terrorist scumbags.. His wife should never have been admitted into the USA. America has the dumbest immigration policy on earth. Thanks for the 1965 \"turn America into the world's dumping ground \" immigration act teddy Kennedy!! NOT","post_message":"The gunman who turned a holiday party into a mass murder scene with his wife had complained that his co-workers made fun of him."},{"comment_id":"10153593606745575","commenter_b":"@username That would require the removal of the colored beast as well as the illegals as they are responsible for 49/50 murders in NYC ofr instance. 96% of all crimes in that city and a whopping 98% of all gun assaults. Liberal American preaches these two species are to be housed, fed, clothed, educated and given the best medical treatment in return for their confusion between acting civilized and acting like animals.","commenter_a":"You women need to vote Republican or this will become common.","post_message":""},{"comment_id":"10153231905295047","commenter_b":"Obama must be stopped, or the Supreme Court is complicit in his wrongful actions.","commenter_a":"Qut saying it, DO IT.","post_message":"When President Obama circumvents Congress to rewrite the law, he's acting more like a king than a President. His illegal Executive overreach must be stopped. Sign and Share our Supreme Court brief to take action: @webpagelink"},{"comment_id":"934633189910873","commenter_b":"Ah, Danielle, so you had the choice because of feminists who paved the way for you to do so.","commenter_a":"It user to be Matt but anymore it's just crazy man hating women destroying family dynamics in this country. I believe in equality, rights and fair treatment of all. Men, women, and all races, but I'm not a feminist. I support my family the best way I can now which is to stay home and take care of them. My children are smarter and safer with me here, plus they have a structured living environment. I plan on getting a p/t job when they both start full time school but as for now this is where I'm needed. And I love every minute of it even the hard days.","post_message":"Ellen Page has a point here, ya know... Thanks for the photo, MTV Act!"},{"comment_id":"10152780954836094","commenter_b":"A whore doesn't care who pays them, but whomever pays them calls the shots of the services to be rendered.","commenter_a":"The \"corporate system whores\" can't make treaties with foriegn governments. Only political whores can do that.","post_message":"Within the economics discipline, Joseph Stiglitz has been one of the Trans-Pacific Partnership's most outspoken critics. The Nobel Prize winner in economics recently shared his concerns about the TPP at a community meeting in Queens, New York City."}]
