[{"comment_id":"10156563321065354","commenter_b":"She is such a fucking idiot.","commenter_a":"A lying bitch just a lot of talk. Her proposals want ever work. Hillary though will never be president","post_message":"#6 and #7 will INFURIATE you..."},{"comment_id":"10153083234283837","commenter_b":"What does sleeping have to do with a woman running over someone with her car?","commenter_a":"Thus is why elderly should not be sleeping","post_message":"APPALLING ACCIDENT - An elderly woman accidentally ran over a man, believed to be her husband, in the driveway of their Fort Lauderdale home."},{"comment_id":"1783100141966543","commenter_b":"We should build a wall at the California line and put all the liberals in it...","commenter_a":"Wutttt ?????","post_message":"Game of Thrones actress Sophie Turner (Sansa Stark) attacked Trump saying that if she could fix the world, she would kick him \"out of the country. And we’d create a wall around him so he couldn’t escape.”"},{"comment_id":"993982434028144","commenter_b":"That's my girl.","commenter_a":"Aarøn Andersøn","post_message":"\"The Seniors and Veterans Emergency Benefits Act would give about 70 million seniors, veterans, people with disabilities, and others an emergency payment equal to 3.9 percent of the average annual Social Security benefit, about $581 – the same percentage raise as the top CEOs got last year.\"  Read more here: @webpagelink  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"536832686498611","commenter_b":"Some of bernies supporters have been crazy lately","commenter_a":"Hillary Clinton MAY HAVE BEEN a liberal at one point. She no longer is. She is a bought subsidiary of large business. If Sanders isn't nominated I'm staying home. She won't get my vote. Edit: I also will never forget the racism and division of Hillary supporters who made the entire DNC kiss their ass to mend fences. It's not \"her turn\" and if I had my way she would never ever see the White House.","post_message":"Let's not do the GOP's bidding."},{"comment_id":"746903725500205","commenter_b":"she is a disgarce and should be reprimanded so should cbs and the nfl they truly are responsible for giving this racist cop hating person a platform in which she was able to spread hate and racism","commenter_a":"YES.","post_message":"Congressman Absolutely Unloads On Beyonce For Vile Halftime Show  She completely overstepped her boundaries.  Do you agree with this Congressman?"},{"comment_id":"1238174809572379","commenter_b":"Con-woman!.....criminal.","commenter_a":"And you believe that both Pence and The Wall Street journal are saying the truth!! Pence is campaigning although, as an honest Republican, he'd better stay silence. And WSJ, I have not seen it but it sounds like somebody's opinion.","post_message":"Labor Day is a time to pause and honor the hard-working Americans who have built our nation's infrastructure, and powered our economy for generations."}]
