[{"comment_id":"497513650439215","commenter_b":"Bitch","commenter_a":"Well then ll blacks are racist even if they don't use the Cracker word!!!","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"10153338672643721","commenter_b":"I've had a lot of experience with it An am only giving my opinion based on my experience am not trying to upset anyone am just giving u my insight","commenter_a":"So how are these people getting LSD exactly?","post_message":"How LSD microdosing became the hot new business trip. (via Rolling Stone)"},{"comment_id":"1828581784096492","commenter_b":"You can be my snowflake anytime brother❤ the majority","commenter_a":"Snowflake. Go ahead. You can call me a snowflake. I don’t mind. In fact, I kind of like it. A snowflake travels through the atmosphere molded by the climate and emerges as a distinct crystal. Shaped by its environment but maintaining a steady path to become grounded on this earth. I am not the only snowflake. There are 65 million of us and together we are a blizzard. A sustained storm enveloping everything it its path. Clearing the air and blanketing the earth in a fine powder. Covering over the dirt and the grime along with strong winds exposing corruption, bigotry, misogyny, nepotism & cronyism. 65 million snowflakes are an avalanche. Once triggered, we are unstoppable. Accelerating rapidly and gaining strength. Overcoming all resistance. Scouring the landscape and hauling away the detritus and the scum. Leaving no place for prejudice and hatred to gain a foothold. Tearing down walls and ...","post_message":"Robert de Niro just said it ALL about Trump! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154327831686509","commenter_b":"If this candidate is the best the Republican Party has to offer - why vote? Hillary will win! Trump doesn't nothing but trash! What is he going to do for this country other than blame everyone else?","commenter_a":"Sorry Tom. But I like Trump. I like strong men. Who make strong decisions. And I thing he is what we need at this time.","post_message":"For Donald J. Trump, Christmas doesn't seem to be the season of peace"},{"comment_id":"10153112350927908","commenter_b":"That is no good, that is not acceptable.","commenter_a":"I'm afraid Netanyahu's alternative, as well as that of many Republicans, is to bomb Iran's possible weapons sites--not the solution I'm hoping for!!","post_message":""},{"comment_id":"10154995598416037","commenter_b":"Robert, have you heard of sanctuary cities? Do you know why thy are called that? If you are illegally here this is where you go. Now how many illegals do you think are in California? Hello","commenter_a":"Good luck to him. Would be nice to see Democrats lose those 55 electoral votes every election. Half the people there aren't even American anyways.","post_message":"“We believe the country is like a Titanic, and the election of Donald J. Trump is the equivalent of the Titanic hitting the iceberg.”"},{"comment_id":"1091369127608289","commenter_b":"Tired of hearing about this stupid bitch too","commenter_a":"I don't care what she does.....she is the black Jane Fonda as far as I am concerned.","post_message":"Beyonce is backtracking from her racist Super Bowl 50 performance about as quickly as she can... now see who's being blamed for one of the most despicable aspects of her performance. This seems WAY too coincidental... Beyonce needs to step up and take responsibility."}]
