[{"comment_id":"535259990005462","commenter_b":"I wish Dr Carson was our nominee! However, Trump is and he must win or our nation is doomed. Clinton has proven to be the most corrupted, evil lying politician ever!! It's beyond me that anyone in their right mind could support her!","commenter_a":"How can you defend this man?","post_message":"It's a shame that The New York Times and the media are on an all out witch hunt against Donald J. Trump. The media should be fair and balanced, not biased."},{"comment_id":"1334233936596633","commenter_b":"The wall goes up. No more cowardly Muslims in the White House. We've had enough","commenter_a":"Go ahead and lock up the nomination. It's irrelevant. There isn't going to be a Republican in the White House next year.","post_message":"Today's vote could decide whether Donald J. Trump will lock up the nomination outright."},{"comment_id":"10154406846618734","commenter_b":"Really lady get over yourself. All you want is Money!!","commenter_a":"This is where feminism has brought womyn: seeing themselves victimhood is the highest calling of all.","post_message":"Do you think the claim is too much? Or just right?"},{"comment_id":"10156378664500725","commenter_b":"I have an idea. JDLTI. Just don't let them in. When you become President close all immigration for up to five years. We can take care of the terrorists in the Middle East while weeding them out here in the U.S.","commenter_a":"E","post_message":"I keep saying it. When the President of the United States of America, Barack Obama -  will not issue the words RADICAL ISLAMIC TERRORISM - the problem will NOT BE SOLVED!"},{"comment_id":"848307568693153","commenter_b":"GO stuff your FAT ,UGLY, RACIST face!","commenter_a":"What IF I ONLY HATE \\bOBAMA'S \"WHITE\" Half???","post_message":"If you hate Oprah does that make you a racist..."},{"comment_id":"10153246182423188","commenter_b":"She allowed her cheeks to hang out. This woman POSTED this video to YouTube. They clearly received the attention that they were seeking.","commenter_a":"Michael shouldn't have posted a pic that shows a woman's butt cheeks hanging out, @username. I'm surprised as a Christian you condone this.","post_message":"My wife and I are laying in bed talking about this non sense with Michael Bublé and she pulled up something a girlfriend sent to her.  Holy cow!  Some people are just Shoot milk through your nose funny without trying.  Look out.  What follows makes Michael's butt cheek photo look like a bible pic.  Excuse the title on youtube.  No profanity on vid.  @webpagelink"},{"comment_id":"10155813559759778","commenter_b":"Very heartbreaking and moving commercial...but unfortunately there still has to be something done about ILLEGAL immigrants coming into America. The Mexican President Enrique Pe Nieto could do something to help make their country better so the Mexican people would want to stay in their own country. I am sure he doesn't mind allowing the criminals to come here and apparently he doesn't care about the poor either, but something has to be done to protect our America.","commenter_a":"I loved it. Saw the ending...Touching.","post_message":"Budweiser isn't the only company to tackle the politically heavy topic of immigration in their Super Bowl commercial this year."}]
