[{"comment_id":"1147833905269371","commenter_b":"No, thickhead, enough of YOU is enough!!","commenter_a":"@username if the guns are taken away from good citizens they will be more killing than you every seen before my my where is your common sence!!!!!","post_message":"@webpagelink"},{"comment_id":"10155169202635231","commenter_b":"You're rare Theresa -- women don't think this way.","commenter_a":"Wow, he couldn't just get married to a good woman???? He could've gotten it for the rest of his life...but that's how crazy some men are. Go figure!!!","post_message":"Warren Sapp paid some $600 for oral sex, which he allegedly taped using his cellphone camera."},{"comment_id":"10154209676831336","commenter_b":"Carolyn Ann Banet shut up hoe","commenter_a":"Women are dangerous, no matter what species!","post_message":"Yikes!"},{"comment_id":"441930219322192","commenter_b":"Jail this pervert!","commenter_a":"Creep","post_message":"Conservatives are bending over backwards trying to defend the Duggars. Gross!"},{"comment_id":"1738986173036273","commenter_b":"@username : go away Trump or Bernie lover . Vote for Hillary","commenter_a":"Love Her! @username will be our next President of the United States of America!","post_message":"\"Clinton is a master at identifying problems and coming up with plans to solve them. There is seemingly no crisis too small to escape her attention, no subject outside her wheelhouse.\""},{"comment_id":"1252245104845317","commenter_b":"So sad, the Hispanic ladies had more class then the racist. Also sad no one had the courage to stand up to her!!","commenter_a":"That's messed up. She forgot that U.S has the freedom of language","post_message":"This racist woman went off on two Hispanic shoppers with a racist rant and no one did anything to stop her. More on this story here: @webpagelink"},{"comment_id":"932489970229038","commenter_b":"Nothing compares to what Bill Clinton did as Gov of Ark, and in the White House with Monika Lewinsky and other women..same with John F Kennedy, with Marilyn Monroe, and mistress of a Gang boss, and nude swimming parties. They both dis honored our White House...where was the media..and why were they voted in twice...","commenter_a":"I agree! Mr. Trump has changed in the past 11 years but Hillary Clinton has not except for the worst!!","post_message":"Dr. Robert Jeffress, Senior Pastor of the First Baptist Church in Dallas, Texas, stated that he still supports Donald J. Trump, despite the GOP nominee's controversial 2005 comments."}]
