[{"comment_id":"906680809367341","commenter_b":"She is trailer park trash.","commenter_a":"Michelle has no class, she doesn't even look like a First Lady. In fact, she's not even First Lady material.","post_message":"This is EPIC"},{"comment_id":"10157682940820389","commenter_b":"Such bullcrap that she can get away with this!!!","commenter_a":"OF COURSE THEY DID....TWO OF AMERICA'S BIGGEST MISTAKES... WAKE UP AMERICA...VOTE DONALD TRUMP .....","post_message":""},{"comment_id":"10152979893954753","commenter_b":"fuck you bitch","commenter_a":"No pay","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"10154306058514062","commenter_b":"Women, always wear pants/skirts that have pockets. if they steal your purse and your gun is in it, you're screwed.","commenter_a":"And that's why I always have the Grim Ripper with me!!!","post_message":"So scary..."},{"comment_id":"913575248773260","commenter_b":"Hillery is a known lesbian predator get it out and end her run to destroy this nation","commenter_a":"God i feel sorry for her","post_message":"Sex slave survivor Cathy Obrien swears that Hillary Clinton raped her when she was a child in Arkansas @webpagelink"},{"comment_id":"1337467809657543","commenter_b":"Actually...now.women will do time for....oh what's that word.... MURDER! Hahahahhahahaha","commenter_a":"Abortion happens. Now if it happens in a sterile clinic with a doctor or in a back alley with a coat hanger, it's still going to happen.","post_message":"The so-called \"heartbeat bill\" approved Tuesday would result in what would be one of the most stringent abortion restrictions in America."},{"comment_id":"10153719523799138","commenter_b":"What is,wrong w people???? If they have,an \"urge\" can't they have,any self control! !! Haven't people heard of video surveillance? ? Makes me wonder what else they've done that hasn't been detected...","commenter_a":"It's too bad that the media gets a hold of these stories and everybody believes them. That's not to say it didn't happen. Some children do lie about these things.","post_message":"The teaching assistant has been taken into police custody and is no longer an employee at St. Louis Park Public Schools."}]
