[{"comment_id":"10154306039388812","commenter_b":"How so @username, what was the childish remark. Do tell...","commenter_a":"This is awesome! Every child should have someone to tell them they're loved and accepted. Growing up is hard enough I can't imagine what transgender teens must go through everyday and I'm glad there are people willing to stand up for them and do the right thing.","post_message":"After an uphill battle involving protests and a petition, Wisconsin school will allow transgender high school student to run for Prom King: @webpagelink"},{"comment_id":"10153269221051051","commenter_b":"When she gets her own country, she can make any law she wants and decide when she'll break it.","commenter_a":"Gays are getting too demanding. If she will not marry those faggats, then they should go some place else.","post_message":"This court clerk refuses to issue same-sex marriage licenses – even when her decision lands her in legal trouble. Do you respect her dedication to her beliefs?"},{"comment_id":"10156057396095551","commenter_b":"Everybody knew that! No way does a great 5 yr old know anything about imigration. This was a liberal setup!","commenter_a":"The Mexicans played a dirty trick on On the Pope. Perhaps they will be rewarded in hell.","post_message":"I KNEW there was something fishy about this..."},{"comment_id":"682213861917317","commenter_b":"We continue to deport illegals but tgey come back. We need trumps wall","commenter_a":"All traitors MUST be put into jails, All illegals MUST be deported!!! Vote Trump and Reject the evil socialism of crooked Hillary as well as insane and hypocritical Bernie! Think of North Korea and Venezuela! \"The problem with socialism is that eventually you run out of other people's money\" - Margaret Thatcher","post_message":"The protesters in New Mexico were thugs who were flying the Mexican flag. The rally inside was big and beautiful, but outside, criminals!"},{"comment_id":"1243101862382258","commenter_b":"Wolves in sheep's clothing!!!!!","commenter_a":"Those of you who comment on this in a judgmental way will face your own judgment because of it. God knows the hearts of everyone. Let's walk with Christ and see the beauty in this video and resist the urge of the Evil One to tear it apart and make it less than what it is. It seems to me that Mr Trump is seeking divine guidance through strong Christian leaders. He is very wise and God will make him wiser for this. (Please read this thread...I have been led to the truth by my brothers and sisters in Christ Jesus. Amen!). May God bless them all.","post_message":""},{"comment_id":"847817905266758","commenter_b":"You people are a bunch of whack jobs!","commenter_a":"Any kind of animal","post_message":"AWFUL: A family who routinely fed a mother duck and her 11 ducklings said they watched in horror as a landscaper intentionally mowed them down:"},{"comment_id":"942704895828117","commenter_b":"Wow your a cold heart bitch With a small dick","commenter_a":"A druggie died of an overdose with assistance from his mom and grandmother - unfortunately only he died and not all of them.","post_message":"The teen's mother and her mother face multiple charges."}]
