[{"comment_id":"1470713222988421","commenter_b":"Typical British woman. No morals, no values.","commenter_a":"Is this worthy of a news item? I think not.","post_message":"She text him the picture weeks later after not seeing him again"},{"comment_id":"1057199377724507","commenter_b":"Sensing feminists being triggered","commenter_a":"What u gone do now @username??? Does Hillary still own y'all? Who y'all gone brain wash now ??? The swamp has been drained it's time for the real Americans to take back this united States we the people are apathetically sick of corruption!!!!","post_message":"Many people did not believe Donald J. Trump could win the election @webpagelink"},{"comment_id":"10154431289101523","commenter_b":"Can they deport you with him?","commenter_a":"Throw the books at them.........I'm calling for 10 yrs! Better yet deport them!!","post_message":"Guns, body armor and marijuana located during a traffic stop in Germantown."},{"comment_id":"10153264316296336","commenter_b":"Civil liberties can cram it where the sun don't shine! Freedom of speech for ALL.","commenter_a":"How about this group goes f@$#s it self","post_message":"A civil liberties group says this United States Air Force general should be court-martialed for speaking about how God has guided his career."},{"comment_id":"1852101905022122","commenter_b":"trump is nasty","commenter_a":"I still can't vote for either of them...","post_message":"WATCH: Hillary Clinton and Donald J. Trump go head to head in the final presidential debate, live from Las Vegas."},{"comment_id":"1039851232779934","commenter_b":"Leave the poor girl along. ..she's retarded","commenter_a":"No. She has been lied about for years!! Republicans can't stand a strong woman with brains!! Gotta tear them down. They prefer mindless, brainless twits like Michelle Bachman and Sarah Palin.","post_message":"Answer with a simple 'yes' or 'no': Is Hillary Clinton corrupt?"},{"comment_id":"10153748697767629","commenter_b":"If white women didn't flunk every black and Latino out we might have the blacks in college and in education that we need.","commenter_a":"When are we going to start making teachers uncomfortable and scared? its a white, more privileged profession with more time off. Especially at the college level. Shouldn't they fear being shot in the head too? Thankfully we are getting guns on college campuses so that all authority can be radically challenged with an in your face confrontation. The Russian left has always known the power of confronting authority so I'm glad America is catching up. War and Revolution baby! Just like the founding fathers intended.","post_message":"This is beautiful."}]
