[{"comment_id":"10153344147357439","commenter_b":"Lol is that where Muslims come from? Wow didn't know that!","commenter_a":"Send them back to Egypt.","post_message":"DC Area Professor To Catholic University: Too Many Crosses On Campus For Muslim Students To Pray @webpagelink Anywhere American law and Islamic law conflict, it's American law the inevitably has to give way. These demands for special accommodation are everywhere. Hertz, Heinz, Costco, IKEA, Target, Wal-mart, Disneyland, McDonalds and hundreds of others have all been in the cross-hairs. Islamic demands and the ensuing lawsuits in order to impose sharia...."},{"comment_id":"1744094332472035","commenter_b":"You fix it by following the laws already on the books and securing the borders. Start deporting anyone here illegally and fine businesses that are hiring them. When they see there's no work for them and we are serious about catching and deporting them most will pick up and leave.","commenter_a":"That's a real question but few are willing to answer without being labeled a bigot or racist. The immigration problem is very real and here is a clear example of how the illegal community drains resources for American citizens.","post_message":"During a heated exchange, Tucker Carlson asked immigration activist Jose Antonio Vargas if it’s fair for illegal immigrants to take coveted scholarships from American citizens. @webpagelink"},{"comment_id":"10153945249138690","commenter_b":"The Muslims massacring Christians citizens","commenter_a":"She is a Christian with big heart offering kindness and help to the Muslims so would Muslims do the same things to Christians ?","post_message":"When refugees arrive at the Greece-Macedonia border, the smiling face that greets them is that of Gabriela Andreevska. Watch more Al Jazeera Shorts - @webpagelink"},{"comment_id":"10154061060138433","commenter_b":"@username -that's the point. Many have NOT committed a crime or have been overcharged to force a plea because poor people can't afford bail, or to wait in jail for a trial and to leave their kids or their job..","commenter_a":"They seem well paid to me. Especially when there's a glut of them.","post_message":"Did you see the Netflix series Making a Murderer? Remember Jerome Buting, one of the defense attorneys? PolitiFact Wisconsin recently checked his claim that Wisconsin pays criminal defense lawyers who represent the indigent $40 per hour, \"the lowest in the country.\" That rated a Mostly True."},{"comment_id":"10153697633816636","commenter_b":"@username females mature quicker than boys, starting periods as young as 9, some see that as start of womanhood, females have sexual hormones and crushes in early teens so YES it isn't any different... She does need locking up","commenter_a":"I think you mean that she raped the 13 year old boy on an almost daily basis. She is sex offender who groomed then raped her victim, if genders were swapped people would see this monster for what she is and see that the 13 year old is a victim.","post_message":"'I have chills because of this'"},{"comment_id":"10153862572524369","commenter_b":"I have pretty extensive vocabulary and definitely don't need to use slang so by all means generalize and assume that we all say it...it's sad people are really this stupid.","commenter_a":"If they want the racial slurs to go away, they need to stop saying them as well. It's a double standard.","post_message":"Student groups have complained for months of racial slurs and other slights on the overwhelmingly white campus. Now, more than two dozen players say they're staying on the bench until the university's president is removed due to his \"negligence toward marginalized students' experience.\""},{"comment_id":"879835912051831","commenter_b":"I wish her big mouth would go away ; what a disgusting woman","commenter_a":"A message for Rosie. It is one thing for people to think you ignorant and it is another for you to open your mouth and prove it.","post_message":"Tom Selleck is awesome!"}]
