[{"comment_id":"10153216213261717","commenter_b":"Skars the reason people are so upset is because the bitch is a fucking lesbian for god sakes","commenter_a":"caitlyn jenner may be transgender but she doesnt believe in same sex marriage. she isnt an insparation at all. shes a selfish bitch","post_message":"Caitlyn Jenner prays with fervently antigay preacher"},{"comment_id":"10153022390127217","commenter_b":"Stupid, sexy, popular flanders !","commenter_a":"@username 👍🏽","post_message":"Let's hear some noise for Okilly Dokilly"},{"comment_id":"10155678849387004","commenter_b":"GET SOROS- GET SOROS!~ FREE AMERICA!","commenter_a":"This shows you how STUPID people at Berkeley are...","post_message":"In the 1960s, leftists at UC Berkeley fought for their free speech. Now they use violence and mayhem to trample on the rights of others..."},{"comment_id":"533141560209757","commenter_b":"Brainwashed stupid women!!!!!!!","commenter_a":"Let them go back to the country they came from if they want to wear their Burkas","post_message":"This Muslim woman refused to remove her veil, then something awesome happened. Good. There's no room for fanatical Islamic culture in the US. Do you support a Burka ban?"},{"comment_id":"1083798354993969","commenter_b":"You're an ignorant cunt Rosie","commenter_a":"Sell yall anything and then yall prounce on it. He ain't sided with humility that's his only thing he can do to them white bois. As a black police officer he can't beatem, rough them up, shootem, killem like they do \"somebody's\" people. That's for sure a death sentence then.","post_message":"When a KKK member suffered a heat stroke at the hate rally in Columbia, a black police officer put aside his personal feelings and sided with humanity."},{"comment_id":"1158183760868319","commenter_b":"Ya cause your a pussy","commenter_a":"Thanks Delta & united Airlines for the great work. U got my business.","post_message":"Humane Society's president said Delta \"has set a great example.\" \"No airline should provide a get-away vehicle for the theft of Africa's wildlife by these killers.\""},{"comment_id":"869870296383645","commenter_b":"I got bad news my greatgranddad was a yankee from OH I;m from KY. I know the war was over states rights","commenter_a":"My family were Union all the way but I have no qualms about the Confederate flag.","post_message":"\"In a free society, offensive speech should not just be tolerated, its regular presence should be celebrated as a symbol of democratic health.\""}]
