[{"comment_id":"10155647671150354","commenter_b":"She is a racist and a total disgrace!!! She encouraged the thugs to destroy Baltimore; what a LUNATIC!!!","commenter_a":"She also believe that is disrespectful to ask a Liberal a real question and expect it answered with out making a quote that your question is disrespectful to there position. Attention Liberal Politicians: every aspect of your your public life, how you act, what you say and your political views are all fair game in the management of the public safety.","post_message":"What do you think? Was the reporter being rude?"},{"comment_id":"910779442445965","commenter_b":"YES THAT IS WHAT WE SPEAK. THE ILLEGALS CAN LEARN IF THEY HAVE A BRAIN OR FIGURE STUFF OUT FOR THEMSELVES. THEY CAME HERE NOW THEY CAN FOLLOW THE LAWS OR START Walking or swimming. either way learn or leave.","commenter_a":"Yes to english","post_message":"He wants to make this this official language of our country. People are up in arms. Do you think he's right?"},{"comment_id":"10154336325219062","commenter_b":"Bradley Darrell see above message..","commenter_a":"To suggest the Pope has a liberal agenda is just showing ignorance. Conservatives claiming the Pope is pro-gay, pro-abortion, anti-marriage, blah,blah. The Pope has never said he agrees with those things, he has said it's not his place to judge others who have that life style. Just like Jesus would do today. He loves everyone without reservation. Something sorely lacking in today's society.","post_message":"Pope Francis says addressing climate change `can no longer be left to a future generation'"},{"comment_id":"1019874124772308","commenter_b":"Not just Islam but all religions. Ban religions not humans","commenter_a":"Yes it is, and we need to remember what the Spanish Catholics did to the Native Americans, and what the \"Christian\" Protestands did to the \"Christian\" Quakers. Religion is not the issue here. It's hostility.","post_message":"Trump supporters should remember our OWN history before they foolishly suggest we should ban all Muslims from entering the country. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153403140121037","commenter_b":"If she looks like that at 65, I want some of what ever she got hahahahaha","commenter_a":"getting paid to be in the media daily ? yeah nervous about something","post_message":"Watch the full video: Katie Couric speaks with Vanity Fair writer Buzz Bissinger and stylist Jessica Diehl about #CaitlynJenner's groundbreaking cover story."},{"comment_id":"10154521519049726","commenter_b":"I'm not especially interested in Mexico paying for it - our wall and WE NEED TO GET IT DONE!","commenter_a":"Trump will not only get Mexico to pay for a wall but he will get them to see it's value to them and want it!","post_message":"From Pence's appearance on my show today — Pence all detailed how he and Trump will make Mexico pay for the border wall:"},{"comment_id":"10153874849832439","commenter_b":"I heard her spine landed on top of police car. Best news I heard today! Rot in hell psychotic bitch!","commenter_a":"Can she blow herself up again, with all her brethren with her?","post_message":"Hmmm, is she making the (Eiffel tower) peace sign? Islam is peace, brother. The good news is -- she's dead. The bad news is Obama wants to bring these 'widows' and 'children' like the refugee Boston bombers to our shores. This savage tried to lure police within detonation range by crying \"help me, help me\" before blowing herself up."}]
