[{"comment_id":"10154713029439411","commenter_b":"Good on her. If only she had a shot gun or military rifle she may have got the others too.","commenter_a":"Looks good on him and them. These three losers garner no sympathy from me. Karma has been served.","post_message":"They picked the wrong house"},{"comment_id":"10156732658910492","commenter_b":"What is it with older ladies and dislike of bike lanes? @webpagelink","commenter_a":"These ladies probably shouldn't be driving anyway","post_message":"\"New York City is not Amsterdam, it never will be Amsterdam, and that's all there is to it.\""},{"comment_id":"10153973402646350","commenter_b":"Damn her! So bloody uncooperative.","commenter_a":"Every fortnight I clean out the strainers, wipe under the rubber and run an empty dishwasher on hot with vinegar, bicarbonate and eucalyptus oil. Same for my washing machine.","post_message":"The answer is"},{"comment_id":"898024070290648","commenter_b":"Scum","commenter_a":"What an ass","post_message":"Never, really?! Last night's theater shooting was a preventable tragedy. Louisiana has the weakest gun laws in the country, and one of the highest rates of gun violence. Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152594286750779","commenter_b":"I hope she never gets a boob job","commenter_a":"Did she trademark small breasts as well?","post_message":"If you want to \"Party Like It's 1989\" to \"This Sick Beat,\" you better ask Taylor Swift's permission first. The pop star has trademarked those phrases – along with \"'Cause We Never Go Out of Style,\" \"Could Show You Incredible Things\" and \"Nice to Meet You, Where You Been?\" – with the U.S. government."},{"comment_id":"590301711160408","commenter_b":"She looks to be about 100 years old in this photo, Ban her ugly mug from FB","commenter_a":"When she becomes a licensed nutritionist then maybe somebody might listen to her. Her plan not only sucks but it is no where near the enough food. A child needs more than 200 calories for lunch.","post_message":"What Michelle Obama is banning now is just plain unacceptable. The American people are tired and finally fighting back. Do you agree Michelle Obama should mind her own business?"},{"comment_id":"10153124003659312","commenter_b":"Did you forget there also was Barry Bonds and others? And yes, there was McGuire! This is old and it happened over 10 yrs ago! Move On!","commenter_a":"Handcuff needs to be in handcuffs for picking the Patriots cheaters! Lol","post_message":"This morning, Handcuff, one of several dogs rescued recently by local law enforcement, made his St. Louis television debut with Rene Knott, to make his pick of a winner in today's Super Bowl. See who he picked and then call Stray Rescue to inquire about adopting him. (314) 771-6121 @webpagelink"}]
