[{"comment_id":"10153503601036770","commenter_b":"BLM? not at all! worthless savage racists. if they think that their worthless lives matter then go into the dangerous crime ridden ghettos created by blacks and convince them to stop killing each other. I would rather give black thugs target practice so that they don't hit innocent bystanders when trying to shoot each other.","commenter_a":"SCREW BLM...","post_message":"A controversy has erupted at Dartmouth College after a pro-police display was torn down by Black Lives Matter activists, who denounced it for memorializing the 'perpetrators' of 'state violence.'"},{"comment_id":"858336867535069","commenter_b":"Good for her Muslims need to go back to their own country and stay there. Stop pushing their laws on us. And stop giving into them","commenter_a":"move go back to your country","post_message":"#Sharia comes to Texas?   Not this time!"},{"comment_id":"10153138669086378","commenter_b":"She gets off on it","commenter_a":"Weird","post_message":"BREASTFEEDING FRIEND'S SON: A photo of a Bala Cynwyd woman breastfeeding not only her own son, but her friend's son, is generating controversy.  See more about her decision, and let us know what YOU think in the comments below:"},{"comment_id":"1112252572119545","commenter_b":"We have BOTH problems: 1. too many guns, too easily had, by too many people. 2. We don't take care of people who are mentally ill. Rather (thanks to Reagan who closed the public hospitals) we either put them on the street, or we bake them first in prison, and *then* put them on the street. Europe takes care of both of these problems much better than we do. That said, the statistics are clear, countries that have more guns, have more gun-related deaths and injuries. Guns within easy reach are far more likely to do harm than good.","commenter_a":"Today another mass shooting of children by a mad man which took place at almost the same time Republican mad men held unethical hearings about the falsehoods that Planned Parenthood are killing children for profit. If the Republicans wanted to investigate a terrorist organization that is solely responsible for the verifiable mass death and carnage of America's children, and other innocent lives, they'd be investigating the National Rifle Association and its members. It's time we realize the NRA and Republican cohorts are terrorist organizations and the Democrats are as guilty and cowardly to do anything to reign in this insanity, as they too are as beholden to NRA dollars as the Republicans. If these were Muslims murdering our children at this rate instead of deranged Caucasian white men, who make up the majority of the Republican voters, all of the Mosques would've been leveled and Muslims would have been rounded ...","post_message":"Another day in America."},{"comment_id":"10153606211671509","commenter_b":"Gee I wonder where he gets his behavior from ?","commenter_a":"Good job mama :) the world needs more like u","post_message":"What do you think of this mom's actions? Taking matters into her own hands, her son got a heavy dose of discipline on live TV: @webpagelink"},{"comment_id":"10153237283580329","commenter_b":"Kurt Russell","commenter_a":"Jared padalecki from supernaturals","post_message":"Keanu Reeves or Arnold Schwarzenegger?"},{"comment_id":"10152708719122217","commenter_b":"If she was prettier she wouldn't have been charged.","commenter_a":"Who is the complainant? If it was witnessed in person fine. However if the person offended viewed the image on google, surely they are to blame for publishing the image?!","post_message":"She was charged after flashing a Google Street View car"}]
