[{"comment_id":"10153763731329170","commenter_b":"Of course Obama and the Democrats will send them to Texas. That conservative state must stand their ground against the onslaught of terror on America.","commenter_a":"They are stuffing them into Texas in an effort to change us from conservative to liberal","post_message":"This shocking map shows exactly where Islamic extremism is festering within the United States... Has this scourge reached your community yet?"},{"comment_id":"10157043455730206","commenter_b":"May God keep you stronger, Celine","commenter_a":"So sorry for your loss!","post_message":"Celine's brother Daniel had been battling cancer of the the throat, tongue and brain."},{"comment_id":"1980759552150599","commenter_b":"Or maybe he was trying to check on the deer...i'd kick the deer too if it attacked me. Get over yourselves people","commenter_a":"Looks to me that he was scared and didn't know where he was going....not \"coming back to attack the driver\". LOL! Poor deer!","post_message":"STARTLING: Video shows a deer come back and attack the driver who struck it. But the driver fought back. It happened in Howell, New Jersey. Details: @webpagelink"},{"comment_id":"1321956137825394","commenter_b":"Great, I'm off to Havana tomorrow!","commenter_a":"Cahl Denni Sharknado?","post_message":"Every single one of those black dots is a 2-meter-long shark."},{"comment_id":"1220005224782920","commenter_b":"She was a fucking stripper! Yeah, real class!!!","commenter_a":"Yes, what a wonderful change. And so does Mellania - what a classy First Lady we have!","post_message":"ClashDaily.com"},{"comment_id":"10153595971197016","commenter_b":"And women are going to vote for this lady killer","commenter_a":"Sigh. If this big dope gets elected even the people who elected him will be bitterly deceived and betrayed and it won't take long.","post_message":"Republican presidential nominee Donald Trump on Sunday morning described the numerous female employees at Fox News who accused Roger Ailes of sexual harassment in the workplace as \"complaining\" and explained how that makes him \"sad\" because really the company's top executive actually \"helped\" \"some of those women\" and he's a \"very good person\" and a close personal friend. WTF."},{"comment_id":"10154807734390115","commenter_b":"Marcia, Dont insult the neanderthals by comparing them to prolifers. 😂","commenter_a":"Wow, some one just said men cause pregnancy! Considering it take two haploid cells to make a child.","post_message":"LIVE: Planned Parenthood supporters hold a rally outside the St. Paul, Minnesota, headquarters alongside Planned Parenthood protesters."}]
