[{"comment_id":"598047807050178","commenter_b":"@webpagelink/ maybe you should wake up","commenter_a":"This action taken against this marine n my opinion is shameful n should b a wake up call 2 the AMERICAN people !!!! WAKE UP AMERICA !!!","post_message":"Marine Arrested For Saying THIS About Obama [VIDEO]"},{"comment_id":"10152796636027217","commenter_b":"where are the women","commenter_a":"Check their passports and visas ...","post_message":""},{"comment_id":"1083445358398358","commenter_b":"She needs to give up the madness. She isn't accomplishing anything. Well..... except getting more votes for Trump.","commenter_a":"She is foul mouth pig, has not been funny in years and the sooner she move to Canada the better...","post_message":"WOW...Rosie just outdid herself. Do you agree with Trump?"},{"comment_id":"10153533383913145","commenter_b":"Ur an idiot. I blame your parents for that!","commenter_a":"I blame Obama for this guy.","post_message":"A Kissimmee doctor accused of sexually battering a patient could reopen his practice today. If he does so, it will be with some restrictions. A live report coming up at 7 a.m. on Eyewitness News This Morning on TV27 WRDQ."},{"comment_id":"235119820270004","commenter_b":"Haaaaaaaa!!!!! Stupid, stupid lady.","commenter_a":"Too bad crybabies, he is your president. And I hated Obama but I am a grown-up and lived with him and his ugly family for 8 years. So grow up and shut up","post_message":"Trump has now set a record for the most hated president."},{"comment_id":"1128228853905897","commenter_b":"EXECUTE the QUEER ----NOW !!before this poor girl is DEAD from being RAPED by this SUBHUMAN PR*CK !!!","commenter_a":"Discusting pervert","post_message":"DISGUSTING! Muslim Migrant Men Pose with Pre-Teen Non-Muslim Girlfriends on Social Media! Obama wants these perverts in your neighborhood!"},{"comment_id":"10154674776698010","commenter_b":"I've met a few bitches in my life Derek's mom and @username girl were both on that list.","commenter_a":"Pence basically saying hey I'm a rich white male never get stopped by police why should I care .","post_message":"Gov. Mike Pence spoke about police killings and the need for \"law and order\" at the debate. He ended by asking his opponent, \"Senator, please, enough of this seeking every opportunity to demean law enforcement.\" More debate updates: @webpagelink"}]
