[{"comment_id":"784296501703530","commenter_b":"Gross! It smells like Hitler up in this bitch.","commenter_a":"Isn't this another thing he can be impeached for?","post_message":"BREAKING NEWS...."},{"comment_id":"10153266948641336","commenter_b":"Imagine that, another black defending them. WTG Angela, you thug.","commenter_a":"Stupid. So, they support arson, robbing and looting and destroying a city?","post_message":"Beyoncé and JAY Z reportedly paid Baltimore and Ferguson protesters' bail money, an activist claims."},{"comment_id":"10153041474101051","commenter_b":"Take away the baby and tie her up so she can see how that feels .","commenter_a":"I'm assuming she gave the baby dog food.","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"10153507396631323","commenter_b":"She wears real fur....therefore she's a selfish bitch with no regard for the lives of others. I've never liked her. Seems I'm not alone in that here.","commenter_a":"I really couldn't care less about her, she's contributed nothing positive to this world.","post_message":"Why do newspapers hate Kate Moss so much?"},{"comment_id":"1046596102028067","commenter_b":"I hope you'll be the pregnant one cause you're a bitch >:(","commenter_a":"Lol wut @username","post_message":"No women required."},{"comment_id":"698707680267099","commenter_b":"'@username ....and dumbasses vote for Hillary","commenter_a":"Liars will always call other people liars to hide the fact they are liars....haha. Seriously, he is a POS and he is nothing but a racist, a liar, a cheat, a thief, and I could go on. He is a danger to America....and if he can't run his casinos, his own campaign, think about what he will do to America. He will run it into the ground. It is pretty scary to think if he gets in the Whitehouse, he will insult other countries, and possibly be the first president to incite a war because of his mouth.","post_message":"'Hillary Clinton  may be the most corrupt person ever to seek the presidency of the United States,' Donald J. Trump  said."},{"comment_id":"10153629866881336","commenter_b":"She is pathetic and out of control.","commenter_a":"Miley is a marginally talented girl with very little respect for herself. Billy Ray should be ashamed.","post_message":"What did you think of Miley Cyrus' barely-there ensemble?"}]
