[{"comment_id":"1713686355585143","commenter_b":"Stick it bitch.","commenter_a":"They came into office with 1 are 3 million they now have 12 to 20 more million...Don't tell me she's not getting paid...","post_message":"Are you... KIDDING ME!? So sick of Barack Obama & Michelle Obama..."},{"comment_id":"1125525780793011","commenter_b":"Sick people, and Michelle is out rapping with them, no class in the White House!","commenter_a":"YOUR a Dickhead! You should be arrested","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink Will Attorney General Loretta Lynch target this \"hate speech?\""},{"comment_id":"10152627692760950","commenter_b":"cathie stickna in your butt","commenter_a":"weird President","post_message":"President Barack Obama makes a few funny faces and uses a selfie stick in a new BuzzFeed video — and some politicians aren't happy about it."},{"comment_id":"10157311512285294","commenter_b":"So... she's not a plagiariser, she's a liar. Guess her and Hillary have something in common after all.","commenter_a":"But didn't Melania say she had no help? Now this? I'm confused I call bull on this one","post_message":"\"I asked to put out this statement because I did not like seeing the way this was distracting from Mr. Trump's historic campaign for president and Melania's beautiful message and presentation.\""},{"comment_id":"10152978013416615","commenter_b":"She's an evil monster.","commenter_a":"no way she a good mother she killed the boys and watched them die sje isn't a mother she is a monster","post_message":"After all this time, Susan Smith decides to talk about what happened the day she drove into a lake and killed her own sons."},{"comment_id":"10158365855655500","commenter_b":"RIP Carrie Fisher.","commenter_a":"Who cares don't watch, pops that's four words.","post_message":"Fashion, Beats and Bling are WFLA Lila Gross picks. What are your three words to describe the Oscars?"},{"comment_id":"10153283660836770","commenter_b":"This woman is an utter moron! There's more people watching the GOP debate tonight than all the democratic debates!","commenter_a":"Freud would be laughing at DWS totally projecting on the GOP.....exactly what she has been doing .....burying dem debates on Saturday nights!","post_message":"Democratic National Committee (DNC) Chairwoman Debbie Wasserman Schultz tweeted Saturday night suggesting the Republican Party was “trying to hide” a debate by scheduling it on the same weekend as the Super Bowl."}]
