[{"comment_id":"1259466750760461","commenter_b":"@username=republitard shitbag","commenter_a":"Really? Last I checked, this is still Obama's America...... Next year you can call it Trump's but for now it's ALL Obama......","post_message":"Welcome to Donald Trump’s America."},{"comment_id":"1117955828258960","commenter_b":"Smart girl","commenter_a":"Why doesn't he acknowledge Tiffany??--- his daughter with Marla??","post_message":"Donald J. Trump has asked the White House if his adult children can have top-secret security clearances."},{"comment_id":"1114818335281084","commenter_b":"Go, Hillary! #I'mWithHer","commenter_a":"Democrats who support Hillary have the same mental disconnect as Republicans who deny climate change","post_message":"Sanders was shelling out more than Clinton on Nevada airwaves just a week ago."},{"comment_id":"10153523768927293","commenter_b":"Thank you!","commenter_a":"What do you mean by white? there are white latinos i.e. latinos of European origin, so it isnt about race? pigment and having a tan or lack of deosnt define a race....cleopatra, moses, werent caucasion? what were they then? most experts say caucasion includes indians and that middle eastern are essentially white - although some can be mixed race .. so what exaclty do you mean and why do you care so much? We could find examples of many blacks playing white characters - very common in shakespeare...so keep your racial obsession and race baiting to yourselves please WP!!!","post_message":"From “West Side Story” to “The Birth of a Nation,” watch 13 times that a white actor portrayed a non-white character on the big screen."},{"comment_id":"389873387803923","commenter_b":"Really professional. I do (NOT) want her in the White House.","commenter_a":"I think she committed political suicide.","post_message":"Did you find this picture offensive or irresponsible for someone in her position?"},{"comment_id":"1153087074711321","commenter_b":"we need more sex workers to solve crimes the cops can't","commenter_a":"They should give her an award. She has saved countless lives.","post_message":"Police found what they described as a \"kill kit\" in the trunk of Falls' car — including handcuffs, several long knives, a box cutter, two axes, a machete, a sledgehammer, a bulletproof vest, another gun, shovels, a rubber tub large enough to hold an adult, and bleach and other cleaning supplies."},{"comment_id":"10154223180398984","commenter_b":"Go get a life lady","commenter_a":"Sounds like Trump paying someone else to do his DIRTY work. Why not talk about all the mistresses of Trump. It must be the big bucks from Trump.","post_message":"Wow, I didn't expect Anonymous to be the next one to come after Ted Cruz, and the hackers are claiming something BIG..."}]
