[{"comment_id":"1392423634112580","commenter_b":"MESSAGE TO DONALD TRUMP AND TO THOSE WHO VOTED FOR: THE DEVIL IS AT HOME. EVERYONE MUST PROTECT HIS RIGHT BY LAW. MAKES YOU QUESTION WHY MADE THIS MILLONARY HUMAN BEING MADE OF FINITO DUST? THANK YOU TO THESE COUNTRIES. IN INDIA HAS 16 BUSINESSES, ARAB EMIRATES 13, CANADA 12, CHINA 9, INDONESIA 8, PANAMA 8, SAUDI ARABIA 8, SCOTLAND 7, AZERBAIYAN 5, BRASIL 4, IRELAND 4, ISRAEL 4, CATAR 4, FRENCH ANTILLES 2, SOUTH AFRICA 2, TURKEY 2 URUGUAY 2, BERMUDA ISLANDS 2. AND CASINO IS ONLY YOUR MASK. HOW EASY IS TOMB TO THE GOLIAT. AND IF IT CONDEMNS CUBA? EVERYONE CONDEMNS THEM; UNTIL WHERE THIS DONALD HITLER ADOLF TRUMP DICTATOR HAS ARRIVED. THE CURRENT MOMENT IS OF ABRUMING INTEREST FOR ALL REPUBLICANISMS THAT OCCUPY POSITIONS OF CONFIDENCE, THE REPUBLICANISMS HAVE CHOSEN THE MOST VIOLENT MAN WHO HAD ALREADY HAD SINCE THE FOUNDATION OF THE UNITED STATES OF ...","commenter_a":"So what happens now?? Castro brother takes over???same crap or the people change this?","post_message":"\"Everybody's been partying, basically, all night long.\" Earlier this morning on \"FOX & Friends Weekend,\" Phil Keating gave us a look at the pre-dawn celebrations occurring in Miami, Florida, in response to Fidel Castro's death. @webpagelink"},{"comment_id":"1776377852617481","commenter_b":"Looks like he's winning. You're probably going to need to build a wall to keep us out.","commenter_a":"They're going to be the ones building a wall!","post_message":"LOL"},{"comment_id":"10156259154010354","commenter_b":"Well, she won't have to worry so much about those tax breaks she was looking for in America. Now she has not reason to stay here.","commenter_a":"You hate America and Republicans, well, that's fine, we won't bother to see your movies.","post_message":"The America hater's new movie is hemorrhaging cash..."},{"comment_id":"10153221680277217","commenter_b":"@username: Why do Muslim women feel desperate?","commenter_a":"So, are Muslim women ALLOWED to choose to be child free?? Not being sarcastic, it's a real question. This meme seems misleading. By the way, I think ALL women should be allowed to choose, and I think people who don't want kids shouldn't have them. However, everything I've ever read suggests this isn't an option for Muslim women (as well as in some other religions). Would like input on the realities.","post_message":"\"Don't get me wrong, I love children - just as long as they aren't mine\" #100Women"},{"comment_id":"788288661319908","commenter_b":"Why is it that all of Trump's picks sound like great material for an Onion article?","commenter_a":"Sickening! The u.s.a. Is about to become an embarrassment","post_message":"Every single appointment is scarier and scarier."},{"comment_id":"484808285062410","commenter_b":"Illegals are actually working for money other than the \"Americans\" begging for money on a corner","commenter_a":"I bet he had a taster for it too. Give away our jobs, let illegals in, give them government money, they never earned, and let the American people suffer. What a great President.","post_message":"President Barack Obama drinks filtered water in Flint, Michigan during a briefing on the ongoing water crisis."},{"comment_id":"1201515593201525","commenter_b":"Sad as it is. As often as this stuff happens and these woman still don't learn","commenter_a":"Update she was found dead and the man who did it is in custody. ;( RIP>","post_message":"UPDATE: Human remains found in a recycling bin have been tentatively identified as the missing Renton mother, Seattle police said. A suspect was arrested in Snohomish County. DETAILS >> kiro.tv/Renton-Mother"}]
