[{"comment_id":"10153459242386409","commenter_b":"That will teach him to open his big Mouth !!","commenter_a":"This is ridiculous","post_message":"A murderer serving three life terms for killing three people saw two more decades added to his sentence after a Washington State parole board considering his request for early release felt his crimes called for a harsher punishment."},{"comment_id":"10152879384712894","commenter_b":"She's stupid what more do you expect","commenter_a":"This heifer is trying to get a job...nonsense!!!","post_message":"Raven-Symone Doesn’t Think Harriet Tubman Should Be on the $20 Bill [Video]"},{"comment_id":"10154757833186037","commenter_b":"What in the world is a 15 year old doing out at 4:00 a.m.? Oh and BTW, black lives don't matter to black thug killers!","commenter_a":"Sry to hear this","post_message":"Trinity Gay, the 15-year-old daughter of Olympic sprinter Tyson Gay, has been fatally shot."},{"comment_id":"10154405981987300","commenter_b":"But they're still ten times better than ungrateful immigrants from African hell holes!","commenter_a":"They have everything covered. Police union, the system, their own partners that lie to protect themselves, the idiot that post all over the internet \"back the blue\", they get a free meal because if they don't, they'll make a tantrum and call the police and the news, etc, etc, etc. A simple war veteran (which, to me, has more respect that this parasites of society), don't get much back up when they get in trouble. Of course I'm talking about the bad cops. Because their is bad cops, right?","post_message":"“It’s too emotional to see your baby caught up in something like this.”"},{"comment_id":"10153771879894714","commenter_b":"@username shouldn't of made it seem like she gets to walk away from killing someone when they wrote the sentence with the link attached.","commenter_a":"but if Caitlyn Jenner wasn't famous then she would be treated like everyone else and serve jail time.","post_message":"Caitlyn Jenner will not face criminal charges in the February crash that resulted in the death of another driver."},{"comment_id":"10154596744362439","commenter_b":"Shoot that prick.","commenter_a":"so WE GIVE UP ON YOU BASTARD.","post_message":"That's why Europeans have to give up on the EU, if they hope to survive."},{"comment_id":"1391779917508701","commenter_b":"lol white girl troll","commenter_a":"The confederate flag, rebel flag doesn't stand for slavery nor against blacks. But it's OK for them to tote around black panther crap which is known as a black supremacy group?? Get a life and find something meaningful and real to whine about.","post_message":"The House has voted to ban the display of the Confederate flag on flagpoles at Veterans Administration cemeteries."}]
