[{"comment_id":"1792151467673200","commenter_b":"Right a true nasty woman!","commenter_a":"The only \"educational\" facet in Rosie is her nastiness! Period.","post_message":"Rosie O'Donnell says she posted a tweet questioning whether Donald Trump's 10-year-old son is autistic because she found it \"educational.\""},{"comment_id":"539015142953445","commenter_b":"Scum of the earth all of them! !!","commenter_a":"But they're a Religion of Peace!","post_message":"These guys are SCUM!!!"},{"comment_id":"10155842055160354","commenter_b":"F**K that Little C*nt , deport the little bitch immediately !!!!!!","commenter_a":"Maybe she should give back all those American dollars she has made from a country she hates so much.","post_message":"Not the sentiment America's past time was looking for..... WATCH the video and hear it for yourself...."},{"comment_id":"10153166262121336","commenter_b":"she can't stop lying","commenter_a":"If her lips are moving she is lying","post_message":"“All my grandparents, you know, came over here...\" – Hillary Clinton said on the campaign trail But Census records show that only one of Clinton’s grandparents was born outside of the U.S."},{"comment_id":"1349378628409086","commenter_b":"If the left gets anymore crazier than it already is, they will probably force all heterosexual women who got impregnated the natural way from a heterosexual male to undergo an abortion, and only lesbians and transgender \"men\" can have babies. They want a world where only lesbians, homosexual men, and transgenders exist.","commenter_a":"The day is going to come when it will be possible to determine if your child will turn out like \"They\" before they are born. We shall see how much the left loves abortion then.","post_message":"This is getting out of hand..."},{"comment_id":"10153460362791336","commenter_b":"Trump has Americans interest for once , not what can Americans do for illegals .","commenter_a":"The Silent Majority is COMING OUT FOR Donald J Trump. The PC ERA IS OVER. THE TRUTH ERA IS HERE. Donald J Trump 21st Century Patriot.","post_message":"\"The silent majority is back, and we’re going to take the country back.\" On Saturday, Republican presidential hopeful Donald J. Trump spoke to thousands of cheering supporters in Arizona."},{"comment_id":"10153191536946051","commenter_b":"I was thinking of eradication of the scum and I don't care what color they are!","commenter_a":"Doesn't matter what nationality, they need there legs broken, if that was my daughter?","post_message":"This teen was at the gas station with her boyfriend when a group approached them."}]
