[{"comment_id":"10154335593072293","commenter_b":"Doesn't it amaze everyone how trump gets away with not being transparent at all with his tax returns, his business ventures, etc, etc, etc...but if Hillary Clinton spits on the sidewalk, the world comes crashing down on her! #DOUBLESTANDARD","commenter_a":"With most of the criticism coming from left wing gossip rags like WaPo! Lmao at the yellow journalism!","post_message":"On Monday, criticism of Comey continued to mount, notably from prominent former law enforcement officials."},{"comment_id":"872299812875772","commenter_b":"Hillary is spreading disgust. She's a shameless, pathological liar with no morals at all.","commenter_a":"She is a complete idiot as well as a liar.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"},{"comment_id":"10154278742015329","commenter_b":"Thats that lingo dang old times lol","commenter_a":"Diego X Flores Pringle","post_message":"Single and ready for a PRINGLE."},{"comment_id":"667942883338893","commenter_b":"No.","commenter_a":"Because whites haven't been a suppressed race for hundreds of years.....does stupid hurt? I figured I would ask the idiot that runs this page wth a grade school education.","post_message":"Hmmmm....."},{"comment_id":"10150618266494999","commenter_b":"Benny no where have I said or implied 'let the floodgates open and let every single person just come on in'. If you read my 1st few words, you would see that just putting a concrete wall around the WHOLE country is not the answer. Take the opportunities away and well, you should be able derive the answer. The ones that are here, are, whether you believe it are not, contributing to society already. They cut your lawns, serve your food, make your sandwiches etc etc. Even work the farms. I am not for illegal immigration whatsoever but to say they who come over bring us problems!!...I think we have benefitted more from them than not. I am just saying not all illegal immigrants are Mexicans. As for your Chinese response, true they would love to come to America. A lot do make it here (illegally I may add). Have ...","commenter_a":"This is how people misinterpret words. Trump was talking about ILLEGAL immigrants. No offense was towards Bushs wife. Unless of course she is illegal.","post_message":"'He’s not a stupid guy, so I don’t assume he thinks that every Mexican crossing the border is a rapist,' Jeb Bush said of Donald J. Trump."},{"comment_id":"1452044741482218","commenter_b":"You need to put down your crack pipe that crap has fried your brain; dumb witch","commenter_a":"Democrats r a bunch if liars ..republicans are honest and classy","post_message":"'I knew Ronald Reagan. I worked for Ronald Reagan. Donald Trump, you are no Ronald Reagan.'  -Republican Doug Elmets says he's voting for a Democrat for the first time in 40 years.  More: @webpagelink"},{"comment_id":"589335207936802","commenter_b":"Can some one please explain to her that her relevancy has expired and she has a court date in ND for vandalism to appear for?!","commenter_a":"IDIOT","post_message":"Ha ha ha ha ha ha ha. She's turning into quite the side show."}]
