[{"comment_id":"10153215419029726","commenter_b":"She is a much bigger problem than wild Willy","commenter_a":"possibly the only reason she wants to be president is so that she avoids prison time.","post_message":"Are YOU Ready for Hillary? Which is her bigger problem... Benghazi, missing emails, Wall Street? @webpagelink"},{"comment_id":"10153487463364203","commenter_b":"Problem is not her parents. Problem is a whacked out white woman desperately wanting to be black.","commenter_a":"It's weird but I wonder why her parents threw her under the bus. Must be something else going on.","post_message":"The NAACP president in Spokane, Washington, has come under investigation after her parents said she been posing as black for years."},{"comment_id":"10152597227421615","commenter_b":"Thank you....so are y'all! Oh I forgot...so is Y'all @username!","commenter_a":"Please use proper English...y'all is not a world in the English language! I guess I am racist, also!!","post_message":"#BREAKING NEWS UPDATE: A 17-year-old boy has been arrested and is facing adult charges in connection with a shooting at the Monroeville Mall last night. @webpagelink"},{"comment_id":"565467440308215","commenter_b":"And here ya go, they will bite the hands that feed them .. dumbass .","commenter_a":"What about our children who live on the streets and homeless families in America!!","post_message":"He was wrong! What happened next..."},{"comment_id":"10152911089911491","commenter_b":"There's already two women on the dollar coin","commenter_a":"So... doesnt it cost money to change the bill ? Im not paying for it. Are you Ms.Hillary Clinton ?","post_message":"Hillary Clinton: Harriet Tubman on the $20 bill would be \"awesome, well deserved — and about time.”"},{"comment_id":"10153423597850779","commenter_b":"Who is that chick on the left","commenter_a":"Sasha Banks, who is the by far the best wrestler male or female in the WWE, is Snoop's first cousin. I'm guessing a storyline should emerge.","post_message":"WWE has confirmed that Snoop Dogg will be inducted into the WWE Hall of Fame's celebrity wing, joining a list of alumni that includes Pete Rose, Mike Tyson, Arnold Schwarzenegger and Donald J. Trump."},{"comment_id":"1007448135988608","commenter_b":"Lmao ik ik fr","commenter_a":"Me back in my days with the chancla 😂😂 @username","post_message":"Escape plan master"}]
