[{"comment_id":"10153484924965861","commenter_b":"Impeach her","commenter_a":"Mary Failin was trumped","post_message":"BREAKING: The Oklahoma Court of Criminal Appeals has granted a two-week stay in the execution of Richard Glossip."},{"comment_id":"10153907055674199","commenter_b":"She's a straight up hood rat.","commenter_a":"I normally don't comment on things like this, but she has to be very cold hearted to cheer the death of anyone. The actions of some do not represent all. #alllivesmatter","post_message":"\"This behavior is unacceptable & does not represent our brand's values & ethics. The franchisee has terminated the employee.\""},{"comment_id":"1705293566392359","commenter_b":"Not only is she racist she has a chip on her shoulder against whites. She has done very well in this nation and it took whites to get her where she is at! Ungrateful bitch.","commenter_a":"Liberals always resort to name calling. They can't come up with a rational argument. Help Oprah go away don't buy anything of hers and don't watch her. She will then be loving whites. She's a sad woman.","post_message":"Oprah: ‘Anyone Who Doesn’t Like Obama Is Racist’. Unbelievable. What a bigot. Do you think Oprah is the racist?"},{"comment_id":"10152577798681316","commenter_b":"A percentage will watch Hannity and cry. The rest are busy being free.","commenter_a":"LOL they said this in 1777","post_message":"Freedom hardly exists in America today, where a family man who helped people purify their water naturally now faces 37 years in prison. Read Daniel Smith's story and support his fight against the corrupt US justice system. @webpagelink"},{"comment_id":"994048267321588","commenter_b":"Yes. And paid for by private donations","commenter_a":"Gorgeous yet not gaudy. Most important: Everything was Made in the USA . Wasn't it?","post_message":"Michelle Obama blows $600k on ‘modest’ dining room makeover"},{"comment_id":"950390221741940","commenter_b":"here comes people saying. \"no deport them all\" and stuff. and yet they forget who really made America. found by immigrants. the Irish had a very hard life back then, the hate saying this word, African Americans had a harsh life, people whats the difference between illegal immigrants and legal immigrants. a legal immigrant can be much more dangerous than an illegal. look what happen in 9/11. Boston bombing. ect. and how is it that an illegal can have a job, without knowing the English language. no American education?? the come here, and still believe that the American dream is still alivem but we Americans are the ones that destroyed it.","commenter_a":"THAT'S the way! No one is \"illegal\". We are ALL human beings and should treat one another accordingly.","post_message":"\"We need to take 11 million undocumented people out of the shadows, out of fear, and we need to provide them with legal protection,\" Sanders said."},{"comment_id":"527974647394206","commenter_b":"It is not the gun! It is the government's purposeful lack of enforcing the gun laws that we already have, allowing criminals and drugs to pour into this country, no border protection, telling people to rise up and kill cops, stop that, then you will see these horrific murders stop. Wake the frig up.","commenter_a":"They are banned and have been for many years","post_message":"The shooter in Orlando used an AR-15, the same semi-automatic assault rifle used in Newtown and Aurora. There is no constitutional right to easily slaughter 50 people. End of discussion.  Image by Occupy Democrats, like our page for more."}]
