[{"comment_id":"976154972433526","commenter_b":"thats cause they want illegals to vote","commenter_a":"Buying votes","post_message":"Really?!"},{"comment_id":"1777971925823252","commenter_b":"She's cheating with a cheater, duh.","commenter_a":"Can't stand him. Good voice but once a cheater, always a cheater . Maranda your so much better without him. Keep up the good music. He's trash and so is She. .","post_message":"Whoa..."},{"comment_id":"1007311229351882","commenter_b":"'@username more people die every year in DWI accidents than in 10yrs of the war..stop whinning it will be on our soil soon.thank obama for that.","commenter_a":"Good because theyve destroyed the republican party and turned it into a warmongering party filled with neocons. Trumpism will come in to replace them and become a patriotic party for the first time in 40 years. We live in exciting times and I am honored to witness it.","post_message":"'They are as dead as emperor-worship in Japan.'"},{"comment_id":"10154002938919749","commenter_b":"Cindy Rhodes go do one stupid cow feminists are scum","commenter_a":"If your still hung up on feminism within the uk and the us then you need to develop your personality. Not your discrimination skills.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153231679439071","commenter_b":"But they're so nasty lol","commenter_a":"Hnsh Ltif ewwwww","post_message":"A company has created a replacement for water bottles that you can actually eat."},{"comment_id":"10154264763012452","commenter_b":"You aren't immigrants, you're illegal aliens. What idiot feed you the line you belong here? Oh yeah, ofailma and Jerry Brown. Remember, when you break into my house, it doesn't make you part of the family it will make you leave on a stretcher.","commenter_a":"And no one missed any of them 😂","post_message":"Immigrants skipped out of shopping and stayed home from work and school as part of 'A Day Without Immigrants' protests that happened across the nation.  Businesses in Los Angeles closed in support of the protests, which were a response to President Donald Trump's immigration agenda."},{"comment_id":"10153798584711350","commenter_b":"You need attention like that idiot cutting herself.","commenter_a":"She's trying to commit suicide by cutting her upper arm. She's an idiot. A bridge or high building is what she needs to do. Cutting her arm is just a cry for attention.","post_message":"a teenager is hard, school sucks, parents are lame but life has so much to give you.'"}]
