[{"comment_id":"10152968983250736","commenter_b":"What law didn't he follow?","commenter_a":"Judges should follow the law.","post_message":"The judge who hung this photo of Adolf Hitler in the Marion County Courthouse hired a lawyer who advised Citizens United to represent him."},{"comment_id":"10154991489419726","commenter_b":"Oh please! Maybe she'll move to Syria and we'll never hear from her again!","commenter_a":"loser.","post_message":"Her Instagram has us thinking she might..."},{"comment_id":"1495140610505964","commenter_b":"Candace Richerson what about roger Ailes? He's a jerk. So what","commenter_a":"The truth hurts doesn't it!??!!! She is well armed with actual facts. Unlike the people who speak for Trump: the sexual haraser, the racist, the bully and the Ukraine employee - But you Trumpets go right ahead and support the guy who loves Putin. Every Hitler needs a Mussolini.","post_message":"Sen. Elizabeth Warren calls Donald J. Trump a \"small, insecure money-grubber\" during her first solo campaign appearance for Hillary Clinton. Read more: @webpagelink"},{"comment_id":"10153432969041037","commenter_b":"Liars too?","commenter_a":"History lesson needed here - the NAACP is and always has been open to people of all races/ethnicity for membership and leadership. This story is a non-issue.","post_message":"NAACP's Rachel Dolezal: \"We’re all from the African continent.”"},{"comment_id":"1043659032366340","commenter_b":"Yeah yeah @username, it's airheads like yourself what Trump needs to screw up everything in your country. I will build that wall so that people like you can't come into Mexico","commenter_a":"Look at what Mr. Trump is doing to America as a candidate, dividing it, making everybody fight betweeen each others. Imagine what he would do as president...","post_message":"People could be heard screaming, and Donald J. Trump ducked his head, grabbing his podium with both hands before backing away."},{"comment_id":"10153522112557690","commenter_b":"Amen","commenter_a":"Rest well kiddo !!! Hope your fam find some comfort in the lord !!!! From him we came and to him we shall return!!!","post_message":"Police say a Denton teenager died after being struck by an SUV while trying to cross the street. @webpagelink"},{"comment_id":"10153875712703128","commenter_b":"Natalie Grace","commenter_a":"my iphone 6s lpus battey has not died on me. it has lasted me all day every day. they increased the battery life so if people are having problems then thats off","post_message":"With its entry into the battery case market, Apple finally admits that heavy iPhone users could use more juice. Its solution also fixes many of the issues present with third-party cases."}]
