[{"comment_id":"10150722411999999","commenter_b":"That trains never late Go home Carrie you're drunk! Take your pseudo intellectual rhetoric with you. Of course she'd be singing a different tune if she was raped by a refugee. You're a pig!","commenter_a":"And you don't think they'll do that here?! Able bodied men who cowardly seek refuge instead of fighting for their country tells me everything I need to know about those people. Muslims are known for treating their women as property. They have no rights other than being breed sows. But we should be tolerant of a race of people who worship a sexual deviant that doesn't tolerate any other religion. Where are all these \"peaceful\" Muslims fighting back at these radical Muslims? First person to call me a racist for calling it like it is can open their doors and put their family in danger.","post_message":"The mayor of Cologne suggested that women protect themselves from men by keeping more than an arm’s length away."},{"comment_id":"1154933824548403","commenter_b":"Kill every last pig","commenter_a":"Well done Syria","post_message":"Watch Syrian forces closing in on the Daesh Takfiri terrorist group’s de facto capital Raqqah."},{"comment_id":"1870709889833499","commenter_b":"And what about those born with both genitals ?","commenter_a":"A person that has the female organ is female, and a person that has the male organ is a male, END OF THE CASE. Next please: ''The Kardashians Still Fighting Over a Pudding''","post_message":"Meet the cover girl who used to be a boy"},{"comment_id":"1157612937618557","commenter_b":"Yes we all should judge illegal immigrants as invaders and depot them! good ppl or not they MUST GO","commenter_a":"Color Blind? All Trump has done in his campaign is judge people by there color and culture.","post_message":"Ivanka Trump on the people her father hires: \"He is color blind and gender neutral.” @webpagelink"},{"comment_id":"590256634486210","commenter_b":"Haha america was never great and with you or Hilary as our president it will continue to never be great !","commenter_a":" Vote strong Vote Trump","post_message":"This is only the beginning. Hillary is CROOKED! She is not capable of making America great again. Sadly, she would do the opposite."},{"comment_id":"1811838059034995","commenter_b":"And her answer is I don't have an answer for you. Really because you know the answer already bitch","commenter_a":"Love this guy. So to the point it's pathetic. And I can't answer anything.","post_message":"Trey Gowdy utterly DESTROYS this liberal...."},{"comment_id":"479805008868046","commenter_b":"Asshole!","commenter_a":"Stop the nonsense! We need people with some brain power addressing these issues because this comment is the most idiotic I have heard!","post_message":"Victim blaming is NEVER ok."}]
