[{"comment_id":"10154151629042507","commenter_b":"Says the white bitch with a job and a Beamer....Dorothy saloum.....ha-ha!","commenter_a":"Hey @username liberals, Thanksgiving looks like gratitude. It's all about money to you socialists.","post_message":"If you have $50,000 you can join them."},{"comment_id":"1717305195178742","commenter_b":"@username Did you smoke crack before your post? Americans can be Asians. Using your logic, Latinos and Latinas can't be Americans either. And all blacks would be African. Also, those nations are far from being heterogeneous like ours.","commenter_a":"Yes Asian men are not portrayed in a very nice light especially in american media. however, I find many Asian men to be attractive. love the facial structures and there is nothing like a guy with a sword.","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"758122781044966","commenter_b":"Pack it up asshole your fired","commenter_a":"Traitor","post_message":"While Everyone Was Distracted By Super Tuesday Obama Secretly Did THIS We can't let him get away with this. He needs to be stopped. Do you think Obama is running this country into the ground?"},{"comment_id":"1157175910989546","commenter_b":"Why would ANYBODY admit they were a Republican after this years parade of idiots, never mind vote for them?","commenter_a":"Assholes are use of SHIT !!!!","post_message":"Three Republican presidential candidates befriend a pastor who just went on stage and gave the most bizarre anti-gay speech ever."},{"comment_id":"10152608851681636","commenter_b":"we need freedom from jews.","commenter_a":"Mocking the prophet of as violent cult is different to mocking the deaths of 6 million people.","post_message":""},{"comment_id":"10153525456151438","commenter_b":"I've saved this to read for later because I'm in denial. I will always remember Richard Dawkins the way he was in his Growing Up in the Universe christmas lectures.","commenter_a":"He might be a brilliant scientist and author, but he's also a bigoted asshole too filled with his own sense of superiority to recognize that he can be as much of an intolerant hypocrite as the religious extremists he (rightfully) criticizes.","post_message":"He’s charming in his books, but he picks fights on the Internet."},{"comment_id":"1536859509948075","commenter_b":"I don't want your butt in my face! Haha","commenter_a":"@username think we could do this?! Haha","post_message":"That feeling when you've made it to Friday... via JukinVideo"}]
