[{"comment_id":"10153018871246130","commenter_b":"Lesbian porn is boring. Girls that don't have the slightest clue as to how to thrust their hips.","commenter_a":"Men say \"fucking disgusting\" then get their morning jerk off to lesbian porn.","post_message":"How adorable is this?"},{"comment_id":"644967912360454","commenter_b":"That's a women? !","commenter_a":"He ain't banning a damned thing!","post_message":"A Hispanic student is banning whites from using this term... because it's racist? 'LIKE' if this is WRONG!!!"},{"comment_id":"1083622038339883","commenter_b":"The girl who was supposedly GRABED claims ALL SORTS OF THINGS! I think she wants to live the American dream....SUE SOMEONE AND RETIRE! Little WITCH!","commenter_a":"Another liberal that makes me think in rare cases abortion maybe should have happened !!!!!!!!!!!!!","post_message":"BOOM!!"},{"comment_id":"10153615979136336","commenter_b":"The screams of protest would wake the dead if that happened.......even after the muslims get they demands met!!! This is a true blight on America!!!","commenter_a":"Should be open to all faiths. Can you imagine the liberal outrage if it was a Christian prayer room?","post_message":"\"How loud do you think the objections would be today if they spent $250,000 in taxpayer money to build a new prayer room exclusively for evangelical Christians?\" – Rev. Franklin Graham"},{"comment_id":"10155757585249829","commenter_b":"Why not boycott Budweiser simply because it is not good beer?","commenter_a":"Melania???????","post_message":"Trump supporters on social media were furious: \"Never drinking Budweiser you should respect the AMERICAN president instead you mock with liberal propaganda.\""},{"comment_id":"10153238417336717","commenter_b":"Like regular hetero marriage is such a fountain of virtue. LOL","commenter_a":"What a nice slap in the face for marriage equality. They say they dont care what anyone thinks....I think they look like whores, when's number 4 coming?","post_message":"In case you missed it:"},{"comment_id":"1186097424786988","commenter_b":"Hillary you're a smart women have faith and be strong you is next President Trump dangerous","commenter_a":"Hillary, you will be a great President.","post_message":"Here’s the sad truth: There is no other Donald Trump. This is it."}]
