[{"comment_id":"1724806041088528","commenter_b":"@username don't be angry at @username because your ignorant.","commenter_a":"And THAT is why we need @username more than ever. With a life-long career of public service, having been a successful Senator and Secretary of State, and more than tough enough to continue the legacy of Obama, no one is more qualified. #Hillary2016!","post_message":"“The presidency is not an entry-level position.”"},{"comment_id":"10153238960151438","commenter_b":"Ok clark. You win. All lesbians are fat hairy and ugly. That is completely accurate. No bullshit. You are a really smart person. So glad we had this talk.","commenter_a":"why are most queer women obese now thats a question","post_message":"Why don’t queer women flirt with other queer women?"},{"comment_id":"1050442818384698","commenter_b":"At the least, his judgement is impaired............his bond to the Clintons got in the way of his judgement.............","commenter_a":"Fire him he is a crook","post_message":"Should James B. Comey, Jr. continue as Director of the Federal Bureau of Investigation? Is he professionally compromised? Does Mr. Comey continue to enjoy the trust and confidence of the American people, the rank-and-file of the FBI, and the thousands of government employees holding security clearances and access to classified information? Read this op-ed by Judicial Watch Director of Investigations Chris Farrell below."},{"comment_id":"10155033056251350","commenter_b":"you alice are the lame one.... bet u r fun at parties....not!","commenter_a":"how can americans put the flynn event in context. flinn's entry into the trump power structure was vigorously opposed from the beginning: one might even consider his a marked man. part 2: media has propogated trump's comments on intelligence agencies extensively. so one could ask the question how does the leak on flynn occur in the first place: NSA surveillance or other. it would appear a US intelligence agency leaked to the anti trump news media:))) could one consider that a direct attack on this nation to influence American government: yes. trump must drain the swamp in the intelligence community now. the entire establishment apparatus that supported the status quo is now actively working against change middle class voted for: start the purge. there is an outlier that must be considered: Israel. trump is surrounded by Israel firsters. was flynn one of those or was he an American firster. did ...","post_message":"On this Valentine Day, watch George H.W. and Barbara Bush share their touching love letters on TODAY in 2011 (and try not to cry!) @webpagelink"},{"comment_id":"10153083604111350","commenter_b":"They have noses ! Lori Askeland","commenter_a":"Please be sure to share that Etsy link when she does start a page up!! I'm interested in these adorable dolls!","post_message":"We just love the way this artist transformed these dolls -- they look like kids again! Click to check out all the awesome make-unders."},{"comment_id":"941299175911870","commenter_b":"Trio does not exist.. Just close borders of USA. And Americans go home please.. .","commenter_a":"But why? Much as I hate usa n what it stands for, what it does n how it treats my fellow african brethren, I still don't want it to cease to exist. What kind of sick minds wish such a thing? I'ld understand if z nazis felt zat way, for if it weren't for z Russians nazism would've triumphed, God knows for how long!!! But, why usa? Is my theory of kkk/nazi/zionists existence n zer devious work at z root of things once again? For me z 'trio' are one n z same!!!","post_message":"A top official in Moscow says Washington’s aspiration is to see Russia cease to exist as a country."},{"comment_id":"1197123797007048","commenter_b":"we dont have to suit anyone, the LORD gave us free will, why dont the VATICAN set up a special place for these illegals.","commenter_a":"you like mr pope you take them all including obama kerry h clinton no need to thank america for giving you these winners you are welcome o mexico will send all their winners too you are welcome ok","post_message":"I wonder how many spare rooms the Vatican has..."}]
