[{"comment_id":"649524331880703","commenter_b":"She and Bernie are behind these riots. Why do we listen to her? She is a liar!","commenter_a":"You got that all right. Randy Webster","post_message":"Disappointing to hear."},{"comment_id":"10156599267875354","commenter_b":"She had him boxed. I think maybe she used to play college basketball. lol","commenter_a":"Did someone get schlonged?","post_message":"You have to WATCH it..."},{"comment_id":"10153371613511336","commenter_b":"Leave it alone. Enough already!!!!!!!","commenter_a":"REALLY? think theres much better ways to spend our tax dollars","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"497111050479475","commenter_b":"She's a sellout to her own race, taking everything that white people gave her, and then spews her racist anti white nonsense to make blacks think she actually cares about them.","commenter_a":"She described racism other countries not ours.","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy.  She's the biggest racist we know, and we won't stand for it.  Do you agree Oprah is racist?"},{"comment_id":"10153850035618445","commenter_b":"Your post smells like it was done by a pussy with a badge.baaaacooonn!!","commenter_a":"Text/call us at @username We got good Quality medical marijuana strains for you with optimal potency and of absolute highest quality, I believe that marijuana is a good medicine and should be freely available to everyone regardless of unjust laws. We provide prescriptions for your health issues including: Many more just hit us @username","post_message":"Opponents of Florida's Medical Marijuana Initiative Slam Legalization.   @webpagelink"},{"comment_id":"1633936340229657","commenter_b":"TWISTY IS REAL","commenter_a":"@username well this sounds like fun","post_message":"Residents in this neighborhood are saying creepy clowns are trying to lure children into the woods.  #MicBrights"},{"comment_id":"10153846096281491","commenter_b":"Ugly woman, keep out of my face.","commenter_a":"The Trumps our outdoing themselves at lying....","post_message":"\"The best, most plutonium-fueled part of Melania's SpeechGate? They stole the part about the importance of honor and integrity.\""}]
