[{"comment_id":"10154363998161756","commenter_b":"You're right @username, it's easier to lie to the people and then change nothing. #sheisworthless","commenter_a":"The mainstream media - and @username is that - has done the work of the status quo establishment and convinced the American people that nothing can be done anymore because it's too hard and too complicated. Anything is possible, but it will take the will of the people to continue the political revolution. Change is coming, but it will be a long struggle. A hard fight against the establishment. Bernie or bust. Don't ever give up.","post_message":"The effort ultimately would rely on Sanders getting stalwart backers of his plan into key positions, followed by a difficult, drawn-out fight with the powerful industry."},{"comment_id":"10153725058711178","commenter_b":"The tea party is NOT a criminal organization. Black lives matter IS a hate groups.","commenter_a":"There wouldn't be a black lives matter movement, if police brutality didn't exist.","post_message":"Is there a double standard in the media for the Tea Party and Black Lives Matter?"},{"comment_id":"10154023438494486","commenter_b":"WHERE IS HILLARY? SHE SHOULD BE THERE, SHE WOULD HAVE GIVE HIM A BIG HUG OR A BIG KISS.....LMAO","commenter_a":"I don't think Obama was trying to shake his hand. it was almost like he tried to put his arm around Castro's shoulder and Castro stopped him or something. It was weird.","post_message":"Be careful! That's his THROWING ARM"},{"comment_id":"10153950585516491","commenter_b":"I really wish it had been 'Let the bodies hit the floor\" by Drowning Pool","commenter_a":"What this guy have to do with music? This show is a joke nothing to do with real music talent onlyma bunch of show offs","post_message":"Michael Phelps:  \"I might have a lot of gold but this guy’s got all the platinum.\""},{"comment_id":"975510729232372","commenter_b":"Those animals have to be destroyed and kept out of America","commenter_a":"TIME TO GET RIGHT","post_message":"What radical muslims are allowed to do to their own families is absolutely horrifying. We cannot let this ever happen in America no matter how hard these radicals try to impose their ideologies on our great nation.   SHARE if you agree that this disgusting practice needs to be wiped off the face of the earth!"},{"comment_id":"10153434419026051","commenter_b":"How does such an ugly and lazy guy find that many women to breed with him.","commenter_a":"Can you say \"vasectomy\"..and a \"JOB\"","post_message":"This guy has 26 kids with 15 women and has been getting $50,000 per year in benefits. Now he’s getting a brand new special gift."},{"comment_id":"10153182332356051","commenter_b":"i dont read anything about this lying bitch","commenter_a":"Hell no","post_message":"Here is how Hillary Clinton is defending herself against the e-mail scandal. Do you believe her?"}]
