[{"comment_id":"10154729419757699","commenter_b":"Aww Gee must really be scared of Trump . Just use all the money we send them and rest of south America and build the wall that will do it","commenter_a":"TRUMP 2016 !","post_message":"FOX's Gurnal Scott reports."},{"comment_id":"10153324707666336","commenter_b":"Hillary 2016! Go USA!","commenter_a":"Welp, if rand does not win the nomination I'll be voting libertarian. Good luck","post_message":"Breaking News: A bill that would allow key government surveillance programs to resume for now – after they were temporarily suspended Sunday – has cleared another hurdle in the Senate and is headed to the president's desk. @webpagelink"},{"comment_id":"10153770425869153","commenter_b":"You can't possibly be that stupid Christine ....","commenter_a":"just read where radical islamic muslims will come in with Syrian refugees so yes I agree with Trump","post_message":"What are your thoughts on Donald Trump's comments?"},{"comment_id":"10153356889206162","commenter_b":"But according to @username, only BLACKS are doing this foolishness...So I guess the Latin Kings, & the Sinoloa drug cartel, are peace-loving church groups...","commenter_a":"Im sorry but blacks enjoy killing their own over drug money gangs personal problems and ignorance. I do feel as sorry for those innocent people that have lost their lives due to the violence of this crappie city and ignorant people.","post_message":"DEVELOPING: 2 men are dead and a woman is injured after a shooting in North Lawndale: @webpagelink"},{"comment_id":"1814189528815874","commenter_b":"Hillary is use to debates Trumps not and can't even deal with a woman with a baby during his speech","commenter_a":"Wait until the debates, when Hildebeast turns into a shrieking harpy on stage when confronted about her many, many schemes, scams & failures. Take a poll then.","post_message":"A new Fox News poll shows Democratic nominee Hillary Clinton leading Republican nominee Donald J. Trump 49 percent to 39 percent among likely voters, while 61 percent of respondents say they consider Clinton to be dishonest."},{"comment_id":"10153228975447452","commenter_b":"*facepalm* ... She is an idiot. She should have respected their religion.","commenter_a":"Charge the lady for assault","post_message":"Attacked as they prayed?  A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam  “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."},{"comment_id":"1809742349269568","commenter_b":"IF YOU CAN DUMP TRUMP OVER SOMETHING HE DID YEARS AGO IN PRIVATE LIFE. THEN HILLARY SHOULD BE IN PRISON NOW.LOOK AT 5HE TREASONOUS ACTS AGAINST AMERICANS. THIS IS ALL SHE CAN COME UP WITH TO DEBATE TRUMP SHE HAS LOST ALREADY.","commenter_a":"It's not happening folks, he IS our next president !!!! He has done nothing most guys haven't done around a bar table or a camp fire with their friends, and most girls have done talking to their girlfriends and men, his words can't even come close to what that female has done, so get over it he is the only smart choice !!!!!","post_message":"Lawyers at the Republican National Committee are assessing what legal remedies, if any, could allow the committee to remove Donald Trump as the party’s standard bearer."}]
