[{"comment_id":"10153415193876833","commenter_b":"I no Right, They Don't Want The Public Safe!!!!!! Then the Rioters and Looters would be Looting and Rioting even More and getting away with it as always!!!!","commenter_a":"Does this mean our murder rate will plummet because the gang members won't have guns?","post_message":"The U.S. Seventh Circuit Court of Appeals issued a decision on Monday allowing a Chicago-area gun and magazine ban to stand. Such bans are justifiable, according to the court, merely on the basis that they \"may increase the public's sense of safety.\""},{"comment_id":"10154267977076756","commenter_b":"Really?....Belgium. Some of the nicest people in Europe. There is no reason in these people. They just hate everybody. Sympathy to the Belgian people. I have visited your country and was impressed with your quality.","commenter_a":"So terrible...","post_message":"NPR is following the deadly attacks in Brussels. -- At least 30 people died in explosions at the airport and a metro station.  -- Some 200 were injured, including at least one U.S. service member and his family. -- ISIS has claimed responsibility for the attacks, and police released a photo of a suspect."},{"comment_id":"10155107253330557","commenter_b":"White people riot","commenter_a":"Must of been a black on black murder .... No riots","post_message":"#BREAKING: 2 people in custody, another still at large in the murder of a man in Reading. Developing details in the story below and in a live report on 69 News at 5:30."},{"comment_id":"10155515421201509","commenter_b":"That woman is the devil incarnated in a human body.","commenter_a":"Change profile pic to RED to show your support of TRUMP/PENCE","post_message":"\"I will not defend or endorse @realDonaldTrump, but I am voting for him. HRC is that bad. HRC is bad for the USA\" the House Oversight Committee chairman tweeted."},{"comment_id":"1693302644277794","commenter_b":"Great news. She does anything to get publicity","commenter_a":"Good the left wing nut.How does this broad even have a job?","post_message":"Melissa Harris-Perry is refusing to host her show this Saturday due to weeks of pre-emptions that she says has left her \"silenced.\""},{"comment_id":"10154339068600399","commenter_b":"@username keep drinking the kool-aid, Ms. Deplorable.","commenter_a":"As Trump himself is a serial philanderer, I can't fathom how he figures the presence of Gennifer Flowers would hurt Hillary. To me, it just proves that the Great Orange Misogynist sees women as pawns and does not hesitate to try to use them to hurt each other. He is the textbook definition of a male chauvinist pig.","post_message":"\"If dopey Mark Cuban of failed Benefactor fame wants to sit in the front row, perhaps I will put Jennifer Flowers right alongside of him!\"  Cuban is the leading skeptic when it comes to Trump's claims about his wealth."},{"comment_id":"10154394600380695","commenter_b":"Girl sit down... Really","commenter_a":"Why is this disgusting waste of human flesh still walking amongst us? Lock this rapist up already and throw thr key in the bottom of the Pacific","post_message":"BREAKING: The 78-year-old actor faces up to 10 years in prison if convicted."}]
