[{"comment_id":"929829353743480","commenter_b":"Gee, you'd think women would be smart enough to either (a) buy better shoes or (b) switch them out when they start to hurt. I guess not.","commenter_a":"I don't know why people wear them tbf,not if they're uncomfortable","post_message":"Time to switch to flats, ladies!"},{"comment_id":"10155018018037311","commenter_b":"You should not judge unless you walk in their shoes, there are many reasons why they come in and stay illegally, majority work harder then any one born here to make ends meet. They do not get freebies, unless someone is kind and help them. 90% of them just come here to work and work harder then most people. People just talk out of ignorance","commenter_a":"It's too bad all these snowflakes can't distinguish between Immigrants and ILLEGAL Immigrants. The United States has always welcomed legal immigrants who want to come to this country, embrace the culture and make a contribution to the success of this country. We do not welcome people who come like thieves in the night, vote illegally, steal social security benefits, use our schools and hospitals and commit a disproportionate amount of crime. Big Difference. PASS IT ON!!!","post_message":"It calls for immigrants across the country to not attend work, not open their businesses, not spend money or even send their kids to school."},{"comment_id":"1292895457407386","commenter_b":"FFFFFFFFFFFFFFFFFFFUUUUUUUUUUUUU UGLY BITCH","commenter_a":"Frau Kraut...... you have destroyed Germany ... so shut up.","post_message":"Why would Merkel think issuing Trump a not-so-thinly veiled warning, on the day after his amazing win, was a good move politically?"},{"comment_id":"935501763157349","commenter_b":"Okay. That's more than a bit much. People shouldn't need to spread theirs legs that much. I wish people wouldn't call it man spreading though. I've seen women do it as well, and the name just sounds offensive.","commenter_a":"Frankly unless they refuse to close their legs to let someone sit next to them this is just stupid.","post_message":"They both spread their legs on the subway, but only one raised eyebrows. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10153168114730399","commenter_b":"Go to hell u hypocrit","commenter_a":"Our laws are dictated by the society as a whole, not by anyone's God or church.","post_message":"A unique interpretation of our justice system..."},{"comment_id":"511461792370480","commenter_b":"The bitch will do as she always does: LIE, and the Establishment will protect her and not have an indictment. It's sad the way this country would rather have a corrupt person with a rap sheet longer than her arm, get away with everything she and Willie have done. Anyone: Google \"Clinton Chronicles\".","commenter_a":"Moot point... Hillary will get crushed by the FBI.","post_message":"Donald Trump says he would crush Hillary Clinton in a general election. Do you think he's right?"},{"comment_id":"10154755276262619","commenter_b":"Heads up!","commenter_a":"Natanyahu is not an Orthodox Jew. He is a secularist.","post_message":"The Israeli Ministry of Defense Missile Defense Organization head Yair Ramati has been dismissed from his post due to grave security violations."}]
