[{"comment_id":"10153744773906880","commenter_b":"Huge write-up on a banker. He took billions of dollars from loser investors. Enron? Says it all. The greatest corporate collapse in US history. Great spin on a shark.","commenter_a":"Jason Espeseth Scott Arnebold","post_message":"He's taking on the issues that no one else wants to confront."},{"comment_id":"10158374477135093","commenter_b":"Furthermore he did write an executive order which took guns away from Social Security recipients","commenter_a":"The morning after the 2008 Obama election I was not nearly as upset as liberals are now. Because unlike Trump who said exactly what he planned to do during the campaign, Obama said he was not trying to take our guns away, was not going to make us lose our doctors, and believed in traditional marriage. Obama lied in order to get elected then began do all the things he planned to do but didn't tell the truth about. Liberals are upset because Trump said exactly what he planned to do and they know exactly what he plans to do.","post_message":"But we didn riot, punch people, block traffic, take a day off school, or go on a fast."},{"comment_id":"520761104778849","commenter_b":"Muslims are taking over united states they run all motels and 7 elevens in the country I don't know if its cause our government gives them a break on payinv taxes!","commenter_a":"political correctness......","post_message":""},{"comment_id":"1681195205453281","commenter_b":"Barbara just needs to go away!","commenter_a":"Her opinion doesn't matter!","post_message":"Barbra Streisand blasted “narcissist” Donald Trump in a 1,228-word Huffington Post op-ed."},{"comment_id":"1384744278251983","commenter_b":"I blame Obama, Jackson, Sharpton, Pelosi ...................","commenter_a":"Maryliz T. Curtis","post_message":"'It's a kind of anti-black mood'"},{"comment_id":"421180878069520","commenter_b":"^^ this idiot supports sanctuary cities and providing safe harbor to illegal alien criminals","commenter_a":"Hillary belongs in prison.","post_message":"More than $400 million has poured into the presidential race so far."},{"comment_id":"536832686498611","commenter_b":"Some of bernies supporters have been crazy lately","commenter_a":"Hillary Clinton MAY HAVE BEEN a liberal at one point. She no longer is. She is a bought subsidiary of large business. If Sanders isn't nominated I'm staying home. She won't get my vote. Edit: I also will never forget the racism and division of Hillary supporters who made the entire DNC kiss their ass to mend fences. It's not \"her turn\" and if I had my way she would never ever see the White House.","post_message":"Let's not do the GOP's bidding."}]
