[{"comment_id":"10157820905645389","commenter_b":"She can't be trusted","commenter_a":"God bless our first responders and their loved ones during this time of unspeakable tragedy. These premeditated murders were likely politically motivated acts of terrorism. This is the same stuff we saw when the American left attempted to impose their will on peace loving citizens through bombings, political assassinations, physical attacks on returning service members, and violent protests back during the 1960s. For those of us who were children at the time, watching this stuff on the nightly news became indelibly burned into our psyche. It was a scary time for our country. Terrorist groups like the Weather Underground were one of a number of groups that committed acts of terror against some of our most honored institutions. Bill Ayers was a member of the Weather Underground. The same Bill Ayers who was recently seen in attendance at a violent anti Trump protest in Chicago.which we now know via WikiLeaks ...","post_message":"'Hillary Clinton has changed her story about the use of a private server so many times, how can you believe any of this?' – Sean Hannity"},{"comment_id":"10153218585709614","commenter_b":"You're right .... She probably knew he wouldn't leave his wife ... She needs death penalty ....","commenter_a":"Her 'married boyfriend'.... So 1 baby couldn't keep him, she needed 2??","post_message":"This 3-week-old baby, kidnapped and discarded in a trash dumpster, was the innocent pawn in an 'evil' woman's elaborate plot to convince her married boyfriend that she had given birth to his twins, police said.  Giseleangelique D, 47, of Thousand Oaks allegedly sought out young mothers under the guise of a charitable organization looking for women with 1 to 2-month-old infants to assist.  That's how D found Eliza Delacruz, police say. She allegedly stalked the infant's mother and then had a co-conspirator snatch the child. Three other people were also arrested in the alleged plot, which includes an attack on another mother and child in El Segundo.   What investigators say they can't figure out is why 3-week-old Eliza was killed.  Read KTLA's story here: @webpagelink"},{"comment_id":"10153526289392183","commenter_b":"She is one nasty creature!","commenter_a":"You have nothing to worry about you entitled shill. Your we does not include me. Go Bernie!","post_message":"She's setting up the arguments for the general election here."},{"comment_id":"1589904131315822","commenter_b":"That's the stupidest reason I heard from a grown ass stupid woman/mother","commenter_a":"My choice was Bernie Sanders, but now I have to vote for Hillary Clinton because I 'm a navy mom and I don't want my son to be under the regulation of Donald trump, he said that he likes war.","post_message":"Oprah BEGS America: You don't have to LIKE Hillary, but you MUST vote for her!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154323044371545","commenter_b":"I don't need to march with a bunch of femanazis' I'm fully aware of my rights as a woman and my freedoms as a US citizen - no one has tried to take any of those away from me except the last administration so I'm good MAGA","commenter_a":"I wonder how many women signed up to go to these marches thinking that they were supposed to be empowering women when it turned out just to be an anti Trump rally- so I would say that at least half of the women may be there for totally different reasons - which means the people who organized these marches were completely disingenuous","post_message":"Any DFW women make the trip to Washington for the #WomensMarch? If you did, Hannah Davis wants to hear from you. Share your pictures here."},{"comment_id":"1787231111544405","commenter_b":"She was sucking the hell out that dick! Stephanie Nicole Goad lmfao","commenter_a":"Macie Knisley @username lol ummmm #Merica lol","post_message":"This Veterans Day party gives free tattoos, haircuts and blowjobs to veterans..."},{"comment_id":"10154271812178717","commenter_b":"Seems like all women think of is sex lol","commenter_a":"I would love to see the media dig deeper into this story--if possible. So many details baffle me. Why was she with Rood and Ross in the hotel room, sharing a bed? If sexual abuse/assault was part of this web that led to her death, I hope it's exposed and the appropriate people are charged.","post_message":"Jazzmyn Rood was sentenced Friday for her role in the 2015 death of Eve Tarmey. Details here: @webpagelink"}]
