[{"comment_id":"10154394005871337","commenter_b":"I love Salma Hayek's ass.","commenter_a":"i like the scene in wild wild west, where salma hayek shows her naked behind. nice butt.","post_message":"Will Smith is really, really sorry about Wild Wild West..."},{"comment_id":"1102809566397179","commenter_b":"RACIST .","commenter_a":"Ben is a nice man but he reminds me of my old Catholic priest in high school, out of touch with how other people live and he came up with the most ridiculous things. Voting to me for Carson is like voting for the old priest.","post_message":"Number. Three."},{"comment_id":"10156113177590725","commenter_b":"@username What was your last name @username again? we really need the wall!","commenter_a":"Like you always say China is eating our lunch.","post_message":"Depression- be careful of China!"},{"comment_id":"10153097192830090","commenter_b":"No! Don't bring the here we got enough idiots here already","commenter_a":"Move the Capital to Texas, will get it fixed.","post_message":"Since Obama can't provide real \"change,\" we're doing it for him.  Share what our Republican-led Congress must fix in Washington: @webpagelink"},{"comment_id":"10153664039221350","commenter_b":"Liz.....STFU!","commenter_a":"I am seriously sick of the name Caitlyn Jenner and anything with a Kardashian in it. How about reporting on something worthy or being considered interesting.. or a news story.","post_message":"\"I think about my life  and where I'm at in my life right now,\" Caitlyn Jenner told Matt Lauer. \"What a tremendous experience this is.\""},{"comment_id":"996887350366269","commenter_b":"Democratic Presidential Debate CLINTON vs SANDERS --- @webpagelink","commenter_a":"I drove 4.5 hours to Flint, Michigan, this week from Toronto, Canada, to volunteer my time on the @username campaign in the days leading up to the Michigan Primary. The people who work in Bernie's Flint office are passionate people with a strong desire to change America and help the people of Flint. I have actually never seen such an example of government neglect in my life. I spent a significant amount of time handing out water, door to door, and I still can't shake the feeling of being helpless - I felt helpless that I couldn't do anything to help them and I felt even more helpless that no one else was doing anything to help them either. I am not an American, but I know that America is better than this. No civilized society should allow hundreds of thousands of their own people to be neglected and abandoned ...","post_message":"The governor of Michigan must resign, but more importantly we must take action to help the people of Flint. Children in America should not be poisoned. The federal government must act. No one should pay a water bill for poisoned water. #DemDebate"},{"comment_id":"1686607741593351","commenter_b":"Morris @username For President Independent....Thompson say's \"I don't care about the F _ _ _ _ _ _ Wall\"! Under my plan I am going to enforce existing law that requires all employers document its employees right to work. There is an $11,000 penalty per illegal that will be used to pay for the deportation. Former Mexico President Vincente Fox I intend on overwhelming Mexico with illegals","commenter_a":"As they say in Espanol....p..... tu madre.","post_message":"EX MEX PREX: 'NOT PAYING FOR FUC*ING WALL'"}]
