[{"comment_id":"1008212159219442","commenter_b":"So....according to your thinking...If the CEO of a company steals a million dollars from stockholders....and a New CEO is elected, then it is the 1st one's fault if the new one steals 2 Million???","commenter_a":"Since Obama loves releasing terrorist from Gitmo - and \"trading them for Americans...looks like he could have negotiated a trade for these prisioners, afterall he did it for a deserter!!","post_message":"Iran continues to unjustly imprison and abuse at least three Americans: a Christian pastor, a former U.S. Marine, and a journalist. They must all be allowed to come home to their families immediately. This should be a condition of any potential agreement the Obama administration discusses with Iran."},{"comment_id":"1011733118888805","commenter_b":"Amen to that our children come FIRST","commenter_a":"So sad.","post_message":"We have NO ROOM! We need to take care of Americans first and make our country GREAT Again!~ FOLLOW US---> Freedom Daily"},{"comment_id":"722432601238848","commenter_b":"Idiot bitch","commenter_a":"No clue what-so-ever.","post_message":"She doesn't have a clue, does she? No idea how totally ignorant she sounds. --Andrew"},{"comment_id":"10153197495351378","commenter_b":"Why Yall want her to get charged so bad , ..Focus On them Cop killers niggaz","commenter_a":"Thats really strange... Ive never even heard that song!!","post_message":"VIDEO: A woman slammed on her brakes and then stepped out of her car while it was still moving in a bizarre crash caught on a dashboard camera. @webpagelink"},{"comment_id":"10153104580856162","commenter_b":"Them mfs is rodents. And the people who house these things are rodents too","commenter_a":"This is why you don't keep rodents as pets. Technically a ferret isnt a rodent but they are classified as meat eating predators. And who leaves a one month old baby un-attended?","post_message":"BABY ATTACKED: A 1-month-old baby lost a large portion of her face when she was attacked by 3 ferrets inside her home FULL STORY: @webpagelink"},{"comment_id":"10154262416956037","commenter_b":"Remember if you need some hot sauce Hilbilary carries it in her purse!","commenter_a":"Why? So this is the type of journalism Yahoo gives us after laying off 25% of their staff?","post_message":"Yahoo News reporter Hunter Walker is heading to the Trump Tower Grill for a Facebook live stream to get reaction to Donald J. Trump's Cinco de Mayo fiesta. Tune in soon ..."},{"comment_id":"10156390568200354","commenter_b":"Then why has socialism worked anywhere ??????","commenter_a":"No.","post_message":"\"...the word ‘socialist’ has become a dirty word.\""}]
