[{"comment_id":"1019752221480019","commenter_b":"@username then leave!!!!","commenter_a":"Trump does not represent most people in America and he certainly does not represent me. He may be in office 4 years, but I can guarantee you he will not be in another 4 years after that. We will have war in America because of this!","post_message":"President Barack Obama and President-elect Donald J. Trump just met for the first time — and this is what happened. @webpagelink"},{"comment_id":"10153669076314641","commenter_b":"Stop immigrant in Europe","commenter_a":"ISIS/ISIL/ the so called religious GROUP they r not MUSLISMS they created by americans & isreal 2 blacklash islam! ABOUT JAHADY JOHN as his from where he born said AN \"ANIMAL A DOG\"","post_message":"\"Jihadi John,\" who may have been killed in a U.S. airstrike, is a Kuwaiti-born, middle-class Londoner."},{"comment_id":"1564121906980885","commenter_b":"Such a nasty woman","commenter_a":"Ew","post_message":"😍😍😍 (Via Daily Mail Celebrity)"},{"comment_id":"10154228766276523","commenter_b":"All over being asked about a reusable bag?! How is that racist? Crazy woman.","commenter_a":"Wow. Fox 6 is really becoming a rag show. Too bad they used to cover the news.","post_message":"All this -- because she was unhappy after being asked about purchasing a reusable bag at the craft store."},{"comment_id":"1159562730832064","commenter_b":"@username what refugees ! Go back to Jordan !","commenter_a":"Haha.... What about millions of refugees whose right to return is banned by Israel? But o o no emotions for Palestinians? Why?","post_message":"Group travelers told to cancel reservation at lodging in Bavaria because they are Israeli."},{"comment_id":"484149281775652","commenter_b":"Get rid of him and his fat AZZ wife!","commenter_a":"Yes","post_message":"VIDEO: Kanye West cries racism after Beyonce loses... Kanye is a fool and a cancer, let's ban him from America. Do you agree Kanye should be banned from America?"},{"comment_id":"10153704706699170","commenter_b":"She got robbed! She should be #missamerica!","commenter_a":"Well, if their question was addressing 'gun related accidents', she was right on point. However, that was not their aim ( no pun intended) - their 'aim' is to ban weapons period. Their question does not address any of the mitigating circumstances that surround each of the recent incidences of gun violence and they know it. You can see it in the eyes and expressions of the questionners once Miss S.C. gave her answer.","post_message":"Wow. I don't think ANYONE was expecting this... Do you agree with Miss South Carolina's answer?"}]
