[{"comment_id":"10153072865096717","commenter_b":"She would get beat down","commenter_a":"I'm not surprised. The only person she gets along with is Q-Tip, and his single greatest contribution was a cameo on the Dave Chappelle Show where he told kids to \"do the VD dance.\"","post_message":""},{"comment_id":"10154157874771130","commenter_b":"@username Your comment shows you failed to do any research before blabbering...a familiar Trump trait. The Ukraine government was propped up by the Russian government at the time Manafort was dealing with them. It was Russian/Soviet Union weaponry that took the life of a cousin in Vietnam. I'm a veteran from the Reagan era and broke out in a cold sweat every time general quarters was sounded thinking Russia/Soviet Union had finally attacked us. From the day I first opened my eyes Russia/Soviet Union was my country's enemy. Today's Russian government mirrors the government of my former enemy and the GOP candidate praises their leadership and hints that we should crawl in bed with them...I THINK NOT!!!!!","commenter_a":"Well, this is not news; Dumbocrats support rigged elections not the popular support. I don't get it, why leftists are so stupid and dumb?","post_message":"Size isn't everything 😜"},{"comment_id":"10156932201230389","commenter_b":"Good answer. She is a sellout.","commenter_a":"NOT EVEN HONEST TO THE PEOPLE THAT PAY HER?","post_message":"David Webb: “Do you think Hillary Clinton’s honest?”  Answer: “I think she’s honest to the people who pay her.”  MORE: @webpagelink"},{"comment_id":"10153697405309712","commenter_b":"Libs can flush millions on social programs and illegal non-citizens, but get their panties in a bunch over a blimp downed for not paying \"air tax\".","commenter_a":"Ikr","post_message":"An Army surveillance balloon's escape seemed a bit of a lark, but the long running program has been beset by high costs, low reliability and questionable performance."},{"comment_id":"10154604674038690","commenter_b":"#Bilal_yema we terribly hate the western hypocrites who have kept Muslim lands occupied in Afghanistan!!! tell them to leave Afghanistan we Muslims will solve our own problems!!!!!","commenter_a":"Taliban means terrorist and terrorist means Pakistan Pakistan is cancer for the world","post_message":"Based on reports gathered by Al Jazeera from local police, security forces and the Taliban, here is a conservative estimate of the areas in Afghanistan that are contested, under the Taliban, and under government forces."},{"comment_id":"10153619360488132","commenter_b":"Your not a father!!!","commenter_a":"Jennifer Ramirez","post_message":"It was a very happy Father's Day for Caitlyn Jenner."},{"comment_id":"544427389064045","commenter_b":"Why we allow these Muslims remain in our country. If they hate our traditions, and our ways. LEAVE your ungrateful Muslims.","commenter_a":"Disgusting!","post_message":"Muslim Students Walk Out During National Anthem [VIDEO]  If don't want to show your respect for our country, you can leave.  Are you appalled by their blatant disrespect?"}]
