[{"comment_id":"1063081163723447","commenter_b":"Get em outta here!","commenter_a":"With all the hate in this country should the media be publicizing this to stir it up. Give those people a chance... They have had enough conflict.","post_message":"Eighty-two Syrian refugees have resettled in Ohio.   >>SEE what cities they have moved to: @webpagelink"},{"comment_id":"335857396538054","commenter_b":"There is no climate change that is your agenda","commenter_a":"Does this arrogant, smug, condescending community organizer and failed President REALLY want to compare resumes with the Donald? More evidence of how delusional he is and how stupid he thinks we all are.","post_message":"“I think foreign observers are troubled by some of the rhetoric that’s been taking place in these Republican primaries and Republican debates. I don’t think it’s restricted, by the way, to Mr. Trump.”  During a press conference earlier today, President Barack Obama slammed Donald J. Trump and other GOP presidential candidates while continuing to tout climate change. @webpagelink"},{"comment_id":"10153830910205695","commenter_b":"Unfortunately he's correct. Totes second ship found some things in the ocean that they believe belong to el faro","commenter_a":"It's obviously on the bottom of the ocean.","post_message":"Loved ones aren't giving up hope, despite a life ring being found."},{"comment_id":"10153810084117169","commenter_b":"Cornelia Gnutow Thompson","commenter_a":"The truth has a way of asserting itself. Thank God.","post_message":"News from NOVA l PBS:"},{"comment_id":"10153137548926051","commenter_b":"Obviously had to have his eyes closed, or blind to begin with!!! Maybe blind and she had a sexy voice!!! NAH.... Couldn't see something this ugly having anything sexy!!!!","commenter_a":"This unfortunate woman needs anger management & some AA meetings. A bit of dental work and make-up wouldn't hurt either--She was probably brought up in poverty. sandi","post_message":"When this woman's boyfriend refused to get intimate with her, she snapped."},{"comment_id":"1031885216864241","commenter_b":"no kidding wow","commenter_a":"Kerry is a moron!","post_message":"If only he could've predicted their reaction..."},{"comment_id":"1280286192042365","commenter_b":"^^^ That is porn for some women...","commenter_a":"Do some actually people make that face when looking at porn?","post_message":"Browsing porn on your smartphone requires more than just anti-virus protection.   Let us help."}]
