[{"comment_id":"1333566343323648","commenter_b":"this sow could stand to lose a few pounds.","commenter_a":"That pig in the black shirt ought to be able to hang on for quite a while...","post_message":"When it's all over and they have their ethnic studies degrees in hand, these student activists will never be hungry again."},{"comment_id":"872957136089257","commenter_b":"lol bitch...u aint smart","commenter_a":"Harashi Dang u get this pic? Lol","post_message":"Classic. ~Will  More photos at Afghanistan Combat Footage - Funker530"},{"comment_id":"10157872915845354","commenter_b":"Sadly, anyone can be an American these days, just run across the border or call yourself a refugee. Too many problems...","commenter_a":"I'd prefer \"firearmS\"","post_message":"Amen!"},{"comment_id":"10154978304691037","commenter_b":"How many more horny female teachers will yahoo report?","commenter_a":"Another ungrateful millennial.","post_message":"The 29-year-old will serve two years behind bars."},{"comment_id":"10154302631811234","commenter_b":"Wife ?.. haha I hope a woman or anybody would be smart enough to let u suffer in your own hate alone ... jump off","commenter_a":"There's plenty of jobs in colorodo also I haven't seen under $12 jobs even fast food starts at 10$ .. this one place said they would pay me $15 n up to start .. a pizza place .. but I have a degree .. I just like cooking but ever I need I kno where to go ..","post_message":"These employers left and took their jobs with them."},{"comment_id":"10154233003321336","commenter_b":"@username criminal actually the first foreign language spoken by illegals immigrants in the usa territory was English","commenter_a":"Donald Trump he's making our nation the laughing stock of the world but he is not the problem apparently in the usa there are a legions of racists misogynistics and fear filled ignorant people just waiting for a voice of lead and release them ,, he is not our shame the idiocy of some of our citizenry is our shame","post_message":"\"I've spent less money than almost anybody else and I'm in first place by a lot.\" – Donald J. Trump"},{"comment_id":"10153121950974641","commenter_b":"Oh really? Documented mental illness or zealous?","commenter_a":"Ohhhh good to know that! So, the ones to blame are those 150 victims for taking that plane!!","post_message":"Alps crash co-pilot suffered from severe \"psychosomatic illness,\" according to reports: @webpagelink"}]
