[{"comment_id":"1228736923813002","commenter_b":"poor womaan! jail is patently the wrong place for her....she requires help, not punishment!!!","commenter_a":"Monster.","post_message":"A 26-year-old woman on Monday expressed her indescribable pain and regret for the death of her newborn son whom she stuffed into a plastic bag after giving birth to him at her suburban Detroit workplace."},{"comment_id":"937893629592518","commenter_b":"men especially infantry like women.. all i can see this now is rape allegations and pregnancy going UP, that and men are biologically inclined to put a women's life first. thus taking away from the mission at hand.","commenter_a":"@username @username intentionally weakening our ground forces. Not because women can't hack it (most can't) but because they will be a distraction for the males and a logistical nightmare.","post_message":"#BREAKING: In a historic decision, the U.S. Secretary of Defense has ordered all military combat positions to be opened to women. STORY: @webpagelink"},{"comment_id":"1823696047877973","commenter_b":"She is just jealous.","commenter_a":"Rosie is a washed up loser who thinks we care what she says. We know exactly what and who this disgraceful person is.","post_message":"OUTRAGE...! Rosie O'Donnell TWEETS naked photo of Melania Trump when comparing her to other First Lady photos. WARNING: Nudity. @webpagelink"},{"comment_id":"500867293395381","commenter_b":"The Hilary Clinton article is free of facts and only says superficial things. I don't agree with her assessment.","commenter_a":"Israel has had nuclear weapons for more than forty years and has not used them. Instead of focusing on the mullahs who are intent on wiping Israel and the Jews off the map, let's focus on Israel. That makes perfect sense. Of course.","post_message":"While the conservatives try to get us to focus on Iran as a nuclear threat, guess where the real threat is hiding..."},{"comment_id":"916527265110193","commenter_b":"Rhyno - NO, dems did not control congress for the majority of Bush's presidency, you guys are so clueless..... it's the fault of those that pushed and developed it and demonized those not supporting it...... republicans did it, that pinch your cheeks thing again.....","commenter_a":"It is republicans that have forced Obama to keep the worst parts of the surveillance program going and to make it even more evasive. It is republican that created and pushed the surveillance state down our throats..... and they dare to point the finger at others for THEIR fascists policy.......","post_message":"“Such expansive development of government repositories of formerly private records would be an unprecedented contraction of the privacy expectations of all Americans,” the ruling said."},{"comment_id":"1527434820649594","commenter_b":"@username she's a cow","commenter_a":"They are like at least 5 articles about Kim Kardashian every day.. Kinda tired of this. She was robbed and shes still rich and has millions in the bank. Its not the end of the world. They are things & news that are MORE important than Kim's life!","post_message":"Kim Kardashian West's friends are rallying around her"},{"comment_id":"1232264963481332","commenter_b":"@username, you should read up on the case! It doesn't look good and she's only after what Trump would consider pocket change.","commenter_a":"Wait, Wait, Trump claims he never sexually assaulted anyone, \"I only spoke words, Bill acted\". but Bill was charged and cleared and Trump has been charged. Also, he is being charged with Raping a 13 year old girl. And I don't want to hear from Trump supporters that he \"innocent until proven Guilty\" because every single charge they've made against Hillary, she has not been proven guilty of.","post_message":"WOW. Trump has a lot of explaining to do... in federal court."}]
