[{"comment_id":"1513285485378585","commenter_b":"Mmmmmmmhm! I noticed that. Pussy","commenter_a":"How true","post_message":""},{"comment_id":"10153697157652098","commenter_b":"THIS ARE MAMA'S KIDS THEY NEVER DON NOTHING BAD, NO DRINKING, DRUGS, ROBE, HURT OR KILL SOMEONE, WHY THE POLICE DON'T SHUT ALL OF THEME ON THE SPOT, TAKE THEIR CARS AND NEVER LET THEM COME OUT OFF JAIL. EVER. BUT THEY GOT MORE WRITES THAN YOU OR ME. UNTOUCHABLE. IF YOU TOUCH THEM THE STUPID PROTEST WILL START.","commenter_a":"Nancy Jovana","post_message":"VIRAL VIDEO: A CHP vehicle was vandalized as an East Bay sideshow took place... DETAILS & FULL VIDEO: @webpagelink"},{"comment_id":"556876431104063","commenter_b":"Put a cap in her ass :-)","commenter_a":"I'll still bone her! Even with a mangled face! What's the point of the story?\"did you see her legs?","post_message":"The police state: before and after... The Free Thought Project.com (Y)"},{"comment_id":"10153228470879170","commenter_b":"Idiots abound everywhere","commenter_a":"Lol","post_message":"If only for comedic value, we hope these people are successful in their bid to \"Draft Joe Biden!\" ....Utterly crazy video included."},{"comment_id":"1024025567641378","commenter_b":"I voted Obama twice Glad I did too.","commenter_a":"Someone pass me the bong he's been taking hits from.","post_message":"Pres. Barack Obama takes swipe at Donald J. Trump's campaign slogan “Make America Great Again” by saying \"America’s pretty darn great right now.\""},{"comment_id":"10158142280770293","commenter_b":"A bankrupt city full of criminals... we will stay in Shelby county and spend our tax dollars in Shelby county... will not spend a dime there","commenter_a":"Hopefully they will lose all Federal funding for not following the Federal law. They need to be concerning themselves with NOT being in the top ten places that are unsafe.","post_message":"#BREAKING: The Birmingham City Council took a position on the travel ban by passing a sanctuary city resolution this afternoon. READ more on this developing story >>"},{"comment_id":"10154232902826600","commenter_b":"It's called hustle lady! Wtf? No it's called dirt bag thief. It's not hustle it's theft. What a douch.","commenter_a":"Just don't understand why people think it's ok to take things that don't belong to them...no freakin' values or morals.. Disgusting!","post_message":"She was taken into custody without incident after being found through social media tips and “old fashion police work.”"}]
