[{"comment_id":"1719965091608675","commenter_b":"Newt Gingrich said on Fox News last night that it is not we the people who picks who runs for president! Now that is one right out lie! It's like our government makes the rules up has they go! Hillary Clinton gets away with right out murder and Breaking the laws. But Donald Trump can't be our president because they know that all of there Dirty Work will come out for all of us to know and that is what they are scared of . Obama did not get enough delicates but they let him run for president and they new that there was a lot of people who where not for Obama. They just was scared of what the Black people would do if he was not picked to run for president. Well you better be scared of all of us people that is fead up with our government ...","commenter_a":"I do love Newt. stay the course Trump.","post_message":"\"Newt Gingrich on ‘Anti-Trump’ Republicans: Should Form Lost Republicans for Hillary.\""},{"comment_id":"1531352266898026","commenter_b":"\"She\" don't have dicks, its a he","commenter_a":"Can we please stop misgendering her?","post_message":"\"I had tits and a dick and was tattooed and alternative, and I could come over and over again on camera.\""},{"comment_id":"10152718156506051","commenter_b":"yea-their called street whores--oh-and get arrested sometimes","commenter_a":"Why don't people mind their own business?","post_message":"A man heard strange noises coming from a nearby car dealership. When he walked over to see what was going on, he couldn’t believe his eyes."},{"comment_id":"10153683983505575","commenter_b":"This country is OWNED AND RAN by Muslims.... Obama will make you accept Terrorist Muslim Refugees... There is nothing you can do about it,,, UNLESS YOU FIGHT his Civil war ( Marshall Law ) he is forcing upon you..","commenter_a":"I think it time .... all the state stand up to penis head... fight for our freedom of speech and rights to bear arms.... protect our U.S....","post_message":"BREAKING. . . ."},{"comment_id":"1690937014458022","commenter_b":"Stupid Swede!","commenter_a":"Another nut","post_message":"This is INSANE..."},{"comment_id":"1115809875115612","commenter_b":"So basically since federal funds cannot go to abortion services you are going to punish tens of thousands of citizens who rely on the other 97% of services that they offer. Nice job. I see you really are the pro life party.","commenter_a":"How can it be that after viewing the videos and seeing the sonograms that people can STILL only talk about the \"rights of the woman\"? How can that be? And the sad thing is the terrible damage abortion does to women and many men.","post_message":"BREAKING: The House has passed #HR3134, my bill to freeze all federal funding to Planned Parenthood. Grateful to every Member of Congress who stood for life and supported this compassionate measure. The fight is just beginning!  #ProLife #DefundPP"},{"comment_id":"1229557370394944","commenter_b":"The GOP doesn't like it when the democrats do to them what they had been doing to the democrats since Obama was elected.","commenter_a":"Games. . .ugh! Both sides need to just stop them!","post_message":""}]
