[{"comment_id":"10155553244070354","commenter_b":"Sit your dumb racist ass down and shutup AL shapton and pay the taxes you owe","commenter_a":"Wake up people! States better start secession proceedings. The 10th Amendment: \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\"","post_message":"First he fought the right, then he fought the cops, now Al Sharpton announces his plan to fight his toughest opponent yet: ....The U.S. Constitution."},{"comment_id":"10154077625056509","commenter_b":"Keep them out of America !","commenter_a":"Help thousands of Syrian kids and families! Take 30 seconds to sign (and hopefully share) this petition asking the US government to take in 65,000 Syrian refugees.We are almost there...we need your human support! Germany is expected to accept 800,000 refugees this year, while the US has accepted less than 1,500 thus far. Let's do a small part to encourage the U.S. government to be socially responsible. This is a humanitarian crisis and the Syrian refugees have nowhere to go. You can sign no matter where you are from. @webpagelink","post_message":"A call for Dr. Ben Carson to drop out: @webpagelink"},{"comment_id":"880543368756744","commenter_b":"@username ok women let karma take care of me .","commenter_a":"I hope the teen's parents pay for everything for what this family went through. Yes it is the parents fault for not controlling their little shits.","post_message":"The husband of the Ohio woman left brain damaged after teens threw a rock through the windshield of her moving car has committed suicide."},{"comment_id":"1404580556268355","commenter_b":"Highly inappropriate for her to attack a child like that. Grow up, woman!","commenter_a":"What's wrong with feeding a dog some vanilla ice cream? I seriously don't get it","post_message":"Said he 'already looked like a f****** d*******'"},{"comment_id":"10155769419940231","commenter_b":"My thought is this Ladies; the occurrences, that we are know seeing unfold are strategic! I hope that you will agree that the system has removed a majority of our \"Black\" men who would physically engage in battle with the injustices. They are being removed from society and that weakens us as a people. They are imprisoned for a greater length of time, killed in unlawful ways right in our faces (bullets in the back, strangled and held by more than one, ect...). A great majority of our women are now out and about alone and really can not defend themselves physically against the powers that be! In addition I see more \"Black\" women, more than ever going to be the next victims of murder. This leaves our children more venerable than ever before!","commenter_a":"It would of not been like that if a man was in the car with her!","post_message":"It may not be in the way that she thought she would, but she has, indeed, changed history."},{"comment_id":"1177291819033735","commenter_b":"Boy that was a huge crowd! 😂","commenter_a":"Good for you, kid!","post_message":"WATCH: A kid yells \"you suck\" at Ted Cruz. More here: @webpagelink"},{"comment_id":"10153881139329456","commenter_b":"Not Thugs , WORTHLESS TRASH!!!!! \\b","commenter_a":"Look all you people who argue what a thug is. Those two are thugs.","post_message":"Missouri police say the 2-year-old was left alone in his crib for 38 hours and reportedly died from hyperthermia."}]
