[{"comment_id":"1404580556268355","commenter_b":"Highly inappropriate for her to attack a child like that. Grow up, woman!","commenter_a":"What's wrong with feeding a dog some vanilla ice cream? I seriously don't get it","post_message":"Said he 'already looked like a f****** d*******'"},{"comment_id":"767530393325420","commenter_b":"If employers are fined and punished who hire illegals and no welfare benefits were given to illegals, they'd have no incentive to be in the US and they go home..","commenter_a":"Senate Democrats need to stop being obstructionists!!! Keep up the good work Congressman.","post_message":"If Senate Democrats aren't happy with the House-passed #DHS funding bill, then they should allow debate & amendments-- that is how our government is supposed to work. I fear that Senate Democrats are playing politics with America's national security in an effort to protect the President's unconstitutional #executiveaction and to protect themselves from having to go on the record with their pro-#amnesty positions. #DontShutDownOurSecurity"},{"comment_id":"422053507998163","commenter_b":"After entering into discussions with egocentrics on Abortion, I have concluded the following: 1) Egocentrics callous their minds by clinging to the term fetus. 2) Egocentrics ignore the dictionary primary definition of child, \"1a :an unborn or recently born person\". 3) Egocentrics refuse to acknowledge a child exists until it breaths air. 4) Egocentrics ignore that sexual consent includes consent for sperm and egg to join thereby forming a new human being in the uterus. 5) Egocentrics dehumanize the new human being (child) by hammering the label \"fetus\", completely ignoring the relativity of \" the fetal stage\" development of a child. President Barack Obama told a group that harvesting organs from humans that are killed was and a tradition that needed to stop. He warned of dehumanizing marginal groups of humans and of the problems that arise when are not able to see someone else as a human being.\" Based ...","commenter_a":"No I don't think so","post_message":"Planned Parenthood and the 3% Abortion Myth"},{"comment_id":"10155970638220354","commenter_b":"Megan Kelly is a jerk,","commenter_a":"Hehe!!!","post_message":"Donald Trump vs. Megyn Kelly? Fireworks are already flying!"},{"comment_id":"1229126323813780","commenter_b":"Reaz Tiths tell us what @username has quoted about that book of peace.","commenter_a":"Islam does not teach us to kill others. But in real it is a religion of peace, although some are killing innocent Non Muslims in the name of Islam. What a shame! Islam teaches us to respect others beliefs & not to insult them for their religion. This is the Islam I've been taught","post_message":"'One child said a Muslim prayer and was spared, the other was killed'"},{"comment_id":"10152925468786680","commenter_b":"Love is no ones business but the two who found it's bliss.","commenter_a":"Well, you could always just ignore it. Our government seems to be doing that alot lately. Like DC ignoring the Heller case.","post_message":"“It seems like the oppressor is now taking on the mentality of the oppressed.”"},{"comment_id":"550962398414284","commenter_b":"2","commenter_a":"Two(2)","post_message":"WARNING: This photo will make you feel like you have forgotten how to count. (via HelloGiggles)"}]
