[{"comment_id":"1039851232779934","commenter_b":"Leave the poor girl along. ..she's retarded","commenter_a":"No. She has been lied about for years!! Republicans can't stand a strong woman with brains!! Gotta tear them down. They prefer mindless, brainless twits like Michelle Bachman and Sarah Palin.","post_message":"Answer with a simple 'yes' or 'no': Is Hillary Clinton corrupt?"},{"comment_id":"10152989254431438","commenter_b":"Where are women who are frightened of a man in the women's room supposed to pee?","commenter_a":"How exactly do you prove you're a trans person?","post_message":"It's one of the most viciously sadistic, hypocritical bills the Florida legislature has ever considered."},{"comment_id":"425439057626422","commenter_b":"Can you imagine an entire supreme court of Ginsburgs? Elect Hillary and we'll have it. She is a wretched witch that is a discrace to the court and she's not alone.","commenter_a":"She woke up cranky from her nap.","post_message":"It was completely inappropriate for Justice Ruth Bader Ginsburg to attack Donald Trump’s candidacy. This is not the role of the Supreme Court, and it serves as another reminder of what we’re up against in 2016. Help me fight for the Constitution and protect the integrity of the Supreme Court by joining my Fight for the Court campaign. www.fightforthecourt.org"},{"comment_id":"1600332060187317","commenter_b":"she's a skank...","commenter_a":"Megyn seems to know that whether positive or negative, any publicity is good. Think about this Megyn, apologize to Trump and you'll be a headliner in all the major news outlets. .","post_message":"Megyn Kelly EXPOSED!!"},{"comment_id":"1716998008555343","commenter_b":"Me too. Can't concentrate at work","commenter_a":"Sleep in peace. You will be missed.","post_message":"This is what it sounds like when doves cry... #RIPPrince Prince"},{"comment_id":"10155217718349411","commenter_b":"Sanders is most sensible politician than other American leaders the only guy who is not a Zionist boot licker long live socialism Nothing wrong in being socialist , socialism is the best ideology that distributes wealth equally there is never extreme rich or extreme poor in socialist societies take examples from Danmark , Finland , Norway etc you see how well they are doing","commenter_a":"Donald Trump is your President! Because I'm American hispanic and I'm tired of how all of these coward racist liberals that hate America like Obama, and his supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, I'm supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of my skin... disgusting. That's why I and others support Donald Trump. Please support the movement by getting the \"Trump Strong\" t-shirt at:www.teespring.com/trumpstrong . And let's Make America Strong Again! Thank you.","post_message":""},{"comment_id":"497552493768664","commenter_b":"she can drop dead for all I care","commenter_a":"Irrelevant liberal rhetoric, out of the idiotic blathering mouth of a pitiful bitch who doesn know what damn day it is....","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"}]
