[{"comment_id":"10153444104128690","commenter_b":"Americans breed Christians at alarming rates... They have taken over.","commenter_a":"stop buddist terrorist!","post_message":"The group has stoked anti-Muslim sentiment by saying Muslim communities have high birth rates and will eventually overrun the predominately Buddhist country even though they currently represent less than 10 percent of the population. @webpagelink"},{"comment_id":"10154430815494497","commenter_b":"Also ,,!,, cuz the onion","commenter_a":"Can't believe they would make him do this @username","post_message":"Astronaut Suspects NASA Using Him To Test Space's Effects On Fat People"},{"comment_id":"10152910753726336","commenter_b":"Reality check!!!!","commenter_a":"REALLY! If you believe this I have beachfront propoerty to sell you in Arizona, can you say \"stupid Americans\"!","post_message":"Do you agree? #SOTU LIVE coverage: @webpagelink"},{"comment_id":"684314941708338","commenter_b":"You pussy","commenter_a":"A vote for Trump is a blatant vote for racism. I'm so embarrassed at the people who support such hatred.","post_message":"Skywriters' message for Donald J. Trump: \"America is great. Trump is disgusting,\""},{"comment_id":"10152976985741636","commenter_b":"some clothes are made smaller then others, i can buy jeans at one store that are size 14 i can go too another store that has jeans that are size 14, the same day and there too tight so my point is sometimes different stores vary greatly in size so you have to wear bigger sizes because of how they are made","commenter_a":"the problem with this story is this....the young girl was NOT directing her comment at anyone but the shirt itself. I am a larger sized woman and have done the same thing when I found clothes that were super large. It's not a slight to those who are larger than me and I'm sure it wasn't meant that way by this girl. If you are that sensitive by your size, then stay at home or do something about it. I have been called names my whole life because I'm not a size 2 or even a size 12. What others think of my size is none of my business. If they allow my \"size\" determine whether they want to know me or not, I don't care. It's their loss. I'm pretty freakin' awesome once you get to know me. I like me. I'm confident in who I am on the ...","post_message":"A photographer is getting a lot of attention after a picture in a dressing room went viral."},{"comment_id":"10155896308790354","commenter_b":"I don't know about you folks but I'm sure getting tired of these niggers.","commenter_a":"Buy them a fucken air conditioner, get the money from Jackson's Toyota ripoff !","post_message":"***THIS JUST IN*** The environment is racist!"},{"comment_id":"1049396555150863","commenter_b":"I thought you made a great partner to clint in fight movies rest in peace Jeff","commenter_a":"I like him. He was a good supporting actor. Underrated, in my opinion.","post_message":"Actor Geoffrey Lewis, known for his long working relationship with Clint Eastwood and for a slew of roles in television and film, has died at age 79. @webpagelink"}]
