[{"comment_id":"591336634387962","commenter_b":"Build the wall!!","commenter_a":"That's California for ya. I find nothing wrong with what he said in 1971. Things were different then. I said things in 1971. Does that mean I'm a racist today? I am military where everyone's color is either desert camo or woodland camo. I find affirmative action quite racist. Employers should be able to hire people because of their skills not because of the color of their skin. Absolutely ridiculous.","post_message":"California lawmakers refuse to honor John Wayne! and here's why..."},{"comment_id":"10153223558734726","commenter_b":"She has already stole enough","commenter_a":"She can just get over her self classless wonder","post_message":"WATCH: Obama: Michelle Upset She's Not Being Paid as First Lady"},{"comment_id":"1126887640660229","commenter_b":"If she's black, the barry is white !","commenter_a":"You will always be that lovable little fuzz ball, however you identify yourself!","post_message":"You know, I think I'm going to \"identify\" as skinny.  That way I will not have to ever go on a diet. I'm just gonna identify as skinny.  I just am.  You think I'm not?  Screw you!"},{"comment_id":"10152549413699071","commenter_b":"So true, reason why women throw themselves on celebrities","commenter_a":"Healthy man not attracted womens .attrating gods grace","post_message":"The most valued trait in a potential mate isn't beauty or wealth."},{"comment_id":"1508345139225610","commenter_b":"His wife has his balls..","commenter_a":"SEE THIS IS THE SHIT THAT HAPPENS WHEN WE APPEASE TERRORIST SUPPORTING NATIONS JUST LIKE JMMA(THE PEANUT BRAIN) CARTER AND BILL(I DID NOT HAVE SEXUAL RELATIONS WITH THAT WOMEN) CLINTOOOON DID,, NOW OBAMA IS DOIN SAME THING BUT THIS TIME HE HAS LET THEM GO NUKE,,,THEY PLAY WITH US BECUAS ETHEY KNOW OBAMA DOESNT HAVE THE BALLS TO DO ANYTHING SAD","post_message":"JUST IN:"},{"comment_id":"10154734900826509","commenter_b":"U know muslims r gangraping british girls in UK","commenter_a":"RIP europe, immigrants will destroy europe, it has started from turkey , so i request all people to visit europe before it gets turn into europistan , after there would be many restrictions of burqua etc. And be ready to see ETHNIC EUROPEAN MIGRANTS LEAVING EUROPE FOR ELESWHERE.","post_message":"Terror suspect Salah Abdeslam has been extradited from Belgium to France, Belgian authorities say. The Belgium-born French citizen faces prosecution there in relation to the Paris terror attacks in November."},{"comment_id":"948719421835197","commenter_b":"naw, the generation of things now being exposed more like it","commenter_a":"The generation of no personal responsibility.","post_message":"If this tactic works, we're a sicker country than I could have ever imagined."}]
