[{"comment_id":"1284514134973476","commenter_b":"CJ 😂","commenter_a":"Eric Sylvain 😂😂","post_message":"It really be like that  #WSHH"},{"comment_id":"559381210853585","commenter_b":"You only opt in because the choice is an illusion. Who reads the terms and conditions on anything online these days? Very few. I haven't thought of a solution re advertising, and the way things are going its only going to become more intrusive. The advent of neuromarketing is already upon us. The introduction of the 'reactions' facility on FB not excluded.","commenter_a":"I would try and read the enclosed article but the bombardment of ads, some obscuring the text, in the first 10 seconds put me off.","post_message":"Hint: it has nothing to do with preventing terrorism."},{"comment_id":"10154028327039411","commenter_b":"Might have a heart... But she has no brains.... Sadly without that.. She is and 326683984410ard like you :)","commenter_a":"Punished for having a heart and a conscience.....","post_message":"'Military jail frightens me less than our society losing its humanity'"},{"comment_id":"10153589357933984","commenter_b":"Just WHAT THE HE#% IS WRONG WITH AMERICANS, just like the poor Jews in Germany, we just sit back and let all this crap happen!!!","commenter_a":"Screw you","post_message":"The NAACP just made a stunning demand about this historical monument... this is shocking move.  Nobody thought they would go this far...  What do you think about the NAACP's demand?"},{"comment_id":"712967945491547","commenter_b":"Gals, you are missing the point.The birds ARE god","commenter_a":"Tom Beyer","post_message":"One of the prettiest scenes we've ever seen: A flock of starlings form spectacular flyover in Israel's sky (Video: Reuters)"},{"comment_id":"10152841390816491","commenter_b":"Men wouldn't would they!!!","commenter_a":"What the hell? Who cares? I mean honestly. Who the hell cares?","post_message":"“Every ounce of milk I’m able to produce for my child is nothing short of a miracle and to watch that milk be thrown away without any regard for my baby was heartbreaking.”"},{"comment_id":"10154720282189170","commenter_b":"B.S. She's campaigning for Hillary, and fighting for gun control. She's an adult who's inserted herself into the process. Don't want to take the heat? Stay out of the fight.","commenter_a":"She is not a politician. She should be left out of it.","post_message":"Wow.  Five bucks says Chelsea will do everything in her power to dodge this question in the future."}]
