[{"comment_id":"10154229049319369","commenter_b":"Being against Christians isn't a religion.","commenter_a":"I am against Christianity so that means I can not serve Christians in Mississippi because it goes against my beliefs?? This law is stupid.","post_message":"The measure allows churches, religious charities and privately held businesses to decline services to people whose lifestyles violate their religious beliefs."},{"comment_id":"10156250216360354","commenter_b":"Twisted woman","commenter_a":"So, she is trying to say she is with them as a fellow commie? I think someone farted.","post_message":"Yeah, so, um, this happened..."},{"comment_id":"10153412977987293","commenter_b":"Racist white lady alert","commenter_a":"I've never seen or heard of another president blamed for more things out of their control.","post_message":"It's not like he keeps a dais parked in front of the desk all the time."},{"comment_id":"10154379213963812","commenter_b":"Go back to Europe. Lol","commenter_a":"Go TRUMP build the wal!! Deport illegal all of em Ban muslims Lets make america great again! !!","post_message":"Donald J. Trump announced on Good Morning America that he \"probably will take small contributions.\""},{"comment_id":"1323090797735546","commenter_b":"Woman in prison","commenter_a":"Drain the swamp","post_message":"WATCH LIVE: Bernie Sanders speaks at rally here in Phoenix, Arizona at Central High School."},{"comment_id":"1213161752065703","commenter_b":"Report real news leave this story alone","commenter_a":"Do you realize that this constant back and forth over this story just reminds us that so-called 'journalists' in this age have NFI what they're doing? Being thorough is better than first, you all sound like a cross between TMZ paparazzi and the National Enquirer. Get a grip, you hacks.","post_message":"REAL OR FAKE? A Tennessee TV station stands by reports of a Santa's encounter with a dying child."},{"comment_id":"10152989497399099","commenter_b":"Impatient mother f'r, bc that's y those light and sign is there for, so they can cross safe.","commenter_a":"Smh","post_message":"A driver is accused of hitting a 6-year-old boy as he was getting off the bus and walking toward his mother @webpagelink"}]
