[{"comment_id":"10153966040516680","commenter_b":"Really Denny? Look back at this entire election process; every single act of violence was committed by the left, either A Bernie or a Hillary protester. EVERY single one of them.","commenter_a":"Tim like all rightwingers always blame someone else; it's SOP. This and other acts of violence is just a taste of what will happen if Trump is elected. Those prone to such acts will take it as de facto permission for violent acts against blacks, Latinos, Muslims, immigrants and of course their most hated enemy, liberals.","post_message":"“This act is a direct assault on people’s right to freely worship,” local authorities say."},{"comment_id":"733570513458390","commenter_b":"He wants to deport the Hispanics? We need to deport him with his team to Russia since they don't have anything to offer the nation. At least the Hispanics do all the dirty work in this nation.","commenter_a":"Politicians and Corporate thugs and bloated military spending.","post_message":"They're called politicians.  The Mind Unleashed"},{"comment_id":"10153652003074203","commenter_b":"he's going to destroy both political parties!","commenter_a":"Hes for real gonna destroy the republican party... and all of us love him for it","post_message":"One thing is pretty clear: Donald J. Trump isn going away for awhile."},{"comment_id":"10153839252314087","commenter_b":"@username He was a natural born citizen of the US and so was the LA Shooter who is from New Albany, Indiana. Why do you hate the Constitution, there is no racial component to citizenship. We must stomp out Christian and ISIS terrorism!","commenter_a":"I agree we must stomp out Jihadi and Christian Fundamentalism. The LA shooter was a Hoosier (Indiana). A disgruntled white man with fascist leaning aka the type of voter Loser Cruz tried to get but the Trumpster got. Is this un- PC enough for you gusano?!","post_message":"\"Enough is enough. What we need is for every American -- Democrat and Republican -- to come together, abandon political correctness, and unite in defeating radical Islamic terrorism,\" Ted Cruz said after the Orlando attack."},{"comment_id":"1381800741835583","commenter_b":"Smart woman makes Hillary look like ??? 😝","commenter_a":"Obama couldn't stand her, or for that matter, none of the democrats.","post_message":"Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe.Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe."},{"comment_id":"1699094263675768","commenter_b":"Let's review the facts: The shooter was a Muslim. He pledged allegiance to the Islamic State. He targeted people that patronized a gay nightclub in the U.S. Daesh executes homosexuals. Jihadis don't believe in coexistence and they don't spare pacifists. Oh, and you cannot reason with these savages. Questions?","commenter_a":"And Obama and Hillary want to disarm us and bring a hundred thousand of these kind of people over here","post_message":"Breaking News: Police say 50 people were killed and 53 were injured in the Orlando nightclub shooting and are asking the governor to issue a state of emergency.  Fox News can confirm that the gunman is Omar Mateen, 29, of Port St. Lucie County, FL, a US citizen of Afghan origin. @webpagelink"},{"comment_id":"10153393133746051","commenter_b":"the cunt should be dead","commenter_a":"Sickening. this teen should be in a juvenile detention center!!!!!!!!","post_message":"The police took one look at what happened to this little boy and immediately realized they needed to get involved."}]
