[{"comment_id":"10153042394211800","commenter_b":"Actually, the comedy part means the extreme feminists are being mocked...","commenter_a":"Gotta say I was very disappointed in this whole segment. Not because it was offensive or anything, but because it seemed to take what is clearly an issue (people taking up too much space on the subway) that can be caused by *both genders* (not just men) and acted like men were silly for thinking the ads were sexist by only targeting men. How much outrage would there be if there were a series of ads specifically targeting women for doing something that both men and women could do? Food for thought.","post_message":"\"Occupying all the territory you can is sexy. When I'm on a subway car with all those men taking charge of the seats around them, I get so weak in the knees that I can barely stand. But I have to.\" -- Kristen Schaal ► Kristen Schaal defends the right for men to spread their legs and take up two seats on the subway: @webpagelink"},{"comment_id":"10153459242386409","commenter_b":"That will teach him to open his big Mouth !!","commenter_a":"This is ridiculous","post_message":"A murderer serving three life terms for killing three people saw two more decades added to his sentence after a Washington State parole board considering his request for early release felt his crimes called for a harsher punishment."},{"comment_id":"10153784629291323","commenter_b":"So women are overly sensitive and need to \"man up\"?","commenter_a":"Actually, men do say and do the things they say on the internet in person to women, and the reaction by society and the bosses is about the same: yawn.","post_message":"\"If the things said by men to women on the internet were said by men to their female colleagues in workplaces, they would be fired. If they were said by men to women in public spaces, they would be removed [..] The belittling and bullying, threats and harassment, cyberstalking and outright hate speech directed to women on the internet every day is real-world behaviour with real-world consequence and it should oblige real-world punishments.\""},{"comment_id":"1026765060695063","commenter_b":"I'd whip her so hard she could only us that middle finger to rub her sore butt.","commenter_a":"No presents .........","post_message":"Utterly hilarious 10-year old drama! [Read below]"},{"comment_id":"10152991332957377","commenter_b":"He is a lot weaker. Building a WAll is a lot cheaper then paying for all the illegals and their so called benefits!","commenter_a":"jeb cant carry his own state.","post_message":"Jeb Bush fights back..."},{"comment_id":"1136350429757739","commenter_b":"She needs to excuse herself from this case.. this is a total conflict of interest!!","commenter_a":"Crooked ass administration...don't force us \"We The People \" have had enough","post_message":"What the WHAT?! This cannot stand."},{"comment_id":"527878314072059","commenter_b":"Put her in jail!!!!!!","commenter_a":"To recap: Hillary is \"the devil\" and has \"hatred in her heart\" and Trump is going to appoint a special prosecutor to \"put her in jail.\" This is how a democracy slouches into totalitarianism.","post_message":"Your reaction to the second presidential debate?"}]
