[{"comment_id":"1576897572597356","commenter_b":"The only \"racist\" in this picture is Whoopi ! Chip on her shoulder bigger than her ego!!","commenter_a":"It's time for her to go. She never has anything nice too say and she isn't funny anymore.","post_message":"Will someone please take Whoopi Goldberg off TV?"},{"comment_id":"10153111712291491","commenter_b":"Respectfully disagree. I like my women a pretty delicate flowers, but that's just me.","commenter_a":"She might be the all around inside/outside sexiest female of the 21st century!","post_message":"Ronda Rousey's next opponent: the box office."},{"comment_id":"685160361665842","commenter_b":"She must have needed something to have married this turtle.","commenter_a":"His wife will head transportation dept. or something. She is anti-union and for big corporations. Family does Business abroad. Her family gave turtle face around 25 million.","post_message":"Astoundingly dishonest."},{"comment_id":"10154917863094654","commenter_b":"Can women join this Club??????","commenter_a":"this is the best!!!","post_message":"Handlers of Pennsylvania's most famous groundhog are set to announce whether the rodent will predict an early spring or six more weeks of winter. More about the legendary Punxsutawney Phil @webpagelink"},{"comment_id":"1565960626752926","commenter_b":"With 12 to 15 million illegal Aliens in this country there is no way of knowing how many votes she got illegally.","commenter_a":"without California...Trump would would have won popular votes...snowflakes in cali...put on your diaper pin & pet a puppy !","post_message":"Hillary Clinton lost the presidency in 2008, she lost in 2016, she lost the 2016 recount, and she's gonna lose the Electoral College today. Four times Hillary Clinton has lost the presidency in eight years, a modern American record."},{"comment_id":"10154048103696409","commenter_b":"Hey Betty eat a dick","commenter_a":"Lovely Family ! May God continue His Blessings on them!","post_message":""},{"comment_id":"10153676011437093","commenter_b":"I'm highly educated and make my decisions based on research and personal conviction. I am 100% against abortion used as birth control (not medically necessary terminations). I will never give up my rights to bear arms. And I find your tone patronizing, but that's nothing new. I won't vote for HRC because she is the reason my brothers are dead from Benghazi, she never owns her bad decisions and she cuts out the millions of Conservative women in her views.","commenter_a":"The entire DNC has spoken in this convention as though we millions of Republicans aren't even part of America. Can't wait until he is gone and Trump is our president!","post_message":"President Obama encourages Democratic Convention crowd to do more than boo Donald Trump. #DemsInPhilly @webpagelink"}]
