[{"comment_id":"10152697342252894","commenter_b":"Having a major craptastical, mitch, attituded 24/7 365 makes him a loser!! He is a jack hole!!","commenter_a":"Father, CEO, 100+ million in album sales from his music production (Jay-Z, Madonna, Mariah Carey, Ciara, Janet Jackson etc.), 30+ million in album sales and 21 Grammys. Being successful makes someone a loser? Ok","post_message":"Petty! If You Visit Loser.com, It Redirects to Kanye West's Wikipedia Page"},{"comment_id":"10153318936789087","commenter_b":"He sure is blowing minds. LOL @webpagelink","commenter_a":"Cruz has no idea what he is talking about.","post_message":"“Why would you then bail out rich Wall Street banks and not Mom and Pop?” Ted Cruz  asked John Kasich as they sparred over bank bailouts at the #GOPdebate."},{"comment_id":"931492536967525","commenter_b":"Lying BITCH...who only worries about her bank acct....NOT...American LIVES. She can't even control her Husband. Good thing he keeps Monica handy.","commenter_a":"Liar","post_message":"ClashDaily.com"},{"comment_id":"1803773783230243","commenter_b":"This woman is nuts.","commenter_a":"Too bad she failed to get the same treatment for Hillary Clinton.","post_message":"Dems are already talking Impeachment.  Check out this load of BS."},{"comment_id":"10154283340572061","commenter_b":"You need an education woman. The president has already spoken. People like you really scare me. Your like a lose cannon with no direction, hurting the innocent! I don't agree with you but would never think of slamming you or causing you hurt. Everyone needs to figure out how to get along or there's not going to be a world to live in for any of us.","commenter_a":"Where are words from the president? Words, that's right, he has a short vocabulary. He can't say it's going to be great, really, really, great. When I tell you, it's going to be yuge. Sad America, when disaster strikes, your president is somewhere eating caviar sulking about his weak inauguration numbers. smh","post_message":"At least 16 people have died over the last 48 hours due to tornadoes, as a violent system of storms works its way across the Florida Panhandle and parts Georgia and Alabama: @webpagelink"},{"comment_id":"1664084467202646","commenter_b":"Then I would campaign for congressional term limits Allow the country to decide if abortion is to be legal or not. The same with gay marriages. The supreme court should not be involved in these maters. If the is challenged and reversed. So be it. I would not allow mass illegal immigration. Illegal is wrong by definition. As to radical Muslims. Not welcomed. Peaceful Muslims who migrate legally are welcomed as long as they assimilate . And do not try to impose sharia law. This country has its laws made by its citizens. If you come here. You need to assimulate. I would ask for voter IDs. Driver license are not proof citizenship. Sorry.","commenter_a":"I would dump Obama care and replace it with something that makes sense. Eliminate the following depts. Education, environment and agriculture. TSA homeland security plus the irs. Treasury dept can handle collecting a flat tax. Eliminate the federal minimum wage. No need for the federal govt to be involved in these areas. Then I would walk away from the Iran nuke deal and global warming. Bad policies. Then I would invite the Mexican president to the white house and bitch slap him. Cut the budget across the board by 10% for each of the 1st 4 years Have a flat federal tax of 17.5 on everyone. Period. No deductions. Nothing. Flat. Period. I would then review all of BHS executive orders and reverse or modify what I decide what is needed.","post_message":"If you were president what is the first problem you would address?"},{"comment_id":"10154492654832690","commenter_b":"@username Your belief in polls probably left you disappointed on November 8th didn't it? SMH","commenter_a":"Who actually goes to an inauguration? Ask how many people are happy Obama will no longer have any control. Your poll will be more meaningful.","post_message":"Are you going to President Trump's inauguration?"}]
