[{"comment_id":"1765051320401865","commenter_b":"Trump gave a rousing speech to cheers and shouts. Just checked in at Fox programming and all they have is same regurgitated talking heads spouting how bad this last week has been. I'm sick of seeing same boneheads saying same thing EVERY show. ME TV reruns from now on!","commenter_a":"This is what the people want Trump any Republican that does not support him is not supporting the people of America who choose him","post_message":"\"In our shared mission to make America great again, I support and endorse our Speaker of the House, Paul Ryan.\"  Donald J. Trump endorsed Ryan at a rally in Green Bay, while also endorsing John McCain and Kelly Ayotte in their reelection bids, after earlier comments implying he might withhold his support."},{"comment_id":"835498176546436","commenter_b":"Deb... Your name Is tasty.","commenter_a":"Was he speaking to an empty chair? I can't think of anybody else who would or should listen.","post_message":"The director has spoken."},{"comment_id":"1728040457449467","commenter_b":"She is bad to the bone","commenter_a":"She is bad to he bonem","post_message":"“Here’s Hillary Clinton campaigning in favor of women, while the foundation that she and Bill own pays men 38% more than women.”  Newt Gingrich shared some shocking statistics with Sean Hannity regarding the Clinton Foundation."},{"comment_id":"1241057529263037","commenter_b":"All those upset by the depiction of a multi-racial family should investigate their own DNA. One can only wonder at their stupidity and self-loathing!","commenter_a":"Well done State Farm.....","post_message":"Can you believe this?"},{"comment_id":"10153697709133984","commenter_b":"He'd never make it to prison if that was my daughter or granddaughter. But since he will hopefully go to prison, its a shame someone never showed him an illustration on a blackboard about the size of your asshole before prison and the size it is when/if you get out. Maybe he would then have had sense enough not to rape a child. When he goes to prison he's going to find out what real rape is like...good.","commenter_a":"Castration sounds good to me. He wouldn't do it again","post_message":"This sick punk raped a young girl and admitted to it... but the disgusting thing is his absurd excuse.  Our country is in deep trouble and this proves it... this little girl did nothing to deserve this."},{"comment_id":"10153241305633984","commenter_b":"Stupid bitch ,,,,,","commenter_a":"Shes fucking retardes","post_message":"Wow. She is NOT doing herself any favors...  Are her critics right to be outraged?"},{"comment_id":"908720232539273","commenter_b":"Oh Mr Trump , I personally can not wait for you to be our New PRESIDENT! All these people saying they are going to leave, I sure hope they do , to bad you can not make it a law that they have to, American might just be s better place without these people. You raised 6 million for the vets what did these people do ??? Besides complain they need to put their energy towards something positive instead of trying to find negativity. Great Job Mr further PRESIDENT TRUMP","commenter_a":"idiot,trump cant do any worse than dumb obama n our stiupid ripoff goverment'get real","post_message":"A majority of people said they would go to Mexico."}]
