[{"comment_id":"10152984478206130","commenter_b":"That woman looks so pissed in every photo I have seen of her lol","commenter_a":"There is no \"key\" to living a longer than average life span. It's all about good genetics and being healthy","post_message":"“I feel good. I don’t feel sick. I’m still trying to do the right thing is all.”"},{"comment_id":"1718297721743930","commenter_b":"Lmao","commenter_a":"Lmao....stupid. but let's give them $15 an hour @username @username","post_message":"PRANKSTER: Someone called a Minnesota Burger King and convinced employees there was a gas leak - and they needed to smash the windows to release the pressure. So they did. STORY: @webpagelink"},{"comment_id":"842641039186009","commenter_b":"Do that to me, and I would turn you into a girl!","commenter_a":"What a bunch of cowards that's what we need not","post_message":"Here's the 'poor refugees' just looking for a 'better life' as they piss on women. Check this out... @webpagelink"},{"comment_id":"10153152962811323","commenter_b":"It doesnt apply both ways. It says it does but woman are malicious and always get their own way.","commenter_a":"Good. And what about divorced men who have brought up the children while the wife goes off to make her fortune without contributing to the children's upbringing?","post_message":"\"At last! The supreme court has just rocked the apple cart of unequal divorce. It has pronounced that being a parent is an obligation that lasts. Even if one parent is no longer around, for better or worse their fortunes are inextricably bound together. Particularly if those fortunes are for better.\""},{"comment_id":"10154011637299062","commenter_b":"Either way she is screwed...hopefully they catch these horrific criminals soon!","commenter_a":"Hmmmm wonder if they plan to murder her now?","post_message":"She \"allegedly intended to be the men's getaway driver but got cold feet and failed to show up at a rendezvous point.\""},{"comment_id":"10153573907066509","commenter_b":"She couldn't bring women down, only herself!","commenter_a":"I don't want to swear.... but.....way to go bringing the equality movement down a peg! !!! You really didn't think that one all the way thru!!!! :(","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"},{"comment_id":"955482931153795","commenter_b":"I think everyone should mind their own business,it's between God,her and gays. Don't you think ? Stop throwing stones. So much going on in this world.","commenter_a":"Amen Rev. Franklin Graham","post_message":"Every American must see what Rev. Franklin Graham just said about the arrest of Kim Davis!"}]
