[{"comment_id":"10153967226386756","commenter_b":"Don't they have strict gun control laws? The criminals don't follow these laws? Shocking!","commenter_a":"Here are the huge protests over this? Why is the black community not absolutely outraged by this?","post_message":"These stones are a handful of those youths killed in Chicago. Diane Latiker of Kids Off The Block, Inc. (KOB) is trying to keep more names of children off the wall."},{"comment_id":"10153982345631162","commenter_b":"Lol at the lady that thinks Chicago is Houston!","commenter_a":"Well the store has a history of getting robbed at gun point. Also note, armed robbers have been killed in the past trying to rob this store. Its best not to try to stick this place up anymore. Matter of fact, why not obey the law and not stick up any stores.","post_message":"EMPLOYEE SHOOTS SUSPECTS: Two men were killed after police say they attempted to rob a liquor store when an employee opened fire at them - Diane Pathieu ABC7 is live with more: @webpagelink"},{"comment_id":"10153464372430667","commenter_b":"Of COURSE you do, feminazi.","commenter_a":"Joe Biden didn't seem to give much credence to Anita Hill. Perhaps he could find a way to remove Clarence Thomas?","post_message":"Part of the pledge: To intervene in situations where consent has not or cannot be given."},{"comment_id":"1115117555187217","commenter_b":"Jette de Vries","commenter_a":"Nathalie Baranke","post_message":"If you have a cat you should do this immediately. (Via JukinVideo )"},{"comment_id":"10153963833427212","commenter_b":"She hit him too.. He should have walked away, but she is not innocent....","commenter_a":"I will never condone a woman's bad behavior however I will not condone a man laying hands on a woman. I believe in self protection but, I don't blame her for wanting to block this and I do blame him for his assault on her. He apologized and they delayed it long enough that the statue of limitations applied so why people will always defend a man and an athlete just because they are is quite pathetic. Women are always scapegoated to be the reason they got hit or assaulted and worse of all by women!","post_message":"ICYMI: Amelia Molitor, the woman OU running back Joe Mixon punched two years ago, filed a new motion to block the release of the assault video on Thursday. #News9"},{"comment_id":"1230461060352731","commenter_b":"Finish your comment. What type of women are these?","commenter_a":"I'm actually quite amazed at the amount of women attempting to justify this. As if abusive culture isn't hard enough on you. Just wow. Like demographic though.","post_message":"UPDATE: According to Rolesville Mayor Frank Eagles, the officer seen slamming a student to the ground is school resource officer Ruben De Los Santos, who has been placed on paid administrative leave. Follow this story>>wral.com/@username/"},{"comment_id":"1909759522584421","commenter_b":"Isn't that Gail, Oprah's secret girlfriend ? She's a racist along with Oprah.","commenter_a":"Go back to Oprah!","post_message":"CBS acted like #BlackLivesMatter's personal PR group."}]
