[{"comment_id":"1360351430654310","commenter_b":"Thank you for your vote of confidence but as of right now my focus is on college classes and getting my degree ASAP .","commenter_a":"Oh god I hate her . She is such a hypocrite. She calls us snowflakes for complaining but her job is literally to sit behind a desk and complain about things she doesn't like . She is the biggest snowflake of them all ( next to lord twitterfingers of course ) . For someone who's a millennial and who \" doesn't like labels \" she sure does like to label everyone else . She's not even a real journalist, she is a glorified YouTube personality .","post_message":"She came after Meryl Streep  and that was the last straw."},{"comment_id":"317547525326742","commenter_b":"To pay the illegals","commenter_a":"GREAT NEWS!! You just keep spiking those taxes..why stop there..RAISE TAXES ON EVERYTHING....YOUR GOING TO NEED IT! Besides..dont you left winged morons believe in taxing yourselves into welfare?? Good job!! GO CALIFUCKUP!!","post_message":"Robbing Peter to pay Paul..."},{"comment_id":"1676347295991211","commenter_b":"Of course she would praise him. He is a lying louse like her husband.","commenter_a":"Libtard !!","post_message":"Michelle Obama is sending a message to Donald Trump."},{"comment_id":"1260437270671484","commenter_b":"come on something good has to happen, we had a failed bomb in a car earlier","commenter_a":"El mi nomas cesar godinez ok pinches lacras puro blu cabrones","post_message":"BREAKING: Police pursuit in Palmdale, CA (Viewer Discretion Advised)"},{"comment_id":"10154584590253812","commenter_b":"HILLARY TO WELCOME 1 MILLION MUSLIMS IN 1ST TERM Clinton's plan to expand refugee resettlement could cost U.S. taxpayers over $400 billion","commenter_a":"So we are being lead into war against each other and to blind to see the obvious of what is happening. When we need to be standing together fighting against these foreign countries and what we have been fighting for way before our time. Instead of allowing the color of your skin be an issue and using it towards one another. If you have so much hate use the energy towards standing up together fighting together working together and being there for one another to stand strong and conquer these hard times. We are giving in to everything we have fought to protect and save. Stop fighting against one another and fight for one another. Stop allowing this society to break us and the government to control us. Stop giving the enemy what they want and give them what they deserve. Stop being that slave to the government and allowing ...","post_message":"President Obama in comments on Nice attack: “These terrorists are targeting and killing innocent people, including Muslims.\" @webpagelink"},{"comment_id":"10153394655753908","commenter_b":"is anyone here surprised by this information?","commenter_a":"Get a grip","post_message":"For those who haven't seen this yet. \"Ever single terrorist attack in the US was a false flag attack.\"  There is a tremendous amount of research to back up this statement."},{"comment_id":"1788072574740832","commenter_b":"jesus Christ those girls look petrified","commenter_a":"@username @username 😱😱","post_message":"Parents in remote parts of Malawi are sending their daughters to be sexually initiated by local men - called \"hyenas\" - when they reach puberty. Meet Eric, he’s proud of his role as a \"hyena\". Learn more from BBC News Magazine: @webpagelink Listen to the documentary: @webpagelink"}]
