[{"comment_id":"1179263908762059","commenter_b":"моод дэлгэрүүлж дээ... хэхэ...","commenter_a":"Jargalsaihan Mandakh, @username...","post_message":"Watch over 100,000 people swarm this public beach in China."},{"comment_id":"1501229893270468","commenter_b":"IDIOT!","commenter_a":"I want to hear her say it 2 minutes into the stoning. Damn liberals are stupid.","post_message":"Has she LOST her freaking mind!?"},{"comment_id":"10155756776370615","commenter_b":"Refused. By Faux News? Well, it is official, her fifteen minutes are over.","commenter_a":"One sick puppy","post_message":""},{"comment_id":"10153699132454060","commenter_b":"Do you mean the hate speach espoused by the feminist campaigners? Such as the hashtag killallwhitemen and maletears","commenter_a":"hate speech is hate speech. We must identify and stop it.","post_message":"“Just because you lop off your dick and then wear a dress doesn't make you a fucking woman.\" Hate speech or just offensive? Cardiff University students think the former"},{"comment_id":"10153575697359087","commenter_b":"I love American Politics... Hillary Clinton is the People's Champion yet she Support the 1994 Massive Incarceration Bill, the 1996 Welfare Reform that double poverty in America between 1996-2001, 1999 Glass-Steagall Act which caused the 2008 Financial Collapse and NAFTA which as a result 70,000 Factories and millions of Jobs have gone Overseas... But hey she can't be judge on her RECORD because she is a Woman and that would be SEXIST...","commenter_a":"This is a garbage article by not even mentioning Bernie Sanders.","post_message":"\"Donald Trump versus Hillary Clinton in November? Don't bet on it.\""},{"comment_id":"10154088282393145","commenter_b":"@username, if we could just have put a wall up around the DNC convention center, we'd have a great start catching many of the illegal immigrants.","commenter_a":"Didn't See any American Flags on stage or anywhere anyone else notice that I guess showing pride for our country is out the window if your a democrat","post_message":"She took some hard digs at Donald J. Trump and didn't even mention his name. What did you think of her speech?"},{"comment_id":"940585612654173","commenter_b":"Aleeyah your FB page is wacked out!! Girl I feel sorry for your kid. Get yourself some help. God don't like ugly!!","commenter_a":"Whitefolks did the same thing to Black Slaves, yes it is demonic and insanity. Look whom and what rule we have been unjustly livong under. The girl is showing the affect of what she was taught and learned from her step forefathers the Slavemasters children.","post_message":"Mother accused of intentionally setting her newborn baby on fire enters a not guilty plea, will undergo a mental health evaluation: @webpagelink"}]
