[{"comment_id":"10155793831095354","commenter_b":"Good. There are plenty of beautiful conservative women.","commenter_a":"LET HER GO","post_message":"'Mexicans, like all Latinos, contribute positively to this great nation. We are the force that keeps the country afloat.'"},{"comment_id":"462985670577219","commenter_b":"I'm not pro 15, but we need to realize automation would have occurred with or without a min wage hike anyway. This just hastened it. The problem is most jobs can be made automated including yours too. I don't support give intervention but when pharmacists and construction workers find themselves out of jobs there made need to be some government regulation saying no to so much automation in the future. Human labor being supplemented by robots is not only a minimum wage concern, but one for everyone.","commenter_a":"They got what they wanted, you can't blame Wendy's. Or Wendy's could change the 'Dollar menu' and make it 'Five dollar menu' then maybe they could afford to keep all the help, but then nobody could afford to eat out. Oh well","post_message":"Congratulations, Democrats! Your push for a $15.00 an hour minimum wage has resulted in the destruction of Wendy's jobs at 6,000 stores!    '...we work to offset any impacts of future wage inflation through technology initiatives,' said Wendy's."},{"comment_id":"1084003008332003","commenter_b":"#VOTETRUMP AND BUILD THAT WALL!!!!","commenter_a":"Melania will have the last laugh. She is smarter and prettier than this idiot, not to mention more accomplished and wealthier.","post_message":"Unreal..."},{"comment_id":"1807363586202385","commenter_b":"Yes WE NEED TO LOCK HILLARY AND HER FRIENDS UP!","commenter_a":"Hell yes !!!!!!!","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"10154051789570326","commenter_b":"There ARE alternatives for oil. There is NO alternative for clean water.","commenter_a":"Tell it to the people in Arizona . . . How'd you like this coming out of your tap? @webpagelink","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153845645645871","commenter_b":"I would say that since both ladies are jewish and liberal, they don't really care about the women who are raped, stoned, disfigured and killed because they are Muslim. I believe ini just telling it like it is.","commenter_a":"Have any of you followed Naomi Wolf's facebook page? I have for the past couple of years. She's an anti-Israel bigot, and she ignores women's issues whenever they involved Islam. I called her out on it many times. Here's an example.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10155589079690354","commenter_b":"both pigs","commenter_a":"Odd is right Tyranny lives","post_message":"Adorable...."}]
