[{"comment_id":"1711261402459148","commenter_b":"Hilly would be in the slammer if she wasn't in the cartel","commenter_a":"BERNIE","post_message":"Chaos on the convention floor as the Stop Trump delegates chant for a 'roll call vote.' RNC officials officials denied the roll call vote over the rules.  Fuill convention coverage: @webpagelink"},{"comment_id":"10154183744199091","commenter_b":"She is a baby killer","commenter_a":"Trump belives in God and life & Americans clinton she is evil she is for aborting a baby in late term open borders allowing evil in our country no I voted Trump.","post_message":"Who do you think will be the next president of the United States? Send us a blue thumbs up for Hillary Clinton or a red heart for Donald J. Trump."},{"comment_id":"637619693095276","commenter_b":"Lock her up","commenter_a":"ITS FUCKTARDS LIKE YOU THATS FUCKED THIS COUNTRY UP ,, AND THE LIVES OF YOUR KIDS !! G E T T O T R A S H. !!","post_message":"This woman is bragging about stealing your tax dollars.  Disgraceful. She should be kicked off welfare and be forced to pay us back immediately.  Do you agree we should kick her out of the country?"},{"comment_id":"10153135572561323","commenter_b":"Pigs dirty cunt. Shut your mout bloody pig","commenter_a":"BBC News's journalist didn't have any story to write about Britain's own daughters? Those 1400 plus little girls who were repeatedly raped at the hands of Muslim grooming gangs for over a decade? Why couldn't she manage to that in her own filthy backyard which even produces terrorists who are raping and killing women in Syria & Iraq? Why did she feel that it was her duty to make a celebrity out of a rapist? Besides, the swines who are crying here for her are the same swines who objected to capital punishment for the rapist; who are now making money publishing stories of Nirbhaya. The pimps in Indian media who are talking about this are the same swines who objected to death penalty for the rapists. @webpagelink","post_message":"'It was not rape, but my reaction was too involuntary, and its intensity too high, to say that nothing bad happened. Something happened. And it had the whiff of rape. I suspect many of you reading this will be eager to tell me what happened...'  A challenging, deeply personal piece about why we need to talk about sexual assault in all its forms."},{"comment_id":"649524331880703","commenter_b":"She and Bernie are behind these riots. Why do we listen to her? She is a liar!","commenter_a":"You got that all right. Randy Webster","post_message":"Disappointing to hear."},{"comment_id":"520985371427355","commenter_b":"Come get it I live in bend oregon I will be waiting","commenter_a":"come and take it buckwheat","post_message":"They are demanding that we give them money for their ancestors slavery. 'LIKE' if you will REFUSE to pay slave reparations!!"},{"comment_id":"1089539017791300","commenter_b":"Hillary belongs in jail! Do your job Congress.","commenter_a":"I would think about why she dosen't answer the question","post_message":"This state rep took a huge stand against Hillary and even called her out at one of her rallies.  But the rep had no idea what she had gotten herself into.  Now she says she carries a gun because of what Hillary's goons have done to her."}]
