[{"comment_id":"1309663882411384","commenter_b":"Thank you! Someone with a little logic about the abortion! It should not be tax payer funded and it should NoT be past 12 weeks and it should not be used just because some idiot woman didn't use birth control and doesn't wanna deal with the consequences of her actions !","commenter_a":"I can not believe that abortion is a right to be discussed in 2016. It is a womans right to decide! It is our bodies!! As long as it happens before the 12th week...but women need to use their head and not use this as birthcontrol! Protect yourself if you don't want a kid! As I said, it is 2016 and we do have many types of birthcontrol!","post_message":"Obama's last stand"},{"comment_id":"10153977079018717","commenter_b":"@username i agree there certainly is an issue which needs to be on a high priority list.","commenter_a":"Come on everyone!! Cut the crap!! Humans lives matter!! Nuff said.","post_message":"The owners thought it was a good idea at the time, but a slogan for a restuarant menu item has turned into a controversy!"},{"comment_id":"1008212159219442","commenter_b":"So....according to your thinking...If the CEO of a company steals a million dollars from stockholders....and a New CEO is elected, then it is the 1st one's fault if the new one steals 2 Million???","commenter_a":"Since Obama loves releasing terrorist from Gitmo - and \"trading them for Americans...looks like he could have negotiated a trade for these prisioners, afterall he did it for a deserter!!","post_message":"Iran continues to unjustly imprison and abuse at least three Americans: a Christian pastor, a former U.S. Marine, and a journalist. They must all be allowed to come home to their families immediately. This should be a condition of any potential agreement the Obama administration discusses with Iran."},{"comment_id":"1741973229385885","commenter_b":"Cus your race isn't nearly as low as the natives or Jews and why do you think you deserve it the Jews didn't get land they might of got paid....but I witness frist hand blacks recive way better benefits then whites or natives.... so natives got land Jews got money blacks got freedom with rights along with benefits what makes the blacks so special to recive more","commenter_a":"Of course, it's okay for them to be racist, but when white people say something we get beat up. Love hypocrites","post_message":"Brian Ogle's mother says her son responded to students wearing Black Lives Matter T-shirts at his school with \"Blue lives matter,\" a defense of police officers. Officers found him bleeding on the ground after a homecoming football game."},{"comment_id":"10154174646349641","commenter_b":"That is so primitive to cage a living being and then let the others watch the poor thing. This is absolute human lowlesness as I call it, the worst specie in the entire universe for sure ! I hope humans will not go to outer space and colonize other planets and do the same thing what they did on Earth !","commenter_a":"Poor gorilla! Yes I agree the irresponsible parents are at fault for this incident.","post_message":"Ian Redmond, Chairman of The Gorilla Organization, said keepers had other options besides a fatal shot."},{"comment_id":"1754512868165576","commenter_b":"Hillary will follow him ..........because she also wants Muslim invasion in United states.","commenter_a":"Barack Obama is the worst president ever in the history of the United States of America","post_message":"\"I fully expect by tomorrow morning that President Obama will ... give a press conference in which he'll explain that the problem is too many trucks. If only we had truck regulation then we wouldn't have problems like Nice, because it is trucks that are dangerous.\" – Newt Gingrich"},{"comment_id":"10152729165306051","commenter_b":"Why , is a pig smarter?","commenter_a":"I am offended that they are catered to. I love pork and will continue to eat it unless my doctor says not to... then I may eat it any way. No religious cult will tell me what to or what not to eat, wear, pray, etc.","post_message":"This publishing house just banned all references to sausages or pigs because they offend certain religious groups."}]
