[{"comment_id":"483898831770072","commenter_b":"@username Whoa, calm down woman.","commenter_a":"They could just import it from Iran. I wonder what's stopping that great deal?","post_message":"Italian caviar, that is."},{"comment_id":"10153997229702042","commenter_b":"You ladies don't have knees or you like the attention... Knee to the groin!!","commenter_a":"Get him off the streets","post_message":"Police are looking for this man who allegedly groped and rubbed his groin against a subway rider on the train. \"SHARE\" this post to help police find this man."},{"comment_id":"10154551576694030","commenter_b":"White people love mayo and ranch. I lovvee ranch bruh.","commenter_a":"I didn't see this as particularilly white. Like people of color don't use mayo?????","post_message":"You can't help who you are. Kyle Kinane's Loose in Chicago premieres tonight at 12a/11c."},{"comment_id":"1060964983967782","commenter_b":"I am a woman and I think your ugly Megan","commenter_a":"I think the evidence clearly shows she was moved away. Not beaten or mauled just moved away. Seems like a job hazard to me.","post_message":"\"This is the Trump campaign, where lies are told and then lies are told to cover up the lies, and then finally new lies are told in order to cover up the lies that were told about the lies,\" Ben Shapiro said."},{"comment_id":"10155910750959062","commenter_b":"She should have thought about her baby before she decided to become a thief! Do the crime do the time!!! She got caught and now she's worried about her baby! Should have been worried before doing the crime! Baby is being raised by a habitual, especially if she can't act straight while pregnant","commenter_a":"She was sentenced 14 days and is getting them 3 for 1 that's 5 days people. If she were male and not pregnant she would have been ordered six months. Being pregnant isn't a get out of jail free card.","post_message":"Right or wrong?"},{"comment_id":"10153873967388797","commenter_b":"Women want equal treatment. Then cry they don't get special treatment...","commenter_a":"The Man Should be on the Right.","post_message":"WHAT'S WRONG WITH THIS PHOTO? A picture of a couple walking down the sidewalk has sparked a heated debate on social media. What do you think? Here's why people are talking:"},{"comment_id":"10154704340591509","commenter_b":"Don't feed the troll people.","commenter_a":"Why didn't this man order a bride from Russia, or a number of countries which pimp put their very ready and willing women.","post_message":"\"When I woke up I didn't know that I was in China.\""}]
