[{"comment_id":"1089383177744009","commenter_b":"eeeuuuuuuu - did she get that in her back yard?","commenter_a":"That looks awful.","post_message":"You as a parent do not know what's best for your kid. You don't know how to raise your kid right. You certainly do not know how to properly feed your child, and Michelle Obama and the government are going to do it for you and they're not gonna give you any choice in the matter."},{"comment_id":"10153535805923352","commenter_b":"You dumb wet back bitch and @username you ugly bitch go ahead. Pink monkey bitch","commenter_a":"He is though. What happened to \"freedom of speech\"? Oh it's selective I see.","post_message":"Female middle school teacher forced to resign after telling students that President Obama is a ‘Muslim baby killer’"},{"comment_id":"1095090630555419","commenter_b":"Leave then lol i did","commenter_a":"Chicago is the worse place to live it's sad I fear for my child and don't want her outside because there's so many shootings each day","post_message":"WOMAN SHOT AT STOP LIGHT: A 24-year-old woman has been shot multiple times while at a stop light at 71st & Wentworth in the Englewood neighborhood. It happened just after 11 p.m. The car she was driving ended up coming to a stop in a grassy lot with its driver side window shot out. She is being treated at Christ Hospital in Oak Lawn where Diane Pathieu ABC7 joins us live with the latest."},{"comment_id":"10154376323356509","commenter_b":"Screw this Stepford wife!","commenter_a":"I had expected @username to declare Hillary Clinton the winner of this State of the Union but to my surprise @username has decided to no longer boycot Bernie Sanders. Wolf Blitzer called him \"a new face\" and very underestimated by the general public. Yes Wolf, he is a new face on @username and he was underestimated by @username but not by the general public. We all saw this coming, you better explain why you didn't: ignorance or incompetence?","post_message":"5.) \"Many of our best corporate citizens are also our most creative.\" -- Barack Obama during his State of the Union or Nikki Haley during the GOP rebuttal? #SOTU"},{"comment_id":"1357815300916697","commenter_b":"LOSER. MOVE ALONG NOW!!!","commenter_a":"Made this myself fits them perfectly","post_message":"Stein planned to make an announcement about the Pennsylvania recount Monday outside the Trump Tower in New York."},{"comment_id":"1594885237238266","commenter_b":"These dumbasses ran into them in Tampa in Ybor thank God for The Thin Blue Line or those protesters would have had one hell of an ugly day in their life","commenter_a":"Just shows what they are made of! Nothing these crybabies should be kissing the cops asses for saving them lol","post_message":"What happens when whiny anti-Trump protesters interrupt The Few, The Proud, The Marines?"},{"comment_id":"10153560718630950","commenter_b":"She SHOULD be acting like a professional woman!","commenter_a":"I'm with Kelly. Respect goes a long way. There is a right way and a wrong way and ABC and Michael Strahan chose the wrong way. Kelly has a right to be hurt.","post_message":"Kelly Ripa reportedly feels \"disgusted and angry\" that this was done behind her back."}]
