[{"comment_id":"2071257249766331","commenter_b":"Only American enemies would want to remove it!","commenter_a":"Like","post_message":"There is no reason whatsoever that justifies removing this picture. Can we get 5,000 'LIKES' to keep it in the Museum?"},{"comment_id":"10154736947540575","commenter_b":"Ignorant bitch. You voted hate. You liberal clowns","commenter_a":"Were was Meryl Stereo about the man that was attached and tortured. Oh yes, he was White.","post_message":"BOOM! Kellyanne Conway Schools Elitist Meryl Streep... ---VIDEO"},{"comment_id":"10154739340963812","commenter_b":"HES STICKING TO BUILDING IT GOOD FOR YOU TRUMP BUILD THE WALL BUILD IT TALL","commenter_a":"Cause both of them know a wall isn't gonna happen, whether he wins or not!","post_message":"Donald J. Trump says that while he had a \"constructive\" meeting with the Mexican president, they \"didn't discuss\" who would pay for the border wall."},{"comment_id":"10153842036026336","commenter_b":"Is that all....disgusting? We can rid the nation of this vermin if we decide to get together and do it.","commenter_a":"Oh he didn't misread anything. He knows exactly what's going on and it's all part of his agenda to destroy America. Disgusting.","post_message":"Charles Krauthammer said that Obama's strategy to fight ISIS is not working because \"he thinks radical Islam is a passing phase.\""},{"comment_id":"10153610330463132","commenter_b":"Scum","commenter_a":"This concept of if someone slap you and you give your other cheek instead of smacking back doesn't apply here. He killed 9 innocent, unarmed and specifically in a worship place, the crime is much bigger and what is the guarantee he won't do it again??? So no mercy, or leniency must be shown to deal with this BABY-CUT apparently innocent looking monster....","post_message":"\"You have killed some of the most beautifulest people that I know And it will never be the same. But as we said in Bible study, we enjoyed you. May God have mercy on you.\" #CharlestonShooting"},{"comment_id":"356605304542984","commenter_b":"Round them up. Shoot them. Send body bags back.","commenter_a":"with the help of our government they will win. little bush wants to take the walls down and do away with the border guards , it will save trillions of dollars each year. after all most of them are here now","post_message":"Are the Marxists gaining in their Desire to Destroy America?"},{"comment_id":"1777765929177182","commenter_b":"Hillary Clinton is pure evil! Most vile, lieing, thieving, corrupt witch on the planet!","commenter_a":"She lied and lied and has lied about her lies, all the while breaking the law, and half America still thinks she should be president. I would as soon a bank robber or one who had commited treason be president. Her lawbreaking and lying has been such a lifestyle for so long I can't imagine her being president no matter what skunk is running against her.","post_message":"An iconic photograph of Hillary Clinton using her BlackBerry while wearing sunglasses on a military plane prompted an official in her office to inquire about whether Clinton had been assigned a government email address...  The information came out in sworn testimony in a Judicial Watch deposition of Karin Lang, a former State Department official. Please SHARE!"}]
