[{"comment_id":"1258337087519652","commenter_b":"Found the domestic enemy of our Constitution. As a soldier, I vowed to defend against you.","commenter_a":"Time to disband the Supreme Court. Time to hold all these people who violate our Constitutional rights accountable.","post_message":"The U.S. Supreme Court Monday handed a legal victory to advocates of banning firearms commonly known as assault weapons."},{"comment_id":"765284786938035","commenter_b":"real women respect themselves enough to not get knocked up and then run from responsibility.","commenter_a":"The Colorado shooter's neighbors have been interviewed and his shack has been visited. Turns out he was...drumroll please...AN OBAMA-LOATHING PRO LIFE CHRISTIAN! Now who could've possibly seen that coming? The propaganda videos led the terrorist to carry out his deed. Sound familiar something going down a tad east of here?","post_message":"What a sleaze ball."},{"comment_id":"10153830335904087","commenter_b":"Course they won't. They just coronated their queen.","commenter_a":"The most transparent \"administration\" in history.... LOL","post_message":"#BREAKING: The State Department is refusing to hand the House Oversight Committee any email messages as part of the panel’s investigation into eight deleted minutes from a 2013 press briefing video."},{"comment_id":"1092002180891914","commenter_b":"Tiny little penis","commenter_a":"Piece of shit","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152955885854641","commenter_b":"we never tolerate any humiliation to our beloved prophet","commenter_a":"For some idiots act why do you drag the entire religion and keep mocking them... By speaking m I terrorist to you that I'm a Muslim ??? What do you have in mind?","post_message":"Muslims respond to Charlie Hebdo’s new Mohammed cover with mixed emotions: cnn.it/14xIMA6"},{"comment_id":"10154985622284687","commenter_b":"She schould blame her father for this","commenter_a":"Brilliant ! Will do","post_message":" is just  it's a wonderful line. I own some of it. I fully  I'm going to give a free commercial here. Go buy it today, everybody. You can find it online."},{"comment_id":"10154035210569024","commenter_b":"Tap her phone - stop her from murdering people","commenter_a":"Well police next time you see this lard ass limo cross the line pull it over and ticket HER. She is an EX Senators EX dept of state she has NO PROTECTION rights from being stopped and charged.","post_message":"“AFTER SPENDING A ENTIRE YEAR COURTING BLACK LIVES MATTER…”"}]
