[{"comment_id":"428369787523578","commenter_b":"Lady if I was standing right next to you I'd slap the s*** out of you","commenter_a":"Lana Genchi","post_message":"This woman's racist rant just got her banned by the mall for life."},{"comment_id":"633906553463617","commenter_b":"Bitch got booooooom roasted!","commenter_a":"Gladys Bernieeeee","post_message":"Bernie Sanders: \"Do you think that if your family had not made hundreds of millions of dollars of contributions to the Republican Party, that you would be sitting here today?\""},{"comment_id":"10153162470033908","commenter_b":"get outta here","commenter_a":"1 & 6 Katarina Koncarevic","post_message":"Here are 8 things you can do to potatoes you probably didn't know:"},{"comment_id":"10154912048588128","commenter_b":"... so now that the republican congress has a republican president, can they start paying down the national debt now? :)","commenter_a":"We need to fight Islamic terrorists and China. Congrats Trump! Let's make America great again. With Love, From India. We are also celebrating in Delhi for your victory!","post_message":"President-elect Donald Trump will likely get the chance to fill the Supreme Court vacancy created by the death of Justice Antonin Scalia, and could have the chance to tilt the balance of the court more solidly conservative for decades if other justices retire."},{"comment_id":"10153095720526051","commenter_b":"You poor sick woman, you must have never gone to school ever.","commenter_a":"Not saying what he did by any means was right.... But blacks are openly threatening to kill us everyday... The Black panthers said they were going to bomb white nurseries and how they need to rape and kill all white women and children. All this can be looked up. There are numerous hate crimes committed by blacks against whites everyday yet finally a white boy snaps and it's everywhere on fb and everyone wants him publicly hung. Obama is now pushing his gun control bs again over this but why doesn't he do that over the thousands of shootings everyday pointed towards the black on black crimes? Open your eyes people... I think you're all missing the much larger picture here.....","post_message":"Dylann Roof just confessed to the #CharlestonShooting. He says he had just one goal in mind when he opened fire."},{"comment_id":"10157053250220354","commenter_b":"She can't keel over soon enough. Evil beast!","commenter_a":"She's choking on all her lies!","post_message":"“You all right? Any mouth to mouth CPR?” one of the hosts joked, trying to lighten the mood.  “Senator, you coughing like you have something medicinal,” another host said.  LISTEN:"},{"comment_id":"1026833867373308","commenter_b":"We don;t want or need your amnesty, illegals are criminals.","commenter_a":"If he's all smiles with those morons, he can't be trusted. TRUMP.","post_message":"Sen. Rubio co-sponsored the gang of eight amnesty bill in 2013 that would've granted amnesty to 11 million illegal aliens, weakened border security, weakened interior enforcement, and TRIPLED immigration."}]
