[{"comment_id":"10152762362423645","commenter_b":"smh...","commenter_a":"Marlo","post_message":"Wow. That must have been a strange night. Kurt Busch testifies that his ex-girlfriend is a 'trained assassin' who returned from a mission in blood-splattered gown."},{"comment_id":"10154290934583258","commenter_b":"She started it!!!","commenter_a":"Elizabeth, do not respond to Trump! Why are u engaging in this? It is beneath u.","post_message":"Donald J. Trump and Elizabeth Warren lobbed insults again on Twitter Wednesday."},{"comment_id":"10153405273244203","commenter_b":"@username those aren't feminists.","commenter_a":"What an absolute idiot! Feminism is the opposite of equality. Equality is equality, that's it.","post_message":"\"So to me, feminism is probably the most important movement that you could embrace, because it just basically another word for equality.\" Taylor Swift"},{"comment_id":"1214110285315058","commenter_b":"Great that's sounds good to me.Now tell him to tell his people to tell the kids and tell the hate groups,especially the kkk and others to stop yelling white power and build a wall and bulling people.Tell him to stop terrorizing people from Mexico that have been here for years that he is going break up families.That a good start.That's not God's ways.This is an America for all.","commenter_a":"God gave us a choice and decent rules to go live by but unfortunately some people just don't follow God's rules and a trump is produced.Using Vile language,threatening people,a wife that is no example to little girls but everybody in the republican camp adores him.He's gonna save the world.Not!","post_message":"If you claim to be a “Christian” but support Donald Trump and all the hate and bigotry he embodies, you’re a hypocrite."},{"comment_id":"577283422434663","commenter_b":"Sandra Skolnik THE HILLARY VOTER ARE ,MUSLUMS ,ILEGAL IMAGRANTS, PEOPLE LIVINg in other countrIES silly woman that dont follow other candadits SO HOW DO THEY REALLY KNOW WHAT IS GOING THE WOMAN NEEDS TO BE INCITED SOON","commenter_a":"I'm starting to #FeelTheBern! Bernie Sanders has been consistent with his message throughout his career from climate change to #LGBT rights. @username not only voted in favor of the Iraq war but she also played a large role destabalizing the Middle East in Libya and Syria as Secretary of State. I hope New York, California, Pennsylvania and the remaining states get out and vote for Bernie Sanders before the FBI indicts @username over her mishandling top secret information on her private server. We need honest leadership not warmongers who destroy entire nations with irresponsible policies. Vote for peace! #FeelTheBern #BernieSanders2016","post_message":"It's understandable that Americans are angry. But instead of inciting violence, we should talk about how we’re going to address the challenges we have."},{"comment_id":"1839638869615346","commenter_b":"What progress? Isis? Health care costs through the roof? Men hanging out in women's bathrooms? Haiti? Russia ready to attack us? Drawimg a line in the sand? Most terror attacks on US ground ever? The disasterous Common Core? Highest poverty rate with people on welfare..ever!? Even democrats admit it!","commenter_a":"God forbid the president campaigns to protect everything he has accomplished. He doesn't need an idiot like you who would be a bull in a China shop destroying all of the progress that has been made.","post_message":"\"They're losers. They're babies. We have a president-- all he wants to do is campaign,\" Donald J. Trump said of President Obama @webpagelink"},{"comment_id":"1060970767293401","commenter_b":"Diana Serrano those hard headed girls just don't listen!!!","commenter_a":"Hahaha.... Acha hai acha hai","post_message":""}]
