[{"comment_id":"1791974164423219","commenter_b":"@username Mexico has a wall at the south boarder but yet it's all ok for them? They built it to keep the freeloaders out, but it's so wrong for America to do it? Sorry if you want to be over run with illegals go move to Mexico. Otherwise support YOUR COUNTRY FIRST!","commenter_a":"Difference Clinton isn't a racist all Hispanics rapist, murders and thieves. Name one nation that has put a wall to keep a bordering country out. If every country in Europe can their border without a wall so can we.","post_message":"Controlled immigration wasn't \"extreme\" 20 years ago and its not \"extreme\" today..."},{"comment_id":"1257226684318485","commenter_b":"Thank god Hillary did not get in she is to dangerous to our constitutional rights. And you know nothing of our constitution or you would know how dangerous Hillary really is. I don't think anybody that is not a American has a right to who we have as a president. Now it's time to make everything great and get along for all of Americans based on the constitution where it all started and will stay.","commenter_a":"If GOD could erase USA right now he would do it, i have no doubt. Trump is a living nightmare, and the American people are in the rollercoaster of stupidity right now. God don bless America...","post_message":"Things are not looking good on Wall Street"},{"comment_id":"10154662722072619","commenter_b":"Stupid woman.","commenter_a":"Total anti-semitic bitch; She would march the Jews to the ovens if she could.","post_message":"Swedish FM drew outrage in Israel when she linked the terror attacks in Paris and the feelings of Palestinians."},{"comment_id":"557193267780477","commenter_b":"KEEP GOING TED!!!!","commenter_a":"Wooo! Hooo! Colorado!...We stand with Ben!","post_message":""},{"comment_id":"10153986689364916","commenter_b":"\"Ever sinned bitch?\" Christ would be so proud @username","commenter_a":"Umm...which value first? Cheating on your wives (plural). Coveting your daughter? Bigotry? Hate? Self- love? Love of money? The commandment \"Love your neighbor (does not say except Muslim, Black and/or Hispanic) as yourself\"","post_message":""},{"comment_id":"10154083070804160","commenter_b":"Go to Hell","commenter_a":"Won't this trump puppet go jump off a cliff already","post_message":"\"Bow down.\""},{"comment_id":"10153065757271636","commenter_b":"nope, men rape men too.","commenter_a":"Oh I see. Rapists are just misinformed. If only they had read this first, or someone had read it to them at an early age then we wouldn't have this problem that we have today. Women taking sensible precautions has nothing to do with preventing rape. Maybe we should write and share a ten point guide for thieves on why they shouldn't steal. Then we wouldn't have to lock our doors.","post_message":"Worth re-sharing"}]
