[{"comment_id":"956871837686622","commenter_b":"This mother is insane.","commenter_a":"Not cute or darling...it is ANIMAL ABUSE..this child will grow up not respecting animals or people a a result of mommy's abuse to her and to animals...kids do not know...they have to be taught...","post_message":"This is not “cute” or “playful” or “darling” or “harmless” — it’s ANIMAL ABUSE, indirectly perpetrated by a mother too ignorant to keep her clueless (and ultimately innocent) toddler from treating a LIVING, FEELING creature like an inanimate rag doll. Disgusting…"},{"comment_id":"1123357077760543","commenter_b":"She's gonna drop-kick Trump in the general election!!!!","commenter_a":"America actually did stop being great, but not for you because you a corporate puppet","post_message":"\"We don't need to make America great again. America has never stopped being great,\" Hillary Clinton delivers victory speech after #SCPrimary win: @webpagelink"},{"comment_id":"10153422515817235","commenter_b":"There are a good number of female cops killing for nothing.. Just look it up.","commenter_a":"Another petulant, controlling, entitled man killing a woman who told him 'no'. I'm really sick of men behaving this way simply because he can't get his own way. Women do not DO this. Why do men?","post_message":"Protecting and serving the hell out of you."},{"comment_id":"10153657767106051","commenter_b":"OMG... A bunch of women who can't stfu!","commenter_a":"This isn't a political website Lorretta so move on.","post_message":"Olivia Newton-John's ex vanished on a fishing trip 10 years ago. Now, more than a decade later, we finally know what happened to him."},{"comment_id":"10154194396888010","commenter_b":"Says a woman who has a child... but who only wants people who look like her and have money like her to have opportunities, though. #privilege","commenter_a":"This can't be serious? They want to provide State-finder childcare, too? And, preschool? Every study I read says the current system of young elementary school is failing kids (too much time in seats, not enough art and play, etc.) and the solution is to start them even earlier? Free childcare, free preschool, free K-12, and Bernie wants free college. Where does it end?","post_message":"The goal: free preschool and affordable daycare for all."},{"comment_id":"1048961388493889","commenter_b":"@username and what do you mean by Americans pay for illegals not you I am an American last I checked","commenter_a":"I don't know what your being told but Obama has more people deported than any other president. ...I see it constantly in the Hispanic news channels","post_message":"CIS found that criminal prosecutions for immigration offenses have dropped 36% over the last five years and due to sanctuary cities policies, the detention of illegal aliens in jails is down by two-thirds."},{"comment_id":"10153506474399342","commenter_b":"She's one of these \"innocent\" women that our cretin in the White House wants to allow in the US.","commenter_a":"What a mutt. I hope they shot her in that ugly face of hers.","post_message":"We're getting our first look at the female shooter in Wednesday's tragedy in #SanBerardino."}]
