[{"comment_id":"544829205708653","commenter_b":"Free so the they can bomb and kill Israelis like their surrounding neighbours. No thanks","commenter_a":"I'm sure this will give the Zionists more reasons to steal land in Palestine I hope the poor people of Palestine will be free some day","post_message":"Wildfires are also threatening homes near Jerusalem and in the West Bank."},{"comment_id":"10154969761261509","commenter_b":"The same reason they have the Latin Grammys. When you are not represented in mainstream, you create your own.","commenter_a":"Imagine if there was a \"White Entertainment\" awards show, or a \"White Entertainment\" channel Oh the chaos Hypocrites","post_message":"Tracee Ellis Ross and Anthony Anderson's hilarious hosting, Beyoncé and Kendrick Lamar's surprise performance, Jesse Williams' powerful speech, and more from last night’s BET awards."},{"comment_id":"682571568600088","commenter_b":"I am so sick of hearing this offends the Muslims that offends the Muslims what the hell are they living here in America this is our country go back to where you came from because you offend us","commenter_a":"DONT LET THEM DO IT!!! Don't keep the truth away from AMERICA. Don't let them do it.","post_message":"Schools are removing the Holocaust for curriculum because it offends Muslims. This is could be the most ridiculous thing I've ever heard. Do you think they should keep the Holocaust in history lessons?"},{"comment_id":"894432780616200","commenter_b":"Baltimore is am example of liberal policies failure people want jobs not government social handouts","commenter_a":"This is a Democrat liberal myth if any of the Democrats they would read a history books they would learn that the Democratic Party was the original racist party remember Lincoln was a Republican","post_message":"Can't say we weren't warned ahead of time this might be a problem."},{"comment_id":"10154268012211336","commenter_b":"HURRY UP AND OD, MAKE AMERICA PROUD, FIDDY THENTS.","commenter_a":"50 cent. Ironically, that's also what his career is worth.","post_message":"In a video posted on Instagram, 50 Cent confronts a young man as he pushes a cleaning cart through the terminal and accuses him of appearing to be high on drugs."},{"comment_id":"10154259751471509","commenter_b":"What because he supports the laws of the land? Yeah. Illegal immigrants are illegal. Period. Muslims harbor terrorists.. Period. We are 19 trillion in debt. Will take a business person to get out of it, not a crooked politician who put us here..period.. I can keep going","commenter_a":"That's the main reason Trump will be elected, we the people are pissed, Hillary lies, Obama lies, Congress lies and the media lies for them","post_message":"Ever felt that politicians were fibbing? Several CNN Opinion contributors weigh in on truth and lies in the political realm."},{"comment_id":"989113651145780","commenter_b":"Well I don't consider myself religious just because I have a relationship with god. I am Christian. The lord is my savior.","commenter_a":"sigh....","post_message":""}]
