[{"comment_id":"10152809432022060","commenter_b":"Ummmm she made that choice! PLEASE quit pretending she was Innocent!","commenter_a":"Oh yea she looks real scared. She was with him two weeks? Cant lay her choices on him.","post_message":"Faced with the vicious way in which Dexter Allen is accused of killing the victims, Haraquon Degruy's mother believes she was trapped, unable to flee for fear of repercussions against herself or her family."},{"comment_id":"1145540435508072","commenter_b":"No job , 6 kids , no husband . Stop !","commenter_a":"Waited in line for six hours if you would've been working kids would've ate","post_message":"Entitlement Mentality: Welfare Recipients React to Food Stamps Being Cancelled.  This shows everything wrong with the entitlement mentality."},{"comment_id":"10153171186966051","commenter_b":"stand your ground. no to muslims","commenter_a":"I would say no no no","post_message":"The people in this town are prepared to do whatever it takes to keep a Muslim cemetery out. In fact, they have one very specific idea in mind."},{"comment_id":"658477470966222","commenter_b":"I'm sorry this woman is no good for this country I'm sure there is the woman that be a Great president for this country but she is not the one she is evil and corruptive I see a whole lot of old women who think I got 1 foot in the grave I should vote for a womanwrong","commenter_a":"It still look's like a trash bag on her.","post_message":"Hillary Perón"},{"comment_id":"558350940997625","commenter_b":"TRUMP 16 the rest are weak ! Non presidential . The to Cubans will open our borders to Cuba Canada and Mexico because there parents were illegals also . Period","commenter_a":"Donald J. Trump 2016","post_message":"'...a man who has a multi-decade history of exploiting the immigration laws to take advantage of the little guy is not someone we can trust to stand with the working men and women of this country.'"},{"comment_id":"10154556133417235","commenter_b":"Good bye you old hag","commenter_a":"It could only have happened more quickly. Thank God for small miracles. Goodby. God Bless, where ever 'He' .Kisses.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153308747171037","commenter_b":"Failing to report 1,100 donations and $145 million in donations isn't sinister. It's just a small bookkeeping error. This is how totally out of touch this moron and his wife are.","commenter_a":"And, I did not have sexual relations with that lady, Miss Lewinski.","post_message":"Former President Bill Clinton used his first interview since Hillary Clinton announced her 2016 campaign to address questions about the Clinton Foundation - by Dylan Stableford in Yahoo Politics."}]
