[{"comment_id":"1159055580820855","commenter_b":"China Eddie, we western women have a CHOICE to wear what we want when we want, unlike you poor suckerers who must obay. You poor poor deluded fools.","commenter_a":"Islam will reform when they relinquish women from its oppression","post_message":"Mothers and wives pose in the embroidered boreghehs that some start wearing from the age of nine"},{"comment_id":"958393367537826","commenter_b":"All blacks destroy their housing and no whites do right Shawn?","commenter_a":"Yeah how dare those desperately poor people in Africa decide what they can do with their own resources to get some income from wealthy people who want to spend it.","post_message":"52 percent of all lion trophy exports end up in the U.S., and its share of the trophy trade has been growing. #CecilTheLion"},{"comment_id":"1785965414966824","commenter_b":"Ancient celts had hair like dreads as well. This is her putting a modern spin as an absolute.","commenter_a":"My life my world my rules. You dont tell me what to do","post_message":"It's everyone else's fault!"},{"comment_id":"581504818688172","commenter_b":"we are \"nasty women\" and we vote!","commenter_a":"Your mother always said that you were a disappointment and a nasty little creep.","post_message":"The conviction of an Iraqi refugee plotting to blow up the Houston Galleria is exactly why I've been pushing so hard to immediately suspend the refugee program from terrorist hotspots. The current program is a Trojan Horse allowing ISIS and other terrorist groups an open invitation into the U.S."},{"comment_id":"10153345373924087","commenter_b":"Quit being a bitch you got your guns right?","commenter_a":"And Obama is going to let more terrorist in here so what's worse","post_message":"“He’s whipping up hatred to scapegoat a minority religious group, which has some very dangerous precedents,” Rep. Keith Ellison said of Donald Trump’s claims that thousands of Muslim Americans cheered the 9/11 attacks. “I mean, it’s the kind of behavior [that is] classic demagoguery, and you know, he’s going to get somebody hurt.\""},{"comment_id":"1040961739305022","commenter_b":"Thats right. He you dont like it then get the hell out of MY COUNTRY","commenter_a":"I do want my country back...America...the land of the free from sea to shining sea, from mountain to desert...I want it all back, all the beauty and peace and sweat and hard work that we Americans have given this land...I want it back...my America...not some version that obammer thinks it is...not his America...my America..and if that offends anyone, that is just too damn bad.","post_message":"Americas Freedom Fighters"},{"comment_id":"10150791998559999","commenter_b":"They are thieves!","commenter_a":"The cable industry as a whole is pretty much a monopoly. #Comcast","post_message":"In an unusual step, President Obama singled out cable set-top boxes as an outdated symbol of corporate power over consumers."}]
