[{"comment_id":"1256931770993517","commenter_b":"Shut-up... and please die!....","commenter_a":"No laws we have on the books would have prevented what happened.","post_message":"\"People on the No-Fly list can walk into a store and buy a gun. That is insane,\" the president said."},{"comment_id":"1163941390354988","commenter_b":"I'm also mad that she is not wearing the gloves. I couldn't care less about a corset. Wear the gloves!","commenter_a":"Ummmm...okay?","post_message":"Emma Watson isn't wearing a corset under that yellow dress. // Beauty and the Beast"},{"comment_id":"558350940997625","commenter_b":"TRUMP 16 the rest are weak ! Non presidential . The to Cubans will open our borders to Cuba Canada and Mexico because there parents were illegals also . Period","commenter_a":"Donald J. Trump 2016","post_message":"\"...a man who has a multi-decade history of exploiting the immigration laws to take advantage of the little guy is not someone we can trust to stand with the working men and women of this country.\""},{"comment_id":"1112252572119545","commenter_b":"We have BOTH problems: 1. too many guns, too easily had, by too many people. 2. We don't take care of people who are mentally ill. Rather (thanks to Reagan who closed the public hospitals) we either put them on the street, or we bake them first in prison, and *then* put them on the street. Europe takes care of both of these problems much better than we do. That said, the statistics are clear, countries that have more guns, have more gun-related deaths and injuries. Guns within easy reach are far more likely to do harm than good.","commenter_a":"Today another mass shooting of children by a mad man which took place at almost the same time Republican mad men held unethical hearings about the falsehoods that Planned Parenthood are killing children for profit. If the Republicans wanted to investigate a terrorist organization that is solely responsible for the verifiable mass death and carnage of America's children, and other innocent lives, they'd be investigating the National Rifle Association and its members. It's time we realize the NRA and Republican cohorts are terrorist organizations and the Democrats are as guilty and cowardly to do anything to reign in this insanity, as they too are as beholden to NRA dollars as the Republicans. If these were Muslims murdering our children at this rate instead of deranged Caucasian white men, who make up the majority of the Republican voters, all of the Mosques would've been leveled and Muslims would have been rounded ...","post_message":"Another day in America."},{"comment_id":"10153740832391800","commenter_b":"Chris, honey, being a salty bitch isn't going to solve the problem.","commenter_a":"Islamic Extremists: Kills people that don't share their beliefs, Christian Extremist: Kills people that don't share their beliefs! I say, we should worry about these pro-life extremist before we worry about extremists on the otherside of the earth!","post_message":"In the wake of a shooting at a Colorado Planned Parenthood, the media questions whether or not it was an act of domestic terrorism.  ►Watch last night’s full episode now: @webpagelink"},{"comment_id":"729100880559027","commenter_b":"Damn right! Put that bitch in office and watch what \"We the people\" do!","commenter_a":"If Hillary wins, it will be because the electoral college was bought out!! The government has already bought the media and they are lying about the margin between Trump and Hillary---Trump is way ahead. The American people are fed up!","post_message":"“I am winning. I am beating everybody and, in my opinion, beating Hillary is easier than beating [my Republican adversaries],\" GOP front-runner Donald J. Trump said."},{"comment_id":"10154105809967908","commenter_b":"Feel the Bern! Gonna be the first time I vote thanks to this man Bernie2016","commenter_a":"Yes, it is appalling.","post_message":""}]
