[{"comment_id":"1546155322346073","commenter_b":"A Butt Ugly Bitch!","commenter_a":"How sad he is But...wait pediphiles will be the next protected people","post_message":"This is the crux of the problem"},{"comment_id":"919423778080478","commenter_b":"You'd have a point (kinda) if it was a white girl. But shes black. So she has no argument. Neither do you.","commenter_a":"Wow I gotta admit I'm surprised at all the responses. As a dark skin man I understand that woman. If u an Artist and u preach something u should be about that something. Now as humans u love who u love but when u are a celebrity u open yourself to critisim good or bad.","post_message":"\"Dark Skin Activist\" Slams Kendrick Lamar Over Light-Skinned Fianceé: “I Will Never Support Him”"},{"comment_id":"10153448946523984","commenter_b":"We have a process for people to come this country and become citizens. These illegals should should not be put ahead of the people who are doing it the legal way.","commenter_a":"I'm not a crook","post_message":"Barack Obama’s bad week just got even worse...  Are you glad to see this happen?"},{"comment_id":"10154428619792144","commenter_b":"Kimberly, other than Melania Trump, you wouldn't know an illegal immigrant from a U.S citizen if your life depended on it. Get ahold of yourself woman!","commenter_a":"Seriously????? Let it go.....He's done, THANK GOD!!!!!! The end of an ERROR....","post_message":"Thank God."},{"comment_id":"10158316523410578","commenter_b":"Lock up homegrown terrorists!","commenter_a":"OUT OF HERE ILLEGALS.","post_message":"Do you support the Immigration Crackdown? \"As we speak, immigration officers are finding the gang members, the drug dealers, and the criminal aliens and throwing them the hell out of our country. And we will not let them back in. They not coming back in, folks. They do, they going to have bigger problems than they ever dreamed of.\" - President Trump @webpagelink"},{"comment_id":"433011990220428","commenter_b":"good hope the NIGGER DIES","commenter_a":"I likt being mean but he hevhe i loveĉit","post_message":"Will he be able to finish his second term?"},{"comment_id":"10153064860976378","commenter_b":"People need to understand that EVERYONE is entitled to their opinions whether YOU agree with them or NOT! intolerance goes BOTH ways!!!!","commenter_a":"Ummm it is a catholic school?! Maybe she can go get a job in a Muslim school....oh wait","post_message":"TEACHER FIRED - A popular teacher at Merion's Waldron Mercy Academy was apparently fired because she is married to another woman, a marriage that is 8 years old. The school says her lifestyle is not consistent with its teachings. Check out the details here: 6abc.com/@username/ and tell us what you think in the comments section."}]
