[{"comment_id":"1183208918440780","commenter_b":"Stupid women. I'm one but Savannah is a regular person, comfortable in who she is. Why must she have makeup on after just having a baby. I'm not going to criticize her for that. Some people just don't know where their nose ends. Leave peoples' business alone. Who are you to make it your business?","commenter_a":"Seriously? People care whether or not she's wearing makeup? Giving birth is one of God's greatest gifts and I doubt He - nor Savannah's precious baby- cares about her beauty routine.","post_message":"\"We don't need any 'tips' on how to look good without makeup. We all look good without makeup. We just don't realize it until we realize what life is truly about.\""},{"comment_id":"10154979630864218","commenter_b":"@username That damn Clinton how dare she think she is above the same laws we have to abide by....","commenter_a":"Face it the Democrats failed policies and over regulation aka job killers have finally awoken the American Voters in rural America their the ones truly hurting","post_message":"Maryland remains a deep blue state politically, but President-elect Donald Trump was able to flip white working-class votes in parts of Maryland, including eastern Baltimore County."},{"comment_id":"1077408458966678","commenter_b":"Malyk Bonnet, how fortunate for that young woman that you trusted your indtincts and took some very brave action. You ARE a HERO!!!","commenter_a":"Benjamin Fournelle Sylvie Bonin","post_message":"This teen had a hunch, so he hopped on a bus to a different city. He might have saved a life. - Robbie Couch"},{"comment_id":"931005183682927","commenter_b":"Send that black bitch back to the jungle baby.. Yeeaaahhh","commenter_a":"Fire her. if she were white, she would already be gone.","post_message":"Sam's Club CEO made some serious anit-white racist comments. She thought it would slide under the radar because it was directed at white people. She was very wrong. Payback that is happening has been brutal and swift and she deserves it. Can we get 5,000 'LIKES' to fire this CEO for racism?"},{"comment_id":"900098320056924","commenter_b":"What a stupid bitch","commenter_a":"Carmen Favela girls dick ride the shit out of drake 😂😂","post_message":"Drake Fan Calls Cops On Meek Mill & Rats Him Out To His Probation Officer For Threatening Drizzy!"},{"comment_id":"873173032819817","commenter_b":"Why are so many women that insecure? Come on...","commenter_a":"No thats called someone having mental issues lol","post_message":"Warning to all couples."},{"comment_id":"10154686052869586","commenter_b":"Get this bear out of there now","commenter_a":"Holding animals in captivity is inhumane. Do not support zoos.","post_message":"Thousands of people visit daily to take selfies & knock on the glass :("}]
