[{"comment_id":"10152623006528067","commenter_b":"Explain free? Teachers work for free? Colleges get free utilities and maintenance? Books?","commenter_a":"Nothing is free","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"1891157881114099","commenter_b":"that's something you would need to record lol","commenter_a":"@username this would be something you would do lol","post_message":"Now that's a f.d up prank. #WSHH"},{"comment_id":"10153189234471491","commenter_b":"I still want my coke 0. Gitty up !!!","commenter_a":"Hahaha! European countries welcoming muslim refugees beware! In a few years time......","post_message":"She filed a discrimination complaint."},{"comment_id":"467441413380453","commenter_b":"I've got a great idea! Let's send all the illegals to Italy! Who agrees with me?","commenter_a":"NO!!!Go home and support your own People!","post_message":"A five-year-old hands Pope Francis a letter asking him for help in preventing her parents from being deported. The Pope is calling for Christian support for all immigrants, both legal and illegal. Do you agree?"},{"comment_id":"10156091487575389","commenter_b":"They're socialists, not Americans. They should be deported with the illegals.","commenter_a":"I think they would vote for Hitler if he ran as a democrat. SO many in this country have no concept of reality any more.","post_message":"Question of the Day: Do you think Bernie Sanders can beat Hillary Clinton in Iowa and New Hampshire?"},{"comment_id":"10155106719593132","commenter_b":"She probably was in on it. What woman in her right mind would move in with a man whose wife mysteriously \"disappeared\" just 2 months prior? Both had to know she wasn't coming back.","commenter_a":"Girlfriend needs to be scared now. Similar to the Lacy Peterson case. Very sad!!","post_message":"Elizabeth Sullivan appeared to have vanished two years ago without a trace."},{"comment_id":"10154212548441496","commenter_b":"You. Have got to be kidding He is a traitor to America and it's people","commenter_a":"That's a joke","post_message":"Agree or disagree: America is a stronger country after eight years of Obama."}]
