[{"comment_id":"631016783743523","commenter_b":"Another white college educated female here!!!","commenter_a":"Donald Trump will not become president of the United States, because Americans understand that togetherness trumps divisiveness, and that love trumps hatred.","post_message":"Join me in in Philadelphia - LETS MAKE AMERICA SAFE AND GREAT AGAIN! GOD BLESS AMERICA!! -DJT"},{"comment_id":"10153174741786323","commenter_b":"English people are NOT being RACIST. They dont go to places to live eg Spain. Greece. Australia etc and expect that country to cater to them. You go to a country you respect their way of life. They need to learn English. I used to love the golly on the jam jar brooches. All gone because of so called RACISM. This is a little island. Anyone with a criminal rec ord should not be allowed here and those that commit a crime need to be returned to their homeland. We pay NI out of our wages- not to support freeloaders who offer nothing to this country. What was beautiful historic church buildings-turned into Indian Temples. English Heritage is being destroyed!! Polish people have turned this country in areas to little Polands and this Government have let them. BNP want this country to be ENGLAND and ENGLISH laws and those that ...","commenter_a":"If a white person doesn't roll over and submit, he's a racist.","post_message":"\"Facts in themselves are neutral but their interpretation certainly isn’t. And while on their own facts cannot be racist, the way they are chosen certainly can be.\""},{"comment_id":"10152725934094071","commenter_b":"My manager told me \"if you want my position, you might need more than a Master degree, or probably more than one Master. Plus 10+ years of experience as manager\"... So spare me this story, its not the 80's anymore.","commenter_a":"Ain't that the farkin truth!!","post_message":"You don't have to earn an MBA to become a great manager."},{"comment_id":"10153834090031336","commenter_b":"The true face of Islam! This is what the Quran says about non Muslims! Quran 2:191 Slay the unbelievers wherever you find them; qurann:3:28 Muslims must not take the infidels as friends; quran 3:85 Any relegion other than Islam is not accepteble; quran 8:12 Maim and crucify the infidels idf they criticize Islam; quran: 8:12 Terrorize and behead those who believe in scriptures other than the Qur'an; qurann 8:60 Muslims must master all weapons to terrorize the infidels; quran 8:65 The unbelievers are stupid; urge the Muslims to fight them; quran: When oppertunity arises kill the infidels wherever you find them; quran 9:30 the jews and Christians are perverts. Quran 9:123 make war on the infidels living in your neighborhood; quran 22:19 Punish the unbelievers with garments of fire, hooked iron rods, boiling water, melt their skin and bellies; quran 47:4 Do not hanker for peace with the infidels, behead ...","commenter_a":"Hey Obama keep bringing your Muslim brothers here in America so we can have the same thing done here at home! (The Syrian refugees mixed in with the terrorists) RIP to the innocent souls","post_message":"Breaking News Update: At least 100 people have reportedly been killed inside the Bataclan concert hall in Paris. @webpagelink"},{"comment_id":"10154662722072619","commenter_b":"Stupid woman.","commenter_a":"Total anti-semitic bitch; She would march the Jews to the ovens if she could.","post_message":"Swedish FM drew outrage in Israel when she linked the terror attacks in Paris and the feelings of Palestinians."},{"comment_id":"10154055081001770","commenter_b":"Those girls are too skinny. They need to put some meat on those bones before they could be sizzling","commenter_a":"sizzling...but was she a Hillary voter?","post_message":"Are these sizzling photos too much for the internet to handle?"},{"comment_id":"1027708620606666","commenter_b":"They have no sense of humor! They can not take any kind of criticism or satire! The most boring people on this planet!","commenter_a":"Because he exposes the truth of Muslim infiltrators! Roaches hate the light.","post_message":"Why is designated terrorist group CAIR condemning this FOX News report about Muslims as “racist and Islamophobic?” What ‘race’ is Islam?"}]
