[{"comment_id":"1034762863247926","commenter_b":"She is a super predator","commenter_a":"'@username is a strong leader, she is qualified, she is experienced, she is compassionate, has a lot of accomplishments, has been fighting for the equality and human rights her entire career, UNDERSTANDS foreign policy and the EFFECT and OUTCOME of her message domestically and abroad! #IAmWithHillary","post_message":"This country belongs to all of us, not just those at the top—not just the people who look one way, worship one way, or even think one way."},{"comment_id":"10152884015311336","commenter_b":"No that would be michelle Obama. That thing has an Adam's apple.","commenter_a":"Maybe they could use the canned food to prepare REAL meals for the kids and throw the Michelle Obama school lunches at the attacker.","post_message":"A principal in Alabama wants to stockpile cans of food in classrooms so that students can “stun an intruder 'or even knock him out' until police arrive.  What do you think? Is this a good or bad idea?"},{"comment_id":"10153385027713984","commenter_b":"Just GO away!!!!!!","commenter_a":"Freedom of speech","post_message":"Obama is trying to shut Fox News down for good... sadly, this is Obama's America.  He knows he is failing and is desperate to silence his critics... share this with everyone."},{"comment_id":"1738896129708338","commenter_b":"Abortion queen, and has no shame.","commenter_a":"this drunk, druggie idiot has comments that no one cares about. She is a has been,, and has been Had !!! Loser, Drunk","post_message":"Renowned moral philosopher Chelsea Handler condemns Trump.   The paragon of virtue also adds: 'Please buy my book, 'My Horizontal Life: A Collection of One Night Stands''..."},{"comment_id":"1078041262207343","commenter_b":"Fire her now!","commenter_a":"Mandamus?","post_message":"She took an oath. And the oath didn't say: 'I will uphold the parts of the Constitution that I agree with and ignore the rest'"},{"comment_id":"10154731295753145","commenter_b":"A lot of merchandise with the 'Trump' name on it is lagging in sales. When the sales of anything is down, stores WILL drop them.","commenter_a":"Geez ppl grow the F up and quit crying, he is our president and what the USA needs the most is for all Americans to come together.....united as one!!! This country needs help our own people are starving let's feed them first.","post_message":"Just last week Nordstrom stopped selling Ivanka Trump fashion brand."},{"comment_id":"10153700369301600","commenter_b":"Florence Colo is the federal supermax for the U.S.......","commenter_a":"HELL NO TAKE THEM TO WASHINGTON DC","post_message":"Republican Congressman Scott Tipton’s office said he believes the transfer of some of the world’s most dangerous terrorists from Guantanamo Bay to Colorado is “unacceptable.”  What is your opinion?"}]
