[{"comment_id":"1521185254588608","commenter_b":"You're talking dt supporters, wd you expect anything else?? RFLMAO!!","commenter_a":"Honest to god this is the dumbest shit I've ever seen.","post_message":"Starbucks is probably guffawing over how effective this isn’t."},{"comment_id":"703561329834445","commenter_b":"Get that pos out at any cost.","commenter_a":"Dreams Dreams. What The Fuck Ever. I only get 3 wishes. Anyone got a lamp I can rub.","post_message":"Obama impeachment process takes huge steps forward... he's finished. This is great news. He should have been gone long ago. Can we get 30,000 'LIKES' to have Obama impeached?"},{"comment_id":"10156247602125354","commenter_b":"Waaah, send them home","commenter_a":"Ha ha ha ha ha","post_message":"Newsflash: you wouldn't BE in jail had you not illegally entered the country."},{"comment_id":"10154739043556336","commenter_b":"Did you read her comment, Michael? Kapernick has his rights, we have ours. But our rights aren't as relevant?","commenter_a":"And yet again, we have the right to not patronize the NFL that allows players to disrespect our military, LEO and country.","post_message":"\"If you have the platform to speak up and you choose to do so, then that is your prerogative,” Derek Jeter said."},{"comment_id":"951284658242208","commenter_b":"She dished it out now she should be ready to take some of her own medicine, she purposely attacked Trump and and don't blame trump for no taking crap from her at all. None of what she did was professional.","commenter_a":"Megan Kelly was quite obviously biased against Trump. She was a horrible moderator as well...just horrible. I thought she ruined the entire debate. It was not really a debate at all any way. What a joke.","post_message":"Donald J. Trump declares war on Megyn Kelly after #GOPDebate."},{"comment_id":"1105833282843058","commenter_b":"@username, or not the MAJORITY ., not even close.. also if your so worried about illegals taking jobs, tell like Trump to stop breaking the law, by hiring them.","commenter_a":"NO, Obama has NOT divided America, You Mr. Trump are responsible for dividing our Country & bringing out the UGLY in everybody!!!","post_message":"If anyone is dividing America, it's Trump. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1197755483636319","commenter_b":"oh look a trump impersonator ! If you don't agree with him your a PIG!! a LOSER a total Disgusting human beings!! We're going to make America grate and get my red hats from China yea it going to be grate! They both suck but I trust her with the nations safety and economic well being . He can't get it wrong! It's not like he can claim chapter 11 to get out of paying his bills? Right Einstein!! Lol","commenter_a":"Some People think being president is always being right! about everything you do or try to do! It's not that simple. Back seat driving is easy , but when your responsibility is keep America as safe as possible and the world. Some things will not always go right. You guys are the haters The Republican Party of No","post_message":"It's funny because it's true."}]
