[{"comment_id":"10153130457761162","commenter_b":"P.s pimps should be illegal, prostitutes should regulate their own self on how.much they make an what not","commenter_a":"Would it have been better if he had raped someone?","post_message":"NEW: NFL Hall of Fame lineman Warren Sapp arrested for allegedly hiring a prostitute after covering the Super Bowl for the NFL Network: @webpagelink"},{"comment_id":"862078977258615","commenter_b":"Most abortions are not because of these \"terrible diseases\", so quit using that as an excuse.","commenter_a":"Conservatives are pro-life until the child is born poor. Then they are just lazy and a drain on society. Pro-life my ass.","post_message":"One of the few actresses that isn't ashamed to be conservative and pro-life! One of the big reasons I support her :D"},{"comment_id":"10153635902876130","commenter_b":"Lol. Why do they even give them their name in print. If we ignore them they will hopefully go away...🙄","commenter_a":"Geesh, what an unimpressive list. Was this even worth an article?","post_message":"They all think Donald J. Trump is \"that guy\" for America."},{"comment_id":"1140743049271284","commenter_b":"Little girl, you are asking for a theocracy, which America is not. Time for you to leave and go to Iran, pookie. No one wants your cowardly, uneducated, anti-American traitor self here.","commenter_a":"If God said it, it is settled!, no matter what any pervert says! And the supreme court is not supreme!, God is!","post_message":" represent the people, and the people have shown several times that they are opposed to this, and are in favor of traditional marriage, state Rep. Bill Chumley, R-Woodruff."},{"comment_id":"945496635572234","commenter_b":"She is selling us out to the Arabians","commenter_a":"Butcher of Benghazi","post_message":"WATCH LIVE: Hillary Clinton addresses a crowd in Miami to talk Zika virus"},{"comment_id":"10154514079711509","commenter_b":"That is funny","commenter_a":"I hate to say it but Bernie has done much more for equality than Donald trump","post_message":"\"There's nobody that's done so much for equality as I have,\" said Donald J. Trump."},{"comment_id":"10152850762031748","commenter_b":"Whose boobs is he reaching for? :)","commenter_a":"This is beyond bizarre!","post_message":"Religious Right pundit claims Satan is using gay rights to persecute Christian athletes"}]
