[{"comment_id":"10156358978545354","commenter_b":"For the record, can't stand the women of the View.","commenter_a":"Too bad she wasn't this sharp in her failed tenures at Lucent and Hewlitt-Packard. She has the nerve to keep getting mileage out of Trump's remarks about her looks. Google \"Fiorina Gaffe\". If the media hadn't kept that video \"under wraps\" while at the same time raking Trump over the coals for his remark, the whole flap about her face would have been a \"non\" issue. She also left her campaign for Senator 5 million in debt and her staffers high and dry. Do your research before throwing support behind her.","post_message":"WATCH Carly run circles around the ladies of \"The View.\" Epic!"},{"comment_id":"496930887161871","commenter_b":"women, they just don't listen lol","commenter_a":"Hope she went to jail!!","post_message":"\"Thank to Obama and I don't have to OBEY you\", she said to the police officer!"},{"comment_id":"10153367212549726","commenter_b":"She sooooo bland and stale ,why do we need her we got republicans doing a job her way and she be wearing depends .she needs to goto prison .","commenter_a":"Why do so many morons approve of this idiot?","post_message":"WATCH: Majority of Americans Don't Find Hillary Clinton Honest and Trustworthy"},{"comment_id":"10153415623385329","commenter_b":"Lol","commenter_a":"None of these \"helpful tips\" helped me... not one tit.","post_message":"The nightmare ends today."},{"comment_id":"10153214804429641","commenter_b":"Why are these counties better to mothers?","commenter_a":"Ironic, the top five are all Nordic!","post_message":"These are the best and worst countries for mothers -- how does your country stack up? @webpagelink"},{"comment_id":"10153183466936336","commenter_b":"It's an escort. Nothing will be done to prevent arms to Syria. Another red line crossed. He is an embarrassment and puts us all in danger from terror.","commenter_a":"Iran knows we have a coward President. Even these ships are like a lion without teeth because Obama is Commander in Coward!!","post_message":"U.S. Navy warships are shadowing an Iranian convoy approaching Yemen as the U.S. beefs up its presence in the region. Tune in to 'Special Report with Bret Baier,' tonight at 6p ET for the latest."},{"comment_id":"10153703347009714","commenter_b":"No. And neither is the attraction to the opposite sex.","commenter_a":"Its high time for America and the entire west at large to know that its not a Right to be Gay ! It cant be one's right to do wrong or evil ! Else we shall soon have murderers, thieves and all sorts of hooligans claiming its their right to do so.","post_message":"Kentucky clerk Kim Davis, who has been denying marriage licenses to gay couples, has a turbulent marital history."}]
