[{"comment_id":"1078464325543429","commenter_b":"@username , no not dictating whatsoever. She can spend as much as she wants; I won't vote for her.","commenter_a":"You're spending so much personal time with this little girl. Are her parents campaign contributors?","post_message":"I’ll do everything I can to make sure that DREAMers like Karla never have to worry about being separated from their parents."},{"comment_id":"10155152237477042","commenter_b":"Everyone without documentation will get deported.","commenter_a":"Here in NY, we have a huge population of illegal immigrants from China, Russia, Israel, and the Middle East. Will they be rounded up too, or do the deportations apply only to Latinos?","post_message":"New guidelines under President Trump greatly expand the amount of people considered a priority for deportation.   Undocumented immigrant suspected, charged, or convicted of a crime (including minor traffic violations) will be at the top of the list."},{"comment_id":"2193117860914394","commenter_b":"As if I would let her lick my face when she cleans her asshole 😂😂😂 come on now","commenter_a":"@username Munro","post_message":"It's not just gross, it's dangerous."},{"comment_id":"981019435266811","commenter_b":"she is an Idiot hussy","commenter_a":"That doesn't surprise me!","post_message":"This is SHOCKING!"},{"comment_id":"10153901332209411","commenter_b":"Russians shout their own feet. We do not export our high quailty fruit and veggies anymore. Go and import from china the plastic one !","commenter_a":"We have banned all Turkish produce on our global operations since last week...and will never have any trade relations with that country. May it be Diplomatic or Corporate! For as long as it's erdogan's administration.","post_message":""},{"comment_id":"700735873407794","commenter_b":"No you dumb whore check history That would be the other dumb whore Hillary","commenter_a":"Why don't you just sit down and be quiet, because you haven't a clue hat you are talking about. You never experienced a thing of what you suggested, and doubt you know that history!","post_message":"According to the great celebrity-turned-philosopher Cher, Trump is now a genocidal murderer..."},{"comment_id":"1279104212107002","commenter_b":"Women should have curves, she's beautiful!","commenter_a":"Love this woman. She is funny and embraces who she is","post_message":"You're beautiful, Melissa McCarthy!"}]
