[{"comment_id":"1700232733582570","commenter_b":"Lose with Cruz.... I like it","commenter_a":"Having recently switched parties for 'one day' Republican status I will vote cruise to stop Trump in April 26 Pennsylvania primary then probably vote for Hillary in November. Question: what is the brand of the dress Nicole Wallace wore today?","post_message":"Joe and Mika are here to discuss the state of the 2016 race following the Wisconsin primaries – and much more! #24Live"},{"comment_id":"1844278629192581","commenter_b":"Yep, only the melon and spice tips make sense.","commenter_a":"It's all a bounch of whooie! Put Kerry in the frig and forget about it!","post_message":"Check your fridge ASAP."},{"comment_id":"10154553649688812","commenter_b":"This is getting ridiculous... Killing them is not necessary..","commenter_a":"As for sending these animals to zoos sanctuaries, etc. That would be the best solution, but those places have limited space and resources. Sometimes there just isn't any option.","post_message":"Colorado officials euthanize baby deer that was picked up by people who likely mistakenly thought it had been abandoned."},{"comment_id":"10153649421859138","commenter_b":"Why would you post such a thing Dan??? Wtf?","commenter_a":"Meanwhile in Chicago this weekend, more people were gunned down by those whose lives matter. But let's not protest that.","post_message":"The Twin Cities Marathon went on today without major disruptions, and police did not make any arrests."},{"comment_id":"1022960277760501","commenter_b":"NO Hillary, Monica, & Bill in the White House ever again. TRUMP for PRESIDENT!","commenter_a":"Madame President Hillary Rodham Clinton and First Husband Bill Clinton January 20, 2017","post_message":"“Girls can do anything.”"},{"comment_id":"10153195806687217","commenter_b":"Thats the day nearly over! They're normal human beings like the rest of us, go to bed earlier! !!","commenter_a":"Yes, specially for night creatures like me ,actually 7-12 pm would be better (It's a fact that your brain is more active at night)","post_message":"Yawn! Should teenagers be allowed to start school at 1.30 pm?"},{"comment_id":"10155433619800500","commenter_b":"The article says nothing about the use of donor eggs, just that she sought fertility treatments.","commenter_a":"High risk of having babies w/birth defects !!!!!","post_message":"TOO OLD or OKAY? This woman is 65 years-old and pregnant with quadruplets. @webpagelink"}]
