[{"comment_id":"1801596090092193","commenter_b":"Rot in jail bitches","commenter_a":"You mean to tell me. These people are so dumb that when they went out to do something this stupid. They didnt know anyone that would or could bail them out?.. That is pathetic","post_message":"Charlotte protesters want people's money for bail."},{"comment_id":"10154951386859655","commenter_b":"Lmfao! Did he refuse to grab her vagina? Awww!","commenter_a":"Arrest is in her future. You don't threaten the life of the President.","post_message":"***BREAKING***"},{"comment_id":"498451153654689","commenter_b":"This is one more reason we need you","commenter_a":"I want to vote for you. However, would you please address the very serious immigration issue.","post_message":"Just spoke to National Right to Life Convention. We are united in cause. Thanks for having me. Defend the defenseless. We are the voice for the voiceless. #HealInspireRevive"},{"comment_id":"862939013836884","commenter_b":"Go away woman.","commenter_a":"I believe she is a bigot for supporting Sharia. Go blow Max.","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"10153162341961051","commenter_b":"That is crap. She should not have been arrested. She could see her children.","commenter_a":"She was making the best out of a tough situation. Geez. A little common sense, please.","post_message":"Simple question: should this mom have been arrested?"},{"comment_id":"10155066009203493","commenter_b":"Yes that's correct and he's taking out costs that we don't own and can start getting our capital to be spent on a structure that works for AMERICA. As opposed to all of these illegal aliens. No matter what the color of the skin is. I am a dual resident to California and Texas. California is beautiful to look at. The government and legislation there is literally nauseating. Whomever hasn't the ability to actually see the the chaos and the self destruction that the literalistic mentality creates is beyond a stupidity that I can even fathom. I got pulled over for tint on my windows. It cost me over $800 after it was said and done. And the levies are less than desirable. The roads are along the same avenue. However you can get on welfare there with ease and pay for nothing. Citizen or not. And the politicians and ...","commenter_a":"Jerry Springer, I mean Jerry Brown is wasting 3.5 BILLION of our money on a bullet train to nowhere , wake up people ! We are sinking ! Our next fight : MAKE CALIFORNIA GREAT AGAIN!!!!!!","post_message":"BREAKING NEWS: It's a storm so fierce, rescuers need rescuing as a firetruck falls into a massive crater. @webpagelink The frightening scene captured by our cameras on I-15 at the Cajon Pass as the freeway crumbles beneath the engine."},{"comment_id":"739722056160975","commenter_b":"Really tom? We are just providing facts, pull your head out of the sand, wake up,,,, sheesh","commenter_a":"it is NOT clear the killer was targeting christians....lying about this for your political purposes is irresponsible at the least. In fact, of the few facts, which have been confirmed about this awful incedent....among the most prominent is that the killer, himself was a christian...Also, that he describes himself as a \"conservative republican\" and that he was obsessed with mass-shootings. Stop lying to advance your political agenda...it's actually a big part of the gun disease gripping this nation.","post_message":"Made me want to cry."}]
