[{"comment_id":"996496440403675","commenter_b":"She would take money from a baby for her own use","commenter_a":"The spineless Republican leaders arent getting the word out that Orlando was a terrorist killing in the name of Allah. The lying left has actually convinced their stupid followers the massacre is a \"gun problem\" rather than admitting this was a radical Islamic terrorist event. Our Country is in BIG trouble when we lose 49 innocent people, and the REAL problem has NOT been identified.","post_message":"CROOKED HILLARY CLINTON: FOR SALE!"},{"comment_id":"10153325376679091","commenter_b":"Send these terrorists back to where they came from","commenter_a":"Coming from the idiot that wants to let all these refugees into our country... pfffft","post_message":"\"Once again we have seen an outrageous attempt to terrorize innocent civilians... We send our deepest condolences, offered our full support to the French people\" - President Obama."},{"comment_id":"1841509832747191","commenter_b":"Cause you are a psycho bitch..","commenter_a":"because your a lying sack of shit!!","post_message":""},{"comment_id":"1237593022967110","commenter_b":"@username Because God made her a woman, SHE chose to be a sinner!","commenter_a":"Mormons are a religious cult not Christian in any shape or form. The only way that woman will ever change will be by the power of the Lord Jesus Christ and him alone.","post_message":"Beaten and made to carry bags of rocks for 18 hours a day"},{"comment_id":"10153191850561051","commenter_b":"Bitch","commenter_a":"Here's a perfect example of \"children aren't born racist, they are taught racism\" That woman should be ashamed of herself.","post_message":"When a mom heard what this lady was saying to her kids, she took out her phone and began recording."},{"comment_id":"760883910715426","commenter_b":"We will give her up to you Iran! Go let her ruin your country!","commenter_a":"Don't you need a brain to be a spy?","post_message":"Is Kim Kardashian West a secret agent?"},{"comment_id":"10153386538275326","commenter_b":"How is he going to run his hotels,if he reports all illegals??","commenter_a":"He mean kill them.","post_message":""}]
