[{"comment_id":"10152658419777894","commenter_b":"Girl Bye!! Bitch Please!! #DelusionalWhore","commenter_a":"Get her life....","post_message":"Say What Now? Joseline Hernandez Says She 'Knows for a Fact' that Cookie Lyon from 'Empire' is Based On Her [Video]"},{"comment_id":"10154602894018145","commenter_b":"wcjb tv 20 out of gainesville covers you daily too.","commenter_a":"Hardly news when you live in the Ocala area............and BTW, we are in YOUR viewing area and could use the same weather 'attention' that Orlando/Daytona/Melbourne get.....especially those of us in the rural area.....thanks","post_message":"MUCH colder weather is around the corner!"},{"comment_id":"1360158044010314","commenter_b":"Yup :)","commenter_a":"Yes, America will get it right. Our next President will be Donald Trump. I pledge to all the women like me not to listen to the media who wants to portray Mr Trump as being against women, please don't listen to it. Mr Trump will be good to everybody in his administration. He is a fair man.","post_message":"THANK YOU, AMERICA! I love you!"},{"comment_id":"1007328145956900","commenter_b":"Then take your ass back to england and leave all the money you made from American box office sales.","commenter_a":"Then go home.","post_message":"Well, that seems a bit over the top."},{"comment_id":"10153755312209170","commenter_b":"These people have no understanding of history. Idiots","commenter_a":"Stupid on steroids.","post_message":"Because dumping tea into the harbor is exactly the same as smashing a window and grabbing a new flatscreen for yourself."},{"comment_id":"10155263002346162","commenter_b":"we have a lyin' idiot Donald Duck, willing to bet with any one, end of this idiot presidency we will have recession, Trump will drive our bus thru cliff","commenter_a":"How can he block news orgs from a 'press' briefing? Are they not 'the press?'","post_message":"JUST IN: White House blocks news organizations from press briefing...@webpagelink"},{"comment_id":"1039779686062503","commenter_b":"Oh dear Lord! Yet you can have these so called \"Barbies\" walk around nude and no brains or respect for themselves or anyone else! They rob good hearted men and steal their hearts and yet this shyt is okay?","commenter_a":"People need to mind their own business if no one is getting hurt","post_message":"Is any place safe for moms anymore?"}]
