[{"comment_id":"10153978069921178","commenter_b":"Rosa, that is not your place to say","commenter_a":"andyou need to get out of the United States","post_message":"Michael Moore goes off the rails (more than usual) in bizarre interview."},{"comment_id":"936551829771205","commenter_b":"The United States is a weapon of mass destruction. NO MORE WAR.","commenter_a":"So you can wittness more families lose their love ones and get richer doung so. How many of your children will you send.","post_message":"The war criminal has emerged from the shadows once again."},{"comment_id":"10155993779265389","commenter_b":"Carson and Fiorina PERIOD","commenter_a":"Dr. Carson","post_message":"From fiery criticism of ObamaCare and the Iran nuclear deal to support for Israel and the rights of the unborn, the top 10 Republican presidential candidates did all they could to define and separate themselves Thursday night during the Fox News debate in Cleveland, Ohio.  Who do you think won?"},{"comment_id":"355920354532026","commenter_b":"She does not care about you!","commenter_a":"okay, the need and movement for change I support and believe in, but sorry HILARY CLINTON no vote from me","post_message":"“We’re hoping that we can partner with Hillary to get some true change for all people.” —Maria Hamilton, mother of Dontre Hamilton"},{"comment_id":"10153881107946680","commenter_b":"Another Misogynist","commenter_a":"\"I'd grown up fearing the lynch mobs of the Ku Klux Klan; as an adult I was starting to wonder if I'd been afraid of the wrong white people all along - where I was being pursued not by bigots in white robes but, by left-wing zealots draped in flowing sanctimony.\" -- Clarence Thomas Vote Trump. He's easier to impeach.","post_message":"\"Long overshadowed by Scalia, the quiet radical is poised to shape his legacy.\" Via POLITICO Magazine"},{"comment_id":"10153876506189726","commenter_b":"Alas, McCain's time as a politician has lasted too long--- in fact, it was too long the day he took office.","commenter_a":"Tell McCain to shut up","post_message":"WATCH: John McCain Has Doubts About Ted Cruz's Citizenship"},{"comment_id":"952115494844980","commenter_b":"Because Mark she would be a WOMAN President!!! That's it!!!","commenter_a":"I'm from Brazil, and i support @username to President of USA. <3 #GoHillary","post_message":"Rising fifth grader Emily had a big question for Hillary in New Hampshire:"}]
