[{"comment_id":"10155014119221178","commenter_b":"Democrats have always gotten away with MURDER!!","commenter_a":"Accountability was not a word he knew--or enjoyed.","post_message":"Talk about a major understatement from The Daily Beast."},{"comment_id":"591316744410090","commenter_b":"Rachel is such a Clinton lover.","commenter_a":"She is as Slimy as he is. All they have is harass Hillary. Guess what. It doesn't touch her. #ConManTrump #Hillary2016 #imwithher #StongerTogether #Trumpstaxreturns","post_message":"What is Donald J. Trump's stance on immigration? Trump campaign manager Kellyanne Conway stops by The Rachel Maddow Show to shed some light.  More from Rachel Maddow's interview with Kellyanne Conway: @webpagelink"},{"comment_id":"704711463000234","commenter_b":"Time to take her out of her tower.","commenter_a":"Nice job with Bill","post_message":"“I have a lot of experience dealing with men who sometimes get off the reservation in the way they behave and how they speak,” Hillary Clinton said."},{"comment_id":"10153474426766350","commenter_b":"u don't have 2 worry then bitch. your pathetic.","commenter_a":"sad and pathetic. marriage between homosexuals is wrong on any level and again the moral majority is forced to put up with this BS. i for one will give no male or female homosexual the time of day much less respect they don't deserve. it is wrong on any count for male and female homosexuals to marry.","post_message":"'Today is beautiful,' said Anna Kendrick."},{"comment_id":"763624153793368","commenter_b":"'@username..Bye Felicia, go suck an egg","commenter_a":"I would waited until he falls asleep, and pull me a loreana bobbitt ...get a Surgical scapple do a nice clean quick slice, get me some tweezers and carry it and throw it on the freeway, and let someone run over it. it ain't big anyway. second scenario, get some super glue and glue his little hands to his little tilwinkle!","post_message":"Did you catch this moment from Melania Trump at the inauguration?  Via In The Know"},{"comment_id":"10153496475494575","commenter_b":"'She has since filed an appeal.' Wow! She has some f***ing nerve!","commenter_a":"Horrible, horrible person.","post_message":"An 8-month-old baby girl died after an EMT refused to respond to the call.  The EMT told her boss, “I'm not about to be on no scene 10 minutes doing CPR, you know how these families get.'"},{"comment_id":"1336023863131032","commenter_b":"Ppl crazy af time for u ta go","commenter_a":"Renata","post_message":"The female had to get some  in too. #WSHH"}]
