[{"comment_id":"1006130662760739","commenter_b":"And that White women take full advantage of affirmative action every day, it's not just for black people","commenter_a":"Does he ever need a history lesson. Start with 'When Affirmative Action Was White,' and 'The Half Has Never Been Told,' to start.","post_message":"The famous actress' brother brags about manipulating affirmative action policies to get into medical school."},{"comment_id":"10153362630049641","commenter_b":"Whatever tickles your fancy. Hope you get a free lifetime of ky jelly .","commenter_a":"This country is going to hell in a hand basket.","post_message":"The White House takes on rainbow hues to celebrate the Supreme Court's marriage equality decision: @webpagelink"},{"comment_id":"970914179695452","commenter_b":"Shut up!","commenter_a":"Proof that even when your dad is the ex-President and your mom is the future president, family pictures are still a disaster P.S. It is a joke. You all need to chillax!","post_message":"Happy Father's Day, Bill!"},{"comment_id":"10153232684759030","commenter_b":"'Run, bitch! RUN FOR YA LIFE! GET SOME HELP!'","commenter_a":"Kristian Pollard Elisha Lloyd","post_message":"#ThrowbackThursday to Wayne Brady using the ATM on Chappelle's Show. #TBT"},{"comment_id":"401125753409052","commenter_b":"Josh go live with the muzzies and obey THEIR laws in their land!!!","commenter_a":"It should be like that in America, too!","post_message":"'I don't want to take off my Muslim Head Covering in Court'..."},{"comment_id":"10153170547614170","commenter_b":"She will find a way to get out of it!!","commenter_a":"The Clintons are just like Obama, Lerner & Holder who all believe they are above the law.","post_message":"I don't know if people realize how big this is. It's such a serious violation of the law, even the New York Times is calling her on it And it's all because this woman is an obsessive control freak."},{"comment_id":"928788953880826","commenter_b":"What a dumb bitch","commenter_a":"One less cracker...","post_message":"Because death is better than letting two people celebrate their love for each other."}]
