[{"comment_id":"987010284749083","commenter_b":"oh i would get me a few mini pigs i can have 3 here in my town in town. then i would put pig crap on the lawn all around my home i would be so mean. if i could hear them i would call the cops everytime make it a real pain","commenter_a":"Dope, I'd have pork on the grill and my guns loaded and pointed right at it. A sign saying come and get it, your choice on which one you want","post_message":"What would YOU do if you were put in this situation? Choose one of the two options! @webpagelink"},{"comment_id":"1728764820743963","commenter_b":"That lady is just jealous because she is a mean n nasty lady n because she COULDN'T do it she has to be a d-bag....good job Bindi","commenter_a":"People are very cruel. God bless you bindi and your family. You were amazing and your dad was watching you sweetie .","post_message":"Oh no... I'm praying for Bindi Irwin."},{"comment_id":"10154742351861336","commenter_b":"Insane b.s. But Hillary is a free woman. Wtf","commenter_a":"When I went to vote in the primaries, there were people wearing Hillary shirts and they had signs and were giving out stickers. Oh I guess it's OK for Democrats. :/","post_message":"A Donald J. Trump voter in Texas was arrested Monday for wearing a T-shirt to the polls that mocked Hillary Clinton’s infamous comment in which she said half of Trump supporters were “a basket of deplorables.”"},{"comment_id":"10154710996716800","commenter_b":"HHHHHHHHHHHHHH MRDOH hhhhhhhhhhhhhhhhhhh","commenter_a":"Ilyass darori tchouf had lvid XD","post_message":"Ronny Chieng makes a desperate plea to a batch of undecided voters ahead of Election Day. #election2016"},{"comment_id":"1721173881464308","commenter_b":"All lies, the smile to fool American's! No woman shouls allow to ru for prseident on Bil's Lewinski nasty in the White on principle alone on top of all the dangerous mistakes and incompetence that runs throyugh her desparate veins. Souless human!","commenter_a":"AMEN!!!!!!.......","post_message":"Breaking News: Hillary Clinton has clinched the Democratic nomination for president, according to The A.P."},{"comment_id":"455232604658620","commenter_b":"Hillary Clinton!!!","commenter_a":"Bernie Sanders!!!","post_message":"Listening is always better."},{"comment_id":"10156528764475594","commenter_b":"shut up, entitled lady","commenter_a":"Wow! A plethora of opinions...negativity abounds! What happened to \"if you can't say anything nice, don't say it at all\". I usually don't post but...","post_message":"#BREAKING: According to a report, Scalia arrived at the ranch Friday and attended a private party. When he did not appear for breakfast, a person associated with the ranch went to his room and found a body."}]
