[{"comment_id":"10154059836575667","commenter_b":"follow please Happiness is not that owns everything you see beautiful, but happiness can see all of its holdings beautifu","commenter_a":"What a nitwit, well good for him, a felony record for life, he earned it and deserves it !!! Hope he gets at least a year to boot !!","post_message":"Will the man who destroyed Donald Trump's star on the Hollywood Walk of Fame go to jail?"},{"comment_id":"737985369668440","commenter_b":"Madwoman as bad as Obama, she must be Satan's tool...","commenter_a":"Angel of death!","post_message":"By BI\" She wants to recruit even more African and Balkan Muslims to fill positions as doctors and electrical engineers. Notice the stunned looks on the people who are listening to this rubbish. @webpagelink"},{"comment_id":"1569991603060963","commenter_b":"Oprah is a piece of shit.","commenter_a":"Ignorant celebrity","post_message":"It's all about the win for 'your side'."},{"comment_id":"1368750766478283","commenter_b":"She was with a child!","commenter_a":"This women is a stupid and ignorant person I hope there were no kids around that can very easily copy this stupid act","post_message":"Toronto Zoo officials said the apparent retrieval of a hat was \"a very bad idea\" @webpagelink"},{"comment_id":"629045897266731","commenter_b":"no - if they want to work, they must follow the rules of the company, not shariah law.","commenter_a":"omg,.... to quote Faye, No more 'political correctness' for me. I am getting tired of this \"FAVOR\" at the expense of the average AMERICAN citizen. ANY business ANY where in the USA that refuses to fly the AMERICAN Flag, that honors false Gods.....will not get my business, Period!!!","post_message":"Home Depot Embraces Shariah Law With ‘Muslim Sensitivity Training’. They are submitting to societal pressure. Do you think Shariah Law has no place in America?"},{"comment_id":"10154324384701600","commenter_b":"This has been going on, way before the flood of people started moving here. this is what happens when a predator looses it's fear of humans","commenter_a":"Its because so many people are moving to Colorado. There are more homes and apartments being built and the more we build the more we invade their homes. It becomes harder for then to hunt for food. So then they move into our towns and cities because people leave trash around everywhere.","post_message":"Update: 5-year-old boy survived the attack. His mom fought the animal off. The boy is being transferred to a Denver hospital in fair condition."},{"comment_id":"1178341715558004","commenter_b":"LOCK HER UP!","commenter_a":"You hate hillary (so do i) but you pick a man that can't beat hillary.. we've got big problems come election time.","post_message":"Donald J. Trump, Sen. Joni Ernst, and others campaign in Iowa at the Iowa senator's second annual Roast and Ride."}]
