[{"comment_id":"10153631215978984","commenter_b":"Please take the baby away and never should she get back any of the children. Also, make sure that she cannot have any more kids.","commenter_a":"What a shame...","post_message":"The cops got the call so they went to this pregnant woman's home... but once they got there, they were stunned at what they saw. This was not something they had been trained for... they will never forget this."},{"comment_id":"10153313439013984","commenter_b":"Sick bitch...you go girl..to hell","commenter_a":"She fed the hungry so all you people that have never been hungry think about that you idiots some people don't know what its like to have an empty belly so you go girl","post_message":"The disgusting hatred from the left never ceases to amaze me. Do you support this young woman?"},{"comment_id":"10153877529004778","commenter_b":"Yup she's a joke","commenter_a":"Why because they know she going to give them a run for there money..","post_message":"\"Rarely in the history of any criminal case has a prosecutor so directly maintained so many conflicts of interests,\" the motion declares."},{"comment_id":"10153062603882235","commenter_b":"What is it about the name Cheney that brings out the stupid? Good God woman shut the hell up and stop sounding like your father. smdh","commenter_a":"Blackface was always intended to degrade. Drag is something else entirely.","post_message":"Mary Cheney — the lesbian daughter of former Vice President Dick Cheney — asked in a Facebook post this week why drag performers are allowed to blur gender lines in their work while society frowns on the form of racial minstrelsy known as “blackface.”"},{"comment_id":"974683422567079","commenter_b":"Ignore this woman! NWO!","commenter_a":"The people that surround her, and adore her, are walking dead at best....gonna be a blast to watch her debate a Socialist in the Democratic debate, hope the POS screws up royally.","post_message":"PROOF that the liberal media is in the bag for Hillary!"},{"comment_id":"10154120188266770","commenter_b":"She is not funny anytime","commenter_a":"It painful just to watch het","post_message":"Amy Schumer was hard to watch."},{"comment_id":"10155811623205594","commenter_b":"You are $hit. This is about a little girls recipe. keep your poitical agenda where it belongs. in the crapper","commenter_a":"Must look like SH!T...","post_message":"Barack Obama told her it was a standout dish for him."}]
