[{"comment_id":"10153734549101323","commenter_b":"Fucking Liberal fucks! Feminist whores! Leave Star Wars alone!","commenter_a":"I'm not sure whether the viewer would have got the right impression of Jabba if instead of enslaving Leia he'd have given her a thatcheresque power suit and asked for her opinion on current affairs!","post_message":"It's one of the most memorable, weird, gross and resonant moments from The Return of the Jedi, and from Star Wars in general – and Disney is working to disavow it."},{"comment_id":"10156496631915354","commenter_b":"Send her back, bitch!!!","commenter_a":"She is simply unqualified...","post_message":"This radical Leftist principal is out of control.  The principal's name is Eujin Jaela Kim. And what she's up to will infuriate most Americans."},{"comment_id":"10154257550106491","commenter_b":"Beyonce is racist scum","commenter_a":"Fuching nightmare.","post_message":"It's the ultimate playdate."},{"comment_id":"499065056962019","commenter_b":"I can't stand her. Send her back to India where her parents are from.","commenter_a":"We can't let the GOP pick and choose who they want in office. It is up to the voters! GOP take notice, heed our warning, because if this does happen, and Donald becomes and independent; there will be. Democrat elected!","post_message":"Now that she criticized him, will Donald Trump snuff out Gov. Haley's rising star?"},{"comment_id":"10153842818632483","commenter_b":"The girl ran right up and smacked him.........you go girl !!!","commenter_a":"He needs his nuts cut off and ducked taped in his mouth till he bleeds out.","post_message":"Surveillance footage shows an oak tree at Toomer's Corner being set on fire after Auburn's win over LSU Saturday night. Read more here: @webpagelink"},{"comment_id":"10153181393497377","commenter_b":"Putin gives you a hard on? What's that say about you?","commenter_a":"Yah , They cant hide from the Russians is what he ment .","post_message":"Obama to ISIS Leaders: \"You Cannot Hide\""},{"comment_id":"1118814734807982","commenter_b":"174742062548592helle Tenney let it first be understood I can care less for evil feminist. My point is why go to a frat house that is known for Alcohol drugs and loose women having sex up stairs, when you know inappropriate things always happen in places like that. Secondly, I'm sure she was there drinking in an unsafe environment but I don't condone anyone being raped but we should ask ourselves why the Hell do women keep going to places that are historically unsafe for women? Lastly, women lie so much about rape and other things that no one knows when they are telling the truth. There has been several times when men have been falsely accused of rape and we found out later that she was just trying to cover up the fact that she decided to sleep with the whole football team at once. I see the police reports ...","commenter_a":"Ok but why was she even there in the first place?!!!!!! Why do girls go into Frat houses?!!!!","post_message":"Sexual assault on US college campuses is a major problem  and we can't ignore it any longer. In an exclusive interview, US Vice President Joe Biden outlines how he's leading the charge to change the way we fight this epidemic  by going straight to the source.  Get the full experience at mic.com/enough"}]
