[{"comment_id":"1864804617087505","commenter_b":"Are you high lady??","commenter_a":"President elect Donald Trump is a very sharp guy... He understands how bad America has been divided. Maybe Trump is trying to get a message through Kanye to America, that we need to stop all the violence and hatred. United States! Not Divided States!","post_message":"Mr. West is in the building.   Watch Kanye walk into Trump Tower and read more about his visit with Donald J. Trump here: @webpagelink"},{"comment_id":"464672456990682","commenter_b":"Fire her.","commenter_a":"Go to jail and never see the sun again.","post_message":"Do you believe this lady has the right to continue to defy the law?"},{"comment_id":"654122978061007","commenter_b":"I know you do","commenter_a":"Omg I want to hold one!!! @username","post_message":"PANDAMONIUM: 4-month-old giant panda cubs at The Toronto Zoo are learning to walk."},{"comment_id":"10154635792157599","commenter_b":"The GOP is better than this. The USA is far better than this. Be bold, represent your district, and stand against the unconstitutional, corrupt administration that has taken office. The administration's actions should be leading Republicans and Democrats in Congress to work closely together and assert power as the legislative branch, rather than acting as an extension of the executive branch. #NoBanNoWall","commenter_a":"Congressman Reichert, I believe it is important to remember that the United States of America is a REPRESENTATIVE republic. As our elected REPRESENTATIVE, please REPRESENT the people of your District. You were elected to REPRESENT the people of the 8th Congressional District of the State of Washington (NOT Donald Trump).","post_message":"Careful vetting to ensure the safety of the American people is the responsibility of the federal government and one I take very seriously. Unfortunately what we saw this past weekend was mass confusion and miscommunication between government agencies and the improper apprehension of people legally allowed to be in the US. I urge the administration to work with Congress on solutions that protect our borders while maintaining our nation's dedication to compassion and religious freedom."},{"comment_id":"10154010252346350","commenter_b":"The kid didn't make a mistake. If she was driving drunk then she committed a crime. Having someone plow into your home is not only traumatic at the time of the event, but then there are all of the repairs to deal with. It can take months to get it all put back together. And insurance doesn't cover all of the costs. Guess who gets to pick that up. Not the kid. She wasn't over reacting. If anything, she was quite conservative. I would have gladly beat the stuffing out of the one that hit us.","commenter_a":"I'm probably the only one who is think Kim... Is.. Well... Being a little actress like in all these tweets. We get it. The kid made a mistake. One that could of been fatal. One tweet is probably good enough (if at all) but like 4? Get a grip Kim. Ridiculous.","post_message":"'This young girl could have killed herself, her friends, and me. Frightening.'"},{"comment_id":"1308394922562170","commenter_b":"Go build the wall then","commenter_a":"Put them in jail and large fine, deport the illegal immigrants now, cut federal funding, build the border wall, close all sanctuary cities/schools, take care of Americans/veterans first, if they legal learn our laws, constitution, and English , this is our country and if they don't like, they leave.","post_message":"A protester burns an American flag during marches through Olympia today. Video from The Olympian.  Latest updates: bit.ly/2j3yanl"},{"comment_id":"826467044152094","commenter_b":"Is Hillery totally without fault? Let's look over her speeches. Hillery would say 'WHAT DIFFERENCE DOES IT MAKE!'","commenter_a":"Give it up Matt . Hey Matt how about Hillary apologize to the American people for all the lies she told and those four dead Americans she left to die in Benghazi 😡","post_message":"NBC's Matt Lauer is still OBSESSED with Melania Trump's speech. #RNCINCLE"}]
