[{"comment_id":"10154669913269843","commenter_b":"Well some of those people must be women with phones.","commenter_a":"Yay! Maybe traffic will be better!","post_message":"\"A Day Without Immigrants\" actions are planned across the U.S. in cities like Dallas, Austin, Philadelphia, Washington and Boston... bit.ly/2kz5UXf"},{"comment_id":"10153224902339411","commenter_b":"Jonathan Toothman","commenter_a":"75% of that data is outdated wrong and non existent. i always give fake info when they ask","post_message":"Quick before NSA snaps it up"},{"comment_id":"642371742620071","commenter_b":"Her fat ass needs to get a job and off the government tit. She is a disgrace to the white race.","commenter_a":"Th dems way of welfare hz put many ppl out of th mindset of personal responsiDAMNbility!!!?","post_message":"This woman claims she deserves more welfare than others.  This is unbelievable. Let's kick this woman off welfare immediately.  Should she be forced to pay us back?"},{"comment_id":"10156396288885354","commenter_b":"If you want refugees you can have them but please build a containment wall around your state!","commenter_a":"Yes, if it is truly about safety, then they can stay in the Middle East, and we can help provide for them, which would be the right and just thing to do. They are human and most are probably good people fleeing a civil war. No need to be sent to the United States.","post_message":"\"There is no reason America cannot create a safe zone for these refugees in the Middle East. That is the most compassionate thing to do for them. It is the safest thing to do for America. The only reason Obama is risking the safety of Americans to bring them here is to feel sanctimonious and to divide us.\""},{"comment_id":"1214601541965192","commenter_b":"Y don't y'all go look up great migration n u do kno all white ppl ain't rh+ either meaning not descended from monkeys smh ignorance at its finest pick n choose shit to push ur retarded ass agenda","commenter_a":"Awesome. Teach them early. I'd rather my kid learn to hunt and survive than play on a phone or tablet all day.","post_message":"How do you feel about this?"},{"comment_id":"10153627073939170","commenter_b":"It's gone too far when instead of protecting himself he thinks of the headlines to come and takes a beating.. Time to put the animals back in they're cages.","commenter_a":"I don't have military training or police training but why couldn't an officer shoot towards the legs and feet to attempt to wound or even scare and attacker. I know you would have to worry about the femoral artery and even ricocheting bullets but I seriously doubt every round fired allways hits the intended target when trying to shoot at center mass.","post_message":"Way to go, media. The crooks know the score now and they're taking full advantage."},{"comment_id":"10152649909240950","commenter_b":"Yeah you stupid pussy!","commenter_a":"We'll all be speaking ISIS by Sunday","post_message":"Here is what would happen if DHS runs out of money on Friday:"}]
