[{"comment_id":"10153359529326051","commenter_b":"I would have beat her ignorant ass with a stick too. Hopefully karma hits her with a Mac truck.","commenter_a":"And that is why I dont trust daycares","post_message":"When this woman's 2-year-old son came home with these marks on his leg, she marched down to his school and demanded to see the surveillance footage. Now she's even more outraged."},{"comment_id":"10156072867635389","commenter_b":"Ramos was rude but so was Trump.","commenter_a":"Trump of course","post_message":"Question of the Day: Who do you think won last night’s exchange: Jorge Ramos or Donald J. Trump?"},{"comment_id":"849566101841798","commenter_b":"Ignore Spenser Jeffery, he's bankrupt, c);-)","commenter_a":"God Bless this wonderful man! God bless his family and many friends. You truly lost a good man. Prayers and all the respect in the world to him and his family!! Please holy father, take this wonderful soul into your loving arms, amen and amen.","post_message":"\"I swear to God I love this city but I wonder if this city loves me,\" slain officer Montrell Jackson wrote on Facebook earlier this month."},{"comment_id":"978977272143131","commenter_b":"I agree. That's a spot on observation. I never thought about that, but it's true. Many feminine topics make people uncomfortable. Whether it be hygiene, sexuality, or social treatment. All common topics for comedy.","commenter_a":"Honestly, I think a lot of the reason men don't find women funny, is because men AND women are trained to see things from a man's perspective. I can hear a boner story and laugh my ass off because I can imagine what they are telling me and it's amusing. So much of what women comedians talk about are things that men feel they can't relate to - they've never thought about most things from a women's perspective. Just my two cents though...","post_message":"First it sounds ridiculous. Then you get it. Then it's hilarious and sad all at the same time. - Eric March"},{"comment_id":"10153375690709087","commenter_b":"Stop any and all immigrants from coming in until we can financially take care of our own first","commenter_a":"Even BB knows it's not just a \" religion\"....","post_message":"Benjamin Netanyahu - בנימין נתניהו \"rejects Donald Trump’s recent remarks about Muslims,\" the Israeli Prime Minister's office said in a statement. \"The State of Israel respects all religions and strictly guarantees the rights of all its citizens. At the same time, Israel is fighting radical Islam which is attacking Muslims, Christians and Jews alike and threatens the entire world.\""},{"comment_id":"1738569013030719","commenter_b":"Hoe","commenter_a":"Alex Keira Keir Craig","post_message":"I'm gonna make love in this Snapstory with you, Usher."},{"comment_id":"1220979514606949","commenter_b":"That's always the answer huh fellas,if you feel this strong about it how about throwing some fist,oh I forgot you can't fight without guns.","commenter_a":"Until the authorities start treating these \"protestors\" Like the domestic Terrorists they are the riots will continue. And they will get worse! Time to take off the PC shackles and get down to business! It all starts from the top. As long as the Democrats are in the White House this will get worse. Elect Trump 2016.","post_message":"Many people have been arrested in Charlotte, North Carolina after the past several days of protesting and rioting. 70% of those who have been arrested have something in common, and it leads to a lot more questions about who is really behind all this..."}]
