[{"comment_id":"10153822005111519","commenter_b":"It doesn't fit her","commenter_a":"Plus not just only black ppl have this done. White and other colors do 2.","post_message":"Lil’ Kim’s bleached skin and blonde hair are the tragic result of sexism, racism, colorism"},{"comment_id":"10156430237125294","commenter_b":"Lol the military spread photos with weapons like we were suppose to","commenter_a":"As a photographer I wouldn't have taken this picture. A girl and her bow is a great idea. But not in a threatening manner like this.","post_message":"She has to give the school another photo. But, her mom is asking why someone else was allowed to do it in the past..."},{"comment_id":"1902414739981573","commenter_b":"Do these woman have any idea how stupid they are?","commenter_a":"How stupid","post_message":"Whoopi Goldberg: Right to Celebrate Christmas is the Same as a “Woman’s Right” to Abortion"},{"comment_id":"10156646291425093","commenter_b":"@username there is such a thing as legal immigration !","commenter_a":"You traitor establishment Repubicans are a discrase. Donald Trump for President of the United States","post_message":"Donald J. Trump wasn't against  interests. He was special interests -- and did his best to run people out of their own homes."},{"comment_id":"10153546316384714","commenter_b":"Piss off Clinton and go smack your ugly wife.","commenter_a":"You can take the black out the ghetto, but you can't take the ghetto out the black.","post_message":"Johnson was dismissed just hours after a video of him punching a woman was released"},{"comment_id":"10152619091801636","commenter_b":"Read, stupid cow, before you open mouth: @webpagelink","commenter_a":"Smart people. Never vaccinate your baby!","post_message":"'The UK's anti-vaccination movement is alive and well, and we can't ignore it'"},{"comment_id":"1713198075600647","commenter_b":"CRIMINAL WOMAN FOR JAIL!","commenter_a":"Some people in the USA will say anything to keep a woman from becoming president. The most investigated woman in US history has no charges against her, no trial coming, and no convictions. This is the definition of not guilty, and yet so many continue to make accusations! Trial by rumor and innuendo!","post_message":"Americans don’t need conspiracy theories and pathological self-congratulations like those offered by Donald Trump. We need leadership, common sense, and concrete plans."}]
