[{"comment_id":"633174346857148","commenter_b":"You are absolutely correct. And, this was a time of turmoil in our country. How the times have changed. It's sad isn't it??","commenter_a":"Thousands of young people got together for 3 days of music and partying and no one got killed or caused havoc. It could not happen today.","post_message":"On this day in history, the Woodstock festival debuted on a dairy farm in New York in 1969. Do you remember the original Woodstock?"},{"comment_id":"10154285829964641","commenter_b":"And all of you need to stop sucking this mans dick. He didn't even play today","commenter_a":"Props to Portugal but why does Ronaldo get to be front and center??...let the guy who scored the winning goal get the glory.","post_message":"Portugal gatecrashes France's UEFA EURO 2016 party... and all without Cristiano Ronaldo."},{"comment_id":"1871694196449652","commenter_b":"Bahaha Anna O'Toole","commenter_a":"Kaylee Parsons-Cordrey Jessica Shoffner k I don't really give a fuck about either of them but ajdvabsjz skz yes","post_message":"The most bromantic sign of the day."},{"comment_id":"10152562554341636","commenter_b":"Time to persecute muslims everywhere.","commenter_a":"I will never support terrorism but I also think we have to respect other people's religions...","post_message":"Ahmed Merabet had raised his hands up in surrender before being shot dead..."},{"comment_id":"783781558433266","commenter_b":"That's the truth! Their acting like that's what they won't so people think their real. Lol! Their both scared and they should be! Trump the only one can beat Hillary or sanders!","commenter_a":"Move on.org, BLM and now Bernie supporters, are all DOMESTIC TERRORIST GROUPS OF AMERICA. They all need to he arrested! This is not protesting, this is organized violence!","post_message":"The last person that Hillary or Bernie want to run against is Donald Trump --- and that is fact!"},{"comment_id":"10154879829717178","commenter_b":"They are not moving anywhere. Btw transgender is not a protected class.","commenter_a":"BOA is in talks to move it's headquarters out of Charlotte because of the discrimination law. Way to go State Politicians.","post_message":"House Bill 2 has just about everything an editorial cartoonist could want: a well-known story, controversy, key players to lampoon, and toilets. Story >> wral.com/@username"},{"comment_id":"10152925844701336","commenter_b":"Yay!!! Nice yes one girl!!","commenter_a":"I've read the back of the book... And I hate to break it to ya, but the Christians win!!","post_message":"ISIS has released a new beheading video which includes a direct threat against President Obama."}]
