[{"comment_id":"821893891240198","commenter_b":"Yes she does I don't believe not one of them dumb as hoes","commenter_a":"If Phylicia Rashad wasn't present when these incidents (allegedly) occurred, (but I would bet they did), then she has nothing of concrete value to say.","post_message":"“Forget these women. What you’re seeing is the destruction of a legacy.\" - Phylicia Rashad"},{"comment_id":"10153683499520530","commenter_b":"Whore","commenter_a":"DA FAQ??!!! Dump this girl she has no self respect .....she's probably screwing him behind his back","post_message":"He decked the guy after he touched his girlfriend's rear end several times. Now she's upset and wants him to apologize."},{"comment_id":"1137409276317081","commenter_b":"Hillary threatened by a female!? The Republican Party just makes me laugh!","commenter_a":"Hillary Clinton threatened by Melania??? lol give me a break.","post_message":"\"It's just another example of... when Hillary Clinton is threatened by a female, the first thing she does is try to destroy the person\": Donald J. Trump's campaign manager Paul Manafort addresses allegations that Melania Trump's #GOPConvention speech was plagiarized @webpagelink"},{"comment_id":"10153699809290496","commenter_b":"Haha their wives might...lol","commenter_a":"As long as they bring home the gold, who cares??","post_message":"Three members of Team USA basketball reportedly ended up in a high-end brothel, but it was an apparent misunderstanding: @webpagelink"},{"comment_id":"522078421311711","commenter_b":"Mostly False???? What's that ???? A little white woman lie???? Liar is a liar is a liar period!!!","commenter_a":"Did any of them Lie to the FBI or Congress? YOU DID!!!","post_message":"Fact check: The Republican National Convention speakers are lying to America—at least 67 times so far."},{"comment_id":"822359307886042","commenter_b":"It was meant for this baby to live","commenter_a":"God directed that Officer to the area. He is Hero","post_message":"A newborn girl thought to be only 36 to 48 hours old was found alive in Compton on Friday. The baby muffled cries led sheriff deputies to find her buried under pieces of asphalt and rubble inside a crevice near a riverbed. Detectives are now asking anyone with information to come forward. this post to alert others. Read KTLA story here: @webpagelink"},{"comment_id":"1001474073269501","commenter_b":"Muslims consist of .9% of our population. Bigotry around 20%","commenter_a":"I disapprove! He has caused nothing but destruction! The flooding of illegals and Muslims! They are murdering innocent Americans! Obama just sits back and enjoys the show. He lies about his crimes like Hillary does. I'll enjoy the show when Trump is president and arrests your ass!","post_message":"Do you approve or disapprove of the job President Obama is doing in office?"}]
