[{"comment_id":"678882268945673","commenter_b":"Rosie has the mental disorder! She is a raving maniac!","commenter_a":"I thought she was moving....","post_message":"WOW! Leftist Bully ROSIE O'DONNELL Pushes Horrible Rumor On Social Media...Suggests Barron Trump Has Mental Disorder [VIDEO]"},{"comment_id":"10153181017133690","commenter_b":"Okay white terrorist","commenter_a":"Christian Terrorist","post_message":"\"This was not a dispute over a parking space, this was a hate crime,\" Mohammad Abu-Salha, the father of the two slain women, said. \"This man had picked on my daughter and her husband a couple of times before, and he talked with them with his gun in his belt. And they were uncomfortable with him, but they did not know he would go this far.\" @webpagelink"},{"comment_id":"10153628847251336","commenter_b":"Shes so nasty","commenter_a":"She is a disgusting person trash","post_message":"What did you think of Miley Cyrus' barely-there ensemble?"},{"comment_id":"10153981552219641","commenter_b":"I could care less how racist this is, but Belgium needs to deport every last Radical Muslim!","commenter_a":"Jai shri krishna Namaste.ji","post_message":"\"We will do whatever is necessary to support our friend and ally Belgium...\": U.S. President Barack Obama comments on Brussels terror attacks. @webpagelink"},{"comment_id":"525067284350518","commenter_b":"Leave our country. Go home and behead your own.","commenter_a":"Leave!","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy.  Let them be angry. This America and if you don't like it, get out.  Do you agree that Muslims should assimilate or leave?"},{"comment_id":"786579818199262","commenter_b":"He SUCKS DICK..........","commenter_a":"Dangerous would be the truth.","post_message":"BREAKING: Obama Makes Sickening Announcement, This Will Cost Lives  He will ruin this country before his term is up.  Do you think Obama is reckless?"},{"comment_id":"10154389291904614","commenter_b":"@username....Aka: RACIST!!","commenter_a":"I don't wanna sound racist but did you know 68% percent of rape is commited by African americans in los angeles spew on me all you want I got the statistic straight from the FBI website","post_message":"LAPD is looking for a man who tried to sexually assault an 80-year-old woman in her Hollywood apartment, leaving her in critical condition and still sedated due to her injuries.   The victim opened the door to the attacker after he knocked, apparently targeting her at random, police said. He pushed into the apartment and beat her, but she was \"feisty\" and able to fight him off, an LAPD captain said.  The man, who was caught on surveillance video, is described as a black man 25 to 30 years old, 6 feet tall, 220 pounds. He wore a black Penn State hoodie at the time of the attack."}]
