[{"comment_id":"10153689334397869","commenter_b":"Locked away in a prison? So that your tax dollars can feed him, cloth him and pay for the medicine when he is sick. There is already a fence up and they scale it. If you build a bigger wall then they will just dig tunnels.","commenter_a":"Governor, I've always respected you. I voted for you when you ran for president eight years ago, and I was proud to cast that vote. That said, wouldn't it be better to have him arrested and locked away where he can't do any more harm, regardless of what side of the border he's on? I'm concerned that having a \"deport the criminals\" stance fuels a xenophobic mentality that all illegal immigrants are dangerous criminals. Also, there's no way to ensure he stays deported for good, even with a wall. Lastly, it seems to imply that if he's a danger to society that we don't care about the lives of people outside of our borders. Aren't humans worthy of human dignity regardless of what side of the border they're on? Imprisonment seems like the best option. I'm genuinely curious, and would appreciate an honest, civil discussion.","post_message":"Prayers today for the family of North Texas firefighter Captain Peter Hacking, who was killed along with his four-year-old stepdaughter and 22-month-old son when a van veered into their lane and hit their car head-on. If the van driver recovers, he’ll be charged with criminally negligent homicide. Let’s hope that’s also enough to get him deported for good, since he’s an illegal immigrant who was already deported in 2008, but came right back across the border. Normally, I’d link to a news site for more, but I’d rather that you read it here. It’s the GoFundMe page set up to help Captain Hacking’s widow and his surviving son and four step-children:"},{"comment_id":"10153432953951130","commenter_b":"Its not hard at all. Check craiglast there everywhere. I can sell you mine. Thats the point!!","commenter_a":"It's such a pain in the ass to get guns now. Why would anyone want more gun laws?","post_message":"A majority of Americans want stricter gun laws, and now we have the poll numbers to prove it."},{"comment_id":"228156194316478","commenter_b":"Trump 2016, Trump 2020","commenter_a":"AND THAT'S Y HIS ASS GOT TO GO!","post_message":"WOW. Listen carefully... EVERYTHING she said back then was right! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"692454430859640","commenter_b":"WE have NOT gotten the message!!!","commenter_a":"we got the message a long time ago...when will corporations take care of their responsabilities","post_message":"Gray Whale Dies Bringing Us A Message The Entire World Should See"},{"comment_id":"10153292399553984","commenter_b":"He has it coming to him.","commenter_a":"yes I do","post_message":"Obama's big plans have blown up in his face! That's got to hurt... Do you hope Obama finally gets the message?"},{"comment_id":"10153140551051051","commenter_b":"Absolutely. It's a broken system. What I don't get is that in any other country if you enter the country illegally, you get sent back. Why is it soo hard here for that to happen? It's a bigger problem then an illegal person killing another person. Maybe it's time to close the borders and get our country and its laws in order?","commenter_a":"deport trump to mexico...","post_message":"The man who had been deported 5 times before killing an innocent S.F. woman entered a surprising plea. Do you think he's an example of how the current immigration policy isn't working?"},{"comment_id":"10154622276758797","commenter_b":"😂😂😂😂😂","commenter_a":"Iveeno Wallace this time only ur teeth match.","post_message":"ABDUCTION ALERT: Look like anyone you know? #Chicago Police have released a sketch of a man suspected of trying to abduct a 14-year-old girl in the Roseland neighborhood. Important details, here: @webpagelink"}]
