[{"comment_id":"930011010437419","commenter_b":"Lady u need help fuck grump","commenter_a":"\"Semame?\" Really, is spell checking really that difficult? I'm only pointing this out because it's a constant with your memes and videos. As funny as they are and as much as I enjoy them, please, for the love of God, use spell check. You look like buffoons when you misspell such easy words.","post_message":"WATCH: 10 years ago, Sesame Street called out trashy Donald Grump.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"841624465874895","commenter_b":"Feminazi to the ugly bone!","commenter_a":"Good for him, shame on his wife.","post_message":"\"When the doctor came out, he said 'there’s a real problem with your son.'\""},{"comment_id":"1328759877154299","commenter_b":"Karen >>> Integrity is not exactly an attribute of the Leftists. BIRDS of FEATHER, flock TOGETHER!","commenter_a":"My message to these \"journalists\". I don't care if you're talking about Trump, Obama, Clinton, or aliens. Using that kind of language is a disgrace to your job, which you obviously don't deserve. Your blatant disregard for any kind of integrity obliterates any credibility or respect you had with me. If you expect people to listen to you, make your use of language worth listening to or find another career that better employs your lack of ethics, if such a thing exists. Good luck with that.","post_message":"If a journalist said this about Barack Obama, the collective outrage from the press could be measured on the Richter scale."},{"comment_id":"10154028997088132","commenter_b":".. she is ugly","commenter_a":".. & soo - Kris Jenner is ugly","post_message":"Grandma Kris Jenner has arrived!"},{"comment_id":"1231532310220572","commenter_b":"And male or not, you're a cunt","commenter_a":"The dirtbag can pick anyone he wants, Congress has no obligation to endorse the fascist's choice. Speaking of the Constitution. GOP won't be re-elected if they pass any nominee appointed by Ovomit.","post_message":"BOOM!"},{"comment_id":"1017654374977457","commenter_b":"But if you don't punish them and just deport them, they will be back in a matter of days ! Secure the borders and then release them all back to mexico !","commenter_a":"Depends, they should first pay the consequences for their criminal behavior and then be immediately deported. Maybe the consequences should include the death penalty, financial remuneration, work to give back to the community, such as the CCC did under FDR and the DNC.","post_message":"Donald Trump and Ann Coulter think that immigrants that commit crimes should be deported right after being convicted. What do you think?  Vote in the poll and have your voice heard!"},{"comment_id":"10154130394501545","commenter_b":"@username I think CNN is giving you false hopes. You might want to turn off the biased media.","commenter_a":"I love how \"news\" organizations report this as news. Headline should read \"Professor got lucky with one correct prediction, and hopes another will come true.\"","post_message":"A professor who has correctly predicted the outcome of every presidential election since 1984 has a new prediction..."}]
