[{"comment_id":"1024542317579852","commenter_b":"@username, Planned Parenthood doesn't sell body parts and those that say they do are lying","commenter_a":"Thanks to the fact that the local Planned Parenthood clinic was closed down in Scottsburg, testing for AIDS and other diseases was nearly nonexistent in Scott County. And now Republicans are wanting to defund Planned Parenthood despite the fact that abortions make up only 3% of what PP does. SMH... @webpagelink","post_message":"In recent weeks, the American people have learned more about the barbaric practices Planned Parenthood uses to take innocent human life. Despite the outrage of millions of Americans, Planned Parenthood’s response has been to blame the messenger or the videographer, without addressing the barbaric practice of harvesting aborted body parts.  We need to let Planned Parenthood know that the American people do not support these inhumane practices. Congress should vote to end federal funding for Planned Parenthood before we leave for August recess. I urge Senate leadership to give every Senator the opportunity to affirm that life is a sacred and precious gift that must be protected."},{"comment_id":"10153675997090779","commenter_b":"Dumb ass","commenter_a":"Good for him.","post_message":"Joe Walsh has revealed that, come November, he won't be casting his vote for Hillary Clinton or Donald J. Trump. Watch him explain why below."},{"comment_id":"1018828211502577","commenter_b":"Thank you, that's what I'd like to know! B**** needs to SIT DOWN lol","commenter_a":"Wtf for?!?","post_message":"She's up against Malala Yousafzai and Pope Francis."},{"comment_id":"10152843284606519","commenter_b":"How about you pay for your own? Why do I and the rest of the taxpayers have to pay for you losers? Stop being a fucking whore or just swallow next. time. Cum guzzling gutter slut sounds about right.","commenter_a":"400 million dollars plus the tax payers have paid to keep Planned Parenthood in operation. I understand it is cheaper to kill the child then pay for it in the form of welfare, Medicaid, HUD and food stamps. 56 million have been dismembered in the womb thus far. My question is where did the idea of the taxpayers paying for people's mistakes come from? Why should I be obligated to pay for other's mistakes? I am not and neither are any taxpayers. You fucked, you knew the results of fucking without birth control....fuck you and your offspring.","post_message":"\"I believe that abortion care is a positive social good. I suspect that a lot of other people secretly believe the same thing. And I think it’s time we said so.\""},{"comment_id":"1269958509763867","commenter_b":"And they're all dumb white girls 😂","commenter_a":"Great President!","post_message":"This is why we are going to miss him."},{"comment_id":"10155816958010354","commenter_b":"GOD gave some ladies a bushel of beauty and a teaspoon of common sense.","commenter_a":"What a cruel thing to say","post_message":"Desperate..."},{"comment_id":"460484767469658","commenter_b":"China dont want none!!!","commenter_a":"So we take warnings from communist?","post_message":"TRUMP WIN RATTLES CHINA"}]
