[{"comment_id":"1697928997118346","commenter_b":"I DON'T WISH TO RUIN MY DAY WITH THIS MISERABLE COWARD MAGGOT--CORWARD RACIST EVIL VOLDEMORT.","commenter_a":"Vote blue across the board. Vote Democratic party in the next election. Go Hillary. DUMP TRUMP THE IDIOT","post_message":"Well, it's official: Donald Trump will be the GOP presidential nominee. Simple question: Are you voting for him?  LIKE Opposing Views for all of the latest 2016 election breaking news and debates."},{"comment_id":"10153065626180950","commenter_b":"He's a dayum disgrace. Im sure Subway can't believe this saga.Jared is a sicko that needed mental help yrs ago. He failed to get it & now he pays for his sordid fetish. The inmates will love that ass.. Footlong comin for your ass Jared. Ijs !!!! Karma is a bish :(+","commenter_a":"Hope you bring Vaseline for your new job interview jared.","post_message":"JUST IN: Court hearing for ex-Subway spokesman Jared Fogle ends; he \"expects to go to prison,\" his attorney says: @webpagelink"},{"comment_id":"10152877245671051","commenter_b":"The woman with the prosthetic leg should be able to get a first floor apartment as soon as one is available, and the other person should be evicted.","commenter_a":"Boy there are some sick people out there! I would evict her!","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"853572084739045","commenter_b":"Lol! Wow!","commenter_a":"I agrees with the Judge! Come here by the proper channels! WTH","post_message":"Here's a breakdown of what the immigration ruling means."},{"comment_id":"1171128359565299","commenter_b":"How's he going to pay for the bloody wall????","commenter_a":"Showing a total and complete ignorance of understanding of the root of the problem.","post_message":"A big wall is the Swiss Army Knife of Republican politics."},{"comment_id":"832641430106532","commenter_b":"My first thoughts also.. Selfish woman!","commenter_a":"Selfish woman","post_message":"\"...why my wife hid that letter is beyond me.\""},{"comment_id":"1960555887503751","commenter_b":"TRUMP! Go, go go ... Defeat that evil woman and make America great AGAIN!","commenter_a":"Killary is a beast and needs to be in prison........TRUMP is the only candidate that deserves to be president","post_message":"I will defeat Hillary Clinton - and MAKE AMERICA GREAT AGAIN!"}]
