[{"comment_id":"698823633563273","commenter_b":"Well then stop her. Isn't that your job?","commenter_a":"Yes a female Eric Holder,","post_message":"GOP leadership should stop the Loretta Lynch nomination by not reporting it to the floor for a vote. We must reject lawlessness, outright."},{"comment_id":"1092318047486497","commenter_b":"The chick in the limo is smokin...","commenter_a":"Yet he still left the guns...","post_message":"Now THIS is how you get out of a bad date. Mat Best MBest11x always taking it to the extreme. ~Will"},{"comment_id":"10152762458196973","commenter_b":"Exactly how would we \"ban transgenders?\" Deport them? Round them up into camps? Or are you for killing them? Smart people don't advocate for bigotry and racism.","commenter_a":"Or we could just ban transgenders altogether.","post_message":"Should Oregon ban \"conversion therapy\" for LGBT youth?"},{"comment_id":"10153649421859138","commenter_b":"Why would you post such a thing Dan??? Wtf?","commenter_a":"Meanwhile in Chicago this weekend, more people were gunned down by those whose lives matter. But let's not protest that.","post_message":"The Twin Cities Marathon went on today without major disruptions, and police did not make any arrests."},{"comment_id":"1189264781194585","commenter_b":"Bet you swat flies, stomp spiders and spray bug spray around. Insects are living creatures and so is mold.","commenter_a":"Sick !!! Well no excuse weither crocodiles kill humans or not humans are the sickest living creatures on earth they do things to get kicks and enjoyment","post_message":"Vile."},{"comment_id":"883279651765090","commenter_b":"No I read the whole thing, when article says believing Lincoln would restrict their rights to own slaves southerners decided secession was a better choice then to give up their economic system and their way of life. I translate that into, we will not get rid of our free labor (slaves) so secession was the choice, I can see where economics played into it, but to say slavery was not part of those same economics would be terribly ignorant. Lincoln maintained that secession was illegal thus unless south gave in war was inevitable.","commenter_a":"Here is an explanation of the civil war directly from the FEDERAL Government which proves without doubt that the War was NOT about slavery. Learn to research for yourselves people and stop being sheep. @webpagelink","post_message":"This is a VERY dangerous lie. Spread the TRUTH!  Read more here: @webpagelink Image by Occupy Democrats."},{"comment_id":"1719361974988639","commenter_b":"Fucking vegans","commenter_a":"Bit dramatic? Eggs are extremely good for you, provide income for a lot of people, and battery farming is on the decline","post_message":"We're just going to leave this here."}]
