[{"comment_id":"1776292422637356","commenter_b":"I think that Donald Trump needs to demand a conservative moderator for the next debate or refuse to debate. He needs to demand to get the questions ahead of time like Hillary(doesn't need them). Oh yes, and be able to wear an ear piece and get fed all the answers(not that he needs them). He also needs to learn the hand signals(doesn't need them either). Play that wicked game better that that witch!!!! Do not let her rig another debate, or pay off the moderator. Do not get on the defense or let her get off by not answering for her sins. Be hard on her in this next debate and bring out all her skeletons. The media will continue to make you out to be the bad guy but America is not stupid and this deplorable is behind you!!!!","commenter_a":"TRUMP","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"},{"comment_id":"10155549933771729","commenter_b":"They are terrorists. Maybe, its time to form our militias and eliminate these crazy evil nuts.","commenter_a":"Yes indeed. Love it!","post_message":"Oh, so sorry..."},{"comment_id":"1300941689949097","commenter_b":"She is to evil to regret anything !","commenter_a":"Angela merkel is romancing with muslims. She will regret later","post_message":"CAN THERE BE A DUMBER COUNTRY ON THIS PLANET?"},{"comment_id":"10153153941377507","commenter_b":"fuck her","commenter_a":"Who is this boob! Facts are facts!","post_message":"The last thing we need is a news outlet telling seniors that their Social Security isn't their money. We need to expand it - not cut it. Sign the petition if you agree: @webpagelink (via Snarky Pundit)"},{"comment_id":"10154600060589641","commenter_b":"Because you never listen properly. Listen closely and you will learn. Building a wall. ..you got it right. That's one policy. it has to do with immigration. That's very big. Walls keep people and things out or in. Keep illegals out. Citizens, can now get the jobs the illegals had and spend that money in their country , instead of it being spent in another country. That's one in a nutshell. That is an economic principal. And it's a big one. It has a trickle down effect. There are many more policies that he has articulated. Learn them a2live.","commenter_a":"I am not an American, but I have one question to the Trump Supporters who thinks that CNN is bias... What Plans does Trump has to make America Great Again? Because since I started following the primaries to the last debate the one thing that I have ever heard from this Man is Building the Wall at the borders. The rest of the things from economy to foreign policies he says we are going to figure that out. By the way he says it is not good to give your agenda to your competitors. Is that the bases under which Donald is going to make America great again? Leaders are voted for their ideas and policies, how much healthcare they can provide, how much education they can give, what can they do with the GDP, etc. but this man knows just nothing. Shame to the Trump supporters!!! I would disowned ...","post_message":"Hillary Clinton: \"What we want to do is replenish the Social Security trust fund...\" Donald J. Trump: \"Such a nasty woman.\""},{"comment_id":"408767239311570","commenter_b":"@username, you are an idiot, we DON'T live in a democracy, our founding fathers set up a constitutional republic to keep \"mob rule\" from ever ruling. What do you suppose will happen when 51% of voters all vote for free stuff??? What needs to happen is we need stricter voting laws. No felons can vote, nbody that recieves public governmenet assitance can vote. Rules lile this would EXTEND the life of our country. People who think like you ARE what's wrong with AMerica","commenter_a":"None of them can be trusted but seem to get elected anyway!","post_message":""},{"comment_id":"10153482266875329","commenter_b":"We have no hope for me aka the oblivious bitch.","commenter_a":"Brianna Musselman @username Guarantee this would probably be me, lol","post_message":"cringing"}]
