[{"comment_id":"10154146270706218","commenter_b":"@username change the fucking tampon","commenter_a":"President Obama and First Lady Michelle are a class act and what a President should act like with intelligence, calmness and responsibility to the American people, not the train wreck we currently have.","post_message":"Do you miss Barack and Michelle Obama?"},{"comment_id":"10152940577256336","commenter_b":"Enough of our young men have died. Keep them home and stop certain trash from coming into the USA. Then we won't have to worry about them.","commenter_a":"I heard today that he doesn't have a college degree. Low hanging fruit for the press to grab onto. Better fix that before he enters the national arena.","post_message":"Wisconsin Gov. Scott Walker, a potential 2016 Republican presidential candidate, said Sunday he is open to sending U.S. troops to the Middle East to defeat ISIS."},{"comment_id":"10154953238254497","commenter_b":"Cthulhu. Keeping it super old school.","commenter_a":"@username Cthulhu or FSM?","post_message":" haste, before His Holiness is torn asunder by the dark horror."},{"comment_id":"10152752919406051","commenter_b":"She should have spent AT LEAST ONE YEAR IN CUBA.","commenter_a":"I know this might stir up the pot even more, but my sister got gastric by-pass surgery over 10 years ago & has severe health problems ever since, and will have them for the rest of her life. She also has to take a truckload of pills every day in order to make sure she gets enough nutrients so she won't have other health problems from not eating enough. Anyone doing any research on gastric by-pass will find that it's not the solution to weight loss, and in some cases, they're much worse off than before. This woman isn't so fat that she can't lose the weight on her own. The problem is she doesn't want to lose weight. If your \"want to\" isn't there, even gastric by-pass won't be very effective. I personally know 3 women who have had this surgery & they've all gained whatever weight the lost ...","post_message":"This woman says she’s too fat to work, so the government offered to pay for weight loss surgery. She had a different plan."},{"comment_id":"1107023316031416","commenter_b":"@username white people have committed more rapes and drug transactions than mexicans","commenter_a":"This is what leadership looks like - he's going right into the heart of the democrat plantation, not because of the votes, but because he cares, and he believes that everyone deserves to have the opportunity to prosper and live in safety.","post_message":"\"Christian faith is not the past, but the present and the future. Make it stronger.\" Moments ago in Detroit, Donald J. Trump spoke to the Great Faith Ministries International Church, calling the African American faith community \"one of God's greatest gifts to America and to its people.\""},{"comment_id":"10156209671355354","commenter_b":"Please stay there! Not welcome in Texas!","commenter_a":"I hope the next administration is one that will take this down!!","post_message":"And look what it's expected to be by 2018!"},{"comment_id":"10152987522331336","commenter_b":"Hahaha stupid white girls","commenter_a":"Wish we could deport him..","post_message":"Moments ago, President Barack Obama vowed to appeal a federal judge’s ruling to block executive action on immigration. @webpagelink Don't miss Texas Governor Greg Abbott's response tonight at 10p ET on 'Hannity.'"}]
