[{"comment_id":"10154938661994328","commenter_b":"She is so cold look at her eyes they are evil!!!! They are illegal they have already committed a crime breaking our law.","commenter_a":"These left-wing liberals keep saying illegals should not be asked about their immigration papers, or lack of, because then they won't bear witness against criminals. HeII, they don't anyway! The last thing illegals are interested in is going into a Court of Law! These people will suffer in silence before testifying against one of their own. It's time for a change. In Europe, everybody has a PassPort or legit I.D. And cops and soldiers can stop you at any time. You produce that I.D. or you go to jail. Simple. Time for a national I.D. in the States!","post_message":"Democrat leader sides with illegal aliens over mom whose son was murdered by one."},{"comment_id":"1092750970772962","commenter_b":"Omg when I hear you little sheep that follow that lying bitch it makes me gringe","commenter_a":"Unfortunately Tronald Dump has his followers their just as dumb as he is at this point Dump can say whatever he wants and he will still have his followers sad what this country has become but we can stop this Dictator in November do the right thing VOTE BLUE","post_message":"LOL"},{"comment_id":"1425446234154201","commenter_b":"That chick Greenville Reece is crazy","commenter_a":"Is an idiotic argument when people say that the world is flat take some Physics classes in college and you will actually do experiments to look at this phenomena. Don't educate yourself off YouTube actually read some Physics books, even physics 201 and 202 in college will answer this a question.","post_message":"Kyrie Irving got defensive when a reporter asked him about his recent comments on the idea of the Earth being flat."},{"comment_id":"10154551617736336","commenter_b":"Voting TRUMP, you dirty COMMIE BSTD... Only people like you get filthy rich off our flesh and blood! New WORLD ORDER NUT JOB","commenter_a":"This coming from a PURE MORON.","post_message":"Speaking in Austria, European Union chief Jean Claude Juncker said, “We have to fight against nationalism, we have the duty not to follow populists but to block the avenue of populists.\""},{"comment_id":"1782160282048254","commenter_b":"She needs to her big ass and I'll out of the country.oh I'm probably on the hit list now.","commenter_a":"guess time will tell....when he wins it will be interesting to see how some of these people deal with all they've said and done. i wonder if hillary is getting packed to leave the country on the 9th. i heard she's transferred big bucks out of the foundation to another country just in case!!!!! her plans for the white house will be plans for the big house when she looses!","post_message":"Karl Rove says there is no way Trump can win the election because of 'the campaign he's running'. Do you think he is right?"},{"comment_id":"1783677398519787","commenter_b":"@username TRUMP IS OUR NEXT PRESIDENT.GET OVER IT.","commenter_a":"I am really not a trump fan.. But if his election gets rid of half the asshats that say they will leave he's got my vote","post_message":"She's out."},{"comment_id":"10153792604111746","commenter_b":"Two fools!","commenter_a":"Not at all. I love them both and i hope they are the host on 10/19 which is my Birthday.","post_message":"People on both sides of the aisle thought the two were biased."}]
