[{"comment_id":"1003873189632434","commenter_b":"When you take into account what these 2 young men did taking beer from a grocery store well there's going to be consequences plus swinging a skate board well the Police have to do something...I wish I were standing holding a sign I Support the Police Department !!","commenter_a":"I hate to say this but the store video does not lie. Now hopefully they'll release the bodycam video too. Now would be a great time to prove just how successful those are.","post_message":"The Olympia police officer who shot two men last week has given his account of what happened to investigators, and the department isn't releasing information. More than 100 people packed city hall tonight demanding immediate changes in police accountability >> @webpagelink"},{"comment_id":"1193853800707672","commenter_b":"Cause she's a lesbian LMAO","commenter_a":"i blam obam lol","post_message":"She has the most pro-LGBT platform ever. Here's why."},{"comment_id":"10155072860698690","commenter_b":"Cedric-Herrou, wherever you're you're my \"Hero\" Blessed are those hands that giveths.","commenter_a":"Diego Dab","post_message":"Farmer Cedric Herrou is standing trial for helping people cross into France, but his actions have made him a local hero."},{"comment_id":"10156129057215389","commenter_b":"Uhh...nope!!!...I was born also...but not today!","commenter_a":"Yes, it might cost her a lot like not greeting to be president.","post_message":"Question of the Day: Do you believe Hillary Clinton is really sorry about her server scandal?"},{"comment_id":"10152700019752212","commenter_b":"While I understand what they are trying to do, forcing a certain body shape (or denying a certain body shape) under penalty of law is rather draconian. They might better serve the public through education.","commenter_a":"In this day of unrealistic, unattainable goals for what is beautiful, unless you go under the knife or starve yourself. I say Amen. Keep it real.","post_message":"HOT TOPICS: France has passed legislation banning models deemed excessively thin. The law also imposes steep fines and possible jail time for any agent and modeling agency who hire them. The law focuses on the model Body Mass Index (BMI) and bans anyone whose BMI is, according to the law, than levels proposed by health authorities and decreed by the ministers of health and labor. Opponents of the law think that the criteria for banning a model is too rigid; that BMI alone is not a good judge of who is and isn healthy. Others, though, say they happy the law is put in place. They think the law will stop glorifying an unhealthy body image. #9HotTopics What do you think? Robin Marsh and Lacie Lowry may share your comments today on News 9 at Four!"},{"comment_id":"10152573528821717","commenter_b":"Greg Abbott in Texas! POS!","commenter_a":"He really is quite the Gov, is there a secret contest between him and Walker to who can screw a state more?","post_message":"Click here to follow LGBTQ Nation on Twitter: lgbtqn.at/tw"},{"comment_id":"10155802536765354","commenter_b":"Hope she goes to jail!","commenter_a":"Sad","post_message":"\"I’m not about to be on no scene 10 minutes doing CPR.\""}]
