[{"comment_id":"914387928629071","commenter_b":"Send all illegals home now","commenter_a":"YES YES YES","post_message":"Americas Freedom Fighters"},{"comment_id":"1048277701893900","commenter_b":"@username We have the highest number of legal immigrants per year in the whole world!","commenter_a":"I know this is going to be unpopular, but I know many Hispanics who agree with me. There is a legal way to come to the country, and contrary to some of the attacks I have seen on other posts, it does affect our low income Black, Hispanic, and White communities. They are used to a more extreme poverty, so they are willing to work for less than minimum wage, and are off the books, so taxes, SS are not paid. This means an American citizen or legal immigrant is denied a job. When so many of our jobs are being sent to Mexico, China, India how can we not address the issue of those who came here illegally. My nephew's wife is from Mexico. 2 of my nephews have dual citizenship. US/Brazil. I am far from racist or anti-immigration, but our own citizens and legal immigrants are suffering. We ...","post_message":"This week the media reported something that I find not just wrong, but inhumane: President Obama is currently planning \"a month-long series of raids in May and June to deport hundreds of Central American mothers and children\" who came to our country fleeing that same violence. Sending women and children back into harm's way after they already fled horrendous violence in Central America is painful and inhumane, and must be stopped. Sign my petition asking President Obama to stop these raids and to make sure that families fleeing violence in Central America are protected from deportation."},{"comment_id":"1040232792739639","commenter_b":"Maybe the politicians should take a course in medical health","commenter_a":"She needs to have her nurses license taken away.","post_message":"“You cannot forcibly incarcerate someone if it’s not based on legal grounds” - Kaci Hickox on why she's suing Chris Christie"},{"comment_id":"10154414222354087","commenter_b":"Get used to it. Welcome to Trump's America.","commenter_a":"So? We've been hearing that North Korea has nukes, is building nukes for years... Whatever... Their society and economy is so fragile a major earthquake would send them back to the dark ages...","post_message":"A top North Korean official who recently defected to South Korea says the country is racing to develop nuclear weapons \"at all costs\" by the end of 2017."},{"comment_id":"720325791491332","commenter_b":"Josiee, you write like a whore. Are you?","commenter_a":"Screw the Muslims if they do not like our christian message go back to where you came from","post_message":"Trump is in deep trouble after sending out a beautiful message to his supporters. We stand with him. Can we get 40,000 ‘LIKES’ for Donald Trump?"},{"comment_id":"1117850661583687","commenter_b":"She is trash !!","commenter_a":"Or is it Michael Obama?","post_message":"Keep on Rockin In The Free World!"},{"comment_id":"1413133632042756","commenter_b":"I believe that the adult in this circumstances escalated the situation. Wrong to trample someone's lawn, wrong approach to correct the problem. Two wrongs do not make a right.","commenter_a":"That's not true Media saying wrong stuff The off duty officer was right When kids jump on him Then he fire to scare the kids He was waiting for on duty officers to arrived","post_message":"Horrifying new footage shows an off-duty cop shooting a gun at a group of teens in Anaheim, CA. It's going viral and sparking protests."}]
