[{"comment_id":"10154985023891192","commenter_b":"Because life on Earth is the only life we can observe and study, so it makes sense to look for other life within the scope of life as we know it. How could we even begin to look for other forms of life if we don't have a clue what to look for?","commenter_a":"I really don't understand the definition of 'alien life' and why scientists think the environment needs to be remotely similar to ours to support 'life'. HUMANS need the right temperature and water.... 'aliens' may not....??!","post_message":"BREAKING"},{"comment_id":"10153293386166051","commenter_b":"And he should step down.....","commenter_a":"I'm with him!","post_message":"Do you agree or disagree with this judge's position on marriage?"},{"comment_id":"1817577751825895","commenter_b":"Another good 'Christian' pedophile! Family values liar! Beat him ,castrate him and put his sorry ass in prison for Ever!","commenter_a":"Oh my God, I watched this show, everyone of them were so talented, they are all beautiful, the kids were adorable, always dancing and singing, even the very youngest, the Mom was warm and loving. I really believed they were a great family, this is so very sad.","post_message":"Another 'family values' hypocrite goes down in flames..."},{"comment_id":"10154710318354062","commenter_b":"GTFOH... U don't own this planet girl!! GOD knows no borders right Angie? Get off ur high horse! Stop looking down n help another up!!","commenter_a":"what part of ILLEGAL do people NOT get??? GO HOME!","post_message":"Dozens of protesters have gathered on the University of Houston campus in advance of tonight's debate. Live team coverage coming up at 6."},{"comment_id":"10154048285749087","commenter_b":"She's a flippin' wreck yust waiting to happen....","commenter_a":"Lol they are dragging on the L for her fans","post_message":"BREAKING NEWS: Another very bad poll for Clinton."},{"comment_id":"1616274731928330","commenter_b":"Did you see where in California they are registering Illagals to vote, guess who they will vote for?","commenter_a":"Obama distracts us while he slips his executive orders by us with out much attention. Democrats weren't for gay and lesbian or transgender rights until Hillary needed more votes. Last election Hillary ran in, she is on video saying marriage is between a man and woman. She flip flopped and so did the party for more votes.","post_message":"Hey, Leftists: you want to stand up for LGBT folks? How about joining conservatives in speaking forcefully and honestly about the MURDER of gays and lesbians by MUSLIM terrorists inflicting SHARIA LAW?  Oh...that's right, Obama doesn't allow you to talk about that. So instead you 'boldly' focus on men using women's changing rooms and bathrooms and ignore the DEATHS of hundreds of gays and lesbians, because identifying their killers would require you to utter the words 'Islamic terrorists.'  Gee, how 'noble' of you, how 'brave.'  #phonies #poseurs"},{"comment_id":"912315142139160","commenter_b":"I saw this on Fox & Friends this morning. I am so saddened by what this hero went through. Glad Perry was there to help him. My heart goes out to Marcus and all who suffer without the help they should get for free, for serving our country. Obimbo's leave no soldier behind is such a lie.","commenter_a":"Rick Perry for President or maybe Rand Paul!","post_message":"Do you know the story of Marcus Luttrell and Rick Perry?"}]
