[{"comment_id":"1813691558875997","commenter_b":"FU lying bitch","commenter_a":"She's fill of crap","post_message":"Hillary Clinton says people are \"concerned\" by Trump's \"divisive rhetoric\" and he needs to be stopped \"conclusively.\" Is she right?"},{"comment_id":"1098939776819315","commenter_b":"Does your Mommy know she raised a selfish, irresponsible, inhumane twat?","commenter_a":"A good majority of those 31 thousand people that are shot to death are killed in self defense and line of duty shootings by police. So that number should be adjusted down. Many of those killed tried to kill some one else. Back to Abortion. End it. End it now for the love of God. I lost a child to abortion. I don't know how my ex-fiance goes to sleep at night.","post_message":"There is no outrage in the media regarding how many lives are taken by abortion."},{"comment_id":"10153224178386336","commenter_b":"You cannot deport american citizens out of america, it makes no sense. lol","commenter_a":"Gather them up and ship them out of the country. Anyone who doesn't respect America should leave. No one is asking them to stay.","post_message":"A new social media \"challenge\" is encouraging people across the country to disrespect and stomp on the American flag."},{"comment_id":"10153881891966782","commenter_b":"I think you ladies are missing the point of the story","commenter_a":"Here let me help you pay attention Army=soldier Navy=sailor Marine corps=marines Air force=AIRMAN you're welcome get it straight","post_message":"A Kirtland Air Force Base soldier and his wife are getting a lot of attention for something they posted online. @webpagelink"},{"comment_id":"10152762818573635","commenter_b":"And little girls whose only purpose is to bear little boys?","commenter_a":"The world needs little b o y s to become husbands, fathers, governors, farmers, presidents, and the righteous church leaders who exalt Jesus Christ \"who o n l y\" was crucified for world sin, and to whom only we bow and worship.","post_message":"\"The choice to not have children is selfish. Life rejuvenates and acquires energy when it multiplies: It is enriched, not impoverished! Children learn to take charge of their family, they mature in the sharing of sacrifices, and they grow in appreciation of its gifts.\""},{"comment_id":"10153593940166336","commenter_b":"Every woman scares Jorge.","commenter_a":"He did NOT pay kids for sex. He raped children!! Get it right!!!","post_message":"Fogle offered to pay adult prostitutes a finder's fee if they could connect him with minors for sex acts, including some as young as 14 or 15 years old, authorities said."},{"comment_id":"10155391661993797","commenter_b":"What a shame send this animal to jail .","commenter_a":"Very sad","post_message":"A young mother is facing child abuse charges after police say she kicked her 4-year-old daughter in the stomach for not brushing her teeth. The girl is hospitalized in critical condition."}]
