[{"comment_id":"10154551778899411","commenter_b":"@username You are a troll ass bitch.. You are as disgusting as the photo of your ass in your profile.. punk...","commenter_a":"I wouldn't get \"teary\" about it. Lol. Trump is digging his hole deeper and deeper the more he opens his big know nothing mouth! This draft dodger accepted a purple heart from a Vet who \"earned\" it which is as low as you can go. Than after that he kicks a crying baby out of his event. Trump will do himself in without anyones help!","post_message":"Mr. Smith told news.com.au that Mr. Trump's \"fat pig\" comment illustrated a \"darkness in his soul.\""},{"comment_id":"1162022200542981","commenter_b":"Hillary Clinton's response would be \"What difference - at this point, what difference does it make?\" The crooked bitch would lie about it anyway!","commenter_a":"You don't know what he was doing!! Why did trump tell you ?","post_message":"Wow. A major discovery about the EgyptAir pilot was just made, and it could change everything. It's been revealed that he was doing something surprising before the plane went down, and it could explain a lot..."},{"comment_id":"10154735667991756","commenter_b":"Hamas is a disaster, as is Israel's abuse of Palestinians. There are hookworms on two sides, sucking the life-blood out of two peoples.","commenter_a":"Not my monkey, not my circus. Let's keep our dicks tucked away for now.","post_message":"Of 1.9 million Gazans, 1.4 million need humanitarian aid, and the United Nations directly helps 1.1 million. Robert Piper, the U.N.'s humanitarian coordinator for the Palestinian territories is worried Israel's charges against the two aid workers could exacerbate a large aid funding shortage."},{"comment_id":"10153238484143984","commenter_b":"Screw the bitch and her lying ass husband.","commenter_a":"Move out bitch","post_message":"People are furious, and I can understand why. Do you think Michelle is an out of touch First Lady?"},{"comment_id":"10155463176480294","commenter_b":"Jordan Beier","commenter_a":"I saw about at two points when the injury could have happened (the roll, and when he was thrown out of the ring) and the dropkick could have finished off the injury but the way he was handled after the injury didn't help matters. According to the earlier reports he died at the hospital but he didn't look alive to me.","post_message":"When the bout ended, medical personnel transferred Aguayo to the hospital, where local media reports he was pronounced dead:"},{"comment_id":"10153996390124071","commenter_b":"@username STOP ALL WELFARE PROGRAMS AND WE WILL NOT BE FINE! THERE WILL BE MORE MENTAL HEALTH ISSUES, MORE DRUG ISSUES, MORE CRIME, MORE HOMELESSNESS, MORE TRAUMA.. THAT IS NOT THE ANSWER BUT IF THERE WAS A LIVING WAGE PUT IN PLACE WE WOULD HAVE LESS PEOPLE ON WELFARE THAT IS A GIVEN. TOO EASY..","commenter_a":"Velocity of Money: I think it's quite simple if you look at something called velocity of money. What does that mean? That is the money that gets spent back into the economy. When you have the top 1% getting money, they spend 5-10% of what they earn. When you have the lower end of the economy getting money, they spend 100-110% of what they earn. Since we are a consumer economy this will be good for business in the long term. Not for the people getting the $15 per hour.","post_message":"An economist explains why Clinton’s plan to raise the minimum wage to $15 might be 'too much, too quickly.'"},{"comment_id":"10153843599995796","commenter_b":"@username - did white privilege cause 360,000 Union soldiers to die fighting to free the slaves?","commenter_a":"Black lives matter is a racist (by definition) organization funded by George Soros to spread a false narrative, agitate and wreak havoc. People who fall for it, like Ms. Hathaway, are never interested in \"having a conversation\".","post_message":"\"I believe the Black Lives Matter movement calls on us to acknowledge our white privilege and its unfairness, to listen to the lived experiences of our darker brothers and sisters and to help them to achieve a world in which people of all shades live in safety,\" Julia Hathaway writes in her OpEd."}]
