[{"comment_id":"10154274649819087","commenter_b":"Dear Democrats and Liberals, I'm noticing that a lot of you aren't graciously accepting the fact that your candidate lost. In fact you seem to be posting even more hateful things about those of us who voted for Trump. Some of you are apparently \"triggered\". Because you are posting how \"sick\" you feel about the results. How did this happen you ask. You created \"us\" when you attacked our freedom of speech. You created \"us\" when you attacked our right to bear arms. You created \"us\" when you attacked our Christian beliefs. You created \"us\" when you constantly referred to us as racists. You created \"us\" when you constantly called us xenophobic. You created \"us\" when you told us to get on board or get out of the way. You created \"us\" when you forced us to buy health care and then financially penalized us for not participating. You created ...","commenter_a":"People will never vote Democrat again, once they appoint an Islamic extremist at the helm:)","post_message":"\"People didn't vote for Trump so he could bring a white supremacist into the White House,\" Elizabeth Warren said."},{"comment_id":"888422501286356","commenter_b":"I feel bad for whoever votes for Hillary!!! You are asking for our country to be taken over and also death for America!!!! I guess Muslims get there wish of destroying America if Hillary is elected into the White House!!!! She is a traitor just like Obama is!!!!","commenter_a":"Hillary will probably just let me and my brothers die without any help. I trust trump fully.","post_message":"Who do you trust more to protect the American people: Hillary or Trump?"},{"comment_id":"998886506840133","commenter_b":"How about Obombas birthday?","commenter_a":"stupid dicision","post_message":"NYC Schools Close for Muslim Holiday for First Time  @webpagelink"},{"comment_id":"1129640290462357","commenter_b":"My absolute joy will be when (not IF) Madame President is officially elected and we can all look back and say, once upon a time, Trump took out 15 Republican men, but 1 Democratic woman is the one who took HIM out. Music to my ears!!! I can't wait!!! All the haters NEED to get used to hearing Madame President. PERIOD, END OF DISCUSSION.","commenter_a":"I don't know what I'm more excited for- that Hillary is practically a guaranteed win or that I get to watch Trump fail miserably in front of the entire country.","post_message":"The Republican end times are here."},{"comment_id":"556763161150305","commenter_b":"Steven...do you suck your dad off with that mouth?","commenter_a":"Oh, that's soooo terrible... You think the several thousand people he had killed didn't fear for lives? The ones who were shot, beheaded by chainsaws, scalped & skinned alive, and who had limbs broken and cut off? Extradite Chapo, throw him in ADX Florence for the rest of his life, and admit this bimbo to a psych ward.","post_message":"Emma Coronel: \"I'll follow him wherever because I am in love with him.\""},{"comment_id":"848560338575181","commenter_b":"BUILD THE WALL","commenter_a":"and this comes as a shock to no one.......ban them.","post_message":"Reports say #ISIS now has a passport machine to have its believers infiltrate our country. I told you so! We need to protect our homeland - and make it safe for all citizens. We need leadership! #Trump2016"},{"comment_id":"642968752533659","commenter_b":"Amazing that this man who is causing all this problem is in cahoots with the Clinton foundation. Also the Muslim brotherhood. Look it up. He's also a lawyer who helps to bring in people illegally. Real \"good\"guy...and why was he attacking Trump? Trump did not want the war nor was he president or a senator who voted for the war. Nor is he the president now who has let ISIS run amok.","commenter_a":"He doesn't need to apologize. Hillary Clinton needs to apologize. If we did not go to Iraq their son would still be Alive. Hillary is to blame for running arms to muslim brotherhood. Khan attack Trump on national television. Trump responded. And cnn is Hillary Clinton fan club. Lol","post_message":"\"Is it difficult for your father to apologize?\" a co-host asked Eric Trump"}]
