[{"comment_id":"10156378664500725","commenter_b":"I have an idea. JDLTI. Just don't let them in. When you become President close all immigration for up to five years. We can take care of the terrorists in the Middle East while weeding them out here in the U.S.","commenter_a":"E","post_message":"I keep saying it. When the President of the United States of America, Barack Obama -  will not issue the words RADICAL ISLAMIC TERRORISM - the problem will NOT BE SOLVED!"},{"comment_id":"10153652043082452","commenter_b":"Ok....we'll make the insect kingdom pay for it.","commenter_a":"We must build a wall to keep them out!","post_message":"Southern California's iconic palm-tree landscape could be threatened by a new invasive pest migrating north from Mexico.  The South American weevil kills palm trees by eating their leaves and spreading disease. It's already made its way to San Diego after devastating palm trees in Tijuana."},{"comment_id":"10155327246350354","commenter_b":"Why in the hell would we care if illegals' feelings are hurt by AMERICANS FLYING OUR AMERICAN FLAG. IF THIS HURTS YOU, GET THE HELL OUT OF MY COUNTRY. YOU ARE ILLEGAL !!! That means you don't belong here !!!!!","commenter_a":"If these Students get public support it needs to be rescinded.","post_message":"Just when you thought this story couldn't get any more infuriating..."},{"comment_id":"10153541363403908","commenter_b":"Ass holes and sexism lol I understand!","commenter_a":"Kendrick- a small reference for the man haters in your life? Idk","post_message":"earlier this year, women were using the hashtag #WomenAgainstFeminism in order to set the record straight about their views on feminism. Here's a powerful response  for the \"not a feminist\" movement. What are your thoughts on this?"},{"comment_id":"10156389241130725","commenter_b":"if the so called good muslims are offened with what Donald Trump is saying why are they not stepping up and reporting the ones that are trying to hurt us,that offens ME!","commenter_a":"On Trump, his blocking Muslim entry is due to terrorists in with refugees, Americans as terrorists coming back not the innocent and good ones, he wants to stop the entering to get the bad ones out first to protect Americans. I agree with @username","post_message":"Statement on Preventing Muslim Immigration:"},{"comment_id":"10154898999434705","commenter_b":"Michael MacLeod are you kidding? Who says they are not. They have the most amount of refugees.","commenter_a":"Snowflakes and Hollywood dummies....read the executive order....no mention of Muslims any where. Still trying to figure out how so many of you could support muslims...they have no respect for women, queers, children, Christians and idiots like you.","post_message":"Helberg and wife Jocelyn Towne sent a clear message to Donald J. Trump."},{"comment_id":"785168271673750","commenter_b":"These BUTTs ( Bad Uncivilized Terrorist Thugs ) are just showing what they are, BUTTs, they are just showing their colors, this is a sign of ignorance. If this people would listen to intelligent people they would know that pants up don't loot is the best way to go.","commenter_a":"If they want to look like idiots....it's their choice....there are other more pressing issues that is worrisome !!!!","post_message":"Louisiana Passes New Law That Will Fine Anyone Wearing Saggy Pants.  This is amazing. It should be a law in all 50 states.  Do you support this new law?"}]
