[{"comment_id":"1724969627717594","commenter_b":"@username they don't do anything considering the billions of dollars we give them in aid that we couldn't attain ourselves. I'm not saying give Palestine money either just why give Isreal money to kill Palestinian children and so Israelis can have abortions?!","commenter_a":"If you realized what Isreal has done to the Palestinians you might donate to Hamas as well.","post_message":"WATCH: Filmmaker Ami Horowitz discovers that some American college students are willing to donate money to the militant group Hamas, after being told it will help “destroy Israel.” @webpagelink"},{"comment_id":"10154290589526323","commenter_b":"On bbc this morning she actually said that she wants europe, keep the pound and still have no borders with the uk!!!! This woman is nuts.....","commenter_a":"If Scotland votes to leave the UK and joins the EU then welcome to the Euro, Schengen and for Brussels to take over your resources like Banking, Oil, Fisheries and Hydro Power! You will become swallowed up and ruled with an iron fist from Brussels with orders and wrapped around a straight jacket..and have a border with England! Fancy it?","post_message":"\"If the Scottish parliament is judging this on the basis of what’s right for Scotland then the option of saying we’re not going to vote for something that’s against Scotland’s interests, that’s got to be on the table. You’re not going to vote for something that is not in Scotland’s interests.\""},{"comment_id":"943876645729114","commenter_b":"Put her as a no fly list and jail","commenter_a":"🖕🏿","post_message":"When this Black Lives Matter entitled brat threw a fit on an American Airlines flight after not getting her way she started up the accusations of racism immediately.   'LIKE' if you think this race-baiting BLM supporter got what she deserved."},{"comment_id":"10153479859171337","commenter_b":"Shut up hoe","commenter_a":"Love him. And you know what HE DONT GIVE A SHIT!!!! He tells it like it is. Everybody put your big boy or girl pants on and DEAL WITH IT!","post_message":"WHOOPS: Donald J. Trump made some inflammatory comments about Mexican-Americans, and they're coming back to haunt him..."},{"comment_id":"1147635848590103","commenter_b":"that evil woman will cause alot more problems for america","commenter_a":"HAHA!!","post_message":"North Korea has backed presumptive U.S. Republican nominee Donald Trump, with a propaganda website praising him as \"a prescient presidential candidate\" who can liberate Americans living under daily fear of nuclear attack by the North."},{"comment_id":"1725539231054043","commenter_b":"Big wall!!","commenter_a":"I read the interview with Kirsten. It was great and it does reveal a side of Donald Trump that we don't see at rallies. Very nice!!! Trump 2016!!!","post_message":"A very interesting piece, by a very good writer, Kirsten Powers."},{"comment_id":"10154406801145329","commenter_b":"She is disgusting ...an insult to women all over the world!","commenter_a":"I can get my head around the fact that Quantum field theory applies the ridiculous laws of quantum physics not just to solid particles but also to the fields describing the fundamental forces of nature. I just can't seem to understand why anyone cares so much about her or her family.","post_message":"People may THINK Kim Kardashian West's showing off her ~post-baby body~ but the photo may actually be from a year ago."}]
