[{"comment_id":"920934694585179","commenter_b":"94 MILLION LEGAL AMERICANS JOBLESS LEGAL AMERICANS HOMELESS LEGAL AMERICANS HUNGRY LEGAL AMERICANS HURTING AND THIS DEMOCRAT SLAVE MASTER, WHO GETS A LIFE-TIME SALARY FROM LEGAL AMERICANS VOTED AGAINST THIS BILL WHICH WOULD GIVE JOBS TO LEGAL AMERICANS","commenter_a":"Wrong on many levels....","post_message":"Greater energy security and more #jobs are at stake. Approve #KeystoneXL!"},{"comment_id":"930444230329383","commenter_b":"And big SUCK IT to rupert & roger, FUCK the both of ya weasels!","commenter_a":"Awesome","post_message":"The folks over at Fox News had hoped to bully Dish Network into giving their toxic channel the cheap air time it demands, but going into a second week of being banished from the television lineup is only proving that Dish has more clout."},{"comment_id":"10152630103907894","commenter_b":"Ladies love you to death but clearly you are being unfair in this matter 70 to 80 percent of custody battles in this country land in your favor whether the father is fit or not whether he is financially stable or not so for you guys to be sitting here some type of quote unquote outraged about this is ridiculous. knock it off.","commenter_a":"Some women needs to be careful who they sleep with","post_message":"Ludacris Wins Primary Custody of His Daughter"},{"comment_id":"10155238822815579","commenter_b":"In 2016 he US allowed 38,901 Muslim refugees also 37521 Christian refugees.","commenter_a":"In a practical sense, Obama had a ban against middle eastern christians. He seemed pleased they were being made victims of genocide, instead.","post_message":"President Trump: \"World Is A Mess & Angry\" - AGREE or DISAGREE?"},{"comment_id":"10153247148866130","commenter_b":"I am educated and that's my opinion and I stand by it !!!!","commenter_a":"I don't believe in post pardum depression !!! I believe it's women loosing their precious freedom and freaking out about it !!! That's why there are a limited amount of cases!!!!!!","post_message":"New research could allow women to get help before they even give birth"},{"comment_id":"10154328122239641","commenter_b":"Right after you @username..... she will right after you.","commenter_a":"I hope Hillary drops dead before November.","post_message":"BREAKING NEWS: Donald J. Trump comes out of the Republican convention ahead of Hillary Clinton in the polls."},{"comment_id":"10152853251337217","commenter_b":"No one is trying to say being plus size is a standard but there are plus size women who love their body and would not like to be ostracized for loving themselves the way they are. But these underweight model can start a trend of anorexia because girls WILL starve themselves to be like that","commenter_a":"They don't do that with the obese women... ¬¬","post_message":"Ad featuring \"unhealthily underweight\" model is deemed \"irresponsible\""}]
