[{"comment_id":"10153603991313132","commenter_b":"The tiger has been locked behind a cage for who knows how many years and when finally released he stood his ground and protected himself and they kill him for it? Animals no matter how small or what purpose do not belong in cages! Let's put a human in its place and see if they don't come out biting.","commenter_a":"Those animals need to be free not in a cage. Poor tiger, it was instinct. I feel for the man and his family too but it's not the tiger's fault. No zoos, circuses for me.","post_message":"\"It seized him by the throat,\" an eyewitness said."},{"comment_id":"586245841541886","commenter_b":"Murders need to go to prison!!!","commenter_a":"Thank you Dr Carson","post_message":""},{"comment_id":"882454405123315","commenter_b":"Divide and conquer Michelle. This is proof that you and your husband have sent this country back to a time of racial unrest and inequality like never before. I pray our country will soon be able to start healing and undue the damage you two have caused. In 18 more months, we'll be free of this kind of leadership","commenter_a":"She just proved racism towards the whites with every word spoken","post_message":"Michelle Obama is an embarrassment to America. We're ashamed to have her in the White House! WATCH what she just said..."},{"comment_id":"398114563646472","commenter_b":"You talk crazy !","commenter_a":"Texas has the death penalty---use it!","post_message":"This is not a good image for those who are trying to support the rights of illegal aliens."},{"comment_id":"10153382960318717","commenter_b":"I used to not like Mr. Trump. Then started to like him...sort of. Now I dislike him again.","commenter_a":"He's a prick","post_message":"The New York Times is angry that Donald J. Trump mocked one of its reporters who has a physical disability: @webpagelink"},{"comment_id":"1191302950909160","commenter_b":"Time for the Trump wall","commenter_a":"we don't care that much where they come from, we only care to DEPORT them ASAP","post_message":"UNREAL! Look how many illegals from other countries are now coming in through Mexico!! WHERE they are from is ALARMING! @webpagelink"},{"comment_id":"1056647814370639","commenter_b":"Let's be honest. HE is not confused. HE is still a MALE. And absolutely a disgrace.","commenter_a":"NO, are you kidding me?","post_message":"Do you agree with MAC's decision? Yes or no?"}]
