[{"comment_id":"10156071527715354","commenter_b":"'@username... we are talking about illegal aliens. Not the Mexican race. You should set yourself on fire -","commenter_a":"then you go ahead Ricky and pay for all the welfare benefits, health insur, food stamps, free college tuition (Dream Act) for ALLLLL the illegals pouring into the country. Cause we cannot keep paying for all this under the radical liberal orders--the pot has run out--this is why we SCREAM and beg for a man like Donald J. Trump to stop all this madness.","post_message":"BEHOLD, America!   One of liberalism's finest minds--a political Zeus!--hath spoken!   #Livin’LaVidaLoca"},{"comment_id":"10156554094585615","commenter_b":"what an ass","commenter_a":"He's so wrong. I can judge him too.","post_message":"He calls declaring same-sex couples 'apostates' just a 'policy disagreement.' Meanwhile, LGBTQ kids are dying by suicide."},{"comment_id":"10154698586269641","commenter_b":"Or avoid stealing from worker or outsider, as well as free up labor to provide a cleaner environment","commenter_a":"What they're doing is phasing out people so they don't have to pay $15/hr wages.","post_message":"McDonald's is getting fancy - the chain is rolling out self-order kiosks, mobile pay options, and even table service"},{"comment_id":"1517455414941150","commenter_b":"So what was the cause of death?!-","commenter_a":"I think they were drugged while at the hotel bar. It is becoming more and more common in foreign countries to drug and even use ether to sedate people so they can rob them. I find the guy suspicious that said when he saw in the AM that their door was as he had left it he became worried. How did he leave it...closed like every other hotel room door? It's not like housekeeping found them. This guy called mgmt and they went in. Sounds suspicious","post_message":"The autopsy for the two American sisters found dead in their luxury hotel room determined there were 'no visible signs of injuries found on the bodies.'"},{"comment_id":"10154691937306509","commenter_b":"She's a big crock!","commenter_a":"Great job @username....this debate is @username attacking Bernie Sanders....your agenda is so obvious....I'm not sure why I bother to watch this.","post_message":"'Talk about the kinds of problems he had answering questions about even his core issue: breaking up the banks...'  Hillary Clinton criticizes Bernie Sanders' answers to questions from The New York Daily News.   Live updates from the #DemDebate: @webpagelink"},{"comment_id":"10153578446431509","commenter_b":"Africa's a mess. Look what happens when the USA forces the colonials out early. If Britain has still been in control these things wouldn't be happening","commenter_a":"Let's not forget what's happening in South Africa too.","post_message":"ISIS operatives beheaded two groups of prisoners, believed to be Ethiopian Christians, in Libya, according to a video released by the terror network's media arm. @webpagelink"},{"comment_id":"10154323426879778","commenter_b":"Sad!! Rip LP","commenter_a":"Prayers to the family.","post_message":"The 80-year-old may have been found dead, police said Monday."}]
