[{"comment_id":"886419331393489","commenter_b":"Blacks have been raping, stealing and destroying everything they touch as long as they have existed and are still doing it today but t hey also never create anything. If you don't believe it just look at Africa that they are so proud to be from it hasn't evolved much from cave man days. So STFU Othello you racist douchebag.","commenter_a":"First of all not all black people shoot police, you have a bunch of crazy white people you can include, and also rednecks or countrymen use foul language and abuse women so are they considered thugs considering he said what a thug is ?","post_message":"TRUTH"},{"comment_id":"1728076730757228","commenter_b":"The pathetic woman never smiled....good riddance!","commenter_a":"I am truly sorry that Carly dropped out. I do think you would make a great Vice President. Your knowledge and experience will go s long way. Thank you for throwing your hat in the game.","post_message":"BREAKING: Carly Fiorina is ending her bid for the Republican presidential nomination."},{"comment_id":"1372232146121032","commenter_b":"Chris Schiraldi really? Please tell me your source besides your opinion because that sure as hell isn't fact!!!!","commenter_a":"Yeah thanks for the lowest workforce participation rate in decades. Thanks for creating so many low wage/ low benefit jobs. Thanks for so many on food stamps because the economy sucks. And thanks yahoo for being yahoo... and that isn't much","post_message":"75 straight months of job gains. 15.8 million private sector jobs added since 2010.   Thanks, Barack Obama."},{"comment_id":"10152718156506051","commenter_b":"yea-their called street whores--oh-and get arrested sometimes","commenter_a":"Why don't people mind their own business?","post_message":"A man heard strange noises coming from a nearby car dealership. When he walked over to see what was going on, he couldn’t believe his eyes."},{"comment_id":"634421746711040","commenter_b":"Yur all ignorant fucks","commenter_a":"Of course he's guilty, adults never have the right to release their anger on minors, no matter the situation!! Smh!!","post_message":"Horrifying footage shows a Texas police officer body-slamming a middle school student. #MicBrights"},{"comment_id":"536178543246730","commenter_b":"Meg Whitman is a disgrace and a lousy CEO.Bitch needs to shut the hell up.","commenter_a":"She's a fool","post_message":"SICK & SHAMEFUL"},{"comment_id":"10153054434811051","commenter_b":"So sorry he killed himself. The creeps that haunted him should all be rounded up and put in jail.","commenter_a":"Well I hope those bullies are proud of themselves. ...they know who they are and they all have blood on their hands. KIDS.... BE CAREFUL WHO YOU BULLY....THAT PERSON MAY BE YOUR BOSS SOMEDAY! In school everything that happens seems like its life altering end of the world BS. Guess what....it's just high school....life goes on....nothing is worse than suicide. ...sometimes the worst thing that happens turns out to be the best thing.","post_message":"This boy loved hunting and trapping, and other students made fun of him all the time for it. He just couldn't fit in with them. Eventually it became too much."}]
