[{"comment_id":"1342391692491333","commenter_b":"Put her in jail","commenter_a":"Buses...bussed them in and still cannot fill a gym","post_message":"Hillary Clinton spoke at a campaign rally in Sanford, with one week left until the election."},{"comment_id":"344636695739845","commenter_b":"all of these OLD STUPID WOMEN & MEN sould be fired for not doing their job","commenter_a":"I saw her on TV....She's an Idiot !","post_message":"Democrat Leader Calls Israeli Leader and says He Doesn for Her"},{"comment_id":"10152985971730090","commenter_b":"Hillary wouldn't have stayed with bill if he was not president. She lies about every thing . Her lies got 4 good Americans. Killed in Benghazi now she is running for president again. She don't deserve it.","commenter_a":"She didn't do a good job when Bill was in office, what makes you think she could now?","post_message":"Why don't you want Hillary Clinton to be President? @webpagelink"},{"comment_id":"645397708975441","commenter_b":"Wow, does he have any world facts available to him?","commenter_a":"My 15 year old answered the question","post_message":"This is just laughable."},{"comment_id":"658627524300508","commenter_b":"Just the way I want them! You have your work cut out for you with Remi your Boston Terrier.","commenter_a":"@username both your dog's made the list","post_message":"What's the laziest dog breed?"},{"comment_id":"10152823422866636","commenter_b":"There are desperate people with no job because of (mental) illness. There are enough jobs, but a lot of people don't want them. So immigrants take them and the 'jobseekers\" can blame them.","commenter_a":"We don't ask them to come here and risk life and limb doing so. Why exactly should we have them or even want them.","post_message":"Britain does not stack up well in comparison with other EU member states..."},{"comment_id":"10153382839234312","commenter_b":"No not sisters I read THEIR blog. Girls visiting - NOT SISTERS.","commenter_a":"No charges were filed. He was a minor. The girls were not his sisters! MOVE ON!","post_message":"Josh Duggar apologized Thursday and abruptly resigned his job at the Family Research Council in Washington, one of the leading conservative groups fighting abortion and gay marriage among other causes."}]
