[{"comment_id":"10153406065866800","commenter_b":"Already happened. That's the point.","commenter_a":"Wow, ok. So it's ok for a black person. To be racist, but if a white comedian made any of these jokes in reverse he'd be chased off the stage by pitchforks. Really guys? It goes both ways.","post_message":"\"For some reason black people need a white person to get their message out. I'm going to make this work for me, I'm going to hire a helper whitey.\" -- Jessica Williams"},{"comment_id":"724979780984130","commenter_b":"Let's not forget that the woman also has to spread her legs.","commenter_a":"I have been saying this for years. The whole thing starts when a man can't keep it in his pants. He has no business telling women what they should or shouldn't do.","post_message":"Let me share a piece of myself. Yours truly was abandoned as a newborn by a man who now he is 100% against abortion. I guess me being taken to Arkansas and being raised by an abusive stepfather (and the first few years in a shack with an outhouse and a well for water) was OK. I appreciate that I had a chance at life. But you men who think you can make decisions for women? STFU. Now. ~tiff via Occupy Democrats"},{"comment_id":"10152821450821519","commenter_b":"I don't read/post/view links. So if you're responding to me on fb, a simple original thought will suffice. Thanks!","commenter_a":"Yes! Agreed. We should punish and penalize those who are responsible for providing employment opportunities for tens of thousands. Everyone in America should work for government. #sarcasm","post_message":"\"It’s hard to see how anyone can possibly believe that the Republican Party, which fetishizes low taxes for the rich above all other priorities, truly cares about wealth inequality...\""},{"comment_id":"10155208349228690","commenter_b":"JEWS also believes in exactly the same GOD we worship,,,the one and only,,,,,They call him Hashem,,,,and have other name in Hebrew,,,,ISLAM allows MUSLIMS to EAT koshered MEAT ,,or animals slaughtered by Jewish rituals,,because they also recite name of our / their GOD,,,,,so this MEANS ,,Islam has accomadated both MUSLIMS JEWS christians to LIVE side by SIDE,,,understood,,but ones who LIE may NEVEr admit this,,,","commenter_a":"They steal their land, they're destroying their houses, they're spoiling their olivers, they're arresting children and abuse them, they're using chemical weapons against them, they're isolating them, making them starving, they're bombing hospitals, ... And they're blaming palestinians for throwing them stones and hating them ! Should they give you flowers?! Go ahead Palestinians! May Allah bless youuu","post_message":"Eshaq Abu Jibneh suffered the injuries in a brutal attack in a West Jerusalem public square last summer, belatedly recognised by Israeli authorities as a hate crime."},{"comment_id":"652489448217570","commenter_b":"Bella, ur out of your mind.","commenter_a":"I've never seen a bigger deal made out of nothing than Deflategate","post_message":"Uh-oh...This could be BAD NEWS for Tom Brady!"},{"comment_id":"1895551420676942","commenter_b":"Its not a muslim ban you morons.....learn facts. The top 5 countries in regaurds to muslim population are still traveling with zero restrictions. Its a 3 month travel ban from the 7 countries with strong terror ties....and 3 months until the fix the problem of Isis slipping through the cracks. And if he is so mean and horrible, what is Obama and the rest of the democrates? Because this \"Ban\" is the exact same one Obama used in 2011 only Obama did it for 6 months...not 3. Please open your eyes before you spew blind hate.","commenter_a":"You are and idiot. Wake your ass up shame Trump has to protect you.","post_message":"Share if YOU stand with Sally Yates, too. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"910291425675761","commenter_b":"Throw her out of the white house.","commenter_a":"let the book burnings begin..then kristellnacht...then relocation camps","post_message":"Are you at all surprised by this?"}]
