[{"comment_id":"1556887964609272","commenter_b":"People need to come in our country the right way. Obama wants to flood our country with illegals.","commenter_a":"Poor you Ted Cruz! You and Trump are almost the same thing!! But, there is a little difference! Do you know why Trump is leading the GOP? Because he is white, and you Cruz, you dont, not for the racist republicans! You has been descriminated for them too! You and Trump never will be president of this country!","post_message":"Ted Cruz on illegal immigration: “The federal government is doing a horrible job of securing the border. It’s utterly failing.”"},{"comment_id":"1269332673102189","commenter_b":"Becky, RAISE YOUR HEAD UP OUT YOUR BOYFRIENDS LAP, CHILD!","commenter_a":"Sorry but safety of USA citizens comes before everyone else!! This is All on Obumfuck!","post_message":"The youngest Nobel Prize winner says it perfectly."},{"comment_id":"10153439531452235","commenter_b":"Bitch is bucking for re-election.","commenter_a":"As Governor, I would think she had the power to do so on her orders.","post_message":"WHOA!"},{"comment_id":"10154078774989877","commenter_b":"Besides reproduction and parts which aren't anyone's business, nothing in these comments state what makes a woman a woman.","commenter_a":"We should all be okay with this. Two words: Fairness and equality.","post_message":"Spelman College to consider admitting transgender women Grio fam, is it time HBCU's updated their views on gender identity? Sound off below!"},{"comment_id":"10152945760561051","commenter_b":"Great job for the AF vet I'm a 8 year vet from the ARMY I would have done the same maybe just a little more aggressive.","commenter_a":"No way the protesters are students. They are agitators.","post_message":"When this Air Force vet saw protesters stepping all over the American flag, she walked over to pick it up. Things escalated quickly from there."},{"comment_id":"900572216669194","commenter_b":"This breed should be wipe off the earth surface","commenter_a":"But pitbulls are harmless.","post_message":"Moment dog savaged ice-bucket challenge woman"},{"comment_id":"10153932351055950","commenter_b":"FEMALE FAT FARMS WILL RULE TRUMP PRESIDENCY... .LOL.LOL.LOL. FAT CHICK'S BEWARE","commenter_a":"If Hillary cared so much about women she would not have brought this woman's name up. That just shows she will use anyone to get her agenda out there. She's Evil. Just remember she was the person who brought this up on debate night.","post_message":"This former Miss Universe says Donald J. Trump's comments about her brought up bad memories from 20 years ago when she gained a few pounds after winning his beauty pageant."}]
