[{"comment_id":"10153085331829205","commenter_b":"she would","commenter_a":"He needs to be charged with AT LEAST manslaughter... she w","post_message":"New Sandy Bland Dash Cam Footage Released"},{"comment_id":"10156981805725725","commenter_b":"Someone should exterminate these lowlifes","commenter_a":"You sorry protesters making violence! Mr. Trump paid for that rally in Cali you only making yourself look bad @username will even make America great for you guys. Stop making yourselves look like fools!! Thanks Bernie for the awesome soundbite!! I think that is personally the best campaign slogan to help @username. \"Hillary Clinton had bad judgement.\" @username 2016!! MAGA! Get out and vote Indiana and California!!! We are behind you 100% Mr. Trump in Mississippi!! My in laws in California are voting for @username!! Across the nation Trump 2016!! Your vote matters love America and vote Trump!","post_message":"Thank you Costa Mesa, California! 31,000 people tonight with thousands turned away. I will be back! #Trump2016"},{"comment_id":"10154165530049087","commenter_b":"Ironic. Very. Seeing as his white queen did the exact thing he's bitching about","commenter_a":"Who gives a SHIT? I certainly don't care about Podesta's emails...not from before, during or after....fuck Wikileaks. Here's a thought, Mr. Assange, perhaps if you surrendered to the British Authorities for violating the terms of your bail, returned to Sweden to face the rape charge against you and STOPPED being a puppet for Russian Intelligence, maybe I'd take you seriously? The fact remains you broke the law and you lose all moral high ground when you want others punished but not yourself.","post_message":"BREAKING NEWS"},{"comment_id":"10154511519316337","commenter_b":"So you're mad cause you're a poor bitch?","commenter_a":"They didn't add he is sitting on a seat worth about $10,000 every on of his jet/ helicopter has gold leaf in on it and don't won't to get it dirty","post_message":"Donald J. Trump tried to be an everyman... on his private jet."},{"comment_id":"1023827831012269","commenter_b":"Darlene Daniel not fair to Americans. Take way American jobs with low wage illegal invaders","commenter_a":"We \"ALL\" know that Donald Trump is \"NOT\" afraid of Megyn Kelly. Actually it is just the opposite. Fox News is AFRAID OF DONALD TRUMP.","post_message":"Michael Moore chided Donald J. Trump for being afraid of Megyn Kelly and backing out of the upcoming Republican debate Tuesday night on \"The Kelly File.\""},{"comment_id":"10154547365036756","commenter_b":"@username . Some were royal flushed and forced to eat their perpetrators feces .","commenter_a":"you guys just don't understand the pressure of defending your homeland against New Zealand AND Tasmania.","post_message":"The physical abuse, one victim said, was \"systemic, traditional and commonplace.\""},{"comment_id":"530424503814796","commenter_b":"I'd be out of a job!","commenter_a":"what is illegal is letting ASS HOLE groups like the GAY patriot put their STUIPD SHIT on facebook they should be put in jail for life","post_message":"A popular company is forcing their employees to wear head scarfs.  This has to be illegal.  Would you quit if they tried to force you to wear a headscarf?"}]
