[{"comment_id":"10153395061888690","commenter_b":"Saudi is bad for woman, Iran is worst. Pakistan is the best Muslim country for Muslim woman.","commenter_a":"Iranian cancerous mullah regime needs to be removed surgically.they are biggest violators of human rights.","post_message":"Prominent Iranian activist 'forcibly arrested' by security forces in Tehran @webpagelink"},{"comment_id":"10153712907532483","commenter_b":"'@username, you need be aware that the Christian Bible never tells us to go out and kill others or to be vengeful. Any Muslim who believes the Quran as I believe the Bible would truly be a danger to most Americans.","commenter_a":"I want to speak out and let people know that there are a plethora of southern baptist churches that are very diverse. My pastor adopted his kids from Africa and they are black while he is white. It's a fantastic GODLY southern baptist church. Don't condemn all churches or all baptist churches or all southern baptist churches for what these people have done. This is very sad.","post_message":"'There was pushback about... the types of children we were bringing in, and I was asked to not invite black children to [Vacation Bible School].'"},{"comment_id":"737426566424213","commenter_b":"Good Lord, this woman doesn't have a clue.","commenter_a":"Michelle Marjan","post_message":"Betsy DeVos, Trump nominee for Secretary of Education, is remarkably unqualified for the job.  Full video: @webpagelink"},{"comment_id":"891235850923043","commenter_b":"She is such a disgusting, hateful, ugly hag!","commenter_a":"Democrats are ALREADY on record favoring abortion AFTER birth.","post_message":"Unreal.  So the Supreme Court's imposed policy of abortion-on-demand for the full nine months of pregnancy isn't enough for Hillary?   Enough is enough.  Sign the petition to defend unborn babies from radicals like Hillary! Click here! @webpagelink"},{"comment_id":"10153541248725950","commenter_b":"Rape and borders. @webpagelink","commenter_a":"If it had been for Berniestan or Queen Hillary, then nobody would have noticed it and @username would not have written any articles on it.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"},{"comment_id":"980159212038244","commenter_b":"build a wall around this state.","commenter_a":"Hang the son of a B... Sheep F'r! Make an example of him!... we don't tolerate this crap in our Country!","post_message":"BREAKING: ISIS SUPPORTER Arrested In Michigan Before He Could Carry Out This Plan [Video]  “It is my dream to behead someone”"},{"comment_id":"10153722857026336","commenter_b":"How sad! God be with his family at this time.","commenter_a":"Who won the game ?","post_message":"17-year-old Evan Murray was a victim of internal bleeding caused by a ruptured spleen, an autopsy revealed Monday."}]
