[{"comment_id":"10154266348729203","commenter_b":"Go on sis!","commenter_a":"It seems that people are pushing their agenda however way they can... Big changes are coming soon... @webpagelink","post_message":"'Captain America: Civil War' screenwriters on the importance of Cap in light of Trump: 'It important to have someone remind people that that is not what this country is about, and you being kind of an ugly fool, and reductive.'"},{"comment_id":"936780129786105","commenter_b":"This lawlessness will stand until the National Guard is called out to do a sweep for illegals. If these sanctuaries are allowed to continue more lawlessness will occur in its most violent forms.","commenter_a":"Not proud of the mayor of Chicago for sure.","post_message":"Rahm Emanuel to Illegal Aliens after Trump Win: Chicago is Your Home – You are Always Welcome Here. @webpagelink"},{"comment_id":"1208055202644589","commenter_b":"F*** GLOBALISM","commenter_a":"This country is in bad shape","post_message":"And the brainwashing starts. Included in the curriculum will be globalism too. Yaaaayyy... @webpagelink"},{"comment_id":"10154638798186336","commenter_b":"Neil Cavuto ...per this morning's discussion: people killed on the highway not same as being murdered by immigrants...who over stay, are not vetted or are illegal!! How many of the 15 9/11 killers fit these descriptions...and we sacrificed the lives of many in order to accommodate immigration. Immigration is not in the Constitution...we need strong laws, enforcement and a wall!!","commenter_a":"dead people make it a war.","post_message":"On 'FOX & Friends Weekend,' Dr. Sebastian Gorka commented on Donald J. Trump's approach to radical Islamic terrorism."},{"comment_id":"10153247991679342","commenter_b":"Abortion is good. They should abort all babies born before the mother is 25","commenter_a":"here we go, 'all these people worried about worms in the water and nobody cares that planned parenthood is selling dead babies!'","post_message":"One woman said she first noticed the worms yesterday in her bathtub and after collecting a few, she heard neighbors found the same thing.   @webpagelink"},{"comment_id":"963844390305083","commenter_b":"Atlanta housewives just ratchet!","commenter_a":"We got housewives of Orange County, Beverly Hills, And New York. Those women act like straight up fools. I'm wit you Lisa Ray but Uhmm hey morals are out the door when it comes towards cashing in","post_message":"She says she's trying to bridge the gap between 'us sistas,' not take part in some of the controversial reality shows out there."},{"comment_id":"10153357248947061","commenter_b":"silly girl","commenter_a":"'@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."}]
