[{"comment_id":"10155341100780725","commenter_b":"So put that bitch down","commenter_a":"Obviously she has mental and emotional illness. Maybe people shouldn't be so quick to throw her to the firing squad.","post_message":"The woman accused of viciously cutting open a mother-to-be's womb to steal her fetus was apparently faking her own pregnancy, which gives a clue as to why she committed the horrendous crime, according to a police affidavit ----> @webpagelink"},{"comment_id":"1386644204686259","commenter_b":"It's all geared for her to win. She knows this. The corruptness is too great and the winner will be whomever bows to the big $. Sanders and Trump won't do it but she does and will continue to do so.","commenter_a":"And, that a$$hat in the photo has never accomplished a thing worth mentioning.","post_message":""},{"comment_id":"940190486114130","commenter_b":"What a fucking shitbag","commenter_a":"Bill Clinton was President and the Commander in Chief during part of my time in the National Guard. I had no respect for him as a man but had I ever encountered him I would have rendered proper military courtesy out of respect for the office of the President. When you put on the uniform you mo longer get to pick and choose.","post_message":"HA! She should've thought twice..."},{"comment_id":"10154102502686509","commenter_b":"haha at all you hatin mf'rs Trumps winning we gonna get that wall built and these isis mf'rs taken care of whether y'all like it or not","commenter_a":"Obama should contest this and say its forged..","post_message":"Donald J. Trump says it's complete with his mother's handwriting inside the cover and the address of his boyhood home. @webpagelink"},{"comment_id":"1748972275334787","commenter_b":"Even if the woman was standing to pee, they are inside a stall with the door shut, Us woman don't peek under the stall to watch other woman pee...only pervs do that","commenter_a":"The thing that makes me LAUGH is people have most likely ALREADY shared a bathroom with someone who is trans and didn't even know it!","post_message":"It doesn't make ANY sense…  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1560174614269652","commenter_b":"They are both disgusting women!!!! Never watched the show!!","commenter_a":"Rosie has to be one of the Most grating obnoxious people on the planet.","post_message":"I love ABC for doing what's RIGHT!   Rosie O'Donnell & Whoopi Goldberg have no place on TV."},{"comment_id":"806051249493483","commenter_b":"Republicans....","commenter_a":"What flipping IDIOT would vote for this nut","post_message":"He leads his closest competitor by 11 percentage points."}]
