[{"comment_id":"870850106350450","commenter_b":"She's desparate and we already know that she'll say anything to get a vote. I wouldn't be mad if she stroked out.","commenter_a":"Yeah ok","post_message":""},{"comment_id":"10153785867669228","commenter_b":"Yo mama a obese dummy she should of swolled yo daddy nut.","commenter_a":"Oh like white bithes don't steal stfu","post_message":"Three women pushed shopping carts full of toys from a Toys''R''Us"},{"comment_id":"1619461488113974","commenter_b":"Fuck Rosie!!! Stay fuck out of the U.S. no one misses u ... we promise!!!","commenter_a":"She was right about one thing. She truly is one sorry individual.","post_message":"Keep 10 year-old Barron out of politics!"},{"comment_id":"10153434994756636","commenter_b":"I do hope she gets all the care she needs. These countries are very poor and need all the help they can get. Imagine if you lived over there and your own children where sick. This is just heartbreaking no matter what.","commenter_a":"Her immune system must be shot to pieces - I do hope they can sort out the problem and eventually cure her. She deserved the best possible care.","post_message":"Pauline Cafferkey's in hospital for a third time"},{"comment_id":"10153576265156336","commenter_b":"Suck it up, buttercup.","commenter_a":"Wonder if this clown avoids baseball games","post_message":"Lambert’s Café is known as “Home of the Throwed Roll,” where servers at the restaurant are known for tossing the rolls to customers."},{"comment_id":"1014917681925727","commenter_b":"Alex, it was a hot springs then we saw in the photograph.","commenter_a":"Christopher Sorrentino","post_message":"Hot springs have injured or killed more people in Yellowstone National Park than any other natural feature."},{"comment_id":"1160001747368578","commenter_b":"@username What Does Hillary Clinton Really Want? WARNING: up America As you may know, Hillary Clinton mentor was Saul Alinsky. She wrote her thesis based on his writings. Saul Alinsky died 44 years ago and was the author of a piece called for Radicals. He wrote about how to create a State. President Obama prescribe to this philosophy as well as Elizabeth Warren and Bernie Sanders. Don fool yourselves, this is their mission and their purpose! There are eight levels of that must be obtained before you are able to create a social state: 1. Healthcare Control Healthcare and you control the people 2. Poverty Increase the poverty level as high as possible; poor people are easier to control and will not fight back if you are providing them everything to live. 3. Debt Increase the Debt to an unsustainable level. That way you are able to increase taxes which ...","commenter_a":"This information has all been checked, then double checked... It is 100% Correct. Maybe Trump knows something we should That's why there is such an alarm within US government, since Trump's statement about temporary suspension of migration of Muslims to US till US authorities make sure there is a proper concept of safe penetration of US territory. People are stunned to learn that the head of the U.S. CIA is a Muslim! Do hope this wakes up some! Until it hits you like a ton of bricks read it again, until you understand! We now have a Muslim government! John Brennan, current head of the CIA converted to Islam while stationed in Saudi Arabia. Obama's top adviser, Valerie Jarrett, is a Muslim who was born in Iran where her parents still live. Hillary Clinton's top adviser, Huma Abedin is a Muslim, whose mother and brother are still involved in the ...","post_message":"Hillary Clinton belongs in prison!"}]
