[{"comment_id":"10154786679373984","commenter_b":"What a shame that this ladies after so many many years will fall for Hillary's BS and the press that are now panicking cause things are getting worse to them and the campaign. Keep wondering how much money is floating around to pay all this people that suddenly have brought this stories and this will continue until Election Day, desperation is the mother of FU. \"GO TRUMP \"","commenter_a":"There is no one that is for Trump that is going to believe this. If it was true theses (ladies) would have spoken up sooner, so you see you people are not talking to morans as you think.","post_message":"Michele Bachmann has gone on national radio and revealed what happened to her when Donald J. Trump hosted her for breakfast -- alone -- in his penthouse.  Every American needs to hear her story. It says a LOT about Trump..."},{"comment_id":"991109084315479","commenter_b":"And those politicians won't change anything until one of them gets shot","commenter_a":"By law, the police can't do much of anything until the shooter opens fire. If he verbally threatens someone, that can bring the police into it. But by that time, someone may already be dead. Don't blame the police, don't blame the dispatchers, blame US.....because we elect the politicians that pass these laws!","post_message":"Once again, the NRA has blood on its hands."},{"comment_id":"10153202617203690","commenter_b":"Stupid girls!!","commenter_a":"We must ask ourselves why and find the antidote. The only way.","post_message":"Security forces estimate some 600 British Muslims have travelled to Syria to join the conflict there, some of them with the Islamic State of Iraq and Levant group."},{"comment_id":"10153019122102060","commenter_b":"So full of it. There are other Drs who can xray women.","commenter_a":"Because god knows in a state as poor as Louisiana, keeping women from accessing basic reproductive care is a GREAT idea. That won't have any long term consequences. Heckuva job, Bobby.","post_message":"Gov. Bobby Jindal's office has announced Louisiana is terminating its Medicaid provider contract with Planned Parenthood."},{"comment_id":"10153476534618721","commenter_b":"You do not turn the Super Bowl into a platform for any agendas. The Super Bowl is about the teams on the field. That is all. If she wants to do that at her concerts, fine. But she was out of line doing it at the Super Bowl.","commenter_a":"Is Beyonce just another ghetto ho?","post_message":"\"Is Beyonce pregnant?\" and other dumb things people Googled during the singer's Super Bowl performance. (via Quartz)"},{"comment_id":"10153816577949160","commenter_b":"You believed that nonsense? Sue glad Donald never cheated at anything.","commenter_a":"When can we not have to listen to lying cheating Teds shrill voice cry over everything. Ted cheated on his wife then lied about it.","post_message":"Donald J. Trump just won Indiana. Here's what that means.  READ MORE: @webpagelink"},{"comment_id":"10153577909221756","commenter_b":"And finally, Jesse Jackson IV, since I think he likes Kendrick Lamar too?","commenter_a":"@username Mata Though I'm sure you have seen this...","post_message":"High school teacher Brian Mooney used rapper Kendrick Lamar's latest album to teach a unit on Toni Morrison's novel, \"The Bluest Eye.\" Lamar found out about it, and decided to stop in for a visit. Full story here: @webpagelink"}]
