[{"comment_id":"943090809073276","commenter_b":"Why do women need to vote anyway?","commenter_a":"I would say that's higher than 44%","post_message":"Yep..."},{"comment_id":"10154028893376051","commenter_b":"He is going to build a wall. Send back the goobacks and bomb Isis. Has my vote. If he triples the debt the libtards shouldnt mind. They have no concept of paying bills.","commenter_a":"Does that mean that Trump will put the country in more debt than it has been before him? Does it mean that Trump will instigate a covert plan to arm terrorist nations? Why exactly is that a good thing?","post_message":"Brexit leader Nigel Farage says Donald Trump reminds him of a modern-day Ronald Reagan. Will you be supporting Trump this November?"},{"comment_id":"1756356877909889","commenter_b":"Go Trump!!","commenter_a":"Trump winns","post_message":""},{"comment_id":"10153245617818908","commenter_b":"So, let me get this straight, a man with his foreskin is unhygienic, but a woman with her parts all tucked away inside is hygienic? How does that logic make any sense? It's called basic hygiene practices. FYI, as men age (much older) their penis could fold inside of him and it will need pulled out to keep clean. This could be the issue your Family member was talking about. It's no different than when you wash your own genitals.","commenter_a":"I have 3 boys and all are circumcised. As a person that has family in the medical field it's for cleanliness when they get older. My mother worked in a nursing home and she has horror stories from having to bath uncircumcised men. It's gross not to be. Infection and bacterial growth is more common if the foreskin is still intact","post_message":"Why do Americans go out of their way to remove this part of human anatomy, when the rest of the world does not?"},{"comment_id":"10154813376179312","commenter_b":"North Country isn't that bad. And the only thugs are in the future new Nazi government.","commenter_a":"Prayers for this couple and their family","post_message":"Oklahoma police are looking for this couple last heard from in St. Louis. They were on the way from McAlester, Oklahoma, to Toledo, Ohio, but called their son from the St. Louis area on Thursday."},{"comment_id":"10153356804576336","commenter_b":"The words that come to mind wouldnt be appropriate for FB or for a lady to say....smh.","commenter_a":"Obuttma is a hug a thug..what is wrong with his brain⁉⁉","post_message":"The number of detainees at the Guantanamo Bay detention center is now 116, compared to 242 when President Barack Obama took office."},{"comment_id":"895114997196955","commenter_b":"Your mother is a rat","commenter_a":"for press tv and iran the houthi rebels who tried to overthrow the govt are not terrorists. Instead the forces fighting houthi rats are terrorists. and iran claims to be a democracy. wtf","post_message":"Saudi warplanes airdrop weapons to militants in #Yemen  Read more: @webpagelink"}]
