[{"comment_id":"10156062936845354","commenter_b":"Thugs","commenter_a":"Im in SA and just yesterday in Point rd Durban, my freind Gregory who is 69 yrs old was attacked by young foreigners with sticks and badlly injured. I am an ex policeman and I am ashamed of this assosiation. Our police are useless, I WILL TELL THEM FACE TO FACE if I have to. Warning to anyone in authority: IF NOTHING IS DONE TO REPATRIATE CRIMINAL FOREIGNERS FROM OUR COUNTRY IMMEDIATLEY. I WIIL CALL ON ALL WHITES TO START FORMING VIGILANTE GANGS. THE BALLS IN YOUR COURT, GET RID OF THE FOREIGNERS AND THE CRIMINAL ELEMENT.","post_message":"The vicious blow to the senior citizen comes around the :11 second mark."},{"comment_id":"10153834062371337","commenter_b":"You win the Internet today!!!","commenter_a":"Well, maybe when they introduce an HIV vaccine, she can get vaccinated.... Oh, wait...nevermind.","post_message":"Jenny McCarthy is not taking the Charlie Sheen news well..."},{"comment_id":"600652730065515","commenter_b":"Christians are doing it now to homosexuals, in Uganda","commenter_a":"They are savages. Anyone who can cut off a person's head is cold blooded.","post_message":"Attention Liberals: The Koran is a Satanic Manifesto & Christianity is not as bad as Islam!"},{"comment_id":"10154399971344087","commenter_b":"@username u one sick bitch","commenter_a":"Obama was basically a community activist turned president. No real domestic and certainly no foreign experience at all. Except maybe he was born in another country. With that said, trump is much better prepared day 1 than obama ever was.","post_message":"\"It is a source of great concern that our country is now in the hands of someone who seems to lack an ability to weigh the consequences of domestic and foreign policy decisions where great risks abound.\""},{"comment_id":"1271439512904593","commenter_b":"Now this is the kind of moms we need in America. This the type of mom who deserves happiness","commenter_a":"wow","post_message":"MOM OF THE YEAR: She says she promised herself she'd do anything to give her kids a normal life."},{"comment_id":"10153064926711770","commenter_b":"Allen, then why is Dr. Carson polling so high?","commenter_a":"Ben Carson keeps making weak, limp statements with Luke warm meaning for any cause he addresses. Instead of political correctness, he has validated Carson correctness! Too weak and lame to be a strong leader for a strong country. I like Mr Carson, but well intentions don't hold water in this crucial period in our country.","post_message":"\"I don’t want to see tyranny occur here,\" Dr. Ben Carson told This Morning, adding that \"we can’t always assume that\" good people will be leading our country."},{"comment_id":"418399244951783","commenter_b":"People Conroling People , Money Conroling people , Paper controlling people , hu? Paper seems to be more in control here , get ready for a tree farm congress , congress: wants more trees , People: why, Congress: environmentally safe ecosystem, People: yeh, Congress: Money money money","commenter_a":"Seems legit.","post_message":"Lobbyists and politicians getting together, and yet it's the people who get screwed."}]
