[{"comment_id":"10154608248221350","commenter_b":"Wonder how many people asked when he was born...\"does he have hair\"?","commenter_a":"Baby cute","post_message":"WATCH: Look at this little guy mane! @webpagelink"},{"comment_id":"10154137971976323","commenter_b":"You cannot stop it, it's a done deal. The pacific couldn't stop the TPPA, North Americans couldn't stop NAFTA. These deals are done above our heads, I very much doubt you would be allowed to leave the EU even if you wanted to.","commenter_a":"Have you read the EU's conditions on public services they want within TTIP? It looks to me as though these would offer considerable protection to NHS services; are we sure that our Government would have similar protections? See @webpagelink I was very much against TTIP and concerned about EU position until a colleague brought this to my attention.","post_message":"\"If being in the EU has brought us TTIP, it has also brought us the means to stop it.\""},{"comment_id":"10153083814076051","commenter_b":"Americans! Utilitarians. They have no use for you unless they can use you.","commenter_a":"@username said it all.","post_message":"This dog has one little deformity. Still, his owner decided it was just too much to deal with and opted to get rid of him."},{"comment_id":"1561091183908226","commenter_b":"I'll contact everyone of these cunts. I'll fly our and found your bitch ass into the ground since they are so profoundly sure I am not the face of death they never danced with. Boom...","commenter_a":"Boo hoo, my pussy hurts because I didn't get my war queen!","post_message":""},{"comment_id":"10154338923531955","commenter_b":"We need to send in our military to arrest these traitors in positions of authority who are completely ignoring the rule of law and committing treason in the process! This cannot be allowed To continue. Time for the people to raise our voices!","commenter_a":"Jury Nullification","post_message":"DOJ PROBE SHERIFF JOE..."},{"comment_id":"10153751099450575","commenter_b":"get this ass out of office and then let them rape her!!!!!!!!!!!!!","commenter_a":"Yup!!!!! a little common sense, people....she's the leader of Germany...Oh , sorry, look at the leader of the U.S. He's not smart enough to pick up on this.....well I think he is smart enough , but he's on a fast track to destroy america, so, it can do that!!!","post_message":"Now she admits it after she already destroyed Germany. . . ."},{"comment_id":"10152923308511130","commenter_b":"Women lie about is ALL of the time, right?","commenter_a":"Imagine if women didn't falsely accuse men of rape because a man \"upset her\". (It happens ALL of the time.......) Maybe more men would reach out. Instead, modern feminists slam men daily then expect to be worshipped?","post_message":"Powerful."}]
