[{"comment_id":"543574859135802","commenter_b":"Those dang Muslims and their transgender bathrooms...","commenter_a":"No fucking way my child would ever be placed in a school where boys could come into a bathroom with her..fuck is wrong with people?i am SOOOO glad To live in Kentucky these days..in all honesty I've always hated it here but at least my state doesn't go for all this liberal,homo,Muslim bullshit..","post_message":"What can only be described as an absolute shitstorm."},{"comment_id":"10156690146685231","commenter_b":"You beating her implies you didn't educated her about her role in society or her worth. Beating her is so drastic & dramatic. Talking & educating her would be much more powerful.","commenter_a":"If that girl were mine I'd slap her into next week but then again no child of mine would refer to herself as meat or be that cheap","post_message":"A high school boy asked a girl to prom with a sign that said, 'I prefer dark meat. Prom?'.... There's some things wrong here."},{"comment_id":"10153675187678352","commenter_b":"Trust no Bitch","commenter_a":"On the next episode of Orange is the New Black....","post_message":"‘You might as well go ahead and execute me, because I’m not going to make it to 73′: Woman, 51, who beat her friend to death with a slow cooker in a row over politics is jailed for 23 years"},{"comment_id":"10153242802786336","commenter_b":"She needs to step down. Bad form lady!","commenter_a":"recue her self all the way back to college, and stay awake the second time around , , and learn the law. don't judge out of hate to please your president and holder ,and al.","post_message":"Defense attorneys representing six Baltimore police officers charged in the death of Freddie Gray filed a motion to have the case dismissed, or for the city’s top prosecutor to be replaced."},{"comment_id":"10152708719122217","commenter_b":"If she was prettier she wouldn't have been charged.","commenter_a":"Who is the complainant? If it was witnessed in person fine. However if the person offended viewed the image on google, surely they are to blame for publishing the image?!","post_message":"She was charged after flashing a Google Street View car"},{"comment_id":"1140721385968332","commenter_b":"I like her filthy mouth. Filthy mouths FTW!","commenter_a":"Hardly a roll model really. She's got a filthy mouth.","post_message":"\"We have to be a role model for these little girls, because who do they have? All they have, literally, is the Kardashians!\""},{"comment_id":"10152864782686336","commenter_b":"Musa, you're butt ugly!!","commenter_a":"Please disclose his identity so that these western pigs would stop blaming islam for all their atrocities.","post_message":"Breaking News: 1 of 3 suspects in Paris terror attack surrenders to police, French judicial official tells the Associated Press. @webpagelink"}]
