[{"comment_id":"866555523379870","commenter_b":"She is a disgrace can u imagine Laura Bush or Jackie Kennedy doing this ?","commenter_a":"We sure never seen Jackie Kennedy doing something like this. She had class","post_message":"No. Class.   Spread the word."},{"comment_id":"848274368622676","commenter_b":"I tryed to watch it but everything else came up.... I agree with her 100% they are to demanding going into a new country.... You Muslims have good strong boy's ( can;t call them men chicken shits) send them back to fight you own war and not us !!!!!","commenter_a":"Makes me wonder what the hell is the matter with Islamic women? Can anyone answer why any women, with the way they are treated under Sharia, would want to be part of that? Disturbing","post_message":"OMG. If you only watch one video tonight, watch this Brit go off... on a Religion Of Peacer who told her to 'Shut Up!' This is an EPIC, unscripted, blast that you will probably love. @webpagelink"},{"comment_id":"830478970320859","commenter_b":"Send them all back to where they came from.","commenter_a":"Well Rush what about the Amish kids that started it in Ohio?","post_message":"Rush is right: Obama’s amnesty is a serious national security issue!"},{"comment_id":"1641151569508654","commenter_b":"'@username: no fault but Puerto Ricos...pretty sure they had a chance to vote for independence, and y'all didn't take it. You can have all the cultural pride you want...but it's the Olympics man, it is only for countries to compete in. Why not have Coca Cola and Pepsi join in?","commenter_a":"The underdog defeating the #2 in the world for gold.. Monica eres grande!!! PUERTO RICO!!! and to the bunch of salty Americans go read a book and learn about the damage the USA has done to PR!!","post_message":"After some of her more dramatic points, fans were shouting 'Si se puede' and waving the flag of Puerto Rico."},{"comment_id":"1040060042672919","commenter_b":"This is BS, she just knocks the baby down with her & don't care. Stupid lil witch!!!!!!!","commenter_a":"OMG!!! ANIMALS!","post_message":"Life in Obama's America  Disturbing video of a white woman (holding her baby) being attacked by blacks, as blacks film and laugh at the attack."},{"comment_id":"1023827831012269","commenter_b":"Darlene Daniel not fair to Americans. Take way American jobs with low wage illegal invaders","commenter_a":"We 'ALL' know that Donald Trump is 'NOT' afraid of Megyn Kelly. Actually it is just the opposite. Fox News is AFRAID OF DONALD TRUMP.","post_message":"Michael Moore chided Donald J. Trump for being afraid of Megyn Kelly and backing out of the upcoming Republican debate Tuesday night on 'The Kelly File.'"},{"comment_id":"828484970520259","commenter_b":"What a stupid cow.","commenter_a":"A new low for commiecrats? Not so! The depths of their depravity know no bounds.","post_message":"A perfect example of the difference between Democrats and Republicans.  This is how they treat allies:"}]
