[{"comment_id":"10153393133746051","commenter_b":"the cunt should be dead","commenter_a":"Sickening. this teen should be in a juvenile detention center!!!!!!!!","post_message":"The police took one look at what happened to this little boy and immediately realized they needed to get involved."},{"comment_id":"671135826344343","commenter_b":"Kick her off the team","commenter_a":"👎move um out! Respect us or live in another country! If your parents don't make u respect our country move them out too!","post_message":"This high school volleyball player decided to honor Collin Kaepernick by protesting the National Anthem at one of her games. Guess how that worked out for her."},{"comment_id":"1072932319412282","commenter_b":"#BuildTheWall","commenter_a":"I hear the Train a comin, It's rollin' 'round the bend. And I ain't seen the sunshine Since a Trump win. I'm stuck in Obama's nightmare, And I just want to be free. But the TrumpTrain keeps a rollin' Down to Washington, DC. I bet there are voters, eating in dining cars, They're probably cheering and smoking big cigars. I know Obama had it coming, I voted for hm and can't be free. But the train keeps a movin' And that's what tortures me. Watching the TrumpTrain Rollin' down to Washington, DC.","post_message":"Join us in Indianapolis at 4 pm today for a major announcement!   RSVP here: @webpagelink"},{"comment_id":"946981455339195","commenter_b":"Lesbians...ya gotta love 'em, or give 'em to ISIS to be burned alive.","commenter_a":"Al Sharkton must go too!","post_message":"Well, that's one way to go out."},{"comment_id":"10153309249299740","commenter_b":"Send her the bill...stupid","commenter_a":"Well played Baltimore...... @webpagelink","post_message":"200 rioters arrested, 144 vehicle fires, 15 officers recovering from injuries, and one big mess to clean up."},{"comment_id":"10153003184965671","commenter_b":"Remove the millions of illegals. It may be a smaller piece....but it is still huge.","commenter_a":"Somewhat comical given the subject. If you're really worried about climate change and water, STOP GRANTING BUILDING PERMITS that CONTINUE to INCREASE California's population and water requirements.","post_message":"\"Longer fire seasons, extreme weather, and severe droughts aren’t on the horizon, they’re all here – and here to stay. This is the new normal. The climate is changing,\" Brown wrote in a letter addressed to Donald J. Trump.   Thoughts?"},{"comment_id":"1277810208923879","commenter_b":"I wouldn't trust him to drain anything","commenter_a":"Ryan is a swamp rat.","post_message":"Let the draining begin!"}]
