[{"comment_id":"516541241803803","commenter_b":"@username then you should stfu!!","commenter_a":"If he violated a voting law, he should go to jail! Oh, wait! He was a drug dealer, had people killed, is a rapist, lied under oath, sold military information to China,.... STILL WALKING FREE!","post_message":"Do you think Bill Clinton should go to jail for this?"},{"comment_id":"1747901745468646","commenter_b":"Do the same to that raghead bitch","commenter_a":"Is this true? If it is, she needs to be on death row!","post_message":"Muslim Nanny Who Beheaded 4 Year Old Girl Will Not Face Murder Trial Because... This is the world we are living in today people. What do you think her punishment should be?"},{"comment_id":"1776292422637356","commenter_b":"I think that Donald Trump needs to demand a conservative moderator for the next debate or refuse to debate. He needs to demand to get the questions ahead of time like Hillary(doesn't need them). Oh yes, and be able to wear an ear piece and get fed all the answers(not that he needs them). He also needs to learn the hand signals(doesn't need them either). Play that wicked game better that that witch!!!! Do not let her rig another debate, or pay off the moderator. Do not get on the defense or let her get off by not answering for her sins. Be hard on her in this next debate and bring out all her skeletons. The media will continue to make you out to be the bad guy but America is not stupid and this deplorable is behind you!!!!","commenter_a":"TRUMP","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"},{"comment_id":"1819104865025971","commenter_b":"You're an angel!!","commenter_a":"I literally did this the other day with a dog waking up after a dental. I wrapped her up, rocked her and kissed her and kept saying she would be ok, she was a good girl. It's hard to see them wake up scared and alone so as an assistant, we have to watch them while they're waking up, so why not keep them safe feeling and warm in your arms?","post_message":"Baby Meesha was coming out of surgery and was crying and scared. The vet wrapped her up in his arms and comforted her, singing to her and giving her kisses. A volunteer at the BARCS Animal Shelter walking by caught this tender moment. Turn up the volume for this one. STORY: FOX13news.com/news/@username-story"},{"comment_id":"10155111433599614","commenter_b":"@username in Oregon not her she stinks hahah","commenter_a":"Jessica @username Davenport what an idiot lol","post_message":"The woman said she tried to get her pet ball python -- \"Bart\" -- out using cooking oil, but that didn't work. She went to the hospital, where her ear was numbed and stretched even more, freeing Bart. \"He acted like nothing even happened and was totally chill,\" she said."},{"comment_id":"984815688241627","commenter_b":"She is the best lying POS that know!","commenter_a":"She is the best","post_message":"“If you want a president who will tell you everything that’s wrong with America and who’s to blame for it, you’ve got plenty of other choices.…But if you want a president who will listen to you, work her heart out to make your life better, and together to build a stronger, fairer, better country—then you’re lookin’ at her.\" — Hillary today at the New Hampshire Democratic Party State Convention"},{"comment_id":"739722056160975","commenter_b":"Really tom? We are just providing facts, pull your head out of the sand, wake up,,,, sheesh","commenter_a":"it is NOT clear the killer was targeting christians....lying about this for your political purposes is irresponsible at the least. In fact, of the few facts, which have been confirmed about this awful incedent....among the most prominent is that the killer, himself was a christian...Also, that he describes himself as a \"conservative republican\" and that he was obsessed with mass-shootings. Stop lying to advance your political agenda...it's actually a big part of the gun disease gripping this nation.","post_message":"Made me want to cry."}]
