[{"comment_id":"723350804480361","commenter_b":"Wow... look at the Drumpf whore pounding out her propaganda. Nice work little slut. You get the executive card from the orange tinted prolapse","commenter_a":"This is not true. I know who got the letters and you were not one of them. Poser","post_message":"We were forced to comply with a Cease and Desist sent by Melania Trump's paid doberman. This is the future of journalism under a Trump presidency."},{"comment_id":"10157481563535354","commenter_b":"Silly Rabbit illegals can't and most don't want to vote or do anything to bring attention to themselves....try again!","commenter_a":"Did anyone else notice that Bill Clinton basically told illegal aliens to vote for Hillary in his speech?","post_message":"Bill Clinton's Big Bomb of a #DNC Speech was SO bad, Even Progressive MSNBC Host Rachel Maddow is TRASHING it... WATCH:"},{"comment_id":"10153594866289641","commenter_b":"Ignore these followers of ayesha exploiter. their book says its good to drink camel piss and have sex with a goat.. dont mind these illegitimates children of arab savages","commenter_a":"WTF.....I know so many Hindus who drink cow's milk. ...n why shouldn't they eat beef. ...totally nonsense. .","post_message":"In Hinduism, cows are deemed sacred and their killing a sin."},{"comment_id":"890231291031876","commenter_b":"Why would you slap immigrants in the face by rewarding those that broke the law?","commenter_a":"There are a lot of academic papers (i.e. data by experts and not angry, ignorant people on Facebook) that shows that 1) undocumented residents have a MUCH smaller drain on tax dollars relative to what they contribute than what the media hypes up (generating fear is a lot faster/easier/profitable than actually knowing the facts), 2) that immigrants rank high on civic service, 3) that immigrants rank high on starting new businesses ventures, 4) that the U.S. Immigrantion system shows indicators of being purposefully designed to have an undocumented work force for which the govt. can reap benefits without paying the full bundle of rights, etc.","post_message":"We must sign comprehensive immigration reform into law to bring over 11 million undocumented workers out of the shadows. We cannot continue to run an economy where millions are made so vulnerable because of their undocumented status. @webpagelink"},{"comment_id":"10153126119146770","commenter_b":"You aint no Woman Be otch","commenter_a":"What a joke, your no hero you did this by choice!","post_message":"Protesters hurled insults at Caitlyn Jenner as he left a Chicago hotel yesterday."},{"comment_id":"554182668075021","commenter_b":"What lower wages, you mean lower taxes. If you don't want to birth a child, just keep those nasty little knees together","commenter_a":"They are poor, jobless and believe the American dream is dead because they are stupid enough to keep being tricked into voting democrat.","post_message":"Last year was the first time that millennials surpassed baby boomers and Gen-Xers to become the largest voting demographic in the US."},{"comment_id":"722009277961832","commenter_b":"Brunch?","commenter_a":"@username come visit","post_message":"Mark your calendars for Jan. 29. On that day only this year, more than 30 museums in Southern California will offer free general admission as part of the 12th annual Museums Free-For-All-Day."}]
