[{"comment_id":"1193969757300354","commenter_b":"I'm not a supporter of either, and race has nothing to do with it. So for you to bring it up makes you the racist. Watch TV, read the newspapers... There are increases numbers of illegals coming across our borders (Chinese were the latest reported in increased numbers over Mexican border), so it makes no difference where they are from, but where they are coming in through! California's politics is way out of whack with the rest of the country, and the demographics show which and where. That demographic could be put up across the country on every state and the trend would probably be the similar.","commenter_a":"more welfare& illegals more clinton... go figure!","post_message":"Sanders performed better than Clinton in California's northern, rural counties, which also tend to be whiter than the rest of the state."},{"comment_id":"10152474320835927","commenter_b":"The ones I know aren't allowed to voice an opinion.","commenter_a":"The rest can't say anything 'cause they're still in boot camp.","post_message":"Does President Obama deserve this low approval rating for military personnel? Leave a comment... Read More: @webpagelink"},{"comment_id":"488312324683981","commenter_b":"Hmm if firearms are a replacement for a small penis what are females replacing with firearms @username???","commenter_a":"Gun Worship in The United States of Guns is Killing US...","post_message":"SCARY!!"},{"comment_id":"525682007598270","commenter_b":"The man is awesome!","commenter_a":"Yes Ben Carson Says truthfully he is an OBAMANITE~~~ TRUST HIM....!!!","post_message":""},{"comment_id":"594928020669934","commenter_b":"@username she said with her own mouth she wanna build a wall.","commenter_a":"@username once again dominating the night showing that she is clearly more knowledgeable, articulate and experienced to be President and commander-in-chief. Ready or not, Madame President here she comes!!!","post_message":"One candidate delivers catchy lines—the other delivers results. Add your name to say you're with Hillary. #DemDebate"},{"comment_id":"10153683499520530","commenter_b":"Whore","commenter_a":"DA FAQ??!!! Dump this girl she has no self respect .....she's probably screwing him behind his back","post_message":"He decked the guy after he touched his girlfriend's rear end several times. Now she's upset and wants him to apologize."},{"comment_id":"1722122661395846","commenter_b":"White people'n 😂😂😂😂😂😂😂😂","commenter_a":"Just White people..White people'n","post_message":"What...is...this?"}]
