[{"comment_id":"10153475546708734","commenter_b":"So why is she crying rape now? It's not going to get her out of the ticket, is it?","commenter_a":"Sorry but she is not a victim! And the so-called officer is a POS!","post_message":"The female victim initially agreed to engage in a sex act in exchange for money. Then during that encounter, Tucker allegedly pointed a gun at her and forced her to engage in another sex act against her will."},{"comment_id":"10153285740536336","commenter_b":"Gays can't create life? Hmm. I guess lesbians can't get pregnant or gay men can't inseminate a surrogate either. Anyone can create a life. But can they nuture a life? Plenty of gay parents out there do, while a shitload of straight parents don't.","commenter_a":"Sickening, YES! Just more proof of the changing times and how people deviated from their upbringing b/c they want to do what they want; not what is right...no respect for self or others....DISEASE!!!","post_message":"BREAKING NEWS: Ireland votes to legalize gay marriage. The traditionally Catholic nation saw 62.1 percent of Irish voters vote “yes” on gay marriage referendum in what is seen as a landslide victory for gay-rights advocates."},{"comment_id":"10152594345774071","commenter_b":"What girl with an f cup wants to wear a bra with half inch width straps? VS bras aren't comfy anyways.","commenter_a":"The bigger the size the harder is must be to line up the targeted areas with the proper tie downs ...","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"10154648123623812","commenter_b":"'@username if Hillary would've have been held accountable 14 years ago, she'd be in prison.","commenter_a":"ABC news and the Washington Post- Lies. ABC headline is ridiculous. Newt Gingrich still backs Trump. The media is banking on people only reading the headline, and not the story.","post_message":"Newt Gingrich, one of Donald J. Trump's most ardent supporters and once rumored to be his vice-presidential pick, says Trump is 'proving he is more unacceptable' than Hillary Clinton."},{"comment_id":"745794202277824","commenter_b":"She a fat hoe nuttin moe","commenter_a":"Dumb song.","post_message":"Something DISTURBING Was Just Exposed About Beyonce's Halftime Song  This is sickening. She should be banned from performing at any sports events for this.  Do you Beyonce needs to learn some respect?"},{"comment_id":"10153404410236130","commenter_b":"'@username All things you listed other than pot are legal. Yet why is it that while people...especially GOPers LOVE to scream bloody murder and point their fingers at those threatening to take away their guns and insist they not be persecuted the same way women who have abortions, gay men and women and birth control is seen as the devils idea. Guns kill people, The LGBT community hurts no one...all we want are equal rights and legal marriage, abortion in most cases saves unwanted children from being abused or just dumped in the trash and the GOP Congress has been trying to withhold food, shelter and a chance at a normal life from those born to poor unwed women. Where are those men and women when they see poor unnourished children who most likely are not wanted some being abused some being killed and some just starving to death. Instead ...","commenter_a":"To all those saying we have no gun problem - please review our statistics on mass shootings. We have more than the next few countries combined. And to those saying gun restrictions would not help because criminals would still get guns anyway: if you limit something at its source, if there are less guns being sold, period, statistically all criminals would have a much tougher time getting a gun. People with a history of physical violence and mental illness SHOULD NOT have access to guns, and today most can simply walk into a store and buy one as easily as anyone else - anyone who argues with these facts is part of the problem.","post_message":"What is standing in the way of meaningful gun reform?"},{"comment_id":"10155066289616336","commenter_b":"'@username is a dumb pussy","commenter_a":"Can't wait to hear!! PA deplorable here","post_message":"President Donald J. Trump has announced Judge Neil Gorsuch as his nominee for Supreme Court of the United States."}]
