[{"comment_id":"1709641872647327","commenter_b":"I cannot believe what is happening in this country. From this moment forward, when my wife or daughters-in-law or granddaughters are in the women's room of any public facility, I will guard the door, and woe to the man who tries to enter while they are in there. There will be blood!","commenter_a":"We are full of IDIOTS in America !","post_message":"\"There isn any doubt that this law was designed to be DISCRIMINATORY ...\""},{"comment_id":"10153252381712016","commenter_b":"Don't speak for young women. You aren't one.","commenter_a":"Young women see through Hillary..she put up with a cheat for a husband as a ticket to the WH...thats not what young women want for a future...its from the 50s...she lied to protect him through numerous scandals and no longer does it convincingly...she mumbles stock phrases about equality with no real commitment to anyone but her ambition!","post_message":"\"Through a record-breaking voter turnout, we won because we harnessed the energy and the excitement that the Democratic Party will need to succeed in November.\" --Bernie Sanders"},{"comment_id":"10153454938709330","commenter_b":"R.I.P","commenter_a":"Just heartbreaking ... Your with your mom...Rest in Gods Grace and Peace.","post_message":"Sad news to report. Bobbi Kristina Brown, daughter of Whitney Houston and Bobby Brown, dies at 22.  More here ---> @webpagelink"},{"comment_id":"10155747108715389","commenter_b":"Not here by illegal means of any kind. LEGAL immigration only.","commenter_a":"Our nation is totally off track right now. We need new leadership, someone who is 100% American and can get us back on track again.","post_message":"\"[I]t is being done as an express plan by the left because they want voters more favorable to liberal policies.\"  Last night, Ann Coulter gave her unvarnished opinion on immigration in the U.S."},{"comment_id":"10153350173059255","commenter_b":"Isn't that one of their anchorwomen?","commenter_a":"Most \"Sex Obsessed\" persons constanty ruminate about avoiding and policing sex.","post_message":"Really, guys?"},{"comment_id":"1824785004425894","commenter_b":"Women who support Trump have severe Stockholm syndrome and suffer insecurity","commenter_a":"Three times divorced, womanizer dares to talk about morality.","post_message":"Let's talk about the debate...what just happened?"},{"comment_id":"10153019932341323","commenter_b":"No, but look what women can do with them, much healthier than smoking.","commenter_a":"How much for the tampons?","post_message":"Only in New Orleans..."}]
