[{"comment_id":"445100202281687","commenter_b":"Hey here is an idea to the asshole who runs this page, stop defending these fucking criminals. Weed is ILLEGAL. Don't fucking run asshole. The fucking cop should have curb stomped him","commenter_a":"this police guy is a liar ,you deserved your termination,your insane....","post_message":"This is just disturbing. What a lame excuse this cop who has been reported multiple times in the past used for his violent behavior. Now he is defending his actions.   Do you think his violence is justified?  *Warning* GRAPHIC Video: @webpagelink"},{"comment_id":"1733272846942683","commenter_b":"Girl bye! Ain't nobody listening to your BS. Ms Lori.","commenter_a":"Poof Obama creating race card and divide.... Michelle just made it clear she lives in the house built by slaves! REALLY?! A spokeswoman for the first lady says that Michelle Obama currently has a staff of 24. So, she has slaves using taxpayer money too, huh?! You have done nothing but create racial divide while in that house! Nothing deserving or anything to brag about....You could have gone down in history as a great black leadership in that house. Instead, you have did the biggest disservice to people of color by creating the deepest racial divide I have ever witnessed in my well over 50 years of life! You have weakened our country security and will go down in history as one of, if not the worst President in USA history!","post_message":"'Don’t let anyone ever tell you that this country isn’t great.' - Michelle Obama delivers an emotional testimony to the greatness of the United States of America. @webpagelink"},{"comment_id":"10153715209333984","commenter_b":"Build a wall and send them home.","commenter_a":"You know illegal Mexicans come in this country illegally the women wait till about a month before delivering their child snake in this country have their child hoping to get birth rights I think if you come in this country out of another country if you have a child here your child is from your country not mine god bless the United States and we're going to try to keep it that way","post_message":"These Texas counties are doing something that has earned them a warning from Mexico, but it doesn't look like they're letting that stop them!  Do you support what these counties are doing?"},{"comment_id":"10154083522298352","commenter_b":"Stupid Bitch shit like this makes me sick","commenter_a":"Hang Her High","post_message":"MOTHER ALLEGEDLY ARRESTED FOR POSTING HER BABY ON A LEASH EATING DOG FOOD AS HER 'NEW PET'  READ & COMMENT BELOW:"},{"comment_id":"1191489804269278","commenter_b":"angelina illegal aliens? they want nothing more than death? you are so ignorant!! i dont recall illegals shooting up schools bombing up marathons or commiting any acts of terrorism. People like you make me sick. People dont come to this country to just commit crimes they come the same reason you or your ancestors came. your opinions are ignorant af","commenter_a":"America is now the land of sore losers and cry babies!!!","post_message":"Workers remove the Trump signage from 3 Trump Place apartment buildings in New York City after successful petition calling for removal. @webpagelink"},{"comment_id":"10154753364685225","commenter_b":"'@username be quiet old hag","commenter_a":"This is what happens when you have real leadership in charge of the Country.","post_message":"is historic. The Dow Jones Industrial Average hits 20K for the first time. @webpagelink  #Dow20K"},{"comment_id":"841503402609382","commenter_b":"IDIOT!","commenter_a":"Fat White Asshat","post_message":"Shame on him.  'According to New Jersey Watchdog, Christie reportedly spent over $82,000 of taxpayer money on concessions at MetLife Stadium.'  Read more here: @webpagelink Image by Occupy Democrats"}]
