[{"comment_id":"1027708620606666","commenter_b":"They have no sense of humor! They can not take any kind of criticism or satire! The most boring people on this planet!","commenter_a":"Because he exposes the truth of Muslim infiltrators! Roaches hate the light.","post_message":"Why is designated terrorist group CAIR condemning this FOX News report about Muslims as “racist and Islamophobic?” What ‘race’ is Islam?"},{"comment_id":"687263024766984","commenter_b":"@username here's a fact for ya 100% of illegal immigrants are criminals","commenter_a":"\"What we are going to do is get the people that are criminal and have criminal records, gang members, drug dealers. … Probably 2 million, it could be even 3 million, we are getting them out of our country or we are going to incarcerate,” Trump said. “We’re getting them out of our country. They’re here illegally.” Don't see what the problem is with that.","post_message":"Immigrants rights groups say they're \"preparing for the worst.\""},{"comment_id":"10152944080940950","commenter_b":"You cant tell he has an accent?what a bitch!","commenter_a":"I know law enforcement still search for david sweat and richard matt 20 days after escape from Clinton Correctional Facility. I know correctional officer Gene Palmer has already arrested for possible help to david sweat and richard matt escape from prison. I say correctional officer, prison workers and prison staff never help to some inmates escape from prison. If correctional officer, prison workers and prison staff help to some inmates escape from prison and could be arrested add prosecutor attorney will announce charged against correctional officer, prison worker and prison staff.","post_message":"A guard charged in the New York prison escape \"knows that he made a mistake,\" his lawyer says: @webpagelink"},{"comment_id":"547874932072371","commenter_b":"This bitch needs to get ready for jail!!!","commenter_a":"I think someone is throwing. Dinner !!","post_message":"WASH POST PAGE ONE SUNDAY: Hillary begins laying plans for White House agenda..."},{"comment_id":"10154592396721336","commenter_b":"What a concept...build a wall! Did they get the idea from President Bill Clinton?","commenter_a":"All borders need to be secured.","post_message":"In what could be a \"told you so\" moment for Donald J. Trump, the U.K. announced plans to build a \"big new wall\" at a border port in France to prevent migrants in nearby camps from sneaking aboard vehicles heading to Britain."},{"comment_id":"10156315267360725","commenter_b":"Humble pie lol","commenter_a":"She was getting way to cocky... talking way 2 much... didn't hit gloves before the fight .... she was force fed a slice of humble pie last night","post_message":"Glad to see that Ronda Rousey lost her championship fight last night. Was soundly beaten - not a nice person!"},{"comment_id":"1024169244346094","commenter_b":"So basically, nobody proofread the most important speech this woman will probably ever make. Yah, right. Wish there were SOMEONE I wanted to elect.","commenter_a":"all the first ladies speeches hold such content,, it is a speech of genuine concern and well they all have the same ideals,, so look up some other first lady speech's,, it will be a great opportunity to learn s0mething new and see what content the other first lady speech's hold,,you might find out something very interesting,,","post_message":"A speechwriter for Melania Trump is taking the blame for lifting passages from a 2008 Michelle Obama speech, admitting she made a 'mistake' – while saying she offered her resignation, but it was rejected. Full statement: @webpagelink"}]
