[{"comment_id":"10152789526371130","commenter_b":"I think her father is a proud lesbian.","commenter_a":"well this little girl is just over the top.. do you think her father is proud? I think not..","post_message":"\"I've been pegged with the word insensitivity. It's just how I've been sensitized and the tone I chose.\""},{"comment_id":"1280473441987748","commenter_b":"Why is it that when someone makes a valid point. He or she is told to leave. His country was solely built on the backs of slaves. Leave a country you built. How bout leave a country you stole","commenter_a":"Don't like or agree then leave the country if shit offends you... like mama said I'm pretty sure the grass isn't greener on the other side but your more than welcome to check if ya don't like it here just don't let the door hit ya in the ass on the way out ....","post_message":"Massive respect to Colin Kaepernick for having the courage to speak out!!"},{"comment_id":"10153119305979641","commenter_b":"Of course she did. She's corrupt as Hell. Let's elect her president.","commenter_a":"Good for her.","post_message":"Hillary Clinton deleted all emails from her personal server used for official secretary of state business, a Republican lawmaker says. @webpagelink"},{"comment_id":"1016582615062710","commenter_b":"I bet her tits are as ugly as her face. Just sayin.","commenter_a":"You are absolutely the dumbest white woman I have ever seen.","post_message":"Another day, another crazy comment from the View crew."},{"comment_id":"10156467558905725","commenter_b":"I knew it too good to be true!","commenter_a":"Hard to believe this thing he say????","post_message":"If you’ve been on Facebook in the last few days, you might have noticed a number of friends posting a status thanking Zuckerberg for giving away a portion of his $45 billion to lucky Facebook users ----> @webpagelink"},{"comment_id":"10156788909185354","commenter_b":"She's a dick!","commenter_a":"A good start. Now take back the universities, colleges and America from these thugs!","post_message":"BOOM."},{"comment_id":"10154131291436756","commenter_b":"Dinosaurs eat man. Woman inherits the Earth.","commenter_a":"God creates Dinosaurs. God destroys Dinosaurs. God creates Man. Man destroys God. Man creates Dinosaurs.","post_message":"\"God made man, man rejected God, and God won't stop chasing man until he wins him back. And that's the simple story of God\" — the very story Franklin aims to tell with his music, without all the rules of religion."}]
