[{"comment_id":"1738783449718030","commenter_b":"Lmfaoooo she's just so fed up","commenter_a":"The teacher at 52 seconds hung her head low like 'these mfs here ' Ty1253184741396567","post_message":"Move over, #MannequinChallenge. The #TrumpsComingChallenge is sending students fleeing @webpagelink"},{"comment_id":"639736896151349","commenter_b":"That's great and all but how do these women make money now?","commenter_a":"yeah and there'll be some bleeding heart liberal who'll be out fighting for robots rights and defending human trafficking because 'pedophelia is a disease!' and we 'shouldn't judge'.","post_message":"Experts believe that cyborg prostitution will help ‘clean up the industry’ by reducing sexually transmitted diseases and ending sex slavery."},{"comment_id":"1806555102961372","commenter_b":"Why does she keep bringing up controversy. Be done with it Megan! And get over yourself!!!","commenter_a":"Obama has flooded our country with muslims over the last 8 years to buy votes and destroy our country. America First an no PC.","post_message":"'I welcome immigrants. I welcome people from all over the world to join us here. But I want to make sure that it's safe for Americans in my country that I fought for,' Carl Higbie told CAIR Florida leader Hassan Shibly."},{"comment_id":"1092094194179315","commenter_b":"Because I have read other shit she has posted and the BITCH talks crazy THAT'S WHY @username!!!!","commenter_a":"Wondering, where are the people saying, 'he should've complied with police orders?'","post_message":"Protesters in Fresno, California, waved the Confederate flag & signs that read “White Lives Matter” to express outrage over a local unarmed white man’s police-involved shooting death.   Several shouted “f**k the police” and threw water bottles and glass toward a line of policeman gathered near the crime scene. DETAILS ---> @webpagelink"},{"comment_id":"10156328983890389","commenter_b":"just a dried up old liberal lying witch .","commenter_a":"The appearance of former secretary of State Hillary Clinton before the House Select Committee on Benghazi raised very important questions on diplomatic security, the relationship between the secretary of State and her ambassadors and leadership. My experience during 38 years in the Foreign Service, including six assignments as an ambassador, has given me a perspective on these issues that differs from some of the arguments developed by the Committee. First, about security. Every secretary of State and every ambassador has security as a top priority. It is a dangerous world, and we are everywhere in it. An ambassador is responsible for the security of her personnel and her embassy. Internal defense plans, risk assessment, movement controls, adequate defensive systems these are all on the shoulders of the chief of mission. The department is responsible for getting her what she says she needs. There is no perfect security. Risk has to ...","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10155025843208734","commenter_b":"Oh I remember lol","commenter_a":"Thats Ari Moran! I know him! Great officer!!!","post_message":"We're live in studios with Fairfax County Police Department's new bloodhound, Juneau! 😍❤️🐶"},{"comment_id":"447163662137908","commenter_b":"Sinc you obviously are just a walk around, I'll ask you directly. HOW DOES LIMITING THE LAW ABIDING HELP ANYONE?","commenter_a":"You forget one little thing about this video. No matter what type of gun is used, gun laws only make the law abiding victims and give criminals an advantage.","post_message":"When the 2nd Amendment was written, the world did not have machine guns or assault rifles."}]
