[{"comment_id":"951619314934321","commenter_b":"She is a moron.","commenter_a":"Fox news, God love em, is like all old line Republicans, afraid of the truth that Palin tells. Sarah may never be president, but she sure should be. She represents working Americans better than any other.","post_message":"Don't worry, Palin fans. You'll still be able to see “the First Lady of the Outdoors” on the Sportsman Channel."},{"comment_id":"831083283688817","commenter_b":"Just a bunch of fat people eating fat food. No incumbents in 2016 november.","commenter_a":"America runs on Dunkin!!","post_message":"Elizabeth Warren repped Massachusetts by bringing Dunkin' Donuts to the House sit-in."},{"comment_id":"10154390572299749","commenter_b":"@username suckers.","commenter_a":"@username Nope....that is all...nope","post_message":"About 400 fen raft spiders have been set free in the UK."},{"comment_id":"10153317099366051","commenter_b":"Caleb I agree. @username you are a fucking Looney toon. Crazy bitch","commenter_a":"She didn't kill him & usually if someone is threatening suicide it's because they're not gonna do it anyway! I have attempted suicide & have suicidal tendencies that I battle everyday but when you get ready to do it you don't inform others you just do it! I think it's bs that she is being charged when he had every opportunity to walk away....he chose to die no matter what she said to him! If you're steady telling me you're gonna kill yourself then I'm gonna tell you to go ahead and stop feeding me your empty threats!","post_message":"Remember the teen who convinced her boyfriend to kill himself? Well, she just got some bad news."},{"comment_id":"10153361395611107","commenter_b":"Class on the left, and no class on the right. She is just another, inept, liberal, lying skank. I put her in the samne group with that traitor, Hanoi Jane.","commenter_a":"Better yet , hit her at her cankles. Paul/Trump ... Trump/Paul for America, not the establishment","post_message":"Guess who I ran into? Tune in to @CBS now to find out why I think she should forever be precluded from being potus"},{"comment_id":"10153794663986491","commenter_b":"More reasons for not having a women as President....","commenter_a":"\"Good guy with a gun\" turned murderer in 20 seconds.","post_message":"\"It was a family argument that turned into a shooting.\""},{"comment_id":"1109745385756047","commenter_b":"@username You are a waste of space aren't you darling...😉","commenter_a":"If you have ever been to Paris or London,You would know these are the two most disqusting cities in Europe. These two are stupid !!Glad to see all the comments, and no one has even been there, or has any Idea what shitholes these cities are ! LOL.","post_message":"Donald Trump is officially an international embarrassment. Video by Occupy Democrats, LIKE our page for more!"}]
