[{"comment_id":"10153365745456749","commenter_b":"playing to the media.. he has done more to MAKE it happen again than anyone in history","commenter_a":"ALLAHU AKBAR!!!! #MMBR #M23BR","post_message":"\"In memory of those we lost, we resolved to shape a world where events like those of September 11, 2001, could never happen again, and we see this unbreakable spirit live on every day across America.\" —President Obama"},{"comment_id":"1640586052910285","commenter_b":"Close them.Then make it tough to come to America.Its to DAMN easy now,,that's why were lousy with illegals.","commenter_a":"NO!","post_message":"Senator Tom Cotton just introduced Trump's immigration proposal through the Senate! Sign the petition SUPPORTING the bill HERE: @webpagelink"},{"comment_id":"236462700148781","commenter_b":"I heard he won by a lot and everyone is happy. Next please","commenter_a":"Dagmar! Free Press just means that they can't be censored or jailed! He doesn't have to speak to the press! No ....NO VIOLATION OF THE 1ST!!","post_message":"Join us as President Donald J. Trump delivers the Weekly Address."},{"comment_id":"866645046728578","commenter_b":"an amazing climb","commenter_a":"Liam Boggans","post_message":"Gnarly pictures reveal the toll taken on El Capitan conquerors' hands"},{"comment_id":"10152920542711107","commenter_b":"Yes! Stop her!","commenter_a":"Yes","post_message":"Can you and I get 10,000 more signatures on Facebook? Over 21,000 of you have sent your \"Stop Lynch\" Emergency Fax Petition through Facebook -- and your voice is being heard loud and clear. Momentum is building against her confirmation thanks to your outpouring of opposition. In fact, two previously undecided Republicans announced their intention to vote against her nomination. But you and I can't stop now. As you know, Loretta Lynch has proven herself to be an advocate for the lawless conduct of the Obama administration and not an advocate for the rule of law. That's why I'm counting on you to keep the pressure on and urge my colleagues to vote \"no\" on her confirmation. Sign your \"Stop Lynch\" petition right away!"},{"comment_id":"1031214057011772","commenter_b":"Keeps women from cheating lmao","commenter_a":"So, she wants to be registered, heavily taxed, and locked up at night?","post_message":"Pure gold..."},{"comment_id":"10153128633786323","commenter_b":"I think you're getting a bit sadistic Sanchita. \"Lowered into vats of acid\"? You should hear yourself. That's inhumane. They should be put in prison, like they already are. And women CAN rape, though sadly this country's rape legislation is inadequate when it comes to women-perpetrators. What about a woman-on-woman rape? Or when a woman in her 30s rapes a 13 year old boy?","commenter_a":"Stop demonising men","post_message":"“I began this film with a narrow focus: ‘Why do men rape?’ I discovered that the disease is a lack of respect for gender. It’s not just about a few rotten apples, it’s the barrel itself that is rotten.”"}]
