[{"comment_id":"1243719872306934","commenter_b":"I would kill radical's in a minute for these women!","commenter_a":"These guys need to be exterminated!","post_message":"Of all the atrocities committed by ISIS, this just might be the most horrific of all. Kidnapped girls and women caged like animals and then set on fire for refusing to have sex with their Islamic captors"},{"comment_id":"10154072971081756","commenter_b":"what is the average age of someone on Medicaid? If it's what I think, I think the horse the barn long ago with these folks quitting smoking.","commenter_a":"Wellbutrin, as pictured, is often used to help people quit smoking and is used as an anti depressant BUT (there's always a but.....) it can cause mental health issues itself such as hallucinations, manic symptoms, etc.","post_message":"Despite one-third of Medicaid participants being smokers, many states aren't doing enough to help people in their Medicaid programs quit."},{"comment_id":"1055977171151281","commenter_b":"What do you expect from this Muzzie piece of shit.","commenter_a":"...and what did Obummer fight...Oh I know...golf par...didn't happen !","post_message":"***PATRIOT ALERT*** \"It is the inescapable duty of the Congress of the United States today to censure President Barack Obama for casting doubt on the sacrifices and motivations of the Americans who fought the Second World War—on the eve of Memorial Day, no less.\""},{"comment_id":"10155604314476509","commenter_b":"I love it. Obama Obama Obama. Biden Biden Biden best Pres and Vice President ever","commenter_a":"At this point what difference does it make","post_message":"Biden: I'm not giving them the wifi password  Obama: Joe..."},{"comment_id":"10153118547732377","commenter_b":"Wake up folks, don't be divided , be united....Carson for president, at least he's a God fearing man...A child of the most high God","commenter_a":"And Your Point Is???","post_message":"Ben Carson's faith as a Seventh Day Adventist came under fire at a Donald Trump rally on Saturday."},{"comment_id":"1370743996276280","commenter_b":"She knows, because she spent a lot of money buying all those super delegates. Fact is neither will have enough pledged delegates to win outright, so bribed insiders will determine the outcome. That's really democratic isn't it. It really the Clintons and the DNC that are killing the party.","commenter_a":"Vote SANDERS","post_message":"Hillary Clinton said what everybody outside of Bernie Sanders and his supporters are thinking. The Democratic nomination process is in effect over, and there is no way that she won't be the nominee."},{"comment_id":"1079285898761124","commenter_b":"No woman with an ounce of self respect would vote for a misogynist like Trump.","commenter_a":"Good way to clean out those we don't need in America. Just one more reason for Trump to win","post_message":"A majority of people said they would go to Mexico."}]
