[{"comment_id":"10153186263669411","commenter_b":"And what happens when two monsters get together? another monster!!","commenter_a":"ha ha ha America is a father England is a mother isis is a child isreal is a nanny","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154524570660579","commenter_b":"IS THAT A BED SPREAD KILLARY IS WEARING. MY GOSH THAT WOMEN IS SOOOOOOOOOOOOOO UGLY","commenter_a":"I am with her","post_message":"Senator Elizabeth Warren campaigns with Hillary Clinton in Ohio.  Watch the complete video here: @webpagelink"},{"comment_id":"10153247740094411","commenter_b":"Suck it up mother fucker","commenter_a":"När Israel skrotat alla sina atomvapen, har dom först då, rätt att ha trovärdiga synpunkter.","post_message":"BREAKING"},{"comment_id":"506998642821762","commenter_b":"I'd say a feminist who pees themselves might be drunk.","commenter_a":"Well, that has to be uncomfortable. Only a mental moron would pee themselves. I'm telling you, libs are retarded.","post_message":"How stupid can some people be..."},{"comment_id":"10154923446001337","commenter_b":"No I didn't miss the point Sorry somebody got killed but I live in a town that that happens every day every single day. I'm so used to it that I'm tired of hearing about it. The human species will keep killing each other forever and there's nothing nobody can do about it so why I get pissy.","commenter_a":"So fucking what. There are bigger things in this world to worry about.. it's a fucking word. Nothing else","post_message":"YIKES. The Joe McKnight case took another strange turn..."},{"comment_id":"1181915768493312","commenter_b":"This bitch is just flat out stupid.","commenter_a":"Die cunt!!!","post_message":"Hillary Clinton on Wednesday again criticized Sen. Bernie Sanders, for his stance on legal immunity for gun manufacturers."},{"comment_id":"961733343862087","commenter_b":"Because she's an evil witch!","commenter_a":"She does not speak the truth !!!!","post_message":"No way, no how do I want her in the White House!"}]
