[{"comment_id":"956104721172976","commenter_b":"We will build that wall!!!","commenter_a":"After all we give Mexican illegals having them pay for a wall is racist??","post_message":"David Webb: 'Border security is racist to you?'  Answer: 'It’s not that border security is racist, sir, it’s the whole – you know, he wants to make Mexico pay for the wall.'"},{"comment_id":"792840600880967","commenter_b":"I agree, but so does the weak Democratic Party leaders who have also FAILED us.","commenter_a":"I'm a democrat, Maxine Waters please sit down and regroup. The Democratic Party is weak weak weak and has no legs to stand on and you, Nancy Pelosi and Chuck Schumer need to be replaced period.","post_message":"Maxine Waters on Trump advisers: 'This is a bunch of scumbags. That's what they are, who are all organized around making money.' @webpagelink"},{"comment_id":"859553757415299","commenter_b":"Coming out of the mouth of the most oppressive Fascist in American History!!","commenter_a":"Beat that dead horse. ..beat it some more","post_message":"Attorney General Eric Holder told reporters Friday that the federal government is “prepared” to dismantle the Ferguson Police Department if “necessary.”"},{"comment_id":"1180323918655284","commenter_b":"My cats r broken, both are at best apathetic toward boxes, at worst terrified of them, depending entirely on size and location","commenter_a":"Elizabeth Dain","post_message":"Happy international cat day!  Here's a question for you - why do cats love boxes so damn much?  Find out: bit.ly/1zUeu4c"},{"comment_id":"10156221727930389","commenter_b":"#Trump2016forPRESIDENT Build that Wall !! Make America Great Again is the only one running to can get the job done a Strong Leader ... carson is no-way President Material","commenter_a":"I am still voting for #TRUMP because he enforces the laws and is paying his own way and does not want a salary he is working for what is right for the American People","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"909598592517510","commenter_b":"what a load of crap get off facebook,snapchat,instagram, pintrest,tumbler and go to sleep before 1am then see what happens and u are up at 630 because it u move so slowwwwwww be organized :) and btw u start at 9am","commenter_a":"'@username Dannii Leask","post_message":"We might as well be sending teens to school in the middle of the night."},{"comment_id":"665680246955887","commenter_b":"Fuck u little pussy","commenter_a":"He is committing treason, disrespect for the flag and our country. He deserves jail time and exciled (spelled wrong sorry) from our country. People should not buy his music if possible it should be banned. Exciled him now not later. God bless the USA!!!!!!!!!","post_message":"This is absolutely traitorous. He should be in jail for this.  We're tired of seeing the flag disrespected. Let's start a movement to bring the American flag back...!  Can we get 50,000 'LIKES' for the American flag?"}]
