[{"comment_id":"1104177846295508","commenter_b":"@username Actually the major of women that have Abortions are Christian @webpagelink","commenter_a":"thats is because the democRATs favorite sport is killing our unborn babies...","post_message":"There is something very important missing here..."},{"comment_id":"10153101680026336","commenter_b":"Muslim Terrorist","commenter_a":"Andreas Lubitz is not a muslim but a terrorist","post_message":"LATEST: #Germanwings co-pilot Andreas Lubitz appears to have kept evidence of an illness from his employers, including a doctor’s note excusing him from work the day he crashed an Airbus A320 into the French Alps, prosecutors said. @webpagelink"},{"comment_id":"10153897505943812","commenter_b":"Closing borders will do nothing. Wake up. If they are going to get here, they will. Hell we already have our own killers","commenter_a":"This is going to continue. This will be the US one day. Mark my words. How do we know if some of these refugees coming in are not Isis and just waiting for the word to strike? What do you think now Mr President?? Borders need closed","post_message":"BREAKING: The terror group ISIS today released a statement claiming responsibility for the horrific, apparently coordinated attacks in Paris Friday that killed more than 100 people: @webpagelink"},{"comment_id":"10153794749431336","commenter_b":"She's been dogging scandal since the 70's shady person and that's probably going to be our next president.. Not because she's the best for the job, because she's a woman","commenter_a":"Clinton, will never be president of the USA, NEVER...","post_message":"George E. Pataki on Hillary Clinton’s server scandal. #GOPDeabte @webpagelink"},{"comment_id":"1185050781573456","commenter_b":"This lady is nothing but pure Evil","commenter_a":"Same ole same ole.","post_message":"A top official was just discovered dead... he was scheduled to testify against Hillary Clinton in an up coming corruption case. Our thoughts and prayers go out to his family...this is just terrible."},{"comment_id":"1133469633342492","commenter_b":"Women's bathrooms have that too bc some haven't mastered the art of hovering. Then add on period stuff.","commenter_a":"Joke's on you, pal. Men's public bathrooms are usually pretty disgusting.","post_message":"This. Is. AMAZING."},{"comment_id":"245227072596737","commenter_b":"She's a freaking retard!","commenter_a":"One thing he is not insecure, but you are Nancy","post_message":"\"I feel sorry for you. You're the president of the US and you're so insecure...I pray for your Mr. President. And more importantly, I pray for the United States of America.\" Do you think Trump is insecure?"}]
