[{"comment_id":"10154343066022507","commenter_b":"'@username But they were to be submissive to white brutes if married to them. And she was married to a white brute. Her lies did not influence either Till's murder or the trial's outcome.","commenter_a":"People are quick to point out how different things were back then for blacks but don't forget how different they were for women, especially in the Deep South. What she did was horrendous, don't get me wrong, but I have no doubt that she feared for her own life. She was married to a man that could commit that kind of a crime. The article said that she was hidden away around the time of the trial with HER HUSBAND'S FAMILY. Don't you think she was threatened by them? I have no doubt of it. Being a women, even a white woman, was only marginally better than being black down there at that time. She will answer to God but, have no doubt, she has had to live with the knowledge of what she's done and had reminders along the way of what that entailed with reminders in her own ...","post_message":"60 years after this poor boy was brutally murdered, she finally admits the truth?"},{"comment_id":"638058836332906","commenter_b":"Keep praying! @username is a Warrior for Christ!","commenter_a":"I was born and raised in Pennsylvania, and I'm hoping and praying that come election day the good people of PA will vote for a Presidential candidate who is a life long Conservative, versus an Entertainer!","post_message":"For seven years we've seen an administration that abandons our friends and allies.  That ends when I am president!"},{"comment_id":"791848880944157","commenter_b":"The entire so called debate is a joke as always .FEAR CARD PLAYING BIG TIME .....VOTE BERNIE VOTE BLUE GIVE YOURSELF A CHANCE","commenter_a":"I feel like they act like they want to think of us but yet foot in mouth with trump!!","post_message":"Donald J. Trump is a chaos candidate, and he'd be a chaos president. #chaospresident"},{"comment_id":"10153206762797377","commenter_b":"That's right!!! They have started doing everything you have talked about! Next they will start Building the Wall!!!! Lmbo!!!! Go Mr Trump!!!","commenter_a":"They can`t stop the peoples chose for Trump that`s already there!!","post_message":"Trump Tweets: Wow, because of the pressure put on by me, ICE TO LAUNCH LARGE SCALE DEPORTATION RAIDS. It's about time!"},{"comment_id":"10153892614846323","commenter_b":"Heartless bitch","commenter_a":"you failed your child it is your job to teach them not to go to strangers homes do not trust people over the internet and so on","post_message":"'My heart breaks to think how scared he must have been.'"},{"comment_id":"10153474525188812","commenter_b":"Is she a Mormon? Cause those kinds believe differently.","commenter_a":"This is not ok!! he has said God made him wrong, God is NOT a liar and He makes no mistakes....repent cause looking like you made a true blasphemy against God, please don't comment ignorance, if you have an issue take it to God.....","post_message":"NEW: Meet Caitlyn Jenner -- formerly known as Bruce Jenner: @webpagelink"},{"comment_id":"10154555374851337","commenter_b":"She's a big mouthy bitch lol","commenter_a":"Angie Hoekema","post_message":"WATCH Nancy Grace argue that Brendan Dassey's conviction shouldn't have been overturned..."}]
