[{"comment_id":"10154291680908701","commenter_b":"You're right. You're a white pig. ^^","commenter_a":"Your choices are, Trump, Hitlary, and everyone gets everything for free Sanders. We're screwed. No Trump isn't a racist.","post_message":"Donald J. Trump wins the Republican presidential primary in Washington, the Associated Press reports. MORE: @webpagelink"},{"comment_id":"10153200452766051","commenter_b":"I do not agree with celebrating Columbus day or the fact that he slaughtered the American Indians, however, I was born in this country where we speak English. I've spent 12 years in the Army proudly serving my country against all enemies foreign and domestic. I am against anyone that threatens my country not diversity - I'm against the law that enables illegal immigrants having children in this country and said children being natural citizens.","commenter_a":"It's not racist, we speak English in AMERICA, if you want to speak Spanish then go to or go back to fucking Mexico","post_message":"When this IHOP customer heard what language a fellow customer was speaking in, she snapped."},{"comment_id":"1234054046635197","commenter_b":"Mary Williams jealous of a Roger Ailes flunkie?","commenter_a":"I freaking hate Megyn Faux News Kelly. Arrogant, narcissistic twit.","post_message":"Holy crap! D.L. Hughley called out Megyn Kelly and Fox News for their coverage of police brutality and he did not mince words."},{"comment_id":"764036443733722","commenter_b":"Absolutely! Throw the Muslims off the bus. When will we be able to do as we please even if the stupid Muslims are offended. WE HAVE RIGHTS AND THE MUSLIMS OFFEND US.","commenter_a":"Were wrong. This is America. Freedom of speech.","post_message":"Woman And Daughter Kicked Off Bus For Singing Nursery Rhyme That Offended Muslim Passengers. She was just trying to soothe her daughter. Do you think this is wrong?"},{"comment_id":"10152676040812293","commenter_b":"Really beautiful","commenter_a":"What ever you do . don't feed your mule a carrot ...He or she won't leave you alone. We had BLAST.","post_message":"The full, panoramic view is breathtaking."},{"comment_id":"10154215455576770","commenter_b":"Lock her up","commenter_a":"As a retired military wife she Makes me sick!!! Like she ever cared about America!! She cares only for herself and if you support her I feel sorry for you!!!","post_message":"Hillary Clinton responded within minutes."},{"comment_id":"10153430601099255","commenter_b":"Proving again that ALL FOOLS AREN'T DEAD YET","commenter_a":"Evil attention seeker. Jealous of President Obama.","post_message":"This guy seems so pleasant."}]
