[{"comment_id":"10153260031480095","commenter_b":"Please remove the ones that are already here and close our state's borders to all of them. This is a matter of defense, not of immigration.","commenter_a":"#LetThemInBobby Rescind your order! You are an embarrassment and I am ashamed of you.","post_message":"I just signed an Executive Order instructing state agencies to take all available steps to stop the relocation of Syrian refugees to Louisiana. The Obama administration continues to fail to provide critical information to state government or local authorities and has intentionally kept our state in the dark about their irresponsible refugee relocation plans. This is a matter of national security and a matter of Louisiana’s security. I will do everything in my power to stop this from happening."},{"comment_id":"10153618615406320","commenter_b":"I think this moms do it on purpose.","commenter_a":"Please don't give this woman her kid back. They should take both. Her son will be next. Smdh","post_message":"SHOCKING: Child found 'Sweating profusely' Police in New Jersey had to rescue an child from a car seat in hot van while her mom went shopping. Details: @webpagelink"},{"comment_id":"10153502199714087","commenter_b":"If I had any faith in Clinton. Sure. But I don't. So....","commenter_a":"My dream is that Bernie Sanders agrees to run as Hillary Clinton's vice president on the condition that Elizabeth Warren be appointed Secretary of the Treasury and Bernie gets to focus on one main goal: voter turnout! Bernie can build the revolution he's been talking about by getting everyone more involved and then we can pick up some democratic seats this year and take back congress in 2018 with progressive candidates. Bernie's task would be non-partisan voter turnout and involvement supported by a strong democratic machine finding good candidates in local state governments and for congress. This is a long term plan, one that ultimately paves the way for President Warren. Bernie wouldn't get to be president but he would give us a good 16 year trajectory to push progressive policies. Wouldn't that be lovely?","post_message":"“In the last election, the mid-term election, 80 percent of young people didn’t vote,” Bernie Sanders said.“I’m very proud we’re bringing a whole lot of young people into the political process [and] that we’re revitalizing democracy. If we’re going to change America, that’s what we’ve got to do.”"},{"comment_id":"1017537058301696","commenter_b":"Black men are so screwed up, they are concerned about equal pay for women, pro-choice, illegal immigrants, grass, ducks and horses! Anything that has nothing to do with black men, a black man is concerned about. You idiots are going to be sorry, when all the immigrants are employed and NONE of you English-only speaking Negroes gets nothing. #BlackMen4Trump2016","commenter_a":"Maybe it was sarcasm. Idk... I need more rum...","post_message":"Wondering why Nation of Islam leader Louis Farrakhan said this about Donald Trump? ---> @webpagelink"},{"comment_id":"1041807992526339","commenter_b":"Bitch please!","commenter_a":"he was 14. he admitted it freely (nobody knew or said anything or asked him, he just did the right thing) and he was treated and has no reoffended. If it was your 14 year old son, better yet, shall I name all the 12, 13 and 14 year olds I went to school with that groped me??? Maybe one IS you kid","post_message":"One of Josh Duggar's relatives stepped up to the plate to defend the Right's favorite child molester by claiming that ANYONE would molest kids if there were no consequences and the right opportunity."},{"comment_id":"771398419667869","commenter_b":"Do not trust this corrupt bitch she will promise everything Bernie says so we will back her !Bernie or bust never Hillary she can not be trusted","commenter_a":"#Bernieorbust #NeverHillary #Hillarigged #IndictHillary #RIPDNC #Demexit","post_message":"Thanks to millions of people across the country, we have the most progressive platform in the history of the Democratic Party. Thank you! And while we have made great progress advancing the important issues that brought millions into the political process, the fight is just beginning."},{"comment_id":"981667418562042","commenter_b":"CNN commies hiding the truth and denighing the facts.","commenter_a":"Lemon is such a a a I can't find an insulting enough word. Help!","post_message":"VIDEO: CNN Instantly Ends Segment When Pro-Trump Latina Says This About Donald @webpagelink"}]
