[{"comment_id":"10152920261777014","commenter_b":"White people belong in Arizona, unlawful criminals do not.","commenter_a":"Sheriff Joe is TRYING to do the job he was elected to do. The Feds do not like it !!!!","post_message":"YAY or NAY: Do you approve of the job that Sheriff Joe is doing?"},{"comment_id":"10153178385132061","commenter_b":"Cheesy come back. You dumb blond.","commenter_a":"She's beautiful. I hope she still likes boys. Maybe she's transgender. Not that I care lol","post_message":"\"She's not a girl playing football; she's a football player that's a girl. She plays the game hard, she plays the game tough.\" Meet the teen who was only girl, and a co-captain, on her football team: @webpagelink"},{"comment_id":"871197372940012","commenter_b":"What a vile creature! Hope she rots in jail!!!","commenter_a":"Some people don't deserve to work in child care, I worked in child care for 25 yrs & I have seen some things as well, I worked in a nursery room at my last job( where I got injured & can't work again) & my assistant at the time picked up a 7 month old baby by 1 arm which is a major NO NO, carried him across the room & dropped him 1 metre onto cushions, I spoke to her about it & told her it wasn't on & she went & dobbed to the directors & i was the one who got into trouble, at another centre I sw someone tie a 5 yrs feet up & put them in the resource cupboard so they wouldn't wander around during sleep time, they lost their job for it. so many sickos.","post_message":"Footage shows her attacking girl who fell asleep on nursery floor cuddling her teddy bear"},{"comment_id":"10155223291794218","commenter_b":"Hillary didn't get elected. You're a victim of liberal ideology and the dumbing down of society.","commenter_a":"Section 212(f) of the immigration and nationality act of 1952 states: whenever the president finds that the entry of any aliens or of any class of aliens into the united states would be detrimental to the interests of the united states, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or non immigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate. Any questions?","post_message":"The Department of Homeland Security says it will comply with federal orders not to deport detained travelers"},{"comment_id":"1007061529350376","commenter_b":"Merry I'm very aware it won't be Carly. It's not time for a female President :-) No female running has the ability to do the job. They're both failures in their past jobs.","commenter_a":"The debate proved why we need a Republican President and not Hillary.","post_message":"If you watched yesterday’s debate, you know we can’t afford to have a Republican in the White House. Say you're with Hillary—add your name: @webpagelink"},{"comment_id":"10153272276901323","commenter_b":"Yeah too right let's let everyone in one big party what could possibly go wrong","commenter_a":"Ella Wellington","post_message":"A quarter of Britons think the government should encourage immigrants and their families to leave. That's people like Mehdi Hasan. He argues that while hostility to outsiders may not be a new phenomenon, the so-called immigration debate is now toxically out of control. Anti-immigration sentiment isn't a result of increased immigration, but fear and prejudice  Meera Syal: Growing up between cultures is tough – until you realise it’s a creative blessing: @webpagelink"},{"comment_id":"10153956190753797","commenter_b":"She better go to juvenile....period.","commenter_a":"those other kids should be charged also for not stopping it and cheering it on! makes me sick!","post_message":"UPDATE:  Last week, a controversial video went viral that shows a 3-year-old child being dragged and beaten by two young girls. Over the weekend, officials identified the girl and brought her in to custody. The shocking details involving the attack, here:"}]
