[{"comment_id":"10153391824149205","commenter_b":"Was your mom a thing female voice hater .","commenter_a":"Who in their right mind, even if they don't like Trump, would even care what this thing says. My opinion is just as good as hers, or even more informed. Just because someone is a hollywood star does not make them knowledgable one way or the other.","post_message":"TYT Reporter Jordan Chariton caught up with Oscar-winning actress Susan Sarandon in Mason City, IA after a rally in which she introduced presidential candidate Senator Bernie Sanders (D-VT)."},{"comment_id":"10153161345041336","commenter_b":"Good for the wife!!!","commenter_a":"Hooray!!!!! McDonald is hiring!","post_message":"Donald Sterling gave his mistress V. Stiviano a Ferrari, Bentley, and Range Rover and also covered the majority of her $1.8 million duplex.  But his wife, Shelly Sterling, just got it all back."},{"comment_id":"10153416483736162","commenter_b":"Her heels are scratching up the scoop and that just kills airflow efficiency!","commenter_a":"ALL OF US have pictures like this.","post_message":"A Chicago flight attendant for Spirit Airlines is in trouble for some photos taken on the tarmac at O'Hare Airport @webpagelink  For the stories you care about - \"Like\" ABC 7 Chicago!  Instagram.com/abc7chicago"},{"comment_id":"10157095473970206","commenter_b":"Because she's a lying scumbag","commenter_a":"GOP IGNORES CARLY FIORINA - WHY?","post_message":"The professional political class says whatever they need to do to win and then does whatever they please. We need to return to citizen government. Stand with me. Fight with me. Vote for me."},{"comment_id":"968036809901222","commenter_b":"Take the criminals away first","commenter_a":"FAST & FURIOUS ???","post_message":"This is one of those times where a picture is worth a 1,000 words!"},{"comment_id":"10153380246347217","commenter_b":"Gotta look for the soundtrack","commenter_a":"Ly try it","post_message":"Meowvellous! 🐈"},{"comment_id":"10153896841896636","commenter_b":"Let's talk about what about ... 1. What about Christian imperials from England who colonized, enslaved, stole and murdered people during their colonialism , don't they have Christian knowledge, 2. What about Christian Europeans colonizing America and stealing their land, murdering millions of natives, 3. What about white Christians enslaving blacks people in America treating them like animals and killing blacks for sport. Can you blame these crimes against humanity on Christian faith , NO you cannot , and you cannot blame Islam for the actions of ignorant people. Don't lower your intelligence to the level of ignorant people of past and today who are enemies of humanity .","commenter_a":"Are you trying to defend Islam by claiming that, ISIS recruits have very poor knowledge of islam ? ok, what about the radical Muslim clerics all over Europe, Asia and USA, don't they too have any knowledge on Islam ?","post_message":"Incredible"}]
