[{"comment_id":"10155150563786320","commenter_b":"English is patriarchal oppression Orla, please check your privilege!","commenter_a":"@username @username Bout time😂","post_message":"Hmm... Lena Dunham is crediting her recent weight loss to President Trump. (Image: AP/Fox News)"},{"comment_id":"1157413281045845","commenter_b":"Oh Hillary .... go get a life!","commenter_a":"Stupidty and desperation","post_message":"Remember when Hillary Clinton said refusing to accept election results was \"horrifying\"?"},{"comment_id":"10154393915434170","commenter_b":"They will find other ways !","commenter_a":"Guess the \"New World Order\" has been reordered....all the elites that envisioned a single Global Society can pretty much shove that right where it belongs!! :)","post_message":"The elites are having a meltdown, but the people of Britain have spoken. We've got the reaction from Donald J. Trump as well."},{"comment_id":"910598689036384","commenter_b":"You belong down in NO with the rats. You must be proud to live in one of the shittest places on earth. Simple math there's more whites than other races of course its going to be a higher number.","commenter_a":"What choice do they have? They were forced into this public position. They can't exactly say \"please burn these racist institutions to the ground until America really feels our pain\".","post_message":"Freddie Gray’s family asks for calm in Baltimore."},{"comment_id":"1097574603596883","commenter_b":"Lol those mother fucks love my ankles","commenter_a":"Ruben Yunv Castillo","post_message":"Why do they torment me and leave everyone else alone?!"},{"comment_id":"10152823422866636","commenter_b":"There are desperate people with no job because of (mental) illness. There are enough jobs, but a lot of people don't want them. So immigrants take them and the 'jobseekers\" can blame them.","commenter_a":"We don't ask them to come here and risk life and limb doing so. Why exactly should we have them or even want them.","post_message":"Britain does not stack up well in comparison with other EU member states..."},{"comment_id":"10153572381213984","commenter_b":"Real Americans care, libtards don't give a damn, want more illegals here!","commenter_a":"So sorry......","post_message":"One man whose life was forever changed the day his teenage son died at the hand of an illegal repeat offender is now embracing one 2016 candidate's message. Do you agree with what he said here?"}]
