[{"comment_id":"1580252788658041","commenter_b":"PLEASE STOP POSTING WITH THIS DESPICABLE WOMAN. ENOUGH TORTURE ALREADY.!","commenter_a":"Shes wacked","post_message":"Conway says she is more “amused” than “worried” over the fact that none of the top notch schools in Washington want to accept her children."},{"comment_id":"1754772134792927","commenter_b":"@username is voting for hillary just because she is a female","commenter_a":"I can't wait for you to be the next POTUS @username. You've got my vote Madam Secretary. #Imwithher.","post_message":"You saw the Democratic National Convention. Now, watch the never-before-seen footage from backstage:"},{"comment_id":"1542852682414651","commenter_b":"Nukes don't care about fetuses.","commenter_a":"Two Minutes to Midnightttt! The tiny hands that threaten doom!","post_message":"It was nice knowing you all."},{"comment_id":"1418008091611056","commenter_b":"I bet you a thousand dollars her girls didnt eat that crap they served. Im also sure she herself never ate that crap. She had a full service crew of chef's preparing her gourmet foods 24/7.","commenter_a":"Lunch program? What lunch program? My daughter will never eat lunch at school so I have to fix it for her everyday. On the few occasions where she had to buy it she says it's terrible and she didn't eat it. They serve stuff like corn dog tots with tater tots total processed garbage that doesn't even taste good. What tF is so hard about giving them a piece of chicken on a wheat roll with a piece of fruit?? It ain't rocket science people.","post_message":"Michelle Obama's legacy is already unraveling..."},{"comment_id":"10154383180609641","commenter_b":"Now this is the kind of stories we want to see and hear... Not lesbian kissing in public yet in their hearts they know too that unless they repent and accept Jesus as Lord they are on their way to Hell","commenter_a":"Moms...","post_message":"Meet the woman behind Usain Bolt."},{"comment_id":"10153533859861615","commenter_b":"Get that creep off the streets, love that area. People are so sick.","commenter_a":"Diane Fickley Pesci","post_message":"“(He) blocked her so she couldn’t go any further that way and says, ‘Hey, want to have a good time?’” NOW ON CHANNEL 11 MORNING NEWS: A man is being questioned in connection with an attempted luring of a teenage girl -- in the parking lot of South Hills Village Mall. Hear what she and her mom did to help police track him down."},{"comment_id":"1113471052062455","commenter_b":"Spot on Allen West ... that's Donald Trump","commenter_a":"\"I want to raise a generation of young people who are devoid of conscience, imperious, relentless, and cruel.\" - Adolf Hitler Obama and Hillary read this and are following it. Hillary did her college thesis on this topic. Now you can add Bernie Sanders to the mix. From Alinsky's Book, \"Rules For Radicals\": How To Create A Socialist State by Saul Alinsky There are 8 levels of control that must be obtained before you are able to create a social state. **The first is the most important.* *1) Healthcare Control healthcare and you control the people* *2) Poverty Increase the Poverty level as high as possible, poor people are easier to control and will not fight back if you are providing everything for them to live.* *3) Debt Increase the debt to an unsustainable level. That way you are able to increase taxes, and this will produce more poverty.* *4) ...","post_message":"Allen West Republic @webpagelink"}]
