[{"comment_id":"10154460256056509","commenter_b":"Let's not forget she's a sleazy hooker who is doing the work of an immigrant that no American would do.","commenter_a":"Oh so what! trump made fun of Bush having his 90 yr okd Mom campaigning. At least you can understand her, unlike Trumps trophy wife who needs speech lessons. Do we really need a flotus who barely speaks u derstandable englush!","post_message":"See if you can tell why Ted Cruz's campaign pulled this ad."},{"comment_id":"421180878069520","commenter_b":"^^ this idiot supports sanctuary cities and providing safe harbor to illegal alien criminals","commenter_a":"Hillary belongs in prison.","post_message":"More than $400 million has poured into the presidential race so far."},{"comment_id":"1184087691636663","commenter_b":"Donald Trump doesn't smoke, drink or do drugs. One of biggest problems in USA. Golden Crescent (@webpagelink) Build that Wall....Fence Act of 2006...Ask yourself the ???? Make America Great Again! Corruption!!!! Stop Trump!!!!","commenter_a":"Well Done Donald.","post_message":"Thank you Republican National Committee."},{"comment_id":"10153580191021438","commenter_b":"You folks just restored my faith in humanity","commenter_a":"If I didn't live on exactly the opposite side of the USA (SC!) I'd totally be holding a sign up there with her.","post_message":"“I knelt down to a protester's kid and said, ‘Do you know about yeast infections?’”"},{"comment_id":"1875772702705471","commenter_b":"These hoes aint loyal","commenter_a":"@username 😴","post_message":"So messed up  #WSHH"},{"comment_id":"552107031615918","commenter_b":"Jordan get out of here with that nonsense.","commenter_a":"Doesn't affect me. I'll be voting for Bernie.","post_message":"In response to a VICE News FOIA request, a federal judge on Thursday ordered the State Department to release the bulk of the remaining Clinton emails before the February 27 contest."},{"comment_id":"1210841148970887","commenter_b":"Be honest, if it was anyone other than Trump, would you STILL vote for her? Fact is she would have already packed up her tent and left town to sell more books if this was 't Donald frigging Trump she was running against? That's something to be proud of? The second worst? You see that's where a candidate needs to be a good candidate to get my vote. In my book she's not, if your Presidential standards are that much lower, ok, vote for her. Mine aren't.","commenter_a":"Sorry Bernie, but I can't sit here and watch you degrade yourself into just another shill for her. You used to hate what she stands for. Now you endorse it. I hope you find your way again Bernie. But for now. I gotta unlike ya.","post_message":""}]
