[{"comment_id":"10154553926556729","commenter_b":"Shes an ugly bitch","commenter_a":"I think her and Fiorina fell out of the same tree.","post_message":"Thank you, President Obama!"},{"comment_id":"10153270058159497","commenter_b":"We are all snacks, can't we get along?","commenter_a":"Oh SO SNACKS DON'T HAVE THE RIGHT TO DEFEND THEMSELVES?","post_message":"From our sister publication, ClickHole:"},{"comment_id":"10155832964064062","commenter_b":"But you're gonna pay for that wall?? Here's some facts no fake or false ones where are you getting your info?? Russia? @webpagelink @webpagelink And if you make that much good for you hire trumps tax attorney trump hasn't paid for taxes you're crying about in 20 years, It'll help offset the insurance cost. I'm sure you can afford it.. And again democracy is majority of the vote as for the illegitimate vote why don't you believe the fact it was tampered with to make trump win? Guess 2+2 never equals 4 ..he won with little more than 25% of actual registered voters now tell me how that works?? As for God's being in government it's expressly written to be kept out by our founding fathers ..called separation of church and state.","commenter_a":"I feel sorry for the people who actually believe in him. They need God in their lives, seems as nothing in this earth can convince them they are being screwed lied to and alienating half of the world. Keep drinking that kool aid let's see what shambles we are left in.","post_message":"President-elect Donald Trump defended a plan this morning that would see the U.S. initially pay for a border wall with Mexico and be reimbursed at a later date."},{"comment_id":"848280508611132","commenter_b":"Bye bye illegal parasites. Free ride is over. Self Deport before you're kicked out kicking and screaming.","commenter_a":"Donald Trump is the man. It's time to rid America of career politicians, and put someone in the White House that genuinely loves their country.","post_message":"820,000 crimes committed by illegal immigrants, here in America. Guess what! NOT WHEN I AM YOUR PRESIDENT! I can assure you of that! We will BUILD THE WALL- and Mexico is going to pay for it!"},{"comment_id":"983924208336363","commenter_b":"America matters. They have been told we are the land of the free.some people here know what free is.if our government would stop the hand outs then and only then we wouldn't have to support them or anybody else...take care of our own first.","commenter_a":"This is the UN top priority to control these flood of people leaving their own country for a better life/safety of their family, and if they make it all the way....The human smuggling organizations like this type of situation and it brings a large revenue to their business all over the globe... We only can hope and pray that all nations will come together try to come up a solutions to stop the displacement of these people of the terrorist activity and senseless killing of innocent people base of their religion.... Here we are, we spent millions or billions in a exploration way out deep in our universe to study a planet that can sustain a human in the near future?...Yet, we have all of these important issues that needs to be fix, and maybe, we make our planet a better place for everyone.... We only can hope and pray ...","post_message":"RIDICULOUS: Over 700 African Illegals Caught in Panama en Route to the United States The number of Africans who have illegally traveled through Panama on their way to the United Sates has more than doubled so far this year. GREAT WALL OF TRUMP PLEASE! @webpagelink"},{"comment_id":"10154085649949203","commenter_b":"almost half of your stupid bitch ass country was from Mexico. We should take it back since ya'll going to hell with trump.","commenter_a":"My grandfather served in the punitive expedition. A forgotten incident in our history.","post_message":"It has been 100 years since the first act of terror on U.S. soil."},{"comment_id":"10153689322651162","commenter_b":"Typical female cant let another female live. Lol","commenter_a":"Stupid a@@! She probably walks faster than the Barbie Jeep.","post_message":"WOW: A 20-year-old college student's license was suspended when she was busted for a DUI... So she decided to get around campus on a Barbie Jeep instead: @webpagelink"}]
