[{"comment_id":"10153245787992507","commenter_b":"I never liked that women .","commenter_a":"She is Just not a good person ......","post_message":"Ann Coulter brought knives to a gun fight on The View."},{"comment_id":"10153519290756336","commenter_b":"Good He caught Her now She cannot steal Anyone Elses's Identity","commenter_a":"You are a thief ! .... end of story","post_message":"\"You picked the wrong guy.\" FOX 4 News reporter Steve Noviello confronted a woman who allegedly stole his credit card on camera."},{"comment_id":"1733753426842494","commenter_b":"@username Subtract the illegals and convicted felons that cannot vote those minority numbers are laughable .","commenter_a":"I see Hillary's sheep say Trump will Lose the Latino, Woman, LGBT, Veterans and Blacks votes. I am sure Latinos enjoyed seeing they are called taco bowl voters to the democrats. Women Yeah because Women most likely respect the way Hillary treated women when her husband sexually assaulted them, LGBT yeah because her policies are directly responsible for 49 of there deaths in Orlando and she wants to increase that by 500%, Veterans yeah because every service man/woman wants a women who will abandon them. Blacks yeah because blacks love to be called super predators, The only votes Trump is losing is to brain dead people who care more about a business mans taxes then they do Clinton's proven corruption and lies. and the only polls Trump is losing is broadcast on the same media outlets that have been proven to be corrupt. Watch a Trump rally and then watch ...","post_message":"\"[Hillary Clinton] is bought, controlled and paid for by her donors and special interests.\" Donald J. Trump gave a speech on economic policy this afternoon, saying \"Hillary Clinton will never withdraw from TPP.\""},{"comment_id":"1721466568134277","commenter_b":"SHE IS A HITLER","commenter_a":"What an idiot","post_message":"Was this a good idea?"},{"comment_id":"1370953329605967","commenter_b":"She can start any day....","commenter_a":"@username maybe Jerry will do this to Eddie someday soon. 😐","post_message":"The only thing that can calm this grumpy toddler is her love for her baby sister: @webpagelink"},{"comment_id":"10154138002220671","commenter_b":"If they dont catch her already","commenter_a":"#NewAge","post_message":"Police pursuing possible homicide suspect in Southern California"},{"comment_id":"367438390047230","commenter_b":"Devora Sexton and you are a cheap whore","commenter_a":"If a man's children and wife are a measure of him, Trump is a hell of a guy.","post_message":"Another reason Dems are terrified..."}]
