[{"comment_id":"1305769832812876","commenter_b":"Lock that b@tch up","commenter_a":"TODAY'S WIKILEAKS..Donna Brasile, GO READ UP! She got advance questions from CNN Debate, Hillary v. Bernie Sanders for Democratic run. She is the most corrupt politician possibly in our Country's history.","post_message":"As secretary of state, Hillary restored our reputation around the world and made us safer."},{"comment_id":"10153131425722293","commenter_b":"They are our imagine of the \"freedom\" .","commenter_a":"Yes.","post_message":"Experts fear a whole slew of risks that may follow should these tribes come into full contact with the outside world."},{"comment_id":"1077509702340944","commenter_b":"She's a vulture.","commenter_a":"She is disgracing American's right to vote. She is labeling anyone who is not a Democrat. In other words we are \"basket cases\"! It's one thing to bash Trump, quite another to degrade voters.","post_message":"Hillary Clinton is taking heat for saying \"you could put half of Trump’s supporters into what I call the ‘basket of deplorables’. Right? The racist, sexist, homophobic, xenophobic, Islamaphobic — you name it.\" What do you think?"},{"comment_id":"810172682363901","commenter_b":"Send the illegal aliens back","commenter_a":"Illegal immigration is an old problem, the native Americans used to call it \"White People\"","post_message":"It's as simple as that!  www.headlinepolitics.com"},{"comment_id":"10156901332200192","commenter_b":"Roxann Bracken ,you are above this EVIL woman ,you do not need to justify yourself ,YOU ARE AN AWESOME MOM , I don't know how someone like this @username sleeps at nite !!!! when she has such evil thoughts , Maybe if she would have raised a better Son he wouldn't be an abuser and in Jail ....just sayin ......I love you and am praying for you","commenter_a":"Just because you live in a nice house doesn't make you a good mother Robert Jennings is the father of Clayton there's a lot of facts people don't know I just hope they keep the investigation up this is no accident this is neglect","post_message":"BREAKING: Pasco deputies found the body of a missing 2-year-old Hudson boy Wednesday night in a pond near his home."},{"comment_id":"10153489348776756","commenter_b":"Only a woman could find something completely fucking trivial to bitch about a great thing.","commenter_a":"#FirstWorldNonProblems","post_message":"\"Can I just passively refuse to pass the beach balls back up until they collect around my feet in one incriminating pool? How coldly can I glare at the people who try to resurrect the beach balls I've silently condemned to the ground?"},{"comment_id":"10153697360054091","commenter_b":"Relax...pretty sure she won't get a welcoming party in jail...LOL","commenter_a":"Really? So now taxpayers get to pay to house her, feed her, clothe her, get her medical attention when needed. Who wins? This woman should just be drawn and quartered after a long term of suffering torture. A mind like hers should never be able to influence others in prison. Maybe they will put her in a dark place alone and forget about her.","post_message":"A Colorado judge sentenced the woman who cut a baby from a stranger womb to a century behind bars."}]
