[{"comment_id":"10153459873801756","commenter_b":"She's a Jew deliberately provoking hatred between Christians and Muslims.. Ask yourself why...","commenter_a":"I have to say I thought more people would be for protecting speech from violence, since we're in the liberal west and all, but apparently not. Paris gets shot up and the claim is to be \"je suis charlie,\" Texas gets shot up and \"they were asking for it.\" Makes no damn sense. You're either for the rights of us all to speak without fear of being shot, or you're not. I went to a public school and I learned that Voltaire quote. Small minded terrorists of an idiot ideology that requires giving your life to kill anyone who mocks your \"sacred\" beliefs. What a load of bullshit.","post_message":"The group's executive director runs a website called Atlas Shrugs, which The New York Times says \"attacks Islam with a rhetoric venomous enough that PayPal at one point branded it a hate site.\""},{"comment_id":"10154170724496409","commenter_b":"@username, according to YOUR new president, we can all drop by your house and grab your pussy...Don't get mad at me, trump said it was alright.","commenter_a":"Obummer sucks. DONALD TRUMP. None of you can change that. Poor pitiful liberals you really do make yourselves look desperate and ridiculous","post_message":""},{"comment_id":"10153428772146509","commenter_b":"Cause she was worthless and weak that's why!!","commenter_a":"Why would you choose the classroom to do that?","post_message":"There was no indication of foul play, and every indication that she took her own life, officials said. @webpagelink"},{"comment_id":"931439316891490","commenter_b":"And the POPE lives in the woods!]","commenter_a":"It may as well be true. He always lies and is immoral and evil.","post_message":"Is this true?"},{"comment_id":"10154310515973822","commenter_b":"she clearly states on her wbsite that money not used will go o her pay for future campaign #JillSteinScam","commenter_a":"What's Jill gonna do with all that cash? No refunds, no exchanges, all donations final.","post_message":"JUST IN: The Green Party is dropping its court case seeking a recount of Pennsylvania's Nov. 8 presidential election."},{"comment_id":"10153354234326336","commenter_b":"Women should only be allowed to make the sandwiches.","commenter_a":"Females should not be prison guards for male prisons. And I don't want to hear from all the feminist. That is my personal opinion.","post_message":"BREAKING NEWS: New York state prison employee Joyce Mitchell has been arrested on felony charges for providing material assistance to prison escapees, state police say. @webpagelink"},{"comment_id":"10154833870921336","commenter_b":"The pussy you are referring to is a family who call themselves Lisa, nice safety pin by the way, do they make them in mens?","commenter_a":"If Trump states that 'Nothing will Change', then he should stop being such a pussy and stop belly-aching about the recount. He's a complete WIMP.","post_message":"Reince Priebus slammed Dr. Jill Stein's presidential election recount effort, which was recently joined by Hillary Clinton's campaign."}]
