[{"comment_id":"10154096088722373","commenter_b":"a monstrous buffoon!!","commenter_a":"I agree Senator! So where have you been while former Presidents, candidates and officials broke the law? President Obama ruled by EO so Trump is picking up where his predessor left off. Just going at it from different direction. We need to get back to changing law via legislative process rather than by fiat.","post_message":"Donald Trump is going to have to learn, in one way or another, the very important truth recently stated by the Attorney General of Washington, Bob Ferguson: \"We are a nation of laws. Not even the president can violate the constitution. No one is above the law, not even the president.\""},{"comment_id":"1122771727815880","commenter_b":"I wouldn't want that pussy fighting next to me.","commenter_a":"Draft Dodging Coward","post_message":"Donald Trump is just another Republican chicken-hawk. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153127480747411","commenter_b":"That's what boobs are for, to feed your children. Yet women can walk around in boob pasties and thongs but that's ok, get real!!!!","commenter_a":"Proud nursing in public Momma right here.. never feel shamed. If you want to cover, go for it. If you want to go in private, do it. If you want to feed your baby in front of the world, go right on ahead. It's boobs people. But you have no problem with bikinis that show WAY more of most women than when nursing their child. Grow up","post_message":"NURSING MOTHER: POLICE SHAMED ME A Nebraska mother breastfeeding her 4-month-old son in public says an officer threatened to cite her for indecent exposure if she refused to cover up. What do you think about this?"},{"comment_id":"10153031341999705","commenter_b":"Sunset Avenue Dove Dove","commenter_a":"I need this in Florida!!!","post_message":"Ok, Starbucks."},{"comment_id":"712201488878460","commenter_b":"Just can't stand that a black woman dresses better than you eh? Jealousy is a sin ya know.","commenter_a":"funny how ms obamas wardrobe has gotten mote expensive over the years. guess jcrew too cheap for her now. oh well, shes outta here soon anyways ;)","post_message":"Michelle Obama wore a familiar outfit last night ..."},{"comment_id":"10154316928129740","commenter_b":"Haha I look for radar too","commenter_a":"Driving in the personal car you see a vehicle in oncoming lanes that is definitely speeding.. You check the dash mounted radar that isnt there... Also constantly go to adjust the ghost ear piece off duty.","post_message":"These funny habits that follow you home — even after retirement — prove that officers are never truly off-duty."},{"comment_id":"10150755555864999","commenter_b":"Because Bernie is a threat to their entire way of life.","commenter_a":"You guys are honestly so biased, this is good! I don't want a president who can't go 5 minutes without talking about their bible, and I much prefer a secular president, as does our Constitution with the whole separation of church and state thing. Why do.you have to twist everything in the world into a negative for bernie and positive for hillary.","post_message":"Unlike Hillary Clinton, who states emphatically that she is a Methodist “person of faith,” Bernie Sanders responds to questions about his beliefs by turning the conversation toward political ideals."}]
