[{"comment_id":"1046596102028067","commenter_b":"I hope you'll be the pregnant one cause you're a bitch >:(","commenter_a":"Lol wut @username","post_message":"No women required."},{"comment_id":"10152939381996770","commenter_b":"That's her right to do so. Now can we just move along here!","commenter_a":"'@username's mother is just as big a piece of crap as he was.","post_message":"As the one-year anniversary of the death of Michael Brown nears, his mother says that she will never forgive Darren Wilson, the Ferguson, Mo. cop who killed him."},{"comment_id":"1042887679092881","commenter_b":"Democraps Are The Cronies....","commenter_a":"What bunch of pussys, liberal Socialist progressive cry babies","post_message":"Democrats are staging a sit-in for gun control measures on the House floor, led by Congressman John Lewis. Congressman Beto O'Rourke is streaming the sit-in from the floor @webpagelink"},{"comment_id":"10152949649721378","commenter_b":"I don't use any drugs...yet your comment is still incomprehensible.","commenter_a":"Disturbing and sinful....","post_message":"IRELAND  MARRIAGE VOTE NUMBERS: 62.1% of voters in Ireland were in favor of same-sex marriage in the world first national vote on the issue.   Ireland's deputy prime minister, Labour Party leader Joan Burton, said Ireland was becoming 'a rainbow nation with a huge amount of diversity.'"},{"comment_id":"10154227376546336","commenter_b":"She'll milk it til the end.","commenter_a":"There was never evidence to warrant charges. Hopefully, that reporter had her five minutes in the spotlight, and she's done in the field of journalism. What an insult to journalism!","post_message":"Breaking News: Charges will not be filed against Donald J. Trump's campaign manager Corey Lewandowski, Florida state attorney says."},{"comment_id":"10153756549625667","commenter_b":"No Trump No Hillary, any body else, American have the best.#","commenter_a":"like my page awlad nass","post_message":"As the Iowa State Fair got started 20 years ago, two people were shot dead in the exhibitor campgrounds."},{"comment_id":"10155818852335354","commenter_b":"Fucking assholes!! The Dukes weren't racists!! God this country is full of weak kneed liberal scum!","commenter_a":"This is really getting crazy,who,s running this country anyway.We didnt used to have such nonesence.","post_message":"Absurdity..."}]
