[{"comment_id":"10155790641929778","commenter_b":"Were you guys offended when Obama did it? This is why nobody trusts the media, it's completely bias!","commenter_a":"If you, or anyone you know, is personally affected by this ban, please reach out to us. Message us on Facebook or email newstips@wusa9.com.","post_message":"More than 30 protesters are holding signs against President Donald J. Trump's immigration plan at Washington Dulles International Airport. @webpagelink"},{"comment_id":"451811115023381","commenter_b":"#DonaldTrump2016Bitches","commenter_a":"You should be embarrassed acting like a child picking on the other runners. Why can't you just tell people what you would do as president? Can't believe a potential president would act like a child...I thought you were different...","post_message":"Tomorrow is the most important Tuesday in a long time. Vote for me, & together we can stop Trump & win in November."},{"comment_id":"1229522020425442","commenter_b":"I don't know about everyone else but I still think she looks good without make up.","commenter_a":"She's so beautiful! Why would she want to cover up that face? Who would, if they actually thought about it?","post_message":"\"Just a little concealer next time.\""},{"comment_id":"864050243704778","commenter_b":"We should have spoken up about the poor quality of the American diet sooner. GMO food & MSG should have been outlawed!","commenter_a":"TRADUCTION ARCHI NULE","post_message":"Well?"},{"comment_id":"10153831710401509","commenter_b":"OMG !!!! GET OFF HER BACK, people get suntaned without a hassle !","commenter_a":"ENOUGH!!","post_message":"Paula Deen has some \"explaining\" to do: @webpagelink"},{"comment_id":"1076817779005244","commenter_b":"We'd have a beautiful First Lady!","commenter_a":"Don't want her or him","post_message":"If Melania Trump succeeds Michelle Obama as First Lady, she may trace her road to the White House back to 1987 and a chance encounter in the capital of her native Slovenia. Find out more about Melania: @webpagelink"},{"comment_id":"1192730294142303","commenter_b":"Sherry Ashrof","commenter_a":"Mike Simm","post_message":"Nice ice baby!"}]
