[{"comment_id":"10153832983220950","commenter_b":"Bitch u just said a bunch of racist shit now","commenter_a":"Yes, he did behave badly but, those two athletes who chose to speak out against the country they were sent to represent, the country that has supported their goals, trained them and gave them the tools they needed to succeed in their sport, should face the same fate as Lochte.","post_message":"Speedo wished Ryan Lochte well, but said it \"cannot condone behavior that is counter to the values this brand has long stood for.\""},{"comment_id":"10153370720431509","commenter_b":"Well the real word is cold and full of corruption and greed. This type of harvesting happens on a daily basis in 3rd world countries, poor desperate individuals selling their kidneys in back allies to rich benefactors. Most illegal organs are stolen form human trafficking.","commenter_a":"Organ harvesting and transport is complicated. You can't just slash a body and grab them out. This sounds like a ploy by the Iraqi govt to get headlines","post_message":"It's a startling claim. If true, what could be driving increasingly extreme tactics #ISIS is employing? @webpagelink"},{"comment_id":"10154473534223812","commenter_b":"@username a female misogynist is what you are","commenter_a":"there are many good women in politics - not Hillary or Elizabeth Warren however.","post_message":"JUST IN: Elizabeth Warren endorses Hillary Clinton for president. Clinton is not ruling out the prospect of having her on her ticket as vice president."},{"comment_id":"10158609012850725","commenter_b":"What an ignorant old hag smfh","commenter_a":"Time to round up all the black scum and jail them all. If found having done a crime they get death. The faster we get rid if those in jail too by death the better it is. They all are scum and should all be destroyed.","post_message":"A suspect has been charged with the murder of Karina Vetrano, whose gruesome death shocked the community and set off a six month search for her killer."},{"comment_id":"479633975574097","commenter_b":"Every time she opens her mouth ... ........I smell !","commenter_a":"BUSTED! What's done in the dark will get exposed to the light!","post_message":"Hillary Clinton has previously claimed that she and Bill Clinton were “dead broke” when he left the White House, but the two have since amassed millions of dollars in wealth."},{"comment_id":"523889751104313","commenter_b":"Ban muslims ? Better chance at banning tards first. Show me where islam justifies it. Quote the quran. If you have brain cells, lets discuss islamic facts.","commenter_a":"Where are the idiots who just a few hours ago were blaming gun laws for this? Where are they now?? Are they all shy and in hiding after it has been proven this was done by MUSLIM TERRORISTS? Muslim terrorists killed 150 people in Paris too, and they don't have the second amendment in France, how come??? #BanMuslimsNotGuns","post_message":"Authorities have named the two attackers suspected of carrying out the shootings before being killed themselves as Syed Rizwan Farook, 28, and Tashfeen Malik, 27."},{"comment_id":"10154362175295329","commenter_b":"In the meantime, STFU. :P Because see below? Where she says, \"I considered myself a feminist before it was cool, now everyone is claiming it?\" She said that a while ago. First, tell that to Gloria Steinem, honey. Second, I think it's not really feminism when one woman decides to deride another because she decides that she's not doing it right? Yeah, no. Sorry. That sucks a lot.","commenter_a":"Stfu demi","post_message":"\"How the fuck am I making this about myself?\" – Demi Lovato"}]
