[{"comment_id":"10155083896191178","commenter_b":"He might bring racist charges up against you","commenter_a":"OK I'm going to say it Everyone is racist OK we get it wahh wahh wahh!","post_message":"The histrionic grumblings for the liberal parodies over at MSNBC are STILL outraged over Sen. Sessions.  Liberals never seem to realize that they've worn out the racism accusation."},{"comment_id":"10153978622861438","commenter_b":"Of course she is. I could see through that bubbly bs","commenter_a":"Shocker....not.","post_message":"Kelly Ripa’s morning talk-show drama might force us to acknowledge all the work that goes into her cheery persona."},{"comment_id":"10153451640786973","commenter_b":"Regarding your Columbus post earlier, in my school he isn't credited with what you are saying. Blanket misconceptions are counterproductive, especially when it comes to school. Much like the Pledge crap that goes around... we do the Pledge, even if Fox news says otherwise.","commenter_a":"When my children are sick, they'll miss school. When they have dentist appts they'll miss school. If I decide it, they'll miss school. I'm the parent, our family's needs come before school administration's needs. Period. The school is LUCKY to havey children attend and i warch them like a hawk. Our childrens mental health is more important than grades and standardized testing!! And @username you've got to be high on meth if you think for one minute every doorstep wants or needs a social worker or, the GOVERNMENT rather, invading their privacy, trying to make parenting decisions or stomping on civil liberties on even the smallest scale. I wouldn't put up with that for a second. And haven't you been paying attention to what a total, corrupt failure DHS is anyway??? Ridiculous notions.","post_message":"Oregon schools have done little to intervene despite having 94,000 students miss at least 10 percent of the school year."},{"comment_id":"600892556733313","commenter_b":"She should put in jail with all Males and stay with them 24/7/365","commenter_a":"So not only he is a kid, he is also special needs. And on top of all of this, she is 71 among kids ????! The school should re think abt the age of teachers dealing with kids. In late 30s and a woman can hardly handle her own kids !!!! Shame","post_message":"71-year-old teacher Amelia Stripling was arrested and charged with 2nd degree cruelty to a child after knocking over a pre-K special needs student in Georgia.  @webpagelink"},{"comment_id":"10153381593334411","commenter_b":"If you've been in brothel, you are worse than a prostitute, as prostitutes might were forced to do it, you go there at you own will, which makes you a sleaze-ball","commenter_a":"idk, a Russian backed news organization saying America is a police state? Maybe, but few people are being jailed for being gay here as opposed to your 'glorious': homeland","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153387915812756","commenter_b":"I guess there's no zoning regulations ?","commenter_a":"Sad","post_message":"We learned on Monday that it was not the first time the owners of a home in Carbon County had animals removed from their property."},{"comment_id":"10154132687525579","commenter_b":"I SWEAR, THE MEN IN THIS COUNTRY ARE SUCH PANSIES NOWADAYS.","commenter_a":"No matter the numbers, you won, Bernie! America will not be the same because of your tenacity, integrity, and values! Thank you!!! We'll keep fighting. #NotMeUs If you like this comment, please contribute to Sanders's campaign at the below-posted link. @webpagelink","post_message":"Bernie Sanders: 'Tonight, while the results are still not known, it looks like we are in a virtual tie.' Full video here: @webpagelink #IAcaucus #IowaToday"}]
