[{"comment_id":"1292853950724756","commenter_b":"Or marry him, or bear his children, or even be in the same room with him. Not worth any amount of money could buy a smart woman.","commenter_a":"Always a lady with class, dignity and honesty.","post_message":"She's absolutely right."},{"comment_id":"1603818663247762","commenter_b":"The Lying Queen","commenter_a":"The Clinton Crime family song Dirty deeds done dirt cheap AC/ DC Clinton Crime family song","post_message":"WATCH: Hillary Clinton news conference on FBI investigation."},{"comment_id":"10156946907525389","commenter_b":"'@username you are just a hater. Stop disrespecting people specially Muslims.","commenter_a":"Love this man!","post_message":"'Why didn't she say, 'Hey, make better lifestyle choices?' If you want to join something, why don't you join a church, why don't you join the Boy Scouts or the Girl Scouts?'  Milwaukee County Sheriff David A. Clarke Jr criticized Hillary Clinton's comment on joining 'positive gangs.' @webpagelink"},{"comment_id":"453510694837224","commenter_b":"I love it! muslims do not belong within our borders!","commenter_a":"Arkansas get on the ball, and do the same.","post_message":"If you don't like our laws and constitution...we can help you pack and leave!!!"},{"comment_id":"1269427259813296","commenter_b":"SOME OF YOU IMBECILES SICKEN ME WITH YOUR OPEN MINDEDNESS TO ALLOW MORE REFUGEES AND WHICH ARE TERRORISTS COME INTO THIS COUNTRY!! WAKE UP UNLESS YOU WANT TO BECOME ENSLAVED TO THE RELIGION OF ISLAM AND LOSE ALL YOUR FREEDOM ,BE BEATEN,BE RAPED ,BE BEHEADED..ETC...ETC...THERE'S NO PLACE IN THIS GREAT COUNTRY FOR YOU UNTIL CHRIST'S RETURN,THEN SHALL YOUR FATE BE DELIVERED AND ETERNAL HELL AND DAMNATION WILL BE UPON YOURSELVES,NOT 72,000 VIRGINS AS YOU THINK !! THE ONLY VIRGINS YOU RECEIVE ARE THE INNOCENT LITTLE GIRLS 6,7,8,9,10 YEARS OLD THAT YOU ARE RAPING AND DESERVE DEATH TO YOURSELVES FOR!!","commenter_a":"STFU he said he does not reveal plan! STFU","post_message":"Broken campaign promise!"},{"comment_id":"10154406846618734","commenter_b":"Really lady get over yourself. All you want is Money!!","commenter_a":"This is where feminism has brought womyn: seeing themselves victimhood is the highest calling of all.","post_message":"Do you think the claim is too much? Or just right?"},{"comment_id":"488312324683981","commenter_b":"Hmm if firearms are a replacement for a small penis what are females replacing with firearms @username???","commenter_a":"Gun Worship in The United States of Guns is Killing US...","post_message":"SCARY!!"}]
