[{"comment_id":"612030692317870","commenter_b":"HAHA Austria also has an entire budget that is smaller than America's military budget is alone. I'll keep my 19% tax rate thank you. You all had your damn kids, pay for their college yourself. I'm not paying it just so they can go out and buy a new BMW when they graduate.","commenter_a":"Those poor bastards...they will be stuck in an Obama like environment.","post_message":"Austria's election gives hope that the far-right wave sweeping the West can be stopped."},{"comment_id":"10153092001211037","commenter_b":"Divina there must be some way around this.God it would be a sin to put an animal down for no good reason ! Some Humans are the worse I tell you. Try talking with her when ever she has her bouts. I had one like that too and then again for heavens sake if it's not often then what is the problem she is a dog and that's what they do. Ugg I hope something else gives them reason to move faraway from you.","commenter_a":"Naomi get a pellet/ BB gun pump it 3 times hit that dog a couple time it won't bark anymore. It doesn't break the skin nor leave marks ( I know this for a fact) but will shut them up.","post_message":"A North Seattle woman faced a lawsuit from a neighbor alleging her dog Cawper’s barking was intentionally causing him “profound emotional distress.” The neighbor wound up winning $500,000 by default because she did not challenge his claim.  Would you sue your neighbor over a disruptive pet?"},{"comment_id":"10154093507981337","commenter_b":"She's not hot enough","commenter_a":"I love Daisy. She's gorgeous. She'd be perfect for the role.","post_message":"Daisy Ridley as Lara Croft in a new Tomb Raider?? She's been having conversations about it..."},{"comment_id":"10155176603990389","commenter_b":"Don't know of anyone who did. Won by fraud.","commenter_a":"I didn't vote for this useless President!!!","post_message":"ICYMI: Republicans cheered as President Barack Obama said “I have no more campaigns to run.” Obama, cracked a smile and responded: “I know because I won both of them.”"},{"comment_id":"591316744410090","commenter_b":"Rachel is such a Clinton lover.","commenter_a":"She is as Slimy as he is. All they have is harass Hillary. Guess what. It doesn't touch her. #ConManTrump #Hillary2016 #imwithher #StongerTogether #Trumpstaxreturns","post_message":"What is Donald J. Trump's stance on immigration? Trump campaign manager Kellyanne Conway stops by The Rachel Maddow Show to shed some light.  More from Rachel Maddow's interview with Kellyanne Conway: @webpagelink"},{"comment_id":"933606760085373","commenter_b":"We should have dropped another one !","commenter_a":"He is the 1st president to do so, sometimes it takes a bigger man to start something else. Maybe after this the Japanese will come to Pearl Harbor and do the same. What is wrong with u people. The man is talking peace and yes what happened years ago was evil on both ends, it don't mean u can pay respects. I hope all presidents from around the world take a piece of what Obama has done to try and end hate because it seems like we are going backwards with trump being so popular. He's making it ok to be racist and hateful and it's not. Happy Friday y'all","post_message":"Pres. Barack Obama lays a wreath at the Hiroshima Peace Memorial, mourning the Japanese, Korean and U.S. victims of the world's first atomic blast in WWII. @webpagelink"},{"comment_id":"10153575506851782","commenter_b":"It doesn't show a picture of the impala. All the vehicles in the picture are police cruisers.","commenter_a":"The article says it was a white impala, is it just me or does that car look black?","post_message":"HIGH-SPEED CHASE: Purcell police are chasing a vehicle at speeds of more than 100 mph on 180th Street: @webpagelink"}]
