[{"comment_id":"10154960585818984","commenter_b":"She is wacko bird ...","commenter_a":"Yeah that fact that I can't debate .........because Trump is a bigot.Sexist, homophobic, racist, fear off warrior goddesses (think about it), also. And Hillary told you he was so it must be true.","post_message":"Elizabeth Warren is a liberal favorite, and she LOVES pushing her talking points on CNN. She thought this was going to be another easy opportunity to peddle her views, but this host immediately put her in her place. Her reaction is priceless..."},{"comment_id":"1738340076416341","commenter_b":"Women can be President too 21 Century America ,,,","commenter_a":"Vote Trump to end the Clinton Crime Cartel as we know it.","post_message":"Mike Pence \"signed an abortion law so extreme and so dangerous that even pro-life Republican women in the Indiana legislature spoke out and voted against it.\""},{"comment_id":"1522859634396359","commenter_b":"\"Liberalism is a mental disorder\"...Dr Michael Savage. That woman is not fit to be that precious little boy's mother!","commenter_a":"I cannot watch this. This monster (mother) is horrible and I cannot imagine how frightened this little child was. She deserved to be punished.","post_message":"Imagine how the media would have been all over this story if the mother had been a Trump supporter furious at his defeat. And this story still hasn't made out of Houston. It's still just a local story."},{"comment_id":"861148387265123","commenter_b":"Female racist-in-chief.","commenter_a":"-who is she to make that decision, no man has that right - God creates life!","post_message":"What sorts of \"populations\" does it sound like Ruth Bader Ginsberg is interested in \"controlling\" here?"},{"comment_id":"995597563869829","commenter_b":"@username you are free to get the hell out","commenter_a":"Nobody takes Huff po seriously . I read it to see what liberal homos think.","post_message":"Should news sites cover Donald Trump as politics or entertainment?"},{"comment_id":"659700944220484","commenter_b":"yes beat her ass for being arrogant","commenter_a":"REALLY,??","post_message":"This entitled woman just demanded a free drink... Because of slavery? This is absolutely ridiculous. We owe her nothing. Should she be compensated for slavery?"},{"comment_id":"10153202664107217","commenter_b":"Pmsl yes, parallel parking to the extreme","commenter_a":"@username u do this with jim?","post_message":"Now that's a nifty bit of parking 🚙 @webpagelink Footage: Guinness World Records"}]
