[{"comment_id":"10154132687525579","commenter_b":"I SWEAR, THE MEN IN THIS COUNTRY ARE SUCH PANSIES NOWADAYS.","commenter_a":"No matter the numbers, you won, Bernie! America will not be the same because of your tenacity, integrity, and values! Thank you!!! We'll keep fighting. #NotMeUs If you like this comment, please contribute to Sanders's campaign at the below-posted link. @webpagelink","post_message":"Bernie Sanders: \"Tonight, while the results are still not known, it looks like we are in a virtual tie.\" Full video here: @webpagelink #IAcaucus #IowaToday"},{"comment_id":"10153376364371770","commenter_b":"These leftist thugs should go get jobs!","commenter_a":"Look at them. You can tell they are all scholars, have jobs, homes, and a lovely life. LOL.","post_message":"Protesters disrupted several of Donald J. Trump's events over the weekend."},{"comment_id":"10153074240773067","commenter_b":"Lol no, A stockholder though, and everything that i put on here were statements from Ford in response to Donald Trump.. Just summarized","commenter_a":"Trump had nothing to do with this. This was because Ford, and the UAW were able to work an agreement, Ford is committed to keeping and creating jobs in the U.S. They have created 25,000 new jobs in the U.S. In the past four years. Over 80% of their manufacturing is done in the U.S. And 97% of their engineering is in the U.S. As they stated. No i dont like seeing jobs being outsourced, but Trumps statement had no effect on the outcome of this. Im happy for all the people who kept their jobs. Ford is a great company! And will do what they can to keep bringing new jobs to the U.S.","post_message":"This comes after Ford Motor Company came under fire for creating thousands of jobs in Mexico. @webpagelink"},{"comment_id":"1213918441976908","commenter_b":"She should step down, even if she did win, God forbid , she won't make the first half year..","commenter_a":"Ken put the straw down","post_message":"She's dying!"},{"comment_id":"1076190982460519","commenter_b":"She has never been distinguished! She has always been a fraud and an embarrassment to our country!","commenter_a":"Stop muddying the waters, Democrats. SMH","post_message":"FBI  Federal Bureau of Investigation Director James Comey testifies on Hillary Clinton Email Investigation before House Oversight Committee. Complete video here: @webpagelink"},{"comment_id":"10156113177590725","commenter_b":"@username What was your last name @username again? we really need the wall!","commenter_a":"Like you always say China is eating our lunch.","post_message":"Depression- be careful of China!"},{"comment_id":"936584933056721","commenter_b":"Well bye bye you illegal immigrant because your ancestors aren't from here .","commenter_a":"Black life's matter movement is a threat to law enforcement! The Obama administration is a threat to law enforcement! Islam is a threat to law enforcement! Illegal immigration is a threat to law enforcement!...... This man is not!","post_message":"In a video he apparently posted last week on Facebook, Jon Ritzheimer calls out New York-based The Islamic Post for calling him the \"American Taliban.\" Now the FBI has issued an alert, citing he is a  threat to law enforcement."}]
