[{"comment_id":"1563946600332130","commenter_b":"she says she all for kids but she can not hide the truth","commenter_a":"If a woman walks around spewing F!#K the way she does you damn sure don't want her to be president, hell I don't even want her as a friend","post_message":"This is the REAL Hillary Clinton, folks!"},{"comment_id":"10154883066819411","commenter_b":"They don't care about children being blown to bits as long as they can let trans use women's toilets and have gay marriage","commenter_a":"They are so fukn stupid. Clinton will plunge this world into war and then run for the nearest bunker.","post_message":""},{"comment_id":"699812546852263","commenter_b":"Perhaps she's had enough of grabbing pussy","commenter_a":"As far as I'm concerned the whole family can go straight to hell.","post_message":"Donald Trump said his wife and youngest son would move \"very soon. After he’s finished with school.\""},{"comment_id":"10153046800841717","commenter_b":"Thats one stupid bitch.","commenter_a":"Ok, now it should be the electric chair! This woman is a menace to society and to the rule of democratic law. What a pity she is incapable of learning new skills like other related species! Lol...next she wll have her own TV show!","post_message":""},{"comment_id":"10153031617927217","commenter_b":"Nope, women can't","commenter_a":"Can they pee standing up?","post_message":"While the two women will graduate this week, they will not serve in the US Army's 75th Ranger Regiment. The US military has yet to lift a ban on women serving in the fighting force."},{"comment_id":"949410461745800","commenter_b":"well said Bonnie","commenter_a":"I am from Middle East and full face cover has nothing to do with Islam, it is clearly oppression of woman. Disgusting. Those who say this is freedom of choice or religion should also be sympathetic to Nazi insignia or brutality","post_message":"What do you think?"},{"comment_id":"1746288005610861","commenter_b":"Women do not get kicked out of restaurants because their children cry. What world do you live in ?","commenter_a":"Whatever. If that kid was crying in the middle of some restaurant & the owner told the mother to leave for the sake of the rest of the patrons he'd be applauded. Taking a baby to a political rally is as foolish as taking a baby to a Slayer concert. The exception being Slayer fans are far more courteous than the average politcal junky.","post_message":"\"I think she really believed me that I love having a baby crying while I'm speaking. People don't understand.\""}]
