[{"comment_id":"10153121325909411","commenter_b":"in ur ass","commenter_a":"White Americans are terrorists trained by CIA to kill people","post_message":"'We are concerned that attacks against the Muslim community are taking place in a heightened climate of Islamophobia and hatred.' - Sabby Dhalu, an organizer for Stand up to Racism."},{"comment_id":"1159562730832064","commenter_b":"@username what refugees ! Go back to Jordan !","commenter_a":"Haha.... What about millions of refugees whose right to return is banned by Israel? But o o no emotions for Palestinians? Why?","post_message":"Group travelers told to cancel reservation at lodging in Bavaria because they are Israeli."},{"comment_id":"10156475967855231","commenter_b":"@username That's nothing to brag about or feel proud of. Just makes you a parental fail.","commenter_a":"Art is seems to be tge type of jerk who would disown his gay child. Especially, a male child.","post_message":"He apologized, but let's be for real: does he really mean it?"},{"comment_id":"1703284416593951","commenter_b":"Cruz pussy fake!","commenter_a":"Not true and you know it.","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"},{"comment_id":"10157096096500725","commenter_b":"Trump and his supporters can go ahead and choke on a Nigerian cock","commenter_a":"Yet another reason Billy Joel sucks....he's supporting DollHands Donny!","post_message":"Thank you Billy Joel- many friends just told me you gave a very kind shoutout at MSG. Appreciate it- love your music!"},{"comment_id":"10153894921947217","commenter_b":"French problem they let them in","commenter_a":"Why you guys can't reports on the Massacre that taking place in Congo Beni region in Thr DRc","post_message":"The BBC's Richard Galpin was with protesters in Calais. Truckers, shop owners, farmers and police are blocking the motorway to the port and channel tunnel demanding the government find a solution to the problems caused by the migrant camp nearby. #FacebookLive"},{"comment_id":"1065627820160413","commenter_b":"I like Hillary because she will help the illegals... Republicans are against illegals claiming 20-30 kids on their tax refunds from other countries, it's on you tube tax refunds for illegals...","commenter_a":"I am voting for @username it is time for woman to take charge. She will accomplish the Mission.....","post_message":"\"To Democrats around the country...I urge you to raise your own voices this year by voting for the person who shares your values and who will fight tirelessly for you and your family. I know, for me, that candidate is Hillary Clinton.\" —Senator Kirsten Gillibrand"}]
