[{"comment_id":"10154853515096336","commenter_b":"Go away troll! You don't even live in our country","commenter_a":"I bet a million dollars kellyanne conway gave her soul away for for a few bucks and a pussy grab","post_message":" it up, Kellyanne Conway said to Jill Stein. your friends at the Clinton campaign said it won change the results. Conway suggests that the outrage over the call shows many Americans' unwillingness to accept Donald J. Trump as their president and to give him a chance, which includes Green Party presidential nominee Jill Stein three-state, vote-recount effort. Do you agree? @webpagelink"},{"comment_id":"10153925535020579","commenter_b":"Oh, he is VERY Republican. Hardly just in \"name only.\"","commenter_a":"another worthless rino.","post_message":"Clip from Speaker Paul Ryan's address to Congress. Watch full speech here: @webpagelink"},{"comment_id":"10154455210992577","commenter_b":"Mite as well. Hillary going to rig it so why not lol","commenter_a":"If the biggest criminal in the world doesn't want all that competition from Hillary who can blame him?","post_message":""},{"comment_id":"10153244744761378","commenter_b":"Stfu","commenter_a":"Stop chasing people in residential communities!","post_message":"DEVELOPING: Police tell Action News officers were chasing a sedan when the driver lost control, hitting several parked cars, trapping one person in the wreckage. It began before 7:00 this morning in Glenolden, Delaware County. @webpagelink"},{"comment_id":"10154903561816320","commenter_b":"maybe you can volunteer to carry luggage to plane and save Us some money sore loser","commenter_a":"Let me guess, he'll insist on using his TRUMP Air instead then charge back the cost to the US government (i.e. taxpayers...). Maybe he can make his daughter Tiffany head flight attendant and get her salaried too","post_message":"BREAKING: President-elect Donald J. Trump says he wants Boeing Company to cancel the order on a new 747 Air Force One for future presidents. At more than $4 Billion, Trump says it's \"ridiculous\" and he \"wants Boeing to make money, but not that much money.\" (AP photo) MORE: @webpagelink"},{"comment_id":"1583049088381782","commenter_b":"@username crazy women beat their selves up.","commenter_a":"Before this is over, the \"two women\" will be just ONE MAN, and the \"abduction\" will likely turn into an \"affair\". The reason why she is saying it was women, is so that there's no suspicion of rape. = Less of an investigation.","post_message":"Authorities are searching for two women suspected in the abduction of a California mother. via NBC Bay Area"},{"comment_id":"10152691933545950","commenter_b":"You look like a crooked bitch","commenter_a":"Yeah and what they are going to do give him the death penalty.....dam sure won't let him walk like they do those crooked a** cops","post_message":"A suspect has been arrested in the shooting of two police officers in Ferguson, Mo."}]
