[{"comment_id":"10153706783614218","commenter_b":"Go suck you mother","commenter_a":"Judge Barry williams came to his decision based on fear of rioting and unrest...thats not how the justice system is supposed to work you cant be bullied by a bunch of idiots in the streets chanting lies","post_message":"#BREAKING #FreddieGray Judge denies motion to dismiss charges against 6 police officers in death of Freddie Gray. He also denied a motion for State's Attorney Marilyn Mosby to recuse herself. Follow live updates: @webpagelink READ more here: @webpagelink"},{"comment_id":"10153055382512061","commenter_b":"That woman. Was disgusting","commenter_a":"I'm sure there must of been a 'medical' term for the reasoning....","post_message":"\"I asked him why I couldn't do it and he said, you're black.'\" Black delivery driver replaced after customer wanted whites only: @webpagelink"},{"comment_id":"535892949940559","commenter_b":"Courtney Stark can we do this with apple juice? Cara Jean Stark you can do it with Busch light","commenter_a":"Oh Stephen Conley","post_message":"BRILLIANT."},{"comment_id":"10155894213345354","commenter_b":"Hillary is a cunt!","commenter_a":"Killary is the epitome of all the ills of this world rolled into 1 savage stinking carcass.","post_message":"Short memory!"},{"comment_id":"853169931483995","commenter_b":"The article isnt dissing Melania, it's reflecting on a direct quote where Trump said giving Ivanna control of a business property was the end of his marriage, and he learned he didn't want a wife who was ambitious, who worked, because that meant she didn't focus 100% on him. Which is sexist af. But he wants his daughter to be an Ivanna, so ... also hypocritical. Should women be successful in business or not, according to Trump? Are successful woman attractive to men like Trump. Read the article, it's not made up.","commenter_a":"Such an interesting article Christine Johnson!!! I find it all fascinating, will be so interesting to be around in Nov - when the country decides! Hope to see u tomorrow? Ax","post_message":"The Trump family embodies a very old sexist hypocrisy: men who want one thing for their wives and another for their children. Read in The New York Times Opinion Section."},{"comment_id":"464688210388426","commenter_b":"Well yeah, I too would rather YOU be MORBIDLY OBESE and therefore die early........mental midgets like you guys just should NOT reproduce !","commenter_a":"Different if had medical problems, just being lazy isn't one","post_message":"Should This Family Be Taken Off Welfare? Comment 'yes' or 'no'."},{"comment_id":"10154660100050575","commenter_b":"Is she one of those nasty girls with nasty feet","commenter_a":"Funny how Americans don't like crooks","post_message":"Oh, my!!"}]
