[{"comment_id":"1062159727157832","commenter_b":"If that were to happen then only the criminals will have guns.","commenter_a":"Aaw Fuck, here we go. Egotistical morons doing 'research' and thinks their Right. Others just making shit up, then there's the name caller who judges everyone else..No One has a Fuckin Solution?! Then don't write Anything","post_message":"Karl Rove had a unique idea during a Fox News interview: The only way to stop people like Dylann Roof is to completely repeal the Second Amendment."},{"comment_id":"1420716084688108","commenter_b":"Lol who said I support the wall..guck the wall just spend more deporting illegals... end of story","commenter_a":"Warren is a liberal piece of fucking shit!!!","post_message":"Republicans did NOT want you to hear this letter. Pass it on!"},{"comment_id":"10153553698421323","commenter_b":"I'd rather be surrounded by happy refugees , than miserable right wing morons.","commenter_a":"Have you seen most of these refugees? Not the kind of people you want living near you. They've already turned many areas into hellholes for the residents.","post_message":"'Anyone who tells me Germany is full up, or that we can’t afford them, I say think of our past, and of the future. Of course we can afford them – we’re a rich country, and we have a duty to help those in need.”  The German mayor desperate to welcome immigrants to his town."},{"comment_id":"10153142130722235","commenter_b":"Girl/women also have far more uti's then intact men do.. In case you weren't aware.","commenter_a":"It's way cleaner. As a mom of an ADHD child that took several years to potty train and several more to learn to wipe correctly, I don't regret following my Drs & husband's advice.","post_message":"The main reason we have circumcision in the US today is not for the health benefits.   It’s because we’re used to it."},{"comment_id":"10152536717736680","commenter_b":"Stop marriages of terrorists n force","commenter_a":"Speaking out against, or killing? Those are two very different things.","post_message":"From POLITICO Magazine: Police risk their lives in service. Does that mean we shouldn’t speak out against them?"},{"comment_id":"802131019879954","commenter_b":"Boom!!!!!........... bitches.......","commenter_a":"Karma's a bitch, Isn't she, John?","post_message":"Nice try, Johnny, but the American people are smarter than that.  Read more: @webpagelink Image by Occupy Democrats."},{"comment_id":"10154201387086037","commenter_b":"How many people did Jesus kill? How many sex slaves did Jesus have?","commenter_a":"In the Quran Mohammed said to 'cut off their heads'. That's the Islamic role model. Just be glad that role models Jesus and Gautam Budhha didn't say the same about 'infidels'. There would be even more chaos...","post_message":"'He was brainwashed but we do not know by whom, when or where,' said a family friend."}]
