[{"comment_id":"10153775640411178","commenter_b":"Bully!","commenter_a":"\"In the first place, we should insist that if the immigrant who comes here in good faith becomes an American and assimilates himself to us, he shall be treated on an exact equality with everyone else, for it is an outrage to discriminate against any such man because of creed, or birthplace, or origin. But this is predicated upon the person's becoming in every facet an American, and nothing but an American...There can be no divided allegiance here. Any man who says he is an American, but something else also, isn't an American at all. We have room for but one flag, the American flag... We have room for but one language here, and that is the English language... and we have room for but one sole loyalty and that is a loyalty to the American people.\" Theodore Roosevelt 1907","post_message":"Ben Carson makes a bold statement."},{"comment_id":"10152521923501135","commenter_b":"The automakers would like to sell you a new vehicle sooner rather than later.","commenter_a":"Jennifer A. Thompson","post_message":"Do you really need to idle your car on days like today? We separate the facts from the myth. WHAT WE FOUND: @webpagelink"},{"comment_id":"1754857141240693","commenter_b":"@username The trash should be put down !","commenter_a":"They saying there's no tv the food crap and can't go to the gym well you shouldn't do the crime","post_message":"Britain's third biggest prison is in the midst of a riot."},{"comment_id":"10153622833731519","commenter_b":"She says what her market wants to hear. She, and all the ilk like her, are just media whores who spout filthy hate and get PAID big bucks for it.","commenter_a":"At least she didn't say that we need to keep the tradition of having only presidents on our currency.","post_message":"Greta Van Susteren nearly gave herself a rage stroke last night..."},{"comment_id":"10158187868175203","commenter_b":"Boo hoo bitch","commenter_a":"The Dems aren't going to stop. They're working their agenda to undermine our Constitutional Republic, the rule of law, and our civil society: @webpagelink","post_message":"Trump defends his travel ban."},{"comment_id":"1030546040397732","commenter_b":"Lock her up","commenter_a":"Can't do it fast enough! Lock her up!!!","post_message":""},{"comment_id":"864266033622421","commenter_b":"Guaranteed Chris Matthews is paid off. GUARANTEE IT!!!!!!","commenter_a":"Oh boy...Jorge","post_message":"Watch the DNC chair squirm when asked about the difference between Democrats and socialists: @webpagelink"}]
