[{"comment_id":"1122827437738266","commenter_b":"Go home Elsa, you're drunk....","commenter_a":"the cold never bothered us anyways... amirighyt?","post_message":""},{"comment_id":"1673051799421609","commenter_b":"WOW SHE'S AS DELUSIONAL AS HER WACO HUSBAND!","commenter_a":"she is nasty","post_message":"While speaking to a crowd recently, Michelle Obama suggested men viewed her as a sex symbol. She didn't anticipate the response. The video speaks for itself."},{"comment_id":"1115311211854904","commenter_b":"We don't need more people coming here from anywhere. Immigration is to benefit the country not the immigrant. We gain nothing by allowing more here when we can take care of our own","commenter_a":"North Carolina here voting TRUMP 2016","post_message":"\"I'm the only one that speaks my mind and tells the truth and everybody knows I'm right.\"  Today on \"MediaBuzz,\" Donald J. Trump discussed his proposed temporary Muslim ban. @webpagelink"},{"comment_id":"10154413967139087","commenter_b":"The British started this mess, no one including the US wanted this \" trash of Europe so they found a desert to dump them in, let get along or die, who cares, why do we have to pay for these spoiled perpetual \" victims \"","commenter_a":"Israel will never be at peace, if they don't work for it. Sorry about the comparison but that sounds like something Hitler would do, obliterating a group of people to put your own. Have you ever heard about Divine intervention? God doesn't like when you prosecute His children.","post_message":"#BREAKING: The Israeli government says it plans to move forward with the construction of thousands of settlements in East Jerusalem despite a U.N. Security Council resolution demanding an end to settlements in the occupied territories."},{"comment_id":"10153470149826234","commenter_b":"By a lot !!","commenter_a":"Amy check out HR. Looks like you got low balled","post_message":"Nice work, if you can get it."},{"comment_id":"10153802961004411","commenter_b":"@username And your women","commenter_a":"Mean while Modi is busy in saving cows.","post_message":"BREAKING:"},{"comment_id":"10154217299006350","commenter_b":"Praying for yall","commenter_a":"This is my daughter dressed for the winter formal, I am proud of who she is inside and out. She loves school, sports, and her church. I don't care who she decides to love or what she wears as long as she does it with all her heart and as long as she knows me and Jesus love her.","post_message":"\"I think God accepts me for me.\""}]
