[{"comment_id":"10153141451562894","commenter_b":"She a dub","commenter_a":"@username 😕","post_message":"Kylie Jenner literally just went from 100 to 0"},{"comment_id":"10153277341923188","commenter_b":"I do believe the \"offended\" have been organized by an outsider to bombard anyone helping to stabilize the area. It is not Whole Foods, The National Guard or the Police who need scrutinized! It's the Promoters who keep unrest in the media way beyond the time it is newsworthy! Always seems to be when there is a \"Political\" issue, Ferguson-illegal aliens, Baltimore- Clinton Foundation and the very questionable donations. Of course the nuke treaty with Iran, etc.! Protesters in both cities started out fairly calm. Then hordes of people started pouring out of the woodwork, looting, burning, destroying, many were not even from that area! How did they get organized so quick? I agree that All Lives Matter in every community. I also believe a huge % of our Police Departments are doing what they have to do with the Thugs who lack any respect for our laws! Rap sheets ...","commenter_a":"So sad they were doing the right thing.","post_message":""},{"comment_id":"10155198682596002","commenter_b":"Sad now she is looking like a joke.","commenter_a":"I still remember Hillary as 1st lady saying stand by your man.","post_message":"What do you think of her statements?"},{"comment_id":"10153469659427042","commenter_b":"She's getting a life now getting away from that abrasive idiot.....stop with the marriage BS married or not no woman should be abused","commenter_a":"It means there not married right!! Now they have a child with no Dad , that's why Hashem laws say first we get married than have children . Are actions will let us all see our Rebbe King Moshich . She should get a life. Yechi Hamelech","post_message":"\"I have the courage to actually do something about it this time.\""},{"comment_id":"10157212234715389","commenter_b":"They left them to die!!!! They were tortured before they killed them.... What kind of sick people lets this happen with the best armed forces in the world!!! These people need to go to jail!!!!! They did it on purpose!!!!! Sick !!! For heavens sake place these people in jail!!!!","commenter_a":"#nofaithintheGOP. Yeah, we know.. So you wrote a paper about it. What do you want? A diploma...Go arrest them. #theyarepartoftheproblem.","post_message":""},{"comment_id":"10154392449762235","commenter_b":"Having a \"break down \"?","commenter_a":"Suicide by cop! The young man didn't comply from the beginning. The young man also shouted \"I hate my life\". It's a shame but you have to comply with the law. It is sad though. \"JUST DO WHAT THE COPS SAY\"!","post_message":"Dylan Noble’s mother has filed a wrongful-death claim against the police department."},{"comment_id":"10152774435682144","commenter_b":"Misogyny FTW !!!","commenter_a":"Suck my pussy hag","post_message":"Another indication the Supreme Court is likely to rule in favor of gay marriage this June, when justices will hear a monumental case deciding if the Constitution provides the right for same-sex marriages."}]
