[{"comment_id":"939244866171766","commenter_b":"The woman who jumped the young lady works as a loan officer for Bank of America. I guess she still has a job . Tyler thanks , it appears that in many of the comments throughout this post only one race was involved in \" trespassing\".","commenter_a":"Pool passes!!!!! I saw another comment somewhere else from an actual member at the pool. This was a members (HOA) only pool where there WAS several BLACK members and was present at the time. There was a private pool party going on where the DJ that was hired sent out a tweet about was he was doing. The pool was swarmed by kids from another neighborhood with no pass and uninvited. Which is technically \"trespassing\". They was asked to leave and started a fight in which the cops was called. The police had made several requests to leave with no luck. This girl ( if you watch the full video) was asked to leave several times and told the officer \" F-YOU\" and that's when the officer grabbed her. First off she and the rest was trespassing and second refused to leave when asked. @webpagelink","post_message":"A young woman who attended the McKinney pool party gives her explanation for \"how it all began.\" Watch the full interview here: @webpagelink"},{"comment_id":"10153710881709726","commenter_b":"yeah she needs to go to jail....","commenter_a":"Gowdy why worry Hilary broke a lot of laws and she's just scum period someone has to put her ass in jail","post_message":"WATCH: Benghazi Probe has ‘Nothing To Do’ with Clinton"},{"comment_id":"934248849943870","commenter_b":"American's just as guilty for ALLOWING these Satanic PIGS to roam our country and have their way! THIS----IS---OUR---COUNTRY!!! NOT the POA - NOT Islams!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"These MUSLIMS think they can come to this Country and do what they want, NO if you don't like it go back rape you women and kill but not in AMERICA!","post_message":"Must Watch!"},{"comment_id":"10153709575791378","commenter_b":"@username Good call momma!","commenter_a":"They need to ban children from beaches and parks, too many dirty diapers and clothes left behind by irresponsible parents.","post_message":"JUST IN: New Jersey lawmakers have approved a ban on smoking on public beaches and parks, sending the measure to Governor Chris Christie's desk. 6abc.com/@username"},{"comment_id":"1755262658020828","commenter_b":"@username, good thing you have a vagina, or your head would be fair game. STFU","commenter_a":"Would anyone want him to be their pilot knowing how little he cares for a human? I wouldn't.","post_message":"It seems that words do have consequences after all."},{"comment_id":"10153014667776955","commenter_b":"I lived in NY, not the first blizzard or the last...whats different now is the libtards have forced energy production to stagnate or decline while the population increased - aka people are going to freeze to death in their own homes. This is just nature being nature. Lets not make something out of nothing.","commenter_a":"Good place for it.","post_message":"BLIZZARD WATCH NYC, BOSTON HISTORIC"},{"comment_id":"10153609424211130","commenter_b":"Does she have penis yet?","commenter_a":"No one likes the murdering bitch... she is no friend of the LGBT and most us want her to go away.","post_message":"Caitlyn Jenner has a clever idea for how to beat Ricky Gervais at his own game."}]
