[{"comment_id":"10153510448341130","commenter_b":"Because they turn away NO ONE. Because it cost a lot of money to give out free care. Or low income women can pay a small portion vs. going to a CLINIC where they want your soul before you get care. Many women are struggling to EAT. How long do you think they could do all that they do with out funds ?????????Gimme a break.","commenter_a":"Tell us something why a big corporation such as planned parenthood need my money?","post_message":"A big victory for Planned Parenthood."},{"comment_id":"1239208946099133","commenter_b":"Both moms need to get sterilized","commenter_a":"First it said she wasn't charged then it said she was charged with manslaughter and she has been released on 15,000 dollar bond. They should take all her children away from her. These children are her responsibility not the 8 yr old boy. If she would rather be in a bar then put her behind them for the rest of her life.","post_message":"A boy is being charged with beating a 1-year-old girl to death while they were left home alone as their mothers went to a nightclub, police said"},{"comment_id":"10154566492298812","commenter_b":"'@username you keep drinking the kool-aid","commenter_a":"If you can't emotionally tolerate a black man reaching for his ID and you pee your pants like a 9 year old girl scout, and you shoot him without ever seeing a gun, it's time for you to take off the police uniform and get a job where you will not be harmful to human beings and to society.","post_message":"Pres. Barack Obama: Attacking police officers, even rhetorically, does 'disservice to the cause' of criminal justice reform. @webpagelink"},{"comment_id":"10155618780610093","commenter_b":"Go stick your head back in the ground Anne...clearly you have failed to realize that unless ISIS is wiped out..they will not stop...period. And yes they want to strike us here. You want that? You rather they come here on our turf? Lady you better do a gut check and wake the hell up.","commenter_a":"Sorry but we should NOT have boots on the ground in Syria.","post_message":"'It involved hand-to-hand combat, the jihadists tried to use women and children as human shields, and about a dozen jihadists were killed.'"},{"comment_id":"10153259374526350","commenter_b":"I just got off s cruise ship..I go on a cruise every year..The amount of people in and out of the water of those pools and all the adult drunks. Scares the hell out of me..I have a 7 year old granddaughter and she can swim..but it only takes 2 seconds for a drunk to jump on her w/o supervision. .Thank god my daughter watchers her like a hawk! THEY ONLY CARE ABOUT $$$ ITS TIME FOR LIFEGUARDS AND WATCH YOUR CHILD AS WELL!!!! And all Disney hotels have LIFEGUARDS! I live near them and we take our granddaughter Isabella to one every year for her Birthday!","commenter_a":"It is really no different than at a hotel. You don't have lifeguards at a hotel pool. There are signs posted that no lifeguards are on duty and parents need to watch their kids.","post_message":"There are as many as 1,000 employees aboard large cruise ships, but three major cruise lines employ no lifeguards on their ships. Why not?"},{"comment_id":"10153141650912093","commenter_b":"Look it up chick","commenter_a":"3200 people died in car accidents today in the US, everyday","post_message":"A man is in a coma after an electronic cigarette exploded in his face... @webpagelink"},{"comment_id":"1775783539370851","commenter_b":"Idiots arrest them all","commenter_a":"White lives matter more!","post_message":"WATCH LIVE:  Protesters have gathered in downtown Atlanta. We have several Channel 2 Action News reporters with a group that is marching near the King Center and we'll have live coverage starting at 11."}]
