[{"comment_id":"10152777493386130","commenter_b":"Ya. Clearly, women want nothing more than to \"trap\" some real prize catches around here. Give me a break.","commenter_a":"this is great. Now men are less likely to be victims of the tramps who lie about birth control and crazy GFs who try to lock their men in.","post_message":"We're looking at you, gentlemen."},{"comment_id":"1330647500288610","commenter_b":"Killers should be punished .","commenter_a":"evil","post_message":"The U.S. Fish and Wildlife Service said Thursday that necropsies had ruled out diseases as a cause of the eagles' deaths."},{"comment_id":"1014609198628438","commenter_b":"She s the normal one!","commenter_a":"Oh I think this woman should be arrested and taken into custody as she is obviously a sociopath with a gun!!","post_message":""},{"comment_id":"499497803543925","commenter_b":"That shady bitch, I would never go to her freaking dinner!","commenter_a":"Thank You patty for doing the right thing .","post_message":"Patti LaBelle Finally Admits James Wright Chanel’s Video Increased Pie Sales, Invites Him to Thanksgiving Dinner [Video]"},{"comment_id":"943135932412822","commenter_b":"Shake those lady lumps","commenter_a":"Hump on a Hump!!!","post_message":"He denounces the idea of marital rape as 'made up by European people'"},{"comment_id":"1182540631781356","commenter_b":"ISLAM'S WHORE","commenter_a":"One Can Only Hope!","post_message":"FINALLY!"},{"comment_id":"10152876050286680","commenter_b":"@username is a RACIST!","commenter_a":"It's amazing how anyone like the ultimate pre-millennial distributionist, Neocon, evangelical, can spout his bilge and people think he's accomplished something. If Cruz is the best this nation can do, we are done. We don't need pontificating, and pandering to Christian values. We need leadership, a complete change in course to get our government working for the people again. I don't see it happening. Cruz belongs at a shatuaqwa tent, not the Oval Office. He cost us 24 billion in a phony shut down, could care less about health care for the middle class or poor, voted against Veterans benefits increases and VA spending. He's a charlatan, and the Elmer Gantry of the GOP.","post_message":"Ted Cruz killed it at the conference of social conservatives. And Marco Rubio fell flat."}]
