[{"comment_id":"10153745742861051","commenter_b":"GO HILLARY 1ST WOMEN PRESIDENT!","commenter_a":"Yes as long as it isn't clinton I don't really care as long as they are a good president and loves this country and the people who are citizens. She is only out for herself and wouldmake a horrible president she is to crooked .","post_message":"Trump has no problem with the idea of having a female president in America -- as long as it isn't Hillary Clinton. Do you feel the same way?"},{"comment_id":"10153903407251336","commenter_b":"Her teeth are still loose she can't knaw on a steak... Cheap date. (y)","commenter_a":"She could have easily ducked her commitment, all things considered, but didn't. I gained more respect for Ronda over this classy gesture in the face of her recent defeat and widespread public mockery, than any of her knockout wins. Much love to her and our Armed Forces.","post_message":"UFC superstar Ronda Rousey kept her promise and accompanied U.S. Marine Lance Cpl. Jarrod Haschert to his Marine Corps Ball in South Carolina on Friday."},{"comment_id":"485272544994977","commenter_b":"I'm so sick of her","commenter_a":"So says the compulsive liar.","post_message":"The video shows Hillary Clinton snapping at an activist and calling out the Bernie Sanders' campaign for lying."},{"comment_id":"642882945885651","commenter_b":"Not really. Go read history..that's a facade...","commenter_a":"LOVE the Bush family! So presidential, respectful, and patriotic. Something I've missed for the last 8 years and the coming 4 years.","post_message":"President Obama, President George W. Bush, First Lady Michelle Obama, former First Lady Laura W. Bush, and others speak at the opening ceremony of the Smithsonian National Museum of African American History and Culture."},{"comment_id":"10153203713812894","commenter_b":"She's a damn lie! Ain't nobody stupid! That's what's wrong with her lying ass all them babies and surgeries!","commenter_a":"What did she do to her face? She looks weird","post_message":"Kim Zolciak Reveals Doctors Discovered a Hole in Her Heart While She Was Hospitalized After Her Stroke"},{"comment_id":"1186141524764191","commenter_b":"That is right they would have convicted her already .","commenter_a":"IF there was anything to charge Hillary Clinton for related to Benghazi or her emails, (or anything else Fox Entertainment lies about) then wouldn't you think, after a decade of trying to convict her of something, the Republicans would have done it by now. There is NO basis to convict her of any wrong doing. The Republicans have lied about her for years and I'm sure they will continue. In the meantime I won't vote for anyone as repulsive as Donald Trump. He will, in my opinion, destroy this Country and our reputation around the World.","post_message":"How does this make ANY sense? From CNN: \"Donald Trump may say he's concerned about the little guy, but his tax plan would give the wealthy far bigger breaks than the middle class or working Americans. The Top 1% would see a whopping $275,250 reduction in their federal tax bill, or 17.5% of their after-tax income.\""},{"comment_id":"1219104934776201","commenter_b":"And this is what this gremlin boils down to!","commenter_a":"This old man ain't going nowhere. Pump up the Trump.","post_message":"The conventional wisdom of the Democratic race holds that Vermont senator is the principled liberal challenging Hillary Clinton. But Bernie Sanders has moved too."}]
