[{"comment_id":"1171676779558735","commenter_b":"What couples?Floyd has a harem of women like this in Vegas!!","commenter_a":"these celebrity couples are getting ridiculous.........i can understand the attraction to cash but at least try to hide it...","post_message":"Floyd Mayweather is dating a 19-year-old New Look sales assistant from the West Midlands."},{"comment_id":"10154165530049087","commenter_b":"Ironic. Very. Seeing as his white queen did the exact thing he's bitching about","commenter_a":"Who gives a SHIT? I certainly don't care about Podesta's emails...not from before, during or after....fuck Wikileaks. Here's a thought, Mr. Assange, perhaps if you surrendered to the British Authorities for violating the terms of your bail, returned to Sweden to face the rape charge against you and STOPPED being a puppet for Russian Intelligence, maybe I'd take you seriously? The fact remains you broke the law and you lose all moral high ground when you want others punished but not yourself.","post_message":"BREAKING NEWS"},{"comment_id":"653257648132607","commenter_b":"I agree. Fuck Kim Kardashian! She is trash.","commenter_a":"So a woman who's apparently famous for releasing a sex tape of her getting pissed on gets robbed of 10 million dollars worth of jewellery. Who the Fuck cares.?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153219885266636","commenter_b":"Vicki Horn Bet she'll complain if her wages go down. But thats not her problem until its her problem.","commenter_a":"Don't really think the 'how quickly would we get free tampons if everyone stopped wearing them?' Is a very appropriate question. If you want to walk round with blood all over your trousers knock yourself out - think it's you that would look abit mental but it won't affect the government","post_message":"'How quickly would we get free tampons if everyone stopped wearing them?'"},{"comment_id":"10153595852746336","commenter_b":"Which one is the women??","commenter_a":"Girl power!!!!","post_message":"26-year-old Capt. Kristen Griest and 25-year-old 1st Lt. Shaye Haver will become the first women to wear the U.S. Army's coveted Ranger tab when they graduate alongside 94 male soldiers Friday at Fort Benning."},{"comment_id":"10152540826575047","commenter_b":"Sign me up, no they should NOT be allowed back in the US, they're a security risk!","commenter_a":"Go fight with the enemy, you be become the enemy. No tollerance for deserters of the American Constitution. You are for America, or you are against America. No gray area here. Don't let these deserters back in. They leave, they stay gone forever!!!","post_message":"American citizens must not be allowed to fight alongside jihadists, only to then return to the U.S. to spread jihad here.   Sign & Share our petition to protect our homeland:  @webpagelink"},{"comment_id":"10153555053111037","commenter_b":"I bet you any money she can't breathe anymore","commenter_a":"When will people learn the cops will not lose!! I don't care what color u r, she said ' I'm gonna see u in court '! She baited him. Why would cops kill her in jail? It's another cry baby black!","post_message":"Newly released dash cam footage shows the events that led to Sandra Bland’s arrest."}]
