[{"comment_id":"1383240758404704","commenter_b":"Yes they are and the ones that are stirring the pot should should lick the spoon amen","commenter_a":"So let me get this straight.... talking about pussy a decade ago makes you a sexist and bad person; however, talking about and encouraging the killing of cops is justified??? Did I miss something? All these people are a bunch of hypocrites! Saying they want peace and justice when they are the ones continuously stirring the pot and causing an even bigger racial divide!","post_message":"It's people like Sharpton that continue Obama's racial divide in this country. This is absolutely disgusting! Let's expose Sharpton for the race baiting fraud he truly is by sharing this post 2,000 times."},{"comment_id":"10153239404845329","commenter_b":"If a women wants to hate on men and bring them down, she is not a feminist no matter how much she claims to be. Feminists just want complete gender equality!","commenter_a":"I'm pretty sure that most men aren't like \"rape is so cool bruh, I'm going raping this weekend bruh, you coming?\" Stop lol And not all men get all \"EEEEEKKK\" about periods. Personally, I can listen to my female friends talk about it and not even get slightly sick.","post_message":"\"Imagine if men were as disgusted with rape as they are with periods.\""},{"comment_id":"10153342473651336","commenter_b":"The girl was mouthing off and ignoring him when he said get the hell away, if that was my daughter I'd slap the taste out her mouth, she wouldn't even have to worry about the cop.","commenter_a":"These cops are constantly thrown into situations where there are multiple combative people and ONE officer. Was he in the right or wrong? I don't know, but cops are constantly put in these dangerous positions as a part of their job.","post_message":"The video appears to show the officer using his knees to pin the girl face down, pointing his gun at other teens and cursing."},{"comment_id":"10152874752876336","commenter_b":"Don't let her have kids exterminate this animal.","commenter_a":"Shoot on sight!","post_message":"Manhunt underway: Police are searching for Hayat Boumeddiene, a suspect in Thursday's murder of a French police officer. Tune in to Fox News Channel for special coverage now."},{"comment_id":"10152739817385047","commenter_b":"Signed! Stop abortions!!!!!","commenter_a":"Lord I pray that Congress will do the right thing here & save these babies. In Jesus' name I pray amen","post_message":"Late-term abortion is being put to a vote this Wednesday in Congress—potentially putting a stop to abortion at and after 20-weeks gestation. Sign & Share this critical petition to tell Congress to defend life: @webpagelink"},{"comment_id":"1020710211322060","commenter_b":"Alexcea Erini Apostolakis bod","commenter_a":"I think the poor girl should be left alone","post_message":"The birthday festivities never end for Kylie Jenner (via Daily Mail Celebrity)"},{"comment_id":"10153369363747061","commenter_b":"Should make the short fat squatty ones! Nor everyone has a 12 inch waistline.","commenter_a":"Hello, Are you interested in the world of FAME?? Getting rich. powerful and famous? JOINING THE ILLUMINATI BRINGS YOU INTO THE LIMELIGHT OF THE WORLD IN WHICH YOU LIVE IN TODAY. YOUR FINANCIAL DIFFICULTIES ARE BROUGHT TO AN END. WE SUPPORT YOU BOTH FINANCIALLY AND MATERIALLY TO ENSURE YOU LIVE A COMFORTABLE LIFE. IT DOES NOT MATTER WHICH PART OF THE WORLD YOU LIVE IN. FROM THE UNITED STATES DOWN TO THE MOST REMOTE PART OF THE EARTH, WE BRING YOU ALL YOU WANT. BEING AN ILLITERATE OR A LITERATE IS NOT A BARRIER TO BE A MILLIONAIRE BETWEEN TODAY AND THE NEXT TWO WEEKS. YOU BEING IN THIS OUR OFFICIAL PAGE TODAY SIGNIFIES THAT IT WAS ORDERED AND ARRANGED BY THE GREAT LUCIFER THAT FROM NOW ON, YOU ARE ABOUT TO BE THAT REAL AND INDEPENDENT HUMAN YOU HAVE ALWAYS WISHED YOU WERE .SO IF YOU ARE INTERESTED IN ...","post_message":"There are some new Barbie dolls on the block: curvy, tall and petite! @webpagelink"}]
