[{"comment_id":"10154219660042908","commenter_b":"Yet they try to call themselves the prolife party.The warmongers that they are proves that they aren't.They aren't prolife they are pro birth.The GOP will get us into war with iran and the way donald trump is talking we'll have a border conflict with mexico.","commenter_a":"Still waiting for Bernie to say something about the 700 million dollars congress. spent on defense last year","post_message":"Sadly, people like former vice president Dick Cheney and many of the other neo-cons who pushed us to war in Iraq were not only tragically wrong then, they are wrong now. Unfortunately, these individuals have learned nothing from the results of that disastrous policy and how it destabilized the entire region."},{"comment_id":"1612078455751826","commenter_b":"She wouldn't recognize the truth if it hit her in the face","commenter_a":"Hillary tells it like it is, OH that's terrible take it back, Donald Trump supposedly tells like it is, oh, he's so refreshing to have some one not pc and speaks their mind. F#@K all you people, you're nuts!!!. I really hate she seemed to walk it back, because it's the truth.Donald Trumps supporters are all eating out of the same trough.","post_message":"Mike Pence responds to Hillary Clinton's comment that \"half\" of Donald J. Trump's supporters are a \"basket of deplorables\": \"They are Americans and they deserve your respect.\" @webpagelink"},{"comment_id":"10150858630504999","commenter_b":"Watch out you may be deported!!!!!","commenter_a":"Go Trump for 2016","post_message":"\"There has never been a man or a woman — not me, not Bill, nobody — more qualified than Hillary Clinton to serve as president of the United States of America,\" President Obama said. Read more: @webpagelink"},{"comment_id":"1744094332472035","commenter_b":"You fix it by following the laws already on the books and securing the borders. Start deporting anyone here illegally and fine businesses that are hiring them. When they see there's no work for them and we are serious about catching and deporting them most will pick up and leave.","commenter_a":"That's a real question but few are willing to answer without being labeled a bigot or racist. The immigration problem is very real and here is a clear example of how the illegal community drains resources for American citizens.","post_message":"During a heated exchange, Tucker Carlson asked immigration activist Jose Antonio Vargas if it’s fair for illegal immigrants to take coveted scholarships from American citizens. @webpagelink"},{"comment_id":"1579218252372572","commenter_b":"You k ow it is . She can't win. Otherwise","commenter_a":"Narcissists must have someone or something to blame for their inadequacies and failures.","post_message":"\"I'm afraid the election is going to be rigged, I'm going to be honest,\" Donald J. Trump told a crowd on Monday, just days after he criticized the \"unacceptable\" general election debate schedule."},{"comment_id":"1107644279295319","commenter_b":"I don't agree and what she did is wrong. But Trump can suggesting banning all Muslims from the USA and get away with it?","commenter_a":"Strange but when these muslims say and do the same things..Nothing happens....WHY...","post_message":"The devout Christian has been ordered to do community service"},{"comment_id":"679630052167782","commenter_b":"She needs to be deported.","commenter_a":"i think you belong over there","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"}]
