[{"comment_id":"10155073600242235","commenter_b":"Quit covering the bitch. Your continued coverage is not news, it is for personal gain. How long can one beat a dog?","commenter_a":"NO THANKS!","post_message":"There's only one reason why she wouldn't be reprimanded..."},{"comment_id":"541837822650909","commenter_b":"blow hard............lies lies lies.....#USA4DJT, #MakeAmericaGreatAgain, #VoteTrumpForPresident","commenter_a":"So sorry this is his last year","post_message":"Your reaction to President Obama's State of the Union Address?"},{"comment_id":"751075045025676","commenter_b":"@username I like the guy. He's obviously brilliant, but wasn't on top of his game last night. I'm glad he'll be able to survive it.","commenter_a":"Ben was kinda catatonic at the debate last night. Luckily, the liberal zealot moderators stole the show and the headlines.","post_message":"In 3......2......1.......BOOM!"},{"comment_id":"1268015386628044","commenter_b":"An ex Democrat here that doesn't believe her lies. And neither does 90% of our Democratic Charter making up close to 3000 people. We are NOT voting for Hillary Clinton. The DNC should have let the election alone. You won't hear about it in the media or see it in the polls but MANY Democrats are pissed off at their party for rigging the election for Mrs. Clinton. I hear what's going on from the ground floor in the Democratic Party and from my calculations close to 30% of Democrats are not voting for her nationwide.... They are desperately trying to get us on board but it is not going to happen. The Democratic Party is falling apart and you won't hear about it from a single news source. She will have the \"always vote blue\" votes and that is it. The Clinton campaign and the DNC have even sent ...","commenter_a":"The democrats feelings get hurt from a said word or two. Lying Hillary can insult their intelligence by lying to their faces for 40 years and they are completely ok with it. Makes you question their intelligences.","post_message":"Hillary Clinton and Donald J. Trump are tied in South Carolina according to new polling. Rachel Maddow breaks down the surprising development. More analysis on the latest polling from The Rachel Maddow Show: @webpagelink"},{"comment_id":"10156291676570500","commenter_b":"So so sad!","commenter_a":"Was it her baby or was she babysitting ?!","post_message":"Deputies say they found him in possession of child porn sent to him by his wife. @webpagelink"},{"comment_id":"10153677956363961","commenter_b":"@username Yes, those stupid one.","commenter_a":"In case you haven't notice, Tom, Obama has given the \"middle finger\" to Americans since he's been in office, always going against the will of the majority. We'll remember you when your term is up.","post_message":"Proud to help secure a new federal grant to improve public transit and fix traffic lights in 10 Connecticut towns"},{"comment_id":"10154692333454203","commenter_b":"EAT ME ASSHOLES!","commenter_a":"Dallas Lavalley","post_message":"This is how Donald J. Trump treats women."}]
