[{"comment_id":"776537535808625","commenter_b":"Bitter and jealous? Suck an A.","commenter_a":"you look like you eat porridge for breakfast from a silver spoon, bro","post_message":"The waiters had a little fun with me this AM. #nailsforbreakfast"},{"comment_id":"10154093094596756","commenter_b":"Yes that's it Alissa, it is \"hidden on purpose\" but you supposedly know this secret and post it on Facebook...yet it is hidden? How, just HOW do you make that thinking work in your mind?","commenter_a":"They just lie with confidence and no facts and figures. The economy is worse than when Obama came to power? Are you serious? The whole banking system had crumbled and TARP funds had to be injected. Lehman Brothers had closed down. Merrill and Bear Stearns were sold, housing was plummeting, unemployment was rising, stock market had crashed, sentiment was pessimistic. Now that we are all good - yep let's not give anyone credit where it is due.","post_message":"If you missed last night's GOP debate, here's a recap in 100 words."},{"comment_id":"10153500393969087","commenter_b":"Lmao!! Yes that woman really said that. She's a looney bin","commenter_a":"@username did you really just say \"Kid Rock is a patriot and has billions of fans that respect him?\" You really just summed up the average Trump supporter quite perfectly: someone who doesn't quite know the difference between an extra 0...","post_message":"\"I'm digging [Donald J. Trump],\" Kid Rock told Rolling Stone magazine. \"I think he will [win]. To me, I'm just like, 'We gotta try something else.'\""},{"comment_id":"1301588096546090","commenter_b":"What eight years (8 lonnnggg years) have brought this country to........sad, sick and stupid.......","commenter_a":"Moron","post_message":"This is CRAZY."},{"comment_id":"10155065257093984","commenter_b":"There is no doubt Israel or Jews were there first. As far back as 2166 B.C., some say as far back as 4000 B.C.. Arabs or Muslims first recorded being there 853 B.C., Mohammad wasn't born until 570 A.D..... The size of Israel is 12,877 Sq. mi. about the size of New Jersery... The size of Arab, Muslim land is 8,368,272 Sq. mi., and consist of 20 countries. That would be the size of putting together (Texas and Alaskas) 8 times.... Over the years Muslims have attacked Israel, even combining countries to fight Israel and have lost every time to Israel's strong military. During peace talks, Muslims have never given up anything to Israel. Whereas everytime Israel has given up land to Muslims, they have used the land to move closer for attacks against Israel. Muslims do not want peace with Israel. They have said they will not coexist with ...","commenter_a":"NBC is one of the least creditable news sources. The beat goes on ! Time to boycott them.","post_message":"Talk about \"fake news!\" Here's how NBC was just BUSTED in a massive lie designed to make people think less of Israel. Here's what they had to say that has a lot of people outraged... This proves EXACTLY how the mainstream media feels about Israel..."},{"comment_id":"10153828594101135","commenter_b":"Ignorance at its best","commenter_a":"losers go back to the burbs","post_message":"Supporters of Donald Trump are gathering for a \"flash mob\" on the Wayne State University campus - where Hillary Clinton is scheduled to speak later this afternoon."},{"comment_id":"10153124003659312","commenter_b":"Did you forget there also was Barry Bonds and others? And yes, there was McGuire! This is old and it happened over 10 yrs ago! Move On!","commenter_a":"Handcuff needs to be in handcuffs for picking the Patriots cheaters! Lol","post_message":"This morning, Handcuff, one of several dogs rescued recently by local law enforcement, made his St. Louis television debut with Rene Knott, to make his pick of a winner in today's Super Bowl. See who he picked and then call Stray Rescue to inquire about adopting him. (314) 771-6121 @webpagelink"}]
