[{"comment_id":"906562849439968","commenter_b":"Can't wait for more racial division from this fraud. She's Holder with a dress on. Worst choice ever.","commenter_a":"Wonderful","post_message":"BREAKING"},{"comment_id":"931634046893125","commenter_b":"Because she is vermin....","commenter_a":"Why are there so many Hillary hating Trolls on here?","post_message":"\"We can’t hide from hard truths about race and justice. We have to name them and own them and change them.\"—Hillary"},{"comment_id":"10157822759390389","commenter_b":"She is a joke","commenter_a":"Evil woman","post_message":""},{"comment_id":"1107309912667398","commenter_b":"Testing , testing , are you awake America , if not you'd better be soon , ISIS is here an they're not gonna wait for us to realize it , to late is to stupid , time to shake the Muslins up to the fact that we've wasted enough time an lives on there nonsense arrest an deport where needed , tolerate nothing , they want changes send them home an let them change there own countries , leave us alone an we'll leave you alone too .","commenter_a":"@username and trump piss off.","post_message":"Donald J. Trump says there may be more terror attacks across the country because \"we've been weak\" and \"our leaders are...stupid!\" @webpagelink"},{"comment_id":"10152833310366051","commenter_b":"She prostituted herself out for the Republican party without thinking of the fall out from orally satisfying the president. He never did anything with her. He allowed her to get on her knees and prostrate and prostitute herself. She and the ugly woman with her ruined their own lives, not his.","commenter_a":"Good job Mr. Shanks. The worst part is that he carelessly wrecked the life of a young vibrant Monica Lewinsky. What a man! What a man! Jerk!","post_message":"The man who created Bill Clinton’s official portrait hid something in plain sight – and the Clintons aren’t happy about it."},{"comment_id":"1230732883614387","commenter_b":"Well, since they found a genetic marker for homosexuality that automatically means that the same genetic marker influenes heterosexuality.","commenter_a":"No specific gene links heterosexual people and the preferred gender of their partners, and I'm fairly certain the same goes for gay people.","post_message":"The science of homosexuality."},{"comment_id":"1521502694809851","commenter_b":"And once again we don't riot , block busy streets and and make up bullshit like a certain group of people--- absolutely this is murder and a hate crime!!","commenter_a":"absolutely","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news.  No riots, no protests, no media coverage.   Do you think he should be charged with a hate crime?"}]
