[{"comment_id":"1170528036314405","commenter_b":"She knows she can't do it. She has to bring her husband in to do it for her. I guess we are not ready for a woman President.","commenter_a":"Hillary says she will appoint Bill to run the economy. We've seen the Clintons in action together before in the Whiter House. We call that getting two crooks for the price of one.","post_message":"The Clinton Foundation's business relationship with 20 foreign governments raises real questions about her judgment. Simply put, Crooked Hillary is in no position to be President of the United States of America."},{"comment_id":"10153524199539641","commenter_b":"because most of them came here for money, and they are imigrants who are using the situation,not the real war refugees - the real war refugees would be happy just to be in a safe UE country,without demanding to get to the richest countries with the best social care (get money fo free and reproduce like rabbits).","commenter_a":"I'm sure only few of the refugees are children. many are young males and what is with refugees? why won't they stay at hungary? hungary is peaceful nation. i wonder why. hmh","post_message":"Anguish erupts as migrants and refugees are prevented from boarding trains:"},{"comment_id":"1342964245730921","commenter_b":"Yes, Hillary ALL THE WAY!! Andrea, go away!!","commenter_a":"She asked the tough questions and Hillary was very professional and gave very informative answers. All together I think it's helped her giving this interview. Trump could never have been so poised with his answers. I think she has been doing great with her campaign. Hillary 2016","post_message":"This is not journalism by any measure."},{"comment_id":"492568140946699","commenter_b":"Keep it close to the Whitehouse for the next few months, 2 fer 1! (JOKE)","commenter_a":"No.","post_message":"Guess who was at the ribbon cutting ceremony?"},{"comment_id":"10152961247876680","commenter_b":"That's you and your crowd... Dead and cut up babies sold for the meat market !","commenter_a":"I proudly stand with Planned Parenthood.","post_message":"The move dramatically increases the chances of a government shutdown fight in the fall."},{"comment_id":"668156923332741","commenter_b":"Oh, so now you speak Spanish? You voodoo witch!","commenter_a":"What does it takes America to see that Obama and Hilary have offered our country very little for the past eight years, good deceptive speeches, pure empty promises, Obama Health Care that every Insurance Company wants to drop because they are loosing so much money, bad immigration system, from one lies and deceptions after another, 400,000,000 American tax dollars for ransom, two more Americans Kidnapped for more ransom money, bad Iran deals and foreign bribes for speech and favors from corrupt foreign leaders, 33,000 deleted government email, deleted and covered up under Hilary skeleton closet because Hilary think she is above the law, deceptions, Hilary lies and cover up about Benghazi, from one lies and deception after another coming from Hilary and Obama to much to list, while our country is falling apart and American Citizens are suffering, our poor minority American Citizens are suffering, getting worse and worse under ...","post_message":"A tan solo 83 días para el día de la elección, Trump contrató a una de las voces más extremistas de la derecha para dirigir su campaña. Este es quien realmente es Trump y queda claro que no va a cambiar."},{"comment_id":"1207587629262246","commenter_b":"Yeah they're adorable haha, the way they move :D","commenter_a":"@username they are so cute lol","post_message":"<3 penguins Watch the full video here: bit.ly/1Fxpjfk Video by John Downer Productions. Music composed by Will Gregory. Video edited by Matthew Gordon."}]
