[{"comment_id":"1879681238919909","commenter_b":"And these kind of people are what supported Hillary. No concern for the law, just like her.","commenter_a":"Animals.","post_message":"“What’s happening to America?” said David Wilcox, as he showed his wounds inflicted by the mob. “You’re supposed to be able to vote in peace! It’s supposed to be part of our democracy. And what happened is, I vote for somebody, and I get beaten, robbed, and my car stolen, and I have no way of getting my wife to and from work safe anymore,” he told the Chicago Tribune’s news crew."},{"comment_id":"10154063115076509","commenter_b":"Wanker !","commenter_a":"Shut up trumponszi","post_message":"\"We have a problem in this country. It's called Muslims,\" a man said at a Donald J. Trump rally. Trump did not appear to correct the man when he alleged that President Barack Obama is Muslim and also not an American. @webpagelink"},{"comment_id":"747059155450198","commenter_b":"How would a little girl see a transgender's penis? In the female washroom, everyone uses a stall with a door that locks. The only way a little girl would see one is if a pervert walked in the washroom. A true transgender would not exposed himself unnecessarily.","commenter_a":"I don't think its a good idea. I'm not concerned with transgendered using the women's restrooms,. I'm concerned with a pedophile using the restroom to grab a child. Or a rapist using the opportunity to grab a woman. I don't know that either scenario will ever happen...but it could. When it comes to safety, I think we should make every effort to keep women and kids safe.","post_message":"ClashDaily.com"},{"comment_id":"10153460596675779","commenter_b":"Complete agree David!!! Oh, by the way, I'm a female gun owner ;)","commenter_a":"She is a genius. I hope she realizes how hard your life can get when you make an enemy of the NRA! All you have to do is casually mention gun control or background checks and 50 whack - jobs will jump down your throat. If you're on t.v. it must be much much worse. Look what happened with Amy Schumer.","post_message":"Samantha Bee highlighted a glaring, surreal NRA double standard on Full Frontal with Samantha Bee yesterday, stockpiling a small weapons arsenal while trudging through red tape as she tried to nab her own Eddie Eagle costume, the NRA's gun safety mascot. Watch below."},{"comment_id":"861215140607271","commenter_b":"Alex, it wasn't proven to be false. Please cite the \"proof\".","commenter_a":"I respect you Senior Airman but your comparing Ron Paul & Jessie Ventura to the killer as \"typical\", is absolutely ludicrous. I don't even know where to start I'm so disappointed.","post_message":"EXPOSED: Chris Kyle Killer Didn Have PTSD, Was A Typical Anti-War Punk Like Bradley Manning. I like to know if Routh or his family had any contact with Jesse Ventura in the days before he murdered Chris Kyle. Allen West and Walid Shoebat are also trying to sort out if his anti-war beliefs had graduated to jihadi sympathizing or... #americansniper #dallasobserver #guns @webpagelink"},{"comment_id":"641541669369745","commenter_b":"She is a ass. Get her shit and get out","commenter_a":"Go back to where ever the hell you came from then you spoiled bitch. I'll pitch in on a plane ticket!","post_message":"This spoiled brat got exactly what she deserved. If you don't like our country you can leave. Do you agree this is karma?"},{"comment_id":"587167334791713","commenter_b":"Stand with her point of view, and share her perceptions with your friends! @webpagelink","commenter_a":"I am with hillary","post_message":"One candidate delivers catchy lines—the other delivers results. Add your name to say you're with Hillary. #DemDebate"}]
