[{"comment_id":"950867651635304","commenter_b":"The son of a bitch is white----that's why!!","commenter_a":"How bout this bastard coward be sentenced to 79 years, the age of the gentleman he hit, please put him with the gangs","post_message":"Texas man who filmed himself assaulting an elderly black man during what is known as the “knockout game” sentenced to 71 months in federal prison.  Conrad Alvin Barrett was charged with a hate crime for punching 79-year-old Roy Coleman, fracturing the man’s jaw in two places. Barrett said he targeted the man to see if the assault against an African-American victim would be nationally televised. MORE ----->  @webpagelink"},{"comment_id":"1763064613956147","commenter_b":"Bitch I ain't finna lose my job over your racist ass. But don't let me catch you outside 2 months from now..","commenter_a":"First World Problems","post_message":"This is truly shameful."},{"comment_id":"10153584523586336","commenter_b":"I'm not an Alabama fan, but if I was, I'd be truly upset with this video..... Not one time did those girls say 'roll tide'.... I'd ban it too!! GBO #rockytop","commenter_a":"I just love when someone judges something they know nothing about.","post_message":"The recruitment video has been criticized for lacking diversity and objectifying women."},{"comment_id":"1123460471025521","commenter_b":"The mother is as full of crap as the child.","commenter_a":"Instead of asking the whole world to conform to ones abnormality or difference how about assisting that person to deal with their abnormality/difference in such a way as to not draw negative attention. If one is a diabetic the whole world does not need to eat a diabetic diet. If one has a limb removed does the whole world remove a limb? Honestly I see no difference. We all have differences and we learn to deal with them, not expect others to suffer or deal with it.","post_message":"Watch this amazing video as the mother of a 'trans' teen makes the most outrageous claim possible about North Carolina's new HB2 law.   What do you think about this mother's claim?"},{"comment_id":"10154086770281756","commenter_b":"I guess science works when ranchers feed their cows corn instead of grass and then have to shoot up the same cows with tons of antibiotics because they are eating GMO corn instead of organic grass. Guess what? Those antibiotics are transferred to humans who eat meat and cause cancers in humans. Be safe, don't eat meat or during dairy milk.","commenter_a":"Why? Wouldn't this be a conflict of interest? It behooves hospitals to feed their patients meat with as many antibiotics as possible so people would visit again in the future and hopefully for a much longer stay.","post_message":"Hospitals are on the front lines of the battle against antibiotic resistance."},{"comment_id":"10153143510309575","commenter_b":"That's a woman?","commenter_a":"Good","post_message":"An Indianapolis mother was sentenced to 60 years Friday in connection with the death of her 2-year-old daughter.  In January, she was found guilty of murder, battery and neglect of a dependent."},{"comment_id":"10153474525188812","commenter_b":"Is she a Mormon? Cause those kinds believe differently.","commenter_a":"This is not ok!! he has said God made him wrong, God is NOT a liar and He makes no mistakes....repent cause looking like you made a true blasphemy against God, please don't comment ignorance, if you have an issue take it to God.....","post_message":"NEW: Meet Caitlyn Jenner -- formerly known as Bruce Jenner: @webpagelink"}]
