[{"comment_id":"678004185692498","commenter_b":"What self respecting woman wouldn't lash out at a woman trying to seduce her husband?","commenter_a":"“Bimbo eruptions.” “I would crucify her.” “We have to destroy her story.” These are just some of the things said and done by @username to undermine women who accused her husband, Bill Clinton, of infidelity and even assault. Hypocrites!","post_message":"\"This is not something that we can ignore. It's not something we can just sweep under the rug as just another disturbing footnote...this was not just a lewd conversation, this was not just locker room banter. This was a powerful individual, speaking freely and openly about sexually predatory behavior.\" —First Lady Michelle Obama on Trump"},{"comment_id":"10153525353934170","commenter_b":"Hillary Rodham Clinton: Not qualified to clean my toilet.","commenter_a":"That picture looks like she has an empty head. Oh! That's Hillary Clinton! !!!","post_message":"CNN asks Hillary about tax policy, spending, the collapse of Greece, the Iran nuclear deal, the future of ObamaCare . . . just kidding! They didn't ask about any of this. They wasted almost the entire interview on trivial nonsense. The VIDEO will have you shaking your head."},{"comment_id":"10154427590982577","commenter_b":"Shes just a lil woman thang. Ughk. Hillary should be in prison.","commenter_a":"Isn't it funny how she plays dumb to this stuff too? On her 60 minute interview she said she had no knowledge of these emails even though it's all over the news. She plays dumb to every scandal and people still blindly follow this idiot","post_message":"Wikileaks Crashes The DNC   The Clinton campaign is pointing its crooked finger at the Russians as the culprits responsible for hacking the emails of the Democratic National Committee going all the way back to last summer. John Podesta, the chairman of the 2016 Hillary Presidential campaign claims Russian President Vladimir Putin is aiding Donald Trump’s campaign because there is as AP reports  “a kind of bromance going on”.  As if one more fabrication of reality could sway the narrative back to the Democrat's camp. And whether the Russians hacked the DNC emails or if it was the Romanian hacker claiming responsibility known as Guccifer 2.0 really doesn’t matter.  What matters is that now the American people know how riddled with deception the DNC truly is. The political machinery propping up Hillary's campaign is quickly coming apart at the moment she should be dominating. The released 19,252 wiki leaks internal emails that were hacked from seven officials at the DNC have served as a battering ram, exposing a organization laden with deceptive practices on a monumental scale.  Aside from the DNC's obvious favorability of Clinton over Sanders because of her gender and the jabs taken at Sanders religion. The emails detail a manipulation of the media of grotesque proportions. Relegating mainstream media to nothing less than a propaganda machine.  In this email the DNC’s National Press Secretary Mark Paustenbach says of a Politico reporter Ken Vogel “ Vogel gave me his story ahead of time/before it goes to his editors as long as I didn't share it. Let me know if you see anything that's missing and I'll push back.\""},{"comment_id":"981969021843756","commenter_b":"Republicans want to end abortions so that they will have more population to draw on for their future wars. Think about it: End abortions, brings on many children that the parents can't care for (likely because of finances). The child likely grows up in poverty, being told (by the same people that ended abortions) he/she is a leech on society (parents likely getting assistance), so that child will grow up and most likely do one of two things (a few will take a different path, of course). 1) begin a criminal career 2) join the military to be fodder Republicans want to abort YOUR children when they are adults....THAT is why they want to end the termination of unwanted pregnancies.","commenter_a":"Attack on women!!!!! All you saying baby killers start adopting them then...start helping poor young women survive during pregnancy and after child is born, start fighting for wic, head start, etc...how many severely disabled children have you adopted? Big mouths refuse to help real babies only care for fetus","post_message":"Every child is a gift from God.  That's why the House just passed some of the most pro-life legislation to ever come before Congress – banning abortions after 20 weeks."},{"comment_id":"1847137338904678","commenter_b":"Everywhere these devils go, they rape and murder the rest of the people. Just ask the Native Americans, the Aboriginies of Australia, and the countless number of African countries that still suffer from the effects of all the death and destruction caused by what the devils call imperialism and colonization. The devil who comes disguised as white people is absolutely disagreeable to live with in peace. It's been proven time and time again.","commenter_a":"Didn't take long for the racial comments on a post that has nothing to do with race. You are the people that make today's issues more of an issue than it needs to be. This man is disgusting","post_message":"SHOCKING! A sheriff's deputy is charged after he allegedly posted video of himself performing a sex act with a dog."},{"comment_id":"10155201901781162","commenter_b":"Maybe the writers can be more select on how they word their headlines. Maybe they do this on purpose cause they get a kick out of reading the comments. You never know.","commenter_a":"Reading is key... trumps pic did employ an illegal, but upon finding out ended her employment and aided in getting her assistance in getting legal status ... this is why america is the way it is... read a title and jump to conclusions... most of the people protesting can't really hold a conversation about why there out there.. other than 1 line headlines they repeat over and over... it's sad","post_message":"President Trump's labor secretary pick, Andrew Puzder, admits that he and his wife employed an undocumented housekeeper for years...@webpagelink"},{"comment_id":"1232217873516420","commenter_b":"Female dog","commenter_a":"Convicted felon","post_message":"I want to see what you all come up with... Describe Hillary in just two words... Ready, set, go!"}]
