[{"comment_id":"1297641203604631","commenter_b":"She makes me want to throw up.. A big rich phoney.","commenter_a":"She don't make me feel anything. Politics does not dictate what I feel","post_message":""},{"comment_id":"1056321874481529","commenter_b":"Why don't you purify yourself in the waters of Lake Minnetonka?\"","commenter_a":"All lives matter","post_message":"Hillary Clinton and Donald Trump face off now in the first presidential debate of the 2016 campaign:"},{"comment_id":"1129381677098530","commenter_b":"Leona Helmsley was the \"Queen of Mean\", The Donald is the \"King of Con\".","commenter_a":"No can't believe you still endorse her after her comments about your supporters. Trump used the tax Laws . Unlike Hillary who lies about everything. Her young daughter bought a 10 million dollars home while she says your young supporters live in a basement!!!!!","post_message":"So, Trump goes around and says, \"Hey, I'm worth billions, I'm a successful businessman, but I don't pay any taxes. But, you, you make 15 bucks an hour, you pay the taxes, not me.\" That's why people are angry and want real change in this country."},{"comment_id":"712897555475520","commenter_b":"Yes.. Of course the illegals have been vaccinated.... If their illegal we wouldn't know NOW would we?..... And it doesn't just mean Mexican... It means any child that enters our country illegally.... Plain and simple.....","commenter_a":"So that would be all ilegal children at the very least! Who should not be in our schools anyway!","post_message":"Anyone who hasn't been vaccinated is being told to avoid visiting Disneyland."},{"comment_id":"756120254539294","commenter_b":"Dont \"let\" her leave America, MAKE IT LEAVE AMERICA! !!","commenter_a":"I thought Rosie was leaving?","post_message":"It's no secret that Rosie O'Donnell and Donald J. Trump don't like each other very much. But what she just did took things WAY too far..."},{"comment_id":"1237059042980790","commenter_b":"He's got my vote. illegals get out","commenter_a":"Trump is a racist POS!!!","post_message":"There may be a lot of other games out there that look similar, but Call of Duty is still in a class of its own."},{"comment_id":"10154086298502541","commenter_b":"I find this horrific but please take down the pictures","commenter_a":"Where is Al Sharpton when you need him. Lol","post_message":"Police spokesman Anthony Guglielmi said that while the suspects made “terrible racist statements” against white people during the attack, it does not appear to be racially motivated."}]
