[{"comment_id":"507737642755232","commenter_b":"Hillary has a list of wars that she provoked go take care of your wives, she be to dangerous for you, she be a backstabbing. Learn to read.","commenter_a":"This man trump will be too dangerious for the oval office he will lead america to another third world war so to all you red necks supporting he's cause do the right thing before you unleash hell on earth","post_message":"Every day I wake up determined to deliver a better life for the people all across this nation that have been ignored, neglected and abandoned. -DJT"},{"comment_id":"10152895452606051","commenter_b":"BANG! But since that didn't happen, 'drop the soap bitch.'","commenter_a":"Coward!!! Thank God for good neighbors.","post_message":"This man grabbed a woman and began raping her. That's when a group of Good Samaritans heard her screams."},{"comment_id":"1222382617796158","commenter_b":"Idiot please don't reproduce","commenter_a":"End of the circus... was a main attraction.... They do away with the side shows...then the tent... now the elephants.... Why would one even want to attend.... another bit of America down the toilet...","post_message":"Elephants performed for the last time in the Ringling Bros. and Barnum & Bailey Circus on Sunday, putting an end to the controversial practice. The animals will live at the 200-acre Ringling Bros. and Barnum & Bailey Center for Elephant Conservation in Florida."},{"comment_id":"10155622855165354","commenter_b":"Pretty soon we'll be sending them on chartered flights, like the illegal immigrants we're busy with right now.","commenter_a":"uh huh!!","post_message":"Infuriating..."},{"comment_id":"925751947552361","commenter_b":"oul don","commenter_a":"303253143368344u after kellys when kfc was still open","post_message":"Great afternoon in Ohio & a great evening in Pennsylvania - departing now. See you tomorrow Virginia! #MakeAmericaGreatAgain"},{"comment_id":"825435090838373","commenter_b":"Low life piece of craps lock her away and throw away the key.","commenter_a":"Sick sick sick! Just beat her senseless for this. That poor innocent little girl. Hopes she rots in hell!","post_message":"This woman allegedly faked cancer to cover up a horrific crime:"},{"comment_id":"1712281645723927","commenter_b":"Ash Jesus another self righteous know it all illegal immigrant go back to your country bitch this is my country not yours","commenter_a":"Makes me laugh that those who are here 'legally' think they are any better than those who cross the border. Yes deport those with criminal record, but why throw out hard working folks like my parents who come here for a better life and contribute to this country. They also pay their taxes. People screaming out CRIMINALS to immigrants as if US citizens weren't criminals. Instead of complaining about immigration, perhaps you should demand the government to stop exploiting other countries' resources and their people. Bring down your ignorance and arrogance down a notch. Seriously, who do you all think you are? When you die and rot in your tomb, you won't be needing your 'citizenship'.","post_message":"Do you agree or disagree with the majority of Americans on this?"}]
