[{"comment_id":"1086698044698949","commenter_b":"THINK ABOUT THIS ,TRUMP SAYS HE'LL ADD A 45% TARIFF ON IMPORTS FROM MEXICO AND CHINA ,STOP MONEY TRANSFERS OUT TO MEXICO TO GET THEM TO PAY FOR A WALL ,WE EXPORT 236 BILLION A YEAR TO MEXICO IF WE ADD A 45% TARIFF TO IMPORTS THEY WILL DO THE SAME ,BOOM! THOUSANDS OF PEOPLE OUT OF WORK !! CHINA IMPORTS 116 BILLION FROM AMERICA INCLUDING ALMOST OUR INTIRE CROP OF SOYBEANS ,WE MESS WITH THEM THEY GO SOMEWHERE ELSE ONCE AGAIN FARMS SHUT DOWN, FARM HANDS OUT OF WORK .WE'RE TALKING 1930'S STYLE DEPRESSION.WHY ?..........DONALD TRUMP WE IMPORT MORE FROM MEXICO THAN WE EXPORT TO THEM TRUE 5 BILLION A YEAR IS DIAMONDS AND PRECIOUS METAL,14BILLION A YEAR IN OIL,AND 11 BILLION A YEAR IN FRUIT,NUTS AND VEGETABLES ,YOU WANT YOUR FOOD AND FUEL COST TO GO UP 45 % IT WON'T BOTHER TRUMP HE'S WORTH 10 BILLION","commenter_a":"Our current administration is a joke. They have been living off of the tax payers for years without one concern for the US Citizens. People, wake up. Take a good long look at your life, are you living better now or five years ago? or even 10 years ago, Is your income the same, are you now needing to work 2 jobs just to make ends meet. People, we are now competing with our teenagers for the jobs we held as teenagers to learn responsibility just to make ends meet. Wake up people, I don't think this is what our parents believed was the American Dream. And we certainly aren't living better than they did. Think long and hard about your future and that of your children and the generations to come, will they have a FUTURE!!!!!!","post_message":"Whoa!! Do you still support Trump?"},{"comment_id":"519056438282649","commenter_b":"cair can go to hell","commenter_a":"Our country. .USA..AMERICA","post_message":"PLEASE SHARE AND HELP PROTECT OUR VETERANS!"},{"comment_id":"10153197093266051","commenter_b":"She a idiot","commenter_a":"Agree","post_message":"Nancy Pelosi says President Obama's Iran deal is simply brilliant. Agree or disagree with her?"},{"comment_id":"948719421835197","commenter_b":"naw, the generation of things now being exposed more like it","commenter_a":"The generation of no personal responsibility.","post_message":"If this tactic works, we're a sicker country than I could have ever imagined."},{"comment_id":"748263168643341","commenter_b":"Trump is a racist bigot who drives fear into weak people just like Hitler #dumpthetrump anti-muslim isn't a political opinion its bigotry. and his anti-hispanic is talk is racism","commenter_a":"America doesn't thrive off fear we don't feed off hate and we will certainly not have a president that represents all that is wrong in this country. Hillary is who we need in charge #dumpdrumpf #imwithher","post_message":"\"I don’t think there is anything more important than working to provide every child in this country and beyond the chance to do what that child is meant to do, because I think every child has a God-given purpose and a God-given potential. That means every child deserves a good teacher and a good school regardless of the zip code that child lives in. That means every child deserves the health care that will keep that child healthy, will deal with whatever befalls him or her. That means that the child’s parents and grandparents deserve good jobs with rising incomes to provide a good, solid life for their son and daughter, for their grandchild.\" —Hillary"},{"comment_id":"10153766161047217","commenter_b":"Stoning , beheading , kill non believers . No thanks not for me if that's peace then I'm a fairy","commenter_a":"Islam, this outdated cult ,has no place in a 21 century world....the quran is nothing more than a military pamphelt and islam is based on a cry for war to no end....madness......","post_message":"\"It's become much harder for modern women to live here after Friday night.\""},{"comment_id":"1215195555169015","commenter_b":"Angela Merkel sucks wake-up idiots please","commenter_a":"Actually, Donald Trump is the only candidate, with a proven business record, who can assess data, consult with people who need to be heard, and make decisions he can logically defend. Hillary's track record as a senator and Secretary of State are without merit! (Btw, I used to be a democrat but I refuse to vote - then or now - for the two most corrupt politicians of our era!)","post_message":"“She is the only candidate who can assess data, consult with people who need to be heard, and make decisions she can logically defend.” —WIRED on Hillary"}]
