[{"comment_id":"10153127480747411","commenter_b":"That's what boobs are for, to feed your children. Yet women can walk around in boob pasties and thongs but that's ok, get real!!!!","commenter_a":"Proud nursing in public Momma right here.. never feel shamed. If you want to cover, go for it. If you want to go in private, do it. If you want to feed your baby in front of the world, go right on ahead. It's boobs people. But you have no problem with bikinis that show WAY more of most women than when nursing their child. Grow up","post_message":"NURSING MOTHER: POLICE SHAMED ME A Nebraska mother breastfeeding her 4-month-old son in public says an officer threatened to cite her for indecent exposure if she refused to cover up. What do you think about this?"},{"comment_id":"10157240650595294","commenter_b":"Nice dress","commenter_a":"I hope we get rain.","post_message":"Will rain get in the way of your Fourth of July celebrations? Jenn Harcher, Meteorologist is going to let us know!"},{"comment_id":"1003938939663251","commenter_b":"we didnt send anyone, go kill yor bankers they fuck up your country, wait they already fucked up i guess","commenter_a":"Next wedding come over to Greece you son of bitches to feed all the illegal migrants that you send us!!!!!!!","post_message":"This is such a great story!"},{"comment_id":"1906434399416299","commenter_b":"Imagine something bit u on ur naked body lolzz","commenter_a":"The restaurant name should change to Animals restaurant","post_message":"Owners describe it as an 'orgasmic atmosphere.'"},{"comment_id":"983083455063224","commenter_b":"Don't apologize, you have a right to feel the way you do, you are a woman","commenter_a":"GEEZE","post_message":""},{"comment_id":"887899764578453","commenter_b":"Any woman dumb enough to marry a cop shouldn't be surprised when he starts beating on you. How do you think cops unwind after work? The single ones get a dog to kick around","commenter_a":"Smh! When will it end?","post_message":"With all these red flags, police still didn't step in and protect her. Is it because the abusive husband was a fellow cop, so they just let him do what he wanted to her? Wow!"},{"comment_id":"10153697157652098","commenter_b":"THIS ARE MAMA'S KIDS THEY NEVER DON NOTHING BAD, NO DRINKING, DRUGS, ROBE, HURT OR KILL SOMEONE, WHY THE POLICE DON'T SHUT ALL OF THEME ON THE SPOT, TAKE THEIR CARS AND NEVER LET THEM COME OUT OFF JAIL. EVER. BUT THEY GOT MORE WRITES THAN YOU OR ME. UNTOUCHABLE. IF YOU TOUCH THEM THE STUPID PROTEST WILL START.","commenter_a":"Nancy Jovana","post_message":"VIRAL VIDEO: A CHP vehicle was vandalized as an East Bay sideshow took place... DETAILS & FULL VIDEO: @webpagelink"}]
