[{"comment_id":"1349866401695684","commenter_b":"Ember Kellough When the left wants to bring in millions of illegals and Syrian's it isn't from having a heart but instead to eventually expand their voter base, all about power and control with the left. When they do gain that we can kiss our Country goodbye or stand up and fight them in another civil war. When over 60% of births are coming from liberals it's difficult to not see it coming. The commie left will turn America into another Detroit and Baltimore.","commenter_a":"Obama is: 1st.muslim 2.gay 3.communist Don't be surprised, he's doing exactly what he said, fundamentally transforming the country. America \"voted\" for this.","post_message":""},{"comment_id":"10153863012497042","commenter_b":"Stfu pussy","commenter_a":"Well, The Knicks Can't Hit A Shot, But I Guess Shots Can Hit Them...","post_message":"BREAKING: New York Knicks player Cleanthony Early was held up at gunpoint and shot in Queens just hours ago, NYPD says."},{"comment_id":"1272631619499754","commenter_b":"There are hundreds of billions of untaxed dollars, probably trillions going to Mexico every year through the boarder in drug profits. An effective wall and boarder security will prevent tons and tons of drugs from coming in, as a result people wont be able to buy as many drugs so the money they would normally be using to buy drugs will be spent on other things that will help the economy. So not only will it prevent drugs from coming in but it will prevent billions from going out to Mexico and that money instead will be cycled through the US economy and taxed every step in the cycle. This wall will also help clean up the drug abuse problem our society has and save many lives to overdose and drug related violence. Not to mention illegal immigrants not paying taxes but also sending their extra money back to Mexico. ...","commenter_a":"LOL..heck he doeesn't even know what he is talking about how can he keep up with himself...just hilarious to watch each day what has changed. Ya know, I think his hairdresser is leaving the bleach on too long and it is affecting his brain..just a thought.","post_message":"As the Trump campaign tries to pitch minority voters, Donald J. Trump's  position on immigration seems to keep changing."},{"comment_id":"10153906415276545","commenter_b":"@username You are correct, we have plenty of citizens/legal residents committing crimes we don't need those who aren't supposed to be here in the first place compounding the problem. It is time for sanctuary cities to end. Either you are part of the U.S. and adhere to U.S. law which should be enforced or you secede.","commenter_a":"Is this guy a legal citizen?","post_message":"Laura Ostteen took a hit so hard that it hurts to see. All because of a 5 a.m. run for milk to a convenience store as the city of Dallas sees increase in violent attacks."},{"comment_id":"1225927100760651","commenter_b":"@username And this from the person from Farmville?","commenter_a":"When do we decide that our gun culture is not worth another child dying? What a sad story. Prayers for her family.","post_message":"\"She's not going to first grade, because he made a choice to pull out his gun,\" Lilly's mother said. Read more: @webpagelink"},{"comment_id":"10153051549632169","commenter_b":"She will always genetically be a she period Cat is not a dog just because someone wants it to be","commenter_a":"Why are my tax dollars and donations going to publish this crap????","post_message":"From FRONTLINE:"},{"comment_id":"10152982491580927","commenter_b":"She is only interested in Pelosi.","commenter_a":"She wouldn't know, hers never started","post_message":"Pelosi:  think I know more about this subject than you, with all due respect."}]
