[{"comment_id":"10154941549643057","commenter_b":"@username You can't get back in the US because of a wall.","commenter_a":"Wow! He really showed him! The walls still gonna happen! No more cancerous illegals!","post_message":"#BREAKING: Mexican President Enrique Peña Nieto says he will not attend a planned Jan. 31 meeting with President Donald J. Trump, hours after Trump tweeted the meeting should be canceled if Mexico won't pay for a border wall."},{"comment_id":"10155207800518132","commenter_b":"She looks like a drag queen!","commenter_a":"Sad she hates herself so much to keep mutilating her body.","post_message":"Kim Zolciak Biermann is feeling nostalgic!"},{"comment_id":"10154363011532908","commenter_b":"In America, the people are the government. We're a republic, where our elected officials are acting on our behalf. Otherwise, we're supposed to kick them out. Taxation is the idea that no one can amass keep lot of money without a central authority to provide the infrastructure to make wealth creation possible, or the security to make created wealth sustainable. No one gets rich by themselves, and the people who work to make the rich people rich, or to keep the rich people rich, deserve an infrastructure they can survive on, too. Taxation makes a society fair, stable, and full of opportunity.","commenter_a":"Bernie is not asking people to share. Sharing involves VOLUNTARILY giving away your possessions.","post_message":""},{"comment_id":"481049412085639","commenter_b":"Send her ass back over there fucking trader.","commenter_a":"Hate it!!!","post_message":"A woman who left home to join ISIS just got served up some karma.  Good. Anyone supporting ISIS is a traitor to America.  Click 'LIKE' if you agree!"},{"comment_id":"932842660117117","commenter_b":"wait so confused why that chick pushed her lol","commenter_a":"Sydney Robles","post_message":"Meanwhile In New Jersey"},{"comment_id":"1381800741835583","commenter_b":"Smart woman makes Hillary look like ??? 😝","commenter_a":"Obama couldn't stand her, or for that matter, none of the democrats.","post_message":"Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe.Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe."},{"comment_id":"10153331066431162","commenter_b":"Who cares!? It's not like he did it himself and besides back in the day that's what people did. It wasn't right but that's what happened alot has changed since.","commenter_a":"It does not matter he did not do it if we look hard enough I'm sure we all have someone in our family history who's done something we are not proud of","post_message":"Ben Affleck is coming clean about why he wanted to keep a slave-owning ancestor a secret @webpagelink"}]
