[{"comment_id":"829608320409843","commenter_b":"She is disgusting!","commenter_a":"I'm warmed by the tolerance of the libs. Not.","post_message":"Well, she certainly didn't shy away about how she feels."},{"comment_id":"10156240313260551","commenter_b":"This post is a waste. If you have 1/2 a brain you have known for over 6 years that she is a racist.","commenter_a":"IF....all the white folks were gone from this country, there wouldn't be enough others to support the welfare system or the Obama's income......hummmmm.","post_message":"This woman is RACIST!"},{"comment_id":"575161529335569","commenter_b":"That sick women will never be fine ! Who you kidding !","commenter_a":"Why is this such a big deal? After some rest, and antibiotics she will be fine.","post_message":"Is Hillary Clinton just run down, or is it more serious?"},{"comment_id":"10153806132721051","commenter_b":"@username How is going to all those with the wars he's going to start increasing taxes on the middle income and lowering it on the rich. Building a wall where's that money coming from? not Mexico. Putting a 35% tariff on goods from China. Good move Trump and the China and other countries do the same to us. How about that lost American jobs?. You don't think Mexico buys from us? What about machinery, minerals, autos, trucks and military equipment anf farming equipment.","commenter_a":"Interestingly Trump praised all of Obama's policies. Now he says he's done a terrible job. He praised Hillary's job performance as Senator and Secretary of State and endorsed her for POTUS, now he calls her incompetent. Hmm. Should we really elect someone with such horrible judgement?","post_message":"In an interview today, Donald Trump said President Obama has done a \"terrible job\" in office and has allowed countries to take advantage of America. Is he right?"},{"comment_id":"10153197051250329","commenter_b":"Lol that's like half of us @username","commenter_a":"Kimberley Stefan","post_message":":/"},{"comment_id":"854160414621300","commenter_b":"That's because they don't know it, and they think they're smarter and know more than anyone else. Truth is, they're afraid of Gowdy!","commenter_a":"GO GET EM!!! If anyone can do it you can.Luv your passion and fire!!!The dems DON'T think anyone knows the Constitution...","post_message":"\"I'll make you this promise...\""},{"comment_id":"1188867387819383","commenter_b":"how about just stopping illegal immigration which brought it here in the first place","commenter_a":"Running a high powered fan inside, facing your entry door might help as you come in and out and might help them from entering your home and any that might be clinging to you!","post_message":"ZIKA is FOR REAL and it hits more than just PREGNANT LADIES @webpagelink"}]
