[{"comment_id":"696088307225578","commenter_b":"So because this woman stooped so low as to call Obama a name in public all of you are doing the same thing. You're not any different than she is.","commenter_a":"Unbelievable.............speechless","post_message":"Apparently, saying something really racist will only get you fired for a little while."},{"comment_id":"1410976518925134","commenter_b":"like dying in the sea coming from Europe to steal Mexican and Native American land?","commenter_a":"I wish people would realize this is actually happening and innocent people are losing their lives! of course under ignorant trump supporters everyone is Mexican","post_message":"Donald J. Trump is already deporting people to Mexico  even if they're not Mexican."},{"comment_id":"602469266610319","commenter_b":"Your 15 mins of fame is running out!","commenter_a":"She needs help, yes.","post_message":"Sarah Palin was just hit with a massive curve ball, she needs your help.  This is horrible, we love her. Let's show her we have her back.  Can we get 10,000 'LIKES' for Sarah Palin?"},{"comment_id":"10152698000912452","commenter_b":"I would still as long as she doesnt talk.","commenter_a":"Jessica acting like she ain't asking for attention lol girl you would be doing the same crap. Earn the beads Jessica","post_message":"UPDATE: The girl in the photo had been identified. She is 17 years old and does not attend college. Although she says her interaction with the group was consensual, she did not realize her photo was being taken. @webpagelink  Do you know her? Police in Florida are concerned this spring breaker, spotted in naked photos, may be in danger."},{"comment_id":"1613037799000233","commenter_b":"Thanks to Trump! He has successfully stirred up America. I'm still with Hillary Clinton!","commenter_a":"Ever since the election, the real closet racists have come out..","post_message":"A teacher shouted the N-word in the middle of class, stunning her eighth grade students. The video has millions of views and the teacher has since been fired. @webpagelink"},{"comment_id":"10153615882695329","commenter_b":"Seriously. That woman should have said no or let's go home first. She's just as guilty! Time served smh. Bs","commenter_a":"And why is no one hating on the woman for this? MENISTS","post_message":"A Florida man was sentenced Monday to two and a half years in prison for having sex on a beach in front of other beachgoers, including children."},{"comment_id":"487115881470292","commenter_b":"What a perverted, sick and depraved asshole!!","commenter_a":"Fucktard","post_message":"God will put rainbows and sunshine over the house of every straight, white, christian cis man!"}]
