[{"comment_id":"10154500289369091","commenter_b":"Build that wall","commenter_a":"Trump is making up his own stories !! What would he like the ppl to do with the Syrians kill them ? They are human beings ! Smh.. All the other countries took them in ...Trump has No heart , Maybe we should put him in Syria and see how he likes it !","post_message":"Swedes have been ridiculing President Trump's remarks at his rally yesterday that suggested a major incident had happened in the Scandinavian country."},{"comment_id":"10153304856351350","commenter_b":"Lol!! Someone stop these people from reproducing!! It's not attractive lol","commenter_a":"@username Katie Pollard","post_message":"Congratulations are in order (again) for the Duggar family!"},{"comment_id":"970547099705011","commenter_b":"Senior women for Democrat.","commenter_a":"All I know is that seniors tend to vote for republicans. Go ahead, drug test them. Before you knew it, you don't have their votes anymore.","post_message":"He's the one that should be drug tested."},{"comment_id":"1155965127752480","commenter_b":"I made the same point on a post on face book and was told I was comparing apples to oranges. P","commenter_a":"Cecil the Lion was made up of \"clumps of cells\"...WTH. Clumps of cells are ALIVE! All those dunderheads seem to forget that THEY were clumps of cells at one time too!","post_message":"I am one of the people being pilloried, by the way, in elements of the Drive-By Media for daring to compare Planned Parenthood to Cecil the Lion.  People on the left who are overly concerned with Cecil the Lion say they are offended that they are being accused of caring more about animals than they are about \"clumps of cells.\""},{"comment_id":"484838455040068","commenter_b":"Yes, ban Sharia Law in the USA","commenter_a":"I hope tsa patted her down throughly to make sure she wasn't carry bombs, I think the whole thing is a set up!","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake.  Shariah Law is dangerous, we support the patriots that stand against it.  Should Shariah be banned in all 50 states?"},{"comment_id":"10153139326127293","commenter_b":"just facts he was no hunter just by what was done and his lousey shooting . he had no business hunting.","commenter_a":"he didnt know what he was doing and the guides were obviously dirty.","post_message":"How a dentist who killed Cecil the lion shelled out $50,000 for the trip."},{"comment_id":"931492536967525","commenter_b":"Lying BITCH...who only worries about her bank acct....NOT...American LIVES. She can't even control her Husband. Good thing he keeps Monica handy.","commenter_a":"Liar","post_message":"ClashDaily.com"}]
