[{"comment_id":"1050293421764665","commenter_b":"Good thing? To leave 20 million with no health care? Who are you? Scrooge? Let the excess population die? WWJD. I will not battle here.","commenter_a":"I am a constituent of yours. Let me tell you how hard I am going to work to make sure you are never re-elected! How dare you dismantle the ACA in the late night sessions. How dare you de fund the UN!","post_message":"This was John Kerry and President Obama taking a slap at Israel. I think most Americans believe that the United Nations has become more anti-Semitic, more anti-Israeli. We're going to stop the US money to the UN until we get this fixed."},{"comment_id":"10154703624496077","commenter_b":"These are all men! Lame. Almost any female is hotter than all of these (or does that make me sexist?)!","commenter_a":"Its the beard. Come on ladies, you know you love it!","post_message":"On Friday, Buzzfeed ranked our very own Kyle Clark #4 on their list of the hottest news anchors. We thought we'd share what we think makes Kyle so unique."},{"comment_id":"629211877227588","commenter_b":"If you were born to an married father who was a citizen of the US, I'm pretty sure you're a natural born american, until and unless you and/or your parents renounce it.","commenter_a":"Being a naturalized citizen is not the same as being a natural BORN citizen. I'm a naturalized citizen, born in the UK to a British mother and an American father. I am not a natural born citizen and would not be eligible to run for President. How did he ever get in this race to begin with?","post_message":"It's like a circular firing squad!"},{"comment_id":"197882667406213","commenter_b":"Get fucked cunts","commenter_a":"No regard for life! !!!!","post_message":"SICK & WRONG: Slaughterhouse worker caught on tape dancing with body of a freshly killed pig :( The other workers just laugh. #Reasons2GoVegan"},{"comment_id":"10153607526077452","commenter_b":"What a good citizen! Love this.. Especially with the morons out there who have killed sea life by trying to get a good selfie!","commenter_a":"Hope he finds his mommy 😟","post_message":"A tour guide rescued a young dolphin stranded on a beach. @webpagelink His heroic effort ensured that the dolphin was able to swim another day."},{"comment_id":"10153685449009060","commenter_b":"They do. This, in itself, isn't a problem anymore than relying on other countries to buy your goods is a problem.","commenter_a":"Most of the British public are blissfully unaware of this worrying problem. They still think they live in a \"rich\" country.","post_message":"As warning signs flash across the global economy, Britain is a favoured bolthole for skittish investors. But there’s a flipside to this: the country’s huge current-account deficit. Time to worry?"},{"comment_id":"10154853515096336","commenter_b":"Go away troll! You don't even live in our country","commenter_a":"I bet a million dollars kellyanne conway gave her soul away for for a few bucks and a pussy grab","post_message":" it up, Kellyanne Conway said to Jill Stein. your friends at the Clinton campaign said it won change the results. Conway suggests that the outrage over the call shows many Americans' unwillingness to accept Donald J. Trump as their president and to give him a chance, which includes Green Party presidential nominee Jill Stein three-state, vote-recount effort. Do you agree? @webpagelink"}]
