[{"comment_id":"1607217966231983","commenter_b":"Both are trash , miley gross she nuts to she better grow up !","commenter_a":"Both are idiots","post_message":"Hillary Clinton and Miley Cyrus are a match made in Hell"},{"comment_id":"860972087426701","commenter_b":"ABSOLUTELY NEEDS TO GO TO PRISON FOR LIFE WITH HARD LABOR . MAKE HIM CLEAN TOILETS WITH A TOOTH BRUSH .","commenter_a":"Good Luck Generals....he's pretty slick...watch out for the fall out!","post_message":"Obama has betrayed our country. These generals are moving in to arrest him. Do you think Obama should be put behind bars?"},{"comment_id":"1799169303666092","commenter_b":"I'm still waiting to hear how sexual relations not involving vaginal Intercourse is not responsible and can't prevent pregnancy if you aren't ready for a child. Allllll ears, lol. Time to find a safe place for you, you can't handle the truth.","commenter_a":"I am 66 years old and I am sick and tired of old white men trying to rule my reproductive life and that of my daughter, and now of my granddaughter. NOT ON MY WATCH.","post_message":"Do you agree with Rachel Maddow? We definitely do."},{"comment_id":"10156746539145354","commenter_b":"Is she a horse of a different color? By looking in her mouth I would say this nag is pretty old herself.","commenter_a":"Wow! Maybe someone should check if she's a card carrying nazi. Hey Emma holocaust much?","post_message":"\"Either you wait for them all to die, or kill them off slowly.\""},{"comment_id":"10154218056967439","commenter_b":"The ones in the Muslim communities that haven't done anything are still in Stage 1......just wait until they move to Stage 2 & 3....it is in the Quran: @webpagelink","commenter_a":"Cameron what a d-------","post_message":"And do what exactly? Convert? Christianity is not the problem. How many murders, attacks etc will it take for these craven quisling to realize their appeasement and submission is not working? UK PM Cameron: \"Our brothers and sisters who are Muslims, they want our assistance.\" Uh, no they don't."},{"comment_id":"851989354991641","commenter_b":"This is America period,,,all states should ban immediately!","commenter_a":"KEep IT UP","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10155159081916159","commenter_b":"And those immigrants came into are country legally . These SOB coming in now are not. Your so dumb","commenter_a":"So much hate coming from a country that was built by immigrants. You wouldn't be anything without the contributions of so many people from other nations. SAD!","post_message":"Protestors rally in NYC for Muslim and immigrant rights"}]
