[{"comment_id":"607404219443285","commenter_b":"He's an idiot","commenter_a":"Then why in the hell did he get elected...twice?","post_message":"Delusional..."},{"comment_id":"10153745742861051","commenter_b":"GO HILLARY 1ST WOMEN PRESIDENT!","commenter_a":"Yes as long as it isn't clinton I don't really care as long as they are a good president and loves this country and the people who are citizens. She is only out for herself and wouldmake a horrible president she is to crooked .","post_message":"Trump has no problem with the idea of having a female president in America -- as long as it isn't Hillary Clinton. Do you feel the same way?"},{"comment_id":"1189532041066824","commenter_b":"only girls use pillow when they fight","commenter_a":"A pillow fight injured more than two dozen people????? Boy, are we ever ready for World War 3 if need be!!!","post_message":"UPDATE: A pillow fight at the United States Military Academy at West Point turned so violent that it caused concussions in 24 cadets, the superintendent of the school told NBC News on Saturday."},{"comment_id":"10153607403426323","commenter_b":"Actually the first vikings that came to the US we're killed on spot by the really Americans Native Americans so why don't you do ur damn history!","commenter_a":"German organization & German decency....so different from the horrible treatment & hateful anti-immigrant rhetoric coming from so many here in the US","post_message":"“We just wanted them to know that the torture is over.”"},{"comment_id":"10153953005567464","commenter_b":"Norma Pickford love your BS where you get it from? @webpagelink","commenter_a":"I trust you to do the right thing for America and the workers of America. Don't weaken. You keep doing your part and I will keep praying to the Lord to bless us with yo uh in the Whitehouse","post_message":"Politico reports Obama's Department of Labor is using H-1B foreign workers while many Americans are jobless. That is wrong. The H-1B visa program is broken and I have a plan to fix it: @webpagelink"},{"comment_id":"10153432969041037","commenter_b":"Liars too?","commenter_a":"History lesson needed here - the NAACP is and always has been open to people of all races/ethnicity for membership and leadership. This story is a non-issue.","post_message":"NAACP's Rachel Dolezal: \"We’re all from the African continent.”"},{"comment_id":"10151087068944999","commenter_b":"ALL ILLEGALS LEAVE AMERICA NOW!","commenter_a":"I wonder how many of them are legal immigrants. What's wrong with deporting illegal immigrants?","post_message":"On Thursday, foreign-born residents stayed home, or took to the streets, in protest of President Trump's immigration policies."}]
