[{"comment_id":"1784575138485488","commenter_b":"How would she know what honor is?","commenter_a":"Honor .... She doesn't know what that means........","post_message":"Clinton says she wants Trump to know what \"American honor\" looks like. What do you think about her speech?"},{"comment_id":"175417336287166","commenter_b":"#ShesWithStupid","commenter_a":"Are so called democratic people stating that they only want decisions via a democratic process to agree with their views? Is the USA on the verge of Facism and is this coming from so called Democrats.","post_message":"Protesters gather in New York's Washington Square Park to rally against President Trump's policies. Watch on #FacebookLive."},{"comment_id":"10153746096543984","commenter_b":"shut Obama down, stop paying congress until they do their jobs","commenter_a":"not a dime til this is resolved","post_message":"Obama has just announced the number of Syrian refugees the U.S. will take in, and liberals aren't too happy about it.   What do you think the U.S. should do about the Syrian refugee crisis?"},{"comment_id":"1717651245149172","commenter_b":"You're 100 % missing the point","commenter_a":"I love Bernie but these supporters are idiots. Throwing real money? How about using that money to feed the homeless and poor? Im sure Bernie would be just fine with that. I hate radicals. They do what they do for the spotlight and not for what's right.","post_message":"Well, this is certainly one way to get your point across…"},{"comment_id":"10157959432550354","commenter_b":"She belongs in prison. Trump for all Americans","commenter_a":"Poor behavior is poor behavior, no matter who does it! Teachers are now reporting a sharp rise in bullying and rude talking out and racist comments directed at other children after Trump began his campaign. If you are acting like an idiotic, alt-right Trump supporter at home, your children are seeing and hearing this and thinking this is how people should act. Stop it now! You are creating a whole new generation of haters.","post_message":"\"I believe they were paid to come attack Trump supporters.”"},{"comment_id":"447635222089017","commenter_b":"You are probably pro abortion cause you hate child support...","commenter_a":"This is great. You idiots that are against abortion are just that Idiots. Quite trying to take rights from Women . Plus Planned Parenthood doesn't pay for abortions. The client does. They provide health care. Get your facts right.","post_message":"JUST IN: A Houston grand jury investigating undercover footage of Planned Parenthood found no wrongdoing by the abortion provider but instead indicted anti-abortion activists involved in making the videos that provoked outrage among Republican leaders nationwide."},{"comment_id":"10150745246359999","commenter_b":"More difficult than jamming his shirt into his pants","commenter_a":"*Insert Fat Jokes Here*","post_message":"Governor Chris Christie must now cram his vast political ambitions back into a space the size of New Jersey."}]
