[{"comment_id":"10158014853220594","commenter_b":"Mariah Neu and @username. You both say the state of Illinois has lax gun control. In the city of Chicago, not the state of Illinois gun crime very high and so is gun control. Now to my point about Chicago and how gun control affects crime. It is stated that affectguns are imported into the city and these guns are used in the crime. If close carry by law abidi ng citizens was allowed in the city then law abiding could and would protect themselves. It should be of no surprise to anyone that a thug will not follow the gun law, but common citizens will. Gun control laws don't stop crime they just reduce the law abiding citizens ability to protect themselves. You folks use data about the state of Illinois, that has nothing to do with this discussion. Do a comparison of the city of Chicago and the ...","commenter_a":"As is often the case Oreily misses the point, the elites left are the the white spremest. The left just plain want control of all our lives. Taking all freedoms starting with gun ownership","post_message":"The Fox News anchor drew criticism after he said liberals' call to abolish the Electoral College is 'all about race.'"},{"comment_id":"10152779162447144","commenter_b":"shameless woman","commenter_a":"Send them back!","post_message":"These remarkable photos show the conditions that are driving the exodus to the United States."},{"comment_id":"600892556733313","commenter_b":"She should put in jail with all Males and stay with them 24/7/365","commenter_a":"So not only he is a kid, he is also special needs. And on top of all of this, she is 71 among kids ????! The school should re think abt the age of teachers dealing with kids. In late 30s and a woman can hardly handle her own kids !!!! Shame","post_message":"71-year-old teacher Amelia Stripling was arrested and charged with 2nd degree cruelty to a child after knocking over a pre-K special needs student in Georgia.  @webpagelink"},{"comment_id":"10150520498839999","commenter_b":"Sick woman. Sigh.","commenter_a":"WHO CARES","post_message":"The Rev. Dr. Martin Luther King, Jr. would be 86 today.   Photo: George Tames/The New York Times"},{"comment_id":"10154307345026729","commenter_b":"I am a liberal and I totally agree with the poster, so why are you irritated with liberals; your reasoning doesn't make sense to me.","commenter_a":"Or becoming traitors and taking over federal buildings!","post_message":"This will definitely irritate liberals and the 'coexist' crowd"},{"comment_id":"564500333698743","commenter_b":"Liz is either stoned or drunk on the kool aide.","commenter_a":"yeah right","post_message":"Hmm...gratitude was not exactly the word I had in mind."},{"comment_id":"10152811499753525","commenter_b":"Evil little monster! How would you ever trust her again!!","commenter_a":"as she should be charged.","post_message":"A Colorado mother says she smelled something different in her drinks on two occasions. She confronted her daughter about it. Now, a young girl is charged with attempted murder.   READ: @webpagelink"}]
