[{"comment_id":"1254986011246599","commenter_b":"@username, Hillary was pandering the liberal black voter.......sickening to say the least! Hang the bitch till dead.","commenter_a":"I sense a lot of vigilantes are going to start taking matters into their own hands, since Obama, of course refuses to acknowledge blacks are the problem.","post_message":"This is the nightmare we all envision when thinking about being stuck in a riot. What would you do in the same situation..."},{"comment_id":"10153129658039255","commenter_b":"Bring him down and send the drunk home!","commenter_a":"The dems and the President shoul not give in to his blackmail. Let them shut down DHS, send the National Guard and Reserve to the airports and train stations. Cancel planes and trains as necessary, especially those leaving out of or returning to DC. Let the seditionists suffer for as long as it takes...","post_message":"This is as good a time as any to bring him down."},{"comment_id":"10154992608754723","commenter_b":"Enter with a Visa is legal so what exactly are you talking about. This woman held in JFK work for US ARMY for 10 years in Iraq and this is how she gets paid.","commenter_a":"Cut this out, you want to come to America come in legally like my parents and siblings did. Be willing to work hard and respect American vslues","post_message":"Protesters gather at JFK airport to fight the refugee ban and detainment of refugees."},{"comment_id":"534767963372316","commenter_b":"HILLARY WILL TAKE OUR COUNRTY TO THE GROUND,ALL SHE CARE ABOUT IS POWOR","commenter_a":"In 1997, Donald Trump, who showed his personal courage by dodging the draft in 1960, had the gall to compare his heroism by sleeping with multiple women to the heroism shown by the brave men and women who served the United States in Vietnam. Interviewed by Howard Stern in 1997, Trump had the audacity to make the incredible claim that by risking his schlong to venereal disease from his sexual peccadilloes, his courage matched those who gave their lives facing mortar fire and bullets across the sea. Speaking of his sexual exploits, Trump bragged, been so lucky in terms of that whole world. It is a dangerous world out there. It scary, like Vietnam. Sort of like the Vietnam-era. It is my personal Vietnam. I feel like a great and very brave soldier.","post_message":"Crooked Hillary Clinton has lied from the beginning regarding her emails, and server. President Obama recently defended Crooked Hillary - saying she did not endanger national security. He also said ISIS was contained last year! Crooked Hillary will NEVER make America great again!"},{"comment_id":"953925358000546","commenter_b":"^^see Lisa....THAT'S good parenting.","commenter_a":"Thats messed up. what if the kid is actually struggling in school ? The dad should help him with homework and take his xbox away TEMPORARILY and see whats the kids real issue.","post_message":"This is a warning to all Xbox-playing students — do your homework!!!"},{"comment_id":"10157367896160725","commenter_b":"Everybody needs to pull together and get this corrupt woman out of sight , Trump is leading and lets keep it that way.","commenter_a":"Get that lying hag out of here! We need a leader not another criminal. TrumpPence16!!","post_message":"Thank you! #MakeAmericaGreatAgain"},{"comment_id":"1452171914802834","commenter_b":"The only thing Hillary Clinton is going to do is be the 2nd woman to run for president and loose.","commenter_a":"Go Hillary it's an excellent speech","post_message":"\"Now Donald J. Trump says, and this is a quote, 'I know more about ISIS than the generals do….'\" \"No, Donald, you don't.\" Read more of Hillary Clinton's DNC speech: @webpagelink"}]
