[{"comment_id":"1619826891648925","commenter_b":"'@username Killary's hips are evidently widening. Must be all the hot sauce and watermelons she stashes in her pants.","commenter_a":"Why I'm backing D.T., he's against the establishment, can't stand Obama & Hillary, called out lying Cruz, wants America first, he doesn't come from a political family, treats his 30,000 employees with respect, supports law enforcement, will put a border up, deal with illegals & radical muslims, doesn't act like a scumbag politician, he's not part of the 'Good Old Boys', helps military and families, great family man, very passionate about this country & the citizens, doesn't take BS from anyone and wants to Make America Great Again! #VoteTrump2016","post_message":"FLORIDA -- THANK YOU --- WE CAN WIN! Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"966234590136262","commenter_b":"Love this, her & Ann Coulter make me sick. Both need to go away","commenter_a":"She is like Ann coulter. Such people must be sentenced for a lifetime. Her intolerance is making me angry.She must be imprisoned.","post_message":"Pope Francis is furious."},{"comment_id":"1198210753566421","commenter_b":"She's a hack","commenter_a":"This isn't right. What is wrong with her?","post_message":"CNN HOST To Jill Stein: 'Have You Seen Any Direct Evidence That Anyone Hacked The Voting Systems In MI, WI And PA?'...'Um...no' [VIDEO]   And then there's that whole issue with one of the states that only uses paper ballots...."},{"comment_id":"10152659082871717","commenter_b":"And don't forget daughters who talk back to their fathers. They get stoned to death too.","commenter_a":"Here's an idea: since many want gays executed according to biblical law, how about following biblical law to execute adulterers, pedophiles, fornicators, tattoos, and et al?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"753100741547170","commenter_b":"That whore cares so much about the us she built a school in Africa!!!!","commenter_a":"Fuck that","post_message":"Obama Wants To Put Oprah Winfrey’s Face On The New Dollar Bill.  This is ridiculous. Leave the dollar alone.  Do you think they should get the dollar bill as it is?"},{"comment_id":"10153881396091336","commenter_b":"It doesn't take rocket science to figure out the motive","commenter_a":"But it was probably just workplace violence.... We just don't know...","post_message":"According to police, here’s what we know about the #SanBernardino shooting: @webpagelink • 12 pipe bomb type devices were found in the home at the center of investigation • All four guns were legally purchased • The motive has not been determined • There are no credible threats at this moment   According to the FBI, here's what we know about the suspects: •  Male came back into the U.S. in July 2014  •  Female came to the U.S. on a K-1 visa under Pakistani passport"},{"comment_id":"793075604079241","commenter_b":"Thank you SIR!","commenter_a":"Thanks, the GOP needs more people like you, Scott.","post_message":"I voted against the 'clean' DHS funding bill today. I will not compromise when it comes to our Constitution. President Obama has shown he has no regard for the principles our nation was founded on. If Congressional Republicans won't hold the line against this president, then who will?"}]
