[{"comment_id":"10153965474855579","commenter_b":"Oppose...no refugees, period.","commenter_a":"TAKE A LONG PAUSE.","post_message":"Syrian Refugee Program: Your Message to Congress? Support, Oppose or Take a Pause?"},{"comment_id":"10154300951236519","commenter_b":"But Hillary lost. There will be no Gulag.","commenter_a":"Boy, at least He can feel like he has clean hands as we are all marched into the Gulag. Very comforting.","post_message":"One elector defected so far, but not from Donald Trump."},{"comment_id":"463096490547598","commenter_b":"Yes","commenter_a":"yes, yes","post_message":"Should This Family Be Taken Off Welfare?  Comment 'yes' or 'no'."},{"comment_id":"1436165433143173","commenter_b":"We non-native people are all illegal immigrants. Nobody gave us permission to live here.","commenter_a":"Somebody needs to read History books this country was owned by Native American Indians (@username) we all are immigrants in this country","post_message":"This mother speaks for the millions of people who live in fear of Trump's deportation squads."},{"comment_id":"898000640266692","commenter_b":"True sir but he a bitch for that lol","commenter_a":"If he would have kept talking he could have ended up dead. People man have no chill, calling dude a bitch. He avoided confrontation!","post_message":"Cop Goes On A Major Power Trip After Being Asked A Simple Question!"},{"comment_id":"10157246765295294","commenter_b":"Deport this piece of crap!","commenter_a":"He can be charge with a misdemeanor for starting a fire with out a permit","post_message":"An expression of free speech? Or a crime? That's the debate sparked by this man's arrest."},{"comment_id":"10155249184754218","commenter_b":"How do we know, @username? Watching the hearings and seeing her incapable of answering questions. We know by looking at her past experience and seeing it limited to special interest. She has almost no relevant experience. Cabinet members are to be experts in their field, not solely a wealthy donor to republicans. This is not a try out situation. There is not a revote. Your assessment of Trump's hiring practices ignore what we've seen even during his campaign. He had to find new campaign managers three times.","commenter_a":"Who in his right mind would approve of her, doesn't matter if you come from the left or right, everyone can see she is unfit for the job","post_message":"Senators are expected to vote Tuesday on the nomination of Betsy DeVos for education secretary. She is expected to be confirmed, with Vice President Mike Pence casting a tie-breaking vote. Do you support or oppose her nomination? >> @webpagelink"}]
