[{"comment_id":"10153464723413734","commenter_b":"Take that child away from these monsters! Do NOT allow him back in that \"home\"!","commenter_a":"That's the kind of monster that deserves the death penalty.","post_message":"#BREAKING news out of Maryland.  The mom's boyfriend has reportedly been charged.  More details as they become available."},{"comment_id":"10154935119131753","commenter_b":"Ditch her now!!!!! She is the worst choice! All she has done is donate millions to the orange one!","commenter_a":"Senators McCain and Graham are probably already on his enemies list. Please do the right thing here!","post_message":"If a third Republican senator joins the opposition to DeVos, it may not only be unusual; it could be historic."},{"comment_id":"10156255899575147","commenter_b":"I agree with you. It could have went awry. Maybe the mother has some mental issues. Only God knows what was in her mind. One thing for sure though, its alive n has chance to be somebody. Not just an aborted baby thrown in a trash can or its innocent body parts sold on the black market. Evil comes in all shapes n sizes. One of them is planned parenthood.","commenter_a":"I'm glad she didn't abort the baby, but this is still a sad story. Calling it a \"selfless\" act, as this article does, is a head scratcher. \"Desperate\" maybe, but if anything, abandoning a baby without notifying anyone is exactly the opposite of selfless. There are safe havens in NY where she could have turned over the baby to actual people","post_message":"\"I followed the cries. I walked to the little nativity home we had installed inside the church… I couldn’t believe my eyes.\""},{"comment_id":"10157199868050354","commenter_b":"THE WALL, THE WALL, THE WALL........TRUMP 2016 !!!","commenter_a":"To our Canadian friends and partners. We know you watch the going's on in the U. S. sometimes even better than we do. The time is drawing near for this country to rectify its self. Please stand by and give assistance when needed to those involved. Thanks and good luck up there with your country. Hey.","post_message":"Wow."},{"comment_id":"707039379420654","commenter_b":"Shut DOWN Sanctuary Cities FUNDING","commenter_a":"NO STRIP TRUMP FROM AMERICA","post_message":"Trump should strip federal funding from sanctuary cities - Agree or Disagree?  For more videos like this, check out Opposing Views Video"},{"comment_id":"10154381959259062","commenter_b":"The woman is rubbing oil on her breasts and her baby and going viral with it. Who is the pervert? It's obvious she is!","commenter_a":"I think woman should also think about how easy it is for these pervs to get these pics for free off of your social media while exercising your right to expose your self feeding your child in public. Or even a perv sneaking a pic of you breastfeeding in public. While your child and your breast may end up on one of the sickening child molester sites.","post_message":"Officers found out about Felten when a Wisconsin man downloaded several videos and paid for them using a PayPal account."},{"comment_id":"10152775428266051","commenter_b":"Tell the Moms to buy it themselves.","commenter_a":"How low can you get.","post_message":"These moms decided to e-mail their daughters’ class and ask for everyone to pitch in for their birthday gifts. Here’s how one mom responded to that."}]
