[{"comment_id":"10153573127079268","commenter_b":"then get up lock n load and go fight..i dint want my kid dying for your stupid ass. Wordy @username","commenter_a":"'Republicans trying to find a way to go to war and make their sugar daddies happy.'","post_message":"The House is looking for a loophole."},{"comment_id":"10154056014236336","commenter_b":"I've heard liberals say that the Constitution is a living,breathing thing so many times! This is because they want to change America's FIRM laws to fit their Anti American agenda! Obama and the Anti American socialist judges do not have the right to make law! Thats how Obama's illegal Obama care was approved! I fear that our once free country is in grave jeopardy of being overrun by these evil Marxist! I think it will get so bad that people will be forced into defending their family s, themselves,their neighbors, their freedom,the Constitution and their Country in what ever means necessary! My God protect us!","commenter_a":"Guns and ammo.... Buy them now while you still can. God Bless America (what's left of her)","post_message":"U.S. Supreme Court Justice Antonin Scalia defended interpreting the Constitution as it was originally written and intended.  Scalia passed today after serving on the nation's highest court for 30 years. fxn.ws/1obcGnN"},{"comment_id":"10153662067420950","commenter_b":"Teresa you need a big fat,one stuck in your mouth so you can't talk but choke","commenter_a":"Trump's mouth is actually helping to elect Democrats in November. I wonder how many Republican leaders were meeting this morning and asking one another 'How in the hell can we shut this guy up?'","post_message":"'I'll say one thing about the Democratic Party,' Trump observed. 'At least they stick together.'"},{"comment_id":"1652238444998373","commenter_b":"White girl runs around in black face and its fine, yet if I were to do it the liberals would lynch my saltine american hindquarters.","commenter_a":"She went full retard","post_message":"Wait,... what?  @webpagelink"},{"comment_id":"1694209280599095","commenter_b":"Illegal aliens have to register for the draft as do green card holders and U.S. citizens or immigrants who are born male and have changed their gender to female! You want to see a run for the border, get a good skirmish started in NK and use a military draft to man it, you'll see the mad rush to leave the U.S. by freebie wanters.","commenter_a":"And ' The last person that wants to play the nuclear card...is me. But you can never take cards off the table ' - Donald Trump -","post_message":"'America's commitments to defending our allies remain iron clad.'"},{"comment_id":"502105753294821","commenter_b":"Leave bitch!!!","commenter_a":"Trump for president!","post_message":"We'll pay for your ticket..."},{"comment_id":"604736083067982","commenter_b":"Duuude, no he doesnt. He definitely and truly does not mean that. From the bottom of his good heart he really doesn't want people to support her fracking, wall Street, lying ass.","commenter_a":"Love ya Bernie but, not a chance in hell I will give that pos garbage my vote! Not like it matters anyway I have lost all faith in the US government and any honesty within.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
