[{"comment_id":"954543751267694","commenter_b":"First of all she did NOT hit the officer first.. He had his arm around her neck before she hit the arm he had wrapped around her throat.. That's a natural human reaction.. Before HE touched her, she was seated in a chair","commenter_a":"Does anyone notice the difference?","post_message":"#AssaultAtSpringValleyHigh: The SC school resource officer who slammed a teenaged girl on the floor was sued twice in federal court. Cops charged in fatal shootings reaches a nationwide high in 2015. #CoreyJones’ final phone calls may detail the moments before his fatal shooting. Check out these stories and more in today's edition of the NewsOne Top 5, our rundown of the viral stories that we are still talking about today. ------> @webpagelink"},{"comment_id":"487493421441238","commenter_b":"Get these terrorists out of our country.","commenter_a":"This being wrong is minor compared to the knowledge that someone, supposedly an AMERICAN allowed the demand of a group of visitors in our country to undermine one of the pillars of freedom that this country was founded upon. If our observances offend them , then we should at very minimum expect and get quid pro quo, their presence insults us, so leave, and don't come back.","post_message":"Muslims force this school to ban Christian holidays. America is under attack, we need to spread this. Do you agree this is wrong?"},{"comment_id":"10154211754086509","commenter_b":"Immigration, no; Illegal invasion, yes!!!","commenter_a":"I get that people are against immigration. But some of these comments go to show how Inhumane people are. Sickening. (Since people don't know how to read and have messaged me ugly things saying how I should take them in...I'm going to state that I agree with immigration restrictions but I do not agree with having them DROWNED or KILLED.) Jeez.","post_message":"A Polish teacher asked students to calculate how many Syrian refugees had to be thrown overboard for a boat to stay afloat and reach Greece."},{"comment_id":"472497066265507","commenter_b":"I believe she had a choice before the seed got mixed. so don't start the problem in the middle start at the beginning...","commenter_a":"AMEN","post_message":"Every woman is entitled to control over her own body."},{"comment_id":"946471268733575","commenter_b":"Sit down an be quiet Mitt!","commenter_a":"Trump is not my choice, but why do Republicans do this to themselves? And who cares what Mitt Romney thinks - he blew his chance and I do mean blew it!","post_message":"Donald J. Trump fires back at Mitt Romney's claim that there may be a \"bombshell\" in his taxes. @webpagelink"},{"comment_id":"10152627290331636","commenter_b":"should be run over by a merkava driven by a female israeli lieutenant. thirty times.","commenter_a":"To all the comments... No one support banding women from driving in saudi expect the foreign policy of UK, USA and france which insisted to aid every decision that made or will be made by barbaric and dictator royal family in saudi since 1940s,.... lets stop taking and read history... \"Knowledge-is-power\"","post_message":"The totally logical justification for a ban on women driving in Saudi..."},{"comment_id":"825004334282616","commenter_b":"do that and u'll have gallstone in ur bladder","commenter_a":"Dose this truly work?","post_message":""}]
