[{"comment_id":"1158452534233281","commenter_b":"All that fighting over an ugly fat chick?!","commenter_a":"White trailer park trash punks","post_message":"We doubt if just one person was to blame in this insane road rage incident caught on tape. But it's clear that this woman refuses to let it go.  And after pushing and pushing the other driver, she gets a wet blast she never expected.  And it didn't end there..."},{"comment_id":"1886562518248287","commenter_b":"She's turning them","commenter_a":"This is beautiful","post_message":"EAGLET WATCH!  Did you see one of the eaglets peeping through a hole in its egg?  When do you think it will officially hatch?  Let us know where you tuning in from and what name ideas you have for the babies!  Full story:  @webpagelink  Pix courtesy Southwest Florida Eagle Cam"},{"comment_id":"1362072713808008","commenter_b":"ROTFLMFAO!!! Opine from the woman actually wearing an \"A$$\" hat! You just CAN'T make this stuff up!","commenter_a":"The Judge is a lawyer for La Raza. He is literally a La Raza Grand Dragon.. He has literally helped many illegal immigrants break the law in this country. Donald Trump could go further and he didn't but when you start doing some digging this Judge doesn't seem like a very nice man. A lawyer for a group who has said many times to \"kill all white people\".. Okay.. Donald Trump could go further.. You may very well make him show his hand and there's a lot to show on this judge and the company he keeps. The ONLY racism here is of the judge and the people he represents. Imagine if the Judge was a KKK member presiding over a case that affected black men. You'd be outraged. You know you would. How is the Donald going to get a fair shake when the judge is soooo clearly biased ...","post_message":"By refusing to denounce Donald Trump’s attack on Judge Curiel for the racism it clearly connotes, it shows Senate Republican Leader Mitch McConnell is the poster boy for the Republican spinelessness that allowed Trump to be the Republican nominee for President of the United States.   Senator McConnell has so fully embraced Donald Trump that we are all unclear as to where Trump’s platform ends and Senate Republicans’ begins."},{"comment_id":"516205071910642","commenter_b":"The white lady isn't a part of the scam, but she made upwards of a million dollars in a year, okay ojay,we believe that the white woman's hands are clean, not!!!","commenter_a":"This a way to steal African children, a form of modern day slavery. African children was stolen from their parents over 400 years ago, and they were paid to do that then. What is wrong with you people?","post_message":"Watch How Thousands of Children Are Currently Being Stolen From Africa"},{"comment_id":"1096148677171405","commenter_b":"Trump should avoided all those snakes in the swamps.. They are traitors like Judas..","commenter_a":"No. No. Not at all!","post_message":"Question of the Day: Should President-elect Donald J. Trump trust people like President Obama, Al Gore, Rahm Emanuel and Mitt Romney?"},{"comment_id":"509597579189019","commenter_b":"Her Christ has lice...","commenter_a":"good, hope they all empty their bank accounts and go belly up","post_message":"Hate can make people do stupid things... - Andrew"},{"comment_id":"10154285238753984","commenter_b":"Dumb fucks.","commenter_a":"Yeah your baby sixteen not thirty???? but with a gun???? l bet he said before l'm a man a man he probably never said l'm a baby!!!! He pointed a gun at some cops you don't do that.If you point a weapon at someone it's to use it.And a good baby doesn't run from cops!!!! A gang member thug??? a baby???pleaseeeeee!!!! Over all it's sad when a young teen dies in this awful way. But you!!!! the parents of this teen is to be blame even charge with child cruelty for not teaching your baby respect since the beginning!!!! again it angry's me the ending of this young man!!!!","post_message":"A police officer chased the 16-year-old after he says the teen fled on foot from a car and then pointed a gun at him, which resulted in the shooting. Protests immediate erupt after eyewitnesses make this huge claim about the incident..."}]
