[{"comment_id":"470527006471213","commenter_b":"This lady thinks she is the president,this too shall pass just like her food for the kids at lunch time.","commenter_a":"I still want to know who elected the bitch","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10154531059061337","commenter_b":"Well there's the fact she acts like a cheap whore","commenter_a":"Really what is wrong with Miley Cyrus..? She got some serious issues & needs help...","post_message":"SHOWING OFF: Miley Cyrus didn't hesitate to full on make out with her Victoria's Secret girlfriend, despite the watchful eye of the paparazzi..."},{"comment_id":"10157007192550354","commenter_b":"But illegal aliens have Constitutional rights..yeah,she can go fk herself right about now","commenter_a":"tell that to chelsea you a hole","post_message":"\"...the Left is very energetic about inventing myriad rights for people who weren’t born in the United States or naturalized as citizens. How can the absolute denial of rights for unborn persons, whose parents are indisputably U.S. citizens, be logically squared with the Left’s zeal for handing out rights to foreign persons who just happen to be standing on U.S. soil?\""},{"comment_id":"10152604943386615","commenter_b":"Ladies*","commenter_a":"It depends on if you see someone at the gym wearing them, or someone at Walmart...","post_message":"Lawmaker says yoga pants should be illegal: @webpagelink"},{"comment_id":"510712935755721","commenter_b":"...via the food scraps from their Whole Foods trips found in dumpsters! Now I see the trickle!","commenter_a":"This sounds like a problem that a few more tax cuts for Billionaires will fix. It's really simple. You give ALL the $$$ to a few people, and then it just \"trickles down\", and eventually reaches the homeless.","post_message":"A 2015 report found that an estimated 44,359 homeless people live in LA County — a 12% increase since 2013."},{"comment_id":"10153837280246051","commenter_b":"@username I totally agree with you! If people would not hire illegals at the first place, illegals would not be in the USA!","commenter_a":"The end! \"Beating the system\", fucking seriously! There is a system for a reason. How many people do it the right way and how many are unable to do so because of people like her and her family \"beating the system\"! Her scholarship should be revoked!","post_message":"This Yale-bound valedictorian stood in front of her entire school and made an announcement that stunned everyone:"},{"comment_id":"10153699132454060","commenter_b":"Do you mean the hate speach espoused by the feminist campaigners? Such as the hashtag killallwhitemen and maletears","commenter_a":"hate speech is hate speech. We must identify and stop it.","post_message":"“Just because you lop off your dick and then wear a dress doesn't make you a fucking woman.\" Hate speech or just offensive? Cardiff University students think the former"}]
