[{"comment_id":"10155761644675725","commenter_b":"The employee should of knocked that bitches teeth out","commenter_a":"Kristin Nugent Grigsby","post_message":"A woman has been arrested after allegedly biting a Macy’s employee over a Michael Kors handbag ---> @webpagelink"},{"comment_id":"10154855250569062","commenter_b":"please name a book that would represent all citizens lol come on now. Tennessee is like 81% christian so i think the book works fine @webpagelink/ it represents the people not the government, so there is your seperation :P","commenter_a":"Even when I was an atheist, the bible was a good read. Some of them just need to get their head out of their butt to look at things objectively.","post_message":"Good idea? Bad idea?"},{"comment_id":"10157270600175389","commenter_b":"Wow... she sure lost her dreadlocks for her 10 minutes on Hannity didn't she!","commenter_a":"Love how she went from braids to foxy diva afro overnight. That's all I got from her. Yawn.","post_message":"\"I don't believe in any cause that takes innocent lives, regardless of what that cause is.\"  Former Miss Alabama Kalyn Chapman James, who referred to the Dallas shooter as a \"martyr\" in a now-viral video, said she believes Micah Johnson thought he was dying for a cause, but was \"evil.\""},{"comment_id":"10152557601575950","commenter_b":"Well they can't come back and tell the others that there are no virgins","commenter_a":"French terrorist ? I never heard viva la France during a plane hijacking and if I hear Allah Akbar I'm knocking that son of a bitch out","post_message":"There is evidence the three dead suspects -- brothers Said and Cherif Kouachi and grocery store gunman Amedy Coulibaly -- knew each other and shared common ties with known terrorists."},{"comment_id":"10153008527037894","commenter_b":"Women can preach, but I don't feel like doing bible study to prove it.","commenter_a":"I thought the bible said that women weren't allowed to preach...","post_message":"Watch: Distraught ‘Christian’ Lady Loses Her Everlasting Mind Over Marriage Equality [Video]"},{"comment_id":"481049412085639","commenter_b":"Send her ass back over there fucking trader.","commenter_a":"Hate it!!!","post_message":"A woman who left home to join ISIS just got served up some karma.  Good. Anyone supporting ISIS is a traitor to America.  Click 'LIKE' if you agree!"},{"comment_id":"1189205214435858","commenter_b":"Go suck or the black dicks racist bitch","commenter_a":"Look black on black crime is the number death rate among blacks! They need to talk to each other. They also need to fix their family unit, that's how young kids make it in life!","post_message":"#BlackLivesMatter were not happy with this speech"}]
