[{"comment_id":"10153614155549117","commenter_b":"@username you seem perfectly willing to dismiss the notion that the unborn have rights. I have no idea when to legally call a fetus a human. If a pregnant woman is beaten and loses her child is it simple battery. I don't know. When I was young I learned hunting and gun safety and rule one, you don't shoot at noise, a rustle in the bushes. Why not? Because there is a chance it may be a person. A real libertarian solution would be upon finding out she is pregnant she must claim she doesn't want to take care of a child and surrender right to it. If someone else is willing to take that child and be legally responsible for it then it gets rights and she needs to take personal responsibility (libertarian) and not be aggressive towards the fetus and turn it over on delivery.","commenter_a":"The best thing libertarians could do is reexamine their approach to abortion as their current stand favors personal privacy over personal responsibility and non aggression. Another possibility is to slightly widen the area we need to defend, to treaties,in order to be safe at home. Remember, economic liberty is the most important issue.","post_message":"John McAfee: \"The truth is this year at least there's maybe a 0.005 percent chance that any candidate on this [L.P.] stage wins the election. If we don't, if we get 20 percent, I promise you, if we don't do something to win in a real sense, this world is going to collapse.\""},{"comment_id":"10154209676831336","commenter_b":"Carolyn Ann Banet shut up hoe","commenter_a":"Women are dangerous, no matter what species!","post_message":"Yikes!"},{"comment_id":"1101968433174725","commenter_b":"Okay? That doesn't mean he wasn't talking to all Americans in this quote.","commenter_a":"He was actually talking to the wealthy in America with that phrase. He was about to raise their taxes.","post_message":"BOOM!"},{"comment_id":"10153196800261051","commenter_b":"Shut up you bitch! !","commenter_a":"I thought for sure she would want to be a Ferguson protester!","post_message":"Michelle Obama was asked a simple question: If you could have any other job in the world, what would it be? Here's her response."},{"comment_id":"690460261111351","commenter_b":"spelling lady...... come on now.","commenter_a":"I think I will get off here and work. Better than listening to his lioes","post_message":"Watch LIVE as President Obama speaks at a town hall at Fort Lee. Do you know someone taking part in the event?"},{"comment_id":"412948288893465","commenter_b":"An ugly skank. . . . living off tax payer money!!!","commenter_a":"POS !","post_message":"They just exposed the disgusting hotel bill Michelle Obama ran up in Cambodia... this is inexcusable. Hardworking Americans deserve better than her."},{"comment_id":"10155177965959050","commenter_b":"MAN HATER. EVIL WOMAN","commenter_a":"Disgusting.","post_message":"The anti-Trump Women's March featured a woman who kidnapped a man and then tortured him"}]
