[{"comment_id":"894598347242254","commenter_b":"She needs to keep the hell out of our city schools.","commenter_a":"From what I see in this pictire, Moochelle is describing how to succeed in politics the Lewinsky way! ROFLMAO!","post_message":"The Food Police!"},{"comment_id":"10154413356958701","commenter_b":"Well that sounded racist against whites to me ALLLLLL LIVES MATTER IF U R BREATHING THAN U MATTER EVEN THE DECEASED MATTERS WE DONT FORGET ABOUT THEM SO EVERY BODY AND SOUL WHETHER ALIVE OR DEAD MATTERS SO STOP THE HATRED","commenter_a":"Scary! Those dens of racist hate are all over the country.","post_message":" do not say police lives do not matter, we do not say all lives do not matter, said Right Reverend W. Darin Moore. we do not apologize that we boldly say, and unapologetically and uncompromisingly declare, black lives matter."},{"comment_id":"1486825354715718","commenter_b":"Thank you","commenter_a":"The judge then goes through the charges and dismisses the girl, to which she smugly replies, “adios!” He orders her to come back for the way she left, then increases bond for her charges from $5,000 to $10,000. “Are you serious?” the girl asks angrily, before saying “f-- you!” to the judge and storming off. She is then ordered to return again, and the judge becomes furious with her attitude. “Did you say ‘f--- you’? Did you say that?” the judge asks. “Yes sir, I did,” the girl responds. “Oh you did say that?” the judge replies. “I find you in direct criminal contempt. Thirty days in the county jail.” The video from 2013 went viral, with many praising the judge’s decision to punish the girl for her harsh words and attitude towards him.","post_message":"A judge thought he misheard what this teen girl said to him, so he asked her to repeat herself. She did. When he realized he hadn't misheard, the judge issued a response that the teen girl wasn't expecting."},{"comment_id":"10157271699240354","commenter_b":"sure take foreign money and rule with foreign masters LOL NO way you fool.","commenter_a":"No you don't, it's payola, play for pay!","post_message":"WATCH Hillary Clinton's hatchet man, David Brock, concede 'Clinton Cash' is no conspiracy book and discuss how the Clinton Machine is hunkering down for Donald Trump's big Monday 'Clinton Cash' speech on Hillary's self-enrichment through the Clinton Foundation..."},{"comment_id":"557979804384534","commenter_b":"@username I totally agree, how can she not see that??","commenter_a":"If it makes you feel better, I'm ashamed of your actions too. Disgusting.","post_message":"Jaelyn Young broke down in heavy sobs at sentencing, saying she was ashamed of her actions."},{"comment_id":"1025513424232102","commenter_b":"THAT BITCH NEVER HAD A MIND","commenter_a":"Who's gives a fling f--k what these assholes say .nobody watches that so called show anyway.get ready to pack bitch","post_message":"I think I can see steam coming from her ears! @webpagelink"},{"comment_id":"908657265920023","commenter_b":"I remember when NASCAR used to be a great sport. You screwed it up Brian. You should've a politician. You took a gold mine and destroyed it. Take a look at the last Bristol race.","commenter_a":"Stopped watching Nascar when Dale died, not surprised at all.","post_message":"Will NASCAR fans support NASCAR chief Brian France's \"behind the scenes\" political efforts on behalf of the transgender bathroom movement?"}]
