[{"comment_id":"1122113947823699","commenter_b":"Her feet are dangling fucking idiot","commenter_a":"And when exactly does he lift her and smash her against the car? Fuckin race baiter, who runs this page yo? Its gotta be a black person, racist bitch","post_message":"He LITERALLY lifted her off the ground and smashed her little body against the car! We just received this, will have more details soon."},{"comment_id":"10152886018669091","commenter_b":"Jaaajaj buena idea","commenter_a":"She can move to another planet . I really dont care","post_message":"\"If this happens -- I am moving to Canada. The CEO of a company is getting attention for a controversial Facebook post, where she says that female shouldn't be president.\" Here her reasoning: @webpagelink"},{"comment_id":"1573366636056793","commenter_b":"LOL And people trust this bitch. LOL Good little sheep BBBBAAAAAHHHHH","commenter_a":"Why this isn't on the headline news?","post_message":"She used the racial slur over and over and over..."},{"comment_id":"10153692085070950","commenter_b":"There was a story not long ago of the White House sending out a million Green Cards to illegals. About a year ago there was a story on Obama sending out a million US citizen applications to green card holders.","commenter_a":"The story CBS did on Brexit tonight was horribly biased. The reporter all but predicted the end of the world (Communism). How better to get America to join the EU, than to bring us to our knees with Obama flooding the homeland with Mexican and south American (illegal alien) nationals? Low skilled labor and low information voters go together like Obama and Muslims. A match made in economic and cultural Hell.","post_message":"U.K.'s withdrawal from the European Union is already causing economic and political upheaval -- so what happens next?"},{"comment_id":"10157139733295354","commenter_b":"\"Lets bring in 1000's of Muslim refugees\" Sincerely, Libtards of America","commenter_a":"Have you seen this on BBC today ?????When Donald J. Trump offered to make Sadiq Khan an \"exception\" to his ban on Muslims travelling to the US, here's how the new London Mayor responded.","post_message":"***BREAKING***"},{"comment_id":"1193853800707672","commenter_b":"Cause she's a lesbian LMAO","commenter_a":"i blam obam lol","post_message":"She has the most pro-LGBT platform ever. Here's why."},{"comment_id":"1718297721743930","commenter_b":"Lmao","commenter_a":"Lmao....stupid. but let's give them $15 an hour @username @username","post_message":"PRANKSTER: Someone called a Minnesota Burger King and convinced employees there was a gas leak - and they needed to smash the windows to release the pressure. So they did. STORY: @webpagelink"}]
