[{"comment_id":"845581582242351","commenter_b":"Dyson is a racist pig ! Don't let the media try to take the spotlight off of Hillery ! She is the CRIMINAL !","commenter_a":"The pits of academia!! But good students will learn despite him.","post_message":"This outburst would be laughable if you ignore the fact that he's a 'respected' professor who gets to go on TV and say this."},{"comment_id":"826031280920782","commenter_b":"She's just disgusting to look at..","commenter_a":"About time now she can pack so she can leave !!#!!","post_message":"Liberal trash has no place on tv.  This is the best news all year.  Do you think Whoopi deserves to be kicked off the air?"},{"comment_id":"10152627900846680","commenter_b":"We need to get rid of lowlife like Amy Klobuchar and her fellow treasonous, America-hating Democrat scum...Loretta Lynch is proving she'll be another Holder...we don't want nor need her to continue breaking laws for Barry O.","commenter_a":"The now extreme right GOP, are now preaching that all democrats/Liberals are lawless. Ted Cruz as a the son of an exiled ultra conservative and enraged anti-Castro Cuban, was brought up to think by his father, that all Liberlas are Communist and are out to overthrow the US government. I quess according to the GOP and Ted Cruz's definiton of Liberalism, which he defines as lawless, John Locke, one of the fathers of Western liberallism, who inspired the writers of the American Declaration of Independnece like Thomas Jeffersen, were all lawless! If this is true who is then lawless...","post_message":"Sen. Amy Klobuchar: 'So why has her nomination languished for nearly four months — longer than any nominee for attorney general in recent memory? And why have senators like my colleague Ted Cruz insisted that she is somehow lawless?"},{"comment_id":"10152630103907894","commenter_b":"Ladies love you to death but clearly you are being unfair in this matter 70 to 80 percent of custody battles in this country land in your favor whether the father is fit or not whether he is financially stable or not so for you guys to be sitting here some type of quote unquote outraged about this is ridiculous. knock it off.","commenter_a":"Some women needs to be careful who they sleep with","post_message":"Ludacris Wins Primary Custody of His Daughter"},{"comment_id":"1332532336775650","commenter_b":"Trump 'Hillary is a Bigot' there you go! This is exactly where this phrase came from~ the Pot Calling the Kettle Black. Okay you Mexicans can stay in the US , But must pay, I will Not build the Wall, Mexico will not have to pay for it , I Love the Mexicans, my African Americans, Muslims and attractive women... I was only Joking, being sarcastic, just a suggestion. I love Rachel Maddow! ha","commenter_a":"I think it is hilarious the Trump supporters come to a Hillary site and post their idiotic remarks. Like their posts have any meaning or validity. It's not like they are going to have any affect on changing Hillary supporters minds.,","post_message":"8 things you can do *today* to help elect Hillary: hrc.io/2bQizDc"},{"comment_id":"10158282673955294","commenter_b":"Today????????","commenter_a":"Does this mean Chris Jericho, aka Y2J, has been signed to a lifetime contract with WWE? If not, they're stupid idiots!","post_message":"A group of scientists have moved the 'Doomsday Clock,' a symbolic countdown to the end of the world, to two and a half minutes to midnight."},{"comment_id":"1014349388612957","commenter_b":"931389766893258R931389766893258o931389766893258c931389766893258h931389766893258e931389766893258l931389766893258l931389766893258e931389766893258 931389766893258C931389766893258h931389766893258a931389766893258r931389766893258l931389766893258e931389766893258s931389766893258","commenter_a":"931389766893258C931389766893258a931389766893258r931389766893258l931389766893258e931389766893258t931389766893258t931389766893258a931389766893258 931389766893258S931389766893258t931389766893258e931389766893258w931389766893258a931389766893258r931389766893258t931389766893258 931389766893258y931389766893258o931389766893258 931389766893258c931389766893258o931389766893258m931389766893258e931389766893258 931389766893258l931389766893258o931389766893258o931389766893258k931389766893258 931389766893258a931389766893258t931389766893258 931389766893258t931389766893258h931389766893258i931389766893258s931389766893258 931389766893258b931389766893258s931389766893258","post_message":"Slavery Happened A Long Time Ago?  Scientist Are Now Saying the Trauma May Be Encoded In The Genes of Black People"}]
