[{"comment_id":"10153358341224726","commenter_b":"She need to get out of there","commenter_a":"the mayor of Baltimore is what you have a news conference but she cant handle a news reporter how did she get the job ,WE ALL KNOW ????????????dumb. .","post_message":"WATCH: Baltimore Mayor Snaps At Fox News Reporter for Asking Questions"},{"comment_id":"777311705792740","commenter_b":"FUCK YOU BITCH!!!!","commenter_a":"What a tool.","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"1077262612359760","commenter_b":"She is just nasty.","commenter_a":"That's how classy the liberals are.","post_message":"Today in 2015: Rosie O’Donnell: “I’d Like to Take My Period Blood and Smear It All Over [Pro-Life People’s] Faces”"},{"comment_id":"878409832218766","commenter_b":"Too lazy to be princess! Punish her to work at Royal Household!","commenter_a":"Like mother like daughter","post_message":"‘Scrounger’ Beatrice’s three holidays in a MONTH"},{"comment_id":"996887350366269","commenter_b":"Democratic Presidential Debate CLINTON vs SANDERS --- @webpagelink","commenter_a":"I drove 4.5 hours to Flint, Michigan, this week from Toronto, Canada, to volunteer my time on the @username campaign in the days leading up to the Michigan Primary. The people who work in Bernie's Flint office are passionate people with a strong desire to change America and help the people of Flint. I have actually never seen such an example of government neglect in my life. I spent a significant amount of time handing out water, door to door, and I still can't shake the feeling of being helpless - I felt helpless that I couldn't do anything to help them and I felt even more helpless that no one else was doing anything to help them either. I am not an American, but I know that America is better than this. No civilized society should allow hundreds of thousands of their own people to be neglected and abandoned ...","post_message":"The governor of Michigan must resign, but more importantly we must take action to help the people of Flint. Children in America should not be poisoned. The federal government must act. No one should pay a water bill for poisoned water. #DemDebate"},{"comment_id":"10153210976889726","commenter_b":"The love affair begins","commenter_a":"How much are the promises he made going to cost us this time?","post_message":"WATCH: Obama and Castro sit side by side!"},{"comment_id":"10153620963073984","commenter_b":"When will Americans wakeup to the fact that Hillary is for Hillary and she don't give atinkers damn about anyone else!!! She BITCH!!","commenter_a":"Who in their right mind would vote for her???","post_message":"As cynical as I may be about politics, I just don't see how Hillary can survive this avalanche of scandals.  Do you think Hillary is destined for the ash heap of history?"}]
