[{"comment_id":"10152993022307217","commenter_b":"We really don't like immigrants here. Go back to your country, HitchBOT! Stop stealing American jobs that nobody wants.","commenter_a":"I'm very sorry it happened. I wish we could have done a well as everyone else. It would have been awesome if we could have sent to Australia.","post_message":"HitchBOT crosses Europe and Canada but is smashed to pieces in the US"},{"comment_id":"10153799327541336","commenter_b":"He was not hitting her I hope.she spends years in jail,she could have killed that officer","commenter_a":"Got Her.","post_message":"A woman used her car as a weapon and knocked over an Auburn Hills police officer to flee a traffic stop. Breianna Smart was caught and arrested."},{"comment_id":"876368172456238","commenter_b":"You are so foolish. You must be a Hillary supporter? That nasty woman has direct ties with Monsanto. Do you realise that? She is one of the biggest crimals you could ever imagine. Put Google to good use and research just how evil Hillary really is.","commenter_a":"Amen!! Thats how you hurt a man with money right in his pocket. I had told myself i was not going watch nothing with his name on it.","post_message":"Kudos to NBC for doing what's right!  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152732363406051","commenter_b":"...women who don't have vaginas? WHAT?!?!?!","commenter_a":"If he has a pussy and she has a pecker you call them 'heshe's! If he has neither a pussy or a pecker and she has neither a pecker or a pussy you call them awfully damn horney! In Another vernacular you might just call them freaks of nature! Them the question is what do you feed them? One thing is for sure! They won't reproduce!' Put them in a side show at the fair. Pay your money, go in, hoot and holler, laugh until you pee your pants. Now got to work Monday morning telling everyone what you did and saw! Then you will find out who the real freak is!","post_message":"This all-women's school will no longer perform the 'Vagina Monologues' because it doesn't want to offend women who don't have a vagina."},{"comment_id":"10153630304246509","commenter_b":"Guess you've never heard of Irish-American clubs. Guess you've never heard of Italian-American, German-American, Polish-American or perhaps people celebrating their ethnic heritage. So apparently pride in one's ethnic origins is not extended to Black Americans. What is the name Rush? English? I'm betting someone in your family came over on the Mayflower? Proud of that? Why not? Apparently if you were taken against your will in irons on a slave ship you also lose your ability to take pride in your heritage as well?","commenter_a":"There is no such place as \"Africa-America\" therefore there is no such thing as an \"African-American\". They are either Americans or they are Africans. Not all blacks come from Africa and not all Africans are black. Why don't they try and be American's for once in their life's?","post_message":"After recording an ode to Baltimore, #Prince has announced a Mother's Day rally and concert there. Concertgoers are invited to wear something gray: @webpagelink #FreddieGray"},{"comment_id":"10155082864963690","commenter_b":"India and rape can't seem to stop. :(","commenter_a":"indian armies ..............thuuuuuuuuu........","post_message":"\"Victims gave the names of the policemen involved in the barbarity - but nothing has happened.\""},{"comment_id":"10152731629721051","commenter_b":"Kids should never be returned to this evil woman and she should do years in jail.","commenter_a":"Why Don't these nutty individuals just take themselves out and leave others alone !","post_message":"This mom threatened to beat her kids if they didn't drink the apple juice she gave them. The next day they were rushed to the hospital."}]
