[{"comment_id":"10152814946648822","commenter_b":"Should have been three to six YEARS ! This woman is NUTS !","commenter_a":"I love the people on here, who claim to be about humane treatment of animals; but, they want this woman to get beat to death, while in jail. Hypocrites.","post_message":"The woman accused of stealing and euthanizing her neighbor's dog is headed to jail. Today she was sentenced to 3-6 months for killing the husky named \"Thor.\""},{"comment_id":"659700944220484","commenter_b":"yes beat her ass for being arrogant","commenter_a":"REALLY,??","post_message":"This entitled woman just demanded a free drink... Because of slavery? This is absolutely ridiculous. We owe her nothing. Should she be compensated for slavery?"},{"comment_id":"1418467401509379","commenter_b":"These could be conservative witches. You never know","commenter_a":"Liberals have lost their minds. Smh. Even the conservative didn't get this stupid.","post_message":"\"You don't have to believe in 'magic' to believe in the power of intent and community.\""},{"comment_id":"1185052468202276","commenter_b":"@username . Yes, it has worked out very well for me. My wife doesn't just not mind, she really likes my beard. As for the women \" that do were and are not interested\" in me- I couldn't care less, they are irrelevant. I have a beautiful wife. You are right in that everyone has physical preferences, I for one am not attracted to women with silicone breasts and/or mullets. Perhaps one day soon, when you hit the menopause, you might grow yourself a fine, full beard and be proud of it. All the best!","commenter_a":"If you can grow a beard, then why not? I really couldn't care less if someone finds my beard unsightly. You should be proud of your masculinity, not try and disguise it. I spend most of the daylight hours outside, the beard helps protects me from the elements and from those of a nervous disposition.","post_message":"Just one more reason to love beards!"},{"comment_id":"10154874885608796","commenter_b":"Drain the swamp!","commenter_a":"Yates used no integrity because she took an oath of office to obey the law. Same as Lynch did. Both should have been fired no just one of them.","post_message":"Former Attorney General Loretta Lynch praised now-fired acting Attorney General Sally Yates for her “unshakable integrity” in refusing to defend President Donald Trump’s executive order putting a pause on travel from terror-ridden countries."},{"comment_id":"10155183414820725","commenter_b":"A whole alot of whores","commenter_a":"He's an attention whore!","post_message":"Remember when Kanye interrupted Taylor Swift at the 2009 Video Music Awards? Well, he rushed the Grammy stage last night, showing off his sense of humor and impeccable timing: @webpagelink"},{"comment_id":"10153042394211800","commenter_b":"Actually, the comedy part means the extreme feminists are being mocked...","commenter_a":"Gotta say I was very disappointed in this whole segment. Not because it was offensive or anything, but because it seemed to take what is clearly an issue (people taking up too much space on the subway) that can be caused by *both genders* (not just men) and acted like men were silly for thinking the ads were sexist by only targeting men. How much outrage would there be if there were a series of ads specifically targeting women for doing something that both men and women could do? Food for thought.","post_message":"\"Occupying all the territory you can is sexy. When I'm on a subway car with all those men taking charge of the seats around them, I get so weak in the knees that I can barely stand. But I have to.\" -- Kristen Schaal ► Kristen Schaal defends the right for men to spread their legs and take up two seats on the subway: @webpagelink"}]
