[{"comment_id":"10154467699462675","commenter_b":"Let's be clear to all Trumpicans about at least one thing: not all terrorists are or have been Muslim. America isn't the only country to be attacked by terrorists. Terrorists have one thing they all share, they're Terror-ISTS","commenter_a":"guess what, you should leave too. you are an imagrant. give this country back to its rightful people, the native indian. !!!!!!!!!!!!","post_message":"British Foreign Minister Boris Johnson addresses parliament on President Trump's immigration policy. President Trump's executive order bans U.S. entry to migrants, refugees and green-card holders from seven predominantly Muslim nations."},{"comment_id":"10153015715557452","commenter_b":"Why leave him alone???? He is an admitted rapist! !!!!","commenter_a":"Leave Pill Cosby Alone.","post_message":"Three more women who were allegedly sexually assaulted by Bill Cosby came forward during a press conference Wednesday, bringing the number of accusers up to nearly 50. abc7.la/1N4Pq51"},{"comment_id":"10152948975362434","commenter_b":"SHUT UP BITCH","commenter_a":"Oh I think I don't need to post my thoughts as just the last two comments from Shoshana and Kelly do it for me. But - who the hell does she think she is anyway?","post_message":"Of course she is."},{"comment_id":"10153131166411051","commenter_b":"Muslims, get out of our country, go to where you are sickheaded and treat others like dirt..we don't want you here..you are sick and so disrespected..we can't stand you or your way of thinking.","commenter_a":"I'll continue to do things the way I normaly do. If you are offended by it then that's you're problem.","post_message":"A woman's painting was rejected because it might offend some Muslims. Decide for yourselves if there's anything wrong with the image."},{"comment_id":"10155842055160354","commenter_b":"F**K that Little C*nt , deport the little bitch immediately !!!!!!","commenter_a":"Maybe she should give back all those American dollars she has made from a country she hates so much.","post_message":"Not the sentiment America's past time was looking for..... WATCH the video and hear it for yourself...."},{"comment_id":"10154444925336336","commenter_b":"Hillary supports Islamic terrorist and their right to open borders. Will you continue to support such a wicked evil woman?? Vote Trump2016!!","commenter_a":"The JV team strikes again. How long before we hear Obama say \"religion of peace\"? I don't know how he says it with a straight face. #PrayforFranceAGAIN","post_message":"Sky News now reports that the death toll has reached 60 after a truck drove through a crowd celebrating Bastille Day in Nice. French President Francois Hollande has returned to Paris for crisis talks."},{"comment_id":"2040319902861153","commenter_b":"Trump dont controll the border walls he will make trouble here in border town n Mexico... we have crime here due to there here already the Cartels n Zetas in da USA in the border cities... USA build walls the always around or underneath or make ladder in the walls","commenter_a":"Wow. You hate waterboarding of terrorist and protest on the streets of America on their behalf. But the beheadings of American soldiers, christians and innocent civilians in the Middle East and nothing said on the streets of America. And you call yourself an American. Seems like the left is more interested in open bathrooms and open borders, hmmm?","post_message":"Wake up, America!"}]
