[{"comment_id":"10154474483213812","commenter_b":"Arrested for saving lives........?????? Your mother should have swallowed you.","commenter_a":"Why don't you take care of them too. He should be arrested for illegal immigration. Try and bring Mexicans through the US border and see what happens.","post_message":"Privately owned search-and-rescue company owned by American millionaire has saved 500 refugees and migrants at risk of drowning after only 2 days of searching."},{"comment_id":"10153550945636943","commenter_b":"No Syrian refugees....NONE!...call the Capitol...1-202-224-3121...follow instructions...Let them know you oppose Syrian refugees entering the U.S.. Took me 2 minutes...EASY!","commenter_a":"No","post_message":"Tom Fitton joins Fox News to discuss the danger Syrian refugees pose to the United States. Do you think Obama should allow thousands of Syrian refugees into our country?"},{"comment_id":"10153238433806782","commenter_b":"So you have no problem sharing a restroom with men? That's not how I perceive most women feel","commenter_a":"Oh for Pete's sake, does government really belong in the restroom???? Work on something that really matters! Schools, roads, infrastructure, the things government does belong. Are you going to post guards in every bathroom and have to check your \"plumbing\" to see what you are equipped with to make sure you are going to right one???","post_message":"A similar bill was filed in Oklahoma: @webpagelink"},{"comment_id":"10157872915845354","commenter_b":"Sadly, anyone can be an American these days, just run across the border or call yourself a refugee. Too many problems...","commenter_a":"I'd prefer \"firearmS\"","post_message":"Amen!"},{"comment_id":"10154177327588984","commenter_b":"Don't want her anywhere near the White House.","commenter_a":"Lies more lies everytime she opens her corrupted mouth","post_message":"Hillary's campaign is once again doing damage control...  Is Hillary Clinton one of the last people you'd want to become president?"},{"comment_id":"10154478839956636","commenter_b":"@username without god, noone can hear you get shot. Your worldview is wuite hopeless. Without god, who will punish evil ppl then evil has won. Rofl","commenter_a":"They found the remains of velociraptor Jesus used to ride on.","post_message":"Incredible"},{"comment_id":"10156070915820354","commenter_b":"We all know what Jorge Ramos is full of !!","commenter_a":"No, sir you are a loud mouth rude, obnoxious piece of shit!","post_message":"Reporter?   Or Activist?"}]
