[{"comment_id":"1748972275334787","commenter_b":"Even if the woman was standing to pee, they are inside a stall with the door shut, Us woman don't peek under the stall to watch other woman pee...only pervs do that","commenter_a":"The thing that makes me LAUGH is people have most likely ALREADY shared a bathroom with someone who is trans and didn't even know it!","post_message":"It doesn't make ANY sense…  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153706069823717","commenter_b":"Best part about this is her age, she's not an 18 or 20 year old like most ad models.","commenter_a":"Oh thank heavens. The world is a safer place.","post_message":"People magazine has named Jennifer Aniston the 'World's Most Beautiful Woman' for 2016."},{"comment_id":"1029734007098210","commenter_b":"Poor old bitch. Still eat up with dumbass","commenter_a":"Cannot wait! This should be fun. Trump has his problems but hillary is such a liar that I hope she turns pknk.","post_message":"Democratic presidential candidate Hillary Clinton took aim at Republican rivals saying she is looking forward to debating with them about the economy if she becomes the Democratic nominee."},{"comment_id":"10152852200292014","commenter_b":"Dylan Crane its not domestic terrorism its a hate crime. He killed them because they were black. He didn't kill them for political or even religious reasons. So uh oh your ignorance is showing. ...","commenter_a":"Let's see he's not muslim, black, mexican, or asian so that means this will get written off as a guy with a troubled childhood and mental issues like always and quickly swept under the rug and no 'terrorist' or 'thug' label given.","post_message":"Dylann Roof, the suspected of fatally shooting nine people at Emanuel AME Church last night has been arrested."},{"comment_id":"899754210061920","commenter_b":"What do you care what she does or has? She doesn't have 2 brain cells to rub together!","commenter_a":"From what I understand, they don't drink alcohol at all. So I don't think she would fit in. Sad thing is that because of the alcohol and drugs she uses, she looks a lot older. I'm actually older than she is!","post_message":"Is Lindsay Lohan converting to Islam?    See what she was photographed holding."},{"comment_id":"10153260664437885","commenter_b":"Phuck that man cunt.","commenter_a":"I thought traitorous dogs got shot!","post_message":"Not a DuffelBlog....this is real"},{"comment_id":"1669850779963439","commenter_b":"Fat bastard","commenter_a":"Another big jerk, oh bye the way michael were not muslim","post_message":"CLOWN SHOW."}]
