[{"comment_id":"10153480105418132","commenter_b":"Who gives a crap about her boobs. Let em hang out if she wants, or cover em up. They aren't your tits.","commenter_a":"Too much boobs","post_message":"What do you think of JWOWW's wedding gown?"},{"comment_id":"10153090646372411","commenter_b":"omg it's getting old","commenter_a":"Madisen AndCody LMFAO! I'm not surprised are you?!?","post_message":"BREAKING NEWS: Chicago Bulls Derrick Rose was injured in practice today after taking an elbow to the face.  He will undergo surgery tomorrow. \"After the procedure, a timetable for return to play will be determined,\" the team said."},{"comment_id":"10153867352421756","commenter_b":"No, it actually wasn't. Students were allowed to carry. The fact that students were allowed to carry may explain how the shooter got to the classroom carrying a long gun without being stopped. He wasn't doing anything illegal until the second he opened fire. Surprise, everybody!","commenter_a":"survived the army to be shot in college, go america","post_message":"It's emerged that the 30-year-old father ran at the attacker, trying to block the door to a classroom to protect his classmates — and suffering several bullet wounds and two broken legs in the attempt, according to his family."},{"comment_id":"10153294684803132","commenter_b":"This witch is EVIL!","commenter_a":"She should be charged with murder.","post_message":"\"When he actually started to carry out the act, he got scared again and exited his truck, but instead of telling him to stay out of the truck ... Carter told him to 'get back in.'\""},{"comment_id":"813299352038859","commenter_b":"You're ignorant whores on government programs. Stfu.","commenter_a":"This is her response. She would kill a newborn. Her OWN newborn even. Enough said.","post_message":"Thousands of protesters gathered at the US Capitol this week..."},{"comment_id":"10153301098933067","commenter_b":"Both ladies were very graceful","commenter_a":"Mr. Trump, you are really out of your ulo..... it was an honest mistake and it was acknowledged so, just move on..... better luck next time Miss Colombia... congratulations to all the contestants and the winners........ jmtc","post_message":"\"I'll tell you what I think I'd do. I think I'd make 'em a co-winner. It'd be very cool\" - Donald J. Trump @webpagelink"},{"comment_id":"10153554876193010","commenter_b":"Yes send them all back,","commenter_a":"Welcome to socialism.","post_message":"The children at this San Bernardino motel pay no attention to the meth dealers on the sidewalks. To the men in nice cars driving slowly through their makeshift play area scanning the doorways for prostitutes."}]
