[{"comment_id":"10157217624240354","commenter_b":"Send them to the Vatican you have walls keep them there","commenter_a":"Christians are in more danger than Muslims, that is the truth.","post_message":"Still no word on when the Pope plans to tear down that evil Vatican Wall surrounding his fortress and let all the \"migrants\" come flooding in."},{"comment_id":"1119467821481588","commenter_b":"Yay!!!","commenter_a":"Exactly his point!","post_message":"San Francisco 49ers quarterback Colin Kaepernick says he has received death threats for making his views known"},{"comment_id":"464432047077736","commenter_b":"Bye, Felicia....go to that other planet where NOTHING will be different. ...the More of you we get rid of here, the sooner We can straighten the SHIT YOU CAUSED out","commenter_a":"Secondhand rocket for hire. Use at own risk.","post_message":"Elon Musk called the rocket landing \"absolutely perfect.\""},{"comment_id":"10153010848717434","commenter_b":"Women have fewer children when they have excellent access to birth control. Education, free birth control and free condoms.","commenter_a":"We need to implement that policy here. If you're on any kind of public assistance, you can't be having more kids you can't afford to feed.","post_message":"The thing about demographics is you can’t just flip a switch."},{"comment_id":"10153051831985950","commenter_b":"WTF?! I would have knocked that bitch the fuck out if that were my child. And the so called DAD is a piece of SHIT too! They need to light her ass up in PRISON! >:(","commenter_a":"What?! I can't comprehend this... why,,,,","post_message":"Police say a stepmom bullied her now 15-year-old stepson: \"She asked me if I wanted to play the game,\" the boy said. \"And I said no. So then she called me 'punk,' so we did it. We went in the bathroom, she poured a whole bunch [of alcohol] on my butt and then she lit it on fire.\""},{"comment_id":"10153450529443352","commenter_b":"Livid??????? I would shut that MF down. ...Bastards","commenter_a":"Omg some one is responsible for this ok.who","post_message":"Mom Livid When Her 3-Month-Old Baby Girl Has Bruises on Her Face After Daycare"},{"comment_id":"10152885011267507","commenter_b":"Woman put up with it because we are use to it. Woman are also so busy and have not prioritized changing this. Women will eventually say enough of this nonsense and put a stop to it for good. It is only a matter of time.","commenter_a":"Women in other developed countries are getting treated better ! Why do American women take this abuse ? No paid maternity leave , no paid sick leave , no paid or very meager paid leave , WTH is wrong with American women demand it and demand it now!!!","post_message":"Let's be good to our mothers today and EVERY DAY!"}]
