[{"comment_id":"10154228017338797","commenter_b":"Girl I'm glad u werent","commenter_a":"'@username @username this actually happened at my job","post_message":"FLAP OVER FLAPJACKS: A Chicago woman has been arrested after police say an argument over all-you-can-eat pancakes got out of hand at Denny's."},{"comment_id":"1202081159878082","commenter_b":"Good one! Except I hope SHE would HAVE BEEN ABORTED LONG BEFORE NOW!","commenter_a":"So, I am reading that Hillary is really upset that the FBI is 'dumping' on her right before the election.... I want to say to Mrs. Clinton, 'So Hillary, how does it feel to be aborted 8 days before delivery?' Stole that comment, but it is awesome!","post_message":"The website announces it has moved to 'Phase 3' of its 'election coverage.' Here are the latest headlines. #WikiLeaks #Clinton"},{"comment_id":"10155634882296509","commenter_b":"'@username. Get the hell out of my country crybaby","commenter_a":"Do we have to tell President Cheeto not to 'grab her' ? Someone might have to tell him. I can't believe this is our reality now. Ugh. Sorry world. :-(","post_message":"The British government is considering whether to invite President-elect Donald J. Trump to the UK for a state visit in 2017."},{"comment_id":"513245565531981","commenter_b":"I rarely say bad things on fabebook , but she 's a real bitch.","commenter_a":"Coulter and FOX's best days are wayyy behind them. Here's hoping this ideology of thiers dies a slow death","post_message":"know what this convention really needed? An angry Muslim with a thick accent,' she said."},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"903785579812018","commenter_b":"OH BUT HE'S BLACK HE DON'T KNOW NO BETTER.SHIT HANG HIS ASS","commenter_a":"So sad","post_message":"She was shot down in cold blood and there were never any riots. This was a tragedy, and she will never be forgotten. Can we get 10,000 'LIKES' in her memory?"},{"comment_id":"10152549413699071","commenter_b":"So true, reason why women throw themselves on celebrities","commenter_a":"Healthy man not attracted womens .attrating gods grace","post_message":"The most valued trait in a potential mate isn't beauty or wealth."}]
