[{"comment_id":"596781463820482","commenter_b":"IF YOU HAVE A PENIS YOU DO NOT BELONG IN THE WOMAN BATHROOM! GIRLS NEED TO LEARN FOR THEIR OWN PROTECTION TO KICK A GUY IN HIS BALLS IF HE MAKES ANY MOVES TOWARD HER!","commenter_a":"Just asking for big trouble to start","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153852384658822","commenter_b":"Women wanted equal treatment in the military.. This makes them a little more equal. Be careful what you wish for you just might get it","commenter_a":"I had 3 sons and they all registered when they turned of age. I would have not wanted them to go but if I had a daughter which I don't I would not want her to be drafted and put in the position of getting captured. It is bad enough what they do to men when captured you can imagine what they would do to women before doing to them what they do to men. I do now have a grand daughter and a grandson. I hope neither of them ever have to go thru a war. I also hope everyone else's kids don't either.","post_message":"The Senate voted this week to require women to register for the draft.   What do you think of the change?"},{"comment_id":"958471064269672","commenter_b":"BUT.... FOR ANY SMALL REASON SHE CAN GETS SHARIA LAW...... NO BAD TO TRY...!!!","commenter_a":"Lindsey! Remember no smoking no alcohol no pork prayer 5 times each day etc. However there will be more than enough sex and just think you will replace several goats! This will make you very popular with peta!!!!!😎","post_message":"Dear Lindsay: Pay particular attention to the anti-women bashing bits and ... then smoke a cigarette and meditate whether or not you really wanna to convert. @webpagelink"},{"comment_id":"1023562641110247","commenter_b":"Conservatives can also be whiny. Like, OMG THE IMMIGRANTS ARE STEALING OUR JOBS OH NO I HAVE TO GO RE-TRAIN. I'M ENTITLED TO JOBS HERE.","commenter_a":"I don't know about my liberal comrades, but I went to work, paid bills, look after my kids, helped my neighbor fix his car, and drank. In fact I don't know a single liberal friend that did any of those","post_message":"It's a scary thought..."},{"comment_id":"10153912824075579","commenter_b":"This women reminds me of what I leave behind in the toilet!!!!! And It really stinks! FLUSH!","commenter_a":"Whatever her stylist is doing, keep doing it. Love that green leather jacket!","post_message":"had a pretty long day yesterday. Hillary Clinton addresses the DNC Women Leadership Forum.  Watch complete video from the event here: @webpagelink"},{"comment_id":"10153708694531955","commenter_b":"Stop all immigration","commenter_a":"Stupid people.","post_message":"Congress to vote on right of Muslims to migrate..."},{"comment_id":"1000660886660326","commenter_b":"Send her to Pluto to cool off!","commenter_a":"I bet her mother is sooooo proud...","post_message":"'I'm not really ashamed'"}]
