[{"comment_id":"1332904726749996","commenter_b":"It'll never happen - no minorities, no women. He would need 80% of all the white males in America to vote for him.","commenter_a":"This ad isn't even a reliable ad. It's a lying rag. Not been anything on news about this. So it's just another lie. Wake up idiots Trump will be President, no matter what so get use to it. Go Trump","post_message":"Wow...this isn't good for the Republican party."},{"comment_id":"10153907516071178","commenter_b":"Colbert is out of touch with reality","commenter_a":"Colbert and Koppel who ?","post_message":"It's like a liberal media love-fest."},{"comment_id":"997888900251582","commenter_b":"this lady is crazzy.","commenter_a":"The Amerikan Taliban.","post_message":"Hey you! You should go to church every Sunday! And the government should require it. Because America and morals and stuff."},{"comment_id":"10154713474904586","commenter_b":"GO VEGAN LEAVE ANIMALS ONE YOU EVIL PEOPLE","commenter_a":"I hope there is a hell, and the people who inflict this unspeakable cruelty on these poor helpless beings, burn in it for an eternity...lowest form of scumbag life on the planet..","post_message":"This is what \"shackle & hoist\" looks like."},{"comment_id":"1248098948547994","commenter_b":"When does he go back to court for fraud? Trump is no better than Hilary, they're both dirty.","commenter_a":"Oh come on Donald. Your shocked a rich, privileged, well connected, manipulative say whatever you want to hear white women got away with a crime. You should have seen this coming. Bill helped her out big time, guess we all have a price ...right Loretta?","post_message":"\"We have a rigged system, folks.\" Donald J. Trump addressed the FBI's Hillary Clinton   investigation while speaking in Raleigh, North Carolina. @webpagelink"},{"comment_id":"10154653727828812","commenter_b":"Don't Feed the Trolls","commenter_a":"Oblunder doesn't have a problem spending other people's money. A true Saul Alinsky Elitist.","post_message":"Ellen DeGeneres, Magic Johnson, NBA star Grant Hill, and Hollywood heavyweight George Lucas were among the party-goers at President Obama's blowout birthday bash at the White House Friday."},{"comment_id":"1016384461715898","commenter_b":"So stop your judgemental whining bitch","commenter_a":"Sorry mice, but as someone with crohns I fully support this research.","post_message":"Researchers have engineered small intestinal tissue from human cells, and when placed in mice, the transplants were able to digest and absorb like the real thing."}]
