[{"comment_id":"941193142664131","commenter_b":"Hope it blind the liberal bitch! LOL","commenter_a":"Get more of them","post_message":"Mace to the face = ouch. Did she deserve it? Did the old man deserve getting punched by her? And for a bonus for being nice I've added a video of a high protester doing a backflip and landing on his head. #theplacewecallthezoo @webpagelink"},{"comment_id":"517780028410290","commenter_b":"Send them to a boot camp along with their parents, they soon will learn respect! And cut off their welfare,so tired of supporting these aminals!!!","commenter_a":"THE BOY IS A PUNK","post_message":"INSANE..."},{"comment_id":"1139906406032404","commenter_b":"you are an idiot!! AND STOP KILLING ANIMALS!! They have souls too you creep!!","commenter_a":"Ok. So release the previous 5 years. That will provide an accurate picture of what to expect when the audited returns are ready for release.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"10153335574974384","commenter_b":"A complete waste of good female human flesh.","commenter_a":"Communist scum.","post_message":"Celebrating Women’s History Month by honoring women of 'Supreme' achievements! Indeed, an inspiration to us all."},{"comment_id":"10155007911979228","commenter_b":"Couldn't agree more. This is a global women's health issue and we put so many women at risk by this gag. Women will be dying from this order.","commenter_a":"Thankyou for showing positive leadership against these attacks on women's rights! This is the kind of action we need in DC right now!","post_message":"Two days after millions of women marched to oppose the new president's backward policies, he reinstated the Global Gag Rule, a federal ban that will directly affect a woman's access adequate healthcare in the U.S. and abroad. It's up to Congress to permanently repeal this dangerous rule and I've cosponsored the Global HER Act to end this outdated policy once and for all.  @webpagelink"},{"comment_id":"10152774422166051","commenter_b":"Why are some people allowed to have kids??","commenter_a":"Please, can we eliminate these sh*tbags from the gene pool?","post_message":"Police found this 3-year-old boy sitting in the backseat of a car in freezing cold temperatures. His dad and babysitter had something more important to worry about."},{"comment_id":"1211910735512691","commenter_b":"Duck you you racist old bitch","commenter_a":"Stop drinking you juice head.","post_message":"This racist woman went off on two Hispanic shoppers with a racist rant  and no one did anything to stop her.  More on this story here: @webpagelink"}]
