[{"comment_id":"1180631801992422","commenter_b":"THE wall is necessary","commenter_a":"Hell no!!! I don't want to see a big freakin wall between my state (Texas) and Mexico (with whom we've been friendly for a LONG time). Way to go, Trump...maybe you can start a war with Mexico 😠 Brilliant!","post_message":"Agree or disagree: It's time to build Trump's wall at the border."},{"comment_id":"10153309125991491","commenter_b":"Kerr, it's not the good guns with guns in the US. It's the BAD ones.","commenter_a":"He is 100% right. The attackers would've been shot down where possible. Edited for grammar.","post_message":"\"It would have been a much, much different situation.\" - Donald J. Trump"},{"comment_id":"10154042547832411","commenter_b":"Let's get rid of the illegal immigrants you wanna come here do it the legal way and learn to speak English too","commenter_a":"Why don't you dream up a way to protect Chicago!","post_message":"Emanuel asked Trump to continue deportation protections for \"DREAMers\" who were brought to the country before they were 16."},{"comment_id":"10155263002346162","commenter_b":"we have a lyin' idiot Donald Duck, willing to bet with any one, end of this idiot presidency we will have recession, Trump will drive our bus thru cliff","commenter_a":"How can he block news orgs from a 'press' briefing? Are they not 'the press?'","post_message":"JUST IN: White House blocks news organizations from press briefing...@webpagelink"},{"comment_id":"512454232283082","commenter_b":"To the person who said go back to Africa.... Pack your bags too & head back to Europe! Cuz white ppl ain't native to this land either. Dummy!","commenter_a":"Not worthy of my ear wax!","post_message":"Hip-hop legend Q-Tip is here talking about race and policing in America. Leave your questions in the comments."},{"comment_id":"1194478233905538","commenter_b":"@username...your learning is interfering with your lack of understanding and common sense. These people are Muslims as maybe you are. Their ideology is to secede as supreme at any cost including the taking of life to advance their cause. Allowing 10,000 to come to this Country, and not knowing who they really are, is not a smart idea nor is it responsible. We have enough problems in this Country now with illegals and supporting them. We don't need more leaches to feed. And yes, I am a proud Southerner as you have mentioned. Your history is somewhat flawed and Gods laws supersedes mans laws.","commenter_a":"9/11...\"We will never forget\"! The White House has already forgot, allowing 10,000 Syrian Muslims into America...","post_message":"The Obama administration said Thursday it is willing to take in at least 10,000 refugees in the next fiscal year as Europe grapples with the crisis."},{"comment_id":"1661010187498580","commenter_b":"Don't forget Texas borders!","commenter_a":"Focus now on what is at hand Mr. Trump. Put an end to ISIS, erect that wall, and focus on Florida and Canadian borders, lastly boost our economy. You have mentioned these 3 things before which garnered my attention, then my vote. Just give more ways of getting this done. Oh, hate to throw this in but there may be a few executive orders that need immediate attention! TRUMP 2016!","post_message":"Remember, I am self-funding my campaign, the only one in either party. I'm not controlled by lobbyists or special interests-only the U.S.A.!"}]
