[{"comment_id":"631016783743523","commenter_b":"Another white college educated female here!!!","commenter_a":"Donald Trump will not become president of the United States, because Americans understand that togetherness trumps divisiveness, and that love trumps hatred.","post_message":"Join me in in Philadelphia - LETS MAKE AMERICA SAFE AND GREAT AGAIN! GOD BLESS AMERICA!! -DJT"},{"comment_id":"1191420990909535","commenter_b":"Really??? I use my pants to hide this dick!!!!","commenter_a":"I'm sorry","post_message":"Military intelligence... isn't. ~Will"},{"comment_id":"10153959018846341","commenter_b":"The problem that Islam faces is that it is continuously moving backwards. Even in the Islamic golden era, the economy was reliant on slaves and infidels. The only successful Islamic countries today are the ones that have massive oil reserves. Muslims living in countries with no resources tent to live in poverty. This is why you always see Muslims migrating into infidel lands but you don't see infidels moving into Islamic lands. I do believe that Islam will dominate Europe. I have no doubt. Firstly the countries will be split into two with one being Islamic and the other being Christian but the Muslims will continue to migrate into the Christian countries because they will be poverty stricken. Because sharia is so retrograde Europe will imminently turn into another failed Islamic state as they have no resources. European winters can be very hard If everyone wants to pray 5 times ...","commenter_a":"unfortunate though, but this is the same way Palestinians are wailing, groaning and moaning everyday yet no one seems to care. Let's not unite in periods like this alone but all the time.","post_message":"The residents of Belgium capital city woke up Wednesday morning to a new reality, on the day after the terrorist attacks that killed at least 31 people."},{"comment_id":"659614807562431","commenter_b":"I would have left that along time ago. Angree black woman.","commenter_a":"We don't give a shit about their marriage , they are destroying America and need to be kicked out of the White House NOW!!!!!!!!!!!","post_message":"It seems that Michelle and Barack are going there separate ways. How about in the meantime, we find a president who can actually run our country. Do you agree America should divorce the Obamas?"},{"comment_id":"1172311699525637","commenter_b":"Fuck You! Get off your fat ass and get a fucking JOB!","commenter_a":"All I can do is laugh","post_message":"\"Pay me consistently, provide me safe housing, offer me a job with benefits, run me those Beyonce tickets\" She must have lost her mind, if she thinks we are going to pay her anything. Will you pay for this entitled BLM organizer to go to a Beyonce concert?"},{"comment_id":"967744473282082","commenter_b":"Hillary, american people need your talented and exposure,","commenter_a":"Hillary, is key to solving, american problems,","post_message":"What we’ve seen too much of in the last few years is a spate of people who have reached for a gun before they really figured out what was going on. They’ve been much too eager to use that gun—we’ve seen it with policing and we’ve seen it with civilians. With police, first and foremost, they need to be trained and held accountable and disciplined in a way that prevents the reaction that we’ve seen way too much of. And with civilians—a lot of these “stand your ground” laws need to be rewritten. If you have to defend yourself, OK. But look at some of the instances we’ve had—Trayvon Martin, and too many more. Nobody should want to create circumstances in which innocent, unarmed people are killed—either by law enforcement or by civilians wielding guns. We’ve got to figure out how to deal with that."},{"comment_id":"10153436827584153","commenter_b":"very often though.","commenter_a":"it's burning 24/7 don't even try to go there.","post_message":"Would you go vacation in Greece now, despite the economic crisis?"}]
