[{"comment_id":"1055649497786607","commenter_b":"I have been doing some serious thinking on this. I have always been pro second amendment, but maybe it is time to take a look at this from another direction. I propose we start here and see how this new gun control thing works. I propose that all people convicted of felonies be banned from owning/possessing firearms. All convicted felons should be made to turn in the guns the legally own now. Once we have all of those, lets move to people convicted of misdemeanor crimes of violence, like assault, sexual battery and so on. Lets get all those criminals that currently legally owning guns to turn those in. I figure it will take a year or so for all these people to disarm and turn in their guns and then we can see if we are having a positive impact on violent gun crimes. If so, then we can ...","commenter_a":"What don't the gun grabbers understand, if you take every gun out of every house hold we have no defense against the bad guys with the guns because they don't give a shit about the laws to start with...","post_message":""},{"comment_id":"862078977258615","commenter_b":"Most abortions are not because of these \"terrible diseases\", so quit using that as an excuse.","commenter_a":"Conservatives are pro-life until the child is born poor. Then they are just lazy and a drain on society. Pro-life my ass.","post_message":"One of the few actresses that isn't ashamed to be conservative and pro-life! One of the big reasons I support her :D"},{"comment_id":"963771213658338","commenter_b":"He hasn't been sent yet! The judge will do that! 263, but if he, the judge, gives him concurrent sentences, he'll be out in 20....wait until JAN 16","commenter_a":"Lolol good!!!","post_message":"Daniel Holtzclaw was sentenced to 263 years in prison."},{"comment_id":"10154169882022061","commenter_b":"Would you rather me say, \"stop your whining and suck it up buttercup!\"","commenter_a":"Good grief, you people kill me. Like it or not he is the next POTUS. Stop with the bashing. If you live in America then he is your President and you will benefit or suffer like the rest, but for crying out loud give him a chance.","post_message":"WATCH: Rick Perry, President-elect Donald J. Trump's expected pick for Secretary of Energy, famously forgot he wanted to abolish the energy department in a 2011 debate: @webpagelink"},{"comment_id":"10154297442132098","commenter_b":"Wow, that's crazy","commenter_a":"Mie Mie the mystery is solved","post_message":"CONDO FIRE: A massive fire broke out a Concord condominium this afternoon. Story: @webpagelink"},{"comment_id":"10153181956571162","commenter_b":"I guess it depends on how you speak to your mother.","commenter_a":"I thought it was great. Normal mom and daughter banter. They are human after all.","post_message":"50 SHADES OF AWKWARD! Dakota Johnson and Melanie Griffith on-camera spat on Oscars red carpet: @webpagelink"},{"comment_id":"1149894398400704","commenter_b":"Another flip flop by trump,,he once said she would be a great president,,he's pro choice,,he says he's going to deport all illegals,Obama has deported more illegals then any president & it doesn't make any difference,,they just come right back,,Hillary is the only hope we have for the average American,,","commenter_a":"Never killery","post_message":"Trump has no problem with the idea of having a female president in America -- as long as it isn't Hillary Clinton. Do you feel the same way?"}]
