[{"comment_id":"593997884104848","commenter_b":"God help us all...God please Bless America! No Hillary!!!","commenter_a":".......President means MAN! .amen.","post_message":"Nancy Pelosi said confidently today that Hillary Clinton will be the next president of the United States. Do you hope she's right?"},{"comment_id":"10152477981607434","commenter_b":"I agree. If she lived in Miami in a luxury condo, she'd probably pay more.","commenter_a":"But- that's not a lot of money when you consider she has no mortgage, no car, no food bills- I mean- I don't want it but....","post_message":"The cost of living like a goddamn queen is high."},{"comment_id":"1044675162261267","commenter_b":"Now go build my wall","commenter_a":"*You're *Putting","post_message":"Right!? I sure hope so!"},{"comment_id":"1576359559329284","commenter_b":"She's enabled men her entire life! Her big weakness ... Last thing we need is a woman enabler running America.","commenter_a":"Did she really just compare Donald trump to native Americans going off the reservation?","post_message":"Hillary Clinton brushes off Donald J. Trump's sometimes personal attacks against her as him being \"off the reservation\" — something she said she has experience with. @webpagelink"},{"comment_id":"10154320018886323","commenter_b":"Fascist dictatorship and destruction of cabinet government system. Democracy under attack.","commenter_a":"I am okay I never voted either tyrant but that's that's English government","post_message":"\"The Tories are about to give us a second female prime minister while much of the left will say gender is an irrelevance or that there are many more important things to deal with. Women, know your limits!\""},{"comment_id":"485867691579702","commenter_b":"Sad to say but our state has that stupid caucus! Thanks to our friend Reid!","commenter_a":"Amen @username!","post_message":"Greetings from Ben Carson High School."},{"comment_id":"10153635316283812","commenter_b":"\"It's Just Lunch\" was already taken...","commenter_a":"The name is stupid....Couldn't come up with something a little more interesting!??","post_message":"Earlier this year, the Kang sisters, co-founders of the dating app \"Coffee Meets Bagel,\" turned down a $30 million \"Shark Tank\" investment offer. Here's what they have been up to since the show, and where their app is changing online dating: @webpagelink"}]
