[{"comment_id":"481790668675893","commenter_b":"GET THIS TROUBLE MAKER OUT OF THIS COUNTRY ....BEHEAD iSLAM","commenter_a":"Now that is one hell of a costume","post_message":"ARREST HIM!!!!!!!"},{"comment_id":"10157838985835725","commenter_b":"Woman here voting for Trump too #nocrookedhillary!","commenter_a":"Thank you Mr. Trump. As you know killary used the hurricane to post her commercials on the weather channel! To take advantage of storm victims to campaign, she is one Nut case, how disrespectful. So, we thank you for your concern for our safety!!","post_message":"Thoughts & prayers with the millions of people in the path of Hurricane Matthew. Look out for neighbors, and listen to your local officials."},{"comment_id":"1199347126788647","commenter_b":"We have to get these people out of here why pay for illegals school when we can't afford school for American kids","commenter_a":"When people have had enough then this will be brought to a stop not until, they think they are entitled to everything free and then they will take your job, then you'll be on welfare without a means to support yourself!","post_message":"What?!?!"},{"comment_id":"10153420675841162","commenter_b":"They should be out in the wild with their mom","commenter_a":"Michelle Papandrea","post_message":"ADORABLE! Take a look at the latest arrival at Metro Richmond Zoo in Virginia: 3 cheetah cubs..@webpagelink PHOTOS: @webpagelink"},{"comment_id":"10153692556453984","commenter_b":"Had she told the tuth to begin with she probably would be our next pres!!!","commenter_a":"Absolutely","post_message":"Looks like Hillary Clinton just got another piece of bad news, and it's from one of her least-favorite people. 'Bulldog' Gowdy is hot on the trail! Do you support Trey Gowdy's fight to hold Hillary accountable?"},{"comment_id":"847139551999340","commenter_b":"You can get rid of your living organism in your uterus all you want to and in 5 states up to 40 weeks. . It still doesn't take away from the fact that you chose to end this living organisms life. Basic biology hun","commenter_a":"Question: A six week old BABY and a six week old EMBRYO are about to be thrown from a very tall building. You can only save one. Which one would you choose?","post_message":"Isn't this amazing?"},{"comment_id":"10152922886022377","commenter_b":"Lock her up and throw away the key!!!","commenter_a":"Her mug shot will be her best picture.","post_message":"Criminal charges coming soon for Hillary Clinton?"}]
