[{"comment_id":"10154148275886162","commenter_b":"#FEELTHEBERN #DUMPTRUMP","commenter_a":"Yes, I did!","post_message":"SHARE if you got out and voted today! We'll be updating with all the latest results throughout the night: @webpagelink"},{"comment_id":"10155606763470492","commenter_b":"OMG it happen on number 7 train everyday. this lady on the photo is nothing. many of them insists squeeze inside and the worse is stink body smell that hit your nose.","commenter_a":"Tiffany Yeung","post_message":"Behold, the Incredible Levitating Lady."},{"comment_id":"1062283227145482","commenter_b":"Glad you decided to be a Republican, Eric! Your bigoted remarks belong with them.","commenter_a":"Chan Zilla, even white people are getting sick of white people's bullshit...","post_message":"The significance of the march on the Confederate museum should not be lost. The Confederacy in and of itself was built on racial terrorism."},{"comment_id":"995099337179781","commenter_b":"Crazy dumb old witch.","commenter_a":"I think democrats are more like terrorist. Terrorist maim and tear people's bodies apart. Democrats do the same thing to unborn babies by allowing Planned Parenthood to Harvest baby body parts. As far as I know no terrorist organization sells body parts. Guess that makes Democrats and Hillary Clinton worse than terrorist.","post_message":"BREAKING: Hillary Clinton says GOP candidates are like terrorists because they're...pro-life?"},{"comment_id":"829662497101615","commenter_b":"prizon don't send them back , they will just return and do it again, either way we will be paying tax dollars for them so I would rather do it for them being in jail instead of welfare and what ever else obama is giving them.","commenter_a":"Now take away their real name and give them a number, prison number that is","post_message":"OBAMA’S ILLEGAL ALIENS ARRESTED IN MISSISSIPPI FOR IDENTITY THEFT! #NoAmnesty Just spread this like wildfire Dean James Americas Freedom Fighters"},{"comment_id":"10153482266875329","commenter_b":"We have no hope for me aka the oblivious bitch.","commenter_a":"Brianna Musselman @username Guarantee this would probably be me, lol","post_message":"cringing"},{"comment_id":"737091973148047","commenter_b":"Imigrants that come here with four wives and ten kids need to be kicked off welfare they cost tax payers a 100.000 dollars a year per family","commenter_a":"Cut her off.","post_message":"Debbie Merton lives off of government tax money. But it’s what she’s doing NOW that will make you want to punch a wall. Should this woman be cut off from the government?"}]
