[{"comment_id":"1158142194215832","commenter_b":"aw poor huntsman","commenter_a":"Sergio Andrade Sergio Andrade Vergara Gisella Casillas","post_message":"A good reason to always flush the toilet.  Barry Morrissey captured video of a Huntsman spider hiding in a toilet bowl in Australia.  The video has been viewed more than 30-million times around the world."},{"comment_id":"10152726918051051","commenter_b":"She should really be charged with Involuntary Manslaughter...","commenter_a":"Some people should have no children Stupid ass how can she do that","post_message":"This woman left her 2 small kids alone to get her hair done. When she returned, there were firefighters everywhere."},{"comment_id":"10156348163835354","commenter_b":"This is exactly what we need..someone to shake up the illegals..make them realize that they cant stay here..these officials are part of the problem ..trump isnt crapping on latinos..he jist wants them to be here legally..obama and past administrations have turned their heads and not dealt with..we have a big problem now...go trump","commenter_a":"Really that is a bunch of nonsense! They would only be fearful of someone enforcing the Rule of Law for ALL... IF they have broken any laws. Anyone here legitimately -- they have nothing to fear at all! This Hispanic Lawmaker is sounding a false alarm! Instead of defending illegal aliens he should be working to improve the lives of the citizens and legal constituients he represents. Why is he working so hard to help those who do not belong here but doing nothing for those leagally here that needs the job he's allowing the illegals to stay at?","post_message":"“Mr. Trump’s racist remarks and his continued rhetoric demonizing Latinos and immigrants has created fear within these communities around the country....'"},{"comment_id":"855612107818751","commenter_b":"So then please elaborate what does happen once that sperm penetrates that egg-I'll wait.","commenter_a":"The egg, once fertilized, then has to implant to become life. Not sure conception counts, not without implantation. Otherwise, you're telling every woman who takes birth control pills she is a murderer.","post_message":"The evidence is clear: life begins at conception!"},{"comment_id":"386115264910101","commenter_b":"She needs to die. She would never have gotten any place in this country without white people. I hate that racist trash.","commenter_a":"She sounds like she is mad at the world .","post_message":"Oprah plays the race card again..."},{"comment_id":"836801636436616","commenter_b":"Any one doing this should be around up put in jail and when it is time to get out they should be deported","commenter_a":"And those BASTARDS in DC want to bring in over @username in the next two years. HELL NO","post_message":"Broad daylight in Germany. Watch Muslim 'refugees' beat the crap out of this mom and daughter. Can you say, 'extended magazines?' @webpagelink"},{"comment_id":"10155050570035329","commenter_b":"I'm the biggest pussy out","commenter_a":"'@username you have to read these!! Ouch","post_message":"Exposed nerves, unexpected orgasms, and a whole lot of blood."}]
