[{"comment_id":"496338953890018","commenter_b":"Dumb as hillbilly racist. This ain't your country. You must of been beaten to many times by your hillbilly husband. Stay the fug out of their area then. You KKKrackers have many don't go zones, outsiders not welcomed. Most trailer parks in Auburn CA. and any white town in Mississippi. Live and let live mafaacaas!","commenter_a":"yes spray the area with pig fat","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"10153815303155695","commenter_b":"He is not in position to bless anyone! Really?","commenter_a":"Ughhhhhhhh. This man isn't Jesus. He is just a man. And not a good man. Wake up people and stop worshipping the pope before he drags you all to hell. That's what he is trying to do. Only one way. JESUS CHRIST. NOT THE POPE. NOT MARY. PRAY TO THE ONE WHO DIED FOR YOU!!!!","post_message":"\"The Pope’s gesture was beautiful and meant something special to our family,\" she said."},{"comment_id":"1111727715607435","commenter_b":"sick woman in many ways and not to be respected!!","commenter_a":"Clinton stood tall and showed she was someone to be respected, unlike the baby bully who consistently showed his ignorance and called name likes like a third grader.","post_message":"The final presidential debate is in the books. Which candidate made the best case for themselves: Trump or Clinton?"},{"comment_id":"10153507396631323","commenter_b":"She wears real fur....therefore she's a selfish bitch with no regard for the lives of others. I've never liked her. Seems I'm not alone in that here.","commenter_a":"I really couldn't care less about her, she's contributed nothing positive to this world.","post_message":"Why do newspapers hate Kate Moss so much?"},{"comment_id":"10153235422567994","commenter_b":"Hahahaha mathieu blocked me awe","commenter_a":"Who are these people with nothing better to do than just constantly complain about everything being racist? My God shut up.","post_message":"It's a bank robbery for Skittles. Is it a student video gone wrong?"},{"comment_id":"666544360165278","commenter_b":"@username, Mexico has a wall on their Southern Border and they swear it has dropped the amout of illegals in their country from Guatemala by 2/3rds. That's 66% less illegals if you can't understand what 2/3rds is. And No, Mexico can't do us more harm, only our Politicians like Clinton, Johnson and Stein can. Don't let them give America away.","commenter_a":"Sadly, we have become a society where protecting borders is not even an issue. It must be done because of the outside terrorists. Then our people could concentrate efforts significantly more on internal ones. I cannot believe I just wrote that. Trust in God.","post_message":"Truth."},{"comment_id":"10154921930118690","commenter_b":"Karim Alyaa Dina","commenter_a":"Bal","post_message":"Integrating into a new country can be hard. That's why Horst Wenzel is teaching refugees the ins and outs of German dating culture."}]
