[{"comment_id":"10153700162853010","commenter_b":"By bring them here ,you are taking food out of the mouth of those poor people.","commenter_a":"Don't we have enough ,dogs here..","post_message":"The Humane Society International has apparently taken possession of more than 100 dogs from a South Korean farmer in recent months, paying the farmer to transition to other crops."},{"comment_id":"10155259941361756","commenter_b":"Yep Aussie too. All true above. Totally embarrassed and ashamed ourselves and our political leaders also often call them illegal immigrants not refugees 😢","commenter_a":"Australia, please know that he does not speak for us. Thank you for your humanitarian efforts.","post_message":"The deal concerns refugees -- not 'illegal immigrants' -- who have been housed in offshore detention centers on Nauru and other islands."},{"comment_id":"10153394655753908","commenter_b":"is anyone here surprised by this information?","commenter_a":"Get a grip","post_message":"For those who haven't seen this yet. 'Ever single terrorist attack in the US was a false flag attack.'  There is a tremendous amount of research to back up this statement."},{"comment_id":"10153372404416509","commenter_b":"We gays.","commenter_a":"Its so surprising how everyone calls on God for a miracle yet america is a homosexual country that dont obey God....","post_message":"Almost three weeks after she was found unresponsive in a bathtub, Bobbi Kristina Brown is still fighting for her life. @webpagelink"},{"comment_id":"10153064930639135","commenter_b":"She should be returned to New Jersey. So should it's Governor.","commenter_a":"Why wait until the end of August? Drop out now and avoid two weeks of mental anguish. It's over for you, which is a good thing for America.","post_message":"President Obama and Secretary Kerry, now that we have an American flag flying in Cuba, I urge you to demand the immediate return of Joanne Chesimard to New Jersey.  Like so many others, the families of her victims continue to suffer under the Castro regime. Justice must be served."},{"comment_id":"1769361876675571","commenter_b":"Chinguen su puta madre ,al igual sigana trump nos seguiremos pasando i cruzando la frontera ,pongan ipongan sercas siempre los burlaremos 100% mexicanos gustele aquien leguste somos los #1 .","commenter_a":"Nice honest, rich family.","post_message":"In an impassioned speech, Eric Trump called on Americans to 'vote for the candidate who can’t be bought, sold, purchased, bribed, coerced, intimidated or steered from the path that is right and just and true!' @webpagelink"},{"comment_id":"1062574083799120","commenter_b":"Yay! Maybe your daughters can grow up to be war criminals! #progress","commenter_a":"I am joyfully and unabashedly with you Hillary! My two little girls are so excited. It means the world to watch them see the new possibilities in the US with you!","post_message":"The New York Times: Hillary offers 'a vision in which middle-class Americans have a real shot at prosperity, women’s rights are enhanced, undocumented immigrants are given a chance at legitimacy, international alliances are nurtured and the country is kept safe.'"}]
