[{"comment_id":"1807404516198292","commenter_b":"STOP THIS CRAP!","commenter_a":"Bs","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"517851475047476","commenter_b":"One ugly dumb coward.","commenter_a":"This guy should be selling catsup in his front yard .","post_message":"This is the fourth deadline extension since an interim deal was struck in April."},{"comment_id":"670056826483078","commenter_b":"If those wars were a mistake why does the current administration keep sending troops there????","commenter_a":"The Republican Party needs to reform to become the conservative element we once knew before GW Bush or Reagan. They need to let the Tea party folks splinter into another party. Same with left Dems. Together they might found a centrist party most voters could support.","post_message":"You sure can't!"},{"comment_id":"10153644066921337","commenter_b":"Oooooh damn. That sucks man. That bitch took the easy way out. Piece of shit lunatic","commenter_a":"A piece of shit ....is a piece of shit. No need to bring up RACE.","post_message":"GUNMAN IDENTIFIED: Former WDBJ7 reporter Vester Flanagan is behind the horrific on-air shooting of two news team members."},{"comment_id":"10152672442592169","commenter_b":"she works my nerves! MAKE HER STOP!!!","commenter_a":"mismatch, think that Mary and He should get together","post_message":"New Downton Abbey video -- do you think Branson and Bunting should be together? The cast give their thoughts. (A new episode airs Sunday at 9/8c on MASTERPIECE | PBS (Masterpiece Theatre))"},{"comment_id":"703522563139507","commenter_b":"She's just jealous ,because she has NEVER looked this good in her whole life ,just saying !!!","commenter_a":"What country did rosie post that from...I bet she stares at that pic. all night...","post_message":"OUTRAGE...! Rosie posts naked photo of Melania when comparing her to other First Ladies. WARNING: Nudity"},{"comment_id":"1096146180493131","commenter_b":"Mexicans showing their little dicks. Their penis's are as big as a Mexican pepper. Will see who kisses of illegals your asses are grass.","commenter_a":"Trump","post_message":"CITIES TELL TRUMP to KISS OFF @webpagelink"}]
