[{"comment_id":"10155238822815579","commenter_b":"In 2016 he US allowed 38,901 Muslim refugees also 37521 Christian refugees.","commenter_a":"In a practical sense, Obama had a ban against middle eastern christians. He seemed pleased they were being made victims of genocide, instead.","post_message":"President Trump: 'World Is A Mess & Angry' - AGREE or DISAGREE?"},{"comment_id":"10154162076211943","commenter_b":"'@username IF 60 % of conservatives and church goers stay home and do not vote. She will win. In 2012 they did not want to vote for a Mormon. SO they allowed a muslim sympathizer to stay in the White House.","commenter_a":"Lold she will just put it in Chelsea's name......","post_message":"The Boston Globe Wednesday demanded that Hillary Clinton shut down her family foundation if she wins in November because the entity 'will always look too much like a conflict of interest for comfort.'  'The Clinton Foundation is also clearly a liability for Hillary Clinton as she seeks the presidency,' the newspaper said in an editorial. 'The foundation should remove a political  and actual  distraction and stop accepting funding.' - via Newsmax"},{"comment_id":"10152854045581749","commenter_b":"Yeah. ..not so much","commenter_a":"Dear President Mr. Obama May God Bless you And your family.","post_message":"'I believe Americans are tired of the political back and forth. People want to see an agenda that moves us all forward.' —President Obama  Read the President's latest message to OFA supporters: @webpagelink"},{"comment_id":"10153386538275326","commenter_b":"How is he going to run his hotels,if he reports all illegals??","commenter_a":"He mean kill them.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1113233595363485","commenter_b":"She articulated well as an advocate of the legal justice system.","commenter_a":"Yes, the role of the defence attorney is to defend and protect the client at all costs. She did. He won. It wasn't right, but she did her job.","post_message":"'I know my role in the justice system.'"},{"comment_id":"1398317006928016","commenter_b":"I don't particularly like or support this woman for the position. But this is petty.","commenter_a":"Christian Heredia 😂","post_message":"Trump's Secretary of Education. Speechless."},{"comment_id":"10154362944566880","commenter_b":"Leonardo Gai","commenter_a":"Vasilis Sotiriou","post_message":"$39 billion and rising."}]
