[{"comment_id":"10153415321678812","commenter_b":"Stacey shutup stupid","commenter_a":"So how does something hitting the windshield really effect a train on tracks? It's not like the train swerved to avoid it and hit something...travelling at 106 mph might be the villain in this tragedy.","post_message":"FBI investigating possible links between Amtrak crash and other trains hit by objects: @webpagelink"},{"comment_id":"1929449190619936","commenter_b":"Trump will not get a record number of votes. No way. This is going to be the biggest landslide in modern American history.","commenter_a":"My prediction in this election is that Trump will get a record number of votes beating Hillary. But Hillary will get the electoral vote giving her the presidency. The electoral is there so the establishment gets final say. Sad but true. Isn't that right Bernie Sanders.","post_message":"Donald J. Trump says he would 'promise and pledge' to accept the results of the election --- if he wins."},{"comment_id":"10153268129696782","commenter_b":"$50 charge on all transfers of money to Mexico. Wall built!","commenter_a":"Since illegals sending money back to Mexico props up the Mexican economy, I would propose a fifteen percent tax on all wire transfers and international money orders bound for Mexico. That alone would pay for the wall in a short amount of time.","post_message":"Mexico won't pay a single peso to help build the bigger border wall Republican presidential candidate Donald Trump is proposing, the country's treasury secretary said."},{"comment_id":"10152669039472894","commenter_b":"Amber must have taken your man or shaded you at some point in life miserable hoe. Get some counseling and stfu.","commenter_a":"And I hope he gets it, a son needs his father. And ratchet bald hoes don't need thier kids","post_message":"Wiz Khalifa Claims Amber Rose is a Bad Mother, Seeks More Custody of 1-Year-Old Sebastian"},{"comment_id":"944224732371213","commenter_b":"Yeah, she didn't want to have sex with an Orange baboon.","commenter_a":"I guess Trump would know a lot about attitude. He has a very bad attitude and has the emotional age of three!","post_message":"'She gained a massive amount of weight, and it was a real problem. We had a real problem. Not only that, her attitude,' Trump said Tuesday morning."},{"comment_id":"822517567938820","commenter_b":"This woman is crazy saying Hillary is the most loved and respected woman in the world! She's been hanging around Hillary to much, and Hillary's lying is rubbing off!!","commenter_a":"Security should of threw her out on her ass. The demons must be running scared.","post_message":"Watch: Dem Chair Shows Up INSIDE GOP Convention Arena And Does The Unthinkable  It is amazing to see to what extent the Democratic party will try to derail Trump's campaign.  Do you stand behind Donald Trump?"},{"comment_id":"10153706069823717","commenter_b":"Best part about this is her age, she's not an 18 or 20 year old like most ad models.","commenter_a":"Oh thank heavens. The world is a safer place.","post_message":"People magazine has named Jennifer Aniston the 'World's Most Beautiful Woman' for 2016."}]
