[{"comment_id":"10154436464143931","commenter_b":"The wall will stop a lot of illegal aliens because they don't usually go thru tunnels. The tunnels are for drugs. They don't want a lot of people knowing where the tunnels are because if the people get caught they will snitch on the tunnels location. That's why they use the tunnels for drugs not people","commenter_a":"The drugs are smuggled thru tunnels underground.","post_message":"A wall would do little, if anything, to stop the flow of illegal drugs - the majority of which are actually smuggled though checkpoints."},{"comment_id":"1015138285280684","commenter_b":"To the bone","commenter_a":"They cut his head","post_message":"Ron Mott said the four Chicago teens who kidnapped and tortured a mentally challenged young man weren't \"trying\" to be criminals."},{"comment_id":"703232799867298","commenter_b":"Yes! Wipe them off of the Earth!","commenter_a":"Unfortunately this is what needs to be done to get this sickness out as best we can","post_message":"Several ISIS leaders have just been taken out. Good riddance. Should we send our air force back to Syria to end ISIS for good?"},{"comment_id":"1779395119015202","commenter_b":"So women have been successfully doing this for how long? Most cases of extreme pain can be resolved medically and if not that's why we accrue roughly 8 hours of sick time per month at standard full time jobs One cannot expect businesses to experience this loss of productivity and still want to retain female workers","commenter_a":"Emily Lynn Bowman","post_message":"(Note: Look at the women in the back left of this photo.)"},{"comment_id":"10152712712566545","commenter_b":"That was a WOMAN.","commenter_a":"That lady in the van just opened a can of Whoopass","post_message":"Here's the incredible ending to a nerve-wracking chase in Dallas County. We'll have the latest on News 8 at 4. TO WATCH/READ MORE: @webpagelink"},{"comment_id":"479805008868046","commenter_b":"Asshole!","commenter_a":"Stop the nonsense! We need people with some brain power addressing these issues because this comment is the most idiotic I have heard!","post_message":"Victim blaming is NEVER ok."},{"comment_id":"10154251674646636","commenter_b":"O don't back benefit sanctions , however if your gonna make a living out of claiming benefits do the job right , simple as","commenter_a":"He has a sighted carer (his brother) who opens all his mail and should have done it. Obviously they had never requested braille correspondence. So on that aspect I (for once) can't fault the DSS however to not reinstate the money after they appealed the decision is just ridiculous.","post_message":"Awful"}]
