[{"comment_id":"10153209825548445","commenter_b":"Not if you make the tincture right","commenter_a":"Don't make edibles at all. If you want an edible high, just buy/make tincture and eat it with cookies. Or just eat the weed in fillable capsules: 1. Decarboxylate your Dry herb 2. Fill swallable capsules with dry herb 3. swallow capsules with food and drink","post_message":"10 Commandments of #Marijuana Edible Safety"},{"comment_id":"1765372970348268","commenter_b":"No she is a lier","commenter_a":"Feel free, one and all, to hit me in the head with something hard and heavy if you ever get wind of me agreeing with Hillary on anything.","post_message":"Hillary Clinton rebukes Senate Republicans for refusing to hold a hearing on U.S. Supreme Court nominee Merrick Garland, calling it \"low-minded politics\". Do you agree or disagree with her?"},{"comment_id":"10153718487658598","commenter_b":"Why can't liberals just coexist?","commenter_a":"Oh, but aren't liberals known for being open minded?","post_message":"Pro-Abortion Activists Freak Out New York Times Putting Picture of Pro-Lifers on Front Page"},{"comment_id":"1690937014458022","commenter_b":"Stupid Swede!","commenter_a":"Another nut","post_message":"This is INSANE..."},{"comment_id":"10153750563214497","commenter_b":"Liar. You're not a prostitute.","commenter_a":"As an African American prostitute I find this offensive.","post_message":"For more world-renowned reportage, visit theonion.com."},{"comment_id":"10154082239191545","commenter_b":"No, I hope she goes to CNN that's where she belongs!","commenter_a":"I love strong women. She's one to not let anyone run all over her. I like her more and more as time passes.","post_message":"Are you a Megyn Kelly fan?"},{"comment_id":"525067284350518","commenter_b":"Leave our country. Go home and behead your own.","commenter_a":"Leave!","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy.  Let them be angry. This America and if you don't like it, get out.  Do you agree that Muslims should assimilate or leave?"}]
