[{"comment_id":"685505648280301","commenter_b":"@username don't worry, she'll deny, lie and get out of it. Doesn't she always!","commenter_a":"They say truth is stranger than fiction but this is ridiculous. We now have a presidential candidate running for office under investigation by the FBI and she is allowed to continue her campaign?","post_message":"BREAKING NEWS: New emails that prompted the reopening of the Hillary Clinton investigation came from devices owned by Anthony Weiner and Huma Abedin, according to an FBI source. @webpagelink"},{"comment_id":"10153817760650950","commenter_b":"@username HILLARY IS A EVIL OLD WOMAN THAT DON'T CARE FOR NO ONE BUT HERSELF","commenter_a":"People always want to have selective memory about who commit most of the mass shootings/killings. They are American born and home grown terrorists that are mainly one demographic. Trump and his supporters are jokes. Trump is ALWAYS putting himself in the news. EVERY time he opens his mouth his words will be scrutinized. Trump can always dish it out but HE can't take it. Presidential candidates aren't suppose to be whiners. I hope he and the Republican party go down in flames. Most of the Republican party is spineless and/or ignorant to have the guts to publicly stand up to Trump when he's wrong. So they defend him instead. Trump is a liar and dangerous! He's the KING of denial and deflection. His goal is to divide and conquer through fear and hate. We can't let them win! WE CAN'T IGNORE the fact that the Republican platform is that ANYONE ...","post_message":"The former New York City mayor introduced Donald J. Trump at his national security speech and left out one little detail."},{"comment_id":"10150922009204999","commenter_b":"Oh shut up!","commenter_a":"Let us have a rich street thug unfit to be a watchman of your house as Pres and ruin US. Anything that goes up should be his argument after 5 years. Pathetic","post_message":"Donald J. Trump talked to Billy Bush about women in vulgar terms, in a 2005 video obtained by The Washington Post."},{"comment_id":"1793346000922790","commenter_b":"The only women that believe that they shouldn't be checked out are the ones that don't have to worry about it anyways.","commenter_a":"I got dress coded while still in school for my skirt being to short when i argued this saying that it was well pass my finger tips she agreed but since i had long legs the skirt looked short so i would have to change","post_message":"Portland just completely flipped the script on sexist school dress codes."},{"comment_id":"1025607307502400","commenter_b":"@username do you not understand what rape is? Many women are unintentionally impregnated by a RAPIST. Involuntarily having sex is what rape is, if you didn't catch that. A women's should be able to choose if she wants to have an abortion, with advanced technology we can safely perform these procedures. Abortion is NOT A contraceptive, it is a last resort and if you wanna take the baby and provide for it along with the thousands of other rape victim babies then go ahead.","commenter_a":"Look I'm not all for abortion, nor all against it, let me just say my peace like everyone else has, and that we are all entitled to.. A females choice about her body, is exactly that, her choice. I'm not saying abortion ahould be used for a form of BC or a contraception, there are other ways, educate your children, its not just the girls in this that need it. All children need to be educated. But lets get surreal, how or what do u know about that female walking in to planned parenthood, little to nothing about her story. How do u know she didn't get raped, or isn't going thru some kind of abuse (whether it be physical or emotional) u don't know. We cannot judge people, who gives another that right, and all I have to say is those doing the judging I hope to hell u ...","post_message":"Hillary's Hypocrisy is Astounding www.eaglerising.com"},{"comment_id":"896237380506542","commenter_b":"Guess what all you fools there are just as many women that talk a hell of a lot worst then Trump dreamed of all you holier-than-thou women out there quit acting like Polly pure bread get a grip. What's worse is that all that comes out of Killarrys mouth is diarrhea 💩💩💩😈😈😈😈","commenter_a":"If Hillary & Supporters are so butthurt over something Trump said 11 yrs ago, then why would Clinton accept endorsements from \"Rappers\" who had said FAR Worse things about Women then Donald said in Private 11 yrs ago? Some of the Vile things said by these Musicians is so demeaning to Women but yet Clinton doesn't reject their Support?? Nor does Her Supporters?? Calling the Kettle black!!! Copied","post_message":"“It’s the kind of locker room and frat house talk that personally infuriates me. But guess what? I still, without a doubt, support [Donald J. Trump].\"  Watch Judge Jeanine Pirro's full opening statement."},{"comment_id":"10154343672430329","commenter_b":"Well said @username. BTW...@username who are you to judge who's a feminist and who is not? Worry about your own backyard and sit yourself all the way down.","commenter_a":"If you think she's a feminist. Please reevaluate your life EDIT: She is the definition of WHITE FEMINISM. She doesn't care about anyone but herself.","post_message":"It sounds like Taylor Swift responded to Kanye West in her Grammys speech: @webpagelink"}]
