[{"comment_id":"10153011198456717","commenter_b":"Time to jail her ass","commenter_a":"Yay!","post_message":""},{"comment_id":"10153953740523132","commenter_b":"Read!! Read!! Read!!!!!!!!!","commenter_a":"Did the other driver not stop to report it?And no one saw?","post_message":"People driving on the freeway told police they thought the body was a \"Halloween prank.\" It remained on the sign for 2 hours, police said."},{"comment_id":"10153220185391336","commenter_b":"I bet you that pussy Obama couldn't ride a bike","commenter_a":"How racist of him to ride a bike it's all his fault","post_message":"Former President George W. Bush hosted his fifth annual Warrior 100K bike ride in Crawford, Texas. This year's theme was healing the invisible wounds of war. @webpagelink"},{"comment_id":"1208908179197618","commenter_b":"Who do any of these \"woman\" think they are? The show SUX Whoopie go eat another side of beef!!!!","commenter_a":"They are both empty headed idiots!","post_message":"Loud mouth Whoopi and her co-hosts are making serious unfounded accusations and demanding Trump step down.  Let's get 5,000 'SHARES' & 'LIKES' to show that Whoopi is the one that America wants to see \"STEP DOWN!!!\"  @webpagelink"},{"comment_id":"1021502754552734","commenter_b":"Sammy Rose Dunaj Emmett Lally","commenter_a":"Serge Ermakov","post_message":"Save $26 on an Amazon.com Prime subscription."},{"comment_id":"10154769699754486","commenter_b":"STOP THESE TWO IDIOTS...............WHY CAN'T YOU UNDERSTAND WHAT ILLEGAL MEANS? YOUR A DISGRACE TO THE OFFICE YOU HOLD........ALL ILLEGALS AND REFUGEES SHOULD BE DEPORTED AT ONCE.........STOP THE ATTACK ON AMERICA...............","commenter_a":"What stupid Fools!!","post_message":"They want to make Obama's Executive Order amnesty for millions of illegal immigrants the law of the land."},{"comment_id":"10155813559759778","commenter_b":"Very heartbreaking and moving commercial...but unfortunately there still has to be something done about ILLEGAL immigrants coming into America. The Mexican President Enrique Pe Nieto could do something to help make their country better so the Mexican people would want to stay in their own country. I am sure he doesn't mind allowing the criminals to come here and apparently he doesn't care about the poor either, but something has to be done to protect our America.","commenter_a":"I loved it. Saw the ending...Touching.","post_message":"Budweiser isn't the only company to tackle the politically heavy topic of immigration in their Super Bowl commercial this year."}]
