[{"comment_id":"1159474340740147","commenter_b":"we don't give flyin fk what she does lmfbo she is a pig an evil ugly witch","commenter_a":"Donald Trump CNN just reported you declined an invitation to speak at the NAACP convention. Are you nuts? Hillary accepted, you declined. All I hear about is how hillary is sensitive to the American people and even though she is a liar, there are a whole lot of American people that believe her. Right now I hear her speaking in a calm mature voice how this country is divided. Wow is she tearing your character completely apart. It's all about you she is saying. All this is about you. I got to tell you Trump old man, she is using every lying skill she has to make you look bad. Real bad. A bad guy. Yeah a real bad guy.","post_message":"I agree! Lets MAKE AMERICA GREAT AGAIN...VOTE FOR TRUMP! Thank you for your support- it means the world! DJT"},{"comment_id":"1016327315093412","commenter_b":"It is long overdue that a woman is president, and more (sane) women are in Congress. Just don't think Hillary is deserving .","commenter_a":"Sorry, but it is time,long over due for a woman to start running this country. Look at the other countries that are run by women, get smart and vote Hillary Clinton in, she is very smart and she has Bill with her. So Bill had a woman under his desk,who cares. He wasn't sexually frustrated,if only the last 3 presidents had a woman under his desk,we would have a better run country. Now I'm not saying men should cheat, but a blow job from some stupid ass hussey, wouldn't hurt.","post_message":"It's time. Thank you, Winning Democrats!"},{"comment_id":"1487334004660057","commenter_b":"I'm sure my mom bragged about me when I was a teen thinking I was an innocent angel. Guess what? Girls are better at hiding it. I saw the video and see nothing wrong with it, she was wearing shorts, she moved her hips. I'm not a Obama fan but the girl is an adult and she's on her way to Harvard. There's bigger issues in the world than the presidents daughter dancing at a concert.","commenter_a":"I love all you people saying this is what a kid does. WRONG!!! Raise them right and raise the to respect their bodies and they don't do this. My daughter didn't do this crap. She was in the Sea Cadets and didn't do anything that would get her kicked out. She wanted a career in the military once she finishes college.","post_message":"Ohhhh boy..."},{"comment_id":"950451268383973","commenter_b":"I look forward to never looking at this Obummer again!","commenter_a":"Why is it everybody is out to get Trump? It seems to me they are so scared he may get President they have stooped to the lowest ways to destroy him....it just wants me to vote for him more because they are scared he will and the fact is it will ruin the political garbage at the white house who are trying to bring our country down.....I want our Country back and the Constitution back to what it was meant to be!!!!!","post_message":"“Good luck with that…We’ve got serious problems here.” President Barack Obama addressed Donald J. Trump's plans to build a wall and get Mexico to pay for it."},{"comment_id":"10153420150224087","commenter_b":"jeanne ruzzin: Ivana is a big woman and anyone who tried to push her around would surely regret it.","commenter_a":"Donald Trump, serial adulterer. Brutally assaulted Ivana and paid her off. Talks constantly about wanting to bang his daughter. Meanwhile, Hillary has been a faithful spouse, who had every right to choose whatever she wanted in the wake of her husband's cheating. Figures The Donald would stoop to #VictimBlaming.","post_message":"“If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women’s card on me, she’s wrong!” Donald J. Trump tweeted."},{"comment_id":"10153369157063984","commenter_b":"Fire them all and make new hires sign a contract that if they are caught stealing anything they will pay back double the amount of the theft. The citizens work hard for their money and it is the taxes they pay that keeps those in Washington working.","commenter_a":"Hey, as long as they're paying for their gambling and \"adult entertainment\" out of their own pockets, well..... that's between them and God! But, if I'm paying for any part of it, then \"nail them to the wall\"!!!","post_message":"This has got to be a big embarrassment, and they probably thought they'd gotten away with it..."},{"comment_id":"1090845874295643","commenter_b":"Maybe two life sentences are appropriate for such an individual. Think of the trauma that poor child will go through all his/her life.","commenter_a":"We can only hope.","post_message":"A burglar caught on a nanny camera brutally beating a mother in front of her young child was sentenced to life in prison. @webpagelink The mother survived the onslaught and testified against her attacker."}]
