[{"comment_id":"741319736029564","commenter_b":"@username. That's ridiculous.","commenter_a":"It's just sad. Sad. You are more worried about getting the United States into a war than you are taking care of the people of your own state. @username - makes a great point why, why Tom do you keep opening yourself up to this and then turning around and bragging about Trump being as good as his word. That's worked well for this country so far hasn't it?","post_message":"The president said we were putting Iran on notice, and I'm glad to see he's as good as his word. Iran's ayatollahs will stop their provocations only if the U.S. shows strength and resolve. These sanctions are long overdue, and they're sending the right message to the regime in Tehran: Cease and desist immediately."},{"comment_id":"10154813376179312","commenter_b":"North Country isn't that bad. And the only thugs are in the future new Nazi government.","commenter_a":"Prayers for this couple and their family","post_message":"Oklahoma police are looking for this couple last heard from in St. Louis. They were on the way from McAlester, Oklahoma, to Toledo, Ohio, but called their son from the St. Louis area on Thursday."},{"comment_id":"1277987642251583","commenter_b":"When I say technology, I'm talking about millenia of advancements. Even our simplest tools at one point put someone out of work, probably starting with the wheel. If you want to walk away from technology (or just some technology) that's your choice, just don't try and force others to pay for your choice.","commenter_a":"Low skill workers have been making this argument for generations since the first automation came about and it still doesn't work. Someone still has to design, manufacture, install and service the machine. Someone has to stock supplies for it to use. Still plenty of jobs, just not the job you were doing yesterday. They are also overlooking the other basic problem that the Government doesn't create wealth. If you get a freebie from Uncle Sam, that came out of someone else's hard earned money via taxes. If we're all sitting at home due to this miracle automation, then there's nobody around to pay the taxes to fund the government. It simply doesn't work. Worse, we've seen countless times around the world how it doesn't work and people still don't get it.","post_message":"Simply put, the idea is that Uncle Sam will cut citizens a regular paycheck whether they work or not."},{"comment_id":"10154177685016943","commenter_b":"Quit talking about it and do something! Put her in jail!","commenter_a":"Enough already with the disclosures. I'd be happy with just one little indictment.","post_message":"Hillary Clinton has taken a beating this month over the discovery that donors to her family charitable foundation received special treatment from the State Department when Clinton was secretary of state. And she unlikely to get a reprieve before Election Day, as the organization behind those email disclosures expects several more headline-grabbing document dumps in the next 11 weeks. - via Newsweek"},{"comment_id":"10153721168204170","commenter_b":"We have no room for their made up Allah in OUR Country!!!!! Go back to your Motherlands and take Nobama and Moochelle with you!!!!!","commenter_a":"Jeeze. I'm shocked","post_message":"Guess what block of foreign-born immigrants is growing fastest in the U.S?  If you said \"Muslims,\" you win a cookie. Make sure it's halal"},{"comment_id":"10152861396861051","commenter_b":"Shut up","commenter_a":"Sick. Stay with your own race.","post_message":"A police officer came in, handcuffed this teen and dragged him out of school. When they got outside, the teen realized what was happening."},{"comment_id":"1213204015381722","commenter_b":"Trash talk was and currently still is part LJ personality. Nice try though . Gotcha bitch","commenter_a":"STICK TO BASKETBALL.","post_message":"LeBron is leaving no room for interpretation here."}]
