[{"comment_id":"10153396293173525","commenter_b":"'@username, yes I do know that. It has never happened despite 45 of 50 states allowing open carry, and some that have NEVER PROHIBITED it since they became states. No open carrier has ever been 'taken out' by a criminal.","commenter_a":"Kinda think it's dumb. Makes you a target basically. Someone will see ur gun and be like let me take them out first... Ya kno... Element of surprise is better.","post_message":"OPEN CARRY: The same law that's being proposed here in Florida just went into effect in Texas, and to celebrate, several groups rallied at the State Capitol carrying their guns.  STORY: @webpagelink"},{"comment_id":"10153451466636336","commenter_b":"That's why I tagged you in this lol","commenter_a":"Sarah Garvey","post_message":"NEWLY RELEASED: The official images from the christening of Princess Charlotte have been made public by Kensington Palace."},{"comment_id":"10153853920168145","commenter_b":"Athena Marigold absolutely","commenter_a":"Athena Marigold it's in the paper","post_message":"#BREAKING A shot fired during a domestic dispute hit new father Brian Mortensen as he worked on a nearby fence. On Wednesday, he died."},{"comment_id":"10153010443401336","commenter_b":"I bet you don't even know what a p value is lmao.... Please don't reproduce...:)","commenter_a":"should be legal everywhere","post_message":"Possession of marijuana is no longer a crime in Alaska, but smoking it in public can lead to a $100 fine.  Should more states follow suit?"},{"comment_id":"563455260481095","commenter_b":"Apples have arsenic in them. Apples will kill you.","commenter_a":"So will parents of vaccination damaged children be given the same treatment?","post_message":"The parents used a variety of home remedies — including water with maple syrup — to boost their son's immune system after he became stiff and lethargic.   The 19-month-old baby had been sick for a couple of weeks when he suddenly stopped breathing."},{"comment_id":"2202427943315983","commenter_b":"'@username go beat your wife old man","commenter_a":"The ole draft dodger than said McCain wasn't a war hero because he was captured in battle. Yeah he really respects our military to nominate someone who is already part of the problem with the VA. I am a Republican at heart but I'm not going to blindly follow this man like some are. Words have meaning.","post_message":"Watch: President-elect Donald J. Trump and Vice President-elect Mike Pence lay a wreath to honor the nation's fallen soldiers at Arlington National Cemetery."},{"comment_id":"2169846419907186","commenter_b":"Don't listen to Nikki's Parra she needs to go back to school and take a history class or two cause slavery wasn't about a protest and it didn't end cause of one as well","commenter_a":"These people doesn't really know anything. They only wanna learn and hear what they want to hear and learn that is not against to them. Shame on you all! Get back to class and get a better future rather than this. Best revenge is to get educated!","post_message":"Students at East Los Angeles College and more than 100 colleges across the country walked out of classes and held rallies in protest of Donald Trump’s election as president. @webpagelink"}]
