[{"comment_id":"10156366153880389","commenter_b":"\"The very foundation of the United States is rooted in Native American genocide and the violent, forced abduction, murder, rape, annihilation, and enslavement of Africans... .So racism becomes a shield, hiding the magnitude of killing millions of people of color around the world... . If we must be told of the killing, we are told they are necessary to defend the way and . Because U.S. life is subsidized worldwide (and within the United States by people of color and poor White labor), racism must exist or else the entire edifice crumbles... . Race is not only necessary, but also a central tenet of westward expansion, for Western imperialism and capitalism are intimately tied to White superiority\" (Christopher Knaus \"More White Supremacy? The Lord of the Rings as Pro-American Imperialism\" Multicultural Perspectives, 7(4), 54-58. 2005).","commenter_a":"\"Who the United States considers to be evil is certainly not winning in reality. Poor, starving, bombed out women and children in Iraq and Afghanistan are not winning. The women working 16-hr workdays in sweat-shops in Thailand, the Philippines, Jamaica, and Mexico are not winning. The victims of human trafficking in New York, Florida, and Texas are not winning. Those with AIDS in Africa are not winning. The billions of poor people of color throughout the world are not winning. And yet we have set up an entire system of imperialized globalization, which we call democracy to keep them from winning. So we are, in fact, winning, although we only win because we have obscured not only what we are fighting for, but also whom we are fighting against\" (Knaus).","post_message":"Question of the Day: Which Republican presidential candidate do you think will be the toughest on radical Islamists?"},{"comment_id":"1013753742085664","commenter_b":"@username Babies suck!","commenter_a":"I used to dislike Clinton... I was uninformed and knew little about her other than what the right wanted me to believe. After some research and learning about all of her work on behalf of minorities, working families, women, and children over the course of her life and seeing her deal with adversity and downright deplorable behavior with strength, class, and grace, I am PROUD to give her my vote and my full support. I'll be voting Democrat down the ballot to ensure not only that she is elected, but that she has a Congress she can work with - not one hell-bent on obstruction. There is a reason she polls so much higher with EDUCATED people. #imwithher","post_message":"For 45 seconds, a drenched Hillary Clinton abandoned her script and let down her guard in Florida: @webpagelink"},{"comment_id":"10153976487996130","commenter_b":"we are living in the country that has no national insurance and crazy people can have a gun. poor sick people will die without government help and crazy people can massacre a lot of people easily and at one time with a gun.","commenter_a":"Kasa","post_message":"Another mass shooting. Another national address by President Obama."},{"comment_id":"1292853950724756","commenter_b":"Or marry him, or bear his children, or even be in the same room with him. Not worth any amount of money could buy a smart woman.","commenter_a":"Always a lady with class, dignity and honesty.","post_message":"She's absolutely right."},{"comment_id":"1015814318563348","commenter_b":"Illegals are getting benefits. Its not my fault that youre too much of an idiot that you cant see that. And because of our backwards government giving handouts to everyone of these assholes, theres not enough resources left to give them to the people who really deserve them. Stop being such a dumb cunt. Every chance i have to take part in getting rid of these parasites, you better god damn well believe that i will!","commenter_a":"And illegal immigrants shouldnt be in the us either. Have you seen the jails in this country? If you break the law, they lock you in nasty, unsanitary cages like fucking animals. If you break yhe law, you get what you deserve!","post_message":"These conditions should not be allowed anywhere, especially in the U.S."},{"comment_id":"10154420186151194","commenter_b":"Allah is shopping like à sodomized bitch right now","commenter_a":"who just saw that giant fuckin orb?","post_message":"LIVE: Anti-ISIS military op near Mosul, Iraq"},{"comment_id":"1776934572577306","commenter_b":"I will be voting for Hillary, because trump is grabbing pussy","commenter_a":"If you still plan to vote for HilLIARy after this, you must hate Trump more than you love your country. Think about it. Long and hard. Is your pride worth placing an untrustworthy, corrupt criminal, who flippantly handles our national security, in the highest office in the land?","post_message":"Hillary Clinton's campaign is waging a full-out war on FBI Director James Comey in the final 10 days of the election."}]
