[{"comment_id":"1230508030293998","commenter_b":"They can do this and the Toronto Blue Jays can't tell Gibbons to apologize to women?","commenter_a":"Charles once said he wasn't a role model. That's over. Well done to the Round Mound. Also, FWIW, while he has talked in the past about being a Republican, he has supported Democratic candidates consistently and all but begged Joe Biden to run for president before he came on the Final Four show.","post_message":"\"It’s my job, with the position of power that I’m in and being able to be on television, I’m supposed to stand up for the people who can’t stand up for themselves.\""},{"comment_id":"10154414829691051","commenter_b":"You've been programed on 30 years of BULLSHIT that has not stuck, she's not perfect no politician is but to have this mfer win is just off the fucking charts people will suffer from this including me but these racist mfers will suffer a rath of bs way worse when Gw was in office.","commenter_a":"I think it's a good thing. I honestly don't think that America would have a problem with a Female President, I just don't think that America wants Hillary Clinton to be that First Female President. She's got a rough track record, a record that has a lot of corruption and lies written upon said track record, and the American people see that. She's done a lot of great things in her life, but alas, being President will not be one of them.","post_message":"It looks like Hillary Clinton is done with politics for good. Is that good or sad news to you?"},{"comment_id":"1275439085806772","commenter_b":"Hopefully they'll rule it what it is, UNCONSTITUTIONAL and they can send all of the ILLEGALS back to where they came from. I don't know what it is about Liberals not understanding the concept of the word ILLEGAL! Maybe some of these Bleeding Heart Liberals that want these ILLEGALS here so badly will open up their checkbooks and homes to feed house and clothe these illegals. Oh wait, that's just wishful thinking...Liberals can't do anything without other peoples money.","commenter_a":"Sick of his abuse of the executive order. Be gone loser !!","post_message":""},{"comment_id":"10158855992795206","commenter_b":"Your taste is all in your mouth. This woman lies quicker than a spider can grab it's prey. Karma will be, her children practice her art, on her.","commenter_a":"Role model, amazing mother, classy and smart. Love her! #MAGA","post_message":"Today, Donald Trump named Kellyanne Conway as presidential counselor. Here are some interesting facts about her:"},{"comment_id":"1596151633736175","commenter_b":"This is what happens when their is no understanding of the real threat. Neither Iran or North Korea pose as large a threat as Climate Change. Not belief, understanding.","commenter_a":"Climate change does not matter to me North Korea and Iran want to destroy us probably a more urgent matter?","post_message":"Twenty-one kids and climate scientist James Hansen sued the Obama administration to take more aggressive action on climate. As of Thursday, the climate-change-denying 45th president has inherited the case."},{"comment_id":"464432047077736","commenter_b":"Bye, Felicia....go to that other planet where NOTHING will be different. ...the More of you we get rid of here, the sooner We can straighten the SHIT YOU CAUSED out","commenter_a":"Secondhand rocket for hire. Use at own risk.","post_message":"Elon Musk called the rocket landing \"absolutely perfect.\""},{"comment_id":"10153733130168855","commenter_b":"What an ugly hag.","commenter_a":"Its going to take gallons and gallons of makeup to hide her superficiality...","post_message":"\"Caitlyn Jenner wants attention, and she doesn’t especially care who’s harmed as a result.\""}]
