[{"comment_id":"10154001788011770","commenter_b":"They not that sexy to me at all need some meat on the bones Sarah Palin is sexy","commenter_a":"Mama's baby papas maybe They look nothing alike","post_message":"Gigi and Bella Hadid proved they are the sexiest sisters in the world at the Victoria's Secret Fashion Show."},{"comment_id":"1189361681104302","commenter_b":"'@username--you are right, she is a troll","commenter_a":"actually he voted for Ovomit","post_message":"These are the dangerous consequences of Donald Trump's hate speech."},{"comment_id":"10154178677146943","commenter_b":"Abedin is corrupt woman with an agenda..Hillary's agenda. Watch..if anyone goes down for corruption it will be her, and Hillary Clinton will get off by throwing her under the bus! It seems to me that HC always surrounds herself with live shields for her own protection. Everyone of them should be held accountable..starting with Hillary Clinton!! Why is she even a candidate?","commenter_a":"Lock them up...Lock them up...Lock them up!!!","post_message":"A Clinton Foundation donor and St. Louis-based political consultant begged Huma Abedin to get former Secretary of State Hillary Clinton to meet with her client, the U.S. largest coal company, according to emails released by a conservative legal group.  , I need your help now to intervene please, Joyce Aboussie, a Clinton Foundation donor with close ties to the former First Family, emailed Abedin in June 2009 after Clinton had been leading the State Department for about six months. - via The Daily Caller"},{"comment_id":"1116402168438318","commenter_b":"Darren VM They don't want the imbecile either, probably why he ran here! LOL","commenter_a":"I don't understand how this humiliates Obama. I don't understand why Michelle is included in this. I don't understand why any sane American will be for humiliation of an American President regardless of agreement on issues.","post_message":"Obama may think he's Europe's favorite politician, but Queen Elizabeth just made a stunning announcement that put Obama right in his place.  You know Michelle was furious when she heard about this."},{"comment_id":"10152510366081813","commenter_b":"Sound like another feminists that loves the idea of discrimination. Gee, imagine finding you here.","commenter_a":"And then ACLU discriminates by stating ' This one is dedicated to all the girls out there'.. LOL","post_message":"This one is dedicated to all the girls out there who prefer reading science fiction and history books to love stories.  @webpagelink"},{"comment_id":"10155302418745579","commenter_b":"lady, you need medication.","commenter_a":"My Grade for President Trump A-. Will go up to an A++ when those planted by the last administration to attempt a political coup are removed. My grade for Congress D- will go up when BOTH party's stop trying to slow down the executive branch and start working for the people .","post_message":"GOP Only: Your Grade of Pres. Trump & Congress?"},{"comment_id":"1247078658692220","commenter_b":"Bitch no it ain't, ole flat volleyball shaped head ass","commenter_a":"John H. Gonzales III this is @username hair style rn","post_message":"He needs a fitted cap asap!  #WSHH #Haircut"}]
