[{"comment_id":"533139670207659","commenter_b":"She can take her sorry ass over there and live bet they wouldn't let her stay long","commenter_a":"she is a complete WASTE AND NEEDS TO BE PUT IN JAIL ALONG WITH HER COHORTS..","post_message":"She is DELUSIONAL..."},{"comment_id":"10153891408869062","commenter_b":"Yeah","commenter_a":"Waiting on PA","post_message":"JUST IN: The Texas House Committee approved a bill to make marijuana legal for adults. It still has a long way to go before becoming law, but what do you think?"},{"comment_id":"10154423395266800","commenter_b":"Bitch you trippin","commenter_a":"The way Trevor Noah struggles with jokes, hardest job seems to be Jon Stewart's replacement","post_message":"Think your job is a drag? Try being one of Trump's surrogates."},{"comment_id":"10154448446471636","commenter_b":"If liberalism is bad, what, IYO, is good?","commenter_a":"The coup is being instigated by the political establishment and the media against the people who dared to vote in what they dictated was the wrong way. They are mobilising the generations brain washed by leftist infiltration of the education systems to do their will. This is going to get bloody","post_message":"'If you're still trying to convince yourself that a 21st century coup is not underway, please, please snap out of it'"},{"comment_id":"10152837238297483","commenter_b":"If you don't like it stay away, you certainly won't be missed .","commenter_a":"That's the problem in Alabama this history of Republican leadership we need more liberals to vote","post_message":"Columnist John Archibald weighs in on how modern-day Alabama fits into the Bible Belt:  'Alabama ignores that 'thou shalt not kill' commandment, posting the second highest murder rate in America in 2013, the last full year available. And blessed aren't its poor. According to the National Center for Children in Poverty, half Alabama's children are low income. Yet we still tax groceries.'"},{"comment_id":"10153510348059411","commenter_b":"serious lips on that lady, shes got Grace Jones beat even.","commenter_a":"She has no ideas worth repeating-FIRE her.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"765284786938035","commenter_b":"real women respect themselves enough to not get knocked up and then run from responsibility.","commenter_a":"The Colorado shooter's neighbors have been interviewed and his shack has been visited. Turns out he was...drumroll please...AN OBAMA-LOATHING PRO LIFE CHRISTIAN! Now who could've possibly seen that coming? The propaganda videos led the terrorist to carry out his deed. Sound familiar something going down a tad east of here?","post_message":"What a sleaze ball."}]
