[{"comment_id":"868758169887103","commenter_b":"crying about the NRA , every lobbying groups receives money from those they represent . Guns sell themselves , new models fly off the shelves and gun stores hardly discount. Women are one of the fastest group of gun owners in the country .Many single mothers and single women carry weapons , it is the best defense . Many women have stopped harassment , rape or assault because they were armed, weapon is often never fired .","commenter_a":"If you read the article, it sounds as if alcohol should be banned from campus. What the article does not say, is you still need to be 21 to legally have a handgun. That and you would still need your concealed carry permit. Concealed carriers are as a group less likely to commit crimes than even the police. Ever time carry options get more loose, liberals cry the streets will run red with blood, but the reality is just the opposite.","post_message":"These bills are moving through state legislatures across the country - here's what you need to know."},{"comment_id":"514466908734354","commenter_b":"We have enough homeless, and veterans who need out support. We need to stop being 911 for the rest of the world. Deport the illegals, Some say illegals do the jobs Americans won't do, then American's better start doing them.","commenter_a":"HEY OBAMA FORGOT ABOUT THIS LAW......Islam, by law, is prohibited from US immigration The Immigration and Nationality Act passed June 27, 1952 revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in Chapter 2 Section 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means.\" This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House.Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the ...","post_message":"ICYMI: \"A new Fox News poll shows 52 percent of the nation favors deporting the millions of illegals back to their home countries. Republicans and Democrats support Mr. Trump’s plan,\" writes Todd Starnes."},{"comment_id":"10153990107026955","commenter_b":"See you at Blade Show bitch!","commenter_a":"The rights to a free press, free speech, assembly, and religion are extremely important but none of them matters very much if you can’t defend your own life against aggression. Leave your hands off my guns!","post_message":"BREAKING: Active shooter at Lackland Air Force Base in Texas, at least 2 dead"},{"comment_id":"10152908039036491","commenter_b":"Exactly mark. What about people who use PED's? Where is that integrity?! Why isn't their team also punished? Wes Welker violated those rules with Denver. But it got retroactively sustained due to rule changes. Are you kidding?!?!","commenter_a":"In the end his punishment had nothing to do with deflated footballs. It was for behavior detrimental to the integrity of the game and the league. Read the letter to Brady explaining his punishment. Accountability goes a long way, too bad tb, belicheck and Kraft don't know the first thing about it.","post_message":"More bad news for Tom Brady."},{"comment_id":"10153530669581955","commenter_b":"HahahahahagagagagagahahahahahagahahahahagahahahagahahahahahahahahahahahahahahahahahahHahahahahahahahahahahahahahahahahahahahahahaha. Fucking HA! The bitch was married FOUR FUCKING TIMES. Maybe..... Just... Maybe..... SHE'S the one fucking our morals over? Hmmmm maybe YOU are the one fucking our morals over? Hmm","commenter_a":"I admire you..I would have done the same thing if I were in YOUR position..they are destroying the morals of our society..","post_message":"JAILED FOR NOT MARRYING THE GAYS"},{"comment_id":"10153647894113854","commenter_b":"Leave her alone","commenter_a":"You call this piece journalism? Now that's a long stretch.","post_message":"FLASHBACK: \"Megyn Kelly F**ks Brit Hume to Get a Job at Fox News\""},{"comment_id":"10153517218270329","commenter_b":"Yes, we do want what we can't have. Love what you have (unless you hate your big boobs. Then know there are ways to help a girl out).","commenter_a":"Having big boobs is a nightmare. I would never ever ever want big boobs again EVER!!!! Ladies with small ones have no clue what it is like and should stop pretending like they have the same issues. It is patronizing to women that really do suffer. And men, shut it because your opinion is not important when it comes to living with the issues that come with big boobs. OK, so have a great day everyone :))","post_message":"Hey there, boob sweat."}]
