[{"comment_id":"487880261407401","commenter_b":"He got her ass good","commenter_a":"@username bruhhh lol","post_message":"Barack Obama just hilariously roasted Bernie Sanders and Hillary Clinton. #WHCD"},{"comment_id":"476672599181287","commenter_b":"Speaking of closet queens... overreact much, Michael???","commenter_a":"This is one of the reasons that many on the right hate him. They believe that when people are treated equally, they (personally) are somehow diminished.","post_message":"President Obama highlights why the Kenyan \"non-issue\" of LGBT rights is an issue."},{"comment_id":"916443248422431","commenter_b":"Wow what a bitch!","commenter_a":"@username sad","post_message":"SMH: Mother Tries To Abandon Her Son In The Street!"},{"comment_id":"10154496837959170","commenter_b":"Only LAZY UNEDUCATED PEOPLE BELIEVE IN A LYING WHITE WOMAN-hillary.","commenter_a":"BOOM killary!","post_message":"Hillary promises to continue Obama's economic policies. The latest results of those policies came out this morning. Splat!"},{"comment_id":"10152894854427756","commenter_b":"I use paper condoms.","commenter_a":"Thanks Obama. *shakes fist*","post_message":""},{"comment_id":"1788948718006323","commenter_b":"Scumbags","commenter_a":"lol. Morons.","post_message":"Democratic Rep. Karen Bass of California labeled semi-automatic rifles \"weapons of mass destruction\" Wednesday."},{"comment_id":"939125846176797","commenter_b":"@username - absolutely, only 2 children & no marriages in what 8 years - that's actually fewer children that I would expect. She MUST have been using birth control.","commenter_a":"The audacity of this woman is amazing. She preaches abstinence, and criticizes women and girls for being irresponsible, all the while doing whatever the hell she pleases. I think having to pay child support is small potatoes compared to her hypocrisy. Karma will get you sooner or later. Pay up Bristol, it's your turn.","post_message":"Bristol Palin brought this upon herself. After all, she could have just practiced what she preached. Now, it's her turn to take responsibility."}]
