[{"comment_id":"10153282671259087","commenter_b":"@username We, obviously, are not idiots. Kinda shows with other comments. I have a fgreat idea, let's let all the illegals move in with you. Open your arms, and say welcome!!!!!","commenter_a":"Facts that can't be argued about Donald Trump. The man has been under attack since the day he announced. He has exposed how special interest groups, lobbyists and campaign donations corrupt our government admitting he himself has purchased favors. He has exposed media to be the bias self-serving thing they are. We've seen that he is right. Trump has told us what needs to happen to turn this country around. It's the cold hard truth. Trump has spent decades negotiating billion dollar deals with the toughest business minds on the planet and come out on top huge. Bankruptcy? Never has Trump gone bankrupt. He has over decades purchased failing businesses and used bankruptcy laws to restructure those and prevented those from failing. But 4 out of hundreds? Let's say 100. That is a 96% success rate. What experience does he have? He has dealt with politicians, world leaders and perfected ...","post_message":"“If anyone else was in Trump’s position they’d be viewed as the inevitable nominee,” said one former Reagan administration official who supports Donald J. Trump. “I have never seen a group of people so obtuse as to what is going on outside of Washington that they feel comfortable writing Trump off. They’re finally just now coming to the realization that he’s going to win.”"},{"comment_id":"10153486383431037","commenter_b":"So how many cops takes to capture one guy?","commenter_a":"Tantiana Valentina","post_message":"MORE DETAILS: Second escaped prisoner shot by police, in custody and taken to hospital"},{"comment_id":"10156011468900354","commenter_b":"Worse than that she made jokes about it, shameless woman.","commenter_a":"say what you will, but she is, always has been, and always will be a liar , crook, theif and a criminal. Just say no to Killary.","post_message":"Hillary's got jokes! About breaking federal law and endangering national security--what a hoot!"},{"comment_id":"1233928029975949","commenter_b":"I got it!! She can't open her mouth without lying through her teeth!","commenter_a":"A few reasons not to vote for Hillary: 1. Knowingly and intentionally destroyed evidence in a criminal investigation. 2. Allowed Americans to be slaughtered when they could have been saved, then lied to the victims families and the American people about it. 3. Rigged the primaries against Bernie Sanders. 4. Selling military equipment and other favors for donations to the Clinton Foundation. 5. Threatening victims of her husbands sexual indiscretions. 6. Risked national security by sending classified information over an unsecured server. 7. Has lost her license to practice law due to dishonesty. I could go on and on with filegate, whitewater, etc., but I think you get the picture.","post_message":""},{"comment_id":"10154259751471509","commenter_b":"What because he supports the laws of the land? Yeah. Illegal immigrants are illegal. Period. Muslims harbor terrorists.. Period. We are 19 trillion in debt. Will take a business person to get out of it, not a crooked politician who put us here..period.. I can keep going","commenter_a":"That's the main reason Trump will be elected, we the people are pissed, Hillary lies, Obama lies, Congress lies and the media lies for them","post_message":"Ever felt that politicians were fibbing? Several CNN Opinion contributors weigh in on truth and lies in the political realm."},{"comment_id":"10155273231713132","commenter_b":"She has medicine that causes it, you hateful witch!","commenter_a":"Umm not a role model for my child, sorry. Good dancing though, kid seems happy","post_message":"You go girl!"},{"comment_id":"791518854323422","commenter_b":"@username She won't even make it out of 2016 before being arrested!!","commenter_a":"When I voted in Virginia on 10/13/2016, they never checked my ID. Just sayin folks .................. better watch these cheating people .... just in case!!!!!","post_message":"Live Now: Donald J. Trump speaks at a rally in Johnstown, Pennsylvania."}]
