[{"comment_id":"10153792298068271","commenter_b":"The ignorance of those bottom feeding illegals is who are to go, or die. We are not talking of the folks here legally. Your ignorance is proven. No more handouts! !!!!! Work, or die. I approved this message. If you are illegal then get out now! !!!!! Or you might have to go the hard way. LOL. Lock N Load, Simper-FY! !!!! Burn the Mexican flag, you are either a American or your not. If you carry that fag, Ops, I meant Mexican flag, you should be returned to that filth country right away.","commenter_a":"According to the United States Census Bureau \" By the year 2050 (which is not that far off) one in every three Americans will be Hispanic \"legal and illegal, The Trump family will not be happy. Incidentally. Census bureau is a reliable and credible source. Celebrating Cinco de Mayo weekend :)","post_message":"\"His business was built on the backs of Latinos that helped him become successful and what he boils that down to is eating a taco salad.\""},{"comment_id":"1510465682300437","commenter_b":"Drained the swamp by putting the gators in his bathtub. What happens when they attack him and each other? Too much love of power and love of money in a small space.","commenter_a":"Well, with all his wealthy Cabinet appointments, we can thank Trump for finally draining the swamp, which is unpresidented.","post_message":"This just happened. He said it! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153235408755090","commenter_b":"Can anyone tell me why Hillary wants to be President?","commenter_a":"Another \"heir apparent \" to the presidency.","post_message":"One question: Why don't you want Hillary Clinton to be president? Tell us here: @webpagelink"},{"comment_id":"1019119028118150","commenter_b":"Majority of the worlds wealth belongs to Caucasians. It's not news anymore.","commenter_a":"Wow lost all respect for this station. Seriously? I know there is more important news that doesn't have to deal with comparing races.","post_message":"Report: Whites have 12 times the wealth of blacks See study--> @webpagelink"},{"comment_id":"984289534964128","commenter_b":"Easy. Stop all benefits to foreigners.","commenter_a":"Foolishly, in October 2014 Italy left-wing government became the first European Union country to decriminalise illegal immigration and deploy its navy at huge expense to save migrants crossing the narrow Sicilian channel in open boats from North Africa (Libya mainly) in order to bring them to Italy and thus the European Union where most remain. The policy change, driven by a perverted mix of human decency and political correctness, was pure folly: it has acted as a green light to wannabe boat people everywhere, whose numbers soar as the chaos in Africa and the Middle East escalates. The result is an exodus of biblical proportions out of Africa and the Middle East into Europe. The Welfare System in Britain and Ireland is the main attraction for these illegals. Action needs to be taken now to STOP this Exodus!!!!!","post_message":"Forget the Greek crisis or Britain's referendum, this wave of migrant's is Europe's biggest threat"},{"comment_id":"10158188671665231","commenter_b":"Not to change the subject but is the android in the picture holding a giant marshmallow or giant roll of toilet paper?!?!?! Just asking","commenter_a":"Rich Jones","post_message":"Google wants you to know that #BlackLivesMatter."},{"comment_id":"10153036681682235","commenter_b":"You bitch I hope he shoots you right between your eyes.","commenter_a":"it is a sick movie about a truly sick man who was used by his government. Instead of treating his sickness they increased it and used it to kill.","post_message":"Fox News host gets off on killing."}]
