[{"comment_id":"10153802169701519","commenter_b":"Lol that's it. I'm mad women can do something. You got me. Get real","commenter_a":"No it isn't. Feminism is. Hey dummies you realize this whole free love shit means men win right? You don't want to make a man commit, so men sleep with you and then drop you when they want. They don't have to commit or treat you right because they can go find some other chick not interested in holding a man down, fuck her then leave again. Men win you idiots","post_message":"Literally."},{"comment_id":"1385476598133803","commenter_b":"@username Total dumb ass","commenter_a":"I say that's bullshit, race problem was minimal until we got this racist Muslim traitor idiot in the white house, Obama administration and his friends are the problem with this country now.","post_message":"The majority of Americans say there's still widespread racism against African-Americans in our country. Do you agree or disagree?"},{"comment_id":"10153657681658984","commenter_b":"We have lost respect for megan and will not watch her show. I didn't think fox news would stoop to that level of questioning.","commenter_a":"What you call journalism, is piss poor.","post_message":"What Megyn Kelly just said may end the rowdy Trump/Fox feud...then again...  Do you think the Fox News personality did the right thing here?"},{"comment_id":"10153766225688132","commenter_b":"the laws about women showing constant pictures of themselves naked have to change, really sick of seeing all her plastic body parts.","commenter_a":"Please change yourself first phony woman","post_message":"\"These gun safety laws have to change!\" - Kim Kardashian"},{"comment_id":"973903779296042","commenter_b":"One of the stories the parents were arrested because they did it:( it wasn't an accident.","commenter_a":"I really enjoy reading all the comments by individuals who apparently parent in the most perfect way. (*said sarcastically*) It is so easy to judge someone else, heaven forbid some terrible accident happens on your watch and you have complete strangers calling for your head. In any case, my heart breaks for this family and the loss of their child.","post_message":"#BREAKING A 2-year-old has died after falling into an unsecured septic well near Burlington. >> kiro.tv/SepticWell  Henry Rosoff is heading to the area to learn more on this heartbreaking story."},{"comment_id":"10154220387809312","commenter_b":"The girl should have been dealt with a lot sooner than 2 years!!","commenter_a":"They should have all bought headphones and blasted The Bible on tape.","post_message":"When the noise first became an issue about two years ago, Saylor said she would knock on the door and ask her neighbor to quiet down. It didn't help."},{"comment_id":"10152935961526717","commenter_b":"Marriage laws are in the USA,not in Africa,this is and excuse to a naked street party","commenter_a":"I'd like to protest Kenya's murdering of gay people for simply being #uncivilizedculture","post_message":""}]
