[{"comment_id":"728966150600250","commenter_b":"FEMALE ON THE NEST","commenter_a":"Where is the first baby ?","post_message":"WATCH LIVE: We're ringing in the new year with Harriet, M15 and their new eaglet!  We're still waiting for the second egg to hatch!  Where are you joining us from tonight?  WATCH the video of the hatching- @webpagelink Pix provided by Southwest Florida Eagle Cam"},{"comment_id":"10153974318380496","commenter_b":"Let them protest but not riots, vandalism and violence. These people r starting to scare me. Saw a sign outside trump towers saying rape melania and kill trump. What kind of people r they. Trump has to stay cool and not start tweeting.","commenter_a":"Thank God someone with common sense.","post_message":"While protests in Atlanta and around the country have been peaceful, that isn't the case for all. Now a major city's officials are saying that enough is enough.  “If you’re upset with the election, please don’t come out and protest,” the city's police chief said. “We are done with criminal activity in this city. It’s time to move on and to move forward.”"},{"comment_id":"10154390282749411","commenter_b":"Yeah, only to let them in later since we have open borders with yhem","commenter_a":"@username Lessa Katherine but sure.. let them into europe haha","post_message":"'This is my sincere thought'"},{"comment_id":"587813824710682","commenter_b":"Fuck Clooney! Trump 2016!!! Build that wall!!! Go Trump!!!!","commenter_a":"The rich have no idea because they live in there own world behind gates and walls take away all that and see how they feel","post_message":"“But the problem is all these other countries hear these things, and all of a sudden you see in France that [Jean-Marie] Le Pen is going, ‘Bravo,'” Clooney added. “You get all of these nutcases on the far-right fringe saying, ‘Well, if America thinks that…’ That is the real problem with Trump—his ideas bleed into the rest of the world.”"},{"comment_id":"10153293386166051","commenter_b":"And he should step down.....","commenter_a":"I'm with him!","post_message":"Do you agree or disagree with this judge's position on marriage?"},{"comment_id":"1125221904203952","commenter_b":"Wow...you can't judge an entire religion by the actions of a few?!!! wow...where have we heard that before? yet...it goes ignored, until that line of thinking works for the christian cult members....then its supposed to be real........nice one cindy! this is just more proof that there is no such thing as \"GOD\"....or if one is up there, he is a mean spirited, vindictive SOB and i want nothing to do with him","commenter_a":"I hope all these co called Christians that praise what has happen have something awful happen to them Human beings were killed it does not matter who or what they were. You poeple should be ashamed","post_message":"This is not how decent people react to tragedy."},{"comment_id":"10156223165790354","commenter_b":"Hell no they wouldn't. I'm still waiting on them to post the story about the white guy in South Dakota, that accidently shot his penis, while purchasing a gun illegally and tried to blame it on a black guy. They didn't even post the story about the white people in TX, that vandalized their vehicles and tried to put the blame on BLM. This page is a joke.","commenter_a":"I wonder if @username would have featured this news item if the chick was white ? Somehow I doubt it.","post_message":"And look what ELSE she did..."}]
