[{"comment_id":"10154308989386028","commenter_b":"Haha no way","commenter_a":"Screw San Diego all the tight pants wearing hipsters they can keep their f****** team","post_message":"A plan to move the San Diego Chargers to Los Angeles is almost a done deal, multiple sources tell NBC4's FredNBCLA. @webpagelink"},{"comment_id":"735467686595927","commenter_b":"Immigrants are welcome here. Illegal aliens are not.","commenter_a":"I'm very proud of my family's race. I'm white my stepfather is Mexican and he's from the states my grandparents are from Mexico so I believe that they have the right to come to the United States and make something out of yourself and y'all want to say here and criticize them being immigrants and using us for money when they're the ones that will work harder than any other people . So as I was raised this post be a free country and we supposed to love each other not hate each other and be there for each other. But with everybody with all this hate and everything yeller going to regret it because the day that you have to go and speak to the heavenly father is the date you're going to have to answer for how your reactions are everybody should be equal. So I'm very proud ...","post_message":"Live from Donald Trump protest in River Oaks: coverage all day on Eyewitness News"},{"comment_id":"10153001581342377","commenter_b":"right CMc and send their illegal babies with them If they weren't made in America they are not American stop giving them birth certificates you just encourage illegals to come here Is this hard to understand??","commenter_a":"It's the law. They are here illegally and, according to the law, they must be deported. Trump didn't make the law. All he's saying is that he would enforce it. The government has no problem enforcing other laws that people disagree with; why should this be any different?","post_message":"Trump's Proposed Deportation Effort..."},{"comment_id":"1759531520987240","commenter_b":"@username Trump's wife was an immigrant and all she did to cum to U.S., is spread her legs!","commenter_a":"My native American vote for Trump although the Chief of the Cherokee tribe supports Hillary Clinton. Trump President of the United States 2016 all the way to Trump Towers aka the White House. Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not stirring a race war. Trump did not leave any US soldiers in Benghazzi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of ...","post_message":"It is time for rule by the PEOPLE, not rule by SPECIAL INTERESTS!"},{"comment_id":"1005311662842639","commenter_b":"I would have kicked her in her taco real good!","commenter_a":"Damn what a sicko.","post_message":"This nun decided that students needed a hardcore lesson in Jesus' suffering -- so she stabbed a kid in the forearm."},{"comment_id":"519371271599548","commenter_b":"He did not mention deporting a large number of illegals, he did not mention anything about building walls, that's why he failed to stop the influx of illegal immigrants that we have now. Nothing is impossible, if we want to do it. If we can dig tunnels below, we can build walls above.","commenter_a":"It doesn't sound like trump at all. That's most probably what trump should have said. Everything bill Clinton said has been implemented. He doesn't mention deporting 12 million people (impossible to execute), he doesn't mention building a wall (idiotic and impossible to execute)... So no, doesn't sound like trump at all. This sounds like someone that actually has a executable plan, unlike trump. Not to mention calling a whole nation rapists, murders and drug dealers.","post_message":"Do you think this sounds a lot like Donald J. Trump?   MORE: @webpagelink"},{"comment_id":"876368152479964","commenter_b":"She is ugly.","commenter_a":"wow","post_message":"OUCH!!!!! This is a MUST WATCH! This video of a serious Michelle Obama takedown is going viral fast.  'LIKE' if you think Michelle gets exactly what she deserves. @webpagelink"}]
