[{"comment_id":"1923069711254227","commenter_b":"so far 1.5 million people have liked my last comment PERIOD!!!","commenter_a":"My gawd it's an immigrant disrespecting the flag! Shouldn't O'Reilly and Hannity be all over this? Lqtm","post_message":"Oh, how they would SCREAM!  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10156236766360354","commenter_b":"WHAT??? It doesn't designate the Black Lives Matter and the Black Panthers as terrorist organization for constantly calling on blacks to kill cops and white people and CAIR, but they want the NRA designated as one even though they threaten no one? This is absolute bullshit & I'm so tired of the attack on our 2nd Amendment rights!!! We MUST stand against this!","commenter_a":"NOT","post_message":"Here's how far the Left is going with this..."},{"comment_id":"10153906452296409","commenter_b":"Hahahah This is all she has. Anger lies and name calling. She would make a horrible leader. Sorry it wasn't a poll. This is the article. Trump lies more than Hillary. So what. He still will not be the next President I can't wait for you to make America Great/Safe again!! These attacks have to stop taking the lives of innocent Americans. We need a Leader that will call the enemy by name! Trump2016!!! Is there an actual plan as to where all this extra revenue will go towards? Will our personal taxes and property taxes go down? I am a deplorable TRUMPAZEE and love every moment of it. ANOTHER NO pic, NO history and NO friends TROLL - F/B is being flooded with these locally and from FOREIGN countries And why would he? He has made it this far and hasn't released them yet? It's an unnecessary risk to ...","commenter_a":"Are they crazy? Trump has had same platform and mantra since day 1. Hes not the one who bleached his servers and beat them with a hammer AFTER being subpoenaed. That was hillary","post_message":""},{"comment_id":"10155543749229778","commenter_b":"Perhaps she is the right choice since we'll be obstructing the GOP for the next four years...","commenter_a":"Things are going great. More of the same!!!","post_message":"Rep. Nancy Pelosi won another term Wednesday morning as the leader of House Democrats, turning back calls from some in recent weeks who said it was time for a change."},{"comment_id":"962901507102931","commenter_b":"Evil mother!!!","commenter_a":"That's just cruel!!","post_message":"This is what happens when a mum feeds her toddler a spicy Jalapeño chilli pepper ... 🌋🔥"},{"comment_id":"10154540555266509","commenter_b":"Parental responsibility not blame the gun.","commenter_a":"more guns would have prevented this","post_message":"\"He shot straight through. \" The Florida pro-gun activist was accidentally shot by her 4-year-old son, authorities say."},{"comment_id":"1588802614746840","commenter_b":"You said all the things Hillary and Democrats did, what is Trump's contribution to the development of America? And all you said are lies. Get your facts right! Compare the economy of the country before Obama era and Obama's era. You talk about the Islamic terrorist but you failed to make mention of the domestic terrorism in the country.","commenter_a":"In defense of Donald Trump : Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not starting a race war. Trump did not leave any US soldiers in Benghazi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion dollars. ...","post_message":"Father of Muslim U.S. soldier killed in Iraq: \"Donald J. Trump, have you even read the United States Constitution? I will lend you my copy...You have sacrificed nothing, and no one!\" @webpagelink"}]
