[{"comment_id":"10154896780339411","commenter_b":"Why is that boot still in charge. Get her out !!!!","commenter_a":"Says the leader that advocates the EU: one of the biggest protectionism rackets on the planet!","post_message":"'Globalization is happening. We can arrange it such that we strengthen multilateral instruments... or such that we seal ourselves off and become protectionist', said Angela Merkel."},{"comment_id":"10154202048116336","commenter_b":"piss off, Dirty Mary. We're having fun!","commenter_a":"Who cares lol. We have terrorist cutting people's heads off and we are freely bringing them HERE to America and your talking about this nonsense? Wow!","post_message":"Miranda Lambert brought a date to the ACM - Academy of Country Music Awards! Lambert, who split with husband Blake Shelton in July, brought her new boyfriend Anderson East. @webpagelink"},{"comment_id":"1126542647424270","commenter_b":"@username oh I wouldnt doubt that, that witch needs to go down!!!!","commenter_a":"Not the first time this reporter has accused someone of the same type of assult, just another reporter looking for the spotlight!!!!","post_message":"The Secret Service just dropped a massive bombshell about the charges against Donald J. Trump's campaign manager, Corey Lewandowski... this is huge. What this agent says about the \"assault\" will completely change the case..."},{"comment_id":"821893891240198","commenter_b":"Yes she does I don't believe not one of them dumb as hoes","commenter_a":"If Phylicia Rashad wasn't present when these incidents (allegedly) occurred, (but I would bet they did), then she has nothing of concrete value to say.","post_message":"“Forget these women. What you’re seeing is the destruction of a legacy.\" - Phylicia Rashad"},{"comment_id":"1196095087116904","commenter_b":"This women is craving Attention poor thing","commenter_a":"And they call this art !!!! How ??? Not on !!!","post_message":"She's doing what?"},{"comment_id":"10153471115269087","commenter_b":"If i was Trump i would stay away from that dumb broad.","commenter_a":"GO PRESIDENT TRUMP 2016!!!!!!","post_message":"You’ve also said, “She can pick winners!'\" Bristol Palin said of her mother Sarah Palin. \"I hope you’re right, and that she endorses Donald J. Trump today for President.\""},{"comment_id":"10153858711711162","commenter_b":"Hell Indianapolis too","commenter_a":"They would get killed in da Chi anyways","post_message":"Illinois will stop accepting Syrian refugees in wake of the Paris Attacks... @webpagelink"}]
