[{"comment_id":"10156198873145354","commenter_b":"Screw Faux News and that bitch Megyn Kelly.","commenter_a":"FOX is decending to a new low leval! I used to have it on all the time but now i will just tune in for one program!","post_message":"We have the intense Twitter exchange between Donald Trump and National Review editor Rich Lowry. Read the tweets!"},{"comment_id":"1069713516429844","commenter_b":"My Father and his family came through Ellis Island. They had to have a sponsor in the United States who guaranteed them a place to live and support until they were self-supporting. They were screened for disease. My Grandmother was almost refused because she was sea-sick for the whole journey. The government officials had to determine that it was only sea-sickness before she was admitted. Now, we have no idea what illnesses are being brought in to OUR Country through all these illegals and obummers immigrants. No wonder illnesses that we have virtually eliminated are cropping up now.","commenter_a":"Absolutely the way that it should be done!","post_message":"America's Freedom Fighters"},{"comment_id":"10153862948491523","commenter_b":"You think women put these objects in themselves? This was a product recommended and approved by from their doctors. STFU","commenter_a":"Stop putting foreign objects in your body!","post_message":"Some of the women experiencing adverse affects from Essure are relieved to get hysterectomies to get the coils out."},{"comment_id":"1183094928399954","commenter_b":"Hate this woman!","commenter_a":"Imagine that.","post_message":""},{"comment_id":"1146865702064592","commenter_b":"OMG, Catherine. Did you really say that? go wash your brain out with soap.","commenter_a":"Hillarys people Bribed the FBI to changed subpoena documents and change it from classified to a lower classification . If they can do something so illegal and get away with it. Think how the government can come after ANYONE! the Media owned by global elitist, Hillary is their puppet.","post_message":"Image from Meme GOP"},{"comment_id":"1142853059119585","commenter_b":"So's my father. Personally, I served a three year tour in the US Army.","commenter_a":"No! George Bush was in the service. But no one knows how he got out.","post_message":"Don't you EVER forget this... nor let these Republican chicken-hawks send your children off to die in wars for profit."},{"comment_id":"1199381900178382","commenter_b":"They were not illegals!!","commenter_a":"#WomenAgainstSessions #LGBTQAgainstSessions #MinoritiesAgainstSessions!!!!","post_message":"WATCH: The Senate Judiciary Committee meets to vote on Attorney General nominee Sen. Jeff Sessions, hours after the firing of the acting attorney general. Read more: @webpagelink"}]
