[{"comment_id":"10152782186121130","commenter_b":"I can't even blame her decision(which I do feel is extreme) but seriously what's with these whacky doctors who are willing to do these surgeries, where's THEIR head? Enormous breasts, huge ridiculous lips, \"body fillers\" etc it's disgusting.","commenter_a":"Miss dumbdumb. Shame ppl just can't accept what nature gave them. Or at least find safer ways to enhance/change.","post_message":"\"I'm paying now for my vanity.\""},{"comment_id":"494202484098498","commenter_b":"Do they want her cause America doesn't want or her trashy ole man and her entire trashy family oh and take Bruce with them too","commenter_a":"If you vote for Hilary , I'd be scared as much as she travels.","post_message":"Is Kim Kardashian West a secret agent? @webpagelink"},{"comment_id":"10154592077846756","commenter_b":"Good grief. I could pee a puddle deeper than her.","commenter_a":"She will never be first lady.","post_message":"As she readies to address the Republican National Convention Monday night, it's not so clear exactly what kind of first lady Melania Trump would be. But she's left some clues."},{"comment_id":"10154840580075695","commenter_b":"Go Hillary!!!!!! Vote blue!!!!!!","commenter_a":"#voteblue","post_message":"People fainting, 3-5 hour waits in line and it's only day 1 of voting. Local elections officials say today was the biggest turnout they have ever seen for early voting in an election. @webpagelink"},{"comment_id":"10153536976196336","commenter_b":"Talk to Moon beam aka governor Brown of California. It is in San Francisco that an illegal alien killed a beautiful person. He encourages sanctuary cities for illegal immigrants and lets them get drivers licenses and so with liberals it's take from the people who work and pay taxes and let them pay for all the illegals. I don't want to give my hard earned money to whatever the state chooses to spend it on but liberals will continue until they are ousted. And that goes for Republicans as well. No one in either party deserves to hold office if \"our\" welfare doesn't come first. And I don't mean welfare as in free stuff.","commenter_a":"what...how can any illegal alien hold a government position? Oh yeah...California the land of goofballs.","post_message":"\"This is worse than sanctuary cities. Now we're giving them sanctuary boards.\" – Neil Cavuto"},{"comment_id":"1862910250609136","commenter_b":"Girl bye, take your dirty mouth with you","commenter_a":"Go to Gitmo you A hole!","post_message":"Lol. Celebs can't even."},{"comment_id":"10154273295026051","commenter_b":"Illegals cant vote genius, doesnt Trumps morin base know 95% of his workers are illegals working on HB2 visas ? He games the laws to get illegals to work for less money because he says he cant find experienced US workers, he thinks Americans are fucking idiots and lazy and Boy did he get that right !!","commenter_a":"Once you take all the illegals out, she will have lost the popular vote too. The electoral college was created for a reason. Should not be changed!","post_message":"Hillary Clinton continues to increase her lead in votes over Trump despite losing the election. Do you think the electoral college should stay?"}]
