[{"comment_id":"10155017409098896","commenter_b":"I'm ok with a trump wall.","commenter_a":"Figures !","post_message":""},{"comment_id":"889430217827633","commenter_b":"@username alright Kim calm down!","commenter_a":"Ellie Metchette @username","post_message":"It will be in 2017 and here is the new teaser trailer. // Stranger Things"},{"comment_id":"10153885650817061","commenter_b":"@username , please take the tin foils off. For Benghazi, blame the Republicans. All of what you are saying about HC is all conspiracy based. EVERY investigation ha cleared her of wrongdoings. She is not perfect, but far better than that lying rapist BIGOT woman hater thief (ask the thousands of people he stiffed out of their money) IDIOT DT.","commenter_a":"Oh...don't mention Indiana! We are not proud that we have idiots voting for him!","post_message":"Sign of the times: Donald J. Trump supporter from Indiana says he's gone to great lengths to protect his yard sign with the candidate's name on it. So far, he says, \"I'm 2 and 0.\""},{"comment_id":"10152999859350090","commenter_b":"He is gone. Concentrate on what is happening NOW!","commenter_a":"yes , in my lifetime. Teddy Roosevelt runs neck and neck. different reasons.","post_message":"Tell us if the Gipper tops your list. The Historical Presidents Poll: @webpagelink"},{"comment_id":"10154135528287541","commenter_b":"Cops can not go around just asking people to show their ID without them committing a crime or breaking the Law!!!","commenter_a":"The Police needs to know and learn what the Law actually states!!! Because what they did is against the Law... American Citizens do have Rights!!! If they oppose to it or not!!! The cops should not be above the Law!!!","post_message":"They Tasered a black man in the face who was actually a part of their team."},{"comment_id":"10153742878600575","commenter_b":"Deport them","commenter_a":"Aren't we all supposed to be brainwashed by the communist media maggots that this is the \"peaceful religion\" ?","post_message":"Muslims blew up city Christmas tree."},{"comment_id":"1786411671679890","commenter_b":"Fucker","commenter_a":"@username sheep bitch","post_message":"100% accurate!"}]
