[{"comment_id":"10153696504537300","commenter_b":"Fidel Castro is a white elitist who took from everyone regardless of race.","commenter_a":"So this is written by someone who \"escaped\" from Cuba 46 years ago and found \"safe haven\"...please! More from the wealthy elite, whiter Cubans who wanted to keep the poor suffering so they could benefit. Tools of the racist and capitalist US government in their mistreatment of Latin American nations and Indigenous and Black people throughout the Americas!","post_message":"The latest from columnist Fabiola Santiago on the need for reform of the Cuban Adjustment Act. What do you think?"},{"comment_id":"10157243305955354","commenter_b":"Then get to work.","commenter_a":"She could move out of her government subsidized housing if she actually had any employable skills.","post_message":""},{"comment_id":"10153750780819062","commenter_b":"Why would you trust two gals that looked like that for anything cosmetic?","commenter_a":"Hope they catch them","post_message":"Police have issued arrest warrants for two people in connection to the death of a woman who police say received injections of a substance in her buttocks in a botched cosmetic procedure."},{"comment_id":"10156256559580354","commenter_b":"Sure she will, and we will all be getting shot by the crazy people who get guns illegally","commenter_a":"And how many guards does she have!! And I bet we paying for them!!!!","post_message":"Hillary pledges her assault on 2nd Amendment freedoms."},{"comment_id":"10153442947898908","commenter_b":"This is wrong. I can just tell you it is wrong because of decay and expansion. We know that the universe was something different even if that was just a tiny speck. The way the article reads as if the universe has always been the way it is now and that is not the case. All these bible thumpers who don't understand basic science or astrophysics will use this to try to say God is real.","commenter_a":"the end is the beginning.... the beginning is the end...","post_message":"This is a tough thing to wrap your head around."},{"comment_id":"1419424701411870","commenter_b":"Um no","commenter_a":"Peter Di Benedetto","post_message":":O"},{"comment_id":"10154147763835329","commenter_b":"She wouldn't understand","commenter_a":"@username do it to Sydney","post_message":"how to know your sibling is on drugs"}]
