[{"comment_id":"10154206928052431","commenter_b":"Politicians are non caring, or deliberately killing us. After all look at what Jackson did. Small pox ridden blankets. Yep and their attitude has not changed since. Maybe we should force better care of our people and not of these illegals.","commenter_a":"This is so very true. I was a cancer patient. Actively seeking medical help for confirmed CANCER in my body. The doctor at my clinic simply didnt show up for my first 3 appointments. All I needed was a consult, so they could refer me to an oncologist and behin treating the cancer. The first appointment was scheduled 1 month out, when the doctor didnt show, they had me see a nurse who confirmed I needed to be seen as soon as possible, and they scheduled me for 2 weeks later. Then, the same doctor didnt show for that appointment and it was another 2 week wait. Finally, on the 3rd no show I threw a fit and the clinic agreed to let me see a younger doctor who was actually in the clinic. And finally, after 2 months I got my referral to see the oncologist. In addition, because ...","post_message":"Natives Are Dying Because IHS Can’t Assure Timely Access to Health Care  @webpagelink"},{"comment_id":"10153103195541491","commenter_b":"Clearly a publicity stunt again, the shark is obviously a mate of his","commenter_a":"fake shark..","post_message":"Mick Fanning had another close encounter with a shark."},{"comment_id":"355920354532026","commenter_b":"She does not care about you!","commenter_a":"okay, the need and movement for change I support and believe in, but sorry HILARY CLINTON no vote from me","post_message":"“We’re hoping that we can partner with Hillary to get some true change for all people.” —Maria Hamilton, mother of Dontre Hamilton"},{"comment_id":"513866205470626","commenter_b":"This IS STILL AMERICA and I'll go where ever I want, if those pigs fuckers try to stop me it will be the last thing they do before meeting allah in hell","commenter_a":"They need to obey American laws. As all do who live in this great country.","post_message":"Video coverage from the Shariah 'No-Go Zone' has been released.  This is America. If you don't like it you can get out.  Do you agree Shariah Law should be banned in America?"},{"comment_id":"10153263146396833","commenter_b":"She dont need a gun anyway, Shes got a face that would stop a train !","commenter_a":"Start living in the real world, hoodlums are not giving up their guns. Wake up and smell the roses gabby","post_message":"On March 4, gun control proponent Gabby Giffords joined Democrat lawmakers on Capitol Hill to push for expanded background checks on all gun sales.  Anti-gun Representative Mike Thompson (D-CA), who supports banning commonly owned semi-automatic firearms owned by millions of American, is spearheading the push."},{"comment_id":"1311480565578355","commenter_b":"@username. She in Aussie. This yo opportunity to get rekt by her wrecking ball. Heh.","commenter_a":"Noooooooooooooooooooooo we don't need pollution here","post_message":"Miley Cyrus could soon be calling Australia home."},{"comment_id":"1002765619855375","commenter_b":"She's not that classy oh wait well anyways lmfao whatever get off the trip people smh","commenter_a":"I think it's funny how she's trying to show \"modesty\" When we've all seen her naked already. Lmao","post_message":"Social media thinks Melania is channeling Jackie O this morning. Your thoughts? @webpagelink"}]
