[{"comment_id":"1075434165805577","commenter_b":"I'll make my own mind up thanks","commenter_a":"BS","post_message":""},{"comment_id":"1752150585035881","commenter_b":"@username WE ARE GOING TO WIN HITH Hillary Clinton","commenter_a":"Interesting double standard. After all the horrendous things he's said about her this campaign, and the pathetic name calling, she offers one funny and spot on zinger and once again he has to have the last word.","post_message":"Watch the moment Donald J. Trump called rival Hillary Clinton \"a nasty woman.\""},{"comment_id":"10153758605053132","commenter_b":"These woman work these jobs to get rich. Tigers Woods wife was a nanny Arnold Schwarzenegger's, house keeper, now this chick. These women plot & plan to insert themselves into the money by any means necessary.","commenter_a":"Bad woman what goes around comes around! She will be sorry! Down with Affleck and her!!","post_message":"She's staying busy."},{"comment_id":"1347295655336172","commenter_b":"Go touch your vagina","commenter_a":"I hear bruce","post_message":"Caitlyn Jenner is speaking out after Trump withdrew protection for trans students."},{"comment_id":"10153078698497994","commenter_b":"Ucs ? Every district around them closed! who are they competing with? This lady shouldn't be a superintendent of a kennel let alone of our children!!!","commenter_a":"378 schools closed today and a handful of are schools still open that has to be frustrating to parents, teachers and students. This is one situation it's not okay to stand out","post_message":"Nearly 300 schools are already closed this morning (including Detroit Public). You can check out the list here."},{"comment_id":"10153042580654411","commenter_b":"What a bitch ^^","commenter_a":"I condemn whatever happened in Paris and whoever did it wasn't a human for sure. But this is a shame. They kinda provoking people to do stupid stuff and it's like fuel on the fire. Shame on Charlie Hebdo","post_message":"'We will not give up, otherwise all of this will not have any sense.'"},{"comment_id":"10154250290881337","commenter_b":"YES, WE UNDERSTAND THAT YOU ARE NOW A WOMAN, DO US ALL A FAVOR & STOP THROWING IT IN OUR FACES YOU BINT !!","commenter_a":"Please go away now. Everybody's over it","post_message":"Caitlyn Jenner is taking Donald J. Trump at his word..."}]
