[{"comment_id":"865380196838555","commenter_b":"You're a dumb b****.","commenter_a":"Islamists stand together...if he were to admit islamism, he might be called an apostate.","post_message":"There’s a far bigger issue involved here than going to the anti-terror march in Paris on Sunday. That is Obama’s persistent refusal to identify the enemy as what it really is: Islamic terrorism. It’s pathetic to see the contortions our president and various administration officials and spokesmen go through to avoid using the word “Islam” when talking about the people who are waging war on the West. @webpagelink"},{"comment_id":"10154831309643984","commenter_b":"She is SCUM","commenter_a":"She is pure unadulterated bullsh**.","post_message":"Of Hillary's hundreds of scandals, this is by far the worst. And most people have no idea she was even involved, let alone behind it.  This makes her scandals (and the ones she's made up about Donald J. Trump, look like nothing."},{"comment_id":"10154216584759203","commenter_b":"Ivory towers allow a lot of false logic. She'll just fly away to her mansion. No skin off her nose.","commenter_a":"I thought, \"Well she is on with Bill Maher. Lets see how she explains this away. And all she did was lie. She said she simply said yada and the people who were complaining didn't see the interview. Well I saw the interview and she lied. Not to be undone though, after a few minutes with Bill Maher, she actually showed her true colors and did admit what she believes. Then to top it off, as soon as Bill Maher brought up their support for Ralph Nader, which cost the country GW Bush and millions of lives, she simply interrupted, pivoted and changed the subject. She is a horrible human being and I wouldn't watch another movie with her in it on a bet...even if she does have the best rack of any 70 year old(Oct) I've seen.","post_message":"Susan Sarandon found herself in the hot seat Friday night."},{"comment_id":"623158744555639","commenter_b":"Oh my that thing looks scary","commenter_a":"Adriana R. Eiro","post_message":"A baby chameleon is born"},{"comment_id":"10153121950974641","commenter_b":"Oh really? Documented mental illness or zealous?","commenter_a":"Ohhhh good to know that! So, the ones to blame are those 150 victims for taking that plane!!","post_message":"Alps crash co-pilot suffered from severe \"psychosomatic illness,\" according to reports: @webpagelink"},{"comment_id":"1169322949765857","commenter_b":"I understand that the left hates and has an unnatural desire to control everyone around them. It's just what they do; and it's the reason they should never be allowed to hold any position of power. To hate for no good reason is insane. Obviously none of the people here who hate Trump have no idea WHY they hate him except maybe that they were manipulated to do so. You don't have to like him; you're not hiring someone to be your friend (although that might be the only way you can get friends); you're hiring a POTUS so vote with honest logic. Not feelings.","commenter_a":"There's no denying the fact that he's more wealthy than even the elitists in Washington can hope to be; AND it's obvious that if you're that wealthy; the IRS has already seen your taxes so there's nothing hidden about his returns except just like yours; they're not PUBLIC knowledge. The only ones who want to make a big deal about them are the people who are scraping the bottom of the barrel trying to find something they can twist into a questionable issue that the most ignorant of voter will be swayed with.","post_message":"“There’s nothing to learn from them,” said Donald J. Trump."},{"comment_id":"10153335950782293","commenter_b":"When you have a citizenry that has NO respect for authority, this is what you get. Should the police just let them run wild? Why not create some \"no go zones\" and let the animals have at it.","commenter_a":"If the only way police can \"control\" crime is through the kind of brutality we see in videos, they better relearn their policing skills.","post_message":"He suggested violent crime is surging in the U.S. because police officers fear getting caught on the next video of alleged police brutality."}]
