[{"comment_id":"944837115644330","commenter_b":"No way trump will win this election! Most white, asian, african american and latinos will unite on november and bit the heck out of trump! Never will vote for a someone that makes fun of disable, a rapist, a liar and a PSYCHO!","commenter_a":"The audacity of your campaign sickness me to my core :/ . You and your minions are the \"deplorables\" . All you that support these monsters should be ashamed of yourselves! #Trump2016","post_message":"If Donald J. Trump becomes president, how can we guarantee that he'll choose America's security over his own financial interests?"},{"comment_id":"10154331830756028","commenter_b":"They both need to be put in population in prison and let be what needs to be done to these two monsters they didn't protect that beautiful innocent baby","commenter_a":"I am beyond sickened by this....death penalty.....","post_message":"In the days before her death, little Leah Brown-Meza suffered multiple injuries to her head, a broken arm and a second-degree burn to the bottom of her foot. Her mother and her mother's boyfriend sat in blue jail uniforms as they listened to the evidence presented against them in court. @webpagelink"},{"comment_id":"10153570546732464","commenter_b":"I am sure that this wont just amount to more talk from you and that you will actually do something. Yeah right.","commenter_a":"GO TED, GO\"!!!!!","post_message":"Our first priority should be stopping a bad #IranDeal that jeopardizes the lives of Americans: www.stoptheirandeal.com"},{"comment_id":"1084079061644582","commenter_b":"Isn't she too powerful to jail?","commenter_a":"Says the rich woman","post_message":"\"Wall Street can never be allowed to threaten Main Street again, no bank can be too big to fail, no executive too powerful to jail,\" says Hillary Clinton during Nevada victory speech. @webpagelink"},{"comment_id":"494247850741172","commenter_b":"Good. That's all we need is illegal aliens in the military. They shouldn't even be in the country. Let them get in line......My grandparents did.","commenter_a":"As a democrat, you shouldn't give a damn whether I like it or not, as long as you got off your ass and did something without the president having to force you into passing some type of immigration bill.If you think the president did something illegal!! It's because you set on your ass and forced him to do something that he really didn't want to do.","post_message":"The final version of the legislation stripped out language that would have asked the Pentagon to consider allowing young immigrants who came to the country illegally as children to become eligible for service in the military."},{"comment_id":"910228435682060","commenter_b":"That's why it's good she'll never be president.","commenter_a":"Communism at work! No freedom of speech if they have their way! Vote them OUT!","post_message":"Are you at all surprised by this?"},{"comment_id":"10153949955984454","commenter_b":"Chicks with green dresses","commenter_a":"What is wrong with this pipeline? Pipeline are the safest way to move oil and natural gas. And the least destructive to the environment. Most of the land recuperates in a few years.","post_message":"An expanded Alberta Clipper pipeline could send up to 880,000 barrels per day of toxic oil from Canada's Alberta tar sands into America's heartland even more than #KeystoneXL. Tell Secretary of State John Kerry to block the Alberta Clipper pipeline: @webpagelink"}]
