[{"comment_id":"484282168429030","commenter_b":"deport her and all the rest of the muslims in america","commenter_a":"Yes","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake.  Shariah Law is dangerous, we support the patriots that stand against it.  Should Shariah be banned in all 50 states?"},{"comment_id":"1589593461282497","commenter_b":"What a dork...........","commenter_a":"This guy is putting himself in the same catagory as Trump when he talks this way about anyone. He could have made his point without all the cursing.","post_message":"The very end is the best part.  Thanks to The Liberal Redneck. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1657934121091027","commenter_b":"What did they expect???? Idiot Merkel....","commenter_a":"A bunch of neanderthals","post_message":"The reports of assaults have added fuel to Germany's migration debate."},{"comment_id":"800175416791290","commenter_b":"shes disgusting!","commenter_a":"I don't know anyone personally that thinks Amy Schumer is funny . Her only following is a bunch of feminist that think her over the top vulgarity makes her equal to men but even most men aren't as perverted as her .she tries to hard and it just isn't funny or entertaining.","post_message":"'Of course, we're in Florida, you're going to boo.' - Amy Schumer after being booed for making jokes about Donald J. Trump"},{"comment_id":"1807238972845517","commenter_b":"NEVER GONA HAPPEN !!!!! BTW do any of these people know history???? Do they know that the first slaves were sold by Their own people???? Yes African people sold their own!!!! Now how the fuck.is that anyone's fault but their own peoples????","commenter_a":"We will not pay. No one in my family or ancestors had anything to do with slavery. Enough is enough move on.","post_message":"You May Have To Pay African Americans For Slave Reparations   Come try and get our money.  Will you pay for slave reparations?"},{"comment_id":"10155066550807994","commenter_b":"White racist people that's who.","commenter_a":"This is how they return the favor for his dream","post_message":"I HAVE A DREAM. Before Martin Luther King Jr. gave his speech in front of 250,000 in Washington, DC - the great American delivered a very similar version right here in Detroit two months earlier. READ & LISTEN:"},{"comment_id":"10155308331690354","commenter_b":"If these 400 men are really that stupid...do we really want them populating the world anyway?!","commenter_a":"I wasn't aware obama was a follower","post_message":"Other than charisma, how does one convince 400 men this is a good idea?"}]
