[{"comment_id":"10155487456986509","commenter_b":"Hillary is a baby killer.","commenter_a":"He was completely right on everything he called a disaster. The biggest disaster of all was the video proving that she and her campaign incited the violence at his rallies. Perhaps using the word rigged is an oversimplification, but for Christ's sake, she's guilty if inciting riotous behavior. Vote Trump, as middle finger to the corruption in government.","post_message":"- Aleppo - Hillary Clinton's tax plan - Obamacare ...and more things that Donald J. Trump called a \"disaster\" at the final #debate. @webpagelink"},{"comment_id":"10153400709859474","commenter_b":"she will not tell the truth...","commenter_a":"What difference does it make","post_message":"Breaking: Hillary Clinton to testify before Trey Gowdy and the Benghazi Select Committee. Share to demand the truth!"},{"comment_id":"10157254857370354","commenter_b":"Punch that Bitch","commenter_a":"If he had a background like that, other wives would come forward. She wasn't going to get alimony...hummmm","post_message":"The latest twist..."},{"comment_id":"10156663817835294","commenter_b":"That nasty women needs mandatory life in prison. Piece of garbage","commenter_a":"She didn't give the baby up! She left it in the toilet to die. That's not surrendering that poor baby.","post_message":"The police are releasing the photo and the video to bring awareness to California’s safe surrender law, which allows any newborn under 72 hours old to be surrendered without criminal charges."},{"comment_id":"10154220107672293","commenter_b":"@username idiot","commenter_a":"Like the Central Park rapists (5 young black boys) some years back that Trump railroaded into jail, then never apologized when someone else confessed.","post_message":"Cooper was wrongfully convicted of armed robbery in Indiana in 1997, and he is still waiting to be pardoned."},{"comment_id":"10153697633816636","commenter_b":"@username females mature quicker than boys, starting periods as young as 9, some see that as start of womanhood, females have sexual hormones and crushes in early teens so YES it isn't any different... She does need locking up","commenter_a":"I think you mean that she raped the 13 year old boy on an almost daily basis. She is sex offender who groomed then raped her victim, if genders were swapped people would see this monster for what she is and see that the 13 year old is a victim.","post_message":"'I have chills because of this'"},{"comment_id":"496072593916654","commenter_b":"send them to the toilets they came from","commenter_a":"Unless the Muslims can \"Swear allegiance\" to America, practice / observe their faith, while respecting & protecting the rights of Non-Muslims...YES, DEPORT THEM!","post_message":"Chaos ensues after Norway starts deporting Muslims. Norway made a brave move, now the rest of the world needs to follow their example. Do You Support Muslim Deportation In The United States?"}]
