[{"comment_id":"10153688042296028","commenter_b":"No way!! Frankie","commenter_a":"He not dead tf","post_message":"Update: Prince's publicist confirms that the pop superstar has died.  A death is being investigated at the Minnesota property of singer Prince. The identity of the person has not been released. @webpagelink"},{"comment_id":"10154691366756130","commenter_b":"She should be ashamed of herself!","commenter_a":"Funny and sadly accurate","post_message":"She got answers all right."},{"comment_id":"10153612119195530","commenter_b":"Nobody at the restaurant saw anything?","commenter_a":"How come nobody saw anything?","post_message":"So what really happened that Wednesday afternoon in 1975?"},{"comment_id":"1081387115239718","commenter_b":"Ill stick with what my doctor reccommends","commenter_a":"so I should not take medicine and just live with acid reflex? I have been taking Nexium for many years.","post_message":"People who take certain popular medicines for heartburn, indigestion and acid reflux may want to proceed more cautiously."},{"comment_id":"619358388197343","commenter_b":"All he did was to let Iran know about our constitution .......","commenter_a":"It was well deserved. #1traitor of #47traitors","post_message":"What the heck is wrong with this dude?!"},{"comment_id":"10153757809364877","commenter_b":"She wouldn't even have had the chance to do that to me, once I saw the knife in her hand it would be over for her with the quickness! I hope she gets arrested and that boy leaves her high and dry if he hasn't already!","commenter_a":"He should run and never look back","post_message":"Woman holds knife to boyfriend’s throat, forces public apology for flirting on Instagram.   Grio fam, how would you react if your son or daughter was in this relationship? Please be advised that this footage shows graphic imagery."},{"comment_id":"10153104689788855","commenter_b":"WTF? The Advocate (or at least the staff involved in this article) clearly don't know what \"Twink\" is. These men are just aging well and don't have the outward appearance of what one would typically expect of their numerical age.","commenter_a":"Daryl Stephens is a hot man","post_message":"Sometimes, twink is forever (right, Darryl Stephens?)"}]
