[{"comment_id":"10153706263011336","commenter_b":"Who cares.. She's an old dried up prune!","commenter_a":"Oh dear... Am I surprised or what? NOT!!! :)","post_message":"BREAKING NEWS: After declining to state her position for years, Democratic presidential candidate Hillary Clinton says she opposes the Keystone XL oil pipeline."},{"comment_id":"1602106276760398","commenter_b":"Yeah well Thats all she does. Thats why she'll never be president.","commenter_a":"Donald J. Trump, Gary Johnson & Hillary Clinton's position on #StandingRock is clear: they ALL support Wall Street's attempts to rape & plunder the natural world (and us) to death. The ONLY candidate who TRULY supports clean energy & kids health is @username. #InvestYourVote #NoDAPL #SilenceIsConsent!","post_message":"My running mate, Ajamu Baraka, and I stood in September with #NoDAPL water protectors at Sacred Stone Camp in North Dakota, where the Dakota Access pipeline is being built in violation of a 19th-century U.S. treaty with the Standing Rock Sioux.  The desecration of sacred land and the 500-year violence against indigenous people must end if we are ever to see a just society that works for all of us, not just the 1 percent.  jill2016.com/standingwithstandingrock"},{"comment_id":"1331072000266602","commenter_b":"I guess it's just disappointing to think of anyone being THAT stupid . Smdh .","commenter_a":"Why make a video of this ? It has to be trolling .","post_message":"The teens said they will make Black people slaves, burn them, brand them and make them swim the Atlantic Ocean."},{"comment_id":"10153956730069411","commenter_b":"You poor thing! (Jk)","commenter_a":"I know where I came from :) I am 20% from Asia, 20% from North America, 20% Pacific Islander and 40%European Meztizo. That is why I look like this. My eyes are brown and blue (blue edges, brown interior).","post_message":""},{"comment_id":"1191980840884045","commenter_b":"Seth Rich, DNC staffer, suspected of leaking information to WikiLeaks about the Clinton campaign randomly gets shot in the back walking down the street.... Why are so many Americans blind to the corruption in the Clinton campaign? People with credible evidence against Hilary are turning up dead. This is not a random instance. @webpagelink","commenter_a":"Trump will make changes, and yes Obama Trump doesn't think we faked the moon landing.","post_message":"Barack Obama’s greatest strength? “Probably that I’m always early.” hillaryclinton.com/makeaplan"},{"comment_id":"1182482298496971","commenter_b":"Praying🙏","commenter_a":"Get well soon.","post_message":"Prayers are with the Fox News family today..."},{"comment_id":"10154417440556729","commenter_b":"Muslim Jihadem Horde!","commenter_a":"And guess which country is going to have to fix things like in WWII?","post_message":"Hello??? Is anybody listening?"}]
