[{"comment_id":"1260373737389011","commenter_b":"The Cocaine Carrot.","commenter_a":"Hahaha","post_message":"Nailed it."},{"comment_id":"10154354649676336","commenter_b":"This is exactly what you get when you allow illegals into the country!!!","commenter_a":"With all of the organic fruit, spinach, sprouts, vegetables and now vitamins being recalled I have decided to start a strict diet of twinkies and chips ahoy. They never get recalled.","post_message":"Warning: Recalled products include Nature Made gummy multivitamins and supplements containing vitamin C, B vitamins and folic acid."},{"comment_id":"10153530669581955","commenter_b":"HahahahahagagagagagahahahahahagahahahahagahahahagahahahahahahahahahahahahahahahahahahHahahahahahahahahahahahahahahahahahahahahahaha. Fucking HA! The bitch was married FOUR FUCKING TIMES. Maybe..... Just... Maybe..... SHE'S the one fucking our morals over? Hmmmm maybe YOU are the one fucking our morals over? Hmm","commenter_a":"I admire you..I would have done the same thing if I were in YOUR position..they are destroying the morals of our society..","post_message":"JAILED FOR NOT MARRYING THE GAYS"},{"comment_id":"10153912824075579","commenter_b":"This women reminds me of what I leave behind in the toilet!!!!! And It really stinks! FLUSH!","commenter_a":"Whatever her stylist is doing, keep doing it. Love that green leather jacket!","post_message":"had a pretty long day yesterday. Hillary Clinton addresses the DNC Women Leadership Forum.  Watch complete video from the event here: @webpagelink"},{"comment_id":"966202806772801","commenter_b":"#dumbasses","commenter_a":"Robbie Raul Markosyan","post_message":"Kate Upton among scores taking part in #HoldACokeWithYourBoobsChallenge for breast cancer... unaware the trend ISN'T raising money"},{"comment_id":"10154741316933812","commenter_b":"Hillary will be president","commenter_a":"Remember when Hillary Clinton said the 50,000 emails she kept from the State Department (in violation of the Federal Records Act) were about yoga and her daughter's wedding? How many of the most recent set of 14,900 emails ordered made public by a federal court are about yoga or her daughter's wedding? I'm thinking zero. But hey: pertinent falsehoods under oath aren't criminal when you're aspiring to become the First Woman President (TM).","post_message":"Meet Meatball: The adorable, friendly and rotund pit bull mix that can't help but flash his brightest smile as soon as he sees a camera. 'As soon as the camera turns on he just gets this huge grin on his face.'"},{"comment_id":"1187034151348219","commenter_b":"On the flip side the battle is going... ok ish","commenter_a":"'Hold X to flip over'","post_message":"Caption contest time! ~Josh"}]
