[{"comment_id":"494247850741172","commenter_b":"Good. That's all we need is illegal aliens in the military. They shouldn't even be in the country. Let them get in line......My grandparents did.","commenter_a":"As a democrat, you shouldn't give a damn whether I like it or not, as long as you got off your ass and did something without the president having to force you into passing some type of immigration bill.If you think the president did something illegal!! It's because you set on your ass and forced him to do something that he really didn't want to do.","post_message":"The final version of the legislation stripped out language that would have asked the Pentagon to consider allowing young immigrants who came to the country illegally as children to become eligible for service in the military."},{"comment_id":"434665249991403","commenter_b":"Like Ms. Richards said \" get over it\"","commenter_a":"The supreme court has been and is political. It has jettisoned the straight forward and logical meaning of the Constitution in a growing social activism. The concept of heterosexual marriage has been intact from the beginning of historical time...until the present attempts to normalize the homosexual perversion . Legal liasons by contract have always been possible to all persons but the attempts to socially institutionalize and legally legitimize homosexual marriage as an equal and legitimate alternative to heterosexual marriage will never legitimize it. It may legalize it - but unborn baby murder is legal but will never be morally normal nor moral.","post_message":"Rick Santorum thinks that Congress should fight the Supreme Court if the court rules in favor of gay marriage. Is he right or wrong?"},{"comment_id":"10154683791611002","commenter_b":"Gross. She needs to be locked up and throw away the key","commenter_a":"Lock her up and throw away the key.","post_message":"A 38-year-old Dearborn Heights woman is accused of attempting to arrange a meeting for sex with whom she thought was a man and his underage daughter."},{"comment_id":"10155064205902178","commenter_b":"Don't they know it's a \"shark free zone\"! This method works for criminals who take heed to gun free notices.","commenter_a":"Joe Daniel","post_message":"An 11-year-old boy was bitten by a shark off the coast of North Carolina yesterday, the second incident in as many weeks. >>>wral.com/@username"},{"comment_id":"747059155450198","commenter_b":"How would a little girl see a transgender's penis? In the female washroom, everyone uses a stall with a door that locks. The only way a little girl would see one is if a pervert walked in the washroom. A true transgender would not exposed himself unnecessarily.","commenter_a":"I don't think its a good idea. I'm not concerned with transgendered using the women's restrooms,. I'm concerned with a pedophile using the restroom to grab a child. Or a rapist using the opportunity to grab a woman. I don't know that either scenario will ever happen...but it could. When it comes to safety, I think we should make every effort to keep women and kids safe.","post_message":"ClashDaily.com"},{"comment_id":"1065627820160413","commenter_b":"I like Hillary because she will help the illegals... Republicans are against illegals claiming 20-30 kids on their tax refunds from other countries, it's on you tube tax refunds for illegals...","commenter_a":"I am voting for @username it is time for woman to take charge. She will accomplish the Mission.....","post_message":"\"To Democrats around the country...I urge you to raise your own voices this year by voting for the person who shares your values and who will fight tirelessly for you and your family. I know, for me, that candidate is Hillary Clinton.\" —Senator Kirsten Gillibrand"},{"comment_id":"501298436725116","commenter_b":"Need more Americans like him . Hope he can beat all the charges . Muslims need to go back home !","commenter_a":"Not a hate crime","post_message":"A lesson he'll NEVER forget..."}]
