[{"comment_id":"657416461115599","commenter_b":"MAYBE SHE NEEDS MENTAL HEALTH !!!!! IF SHE IS THAT BLIND TO WHAT IS HAPPENING IN AMERICA WITH O BUMMER AS PRESIDENT , SHE MUST NEED GLASSES TOO !!!!!!","commenter_a":"She is a traitor and Muslim just like her husband. Impeach him and send all of them back to their Muslim homeland.","post_message":"Michelle just told her biggest lie to date... Her and her husband are liars, plain and simple. Do you agree the Obamas are traitors to America?"},{"comment_id":"1065627820160413","commenter_b":"I like Hillary because she will help the illegals... Republicans are against illegals claiming 20-30 kids on their tax refunds from other countries, it's on you tube tax refunds for illegals...","commenter_a":"I am voting for @username it is time for woman to take charge. She will accomplish the Mission.....","post_message":"\"To Democrats around the country...I urge you to raise your own voices this year by voting for the person who shares your values and who will fight tirelessly for you and your family. I know, for me, that candidate is Hillary Clinton.\" —Senator Kirsten Gillibrand"},{"comment_id":"1715281765380661","commenter_b":"These adulta should be ashamed of themselves! Hoping whatever league they are in bans them from attending any more games!!!","commenter_a":"What a bunch of degenerate so called parents and adults. Useless to kids and society","post_message":"WATCH: Brawl breaks out between coaches at an under-10 baseball game. The stunned little kids don even know what to do. The video was provided to ABC News by a spectator. @webpagelink"},{"comment_id":"10153136894823145","commenter_b":"Bottom line do what the officer says and don't talk back. The girl kept running her mouth to him. My child would have got in trouble by me for talking back the way she was.","commenter_a":"The only good cop is a dead cop","post_message":"Here's 5 things to know about the Texas officer seen on a viral video breaking up a disturbance at a pool party. #WFTV Watch the video here: @webpagelink"},{"comment_id":"963771213658338","commenter_b":"He hasn't been sent yet! The judge will do that! 263, but if he, the judge, gives him concurrent sentences, he'll be out in 20....wait until JAN 16","commenter_a":"Lolol good!!!","post_message":"Daniel Holtzclaw was sentenced to 263 years in prison."},{"comment_id":"10153991017722235","commenter_b":"If you give a lady $10 and rape her, it doesn't make her a prostitute. It makes you a rapist.","commenter_a":"Georgia, Georgia, what are you doing. You were devastated in the civil war for your enslavement of people now you demonstrate you might need another lesson. Someone dig up General Sherman.","post_message":"YES!"},{"comment_id":"10154156633758822","commenter_b":"Ship all libs and Democrats there now!!!!","commenter_a":"Can we send the Obamas and Clintons as test citizens? Perhaps their buddies in Isis?","post_message":"Humans on Mars by the 2030s! That's what President Obama's plan calls to do."}]
