[{"comment_id":"1593060860989996","commenter_b":"Thats how they want America ....in a trance.","commenter_a":"May I suggest Sarah Palin as a running mate? We've heard that she not only supports you, but offered her services :)","post_message":"You could tell Donald J. Trump knew the debate went badly by the way he barreled into the \"spin room\" last night, immediately disavowing things he'd said in front of more than 80 million people just moments before. The back-peddles and lies have only grown more mystifying in the hours since."},{"comment_id":"10154580142688132","commenter_b":"Me too! Those hot mamas work for those bodies!!","commenter_a":"I personally loved it","post_message":"Fergie is making a statement!"},{"comment_id":"1773749052877981","commenter_b":"So full of CRAP Hillary.","commenter_a":"Hillary is such a liar. Only person under investigation is Hillary and her staff... Yet Hillary tries to turn it around, LOL.... Hillary is such a liar.","post_message":"WATCH LIVE: Hillary Clinton speaks to supporters in Ohio. Ohio is a crucial swing state in the election."},{"comment_id":"248420038902239","commenter_b":"Shouldn't she be starring in class B horror films?","commenter_a":"She's a fucking bitch and a liar and top of it😡😡😡😡","post_message":"\"'Alternative facts' are not facts. They're falsehoods.\" Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it.   Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"10153536003698967","commenter_b":"God... I would love to work here JUST so that I can belittle upper management when they fire my ass for pulling an \"Office Space\"... Also... I can see a documentary in their near future.. Similar to the one about Walmart... ... Can't wait!!!","commenter_a":"I hate to hear that they run Amazon like a Randian dystopia. I use them for so much stuff now. What a shame.","post_message":"Amazon's corporate culture is terrifying."},{"comment_id":"1784575138485488","commenter_b":"How would she know what honor is?","commenter_a":"Honor .... She doesn't know what that means........","post_message":"Clinton says she wants Trump to know what \"American honor\" looks like. What do you think about her speech?"},{"comment_id":"10153090058473984","commenter_b":"Fry her dam ass","commenter_a":"GOOD!!!","post_message":"She probably thought she had gotten away with it. Not so fast, Hillary...  Should she face criminal charges for this?"}]
