[{"comment_id":"944371082289036","commenter_b":"pig stupid bitch","commenter_a":"ass","post_message":"Conservatives really are the worst kind of people."},{"comment_id":"1050901851597824","commenter_b":"It wont be single payer with this Congress. Thank God the sane people control Congress. Liberalism is a mental disorder.","commenter_a":"Wrong. The ACA was intended to fail. This will be replaced by single-payer, all Medicare/Medicaid type system.","post_message":"Obamacare was supposed to fix the problems created in the healthcare system by pre-Obamacare government meddling. I wonder why it didn't work? Be warned - an Obamacare bailout (mostly for the insurance companies) could be on the way."},{"comment_id":"971032156302726","commenter_b":"The Liberals should be deported along with the rest of the illegals","commenter_a":"Monday morning i was at the Dmv here in NC,and while waiting for the examier was attending to other people,i was listening to the other people around me. Everyone of us was ask if they were register to vote or if not they can register you right there. Five people were asked and all refused to sign up ! I got on my soapbox to the amusment of the examiers and told them about our sacred right to vote, they said nothing !","post_message":"Liberals want illegals to vote so they can cancel out your well informed vote."},{"comment_id":"10153980272751943","commenter_b":"Why is she smirking???? Are they really that sure that they'll get away with their crimes??","commenter_a":"Hillary has such a ditz as chief of staff? She \"wishes\"? She \"never thought about it\"???? Totally lame-brain in her knowledge regarding working in such a sensitive area...... She plays dumb...","post_message":"Hillary Clinton chief of staff during her time as secretary of state, Cheryl Mills, said she simply never thought about the prospect that some of Clinton private e-mail exchanges wouldn be retained under federal records laws. \"I wish I had thought about that subset,\" Mills said in a deposition released Tuesday by the conservative government transparency group Judicial Watch. \"I wish I had thought about the fact that someone could be nongovernment and records might be not being captured. - via Bloomberg"},{"comment_id":"10156036197975293","commenter_b":"I don't get it. If a woman pulls her breast out in public it's illegal. I a man looks at her breast he's a perv. So why dose a woman want to breast feed in public.","commenter_a":"It's awesome","post_message":"A picture of some soldiers breastfeeding has gone viral. READ the story and let us know what you think."},{"comment_id":"10153761694679705","commenter_b":"well lets say i know more","commenter_a":"did ya know they have votes to local reps to say the same as the usa does not likely","post_message":"Direct mail service was cut in 1963 at the height of Cold War tensions."},{"comment_id":"10153870911641680","commenter_b":"Crooked Hillary only a few more weeks until she goes away for good","commenter_a":"Forced conscription ”has always been a bipartisan goal“? News to me.","post_message":"Hillary Clinton: \"I don't think you'll hear any of this from my opponent, and I think that's a shame: National service has always been a bipartisan goal.\""}]
