[{"comment_id":"10153286048671717","commenter_b":"Hideous bitch","commenter_a":"If u don't like the laws, move No one is keeping u here.","post_message":"Indiana legislative proposals: Washington florist to testify against LGBTQ protection bills"},{"comment_id":"1037048666341760","commenter_b":"Cherokee Hinrichs quickly and painlessly?? Maybe for the one having the abortion, but the living baby that's being killed feels it!! Your another disqusing excuse for a woman!! Be ready for your judgement day, God will sent you straight to hell along with all the other disgusting women who kill babies!!","commenter_a":"Stop the madness. Repeal Roe v Wade. It is a choice. Choose life.","post_message":"Real doctors protect the Sanctity of Human Life!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb179"},{"comment_id":"1195176803855108","commenter_b":"They, Mexicans, would have had more support, and got more support, but the riots have highlighted the burden they are on our nation AND the quality of the people involved. Now more than ever we want them out of here. The illegal aliens are criminals, it is that simple - but not only here illegally, but getting benefits and even legal advantages not given to Americans (like conviction and released to streets). Illegals are getting better benefits than many American's in need, BUT let's just consider one aspect that without any doubt is unacceptable; illegals are getting aid while vets die waiting for help. We must correct this problem. ONLY Trump will start the process. Thanks you Mexican rioters - you have reached a new low of acceptance in OUR nations. You are creating a new population of racists - it isn't hard to hate watching your antics!","commenter_a":"Taxpayers On BOTH Sides -- Aren't you sick and tired of all the destruction and crapola coming from these little punks and thugs, illegals, and paid rioters?? Taxpayers have to PAY for their destruction and mess! These PAID for Rioters should be ARRESTED, given LONGER jail time and VERY HIGH FINES -- also, if on government welfare programs or student benefit programs - they should be TERMINATED Immediately! Also, Make Them Do Community Service - Cleaning up All That They Destroyed. No Punks & Thugs, or George Sorsos Paid for Rioters, Muslim Agitators, or Law Breaking Illegals Are Going to Stop Donald from Making America Safe, Secure and Great Again! No Left Wing Owned, Biased Media will stop Mr. Trump! The more they try to throw the dirt and lies on Mr. Trump - the more I support him and his agenda, which is to make America SAFE, SECURE and ...","post_message":"KEEP WAVING THOSE MEXICANS FLAGS AROUND....    @webpagelink"},{"comment_id":"1704157759871336","commenter_b":"Hate the show.Bitchy women!!","commenter_a":"Let's hope so","post_message":"The View makes me SICK.   Take Joy Behar off the air NOW!"},{"comment_id":"1032100616836565","commenter_b":"This Woman is pure Evil.","commenter_a":"hillary maggie mae clinton..........cause the morning sun, when its in her age really shows her age","post_message":"Pro-abortion politicians have ramped up their war on the unborn for 2016. It's up to us to do everything we can to protect them by continuing to build support behind the Life at Conception Act!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb171"},{"comment_id":"1749063398683963","commenter_b":"Shut up- you're just another puppet of clinton. There is no way in hell that trump is more dangerous than that witch Clinton. How much were you paid?! Were you threatened. Clinton must be stopped. Clinton is the threat! She is in with muslim radicals and is going to move toward removing guns from the citizens and let terrorism continue! Give trump 4 years- he will do better than Clinton!","commenter_a":"I wouldn't trust the CIA or the FBI if my life depended on it.","post_message":"\"Donald J. Trump is not only unqualified for the job, but he may well pose a threat to our national security,\" he said."},{"comment_id":"782996508468592","commenter_b":"@username You know nothing fool.","commenter_a":"U.S. Attorney General Loretta Lynch is an idiot. Her and the Obama Gang are clearly violating the US Constitution and disregarding the rights and safety concerns of women and children. She should be hauled into congress for questioning.","post_message":"Just in: U.S. Attorney General Loretta Lynch announces that the Justice Department is suing North Carolina over bathroom law. \"This action is about a great deal more than bathrooms.\" @webpagelink"}]
