[{"comment_id":"10158588409000354","commenter_b":"Doesn't help that he no longer has any 'insider info' from the State Department, does it ????????? Schmuck","commenter_a":"Geez, whudda thunk it.","post_message":"You can't make this stuff up.   #ClintonCash"},{"comment_id":"10153007103196336","commenter_b":"Yes, teachers do hve input as to curriculum. No teacher nor educator has the right to instill their political views on to their students.","commenter_a":"These teachers need to be replaced if they are inserting their political views in the classroom and have only One answer which the see as correct whether it is correct or not! This is MY opinion! This does Not need to be taught in school anymore than religion! Go argue on someone elses opinion if you don't like mine. I will Not be called ignorant by anyone!","post_message":"“The Democrat is building. The Republican is destroying.”  According to an 8th-grade teacher in Wisconsin, this was the correct answer for a social studies assignment on immigration policy."},{"comment_id":"1272820716123006","commenter_b":"Women like you make me so embarrassed for my gender! The same that screwed America with Obamacare. Truly disgusting","commenter_a":"There is a clear path of the Democratic Party to take the presidency, the house and the senate... This is the core issue why the FBI director was pressured to make the announcement... #Ihaveherback Grab them by the polls vote blue","post_message":"JUST IN: Federal investigators looking into Hillary Clinton email matter have obtained the warrant needed to start reviewing emails found on laptop used by Anthony Weiner and Huma Abedin."},{"comment_id":"1082304031883694","commenter_b":"'@username 'butt hurt'.... It is a comment about grammar.","commenter_a":"What is a 'one and three chance'? Does that mean we will get hit with four storms? The spelling and grammar people are nonexistent in the media these days.","post_message":"There is a one in three chance of a “historical windstorm for nearly all of Western Washington that would be long remembered.”  Take today to prepare for possible power outages and have some extra supplies on hand."},{"comment_id":"10153064930639135","commenter_b":"She should be returned to New Jersey. So should it's Governor.","commenter_a":"Why wait until the end of August? Drop out now and avoid two weeks of mental anguish. It's over for you, which is a good thing for America.","post_message":"President Obama and Secretary Kerry, now that we have an American flag flying in Cuba, I urge you to demand the immediate return of Joanne Chesimard to New Jersey.  Like so many others, the families of her victims continue to suffer under the Castro regime. Justice must be served."},{"comment_id":"1122007374532683","commenter_b":"She's in a bikini with something over it, not a big deal. Trumps wife on the other hand is butt ass naked and might be the next First Lady.","commenter_a":"Erik Björnfot","post_message":"#President #Obama's Daughter #MaliaObama twerks & shows her booty cheeks at #Lollapalooza! #WSHH"},{"comment_id":"10155091022728734","commenter_b":"Look at these white American men!! Hahahah! Look at these savages","commenter_a":"Disgusting","post_message":"A 37-year-old man has been arrested after allegedly trying to pay a mother to have sex with her seven-year-old daughter."}]
