[{"comment_id":"10153430194047042","commenter_b":"To answer your question politically I don't like Hilary and I don't believe I would care for her personally either.","commenter_a":"How did Americans become so Dumb? No matter what kind of Facts you show them they will still support this Fool of a President.There is a Health Care Crisis is Puerto Rico yet they love this Fool.Israel will soon be whipped off the map by Iran yet Jews Love this President.Not a single Latin family has been untouched by this Man and his Policies yet we are about to elect someone worst Hilary.The Mexicans don't understand that there being used like a mule to further a democratic Political agenda.The president could have made millions of illegals legal yet there left in limbo and now he is gonna lecture us on race relations when he is the most divisive of Presidents..","post_message":"\"RACISM, WE ARE NOT CURED OF IT\": President Barack Obama used the n-word to make a point about the reality of racism in America."},{"comment_id":"10153583021397434","commenter_b":"Get that bomb ass dick!","commenter_a":"I had to open up my decoy facebook just to be able to \"anonymously\" say that I've slept with at least 160 different men and have never experienced this.","post_message":"After fucking, while you’re still a tangle of sweaty limbs and heaving torsos, your partner--probably still inside you--looks deeply into your eyes and whispers a husky and sensitive “hey.” Why?"},{"comment_id":"10154298865889099","commenter_b":"Smh","commenter_a":"Jessica Milla","post_message":"\"Her ribs are broken. He beat her ribs and breast saying her milk was useless and she was worthless,\" the woman's mother said. \"He tried to blind her so she couldn't see her baby, he tried to make her deaf so she couldn't hear him crying for her.\" WARNING: Some may find the images in this story disturbing. @webpagelink"},{"comment_id":"948419235220194","commenter_b":"If she wont follow the dress code I wonder what other codes she would break...Be compliant or be gone !!","commenter_a":"How refreshing !! Parts of this country is still the U.S.A.","post_message":"Ohio Police Takes BOLD Stand Against Islam After Offended Muslim Woman Issues Threat @webpagelink"},{"comment_id":"1561742504135313","commenter_b":"Gonna try this for sureeee","commenter_a":"@username yess","post_message":"Making your own crepes is the perfect way to start the weekend. (via Real Simple)"},{"comment_id":"1014005318629521","commenter_b":"Mine usually bark at noises or neighborhood dogs. However our Pit will ECHO in the house for 30 minutes when she wants to play. It only annoys us! However my neighbors digs howl for hours and have eaten my fence!","commenter_a":"Dang, what if the family isn't home?","post_message":"DOG BARKING ORDINANCE: Dallas city officials want to cut down on barking dogs. City officials have created an animal ordinance that says it is an offense if a person lets their dog bark for longer than 15 minutes. Would you agree with a similar ordinance in the Houston area? MORE ---> @webpagelink"},{"comment_id":"10155858979227619","commenter_b":"She should stick to singing and acting. That's her expertise. She's no great brain and what she opines about politics is meaningless.","commenter_a":"I dont care what either one of them think or do.","post_message":"Streisand said in an interview that Trump's actions are \"so beneath the dignity of the presidency, let alone any respectful person.\""}]
