[{"comment_id":"395322620592333","commenter_b":"People with food stamps eat better than average people. Not that junk food is better for you, but they get it all.","commenter_a":"thats the best to ever happen . but, it should include junk foods and sodas at the grocery store","post_message":"Could this Senator's proposal help bring an end to food stamp abuse?"},{"comment_id":"1760842010899023","commenter_b":"Bitches be trippin'","commenter_a":"No not for all the money in the world!","post_message":"Would you?? #WSHH"},{"comment_id":"10154061329228352","commenter_b":"Fucking neither of them. Both pieces of dog shit.","commenter_a":"These two look alike younger you vs newer you ewwwww","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"416896861831941","commenter_b":"I do not think Hillary will win (fairly anyway).","commenter_a":"The even bigger issue is that 46% of people still think he's a good president.","post_message":"I am ONE of them...do you?"},{"comment_id":"10153746096543984","commenter_b":"shut Obama down, stop paying congress until they do their jobs","commenter_a":"not a dime til this is resolved","post_message":"Obama has just announced the number of Syrian refugees the U.S. will take in, and liberals aren't too happy about it.   What do you think the U.S. should do about the Syrian refugee crisis?"},{"comment_id":"1841606822750087","commenter_b":"KORDSTAN","commenter_a":"So glad he is gone!","post_message":"President Obama delivered his final address to the American public in Chicago. How will you remember Obama's legacy? #ObamaFarewell"},{"comment_id":"10153573437688984","commenter_b":"That makes sense since she's a woman","commenter_a":"Bruce Jenner is a disgraceful, sick, fake excuse of a man. ..","post_message":"Wow. Franklin Graham just made a massive statement about 'Caitlyn' Jenner on Facebook... now it's going viral.  Nearly half a million people just 'liked' this post... because it's absolutely perfect.  Spread this absolutely everywhere."}]
