[{"comment_id":"1677003925887340","commenter_b":"'@username, why do many Americans believe that Obama isn't concerned about protecting America? He has given no indication whatsoever that this is the case. As a matter of fact, he does just the opposite. Do you seriously believe that building a wall at the Mexican border and not accepting any refugees will do anything to stop terrorism? The roots of terrorism are not illegal immigrants or refugees. The roots of terrorism are Americas interferences in the middle east. The roots of terrorism are people who say 'bomb them and take their oil'. How would you feel if someone would say this about the USA? Terrorists can be fought with weapons but terrorism can only be fought with education. And this is exactly what Obama does. Educating people...by talking about Islam, by visiting a mosque, by saying he will stand with the Muslim Americans. That doesn't mean he hates Christians or ...","commenter_a":"Congratulations Mr. TRUMP. We look forward to seeing you here in SC. Our country needs a strong leader that's going to make this country great again. We need someone in the white house that actually is a christian, strengthens our military and will secure our borders. Take care of our people first, the great people of the United States.","post_message":"Good morning America! THANK YOU for your vote, New Hampshire! We will MAKE AMERICA GREAT AGAIN! Off to South Carolina today. Everyone have a GREAT DAY, and again- thank you!"},{"comment_id":"10154054028806178","commenter_b":"Crazy woman.","commenter_a":"NYT - suck it.","post_message":"Did you see this coming?"},{"comment_id":"478833062241288","commenter_b":"We all know O-ass is reallllly stupid","commenter_a":"Obama'smass army of Murders.","post_message":"Here's what the NYPD Commissioner thinks of President Obama's plan to reduce overcrowding in federal prisons."},{"comment_id":"10153071973637217","commenter_b":"Whats up with the broken leg? Haha random","commenter_a":"... well ... coulda been worse !","post_message":"24 unconscious, several dislocated shoulders and 1 broken leg"},{"comment_id":"10153170547614170","commenter_b":"She will find a way to get out of it!!","commenter_a":"The Clintons are just like Obama, Lerner & Holder who all believe they are above the law.","post_message":"I don't know if people realize how big this is. It's such a serious violation of the law, even the New York Times is calling her on it And it's all because this woman is an obsessive control freak."},{"comment_id":"1747479275473588","commenter_b":"Fawwwwwk no cuz that proves a bih can't cook fr😩😩😂😂😂","commenter_a":"'@username some shit you'd do😂😂😂","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1242790859084298","commenter_b":"She's a wife and mother. Needs to grow up, cover up, and act like a lady!","commenter_a":"Fortunately the majority of police officers are good, hard working people serving/protecting their communities. Are there a few bad ones? Of course! The media really hypes the bad police officers, the knuckle heads looting and destroying communities 'in protest'. Not highlight the wonderful police officers laying their life on the line to protect our butts. Not highlighting the people that truly feel stepped on and are peacefully coming together with all to promote positive changes. 'Be the change that you wish to see in this this world.' This is what I live by and teach my children. We should be brought together by love, not torn apart by hate.","post_message":"#EntertainmentNews  And the #BoycottBeyonce battle continues...the singer is being accused of using her recent Super Bowl performance 'to divide Americans by promoting the Black Panthers and her antipolice message.'  Do you agree?"}]
