[{"comment_id":"10153333676096680","commenter_b":"Yep, karma is a bit*h !!","commenter_a":"This is the best election ever! The irony of Republicans being upset about the Pope questioning the religion of a politician is absolutely overwhelming...considering the constant questioning and outright ignorance about the faith of President Obama. And do not get me started on them running a Canadian after 8 years of racist birthers.","post_message":"He's mad."},{"comment_id":"1736968439901263","commenter_b":"@username - nobody in this world is a bigger liar than Hillary. Period.","commenter_a":"Why is it when her lips move my first thought is liar liar pants on fire...when will she tell how much she took from foreign governments - oh well, what difference does it make anyway","post_message":"Watch: Hillary Clinton suggests Donald J. Trump hasn't paid his taxes."},{"comment_id":"789545591173673","commenter_b":"Some states are allowing people to vote through the DMV instead of going to the polls....most of these states are where the illegal immigrants are.....that is where it is not fair, because illegals can have a drivers license now in some of these states and will vote democrat illegally . That is why it is more important than ever to get out and vote if you want a republican to win.","commenter_a":"I hope the election isn't rigged. The government we have now doesn't want Trump to win. He,will find out too much truth and tell us like it is. No more secrets no more lies. Trump 2016!!!!","post_message":"Time Magazine has me on the cover this week. David Von Drehle has written one of the best stories I have ever had. He brilliantly tells it like it is -- the real deal! Read it!  @webpagelink"},{"comment_id":"1302991003096347","commenter_b":"Wait-what? these illegals don't like what's going to happen? well, guess what? this is still America, we have immigration laws and it looks like the authorities are going to have to start following them. Go home and come back legally and you'll be welcomed with open arms!","commenter_a":"Start packing","post_message":"BREAKING: Trump Appoints Head Of Immigration Team Illegals, Liberals HORRIFIED!!!   We're making America GREAT!!"},{"comment_id":"10154302113081509","commenter_b":"She had them surgically removed. She also doesn't have a brain or even a modicum of decency. And THAT is why she's running for office! Hellary 2016!","commenter_a":"Hillary would you like to have your husband also in prison ? Or else a dildo is enough ?","post_message":"Hillary Clinton had a message for a supporter's father who is backing Donald J. Trump"},{"comment_id":"821592037937050","commenter_b":"And unfortunately it is another woman saying it. SMH","commenter_a":"Doesn't someone always say: \"Forget these women\"?","post_message":"“Forget these women. What you’re seeing is the destruction of a legacy.\"  - Phylicia Rashad"},{"comment_id":"10152781185011748","commenter_b":"A woman named Ann Coulter taught me to hate the republican party!","commenter_a":"Why is it still speaking?","post_message":"Ann Coulter slams college loans as a \"scam\" meant to make kids hate white people and Republicans"}]
