[{"comment_id":"631726717035650","commenter_b":"You go girls don't let them do something that you dont want to do","commenter_a":"We should be WAY past forcing women to perform (in any capacity) against their will. Especially for a degenerate like Trump!!! Resist ladies. A stand must be taken against this. Millions of people are are your side. Let Trump hire his knucke-dragging Klan supporters for entertainment if he wants to get his jollies.","post_message":"These Rockettes are NOT taking this lying down. You go, ladies!"},{"comment_id":"551295498386832","commenter_b":"Hillary is crooked af it's the perfect excuse.. Get a life.","commenter_a":"Love you Bernie but I can't support your endorsement. I know you'll continue to do what you can from your position and if given the opportunity to support you I will do so. But it looks like I will have to change my vote to Trump this year. I will not support Hillary under any circumstances.","post_message":"Thank you, Bernie Sanders. Proud to fight alongside you."},{"comment_id":"1100128256666646","commenter_b":"The refugees are not the terrorists. As more information becomes available, the assumption that they are looks more and more ridiculous. Also, the vetting for the small percentage of refugees the US has been willing to accept is much stronger than anything happening in Europe at this time. Shame on our Governor. She is smart enough to know better.","commenter_a":"Governor Baker of MA has stated they're not accepting Syrian refugees. When will we hear this from you, Governor?","post_message":"President Obama has issued a proclamation ordering the lowering of flags on all public buildings and grounds to half-staff immediately and until sunset, Thursday, November 19, in honor of the victims of the terror attacks in Paris.  Governor Maggie Hassan has issued the following statement:  “I continue to join all Granite Staters and all Americans in mourning with and sending our thoughts and prayers to the people of France following these horrific terror attacks. State emergency management officials and the State Police will continue working with national Homeland Security, the FBI and local police departments to exercise extra vigilance and ensure that all necessary security precautions are taken in New Hampshire. As people across the country and the world stand together in support of the French people and one another, these heinous acts of terror will only strengthen our collective resolve to rid the world of violent extremism.”"},{"comment_id":"1178173242225154","commenter_b":"That's what whores do","commenter_a":"She shoulda put sum lil shorts on underneath that dress if she gonna be doin all that twistin round..she knew damn well that shit is more like a shirt than anything on her.","post_message":"Big booty problems."},{"comment_id":"1134174459956481","commenter_b":"Put her in jail for contempt of court","commenter_a":"This trash needs to leave, NOW!!!","post_message":"Muslim Woman Refuses To Take Off Head Scarf In Court, So No-Nonsense Judge Does THIS In our country you have to follow the laws of our court. If not,  suffer the consequences. Do you support this no-nonsense judge?"},{"comment_id":"10153256342071336","commenter_b":"Thank you.","commenter_a":"Good! He deserves it!","post_message":"Breaking News: Jury sentences convicted Boston Marathon bomber Dzhokhar Tsarnaev to death."},{"comment_id":"593592797513564","commenter_b":"Absolutely. Bitches get treated!","commenter_a":"'@username 😂","post_message":"Watch out"}]
