[{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: \"Oh for goodness, that is not going to happen. I'm not even answering that question.\" #DemDebate"},{"comment_id":"10153154397831051","commenter_b":"Trump is absolutely right. Illegal aliens are not immigrants by the way. They are merely common criminals. Criminal is not a race.","commenter_a":"I don't want their jobs but we need our benefits. Would you let your kid go hungry to feed a stranger?","post_message":"We went to the Donald Trump protest this week to speak to his supporters and critics. Here's what they had to say. Do you agree or disagree with Trump when it comes to immigration?"},{"comment_id":"1032772820091472","commenter_b":"And white people killing white people. America is a violent country. One man can't change that! Sad, isn't it","commenter_a":"If he was still alive it still be the same thing black people killing black people so yea everything is the same thing it do not matter","post_message":"Absolutely!"},{"comment_id":"10154349136059203","commenter_b":"Then you would be sexually assaulting a sexual assaulter","commenter_a":"If I ever saw this piece of shit in the street, I'd kick him in the nuts. He's a disgusting animal","post_message":"As if this could get any sicker."},{"comment_id":"10152912760116491","commenter_b":"Nichole with all respects, no one is entitled to ANYTHING! I simply illustrate that women must figure out exactly what it is they want before complaining about how things are. I purposely let the door close on a woman because I don't always hold it for a guy. Women give me a stink face so often and I tell them it's me treating them equally. Have a woman pay for her own dinner once and see how far you get to having a second date. ... List goes on and on","commenter_a":"I've been to the Middle East. There isn't an American woman alive that can talk to me about oppression by men. Women run this country. They are the reason men wake up in the morning. I feel women in this country have an identity crisis in that they want chilvary but in the same instance they want equality. Men are tough and ravenous towards each other. You want that then don't complain when men treat you as they would a fellow man. (I want to add this doesn't apply to ALL women just the ones it does)","post_message":"Much of what we hear about the plight of American women is false."},{"comment_id":"10155169202635231","commenter_b":"You're rare Theresa -- women don't think this way.","commenter_a":"Wow, he couldn't just get married to a good woman???? He could've gotten it for the rest of his life...but that's how crazy some men are. Go figure!!!","post_message":"Warren Sapp paid some $600 for oral sex, which he allegedly taped using his cellphone camera."},{"comment_id":"10153221748849087","commenter_b":"@username,where are you from?? You pig!! Photoshop your KKK outfit on your daddy...hahahahahaha","commenter_a":"IT WAS YOU, OBAMA who spoke these words at an Islamic dinner - \"I am one of you.\" IT WAS YOU, OBAMA who on ABC News referenced - \"My Muslim faith.\" IT WAS YOU, OBAMA who gave $100 million in U.S. taxpayer funds to re-build foreign mosques. IT WAS YOU, OBAMA who wrote that in the event of a conflict -\"I will stand with the Muslims.\" IT WAS YOU, OBAMA who assured the Egyptian Foreign Minister that - \"I am a Muslim.\" IT WAS YOU, OBAMA who bowed in submission before the Saudi King. IT WAS YOU, OBAMA who sat for 20 years in a Liberation Theology Church condemning Christianity and professing Marxism. IT WAS YOU, OBAMA who exempted Muslims from penalties under Obamacare that the rest of us have to pay. IT WAS YOU, OBAMA who purposefully omitted - \"endowed by our Creator\" - from your recitation of The ...","post_message":"“I do not believe Sharia is consistent with the Constitution of this country,” Dr. Ben Carson told The Hill. “Muslims feel that their religion is very much a part of your public life and what you do as a public official, and that’s inconsistent with our principles and our Constitution.”"}]
