[{"comment_id":"10153059346813525","commenter_b":"Stacey Panarelli","commenter_a":"If you read the whole story, the girl was able to free the dog and it came back to help her when she was in danger! What a HERO, Awesome dog that gave its life to save hers. About it being off leash, how many of us at a park take a pet off leash to fetch a ball or play or whatever? Have a HEART!!! I cant imagine what they are going through and its terrible those kids and Haze`s family watched in horror. My prayers and heart go out to them!!!!! Haze youre a hero dog!!!!","post_message":"\"By the time I got on the bank with 'Haze,' the gator is eyeing both of us.\" www.myfoxtampabay.com/story/@username/gator-snags-dog-on-hillsborough-river-as-family-watches-in-horror"},{"comment_id":"10154086298502541","commenter_b":"I find this horrific but please take down the pictures","commenter_a":"Where is Al Sharpton when you need him. Lol","post_message":"Police spokesman Anthony Guglielmi said that while the suspects made “terrible racist statements” against white people during the attack, it does not appear to be racially motivated."},{"comment_id":"10153434193979138","commenter_b":"Time to ban women..","commenter_a":"Women are crazy!","post_message":"DEVELOPING- A St. Paul woman has been taken into custody after her boyfriend was stabbed to death this morning"},{"comment_id":"526053707590689","commenter_b":"She needs to go back to the Chicago geto where she belongs!","commenter_a":"She is such a liar she acts socked but she has tapers in the White House","post_message":"\"I can't stop thinking about this. It has shaken to me to my core in a way that I couldn't have predicted,\" Michelle Obama said regarding Donald J. Trump bragging on a 2005 tape about his fame allowing him to \"do anything to women.”"},{"comment_id":"1275021955856646","commenter_b":"They just need to stay out of our vaginas!","commenter_a":"Talk about several steps back for women's rights. Then women will need permission to use birth control, to vote, to get a job ... And if you are foolish enough to think permission is only going to apply with abortions, you are mistaken. This is Christian right wing control. Can you say Sharia Law, anyone?","post_message":"Oh look, more people not minding their own business."},{"comment_id":"722009277961832","commenter_b":"Brunch?","commenter_a":"@username come visit","post_message":"Mark your calendars for Jan. 29. On that day only this year, more than 30 museums in Southern California will offer free general admission as part of the 12th annual Museums Free-For-All-Day."},{"comment_id":"1734707080142446","commenter_b":"@username fuck outta here!!! Hahaha biggie pulled more bitches!!!!! REALIZE THAT NONE OF THOSE FEMALES U NAMED IS BAD ALL UGLY ASS HOES!! THE BEST LOOKIN FEMALE BIGGIE GOT TUPAC FUCKED (Faith)!!!!! Jada Smith shut biggies females down lol","commenter_a":"Biggie, cus todays people are too stupid to understand Tupacs lyrics lol","post_message":"VOTE NOW! 2pac vs. The Notorious B.I.G. -- Who'd be bigger today? #DEWcision2016 #sp See how your fellow hip-hop fans are voting here..."}]
