[{"comment_id":"10154299911443128","commenter_b":"40K Cubans today 100K Muslims yesterday.","commenter_a":"I'm sorry, but this old man is as stupid as they come if he really thinks we, as Americans, are buying this inflammatory rhetoric. Get real. Maybe he forgets how or just wants to go the way of his candidate down to LA LA land. Bon Voyage! ;-)","post_message":"Oil billionaire T. Boone Pickens, who endorsed presumptive GOP nominee Donald Trump, is planning to host a fundraising event for the pro-Trump super PAC next month."},{"comment_id":"10152879295577623","commenter_b":"A lot of girls are...","commenter_a":"Worst part is...SHE looks like she was cute,pre meth...","post_message":"A man and woman from North Carolina were arrested in Louisiana and face charges of manufacturing meth."},{"comment_id":"10154713601071336","commenter_b":"For the tape no more no less!","commenter_a":"The sexual assault was words - big deal.","post_message":"Donald J. Trump says accusations of sexual assault may have been started by Hillary Clinton's campaign: \"I didn't even apologize to my wife...because I didn't do anything.\" #Debates2016 #FoxNews2016"},{"comment_id":"1227002650653096","commenter_b":"The LATIN EMPIRE AWAKENS! They realize that Republicans will get them into American class warfare!","commenter_a":"Latino Republicans? Does such an animal exist?","post_message":"Latino Republicans are mounting a pushback against the more conservative wing of their party."},{"comment_id":"10154268012211336","commenter_b":"HURRY UP AND OD, MAKE AMERICA PROUD, FIDDY THENTS.","commenter_a":"50 cent. Ironically, that's also what his career is worth.","post_message":"In a video posted on Instagram, 50 Cent confronts a young man as he pushes a cleaning cart through the terminal and accuses him of appearing to be high on drugs."},{"comment_id":"1036436079751842","commenter_b":"Now that's a face only a mother could love!!!! What a mutha!!!","commenter_a":"BS!","post_message":"UNREAL: Thug Rapper Calls For Presidential Candidate To Be Slaughtered- Media Silent (LISTEN) Could you imagine if a white guy did this to candidate Obama? @webpagelink"},{"comment_id":"1089399481081062","commenter_b":"Hahahaha","commenter_a":"Matthieu Sinclair","post_message":""}]
