[{"comment_id":"518916724963287","commenter_b":"Is she holding a sex toy???!!!!!","commenter_a":"I cannot believe facebook has stuped so low to put this kind of crap on their page, I'm thinking it might be time to leave.","post_message":"THIS IS DISGUSTING..."},{"comment_id":"1666754860284644","commenter_b":"As a veteran educator with 31 years experience, I am appalled by Betsy DeVos's level of complete and utter incompetence. As a parent of a special needs child, I am alarmed and sickened at her flippant discard of imperative federal laws that protect those that cannot protect themselves. Shame on you, Donald Trump, for promoting her, and shame on you, Betsy DeVos, for accepting a position for which you have zero aptitude.","commenter_a":"Once again Senator Kaine, your questioning along with others brought out that she has NO clue. Our children cannot afford to have this kind of management over their education. Scary!!","post_message":"I worry about the effects of a leader who thinks 'government sucks' on the morale of teachers. Disappointed Betsy DeVos does not support equal accountability and IDEA for all schools getting tax dollars."},{"comment_id":"10153584485708812","commenter_b":"So did Jesus preach love or condemnation??? I'm confused! Wait, actually YOU ARE CONFUSED! Don't buy the nonsense you are listening to on Sundays. Save your 10%, and search your soul for the truth! Ironic how the same people who follow Jesus (a man of love and forgiveness), are the ones who are most hateful and judgmental","commenter_a":"Wow... Let's see what's next... You give a little & then they want more. SMH","post_message":"South Carolina House approves bill removing Confederate flag from Statehouse grounds: @webpagelink"},{"comment_id":"10154701801396002","commenter_b":"Just like this woman doesn't care if you believe her or not.","commenter_a":"I'm not believing this, you're leaving prescription drugs in the house and know you're going to be gone for 5 days? We never leave ours behind Fir any reason because of what you have to go thru to replace them. I also can't believe they stole video games and not the TV. According to the report and the time limit, they would of wiped them out. Just my opinion.","post_message":"Standing in the middle of her ransacked living room, Taylor resident Janice Mulholland is in disbelief."},{"comment_id":"1686987451566043","commenter_b":"@username -- A woman who gets raped didn't choose to have that sex.","commenter_a":"Isn't it great that we have the Government to make decisions about what women can and cannot do with their bodies? I'm so glad we have old, white men who can control our woman parts for us.","post_message":"Indiana Governor Mike Pence signed a bill that bars women from seeking an abortion because the child will be born with a disability, a controversial restriction that is one of the tightest abortion laws in the country."},{"comment_id":"10153478960668984","commenter_b":"Shows what kinda person she is, she throws her own Dad under the Bus,, Classy, dirt bag.","commenter_a":"They say the acorn doesn't fall from the tree","post_message":"Mosby has made it widely known that she comes from a long line of police officers, but this admission reveals a very different look into her background..."},{"comment_id":"10152781007061615","commenter_b":"Our veterans go without while lazy a**es and foreigners collect cash, food stamps and free medical. What's wrong with this picture??? VETERANS AND ALL MILITARY SHOULD COME FIRST! They put their lives on the line so the lazy idiots and illegals don't have to. WAKE UP AMERICA AND GET YOUR PRIORITIES STRAIGHT!!! Rant over.","commenter_a":"but it was OK that he put his life on the line for this country give the man what he deserves","post_message":"DENIED. An American hero, unable to collect his military benefits when he needed them most. WPXI Rick Earle gets help for this veteran. His story is coming up tonight at 5:45 p.m."}]
