[{"comment_id":"10153775888041756","commenter_b":"Some of these countries send their boys to war as young as age 6. That's gendercide too. And a much more painful form of it. Like in Sparta where they would kill the boys if they didn't have a warrior's body. Male disposability exists throughout the world including the West. And it persists regardless of the sex of the leader. The Queens of England ruled half the world for long periods of time but it was still the men who were disposable. I would never expect the mass media to address that. Not for another hundred years that is.","commenter_a":"Those are going to be some very unhappy boys.","post_message":"Technology has enabled even the poorest of countries to boost the ratio of boys over girls. One expert even goes so far as to use the term \"culling\" when talking about what's going on in these countries — a word otherwise reserved for describing the removal of undesirable animals from the herd."},{"comment_id":"1569991603060963","commenter_b":"Oprah is a piece of shit.","commenter_a":"Ignorant celebrity","post_message":"It's all about the win for 'your side'."},{"comment_id":"10153745742861051","commenter_b":"GO HILLARY 1ST WOMEN PRESIDENT!","commenter_a":"Yes as long as it isn't clinton I don't really care as long as they are a good president and loves this country and the people who are citizens. She is only out for herself and wouldmake a horrible president she is to crooked .","post_message":"Trump has no problem with the idea of having a female president in America -- as long as it isn't Hillary Clinton. Do you feel the same way?"},{"comment_id":"10154084901793837","commenter_b":"How horrible to be treated like that. I hope she gets fired.","commenter_a":"Wtf is wrong with these people ..","post_message":"QUESTIONABLE TSA TREATMENT? A woman diagnosed with breast cancer says she was humiliated by TSA during a recent security check. Hear what she has to say about the ordeal."},{"comment_id":"10153266437101336","commenter_b":"Real biker gangs are way more dangerous than the pretty actors on that show made them seem.","commenter_a":"They all must have watched a marathon of Sons of Anarchy this past weekend","post_message":"UPDATE: Police adjust the number of people arrested from 192 to 170. \"This is probably one of the most gruesome crime scenes I've ever seen in my 34 years of law enforcement.” – Waco police Sgt. W. Patrick Swanton @webpagelink"},{"comment_id":"960663503945907","commenter_b":"If you don't love her(America) then leave now !","commenter_a":"Good bye Felicia!","post_message":"U.S. students jump off deep end: Renounce America Now it's official. Many American students want to have nothing to do with the U.S., and they're pressing for this astonishing action."},{"comment_id":"10153253318118188","commenter_b":"I don't see women chomping at the bit to be garbage men, roughnecks, boilermakers, crab fishers, or construction workers.","commenter_a":"She's a joke!","post_message":"ICYMI:"}]
