[{"comment_id":"1031214057011772","commenter_b":"Keeps women from cheating lmao","commenter_a":"So, she wants to be registered, heavily taxed, and locked up at night?","post_message":"Pure gold..."},{"comment_id":"822097871159007","commenter_b":"Take it from a feminist, there is no wage gap. @webpagelink","commenter_a":"All wonderful.... now let's see if we can make \"being paid like a girl\" equivalent to being paid like a man!","post_message":"Maybe it's not a bad thing... (h/t United Humanists) Do you consider yourself a feminist? Let us know: @webpagelink"},{"comment_id":"10153545304972452","commenter_b":"Happy mothers day mom, have a cheeseburger, see ya later!","commenter_a":"was it on a friday ?","post_message":"When they both went for the cheeseburger, investigators said Benjamin Middendorf had enough and shot his brother."},{"comment_id":"10153913161040329","commenter_b":"\"Suck you dry and take you out for lunch\" she's a country lass, it is obvious: barley, then gooseberries.","commenter_a":"I couldn't actually finish reading it because it made me feel physically sick. Subhuman intellect isn't something to broadcast proudly, you misogynistic douchebags.","post_message":"\"It's people like you who make it clear women should never have been given rights.\""},{"comment_id":"487493421441238","commenter_b":"Get these terrorists out of our country.","commenter_a":"This being wrong is minor compared to the knowledge that someone, supposedly an AMERICAN allowed the demand of a group of visitors in our country to undermine one of the pillars of freedom that this country was founded upon. If our observances offend them , then we should at very minimum expect and get quid pro quo, their presence insults us, so leave, and don't come back.","post_message":"Muslims force this school to ban Christian holidays. America is under attack, we need to spread this. Do you agree this is wrong?"},{"comment_id":"10153132255848145","commenter_b":"Thank you Rachel Payne Nunlist! :)","commenter_a":"I'm sure I will get major flack for this, but the older kids were 10 & 8!!!! Why don't they OPEN THE STUPID DOOR??? I'm not saying the mom was right, the kids could have for sure been taken, but for heavens sake, 10 & 8 is still 10 & 8 when it comes to a hot locked car!!!","post_message":"When a passerby found three young children alone in a locked car, police were called. The children's mom was found a few minutes later in a tanning salon. Here's what happened: @webpagelink #wftv"},{"comment_id":"10150883310494999","commenter_b":"will have to wait to see how many generics fail to work","commenter_a":"There is going to be generic? Why is everyone complaining? This medicine just got way cheaper!","post_message":"The move by Mylan is a common tactic: raising prices before a generic competitor reaches the market, as a sort of final attempt to milk big profits from the brand-name drug."}]
