[{"comment_id":"1051057634970056","commenter_b":"Poor woman","commenter_a":"Pro choice equals anti Christ. Stop having sex tie your tubes. No need to kill","post_message":"This is a win for women's reproductive rights."},{"comment_id":"999687850098947","commenter_b":"FGM - Female Genital Mutilation. The stats about it: @webpagelink","commenter_a":"The awkward moment where liberal values clash with Islam and no one wants to stand up for the gay man to avoid insulting Muslims...","post_message":"“My religion is very clear about what happens to gay people...'"},{"comment_id":"424515887751925","commenter_b":"Kick her out if she won't wear the uniform","commenter_a":"Sorry sweetheart, you cannot honestly believe we who are proud of our Marines are going to consider your sensibilities against our men. Grow up.","post_message":"Liberal Chick has really lost it. Marines in uniform are now offensive? This is cuckoo for cocoa puffs."},{"comment_id":"10152541271415667","commenter_b":"Well Mickey they need a big building for all of his coloring books. Forget the white racist asshats on here... they will all die off eventually.","commenter_a":"Bush is responsible for thousands of american lives yet you bigots hail him as this savior because a blk man is president...he needs to be in jail yet you tea parties build him a library. .FOR WHAT!","post_message":"'I have no more campaigns to run,' Obama quipped during the State of the Union. 'I know 'cause I won both of them.'"},{"comment_id":"10153817478256320","commenter_b":"'@username he will never be a woman","commenter_a":"Um. No. Besides i hear she doesnt even want to be a woman anymore.","post_message":"Happy Birthday!  Caitlyn Jenner celebrates what she considers to be her 'first birthday.'"},{"comment_id":"513861468804433","commenter_b":"Go home u witch","commenter_a":"Moron Muslims are every where lock and load it's time to to what our own goverment won't","post_message":"Muslim woman makes outlandish accusations about Americans on TV.  What a joke. This is the kind of ignorance that starts wars.  Do you agree this woman needs to be silenced?"},{"comment_id":"10153669606379060","commenter_b":"'@username - my point is that Germany is too influenced by its past, too ready to apologize for its past. In the 90s, the extreme right-wing Republikaner and the DVU gained in support because of this blind open-door policy. What is more, Germany expects other EU countries to do the same, irrespective of the cost. I say that this has to stop.","commenter_a":"The Germans typically let in loads of war refugees. More than they can handle. It's their way of apologising for World Wars 1 and 2. In the 90s, they let in 320,000 war refugees from Yugoslavia. What happened in German towns ? Property rents skyrocketed and the crime rates went right up. What's worse, the Germans expect every other country to do the same. Whacky open-door immigration. The UK needs to leave the EU, get sovereignty over its borders and immigration / refugee legisation back and tackle the problem as a single nation. This time, the Germans are letting in 800,000 war refugees from Syria. Absolutely crazy.","post_message":"Ever since Angela Merkel took the lead on the migrant crisis, critics began speaking as though she created it. This is nonsense"}]
