[{"comment_id":"10153306237383984","commenter_b":"It's about d**n time......quit dragging your feet and file the articles....make sure to include all his bogus names in the charges including the name Davis","commenter_a":"If it hasn't been done by now,it's not going to happen.He might be impeached, but to actually 'remove' him from office takes a seperate action,and that's the ultimate goal.But.........don't get your hopes up. Saying and doing....are seperate issues as well!","post_message":"Wow. This guy has a lot of guts to go after Obama in this way. Do you hope his plan to take down Obama is successful?"},{"comment_id":"737825183044101","commenter_b":"I would let a refugee stay in my house.","commenter_a":"I thought all of you on the left were going to let them move into your houses","post_message":"Several refugees have lost fingers and hands from walking in sub-zero temperatures."},{"comment_id":"10153211590889255","commenter_b":"How on earth did that guy get elected in a logical state like Maine? Maybe he had some help.....","commenter_a":"JUst more proof that Le Page is a nutcase and a liar. So glad he isn't from NH . We have enough nutjobs of our own who scare the bejesus out of 4th gfaders!","post_message":"I think I just became an even bigger Stephen King fan."},{"comment_id":"652489448217570","commenter_b":"Bella, ur out of your mind.","commenter_a":"I've never seen a bigger deal made out of nothing than Deflategate","post_message":"Uh-oh...This could be BAD NEWS for Tom Brady!"},{"comment_id":"10153045091301336","commenter_b":"YOU CAN BET YOUR LAST PENNY THAT MR OBOMO HAS HIS GUNS, PLURAL..SHOULD THEIR CHILDREN BE REMOVED, ALL THOSE THAT ARE MAKING THESE LAWS ..HOW ABOUT REMOVING THEIR CHILDREN, THEY ARE IN DANGER IF THERE IS A KNIFE IN THE KITCHEN..OH THEY WANT OUR GUNS..WE MUST STOP THIS NOW..THE CRIMINAL WILL NEVER GIVE UP THEIRS. THEY ARE STOLEN SO NOONE KNOWS UNTIL THEY ARE SHOT SO,THEY CAN ROB THEM.WE HAVE THE MOST STUPID THINGS TO OBJECT THOSE CHILDREN BEING LOVED AND CARED FOR..GET THAT LAWYER AND SHOW THEM YOU HAVE RIGHTS..GO GET THOSE LITTLE ONES WHO ARE NEEDING YOUR LOVE..PLEASE AMERICANS STAND UP FOR THESE PEOPLES DILEMMAS . DEMAND THEY GET THOSE BABIES..GOD BLESS THEM TOTALLY !","commenter_a":"well we better not let foster parents that have a car,knife, prescription drugs,dogs,plastic bags,power tools,bow and arrows,swimmimg pools etc., cause all of theses items can kill!! Get real!!!! The government is trying so hard to take our guns away from us !!! They don't care about these children!! They just want control of our guns and they don't care if children have to stay in orphanages with no hope of having a family to love them!!","post_message":"“I want to help some of these children that don’t have the luxury of a family to love them. Everyone deserves to be loved and cared for.” Valerie and Brian Wilson were denied their request to serve as foster parents because they have legal concealed-carry permits. WATCH more from their interview on 'FOX & Friends Weekend': @webpagelink"},{"comment_id":"10154153036124369","commenter_b":"She confuses common core with curriculum. Anyone against common core is against preparing kids for the job market. The curriculum used implementing common core was written by the text book companies and approved by local school boards. It's OK to be angry at that but Kasich has nothing to do with curriculum so hopefully now you can vote for him again.","commenter_a":"Wake up Ohio.. vote Trump. You need to understand everything Kasich stands for.","post_message":"Authorities in North Carolina say they are looking at Donald Trump's behavior as they continue their probe of a violent altercation at one of his rallies last week."},{"comment_id":"10153015715557452","commenter_b":"Why leave him alone???? He is an admitted rapist! !!!!","commenter_a":"Leave Pill Cosby Alone.","post_message":"Three more women who were allegedly sexually assaulted by Bill Cosby came forward during a press conference Wednesday, bringing the number of accusers up to nearly 50. abc7.la/1N4Pq51"}]
