[{"comment_id":"541791876011392","commenter_b":"Isnt it still a punishable offense in the eyes of the law if it is then the people who are doing this should be arrested and jailed and fined of course i meen after they get their ass's stomped .","commenter_a":"Needs a beating","post_message":"This liberal thought he could burn an American flag, big mistake.  That's what happens when you disrespect our flag. If you don't like it… LEAVE.  Do you support these patriotic students?"},{"comment_id":"1243167749095092","commenter_b":"When i said this far. I'm talking about she's the presidential candidate. Her ass should be in jail by now.","commenter_a":"WAIT!! Who is to say she has gotten \"This Far!\" The News Media!?? Her rallies attract less than 400 people on the average. I believe. I know democrats who are voting for trump that have told me They don't even like him but Hillary will destroy this country! Everything we see and hear is from the \"NEWS MEDIA!\" Listen America, I saw and heard an interview with George Soros overseas last week. He said Donald Trump will win the popular votes of the American people by a \"Landslide!\" BUT!..We have found the Achilles heel of Western Civilization. The electoral votes. Hillary will win by the way the electoral votes have been put in place....America this is scary. The election is rigged way more than the news media is letting us know. I'm sure Donald Trump knows this too. Personally I am praying and asking God to intervene in this election ...","post_message":"Arkansas's attorney general just issued a jarring statement about Hillary Clinton, the state's least favorite daughter.  What the AG says needs to be seen by every American."},{"comment_id":"10153521877313822","commenter_b":"That skank!","commenter_a":"She has an incredible voice.","post_message":"JUST IN: The NFL announces that Lady Gaga will perform the National Anthem at Super Bowl 50.    SUPER BOWL COVERAGE: @webpagelink  What do you think of the choice?   (Gareth Cattermole/ Getty Images)"},{"comment_id":"10156419008515725","commenter_b":"#VoteTrump #TheDonald #ArrestObama #TrumpTrueAmerican #TheTrumpArmy #TrumpNow #MakeAmericaGreatAgain #TrumpFan #TrumpTrainSNL #TrumpForPresident #CompetentTrump #ItsGonnaBeYuge #NoRefugees #GetOnBoardTheTrumpTrain #BuildTheWall #TakeAmericaBack #Trump #OurVeteransMatter #WomenForTrump #TrumpNation #GeorgiaForTrump #CitizensForTrump #TrumpBreathOfFreshAir #MerryChristmasPresidentTrump #LoveTheDonaldsTone #BalancedBudget #TermLimitsForCongressAndSenators #GodBlessDonaldJTrump #GodBlessAmerica","commenter_a":"Americans are sick and tired of being on the back burner . We are the American people who work and should have a voice . We need a President whos gonna have our backs and Trump your it .","post_message":"People like what I say, people respect what I say. I started a discussion that needed to happen. #GOPDebate"},{"comment_id":"10153842833302756","commenter_b":"Racist? Ok then. Keep letting the Muslims in this country to terrorize. Let the BLM people go unchecked and keep killing our Police. Let illegal Mexicans in to drain our already overtaxed healthcare system and bring more drug violence. No, no more. It ends now.","commenter_a":"I can't wrap my head around how anyone comprehends what he's saying. He literally says the same thing OVER AND OVER, but I guess that's the only way his racist, small-minded supporters can understand him.","post_message":"Republican presidential nominee Donald Trump spoke with Newswatch 16 after his rally in Scranton on Wednesday. See more here: @webpagelink"},{"comment_id":"10154409316811336","commenter_b":"I think like all of us Trump thought no this can't be and thus he thought it was a joke! Then reality of course set in and the man thought as we all do who would expect anything different from the Clintons? My question what is next to come it is something every single day?","commenter_a":"Why would Trump think that such a meeting would be just a joke? All of these democrats are capable of any despicable act imaginable! They have proven it over and over again, but all we ever do about it is whine like little punks! obama should be in prison, hillary should be on trial and lynch should be removed and arrested as well! ENOUGH with the beating around the bush! We need to hit them on the head! They need to be punished severely NOW!!!","post_message":"“I'm flabbergasted by it.”  Donald J. Trump reacted to the news that Attorney General Loretta Lynch met privately with former President Bill Clinton amid the DOJ’s investigation into Hillary Clinton’s emails. Full interview tonight at 10p ET."},{"comment_id":"10154061115835530","commenter_b":"Someone blow smoke in this chicks face please","commenter_a":"Gross. Second hand smoke from cigarettes is disgusting enough, I get to choke on obnoxious people's vape fumes everywhere, and now we can add weed to the mix. Wonderful.","post_message":"Introduced by state Sen. Coleman A. Young II, D-Detroit, the bill is being called the “non-medical marijuana code.’’"}]
