[{"comment_id":"864444063671976","commenter_b":"Super gross. I can't stand that feeling how some women think it's sexy is beyond me.","commenter_a":"Gross","post_message":"Armpit Hair Is Trending, And It’s A Step Forward For Women Everywhere"},{"comment_id":"10153063718888606","commenter_b":"What would be said if they were male teachers and little girls.... Sick is sick.... They need to go to jail and be on the sex offenders list.....","commenter_a":"Definitely a crazy world we live in!","post_message":"Two California teachers are accused of having sex with students while on trips to the beach, which included one overnight occasion. Police describe what happened here: @webpagelink"},{"comment_id":"1073989012671274","commenter_b":"LOCK HER UP !!!!!! LOCK HER UP!!!!!!!!!! LOCK HER UP!!!!!!","commenter_a":"Yea to Iran and Syria to send there trash here while our jobs and wealth leaves while you trash the country to get rich???? Yea ok...#TRUMP2016","post_message":"\"Next week in Philadelphia, we will offer a very different vision for our country, one that is about building bridges, not walls.\"  In introducing her running mate U.S. Senator Tim Kaine, Hillary Clinton promised the DNC would look quite different than the RNC. bit.ly/2a3iybw"},{"comment_id":"595624923955506","commenter_b":"yesssss bitch","commenter_a":"@username thought of you bb","post_message":"♫ I'm dreaming of a cheesy Christmas.... ♫"},{"comment_id":"1038817212861551","commenter_b":"My gurl !!!!","commenter_a":"President Hillary Clinton","post_message":"\"Don’t let anyone ever tell you that this country isn’t great.\" - Michelle Obama delivers an emotional testimony to the greatness of the United States of America. @webpagelink"},{"comment_id":"392468917544370","commenter_b":"He said \"unvaccinated foreigners\" caused this. Read that again... Slowly.","commenter_a":"Fran Cella I agree with Rush.","post_message":"What do you think of Rush Limbaugh's theory on the vaccinations debate?"},{"comment_id":"1151935354873218","commenter_b":"Nasty hoe","commenter_a":"Some people are seriously fucked up! Mad, evil with a shot of mental illness.","post_message":"Damn  #WSHH"}]
