[{"comment_id":"10156176044470354","commenter_b":"I think the women of the View are ignorant. Their 15 minutes has been up years ago !!!!!!!!!!!!!!!!!","commenter_a":"These women are a bunch of assclowns... They mean nothing and I can't wait for the day they need a nurse then they will be eating their words and asking for your help... SMH...","post_message":"The #NursesUnite movement is mobilizing against liberal co-hosts of \"The View\" Joy Behar and Michelle Collins. But now, new arrogant and elitist behind-the-scenes comments are coming to light and sparking further uproar with nurses across America..."},{"comment_id":"10154789481757235","commenter_b":"@username Pls don't compare Trump to pigs. Pigs are wonderful.","commenter_a":"Fantastic job, Trump Team. Scare the crap out of everyone, then disavow. Keystone Kops got nothing on you.","post_message":"AWKWARD!"},{"comment_id":"939244866171766","commenter_b":"The woman who jumped the young lady works as a loan officer for Bank of America. I guess she still has a job . Tyler thanks , it appears that in many of the comments throughout this post only one race was involved in \" trespassing\".","commenter_a":"Pool passes!!!!! I saw another comment somewhere else from an actual member at the pool. This was a members (HOA) only pool where there WAS several BLACK members and was present at the time. There was a private pool party going on where the DJ that was hired sent out a tweet about was he was doing. The pool was swarmed by kids from another neighborhood with no pass and uninvited. Which is technically \"trespassing\". They was asked to leave and started a fight in which the cops was called. The police had made several requests to leave with no luck. This girl ( if you watch the full video) was asked to leave several times and told the officer \" F-YOU\" and that's when the officer grabbed her. First off she and the rest was trespassing and second refused to leave when asked. @webpagelink","post_message":"A young woman who attended the McKinney pool party gives her explanation for \"how it all began.\" Watch the full interview here: @webpagelink"},{"comment_id":"1250130898332398","commenter_b":"Fuck off bitch!","commenter_a":"I voted for Bernie. I'm voting for whoever stops that White Nationalist Donald Trump. If Bernie is voting Hillary, so am I.","post_message":"Bernie just put the nail in the coffin for the Trump campaign. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1632303213733906","commenter_b":"This dumb chick is over reacting","commenter_a":"Yeah! No thanks your husband has already broken America","post_message":"One first lady has already lost to Donald Trump... could Michelle win in 2020?? @webpagelink"},{"comment_id":"10153482895003908","commenter_b":"Diet is unhealthy less u r a ufc fighter needing to perform at peek potential. Im more ripped than 85% of ufc fighters cause i burn more calories than i ingest..","commenter_a":"Absolutely true!","post_message":"A powerful ad exposes everything that's wrong with the diet industry in just 31 seconds."},{"comment_id":"10154000901360575","commenter_b":"Trump may not be as conservative as you or I, but neither is he a liberal, and anyone who tries to convince you that Trump is a liberal is a liar. A liberal would not want to build a wall. A liberal would not want to enforce our immigration laws. A liberal would not want to repeal Obamacare. A liberal would not want to bomb ISIS back to the stone age. A liberal would not want to bring back waterboarding “and worse” for terrorists. A liberal would not want to protect your right to own and carry a gun to protect yourself. A liberal would not want to defund tax-funded abortions. A liberal would not want to build up the military. A liberal would not want to take care of our vets. A liberal would not support our police. A liberal would not want to negotiate trade deals that give ...","commenter_a":"@username, you are so correct!! Trump has not said one intelligent thing during any of his speeches. Furthermore, his false accusations of calling Senator Cruz a lier is not working for him. Anyone who believes anything Donald says is delusional. Why has Trump not agreed to debate Senator Cruz!? Donald knows he is no match to Senator Cruz. Additionally, Donald lacks knowledge, experience and intelligence to speak about the most critical issues facing our country. You cannot be a Commander-in-Chief just because you are rich!! CEO's of large corporations are not hired to run a company because they are rich. Your resume matters!","post_message":"Cruz trashes New York in hopes of picking up votes in Pennsylvania."}]
