[{"comment_id":"943053922418420","commenter_b":"It's like 5 minutes and it's good. Watch it goddamn!","commenter_a":"@username watch the video xo","post_message":"Alan Watts delivered this profound message decades ago, and unfortunately not much has changed.  Vis Reset.Me"},{"comment_id":"10153677619074641","commenter_b":"Radicalism is one of the biggest problem for all countries and all societies. If you say radicalism or terrorism is related to a religion, it is completely wrong . You can see a lot of samples from history. The important point here is why radicalism has raised within last ten-twenty years. One of the answer of this question is imperializm. USA has raised terrorizm and radicalism on the world , africa, middeeast. ( Iraq, Libya invasion , bombing , killing more than 1 million people ) . USA has really created huge chaos in middleeast and destoyed Iraq. So ISIS has came up there . Terrorizm in middleeast is not religion issue . If USA and other countries had did same thing ( bombing , invasion, killing , creating chaos continuosly) at another part of the world during years, you would see similar terrorist groups there. So in order to ...","commenter_a":"Why ISIS hates France so much ? @webpagelink","post_message":"French President Hollande: \"We are at war -- a war against terrorism.\"   More: @webpagelink"},{"comment_id":"10153288020701545","commenter_b":"I hope you never lose your corporate job. And I also hope the minimum wage workers you go to every day for house cleaning, coffee, lawn care and a burger don't abandon you.","commenter_a":"If people work 40 hours a week, minimum wage should cover minimum living expenses. This isn't even a question.","post_message":"The National Restaurant Association says a $15 base wage would force employers to replace workers with technology, such as ordering tablets. \"Fifteen dollars is too far, too fast,\" said spokeswoman Christin Fernandez.  What do you think is a fair minimum wage?"},{"comment_id":"10153089034256051","commenter_b":"She should have either buckled herself then got sick or she could have knead down holding door and do it that way ( some vans have a handles)..or have a push window..or found something to vomit in","commenter_a":"There is a reason why yiu are suppose to wear a seat belt. Glad she is ok though.","post_message":"This woman began feeling sick while driving and ended up opening a car door to throw up. The problem is, the car was still moving at the time."},{"comment_id":"1096918067034607","commenter_b":"It's up to a woman if she wants to wear both rings or just 1 of the rings. She is married now so she has the choice","commenter_a":"I thought it was the plain gold wedding band that was important, not the engagement ring. That's why it's called an engagement ring. You don't have to wear it once you're married.","post_message":"Amal Clooney wants a smaller engagement ring"},{"comment_id":"10154164626642293","commenter_b":"This is so very tragic and sad. Based on the videos that have been released, this officer appears to have fired for no reason. Police need to be held accountable, just like everyone else, when they break the law.","commenter_a":"And we need female policepersons exactly why?","post_message":"Officer Betty Shelby has been charged with manslaughter for the shooting of Terence Crutcher."},{"comment_id":"10156156980300615","commenter_b":"You think most women are going to wear a gun strapped to their hip or chest so that it is visible? Are you serious?","commenter_a":"Open carry idiots should connect with this, since they are such dickheads.","post_message":"What's wrong with this picture? In Texas it will soon be legal to carry a gun on campus but not a red plastic penis."}]
