[{"comment_id":"679238678931090","commenter_b":"I have been drinking Pepsi since 1966! I will NEVER BUY IT AGAIN, not because of what she said , but because TRUMP HAS SAID FROM THE BEGINNING , This country has sold out to foreign countries that hate us AND PEPSI HAS THIS WOMAN IN CHARGE OF AN AMERICAN COMPANY!!","commenter_a":"When will they ever learn.. Boycotts work..","post_message":"INSTANT JUSTICE... Let's get 5,000 SHARES for TRUMP!"},{"comment_id":"10153047455238984","commenter_b":"would not let that les hatefull bitch raise a golld fish, fel sorry fr her children","commenter_a":"Rosie O'Donnel's son is still trying to deal with the fact that his mother bought him from a cash strapped viewer of her tv show.","post_message":"Oops. This isn't what the left wanted them to say..."},{"comment_id":"10154054009251337","commenter_b":"God Damn I want some fries now.","commenter_a":"Fuck Topher Grace. He ruined Venom.","post_message":"IT'S NOT A REUNION! Curb Your Enthusiasm's reunion for Seinfeld finally gets edited together..."},{"comment_id":"1227725310657052","commenter_b":"Please don't reproduce.","commenter_a":"Trump incites violence. He is bringing the racists out in droves and he is dividing this country. Since he came on the scene, there has been more hate crimes than I've ever seen. Wake up people!","post_message":"The sniper attack on Dallas police officers now ranks among the deadliest against U.S. law enforcement since 1900."},{"comment_id":"10154269776132619","commenter_b":"What is ISRAEL SUPPOSED TO DO?????????? let the rest of the world walk all over them????? I don't think so..... If a lot more countries in the world were like ISRAEL the world would be a better place....","commenter_a":"Let's black list the UN. It needs to go. Thugs in suits.","post_message":"A push is currently being made in the United Nations to have the Israeli Defense Forces added to the blacklist of the council for Children and Armed Conflict."},{"comment_id":"10152833310366051","commenter_b":"She prostituted herself out for the Republican party without thinking of the fall out from orally satisfying the president. He never did anything with her. He allowed her to get on her knees and prostrate and prostitute herself. She and the ugly woman with her ruined their own lives, not his.","commenter_a":"Good job Mr. Shanks. The worst part is that he carelessly wrecked the life of a young vibrant Monica Lewinsky. What a man! What a man! Jerk!","post_message":"The man who created Bill Clinton’s official portrait hid something in plain sight – and the Clintons aren’t happy about it."},{"comment_id":"949766655064193","commenter_b":"What I don't understand about the anti-vaxers is the sheer number of people who have received vaccinations and they cite a couple of examples. I could probably list more damage caused by Legos to children than vaccinations. It is sad and scary that these people are convinced of some global wide conspiracy endorsed by world governments to pump out children full of poisons so big pharmaceutical companies can turn a profit. Do they actually listen to how ridiculous they sound? Canada officially listed the measles as eradicated from our country several years ago, now thanks to people refusing to vaccinate their children, there were 500 reported cases last year. Any other eradicated diseases you anti-vaxers want to see make a come back?","commenter_a":"Ugh, here come the anti-vaxxers with their pseudoscience and limitless idiocy. By not vaccinating, you are killing or at least potentially endangering children. End of. ** I feel that I should add to this, that I'm referring to parents of children who are perfectly capable of being vaccinated but who aren't; I get that there are issues with some childhood diseases and allergies and such.","post_message":"Maybe this'll end it. #vaccineswork"}]
