[{"comment_id":"1170528036314405","commenter_b":"She knows she can't do it. She has to bring her husband in to do it for her. I guess we are not ready for a woman President.","commenter_a":"Hillary says she will appoint Bill to run the economy. We've seen the Clintons in action together before in the Whiter House. We call that getting two crooks for the price of one.","post_message":"The Clinton Foundation's business relationship with 20 foreign governments raises real questions about her judgment. Simply put, Crooked Hillary is in no position to be President of the United States of America."},{"comment_id":"10152997127479330","commenter_b":"Oh my now there going to ban scissors.","commenter_a":"Oh my god scissors are bad the scissors just killed someone ban the scissors","post_message":"A horrifying story out of California… Police say a 15-year-old boy was stabbed to death with a pair of scissors right outside a middle school in LA. Now authorities are trying to figure out what led up to the deadly attack ---> @webpagelink"},{"comment_id":"1429289687105057","commenter_b":"I'm going to beat your ass why you do that to me sis lmao","commenter_a":"Omg sis imagine this! VVanesha Williams","post_message":"This is the incredible moment a mother gives birth to her baby son - in a groundbreaking delivery procedure."},{"comment_id":"10155879788485354","commenter_b":"Send them all back. Stop immigration period. Let's get a handle on it before starting it back up. We need to police our new immigrants better.","commenter_a":"FOOK AMNESTY","post_message":"Some truly shocking statistics in this article..."},{"comment_id":"10154400564286509","commenter_b":"Delusional much?","commenter_a":"10 dead so far in republicans terrorist attack on Flint. Where is the justice. The serial killer Governor needs to be put away...","post_message":"\"Our mouths were ajar\": Meet Dr. Mona Hanna-Attisha, the pediatrician who exposed lead poisoning in Flint, Michigan."},{"comment_id":"10153483472878188","commenter_b":"How can he even be called a woman when he still has his man parts?","commenter_a":"I cannot phantom bestowing the Arthur Ashe Award to this person that has done nothing to deserve it. nOTHING","post_message":""},{"comment_id":"10154589059624087","commenter_b":"If you look real hard you may find your own identity or Soros'","commenter_a":"Questions: How many states do we have? What was actually written on that red, plastic button your mommy brought to Russia to reset our relationship? Did the crippled man Biden ask to stand up ever...stand up? What exactly is a CORPSEman? Hmmmmm....perhaps you should stfu?","post_message":"\"What happened in Sweden Friday night? Did they catch the Bowling Green Massacre perpetrators?” Chelsea Clinton tweeted."}]
