[{"comment_id":"1854247478194959","commenter_b":"Why you do this to me","commenter_a":"@username try not to cry","post_message":"Walnut the whippet was not alone on his final walk 🐶😢 #walkwithwalnut (via BBC England)"},{"comment_id":"1061814317192373","commenter_b":"Also...let's not forget...Obama is to blame for your mama giving birth to a shit head like you....you should have been aborted","commenter_a":"Another Jack A**** heard from","post_message":"Frequent Fox News guest Jesse Lee Peterson says that Obama is to blame for the South Carolina mass shooting at a black church because he insists on pointing out that racism is a problem in America."},{"comment_id":"10153443636529087","commenter_b":"She is another racist B*t*&","commenter_a":"Influential? I think her 15 minutes were up some time ago.","post_message":"Influential conservative commentator Ann Coulter called claims that Ted Cruz was a natural born US citizen \"absolutely false,\" joining Donald Trump in questioning whether Cruz can legally run for president."},{"comment_id":"2053445024754213","commenter_b":"Just the opposite he carry a 3.95 GPA and has all he life. he Just married that MUSLIM pile of pig shit and was told by Obama you need to rebel.","commenter_a":"He probably doesn't know how to read or write.","post_message":""},{"comment_id":"10154189751584062","commenter_b":"Whiney tail! That's what my mother would have called him. Shame!","commenter_a":"He sounds like he needs a pacifier and a security blanket. ..","post_message":"Garnet Coleman is defending his claims that he felt mistreated during this traffic stop last month, despite what the video shows. Some law enforcement groups are demanding an apology - hear what he has to say about that tonight at 10. You can see video of the entire stop here: @webpagelink"},{"comment_id":"1753789991533439","commenter_b":"Well one less lesbian in the country .","commenter_a":"Stop getting our hopes up and just get the FUQ out! Useless waste of oxygen","post_message":"Rosie O'Donnell To Leave The Country For This Awesome Reason.  Good riddance. We don't want her anyway.  Would you be happy to see her go?"},{"comment_id":"975510729232372","commenter_b":"Those animals have to be destroyed and kept out of America","commenter_a":"TIME TO GET RIGHT","post_message":"What radical muslims are allowed to do to their own families is absolutely horrifying. We cannot let this ever happen in America no matter how hard these radicals try to impose their ideologies on our great nation.   SHARE if you agree that this disgusting practice needs to be wiped off the face of the earth!"}]
