[{"comment_id":"1076528565795194","commenter_b":"Let's see ... when he said, 'yes she broke the law, but we don't think it rises to the level of prosecution... ' everyone was happy. Now something changed that ... something explosive enough to convince someone who supported and did everything to protect Hillary ... that 'something' is enough for me to say I CAN'T TRUST HER! WHERE THERE'S SMOKE... THERE'S A FLIPIN' INFERNO!","commenter_a":"www.mostdamagingwikileaks.com","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1790704097809032","commenter_b":"Pssst when's the last time the KKK has assassinated a cop in the streets? When's the last time the KKK burned down and looted their own towns? Who do you think BLM are voting for? Btw, do a Google search of who created the KKK. Democrats. Who freed the slaves? Republicans. Who passed a law allowing blacks to vote? Republicans. Who's the only candidate that voted against Civil rights? Hillary when she was a Goldwater.","commenter_a":"Yes. Except it is his supporters who are the real embarrassment. Buying into the lies of this conman. Feeling empowered, the violent white national (KKK) movement is showing itself in daylight. Embarrassment is not a powerful enough word.","post_message":"Yep.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"962385683823549","commenter_b":"Why in the hell did he stand there and listen to that s*** slam the door in that w**** face after about three words out of her mouth","commenter_a":"Racist","post_message":"HATE YOU WHITE MOTHER F-CKERS': Thug Chick Goes Nuts On White Neighbor (VIDEO)  @webpagelink"},{"comment_id":"10154003941470950","commenter_b":"Elizabeth Lilly what a ignorant women you are","commenter_a":"His first 100 days will be tremendous. So tremendous and full of catering to Russia. Bigly. He will keep us in suspense as he plans to steal back the money he spent for the campaign. So many plans. Big plans. And we're gonna pay for it. Bigly.","post_message":"Trump is about to speak to a crowd about what his first 100 days in office will look like: @webpagelink"},{"comment_id":"10154720750937235","commenter_b":"Michael M you r an ass hole !!! No one cares what you think !! You r ugly and evil with no soul just like Hillary !!! You and Meghan r made for each other !!! You r a disturbed individual !! Making fun of hard working people struggling because of Obamas policies !!!. We all should boycott. All your crap . I will . Those hard working people paid to see your movies ! Thats how u got rich !! Thanks to the deplorable's. You 😤😤ASSHOLE !!","commenter_a":"Michael Moore will do anything for media attention and money.","post_message":"You've no doubt seen folks in your Facebook feed who believe Michael Moore is making the case for Trump.   That is a LIE."},{"comment_id":"1112791138738235","commenter_b":"1 stupid bitch","commenter_a":"Unfortunately she is right more often than not.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153158036376756","commenter_b":"Haha or they're super annoying beats made on a computer by another artist.. Then they take that same beat again change a few things and bam another two chains song!","commenter_a":"Modern day hip hop is way worse! All the beats are the same n the lyrics are garbage!","post_message":"Maybe you've noticed that many hit country songs sound the same. Now you have proof."}]
