[{"comment_id":"10154686033581336","commenter_b":"Yeah...nothing says 'witch hunt' like having your underlings whack up 13 mobile devices with a hammer...then giving those underlings immunity...then they all plead the 5th except for one who doesn't show up under subpoena.","commenter_a":"Trumps lewd comments must be getting old or too obvious, I woke up today hearing how No presidential candidate has ever threaten to put their opponent in jail, That is because the previous 44 elections there wasn't a candidate with a 30 year crime sheet. God I hate our media.","post_message":"WATCH: \"Mini-Trump\" joins Donald J. Trump on stage at a rally. @webpagelink"},{"comment_id":"10153065488357217","commenter_b":"Because you are another dependent brain-washed puppet and the worst part of you think you're on the right side! Praying for you!","commenter_a":"Well done Kentucky clerk! And you masonBBC don't try to make real Christians look like some bunch of homophobes! Shame on you @username! You should apologies!","post_message":"UPDATE: AP reports Kim Davis, the Kentucky clerk who won't issue marriage licences, and all her deputy clerks have been called to appear at a federal court hearing on Thursday morning.   County Clerk Kim Davis eventually came out of her office, but she said she would not issue any marriage licences.  \"Under whose authority?\" she was asked. \"Under God's authority,\" she said."},{"comment_id":"10153935292307434","commenter_b":"Shay shut the fuck up","commenter_a":"\"Transgendered\" sooooo 2013. BOOOORRRING No one cares. We get it, you're edgy. Zzzzzzzzz","post_message":"\"Trans women are not only sex objects or prostitutes,\" said Amiyah Scott, explaining her departure from the show."},{"comment_id":"953451111362414","commenter_b":"Feminists are annoying","commenter_a":"I think there all cunts so I suppose I am humanist ha...","post_message":"Tonight, Ed Sheeran performed a song about his love life. Feminist Taylor Swift wants to know why no one called him sexist. #Grammys"},{"comment_id":"10153540694723984","commenter_b":"It won't affect her she is like a cork she just keeps popping up! I am afraid women who are not paying attention will vote just because she will be the first women president! I hope we have enough smart women that understands our country is going down the tube. Also we have very little protection from the terrorist! We are like sitting ducks on a pond!","commenter_a":"There is an obvious method to keeping Hillary out of the White House. All we need is an alternative candidate. That's how Obama got elected... no strong alternative.","post_message":"Hillary has dug herself a hole so deep, it doesn't look like there's ANY way she's going to be able to crawl out...  Are you hoping Hillary Clinton's scandals sink her?"},{"comment_id":"10154290485811545","commenter_b":"Building a physical wall between MX is imsidious but ee must create a climate of understanding with the that they are responsible for these people comimg over illegal. We need to have serious talks with Mexico and make clear that vast fines will be waged against them if this invasion continues.","commenter_a":"He's lying like his president about everything","post_message":"Our Facebook stream has ended, but you can keep watching here: wfaa.com/livevideo  WATCH LIVE: Confirmation hearing for Alabama Senator Jeff Sessions, President-Elect Donald Trump’s pick for attorney general.  MORE: @webpagelink"},{"comment_id":"861748160544348","commenter_b":"No, she was a goddamned moron that left it unattended. With a toddler. Gene pool cleaned.","commenter_a":"Those women's groups are worthless. If they had any kind of gonads they'd realize that disarmed women are victims.","post_message":"BREAKING: Michigan Governor Vetoes \"Shall Issue\" Gun Bill After Criticism From Women's Groups"}]
