[{"comment_id":"10153224417118984","commenter_b":"Both sides of her mouth - she's guilty and she knows it","commenter_a":"YES; An Orange Pant Suit would do just fine!!","post_message":"The irony is unbelievable. I don't think I could have said it any better than Hillary did in this 38-second video... Should Hillary be punished for her email scandal?"},{"comment_id":"1687479528205826","commenter_b":"You can come to America if you do it legally if you want to go over the wall if there was a wall yes shoot to kill. That will be a deterrent to stop other illegals from trying to do it.","commenter_a":"Yes and shoot to kill anyone crossing from Mexico to the USA","post_message":"Yes, I do!"},{"comment_id":"1039200399433046","commenter_b":"What were her parents thinking? I never left either of my children unattended in a car. That could have killed their most precious thing in the world. It is crazy to leave your child unattended in a car at such a tender age. I applaud the rescuers.","commenter_a":"Stupid people shouldn't breed.","post_message":"HOT CAR TODDLER RESCUE>> From Michelle Millman: This just breaks my heart for this little girl trapped in a hot car. A woman broke a car's window in Kansas after seeing a toddler trapped inside. Police say a couple left the girl while they shopped! Sadly, the woman says the parents seemed to care only about the damaged car."},{"comment_id":"1049253181797877","commenter_b":"So HRC YOU WILL NEVER WIN CALIFORNIA @webpagelink","commenter_a":"Hillary,we want you back at the White House!!","post_message":""},{"comment_id":"10153509134104205","commenter_b":"Fuckdonaldbitchasstrump!!! @webpagelink","commenter_a":"Excellent point! That's why I think Unions came out for her, well some Unions! If they didn't and she wins, they aren't represented! If they back her and Bernie wins, he'd still be for them!!","post_message":"Hillary Clinton keeps a list of her political friends and enemies. She does this so her staff can quickly decide who to reward and who to punish when favors are asked. Basically it’s for streamlining corruption."},{"comment_id":"605420972951190","commenter_b":"The god \"them\" illegals.","commenter_a":"No guys. its not the trillions of dollars we spent on Nukes, its the god them illegals taking our tax money. #MakeAmericaGreatAgain","post_message":"The B61-12 gravity bomb is smaller and more accurate than the nuclear weapons we have now, and that has some experts very worried. Watch VICE on HBO tonight at 11PM to learn more about the next nuclear arms race."},{"comment_id":"905233582940760","commenter_b":"So they can rape your children","commenter_a":"No way","post_message":"Obama Admin Proposes Plan for Americans to \"Adopt\" and \"Sponsor\" Muslim Immigration into the US @webpagelink"}]
