[{"comment_id":"10153928566951943","commenter_b":"she's a LYING PIG!!!!","commenter_a":"Bull!!!! They should all have to answer all questions. STOP the cover-up's, the crap, just get the truth out. Put this Liar, Thief, Murderer, traitor in prison where she belongs, and ALL that knew about her doings and didn't do anything to prevent it, or knew of it afterwards, and buried their heads in the sand. ENOUGH IS ENOUGH !!!","post_message":"Senior Hillary Clinton aide Cheryl Mills and her lawyer walked out of a recent interview with the FBI about Clinton's private email system after an investigator asked a question Mills believed to be off limits, according to a published report. - via Fox News"},{"comment_id":"10153957663196509","commenter_b":"i would run away too if rosie was my embarassing mother, RUN GIRL RUN......","commenter_a":"Gay parents would make any child go crazy!!!","post_message":"The 17-year-old had stopped taking medication for an undisclosed mental illness, Rosie O'Donnell said in a statement. @webpagelink"},{"comment_id":"1305722922778581","commenter_b":"Sean Connolly","commenter_a":"Logan Laybolt","post_message":"Tian Tian the panda enjoyed the snow this morning! Video via the Smithsonian’s National Zoo and Conservation Biology Institute"},{"comment_id":"10154913988378701","commenter_b":"I would ban that woman from the store.","commenter_a":"What a fucken cunt!!!","post_message":"\"One of their female employees Jessie? Jennifer? J something is disgustingly obese, and each time we come in, although she does her job and is very polite, instantly makes my appetite disappear,\" the customer's Yelp review read in part."},{"comment_id":"1586029795023236","commenter_b":"all you women who just need to color those grey hairs with Bleach blonde. So Vain.","commenter_a":"Richard Dryfus.....dude...you just lost the majority of your fan base. You must be a Criminal follower!","post_message":"He called Trump small dicked prick a unqualified racist who had for celebrity supporters."},{"comment_id":"10153517171806336","commenter_b":"Shut up you stupid woman!","commenter_a":"They were only 160 ft. Away and actually they checked on the children throughout the night. It is said the mother visits the place where the child went missing to walk the streets hoping to find her. The parents are devastated over the loss. Just because you or I would not leave our children like this doesn't mean we should be so critical or unkind. They made a terrible mistake ( in this case perhaps a deadly one). We should show kindness and pray for them. I mean after all what if it were you/me. No one is beyond making mistakes. They are tortured enough. Walk a mile in their shoes.","post_message":"Based on an examination of the bones, Australian police determined the child was killed \"some time since the start of 2007\" – the same year Madeleine McCann disappeared."},{"comment_id":"10153135004736756","commenter_b":"Henry Gallo- happy belated birthday! You have a lot of styling still to do!","commenter_a":"Great story Joe! Thanks for sharing.","post_message":"Zoe Spawton used to waitress at a café in Berlin where she would see Ali Akdeniz walk by every morning. He caught her eye because of his put-together, plucky apparel. She was so taken by his du jour ensembles she asked to take his picture. It became a daily ritual and the photos form the blog What Ali Wore."}]
