[{"comment_id":"10154075360053797","commenter_b":"You know her personal","commenter_a":"Wow look at all these people who would vote for a liar to run this country. What an uneducated bunch.go clear back to Watergate with hillary she is a liar.","post_message":"WOW! Rest in Peace Elaine. She was a registered Democrat and not 'a political person.' However, her obituary says: 'Elaine requests, in lieu of flowers, please do not vote for Hillary Clinton.' Her reason is getting a lot of attention. See here:"},{"comment_id":"10153860204493598","commenter_b":"She probably has no problem selling those little body parts.I wonder how those people will answer God when they stand before Him!","commenter_a":"More like satan","post_message":"Wendy Davis is Dedicated to Promoting Abortions With God’s Help: “By God, We Get Back Up”"},{"comment_id":"10153097755761323","commenter_b":"'Oh, climate change beat ISIL.'","commenter_a":"I wish I never clicked on the comments.","post_message":"'Using the weather as a weapon to subjugate the globe sounds like the modus operandi of a James Bond villain'"},{"comment_id":"1303809496299333","commenter_b":"Let us pray all that hard work won't be wasted. Hillary for prison 2016!","commenter_a":"It's going to take a lot of lawyers to keep her out of jail...finally some shovel ready jobs!","post_message":"This investigation shows no signs of slowing down."},{"comment_id":"1126887640660229","commenter_b":"If she's black, the barry is white !","commenter_a":"You will always be that lovable little fuzz ball, however you identify yourself!","post_message":"You know, I think I'm going to 'identify' as skinny.  That way I will not have to ever go on a diet. I'm just gonna identify as skinny.  I just am.  You think I'm not?  Screw you!"},{"comment_id":"10154246184914609","commenter_b":"BUILD THE WALL","commenter_a":"Good because if you bothered watching the full video, you would see those guys attacking trump supporters and taking their signs. Those thugs (not protestors) got what they deserved.","post_message":"About that photo widely circulated across social media: “It started burning – burning really, really bad. I couldn’t open my eyes for probably 40 minutes,” the man hit says. @webpagelink"},{"comment_id":"633829223459429","commenter_b":"Stupid stupid girl , the more she talks the dumber she is .","commenter_a":"Do they have no parents","post_message":"From American AF - AAF Nation...This is what's wrong with society TODAY!!"}]
