[{"comment_id":"10153322219778188","commenter_b":"@username......... you're making me hungry!!!!!!","commenter_a":"Should they be wearing ball caps and tennis shorts? You equip with the best available to protect yourself.","post_message":"Local police are now often seen equipped with the same gear and weapons you would see in a war zone. How did this happen? @webpagelink"},{"comment_id":"10153003088197377","commenter_b":"It will be a huge shake up.","commenter_a":"Now they talking I guess they are coming out of there dream closets, they better rally around him and make this country great again.#Trump/Cruz.","post_message":"Newt Gingrich says Donald Trump is capable of winning not only the Republican presidential nomination."},{"comment_id":"1270891722952389","commenter_b":"@username says the woman whose profile pic says \" Make America Kind Again\"","commenter_a":"You know being born in this country is a requirement to be president.. There is no requirement to provide tax returns just in case you were wondering. If the dems win and Hillary is president you liberals better be ready to open your homes to refugees because they will be stuffing them into this country and fast as they can. The dems only care about one thing.. Power.. Staying in power and keeping others from having any including the citizens which is who should have the power. Take a look at what's happening in Europe right now it's not long before its happening here.. But the media won't report it because the dems will try to keep it from you. That's right the media is biased.. All media one way or the other.. So drink your flavor of koolaid and get ready because the liberals in this country are coming ...","post_message":"Great question, Mr. President. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"943252975710162","commenter_b":"I feel like singing. We say grace we say ma'am if ya ain't in to that we don't give a dam. Were from north california and south alabam and little towns all. Around this land. But on a serious note. Being politically correct has made our country weak. Made our children bad and taught them mom and dad will save me no matter what. And yes I do support trump. I'm against illegal immigration and gun control.","commenter_a":"If she would have been taught respect for authority at home this wouldn't have happened true thug trash.","post_message":"Some reasons why Officer Ben Fields should be fired immediately."},{"comment_id":"567332390082204","commenter_b":"The dumbest woman in America alive .","commenter_a":"What a goofy broad.","post_message":"What are they going to call it, Mount Dumb-Dumb? -Conover"},{"comment_id":"10153836803272623","commenter_b":"Good players But it's another\"L\"","commenter_a":"Ga...NO ....Riverboat must have sank and Cam Ain't ..... stupid Panther Fans","post_message":"The New Orleans Saints beat the Carolina Panthers in a 41-38 victory Sunday in New Orleans."},{"comment_id":"10153845314569024","commenter_b":"This is a wake up call. Ban these type of stores underneath the rail. Build a wall around it.","commenter_a":"Cuomo & DeBlasio told their agents to not answer questions??","post_message":"Do you think the city ought to be doing more to keep overhead rail infrastructure secure?"}]
