[{"comment_id":"10153236028424087","commenter_b":"Oh @username, beautiful, sexy, intelligent. You're a dream girl, woman.","commenter_a":"Exactly! Time to move on. Love wins errrr maybe","post_message":"“We've got to keep striving every day to treat each other the way I believe God sees us, as equal in His eyes,” Barack Obama said."},{"comment_id":"10154427050921037","commenter_b":"Illegals do jobs that the 'Americans' won't do!!! Besides I have never seen any white person working in the field picking your precious organic fruit and vegetables","commenter_a":"no not working and supporting their families in the states and the ones back home. here I thought they just come over and sit around doing nothing but taking naps and drinking beer. lmao this is a joke.","post_message":"The ~11 million unauthorized immigrants in America are not “taking” jobs from US citizens, either."},{"comment_id":"10153645733937217","commenter_b":"'@username dude your wife looks like a yeast infection","commenter_a":"Oh god. Hillary can potentially become the next president, yet Nixon was almost impeached for missing tapes and she has thousands of missing emails. Wow people are incredibly stupid these days!","post_message":"'Next January, I want to be sure that it is Hillary Clinton who takes the oath of office, not Donald J. Trump' writes California Governor Jerry Brown."},{"comment_id":"10154940269859614","commenter_b":"Sorry @username but there is no place for white gangs here in California . Many Latino gangs are backed by dangerous cartels. White racist trailer trash should lay low or move to another state and spread their hate. If they try to Lynch a Mexican or African American, they will get decapitated.","commenter_a":"I know I may sound vulgar for saying this but they better not pick fights with the wrong people here they will get shot at lol","post_message":"A white supremacist gang known as the SFV Peckerwoods, which authorities say has operated at three homes close to schools and a library, is the target of L.A. city prosecutors and LAPD.  'We're now fighting to prevent white supremacist gangs from infesting neighborhoods. They bring with them  this toxic mix of violence and crime and hate,' the L.A. city attorney said."},{"comment_id":"1746288005610861","commenter_b":"Women do not get kicked out of restaurants because their children cry. What world do you live in ?","commenter_a":"Whatever. If that kid was crying in the middle of some restaurant & the owner told the mother to leave for the sake of the rest of the patrons he'd be applauded. Taking a baby to a political rally is as foolish as taking a baby to a Slayer concert. The exception being Slayer fans are far more courteous than the average politcal junky.","post_message":"'I think she really believed me that I love having a baby crying while I'm speaking. People don't understand.'"},{"comment_id":"10154534701938271","commenter_b":"Those seven countries on which the president issued the TEMPORARY ban weren’t picked out by him. They were picked in 2015 and 2016… by the Obama administration. Trump doesn’t even list those nations specifically in his executive order, he simply lists that he’s banning those nations named in the Terrorist Travel Prevention Act of 2015. ---> @webpagelink Trump’s TEMPORARY order specifically states that only refugees from 7 countries with ISIS controlled regions. (Syria, Iraq, Iran, Libya, Somalia, Sudan, and Yemen) ONLY AFFECT 12% OF THE WORLD’S MUSLIM POPULATION","commenter_a":"President Obama issued an order similar to President Trump’s in 2011 in response to a discovery that a known terrorist had entered the United States via the nation’s refugee program. It seems that much of the country’s forgotten about that, though even President Obama, himself, apparently.","post_message":"Obama's statement said he is 'heartened' by citizens' civic engagement, but reiterated that policies should not discriminate against people based on religion."},{"comment_id":"10153001581342377","commenter_b":"right CMc and send their illegal babies with them If they weren't made in America they are not American stop giving them birth certificates you just encourage illegals to come here Is this hard to understand??","commenter_a":"It's the law. They are here illegally and, according to the law, they must be deported. Trump didn't make the law. All he's saying is that he would enforce it. The government has no problem enforcing other laws that people disagree with; why should this be any different?","post_message":"Trump's Proposed Deportation Effort..."}]
