[{"comment_id":"550313591806506","commenter_b":"@username stop trying. Your Hillary will not succeed and if she does she will be taken to jail right after.","commenter_a":"NY press trying to destroy Sanders before the primary? Shocker.. Does anyone really trust any of the media outlets these days? I haven't for almost 10 years..","post_message":"This Bernie Sanders interview did not go as planned..."},{"comment_id":"10154242244603635","commenter_b":"\"I agree you can still do all those things.\" So then you were making things up before. Glad we got that straightened out. \"I've known of kids getting suspend from school for praying before they ate lunch\" If that actually happened, the school involved broke the law. \"Employees were not allowed to say Merry Christmas it was happy holidays. She told me that.\" Right, because saying \"happy holidays\" is more inclusive. Of course, while not on the job, she was completely allowed to say \"Merry Christmas\" to her heart's content. \"There has been a huge change in this country for the last 25 years of Christianity being slowly phased out by our government.\" Not really. Christianity has never been part of our government, since it's not supposed to be. The first amendment makes that clear.","commenter_a":"I guess this is another step on kicking God out of this country.","post_message":"Indiana city renames Good Friday \"Spring Holiday\" to be more inclusive"},{"comment_id":"557086307813348","commenter_b":"AHHAH u need a matching one","commenter_a":"@username one for mal","post_message":"That pose though"},{"comment_id":"992191140821358","commenter_b":"Why? I think she is best in the senate. I also think an all female ticket is unrealistic.","commenter_a":"Clinton/O'Malley would be a good ticket.","post_message":"Hillary Clinton absolutely crushed every single Republican candidate in a recent CNN/ORC poll."},{"comment_id":"1397503370290352","commenter_b":"Shellie","commenter_a":"Hahahaha fool","post_message":"Absolutely Hilarious... Spread this everywhere!"},{"comment_id":"902389386549543","commenter_b":"She is a fkn disgrace! #hilliaryforprison","commenter_a":"To all of you considering a third party vote or staying at home, facts show what that did in 2000. It gave us GEORGE BUSH. Remember Florida? Bush-2,912,790; Gore-2,912,253; Nader-97,488; Buchanan/Foster-17,484. Do the math. Please tell me, what good did that do? Are we way ahead of where we were 16 years ago? You know what Bush did. He appointed John Roberts and Clarence Thomas to the Supreme Court, gave us Iraq, Isisl and the Middle East, tax breaks for millionaires, FEMA during Katrina, the Great recession and the road to Trump. Read what \"Art of the Deal\" writer Tony Schwartz has to say about Trump and realize that it's better to have Hillary in charge while you use your outrage to build a party around progressives like Elizabeth Warren and Jeff Merkley. The unfortunate truth is, if you don't vote for Clinton/Kaine this year, we'll have Trump/Pence next year. ...","post_message":"\"Let’s go make history and elect Hillary Clinton the 45th president of the United States!\" —Tim Kaine"},{"comment_id":"923411781030392","commenter_b":"You can see intelligence in many statements and never know the color of the person saying it. If you are suprised when you find out, you need to examine what you find in yourself. Common sense ignores color.","commenter_a":"Why when I read this do I keep seeing the statement \"Black mother\" or \"Black woman\" this is the problem with racism in our country. Let's stop using the color of our skins in small comments like these. I feel like this 1 small step would be a huge step in a direction and future with less focus on skin color and more on humanity.","post_message":"Do you agree with Mom?"}]
