[{"comment_id":"1477131165645723","commenter_b":"She is a phony douche like her old man.","commenter_a":"Lying runs in the family!!!!","post_message":"Of course it is..."},{"comment_id":"10153214035528433","commenter_b":"Russ, that is exactly what legalizing same sex marriage will do. No church will be forced to perform a same sex marraige, but some already do. Heterosexuals are considered married if they have a civil ceremony, so why do we need some 'different' classification just for same sex couples??? That is called 'seperate but equal' and was ruled on by the Supreme Court in the 60s. Seperate is NOT equal.","commenter_a":"Why is civil union treated exactly like marriage between a man and woman not good enough for the homosexual activists??? IMO these radical activists just want to stick it to those with strong religious beliefs.","post_message":"Today, the Supreme Court hears oral arguments about same-sex marriage. Here's some fact-checks on the issue. bit.ly/1GyIiZb"},{"comment_id":"1673100576267383","commenter_b":"Happy Birthday Goldie, what a delight you have been over the years!","commenter_a":"Yep, gotta love our girrrrrl....","post_message":"Happy birthday, Goldie Hawn!"},{"comment_id":"10154194496471336","commenter_b":"I don't know about you, but I can read and retain two stories at a time!","commenter_a":"Amazing how this makes news in Canada while 4 people including 2 Canadians are being held hostage by ISIS in the Philippines!","post_message":"VIDEO: Things heated up quickly at the New York International Auto Show when a Porsche 911 Turbo caught on fire. @webpagelink"},{"comment_id":"1485178544875222","commenter_b":"Of course we had an impact in the region through corruption but Saudi armed Sunni rebels in Syria to overthrow Assad which formed ISIS, the US is supporting groups against Assad so that Saudi can build a pipeline to Europe and destroy Russia's main source of income","commenter_a":"It does make sense though, when you think about it. Would you just accept thousands of people without carrying out appropriate checks (ie checking if they have criminal record, etc)? You wouldn't. Seeing what has happened in Europe in the last year or so is all the more reason for countries to tighten their borders. Also, people have been spreading this meme for ages so it's nothing new.","post_message":"So crass"},{"comment_id":"1029959687044503","commenter_b":"But we DONT need Hillary Clinton.","commenter_a":"If republicans don't come around on immigration they are through.","post_message":"Hillary Clinton's aggressive and boldly progressive stance on immigration just wiped the floor with Republicans and their obstruction and xenophobia. This is..."},{"comment_id":"610661985768228","commenter_b":"white kids of lower middle class know what it is like to be in those areas of transformation and watch their towns become unsafe ghetto's. These immigrants always come forcefully in the streets to establish turf and whites have dealt with it from every race that comes in. don't know ghetto's eh, some of us know and were forged in them. what an ill guided statement to make","commenter_a":"Love the positive comments here, and even if theres negative comments bernie will always have a great comeback as he did in the debate last night. This man deserves the title of president. So much can come from this stop thinking about it & vote for him","post_message":"I am very proud of being Jewish, and that is an essential part of who I am as a human being. My father’s family was wiped out by Hitler in the Holocaust. I know about what crazy and radical, and extremist politics mean. I learned that lesson as a tiny, tiny child when my mother would take me shopping, and we would see people working in stores who had numbers on their arms because they were in Hitler’s concentration camp."}]
