[{"comment_id":"610453139087868","commenter_b":"Fuck that arrogant asshole","commenter_a":"I hate this motherfucker.","post_message":"You piece of garbage."},{"comment_id":"10153204485844087","commenter_b":"Lucky!!! I wish I could have gone.. And TO ALL LIBERALS. I'll end with this.. Yall say if you're not natives to shut up about immigration. Tell you what, when the Mexicans conquer the land like the Europeans, they can have it. When they conquer and claim. Good luck.","commenter_a":"What a fun rally. Sold out and packed American Airlines center. It was beautiful. So beautiful, in fact, they may rename it the Trump center.","post_message":"\"I'm not going anywhere and we're not going anywhere,\" Donald J. Trump told a packed American Airlines Center in Dallas, where an estimated 20,000 rallied. \"We are killing it. They mentioned a little while ago about the silent majority — it's back. And it's not silent. Maybe we should call it the noisy, aggressive, wanting-to-win majority.\""},{"comment_id":"10152961247876680","commenter_b":"That's you and your crowd... Dead and cut up babies sold for the meat market !","commenter_a":"I proudly stand with Planned Parenthood.","post_message":"The move dramatically increases the chances of a government shutdown fight in the fall."},{"comment_id":"1043060679149891","commenter_b":"The hell with Muslims! If you don't like our national anthem, you are free to leave.","commenter_a":"Immigration without assimilation is invasion. Get out!","post_message":"Claiming they are being oppressed..."},{"comment_id":"10153604901701167","commenter_b":"Either way she doesn't have a dick anymore.","commenter_a":"Right. Sexual predators never pretend to be transgender to gain access to women they wouldn't have as a man. Never! Umm....errr.... @webpagelink","post_message":"A man has never pretended to be transgender to sneak into a women's restroom. It's just not a problem that exists."},{"comment_id":"10155070762506037","commenter_b":"But the person doing the watching had intentions maybe","commenter_a":"Something sounds like she wondered off but someone had been watching her.","post_message":""},{"comment_id":"10154165765599091","commenter_b":"#DrainTheSwamp #PayToPlay #RiggedElections #VoteFraud #NastyHillary #MAGA #CrookedHillary #NeverHillary #HillaryForPrison2016 #LockHerUp #BuildTheWall #BringBackJobs #LatinosForTrump #NoMoreClintons #BenghaziButcher #DefeatSocialism #BanIslam #EmailGate #CorruptMedia #ObamacareFail @webpagelink","commenter_a":"Congratulations and God bless!!!","post_message":"CONGRATS! Five female firefighters have graduated from the New York City Fire Department (FDNY) academy -- the most women to join New York's Bravest since 1982!"}]
