[{"comment_id":"907462056016714","commenter_b":"Terry, but the illegals are taking away jobs from the blacks. WAKE UP. Joes trying to help you.","commenter_a":"GO JOE!! ..........someone needs to investigate these corrupt Liberal Judges","post_message":"And it gets worse ..."},{"comment_id":"616279121877054","commenter_b":"'@username not all people who are unemployed are 'deadbeats'.","commenter_a":"Get ready, republicans. You will find yourself with no health coverage. Keep praying to your god that you don't get sick.😂😂😂 I will personally take pleasure in watching you suffer.","post_message":"#BREAKING: Majority Leader Mitch McConnell signaled the Senate would move swiftly to repeal Obamacare now that the GOP Congress will have a Republican president."},{"comment_id":"10154311715577293","commenter_b":"DUMP IS A BULLY BUT ONCE HE IS CHALLENGED, HE CAVES. REMEMBER HOW MEXICO WAS GOING TO PAY FOR THE WALL?","commenter_a":"I worry about it probably in a southern state. sTrump supporters have suspended all logic and common sense. I am sure that professionals in the mental health field can talk about group hysteria. sTrump is already stirring the pot in an effort to incite his supporters. They've already suspended logic so I expect that some will act. Look at sTrump rallies...","post_message":"Half of likely voters fear violence either on Election Day or after."},{"comment_id":"1239279662765353","commenter_b":"Judi you are correct about Obama, good for you.","commenter_a":"These little things they bring out about Ben Carson are all they can find. It's all they've got! They've got nothin'!","post_message":"#BenCarson should ask the media:  Where are Obama's grades and transcripts? And who checked out the lies in his autobiography?"},{"comment_id":"583593931828899","commenter_b":"We Can't Let This Happen ! Deport Them !","commenter_a":"Horrible","post_message":"Our Kids are in DANGER!"},{"comment_id":"10153950458738690","commenter_b":"Actually another problem is that we have a long border with Afghanistan which is called Durand Line and Afghanistan does not accept it as an International Border and those terrorists move in between both countries and attack and then we blame to each others.","commenter_a":"This the same Pakistan my country Nigeria, training army to fight terrorism, have Pakistan already solved there Taliban terrorist? Terrorist are political party, negotiations is the solution to terrorism.","post_message":"At least 12 dead as suicide bomber on a motorbike crashes into government office."},{"comment_id":"10156349547100354","commenter_b":"Conservatives learned the lessons of MLK. I think the left needs to review what he preached. It is not the color of the skin but the content of character.","commenter_a":"These people just say what they think and then if it bites them in the rearend they come back with some ridiculous other story which nobody believes but they seem to think that we will.","post_message":"FIRESTORM: MSNBC Liberal Claims She Wasn’t Calling Dr. Ben Carson Racial Epithet...'Safe Negro'...Backpedals Quickly...Dr. Carson Campaign Blasts...MORE..."}]
