[{"comment_id":"1215195555169015","commenter_b":"Angela Merkel sucks wake-up idiots please","commenter_a":"Actually, Donald Trump is the only candidate, with a proven business record, who can assess data, consult with people who need to be heard, and make decisions he can logically defend. Hillary's track record as a senator and Secretary of State are without merit! (Btw, I used to be a democrat but I refuse to vote - then or now - for the two most corrupt politicians of our era!)","post_message":"“She is the only candidate who can assess data, consult with people who need to be heard, and make decisions she can logically defend.” —WIRED on Hillary"},{"comment_id":"10153151151584330","commenter_b":"... what does this have to do with this news story?","commenter_a":"Mental illness on the rise. We need to open state mental institutions Nd not close them down. Poor people have no where to turn to and it can effect the innocent.","post_message":"BREAKING: A person died after being hit by a train in Fairfield. Train service in the area has been disrupted --> @webpagelink"},{"comment_id":"10153111433392483","commenter_b":"Awwww lets cater to the criminals AGAIN shoot the bastard and be done i cant stand a fucking pedophile sick sick sick","commenter_a":"Their gonna let this perve go","post_message":"A gag order was issued today in the case of an Alabama pastor accused of sexually torturing, abusing and raping multiple children and teens."},{"comment_id":"10154261314153525","commenter_b":"He had it made on Howard channels. Then double crossed hogan with the tapes etc. Dirt bag. How many times can he use the connection with tony Stewart. He is a Howard copy cat with less talent.","commenter_a":"Jimmy","post_message":"JUST IN: Bubba the Love Sponge is off the air in the Tampa market. MORE: @webpagelink"},{"comment_id":"10152698246092293","commenter_b":"Obama is SCARED His Funding of these TERRORISTS, will have to STOP!","commenter_a":"Obama was right not to go.","post_message":"\"We agree that we should have sent someone with a higher profile in addition to the ambassador to France.\""},{"comment_id":"10153860760766135","commenter_b":"You are so right.","commenter_a":"It was not a mistake, it is business as usual at Detroit Animal Control.","post_message":"\"As a result of a computer status error, a tragic and unacceptable euthanasia was authorized.\" -- Detroit Animal Control"},{"comment_id":"10156311774755354","commenter_b":"you bitch","commenter_a":"POS","post_message":"PARTY TIME!!!"}]
