[{"comment_id":"10155028895888010","commenter_b":"@username this isn't a Democracy. It's a Constitutional Republic. BIG difference.","commenter_a":"I think the LA Times is confused. There is a difference between an attack and a response to an attack. I'm not saying Trump never attacks people...I know he does. But several times now I've seen Trump's responses described as attacks (ie Meryl Streep).","post_message":"The president-elect was responding to criticism."},{"comment_id":"10152769527894877","commenter_b":"No. Ladies came up short they guys didn't end up in the board room. Lamas was dead weight though.","commenter_a":"I thought the female team won their challenge. Why did she get fired and not lamas?","post_message":"Keisha Knight Pulliam Fired From 'The Apprentice' For Not Calling Bill Cosby And Asking Him For Money. Watch it and read more here. Grio fam, was this at all fair? Sound off."},{"comment_id":"934315223319642","commenter_b":"Michelle Owen Nyki KiKi 😂😂😂😂","commenter_a":"AHAHAHAGA help","post_message":"Via The Everlasting GOP Stoppers"},{"comment_id":"10152987263776130","commenter_b":"@axelnieto and @hugoaguilar. I never said people in Latin American countries aren't happy. I also never said that there is absolute no wealth or opportunity. I agree with you that it's not easy (which is what I was trying to make a point of to begin with) but it is there.","commenter_a":"They don't make work, wealth, and success important because their country doesn't give them the opportunity for that. Duh huffington post.","post_message":"\"Instead of making work, success and wealth the most important things in life, Latin Americans typically have family and community firmly at the top of their priority list.\""},{"comment_id":"10153564191549270","commenter_b":"Chupacabra, pick up DOD Files hay accurate B 52 bombing during knock out gooks ... evaporated socialists and during First Iraq company","commenter_a":"When the last time bombardier B52 knock out targets accurately .... during .Vietnam... Flight over Chinese and just scare... scare Chinese...","post_message":"\"We conduct B-52 flights in international air space in that part of the world all the time.\""},{"comment_id":"631512343684752","commenter_b":"That last one is not a fact. It's a talking point. I am a white Christian and I hate his policies. Not him. I hate socialism. It's working do well in Venezuela. The dems are the ones throwing the race card around to get people's minds off the facts. For example, a few people have health care now that didn't before. But more people lost their health care than gained it. Obama care is forcing insurers nd doctord out of the market which cause a loss of coverage.","commenter_a":"Bahahaha...I would LOVE to see legitimate sources.","post_message":"Facts suck, huh?"},{"comment_id":"853027351431360","commenter_b":"Kill all the white people!","commenter_a":"They won't even look at them","post_message":"Boy are these guys gonna be in trouble when the Justice Department gets involved with this, amirite?"}]
