[{"comment_id":"10154180577936770","commenter_b":"no he isn't","commenter_a":"He is violating the constitution again. Smh.","post_message":"Liberals are accusing Donald Trump of implementing a \"Muslim ban\""},{"comment_id":"10154286409446800","commenter_b":"That's pussy shit. And we agreed on 2","commenter_a":"Jami Hugo Omar Oliver","post_message":"Tonight at 11/10c on The Daily Show: #NationalHandshakeDay, a Brexit update and most important, Jessica Williams’ final show."},{"comment_id":"1225000220856314","commenter_b":"You're so evil Hillary! @webpagelink","commenter_a":"We don't have a depleted military, you moron.","post_message":"\"We cannot have a depleted military.\" Donald J. Trump speaks to supporters about the military @webpagelink"},{"comment_id":"10154382279344497","commenter_b":"Aye. Fuck bitches, make money.","commenter_a":"Single man enjoying free milk, basking in savings after not buying cows.","post_message":"Via ClickHole:"},{"comment_id":"10152984814394641","commenter_b":"Ban Islam!","commenter_a":"if you Arrest Jihadist, you are hurting religious sentiments of Muslims. Beware!","post_message":"Five men arrested in France, accused of belonging to jihadist cell that was recruiting young people, authorities say."},{"comment_id":"1016269761823135","commenter_b":"Disgrace to this country she is a racist bitch of another type BAN this bitch from your cities stop buying her crap she calls music no talent bitch.. Yes I am pissed she is allowed to keep going.","commenter_a":"She has shown her true stripes and needs jail time to think about what she did knowing her idiot followers would try to please her.","post_message":"Beyonce has morphed from pop-star to Jesse Jackson in a D-Cup. Check this BS out. BTW, She foments more hate than any zany right-winger 'the media' makes up. @webpagelink"},{"comment_id":"471664429690804","commenter_b":"THERE IS NO PLACE IN AMERICA for SHARIAH LAW !!!, Not Now... NOT EVER.. IF those people want their own laws.. GO BACK where YOU came from... Never to Return !!!....Close our country to ALL Muslims, those who are here, send them packing back where they came from !!!","commenter_a":"OK Here we go again... we are going to let muslim religious practice in government owned facilities but not Christian or Jewish? No prayer or religious organizations (Christian Athletes Association, for example) allowed for anyone in public schools, but exceptions for muslims? They can have time for prayer and muslim student organizations in school, but we are not to have prayers at student events? Come on SCOTUS ... what the heck is going on? We now have separate rules for muslims? Unbelievable. If the muslim inmate can grow a beard then anyone should be able to do it. They are becoming a government sponsored and endorsed religion. They even provide prayer rugs and call to prayer at gitmo. The state shall establish no religion.","post_message":"The Supreme Court just made a shocking ruling on Shariah Law. We must voice ourselves publicly, Shariah Law has no place in America. Do you agree Shariah should be banned?"}]
