[{"comment_id":"10153306067889087","commenter_b":"I bet they're total bitches!","commenter_a":"Who are these people backing Hillary?! It seems like every Democrat supporter that I come across is supporting Bernie.","post_message":"Hillary Clinton holds a stunning 31 point lead over her closest Democratic presidential rival Bernie Sanders according to a new NBC News/Wall Street Journal poll."},{"comment_id":"711971608993417","commenter_b":"The Liberals and Democrats are complete idiots. They've spent their entire lives destroying society and blaming everyone but themselves for the evilness they've generated.","commenter_a":"He is not a man - is a she","post_message":"Like if you agree."},{"comment_id":"933475353412186","commenter_b":"Somebody needs to fuck her ass up","commenter_a":"Elisabeth Hasselbeck is a no talent bimbo. She is a racist a bigot and just an unpleasant pain is n the ... Neck! Her claim to fame is that she was on Survivor and clung to an older gentleman who did everything for her and protected her. How is she qualified to open her ignorant mouth about anything political??? Typical Fox bleached blonde snotty witch! Yuck! She was fired from The View because she was so nasty and bigoted.","post_message":"This is superbly offensive."},{"comment_id":"634863706677709","commenter_b":"Yes absolutely. ...you are on our soil...you NOW live by our laws...if you don't like that LEAVE....","commenter_a":"Yes she has to obey the law's of this land, or be deported","post_message":"Muslim Refuse To Remove Head Covering For Officers – Gets Brutal Wakeup Call. Should of listen to authority. Do you think everyone should have to obey they law, regardless of religion?"},{"comment_id":"10153619223127042","commenter_b":"My condolences to the family","commenter_a":"Kristopher Jadoo omg","post_message":"BREAKING: New details have emerged about an entire New Jersey family found dead at a burned home."},{"comment_id":"1825166017710828","commenter_b":"BUILD THE WALL!!! Go Trump","commenter_a":"Trump now has my vote. This lawlessness has to stop. There is nothing racist about wanting to enforce laws that apply to everyone. I do hope he can be talked out of the wall though. We need improved cooperation and relations with Mexico. Not a big wall dividing us. Both countries need to crack down on crime and make sure people moving between the two countries do it legally. Only way to have a civilized society is to enforce the laws. If laws are unfair, let's change them. But let's do it legally and civilly. Trump is not the racist monster that the liberal propaganda machine makes him out to be.","post_message":"\"Hundreds of cars were forced to make a U-turn less than three miles from a Donald Trump rally today after protesters parked in the highway to block Trump supporters from reaching the event.\""},{"comment_id":"10155165703940603","commenter_b":"Whites can't be thugs Danny","commenter_a":"Thug, Keep posting it even if your White or Black. For some reason White people think all Blacks feel as if every Black is innocent. I'm pretty sure Blacks feel as if all Whites think all Whites are innocent. That's not true and if having to state that we think this guy is thug helps then I'll summit to that. I don't think anyone really believes that condoning violence is OK if the person is the same color. People may be right or wrong but it's not necessary a race thing, I think they truly believe the person is innocent but are poorly informed.","post_message":"Robert Clark is wanted for murder and may be hiding in out Missouri. Clark’s accused of brutally killing a couple in Ohio and is also reportedly connected to a string of violent robberies. Please share and call 911 if you see or know anything."}]
