[{"comment_id":"10154009646005695","commenter_b":"Add this to the list of reasons why #ChikFilA is so awesome","commenter_a":"That's bc CFL is a Christian company....no PB sandwiches....love it, gives u hope nation has not completely brought into 'crap on everybody while I make my millions' type of company.","post_message":"AWESOME! Volunteers delivered free sandwiches to first responders and victims of the storms."},{"comment_id":"545668025630703","commenter_b":"Lock her up...","commenter_a":"Mrs @username President 2016 Women had no rights to vote. Just see how far women has come. Pervert Donald Trump discriminate women and abuse them sexually and when they dont give in. he trash talk them what sick beast he is. If this pervert wins you women becomes his slaves Vote for Freedom Mrs @username President 2016","post_message":"A note on Director Comey's letter, from Hillary for America Chair John Podesta. Chip in now to say you're standing with Hillary: hrc.io/donatenow  \"By now, you've probably heard some news about a bewildering letter sent to Congressional leaders by the Director of the FBI. This is all a bit confusing, and much of the reporting has been misleading or downright inaccurate, so I want to take a minute to walk through this.   Here's the quick backstory: In July, FBI Director Jim Comey concluded a year-long investigation by deciding not to go forward with any case about Hillary's emails. It wasn't even a close call, he said. In his words, 'no reasonable prosecutor' would have brought charges.  Yesterday, in a surprise to us all, Comey wrote a very strange letter to Congress that was long on innuendo and short on facts. He said that in a completely separate investigation, the FBI had found some emails that may or may not be related to Hillary, and indeed may or may not be significant at all.  It's being reported that Comey sent this letter over the objections of Department of Justice officials who told him that it was inconsistent with longstanding policy of both Democratic and Republican administrations not to take action that might impact an election. It's an unprecedented intrusion into a close presidential election with less than 11 days until Election Day.   Voters deserve answers.  Comey needs to come clean with the American people about what he found and answer all the questions about why he took this unprecedented step less than weeks before the election.  Here's what this changes for you and this campaign: Absolutely nothing.  The facts be damned—Trump's always shown a complete disregard for the truth. In spite of there being no new information, he's already raising money off the bizarre letter (he literally sent a text message asking for money within an hour of the story breaking!) and he's more fired up than ever on the trail today.  These are the actions of a desperate man. Trump knows he can't win on his character, temperament, or his policies. He's behind, so he'll cling to whatever he can. We can't let him get away with this.  Our organizers and volunteers on the ground are rallying behind Hillary in what will be the biggest volunteer weekend of the campaign so far. You need to have her back, too. You need to say you're not willing to let Trump bully or buy his way into the presidency, and you're not going to let anything stop us from making history.  There are ten days to go. Let's buckle down, stay focused, and win this. Chip in here: hrc.io/donatenow\""},{"comment_id":"929346133862318","commenter_b":"If a bank (any bank or business) is going broke, such as Lehman Bros., how is it up to We the Tax payers to bail it out? A business either prospers of fails on its own merits, period! None should be \"too big to fail\"! Throwing trillions of dollars at a sinking ship is madness, it just prolongs the inevitable and hurts those that are being forced to pay for using their stolen tax paid monies, and harming the entirety of the economy, we are here to bail out the billionaires and globalist elites delusional scam they are perpetrating on man kind!","commenter_a":"What an asshole and she probably makes a 6 figure salary, time to clean house","post_message":"Not sure about you, but this REALLY pisses me off!   H/t: Emancipated Human Subscribe: @webpagelink  Join Us: The Free Thought Project"},{"comment_id":"1043277849065296","commenter_b":"Stupid cow! Needs to get over herself","commenter_a":"What a cow!!!","post_message":"'His career won't suffer, but I've been told I'm ruined'"},{"comment_id":"10153760611904087","commenter_b":"@username not as big of a liar as HilLiary!! She's the queen of lying, pandering and flip flopping! #WhichHillary","commenter_a":"Thank you VP Joe Biden for saying: \"I feel confident that Hillary Clinton will be the nominee and I feel confident she'll be the next president\". Coming from you that's awesome!!!","post_message":"“I feel confident that [Hillary Clinton] will be the nominee and I feel confident that she’ll be the next president,” said Vice President Joe Biden."},{"comment_id":"1024492464317039","commenter_b":"@username, we can send all illegals home and we'll start with you! Mexican Americans/Native Americans are the only people who this land belongs to. So dip","commenter_a":"Where's the mom so she can start putting graduation pictures up and say that her kid never did anything wrong that he was a good kid and never did drugs Ill be waiting","post_message":"NEW VIDEO: #Chicago police have just released dashcam video that shows a female cop being beaten by a man who was high on PCP. (WARNING: Video is very graphic and has inappropriate language) @webpagelink"},{"comment_id":"10155055910404411","commenter_b":"RACISMRACISMRACISM!!!!blahblah blah","commenter_a":"Funny how it's white people who are quick to discredit this as well as add in fake stats. But you're not racist right?","post_message":"D410 Code - 'to alert co-workers that  black person is in the store'"}]
