[{"comment_id":"10150664369884999","commenter_b":"Rule of thumb: Economists don't generally have armies at their disposal to help overthrow democratic governments who oppose their \"theories.\"","commenter_a":"You'd think true conservatives would be happy about the expansion of rights (gay marriage) and making sure everyone chips in on the healthcare system everyone uses (Obamacare). I guess they're not conservatives, just simple Republicans.","post_message":"The way some Republicans tell it, America is a pretty awful place these days."},{"comment_id":"10153562067157377","commenter_b":"@username She seems just as evil as Cecile Richards.","commenter_a":"The judge should have had Daleiden executed ,so the people in the clinic could sleep at night.","post_message":"\"This is a huge win for the pro-life movement,\" said Jared Woodfill, an attorney for Daleiden. \"The court recognized that the charges brought by the Harris County District Attorney's Office were flawed from their inception.\""},{"comment_id":"10153332905444726","commenter_b":"you ladies have silly opinions","commenter_a":"Who in the world is this guy? Why does anyone care what he says? Why isn't he doing something. Instead f criticizing, why isn't he doing something?!!!!","post_message":"WATCH: Byron Allen Calls Obama a White President in Black Face"},{"comment_id":"649003498581759","commenter_b":"On a more humorous note.","commenter_a":"The republicans in congress have failed to do their job for 7 years ,but the stupid voters put them back.How do you explain this ?","post_message":"We can make major changes in Washington DC with our votes in November. Armed Democrats"},{"comment_id":"10154010743370329","commenter_b":"Ooh I didn't know there would be another season?! Thought it was over!","commenter_a":"@username Aimee Fortune Jade Morgan @username","post_message":"Watch the first four minutes of the next season of Pretty Little Liars right now!"},{"comment_id":"896653263722173","commenter_b":"Why is she getting away with this lawless behavior?","commenter_a":"told ya!","post_message":"HILLARY CLINTON HANDS OVER A BLANK SERVER TO THE FBI Slick Grifter..."},{"comment_id":"374960556025572","commenter_b":"You want to live in America and enjoy all our Country has to offer! Take off your scarf.","commenter_a":"Yes","post_message":"Should head scarfs be banned in America?"}]
