[{"comment_id":"10155927830195354","commenter_b":"Donald Trump is going to be the next President...you can take that to the bank...","commenter_a":"Why don't they read these polls, it's too obvious to conservatives like me. Do I trust Trump, not totally, but I do more than most of the GOP minus Ted and Rand. Let's get this country back conservatives, go Trump","post_message":"When over half your voters don't feel like you're looking out for them..."},{"comment_id":"556755621195285","commenter_b":"'@username y'all race invented HIV and experimented on other races but that heroin epedimic spreading HIV all thru the white folks Hood. Keep sharing needles junky..","commenter_a":"Same white dudes screaming how they would beat her ass are the same ones who scream don't hit a woman when it's a white woman !!! Good news is that it is fact that by 2030 the white race will be a minority ! 😉. So that always makes me smile when I see the racist still holding on to a failed system ! But that's ok the rest of the world has moved on! Just look at the population ... your country is now little Mexico right under you nose while you tried so hard to oppress the blacks you let in millions of mexicans , Muslims , Somalis! Now you mad !","post_message":"She took his crowbar away and went crazy!"},{"comment_id":"1303084943055048","commenter_b":"And I would make the vandal pay for it too!","commenter_a":"Looks better like this.","post_message":"Donald J. Trump just got hacked."},{"comment_id":"10153030782377434","commenter_b":"Thank you. However, white women wear wigs and added hair too. 95% of them in hollyweird do.","commenter_a":"I think this is significant when many African American female celebrities wear wigs that look like Caucasian hair, because of our so-called standards of beauty. I think the natural look is much more attractive and empowering for girls who look to them as role models.","post_message":"“If you say you’re beautiful without hair and makeup, then they will believe you,' Maria Borges said of the hairstyle she walked during the Victoria's Secret Fashion Show."},{"comment_id":"10157698667015354","commenter_b":"Oh dam black bonnet girls make the rocking world go round!!","commenter_a":"Rumspringa. @webpagelink","post_message":"Here's a headline you don't see every day..."},{"comment_id":"10153572345386955","commenter_b":"Both dopes.","commenter_a":"The Pope and the Dope!","post_message":"Influential Iowa Backers Get Invites to See Pope with VP..."},{"comment_id":"872299812875772","commenter_b":"Hillary is spreading disgust. She's a shameless, pathological liar with no morals at all.","commenter_a":"She is a complete idiot as well as a liar.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"}]
