[{"comment_id":"981651015256776","commenter_b":"Lol because people and companies don't donate cars and trucks for tax write offs","commenter_a":"God forbid American tax payer money goes towards improving lower and middle class families or stuff that actually benefits us, but check out the sweet new cars dps get to drive!","post_message":"Next time you pass a red Dodge Challenge or Yellow Ford Mustang GT, you might want to check your speed. DPS troopers now have two new unmarked vehicles for traffic enforcement."},{"comment_id":"10153539685509641","commenter_b":"How many ISIL recruiters are. among all these \"refugees\" ..wait untill they settle.No more Europe for me..is unsafe now..","commenter_a":"Couple of years from now the refugees will try to change europe like the country they just left... they will get offended by the host country's culture and practices and might demand for sharia law in europe.. the European politicians will never learn their lessons... just take a look at UK, France and sweden .... RIP EUROPE.. well played saudi Arabia, Kuwait and other middle eastern countries who smartly looked away.. My only hope is that the refugees respect the host country's culture and laws and abide by it and never dream of changing it... but I doubt it strongly","post_message":"Today, German Chancellor Angela Merkel said her country is pledging an additional 3 billion Euros to the migrant crisis. French President Francois Hollande said France will accept 24,000 new refugees, and British Prime Minister David Cameron said the UK will take up to 20,000."},{"comment_id":"10153970648079091","commenter_b":"Just string her up!","commenter_a":"Sick people!","post_message":"UPDATE: New Mexico mom out of hospital, taken to jail after the brutal murder of her 10-year-old daughter in which police say she was injected with meth, raped, killed and dismembered."},{"comment_id":"1212113488867185","commenter_b":"Why is it that the LIBERALS are the one who ALWAYS scream the loudest whenever Voter I.D. is even mentioned let along being considered?","commenter_a":"DESPERATE DEMOCRATS KNOW THEY CANNOT WIN FAIR AND SQUARE, THEY RESORT TO UNDERHANDED AND DEMORALIZING TACTICS!!","post_message":"Libs everywhere were thrilled when Texas' voter ID law was struck down by the courts, which ruled it it was too restrictive. That's when they read the fine print, though...  All of a sudden, liberal jubilation turned to rage and tears."},{"comment_id":"964590076909747","commenter_b":"I wouldn't vote for that FAT SOB for dog catcher!!!!!!!!!!!!!!!!!","commenter_a":"Lol he can't control his staff with the George Washington bridge debacle and he wins the cnn award ? Lol notice they dident ask him about that...it was like always a trump bashing...I'm voting trump the media makes it easy for me to come to this conclusion","post_message":"It's official!"},{"comment_id":"10153454938709330","commenter_b":"R.I.P","commenter_a":"Just heartbreaking ... Your with your mom...Rest in Gods Grace and Peace.","post_message":"Sad news to report. Bobbi Kristina Brown, daughter of Whitney Houston and Bobby Brown, dies at 22.  More here ---> @webpagelink"},{"comment_id":"884400811644417","commenter_b":"Once again, that blonde bimbo has diarrhea of the mouth!","commenter_a":"this guy has an ego like no other. he is disgusting to look at and if he weren't rich he would probably be a homeless pervert or a wall street runner.","post_message":"The Oracle of the Republican Party speaks out."}]
