[{"comment_id":"10153526527726770","commenter_b":"What a buch of sissys can't block it","commenter_a":"It is this lack of backbone to do the right thing that is causing people to be so angry at the establishment! Stand up and be counted! You might be surprised at the response!","post_message":"A former Delta Force commander,says President Obama is letting terrorists flow across the U.S.-Mexico border --- and that Republicans are too 'paranoid' to stop it."},{"comment_id":"10154179126579411","commenter_b":"Gotta love the 'former' officers or agents say the truth once they've retired.","commenter_a":"Shut-up CIA!!!! You funded and gave birth to ISIS !!!!!!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"835512459884693","commenter_b":"Crazy woman","commenter_a":"The truth is not in her.","post_message":"Pelosi glosses over spiking costs under the ACA for millions of Americans."},{"comment_id":"675644415959470","commenter_b":"God bless you one of our hero","commenter_a":"Spencer , sorry this happened to you! Hope you are recovering fast and gaining strength every dsy.","post_message":"We all remember Spencer Stone and 2 other heroes stopping the Islamic terrorist attack aboard a train. Just days ago Stone attempted another heroic act, but this time wasn’t so lucky… Can we get 40,000 ‘LIKES’ for this American Hero?"},{"comment_id":"10156314605160354","commenter_b":"Dems care more about illegals than Americans! Vote all democrats out!","commenter_a":"Here is a list of the DEMS that blocked the vote for Kates Law and to stop Sanctuary Cities.Tweet or Facebook your Congressman or woman.","post_message":"'With a vote of 54-45, the measure failed to obtain the 60 votes necessary to end debate.'"},{"comment_id":"10153903118333690","commenter_b":"Israeisl go there with American pasports","commenter_a":"Donald Trump need to stop Americans going to Muslim Countries whether it,s visit or work","post_message":"US Republican front-runner Donald Trump wants to ban all Muslims from entering the United States.    Elsewhere in the world, Tuesday marked the 50th anniversary of the Race Relations Act in the UK, which outlaws discrimination on the grounds of colour, race, ethnic or national origin.  So, how has racism changed over time?"},{"comment_id":"822379027897898","commenter_b":"How will she do that? She is one of the causes for the problem !!!!","commenter_a":"No they just rather let America be filled and run by people who hate America.","post_message":"“We are not going to be Donald J. Trump’s hate-filled America. Not now, not ever.”  Sen. Elizabeth Warren told a fired up crowd that Hillary Clinton will fight to end discrimination in America."}]
