[{"comment_id":"10153114864642144","commenter_b":"Bitch is a hater","commenter_a":"I don't even care about McCain but to be dismissive about his service to our country is disrespectful. Trump is an asshole.","post_message":"Low, even for Trump"},{"comment_id":"576566162546923","commenter_b":"I'm going to keep flossing every day. Brush three times, floss once. Usually more but oh well. When you get ten cavities per year, you do whatever could give you hope","commenter_a":"The AP can't get facts right about news events, so we should trust them about flossing?","post_message":""},{"comment_id":"1736894583244313","commenter_b":"Jenny Fabbri Some of the images leaves much to be desired. Efforts are commended.","commenter_a":"Good, but they cannot do same for migrants?","post_message":"Awww... some amazing footage of a kitten revived by Italian coastguard's kiss of life..."},{"comment_id":"10152775426692217","commenter_b":"The US has millions of illegal Mexicans to care for, sorry we're full.","commenter_a":"Am sure Canada and USA will come forward and agree to accept these poor immigrants. These countries unlike our crowded little island have plenty of space to accommodate these poor souls, tho having said that Scotland is pretty sparse.","post_message":"Video shows the moment migrants are rescued from a boat in the Mediterranean @webpagelink"},{"comment_id":"10154969717088352","commenter_b":"She need to sit in jail for a good 30 days!! Bet she won't think that's funny!","commenter_a":"And what's her punishment??!!!","post_message":"Massachusetts cop’s wife ‘faked robbery and spray-painted the letters BLM on her own home to blame Black Lives Matter supporters’"},{"comment_id":"10158323534995594","commenter_b":"Stupid idiot. He is not sending out legal immigrants.","commenter_a":"Closing stores and businesses won't make America Great Again","post_message":"“I feel like I want to put the message out that I am ashamed that I gave him my vote, and I wish I could repeal and replace my vote for him.”"},{"comment_id":"863341973762056","commenter_b":"It's not s scheduled White House speech. It's an impromptu get together organized by Boehner.","commenter_a":"I can't wait until the Republicans find out the Benjamin Netanyahu is not a Christian.","post_message":"Dozens of Democrats are skipping Netanyahu's speech -- including Senator Elizabeth Warren."}]
