[{"comment_id":"1908531226047249","commenter_b":"But where is Hillary?? This would have more weight if she were working with you","commenter_a":"Yes the people voted and they voted for CLINTON by over 2.5 Million votes!!!!","post_message":"The fight for #Recount2016 continues! We deserve a voting system we can trust, that is accurate, secure and just. Despite the sabotage, political cronyism, bureaucratic hurdles, economic extortion, and legal maneuvering that has been thrown in our way, this historic first-ever multi-state presidential recount carries on. I'm here to give you the latest updates, answer your questions, and talk about next steps."},{"comment_id":"10154153179614445","commenter_b":"She is a female plain and simple dna dont lie!!!!!","commenter_a":"Good sorry but proud of the boys for standing up for their rights...you are a boy not a girl therefore no you shouldnt have the right to be king ...go home and sit in a corner and cry","post_message":"A transgender teen and his peers are protesting their high school’s decision to deny his bid for prom king. Hear Ash’s story: @webpagelink"},{"comment_id":"10153888628981336","commenter_b":"@username - your brain is a mulsim! SHUT ALL \"DOORS\"!! KILL ALL muslim islams!! The only people who hate Trump are the illegals, anchor babies, muslims! Again, I ask, which one are you or are you all three? I demand to block ALL ILLEGAL aliens; muslim islams, to PROTECT OUR borders! Then IMPEACH obama blammer mouth!","commenter_a":"Obama can't help it. His father was a Muslim, not an American. His allegiance is pretty clear.","post_message":"Yesterday on \"America's News Headquarters,\" Mike Huckabee shared his perspective in light of the #SanBernardino terror attack."},{"comment_id":"1640792116219030","commenter_b":"That takes some balls","commenter_a":"What a pair to draw too. How can anyone support these idiots.","post_message":"Details you'll want to know are here: @webpagelink"},{"comment_id":"760141017451798","commenter_b":"he also spoke at her rallies against Obama Care!! he should be thrown out for being publicly biased BC he knows he had to make decisions on it so it is illegal for him to do that!! his teaturd wife is insane too!!! apparently if your rich, you are above the law! time for a big change here!!!","commenter_a":"And what about Thomas \"inadvertently\" forgetting to report 1.6 million in income his wife earned lobbying and speaking against healthcare? How is he still on the Supreme Court?","post_message":"Very interesting."},{"comment_id":"10154268012211336","commenter_b":"HURRY UP AND OD, MAKE AMERICA PROUD, FIDDY THENTS.","commenter_a":"50 cent. Ironically, that's also what his career is worth.","post_message":"In a video posted on Instagram, 50 Cent confronts a young man as he pushes a cleaning cart through the terminal and accuses him of appearing to be high on drugs."},{"comment_id":"10156717481975354","commenter_b":"she is a pig","commenter_a":"SO VERY WRONG!!!","post_message":"Black Panther Tribute by Beyonce..."}]
