[{"comment_id":"10153691718919062","commenter_b":"Maybe if you stopped seeing breasts as sex objects, this wouldn't be an object. Maybe if your dog of a husband can't stop looking at a breastfeeding woman, the issues lie in your relationship and not with the poor woman trying to feed her baby. Just saying.","commenter_a":"Not in public. I breast feed my daughter but some things should be private! When I go out to eat I dont care to be paying $80 and having to see someone elses boobs out of the corner of my eye. Then when you have younger children they point and ask why that mommys boob is showing & what is she doing? Then there are guys who get distracted by anything-anything at all. So- this is dinner and porn all in one. Thanks for ruining our night out.","post_message":"TONIGHT AT 10: A major apology from a Texas coffee house after a breastfeeding mother is told to cover up. Should breastfeeding be allowed anywhere, or should there be designated areas?"},{"comment_id":"537038436486736","commenter_b":"PUKEBAG, Tax-evading, racist POS!","commenter_a":"What A Joke HE IS DEFINATELY TALKING OUT HIS ASS NOW","post_message":"Dr. Alveda slams Al Sharpton for comparing himself to MLK on live TV. Al Sharpton and MLK should never be used in the same sentence. Do your agree Al Sharpton is a criminal?"},{"comment_id":"1317863694976546","commenter_b":"She is not his type","commenter_a":"Hillary paid them","post_message":"BREAKING Trump campaign adviser A.J. Delgado tells Brian Williams the allegations of inappropriate touching against Donald J. Trump aren't credible."},{"comment_id":"10153156704581051","commenter_b":"So what should he have done? If a chick is crazy like this chances are she isn't just gonna let him walk away. Men can be abused to and it's never right her ass is exactly where it should be.","commenter_a":"What kind of wimp does a guy have to be to call the police because his girl friend slapped his sensitive little face, and hurt his widdle feelings.","post_message":"This woman set up a secret camera to keep an eye on her boyfriend. When she reviewed the footage and saw what he was doing while she was gone, she snapped."},{"comment_id":"10156623129805389","commenter_b":"He wrote an entire book about it. Would you like copy?","commenter_a":"Great. How? How exactly is he going to create jobs? This guy just says he's going to make things great without details. He is making hollow promises. You know who else did that? Obama. He did the same thing. Actually, he did it without insulting people and sounding like the middle linebacker of a high school running for class president on the platform of beating up nerds and gym class all day long.","post_message":"“I am going to be the greatest jobs president that God ever created.” WATCH the highlights from Donald J. Trump’s New Hampshire primary victory speech. #Hannity"},{"comment_id":"886812858022722","commenter_b":"Yea she looked so approachable at Chipotle! Fraudster.","commenter_a":"She is listening to what? She is too busy nodding her head all the time, so disingenuous. Listening?","post_message":"\"I want people to know I’m listening and I’m accessible...\""},{"comment_id":"534617120056639","commenter_b":"Mike Bassenti This is what they get for coming here !! We have to pay for this ! @webpagelink","commenter_a":"Big news is Trump is earning MAJOR support from segments of the population which almost exclusively vote for Democrats. SurveyUSA announced that Donald Trump would receive 25% among black registered voters. That is news that has Hillary Clinton terrified, and is shaking the political establishment to the core!","post_message":"I had an incredible time in Detroit yesterday. A great experience - learned a lot by listening to everyone. I am grateful for their support - and time. You can catch what I had to say to everyone, right here. Thank you! -DJT"}]
