[{"comment_id":"10153342473651336","commenter_b":"The girl was mouthing off and ignoring him when he said get the hell away, if that was my daughter I'd slap the taste out her mouth, she wouldn't even have to worry about the cop.","commenter_a":"These cops are constantly thrown into situations where there are multiple combative people and ONE officer. Was he in the right or wrong? I don't know, but cops are constantly put in these dangerous positions as a part of their job.","post_message":"The video appears to show the officer using his knees to pin the girl face down, pointing his gun at other teens and cursing."},{"comment_id":"767374910062356","commenter_b":"Yes!","commenter_a":"Lord help us she is just like Obama.","post_message":"Can we PLEASE learn from last time?"},{"comment_id":"1283553535022959","commenter_b":"Ryan got a totally cushy job.","commenter_a":"Aleks Evans","post_message":"LOL! Not helping anyone, Ryan!! SHARE if you agree! (Hat tip to The Christian Left)"},{"comment_id":"927164187324440","commenter_b":"A real woman appreciates foreskin and it's functions. I prefer a whole full functioning penis.","commenter_a":"Yeah well.. circumcised guys get blown more often scientific fact","post_message":"And now for a quick but fun history break from CollegeHumor. - Rollie Williams"},{"comment_id":"654547928069119","commenter_b":"Her momma needed to be called..to see what a disrespectful kid she has..","commenter_a":"She deserved what she got..","post_message":"Obama supporter gives lip to police, learns very quick lesson. This is what you get when you disrespect authority. Do you think she got what she deserved?"},{"comment_id":"1236189426462383","commenter_b":"#ImNotWithHer","commenter_a":"You mean Hillary campaign staffers posing as sanders supporters","post_message":"Bernie Sanders supporters have taken to Twitter to reluctantly express support for Hillary Clinton using the unenthusiastic hashtag #GirlIGuessImWithHer."},{"comment_id":"1159474340740147","commenter_b":"we don't give flyin fk what she does lmfbo she is a pig an evil ugly witch","commenter_a":"Donald Trump CNN just reported you declined an invitation to speak at the NAACP convention. Are you nuts? Hillary accepted, you declined. All I hear about is how hillary is sensitive to the American people and even though she is a liar, there are a whole lot of American people that believe her. Right now I hear her speaking in a calm mature voice how this country is divided. Wow is she tearing your character completely apart. It's all about you she is saying. All this is about you. I got to tell you Trump old man, she is using every lying skill she has to make you look bad. Real bad. A bad guy. Yeah a real bad guy.","post_message":"I agree! Lets MAKE AMERICA GREAT AGAIN...VOTE FOR TRUMP! Thank you for your support- it means the world! DJT"}]
