[{"comment_id":"528596753997571","commenter_b":"Yes the airline acted as they should have! If these people don't want to be put into ituations like this they should dress in such a way as not to bring question upon themselves. They should also understand the airlines concern where muslims are involved from prior experience. Personally, I think all illegals should be deported along with Obama!","commenter_a":"Yes. They've already proven they cannot b trusted","post_message":"These Muslims were thrown off the plane for this frightening reason.  It is always better to take necessary safety precautions.  Would you want them off your plane too?"},{"comment_id":"10154293014660329","commenter_b":"That ugly ass bitch is a hater.","commenter_a":"Reyna Zavala Giovanna Siqueiros Princess Vespa No pues wow","post_message":"\"Swish!\" - Amber Rose, probably // Kanye West"},{"comment_id":"10153007103196336","commenter_b":"Yes, teachers do hve input as to curriculum. No teacher nor educator has the right to instill their political views on to their students.","commenter_a":"These teachers need to be replaced if they are inserting their political views in the classroom and have only One answer which the see as correct whether it is correct or not! This is MY opinion! This does Not need to be taught in school anymore than religion! Go argue on someone elses opinion if you don't like mine. I will Not be called ignorant by anyone!","post_message":"“The Democrat is building. The Republican is destroying.”  According to an 8th-grade teacher in Wisconsin, this was the correct answer for a social studies assignment on immigration policy."},{"comment_id":"1729830760638535","commenter_b":"Stfu dumb niggabitch.. let's see you come up with some rhymes.","commenter_a":"That was shit, idk what you people are thinking sometimes 😂","post_message":"That lie really hurt tho"},{"comment_id":"488243741366206","commenter_b":"Hell no don't mess with our children!!!","commenter_a":"I thinks it's wrong for Muslims to even to be on our soil!!!!!!","post_message":"American students are being forced to dress like Muslims.  This is absolutely unacceptable, we need to spread this and show Muslims we are not going to stand for this.  Do you think it's wrong for Muslims to force their beliefs on our children?"},{"comment_id":"10154506488603487","commenter_b":"Non-issue. Couldn't and wouldn't happen. Too much of our power structure is in Texas.","commenter_a":"If they do not want their Social Security, Medicare, Medicaid, and Veteran Benefits. We will gladly keep their share for the USA. Of course Hillary has a chance to win Texas.","post_message":"Hypothetical question: Would you support or oppose Texas seceding from the United States?"},{"comment_id":"834253316765245","commenter_b":"Send her back where she came from","commenter_a":"Put her in jail","post_message":"This is as low as it gets.  She is a traitor.   What do you think her punishment should be?"}]
