[{"comment_id":"10156327027695389","commenter_b":"Cuff the lying witch already.","commenter_a":"Sounds like a recommendation for an Indictment may be in the new future. If the DOJ rejects it.....Will their be alot of resignations from the FBI??","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10155827348030603","commenter_b":"Well if the driver is 18 then maby she should be brought up on man slaughter .","commenter_a":"I know this is a hit and run.. but why was this man in the street?","post_message":"#BREAKING: One of the suspects is also facing involuntary manslaughter and leaving the scene of an accident charges related to the hit-and-run that killed Bapi Gupta."},{"comment_id":"1011526468943605","commenter_b":"That's what professional political tumors do!","commenter_a":"Good. Cruz wasn't there for Kim Davis. Ted was there for political purposes.","post_message":"Ted Cruz tried to get on the stage with Kim Davis in Kentucky ... only to be blocked by an event staffer."},{"comment_id":"10153061361762235","commenter_b":"Actually, she's not a Texan... she's a writer from Michigan... and she can take I-35 North and get her ass outta my state!","commenter_a":"Think this is the Wicked Witch of Texas!!!! She is mean and crazy!!!!!","post_message":"American Taliban."},{"comment_id":"10155029818006543","commenter_b":"Senator Wazzy got slapped on by Senator McMackinz. Tell a ho where she's at! @webpagelink","commenter_a":"Mitch McConnell email inbox is full. Let jam his faxes with the Coretta Scott King letter now. DC Office : (202) 224-2499","post_message":"In an extremely rare rebuke, U.S. Senator Elizabeth Warren was cut off while reading a 1986 letter by Coretta Scott King on the Senate floor @webpagelink"},{"comment_id":"909807282450701","commenter_b":"Great place for a Drive By Shooting!!","commenter_a":"'- Funny, they don't look like brothers.","post_message":"Who paid the bill?"},{"comment_id":"513866205470626","commenter_b":"This IS STILL AMERICA and I'll go where ever I want, if those pigs fuckers try to stop me it will be the last thing they do before meeting allah in hell","commenter_a":"They need to obey American laws. As all do who live in this great country.","post_message":"Video coverage from the Shariah 'No-Go Zone' has been released.  This is America. If you don't like it you can get out.  Do you agree Shariah Law should be banned in America?"}]
