[{"comment_id":"10155251280330294","commenter_b":"The only thing \"frightening\" about this video is how butt ugly that lady is that get out of the car! Ha...","commenter_a":"There's 2 sides to every story...no other side could justify illicit behavior like that but what happened before the video started?","post_message":"\"Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off-road first time.\"  Then- things take an even scarier turn, when the woman stops her vehicle, gets out and walks up to the car."},{"comment_id":"10152950804022434","commenter_b":"Just a bunch of liberal bitches that have no fucking brains. Their full of their self","commenter_a":"The view is always just a bunch of dumb bitches!","post_message":"Eggland's Best Eggs and Johnson & Johnson have pulled out as show sponsors."},{"comment_id":"10153520082123132","commenter_b":"YES CANCEL, PLEEEEASE!! ONCE A CHILD MOLESTER ALWAYS A CHILD MOLESTER!!! CHILD MOLESTERS NEVER GET REHABILITATED!!! IT'S BEEN PROVEN!!!","commenter_a":"NO!!!","post_message":"Do you think TLC should cancel 19 Kids and Counting?"},{"comment_id":"387651254692803","commenter_b":"Really Kathy tell that to the vets that the repubs cut spending on you dumb woman!","commenter_a":"GOP don't give a G/D about anyone America please wake up !!!","post_message":"What did you think of this response to the President's State of the Union address?"},{"comment_id":"952385434796916","commenter_b":"You are the disease you inbred fuck","commenter_a":"Abortion is a personal choice, you can't ban it from everyone just because your shitty religion doesn't like it","post_message":"You'll want to pay attention to this one."},{"comment_id":"10154814008013797","commenter_b":"Why feed nd house this p.o.s just torture em till.hes dead","commenter_a":"Piece of 💩","post_message":"LIFE IN PRISON: In the man's car, police found children's toys, chloroform, sleeping pills, cable straps, thumb cuffs, a stun gun, latex skull masks, gags and various strangulation devices."},{"comment_id":"10154141552967426","commenter_b":"Those who are always accusing others of hate don't seem to have enough self awareness,intelligence or what ever to know how obvious it is who they hate.","commenter_a":"Welcome to Hillary's America RVA.....","post_message":"\"Your vote was a hate crime,\" was sprayed painted on statues that honor Civil War icons along Monument Avenue in Richmond.  The graffiti was discovered as hundreds protested the election of  Donald Trump as president.  Updates: @webpagelink"}]
