[{"comment_id":"959204997435717","commenter_b":"Well.... sometimes women are raped...","commenter_a":"Will this decision really stand? Don't get my hopes up.... Can it be vetoed? Will it stand? (I hope it stands but We the people have been asking them to defund PP for a long time and they haven't listened!)","post_message":"This Congress and its relevant committees must complete a thorough investigation of the disturbing accusations evidenced in the Planned Parenthood videos before another taxpayer dollar goes to this controversial organization. These funds can be better used providing legitimate health services for women in places like North Dakota"},{"comment_id":"887259011404129","commenter_b":"She smacked him down with that","commenter_a":"That was my favorite point in last night's debate. It really showed who has done more for our country in the last 30 years.","post_message":"\"I'm happy to compare my 30 years of experience with your 30 years.\" —Hillary to Trump #Debate"},{"comment_id":"1783407658566153","commenter_b":"Bitch!!! the only ones not giving up their power are You, Hillary, and Obama!! You need to give it up!! You lost!","commenter_a":"\"The biggest way we give up our power is by not knowing we have it to start with.\" --Alice Walker (paraphrased)","post_message":"This week's fireside chat is a call to action. Trump and his allies are trying to block the democratic process and our right to a vote we can trust.  If you are near New York City, join us at Trump Tower on Monday morning at 10 AM to stand up for democracy."},{"comment_id":"884868911589338","commenter_b":"More like the Supreme Joke of the United States, where the highest bidder wins the votes. They should just remove the robes and wear clown outfits.","commenter_a":"Franklin Graham The Supreme Court of the United States has ruled today that same-sex marriage is legal in all 50 states. With all due respect to the court, it did not define marriage, and therefore is not entitled to re-define it. Long before our government came into existence, marriage was created by the One who created man and womanAlmighty Godand His decisions are not subject to review or revision by any manmade court. God is clear about the definition of marriage in His Holy Word: a man shall leave his father and his mother and hold fast to his wife, and they shall become one flesh (Genesis 2:24). I pray God will spare America from His judgment, though, by our actions as a nation, we give Him less and less reason to do so.","post_message":""},{"comment_id":"10155098907990329","commenter_b":"I'm always grateful to be corrected, especially when someone is able to be patient with me even though I'm not owed it :)","commenter_a":"My family has been calling this season's theme \"A Haunting\" because of the reenactments and stuff. I like the season so far but guys, what happened to the people of Roanoke really isn't that big of a mystery. Most likely after part of the group left to get supplies more colonist died from a mix of starvation and attacks. They then most likely moved to settle with the Croatoan tribe for both help feeding themselves and protection. It also helps explain the upsurge in Croatoan children with blonde hair or other features that are rare, though not unheard of, in their genetic pool. Basically, your elementary school teacher lied to you. Other lies you learned in history class: the Mayans didn't just mysteriously disappear. They over farmed the valleys they lived in and could no longer continue to occupy large cities and began living in smaller groups. They're are still ...","post_message":"Mind blown. // American Horror Story"},{"comment_id":"946732062040088","commenter_b":"Right. Because all those women raped enjoyed it. *eyeroll*","commenter_a":"If you don't want to get pregnant that is a choice. If you don't want to get pregnant, don't have sexual intercourse. There's other ways to find physical satisfaction than sexual intercourse & they won't create a baby. Abortion IS NOT a means of birth control. It's murder. For those who are for abortion as a woman's choice, what about the choice of all of those female babies that have been aborted?","post_message":"So true."},{"comment_id":"1112791138738235","commenter_b":"1 stupid bitch","commenter_a":"Unfortunately she is right more often than not.","post_message":""}]
