[{"comment_id":"10154787328718984","commenter_b":"Perhaps she should have kept her mouth shut and the White House wouldn't have to protect her!!","commenter_a":"BS....houses don't talk. We are about to witness the biggest revolt on DC and heads will be rolling. Trump will clean house literally. The most crooked leaders plus the worst media in the world. People are po'ed and WE aren't going to take it anymore.","post_message":"Right after Michelle Obama took the stage and launched an attack on Donald J. Trump that sent the media into a frenzy, the White House delivered a message to the Republican candidate that did NOT go unnoticed..."},{"comment_id":"10157706187460354","commenter_b":"She was a joke","commenter_a":"Thud... Rolling stumble... Face plant. \"Humph, that pit of lies I just tripped on was not clearly marked.\"","post_message":"Did you HEAR what Hillary said at the Commander-in-Chief Forum?!"},{"comment_id":"1221745097868321","commenter_b":"Send her out to pasture","commenter_a":"The dumbest women in the world","post_message":"Pelosi says Clinton only lost because of Comey and the FBI investigation. Do you think Democrats are being sore losers?"},{"comment_id":"1049402575096281","commenter_b":"Talking about slavery isn't race-baiting. It's American history. Also, I didn't hear you mention the part about women's rights.... Did you also mean gender-baiting? If not, maybe you are the one stuck on race...","commenter_a":"America was great when americans had pride in your country instead of some fatherless minion trying to tear it apart to serve his race baiting tv program...","post_message":"“Make America Great Again” begs the question: when exactly was America great?"},{"comment_id":"908657265920023","commenter_b":"I remember when NASCAR used to be a great sport. You screwed it up Brian. You should've a politician. You took a gold mine and destroyed it. Take a look at the last Bristol race.","commenter_a":"Stopped watching Nascar when Dale died, not surprised at all.","post_message":"Will NASCAR fans support NASCAR chief Brian France's \"behind the scenes\" political efforts on behalf of the transgender bathroom movement?"},{"comment_id":"10152874216906336","commenter_b":"Were the idiots of man that let these people in the country there should be bought to trail as well","commenter_a":"When will we as a human race stand up to the immoral acts of the few. Doesn't matter where your from. We need to stand together to eradicate scum..","post_message":"PHOTO OF THE DAY: Hundreds of thousands of people marched in solidarity across France Saturday to denounce this week’s terror attacks in Paris and to honor the victims."},{"comment_id":"897220707004345","commenter_b":"Ah yeah, 'only'!","commenter_a":"Emma Marie Hulme Bet you'd be able to shed some light on this!","post_message":"Near death survivor says all he saw was darkness"}]
