[{"comment_id":"10153328261067093","commenter_b":"****Illegal immigrants.","commenter_a":"It's funny y'all keep talking about Democrats. I guess y'all are the same incompetent people that voted for Bush twice. Donald Trump has his head up his anus. He doesn't know the first thing about running a country. Let me guess he had y'all at Wall? He would build one to stop immigrants. All immigrants aren't bad they just want a better life. LeRhonda Flowers","post_message":"A resident of a tiny island in Canada is rolling out the welcome mat if Americans want to flee after Election Day.... @webpagelink"},{"comment_id":"10156931883630294","commenter_b":"Next he goin dangle his white hoe","commenter_a":"I pray for that poor pup, hope they freaking charge this POS to the fullest extent allowed by law, poor thing!!","post_message":"The suspect turned himself in after feeling the pressure on social media."},{"comment_id":"10155045059411037","commenter_b":"NO!!!!!!!!!!!!!","commenter_a":"O come on!! Not her too!!!!","post_message":"Carrie Fisher died Tuesday, and Debbie has been distraught since Carrie's emergency on Friday."},{"comment_id":"10152764281491680","commenter_b":"Reminds me of Nancy Reagan. Stepford wives, both of them.","commenter_a":"Not surprised that a cheater would support a fellow cheater. Also...why does his wife always looked demonically smiley at literally everything he says. She creeps me out.","post_message":"Chris Christie addresses the controversy surrounding Tom Brady, the New England Patriots and Deflategate."},{"comment_id":"978940745501376","commenter_b":"Fire Her!","commenter_a":"Forgive them; they know not.....wait, let's not.","post_message":"DISGRACEFUL MSNBC HOST: Katy Tur Speaks over the Star-Spangled Banner at Trump Rally (VIDEO) @webpagelink"},{"comment_id":"1710328329254279","commenter_b":"@username they are too stupid to listen.....republicans are turning into the lowest pond scum.....shit for brains","commenter_a":"I don't like the media. They don't publish the news unless it goes there way.","post_message":"WHOA This is going to start a RIOT... Obama deserves to be in JAIL!"},{"comment_id":"621306871404081","commenter_b":"TruDat","commenter_a":"I do not like Chris Cuomo I quit watching CNN and ABC because of garbage just like this we need to vote them out with not giving them a minute of our time. All Chris is concerned with is his desperate search to find something to attack any republican for but especially our our President Elect if you don't agree with his liberal view he will try to destroy and humiliate you Kellyanne has class and courage to face such an excuse for a reporter if I was her he wouldn't get five seconds of my time.i don't understand what makes him think that is just his President because as my President I feel he has a right to tweet about his opinions and I like seeing what his opinions are.","post_message":"Kellyanne Conway embarrassed CNN's Chris Cuomo for obsessing over Donald J. Trump's tweets..."}]
