[{"comment_id":"10153140414189071","commenter_b":"Read previous comments about the difference of Free Climbing and Free Solo climbing.","commenter_a":"Incredible athleticism yes!free climb? not if he's got a rope.","post_message":"What an incredible athlete."},{"comment_id":"10154449386136336","commenter_b":"Ban Muslims Now!!","commenter_a":"Open mouth insert foot.","post_message":"Last night on “Hannity,” Mike Pence echoed Donald J. Trump’s call for a temporary ban on immigration from countries where terrorists represent a threat to the United States. @webpagelink"},{"comment_id":"10153042525998984","commenter_b":"NO....NO...NO......WAKE UP AMERICA! Kick these bastards out now!","commenter_a":"should not happen take off the d-- hood","post_message":"I can't believe this is happening. It has already sparked a big public outcry. Please help us get the word out so this situation can be stopped."},{"comment_id":"836603479863562","commenter_b":"Prayers and positive messages on the Internet along with taking as many polls as possible. Drive elderly Trump supporters to polls and escort them in. BLM and Black Panthers plan to block the elderly and Veterans from voting. Black Panthers alone blocked them last election","commenter_a":"Yes , with all my heart, since I can't help him with money...I wish him good luck..","post_message":"He truly does want to make our country great again. Let's show him we stand behind him. Do you support Donald Trump?"},{"comment_id":"10153196622799753","commenter_b":"FUCK U CUNT.......","commenter_a":"She committed suicide now let it go.","post_message":"Do you think Sandra Bland was murdered?"},{"comment_id":"10153371491386336","commenter_b":"Not American and horrible woman","commenter_a":"Mother Teresa.","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"10153330396398812","commenter_b":"I was just about to say- and watch all the females flock to this rich young single male Hahaha","commenter_a":"@username i actually think I'm in love","post_message":"This CEO says executive pay is \"out of whack.\" So, he's going to start earning $70,000, like many of his employees: @webpagelink"}]
