[{"comment_id":"10155983890750354","commenter_b":"Yea I enslaved your lazy asses. That's the only way to get you to earn your keep.","commenter_a":"Agreed. Kill us all and then who will pay for your entitlements.","post_message":"“You mother-f**ckers...came and stole us from Africa and put us in chains and murdered us for over 400 years, so yeah, you do need to die.\""},{"comment_id":"10153263682739342","commenter_b":"Bill I don't want white people dead I want bush dead","commenter_a":"Good now hang him","post_message":"Former President George W. Bush surprised a crowd at a Dallas courthouse Wednesday when he appeared for jury duty."},{"comment_id":"2196085043950203","commenter_b":"When is she moving. Shut her up","commenter_a":"She needs ducktape","post_message":"The Left in America is unhinged: why is this woman on TV?"},{"comment_id":"10153482045808984","commenter_b":"She is a nut","commenter_a":"I would hate to have lived under her roof , she is not fit to be president. Or anything else.","post_message":"Hillary Clinton is known for her liberal view on just about every topic she chooses to sink her teeth into. And looking at this, her next move might be to include children in her agenda...  Do you think Hillary needs to be stopped?"},{"comment_id":"10154593126179614","commenter_b":"Kassandra Alvarez","commenter_a":"Women beater no mercy for him","post_message":"Update: Chris Brown has been transported to downtown Los Angeles where he is expected to be arrested on suspicion of assault with a deadly weapon.   The singer initially refused to come outside and was not allowing police into his home, an LAPD official said."},{"comment_id":"10155515421201509","commenter_b":"That woman is the devil incarnated in a human body.","commenter_a":"Change profile pic to RED to show your support of TRUMP/PENCE","post_message":"\"I will not defend or endorse @realDonaldTrump, but I am voting for him. HRC is that bad. HRC is bad for the USA\" the House Oversight Committee chairman tweeted."},{"comment_id":"10153909569808717","commenter_b":"Horrible! That poor man and his patient! Dam it!!!! This IS disgusting!","commenter_a":"The cop should be fired and imprisoned","post_message":"The caretaker was trying to get his patient back to a facility from where he had wandered: @webpagelink"}]
