[{"comment_id":"10152918950086336","commenter_b":"What a doll!","commenter_a":"What a cutie and smart too!","post_message":"An incredibly brave 4-year-old girl is being credited with saving her pregnant mother who suffered a seizure and couldn't reach the phone."},{"comment_id":"10152797801290671","commenter_b":"You should leave this planet! Your unreal.","commenter_a":"Looks like she's the one on the control on causing a riot","post_message":"Have you seen this video? A woman in Baltimore was caught on tape hitting a young man, believed to be her son, after catching him participating in the riots. About the incident, Baltimore's police chief said: \"...I wish I had more parents [like her] that took charge of their kids out there tonight.\""},{"comment_id":"1123485461004965","commenter_b":"I like how Jeffery Nichols is the expert on how Women get pleasure. Don't ever believe what Women say lol.","commenter_a":"The correct position is penis in vagina. #savedyouaclick","post_message":"Size has nothing to do with it. (via HuffPost Canada Living)"},{"comment_id":"10156188886135354","commenter_b":"Suzanne, you're a dumb bitch. Shut the fuck up","commenter_a":"Scott walker Mexican Americans legals are against illegals we are with DonaldTrump not because we are Mexicans but this is our country n our children need a better America not free loader hard working for a better America since 1800 hundreds my family been hereover 200 hundreds years we love America we have to be great again my decision n my family DonaldTrump is the great America we need","post_message":"Scott Walker calls for a “limited number of candidates who can offer a positive conservative alternative to the current front-runner.”"},{"comment_id":"1796249287363379","commenter_b":"Khloe would put this midget bitch on blast.","commenter_a":"So what","post_message":"She really don't like the Kardashians. #WSHH"},{"comment_id":"1720045178285132","commenter_b":"She didn't make it running for president what makes her think she can do it for VP","commenter_a":"SHUT UP","post_message":"Donald Trump would be \"shellacked\" in a general election showdown with Democrat Hillary Clinton, Carly Fiorina said after being named Ted Cruz's running mate."},{"comment_id":"10154230629253854","commenter_b":"trump will take her down,no one will take orders from a lier.","commenter_a":"Go make cookies Hillary.","post_message":"Hillary Clinton Orders Liberal Media to Get Tough on Trump (VIDEO)"}]
