[{"comment_id":"10153268434242061","commenter_b":"we're proving it as we speak. record rainfall here in texas and it's still not over. weather is weather, period.","commenter_a":"Kevin Michael Wahler","post_message":"This is Buffalo in 2014 and 2015. First time the city has had no measurable snow in 116 years."},{"comment_id":"1070322423019079","commenter_b":"She will drag him down.","commenter_a":"I really thought she'd go Cruz. Kinda disappointed. BUT, if Trump or Cruz is the nominee, I can vote for either without holding my nose.","post_message":""},{"comment_id":"1016384461715898","commenter_b":"So stop your judgemental whining bitch","commenter_a":"Sorry mice, but as someone with crohns I fully support this research.","post_message":"Researchers have engineered small intestinal tissue from human cells, and when placed in mice, the transplants were able to digest and absorb like the real thing."},{"comment_id":"1335655576501194","commenter_b":"Omg this little girl does need someone to beat her ass. Khloe can do it lol","commenter_a":"This lil girl is trash shame on her people need to stop giving her 5 minutes of fame","post_message":"She's calling out Kylie Jenner!  #WSHH #CatchMeOutside #KylieJenner"},{"comment_id":"10154728095336336","commenter_b":"If it was a girl ,she may have gone home with a hook up","commenter_a":"This is awesome! I would eat at Original Joes if they had one in my town! Kudos to the woman who chose to get a ride home instead of driving!","post_message":"After deciding to take an Uber home, she returned to her car the next morning and found quite the surprise."},{"comment_id":"10153889787166337","commenter_b":"This sucks this is such a good show","commenter_a":"Not happy! Love the show! Can they not find a replacement for Molly? Your messing with my Monday and I don't like Supergirl.","post_message":"CANCELED? Sad news for Melissa McCarthy and Mike & Molly fans..."},{"comment_id":"10153003498236051","commenter_b":"He can be somebodys bitch in jail!","commenter_a":"Hang the SOB!","post_message":"This guy picked up a big concrete block and threw it. It landed right on a 7-month-old girl's head."}]
