[{"comment_id":"1039031896153505","commenter_b":"How many immigrants do you personally know? I'm guessing none","commenter_a":"Every one of you idiots came from immigrants","post_message":"The immigrant population in the U.S. is more than 4 TIMES what it was in 1970."},{"comment_id":"10152812861587507","commenter_b":"Tell us who those democrats are that WANT war????","commenter_a":"God supports hate , hate wins wars , and Democratic elections .","post_message":"Army of God? 6 Modern-Day Christian Terrorist Groups You Never Hear About"},{"comment_id":"1194058434020542","commenter_b":"Coulda, woulda, probably shoulda.","commenter_a":"Thank you, Bernie Sanders for finally bringing unity to the Democratic Party!","post_message":"This moved us to tears... what a moment!"},{"comment_id":"10154060235711336","commenter_b":"Refuse to have hearings on any potential candidate until after the election.","commenter_a":"Quit following this piece of trash. Go back to Cuba where you came from.","post_message":"“We risk losing our basic constitutional rights with one more liberal justice on the court.” Sen. Ted Cruz reacted to the passing of Supreme Court Justice Antonin Scalia, saying this loss “underscores the stakes of this election.” Do you agree? @webpagelink"},{"comment_id":"1397503370290352","commenter_b":"Shellie","commenter_a":"Hahahaha fool","post_message":"Absolutely Hilarious... Spread this everywhere!"},{"comment_id":"10152886398966378","commenter_b":"She makes me sick!!!!! And look at her with the big smile on her face,I'd like to smack the sh-- out of her!!!!! Loose your license!!!!","commenter_a":"Put an arrow through her head!","post_message":"NEW DEVELOPMENT: The case of a veterinarian fired over a Facebook post of a cat with an arrow through its head is heading to the DA for charges."},{"comment_id":"10153822220001162","commenter_b":"She needs to die a horrible death","commenter_a":"Her parents must be very proud of how their daughter turned out.","post_message":"BUSTED: The \"Baby Doll\" drug lord, Ana Marie Hernandez, is arrested in Mexico for allegedly running a cocaine pipeline to Chicago --> @webpagelink"}]
