[{"comment_id":"10153391178593132","commenter_b":"And there's that mentality, \"if you're white you can't have an opinion.\" Yet we're the racist ones right? You do know every time you say that you shame someone of color who is dignified and intelligent, because they get lumped in with the likes of you.","commenter_a":"I don't like playing the race card!! But this is proof!!! Wow!! If she was Latin or a African American person! She wouldn't get off so easily! They shoot to kill us... Jt saying","post_message":"Ouyang told authorities that her behavior was a cry for help."},{"comment_id":"10154167208567235","commenter_b":"@username pull the covers over your head !","commenter_a":"An apology? Are you kidding? How about publicly embarrassing the asshole who singled this man out? \"Land of the free\" my ass. More like \"police state of fear\". This is disgusting. What stereotyping trash people have become.","post_message":"“She kept staring at me and I didn’t know what was wrong,” he explained. “Then I realized what was happening and I just was thinking ‘I hope she’s not reporting me.’”"},{"comment_id":"1445788068782419","commenter_b":"If that bitch wins it will not be USA any more cause she will screw it over and over. Immigrants will take over.","commenter_a":"Never Hillary","post_message":"ELECTION POLL! Who should win the 2016 Presidential election?  LIKE Qpolitical for the results."},{"comment_id":"1867582453468544","commenter_b":"Stupid bitch","commenter_a":"you make it like i did , hard work bitch , no hand outs","post_message":"One of the co-founders of Black Lives Matter just said that \"white folks\" need to \"sacrifice\" THIS for her movement... this is an outrage.  America needs to know the goals of this movement... they're not going to like this."},{"comment_id":"10152902010080950","commenter_b":"I am sick and tired of these calls. I get them all the time on my business phone and my unlisted home phone. Especially Google. They are one of the worst.","commenter_a":"You let them know not to call you again usually by hitting 3 but it doesn't matter as they'll call you again using another number. Most are spoofed numbers. I had my own phone number come up on Caller ID one time! there is a site that you can check out numbers, www.800notes.com to let others know about the callers but the telemarketers don't care about that site. I see a lot of people on there saying to \"Stop calling me!\" yet don't leave their number. Yes, I'm tired of the \"Lower Your Credit Card Interest\" or letting me know about a topical pain ointment. Be aware of those calling saying that they are the IRS or police telling you to pay up using a pre-paid debit card. Callers also try to tell you that your computer has issues and that they are from \"Windows\", not Microsoft. I mess with ...","post_message":"\"If [phone companies] came out with an ad, 'We're going to block robocalls,' I mean, I don't think they could handle the business they would get,\" Missouri Democratic Sen. Claire McCaskill predicted."},{"comment_id":"918281018215139","commenter_b":"All depends on how many illegals are allowed to vote!","commenter_a":"Nobody","post_message":"We’re now a little more than a year away from the 2016 presidential election and Hillary Rodham Clinton, long-time Democratic front-runner, has set her sights on the Oval Office. Who in the potential Republican field can beat her? Take our poll. @webpagelink"},{"comment_id":"10153764783192235","commenter_b":"Right on!!! Most religious women are thought of as breeders. According to religion they were put on this Earth to procreate and nothing else.","commenter_a":"They're not moms, they're breeders. If they were moms, they'd be in favor of children having loving homes instead of languishing in foster care. If they were moms, they'd have been doing what these guys are doing.","post_message":"This little girl is awesome."}]
