[{"comment_id":"1260826810599396","commenter_b":"Fuck her","commenter_a":"Carla A. Auguste Imani Rice Qiana Lewis Shequla Mason @username","post_message":"For everyone who hates Sallie Mae..."},{"comment_id":"10153984611959614","commenter_b":"Walk in front of my car. Karma will get u","commenter_a":"You see how faithful this poor dog is his master was going to kill him.My brother told me one time as he was coming home from work.He saw a little dog on the road this truck purposely hit that little dog and killed him.What kind of animals do we have on the roads.I guess it speaks for it self","post_message":"A heartless driver shoved a dog out of an SUV, then sped away as the abandoned pet desperately scrambled to get back in.   The dog was struck by another vehicle as it chased after the driver on a Long Island road. Incredibly, the canine survived.   Suffolk County SPCA is offering a reward to find the person who abandoned the dog. The driver's vehicle is described only as a dark green, early 2000s Jeep Cherokee."},{"comment_id":"790486571080388","commenter_b":"Shut up!","commenter_a":"BUSH IS A JUVENILE WHO WORKS FOR THE BUSHES----NO MORE BUSHES---2 tooooooooooo many---TAKE YOUR MILLIONS AND FALSE POLICIES ELSEWHERE-----We do not want another IRAQ!!! and then be left hanging out to dry like your brother did-----VOTING TRUMP ---","post_message":"Question from Cameron, a 5th grader in New Hampshire: What are the top 3 things you want to accomplish in your first term?  Watch to hear my answer:"},{"comment_id":"10153398198117377","commenter_b":"Trump will never win. A vote for trump is a vote for Hillary..","commenter_a":"why wasn't Priebus fired after Obama won re-election? It was unreal that Obama wins re-election and the RNC looks the other way. Priebus will be gone after Trump becomes President.","post_message":"Reince Priebus is an amateur and lightweight who has been a 'disaster' as chairman of the Republican National Committee, says Christopher Ruddy, CEO of Newsmax. “We never would've been in the situation we're in today,” if the RNC had a strong leader Ruddy told Newsmax TV. Read the full story: @webpagelink"},{"comment_id":"10153383091468984","commenter_b":"If her mouth is moving she is lieing.","commenter_a":"She will say and do anything to get back in the White House but she really belongs in jail","post_message":"I can't believe she tried to pass this off as fact. Even Bill has to be shaking his head about this one...  Do you think Hillary has a problem being honest?"},{"comment_id":"10155581523315192","commenter_b":"Girl should be held responsible for her actions!!!","commenter_a":"Not news.","post_message":"This came to light when a mom received a nude picture of her daughter in a text message:"},{"comment_id":"1192837800775695","commenter_b":"'@username talk about my mother bitch see what happens.","commenter_a":"No Obama, kiss our ass traitor!","post_message":"Not sure what he thought was going to happen when he started with the name calling, but Obama just gave him a political middle finger."}]
