[{"comment_id":"10154414773758279","commenter_b":"'@username what makes you think that? Drones ARE killing civilians. Listen to the video again.","commenter_a":"A few more of this resignations and Obama would be forced to admit that he is on the immoral side of history. This could be an effective form of civil disobedience.","post_message":"Watch: U.S. Army Reserve Chaplain Capt. Chris Antal reads his resignation letter to President Obama."},{"comment_id":"1714479032139903","commenter_b":"Omg","commenter_a":"Amy I want a kangaroo","post_message":"Meet Jimmy, the baby therapy kangaroo! (Footage via @webpagelink"},{"comment_id":"10153310876381770","commenter_b":"'@username right lol these idiots.","commenter_a":"Even as a Republican voter, I believe that we don't need another Bush in the White House.","post_message":"Jeb Bush is suspending his campaign for the Republican presidential nomination following a dismal performance in the South Carolina primary."},{"comment_id":"1223281327711322","commenter_b":"PUT HER IN JAIL.","commenter_a":"They couldn't vote for her if she was in prison where she belongs America needs JUSTICE","post_message":"Read WHY!! @webpagelink"},{"comment_id":"1224050534299847","commenter_b":"Give her hell","commenter_a":"If this really occurred, the person should be discharged from Military Service.","post_message":"How sad is it that protesting the National Anthem has even extended to here?"},{"comment_id":"10153249048488352","commenter_b":"Pure evil heartless bitch","commenter_a":"The same thing should happen to her no doubt about it","post_message":"Texas woman, 26, found guilty of suffocating fiancé's two-year-old daughter to death using duct tape after he broke up with her"},{"comment_id":"10152634683050779","commenter_b":"Could be great, i hope so.","commenter_a":"Woohoo!!","post_message":"In a stunning announcement today, Blur have revealed plans to release their first new album in over a dozen years, titled 'The Magic Whip.' UPDATE: Click through to listen to the new song 'Go Out' and see the track list for the album."}]
