[{"comment_id":"10153706337066694","commenter_b":"Point out the sarcasm in your original statement. You SUCK at humor AND sarcasm.","commenter_a":"Yes, because we should assume \"diets\" were a thing because bitches could bake bread....","post_message":"Deal with it, paleo dieters."},{"comment_id":"10158044327420354","commenter_b":"Yes then a finger dipped in purple dye.....lol","commenter_a":"Funny how these so-called \"errors and glitches\" always favor the democrats. Personally, I used a paper ballot.","post_message":"***BREAKING***"},{"comment_id":"1786615071570542","commenter_b":"Send them to Cuba , please. We do not want them.","commenter_a":"We dont really care what you think John Legend!! Why dont you, Colin, Beyonce, Kanye, Will & Barbara & all the other negative so-called celebrities move to Canada or Cuba & give us Americans a friggin break!!","post_message":"Singer John Legend also tweeted that the Star Spangled Banner is \"weak.\" @webpagelink"},{"comment_id":"1065756060184114","commenter_b":"Scums they are.","commenter_a":"So not only do Republicans want to send our children to war while Bernie wants to send them to college, they now want our soldiers to suffer longer so they can continue their attempts to bash Obama and destroy our great country. These Republicans need to be put in a POW camp until after the election. Scum of the Earth!","post_message":"This is absolutely disgraceful."},{"comment_id":"995597563869829","commenter_b":"@username you are free to get the hell out","commenter_a":"Nobody takes Huff po seriously . I read it to see what liberal homos think.","post_message":"Should news sites cover Donald Trump as politics or entertainment?"},{"comment_id":"10153126746034071","commenter_b":"Girls, to get ahead, bare some skin. No lots of skin, get u some fillers and marry rich.","commenter_a":"Now imagine what Kim would say in 2020","post_message":"Michelle Obama had a powerful message for girls this week."},{"comment_id":"1161299523890076","commenter_b":"overly politically correct, nail on the head!","commenter_a":"he offered no defense...merely doubled down","post_message":"\"I think the big problem this country has is being politically correct. I've been challenged by so many people and I don't frankly have time for total political correctness and to be honest with you this country doesn't have time either.\""}]
