[{"comment_id":"1001470336557869","commenter_b":"HaHaHa ROFL at her.","commenter_a":"And she is the Dean at a University? Sad state of mind and then you combine that with putting her in the role of teaching! Are we the people paying for that woman's salary?","post_message":"WOW this lady...shamelessly LIED about her entire encounter with the Police Officers..and here's the proof! What a fool."},{"comment_id":"10156175589090354","commenter_b":"Arrogant hateful ole hens that arent worth the waste of time!!","commenter_a":"Liver Transplant Recipient of 4 1/2 years. The Doctors saved my life in surgery but the Nurses kept me alive and watched over me and I would not be here without them. Bless them all.","post_message":"The #NursesUnite movement is mobilizing against liberal co-hosts of \"The View\" Joy Behar and Michelle Collins.   But now, new arrogant and elitist behind-the-scenes comments are coming to light and sparking further uproar with nurses across America..."},{"comment_id":"10152641754716367","commenter_b":"Yes she is!!! She wears Spanx.","commenter_a":"Mucho baggae...g","post_message":"The Hillary Clinton email controversy is a reminder of one inescapable fact: She comes with baggage."},{"comment_id":"906009439519420","commenter_b":"Sure, give 'em free food, free healthcare, free education, a driver's license, free housing -- am I missing anything. We can take in millions of refugees. Why not? Just because we're broke and have to borrow the money from China means nothing. Just cut the military and give the savings to the refugees. Bring in more and more. So what if some of them are terrorists who will kill and blow us up. Obama says they are like the Mayflower Pilgrims. Afterall, we're transforming America, right?","commenter_a":"fight it as long as possible, they don't deserve food stamps.","post_message":"Here it comes, gang..."},{"comment_id":"10153061707381051","commenter_b":"Stupid bitch needs her face slapped until she falls out..","commenter_a":"She is no mother, glad to see someone finally called the police on one of these child abusers rather then just posting it.","post_message":"Onlookers were genuinely shocked when they saw how this teen mom was treating her child."},{"comment_id":"10158086481670389","commenter_b":"Good! She needed ti be fired!","commenter_a":"Glad that person was fired.","post_message":"In Case You Missed It"},{"comment_id":"10153238831311051","commenter_b":"Typical Americans always thinking they are better than everyone. Have you simpletons ever stopped think why these immigrants come to America? A lot of these Hispanics come to this country for better lives and find work, work that half these lazy ass welfare sucking Americans won't do.","commenter_a":"We need to deport Trump","post_message":"Do you agree or disagree with Donald Trump?"}]
