[{"comment_id":"1045198175503230","commenter_b":"BS, keep our money home to help Americans who need it.","commenter_a":"What the??","post_message":"Obama pledged millions of dollars to fight climate change abroad. And it comes straight from YOUR pocket!"},{"comment_id":"10152958677570927","commenter_b":"If it was that bad! Why isn't the border fence leaning toward the South! Someone will gladly take your number!","commenter_a":"Another stupid comment from the Peanut gallery","post_message":""},{"comment_id":"10153546478451337","commenter_b":"Bitch? Way to completely destroy everything no makeup selfies are meant to promote","commenter_a":"that bitch is bad without makeup real talk","post_message":"PERFECT RESPONSE: Watch Lana - WWE perfectly shut down her Instagram trolls..."},{"comment_id":"10152705151371234","commenter_b":"He has a temperament ill suited to public office.","commenter_a":"That's because he didn't bring me KandyKakes, a cheese hoagie, and soft pretzels. Serves him right, loser.","post_message":"\"I think the trip was an utter failure... It should have been a trip of 'good behavior' instead of showing a short fuse,\" said a presidential historian at Rice University of Governor Chris Christie's trip to the U.K."},{"comment_id":"10152983591416491","commenter_b":"Lena did it for 10 yrs. She's gross!!","commenter_a":"Lena was seven. Not 14 or 15. And Duggar raped his own sisters many times over many years. And who the hell is Palin? An irrelevant person seeking relevance.","post_message":"“I’m sickened that the media gives their chosen ones a pass for any behavior as long as they share their left-wing politics.”"},{"comment_id":"889771817799697","commenter_b":"Stupid. All this shows is the truth ... guns don't kill ... criminals kill.","commenter_a":"How many of the guns featured in the film were bought by good law abiding citizens in a legal way. Hmmmm I'm going with NONE!!!","post_message":"These people, who claim to have innocent people's best interest at heart, are sicker than the people in their disgusting film. THEY are the gun crazies."},{"comment_id":"10153239564994369","commenter_b":"when you can't beat them, copy them!","commenter_a":"Made in china","post_message":"This is Samsung's newest phone"}]
