[{"comment_id":"10152557805834071","commenter_b":"Exactly in one game... Ooooh make shift O line because no one else in the league had injuries along their oline and threw for 4000 yards right. With those 4000 passing yards how many tds did he throw???","commenter_a":"Wilson = average Qb with any other team besides the shehawk's...","post_message":"He keeps improving."},{"comment_id":"1736517199968208","commenter_b":"go figure a REAL SHARK swimming the the ocean trying to grab a yummy meal.....SFPeopls","commenter_a":"Oh please! 1,000,000+ to 1 he'd do anything. If he wanted to harm them...he could have done it in seconds. Relax!","post_message":"Terrifying video shows a shark swimming metres away from people at Hollywood Beach in Florida, prompting people to flee to safety.   Credit: Caters TV"},{"comment_id":"10153204502459087","commenter_b":"Mar G Her go back to mexico. this country is for LEGAL immigrants who want to be Americans.","commenter_a":"Trump is for all Americans, whether you're democrat or republican. Go Trump 2016!","post_message":"GOP front-runner Donald J. Trump continues to pull away from the rest of the Republican pack, drawing 33 percent support in the latest Washington Post/ABC News poll."},{"comment_id":"1237520902934076","commenter_b":"She's a criminal, with really bad hair.","commenter_a":"She did what she was hired to do.","post_message":"The American people deserve better. The DNC and Hillary Rotten Clinton rigged the system and completely ignored what the people wanted! They are so, SO corrupt!"},{"comment_id":"1176917475682056","commenter_b":"Well, we can let them kill Americans starting with you!","commenter_a":"I am for the mass genocide of assholes.","post_message":"A bunch of paranoid gun nuts on a mission to kill Muslims, at the advice of a presidential candidate. Is there no line we won't cross anymore?"},{"comment_id":"1741105056106659","commenter_b":"BWAHAHAH AND THAT'S WHAT MAKES AMERICA GREAT!","commenter_a":"Carla Stovall Jeanne' Cleopatra Thompson Anthony Stovall BLOOP!!!!","post_message":"TRUTH: Kaepernick's critics are failing to see the larger point. Roland Martin nailed it with this one.  Shared by Occupy Democrats, LIKE our page for more. Video from MSNBC."},{"comment_id":"807543922769518","commenter_b":"SHOWS HOW GHETTO AND STUPID SHE IS","commenter_a":"Uneducated today's schooling.","post_message":"Racist Black Girl Assaults White Students For Enslaving Her Ancestors [VIDEO].  This is unbelievable. Where's the media outrage?  Do you think this is a hate crime?"}]
