[{"comment_id":"10153917559886770","commenter_b":"Nah, her girl fans drink boiler-makers.","commenter_a":"Amy Schumer fans do not drink beer. They drink fruity drinks with umbrellas in them. And her female fans drink those, too.","post_message":"This doesn't sound good...."},{"comment_id":"426004474226175","commenter_b":"Oh, and fuck Conservatives. They're the ones who started anti-gun laws. Reagan and the NRA (racist hypocrites) got restrictions for firearms in California in response to the Black Panthers having a PEACEFUL open-carry demonstration. If Obama did the same thing to OPEN CARRY California, you'd probably be screaming for his head on a pike.","commenter_a":"Killing people sanctioned murder to satisfy blood lust and a wanting for revenge. Sounds pretty medieval and 3rd world to me.","post_message":"We traveled the world to ask people about the the death penalty."},{"comment_id":"10152956106239877","commenter_b":"It always existed except my dark skinned Sista women had it worse.","commenter_a":"True statement Colorism exist","post_message":"'Empire' Actress Grace Gealey: 'I Was Discriminated Against For Being Light-Skinned.' Read more on her revealing statements here.  Grio fam, sound off with your thoughts on all she had to say."},{"comment_id":"1007362382702564","commenter_b":"That's uncle Ernie sitting on the eggs","commenter_a":"'@username get off of here!","post_message":"ONE EGG IS HATCHING! Eaglet Watch 2016 continues as Harriet and her mate M15 wait for their two eaglets to hatch. One egg began to crack yesterday! Fingers crossed we get an eaglet today!   Once an eagle egg begins to crack, it can take 12 to 48 hours for the eaglet to fully hatch.   Live video: Southwest Florida Eagle Cam MORE: @webpagelink"},{"comment_id":"10153880713234753","commenter_b":"Do better job then Hillary","commenter_a":"Vote trump","post_message":"A Latino Trump supporter in California claims it’s a lot more difficult to publicly support Donald Trump than to come out as gay. Juan Hernandez, who is a member of the Log Cab Republicans, a gay conservative group, indicated that he was leaving the Trump rally in San Jose, California, on June 2, when a mob of violent Trump protesters attacked him, breaking his nose in the process. A friend was similarly set upon by the assailants, some of whom carried the Mexican flag and were burning the... @webpagelink"},{"comment_id":"10153149110684877","commenter_b":"Yes, she should be arrested. This type of crap gets people killed.","commenter_a":"She deserves prison time.","post_message":"Woman claims she was attacked by black men, allegedly faked injuries with makeup. She TRIED it! You have to see the pics for yourself.   Grio fam, should authorities press charges if it's proven she faked her claims? Sound off below!"},{"comment_id":"10154028893376051","commenter_b":"He is going to build a wall. Send back the goobacks and bomb Isis. Has my vote. If he triples the debt the libtards shouldnt mind. They have no concept of paying bills.","commenter_a":"Does that mean that Trump will put the country in more debt than it has been before him? Does it mean that Trump will instigate a covert plan to arm terrorist nations? Why exactly is that a good thing?","post_message":"Brexit leader Nigel Farage says Donald Trump reminds him of a modern-day Ronald Reagan. Will you be supporting Trump this November?"}]
