[{"comment_id":"906985682657621","commenter_b":"She didn't come up with it! If she tries to patent it Nicki Minaj will sue her. Nicki said SHE came up with the word. SMH, that word has been around for 20 years.","commenter_a":"She needs to get a copyright or a patent for the word because people these days will try their best to steal your joy! IJS","post_message":"How Kayla Newman Created “On Fleek” While Her Mom Shopped At Burlington @webpagelink"},{"comment_id":"1152030998150262","commenter_b":"You wouldn't believe it even if it was released. You'd say it was staged. Let the girl rip.","commenter_a":"How about releasing ALL the footage of her before , DURING , and AFTER her untimely murder!!! Its easy to let America view when she was alive. BS!!","post_message":"\"This video should demonstrate that people who are out there going through a lot of trouble to spread lies and mis-truths on Waller County — we are not going to stand idly by and allow that to happen.\""},{"comment_id":"1156989694324963","commenter_b":"Fuk that NIG GERR BITCH","commenter_a":"SHE IS A HORRIBLE HUMAN PERIOD","post_message":"Michelle Obama Banned Valentines Day In Schools She can't take love away from America's children. Do you think she is a horrible first lady?"},{"comment_id":"10154003076373812","commenter_b":"Actually women STFU if you can't take the heat dont attack....he has just as much right as her","commenter_a":"When it comes to women, Donald should just STFU.","post_message":"Donald Trump ramps up his attacks against Hillary Clinton and former Pres. Bill Clinton: \"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!\""},{"comment_id":"1879681238919909","commenter_b":"And these kind of people are what supported Hillary. No concern for the law, just like her.","commenter_a":"Animals.","post_message":"“What’s happening to America?” said David Wilcox, as he showed his wounds inflicted by the mob. “You’re supposed to be able to vote in peace! It’s supposed to be part of our democracy. And what happened is, I vote for somebody, and I get beaten, robbed, and my car stolen, and I have no way of getting my wife to and from work safe anymore,” he told the Chicago Tribune’s news crew."},{"comment_id":"10152912093186749","commenter_b":"PUKE.","commenter_a":"PUKE","post_message":"This Valentine's Day, Nicholas and Dylan are finally able to celebrate their legal marriage. This is progress. @webpagelink"},{"comment_id":"10153394425273352","commenter_b":"What a racist, ignorant bitch!! THE MAN WAS BLACK!!!!! Smh","commenter_a":"If this was a Black person who did this it would not be the same these white people make there own law when they break the law .what a Shame.you all get away from man ,But Y'ALL Didn't get away from God pls.","post_message":"Mother breaks down in court after her ex-husband is cleared of strangling to death their 4-year-old son because he was SLEEPWALKING when he did it"}]
