[{"comment_id":"10154273647523812","commenter_b":"Hell no!!!!","commenter_a":"@username so no beach this weekend","post_message":"Aerial video shows large school of sharks seen in Fort Lauderdale, Florida."},{"comment_id":"1475217105828968","commenter_b":"You do not know what you are talking about! If woman cannot afford birth control then there will be a definate increase in unwanted pregnancy and ultimately more abortions than ever. Its a simple enough eqausion, NO PLANNED PARENTHOOD=NO AFFORDABLE BIRTH CONTROL=MORE ABORTIONS!","commenter_a":"Will never agree stay quite,agree or be agreeable to finance or support an organization that capitalizes on the murder of innocent children. And an organization that preys on the vulnerability of women in a bad situation, that is not women's rights but profit of murderers. It needs to be called what it is. Their profits and funding comes via. death and guilt not education.","post_message":""},{"comment_id":"903840716398977","commenter_b":"Nestle can suck my balls","commenter_a":"Rick Rule","post_message":""},{"comment_id":"10154330734419087","commenter_b":"Shes a half wit scrub striving for brownie points. Bitch needs to go home and make a peanut butter sandwich and shut the fuck up, we ain't got her candy.","commenter_a":"@username not enough money or incentive","post_message":"#BREAKING: The Green Party is dropping the case spearheaded by Jill Stein to request a recount of the election results in Pennsylvania, citing an inability to pay a $1 million bond required by the court."},{"comment_id":"1689272294667942","commenter_b":"@username Bernie raises money for the party too! You didn't hear that right at all. None of Hillary's money goes to Bernie, that would be ridiculously counter productive. Duh! Both Bernie, and Hillary do raise funds for the rest of the Democratic party. This is done, to insure more Democrats get elected. That way we won't have another lame duck president. Bernie still as a very good chance, and with all the controversy, Hillary, and supporters, may have just crossed the line! Don't count chickens before they are hatched! Be ready to vote blue, no matter who the nominee. On that note, I'm voting for Bernie, it's the right choice for the majority of Americans. The wealthy don't mean a damn thing to me, as most of them feel the same about us.","commenter_a":"Wise words my ass. How can you even sit there and tell us to join together with the blatant fuckery Shillary Clinton is doing. The voter suppression. Not releasing her transcripts. Her lies. She's a corporate slug that doesn't even deserve to be in office or the government. She's as bad as the republicans. The worst part is she would probably lose to the republican nominee and y'all keep trying to shove her down our throat. What the hell are we voting for if the DNC is just gonna cheat us. Bernie or bust.","post_message":"Wise words from Robert Reich. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"967357503323727","commenter_b":"This sexist pig is just pissed because two women probably did better than he did. Tell this little ass to pick up his toys and go the hell home! Quit whining !","commenter_a":"If the truth be known, men are the weaker sex. Most of the genetic information is on the X chromosome and women have 2 Xs, men only one X. The Y chromosome has little genetic information, besides the male sex gene. Consequently, women are genetically stronger in many way ways and live longer. In many European countries women do a lot of the heavy work in the fields. In the US women are treated as somehow inferior, and men want to believe that they are \"weaker,\" but it is not necessarily so.","post_message":"This Republican misogynist is fuming that these two women passed the same Army Ranger course he did."},{"comment_id":"695871927257910","commenter_b":"Josiah Meek","commenter_a":"Laurie Fink","post_message":"DESK GOALS. @webpagelink"}]
