[{"comment_id":"10157322113810354","commenter_b":"She is the spitting image of miss piggy. Shut up bitch","commenter_a":"@username keep this irrelevant fat slam pig off my feed, k?","post_message":"Amy Schumer: you know what Americans are \"sickened\" by? We dumb, poor, working class folk are \"sickened\" by rich, elitist, Leftist \"celebrities\" who can afford to live in million dollar homes with high-end security and bodyguards lecturing us for protecting our families and children. Sorry, Amy Schumer, that we can't afford to live in a gated mansion with state of the art alarm systems. But your pal Obama destroyed the American economy. So spare us the lectures!"},{"comment_id":"10153183843753188","commenter_b":"Boy if they can do all that in Mexico why are they crossing our borders","commenter_a":"i just came home to Seattle from 10 days in Mexico and it made me think. I think it would be better to be in a country like Mexico if the world went crazy. Those people know how to survive on nothing because they have done it all their lives. They know what to do when the lights go out... they know how to grow food and take care of themselves. I can't even imagine what Seattle would be like if this area was thrown into the same poverty level as Mexico... it would be a mad house!!!","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"1716998008555343","commenter_b":"Me too. Can't concentrate at work","commenter_a":"Sleep in peace. You will be missed.","post_message":"This is what it sounds like when doves cry... #RIPPrince Prince"},{"comment_id":"10152676681972507","commenter_b":"Not to mention that anti-semitic statements are illegal in France.","commenter_a":"In France you pick up 8 year old kids for what they said in school. I don't care how nationalistic you can get over this, this shows the French authorities are massive hypocrites when it comes to 'Freedom of 'Speech.","post_message":"He's 8."},{"comment_id":"10152944029886316","commenter_b":"Well that settles it, she paid $600.00 for that?","commenter_a":"no no","post_message":"In recent days, Hillary forces half a department store to shut down just so she could get a $600 haircut in a luxury salon, even as she refuses to engage the very public she is trying to convince to vote for her for president: @webpagelink"},{"comment_id":"10152959541546519","commenter_b":"But it's totally cool that the white women told the black kids to go back to their Section 8 housing, right? Ugh.","commenter_a":"I truly wish people would read the whole story before commenting. This was one of 2 cops (until backup arrived) who had just been charged by dozens of young adults and teens. He has every right to fear for his safety...AND he has every right to restrain a \"kid\" who is illegally trespassing in a gated community and trying to run every chance she gets.","post_message":"This cop picked the wrong kid to harass and abuse..."},{"comment_id":"10154771677946602","commenter_b":"CB=gotohell!!","commenter_a":"Div 2. LMFAO!! Football is an abomination and now BB is a JOKE. What the HELL happened???","post_message":"For the second game in a row, sophomore Jalen Adams carried the offense. UConn Men's Basketball will play Oregon tomorrow."}]
