[{"comment_id":"1018817644877956","commenter_b":"#STOPHATEANDFEARMONGERING #dumpTrump #VOTEDEMOCRATS","commenter_a":"I have a bet going that Trump declares bankruptcy again after he loses the nomination. I hope he loses everything and all his foreign factories close down. DUMP THE TRUMP DUMP THE TRUMP DUMP THE TRUMP","post_message":"You reap what you sow."},{"comment_id":"10153936558477144","commenter_b":"Oh for f* sake leave your vagina at the door please and REALLY look at her record.","commenter_a":"Clinton is a rich aristocrat white woman, check your privilege please, the only thing that she has in common with other women is a vagina. She was first lady, rising to power off her husband's victories she was lifted up to senator and paid well to do nothing, she then ran for President and lost to another man who then lifted her up to SoS, when she ran that office to the ground she left only to win by the efforts of the media and DNC who have a vested interest in seeing her high office. In doing so ruined the chances of America to regain control of our democracy.","post_message":"“That is how good you have to be if you’re a woman running for president. And she still might lose! To this, the least qualified candidate ever to lurch into the public spotlight and shit on Gold Star moms, while cradling Putin’s sweaty sack.\"- Samantha Bee"},{"comment_id":"682213861917317","commenter_b":"We continue to deport illegals but tgey come back. We need trumps wall","commenter_a":"All traitors MUST be put into jails, All illegals MUST be deported!!! Vote Trump and Reject the evil socialism of crooked Hillary as well as insane and hypocritical Bernie! Think of North Korea and Venezuela! \"The problem with socialism is that eventually you run out of other people's money\" - Margaret Thatcher","post_message":"The protesters in New Mexico were thugs who were flying the Mexican flag. The rally inside was big and beautiful, but outside, criminals!"},{"comment_id":"10154660299872501","commenter_b":"She can work anywhere in these United States.","commenter_a":"So she can be a lawyer not a judge cool.","post_message":"We reached out to Angela Stokes today to ask about her future legal plans. If she responds, we'll add her comments to the story."},{"comment_id":"519848751523867","commenter_b":"Zel Zainoor and Arez Ezman does this help?","commenter_a":"Psyco people now have an excuse to feel normal.","post_message":"Don't you just want to squeeze him?"},{"comment_id":"10153475865743645","commenter_b":"Yes and she is a real b:tch","commenter_a":"Was the gator named karma ?","post_message":"He jumped into a pond to hide from authorities and an alligator attacked him."},{"comment_id":"10153058619121051","commenter_b":"She should go to prison for years and starved on a day bases! She is disgusting!!","commenter_a":"Poor little baby","post_message":"Even the police were stunned that someone would treat a dog like this for no reason."}]
