[{"comment_id":"1571850159771728","commenter_b":"Wish you would replace Pelosi!!!! Sick of her!","commenter_a":"Hopefully she'll endorse the only true Constitutionalist Conservative, Ted Cruz.","post_message":"This campaign was always about citizenship—taking back our country from a political class that only serves the big, the powerful, the wealthy, and the well connected. Election after election, the same empty promises are made and the same poll-tested stump speeches are given, but nothing changes. I've said throughout this campaign that I will not sit down and be quiet. I'm not going to start now. While I suspend my candidacy today, I will continue to travel this country and fight for those Americans who refuse to settle for the way things are and a status quo that no longer works for them. Our Republican Party must fight alongside these Americans as well. We must end crony capitalism by fighting the policies that allow it to flourish. We must fix our festering problems by holding our bloated, inept government bureaucracy accountable. Republicans must stand for conservative principles that lift people ..."},{"comment_id":"10153668516697235","commenter_b":"She said my country...woman your kind is European.","commenter_a":"Have you noticed that that Trump supporters always have that crazed. I just crapped myself look in their eyes.","post_message":"This is NUTS!"},{"comment_id":"10153513064987629","commenter_b":"Put your damn sticker and tongue away woman.","commenter_a":"Wait! Wait! WAIT A GOD DAMN MINUTE HERE! So cops can be wrong or even worse racist liars? Our judicial system can fail at the expense of innocent citizens? I need to take a seat. Bear with me for a second...","post_message":"\"They’re so wrapped up in a different culture than—what I’m trying to say is, the right culture, the better one to pick from.\""},{"comment_id":"10152617466356680","commenter_b":"For those who want to deport, are the GOP taxpayers going to pick up the $50 billion tab? Dems won't because anyone with a brain knows the addition of these people into legal residency will boost our economy.","commenter_a":"Obama, siding with illegals against Americans, yes, Obama DOES NOT LOVE OUR COUNTRY.","post_message":"President Barack Obama is calling out John Boehner for not bringing comprehensive immigration reform up for a vote in the House last year."},{"comment_id":"10155048968076037","commenter_b":"I would be behind him Mr. Knowing it all","commenter_a":"Wikileaks said the emails were a \"leak,\" not a hack. i would like to see some evidence of wrongdoing, before Obama starts WWIII on his way out the door. Why is he effecting ANY major policy changes so close to being out?!?","post_message":"The US will kick out 35 Russian intelligence operatives & shutter 2 Russian compounds."},{"comment_id":"1242270725821978","commenter_b":"#MyBodyMyChoice . Oh get over it men.. you have no right over women... You would never stop abortions.. we will find our own ways.. neener neener.. grow up and realize you don't matter..","commenter_a":"Oh yes, women just can't make these important decisions without a man's assistance and approval. Jeez, what's next, taking away women's right to vote?","post_message":"“I believe one of the breakdowns in our society is that we have excluded the man out of all of these types of decisions,” said the Oklahoma representative who wrote the bill."},{"comment_id":"955239887844766","commenter_b":"Good read. Tells it like it is.","commenter_a":"obama is the biggest pos in this country!","post_message":"I didn't expect THIS!"}]
