[{"comment_id":"10154020746508908","commenter_b":"Malo e :)","commenter_a":"'@username Kristjan Korez","post_message":"500 kilometers On 1 Litre of water: Brazilian man challenges the idea of gas stations."},{"comment_id":"1214141488640014","commenter_b":"See what happens when the Muslim population increases? Get It?","commenter_a":"FYI","post_message":"WOMEN IN FRANCE Fight Back After Muslim Men BAN Them From Sharing Public Spaces [VIDEO]"},{"comment_id":"1007038892685973","commenter_b":"Liar liar","commenter_a":"'@username for President of the United Sates of America, 2016-2024!!","post_message":"Read the texts Hillary sent some friends last night during the GOP debate."},{"comment_id":"10154201387086037","commenter_b":"How many people did Jesus kill? How many sex slaves did Jesus have?","commenter_a":"In the Quran Mohammed said to 'cut off their heads'. That's the Islamic role model. Just be glad that role models Jesus and Gautam Budhha didn't say the same about 'infidels'. There would be even more chaos...","post_message":"'He was brainwashed but we do not know by whom, when or where,' said a family friend."},{"comment_id":"1159279537467495","commenter_b":"The Obama 's are more racist then anyone else Michelle everytime she opens her racist mouth it's all about her give me a break and it's true the other 1st ladies have more class then she will ever have and it has nothing to do with the color of her skin if the whites are so racist he wouldn't have been in office","commenter_a":"I wish she has racism up her back side!!!","post_message":"Michelle Obama Calls Out Military Racism  This Marine Answer Is DEVASTATING!"},{"comment_id":"1270088773057875","commenter_b":"'@username cocain bottles and bitches *","commenter_a":"Let me get a 300$ tip in Christmas I'll spend that shit on cocaine and bitches","post_message":"Faith in humanity restored!  #WSHH"},{"comment_id":"10153765423589170","commenter_b":"'@username you are spot on 100%. You don't allow a foreign entity into your country and let them have an area nor let them 'work it out'. Because that area gets a little bigger then a little bit more before soon they are running the country.","commenter_a":"Rahm assisted his Muslim brother Obama in degrading the police when they did do their job. Now the police are afraid to do their jobs.","post_message":"The irony here is that it's HIS ideology that has cops afraid to do their jobs.  His ilk spent the last eight years calling everyone racists.  Now he has the nerve to complain about the outcome?"}]
