[{"comment_id":"831862046868801","commenter_b":"You're talking about deregulation. A completely deregulated market would allow child labor and would have zero worker protections, environmental protections, etc. They'd still buy government because they don't really want a libertarian free market. They want a \"free\" market that's rigged in their favor; that's where the real money is. You can't really separate capitalism from corporations trying to exert influence over government. It's the nature of the beast. You have to find ways, instead, to make those attempts ineffectual. Starting a business always requires capital... that doesn't mean you have to be rich, per se. \"Big guys\" have economies of scale that make them hard to compete with even when the market is \"free\". It's not impossible to have a monopoly in a free market and it's not impossible (indeed, it's likely) that you'll have collusion and cartel-like behavior. I mean, the government could step in to put a ...","commenter_a":"Wealth inequality isn't a measure of economic health. Wealth inequality is merely a potential for trickle. It's nothing to be afraid of. It's something to embrace and tap into. Let's tap into that with a free market economy. What are we waiting for? @webpagelink","post_message":""},{"comment_id":"10152647999850950","commenter_b":"stupid, stupid girls. can't they read?","commenter_a":"The war on terror is taking our freedoms. The Terrorists are easily winning.","post_message":"A former chief of counterterrorism at the FBI told CBS News that he thinks some young Muslim girls are being lured toward jihad as a way of giving meaning to their lives: \"They are looking for adventure.\""},{"comment_id":"1247830038560637","commenter_b":"Don't care! Neither of these boobs is worth 2 shits under a bird! Garbage on two feet both!","commenter_a":"NEVER WILL BE THE BEST FIRST LADY. GO TRUMP.","post_message":"Will voters care about controversy over Melania's speech?"},{"comment_id":"1013753742085664","commenter_b":"@username Babies suck!","commenter_a":"I used to dislike Clinton... I was uninformed and knew little about her other than what the right wanted me to believe. After some research and learning about all of her work on behalf of minorities, working families, women, and children over the course of her life and seeing her deal with adversity and downright deplorable behavior with strength, class, and grace, I am PROUD to give her my vote and my full support. I'll be voting Democrat down the ballot to ensure not only that she is elected, but that she has a Congress she can work with - not one hell-bent on obstruction. There is a reason she polls so much higher with EDUCATED people. #imwithher","post_message":"For 45 seconds, a drenched Hillary Clinton abandoned her script and let down her guard in Florida: @webpagelink"},{"comment_id":"676035105920401","commenter_b":"they wouldn't be happy with anything they are a bunch of animals and don't want peace all they care about is destruction send them back where they came from give them nothing","commenter_a":"Don't like it go home!","post_message":"Muslim refugees are refusing to go into the shelter, demand they be given apartments. If they are seeking safety from a war zone, they should be happy with a shelter. Do you think this demand is ridiculous?"},{"comment_id":"1074511882569822","commenter_b":"You cared enough to comment","commenter_a":"Needlessly inflammatory and untrue. Time to unlike.","post_message":"Nearly a century later, Einstein has been proved wrong."},{"comment_id":"908022272624161","commenter_b":"How dare they,women please make your votes count!","commenter_a":"I don't understand how any woman can be a republican!","post_message":"Another day, another Republican attack on women. Shame on them.  Read more here: @webpagelink  Image by Occupy Democrats, LIKE out page for more!"}]
