[{"comment_id":"10157648853630389","commenter_b":"I cannot stand this woman! She's an evil individual!","commenter_a":"I think Hillary is in for a very soul awakening! God did not choose and Call a man, Donald J. Trump, to lose! Donald J. Trump, answered God's Call, he did not have to do this! God is still in Control and this is God's Creation, not the Clintons, BHO, Soros, the big bankers, or any government! Look at all of the corruption & evil that has been EXPOSED TO THE LIGHT AND HAS BEEN GOING ON FOR YEARS & YEARS AND GOD KNEW IT!!! Life is like a tapestry, we see the underside, the messy side, but God sees the finished beautiful side and knows the reasoning behind every stitch. We have repented and we have asked God to save this country, ask and it shall be given! Deuteronomy 32:35 'Vengeance is Mine, and retribution, In due time their foot will slip; For the day of their calamity is ...","post_message":""},{"comment_id":"10155365024480354","commenter_b":"Loony witch....","commenter_a":"if you don't like it here LEAVE. There are plenty of non whites that are racists and fat and you seem to ne a racist yourself lady","post_message":"\"All the people who are crunched into the middle of America, the real fat and meat of America, are these racist conservative white people who live on their farms.”"},{"comment_id":"1053937954629059","commenter_b":"Crystal...I'm beyond sick of those trifling girls.","commenter_a":"Who cares???...I'm so sick of B news","post_message":"Un-Clutch Your Pearls: Beyoncé Has Nothing To Do With The Sarah Baartman Project @webpagelink"},{"comment_id":"10153096865294614","commenter_b":"Adorable, precious, blessed by God! What a wonderful father & lucky to have this special little boy in his life! That woman is disgusting & I agree with another comment that she should have her tubes severed forever & never be allowed to have a child, not even adopted!","commenter_a":"Thank you everybody for sharing all the beautiful pictures of your wonderful and special family members, they are truly a blessing on this earth. I work in an Adult Foster Care home and we have cared for Downs Syndrome of all ages. Due to rapid decline in health recently, two of my special guys have left this earth to be angels. I cannot explain the special spark that they put in my heart when I was with them. I will never understand how people can be so heartless. God Bless Leo and his amazing father!","post_message":"After this baby mom abandoned him because he was born with Down syndrome, his father stepped in to raise the son he calls and as a single dad. Leo Forrest was born in Armenia last month. Upon learning of the genetic condition, his mother and her family gave up on the child. They also told Samuel Forest he would no longer be welcome in their home if they decided to keep him, according to a GoFundMe page set up to help Forrest and the baby. Faced with a difficult choice -- his wife or his infant son the new father chose Leo. She has since filed for divorce, he says. Forrest is returning to Auckland, New Zealand, where he is originally from, to raise the baby. Read KTLA story here: @webpagelink"},{"comment_id":"10153362958101955","commenter_b":"I agree. The Barbarians are within.","commenter_a":"Our own government is the biggest terror threat we've ever had.","post_message":"House Intel Committee Chair: US Is at 'Highest Threat Level We Have Ever Faced'..."},{"comment_id":"919328804793264","commenter_b":"These girls have behaved impeccably!!","commenter_a":"As soon as someone denies being racist, the following lines reveal their bigotry.","post_message":"Once again, we are treated to a massive display of Tea Party \"not-racism.\""},{"comment_id":"10152650775565496","commenter_b":"Agreed. They gave that lady not one, but TWO! black eyes. They liked to beat her brains in.","commenter_a":"Why are they out on bond? If I were the D.A. I would be pushing for attempted murder charges.","post_message":"The trio of woman accused in a brutal beating over a squished hamburger were scheduled for court this morning. UPDATE on the case: @webpagelink"}]
