[{"comment_id":"1554819554825337","commenter_b":"i dont have to even listen , i can tell by how stupid she looks","commenter_a":"Lunatic left.","post_message":"This is downright shameful."},{"comment_id":"10153086110919411","commenter_b":"she is a child","commenter_a":"She just got out of jail 2 weeks prior for car theft and now was in another stolen car and tried getting away using the car as a deadly weapon, the cops have no idea who is behind the wheel, it doesn't matter at that point. Dumbass brought it on herself!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154184245291943","commenter_b":"This evil woman needs to fall, through what ever means necessary.","commenter_a":"Oh quit messing with us. Either do it or s t f u!!!","post_message":"With 75 days before voters pick their new president, email revelations are threatening to overtake Hillary Clinton campaign  with WikiLeaks founder Julian Assange hurling another log on an already raging fire with a vow to release  Clinton documents.  In an exclusive interview Wednesday night with Fox News Megyn Kelly, Assange was asked whether new information culled from Clinton emails would be released before the general election: 'Yes, absolutely.  - via Fox News"},{"comment_id":"959675597399526","commenter_b":"Hillary 2016 Hillary 2020","commenter_a":"Hillary!","post_message":"It sounds like voters have already decided who they are going to vote for in the presidential election. Have you?"},{"comment_id":"1867582453468544","commenter_b":"Stupid bitch","commenter_a":"you make it like i did , hard work bitch , no hand outs","post_message":"One of the co-founders of Black Lives Matter just said that 'white folks' need to 'sacrifice' THIS for her movement... this is an outrage.  America needs to know the goals of this movement... they're not going to like this."},{"comment_id":"10152995709171130","commenter_b":"I suggest we send her subservient hormonal ass straight to the Canadian border now!","commenter_a":"Ridiculous! Comment for someone that should know better Ms. CEO.","post_message":"What the..."},{"comment_id":"10153001751980950","commenter_b":"Sarah, please elaborate. Because you've lost me completely.","commenter_a":"Hahahhaha so crazy.... Muslims are peaceful people ..its TERRORIST who are the killers.... And if ya haven't noticed there are white people in ISIS","post_message":"The gun shop owner says he's making changes immediately to 'make America a safer place to live.'"}]
