[{"comment_id":"10152883747411051","commenter_b":"Feel attractive and beautiful? Get out. So a 16 or 18 year old kid gave her that? Sick. Lock her ass up.","commenter_a":"Just wait","post_message":"A teacher who was busted with not one, not two, not three, but four students is now looking at a lot more jail time than she initially realized."},{"comment_id":"10154994816928256","commenter_b":"US tax payers are going to pay for that wall that Trump wants built, no skin off his back, he don't pay taxes. Suckers","commenter_a":"Deficits only matter when Democrats run the show. How long until you learn this very simple truth?","post_message":"Republican leaders would not say how they would prevent the massive project from adding to federal deficits."},{"comment_id":"1709641872647327","commenter_b":"I cannot believe what is happening in this country. From this moment forward, when my wife or daughters-in-law or granddaughters are in the women's room of any public facility, I will guard the door, and woe to the man who tries to enter while they are in there. There will be blood!","commenter_a":"We are full of IDIOTS in America !","post_message":"'There isn any doubt that this law was designed to be DISCRIMINATORY ...'"},{"comment_id":"1168212589885878","commenter_b":"Yikes!","commenter_a":"Ben may be a fair to middling Doctor but he needs a major lesson in history and about 20 years political experience.","post_message":"America deserves better."},{"comment_id":"10152803478324877","commenter_b":"And so are you......","commenter_a":"Cosby is guilty.","post_message":"Malcolm-Jamal Warner Breaks His Silence On The Bill Cosby Rape Allegations. Read what the 'Theo' actor had to say about his TV dad.   Grio fam, is this a fair comparison for him to make? Sound off."},{"comment_id":"537404189787632","commenter_b":"YOU HAVE FORGOTTEN THAT YOU ARE NOTHING MORE THAN AN ACTOR WITH AN OPINION--AND NOT A VERY INTELLIGENT ONE-MAYBE YOU WOULD LIKE TO JUMP ON THAT PLANE THAT SO MANY OF YOU ACTORS ARE GOING TO BE ON IF TRUMP WINS???!!!!NANCY","commenter_a":"He's a self important cunt, that's what he is. Like his opinion matters. I like his acting, but when it comes to a political opinion, I'll form my own and he can fuck off with his.","post_message":"Robert DeNiro is a ________________."},{"comment_id":"10154037878823984","commenter_b":"Mr. Trump from the time he started his campaign he has always states that all the illegals have to go back have to go back to Mexico and Central America but yet he is one of the largest employers in the Real Estate , Casinos , Hotels, and Golf Courses business, has bragged about hiring illegals to including his contractors and subcontractors and they love him 1. did he use e-verification to see if he or his contractors and subs to see if they had a work permit or they are who they say they are. 2. you claim you want to help the veterans but your company hires more illegals than vets. 3. if you are serious about what you are campaigning on why not be the first to fire or dismiss the illegal aliens and fill those jobs with veterans lead by example and make America great again ...","commenter_a":"Yup another lifer. GET RID OF POLITICAL LIFERS THAT ARE FEATHER BEDDING Stump for Trump. You Go Don, Go Don all the way to the WHITE HOUSE.","post_message":"Wow. The governor of Iowa is actively working against one of the GOP's most popular presidential candidates. This is very unusual for the Iowa caucus... the Iowa governor must feel very strongly about this.  Do you agree with the Iowa Gov.?"}]
