[{"comment_id":"1818799778404105","commenter_b":"It is time for a woman president peeps..........this is not the woman.","commenter_a":"She may have one the debate, but America lost in this Presidential election","post_message":"Join Hillary live in North Carolina for her first rally since winning last night's debate → IWillVote.com"},{"comment_id":"938755412831598","commenter_b":"If she's a white lady, I'm a white lady.","commenter_a":"I am surprised she still has those white teeth in her mouth wow.","post_message":"Let's be honest. If this woman was black, she wouldn't be smiling for a cute little mugshot...because she'd most likely be dead now. #WhitePrivilege"},{"comment_id":"10154399971344087","commenter_b":"@username u one sick bitch","commenter_a":"Obama was basically a community activist turned president. No real domestic and certainly no foreign experience at all. Except maybe he was born in another country. With that said, trump is much better prepared day 1 than obama ever was.","post_message":"\"It is a source of great concern that our country is now in the hands of someone who seems to lack an ability to weigh the consequences of domestic and foreign policy decisions where great risks abound.\""},{"comment_id":"10156340474870354","commenter_b":"The Failed LIE of Multiculturalism is KILLING America. Low IQ Aborigines cannot uphold the Personal Responsibility DEMANDED. See Baltimore, DC, St Louis and Ghetto after Ghetto!","commenter_a":"Yes, yes!","post_message":"“I believe our country’s biggest threats come from within, from failing to address our incredible fiscal irresponsibility, by allowing our populous to become enemies with each other, stirring up hatred and strife within our country, by allowing education to take a second seat, by giving a lot of lip service but not actually taking care of it.\""},{"comment_id":"1247598538653217","commenter_b":"Cheap wages and NO regulations. So tell us, what's unreasonable? Are the international businesses really hurting that bad? Oh, right, it's the \"shareholders\" that are burdened","commenter_a":"Government caused the exodus of manufacturing. 35% corporate tax, EPA regulations, inflated wages, high energy costs. Don't let government fix anything. All they do is break things.","post_message":"Too many working families in the Midwest have been left behind because of the outsourcing of American jobs. I led a letter with Rep. Debbie Dingell and 24 other colleagues to urge Congressional Leadership to expand opportunities in manufacturing communities harmed by outsourcing. It is critical Congress takes immediate action to jumpstart the economic prosperity of our communities."},{"comment_id":"459815194143521","commenter_b":"I personally just don't give a shit. They can walk around naked as a jay bird for all I care. But I'll bet other women would be the ones that bitch the loudest.","commenter_a":"this means that we can have video games and movies with naked women in them ??","post_message":"Female nipples are causing an internet storm & here's why: #FreeTheNipple"},{"comment_id":"10153344405883984","commenter_b":"what more does this witch have to do before they put her where she belongs, PRISON!!!!!!!","commenter_a":"Hillary's political career ended with her departure from the State Department as far as I'm concerned. She's never been a vialble candidate for that office.","post_message":"I don't see any way Hillary can escape from this one. She's probably kicking herself right about now... Do you hope this ends Hillary's presidential chances?"}]
