[{"comment_id":"10153181723473984","commenter_b":"Put all of them in jail there all criminals","commenter_a":"He needs to go!!!!!!!!!","post_message":"Unbelievable! Boehner just gave Obama exactly what he wanted... Do you feel betrayed?"},{"comment_id":"469071613283419","commenter_b":"she b a back stabber","commenter_a":"She fits in with Sharpton an Jackson","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"809483035820491","commenter_b":"Send her little ass over there to stay and take her ma ma with her","commenter_a":"NO FOR GOD SAKES , NO MORE CLINTON'S.","post_message":"Send Chelsea to Benghazi! Dc Gazette (y)"},{"comment_id":"10153944733281178","commenter_b":"She should be in jail.....sick, liar.....","commenter_a":"She's mentally ill or clinically insane.","post_message":"If this came from a Republican, their campaign would be immediately over. #TTT16"},{"comment_id":"638229933016362","commenter_b":"Yeah. There just has to be some reason why hitliery didn't win other than the fact that she is a worthless lier.","commenter_a":"no they did not more lies","post_message":"The CIA says Russia intervened in the election in order to help Trump win. How do you feel about this?"},{"comment_id":"10155610147785389","commenter_b":"Maybe we all need too draw more Cartoons/dont like it leave our Country.If we went to there Muslin Country they cut your head off are take your body parts for opening your mouth,so i think we all need too fight back too these ugly Muslin who think they are going too rule America and kill us for nothing.All they are Communist and they are brought in too our Country too destroy ,let them destroy there own.Lock these borders and stop letting them build camps too close too us.","commenter_a":"The Lamestream media are sell outs to this great Republic, and therefore deserve nothing but disdain from all true patriots.","post_message":"Question of the Day: Is the mainstream media wrong for criticizing Pamela Geller, instead of the radical Islamists?"},{"comment_id":"1003928746312028","commenter_b":"Trump for President. Get rid of the Muslims","commenter_a":"Wasn't it said that you are either with us or against us and any nation found to be harboring terrorist or terrorist training camps will be dealt with as an enemy of the state? If nothing is going to be done about these confirmed training camps by Obama and his administration does this not make them enemies of the American People.? Perhaps it's time for the Knights Templer to return. Take back America Trump 2016!","post_message":"It is confirmed there are 22 Jihadi Training Camps in the USA, but the FBI says nothing can be done about them. This new map shows exactly where they are so you can see if there's one in more in your state."}]
