[{"comment_id":"1242850115735016","commenter_b":"Please don't put us in danger Mr. President. It doesn't matter where you put these refugees in the US. They can still be a threat. I still can't get over 9/11","commenter_a":"How about taking care of the homeless in the country before letting refugees in? I know it might sound crazy, but give it a shot.","post_message":"After the terror attacks in Paris that killed at least 129 people, the placement of refugees fleeing Syria has come under scrutiny as more than a dozen governors - mostly Republicans - have said the do not want the refugees in their state."},{"comment_id":"1858209934411861","commenter_b":"She just needs to fuck off and die!!!!","commenter_a":"You should be out of Washington altogether forever..and out of California. We really don't want you here or representing us in any way.","post_message":"Pelosi calls FBI Director Comey's letter about the investigation into emails related to Clinton's server before the election a \"foul deed\" and should be investigated. Do you agree?"},{"comment_id":"10152688677486491","commenter_b":"@username Was 9/11 an act of American terrorism? WTC and Pentagon are both on US soil, right?","commenter_a":"Not Polish camp but German!!","post_message":"Hundreds of survivors returned to the Holocaust’s most infamous concentration camp today."},{"comment_id":"824106447706135","commenter_b":"Just revoke her security clearance. How could she be president without clearance?","commenter_a":"Ohhh I wish!!!","post_message":"Former Attorney General Michael Mukasey has been making the rounds .."},{"comment_id":"10153548972367093","commenter_b":"LOL. Go back to California.","commenter_a":"This Texan will be voting ALL BLUE in November! Bigotry and hatred has to end! #voteTxBlue - you #GOP small minded idiots don't remember that Texas WAS a blue state for a long time! LBJ was a Democrat from Texas, and TX was a Blue state until 1994!","post_message":"With Trump as the Republican nominee, Clinton thinks a large turnout of minority voters could put Texas in play... @webpagelink"},{"comment_id":"1269577516395609","commenter_b":"So your saying CO2 is NOT a gas?? Where did you study chemistry?","commenter_a":"If that was gas.... the fireworks would have gone off as soon as the air was saturated enough to be visible.","post_message":"No, that's not fog. It's a gas leak.  @webpagelink"},{"comment_id":"10157671091150294","commenter_b":"Hush.","commenter_a":"Megan Crucis","post_message":"The person she contacted was using a clown photo as a profile picture -- as well as an alias."}]
