[{"comment_id":"10153487443061336","commenter_b":"Lawrence and Ruthanne Dolezal parents, both white as snow. Only time she is black is when the lights go out.","commenter_a":"OMG how proud her folks must be. Shes as black as Obama is white.","post_message":"“I wouldn’t say I’m African American, but I would say I’m black.”   Former NAACP leader Rachel Dolezal said in a new interview that she didn’t deceive anyone about her race."},{"comment_id":"672876839554418","commenter_b":"@username that's a stupid comment. Hillary supports killing Gods baby's.","commenter_a":"Hillary would throw her own daughter under the bus to save her own skin! America look out cause Russia is getting pissed at her and sees Hillary as Obama as a white woman.","post_message":"\"11% of the American people say that [Hillary Clinton]'s honest and trustworthy. To compare that, the same poll found that 14% of Americans believe in Bigfoot. Now that's what kind of trouble she's in.\" – Mike Huckabee"},{"comment_id":"913510862078500","commenter_b":"This women is a idiot and if she thinks that these charges are going to stick she is crazier than hell.. She is a real nut job.. Glad she is in Baltimore hope the hell that is where she stayed..","commenter_a":"She's doing a great job and that's a signal for critics and whiners to just move along!","post_message":"Competing interests?"},{"comment_id":"543511749143213","commenter_b":"@username hell don't exist kid you will rot just like eveyone else when you die and are burried","commenter_a":"we aren't animals anymore we used our intelligence to go beyond that, why would we want to back track? I wouldn't want my kids seeing them sexual or not. Or my husband sexual or not. No matter how much we try to \"not sexualize\" them, they always will be and there will be women and men who will sexualize them. It's not hard to leave a fucking shirt on","post_message":"Women everywhere are freeing the nipple  but Facebook doesn't want us to show it. #MicCheckDaily"},{"comment_id":"10154140456978256","commenter_b":"Sara Califf.....Illinois doesn't have a taxing problem... They have a spending problem.... Bloated government is Illinois problem.... Too bad the pensioners are the ones who will suffer","commenter_a":"Democrats need to raise taxes to keep Illinois, and Chicago government revenue stream to maintain the bloated government.... Probably need to build a wall around Illinois first, to keep resident's from leaving for other states","post_message":"Election-seeking Illinois Comptroller Leslie Geissler Munger plans to delay monthly paychecks for lawmakers and statewide officials, saying there isn't enough money to pay the state's bills and other services should go to the front of the line."},{"comment_id":"10154293014660329","commenter_b":"That ugly ass bitch is a hater.","commenter_a":"Reyna Zavala Giovanna Siqueiros Princess Vespa No pues wow","post_message":"\"Swish!\" - Amber Rose, probably // Kanye West"},{"comment_id":"10152732275938645","commenter_b":"fat a** hoe.","commenter_a":"Report me all you want trick","post_message":"The victim said the attacker threatened her during the rape, saying he knew where she lived and would return to kill her if she called the police."}]
