[{"comment_id":"10154343776387061","commenter_b":"@username , just wait till he is done,The Republican Party!","commenter_a":"He was a great president, didn't help republicans but republicans don't help democrats. I'd like it if people met in the middle more rather than so far right or left. Obama is professional, polite, and articulate none of that fits Trump. And now that the new Trumpism is \"Alternative Facts,\" I am concerned.","post_message":"A look inside the Washington, D.C. residence the Obamas are moving to: @webpagelink"},{"comment_id":"1311803105524589","commenter_b":"Bryan Gogg Citation? I didn't think so. The SS never comments on such things.","commenter_a":"I will not shed one tear for any faithless elector that ends up suffering grave consequences.","post_message":"This is about to be all over the news, folks."},{"comment_id":"10154542806314497","commenter_b":"Andrew Wright","commenter_a":"This title Matt Strzalkowski","post_message":"Via ClickHole:"},{"comment_id":"401636356691325","commenter_b":"The rule applies to everyone. She needs to \"DEAL WITH IT!\" End of story!","commenter_a":"All should live by the laws!","post_message":"\"I don't want to take off my Muslim Head Covering in Court\"..."},{"comment_id":"10153750072683352","commenter_b":"Or she was a trashed up slut waiting to get picked up by anyone..","commenter_a":"She was probably a law abiding citizen he only calls felons and degenerates","post_message":"‘We’ve not heard a word': Relatives of woman shot dead on San Francisco pier criticize Obama for not contacting them as they demand tougher immigration laws"},{"comment_id":"613869622133977","commenter_b":"She wants to, if you see the full speech, it is quite clear.","commenter_a":"I didn't vote for Angela Merkel but I have to come to her defence. I don't believe her aim is to discriminate anyone. She is speaking about \"Vollverschleierung\" which means to completely cover the face. I don't think she wants to ban all veils.","post_message":"Elizabeth Plank explains her opposition to German Chancellor Angela Merkel's proposed veil ban."},{"comment_id":"10153737877981409","commenter_b":"What a jerk!!! He thought what he did was a start for his 2020 presidential run. After tonight, he'll never be elected. He shot himself in the foot and his chances for 2020.","commenter_a":"Unfortunate choice. He committed political suicide and will take the name \"Lyin' Ted\" to his grave.","post_message":"Former Trump rival Cruz met with boos during GOP convention speech."}]
