[{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."},{"comment_id":"10154394600380695","commenter_b":"Girl sit down... Really","commenter_a":"Why is this disgusting waste of human flesh still walking amongst us? Lock this rapist up already and throw thr key in the bottom of the Pacific","post_message":"BREAKING: The 78-year-old actor faces up to 10 years in prison if convicted."},{"comment_id":"10154153451894197","commenter_b":"nice, she can afford to leave, no doubt on our dime.","commenter_a":"and who didn't see this coming","post_message":"Former Governor Rell is moving to Florida, and she is not happy about the direction of Connecticut.   Have you considered moving for tax reasons?  Watch Face the State with Dennis House this morning at 11.    Preview here: @webpagelink"},{"comment_id":"10154099546462377","commenter_b":"How about all of us that approve? No one asked me if I approve the transition? Comon, same old story as we heard during the lection!!!","commenter_a":"Awe !! Get used to it .","post_message":"More than of half of Americans disapprove of how Donald Trump is handling his presidential transition, a new Gallup poll reveals."},{"comment_id":"10153608753847452","commenter_b":"its not up to us, it's the law. Our ancestors are no longer the subject for this. Hell I have family members that came here undocumented, but then did what they had to do to become citizens as fast as they could. I'm talking about the ones that come here and don't try.","commenter_a":"Smart or not, she needs to be deported, if she has not already applied for citizenship. Nobody ever said all undocumented immigrants were dumb, she's obviously not dumb by getting into Yale. Very sensitive subject. I feel like she's making herself the mascot for this whole subject.","post_message":"A valedictorian dropped a bombshell in front of thousands at her graduation in Texas - she revealed she's an undocumented immigrant. @webpagelink"},{"comment_id":"10153717162272708","commenter_b":"No we don't have to solve the worlds problems with money we do not have. If you were a refugee from America, which countries would take you in and give you benefits FOR LIFE? Which countries would require nothing of you as a citizen of their country once they took you in??? Those refugees get better benefits than anyone who is from here would ever get......why? Because their government could care less about them so we have to save everyone from everywhere......just because. Just because they won't care about their own people.....just because we have endless tax dollars to support them all. Nope.","commenter_a":"Saying we can't take refugees is saying you don't have compassion, as humans we have to find away","post_message":"We won’t be able to take more refugees. It’s not that we aren’t compassionate. But we can’t. There’s no way to background check them. SIGN IF YOU AGREE!"},{"comment_id":"1005620852830996","commenter_b":"Of course the wives are to blame! Sad that she hunts for weak married men because clearly she can't find one of her own! See picture !","commenter_a":"Correction - the person going out of their way to cheat is to blame for not trying to fix any problems their relationship may have, for not giving their partner a chance and lying. Women like her who go with men knowing they're are married give the rest of us a bad name, she should be ashamed of herself, coming out with drivel like that just proves she has no morals and is kind of desperate for any male attention, but she is not completely to blame here either. Fix what's wrong in your relationship and if it's unfixable then leave, DON'T CHEAT.","post_message":"Woman who has had 100 affairs with married men blames their wives"}]
