[{"comment_id":"976944929007595","commenter_b":"Does their welfare check cover that fine? Are you that stupid to think they will pay the fine?","commenter_a":"Yes people can go to far with this indecent exposure not a healthy thing for kids to see and as a country makes us look like morons to the rest of the world","post_message":"Boom!"},{"comment_id":"10153141059471336","commenter_b":"BRAVO, Joe Prothera and AMEN!","commenter_a":"There is a way for a change u nid jesus the holy spiritto save u brother::::: beleaved in him","post_message":"BREAKING UPDATE: Jury finds Boston Marathon bomber Dzhokhar Tsarnaev guilty on all 30 counts.  He is eligible for the death penalty. @webpagelink"},{"comment_id":"903161916494805","commenter_b":"@username because of disparate impact and disparate action. White people can get up out of bed, run a comb/brush through their hair and be out the door in five minutes. Blacks cannot do that so much, unless their hair is cut to their head--shaved. The rules negatively impact Blacks because without those styles, there isn't much left without using relaxers or paying for extensions. When rules or laws are placed for everyone as is here, but negatively impact one racial, religious, gender group, then it's discrimination and needs to be stopped.","commenter_a":"Can I ask an honest question? In that school, is there a ban on long slick hair, mullets or any other \"white hairstyles\". If so then I can actually understand the ban. But if there is no ban on \"white hairstyles\" like long slick hair, but there is a ban on \"black hairstyles,\" then yeah, i agree, it is discriminatory.","post_message":"This school just banned traditionally black hairstyles  and people are outraged.  #MicBrights"},{"comment_id":"1107309912667398","commenter_b":"Testing , testing , are you awake America , if not you'd better be soon , ISIS is here an they're not gonna wait for us to realize it , to late is to stupid , time to shake the Muslins up to the fact that we've wasted enough time an lives on there nonsense arrest an deport where needed , tolerate nothing , they want changes send them home an let them change there own countries , leave us alone an we'll leave you alone too .","commenter_a":"@username and trump piss off.","post_message":"Donald J. Trump says there may be more terror attacks across the country because \"we've been weak\" and \"our leaders are...stupid!\" @webpagelink"},{"comment_id":"10153524776247016","commenter_b":"If you want a female president, Elizabeth Warren would be a thousand times better than WHORE Hillary.","commenter_a":"You can dress HRC any way you choose and she still is a corrupt POS. NEVER $hillary, EVER BERNIE~!","post_message":"Wall Street thinks Sen. Elizabeth Warren would be a \"nightmare\" as Vice President of the United States.  You can't ask for a better endorsement than that."},{"comment_id":"1218923861503062","commenter_b":"I wonder if this woman realizes what a joke she is. Department of Justice my butt. She has ruined any respect she may have had from the American people. What she may not realize is the Clinton's would leave her holding the bag if it covered their tracks!","commenter_a":"We don't need Attorney Generals that don't represent WeThePeople and the truth.","post_message":"Loretta Lynch, Attorney General can't seem to get her story straight about Hillary Clinton. This is what it looks like when your career crumbles right in front of you.   Let's get 2,000 SHARES to show that we don't need CROOKS in office!"},{"comment_id":"944282629025715","commenter_b":"Yes","commenter_a":"Yes absolutely","post_message":"Yes!"}]
