[{"comment_id":"494820657375181","commenter_b":"She needs to shut that big mouth","commenter_a":"She need s to keep her friggin mouth shut","post_message":"Michelle Obama's tries to enforce this on her hometown, but they aren't backing down.  If they can stand up to her, so should the rest of the country.  Do agree Michelle needs to be silenced?"},{"comment_id":"963407697102775","commenter_b":"she wont get elected,,,she will be placed! Voter Fraud accomplishes much! Thats why she is not worried about winning","commenter_a":"If she does get elected, invest in body-bag manufacturers....guaranteed 1000% return on investment assuming you don't get killed by her goons.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153218033713188","commenter_b":"That Mormons even call themselves Christians is a relatively new phenomenon. It dates back to at best sometime in the late 70s/early 80s. I remember a girl in my youth group had brought one of her Mormon friends one summer's eve, and I got into a conversation with her and I'll remember what she said til the day I die- 'I'm not a Christian, I'm a Mormon!' That would have been 74 or 75. Also, the concept that 'As God was, so man is; as God is so man may become' is utterly missing from the other thee Abrahamic faiths.","commenter_a":"Um, no. The miracle IS the resurrection. The result is the atonement.","post_message":"A little bit of what I spoke about at church Sunday."},{"comment_id":"1363332557011521","commenter_b":"Robert Flemming you still haven't answered my question.","commenter_a":"I tell ya, if any of that shit were real, I'd much rather be on the side of Satan, than some dude that allows childhood bone cancer to be a thing. I'll keep my free thought thanks, you can keep your sadistic, imaginary friend to yourself.","post_message":"Food for thought."},{"comment_id":"10153624598653132","commenter_b":"Shoot, I'd feel sorry for the plants. She should have to work with people who are just like her. They can take jabs at each other all day. What a bunch of douche bags. And the doc himself needs to get a backbone..you can tell he's only going along with her ridiculous antics.","commenter_a":"How did he still have his cellphone during surgery","post_message":"The patient used his phone to record the instructions the doctor gave him for post-surgery care, but ended up taping the entire procedure - and what he heard shocked him."},{"comment_id":"1354018291282776","commenter_b":"Lol a bitch","commenter_a":"Colin, the multi millionaire football player only started feeling oppressed after he began dating a devout Muslim. He now hates everything American, but still takes advantage of everything American!","post_message":"If they thought their fans would blindly go along with any insult to their country, they were sorely mistaken..."},{"comment_id":"10155922469974199","commenter_b":"All he's got to do is offer residency or citizenship to all of the workers who are here illegally and who are will to work on the wall for minimum wage and he could probably build that wall for 5 billion. And technically Mexico would be paying for it.","commenter_a":"This man is a joke and you guys really elected him. We are all doomed under his watch","post_message":"President Donald Trump tweeted Saturday that he is aware of the new costs estimates for the proposed wall along on the U.S. border with Mexico.   A government analysis suggests the wall could cost $15 billion, and possibly as much as $25 billion.  How much are you willing to pay for the wall?"}]
