[{"comment_id":"10154903859534586","commenter_b":"Kill the cats!","commenter_a":"Im vegan and when i go out i try to tell at least 20 people im vegan and i dont eat gluten","post_message":"This is so accurate SHARE if you can relate! #GoVegan2017"},{"comment_id":"788206447982585","commenter_b":"The trump train is heading for the trump wall. toot toot.","commenter_a":"Hurry Hillary call Wall Street call @username call AL Sharpton because your gunna need all the help you can get. The Trump Train is rolling straight for the White House !!!","post_message":"Hillary Clinton and her allies are preparing for the fight against Donald J. Trump."},{"comment_id":"864523933643860","commenter_b":"Judy. Are you really that stupid? She's a doormat that stayed with a moral less husband for decades just for power. You have low standards.","commenter_a":"Hillary is such a threat to them, they will do anything to hurt her.","post_message":"“Secretary Clinton used one email account when corresponding with anyone, from Department officials to friends to family. A month after she left the Department, Gawker published her email address and so she changed the address on her account.” -Clinton attorney David Kendall"},{"comment_id":"813714802066935","commenter_b":"I'd like to see her asshole","commenter_a":"Joyce Watson @username superimpose someones cheeser. xv","post_message":"Subscribe to our mailing list and receive our awesome content for FREE - @webpagelink"},{"comment_id":"1181717725240095","commenter_b":"lol actually u support a murderous witch AKA BENGHAZI BITCH","commenter_a":"TO BAD ALL THE BULLSHIT HE TOLD WAS A LIE.","post_message":"Donald J. Trump just gave the speech of a lifetime... but more importantly, he totally destroyed Hillary Clinton. He put a very special message to Hillary in there that you won't want to miss."},{"comment_id":"1255582551128439","commenter_b":"@username No that shooter was a Mentally Challenged person . Most of the MASS SHOOTERS have been Mentally Challenged. You ask why are they allowed to roam the streets? Well, they took the money to contain and treat them and gave to to the unwed mother to have 20 kids with and to provide Food Stamps. DO NOT under estimate the challenged ones. Some are very smart and great at solving problems. They just can't function in society.","commenter_a":"Here's what we now so far: Syed Farook and Tashfeen Malik met in Saudi Arabia. Farook was described as a devoutly religious Muslim (most likely Sunni). The third suspect, Tayyeep Bin Ardogan, is a 28-year-old native of Qatar. Only Farook was employed by the agency hosting the Christmas party. Multiple explosive devices were discovered at the scene of the massacre. IEDs (improvised explosive devices) are illegal in the State of California. IEDs take time to build. Obviously, there was some planning involved. IEDs are mass-casualty weapons that kill indiscriminately. They're not something you use when you're concerned about casualty mitigation and innocent bystanders. A coworker stated that Farook had grown out his beard over the last several months. The geniuses in the DOJ (namely the FBI) are trying to ascertain a motive. That's nice. Let's see how long it takes them to put the pieces together.","post_message":"The suspects in the San Bernardino shooting were armed with four guns and an explosive device in a \"well-planned\" attack, officials said."},{"comment_id":"10154473639164749","commenter_b":"Rebecca Jara","commenter_a":"carry knife free zone signs with them. they are very powerful deterrents.","post_message":"\"I would urge parents to speak to their children about the app and the best ways to make sure they stay safe.\""}]
