[{"comment_id":"1042018525819158","commenter_b":"This ladies dumb AF","commenter_a":"It should have been there when it could have helped my husband before he died. It doesn't matter much now whether they develop it or not. It can't help him now.","post_message":"A breath test for lung cancer could be on the horizon."},{"comment_id":"10153866102494160","commenter_b":"Guess he ought to have plenty of money to go on vacation about ten times a year.","commenter_a":"'@webpagelink payments By Morgan Chalfant Published March 18, 2016 Washington Free Beacon President Obama sought to increase the amount of money available for the federal government to spend on former presidents in advance of his White House exit. In his budget requests for fiscal years 2016 and 2017, Obama proposed hikes in the appropriations for expenditures of former presidents, according to a report from the Congressional Research Service published Wednesday. The report, which discusses the pensions and other federal benefits offered to former commanders-in-chief by way of the Former Presidents Act, specifies that Obama’s 2017 budget proposes a nearly 18 percent hike in appropriations for expenditures of former presidents. He successfully requested an increase in such appropriations for fiscal year 2016. “The President’s FY2017 budget request seeks $3,865,000 in appropriations for expenditures for former Presidents, an increase of $588,000 (17.9%) from the FY2016 appropriation level. The increase in requested appropriations ...","post_message":"Barack Obama's new digs come with a huge price tag."},{"comment_id":"1590050817948698","commenter_b":"Hey, Justine. Did you know that the Quran teaches Muslims to kill you and I? If you think that's religious freedom that Christians should be tolerant of when they come to kill you I'll be happy to tolerate it, but when it's my turn I'll handle it the old American way.","commenter_a":"No America was founded on Christian values","post_message":"Barack Obama continues to show his Muslim roots..."},{"comment_id":"10154330799961756","commenter_b":"Not true she's probably going to make more blackmailing than having sex eventually","commenter_a":"Why do you do this, it will never go away, it is a fact of our lives. Make it legal, tax it and provide health regulations~","post_message":"Clients will be fined about $1,700 for the first offense."},{"comment_id":"10154228784001378","commenter_b":"Yes ty @username I did","commenter_a":"'@username did you get one yet?","post_message":"The Hatchimals are coming! The Hatchimals are coming! Target has announced that a new shipment of the hottest toy of the holidays will be popping up in stores nationwide starting today. Are Hatchimals on the list this year?"},{"comment_id":"10153896425024330","commenter_b":"Some women are idiots. Victim blaming is a disgusting habit.","commenter_a":"Some women are saying , what did he do to deserve that ...","post_message":"This woman is accused of setting her boyfriend on fire and police are searching for her. Warning, the details are disturbing. ---> @webpagelink"},{"comment_id":"916716405122968","commenter_b":"'@username your name says it all!","commenter_a":"someone needs to mention the senior citizens in this country. We have not had a COLA raise for two years. BS. We might be old, but WE VOTE!","post_message":"Miners have one last shot in this election - the coal industry will be nonexistent if Crooked Hillary Clinton wins the presidency this fall. It is time to MAKE AMERICA GREAT AGAIN!"}]
