[{"comment_id":"1008378105905084","commenter_b":"She has more than a few screws loose!!!!","commenter_a":"Which Koran.","post_message":"Nancy Pelosi Quotes Mohammed and Pushes Islam at the National Prayer Breakfast"},{"comment_id":"10153853111962217","commenter_b":"Well done Team GB proud to be British and the achievements of our wee islands athletes.","commenter_a":"US is winning the olympics. That's good. I heard who ever wins the olympics has home field advantage during the next world war.","post_message":"Good job Team GB 👏🇬🇧"},{"comment_id":"1116747615049049","commenter_b":"Women frequently nurse their Babies in the train station where I work - I applaud it as natural and organic and cannot imagine why in Heaven's name it is such an issue - (we all come with identical equipment and this is what breasts are for) Nursed Babies are much healthier than those bottle fed","commenter_a":"Beautiful","post_message":"An interesting discourse here about nursing in public. What are your thoughts?"},{"comment_id":"585422771627079","commenter_b":"I disagree. Trump will defeat the Liar Hillary.","commenter_a":"WELL IF 65-70% DON'T WANT TRUMP AND HIS POLL NUMBERS ARE MUCH HIGHER THEN TED'S... THEN I WOULD THINK 90-95% DON'T WANT TED AND EVEN LESS WANT RUBIO...","post_message":"\"If Donald is our nominee, in all likelihood, Hillary wins, we lose the Supreme Court for a generation, the Bill of Rights is lost, we're buried in debt, and jihadists rise across the globe,\" Ted Cruz said. Do you agree?"},{"comment_id":"10157707332290354","commenter_b":"Deport her ass","commenter_a":"If you vote Hillary you are just inviting scum like this into our country.","post_message":"What did she mean by this?"},{"comment_id":"1305307819486565","commenter_b":"#DUMPTRUMP NOW!","commenter_a":"TRUMP will have them shot, Obama let them make it with their lives. He's already making plans for Paul Ryan, he has ties to the Mafia and will use them. They will have to get rid of Trump.","post_message":""},{"comment_id":"10153723467413984","commenter_b":"Wow what a woman","commenter_a":"You FOOLS! Let this American citizen out of jail and start concentrating on REAL illegals in this country! You have totally lost track of reality! In my 65 years on this planet I have never seen the U.S. Government be so dysfunctional as it is right now!","post_message":"Amazing. Kim’s 21-year-old son has just stood up for his mother in a HUGE way after she was ordered to jail, and it speaks volumes. Do you support Nathan Davis?"}]
