[{"comment_id":"10154592299555579","commenter_b":"this woman is about one thing only………money and power and fame………….she has sold her soul…...","commenter_a":"WATCH CSPAN!!","post_message":"Laura Ingraham says to \"all you boys with wounded feelings and bruised egos must honor your pledge to support Donald Trump now. Tonight.\" Watch full speech here: @webpagelink"},{"comment_id":"970690569690664","commenter_b":"Good luck... Whomever the bitch was that reported my post. Truth hurts don't it troglodyte?","commenter_a":"Am I the only one to realize that all of these mass shootings are done by men?","post_message":"America's easy access to guns almost led to another devastating tragedy..."},{"comment_id":"10154841543903984","commenter_b":"Go to prison Hillary! !","commenter_a":"This is proof this election is and will be rigged. There's absolutely no way Hillary is leading in the polls. She will win but by using massive voter fraud.","post_message":"Fox Business Network just took a serious swing at Hillary Clinton, and it definitely was NOT a miss. The network exposed on-air the one thing mainstream media would never show you, and Hillary does NOT want it seen."},{"comment_id":"1309667302402021","commenter_b":"obuma=PUKE! TRAITOR!! LIAR!! DIVIDER!!","commenter_a":"OH GOOD GRIEF THEY JUST CAN NOT GET OVER IT!!! THAT THE AMERICAN PEOPLE ARE SICK AND TIRED OF ALL THE DEMOCRATIC CRAPP AND LIES!!!!","post_message":"Trump SILENCES OBAMA!"},{"comment_id":"10153180369332042","commenter_b":"Idiots.there goes their life down the drains.","commenter_a":"White trash ! Throw Away the key","post_message":"SINISTER GROUP 'PROJECT:' These 5 students met before and after school for week -- but they weren't working on a group project for class or a fundraiser for a pep rally.   Cops say what they were planning on doing was deadly."},{"comment_id":"10154051432298445","commenter_b":"Listen you little bitch ur just mad because","commenter_a":"Come on they just want to get paid like everyone else....shut the fuck up and give them their chop...before you end up paying an arm and a leg for mr.college degree but cant find a job in the field i studied for...to show up and try to charge u 30% of ur crop this is America only place they have buffets js","post_message":"#TBT to 2015. \"trimmigrants.\" had trouble finding work, created tension after arriving in Humboldt expecting trim jobs.   Humboldt friends - has the atmosphere changed?"},{"comment_id":"1172494429493450","commenter_b":"These dumbasses should be ashamed ... No one will ever vote for either of these liars again . No Honor ..No Vote","commenter_a":"These three men will never get my vote in the future. Anyone that is with her is corrupt... Republican or not you need to go.","post_message":"GOP 'Never Trump' Candidates get a Warning"}]
