[{"comment_id":"752331831534238","commenter_b":"This guy is DANGEROUS!!! USA will not be a safe place if this ass hole wins. countries like RUSSIA! Will declared WAR on USA. He is thinking to pressure MEXICO to pay for a wall base in WAR!!! Mexico has many ALLIES! WWIII Don't make a bad decision people!","commenter_a":"He is the devil","post_message":"Watch Trump directly contradict himself — watch more here: @webpagelink"},{"comment_id":"10153505844154714","commenter_b":"But THEY can't have their own..male with male doesn't make babies","commenter_a":"You made a typo. You said \"her family\". You mean Bruce spent the day with his family.","post_message":"It was Caitlyn Jenner's first Father's Day as an out trans woman."},{"comment_id":"10155894213345354","commenter_b":"Hillary is a cunt!","commenter_a":"Killary is the epitome of all the ills of this world rolled into 1 savage stinking carcass.","post_message":"Short memory!"},{"comment_id":"10154061060138433","commenter_b":"@username -that's the point. Many have NOT committed a crime or have been overcharged to force a plea because poor people can't afford bail, or to wait in jail for a trial and to leave their kids or their job..","commenter_a":"They seem well paid to me. Especially when there's a glut of them.","post_message":"Did you see the Netflix series Making a Murderer? Remember Jerome Buting, one of the defense attorneys? PolitiFact Wisconsin recently checked his claim that Wisconsin pays criminal defense lawyers who represent the indigent $40 per hour, \"the lowest in the country.\" That rated a Mostly True."},{"comment_id":"1094565510598452","commenter_b":"This is what should happen to Debbie Wasserman Schultz - #PutThatWassholeInPrison","commenter_a":"More like its time for you to take what's yours. Go out on stage and be prepared to accept the nomination please. I hope you pull an FDR. I can't bear to see Clinton win after what wikileaks showed.","post_message":"In the State of New York 3 million Independent voters could not participate in the Democratic nominee. It's time for open primaries."},{"comment_id":"10153615563223812","commenter_b":"Well some people family don't care","commenter_a":"(rolling eyes) if she was white and was found hung in a cell, no one would say a word.","post_message":"While Sandra Bland's family and supporters have been calling for an independent investigation into her death, the DA plans to release the dash-cam footage from her arrest: @webpagelink"},{"comment_id":"10154136530601509","commenter_b":"Ignorant woman!","commenter_a":"Botate a la verga pinche paisana que te deporten por pendeja y regresate a tu pais pinche ignorante andas apoyando a trump y ni hablar ingles sabes se te nota lo paisana desde lejos","post_message":"The Donald J. Trump superfan, \"I saw Mr. Trump only in my dreams\" @webpagelink"}]
