[{"comment_id":"10154808382292235","commenter_b":"What about Ted (Shit my pants draft dodger) Nugent? He can play his one and only hit about pussy grabbing.","commenter_a":"Ted will need to wear a diaper","post_message":"Looks like it's just Ted Nugent and Kanye."},{"comment_id":"1094342837275269","commenter_b":"She ain't coming back","commenter_a":"I love Jessica Lange","post_message":"Jessica Lange announced that four seasons of 'American Horror Story' was enough and she will not return.   The star of the first four seasons of 'American Horror Story', Jessica Lange, announced that she has no desire to return to the show. Lange will however return to FX in the show 'Feud'   One actress entering her fourth season of the show that announced she will be returning is Angela Bassett. Watch Angela Bassett talk season 6 of 'American Horror Story'."},{"comment_id":"1695494594049179","commenter_b":"And who's fault is it that the cartels exist ?? -- Your people! The youth in your country and their parents . The main fact that ignorant Americans either fail to realize or completely ignore is that America is the #1 drug consumer country in the world ! In order to be a business there needs to be a demand. Your society is demanding drugs you people are raised on terrible values and customs which is why you are heavily consuming drugs ! If your government could find a way to avoid that demand and necessity the business would cease to exist. Your people are indirectly the cause of the blood that sheds south of the border . Of course you didn't do your research properly! BITCH.","commenter_a":"#BringBackJonStewart ... Sorry, but you're misinformed and simply not funny Trevor. You obviously never visited a border town where cartels are actively kidnapping Americans. This is happening right now, while you attempt to make unfunny jokes about the problem","post_message":"Trevor unpacks Donald Trump's response to the mass shooting in Orlando. @webpagelink"},{"comment_id":"1059120344128437","commenter_b":"I have a 15 year old daughter. She is very mature and brilliant. Although, she (as well as almost all teens that age I know whose frontal lobe isn't even completely developed and whose lack of life experience just isn't there no matter how much a teen thinks it is) is not ready to consent to domestic slavery, opps I mean marriage. Many organizations are trying to stop child marriages in other countries. I am pretty sure that this is the same thing.","commenter_a":"Sick","post_message":"A debate broiling in the Christian homeschooling community asks a hard-hitting question: just what should the minimum age for marriage be?"},{"comment_id":"636925316432507","commenter_b":"Fuck yeah, good on them we don't need those greedy pigs.","commenter_a":"Hungary - home country of George Soros, He's a Hungarian Jew.","post_message":"The head of Hungary’s central bank has called for the International Monetary Fund to close its office in Budapest."},{"comment_id":"10153137881829342","commenter_b":"And is Charlize Theron the president of the NAACP claiming to be white? I think we got there can be white africans","commenter_a":"she is white as white can be. she is born and raised African. @webpagelink","post_message":"When asked if she was African-American, she responded that she didn understand the question. When asked,  your parents white? Dolezal removed her microphone and walked away from the interview."},{"comment_id":"596965907173588","commenter_b":"They BORN there.need to FIX their OWN Country..DON'T COME MESSING UP 'OURS;~~","commenter_a":"Trump will make american tax payers build the wall not mexico","post_message":"Trump Better be Serious about Border Security Promises"}]
