[{"comment_id":"880035775457816","commenter_b":"Some of the women who have become men have beards ,tattoos and 6 packs. Do people really want them to still use ladies toilets?","commenter_a":"This is not a presidential issue","post_message":"WATCH: Donald J. Trump addressed the recent fight over transgender use of public bathrooms, and whether he'd add separate facilities at his Trump properties."},{"comment_id":"10153533392786337","commenter_b":"You wish you were a woman","commenter_a":"Bruce Jenner has 0 murders. Caitlin has 1","post_message":"MUST SEE MOMENT: Caitlyn Jenner gave a graceful speech while accepting ther Arthur Ashe Courage Award at the ESPY awards..."},{"comment_id":"1518093821534153","commenter_b":"Cindi Marcum then why do you ppl think that muslims have the right to travel to the u.s. and and park their lazy asses here, mooch off of us and kill at will while trying to enforce their barbaric ways of life on us....hmmmm?","commenter_a":"So if it's in the rights of the protesters to block a road where does my rights to travel freely fit into that agenda so I can say get to work , seek medical attention or buy food , ect","post_message":"Wow! Talk about fear mongering!?"},{"comment_id":"636925316432507","commenter_b":"Fuck yeah, good on them we don't need those greedy pigs.","commenter_a":"Hungary - home country of George Soros, He's a Hungarian Jew.","post_message":"The head of Hungary’s central bank has called for the International Monetary Fund to close its office in Budapest."},{"comment_id":"677143662389195","commenter_b":"Shut Up!!!!!","commenter_a":"The Patriots are speaking! Donald Trump is our Patriot Leader! E-verify. Numbersusa.com. Arm all our military - - active, reserve, and veterans. Honor The Constitution / Bill of Rights, limited government, free enterprise, and USAmerican exceptionalism. Make The USA Great Again! Go, Trump! Support the Muslim Reform Movement. No more terrorists! m.facebook.com/Muslim-Reform-Movement-@username/ MuslimReformMovement.org","post_message":"If Donald J. Trump \"gets his way, it will be like Christmas in the Kremlin,\" says Hillary Clinton"},{"comment_id":"10154845355999705","commenter_b":"Omg this is perfect","commenter_a":"@username lolol we need one","post_message":"Someone reverse engineered the umbrella - and it totally works."},{"comment_id":"10156197809660725","commenter_b":"I think you mean deports the illegals","commenter_a":"thank you Donald Trump...for being the voice of and for \"the people\". liberal media and politicians are not used to truth...refreshing to hear you vs the politicians not in touch with Americas condition and needs!","post_message":"An updated POLL tracker (with all polls thru the weekend) reveals I maintained a double digit lead at 34.8%. Not only that, my poll #'s are double that of 2nd place candidate. #Trump2016 #MakeAmericaGreatAgain"}]
