[{"comment_id":"1102034899855986","commenter_b":"You all want a Muslim hater so kinda breaks out even don't you think?","commenter_a":"Fuck 'em.","post_message":"American Islamophobes are beside themselves because human rights activist Sadiq Khan was elected mayor of London."},{"comment_id":"1593183134313238","commenter_b":"Lol, not true bitchhhhh.","commenter_a":"Jensen Beale","post_message":"\"5 minutes\" "},{"comment_id":"10154132565089087","commenter_b":"Thats it?? Popping a bottle of champagne??? He wasn't fucking any one...SHE WAS....GIVE ME A BREAK!!!","commenter_a":"Treasonous Clinton is going to be burned on Bills rapping of women when he was the AG of Arkansas that right Clinton you covered it up","post_message":"\"There’s been a lot of talk about sex tapes today and in a strange turn of events, only one adult film has emerged today and its star is Donald Trump,\" said the Hillary Clinton campaign in a statement."},{"comment_id":"1123039051096182","commenter_b":"@username Y u so MAD!","commenter_a":"Everyone who verbally attacks BLM are silent supporters of the kkk!! Show me why u hate BLM so much. Show us pics of the smiling around a dead white person or any other ethnic groups body!!! U can't so fuck u","post_message":"Lol: #Virginia #police pulls a woman over for driving without an ice cream cone!  #WSHH"},{"comment_id":"559128170957362","commenter_b":"Real easy there big mouth, you don't like it here then PLEASE get out NOW you punk.","commenter_a":"You will get nothing from me OR anyone I know,you punk loud mouth but we have something for you. See you soon.","post_message":" WHITE PEOPLE OWE REPARATIONS. IF YOU DON GIVE IT, WE COMING TO TAKE IT."},{"comment_id":"10154087953651491","commenter_b":"GO AWAY","commenter_a":"I Finally found the link original watch Suicide Squad {2016} full movies @webpagelink watch Don't Breathe {2016} full movies @webpagelink watch Bad Moms {2016} full movies @webpagelink watch Fifty Shades Darker {2016} full movies @webpagelink watch Doctor Strange {2016} fulmovies @webpagelink","post_message":"Sometimes the landlord/tenant relationship can be a difficult one. But it doesn't have to be that way."},{"comment_id":"10153906190670667","commenter_b":"Neither Chelsea, Hillary, or Bill receive a salary from the Clinton Foundation.","commenter_a":"Clinton Charitable work done in house? Don't you mean Charitible to the Clintons, with Chelsea receiving hundreds of thousands of $$ as an administrator? Gee Ya got me there Sparky!","post_message":"Mike Pence claimed that “less than 10 cents on the dollar in the Clinton Foundation has gone to charitable organizations.” That’s misleading. @webpagelink"}]
