[{"comment_id":"10155481461845405","commenter_b":"And I mean prosecute the farmers not the illegal immigrants. You can't blame them for coming here and getting a job . My point is Republicans won't deal with the issue in a responsible manner.","commenter_a":"And they vote Republican and employ the largest number of illegal immigrants and get away with it. The one that do should be prosecuted for it .","post_message":"Did you know that 97% of Wisconsin farms are family-owned? Wisconsin agriculture also employs 413,500 employees and that's 12% of the workforce."},{"comment_id":"569853826519212","commenter_b":"So how was your nap after clearance today then?","commenter_a":"'@username this is you","post_message":"Facts"},{"comment_id":"1604700786499928","commenter_b":"'@username ..more lies more propaganda blame islam,muslims..stop your fake and baseless propaganda..by 1890 jews were 5%in palestine...after belford declaration in 1917,they stormed to palestine,by 1935 jews were 25%..1946,47 32%to38%.these zombies invaded from europe.. caucasian zombies,khazars.go back to your daddys land with your fake hasbara propaganda..","commenter_a":"Hamas regime- is the selfish terror group from gaza that committing ruthless tactics against humanity and uses his people as Human shield..Hamas keep launching terror attacks and firing thousands of rockets into Israeli towns to kill civilians. Hamas terror regime is still smuggling heavy weapons into Gaza. They are also killing and torturing Palestinian opponents and using the USA and international aid to buy weapons and build more terror tunnels, Which worth millions of dollars..","post_message":"A spokesperson for the Palestinian health ministry says 17-yo Palestinian youth injured during Sunday night's raid @webpagelink"},{"comment_id":"854121244730702","commenter_b":"No need to fear - strong, intelligent, powerful women can purchase their own contraceptives or better yet save something special for marriage and then raise the next generation of Americans.","commenter_a":"Dumbass use your butt.Save a child from being liberal.","post_message":"Lena Dunham is absolutely terrified of Trump and his views on abortion."},{"comment_id":"10154263809393598","commenter_b":"A very sick lady, Murderer. Lier. Corrupt.","commenter_a":"SHE WILL EAT THOSE WORDS ONE OF THESE DAYS","post_message":"As the debate begins, remember.... Hillary Clinton: An Unborn Child Just Hours Before Delivery Has No Constitutional Rights"},{"comment_id":"10153327022163984","commenter_b":"I hope that he succeeds She is Satan","commenter_a":"Go all the way with this!!!!","post_message":"It’s been just over a week since Hillary’s announcement set off a firestorm of negative press about her past.   But one scandal stands out… Benghazi! Send an email to Rep. Trey Gowdy and tell him to pry the truth out of Hillary Clinton!"},{"comment_id":"10152872139971130","commenter_b":"Says the bitch who makes more than most men... Lmao","commenter_a":"Says the woman who makes a million dollars a movie for acting while the teacher at her kids school makes 50k or less a year! #equalpay","post_message":"PREACH, Patricia Arquette!"}]
