[{"comment_id":"10153149110684877","commenter_b":"Yes, she should be arrested. This type of crap gets people killed.","commenter_a":"She deserves prison time.","post_message":"Woman claims she was attacked by black men, allegedly faked injuries with makeup. She TRIED it! You have to see the pics for yourself.   Grio fam, should authorities press charges if it's proven she faked her claims? Sound off below!"},{"comment_id":"570057943197857","commenter_b":"Agree with you @username","commenter_a":"That too faced Lib says things a sailor wouldn't say on a drunken night","post_message":"Jamie Lee Curtis ripped Donald Trump for his \"lewd\" comment on Lindsay Lohan."},{"comment_id":"1092094194179315","commenter_b":"Because I have read other shit she has posted and the BITCH talks crazy THAT'S WHY @username!!!!","commenter_a":"Wondering, where are the people saying, \"he should've complied with police orders?\"","post_message":"Protesters in Fresno, California, waved the Confederate flag & signs that read “White Lives Matter” to express outrage over a local unarmed white man’s police-involved shooting death.   Several shouted “f**k the police” and threw water bottles and glass toward a line of policeman gathered near the crime scene. DETAILS ---> @webpagelink"},{"comment_id":"10150614186964999","commenter_b":"Amen. However they are supposedly there to educate humans. In some cases it is educating them. Unfortunately not in all.","commenter_a":"Happy would be happier with other elephants. However (if you read the article), her buddy Grumpy was killed by the other two elephants when they charged him. The Bronx Zoo is not bringing in any more elephants and would put Happy at risk with the two they have. She does need to be moved to another zoo. Maybe they all do, but there is no guarantee she will be accepted with other elephants. Sad, but maybe it's time to focus on getting rid of zoo's altogether and leave these animals in their natural habitat where they belong.","post_message":"For close to a decade Happy has lived alone, separated from the zoo’s 2 other elephants. Her solitary existence is quite unlike the life of a wild elephant."},{"comment_id":"749014911913950","commenter_b":"Is it possible..he can sink much lower? any bets.....again I'm speechless..he gets to just say things like this with absolutely no consequences at all!!...well..here's one consequence: VOTE BLUE UP AND DOWN THE BALLOT AND GET ALL THESE BIGOTS OUT OF OFFICE; OUT OF HOUSE AND SENATE ...","commenter_a":"Scum . Bottom feeder","post_message":"Now Trump's after dying people. See if you can stomach this. -- Annkia"},{"comment_id":"10153416517971051","commenter_b":"She should not face any charges. She protects her child.","commenter_a":"You go girl he got off easy","post_message":"When this wife discovered what her husband did to her 7-year-old, she set him on fire."},{"comment_id":"725563637631927","commenter_b":"The wall around the vatican was bild to keep the muslums out.","commenter_a":"I am not Catholic,He is not my pope. We do not have an established religion in the USA. Which was the whole reason for the whole revolutionary war, pilgrims, etc. He is welcome to his opinion, that's all it is....move on Pope....btw, why do you have a wall around the Vatican, just curious","post_message":"The Pope got TAKEN TO SCHOOL by Trump supporters!"}]
