[{"comment_id":"1098657656855065","commenter_b":"She's a DOPE, I don't know about Doped up.","commenter_a":"So stupid Andddddddddddddddd Hillary nearly fell stepping off the podium She looks doped up","post_message":"UNREAL! WATCH JOE BIDEN Point Out The Guy Who 'Follows' Him Around With The NUCLEAR CODES Right After Saying TRUMP Couldn't Handle The Codes [Video]  And we have THIS clown in charge?"},{"comment_id":"1027522093954929","commenter_b":"And she REALLY makes Alaska look like it's full of idiots. How else did she get elected Governor in the first place?","commenter_a":"And to think that was John McCain's pick for VP. Embarrassing.","post_message":"This one is a CLASSIC."},{"comment_id":"991950690936939","commenter_b":"Looks can be deceiving. The slob has way too much power and his history is terrible.","commenter_a":"How is Bannon so canny?? He always looks like he just work up in a bus stop with a bad hangover and isn't 100 percent sure where he left his pants.","post_message":"Trump's aides also reportedly don't know how to properly turn the White House lights on and off."},{"comment_id":"1004633596257472","commenter_b":"I would do the same only faster. Highways are for vehicles not pedestrians. Soooo expect to get run down of you are blocking traffic on a tiadwa","commenter_a":"Finished my run thru Arizona, didn't see no protesters ;)","post_message":"WATCH: DRIVER FED UP WITH ANTI-TRUMP Terrorists Blocking Road Drives Through Crowd…Reaction Of AZ Police Officer…Priceless"},{"comment_id":"10154973446391509","commenter_b":"Shuttt up!!","commenter_a":"This is not fair because Turkey had an explosion in the airport today with few deaths and few injured. But yesterday in my country Lebanon had 6 to 7 suicide bombings through out the day in less than 24 hours in one village called Kaa which is a Christian village with 5 deaths and 28 injured some are deadly injuries. And there was not one news coverage of that.","post_message":"BREAKING: Explosions and gunfire reported at Istanbul’s Ataturk Airport, the Turkish interior ministry said @webpagelink"},{"comment_id":"962385683823549","commenter_b":"Why in the hell did he stand there and listen to that s*** slam the door in that w**** face after about three words out of her mouth","commenter_a":"Racist","post_message":"HATE YOU WHITE MOTHER F-CKERS': Thug Chick Goes Nuts On White Neighbor (VIDEO)  @webpagelink"},{"comment_id":"10157399464465093","commenter_b":"A hun will never kill anyone! Its the people that use them! People kill people! Criminals get them illegally and you can't stop that! It is not possible! Give me a reason why you think criminals should only have guns?","commenter_a":"Yes but 100% of gun crimes involve guns, so start with the legal gun owners because it's way easier, and it looks like we're doing something.","post_message":"Pass it on."}]
