[{"comment_id":"10153070274883010","commenter_b":"Wait, so your bathroom at home is a symbol of Sodom and Gomorrah?","commenter_a":"Welcome to Sodom and Gomorrah.","post_message":"A new West Hollywood law will require gender-neutral restrooms."},{"comment_id":"10153896899905579","commenter_b":"Yes...go away!!!","commenter_a":"you go","post_message":"President Obama to extend U.S. Military presence in Afghanistan: Your Thoughts? WATCH statement from President Obama @webpagelink"},{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"10154187969491615","commenter_b":"@username 99.9% could be prevented if the women had any morals....","commenter_a":"I hope everyone marching plans on adopting a kid or two. If your so concerned with the baby being born, you should actively participate in rasing it.seeing as the parents dont want to or they would have an abortion. So please sign up at the front entrance and take your unwanted child when you leave. Thanks for keeping kids outta foster homes and orphanages.","post_message":"This year is a historic one as Vice President Mike Pence is spoke during the march. It is the first time a president or vice president has taken part in the March for Life. _____________ UPDATE: (1:35 p.m.) The livestream has ended. Full story on.wpxi.com/MarchForLife"},{"comment_id":"10155692576378572","commenter_b":"hit her in the ass with the INK","commenter_a":"good riddence to you old girl you will be replaced go join Isis","post_message":"SHE IS ALSO A HILLARY CLINTON SUPPORTER..."},{"comment_id":"1871395319625852","commenter_b":"I can totally see her talking to the Queens of other countries not clomping around scowling at everyone that is pretty","commenter_a":"For a GOP Super Pac to do this to a presidential candidate's wife and family is inexcusable and wicked as hell. Look at her TODAY. She will be the most glamorous and classy first lady yet and envy of the nations.","post_message":""},{"comment_id":"1196095087116904","commenter_b":"This women is craving Attention poor thing","commenter_a":"And they call this art !!!! How ??? Not on !!!","post_message":"She's doing what?"}]
