[{"comment_id":"10153875046907235","commenter_b":"So did Ollie North! The fuckery.......","commenter_a":"\"Former United States Attorney general sold guns to drug cartels.\"","post_message":"WHOA"},{"comment_id":"1208908179197618","commenter_b":"Who do any of these \"woman\" think they are? The show SUX Whoopie go eat another side of beef!!!!","commenter_a":"They are both empty headed idiots!","post_message":"Loud mouth Whoopi and her co-hosts are making serious unfounded accusations and demanding Trump step down.  Let's get 5,000 'SHARES' & 'LIKES' to show that Whoopi is the one that America wants to see \"STEP DOWN!!!\"  @webpagelink"},{"comment_id":"10153556310231336","commenter_b":"dumb racist pos","commenter_a":"Dumb niggas","post_message":"After waiting about 20 minutes while the women talked, U.S. Senator Bernie Sanders was pushed away again when he tried to take the microphone back."},{"comment_id":"949160488506463","commenter_b":"THIS IS 9AMERICA0 NOT SYRIA","commenter_a":"May I remind everyone, This is America and the judge was correct. Swear to the truth by swearing to it on the Bible!","post_message":"Did a judge violate this woman's religious freedom or were his actions justified?"},{"comment_id":"10154563996420575","commenter_b":"Obama had better shut and realize all America wants his ass fried!","commenter_a":"Oh, like he did?","post_message":"WOW! Obama says he hope TRUMP will be able to stand up to PUTIN. ---After getting steamrolled by Vlad for eight years!"},{"comment_id":"10153526411091350","commenter_b":"I don't eat in private, why should my kid have to? Most women who choose to bf in public are so good at it, you don't even notice, so don't wore about averting your eyes. When I'm at target I'm busy shopping not looking for a nip slip.","commenter_a":"I completely support breastfeeding mothers but would prefer not to see it happening while shopping. Target should be providing private respectable areas for this if they really supported breastfeeding moms.","post_message":" policy supports breastfeeding in any area of our stores, including our fitting rooms, even if others are waiting. See why moms are swooning over the retailer breastfeeding policy."},{"comment_id":"998796643515786","commenter_b":"@username You would be ashamed at how hard it is for single man or woman from any country to apply for legal citizenship in the US. The paperwork is difficult and the cost somewhat prohibitive.Add to that English is not their native language and it becomes nearly impossible. When a mexican national pays $2500-4000 to a coyote to bring him here because it's easier and cheaper, it screams how broken our system is and how strongly we ask those who truly want to come here and work, to do it illegally. We make it easier to break the law than to obey it. We, the American people are complicit in this crime at present. This activity encourages the welfare state, trains new citizens to act irresponsibly, and costs the working class American tens of thousands of dollars each for this miscarriage of justice.","commenter_a":"Wanna know how precious your American Citizenship is? To some, it is worth paying for.. Asians have the LOWEST incidence of all minorities of being on the welfare and food stamp rolls.These women are here for Freedom and the Education afforded to their children they cannot get in their home countries.","post_message":"ANCHOR BABY BUSINESS: Asian Women Paying $4,000 Monthly to Give Birth to Babies in California so they be U.S. Citizens  @webpagelink"}]
