[{"comment_id":"1370922502927793","commenter_b":"If she could somehow flood NYC with illegal aliens then yes, she could be the next mayor.","commenter_a":"Gitmo for Life for High Treason and we aren't talking emails","post_message":"After winning New York with 1.7 million more votes than Trump, could Hillary's next move be mayor of the Big Apple?"},{"comment_id":"10152876898775496","commenter_b":"Prayers for her son and family!!! The county and the contractors should be held responsible! There's no way a lifeguard should have his job if he can't swim or perform CPR! Ridiculous!","commenter_a":"Obviously the lifeguards should be able to swim and perform CPR but my question is more for the Mother ... Don't depend on other people to keep your kid safe in a pool ... That is your job as his parent ... Why are you do quick to blame another for your lack of responsibility in this? Just another story of needing to blame someone else ...","post_message":"\"The lifeguard told him that they couldn't swim to him, they didn't know how to swim, and one said that he didn't know CPR,\" See more: @webpagelink"},{"comment_id":"2471637393058961","commenter_b":"@username still better than that lying bitch you voted for","commenter_a":"Why do you guys keep asking the same stupid question...I guarantee you no one on the right has changed their minds...now maybe some on the left came to their senses","post_message":"Would you like to see this duo in the White House again?"},{"comment_id":"10153656714955575","commenter_b":"Well Baltimore is already torn up for them!!! Wonder what the blacks think about them coming.","commenter_a":"Obama is bringing Mexicans and Syrians in to train them. Terrorist that kill with weed whips","post_message":"Baltimore politicians defying logic once again. . . ."},{"comment_id":"885067018227393","commenter_b":"Moms should go to a socialist country where their values are the norm","commenter_a":"Cops are too agressive and think they are always the kings and you can't tell them anything, and they dont know the laws.","post_message":"Moms want out of America!"},{"comment_id":"10152960759722377","commenter_b":"this traitor could add votes from the foreign countries that paid her bribe money to her and bills family charity, like she will add the illegals vote here in the US when the election rolls around","commenter_a":"#ClintonResign","post_message":"The former secretary of state is looking for a more aggressive way to increase her poll numbers."},{"comment_id":"10153491721731337","commenter_b":"He's the biggest Dick","commenter_a":"Rock Star? Don't you have to be able to play an instrument? And sing? If not, then I'm the biggest rock star!","post_message":"SHOTS FIRED: Kanye West claimed to be \"THE GREATEST LIVING ROCK STAR.\" The Who responded perfectly..."}]
