[{"comment_id":"10153306552824087","commenter_b":"Good question Eli Richardson Why do straight liberal females have a problem with men using their facilities?","commenter_a":"Even though that has never happened in the couple hundred cities that already have such protections. My city (also in Texas) has had it for 6 years, never a single issue. It's pure hate of trans people. It's transphobia that drives countless people to suicide. It's unacceptable.","post_message":"The Houston Equal Rights Ordinance became better known by detractors as the “bathroom ordinance,” after opponents warned that some protections related to the use of public bathrooms would allow sexual predators to go into women’s bathrooms."},{"comment_id":"906985682657621","commenter_b":"She didn't come up with it! If she tries to patent it Nicki Minaj will sue her. Nicki said SHE came up with the word. SMH, that word has been around for 20 years.","commenter_a":"She needs to get a copyright or a patent for the word because people these days will try their best to steal your joy! IJS","post_message":"How Kayla Newman Created “On Fleek” While Her Mom Shopped At Burlington @webpagelink"},{"comment_id":"1225936470775105","commenter_b":"Bye naked fool","commenter_a":"What a worthless p.o.s. go get out its types like you we need to be rid of.","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"1215546011816966","commenter_b":"This is still AMERICA. MOST OF US STILL. BELIEVE AND HAVE LET OUR CONSTITUTION , BILL OF RIGHTS AND AMENDMENTS. WORKING IN THIS COUNTRY. YOU DONT LIKE THOSE LAWS OF OUR LAND. YOU ARE NOT A TRUE AMERICAN. SO YOU HAVE NO SAY. BECAUSE YOU HAVE NOT PASSED THE LAWS OF IMMIGRATION TO BE A CITIZEN OF THIS UNITED STATES OF AMERICA. AND JUST BECAUSE YOU ARE BORN HERE DOES NOT. GIVE YOU THE RIGHT. TO UNDO OUR LAWS. IT IS BREAKING THOSE LAWS TO DO SO","commenter_a":"Bimbo has been drinking the koolaid","post_message":"This is ABSURD."},{"comment_id":"10154497774003812","commenter_b":"On that show, women would throw their shoes at him.","commenter_a":"Wake up Ellen...","post_message":""},{"comment_id":"10154102446149749","commenter_b":"@username, STFU and go lick the pope's ass ..","commenter_a":"Well why doesn't the Catholic Church hand over some of its many billions and do something about it and relax their pathetic view on contraception No wonder there are so many of them","post_message":"The Pope laments Europe's handling of the influx of migrants and refugees fleeing war and persecution."},{"comment_id":"10153578934943984","commenter_b":"Really. Yall have to ask??? Stupid crap and a shame people think of HIM as courage. SAD. However HIS timing was planned just at the right time for the supreme courts decision.","commenter_a":"What a joke.","post_message":"Wow. Immediately after the ESPYs it became clear to those paying attention that ESPN made a big mistake. I'm pretty sure ESPN never saw this coming when they decided to give Jenner the Arthur Ashe Courage Award. Do you think ESPN was wrong to give this award to Jenner?"}]
