[{"comment_id":"10156048486720389","commenter_b":"Anyone is smarter than she is!","commenter_a":"YES!!! She knowingly wiped her server clean or had someone way smarter than her...do it for her!!!!","post_message":"Question of the Day: Do you think Hillary Clinton knowingly wiped her server clean?"},{"comment_id":"10154592681344445","commenter_b":"Yup, they are trying to invade the US as we type. Better build that wall.","commenter_a":"Now that half the Republicans in the house have been officially brain-washed, his confirmation will take place. This country will be taken over by Islam, when it happens. Bad news for women and gays.","post_message":"'I am confident he will serve the American people with integrity and a steadfast commitment to justice,' the president said. @webpagelink"},{"comment_id":"1016134701742911","commenter_b":"'@username OK as soon as I take mine out of a white woman's mouth","commenter_a":"I not very religious, but I stand with them. Obama will have you believe this country was found on Islam. I'm a proud American that enjoys the mention of God on my money, the pledge and so forth.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1592257357455136","commenter_b":"Ew. That girl is a cow","commenter_a":"Soar losers. Get over it.","post_message":"Anti-Trump protesters are outside Trump Hotel in D.C. They've been marching for two hours now.  More about road closures or traffic in D.C.: @webpagelink"},{"comment_id":"10153399838202411","commenter_b":"'Do the right thing', go away for good.","commenter_a":"Don't care for him..Chi raq was a horrible movie and I didn't even see and will never ever see it (just from previews). True Chicagoans will agree with me...Ugh, go away and take Kanye west and his family with u too..","post_message":"Happy Birthday, Spike Lee! The director of 'Chi-Raq' and 'Do the Right Thing' turns 59 today."},{"comment_id":"10153511380259641","commenter_b":"I can't believe some of the comments here - So much hate {that's not justified} :/","commenter_a":"RIP the old England, lost to Islam now.","post_message":"#TBT:"},{"comment_id":"1317246778287960","commenter_b":"She'd have been funnier if she'd have swallowed her Mic..","commenter_a":"What the he'll is wrong with these mean girls, this country? You don't do that to ANYONE! Not ANYONE EVER! This show allowed this? We teach our children it's wrong, if it was done in school it's called bullying....my God! She should lose her modeling contract!!! Stop this Madness!","post_message":"Gig Hadid threw some serious shade at Melania Trump tonight..."}]
