[{"comment_id":"10152862835371336","commenter_b":"The ft hood shooter was an American serviceman","commenter_a":"What about Benghazi and Ft. Hood?","post_message":"\"This is an act of violence, an act of terrorism that we condemn in the strongest possible terms, and we are going to stand shoulder to shoulder with our allies in France.\" – White House Press Secretary Josh Earnest on America's Newsroom moments ago"},{"comment_id":"10155111456982178","commenter_b":"True, she just lies about everything to get votes. If she wins the WH we are all in trouble. ObamaCare will continue! Taxes will rise! Food prices will rise! More people will be out of work! Education will decline!","commenter_a":"Trump: Make America Hate Again!","post_message":"NEW POLL: Donald Trump is wildly unpopular among young adults, in particular young people of color, and nearly two-thirds of Americans between the ages of 18 and 30 believe the presumptive Republican nominee is racist. wral.com/@username"},{"comment_id":"780559568801287","commenter_b":"Get a Real Job Bitch!!","commenter_a":"on welfare??? guess how much those tattoos cost>>???","post_message":"Welfare Recipients In THIS State Just Received Some DEVASTATING News  It is unethical to leech off the hard work of others.  Are you fed up with welfare moochers?"},{"comment_id":"10153011614414586","commenter_b":"Yes!!! Yaay! Way to go Peta!!!","commenter_a":"Amen","post_message":"KORA NEEDS A HOME!  #PETA fieldworkers found Kora tied outside 24/7 with little shelter or water. Her chain was so tight that it had become partially embedded in her skin. :( She is now in foster care & looking for her FOREVER HOME.  SHARE to help her find one: @webpagelink"},{"comment_id":"1281011171918910","commenter_b":"I would buy a hitman to kill grammar Nazis","commenter_a":"Your not going to win. Buy a beer instead","post_message":"What would you do with hundreds of millions of dollars?"},{"comment_id":"10153173313535090","commenter_b":"<(\") Those whom approve of ILLEGALS in our country are either here illegally themselves Or are Profiting off of them in some way. The Government equates Illegals to two things, more tax revenue for them to spend & more votes for the democratic party. To insure this, they are flooding our society with individuals from every country possible. They couldn't care less about The American Citizens or LEGAL Immigrants. To Overpopulate any country places an undue burden on it's natural resources, it's firemen, it's police, it's agriculture ( food ), it's educational & medical centers. Obama Openly stated : I will immigrate 100,000 Muslims from the middle east annually for the next 8 years... :( He recently aided 100,000 Illegals prior to a Judge filing a stay of his executive order. He & Hilary Clinton are receiving money from Saudi Arabia & other middle eastern governments to insure their agenda ...","commenter_a":"51 million immigrants in the last 8 years! When are you guys going to do your jobs and stop this madness!!!","post_message":"Do what's best for your health.   Stand in opposition to Obama's government bureaucrats: @webpagelink"},{"comment_id":"1736127839964656","commenter_b":"Maybe she should be mad at the powers to be who wanted it kept quiet.","commenter_a":"Maybe tptb should have done thing differently but since it all came out kelly has been a spoiled hateful spiteful bitch. If tomorrow is his last day I hope puts her on blast through the entire show.","post_message":"She’s reportedly not making things easy for him."}]
