[{"comment_id":"10153383373028984","commenter_b":"Why don't you go back to where you came from Asshole!!!!","commenter_a":"President Obama said the right thing.","post_message":"Israelis are NOT happy about this, and it's easy to see why. Whoever becomes president in 2016 will have a lot of work to do in repairing relations with Israel...  Do you support Benjamin Netanyahu - בנימין נתניהו and Israel despite what Obama does?"},{"comment_id":"10153186882059641","commenter_b":"hmmm as long as it's not cooking drugs, printing fake marriage certificates, scamming, and turning young girls into prostitutes... #NOTOXENOPHOBIA AND ALL ILLEGAL ACTIVITIES","commenter_a":"I hope South Africans will not hear this, they will accuse the robot of taking their job and another xenophobia again.","post_message":"This robot chef will soon be able to cook 2,000 recipes. Pity it can’t eat them: @webpagelink"},{"comment_id":"1659577024311353","commenter_b":"Trump has no chance of beating Hillary---and that is a fact. She would chew him up.","commenter_a":"Just another reason to vote for Trump!","post_message":"I'll help you PACK!"},{"comment_id":"10153304563395927","commenter_b":"Democrats own guns,.. You Brainwashed idiots...Gullible fools","commenter_a":"Because their agenda is to control the people without being contested against. Don't you read your Bible? How can a government control its people without being toppled - remove the guns.","post_message":"Criminals don't follow the law.  Why is that so hard for the Left to understand?"},{"comment_id":"863004940415197","commenter_b":"Throw her in jail","commenter_a":"Take her down!","post_message":"'Perfect' was the response Lerner used about the non-archived messaging system."},{"comment_id":"10152991625460409","commenter_b":"GOD BLESS GOV RICK PERRY. I PRAY IF THE LORD LEADS YOU TO RUN FOR THE PRESIDENCY THAT YOU WIN. YOU HAVE BEEN THE BEST GOV THAT TEXAS HAS EVER HAD. I'M PROUD TO CALL YOU A BROTHER IN CHRIST AND I PRAY THAT WHATEVER YOU ARE LEAD OF THE LORD TO DO THAT GODS BLESSINGS WITH OVERFLOW TO YOU.","commenter_a":"I never understood the concept of hurting one class of Americans helps the other! Question for Obama, if the wealthiest 1% is forced to pay their fair share as you say are they more likely to sacrifice their life style to pay the tax hike with or slash the payroll aka are jobs to pay for it ? And if given the choice between getting the rich to pay ( again as you say) their fair share or having a job to provide for my family, I'll take the latter every time!!","post_message":"This administration has failed to prioritize job creation and economic opportunity. The Washington culture may be fundamentally broken, but the American spirit that built this great nation is not. America's leaders should be working to ensure every person who wants a job, has a job. That’s what this is about – making sure mothers and fathers can provide for their families and our children have every opportunity to pursue their dreams. #SOTU"},{"comment_id":"10153136670568010","commenter_b":"Amen.","commenter_a":"Mr Stewart, your request to resign has been denied. The American people need you to shed light on the ridiculousness and political shenanigans in Washington DC. Love, virtually every American.","post_message":"'[Jon] Stewart has been a voice of astonishment and outrage, sometimes for comic effect, sometimes heartfelt and often both — a safety valve, a tonic at the end of the latest hard day, comforting confirmation that you are not the only person to find the world out of joint,' critic Robert Lloyd says of Stewart's impending departure from 'The Daily Show.'"}]
