[{"comment_id":"10153700162853010","commenter_b":"By bring them here ,you are taking food out of the mouth of those poor people.","commenter_a":"Don't we have enough ,dogs here..","post_message":"The Humane Society International has apparently taken possession of more than 100 dogs from a South Korean farmer in recent months, paying the farmer to transition to other crops."},{"comment_id":"642371742620071","commenter_b":"Her fat ass needs to get a job and off the government tit. She is a disgrace to the white race.","commenter_a":"Th dems way of welfare hz put many ppl out of th mindset of personal responsiDAMNbility!!!?","post_message":"This woman claims she deserves more welfare than others.  This is unbelievable. Let's kick this woman off welfare immediately.  Should she be forced to pay us back?"},{"comment_id":"1391527697542910","commenter_b":"She's a self-serving, self-promoting blowhard who couldn't care less about anyone but herself.","commenter_a":"Hillary Clinton may have been investigated by the FBI, but Jill Stein has a fucking arrest warrant out on her, yet she still thinks she's a plausible option.","post_message":"Memo to Dr. Jill Stein: There's nothing \"progressive\" about saying that Hillary Clinton is more dangerous than Donald J. Trump, or that Bernie Sanders is a political insider, just because they don’t pass your purity test."},{"comment_id":"826031280920782","commenter_b":"She's just disgusting to look at..","commenter_a":"About time now she can pack so she can leave !!#!!","post_message":"Liberal trash has no place on tv.  This is the best news all year.  Do you think Whoopi deserves to be kicked off the air?"},{"comment_id":"652127268253788","commenter_b":"To you Mrs. Michele Obama I say name me just one all white college. I am not racist, I do have several black friends. Being white of course I do have more white friends, then black friends. They seem to under stand my point. But for blacks to say they can't go here or there. I don't see those barriers. I wish we all can stop this racist name calling g and pointing fingers, at each other. I know I can name at least 4 black colleges. I just want to know if anyone can name me just one all white college.","commenter_a":"why is she there? go home & drink some tea","post_message":"A race baiter who is not proud of her country."},{"comment_id":"572844126217923","commenter_b":"Before you build the wall could we please shut down all the tunnels underneath the fence?","commenter_a":"Jason Messenger","post_message":"WOW! An honor to be the first-ever presidential candidate in a primary- to be endorsed by the National Border Patrol Council. WE WILL BUILD THE WALL-- WE WILL MAKE AMERICA SAFE AGAIN! Thank you."},{"comment_id":"998273030249779","commenter_b":"Men use mens room women use womens room","commenter_a":"obama done it allready","post_message":"Once again the president wades into a state issue, ignoring the will of the people.   @webpagelink"}]
