[{"comment_id":"867761519952633","commenter_b":"Illegals can get drivers licenses in NC.....no problemo! Dumb!","commenter_a":"Illegals can drive drunk but I can't. Now that's discrimination. Lol","post_message":"BREAKING: Leaked Document Reveals SICKENING Order Obama Just Issued To Border Agents President Barack Obama has issued a new order for the Border Patrol not to arrest drunk drivers because driving while impaired is not a federal crime. The notice, With Alcohol-Impaired Drivers, directed the 4,000 U.S. Border Agents in the Tucson... #arrest #borderpatrol #drunk @webpagelink"},{"comment_id":"554182668075021","commenter_b":"What lower wages, you mean lower taxes. If you don't want to birth a child, just keep those nasty little knees together","commenter_a":"They are poor, jobless and believe the American dream is dead because they are stupid enough to keep being tricked into voting democrat.","post_message":"Last year was the first time that millennials surpassed baby boomers and Gen-Xers to become the largest voting demographic in the US."},{"comment_id":"10153047179381323","commenter_b":"Katie price is entitled to exactly the same as everyone else she is a British citizen who pays her taxes so she and her children are entitled to use the Nhs. Maybe we should be concentrating on people who arnt entitled coming to this county just for the benefits and Nhs and maybe the government should be claiming back the millions we loose in this way. I don't expect Katie price or other celebs are a drain on our economy as some people who claim benefits with no intention of ever working.","commenter_a":"The benefit system isn't struggling & costs being cut because of Katie Price, it's struggling because of the generation of freeloaders who see Benefits as a career choice, people who can work & pay taxes but don't; If everyone in this country that can work had the right work ethic we wouldn't be in half the mess we are. I was always brought up benefits are for those who need it for clothes, warmth, food, the essentials - including specialist care for the disabled, people nowadays have full sky packages watched on 50\" tvs, have a social life and go abroad for holidays all from benefits, where's the incentive then to get off their backsides and go to work. Whilst I'm not her biggest fan Katie price pays much more than her fair share in tax, she's a grafter & a worker, her son deserves his benefit rights in return","post_message":"\"This is exactly why universal benefits matter. Defend the right of mothers of disabled children, such as Price, to get help, and it reinforces the rights of everyone else. That’s how society works. Strengthen one pillar and the other gets bolder; weaken one and it won’t be long before they all start to crumble.\""},{"comment_id":"10153483204295667","commenter_b":"Nardine","commenter_a":"Robert Taylor","post_message":"Do you see a ghost in this photo? Henry Yau took this photo at the Stanley Hotel, the real-life inspiration for Stephen King's 'The Shining.' Yau says no one was on the stairs."},{"comment_id":"10157488430805354","commenter_b":"Lock her up !","commenter_a":"She should strike her","post_message":"***Viewer Discretion is Advised*** The mother, streaming live on her daughter’s account, tore into and struck the 16-year-old numerous times for posting provocative photos of herself on Facebook...."},{"comment_id":"409554185871204","commenter_b":"Like we could depopulate people that breed like rats.","commenter_a":"Depopulate Mexico is the name of the game. Guess who benefits?","post_message":"The case of the 43 missing students in Mexico has galvanized discussion and efforts to locate thousands of others who remain missing."},{"comment_id":"10154858559120259","commenter_b":"Good! I hope they lock that bitch up for as long as they can!","commenter_a":"Time for prison.","post_message":"Student Nikki Yovino claimed she was raped by two football players, both of whom lost their scholarships and maintained the sex was consensual. Now, Yovino admits it was a lie designed to gain sympathy from another man she liked. She now faces charges that could bring 5 years in prison if convicted."}]
