[{"comment_id":"734125933387254","commenter_b":"Simple: muslims support SHARIAH law. This is a system which cannot coexist with our laws, which are based on the Constitution.","commenter_a":"I feel like no republican has ever read the constitution. The first amendment clearly separates church and state. As long as the president doesn't bring their religion into their work, then it shouldn't matter what religion they are.","post_message":"Ben Carson says the unsayable. [Read below]"},{"comment_id":"1038359476176309","commenter_b":"Hope they catch her she is a predator","commenter_a":"Where Racist Al Sharpton? If he is against HATE crimes then why wouldn't he and his Racist organization make a big outcry about this hate crime. Oh! I must be dreaming......... For a racist pig like Al and his followers to make a peep to the news media about such a HATE crime, it would have to be a white on black crime with white police men cheering on the beating.","post_message":"Life in Obama's America  Disturbing video of a white woman (holding her baby) being attacked by blacks, as blacks film and laugh at the attack."},{"comment_id":"858391040863023","commenter_b":"Hillary should be strapped to the front of the bus in bumper to bumper traffic.","commenter_a":"another clown to join the clown bus! Out of touch with reality","post_message":"Dr. Ben Carson is running for president. Here's where he stands on the issues..."},{"comment_id":"10153614768367550","commenter_b":"Women shut da hell up I'm short hand writing","commenter_a":"People be ready to dissect the situation, wen in reality it's the system fault. What do you expect it's no jobs in Fayetteville. People looking at what I'm saying and they're lik Wat is he talking bout. Like I said it is no jobs in Fayetteville, and this is suppose to be a military town it should be jobs all over the place but it's not. It's three types of ppl in Fayetteville. The military, the civilians that's what they call us. And the third is ppl who do what ever it takes to get paid or feed they family. Now don't get me wrong yea it's messed up ppl breaking in ppl houses. But give these ppl job's and I bet all the money in the world they become a better civilian then the first person who commented on this topic. @username. No job's and this is Wat u ...","post_message":"\"And you're charged with a similar crime that you just went to prison for?\"  \"Yes, Sir\""},{"comment_id":"10154325578499255","commenter_b":"hurry with that wall.and maybe with all the money they make they will build it for you.","commenter_a":"The Republican Establishment goes nuclear.","post_message":"This has to sting.  By Daily Kos user ericlewis0"},{"comment_id":"10153648281727093","commenter_b":"What an ignorant woman.","commenter_a":"She shoulda kept her mouth shut. Definately part of the problem not the solution... Our Dallas officers have absolutely ZERO to do with the recent ON CAMERA MURDERS of those men. So NO JOHNSON IS NO MARTYR. HE WAS A VILE POS THAT GOT JOHNNY C4d","post_message":"The first African-American Miss Alabama said she knows it's not right to feel this way, but can't help it... @webpagelink"},{"comment_id":"10154027986557293","commenter_b":"She might Not be a ten but she still has Some Nice tits","commenter_a":"Can i drAw your Attention to an unrelated issue though; Chelsea , Being a mildly Hot Chick, is married to a nerdy looking dude with Glasses. I absolutely hate iT when beauriful women marry or have a relationship with nerdy looking men","post_message":"Ivanka Trump says she supports working moms. The women who design her fashion line don’t get paid maternity leave."}]
