[{"comment_id":"10153154951847994","commenter_b":"Finally a judge with a brain! you go girl! They should get life but sadly they will have some tear jerking defense and will probably get ten years.","commenter_a":"Wow, this was compelling!!!","post_message":"A judge is furious over the death of a little child -- and she let the suspects hear it. She says watching their police interview footage was more like watching a cable TV show.   Read more about the case here: @webpagelink"},{"comment_id":"10153455879676350","commenter_b":"Yeah a good dad would have married her","commenter_a":"Give it up. There are lots of dads out there that do the same","post_message":"\"In my stupid and exhausted brain, I thought only mothers should be that calm with a brand new baby, but it took only minutes of watching Carson with Jack and I knew...he was meant to do this.\"  Read Siri's sweet words about Carson Daly."},{"comment_id":"1546155322346073","commenter_b":"A Butt Ugly Bitch!","commenter_a":"How sad he is But...wait pediphiles will be the next protected people","post_message":"This is the crux of the problem"},{"comment_id":"10153833789564411","commenter_b":"Israel has been there 3000+ years as proven by archaeology. it's palestine who are the invaders. It's the SECOND palestine if you've studied history. They're Syrians and Egyptians as confessed by the PA itself. They even use the flag of Jordan.","commenter_a":"Guys Guys Guys u no one thing turkey is number one trading partner of isreal....And turkey is first country who excapt isreal as a brother Nation......And turkey is N.A.T.O mamber what N.A.T.O did in libya Afghanistan Iraq and somaliya u no batter then me......Down with Erdogan Down with Turkey...long live Palistayin","post_message":""},{"comment_id":"927307860637643","commenter_b":"Don't exist anymore? Are you serious?","commenter_a":"Kkk really doesn't even exhist anymore. And this has nothing whatsoever with the kkk. This dude was probably killed by other gang bangers and the gators got him. I would like to know where In the hell you come up with the kkk our of this story?","post_message":"It's looking like the police, the courts, the whole town are covering up for the KKK. What do you think?  From (Y) Counter Current News - MBD"},{"comment_id":"10152457331185736","commenter_b":"@username try FUCKING OFF!","commenter_a":"143 year old coins and documents where buried in 1795? Something doesn't smell right.","post_message":"The time capsule buried by Paul Revere in 1795 has finally been opened and the contents date back to 1652.  Mobile: @webpagelink"},{"comment_id":"10155588637195389","commenter_b":"Amen!!! Good post...","commenter_a":"Every police officers in this country should take their badges to the white house and give it to the biggest racist in the country.","post_message":""}]
