[{"comment_id":"10152968274184099","commenter_b":"Thank God!! These kids don't know what they are doing to their parents and the dangers there are out there. Stay ya tail in the house.","commenter_a":"Glad she is safe","post_message":"A missing teenager who left her Edgemont home more than a week ago wearing only pajamas has been found in Manhattan, police said. @webpagelink"},{"comment_id":"695324637324781","commenter_b":"Get ISIS and obammy out of AMERICA first. We need to protect ourselves and children. Then we can help ours.","commenter_a":"Wipe them off the face of the earth!!!!!!","post_message":"An innocent American girl was found in the middle of this ISIS debacle. America now truly stands with France against ISIS. Do you think that America should wipe ISIS from the face of this planet?"},{"comment_id":"10153419994402426","commenter_b":"Because it is one agency that makes money, not cost the tax payers to operate.","commenter_a":"Theyre smart. When people are snowed in, they drink.","post_message":"Is Virginia sending a mixed message?"},{"comment_id":"10154071850239456","commenter_b":"Look for Huckabee at VP","commenter_a":"He will make a great VP","post_message":"Do you think he made the right decision?"},{"comment_id":"10152851658596636","commenter_b":"I am Muslim..&I say Good For Them! I hope it's banned allover the world..it has nothing to do with Islam .. It only has to do with Extremism &safe wise.. It's very dangerous...in many cases it's being used by terrorists..men or women escaping the law...etc","commenter_a":"Should be banned everywhere in the civilized world, its loved by fanatics, it belongs in regressing places like the Isis caliphate only.","post_message":"The Government says the move has 'nothing to do with religion'"},{"comment_id":"1656487827976632","commenter_b":"\"a balanced choice between having a heart and having a brain.\" Really? Who wants to vote for a thyroid? ha.","commenter_a":"@username is a balanced choice between having a heart and having a brain. The two are not mutually exclusive. #JohnsonWeld2016 #Libertarian #FreedomEquality","post_message":"Sarah Silverman and Bill Maher spent a portion of Real Time with Bill Maher Friday wondering why 29 percent of millennials – many of them former Bernie Bros – have ticketed their vote to Libertarian candidate Gary Johnson instead of Hillary Clinton. \"Gary Johnson is a fucking idiot,\" Maher said."},{"comment_id":"903633816370041","commenter_b":"I saw this when I heard about it on the radio this morning. Lol","commenter_a":"Rudis Fernando Amir Casey Jeremy Jose Antonio damn","post_message":"No Brotherly Love: Eagles Play Drake's Back 2 Back Diss During Practice!"}]
