[{"comment_id":"1738314809766910","commenter_b":"She should have moved here...we don't know who she is","commenter_a":"no matter what happened, she is the one who took the decision (??!) to take her own life. Unfortunately, she seemed a desperate and lost soul...","post_message":"Screenshots and soundbites from the video were mocked by Italian social media users and YouTubers."},{"comment_id":"10155205840346337","commenter_b":"@username illegals work every job of the spectrum not just in the fields.","commenter_a":"So these restaurants openly hire illegal workers,,,,hmmmm.","post_message":"American eateries will be shutting down to show solidarity with immigrant workers."},{"comment_id":"10153600166447217","commenter_b":"^That is a true life goal","commenter_a":"@username And we're sat here watching tv and being casual XD","post_message":"Life goals."},{"comment_id":"1150014275011477","commenter_b":"Will miss this talented actor....such a great sense of humor intertwined in his roles as \"the villain\".","commenter_a":"Quigley Down Under with Tom Selleck","post_message":"JUST IN: British actor Alan Rickman, known for roles in Robin Hood, Harry Potter, Die Hard, more, passes away at 69: @webpagelink"},{"comment_id":"10153173721809091","commenter_b":"👎 on your comment sammi","commenter_a":"How many 15 year old boys get to bang a pro cheerleader?","post_message":"Molly Shattuck collapsed to her knees inside the courtroom as the judge handed down her sentence for raping a 15-year-old boy:"},{"comment_id":"10153121291663984","commenter_b":"Not only false , but evil. Send them out of here !","commenter_a":"She has the right to distrust Muslims. Islam is a false religion it's really a terrorist organization.","post_message":"Her critics are attacking her mercilessly for what she said last week, but this Republican is standing by her comments. Do you agree with her?"},{"comment_id":"1145540435508072","commenter_b":"No job , 6 kids , no husband . Stop !","commenter_a":"Waited in line for six hours if you would've been working kids would've ate","post_message":"Entitlement Mentality: Welfare Recipients React to Food Stamps Being Cancelled. This shows everything wrong with the entitlement mentality."}]
