[{"comment_id":"10153046284854705","commenter_b":"I wish someone would put that pig back in the barn and close the door. I'm sick to death of her nasty face.","commenter_a":"Who would buy that! ?!","post_message":"Kim Kardashian just out-Kardashian-ed herself."},{"comment_id":"10157928279665500","commenter_b":"Why did they have babies to begin with? People like them have no business having babies - period. Don't believe in birth control - don't have sex.","commenter_a":"This makes me sick! The parents don't look like they missed any meals! Lock them up and throw away the key!","post_message":"The nurse also told police there were feces in one of the child ears and that the child looked  a skeleton. @webpagelink"},{"comment_id":"1584761528498475","commenter_b":"Women should have the right to decide, but whomever is willing to oblige her and perform the abortion should be arrested and thrown in prison for being willing to be an accomplice to a murder. If it were illegal for doctors to perform abortions then she can decide all she wants. Decide away!","commenter_a":"Nicholas Moore","post_message":"If you think Trump has bad ideas - Gov. Mike Pence has actually taken women's rights away. These two make up one of the most anti-woman tickets in history!"},{"comment_id":"1204773886285528","commenter_b":"Stridency is an anti-female word. Women are supposed to be quiet; it they are not, they are \"strident\". What you mean is they are being impolite by interrupting. I agree with that. Nicolle Wallace should think twice before she goes up against Rachel; however, that's what she is being paid to do.","commenter_a":"The stridency of the women on the panel, Rachel Maddow and Nicolle Wallace, that they use to interrupt each other and Eugene Robinson (they rarely allow him to finish a sentence) continues to be an annoying distraction to what could be a very useful and informative conversation.","post_message":"Follow our live blog for the latest updates! #Decision2016"},{"comment_id":"598846743608854","commenter_b":"Death by hanging move to the front of the line two weeks should do","commenter_a":"It's like they are forcing you to become a racist.","post_message":"BREAKING: White Female Cop Shot By Thug Hours Before She Was To Go On Maternity Leave [VIDEO].  This is tragic, let's send our prayers.  Can we get 10,000 'LIKES' for this poor officer?"},{"comment_id":"10154973031601509","commenter_b":"yah ! you r big brother of DONAL TRUMP .","commenter_a":"Farage is a racist. And Trump is a racist. Racists love each other.","post_message":"Brexit leader Nigel Farage: Donald J. Trump \"dares to talk about things that other people want to brush under the carpet... For the United Kingdom, I think Trump would better for us than Barack Obama's been.\" @webpagelink"},{"comment_id":"1032286876827841","commenter_b":"Yes most LEGAL immigrants do but not the illegal invaders.","commenter_a":"Immigrants pay more taxes and work harder than SOME AMERICANS.... i know some","post_message":"Most Americans agree: We must provide a path to citizenship for our immigrant families."}]
