[{"comment_id":"546390502218196","commenter_b":"WHAT A ASSHOLE. !!!","commenter_a":"He is a Muslim!","post_message":"Obama threatens inprisoning military personnel for defying him. This is outrageous. He is drunk with power. Do you think Obama is a tyrant?"},{"comment_id":"1246596595370794","commenter_b":"I commend you for being relentless and honorable. It is a very hard row you hoe in the cesspool in Washington D.C. I hope you have hazmat insurance. With deep respect, SFL","commenter_a":"Hon Gowdy, you have the support of the American people, Why, please tell, has the Congress of the United State, officials that we, the American people elected to represent us th the American peo have not brought charges against the current Administration, contempt, treason, murder, deriliction of duty, incompentence, assisting the enemies of the United States, Why Senator? Why? Why are you with the help of the rest of Washington letting us down?","post_message":"It’s taken way too long and way too much of our energy in simply gaining access to #Benghazi documents and witnesses. There continues to be time wasted negotiating with executive branch entities who do not want to give us what I believe Congress is entitled to."},{"comment_id":"10154161281331636","commenter_b":"But if you are in line at the time of closing they have to stay open to allow you to vote. This orange plague on our Country needs to GO!","commenter_a":"Seriously he doesn't like democracy you elect him you'll have a dictator who you will have to overthrow","post_message":"BREAKING"},{"comment_id":"1495322403831141","commenter_b":"please God help them find this little man let him be safe please let him go home with his family and friends","commenter_a":"Does anyone know where we meet tomorrow to volunteer to search?","post_message":"KPRC2 Robert Arnold is headed out with a couple of people who are helping with search efforts for Marcus McGhee in Pearland. MORE-->@webpagelink"},{"comment_id":"10154232027346491","commenter_b":"Tom....amen","commenter_a":"PRESIDENT DONALD TRUMP, PRESIDENT OF THE UNITED STATES OF AMERICA...EVEN THOUGH obama DIVIDED MORE THAN ANY SITTING PRESIDENT... SHOW YOUR BIAS time mag...THAT'S WHY YOUR PART OF HISTORY, AND NOT FOR THE PRESENT !!!!","post_message":"How TIME Person of the Year runner up Beyoncé went from pop star to political force. @webpagelink"},{"comment_id":"10154479545156320","commenter_b":"Because of a speech. Sheeeesh","commenter_a":"What an amazing speech by everyone last night at the convention.I really think Hilary Clinton will be the President of the United States of America.","post_message":"12 years after rising to national prominence at the 2004 DNC, President Barack Obama took to the convention stage to try to bolster Hillary Clinton's candidacy to succeed him. #DemsinPhilly"},{"comment_id":"10154162897758855","commenter_b":"@username I was fondled by an obnoxious straight woman at a bachelorette party at a gay bar. She would not stop. I grabbed her hands and she told me never to put my hands on a woman. She was thrown out of the bar","commenter_a":"What gay man would touch a woman's crotch and breasts..? That doesn't add up in the least... Also what about all the sexual harassment done by straight women to gay men? Are we going to completely ignore that?","post_message":"What role do gay men have in sexual harassment?"}]
