[{"comment_id":"778598825583664","commenter_b":"Don't let Chump Trump know you Clown Car passengers responded to a Megan Kelly article...She is the enemy...Have you Repubics forgotten...Clown Car Rolls On","commenter_a":"Hey Tim, I like the pocket pool!!!","post_message":"Pulls no punches."},{"comment_id":"10154042885608352","commenter_b":"N BITCH U HELLA UGLY..LOL.LOL.N GET UR HAIR FLAT IRON POOFY HEAD HOE!!YEA U A DIRTY HOUSE HOE,YEA U CAN STAY MAD,WAY N ALABAMA. TALKING SHIT..YEA U WOULD...","commenter_a":"SHE TALK ALL THAT. SHIT,N SHE A PUNK ASS HOE!!!MAKE US WOMEN. LOOK. BAD N US WIFE'S....DUMB ASS!!","post_message":"Mo'Nique Defends Letting Her Husband Have A Side Chick! Says 'That's When The Relationship Is Real'"},{"comment_id":"1048961388493889","commenter_b":"@username and what do you mean by Americans pay for illegals not you I am an American last I checked","commenter_a":"I don't know what your being told but Obama has more people deported than any other president. ...I see it constantly in the Hispanic news channels","post_message":"CIS found that criminal prosecutions for immigration offenses have dropped 36% over the last five years and due to sanctuary cities policies, the detention of illegal aliens in jails is down by two-thirds."},{"comment_id":"873971869318028","commenter_b":"You can hack those toys so easily","commenter_a":"Junior Marquina Perez & @username I WAS NOT ABLE TO SEE YOUR REPLY :'(","post_message":"Do your kids like the Minions? One family did a double take after hearing their 5-year-old daughter's McDonald's Happy Meal Minion toy speak:"},{"comment_id":"10152776917200779","commenter_b":"Bitch please...","commenter_a":"Too late, President Obama, you should have spoken out earlier!","post_message":"President Barack Obama voiced his disapproval of the recent rioting in Baltimore in a press conference today. \"There is no excuse for the kind of violence that we saw yesterday,\" he said. \"It is counterproductive.\""},{"comment_id":"1988963441329253","commenter_b":"LOL I never ever listen to any of her crap music.","commenter_a":"Thats right America! Keep giving your money to hollywood libs! Making them millionaires! She and her thug hubby laughing all the way to the bank...","post_message":"***FIRESTORM*** An online #BoycottBeyonce campaign to boycott Beyoncé and her music has picked up steam since the pop star performed a controversial tribute to the Black Panthers during the Super Bowl halftime show on Sunday....Developing..."},{"comment_id":"10152923499612217","commenter_b":"Are you tired of that excess fat in your body,having serious menstrual pain, weak erection, stretch mark,insomnia, stroke,fertility problem,pimples or any rough skin? We have the best and most affordable products for you.To get any of our products contact @username, BBM -2BDA0E2A.","commenter_a":"deepest sympathies to the families of all of the victims.......","post_message":"What we know about some of those who died #RememberTunisia"}]
