[{"comment_id":"10153035169591051","commenter_b":"Execute her how could she","commenter_a":"They are raising a bunch of animals!","post_message":"This 14-year-old killed a 2-month-old because she didn't want her mother to adopt the baby girl."},{"comment_id":"650948841696821","commenter_b":"Yup","commenter_a":"'@username smh crazy sheeeet","post_message":"Damn."},{"comment_id":"10153321006269087","commenter_b":"What fucking jobs are the illegal immigrants are taking dum ass?? Please fucking tell me!!!","commenter_a":"94 million Americans are not working. Is it because they have become dependent upon the government? Or is it because the Illegal immigrants have all the jobs? 30 percent of all federal prisoners are illegal immigrants. Immigrants are killing Americans: According to the Center for Immigration Studies, 57 percent of the 76 fugitive murderers wanted by the FBI in 2009 immigrants entering the country illegally have a criminal record in the U.S.: In 2010, the Border Patrol reported that 212,000 illegals were caught in the Tucson, Ariz., sector alone, and as many as 30 percent of them already had a criminal record in the U.S. The Pew Research Center estimated that there are nearly 12 million illegal aliens in the nation and the key word is 'estimated'. What's wrong with deportation of illegals? The answer is: nothing. The country would be greater without them.","post_message":"'The idea of tracking down and deporting 11 million people is absurd, inhumane, and un-American,' Hillary Clinton tweeted. 'No, Trump.'"},{"comment_id":"489237724600141","commenter_b":"Fuck that dumb wench","commenter_a":"How about if you criticize a Catholic, a Jew or any Christian. What hell makes Muslims so special?","post_message":"Hillary Clinton is attempting to make it punishable by law to criticize Islam.  She just crossed the line. We can put a stop to this, let's end this right now.  Can we get 20,000 'LIKES' for freedom of speech?"},{"comment_id":"10154735713113132","commenter_b":"She lives for the fame..controversy and all.","commenter_a":"Why discuss this with tabloids? What does her children gain from it? That's private. Quit putting your kids out there to be vulnerable like this.","post_message":"Kate Gosselin is opening up about her son Collin."},{"comment_id":"10154338661984087","commenter_b":"Keep sucking off your Arab whore","commenter_a":"Raper of Ex Wives and groper in chief","post_message":"“Look to his past to see what he will do for women in this country,” Omarosa said about Trump."},{"comment_id":"10153845765260950","commenter_b":"'@username are you a woman? No! Then it's not your say!","commenter_a":"Republicans already passed a Zika bill. Democrats voted against it because defunding planned parenthood was attached. Democrats had rather murder the unborn than prevent the born from being deformed. You see stopping Zika is bad for buisness at Planned Parenthood!","post_message":"President Obama blasts Republicans in Congress for refusing to approve requested amount to fight against Zika."}]
