[{"comment_id":"10154093507104087","commenter_b":"Kiss my ass illegals","commenter_a":"He'll 80% of all Americans desrespect Obama today,but we know the bias mainstream won't tell the truth,Obama lied to all Americans","post_message":"\"Many birthers believe that Obama is not an American because deep down, they believe that anyone who is not white and a Christian is either not an American, or an American with an asterisk.\""},{"comment_id":"10152702993831636","commenter_b":"would rather pay for a second hand BMW than be involved in a spit roast with her","commenter_a":"sex united fc Siddhant Behera Sanket Mohanty","post_message":"Manchester United have found themselves at the centre of another sex story..."},{"comment_id":"1027313147330802","commenter_b":"Jerry, I hadn't thought about Arab nations not taking them for that reason. So-called common wisdom has it that they don't want them because they're potential troublemakers. Your idea makes more (and scarier) sense.","commenter_a":"I don know if anyone realizes what is going on. I always tried to grasp the larger picture; go from the general to the specific and not the other way around. Europe and soon America are under invasion. None of the typical Arab countries have taken the Syrian refugees. Fact. Why? Because they want them to overwhelm the western nations. Infiltrate the society. Surround the culture and change civilization as we know it. At that point, it done. Pretty simple, isn it? Sorry, not if I can help it. Islam is a political movement masquerading as a religion. Smell any coffee?","post_message":"Muslims Tried To Go Big In This U.S. Town, MAD Patriots Shut Them Down (VIDEO) @webpagelink"},{"comment_id":"954050234691229","commenter_b":"The N-word isn't flying over the state capital, Dumb Dennis! And you don't even know the majority of blacks.","commenter_a":"Cops didn't shoot her down. We're making progress.","post_message":"An activist in South Carolina has taken down the confederate flag at the State Capitol"},{"comment_id":"1017809398240071","commenter_b":"Thought it was a low-res depiction of a chicken...","commenter_a":"Lexi Langlinais !!!","post_message":"A huge asteroid is set to pass close to Earth."},{"comment_id":"964183830350156","commenter_b":"Somebody give that girl a sammich!","commenter_a":"Kellyanne looks like she is about to physically break down. I would feel sorry for her, but she brings this entirety upon herself.","post_message":"\"'Alternative facts' are not facts. They're falsehoods.\" Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it. Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"10153729476553433","commenter_b":"Why oh why does she lie so?","commenter_a":"Both parties are dead, the American Political System is dead. We need a complite overall. Let's start by Bernie and go from there!!! Two things need to happen A major bring out the vote campaing.....Bernie need to win by a landslide If that is not enough we need to come out into the streets by the millions and demand justice....even the day of the convention.....send a clear message that we are not going to take it anymore!!! THE AMERICAN PEOPLE ARE READY FOR A REVOLUTION TOGETHER WE WILL WIN BERNIE SANDERS 2016 President for ALL People The only choice #Bernie 2016 #FeelTheBern #WeWillWin","post_message":"Carly Fiorina said Gens. Petraeus, McChrystal, Mattis, Keane, Flynn all \"retired early because they told President Obama things that he didn’t want to hear.\" Well, Gen. John Keane retired in 2003, for starters. @webpagelink"}]
