[{"comment_id":"684314941708338","commenter_b":"You pussy","commenter_a":"A vote for Trump is a blatant vote for racism. I'm so embarrassed at the people who support such hatred.","post_message":"Skywriters' message for Donald J. Trump: \"America is great. Trump is disgusting,\""},{"comment_id":"10154154880759087","commenter_b":"And if Bill's affairs are on the table, so are Melania's published nude photos, including her lesbian poses.","commenter_a":"Stupid people can't even see that their party is in shambles because of this animal. PS- Bill isn't running for President, HRC is. If you're gonna judge spouses for their lack of control or influence in their marriages, then where's your criticism of Melania?","post_message":"\"They will elect Donald Trump and Mike Pence because they know that this is our last chance to keep our nation from plunging over the cliff into an abyss of debt, weakness, and servitude.\""},{"comment_id":"10152957013791336","commenter_b":"It's NOT HEALTHY to break into their homes or rob them or attempt To hurt their families......","commenter_a":"Why are all Americans so obsessed with guns, it's not healthy.","post_message":"Bonnie and Clyde's infamous pistols of choice — What are they worth? Find out tonight at 8:30p ET on Fox News Channel. (via Strange Inheritance)"},{"comment_id":"343579349178913","commenter_b":"Nobodynis beyond the law!! ARREST OBAMA AND CHARGE WITH TREASON!!!","commenter_a":"That's because they are all STupid, and follow their leader and Nancy P.","post_message":"ICYMI - Nearly Half of Democrats think Obama Should Have the 'Right' to IGNORE the Courts!"},{"comment_id":"1775585642697945","commenter_b":"The dresses are hideous, in my opinion, but leave that baby ALONE! She's beautiful!","commenter_a":"She ain't that cute now but y'all watch she will be a real life ugly duckling story when she gets older","post_message":"Blue Ivy is getting harassed on the internet again."},{"comment_id":"10154466561263701","commenter_b":"Shawna you just said what I'm thinking!!!","commenter_a":"Reading these comments show that the majority is against her, read a trump article and the majority is in favor of him. If she wins we will know how truly corrupt our election system is.","post_message":"What did you think of Hillary Clinton's DNC speech?"},{"comment_id":"10153452535630399","commenter_b":"Your attempt at cleverness comes off as fairly moronic.","commenter_a":"Obama should go to China........he might love being with his fellow Commies so much he Might not want to come back....","post_message":"Scott Walker takes on...Chinese economics."}]
