[{"comment_id":"10153643322467434","commenter_b":"@username, I am an actress...I can rip you apart in iambic pentameter. Words do matter and so do definitions. In order for RAPE to occur, SEX has to happen...or it is considered MOLESTATION...","commenter_a":"Wow...semantics. Yes, Brock Turner DID have sexual relations...or else he couldn't have RAPED her. Sex is kind of a requirement...the headline does NOT say \"consensual\". #GoodGrief","post_message":"Just because the law smiled upon a man who had sex with an unconscious woman behind a dumpster doesn’t mean this group of angry, armed protesters will do the same."},{"comment_id":"10153005003572377","commenter_b":"Obama in the Alaskan wilderness? Ha, Grylls will be smothered by the Obama entourage!","commenter_a":"Guess I won't be watching that show any more unless. .......Obama doesn't make it!","post_message":"President Obama will soon be running wild Bear Grylls in the Alaskan wilderness."},{"comment_id":"1001780713207758","commenter_b":"Like we weren't already?","commenter_a":"So how many of his baby-mamas and illegitimate kids do we now have to support? Any more than usual?","post_message":"Protesters Said this Cop Shot an Unarmed Teen for No Reason. Here's the Video."},{"comment_id":"930249893698207","commenter_b":"@username tell that to these women and many more @webpagelink","commenter_a":"Hillary takes millions from country's that rape girls at 9... Legally. And where woman can be beat stoned or imprisoned just for reporting rape.. What happened to the war on woman? Oh, big $$$$$$$$ Oops, my bad","post_message":"Hillary can't do it without you. Sign up to volunteer: @webpagelink"},{"comment_id":"880663015326781","commenter_b":"Alex Peterson hahahaha","commenter_a":"Tyler Simmonds @username Ashley Mckendrick","post_message":"Dolphin seduced me, claims man who had sex with marine mammal."},{"comment_id":"10153911608872577","commenter_b":"The definition of terrorist declares them terrorists.","commenter_a":"No, a Heavily armed group of people using fear and power to push their beliefs on a government is what makes them Domestic Terrorists.....","post_message":"Non-violent occupation now considered domestic terror. #CNN #Bundy #Oregon @webpagelink"},{"comment_id":"1736968439901263","commenter_b":"@username - nobody in this world is a bigger liar than Hillary. Period.","commenter_a":"Why is it when her lips move my first thought is liar liar pants on fire...when will she tell how much she took from foreign governments - oh well, what difference does it make anyway","post_message":"Watch: Hillary Clinton suggests Donald J. Trump hasn't paid his taxes."}]
