[{"comment_id":"10152694220270736","commenter_b":"She doesn't have a soul.","commenter_a":"I'll be dead because of you then crashing sounds pretty intentional to me. How this person can even consider entertaining not guilty is beyond me. May the terror and the guilt of this tragedy eat her soul.","post_message":""},{"comment_id":"10154608695637994","commenter_b":"These girls are exactly why we have insecure girls in high starving themselves! There are consequences to your actions! I bet she ain't laughing now!","commenter_a":"I was just wondering what happened with this.","post_message":"Playboy model Dani Mathers could face prosecution for posting a photo of a naked woman, without her knowledge, in the locker room of an LA Fitness. Mather posted a photo of the naked woman in July to her Snapchat with the caption, I can unseen this, then you can either. Do you think she should spend some time in jail?"},{"comment_id":"10153950593368984","commenter_b":"MAXAMED : WITH THIS NAME YOU SHOULD NOT BE SHOWING OFF!! JEWS ASURE THE WHOLE PLANET BELONG TO THEM, WHAT SAY YOU? FIRST CHANGE YOUR RIDICULOUS NAME, THEN AFTERWARDS CUT YOUR PENIS, ONLY TO SAVE THE WORLD OF PEOPLE LIKE YOU.","commenter_a":"A simple answer: If Muslims need to be treated like Muslims, then they should commit their crimes in Muslim countries. When in America, do as Americans do!!!","post_message":"Muslim inmates decided they needed special treatment because an Islamic holiday was coming up, so they started making insane demands. That's when the jailers responded with some unexpected news..."},{"comment_id":"1557909130909006","commenter_b":"Go watch FOX bitch...","commenter_a":"Because guns cure racism and misogyny. Vice you are officially the retarded wing of journalism.","post_message":"What radical black womanist politics organized around self-defense actually looks like, and why it matters."},{"comment_id":"10154323192091051","commenter_b":"Where do you people come up with this nonsense?! How is $30, for an ID, that lasts for years, beyond anyone's budget? The only people that can't get IDs, are people that are here illegally! FYI: states, and various organizations, will pay for a poor person's ID; There are no excuses!","commenter_a":"Lets get one thing straight, it isn't about the ID cards. Its about how, where ,what ,when ,and cost of those cards that determine whether they are a fraud protection, or a voter suppression! If IDs are required, it should be incumbent on the states to see that every eligible voter has one, therein lies the rub! By charging for them, even a little, it puts it out of the reach of some peoples budget. By placing the outlets for the cards away from wards and precincts with opposition voters in large numbers, such as the inner city that tends to vote Democratic, you can insure that many won't have them and therefore affect the vote. By requiring a special card and locating it well away from colleges and universities, you can limit the number of out of state students that vote, especially when the college is rural, since students ...","post_message":"Michigan legislators just passed the strictest voter ID law in the nation. Do you support voter ID laws?"},{"comment_id":"915633041826559","commenter_b":"Nah she just pays for herself. Greedy money grabbing witch.","commenter_a":"And so............she pays her female staff less thrn her male staff. GOOD job hillary","post_message":"Equal pay isn't a women’s issue. It's a family issue. It's an American economic issue."},{"comment_id":"10153825778449877","commenter_b":"So what now only black women have abortions! GTFOH!","commenter_a":"No words. Just disgust","post_message":"College Newspaper Cartoon Depicts Black Woman Being 'Late' for Her 'Abortion.' Oh, and she was wearing a Black Lives Matter T-shirt. Read the full details below. Grio fam, what in the world is going on here?"}]
