[{"comment_id":"630472157108961","commenter_b":"@username you too bitch","commenter_a":"This is not a man.........he's a crazy kid........wanting notarization. Why not go after Obama who continues to destroy our country and it's citizens!","post_message":"Here is the man who tried to kill Donald Trump yesterday:"},{"comment_id":"969075749885792","commenter_b":"That was you , a hoe and a drug user","commenter_a":"Your corruption comes to an end today Hillary! You have stiffed this nation, you have deceived the American people. NO MORE CLINTONS, America will not let you disgrace this nation any more!","post_message":"Todo por lo que hemos trabajado se decide hoy. Comparte esto si apoyas a Hillary: hillaryclinton.com/buscador"},{"comment_id":"1044606575560353","commenter_b":"Bwabhhhaaahhhhaaaaa.:O On 24/02/2015 1:30 AM, \"Facebook\" <","commenter_a":"Does category number 11 include parents?","post_message":"Who drinks the most coffee?  Image by I Love Coffee via AsapSCIENCE."},{"comment_id":"906024782797611","commenter_b":"Them girls need to be arrested. I hope the police is watching this video and found them girls... My heart and prayers go the girl getting jump. No class at all...","commenter_a":"Jesse Chambers","post_message":"UK Girl Couldn't Take It Anymore & Passes Out On Her Feet!    Click Here To See All The Fights in This Months Comp. @webpagelink"},{"comment_id":"710239562414460","commenter_b":"Yep, it's a sure way to self-destruction and negativity.","commenter_a":"Nope, not true. If that were the case, there would be collective responsibility too, and that would be impossible. We are individuals responsible individually for our own actions, choices and lives.","post_message":""},{"comment_id":"1253236361399557","commenter_b":"This is how much hillary hates women. Hillary wants to bring in illegals who hate women. @webpagelink","commenter_a":"Trump is afraid of Hillary for one good reason and that is why he constantly threatens her with assassination. Hillary can win over Trump by force of argument rather than by force of fear. You Trump supporters aspire to fear and violence. We Hillary supporters to free speech and Civil Rights.","post_message":"On this day in 1973, tennis champion Billie Jean King defeated Bobby Riggs in the “Battle of the Sexes.” King went on to found the Women’s Tennis Association, the Women’s Sports Foundation, and Women’s Sports Magazine to support women athletes on and off the court."},{"comment_id":"978703995520079","commenter_b":"And so does everyone else or they would not even bother if they did not","commenter_a":"The comments are always good for a laugh. You put up something positive & life affirming & there are sad, silly people feeling sorry for themselves who bad mouth it because it came from a successful actor. Ever wonder why he's successful? Maybe he had the right attitude & didn't blame all his problems on someone else!","post_message":""}]
