[{"comment_id":"10153634339640695","commenter_b":"Randy isn't even from the south. He's a Yankee. He has no say in whether it would come down or not. Just trying to yank your chains.","commenter_a":"take that dirty monument down!!!","post_message":"Instead of removing the carving, one councilman says they should add to it to better reflect Georgia history. What do you think?"},{"comment_id":"10154741316933812","commenter_b":"Hillary will be president","commenter_a":"Remember when Hillary Clinton said the 50,000 emails she kept from the State Department (in violation of the Federal Records Act) were about yoga and her daughter's wedding? How many of the most recent set of 14,900 emails ordered made public by a federal court are about yoga or her daughter's wedding? I'm thinking zero. But hey: pertinent falsehoods under oath aren't criminal when you're aspiring to become the First Woman President (TM).","post_message":"Meet Meatball: The adorable, friendly and rotund pit bull mix that can't help but flash his brightest smile as soon as he sees a camera. 'As soon as the camera turns on he just gets this huge grin on his face.'"},{"comment_id":"10153389927718598","commenter_b":"She seems to be for all things bad!!! And she is suppose to be a christian...","commenter_a":"You are nothing but. Trash joy behar ,,","post_message":"Joy Behar Trashes Carly Fiorina for Being Pro-Life “She Should be Ashamed of Herself”"},{"comment_id":"10153715482507452","commenter_b":"'@username my point is just because the government calls it illegal doesn't mean so that's my point and hector no conspiracy you just like to believe everything the government tells you","commenter_a":"Even if the lady were to have been illegal, the US low key appreciates the narcotics the government sells it themselves on the side where else can they seize the dirty $$$ that keeps circulating","post_message":"A San Diego woman traveling from Mexico was busted at LAX trying to smuggle in more than 11 pounds of crystal meth tucked away in the lining of her suitcase."},{"comment_id":"487670684715042","commenter_b":"because someone has to protect your pansy ass","commenter_a":"If these guys are so tough with their guns, why aren't they serving right now in The Middle East?","post_message":"Who will save us from tyranny in the produce section now? -Linda"},{"comment_id":"1702389236690262","commenter_b":"#NRAWhore","commenter_a":"Screaming about process that eliminates the ability to make progress is criminal.","post_message":"The sit-in by House Democrats is nothing more than a publicity stunt. The bill they're talking about was already defeated in the United States Senate. It's time for them to #StopTheStunt."},{"comment_id":"10150922009204999","commenter_b":"Oh shut up!","commenter_a":"Let us have a rich street thug unfit to be a watchman of your house as Pres and ruin US. Anything that goes up should be his argument after 5 years. Pathetic","post_message":"Donald J. Trump talked to Billy Bush about women in vulgar terms, in a 2005 video obtained by The Washington Post."}]
