[{"comment_id":"943402869028468","commenter_b":"It is only because all the other politicians want illegal's here. Trump is watching out for the American People!","commenter_a":"It's being said that Mr. Trump is causing problems for the GOP; taking votes from the others. BS! I'm Indy/democrat, and trust me, I'm voting for Mr. Trump! Any other Indy/democrats doing the same?","post_message":"BREAKING"},{"comment_id":"1277469425634935","commenter_b":"Oh yeah she must of smoked weed. Pshhh... don't be a dummy. Ppl don't smoke weed and drive in the wrong lane. If that were to be true millions off Ppl would be headed the wrong way. This lady was off her rocker I highly doubt it's do to weed or alcohol.","commenter_a":"Yeah legalize marijuana... will get more cases of wrong way drivers. But that's okay as long we have our freedom. That was a sarcastic remark. No to drunk driving no to marijuana no to drugs","post_message":"WRONG-WAY DRIVER: It's happened again -- DPS troopers used stop sticks to stop a woman who led them on a wrong-way freeway chase that began in Phoenix and ended in Mesa. Thankfully, no one was injured. STORY: @webpagelink"},{"comment_id":"1106399449450800","commenter_b":"Have you ever been fired or refused a job because you had a cough?! If this is the best you can do you should throw in your white sheet and accept defeat.","commenter_a":"Notice how her hair is different in all 3 of the pictures and her clothes are different in the two pictures that show her clothes. Who changes their hair and clothes several times while on a plane? Another made up story without corroboration by the right wing nuts from @username.","post_message":"WATCH:"},{"comment_id":"1251904504850405","commenter_b":"scum. I hope someone cuts your dick off. Then you can really be a women. Until then stay in your own damn bathroom and leave us women alone. One of these days yours is coming.!!!!!!!!!!!!!!!!","commenter_a":"single occupancy facilities is the only sensible answer. But that ain't good enough for the terminally aggrieved.","post_message":"👏 👏 👏 (via The Huffington Post)"},{"comment_id":"10153359522561051","commenter_b":"I'd be waiting every day to catch those bitches.","commenter_a":"I hope she caught her in the parking lot.","post_message":"When this woman's 2-year-old son came home with these marks on his leg, she marched down to his school and demanded to see the surveillance footage. Now she's even more outraged."},{"comment_id":"10152719503449117","commenter_b":"Don't these pigs have any REAL criminals to hunt down???","commenter_a":"Boy that's a basket of snarls","post_message":"Why the sex lives of teens should be subject to school discipline is suspect enough, but it's extra perplexing what interest the government has in such matters."},{"comment_id":"1552538175033296","commenter_b":"bitch i had to work and my husband had to work get off your fcking ass bitch and nobody needs 15 kids that doesnt have a job thats why this fcking foodstamps got to stop","commenter_a":"GET A JOB LOSER !!!","post_message":"This is why we need LESS welfare handouts."}]
