[{"comment_id":"583797651802114","commenter_b":"Women Willing To Bern In Hell For Bernie Women Willing To Bern In Hell For Bernie sounds like a cult, kinda like Scientology.....","commenter_a":"The corporate owned media won't change their narrative about Clinton because for the most part, they are still run by straight, white males who must keep the myth alive that an ambitious woman is dangerous and there must be a negative reason behind her ambition.","post_message":"Let this sink in."},{"comment_id":"10153722857026336","commenter_b":"How sad! God be with his family at this time.","commenter_a":"Who won the game ?","post_message":"17-year-old Evan Murray was a victim of internal bleeding caused by a ruptured spleen, an autopsy revealed Monday."},{"comment_id":"1056097081119075","commenter_b":"These lowlife Muslims are doing that in every country they are aloud into ! It's even going on here in America . It's how they take over a country without fireing a shot , they just out reproduce the natives and within a decade or two they will out number and be able to inpliment sharia laws ! We know Muslims have completely taken over one American city and are working on many more ! All these Muslims Obama has been bringing in are sent to certain cities for a reason ! Obama and Hillary are traitors and she will just pick up were Obama left off !","commenter_a":"Surprise, surprise.","post_message":"Muslim Pig Explains How He LIED To European Authorities To Bring In 4 WIVES  They are all about gaming the system and abusing our freedoms.   @webpagelink"},{"comment_id":"1207855142586053","commenter_b":"I was going to reply but you guys have it under control. Stupid bitch","commenter_a":"Hahahaha!!! So much for Freedom when you are forced to stand. If folks cant decide for themselves, then it isnt freedom. Im fairly confident my father died for her right to sit if she feels ashamed of her farce of a military...even when one is enlisted. (I eagerly await your ignorant attacks.)","post_message":"A Navy sailor made national news when she decided to film herself not standing for the flag. Now, she's in trouble... here's the swift justice she received.  Do you think she got what she had coming to her?"},{"comment_id":"10154114787935329","commenter_b":"LOL Chad.... Mom I'd be so mad!!!","commenter_a":"Chad Stacy Mike Deb don't buy these for the girls!!","post_message":"\"Her butt-length hair is now chin length. I was lucky to save that much.\""},{"comment_id":"10153288204601130","commenter_b":"@username And don't even get me started on that bullshit that women think they \"feel free\" because they can hide their faces and bodies behind that stupid piece of cloth. That's not freedom dummies, that's another way of mind fucking, you can also feel free of not needed to know how you look if you spend 40 years in jail in a separate cell where no one will even know you exist.","commenter_a":"He's not holy, no one has ever been a holy person , enough your closed mind religious bullshit.","post_message":"No one rocks a baseball cap quite like the Holy Father."},{"comment_id":"713245288832825","commenter_b":"I guess you are one of those women","commenter_a":"Yessss lets celebrate that we have a president think women can be treated like trash and women can stay at home creatimg babys. You women that voted him should celebrate for that","post_message":"Watch as President-elect Donald J. Trump and Vice President-elect Mike Pence kick off their  you tour in Cincinnati, Ohio."}]
