[{"comment_id":"10153986318004071","commenter_b":"Still I could look up plenty more lyrics","commenter_a":"But he just did a commercial with little yachty which doesn't make sense 🤔🤔. In lil yachtys biggest song he saids ''tell her I can get that pussy easily''. Wake up sheeple","post_message":"LeBron James is speaking out against Donald J. Trump's 'locker room talk.'"},{"comment_id":"933606760085373","commenter_b":"We should have dropped another one !","commenter_a":"He is the 1st president to do so, sometimes it takes a bigger man to start something else. Maybe after this the Japanese will come to Pearl Harbor and do the same. What is wrong with u people. The man is talking peace and yes what happened years ago was evil on both ends, it don't mean u can pay respects. I hope all presidents from around the world take a piece of what Obama has done to try and end hate because it seems like we are going backwards with trump being so popular. He's making it ok to be racist and hateful and it's not. Happy Friday y'all","post_message":"Pres. Barack Obama lays a wreath at the Hiroshima Peace Memorial, mourning the Japanese, Korean and U.S. victims of the world's first atomic blast in WWII. @webpagelink"},{"comment_id":"10150864251334999","commenter_b":"He will blame the baby","commenter_a":"He will either win, or drop out so he can always claim he would have won otherwise. If he does stay till then end, and doesn't win, the reaction will look like this: 1. Demand a recount 2. Blame it on voters who didn't want to make America great again. 3. Complain that the GOP is at fault for not supporting him enough. 4. Blame his VP. 5. Demand to see Hillary's birth certificate","post_message":"The latest guessing game is whether Donald J. Trump will drop out of the presidential race before Election Day."},{"comment_id":"992220407519685","commenter_b":"Meghan Sullivan","commenter_a":"Hold up! Imma let you finish, but I just wanted to say Bernie Sanders had one of the best shut downs of all time!! #feelthebern","post_message":"Bernie Sanders to Hillary Clinton: \"Excuse me, I'm talking.\""},{"comment_id":"550730825100820","commenter_b":"Smash these racist fucks with the same pipe, then hit them in the throat with it.","commenter_a":"Public beating","post_message":"Black Thugs Smash White Girl's Face With Metal Pipe For This Unbelievable Reason  This is horrifying. Imagine if this was your daughter.  What punishment would you want for them?"},{"comment_id":"730431657058963","commenter_b":"Stupid ass talk to text I sent hats off to Mr Gilbert who donated 10.5 million to Toys for Tots you can say what you want about these new country singers but I like mr. Gilbert's music and a bunch of the other ones and if you don't like that you kiss my ass","commenter_a":"You can say what you want but these new country singers other not countries in a sucker most of butter how many people you know to get stoned.5 million for toys for tots hats off to mister yogurt hold a good man and a good singer and if you don't like it like that you kiss my ass","post_message":"“Whether a kid is into Barbie or Star Wars, I hope we’ve given a bit of fun and inspiration.”"},{"comment_id":"545790502236393","commenter_b":"Liberals are NOT PRO ABORTION! WE ARE ANTI RELIGIOUS FANATICS THINKING THEY CAN RULE OUR BODIES! We are also pro families once children are born. We are anti poverty and anti starving and neglected children. We are as los anti ignorance!","commenter_a":"You will Never be president of my country. Nor will you ever dictate what I can or cannot do with my body. You creep.","post_message":"Really? He thinks that alienating 51% of the registered voters in this country is the way to get elected?"}]
