[{"comment_id":"10153552801752464","commenter_b":"@username>>>>I like and agree with your post about \"freedom of press\", but I also agree with what Mark posted about \"mainstream media\". The truth is Soros owns most of the news media and everyone , including the media, is getting \"paid off these days. I am even starting to believe that our SCOTUS is getting paid for their votes from what I have been seeing lately. After saying all that, what you say is true that people can pick and choose; but we live in a day of uninterested, uninformed, misinformed people who only go with what they hear the most, whether it is factual or not. Do you ever watch \"Watters World\" on the Bill O'Reilly show, \"The Factor\". It is so discouraging to see people of voting age, especially college kids, who are so uninformed, just dumb about history and politics. Maybe you can find it on YouTube ...","commenter_a":"I'm for @username. Donald Trump has nothing on Cruz, but Cruz has on Trump. Cruz is an honest, God fearing man who has been standing up AGAINST Washington ( Washington Cartel is what Ted calls them) ever since he has been a senator. He has fought against democrats AND republicans FOR the choices of the American people. HE never cowered or gave in to Obama's wishes even though he has been falsely accused and criticized for being against Obama policies that Mitch McConnel and John Boehner gave into.","post_message":"An honor to join thousands of courageous conservatives in South Carolina yesterday who agree now is a time to lead and #DefundPlannedParenthood: @webpagelink"},{"comment_id":"10153306067889087","commenter_b":"I bet they're total bitches!","commenter_a":"Who are these people backing Hillary?! It seems like every Democrat supporter that I come across is supporting Bernie.","post_message":"Hillary Clinton holds a stunning 31 point lead over her closest Democratic presidential rival Bernie Sanders according to a new NBC News/Wall Street Journal poll."},{"comment_id":"10153301412809641","commenter_b":"tuch","commenter_a":"Warning: china is about to end... u.s. is the most powerful country in the world!","post_message":"BREAKING: Nearly every U.S. federal government agency has been hit by a massive hack thought to originate from the Chinese military, and millions more workers could be affected: @webpagelink"},{"comment_id":"1052995884768693","commenter_b":"Miley Cyrus? The skank can't even keep her tongue in her mouth!","commenter_a":"Good who needs them!","post_message":"“I will give you a one-way ticket to the country of your choice, with the stipulation that you promise never to come back.” WATCH: Sean Hannity made an offer to the celebrities who are vowing to leave the country if Donald J. Trump becomes president."},{"comment_id":"856527364484863","commenter_b":"@username shut ur dumb-ass up!","commenter_a":"First point of order the car is in the middle of road. Second point yes his hands were raised but he moved to the car and did not stop not typical behavior of a stranded motorist when given an order to stop or asked hey why is your car in the road. Third point the suspension is typical following any ois during an investigation. So is the officer right or wrong if you can make that judment based on clips of an entire interaction with the police you're an idiot, and are part of what's wrong with America as well.","post_message":"GRAPHIC VIDEO: Video released today shows Tulsa police shooting and killing Terence Crutcher, an UNARMED father of 4 and college student for the crime of having his car stall down on the road. His hands are raised shortly before shots are fired. From the helicopter, a cop can be heard on the radio saying, \"That looks like a bad dude, too.\" A federal Justice Department investigation has been launched and the officer who shot him has been suspended. Video by Occupy Democrats, LIKE our page for more. Read more here: @webpagelink"},{"comment_id":"957541017614653","commenter_b":"I think she's a class act!","commenter_a":"I like all three of the non professional politician candidates and Ted Cruise and Scott Walker.","post_message":"Whoa..."},{"comment_id":"864868203550521","commenter_b":"ROFLOL!!!","commenter_a":"I see a white guy in a gold shirt.","post_message":"Photo: 20-year-old Jeffrey Williams, suspect charged in shooting of two police officers in Ferguson, Mo. @webpagelink"}]
