[{"comment_id":"10153465147033812","commenter_b":"Don't worry about turning white in the White House, your dumbass isn't even gonna make it in there you dumb twit!","commenter_a":"No your a has been go home","post_message":""},{"comment_id":"10152982403506051","commenter_b":"Good grief....is she for real? She willingly showed up at his house to engage in sex with whom she was gullible enough to think was a male model... Really?????????? She DOESN'T have a leg to stand on in court... STUPID does as STUPID is...smh","commenter_a":"She had to be incredibly stupid and he is a douchebag","post_message":"A woman thought she had been chatting online with this man. They met in a dark hotel room and she wore a blindfold while they got intimate. When she took it off, she saw someone she wasn't expecting."},{"comment_id":"10158192109115206","commenter_b":"Moms Le Lotpi go to the kitchen? Is that where you think all woman belong? So ignorant.. Put your wife in the kitchen!!","commenter_a":"Wtf is wrong with these parents today. Heartless, deranged animals! Torture her slowly to her death..","post_message":""},{"comment_id":"10158142280770293","commenter_b":"A bankrupt city full of criminals... we will stay in Shelby county and spend our tax dollars in Shelby county... will not spend a dime there","commenter_a":"Hopefully they will lose all Federal funding for not following the Federal law. They need to be concerning themselves with NOT being in the top ten places that are unsafe.","post_message":"#BREAKING: The Birmingham City Council took a position on the travel ban by passing a sanctuary city resolution this afternoon. READ more on this developing story >>"},{"comment_id":"971388089566977","commenter_b":"Trump is a power hungry man.. Who only cares about being at the top Who could not relate to 99% of you if he tried.... Giving a man like that the power of presidency is like giving an eight-year-old a loaded shotgun","commenter_a":"We have to secure our borders and all the Visa programs , This country can't survive the way it is heading. #TRUMP2016 The man that can put this country back on the right track. #TRUMP2016","post_message":"Thank you to the great crowd at the #USSYorktown in Mt. Pleasant, South Carolina. Listen to the the response from the crowd to my latest proposal - and let me know if you agree with these PATRIOTS?"},{"comment_id":"10155415365743812","commenter_b":"Alfredo Aguilar This comment","commenter_a":"I see Trump's shipment has arrived. This explains his snorting problem. lol","post_message":"U.S. Coast Guard Cutter Midgett crew offloads more than 13 tons of cocaine at Naval Base San Diego that were seized in 21 separate incidents in the Eastern Pacific Ocean. @webpagelink"},{"comment_id":"1773091102960388","commenter_b":"FBI Director Comey states that \"There is no evidence that Hillary Clinton lied\".","commenter_a":"I'm not a Republican by any stretch of the imagination, but at least we can find some common ground on the Hillary Clinton issue. It's completely insane that the DNC has supported her this whole time. She, along with Bush and Cheney, need to be in jail. Let's stop allowing these people on both sides to be above the law.","post_message":"The Director of National Intelligence should deny Hillary Clinton access to classified information given how she so recklessly handled it as Secretary of State."}]
