[{"comment_id":"1053133688060436","commenter_b":"What!!!???","commenter_a":"We're number 1!! We're number 1!! Oh wait......","post_message":"While the rest of the world is reducing maternal deaths, the number of pregnancy-related deaths in the U.S. continues to rise. In fact, America now has the highest rate of maternal deaths in the Western world."},{"comment_id":"1237296066293181","commenter_b":"Stupid Hoe","commenter_a":"I think she is mad talented but until she stops dressing like a skank and humping everything from the air to the ground to the men in her music videos, the attention she gets will not be based off her amazing talent but on her sexuality. Becuase I think she is so talented I have watched many of her videos looking more for talent than her soft core porno ways and found that only a handful of her videos showcase her talent and not her ASSets. Soooo I mean, do something else girl cuz that talent is off the hook.","post_message":"There's a tendency to read Minaj solely through her sexuality."},{"comment_id":"538555889666037","commenter_b":"SHE IS NOT A SMART WOMAN","commenter_a":"She fails at everything'. We need #Trump2016","post_message":"She NEVER learns..."},{"comment_id":"10154768873318132","commenter_b":"First off who the hell is she ? I've never even heard of her . Lol like seriously what does she do ? Furthermore nobody really cares about her opinion because it's a very poor one. More important things going on in the world then you crying about someone not hitting on you he probably doesn't even know who she is","commenter_a":"It seemed pretty clear to me that she was poking fun at herself, talking about her own feeling, not bashing the athlete in any way. Can everyone just relax and remember that everyone is entitled to their opinions and their own insecurities and maybe, just maybe, not twist every single thing that anyone says into something offensive? Geeeeeeeez!","post_message":"Lena Dunham is setting the record straight on her comments about NFL star Odell Beckham Jr."},{"comment_id":"1059948200694894","commenter_b":"She isn't a women, if she was slick Willie would deny ever having sex with her","commenter_a":"Unlike him, she should be under federal indictment and disallowed from running for any office at all.","post_message":"It's getting downright catty between Hillary Clinton and Donald Trump."},{"comment_id":"10155183414820725","commenter_b":"A whole alot of whores","commenter_a":"He's an attention whore!","post_message":"Remember when Kanye interrupted Taylor Swift at the 2009 Video Music Awards? Well, he rushed the Grammy stage last night, showing off his sense of humor and impeccable timing: @webpagelink"},{"comment_id":"10155037125378459","commenter_b":"Hey the angry ex wife is back!!!!!","commenter_a":"You know when there is a big headline telling you the absolute truth about anything on social media that you are in for a load of bullshit.","post_message":"The Truth About Oprah Winfrey Oprah Winfrey meets in secret with THE MOST evil men and women in the world every year and is given talking points to push on her audience..."}]
