[{"comment_id":"812987998844624","commenter_b":"Bra,panty,stockings,make up are part of a woman's world We want to look presentable when we go out ....not look like a beat up gf or wife","commenter_a":"The husband is so sweet ,im sure he bought perfume and other toiletries for her","post_message":"The husband was helping his wife choose a makeup color that matched her skin tone. He helped her find the color and kissed her on the forehead, according to Love What Matters."},{"comment_id":"10153172623814153","commenter_b":"I don't have compassion because of their careers I have compassion because I'm human","commenter_a":"How many of you would be screaming compassion if he wasn't a cop? And a history of DUI? Please. I have no compassion for anyone who drives drunk or gets into a car with a drunk driver.","post_message":"MVC Records: Officer Pedro Abad Jr., driver in deadly Staten Island crash, had 2013 DUI in Rahway. Read more: @webpagelink"},{"comment_id":"10155380353783797","commenter_b":"Smh Freaking Nazis","commenter_a":"KevinNajera","post_message":"HOLOCAUST REMEMBRANCE DAY: Today marks the liberation of the Auschwitz Nazi death camp on January 27, 1945. Take a moment to remember the millions killed. bit.ly/2k1HfMq"},{"comment_id":"1711137139137823","commenter_b":"@username I've been reading your comments and I can tell you're a Drumpf dwarf you dumb, classless, hillbilly trash you are utterly disgusting don't forget when you take your dump in your out house you can cast your vote for Drumpf at the same time!","commenter_a":"I think it was the movie Animal House..\"fat drunk and stupid is no way to go through life\" maybe you should take the same advice Rosie O'Donnell. You're a classless loud mouth, when Trump becomes President feel free to leave the country, Ill even pay for your ticket","post_message":"Rosie O'Donnell just restarted an epic feud."},{"comment_id":"1366518346740365","commenter_b":"Emilie Frost & your not even ginger anymore","commenter_a":"....","post_message":"Fans of Prince Harry and Ed Sheeran will be celebrating soon!"},{"comment_id":"10153249679689384","commenter_b":"They are not saying that they are not going to fund the DHS- just the portion that supplies billions to illegal immigrants. The mess that the Dumbocrats likes you and Nag Nancy supported along with the idiot in the White House. You and the fools like you are no longer \"hilarious\" you are dangerous! You need to educate your foolish self and quit endangering the rest of us!","commenter_a":"Hilarious!!! GOP makes us think we are in momentary threat of something or other and then Refuses to Fund the operating system for oour Defense!!!","post_message":"The clock is ticking and still, Republicans are trapped in a dangerous, anti-immigrant fantasy. This is the second time this week that Republicans have voted to continue threatening the security of American families, doubling down on their breathtaking irresponsibility. My full statement: @webpagelink #DontShutDownOurSecurity"},{"comment_id":"985326574853829","commenter_b":"Girlfriend you are out of your simple, bigoted, tea bagging mind! Go crawl back under your rock...","commenter_a":"No senator. No SCOUS nominations from this America-hating muslim currently in residence at our White House. No. Never.","post_message":"Today I stood with U.S. Senator Chris Coons in Philadelphia to call on Republicans to do their job and give fair consideration to Chief Judge Merrick Garland. Their obstruction is inconsistent with our duty as senators and bad for our judiciary."}]
