[{"comment_id":"841359735901368","commenter_b":"He just \"forgets\" that we are in the 21st century, not in the Middle Age. We've learned from the past and they don't.","commenter_a":"We are all aware that this President is ill informed and has had trouble when it comes to Historical accounts... Whether or not you believe the Crusades were meant to stop Islamic atrocities or to spread Christianity, that should not be the focus here. Suggestion: Truly read the differences between Christianity and the Islamic faiths and decide which spreads peace within its holy scriptures.... An interesting example below siting scripture from both religions (read in its entirety). ...Especially, the Ellen Mems comparison. This is a public FB debate between a Muslim and a Christian: Quoting \" Christianity & Islam A debate... Gamal Abouomar Who is Prophet Muhammad, may peace and blessings be upon him? He is the one who defended the rights of all humanity 1400 years ago. He defended men's, women's and children rights He commanded and fostered the love between relatives and neighbors He established a coexistence relationship ...","post_message":"Barack Obama's prayer breakfast comments about Christianity are causing some to perk up.   “Unless we get on our high horse and think this is unique to some other place, remember that during the Crusades and the Inquisition, people committed terrible deeds in the name of Christ.\""},{"comment_id":"10154576312191037","commenter_b":"@username so if they agree with Her hatefulness that will make them good people? You must have drank her kool-aid","commenter_a":"Most disgusting, despicable woman in America. She and Drumpf are the perfect, hateful, ugly pair that embody everything wrong with the US.","post_message":"She previously called him an \"angry Muslim with a thick accent.”"},{"comment_id":"905085592863011","commenter_b":"I got 8 right","commenter_a":"Yes","post_message":"Let us know how well you do!"},{"comment_id":"473948236146716","commenter_b":"Go die old bitch","commenter_a":"lost all respect for superbowl....half times and commercials...all just the liberal agenda PU not worth staying up to watch...won't bother with any of the sports hype next yr.","post_message":""},{"comment_id":"1482883781727172","commenter_b":"Once the snowflakes find out the expense of their new revolution will cost them their Pot money....they will reconsider. But hey...the gun community is an inclusive bunch. This should be interesting to watch. They will be easy to spot wearing their skinny jeans with a big bulge printing for me to keep an eye on.","commenter_a":"These people give a new meaning to the word stupid!","post_message":"Unreal."},{"comment_id":"10154217110321770","commenter_b":"We have a lot of work to do in America cleaning our schools of these liberal crazy teachers.","commenter_a":"This country, well the insane left, has lost it completely. Just flat out have gone rabidly insane. They need STOPPED. Now.","post_message":"These are the people teaching your children"},{"comment_id":"10155026545836337","commenter_b":"Not the worse but close.","commenter_a":"Chuck is on point","post_message":"WOW. Charles Barkley torched the entire NBA..."}]
