[{"comment_id":"1140838815950861","commenter_b":"@username now you're gay bashing but Muslims love male goats","commenter_a":"I bet Obama won't send anyone to her funeral...crickets. RIP Sister in Blue We have the watch from here.","post_message":"A Virginia officer who was on her first shift with the Prince William County Police Department was shot and killed Saturday and two other officers were wounded in a standoff stemming from a call about a domestic-related incident."},{"comment_id":"10156988779965500","commenter_b":"Exactly. These are sick women.","commenter_a":"This is sick! As the mother of that boy I would go psycho on her! Check out this loser, @username!","post_message":"TEACHER IN TROUBLE! She told investigators that the boy's family was supportive and excited when they found out she was pregnant. @webpagelink"},{"comment_id":"511818058979535","commenter_b":"Good they dont belong there. Its for shoppers and family time keep your zoo off all streets and malls! If black lives mattered so much to them why are they not stationed in the community?? #enoughalready","commenter_a":"They are a nuisance.","post_message":"The Mall of America is seeking a temporary restraining order that would bar the group from protesting. It also wants the group to post a message on social media saying the protest is cancelled."},{"comment_id":"504677803025508","commenter_b":"Can't stand Mcain","commenter_a":"John Mccain almost crying because he's losing his beloved mercenaries under Russian airstrikes - @webpagelink","post_message":"What is really going on?"},{"comment_id":"10153247991679342","commenter_b":"Abortion is good. They should abort all babies born before the mother is 25","commenter_a":"here we go, \"all these people worried about worms in the water and nobody cares that planned parenthood is selling dead babies!\"","post_message":"One woman said she first noticed the worms yesterday in her bathtub and after collecting a few, she heard neighbors found the same thing.   @webpagelink"},{"comment_id":"499065056962019","commenter_b":"I can't stand her. Send her back to India where her parents are from.","commenter_a":"We can't let the GOP pick and choose who they want in office. It is up to the voters! GOP take notice, heed our warning, because if this does happen, and Donald becomes and independent; there will be. Democrat elected!","post_message":"Now that she criticized him, will Donald Trump snuff out Gov. Haley's rising star?"},{"comment_id":"10153442792427232","commenter_b":"Have you seen all the arrest of that originations leaders?","commenter_a":"Much like their spoksperson...LoL","post_message":"The civil rights group approved the measure Saturday at its national convention in Philadelphia to end the boycott of tourism and other economic activity. STORY HERE: @webpagelink"}]
