[{"comment_id":"760324150750635","commenter_b":"You sons a bitches!! Lmao","commenter_a":"Thanks a lot sister that was my favorite soda!! Gross! Jessica LeAnn Miko","post_message":"Disturbing Thing A Man Says He Found Inside A Freshly Opened Pepsi Can"},{"comment_id":"10153227857229330","commenter_b":"I'd do the same thing - little punk needs a good whipping from his mom","commenter_a":"There is one parent in Baltimore that has her priorities straight.","post_message":"Mom of the Year? Check out what a mom did when she caught her son out rioting in Baltimore. ---> @webpagelink What would you do?"},{"comment_id":"10154645517167599","commenter_b":"@username Trump should be in the swamp!!","commenter_a":"Everyone needs to be more like Romanians. At least they doing something about corruption in their government.","post_message":"We were live from the anti-government protests in the Romanian capital, Bucharest. The demonstrations are in response to the passing of a decree that will free dozens of officials jailed for corruption."},{"comment_id":"1185646658122029","commenter_b":"Yeah, thanks fer nuthin'. Don't need some guy's forgiveness for anything. Not lookin' for it, ain't askin' for it.","commenter_a":"No one but God can forgive sins. The Pope and priests are men.","post_message":"BREAKING NEWS: Pope Francis will allow Roman Catholic priests to absolve women who have had abortions if they seek forgiveness, the Vatican announced Tuesday."},{"comment_id":"1757645291122332","commenter_b":"@username or because the people who own the farms/fields can get away with paying illegals less money than legal citizens. Lived in a farming town and saw it happen all the time. I have no problems with anyone coming here legally, paying taxes and doing everything else American citizens do.","commenter_a":"This video only proves that we need Trump. Every statistic stated was \"illegal\" immigrants working in our country. I honestly thought it was a joke. Time for Americans to start working again and quit hiring illegals to do the jobs.","post_message":"If Donald Trump's immigration plan came true, the results would be scary. See the biggest immigration myths here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"10152826258466051","commenter_b":"I hope the bitch gets life","commenter_a":"Got what you deserve","post_message":"First she stole this cancer-stricken man’s dog. Then she had him euthanized."},{"comment_id":"10153253284026756","commenter_b":"i like to read porn not watch it as much","commenter_a":"Meanwhile, people are praising a movie about a creepy, abusive man who likes to manipulate women into believing they want to be treated like emotional and sexual slaves.","post_message":"In which the vice president manages to invade all of our personal spaces, simultaneously."}]
