[{"comment_id":"10153760611904087","commenter_b":"@username not as big of a liar as HilLiary!! She's the queen of lying, pandering and flip flopping! #WhichHillary","commenter_a":"Thank you VP Joe Biden for saying: \"I feel confident that Hillary Clinton will be the nominee and I feel confident she'll be the next president\". Coming from you that's awesome!!!","post_message":"“I feel confident that [Hillary Clinton] will be the nominee and I feel confident that she’ll be the next president,” said Vice President Joe Biden."},{"comment_id":"840419212729882","commenter_b":"Noone else to vote for... #Cruz #Ca #DudesDontPeeInTheGirlsRoom #NeverTrump #NeverHillary","commenter_a":"More republicans don't want Trump than support him. I will be voting Ted Cruz and will say for those who have not yet voted, especially in California, please vote Cruz (assuming he’ll still be on the ballot.) In the meantime, it’s time for the Republican Party comes to its senses and throws Trump out of its ranks and exclude him from eligibility for its presidential nomination.","post_message":"So many people are using what happens now as a springboard for the future."},{"comment_id":"10152949520761519","commenter_b":"FWIW: Jesse, I love your points of view. Over the years your passion and knowledge have helped me evolve my own perspectives on politics and the news. However, I respectfully disagree with your use of pejorative terms to describe women in this fashion. I think it is as much demeaning to you, and women at large, as it is to the targets of your invective. I respect your assertion of your right to use these terms, and you have articulated to me in the past why you choose to use them. I respectfully disagree with it.","commenter_a":"Those Fox News bitches really whore it up with the make up, don't they?","post_message":"\"You can’t separate fiscal issues from social issues...\""},{"comment_id":"10154234196571509","commenter_b":"Maybe if you realized the obvious. Terrorists would not attempt entry as refugees. They'd arrive as illegals and criminals along with the rest of the parade crossing into the US via our unprotected southern border.","commenter_a":"Try telling this to republicans and they won't listen, only people with commonsense know that it would be difficult for terrorists to enter the U.S. as a refugee. Maybe if fox news told them they would believe it.","post_message":"Here's how the refugee process stacks up to other ways of getting into the U.S."},{"comment_id":"877009682392087","commenter_b":"If you are a salaried worker, no overtime pay. Which means you get a set rate of pay weekly or biweekly and have to work how many ever hours you have to, to finish your job. Whether it's 30 hrs or 50 hrs you get the same pay. It's like that for a lot of managers and supervisors.","commenter_a":"I must be in a bubble, I thought anything over 40 hrs is overtime, I have always been paid time and a half for anything over 40 always. What is it the restaurant businesses? Who doesn't pay overtime?","post_message":"This is HUGE! \"A hard day's work deserves a fair day's pay,\" the President said in his announcement.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155036585354108","commenter_b":"The first lady also has shown everybody her breast","commenter_a":"again","post_message":"LIVE | BREAKING: President Donald Trump will soon speak to supporters at a rally in Melbourne, Florida."},{"comment_id":"10154963330566509","commenter_b":"Not if we can help it....She is criminal","commenter_a":"Glad to see all the Democrat converts. Hillary will crush Trump in the general.","post_message":"The conservative columnist George Will is advocating that others do the same."}]
