[{"comment_id":"1008364749198946","commenter_b":"But the only way to stop a bad baby with a gun is with a good baby with a gun!","commenter_a":"My Hero","post_message":"BOOM!"},{"comment_id":"432628273528434","commenter_b":"\"Riot Whores\" want to get paid? Tip: a smart whore always gets paid BEFORE the act!","commenter_a":"Soros wanted them, now pay them you socialistic pig!","post_message":"You might agree that these greedy people are missing the whole point."},{"comment_id":"533221760173934","commenter_b":"If this CRAP ever does fly,WE the PEOPLE,aka The Government,aka TAX PAYERS,will be SUED by LEGAL IMMIGRANTS who became CITIZENS for a HEFTY PRICE($650 per or better)wanting their money BACK because these CRIMINALS got in for FREE and remain on the TAX PAYERS TEAT...Check the story on he IRS scandle of earned income tax credit for the illegals collecting on kids(nieces.nephews,kids)IN MEXICO...They are aware(news station expose')& claime it's up to congress to close the \"loopholes\"...","commenter_a":"a vow of silence would be greatly appreciated by all career politicians and family dynasty politics","post_message":"\"The people at the heart of this issue are children, parents, families, DREAMers. They have names, and hopes and dreams that deserve to be respected\" - Hillary Clinton"},{"comment_id":"10153715953211336","commenter_b":"America can't wait for these 'Rug Rats' to grow up. We need action NOW.","commenter_a":"Very true!!","post_message":"ICYMI: Dr. Ben Carson said that fiscal irresponsibility is ruining the future for younger generations. What do you think? More from the GOP candidates at the Values Voter Summit: @webpagelink"},{"comment_id":"1569991603060963","commenter_b":"Oprah is a piece of shit.","commenter_a":"Ignorant celebrity","post_message":"It's all about the win for 'your side'."},{"comment_id":"102010026995579","commenter_b":"Wanna borrow my gun?","commenter_a":"Go ahead Cher! I'm not stopping you.","post_message":"Famed singer and radical leftist Cher is at it again, making outrageous and unwarranted comments. @webpagelink"},{"comment_id":"10154461137273162","commenter_b":"@username is clearly an anthropological & archaeological authority on the issue of Jewish history. Oh, and he was apparently elected to be the Arbiter of Jewish Identity, seeing as he now has the right to decide which Jews belong where","commenter_a":"I'm sorry Bibi - you know bunch of us real Americans LOVE you !!","post_message":"Now he’s “Boo Boo!” Netanyahu! The Israeli Prime Minister Benjamin aka “Bibi” Netanyahu received a chorus of boos from the most American of audiences: New Yorkers who paid exorbitant sums to see the ever sold out smash hit “Hamilton.”"}]
