[{"comment_id":"10154018245628352","commenter_b":"Why kill the woman?... Just get a divorce and carry on with your life idiots!!!","commenter_a":"he was lying to her crazy ass....","post_message":"‘I want you so bad – if only someone was out of the way': Chilling texts Army medic sent to his mistress weeks before his wife was found murdered"},{"comment_id":"1811602825768086","commenter_b":"@username they voted for TRUMP because Hillary is lying criminal that should be locked up","commenter_a":"not surprising.... the KKK IS a dem organization so it makes perfect sense that they would be able to get the uniforms.","post_message":""},{"comment_id":"1773738762840165","commenter_b":"Yea but she doesn't wear that dress well as Melania .Petty old lady","commenter_a":"This is just tacky and remarkably low class.","post_message":"10/10 burn. 🔥"},{"comment_id":"1082607271804819","commenter_b":"Lynne Longoria Torres","commenter_a":"the BBC is for the birds.","post_message":"Donald J. Trump has yet to comment!"},{"comment_id":"10153584880961336","commenter_b":"@username , IT should be ALL who are here illegally as they ALL have committted a crime by INVADING this country","commenter_a":"So, let me get this strait... Trump is going to deport all immigrants, and take away citizenship from persons naturalized in the United States....That is going to be a lot of deportation since we all have immigrant backgrounds so who is going to check the Family Trees to see how far it goes back..... and who's going to be the \"Gate Keeper\".... I wonder if Trump will also deport himself and his family as well or he planning on being the only person left in America....","post_message":"Donald J. Trump pledges to eliminate the \"biggest magnet\" for illegal immigration by ending birthright citizenship for the children of illegal immigrants. @webpagelink"},{"comment_id":"1781276175448687","commenter_b":"And she wants to spend her last dying days being president? Really? Think please!!","commenter_a":"Make it sound as bad as you can, @username, you always do.","post_message":"JUST IN: Hillary Clinton was diagnosed with pneumonia on Friday, her doctor says. The doctor revealed the condition hours after Clinton stumbled while leaving a 9/11 event. @webpagelink"},{"comment_id":"1012314152218696","commenter_b":"Ungly Chelsea looks just like her father , Webster Hubble. What s slut that crooked Hillary!!!!!!!!","commenter_a":"Yes. Beauty & the beast think you can figure this out for yourself.","post_message":"Is turnabout FAIR play? This deserves about 25,000 'LIKES & SHARES'. Enjoy... @webpagelink"}]
