[{"comment_id":"1004203859620086","commenter_b":"Awful woman !!!","commenter_a":"I don't want to see this face in my newsfeed.","post_message":"Leave it to Michele Bachmann to exploit a tragedy to take a swing at President Obama"},{"comment_id":"10153952600386336","commenter_b":"This will definitely stop the murders in Chicago. NOT! It's laughable how completely out of touch this clown is.","commenter_a":"Find Job... Fine job..Mr President.","post_message":"President Barack Obama will use executive actions to expand licensing requirements for small-scale sellers, according to reports."},{"comment_id":"238983709893436","commenter_b":"Assholes. Shame on them...they got their education...the Hell with our future!","commenter_a":"pride in ownership republicans push education backwards.","post_message":"Was YOUR senator one of them? Spread their shame!"},{"comment_id":"897936806940850","commenter_b":"DUMBASSES!!!!!!!!!","commenter_a":"People take note of these 18 cities and steer clear.","post_message":"ALERT: These 18 U.S. Cities Just Made Terrifying Announcement About Muslim ‘Refugees’… Do YOU Live There? @webpagelink"},{"comment_id":"750686755029933","commenter_b":"She's a racist","commenter_a":"I guess this only applies to black women since she declared \"Black girls rock\" instead of ALL GIRLS ROCK","post_message":"The \"Barack Obama\" move didn't go over so well."},{"comment_id":"949545821752943","commenter_b":"All. Very. Sexy. Women. Man...","commenter_a":"Who chose white print???? I couldn't read most of this .","post_message":"Have you seen this?"},{"comment_id":"10156077114395354","commenter_b":"She is a very dangerous person!","commenter_a":"You can fully understand why a lot of politicians want gun control after the shit they have pulled on the people . Some of them might well fear for their lives . With the present climate in this nation the people sure as hell aren't ready to give up their weapons . My advise is to stockpile ammo while you still can , before they ban sales .","post_message":"Here's what she's got planned for law-abiding, gun-owning citizens..."}]
