[{"comment_id":"492601187597128","commenter_b":"Again radicalism get rid of these people and do not give in to thier demands","commenter_a":"Wasn't bacon on the menu when he started working there???? And KFC just suspends him????? I think we've found a new weapon......pork bombs!!","post_message":"Muslim worker threatens this customer, but he stands his ground. Good. He didn't do anything wrong, we support this American customer. Do you agree this Muslim worker should be deported?"},{"comment_id":"10157547755435206","commenter_b":"I don't know who's worse: a rapist or a pedophile. This psycho is both.","commenter_a":"Should of chopped him in pieces .","post_message":"An Indian man took revenge against a 17-year-old boy who raped his 7-month-old baby daughter — by tying him to a tree and chopping off his hands."},{"comment_id":"10153642652659411","commenter_b":"Needs to be bombed to death. No more terrorism, no more parasitic immigrants.","commenter_a":"You want to slow down the migrant crisis? Stop bombing the Middle East!","post_message":"Op-Edge: 'The root cause is frankly Europe just not being prepared for this large scale numbers of people fleeing persecution and misery in other countries. Europe has rather just closed its eyes to reality and rather hoped that the situation might just go away' - Keith Best, former Vice Chair of the European Council for Refugees and Exiles"},{"comment_id":"1182540631781356","commenter_b":"ISLAM'S WHORE","commenter_a":"One Can Only Hope!","post_message":"FINALLY!"},{"comment_id":"10153085724024228","commenter_b":"let her leave, she's the one who will suffer","commenter_a":"Let's not forget child-support from Miss congeniality.","post_message":"After holding baby Leo's hand for the first time, his dad fell in love."},{"comment_id":"10153920476909614","commenter_b":"Silly girl!","commenter_a":"@username - this is the women I was referring too.","post_message":"It was just two years ago today that iconic singer Natalie Cole performed \"This Will Be (An Everlasting Love)\" during the 125th Rose Parade. Following news of her death, this clip from the KTLA archive seemed like an appropriate tribute to the nine-time Grammy winner. Cole died Thursday evening at L.A.'s Cedars-Sinai Medical Center due to complications from ongoing health issues, according to a family statement provided to the AP. Read KTLA's story here: @webpagelink"},{"comment_id":"413560098853531","commenter_b":"How can any woman murder a baby like this??? @webpagelink","commenter_a":"Well, when they intentionally murder babies and sell their body parts, what do they expect to happen? They are murderers, spiritual people do hate that. Here is a 18-week old baby, how can folks not get upset about murdering innocent babies? If you don't want to get pregnant, close your legs or be responsible. Stop using abortion as birth control; it's that simple.","post_message":"\"We've seen an alarming increase in hateful rhetoric and smear campaigns against abortion providers and patients over the last few months. That environment breeds acts of violence.\""}]
