[{"comment_id":"10153035169591051","commenter_b":"Execute her how could she","commenter_a":"They are raising a bunch of animals!","post_message":"This 14-year-old killed a 2-month-old because she didn't want her mother to adopt the baby girl."},{"comment_id":"1226980343992420","commenter_b":"Ugh man females I hate em in high school and yes we can have a button up and cleavage will show lol","commenter_a":"Jessica Elizabeth😂😂😂","post_message":"Boob deodorant? Oh yes, I've got that."},{"comment_id":"898264413641666","commenter_b":"He shortchanged everybody Diddy! Everyone who isn't a 1%-er.","commenter_a":"Sometimes silence is golden. Our President has done an Excellent Job! Take the Plank out of your own EYE!!","post_message":"Sean 'Diddy' Combs Says President Obama 'Shortchanged' Black People"},{"comment_id":"10154394005871337","commenter_b":"I love Salma Hayek's ass.","commenter_a":"i like the scene in wild wild west, where salma hayek shows her naked behind. nice butt.","post_message":"Will Smith is really, really sorry about Wild Wild West..."},{"comment_id":"10153968461605579","commenter_b":"Absurd! There are 50 muslim countries to accept muslim refugees!","commenter_a":"You know why I support the Syrian refugees coming to America? Because I'm not going to let the terrorists dictate my beliefs, ISIS doesn't scare me. What scares me is that we, Americans, are losing our sense of direction. I've thought about this refugee crisis for for quite some time now, if you don't believe me ask the Marines who I taught about the Syrian civil war in 2012. I've been aware of this conflict for quite awhile now, while the rest of the world turned a blind eye. Islamic extremists aren't going to scare me and they are not going to change my way of life or thinking. I am an American and I cower to nobody. When I see people fleeing danger I want to help, we as Americans want to help. If you turn away women and children fleeing death and destruction because of terrorist attacks then ...","post_message":"Should the U.S. accept Syrian refugees?  WATCH: U.S. House debate on #SyrianRefugees  LIVE on C-SPAN @webpagelink    WATCH: House Judiciary Committee SubCmte hearing on #SyrianRefugees,  LIVE on C-SPAN3 @webpagelink    Senate Homeland hearing on #ParisAttacks  LIVE at 2pm ET on C-SPAN3 @webpagelink"},{"comment_id":"10153884127193854","commenter_b":"I do not now abut you ..but me ? I am jew ...","commenter_a":"One day Michael Moore you're going to get what's coming to you youre a evil lowlife person and disgusting and Stephen Colbert had you on his show last night I wouldn't watch that democratic hypocrite of a show","post_message":""},{"comment_id":"1182482298496971","commenter_b":"Praying🙏","commenter_a":"Get well soon.","post_message":"Prayers are with the Fox News family today..."}]
