[{"comment_id":"10153317099366051","commenter_b":"Caleb I agree. @username you are a fucking Looney toon. Crazy bitch","commenter_a":"She didn't kill him & usually if someone is threatening suicide it's because they're not gonna do it anyway! I have attempted suicide & have suicidal tendencies that I battle everyday but when you get ready to do it you don't inform others you just do it! I think it's bs that she is being charged when he had every opportunity to walk away....he chose to die no matter what she said to him! If you're steady telling me you're gonna kill yourself then I'm gonna tell you to go ahead and stop feeding me your empty threats!","post_message":"Remember the teen who convinced her boyfriend to kill himself? Well, she just got some bad news."},{"comment_id":"952483414832934","commenter_b":"Don't tag me in anything, slut-shamer.","commenter_a":"Lyssa","post_message":"The details of the next season of American Horror Story are terrifying..."},{"comment_id":"1038357019610877","commenter_b":"If BERNIE goes Independent, or goes Green, then Good, Hillary is a bitch, a liar, a thief. BERNIE should do anything and everything he can to defeat the nasty bitch. #NeverHillary #BernieSanders2016","commenter_a":"We may still be able to achieve some things of value at the convention. Bernie's current top priority at the convention (as stated in a conference call with his delegates) is to change the Democratic party rules to \"un-rig\" future Democratic primaries so they will be fair to future Democratic party presidential candidates. For him (and our delegates) to have any chance of making future Democratic primaries more fair via votes in the rules committee at the convention, we need to get all our pledged Bernie delegates funded. We are still at risk of losing over 100 pledged Bernie delegate votes, purely due to lack of funds. That's down from over 200 a couple of weeks ago because we have never stopped trying to get them funded. For everyone who is #StillSanders, can you please consider donating $2.70, $5 or $10 (if you can spare a few dollars) to help ...","post_message":"We are building a movement because this country belongs to all of us - not just a handful of billionaires and wealthy campaign contributors. And I'm asking people across the nation to come together and organize an unprecedented grassroots movement."},{"comment_id":"10158633377120725","commenter_b":"Funny, president Obomba deported more people than any president in us history. Liberals worship him. Trump deports people and out come the crybabies and the protests.","commenter_a":"Why deport the good people? I don't get this ine","post_message":"Advocates believe the roundups and arrests mark a shift in enforcement under the Trump administration."},{"comment_id":"10152707849071028","commenter_b":"With their family issues this's couple should not have children.","commenter_a":"\"Seven case workers were assigned to the family\" yet they didn't do a thing!","post_message":"The girl’s nose and part of her cheek were eaten away, while her upper lip was shredded. @webpagelink"},{"comment_id":"10153129788220667","commenter_b":"No one cares that he lived and no one would care if he died","commenter_a":"Really?? Who cares?!?!??!!!","post_message":"He is in significantly better shape than when he was rushed to a Las Vegas medical facility after a three-day binge at a Nevada brothel."},{"comment_id":"10153516000908984","commenter_b":"If they want want to stay in America, they should have to obey our laws","commenter_a":"Give them all a one way ticket to Iraq. Let them embrace their Shariah Law and the ISIS.","post_message":"I have to admit, I was quite startled when I saw these numbers. It seems that a real problem could be brewing... Is Sharia law in America a major concern of yours?"}]
