[{"comment_id":"1066271903469061","commenter_b":"Illegal drugs are banned.","commenter_a":"None; simply ban them! ..... instead of thinking on wasting American lives and huge amounts of money in pointless wars, we should tackle our home problems first....and gun control is the main one!","post_message":"'What could possibly be the argument for allowing a terrorist suspect to buy a semi-automatic weapon?'  - President Obama  More from his address here: @webpagelink"},{"comment_id":"10153523843241323","commenter_b":"Get a gf!","commenter_a":"In good times and bad times ........dick head there is prob shit about you but she's doesn't tell you ! She just except the idiot you are !","post_message":"How do I tell her how I feel without hurting her feelings?"},{"comment_id":"10153429629189087","commenter_b":"Deport all illegals","commenter_a":"California...the Land of fruits and nuts...and illegals...and terrorists","post_message":"'America is great. Trump is disgusting. Anybody but Trump,' read words dotted across the sky above the annual Rose Parade in California on Friday."},{"comment_id":"1067484166661144","commenter_b":"Ignorant woman!","commenter_a":"traitor","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response."},{"comment_id":"942978109072863","commenter_b":"You're supposed to protect your children not potentially ruin them.","commenter_a":"Ever think of asking her why she steals? How about showing how her loved ones are affected by her stealing, a family intervention. How about telling her that you love her and if there's ever anything that she needs, she can ALWAYS come to her father!","post_message":"Too far or just punishment?"},{"comment_id":"985543698152769","commenter_b":"This old lady sounds like she's craving for big nigga dick :)","commenter_a":"See ya bitch... Cracker ass Cracker!","post_message":"Like housemother like house sons."},{"comment_id":"10154294125329614","commenter_b":"Just in case she was looking for fame .....","commenter_a":"If this is the only problem, what we face as a nation , we are doing great ;)","post_message":"KTLA meteorologist Liberte Chan and the morning news team address the dress moment from the show over the weekend that has gained national and international attention."}]
