[{"comment_id":"10154369386141509","commenter_b":"Why are they racist? Because we want to deport illegal immigrants like every single country in the world? So the whole world is racist except for American liberal sissy's? Mexico deports all illegals so by your standards they're racist. England is racist. China is racist. Maybe your just a puppet?","commenter_a":"This won't sit well with the racist elements of the Republican party. Cruz is saying what I thought all along, the Republican party will never round up anyone. It's an election ploy with base voters.","post_message":"Texas Sen. Ted Cruz does not plan to authorize a special force to deport the undocumented immigrants currently in the country, he told CNN's Jake Tapper, setting up a policy contrast with Donald J. Trump. @webpagelink"},{"comment_id":"1413505585331340","commenter_b":"YOU are ONE CRAZY WOMAN!!!! You just wait.... Trump is going to eat you alive during your debates! Trump/Pence2016!!!","commenter_a":"I think she has short circuited or blown a fuse.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"},{"comment_id":"10154198214815496","commenter_b":"Kid is gonna put u away","commenter_a":"This is crazy they get to do this","post_message":"Live | The trial of the mom and dad accused of locking their son in a room for almost two years continues. More on what you're watching (and updates when the stream is down): @webpagelink More on the case | @webpagelink"},{"comment_id":"10153580764828352","commenter_b":"She needs to be done same way but leave her in the fire crazy birch.....stand there and ask her how it feel s and eat snacks in front of her ass she burns","commenter_a":"She look deranged with that crazy psycho stare","post_message":"Woman arrested for burning 8-year-old’s hands over open flame because she ate a snack without permission"},{"comment_id":"10153590500421409","commenter_b":"she is full of herself","commenter_a":"Wow what kind of so called \"FRIEND\" is she. Can't even be happy for Michael. So much drama. Nobody needs a friend like that.","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."},{"comment_id":"10157240650595294","commenter_b":"Nice dress","commenter_a":"I hope we get rain.","post_message":"Will rain get in the way of your Fourth of July celebrations? Jenn Harcher, Meteorologist is going to let us know!"},{"comment_id":"10153141758042994","commenter_b":"unfortunately my tax dollars go from her welfare check to paying for her prison cell...I have no sympathy for her whatsoever... I feel sorry for her living children..","commenter_a":"Where's daddy? Protector supporter?","post_message":"\"My client has suffered from serious depression, long-term chronic,\" Steve Kaplan said. \"She's also less-than-average in intelligence.\""}]
