[{"comment_id":"1260485777320174","commenter_b":"I can't wait for President elect Donald Trump to take office and start tossing out the undocumented illegals..........I hope this joker is the first to go.","commenter_a":"that is so sick they should kick them all out","post_message":"BOOM! (WATCH)"},{"comment_id":"10154024812315470","commenter_b":"Lol, whatever you have to tell yourself... moron.","commenter_a":"Seeing how anti-science Bernie is and how his followers uncritically swallow his anti-science stand I wouldn't be shocked by the numbers that try this.","post_message":"BE ON THE LOOKOUT! A picture going around on social media looks like an ad supporting Bernie Sanders, offering instructions on how to make so-called Bernie Sanders glow sticks. The recipe is actually for a deadly chlorine bomb."},{"comment_id":"896653263722173","commenter_b":"Why is she getting away with this lawless behavior?","commenter_a":"told ya!","post_message":"HILLARY CLINTON HANDS OVER A BLANK SERVER TO THE FBI Slick Grifter..."},{"comment_id":"10154079954761833","commenter_b":"hopefully some illegal alien or muslum will off her with a hammer .","commenter_a":"More people are killed with hammers in the US than guns each year. Why isn't she calling for tool manufacturers to be held liable?","post_message":"When Hillary Clinton says that the firearms industry is only business in America that is wholly protected from any kind of liability,\" she is not telling the truth. Gun manufacturers and companies are responsible for bad products. What they are not responsible for are bad people who misuse their products."},{"comment_id":"1750894945158794","commenter_b":"@username I'd rather be nationalistic than a back stabbing, gutless, two faced, squirming, sissified nonce!!!!","commenter_a":"If you don't support the country you live in, feel free to move to the country you support. Scumbags!","post_message":"WATCH: A police officer takes an American flag away from a protester who was trying to burn it outside the GOP Convention in Cleveland."},{"comment_id":"606686526157968","commenter_b":"@username I'm coming to rape and murder ur whole family","commenter_a":"Why not use that time, money, and tech to sniff out cancer, instead of destroying addicts lives by throwing them in a cell with rapists and murders?","post_message":"It's so powerful, it had to be calibrated in the pristine air of Antarctica — one of the few places in the world where it would read true zero."},{"comment_id":"961966360614126","commenter_b":"I bet Walt Disney rolled over in his grave whenever he's found out what you become you are such a vulgar I can't even use the time lady because ladies do not act like that but I will come help you pack free of charge I don't care what you have and how many boxes how many trucks I will help free of charge just to get you out. And thank you for the promise","commenter_a":"Good","post_message":"THEY'RE OUTTA HERE!"}]
