[{"comment_id":"10153248558026336","commenter_b":"Is eating pussy a sin??","commenter_a":"Just absolutely heartbreaking. So glad their little one survived. Prayers for all involved in this devastation.","post_message":"Melissa and Michael Mooneyhan died shielding their young daughter from a tornado in Arkansas. The girl, who is about 18 months old, survived."},{"comment_id":"665156860339272","commenter_b":"'@username God loves Christians and hates all other religions..... Look at how God backed the Christians when they slaughtered 100 million native Indians because they foolishly loved their land and their own spirits, not accepting Christ as the son of God..... so, they were slaughtered... but, they told the men not to waste the ammunition on the women and kids, so they slashed them to death with sabers and machetes.... and God smiled at them...... And, since WW II the Christian Americans have invaded 37 countries killing between 20 and 30 million people, none of them were white Christians though, so God again smiled and nodded with His approval...... We spent $3 trillion on killing 500,000 innocent Iraqi citizens.... or $6 million per person killed..... it is really getting expensive to kill people nowadays isn't it..... Just think if we had spent that $3 trillion on food, we would have ...","commenter_a":"The Hillary and government set up is trying to keep the polls low for trump an high for hilkery, with the media and asking him politely bow out when Hillary wins it's all to hide the fact that they are cheating and they expect to win by their cheating so it will look good when they say she has won and Obama said he would not leave the White House and would blockade anyone coming in but they are trying to make Trump say that he won't fight. Because they know the system is rigged and ready for Hillary but God it's the boss.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154437809561491","commenter_b":"Sorry, no. She is front and centre in this kangaroo court of #45. She cannot have it both ways.","commenter_a":"Let the woman live her life. Sure, I cannot stand Donald Trump to save my life. But what is going to set us apart him? We do not judge people based off of the behavior of someone else. That's what being a liberal is all about. Acceptance of each and every person on the basis of their individual character.","post_message":"The Internet is not happy with the latest post by Ivanka Trump's brand."},{"comment_id":"587813824710682","commenter_b":"Fuck Clooney! Trump 2016!!! Build that wall!!! Go Trump!!!!","commenter_a":"The rich have no idea because they live in there own world behind gates and walls take away all that and see how they feel","post_message":"“But the problem is all these other countries hear these things, and all of a sudden you see in France that [Jean-Marie] Le Pen is going, ‘Bravo,'” Clooney added. “You get all of these nutcases on the far-right fringe saying, ‘Well, if America thinks that…’ That is the real problem with Trump—his ideas bleed into the rest of the world.”"},{"comment_id":"10154712423493812","commenter_b":"Oh goody. The racist, sexist, xenophobe will meet the corrupt, mass murderer President of Mexico if he wins.","commenter_a":"To do what? Give him the bill for the wall?","post_message":"Donald J. Trump says, if he's elected, he would meet with Mexico's President Enrique Peña Nieto. Last week, Pres. Nieto said he'd meet with Trump, despite previously comparing him to Hitler and Mussolini."},{"comment_id":"414886538699640","commenter_b":"She needs to keep her legs closed and get a f*^king job....lazy ass","commenter_a":"That's sick","post_message":"She wants one more HUGE favor from us..."},{"comment_id":"1801777286727036","commenter_b":"She won't get paid for this job","commenter_a":"Kellyane Conway you are a pollster and not a campaign manger and it is showing. You have never been part of a winning national campaign your whole political career, and with Donald ' The Crook' Trump it looks like your record will be kept intact. Your only hope is that everyone has missed this army of Donald ' The Crook ' Trump supporters out there that just can't wait to vote from Donald ' The Crook ' Trump. But the only factual data that we have right now is early voting numbers,and so far Hillary Clinton is leading in the battle ground states including Florida,if Donald ' The Crook ' Trump looses Florida it is ball game over, he will never reach the 270 electoral votes to win the election. He has to win Florida, North Carolina, Colorado, Nevada, and turn a blue state or two red. I guess anything ...","post_message":"'Apparently the Hillary Clinton team is playing follow the leader, with us in the lead.'  -Kellyanne Conway"}]
