[{"comment_id":"10153503664933132","commenter_b":"Kourtney hasn't helped things along with Scott. If she thinks enough of him to be with him unless he's a horrible snored and she can't get any sleep her place is in bed with her husband! I love kourtney the most but I think shes too controlling. Scott is using his parents death as an excuse for anything he does wrong and that's not right either. But in my opinion Scott is gorgeous!","commenter_a":"They do make cute kids","post_message":"Cute alert!"},{"comment_id":"536178543246730","commenter_b":"Meg Whitman is a disgrace and a lousy CEO.Bitch needs to shut the hell up.","commenter_a":"She's a fool","post_message":"SICK & SHAMEFUL"},{"comment_id":"10153341180476545","commenter_b":"Didn't a Muslim refugees came to U.S.A and took part in 9/11? So yes we have seen American Idol attacked be a refugee","commenter_a":"Funny... I do treat people the way I wish to be treated, I have not once cut off anyone's head.","post_message":"Their voices: Both sides of the Richardson mosque protest VIDEO: @webpagelink"},{"comment_id":"1099293306823253","commenter_b":"Are you Serious ??/ \"You can keep your doctor \" LIAR Caliphate!","commenter_a":"The Classy president!!. The other side can run there collective mouths about things they have know idea about!!. ignorance is running wild in a America!!!.","post_message":"Gallup approval ratings show that President Obama is the most popular second-term president in recent history. Do you approve of the work Obama is doing in office?"},{"comment_id":"10153460687383598","commenter_b":"Wretched evil vile women","commenter_a":"These sick people are going to BURN IN HELL","post_message":"NEW VIDEO: Planned Parenthood official caught selling aborted baby's eyeballs"},{"comment_id":"588768447914861","commenter_b":"Good night bitches","commenter_a":"Well if ur dumb enough to punch urself in the face then ur dumb enough to not know Trump is the MAN and Hillary needs to be hung for treason and letting our people die in Bengazi","post_message":"For those who missed: @webpagelink"},{"comment_id":"1831610420459597","commenter_b":"This woman is a lunatic.","commenter_a":"Just when I thought no-one could possibly be worse than Trump..","post_message":"Forget that Donald J. Trump is accused of sexual assault...and that President Bill Clinton is not on the ballot."}]
