[{"comment_id":"539180629598484","commenter_b":"Good one. That made me chuckle.","commenter_a":"Because nothing screams, \"I'm protecting the environment\" like flying your private jet to accept an environmental award.... lol","post_message":"Some eyebrows were raised when DiCaprio took a private jet from Cannes to New York City to pick up an award from Robert De Niro's clean water advocacy group."},{"comment_id":"10154341383138067","commenter_b":"yeah,I think it is a great idea because Arnold make America ruined again and Donald make Apprentice again","commenter_a":"Publicity stunt. Stay tuned America","post_message":""},{"comment_id":"1004815269538226","commenter_b":"No im against the pregnant women always tryna make the world owe them for having sex.","commenter_a":"Pregnant women have too much sense of entitlement I have no pity for the broad Much respect to the cops","post_message":"When Charlena Michelle Cooks, 8 months pregnant at the time, would not tell officers her name right away, they pushed her to the ground on her belly and cuffed her. Video: kiro.tv/BodyCam"},{"comment_id":"10153978622861438","commenter_b":"Of course she is. I could see through that bubbly bs","commenter_a":"Shocker....not.","post_message":"Kelly Ripa’s morning talk-show drama might force us to acknowledge all the work that goes into her cheery persona."},{"comment_id":"10153193564170326","commenter_b":"Hell, they should move to texas!","commenter_a":"The GOP and their love for guns should move to Somalia where even children carry guns","post_message":"\"More guns\" is always the answer."},{"comment_id":"10154167208567235","commenter_b":"@username pull the covers over your head !","commenter_a":"An apology? Are you kidding? How about publicly embarrassing the asshole who singled this man out? \"Land of the free\" my ass. More like \"police state of fear\". This is disgusting. What stereotyping trash people have become.","post_message":"“She kept staring at me and I didn’t know what was wrong,” he explained. “Then I realized what was happening and I just was thinking ‘I hope she’s not reporting me.’”"},{"comment_id":"931634046893125","commenter_b":"Because she is vermin....","commenter_a":"Why are there so many Hillary hating Trolls on here?","post_message":"\"We can’t hide from hard truths about race and justice. We have to name them and own them and change them.\"—Hillary"}]
