[{"comment_id":"10152946576794099","commenter_b":"doesnt matter, she is still an adult","commenter_a":"i worked the front desk at a college dorm and i cant tell you how many times ive had mommy's call and ask me where their child is because they didnt answer their phone. shes 19! give her a break.","post_message":"A Connecticut teen who was reported missing after going out with a man she met online has been found safe, police say @webpagelink"},{"comment_id":"579776192190480","commenter_b":"Leave now bitch","commenter_a":"Good Bye.","post_message":"Whoopi Goldberg Says She Might Leave The Country If Trump Is Elected. Well I guess she's going to say goodbye. Will you happy to see her go?"},{"comment_id":"10153300908534411","commenter_b":"She doesn't want the truth.","commenter_a":"Blacks kill more blacks if you really want the truth.","post_message":"An analysis released last week shows that more white people died at the hands of law enforcement than those of any other race in the last two years, even as the Justice Department, social-justice groups and media coverage focus on black victims of police force."},{"comment_id":"10152811499753525","commenter_b":"Evil little monster! How would you ever trust her again!!","commenter_a":"as she should be charged.","post_message":"A Colorado mother says she smelled something different in her drinks on two occasions. She confronted her daughter about it. Now, a young girl is charged with attempted murder.   READ: @webpagelink"},{"comment_id":"10154280732936336","commenter_b":"Agree100%","commenter_a":"How is this discriminatory? Use the bathroom according to your plumbing not your frame of mind. What about the civil rights of those who don't want to share the restroom with those of another gender? If a transgender earns money they pay taxes according to their earning not what they think they should pay. I'm really tired of a few people re-writing the moral and cultural standards for the nation.","post_message":"\"I’ll make a decision in 24 hours.\""},{"comment_id":"1728567140790384","commenter_b":"Probably gonna be built by the illegals","commenter_a":"Let's do it!! Give jobs to citizens.","post_message":"BORDER WALL: President Donald J. Trump is expected to sign an executive action today to jump start construction of the border wall that he promised would be built during his campaign.  MORE: @webpagelink"},{"comment_id":"10154805398708812","commenter_b":"Ha ha. That'll teach them.","commenter_a":"George R. Sadler DW Adams","post_message":"Police in Southern California on the lookout for brazen thief who broke into a YMCA and stole fake cash from a toy register."}]
