[{"comment_id":"10153459242386409","commenter_b":"That will teach him to open his big Mouth !!","commenter_a":"This is ridiculous","post_message":"A murderer serving three life terms for killing three people saw two more decades added to his sentence after a Washington State parole board considering his request for early release felt his crimes called for a harsher punishment."},{"comment_id":"769219589888459","commenter_b":"i have been there over and over the last time a mexican woman tried to give my mother her baby beged my mother to take the child this is a fact and sad but if mexico is so great then way are so many comming to America","commenter_a":"Who would want to move to Mexico? In dire stress, a person could find better options than that Anti American, drug cartel controlled country. Funny how they are so anti American, but so many scramble to get here huh? The citizens of Mexico don't even want to live there, and I can't say I blame them.","post_message":"Americas Freedom Fighters"},{"comment_id":"1253188708034490","commenter_b":"Made me laugh!! Stupid B!TCH she is!!","commenter_a":"lets have fun with duct tape and her, and then post a pic to shame her going \"this is what happens when your an abusive POS pet owner who has no morals or respect for what we call mans best friend\"","post_message":"A woman first shared the disturbing photo Friday morning on Facebook, with the caption, \"This is what happens when you dont shut up!!!\""},{"comment_id":"10153471883581509","commenter_b":"Can we remove obese women who wear the wrong sized clothing and bathing suits? Tired of seeing leopard print spandex stretched to its capacity, duck faced selfies and moose knuckles. Help me retain my eyesight please FB.","commenter_a":"Or 'dirty' words, children can be confused.","post_message":"Facebook is getting super-specific about what is and isn't allowed on the social network. @webpagelink via CNNMoney"},{"comment_id":"1241837469190442","commenter_b":"@username was gonna say too :/.. probably bhs...","commenter_a":"Tim","post_message":"Ready to play during recess? Sit on the bench at this school, and you'll find friends in no time. (via CBC Saskatoon)"},{"comment_id":"1076303882387835","commenter_b":"Stoooopid bitch! ! ! ! ! ! !","commenter_a":"Folks, QUIT talking about her, just let her fade away to hell.","post_message":""},{"comment_id":"10153093023857293","commenter_b":"Ha Ha Ha!","commenter_a":"the Republican brand has been damaged long before Trump! He is just icing on the top!","post_message":"The head of the Republican National Committee wants Donald J. Trump to tone it down."}]
