[{"comment_id":"1721472904763525","commenter_b":"^^^Yet he has no blood on his hands. Killary got that cure little nickname for a reason. Several, in fact.","commenter_a":"We can not and must not settle for Clinton or worse Drumpf. The time is near and we must let everyone know, that If Bernie somehow doesn't win the nomination, we want him to run as a independent so we can put him in the White House. Too many people registered as independent did not have a chance to vote in closed primaries, if they did Clinton would not be leading with pledged delegates. The Democratic Party must be aware that if Bernie runs as an independent there is no chance of Clinton winning anything, so if they don't want Drumpf in the White House they should start backing Bernie now. Because there is no way in hell I'll ever vote for Clinton.","post_message":"Here's the promise I made to you on day one of this campaign: Not only will I fight to protect the working families of this country, but we’re going to build a movement of millions of Americans who are prepared to stand up and fight back. We’re going to take this campaign directly to the people – in town meetings, door to door conversations, on street corners and in social media. Right now we are in Indiana. Tune in live here:"},{"comment_id":"1544777802496810","commenter_b":"i smell a rat and it's not trump and his wife. ignore them,","commenter_a":"Are we still talking about this? Oh Glenn, you've lost your way!","post_message":"She has been done a grave disservice by somebody."},{"comment_id":"963164673751396","commenter_b":"Or, why do we have money to support refugees but not vets or social security?","commenter_a":"because welfare has got our money","post_message":"Americas Freedom Fighters"},{"comment_id":"495130020646953","commenter_b":"So work overtime so you can afford your eggs. Whining like a menstruating bitch with sand in her vagina isn't going to improve the situation.","commenter_a":"Fuck you MCdickbags watch egg inflation. Then this will make natural farm raised local eggs like $25 a carton","post_message":"McDonald's currently uses around 4 percent of all the eggs produced in the United States each year, around 2 billion eggs total."},{"comment_id":"1811243409145396","commenter_b":"what kind of genius stays with a man who outright cheats on you and is a womanizer....","commenter_a":"what kinda genius puts our deficit at $20 trillion....","post_message":"\"Now, how anybody can lose a dollar, let alone a billion dollars in the casino industry, is kind of beyond me,\" Hillary Clinton said of her opponent."},{"comment_id":"10154182818316943","commenter_b":"WE ALL KNOW WHAT SHE DID WITH THEM!!! TRAITOR","commenter_a":"Breaking Leaders who are above the Law. Oh but what Hillary did isn't wrong... Give us a break. Amazing when American Citizens even a Police Officer was arrested & charged for helping the enemy. But she can do it and not held accountable... Since when did Leaders come under a double standard system. Even other's say for one to commit treason not held accountable. Law & Order a Justice System that's fair & honest...","post_message":"Among the 14,900 federal documents Hillary Clinton is said to have failed to turn over to the State Department in 2014 are some related to the Benghazi attacks, according to Judicial Watch. - via The Daily Caller"},{"comment_id":"1040475262630610","commenter_b":"Many women who can't do hormonal, do the copper IUD. 10 years in, less of a fail rate than a tubal!","commenter_a":"If only BC didn't have so many side effects tho. I had to get off, I almost had a stroke at 30. Not to mention I gained 40 lbs😟","post_message":"Today is the fifty year anniversary of a court case that changed everything"}]
