[{"comment_id":"1001682469851506","commenter_b":"This lady is so delusional. .... how did this happen","commenter_a":"Does no one get the part where they are wielding skateboards at police? This isnt because a WHITE COP or two BLACK KIDS.... this is because TWO CRIMINALS TRIED TO ESCAPE AND USED SKATEBOARDS TO ASSAULT POLICE!!!!!!!!","post_message":"JUST IN: This footage shows step-brothers, Bryson Chaplin and Andre Thompson, at Safeway -- before they were shot by an #Olympia police officer. >> kiro.tv/SurveillanceOly  They are both expected to survive."},{"comment_id":"10154680763616729","commenter_b":"So what makes you think her scores were low? What makes your comment racist is that you assume she was brought in to make quota and you assume she had low scores.","commenter_a":"Shocker! She is a person of color! Don't scream my comment is racist. It is a glaring problem in the military academies that they bring in people of color to meet a quota, thus depriving others that scored better of the opportunity to attend. These cadets have little to no respect for the US, the military or the academy. The all black cadet photo of them with raised fists of black power that went unpunished is a good example. Fuck Obama's America!","post_message":"No wonder this has gone viral."},{"comment_id":"10154433105394087","commenter_b":"I'm an independent, but republicans are completely full of shit. And they don't mind the smell. Their platform is based on racial deportation.","commenter_a":"100% TRUTH","post_message":"\"Unless more leaders in the black church recognize that blindly supporting one party, which has done nothing to earn that support, is not benefiting those that they serve, the church will continue to lose its political influence.\""},{"comment_id":"458714004327362","commenter_b":"Whinny assed little bitch is what he is","commenter_a":"Lies or on all sides. It is politics and hard to see who really is lying. Media is a manipulator.","post_message":"These are some heavy-duty tweets..."},{"comment_id":"10153610330463132","commenter_b":"Scum","commenter_a":"This concept of if someone slap you and you give your other cheek instead of smacking back doesn't apply here. He killed 9 innocent, unarmed and specifically in a worship place, the crime is much bigger and what is the guarantee he won't do it again??? So no mercy, or leniency must be shown to deal with this BABY-CUT apparently innocent looking monster....","post_message":"\"You have killed some of the most beautifulest people that I know And it will never be the same. But as we said in Bible study, we enjoyed you. May God have mercy on you.\" #CharlestonShooting"},{"comment_id":"880035775457816","commenter_b":"Some of the women who have become men have beards ,tattoos and 6 packs. Do people really want them to still use ladies toilets?","commenter_a":"This is not a presidential issue","post_message":"WATCH: Donald J. Trump addressed the recent fight over transgender use of public bathrooms, and whether he'd add separate facilities at his Trump properties."},{"comment_id":"10150599168414999","commenter_b":"You only have the right to vote under certain criterion. If you want to use language like \"never was\" then I assume you forgot that only property owners were allowed to vote under the original constitution and blacks were also excluded. Changing times demand we evolve to the need. At this time we have tens of millions of Illegal aliens who have the ability to fraudulently vote. That is a potential problem.","commenter_a":"For me this is not about party politics as I am unaffiliated. 70% of Americans want voter ID. This is not about blocking the vote, this is about blocking the illegal vote. 52% of Dems, 82% of Repubs and 72% of independents agree want this, why should we ignore what is an obviously good idea?","post_message":"Democrats are most likely going to attack a host of measures, including voter identification requirements that Democrats consider onerous, time restrictions imposed on early voting, and rules that could nullify ballots cast in the wrong precinct."}]
