[{"comment_id":"1330438396971266","commenter_b":"Better than the PUSSY approach you girls are doing","commenter_a":"What does Biden know he follows Obama.","post_message":"Biden took on Trump in a recent foreign policy speech, arguing that America doesn't need \"empty bluster,\" or the \"insecurity of a bully.\" What do you think of his comments?"},{"comment_id":"10153198531370950","commenter_b":"Yes, she was just hoping some cop would come in and throw her across the room. See how stupid that sounds?","commenter_a":"def smell a get rich quick scheme in the works :( ugh ...........it was all her own damned fault ,,,,,,,,,,,no payment is deserved !!!!","post_message":"\"She now has a cast on her arm, she has neck and back injuries. She has a Band-Aid on her forehead where she suffered rug burn...,\" the student's attorney told ABC's \"Good Morning America.\""},{"comment_id":"1772229929682875","commenter_b":"@username In defense of Donald Trump : Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not starting a race war. Trump did not leave any US soldiers in Benghazi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion ...","commenter_a":"Trump represents everything that is wrong with America. A narcissistic opportunist, a pathological liar, a clueless idiot, an unashamed con man and an unapologetic bigot!","post_message":"Imagine this man in charge of our men and women in uniform."},{"comment_id":"499065056962019","commenter_b":"I can't stand her. Send her back to India where her parents are from.","commenter_a":"We can't let the GOP pick and choose who they want in office. It is up to the voters! GOP take notice, heed our warning, because if this does happen, and Donald becomes and independent; there will be. Democrat elected!","post_message":"Now that she criticized him, will Donald Trump snuff out Gov. Haley's rising star?"},{"comment_id":"952878738162068","commenter_b":"Than go home! Are laws not yours","commenter_a":"mix bacon with it .../","post_message":"\"The Islamic form of slaughtering animals involves killing through a cut to neck when the animal is still alive. An Islamic prayer is then read as the blood is drained from the body. In the UK animals are legally required to be stunned before their neck is cut, but some Muslim argue this is against their religion.\""},{"comment_id":"10153898072441680","commenter_b":"Hillary has no respect for women! Ask the many rape victims of her husband - they'll tell you so!","commenter_a":"Right on-NBC survey monkey poll!! Ha,ha that's a good one-where was the survey taken,\" at the Bronx and Philly zoos! Did they survey the snakes?? How bout the cheetahs, the rats, the felons??! God help us!!!","post_message":"The NBC/SurveyMonkey poll out Monday finds that 63 percent of likely voters say Trump doesn’t respect women much or at all."},{"comment_id":"10153279474011680","commenter_b":"She's fat","commenter_a":"Hot daughter, John","post_message":"The daughter of Sen. John McCain, who picked Sarah Palin to be his running mate in 2008, said she was specifically pained because of Donald J. Trump's past remarks about her father's prisoner-of-war status in the Vietnam War."}]
