[{"comment_id":"10154569592984497","commenter_b":"@username GO FUCK YOUR MOTHER","commenter_a":"Mom really in love with new fat penis-shaped exotic veggie.","post_message":"\"Carol from book club told me about it and sent me a recipe to cook it in a skillet.\""},{"comment_id":"10153153203728525","commenter_b":"The girls that go there will be fine.","commenter_a":"If you think this is funny just know that you're wrong and a terrible human being. This is the reason that young girls are raped and abused, because \"boys will be boys\". Or they were 'asking for it'. We've become a society where men can get away with sexualizing everything but its okay but they're boys and it's in their nature. But good to know that half of you people (that are most likely all parents) are okay with your daughters being looked at as nothing but a piece of meat.","post_message":"Imagine rolling up to drop your daughter off at college for the first time and seeing this: @webpagelink"},{"comment_id":"10154435925811509","commenter_b":"Stz! Sexually transmitted zombies","commenter_a":"This is it. This is how zombies start.","post_message":"CDC confirmed the first case of Zika virus being transmitted sexually in the U.S. Dr. Sanjay Gupta has been following this fast moving story closely and is here live to answer your questions. What do you want to know?"},{"comment_id":"1737362022990205","commenter_b":"#fingersinthebootyassbitch","commenter_a":"He looks miserable. ..","post_message":"Kim Kardashian West is reportedly 'annoyed at him for refusing to rest' following 'psychotic break' (Via Daily Mail Celebrity)"},{"comment_id":"1247749101912765","commenter_b":"It's so well done!","commenter_a":"@username Martha Elizabeth","post_message":"Periodic pumpkins!"},{"comment_id":"973671239335036","commenter_b":"She always has been a racist bitch. Where have you'all been?","commenter_a":"Get your head out of your ass and do something productive with your life.","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"759924327531478","commenter_b":"Just showing up is prolblem for me. Trash that is all she is","commenter_a":"Yes","post_message":"You Won't Believe What Hillary Clinton Was Caught Doing During Nancy Reagan's Funeral This is really does speak volumes to what kind of person she really is. Do you think Hillary Clinton would make a terrible president?"}]
