[{"comment_id":"1840806586176177","commenter_b":"Will someone get this dumb bitch to shut up. let her crawl back into the hole she came from","commenter_a":"And I believe Conway has four children.","post_message":"Apparently the Trump team still thinks it's 1955."},{"comment_id":"10153288097452629","commenter_b":"Hmmm. But I'm mixed so do I only get 5% off?","commenter_a":"Ariel help the world is blind","post_message":"If you love BBQ (and you're white), June 11th is your lucky day."},{"comment_id":"888955024560582","commenter_b":"Yeah!!!","commenter_a":"@username @username lunch 2mrw?!","post_message":"When you realize tomorrow is Friday... (click to play)"},{"comment_id":"10153291728974726","commenter_b":"Is it just me or is it beginning to look like it is just one group of \"slick\" parasites that is destroying America.","commenter_a":"Some people get it. Too bad the entitlement crowd isn't listening! They would rather consider themselves as victims of Whitey.","post_message":"VIDEO: Tavis Smiley: Government Programs Have Led to the Dissolution of the Black Family"},{"comment_id":"10154609681272300","commenter_b":"Actually she was not fat. The rules do not say you have to be a size 2.","commenter_a":"trump has no room to talk about calling anybody miss piggy especially when he posts pictures of him eating Mcdonalds and KFC on his private jets.","post_message":"Donald J. Trump called her “Miss Piggy” and “Miss Eating Machine” because she gained weight after winning the Miss Universe crown."},{"comment_id":"1006130662760739","commenter_b":"And that White women take full advantage of affirmative action every day, it's not just for black people","commenter_a":"Does he ever need a history lesson. Start with \"When Affirmative Action Was White,\" and \"The Half Has Never Been Told,\" to start.","post_message":"The famous actress' brother brags about manipulating affirmative action policies to get into medical school."},{"comment_id":"956678911036116","commenter_b":"Trump is right ! All 11 million illegals have to go !","commenter_a":"Trump Chopper in Air Salad toss on a stick taint Fear God Trucker Hat -.......... high-ku Reverend #TrumpTrain #GOPClownCar #iacaucus","post_message":"\"They have to go.\""}]
