[{"comment_id":"10153979603521509","commenter_b":"Time for all illegals to go home","commenter_a":"Rather have trump in kkk then black panther party","post_message":"Former Ku Klux Klan leader David Duke said Donald J. Trump is the \"best of the lot\" -- but didn't endorse him for 2016: @webpagelink"},{"comment_id":"653257648132607","commenter_b":"I agree. Fuck Kim Kardashian! She is trash.","commenter_a":"So a woman who's apparently famous for releasing a sex tape of her getting pissed on gets robbed of 10 million dollars worth of jewellery. Who the Fuck cares.?","post_message":""},{"comment_id":"10153221769812894","commenter_b":"Bitch u jealous","commenter_a":"I think this is wrong she was not a president she did some great things yeah but to change it from what it is is in my opinion just wrong see this is what's wrong with people they vote for stupid shit like this but don't vote for education or something we really need Gosh America where are your priorities????","post_message":"Harriet Tubman Wins Vote to Replace Andrew Jackson on the $20 Bill"},{"comment_id":"611768719013707","commenter_b":"She's a piece of shit black bitch. That's all","commenter_a":"The Bitch is an idiot!!!!! Ignore her!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"},{"comment_id":"1357571687635909","commenter_b":"Kidult fan!","commenter_a":"That's what the fans should be saying to you","post_message":"Don't get us thrown out of Euro 2016"},{"comment_id":"10153838559734203","commenter_b":"I said it, these muslims terrorists are disgiusing themselves as refugees, it is time for europe to immetiate Autraleria, keep them in prison like camp, then deport them back to where they are coming from","commenter_a":"bull. shit.","post_message":"A Greek official said the Syrian passport holder whose ID was found on the body of one of the Paris attackers landed in Greece last month on a boat from Syria."},{"comment_id":"935042419864513","commenter_b":"Our borders have never been as bad as they are now. Obama is to blame for that! You never hear about it on the news either. I have family in the South and they say it's scary whst is coming into our country right now illegally.","commenter_a":"Good going trump lets get started right now throw Obama in jail and you can take over tonight","post_message":"Donald Trump's announcement is something we've never seen in history!  This is HUGE!"}]
