[{"comment_id":"10153288291318812","commenter_b":"That is great! I had to tell a mom to stop playing games on her phone in the theatre once. She was playing for nearly half an hr into the movie & it was totally distracting cuz of her huge bright screen & she was holding it up right in front of her face.","commenter_a":"Praise God it is so good to know that some people do still believe in kids being obedient and respectful to their elders.","post_message":"\"This rude, disrespectful, and awful behavior is unacceptable and they owe you an apology.\"  Mom's Facebook apology for kids' bad behavior at the movies brings recipient to tears: @webpagelink"},{"comment_id":"10156586680480354","commenter_b":"Well @username be a man and stop hiding your face pussy","commenter_a":"Harry Truman was reigned back when it came to steel factories and labor unions. Obama needs to be reigned back with infringing on the 2nd Amendment!!!","post_message":"Today Obama destroys the 2nd Amendment.   And it's FAR worse than Americans feared..."},{"comment_id":"10153140603601051","commenter_b":"Shut up bitch [Lizzie] !!!","commenter_a":"I believe you were given an explanation...if your son didn't understand, you sure did and should have suggested he put it on the wall or door of his bedroom. You are the parent.","post_message":"This mom didn't think anything would happen when her disabled son displayed something in his window. A few days later she got a letter from her community's management company: Pack your things and leave."},{"comment_id":"10153030782377434","commenter_b":"Thank you. However, white women wear wigs and added hair too. 95% of them in hollyweird do.","commenter_a":"I think this is significant when many African American female celebrities wear wigs that look like Caucasian hair, because of our so-called standards of beauty. I think the natural look is much more attractive and empowering for girls who look to them as role models.","post_message":"“If you say you’re beautiful without hair and makeup, then they will believe you,\" Maria Borges said of the hairstyle she walked during the Victoria's Secret Fashion Show."},{"comment_id":"417366948387900","commenter_b":"Hey rhino you want amnesty, and the DOJ candidate Obama and Holder want , your one of five republicans and who would negotiate with a terrorist country ? In sorry you won the election here in SC , your a R HINO ,","commenter_a":"Good point ...........we should be negotiating with Iran!","post_message":"Lindsey Graham has some harsh words for Rand Paul."},{"comment_id":"10153753361057464","commenter_b":"That's right! Those are AR-15s. These gun control people just don't have a clue.","commenter_a":"Ted you need to do something about this gun control crap. Like stop it","post_message":""},{"comment_id":"10152706820701051","commenter_b":"A lot of the comments posted here are no better then the girls who did this. Nothing but a lot of hate.the girls had no right to hurt anyone.But are you any better.look at your comments.and yes I think this girls should pay for what they did.Bottom line no has a right to go beating up people .Got a problem do it right call the law.that's is if your not just personally the one wrong","commenter_a":"Its racially insensitive to assume black girls can tell the difference between right and wrong. As well as controlling their impulses. Seriously white folk....one step at a time.","post_message":"One of the women who beat up this teen girl says she’s the real victim. Here’s why."}]
