[{"comment_id":"10152796636027217","commenter_b":"where are the women","commenter_a":"Check their passports and visas ...","post_message":""},{"comment_id":"10157271699240354","commenter_b":"sure take foreign money and rule with foreign masters LOL NO way you fool.","commenter_a":"No you don't, it's payola, play for pay!","post_message":"WATCH Hillary Clinton's hatchet man, David Brock, concede 'Clinton Cash' is no conspiracy book and discuss how the Clinton Machine is hunkering down for Donald Trump's big Monday 'Clinton Cash' speech on Hillary's self-enrichment through the Clinton Foundation..."},{"comment_id":"1068743996585956","commenter_b":"No deport non americans and those who wish to leave..escort them to Mexico..let themtry their bullshit with them..see how far they get..I am fed up with the demorats/libtards!","commenter_a":"No","post_message":""},{"comment_id":"10153857469189197","commenter_b":"Sorry, she does need spanks to look even better ! And you know it !","commenter_a":"Lol....I love my Spanx!!!","post_message":"She was trying on dresses for an upcoming formal, but her mother took to Facebook following the experience they had inside the dressing room-->> @webpagelink After you read the mother's message to the employees, tell us what you think in the comments below!"},{"comment_id":"558632694347761","commenter_b":"Oh Karen, you drank the Kool-Aid!","commenter_a":"Clinton News Network is the Communist News Network! Suppressing the american people and the truth and shutting down live feed the minute anyone mentions anything negative about your Wicked Queen is disgraceful! Your network is just as bad as the National Inquirer with fake reporting! You continue to try and brainwash americans into believing the left wing propaganda. News Flash...millions of americans are starting to use their own brains, which you can no longer control! Continue to cheer for Killary, because you're proving to the american people that your network is as crooked as she is!","post_message":"“There’s no quote. You’re not gonna find a quote from me,” Donald J. Trump told Hillary Clinton. Well, we found a few. Watch 4 of Trump's statements from the debate stage that don't seem to match up with what he previously said @webpagelink"},{"comment_id":"10153471802056336","commenter_b":"It's a woman's choice regardless Patricia","commenter_a":"And is a distortion of the truth. No body parts were offered for sale. This is a complete propaganda that Ted Cruz is too stupid to know to avoid. Dumb canuck.","post_message":"\"These tapings of Planned Parenthood selling body parts are grotesque. It highlights the evil of what they're doing.\" – Sen. Ted Cruz"},{"comment_id":"10154994151726800","commenter_b":"Thinking of spending time at home. On the Galapagos islands with the other tortoises.","commenter_a":"@username dudes face says it ALL!!","post_message":"#LifesAMitch"}]
