[{"comment_id":"1194580720554183","commenter_b":"This is all propaganda to rig the voting pattern and is trashy media reporting.","commenter_a":"THE PEOPLE LOVE TRUMP, WE LOVE AMERICA, WE WILL TAKE HER BACK FROM THE FILTH IN DC WHO RAPE OUR COUNTRY AND TERRORIZE OUR PEOPLE!!!!","post_message":"You've heard all the claims that Donald Trump has no chance of beating Hillary Clinton in the general election. Now, here's how that argument is instantly deflated"},{"comment_id":"10153511380259641","commenter_b":"I can't believe some of the comments here - So much hate {that's not justified} :/","commenter_a":"RIP the old England, lost to Islam now.","post_message":"#TBT:"},{"comment_id":"10154440357348256","commenter_b":"ANY WOMAN BUT HILLARY!","commenter_a":"Looking forward to the Change!","post_message":"All 50 signed a letter warning that, if elected, Donald Trump \"would be the most reckless President in American history.\""},{"comment_id":"1242392142481615","commenter_b":"Scumbag.","commenter_a":"Is that hair under her arm. Yuk!","post_message":"TRASHY, AGING Pop-Star Madonna Uses Picture Of Pubic Hair To Recruit Females For Anti-Trump Inauguration March  ***WARNING***Picture contains partial nudity."},{"comment_id":"886400474789539","commenter_b":"so many thugs trying to kill cops what do you expect?","commenter_a":"Crooked cops what would you expect?","post_message":"\"I just tried to cover my face from all the beating that the officer was giving me.\"  -Floyd Dent"},{"comment_id":"10153600253057431","commenter_b":"Well stated @username. Irony received. 😉","commenter_a":"White supremacist exist whether as paramilitary, or the idiotic Trump supporter who thinks he owns everything and everybody telling a Hispanic American (Jorge Ramos) to go back where he came from, to people who will destroy other cultures way of life for a dollar because they have no respect for others. They are so pervasive the only way to resist them is for people of color to band together. To pretend white supremacist don't exist or that they will magically disappear is to ensure their continued control over our lives. Working together to overcome an evil is not anti-American, it's just common sense.","post_message":"Fighting White Supremacists: Don't Forget, We Are In It Together!  @webpagelink"},{"comment_id":"554388108092251","commenter_b":"Merry Christmas to you and your family","commenter_a":"GOOD+++","post_message":"May your Christmas be filled with happiness and hope. Let us not forget the women and men overseas protecting our freedom. Merry Christmas from my family to yours."}]
