[{"comment_id":"10153599310496037","commenter_b":"I feel sorry for his wife, NO money in the world is worth having to sleep beside that every night.","commenter_a":"Arise Trump Republicans! Demand that all the other lame Republicans running for the GOP nomination quit AND bow down to The Don.. and boycott Fox News.. (^^^) (y)","post_message":"Donald J. Trump, angered by Megyn Kelly's line of questioning during the GOP debate, later told CNN that she had \"blood coming out of her eyes, blood coming out of her wherever.\""},{"comment_id":"917736131581794","commenter_b":"If she wants us white people to die bring it I'm locked and loaded she ain't got the balls to","commenter_a":"Now who's the racist.","post_message":"I'm sorry, what?!"},{"comment_id":"1068079936600104","commenter_b":"Most Mexicans ARE Indians....there for they are home.....my people the INDIANS OWN THIS LAND!","commenter_a":"Dems are the ones dividing the nation by spewing their judgement and hate on all those that don't agree with their views.","post_message":"WATCH: Donald J. Trump hosts campaign rally at the Fox Theatre in Atlanta. @webpagelink"},{"comment_id":"1726500120946412","commenter_b":"I'm not really sure why anyone would vote for that scandal ridden woman, but hey you got this little buddy.","commenter_a":"I did vote for U.S. Senator Bernie Sanders to win, but I not upset that my choice did not win, no, I let Democracy decide on that, and I am proud to vote for Hillary as our first female president. Everyone Rock the Vote!","post_message":"So much for party unity."},{"comment_id":"1171441452907864","commenter_b":"@username really Dems are racist?name a dem that wants to deport all Mexicans then get back to me..","commenter_a":"Good thing no one cares what Little Marco has to say. I'm sure Trump has no need for losers as VP either!","post_message":"In a statement on Facebook, Marco Rubio said he has no interest in being Donald J. Trump’s running mate and put VP rumors to rest."},{"comment_id":"10153457138529342","commenter_b":"With clothing like this... Close the borders!","commenter_a":"Ya'll do know that \"Mexican\" isn't a race, it's a nationality...","post_message":"Have you seen Jonathan Figueroa? He's believed to be driving a maroon Ford Taurus. He's a person of interest after a mother and child were found dead in a southeast Houston home. #abc13 FULL STORY---> @webpagelink"},{"comment_id":"10153443482053352","commenter_b":"He knew that bitch was cazey","commenter_a":"Idk what to say bout him, i know personally a man who loves n does for his kids, but his child's mother does not let him take his son ANYWHERE, n will continuously say he sick or he can't go, but always calls when he needs shoes or something and holidays.. So i can't judge him. Also just because ur behind on child support doesn't make u a deadbeat, you can be behind while making payments still!! Its sad what this family has to go thru but not everyone is educated on their parental rights or can afford court! I just feel sorry for the kids n the family.","post_message":"Dad of Kids Found Dead in Freezer Comes Forward #TRENDING"}]
