[{"comment_id":"10153554902129087","commenter_b":"Ha haaaa!!! I think it's funny you fools immediately claim racism when somebody wants to do something that doesn't suit you. Well get over it!!! ILLEGAL immigrants have no business being here! Come to this country LEGALLY or fuck off!!!!","commenter_a":"We paid Mexico for those borders and they let illegals in and tramp through their country to come here Yeah you will pay for it..","post_message":"\"I’m not going to pay for that f---ing wall,” former Mexican President Vicente Fox to Jorge Ramos during a fiery interview on Thursday. \"[Donald Trump] should pay for it. He’s got the money.\""},{"comment_id":"937107439663448","commenter_b":"These ladies look forward to the attention of their dress, slot b of time and money is put into finding the perfect dress ,I don't watch the awards I could care less but I know people who watch it just to see what is being worn them turn s it off","commenter_a":"non-story","post_message":"When it comes to the Academy Awards and other red carpet shows, this is what smart, successful women get asked about instead of, you know, their accomplishments. Sigh."},{"comment_id":"2130174917081223","commenter_b":"He is better off with out the old hag!","commenter_a":"Hell of a man","post_message":""},{"comment_id":"10153171636986756","commenter_b":"Trust me, women are interested in computer science. The brogrammer culture is very offputting.","commenter_a":"Considering that there were more women in computer science back in Turing's day than there are now?","post_message":"There are fewer women in fields where genius is a perceived prerequisite, a study finds. Does the stereotype of the male \"lone genius\" in art have an impact?"},{"comment_id":"10152912093186749","commenter_b":"PUKE.","commenter_a":"PUKE","post_message":"This Valentine's Day, Nicholas and Dylan are finally able to celebrate their legal marriage. This is progress. @webpagelink"},{"comment_id":"10154464043803010","commenter_b":"Stfu bitch","commenter_a":"Cop shot the hood who shot him. Case closed. #righteouskill","post_message":"Officers stumbled into a shooting in progress, and a gun battle ensued."},{"comment_id":"875538442502852","commenter_b":"Absolutely, illegal is illegal and alien is alien!!!!!","commenter_a":"There is no reason they can't do that legally","post_message":"Don't you agree this is ridiculous?"}]
