[{"comment_id":"1412807245405968","commenter_b":"Again....she attacks her husbands victims. She's a POS female.","commenter_a":"Says the woman who stood by her philandering husband on numerous sexual misconduct occasions. And then she attacked the women. She is the one who set women back!! I want a much better role model for my daughter.","post_message":"\"When Donald J. Trump says, 'Let's make America great again,' that is code for 'Let's take America backwards,'\" Hillary Clinton said."},{"comment_id":"10153863012497042","commenter_b":"Stfu pussy","commenter_a":"Well, The Knicks Can't Hit A Shot, But I Guess Shots Can Hit Them...","post_message":"BREAKING: New York Knicks player Cleanthony Early was held up at gunpoint and shot in Queens just hours ago, NYPD says."},{"comment_id":"10153977158805329","commenter_b":"Tia Guilbert","commenter_a":"@username this is me","post_message":"jump in! (via BuzzFeed Animals)"},{"comment_id":"1022858884507686","commenter_b":"Just go away! Crawl into the hole of failed soorts stars, and never come out again, unless you grow up and apologize to America!","commenter_a":"Way to preach Professor Kap! Fool!","post_message":"Colin Kaepernick praised the dictator's commitment to education and criminal justice reform.  \"We do break up families here. That’s what mass incarceration is. That was the foundation of slavery. So our country has been based on that as well as the genocide of Native Americans,\" he added."},{"comment_id":"1297507013642106","commenter_b":"STFU dumb bitch","commenter_a":"That bitch & her sleazy family need to STFU","post_message":"Palin should leave President Obama and his family alone."},{"comment_id":"10153644679730927","commenter_b":"Of course, if you are a dissenter, you will be eating in prison. If it's so great in Cuba, why do we still have Cuban refugees fleeing to the US? Could it possibly be due to the oppressive Marxist-Leninist Castro regime? Leftist fools admire their heroes, communist revolutionaries Fidel Castro and Che Guevara. Patterson should stick to writing novels.","commenter_a":"So go live there James......it's called socialism, or communism. New cars are 1958 chevies, and you forget the rationing lines weekly for food? Plane flights now available for you James, and don't let the door hit you in the a$$.","post_message":"WATCH--\"I think in this country we should at least take care of the basics. So we doing a bad job in that area. Really bad ...\""},{"comment_id":"10153696423508717","commenter_b":"And are spelled out for me in MY bible","commenter_a":"Hi! I'm an ignorant Facebook commenter. I disagree with/HATE anything that makes me uncomfortable and refuse to believe studies that are in contradiction of my beliefs. Only studies that agree with me are real. God bless!","post_message":"A new study in the Journal of Developmental and Behavioral Pediatrics finds that the kids really are alright."}]
