[{"comment_id":"10153906452296409","commenter_b":"Hahahah This is all she has. Anger lies and name calling. She would make a horrible leader. Sorry it wasn't a poll. This is the article. Trump lies more than Hillary. So what. He still will not be the next President I can't wait for you to make America Great/Safe again!! These attacks have to stop taking the lives of innocent Americans. We need a Leader that will call the enemy by name! Trump2016!!! Is there an actual plan as to where all this extra revenue will go towards? Will our personal taxes and property taxes go down? I am a deplorable TRUMPAZEE and love every moment of it. ANOTHER NO pic, NO history and NO friends TROLL - F/B is being flooded with these locally and from FOREIGN countries And why would he? He has made it this far and hasn't released them yet? It's an unnecessary risk to ...","commenter_a":"Are they crazy? Trump has had same platform and mantra since day 1. Hes not the one who bleached his servers and beat them with a hammer AFTER being subpoenaed. That was hillary","post_message":""},{"comment_id":"876831439029591","commenter_b":"She needs to be fired because she should have done her job and not entertained the situation. She should have ignored the customer and sat her butt down.","commenter_a":"She needs to be fired.","post_message":"A woman caught on camera head-butting another woman at a Walmart says she has no regrets. The fight took place after the woman says she received poor customer service from a tax preparer: @webpagelink"},{"comment_id":"10154476827456636","commenter_b":"@username the most powerful twat in the world more like.","commenter_a":"Whether Trump comes, makes a speech in parliament, or visits the queen, is irrelevant, it was the speed with which he was invited by May, that smacks of embarrassing desperation to me.","post_message":"More as we get it"},{"comment_id":"1693302644277794","commenter_b":"Great news. She does anything to get publicity","commenter_a":"Good the left wing nut.How does this broad even have a job?","post_message":"Melissa Harris-Perry is refusing to host her show this Saturday due to weeks of pre-emptions that she says has left her \"silenced.\""},{"comment_id":"10154280732936336","commenter_b":"Agree100%","commenter_a":"How is this discriminatory? Use the bathroom according to your plumbing not your frame of mind. What about the civil rights of those who don't want to share the restroom with those of another gender? If a transgender earns money they pay taxes according to their earning not what they think they should pay. I'm really tired of a few people re-writing the moral and cultural standards for the nation.","post_message":"\"I’ll make a decision in 24 hours.\""},{"comment_id":"10152984965615950","commenter_b":"@username what a BITCH","commenter_a":"Cute. But this is not the 1st time they put the glasses on the baby.","post_message":"WATCH: Adorable viral video shows a baby seeing clearly for the first time, and it teaches an important lesson for parents: it's never too soon to check your child's eyesight @webpagelink"},{"comment_id":"948144815307058","commenter_b":"@username I appreciate that... However even though the question was asked by one person and he answered her directly .. He did that in front of an audience... As a parent I get what he's trying to say... But as a woman it makes me angry .. The boys that are being raised need to be taught that when a girl is too drunk to give consent it can be considered rape - I say can because not every girl that has drunk sex is going to consider it rape - but some may - plus it's incredibly unrealistic to tell a college girl to stay away from a party with alcohol... U may as well send her to a convent ..","commenter_a":"This advice isn't blaming the victim. Advising someone to lock their doors at night is not preemptively blaming the home owner for a robbery. Should we live in a world where girls can go to drunken college parties and not worry about being sexually assaulted or raped? Absolutely. Is that the world we live in? No.","post_message":"John Kasich to student concerned about sexual violence: \"Don’t go to parties where there’s a lot of alcohol.\""}]
