[{"comment_id":"10156746539145354","commenter_b":"Is she a horse of a different color? By looking in her mouth I would say this nag is pretty old herself.","commenter_a":"Wow! Maybe someone should check if she's a card carrying nazi. Hey Emma holocaust much?","post_message":"\"Either you wait for them all to die, or kill them off slowly.\""},{"comment_id":"10153722269186680","commenter_b":"Helene....her supporters have jobs....what planet do you live on ???","commenter_a":"Trump draws crowds of 15k, while Hillary can't draw 100 people to come to her rallies, yet the polls say that Hillary is ahead....something smells foul.","post_message":"The independent says he'll continue to find ways to support Hillary Clinton and defeat Donald J. Trump."},{"comment_id":"1719470721658124","commenter_b":"There illegals Zachary King..... there scared to death.....","commenter_a":"#Trump2016 TRUMP TRAIN","post_message":"Donald J. Trump has revealed how he would make Mexico pay for the wall. @webpagelink"},{"comment_id":"692872167570028","commenter_b":"It's NOT A WOMAN!!","commenter_a":"Moron nuts ops HeShe got balls . Sick , sick , sick . Woman of the year ? Bull crap ,disgusting , insulting to all women in the world . Hmmmmm maybe he should be castrated then but he will still be the same , a mangoman hehehe .","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"913575248773260","commenter_b":"Hillery is a known lesbian predator get it out and end her run to destroy this nation","commenter_a":"God i feel sorry for her","post_message":"Sex slave survivor Cathy Obrien swears that Hillary Clinton raped her when she was a child in Arkansas @webpagelink"},{"comment_id":"1505750879440568","commenter_b":"@username...you\"re a stupid girl.","commenter_a":"I really feel like if the voting system was trustworthy Trump would win. His crowds are just insane and people are so enthusiastic about him. However, I don't trust the system and I'm scared to death that she will win because it will be rigged. I am literally terrified of the possibility that she could be our president. I have legit anxiety about it.","post_message":"The election was supposed to be over months ago. But certainly this week it was not supposed to be in question. Hillary should have been... They're already planning inaugural balls and all the other trappings that go with victory. This is not where they wanted to be, and with the possibility Trump could win, they are in abject panic. And it's being demonstrated on TV."},{"comment_id":"10153330396398812","commenter_b":"I was just about to say- and watch all the females flock to this rich young single male Hahaha","commenter_a":"@username i actually think I'm in love","post_message":"This CEO says executive pay is \"out of whack.\" So, he's going to start earning $70,000, like many of his employees: @webpagelink"}]
