[{"comment_id":"1536859509948075","commenter_b":"I don't want your butt in my face! Haha","commenter_a":"@username think we could do this?! Haha","post_message":"That feeling when you've made it to Friday... via JukinVideo"},{"comment_id":"10154071992886770","commenter_b":"Clinton, Bushes, Obama took away citizen's rights. They betrayed our nation. The USA was hated while they were in office. We are better off turning our backs on these traitors and marching forward in the right direction.","commenter_a":"Thank you, you have more class than some of the others.","post_message":"Both Bushes, Jimmy Carter and Bill Clinton all attended Barack Obama's inauguration in 2009."},{"comment_id":"981667418562042","commenter_b":"CNN commies hiding the truth and denighing the facts.","commenter_a":"Lemon is such a a a I can't find an insulting enough word. Help!","post_message":"VIDEO: CNN Instantly Ends Segment When Pro-Trump Latina Says This About Donald @webpagelink"},{"comment_id":"10152735674121051","commenter_b":"This is a shame so many good women cant have kids but trash like this has them!","commenter_a":"ALABAMA...what else is there to say..........","post_message":"One look at this baby’s blood test and officials immediately ordered that the mom be arrested."},{"comment_id":"10153871154220329","commenter_b":"SHE is a WOMAN.","commenter_a":"No man can bear children. She's a woman, fact.","post_message":"\"One came from daddy's tummy and one came from mummy's tummy.\" (via BuzzFeed Trending)"},{"comment_id":"10155175542819369","commenter_b":"If she took this Job she knew what her role would require, and now she has changed her mind. Time for her to seek new employment plain and simple.","commenter_a":"I dont think any of u trump idiots would take a bullet for him ?if u do well LOL !!","post_message":"The special agent in charge of the Secret Service Denver district is under investigation for suggesting she wouldn take a bullet for President Trump."},{"comment_id":"1876818559213436","commenter_b":"If NFL can't support National Anthem, then we can't support NFL or anyone else that can't support the Anthem.","commenter_a":"Back to Africa with him!","post_message":"NFL National Anthem Protests Sink TV Ratings To Five-Year Low Week Six!!! They had the chance to make things better but are allowing thugs to dictate their business.... KEEP BOYCOTTING!!! MAKE THEM PAY!"}]
