[{"comment_id":"383095042054511","commenter_b":"@username who the fuck needs a third world country when animal whore leaches like u and your mom keep my taxes well spent in my own country. Keep up all the hard work in defending the fucking animals in the post and I'll set aside a little part of everyone of my days providing good reading pleasure for all of the rest of us the know a money grubbing whore when we see one. And u would definitely make a great whore make no mistake. Just like your mom was.... Now go out and b the best whore u can b and quit falling back on my taxes to earn a cocksucking living. Thanks","commenter_a":"Limit welfare to 3 yrs unless disabled. ,quit paying for children to be born with taxpayets money. If you have achild and cant pay uour hospitol bill keep thier tax returns n apply them untill bill is paid off","post_message":"This mother of 12 lives entirely off government benefits. She also funds her plastic surgery with taxpayer money. She makes more per year than most people earn at work annually.  A petition has been created demanding that she get her benefits revoked. Do you support revoking her benefits?"},{"comment_id":"10153524858391130","commenter_b":"I think the border should be closed to everyone until there is no violence in the USA! Or at least get it under control! There's gangs, rapist and terrorist roaming the streets! People under the fly alert were able to purchase guns yet half of American's aren't aloud to! Smh This government needs an overhaul, the system needs an overhaul!! People are homeless, going hungry and much more yet we still allow people in and they get free food, clothing and housing? Come on now!! This is suppose to be a place for dream's & opportunity!! USA has lost everything it built!!","commenter_a":"how is being again Islam racist ? it's a religion not a bloody race,,ban all organised religion,, there all fucking nutters","post_message":"Trump wants a \"total and complete shutdown of Muslims entering the United States.\""},{"comment_id":"1069058776465409","commenter_b":"You an illegal alien?","commenter_a":"You can't uphold your weenie Trump","post_message":"I'll appoint judges who will uphold the Constitution of the United States."},{"comment_id":"10154833870921336","commenter_b":"The pussy you are referring to is a family who call themselves Lisa, nice safety pin by the way, do they make them in mens?","commenter_a":"If Trump states that 'Nothing will Change', then he should stop being such a pussy and stop belly-aching about the recount. He's a complete WIMP.","post_message":"Reince Priebus slammed Dr. Jill Stein's presidential election recount effort, which was recently joined by Hillary Clinton's campaign."},{"comment_id":"10153706538451680","commenter_b":"Shut the F' Up","commenter_a":"I think it's great that Ghoul-iani and Drumpf both have direct lines of communication open to Russian intelligence, even more so than the CIA or FBI! That will make it easier for them to set up quick and easy direct deposit accounts to collect their paychecks from Putin.","post_message":"By casting the hack as a \"national security issue,\" Giuliani said, Clinton's campaign and Democrats have \"proved ... she's a liar.\""},{"comment_id":"10154422434652490","commenter_b":"All \"journalists\"","commenter_a":"Military Times journalists are all DEMOCRATS. They lean left. I stopped subscribing to their rag years ago- I got nauseous every time I read it. Here's to hoping they file for bankruptcy during the Trump administration.","post_message":""},{"comment_id":"673468959486383","commenter_b":"Can't run from jail...better hope Obama pardons her","commenter_a":"I do not think she will run in 2020, nor will the DNC even consider her after the whooping they took, she is too toxic.","post_message":"Trump-Clinton rematch for 2020?"}]
