[{"comment_id":"1606127946356954","commenter_b":"Plus did you see any of his hand movements it was crap","commenter_a":"Can you believe what he said in his tape tries to put it on Bill Clinton and Hillary he's such an ass","post_message":"Anyone even THINKING of voting for Trump needs to see this shocking video. Video by Occupy Democrats, LIKE our page for more."},{"comment_id":"10152775426692217","commenter_b":"The US has millions of illegal Mexicans to care for, sorry we're full.","commenter_a":"Am sure Canada and USA will come forward and agree to accept these poor immigrants. These countries unlike our crowded little island have plenty of space to accommodate these poor souls, tho having said that Scotland is pretty sparse.","post_message":"Video shows the moment migrants are rescued from a boat in the Mediterranean @webpagelink"},{"comment_id":"10153310258470090","commenter_b":"www.thefightforjustice.com Former bank employee goes head to head in the courtroom against bank and lawfirm-10 years and counting- Many exposed and the list is growing!","commenter_a":"Hideously profane y","post_message":"All of the above. We want to know WHY you don't want another Clinton in the White House. Tell us here: @webpagelink"},{"comment_id":"931007510269923","commenter_b":"You Don't Hit a Woman,You Turn and Walk Away !!","commenter_a":"Will someone please beat this woman beater up and take away his nfl career.","post_message":"Florida State University quarterback De’Andre Johnson is charged with misdemeanor battery."},{"comment_id":"714279835348897","commenter_b":"More trigger happy pigs.","commenter_a":"Better to be tried by twelve than carried by six. Today's cops are not the cool headed officers of old. They are post 911 trigger happy thugs who think Johny Jihad is around ever corner. DO NOT CALL KEYSTONE COPS until the threat is gone or dead and your guns are put away.","post_message":"A Huntsville woman seemed to have been perfectly justified in firing upon a violent ex who walked through a restraining order. Whether she was a threat when she turned towards responding officers with the shotgun still in her hands is under investigation."},{"comment_id":"10156718983275206","commenter_b":"@username's campaign is not particularly offensive to women neither is her platform desirable for America. Gender is a prominent component of her campaign. There is nothing even suggesting leadership ability; but everything suggesting bias and intractable partisanship.","commenter_a":"love your definition of feminism Carly, so true","post_message":"I know I’m not the liberal Left’s fantasy candidate. But a feminist is a woman who lives the life she chooses for herself—not the life that The View, or Hillary Clinton, or Planned Parenthood orders her to live. I told that to the women of The View last time I was there. It remains true today."},{"comment_id":"10150832975979963","commenter_b":"Something tells me that the Bulletin of Atomic Scientists probably knows more about \"international nuclear weapons relations\" than you do.","commenter_a":"Anyone who thinks that this is \"Trumps fault\" doesn't know much about international nuclear weapons relations and the money exchange that goes with it, be it legal or not. Trump wasn't president then....","post_message":"According to the Doomsday Clock there's an increasing probability that the world will observe nuclear conflict."}]
