[{"comment_id":"10154364606704445","commenter_b":"Guns didn't kill these poor girls their mother murdered them!!! That was her intent!","commenter_a":"Glad she was able to protect....oops, kill her family with her guns. Just another \"legal good gurl\" gun owner turned murderer after her latest hissy fit.","post_message":"Two sisters shot and killed by their mother in Texas are being remembered by friends and neighbors."},{"comment_id":"10153873551727550","commenter_b":"Scores girls accept nothing less!","commenter_a":"As long as liquor stores, bartenders, strippers and cigar shops accept them who cares who is on the twenty dollar bill?","post_message":"ABC News has confirmed through a Treasury spokesman that Harriet Tubman will replace Andrew Jackson as the face of the $20 bill.  Full Story --> @webpagelink"},{"comment_id":"10154054920697093","commenter_b":"Just let this crazy lady live in her imaginary world.","commenter_a":"I feel the closet racists gathering on this post.","post_message":"Small protest happening now at the old Tarrant County Courthouse in response to the Fort Worth viral video arrest. bit.ly/2hYduuA"},{"comment_id":"10152892453289342","commenter_b":"Texans have had a better record than the cowgirls since they became a team up until the last 2 yrs.","commenter_a":"Come over to a winning team THE DALLAS COWBOYS!!!","post_message":"The greatest offensive player to ever wear a Texans uniform will play somewhere else next season.  The team has reportedly freed Andre Johnson up to pursue other options"},{"comment_id":"10152862835371336","commenter_b":"The ft hood shooter was an American serviceman","commenter_a":"What about Benghazi and Ft. Hood?","post_message":"\"This is an act of violence, an act of terrorism that we condemn in the strongest possible terms, and we are going to stand shoulder to shoulder with our allies in France.\" – White House Press Secretary Josh Earnest on America's Newsroom moments ago"},{"comment_id":"1164591366914667","commenter_b":"Texas, enough said.","commenter_a":"Try to keep your vagina in your pants \"Ladies\"","post_message":"The closing of safe, clean clinics across the state has brought the back alley abortion back to Texas."},{"comment_id":"10150935121129999","commenter_b":"She did say that but she said it was because of the mother's health.","commenter_a":"As an avid hater of Trump, it's hard to read this because I am so tired of Trump supports blaming all bad press about Trump on the \"liberal media\" but this is supposed to be a fact checking exercise and it is just so obviously biased and sarcastic and the tone does not come off as objective at all. It would be nice to see something written that fuels the \"evil media\" fire a little less.","post_message":"We're fact-checking the presidential debate with Hillary Clinton and Donald J. Trump: @webpagelink"}]
