[{"comment_id":"10153126119146770","commenter_b":"You aint no Woman Be otch","commenter_a":"What a joke, your no hero you did this by choice!","post_message":"Protesters hurled insults at Caitlyn Jenner as he left a Chicago hotel yesterday."},{"comment_id":"10154042620823717","commenter_b":"Go away and take your predator husband with you.","commenter_a":"UPDATE: Hillary Clinton has expressed regret for calling 'half' of Donald J. Trump supporters 'deplorables.' \"Last night I was 'grossly generalistic,' and that's never a good idea. I regret saying 'half' -- that was wrong.\" @webpagelink","post_message":"UPDATE: Hillary Clinton has expressed regret for calling 'half' of Trump supporters 'deplorables.' \"Last night I was 'grossly generalistic,' and that's never a good idea. I regret saying 'half' -- that was wrong.\" @webpagelink --- Donald J. Trump and Republicans quickly pounced on the remarks, which drew comparisons to President Obama's comments about clinging to \"guns and religion\" at a 2008 campaign fundraiser and Mitt Romney's \"47 percent\" remark in 2012. @webpagelink"},{"comment_id":"10153167764854714","commenter_b":"Well,please make sure neither of you go out in a bikini then.","commenter_a":"Empowering her to be a porn star. Tacky tacky tacky","post_message":"Model Hannah Davis says her Sports Illustrated Swimsuit Issue cover is “empowering.” What do you think? @webpagelink"},{"comment_id":"10152902121277098","commenter_b":"Do you know any white girls from the sticks? Smh!","commenter_a":"White girls from the sticks are certainly the most psychotic!","post_message":""},{"comment_id":"1693365440922113","commenter_b":"We need to take back our country from these liberal Morons! How dare they: your rights STOP where ours begin!","commenter_a":"Funded by MUSLIM BROTHERHOOD to divide & conquer!","post_message":"Black Lives Matter supporters spat and stood on the American flag outside a Donald J. Trump rally Sunday."},{"comment_id":"487132828135264","commenter_b":"What? the lying lame are going to teach other people to be perverts? Really","commenter_a":"OMG!","post_message":"Goooooood Moooooorrning!!"},{"comment_id":"10153723426423487","commenter_b":"What the fuck ever. My answer is clear, even if backwards. Bikes should follow the rules, however it is phrased.....jackass.","commenter_a":"Of course they should follow the traffic laws. A bike has been my main mode of transportation for most of my 61 years. We cyclists demand drivers follow every rule and yet many of my fellow cyclists think the rules do not apply to them. They risk their lives, cause wrecks, etc. with careless behavior.","post_message":"What's safest for cyclists and pedestrians? (CityLab)"}]
