[{"comment_id":"10153476732498132","commenter_b":"She can't sing or act....","commenter_a":"She's still hotter than Kim Kardshian and she has talent.","post_message":"She must be a magician with double-sided tape. #MetGala"},{"comment_id":"10154583346243855","commenter_b":"Governor Brown will be on the right side of history!","commenter_a":"Big talk now. Let's see how mouthy he is when President Trump and the Congress cut off funds to states who harbor illegal aliens and otherwise defy federal laws. Can't wait to see CA in an even worse budget squeeze. Talk is cheap when others are paying your bills.","post_message":"Thank you, Jerry Brown! Read the full text of the California governor's anti-Trump State of the State address: @webpagelink"},{"comment_id":"1437658776254148","commenter_b":"Go home burn your drunk","commenter_a":"Think its time we start saving the tax payers money and get all these corrupt career politicians out of office! These hearing are a waste of money when the system is rigged for them when they pick people like Lynch! She was picked solely on how she could withstand what she went through! Trump is real change! America needs these corrupt politician gone!","post_message":"\"Together we have begun a political revolution to transform America and that revolution continues,\" Sanders said in his endorsement of Clinton."},{"comment_id":"1811602825768086","commenter_b":"@username they voted for TRUMP because Hillary is lying criminal that should be locked up","commenter_a":"not surprising.... the KKK IS a dem organization so it makes perfect sense that they would be able to get the uniforms.","post_message":""},{"comment_id":"10154995598416037","commenter_b":"Robert, have you heard of sanctuary cities? Do you know why thy are called that? If you are illegally here this is where you go. Now how many illegals do you think are in California? Hello","commenter_a":"Good luck to him. Would be nice to see Democrats lose those 55 electoral votes every election. Half the people there aren't even American anyways.","post_message":"“We believe the country is like a Titanic, and the election of Donald J. Trump is the equivalent of the Titanic hitting the iceberg.”"},{"comment_id":"901335433248814","commenter_b":"It's time for YOU to answer AMERICA about BENGHAZI !! The four AMERICANS that lost their lives are on your clock and hands !!! It's time for YOU to answer AMERICA !! WHERE YOUR MILLIONS CAME FROM !! IT IS TIME FOR YOU TO TELL THE TRUTH ABOUT YOUR EMAIL CRIMES !! IT IS TIME FOR YOU TO ALLOW THIS COUNTRY TO BE MORAL AGAIN !!!","commenter_a":"If you are against he NRA, then you are for gun confiscation.","post_message":"“This has gone on too long and its time the entire country stand up against the NRA.”"},{"comment_id":"10157268817905551","commenter_b":"not NO more BITCH!!! your goin DOWN!!!","commenter_a":"Take him out and watch what happens especially when his refugees and rioters, illegals dont get paid","post_message":"Emails Prove that the Real Leader of the Democrat Party is George Soros"}]
