[{"comment_id":"529104973953410","commenter_b":"She's a scummy fat chick!","commenter_a":"MS. PIGGY.","post_message":"We can do this America. ...If we just unite, we can make this happen."},{"comment_id":"10154013196294411","commenter_b":"Oh with hijab!absolutely she cover herself from you rapist pornographers.","commenter_a":"Americans should be blessed with islam for taking them to the right path","post_message":"They have always seen Iraq as a threat because it has the great potential to be a great regional independent power in its own right. (Op-Edge by Dan Glazebrook)"},{"comment_id":"10155553244070354","commenter_b":"Sit your dumb racist ass down and shutup AL shapton and pay the taxes you owe","commenter_a":"Wake up people! States better start secession proceedings. The 10th Amendment: \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\"","post_message":"First he fought the right, then he fought the cops, now Al Sharpton announces his plan to fight his toughest opponent yet: ....The U.S. Constitution."},{"comment_id":"1882169925350064","commenter_b":"she needs 2 take a step back! She also needs 2 learn 2 RESPECT OTHER PEOPLE,S OPINIONS! If she doesn't like it here...LEAVE!","commenter_a":"Get rid of her. She's a real Bitch. Jeanie","post_message":"Whoopi Goldberg just crossed the line when she said this about Trump's children. She just got taught a lesson she'll never forget. Should Whoopi be kicked off the air?"},{"comment_id":"930466986973481","commenter_b":"I believe that the Goverment ( teachers ) should mind their own and stay out of our lives and work on being a better teacher ! It's up to the parent to decide when it is appropriate time to educate the child . Teaching a child inappropriate touching is about the limit that the school should be doing . Nothing else !","commenter_a":"Just be open and honest with your kids about sex. Answer questions, create an environment that allows for discussion and be open minded when they tell you what they think. It's not a bad subject. It's part of life.","post_message":"Would you call this educational plan \"age-inappropriate\"?"},{"comment_id":"10154419778931077","commenter_b":"I'm a female and even I like your thinking! Lol","commenter_a":"My god people would rather be trapped in the house with in laws all day!?! Got to have some place to go to get away! As long as some places are open then we can all go to the bar and strip club and still be able to make the wives believe we were at Walmart the whole time and couldn't buy anything because it was all sold out. :)","post_message":"Do you think stores should be closed on Thanksgiving?"},{"comment_id":"495141487277558","commenter_b":"And you do? Cause your so fucken righteous and enlightened?? Get the fuck out of here it's called war we didn't start it but we damn sure finished it fuck them! They killed our people, we killed theirs.","commenter_a":"So your all saying they blew up a few ships of ours and that justifies nuking a whole city your all a bunch of in breed morons that lack logic and intelligence and have no awareness of the real world around you","post_message":"Since the bombs were dropped, the U.S. government, U.S. high school history texts, and the American public have asserted that dropping the bombs was necessary. But is that really the case?"}]
