[{"comment_id":"10156312558675354","commenter_b":"What a self serving heartless bitch.","commenter_a":"She is a good for NOTHING LIER ,GET RID OF HER FOREVER !!!!","post_message":"PARTY TIME!!!"},{"comment_id":"472965199559859","commenter_b":"I'd be packing my bags headed for Ecuador.","commenter_a":"If hell freezes over and Trump actually wins the White House, I forecast that the USA will see the largest mass exodus of the intelligentsia class of citizens in the history of our country. Those people capable of using 3-4 syllable words including researchers, doctors, teachers, scientists, and engineers will not be able to stomach the idea of a golden haired baboon driving the nail into the coffin that was once the United States of America. May God have mercy on us.","post_message":"Donald J. Trump: \"Happy #CincoDeMayo...I love Hispanics!\""},{"comment_id":"10153699640168984","commenter_b":"Trump2016, Deported his ass and then let him back in,Just like he said he can do with the good illegals, but if they are bad then he will leave them on the other side of the wall.lol","commenter_a":"the most entertaining candidate I have ever seen :)","post_message":"This Univision host thought he could battle it out with Trump, but he failed BIG time. Do you think Donald Trump made the right move?"},{"comment_id":"1125682197501441","commenter_b":"I hope so, I heard today we have the most immigrants in the USA!!! I'm furious!!!","commenter_a":"I'm not happy with Michigan!!!!","post_message":"Team Hillary is full freak out mode...needs massive knockout punch in tonight's Debate of the Century to stop Trump momentum..."},{"comment_id":"10153128866595329","commenter_b":"Feminists brats don't want to objectified by men, but flock to articles like these. Hello, double standard. You ladies should be ashamed.","commenter_a":"Thank you!!!!","post_message":""},{"comment_id":"10153238053014586","commenter_b":"plants are living things too... so eat sand... all human should eat sand.","commenter_a":"literally feel sick watching this how can people still let this happen? disgusting","post_message":"Can you imagine having that huge metal tube shoved down your throat?! This is just 60 seconds of how #FoieGras ducks spend THEIR ENTIRE LIVES. They sound so terrified. :("},{"comment_id":"1594885237238266","commenter_b":"These dumbasses ran into them in Tampa in Ybor thank God for The Thin Blue Line or those protesters would have had one hell of an ugly day in their life","commenter_a":"Just shows what they are made of! Nothing these crybabies should be kissing the cops asses for saving them lol","post_message":"What happens when whiny anti-Trump protesters interrupt The Few, The Proud, The Marines?"}]
