[{"comment_id":"10153024604841037","commenter_b":"Black people should pay more TAX","commenter_a":"Poor Bill, women coming from everywhere trying to get a payout. I believe you Bill.","post_message":"A model who claims #BillCosby assaulted her at the Playboy Mansion met to pursue criminal charges"},{"comment_id":"10150715134694999","commenter_b":"'@username Illegal immigrants steal roughly 9 billion dollars worth of resources reserved for American citizens every year. Deporting them per our existing laws will save us a ton of money...any more brain busters?","commenter_a":"What's even more appalling is that he's polling at 39% of Republican + Republican-leaning registered voters in the latest CNN poll. ...What does this say about our country and how folks want our supposed leaders to behave? What is this acceptance of ongoing crass commentary? ...And what happened to equanimity and professionalism?","post_message":"Donald J. Trump called Hillary Clinton's mid-debate bathroom break 'disgusting.' Frank Bruni says it's 'the rare man-child who finds that worthy of ridicule.'  Read on in The New York Times Opinion Section."},{"comment_id":"455232604658620","commenter_b":"Hillary Clinton!!!","commenter_a":"Bernie Sanders!!!","post_message":"Listening is always better."},{"comment_id":"1145540435508072","commenter_b":"No job , 6 kids , no husband . Stop !","commenter_a":"Waited in line for six hours if you would've been working kids would've ate","post_message":"Entitlement Mentality: Welfare Recipients React to Food Stamps Being Cancelled.  This shows everything wrong with the entitlement mentality."},{"comment_id":"1615282505444662","commenter_b":"'@username, I get that. I don't think that that's any more serious than foreign interests pouring money into a specific candidates election fund or even the main stream running a biased smear campaign to try and get 'their candidate' elected. It all needs to be stopped.","commenter_a":"So the Russians hacked the Dems servers and released their emails. So what. What does that have to do with Trump? The main stream media was trying its hardest to influence the election for Hillary. Had she won, would people be calling for an investigation of that?","post_message":"So: Shep Smith just called out Donald Trump's lies about Russian election interference on Fox News. 'It was brought up before the election. Over and over and over again.'"},{"comment_id":"1755557531334252","commenter_b":"I love how the racist cunt doesn't realize Africa isn't a country lol","commenter_a":"Good. GTFOut. Go to Africa where it's guaranteed you'll have a black president. This half white didn't work out so well.Alec baldwin made the same statement. Liberals whine and cry when they don't get their way. About time to unleash that Trump ttain.","post_message":"'The View' host Raven Symone says she's leaving America if a Republican becomes president. Will you miss her?"},{"comment_id":"10154377596014411","commenter_b":"Does anyone realize what is happening? History is repeating itself and no one is taking notice. The Middle East is on fire. Obama and Hillary started this with Libya, they had no business getting involved. Now we have a flood of Muslims who hate American and our culture. They do not want to be equal, they want to dominate and change America and the West to a Muslim country. This is a fact, Turkish President is building mosques all over the West and no one is paying attention. In Turkey they are burning down churches, killing and raping Christians. It's a genocide but Obama only brings in Muslims no Christians. Americans are being told, to take down crosses, take pork from American public schools, allow Muslims to have pray time in public schools, Our children are learning Islam is the faith to be. WAKE UP PEOPLE. They are moving in ...","commenter_a":"I dont think people are comprehending how much people are actually crossing over in europe. its not like in north america. Canada for example scrapes the cream of the crop at 10,000 vs half a million in germany alone. So its full of feel good stories. Whats left stays in europe and the people keep coming and summer has just started. We're talking about a city moving into the EU completely needing of support. At the rate of growth. They'll have a small country entering the EU (mostly unscreened). Europes economy is already weak. Germany has a strong economy, but they're carrying the bulk of the weight. Swedens already cracking under the weight of just one year. Not to mention the culture shock of a sudden mix of two completely different cultures. Hes not saying turn them away. Obviously care for them. But you cant have this number of them ...","post_message":"Dali Lama to Germany: You're doing it wrong"}]
