[{"comment_id":"1485309454835270","commenter_b":"Yes","commenter_a":"@username are these the leggings you were telling me about?","post_message":"Buyers beware: LuLaRoe is being sued for overcharging customers on sales tax. yhoo.it/2lEtUdq"},{"comment_id":"1081387115239718","commenter_b":"Ill stick with what my doctor reccommends","commenter_a":"so I should not take medicine and just live with acid reflex? I have been taking Nexium for many years.","post_message":"People who take certain popular medicines for heartburn, indigestion and acid reflux may want to proceed more cautiously."},{"comment_id":"1142853059119585","commenter_b":"So's my father. Personally, I served a three year tour in the US Army.","commenter_a":"No! George Bush was in the service. But no one knows how he got out.","post_message":"Don't you EVER forget this... nor let these Republican chicken-hawks send your children off to die in wars for profit."},{"comment_id":"955924071085730","commenter_b":"Jan St John...ROFLMAO!!!! James Taylor is a lawyer with no training in climatology ...he's a sr. Fellow at the heartland institute which draws major funding from the likes of the coke bros,exxon and a number of other oil&gas companies....this is the best you can come with","commenter_a":"It was 40 above in Alaska last week.","post_message":"TELL ALL YOUR FRIENDS"},{"comment_id":"1485464441513680","commenter_b":"ASICK woman needs to be jailed","commenter_a":"Hang them both!","post_message":"What kind of woman could do this to her own child?"},{"comment_id":"10153115054444091","commenter_b":"You are 100% right about Starbucks.","commenter_a":"I blame Dunkin' Donuts....if they had a drive thru, this wouldn't have happened. If he drove through a Starbucks, I would have bought him coffee!","post_message":"A 16-year-old who was practicing driving for his learner's permit with his mother, crashed into a Dunkin' Donuts in Glen Rock Sunday morning. MORE: @webpagelink"},{"comment_id":"524738424381756","commenter_b":"As i said before i will not debate with obama supporters. All they do is cry about being poor and then vote for people to make them worse instead of seeing a man whos going to build our country full of jobs. Then again many of Obama's supporters are on welfare anyway so theres no speaking to any of you. You are the problem","commenter_a":"This parent is teaching her kids so wrong. She needs to be having her to hold up a Trump/Pence sign for a better future for her and her child. No one wants to live under the reign of Obama anymore and we definitely don't want to have any parts of Hillary Clinton so she can continue the mess that he's made","post_message":"This 4-year-old was inconsolable when she found out Obama was leaving office  she wants four more years!  #MicBrights"}]
