[{"comment_id":"10154269648496509","commenter_b":"The Old Testament also says if a woman is on her period she needs to live in a hut.","commenter_a":"What kind of gun would jesus own?","post_message":"Las Vegas Assemblywoman Michele Fiore is drawing cheers and jeers for making firearms a family affair in this holiday card. @webpagelink"},{"comment_id":"779579485508565","commenter_b":"Mia King you are just making things worse. People of all races kill period! I could waste my time looking for articles of blacks killing whites but I'm not trying to keep the racist shit going.","commenter_a":"The TRIBAL ATTACK is alive and well. Took seven (7) FUCKING NEGRAHS to beat up one (1) homeless white man. Put these porch monkies one-on-one and they run like the cowards they are.","post_message":"Dear liberals and the #BlackLivesMatter movement, police and white people are not the problem. This is the problem...Sickening."},{"comment_id":"992176534225146","commenter_b":"Then pick that worthless POS Hillary.","commenter_a":"You can say trump is the lessor of 2 evils but if you think trump will be a good president you are a moron","post_message":"Here's what we've learned from undercover videos. Is this how our next President will do business? @webpagelink"},{"comment_id":"10155129809471929","commenter_b":"These two ladies. Need to step down they showing how they are. Active. With their mouth","commenter_a":"Crack kills","post_message":"Speechless folks..."},{"comment_id":"10158427550135093","commenter_b":"I watched a movie recently where this woman wanted to sing and thought she could sing. Because her husband was somewhat affluent she sang in get togethers and everyone fawned upon her and let her believe she could sing. Eventually her delusion became so bad that she wanted to pursue more public and aggressive venues for her singing. A doctor stepped at her husbands request, and decided to record her and play it back to her so she could be faced with the reality of her own voice. Alas, upon hearing it. . .she dropped dead.","commenter_a":"Ye are away with the fairies so ye are","post_message":"Over the line. Katherine Timpf sums it up as only she can."},{"comment_id":"953914171315722","commenter_b":"I do agree that woman look proactive in these yoga suits. I always wear a long shirt over mine. Why cant these young women use some common sense.","commenter_a":"I am not responsible for someone else's thoughts.","post_message":"This woman's response to the idea that women should dress in a way that prevents men from having lustful thoughts is both amazing and hilarious:"},{"comment_id":"1089512117777571","commenter_b":"YEP CLINTON RAN TO CANADA","commenter_a":"Blame Carter. If he hadn't pardoned Clinton for draft dodging we wouldn't be in this pickle.","post_message":"SHOCKING VIDEO: US Marine Booed, Removed From Clinton Rally For Asking Legitimate Question WATCH THIS! @webpagelink"}]
