[{"comment_id":"370852156623268","commenter_b":"It appears that She doesn\"t know how to do anything. Maybe she can pole dance or do hoing!!!!","commenter_a":"Guevona!","post_message":"She hasn't done anything..."},{"comment_id":"10155206212838984","commenter_b":"It could also be that the libertards Have No Taste! They don't know a Good Thing When They See It!","commenter_a":"For the life of me , I cannot understand the obsession all these small minded liberals have with the Trump family. Is it jealously ?? You can't possibly spend that much time dwelling on people you don't even know. Lots of people weren't happy with the Obama presidency or his crude wife, but they didn't spend every waking moment stalking them, writing fake news about them. At this point I have serious concerns that there is a mental health epidemic in this country as far too many people are consumed with hatred that has no true origin. Hopefully the pharmaceutical companies can keep up with the demand for medications that clearly need to be prescribed.","post_message":"Maybe now this reporter will think twice before attacking the first lady."},{"comment_id":"914542602012252","commenter_b":"Communist asses back to Europe? That's a pretty racist thing to say isn't it. That's like me telling you to take your racist american hating ass back to africa","commenter_a":"The black community should be ashamed of backing this criminal","post_message":"People are going to EXPLODE on Fox."},{"comment_id":"10154081202079205","commenter_b":"We now need the DNC to forever get rid of super-delegates. This should be an immediate mission, so this never happens again. Contact the DNC and demand we end the Super-Delegates! #DNC #NoMoreSuperDelegates #ListenToVoters #VotesMatter @webpagelink Mailing address: Democratic National Committee 430 South Capitol St. SE Washington, DC 20003 Main phone number: 202-863-8000","commenter_a":"Yes it was a circus , that's too bad , 15 rounds Trump TKO not a knockout","post_message":"What did the polling look like heading into the CNN New York Democratic Debate, did the polls impact #BernieSanders or #HillaryClinton performance in the debate?"},{"comment_id":"10152660058432452","commenter_b":"Why should your taxes pray double to kill her","commenter_a":"Forgive her. Two wrongs will never make a right...","post_message":"The execution of the first female in Georgia in 70 years was on hold as the U.S. Supreme Court reviewed last-minute arguments by her lawyers that they hoped would persuade the nation's top justices to grant a stay. abc7.la/1M2tBxU"},{"comment_id":"10150611422369999","commenter_b":"The south wants to keep it.....FLY IT HIGH SOUTHERNERS WHO ARE PROUD OF THEIR HERITAGE KEEPING STATE RIGHTS.","commenter_a":"It's a VA battle flag....why was SC flying it? oh yeah, State's rights were taken away...sad so many people think that war was over nothing but slavery...I'm a history major....would never fly it but I know what it's true purpose is...Those who had confederate soldiers die in their family still use it....KKK ruined it and so did this fool....","post_message":"Breaking News: Gov. Nikki Haley of South Carolina called for removal of a Confederate battle flag from the State Capitol grounds after the white man accused of killing 9 black people was seen brandishing that flag in widely circulated pictures. “It’s time to move the flag from the Capitol grounds,” the governor said."},{"comment_id":"958476177526574","commenter_b":"Good, I'm glad you agree I keep your inconsiderate ass home so that nobody has to see your nasty ass milk sacs. lol It's a shame people can be so in inside rate of others. Nobody asked you to have a child let alone breast feed let on too of that in PUBLIC! that's not cool. I just think others should be respectful of those around them instead just thinking about themselves which is what public breast feeders do...selfishly think about themselves and not the fact that they are disturbing everyone else. I do not want to be sitting somewhere and have someone's nasty ass breast out feeding a child nobody asked them to have. SORRY!","commenter_a":"I love Victoria's Secret and their model are gorgeous. All I will say is this: be considerate of others. Nobody wants to see someone's breasts all out...breast feeding or not. Idgaf what ones reasons for their breasts being exposed is, BE CONSIDERATE. You can pre pump your fucking milk. If that's the case than people should be able to walk around naked because it makes them comfortable and they mean no harm right?? lol oh...I thought so.","post_message":"With Saturday Night Live's 40th anniversary show starting soon, we thought it would be fitting to share one of our favorite moments from this show's important history. Check it out: #SNL40"}]
