[{"comment_id":"1588290287878104","commenter_b":"Russia is THE ENEMY because the DoD NEEDS to create a paper tiger to keep the world's most bloated military budget fat. Stay conned. Iran is also a made up enemy.","commenter_a":"We are with you President Obama, if you could have run it would have been a third majority vote and we wouldn't all be afraid of what is to come. Russia is our advisary not our friend, stupid people. Thank you for the eight years you have had to put up with the worst Congress in history.","post_message":"In addition, sanctions will be placed on Russia’s two leading intelligence services."},{"comment_id":"1693513877603730","commenter_b":"This is silly. People may not like him me included but who Someone decides to vote for should be there choice and not pushed on them. That's exactly what this would do. I supposed you also felt bad for the Emory students that cried about some chalk?","commenter_a":"Futile","post_message":"#VoteTrumpGetDumped is encouraging women to dump Donald J. Trump supporters because of the way he treats women."},{"comment_id":"10153910972008812","commenter_b":"it should be 25 to life","commenter_a":"He's gonna be getting plenty of footlongs where he's going lol","post_message":"JUST IN: Ex-Subway spokesman Jared Fogle sentenced to over 15 years in prison after pleading guilty to child pornography charges."},{"comment_id":"1267878706625395","commenter_b":"I'm pretty sure she wouldn't need your worthless vote anyway. Trash","commenter_a":"Can't wait til January 20th when your gone!! If you run for president in 2020 you won't get my vote! You put your nose into eating healthy school lunches thatgo into the trash everyday and restaurants.","post_message":"Happy Birthday to outgoing First Lady Michelle Obama!"},{"comment_id":"712854462154600","commenter_b":"Abe Foxman is a puppet and does NOT speak for most intelligent Jews!!","commenter_a":"We should HOUND their offices and call and support OREN","post_message":"“In the days leading up to the forthcoming release of a memoir of his experiences as Israel’s Ambassador to the US, Michael Oren appears to be using the very legitimate and sharp policy disagreements between Israel and the US as an insensitive and unjustified attack on the president,” Foxman said in a statement. “We hope that Ambassador Oren will walk back these unjustified attacks.\" -- ADADL - Anti-Defamation League Abe Foxman"},{"comment_id":"10153199958166051","commenter_b":"The bitch is lucky to be alive","commenter_a":"Why sue the apt for our own stupidity??? You don't block windows with any furniture you know in case of FIRES!!!! Geeze what a stupid smuck","post_message":"This woman fell out of bed, though an open window and three stories down to the hard ground below. Now she's suing."},{"comment_id":"722580014574620","commenter_b":"Illegals voted here for Obama...","commenter_a":"Proof of Citizenship or Naturalization of Citizenship is the only way you can vote in National elections. Try going to any other country and vote in their elections, YOU CAN NOT. Period end of report","post_message":"Will someone steal your vote when you cast your ballot on Election Day? Voter fraud can drastically influence the outcome of elections."}]
