[{"comment_id":"10154019054861509","commenter_b":"White Americans do not recognize anyone else","commenter_a":"American??? Wow, she is so ignorant. Many American citizens came here from other countries speaking another language. English, the American version, is what has been spoken here for many generations. However, we now have many citizens who speak Spanish, Russian, Mandarin, Vietnamese...We are a country of many. Let's stop the ignorance and the Palins of the world.","post_message":"Sarah Palin praised Jeb Bush on speaking Spanish, but said “let's speak American\" to unify the country: @webpagelink"},{"comment_id":"1614611835509066","commenter_b":"you're welcome u baster","commenter_a":"I'm going to the toilet and leaving my phone on charge, I expect loads of likes when I'm back. Thank you","post_message":"US President-elect Donald J. Trump will soon be accompanied at all times by a military aide carrying the nuclear \"football,\" enabling him to order a nuclear strike at a moment's notice."},{"comment_id":"10153190438888812","commenter_b":"Plus many red states consider sand and salt a slippery slope toward Socialism.","commenter_a":"All the Yankees talking about \"that isn't snow!\" Must not realize how right they are. It's ice. It's infinitely more dangerous and icy in the south than it ever gets in the north.","post_message":"WATCH: \"It's over\" -- Snow and ice are still triggering dangerous, cringeworthy conditions on roads in much of the eastern US, including this Huntsville, Alabama, neighborhood - ABC News Weather"},{"comment_id":"1415185618534424","commenter_b":"@username Spaniards have been in this country for a very long time and that will never change. It is very raciest of you to assume only Hispanics are illegal and most legal Hispanics would like illegals deported. We have immigration laws in this country and they will be enforced .You are nothing but a hateful bigot. Eva's country doesn't deal with an illegal immigration problem because they strictly enforce their immigration laws; as soon as Canada takes in 10 million illegals Eva can have an opinion on this matter.","commenter_a":"Trump stirred it up with all his comments during the campaign. He brought out the worst in people. And because he was so verbal againgst race...religions...women...all the racist bigots who kept semi silent for a while have come outta of the woodwork and guess who led the way. And to think he is now going to be the leader of your country.","post_message":"Chili's provides veterans a free meal every Veterans Day, so US Army veteran Ernest Walker went to his local Chili's for a burger. Instead, he was denied a meal after an altercation over his service record. @webpagelink"},{"comment_id":"10153572716786337","commenter_b":"Well he went to my homeland n cause a problem...we don't bother NOBODY but Americans always causing trouble for us....If he dont go to jail..Maybe a African curse will do the tricks...n if the table was turn y'all would want justice","commenter_a":"Uh, no shit he won't go to jail. He didn't break any laws in America what so ever. While I disagree with what he did, it was done in another country outside of our laws.","post_message":"#CecilTheLion is dead. Walter Palmer probably won't go to jail. Here's what we can do to prevent situations like this..."},{"comment_id":"975168282518593","commenter_b":"Better be sure. Our us h hospital are not allowing this.....What. If. Patient wants non Islamic nurse. Because is this practice?","commenter_a":"STOP with the offending of muslims.....this is the United States of America...land of the free.... Who gives a crap if your offended....","post_message":"Whoa!"},{"comment_id":"10157699168860294","commenter_b":"If you think he can do that with all the times she's been investigated over the last several years you're sadly mistaken.","commenter_a":"Trump is not for social society so I can't be for him","post_message":"“If I win, I am going to instruct my attorney general to get a special prosecutor to look into your situation because there has never been so many lies, so much deception.”"}]
