[{"comment_id":"10153992040756336","commenter_b":"This is a must read. I copied it from a post. These are things you need to know about Islam and Muslims. Allah IS NOT the same God who is worshiped by Jews and Christians. Allah is no more a God than the Golden calf of Egypt. Allah predates Islam by over a thousand years, and was a minor deity in the Temple of Baal, the Canaanite Sun God, who was worshiped throughout the Middle East. Baal (ba'al) was an ancient Canaanite and Mesopotamian deity associated with agriculture. He was believed to be the \"giver of life\" and mankind was dependent upon him for providing what was necessary to sustain the farms, flocks and herds. Allah was the moon god who's sign was the crescent moon. Mohammad, born 570 years after the Birth of Christ, was very familiar with Judaism and Christianity and stole traditions from both religions to create ...","commenter_a":"Why does Christianity need protecting? It is the dominate religion and is afforded special privileges. Christians are just upset that they don't have the right anymore to force their beliefs on others.","post_message":"Donald J. Trump spoke about protecting Christianity during a speech at Liberty University today. @webpagelink"},{"comment_id":"10153000609386491","commenter_b":"The Russian lady nailed it. For me, I don't want kids and that is unacceptable to so many people. She only wanted one and that was JUST AS UNACCEPTABLE! We know what we want our families to look like. Trust us, we're women!","commenter_a":"I respect your decision to not have kids. Some people don't. It's an important job that should only be done by people who want you. BUT, I think making a decision like that at 28 years old was a little rash. A lot of things change. I had my daughter when I was 39 years old. Things that make you happy in your 20's are not necessarily going to be the same for the rest of your life. And, don't be sad for people who tell you that there is no greater love than one for a child. There isn't!! Don't knock it just because you don't understand.","post_message":"“What I want is to be happy.”"},{"comment_id":"10154776330225831","commenter_b":"@john, Lets talk abt the difference please.....Lets talk abt the American Citizens who took a gay man, James Byrd Jr.....beat him...tied behind a truck, and then dragged him for miles until some of his body parts started ripping off of him....when they finally stopped to toss his body over a cliff....all that was left was his torso....all done by Americans.....Legal US Citizens, in 1998..... Or better yet......the Oklahoma bombings, in 1995, who was carried out by Timmothy McVeigh.....let me reminded you how this Legal American Citizen; bombed the Alfred P. Murrah Federal Building in downtown, Oklahoma City, killed 168 people, and injured more than 680 others ...here's another legal Citizen attack for you, since we Americans forget how we're our own enemies {but I guess thats okay}.....: Eric Rudolph carried out the Olympic Park bombing in Atlanta during the 1996 Summer Olympics.....that blast killed spectator Alice Hawthorne and wounded 111.....lets ...","commenter_a":"Instead of deporting \"illegal immigrants\" kick out all the Nazis skin heads KKK alt right Moran's and we shouldn't have any problems with the rest of the world","post_message":"The 9th U.S. Circuit Court of Appeals has refused to reinstate President Donald J. Trump's travel ban. In response, President Trump tweeted, \"See you in court\" and \"the security of our nation is at stake.\" Do you agree with the court's decision?"},{"comment_id":"10154224264151500","commenter_b":"@username ur queen is pregnant","commenter_a":"Kristina Vinson twins omg","post_message":"The Carter family grows."},{"comment_id":"10154809272254714","commenter_b":"Says a female....smh","commenter_a":"Shows the ignorance of those who can't be bothered to do their research at this time in that country...and instead ,waste their energy having hissy fits on issues that are harmless, while they invite the she devil herself to continue destroying them... Mercy...","post_message":"It will cost between $3,000 and $10,000 to fix the damage.  (via Good Morning America)"},{"comment_id":"886538858047877","commenter_b":"My corner gay bakery wouldn't bake me a vagina cake......... The USA is goin to shit","commenter_a":"Most of the people commenting here have no concept of freedom. The beauty of America is if you don't like the way one busines does thongs, you can go to another. Using government to force people to comply is not Freedom. Should a gay baker be forced to make a cake for an anti gay group? This is a continuing attack on the rights of American's in general, just like telling businesses the can't smoke in them anymore. Just because a business is open to the public does not mean every person has a right to frequent there no matter what.","post_message":"How do YOU feel about this case? Should government be able to force businesses to do things against their will by writing legislation? What do YOU think?"},{"comment_id":"10156665343745725","commenter_b":"Build the Wall!","commenter_a":"Thank you Donald Trump, I know all of this campaigning is a lot of work and tiresome. I sure hope you can find all of the strength and energy you need to keep up with negative stuff, because I know you are fighting for us the people. And we sure want you to go all the way to the Presidency. There has been no one will to fight for common sense and for the normal and real people of the great country. We all just need a chance to do and be great! Thank you again","post_message":"GOOD MORNING SOUTH CAROLINA! Do not forget to get out and vote today! The poll numbers are outstanding. They mean nothing, if we don't ALL get out to the polls & VOTE! Together, we will MAKE AMERICA SAFE & GREAT AGAIN! Thank you!"}]
