[{"comment_id":"10155292793551509","commenter_b":"Look at all the zombies/paid trolls. #imwithher at the hospital HitLIARy will never be president.","commenter_a":"Hillary can't attend a simple ceremony without collapsing, can't lead a nation and not fit to be president! One more reason to vote Donald J. Trump 2016! Those who plant injustice will harvest disaster, and their reign of terror will come to an end. Proverbs 22:8. Hey liberals?? Look what has happened to your Hillary Clinton!! Karma is real!! And justice is being served!!","post_message":"Hillary Clinton's exit from Sunday's September 11 commemoration set off a flurry of questions and concerns about her health.  For the reporters who cover her, there was also frustration."},{"comment_id":"613162948816887","commenter_b":"Try to imagine how little I care about anything this pre-teen brain has to say.","commenter_a":"She's a f*cking but job anyway....","post_message":"She is PSYCHO crazy folks."},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx ' you big dummy '","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."},{"comment_id":"10154057367791600","commenter_b":"Exactlyyyyyyy","commenter_a":"My dogs would be out of there before me","post_message":"The cause of the early-morning fire is under investigation."},{"comment_id":"1116694178387110","commenter_b":"Jim Kelley who's disingenuous now? Context is everything, two debates are scheduled during major NY sports team match ups. The other during his good morning America interview.","commenter_a":"Bernie is not even registered as a Democrat. He is just running on the Democratic ticket for funds and benefits. He should have run as a socialist, Oops, I mean Independent. Hillary 2016","post_message":"Hillary Clinton cree que la educación es la clave para salir adelante. Lee el artículo."},{"comment_id":"10153641975856234","commenter_b":"I don't know if it is objective or not. Some day we may find a genetic marker for transgendered people. In the mean time, you can travel to a state where you can find a chick with a dick to stand next to you as you pee.","commenter_a":"Interesting that the states with the lowest tax rates are places where I would NEVER want to live. I guess you really do get what you pay for.","post_message":"State and local taxes in the Garden State were 12.2 percent of income. See how that compares to other states."},{"comment_id":"1082049255206943","commenter_b":"'Claim to be Muslim'??? Muslims marry 6 year old girls! Muslims think that women are 2nd class citizens! Muslims believe that women shouldn't be allowed to drive or leave the house alone! Muslims believe that the punishment for being gay is DEATH! Their culture and our culture can't coexist peacefully! Is there some part of that that you can't understand?!?!?!?","commenter_a":"It reminds me of Sodom and Gomorrah. The whole group would not allow the police to get to the BOY...What the fuck is wrong with these sick Bastards, that claim to be Muslim? Raping of young boys and girls is okay? I ned to re-read the Koran...","post_message":"Some of Obama's Muslim 'refugees' were raping a 10-year-old boy when the cops were called.  The police arrived, but what they did once they got there has left the country furious.  It's time America learned the WHOLE truth..."}]
