[{"comment_id":"10152926251994071","commenter_b":"Their porn is awesome. Fully filled girls, unlike the skinny twigs the US has to offer.","commenter_a":"Small wonder. Have you ever seen their porn? Horrifying.","post_message":"It's a \"time bomb.\""},{"comment_id":"10154759718811178","commenter_b":"The Times does not have to worry about the leak, we all could hear and see how biased the moderator was.","commenter_a":"Birds of a Feather, always stick together....","post_message":"The NY Times let it slip they thought the moderator helped Kaine during the #VPDebate.  But it's what they did next that's getting attention."},{"comment_id":"1058239930927979","commenter_b":"This woman has to be one of, if not the stupidest person in the world.","commenter_a":"This piece of whale shit....no I stand corrected, whale shit has a purpose. This Is the very definition of dumbocrat....take your old tired ass and retire you outdated elite POS. You are so far out of touch with the human race just knowing you made that statement makes me throw up in my throat. Please go off to your pasture, dig yourself a hole so I can put an outhouse above it and shit upon your face.","post_message":"\"They voted against their own economic interests because of guns, because of gays, and because of God, the three G’s, God being the woman’s right to choose,\" said Pelosi."},{"comment_id":"952878738162068","commenter_b":"Than go home! Are laws not yours","commenter_a":"mix bacon with it .../","post_message":"\"The Islamic form of slaughtering animals involves killing through a cut to neck when the animal is still alive. An Islamic prayer is then read as the blood is drained from the body. In the UK animals are legally required to be stunned before their neck is cut, but some Muslim argue this is against their religion.\""},{"comment_id":"10152588899470779","commenter_b":"Right girl","commenter_a":"Jarelie Anne McClusky can't fucking waiiiit","post_message":"Brett Morgen's documentary is more than just a must-see for Nirvana fans. It's an eight-years-in-the-making collective labor of love that offers a private peek into the artist's mind, from the first creative stirrings to the spiral downward. You don't just feel as if you've gotten to know the man better. You're left completely emotionally spent."},{"comment_id":"10153793026628010","commenter_b":"@username Try entering Mexico illegally and see what happens","commenter_a":"Most illegals can't come on work permits or marry for papers. Most hope to just work and return home. Lebanese, Greeks, Armenians and Syrians, Salvadorians are fleeing their countries do to violence. Are they criminals for entering the USA, and other countries in order to want to survive? Wanting a better life isn't a crime.","post_message":"It is the fourth immigrant detention facility in the U.S. where protesting detainees have refused food in recent weeks."},{"comment_id":"797236390409541","commenter_b":"Stfu no one wants to hear your mouth.","commenter_a":"Donald Trump is a BIG Government Authoritarian and progressive fraud from New York City He's NEVER been a conservative, and he NEVER will be conservative -- he's an actor, a phony, pretending to be what he's not.","post_message":"I'm getting really tired of this."}]
