[{"comment_id":"10155784573999657","commenter_b":"Does this woman ever smile?","commenter_a":"Has she and all other politicians done this already or are planning to follow what she wants?? If not why should Mr Trump do something no other politician has ever done!! Can't hold him to a standard that no one else is following or has ever followed!!!","post_message":"Ethics and Intellectual Consistency."},{"comment_id":"10155157892736729","commenter_b":"HILLARY LIED UNDER OATH SEVERAL TIMES- SHE TOOK FOREIGN BRIBES FOR CONTROL OVER OUR SOVEREIGN NATION- SHE DESTROYED EVIDENCE AFTER CONGRESS DEMANDED IT WITH A SUBPOENA- THOSE ARE REAL CRIMES- WE WOULD BE IN JAIL FOR- THE DEMOCRAT'S SAY COMEY IS SIDING WITH ONE SIDE OVER THE OTHER-FOR POLITICAL REASONS- BUT NOT THE FIRST TIME - WHEN HE WOULD NOT PROSECUTE CRIMINAL HILLARYS-BLATANT INTENTIONAL-CRIME SPREE- NO- ONLY NOW -THEY SAY IT- WHEN IT'S NOT GOOD FOR THEM- THIS NEW FBI INVESTIGATION- IS A JOKE- THEY WOULD HAVE ALREADY PUT HILLARY IN JAIL!!!! **WIKI LEAKS AND THE FBI-ALREADY HAVE ENOUGH EVIDENCE TO PUT HILLARY IN JAIL- THIS IS A SCAM- THIS IS JUST A DISTRACTION- SO HILLARY CAN SAY- SEE- THIS IS NONSENSE- THERE IS NOTHING THERE--CRIMINAL HILLARY HID EVERYTHING BUT NOW WANT'S IT OUT- I CALL BULLCRAP","commenter_a":"Kill yourself you fucking pig","post_message":"Amazing."},{"comment_id":"836200936476160","commenter_b":"Don't think ANY woman could run this country as well as a man could.","commenter_a":"Bring on mashed potatoe legs","post_message":"“I’m ready for Hillary, are you? Are you coming?”  - Sarah Palin"},{"comment_id":"475937869263460","commenter_b":"what drug is she on these days? Think she's lost it in her old age....","commenter_a":"yes christian should pray all the time","post_message":"Parton delivers strong message to christians everywhere.  This is out of line, we need to show her that this type of public disrespect is unacceptable.   Do you agree that christians should be able to pray in public?"},{"comment_id":"10152861396861051","commenter_b":"Shut up","commenter_a":"Sick. Stay with your own race.","post_message":"A police officer came in, handcuffed this teen and dragged him out of school. When they got outside, the teen realized what was happening."},{"comment_id":"10153593873146130","commenter_b":"Bobby McDonald. you are 100% wrong. the only way felons and nut jobs can get guns illegally is through criminal connections which already increase their chances of arrest. why you would rather want to get rid of BGCs so criminals can get guns in a Walmart is something so irrational and naive i simply cant understand that kind of thinking.","commenter_a":"It's incredible that there are people out there that call themselves responsible gun owners but have a problem with background checks","post_message":""},{"comment_id":"930444230329383","commenter_b":"And big SUCK IT to rupert & roger, FUCK the both of ya weasels!","commenter_a":"Awesome","post_message":"The folks over at Fox News had hoped to bully Dish Network into giving their toxic channel the cheap air time it demands, but going into a second week of being banished from the television lineup is only proving that Dish has more clout."}]
