[{"comment_id":"10154382177016756","commenter_b":"Kyle, bad news for you. I'm a Bernie supporter. I'm just not up my own ass about it like so many of the rest","commenter_a":"Thank you for stating the obvious @username. This isn't about winning anymore. It's about spreading the message. This movement isn't going away. And we'll keep donating to see him through, because the message is important. Bernie Sanders, the nobody socialist senator from the boonies, almost took down the strongest possible candidate the establishment could put forward. He did it against rigged elections, big money, money laundering, and voter suppression. Him and our 27 dollar donations.","post_message":"As of March 31, there were 896 people on the Sanders payroll. The campaign says it will retain more than 300 staff."},{"comment_id":"10153263146396833","commenter_b":"She dont need a gun anyway, Shes got a face that would stop a train !","commenter_a":"Start living in the real world, hoodlums are not giving up their guns. Wake up and smell the roses gabby","post_message":"On March 4, gun control proponent Gabby Giffords joined Democrat lawmakers on Capitol Hill to push for expanded background checks on all gun sales.  Anti-gun Representative Mike Thompson (D-CA), who supports banning commonly owned semi-automatic firearms owned by millions of American, is spearheading the push."},{"comment_id":"919423778080478","commenter_b":"You'd have a point (kinda) if it was a white girl. But shes black. So she has no argument. Neither do you.","commenter_a":"Wow I gotta admit I'm surprised at all the responses. As a dark skin man I understand that woman. If u an Artist and u preach something u should be about that something. Now as humans u love who u love but when u are a celebrity u open yourself to critisim good or bad.","post_message":"'Dark Skin Activist' Slams Kendrick Lamar Over Light-Skinned Fianceé: “I Will Never Support Him”"},{"comment_id":"10153497102100163","commenter_b":"His wife","commenter_a":"I don't believe this..","post_message":"Waka Flocka Flame's longtime girlfriend explains why the couple decided to part ways"},{"comment_id":"1012141178845630","commenter_b":"She owes no one a child. Her womb is her business.","commenter_a":"maybe she used off gone on injection or pill or something instead off using nothing knowing there could be a small chance she could fall pregnant also there are alot of good people in this world who cant have kids she should off kept baby them given baby up to a loving family instead off killing a innocent life","post_message":"Woman uses IVF to conceive three kids - then has abortion for a natural pregnancy"},{"comment_id":"10154166026884342","commenter_b":"Phulleeezzzee this woman isn't going to get caught","commenter_a":"There are freaking cameras everywhere. You will get caught. Not worth it. And the problem with leaving your purse in the car is her lousy boyfriend is watching in the parking lot and waiting to break into your car as soon as you're in the store. And these are the same ones videoing as a cop takes them down and screaming police brutality. You live by the camera, you are gonna go down because of the camera. Smile!","post_message":"A California woman is drawing eyes after she appears to brazenly snatch a wallet from the purse of a fellow shopper. @webpagelink"},{"comment_id":"10153028104776037","commenter_b":"She should be in prison!","commenter_a":"What Democrat party lackey will Obama cart out to replace her?","post_message":"#MarilynTavenner, the Obama administration official who oversaw the botched rollout of the #Obamacare website, #Healthcare.gov, announced she will resign as head of the agency that also manages the Medicare and Medicaid healthcare programs."}]
