[{"comment_id":"10153447709650667","commenter_b":"If this would ever happen to my mom. I would make room so she can live with me.","commenter_a":"Good just because your old , you still have to follow the rules . If they make exemptions based on age that would be discrimination .","post_message":"“I have four grandsons, but I don’t want to be dependent on them. I can’t be a burden to my family. They don’t have room for me. That happens in life.”"},{"comment_id":"10153673371886336","commenter_b":"Exterminate them all","commenter_a":"And they wonder why their lives don't matter?","post_message":"Scott Lattin and his family painted the words “police lives matter” on the back window of their truck.  Then, someone spray-painted obscenities about the police on their car and wrote “black lives matter” in spray paint across the side of the truck.."},{"comment_id":"10153995983694203","commenter_b":"should be a white woman","commenter_a":"Michael Jackson had a deep-seated race problem. Or an Elizabeth Taylor fetish...","post_message":"What the f*ck?"},{"comment_id":"1757425844524023","commenter_b":"Is not as easy as you put it my friend, illegal immigrats don't just \"apply\" to get their papers...if it were that easy we woudnt have so many illegal immigrants.","commenter_a":"I am sure this girl is worried about deportation of her parent's. I am also certain that many kids of illegal immigrants living in the US are fearful.. but wouldn't parents apply for a visa and for proper citizenship? So their kids wouldn't live in fear? And set an example that this is exactly why the US is the greatest place to live!","post_message":"Young child of undocumented parents speaks at the Democratic convention about her fear of being deported: \"I’m scared that at any moment my mom and my dad will be forced to leave. And I wonder what if i come home and find it empty?\" @webpagelink #DemsInPhilly"},{"comment_id":"10150755194664999","commenter_b":"Are you suggesting women become prostitutes?","commenter_a":"Domestic housekeeping is correctly dismissed as being of economically minimal value, because in the free labor market performing these tasks for others (child care / babysitting, housecleaning, short-order food preparation) are low- (or no-) skill jobs that are either minimum-wage, or \"under the table\" cash-based work.","post_message":"\"We need to call work what it is — work — whether you do it at home or whether you do it out in the labor force, and then give men and women options to choose what they want to do.\""},{"comment_id":"10153880843542293","commenter_b":"Really? Because people can remember actual facts that happened 15 years ago. Right.","commenter_a":"@username you were right!","post_message":"New details emerge about Omar Mateen, including his strange reaction to 9/11."},{"comment_id":"10154007115431770","commenter_b":"IDIOT","commenter_a":"Another side affect of using baby powder........ugh","post_message":"When Tucker Carlson got the best of this anti-American-Flag student, it reminded us of the old Thug Life meme. Welcome to the Tuck Life."}]
