[{"comment_id":"964951150247780","commenter_b":"Prove it!","commenter_a":"I support our troops; I support allowing them the victory over our enemies...","post_message":"BOOM!! If I were ISIS, I'd already be looking for cover. The U.S. Military isn't messing around here.   Do you support our troops?"},{"comment_id":"10153520082123132","commenter_b":"YES CANCEL, PLEEEEASE!! ONCE A CHILD MOLESTER ALWAYS A CHILD MOLESTER!!! CHILD MOLESTERS NEVER GET REHABILITATED!!! IT'S BEEN PROVEN!!!","commenter_a":"NO!!!","post_message":"Do you think TLC should cancel 19 Kids and Counting?"},{"comment_id":"10152884015311336","commenter_b":"No that would be michelle Obama. That thing has an Adam's apple.","commenter_a":"Maybe they could use the canned food to prepare REAL meals for the kids and throw the Michelle Obama school lunches at the attacker.","post_message":"A principal in Alabama wants to stockpile cans of food in classrooms so that students can “stun an intruder \"or even knock him out\" until police arrive.  What do you think? Is this a good or bad idea?"},{"comment_id":"508820039306289","commenter_b":"This should be in every state. Men that force themselves on a woman do not deserve to have the ability to rape again.","commenter_a":"I dont understand the verbiage \"violent sex offenders\". Isn't rape always violent, are their non-violent rapes I don't know about?","post_message":"This state did it, what about yours?"},{"comment_id":"10152934995226680","commenter_b":"Seems you want to engage in gossip. I got better things to do with my time. Scoot along Andrew.","commenter_a":"Bernie's right. The biggest mistake of the Clinton administration was dismantling Glass-Steagall.","post_message":"Bernie Sanders: \"Allowing commercial banks to merge with investment banks and insurance companies in 1999 was a huge mistake.\""},{"comment_id":"10155308331690354","commenter_b":"If these 400 men are really that stupid...do we really want them populating the world anyway?!","commenter_a":"I wasn't aware obama was a follower","post_message":"Other than charisma, how does one convince 400 men this is a good idea?"},{"comment_id":"10153787170708338","commenter_b":"@username would you like an A for English ? You got the picture right? That's all that matters, just for you I'll make it politically correct Lose!!!! Here you go","commenter_a":"Round the gangbangers up, they need to see what it looks like to lose an innocent child!!! Round them up and have them put in detainee prisons and ship they butts off to a open area so they can be at war with each other so that Chicago can live in peace!!! No need for burials and insurance just leave them right where they lay!!!! This is truly sad , this baby won't see thanksgiving or look forward to the surprise of his favorite gift on Christmas","post_message":"Visitation for 9-year-old Tyshawn Lee is being held today at Haven of Rest Missionary Baptist Church. CBS2's Mai Martinez will have a live report at 5:00 PM."}]
