[{"comment_id":"537696536420926","commenter_b":"I don't like her anyway no matter what. Don't trust her","commenter_a":"Its a joke this woman no never come out as president she's wasting her time in her money we all know nobody wants to Clinton back in the White House","post_message":"Hillary Clinton's sex slave just exposed her for doing THIS.  What a disgrace. She will never be president.  Can we get 20,000 'LIKES' to make sure Hillary never becomes president?"},{"comment_id":"10154759698326509","commenter_b":"Then no sex allowed","commenter_a":"What if you're bulking","post_message":"You're human, so chances are, you're interested in getting more sleep, having better sex and improving your mood..."},{"comment_id":"10153356544334087","commenter_b":"Yep.","commenter_a":"Hillary should worry about that indictment coming down the pipelines in January.","post_message":"“This is truly unbelievable, that after what we’ve seen in Paris and other places, Republicans will not bring up a bill that will prohibit anyone on the no-fly list from buying a gun in America,\" Hillary Clinton said. \"If you are too dangerous to fly in America, you are too dangerous to buy a gun in America. How many more Americans need to die before we take action?”"},{"comment_id":"10154413967139087","commenter_b":"The British started this mess, no one including the US wanted this \" trash of Europe so they found a desert to dump them in, let get along or die, who cares, why do we have to pay for these spoiled perpetual \" victims \"","commenter_a":"Israel will never be at peace, if they don't work for it. Sorry about the comparison but that sounds like something Hitler would do, obliterating a group of people to put your own. Have you ever heard about Divine intervention? God doesn't like when you prosecute His children.","post_message":"#BREAKING: The Israeli government says it plans to move forward with the construction of thousands of settlements in East Jerusalem despite a U.N. Security Council resolution demanding an end to settlements in the occupied territories."},{"comment_id":"1554113821370873","commenter_b":"What an ASS!","commenter_a":"Now we see how close he is to that N word, he will before to long.","post_message":"Speechless."},{"comment_id":"10153047000946336","commenter_b":"Send her to Iraq for a month.","commenter_a":"Yeah, that'll piss ya off !","post_message":"A social worker at an Indianapolis VA clinic was disciplined earlier this year after sending emails to colleagues that contained photos of an elf figurine posed to mock the mental health problems of combat veterans."},{"comment_id":"10153937111420695","commenter_b":"Girl you got something to be thankful.","commenter_a":"God bless","post_message":"“Everybody at the church got up and started handing the preacher money, and it was just crazy. So many people got up. They started hugging me. It was just awesome. I couldn’t help but cry. It was just amazing,” the mom said."}]
