[{"comment_id":"1067424023316727","commenter_b":"Just what the world needs- an entitled fat black woman - how unique....","commenter_a":"i am sorry but i am so sick and tired of la'porsha bashing on FB, that is her opinion which she is entitled to. she was probably raised in a small town with narrow minded views and parents who put those ideas in her head. she is a beautiful talented woman who is raising a child on her own since was a victim of domestic abuse. she is using what she went through to help other women dealing with the same. we need to focus on her talent and contributions to society not her own personal views. i am gay and i have gay friends who are not thrilled with the gay lifestyle either, and it's this kind of unnecessary bashing which causes negative feelings. i voted for the ultimate winner trent who also was from mississippi and i don't see any interviews with him about the lifestyle. so ease ...","post_message":"Should we forgive La'Porsha Renae ?   American Idol"},{"comment_id":"10154409316811336","commenter_b":"I think like all of us Trump thought no this can't be and thus he thought it was a joke! Then reality of course set in and the man thought as we all do who would expect anything different from the Clintons? My question what is next to come it is something every single day?","commenter_a":"Why would Trump think that such a meeting would be just a joke? All of these democrats are capable of any despicable act imaginable! They have proven it over and over again, but all we ever do about it is whine like little punks! obama should be in prison, hillary should be on trial and lynch should be removed and arrested as well! ENOUGH with the beating around the bush! We need to hit them on the head! They need to be punished severely NOW!!!","post_message":"“I'm flabbergasted by it.”  Donald J. Trump reacted to the news that Attorney General Loretta Lynch met privately with former President Bill Clinton amid the DOJ’s investigation into Hillary Clinton’s emails. Full interview tonight at 10p ET."},{"comment_id":"883241831711239","commenter_b":"@username another liberal who's mother should have swallowed","commenter_a":"I back the police , i hope they do turn their backs on Obama , he is a worthless piece of sh**","post_message":"PLEASE do this, cops!"},{"comment_id":"598960046961241","commenter_b":"YES, fire him!!","commenter_a":"I agree he definitely needs to be fired","post_message":"Police chief announces that he going to enforce Shariah Law.  He can't get away with this. Shariah law has no place in America.  Do you think this police chief should be fired?"},{"comment_id":"10154119835601770","commenter_b":"Give those real freaks, real deplorables if you will... a hand they know Clinton is one of them!!","commenter_a":"They feel sorry for the looser and I mean a dirty looser","post_message":"Remember when Vice President-elect Mike Pence was booed at 'Hamilton'?"},{"comment_id":"10152698391808717","commenter_b":"She's no Zumba instructor but she's not","commenter_a":"She's a hottie","post_message":"Claremont police say two people face charges after selling cocaine, crack cocaine and heroin in a school zone. @webpagelink"},{"comment_id":"10153994246388967","commenter_b":"2nd only to 2016 Kobe 'highlights'.","commenter_a":"The surfing scene from Escape from LA better be in there.","post_message":"Remember when these were cool?"}]
