[{"comment_id":"687362974730217","commenter_b":"It is spelled you're... You are. Your denotes ownership","commenter_a":"What! Let's see Hilary was a lawyer, First Lady, senator, Secretary of State, married to the president of the world and your comparing homes? YUP comical","post_message":"LOVE THIS!!!!"},{"comment_id":"876682692378359","commenter_b":"These two women obviously don't know the plan and purpose of marriage.","commenter_a":"STOP have n sex if u dont want children. Once the child is made its alive. Not when it takes the first breath. Ppl are so selfish these days","post_message":"Do you?"},{"comment_id":"1681685855452013","commenter_b":"Joke...","commenter_a":"Jail and no bail.","post_message":"President Obama is taking guns out of all forms of entertainment.  This is ridiculous. He can't get away with this.  Do you think he is abusing his power to push his propaganda?"},{"comment_id":"824413534273149","commenter_b":"She should point those racist fingers back at self!","commenter_a":"Do you really expect anything else from her? I'm not shocked at all. She's an idiot.","post_message":"This speech is shocking... even for her!  What Michelle says at this graduation ceremony will make you cringe!"},{"comment_id":"10154091613326491","commenter_b":"@username, being dumb is a choice. Well done. Did you decide to be straight ?","commenter_a":"Stop... you are American or you arent. Quit separating people by what body parts a person likes to sleep with and what color of skin they have... Just stop","post_message":"“When you don’t have data about a community, at times it can seem like the community doesn’t exist.”"},{"comment_id":"1140355262709675","commenter_b":"@username, I see you as the Liberal that you are, crying for this BS, but you'd be the first one to file a complaint AFTER you've been accosted by a perv in the women's bathroom.","commenter_a":"No, I'm not done shopping at Target. Do all these people really believe they'll be attacked? Get over yourselves.","post_message":"Target just announced that transgenders will be able to use any bathroom they want. I'm pretty sure they were not expecting what happened immediately after their announcement...  Are you done shopping at Target?"},{"comment_id":"1200289290023832","commenter_b":"It just needs to be remembered do this with no violence unless it is used on them and if the illegal aliens respond with violence deal with them direct and swiftly. No questions just stomp them and dump them back across the border.","commenter_a":"She just deserve a raspberry. It is the to be said to her. Our immigration system needs work but she is really talking about letting illegal aliens in. The term illegal means we have acknowledged that they have committed a non-legal act, thus becoming a criminal. That means do not pass Go do not collect 200 dollars. They are already being coddled at our expense. If, they are caught they should be taken direct to be fingerprinted and photographed, then directly to a border. If, they are identified as having done it before. We should setup a location far away to ship them to. This non-American needs to mind her own business, instead of trying to shovel her troubles on to us.","post_message":"Oh really?"}]
