[{"comment_id":"1366520420044674","commenter_b":"Hope you get well soon. Your health is what's important. Take your time so you can heal completely before you return.","commenter_a":"Do what you need to get completely healed because we need you when the football season comes.","post_message":"Wishing you a speedy recovery, JJ Watt!  MORE-->@webpagelink"},{"comment_id":"10152961609451336","commenter_b":"Suck my dick!","commenter_a":"Kanye is absolutely right!","post_message":"Kanye West stole the show again at The GRAMMYs after Beck was announced as the winner for “Album of the Year.” @webpagelink But was it funny this time or just offensive?"},{"comment_id":"10154805398708812","commenter_b":"Ha ha. That'll teach them.","commenter_a":"George R. Sadler DW Adams","post_message":"Police in Southern California on the lookout for brazen thief who broke into a YMCA and stole fake cash from a toy register."},{"comment_id":"10154014383211636","commenter_b":"hmmmmmmmmmmmmmmmmmmm, she needs to be hanged.","commenter_a":"good! even the uk police can be corrupted.","post_message":"She was shot in the stomach, but not by the man she claimed"},{"comment_id":"10152526323082377","commenter_b":"Go away","commenter_a":"a gubbament BIG ENOUGH to GIVE you everything you WANT, is also BIG enough to TAKE EVERYTHING you have!! see what happens when you DONT VOTE!","post_message":"Oh Really..."},{"comment_id":"938184229613517","commenter_b":"So then everyone on earth is an American, and we should have no borders, right?","commenter_a":"I took that ancestry DNA test. You all should. Turns out, I'm Native American. If your DNA turns out you are not from the America, shouldn't you fuck off?","post_message":"'Was it because of Europeans? Or was it because of the very early events that led to the peopling of the Americas?'"},{"comment_id":"1107746175912227","commenter_b":"'@username -- The women lied under oath and colluded. I'd call that misandry, not misogyny.","commenter_a":"And the feminist backlash begins in 3...2...1","post_message":"Former CBC host Jian Ghomeshi has been found not guilty of sexual assault and choking.   Full story: @webpagelink  (Photo: Chris Young/Canadian Press)"}]
