[{"comment_id":"10153700669189586","commenter_b":"I think you are an idiot. Zoos are bad conservation centres are good! You want to show your children animals in far too small spaces and teach them this is acceptable? Why don't we then put our toddlers in gages where we can keep better eye on them.","commenter_a":"That's totally insane! BAN ZOOS!","post_message":"The kids' faces say it all."},{"comment_id":"10153715291715950","commenter_b":"Sorry Sara Sterling you wouldn't know the NRA from a CPA. Guns were here before you and they'll be here long after you. They can pass all the unconstitutional laws they want the gun owners will not comply. If you don't like it well then your free to pack your sh*t and leave there isn't anybody forcing you to stay here. The earth is huge...","commenter_a":"CBS once again reaching with their BS agenda! Why don't you report how gun sales are at a record high? Obama is the best gun salesmen ever. If a government ever tells you to disarm yourself you need to arm yourself!","post_message":"This brother shares the story of his family's tragic trip to a gun range."},{"comment_id":"10155402759240354","commenter_b":"A bunch of trouble making bitches trying to talk over one another","commenter_a":"Irrelevant opinions from an irrelevant long in the tooth washup","post_message":"**sigh**  WATCH the insanity for yourself."},{"comment_id":"858336867535069","commenter_b":"Good for her Muslims need to go back to their own country and stay there. Stop pushing their laws on us. And stop giving into them","commenter_a":"move go back to your country","post_message":"#Sharia comes to Texas?   Not this time!"},{"comment_id":"1525170294448172","commenter_b":"DECLASSIFIED PROPHECIES AND VISIONS : A GREAT EARTH QUAKE IS ABOUT TO HAPPEN . A MILLION AMERICANS WILL DIE , AND OVER A HUNDRED AND TWENTY MILLION PEOPLE WORLD WIDE . THE UNHOLY AND GAY PUSHING OBAMAS MUST LEAVE THE WHITE HOUSE NOW . GOD CANNOT BE MOCKED . USA WILL BE GREATLY DESTROYED BY ASTEROIDS , EARTH QUAKES AND NUCLEAR STRIKES BY 2047 . PREVIOUS PROPHECIES THAT CAME TO PASS INCLUDE 911 , RUSSIA ASTEROIDS, JAPAN TSUNAMI , HURRICANE SANDY ( INFORMED WISH TV TWO WEEKS BEFORE IT HAPPENED ), PHILLIPINES TYPHOON , TERROR ATTACKS ETC . THESE ARE THE END OF DAYS - THE ANOINTED PROPHET z( I WAS SENT BY GOD)","commenter_a":"That would be the best dinner ever. How can I get invited!!??","post_message":"President Obama will deliver a lavish welcome to Canada's new Prime Minister Justin Trudeau at the first state dinner of 2016"},{"comment_id":"495888253922598","commenter_b":"I don't know many people that leave the doors to their homes unlocked when they leave for the day, when they go to sleep at night or just go about living with their family and friends. Also I don't know anyone that does not ask guests to leave at some point after a visit. Additionally most people use common sense to screen individuals that enter their homes. If the individual being considered as a guest is affiliated with a suspect group we error in the side of caution to protect or family and do not invite that individual or their affiliated friends into our home. In comparison to legal and illegal immigration into the USA it seems like the Democrats are telling us to unlock your doors while you sleep, don't use the locks on your doors while you watch TV, and when you leave for the day leave your ...","commenter_a":"The parallel is Jews = Christians. Not hitler to trump. Hitler killed the Jews. Not the other way around. Radical Muslims are killing Christians and Americans. Get it ?","post_message":"It would not surprise me either! What I am seeing & hearing from around the country is disturbing. Time for us all to #MakeAmericaGreatAgain. Remember! We need to energize EVERYONE to get out and VOTE!#Trump2016"},{"comment_id":"10157698667015354","commenter_b":"Oh dam black bonnet girls make the rocking world go round!!","commenter_a":"Rumspringa. @webpagelink","post_message":"Here's a headline you don't see every day..."}]
