[{"comment_id":"776537535808625","commenter_b":"Bitter and jealous? Suck an A.","commenter_a":"you look like you eat porridge for breakfast from a silver spoon, bro","post_message":"The waiters had a little fun with me this AM. #nailsforbreakfast"},{"comment_id":"1538803016422900","commenter_b":"EVIL WOMAN!","commenter_a":"WHAT IS THAT, AN ALBINO MONKEY????????","post_message":"Did Hillary Clinton get her money's worth?"},{"comment_id":"802434323195863","commenter_b":"I support neither group. Blacks and whites need to get along. We are in a failing country that is falling apart.we need to get rid of this racism and focus on the big picture here","commenter_a":"As a member of the Armed Forces and a decorated war veteran...she does not owe me an apology. She used her platform to deliver a message while honoring a historic Black-ran group on their 50th anniversary during the one month Black history seems to be relevant. Coldplay honored the LGBT community in their performance but ironically there was no uproar over that. If anything @username you owe me, the Armed Forces, and the Veterans an apology for posting this crap and trying rally up sympathizers to further your racist agenda. Radical? Hardly....maybe you should brush up on some history and ask yourself why these organizations began in the first place before posting....oh and this...","post_message":"***BLACK PANTHER PARTY SUPPORTER AND BLM RADICAL DONOR BEYONCE OWES AMERICA'S POLICE, ARMED FORCES, & VETERANS AN APOLOGY***"},{"comment_id":"10154278163336509","commenter_b":"The Bush war, $7 trillion and counting!!! (Before) Good Schools and Good Incomes! (Now) Poverty, Guns, Incarcerations! $$ facebook doesn't want you to see this $$ As long as America's richest 1%, who now possess 70% of the wealth and don't bother to vote, have the Senators in their pockets the United States Government isn't representing the will of the people, it's the 1% that's running the show. I stand with Bernie Sanders, \"We're governed by an Oligarchy.\" The number of Americans living in poverty will continue to grow while the middle class will continue to shrink and working women will continue to enrich the wealthiest 1% for the next 20 years easily! (Able to afford the best and brightest, Hillary is a great political actor with a well rehearsed script.) She WILL make another Fortune!","commenter_a":"His plan is take more money from the successful and give it to people like freddie gray's neighbors......makes perfect sense.....","post_message":"Bernie Sanders seemed appalled by the conditions as he toured sites of unrest following the death of #FreddieGray. \"Anyone who took the walk that we took around this neighborhood would not think you are in a wealthy nation.\""},{"comment_id":"1734707080142446","commenter_b":"@username fuck outta here!!! Hahaha biggie pulled more bitches!!!!! REALIZE THAT NONE OF THOSE FEMALES U NAMED IS BAD ALL UGLY ASS HOES!! THE BEST LOOKIN FEMALE BIGGIE GOT TUPAC FUCKED (Faith)!!!!! Jada Smith shut biggies females down lol","commenter_a":"Biggie, cus todays people are too stupid to understand Tupacs lyrics lol","post_message":"VOTE NOW! 2pac vs. The Notorious B.I.G. -- Who'd be bigger today? #DEWcision2016 #sp See how your fellow hip-hop fans are voting here..."},{"comment_id":"10154200210407411","commenter_b":"She has to pay her daddy","commenter_a":"Why doesn't she sue to stop the pay of the Senators/Representatives who's job it is to pass a balanced budget but who haven't done so in almost two years? It seems highly suspect to punish people who do their job but allow those who are unable to complete their primary assigned task to continue to be paid. Again, politics over people. Sad.","post_message":"Illinois Attorney General Lisa Madigan is seeking to stop state worker pay until legislators and Gov. Bruce Rauner approve a spending plan."},{"comment_id":"654574044733174","commenter_b":"Forget you Hillary!!!! REMEMBER Benghazi????????? YOU'RE NOT GETTING MY VOTE!!!!! Rot in hell you piece of shit!!!!","commenter_a":"Fuck that Bitch.","post_message":"Hillary Clinton wants the Fox News host's head, but she's not backing down. She is in trouble. Let's show her our support. Can we get 10,000 'LIKES' for this Fox News Host's stand against Hillary?"}]
