[{"comment_id":"1054883167923762","commenter_b":"What a dumb bitch.","commenter_a":"And this hack wants to be President?....Are Americans that blind and stupid ????","post_message":"“I’m going to be talking to white people, we’re the ones who have to start listening to the legitimate cries coming from our African-American fellow citizens,” said Hillary Clinton."},{"comment_id":"953216211400448","commenter_b":"Ron, don't forget about the white folks whom have EBT cards and are on welfare.","commenter_a":"So why are we not receiving reparations like the Jews Obama.U jst gave them 12 million for something that didn't happen here!","post_message":"President Obama defends the Black Lives Matter movement, saying the concerns of the activists who have marched & protested for change are legitimate. Obama reiterates that while all lives do matter, black communities are under a specific & unique scourge that needs to be addressed. He also goes on to say that using the phrase “Black Lives Matter\" does not mean that other lives do not. DETAILS ----> @webpagelink"},{"comment_id":"1032739630099842","commenter_b":"Bigotry must be confronted every time it raises it's ugly head. Shamefull Republicans","commenter_a":"Newsflash! Only God can judge. These so-called phony 'christians' will go to hell before anyone else....","post_message":"A Florida church and anti-gay pastor saw a quick backlash from residents of the community after putting up a hateful anti-gay sign."},{"comment_id":"10154285829964641","commenter_b":"And all of you need to stop sucking this mans dick. He didn't even play today","commenter_a":"Props to Portugal but why does Ronaldo get to be front and center??...let the guy who scored the winning goal get the glory.","post_message":"Portugal gatecrashes France's UEFA EURO 2016 party... and all without Cristiano Ronaldo."},{"comment_id":"10154602894018145","commenter_b":"wcjb tv 20 out of gainesville covers you daily too.","commenter_a":"Hardly news when you live in the Ocala area............and BTW, we are in YOUR viewing area and could use the same weather 'attention' that Orlando/Daytona/Melbourne get.....especially those of us in the rural area.....thanks","post_message":"MUCH colder weather is around the corner!"},{"comment_id":"1120443904657696","commenter_b":"Google Michael L. Robinson. Transvestite.","commenter_a":"Should say make the First Lady a LADY again. Take that Michael. Obama perpetrated the greatest fraud against America ever and will get away with it. You watch.","post_message":"Is this cartoon offensive?"},{"comment_id":"1390020544359635","commenter_b":"I would turn the hose on her and spray that STD filled flea bag off my property","commenter_a":"please knock on my door. we have lots of property and a back hoe","post_message":"I would rather ___________ than have Miley Cyrus knock on my door."}]
