[{"comment_id":"1059210544118408","commenter_b":"Ramos is a Mexican so he won't listen to reason. When we lived in Temecula, Ca., our Mexican neighbors next door would go down to the Mexico/San Diego border & pick up illegals & bring them up to live in their garage!!! So I know firsthand what goes on at the border!!!","commenter_a":"Immigrants aren't the root of this country's problem. #scapegoat.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"692144217642823","commenter_b":"A lesbian trap in a mans body...say what.","commenter_a":"How can Caitlyn get the award for woman of the year if she still has a dick ????","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award.  This is what our world has come to. It doesn't get more absurd than this.  Do you think this is wrong?"},{"comment_id":"10153975283176336","commenter_b":"Nothing will happen with her, its just a power game","commenter_a":"She disgusted me and betrayed all women who've suffered mistreatment at the hands of their men when she went back to that crumb of a husband of hers...they deserve each other!","post_message":"Earlier on 'America's Newsroom,' Fox News contributor Katie Pavlich said Hillary Clinton must answer for her role in former President Bill Clinton's scandals. What do you think? @webpagelink"},{"comment_id":"1134556746600853","commenter_b":"She's no better.","commenter_a":"Trump is the devil...if he be elected to be the president...he's gonna start the world war III. HILLARY 2016-2020 !!!","post_message":"Estas son las promesas de Trump. Así podría ser su presidencia…."},{"comment_id":"1715308212052135","commenter_b":"That is the good thing about voting for Trump! It is bad for Mexico and good for the USA!","commenter_a":"Bite me you greaser","post_message":"Mexico's former president claimed voting for Trump is 'treason.'"},{"comment_id":"10152963225776135","commenter_b":"I don't have daughters. I have sons. I teach them to keep their hands to themselves. When they're old enough to date, they'll be taught not to touch a woman unless invited. We shouldn't have to tell girls how to not get raped. We should be teaching our boys to not rape.","commenter_a":"When I was becoming old enough to go to parties as a teenager my mother started giving me the heads up about how to act when I went to out. One of the things she taught me was never drink so much that you lose control of yourself, watch who you accept drinks from, don't go to rooms with beds with men, etcetera. I'm curious as to what other mothers tell their daughters? And as a mother of sons around this age I wonder why the guy gets charged with rape if they're both drunk? Doesn't seem quite right to me.","post_message":"Former Tigers pitcher Evan Reed has been sentenced to probation after accepting a plea in his assault case. The victim strongly objected to that plea in court. VIDEO here: @webpagelink"},{"comment_id":"1208640665842055","commenter_b":"#NEVER HELLARY CLINTON !","commenter_a":"Be careful. People who cross the Clintons have a strange way of 'committing suicide' by a few 'self inflicted gunshot wounds' to the back of their heads.","post_message":"CROOKED HILLARY really SCARED  @webpagelink"}]
