[{"comment_id":"10153228177684411","commenter_b":"Yes, and Russia is one of them, no?","commenter_a":"The only reason that Putin has troubles on his borders is that he steadfastly refuses to keep his troops within them. Russians need to elect a leader committed to managing their economy effectively instead of pursuing fantasies of reconstituting the old USSR.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1659698577423598","commenter_b":"she is just cheap fat trash...who cares?","commenter_a":"Get off whatever you are on Mariah!","post_message":"... Oh my god...  I had no idea this happened."},{"comment_id":"1784602218530696","commenter_b":"This lady is a clown with money. She is a joke","commenter_a":"gotta laugh at all these haters who are left over from Obamas reign! Its time to shake up the education system!","post_message":"Join us as Vice President Pence holds a swearing-in ceremony for the Secretary of Education, Betsy DeVos."},{"comment_id":"10152694344065736","commenter_b":"Stupid woman","commenter_a":"But, it's fine to hire a' doctor' to kill your baby. That's logical.","post_message":"An Indiana woman's self-abortion has thrust her into the debate over reproductive rights."},{"comment_id":"1160460537342680","commenter_b":"'@username God is with us; not the one @username's people created, but the One who created the rest of us.","commenter_a":"You could make this same argument against every single other country in the world as there is no country that didn't have slavery and there is no race on earth that was not enslaved at some point, I was never a slave nor did my ancestors own any slaves so my question is why in the hell would I owe any reparations? Please explain?","post_message":"U.N. experts believe that the U.S. owes a significant amount of reparations to African-Americans.   With ongoing police shootings, unsolved legacy of slavery and so much more do you believe the U.S. will pay reparations? DETAILS ——> @webpagelink"},{"comment_id":"10154831195946729","commenter_b":"Well, turns out Michelle Obama herself was accused of plagiarizing part of her speech. In fact, the Democrats who are using last night’s speech as a means to cast aspersions might have done well to pause and consider the list of their own high-profile leaders who have been caught plagiarizing.","commenter_a":"Melania Trump Did NOT Plagiarize Michelle Obama’s Speech And This Is Why… The accusation is that Melania Trump “plagiarized” a speech made by Michelle Obama in 2008. Well I’m sorry liberals, she did not. Here are the comments from Michelle Obama in 2008: 'And Barack and I were raised with so many of the same values: that you work hard for what you want in life; that your word is your bond and you do what you say you’re going to do; that you treat people with dignity and respect, even if you don’t know them, and even if you don’t agree with them. And Barack and I set out to build lives guided by these values, and pass them on to the next generation. Because we want our children — and all children in this nation — to know that the only limit to the height of your achievements ...","post_message":"Wow..."},{"comment_id":"10153131425722293","commenter_b":"They are our imagine of the 'freedom' .","commenter_a":"Yes.","post_message":"Experts fear a whole slew of risks that may follow should these tribes come into full contact with the outside world."}]
