[{"comment_id":"10153862572524369","commenter_b":"I have pretty extensive vocabulary and definitely don't need to use slang so by all means generalize and assume that we all say it...it's sad people are really this stupid.","commenter_a":"If they want the racial slurs to go away, they need to stop saying them as well. It's a double standard.","post_message":"Student groups have complained for months of racial slurs and other slights on the overwhelmingly white campus. Now, more than two dozen players say they're staying on the bench until the university's president is removed due to his \"negligence toward marginalized students' experience.\""},{"comment_id":"897220707004345","commenter_b":"Ah yeah, 'only'!","commenter_a":"Emma Marie Hulme Bet you'd be able to shed some light on this!","post_message":"Near death survivor says all he saw was darkness"},{"comment_id":"10154542525666051","commenter_b":"So we get rid of all the illegals and we pay $5.00 for a head of lettuce cause who is going to do all this work?","commenter_a":"Sneaking into our country is explicitly illegal. Why is Mexico allowed to have a wall on its southern border with strictly enforced immigration laws but America isnt? What would happen to 100% of Americans caught illegally entering","post_message":"The Trump Administration's latest deportation plan is explicitly illegal under international law. Here are the details:"},{"comment_id":"1091887850889750","commenter_b":"She is a POS racist cluck bum bitch and NFL you Scumbag should give all the ticket holders half their money back","commenter_a":"What about the planners of NFL Super Bowl did they not know what her performance was about there's a little bit more to blame then just solely on Beyonce. The Super Bowl planners NFL new what hurts halftime show was about was not announced or advertised of being such as low blow off base nutcase to let it going on so take that NFL maybe you should pay attention what's going on around you to","post_message":"Last weekend Beyonce got to have her racist fun at the Super Bowl. But now she's gotten some massive bad news. Looks like you can't go off and support cop killers without having to pay a big price later on. Boom!"},{"comment_id":"1291488564240340","commenter_b":"Sorry but she is an unhinged dingbat.","commenter_a":"I'm concerned after reading today's Buzzfeed Report that the now well publicized 1986 letter by Coretta @username was not made a part of the Record then (in apparent subterfuge by Committee Chair Throm Thurmand ?). Now Sen. McConnell, by invoking Rule 19 may well have prevented the inclusion of this letter in the official record once again, in spite of the continued publicity it has received during the hearing. Our History is thus written by the \"Vicors\". Maybe it is still possible to insert that letter into the official Record of the Debates.","post_message":"I’m deeply disappointed that the Senate voted to confirm Jeff Sessions as Attorney General tonight. Deeply disappointed that the Senate confirmed an AG whose record does not show he will faithfully and fairly enforce the law. Thanks to you, everyone now knows the concerns that Coretta Scott King had about Jeff Sessions. Concerns that millions of people still have. There’s no Rule 19 to silence me from talking about Jeff Sessions anymore. So let me say loudly and clearly: This is just the beginning. If Jeff Sessions turns a blind eye while Donald Trump violates the Constitution or breaks the law, he'll hear from all of us. If Jeff Sessions makes even the tiniest attempt to bring his racism, sexism, and bigotry into the Justice Department, he'll hear from all of us. And you better believe every Senator who voted to put Jeff Sessions’s radical hatred into the Justice Department ..."},{"comment_id":"10153633420073132","commenter_b":"Keep up with the misogyny","commenter_a":"These are the lowest life, vilest example of human being that exist today. And that's the best that I can say about them.","post_message":"\"We aren't sisters, we never were. We just dated the same guy at the same damn time.\" - Kendra Wilkinson on Holly Madison"},{"comment_id":"1371535832866166","commenter_b":"What's wrong with strippers? Lol","commenter_a":"I cant believe you fools who support absolute political corruption.... you will lose your homes and jobs, mark my words, she is Obama part 2, choose wisely sheeple","post_message":"ELECTION DAY: People are casting their ballots across the country today. Have you cast your vote yet? Who do you think will win? Our coverage starts at 4 p.m."}]
