[{"comment_id":"891951477509756","commenter_b":"Hang the jihadi cunt for spawning the 2 Hajis. She is just as guilty!","commenter_a":"Can you fit two in the gas chamber?","post_message":"The apple doesn't fall far from the tree."},{"comment_id":"538334903023756","commenter_b":"Yes....throw her ass in jail.","commenter_a":"That's what happens when you engage you mouth before your brain","post_message":"The Baltimore prosecutor is about to go down in flames after this.  She is a criminal, just like the rest of them.  Do you agree she should serve time?"},{"comment_id":"10152908001254071","commenter_b":"Women's sports don't even count","commenter_a":"#Webelieve","post_message":"A massive blow for the U.s. women's soccer team."},{"comment_id":"10153981518484749","commenter_b":"These drivers are trespassing on private property. The property owner is 100% within her rights to report each trespasser to the police and have their cars towed.","commenter_a":"why not have it towed? make a deal with a local tow company and get a commission off each car towed from your driveway","post_message":"\"Happy digging, at least it's not raining.\""},{"comment_id":"1195945367091729","commenter_b":"Totally unacceptable. They should be arrested. Deport. Send them back to their country. Can u imagine what they would do if we destroyed their Quaran?","commenter_a":"Kick them out of our country now they do not need to be here","post_message":""},{"comment_id":"10154099189924071","commenter_b":"Killary is an Embarrassment ,she evidently has no idea how to run an office Legally or with Class. What she poured into this election was ill gotten money. She sure didn't use her own. I Honestly feel her major Dissapointment is her self absorbed issues that would have only added more money to the Clintons Fraudulent Foundation . Being a Great Nation is now much more attainable without corrupt Killary and the rest of her lackeys.","commenter_a":"Wow. So much hate on these posts. I hear a lot of people upset about the protests going after she lost but it seems like there are just as many sore winners out there. Whether you like her or not, people need to learn some respect. I guarantee 99.9% of the people on here haven't the foggiest idea what it takes to hold a high ranking position in our government or run for president. She poured a lot of time and effort into her campaign and to still come up short must be a major disappointment. I'm sure a lot of people have done less and been more hurt by their own failures. I thought this was a country of conscience and good will. This election has proved we are much further from being a great nation than we claim.","post_message":"“I know that over the past week a lot of people have asked themselves if America is the country we thought it was.\""},{"comment_id":"693090104129406","commenter_b":"she is a fraud... she was a mecanic in a motor pool","commenter_a":"You go girl!!!","post_message":"One way activists in the United States are supporting an end to poaching is by enlisting retired vets to take part in an organization that puts their years of combat training to work overseas."}]
