[{"comment_id":"1008939885848662","commenter_b":"Thank you.","commenter_a":"I hate ghetto ratchet ignorant hood people. Their lives are so mediocre they literally just take up space and resources.","post_message":"The disrespect!"},{"comment_id":"726130267546926","commenter_b":"Bitch go make me a sandwich hold the mustard.","commenter_a":"I love how a bunch of \"men\" feel so threatened by strong women!!!!","post_message":"Demonstrations took place in England, Ireland, the Netherlands, Italy, Kenya, Mexico, Canada, Brazil, the United States, Australia and many other countries."},{"comment_id":"989708387731249","commenter_b":"Are these women that butt ugly they need to completely cover up","commenter_a":"The people that thinks this is right need to wake up","post_message":"NO Sharia in America!"},{"comment_id":"1056321874481529","commenter_b":"Why don't you purify yourself in the waters of Lake Minnetonka?\"","commenter_a":"All lives matter","post_message":"Hillary Clinton and Donald Trump face off now in the first presidential debate of the 2016 campaign:"},{"comment_id":"10155297533295294","commenter_b":"What about mature women ??","commenter_a":"Tina, No not customers. How the company treats its employees. It might just be the local HD.","post_message":"Veterans, retirees and college students are strongly encouraged to apply."},{"comment_id":"10153227271719228","commenter_b":"If she didn't go to the hospital another couple hours she would have been gone cuz it would have went to her heart it was that close to her heart they caught it in time","commenter_a":"The exact same thing happened to my daughter they went in a Lana ectomy scraped her spinal cord put her in a coma for 2 weeks it took her 2 months to learn how to walk again but she is walking again","post_message":"Her body started to go numb and she lost feeling in her legs."},{"comment_id":"10154051866134087","commenter_b":"His bitch better get ready to be deported and come here the right way","commenter_a":"fuck you ass","post_message":"Trump says maybe his deportation task force will be able to deport Clinton. READ MORE: @webpagelink"}]
