[{"comment_id":"562921477245254","commenter_b":"I'm so sick of that self-righteous hateful woman.","commenter_a":"Are we surprised? She's just reminding us all what a thin skinned vindictive man Trump is.","post_message":"That didn't take long. Not even a week has passed, and the president elect's team is already warning Trump critics to be \"careful\" about the way they criticize Trump."},{"comment_id":"1422900164405547","commenter_b":"My integrity will not allow such a travesty. She is a war monger.","commenter_a":"We can't , CANNOT, be punitive at this time in history and not vote for Clinton. I KNOW Bernie would have been a WAY better President, but I will hold my nose and vote for Clinton.","post_message":"I don't know if it's a world record but Donald Trump has been sued more than 3,500 times over the past 30 years. This isn't someone who should be president."},{"comment_id":"10154000261646337","commenter_b":"Tiny Fey and Amy Poehler would so destroy you right now with words of girl power and women unitedness. #Womanizer","commenter_a":"#BETsoBlack am I doing this right or nah?","post_message":"'IT'S A REGRESSION': Will Smith stays positive about the #Oscars and Hollywood's bigger problem with diversity..."},{"comment_id":"480665305471830","commenter_b":"Dumb, ignorant witch","commenter_a":"Speaking of frauds!! Having a convicted felon as your top surrogate makes me wanna puke. She is spewing lies on every network, when is this P.O.S. going to be held accountable?#KatrinaPierson","post_message":"YES!"},{"comment_id":"1736127839964656","commenter_b":"Maybe she should be mad at the powers to be who wanted it kept quiet.","commenter_a":"Maybe tptb should have done thing differently but since it all came out kelly has been a spoiled hateful spiteful bitch. If tomorrow is his last day I hope puts her on blast through the entire show.","post_message":"She’s reportedly not making things easy for him."},{"comment_id":"10153572022092293","commenter_b":"We should see this McKenzie","commenter_a":"@username ayoooo","post_message":"The Witch is a must-see for any horror fan -- just be ready to be creeped out."},{"comment_id":"957903450911743","commenter_b":"Muslims are still using the jiihad to increase their power and stupid European leaders are letting it happen.","commenter_a":"LanceBell fox loves you","post_message":"Spread this everywhere:"}]
