[{"comment_id":"10153080407966323","commenter_b":"No but seriously why the hell would a girl shave their face...?","commenter_a":"Um I've shaved my face for like 6 years and had no issues.. hair getting thicker from shaving is a myth.. the reason people think that is because hair tapers to a tip and when you shave that tip off the hair seems thicker.. but its not.. it's just the end of the hair and it has always been that size","post_message":"Is it a terrible idea for women to shave their faces? Yes, yes it is."},{"comment_id":"396542397200035","commenter_b":"And that's why Racism is continuing on!","commenter_a":"RACISM IS ALIVE AND WELL! However, I DON'T CARE. PEOPLE OF COLOR ARE MOVING UP! YEP! Moving on up. 👍👍🇺🇸😛","post_message":"One of the most dangerous myths about hatred of black people is that it will disappear on its own. Dylann Roof was born in 1994."},{"comment_id":"1008103192579543","commenter_b":"For those of you @username fans, I am posting this article to show the evils of this woman and why you should not vote for her. @webpagelink","commenter_a":"Hillery for prison in 2016","post_message":"\"As a South Carolinian, an African American man, and a father, I can't stop asking myself once again: Where does my community go from here?\" Clay Middleton, Hillary for South Carolina State Director, on the #AssaultAtSpringValleyHigh."},{"comment_id":"388912451508467","commenter_b":"This woman won't win the next election.","commenter_a":"Tankes sister","post_message":"Angela Merkel: 'Islam is not the source of terrorism'. Merkel spoke at the Munich Security Conference about why cooperating with predominantly Muslim states is vital."},{"comment_id":"1168639523214582","commenter_b":"Just another paid for asshole who got caught with his dick in his mouth. Now disbar this worthless piece of shit and scum.","commenter_a":"You cannot believe the media at all they're just liars liars and Liars and they make up s*** and tell it like it's real you can't believe nothing they say think or do and as far as thinking I think they're incapable of thinking anything they're being paid to Railroad this guy and they're going to do it for the money","post_message":"The judge in Donald J. Trump's Trump University case was just HUMILIATED... here's why he just had to undo his own ruling. This shows exactly why he shouldn't be on this case... it's time for him to recuse himself."},{"comment_id":"10153424220937106","commenter_b":"If it happened in my county, I'd make the complaint myself and have no problem with people putting one in their yards, on their business , our at their church. It just doesn't belong on government property.","commenter_a":"Would be interesting to know if the person who contacted the anti God group has neighbors with these signs in their yard! Can only hope!!","post_message":"It is outrageous that some would aim to divide a community over a banner that has been proudly displayed since Sept. 11, 2001. I commend the Pittsburg community for rejecting this decision and I stand with them. The Constitution guarantees a right to freedom of religion, not freedom from religion. This banner is not only an expression of faith, but of love for country. Expressions of patriotism, faith, and community should be welcome in our society and I have contacted USPS officials to express my concerns about their decision and to request their reconsideration. If the local post office branch is unwilling to display the banner, then I would be proud to hang it at my own office in Pittsburg."},{"comment_id":"10154151138320399","commenter_b":"muhammad ali was a muslim. karreem abdul jabbar is a muslim. the rw always misses that.","commenter_a":"So what's wrong to be a Muslim? Is being a Muslim evil and being an evangelical Christian holy? Republicans are bunch of hypocrites. Very discriminatory and hateful bunch of bigots.","post_message":"He made his name as a Calvin Klein model and actor on \"General Hospital.\""}]
