[{"comment_id":"10153918436462619","commenter_b":"God have mercy on those who hate","commenter_a":"Revenge is mine says the Lord!! Definitely a different God!!","post_message":"An Islamic State terrorist praised Wednesday's attack on Charlie Hebdo, telling Reuters the attack was revenge for insults against Islam."},{"comment_id":"717976815002166","commenter_b":"Did you read what I said? Or did I lose you after ESPN? By law, you cannot force someone to give up their body, body parts, body tissue to ANYONE, regardless of their life being in danger. So you can't force a woman to give up her body and blood and essence to someone who you've notably identified as a completely other person. And ps, bananas also have their own DNA. Oh shit looks like we can't eat fruit.","commenter_a":"I read Planned Parenthood does 30% of all abortions. Who is doing the rest of them?","post_message":"Appalling on every level. THEY MUST BE STOPPED!"},{"comment_id":"1056445444376466","commenter_b":"Happy International Women's day.","commenter_a":"A woman got recognition in the late 1800s? Wasn't the womans rights movement kind of non existent at that point? Wouldn't she have just been laughed out by any male doctor of the era without a chance to prove herself","post_message":"#womenyoushouldhaveheardof"},{"comment_id":"10153526773721350","commenter_b":"Those hips are MALE hips!","commenter_a":"She look so stunning & beautiful tonight","post_message":"Caitlyn Jenner shared some very powerful words from the podium."},{"comment_id":"991088854247496","commenter_b":"It's about time we had somebody who will stand up and speak the truth!","commenter_a":"Who determines what is Polically Correct? The liberals trying to manage free speech.","post_message":"WATCH: The Donald gets into a heated exchanged with a member of the PC police at press conference."},{"comment_id":"10154589153096336","commenter_b":"The only place Hillary should be is in prison! #trump2016","commenter_a":"MAY HAVE???????","post_message":"Newly released emails suggest a senior Hillary Clinton aide stage-managed her first hearing on Benghazi by feeding specific topics to Democratic Senator Robert Menendez. @webpagelink"},{"comment_id":"10153689413136336","commenter_b":"Because 1471717696187557gallathat is not how God works in a church. If the pastor is wrong God will deal with him, it's not her place to do that. @username we don't know if he spoke to her privately & just because he rebuked her behavior doesn't mean it wasn't in love or that he doesn't love her. She may truly have been disrupting the services. God rebuked the behavior of many in the bible. The bible also says that God disciplines those he loves. No pastor is going to be able to preach in a way that makes everyone happy & making people happy isn't part of his job. He's supposed to preach the truth of God's word without compromise. His delivery can change, but the truth cannot.","commenter_a":"What kind of pastor throws out a 103 year old woman? Not even non-Christians would do this to an elderly woman. Madness. They hate her for believing the same doctrine that she learned at that church every Sunday for a century. The bible charges Christians to take care of the elderly and the widowed.","post_message":"Genora Biggs said that she and the current pastor, Rev. Tim Mattox, have long sparred over his form of preaching, which she characterizes as a 'Holiness style' that doesn't belong in the Baptist church."}]
