[{"comment_id":"867191473393219","commenter_b":"@username illegal. Get ready to be deported or just leave. Leech","commenter_a":"I am not even American, i live in New Zealand and i support @username. Long before Trump ran for president i believed he is the man for the job. Smart, strong, dedicated and beyond all else brave enough to stand up for his vision and commitment, if anyone has what it takes to make change for the better it is Donald Trump. From all the way here in New Zealand - i have confidence in Donald Trump to clean up and create change. THANK YOU!","post_message":"Thank you FLORIDA! #VoteTrump on March 15th! #MakeAmericaGreatAgain"},{"comment_id":"10153753103761037","commenter_b":"@username tell me that in 12 months... no Bernie, no Trump, no Clinton and no JEB... then who's left? Let's talk again when there's only days left of this nonsense.","commenter_a":"Jim Webb won this debate: he got more exposure out of the media tonight than he has had since he began his candidacy. Compared to Clinton he looks honorable, compared to Sanders he looks responsible. Since those two are the media darlings, those are the only two he needs to be compared to until he can get out of single digit polls. If any of those candidates expect to get moderate Independent and Republican voters next fall, they need Webb on the ticket… unless Trump manages to stay in the race.","post_message":"Bernie Sanders defends his record on guns after Hillary Clinton pounces. #DemDebate"},{"comment_id":"709686039165167","commenter_b":"@username Illegals don't have insurance.","commenter_a":"Norway has a single payer health system as does every other civilized country in the world but us. Get insurance companies out of the middle of my health care. They jack up the prices on everything, not just drugs. UPDATE: every other civilized country has either single payer or two-tier system. I included a link below. Scroll down.","post_message":"U.S. drug prices are higher for 93% of 40 top branded drugs compared to Norway. That is unacceptable. We should use our buying power to get better deals for the American people."},{"comment_id":"10154125640609071","commenter_b":"Success is subjective. I'm fairly certain her and her family would be happier if neither of them worked so hard at their music careers.","commenter_a":"Why would you put front and center a couple that hates police officers and deals drugs? great role models you morons.","post_message":"“You have the same number of hours in the day as Beyoncé.”"},{"comment_id":"1201199053280181","commenter_b":"For them girls that gotta get from one dick to the next real quick😭😭😂","commenter_a":"Rebecca oh lawwwd no😭😂","post_message":" "},{"comment_id":"10153672504893812","commenter_b":"Demonstrators showing their ignorance.","commenter_a":"Jade helm time to test what you got","post_message":"JUST IN: State of emergency declared in St. Louis County due to Ferguson unrest: @webpagelink"},{"comment_id":"1673236709627945","commenter_b":"I can't stand this big eared liar!","commenter_a":"Bull crap! You say that federal background checks don't work when it relates to gun control but when it relates to checking refugees you say it does so apparently it only works when you are telling the public lies to get what you want = pitiful","post_message":"\"Any refugee coming to the United States, some of them victims of terrorism themselves, will continue to get the most intensive scrutiny of any arrival.\"  After meeting with his national security team, President Barack Obama said that \"our intelligence and counterterrorism professionals do not have any specific and credible information about an attack on the homeland,\" but that \"we have to be vigilant.\""}]
