[{"comment_id":"10154704030031323","commenter_b":"@username Or you could just admit that you are fundamentally incorrect. That would be the mature thing to do here. You can't just use the serious topic of misogyny and sexism as an argument whenever you like. It plays a great disservice to the genuine areas where such a discourse is absolutely valid. This is about holding a proven heavily corrupted, belligerent war-mongerer to account, who happens to be a woman. End of story.","commenter_a":"Sorry Guardian, but no one actually buys the 'its because she's a woman' argument when it comes to Clinton. There are actually legitimate reasons why many do not like her. You're wasting your time.","post_message":"\"Hillary Clinton irritates people not just because of her gender, but because we simply can’t process her narrative. There are no stories that prepare us for her trajectory through life and, therefore, we react to her as if she’s a disruption in our reality, rather than a person. We love public women best when they are losers, when they’re humiliated, defeated, or (in some instances) just plain killed. Yet Clinton, despite the disapproval that rains down on her, continues to go out there and chalk up wins.\""},{"comment_id":"1230732883614387","commenter_b":"Well, since they found a genetic marker for homosexuality that automatically means that the same genetic marker influenes heterosexuality.","commenter_a":"No specific gene links heterosexual people and the preferred gender of their partners, and I'm fairly certain the same goes for gay people.","post_message":"The science of homosexuality."},{"comment_id":"1016566111717194","commenter_b":"What a fucking hypocritic Bitch.","commenter_a":"Please don't accuse her for stealing a flag. She needed one to wear for a photo shoot to feel nostalgic about a time when she was a playmate.","post_message":"An enraged conservative attempted to steal an American flag from African-American protesters and fought with police, but was not arrested...at a demonstration regarding white privilege."},{"comment_id":"590256634486210","commenter_b":"Haha america was never great and with you or Hilary as our president it will continue to never be great !","commenter_a":" Vote strong Vote Trump","post_message":"This is only the beginning. Hillary is CROOKED! She is not capable of making America great again. Sadly, she would do the opposite."},{"comment_id":"1304158649677186","commenter_b":"Pretty woman with a dirty mouth, ,, Perfect Clinton supporter","commenter_a":"Trump had this election stolen. He rigged it. He tampered with an election. That is punishable by law. Why isn't he being prosecuted? His evidence is on his computer. Why haven't they confiscated that and checked it out? This is a joke!! This whole voting system is a scam. We the people have no rights in our voting. Trump was right. It is rigged...in his favor!","post_message":"This is a must read for every disappointed Democrat."},{"comment_id":"1090355681009413","commenter_b":"IT'S CALLED CORPORATE WELFARE , and it's been going on for way tooooooo long , and it needs to STOP !!!!!!!!!!","commenter_a":"the republican way","post_message":"Congress continues to let billionaires slide and pats the back of the wealthy while every day Americans suffer. Sign your name to help raise the minimum wage →   @webpagelink  (Hat tip to The Other 98%"},{"comment_id":"10153072554446037","commenter_b":"Feed her to the hogs","commenter_a":"Bye bye","post_message":"#Jordan will execute Wednesday a woman on death row over a failed bombing after the government vowed to avenge the murder of a pilot by the #IslamicState group, an official said."}]
