[{"comment_id":"10153239073114087","commenter_b":"Becky, you ignorant slut.","commenter_a":"Why is the fact shes a woman the issue? This kind of rhetoric just signals their hypocrisy, in one breath decrying sexism and then in the next taking advantage of it.","post_message":"\"I first would like to register my opposition and my objection to the chairman beating up on a woman, on our witness today, for making a good salary,\" Rep. Carolyn Maloney at today's Planned Parenthood hearing. \"The entire time I've been in Congress, I've never seen a witness beaten up and questioned about their salary. Ms. [Cecile Richards] heads a distinguished organization providing health care services to millions of Americans. I find it totally inappropriate and discriminatory.\""},{"comment_id":"1840806586176177","commenter_b":"Will someone get this dumb bitch to shut up. let her crawl back into the hole she came from","commenter_a":"And I believe Conway has four children.","post_message":"Apparently the Trump team still thinks it's 1955."},{"comment_id":"1923069711254227","commenter_b":"so far 1.5 million people have liked my last comment PERIOD!!!","commenter_a":"My gawd it's an immigrant disrespecting the flag! Shouldn't O'Reilly and Hannity be all over this? Lqtm","post_message":"Oh, how they would SCREAM!  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"914685108573277","commenter_b":"Speaking of the specter of 72 virgins...I wonder if the aforementioned knuckleheads ever consider whether those promised virgins are male or female?","commenter_a":"Take off and landing from a carrier is inherently very dangerous. Glad the rescue folks did their job successfully as trained. Go Navy!","post_message":"The US Navy says one of its fighter jets has crashed shortly after launching from an aircraft carrier in the Persian Gulf."},{"comment_id":"639140816274210","commenter_b":"Just like your whore mother.","commenter_a":"She is a pig.","post_message":"I am sick and tired of Michelle Obama and her family in the White House...GET OUT!"},{"comment_id":"1334233936596633","commenter_b":"The wall goes up. No more cowardly Muslims in the White House. We've had enough","commenter_a":"Go ahead and lock up the nomination. It's irrelevant. There isn't going to be a Republican in the White House next year.","post_message":"Today's vote could decide whether Donald J. Trump will lock up the nomination outright."},{"comment_id":"10153428454984087","commenter_b":"She is the biggest liar in history ,ashamed she was the first female to prove it.. Disgraceful bitch.","commenter_a":"Go go go >3","post_message":"\"Do you believe that The State Department, on NEW YEAR'S EVE, just released more of Hillary's e-mails,\" Donald J. Trump tweeted. \"They just want it all to end. BAD!\""}]
