[{"comment_id":"10153312021701756","commenter_b":"Please Sharon, share sources of actual statistics/studies for this belief. Thanks.","commenter_a":"How about environmental impact? How about helping ourselves? It seems apparent to me that most people truly do not care about animal welfare.","post_message":"Three activists, three answers on how veganism — or vegetarianism, or even just cutting way back on meat consumption — can actually make an impact for animals, and for global inequality."},{"comment_id":"667865053404073","commenter_b":"No! She's a witch and that's her night out!","commenter_a":"She's a joke!!","post_message":"Michelle Obama wants to destroy Halloween for kids across America. There is no chance that we will let her take Halloween away from our kids. Do you think Michelle Obama is a joke?"},{"comment_id":"10153163546666336","commenter_b":"I bet those racist pigs were cheering.","commenter_a":"I guess Al Sharpton and Jessie Jackson missed this news story...","post_message":"UPDATE: A third man has been charged with sexually assaulting a woman during spring break in Panama City Beach, Florida, that was captured on cellphone video, authorities said."},{"comment_id":"10152850999936813","commenter_b":"One thing that strikes me is how people obsess with the LGBT. For some reason it's \"all the Gay's fault\". If only we could get rid of them, all our world's social problems will be solved. NOTICE: YOU DO NOT SEE SIGNS SAYING: \"ADULTERERS/CHEATERS, WIFE BEATERS, ADDICTS, RAPISTS, CHILD MOLESTERS, LIARS, THIEVES, TERRORISTS, CORRUPT POLITICIANS & PASTORS WILL NOT BE SERVED OR ARE NOT WELCOME IN THIS STORE\". NONE! It's always the Gays....","commenter_a":"Actually let small businesses post these types of signs. This tells me to take my dollars elsewhere!","post_message":"Tennessee hardware store owner hangs a “no gays” sign in the front window. It's 2015, not the 1950's. @webpagelink"},{"comment_id":"1047357948654067","commenter_b":"Hopefully your girls won't grow up to be ignorant fools like you.","commenter_a":"While watching this video my four year old daughter asked, \"Who is that?\" I answered, \"@username, hopefully the first woman president.\" To that she replied, \"I love her. She's beautiful. I like her necklace.\" Can't wait for you to shatter that glass ceiling for my girls!","post_message":"An expectant mother in Iowa asked: What are your plans for parental and maternity leave?"},{"comment_id":"10152762818573635","commenter_b":"And little girls whose only purpose is to bear little boys?","commenter_a":"The world needs little b o y s to become husbands, fathers, governors, farmers, presidents, and the righteous church leaders who exalt Jesus Christ \"who o n l y\" was crucified for world sin, and to whom only we bow and worship.","post_message":"\"The choice to not have children is selfish. Life rejuvenates and acquires energy when it multiplies: It is enriched, not impoverished! Children learn to take charge of their family, they mature in the sharing of sacrifices, and they grow in appreciation of its gifts.\""},{"comment_id":"10153267785502894","commenter_b":"Lol I knew I was gonna get somebody! Yes it does and that's why being faithful and protecting ourselves is so important! It's too many fake porn stars out here...","commenter_a":"I bet too many thots out here having unprotected sex 😏","post_message":"STD Rates Have Hit a Record High in the United States"}]
