[{"comment_id":"10153956190753797","commenter_b":"She better go to juvenile....period.","commenter_a":"those other kids should be charged also for not stopping it and cheering it on! makes me sick!","post_message":"UPDATE:  Last week, a controversial video went viral that shows a 3-year-old child being dragged and beaten by two young girls. Over the weekend, officials identified the girl and brought her in to custody. The shocking details involving the attack, here:"},{"comment_id":"10155932451330206","commenter_b":"Don't you think it's time for a woman President!","commenter_a":"Did you catch her phony southern accent from that speech she gave? Just more proof that nothing about her is real.","post_message":"Are you ready to beat Hillary? Join the team that can win in 2016."},{"comment_id":"1101197406562586","commenter_b":"wheredid they dig these women up she does not know what she is doing..she mite as well givr the city to the thugs, disarm the police and go home and take a nap","commenter_a":"Burn it","post_message":"There are people openly worrying if Mosby's case fails, if Baltimore will burn to the ground."},{"comment_id":"1164964563593106","commenter_b":"I saw them at Riverside too! I remember crying lol","commenter_a":"@username remember Riverside lol","post_message":"This is Paula first time on tour in 25 years!"},{"comment_id":"10155379093015354","commenter_b":"This is why we need to deport these criminals. The illegal aliens are all criminals. They broke the law and came into our country uninvited. Deport them.","commenter_a":"obozo lied and innocent people died. Any questions? Criminal aliens are WMDs. How many must die before obozo and his minions are held accountable?","post_message":"This story has it all."},{"comment_id":"1248101021932790","commenter_b":"ALL CiTIZENS in this country have ID, ALL of them. so STFU about ID laws, only the corrupt want them","commenter_a":"Only clueless and the corrupt don't want voter id laws, REAL citizens WANT them as they stop the DEAD, non citizens and people voting multiple times. All of which are the exclusive territory of the left and the Dems.","post_message":"Dem Strategist Blames Hillary's Wisconsin Loss on Voter ID Laws [VIDEO]"},{"comment_id":"10153484658844060","commenter_b":"Let me clue you in on something: just saying \"I won, you lost\" doesn't make it so. In the adult world, you must present logic, facts and empirical evidence, which I did. Which enables me to say \"I win, you lose.\" It's ludicrous to even debate about how badly CA has done over the past 20 years due to liberal socialist policies. They're more in debt than most third world countries. Jobs and people are fleeing the state and illegal immigrants are destroying CA. I'd no more debate this than 2 +2 = 5. In summary, you're not only a loser but a leftist idiot. Ciao stronzo.","commenter_a":"America is the same. Some strong states like CA and some very weak states like SD.","post_message":"This week's KAL's cartoon @webpagelink"}]
