[{"comment_id":"1164111043641758","commenter_b":"that is not Trump8 wife","commenter_a":"Hey if you got it show it","post_message":"Liberals Attack Trump Family After Sexy Photos Of Ivanka Trump Leak. Let's show her our support. Do you stand behind the Trump family?"},{"comment_id":"1507272636242022","commenter_b":"@username, that is exactly what Americans are so angry about , is our own traitorous bunches of Bureaucratic terrorists that not only has funded but brought into our own country on our own American soil, these terrorists that they somehow continue to push on the public and is why Trump stood up and heard American peoples complaint, not one politician up in that white house is a true American, or else they would have long ago removed the terrorists as well as not funded them with the peoples hard earned tax dollars, all Trump is saying is know whom we are allowing into our country, something the now Manics in the white house are not doing..","commenter_a":"Yeah Donald Trump is protecting Americans. Maybe if some of his supporters read a little about Hitler and Nazi Germany, they would see some similarities. I mean, the Jews and Communists were plotting against the Germans, right? They did start that tragic Reichstag fire, didn't they? Oh! And let's not forget the gay people and the mentally ill! America has a problem with them too! Yeah and women too. We've just gotten all uppity during the last 40 years, trying to steal men's jobs. Send us away too. And while we're at it, let's round up the Japanese again. I mean, they attacked us once, what's to stop them from doing it again? Of course, we should forget they were mostly citizens and born here! It absolutely amazes me how many people believe this!!! It's unamerican! It's dangerous. When you start sending a group of people off like that, where ...","post_message":"This is one of the most powerful segments we've ever seen. Tom Brokaw compares Donald Trump's call to bar Muslims from America to Japanese internment, Nazi Germany, McCarthyism, and Jim Crow - and he didn't stop there. This amazing video is well worth taking a moment to watch, via NBC News"},{"comment_id":"443280275797013","commenter_b":"Its not just the cops with thug goggles on. The actions of blacks in Ferguson and Baltimore do nothing but reinforce that view. Racism, disrespect of laws and common decency toward others and their possessions, just begets more of the same focussed in the opposite direction.","commenter_a":"You are so racist against white people it's not funny.","post_message":"As a news team, we are not agreeing with either side of this photo as a philosophy but sharing it for perspective and as a piece of artwork which should generate honest conversation."},{"comment_id":"10152936625961491","commenter_b":"She's as brainwashed as the rest of that family. Very sad.","commenter_a":"Why did his wife marry him? WHY????","post_message":"\"What was Duggar’s political value for Family Research Council, his moral example, has now become a cost.\""},{"comment_id":"1201416786646537","commenter_b":"Hope the heck they do. Better without their sorry butts","commenter_a":"Samuel L Jackson can stay! Lol","post_message":"These celebrities said they would leave the United States if Donald Trump became president, well he's now president."},{"comment_id":"1149894398400704","commenter_b":"Another flip flop by trump,,he once said she would be a great president,,he's pro choice,,he says he's going to deport all illegals,Obama has deported more illegals then any president & it doesn't make any difference,,they just come right back,,Hillary is the only hope we have for the average American,,","commenter_a":"Never killery","post_message":"Trump has no problem with the idea of having a female president in America -- as long as it isn't Hillary Clinton. Do you feel the same way?"},{"comment_id":"1255582551128439","commenter_b":"@username No that shooter was a Mentally Challenged person . Most of the MASS SHOOTERS have been Mentally Challenged. You ask why are they allowed to roam the streets? Well, they took the money to contain and treat them and gave to to the unwed mother to have 20 kids with and to provide Food Stamps. DO NOT under estimate the challenged ones. Some are very smart and great at solving problems. They just can't function in society.","commenter_a":"Here's what we now so far: Syed Farook and Tashfeen Malik met in Saudi Arabia. Farook was described as a devoutly religious Muslim (most likely Sunni). The third suspect, Tayyeep Bin Ardogan, is a 28-year-old native of Qatar. Only Farook was employed by the agency hosting the Christmas party. Multiple explosive devices were discovered at the scene of the massacre. IEDs (improvised explosive devices) are illegal in the State of California. IEDs take time to build. Obviously, there was some planning involved. IEDs are mass-casualty weapons that kill indiscriminately. They're not something you use when you're concerned about casualty mitigation and innocent bystanders. A coworker stated that Farook had grown out his beard over the last several months. The geniuses in the DOJ (namely the FBI) are trying to ascertain a motive. That's nice. Let's see how long it takes them to put the pieces together.","post_message":"The suspects in the San Bernardino shooting were armed with four guns and an explosive device in a \"well-planned\" attack, officials said."}]
