[{"comment_id":"10153932824095575","commenter_b":"If you have bones in your closet be sure they will come out.","commenter_a":"BS alert!","post_message":"National Enquirer parent company refutes Ted Cruz--- DONALD TRUMP had nothing to do with our story...."},{"comment_id":"10154384594879705","commenter_b":"@username which of these girls is overweight? What weight should girls be according to you Bill?","commenter_a":"Ten bucks says that all the people saying they're disgusted are the same people who get pissed when someone calls a thin girl 'too thin' because apparently body positivity is only for bodies YOU feel positive about. Right.","post_message":"No photoshop, no frills."},{"comment_id":"10154062164657042","commenter_b":"Let's dip her legs","commenter_a":"Poor baby,, how can she be such a horrible person,, well prison will be her first hell, then when she die, her other REAL HELL IS WAITING FOR HER,, she have no place in heaven .","post_message":"A child has died after his stepmother dipped his legs into scalding hot water."},{"comment_id":"10154314532254218","commenter_b":"Gee thank you,I haven't heard anything about Freddie Grey for at least 10 mlnutes!!","commenter_a":"She's a joke... Disgrace to Maryland","post_message":"The trials of the six Baltimore City police officers charged in the police in-custody death of Freddie Gray are still ongoing."},{"comment_id":"10153837028166130","commenter_b":"I have a right NOT to have a gender confused individual peeing next to me ! What about MY rights as an average Joe peeing in \"comfort\" like I have my entire life . Yes, peeing next to a drag queen is disturbing - no difference in my mind .","commenter_a":"For all you folks who think people just wake up and decide to become a different gender just to be a pervert - think about this: why would anyone want to put themselves through all of that ...hormones, family dynamics, ridicule from idiots, discrimination? Just for fun? Because they are some sort of sexual deviant? For all of you who say women should be women and men should be men because that's what God created...he created us all as individuals with our own thoughts and feelings - and yes, he even created those who feel trapped in the wrong body. Respect people for who they are, not where they came from, or who they become. Discrimination disgusts me.","post_message":"Yep, this pretty much says it all."},{"comment_id":"965589516846855","commenter_b":"Rubbish. MUSLIMS are 90%terrorist","commenter_a":"If someone calls themselves a Christian and then goes and shoots people at a movie theatre, are you going to then say all Christians are bad? The thing is, all Muslims are not terrorists. My fiance is a Muslim his family are Muslim but they are not terrorists. Why should he have to wear a badge and be watched when he did absolutely nothing. Terrorists do not have a religion they don't have a \"look\" anyone can be a terrorist and saying we should badge all Muslims is just plain hate.","post_message":"\"Being Muslim doesn't make me any less American than you are,\" she wrote in a letter to Donald J. Trump that's now gone viral."},{"comment_id":"1032286876827841","commenter_b":"Yes most LEGAL immigrants do but not the illegal invaders.","commenter_a":"Immigrants pay more taxes and work harder than SOME AMERICANS.... i know some","post_message":"Most Americans agree: We must provide a path to citizenship for our immigrant families."}]
