[{"comment_id":"1344780435541174","commenter_b":"Yes For Hillary!!!!!!","commenter_a":"Vote Hillary","post_message":"Watch: Hallie Jackson gives a special preview of what's to come on #ElectionDay from NBC News HQ in New York! Full coverage all day: @webpagelink"},{"comment_id":"1252245104845317","commenter_b":"So sad, the Hispanic ladies had more class then the racist. Also sad no one had the courage to stand up to her!!","commenter_a":"That's messed up. She forgot that U.S has the freedom of language","post_message":"This racist woman went off on two Hispanic shoppers with a racist rant and no one did anything to stop her. More on this story here: @webpagelink"},{"comment_id":"1028975063831277","commenter_b":"That lady has no clue","commenter_a":"What was the criminal background of the one shot in chicago by the cop? Just wondering. Did we get rid of an upstanding future physisist, doctor, or a career criminal who's career was cut short? Just wondering !","post_message":"OUTRAGEOUS: Chicago Thug Executes 9-Year-Old Boy Point Blank In The Head, Black Community SILENT! (VIDEO) They won't protest this child killer, but will protest a cop who shot and killed a thug! SICKENING! Share this if you're sick of these people and their bigotry! FOLLOW OUR PAGE---> Freedom Daily @webpagelink"},{"comment_id":"806970826068192","commenter_b":"shes a scum and should of been executed","commenter_a":"20 years later omg you mean this scum is not dead yet?","post_message":"\"I was a good mother and I loved my boys.\""},{"comment_id":"10153851464823352","commenter_b":"Exactly!! Like why just because we are together do we need to have sex alllll the time. Some women dont need nor want sex alll the time and men never will understand. We work we clean we cook and we do everything else. Why do i need to be having sex all the time or (excuse my French) giving u oral. NO","commenter_a":"Never deny your husband sex or he will cheat and watch porn don't make laugh sometimes us mother's are exhausted from parenthood and just don't feel like it if he loved her he would accept and understand that... porn isn't a issue it's just a made up fantasy world with men and women drugged up to their eyeballs to do shit they don't even enjoy and fake quite hilarious orgasms maybe he should appreciate his wife to ...","post_message":"Anna Duggar ‘partially blames herself’ for husband Josh cheating and using porn – while her mother-in-law Michelle’s top marriage tip is to NOT deny your spouse sex"},{"comment_id":"10156504920260389","commenter_b":"Yes. Keep replying on this joke of a feed.","commenter_a":"Do we expect Sheriff Clarke to say anything different. Why doesn't Mr. Hannity ever have some real dialogue on his show. I would have more respect for him. I have been following Mr. Hannity for about 10 years now. His revolution is taking forever. I don't think it will ever come. if Mr. Trump is elected is that the revolution. Senator Cruz is the only true Conservative. But in today's world conservatism means unyielding which is not a good thing. President Reagan would be turning over in his grave if he saw what was happening to the conservative movement in our country today","post_message":"Milwaukee County Sheriff David A. Clarke Jr. had some strong words on \"Hannity\" tonight for President Obama, Hillary Clinton and the Democratic Party in the wake of Obama announcing his planned executive action on gun control."},{"comment_id":"10154944401159641","commenter_b":"Build your 100ft wall and I'll show you the 100 ft ladder what a waste of tax payer dollars America your Fired!","commenter_a":"Mexico needs the US more than we need them- they will pay- one way or another- leverage is a powerful tool and Mexico doesn't have a leg to stand on","post_message":"JUST IN: President Donald J. Trump says construction on a US-Mexico border wall will begin \"as soon as we can” adding that US taxpayers would foot the bill initially, but Mexico will eventually provide reimbursement funds @webpagelink"}]
