[{"comment_id":"543880552475480","commenter_b":"Let a family move in with you. We The People are tired of paying high taxes for to pave a way for illegal aliens from any country while our veterans are living in the streets and receiving poor healthcare.","commenter_a":"These people shouldn't be here anyways. I am all for the people that are here illegally staying and becoming residents. Most of these people just want a better life for their kids and they are productive, hard working members of society","post_message":"THIS JUST IN: Donald J. Trump in his first post-election interview said he's willing to deport or incarcerate 2-3 million people in the country illegally who \"are criminal and have criminal records...\""},{"comment_id":"10153882831009714","commenter_b":"The same reason why men need viagra...","commenter_a":"No pregnancy is a choice and it doesn't deserve any special treatment. Women have been pregnant for as long as time and they didn't need special parking, so why do they need them now.","post_message":"What do you think?"},{"comment_id":"10154964993289411","commenter_b":"What have they to complain about the weather in Greece is lovely.","commenter_a":"pablo escobar ?","post_message":"LIVE: Protesters rally in Athens to honor memory of teen killed by police COURTESY: Ruptly"},{"comment_id":"447409202129260","commenter_b":"She is the best candidate!","commenter_a":"Dear God deliver us from this evil!","post_message":"Slap Yo'self! www.eaglerising.com"},{"comment_id":"10158117739325594","commenter_b":"Don't worry Stacey, I will be wearing leggings to your baby shower. Those count as pants, right?","commenter_a":"@username, @username, Elena Fraga","post_message":"Groups of people arrive at the Powell Street station — without pants — as part of the \"No Pants Subway Ride\" event. Read the full story: @webpagelink"},{"comment_id":"1565531100423273","commenter_b":"WoW... I have never been to the USA, but i fear already for the Afro-americans living there now, after reading this comment (n)","commenter_a":"The ones the cops shoot, is because hey are criminals. Felons with weapons. Threatening others and getting the police called on them. All the others, is just fightin and being dumbasses. White people do that do. White felons and criminals get shot too. But since they are white, no one cares to make a news story.","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"10153099385609255","commenter_b":"Of course there is climate change. It's been jumping around forever.","commenter_a":"The animals are a bit smarter than the scientists and they live in the weather not a lab","post_message":"Happy Groundhog Day—here's to six more weeks of winter. Thanks to Believing in imaginary friends and fairy tales is outside of my age bracket for sharing."}]
