[{"comment_id":"10152895452606051","commenter_b":"BANG! But since that didn't happen, 'drop the soap bitch.'","commenter_a":"Coward!!! Thank God for good neighbors.","post_message":"This man grabbed a woman and began raping her. That's when a group of Good Samaritans heard her screams."},{"comment_id":"10153666561423984","commenter_b":"She doesn't know her ass from a hole in the ground.Correction,she know what her ass is huge.","commenter_a":"Kardashian doesn't have the brain capacity to make those decisions and you better believe Kanye has security we don't have. Go live in the hood, kimmie, and then you can tell us how to protect ourselves.","post_message":"BOOM! Kim K thought she'd talk about gun control laws, and it immediately blew up in her face.   Do you support gun rights in America?"},{"comment_id":"10153010443401336","commenter_b":"I bet you don't even know what a p value is lmao.... Please don't reproduce...:)","commenter_a":"should be legal everywhere","post_message":"Possession of marijuana is no longer a crime in Alaska, but smoking it in public can lead to a $100 fine.  Should more states follow suit?"},{"comment_id":"1172394232854914","commenter_b":"Hell yes !.... Hillary !","commenter_a":"I think Trumps ego is what will make him a great president. He couldn't stand to fail. There's nothing anyone could say to make me vote for Clinton. Don't trust her-don't like her.","post_message":"Make sure you're registered to vote HERE=> vote.gov  COMMENT Below who you thought won on the issue of immigration tonight-  'Trump' or 'Hillary'"},{"comment_id":"10153201550225329","commenter_b":"I agree she thought she untied the cloak and when they pulled she realized it was not untied so it was a mistake and I doubted anyone will get blamed for it.","commenter_a":"Because of my job, I saw the Brit Awards here in the US. What people DID NOT SEE (unless you live in the UK) is the fact that she did her entire performance. She may not have been able to dance to the best of her ability because of what happened, but she made it throughout the end.","post_message":"Poor Madonna"},{"comment_id":"10154459292584138","commenter_b":"Right!!!","commenter_a":"What about bengizi, emails, her picks for judges, say goodbye to our Constitution, and gun rights, i could go on and on. Can anyone name 1 thing she has done positive for this country.....","post_message":"At CHS Field, people are casting their votes - with bobbleheads! People can 'vote' and get a bobblehead of Donald Trump or Hillary Clinton at the door. The first bobblehead to run out wins the 'Bobblection.'"},{"comment_id":"10153713644828984","commenter_b":"Yes build it. And people American people will have a job and steel prices go up. And we win!!!!!","commenter_a":"Build the wall. Put censors all along the border and give the border patrols the order to shoot any one who gets over or under the wall. Illegals will stop coming.","post_message":"Boom! Critics of Trump's border wall just got silenced in an EPIC way by The Donald himself. There's no way they can argue this one!  Do you agree with what Donald Trump just said about a border wall?"}]
