[{"comment_id":"944666172296302","commenter_b":"She's has a mental illness","commenter_a":"At this point she's coming across as delusional and totally disingenuous.","post_message":"“It means that I have really gone there with the experience in terms of being a mother with two black sons.\"  -Rachel Dolezal on being black"},{"comment_id":"428369787523578","commenter_b":"Lady if I was standing right next to you I'd slap the s*** out of you","commenter_a":"Lana Genchi","post_message":"This woman's racist rant just got her banned by the mall for life."},{"comment_id":"898217656867757","commenter_b":"That dress >>>>>","commenter_a":"She looks absolutely stunning~","post_message":"And finally Miss Viola Davis! #HTGAWM #Oscars"},{"comment_id":"10153885914416336","commenter_b":"Because of the way, they TREAT WOMEN!","commenter_a":"This woman is totally ignorant. How many Muslims live in the US? Are they all terrorists? How many such shooting have taken place in the US? Are these all terrorist acts done by Muslims? Why dont you open your eyes and find out that all these terrorists have links with Pakistan and Saudi? Why nobody dares to say where all these terrorists come from or have link with? Why do you stamps all Muslims as terrorists?","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.”  Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"1106079576120034","commenter_b":"Islam believe in cuting off heads and raping children.","commenter_a":"Ali didn't want to because it was supposedly against his religion, Islam! Not a good reason. He could have served as. Medic or in other capacities .He was not a hero. He was just an ordinary man but a good fighter . Let's not glorify him.","post_message":"\"The headlines may call him a hero for dodging the draft. But common sense calls him a hypocrite.\""},{"comment_id":"1061799393879808","commenter_b":"Poor woman","commenter_a":"Mandy O'Loughlin","post_message":"They ripped most of one woman's scalp off in a horrific 30-minute 'feeding frenzy'"},{"comment_id":"10153609535136680","commenter_b":"Rick seems to forget about that \"Well-regulated Militia\" clause that are the first words of the 2A. It doesn't mean a armed rabble.","commenter_a":"Evil and assault weapons which need to be only in the hands of trained military, not sold to any Tom, Dick or Harry.","post_message":"Rick Scott: \"Let’s remember, the Second Amendment has been around for over 200 years. It didn’t, you know, that’s not what killed innocent people. Evil killed innocent people.\""}]
