[{"comment_id":"416198871873795","commenter_b":"I think those are pictures of women there supposed to be in capes ridiculous","commenter_a":"Why do so many pictures of ISIS soldiers depict them in clothing that would be of the worst kind for combat? Might as well give them a cape.","post_message":"ISIL’s Al-Khanssaa Brigade, an all-women fighting group, says women should only leave the house to practice medicine, teach or study religion"},{"comment_id":"10154649448359369","commenter_b":"She's a disaster with poor judgement to boot","commenter_a":"I trust her judgement in situations like this! She has a better understanding how things work internationally than Trump!","post_message":"She says Donald Trump created a \"diplomatic incident.\""},{"comment_id":"10153228787618984","commenter_b":"Well he still did his job get unlicensed uninsured drivers off the streets. They are a huge reason insurance prices are so dam high. Besides Mexicans from across the boarder are becoming the majority especially in states like Arizona!! I'd vote for Sheriff Joe every day of the week and twice on Sunday.","commenter_a":"More LE needs to do that to rid America of the damn illegals","post_message":"I cannot believe he admitted this. Liberals will be giddy. He'll really need his supporters to step up now... Do you still support Sheriff Joe Arpaio?"},{"comment_id":"10154088282393145","commenter_b":"@username, if we could just have put a wall up around the DNC convention center, we'd have a great start catching many of the illegal immigrants.","commenter_a":"Didn't See any American Flags on stage or anywhere anyone else notice that I guess showing pride for our country is out the window if your a democrat","post_message":"She took some hard digs at Donald J. Trump and didn't even mention his name. What did you think of her speech?"},{"comment_id":"10157254857370354","commenter_b":"Punch that Bitch","commenter_a":"If he had a background like that, other wives would come forward. She wasn't going to get alimony...hummmm","post_message":"The latest twist..."},{"comment_id":"1486825354715718","commenter_b":"Thank you","commenter_a":"The judge then goes through the charges and dismisses the girl, to which she smugly replies, “adios!” He orders her to come back for the way she left, then increases bond for her charges from $5,000 to $10,000. “Are you serious?” the girl asks angrily, before saying “f-- you!” to the judge and storming off. She is then ordered to return again, and the judge becomes furious with her attitude. “Did you say ‘f--- you’? Did you say that?” the judge asks. “Yes sir, I did,” the girl responds. “Oh you did say that?” the judge replies. “I find you in direct criminal contempt. Thirty days in the county jail.” The video from 2013 went viral, with many praising the judge’s decision to punish the girl for her harsh words and attitude towards him.","post_message":"A judge thought he misheard what this teen girl said to him, so he asked her to repeat herself. She did. When he realized he hadn't misheard, the judge issued a response that the teen girl wasn't expecting."},{"comment_id":"1009028342550450","commenter_b":"She is having them killed","commenter_a":"Hell yes she is responsible for that","post_message":"BREAKING: Another Clinton Associate Set To Testify Against Hillary Found Dead There's no way this is a coincidence. America deserves to know the truth. Do you think Hillary is responsible for this?"}]
