[{"comment_id":"10152745138297093","commenter_b":"Way to go Steve!! You put this guy on blast!!! Look out people.","commenter_a":"Busted !","post_message":"Consumer reporter Steve Noviello was invited to a demo for a safety and security window film, but things didn't quite go as planned... @webpagelink"},{"comment_id":"10156589848265354","commenter_b":"Lady, please don't be ignorant....","commenter_a":"Ted Cruz , and Marco Rubio are not eligible to be president , neither is Obama ! BOTH parents must be citizens of the United States !","post_message":"Ohhhh boy...."},{"comment_id":"898756240177140","commenter_b":". . . and it's just going to get worse until we deport them all ! ! ! !","commenter_a":"LOL. LOL. These retarded Liberals! Can't we all just get along... you stupid liberals have brought this into our country... and now it will be like the middle east... Socialist DEMOCRATS SUCK!","post_message":"(Video) Is 2015 the year we see outright war between radical Muslims and Americans on our streets?  As exemplified by the actions of these Texans, Americans will push back against Islamization with highly provocative moves.   Will Obama be able to keep his jihadists in check until he declares Caliphate?  Read More + Video:  @webpagelink"},{"comment_id":"932314590139215","commenter_b":"She's definitely covering her butt! It's all about the $$$$$$$$$$!","commenter_a":"Her check book should get a lot smaller after her nasty comments to all Americans. She just sunk her ship. Remember the Dixie Chicks comment?","post_message":"After 24 hours, Ariana Grande has issued an apology for saying she hates America.  And it's very bizarre."},{"comment_id":"10158044055455391","commenter_b":"@username Obama has dumped over 10,000 mostly Muslim Somalis in Minnesota, Tennessee, and other States. A Somali-born student at Ohio State University injured 11 people, one of them critically, when he attacked a crowd of pedestrians on campus in an incident one lawmaker said \"bears all the hallmarks of a terror attack.\" Authorities said Abdul Razak Ali Artan, 18, plowed a small gray Honda into the crowd outside Watts HalI, then jumped out and attacked with a butcher knife. Authorities believe he was inspired by ISIS. The latest from America’s immigrant sex crime epidemic. One refugee, Mohamed Dirshe, raped two boys at a Kansas Catholic high school, after Catholic charities gave him a home and a job there while entrusting him with their youth. In Minnesota, authorities charged Somali born Ahmed Hersi Abdi with two degrees of first-degree sexual misconduct for allegedly raping a 10-year-old girl in her apartment. According ...","commenter_a":"The United States of America should have the right to protect itself from those people who would do it harm it's not about religion or race it's about keeping very bad people out of this country","post_message":"Federal Court Rules Against Reinstating Travel Ban  Your reaction?"},{"comment_id":"1079285898761124","commenter_b":"No woman with an ounce of self respect would vote for a misogynist like Trump.","commenter_a":"Good way to clean out those we don't need in America. Just one more reason for Trump to win","post_message":"A majority of people said they would go to Mexico."},{"comment_id":"795518530581327","commenter_b":"There is definitely something wrong with this lady...","commenter_a":"Bully like Hily Holbrook from \"The Help\" except for the racism.","post_message":"I can't stop laughing.....at HER."}]
