[{"comment_id":"10153023631106770","commenter_b":"She should leave right away!","commenter_a":"OHHH so you weren't bothered by the USA Planned Parenthood baby chopping business? You weren't bothered by Hillary's stupidity with her email? You weren't bothered by Racists looting and burning Ferguson? You aren't bothered by Miley Cyrus twerking on TV for young girls? I see. You were bothered by the GOP debate... Right.....","post_message":"Emily Blunt said becoming an American was “strange and slightly disarming.”"},{"comment_id":"10157782729605725","commenter_b":"She's a fake!!","commenter_a":"Mlp","post_message":"An honor to be at the Polish National Alliance in Chicago, Illinois - meeting with & speaking to the Polish American Congress. Thank you!"},{"comment_id":"10157534463145354","commenter_b":"Ass holes","commenter_a":"Tell the Lebanese to get the F off","post_message":"Antisemitism mars Rio Olympics... “The 2016 Olympics – a disgrace!!”"},{"comment_id":"10155299383400354","commenter_b":"Those of us who are legal US citizens in need can't get help yet we give those who are illegal help. When I fractured my neck in 3 places and shattered my leg all I got was 200 in food stamps. I was 55 and I lost everything. Stop giving this country away to those who disrespect with their very first action. Coming here illegally.","commenter_a":"They are giving them ids and other things so they can once again steal the presidency through illegals voteing. Get out and vote stop the craziness. Our president is in office illegally as he is not a US born citizen. So of course he is for illegals.","post_message":"NYC's New Illegal Alien ID Program Includes Free Membership to 33 Top NY Venues, Including the Metropolitan Museum of Art."},{"comment_id":"1487334004660057","commenter_b":"I'm sure my mom bragged about me when I was a teen thinking I was an innocent angel. Guess what? Girls are better at hiding it. I saw the video and see nothing wrong with it, she was wearing shorts, she moved her hips. I'm not a Obama fan but the girl is an adult and she's on her way to Harvard. There's bigger issues in the world than the presidents daughter dancing at a concert.","commenter_a":"I love all you people saying this is what a kid does. WRONG!!! Raise them right and raise the to respect their bodies and they don't do this. My daughter didn't do this crap. She was in the Sea Cadets and didn't do anything that would get her kicked out. She wanted a career in the military once she finishes college.","post_message":"Ohhhh boy..."},{"comment_id":"10153330006631051","commenter_b":"11 died in the C130 crash in Afganistan today, thats 11 more murders for Obama.I had more respect for the Black Panthers than Obama.The Black Panthers at least admitted to being Racist and they did not murder our troops, as Obama has.","commenter_a":"More guns = less violence","post_message":"Does President Obama have a point here?"},{"comment_id":"553065348238039","commenter_b":"Boy please!! Your mama gonna beat you stupid!","commenter_a":"I'm black and voting trump. Most of my family's also voting trump. Even most of my friends are voting trump so the news is a joke nowadays. And in case your all wondering yea we are 90% black family and friends.","post_message":"Here's why Donald J. Trump is struggling to win over black voters."}]
