[{"comment_id":"10153678111551336","commenter_b":"She is by not following the law set by the Government an trying to impose her stupid religious beliefs on ppl!","commenter_a":"Good for her. Find a different job then","post_message":"\"Her whole objection is that she doesn't want to be party to something that violates her orthodox religious views.\" – Tony Perkins, president of the Family Research Council"},{"comment_id":"1068743996585956","commenter_b":"No deport non americans and those who wish to leave..escort them to Mexico..let themtry their bullshit with them..see how far they get..I am fed up with the demorats/libtards!","commenter_a":"No","post_message":""},{"comment_id":"10156658380360354","commenter_b":"Has anyone noticed how the name has changed from refugees to migrants. They are not migrants they are foreign invaders Some people will never learn. You need to know who you are letting in your country. Know the history of Islam. We need to wake up in this country stop paying people to come here and destroy us. This was copied from a post by William Parrott When politically correct, tolerant, and culturally diverse societies agree to Muslim demands for their religious privileges, some of the other components tend to creep in as well. Here how it works. As long as the Muslim population remains around or under 2% in any given country, they will be for the most part be regarded as a peace-loving minority, and not as a threat to other citizens. This is the case in: United States Muslim 0.6% Australia Muslim 1.5% Canada Muslim 1.9% China ...","commenter_a":"How can anyone say that their religion does not allow this violence against non - Muslims?","post_message":"“How dare you run away from us?” one Muslim man allegedly yelled. “Christian girls are only meant for one thing. The pleasure of Muslim men.”"},{"comment_id":"10153567569125927","commenter_b":"The history of Islam counters everything he says about it. No surprise as he must have flunked history.","commenter_a":"pathological liar","post_message":"\"A perversion of Islam that has taken root ... that is appealing to even folks who don't necessarily know anything about Islam, and aren't even practicing Islam in any serious way ...\""},{"comment_id":"10152867381576130","commenter_b":"The fact he's sharing this photo makes it people's business lol","commenter_a":"So what does he have down there?","post_message":"\"We've had comments saying 'he doesn't look trans' which brings up a great point on what does trans even look like?\""},{"comment_id":"1067844663241313","commenter_b":"Texas i never would have u of all states would let muslims take over u capital and Texas read there korah they hate sll non muslims u have been fooled ,they use our laws againest us to get into our goverment , the woman had a right to speak she is a American citizens talking about God and Jesus his son , and u made her leave i bet her family fit 4 our freedom can u say the same about ur muslims that were there ,muslims use people like u all falling 4 there garabage ,i bet they are not even citizens , Texas ur idiots make no mistake the muslims will try to take texas over ,then where are ur Texas Rangers ,","commenter_a":"I see everyone praising this woman, and it's cool I respect her opinion and her right to her actions. But why use the name of Jesus for all the hatred rants. Like when the illegal kids on the bus came to the U.S. and got screamed at and booed by \"Christians\" I wonder if Jesus came down here would be ranting with his Christians or would he be loving everyone?? I think you should do your hatred rants in your name. Not the Lords name.","post_message":""},{"comment_id":"10153233936119170","commenter_b":"Yes, she belongs there. Always enjoyed this show and hae a good laugh at some stupid people.","commenter_a":"Fodder for \"World's Dumbest Drivers\".","post_message":"Behold a video of the worst parking job in human history. Newsworthy? Probably not. Hilarious? Definitely."}]
