[{"comment_id":"10154043300342577","commenter_b":"All women do!!","commenter_a":"is it just me, or has this woman got the most annoying voice in the world? I just wanna punch her in the face","post_message":"Hillary Clinton's Greatest Hits! Vol:1- infowars.com/show"},{"comment_id":"10153262313634497","commenter_b":"Alan there's no way for Cubans to legally immigrate to the US.","commenter_a":"Ted Cruz the Canadian born of a Cuban and an American that doesn't like immigrants.","post_message":"Texas senator Ted Cruz announced Monday that he will run for president in 2016. Here is what you should know about the first-term senator:"},{"comment_id":"10153516438174087","commenter_b":"Only stupid people would let Syrian.people come to the U.S. Or illegals.","commenter_a":"Han er decideret syg i hovedet Oliver Dagn","post_message":"“I’m wondering if you would be able to look at [Syrian refugee children] in the face and tell them that they’re not allowed to go to school [here],” a voter asked Donald J. Trump. \"I can look in their face and say, ‘You can’t come here,’” Trump replied to applause."},{"comment_id":"10153158889713837","commenter_b":"Yes, where kids have easier access to that stuff...*smh*","commenter_a":"Thank goodness. Maybe the tide is turning. Where nothing has been off limits, fortunately Playboy has made the decision to no longer contribute to the filth that saturates the marketplace.","post_message":"NO MORE NUDES! Playboy magazine has announced that it will eliminate nude pictures from its pages. But it's OK, you only read it for the articles, right?"},{"comment_id":"874881595880596","commenter_b":"Doesnt matter what they get The blacks or most of them would whine and complain about something!","commenter_a":"Lets just go back to the old days of segregation if that's what they want and they all can ride in the back of the bus","post_message":"“Whites Not Allowed” This is the public education system in Obama’s America."},{"comment_id":"10153513922564087","commenter_b":"Typical obfuscation from a serial liar & all-around nasty woman,","commenter_a":"Bernie will release whatever you ask him to. He has nothing to hide!","post_message":"“Let everybody who’s ever given a speech to any private group under any circumstances release them,” Hillary Clinton said on ABC’s “This Week.” “We’ll all release them at the same time.”"},{"comment_id":"10154883066819411","commenter_b":"They don't care about children being blown to bits as long as they can let trans use women's toilets and have gay marriage","commenter_a":"They are so fukn stupid. Clinton will plunge this world into war and then run for the nearest bunker.","post_message":""}]
