[{"comment_id":"10153098509611813","commenter_b":"The ACLU doesn't stand for white heterosexual males or gun rights...ever.","commenter_a":"The ACLU stands for dead babies and bombings.","post_message":"The ACLU supports refugees and stands against fear mongering by politicians. @webpagelink #refugeeswelcome"},{"comment_id":"1686157554986660","commenter_b":"Smart woman only a dummy would join Scientology!!","commenter_a":"Kirstie, you are beautiful and such a smart woman! I applaud your endorsement of Donald Trump. Don't let your \"neighbors\" get you down.","post_message":"I am sure people in Hollywood are losing their minds right about now, but this actress is NOT backing down. Do you support Kirstie Alley's presidential pick?"},{"comment_id":"228156194316478","commenter_b":"Trump 2016, Trump 2020","commenter_a":"AND THAT'S Y HIS ASS GOT TO GO!","post_message":"WOW. Listen carefully... EVERYTHING she said back then was right! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155424694168812","commenter_b":"@username Mexico is important! Why do you have to be so damn nasty??","commenter_a":"I can not way for Mexico start not combating drug dealers and not helping stop immigrants from other countries to reach US, then you will see how important Mexico is as a neighbor.","post_message":"Canada's border has seen a surge in people crossing illegally from the U.S., with a 230% increase in people crossing into Quebec in January compared to a year ago. @webpagelink"},{"comment_id":"1137271292959073","commenter_b":"Sexist sad people. You know your mother is a woman!","commenter_a":"Hillary is amazing she is a rock! She doesn't go after fantasies, She will be a president like no other. As a female she will be challenged more harshly. Where is her compassion? Where is her Honesty? Where is her strength? Please don't forget she is already feeling and applying all these quialities!","post_message":"“I will absolutely protect your children, yourself, and try to bring your family back together.\" At the #DemDebate last night, Hillary spoke with the mother of five children who have not seen their father since he was deported three years ago."},{"comment_id":"1495140610505964","commenter_b":"Candace Richerson what about roger Ailes? He's a jerk. So what","commenter_a":"The truth hurts doesn't it!??!!! She is well armed with actual facts. Unlike the people who speak for Trump: the sexual haraser, the racist, the bully and the Ukraine employee - But you Trumpets go right ahead and support the guy who loves Putin. Every Hitler needs a Mussolini.","post_message":"Sen. Elizabeth Warren calls Donald J. Trump a \"small, insecure money-grubber\" during her first solo campaign appearance for Hillary Clinton. Read more: @webpagelink"},{"comment_id":"1249598461784360","commenter_b":"Illegal go home","commenter_a":"Why doesn't anyone show compassion? They lost their mother, they are grieving. How would u feel? Instead they act like she is a criminal for wanting her kids to have a future no matter what happened to her.","post_message":"LIVE VIDEO: The family of the Valley mother who was detained and deported under President Donald J. Trump's immigration executive order speaks outside of ICE headquarters in Phoenix. STORY: @webpagelink"}]
