[{"comment_id":"10154304263504203","commenter_b":"Haha crooked Dems are feeling the Bern, bet rigging the system doesn't seem to nice now does it DWS? Trump is going to destroy Crooked Hillary in November","commenter_a":"Dear Bernie.....GET OUT.","post_message":"Berning bridges."},{"comment_id":"952811251478596","commenter_b":"@username how about you go fuck yourself","commenter_a":"Wow, while I agree that both parties are leading us down a rabbit hole. The fact is we have two parties that lead us in this country. The democrats have a criminal and a socialist as front runners in their campaign. So I have no alternative but to endorse the republican party. If my friend that liked this post feels that makes me anti American then I guess we don't know each other as well as I thought.","post_message":"This HAS to be said. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"986861908039953","commenter_b":"President Obama is the best. Elizabeth Warren should have run for president because she would have been great just like Obama..STOP HATING PEOPLE. Recognize greatness...","commenter_a":"That's just great Thank you Mr President and Elizabeth Warren , your the best !!","post_message":"They are kicking Wall Street's ass!"},{"comment_id":"10157734459025354","commenter_b":"Bill can't wait to be in Las Vegas were the hookers are like running water! I did not have sexual relations with those hookers!","commenter_a":"The real deplorables are the 40 something % of true idiots that are still backing the Clintons- Trump people are fed up taxpayers-","post_message":"If she's \"feeling great\" as Team Hillary claims, why isn't she campaigning? What is going on? And why can't these two ever tell the truth?!"},{"comment_id":"10153454020915329","commenter_b":"My favourite is free spirit - I might go with that one","commenter_a":"Bree Andrijich @username Amy Badock Monique Scott","post_message":"Sport fishing enthusiast?"},{"comment_id":"10153144950646350","commenter_b":"Or because girls are just jealous that \"that ugly skank\" will have taylor for life now","commenter_a":"Why is everyone a hater! Give them your best and move on! I think they are a wonderful couple! Congratulations!","post_message":"Congratulations, Lady Gaga!"},{"comment_id":"893404867419235","commenter_b":"Really! Like WTF! Those sharks don't belong there! This bullshit is effecting tourism! Kill'em all, right?? You freakin gluttonous capitalistic bitches! 😡","commenter_a":"o_O *slow blink*","post_message":"Why isn't the government protecting our freedom of beach?"}]
