[{"comment_id":"10153619806193984","commenter_b":"Neither!","commenter_a":"Guess Obama can only force Americans to follow his \"laws\" and beliefs ---- he was a tricky and mischievous politician, declared Ethiopian opposition party spokesman Yonathan Tesfaye. today he has become a passionate inspirational human rights activist. Which one should we believe? Which one should we go with?","post_message":"Well, it doesn't look to me like Obama made very many friends during his trip to Africa...  Do you agree that Obama is untrustworthy?"},{"comment_id":"10154452810413812","commenter_b":"Kick her out.. Back to Honduras, then she can sue the Doctor there...","commenter_a":"I'm waiting for liberals to come on here and blame Trump somehow I'm surprised ABC didn't blame Trump for it","post_message":"Mother of infant born in NJ with microcephaly says doctor in Honduras told her everything would be \"fine\" after she reported having a fever. “He said, ‘Don’t worry, everything will be fine. I don’t think you will be affected.' Then I had an ultrasound, and everything looked fine.\""},{"comment_id":"907517025969130","commenter_b":"May she be he first to suffer any repercussions from this decision.","commenter_a":"I'd like to know what her retirement package is!","post_message":"UNREAL! RETIRING SENATOR IS 34TH VOTE TO CLINCH OBAMA WIN ON IRAN DEAL   Obama puppet..."},{"comment_id":"608915299267779","commenter_b":"Nigga i would murder u nigga in HIp HOp","commenter_a":"Hahaha... @username ma boy who you got? Lol... Norman Harrell @username who you got? I call Em via 1st Round KO","post_message":"Drake reportedly claims he's ready to take on Eminem. Who do you got in a Drake vs Eminem beef? #Drake #Eminem #Beef #JoeBudden #WSHH #Hot97"},{"comment_id":"1563946600332130","commenter_b":"she says she all for kids but she can not hide the truth","commenter_a":"If a woman walks around spewing F!#K the way she does you damn sure don't want her to be president, hell I don't even want her as a friend","post_message":"This is the REAL Hillary Clinton, folks!"},{"comment_id":"10153714584104087","commenter_b":"She's a pure Red in disguise.","commenter_a":"The PEOPLE are speaking. She's winning by a lot of votes.. doesn't matter what the internet thinks. Real people are voting, and real people are voting for her.","post_message":"Fresh off a commanding win in New York, Hillary Clinton has a 13-point edge in the biggest state up for grabs in next week's primaries."},{"comment_id":"949160488506463","commenter_b":"THIS IS 9AMERICA0 NOT SYRIA","commenter_a":"May I remind everyone, This is America and the judge was correct. Swear to the truth by swearing to it on the Bible!","post_message":"Did a judge violate this woman's religious freedom or were his actions justified?"}]
