[{"comment_id":"10156255899575147","commenter_b":"I agree with you. It could have went awry. Maybe the mother has some mental issues. Only God knows what was in her mind. One thing for sure though, its alive n has chance to be somebody. Not just an aborted baby thrown in a trash can or its innocent body parts sold on the black market. Evil comes in all shapes n sizes. One of them is planned parenthood.","commenter_a":"I'm glad she didn't abort the baby, but this is still a sad story. Calling it a \"selfless\" act, as this article does, is a head scratcher. \"Desperate\" maybe, but if anything, abandoning a baby without notifying anyone is exactly the opposite of selfless. There are safe havens in NY where she could have turned over the baby to actual people","post_message":"\"I followed the cries. I walked to the little nativity home we had installed inside the church… I couldn’t believe my eyes.\""},{"comment_id":"1765372970348268","commenter_b":"No she is a lier","commenter_a":"Feel free, one and all, to hit me in the head with something hard and heavy if you ever get wind of me agreeing with Hillary on anything.","post_message":"Hillary Clinton rebukes Senate Republicans for refusing to hold a hearing on U.S. Supreme Court nominee Merrick Garland, calling it \"low-minded politics\". Do you agree or disagree with her?"},{"comment_id":"1394774427201577","commenter_b":"She shouldn't even have a job because she is an illegal alien.","commenter_a":"Frank tokar maybe if you were in her parents situation would do the same , you do anything to make sure sure your children are safe and have the best you can give them , USA is a líder no a low un respectful selfish heartless country thanks god no every American think that way USA is a country of opportunities no one takes your jobs away all depends on you how hard you work .","post_message":"Rick Santorum and Anna Navarro engage in a passionate exchange with a DREAMer who says she may lose her career if the new administration ends DACA. @webpagelink"},{"comment_id":"1723610494573092","commenter_b":"Thanks a fucking lot to the woman who decided to skip her period and have this douche","commenter_a":" Marihuana is not physically addictive, but isn't pshycologically just as dangerous!?! Just because one bad and dangerous thing(alcohol) is legal - does not mean that legalizing another is a good idea!!!","post_message":"Alcohol is 114 times more deadly than marijuana.  Like ATTN: on Facebook."},{"comment_id":"1518865864832838","commenter_b":"No but he does plan to get rid of illegals. Anyone coming I to our country will respect our laws AND FOLLOW THEM!!","commenter_a":"Hollywood has never been right about anything in politics!","post_message":"Another Communist making a fortune on capitalism..."},{"comment_id":"1247325575291461","commenter_b":"Third *","commenter_a":"That's a fair shout but we killed them all off and interbred with them now we have evolved and are the last stage you see before your eyes, religion is cool except for when it blinds you and # Christianity is young as fuck compared to other religions fam","post_message":""},{"comment_id":"10153464006023132","commenter_b":"IAN!!!!! Noooooo!!! We had plans to run away! Well, I did anyway! Oh well, Nikki rocks so that's cool!!!","commenter_a":"@username @username I am so sorry to hear of your loss!!! ;-)","post_message":"Nikki Reed and Ian Somerhalder aren't the only ones."}]
