[{"comment_id":"499007870289793","commenter_b":"She's an ass. She's not an elected official. Tell her to stuff it.","commenter_a":"Go away Michelle.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10152653959642894","commenter_b":"my wifey cnt marry ciara's nigga #loveTINASHE","commenter_a":"hmmmmm \"HOW MANY TIMES\" we gonna hear that lie....I love Tinashe but when I found this out...lost so much respect for her. You know it's gotta be true....if you listen to \"How many times\" you know it...and....Ciara been hurt too many times so....she just gonna leave her baby daddy for NO REASON? Oh.....ok","post_message":"Tinashe Denies Rumors That She's Dating Future, Says It's '100% Made Up and Untrue'"},{"comment_id":"10154784802599575","commenter_b":"arrest her before she flees the country!","commenter_a":"If she had any tact, or respect for the people who voted for her she would of made a speech last night.","post_message":"Hillary Clinton is expected to speak very soon from New York after losing the election to Donald Trump. We will live stream her concession speech on our Facebook page and in this post."},{"comment_id":"10153015715557452","commenter_b":"Why leave him alone???? He is an admitted rapist! !!!!","commenter_a":"Leave Pill Cosby Alone.","post_message":"Three more women who were allegedly sexually assaulted by Bill Cosby came forward during a press conference Wednesday, bringing the number of accusers up to nearly 50. abc7.la/1N4Pq51"},{"comment_id":"853718148092962","commenter_b":"Hope she goes to prison.","commenter_a":"She should pay it back and go to jail","post_message":"So long, farewell..."},{"comment_id":"10153960643118984","commenter_b":"Just take ur stinking ass and ir ugly ass women with u","commenter_a":"You all need to vote ... get rid of this crap ....","post_message":"I can't imagine what this woman must have felt when this Muslim cab driver did this... Do you support this judge's decision?"},{"comment_id":"10153142231890329","commenter_b":"Also it says 'optional' so parents do what they want regardless. Lots of parents I know say they prefer the class donation as they may not always get a chance to shop or might not know the child well enough to personalise the gift.","commenter_a":"Let me put forth a different perspective: my kids are in classes with 20 odd children in - this is excluding family and family friends who attend the parties. At birthdays if all the class kids attend that's 20 gifts. You are hard pressed to find something cheaper than 10 quid these days and most individual presents cost more so if everyone gives 10 quid it lands up being more affordable for a lot of people, means a lot less clutter in what are often small London homes or apartments, and collectively with say 200 pounds a child can get one substantial gift like a bike or it could go towards something the parents need for their child. I genuinely don't see an issue with this at all and fail to see how this is a middle class issue.","post_message":"Oh, dear. // BuzzFeed UK"}]
