[{"comment_id":"10152882564604024","commenter_b":"This chick def. has mental issues like Julie stated. You need to know when to just not add fuel to her fire. Who knows what she would've done if this argument escalated.","commenter_a":"I've been taking NYC subway all my life and this is rare and far between. The vast majority of people are actually pretty nice. I hate watching these things because it makes us look really bad to outsiders. There are over 8 million people in this city, of course you're going to get a few bad ones, it's just the odds. Please don't judge us all based on a few..","post_message":"If you witness this fight, would you try to settle it? How?"},{"comment_id":"10152867381576130","commenter_b":"The fact he's sharing this photo makes it people's business lol","commenter_a":"So what does he have down there?","post_message":"\"We've had comments saying 'he doesn't look trans' which brings up a great point on what does trans even look like?\""},{"comment_id":"10152948081757144","commenter_b":"She's just as bad. I will never vote for her.","commenter_a":"Not a fan. She's a liar and a thief. In bed with Walmart and Monsanto. She's a evil war hawk.","post_message":"So much for transparency."},{"comment_id":"10153336853341518","commenter_b":"Remember these two Stones Tablets were made to represent apart from commandments written on them. The first Stone Tablet represented the sin bearin Messiah who was to be born in the Holy Land in Canaan and the second Stone Tablet was to represent Messiah the KING who who was to be born in the Holy Land hidden in Africa. These Stone Tablets are buried in different places in Africa and they are Two Shrines of my God.","commenter_a":"Who cares? This is the problem with Judaism today; the discussion is over minutiae and not substance. People are ignorant regarding the mitzvot and the Chief Rabbinate is concerning themselves with this?","post_message":"The Israeli Chief Rabbinate has cut the arches off the 10 Commandments. (We want your comments, but please first read the actual and complete article and not just the Facebook excerpt. See link below...) ------------ Shalom Bear has published \"Squaring the Circle\" on JewishPress.com. @webpagelink"},{"comment_id":"10153727750436336","commenter_b":"You do realize that without spiders the world would be overrun with bugs which do a lot of damage to the earth if not contained","commenter_a":"This happened to me before when I was a kid, I was riding my bike branch hit me by my ear. Felt something weird went to the bathroom spider came out half way to say \"hi\" then went back in when I screamed for mommy. Went to the doctors then I lay down and the spider came out itself! And yes I killed it with my bare hands!!","post_message":"Each attempt doctors made to remove the spider caused it to react violently, but they eventually were able to subdue the insect with medicine and pull it out with tweezers."},{"comment_id":"1552829708351782","commenter_b":"Nor do any of you have the full story like I do, so please don't speculate on what you don't know.","commenter_a":"in this day and age, a woman shouldn't lose her life during childbirth, I surely hope there is a huge investigation","post_message":"He was at the wake for his wife and 5-day-old baby when he got word that his sister had lost her battle with cancer. Many of you saw the heartbreaking story on NewsCenter 5 and have asked, “How can I help?” Here’s how: @webpagelink"},{"comment_id":"10153022619096523","commenter_b":"She's white who cares... Get over it lady!!!","commenter_a":"This is so sad","post_message":"\"She told me not to blow her cover about the fact that she had this secret life or alternate identity. She told not to tell anybody about Montana or her family over there. She said she was starting a new life.\""}]
