[{"comment_id":"10153258325486680","commenter_b":"Dear Airlines:* Dump the male flight attendants. No one wanted them in the first place. Replace all the female flight attendants with young good-looking strippers. They don't even serve food anymore, so what's the loss. The strippers would at least triple the alcohol sales and get a \"party atmosphere\" going in the cabin. And, of course, every businessman in this country would start flying again, hoping to see naked women. Because of the tips, female flight attendants wouldn't need a salary, thus saving even more money. Muslims would be afraid to get on the planes for fear of seeing naked women. Hijackings would come to a screeching halt, and the airline industry would see record revenues. This is definitely a win - win situation if we handle it right -- a golden opportunity to turn a liability into an asset. Why didn't Bush or Obama think of this? Why do ...","commenter_a":"Bernie would trounce him! Trump would get absolutely destroyed! Lmao 😂","post_message":"Donald J. Trump: \"Oh would I love to run against Bernie. That would be a dream come true.\""},{"comment_id":"10153207313881770","commenter_b":"She has always been a liberal idiot so send them all to her house","commenter_a":"An actress whose biggest claim to fame is getting nailed by Frankenfurter","post_message":"Susan Sarandon is now likening Syrian refugees to Jesus."},{"comment_id":"486290274888721","commenter_b":"Bernie sit yo old ass down u is not gonna win nother","commenter_a":"it's beneficial being educated in this!","post_message":"There is a BIG difference!"},{"comment_id":"1801596090092193","commenter_b":"Rot in jail bitches","commenter_a":"You mean to tell me. These people are so dumb that when they went out to do something this stupid. They didnt know anyone that would or could bail them out?.. That is pathetic","post_message":"Charlotte protesters want people's money for bail."},{"comment_id":"625393104287939","commenter_b":"She is NOT too smart!!!!","commenter_a":"Enemy of the Republic right there people.","post_message":"Pentagon Officials Furious After Clinton Announces US Response Time for Nuclear Launch During Debate @webpagelink"},{"comment_id":"1466659373354088","commenter_b":"@username <<<america needs more folks that think like this guy... dude you such teach classes to these bigot trump supporters","commenter_a":"Protestors are chanting \"Black Lives Matter\" as they set fires, fire weapons and attack police with bricks but BLM leadership will say they don't represent \"the movement\". Yes, this IS your movement. No one respects you. You defend criminals, make martyrs of cop killers and have the gall to act like these violent protests don't speak for you?","post_message":"A large crowd turned out after Milwaukee police shot and killed what they said was an armed suspect earlier in the day."},{"comment_id":"10150710732969999","commenter_b":"@username Under Trump she would probably be stopped from entering the US.","commenter_a":"Now watch Trump dismiss this intelligent young Muslim woman with a bigoted insult as his ignorant fans cheer him on.","post_message":"\"Well, that’s really tragic that you hear these comments which are full of hatred, full of this ideology of being discriminative towards others,\" Malala Yousafzai said in response to Donald J. Trump's remarks on Muslims."}]
