[{"comment_id":"900773723315710","commenter_b":"And how is this news? Last time I checked, Mail was supposed to be a page for news.","commenter_a":"just kill them all anyway","post_message":"In these exclusive pictures, she goofs around like a typical London schoolgirl. Here we reveal what poisoned the mind of the 15-year-old who's run off to join ISIS."},{"comment_id":"625393104287939","commenter_b":"She is NOT too smart!!!!","commenter_a":"Enemy of the Republic right there people.","post_message":"Pentagon Officials Furious After Clinton Announces US Response Time for Nuclear Launch During Debate @webpagelink"},{"comment_id":"212919912399673","commenter_b":"Karishma Bisheshar @username guys do ul remember this song...","commenter_a":"So sweet!","post_message":"You're my Honeybunch, Sugarplum Pumpy-umpy-umpkin, You're my Sweetie Pie You're my Cuppycake, Gumdrop Snoogums-Boogums, You're the Apple of my Eye And I love you so and I want you to know That I'll always be right here And I love to sing sweet songs to you Because you are so dear.. <3"},{"comment_id":"1733106183573180","commenter_b":"Liar, murderer and thief! Hang that bitch.","commenter_a":"She is such a P.O.S. lol, if there is nothing to hide then why not release them, it's ridiculous! No one is asking for others transcripts, just her's because she is a proven liar...anyone supporting this woman needs to really see the truth and stop denying what she really is.","post_message":"During last night's debate, CNN moderator asked Hillary three times why she won't release transcripts of her speeches to Wall Street banks if there's nothing that she's trying to hide from voters. Do you think Hillary Clinton is hiding something in those speeches?"},{"comment_id":"1970418399684565","commenter_b":"Gorgeous dress","commenter_a":"Horrible dress","post_message":"Politics made it to the Grammys!"},{"comment_id":"10152850999936813","commenter_b":"One thing that strikes me is how people obsess with the LGBT. For some reason it's \"all the Gay's fault\". If only we could get rid of them, all our world's social problems will be solved. NOTICE: YOU DO NOT SEE SIGNS SAYING: \"ADULTERERS/CHEATERS, WIFE BEATERS, ADDICTS, RAPISTS, CHILD MOLESTERS, LIARS, THIEVES, TERRORISTS, CORRUPT POLITICIANS & PASTORS WILL NOT BE SERVED OR ARE NOT WELCOME IN THIS STORE\". NONE! It's always the Gays....","commenter_a":"Actually let small businesses post these types of signs. This tells me to take my dollars elsewhere!","post_message":"Tennessee hardware store owner hangs a “no gays” sign in the front window. It's 2015, not the 1950's. @webpagelink"},{"comment_id":"658627524300508","commenter_b":"Just the way I want them! You have your work cut out for you with Remi your Boston Terrier.","commenter_a":"@username both your dog's made the list","post_message":"What's the laziest dog breed?"}]
