[{"comment_id":"1221087354570479","commenter_b":"It is French and Spanish ancestries some of the women probably do have more hair than the guys... I should know I was one pretty hairy teenage girl growing up in New Orleans!","commenter_a":" school board has a policy that does not allow any facial hair on male students, Tangipahoa Parish school superintendent Mark Kolwe told ABC News. So female students can have facial hair? Seems sexist to me.","post_message":"The school told all students with facial hair that they had to shave before the ceremony, but the rule was not enforced during the school year."},{"comment_id":"909196299140119","commenter_b":"She aint no fun!","commenter_a":"Jack King","post_message":"Virgin wife who won't have sex is trying to set husband up with live-in lover"},{"comment_id":"10154099091164203","commenter_b":"No BITCH, .it's a blog like TRUMP my mind works faster than my finger on a kindle and this blogging is not the most important issue in my life, now run along I graduated HS over 40 years ago, so you grading me is MEANINGLESS......specially since your from Canada.......","commenter_a":"Really? Bull SHIT BLACK LIVES MATTER have been showing up to all the rallies. Only TRUMP supporters are standing up to the fucking ghetto rat's. Go ahead talk OUT both sides of your MOUTH, you just keep confirming the NEED FOR THE TRUMP MOVEMENT.","post_message":"\"My own personal observation is that there is a cycle of behavior that is escalating and it's happening exclusively at Donald Trump events.\""},{"comment_id":"1032855700144015","commenter_b":"No one is looking to take away your guns, just like no one is looking to take away your car.","commenter_a":"Taking guns away from citizens violates our rights. Criminals will be the ones with guns. I have a hard time understanding why the hell people dont get this!!!!","post_message":"Nearly 50 years ago, Robert F. Kennedy made an appeal for gun control in Oregon -- just miles from where the recent mass shooting at Umpqua Community College occurred."},{"comment_id":"10154570112539497","commenter_b":"*grandma hands me a $10* \"Go get yourself a cup of coffee!\" \"Grandma, this is a $10...\" \"Then get yourself 3 cups of coffee!\"","commenter_a":"Jennifer Ann Winchester","post_message":" don tell your parentsthis is just between you and me. Good boy."},{"comment_id":"10155020907765329","commenter_b":"I mean fuck the patriarchy, but like FUCK the patriarchy... amiright?","commenter_a":"@username #17 please","post_message":"So your dirty mind can go back to school."},{"comment_id":"1695225903839696","commenter_b":"Oh that won't be left leaning or anything....","commenter_a":"Didn't know 60 minutes was still on","post_message":"You get a story. And you get a story."}]
