[{"comment_id":"10154306039388812","commenter_b":"How so @username, what was the childish remark. Do tell...","commenter_a":"This is awesome! Every child should have someone to tell them they're loved and accepted. Growing up is hard enough I can't imagine what transgender teens must go through everyday and I'm glad there are people willing to stand up for them and do the right thing.","post_message":"After an uphill battle involving protests and a petition, Wisconsin school will allow transgender high school student to run for Prom King: @webpagelink"},{"comment_id":"10153138669086378","commenter_b":"She gets off on it","commenter_a":"Weird","post_message":"BREASTFEEDING FRIEND'S SON: A photo of a Bala Cynwyd woman breastfeeding not only her own son, but her friend's son, is generating controversy.  See more about her decision, and let us know what YOU think in the comments below:"},{"comment_id":"10154520353580329","commenter_b":"All humans have breasts, relax","commenter_a":"Not all people with boobs/breasts identify as women.","post_message":"I love you AND I hate you."},{"comment_id":"10153694731231955","commenter_b":"Awwww so sad, GO BACK TO YOUR FUCKING COUNTRY ,","commenter_a":"Oh nowvthey care","post_message":"Muslims feel intense backlash..."},{"comment_id":"10153178663173854","commenter_b":"i think this has been going since christ was born these people have been fighting all this time","commenter_a":"Yes Sir on that one! God bless you","post_message":"Rev. Franklin Graham: Imagine the Outcry if 21 Muslims Had Been Beheaded by Christians"},{"comment_id":"1773738762840165","commenter_b":"Yea but she doesn't wear that dress well as Melania .Petty old lady","commenter_a":"This is just tacky and remarkably low class.","post_message":"10/10 burn. 🔥"},{"comment_id":"1104058139606442","commenter_b":"Not a politician but an accomplished business man, with a reputation for getting things done right! he's got my vote and the illegals can build the F-N wall for trespassing and then get their a** on the other side. And all those anchor babys adios amigos","commenter_a":"Why did you cut him off? He was still talking. That's very disrespectful. You do that again and I will unfollow this page.","post_message":"GOP DEBATE  Watch Donald Trump affirm his commitment to not only building a wall on the US/Mexican border, but making MEXICO pay for it."}]
