[{"comment_id":"454539224670672","commenter_b":"After we bomb the hell out of them , before we put the truss in harms way, and have other countries fighting to. We are close to bankruptcy like Greece, we should not do it alone.","commenter_a":"Should be an option but not the only one. Tired of these numbskulls. So ready to use other people's blood but not their own The Bush family did that, the Obama. Ass did it even he said was not. Clinton did it. If The Saudis want to keep their kingdom let them do it, if the Turks want their country let them invest their oeople, Jordanians, yemens. AND STOP ALL IMIGRATION INTO THE USA","post_message":"Donald Trump wants to send more US ground troops to fight ISIS. Do you agree or disagree with his plan?"},{"comment_id":"10154271893261336","commenter_b":"He should deport the freeloaders and criminals. There are a lot of nice people out there who want to work and be a part of America","commenter_a":"Trump just told CNN he is for a raise to the minimum wage. I am waiting for Trump to say he will not deport the 11 Million undocumented immigrants he promised his rightwing base. Look for that next week.","post_message":"After emerging as the presumptive GOP nominee following a major victory in Indiana, Donald J. Trump is responding to questions about whether he'd choose John Kasich as his running mate. Don't miss Trump tonight on \"The O'Reilly Factor\" starting at 8p ET."},{"comment_id":"482704838584476","commenter_b":"Yea just can't fix stupid... While Obama tries to shove his deal down Americas throat - Iran is laughing at us, buying weapons and building bombs - Better war with them today than tomorrow - Iran has no purpose, no value - Just make it a dust bowl.","commenter_a":"Nuke China & Iran!","post_message":"So, please Obama explain us, how this deal prevent war?"},{"comment_id":"10153793456236336","commenter_b":"@username, actually I am quite the opposite. I believe that a 17 year old, is not a child anymore. I believe in raising kids to respect authority not defy it. I believe in order for people to succeed in this life, they need to learn to communicate appropriately and in the correct place. This punk did none of the above and she challenged because she thought she could control the authorities in the room. There was no brutality here at all and what the Officer did probably stopped the room from erupting in violence. Go watch @username's video and read the story. It may teach you something. Hopefully, this thug learned something from all she went through, but somehow I doubt it.","commenter_a":"I watched the entire video. You had a belligerent girl who refused to put away her cell phone. She was mouthy to the teacher, the principal and then the officer was called. He asked her nicely to obey. She refused to follow his orders even after being asked several times. He went to take her out of the chair, she hung on. He did not body slam her, as reported and actually she came out of the chair pretty easily. It just looked bad because the chair fell over. The officer was completely correct and the girl was completely wrong. They better clear this officer or they will be sending a very bad message and more kids or punks as the case may be, won't listen to their teachers either. Chaos will ensue in the classroom and order will be totally out the window.","post_message":"Do you think this is a case of excessive force or lack of respect for authority?"},{"comment_id":"1111506915536985","commenter_b":"there always must be some mother Theresa online who will even justify leg surgery of mosquito..","commenter_a":"It's gonna be a waste of money to save that snake. Save it for someone who really needs surgery.","post_message":"That looks uncomfortable."},{"comment_id":"10158298295275206","commenter_b":"@username Memisevic you want to be a victim so bad. Girl go lay down.","commenter_a":"This is exactly why NFL players are doing what they are doing, and you are pissed at them!?","post_message":"“We saw that Terence did not have any weapon. Terence did not make any sudden movements. We saw that Terence was not being belligerent.”"},{"comment_id":"583876271812949","commenter_b":"Niggah Please","commenter_a":"Um....why walmart though?","post_message":"Trump's #1 supporter has a disgusting warning for voters..."}]
