[{"comment_id":"10153405273244203","commenter_b":"@username those aren't feminists.","commenter_a":"What an absolute idiot! Feminism is the opposite of equality. Equality is equality, that's it.","post_message":"\"So to me, feminism is probably the most important movement that you could embrace, because it just basically another word for equality.\" Taylor Swift"},{"comment_id":"461209797400647","commenter_b":"This isn't the dark ages, human beings are starting to accept all people. Perhaps the asswipes on this thread should become more tolerant and stop wasting all their energy on irrational hatred.","commenter_a":"What awesome gay couple would want to be married by a bigoted pastor? There are plenty of other ordained people who will be more than happy to marry a beautiful couple!!! Peace!!","post_message":"Breaking..."},{"comment_id":"1515851598455693","commenter_b":"That's ok i love the 6 i have","commenter_a":"I REALLY HATE TATTOOS BUT THIS IS GOOD","post_message":"It's not just about the conversation — it's about providing tangible support and help too."},{"comment_id":"1317807834918571","commenter_b":"Hillary Clintin is a nasty Woman, I like the sound of that truth.","commenter_a":"TRUMP = TRUTH","post_message":"WATCH LIVE: Donald J. Trump's campaign manager tells Bianna Golodryga about the \"rigged election\" claims."},{"comment_id":"1039093332808969","commenter_b":"Probably its the smell coming from your stinky vagina bitch...","commenter_a":"Turkish people smell like fart. In the elevator, I aways have to cover my nose 👃 just to bear with their revolting smell. Russia should retaliate.","post_message":"Should be an interesting next few days..."},{"comment_id":"10155112416861729","commenter_b":"Just ignore the cockroach she will leave.","commenter_a":"Whoever voted already needs to go and vote again in November 8th! We have learned (thanks to Hillary ) that we can vote multiple times! That way the democrats won't be able to control all the votes!!","post_message":"Your feel-good story of the day, folks!"},{"comment_id":"1142853059119585","commenter_b":"So's my father. Personally, I served a three year tour in the US Army.","commenter_a":"No! George Bush was in the service. But no one knows how he got out.","post_message":"Don't you EVER forget this... nor let these Republican chicken-hawks send your children off to die in wars for profit."}]
