[{"comment_id":"10153659682115399","commenter_b":"Really? In what way could Trump have forestalled the Syrian refugee crisis?","commenter_a":"If Trump would have been in charge before this, these horrendous wars and humanitarian crisis may not be going on. It appears that Obama is way out of his league. #trumpforpresident","post_message":"Reminder: More than 100 people were killed and more than 350 injured in the coordinated terror attacks."},{"comment_id":"10155306004950725","commenter_b":"Those girls are animals.","commenter_a":"Throw her Ass in Jail with the real Women, not the Kiddos.","post_message":"A 16-year-old girl has been arrested after a vicious fight with a group of girls at McDonald's, police say. Watch a video of the brutal brawl here------> @webpagelink (WARNING: Violent nature could be disturbing to some viewers)"},{"comment_id":"10156244248180354","commenter_b":"Stop importing the pigs and it wont be","commenter_a":"Learn English","post_message":"Obama's New America..."},{"comment_id":"715065121964948","commenter_b":"Good luck competing with India and China for FDI by multinational corporations. Unless you guys are okay with working for <US$1 an hour.","commenter_a":"Correct me if I'm wrong, cost of living will rise and NHS is at serious risk........... As far as I can see we're in real trouble!","post_message":"Is #Dexit on the cards? Could Denmark follow Britain? Paul Adams was in Copenhagen where there are already calls for a similar #EURef. You put your questions to him and Eurosceptic Danish pollster Erik Høgh-Sørensen. #FacebookLive"},{"comment_id":"10152729165306051","commenter_b":"Why , is a pig smarter?","commenter_a":"I am offended that they are catered to. I love pork and will continue to eat it unless my doctor says not to... then I may eat it any way. No religious cult will tell me what to or what not to eat, wear, pray, etc.","post_message":"This publishing house just banned all references to sausages or pigs because they offend certain religious groups."},{"comment_id":"10154453575369087","commenter_b":"I love it.","commenter_a":"And Trump is right once again! Meryl Streep is a piece of s***!","post_message":"Donald J. Trump: \"Meryl Streep, one of the most over-rated actresses in Hollywood, doesn't know me but attacked last night at the Golden Globes. She is a Hillary flunky who lost big.\""},{"comment_id":"10155026272596320","commenter_b":"Loose lips sink ships!","commenter_a":"There saying nothing","post_message":"REPLAY: Senate hearing on Russian hacking. Office of the Director of National Intelligence NSA - National Security Agency"}]
