[{"comment_id":"10153716841688132","commenter_b":"Sorry but he's not BLACK!!","commenter_a":"Ok President Obamas mother was white.His Grandparents were white.How can white people who say he does not care about white people Really ! You r all pissed because our President is Black?thats the issue with ignorant people who continue to blame our President.Im sure George Bush would not have done anything","post_message":"Barack Obama won't be intervening in Kelly Rutherford's international custody battle."},{"comment_id":"10154045995555329","commenter_b":"@username No Danie, they're too scared to do anything because FEMINISTS THREATEN TO KILL THEM.","commenter_a":"As a man who would literally NEVER talk to a woman like this, I'm ashamed and embarrassed that men actually do. Makes me sick. I was always taught to treat women with respect. Guess that doesn't apply to my fellow man...","post_message":"ICYMI"},{"comment_id":"10154964809584522","commenter_b":"That is very much understood that was real wow","commenter_a":"What a beast! If only the Saints' defense could move like that and cover that much ground!","post_message":"See video of the massive tornado that caused serious damage throughout New Orleans East. Here's another shot of it from another angle in the Michoud area. (Video by Aundra Woodfin)"},{"comment_id":"1746481058744968","commenter_b":"Get out of here","commenter_a":"Traduction: Our thoughts are with the people of ISIS","post_message":"Our thoughts are with the people of Aleppo"},{"comment_id":"10155111456982178","commenter_b":"True, she just lies about everything to get votes. If she wins the WH we are all in trouble. ObamaCare will continue! Taxes will rise! Food prices will rise! More people will be out of work! Education will decline!","commenter_a":"Trump: Make America Hate Again!","post_message":"NEW POLL: Donald Trump is wildly unpopular among young adults, in particular young people of color, and nearly two-thirds of Americans between the ages of 18 and 30 believe the presumptive Republican nominee is racist. wral.com/@username"},{"comment_id":"10154408157211926","commenter_b":"You too, think of humanity stupid or hang yourself with him!","commenter_a":"This liar again! So he's preparing another false flag?","post_message":"Israeli Prime Minister Benjamin #Netanyahu yesterday accused #France of supporting groups that reject #Israel’s right to exist and call to #boycott it."},{"comment_id":"10153796040151336","commenter_b":"Kyle Get off the illegals nuts already","commenter_a":"We need a zero child rule for liberals.","post_message":"Couples in China will now be allowed to have two children."}]
