[{"comment_id":"814443405353112","commenter_b":"if that be the case then throw the Muslims out!","commenter_a":"And what if their choice of attire offends Americans? Will they change their dress code? I doubt it. Squeaky wheel getting attention yet again","post_message":"Catholic University Investigated for Having Too Many Crosses Because It’s Offensive to Muslims @webpagelink"},{"comment_id":"10153925535020579","commenter_b":"Oh, he is VERY Republican. Hardly just in \"name only.\"","commenter_a":"another worthless rino.","post_message":"Clip from Speaker Paul Ryan's address to Congress. Watch full speech here: @webpagelink"},{"comment_id":"1131895816845262","commenter_b":"husbands fault not the woman","commenter_a":"Is this Hilary Clinton? Always the women's fault, cause the man didn't know he was married.","post_message":"A woman found out that her husband had been cheating. She grabbed three of her friends and tracked down the mistress. What she did next is something you have to see to believe."},{"comment_id":"10153167789731336","commenter_b":"Wow only they can attack ppl...what happens to them a slap on the hand!!! When does all this stop? The violence is out of control.. I no if they would of attack my husband an I was in my car..probably would of ran them over or use the gun to scare them off.... Sad that no one helped!!!!","commenter_a":"This is why you carry. Been a few dead teens if it had been me.","post_message":"Caught on camera: A man was viciously attacked in broad daylight by a mob of teenagers while helping an elderly woman at a gas station."},{"comment_id":"10152991332957377","commenter_b":"He is a lot weaker. Building a WAll is a lot cheaper then paying for all the illegals and their so called benefits!","commenter_a":"jeb cant carry his own state.","post_message":"Jeb Bush fights back..."},{"comment_id":"1146391592075725","commenter_b":"ANOTHER RACIST TO PODIUM","commenter_a":"Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry","post_message":"LIVE: Presidential Nominee Donald J. Trump is in Warren to speak to supporters just 8 days before election day. More info: bit.ly/TrumpvisitsMCC"},{"comment_id":"10153732172855575","commenter_b":"Hes a disgrace to the people who voted for him,, a disgrace to the GOP..WISCONSIN you need to send the rhino back to where he come form..","commenter_a":"Paul RyAn is a traitor plan and simple","post_message":"Report: Conservative Veteran may take on Paul Ryan"}]
