[{"comment_id":"10153544587506350","commenter_b":"Real women dont need all that! They are content with the gift of life they just grew in their body for months!!!! This is a little overkill.","commenter_a":"Oh good grief...isn't the baby enough to show off? Must one be materialistic to have to have a push ring?","post_message":"Push presents (the bling or gift an expectant mom is given for, um, pushing) are getting more and more popular."},{"comment_id":"537038436486736","commenter_b":"PUKEBAG, Tax-evading, racist POS!","commenter_a":"What A Joke HE IS DEFINATELY TALKING OUT HIS ASS NOW","post_message":"Dr. Alveda slams Al Sharpton for comparing himself to MLK on live TV. Al Sharpton and MLK should never be used in the same sentence. Do your agree Al Sharpton is a criminal?"},{"comment_id":"10153882907494024","commenter_b":"The monkey bitch and her brood can't be gone soon enough for my taste.","commenter_a":"She complains about the \"house\" she lives in. Is she chained to the wall-?? Just move, bitch-!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"557193267780477","commenter_b":"KEEP GOING TED!!!!","commenter_a":"Wooo! Hooo! Colorado!...We stand with Ben!","post_message":""},{"comment_id":"1265274246854453","commenter_b":"Checks and balances in government is what our forefathers had in mind when creating this country -- to offset those may use position to do heinous things. Banning an entire religion isn't the answer - and yes, it IS banning a religion if you say Christians from these countries can come, just not Muslims.","commenter_a":"But how come , you know , if one who comes over , has bad intentions or not ? This kind of mindset is not too much different , from the mind set of nazis","post_message":"President Donald J. Trump tweeted a message about the federal judge who halted his travel ban."},{"comment_id":"10153141257132490","commenter_b":"Seems like it's the only thing they are worried about .. LEAVE THEM BE. focus time and energy elsewhere. Geeeeesh!!!!!!","commenter_a":"For god sakes leave the uniforms alone!! They are fine as is.","post_message":"YOUR TAKE: CRACKERJACKS -- It's taken a decade to develop new service dress white and blue uniforms. Do you really need both types of crackerjacks? Send your thoughts to staff writer Mark D. Faram at mfaram@navytimes.com:"},{"comment_id":"10153324088600736","commenter_b":"Having a girlfriend costs alot more than a hooker","commenter_a":"You would think that even the ugliest of men can get a girlfriend without having to pay for one...","post_message":"The man showed up at the police station \"much to the bewilderment of those in attendance,\" West Linn police said."}]
