[{"comment_id":"515781365279110","commenter_b":"I wouldn't give any fucking nigger s dime fuck them blue gum peace of shit","commenter_a":"No way! It has been so long it did not personally affect them. Get over it, and move on.","post_message":"This state just approved a resolution which will require residents to compensate blacks for slavery. Everybody is looking for a handout. Slavery has been abolished for a long time. Do you think you should be required to compensate blacks for slavery?"},{"comment_id":"10153678136737217","commenter_b":"You are falling into the hands of the extreme right wing portraying themselves as, \"for the working class.\"","commenter_a":"Voting out because the EU is corrupt. This country full and we should trade with the world. And I don't wont to be under a dictatorship . If it was not for the dedication of the doctors and nurses the NHS cant cope with demand .schools need a teacher. And two teaching assistants .not enough. Housing. And foreign criminals cant besent back","post_message":"What does Brexit mean? And who will be able to vote? Nine days before #EUref, here's a guide about some of the key questions."},{"comment_id":"1707925176144398","commenter_b":"The shemale will sit alone","commenter_a":"He has no right to assume that the people who have died from gun violence would not have wanted to be able to carry That they might have been AGAINST gun free zones.. It's again his agenda if one of my family members had been one lost to these acts of violence I would demand that they NOT SPEAK ON THEIR BEHALF...THAT THE PRESIDENT make reference to the fact that he DOES NOT SPEAK for ALL CITIZENS","post_message":"The Obamas never miss an opportunity to shamelessly politicize an event. At the next State of the Union, Michelle Obama will be sitting next to an empty chair; and the outrageous reason why will have you shaking your head... Are you glad this will be Obama's final State of the Union?"},{"comment_id":"10153679413971051","commenter_b":"I'd inject that bitch with enough meth to make her OD & die. Eye for an eye","commenter_a":"stupid cunt deserves to spend the rest of her life in jail","post_message":"This woman allowed her little boy to overdose on meth. A jury just decided her fate. Decide for yourselves if justice has been served."},{"comment_id":"10153621323058812","commenter_b":"oh grow up Jennifer!","commenter_a":"the cop over reacted why would she have to put her cig out. Give her a fine and move on!","post_message":"At press conference, Sandra Bland's sister shared that she believes Sandra's arresting officer Brian Encinia was \"picking on her. Point blank, period.\" @webpagelink"},{"comment_id":"10152623006528067","commenter_b":"Explain free? Teachers work for free? Colleges get free utilities and maintenance? Books?","commenter_a":"Nothing is free","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"10153147282168701","commenter_b":"Shut up Leah Jesus Christ.","commenter_a":"GUILT BY ASSOCIATION! I GUESS IN AMERICA YOU CAN BE HELD RESPONSIBLE FOR WHAT OTHERS DO, I THOUGHT YOU WHERE INOCENT UNTIL PROVEN GUILTY, BUT THE WHORES OF SOCIETY-AKA THE NEW STATIONS, REPORTERS, OREGONIAN, HAVE TRIED, COVICTED, AND SENTENCED A MAN FOR CRIMES HIS GIRLFRIEND COMMITTED, SOME PRIOR TO THEM EVEN MEETING BUT SOME HOW IT IS HIS CRIME, SHAME ON YOU WHORES!!!!","post_message":"Here's the full resignation letter from Gov. John Kitzhaber, who says: \"I understand that I have become a liability to the very institutions and policies to which I have dedicated my career and, indeed, my entire adult life.\""}]
