[{"comment_id":"901304566673644","commenter_b":"A woman's right to KILL her alive yet unborn child!!!","commenter_a":"Save the fetus- starve the child. They're not pro-life, they're pro-birth.","post_message":"Accurate."},{"comment_id":"1552829708351782","commenter_b":"Nor do any of you have the full story like I do, so please don't speculate on what you don't know.","commenter_a":"in this day and age, a woman shouldn't lose her life during childbirth, I surely hope there is a huge investigation","post_message":"He was at the wake for his wife and 5-day-old baby when he got word that his sister had lost her battle with cancer. Many of you saw the heartbreaking story on NewsCenter 5 and have asked, “How can I help?” Here’s how: @webpagelink"},{"comment_id":"10155137005061037","commenter_b":"Most illegals come here by not wading a river.","commenter_a":"Trump supporters are more worry about illegals than of terrorists what a sad world dnt forget that criminals come of all races and not just cause your brown skin means your from mexico Natives,Mexicans,Italians share the same skin color","post_message":"He once referred to it as “The Great Wall of Trump.”"},{"comment_id":"923411781030392","commenter_b":"You can see intelligence in many statements and never know the color of the person saying it. If you are suprised when you find out, you need to examine what you find in yourself. Common sense ignores color.","commenter_a":"Why when I read this do I keep seeing the statement \"Black mother\" or \"Black woman\" this is the problem with racism in our country. Let's stop using the color of our skins in small comments like these. I feel like this 1 small step would be a huge step in a direction and future with less focus on skin color and more on humanity.","post_message":"Do you agree with Mom?"},{"comment_id":"1092384094157698","commenter_b":"This is a shame, but not unexpected.","commenter_a":"No backbone!!!","post_message":"Donald Trump's takeover of the GOP is complete."},{"comment_id":"10154590275170586","commenter_b":"Which wife is she again?","commenter_a":"It takes a real woman to critize Melanie Trump. She is elligant. She will make a better First Lady than Bill Clinton will make. She hasn't hurt anyone. How can you even mention her name.","post_message":"Lady Gaga has joined the chorus of those criticizing Melania Trump days after the would-be first lady gave a speech decrying bullying online."},{"comment_id":"10154123509664138","commenter_b":"@username is awesome","commenter_a":"Thank You Fox , great pictures.","post_message":"Our favorite photos of Minneapolis aglow in purple for Prince."}]
