[{"comment_id":"10153438446318984","commenter_b":"Give her nothing she encouraged the animals","commenter_a":"hire the thugs who destroyed, burned, looted and rampaged in your streets...serves 2 purposes, gives them a job, gets them off aid, and the plus........your city gets cleaned up by those who wrecked it, with your permission..so use your dollars, not mine","post_message":"The fact that she expects Americans to do THIS for her after the things she's said and the way she handled the riots is truly mind boggling. Are you outraged by the Baltimore mayor's request?"},{"comment_id":"848836128595379","commenter_b":"Eat shit loser!","commenter_a":"No one has won any war against Afghanis.It is history.","post_message":"When you're on a mission to defeat the Taliban, but fly fishing is life. ~Josh"},{"comment_id":"1099414256845409","commenter_b":"No. We will still vote Republican democrat too far away from Christian beliefs","commenter_a":"DNC thugs started the riots.","post_message":"“I will respect that he’s the President, but I’m going to fight every single day to make sure he’s one-term,” a New York protester said of Donald J. Trump's election victory @webpagelink"},{"comment_id":"10153624031427293","commenter_b":"But don't forget it's going to be a wall that's yuuuuge and beautiful and the best part is Mexico is going to pay for it!","commenter_a":"does he have any ideas? any plan other than the wall?","post_message":"\"(Trump) will run into a buzz saw of reality otherwise known as the general election, and he may not know how badly mangled he’ll get.\" via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"10153657606683984","commenter_b":"Bitch--boycott her--hurt her where it counts","commenter_a":"\"Big Mike\" is 200 lbs (after autopsy) of year old worm food. Nothing more no matter how many highways you block.","post_message":"This was probably NOT the outcome Beyonce was expecting when she shared this..."},{"comment_id":"863341973762056","commenter_b":"It's not s scheduled White House speech. It's an impromptu get together organized by Boehner.","commenter_a":"I can't wait until the Republicans find out the Benjamin Netanyahu is not a Christian.","post_message":"Dozens of Democrats are skipping Netanyahu's speech -- including Senator Elizabeth Warren."},{"comment_id":"888747014505260","commenter_b":"Good way to a straight path to HELL!!","commenter_a":"Awful but God will be the judge. Foolish woman.","post_message":"Pro-abortion Congresswoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb. baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here!@webpagelink"}]
