[{"comment_id":"10153475201369170","commenter_b":"Unreal. Liberal democrats are NOT AMERICANS!!","commenter_a":"And how many admirals and generals have been \"retired\" for their conservative, pro strong military views during the current administration?","post_message":"How can we have possibly let it get to this point?"},{"comment_id":"598047807050178","commenter_b":"@webpagelink/ maybe you should wake up","commenter_a":"This action taken against this marine n my opinion is shameful n should b a wake up call 2 the AMERICAN people !!!! WAKE UP AMERICA !!!","post_message":"Marine Arrested For Saying THIS About Obama [VIDEO]"},{"comment_id":"10155219757361159","commenter_b":"They should be deported and he should be in prison.","commenter_a":"So............your entire family is full of criminals and you're going on television to identify them right before we finally start enforcing the immigration laws in this country? Definitely stupid enough to be a Democrat.","post_message":"\"They got a false Social Security card, they got a false identification, they got a false driver license prior to us passing AB 60, they got a false green card, he admitted."},{"comment_id":"10153941419749614","commenter_b":"how is she an idiot, Frank? your original post does indeed come across as victim blaming. rapists don't discriminate. it doesn't matter if it's 9pm or 9am - if they wanna rape someone, they will do it. also, this girl was with her father so I'm sure she felt pretty safe to be out after dark.","commenter_a":"Why would they be at a Playground in Brooklyn around 9 p.m.???","post_message":"Update: Police say they have four of the five males in custody in connection with the incident. Original post: New York police are looking for five men who forced a father at gunpoint to leave his teen daughter behind so they could take turns raping her, authorities say. The 18-year-old was with her father at the Osborn Playground in Brooklyn around 9 p.m. Thursday when the brutal gang rape took place, according to NYPD. Authorities released this grainy surveillance video, taken in a bodega before the violent assault, that they say shows the suspected attackers. Police are asking for the public's assistance in identifying them. Read KTLA story here: @webpagelink"},{"comment_id":"10154290325745496","commenter_b":"Excuse me I'm not a racist I didn't like Clinton either so you just showed your true colors the left always does. I didn't vote for Obama but I sure was praying for the change he promised and boy we sure got it but it was nothing he promised so suck it","commenter_a":"All these liberals like to say Trump started the hate no I believe Obama started it 8 years ago","post_message":"Wondering what the blue ribbon is all about? Here: @webpagelink"},{"comment_id":"1242359992482301","commenter_b":"@username I know, I'm just saying. Course, they could always do what those nutters in that Ukrainian training video do.","commenter_a":"That's great and everything, but it's a whole different thing when there's bullets and shit coming back AT you. Paper doesn't fire back...","post_message":"See more training and combat at > Afghanistan Combat Footage - Funker530 CONTACT FRONT! ~Josh"},{"comment_id":"1410720895627548","commenter_b":"DISMANTLE THE USELESS ORGANIZATION CUT THEIR FUNDING !MONEY TALKS,","commenter_a":"I hope so!","post_message":"Is Trump getting closer to supporting H.R. 1205, the 'American Sovereignty Restoration Act,' to cut ties with the UN?"}]
