[{"comment_id":"10153666561423984","commenter_b":"She doesn't know her ass from a hole in the ground.Correction,she know what her ass is huge.","commenter_a":"Kardashian doesn't have the brain capacity to make those decisions and you better believe Kanye has security we don't have. Go live in the hood, kimmie, and then you can tell us how to protect ourselves.","post_message":"BOOM! Kim K thought she'd talk about gun control laws, and it immediately blew up in her face.   Do you support gun rights in America?"},{"comment_id":"10153059830708984","commenter_b":"F--k her, no I wouldn't","commenter_a":"Are you kidding?","post_message":"I can tell you right off the bat that I WON'T be participating in this. But I am not surprised to see this from Dems. Every chance they get..."},{"comment_id":"10152882681411028","commenter_b":"Man ..... She Can Eat LOL","commenter_a":"I just are a bagel this morning and had a great cupe of Coffey.","post_message":"Molly Schuyler ate three 72-ounce steaks, three baked potatoes, three shrimp cocktails, three salads and three rolls in way less time than it'd take for someone to cook all that food at home.  And the reason she turned down a fourth steak? She was sick of the taste -- not full. @webpagelink"},{"comment_id":"10153917677820695","commenter_b":"Is that the guy walking/running or it's the photo of a car he supposedly driving?","commenter_a":"Police just released this surveillance photo of the man, who was driving a silver car. They say the victim was a 65-year-old woman.","post_message":"#BREAKING: Officers are searching for the man who sped away from the Walmart parking lot.  We have a reporter on the way to the scene and will have a live report on the Channel 2 Action News Nightbeat at 11."},{"comment_id":"10153391185232217","commenter_b":"Lol. First...there are,a lot of people that doesn't know who she is. I personally have seen some of her exploits, but wouldn't recognize her voice. And second most that do follow her \"music\" doesn't care what she does. Nobody gets mad at strippers. Nobody expects her to be smart...just dress in as few clothes as is legal and shake that azz. And lastly...the demographic that was knowledgeable enough to be outraged...went to work.","commenter_a":"Silly racist white people!!!","post_message":"They really weren't happy about Beyoncé's Super Bowl performance, calling it \"racism\"."},{"comment_id":"10153174046691336","commenter_b":"Then stand up and stop him!","commenter_a":"Annddd. What do you intend to do about it? We're waiting.","post_message":"\"Presidents have the ability to take executive action, but they don’t have the ability to change the law.\"  House Speaker John Boehner said that President Obama clearly overreached with his executive action on immigration and changes to ObamaCare on Sunday Morning Futures with Maria Bartiromo."},{"comment_id":"10153828669523984","commenter_b":"So tell me what religion does rule the world ! Plus most of you are SCARED because you have either been the bully or profited from the bullying of other countries ! Just admit that you don't know how get your power back ! It seems to me that 9/11 made our county a rape victim and you see the rapist in every Muslim ! But we've used the same tactics! Oh , you didn't mind sending missionaries over there to convert them , but we don't want them here, even the ones that became Christians ! We reap what we sowed and you still don't see it or get it ! You can't kill them off . We tried that already ! Change how we deal with them for starters. Or we can squat to their level and try again ! But if you yourself are not going to ...","commenter_a":"I think this is a good example of why not to allow sharia law in the United States. We have our own laws that need to be enforced. When you come here that's the laws you follow. Muslims don't rule the world. Time to set them straight","post_message":"These Muslims were going around burning churches, but they were in for a RUDE awakening when they showed up at this one...  Concerns about Sharia being implemented in the United States have been escalating, do you think we could see this spread to the U.S.?"}]
