[{"comment_id":"10153916167801178","commenter_b":"Mommas ain't no saints in this passion play either.","commenter_a":"I agree. Black on black crime is so out of control and too many momma's ate losing their children to death. It needs to stop, all drivebys gang shooters need to be prosecuted to the entire law, not just slaps on the wrist.","post_message":"Sheriff Clarke slams Jesse Jackson for refusing to 'talk about the black-on-black crime in South Chicago.'"},{"comment_id":"10153994656339714","commenter_b":"I'm sure God told her. ;-)","commenter_a":"And how would Carly know how the Clinton's feel about each other. PLUS -- what good for the country was Carly's statement suppose to serve??? It sure didn't make me want to vote for her. We don't need more petty.","post_message":"Carly Fiorina had it out for Hillary Clinton at last night's #GOPDebate."},{"comment_id":"10154026090214087","commenter_b":"Obama give the worlds largest terror sponsor a nuke deal. What the hell is that shit about? I know whats going on. You are just stupid. Hillary's top aide huma is a fucking muslim terrorist. This bitch lived in the middle east and wrote for Islamic extremist magazine. She wrote all kinds of anti american articles. And you dumb dip shits run around blind as a damn bat. You people have some real issues. Liberals are whack.","commenter_a":"I think Obama being the first Black President/so awesome set the bar too high for the first female President. We know many stellar women before Hillary never got a shot in politics. Hopefully Hillary breaking the glass ceiling improves equality even tho shes not ideal.","post_message":"\"Hillary Clinton is still changing the way we thought about women as spouses and politicians.\""},{"comment_id":"10153482509219714","commenter_b":"The girl is a faker","commenter_a":"Once you go black you don't go back. She took it out of context.","post_message":"NAACP leader Rachel Dolezal is speaking out in the wake of controversy."},{"comment_id":"10152847768557690","commenter_b":"How do you steal that many cattle without being noticed? Surely someone saw something","commenter_a":"Who let the cows out?!","post_message":"Officials are investigating how 1,121 cattle vanished from a Texas dairy facility >> @webpagelink"},{"comment_id":"1116556865104033","commenter_b":"ignorant bitch, we are ALL immigrants!!!! VOTE HER OUT & VOTE STRAIGHT BLUE, FEEL THE BERN!!!!!!!!!!!","commenter_a":"When is the last time the republicans filled a bill about anything that would benefit the American people? These fools are of limited intelligence to be sure. Please people vote Blue every chance you get.","post_message":"Republicans are now setting their sights on our librarians."},{"comment_id":"10158514408340354","commenter_b":"@username first Trump wasn't ever going to win. Then he would never build a wall. Then Mex will never pay us back... See where this is going, fk nuts?","commenter_a":"A wall is a slab of steel reinforced concrete buried in dirt This man builds skyscrapers for a living What did those neanderthals think was going to happen lol","post_message":"WOW. WATCH:"}]
