[{"comment_id":"10154487721214062","commenter_b":"Only problem he has to rape to be a thug. Blacks just have to be born and they are considered thugs","commenter_a":"Lol KHOU just called someone a thug! 😂😂😂but seriously he needs to be caught.","post_message":"Please share to get this thug off the streets! He's a violent rapist who sexually assaulted two 16-year-old girls."},{"comment_id":"1192472137454872","commenter_b":"they will have to change the toillets in the White House after this thing used them!! Please change the toilets at least for Melania!!","commenter_a":"It shows her manhood lol","post_message":"SHAMEFUL!!"},{"comment_id":"10153075316564440","commenter_b":"Sarah, maybe if your homegirl wouldnt act so tough against the cops and complied, she would be alive. she rammed a car towards and now she's dead!","commenter_a":"Wow these damn cops can do what they want that's a damn shame","post_message":"BREAKING: No charges against Denver cops who fatally shot 17-year-old Jessica Hernandez dpo.st/1dSxAU8"},{"comment_id":"1015033255223089","commenter_b":"Tariq doesn't represent the real moderate Islam at all! I am Muslim and I do advocate humans rights no matter what sexuality, religion or colour they are","commenter_a":"I dont like ISIS but they did a very good job by killing the gay... Same sex is not permitted in any Heavenly Religion","post_message":"Blindfolded, bound and brutally murdered"},{"comment_id":"1184927621535157","commenter_b":"Obama is an IDIOT! \"Yeah we have Muslim terrorist in this country so now take all the gun away from all the other CITIZENS!\" NO! IMPEACH THIS IDIOT!","commenter_a":"Now you watch yesterday's massacre was intentional. The went to Syria so guess what Obama you ass hole your climate control and gun control is bullshit. Prayers for the Families.","post_message":"Obama responds to the shooting by tightening gun control laws. This is unbelievable. Is Obama incompetent, or just intentionally trying to ruin America?"},{"comment_id":"10157871036080354","commenter_b":"@username that just shows how dumb you are! You actually think that hackers need trumps permission to hack!","commenter_a":"Hillary to Trump: \"We had a deal Don, you were supposed to help me!!!!\" Lol.... Does no one understand the Trump's constitutional rights were violated when he was recorded without his knowledge? This is exactly why we need him. The rule of law is run amuck.","post_message":"WATCH:"},{"comment_id":"417605495104769","commenter_b":"Ummm hmmm. Now ask YOUR grand parents and the rest of YOUR family. Bitch PLEASE lol","commenter_a":"FUCK ALL Y'ALL WHITE AND FAT UGLY MATHERFUCKER! OBAMA OBAMA OBAMA OBAMA OBAMA OBAMA","post_message":"Malia Obama Just Challenged Tiffany Trump, Learns Quick Lesson The Hard Way. You don't mess with the Trump family. Can we get 30,000 'LIKES' for Tiffany Trump?"}]
