[{"comment_id":"986428001390952","commenter_b":"If she doesn't like it let her go back to where she can ask for what she wants and expect to get it because she's Muslim. If one doesn't like our rules go somewhere else.","commenter_a":"Simple solution open and pour content of can into cup in front of customers","post_message":"Your thoughts?  STORY: @webpagelink"},{"comment_id":"10152889795339342","commenter_b":"Thanks to the OTHER hospital! Her hospital didn't even say what Duncan had! They kept it from her!","commenter_a":"Personally, I'd just be happy to be alive.","post_message":"SO CALLED \"EBOLA NURSE\" NINA PHAM PLANS TO SUE: The 26-year-old nurse said that the hospital where she had worked in Dallas and its parent company failed her when she contracted Ebola while caring for the first person in the U.S. diagnosed with the deadly disease."},{"comment_id":"753100741547170","commenter_b":"That whore cares so much about the us she built a school in Africa!!!!","commenter_a":"Fuck that","post_message":"Obama Wants To Put Oprah Winfrey’s Face On The New Dollar Bill.  This is ridiculous. Leave the dollar alone.  Do you think they should get the dollar bill as it is?"},{"comment_id":"10153554876193010","commenter_b":"Yes send them all back,","commenter_a":"Welcome to socialism.","post_message":"The children at this San Bernardino motel pay no attention to the meth dealers on the sidewalks. To the men in nice cars driving slowly through their makeshift play area scanning the doorways for prostitutes."},{"comment_id":"1390719824302205","commenter_b":"Our 4 rescue babies. We couldn't be happier, love them with all our heart.","commenter_a":"If I were granted 3 wishes it would be health and wealth for all my family and friends and that Clyde could talk. We stare into each other's eyes and I ask him about his family and living on the street and all his circumstance and history. I call him a bunch of names to see his reaction, Blackie, Shadow, Coal, Midnight. Larry hates that \"his name is Clyde, you're confusing him.\" I'm also proud to wear a tshirt that says \"all I want to do is drink wine and rescue dogs\" and it has a real red wine stain on the front!","post_message":"This comic shows a dog's heartwarming journey from the shelter to his forever home."},{"comment_id":"1420287694697641","commenter_b":"So where should she be deported for blatantly taking advantage of British taxpayers?","commenter_a":"Reminds me of my mum 9 kids 3 adopted. 4 in care and 2 stayed with her if you cant look after that many kids don't have them ! Keep your legs closed and get your tubes tied !! Why they didn't do that anyway is beyond me","post_message":"'She should have had her tubes tied'"},{"comment_id":"791067471028294","commenter_b":"1. Leviticus 25:44 states that I may possess slaves, both male and female, provided they are purchased from neighboring nations. A friend of mine claims that this applies to Mexicans, but not Canadians. Can you clarify? Why can't I own Canadians? fair price for her? 3. I know that I am allowed no contact with a woman while she is in her period of menstrual uncleanliness - Lev.15: 19-24. The problem is, how do I tell? I have tried asking, but most women take offense. 4. When I burn a bull on the altar as a sacrifice, I know it creates a pleasing odor for the Lord - Lev.1:9. The problem is my neighbors. They claim the odor is not pleasing to them. Should I smite them? 5. I have a neighbor who insists on working on the Sabbath. Exodus 35:2 clearly states he shuld I ask the police to ...","commenter_a":"Yes, Jesus Loves Murderers as well but this does NOT mean He condones the murderer to continue to murder. God created us ALL but the murderer was not created that way just as Homosexual was not either...a sin is a sin. The BIBLE is very clear in this. Sin is delighful & addictive & we tend to consume ourself in our sins hence why it's hard to detour ourself from sin...that's why we NEED Jesus Christ in our hearts. Jesus Christ was tempted in the dessert with everything you can think of yet he continued to tell Satan no & to flee. When Jesus was thirsty & hungry in the dessert & Satan tempted him with food & water He still said no. We have to do the same with temptation/sin. There is ALWAYS a way out of sin if we put ALL our faith/hope/strenth in Jesus Christ He will ...","post_message":"Trey Pearson, Christian Rock Star, Comes Out As Gay. On the other hand, we reported on Jackie Hill-Perry, ex-lesbian, on how God helped turn her life around. Her Story >> @webpagelink"}]
