[{"comment_id":"10153479348993812","commenter_b":"Nobody wants to see your tears lady, we are saving them for the hero you murdered and left to die. Piece of crap.","commenter_a":"She got what she so obviously deserves!!!","post_message":"Woman charged with murder, accused of killing US Navy sailor in fit of road rage: @webpagelink"},{"comment_id":"10153551784963984","commenter_b":"She wants some air time don't give it to her","commenter_a":"Yep","post_message":"These days, Donald Trump seems to be at the center of every controversy. He might just be in the midst of another one after this actress just thanked him for his stance on immigration... Do you agree with Donald Trump's views on immigration?"},{"comment_id":"10154046888226167","commenter_b":"If their lesbians,where does the sperm come from?","commenter_a":"Did he say lesbians pouring blood, and eating milk and sperm? ahahahaha!!!","post_message":"Trump ally Alex Jones claims Secret Service is terrified of \"devil worshiper\" Hillary Clinton because she \"acts like Linda Blair\" and \"flops around on the ground\" and \"spits at them\" and \"stinks!\""},{"comment_id":"838151202944602","commenter_b":"Perhaps she is trying to prove that while she is a Loser at every turn...she is no quitter. She enjoys Losing!","commenter_a":"Why do these people waste money to this degree ??? She's got no shot not even remotely possible . I'm just sayin ....what is the purpose of this ???","post_message":"Her presidential campaign just went down in flames."},{"comment_id":"10154173006980950","commenter_b":"No intel has verified that! Please name names & not newspapers","commenter_a":"If Russia hacked the election to favour Trump, then how did Hillary win the popular vote?","post_message":"NEW: Despite Vladimir Putin denials, U.S. intelligence sources confirm hacks and cyber operation of this scale could not have occurred without his blessing, CBS News' Jeff Pegues reports. @webpagelink"},{"comment_id":"10155037977401509","commenter_b":"Hillary basically said hey let's use intelligence to figure out where they are coming from. Trump just wants to get the military involved and kill them all.","commenter_a":"Both called for war so what's the difference? Obama's the one who's weak. Ms. Clinton is a savage compared to Obama and Trumps Attila The Hun lol","post_message":"Donald J. Trump and Hillary Clinton struck different tones following the attack."},{"comment_id":"1134361886576067","commenter_b":"Totally agree!","commenter_a":"We need to have Trump supporters at all polling places. ALOT of cheating will be going on to stop Trump GET THIS WORD OUT.","post_message":"Things could always change, of course nothing is ever set in stone in a presidential race. But for the time being, Trump not only the party frontrunner, he is actually defining the race for everyone else"}]
