[{"comment_id":"963644947039340","commenter_b":"But she is dirty","commenter_a":"She knows women's issues best","post_message":"Watch live as Hillary talks to students at New England College in New Hampshire about the issues on their minds."},{"comment_id":"1027529210615833","commenter_b":"PLEASE DON'T Watt just leave already ! AND DON'T COME BACK !","commenter_a":"I hope the hell so!","post_message":"Bye Rosie!"},{"comment_id":"10153539588391037","commenter_b":"these pigs should have never been given the attention.","commenter_a":"If anyone believes the Duggars are all better now, please let your kids do a sleepover there and let us know. We'll wait for your report","post_message":"After weeks in limbo stemming from revelations of Josh Duggar’s sexual misconduct, the reality show \"will no longer appear on the air.”"},{"comment_id":"10153162026679091","commenter_b":"Stephanie, he wants ILLEGAL immigrants gone. And Americans have been doing just fine before the influx of Mecican Illegals before and will after!","commenter_a":"He'll be crying when there is nothing for him to eat because its the immigrants that work the field for our food, and run our plants that provide our meat. He wants immigrants gone, he should be the first to leave. Give this land back to native American people, the earth was pure and clean. Be a leader Trump, lead yourself out","post_message":"Donald Trump has released his specific plan for immigration reform: @webpagelink"},{"comment_id":"975168282518593","commenter_b":"Better be sure. Our us h hospital are not allowing this.....What. If. Patient wants non Islamic nurse. Because is this practice?","commenter_a":"STOP with the offending of muslims.....this is the United States of America...land of the free.... Who gives a crap if your offended....","post_message":"Whoa!"},{"comment_id":"10152814272036973","commenter_b":"Dogs hurt others to protect themselves, their pack, or their belongings out of instinct. Humans have the ability to think before they hurt others, yet they still choose to do it. This is why I care about animals more than most people.","commenter_a":"To bad people don't care bout homeless people as much as they care about dogs. Smh","post_message":"Every day, on average, three dog bites serious enough to break this skin are reported to authorities in the Portland area. In round numbers that's roughly 1,000 people injured annually."},{"comment_id":"10155259941361756","commenter_b":"Yep Aussie too. All true above. Totally embarrassed and ashamed ourselves and our political leaders also often call them illegal immigrants not refugees 😢","commenter_a":"Australia, please know that he does not speak for us. Thank you for your humanitarian efforts.","post_message":"The deal concerns refugees -- not \"illegal immigrants\" -- who have been housed in offshore detention centers on Nauru and other islands."}]
