[{"comment_id":"971472706302942","commenter_b":"That's where she belongs! That's where she belongs! That's where she belongs! That's where she belongs! LOCK HER UP!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"More Wikileaks revelations: 1) Ted Cruz allegedly asked the DNC for MONEY to help fund his delegate fight in Cleveland (specifically: Eric Bennett to and from Ken Cuccinelli, R-Virginia working with Ted Cruz and the DNC to undermine the delegate selection before the convention). Working to push through rules changes in the rules committee and working to flip bound delegates against the rules and state law. All co-ordinated with the DNC. 2) Jake Tapper of CNN allegedly colluded with the DNC. They gave him questions to ask his interview guests. 3) Chuck Todd of NBC allegedly was also colluding with the DNC and put pressure on others at the network to go easy on Democrats at the DNC’s request. 4) The New York Times allegedly co hosted parties with the DNC. This is against the law. 5) Hillary Clinton allegedly setup a slush fund through the DNC to launder donor ...","post_message":"Live Now: Jesse Watters and Brian Kilmeade are here at the Facebook Live Lounge from the Democratic National Convention and they're taking your questions! Comment below:"},{"comment_id":"474511766072737","commenter_b":"Can't do that until you remove the Muslim president who encourages them to take over.","commenter_a":"we need to take our Country back. We outnumber them let stop the insanity. Dont let any mosks be built in this country. We cant build Churches in theirs. If they dont like it here than leave. No one would care.","post_message":"Muslims force this school to ban Christian holidays. America is under attack, this is treasonous. 'LIKE' if banning Easter is WRONG!"},{"comment_id":"10153253183992690","commenter_b":"Hispanic Race Mexican Race Human Race Everyone is a Race!","commenter_a":"I do not hate Mexicans! So get that straight! Illegal alien does not necessarily mean \"Mexican\"! Seriously????","post_message":"A former Texas DPS employee at the Irving office is sentenced Thursday for selling driver's licenses to dozens of unauthorized immigrants. @webpagelink"},{"comment_id":"10153717285696509","commenter_b":"Looking better then the women in his home","commenter_a":"Should be on the cover of freaks magazine","post_message":"Caitlyn Jenner is on the cover of Vanity Fair, in an image shot by famed photographer Annie Leibovitz: @webpagelink #CallMeCaitlyn"},{"comment_id":"1185974561486681","commenter_b":"Motherfucka must of been hella hungry","commenter_a":"Ys Ir","post_message":"Ladies, would you let him?. #WSHH"},{"comment_id":"976949909016658","commenter_b":"Female Opinions? Female Opinions Being Heard? Female Opinions Mattering? #BananaPeelSledToHell","commenter_a":"We need more where I live!!","post_message":"It's a slippery slope, America"},{"comment_id":"10153157541959641","commenter_b":"Yes Dilma get the hell out!","commenter_a":"protests? you can't never even think about it ! if you join to a manifestation group you can get killed or lose your job if you be an influent person , you can get bribed and many people are shut because of these reasons this is the message that we've been received from our fathers the message has been transmitted from generations to generations a message of fear were the law is to rule the poor .","post_message":"Hundreds of thousands marched in Sao Paulo, Brazil, with one message for President Dilma Rousseff: Get out. cnn.it/1ynM33B"}]
