[{"comment_id":"987010284749083","commenter_b":"oh i would get me a few mini pigs i can have 3 here in my town in town. then i would put pig crap on the lawn all around my home i would be so mean. if i could hear them i would call the cops everytime make it a real pain","commenter_a":"Dope, I'd have pork on the grill and my guns loaded and pointed right at it. A sign saying come and get it, your choice on which one you want","post_message":"What would YOU do if you were put in this situation? Choose one of the two options! @webpagelink"},{"comment_id":"1504784736221446","commenter_b":"U sound like a bitch","commenter_a":"And the award for the most useless attempt at contribution to society goes to.... The author of this article. Wonder if that student debt you got from studying journalism at university was worth it. Merry Christmas","post_message":"As you can imagine, it did not go well."},{"comment_id":"10152889836291491","commenter_b":"Felicitari !","commenter_a":"I hope she and her baby are both well safely","post_message":"It's a girl!! @webpagelink"},{"comment_id":"10153200958788837","commenter_b":"?","commenter_a":"That cop needs to be arrested for having an illegal \"agresive breed\"","post_message":"PUPPY THROWN - Local 10's Michael Seiden has the latest on a poor little puppy that was thrown from a passing car right near the North Miami Beach Police Department"},{"comment_id":"10153363875728352","commenter_b":"We all need a break dumbass bitch but you don't see us throwing our kids out the car !!","commenter_a":"Yep she look like she need a BREAK!","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"},{"comment_id":"10153854800096955","commenter_b":"@username loooooooool u stupid Americans are cute. Have fun finding water in 5 years 😜","commenter_a":"You should have to have a comprehensive background check before anyone can just buy a knife and close the knife show loop hole . Problem solved !","post_message":"NYC Residents On Edge After 3 Slashing Attacks In Less Than 48 Hours..."},{"comment_id":"10153722777028822","commenter_b":"if that female can do it and make it big go for it i would like to see it","commenter_a":"Its bound to happen because they are plentiful and killing it in the minors and its just a matter of time before one breaks into the big leagues. Smh...","post_message":"What do you think? Do you agree with Pittsburgh Pirates manager Clint Hurdle?"}]
