[{"comment_id":"1544946612212472","commenter_b":"Superior to a chimp maybe.......","commenter_a":"He's such a moron! And his father has the nerve to say he has superior genes!","post_message":"What an idiot!"},{"comment_id":"10154501246119255","commenter_b":"NUTS","commenter_a":"moron","post_message":"What a stooge. By Daily Kos user teacherken"},{"comment_id":"1189206507769062","commenter_b":"Because white motherfuckers like you","commenter_a":"If black lives do matter....., then ask me this then and give an honest answer...., why have they not stopped selling illegal controlled substance off the streets? Why have they not make their community better for everyone? When was the last time they bring something positive to the community? Why can they not stop shooting each other for the upmost stupidest reason? When was the last time anyone was able to think for themselves and not allow the social media or the government telling them how to think? Why do they pull the race card whenever they get caught up in a felony offense and not man the hell up? Graduate from High school and get a career.","post_message":"#BlackLivesMatter were not happy with this speech"},{"comment_id":"10153277427691756","commenter_b":"Bitch","commenter_a":"@username: 28 years too late","post_message":"They can reshape within weeks."},{"comment_id":"10153279327706973","commenter_b":"Your saying this restaurant chain is hateful and kills animals when dozens of others do exactly the same thing? You do know that cows and fish are animals and killed in order to make the food you find at McDonald's, Burger King, Wendy's, Arby's, Subway, Taco Bell, Panda Express, Red Robin, Dennys, IHOP, etc. right?","commenter_a":"Don't do it! They're a little too conservative for our area. Do people really want to support a company that not-so-secretly opposes equal rights (not to mention the whole killing of animals thing...)? @webpagelink","post_message":"The fast-food chain is looking to to add one or two restaurants a year until there are 10 to 12 locations in the greater Portland area."},{"comment_id":"10153315514576336","commenter_b":"That turbofan jet engine intake is sturdy enough to handle the weight of that woman. Also, her derrière is not going to effect the shape of the intake. It is designed to handle air pressure from 250 knot IAS relative wind that at altitude could be as high as 550 knots TAS. So, what's the big deal? I think the picture looks COOL!!!","commenter_a":"I do not think so. The preconditions are whether the company has the clear policy for it, whether she got enough training of behavior in the company?","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"10153837082186130","commenter_b":"Just like a woman - fickle and gossipy.","commenter_a":"I'd like to see a woman president too. The right woman president. Someone so awesome she makes everyone wonder why we waited so long for that woman. I don't think we've found that woman yet.","post_message":"It's not neccessarily an endorsement for Hillary Clinton, but..."}]
