[{"comment_id":"10153836803272623","commenter_b":"Good players But it's another\"L\"","commenter_a":"Ga...NO ....Riverboat must have sank and Cam Ain't ..... stupid Panther Fans","post_message":"The New Orleans Saints beat the Carolina Panthers in a 41-38 victory Sunday in New Orleans."},{"comment_id":"10153876447145329","commenter_b":"Attention whore.","commenter_a":"Laura This might help you understand some stuff","post_message":"Is ~everyone~ on Twitter fighting? (via BuzzFeed UK)"},{"comment_id":"822921484411860","commenter_b":"Run him out of America or sent him to Islam for good !","commenter_a":"Absolutely YES! Police are bound by laws and orders that do not allow any other real form of expressive protest. This sends the message loud and clear. It is also a great honor of solid support to the murdered officer whose Mayor helped provide the hostile environment in which this officer was murdered.","post_message":"Was this the right move?"},{"comment_id":"10153874605884270","commenter_b":"Jagdeep Singh Jagge sir, you need to study english literature. Also, Japan is/would be a US ally over China. You can not live in the past. Basing a country's actions on what happened nearly 100 years ago now is folly. The world and possible battlefield is ever changing.","commenter_a":"Japan technology is far ahead thn china, just they don't showof or not interested in military anymore after world war2(japan use less than 1% of his gfp for military).","post_message":"There has been a dramatic increase in sorties for the Japanese in the past year."},{"comment_id":"1272811836073158","commenter_b":"I wouldn't mind my dick being six feet longer","commenter_a":"Is this before or after birth......if so I know many candidates for editing DNA to make civilised human.....step forward 8b7...there are some 'adjustments' needed.","post_message":"Should we be allowed to edit human DNA?"},{"comment_id":"1469983173042150","commenter_b":"#Youcantdefendit #grabthembythepussy #anybodybutTrump","commenter_a":"Folks we should be talking about this Obama care collapse and how our premiums are going up in 2017 by 26% scary . My family can't afford this !!!","post_message":"The story just keeps getting worse, and worse."},{"comment_id":"10153938173248967","commenter_b":"That girl a punk","commenter_a":"It's been crazy windy. Was hard to walk.","post_message":"What's that nickname for Chicago, Illinois, again? Stay safe, people"}]
