[{"comment_id":"936532806442972","commenter_b":"Is that a bad thing?","commenter_a":"Oh, please. He will become the biggest clown in the clown car.","post_message":"Donald Trump knows what he’s doing in 2016 ..."},{"comment_id":"10154675817978984","commenter_b":"@username, she broke the law dumbass.","commenter_a":"Good for her. We should be thanking her not vilifying her.","post_message":"This presidential candidate was just busted ON CAMERA for doing the unthinkable. Supporters never saw this coming..."},{"comment_id":"1812447718973572","commenter_b":"Trump could not be trusted with his own password on Twitter!","commenter_a":"Habeis conseguido que este mas hasta los huevos de los que hablan de Donald que del pato.","post_message":"Only four days until the inauguration! Who will be meeting president-elect Trump today?"},{"comment_id":"10152919448276636","commenter_b":"May I remind people of this classic. I used to watch it at my Granny's house every Saturday. @webpagelink","commenter_a":"Racism is an intentional act. This is not racism. Just because it sounds the same does not make it a slur on Pakistani's in any way shape or form. It's a different spelling with a different meaning entirely. whomever started this nonsense needs to be kicked in the butt for trying to stir up trouble.","post_message":"The WHAT are out of containment?"},{"comment_id":"10153043792241680","commenter_b":"Hillary Clinton 2016!!","commenter_a":"Maybe it's his fault...no cant be.","post_message":"He says it would be \"an unforced error\" if Republicans let the government shut down."},{"comment_id":"1474175135944775","commenter_b":"Two idiots,","commenter_a":"Hard to do when she said she wrote the speech herself, how did we get to this guy being nominee, wow","post_message":"Did they do it on purpose?"},{"comment_id":"10153000556273855","commenter_b":"You're the most ignorant bitch here so far. Congratulations on stepping back two centuries.","commenter_a":"If a Christtian owned biz loses business for serving gays, it has the right to say, hey guys, dont take it personal, i need to make a living...go elsewhere. WTF U MEAN I CANNOT REFUSE SERVICE? THE ONLY PEOPLE I CANNOT REFUSE SERVICE IS TO BLACKS DUE TO SLAVERY AND BLSCKS BEING OUSTED AS AMERICANS SIMPLY BECAUSE OF SKIN color. Sexual stuff...can be a challenge to many. Leave people alone. Ask them to leave you alone. By the way - imFOR gay union, but not in a church.","post_message":"First Yelp, now Angie's List!"}]
