[{"comment_id":"1148538801848206","commenter_b":"Get well soon.","commenter_a":"That was an amazing thing he did. He is too be commended. Oorah","post_message":"BREAKING NEWS"},{"comment_id":"1121295257893818","commenter_b":"Maybe the sign should have said \"ladies don't pee on the toilet seat\".","commenter_a":"By the Holy Ghost I am being formed in the Earth! Says the Lord, My Time has Come! When I say, , My Kingdom COMES FORTH! Now is the Day of Salvation! Whoever wants it . Whoever is thirsty for Right and Good, . Whoever is hungry for Love and Peace and Deliverance from evil, . Now is The Time!!! When u Ask me, I give. Whoever Asks will Receive. Believe! Believe! Believe! Now is The Time!","post_message":"The owner of Windy City Pizza posted a sign that appeared to reference the controversial topic of transgender restrooms: @webpagelink"},{"comment_id":"10152960734572014","commenter_b":"They need to leave them alone! Stay out of our business in az this is our state Feds!!!","commenter_a":"These horses must be left alone! They cause zero harm, and countless amounts of pleasure to all who see them! Using the logic of \"public safety\" then why haven't all the bears in our National Parks been removed???? I had an uncle when I was very young who worked for the Forest Service. I'm sure this would shocked by this action.","post_message":"Arizona Governor Doug Ducey has voiced his support for leaving the wild horses where they are."},{"comment_id":"1033161420090232","commenter_b":"Hispanics are illegals? Since when? Your profile photo just proves you're racist.","commenter_a":"Pardon me...illegals don't vote so does it matter","post_message":"A presidential candidate must win at least 40% of the Hispanic vote to win an election in modern America. Here's why that's very bad news for Donald Trump."},{"comment_id":"10152917139561051","commenter_b":"Kim, Please show me where the white kids were doing this. I must have missed this.","commenter_a":"Can anyone explain why blacks act like this? Is it something about IQ?","post_message":"These kids thought it would be funny to jump on people's cars and dent them. It took about a minute before someone noticed and decided to make them regret it."},{"comment_id":"884089625114947","commenter_b":"Well pack up lady!","commenter_a":"And just how they all accuse others of lies. Well i dont see any of their fake asses leaving","post_message":"Hey Barbara, we'll help you pack. See ya, never!"},{"comment_id":"10155810276030725","commenter_b":"DO AM I STUMPING FOR DONALD? NOT SURE YET, MAYBE. Definitely our country has had already more than enough from LYING lawyers turning politicians! After all, LYING is the job they do best and nothing else really matters to them. Talking to many Hispanic,- with common sense- good friends of mine, I found out that they all agreeing with DONALD TRUMP! And it's not because they aren't hospitable and compassionate people. To the contrary! It's because of the fact that most of these illegal bad apples in their efforts to blend in and avoid being getting caught, always have settled in their neighborhoods bringing their drugs their street gang attitudes and criminal ways with, and my friends are the very first to have been victimized by. Now of course not all illegals are bad, but some are and one is too many. That's the reason we have legal immigration so ...","commenter_a":"I'd like to know how many illegal immigrants Trump employs and has employed.","post_message":"Statement on Relationship with NBC-"}]
