[{"comment_id":"10153393698278606","commenter_b":"The statement would they would have been fired if it was a white man is stupid,they should have been either way and the point is it wasn't, if this is the kind of judgement they you I wouldn't trust them to protect and serve","commenter_a":"It looks like two hunters with a deer...what's racist about it?","post_message":"One of the two police officers who was fired after posting this photo wants his job back: @webpagelink"},{"comment_id":"924300044274003","commenter_b":"Duh...He's a Liberal!!! He wants Fox to continue pying him, even thought he won't kick his alcohol and drug problem!!!","commenter_a":"Can you send Juan Williams with him?","post_message":"Bob Beckel isn't going to stay silent in the face of a harsh Fox News statement announcing his departure form the network."},{"comment_id":"10153677956363961","commenter_b":"@username Yes, those stupid one.","commenter_a":"In case you haven't notice, Tom, Obama has given the \"middle finger\" to Americans since he's been in office, always going against the will of the majority. We'll remember you when your term is up.","post_message":"Proud to help secure a new federal grant to improve public transit and fix traffic lights in 10 Connecticut towns"},{"comment_id":"10152780954836094","commenter_b":"A whore doesn't care who pays them, but whomever pays them calls the shots of the services to be rendered.","commenter_a":"The \"corporate system whores\" can't make treaties with foriegn governments. Only political whores can do that.","post_message":"Within the economics discipline, Joseph Stiglitz has been one of the Trans-Pacific Partnership's most outspoken critics. The Nobel Prize winner in economics recently shared his concerns about the TPP at a community meeting in Queens, New York City."},{"comment_id":"10154316513732235","commenter_b":"douche bag....that's it...you're the guy in school that doesn't make ANY team....because you're a class 1, grade a douche bag.","commenter_a":"These people are so insincere...they make me sick.","post_message":"Paul Ryan just smirked and laughed when asked how many more times he could rebuke Trump's racist ideas without rescinding his endorsement."},{"comment_id":"10155319348083132","commenter_b":"Jesus this is absolutely heart wrenching","commenter_a":"Rest in peace","post_message":"The 21-year-old mom is being hailed a hero for her quick-thinking in saving her newborn."},{"comment_id":"10153362958101955","commenter_b":"I agree. The Barbarians are within.","commenter_a":"Our own government is the biggest terror threat we've ever had.","post_message":"House Intel Committee Chair: US Is at 'Highest Threat Level We Have Ever Faced'..."}]
