[{"comment_id":"10152904243581636","commenter_b":"If she wanted to kill herself she would have hope she frys!","commenter_a":"Those poor babies. This poor woman. I can't say I understand killing her babies, but she is very obviously severely depressed. I only wish she had gotten the medical attention she so clearly needs before she took such drastic measures.","post_message":"Officials say a Connecticut mother who allegedly murdered her two children left a suicide note next to the children bodies, explaining why she killed them."},{"comment_id":"1161299523890076","commenter_b":"overly politically correct, nail on the head!","commenter_a":"he offered no defense...merely doubled down","post_message":"\"I think the big problem this country has is being politically correct. I've been challenged by so many people and I don't frankly have time for total political correctness and to be honest with you this country doesn't have time either.\""},{"comment_id":"1074625052604249","commenter_b":"Send tits hoe","commenter_a":"The title said don't ruin it. Dumbasses can't read or see a blunt 🙄","post_message":"Don't spoil!"},{"comment_id":"1191296707568558","commenter_b":"Shawnee has some pretty crazy, unnecessary rules. Girls can't dye their hair to any color that is \"unnatural.\" They wouldn't of been able to walk either.","commenter_a":"So I wonder how many people could walk that have green or purple or blue hair but facial hair is not OK??","post_message":"Do you agree with the school's no-beard policy?"},{"comment_id":"916443248422431","commenter_b":"Wow what a bitch!","commenter_a":"@username sad","post_message":"SMH: Mother Tries To Abandon Her Son In The Street!"},{"comment_id":"1359940970684036","commenter_b":"wish they would lock her up and throw away the key.","commenter_a":"That Lady makes 18 million maybe she could give up some of her salary for the poor kids that need pen to not die...something wrong with this.","post_message":"UK's price: $69 Germany's price: $218 America's price: $600"},{"comment_id":"10156802863905354","commenter_b":"She's def a whore! Well said","commenter_a":"Hillary is nothing more than a lying, conniving political whore.","post_message":"REVEALED:"}]
