[{"comment_id":"679207482232542","commenter_b":"Criminal woman Brave !!","commenter_a":"Hillary is so brave for being a woman!","post_message":""},{"comment_id":"685505648280301","commenter_b":"@username don't worry, she'll deny, lie and get out of it. Doesn't she always!","commenter_a":"They say truth is stranger than fiction but this is ridiculous. We now have a presidential candidate running for office under investigation by the FBI and she is allowed to continue her campaign?","post_message":"BREAKING NEWS: New emails that prompted the reopening of the Hillary Clinton investigation came from devices owned by Anthony Weiner and Huma Abedin, according to an FBI source. @webpagelink"},{"comment_id":"765017110298136","commenter_b":"I agree. That would stop illegals dead in their tracks!","commenter_a":"If they would allow the soldier to shoot that vermin off the fence, that shit would end","post_message":"For some reason, this truth is lost on liberals, but what isn't?"},{"comment_id":"10154105863319087","commenter_b":"Anyone who has an education voted for Bernie, because they know that Hillary is a liar and a right-leaning moderate. #BernieOrBust","commenter_a":"Clinton also leads with people who have educations. Gee, go figure","post_message":"Donald Trump may be rich, but the rich actually prefer Hillary Clinton."},{"comment_id":"10154335593072293","commenter_b":"Doesn't it amaze everyone how trump gets away with not being transparent at all with his tax returns, his business ventures, etc, etc, etc...but if Hillary Clinton spits on the sidewalk, the world comes crashing down on her! #DOUBLESTANDARD","commenter_a":"With most of the criticism coming from left wing gossip rags like WaPo! Lmao at the yellow journalism!","post_message":"On Monday, criticism of Comey continued to mount, notably from prominent former law enforcement officials."},{"comment_id":"10155770026010354","commenter_b":"She would England better than America.","commenter_a":"And I will remember not to vote for you!","post_message":"Facebook pool: how long until there's a hunting photo op to show how much Hillary understands sportsmen?"},{"comment_id":"10154441744191509","commenter_b":"WE STAND WITH TED CRUZ----WE WONT VOTE FOR JIMMY NUTS CARTER ENDORSE TRUMP OR ILLEGAL ALIEN AMNESTY PROMOTER RUBIO.","commenter_a":"Jessi Spires Ben Kraja Alex Gochis Tyler Teejay Chase","post_message":"Three white nationalist leaders have formed a super PAC for Donald J. Trump, even though Trump doesn't want their support.  #NewHampshire voters are getting a robocall with a simple, disturbing message."}]
