[{"comment_id":"1243385125672214","commenter_b":"@username ill kill you","commenter_a":"@username @username Jane Ní Chonchubhair Gala Ní Mhuireagáin boop","post_message":"BOOP"},{"comment_id":"1179483682071660","commenter_b":"And what is going to stop the criminals from getting guns????? All a gun ban would do is disarm us everyday, good citizens who want to protect ourselves from THE CRIMINALS with guns!!!!!!!","commenter_a":"Stop protecting guns over people. The NRA is laughing at you people every time you defend a gun over a life.","post_message":"A gunman opened fire on a reporter and cameraman during a live television broadcast in rural Virginia."},{"comment_id":"10153765423589170","commenter_b":"@username you are spot on 100%. You don't allow a foreign entity into your country and let them have an area nor let them \"work it out\". Because that area gets a little bigger then a little bit more before soon they are running the country.","commenter_a":"Rahm assisted his Muslim brother Obama in degrading the police when they did do their job. Now the police are afraid to do their jobs.","post_message":"The irony here is that it's HIS ideology that has cops afraid to do their jobs.  His ilk spent the last eight years calling everyone racists.  Now he has the nerve to complain about the outcome?"},{"comment_id":"10154769435278812","commenter_b":"Does this lady ever stop lying roflmao","commenter_a":"and Hillary thinks her connection to black voters is carrying hot sauce in her purse.","post_message":"Addressing the National Baptist Convention in Kansas City, Hillary Clinton took a veiled shot at Donald J. Trump, who made his first trip to a black church on the campaign trail this past weekend and has been making a pitch for the African-American vote."},{"comment_id":"992170134153660","commenter_b":"She is a nasty, vile woman...","commenter_a":"What about the part where it was not illegal to have that information on a private server you could have debunked it as well","post_message":"\"Ahead of the #DemDebate, this is the video Hillary doesn't want you to see.\" - Reince Priebus."},{"comment_id":"639140816274210","commenter_b":"Just like your whore mother.","commenter_a":"She is a pig.","post_message":"I am sick and tired of Michelle Obama and her family in the White House...GET OUT!"},{"comment_id":"10155754872529778","commenter_b":"@username The more educated? Ooookay... Silly. Smh They're out there marching for you too. Remember that, girlfriend.","commenter_a":"@username Wow look at these comments. Even from women... Ignorant people... This country is in trouble.","post_message":"Ashley Judd says blood on your pants is a sign you're a woman. FULL SPEECH: @webpagelink MORE: @webpagelink"}]
