[{"comment_id":"10154067022696336","commenter_b":"All you have to do is watch him lady.","commenter_a":"Well, I don't know if Donald Trump is a Christian or not and neither does that pope. Only Donald Trump and God knows that. And I heard a man on TV this morning calling the pope \"the Holy Father\" and my bible says to call NO MAN Father, but your Father in Heaven and I DO KNOW THAT IS GOD.","post_message":"Donald J. Trump responded to Pope Francis suggesting that Trump is \"not Christian.\" @webpagelink"},{"comment_id":"10154830070756337","commenter_b":"I feel good Hillary is going to win","commenter_a":"I'm with her!","post_message":"We're counting down to Tuesday's election. Tell us how you feel..."},{"comment_id":"477691072379670","commenter_b":"Where are the weapons and the drugs??????????Ha!Ha!","commenter_a":"The majority of people coming across the southern border are peasant farmers. They bring illiteracy and tuberculosis.","post_message":"When some Americans think of illegal immigrants, they picture gang members. Drug dealers. Ruthless job stealers. Armed with hypodermic needles and Ebola, coming here to beat puppies and filch Girl Scout cookies, while toting crates of cocaine, prObama propaganda, and other satanic supplies. But what do real immigrants look like, and what do they bring to the US?"},{"comment_id":"1736088283296773","commenter_b":"And women!","commenter_a":"Shout out to CFD and their brave men and women that r serving","post_message":"BREAKING: A massive fire is burning in Chicago's Lake View Neighborhood. At least 3 buildings are engulfed in flames. A BIG shout out to the CFD for their incredible work."},{"comment_id":"1494929760811093","commenter_b":"Isis isn't islam... Hahaha okay","commenter_a":"If Islam is a peaceful religion why is every Muslim country in turmoil and its citizens are totally controlled by the Imans and the Koran? Don't believe the lies of political correctness.","post_message":"\"Before you say, 'War is what ISIS wants,' realize that's simply an argument for inertia and putting off the inevitable. Does that make me a war-monger? Sure. It also makes me a global survival-monger.\" Last night on \"The Greg Gutfeld Show,\" Greg Gutfeld said radical Islam needs to be countered with \"radical Americanism.\" @webpagelink"},{"comment_id":"10152937049646051","commenter_b":"Hang her","commenter_a":"Loser","post_message":"A pregnant woman with drugs in her system crashed her car and killed a 5-year-old. When police told her the child had died, she had a two-word response for them."},{"comment_id":"196351097508558","commenter_b":"Ginger ass snowflake whiny bitch","commenter_a":"You have the right to be a dumbass ya crybaby snowflakes","post_message":"While Republicans stick to zero solutions and plenty of petty insults, the rest of us are hard at work rescuing our democracy from dictator Trump. Video by Occupy Democrats. LIKE our page for more."}]
