[{"comment_id":"10153904790105496","commenter_b":"Why is this guy not convicted yet...","commenter_a":"Oh no!","post_message":"Thermal experts say temps inside Ross Harris' SUV could have been as much as 125 degrees while Cooper was inside. Watch LIVE trial analysis now: @webpagelink"},{"comment_id":"10153221269572464","commenter_b":"Yes, Hillary should indeed be going to jail, for life! People were killed because of her. :(","commenter_a":"I think she should be going to trial instead of running for president....","post_message":"We need to restore America’s leadership: @webpagelink"},{"comment_id":"10154271758836336","commenter_b":"oh god, its attack of the uneducated middle aged housewives!","commenter_a":"bush is guilty of actual war crimes, but no, lets just crusade against a democrat because they are a democrat. you retards disgust me.","post_message":"BREAKING NEWS: The infamous Romanian hacker known as “Guccifer,” speaking EXCLUSIVELY with Fox News, claims he easily – and repeatedly – breached former Secretary of State Hillary Clinton’s personal email server in early 2013."},{"comment_id":"10154645517167599","commenter_b":"@username Trump should be in the swamp!!","commenter_a":"Everyone needs to be more like Romanians. At least they doing something about corruption in their government.","post_message":"We were live from the anti-government protests in the Romanian capital, Bucharest. The demonstrations are in response to the passing of a decree that will free dozens of officials jailed for corruption."},{"comment_id":"535176933316799","commenter_b":"give them hell Mr Trump,she makes me sick everytime i look at her","commenter_a":"Enough of these two !","post_message":"The heat-seeking Trump tweet you just HAVE to see..."},{"comment_id":"10153587807310861","commenter_b":"If she wear a pasta strainer then.i will wear my niqub where only my eyes show.","commenter_a":"Expresses her beliefs....and remains single","post_message":"#LateNightLink Lindsay Miller says wearing the spaghetti strainer allows her to express her beliefs, like other religions are allowed to do."},{"comment_id":"1748878815344677","commenter_b":"1150623618341674Harshit @username","commenter_a":"Matteo Rinalducci","post_message":"They Grow Up So Fast."}]
