[{"comment_id":"10153853099981680","commenter_b":"Abedin: she \"could not use a computer\" So much for Hillary being the great email mastermind.","commenter_a":"Ok, so what!! There is no federal statute that prohibits this! There is an executive rule, which if this article is true the Executive who created said rule exempted by communicating with Clintons private email. That said using a pseudonym may create legal issues for Obama that have never been thought about by lawmakers","post_message":"#Breaking: Obama used a pseudonym in emails with Clinton, FBI documents reveal @webpagelink"},{"comment_id":"783835985050207","commenter_b":"Ginny don't forget under obummer gas was over $5 a gallon. Our healthcare got destroyed. Illegals flooded our country sanctuary cities like where Kate from the unpassed Kate's law was MURDERED by a loser criminal ILLEGAL career criminal thug. I could go on but I've found that the foolish people out there that haven't woken up yet never will.","commenter_a":"I love how about Obama and Hillary want to save the world but not America","post_message":"Obama plans on bringing in 10,000 Syrian refugees, but Hillary Clinton wants to increase that to 65,000. What do you think?"},{"comment_id":"10156946534115093","commenter_b":"Hillary will trounce Trump because 70% of voters dislike Trump. That's the math.","commenter_a":"Ya use your own mind governor vote trump don't be an establishment governor. Trump is who the people want.","post_message":"Governor Mike Pence should exhibit the leadership that conservatives have come to expect from him."},{"comment_id":"10154282712736409","commenter_b":"Exactly! We would not have over 8 million illegal immigrants if not for Obama. Now the President that follow him has to figure a way to clean up his mess.","commenter_a":"Irony: everything that Trump is doing, including building a wall, was set in motion by establishment Democrats.","post_message":"Fox thought the border wall reference was \"too controversial to air during the Super Bowl.\""},{"comment_id":"10153369157063984","commenter_b":"Fire them all and make new hires sign a contract that if they are caught stealing anything they will pay back double the amount of the theft. The citizens work hard for their money and it is the taxes they pay that keeps those in Washington working.","commenter_a":"Hey, as long as they're paying for their gambling and \"adult entertainment\" out of their own pockets, well..... that's between them and God! But, if I'm paying for any part of it, then \"nail them to the wall\"!!!","post_message":"This has got to be a big embarrassment, and they probably thought they'd gotten away with it..."},{"comment_id":"1037656442936422","commenter_b":"@username , I agree .","commenter_a":"Absolutely! This is the first campaign I have been able to follow totally since I retired, and I am sickened by how words that I have heard myself are mis-quoted and lied about, mostly by the Democrats. The lies are really incredible to me. Do they think nobody is paying attention?","post_message":"Huckabee says the mainstream media is making sure Clinton is \"presented in the best light,\" and goes out of their way to make Trump look bad. Is he right?"},{"comment_id":"1680724472211527","commenter_b":"The falwells have been stealing and lying to americans for years. So it goes without saying thieves run together.","commenter_a":"Fallwell has lost his gourd.","post_message":"What a great honor- the Reverend Jerry Falwell Jr. of Liberty University, one of the most respected religious leaders in our nation, has just endorsed me!"}]
