[{"comment_id":"10154545590463010","commenter_b":"#NeverHillary #NeverTrump #JillStein2016","commenter_a":"Hmm, funny that you could say all the exact same things about Clinton. Time to stop pretending she's better than he is. Sorry y'all - we let the US drift so far to the Right a Trump popped out, but that isn't his fault. Particularly when he isn't the war criminal candidate between the two major party offerings...","post_message":"Psychiatrists aren't supposed to psychoanalyze presidential candidates. A Yale psychiatry professor writes in Los Angeles Times Opinion:"},{"comment_id":"10152900911316336","commenter_b":"Jane looked to further her movie career ,it didn't work.Scumbag","commenter_a":"Traitor!","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."},{"comment_id":"714217398680845","commenter_b":"Kill all the bad muslims!!","commenter_a":"Muslim POS","post_message":"And he's wasting no time launching his attack..."},{"comment_id":"485585728298674","commenter_b":"She is death warmed over!","commenter_a":"Not the first time Nancy has been hit. A face rearrangement could only improve her looks.","post_message":"Greta just kicked Pelosi to the curb... Good. We need more American women like Greta and less like Pelosi. Do you support Greta taking on Pelosi publicly?"},{"comment_id":"10156583768975389","commenter_b":"Build #TRUMPWALL","commenter_a":"Google Trends data shows Donald Trump was the most searched candidate during the debate, both in Iowa and across the country.","post_message":""},{"comment_id":"10153575842934087","commenter_b":"If she withdraws we can toss her and Bernie a Peanut.","commenter_a":"Of course, who wants to be a target for Hillary shaming?","post_message":"Pressure is building on Democrats to rally behind front-runner Hillary Clinton after her strong Super Tuesday showing, but 22 House members and five senators are holding back."},{"comment_id":"1192472137454872","commenter_b":"they will have to change the toillets in the White House after this thing used them!! Please change the toilets at least for Melania!!","commenter_a":"It shows her manhood lol","post_message":"SHAMEFUL!!"}]
