[{"comment_id":"10153128289641636","commenter_b":"You got daughters?","commenter_a":"Absolute madness.....by all means reprimand him through school procedures but don't criminalise him....it's somewhat excessive.","post_message":"She was 14"},{"comment_id":"594388797376563","commenter_b":"To all of you saying fair game and all that.... You are no better than the republicans that did it Michelle Obama, you should be ashamed of yourselves","commenter_a":"People of character do not talk negatively about someones' spouse nor kids. End of that discussion. With that said, I sincerely hope Carson never holds any public office at this stage of his life due to what appears to be his deteriorating mental faculties. He is running for president of my country so that is a legitimate comment of my concern of his abilities. This comment does not in any way extend to any members of his family.","post_message":"He's a candidate, so that means she is automatically in the spotlight - but do people really need to be so cruel?"},{"comment_id":"10153323990951509","commenter_b":"Certainly makes most if the rest of us look very lazy","commenter_a":"'@webpagelink WATCH THE ABOVE YOUTUBE VIDEO LINK.THIS IS THE BREAKING NEWS I WAS TAKEN IN HEAVEN AND SHOWN THE TRUMPET BEING BLOWN AND JESUS COMING VERY VERY VERY VERY FAST AND VERY VERY SOON. THIS IS THE LAST WARNING.JESUS IS COMING FAST AND SOON Ezekiel 3:27 But when I speak to you, I will open your mouth and you shall say to them, 'This is what the Sovereign LORD says.' Whoever will listen let them listen, and whoever will refuse let them refuse; for they are a rebellious people.","post_message":"He trudged the better part of a marathon each workday. Donations poured in for the Detroit man whose daily commute is a 21-mile walk: @webpagelink"},{"comment_id":"10153240911786491","commenter_b":"Women spend 25 percent of their lives menstruating. That is the biggest reason we spend more time in the bathroom.","commenter_a":"The only way to have bathroom equality is for women's toilets to have the same turnover rate of women coming out of the bathroom as men. Just because it's the same physical size restroom doesn't mean it's an equal situation.","post_message":"'Many public restrooms continue to be facilities that are equal in physical space, while favoring men’s bodies, experiences, and needs.'"},{"comment_id":"1004458709688902","commenter_b":"Yo entiendo","commenter_a":"'@username should fucking be ashamed of themselves. I see that you are just like most Corporate News Organizations which takes a real issue then contort it for your clicks and likes. I am a Black American. I have been living in the Dominican Republic for 3 years. I hold 3 degrees to include a JD and an LLM. I am going to tell the truth and I hope to never see such nonsense like this published again. As I said I been here for 3 years. I came here not knowing a word of Spanish because I as a Black Man wanted to get away from America. I spent 11 years in the Marines also and I have traveled the World and NO WHERE have I been or felt more free than living in the Dominican Republic and that is a very real yet sad statement, a testimony if you ...","post_message":"This Video Sheds Light on the Deep Racism That Black People Face in the Dominican Republic #ABSArchives"},{"comment_id":"10157577335255389","commenter_b":"Gonna rain in wall street. The same ones you took millions from you pathetic lying hag","commenter_a":"its hard to listen to her speaks! the first thing came out of her mouth was Trump says did and Trump says that and what Trump did! nothing change she offer nothing! she looks doll up but still a liar!!","post_message":"Journalism. Is. Dead."},{"comment_id":"988150574624052","commenter_b":"They are acting like school kids, so the best way to handle them is to ignore them.","commenter_a":"get off the dang eggs birdXD","post_message":"EAGLE CAM DAY 4: One egg has cracked and we spotted an eaglet. Watch it fully hatch now: @webpagelink"}]
