[{"comment_id":"10153014667776955","commenter_b":"I lived in NY, not the first blizzard or the last...whats different now is the libtards have forced energy production to stagnate or decline while the population increased - aka people are going to freeze to death in their own homes. This is just nature being nature. Lets not make something out of nothing.","commenter_a":"Good place for it.","post_message":"BLIZZARD WATCH NYC, BOSTON HISTORIC"},{"comment_id":"1954618021430775","commenter_b":"It aint over till the fat lady sings,lol","commenter_a":"Mark my words, in future presidential elections, candidates will try to do what Donald Trump is doing.","post_message":""},{"comment_id":"574676589404983","commenter_b":"What a stupid bitch","commenter_a":"She should have seen that nazi meathead Trump fan telling Mexican protestors to make him a burrito. Way more uncivilized than what's happening here. What a stupid statement.","post_message":"She should have seen the \"uncivilized\" civil rights sit-ins that won her the right to be on Fox News."},{"comment_id":"801914353278362","commenter_b":"Trump will crush this fat ugly lying lady","commenter_a":"Love how the little girl scout is pointing out the cookies to you. Rock on Hillary -supporting you in Colorado. Ignore the haters inWV","post_message":"Cookie stop in Kentucky. Picked up some tagalongs and samoas before heading across the border to West Virginia."},{"comment_id":"10153117013549740","commenter_b":"We wouldn't have any thugs!","commenter_a":"Good idea","post_message":"\"We need to get around this idea that you can resist arrest. You can’t. You just can’t do it. It results in potential injuries to the officer, to the suspect. And we need to change that, and the way to change that is to start penalties for it.\""},{"comment_id":"10155148038011336","commenter_b":"Trump doesn't refute facts in any logical way. He doesn't present evidence to the contrary, just declares that anything negative about him is fake news. Does this not concern any of you?","commenter_a":"Funny how people have forgotten the numerous times Obama called @username out during speeches, press appearances, and other forums. But Trump doing the same thing is suddenly \"horrible\" and shocking...","post_message":"\"He has EVERY RIGHT to call them out.\" On \"FOX & Friends Weekend,\" Herman Cain discussed President Donald J. Trump's often contentious relationship with some in the mainstream media."},{"comment_id":"10154187969491615","commenter_b":"@username 99.9% could be prevented if the women had any morals....","commenter_a":"I hope everyone marching plans on adopting a kid or two. If your so concerned with the baby being born, you should actively participate in rasing it.seeing as the parents dont want to or they would have an abortion. So please sign up at the front entrance and take your unwanted child when you leave. Thanks for keeping kids outta foster homes and orphanages.","post_message":"This year is a historic one as Vice President Mike Pence is spoke during the march. It is the first time a president or vice president has taken part in the March for Life. _____________ UPDATE: (1:35 p.m.) The livestream has ended. Full story on.wpxi.com/MarchForLife"}]
