[{"comment_id":"884379288251594","commenter_b":"Sexy diva girl","commenter_a":"Nache Mishell","post_message":"[Watch] ABC Unveils Sneak Peeks For The Return Of TGIT @webpagelink Speaking of good TV...who's ready for Scandal and HTGAWM?"},{"comment_id":"1244207775611835","commenter_b":"That's why she wants to let them all in and use up our benefits and drain it. Enough is enough.","commenter_a":"Well just in case you needed another reason to NOT vote for Hillary here it is. But sadly, this nation is over run with uneducated and uninformed voters who will vote for free stuff that is anything but free to to american taxpayer.","post_message":"Obama used executive actions to grant amnesty to millions of illegal immigrants WITHOUT Congressional approval. Hillary Clinton says she will go EVEN FURTHER!"},{"comment_id":"10153619175294753","commenter_b":"I know right?? It kills brain cells!!!...lol","commenter_a":"I heard it was worse than 2 Broke Girls.... I don't know how that is humanly possible .......","post_message":"Fuller House, the spin-off of the classic ABC sitcom Full House, finally hit Netflix this past Friday and the reviews are in. With all apologies to John Stamos, there are a lot of critics out there that simply have no mercy for this nostalgic reboot (okay, that was a really bad pun). Fuller House picks up 21 years after Full House, which left television screens in 1995 after eight seasons on ABC. This time around, DJ (Candace Cameron Bure) takes the Danny Tanner (Bob Saget) role as she’s... @webpagelink"},{"comment_id":"10153649800077894","commenter_b":"Such a hateful bitch","commenter_a":"So Janet Jackson cancels her tour, gets pregnant and then has the nerve to drop a new video that was basic as all get out......Janet will see you after the baby because 2016 is not for you.","post_message":"Janet Jackson – Dammn Baby [New Video]"},{"comment_id":"10154348216771337","commenter_b":"Michael Joseph wow this guy has balls, he's about to lose 100,000 to the Rap God","commenter_a":"That's cute","post_message":"WTF? Nick Cannon has quite the challenge for Eminem."},{"comment_id":"806970826068192","commenter_b":"shes a scum and should of been executed","commenter_a":"20 years later omg you mean this scum is not dead yet?","post_message":"\"I was a good mother and I loved my boys.\""},{"comment_id":"10153016885814117","commenter_b":"The word you will never hear from your wife, @username.","commenter_a":"Perhaps the costs of CC regulation should be compared to the costs of climate change inaction? CEA finds what economists would call “increasing marginal costs” of delay. If we don’t make a concerted effort to keep the rise in average global temperature within the range consistent with modest costs and instead allow it to stabilize one degree Celsius higher, the annual additional damages would equal 0.9 percent of global output. A longer delay that added another degree would cause additional annual damages of 1.2 percent of global output. That’s a total change of 2.1 percentage points. To illustrate those annual costs more tangibly, 2.1 percent of current U.S. GDP, which is about a fifth of world output, is roughly $360 billion. The story doesn’t end there, however. There’s a lot of uncertainty around these estimates. Acting sooner rather than later is insurance against unpleasant surprises. We’re happy to pay fire ...","post_message":"Today, President Obama and the EPA are announcing the final regulations that would establish President's Clean Power Plan. How much will it cost you?"}]
