[{"comment_id":"1116402168438318","commenter_b":"Darren VM They don't want the imbecile either, probably why he ran here! LOL","commenter_a":"I don't understand how this humiliates Obama. I don't understand why Michelle is included in this. I don't understand why any sane American will be for humiliation of an American President regardless of agreement on issues.","post_message":"Obama may think he's Europe's favorite politician, but Queen Elizabeth just made a stunning announcement that put Obama right in his place.  You know Michelle was furious when she heard about this."},{"comment_id":"10154137971976323","commenter_b":"You cannot stop it, it's a done deal. The pacific couldn't stop the TPPA, North Americans couldn't stop NAFTA. These deals are done above our heads, I very much doubt you would be allowed to leave the EU even if you wanted to.","commenter_a":"Have you read the EU's conditions on public services they want within TTIP? It looks to me as though these would offer considerable protection to NHS services; are we sure that our Government would have similar protections? See @webpagelink I was very much against TTIP and concerned about EU position until a colleague brought this to my attention.","post_message":"\"If being in the EU has brought us TTIP, it has also brought us the means to stop it.\""},{"comment_id":"1211081885612641","commenter_b":"It's been 20 years since we've had a caring honest president. The last 8 years have been Muslim run, no doubt. When a commander in chief refuses to acknowledge we have terrorist attacks within our USA...isis islamic terrorists","commenter_a":"Screw Obumer!","post_message":"95 YR OLD WWII VETERAN Writes Scathing Letter To Obama: “I can’t figure out what country you’re the president of”"},{"comment_id":"10153415623385329","commenter_b":"Lol","commenter_a":"None of these \"helpful tips\" helped me... not one tit.","post_message":"The nightmare ends today."},{"comment_id":"10156221727930389","commenter_b":"#Trump2016forPRESIDENT Build that Wall !! Make America Great Again is the only one running to can get the job done a Strong Leader ... carson is no-way President Material","commenter_a":"I am still voting for #TRUMP because he enforces the laws and is paying his own way and does not want a salary he is working for what is right for the American People","post_message":""},{"comment_id":"10153310022881051","commenter_b":"Why is this vermin still alive?","commenter_a":"Blow him off the face of this Gods earth!","post_message":"Al Qaeda's leader just called for a 'lone wolf' terror attack on the United States - and that's not even the worst thing he said. (via VICE News)"},{"comment_id":"521171901404436","commenter_b":"No I sure hope they stop these refugees from coming to our state in Arizona!!! Don't want them here!!!","commenter_a":"Come on fla...join texas","post_message":"Is your state in this MAP?"}]
