[{"comment_id":"558741910917069","commenter_b":"Well a lot of the problem is, is she is a woman. I guarantee you she is going to have to fight a lot to become President, now and if she becomes president it will only get worse.and I am not voting for her.","commenter_a":"Shut up, Ben!!! You're out of this race.....","post_message":"Does Clinton's use of a private email server prove she has poor judgment and is unfit to be president?"},{"comment_id":"10153896267090329","commenter_b":"How about don't send dick pics to anyone. If she wants to see it she can come over...","commenter_a":"The only one I dont support is the woman who shared a screenshot of the dick pic. Yes, unsolicited nude photos are completely uncool. BUT if a woman sent a boob pic to a dude without Asking him if he wanted one, and he shared it on the internet ... Well this would be a whole different post.","post_message":"More and more every day, women are turning to the internet to find the justice the real world won't give them."},{"comment_id":"10154266076039071","commenter_b":"They will be new Amazon GO stores!","commenter_a":"I AM COUNT DRACULA","post_message":"The retail industry is heading into 2017 with a glut of store space."},{"comment_id":"10157871036080354","commenter_b":"@username that just shows how dumb you are! You actually think that hackers need trumps permission to hack!","commenter_a":"Hillary to Trump: \"We had a deal Don, you were supposed to help me!!!!\" Lol.... Does no one understand the Trump's constitutional rights were violated when he was recorded without his knowledge? This is exactly why we need him. The rule of law is run amuck.","post_message":"WATCH:"},{"comment_id":"900210363349638","commenter_b":"Yep, definitely my twin lol","commenter_a":"@username this you lol had to double take lol","post_message":"“There has never been anything like this seen in a fish’s gills before.\""},{"comment_id":"10153957745968132","commenter_b":"wow pretty stupid its not like the jungle book jeez idiot she should be caged","commenter_a":"Who the hell in the PEOPLE staff is in charge of the facebook page that writes obsurd comments?? What the hell is terrifying about this situation?? Nothing! She was a moron that snuck into a zoo and decided to pet it. She got what was coming to her. Terrifying..would be if it's normal business hours and a tiger came out of its cage.","post_message":"This is so terrifying!"},{"comment_id":"10153218890796336","commenter_b":"^ baseball, hockey, and wrestling","commenter_a":"Should white people riot the NFL Draft?? 95% black were drafted last night","post_message":"JUST IN: Five of the six Baltimore police officers charged in the death of Freddie Gray are in custody, according to Mayor Stephanie Rawlings-Blake. @webpagelink"}]
