[{"comment_id":"10153851827136336","commenter_b":"Deport. Muslin. And. Religion. Stop. Terrorist. America. Now","commenter_a":"Pretty sure there's a lot more than one already in the US.","post_message":"\"We know that ISIS is deliberately using the refugee crisis to insert fighters into Europe. Why wouldn't they do the same in the United States?\"  Tonight on \"The Kelly File,” Sen. Marco Rubio explained that if just one ISIS fighter manages to slip into the U.S. among the refugees, it's a big problem. @webpagelink"},{"comment_id":"805710002902059","commenter_b":"But no one will ever do anything. She is above the law","commenter_a":"My biggest problem with Hillary Clinton is the fact that she condones an abortion minutes prior to birth, leaking national security time limits during a nationally televised presidential debate. She has been held non-accountable for any of her mischievous, murdering, actions. If she gets in she will be following Obama's legacy, and our country is doomed","post_message":"ARREST!"},{"comment_id":"10152950800096770","commenter_b":"Why doesn't she talk about the women her husband has been with considering her looks I don't blame him.","commenter_a":"I'm offended by the fact she isn't behind bars yet.","post_message":"At a campaign stop in New Hampshire on Monday Hillary Clinton slammed Donald Trump's recent remarks about Fox News host Megyn Kelly as \"outrageous\" but said that other Republican men running for president have made equally \"offensive\" remarks."},{"comment_id":"10153239073114087","commenter_b":"Becky, you ignorant slut.","commenter_a":"Why is the fact shes a woman the issue? This kind of rhetoric just signals their hypocrisy, in one breath decrying sexism and then in the next taking advantage of it.","post_message":"\"I first would like to register my opposition and my objection to the chairman beating up on a woman, on our witness today, for making a good salary,\" Rep. Carolyn Maloney at today's Planned Parenthood hearing. \"The entire time I've been in Congress, I've never seen a witness beaten up and questioned about their salary. Ms. [Cecile Richards] heads a distinguished organization providing health care services to millions of Americans. I find it totally inappropriate and discriminatory.\""},{"comment_id":"10152961909207894","commenter_b":"Jessica Denise u got the good job, penis all day like that? Well dammmmm","commenter_a":"It was a little 🍆🍆🍆🍆🍆 but I seen it.","post_message":"Woah! LeBron James Accidentally Flashes His Penis on Live Television [Video]"},{"comment_id":"10154666429943258","commenter_b":"Go back to France, sing a song and appease all the Muslims......","commenter_a":"Immature. You should do what your customers ask of you.","post_message":"James Taylor wanted Fox News changed at Boston Logan International Airport. Here's what Bill O'Reilly had to say about that."},{"comment_id":"616988195096921","commenter_b":"If they don't like it, what can the Republicans offer that's better. We need well educated people.","commenter_a":"Where do I sign?","post_message":"The President just announced something very BIG - a proposal to make two years of community college free for anyone who’s willing to work for it.   #FreeCommunityCollege"}]
