[{"comment_id":"642298305928438","commenter_b":"she needs to bait Bill to keep him away from other lady`s","commenter_a":"Even if this is true, what does it say about Trump that he is so easily baited. Trust me Little Miss Bimbo, Trump doesn't need anyone to bait him, he finds ways to be an ass all by his lonesome.","post_message":"It isn't like he makes it really hard. I don't think he needs any help."},{"comment_id":"1644362728922565","commenter_b":"But haven't you heard....those votes are all from dead illegals","commenter_a":"Electoral College must do the right thing and prevent Trump becoming president. Now 2.5 million more people voted for Clinton than Trump!","post_message":"Were you wondering why Trump talked to Taiwanese President?"},{"comment_id":"579350648893184","commenter_b":"These other ones need to keep on walking","commenter_a":"At Portland High graduation three young muslim woman remained seated during the National anthem, one of them grabbed the hand of the young muslim man who was standing , trying to get him to sit.He brushed her hand aside and remained standing.Then she turned around to face a large group Muslims and tried to get them to sit.Everyone of them remained standing.","post_message":"Muslim Students Walk Out During National Anthem [VIDEO]. If you don't respect our country, feel free to leave. Do you find this disrespectful?"},{"comment_id":"10156223165790354","commenter_b":"Hell no they wouldn't. I'm still waiting on them to post the story about the white guy in South Dakota, that accidently shot his penis, while purchasing a gun illegally and tried to blame it on a black guy. They didn't even post the story about the white people in TX, that vandalized their vehicles and tried to put the blame on BLM. This page is a joke.","commenter_a":"I wonder if @username would have featured this news item if the chick was white ? Somehow I doubt it.","post_message":"And look what ELSE she did..."},{"comment_id":"1252245691520631","commenter_b":"Simple...don't allow anyone in from radical terrorist countries until their country has a way to prove who the person is. Until then they can all stay there and fight in their own countries. Make their own America or their own hell. Whatever they want. But don't do it here.","commenter_a":"Time to shut the doors to these people. All. Until there is a better system.","post_message":"Don't expect to hear a word about this in the media.   This is the kind of info that is horrible for the left."},{"comment_id":"1385848588104594","commenter_b":"@username orange anus.","commenter_a":"Karma is a bitch. What goes around, comes around. Your day will come, cheeto face, orange anus.","post_message":"UPDATE: Following the publishing of this article, Fox 2 posted a follow-up story saying Mike Hager, who said his mother passed away of a medical condition after being denied entry to the U.S. despite holding a green card, lied to their reporters.  Hager's mother died five days before the ban went into effect, with Trump's de facto Muslim ban playing no role, Imam Husham Al-Hussainy told Fox 2."},{"comment_id":"10152774422166051","commenter_b":"Why are some people allowed to have kids??","commenter_a":"Please, can we eliminate these sh*tbags from the gene pool?","post_message":"Police found this 3-year-old boy sitting in the backseat of a car in freezing cold temperatures. His dad and babysitter had something more important to worry about."}]
