[{"comment_id":"10153871207061336","commenter_b":"No dear, Hillary Clinton was First Lady, a US Senator and Secretary of State. This little nobody was never anything close. Glad to help you. Leave the comedy to the professionals.","commenter_a":"This little nobody from Arkansas with no job is still making noise? LOL!","post_message":"\"That's one of the frustrating things about this president – he always tries to make it that he has the moral authority and everybody else is wrong.\" This morning on \"FOX & Friends Weekend,\" presidential candidate Mike Huckabee slammed President Barack Obama's approach to policy disagreements. @webpagelink"},{"comment_id":"10153759489753812","commenter_b":"How do you know? One year of college did not teach you much","commenter_a":"Creationist heads explode...","post_message":"Researchers in South Africa believe they may have uncovered a brand new “relative” to humans, and they have named the new branch of the family tree Homo naledi.@webpagelink"},{"comment_id":"10153844066851770","commenter_b":"******* PENCE WHIPPED WITH A KAINE *******","commenter_a":"Not too much for me to say, I hope they both lose. God bless the U.S., amen.","post_message":"The #VPDebate is over, but there's still a lot to talk about. Like that rumor that Trump is mad about Mike Pence doing so well, or all those times Tim Kaine interrupted him. Keep watching for a special round of trivia, starring a giant tub of Nutella. Your hosts: Christopher Bedford, Christian Datoc and Katie Frates."},{"comment_id":"1516899938343259","commenter_b":"Yet when guys write this type of stuff all women are emotionally hurt ad need to bitch to the moon. Regardless, these women are virtually worthless. Never date a feminists they have nothing to offer a man at all. Zero. Let them die 60 and single","commenter_a":"I can say with 100% honesty that I would avoid every one of those selfish cunts as if they carried the plague. And i feel certain that these are the same daft cunts that will cry about the matriarchy if men were to make an article just like this.","post_message":"\"If someone was quite a weird child, he tends to be a great date.\""},{"comment_id":"1077408458966678","commenter_b":"Malyk Bonnet, how fortunate for that young woman that you trusted your indtincts and took some very brave action. You ARE a HERO!!!","commenter_a":"Benjamin Fournelle Sylvie Bonin","post_message":"This teen had a hunch, so he hopped on a bus to a different city. He might have saved a life. - Robbie Couch"},{"comment_id":"10153655864652217","commenter_b":"Allah the greatest ever 💖💖💖","commenter_a":"“This life is not real. I conquered the world and it did not bring me satisfaction… God gave me this illness to remind me that I’m not number One; He is.” Muhammad Ali You will be missed #Champ #RIP","post_message":"Muhammad Ali was famous for his pre-fight braggadocio, predictions and quips."},{"comment_id":"10152760483166051","commenter_b":"I guess she rubbed them the wrong way......","commenter_a":"They didn't arrest her but they issued her a citation.","post_message":"Police took one look at the video this girl posted from the Oregon State University library and arrested her immediately."}]
