[{"comment_id":"10154075062351037","commenter_b":"And she banged Frank enough to make Dutch jealous, and to tell him to eff off. 😘","commenter_a":"one classy Lady that loved her husband and her country","post_message":"“She totally saw her role as supporting and defending her husband.”"},{"comment_id":"10153222476276323","commenter_b":"Breasts are breasts. get over it.","commenter_a":"The fact that womens nipples are considered porn and men's not, given the fact that ours are literally NEEDED as a vital source of nutrients for children is a notion that needs to be challenged. How can something that provides the best source of nutrients for a baby be considered too obscene to be observed in public where as men's which are just another body part be considered fine?! Free the nipple doesn't require a woman to bear all. I won't be, I've had no reason either functionally or otherwise to display mine in public (it's a bit cold in this part of the world) but my body is not obscene. I totally support the women doing this. If nipples are so provocative it's the sexualisation that society places on women not the female nipple owners that are the problem.","post_message":"\"It has to be said that, to the casual observer, the #FreeTheNipple campaign is a very confusing thing. Let’s just get this straight, one might say, it’s a feminist movement that encourages toplessness, and which has led to an Icelandic MP, respected as a serious parliamentarian, getting her boobs out for everyone to see. And you’re telling me this is one in the eye for the patriarchy?\""},{"comment_id":"10153640013936636","commenter_b":"O questo o un procione non voglio altro siamo io e te li vedi li vedi Dio pinolo?!","commenter_a":"Luca sparati in bocca con me","post_message":"Red pandas have an adorable wrestling competition  Via Detroit Zoo"},{"comment_id":"1105899882819941","commenter_b":"@username typo, bitch!","commenter_a":"Donald Trump 2016! Because as an American hispanic, I'm tired of how all of these coward racist liberals that hate America like Obama, Clinton, Sanders, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, I'm supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of my skin... disgusting. That's why I and others support Donald Trump. Please support the movement by getting the \"Trump Strong\" t-shirt at:www.teespring.com/trumpstrong . And let's Make America Strong Again! Thank you.","post_message":"They do NOT want people to see this one!"},{"comment_id":"515543338636246","commenter_b":"Go home","commenter_a":"Absolutely...","post_message":"These Muslims thought they could do this, big mistake.  Good. This is America, they need to learn their place.  Do you support these Muslims being thrown out of the building?"},{"comment_id":"10153700369301600","commenter_b":"Florence Colo is the federal supermax for the U.S.......","commenter_a":"HELL NO TAKE THEM TO WASHINGTON DC","post_message":"Republican Congressman Scott Tipton’s office said he believes the transfer of some of the world’s most dangerous terrorists from Guantanamo Bay to Colorado is “unacceptable.”  What is your opinion?"},{"comment_id":"10155747108715389","commenter_b":"Not here by illegal means of any kind. LEGAL immigration only.","commenter_a":"Our nation is totally off track right now. We need new leadership, someone who is 100% American and can get us back on track again.","post_message":"\"[I]t is being done as an express plan by the left because they want voters more favorable to liberal policies.\"  Last night, Ann Coulter gave her unvarnished opinion on immigration in the U.S."}]
