[{"comment_id":"10157011618750354","commenter_b":"Would someone please tell me why these THUGS have not been arrested or gased?","commenter_a":"Dumb ass negros !","post_message":"WATCH the insane footage of the BLM radicals...  'I will f*ck sh*t up!'"},{"comment_id":"10154184530456167","commenter_b":"And before anyone gets on me for it, personhood is moot and an unsupportable argument because of bodily sovereignty. Nobody, adult or child or fetus, is entitled to use someone else's body parts without their permission, EVER. If you have kidney disease you don't get to take someone else's kidney by force - not even if your life depends on it and you'll die painfully if you don't get it. If you have leukemia and need bone marrow, you cannot take it from someone else without their consent - even though marrow is fully replaceable by a healthy adult and it'd only be a temporary inconvenience to them. Men can't use a woman's genitals for their own pleasure unless she consents - that's why rape is (supposedly) a crime (even though punishment for it has been tragically lax these days). A woman's uterus is HER body part, she has it ...","commenter_a":"It's just a political witch hunt, like usual. It's not about women's safety or anything like that - it's about earning points with their base on the backs of Texas' poor women.","post_message":"**Fourteen** investigations have cleared Planned Parenthood of all wrongdoing, for starters."},{"comment_id":"1072716372784891","commenter_b":"You want 'the happy, secure, tested and moderate side of life every day' ? Happiness? Even Russia is above the US : en.wikipedia.org/wiki/World_Happiness_Report Tested ? Europe says hi. Moderate ? Bernie is centrist left here.","commenter_a":"I read something the other day from my pal and it's stuck with me all week. I'm paraphrasing here but in a nut shell... He said 'I don't like extremes. We have one guy saying he's 'going to make America great again' and on the opposite end of extremes we have another fella shouting for 'revolution'!! ' I'll take the happy, secure, tested and moderate side of life every day. #ImWithHer","post_message":"'The most qualified candidate, and someone who is, by all reality-based measures, progressive.'"},{"comment_id":"585591074975467","commenter_b":"He must be some form of illegal alien. Where do orange people come from?","commenter_a":"Prepare for 4 years of unrelenting mocking until you take this job seriously and treat people with respect","post_message":"Trump is such a crybaby..."},{"comment_id":"10152941725546051","commenter_b":"I feel for him. The cops and courts don't help. He stopped him once and for all.","commenter_a":"I would have done the same ~ if our laws were CORRECT pedophiles wouldn't be as big a problem! He should NOT be the one in jail !","post_message":"“I just want you to know, I ridded one less (expletive) child molester from the (expletive) earth that (expletive) with my little brother,” he said. “Alright? That's all I got to say. I don’t give a (expletive) how much time they give me. Doing time is the easy (expletive) part.'"},{"comment_id":"10152640565354135","commenter_b":"BOOO ! Fix our roads , decriminalize drug use ( since our prisons are flooded with NON violent offenders wasting everyones tax dollars on free room and board), allow Tesla Motors to do business in our state, handle the heroin epidemic going on in our cities and sub-urbs , preserve more forrest and farm land ............. He's not doing his job , he's pressed for his future candidacy for the white house , neglecting the nuances in his community.","commenter_a":"Go @username 2016","post_message":"America has been a nation that has always controlled events and yet today events control us. Why? Because leadership matters. It matters if we want to restore America's role in the world, find the political will to take on the entrenched special interests that continually stand in the way of fundamental change, reform entitlement spending at every level of government, and ensure that every child, no matter their zip code, has access to a quality education. So, today I am announcing the launch of the Leadership Matters for America PAC. The PAC's goal to get real leadership back in our country starts today. So, let's get to work! Join us at: @webpagelink"},{"comment_id":"891950114161178","commenter_b":"That's her claim to fame, now and forever! Smh!","commenter_a":"Uh...that's a lie because I had never heard of her prior to the tape shenanigans! !!","post_message":"Kim Kardashian Says Her Biggest Regret Is Sex Tape With Ray J, But Shuts Down Claims That It Made Her Famous @webpagelink"}]
