[{"comment_id":"1150086235078889","commenter_b":"Hillary Clinton for President!","commenter_a":"This guy.....God help us all if he's elected!!!! Gary Johnson!!!! Love how he talks about jobs when he's notorious for trying to break up unions and has his own clothing line made in China!!! l","post_message":"WATCH LIVE: Donald J. Trump holds rally in Florida"},{"comment_id":"880834145309668","commenter_b":"Yeah the cunts wife found out through facebook hahah","commenter_a":"'@username Will Woods","post_message":"It just keeps getting worse."},{"comment_id":"10152510366081813","commenter_b":"Sound like another feminists that loves the idea of discrimination. Gee, imagine finding you here.","commenter_a":"And then ACLU discriminates by stating ' This one is dedicated to all the girls out there'.. LOL","post_message":"This one is dedicated to all the girls out there who prefer reading science fiction and history books to love stories.  @webpagelink"},{"comment_id":"596204130539541","commenter_b":"'@username I think most people are okay with accepting refugees. PROVIDED, that they become members of the country they decide to make home. Non of this lets make Sharia law zones like back home bollocks. How do you separate the good from bad? Only allow families in? That hardly sounds fair. Just be aware that when you accept them in you accept responsibility for them. Anyone raped. Any bars burned down. Any cartoonists shot. You are responsible for those by knowingly understanding some of the bad is coming with those who need your countries protection.","commenter_a":"The assumption that these guys are all refugees is really telling. *Open your eyes a bit, these fuckers are homegrown. Isis is betting on you hating and attacking refugees to add fuel to their fire. You're all being played.","post_message":"Some experts say it's only a matter of time before the heart of the European Union sees tragedy."},{"comment_id":"10153734549101323","commenter_b":"Fucking Liberal fucks! Feminist whores! Leave Star Wars alone!","commenter_a":"I'm not sure whether the viewer would have got the right impression of Jabba if instead of enslaving Leia he'd have given her a thatcheresque power suit and asked for her opinion on current affairs!","post_message":"It's one of the most memorable, weird, gross and resonant moments from The Return of the Jedi, and from Star Wars in general – and Disney is working to disavow it."},{"comment_id":"970547099705011","commenter_b":"Senior women for Democrat.","commenter_a":"All I know is that seniors tend to vote for republicans. Go ahead, drug test them. Before you knew it, you don't have their votes anymore.","post_message":"He's the one that should be drug tested."},{"comment_id":"10154310515973822","commenter_b":"she clearly states on her wbsite that money not used will go o her pay for future campaign #JillSteinScam","commenter_a":"What's Jill gonna do with all that cash? No refunds, no exchanges, all donations final.","post_message":"JUST IN: The Green Party is dropping its court case seeking a recount of Pennsylvania's Nov. 8 presidential election."}]
