[{"comment_id":"10157473875275354","commenter_b":"The fact that he is pledging his support after this email scandal, proves that he is now being bought by Killary!","commenter_a":"A leaked memo shows the Bernie Sanders campaign considered asking the Democratic National Convention for a private plane as part of his endorsement of Hillary Clinton to help his movement energized. Feel the burn of corruption!","post_message":"WATCH the mass march and see just how \"united\" Democrats are...against Hillary Clinton!  \"Hell No, DNC, We Won't Vote for Hillary!\" #DNC"},{"comment_id":"1851225291776966","commenter_b":"well said ,","commenter_a":"Trump's Victory, in another term (American people's Victory) has proven that the good citizens of the USA are great at determining their future, and changing the game and the whole regime for a better living and even world because America has a big influence on the whole world. Despite the massive media war that had been trying and pushing hard to find a way to put Mr. Trump aside or down to fail him by any dirty politics, means and ways... BUT they couldn't do you know why? Because he is capable and honest and most of all I believe that the church of humble believers everywhere have had an input in this victory asking the Good Father for this amazing nation to shine His face upon America again as He did in the past...!","post_message":"Former President George W. Bush had this message for President-elect Donald J. Trump."},{"comment_id":"10154296449440329","commenter_b":"@username no need to hide farts no? HAHAHA","commenter_a":"Oliver Wales","post_message":"\"Someday you'll meet someone amazing who just gets you. And they won't want to date you either.\""},{"comment_id":"10153302071591051","commenter_b":"Sick bitch","commenter_a":"Make him a her!!!!","post_message":"First he raped a 10-year-old. Then he left her something to remember him by."},{"comment_id":"10152632904466636","commenter_b":"Natasha Rebecca","commenter_a":"Zee Gee","post_message":"'She was on a mission,' said the owner of the determined little miniature schnauzer..."},{"comment_id":"10154420186151194","commenter_b":"Allah is shopping like à sodomized bitch right now","commenter_a":"who just saw that giant fuckin orb?","post_message":"LIVE: Anti-ISIS military op near Mosul, Iraq"},{"comment_id":"10154789506552439","commenter_b":"Get the filth back to the sand","commenter_a":"If the president cant name the enemy as Islam then the media and police cant either...im assuming this is a direct order from the whitehouse as Lt Chris Cammock eluded in the press conference that there were \"other\" departments at play...","post_message":"The Muslim targeted women -uncovered women -- in Macy*s, in the cosmetic department and he was shouting. They don't tell us what he was shouting but we already know, don't we? He killed four women and one man."}]
