[{"comment_id":"800883556714802","commenter_b":"Rheemyck Contreras","commenter_a":"Lexx Kennedy can we get one","post_message":"WATCH: Black panther creeps up on a man not paying attention? Wait for it... wait for it..."},{"comment_id":"10153836657664714","commenter_b":"Sorry!!!!","commenter_a":"'@username ...","post_message":"Pizza, chocolate and french fries all make the top 10."},{"comment_id":"10157095473970206","commenter_b":"Because she's a lying scumbag","commenter_a":"GOP IGNORES CARLY FIORINA - WHY?","post_message":"The professional political class says whatever they need to do to win and then does whatever they please. We need to return to citizen government. Stand with me. Fight with me. Vote for me."},{"comment_id":"1325297067482547","commenter_b":"Means nothing! That's why it took him so long to release it. It had to be all set up. Duh!","commenter_a":"Unfortunately not true. The BC was a. Latent forgery and Trump said before there were serious questions about it. He should have sidestepped the issue. Hillary always does.","post_message":"Trump senior communications adviser, Jason Miller, had said the issue already was closed, as far as Trump was concerned.   2011, Mr. Trump was finally able to bring this ugly incident to its conclusion by successfully compelling President Obama to release his birth certificate.  Miller statement continued,  successfully obtained President Obama birth certificate when others could not, Mr. Trump believes that President Obama was born in the United States.  He added, . Trump did a great service to the president and the country by bringing closure to the issue that Hillary Clinton and her team first raised."},{"comment_id":"1234054046635197","commenter_b":"Mary Williams jealous of a Roger Ailes flunkie?","commenter_a":"I freaking hate Megyn Faux News Kelly. Arrogant, narcissistic twit.","post_message":"Holy crap! D.L. Hughley called out Megyn Kelly and Fox News for their coverage of police brutality and he did not mince words."},{"comment_id":"10153931656668812","commenter_b":"This is way out of context y'all all sound ignorant specially the one starting this comment","commenter_a":"Waiting to see who blames Obama or immigrants....","post_message":"Long Island town demolishes U.S. Navy veteran's home while he was in Florida recovering from a knee replacement: @webpagelink"},{"comment_id":"10153433309476051","commenter_b":"Tie her up in the yard with a plate of chicken wings just out of reach","commenter_a":"No compassion, no conscience ,scruples,morals..nothing but a worthless excuse for a person.I hope she has no children.","post_message":"Officials took one look at what this woman did to her dog and arrested her immediately."}]
