[{"comment_id":"10153868585859203","commenter_b":"She wouldn't fuck any of you dude bros anyways.","commenter_a":"She looks great. Bold, sexy, unflinching, human.","post_message":", gross, strong, thin, fat, pretty, ugly, sexy, disgusting, flawless, woman."},{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."},{"comment_id":"10153211085979087","commenter_b":"I am not afraid and I know no one who is. Though I support you Dr. Carson, you are wrong. Close the border to Muslims until we can sort all this out. Israel has it right, they profile and so should we.","commenter_a":"So I on board.","post_message":"'We are losing this war while America looks and feels afraid at home,' Dr. Ben Carson writes in an op-ed for The Hill. 'By the jihadists’ measure, they are winning. They have changed our country, created a republic of fear and, as Osama bin Laden predicted, his enemies are destroying themselves.'"},{"comment_id":"957903450911743","commenter_b":"Muslims are still using the jiihad to increase their power and stupid European leaders are letting it happen.","commenter_a":"LanceBell fox loves you","post_message":"Spread this everywhere:"},{"comment_id":"10155561062180389","commenter_b":"She should be in prison !!!!!","commenter_a":"She plays the game , professionally ! I simply am astounded at America, Congress, and all the the subterfuge !","post_message":"Question of the Day: Does Hillary Clinton owe the American people an explanation about these new allegations?"},{"comment_id":"10154378724845575","commenter_b":"This woman is pathetic","commenter_a":"Yet if the employer gets caught with them they are breaking the law. Obama's people have to go. Trump 2016","post_message":"Unbelievable . . ."},{"comment_id":"533434026816552","commenter_b":"is that how YOU got in?? god dam roach.....","commenter_a":"Displaced... Bullshit . they are like Roach's spreading themselves out to bring their evil to more places","post_message":"'Never has there been a greater need for tolerance, compassion and solidarity with people who have lost everything.'"}]
