[{"comment_id":"1071843699548997","commenter_b":"Lol stfu","commenter_a":"God Bless you Donald Jesus has CHOSEN you to lead our country !","post_message":""},{"comment_id":"10153629881103188","commenter_b":"So why aren't the women and children coming instead of all the able bodied young men who destroy things when they get to Europe?","commenter_a":"Wolves in sheep clothing!! Wake up Europe and do not be so naive!! Do not grant any of these people permanent citizenship. Send all able bodied back to Syria to fight for their country!!","post_message":"Millions of fleeing refugees are crashing into Europe like a tsunami."},{"comment_id":"10158083946035206","commenter_b":"Then clean your ears out!","commenter_a":"Can someone please tell me what the heck Trump stands for because to this day i haven't heard anything positive come from out of his mouth.","post_message":"Donald J. Trump supporters describe why it's sometimes hard to be for Trump. @webpagelink"},{"comment_id":"10153754092626051","commenter_b":"Suck it up bitches!","commenter_a":"Why don't we buy them cars and houses, too? (shakes head sadly)","post_message":"California is moving forward with a bill to grant undocumented immigrants access to Obamacare. Are you for or against the move?"},{"comment_id":"10156243420205389","commenter_b":"For what? So they can keep turning a blind eye to little boys & girls being raped every day over there? If we're not PROTECTING the innocent anymore, it's time to leave.","commenter_a":"I do not believe he is a Muslim, he is a puppet for the Muslim brotherhood without a doubt and he does hate America","post_message":"President Obama will extend the U.S. military’s stay in Afghanistan beyond the end of 2016, casting aside his promise to end the war on his watch."},{"comment_id":"10153324129453984","commenter_b":"HERE you go......And in case You have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clinton convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown.. The murder happened just after she was to go public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock Rose Law firm. Died of a gunshot wound to the head, ruled a suicide. 4 Ron Brown Secretary of Commerce and former DNC Chairman. Reported to have died by impact in a plane crash. A pathologist close ...","commenter_a":"Ugly tranny!!!","post_message":"This is one distinction Hillary did NOT want..."},{"comment_id":"976551429087752","commenter_b":"She is a pathetic little girl who wants to be relevant. Too bad that will never happen.","commenter_a":"Who cares what she says????","post_message":"\"Pop-star' Calls Christians \"F*****g Insane\" and \"Conservative-A** MotherF****rs\"!"}]
