[{"comment_id":"10153391178593132","commenter_b":"And there's that mentality, \"if you're white you can't have an opinion.\" Yet we're the racist ones right? You do know every time you say that you shame someone of color who is dignified and intelligent, because they get lumped in with the likes of you.","commenter_a":"I don't like playing the race card!! But this is proof!!! Wow!! If she was Latin or a African American person! She wouldn't get off so easily! They shoot to kill us... Jt saying","post_message":"Ouyang told authorities that her behavior was a cry for help."},{"comment_id":"575299862633901","commenter_b":"@username if he just fired all the illegals that work him would be a start. And then send the visa people back home and hire american . But as we saw with romney they like chinese workers.","commenter_a":"Trump says Bernie should tell his followers to stop the violence....I damn near dropped my phone when I read that","post_message":"Tell him, Bernie!"},{"comment_id":"10150833830084963","commenter_b":"What you should get is that it is too bad your mom didnt see you as cells and abort. Ouch stings like that.","commenter_a":"I can not understand why Republican women believe that their bodies and their minds belong to ANY government. If you do not believe in abortion, do not have one.","post_message":"Though the 2017 Official March for Life is happening today, there are indications that most Americans still approve of Roe v. Wade."},{"comment_id":"1359423070754409","commenter_b":"WOW gives a whole new meaning to hard boiled and 3 minute egg","commenter_a":"So we're any charges filed on the creeps who took advantage of her bad luck?","post_message":"The woman admitted she exchanged sex for money and that she performed sexual acts in a chicken coop."},{"comment_id":"10154440357348256","commenter_b":"ANY WOMAN BUT HILLARY!","commenter_a":"Looking forward to the Change!","post_message":"All 50 signed a letter warning that, if elected, Donald Trump \"would be the most reckless President in American history.\""},{"comment_id":"1541783172796541","commenter_b":"#__ #__ #StopYazidiGenocide #StandforYazidiWomen","commenter_a":"Hire them!! If they can do the job, HIRE THEM !!","post_message":"If your business or organization is hiring and needs someone to get the job done, hire a veteran."},{"comment_id":"10153892680026680","commenter_b":"Get a grip Republicans! Don't get weak and give up on Trump! The stakes are much too high! Our lives as we have known them will never be the same if Hillary Clinton wins this election! Donald Trump apologized for things that were said in private 11 years ago but Bill Clinton has yet to apologize for putting his cigar in places it shouldn't be while in the Oval Office and being paid by the taxpayer! There is no low that Killary and team will not stoop to in order to steal this election! October 6, 2016 Clinton Foundation HACKED – Now We KNOW Hillary Clinton Stole More Than Taxpayer Dollars! barney-frank Americans may have been disappointed when Julian Assange announced that he didn’t have an October Surprise for Hillary Clinton, but they weren’t disappointed for long. Another hacker stepped up with an explosive leak. Going by the name “Guccifer ...","commenter_a":"This is too far. You can't start talking about someone is father specially if they are deceased.","post_message":"The file is all of eight pages in length, suggesting the bureau never subjected Fred Trump to any serious scrutiny prior to his death in 1999."}]
