[{"comment_id":"876721502518426","commenter_b":"She don' deserve nothing more than 10 years in jail and not a holiday jail for what she has done to this Country she deserve the punishment that she gets","commenter_a":"No! She deserves jail!","post_message":"Hillary Clinton's worst nightmare just became her reality. Days before the election everything crashes. 'LIKE' if you think Hillary deserves justice?"},{"comment_id":"817764698322138","commenter_b":"What Melissa said !!","commenter_a":"You know if everyone hates you, you must be doing something RIGHT. Trump isn't an ASS KISSER.","post_message":"\"I understand why he got angry. She was asking insulting questions.\""},{"comment_id":"710448769145701","commenter_b":"I tell these slouches to pull up there pants.","commenter_a":"Someone told me that came from prison and meant you want to get fucked in the ass ?","post_message":"Two thugs had the pleasure of living in a jail cell for a few days. This is great. Do you think all thugs with sagging pants should be arrested?"},{"comment_id":"10153526250577431","commenter_b":"The swastika is an inverted cross of the Buddha. He was also inspired by Indian (India as in East Asian) mysticism.","commenter_a":"As a historian, I was amazed at what was copied by the Nazi regime as a way of dealing with racial, etnic, and religious cleansing. The more that I learned about Hitler's insanity the more I realized that he copied the concept of the concentration camp from the US answer to the Indigenous people of this land. The Nazi's swastika is even taken from Native American symbols. This is why the UN still holds the US as guilty of crimes against humanity.","post_message":"Ugly Precursor to Auschwitz: Hitler Said to Have Been Inspired by U.S. Indian Reservation System @webpagelink"},{"comment_id":"10153478399867993","commenter_b":"Do it already.","commenter_a":"What are you waiting for? Her to be elected???","post_message":"Judge suspects ‘bad faith’ from Obama administration on Hillary Clinton emails, threatens subpoena to force former Secretary of State to turn over entire email account."},{"comment_id":"10153848346775470","commenter_b":"Shes just drunk leave her alone","commenter_a":"Johnny Saenz","post_message":"Parents of students at an elementary school were outraged after they found out kindergarten teacher Klara Bowman had been fired after an accusation she was intoxicated in her classroom."},{"comment_id":"10153713540778984","commenter_b":"Chicago and Detroit have been run by democrats for years , as is california. This welfare state is all about staying in power, so is illegal immigration. The end result is bankruptcy, the next result Greece .","commenter_a":"If you're not disabled you need to work! HAVING CHILDREN IS NOT A DISABILITY! BEING A DRUG ADDICT IS NOT A DISABILITY!","post_message":"Wow. The welfare abusers about about to get some VERY bad news... they didn't see this coming. It's about time the cheating and the fraud got shut down... this needs to happen EVERYWHERE."}]
