[{"comment_id":"959675597399526","commenter_b":"Hillary 2016 Hillary 2020","commenter_a":"Hillary!","post_message":"It sounds like voters have already decided who they are going to vote for in the presidential election. Have you?"},{"comment_id":"10153894836055579","commenter_b":"Deport Muslims and illegals, provide help for the mentally ill. Uphold current laws. Problem solved.","commenter_a":"Can somebody explain to me the connection between the NRA and this 20 year mentally disturbed individual in Oregon? How come we don't hear Obama or Hillary talking about the thousands killed every year via violent criminals in major cities all over the US? Where's their plan to stop that violence? How many law abiding gun carrying citizens have been involved in a mass shooting in the US?","post_message":"Hillary Clinton on guns:  is wrong with us that we can stand up to the NRA? Watch full video here: @webpagelink"},{"comment_id":"766656443467536","commenter_b":"When the hell do CRIMINALS ABIDE BY LAWS????? Dumbasses","commenter_a":"Utterly completely fucking useless President. His brain =","post_message":"You have to see it to believe it."},{"comment_id":"10153936928466130","commenter_b":"Tell his ex wife that. She's the one plastering the photos to every tabloid she can find.","commenter_a":"This is so incredibly none of anyones business--","post_message":"Amber Heard claims she’s the victim of repeated incidences of domestic violence."},{"comment_id":"10153448230456680","commenter_b":"@username Lucky for you these modern day Hitler's didn't murder you in your womb.","commenter_a":"The innocent handicapped underdeveloped should not be punished by death. Some are responsible and need to be punished. Donald J. Trump is correct again. Trump for president 2016.","post_message":"Planned Parenthood Action also issued a five-figure ad buy in partnership with Priorities USA Action – a super PAC supporting Hillary Clinton."},{"comment_id":"948144815307058","commenter_b":"@username I appreciate that... However even though the question was asked by one person and he answered her directly .. He did that in front of an audience... As a parent I get what he's trying to say... But as a woman it makes me angry .. The boys that are being raised need to be taught that when a girl is too drunk to give consent it can be considered rape - I say can because not every girl that has drunk sex is going to consider it rape - but some may - plus it's incredibly unrealistic to tell a college girl to stay away from a party with alcohol... U may as well send her to a convent ..","commenter_a":"This advice isn't blaming the victim. Advising someone to lock their doors at night is not preemptively blaming the home owner for a robbery. Should we live in a world where girls can go to drunken college parties and not worry about being sexually assaulted or raped? Absolutely. Is that the world we live in? No.","post_message":"John Kasich to student concerned about sexual violence: \"Don’t go to parties where there’s a lot of alcohol.\""},{"comment_id":"1334341989975359","commenter_b":"@username We should give them hard labor in the form of building the wall.","commenter_a":"This arrogant convicted criminal is an excellent example to bring up next time any leftist Democrats claim there isn't any voter fraud. Safe to say we know where she will be for about the next 3-4 years with good behavior.","post_message":"ARROGANT ILLEGAL ALIEN Who Voted 5 Times In 2016 Election Gets 8 Years…Lawyers Call Sentence “Harsh”…Blame Trump…LOL! [VIDEO]"}]
