[{"comment_id":"10153257305683445","commenter_b":"The irony in your statement, it's because of the illegal immigrants that America discovered weed","commenter_a":"So what if be had 'pounds' across state lines..!? Life for sh*t like that when, let's see, all the illegal immigrants get to roam free and even if they do get busted they will never see life behind bars..! Our drug laws for marijuana need to change.","post_message":"HUGE News! Marijuana Lifer Jeff Mizanskey Gets Parole."},{"comment_id":"10154249392839445","commenter_b":"date on picture is July 2008 took almost 8 years to figure out he was a fraud no wonder this country is going to SH-T","commenter_a":"Shame on him","post_message":"In his application for disability benefits, John Caltabiano claimed he couldn’t drive, cook for himself, exercise at the gym, move around his house or even shave without help."},{"comment_id":"10157348799105354","commenter_b":"Liberals shouldn't be allowed to breed..","commenter_a":"Yay! We can murder the helpless!","post_message":"Here are their celebratory pro-abortion tweets..."},{"comment_id":"10153630304246509","commenter_b":"Guess you've never heard of Irish-American clubs. Guess you've never heard of Italian-American, German-American, Polish-American or perhaps people celebrating their ethnic heritage. So apparently pride in one's ethnic origins is not extended to Black Americans. What is the name Rush? English? I'm betting someone in your family came over on the Mayflower? Proud of that? Why not? Apparently if you were taken against your will in irons on a slave ship you also lose your ability to take pride in your heritage as well?","commenter_a":"There is no such place as \"Africa-America\" therefore there is no such thing as an \"African-American\". They are either Americans or they are Africans. Not all blacks come from Africa and not all Africans are black. Why don't they try and be American's for once in their life's?","post_message":"After recording an ode to Baltimore, #Prince has announced a Mother's Day rally and concert there. Concertgoers are invited to wear something gray: @webpagelink #FreddieGray"},{"comment_id":"10155541308376002","commenter_b":"@username or we could use the same money they giving all folks coming here to do the same thing . Plus we want the wall and not these folks that want to blow us up .","commenter_a":"He has an issue with executive pen on immigration but no issue when Obama was doing it? Also this executive order is for 60-120 days same thing Obama did. Obama before he left slowed down Cubans to come in, President Carter sent Iranian students back during the hostage crisis. Hell my own grandparents in the 1900s came over and we're sent back to Italy. Rather fix the VA first then global problems second. Immigration isn't a right, my taxpayer dollars doesn't want to go to a bunch of illegals","post_message":"Senate Minority Leader Chuck Schumer is holding a press conference to demand the reversal of President Donald Trump's immigration ban.   You can watch the press conference live here:"},{"comment_id":"1732772313625197","commenter_b":"Screw those DUMBASS muslims Go to Jail,, Go to Hell,,, Go back to the desert,,,,, JUST GET OUT OF OUR COUNTRY !!!!!!","commenter_a":"If muslims want to live here then they must adhear to our laws, period. If they don't, they can move on to an islamic country..","post_message":"Muslim Woman Refuses To Take Off Head Scarf In Court, So No-Nonsense Judge Does THIS    In our country you have to follow the laws of our court. If not,  suffer the consequences.  Do you support this no-nonsense judge?"},{"comment_id":"527866774028766","commenter_b":"Are you a feminist?!?!? Yea!","commenter_a":"Every time you read or hear this story it changes ... The parents are frickin LIARS ! They knew about this years ago and MORE WILL COME OUT .... He's a pervert ! So much for feeling \"SAFE AT HOME\" . He isn't the only one that should be charged ... Mom and dad .... Hi Ho , Hi Ho ... OFF TO JAIL YOU ALL GO ! SHAME ON BOTH OF YOU PARENTS ! ( to bad you don't know what the hell that means ! Mom you look up at the thing you call a husband and act like a little puppy, what , believes get everything he says , GET A BACKBONE AND WATCH OVER YOUR CHILDREN , you made them and GAVE BIRTH, ACT LIKE A MOTHER ! There would be HEADS ROLLING if this happened in MY HOUSE , believe me ! Your son should ...","post_message":"And the Duggars and police COVERED IT UP!"}]
