[{"comment_id":"10153089034256051","commenter_b":"She should have either buckled herself then got sick or she could have knead down holding door and do it that way ( some vans have a handles)..or have a push window..or found something to vomit in","commenter_a":"There is a reason why yiu are suppose to wear a seat belt. Glad she is ok though.","post_message":"This woman began feeling sick while driving and ended up opening a car door to throw up. The problem is, the car was still moving at the time."},{"comment_id":"910100355702699","commenter_b":"She should have gotten the death penalty!!!","commenter_a":"Hey like they say, you get what you sew!","post_message":"Convicted killer Jodi Arias will now spend the rest of her life behind bars. Watch Travis Alexander's sisters beg the judge for a maximum sentence: @webpagelink"},{"comment_id":"606469089512450","commenter_b":"Cus Beyoncé just another weak ass bitch in the guise of some sort of strong independent woman.","commenter_a":"Except she didn't do any of this and stayed with the man that's been cheating on her (and before the beehive goes crazy, I love Beyoncé...but what I said is also very true...) soooo you can't be a strong independent woman who brushes aside the fuck boy...when you're still married to him. Now if she comes out and says that they are still married cause it's business but they sleep in separate rooms and have an open relationship then awesome for them...but it's not empowering women...its perpetuating the stereotype","post_message":"14 Beyoncé \"Lemonade\" Lyrics For When Your Ex Texts You"},{"comment_id":"10153009688681051","commenter_b":"Of course hollis god says if you're not with me your against me.. you send yourself to hell .. Muslims will enjoy and do enjoy rape murder and torturing you then sending you to hell.","commenter_a":"How disgusting and disgraceful. Christians are always like keep Christ in christmas, being back the pledge and the nativity scene and I love rebel flags, but the moment another person who doesn't believe their same beliefs is shamed, they point fingers and laugh. all of these people that think deeply offending someone's religion is a joke don't deserve to bear the name of christian. Have some discipline...","post_message":"The Muslims who thought they were buying halal products at this store just found out they had been eating pork the whole time."},{"comment_id":"1121385761232992","commenter_b":"WHY MEN WALK AWAY FROM SOOOO MANY WOMEN .","commenter_a":"So guess they'll be getting rid of the \"women in literature\" as well...?","post_message":"You can't make this stuff up anymore, folks.  Radical feminists just got their way on campus and you can now say good-bye to THIS essential college class. [Read below]"},{"comment_id":"10154479942176509","commenter_b":"It's why we need the wall","commenter_a":"I wish the people of Mexico could do something to rid their country of all the corruption and hideous violence there. They deserve so much better.","post_message":"Five years ago Carlos Gutierrez had his legs cut off by Mexican police officers after not being able to give them extortion payments.  Today, he'll join a group of 400 people receiving blessings from the pope."},{"comment_id":"1023434111010933","commenter_b":"someone can't read the headline in the article lolol","commenter_a":"Stop blaming anti vaccers, we are the ones smart enough not to inject ourself or others with the disease.","post_message":"Way to go, anti-vaxxers."}]
