[{"comment_id":"1444053418948017","commenter_b":"That's why those guys never meet a MULAN their whole life. They could not handle a strong woman anyway.","commenter_a":"He's blaming Mulan for progressiveness and equal woman's rights. Someone thinks we belong in the kitchen barefoot and pregnant.","post_message":"Donald J. Trump running mate Mike Pence slammed the kid's film as the brainchild of a \"mischievous liberal at Disney\" bent on causing \"a quiet change in the next generation's attitude about women in combat.\""},{"comment_id":"10153135013122217","commenter_b":"Hopefully, they're one of my favourite bands☺️","commenter_a":"Ahhhhhh how come???? I still don't have my ticket 😳😨😭😭😭","post_message":"Going...going...gone"},{"comment_id":"10153613146758812","commenter_b":"I am Latino and I vote.....however I am against these liberals and the way they are destroying this country I am against illegal immigration it hurts this country especially on the local level these people get benefits like food stamps welfare....this is not acceptable for you to come into the country illegally and ride tax payers backs....","commenter_a":"Trump all the way..pitbull","post_message":"The rapper called Donald Trump out at Premios Juventad, the Spanish-language awards show that aired Thursday on Univision: abcn.ws/1KcBbra"},{"comment_id":"10155050570035329","commenter_b":"I'm the biggest pussy out","commenter_a":"@username you have to read these!! Ouch","post_message":"Exposed nerves, unexpected orgasms, and a whole lot of blood."},{"comment_id":"895405060572025","commenter_b":"Just like that nut","commenter_a":"Looks to me Democrats are pretty scared of Trump and that way they send these people to his campaigning events and start up problems, fights in crowds. Democrats can't play fair cause they know they are not going to win people are tired of being lied to and their rights being striped away...people this is a wake up call!!!! If you value your freedom you better dig deep in who your voting for...because all Democrats are trying to take our rights away!!!","post_message":"This is hilarious.  Video by the Canadian comedy show 'This Hour Has 22 Minutes.' Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1406386459390310","commenter_b":"OMG this woman is a liar and blowhard","commenter_a":"Does not matter who he picks. Cruz can not win. He will need voters in the general and he has very few of those.","post_message":"This is a big play."},{"comment_id":"1217472704997930","commenter_b":"WE MUST STOP CORRUPT CROOKED LYING KILLARY...If she gets into OUR White House she will appoint the nest Supreme Court Judge...GOD Forbid it be the MUSLIM POS OVOMIT. This will affect US, OUR CHILDREN and OUR GRAND CHILDREN for years to come. She will do her best to cost us OUR SECOND AMENDMENT RIGHTS, While keeping the Secret Service ARMED to protect HER SORRY ASS !!!! She will FLOOD OUR COUNTRY WITH SYRIANS, TERRORISTS, and ILLEGALS.... OUR Borders will NEVER BE CLOSED. AND all of this we will be FORCED TO PAY for with her PROMISED RISE IN TAXES on the MIDDLE CLASS. if that DOESN'T KILL US, we can always be BOMBED, BEHEADED, RAPED or MURDERED by ISIS....GET A CLUE, OPEN YOUR EYES, SEE HILLARY'S AMERICA , BUT THINK TWICE BEFORE YOU VOTE FOR THIS TRAITOROUS B*TCH !!!!!!....TRUMP 2016 !!!!!","commenter_a":"TOO many martinis & pills.","post_message":"Democrats are in full-on panic mode after reporters scooped a picture of Hillary Clinton literally UNABLE to stand. This is going to intensify speculation about her health BIG TIME.  Do you think that Hillary Clinton is fit to serve?"}]
