[{"comment_id":"10155994061055354","commenter_b":"I'd really like to know what these morons see in this group that would make them leave the US ,.and join a group who sodomizes little boys and rapes little girls, kills anyone who disagrees with them and thinks they are right. ?","commenter_a":"She had a hard time deciding join isis or black lives matter! It's pretty sad to see the kind of warped minds our society is producing another lost soul gone to waste!","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS.   Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"10155341100780725","commenter_b":"So put that bitch down","commenter_a":"Obviously she has mental and emotional illness. Maybe people shouldn't be so quick to throw her to the firing squad.","post_message":"The woman accused of viciously cutting open a mother-to-be's womb to steal her fetus was apparently faking her own pregnancy, which gives a clue as to why she committed the horrendous crime, according to a police affidavit ----> @webpagelink"},{"comment_id":"10155189729959199","commenter_b":"Kill the mother.or hang up.her...","commenter_a":"Sick twisted and very disturbing","post_message":"Police say this mother killed her baby by feeding her a teaspoon of salt in order to get back at the child's Dad >>> via.q13fox.com/zXtwH"},{"comment_id":"10154272601268525","commenter_b":"How stupid are those girls...their on camera now...lol","commenter_a":"Shane Ornelas","post_message":"HULK HOGAN ROBBED: Not even the iconic wrestler's home is safe from holiday package thieves!  STORY: fox10phoenix.com/entertainment/@username-story"},{"comment_id":"10154496276031636","commenter_b":"Women are only carriers? What a disgusting mindset to see an entire sect of humanity as subhuman. For the record, men can vanish off the face of the earth tomorrow and humanity will still survive.","commenter_a":"What a sad sight to watch, so many people fighting for the right to kill there own children. Children are the children of the Father. Man can make babies with artificial overs, in a tube, but women can not have babies without a man's sperm, woman are only carrers, all children come from there father first. Maybe instead of worrying about having aborstions, we worry about the decay in society which cases the need for them in the first place. We must raise our standards.","post_message":"intent is to try to put the fathers in the process. My bill would stop the abortion if the father does not agree to the abortion."},{"comment_id":"10154192129196176","commenter_b":"The average lifespan of a giraffe is 25 years","commenter_a":"I feel several brain cells dying from reading these comments.","post_message":"Baby watch! Do you think April the giraffe will give birth soon? All eyes have been on this sweetheart for a couple of days now. (Video courtesy: Animal Adventure Park in New York.)"},{"comment_id":"10153435939769087","commenter_b":"'@username Sorry you feel that way. She'll cheat and lie to you also.","commenter_a":"Who cares anymore what Bill Clinton has to say? He has no influence anymore. Why doesn't Bill & Hillary Clinton follow the law? why are they exempt from following the law?","post_message":"'It's important that we not be chumps when we decide what security provisions should be employed to check people's background,' former President Bill Clinton said. 'America is a place that welcomes all people who are willing to treat people the way they want to be treated, willing to follow the law, willing to create a common community.'"}]
