[{"comment_id":"10155875428813009","commenter_b":"She cant even talk, another wacko","commenter_a":"Fake News! Liar!","post_message":"Nancy Pelosi was asked about Trump's Supreme Court nominee. Her answer left CNN's Jake Tapper speechless."},{"comment_id":"10154249032461178","commenter_b":"She should be gangraped!","commenter_a":"Is the reverse also true?? Are you fair game if you disagree with my views?? What an idiot!","post_message":"A rapper with a history of controversy says violence against women is OK as long as they disagree with her politics."},{"comment_id":"10152969085332623","commenter_b":"Lock up your wives.","commenter_a":"Filling out that trophy case.needs that one for the set!lol","post_message":"Tiger Woods has entered to play in next week's Wyndham Championship in Greensboro:"},{"comment_id":"10156250216360354","commenter_b":"Twisted woman","commenter_a":"So, she is trying to say she is with them as a fellow commie? I think someone farted.","post_message":"Yeah, so, um, this happened..."},{"comment_id":"1004815269538226","commenter_b":"No im against the pregnant women always tryna make the world owe them for having sex.","commenter_a":"Pregnant women have too much sense of entitlement I have no pity for the broad Much respect to the cops","post_message":"When Charlena Michelle Cooks, 8 months pregnant at the time, would not tell officers her name right away, they pushed her to the ground on her belly and cuffed her. Video: kiro.tv/BodyCam"},{"comment_id":"908006605999185","commenter_b":"Just try to take mine down!","commenter_a":"Good for USA...fuck obama","post_message":"This is HUGE!"},{"comment_id":"931627590204327","commenter_b":"From Shyann Malone - This is the coldness I experienced when getting into the car this morning! 40 In St. Pete at 3am. Heat on Full Blast!","commenter_a":"Mulberry","post_message":"Brrrrrrrrrrr! This was St. Pete at around 3a.m. this morning.  Who's the coldest in the Bay area? Show us how frigid it is at your location. Snap a pic and post it in the comments below."}]
