[{"comment_id":"10153906233727522","commenter_b":"Hillary is so obese she looks pregnant in that photo!","commenter_a":"What a bull crap fake news article. Dont blame the constitution for running a more flawed candidate.","post_message":"It's possible to win the Electoral College while winning only 22 percent of the national popular vote."},{"comment_id":"1160655937308596","commenter_b":"Many Muslim women are sick of being told what they are and what they can be from western women who have no clue about their culture, that's why Muslim Feminism had to develop on its own instead being part of the bigger movement, _that's_ sad if you ask me. Feminism should be about equality not about following one group of women's notion about what you should look, feel or talk like.","commenter_a":"I'm seeing a lot of diversity in the Muslim community about the concept of World Hijab Day (non-Muslim women wearing the hijab for a day in solidarity). Would love to get your thoughts on whether it's cultural appropriation, or upholding the more conservative aspects of your faith. I did participate last year, but not sure if I will again.","post_message":"Her \"Ask a Muslim\" booth was a huge success! - Parker Molloy"},{"comment_id":"10152925277511336","commenter_b":"Let it go, let it go!","commenter_a":"WELL YOU FORGOT TO MENTION THE SNOW THAT WE HAD IN wc/PA.","post_message":"JUST IN: Travel bans in New York and New Jersey have been lifted. Blizzard predictions that kept millions of people home are now being downgraded. @webpagelink Time-lapse video taken Tuesday morning shows a deserted Times Square:"},{"comment_id":"901774593215623","commenter_b":"About time we had larger ladies ,","commenter_a":"looks interesting !!!","post_message":"'I feel sexy and confident'"},{"comment_id":"10154103517111178","commenter_b":"Tell the truth its because you give all illegal aliens full medical care.","commenter_a":"They say 17 million people are enrolled so if it cost that much then scrap it","post_message":"Truer words have never been spoken by the president."},{"comment_id":"961399343937315","commenter_b":"Polls mean nothing, Remember Reagan! Go Trump!","commenter_a":"Are you sure it is Cruz and all the lies he told and putting the blame on others like Obama well I am not there is others was ways to do it like the Gop and the liberal party L","post_message":"\"Ted Cruz SEVERELY CUTS Trump's national lead from 18% to 3% in ONE MONTH!\" Let's go, #CruzCrew!"},{"comment_id":"1381800741835583","commenter_b":"Smart woman makes Hillary look like ??? 😝","commenter_a":"Obama couldn't stand her, or for that matter, none of the democrats.","post_message":"Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe.Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe."}]
