[{"comment_id":"822359307886042","commenter_b":"It was meant for this baby to live","commenter_a":"God directed that Officer to the area. He is Hero","post_message":"A newborn girl thought to be only 36 to 48 hours old was found alive in Compton on Friday. The baby muffled cries led sheriff deputies to find her buried under pieces of asphalt and rubble inside a crevice near a riverbed. Detectives are now asking anyone with information to come forward. this post to alert others. Read KTLA story here: @webpagelink"},{"comment_id":"10153018351676336","commenter_b":"Disgusts me to see girls acting like this and the bystanders with the cell phones out! Come on now","commenter_a":"As a parent, I would be MORTIFIED to see my child standing there videoing the fight! Doesn't anyone have compassion any more? \"Mean girls\"... smh... it's out of control! We should have evolved beyond this.....","post_message":"A shocking photo appears to show the moment a Texas mother pulled out a gun and pointed it at a high school student."},{"comment_id":"10153220980835950","commenter_b":"Calm your tits lady damn it's fuckin cup!","commenter_a":"I CARE ! That \"plain red cup\" represents the disdain that Starbucks and its homosexual CEO have for Conservative and Christian values. Except for the color red,Starbucks refuses to advertise any semblance of the Christmas season or what it represents..Well I don't intend to patronize their coffee shops again ! They can HAVE their liberal agenda and I\"ll continue with my Conservative principles !","post_message":"WATCH: At campaign rally, Donald J. Trump says maybe we should boycott Starbucks over plain red \"holiday\" cup design, promising: \"If I become president, we’re all going to be saying 'Merry Christmas' again, that I can tell you.\" @webpagelink"},{"comment_id":"1786615071570542","commenter_b":"Send them to Cuba , please. We do not want them.","commenter_a":"We dont really care what you think John Legend!! Why dont you, Colin, Beyonce, Kanye, Will & Barbara & all the other negative so-called celebrities move to Canada or Cuba & give us Americans a friggin break!!","post_message":"Singer John Legend also tweeted that the Star Spangled Banner is \"weak.\" @webpagelink"},{"comment_id":"10153221473348812","commenter_b":"What British chick?","commenter_a":"Better a bigger body than a nasty attitude. Maybe someone can help that British chick with THAT.","post_message":"Kelly Clarkson fires back at fat shaming comments: @webpagelink"},{"comment_id":"10153687651936509","commenter_b":"Dont worry everyone...Jane cant be taken serious. She is a white liberal woman. We all know they are idiots.","commenter_a":"A black man said this...\"Over The Memorial Day weekend. Over 56 people shot in Chicago, 28 shot 9 dead in Baltimore, & the bizarre thing is; They want you to know the 'Police' are the problem in their communities. And I guarantee you they ALLLLLLL called \"911\" asking the \"Police\" for help & assistance when these shootings took place (go figure). A Fool will never recognize his own foolishness.\"- Johnathan Gentry.","post_message":"An outbreak of Memorial Day weekend violence left nine people dead in 29 shootings, according to police and CNN affiliates. What's behind these deaths? @webpagelink"},{"comment_id":"1085364771487531","commenter_b":"If we accept refugees we are accepting criminal cause that what they are disguised Isis Islam radicals","commenter_a":"Thanks governor for taking s stand To no refugees","post_message":"I appreciate our Gov. Nathan Deal taking a bold stand on this issue. We must secure our borders and know who is entering our communities. #gapol"}]
