[{"comment_id":"1612078455751826","commenter_b":"She wouldn't recognize the truth if it hit her in the face","commenter_a":"Hillary tells it like it is, OH that's terrible take it back, Donald Trump supposedly tells like it is, oh, he's so refreshing to have some one not pc and speaks their mind. F#@K all you people, you're nuts!!!. I really hate she seemed to walk it back, because it's the truth.Donald Trumps supporters are all eating out of the same trough.","post_message":"Mike Pence responds to Hillary Clinton's comment that \"half\" of Donald J. Trump's supporters are a \"basket of deplorables\": \"They are Americans and they deserve your respect.\" @webpagelink"},{"comment_id":"588513781327245","commenter_b":"Trump is not pro amnesty, he's a negotiator and looking at the best way to deal with families who have lived here for 10 or more years. Even if he does half of what he said he'd do it will be HUGE!! Id be happy with getting rid of illegal criminals, upholding the laws we have and securing the border and building the wall! That is HUGE!! Trump 2016!!","commenter_a":"I @username will not be voting for you Mr. @username because you are starting to sound like a main stream republican when it comes to ILLEGAL IMMIGRATION . I was with you from the beginning but not now. NO AMNESTY !!!","post_message":"The Clinton's are the real predators..."},{"comment_id":"10153735329829205","commenter_b":"Fuck clinton and her globalist allies","commenter_a":"Come on Loretta lynch meets bill Clinton on the Tarmac before the Benghazi report. See the movie 13 hours in Benghazi please don't tell me that every person in that movie was lying about what happened that night. There was no reason why they all resigned? Like you yourself said maybe technically they did nothing wrong but morally ? And who was to blame ? And what happened after ? And let's not forget the laugh. I would never vote or defend the Donald but let's not call a word on cnn anything but spin for Hillary. They have not even reported on the so called technical issues with the voting errors or for what went wrong with Nevada. Seriously do you honestly think that your viewers cannot see through your crap when you are crapping too ?","post_message":"Michael Cohen is one of Donald J. Trump’s top advisors, an a lawyer. He may have just committed libel against Hillary Clinton."},{"comment_id":"10154111304162541","commenter_b":"Shut up","commenter_a":"Like Trump, Steve Harvey is also a racist and mysognist. Between his extremely offensive dating advice for women and his extremely offensive comments about Asians, Steve and Don the Con have a lot in common.","post_message":"\"I walked away feeling like I had just talked with a man who genuinely wants to make a difference in this area,\" Steve Harvey said."},{"comment_id":"589287567920858","commenter_b":"Wanted to see the dogs lock jaw these pos","commenter_a":"Click bait everywhere goddamn","post_message":"A man was slashed after coming to the defense of a dog. Surveillance video shows the two men punching, kicking and beating dogs on Staten Island."},{"comment_id":"10158194484645725","commenter_b":"Dis bitch don't even answer","commenter_a":"@username @username Melissa F Hernandez @username MaFe Ndz We are going to take Matthew to Navy Pier again this year. You guys should come too!","post_message":"Tonight feels like the perfect night to see some holiday lights, don't you think?"},{"comment_id":"760923940676233","commenter_b":"This lady is an idiot","commenter_a":"Oh well","post_message":"\"White folks gotta give up something\" - Marissa Jenae Johnson, cofounder of Black Lives Matter"}]
