[{"comment_id":"10153224449077293","commenter_b":"If it happens without her name on it, fine, but she still had no right to do what she did up to now and she has to get re-elected which I doubt she will. What she did was wrong and I hope she stays in jail. The nasty hag is going to be rich anyway because there's enough idiots out there to give her $$$.","commenter_a":"Simply put...it doesn't...","post_message":"The question has arisen before."},{"comment_id":"934685129905679","commenter_b":"I am a feminist and proud of it.","commenter_a":"This is feminism.","post_message":"Ellen Page has a point here, ya know... Thanks for the photo, MTV Act!"},{"comment_id":"10153670788291320","commenter_b":"This post just made my morning. You hit the nail on the head !!!!","commenter_a":"That family just needs to rent a van, pile into it, pick up the Kardashians and drive away!","post_message":"Disgraced reality TV star Josh Duggar was reportedly among the 32 million users of the adultery website, AshleyMadison.com. According to Gawker, Duggar, a married father of four, paid nearly $1,000 during his two-year subscription. His name, address and sexual preferences, and that of millions others, were posted online Tuesday night by a group of hackers. More: @webpagelink (AP photo)"},{"comment_id":"10153655201276323","commenter_b":"Ha! Real men have curves, lol!","commenter_a":"The typically sexist depiction of what women want men to be... not what men are.","post_message":"Romance isn't dead, but it is dehydrated. What's it like to be be the hunk on the front of 414 romance novels?"},{"comment_id":"10154776227370399","commenter_b":"Listen to all the cry baby's all the little bitches are just jealous because they don't have what she has and besides it don't make a damn if her daddy gave it to her. So just shut the fuck up","commenter_a":"It's called Democracy. Don't like a company, don't buy it. It's evident large companies want to distance themselves from tRump and his administration.","post_message":"\"If Ivanka were anyone else’s daughter, she would be praised as a trailblazer.\""},{"comment_id":"460205810854230","commenter_b":"The law should be to only give welfare to an American citizen. Then, take the American abusers off of welfare.","commenter_a":"But not as much as those in government office positions of welfare.","post_message":"The average immigrant household consumes 33% more in cash welfare, 57% more in food assistance, and 44% more in Medicaid, according to a new study by The Center for Immigration Studies."},{"comment_id":"10154232902826600","commenter_b":"It's called hustle lady! Wtf? No it's called dirt bag thief. It's not hustle it's theft. What a douch.","commenter_a":"Just don't understand why people think it's ok to take things that don't belong to them...no freakin' values or morals.. Disgusting!","post_message":"She was taken into custody without incident after being found through social media tips and “old fashion police work.”"}]
