[{"comment_id":"941353829241191","commenter_b":"I know who im voting out of office. Bye bitch","commenter_a":"Bullcrap","post_message":"A recent legislative proposal from Rep. Carolyn Maloney (D-N.Y.) would require Americans to obtain liability insurance before exercising their 2nd Amendment rights. Maloney claims her legislation, the Firearms Risk Protection Act, would make gun owners act more responsibly. @webpagelink"},{"comment_id":"604736083067982","commenter_b":"Duuude, no he doesnt. He definitely and truly does not mean that. From the bottom of his good heart he really doesn't want people to support her fracking, wall Street, lying ass.","commenter_a":"Love ya Bernie but, not a chance in hell I will give that pos garbage my vote! Not like it matters anyway I have lost all faith in the US government and any honesty within.","post_message":""},{"comment_id":"790486571080388","commenter_b":"Shut up!","commenter_a":"BUSH IS A JUVENILE WHO WORKS FOR THE BUSHES----NO MORE BUSHES---2 tooooooooooo many---TAKE YOUR MILLIONS AND FALSE POLICIES ELSEWHERE-----We do not want another IRAQ!!! and then be left hanging out to dry like your brother did-----VOTING TRUMP ---","post_message":"Question from Cameron, a 5th grader in New Hampshire: What are the top 3 things you want to accomplish in your first term?  Watch to hear my answer:"},{"comment_id":"10154252352423984","commenter_b":"Megyn is a bitch-not interested in anything she says.","commenter_a":"WHAT?????? Megan Kelly reported something bad about Trump - I am in shock -","post_message":"Trump's not going to want to hear it..."},{"comment_id":"536936909817584","commenter_b":"both plans are BS","commenter_a":"Interesting. Makes sense though. Someone has to pay for all the freeloaders and the Crap that the Dems promise them.","post_message":"Here's how much your taxes could decrease under Donald J. Trump and rise under Bernie Sanders. @webpagelink"},{"comment_id":"10153430098934342","commenter_b":"Lame","commenter_a":"Keep control of your dog. If your uncontrolled dog bites someone it is a felony.","post_message":"The dog darted between her owner's legs and out the door. Seconds later, the beloved pet was lying in a pool of blood."},{"comment_id":"10153907516071178","commenter_b":"Colbert is out of touch with reality","commenter_a":"Colbert and Koppel who ?","post_message":"It's like a liberal media love-fest."}]
