[{"comment_id":"1241124305907597","commenter_b":"Mexicans R not the enemies! The Enemies come with visas on Air planes! They are already here! Keep bringing refugees! From overseas!!","commenter_a":"Trump will secure our borders!","post_message":"The New York Police Department said it dispatched its \"critical response group\" which is equipped with high-powered weapons, and other security to crowded areas of the city."},{"comment_id":"10154430644149411","commenter_b":"Wow and the racism starts. Why am illegal cause I have a latino last name? That's exactly the type of ignorance Trump types bring to the table. Also white pride has far deeper roots tied to hatred in this country. If anything you just proved my point. When KKK have rallies it's freedom and of speech. But if latino or black communities have groups such as black panters it an extremist hate group. You people are really stupid because your racism.is exactly what is creating the modern resistance. So keep on hating and bring more peope to my side..what you think after centuries of white dominance we wouldn't eventually get tired of that shit and start fighting back?","commenter_a":"Look here's what it is. The same people that like Trump ate the same people that make Obama watermelon jokes. It's all about white privilege for you guys. What's really behind Trump's popularity is the fear that white people's dominance is being threatened. \"But Ray,\" you'll say, \" there are plenty of minorities that support Trump. \" to which I say, that the US has done an excellent job of scrubbing away people's culture and heritage and whos propaganda has thoroughly brainwashed people into extremely nationalism. Cause guess what there are plenty of white people that are against Trump as well. Face it. Trump's entire campaign is based on xenophobia and white pride may ad well be his slogan.","post_message":"'It's also to show solidarity with all the people he has tried to harass and point out we are still here and not going anywhere'"},{"comment_id":"1158459407522812","commenter_b":"Liberal ay, so telling you that Trump broke the pledge first, makes him a liberal.","commenter_a":"Why don't you Trump people shut the hell up about Cruz, and focus on Killary for a change?","post_message":"I agree with Phil Robertson \"The Duck Commander\"!"},{"comment_id":"10152920092525736","commenter_b":"Because I dive in pussy. No fecal flakes on my","commenter_a":"Because they know what they're doing is wrong & disgusting.","post_message":"41% of transgender people try to kill themselves, compared with 4.6% of the general public, according to a study."},{"comment_id":"1676754379239687","commenter_b":"Bramden whos god bitch","commenter_a":"What a dumbass. It just shows how little thought he's put into what he's saying. The environmental impact alone would be devastating. My problem with Trump is, if he were somehow to get elected, when he didn't get his way he would just say \"I'm going back to my life as a billionaire where I get my way and everything has a price so I can have what I want\". He's made that statement in one of his speeches. He said \"you might not like my statements and I may not get elected for them. So what, I'll just go back to my life of wealth\".","post_message":"How would Donald Trump crack down on ISIS as president? Let's just say he has a bold plan. Here, in his own words, is what he'd do:"},{"comment_id":"10154237826833010","commenter_b":"So no women has ever done the same thing right? Smh","commenter_a":"My son-in-law, a sheriff's deputy, once got a call about a baby in a car seat in a car in the parking lot of a \"gentlemen club\" translation - strip club!! The cops found the father inside getting a lap dance. He was supposed to be caring for his child while his wife, a doctor, worked the night shift at the hospital. What a father :( What a husband :(","post_message":"This week in North Hollywood."},{"comment_id":"10152790806361051","commenter_b":"you are so right misty ! all woman should hide in closets and god forbid if they drive cars , jmo from a hetero sexual male","commenter_a":"Out of line. Breastfeeding is ok but the whole nudity thing is not.","post_message":"This woman was very surprised when her photos were removed. She didn’t think they were inappropriate at all. Decide for yourselves whether they should’ve been taken down."}]
