[{"comment_id":"10153830223561756","commenter_b":"why were they refugees and not called migrants... humm good for the goose good for the gander..","commenter_a":"Thank you for calling them migrants. The 'refugees' stayed in Turkey, Greece, Lebanon etc. The ones migrating all the way to Germany - some 10 countries' borders away! - are economic migrants who risk their and their poor kids lives to get to the country with the highest GDP and best social services about 2,000 miles away. Hungary has had enough of them coming through, demanding food and services all the while disrespecting Hungarians laws and badmouthing the country. Enough! Go around or go back, Hungary has no interest in catering to this group, the country has enough problems already with unemployment etc. Watch this video, Hungarian cops trying to disperse food and drinks to migrants and refugees: @webpagelink","post_message":"The scene at at least one processing area in southern Hungary is starkly different from recent days. Aid agencies are dismantling huge tents. Cleanup crews rake trash into piles.  Migrants who slept in a cornfield here for days have been bused to the Austrian border. The Hungarian border is now closed."},{"comment_id":"1304805006248280","commenter_b":"That's what he wants beware","commenter_a":"They try to do anything they can to make his life more miserable-how petty!!!!!","post_message":"TRUMP WON'T BE ABLE To Use Oval Office For A Year Have To Use Nixon's Old Office Across Street"},{"comment_id":"10158310227560389","commenter_b":"I think they are GRRRRRRRREAT!!!!! For the first time in my adult life, in a long, long time, I feel very proud to be an American!!! President Trump has done more in his first few days, than Obama did in 8 years!!!! Thank God we are rid of Obama and his family!!!","commenter_a":"He is doing great as we expected doing what he said he would do !!","post_message":"Question of the Day: What do you think of the moves President Donald J. Trump has made so far?"},{"comment_id":"653257648132607","commenter_b":"I agree. Fuck Kim Kardashian! She is trash.","commenter_a":"So a woman who's apparently famous for releasing a sex tape of her getting pissed on gets robbed of 10 million dollars worth of jewellery. Who the Fuck cares.?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1012396785523240","commenter_b":"BUSH AND CHENEY WAR CRIMINALS!","commenter_a":"BENGHAZI, EMAILS, Feckless Foreign Policy , He is a Muslim , look at this snow ball Mr, President... Im not a Scientist , repeal Obama Care and shutting down the government again ?","post_message":"11 days and one massive to-do list."},{"comment_id":"1135264553151680","commenter_b":"Only you idiot liberal want these invaders here... Morons","commenter_a":"But who would want to live there? Especially a refugee, who will be treated worse than they treat their own minorities and poor (which is pretty terrible).","post_message":"Fact check."},{"comment_id":"10152662360374117","commenter_b":"Trevor clearly you're an angry misogynistic ass with your little troll posts. Ha.","commenter_a":"What's really alarming is that around 1 in 3 women will be sexually assaulted in their lifetime.","post_message":"Well, this is alarming."}]
