[{"comment_id":"613597282122381","commenter_b":"You don't see conservatives trying to preserve the right to vote? Of course they are. Why is it perfectly ok in your eyes that we have to prove ourselves to exercise our right to bear arms, but having to have an id to vote is racist? Mass shootings are still a rare occurrence in our country.","commenter_a":"When Obama's secret servicemen are the first to lay down their guns, and he doesn't get shot, I will believe \"gun control\" works.","post_message":"I support it. Do you? Occupy Democrats"},{"comment_id":"1184855771553940","commenter_b":"I won't be watching @username tonight. I will not be watching that Hag!! Why is @username making such a big deal out of THAT LYING WITCH??","commenter_a":"Here's me not watching","post_message":"\"We know that Russian intelligence services... hacked into the DNC.\" Today on \"Fox News Sunday,\" Hillary Clinton commented on the recent hack and Donald J. Trump's attitude towards Putin."},{"comment_id":"458641870995513","commenter_b":"Can't stand this idiot...she has always been a crude, rude, big mouthed jerk. I don't find her humor funny, never have and never will. She does things like this just to try to be relevant and she will never be relevant. Hopefully she will also leave America with the rest of these so called celebrities if Trump gets elected.","commenter_a":"Idiot!!!!!","post_message":"Sarah Silverman is a _____________."},{"comment_id":"10153843599995796","commenter_b":"@username - did white privilege cause 360,000 Union soldiers to die fighting to free the slaves?","commenter_a":"Black lives matter is a racist (by definition) organization funded by George Soros to spread a false narrative, agitate and wreak havoc. People who fall for it, like Ms. Hathaway, are never interested in \"having a conversation\".","post_message":"\"I believe the Black Lives Matter movement calls on us to acknowledge our white privilege and its unfairness, to listen to the lived experiences of our darker brothers and sisters and to help them to achieve a world in which people of all shades live in safety,\" Julia Hathaway writes in her OpEd."},{"comment_id":"10153554685766880","commenter_b":"I want TRUMP to build the wall so can make it hold","commenter_a":"At one time owning slaves was constitutional","post_message":"#2. Ending birthright citizenship would be \"clearly unconstitutional.\""},{"comment_id":"1035032136534126","commenter_b":"You're a sick woman.","commenter_a":"Go Trump..Tell us the truth because that's what the people want to hear! We don't want Muslims or Cubans running our nation!!! Trump 2016","post_message":"Donald J. Trump wants Iowa voters to keep this one thing in mind come caucus day: \"When you’re casting your ballot, remember.”"},{"comment_id":"10153053075171770","commenter_b":"Yeaaaahhhh... She's much happier having a socialist traitor occupying the WH","commenter_a":"That's what I said about obama, and it's turning out to be true.","post_message":"\"That’s who I want representing my country, somebody politically incorrect. That will just be perfect.\""}]
