[{"comment_id":"10156340474870354","commenter_b":"The Failed LIE of Multiculturalism is KILLING America. Low IQ Aborigines cannot uphold the Personal Responsibility DEMANDED. See Baltimore, DC, St Louis and Ghetto after Ghetto!","commenter_a":"Yes, yes!","post_message":"“I believe our country’s biggest threats come from within, from failing to address our incredible fiscal irresponsibility, by allowing our populous to become enemies with each other, stirring up hatred and strife within our country, by allowing education to take a second seat, by giving a lot of lip service but not actually taking care of it.\""},{"comment_id":"10154784324202577","commenter_b":"First Amendment, Bitch!","commenter_a":"nothings going to change you yanks have been played for fools","post_message":"If Donald Trump truly wants to drain the swamp in Washington he must make an example out of this evil corrupt family and send a clear message that he is here to bring about real change."},{"comment_id":"10154216444386350","commenter_b":"She should have been left the freak!!!","commenter_a":"After 30+ years of cheating and drugs nowwww she finds her inner strength?","post_message":"\"It right for me, because I honestly, at this point today, have no idea what I doing with the rest of my life.\""},{"comment_id":"10153831984088132","commenter_b":"She's ok with adultery too","commenter_a":"A Christian who was married and divorced what? 3 times? Ok. She certainly doesn't have a problem with divorce but has a problem with gay marriage. The problem with so called \"Christians\" these days is there always seems to be a double standard. Sorry but you can't condemn someone who you deem a sinner when you sin yourself. Shame on her.","post_message":"\"Kim Davis should have never been locked-up for being a Christian,\" said Mike Huckabee."},{"comment_id":"1392116457753526","commenter_b":"Illegals DO NOT FREAKING qualify for SNAP or any Welfare!","commenter_a":"So, how many of these people are illegal?","post_message":"This state is preparing to kick roughly 30,000 people off food stamps."},{"comment_id":"10152595015514071","commenter_b":"Everyone's saying about larger women.. Have any if you thought that some girls are blessed with a small back but large boobs!","commenter_a":"Good!!","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"10154589059624087","commenter_b":"If you look real hard you may find your own identity or Soros'","commenter_a":"Questions: How many states do we have? What was actually written on that red, plastic button your mommy brought to Russia to reset our relationship? Did the crippled man Biden ask to stand up ever...stand up? What exactly is a CORPSEman? Hmmmmm....perhaps you should stfu?","post_message":"\"What happened in Sweden Friday night? Did they catch the Bowling Green Massacre perpetrators?” Chelsea Clinton tweeted."}]
