[{"comment_id":"1163610097050858","commenter_b":"So you would prefer a lying heartless uncaring self serving witch? Who tried to play down her predator husband's affairs.","commenter_a":"Trump is only for Trump and now the Republican Party is his new trophy...Good Luck GOP....I am out of there for good","post_message":"More great content from our friends over at Team Trump!"},{"comment_id":"10153982977694411","commenter_b":"This old bitch is an asswhole ..am sure you are having sex with your boy aren't you?","commenter_a":"go the hell home.. you are nothing but a bunch of bitchers, bellyachers.. shut up and get a life.. stop moaning and groaning and playing the pity card.. there's millions around the world that are worse off than you are.. keep moving until you find where it is Allah wants you.. dang.. are you all stupid ignorant imbeciles? can any Muslims think for themselves or do they all wait on what their God Allah/Poop Francis says.. rub your rosary beads and pray 5 times aday towards Mecca or better yet go there and shut the hell up.. freaks.","post_message":"'We were just standing outside and we all just started coughing and our eyes were burning. We were really confused about what was going on'"},{"comment_id":"1745647555687410","commenter_b":"Julianne 😂😂","commenter_a":"Lol Luke Hargis you guys need to figure this out before moving out!","post_message":"\"I pay puppy support...\""},{"comment_id":"10153610824739087","commenter_b":"So, I guess u rather lying, murderous Hillary to get the nomination.","commenter_a":"They don't have to support the nominee anymore than we have to! If Old butthole lips Trump gets the nomination you can bet I'll write my candidate in!","post_message":"“We have candidates who believe that they’re on the pathway to grabbing all the delegates for the nomination. Whether it’s posturing or whatever, I expect that they’ll eventually support the nominee,\" said RNC chairman Reince Priebus. \"We’ve always been able to come together before.”"},{"comment_id":"10153719523799138","commenter_b":"What is,wrong w people???? If they have,an \"urge\" can't they have,any self control! !! Haven't people heard of video surveillance? ? Makes me wonder what else they've done that hasn't been detected...","commenter_a":"It's too bad that the media gets a hold of these stories and everybody believes them. That's not to say it didn't happen. Some children do lie about these things.","post_message":"The teaching assistant has been taken into police custody and is no longer an employee at St. Louis Park Public Schools."},{"comment_id":"988561661229838","commenter_b":"F*^king disgusting!!!","commenter_a":"Disgrace as president.","post_message":"President Barack Obama and First Lady Michelle Obama paid less than two minutes of respect to the late Antonin Scalia while the Justice lies in repose at the Supreme Court."},{"comment_id":"10153590950708145","commenter_b":"You can turn it off though.","commenter_a":"Ever tried to uninstall Facebook? YOU CAN'T!!!!","post_message":"Apparently, Facebook wants its Messenger app to take over your phone."}]
