[{"comment_id":"10153531348054740","commenter_b":"I agree you shouldnt have to justify.","commenter_a":"It is sad that so many don't know the difference between real life and tv.....","post_message":"Here's why cops don't 'shoot to injure':"},{"comment_id":"10153189927841336","commenter_b":"Mike.... yes all ILLEGALS should be deported.... We have immigration laws which are not being followed... We have a system for people who want to become citizens so I do not support those who break the laws of this country and expect to reep the rewards of citizenship off the backs of the American taxpayer...","commenter_a":"ACLU is out of their minds... abortion is murder!!! illegals need to be deported PERIOD...","post_message":"“The Catholic Bishops are taking millions of dollars in federal grants and then imposing their beliefs on this vulnerable population… that raises serious concerns under the separation of church and state provision in our Constitution,” said an ACLU Nationwide attorney."},{"comment_id":"288699034881182","commenter_b":"Now, have you been able to fill these jobs with non immigrants?","commenter_a":"What were they expecting to happen...","post_message":"From Oklahoma to New York, bosses fired groups of workers after they didn't show up at their jobs in order to protest at last week's \"Day Without Immigrants\" demonstrations."},{"comment_id":"563455260481095","commenter_b":"Apples have arsenic in them. Apples will kill you.","commenter_a":"So will parents of vaccination damaged children be given the same treatment?","post_message":"The parents used a variety of home remedies — including water with maple syrup — to boost their son's immune system after he became stiff and lethargic.   The 19-month-old baby had been sick for a couple of weeks when he suddenly stopped breathing."},{"comment_id":"736534466449620","commenter_b":"RADICAL ISLAMIC TERRORIST MURDERED THE 49 PEOPLE IN ORLANDO!! ...NOT GUNS!! KEEP AMERICA ARMED! OBAMA WANTS TO DISARM EVERYONE EXCEPT RADICAL ISLAM.","commenter_a":"What the heck? How ridiculous is this?!!!!! These are grown people in huge positions of leadership acting like fools. This is messed up!","post_message":"Louie Gohmert crashes the 'sit-in' and drops some truth."},{"comment_id":"10154254253351336","commenter_b":"She's Nasty !","commenter_a":"White guilt is a real thing. Sad but true.","post_message":"“I’m a white lady. I’m an easy target,” Melissa Click said in an article."},{"comment_id":"10153203365116615","commenter_b":"your right she shouldn't be. she should be just shot!","commenter_a":"Good. She shouldn't be.","post_message":"Her baby was just hours old and still had his umbilical cord when he was found by a church custodian who heard him crying."}]
