[{"comment_id":"1059551124091179","commenter_b":"Surprise, I don't want women in mine either!","commenter_a":"Don't want some guy in bathroom with any girls. Whose to say he really is gay. ! Don't care if he is though don't belong there.","post_message":"Why is this so hard to understand?"},{"comment_id":"10154099893448132","commenter_b":"all she has to do is prove it, Will she?","commenter_a":"This is so pathetic!","post_message":"Donald J. Trump and Megyn Kelly have quite a history."},{"comment_id":"976047545785108","commenter_b":"Go go Hillary, you will be next USA-President.","commenter_a":"Go Hillary all the way","post_message":"“Beijing is normally very hot and very dry in September, but it just poured rain throughout the conference. The Chinese claimed that it was the fault of all these women in Beijing.” Watch the history of Hillary’s stirring speech at the 1995 UN Women’s Conference:"},{"comment_id":"1723416237718117","commenter_b":"In my book, Angela Merkel will go down as one of the greatest people to have walked the earth. She opened the door for strangers when everyone else closed theirs. There were far worse atrocities happening in Germany and Europe before the arrival of immigrants. Xenophobes that previously had no excuse for their hate are happy to see their own people killed by minority terrorists just to justify their hatred for the rest of humanity.","commenter_a":"Merkel should be tried for treason. She is directly responsible for all of the sexual assaults and murders that have taken place!","post_message":"You can ban the burka, Frau Merkel. But what are you going to do about banning the migrant boats YOU encouraged to come and which are destroying your country?"},{"comment_id":"10153818538521519","commenter_b":"She's ok with a total asshole who may blow up the world though apparently","commenter_a":"Her son did NOT even work for the State Department, he worked for the the CIA. Her comments and opinions about Hillary are completely irrelevant.","post_message":"Pat Smith at RNC: Hillary Clinton \"deserves to be in stripes\"..."},{"comment_id":"10153646092561167","commenter_b":"Liberals hate women!!!","commenter_a":"If Megyn Kelly didn't have her looks and her little fued with the Donald to capitalize on she'd be a non issue.","post_message":"Can everyone finally stop pretending Megyn Kelly is any kind of “hard-hitting journalist”?"},{"comment_id":"1159055580820855","commenter_b":"China Eddie, we western women have a CHOICE to wear what we want when we want, unlike you poor suckerers who must obay. You poor poor deluded fools.","commenter_a":"Islam will reform when they relinquish women from its oppression","post_message":"Mothers and wives pose in the embroidered boreghehs that some start wearing from the age of nine"}]
