[{"comment_id":"10154499233438132","commenter_b":"All men have hoes.","commenter_a":"your universal super power What if I told you that you hold the universal super power of anticipating life-altering encounters with strangers... tapping into your unlimited abundance frequency predicting upcoming challenges and lucrative opportunities... and following through on your BIG goals without any hesitation or uncertainty How? You might be wondering... Because you have access to a secret weapon that most don know about: Numerology. You be amazed at the shockingly accurate and revealing information that can be deciphered from nothing more than your name and date of birth. @webpagelink","post_message":"John F. Kennedy's scandalous handwritten love letters have been revealed."},{"comment_id":"1414624065217353","commenter_b":"Oh please better vetting will even make the refugees safer. The ban is temporary and no one will die..","commenter_a":"I am against legislation or executive actions that do not have broad support from both sides of the political spectrum.","post_message":"The President's Executive Order against immigrants and refugees is contrary to American values. Do you agree? Take the survey: @webpagelink"},{"comment_id":"605117769694222","commenter_b":"WE DONT BUY IVORY PERIOD!!! WE NEED TO BOYCOTT CHINA ESPECIALLY AND DONT EVEN BUY DOLLAR STORE THINGS THAT ARE MADE IN CHINA!!! IVE BEEN TO HONGKONG AND TAIWAN IN 87. SAW MEGA IVORY BACK THEN👿💔👹 FOR SALE! NOTHING HAS CHANGED! CHINA HAS NO PUNISHMENT! AFRICAN COUNTRIES NO TRADE PUNISHMENT! EVENTUALLY THE COUNTRIES IN AFRICA WILL STARVE OUT IF WE BOYCOTT TOURISM!!!","commenter_a":"Every country involved in the purchase of animal products from Africa as well as gaming in Africa are the reason why we have this problem. It's not only Africa's problem this is a world wide issue. Next time you hear a piano play or go to the pub to play some billiards question what they are made of. Ivory poaching legally ended in 1989, but the demand will always be there and countries like China and Japan will always buy their way through these bans as long as we keep buying tacky souvenirs from Asia containing Ivory. Education is the key, we have to take an interest and ask what is the item I'm about to purchase made from? This is what we can do to reduce the demand of items made from threatened species.","post_message":"Poachers, beware. These dogs are coming for you from the air. @webpagelink"},{"comment_id":"10152615687001636","commenter_b":"575988169269274E575988169269274n575988169269274t575988169269274e575988169269274r575988169269274i575988169269274n575988169269274g575988169269274?@username?@username 575988169269274I575988169269274'575988169269274v575988169269274e575988169269274 575988169269274b575988169269274e575988169269274e575988169269274n575988169269274 575988169269274t575988169269274h575988169269274e575988169269274r575988169269274e575988169269274","commenter_a":"575988169269274A575988169269274n575988169269274d575988169269274 575988169269274B575988169269274r575988169269274u575988169269274c575988169269274e575988169269274 575988169269274J575988169269274e575988169269274n575988169269274n575988169269274e575988169269274r575988169269274 575988169269274i575988169269274s575988169269274 575988169269274p575988169269274i575988169269274s575988169269274s575988169269274e575988169269274d575988169269274!@username @username 575988169269274I575988169269274t575988169269274'575988169269274s575988169269274 575988169269274a575988169269274l575988169269274w575988169269274a575988169269274y575988169269274s575988169269274 575988169269274a575988169269274b575988169269274o575988169269274u575988169269274t575988169269274 575988169269274K575988169269274i575988169269274m575988169269274!@username","post_message":" are entering the curvy girl era\""},{"comment_id":"10154667540793812","commenter_b":"#theybothsuck","commenter_a":"#VOTETRUMP","post_message":"UPDATE: One person in custody after two officers are injured in shooting in Arkansas. abcn.ws/2aGeleD"},{"comment_id":"10153208730274087","commenter_b":"Let the woman seeking one pay for it in full from her own money. No insurance & no public funds.","commenter_a":"Not so. Defunding PP will not end abortion until the USSC overturns Roe vs Wade. If Defunded..the government funding would simply be re-allocating taxpayer dollars to approximately 13,500 Women's Health centers across the country, (ones who actually own a mammogram machine & provide prenatal care, & ambulatory care--which PP does not do at all.) Planned Parenthood is breaking the law: delivering 2nd term babies to cut the organs out for resale & killing them outside the womb. If you have not watched the videos (exposing this on film), then you are being negligent of the truth. Plus PP helps Human Traffickers & pays cover up millions for mothers deaths on the abortion table. Women deserve better. I dare anyone on this thread to call PP to schedule a mammogram..or a prenatal checkup..they will say, \"we do not provide those services.\" If this is really about women's health..women deserve better than ...","post_message":"Cutting off Planned Parenthood’s funding would result in a net savings of $235 million over a decade, while also resulting in “several thousand” unplanned births that would drive up government costs elsewhere, the nonpartisan Congressional Budget Office reported."},{"comment_id":"1278850128860187","commenter_b":"No way in hell will I change my faith or anything else for this evil bitch!!","commenter_a":"Wear red at the polls. Let's show the Clinton machine how we can show our support another way that can't be rigged. Polling lines full of Trump supporters should skew the view of the biased media. We are the media. We are the people. For the people by the people we will make this country great again. Go Trump!!","post_message":"This literally just happened, folks!"}]
