[{"comment_id":"485625238294723","commenter_b":"Deport her ass","commenter_a":"This woman is a trouble maker and more behind her... Send her back if she cannot obey our system. This goes for anyone, anyone's religion. By the way does she have automobile insurance>> Is she a Citizen of the USA??????","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"10155339234553132","commenter_b":"Why have this girl on TV really it is ridiculous !","commenter_a":"Take all her electronics away....and Danielle's too!","post_message":"Danielle Bregoli is back, and she not mincing words."},{"comment_id":"600606456772491","commenter_b":"Takeaways from the Texas GOP Debate *Donald Trump looked like an absolute buffoon in a nice suit. It was also clear that he has talked out of both sides of his mouth so much, that he cannot even remember what he has said in the past. We heard all the same old talking points and we heard more insults and name calling designed to shame his opponents; and Trump even classless attacked the moderators for asking reasonable questions. The Trump diehards will rush to the Internet to vote for him as the winner. People who were actually listening to him, will change their vote if they thought about supporting him, or be happy with their decision to vote for someone else. * Ted Cruz was once again the most substantive and clear debater. He was unfairly treated by Wolf Blitzer by Blitzer inability to control Trumps interruptions. Ted Cruz was ...","commenter_a":"Good job tonight I wish we could of heard more","post_message":"Real compassion is providing people a ladder of opportunity to climb up from a state of dependency. #GOPDebate   Visit bencarson.com/issues to learn more."},{"comment_id":"1788331291434935","commenter_b":"She is a nasty woman","commenter_a":"If those liberals ever lost their middle fingers they'd never be able to drive in Oklahoma.","post_message":"Leftist Amy Schumer battling charges of racism..."},{"comment_id":"554676768026413","commenter_b":"Lu Fo see the top comments and it really shows how the middle class sees the negative effects of raising the minimum wage","commenter_a":"so small businesses will make sure they will not hire that 26th person","post_message":"BREAKING: California became the first state in the nation to commit to a $15 per hour minimum wage after Gov. Jerry Brown signed the new law Monday.   Under the plan, minimum wage was expected to increase to $10.50 per hour on Jan. 1, 2017 for businesses with 26 or more employees.  The minimum wage would then rise each year until it reaches $15 per hour in 2022."},{"comment_id":"1812875395612222","commenter_b":"@username......................your a @&$)(:; fool","commenter_a":"Such a BS! Obama made a deal to stop nuclear proliferation. Iran's compliance with our demands lifted the sanctions. So they got THEIR money. Eric Trump is total idiot thinking he knows anything about this matter.","post_message":"\"[President Obama] lied about it. He said that it wasn't ransom money... No different than when he lied about ObamaCare.\"  Yesterday on \"Sunday Morning Futures,\" Eric Trump accused President Obama and Hillary Clinton of lying to the American people."},{"comment_id":"10154028327039411","commenter_b":"Might have a heart... But she has no brains.... Sadly without that.. She is and 326683984410ard like you :)","commenter_a":"Punished for having a heart and a conscience.....","post_message":"'Military jail frightens me less than our society losing its humanity'"}]
