[{"comment_id":"10153952670046509","commenter_b":"Seriously.. Why are people mentioning Asians at all?! Great for them, and when they are highlighted, I praise them too.... However, The point of the article was to bring light to a young man doing exceptionally well. He has a great start to life and a great career. All praises due and deserved. Anything else doesn't even matter.","commenter_a":"Because his SAT scores are off the charts!","post_message":"He was accepted by all 8 Ivy League schools. How’d he do it? @webpagelink"},{"comment_id":"10154003044699199","commenter_b":"They dont wanna work !","commenter_a":"Picking apples and berries?","post_message":"There were 5.4 million job openings in the U.S. in April  the highest number of openings in 15 years.  It is a record high since the Bureau of Labor Statistics began tracking monthly job openings in December 2000."},{"comment_id":"10157552769965725","commenter_b":"IF YOU SAW HANNITY'S TOWNHALL WITH MR. TRUMP TONIGHT- NO PARENT WOULD VOTE FOR KILLARY!! #BUILDTHATWALL!","commenter_a":"I mean that's true, but what are you going to do about that? I guess grow a garden, but then you can only harvest every year, maybe twice a year if you plant early","post_message":"Thank you TEXAS!  We are going to declare our independence from failures of the past and create a New American Future.   Once again, we will have a government of, by, and for the people. Americanism, not globalism, will be our credo."},{"comment_id":"10153317110562377","commenter_b":"Illegals work to build the wall with fair pay. They can stay. No brainer.","commenter_a":"They will pay.","post_message":""},{"comment_id":"415728535218854","commenter_b":"David, you're the world's largest pussy","commenter_a":"the FACT that America is the worlds largest and foremost terrorist breaks my heart because most of the people in this country are better than that but our government sucks shit and has brainwashed them.","post_message":""},{"comment_id":"10153575506851782","commenter_b":"It doesn't show a picture of the impala. All the vehicles in the picture are police cruisers.","commenter_a":"The article says it was a white impala, is it just me or does that car look black?","post_message":"HIGH-SPEED CHASE: Purcell police are chasing a vehicle at speeds of more than 100 mph on 180th Street: @webpagelink"},{"comment_id":"510825025771036","commenter_b":"Exactly!","commenter_a":"The Greatest Good Common Sense is being questioned. Hope these will be at the FUNERALS of those killed by their bad rhetoric.","post_message":"Dr. Ben Carson weighed in on President Barack Obama's open door policy to refugees. What do you think about his comments?"}]
