[{"comment_id":"10157187236600354","commenter_b":"Feminists need to stage another protest akin to their bra burnings in the 60s. Perhaps a massive Hijab burning in multiple western countries.","commenter_a":"So funny how the media always pushes these anti-Iran stories even though iran is 1000x more secular than our \"allies\" Saudi Arabia... let's hear about how many women Saudi Arabia executed breitbart. Stop the Iran propaganda pieces, you're turning into another Fox News.","post_message":"When will feminists take on the REAL \"War on Women\"?    “...promote immoral and un-Islamic culture and promiscuity...”"},{"comment_id":"10153429657851323","commenter_b":"You are the ugliest woman I have ever seen","commenter_a":"My biggest headache: is being a gay a choice or disorder? Please someone help me out.","post_message":"\"Marriage equality is just one front for LGBT rights: full LGBT equality, which includes economic justice, gender identity, immigration rights and racial liberation, is far from assured. [...] But today, one chapter in our fight is closed. Love has triumphed.\""},{"comment_id":"10152660171235950","commenter_b":"My favorite science fiction tv show and movies i like them all i grew up watching Star Trek Spock was my favorite","commenter_a":"I have been and always I shall be your friends. Star Trek II.","post_message":"What's your favorite \"Star Trek\" moment involving the Enterprise's chief science officer?"},{"comment_id":"585038108344735","commenter_b":"@username We've heard all the BULLSHIT IDIOT.","commenter_a":"This man and his comrade, Tad Devine, are two of the most dishonest, hateful individuals ever involved in a major campaign. Bernie's toast and he knows it. Hillary is going to put them away for good by June 7th!","post_message":"Still. Attacking. Hillary."},{"comment_id":"1265724350133686","commenter_b":"Honestly , I couldn't vote for either .. We will have a women in Whitehouse one day.. I want a patriotic POTUS whom puts Americans First always . Male or female makes no difference to me..","commenter_a":"Kirstie ally, was the first one to send Truck loads of supplies during super storm sandy.. \"Truck Loads\" I helped distribute.. Great Lady.. Love Trump","post_message":"Good for her!  She's also taking action herself!    @webpagelink"},{"comment_id":"10154786679373984","commenter_b":"What a shame that this ladies after so many many years will fall for Hillary's BS and the press that are now panicking cause things are getting worse to them and the campaign. Keep wondering how much money is floating around to pay all this people that suddenly have brought this stories and this will continue until Election Day, desperation is the mother of FU. \"GO TRUMP \"","commenter_a":"There is no one that is for Trump that is going to believe this. If it was true theses (ladies) would have spoken up sooner, so you see you people are not talking to morans as you think.","post_message":"Michele Bachmann has gone on national radio and revealed what happened to her when Donald J. Trump hosted her for breakfast -- alone -- in his penthouse.  Every American needs to hear her story. It says a LOT about Trump..."},{"comment_id":"943824045713848","commenter_b":"It´s not a coincidence why Jeb Bush started his campaign in Miami...All his Cuban friends were drug dealers as Leonardo Martínez; money launderers as Armando Codina; Medicare swindlers as Jose Miguel Recarey; dangerous terrorists as Luis Posada Carriles and Orlando Bosch....... and every Cuban corrupt politician of Miami. When Jeb Bush signed the law forbidding to give the Driver License to illegal people in 2005 (he was the first governor to do it), he wanted to push the deportation of millions of illegal NON Cubans from Florida, who could not continue driving and give their jobs to millions of Cubans rafters newcomers. Bush never thought in unemployed veterans or other US citizens. He only has Cubans in his agenda.","commenter_a":"He will lead this country to a war in the sand...and your children will be buried there.....","post_message":"How a group of hecklers forced Jeb Bush to go off script and talk about immigration."}]
