[{"comment_id":"10153631699856680","commenter_b":"Voter beware..","commenter_a":"We need to Unionize and fight back go on strike. I want those Rust belt Democrats to lean left and far left.","post_message":"They used to be Democrats. Now they really could hand Donald J. Trump the White House."},{"comment_id":"10153074180200090","commenter_b":"she is evil and lies so much her nose is growing!","commenter_a":"Question? Why do Hiliary, Rosie and Michelle always have their mouth open when they never say anything.","post_message":"Take the survey if you know Hillary Clinton is trapped in a web of lies: @webpagelink"},{"comment_id":"1478938502146617","commenter_b":"That redneck is probably terrifying his sister...err! Girlfriend!!!","commenter_a":"That woman looks like she's trying to hide her identity. I would too if I had to go to a Trump rally with that gormless chubby asshole. :(","post_message":"\"One man's sexual assault,\" one said, \"is another man's flirtation.\""},{"comment_id":"497111050479475","commenter_b":"She's a sellout to her own race, taking everything that white people gave her, and then spews her racist anti white nonsense to make blacks think she actually cares about them.","commenter_a":"She described racism other countries not ours.","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy.  She's the biggest racist we know, and we won't stand for it.  Do you agree Oprah is racist?"},{"comment_id":"10153344624090326","commenter_b":"Sit down and shut up!","commenter_a":"He has hearing problems nothing is free","post_message":""},{"comment_id":"566067710239006","commenter_b":"Her momma should have sucked it","commenter_a":"Jennifer who!","post_message":"Jennifer Lawrence to Donald Trump: F*** YOU!"},{"comment_id":"1028049810606008","commenter_b":"This evil witch should spend The rest of her life in a solitary jail cell without food or water for all the evil she has perpetrated on this country!!!","commenter_a":"Softball questions","post_message":"She's totally cooperative! And yet she won't talk to investigators. Why? Wait until you see how she tries to explain this one away."}]
