[{"comment_id":"10154315699286509","commenter_b":"No laws were broken She just happened to cross paths with a power hungry pig","commenter_a":"She also wouldn't have been in police custody if she were a law abiding citizen","post_message":"Bernie Sanders said that Sandra Bland wouldn't have died in police custody \"if she were a white woman.\""},{"comment_id":"1066627293358281","commenter_b":"You killed a clumsy one. No more clumsy spiders","commenter_a":"How is that possible? The spider isn't going to breed after it gets killed. Shouldn't TRYING to kill spiders have that effect?","post_message":"Just sayin."},{"comment_id":"10155094877376037","commenter_b":"She deserves the same treatment.... sick sick sick nasty woman. She doesn't deserve life","commenter_a":"Where's the picture of the mother?","post_message":"14-year-old Grace Packer was beaten, raped, poisoned and strangled."},{"comment_id":"984777404931920","commenter_b":"Our weak border has made Mexico Drug Cartel stronger and made Mexico's government weak with corruption. Mexico has some of the most beautiful beaches in the world that are controlled by some of the most deadliest drug cartels. Mexico is losing billions in tourism because of the Cartel. Mexico is a culturally rich country that is being destroyed by these drug cartels. By building this wall it will help both the Mexican and the American economies by stopping drug trade. The Cartels will lose many because supply will be cut of and Mexico will gain strength. 95% of illegal drugs that come across the border will be stopped by a wall. It will in turn save our communities and our youth. Our youth will be able to flourish instead of turning to drugs. Americans will no longer have to depend on Liberal Politicians asking for help, they will be able ...","commenter_a":"Take away handouts and people committing welfare fraud and put them to work. Seems like there's quit a bit of places hiring where I live. I do believe trump is our our hope and is the best choice for president. Bernie is a joke and Hillary is a liar.","post_message":"I will bring our jobs back to the U.S., and keep our companies from leaving. Nobody else can do it. Our economy will \"sing\" again."},{"comment_id":"834253316765245","commenter_b":"Send her back where she came from","commenter_a":"Put her in jail","post_message":"This is as low as it gets.  She is a traitor.   What do you think her punishment should be?"},{"comment_id":"10153684998979228","commenter_b":"Crime has gotten out of hand?? Thank you Captain Obvious.","commenter_a":"Should have been in Chicago to make St. Louis feel safe.","post_message":"St. Louis Mayor Francis Slay says crime in the City of St. Louis has gotten out of hand."},{"comment_id":"693806690773834","commenter_b":"Women should be prosscuted!","commenter_a":"I think this is where the word HOG WASH, came to be.... just saying...","post_message":"How rotten this administration is to the core when the attorney general takes the fifth to avoid incrimination!"}]
