[{"comment_id":"10153378846018037","commenter_b":"Exactly!","commenter_a":"KXAN - you love to get a good argument going, don't you?","post_message":"Did the grand jury make the right decision?"},{"comment_id":"1037555982922868","commenter_b":"GB = Greedy Basturds!","commenter_a":"Where does he live now?","post_message":"Tony Blair’s office said there would be “no negotiations” over his fee, which per-minute is higher than the yearly salary of someone on minimum wage in the UK."},{"comment_id":"10156505662180354","commenter_b":"Give the stupid bitch the boot for good. Free her up so she can go over the Syria and suck up to those murdering rag heads.","commenter_a":"GOOD! This \"professor\" NEEDED to be fired!","post_message":"Read the Christian college's powerful statement..."},{"comment_id":"10153127913913812","commenter_b":"Shut up Canadian","commenter_a":"Classless","post_message":"Leaving her head uncovered in Saudi Arabia, a country where women have few rights, the First Lady leads by example: @webpagelink"},{"comment_id":"10154448547351523","commenter_b":"I got attacked by a rott happens. Why are you so short thinking. Now walk away","commenter_a":"SO SAD - and here come the pit bull lovers who will blame everyone/everything to protect pit bulls - how many people have to be attacked/killed before something is done to stop these attacks?? I suffered a vicious attack by a pit bull and it breaks my heart every time I hear of another pit bull attack. Pit bulls killed 232 Americans between 2005 and 2015 - here are the FACTS: @webpagelink","post_message":"\"Two pit bulls ran out after my dog and just ripped it apart.\""},{"comment_id":"10154724621788984","commenter_b":"Hey Walmart has glasses 2 for the Price of one One for your dumb Head and one for Your your brown spot","commenter_a":"Lady you need to get your head out!Quit your job cause you are not of sound mind like Hillary Clinton","post_message":"Attorney General Loretta Lynch just issued a message to Charlotte rioters - and something about it immediately raised eyebrows."},{"comment_id":"10153491435486880","commenter_b":"Wal-Mart will fall fast, probably years from now when \"Fresh\" is in Full Force! @webpagelink","commenter_a":"Cj Gennaro","post_message":"Amazon.com had a really good day."}]
