[{"comment_id":"432628273528434","commenter_b":"\"Riot Whores\" want to get paid? Tip: a smart whore always gets paid BEFORE the act!","commenter_a":"Soros wanted them, now pay them you socialistic pig!","post_message":"You might agree that these greedy people are missing the whole point."},{"comment_id":"10152896761617293","commenter_b":"and the mob was mad when he called thm out too .... NEXT!! -","commenter_a":"Nothing like calling them as he (and most of the rest of the world) sees 'em!","post_message":"\"Currently, an evil front is being formed against us,\" he said. \"Now the pope has joined this conspiracy.\""},{"comment_id":"602980583159868","commenter_b":"The majority of these people have never seen much less used a toilet. The do it everywhere at any time. It's sickening besides disgusting and a health problem. Expect to see toilets broken or destroyed in bathrooms from now on.","commenter_a":"Another cost to be added to culturally incompatible immigration","post_message":"Public restrooms are going to get an unusual addition due to all the immigrants coming in. The reason for the change will make you sick."},{"comment_id":"10153176047249255","commenter_b":"His wife should also go to jail .","commenter_a":"Such a self proclaimed victim.","post_message":"This story gets crazier every hour."},{"comment_id":"10154838337948797","commenter_b":"Mask? How did a hijab become a mask?","commenter_a":"Religious garment is to be used at church. As she lives in America she must take off the mask, is better for her to wear a miniskirt on this hot weather","post_message":"SOUND OFF: A woman wearing a hijab was asked to leave a Family Dollar store because of her Muslim face veil. When she protested that it was a religious garment, the manager explained that it is a high-crime area and the store gets \"robbed a lot. Was the store manager right in kicking her out? How would you have handled the situation? The best responses will go on air!"},{"comment_id":"836649156384109","commenter_b":"he s a crook","commenter_a":"Shake hands then shoot the f'er in the head.","post_message":"Rahm Emanuel just wants to be friends with Chicago unions"},{"comment_id":"10153702293656636","commenter_b":"better christian refugees than islamic terrorists.","commenter_a":"This is a Christian country and if you dont like it, dont worry!! We will not cut your head off or throw you off a building, or blow up innocent people ...we all know the \"kind\" religion that does all that kind of stuff..","post_message":"'One question they asked me was very strange'"}]
