[{"comment_id":"1792520417642435","commenter_b":"Darlene is a freaking moon bat low life from Mars. Leave the scum alone.","commenter_a":"desroy Clinton, do not hold back, destroy this criminal.","post_message":"Crooked Hillary Clinton wants to essentially abolish the 2nd Amendment. No gun owner can ever vote for Clinton!"},{"comment_id":"1208631035874947","commenter_b":"It's like they are in our brains.","commenter_a":"Hahahaha Donna Chin, @username @username! (Rix I think that number 9 & 11 will be very familiar to you Hahahaha)","post_message":"You know they're a real friend when you can be a dick to them."},{"comment_id":"1414624065217353","commenter_b":"Oh please better vetting will even make the refugees safer. The ban is temporary and no one will die..","commenter_a":"I am against legislation or executive actions that do not have broad support from both sides of the political spectrum.","post_message":"The President's Executive Order against immigrants and refugees is contrary to American values. Do you agree? Take the survey: @webpagelink"},{"comment_id":"10153538645367232","commenter_b":"Yous are CRAZY, certainly it HAD to ALWAYS be a GHETTO, NO one would ruin a neighborhood ;)","commenter_a":"What Camden used to look like before the take over.","post_message":"Females attack woman with pole on South Jersey street in broad daylight and it was caught on camera: WATCH THE VIDEO => @webpagelink"},{"comment_id":"10153434193979138","commenter_b":"Time to ban women..","commenter_a":"Women are crazy!","post_message":"DEVELOPING- A St. Paul woman has been taken into custody after her boyfriend was stabbed to death this morning"},{"comment_id":"10153007024072894","commenter_b":"He dumb why have that baby get close to him if he didn't know for sure if she is his baby he should've got that done first","commenter_a":"Maury would have done it for free","post_message":"Chris Brown Files Petition to Establish Paternity of Daughter Royalty"},{"comment_id":"10153046800841717","commenter_b":"Thats one stupid bitch.","commenter_a":"Ok, now it should be the electric chair! This woman is a menace to society and to the rule of democratic law. What a pity she is incapable of learning new skills like other related species! Lol...next she wll have her own TV show!","post_message":""}]
