[{"comment_id":"10154292221654411","commenter_b":"Aka....draw and quarter Snyder.....lil bitch","commenter_a":"Cunts are a shame....get rid of them...","post_message":"The problem isn infrastructure but rather 'a hate crime and mass poisoning of Black and poor people,'  filmmaker Michael Moore."},{"comment_id":"10156390039050725","commenter_b":"That would be the best way to guarantee Hillary into the White House!","commenter_a":"I will!","post_message":"A new poll indicates that 68% of my supporters would vote for me if I departed the GOP & ran as an independent.   @webpagelink"},{"comment_id":"1248622855149182","commenter_b":"@username not to mention more people have voted for her","commenter_a":"@webpagelink/ Bernie Sanders is SO close to winning the nomination, my fellow Berners! We will have a contested convention in July where both candidates will have the chance to sway the Super delegates. This is excellent news and shows that hard work does pay off. Our political revolution has put the country on the right track to put progressive policies in motion and that means we can have a better future by working together today. Join the movement! #notmeus #berniesanders","post_message":"Will tomorrow be the beginning of the general election? What’s next for Ted Cruz and John Kasich if Donald Trump wins today? What’s next for Bernie Sanders if Hillary Clinton wins today?  Our editor-in-chief Judd Legum and politics editor Aaron Rupar talk about the implications of the Indiana primary."},{"comment_id":"10154766887574199","commenter_b":"What's his out of state criminal history? 50k for even felony Malicious Mischief is absurd. He's got no in state history.","commenter_a":"they got me y'all i should have never came down","post_message":"Prosecution had asked for court to set $100,000 bail; judge set it at $50,000"},{"comment_id":"10153626363751336","commenter_b":"If a man wants to kill,he can kill without a gun..might as well push for knife control while you at it..","commenter_a":"That's cause he's an idiot.","post_message":"\"I've got to do something going forward that makes her life meaningful and will always be with me. And this is the way to do it.\" – Andy Parker"},{"comment_id":"1007061529350376","commenter_b":"Merry I'm very aware it won't be Carly. It's not time for a female President :-) No female running has the ability to do the job. They're both failures in their past jobs.","commenter_a":"The debate proved why we need a Republican President and not Hillary.","post_message":"If you watched yesterday’s debate, you know we can’t afford to have a Republican in the White House. Say you're with Hillary—add your name: @webpagelink"},{"comment_id":"539258706198723","commenter_b":"Fuck her","commenter_a":"She wrote the book on \"reckless\" and \"dangerous foreign policy\". Just ask Sean Smith's mother.","post_message":"Hillary Clinton took aim at Republican candidate Donald Trump's foreign policy calling it \"reckless\" and possibly \"dangerous.\" Do you agree or disagree?"}]
