[{"comment_id":"1452044741482218","commenter_b":"You need to put down your crack pipe that crap has fried your brain; dumb witch","commenter_a":"Democrats r a bunch if liars ..republicans are honest and classy","post_message":"\"I knew Ronald Reagan. I worked for Ronald Reagan. Donald Trump, you are no Ronald Reagan.\"  -Republican Doug Elmets says he's voting for a Democrat for the first time in 40 years.  More: @webpagelink"},{"comment_id":"1223281327711322","commenter_b":"PUT HER IN JAIL.","commenter_a":"They couldn't vote for her if she was in prison where she belongs America needs JUSTICE","post_message":"Read WHY!! @webpagelink"},{"comment_id":"10153157305281636","commenter_b":"very wicked woman ! she deserve it.","commenter_a":"The states where the capital punishment extists are muderers on the level of the nation.","post_message":"Even Pope Francis made a last-minute appeal for clemency"},{"comment_id":"10152943088035950","commenter_b":"OMG, this woman is beyond ridiculous. WTF for real.","commenter_a":"@username. Then we have these morons !","post_message":"A special education teacher accused of holding an autistic boy upside-down and lowering him head-first into a trash says she was trying to \"shake out that trashy behavior.\""},{"comment_id":"1724833864402419","commenter_b":"We're going to drive one right up that midgets rectum","commenter_a":"Hey its cool. He's just demonstrating our first amendment rights. Lol","post_message":"NKorea claims could wipe out Manhattan with hydrogen bomb..."},{"comment_id":"1199514790068549","commenter_b":"\"Tear Down This Wall!!\"","commenter_a":"Reagan might but Eisenhower would not as he was too far left for todays GOP.","post_message":"When you compare self-identified Republicans today to those of 1990, you have to wonder how well Reagan would do in the 2016 race."},{"comment_id":"1050271788402406","commenter_b":"My father is vet and is against privatizing !!!","commenter_a":"Privatizing is what the vets want. Who knows more about it than the vets!","post_message":"\"We cannot – and I will not – put our vets at the mercy of private insurance companies without any care coordination or leave them to fend for themselves with healthcare providers who have no expertise in the unique challenges that are facing our veterans.\"   --Hillary Clinton"}]
