[{"comment_id":"10154478022181973","commenter_b":"I was looking at the protest videos of the inauguration and in a couple of clips I saw ppl with anarchists gear on vandalizing those businesses so I don't like it when the media on both sides of the aisle says it's only one group causing something.","commenter_a":"I WANT A ANSWER LIBERALS. WHY HIDE YOUR FACE? I BET I WON'T GET ONE.","post_message":"During the \"Not My Presidents Day\" rally, bike-mounted officers pushed the crowd out of the street and a standoff ensued, with police in riot gear keeping the protesters to the sidewalks. Then, as the protesters stood by and chanted, police charged in and grabbed several people, dragging them from the crowd before they were handcuffed and put in waiting police vans. Read more here: @webpagelink"},{"comment_id":"10156578303710354","commenter_b":"Bill's actions are not the real issue ... how Hillary victimized Bill's victims is the real issue. Bill abused women, Hillary declared war on the women Bill abused.","commenter_a":"Hillary knew about bill and his abuse","post_message":"Silence, peasant!"},{"comment_id":"10153945606794060","commenter_b":"Shut up!","commenter_a":"Turkey is the gateway for Islamists to enter Europe and the birthplace of fascism.","post_message":"For the Turkish nation Turkishness goes beyond nationality. But some citizens consider themselves more Turkish than others"},{"comment_id":"10152863339776491","commenter_b":"Just think all the traffic that's been through her!! Her germs have germs!!","commenter_a":"Can you imagine being the one that has to kiss those lips? Ugh. I mean uuuugggghh!","post_message":"\"Every time I say something that’s extremely truthful out loud, it literally breaks the Internet.\""},{"comment_id":"10154040549579411","commenter_b":"YOU STUPID WOMAN! Read some history first...","commenter_a":"Muslims ruled India from 7th century till 1856. All Indian heritage is created by Muslims rulers they civilized curry mouncher but still not enough... In entire Muslim India history you cannot find Hindu execution or forced convert to Islam..... Same 700 years Muslim rule on Spain... No force to converte to Islam.. No execution.","post_message":"5 assailants arrested, including a barber"},{"comment_id":"1155452914533533","commenter_b":"She has blood in her hands #garyjohnson President 2016","commenter_a":"Hilary Clinton my president of America, I'm so Happy for and all the women's should be able to learn from her. My president Clinton is very professional and smart. Sorry! Trumper's but it's time to be in the top line. \"With great people, we move forward to another level\"","post_message":"Michelle Obama on Donald J. Trump: \"...that's why he demeans and humiliates women as if we're objects meant solely for pleasure and entertainment.\" @webpagelink"},{"comment_id":"10154542878929714","commenter_b":"Their professionals,and should set an example.","commenter_a":"Morals clauses","post_message":"This school district wants teachers to stop wearing graphic T-shirts and flip-flops to work."}]
