[{"comment_id":"10152774797039877","commenter_b":"She still in hot water","commenter_a":"So wait a min. Im from cleveland lol. So this boy was 5'7 195 lbs bundled up pointing a fake gun at people in the park with his little sister..... Yea the cops did not have to kill him but no one thinks the parenting is to blame ??","post_message":"Extended Tamir Rice Video Shows Cop Tackle His 14-Yr-Old Sister As She Rushed To Her Dying Little Brother's Aid. Watch the heartbreaking video here. Grio fam, sound off with your thoughts on this extended video."},{"comment_id":"10154178050418010","commenter_b":"I saw it! I was walking to the store to get cat litter and it went right in front of me when I was at Hollywood and Sycamore","commenter_a":"Ernesto Peimbert","post_message":"Open convertible driving in the rain: ✓ Donuts on Hollywood Blvd.: ✓ Entire thing almost derailed by a TMZ bus: ✓ It's too early to say, but this may be the most L.A. car chase of all time."},{"comment_id":"485911244932789","commenter_b":"be head her","commenter_a":"Yes , l support our police","post_message":"A woman is suing the police department... over a hijab? This woman broke the law, the police are completely in the right. Do you support our police?"},{"comment_id":"10152606529540950","commenter_b":"Okay says the 21 year old hag","commenter_a":"Old bag","post_message":"Hilary Clinton tweets support for getting children vaccinated @webpagelink"},{"comment_id":"10154096879120329","commenter_b":"Girl buy a shirt that will fit","commenter_a":"Jenny","post_message":"Anyone who says they made it into adulthood unscathed is either lucky AF or a liar."},{"comment_id":"10153116909760671","commenter_b":"As they should I would not want men in a women's locker room even if he dresses like a women, just think about how it smells that would be enough for me to wait until there showered.","commenter_a":"Try sending in a transgender reporter, that'll make 'em happy!","post_message":"“I have covered male sporting events all over the world and it took coming to Indianapolis to face my first gender discrimination,” one of the journalists wrote on Twitter. Thoughts?"},{"comment_id":"10154051866134087","commenter_b":"His bitch better get ready to be deported and come here the right way","commenter_a":"fuck you ass","post_message":"Trump says maybe his deportation task force will be able to deport Clinton. READ MORE: @webpagelink"}]
