[{"comment_id":"10152546933456776","commenter_b":"Get all the illegals out of our country, Enforce our constitution and the god it was based upon twtf","commenter_a":"Let's get those illegals out of here and all those Muslims who hate us","post_message":"Today I was sworn into the U.S. Senate. It's a great honor to serve the people of Louisiana. Our state has limitless possibilities. Let’s take advantage of our natural resources as a way to create better jobs with better benefits for Louisiana families. Let’s work for healthcare solutions that give patients the power to make their own decisions. Let’s protect family values and the ideals our Founding Fathers established in the Constitution. I look forward to working together. I'm with you."},{"comment_id":"10154521519049726","commenter_b":"I'm not especially interested in Mexico paying for it - our wall and WE NEED TO GET IT DONE!","commenter_a":"Trump will not only get Mexico to pay for a wall but he will get them to see it's value to them and want it!","post_message":"From Pence's appearance on my show today — Pence all detailed how he and Trump will make Mexico pay for the border wall:"},{"comment_id":"10153258414916770","commenter_b":"she more democrat liberal pig","commenter_a":"Megyn Kelly shouldn't be permitted to go anywhere near another GOP debate for the rest of her life after the debacle of the last one she was allowed to moderate..The sooner Fox News fires her off into oblivion the better..","post_message":"Donald J. Trump reignites the drama between himself and Megyn Kelly ahead of the January 28th Fox News Republican Debate."},{"comment_id":"542034032653843","commenter_b":"Dumb ass","commenter_a":"Right....looks who is racist Obama... You! Who is BSing Whom?","post_message":"Obama just told the entire world that we have racist cops. He has absolutely no respect for the hardworking people that make this country work. Do you agree is a complete embarrassment to our country?"},{"comment_id":"896491237077292","commenter_b":"Give me a break with the martyrdom... I don't think this is an appropriate way to handle this.. Sian is right.. her's will fade and you will be left with nasty looking legs.","commenter_a":"The things you do for love","post_message":"Their daughter couldn't be happier...she even points at the tattoos and yells 'match!'"},{"comment_id":"1187051574713979","commenter_b":"She don't care why try and make her lower her standards. Melania is a very classy lady and you want her to lower herself and dress down.","commenter_a":"I'm sure she can find another dresser! No big deal!","post_message":"Michelle Obama's favorite designer, a woman who dressed the First Lady for 8 years in a row, just refused to dress Melania Trump. The reason? She isn't tolerant of her despite asking everyone else to be tolerant of her. The self-professed liberal meant to snub the new First Lady -- but she never saw this coming."},{"comment_id":"542727622584484","commenter_b":"she need to go home back where she came from","commenter_a":"They all look like robbers and murderers with that shit on there head.","post_message":"This Muslim woman was just kicked out of the mall because of this. If you can't follow the rules, you can't shop here. Do you think Muslims should obey the rules or leave?"}]
