[{"comment_id":"10153441041876037","commenter_b":"She was living a lie by her own choosing. Time to clean it up.","commenter_a":"When her tan started to fade did anyone ever think she looked a bit less black?","post_message":"In a resignation post, the civil rights activist vows to fight for “what is right and good in this world.”"},{"comment_id":"10153485432146323","commenter_b":"I'm coming niggas!","commenter_a":"'@username this was the place I was talking about when we were talking about the travelling think","post_message":"Surfer Mick Fanning makes a lucky escape after being attacked by a shark during the final of the J-Bay surfing competition in South Africa on Sunday. Full story: @webpagelink"},{"comment_id":"10154425089776509","commenter_b":"Shut up you feminine POS","commenter_a":"Classic example of a Bernie supporter","post_message":"'Bernie's like a kush, like the best kind of weed you can get,' Tommy Chong said of Bernie Sanders."},{"comment_id":"853456421380774","commenter_b":"She can only be arrested if she goes to Egypt so best she stays away . But good she speaks out","commenter_a":"Good","post_message":"Clooney’s wife threatened with arrest."},{"comment_id":"10153096842961748","commenter_b":"The only thing that is happening is Bigots are being exposed, and shown for what they are!","commenter_a":"As ALWAYS - it is just the opposite! Conservatives are attacking the laws that protect EVERYONE, including themselves, from discrimination. Gays are challenging those attacks in order to preserve and PROTECT freedom. Only backwoods IDIOTS would not understand that.","post_message":"Gay people are lighting America on fire! According to a new anti-gay 'documentary,' anyone who owns a business or holds public office is under attack."},{"comment_id":"1283735711683013","commenter_b":"horrible woman","commenter_a":"How bitchy she is...very bad attitude though","post_message":"The Hungarian camerawoman who tripped and kicked migrants has been sentenced."},{"comment_id":"731938580238084","commenter_b":"We need to look at all facts here. It looks like the victim went looking for trouble. YOU DON'T ASK YOUR SON TO GO GET THIS GUN! I have a feeling she could have been alive today if she had acted like a responsible adult and called the police if he had threatened her. Also, if she was the victim of a gun fight which she started. I WOULD JUST CALL THIS SAD! SAD SHE DID NOT HAVE BETTER SENSE AND LESS ANGER!","commenter_a":"WaaaWaaaa!!!!","post_message":"He suffered a severe head injury, records show."}]
