[{"comment_id":"785168271673750","commenter_b":"These BUTTs ( Bad Uncivilized Terrorist Thugs ) are just showing what they are, BUTTs, they are just showing their colors, this is a sign of ignorance. If this people would listen to intelligent people they would know that pants up don't loot is the best way to go.","commenter_a":"If they want to look like idiots....it's their choice....there are other more pressing issues that is worrisome !!!!","post_message":"Louisiana Passes New Law That Will Fine Anyone Wearing Saggy Pants.  This is amazing. It should be a law in all 50 states.  Do you support this new law?"},{"comment_id":"1641329602799278","commenter_b":"Black lives matters ass bitch","commenter_a":"This person needs to be arrested!","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"},{"comment_id":"10158027884060354","commenter_b":"I'm proud I didn't vote for Trump who is a racist, woman groping sleaze and fails to pay a hard working startup business owner caterer because he told her she would get more business when people hear she catered his wedding and had to pay her employees out of her pocket. And believes because he is rich he has the right to treat women as he pleases. You can vote for him not me. My husband thinks he's NUTS!","commenter_a":"He's still under numerous criminal and civil investigations, whether they are by the FBI or not. Numerous court dates, numerous lawsuits, etc, etc.","post_message":""},{"comment_id":"1079865505382241","commenter_b":"This video is retarded. Women aren't funny.","commenter_a":"Adam Isaacs","post_message":"There's an absurd stereotype that women aren't funny."},{"comment_id":"10156665343745725","commenter_b":"Build the Wall!","commenter_a":"Thank you Donald Trump, I know all of this campaigning is a lot of work and tiresome. I sure hope you can find all of the strength and energy you need to keep up with negative stuff, because I know you are fighting for us the people. And we sure want you to go all the way to the Presidency. There has been no one will to fight for common sense and for the normal and real people of the great country. We all just need a chance to do and be great! Thank you again","post_message":"GOOD MORNING SOUTH CAROLINA! Do not forget to get out and vote today! The poll numbers are outstanding. They mean nothing, if we don't ALL get out to the polls & VOTE! Together, we will MAKE AMERICA SAFE & GREAT AGAIN! Thank you!"},{"comment_id":"10155064838244497","commenter_b":"Cankles, in Hillary's case","commenter_a":"Mike Pence is worried that those shameless hussies will show a flash of their ankles during the march.","post_message":"\"I can tell you how let down I feel by the heads of these households who did not simply give their wives and daughters a firm, decisive  when they asked to participate in today demonstration.\""},{"comment_id":"718075635009295","commenter_b":"Mrs Trump has nice Tits too lol","commenter_a":"Mrs. Trump, what an elegant peaceful person, a very classy confident individual...reminds me of Nancy Reagan!!!","post_message":"Michelle Obama will be remembered as the most vile and arrogant First Lady in US history!!! Let's get 4,000 SHARES to support our NEW First Lady Melania TRUMP!"}]
