[{"comment_id":"10153235598706756","commenter_b":"Its when your chakras are misaligned, or your spirit animal needs a vet. The only treatment is #woofighters","commenter_a":"what exactly is \"psychic damage\"?","post_message":"Maureen Corrigan says the story \"reflects on the unearned power that beauty confers on its recipients; rather less convincingly, it also tries to make a case for the psychic damage of being beautiful in a world that's all too eager to rate women primarily on their looks.\""},{"comment_id":"1008881259209071","commenter_b":"America is in bad shape and people can't see it. I don't understand why they are for Hillary. She can't do a thing but lie. She will do nothing for poor and middle class. How do people not see this? ?? I am amazed at how stupid people are thinking life will be better with her doing what Obama has for 8 years. Bankrupting America and millions of Americans. WHAT has she done FOR America? ?? More. ..what has she done TO America? The red states will get it right I hope. If only the people in the swing states would come to their senses.","commenter_a":"Yep, you said it right, power and money, but wait , they want your votes too, hahahahahaha hahahahahaha hahahahahaha, I am not stupid, Hillary is not getting my vote","post_message":"\"The Clintons are greedy. They love money. They love money so much they've been accused of ignoring ethics and, very likely, laws to rake in more and more money.\" – Eric Bolling @webpagelink"},{"comment_id":"1387674034582344","commenter_b":"@username if i had a girlfriend i probably would not watch porn, but women are picky and i am nothing special.","commenter_a":"BAN PORNOGRAPHY...simple. It is a debauched and at times cruel form of sex and at the moment is fully open to those low-lives whose brain thinks it's fully acceptable to either engage in such ridiculous practices or expect their partners to or inflict it on others. Of course this terrible crime on this poor girl was inflicted by a deviant but the role of watching pornography put fuel to the fire...BAN IT!!!!!!","post_message":"The man who held Elizabeth Smart captive when she was a teenager regularly looked at pornography, which \"just led to him raping me more,\" the now 28-year-old woman says in a new video."},{"comment_id":"10154242655245470","commenter_b":"@username bush got much much more killed. Both are evil.","commenter_a":"Wasn't there a war going on? You all are concerned about her supposedly lying and 4 military personnel died? Any concern about weapons of mass destruction lie GW Bush told and has been responsible for 7000 deaths?","post_message":"The suit claims the victims' deaths \"were directly and proximately caused by the negligent and reckless actions of Defendant Clinton.\""},{"comment_id":"1275473112509215","commenter_b":"#GrabThemByThePussy #MakingSexualAssaultGreatAgain","commenter_a":"Deplorables say don't judge Trump for something he did ten years ago yet they keep bringing up something Bill Clinton did 20 years ago. Deplorables say Hillary is an enabler for standing by her cheating husband.... But Melania is a good wife for standing by her twice divorced husband who cheated on her while she was pregnant? Hypocrisy is the running mate of Donald Trump. And sexual assault. Don't forget that. #GrabThemByThePu$$y #MakeSexualAssaultGreatAgain","post_message":"\"Everyone knows how bright she is and how resilient she is, but...they're going to see how much she cares.\" —Joe Biden"},{"comment_id":"10155709379820389","commenter_b":"Let ISIS continue to take these worthless countries and killing all the cowards. Once they have taken all the muslim countries, we'll know what is left is our enemy and then we kill them. There is NO good reason to kill more Americans defending a people that runs and are unwilling to fight. We shouldn't give aid or weapons....our money would be better spent here at home.","commenter_a":"Screw this pathetic administration. Iraq needs us and this pathetic socialist President turns his back. My friends and I shed blood, sweat and tears to give the Iraqi's freedom only to have our coward of a leader destroy all we did.","post_message":"\"The United States is not going to be responsible for securing the security situation inside of Iraq,\" Press Secretary Josh Earnest told Fox News."},{"comment_id":"10153458308386336","commenter_b":"He'll build housing for the illegals on it.","commenter_a":"this man should be named adolph hitler.","post_message":"Despite Republican resistance, Pres. Obama announced the creation of three national monuments, encompassing more than a million acres of protected sites in Nevada, Texas and California."}]
