[{"comment_id":"10153031435480671","commenter_b":"Soldier on ladies!","commenter_a":"Ricky Myette","post_message":"What do you think about two women graduating from the Army's elite Ranger School?"},{"comment_id":"1610722349214878","commenter_b":"wow beautiful.......","commenter_a":"Beautiful","post_message":"Wow. I've got chills. God is so good."},{"comment_id":"10153460596675779","commenter_b":"Complete agree David!!! Oh, by the way, I'm a female gun owner ;)","commenter_a":"She is a genius. I hope she realizes how hard your life can get when you make an enemy of the NRA! All you have to do is casually mention gun control or background checks and 50 whack - jobs will jump down your throat. If you're on t.v. it must be much much worse. Look what happened with Amy Schumer.","post_message":"Samantha Bee highlighted a glaring, surreal NRA double standard on Full Frontal with Samantha Bee yesterday, stockpiling a small weapons arsenal while trudging through red tape as she tried to nab her own Eddie Eagle costume, the NRA's gun safety mascot. Watch below."},{"comment_id":"10154201803933869","commenter_b":"44?","commenter_a":"In fairness, what President hasn't had to pay $25 million to make a massive class action fraud lawsuit go away before assuming office?","post_message":"The election of Donald J. Trump to the Presidency is nothing less than a tragedy for the American republic, David Remnick writes."},{"comment_id":"10154964993289411","commenter_b":"What have they to complain about the weather in Greece is lovely.","commenter_a":"pablo escobar ?","post_message":"LIVE: Protesters rally in Athens to honor memory of teen killed by police COURTESY: Ruptly"},{"comment_id":"10153461345971130","commenter_b":"Arrogant bitch. Who does she think she is? Shut up and go back to whatever latin dump you crawled out of.","commenter_a":"Coreena Christensen could agree any more!!! perfectly said","post_message":""},{"comment_id":"1407318236234112","commenter_b":"@username seek help and do it quickly!","commenter_a":"@username is under investigation by the FBI, she should not be allowed to run for President or own a gun or have people hired by her having guns there are laws against organized crime and she should be put on a no fly list, but because the Government is corrupted and is allowing Hillary to sell favors to Americas enemies which is Treason she'll get away with it.","post_message":"A great day to hit the campaign trail in Ohio with Elizabeth Warren."}]
