[{"comment_id":"429016630556711","commenter_b":"Fuck off cunt slut ...","commenter_a":"Why is the cuffed woman running? If she woulda kept her cuffed ass where it needed to be she'd be fine","post_message":"This cop was too lazy to run after the woman so he tasered her causing her muscles to lock up. She fell, hit her head and later died from injuries. What do you think of this case?"},{"comment_id":"10153500345233352","commenter_b":"Real women make it happen!! (:","commenter_a":"10.50 ???? I make $8.00 hr with 4 kids and a grandbaby,no child support,no housing I can tell a story","post_message":"Single mom, 22, reveals her struggle to live on McDonald’s wages of $10.50 an hour… and how she and her young son have to live in a moldy basement"},{"comment_id":"1133219213367232","commenter_b":"Brian spot on brother our country is sick you hit nail on the head God bless you.","commenter_a":"AGREE, 100%. AMEN,","post_message":"YES!"},{"comment_id":"10154254404659411","commenter_b":"ya protest naked on the streets like the old lady in Australia it is 100% success rate","commenter_a":"Excellent News! These EU Nazi fascists need to be confined to the dust bin of history, and this thieving scum Schulz, Junkyard and is cronies sent to the gulag for the remainder of their lives for ruining so many lives in pursuit of their s**t sack Utopian dream which extends no further then their own arse pocket of course. Now, on another note, anyone have any ideas on we can help this festering turd of an EUSSR to collapse any faster????","post_message":"'Implosion of the EU'"},{"comment_id":"10153445067641051","commenter_b":"She is a selfish bitch with no sense of humor for leaving him.","commenter_a":"I don't blame her. What a shame that he had to get drunk! Now suffer whatever it takes to get rid of other!!!","post_message":"This wife took one look at the tattoo her husband decided to get and immediately kicked him out of the house."},{"comment_id":"1714915928784727","commenter_b":"Looks like she fought with a lawnmower and lost! Seriously, she wants to look like that..... It looks horrendous","commenter_a":"UGH!","post_message":"What do you think of this extreme cut? Marketers are branding it “quirky, stylish and smooth.”"},{"comment_id":"10153507200311336","commenter_b":"Cool end abortion I'll send all the mothers that can't afford to take care of their kids to you.","commenter_a":"Amen! I can't believe people are so desensitized to what is happening all around us. It is our duty as human beings to stand against this, which is actual murder. Abortion is wrong at any point and specifically aborting a baby at 24 weeks, the same time they can live out of the womb is just completely inhumane and murderous.","post_message":"ICYMI: \"Destroying innocent life and harvesting human organs is beyond barbaric -- it is unimaginably immoral, grotesque, and evil,\" writes 2016 presidential contender Gov. Mike Huckabee."}]
