[{"comment_id":"681728708652647","commenter_b":"why would anyone want a sick old lady in office @webpagelink","commenter_a":"We are stronger together unless you're a minority! Then people like @username and Obama will use your vote every single election while destroying your family and destroying your wealth! If you do get out of the horrible system that they have helped create, they will take credit for it when you have success! She is an embarrassment!","post_message":"We're stronger together—and the diversity of our athletes in Rio proved it."},{"comment_id":"10153686958951028","commenter_b":"Not her? This is total and a unpleasant BS!!!","commenter_a":"Joseph & Christine wowwww","post_message":"Former professional wrestler Chyna has died at age 46, her manager confirmed to NBC4. @webpagelink"},{"comment_id":"1203183663111217","commenter_b":"STFU","commenter_a":"Nothing Mr. Trump does compares with crimes Hillary and obama have committed.","post_message":"A prominent Republican who supports Donald Trump urged the candidate to start acting like “a potential leader of the United States.”"},{"comment_id":"1110454952404615","commenter_b":"She is nasty and mean.","commenter_a":"Yes she has","post_message":"MULTIPLE CHOICE QUIZ time, kiddies! Which answer did YOU choose? A or B? Enjoy and SHARE with 1M peeps! @webpagelink"},{"comment_id":"1790539951180053","commenter_b":"Yes I'm so glad we have had 164 shootings still at war . and trillions more in dept millions more in wellfare a totally screwed up healthcare system. Iran nuclear deal giving Iran billions . can't read it if you don't sign it . let's lie to the Americans because they are to dumb to see it . it was a video we are sorry ,sorry you destroyed our embassy killed raped and mutilated our people. Here is a couple of billion dollars and forget what you already owe us . oh and can we raise the dept drilling again or we won't pay SSI to the people who ducking paid into it . but let's keep those welfare checks going got to keep my peeps happy . get Chicago how are those tough gun laws going , highest rate of gun crime in the country . yup more gun ...","commenter_a":"Thank you GOD for giving us President Obama for two terms!!!!!!","post_message":"Hear that Donald J. Trump? President Obama DGAF about how you describe a terrorist attack."},{"comment_id":"10153123956077452","commenter_b":"🇺🇸😇❤️","commenter_a":"Jose","post_message":"BREAKING NEWS: A Marine has been found dead with a gunshot wound to the head at a shooting range at Camp Pendleton Marine Base."},{"comment_id":"1062386963799539","commenter_b":"'@username Much like one refinances one's house at a lower rate. Sure sounds Republican to me.","commenter_a":"And this political cartoon shows why he should. Personally I'd prefer that he wait and allow a Democrat president appoint him to the Supreme Court.","post_message":"Does this about sum it up?"}]
