[{"comment_id":"637619693095276","commenter_b":"Lock her up","commenter_a":"ITS FUCKTARDS LIKE YOU THATS FUCKED THIS COUNTRY UP ,, AND THE LIVES OF YOUR KIDS !! G E T T O T R A S H. !!","post_message":"This woman is bragging about stealing your tax dollars.  Disgraceful. She should be kicked off welfare and be forced to pay us back immediately.  Do you agree we should kick her out of the country?"},{"comment_id":"10153011198456717","commenter_b":"Time to jail her ass","commenter_a":"Yay!","post_message":""},{"comment_id":"10153816653768854","commenter_b":"Did you see the gaggle of stupid white girls in the \"shield?\" I wonder why they hate their daddies so much.","commenter_a":"All that money spent, all the debt incurred, to produce kids like that.","post_message":"Liberalism is a Mental Disorder: Professor of Media Threatens Media with Mob Violence for Trying to Film Protest  [VIDEO]"},{"comment_id":"533893623467884","commenter_b":"Lol. Fuck off bitch.","commenter_a":"He has the truth. God Blessbhim.","post_message":"Obama is furious after Ted Nuget takes an epic stand against him.  He speaks the truth. Nuget needs your support.  Can we get 10,000 'LIKES' for Ted Nugent's epic stand against Obama?"},{"comment_id":"529094357257035","commenter_b":"No, no I'm not.","commenter_a":"You are just another phoney.","post_message":""},{"comment_id":"10153790527131336","commenter_b":"Coming in your town soon.","commenter_a":"Beyond stupid","post_message":"Critics have pointed out that the Obama administration has taken a different position when it comes to defending Christians' religious liberties."},{"comment_id":"10153644347998188","commenter_b":"Your opinion from your dreams Beck! It is a year before the election it is speculation at this point!","commenter_a":"I have been impressed with Carly for a few months and thought she did really well getting her points across, only wish she would be a little more warm and natural. She needs to be more likable. Rubio was outstanding with his knowledge of world affairs and ability to connect. Very presidential. Dump the Trump!","post_message":"Biggest winner: Carly Fiorina biggest Loser: Trump.  She looked presidential, serious, sharp, well informed, non establishment and tough.  Second place:  tie Rubio and Cruz  Close third: Carson (although because he is so different in volume, pace and style he may surprise me and others)  Biggest loser was so clearly Trump.  He is just not likable.  I just don't believe he is liked by tea party members.   I stood with them and looked into their eyes, is poke with them, marched with them and there is just nothing they have in common except being fed up.   If that is all he has, it is going to crater quickly.   He looked like a bully, sleazy and I just can't imagine good hearted, humble, faithful Americans falling for this arrogant anger much longer.   What average non political woman will connect with them?  Runner up for loser:  Bush.  He was rattled.  It is clear, he hates Donald trump.  While there were a couple of times I felt sorry for Bush. It didn't make me think he would be great if he were rattled by Putin or the mullahs.  This was a mortal wound for bush I think.  Also the big loser:  America.  It was so childish much of it.     #gopdebate #cnndebate"}]
