[{"comment_id":"1756313234607564","commenter_b":"Hillary the Corrupt Witch Bitch !","commenter_a":"#NeverHillary!","post_message":"***UNPRECEDENTED CORRUPTION***"},{"comment_id":"10153675187678352","commenter_b":"Trust no Bitch","commenter_a":"On the next episode of Orange is the New Black....","post_message":"‘You might as well go ahead and execute me, because I’m not going to make it to 73′: Woman, 51, who beat her friend to death with a slow cooker in a row over politics is jailed for 23 years"},{"comment_id":"10153114597787507","commenter_b":"I thought women were the snakes","commenter_a":"An old lady told me about 30 years ago: Some men would screw a snake if someone would hold the head. So there you go!","post_message":"Go get em!"},{"comment_id":"541066452731681","commenter_b":"Melania Trump speaks 5 languages and has a degree in architecture and design!!! That sets a new HIGH STANDARD FOR THE FIRST LADIES!!! I LOVE Donald Trump","commenter_a":"If we really get to vote and they really count them correctly, Trump will WIN..... but that remains to be seen. Trump one great American for President ! Go Trump !!!","post_message":"Join us at a TRUMP 2016 Presidential Rally near you! Daily updates at www.donaldjtrump.com/schedule - we look forward to welcoming you! Thank you for your continued support!"},{"comment_id":"10152745138297093","commenter_b":"Way to go Steve!! You put this guy on blast!!! Look out people.","commenter_a":"Busted !","post_message":"Consumer reporter Steve Noviello was invited to a demo for a safety and security window film, but things didn't quite go as planned... @webpagelink"},{"comment_id":"1273278439392985","commenter_b":"This is what the feminist want for women in America","commenter_a":"Very sad! But the good part is that she is a martyr and spends eternity with our God of pure Love!","post_message":"GRUESOME VIDEO: Muslim Mob Tears 27 Year Old Woman Apart Before Killing Her Over False Accusation Of Burning Quran  This horrific \"honor killing\" was caught on video and published by the New York Times. It took place in Afghanistan…These are NOT terrorists. They are just a mob of local Muslim men administering \"justice\" to a woman who was unjustly accused of burning a Quran. ***WARNING***Video is very graphic!"},{"comment_id":"1000336466699775","commenter_b":"Bitch Stfu quit preaching","commenter_a":"Kanye was her man at one point. I'm sure y'all have done stuff to please your significant other while in a relationship. GTFOH. Y'all clowning Amber for pleasing her man at the time?? Really???","post_message":"#ShotsFired Amber Rose Just Fired Back At Kanye West!"}]
