[{"comment_id":"10154373142406509","commenter_b":"It's bc she's white and rich.","commenter_a":"When you have money the law work for you and when you're poor it don't","post_message":"Tonya Couch, the mother of so-called \"affluenza\" teen Ethan Couch, had her bond lowered from $1 million to $75,000 at a hearing on Monday."},{"comment_id":"10154385390083132","commenter_b":"GORGEOUS","commenter_a":"@username kitchen","post_message":"We can't decide which we love moreBritney Spears' marble kitchen or her breathtaking view.  (via People Great Ideas)"},{"comment_id":"418283194962942","commenter_b":"They are all criminals, that why they call them Illegals.","commenter_a":"So you want to prioritize sending back students & children before the criminals. I see.","post_message":"This Texas judge is boldly standing up to the White House. Should more follow his lead?"},{"comment_id":"894715537301698","commenter_b":"The best thing you are doing, Mr. Trump, is weeding the un-Americans out from our society. You are already making the change for America being great.","commenter_a":"@username how was your preteen sexparty with you friend Epstein. It sound s you got a problem dude. Defloration of a 12 year old girl is not ok, if you know what I mean","post_message":"The \"protesters\" in California were thugs and criminals. Many are professionals. They should be dealt with strongly by law enforcement!"},{"comment_id":"987021391354390","commenter_b":"@username: Once again, you can argue all you want day in, day out. And guess what will happen? The ongoing trend. It get's worse and worse year after year. The debt keeps climbing, yet some have their blind folders on like they can't see this way of thinking, and the economy is constantly nose diving, we are constantly going further and further in debt. Another fact, we in the South are tired of pressing 1 to listen to English while we live in America. If Hillary had it her way before she goes to jail, the mid-west and North would be in the same situation after she let them flood in and gives them drivers license, you too would be having to Dial 1, every single time you want to hear English. Think it wouldn't bother you? Think again, you'll question whether you are really living in America. After-all these ...","commenter_a":"Raise Minimum Wages - Put Small Businesses Out of Business, Take Jobs from Americans. Allow immigrants to flood the country, give them drivers licenses, and take jobs from Americans. Oppose the pipeline, Take Americans jobs. Do away with energy companies, Take Americans jobs. \"Hello, I'm @username, the hypocrite, I promise Americans jobs!\"","post_message":"Time to invest in a clean energy future—not build a pipeline to carry our continent's dirtiest fuel across the US. I oppose Keystone XL. -H"},{"comment_id":"509555075871545","commenter_b":"We will never stop fighting for animals! <3","commenter_a":"OMG ! Enough already ! So very very sad...Cruelty to these animals is dead wrong wrong wrong. Aaron for putting this out there for all to see ! Thanks Keep showing everything you can. You are doing important work. This is your real work here on the planet '","post_message":"It takes the feathers of approximately 75 birds who go through THIS to make ONE down comforter.  It's 2016. There is no excuse for this."},{"comment_id":"10154741316933812","commenter_b":"Hillary will be president","commenter_a":"Remember when Hillary Clinton said the 50,000 emails she kept from the State Department (in violation of the Federal Records Act) were about yoga and her daughter's wedding? How many of the most recent set of 14,900 emails ordered made public by a federal court are about yoga or her daughter's wedding? I'm thinking zero. But hey: pertinent falsehoods under oath aren't criminal when you're aspiring to become the First Woman President (TM).","post_message":"Meet Meatball: The adorable, friendly and rotund pit bull mix that can't help but flash his brightest smile as soon as he sees a camera. \"As soon as the camera turns on he just gets this huge grin on his face.\""}]
