[{"comment_id":"10153511380259641","commenter_b":"I can't believe some of the comments here - So much hate {that's not justified} :/","commenter_a":"RIP the old England, lost to Islam now.","post_message":"#TBT:"},{"comment_id":"10153236448557042","commenter_b":"What's she trying to prove? Don't let her use her bank account or any money she has.","commenter_a":"And what about cheap clothes too , as well as cheap beauty products .","post_message":"OSCAR WINNER LIVES OFF FOOD STAMPS: Gwyneth Paltrow, often criticized for elitist comments she made in the past, is going on food stamps.   The actress will live off just $29 in groceries for a week to bring awareness to the difficulties of living under the program."},{"comment_id":"10154227931919087","commenter_b":"They can have the goof!","commenter_a":"Fake polls Hillary is up 5.6 pats in NH","post_message":"The most recent New Hampshire polls shows Donald J. Trump with a slim lead."},{"comment_id":"10153715291715950","commenter_b":"Sorry Sara Sterling you wouldn't know the NRA from a CPA. Guns were here before you and they'll be here long after you. They can pass all the unconstitutional laws they want the gun owners will not comply. If you don't like it well then your free to pack your sh*t and leave there isn't anybody forcing you to stay here. The earth is huge...","commenter_a":"CBS once again reaching with their BS agenda! Why don't you report how gun sales are at a record high? Obama is the best gun salesmen ever. If a government ever tells you to disarm yourself you need to arm yourself!","post_message":"This brother shares the story of his family's tragic trip to a gun range."},{"comment_id":"1049317721755905","commenter_b":"full retard mode: engaged","commenter_a":"This is the evidence of existence of Allah !!!","post_message":"Our brains are truly amazing.  By Emily's Quotes, via AsapSCIENCE."},{"comment_id":"10154061349648352","commenter_b":"Sick woman you are","commenter_a":"He is taking care of both of them and about to marry her so what. If it works for them who cares. And if your in the church every last prophet had more than one wife. Having only one wife is a western and new thing.","post_message":"‘I try not to get jealous’: Pastor, 60 marries his pregnant girlfriend, 19, with the blessing of his wife, 44, with both women to live in different wings of Ohio home"},{"comment_id":"10152993021545667","commenter_b":"The Donald brings women to be his wives to the USA so they'll marry him and make them legal citizens, did it twice","commenter_a":"Support Donald Trump.","post_message":"\"I cherish women,\" Trump told Hannity on Tuesday night."}]
