[{"comment_id":"766553903477790","commenter_b":"Obama will call it workplace problems.","commenter_a":"It's not ISIS committing these violent crimes it's the guns, we have to start a war against guns!!!!!","post_message":"Oh my God.....BREAKING NEWS. Share it folks. We need you."},{"comment_id":"1242328489179018","commenter_b":"Sick bitch. I hope she chokes to near death and has a fucking stroke. I don't hate people but this pos. needs to disappear for good.","commenter_a":"Wow, is everyone scared of killery ? Geeze really ? Oops, forgot about the Clinton Mafia and all the dead bodies in their wake. Maybe they have reason to be.","post_message":"After months of pressure, the mainstream media has finally begun asking questions about Hillary Clinton's health. Just as they do, however, Hillary and her people have made a SICK threat to all of them... and it could mean that the truth stays hidden from America."},{"comment_id":"10153609424211130","commenter_b":"Does she have penis yet?","commenter_a":"No one likes the murdering bitch... she is no friend of the LGBT and most us want her to go away.","post_message":"Caitlyn Jenner has a clever idea for how to beat Ricky Gervais at his own game."},{"comment_id":"1258599470822378","commenter_b":"Trump contributed millions to liberals and their policies and now says he wants to fix the mess that he funded. No thanks.","commenter_a":"i have decided its safer with cruz, he has a record, trump is all talk, there is no certainty how he would be as president.","post_message":"I think Trump going after Cruz is quite normal; it's understandable. But I think he's making a tactical error the way he's doing it. Whatever you want to say, Cruz is not a \"nasty\" guy. When you get into criticism, it better be believable."},{"comment_id":"10153227966933984","commenter_b":"The woman is a fukin crook","commenter_a":"I want a moral person leading our country!!","post_message":"Well, here's BIG news that will turn a lot of heads. Do you hope this marks the final chapter of the Clinton saga?"},{"comment_id":"10152814946648822","commenter_b":"Should have been three to six YEARS ! This woman is NUTS !","commenter_a":"I love the people on here, who claim to be about humane treatment of animals; but, they want this woman to get beat to death, while in jail. Hypocrites.","post_message":"The woman accused of stealing and euthanizing her neighbor's dog is headed to jail. Today she was sentenced to 3-6 months for killing the husky named \"Thor.\""},{"comment_id":"1146502822036413","commenter_b":"We can make the illegals pay taxes.","commenter_a":"He can just file bankruptcy when it's done being built.","post_message":"Constructing an impassable wall along the U.S.-Mexico border would be a tall order — even for master real estate developer and 2016 GOP presidential candidate Donald J. Trump."}]
