[{"comment_id":"1217472704997930","commenter_b":"WE MUST STOP CORRUPT CROOKED LYING KILLARY...If she gets into OUR White House she will appoint the nest Supreme Court Judge...GOD Forbid it be the MUSLIM POS OVOMIT. This will affect US, OUR CHILDREN and OUR GRAND CHILDREN for years to come. She will do her best to cost us OUR SECOND AMENDMENT RIGHTS, While keeping the Secret Service ARMED to protect HER SORRY ASS !!!! She will FLOOD OUR COUNTRY WITH SYRIANS, TERRORISTS, and ILLEGALS.... OUR Borders will NEVER BE CLOSED. AND all of this we will be FORCED TO PAY for with her PROMISED RISE IN TAXES on the MIDDLE CLASS. if that DOESN'T KILL US, we can always be BOMBED, BEHEADED, RAPED or MURDERED by ISIS....GET A CLUE, OPEN YOUR EYES, SEE HILLARY'S AMERICA , BUT THINK TWICE BEFORE YOU VOTE FOR THIS TRAITOROUS B*TCH !!!!!!....TRUMP 2016 !!!!!","commenter_a":"TOO many martinis & pills.","post_message":"Democrats are in full-on panic mode after reporters scooped a picture of Hillary Clinton literally UNABLE to stand. This is going to intensify speculation about her health BIG TIME.  Do you think that Hillary Clinton is fit to serve?"},{"comment_id":"755539251303319","commenter_b":"Send the bitch to jail and strip the bed sheets off of her","commenter_a":"Your in US lady you must obey the law... I'm sure when your in Muslim country your not even allowed to drive ....","post_message":"Burqa-Clad Woman Pulls Race Card On Cop, Gets Brutal Wakeup Call That's not how it works in America... Sorry. Do you think she got what she deserved?"},{"comment_id":"10153548896611323","commenter_b":"Ban all religion, ban all religious dress so all pupils wear the same uniform, then paint all children green ......... There you go, sorted.","commenter_a":"When a system (Teachers & Parents) is not focused on a child's future but instead going through the motions and meeting the targets with least amount of positive role models (especially in single parent families) you are not building future generations that think rationally where the brain itself arrives at a conclusion at a very young age that race is just a social construct, you are instead building a worker drone filled with prejudices and presumptions on top of entitlements that things are owed instead of earned.","post_message":"'Education should provide an inclusive curriculum that teaches the students respect for other cultures. If schools provided such an education, the climate that allows racist language and behaviour would cease to exist. Promoting such an education should be a priority for government, however in Britain we have a school system that has little interest in education.'"},{"comment_id":"604709916395876","commenter_b":"Is it all the bleach that makes Trump women stupid? They should do a study...","commenter_a":"This speech is ridiculous he's supposed to be a leader he's dividing people thinking he has power I'm embarrassed to say he thinks he represents all of us","post_message":"'We are going to be the first state in the country to fight back on Washington.' Boston Mayor Marty Walsh gave impassioned remarks at the rally ahead of the Boston Women's March for America.  @webpagelink"},{"comment_id":"10152872139971130","commenter_b":"Says the bitch who makes more than most men... Lmao","commenter_a":"Says the woman who makes a million dollars a movie for acting while the teacher at her kids school makes 50k or less a year! #equalpay","post_message":"PREACH, Patricia Arquette!"},{"comment_id":"914457525280663","commenter_b":"she put it there herself those i sue you i sue you money on those lazy people.","commenter_a":"So granny doesn't love metal sausage.Why?","post_message":"Definitely not lovin' it"},{"comment_id":"784349154999752","commenter_b":"Bitch","commenter_a":"Another racist liberal what does she have against Orange people. Ray","post_message":"Oh, Meryl...."}]
