[{"comment_id":"10154091586819160","commenter_b":"@username @webpagelink","commenter_a":"lets see BLM carry guns and shoot police and beat up on whites. Burn our flag and want to separarte from the union. These guy protested without hurting anyone and had our american flag with them. even the policeman felt safe with them around. BIG DIFFERENCE.","post_message":"Despite carrying assault rifles, the group says it didn't mean to \"start any problems.\""},{"comment_id":"1042921652395512","commenter_b":"Clams don't eat salt. That's its foot anyway.","commenter_a":"Now who wants to lick salt off a clam","post_message":"It's easy to forget that shellfish are animals ... until you see something like this."},{"comment_id":"1007373832677433","commenter_b":"Ronni: I wasn't sure if he was calling me a simpleton Repub dink or Palin? The sarcasm in my comment is fairly obvious, is it not? Like I would agree with that rabid bat shit crazy ass woman?","commenter_a":"Goodie bags filled with teddy bears and soccer balls would certainly entice me to leave my country for another.","post_message":"\"Knowing that Trump won on [immigration], it should empower you to go ahead and ask the candidates, 'What the heck are you thinking, candidates? What are you thinking when you're going ahead and actually asking for more immigrants, illegal immigrants, welcoming them in, even inducing and seducing immigrants with gift baskets of teddy bears and soccer balls?' \" Sarah Palin said."},{"comment_id":"1401830939879019","commenter_b":"If you are in the U.S illegal,then you should be deported period,there is some circumstances involved in illegals","commenter_a":"Amen brother!","post_message":"Black Trump Supporter Just Exposed SICK Thing He Saw Muslims Doing In His TownHas BRUTAL Message For Liberals Share if you agree they will NEVER Assimilate"},{"comment_id":"1062925700414568","commenter_b":"ruthless assholes w/$$ that want more $$ and have far right wing values!","commenter_a":"What idiot thought privatizing prisons was a good idea? Whoever it was... That's where they belong!","post_message":"Next time someone says we're a free country, have them read this."},{"comment_id":"1563946600332130","commenter_b":"she says she all for kids but she can not hide the truth","commenter_a":"If a woman walks around spewing F!#K the way she does you damn sure don't want her to be president, hell I don't even want her as a friend","post_message":"This is the REAL Hillary Clinton, folks!"},{"comment_id":"1046875855332998","commenter_b":"Scary!!!","commenter_a":"correct your self b4 you talk about Mr President Obama tramp....","post_message":"Since I am self-funding my campaign, I don’t have to worry about being politically correct! President Obama has fought ISIS in a politically correct manner and look where it has gotten us! If we don’t talk about and address our country’s issues - we will never solve them!"}]
