[{"comment_id":"954050234691229","commenter_b":"The N-word isn't flying over the state capital, Dumb Dennis! And you don't even know the majority of blacks.","commenter_a":"Cops didn't shoot her down. We're making progress.","post_message":"An activist in South Carolina has taken down the confederate flag at the State Capitol"},{"comment_id":"1323629084344227","commenter_b":"and pretty much any woman could be a better president than Hillary.","commenter_a":"Not only can a woman be president but Hillary can be a better president than most men in fact the only MAN that can be a better president than her IS Bernie","post_message":"Stay classy, Bernie fans!"},{"comment_id":"1107115119405265","commenter_b":"I've heard more sense coming from a crack head","commenter_a":"Can't these people realize somebody is going to have to pay for \"free school\"?","post_message":"ClashDaily.com"},{"comment_id":"10153091950239205","commenter_b":"IF YOU'RE ILLEGAL ALIENS IN AMERICA, THEN YOU HAVE NO BUSINESS HERE, JUST LIKE MEXICO TREATS AMERICANS! PEOPLE WHO WANT TO COME HERE LEGALLY ARE WELCOMED.","commenter_a":"The mexican solution (Donald Hitler )","post_message":"Donald J. Trump's detailed and foolish immigration plan explained."},{"comment_id":"10153661567171336","commenter_b":"This thug lady needs whatever the cops want to do to handle thugs","commenter_a":"So breaking the law is okay, right @username?","post_message":""},{"comment_id":"1200378003330990","commenter_b":"@username then why girl dont get a comfortable bra? DICKHEAD?","commenter_a":"well what if show my boner because wearing underwear is a bit uncomfortable","post_message":"These high school students brilliantly stood up against sexist dress codes."},{"comment_id":"10156995809880354","commenter_b":"Someone needs to tell that ugly old bitch to put some fucking clothes on.","commenter_a":"I have respect for this woman. She isn't funny and she is without class.","post_message":"Chelsea Handler's thirst for attention is seemingly unquenchable..."}]
