[{"comment_id":"1013753742085664","commenter_b":"'@username Babies suck!","commenter_a":"I used to dislike Clinton... I was uninformed and knew little about her other than what the right wanted me to believe. After some research and learning about all of her work on behalf of minorities, working families, women, and children over the course of her life and seeing her deal with adversity and downright deplorable behavior with strength, class, and grace, I am PROUD to give her my vote and my full support. I'll be voting Democrat down the ballot to ensure not only that she is elected, but that she has a Congress she can work with - not one hell-bent on obstruction. There is a reason she polls so much higher with EDUCATED people. #imwithher","post_message":"For 45 seconds, a drenched Hillary Clinton abandoned her script and let down her guard in Florida: @webpagelink"},{"comment_id":"10154174806427293","commenter_b":"Girl...you need some self respect letting yourself get played like that How much are you getting paid.You ARE getting paid right?","commenter_a":"Basically she saying HE'S CLUELESS","post_message":"Donald J. Trump's campaign manager was pushed today on 'Morning Joe' to explain some of his recent comments."},{"comment_id":"10153120906398205","commenter_b":"95percent of the illegal immigrants are hard workers.... So much so that many citizens feel threatened will take their jobs.....i would never be scared if an illegal taking my job......","commenter_a":"Thus is what you spend your time on. Your dedication should be the American people I think your priorities are screwed up. As a congressman you work for the citizens of this country.","post_message":"Central Florida - I'm coming to talk about how to get ready for DACA and DAPA!"},{"comment_id":"1196725563700232","commenter_b":"You left out the part where Trump plans on cutting taxes on the most wealthy as well., Then there are Trump plans for how trade with China and Mexico is going to be handled, yet even now all the products that bear Trumps name are being manufactured in China and Mexico. Perhaps to show he is working in good faith, don't you think he should have them manufactured here in the US? It is quite simple to say I'm going to do this I'm going to do that but it is far more difficult to actually do them. He might say it, if elected he might try and do it but I guarantee you he is not going to 'make' the Mexicans pay for his wall, a wall that will actually do little to stop the flow of illegals. The gun he will hold to the Mexicans head to make ...","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, preserve the sanctity of the unborn life, preserve the sanctity of the 2nd amendment ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness","post_message":"Take a look at the companies that are partnering with this pro-amnesty open-borders group!   @webpagelink"},{"comment_id":"1208640665842055","commenter_b":"#NEVER HELLARY CLINTON !","commenter_a":"Be careful. People who cross the Clintons have a strange way of 'committing suicide' by a few 'self inflicted gunshot wounds' to the back of their heads.","post_message":"CROOKED HILLARY really SCARED  @webpagelink"},{"comment_id":"400393906751871","commenter_b":"Thank you. You pieces of uselessness. You screwed the Americans who voted your asses in but you will come up for re election. We Americans will not vote you back. You just handed America over to the democrats for life now that the illegals will have the paper work to slant the elections. Morons","commenter_a":"McConnell and Boehner are both hipocrits ~ they are not for the people and are not for the GOP Obama has them in his back pocket!","post_message":"Did Mitch McConnell just cave to the Democrats' demands?"},{"comment_id":"10154109773821491","commenter_b":"I watched the video. And I know horrible treatment of animals in factory type production of food. I know a guy right after high school that had a job for one day catching two chickens at a time and melting their beaks with a hot iron. That was done so they wouldn't peck at each other. But that's not what the post is about.","commenter_a":"One egg yolk has 62% of your daily allowance of cholesterol. One strip of bacon has 3% of your daily allowance of cholesterol.","post_message":"Eat those yolks, folks."}]
