[{"comment_id":"10154866849395329","commenter_b":"Becky with the good hair have a stadium full of seats please","commenter_a":"*21 things no one asked for. There, fixed it. *waits for angry Trump supporters to start complaining in the comments*","post_message":"We asked Donald J. Trump supporters to write down a misconception about them and here's what happened."},{"comment_id":"10153185044695950","commenter_b":"And without reading anything, you're a jealous dumb girl who don't know kids are kids.","commenter_a":"Yeah except when you read his school behavior record you realize he's a little shit.","post_message":"Ahmed Mohamed attended Astronomy Night at the White House last night, where he met scientific stars, astronauts and President Obama. During his visit, he had a chance to chat with the president, passing along a valuable lesson: '...You shouldn't judge a person by what they look like. You should always judge a person by their heart.'"},{"comment_id":"10153836657664714","commenter_b":"Sorry!!!!","commenter_a":"'@username ...","post_message":"Pizza, chocolate and french fries all make the top 10."},{"comment_id":"635288009979398","commenter_b":"How silly. Some people will sign anything.","commenter_a":"idiot","post_message":"An online petition to remove all air conditioning from Department of State property has gotten more than 1,800 signatures since it was posted online Sunday."},{"comment_id":"784296501703530","commenter_b":"Gross! It smells like Hitler up in this bitch.","commenter_a":"Isn't this another thing he can be impeached for?","post_message":"BREAKING NEWS...."},{"comment_id":"965413580245506","commenter_b":"Keep trying @username. Killery the lying hag will fall short.","commenter_a":"PT Barnum is running for president!!","post_message":"Donald J. Trump tried to remember #DDay with a photo that wasn't from D-Day."},{"comment_id":"385075118347449","commenter_b":"She's not worth two cents the skank","commenter_a":"How about we take oboma's pay to pay for this.","post_message":"This is CRAZY..."}]
