[{"comment_id":"10153050855917452","commenter_b":"Sound like she listening to Future lol","commenter_a":"Lmao wtf","post_message":"A suspected car thief got out of the vehicle and started dancing in the middle of the street after leading police in a wild chase through downtown Los Angeles. @webpagelink"},{"comment_id":"1119713804747813","commenter_b":"No-chin bitch.","commenter_a":"I'm changing my first name.","post_message":"Image from Go After the Bad Guys"},{"comment_id":"10153615881104199","commenter_b":"Crazy lady!","commenter_a":"White trash at its finest","post_message":" knew what was going to happen. I wanted it on tape. Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off road first time. She got behind me a second time and then went to go around again. I let her have the road, called 911, reported her and her plate number I started phone video which was in a holder on dashboard hands free"},{"comment_id":"10153309125991491","commenter_b":"Kerr, it's not the good guns with guns in the US. It's the BAD ones.","commenter_a":"He is 100% right. The attackers would've been shot down where possible. Edited for grammar.","post_message":"\"It would have been a much, much different situation.\" - Donald J. Trump"},{"comment_id":"890231291031876","commenter_b":"Why would you slap immigrants in the face by rewarding those that broke the law?","commenter_a":"There are a lot of academic papers (i.e. data by experts and not angry, ignorant people on Facebook) that shows that 1) undocumented residents have a MUCH smaller drain on tax dollars relative to what they contribute than what the media hypes up (generating fear is a lot faster/easier/profitable than actually knowing the facts), 2) that immigrants rank high on civic service, 3) that immigrants rank high on starting new businesses ventures, 4) that the U.S. Immigrantion system shows indicators of being purposefully designed to have an undocumented work force for which the govt. can reap benefits without paying the full bundle of rights, etc.","post_message":"We must sign comprehensive immigration reform into law to bring over 11 million undocumented workers out of the shadows. We cannot continue to run an economy where millions are made so vulnerable because of their undocumented status. @webpagelink"},{"comment_id":"10154047243421990","commenter_b":"Your moms desperate.","commenter_a":"Out of all California, he gets a \"band\" from Hilmar, CA. I'm sure the musicians are talented but...LMAO!","post_message":"Who will be marching in Donald J. Trump's inaugural parade? Here's your answer: @webpagelink"},{"comment_id":"620543131446096","commenter_b":"She's a LIAR!!!!!","commenter_a":"So, she's going to declare bankruptcy and drop out of the presidential race???","post_message":"Wow. I don't think she thought this one through... Do you think a Hillary Clinton presidency would be terrible for America?"}]
