[{"comment_id":"790486571080388","commenter_b":"Shut up!","commenter_a":"BUSH IS A JUVENILE WHO WORKS FOR THE BUSHES----NO MORE BUSHES---2 tooooooooooo many---TAKE YOUR MILLIONS AND FALSE POLICIES ELSEWHERE-----We do not want another IRAQ!!! and then be left hanging out to dry like your brother did-----VOTING TRUMP ---","post_message":"Question from Cameron, a 5th grader in New Hampshire: What are the top 3 things you want to accomplish in your first term?  Watch to hear my answer:"},{"comment_id":"939707739399900","commenter_b":"It used to be fairly common to have a cross on the flag pole representing the same thing as Christ above all.","commenter_a":"I am a Christian but, no flags are to be flown over the flag of the United States. I DO feel his frustration but, this is a no-no. God Bless America !","post_message":"Are you OK with this?"},{"comment_id":"1354339577942641","commenter_b":"Education, do u have?","commenter_a":"I f*****g hate Islam.","post_message":"Behold the peaceful religion..."},{"comment_id":"390976721026923","commenter_b":"She needs a new Do!!! Lol","commenter_a":"Yep holder in a skirt","post_message":"What do you think of the White House nominee for Attorney General?"},{"comment_id":"10152739568860779","commenter_b":"Get off Kobain's dick, retard committed suicide.","commenter_a":"Jody Bombay VanderZouwen buy me this !!","post_message":"Kurt Cobain appears on the cover of our latest issue, on newsstands today. In a 1994 feature, David Fricke looks back at the Nirvana frontman's music and legacy. \"As a man of riffs and letters, Cobain was a sly dog who rarely stooped to the obvious…nothing in Cobain's music was ever quite what it initially seemed; his best-known song was named after a deodorant,\" Fricke wrote."},{"comment_id":"10153163783266135","commenter_b":"When the death penalty came up, the idea was to deter people from killing. This is why I wrote, death penalty for killers. Killers should know that gas chamber is their end. But when the law starts making up excuses for their actions, every law goes out the window. Illegals guns hit the streets because its about money. When someone chooses to be stupid, is not about money, the culprit list will be long, and everybody should be hold accountable. So, should we shot everybody and ask later? There are some people who are paying the consequences for not thinking ahead, trying to uphold the laws in their hands, like some kind of hero. What exactly is a THUG? and what exactly is a GOOD person?","commenter_a":"Screw the 2nd ammendment, this clowns can not handle this right. Killer, death penalty right away!!!","post_message":"#BREAKING One person killed in shooting at Taylor Sportsplex, according to Taylor Police Chief."},{"comment_id":"969371743179604","commenter_b":"Too bad Donald Trump is here to stay he's going to be the president and beware lady he's going to build a wall and you're probably one of the ones that he's going to be sending back to Mexico because you're probably illegal","commenter_a":"Bought and paid for I might add!!!","post_message":"Protestors in Mexico, I mean California, are saying Trump doesn belong in the United States. What do you think? @webpagelink"}]
