[{"comment_id":"10156089078040354","commenter_b":"Put The Woman In Jail!","commenter_a":"THROW - HER - IN - JAIL - NOW! What the hell are they waiting for? Drag her ass to jail in handcuffs wearing a sign around her neck that says, \"ALL YOU OTHER CRIMINAL POLITICIANS AND BUREAUCRATS ARE NEXT! NO ONE IS ABOVE THE LAW.\"","post_message":"***BREAKING***"},{"comment_id":"10153398381514364","commenter_b":"Social security is the world's biggest pyramid scheme. It will eventually crumble, and I have no doubt it will do so in my lifetime.","commenter_a":"I'd love to have my social security tax, 6.2% of my income, go into my 401k or Roth. I don't need the government to help me save for retirement.","post_message":"They aren’t being straight with the American people, and they know that."},{"comment_id":"1062536000443119","commenter_b":"White girls can't even right now.","commenter_a":"I went in to the Starbucks on Bay Area blvd across from baybrook mall,ready to buy coffee and a sandwich. They insisted on giving me everything \" on the house\" ! They were so kind and respectful to their customers. There was an outpouring of kindness from all who were in the store. The tip jar was full of large tips! They locked the doors right after I made my \"purchase\", but never once rushed me out of the door. This place is a class act!","post_message":"A computer outage is disrupting Starbucks sales in the U.S. and Canada, and its impacting a lot of people right here in Houston. KPRC2 Anoushah Rasta is following this story on #KPRC2 News at 10 p.m.  MORE ---> @webpagelink"},{"comment_id":"10153987601378908","commenter_b":"And another commenter who didn't read the article.","commenter_a":"And this is the article that should prove to all of you that collective evolution spreads bullshit ... Yellowstone has a big herd over 4000 bison .... And they are to slaughter 4-600 of them to prevent spread of disease !!!!!","post_message":"Park rangers have begun capturing wild bison in the Stephens Creek trap within Yellowstone National Park. Since Feb. 20, approximately 150 of America last wild buffalo have been trapped. According to park officials, all are destined for slaughter."},{"comment_id":"1130006897113975","commenter_b":"Get out of America then","commenter_a":"It is a sad day in America. One of the most disgusting men in in our country won the election. I am so sickened by the citizens who would cast their vote for such an evil man. Do they really feel he is person to speak for us as a nation. I find him so repulsive by his words and actions.","post_message":"THESE 23 HOLLYWOOD IDIOTS PROMISED TO MOVE IF TRUMP WINS..... LET'S HOLD THEM TO IT"},{"comment_id":"2066498740242294","commenter_b":"Keep appeasing the beast that wants to devour you.","commenter_a":"i am a Roman Catholic and am continually amazed at what this pope utters. God forbid the Vatican is ever targeted.","post_message":"The pope claimed every religion has its \"little group of fundamentalists.\""},{"comment_id":"420321631489464","commenter_b":"how about someone do a drive by on these losers, it would do the world a great deed.","commenter_a":"Non existent","post_message":"Can you Imagine the Media Coverage if These Guys Were White?"}]
