[{"comment_id":"10153526411091350","commenter_b":"I don't eat in private, why should my kid have to? Most women who choose to bf in public are so good at it, you don't even notice, so don't wore about averting your eyes. When I'm at target I'm busy shopping not looking for a nip slip.","commenter_a":"I completely support breastfeeding mothers but would prefer not to see it happening while shopping. Target should be providing private respectable areas for this if they really supported breastfeeding moms.","post_message":"policy supports breastfeeding in any area of our stores, including our fitting rooms, even if others are waiting. See why moms are swooning over the retailer breastfeeding policy."},{"comment_id":"400393906751871","commenter_b":"Thank you. You pieces of uselessness. You screwed the Americans who voted your asses in but you will come up for re election. We Americans will not vote you back. You just handed America over to the democrats for life now that the illegals will have the paper work to slant the elections. Morons","commenter_a":"McConnell and Boehner are both hipocrits ~ they are not for the people and are not for the GOP Obama has them in his back pocket!","post_message":"Did Mitch McConnell just cave to the Democrats' demands?"},{"comment_id":"10153942138341770","commenter_b":"She is disgusting!!","commenter_a":"Now we don't have to look at her on the Voice with that nasty tongue, hope she's packed","post_message":"Don't let the door hit you on the way out!"},{"comment_id":"447635222089017","commenter_b":"You are probably pro abortion cause you hate child support...","commenter_a":"This is great. You idiots that are against abortion are just that Idiots. Quite trying to take rights from Women . Plus Planned Parenthood doesn't pay for abortions. The client does. They provide health care. Get your facts right.","post_message":"JUST IN: A Houston grand jury investigating undercover footage of Planned Parenthood found no wrongdoing by the abortion provider but instead indicted anti-abortion activists involved in making the videos that provoked outrage among Republican leaders nationwide."},{"comment_id":"10153978069921178","commenter_b":"Rosa, that is not your place to say","commenter_a":"andyou need to get out of the United States","post_message":"Michael Moore goes off the rails (more than usual) in bizarre interview."},{"comment_id":"10154179753088645","commenter_b":"Girl bye!!!","commenter_a":"She should be offended, he was trying to hook up with another woman while she was pregnant with his kid and during his apology he never said sorry to his wife.","post_message":"does not represent the man that I know, she added."},{"comment_id":"1260466927330937","commenter_b":"'@username agreed! She's a fecking CRIMINAL... PERIOD!","commenter_a":"Watergate would be jaywalking compared to the Clinton scandals","post_message":"Rudy Giuliani claims the Clinton Foundation scandal will be 'bigger than Watergate.' Do you think there is truth to what he is saying?"}]
