[{"comment_id":"10153556232516162","commenter_b":"Wtf","commenter_a":"Merdith V Marin","post_message":"WHAT THE HAY? Caught on video by undercover cops, Michael Crawford told investigators that for 35 years he's been traveling the country having sex with horses... @webpagelink"},{"comment_id":"10153086762191438","commenter_b":"Besides there no such thing as a attractive Democrat woman!","commenter_a":"Boils down to primal fear in Liberals, Hillary is toast and Warren is way to Marxist except for the hard Left....and Liberalism doesn't sale to Americans....Cruz has a great message and the Left knows it...see the exact same responses on other Leftists sites...you can smell the wet panties and fear....","post_message":"Ted Cruz has no chance of becoming president."},{"comment_id":"1150014275011477","commenter_b":"Will miss this talented actor....such a great sense of humor intertwined in his roles as \"the villain\".","commenter_a":"Quigley Down Under with Tom Selleck","post_message":"JUST IN: British actor Alan Rickman, known for roles in Robin Hood, Harry Potter, Die Hard, more, passes away at 69: @webpagelink"},{"comment_id":"10153009927864586","commenter_b":"Let someone stand on that bitch's head!","commenter_a":"I still cant get over the idea that an organization that euthanized dogs and cats and put them in dumpsters is denouncing anything to do with being cruel to animals. Google the pics... PETA EUTHANIZED ANIMALS","post_message":"ICYMI: Sarah Palin posted a picture of her son STANDING on the family dog & thinks it's totally okay: @webpagelink The most important thing we can teach our children IS COMPASSION. SHARE if you agree!"},{"comment_id":"1001474073269501","commenter_b":"Muslims consist of .9% of our population. Bigotry around 20%","commenter_a":"I disapprove! He has caused nothing but destruction! The flooding of illegals and Muslims! They are murdering innocent Americans! Obama just sits back and enjoys the show. He lies about his crimes like Hillary does. I'll enjoy the show when Trump is president and arrests your ass!","post_message":"Do you approve or disapprove of the job President Obama is doing in office?"},{"comment_id":"10153071798041051","commenter_b":"What a bitch","commenter_a":"Stupid! !","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"959266487466433","commenter_b":"O girls have brains too?","commenter_a":"Only frustrated sick person can prefer physical fearure otherwise normal and true men appreciate beauty with brain","post_message":"Men care more about a woman’s brains than her bust, allegedly"}]
