[{"comment_id":"869610479765368","commenter_b":"Oh it's only Muslims who r care free! Grow up what about non Muslims that r care free with the poor starving away! Do u know Muslims give the most charity! Stop being typical media followers, lead ur own minds","commenter_a":"I love how caring these Muslims are, while the rest of their people starve to death and kill each other, they are living in the lap of luxury","post_message":"'Our lives aren't like Homeland or Argo!'"},{"comment_id":"1215546011816966","commenter_b":"This is still AMERICA. MOST OF US STILL. BELIEVE AND HAVE LET OUR CONSTITUTION , BILL OF RIGHTS AND AMENDMENTS. WORKING IN THIS COUNTRY. YOU DONT LIKE THOSE LAWS OF OUR LAND. YOU ARE NOT A TRUE AMERICAN. SO YOU HAVE NO SAY. BECAUSE YOU HAVE NOT PASSED THE LAWS OF IMMIGRATION TO BE A CITIZEN OF THIS UNITED STATES OF AMERICA. AND JUST BECAUSE YOU ARE BORN HERE DOES NOT. GIVE YOU THE RIGHT. TO UNDO OUR LAWS. IT IS BREAKING THOSE LAWS TO DO SO","commenter_a":"Bimbo has been drinking the koolaid","post_message":"This is ABSURD."},{"comment_id":"482004281990152","commenter_b":"Muslims are breaking our laws. Take down the sign and let muslims know that we have our own laws and as Americans we do not recognize sharia law.","commenter_a":"Shoot them all..","post_message":"First our schools, then our public areas, what's next? 'SHARE' this post, we have to let the nation know what the MSM won't. Do you agree Shariah must be stopped?"},{"comment_id":"928696510523431","commenter_b":"She should think about buying a woman's breasts.","commenter_a":"This girl can actually sing. Not sure why she does these things. Pointless, & invalidates her as an artist.","post_message":"Miley Cyrus shares naked tub pic"},{"comment_id":"1811712189111334","commenter_b":"She is a poor excuse for a women","commenter_a":"News-Flash! When you're talking about liberals, \"best\" is a relative term!","post_message":"THIS is the best the Left can do?!"},{"comment_id":"10153567569125927","commenter_b":"The history of Islam counters everything he says about it. No surprise as he must have flunked history.","commenter_a":"pathological liar","post_message":"\"A perversion of Islam that has taken root ... that is appealing to even folks who don't necessarily know anything about Islam, and aren't even practicing Islam in any serious way ...\""},{"comment_id":"1891157881114099","commenter_b":"that's something you would need to record lol","commenter_a":"@username this would be something you would do lol","post_message":"Now that's a f.d up prank. #WSHH"}]
