[{"comment_id":"10154030120894877","commenter_b":"waaaaaa look at us! we are terrible parents! we make bad decisions and get back men killed with our ignorance! yayyyyy! black men, you are lucky to escape the wombs of these criminal producing welfare brood mares!","commenter_a":"Very nice to see Americans giving these women love and support. Their bravery and commitment to honor their sons is wonderful to see.","post_message":"‘Mothers of the Movement’ deliver staggering testimony of loss, hope at DNC Grio fam, what did you think of their appearance? Watch the full clip and share your thoughts below."},{"comment_id":"1266472966743179","commenter_b":"But why are their boobs exploding tho?","commenter_a":"Amen","post_message":""},{"comment_id":"472497066265507","commenter_b":"I believe she had a choice before the seed got mixed. so don't start the problem in the middle start at the beginning...","commenter_a":"AMEN","post_message":"Every woman is entitled to control over her own body."},{"comment_id":"566112886870821","commenter_b":"another one to kiss that ring and feet","commenter_a":"if donald trump is a racist why to people of many different races show up to his rallies? why aren't they kicked out? He hasn't singled out any one particular ethnic group that he has singled out by saying he hates them.","post_message":"Welp, Donald Trump sure has that racist vote down pat. -Conover"},{"comment_id":"10153805458826337","commenter_b":"Is that chick is his girl?","commenter_a":"Vanessa Delgado where was this ride when we went damn man that looks cool","post_message":"Watch DeStorm Power escape Call of Duty's Black Ops 3 Shadows Of Evil Ride at Six Flags!"},{"comment_id":"10152790927666051","commenter_b":"Sport illustrated is worse, these are woman with their babies, that's all. No big deal.","commenter_a":"Kai","post_message":"This woman was very surprised when her photos were removed. She didn’t think they were inappropriate at all. Decide for yourselves whether they should’ve been taken down."},{"comment_id":"954958944620884","commenter_b":"all fuckin jerks,","commenter_a":"WORD","post_message":"ClashDaily.com"}]
