[{"comment_id":"10153908275696545","commenter_b":"@username the problem with the wall is it can be breached and take years to build, and will still have to be guarded. How about we just beef up border patrol and guard our country the way it was intended? If you research you will find that there are miles of tunnels already that bypass above ground entry. Although we have National guard at the borders they have no jurisdiction to stop anyone from entry and can only alert border patrol. If border patrol is busy elsewhere then the illegal immigrants are not stopped. These are the issues that need to be addressed building a wall is useless as we will still have the same problem not enough manpower to protect it.","commenter_a":" the \"wall\" is the most ridiculous idea to come out of a politician yet. Good luck getting Mexico to pay. How about you use common sense and get congress to give up funds for proper border patrol?","post_message":"If Donald Trump is softening his stance on undocumented immigrants, he didn't mention it to several thousand supporters at the Travis County Expo on Tuesday night. “We are going to build the wall,” Trump said to cheers. “And who’s going to pay for the wall? Mexico!”"},{"comment_id":"10152919448276636","commenter_b":"May I remind people of this classic. I used to watch it at my Granny's house every Saturday. @webpagelink","commenter_a":"Racism is an intentional act. This is not racism. Just because it sounds the same does not make it a slur on Pakistani's in any way shape or form. It's a different spelling with a different meaning entirely. whomever started this nonsense needs to be kicked in the butt for trying to stir up trouble.","post_message":"The WHAT are out of containment?"},{"comment_id":"1563613390592441","commenter_b":"fucking bitch","commenter_a":"Let the parents kick the bitch with steel toe shoes in the head","post_message":"This woman should be in jail!"},{"comment_id":"1145471028827087","commenter_b":"Joy yes the Bible said far be it from the true God to act wickedly! Death is the last enemy, the pain we feel when a love one dies is beyond words indeed God don't cause wickedness n bad things to happen but he \"ALLOWS\" I lost my son who I love dearly and reading and focusing on JOB experience help me to keep my sanity! THANKS BE TO GOD.","commenter_a":"You would not believe how many people said \"everything happens for a reason\" or \"this was God's plan\" when my son was stillborn. It made me so angry, still does. There is no reason, the autopsy proved that.","post_message":"In case you missed it: Sometimes saying \"Everything happens for a reason\" can hurt the folks we mean to help."},{"comment_id":"1502446079775417","commenter_b":"Hillary is doing so badly she has to stir up whatever she can. Notice at all of her rally's or speeches instead of substance,all she does is pick on Trump. Guess that and lying are her specialities, along with hating half the country.","commenter_a":"Go Trump Say NO to Hillary And YES to Trump Save America from WW3 so go out and vote for Mr Trump When I as a Muslim wants him to be come a president so what is wrong with you Go out and make history vote for trump Thanks Don't listen to the media they are one sided","post_message":"It's possible that Donald J. Trump will try to backtrack today. But here's why he can't."},{"comment_id":"482704838584476","commenter_b":"Yea just can't fix stupid... While Obama tries to shove his deal down Americas throat - Iran is laughing at us, buying weapons and building bombs - Better war with them today than tomorrow - Iran has no purpose, no value - Just make it a dust bowl.","commenter_a":"Nuke China & Iran!","post_message":"So, please Obama explain us, how this deal prevent war?"},{"comment_id":"10154071992886770","commenter_b":"Clinton, Bushes, Obama took away citizen's rights. They betrayed our nation. The USA was hated while they were in office. We are better off turning our backs on these traitors and marching forward in the right direction.","commenter_a":"Thank you, you have more class than some of the others.","post_message":"Both Bushes, Jimmy Carter and Bill Clinton all attended Barack Obama's inauguration in 2009."}]
