[{"comment_id":"1023152674374447","commenter_b":"This woman is nuts","commenter_a":"She's dumber than a rock.","post_message":"We asked the DNC Chair if her children were human before they were born. She gave a shocking answer..."},{"comment_id":"10152709650356051","commenter_b":"Daila Gonzalez, if you are here illegally, it's time for you to leave!","commenter_a":"We should spend more money on our mentally ill americans then we do illegals.. It is such a shame they get so much while we neglect our own...","post_message":"Police saw that a man at IHOP couldn’t pay his tab, so they decided to pay for him. A few hours later, they made a grisly discovery in his apartment"},{"comment_id":"10153428772146509","commenter_b":"Cause she was worthless and weak that's why!!","commenter_a":"Why would you choose the classroom to do that?","post_message":"There was no indication of foul play, and every indication that she took her own life, officials said. @webpagelink"},{"comment_id":"520938298031470","commenter_b":"This woman isn't on benefits","commenter_a":"It does make you think!!! As I pay out per week for my sons bass guitar lesson, each Saturday for my daughter to spend the day at the stables....school trips etc. ....and still moan about having no money, whilst running two cars and paying for three seats at Bath rugby...plus drinks!! This has put my 'poverty' into a proper perspective...and changed my opinion of ALL people on benefits being the same. Good luck to her and her family.","post_message":"Kathleen Kerridge’s family food budget is £40 per week – to feed five people. She says there is a big gap between the public perception of poverty and what it means for people like her. We should stop talking about poverty, she argues, until we know what being poor in this country really means."},{"comment_id":"10153103195541491","commenter_b":"Clearly a publicity stunt again, the shark is obviously a mate of his","commenter_a":"fake shark..","post_message":"Mick Fanning had another close encounter with a shark."},{"comment_id":"893334250795530","commenter_b":"'@username shut your dumbass up. She doesn't need to be in a nasty bathroom cause ur perverted ass can't keep walking and mind ur business. I'm sure you don't mind girls shaking their tits for u just not this baby doing what they were actually made for. Take your ignorant ass on.","commenter_a":"Do it in the bathroom where u have your privacy. Not in the cafe lady...and why are you filming it? Cause you want attention? Or go to the women's section and do it there. You knew you were going to Target, why didn't you bring some bottles with you?","post_message":"This stranger started harassing a woman because she was breastfeeding at Target  but customers and staff defended in the most beautiful way.  #MicBrights"},{"comment_id":"1306972999355460","commenter_b":"If they come after our guns we are so screwed...This is something we better not let them do...If ever we need to fight it will be when they do come for our guns....Wake up american's...That Muslim snake in the white house is out to get us and it looks like he will stop at nothing to destroy us and our country...","commenter_a":"Yes it will!","post_message":"“An armed citizen is nothing for me to worry about”"}]
