[{"comment_id":"10154736947540575","commenter_b":"Ignorant bitch. You voted hate. You liberal clowns","commenter_a":"Were was Meryl Stereo about the man that was attached and tortured. Oh yes, he was White.","post_message":"BOOM! Kellyanne Conway Schools Elitist Meryl Streep... ---VIDEO"},{"comment_id":"10155220975479218","commenter_b":"@username tell that to a nun","commenter_a":"You wouldn't need to be pro choice or pro life if people were just responsible when it comes to their sex lives. Both men and women, responsibility!","post_message":"Thousands of people demonstrated in the annual March For Life, marching from the Washington Monument to the Supreme Court, advocating the right to life >> @webpagelink"},{"comment_id":"10152746929711167","commenter_b":"Name a lie, Grace? You've apparently chosen to forget the lie about \"sharia no-go zones in France!!!!\" that Fox had to retract. Of course you forgot it--you wipe your brain before turning on Fox News, don't you?","commenter_a":"You've got to love the weasel attempt by the corporate media to create a special category of \"non-journalism journalism\" for Fox News and Bill O'Reilly, whereby they get to brag about being \"Fair and Balanced No-Spin Zone\" news reporters and join the White House press corps, but get a free pass to lie to their audience.","post_message":"Normally, you can't get this many Americans to agree what color the sky is."},{"comment_id":"10153359756455399","commenter_b":"It's about time people started calling isreal what it is, a terrorist nation","commenter_a":"So let me get this straight, those same neocons that lied us into the Iraq war,and told us that we'd be treated as liberators dislike Obama's Iran nuclear deal? Go f##k yourselves!!!","post_message":"Netanyahu agrees."},{"comment_id":"10152893024866051","commenter_b":"Yeah ? How bout someone take a cane to your goofy ass an lets see if it looks like paint..Oh no...lets not.... forgot your ass looks like a map from rand mcnally with all those ugly stretch marks....yuck","commenter_a":"That looks like paint, not blood.","post_message":"This man’s wife has been found guilty of domestic abuse against him. Even she wasn't expecting so much jail time."},{"comment_id":"10156008718310354","commenter_b":"Omg still an ugly turd inside and out. Who cares what this bitch thinks or says!!!","commenter_a":"Yeah.... there is someone with less class than a pig.","post_message":"Just when you thought she couldn't be any more vile..."},{"comment_id":"10153122322244705","commenter_b":"Rehan Perera Damith Wickramarathne","commenter_a":"It never looked black! Blue n Brown. On the right it's got black with blue.","post_message":"And there you have it, folks!"}]
