[{"comment_id":"10154818490392235","commenter_b":"Last I checked deplorables 1 idiots 0","commenter_a":"I wonder why raw story didn't post anything about the black kids jumping the white guy because they thought he supported trump. Liberal logic the worlds cancer","post_message":"This video just is the latest in a series of white people justifying their obnoxious behavior and demanding special treatment because they voted for Trump."},{"comment_id":"1353378344701619","commenter_b":"Bring it bitches...Without the U.S. China will starve.","commenter_a":"EFF CHINA!!!!!","post_message":"CHINA WARNS TRUMP.    @webpagelink"},{"comment_id":"1266389850103907","commenter_b":"@username, do you kiss you're mail man with that mouth? Ms classy","commenter_a":"Every responsible voter should remember these days of how badly the democrats have acted after the Trump win and NEVER AGAIN vote for or put a democrat into a position of power, as they become once elected monsters absent completely of morals and integrity.","post_message":"Georgia Secretary of State now asking Trump to look into why the Department of Homeland Security has been trying to hack the Georgia voter database"},{"comment_id":"10155047636614657","commenter_b":"AND SHE WANTS EVERY WOMAN TO BARK LIKE A DOG !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Should every single woman in America have a federally mandated abortion, too? Is that where we're heading?","post_message":"A specious, simplistic pander."},{"comment_id":"10153161332178606","commenter_b":"with friends like that who's need enemies! She's just evil.","commenter_a":"Good. She can go to JAIL !","post_message":"Police said a teen had second thoughts about committing suicide, but his friend encouraged him to do so. @webpagelink"},{"comment_id":"623158744555639","commenter_b":"Oh my that thing looks scary","commenter_a":"Adriana R. Eiro","post_message":"A baby chameleon is born"},{"comment_id":"557993331054503","commenter_b":"Yes and some she A BITCH from HELL.","commenter_a":"With her freedom.","post_message":"Pentagon Attacks Trey Gowdy, Because He Refuses To Abandon Persecution Of Hillary... He Needs Your Support  He's taking a stand for the soldiers who were left to die.   Do you think Hillary needs to pay for her crimes?"}]
