[{"comment_id":"1036501259720547","commenter_b":"If illegals are going to remain here what difference does it make?","commenter_a":"Trump/Cruz will have my vote.... but if Trump is not on the ballot......don't expect me to cast one","post_message":"Ted Cruz explains why he thinks \"2016 is going to be an incredible year.\""},{"comment_id":"10153778649078854","commenter_b":"This witch should have been fried after being tried!","commenter_a":"a bullet does not cost much and in this case it would definitely improve the penal figures.","post_message":"Mother Sentenced to 25 Years in Prison After She Presented an FBI Informant with a Disturbing Offer"},{"comment_id":"553065348238039","commenter_b":"Boy please!! Your mama gonna beat you stupid!","commenter_a":"I'm black and voting trump. Most of my family's also voting trump. Even most of my friends are voting trump so the news is a joke nowadays. And in case your all wondering yea we are 90% black family and friends.","post_message":"Here's why Donald J. Trump is struggling to win over black voters."},{"comment_id":"10155053985253545","commenter_b":"No job, old, divorced, and very ugly ignorant from the inside... She needs a complete make over inside and out and in need of a man You say you know everything can you please direct us to facts ? Post them on here please... @username","commenter_a":"He had 23 years to make his American dream legal no feeling sorry for him sorry illegal is illegal look up the word illegal it doesn't say you get rewarded for doing illegal actions","post_message":"Daniel Ramirez Medina, who was brought to the US illegally as a child but allowed to remain under an Obama administration policy, is suing the federal government over his arrest and detention by immigration agents."},{"comment_id":"10155397159458797","commenter_b":"And no telling how many more he has! Since he likes to pull on ladies p___y. Freak!","commenter_a":"Since you all won't acknowledge our formal president as the \"First Black President\" i will only acknowledge trump as the FIRST PRESIDENT WITH THREE BABY MOMMAS' BAHAAAAA! HAPPY BLACK HISTORY MONTH!!!","post_message":"On this first day of Black History Month, we recognize former President of the United States, Barack Obama. He was the 44th U.S. President and the first African American to serve as president."},{"comment_id":"10153601261735861","commenter_b":"LOSER!!!!","commenter_a":"boomer","post_message":"Oklahoma State slips in the AP Top 25- OU moves up"},{"comment_id":"10154126114949877","commenter_b":"Off with her head!!!","commenter_a":"If it were my child, the white mother would be in a box today.","post_message":"White Mother Charged w/ Assault for Slapping Black Teen after Screaming N-Word. Watch how it all unfolded and the family's reaction below. Grio fam, can you imagine if this was your child? Sound off!"}]
