[{"comment_id":"1084748028260016","commenter_b":"@username like they said there would never be a GREAT WALL OF CHINA. There will be a wall!!!!!","commenter_a":"Oh my god, people keep talking about Trump's \"wall\" as if it's an actual thing. It's not a thing. It will never be a thing. It's just a distraction so people don't ask him about real issues that he has no answers for!","post_message":"\"At the start of my conversation with Donald Trump I made it clear that Mexico will not pay for the wall,\" Mexican President Enrique Peña Nieto tweeted in Spanish from his official account."},{"comment_id":"10153207702598967","commenter_b":"That chick in red goes down HARD!!! Hahahaha...","commenter_a":"Outstanding!","post_message":"So silly but so fun"},{"comment_id":"759924327531478","commenter_b":"Just showing up is prolblem for me. Trash that is all she is","commenter_a":"Yes","post_message":"You Won't Believe What Hillary Clinton Was Caught Doing During Nancy Reagan's Funeral This is really does speak volumes to what kind of person she really is. Do you think Hillary Clinton would make a terrible president?"},{"comment_id":"1315430658535467","commenter_b":"Hell yes! Build your wall and Get Over It!","commenter_a":"Could you guys please move on from this and actually report news.","post_message":"He's the \"Hamilton\" actor who gave a holier-than-thou speech to Vice President-elect Mike Pence at a performance of the play in New York City last week. Now, sick tweets have emerged that show the kind of person that Brandon V. Dixon REALLY is, and it's definitely not the kind of thing he wanted out there..."},{"comment_id":"10155209080925652","commenter_b":"mast! :D","commenter_a":"Ashay Gangwar @username check this out!","post_message":"These maps offer the most enjoyable route, not the fastest:"},{"comment_id":"10153880483259705","commenter_b":"Samantha, this is your life.","commenter_a":"The driver?","post_message":"Mind... doesn't... understand..."},{"comment_id":"1839325792793827","commenter_b":"Sandra you old hag","commenter_a":"I hope he suffered.","post_message":"State run Press TV said Rafsanjani, 82, died from the heart problems despite efforts by doctors to save him."}]
