[{"comment_id":"10153569563806051","commenter_b":"They should be sent back where they came from ASAP !!! End of that story !!!","commenter_a":"Please do some research. What does your state actually offer in the way of public assistance to noncitizens? In California noncitizens are not eligible to cash assistance or Calfresh (foodstamps). No Social Security or Medicare without legal residency. So just what are you haters talking about? I hope none of you ever find yourselves in a financial situation which would drive you away from your home in order to survive. I hope you don't call yourself 'Christians' because you are so far from the core of that belief.","post_message":"Should illegal immigrants be banned from receiving Obamacare subsidies? That was far from the case in 2015."},{"comment_id":"10153549714052014","commenter_b":"She should've closed her legs.","commenter_a":"Unfortunately this POS will get an attorney who will say she is mentally ill, then she will go to some mental hospital. She will be there few years and they will say she is better, she will be back having more babies. I don't care what the reason, crazy, postpartum, bad day, whatever she deserves jail for the rest of her life!! She should have just whacked herself, sorry I have absolutely no pity for her.","post_message":"HORRIFIC UPDATE: Police are now saying the mother who killed her 3 children also partially dismembered them. Two of the kids were placed in closet & the 2-month-old baby was 'stuffed into a case.'"},{"comment_id":"916567641696749","commenter_b":"Book should have been titled; Chicken Shit in the Mango Tree. Married 31 years raised by a mother 2X divorced and once widowed. The families do not get over these Selfish POOR ME decisions. Families are for life.","commenter_a":"Why don't you profile some of the people who have not just dumped their inconvenient families? Let's see a profile of couples who have been bored, or 'grown apart' and worked at their marriages instead of taking the easy and selfish way out. This guy 'gained so much more' because he cared only about himself.","post_message":"'I thought 'I have to do this ... it will be horrible for all the people I love most in life. But I have to do it.'"},{"comment_id":"10153569786727522","commenter_b":"What do American soldiers have to do with restriction of future immigrants?","commenter_a":"Barbara Bell","post_message":"'When you question a mother's pain...you are attacking us.'"},{"comment_id":"10154789574398132","commenter_b":"Sick people. Why do they need a child when they are idiots","commenter_a":"This is disgusting!!! Hope they rot!! That poor baby. I'm sure he has seen this many times in his short life. I'm sad for him.","post_message":"Ohio police have posted shocking photos of unconscious adults  who they believe overdosed on heroin."},{"comment_id":"1215546011816966","commenter_b":"This is still AMERICA. MOST OF US STILL. BELIEVE AND HAVE LET OUR CONSTITUTION , BILL OF RIGHTS AND AMENDMENTS. WORKING IN THIS COUNTRY. YOU DONT LIKE THOSE LAWS OF OUR LAND. YOU ARE NOT A TRUE AMERICAN. SO YOU HAVE NO SAY. BECAUSE YOU HAVE NOT PASSED THE LAWS OF IMMIGRATION TO BE A CITIZEN OF THIS UNITED STATES OF AMERICA. AND JUST BECAUSE YOU ARE BORN HERE DOES NOT. GIVE YOU THE RIGHT. TO UNDO OUR LAWS. IT IS BREAKING THOSE LAWS TO DO SO","commenter_a":"Bimbo has been drinking the koolaid","post_message":"This is ABSURD."},{"comment_id":"1095660007120418","commenter_b":"good, dumb woman","commenter_a":"The tiger is a wild animal! What did she think would happen?","post_message":"Officials believe Jacqueline Eide, 33, entered a Omaha, Nebraska,zoo and tried to pet a Malayan tiger, which bit her hand. >>kiro.tv/TigerBite"}]
