[{"comment_id":"10153278641039087","commenter_b":"Absolutey prison is where this bitch belongs.","commenter_a":"MADAM PRESIDENT HILLARY CLINTON","post_message":"“I have no doubt on [Thursday's appearance before the House Benghazi Committee] she will be remarkable, and that Americans will really see why so strongly I believe she should be our next president,” Chelsea Clinton said about her mom Hillary Clinton."},{"comment_id":"10153026521466955","commenter_b":"Women of the world just took a hit, sorry","commenter_a":"it's all lies and if you even think for a moment it's true then your the fool","post_message":"MAG: Bruce Jenner 'Transitioning into a Woman'... Filming momentous docu-series..."},{"comment_id":"1384744278251983","commenter_b":"I blame Obama, Jackson, Sharpton, Pelosi ...................","commenter_a":"Maryliz T. Curtis","post_message":"'It's a kind of anti-black mood'"},{"comment_id":"10154563993751336","commenter_b":"No illegals. Period. No other country puts up with this crap. Not even Mexico. No more paying Welfare, etc., for these people. They break our laws and then steal from us. Those of us that actually pay federal taxes are sick and tired of working so they can have Free Medical, welfare, EBT cards, educate THEIR children, Welfare..Etc., Out they go. Deport them and build the wall.","commenter_a":"I'm all for Trump winning this upcoming election, but building the wall is a joke, and thinking he can make Mexico pay for it is a bigger one. Wall or not you're going to have illegals come in.","post_message":"\"[Donald J. Trump] has stuck to his guns on the idea that we're going to have a border, we're going to enforce the border.\"  Gov. Mike Huckabee joined Howard Kurtz on \"MediaBuzz\" today to react to the GOP presidential nominee \"softening\" his tone on immigration. @webpagelink"},{"comment_id":"10152760994092144","commenter_b":"That first comment wins stupid comment of the month on the internet. But you will call a cop who has a gun to save your sorry ass. You won't take any responsible actions to save yourself or family, but you will pay someone ELSE to put their life on the line to do it for you.","commenter_a":"Screw the nra.MELT THE GUNS!!!","post_message":"\"We're basically being forced to repeal these laws at gunpoint… Every local gun law must go!\""},{"comment_id":"10154339492484087","commenter_b":"@username, good luck trying to deport a Native, you racist bigoted POS.","commenter_a":"Meanwhile, Boeing stocks take a hit because of this asshole.","post_message":"Boeing released a statement saying it was under a $170 million contract with the Air Force, not $4 billion as Trump claimed."},{"comment_id":"10156393794945725","commenter_b":"Bitch","commenter_a":"The law is broken as in Chicago for the murder of Laquan McDonald who was shot 16 times in god dam animals because was In Africa American","post_message":"This is a look at the scene on the streets of downtown Chicago right now. LIVE COVERAGE -----> @webpagelink"}]
