[{"comment_id":"10156388002150389","commenter_b":"Muslims are the problem!","commenter_a":"He was a Muslim. What else is there to know?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152906075606336","commenter_b":"'@webpagelink In case you wanted to read the rest of what Seth Rogen had to say, not just the original tweet that was blown WAY bigger than it needed to be.","commenter_a":"Well said craig","post_message":"Country music singer and military veteran Craig Morgan fired back at Seth Rogen for his American Sniper comments. @webpagelink"},{"comment_id":"10158374011905206","commenter_b":"Sucks to suck Donald Duck","commenter_a":"Trump has created more jobs in New York than any politician, yet they screw with him because..... You know ..... Politics.","post_message":"The Attorney General ruled that the Donald J. Trump Foundation had been raising cash in the state this year when it wasn’t registered to do so — a violation of state law."},{"comment_id":"10150721738224999","commenter_b":"To bad nothing could have been done to stop the shooting of the first graders. If Obama wants to stop senseless violence he should stop pursuing senseless executive orders and do something like support Kates law. Crimes that are preventable through deTerence and viligiliant police enforcement can actually stop senseless gun violence. Almost nothing at all can stop a crazy person from attacking an elementary school and killing first graders. Fortunately it is an extremely rare event. The vast majority of senseless killings are actually far more preventable. Obamas convictions are misdirected. How about deporting all the illegals from the country. That right there would prevent thousands of senseless violent crimes. Read the stats. Not all illegals are criminals but none of them have the right to be here so if one of them commits a murder its because our goverment is to spineless to enforce the law. Enforce the ...","commenter_a":"I still think about Sandy Hook so much. I can't get past it. My heart still aches for those precious little ones & I still cry. Thank you Mr. President for taking a step in gun control.","post_message":"Shedding tears over the 2012 deaths of children in a Newtown elementary school, President Barack Obama announced executive actions he will take on gun laws. @webpagelink"},{"comment_id":"908658009268823","commenter_b":"'@username still smarter than that orangutan! That orange menace!","commenter_a":"Hillary Clinton is a walking oxymoron... Innocent yet Guilty!","post_message":"Hillary Clinton rips into Donald J. Trump for his critique of retired four-star Gen. John Allen, saying it's unpresidential to 'insult and deride our generals.' @webpagelink"},{"comment_id":"10154469965885579","commenter_b":"Why would that surprise you Mr. Brown, Mr. Trump becoming the next President of The United States is a blessing compared to it almost not being America at all thanks to all the corruption of this Government and the Politicians letting it be taken over my illegals that pretty much rule OUR COUNTRY, PRAY TO THEIR GOD ON THE SOIL FOUGHT MY THE MEN AND WOMEN OF OUR VETERANS AND ACTIVE SERVICEMEN , THAT WE OURSELVES AS AMERICAN CITIZENS ARE DENIED, BURN OUR COUNTRY'S FLAG AND I COULD GO ON AND ON, BUT LETS JUST SAY 'CHANGE IS COMING, THOSE GETTING A FREE RIDE WILL BE OVER, THE RICH GOVERNMENT WILL NO LONGER BE LIVING HIGH ON THE HUG, THE POLITICIANS WILL NO LONGER BE MAKING DIRTY DEALS AND ROBBING THE AMERICAN CITIZENS OF THE HARD EARN MONEY !! Yep he made it this far because he's one of US ...","commenter_a":"I'm seriously embarrassed that this man can make it so far in our country. He takes what class the GOP had and throws it to the wind.","post_message":"Donald J. Trump: 'Tonight we close one chapter in history and we begin another.' Watch complete speech here: @webpagelink"},{"comment_id":"1118673694809606","commenter_b":"yeah...chickens have lips and pigs can fly!!!!!","commenter_a":"not with him in office.","post_message":"Can Obama convince voters US moving in the right direction?"}]
