[{"comment_id":"10154051337399411","commenter_b":"Are you sane, woman?","commenter_a":"A scientific theory is a well-substantiated explanation of some aspect of the natural world that is acquired through the scientific method and repeatedly tested and confirmed through observation and experimentation.","post_message":"If you have proof: bring it. If you do not: acknowledge openly that you have theory perhaps a well-honed, much loved theory, but a theory nonetheless. (Op-Edge by Sam Gerrans)"},{"comment_id":"10153411890826167","commenter_b":"Don't Muslims go the mosque all the time? What's the big deal?","commenter_a":"Well, we knew THAT was coming!!","post_message":"The White House said Obama's upcoming mosque visit is meant to \"reaffirm the importance of religious freedom to our way of life,\" but suddenly conservatives don't seem to care about that:"},{"comment_id":"10154237826833010","commenter_b":"So no women has ever done the same thing right? Smh","commenter_a":"My son-in-law, a sheriff's deputy, once got a call about a baby in a car seat in a car in the parking lot of a \"gentlemen club\" translation - strip club!! The cops found the father inside getting a lap dance. He was supposed to be caring for his child while his wife, a doctor, worked the night shift at the hospital. What a father :( What a husband :(","post_message":"This week in North Hollywood."},{"comment_id":"1164891623572953","commenter_b":"No Obama, is a Muslim and I say screw all Muslims!! Trust No Muslim Ever!! Remove all Muslims from the United States. Trump, 2016, for 8 years!!!!","commenter_a":"Hell NO","post_message":"Another Muslim Holiday, And another Speech From Obama Greeting Them... Obama said he sides, with Muslims, maybe he should side with America FIRST! Do you side with muslims? take our poll!"},{"comment_id":"10152955255282452","commenter_b":"@username, abortion is legal even in the third trimester.","commenter_a":"How about we teach students and other young girls about birth control (not making it a religious issue) and make it more available to the public so we wouldn't have so many abortions in the first place. I don't like abortion, who the hell does anyways? But we shouldn't ban it. Let's push our efforts into making it as rare as possible instead.","post_message":"Anti-abortion activists on Tuesday released an undercover video showing a senior Planned Parenthood official discussing the disposition of parts from aborted fetuses. @webpagelink"},{"comment_id":"918244381576759","commenter_b":"She is a freaking fat ass I've seen pictures of her shoveling food in her fat face the fat bitch","commenter_a":"Serve it or she'll dip her balls in the mashed potatoes and gravy!","post_message":"Michelle Obama Orders Schools To Feed Children Her Slop Or She Will... Ugh. Totally gross! SPREAD THIS EVERYWHERE! @webpagelink"},{"comment_id":"10154567699055399","commenter_b":"cuts? cuts!? SS gave out a wonderful COLA increase for 2017 of ONLY .03%! That amounts to about $2.00 more per month while Medicare just raised their rates over 149%.....FAIR? It is insanity!","commenter_a":"Full severance packages for Medicare/Social Security recipients and contributors. Give them their money back and kiss them good bye. Get politicians out of the retirement/pension/health plans completely","post_message":"It would, among other things, gradually raise the retirement age from 67 to 69 on Americans 49 or younger at the present."}]
