[{"comment_id":"10154278123559497","commenter_b":"so sorry, I hate seeing girls do this to gay guys","commenter_a":"As a gay man, this was the majority of high school. Being dragged along by my female best friend. Apparently as a gay guy I was supposed to Enjoy whole foods, Bloomingdales, frozen yogurt and Mac lol. Also always being asked for advice by every girl on guy issues.","post_message":"\"You just never know where the day is going to go with Paul.\""},{"comment_id":"10154414118997042","commenter_b":"Exactly, she's just a trophy Wife to Donald anyway.","commenter_a":"Mealania Trump's If she only had a brain","post_message":"Melania Trump is being accused of plagiarizing from Michelle Obama's 2008 Democratic National Convention speech.   Judge it for yourself:"},{"comment_id":"1454008947960907","commenter_b":"Just stop we will help them build a wall gladly","commenter_a":"Not going to happen. Not only has it been deemed unconstitutional, isolationism DOES NOT WORK in a multinational economy. This makes me roll my eyes just like when Texans were crying the same thing after Obama was elected (both times).","post_message":"Group calling for California to secede from the U.S. hopes to put question on the ballot authorizing vote on independence."},{"comment_id":"10152807087037434","commenter_b":"Sad & in no way did I consider her or her character on sex in the city a role model ! This is sad because she made a ton of $ pretending to be a woman that writes for a living- most (not all) writers know the definition of a word before the use it or wish for a movement in its name! Geesh SJP can't you pretend to be smart????","commenter_a":"I think people need to stop asking celebrities for their opinions on feminism. They are just as likely to be total ignoramuses as anyone else. Exhibit A right here.","post_message":"\"We would be so enormously powerful if it were a humanist movement.”"},{"comment_id":"10153949454199087","commenter_b":"This idiot is a democrat? I bet no one saw THAT coming...","commenter_a":"Send this loser to another planet.","post_message":"Democratic congressman Hank Johnson on Monday compared Israeli settlers to termites while discussing Israel-Palestine relations."},{"comment_id":"10154074344751336","commenter_b":"You're an idiot.","commenter_a":"It looks like the liberal PC police culture have hit the Miami police department. Their feelings are hurt so they will be boycotting Beyonce by not doing their job. We need to make sure to send enough panties for them to wear so they can cry comfortably at the boycott. Our officers used to have thicker skin than this. This is a sad day in America when our police officers are crying and boycotting for hurt feelings.","post_message":"Usher, Demi Lovato, Yolanda Adams and The Band Perry are among the contemporary artists heading to The White House to celebrate the late Ray Charles."},{"comment_id":"10158427286480206","commenter_b":"Where were these feminist when Bill was galavanting around town assaulting women and Hillary was defending him?","commenter_a":"Wonder if they \"smoked\" cigars afterwards, with Bill.... 2016, the year that people protested over a word... terrific.","post_message":"A mostly-female crowd chanted \"GOP, hands off me and \"Trump thinks he runs this town, p---y came to shut it down\" outside of Trump Tower."}]
