[{"comment_id":"1376753242362908","commenter_b":"o.k you're can't be racist . how about a whiney , hateful bitch ? yeah ,that suits you better .","commenter_a":"Outrageous!","post_message":"These people are insane."},{"comment_id":"10152654360726636","commenter_b":"Dirty women, women in India are cleaner.. LOL","commenter_a":"Ewwwwwwww no way! Everyday girl me!","post_message":"One in three have gone three days without washing..."},{"comment_id":"10152870782829091","commenter_b":"Who kill innocent people ... Im just saying .. Encourage them America ....this is why the world is crazy cuz of the way y'all( liberal whites ) think ..filthy animals","commenter_a":"What the hell is wrong with people..... She should of had her students send letters to our troops","post_message":"SHOCKING: A teacher in New Jersey has been suspended for having her third-grade class to write get well letters to a sick inmate convicted of killing a Philadelphia policeman: @webpagelink [PHOTO: Forest Street School]"},{"comment_id":"10152923499612217","commenter_b":"Are you tired of that excess fat in your body,having serious menstrual pain, weak erection, stretch mark,insomnia, stroke,fertility problem,pimples or any rough skin? We have the best and most affordable products for you.To get any of our products contact @username, BBM -2BDA0E2A.","commenter_a":"deepest sympathies to the families of all of the victims.......","post_message":"What we know about some of those who died #RememberTunisia"},{"comment_id":"10155485619961509","commenter_b":"Hillary is. Not a woman! She is a devil!","commenter_a":"Trump: Nobody has more respect for women than me, believe me.... 20 mins to Hilary \"What a Nasty woman\", this clown is the biggest joke ever.","post_message":"Hillary Clinton, citing Bernie Sanders, calls Donald J. Trump \"the most dangerous person in modern history to have run for president.\" @webpagelink"},{"comment_id":"10154729754221729","commenter_b":"She's a cunt.","commenter_a":"It does matter what you call it Killary , our young people in the United States were once again attacked .","post_message":"Whoa. About damn time."},{"comment_id":"995099337179781","commenter_b":"Crazy dumb old witch.","commenter_a":"I think democrats are more like terrorist. Terrorist maim and tear people's bodies apart. Democrats do the same thing to unborn babies by allowing Planned Parenthood to Harvest baby body parts. As far as I know no terrorist organization sells body parts. Guess that makes Democrats and Hillary Clinton worse than terrorist.","post_message":"BREAKING: Hillary Clinton says GOP candidates are like terrorists because they're...pro-life?"}]
