[{"comment_id":"1731231320495188","commenter_b":"Fool","commenter_a":"Now ratify Obama's choice for Supreme Court judge.","post_message":"Backed into a corner, Senate Republicans have given up trying to repeal Obamacare."},{"comment_id":"10152863339776491","commenter_b":"Just think all the traffic that's been through her!! Her germs have germs!!","commenter_a":"Can you imagine being the one that has to kiss those lips? Ugh. I mean uuuugggghh!","post_message":"\"Every time I say something that’s extremely truthful out loud, it literally breaks the Internet.\""},{"comment_id":"600515870151925","commenter_b":"I'd say the dog has reached that point because it is being handled incorrectly. I'd put a spot light on the Obamas for not treating the dog properly and training their girls on how to treat the dog. Dogs don't lash out just like that. It would have to have been constantly mishandled. Like that stupid heavy jewellery around the neck for instance.","commenter_a":"I don't think they need to sue, if he takes financial responsibility for the cost of the injuries.","post_message":"Should they soak the Obamas for big bucks? (Or at least some sort of political favor?) Wealth being spread around. That the Obama way, isn it?"},{"comment_id":"10153315530254203","commenter_b":"Yes,Everywoman has a right to choose.","commenter_a":"Here's one for ya: \"WHAT DIFFERENCE AT THIS POINT DOES IT MAKE!??!?!?!\" (With appropriate accompanying \"toddler having a tantrum\" body language). That's one of MY faves.","post_message":" rights are women rights and women rights are human rights once and for all."},{"comment_id":"10154424174381162","commenter_b":"It's the Ocean. Dangerous animals live there. Leavem alone","commenter_a":"Or he could have just left it alone and the family move to a safer place? Sounds so unnecessary...","post_message":"A dad celebrating Father's Day wrestling an alligator on a beach before it's able to attack his family and others. FULL STORY: @webpagelink"},{"comment_id":"10154684431129614","commenter_b":"They should both be arrested Alisa Perne. Neither acted like an adult should, that lesson never suck","commenter_a":"He wasn't acting like a man and she wasn't acting like a woman. He had no right to hit, but she kept provoking still not right. He could of called the police or walked away..both at fault, but he hit so physical violence on his part.","post_message":"Police are searching for a man seen punching a woman in the face in a disturbing surveillance video taken outside a store in Venice over the weekend. The victim apparently had seen the man at a festival in the city on Sunday but does not know him. The two bumped into each other again at the store and got into an argument before the man punched her. Bystanders tried to stop the man but he managed to escape and ran away from the scene. read KTLA's story here: @webpagelink"},{"comment_id":"10153829501651337","commenter_b":"Humanity","commenter_a":"The amount of non judgmental compassionate comments on here is truly staggering","post_message":"HE'S KNOWN HOW LONG? Here's Charlie Sheen's HIV announcement..."}]
