[{"comment_id":"952811251478596","commenter_b":"@username how about you go fuck yourself","commenter_a":"Wow, while I agree that both parties are leading us down a rabbit hole. The fact is we have two parties that lead us in this country. The democrats have a criminal and a socialist as front runners in their campaign. So I have no alternative but to endorse the republican party. If my friend that liked this post feels that makes me anti American then I guess we don't know each other as well as I thought.","post_message":"This HAS to be said. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"921176444602838","commenter_b":"Bernie or Hillary will destroy the economy with their policies. Plus, they're so weak on immigration and would prefer for the illegal immigrants, who by the way, suck up over 150 billion dollars per year, to stay. Trump is on point with just about everything.","commenter_a":"Michael Luna Can't wait to see what Obama says or these other people just opening the gates to everyone... Donald J. Trump is right on this one, we need to close the border right now...","post_message":"The two men have been training at the base since February and “were screened prior to their arrival in the United States more than a year ago,” according to the statement."},{"comment_id":"1152899144750942","commenter_b":"She should be more scared of her elder rapists.","commenter_a":"I have this theory that if he wins, at his coronation hes gonna start his speech by saying he doesnt want to be president he just wanted to prove how racist and bigoted people in this country are by going out saying ignorant shit on all levels and poor rednecks eat it up. I mean seriously if people really think trump would be good for America those are the people that are wrong for America. You can spend all day polishing a turd but at the end of day hes still a piece of shit. All the anti muslim shit he spews with all his rich muslim buddies. He has hotels and other businesses in multiple muslim countries are we supposed to ignore that or what.","post_message":"They let her know, in no uncertain terms, that they have her back. - Eric March"},{"comment_id":"911884798904575","commenter_b":"\"I guess if you favor the right, the debt will grow, more jobs will be lost\" - The current President who is on the left raised the debt more than every other President combined. You acknowledge that there can be different factions on the left but not right apparently as well. If your main concern is the debt then you should lean more conservative as the primary goal is financial stability. Bush was not a conservative btw, he was more liberal. The main difference in policy between Obama and Bush (and possibly both parties in general atm) is \"what\" they wanted to spend money on but they both want to spend as much as they can get away with. I also do not accept your copy and pasted answer to Octavio's question. A definition doesn't tell anything. He's asking where you see the differences. It's also dishonest to call America ...","commenter_a":"Socialism works, as designed by the Founding Fathers, all of whom were socialists.","post_message":"Republican liar: 1 Bill Maher: Infinity"},{"comment_id":"902249986464524","commenter_b":"ridiculous..she was good enough to lay down and have a child with but now she's a hoe?","commenter_a":"SMDH now that an action right there to piss her off more. No woman wants the father of her child disrespecting her on media outlets. Let's see how long she gonna ban him from seeing his son now. Some guys never learn. No matter how much he hate her he need to handle their business in private. Who wants to grow up with the public and their father throwing shade at the person that gave birth them. U cant stop what the world thinks of Amber but Wiz should act more mature and handle it since he a Dad now. They need a mediator ASAP","post_message":"“Instagram Turnin’ These Wives Into Hos”: Wiz Khalifa Takes Cheap Shots At Amber Rose On New Song, “For Everybody” :("},{"comment_id":"1000663273302101","commenter_b":"Fuck you pig boot licker.","commenter_a":"HAHAHAHAHA. Just because they be black,,,,,,,,you think yo sorry black asses BE safe with Islamists \"protecting\" yo ASSES? HAHAHAHAHA","post_message":"The police thought they were the only alternative for security. They just found out that there are many groups willing to do their jobs for them, for cheaper and with more accountability if they mess up! Do you support this move? Or will their be utter chaos without the police there? Follow >> (Y) Counter Current News for the latest!"},{"comment_id":"10153199582481336","commenter_b":"IF YOUR BLACK YOU ARE FOR OBAMA AND NOT FOR OUR LAWS!!!! INVESTIGATE HILLARY CLINTON AND BENGHAZI AND ALL HER PAY OFFS AS SECRETARY OF STATE!! THIS WOMEN SHOULD BE IN JAIL AND YOU KNOW IT!!!!!!!","commenter_a":"Is she qualified? Or is it a race thing.... As the usual poop that osamabama does???? Really America, when will you take back your country? When he's given everything to the enemy, the one he won't name????","post_message":"“We can restore trust and faith, both in our laws and in those of us who enforce them.” Moments ago, Loretta Lynch was sworn in as the 83rd U.S. attorney general – the first African American woman to assume the position. @webpagelink"}]
