[{"comment_id":"1130182300405839","commenter_b":"Sorry about the lies aren't going to work she won the debate she will be our president get over it","commenter_a":"He is a tax cheat. What makes him think he is ok not paying taxes. I truly believes he hates our country. He is scum","post_message":"Absolutely deplorable."},{"comment_id":"10153073313318445","commenter_b":"The queen only has a cheeky one tho!","commenter_a":"Come on America if the queen can have it. Why can't we?","post_message":"UK's First #Cannabis Pharmacy Opens in London!"},{"comment_id":"533363636854216","commenter_b":"if this person had been a white lady, shed be up on charges...black privilege","commenter_a":"Good for her kick his ass","post_message":"After this mom found out her son was rioting, she took immediate action. All the parents in Baltimore should be doing this to their race rioting children. Do you agree her race rioting son got what he had coming?"},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"},{"comment_id":"10154092301891028","commenter_b":"she hates clowns","commenter_a":"@username and Leonora Fabio Chavez Don't tell Sarah About this lol","post_message":"Nope. The lore of creepy clowns purportedly trying to lure children into the woods sweeping the Carolinas and Ohio just made it to Tennessee. @webpagelink"},{"comment_id":"10153226517872232","commenter_b":"Probably...","commenter_a":"And while all were watching the fight 1 or more were most likely walking out with merchandise","post_message":"CAUGHT ON VIDEO: Several women got into a brawl Friday afternoon inside the popular Rittenhouse Square clothing store, Zara --> @webpagelink"},{"comment_id":"894582770641419","commenter_b":"Ship her out","commenter_a":"There is a special place in HELL for Rosie O'Donnell. It seems to me she is living her hell on earth her life has gone so well. Can you remember a movie? TV Show oh the view, did she get canned. What ever happened to that talk show. If I remember correctly she had problems with her own kids. I think they just didn't want anything to do with her. Go get back underneath your rock Rosie!","post_message":""}]
