[{"comment_id":"10152541271415667","commenter_b":"Well Mickey they need a big building for all of his coloring books. Forget the white racist asshats on here... they will all die off eventually.","commenter_a":"Bush is responsible for thousands of american lives yet you bigots hail him as this savior because a blk man is president...he needs to be in jail yet you tea parties build him a library. .FOR WHAT!","post_message":"\"I have no more campaigns to run,\" Obama quipped during the State of the Union. \"I know 'cause I won both of them.\""},{"comment_id":"10153826887651179","commenter_b":"It was at the place in France where the ladies wear no pants.","commenter_a":"going back to their roots? lol","post_message":"$55 million dollars of cocaine was found at a Coca-Cola plant in Signes, France."},{"comment_id":"10153437491481130","commenter_b":"Arrogant bitch","commenter_a":"Hilary is a dumb lying bitch!!","post_message":"Sick burn, Hillary Clinton!  Video: NowThis"},{"comment_id":"978112395570641","commenter_b":"Did all Muslims commit those crimes ?","commenter_a":"It's disrespectful not all Muslims are terrorist or bad people it's in terrible taste it's like me driving around with a plate that says fgirlscouts just cus one gave me the wrong cookies","post_message":"A personalized license plate in Minnesota which read \"FMUSLMS\" has received condemnation from many, including the governor. Read more about how and why it was issued: @webpagelink"},{"comment_id":"1160460537342680","commenter_b":"@username God is with us; not the one @username's people created, but the One who created the rest of us.","commenter_a":"You could make this same argument against every single other country in the world as there is no country that didn't have slavery and there is no race on earth that was not enslaved at some point, I was never a slave nor did my ancestors own any slaves so my question is why in the hell would I owe any reparations? Please explain?","post_message":"U.N. experts believe that the U.S. owes a significant amount of reparations to African-Americans.   With ongoing police shootings, unsolved legacy of slavery and so much more do you believe the U.S. will pay reparations? DETAILS ——> @webpagelink"},{"comment_id":"370042553184039","commenter_b":"marriage was not meant to be a shitty relationship depends have a market I would like to invest","commenter_a":"evolution and same sex cannot coexist","post_message":"POLL: God's design for marriage? (man and woman)"},{"comment_id":"10153756549625667","commenter_b":"No Trump No Hillary, any body else, American have the best.#","commenter_a":"like my page awlad nass","post_message":"As the Iowa State Fair got started 20 years ago, two people were shot dead in the exhibitor campgrounds."}]
