[{"comment_id":"1173335299353316","commenter_b":"Lady...Just give it up and go home!!!!","commenter_a":"Pathetic!!","post_message":"\"I don't think what Donald J. Trump says is worse than actually what Hillary Clinton in fact has done.\"  - Green Party presidential nominee Dr. Jill Stein"},{"comment_id":"1198337853547380","commenter_b":"Simple solution, ARREST Them and prosecute to the full extent of the law! They keep doing this crap because they are not being prosecuted!","commenter_a":"Yes","post_message":"These loons need to be locked up!"},{"comment_id":"1154038954631400","commenter_b":"@username show this to your boo.","commenter_a":"This made me think of you, Raima. And also laugh really hard.","post_message":"Will Ferrell: comedian, actor, just your average millennial."},{"comment_id":"935435836504943","commenter_b":"Mexicans dont pose much of a threat like ISIS refugees picked a wrong time to come over","commenter_a":"The Federal government cant property vet any of these refugees because there are no records on any of them! Hickenlooper is putting Colorado communities at risk as well as the Federal Government! 26 States as of today have refused to take any. Less States mean more refugees per State. Obama wants upwards of 200,000 refugees! If we would have wiped them out early, the world would not be in this position! How many refugees would we receive in your State if only 10, 5 or 2 States allow them? They will migrate to other states and most will go on welfare, food stamps and Obama care, not to mention the cost to educate them or the real cost of American lives from terrorist attacks in our communities! What price do you put on that Mr Speaker!? Hickenlooper as well as the Federal is putting our communities at a security risk ...","post_message":"Our nation has always been welcoming, but we can’t let terrorists take advantage of our compassion. We should not bring Syrian refugees into this country unless we can be 100 percent confident that they are not here to do us harm."},{"comment_id":"1671785493043668","commenter_b":"Bitch..... Get a life. Stop using racism.","commenter_a":"Tactical shit is racist... says the man who uses \"Redneck\" over and over and over and then blankets all veterans as being PTSD, drunks, llamaphobes, ect. the ignorance level is... OVER 9000!","post_message":"What he says about Red White and Ben is priceless."},{"comment_id":"685418174982094","commenter_b":"Why don't they take those liberal bitches off the air","commenter_a":"These women need to think before they speak","post_message":"The View is going to be taken off the air after host says this about candidate on live TV. This show is disgusting liberal trash. Put an end to the show already. Can we get 100,000 'LIKES' to have The View cancelled?"},{"comment_id":"10153693549314087","commenter_b":"Well Donald was a life long Republican","commenter_a":"Why are the rules in a way that you have to register so long before the actual vote? Isn't this a form of voter suppression? Ps. I'm not a trump supporter.","post_message":"\"They were unaware of the rules, and they didn't register in time,” Donald Trump said of his kids, Ivanka and Eric. \"So they feel very, very guilty.”"}]
