[{"comment_id":"10153140414189071","commenter_b":"Read previous comments about the difference of Free Climbing and Free Solo climbing.","commenter_a":"Incredible athleticism yes!free climb? not if he's got a rope.","post_message":"What an incredible athlete."},{"comment_id":"10152778407223445","commenter_b":"No argument, no facts, just a loud mouth bitch thinking she's right bc of some stupid ass parents. She keeps saying free access, bitch it's already accessible, just gotta know who to call. 2chainz wins this conversation piece every time.","commenter_a":"Idiot-ass","post_message":"UPDATED: Nancy Grace admits defeat in #pot debate with 2 Chainz?: @webpagelink"},{"comment_id":"1401830939879019","commenter_b":"If you are in the U.S illegal,then you should be deported period,there is some circumstances involved in illegals","commenter_a":"Amen brother!","post_message":"Black Trump Supporter Just Exposed SICK Thing He Saw Muslims Doing In His TownHas BRUTAL Message For Liberals Share if you agree they will NEVER Assimilate"},{"comment_id":"1551736915123020","commenter_b":"Pssssh please.....ive worked in an immigration office and let me tell you. The GOVERNMENT is taking advantage of illegals and will NEVER get rid of them lmfao. People such as yourself must educate yourselves on the topic. In which, may i add, you know nothing about. Furthermore, illegals PAY taxes which INCLUDE medicare and social security. The government KNOWS that they are working under Americans social security numbers and even submit them ALONG with their real name and address to apply for an ITIN number. This allows them to PAY taxes even though they are in fact illegal. And guess what??? They will NEVER alert the American that their social is being used, these \"illegals\" will NEVER see a dime of social security benefits Nor will YOU!! And oh ya....they CANT apply for medicare / welfare either. And WHY would the government not tell you your social is being used?? ...","commenter_a":"The question is why are illegals getting benefits instead of being deported. No longer should illegals receive benefits from our tax dollars. I read earlier our social security funds have been used for illegals benefits. I for one sure didn't pay into social security so a non citizen could receive these benefits.","post_message":"\"The American taxpayers have reached a boiling point. We are tired of illegals taking American jobs. We are tired of illegals living off our tax dollars. We are tired of illegals causing mayhem in our streets,\" says Todd Starnes. Do you agree?"},{"comment_id":"10154273453111509","commenter_b":"Same thing is happening here in the US","commenter_a":"This is what happens when the liberal party's refuse to listen to the people. They don't want any more migrants.","post_message":"France's far-right Front National party has made gains in the wake of the #Paris attacks."},{"comment_id":"10153066110302144","commenter_b":"No, No, No, No, No... You're in OUR HOUSE!","commenter_a":"americans welcome kenya....that kind of hecklessness cant be accepted","post_message":"\"Listen, you're in my house. You're not gonna get a good response from me by interrupting me like this. I'm sorry. No, no, no, no, no. Shame on you. You shouldn't be doing this.\""},{"comment_id":"1186457031407058","commenter_b":"I say we give it to them. not one cent of White money, black doctors, black hospitals, black colleges, black cities, and build big walls and let them deal with their own people","commenter_a":"This is what happens when you erase history just like the Confederate flag","post_message":"Strange for those that call themselves 'progressive'..."}]
