[{"comment_id":"10153010443401336","commenter_b":"I bet you don't even know what a p value is lmao.... Please don't reproduce...:)","commenter_a":"should be legal everywhere","post_message":"Possession of marijuana is no longer a crime in Alaska, but smoking it in public can lead to a $100 fine.  Should more states follow suit?"},{"comment_id":"10155984952470354","commenter_b":"Hanging around With To Many Illegale,s Will Do It !!!Dry Up His Brain !!!!!!!!","commenter_a":"Jerry brown is a twit. He's spent his life in CA and knows huge fires are part and parcel with living in CA.","post_message":"Two words: Moon. Beam."},{"comment_id":"1314229205273274","commenter_b":"Stupid, greedy women who don't respect themselves LOVE Trump. I mean, look at his wife.","commenter_a":"So they're trying to use looks to get people to vote for a man who half his party do not even like.","post_message":"People started freaking out when the hashtag #TrumpGirlsBreakTheInternet started trending Sunday night."},{"comment_id":"10153041474101051","commenter_b":"Take away the baby and tie her up so she can see how that feels .","commenter_a":"I'm assuming she gave the baby dog food.","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"10153876150456680","commenter_b":"Libs can't ubderstand acting in legal ways. No wonder they so adore ILLEGAL aliens.","commenter_a":"About the taxes. Trump did nothing outside the law. So he really is a genius. He employed tens of thousands of people and according the the law, he paid the required taxes. Now the democrats are mad that Trump complied with business laws set by Democratic governments and utilized these laws properly? A bunch of hypocrites. #TrumpPence2016","post_message":"“Almost everybody else is getting poorer.  And yet billionaires like Donald Trump are able to manipulate the tax system so that they avoid paying federal income tax,” Bernie Sanders said."},{"comment_id":"1194642483887307","commenter_b":"Still need to deal this evil bitch a Blow","commenter_a":"easy defense... animal was not collared, violated leash laws, and was a threat to their own pets and property.","post_message":"She killed the cat because she believed it was a stray and became a nuisance, but a couple who testified in court this week said “Tiger” was their pet."},{"comment_id":"660481514127059","commenter_b":"She paid him off!!","commenter_a":"Why is she using Mr. Kahn so much? I thought his family is still distraught about the horrific death of his son?","post_message":"Replay: Hillary Clinton was in New Hampshire."}]
