[{"comment_id":"10156409017440354","commenter_b":"Hillary is a stupid c*** and anybody who votes for her is a f****** moron.","commenter_a":"@webpagelink George Soros is the money and the monster backing them all!","post_message":"Don't ask questions. Just trust Hillary."},{"comment_id":"10153140940574205","commenter_b":"Perfection!","commenter_a":"Lol... Reminds me of the Mandelbaums on Seinfeld. \"You think you're better than me?\"","post_message":"In an effort to show how tough they are, Vladimir Putin and Dmitri Medvedev have released an exercise video."},{"comment_id":"889005157864717","commenter_b":"I remember the \" summer of love\". I hope I don't experience \"the summer of hate\". If you're looking for a change, this is the wrong guy for the job.","commenter_a":"He is not the establishment.","post_message":"Donald Trump Supporters: Why Are You Supporting Trump?"},{"comment_id":"908413552551727","commenter_b":"Omg poor man i hope she gets sent to prison","commenter_a":"Poor man. I hope his wife gets a nice long prison sentence.","post_message":"A year on, he still has scars..and some of them will never fade"},{"comment_id":"814443405353112","commenter_b":"if that be the case then throw the Muslims out!","commenter_a":"And what if their choice of attire offends Americans? Will they change their dress code? I doubt it. Squeaky wheel getting attention yet again","post_message":"Catholic University Investigated for Having Too Many Crosses Because It’s Offensive to Muslims @webpagelink"},{"comment_id":"10153467160786323","commenter_b":"All I am saying is there is a lot of Muslim women who use to wear more colourful suits dresses in this country who are now covering themselves up in black!","commenter_a":"I remember the days when asian women proudly wore their beautiful coloured saris and gold bangles. We have only seen this change of dress code of wearing the Hijab and Burka since 9/11.","post_message":"\"I am wearing the hijab because I want to. Not because I am forced to. Yes, really.\""},{"comment_id":"1391127634238463","commenter_b":"You poor Republicans. You are so lost in your stupor that all you can do is harp again and again over Hillary's e-mails. Sure, it was a mistake. But in the final analysis you can not find any harm caused by that. In the mean time just consider the damage caused to our nation by the rigidity caused by the Republican Congress over the past eight years. Your solution is to nominate a man devoid of any moral compass. Thanks Republicans. I can only hope that what rises from the ashes of the Grand Old Party will come closer to Abe's vision and that Rush L. stays buried in the ashes.","commenter_a":"I just do not understand how any true red blooded America could even think about voting for Hillary after her cover up of Benghazi and Emails !! The only thing she has proven is she is a BIG lair and above the law ! She is truly a woman of zero integrity and belongs in prison NOT running for our president !","post_message":"\"It took the socialist to remind us that you supported the trade agreements that cost millions of American jobs and millions of dollars.\" Last night on \"Justice,\" Judge Jeanine Pirro slammed Hillary Clinton over her Wall Street ties, failure to help the Middle Class, and backtracking over her husband's crime bill. @webpagelink"}]
