[{"comment_id":"10152961609451336","commenter_b":"Suck my dick!","commenter_a":"Kanye is absolutely right!","post_message":"Kanye West stole the show again at The GRAMMYs after Beck was announced as the winner for “Album of the Year.” @webpagelink But was it funny this time or just offensive?"},{"comment_id":"1228973160510939","commenter_b":"Typical liberal lesbian! Walking around with blinders on and not reporting the facts.","commenter_a":"She is the problem and needs to shut her mouth people like her have divided this country so much so sad they let her use what is suppose to be a bias platform to put out all this hate","post_message":"Run for Your Lives! Rachel Maddow is now warning that Donald Trump will definitely round up people and jail political opponents.  Meanwhile, you are accused of being a \"fear monger.\""},{"comment_id":"10155252907224657","commenter_b":"She needs to stay, Debbie and Hillary are the face of the Democrats.","commenter_a":"Dems should stay away from emails..they really suck at it...","post_message":"BREAKING: Debbie Wasserman Schultz Will Not Preside Over Democratic National Convention Due To Email Leak"},{"comment_id":"1046312712073631","commenter_b":"Back in the,day, I was called a baby killer. My response to the pussy was that I was ALSO A MOTHER FKR, SO KEEP YOUR MOMMA OFF THE STREET.","commenter_a":"All those who believe in abortion so passionately, please line up on the left for your very own personal post partum abortion. Lead by example........ :-)","post_message":"Does this about sum it up?"},{"comment_id":"1227346897337998","commenter_b":"Idiot sick woman","commenter_a":"Good thing we have wikileaks and Project Veritas for the truth. Trump/Pence 2016 #draintheswamp #hillaryforprison #spiritcooking","post_message":"JAY Z said he doesn't have any \"ill will\" toward Donald J. Trump, but he \"cannot be our president.\" Before introducing Hillary Clinton onstage with Beyoncé at the Cleveland, Ohio, rally, Jay Z repeated this twice: \"Once you divide us, you weaken us. We're stronger together\" @webpagelink"},{"comment_id":"10153554565881615","commenter_b":"... Murder is obviously horrible... But I would like to expand capital punishment beyond that... To a crime I put equal to murder... Child molestation ... Or child RAPE. Unthinkable. Monsters like that should be eliminated as well.","commenter_a":"Will waste even more money to keep him in our prison system or on \"death row\" ... Please use capital punishment in cases like this and actually FOLLOW THROUGH WITH IT!","post_message":"BREAKING: Allen Wade has been found guilty on all counts in the murders of Susan and Sarah Wolfe, who were killed in their East Liberty home more than two years ago."},{"comment_id":"550509575137335","commenter_b":"So do it already arrest her corrupt ass because she is dangerous to our society.","commenter_a":"yeah...won't hold my breath !! 'smh'","post_message":"FINALLY..."}]
