[{"comment_id":"1746288005610861","commenter_b":"Women do not get kicked out of restaurants because their children cry. What world do you live in ?","commenter_a":"Whatever. If that kid was crying in the middle of some restaurant & the owner told the mother to leave for the sake of the rest of the patrons he'd be applauded. Taking a baby to a political rally is as foolish as taking a baby to a Slayer concert. The exception being Slayer fans are far more courteous than the average politcal junky.","post_message":"'I think she really believed me that I love having a baby crying while I'm speaking. People don't understand.'"},{"comment_id":"1834572823431236","commenter_b":"'Sick' being the operative word in this article, I and the whole world are Im sure sick of these people and their outwardly show of solidarity to the outside world to get what they want, they will never integrate, that's a fool's paradise, so all those do gooders, I hope you are happy with what you have welcomed into Christian Countries. Im off to celebrate CHRISTMAS and Happy Christmas a million times over to these sick perpetrators of evil, may our God show no mercy on you.","commenter_a":"Insane, on the highest level. How dare they exploit children like this.","post_message":"Sick parents say goodbye to their children before one of them blows themselves up in suicide attack."},{"comment_id":"1692899604103495","commenter_b":"She is a skank","commenter_a":"Chelsea Clinton is the poster child for white privilege.","post_message":"She CANNOT be serious."},{"comment_id":"1717613511850715","commenter_b":"Shoot everyone of those goat humpin bitches! Problem solved!","commenter_a":"It's time to take a stand America !!!","post_message":"Muslim Man Kills Pregnant Woman For Coming To Close To His Mosque. He ended two lives for nothing. Justice needs to be served. What do you think his punishment should be?"},{"comment_id":"10154326338646336","commenter_b":"I don't have a family or children. I am not offended in the least. It might be a downer for those couples that are trying to start a family but geez........just quit being so sensitive. The world is not fair nor is it perfect. Keep moving forward.","commenter_a":"START A FAMILY, START A FAMILY, START A FAMILY. get over it you big babies.","post_message":"Is the phrase 'start a family' offensive? Apparently some people think so."},{"comment_id":"1003302019710656","commenter_b":"Sure let them get married. Let them suffer like the rest of the world. Oh and wait till they start getting divorced! HAHAHHAHHAHAHA Your welcome ass holes!! HAHAHHAHHAHHAHAHHAHHAH","commenter_a":"It’s My Right To Discriminate Against Republicans Since I Do Not Agree With Their Lifestyle Many conservatives who oppose equal rights for homosexuals do so based on “religious principles.” It’s a defense for ignorance that I always find amusing considering how many “biblical laws” are completely ignored because it would be almost impossible to abide by them. So, I've decided to use this right-wing ignorance to my benefit; I've decided that it’s my right to claim “religious freedom” to discriminate against many Republicans since I do not believe in the lifestyle choice they've made to be bigots. Republican and/or a bigot is a choice After all, in a state such an Indiana (which just legalized the right for citizens to discriminate against people with whom they disagree based upon their religious beliefs), shouldn't people in that state (or any other state with similar laws) then be allowed to discriminate against ...","post_message":"With the arguments for marriage equality heating up soon at the Supreme Court, TakePart.com has a handy 'here's what's up' article full of background, context, and facts. Yay, learning!"},{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"}]
