[{"comment_id":"853027351431360","commenter_b":"Kill all the white people!","commenter_a":"They won't even look at them","post_message":"Boy are these guys gonna be in trouble when the Justice Department gets involved with this, amirite?"},{"comment_id":"1193969757300354","commenter_b":"I'm not a supporter of either, and race has nothing to do with it. So for you to bring it up makes you the racist. Watch TV, read the newspapers... There are increases numbers of illegals coming across our borders (Chinese were the latest reported in increased numbers over Mexican border), so it makes no difference where they are from, but where they are coming in through! California's politics is way out of whack with the rest of the country, and the demographics show which and where. That demographic could be put up across the country on every state and the trend would probably be the similar.","commenter_a":"more welfare& illegals more clinton... go figure!","post_message":"Sanders performed better than Clinton in California's northern, rural counties, which also tend to be whiter than the rest of the state."},{"comment_id":"861215140607271","commenter_b":"Alex, it wasn't proven to be false. Please cite the \"proof\".","commenter_a":"I respect you Senior Airman but your comparing Ron Paul & Jessie Ventura to the killer as \"typical\", is absolutely ludicrous. I don't even know where to start I'm so disappointed.","post_message":"EXPOSED: Chris Kyle Killer Didn Have PTSD, Was A Typical Anti-War Punk Like Bradley Manning. I like to know if Routh or his family had any contact with Jesse Ventura in the days before he murdered Chris Kyle. Allen West and Walid Shoebat are also trying to sort out if his anti-war beliefs had graduated to jihadi sympathizing or... #americansniper #dallasobserver #guns @webpagelink"},{"comment_id":"10155046621507704","commenter_b":"No way these girls aren't boozin b4 these press conferences, no way...","commenter_a":"If these morons didn't play loud music in the background, you might actually be able to hear what the people are saying.","post_message":"They're losing it! In more ways than one..."},{"comment_id":"410796369044958","commenter_b":"Wasn't there a time when people were suppose to be Christian? We go backwards insread of forward. We may offend another religion, but it is OK for them to offend Christians. We are feeding the Christians to the lions again.","commenter_a":"Christians has the rights , just like the mustuims do. Let them do","post_message":"Another group was kicked off campus, but the reason will shock you. Are Universities going too far?"},{"comment_id":"10154647718578132","commenter_b":"Ahhhh...women tearing other women down! How mature!","commenter_a":"At least she did the mop on her head somewhat decent tonight","post_message":"First Lady Michelle Obama delivered an unusually personal and emotional speech at tonight's #DNC."},{"comment_id":"1162973243743146","commenter_b":"@username haha why does she always look psychotic?","commenter_a":"Bristol Is Pregnant Again Because...","post_message":"Hypocrisy at its finest."}]
