[{"comment_id":"10153272380601167","commenter_b":"Never trust a liberal woman with three names.","commenter_a":"Obama still has his college records sealed to hide that his grades weren't as good as Bush's.","post_message":"C'mon, conservatives, don't sell yourselves short. You did vet Obama, remember? Obama's a Muslim. Obama was born in Kenya. Obama forged his birth certificate. Obama is the son of Malcolm X. Obama's hiding his gay past!"},{"comment_id":"10153095274501600","commenter_b":"JERK","commenter_a":"there needs to be an (unlike button)","post_message":"“We are entering the curvy girl era and when all eyes are on the bikini babes of Sports Illustrated, it would be a great time to have the conversation about the rise of the curvy girl,” a spokeswoman for Sports Illustrated said."},{"comment_id":"464672456990682","commenter_b":"Fire her.","commenter_a":"Go to jail and never see the sun again.","post_message":"Do you believe this lady has the right to continue to defy the law?"},{"comment_id":"786225381476070","commenter_b":"Thats what fat racist lady wanted the cops to believe. I believe the teens who say the lady started yelling racist slurs and then slapped an underage girl. Then the racist lady called cops and lied to the police saying everyone was unruly and uninvited.","commenter_a":"It was not a pool party by all accounts....a dj set up beside a private pool and the pool was invaded by the people at the dj gathereing. And after being asked to leave by the security guard and being unruly ....the police were called and told a group of black individuals were causing trouble.....that s why th ey were focused on the black individuals....it was not a race thing. ...it was a group of disrespectful unsupervised kids being trouble....and they get attention from all of you...instead if being ignored by the public and handled by their parents....wow they have something to brag about now.....grow up and stay out of it and let the people involved handle it...","post_message":"He ran when the cop pulled out his gun."},{"comment_id":"10152897660675950","commenter_b":"I wondered the same thing. Those bitches be crazy!","commenter_a":"where's part 3??","post_message":"In a video of the incident, two women are heard yelling at one another before the argument escalates and gets physical. Then a 6-year-old gets involved; at one point, the boy is seen hitting a woman with a shampoo bottle as the women wrestle on the ground."},{"comment_id":"1174759955897808","commenter_b":"And assholes will be assholes!","commenter_a":"They are F'n PIGS... We learned that in the sixties... How soon the ignorant forget. PIGS BE PIGS... NOTHING HAS CHANGED","post_message":"We FINALLY have the proof!"},{"comment_id":"10157535598360389","commenter_b":"The press just like the FBI is covering for Hillary!","commenter_a":"The media are stupid and if it was not for Mr. Trump running against their Idol they would not have a paycheck. They all need to take a long vacation and never come back. There grins are annoying.","post_message":"Question of the Day: What do you think of some of the press' softball questions to Hillary Clinton? Share your thoughts below!"}]
