[{"comment_id":"10152784029667093","commenter_b":"Apparently, Valerie loves being inbred too!","commenter_a":"If you're white you're right.","post_message":"Parker Co. teen accepts a plea deal, avoids life in prison... @webpagelink"},{"comment_id":"10153603934566336","commenter_b":"From one extreme to the other. Idiots who need to find villages.","commenter_a":"That is so ridiculous! Why are people so stupid and go to such extremes.","post_message":"In the wake of the controversy surrounding the Confederate flag, a school district in Tennessee has banned all flags and banners, including the American flag."},{"comment_id":"644944732314902","commenter_b":"Yes, she showed America just how much she loves her country, while the SLUT demonstrated her true nature as a racist!","commenter_a":"Never a real fan of Lady Gaga up until now. What a brilliant, beautiful voice. Beyonce should leave the country if she feels she must promote racism.","post_message":"Do you think Lady Gaga did a better job than Beyonce at the Super Bowl?"},{"comment_id":"10155265316599199","commenter_b":"No. She was just bat s%$@ crazy","commenter_a":"Im sick of you Christians shoving your religion down our throats. Literally","post_message":"Court documents say the mother \"saw her daughter die and then placed her body in the shape of a cross\""},{"comment_id":"10153162076526680","commenter_b":"How the hell did you get to this conclusion based on my comment ?","commenter_a":"He's 100% right. Charlie Hebdo was especially targeted because they did cartoons criticizing Islam. What's more frightening in last week's attacks, is that, there was no rationale, just indiscriminate killing of everyone in sight.","post_message":"John Kerry suggested that there was a “rationale” for the assault on satirical French weekly Charlie Hebdo, unlike the more recent attacks in Paris."},{"comment_id":"10153405815803132","commenter_b":"about time....she is to good for him!","commenter_a":"Amanda Nicole Ross","post_message":"\"There have been problems for a while, so this was inevitable.\""},{"comment_id":"1379882718715731","commenter_b":"Illiterate angry white trash lady. #sad","commenter_a":"They lost the election because they rigged their nomination and backed the wrong candidate","post_message":"TheBlaze's Dana Loesch explains why Democrats lost the election at the Conservative Political Action Conference (CPAC) 2017. See more Dana @ theblaze.com/dana-loesch"}]
