[{"comment_id":"1762721907277999","commenter_b":"yes it is I don\"t care for her either but talking bout taking a life is wrong. weneed let goodLord dealall shes done doing. will answerto Him in the endnot us and he knowsit all. don\"t vote for her that simple","commenter_a":"Just remember: NASTY WOMEN VOTE!","post_message":"This is unacceptable. Period. I hope they track down the car's owner--and whoever made this bumper sticker.--Darrell"},{"comment_id":"10152629454892894","commenter_b":"She mad @username don't believe that hoe","commenter_a":"Aliah Tamartian Trainer Toi Magee-Taylor","post_message":"Coupled Up? Keke Palmer & August Alsina are Ridin' Around & Gettin' It [Photos]"},{"comment_id":"1018549428199222","commenter_b":"Deport all of them before they have greater numbers!","commenter_a":"“The thing about Muslims that you should realize, is that they do not assimilate. Islamists don’t adapt to the existing culture of the host country, they simply try to force citizens of that country to conform to their beliefs or suffer the consequences,” wrote Diana Spirit. 1. @webpagelink 2. @webpagelink 3. @webpagelink","post_message":"MUSLIM IMAM: Be Compassionate...Kill Gays [Video]"},{"comment_id":"1253889731373943","commenter_b":"Think I saw her speak recently. Speaks volumes about this creep. Shout this from the rooftops","commenter_a":"Julie Stoddard Laxton","post_message":"\"It was shortly that initial workshop that I realized that this was not what they were presenting it to be. This was a scam.\" - Cheryl Lankford, a military widow who attended Trump University"},{"comment_id":"1703022976604096","commenter_b":"For everyone trying to give intellectual insight to a Trump supporter, you're wasting your time. I don't expect any moron to get it, neither should you. With Newt, he's guaranteed to lose, and be irrelevant, and then the rest of ua educated americans can get back to a #TrumpFreeReality . #TrumpSupportersareMORONS #DumpTrump #AMERICAISALREADYGREAT","commenter_a":"Absolutely I would vote for these two gentlemen. Newt could and would immediately provide the information and experience to \"hit the ground running\" I believe this would be an awesome team.","post_message":"Rumors are swirling that Donald Trump could pick former House Speaker Newt Gingrich as his running mate. Would you vote for this ticket?"},{"comment_id":"545649178956022","commenter_b":"I've held that Cruz is probably more dangerous than trump because he has all the bigotry and hate but he is actually serious about it as opposed to trump who is just a bizarre orange man who is saying what he needs to get elected.","commenter_a":"Is that so? Then he's an even bigger idiot than I thought","post_message":"Ted Cruz knew exactly what he was doing by not outright endorsing Donald J. Trump."},{"comment_id":"10155028093604826","commenter_b":"Use to be entertaining...fun .. a great time to get together with friends...now its just another political platform and a lot of disrespect in the name of freedom of speech. I will be exercising my freedom to not watch it","commenter_a":"Falcons but I won't be watching. Totally lost interest.","post_message":"Question of the Day: Who do you think will win the Super Bowl?"}]
