[{"comment_id":"10153910519885695","commenter_b":"What a pig.","commenter_a":"He should be castrated .","post_message":"Jared Fogle's attorneys asked a judge for leniency, saying he is \"profoundly sorry.\""},{"comment_id":"848560338575181","commenter_b":"BUILD THE WALL","commenter_a":"and this comes as a shock to no one.......ban them.","post_message":"Reports say #ISIS now has a passport machine to have its believers infiltrate our country. I told you so! We need to protect our homeland - and make it safe for all citizens. We need leadership! #Trump2016"},{"comment_id":"10152742802465950","commenter_b":"How come them crazy coloradians cant just flush them like the new yorkers with their alligators.or the floridians with their boas!! Lol","commenter_a":"Time for some catfish!","post_message":"Someone dropped a few goldfish into the water. Soon, those few fish spawned into thousands."},{"comment_id":"10153212913058145","commenter_b":"The problem is that She's an evil mean peace of crap, that should had never been born","commenter_a":"Everyone loves kittens so what is the problem?","post_message":"A north Florida woman is facing charges after deputies said she was seen throwing kittens out of her car window. @webpagelink #wftv"},{"comment_id":"10153230871447708","commenter_b":"It's a good talk but you shouldn't make promises u can't keep. But you still have my vote","commenter_a":"Until AFTER election.....Read my lips...All the same","post_message":"I will oppose and veto ANY and ALL efforts to increase taxes. Join me in standing up for American taxpayers.  Click here now!"},{"comment_id":"932212166798963","commenter_b":"MEN are selfish!","commenter_a":"people can look at ass and other provocative videos all day. Things that children have easy access to and could potentially mess their mind, but yet everyone continues to make a big deal of pregnant/breastfeeding women. We need to get our priorities straight. #FirstWorldProblems.","post_message":"Pregnant meteorologist Kristi Gordon has been getting emails like this: \"... it is not pleasing to look at hump every day PLEASE have her take her mat leave now.\"  (Via The Huffington Post British Columbia)"},{"comment_id":"945163755529692","commenter_b":"The teacher needs the bag a brown bad cause she butt. Ugly","commenter_a":"What the hell","post_message":"An after-school elementary teacher is accused of putting a plastic grocery bag over a child’s head until he could no longer breathe: @webpagelink"}]
