[{"comment_id":"10153525959526336","commenter_b":"The mom is a idiot No common sense dumb woman that is it Let lock her up in a hot car and see if she likes it That little girl was soak with sweat even with the windows rolled down a little bit duh","commenter_a":"She took one kid with her and left the other one in the car????","post_message":"Video below shows the moment that officers freed the little girl from the van."},{"comment_id":"1690937014458022","commenter_b":"Stupid Swede!","commenter_a":"Another nut","post_message":"This is INSANE..."},{"comment_id":"10153155404671323","commenter_b":"'@username cool your jets mate !! Why should this woman or any woman in her situation sit around and wait for her breasts to kill her when she can do something proactive !! Do you know what it feels like to have the threat of your breast tissue turning against you and threatening your life !! Arrogant shite !","commenter_a":"What the fuck are you taking about? Are you a complete imbecile? She has a genetic mutation. This has nothing to do with chemicals. Besides, there are thousands of scientist like me around the world doing research to cure and prevent cancer. Read more before spreading nonsense.","post_message":"'I love my boobs but they have to go'. YouTube star Claira Hermet says goodbye to her beloved breasts before undergoing surgery for a double mastectomy"},{"comment_id":"10153294058536336","commenter_b":"There was a lot of blood shed and that's why this is disrespectful to the country of the Red, white , and Blue","commenter_a":"An upside down flags indicates distress and with your country's (lack of) leadership.. You are in distress...","post_message":"Do you find PacSun's shirt that pictures an upside-down American flag disrespectful?"},{"comment_id":"10153677619074641","commenter_b":"Radicalism is one of the biggest problem for all countries and all societies. If you say radicalism or terrorism is related to a religion, it is completely wrong . You can see a lot of samples from history. The important point here is why radicalism has raised within last ten-twenty years. One of the answer of this question is imperializm. USA has raised terrorizm and radicalism on the world , africa, middeeast. ( Iraq, Libya invasion , bombing , killing more than 1 million people ) . USA has really created huge chaos in middleeast and destoyed Iraq. So ISIS has came up there . Terrorizm in middleeast is not religion issue . If USA and other countries had did same thing ( bombing , invasion, killing , creating chaos continuosly) at another part of the world during years, you would see similar terrorist groups there. So in order to ...","commenter_a":"Why ISIS hates France so much ? @webpagelink","post_message":"French President Hollande: 'We are at war -- a war against terrorism.'   More: @webpagelink"},{"comment_id":"10153285964496749","commenter_b":"White Americans are sexy","commenter_a":":P","post_message":"Add your name if you support the Clean Power Plan—the biggest step America has ever taken in the fight against climate change. @webpagelink"},{"comment_id":"10154161430028635","commenter_b":"Which is exactly why feminists aren't equalists, because they haven't dropped the privileged first-class citizenship baggage yet.","commenter_a":"My husband's previous wife took his son five states from him and the courts made him pay support without any effort to give the boy visits with his dad. That state is Indiana. The CP courts there are filthy with corrupt administrators.","post_message":"Teen applying for college finds out social security info don't match up and he was abducted as child"}]
