[{"comment_id":"965589516846855","commenter_b":"Rubbish. MUSLIMS are 90%terrorist","commenter_a":"If someone calls themselves a Christian and then goes and shoots people at a movie theatre, are you going to then say all Christians are bad? The thing is, all Muslims are not terrorists. My fiance is a Muslim his family are Muslim but they are not terrorists. Why should he have to wear a badge and be watched when he did absolutely nothing. Terrorists do not have a religion they don't have a 'look' anyone can be a terrorist and saying we should badge all Muslims is just plain hate.","post_message":"'Being Muslim doesn't make me any less American than you are,' she wrote in a letter to Donald J. Trump that's now gone viral."},{"comment_id":"10153478726962293","commenter_b":"Women don't drink beer?","commenter_a":"Cool, can they make beer tax free to even the score??","post_message":"'Basically we are being taxed for being women.'"},{"comment_id":"10155161723871037","commenter_b":"You are so gross ...","commenter_a":"States where mestizos who refuse to learn English because we made it possible to not have to learn English and tell them assimilation is bad, have horrendous scores.","post_message":"Number 1? Massachusetts."},{"comment_id":"928001893961910","commenter_b":"Thank you Rubio for all your hard work. God bless you and your family.","commenter_a":"NO RUBIO ND NO CRUZ.","post_message":"Marco Rubio is a friend and a colleague who ran an optimistic campaign focused on the future of our party, conservative principles, and uplifting the American people. The Republican primary was stronger because of the ideas he brought forth.   Marco’s story embodies the promise of our great nation. I know he will continue to be a champion for limitless opportunity in America, and I wish Marco, Jeanette, and their four kids the very best."},{"comment_id":"10153448946523984","commenter_b":"We have a process for people to come this country and become citizens. These illegals should should not be put ahead of the people who are doing it the legal way.","commenter_a":"I'm not a crook","post_message":"Barack Obama’s bad week just got even worse...  Are you glad to see this happen?"},{"comment_id":"10154179753088645","commenter_b":"Girl bye!!!","commenter_a":"She should be offended, he was trying to hook up with another woman while she was pregnant with his kid and during his apology he never said sorry to his wife.","post_message":"does not represent the man that I know, she added."},{"comment_id":"1330438396971266","commenter_b":"Better than the PUSSY approach you girls are doing","commenter_a":"What does Biden know he follows Obama.","post_message":"Biden took on Trump in a recent foreign policy speech, arguing that America doesn't need 'empty bluster,' or the 'insecurity of a bully.' What do you think of his comments?"}]
