[{"comment_id":"10155240272548132","commenter_b":"'@username go away","commenter_a":"4 beautiful and classy young women! All 4 parents should be proud!","post_message":"The Bush Sisters wrote a heartfelt letter to the Obama Girlsand it's really sweet. @webpagelink"},{"comment_id":"946663845429868","commenter_b":"One thing that is jumping out at me about this shooting in South Carolina is the way the community has come together, whites and blacks as ONE community. I look at this and than think back to Ferguson and Baltimore, what a difference. And yet so many times I have listened to liberals post on @username about the hateful, bigoted small minded people of the south. God Bless the people of Charleston and the families of the victims of this hateful crime.","commenter_a":"Hold on, those who love God will see you through, especially, those from that Church and all Churches that love the Lord Jesus Christ.","post_message":"“Oh my lord, he’s done made our life a living hell. What he did was unspeakable.”   -Carson Cowles, Dylan Roof's uncle"},{"comment_id":"1101655299855480","commenter_b":"Can't be bothered. This isn't science its novelty","commenter_a":"I'm skeptical. Tree rings are concentric not spiral. How would the needle track?","post_message":"Find out what tree rings sound like:"},{"comment_id":"10153982598576509","commenter_b":"Burn","commenter_a":"'@username Angel Castro @username Ivan Longoria noooooooohhhhhh!!!","post_message":"Some retailers are offering Caitlyn Jenner costumes for Halloween, but critics say these costumes mock the transgender community. What do you think? @webpagelink"},{"comment_id":"10154660299872501","commenter_b":"She can work anywhere in these United States.","commenter_a":"So she can be a lawyer not a judge cool.","post_message":"We reached out to Angela Stokes today to ask about her future legal plans. If she responds, we'll add her comments to the story."},{"comment_id":"10152906901509270","commenter_b":"Unreal !!! This makes me sick !!!","commenter_a":"It's just Wrong. Wanna bet the Commander in Chief authorized this crap..","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"523889751104313","commenter_b":"Ban muslims ? Better chance at banning tards first. Show me where islam justifies it. Quote the quran. If you have brain cells, lets discuss islamic facts.","commenter_a":"Where are the idiots who just a few hours ago were blaming gun laws for this? Where are they now?? Are they all shy and in hiding after it has been proven this was done by MUSLIM TERRORISTS? Muslim terrorists killed 150 people in Paris too, and they don't have the second amendment in France, how come??? #BanMuslimsNotGuns","post_message":"Authorities have named the two attackers suspected of carrying out the shootings before being killed themselves as Syed Rizwan Farook, 28, and Tashfeen Malik, 27."}]
