[{"comment_id":"10155066009203493","commenter_b":"Yes that's correct and he's taking out costs that we don't own and can start getting our capital to be spent on a structure that works for AMERICA. As opposed to all of these illegal aliens. No matter what the color of the skin is. I am a dual resident to California and Texas. California is beautiful to look at. The government and legislation there is literally nauseating. Whomever hasn't the ability to actually see the the chaos and the self destruction that the literalistic mentality creates is beyond a stupidity that I can even fathom. I got pulled over for tint on my windows. It cost me over $800 after it was said and done. And the levies are less than desirable. The roads are along the same avenue. However you can get on welfare there with ease and pay for nothing. Citizen or not. And the politicians and ...","commenter_a":"Jerry Springer, I mean Jerry Brown is wasting 3.5 BILLION of our money on a bullet train to nowhere , wake up people ! We are sinking ! Our next fight : MAKE CALIFORNIA GREAT AGAIN!!!!!!","post_message":"BREAKING NEWS: It's a storm so fierce, rescuers need rescuing as a firetruck falls into a massive crater. @webpagelink The frightening scene captured by our cameras on I-15 at the Cajon Pass as the freeway crumbles beneath the engine."},{"comment_id":"1487031254643822","commenter_b":"Stupid? Of course they are. These are the women that will vote for Hillary for one reason only. Because she's a woman.","commenter_a":"The stupidity of some Americans gas gotten it of hand. Grow up baby cakes.","post_message":"Sorry Wonder Woman, feminists hate you because you have big boobs."},{"comment_id":"10153837082186130","commenter_b":"Just like a woman - fickle and gossipy.","commenter_a":"I'd like to see a woman president too. The right woman president. Someone so awesome she makes everyone wonder why we waited so long for that woman. I don't think we've found that woman yet.","post_message":"It's not neccessarily an endorsement for Hillary Clinton, but..."},{"comment_id":"1128370543896366","commenter_b":"Girl quiet !!","commenter_a":"When I would sneak in food for you while you hid your pregnancy with jayden from my parents. Jacqueline Carranza 😂😂 #iGotChu","post_message":"Sibling goals!"},{"comment_id":"10155489129664657","commenter_b":"Not with a Republican Senate she isn't!","commenter_a":"as soon as these two women are no longer useful they will be out, they are pawns.","post_message":"Uh oh."},{"comment_id":"1606127946356954","commenter_b":"Plus did you see any of his hand movements it was crap","commenter_a":"Can you believe what he said in his tape tries to put it on Bill Clinton and Hillary he's such an ass","post_message":"Anyone even THINKING of voting for Trump needs to see this shocking video. Video by Occupy Democrats, LIKE our page for more."},{"comment_id":"936069706469980","commenter_b":"Colleen Boulden Jj Kane","commenter_a":"Ryan Lindgren take me here !","post_message":"Clark Griswold would be envious of this home on Prior Road in Wilmington, Delaware. The huge Christmas light display caught the attention of the SkyForce10 team while they were flying to another story. The set-up even has a walk-through section. Share your favorite lights displays with us here on Facebook or through the NBC10 app!"}]
