[{"comment_id":"10154755616704726","commenter_b":"53% of white women voted for TRUMP !!!!!","commenter_a":"They should have nominated an honest, personable candidate, and maybe, just maybe they could have won. Hillary was the very worst candidate, with way too much baggage. It had nothing to do with gender. Most women would have voted for a woman who had not lied and had not been under FBI investigation. Wikileaks showed just how dishonest her campaign was.","post_message":"Grieving Democrats and pundits point to gender bias as a culprit for Trump's win — but an October poll disproves them."},{"comment_id":"1720045178285132","commenter_b":"She didn't make it running for president what makes her think she can do it for VP","commenter_a":"SHUT UP","post_message":"Donald Trump would be \"shellacked\" in a general election showdown with Democrat Hillary Clinton, Carly Fiorina said after being named Ted Cruz's running mate."},{"comment_id":"10157151513605231","commenter_b":"Thank u god bless all of his children with love","commenter_a":"He had a dream and we are still dreaming and look how far that has got us police still killing us and now we helping them and everybody's out for themselves king would be shaking his head because we have sold out, we have become a consumer race of people for every other race but our on everybody makes money off of us just look around you where do you spend your black dollars ?","post_message":"On April 3, 1968, Dr. Martin Luther King, Jr. gave what would be his final and most recognized speech. On April 4, 1968, he was assassinated by a coward who doesn't even deserve to be named. Dr. King's contribution to the Civil Rights Movement and to the advancement of black people cannot be ignored. Thank you, Dr. King. \"Well, I don't know what will happen now. We've got some difficult days ahead. But it really doesn't matter with me now, because I've been to the mountaintop. And I don't mind. Like anybody, I would like to live a long life. Longevity has its place. But I'm not concerned about that now. I just want to do God's will. And He's allowed me to go up to the mountain. And I've looked over. And I've seen the Promised Land. I may not get there with you. But I want you to ..."},{"comment_id":"1201903546502686","commenter_b":"No way, he works at Wal Mart today. He made something of himself.","commenter_a":"Is she related to the banjo player in \"Deliverance\"???? Same eyes!","post_message":"It’s a shame, but I guess we shouldn’t be surprised by Hillary Clinton’s attempt to politicize another tragedy to advance an anti-gun agenda. As this analysis rightly points out, Oregon has some of the strictest gun laws on the books, and none of these proposed new laws would have stopped these awful shootings in the first place. We all want to stop these senseless tragedies, but using them to push unconstitutional, unrealistic, and ineffective new laws in order to win favor on the left isn’t going to help. I’m a gun owner myself, and I strongly value the rights guaranteed in the Second Amendment. The overwhelming majority of gun owners are law-abiding citizens who strictly follow all applicable state and local regulations. I will oppose any effort to take away the rights of law-abiding American citizens to own firearms."},{"comment_id":"522124781280810","commenter_b":"And a thug!!!","commenter_a":"He's a terrorist.","post_message":"Police say they \"don't have any information on this individual's mentality, or his ideas or ideology.\""},{"comment_id":"10152804036658145","commenter_b":"I disagree... there are less and less males signing up to become priests ...Ireland of all places had 1 ..yes that is right 1 ordained priest last year...they either open the doors to the females soon or people will have to do their own masses...","commenter_a":"I kind of believe this Pope Francis might be very welcoming to having female priests...Congrats on reaching your life long dream...","post_message":"CORRECTION: While the woman was ordained through a non-denominational church, and she considers herself Catholic, the Catholic Diocese has not responded to WFTV's story and she has not been ordained by the Catholic Church. Rita Lucey says she faces excommunication from the Catholic Church, but would rather fulfill her lifelong dream of becoming a priest."},{"comment_id":"779121095562429","commenter_b":"You are so clueless.","commenter_a":"Sadly, his supporters will never watch this video. They are in utter denial. All they care about is his promise to stop immigration of Muslims and Mexicans and to keep white privilege in place. There are a lot of bigots/racists out there.","post_message":"Donald J. Trump has said a lot of things. Mike Pence said he didn’t say those things. He did. Here’s proof."}]
