[{"comment_id":"10152732275938645","commenter_b":"fat a** hoe.","commenter_a":"Report me all you want trick","post_message":"The victim said the attacker threatened her during the rape, saying he knew where she lived and would return to kill her if she called the police."},{"comment_id":"1000554689985003","commenter_b":"I also work in the water industry and watched this guys demonstration. What a bunch of BS on several accounts. First my information comes from the following website: Water Encyclopedia - Ogallala Aquifer. According to this site the average depth of the Aquifer he is referring to is between 60 to 200 feet. Some sections of this Aquifer is over 1000 feet deep. Anyone that understands anything about water understands ground filtration. This particular Aquifer happens to be receiving it's water from snow and rain run off from the Rocky mountains. Fracking or not is very very unlikely to have any effect on the quality of water in his state. True fracking does use water in it's process - untrue it does not simply dump untreated water back into the Aquifer. This guy's demonstration is about as truthful as someone video taping a moose pissing on a snow bank in ...","commenter_a":"yup......and one 'spill' accidently of course.......stop this madness!","post_message":"It's simple, really. If this is what you're willing to do to the water, you should be willing to drink it. These committee members weren't."},{"comment_id":"10153463508245950","commenter_b":"'@username thats your opinion, but if she makes president, guess what....WERE FUCKED even more!!!!","commenter_a":"I'm not a Clinton supporter, but well said. Hillary's maturity and eloquence are refreshing after listening to Trump and the rest of the GOP schoolyard clamor.","post_message":"Donald J. Trump has 'incited this violence over months,' Hillary Clinton says; watch the Democratic candidate's interview with Nancy Cordes: @webpagelink"},{"comment_id":"10154720750937235","commenter_b":"Michael M you r an ass hole !!! No one cares what you think !! You r ugly and evil with no soul just like Hillary !!! You and Meghan r made for each other !!! You r a disturbed individual !! Making fun of hard working people struggling because of Obamas policies !!!. We all should boycott. All your crap . I will . Those hard working people paid to see your movies ! Thats how u got rich !! Thanks to the deplorable's. You 😤😤ASSHOLE !!","commenter_a":"Michael Moore will do anything for media attention and money.","post_message":"You've no doubt seen folks in your Facebook feed who believe Michael Moore is making the case for Trump.   That is a LIE."},{"comment_id":"10150671719984999","commenter_b":"Any idea the amount of time it takes to pluck the gorilla hairs off her body and face?","commenter_a":"Exquisite and Gorgeous..","post_message":"Michelle Obama has often made a point of wearing gowns by designers whose backgrounds and cultures reflect the countries being honored at state dinners.  Friday night was no exception. @webpagelink  Photos, clockwise from top: Jim Watson/AFP — Getty Images; Mark Wilson/Getty Images; Luke Sharrett for NYT"},{"comment_id":"1157488834340407","commenter_b":"I thought she was leaving. No one cares what she says","commenter_a":"She lies as much as killery","post_message":"Miley Cyrus, a Hillary Clinton supporter, is extremely sad."},{"comment_id":"10152817094974877","commenter_b":"I agree zimmerman was guilty as -ell. But this woman is even more guilty if you research her case. I feel sorry for the next man she meets. She'll kill the next one for sure.","commenter_a":"This is crap! This woman should be allowed to live her life....she didn't take a life...meanwhile George Zimmerman roams free! This is why it is important, people, to vote - local elections affect you more than national elections....VOTE, VOTE, VOTE!","post_message":"Marissa Alexander is officially a free woman, delivers powerful statement to reporters. Read the details of her release below.  Grio fam, will Alexander's case inspire more changes to Florida law?"}]
