[{"comment_id":"905767619489994","commenter_b":"Yeah...I gotta BITCH with a BITCH that like BITCHES!!! LMAO 😂 😂 😂","commenter_a":"@username @username lmao I'm dead 😂😂💀 the comments","post_message":"When your ex asks about getting back together"},{"comment_id":"10152899242557144","commenter_b":"Illegals Charlotte, illegals.","commenter_a":"\"We\" need to take care of our country first. We still have veterans dyeing before they get an appointment. Don't tell me about Mexicans.","post_message":"Wow."},{"comment_id":"1413445192014321","commenter_b":"You girls are funny!","commenter_a":"Come on! This is his ploy to try and intimidate Clinton and throw her off her game. Who's he going to announce next? Monica Lewinsky as Secretary of State??","post_message":"This couldn't be worse."},{"comment_id":"597418893776211","commenter_b":"@username Jill stein is a communist and belongs in jail for vandalizing construction vehicles at standing rock and she's crazy","commenter_a":"Bernie needs to take a young politician under his wing and mentor them so one or two elections down the road the only politician in america with a moral bone in their body isn't pushing 90.","post_message":"Mr. Trump, you told working people you were on their side. You know what? Millions of us are going to demand you keep your promise."},{"comment_id":"10154128932095579","commenter_b":"Domestic terrorists! Red neck spoiled Yahoo's, not patriots by any means.","commenter_a":"When I think of \"Terrorists\" I think of malicious intent to do harm\". When I think of \"Domestic Terrorists\" I think of the same, but the suspect/aggressor is from within. A \"rotten apple in the barrel\", if you will. When I think of patriots fighting for principles as defined by the Constitution, I think of statements like the ones that these people are making in Burns. I'm not saying that what is going on here is right, warranted, and just, but I am saying that (if their story is true) then we absolutely need be paying attention and asking 'why would the Fed Gov need to use strong arm, mafioso tactics to squeeze/coerce people of of their own lands'', and why are we allowing them to get away with it'? Take a close look at the mission statements of the Sierra club, Agenda 21, etc. Then go look your grand ...","post_message":"Rep. Greg Walden (R-OR) spoke on the House floor for over 24 minutes on the armed standoff in Oregon. Here is the closing 5 minutes of his remarks. Watch the complete video of his remarks here: @webpagelink"},{"comment_id":"10153606515353132","commenter_b":"She was annoying to watch.","commenter_a":"Brandi was the only person who made the show entertaining #BadMoveBravo","post_message":"Will you miss Brandi on The Real Housewives of Beverly Hills?"},{"comment_id":"712497285538613","commenter_b":"Islamists radicals are killing muslims every day in irak, syria etc! Its about thousand and thousand and for no reason! Israel, when attacked, its only to defend itself! As any country would do!","commenter_a":"Jewish extremists burned a kid alive too. Just stating a simple fact.","post_message":"Netanyahu: ISIS burns people alive, Iran hangs them in city squares"}]
