[{"comment_id":"10152814040437293","commenter_b":"Especially among Liberals.","commenter_a":"It's not a surprise that Fox 'Faux' news should top the polls as the most trusted because most people (sheeples) are obviously dumb because common sense isn't in fact that common.","post_message":"Even among independents."},{"comment_id":"10156725914675093","commenter_b":"Trump gonna go all the way...There's no stopping the Trump Train!","commenter_a":"I really like watching all you rpublicans running in circles..HA...HA....HA HA!!","post_message":"Other Republicans say we should protect the Constitution. Ted Cruz has actually done it; indeed, it has been the animating passion of his career. Read the full editorial in the link & vote in our poll at the end!"},{"comment_id":"1506151063011899","commenter_b":"REAL AMERICANS guns will only be taken over their dead bodies.","commenter_a":"Let's see, how many honest, law abiding gun owners, did not commit a crime with a gun, yesterday. Or ever, for that matter. If the government takes your guns, the next thing that they will take, is you.","post_message":"Exploiting tragedy while surrounded by ARMED guards. Hypocrisy much, Obama?"},{"comment_id":"737985369668440","commenter_b":"Madwoman as bad as Obama, she must be Satan's tool...","commenter_a":"Angel of death!","post_message":"By BI\" She wants to recruit even more African and Balkan Muslims to fill positions as doctors and electrical engineers. Notice the stunned looks on the people who are listening to this rubbish. @webpagelink"},{"comment_id":"907515899315838","commenter_b":"Thought it was Vermont?","commenter_a":"And yet the latest FBI Uniform Crime Report shows that Maine is the safest state in the US. Hmmm...Coincidence?","post_message":"They're quarantining themselves!"},{"comment_id":"10153681462888984","commenter_b":"Let's have a face to face.","commenter_a":"I am, and I have always liked her because she is honest!!","post_message":"Sarah Palin just put something on Facebook that immediately went viral... this image is exactly what Hillary didn't want America to see. Palin is never scared to tell it like it is... we should be grateful for her courage and patriotism."},{"comment_id":"10152774797039877","commenter_b":"She still in hot water","commenter_a":"So wait a min. Im from cleveland lol. So this boy was 5'7 195 lbs bundled up pointing a fake gun at people in the park with his little sister..... Yea the cops did not have to kill him but no one thinks the parenting is to blame ??","post_message":"Extended Tamir Rice Video Shows Cop Tackle His 14-Yr-Old Sister As She Rushed To Her Dying Little Brother's Aid. Watch the heartbreaking video here. Grio fam, sound off with your thoughts on this extended video."}]
