[{"comment_id":"1032254556867364","commenter_b":"I wonder if she was addicted to the same drugs smuggled across the Mexican border due to our insufficient border protection... #TRUMP16","commenter_a":"Oh Chelsea, what a story you have now, and a calling for the rest of your life... Nobody can tell the story you have to tell now!!! Hold on to that sobriety and to God, one day at a time... I love this... And love how well Hillary listens... #ImWithHer !!!!!! Sobriety means EVERYTHING!!!!! The best thing, of course, is to never even START drugs....","post_message":"\"I started doing drugs when I was 12 years old. At 15, I was doing anything I could really get my hands on.\" Substance abuse and drug addiction hurt our kids, friends, neighbors, and loved ones. We've got to solve this."},{"comment_id":"10153778379533984","commenter_b":"They are disgusting!","commenter_a":"Cancel it immediately!","post_message":"If you thought the controversial comments that were made on air by 'The View' co-hosts were bad, wait till you see what was reportedly said backstage... What do you think of 'The View'? Have they gone too far this time?"},{"comment_id":"900759883386314","commenter_b":"Hillary's supporters don't care that she's a sold-out Wall Street neocon. It's weird.","commenter_a":"She is the ONLY person on earth to know how it felt to take that place in history........glad she was the one who knew how to really cherish it for all of us... thanks Hillary... Girl, you rock!","post_message":"When history's in the making, sleep can wait."},{"comment_id":"10156317776015354","commenter_b":"Stupid ass!!!!","commenter_a":"Sounds like a plan to me.","post_message":"“No surprise that someone who makes a living glorifying crime and violence is a cop-hater, too.” MORE..."},{"comment_id":"10153196622799753","commenter_b":"FUCK U CUNT.......","commenter_a":"She committed suicide now let it go.","post_message":"Do you think Sandra Bland was murdered?"},{"comment_id":"10154399971344087","commenter_b":"@username u one sick bitch","commenter_a":"Obama was basically a community activist turned president. No real domestic and certainly no foreign experience at all. Except maybe he was born in another country. With that said, trump is much better prepared day 1 than obama ever was.","post_message":"\"It is a source of great concern that our country is now in the hands of someone who seems to lack an ability to weigh the consequences of domestic and foreign policy decisions where great risks abound.\""},{"comment_id":"10154080065336051","commenter_b":"@username you just piss yourself when you see women.","commenter_a":"The \"man\" isn't qualified to even be mentioned for the job. Donald J Trump is a complete and utter embarrassment to our already great nation","post_message":"The majority of Americans say that Trump is not qualified for the presidency. Do you agree?"}]
