[{"comment_id":"10154351539851336","commenter_b":"The fact that this women he raped was not aware of what was going to happen to her! makes him a horrible rapist!! even if she was drunk!! the same thing happens when a doctor rapes a women after they been under anesthesia and an adult raping a child is just as bad!! this young adult knew what he was doing, and now practically gets a pat on the back! by his ather and the Judge!! telling him yeah it's okay, you did nothing wrong let's just give you 6 months in jail so that we can get the media and people off our backs!! high five son!! you got my back and I got yours!! how disgusting and bad education coming from his parent!! this world is small and one day he will have a kids one day of his own, he better pray that your babies never ever ...","commenter_a":"I haven't looked at this in detail. No one should have an opinion about this until you look into it yourself. I don't go by what the media says, neither should anyone. Judge not less ye be judged. So if you haven't looked at this in detail, yourself, you can't possibly know the truth.","post_message":"Pastor John Pavlovitz wrote a powerful open letter to the Stanford University rapist's father, who said his son was paying \"a steep price...for 20 minutes of action.\""},{"comment_id":"1570942919862279","commenter_b":"@username how about keeping your dick in your pants if all you men are going to do is walk away.....","commenter_a":"58 million human babies have been victims of abortion in the past 43 years since Roe vs Wade legalized abortion through all 9 months of pregnancy. Science has proven that life begins at conception. Social injustices continue such as poverty, hunger, underemployment, and child abuse has actually increased. Killing innocent life has not and will not solve these problems. Women and men suffer terrible regret for a decision that can never be reversed. They need real help and healing. The website hopeafterabortion.com offers loving help to post abortive women. Prolife Pregnancy Care Centers offer free nonjudgmental, loving support whether a woman decides to give birth or abort. So many women have been exploited and even died due to abortion. Abortionists get rich killing babies. Planned parenthood is the largest abortion provider in the United States. They do not provide any prenatal care or even mammograms. None of their services are ...","post_message":"\"Only when America chooses, remembers, and restores her respect for life will we rediscover our moral bearings and truly find our way,\" Rand Paul said."},{"comment_id":"1744094332472035","commenter_b":"You fix it by following the laws already on the books and securing the borders. Start deporting anyone here illegally and fine businesses that are hiring them. When they see there's no work for them and we are serious about catching and deporting them most will pick up and leave.","commenter_a":"That's a real question but few are willing to answer without being labeled a bigot or racist. The immigration problem is very real and here is a clear example of how the illegal community drains resources for American citizens.","post_message":"During a heated exchange, Tucker Carlson asked immigration activist Jose Antonio Vargas if it’s fair for illegal immigrants to take coveted scholarships from American citizens. @webpagelink"},{"comment_id":"10153488237764087","commenter_b":"Her looks are irrelevant to the fact that Trump is a punk ass bitch and his supporters leave slime trails.","commenter_a":"I have a challenge for Megyn. How about she show up at the debate wearing ZERO MAKEUP, so she shows her true self and not the all painted up deceptive image of who Megyn Kelly really is. Come on Megyn, quit hiding behind that makeup paint.","post_message":"\"As I've said before, I would rather set myself on fire in front of the Fox News studio than go on the debate stage with [Megyn Kelly],\" Morning Joe's Joe Scarborough said."},{"comment_id":"10152965778679641","commenter_b":"Nigeria should not only recall her ambassador but,should ask all indonesians to leave within 7days. Including \"INDOMIE NOODLES\" A Nigerians should stop patrpnizing INDOMIE NOODLES and anything associated with Indonesia","commenter_a":"I guess you better think twice before messing with illegal drugs in Indonesia.","post_message":"Indonesia executes six people, including five foreign nationals, by firing squad; Brazil and the Netherlands recall their ambassadors in response. @webpagelink"},{"comment_id":"10152957013791336","commenter_b":"It's NOT HEALTHY to break into their homes or rob them or attempt To hurt their families......","commenter_a":"Why are all Americans so obsessed with guns, it's not healthy.","post_message":"Bonnie and Clyde's infamous pistols of choice — What are they worth? Find out tonight at 8:30p ET on Fox News Channel. (via Strange Inheritance)"},{"comment_id":"10153379026314205","commenter_b":"Seriously , I don't know how these fraudsters were able to deceive their unsuspecting poor followers. Acquiring jets and planes at their expense. This is exploitation. The worst is that , it is these followers of them that will come and defend them. So sad indeed.","commenter_a":"I posted that video a few weeks ago. Shameless. I'm bustin' a gut. Hee, hee","post_message":"Televangelists: God Says We Need Another Private Jet!"}]
