[{"comment_id":"1315269151829205","commenter_b":"Somebody need to give this Scum, a History lesson !","commenter_a":"This idiot is truly deranged.","post_message":"White nationalist Richard Spencer held a conference in support of Donald J. Trump and claimed that America belongs to white men.   1,000 protesters met him outside."},{"comment_id":"1284514134973476","commenter_b":"CJ 😂","commenter_a":"Eric Sylvain 😂😂","post_message":"It really be like that  #WSHH"},{"comment_id":"10153698259961320","commenter_b":"She's the devil in disguise.","commenter_a":"She doesn't have to worry about any boyfriend and hopefully for a long time!","post_message":"What a horrible human being.  Authorities have released text messages that allegedly detail how 18-year-old Michelle Carter texted her boyfriend, Conrad Roy III encouraging him to commit suicide. Read what she said: @webpagelink"},{"comment_id":"927123483991626","commenter_b":"Oprah is a racist","commenter_a":"Yes !!","post_message":"Oprah threatens anyone who opposes Obama.  Get that liberal trash off of TV.  Do you think Oprah is the racist?"},{"comment_id":"486035008253746","commenter_b":"Cover her ugly ass back up. Been eating too many Chitterlings","commenter_a":"Cover her face??","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"10154005509605575","commenter_b":"Go back to Canada you slimy rat","commenter_a":"THIS IS THE MAN THAT HELPED DEVELOPE NAFTA FOR THE BUSH'S IN ORDER THAT WE WILL HAVE OPEN BORDERS","post_message":"Trump blasts Natural born Canadian Ted Cruz..."},{"comment_id":"1081030328612686","commenter_b":"Go bang your mother with a mace","commenter_a":"All you people saying taxation is theft are such complete morons. Taxation is a membership fee to live in the USA where we have benefits that greatly outweigh the cost. Why don't you renounce your citizenship and gtfo out of the USA and move to Antarctica if you don't want to be taxed. Bunch of unpatriotic pieces of human garbage in here.","post_message":"Wouldn’t it be great if you could refuse to pay your taxes until you decided your tax rate was “fair”?"}]
