[{"comment_id":"614623428725949","commenter_b":"Should of shot the bitches in the fu$king faces, enough of this shit with these animals","commenter_a":"They are racist.","post_message":"Burqa-Clad Muslims Sue For “Racist” Treatment… Get a RUDE Wake Up Call"},{"comment_id":"796446703862614","commenter_b":"#NoBanNoWall because imigrants, Muslims and refugees are #HeretoStay","commenter_a":"Please Senator, stay strong and resist. Use your resources to unite the Democrats and fight this atrocity! Fight for what is right, just, Truly American.","post_message":"As a child, I witnessed the refugee crisis borne out of people fleeing the Khmer Rouge and Pathet Lao in Southeast Asia with my own eyes. I’m proud that our nation acted during that crisis to take in refugees, but I remain motivated by the knowledge that we could have done much, much more. The Statue of Liberty isn’t engraved with do not enter signs, it is proudly emblazoned with ‘give me your tired, your poor, your huddled masses yearning to be free.’ This is a quintessential American value and though we’ve not always lived up to our ideals, the President would do well to remember that we cannot afford to turn our backs on them, especially today—Holocaust Remembrance Day.   We are a nation that leads with strength—a nation that knows ‘the only thing we have to fear is fear itself’—not a nation that cowers in fear when faced with difficult choices. The America that I know is not one that slams its doors on families and children fleeing barbarism and terror, but one that shines brightly as a beacon of hope for all human beings. Giving in to our fears, as the President has done, is not the action of a strong country. Today’s order will ultimately serve to weaken our own national security, playing into our enemy’s hands and helping convince another generation of young people simply seeking safety that America is at war with them."},{"comment_id":"10153891408869062","commenter_b":"Yeah","commenter_a":"Waiting on PA","post_message":"JUST IN: The Texas House Committee approved a bill to make marijuana legal for adults. It still has a long way to go before becoming law, but what do you think?"},{"comment_id":"10157089622540206","commenter_b":"White woman","commenter_a":"'@username racism at it's finest","post_message":"“Because we aren’t whitewashed enough in Hollywood, apparently,” BET tweeted."},{"comment_id":"10154256296041130","commenter_b":"is she for Citizens United? how about the ACA? How about Roe v. Wade, what's her position there? Now compare Republican's position on these...","commenter_a":"Only further proving that Hilary is a Republican, but delusional liberals will still vote for her","post_message":"'This is not a traditional race, and these are not traditional times.'"},{"comment_id":"10153049017301323","commenter_b":"Leave her alone, can't we just all be pleased that Andy is through to the final. There were very tense moments in the match!","commenter_a":"Stone her","post_message":"F is for ferociously supportive, amongst other things.  What was Kim Sears saying to Andy Murray's opponent at the Australian Open?"},{"comment_id":"859150960886345","commenter_b":"You weren't forced to come either bitch!","commenter_a":"It kills me that someone who is not even from America can say such racist crap @username. Just remember or learn about the history of slavery and the continued discrimination today from immigrants like you who wasn't forced on a boat to come here. It's because of African Americans you have the freedoms you have today. Please don't comment on something you know nothing about and actually learn about the injustices African American people are facing today. You sound just like these ignorant people who always got something to say behind closed doors. I guess you wouldn't know about white supremacy because you've bought in to this bs white people have taught you in America. I guess all the killings by white police is something new. You have no idea what it's like to be black and to get even immigrants being racist towards you the same immigrants Martin Luther ...","post_message":"The Debt Collection Industry Is the Epitome of Systematic Racism"}]
