[{"comment_id":"10153349843651051","commenter_b":"She's a stupid bitch","commenter_a":"Aunt Jen, your a money hungry twat.","post_message":"This aunt is suing her 12-year-old nephew for $127,000 over a hug."},{"comment_id":"1598147256865554","commenter_b":"She is such a pig , I can't stomach her !!!","commenter_a":"You sound \"Off Your Rocker\" !!! A lot of you are talking and showing signs that are vulgar and disgusting! My mother always said that a person shows their ignorance by what they say and do! Seems like a lot of ignorant women were there today!","post_message":"Remember when Michelle Obama said \"when they go low, we go high\"? Neither does Ashley Judd ===>"},{"comment_id":"1226253117412922","commenter_b":"White peoples God George Soros funds these riots !","commenter_a":"If there is any one in the car, it is also attempted murder, and MUST be prosecuted.","post_message":"Nails it!"},{"comment_id":"860854230637940","commenter_b":"Of course she will say that. She wants slobamas endorsement.","commenter_a":"kick her ass out of the US too","post_message":""},{"comment_id":"10156034180320389","commenter_b":"He is a crybaby and moron. I used to watch him until he started with the crocodile tears and he looked so pathetic. The media should report news and not shove their opinions on anyone. If he hates Trump, that's his opinion and he should not voice it on the air","commenter_a":"It's crazy how Trump fans treat those who disagree with them. Many Megan Kelly fans and Beck fans threw a fit that someone didn't believe as they did about Trump. Is this how we treat each other? Drop people like a rock when they disagree with us? Start name calling? Sean answered Beck honestly and with class. Which is more than most of you are doing. I have great respect for Beck AND Hannity. Even if I don't always agree with them. But after years of following Glen Beck- it's clear that nothing drives him more than a love for this country.","post_message":"My response to Glenn Beck who criticized me earlier this week for supporting Donald Trump."},{"comment_id":"742531822604062","commenter_b":"PLEASE PUT HIS ASS IN IT","commenter_a":"All this shit is posted and nothing is ever going to happen to this goat fucker or his bestie Hillary Clinton","post_message":"Obama Caught In Major Lie - This Could Be The Nail In The Coffin [VIDEO] He cannot be trusted. End his term early. Do you want a president who will tell the truth?"},{"comment_id":"1269429443084021","commenter_b":"I prefer the lady in the center.","commenter_a":"I bet I can tell you which one sells the most copies haha.","post_message":"For the first time ever, there are three different Sports Illustrated Swimsuit covers – representing women of all shapes and sizes. @webpagelink"}]
