[{"comment_id":"1037048666341760","commenter_b":"Cherokee Hinrichs quickly and painlessly?? Maybe for the one having the abortion, but the living baby that's being killed feels it!! Your another disqusing excuse for a woman!! Be ready for your judgement day, God will sent you straight to hell along with all the other disgusting women who kill babies!!","commenter_a":"Stop the madness. Repeal Roe v Wade. It is a choice. Choose life.","post_message":"Real doctors protect the Sanctity of Human Life!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb179"},{"comment_id":"912633472136742","commenter_b":"She probley doing wat she was raised watching het monster mother do... it's disgusting how she was beating het child like she was beating a street bitch... she ain't shit,!!!","commenter_a":"Alan Connell","post_message":"Mom Beats Her Daughter In Broad Daylight For Sucking D!"},{"comment_id":"10154087182591409","commenter_b":"@username Michelle had to keep her legs closed or her dick would fall out!","commenter_a":"Lisa erikson just because Hillary hasn't been charged and found guilty doesn't mean she's not. She's a liar and as crooked as Obama and Michelle on many levels. Keep lying to yourself.","post_message":""},{"comment_id":"10153716144117577","commenter_b":"Your talking bullshit.","commenter_a":"I am an athiest so it's all bullshit to me anyway ... but you god nuts hate the pope because he is too close to what (if he did exist) christ would have been like .. do you not remember the part in the bible where jesus said \"there is more chance of a camel passing through the eye of a needle than a rich man getting into heavn\"? .. what about his whole ghandi/ john lennon peaceful hippiness .. \"let he who is without sin cast the first stone? .. and what about how jesus spent a lot of time hanging out with the poor, sick and prostitutes .. and he fed them and helped them .., some of you extreme conservative \"christian\" extremist terrorist CUNTS should actually read your bibles once in a while ... O and by the way ... if you are a good \"christian\" why ...","post_message":"Pope Francis has strong ties to socialism and even communism and is helping to destroy the faith of the Catholic Church from within, as Infowars journalist Kit Daniels explains."},{"comment_id":"633829223459429","commenter_b":"Stupid stupid girl , the more she talks the dumber she is .","commenter_a":"Do they have no parents","post_message":"From American AF - AAF Nation...This is what's wrong with society TODAY!!"},{"comment_id":"10153721482309641","commenter_b":"Rap Artists RToy : Here it is the good part of Qur'an 5: 32 Qur: Whoever kills an innocent person it is as if he has killed all of humanity","commenter_a":"Quran (5:33) - \"The punishment of those who wage war against Allah and His messenger and strive to make mischief in the land is only this, that they should be murdered or crucified or their hands and their feet should be cut off on opposite sides or they should be imprisoned; this shall be as a disgrace for them in this world, and in the hereafter they shall have a grievous chastisement\" Quran (8:12) - \"I will cast terror into the hearts of those who disbelieve. Therefore strike off their heads and strike off every fingertip of them\" No reasonable person would interpret this to mean a spiritual struggle. Quran (8:15) - \"O ye who believe! When ye meet those who disbelieve in battle, turn not your backs to them. (16)Whoso on that day turneth his back to them, unless maneuvering for battle or intent to join a company, he ...","post_message":"\"I think he damaged all his brands in all Muslim countries.\""},{"comment_id":"1273278439392985","commenter_b":"This is what the feminist want for women in America","commenter_a":"Very sad! But the good part is that she is a martyr and spends eternity with our God of pure Love!","post_message":"GRUESOME VIDEO: Muslim Mob Tears 27 Year Old Woman Apart Before Killing Her Over False Accusation Of Burning Quran  This horrific \"honor killing\" was caught on video and published by the New York Times. It took place in Afghanistan…These are NOT terrorists. They are just a mob of local Muslim men administering \"justice\" to a woman who was unjustly accused of burning a Quran. ***WARNING***Video is very graphic!"}]
