[{"comment_id":"1326722587387039","commenter_b":"Lock her up!","commenter_a":"These people man!","post_message":"Guess what her alias is..."},{"comment_id":"1093462474008096","commenter_b":"Yeah, please do?^","commenter_a":"They are more worried about bringing extinct animals but not help animals that are close to extinction. (rhino, tigers, wolf's, ect)","post_message":"Woolly mammoth genome has been decoded."},{"comment_id":"956693264446697","commenter_b":"If my 2 daughters were still in school now and this begins I would not send them to public school it would be private or at home its just not safe, I don't have a problem with transgender boys don't belong in giur!s bathrooms and visa versa","commenter_a":"Wow..that's a big problem..!..put a extra bathroom in for Transgender..simple..problem solved..","post_message":"President Obama recently said all public schools must allow transgender students to use the bathroom of their choice. Let us know your thoughts below:"},{"comment_id":"950004335054969","commenter_b":"She loves him..get over it!","commenter_a":"I sure hope he makes a full recovery, not only for his kids and himself, so that gold digging piece of garbage he is still legally married to cannot get a dime of his money. It is disgusting how she is sitting at his bedside just waiting on him to die because everyone knows she does not give a crap about him. The Kardashians are a cancer that needs to be eradicated.","post_message":"#PrayForLamar Lamar Odom gives his family and friends a sign of hope after awaking from a coma. The gesture is sure to warm your heart. Meanwhile, Lisa Morales, the mother of his two children speaks out on Odom’s early improvements. FOR THE LATEST ----> @webpagelink"},{"comment_id":"1223203257706743","commenter_b":"But hey lets bring in refugees... and keep illegals... It is good for America according ot Liberals and Democrats","commenter_a":"I agree with them. Shame on Disney.","post_message":"23 former IT employees at Disney are preparing to fight back..."},{"comment_id":"967744473282082","commenter_b":"Hillary, american people need your talented and exposure,","commenter_a":"Hillary, is key to solving, american problems,","post_message":"What we’ve seen too much of in the last few years is a spate of people who have reached for a gun before they really figured out what was going on. They’ve been much too eager to use that gun—we’ve seen it with policing and we’ve seen it with civilians. With police, first and foremost, they need to be trained and held accountable and disciplined in a way that prevents the reaction that we’ve seen way too much of. And with civilians—a lot of these “stand your ground” laws need to be rewritten. If you have to defend yourself, OK. But look at some of the instances we’ve had—Trayvon Martin, and too many more. Nobody should want to create circumstances in which innocent, unarmed people are killed—either by law enforcement or by civilians wielding guns. We’ve got to figure out how to deal with that."},{"comment_id":"10154744706316729","commenter_b":"It's the violent felons and lunatics the legislation is trying to keep the guns away from by closing the loopholes on gun sales. As long as background checks can be skirted, the criminals and mentally ill can buy them at gun shows (in some states but no one checks at state lines!) and over the Internet (easier than you think!). You, being an upstanding citizen of sound mind, are welcome to keep and buy guns.","commenter_a":"But but Hillary and oboozo with their constant armed guards say we don't need to or have a right to defend ourselves when the violent lunatics they want to let out of prison come busting down our doors.","post_message":""}]
