[{"comment_id":"1118742268187889","commenter_b":"ISLAM AND SHARIA LAW SHOULD BE BANNED FROM AMERICA PERIOD! THE MEMBERS OF THE OBAMA ADMINISTRATION NEED TO ALL BE REMOVED BY CONGRESS FOR TRYING TO TAKE OVER AMERICA THROUGH ISLAMIC RELIGION! PEOPLE LIKE OBAMA, HILLARY, LYNCH, HOLDER, GARLAND ARE ALL WORKING TO FORCE ISLAMIC BS UPON THIS COUNTRY! WE HAVE SECRETLY BEEN INVADED BY THESE POS TRAITORS AIMING TO BRING DOWN THE U.S. THROUGH ISLAM!","commenter_a":"finally a State with some b---s","post_message":"CELEBRATE!! VICTORY! South Carolina House Passes Bill Excluding Sharia Law From State Courts! THEY TOLD MUSLIMS HELL NO!"},{"comment_id":"10156085666465354","commenter_b":"@username Nah ..shes a Wanna be Black!!","commenter_a":"Why are these F*%^ ers not being hunted down, arrested and prosecuted as the 60's radicals were? Why do we even have an FBI????","post_message":"“The revolution is on…Off the pigs.”"},{"comment_id":"1069162493180002","commenter_b":"Black LIES Matter!","commenter_a":"Life is what you make it....if you obey the laws and live a clean life none of this would happen....put the blame where it belongs.","post_message":"\"The idea that there are tensions between police and particularly black youth is something that kind of went without saying.\""},{"comment_id":"1148538801848206","commenter_b":"Get well soon.","commenter_a":"That was an amazing thing he did. He is too be commended. Oorah","post_message":"BREAKING NEWS"},{"comment_id":"745823678941543","commenter_b":"get her out","commenter_a":"Bye dumbass!","post_message":"Whoopi Goldberg To Leave The Country For THIS Awesome Reason It's about time. We don't want you here anyway. Can we get 30,000 'LIKES' to have Whoopi leave the country?"},{"comment_id":"1738569013030719","commenter_b":"Hoe","commenter_a":"Alex Keira Keir Craig","post_message":"I'm gonna make love in this Snapstory with you, Usher."},{"comment_id":"10155205840346337","commenter_b":"@username illegals work every job of the spectrum not just in the fields.","commenter_a":"So these restaurants openly hire illegal workers,,,,hmmmm.","post_message":"American eateries will be shutting down to show solidarity with immigrant workers."}]
