[{"comment_id":"10152715320866636","commenter_b":"Bc she is a twat!","commenter_a":"But how is this possible? Our esteemed governor immediately came back with, \"Nope, can't afford it,\" when the idea of building storm shelters for the schools was put before her...","post_message":"When an E-F 3 tornado passed dangerously close to El Reno Schools, the district took steps to ensure that if it ever happens again, students and staff will be safe."},{"comment_id":"10152526898447623","commenter_b":"No. The statue was in HONOR of our fallen heroes. You are a disgrace.","commenter_a":"King should be ashamed. ..","post_message":"The kneeling soldier statue will be removed from the King Veteran’s Memorial after Tuesday night's city council meeting."},{"comment_id":"10155648404180354","commenter_b":"Fire the bitch.","commenter_a":"He wasn't rude, she just didn't want to answer his question! She made a very bad decision and now she doesn't want to face the consequences of her stupidity.","post_message":"What do you think? Was the reporter being rude?"},{"comment_id":"458263531022194","commenter_b":"I sure don't consider Ann Coulter a Patriot! She is a vile and hate spewing!","commenter_a":"What an ass!","post_message":"Even for Coulter this is outrageous."},{"comment_id":"470911213097172","commenter_b":"Muslims offend me, so I want Muslims banned from America.","commenter_a":"Your face being covered offends me.","post_message":""},{"comment_id":"10154315699286509","commenter_b":"No laws were broken She just happened to cross paths with a power hungry pig","commenter_a":"She also wouldn't have been in police custody if she were a law abiding citizen","post_message":"Bernie Sanders said that Sandra Bland wouldn't have died in police custody \"if she were a white woman.\""},{"comment_id":"522533064595578","commenter_b":"Shut up and set down!!","commenter_a":"he is not black he had a black father and a white mother so put that in his book","post_message":"WATCH: At a rally in Harlem, Hillary Clinton suggested there was an element of racism in Republicans' insistence that President Obama doesn't have the right to nominate Justice Scalia's successor. They're acting like he's \"not the real president\" @webpagelink"}]
