[{"comment_id":"1184765608230962","commenter_b":"That works too","commenter_a":"Jenni Mahtinez","post_message":"Have you ever wondered how voting in the caucus even works? Because the answer is pretty weird. - Jon Comulada"},{"comment_id":"514466908734354","commenter_b":"We have enough homeless, and veterans who need out support. We need to stop being 911 for the rest of the world. Deport the illegals, Some say illegals do the jobs Americans won't do, then American's better start doing them.","commenter_a":"HEY OBAMA FORGOT ABOUT THIS LAW......Islam, by law, is prohibited from US immigration The Immigration and Nationality Act passed June 27, 1952 revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in Chapter 2 Section 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by 'force, violence, or other unconstitutional means.' This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House.Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the ...","post_message":"ICYMI: 'A new Fox News poll shows 52 percent of the nation favors deporting the millions of illegals back to their home countries. Republicans and Democrats support Mr. Trump’s plan,' writes Todd Starnes."},{"comment_id":"509824199177535","commenter_b":"^ Then stop posting your shit on our news, we honestly couldn't give a fuck about you dumb cunt Americans. Continue shooting each other, I need more wanking material.","commenter_a":"'More guns!' -Americans","post_message":"DEVELOPING: The search for the suspected gunman continues this morning."},{"comment_id":"10154148707777994","commenter_b":"I'm more scared of a white maniac than some isis rag head sitting in a cave.","commenter_a":"They did it in response to capturing the guy behind the Paris attacks. You have to hunt them down and destroy them ruthlessly and make them fear you otherwise they will continue","post_message":"Here are some photos from the scene in #Brussels. The latest -- at least 26 people have been reported dead in the blasts. Dozens of others have been injured. Continue reading about what happened here: @webpagelink"},{"comment_id":"10153731368766756","commenter_b":"Aubrey A Price","commenter_a":"Jay Stephan Steinmetz, oh the La Fee!","post_message":"It was not art, but necessity that first helped popularize absinthe: It was included in the rations of French soldiers who marched off to colonize Algeria in the 1840s, issued 'for the prevention of fevers and treatment of dysentery.'  It was only later that drinking absinthe came to be viewed as an indulgence for both the eyes and the tongue."},{"comment_id":"10152888898915496","commenter_b":"But... But... Gay marriage is destroying straight marriage! @webpagelink","commenter_a":"Brenda. I believe that you are right in some of your thoughts. I don't delieve we should judge people. However we are definitely called to judge actions. In the case of same-sex marriage to support same-sex marraige is to supoort something that goes against the Bible's definition of marraige. Same-sex marraige is social, cultural, and traditional. Social, cultural and traditional acceptance will change with time but Biblical truth does not. Therefore I believe that we are to love everyone but support what is right in the eyes of the Lord.","post_message":"Brenda Wood 11Alive looks back at the fast-moving and historic events of last week in Monday's Last Word -- 'Same-sex marriage: Judgement Day.'  More Last Words: @webpagelink"},{"comment_id":"556591217846893","commenter_b":"America needs alot less hate as well as banning corrupt career politicians, NWO,Open borders to fill there own greedy pockets Clinton the lieing witch with soldiers blood on her hands","commenter_a":"To all the hateful mean trolls, seriously and you call yourself an American. Maybe you skipped the part in school that teaches you to be human and love humanity. You can disagree with political views but when you just get mean spirited about a person...thats just wrong!! I think Americans need more love and a lot less hate!!!! Next time you call someone something, look into the mirror and see if you ever sinned yourself. 'Those without sin...cast the first stone'!!","post_message":"A smiling Hillary Clinton just arrived on Capitol Hill for meetings with Democratic lawmakers. @webpagelink"}]
