[{"comment_id":"10153839252314087","commenter_b":"'@username He was a natural born citizen of the US and so was the LA Shooter who is from New Albany, Indiana. Why do you hate the Constitution, there is no racial component to citizenship. We must stomp out Christian and ISIS terrorism!","commenter_a":"I agree we must stomp out Jihadi and Christian Fundamentalism. The LA shooter was a Hoosier (Indiana). A disgruntled white man with fascist leaning aka the type of voter Loser Cruz tried to get but the Trumpster got. Is this un- PC enough for you gusano?!","post_message":"'Enough is enough. What we need is for every American -- Democrat and Republican -- to come together, abandon political correctness, and unite in defeating radical Islamic terrorism,' Ted Cruz said after the Orlando attack."},{"comment_id":"1442368625820278","commenter_b":"'@username maybe they would consider it if people would stop coming here illegally !! If America is not such a coveted place to be then stay in your country and deal with the shit you are handed !! It's quite simple ! But come here and mooch, steal, kill, sodomize , rape and terrorize then there will be action !! I'm not condoning it who likes war it's ugly but it is what it is !!","commenter_a":"The chinese & north koreans have killed millions, the russians and so on why just nail the USA? Ask China & Russia what their ammo is made from! Chocolates & jelly bean? Really, wake-up!","post_message":"People don't understand how bad this really is."},{"comment_id":"10153269221051051","commenter_b":"When she gets her own country, she can make any law she wants and decide when she'll break it.","commenter_a":"Gays are getting too demanding. If she will not marry those faggats, then they should go some place else.","post_message":"This court clerk refuses to issue same-sex marriage licenses – even when her decision lands her in legal trouble. Do you respect her dedication to her beliefs?"},{"comment_id":"10153523768927293","commenter_b":"Thank you!","commenter_a":"What do you mean by white? there are white latinos i.e. latinos of European origin, so it isnt about race? pigment and having a tan or lack of deosnt define a race....cleopatra, moses, werent caucasion? what were they then? most experts say caucasion includes indians and that middle eastern are essentially white - although some can be mixed race .. so what exaclty do you mean and why do you care so much? We could find examples of many blacks playing white characters - very common in shakespeare...so keep your racial obsession and race baiting to yourselves please WP!!!","post_message":"From “West Side Story” to “The Birth of a Nation,” watch 13 times that a white actor portrayed a non-white character on the big screen."},{"comment_id":"10153233939551130","commenter_b":"Shame on you, damned sexist!","commenter_a":"'Just to hold it in your hand'... Yeah, that's not how tampons work >;)","post_message":"The best way to bring a tampon to the bathroom is just to hold it in your hand."},{"comment_id":"10154618646328812","commenter_b":"Europe will never be the same again thanks to refugees","commenter_a":"Ever notice how politicians insist on framing the narrative?","post_message":"French President François Hollande said today's attack and hostage situation at a church in Normandy was carried out by 'terrorists who claimed allegiance to ISIS.'"},{"comment_id":"10154239405639153","commenter_b":"Shes a looser","commenter_a":"'@username you just posted trump did lol","post_message":"Clinton is expected to speak around 9:45 p.m."}]
