[{"comment_id":"582952285239212","commenter_b":"Vote Trump! Not crooked Hillary","commenter_a":"Trump is nothing but a narcissistic coward. He likes to dish it out but he can't take it. Semper Fi","post_message":"Watch: POWERFUL and MOVING... This WWII Veteran and former POW is literally brought to tears in this impassioned plea to Americans to keep Donald Trump away from the presidency. Let's make this brave veteran go viral. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153707771213598","commenter_b":"Oh wow, so I guess she never felt them moving around in there for the last FOUR months of her pregnancies. That was probably a monkey or a frog moving around in there. Right. Stupid, evil excuse for a woman.","commenter_a":"Her remarks don't make a bit of sense. What in the world she thought was growing in her body got 9 months, and she is swelling and gaming weight, etc. did any of her babies kick and move around? Was she skinny when her children were born? She just instantly gave birth to a baby out of the blue! Wow! Just plain stupid.","post_message":"Planned Parenthood President: My Childrens’ Lives Began at Delivery, Not Conception"},{"comment_id":"10154282562893797","commenter_b":"Get rid of her dumb A S S","commenter_a":"Have her arrested and charged her for treason!","post_message":"BAN OVERTURNED: A school principal banned Santa, Thanksgiving and the Pledge of Allegiance at her school. However, the Department of Education wasn't having any of that. And now, some have started an online petition to remove Eujin Jaela Kim as principal."},{"comment_id":"1415440468755532","commenter_b":"Embarrassing shows some English women are ,more than stupid!!! What a PRATshe is , excuse the pun!!!","commenter_a":"These stories are not the norm. As a Brit I have been shocked & saddened at the attitude of the Brits post Brexit. If you are foolish enough to believe that the newspapers print stories that represent the situation of most refugees then you really are foolish. Yes stories like this happen, they always have. But for many this is not their situation.","post_message":"‘He is doing this to take citizenship'"},{"comment_id":"998201713572910","commenter_b":"Don't stop there. Get the rest of the scum","commenter_a":"How sad....","post_message":"Islamic State's chief singer-songwriter has been killed in an airstrike in Syria"},{"comment_id":"2113127628913184","commenter_b":"He just gained 3 points sweet","commenter_a":"HILLARY !!","post_message":"We’re in a drone flying above a voting center in Parma, Ohio #CNNElection #ElectionDay #MyVote (no sound)"},{"comment_id":"1174084612658964","commenter_b":"They are sex obsessed weak willed bonobos.","commenter_a":"What is the anti gunners obsession with genitals and degeneracy","post_message":"Cocks Not Glocks, the gun control group that literally strapped gigantic dildos to backpacks and made lewd gestures that would get any man thrown in prison, was invited to the White House last week. They actually completed their trip on Friday while I was enjoying my time fishing on the Oregon coast. The Cocks Not Glocks organizers posted their White House trip on all their social media accounts making it a big deal - all while Trump was taking flack for saying the word \"p*ssy.\" Now, as a woman, I have said before that I… [ 224 more words ] @webpagelink"}]
