[{"comment_id":"1158047454312031","commenter_b":"STOP THIS IN AMERICA!! Send illegals back! Police those that are here legally. These people want us dead....when did that change, folks????","commenter_a":"If they want to kill off their women and children nothing we can do about that. I have no problems shooting anyone who is coming after me. It's us or them. I say us","post_message":"It's only a matter of time before children will be doing all the dirty work. These monsters MUST be stopped. @webpagelink"},{"comment_id":"10153837280246051","commenter_b":"@username I totally agree with you! If people would not hire illegals at the first place, illegals would not be in the USA!","commenter_a":"The end! \"Beating the system\", fucking seriously! There is a system for a reason. How many people do it the right way and how many are unable to do so because of people like her and her family \"beating the system\"! Her scholarship should be revoked!","post_message":"This Yale-bound valedictorian stood in front of her entire school and made an announcement that stunned everyone:"},{"comment_id":"1742743236000370","commenter_b":"Typical Bernie speech sounds like this.I like to thank my legs for supporting me.My arms for always having been by my side and as for my fingers-------I could always count on them.","commenter_a":"Thank you West Virginia and Nebraska...Im glad several of our states including Pa..can see what Trump needs to do.. JOBS....people need to get back to work.and Most hard working people want this...everyone needs to pay into the system..","post_message":"It is a great honor to have won both West Virginia and Nebraska, especially by such massive margins. My time spent in both states was a wonderful and enlightening experience for me. I learned a lot, and that knowledge will be put to good use towards the creation of businesses, jobs, and the strengthening and revival of their economies. I look forward to returning to West Virginia and Nebraska soon, and hope to win both states in the general election. Likewise, my time spent last week with the great people of Oregon will hopefully lead to another victory next Tuesday. Thank you! Donald J. Trump"},{"comment_id":"1788948718006323","commenter_b":"Scumbags","commenter_a":"lol. Morons.","post_message":"Democratic Rep. Karen Bass of California labeled semi-automatic rifles \"weapons of mass destruction\" Wednesday."},{"comment_id":"10153181502489705","commenter_b":"RJ Ring,Brett Alexander,Chandler Hunt","commenter_a":"Victor Trezic Mata","post_message":"Star Wars fans. It has arrived. Rejoice."},{"comment_id":"10153767545206002","commenter_b":"My son still has school.","commenter_a":"Schools need a coordinated web site saying exactly what are close or open..","post_message":"Bitter cold has closed schools not already on Winterbreak. School Closings: @webpagelink #Local4Today"},{"comment_id":"10153091745866523","commenter_b":"You're a pig!!!","commenter_a":"This whole thing was started by a Lawyer whose wife was a Teacher and a School Board Member. She was hysterically crying over the whole...Act 10 thing, so her dutiful hubby wasted millions of our tax dollars to pull out a witch hunt. Which begs the question: Did his wife put out after all that? Because I want to know if my tax dollars amounted to a 'Happy Ending' for most dutiful hubby.","post_message":"JUST IN: Wisconsin Supreme Court ends probe into 2012 recall campaign of Gov. Walker."}]
