[{"comment_id":"10153846533754641","commenter_b":"A VOTE FOR HILLARY WILL BE THE END OF WHAT WE KNOW OF A FREE AMERICA , NO MORALS, ONLY PROMISES AND MORE LIS ! I WAS SHOCKED AT HOW MANY PPL STILL VOTED FOR HER AFTER KNOWING SHE HAS COMMITED TREASON ALONG WITH OBAMA AND THOSE TOP SECURITY TAPES BEING EXPOSED FOR JUST ANYONE TO SEE , THEY CAUGHTBOTH OBAMA AND HER IN LIES WHEN ASKED ABOUT THOSES TAPES . EVEN IF SHE DID MAKE IT TO BE PRESIDENT SHE BETTER NOT GET SETTLED IN TO QUICK , iI HAVE A FEELING SHE WILL BE INDICTED AND OBAMA WILL BE ALSO !","commenter_a":"Every other one is a liar and owned by big $$. What will they do to help you directly? I don't know any millionaires so I guarantee #Bernie2016 s policies will give you more spendable money. He's not really giving anything away, we already pay for most of it and he's found ways to pay for MORE than the rest, the excess will pay down the deficit. He will create jobs and raise wages, which will lift millions of people out of poverty and they will rely less, or not at all, on welfare. (No, this will not cause massive job loss or inflation. When poor people earn more money, they spend it, giving businesses plenty more money to use to pay the higher wages, usually with little to no increase in price.) He will implement a small tax on wall street transactions and other UNEARNED income, and will invest ...","post_message":"Donald J. Trump after a projected 2nd-place finish at Iowa caucuses: 'We will go on to easily beat [ Hillary Clinton ] or [ Bernie Sanders ], or whoever the hell they throw up there.'   Live updates from the Iowa caucuses: @webpagelink"},{"comment_id":"948144815307058","commenter_b":"'@username I appreciate that... However even though the question was asked by one person and he answered her directly .. He did that in front of an audience... As a parent I get what he's trying to say... But as a woman it makes me angry .. The boys that are being raised need to be taught that when a girl is too drunk to give consent it can be considered rape - I say can because not every girl that has drunk sex is going to consider it rape - but some may - plus it's incredibly unrealistic to tell a college girl to stay away from a party with alcohol... U may as well send her to a convent ..","commenter_a":"This advice isn't blaming the victim. Advising someone to lock their doors at night is not preemptively blaming the home owner for a robbery. Should we live in a world where girls can go to drunken college parties and not worry about being sexually assaulted or raped? Absolutely. Is that the world we live in? No.","post_message":"John Kasich to student concerned about sexual violence: 'Don’t go to parties where there’s a lot of alcohol.'"},{"comment_id":"10153868854236336","commenter_b":"Heck yeah","commenter_a":"It's OUR country. We don't have to agree. I'm sick of people like this telling other people to leave. You don't make the rules buddy.","post_message":"'The silent majority has been silent way too long.'  Harris County Sheriff Mike Jolley says he's proud to be political incorrect, and if you don't like it, you can leave his county. @webpagelink"},{"comment_id":"1604805479806565","commenter_b":"millions ,,,makes a star,,,,i like her,,she is a sweet little woman,,,,i am very thankful her husband had millions ,,,to get her where she is,,,she dont need of nothing ,,to even had started singing.............it was a joy seeing her perform","commenter_a":"'@username you may need to read this","post_message":"YES!!!  We support you Shania Twain."},{"comment_id":"10153180114156636","commenter_b":"Easy to say coming from a white man whose ancestors were the criminals. I bet if that was your ancestors murdered on a genocidal level by the NATIVE Americans, you would not be saying this. Stand out for justice, even if it's against yourself.","commenter_a":"Do your self a favor find a another date, maybe in November, with Thanksgiving...Columbus day is here to stay, and will stay; we are not about to change our History....Christopher Columbus had to vision, the world was not flat, that is why we have the Americas' North and South.","post_message":"'Far too often the contributions of indigenous peoples’ go unrecognized in our history and textbooks'"},{"comment_id":"836801636436616","commenter_b":"Any one doing this should be around up put in jail and when it is time to get out they should be deported","commenter_a":"And those BASTARDS in DC want to bring in over @username in the next two years. HELL NO","post_message":"Broad daylight in Germany. Watch Muslim 'refugees' beat the crap out of this mom and daughter. Can you say, 'extended magazines?' @webpagelink"},{"comment_id":"524518094380814","commenter_b":"Planned parenthood another way of saying murderous selfish bitch, or greed doctor. I think both. Revoke the doctors licences, and any woman getting an abortion gets a hysterectomy too. If you're willing to murder your own child once you don't deserve the privilege to have any at all.","commenter_a":"Hillary’s claiming credit for Planned Parenthood’s selling of fetal body parts. She says it’s a real money maker, and the only way she’s able to afford Starbucks....","post_message":"The top Planned Parenthood doctor whose face is all over the Internet because of an undercover video otherwise has left little mark on social media or elsewhere on the Web."}]
