[{"comment_id":"1046312712073631","commenter_b":"Back in the,day, I was called a baby killer. My response to the pussy was that I was ALSO A MOTHER FKR, SO KEEP YOUR MOMMA OFF THE STREET.","commenter_a":"All those who believe in abortion so passionately, please line up on the left for your very own personal post partum abortion. Lead by example........ :-)","post_message":"Does this about sum it up?"},{"comment_id":"10150581639814999","commenter_b":"its called cheating and it is still cheating if the score 47-7 hope you dont have kids...","commenter_a":"Seems like a very very cheap price for a championship","post_message":"A report commissioned by the NFL concluded that it was “more probable than not” that Tom Brady was aware of New England Patriots personnel deflating footballs to gain an advantage against the Indianapolis Colts."},{"comment_id":"802250076569145","commenter_b":"You two should be sterilized","commenter_a":"Here comes the next Republican Party split. The birth of idocracy, with trump being the first idiocrat. All right America... Goodbye.","post_message":"On the morning after #SuperTuesday, one thing is clear: the GOP is at a crossroads."},{"comment_id":"946663845429868","commenter_b":"One thing that is jumping out at me about this shooting in South Carolina is the way the community has come together, whites and blacks as ONE community. I look at this and than think back to Ferguson and Baltimore, what a difference. And yet so many times I have listened to liberals post on @username about the hateful, bigoted small minded people of the south. God Bless the people of Charleston and the families of the victims of this hateful crime.","commenter_a":"Hold on, those who love God will see you through, especially, those from that Church and all Churches that love the Lord Jesus Christ.","post_message":"“Oh my lord, he’s done made our life a living hell. What he did was unspeakable.”   -Carson Cowles, Dylan Roof's uncle"},{"comment_id":"10154010252346350","commenter_b":"The kid didn't make a mistake. If she was driving drunk then she committed a crime. Having someone plow into your home is not only traumatic at the time of the event, but then there are all of the repairs to deal with. It can take months to get it all put back together. And insurance doesn't cover all of the costs. Guess who gets to pick that up. Not the kid. She wasn't over reacting. If anything, she was quite conservative. I would have gladly beat the stuffing out of the one that hit us.","commenter_a":"I'm probably the only one who is think Kim... Is.. Well... Being a little actress like in all these tweets. We get it. The kid made a mistake. One that could of been fatal. One tweet is probably good enough (if at all) but like 4? Get a grip Kim. Ridiculous.","post_message":"\"This young girl could have killed herself, her friends, and me. Frightening.\""},{"comment_id":"10153366804443635","commenter_b":"Old testament commands to kill is now invalid. You are beyond ignorant Kyle. You'll do anything to defend any religion except Christianity. Did i say you should be killed, you nut? I'm not talking to you anyways. Get your nose out of my conversation with him.","commenter_a":"Kill the unbelievers wherever you find them.\" Koran 2:191 \"Make war on the infidels living in your neighborhood.\" Koran 9:123 \"When opportunity arises, kill the infidels wherever you catch them.\" Koran 9:5 \"Any religion other than Islam is not acceptable.\" Koran 3:85 \"The Jews and the Christians are perverts fight them.\"... Koran 9:30 \"Maim and crucify the infidels if they criticize Islam\" Koran 5:33 \"Punish the unbelievers with garments of fire, hooked iron rods, boiling water melt their skin and bellies.\" Koran 22:19 \"The unbelievers are silly urge the Muslims to fight them.\" Koran 8:65 \"Muslims must not take the infidels as friends.\" Koran 3:28 \"Terrorize and behead those who believe in scriptures other than the Qur'an.\" Koran 8:12 \"Muslims must muster all weapons to terrorize the infidels.\" Koran 8:60. That seems pretty pure to me, purely evil!","post_message":"Hillary Clinton: 'Muslims Have Nothing to Do With Terrorism'"},{"comment_id":"1792151467673200","commenter_b":"Right a true nasty woman!","commenter_a":"The only \"educational\" facet in Rosie is her nastiness! Period.","post_message":"Rosie O'Donnell says she posted a tweet questioning whether Donald Trump's 10-year-old son is autistic because she found it \"educational.\""}]
