[{"comment_id":"10153561426376135","commenter_b":"we know this lady is","commenter_a":"Why would I answer those stupid questions to see this story? WXYZ are you crazy?","post_message":"In 2015, in Troy, she was charged with assault and battery. She later pled to disorderly person and, two weeks ago, she was ordered to pay a $500 fine and attend anger management."},{"comment_id":"934315223319642","commenter_b":"Michelle Owen Nyki KiKi 😂😂😂😂","commenter_a":"AHAHAHAGA help","post_message":"Via The Everlasting GOP Stoppers"},{"comment_id":"1169723563063063","commenter_b":"SHES ONE HELL OF ALOT BETTER THAN THE TRANNY AMERICA HAS PARADING AROUND AS A WOMAN NOW! THE TRANNYS NAME IS MICHAEL! ODUMBASS LOVES HIS GAYS! DAMN THAT IS ONE BUTT UGLY GORILLA FAVED TRANNY! MELANIA HAS MORE CLASS IN HER CRAP THAN THE TRANNY HAS IN HIS WHOLE BODY! P.S. TUCK THAT SCHLONG TRANNY!","commenter_a":"Agree","post_message":"I agree!"},{"comment_id":"10154251165218984","commenter_b":"He shots he hits he scores, 250bucks for each, thrn charge mexico for the money, sry but see if you can just walk over the border there no you can not, you get arested and jailed asap, but some how the Mexicans and all the others get by Mexicos military hummmmm","commenter_a":"Oh yea Eean, Milo, Jackie, Heather, Cory, Liz, Justin.. Mmmmhhhhm I'm not gonna share on your walls but for those who have children, think of what type of democracy will enable if Sanders or Clinton both Democrat are elected president. To have too share the taxes you earn back for the benefit of others. Don't be naive because a lot abuse the system, which means if you want universal health care and benefits.. The Republican Party has to amend the laws of drug test issued for anyone wanting freebies and living off the cheese the government provides.. Which is I THE TAX PAYER. This revolution crap will end after New York. On another note, Ted Cruz may have a 10 day rant after this upcoming Super Tuesday winning Wisconsin with all delegates.. But Trump will win New York & all the eastern part of nation, and then we're too California! ...","post_message":"This is insane, and it happened right in front of a journalist... Do you think America needs a president with a firm stance on immigration?"},{"comment_id":"10154497779774166","commenter_b":"My son. 3 at the time but 6 now, snuck out at 8am to play in the yard and went through child proof knob, door lock and deadbolt. And i was arrested and given a felony for child neglect... Judge here raised voice at me when i told her kids arent dumb. That mine is super smart. And sent me to jail/: now my ptsd is so bad i barely sleep since the day. Because im afraid he'll sneak out again.","commenter_a":"Was he pulled over for \"drunken milk driving\"? LOL! On the serious side, glad he was okay! My children were escape artists when they were younger. Have a toddler now and with having her older siblings around, she doesn't attempt anything like this. She's opened the front door before, but never left the apartment. We used alarms on the front door. Working third shift and having a toddler is hard LOL! But during the week she's at daycare so no worries there... Just worry on weekends when they're home with me.","post_message":"Deputies say the child was found driving down the road wearing only jogging pants and a diaper around 1:55 a.m. Sunday."},{"comment_id":"10153550628070575","commenter_b":"purina go sit down! TRUMP 2016!!","commenter_a":"Msnbc ? Thats because she has such nice things to say about Islam . Trump 2016. 🇺🇸🇺🇸🇺🇸","post_message":"The Gateway Pundit - MSNBC Host Mika Brzezinski Goes Wild for Carly: “My God, I Have Never Seen Anything Like Her, Ever!” (VIDEO)"},{"comment_id":"902249986464524","commenter_b":"ridiculous..she was good enough to lay down and have a child with but now she's a hoe?","commenter_a":"SMDH now that an action right there to piss her off more. No woman wants the father of her child disrespecting her on media outlets. Let's see how long she gonna ban him from seeing his son now. Some guys never learn. No matter how much he hate her he need to handle their business in private. Who wants to grow up with the public and their father throwing shade at the person that gave birth them. U cant stop what the world thinks of Amber but Wiz should act more mature and handle it since he a Dad now. They need a mediator ASAP","post_message":"“Instagram Turnin’ These Wives Into Hos”: Wiz Khalifa Takes Cheap Shots At Amber Rose On New Song, “For Everybody” :("}]
