[{"comment_id":"711989458991632","commenter_b":"So you are saying if all guns were banned from legal americans the secret service would not need any guns? You obviously are another liberal idiot. Again shit for brains, criminals don't get their weapons legally. They will still get weapons illegally & then what are they going to use against an illegal weapon, throw cans of green beans & peas at them? Throw rocks at them? Why do liberal idiots refuse to understand CRIMINALS DON'T BUY WEAPONS PER SAY AT GUN SHOPS.","commenter_a":"Let's start at the very top and ban those guns that the SService are carrying all around Obama","post_message":"President Obama is taking guns out of all forms of entertainment. This is ridiculous. He can't get away with this. Do you think he is abusing his power to push his propaganda?"},{"comment_id":"691444044379507","commenter_b":"Hate Crime.. All of these black criminals are Racists","commenter_a":"This is bullshit! There's hundreds of incidents happening everyday! Want to be fair put them all up everyday!","post_message":"A white father and son were killed by two black teens and there are no riots. The media is completely one sided. Race Baiters are the problem. Do you agree Al Sharpton is the problem not the solution?"},{"comment_id":"10152853063786748","commenter_b":"Know what, dude, if you and Obama went to a lunch counter in the deep south in the '50s, you would both stand an equal chance of getting abused and assaulted. And if the right wing scum you shill for ever get back in power, you'll find yourself right back in the 'separate but equal' category tout suite. :P","commenter_a":"right. cause Alan West is the epitome of \"blackness\"","post_message":"Right-wing pundits claim Obama isn't *really* a black American"},{"comment_id":"726825177508060","commenter_b":"Muslims offend me. Make them leave.","commenter_a":"God help us all. Leave your American Flag flying high. I sure will. It's OUR country. If u don't like it----- get the h---ll OUT. We didn't invite u here.","post_message":"Texas man ordered to take down American flag because it offends Muslims. In our country we fly our flag. This is absurd. Do you think this is ridiculous?"},{"comment_id":"1226487637389708","commenter_b":"Just remember when your ass gets beat up coming to my town... U started this shit. I bet your wife's dick is bigger than yours","commenter_a":"Hillary gonna win.....trump will be doomed....after his rape case and so many other Court appearances he will be in jail along with the other republicans...","post_message":"CAN'T WAIT!"},{"comment_id":"10153619175294753","commenter_b":"I know right?? It kills brain cells!!!...lol","commenter_a":"I heard it was worse than 2 Broke Girls.... I don't know how that is humanly possible .......","post_message":"Fuller House, the spin-off of the classic ABC sitcom Full House, finally hit Netflix this past Friday and the reviews are in. With all apologies to John Stamos, there are a lot of critics out there that simply have no mercy for this nostalgic reboot (okay, that was a really bad pun). Fuller House picks up 21 years after Full House, which left television screens in 1995 after eight seasons on ABC. This time around, DJ (Candace Cameron Bure) takes the Danny Tanner (Bob Saget) role as she’s... @webpagelink"},{"comment_id":"10154844264313132","commenter_b":"Sorry katie but i think you are confused between who hillary is and who trump is cuz clearly he was the one interupting her on soo many questions and tring to intimidate her just like he does every other woman but thank goodness she is a strong woman and did not let him get to her lol","commenter_a":"Wow this just goes to prove that hillary is the better candidate hands down. She definately killed trump and i think he got angry and became soo defensive lol she was very prepared and he was not","post_message":"Donald J. Trump says he will release his tax returns when Hillary Clinton releases her deleted emails. @webpagelink"}]
