[{"comment_id":"10153572381213984","commenter_b":"Real Americans care, libtards don't give a damn, want more illegals here!","commenter_a":"So sorry......","post_message":"One man whose life was forever changed the day his teenage son died at the hand of an illegal repeat offender is now embracing one 2016 candidate's message. Do you agree with what he said here?"},{"comment_id":"10154657445794575","commenter_b":"@username so what your saying is the other 55% or the majority are coming over the border illegally so we do need to build a wall right?","commenter_a":"Help AMERICA first. Like the veterans, homeless and elderly!!!","post_message":"Exodus Refugee Immigration plans to move 60 people from Syria and the Democratic Republic of the Congo to Bloomington next year, starting in March. \"These are the most thoroughly vetted people coming to the United States. We don’t do research into anybody else to this extent,\" said IU Associate Professor Elizabeth Dunn."},{"comment_id":"10153163546666336","commenter_b":"I bet those racist pigs were cheering.","commenter_a":"I guess Al Sharpton and Jessie Jackson missed this news story...","post_message":"UPDATE: A third man has been charged with sexually assaulting a woman during spring break in Panama City Beach, Florida, that was captured on cellphone video, authorities said."},{"comment_id":"1218557638174745","commenter_b":"Jennifer look's like you like to swallow dick","commenter_a":"Chris brown beats in women","post_message":"LIVE NOW: Police are outside artist Chris Brown's home. Police were called to his home after a woman called 911 requesting help. MORE: fox13news.com/news/@username-story"},{"comment_id":"10153467954429714","commenter_b":"Haha this old lady needs to grow up u to old to understand ur backwards ways","commenter_a":"Down with haters","post_message":"The clash sparked a battle that pitted school administrators against students during the last week of the school year."},{"comment_id":"942361925804666","commenter_b":"I don't like it poor women","commenter_a":"How horrible.","post_message":"With everyone watching. Horrifying. - Matt Orr"},{"comment_id":"1823696047877973","commenter_b":"She is just jealous.","commenter_a":"Rosie is a washed up loser who thinks we care what she says. We know exactly what and who this disgraceful person is.","post_message":"OUTRAGE...! Rosie O'Donnell TWEETS naked photo of Melania Trump when comparing her to other First Lady photos. WARNING: Nudity. @webpagelink"}]
