[{"comment_id":"1495322403831141","commenter_b":"please God help them find this little man let him be safe please let him go home with his family and friends","commenter_a":"Does anyone know where we meet tomorrow to volunteer to search?","post_message":"KPRC2 Robert Arnold is headed out with a couple of people who are helping with search efforts for Marcus McGhee in Pearland. MORE-->@webpagelink"},{"comment_id":"574728392714767","commenter_b":"You should be worried about all of these weekly race riots, terrorist attacks, and minority crime. All three of those factors are why Trump will win. People do not want a third Obama term, which is what Hillary offers. Why do YOU, white person support the Democratic Party, the party that hates you, and legalizes racial discrimination against you? You are like those Jews in 1932 Germany who supported the Nazi Party. You both follow the political party that calls for you demise.","commenter_a":"What I'm worried about is Mr. Reality TV turning what should be a serious debate into another stupid episode of The Apprentice, and the media not giving a damn because it makes for good ratings ... and then our dumbed-down electorate lapping it up.","post_message":"Tonight debate between Hillary Clinton and Donald J. Trump may be one for the ages. But history shows it not the great arguments we remember, but the zingers and gaffes."},{"comment_id":"1615919975382867","commenter_b":"Jake Jutras the first eagle has landed","commenter_a":"Virgil John Ariel John Monique John","post_message":"#BREAKING: The first eaglet has HATCHED! Harriet and her mate M15 were both at the nest during our first sighting of the eaglet, which is almost fully out of his or her shell. A New Year's Eve eaglet - SO EXCITING! Video: Southwest Florida Eagle Cam STORY: @webpagelink"},{"comment_id":"236858020109682","commenter_b":"Get the lady off the pic","commenter_a":"He got in there by something called \"voting\". Just saying","post_message":"LIVE VIDEO: 'Not My Presidents Day' anti-Donald J. Trump protests are happening across the country. WARNING: Viewer discretion is advised"},{"comment_id":"544174485780052","commenter_b":"Go to hell. She won. Petulance Is ugly.","commenter_a":"Bernie supporters had been saying for at least the last year prior to the election that if we get $hillary as the Dem nominee, we get Trump as the next president. We fucking told you so, America. We said this, and it happened. For the record it doesn't feel good, and the vast majority of us wish harder than anything that we could have been wrong about this. No one is gloating; we're pissed.","post_message":"Supporters of Bernie Sanders never got their chance to prove if their candidate could have defeated now President-elect Donald J. Trump."},{"comment_id":"467133756816336","commenter_b":"That is a disgusting fact. Those people should be ashamed to call themselves 741915279236631s","commenter_a":"That is a shocking testament of liberal standards & ethics!","post_message":"A new poll found 71 percent of Democratic voters believe Hillary Clinton should keep running even if indicted, a view shared by only 30 percent of Republicans. Where do you stand?"},{"comment_id":"1587873301226283","commenter_b":"They won't do that. They are professionals and have ethics.","commenter_a":"This is how it is going to work now for the Libs. If you voted for Trump there will be a price to pay. Lost a lot of money because of Obama in Office and I let it be. Be careful Libs, Don't get Jammed up. Most of the Police, Firemen, and Military are Conservative. What would happen if they decide not to respond because your a known Lib.","post_message":"\"WON'T BE BULLIED.\""}]
