[{"comment_id":"1195188837159645","commenter_b":"Hahaha that bitch pussy on all types of fire😂😂😂","commenter_a":"Shanira","post_message":"Oh my "},{"comment_id":"814574258686460","commenter_b":"The ladies of The View were rude and disrespectful. It seems like they only invited you on the show to badger you. Whoopi is worse than Bill O'Reilly. She kept interrupting you & would not let you get your point across, and Joy just laughed at everything you said like it was some kind of a joke. They don't care about their guests' viewpoints at all. I have to say that I admire you for being the great person that you are.","commenter_a":"Thank you, Dr. Carson, for remaining the gentleman you are while on The View today. I must say I stopped watching that show years ago. I watched today because you were on. I have great respect and admiration for you. Donald Trump is not my first choice for President. I will vote for him if he is the Republican nominee. Maybe some of your calmness, thinking before you speak, will rub off on Donald if he is nominated and elected President. The women of The View are not my cup of tea. I turned the show off as soon as your segment was over.","post_message":"I would like to thank the Ladies of The View for having me on. Though we disagree on politics, the beautiful thing about America is that we're able to have platforms where we can discuss those differences. I will continue to work hard to ensure that this remains for generations to come."},{"comment_id":"10153888604683812","commenter_b":"Bye dumbass. Take the illegals with you, of ALL nationalities","commenter_a":"I respect our president and all past Presidents. I will respect all future Presidents. ( unless Donald Trump is elected, I will move to MEXICO AND HELP BUILD THE WALL!!!!!!)","post_message":"President Obama has joined Facebook! Here's what the President wrote in his very first post: @webpagelink"},{"comment_id":"842682652588978","commenter_b":"She needs to be kicked out of our country, we don't need trash like her kind around.","commenter_a":"Here's another puke, wants everything America has to offer but can't be happy with that, maybe the next time she appears in public, the police should not lift a finger to give it any protection, then she'll probably get stomped under the crowd, and she deserves every foot that would trample her arse!","post_message":"It is people like her that perpetuate hate.  Police are the people that keep her safe.  Do you think Beyonce needs to learn some respect?"},{"comment_id":"10153255561596350","commenter_b":"She did do it her way.....special lady","commenter_a":"Tomi McCutchen Parrish should write her own obit, one day.","post_message":" pains me to admit it, but apparently, I have passed away. Everyone told me it would happen one day but that's simply not something I wanted to hear, much less experience. Once again I didn't get things my way!"},{"comment_id":"1348114028561384","commenter_b":"This woman is supposed to be a reliable, professional journalist? Bitch please, she is a joke!","commenter_a":"F Kaine he's a hillbilly","post_message":"LIBERAL MEDIA's meltdown.  @webpagelink"},{"comment_id":"10154363998161756","commenter_b":"You're right @username, it's easier to lie to the people and then change nothing. #sheisworthless","commenter_a":"The mainstream media - and @username is that - has done the work of the status quo establishment and convinced the American people that nothing can be done anymore because it's too hard and too complicated. Anything is possible, but it will take the will of the people to continue the political revolution. Change is coming, but it will be a long struggle. A hard fight against the establishment. Bernie or bust. Don't ever give up.","post_message":"The effort ultimately would rely on Sanders getting stalwart backers of his plan into key positions, followed by a difficult, drawn-out fight with the powerful industry."}]
