[{"comment_id":"990097811101554","commenter_b":"That looks disgusting 😱","commenter_a":"@username BONG","post_message":"Not all heroes wear capes. 🍔+🌭"},{"comment_id":"863998766982005","commenter_b":"Women. Are. Psycho.","commenter_a":"not worth it.","post_message":"A woman has died in a car crash after chasing down her husband who was with another woman. What do you think? Crazy details here:"},{"comment_id":"552487634912815","commenter_b":"Your racist dumb fool he's not understanding the concept on the purpose for building the wall","commenter_a":"your not going to stop drugs coming in with a wall, they have already proven that for the last 20 years. there are inventions like aero lights, tunnels, submarines. and boat. not to mention all the ways they catapult drugs over already. your all stupid for supporting this waist of tax payer money. not forgetting all the jobs they do that you office pussys wont and can't do because you have no back bone.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"1717745955143572","commenter_b":"This espn reportor gets paid to ramble about bullshit. Who would even take the moron serious?","commenter_a":"Typical ESPN liberal reporter has absolutely no respect or love of country,","post_message":"Should the Team USA hockey coach be fired for threatening to bench players who sit during the national anthem?"},{"comment_id":"654122978061007","commenter_b":"I know you do","commenter_a":"Omg I want to hold one!!! @username","post_message":"PANDAMONIUM: 4-month-old giant panda cubs at The Toronto Zoo are learning to walk."},{"comment_id":"1744722422438798","commenter_b":"Fkn pussy","commenter_a":"BS!!!","post_message":"College Kid Demands Counseling After Being 'Traumatized' By Seeing The Confederate Flag Sticker  Our society is getting out of control.  Do you think this is ridiculous?"},{"comment_id":"941945919231796","commenter_b":"Lol. They immigrated too #landbridge","commenter_a":"Should learn wut? Now listen here sis... You are just brainles jerky What the hell is American? You mean English????","post_message":"She fits right in with Donald Trump."}]
