[{"comment_id":"10154070103774916","commenter_b":"Shillary can't beat Dumper because she can't hold on to the Bernie followers who will leave the DemoRatic Party as soon as she gets the nomination. We aren't Democrats and we won't vote for her. #MassExodusOfTheDNC","commenter_a":"Hillary Clinton and Demographics and the American people will CRUSH Racist Republican Lying Cowards Donald Trump or Cruz.Who are vile bigoted ignorant chicken hawks warmongers un-American racist hateful assholes. HILLARY 2016.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"177307306103129","commenter_b":"Wrong! Never said in his first 30 days","commenter_a":"Didn't he defeat ISIS already? He said he would in his first 30 days.","post_message":"Join us as President Donald J. Trump delivers the Weekly Address."},{"comment_id":"371202926416555","commenter_b":"^^^Suck one, racist prick !!!","commenter_a":"What's missing? Blacks!!","post_message":"Real Protest = No Damage www.eaglerising.com"},{"comment_id":"10153840102456523","commenter_b":"Your ignorant Jessica. Just Stfu","commenter_a":"Gang members shoot people to they do drive byes or just randomly shoot somebody it could be any if us blk kill blks latinos kill latinos white kil whites wow only in America","post_message":"The graphic video shows the three men listening to music, and a man in the front passenger seat holding the phone.   Suddenly, the phone drops to the floor of the car as what sounds like at least 30 gunshots can be heard in the background."},{"comment_id":"10150864251334999","commenter_b":"He will blame the baby","commenter_a":"He will either win, or drop out so he can always claim he would have won otherwise. If he does stay till then end, and doesn't win, the reaction will look like this: 1. Demand a recount 2. Blame it on voters who didn't want to make America great again. 3. Complain that the GOP is at fault for not supporting him enough. 4. Blame his VP. 5. Demand to see Hillary's birth certificate","post_message":"The latest guessing game is whether Donald J. Trump will drop out of the presidential race before Election Day."},{"comment_id":"10155069293808010","commenter_b":"'@username well since trump is saying illegals voted for Hilary!!! I'm being sarcastic you Troll!!","commenter_a":"Oh let me guess they were illegal immigrants 2","post_message":"He operated the scheme for two years from behind bars. He and an accomplice made more than $600,000."},{"comment_id":"10153437491481130","commenter_b":"Arrogant bitch","commenter_a":"Hilary is a dumb lying bitch!!","post_message":"Sick burn, Hillary Clinton!  Video: NowThis"}]
