[{"comment_id":"10153622480508690","commenter_b":"Nna, infact you get am","commenter_a":"And this is not a problem at all to the world peace, unless when Israel bombs Hamas terrorists, then it will be a problem for the world peace. Hehehehehehehehe One good thing people should learn is that Muslims from the unset, have always wanted to dominate. Whether Muslims like it or not, Israel of today will never succumb to them again. If Israel is the problem of the world, then Palestinians should try and leave the land of Israel and let's see whom Israel will kill again. Thousands are dying in Syria, Yemen and Iraq, yet it's not a problem to the world peace. Tell that to the birds. Never ever succumb to the demands of any Muslim community, if u give them one today, tomorrow they will demand for 3. Always push them back or they will over run u. This is why i pity Europe,maybe they are not ...","post_message":"Syrian government has conducted nearly 7,000 air strikes during the month of July, according to the Syrian Observatory for Human Rights, making it the most intense bombing reported in one month since the beginning of the conflict in 2011. @webpagelink"},{"comment_id":"515532941989754","commenter_b":"She so sickening","commenter_a":"And your high taxes and high minimum wage and Obamacare will put small businesses out of business so just stop. Americans can see through your BS .","post_message":"Hillary went off her rocker today. She is YELLING at voters. Very Bizarre."},{"comment_id":"1863352450575527","commenter_b":"She's a nasty which!!! I really felt sorry for Joy she was totally rude to her and had the look of revenge in her eyes toward Joy she should be ashame!!!!=","commenter_a":"Omarosa achieved 'fame' by being nasty. She is perfect for Trump. She was a disgrace with her last comment to Joy. She literally gave me the chills. I was concerned about Joy's health (and mine) - Omarosa was so vile and consistently lied. She (along with Trump and his Trumpettes) could give good, caring people a stroke!","post_message":"It wasn't pretty."},{"comment_id":"10152670187577483","commenter_b":"Or two women","commenter_a":"All of you people that back same sex marriage wouldn't even exist on this Earth right now if it wasn't for a man and woman making you like GOD intended for it to be. Just think if all of yalls parents would've been gay yall would have never existed.","post_message":"If you're trying to get married, check out this map before you go to the courthouse. The majority of counties have either suspended the issuance of all marriage licenses or are only accepting applications."},{"comment_id":"10152707448786051","commenter_b":"Are you calling ma a stupid whore","commenter_a":"Humans aren't very nice they are constantly making fun of people for every reason possible so don't be shocked","post_message":"When this police officer heard his co-workers mocking special needs children, he lost it."},{"comment_id":"666187176847797","commenter_b":"Too much butt kissing being done. The pilot and his white privilege remark, the seat mate's skin color even being mentioned, the flight attendant feeling compelled to apologize...oh, brother! This chick needs to put her big girl panties on and if she's a peace loving/seeking person, she'd drop the whole issue.","commenter_a":"So let all muslims boycott United, I will feel much safer with them not being there. Muslims are lower than whale shit.","post_message":"Look what happens when a flight attendant refuses to give a Muslim woman a Diet Coke..."},{"comment_id":"10153181393497377","commenter_b":"Putin gives you a hard on? What's that say about you?","commenter_a":"Yah , They cant hide from the Russians is what he ment .","post_message":"Obama to ISIS Leaders: 'You Cannot Hide'"}]
