[{"comment_id":"10154397036584205","commenter_b":"Way to stop women success!","commenter_a":"I work for Overstock and voted to pull all Trump, both he and his spawn, off our website. Proud of our CEO for putting it to his employees to make the final cut. I can't wait for the results!","post_message":""},{"comment_id":"963844390305083","commenter_b":"Atlanta housewives just ratchet!","commenter_a":"We got housewives of Orange County, Beverly Hills, And New York. Those women act like straight up fools. I'm wit you Lisa Ray but Uhmm hey morals are out the door when it comes towards cashing in","post_message":"She says she's trying to bridge the gap between \"us sistas,\" not take part in some of the controversial reality shows out there."},{"comment_id":"10155483281175231","commenter_b":"They tried to walk out and no is her business she can't just do whatever she want she pulled a gun on to people what was right about that. Just suppose they had weapons you do know the 2nd amendment applies to all citizens and they feared for their lives and shot the stupid white bicth. How ignorant","commenter_a":"her joint she can say and do what she likes......whatever...I would have just walked out..who cares","post_message":"Things reportedly turned into a scene out of Pulp Fiction."},{"comment_id":"10153615145678598","commenter_b":"this woman is sick and will be judged by God. I wouldn't want to be in her shoes when she stands before God!","commenter_a":"And you get an abortion! And you get an abortion! And you! And you!","post_message":"Hillary Clinton: “I Think We Should Do Everything We Can” to Promote Free Abortions"},{"comment_id":"1775352399350823","commenter_b":"Who would cheat on a woman like Beyonce?","commenter_a":"Ok y'all I admit I'm \"Becky\". J has a wonderful package and I milked it well. Sorry Queen B.","post_message":"Fans claim she is 'Becky with the good hair'"},{"comment_id":"10154362826911323","commenter_b":"In Bulgaria women sunbathe topless. Older women, too. At first it seemed a bit strange to me, then I thought \"Oh well, if a 60 year old can do that, I can, too\". That was when I stopped caring. As for underpants, not enough fabric, so I'll pass.","commenter_a":"Stupid debate. Why should it bother me how people sunbathe? I don't care if they are dressed, half naked or naked. Let everyone do what they are comfortable doing, it's not like you have to look.","post_message":"“It all depends on what type of underwear it is. If they had an Ann Summers crotchless type affair then that would be a touch odd.\""},{"comment_id":"10155026953658812","commenter_b":"lol except this lady started it in 2000 so moms the stealer lol","commenter_a":"@username it's like moms!!","post_message":"“Back in 2000, I got out this plain white tablecloth and put it on the table and my teenage kids looked at me like I was crazy when I said, ‘I want you to sign this tablecloth.’ Then a few years later the [grandkids] came along and now we have 16 years of memories on the tablecloth.”"}]
