[{"comment_id":"10152627900846680","commenter_b":"We need to get rid of lowlife like Amy Klobuchar and her fellow treasonous, America-hating Democrat scum...Loretta Lynch is proving she'll be another Holder...we don't want nor need her to continue breaking laws for Barry O.","commenter_a":"The now extreme right GOP, are now preaching that all democrats/Liberals are lawless. Ted Cruz as a the son of an exiled ultra conservative and enraged anti-Castro Cuban, was brought up to think by his father, that all Liberlas are Communist and are out to overthrow the US government. I quess according to the GOP and Ted Cruz's definiton of Liberalism, which he defines as lawless, John Locke, one of the fathers of Western liberallism, who inspired the writers of the American Declaration of Independnece like Thomas Jeffersen, were all lawless! If this is true who is then lawless...","post_message":"Sen. Amy Klobuchar: \"So why has her nomination languished for nearly four months — longer than any nominee for attorney general in recent memory? And why have senators like my colleague Ted Cruz insisted that she is somehow lawless?"},{"comment_id":"10153891729051680","commenter_b":"While Melania was pregnant.","commenter_a":"Right, because he was just a young, naïve, 59-year-old predator.","post_message":"Donald Trump released a video statement apologizing for his sexually aggressive comments about women, saying the words caught on tape in 2005 do not regret who he is."},{"comment_id":"546377932240042","commenter_b":"Wage gap seems like it is there but you femminists are being insincere about what it really means. You dont take so many factors into account. Men are more likely to work overtime. Woman take maternity. Woman should be thankful for that! How about that woman tend to get degrees that end up being useless and so they have to take lower paying jobs that arent what they studied for. There are SOOOOOOO many factors yoi ignore but without a doubt a woman WILL BE PAID THE SAME IF SHE DOES THE SAME WORK AS A MAN","commenter_a":"As a guy, I still love this. Great idea to raise awareness and galvanize support for an end to the gender gap and income inequality","post_message":"Take a deep breath, guys."},{"comment_id":"912315142139160","commenter_b":"I saw this on Fox & Friends this morning. I am so saddened by what this hero went through. Glad Perry was there to help him. My heart goes out to Marcus and all who suffer without the help they should get for free, for serving our country. Obimbo's leave no soldier behind is such a lie.","commenter_a":"Rick Perry for President or maybe Rand Paul!","post_message":"Do you know the story of Marcus Luttrell and Rick Perry?"},{"comment_id":"398088506982411","commenter_b":"Send them back to where they came from. They have no rights....they aren't AMERICAN citizens!!","commenter_a":"deport every one them but their country dont want them either they dont know the meaning of being human it seems","post_message":"This is not a good image for those who are trying to support the rights of illegal aliens."},{"comment_id":"10154287334146636","commenter_b":"It's very disgusting seeing the fake news of rape and burning alive. Burning alive is the nature of Muslims and Myanmars never do that act. Rape? All Myanmars are laughing the accusing of rape because Myanmar men even don't dream to rape Bengali Muslim women.","commenter_a":"Whether true or not, Myanmar needs to show evidence rather than blanket denying n also ppl should stop pointing finger from one side n stop calling \" Buddhist terrorist\" unless u want to be called ur religion as \" terrorist\" too, think in their place before u say ! Plus I AM DONE WITH ALL SOCIAL MEDIA NEWS especially like BBC !","post_message":"Horrific"},{"comment_id":"1900645696822355","commenter_b":"Fucking pigs!","commenter_a":"2seconds in & I can't even watch.","post_message":"His screams for helping are truly disturbing.."}]
