[{"comment_id":"10154796309533010","commenter_b":"She always plays the race card","commenter_a":"If Donald wins When he goes to court for trump university fraud and is convicted. Its a criminal act. And impeachment process can began","post_message":"Like Al Gore, Clinton may be on track to still earn more votes across the country."},{"comment_id":"1194580720554183","commenter_b":"This is all propaganda to rig the voting pattern and is trashy media reporting.","commenter_a":"THE PEOPLE LOVE TRUMP, WE LOVE AMERICA, WE WILL TAKE HER BACK FROM THE FILTH IN DC WHO RAPE OUR COUNTRY AND TERRORIZE OUR PEOPLE!!!!","post_message":"You've heard all the claims that Donald Trump has no chance of beating Hillary Clinton in the general election. Now, here's how that argument is instantly deflated"},{"comment_id":"494982004030385","commenter_b":"The towers that Donald Trump built ... Border Patrol endorses you to build that wall too, Mr. Trump ... A BUILDER ... not a destroyer ... of American liberties/freedom FOR POTUS!!! @webpagelink @webpagelink #DONALDTRUMP #POTUS #REPUBLICANPARTY #GOP #2016ELECTION #BORDERWALL #BORDERPATROL #TRUMPTOWERS #PRESIDENTIALPRIMARIES #VOTETRUMP #TRUMPTRAIN #MAKEAMERICAGREATAGAIN","commenter_a":"7% lead is good but you know that you need to win by double digits to shut ted up. IF you have any last minute secret weapons or anything you haven't used now is the time. Win NY huge and then take Cali and then proceed to destroy the liar and the commie.","post_message":"Thank you, California! I will see you soon! Have a great day - and remember - - TOGETHER WE WILL MAKE AMERICA GREAT AGAIN! #TrumpTrain"},{"comment_id":"10154030310632061","commenter_b":"Hillary can send emails to Satan but Donald still won't get my vote!!","commenter_a":"She should be in jail!!! And she should have never been allowed to run for president! Now we have two people running and I can't stand neither","post_message":"The newly discovered emails that prompted the FBI to reopen the investigation into Hillary Clinton private server came from a separate federal investigation of former Congressman Anthony Weiner, multiple sources tell ABC News."},{"comment_id":"1015237518591880","commenter_b":"When I look at her boobs she spins all the way around. Her face goes halfway then comes back","commenter_a":"Prefer not to care","post_message":"Is she spinning right or left?"},{"comment_id":"317547525326742","commenter_b":"To pay the illegals","commenter_a":"GREAT NEWS!! You just keep spiking those taxes..why stop there..RAISE TAXES ON EVERYTHING....YOUR GOING TO NEED IT! Besides..dont you left winged morons believe in taxing yourselves into welfare?? Good job!! GO CALIFUCKUP!!","post_message":"Robbing Peter to pay Paul..."},{"comment_id":"10153778518101051","commenter_b":"Whore. Really? Are you 14?","commenter_a":"Not defending her but why was the affair discovered two months AFTER she filed for divorce? Thats a little creepy on the ex husband's part.","post_message":"This man suspected his bride was up to something, so he hired a private investigator to check it out. His suspicions were ultimately confirmed and his wife was arrested shortly after."}]
