[{"comment_id":"10153047000946336","commenter_b":"Send her to Iraq for a month.","commenter_a":"Yeah, that'll piss ya off !","post_message":"A social worker at an Indianapolis VA clinic was disciplined earlier this year after sending emails to colleagues that contained photos of an elf figurine posed to mock the mental health problems of combat veterans."},{"comment_id":"10153309249299740","commenter_b":"Send her the bill...stupid","commenter_a":"Well played Baltimore...... @webpagelink","post_message":"200 rioters arrested, 144 vehicle fires, 15 officers recovering from injuries, and one big mess to clean up."},{"comment_id":"550509575137335","commenter_b":"So do it already arrest her corrupt ass because she is dangerous to our society.","commenter_a":"yeah...won't hold my breath !! 'smh'","post_message":"FINALLY..."},{"comment_id":"938381199514967","commenter_b":"Take the bitchs baby she don't need it jus like her other ones","commenter_a":"We need to all really start to focus on the hard truth of meth and the sickening epademic that is in almost every big and small town across America . I'm tired of all of the meth head thieves , I can't even imagine how many children across America are going through the same life endangering situations becouse of the parents being hooked on meth .. don't spend the tax payers money on jail , send them to treatment for several months . I'm sure these parents were decent human beings before meth took over . Unfortunately now they have like all meth heads done sinister,and incomprehensible acts . It's good to see these kids have survived when so many others don't .","post_message":"Bond's set at $100,000 for each parent after they allegedly abandoned their three young children in a house that neighbors call a mess and fire hazard.   'Rats that were running in and out of the garage. I mean, it was horrible.”"},{"comment_id":"10152943088035950","commenter_b":"OMG, this woman is beyond ridiculous. WTF for real.","commenter_a":"'@username. Then we have these morons !","post_message":"A special education teacher accused of holding an autistic boy upside-down and lowering him head-first into a trash says she was trying to 'shake out that trashy behavior.'"},{"comment_id":"1005304559506884","commenter_b":"'@username wow dude! go tell that to china, india, russia...they pollute the air you breathe in an astronomically higher number , last i checked, the earth only has one atmosphere.","commenter_a":"God be with you and your team as you go forward for our great state of Kentucky.","post_message":"'They bribe us with our own money to stick it to ourselves. And we will not do that anymore in the state of Kentucky.'"},{"comment_id":"1779215949028239","commenter_b":"#Fuckhillary #Neverhillary #Nevertrump","commenter_a":"#neverhillary","post_message":"Matt Lauer asks Hillary Clinton about the qualities that make her qualified to become Commander-in-Chief.  More coverage on @webpagelink"}]
