[{"comment_id":"10153621315776037","commenter_b":"Me either, but because of my mom, I've been around terminally ill people as I worked for her. This is a big deal and I believe it's important. Suffering through a long painful death is hard on families as well as patients.","commenter_a":"Death with dignity is a big deal to people. Unless you're living with a terminal illness, I suggest you leave your judgement at the door.","post_message":"Religious groups and advocates for people with disabilities opposed a nearly identical California bill earlier this year."},{"comment_id":"1149779331709743","commenter_b":"Bastards of the ocean!","commenter_a":"The arseholes of the sea. Cha Henry @username","post_message":"Wow, what an asshole."},{"comment_id":"10153184314438984","commenter_b":"This lady is a disgrace to our country. She needs to retire or get voted out so she can get a real life.","commenter_a":"Nancy Pelosi needs to shut up. Who cares what she thinks. She knew what to expect of the speech, stay away. People were there to support the PM not to listen to her senseless sniveling.","post_message":"People are NOT happy about this, and they're calling her out for it big time.  Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"979496535445797","commenter_b":"Good KICK ASS !","commenter_a":"Good for you","post_message":"BOOM! American's save the French yet again!"},{"comment_id":"1787231111544405","commenter_b":"She was sucking the hell out that dick! Stephanie Nicole Goad lmfao","commenter_a":"Macie Knisley @username lol ummmm #Merica lol","post_message":"This Veterans Day party gives free tattoos, haircuts and blowjobs to veterans..."},{"comment_id":"1184948411561852","commenter_b":"FOREIGN WORKERS MEANS TAX BREAKS FOR THE COMPANIES AND LOWER WAGES..... ALSO MEANS NO JOBS FOR USA CITIZENS!!!!! TRUMP FOR POTUS - DEPORT THE ILLEGALS AND STOP WORK VISAS !!!!","commenter_a":"In my lifetime, I have been through 3 amnesties. Each was promised to be the last. Does anyone in the Congress, who made this promise to the American people, have enough backbone to honor their word? Seems not. Why believe anything they tell us?","post_message":"Not good."},{"comment_id":"363657737155854","commenter_b":"She needs to die","commenter_a":"Don't watch her either to me she is just stiring up trouble","post_message":"Is Oprah a race-baiter?"}]
