[{"comment_id":"10153229424353352","commenter_b":"What a crock of shit. She's a crazy bitch who needs life in prison.","commenter_a":"Postpartum depression is a real illness. This women obviously is in psychosis; not recognizing her action at the time. Praying for these babies, her husband and her. When she is in her right mind; she will have to live with this action for the rest of her life. Also, if her husband and doctors were aware of her illness; they should also be accountable. A women this sick should never be unattended with her children. I pray for these babies health.","post_message":"Army wife says she slashed throats of her three crying babies with kitchen knife to keep them from disturbing her Special Forces husband"},{"comment_id":"10156550497830354","commenter_b":"It would seem to me that either of the following words would properly describe this situation; Epic... Fail, Fell, Fall.","commenter_a":"Weedoing out the useless.","post_message":"Distracted walking while using an electronic device led one man to a deadly 60-foot fall off a San Diego cliff on Christmas Day..."},{"comment_id":"1032254556867364","commenter_b":"I wonder if she was addicted to the same drugs smuggled across the Mexican border due to our insufficient border protection... #TRUMP16","commenter_a":"Oh Chelsea, what a story you have now, and a calling for the rest of your life... Nobody can tell the story you have to tell now!!! Hold on to that sobriety and to God, one day at a time... I love this... And love how well Hillary listens... #ImWithHer !!!!!! Sobriety means EVERYTHING!!!!! The best thing, of course, is to never even START drugs....","post_message":"\"I started doing drugs when I was 12 years old. At 15, I was doing anything I could really get my hands on.\" Substance abuse and drug addiction hurt our kids, friends, neighbors, and loved ones. We've got to solve this."},{"comment_id":"10156546943220354","commenter_b":"THIS SHAMEFUL........","commenter_a":"What a piece of shit","post_message":"And then he said where he promises to MOVE if Trump DOES win..."},{"comment_id":"10153155041977439","commenter_b":"Her. Defence allah made me do it ☺","commenter_a":"I hope they arrested this trash!","post_message":"MIAMI AIRPORT JIHAD TERROR: Muslim rams her car into a checkpoint and screaming in Arabic, threatens to BLOW UP airport. Go to pamelageller.com"},{"comment_id":"10153270898427217","commenter_b":"Wife is an idiot to allow this! Publicity stunt completely!","commenter_a":"Great job, idiot parents. Way to teach your kids how to be sexist, abusive morons early in life.","post_message":"🎄🎄 Funny or offensive? 🎄🎄"},{"comment_id":"1058693167521161","commenter_b":"I died a long time ago, no girl cares about me and it's quite clear.","commenter_a":"Telling the women that you Love, that you Love her.","post_message":""}]
