[{"comment_id":"10155570976260603","commenter_b":"A woman of her word. Bet that room is clean.","commenter_a":"Crazy old bat.","post_message":"She told her grandchildren that if they didn't clean their rooms, they would lose their pets. The family cat was later found in the freezer.   Robin Smith KMOV is in Madison County finding out more on this animal cruelty case and the possible punishment she could be facing on News 4 at 5:00."},{"comment_id":"10153629881103188","commenter_b":"So why aren't the women and children coming instead of all the able bodied young men who destroy things when they get to Europe?","commenter_a":"Wolves in sheep clothing!! Wake up Europe and do not be so naive!! Do not grant any of these people permanent citizenship. Send all able bodied back to Syria to fight for their country!!","post_message":"Millions of fleeing refugees are crashing into Europe like a tsunami."},{"comment_id":"10152869817141130","commenter_b":"Sounds like you're a bitch who can't take a compliment.","commenter_a":"Maybe because when men try to pick me up it goes like this: Them: \"Hi, gorgeous.\" Me: \"F*ck off.\"","post_message":"\"It's not that I'm opposed to meeting someone. I just don't feel it's necessary.\""},{"comment_id":"10153288827596523","commenter_b":"@username her momma should have taught her manners, and respect, you might consider doing the same.","commenter_a":"That poor little girl just learned she can cause problems, then ignore her teacher and the school administrator and the police. She really learned a lesson, didn't she?","post_message":"The South Carolina deputy who slammed a disruptive student on the floor and tossed her several feet has been fired."},{"comment_id":"10153681874356130","commenter_b":"Did he build the wall?","commenter_a":"The Pope is a hypocrite. Take down the Vatican walls and let people enter freely and demand to be taken care of.","post_message":"Satan For President? @webpagelink"},{"comment_id":"10152817094974877","commenter_b":"I agree zimmerman was guilty as -ell. But this woman is even more guilty if you research her case. I feel sorry for the next man she meets. She'll kill the next one for sure.","commenter_a":"This is crap! This woman should be allowed to live her life....she didn't take a life...meanwhile George Zimmerman roams free! This is why it is important, people, to vote - local elections affect you more than national elections....VOTE, VOTE, VOTE!","post_message":"Marissa Alexander is officially a free woman, delivers powerful statement to reporters. Read the details of her release below.  Grio fam, will Alexander's case inspire more changes to Florida law?"},{"comment_id":"1642423912674968","commenter_b":"@username health INSURANCE is NOT health CARE","commenter_a":"Wait....hold on a second. Usually stories like this are about people fighting to keep someone alive who wants to die. This time, this poor guy wants to live and the hospital wants to take his life, while he is coherent and of sound mind? I didn't read the story, but I would bet this is all because of $$$ or medical insurance!","post_message":"Heartbreaking video shows Chris Dunn nodding and putting his hands together in prayer when asked if he wants to live."}]
