[{"comment_id":"1520981961255162","commenter_b":"And this coming from someone that used an \"excuse\" to avoid draft?","commenter_a":"This man is pitiful.","post_message":"Donald J. Trump suggested veterans suffering from PTSD are not \"strong.\""},{"comment_id":"1757645291122332","commenter_b":"@username or because the people who own the farms/fields can get away with paying illegals less money than legal citizens. Lived in a farming town and saw it happen all the time. I have no problems with anyone coming here legally, paying taxes and doing everything else American citizens do.","commenter_a":"This video only proves that we need Trump. Every statistic stated was \"illegal\" immigrants working in our country. I honestly thought it was a joke. Time for Americans to start working again and quit hiring illegals to do the jobs.","post_message":"If Donald Trump's immigration plan came true, the results would be scary. See the biggest immigration myths here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"10154869505163812","commenter_b":"Yuck","commenter_a":"Bill Clinton is the pig lets talk about what he did to woman .","post_message":"In light of the release of a recording of a vulgar conversation Donald J. Trump had where he brags about groping women, it seems that very little appears to have ever been off limits for the Republican presidential nominee."},{"comment_id":"608045926060248","commenter_b":"Try saying dick her dick her. Another girl commented saying it coulda sounded like that. Lol","commenter_a":"I have alexa... She doesnt curse. She bleeps(literally) out inappropriate words in her speech automatically. Idk about this. I'm gonna try it.","post_message":"An innocent request turned awkward real fast! #WSHH"},{"comment_id":"10153811060584614","commenter_b":"Take the guns....and the illegal criminals will be the only ones with them...","commenter_a":"90% of the immigrants are Muslims male between 18 - 30..and are military savvy....the are probably guilty...a planned take over.....Germany is next...","post_message":"Update: At least 150 people were killed in Friday's Paris and Saint-Denis shootings and bombings, French officials say."},{"comment_id":"1006112072821407","commenter_b":"Demand Justice..Hillary doesn't deserve a Free ride.....","commenter_a":"Clinton Mafia is on the Move #NeverHillary #NeverAgainBill!!!","post_message":"FBI Director James Comey detailed Hillary Clinton massive destruction of government records and grossly negligent handling of classified information. Frankly, there a disconnect between Comey devastating findings and his weak recommendation not to prosecute Hillary Clinton. Federal prosecutors, independent of politics, need to consider whether to pursue the potential violations of law confirmed by the FBI."},{"comment_id":"395107284010899","commenter_b":"asshole mother fuckers wow","commenter_a":"Democrats are acting like children.","post_message":"Democrats LASH OUT at Netanyahu, Tell Him to Go Home, Call Him “a Child”"}]
