[{"comment_id":"517780028410290","commenter_b":"Send them to a boot camp along with their parents, they soon will learn respect! And cut off their welfare,so tired of supporting these aminals!!!","commenter_a":"THE BOY IS A PUNK","post_message":"INSANE..."},{"comment_id":"569607529880232","commenter_b":"Karma is a bitch!","commenter_a":"Reap the whirlwind...","post_message":"The students he ripped off are about to get their revenge."},{"comment_id":"10153488967916336","commenter_b":"He does not love America, he should be removed from office. The President has a sworn duty to protect the Constitution and the People of this Republic which he never has. He serves illegals, thugs and his fellow Muslims.","commenter_a":"they served our country they need respect but cannot change stupid","post_message":"'This administration’s decision on who gets memorialized and who doesn’t is puzzling,' Todd Starnes wrote."},{"comment_id":"1595582267404994","commenter_b":"Where in the work would you ever get an idea like that???? You stupid woman!!!!","commenter_a":"This person is so ate up","post_message":"not too bright..."},{"comment_id":"1119027841463579","commenter_b":"Julie, if you want perky get a coffee maker. Geez.","commenter_a":"Wouldnt Dr Carson be a more appropriate choice for Dr Jeffers to endorse? Dr Carson doesnt bash anyone like Trump does. Trump is so rude. Im embarrassed for First Baptist Church.","post_message":"'It's not that Evangelicals have given up on their values, but they no longer believe that government can uphold those values.'  Today on 'FOX & Friends Weekend,' Dr. Robert Jeffress explained the 'huge paradigm shift' in what Evangelical Christians are looking for in a candidate."},{"comment_id":"1735932806679169","commenter_b":"Considering those men put their lives on the line to save ours let them fly the American Flag ,","commenter_a":"This is stupid son of a bitch","post_message":"A Rhode Island city official just called local firefighters “terrorists” and compared them to ISIS for putting THIS on their firetruck.  You just can't make this stuff up..."},{"comment_id":"10154592299555579","commenter_b":"this woman is about one thing only………money and power and fame………….she has sold her soul…...","commenter_a":"WATCH CSPAN!!","post_message":"Laura Ingraham says to 'all you boys with wounded feelings and bruised egos must honor your pledge to support Donald Trump now. Tonight.' Watch full speech here: @webpagelink"}]
