[{"comment_id":"631181740405738","commenter_b":"Deport all illegal immigrants. .","commenter_a":"Yes","post_message":"Sheriff Joe and Donald Trump are joining forces to take on illegal immigrants.  It's about time someone put their foot down and stopped this madness.  Do you think all illegal immigrants should be deported?"},{"comment_id":"10153216177713984","commenter_b":"I have 3 sons--never once did I pack their lunch---for a reason---I wanted them to experience other foods and if they got hungry they would eat what was in front of them---My guys are not picky eaters and like most everything--mission accomplished.","commenter_a":"So people don't want their kids to eat healthy OK LOL!!","post_message":"This unhappy 2nd grader just served up a giant helping of truth about Michelle's school lunch agenda. I bet she had a tough time swallowing this one.  Do you support this kid for confronting Michelle Obama?"},{"comment_id":"1393712353985142","commenter_b":"Someone send this to Senator Warren...but use small words so she MAY understand it!","commenter_a":"No one cares !!!!!","post_message":"Wow! Coretta Scott King gives a thank you to Sen. Jeff Sessions at the opening of the Rosa Parks library."},{"comment_id":"10153372391166509","commenter_b":"Chris? Am I? Interesting. Here I thought I was just pointing out the facts! :)","commenter_a":"Gotta love Global Warming!","post_message":"It's so cold, #NiagaraFalls froze. Photographers were drawn to the breathtaking icy formations: @webpagelink via CNN iReport"},{"comment_id":"10155373545461162","commenter_b":"Black Women abuse their daughters and worship their sons.","commenter_a":"GM, Giving praise to God, that the baby is home safe","post_message":"HELP FIND THIS GIRL: A 12-year-old girl went missing from the Austin neighborhood on the West Side Wednesday afternoon. Claudia Jackson was last seen about 3:30 p.m. when she left her home in the 400 block of South Laramie after she was reprimanded, police said. Anyone with information is asked to call police at (312) 744-8200. \"SHARE\" to bring Claudia home. @webpagelink"},{"comment_id":"10153036151346545","commenter_b":"That's nothing to brag about. we may be the majority but we also hold the majority of the most least paying jobs because most of our \"people\" are uneducated. Illegals are the worst part of our society. My family came here legally, so should everyone else's.","commenter_a":"we are the majority not the minority #vivalaraza #razaunite","post_message":"If only there was some sort of reality show catchphrase we could use at a moment like this to sum up NBC's break with the \"Apprentice\" star..."},{"comment_id":"1242790859084298","commenter_b":"She's a wife and mother. Needs to grow up, cover up, and act like a lady!","commenter_a":"Fortunately the majority of police officers are good, hard working people serving/protecting their communities. Are there a few bad ones? Of course! The media really hypes the bad police officers, the knuckle heads looting and destroying communities \"in protest\". Not highlight the wonderful police officers laying their life on the line to protect our butts. Not highlighting the people that truly feel stepped on and are peacefully coming together with all to promote positive changes. \"Be the change that you wish to see in this this world.\" This is what I live by and teach my children. We should be brought together by love, not torn apart by hate.","post_message":"#EntertainmentNews  And the #BoycottBeyonce battle continues...the singer is being accused of using her recent Super Bowl performance \"to divide Americans by promoting the Black Panthers and her antipolice message.\"  Do you agree?"}]
