[{"comment_id":"10153523758249456","commenter_b":"😂😂😂","commenter_a":"If only they had went to college....","post_message":"Today, 13 people were sworn in as Montgomery Police officers. We'll hear from MPD Chief Ernest Finely, coming up at 6. Let's congratulate the new graduates!"},{"comment_id":"10153185628051615","commenter_b":"Dude we should just start bombing them f*** that worry about the details later","commenter_a":"Come on. Can we stop leaving out important facts like that the passport was likely planted AND fake? World and even French news is properly reporting that. @webpagelink","post_message":"LATEST: A French official says the suspected mastermind of the Paris attacks was also linked to thwarted train and church attacks. Channel 11 Morning News will have updates all morning long."},{"comment_id":"576179842587911","commenter_b":"Sad. But, Karma is a real bitch...","commenter_a":"No matter how you cut it it's tragic, but in regards to Mr. Harmon's vote against firearms training it calls to mind the expression that there none so blind that do not see.","post_message":"In 2013, he attacked proposed legislation in Maine that would have required gun owners to take a firearms safety course ..."},{"comment_id":"10153644969898812","commenter_b":"Those flags do not represent the United States that I love.","commenter_a":"The church did not request it. The church is private property. Why does anyone think that TRASH should be placed on church property? If it is so much \"Southern heritage,\" why was it placed on a predominantly black church? Is that like burning a cross on someone's lawn?","post_message":"Four Confederate flags were discovered this morning by the Ebenezer Baptist Church and the Martin Luther King, Jr. Center: @webpagelink"},{"comment_id":"1208640665842055","commenter_b":"#NEVER HELLARY CLINTON !","commenter_a":"Be careful. People who cross the Clintons have a strange way of \"committing suicide\" by a few \"self inflicted gunshot wounds\" to the back of their heads.","post_message":"CROOKED HILLARY really SCARED  @webpagelink"},{"comment_id":"10153467199834255","commenter_b":"Look bitch, I'm done with you. FACTS seem to hurt your little righty brain.","commenter_a":"I've been hearing these stupid comparisons for days now. How friggin ignorant can some people be? A racist flag flying over a state building and rap music?? Such utter fools.","post_message":"The stupid. It burns."},{"comment_id":"10153746378278984","commenter_b":"A bitch with a hitch............","commenter_a":"Obviously above the law! I guess if you are part of the liberal click you are above the law! Hillary Clinton, Bill Clinton, Obama and all the rest apparently don't have to obey the law like everyone else","post_message":"James O'Keefe's undercover videos strike again. This time exposing Hillary's campaign ignoring and knowingly violating this state's laws - and laughing about it. You will be blown away by what some of Clinton's staffer say is the campaign’s motto. Everyone needs to see this.  Do you think Hillary Clinton would be the worst thing to happen to the U.S. if elected?"}]
