[{"comment_id":"10152967828847061","commenter_b":"Yes legal immigrants ma'am","commenter_a":"I am ashamed at the negative narrow minded comments. Check your heritage. We are all immigrants","post_message":"America Ferrera to Donald Trump: Thanks, your comments will send more Latino voters to polls: abcn.ws/1Iw7NNn"},{"comment_id":"521921487998431","commenter_b":"she's a no good racial bitch","commenter_a":"Typical for ghetto trash","post_message":"Michelle Obama just dropped spent an absurd amount of money on something outlandish.  She is the worst first lady ever. We miss Laura Bush.  Does Michelle Obama's reckless spending upset you?"},{"comment_id":"1755937964626463","commenter_b":"Then. Fuck u bitch","commenter_a":"He also said white people are the Devil, that Jews and whites are evil and he proposed racial segregation in his speeches to the Ku Klux Klan. Be like him? No thatnks","post_message":"He was truly the greatest, and not just because of his accomplishments inside the ring.  The Free Thought Project  #RIP #MuhammadAli"},{"comment_id":"1091917874180626","commenter_b":"MAKE AMERICA GR8 AGAIN 2016! # AMERICA FIRST # BUILD THE WALL!","commenter_a":"Let's see a lot more arrests...these are terrorists!!","post_message":"Democrats' voter outreach to gang members is apparently working..."},{"comment_id":"1067484166661144","commenter_b":"Ignorant woman!","commenter_a":"traitor","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response."},{"comment_id":"10154738811856336","commenter_b":"THE MINUTE YOU VOTE FOR HILLARY CLINTON YOU BECOME GUILTY BY ASSOCIATION FOR HER CRIMES. Think about that for a minute...yep every time you see her, hear her she will be lying, and you become one too...a horrible person! She let 4 beautiful men get tortured, sodomized, and killed, all because she didnt answer her phone. She deleted 33,000 classified emails after she got a supena. She will Open borders for hell to get in. ISIS will kill and you will be guilty of this. You will be guilty by association and all your friends will turn on you! All because you wanted the first woman President...We pitty you if she gets in....you won't get help from us....we will be to busy fighting for our guns to save America from her!...We choose TRUMP, a MOVEMENT beyond your reach.","commenter_a":"r I have watched Megan Kelly for a while now and use to love her show. However, I am so disappointed in her need to make a name for herself that she has sold herself to the devil and we all know who that is. Seriously, the sexual predator comment??? And you call yourself a lawyer, what happened to innocent until proven guilty or does that just apply to the Clintons! Why don't you call out Killary for disgracing the office of Secretary of State or even better her husband who has actually paid money to women for his sexual indiscretions. Oh, and how many people close to them are in the grave?? So @username...get rid of the trash and get some class....Hint'...The Ainsley Earhardt File!!!!","post_message":"'That's not law enforcement. That's selective prosecution.'  Newt Gingrich reacted to the perceived double standard with the investigation into Hillary Clinton's private server, saying 'this is the kind of stuff that in a place like Venezuela, you'd understand.'"},{"comment_id":"1140950715967044","commenter_b":"Lying two faced cutthroat hag.","commenter_a":"If mouth is open lies are being told.","post_message":"BOOM! Coal Miner Calls Out Hillary to Her FACE! Watch her try to 'umm umm babble babble' a way out of it VIDEO  The entitled hag gets slapped with karma! WATCH!"}]
