[{"comment_id":"893147240733824","commenter_b":"If the women go topless I'll go lol","commenter_a":"Aida Nunez really. Kids should not see this. Go home and do that at your own home. At least! Or in your backyard lol","post_message":"Go Topless Arizona organized a protest in Central Phoenix today. The group organized a protest march this morning down Indian School protesting what they view as discrimination against women. The law allows men to go topless,they say, while women cannot. We \"cover\" the story tonight at 9 & 10."},{"comment_id":"10153438772266051","commenter_b":"Ignorant bitch.","commenter_a":"Grow up you spoiled brat.","post_message":"It's easy to see why this encounter between a woman going through the McDonald's drive-thru and an employee has gone viral."},{"comment_id":"494539450746362","commenter_b":"one ugly woman","commenter_a":"Cruz started this slanderous crap and it backfired on him. But he is still trying to blame Trump for a rags publication. But he's right about one thing, we don't give a shit so he can shut the hell up about it. Trump has already moved on.","post_message":"Carly Fiorina accused Donald Trump of being a serial philanderer. Do you think there's any truth to it?"},{"comment_id":"10156788909185354","commenter_b":"She's a dick!","commenter_a":"A good start. Now take back the universities, colleges and America from these thugs!","post_message":"BOOM."},{"comment_id":"10154289456551336","commenter_b":"No it wouldn't be. It's encouraging to see females that still want equality, rather than superiority.","commenter_a":"It's a dress code, then she should be sent home. Would this still be a story if a man was sent home for not wearing a tie?","post_message":"Dress code violation or sexism?"},{"comment_id":"975345569191587","commenter_b":"Mr, Dugger wanted a woman with no personality.","commenter_a":"Depends on what viewpoint your looking at. A successful marriage is not solely dependent on sex which is something your husband didn't know or taught to his son","post_message":"Michelle Duggar also says she's saving she and husband, Jim Bob’s, 'intimacy notes' to share with her daughter, Jill. Can you say, “EW!”?"},{"comment_id":"10152564778122623","commenter_b":"What I don't understand is why would anyone want to follow her? Congratulations you got video of her stopping and starting over and over, all the while you are driving in wet conditions with one hand, with a child in the car??? Plus this crazy lady could have gotten out WITH a gun and killed the woman driving and the child. People need to just let road raged people go. Just pull off to another road or whatever, get a tag number and call 911. Leave it to the authorities. She should be thankful for her life.","commenter_a":"I'm glad the nut case was turned in and charged.","post_message":"It's the video everyone is talking about. The woman recorded in a terrifying road rage incident in Randleman has been charged."}]
