[{"comment_id":"10154789025934641","commenter_b":"If wonder woman can do it ..so can I","commenter_a":"This is so disappointing. Anyone petitioning for the removal of Wonder Woman as ambassador, clearly doesn't know the history of the character. Peace Justice Equality ...and more. Bottom line: basing her removal mainly on appearance - is sexist. Look at male superhero costumes. They leave little to the imagination also. No one is hollering about that. As a feminist, I understand that the sexual objectification of women is a huge problem in our culture. The answer is not to force women to cover up. The answer is to allow women to express themselves without fear. The answer is to teach our boys how to behave. Read the comics. Read the history of the character. Read scholarly articles on WW as a feminist icon. She has pro-women zingers that make me cheer! Many parts of her \"sexy\" costume are actually powerful symbols. Do some research. I know there are more important ...","post_message":"Wonder Woman has been stripped of her role as UN honorary ambassador less than two months after the appointment was made."},{"comment_id":"10153359529326051","commenter_b":"I would have beat her ignorant ass with a stick too. Hopefully karma hits her with a Mac truck.","commenter_a":"And that is why I dont trust daycares","post_message":"When this woman's 2-year-old son came home with these marks on his leg, she marched down to his school and demanded to see the surveillance footage. Now she's even more outraged."},{"comment_id":"1053133688060436","commenter_b":"What!!!???","commenter_a":"We're number 1!! We're number 1!! Oh wait......","post_message":"While the rest of the world is reducing maternal deaths, the number of pregnancy-related deaths in the U.S. continues to rise. In fact, America now has the highest rate of maternal deaths in the Western world."},{"comment_id":"891767890959271","commenter_b":"She is so evil ...","commenter_a":"Ps..any one remember Al Gore and how graciously he accepted defeat..and why would HIllary allow science and fact to get in the way..","post_message":"Fact-Check: Hillary Clinton’s claim that partial birth abortion should be protected due to a number of women who have serious health issues is not supported by research."},{"comment_id":"993863733987432","commenter_b":"Shut up Meg","commenter_a":"If only this call had been made in September 2001.","post_message":"That's probably not the kind of congratulatory phone call Netanyahu wanted."},{"comment_id":"1784321135174854","commenter_b":"No you not voting makes you a hypocrite","commenter_a":"I am so done with this mentality.","post_message":"\"...the oppressor isn't going to allow you to vote your way out of your oppression.\" Colin Kaepernick explains why he didn't vote."},{"comment_id":"10152976985741636","commenter_b":"some clothes are made smaller then others, i can buy jeans at one store that are size 14 i can go too another store that has jeans that are size 14, the same day and there too tight so my point is sometimes different stores vary greatly in size so you have to wear bigger sizes because of how they are made","commenter_a":"the problem with this story is this....the young girl was NOT directing her comment at anyone but the shirt itself. I am a larger sized woman and have done the same thing when I found clothes that were super large. It's not a slight to those who are larger than me and I'm sure it wasn't meant that way by this girl. If you are that sensitive by your size, then stay at home or do something about it. I have been called names my whole life because I'm not a size 2 or even a size 12. What others think of my size is none of my business. If they allow my \"size\" determine whether they want to know me or not, I don't care. It's their loss. I'm pretty freakin' awesome once you get to know me. I like me. I'm confident in who I am on the ...","post_message":"A photographer is getting a lot of attention after a picture in a dressing room went viral."}]
