[{"comment_id":"10153530026483707","commenter_b":"What have Senators Done??? over 30 some years.. Trump is 1000 percent Correct.","commenter_a":"McCain is a scumbag traitor. He was codenamed \"songbird\" by the NVA when he was a pampered guest at the hanoi hilton. He has done more harm to veterans as a senator than could be believed. He is no true American hero. Piece of filth.","post_message":"Congrats to my daughter Meghan on her new nationally-syndicated show, starting July 20th - very proud of you! Learn more:"},{"comment_id":"1322851284474589","commenter_b":"Or help take care of them in Forster Care?","commenter_a":"Not realistic, there are many people looking to adopt. The murdering of unborn children is not justifiable.","post_message":"Accurate."},{"comment_id":"10156198873145354","commenter_b":"Screw Faux News and that bitch Megyn Kelly.","commenter_a":"FOX is decending to a new low leval! I used to have it on all the time but now i will just tune in for one program!","post_message":"We have the intense Twitter exchange between Donald Trump and National Review editor Rich Lowry. Read the tweets!"},{"comment_id":"10156317776015354","commenter_b":"Stupid ass!!!!","commenter_a":"Sounds like a plan to me.","post_message":"“No surprise that someone who makes a living glorifying crime and violence is a cop-hater, too.” MORE..."},{"comment_id":"1270876669600008","commenter_b":"Jean Miche","commenter_a":"We aren't. Some may be.","post_message":"Why is a fear of spiders so common?"},{"comment_id":"595790673878859","commenter_b":"SHE NEEDED TO LEAVE!!!","commenter_a":"Ragheads go home .","post_message":"This Muslim woman walked into a salon and demanded all the men leave so she could remove her headscarf. It didn't take long for her to realize she had made a huge mistake and this hairdresser was not going to accommodate her entitled behavior."},{"comment_id":"1271166009570419","commenter_b":"Get some sleep pretty lady","commenter_a":"The story that will never die.","post_message":"The DNA analysis that prompted a Colorado prosecutor to exonerate the family of 6-year-old beauty queen JonBenet Ramsey in her 1996 murder was not as clear cut as she portrayed it at the time, a newspaper reported on Friday."}]
