[{"comment_id":"509520402579803","commenter_b":"I see the women back of her. The men look like they have been photo shopped. Or they are pansies and do what their wives tell them to do. Maybe they are cardboard cut outs.","commenter_a":"Ever notice how the Dems always have people behind them when they're making speeches? They must have to promise to cheer a lot and be supportive. One boo and they're carried out by security.","post_message":"\"Donald Trump says I’m playing the woman card. Well you know what I say if fighting for child care, paid leave, and equal pay is playing the woman card – then deal me in!” Moments ago, Hillary Clinton gave a speech responding to Donald J. Trump's criticism."},{"comment_id":"10156046301859896","commenter_b":"Romona de Araujo Lol lol lol lol lol lol Lol lol lol lol lol lol You think someone who earned a living from porn and NEEDED TO READ A PRAYER...THE MOST COMMON OF PRAYERS... FROM A TELEPROMPTER IS THE VEHICLE TO BRING GOD BACK INTO AMERICA. OMG ...WHAT THE HELL IS WRONG WITH YOU. IN ADDITION, LET ME REMIND YOU THAT SHE HAS MADE A CONSCIOUS DECISION TO REMAIN MARRIED TO A SELF- PROCLAIMED SEXUAL PREDATOR. MY DEAR GOD WAS NOT SMILING DOWN IN APPROVAL AT MELANIA, AS SHE READ RELIGIOUS WORDS OFF A TELEPROMPTER ... HER ATTEMPT TO BRING A PRAYER INTO HER ACT ....OF ATTEMPTING TO CON US INTO BELIEVING SHE IS RELIGIOUS ....WAS A TOTAL DISRESPECT TO THOSE OF US WHO ARE TRULY RELIGIOUS AND HAVE THE LORD'S PRAYER IN OUR HEARTS AND LIVE BY THE WORDS OF THAT PRAYER. FANTASTIC....YOU NEED TO LOOK UP THE WORD ...","commenter_a":"Of course satan and his demons would be offended. I think she was fantastic!! Take God out of any country and it quickly loses it's greatness. It's about time America's bringing Him back.","post_message":"Progressive \"Love\" and \"Tolerance\":"},{"comment_id":"10154441251316756","commenter_b":"Dousing has been around for a long time.","commenter_a":"Funny how those diving rods never find the plumbing or septic tanks..","post_message":"Our reporter says the rods she was holding \"forcefully cross[ed],\" without her moving them. She doesn't know how it happened."},{"comment_id":"10154755276262619","commenter_b":"Heads up!","commenter_a":"Natanyahu is not an Orthodox Jew. He is a secularist.","post_message":"The Israeli Ministry of Defense Missile Defense Organization head Yair Ramati has been dismissed from his post due to grave security violations."},{"comment_id":"10158044327420354","commenter_b":"Yes then a finger dipped in purple dye.....lol","commenter_a":"Funny how these so-called \"errors and glitches\" always favor the democrats. Personally, I used a paper ballot.","post_message":"***BREAKING***"},{"comment_id":"10153176001911336","commenter_b":"They could rename the White House, Geratic Ward","commenter_a":"91% huh? @username lol","post_message":"\"I think I've got a good message. I think I've been more right than wrong on foreign policy.\" Today on Fox News Sunday, Sen. Lindsey Graham said he is considering running for president if he can raise enough campaign funds."},{"comment_id":"581504818688172","commenter_b":"we are \"nasty women\" and we vote!","commenter_a":"Your mother always said that you were a disappointment and a nasty little creep.","post_message":"The conviction of an Iraqi refugee plotting to blow up the Houston Galleria is exactly why I've been pushing so hard to immediately suspend the refugee program from terrorist hotspots. The current program is a Trojan Horse allowing ISIS and other terrorist groups an open invitation into the U.S."}]
