[{"comment_id":"660919517348095","commenter_b":"People who live in glass houses shouldn't throw rocks !","commenter_a":"Shame on this evil woman, in my opinion....Netanyahu is a friend, and what he has to say matters...If they, meaning the President, White House and Senators are worried about his visit, then WHAT ARE THEY COVERING UP? That is the question.....Bibi is an honorable man, and Americans trust him, more than someone like Feinstein.....Sit down, and let Bibi speak, Americans want to hear him.","post_message":"Senator Dianne Feinstein says Bibi is ‘arrogant’ when he claims to speak for all Jews. But, she still plans to attend the controversial speech."},{"comment_id":"10153818538521519","commenter_b":"She's ok with a total asshole who may blow up the world though apparently","commenter_a":"Her son did NOT even work for the State Department, he worked for the the CIA. Her comments and opinions about Hillary are completely irrelevant.","post_message":"Pat Smith at RNC: Hillary Clinton \"deserves to be in stripes\"..."},{"comment_id":"10156188886135354","commenter_b":"Suzanne, you're a dumb bitch. Shut the fuck up","commenter_a":"Scott walker Mexican Americans legals are against illegals we are with DonaldTrump not because we are Mexicans but this is our country n our children need a better America not free loader hard working for a better America since 1800 hundreds my family been hereover 200 hundreds years we love America we have to be great again my decision n my family DonaldTrump is the great America we need","post_message":"Scott Walker calls for a “limited number of candidates who can offer a positive conservative alternative to the current front-runner.”"},{"comment_id":"627551224082449","commenter_b":"What a nasty woman. ...","commenter_a":"Rosie is totally against any heterosexual type of sex,she would prefer all people were gay like her.s","post_message":"Rosie O'Donnell called Donald Trump a “demented human being,\" a “sexual predator,” and several other nasty things."},{"comment_id":"636835003152516","commenter_b":"In these cases the police are the terrorists","commenter_a":"Balck white man woman cop civilian.. the real enemy is Terrorism.. and they are using all this crap to keep us from conentrating on them","post_message":"An important conversation for America. President Obama participates in special town hall event on race, justice, and policing. @webpagelink #POTUStownhall"},{"comment_id":"657416461115599","commenter_b":"MAYBE SHE NEEDS MENTAL HEALTH !!!!! IF SHE IS THAT BLIND TO WHAT IS HAPPENING IN AMERICA WITH O BUMMER AS PRESIDENT , SHE MUST NEED GLASSES TOO !!!!!!","commenter_a":"She is a traitor and Muslim just like her husband. Impeach him and send all of them back to their Muslim homeland.","post_message":"Michelle just told her biggest lie to date... Her and her husband are liars, plain and simple. Do you agree the Obamas are traitors to America?"},{"comment_id":"1225420670803521","commenter_b":"KICK THEM OUT","commenter_a":"Whatever happened to the US Military Academy's Code of Honor? If it's still in effect, those who raised a fist should be court-martialed.","post_message":"Concerns arose that the pose violated Pentagon rules on avoiding political activity by paying tribute to the civil rights-era Black Panthers group or to the present-day Black Lives Matter protests."}]
