[{"comment_id":"10154342764073701","commenter_b":"Listen to yourselves! Stop just stop! Do you realize that YOU are part of the problem?","commenter_a":"People, they are donating money to people in need. That's it! Why is everyone in such a hurry to provoke anger. Myself I feel all that needs to be said is, Thank you Disney!","post_message":"Disney announced it's donating $1 million to a fund set up to help those affected by the attack at Pulse nightclub in #Orlando."},{"comment_id":"10153228177684411","commenter_b":"Yes, and Russia is one of them, no?","commenter_a":"The only reason that Putin has troubles on his borders is that he steadfastly refuses to keep his troops within them. Russians need to elect a leader committed to managing their economy effectively instead of pursuing fantasies of reconstituting the old USSR.","post_message":""},{"comment_id":"10153170547614170","commenter_b":"She will find a way to get out of it!!","commenter_a":"The Clintons are just like Obama, Lerner & Holder who all believe they are above the law.","post_message":"I don't know if people realize how big this is. It's such a serious violation of the law, even the New York Times is calling her on it And it's all because this woman is an obsessive control freak."},{"comment_id":"1137364809637709","commenter_b":"Love you Scotland just stay safe","commenter_a":"Go Scotland ❤️","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."},{"comment_id":"1309116862459880","commenter_b":"Now if they can do something about her mouth....","commenter_a":"Seeing as she is costing taxpayers tons of $$$ for her moronish actions maybe a class action suit should be filed against her for $100M","post_message":"Just in!!"},{"comment_id":"10152987066401336","commenter_b":"She is a f*&king idiot","commenter_a":"Once again the State Department speaks nonsense. Save your money - don't send your kids to Universities if she is any example of what they are turning out.","post_message":"“This is an insult to all the people in the world who are actually poor and are not blowing people up and not targeting Christians.\"  Laura Ingraham slammed U.S. State Department spokesperson Marie Harf’s suggestion that job opportunities are a way to fight ISIS. @webpagelink"},{"comment_id":"10155086902812235","commenter_b":"UK agrees Americans you created this problem now fix it Europe do not want a war","commenter_a":"How much longer are the American people, the ones who didn't vote this idiot in, going to let this go on, this ego maniac is ruining your beloved country, it is the laughing stock of the world thanks to him, how can any government anywhere take this moron seriously and trust him with anything, he lies through his teeth, blames everyone else for whatever is going on, it has only been 4 weeks and look at the state of things ! My thoughts are with the American people who didn't vote for this buffoon, i hope your country can get rid quick and recover from his dreadful influence !","post_message":"\"I was hoping you could tell me what the f*ck is going on over there?\" - European security services ask."}]
