[{"comment_id":"535176933316799","commenter_b":"give them hell Mr Trump,she makes me sick everytime i look at her","commenter_a":"Enough of these two !","post_message":"The heat-seeking Trump tweet you just HAVE to see..."},{"comment_id":"10153260544144614","commenter_b":"What a coward b*tch","commenter_a":"Wow, he smacked that kid like it was a game! He needs his adult status revoked.","post_message":"Disturbing surveillance video shows a young boy being slapped by a man and falling to the ground in a Bakersfield grocery store. Justin Whittington, 23, was taken into custody in connection with the incident after the video was posted on social media and went viral. He was being held on $1,000,000 bail. The boy was not seriously injured, authorities said. Read KTLA's story here: @webpagelink"},{"comment_id":"900665266646768","commenter_b":"abortions have been going on before obama ever took office","commenter_a":"Abortion is indeed murder, and he is the ring leader behind it all.","post_message":"Eight years with a pro-abortion radical is eight too many. No more pro-aborts in the White House!"},{"comment_id":"10153941419749614","commenter_b":"how is she an idiot, Frank? your original post does indeed come across as victim blaming. rapists don't discriminate. it doesn't matter if it's 9pm or 9am - if they wanna rape someone, they will do it. also, this girl was with her father so I'm sure she felt pretty safe to be out after dark.","commenter_a":"Why would they be at a Playground in Brooklyn around 9 p.m.???","post_message":"Update: Police say they have four of the five males in custody in connection with the incident. Original post: New York police are looking for five men who forced a father at gunpoint to leave his teen daughter behind so they could take turns raping her, authorities say. The 18-year-old was with her father at the Osborn Playground in Brooklyn around 9 p.m. Thursday when the brutal gang rape took place, according to NYPD. Authorities released this grainy surveillance video, taken in a bodega before the violent assault, that they say shows the suspected attackers. Police are asking for the public's assistance in identifying them. Read KTLA story here: @webpagelink"},{"comment_id":"882254358503349","commenter_b":"My child would be instantly removed!","commenter_a":"Yes it would and yet silence from the sooo offended group.","post_message":"ISLAMIZATION: LA Public School: Teaching Kids Is The One True God (VIDEO) @webpagelink"},{"comment_id":"10153980272751943","commenter_b":"Why is she smirking???? Are they really that sure that they'll get away with their crimes??","commenter_a":"Hillary has such a ditz as chief of staff? She \"wishes\"? She \"never thought about it\"???? Totally lame-brain in her knowledge regarding working in such a sensitive area...... She plays dumb...","post_message":"Hillary Clinton chief of staff during her time as secretary of state, Cheryl Mills, said she simply never thought about the prospect that some of Clinton private e-mail exchanges wouldn be retained under federal records laws. \"I wish I had thought about that subset,\" Mills said in a deposition released Tuesday by the conservative government transparency group Judicial Watch. \"I wish I had thought about the fact that someone could be nongovernment and records might be not being captured. - via Bloomberg"},{"comment_id":"10153423522201636","commenter_b":",,,keep yer head down and leave the building!!!","commenter_a":"I KNOW WHY,,, never ever ever ever talk about PERIODS when a woman has her period!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! :O","post_message":"The answer is simple"}]
