[{"comment_id":"10153437934696943","commenter_b":"Hillary did. She locked herself up in closet to take him down. That was when she lost her bar license for being both unethical and lying.","commenter_a":"Frankly, the Obama presidency, with all its scandals/crimes, has set incredible legal precedence for defendants to get away with almost anything, from lying, to destroying evidence, to treason, to tax evasion, you name it. Now, anyone accused of anything can simply demand equal protection and have their attorneys cite any one or all of the Obama Defenses.","post_message":"*** UPDATE *** This was a very big week for us, with tremendous results! As has been widely reported, we found almost a five-month gap in the emails Madam Hillary reluctantly returned to the State Department last year. But there more to the story..."},{"comment_id":"10153519153652042","commenter_b":"Men go crazy over some pussy..smh","commenter_a":"Men gon wild..smh","post_message":"WANTED: This man allegedly shot the mother of his children twice in her face, police say."},{"comment_id":"10154136860436051","commenter_b":"She does crack","commenter_a":"Clinton and what is that obsessive sniffing","post_message":"Who won the debate: Trump or Clinton?"},{"comment_id":"949410461745800","commenter_b":"well said Bonnie","commenter_a":"I am from Middle East and full face cover has nothing to do with Islam, it is clearly oppression of woman. Disgusting. Those who say this is freedom of choice or religion should also be sympathetic to Nazi insignia or brutality","post_message":"What do you think?"},{"comment_id":"10153458308386336","commenter_b":"He'll build housing for the illegals on it.","commenter_a":"this man should be named adolph hitler.","post_message":"Despite Republican resistance, Pres. Obama announced the creation of three national monuments, encompassing more than a million acres of protected sites in Nevada, Texas and California."},{"comment_id":"1146865702064592","commenter_b":"OMG, Catherine. Did you really say that? go wash your brain out with soap.","commenter_a":"Hillarys people Bribed the FBI to changed subpoena documents and change it from classified to a lower classification . If they can do something so illegal and get away with it. Think how the government can come after ANYONE! the Media owned by global elitist, Hillary is their puppet.","post_message":"Image from Meme GOP"},{"comment_id":"10153102018738822","commenter_b":"What is wrong with these women!?","commenter_a":"Dumb fkn bitch","post_message":"A mother has been arrested after she left her baby on the side of the road in Maryland this past weekend."}]
