[{"comment_id":"1382411831811576","commenter_b":"No reason to make threats or warn the Racist idiots..........when they start a ruckus, we'll bury them!","commenter_a":"..and people like you want to start a race war. You can't win that one...","post_message":"@webpagelink"},{"comment_id":"10154393915434170","commenter_b":"They will find other ways !","commenter_a":"Guess the \"New World Order\" has been reordered....all the elites that envisioned a single Global Society can pretty much shove that right where it belongs!! :)","post_message":"The elites are having a meltdown, but the people of Britain have spoken. We've got the reaction from Donald J. Trump as well."},{"comment_id":"10153365976956955","commenter_b":"Political parasites.","commenter_a":"Anyone who signs new gun control legislation that infringes on the second amendments should be tried for treason","post_message":"HERE THEY COME: CONGRESS TAKES UP GUN CONTROL"},{"comment_id":"805771119613465","commenter_b":"The woman has no class.","commenter_a":"Laura Bush...a REAL FIRST LADY WITH CLASS...not the thing we have now , a disgrace!","post_message":"Laura Bush SLAMS Michelle Obama Right To Her Face In Front Of Everyone. This is awesome. We love her. Can we get 5,000 'LIKES' for Laura Bush?"},{"comment_id":"10154018789591491","commenter_b":"@username littel girls like that crap thats why.","commenter_a":"Because boys can grow up to be whatever they want, but girls will grow up to only want to look pretty and wear cute clothes...","post_message":"Amy Schumer and Blake Lively are not happy."},{"comment_id":"10154455210992577","commenter_b":"Mite as well. Hillary going to rig it so why not lol","commenter_a":"If the biggest criminal in the world doesn't want all that competition from Hillary who can blame him?","post_message":""},{"comment_id":"1168375003221975","commenter_b":"This smacks of Naziism!! He is trying to intimidate the minority vote. He is so disgusting and despicable . We must come out in force to stand up to this type of scare tactics!!!!","commenter_a":"Well in my State, of Washington, like many other States, voting is done by mail or can be dropped off at drop boxes for elections only. So will his people be harassing the Postal employees? And for any States that still go to the polls, those State governments better damn well make sure that ALL citizens can get to their polling places unmolested. And if that means with police protection, so be it. Then, charge the GOP for all of the overtime for said protections that will need to be paid.","post_message":"Unable to win, Trump now looks to blocking Hillary voters with an army of deranged volunteers."}]
