[{"comment_id":"10154411705371336","commenter_b":"@username Did you purposefully neglect the part that this is what happened in every parts of the Earth? They did the same thing with the Aborigines here in Australia, when Arabs invaded Constantinople and established Istanbul...smh","commenter_a":"She is one of the few Christian celebrities. God Bless Her. Amen this nation was founded on Judeo-Christian values.","post_message":"Candace Cameron Bure is grateful to be living in the USA because \"we have the ability to love God here.\""},{"comment_id":"10156022193165294","commenter_b":"That's incredible o be married that long. Now people marry 15-20 years and that's it. I hope to live this long and still have my husband around. This is what young couples should be using as example, If you can be married that long, theres nothing that can break you!","commenter_a":"Many yrs ago my grandparents were in same room at the hospital though, normally its two female or two male in ea room . It is very nice to keep them together.","post_message":"\"Because they were on the orthopedic surgical floor, none of those rooms have double occupancy so they couldn’t be together, and it was clearly breaking their hearts.”"},{"comment_id":"10155363897415231","commenter_b":"She's gorgeous!!! You go girl!!!","commenter_a":"Wow!! Gorgeous baby!!!","post_message":"She was bullied because of the color of her skin, but she fought her way through the tough times to now become the recipient of a $10,000 scholarship. @webpagelink"},{"comment_id":"10154424174381162","commenter_b":"It's the Ocean. Dangerous animals live there. Leavem alone","commenter_a":"Or he could have just left it alone and the family move to a safer place? Sounds so unnecessary...","post_message":"A dad celebrating Father's Day wrestling an alligator on a beach before it's able to attack his family and others. FULL STORY: @webpagelink"},{"comment_id":"850014095139630","commenter_b":"Those illegals and Refugees are everywhere,and plenty of them,obama has been busy letting them in the last 8 hills,hillary killed off soldiers[American] and wanted muslims in,guess she wanted to kill babies that was full term so they would not grow up for the usa,,what a mess,in the usa,why don;t they stop all of this junk? This is America?","commenter_a":"So I have posted this many times.... How many of our citizens have to die or be injured before these Far Left Dems understand and see the light! These illegals and Refugees are not good people......","post_message":"John Kasich opened up Ohio's borders to refugees and himself to a tidal wave of Twitter hate..."},{"comment_id":"10153798525078352","commenter_b":"She needs to be punched in her mouth","commenter_a":"she's just horny.","post_message":"VIDEO OF RACIST WHITE LADY SCREAMING NI@@ER AT KIDS GOES VIRAL AND SHE SAID SHE'S NOT SORRY FOR IT! (VIDEO)"},{"comment_id":"10155514073390354","commenter_b":"Oh darn...NOT!!! Good riddance!! Hopes they ALL go up in flames. Enjoy those virgins, buttholes!!!","commenter_a":"Another dead terrorist, WOO HOO!!! KILL THEM ALL, LET GOD SORT THEM OUT!","post_message":"Height: 5'11\" Chest: 40\" Waist: 32 Currently Not Available for Bookings"}]
