[{"comment_id":"595270947330151","commenter_b":"Absolutely the most corrupt female politician! Bad for the US!","commenter_a":"Hillary is a PIG","post_message":"Hillary Clinton wants the Fox News host's head, but she's not backing down. She is in trouble. Let's show her our support. Can we get 10,000 'LIKES' for this Fox News Host's stand against Hillary?"},{"comment_id":"254814161629338","commenter_b":"She is a big mouth stupid bitch . They all are","commenter_a":"Can't watch this show anymore...it's all about political bashing.","post_message":"The View host Joy Behar just launched an attack on Barron Trump. This is terrible. She should be absolutely ashamed. Can we get 10,000 'LIKES' to have The View cancelled!"},{"comment_id":"915117481938364","commenter_b":"One day her money,scheming,and life of cards will come crumbling down in front of the world. How can billy bob clinton show his adulteress face. They are shamefull. And not the only ones. They better get their life righ fir the next.","commenter_a":"yes...why should Hillary get away with what she has done,if it was any of us we would go to prison,so yes send her to prison along with Obama","post_message":"No wonder The Hildebeest hates... The Donald. @webpagelink"},{"comment_id":"10154603481037994","commenter_b":"How can you kid nap your own kids is as stupid as how can your rape your own wife","commenter_a":"That's messed up. I wish I knew more but she shouldn't have to go to jail. She's a mom and those are her kids. She shouldn't have done what she did but at the end of the day those are her kids too.","post_message":"The mother was scheduled to return the two little girls to their father -- but never came back."},{"comment_id":"10153706992631955","commenter_b":"Let's bpmb those fagots.","commenter_a":"The machine that makes invincible passports! We must take it for the empire!","post_message":"ISIS May Have Passport Printing Machine..."},{"comment_id":"10155489129664657","commenter_b":"Not with a Republican Senate she isn't!","commenter_a":"as soon as these two women are no longer useful they will be out, they are pawns.","post_message":"Uh oh."},{"comment_id":"760141017451798","commenter_b":"he also spoke at her rallies against Obama Care!! he should be thrown out for being publicly biased BC he knows he had to make decisions on it so it is illegal for him to do that!! his teaturd wife is insane too!!! apparently if your rich, you are above the law! time for a big change here!!!","commenter_a":"And what about Thomas \"inadvertently\" forgetting to report 1.6 million in income his wife earned lobbying and speaking against healthcare? How is he still on the Supreme Court?","post_message":"Very interesting."}]
