[{"comment_id":"10153942931813132","commenter_b":"Show this picture to the stupid drunk driver!!! Ask her if it was worth it!!!","commenter_a":"Blessings!!!","post_message":"Unbelievably sad."},{"comment_id":"10150832219144999","commenter_b":"Are women able to have more than one husband?","commenter_a":"Polygamy is legal in my country.","post_message":"Could the U.S. Supreme Court decision that recognized a right to same-sex marriage presage a constitutional right to plural marriage? Read on in The New York Times Opinion."},{"comment_id":"1333824080002554","commenter_b":"@username love that red dress","commenter_a":"Jessica Phillips @username Jasmin Pluto this is great","post_message":"WTF does \"girlfriend material\" even mean?..."},{"comment_id":"1095951603760962","commenter_b":"Don't forget her daughter got knocked up","commenter_a":"and her 'classy' son beat up his girlfriend...great family values","post_message":"When it comes to Donald J. Trump, the gloves are off."},{"comment_id":"1173449382693296","commenter_b":"ANTI CHRIST HILLARY CLINTON IS BEING PROTECTED BY UN AND OBAMA! ISIS IS THEIR CHILD OF HATRED TOWARDS THE WORLD AND IS GROWING BY THE MIN THEY ARMED ISIS!","commenter_a":"Hmmm","post_message":"Should the US pull out of the United Nations over this?"},{"comment_id":"1155155194501829","commenter_b":"Get over it. There are two different justice systems, if not more; operating within one....","commenter_a":"white privilege","post_message":""},{"comment_id":"1117421238280665","commenter_b":"Mary please do your homework. It would be great to have a woman president but not her. She's a chameleon. If she hasn't flip flopped on something that matters to you just wait...","commenter_a":"Hillary Clinton is the single most qualified candidate in the race, and of the last 60 years. she is the right woman for the job, and in 284 days, i will be proud to call her Madam President.","post_message":"EXCLUSIVE: Vice President Joe Biden reveals what he thinks about the US electing a female president. \"This country's ready for a woman.\""}]
