[{"comment_id":"10154744245648812","commenter_b":"If these thug out moms stop killing their kids everyday in the dam news","commenter_a":"And not one BLM protester was there. It's glaringly obvious that black lives really don't matter to them when it comes to black on black violence and by the way...contrary to popular belief and as told by one of those protesters black on black violence is not a myth, it is real and one should look no further than Chicago to see that black on black violence continues to rise at a rapid rate.","post_message":"Chicago saw its bloodiest month in two decades this August, with 90 murders, 384 shootings and 472 total shooting victims."},{"comment_id":"10153974959029087","commenter_b":"@username I would be suprised if you cared.","commenter_a":"Funny to read some of the Trump supporters defenses that show they didn't read the article. First, the pictures weren't taken outside of the US, they were taken here. So the argument that they \"could have been taken outside of the country\" doesn't hold weight. Second, yes, models come here and do photoshoots \"all the time\", however, as the article states, there is a way to do it legally, and a way to do it illegally/fraudulently. From her own statements, it seems there might be a case where it was done wrong. And lastly, it does matter because Trump's platform is \"do it the right way, she did it the right way\", and if she didn't do it the right way, then it is yet another lie and makes them hypocrites. I realize she isn't running, but he is so he made this an issue. If this were the Michelle ...","post_message":"Melania Trump has said she first came to the United States in 1996 on a short-term visa, which wouldn't have allowed her to work as a model. But a recently published nude photo shoot shows that she was working in the country in 1995."},{"comment_id":"10153400594587994","commenter_b":"those that wanna look like a female do!","commenter_a":"Just put a weave on it everybody else does....","post_message":"We've all had them -- but this bad hair cut even brought the hairdresser to tears."},{"comment_id":"10153504352285329","commenter_b":"She's been on hormones for years-that's where the breasts come from. And you can't see anything under the suit because it was removed. Think ya need your eyes checked","commenter_a":"Guys... Where did that breast come from so suddenly?","post_message":"The olympian and reality star has made her debut in the July issue of Vanity Fair)"},{"comment_id":"10153892614846323","commenter_b":"Heartless bitch","commenter_a":"you failed your child it is your job to teach them not to go to strangers homes do not trust people over the internet and so on","post_message":"\"My heart breaks to think how scared he must have been.\""},{"comment_id":"10153381837831770","commenter_b":"SHES A PROFESSOR ==== HEY KIDS DONT GOT TO THAT SCHOOL SHE WENT TOO SCHOOL WITH OBAMA AN HILLERY,","commenter_a":"Ladies and gentlemen if you want to see the face of Satan then look at this woman see how she can lie like that and never change her facial expressions. This woman I believe is either a muslim or a muslim symphothiser where do these people come up with such outlandish lies like this. This woman should be locked up. Make her produce evidence of her accusations and if she cannot then Lock Her Up For Slander.","post_message":"A queer theory professor in the department of women’s and gender studies on the Rutgers University campus in New Brunswick, N.J. believes that Israel has plundered the internal organs of dead Muslims."},{"comment_id":"10154088028351159","commenter_b":"I wouldn't trust her to clean my toilets !","commenter_a":"The same thing she did with Benghazi!","post_message":"In case you missed it..."}]
