[{"comment_id":"10154153789003010","commenter_b":"Gee, I bet General Petraeus wishes people held him to the same standard they hold Clinton. Maybe if he put a (D) next to his name, he could have gotten away with it.....","commenter_a":"Hillary Clinton has been a dedicated public servant for decades and she will be an awesome president.","post_message":"Let's not mince words: Clinton screwed up. But did she commit a crime, asks columnist Doyle McManus.   (via Los Angeles Times Opinion)"},{"comment_id":"10153285137206770","commenter_b":"Make them eat PORK.","commenter_a":"YES!!!!!","post_message":"'In the Middle East, we have people chopping the heads off Christians. Not since medieval times have we seen what’s going on.'"},{"comment_id":"10152816476327093","commenter_b":"Learn to speak english, illegals","commenter_a":"The only crime committed by police was that they did not deport him previously when he committed prior offenses","post_message":"Even though a grand jury didn’t charge a Grapevine officer for a deadly police shooting, the family of the man killed says the case is not over…  WATCH: @webpagelink  READ: @webpagelink"},{"comment_id":"992259924200395","commenter_b":"I do not believe recreational marijuana should be legalized. Medicinal marijuana, yes. But there are enough zombies wandering our streets and driving our roads already, we do not need a bunch of stoners driving.","commenter_a":"It's about time, the stigma needs to go.","post_message":"Finally! It's time to stop throwing kids in prison over a little pot."},{"comment_id":"10158501442080389","commenter_b":"Why is she in our country?","commenter_a":"March away and try not to get run over by a car or truck. Most of us have jobs and families to tend to.","post_message":"Despicable."},{"comment_id":"1067105896689813","commenter_b":"She's a bitch !!!!","commenter_a":"I've always believed we get what we've paid for .","post_message":"Do you support or oppose the stand these officers are taking?  LIKE Opposing Views for more breaking news and anaylsis"},{"comment_id":"10154081807932212","commenter_b":"Women are not a minority.","commenter_a":"The DNC proves once again that dividing the people is their mantra. These women are being used and they do not even know it. The Democrats are using these women the same way as they use all minorities. It's disgusting..... @webpagelink","post_message":"#WomensMarch OK about to begin at the Capitol. Grant Hermes News 9 says an OCPD officer just estimated up to 6,000 people there right now. #News9"}]
