[{"comment_id":"908467619212716","commenter_b":"They are idiots. Why have 19 kids? Whats thier motive? This is called incest.","commenter_a":"Let the legal system work the way it should.","post_message":"Is anyone surprised by this?"},{"comment_id":"10152687758547093","commenter_b":"That woman has NO business with a baby.","commenter_a":"Wat is happening to these people ADOPT a baby,dam.","post_message":"HORROR: This woman is accused of cutting the baby out a pregnant mom who answered her Craigslist ad for baby clothes... @webpagelink"},{"comment_id":"10153471873556770","commenter_b":"@username - afraid your husband will be deported huh?","commenter_a":"These Clowns are hilarious Dracula aka Cruz and Cruella Devile aka Fiorina ....She was dying for some spotlight....Well she will get if for about another month...Then Bye Bye weirdos","post_message":"During Carly Fiorina’s acceptance speech for running mate with Sen. Ted Cruz, Fiorina sang a made up nursery rhyme to Cruz’s daughters."},{"comment_id":"1089012597882184","commenter_b":"ANTI AMERICAN ASSHOLES","commenter_a":"That's what jackass's do!","post_message":"ClashDaily.com"},{"comment_id":"10153409431986336","commenter_b":"Give it a rest ! Donald Trump has every right to his opinion. I agree that this country has had an influx of illegals for years. Be informed and know that Mexico and Guatemala have cut a deal to send thousands more to cross our borders illegally. The monies they send back to Mexico and Guatemala is $120 Billion dollars. This president wants to give them a free pass plus $35 thousand tax refunds? So they cross illegally, burden our health centers, schools, and oh only so you get my disgust! All I used to hear at the hospital is people telling other relatives of theirs to \"Come to the U.S., because this country is so stupid. They give you money for living, food stamps and oh if you have your babies in the U.S. , then they are citizens and you can stay\"... So these so called nice people ...","commenter_a":"Its a PR move. All they really care about are the $$$$$$ NBC and MSNBC are financially hurting. Low ratings low viewership.","post_message":"Breaking News: NBC is ending its business relationship with Donald J. Trump due to his \"recent derogatory statements\" regarding immigrants. DETAILS: @webpagelink"},{"comment_id":"595246650649268","commenter_b":"You're not a woman... so we don't expect you to get it...","commenter_a":"what brand of dope is she smoking? Seems to be effective in blocking reality","post_message":"\"I think [Trump] would be very good for women’s issues.\" - Caitlyn Jenner"},{"comment_id":"10154948296594203","commenter_b":"all the illegals voted too..","commenter_a":"Hillary has 2,017,563 extra votes then Trump. The difference of extra Two Million+ vote which can give a decisive victory to a candidate \"anywhere else in the world\" has ZERO value in America?","post_message":"BREAKING."}]
