[{"comment_id":"456612701195977","commenter_b":"Try shutting your mouth and your legs , bitch !","commenter_a":"yep a free ticket to Africa","post_message":"Should Blacks Be Compensated For Slavery? Comment 'yes' or 'no'."},{"comment_id":"722580014574620","commenter_b":"Illegals voted here for Obama...","commenter_a":"Proof of Citizenship or Naturalization of Citizenship is the only way you can vote in National elections. Try going to any other country and vote in their elections, YOU CAN NOT. Period end of report","post_message":"Will someone steal your vote when you cast your ballot on Election Day? Voter fraud can drastically influence the outcome of elections."},{"comment_id":"10152976985741636","commenter_b":"some clothes are made smaller then others, i can buy jeans at one store that are size 14 i can go too another store that has jeans that are size 14, the same day and there too tight so my point is sometimes different stores vary greatly in size so you have to wear bigger sizes because of how they are made","commenter_a":"the problem with this story is this....the young girl was NOT directing her comment at anyone but the shirt itself. I am a larger sized woman and have done the same thing when I found clothes that were super large. It's not a slight to those who are larger than me and I'm sure it wasn't meant that way by this girl. If you are that sensitive by your size, then stay at home or do something about it. I have been called names my whole life because I'm not a size 2 or even a size 12. What others think of my size is none of my business. If they allow my \"size\" determine whether they want to know me or not, I don't care. It's their loss. I'm pretty freakin' awesome once you get to know me. I like me. I'm confident in who I am on the ...","post_message":"A photographer is getting a lot of attention after a picture in a dressing room went viral."},{"comment_id":"10152856224956051","commenter_b":"Ban them from the USA!!!!!","commenter_a":"These f***ing traitors need to have their asses strung up on the flag pole !!! Wtf is happening to our country!! What a bunch of sorry worthless stupid f***ing liberals!!.. S*** is fixin to hit the fan!.. Do they actually think we're just going to sit back n let them continue their disrespect??","post_message":"More than 1,200 people, including a lot of prominent professors, just signed a letter to ban the American flag. Here are all their names and the schools they’re from."},{"comment_id":"10152814040437293","commenter_b":"Especially among Liberals.","commenter_a":"It's not a surprise that Fox 'Faux' news should top the polls as the most trusted because most people (sheeples) are obviously dumb because common sense isn't in fact that common.","post_message":"Even among independents."},{"comment_id":"10153304044791336","commenter_b":"Hope they show up in mine, I'll send them to hell.","commenter_a":"Please study these faces they could turn up in your neighborhood","post_message":"The five Taliban leaders traded a year ago for Sgt. Bowe Bergdahl could be free to travel as early as Monday as the terms of their supervised release are set to expire."},{"comment_id":"10153506474399342","commenter_b":"She's one of these \"innocent\" women that our cretin in the White House wants to allow in the US.","commenter_a":"What a mutt. I hope they shot her in that ugly face of hers.","post_message":"We're getting our first look at the female shooter in Wednesday's tragedy in #SanBerardino."}]
