[{"comment_id":"774995235932418","commenter_b":"^Oh Lord, the grammar/spelling in that last response. Anyway,saw photos, she's white but husband and kids arent, for those who care one way or another.","commenter_a":"Why doesn't the headline read white officer killed by a person of color?","post_message":"A very sad story."},{"comment_id":"10153266875433010","commenter_b":"Except for leaving him to near starve and die for 66 days","commenter_a":"God is good all the time... :-)","post_message":"His family reported him lost at sea 66 days ago. He said he survived by rationing his food and drinking rainwater.  “...everyday I was like, 'Please God, send me some rain, send me some water.''"},{"comment_id":"10153873855796037","commenter_b":"He was perhaps just as bad but we will all suffer the negative consequences of their actions.","commenter_a":"Obama's abuse the executive privilege and failure to uphold the constitution has set a dangerous precedent for all those who follow, whatever political party they may belong to...","post_message":"Here’s why President Barack Obama’s actions could empower Donald J. Trump’s Muslim ban in the future."},{"comment_id":"544801219019682","commenter_b":"No questions from me Dr Carson.I just thank God for you, and know your here because God has plan for you. Dr Ben to win.","commenter_a":"Why do you think intensifying the war on drugs is a good thing?","post_message":"Each night I try to take some time to answer a few questions. You can send your questions to me by texting them to ASKBEN (@username) or you can email them to me at AskBen@BenCarson.com.  Before I get started tonight, I want to remind everyone that I will be on both Meet the Press (NBC) and Fox News Sunday this Sunday morning.  Also, Discovery Life will re-air a special about my medical career on Sunday evening.  Check local listings to find the times in your area.  The first question is about the Benghazi Hearings.  I didn’t get to watch to whole hearing but I have read the press accounts of them.  It is extremely clear that Secretary Clinton knew the attack was a terror attack and not a riot based on a film.  Yet, she and the Administration continued to purposely misrepresent the nature of the attack publicly for days.  Missing emails from that crucial time would no doubt provide better clues for who knew what, when.  Of course, that email has been deleted.  I have thought about this some and I think I know now what Hillary was destroying by erasing that server – her credibility.  It is another sad story in a long line of politicians who failed us.    The next question is about Medicare.  Annette from Ohio wants to know if I really want to abolish Medicare as was reported in a Washington politician tabloid.  The answer is of course NO.  I am interested in how we can both save money and deliver better service to our nation’s seniors.  You will no doubt hear of this kind of reporting which is meant to scare people from making any changes to the Washington power base.  I practiced medicine for 39 years.  Throughout those years, I often was disgusted with insurance companies.  Our current system is spinning out of control.  More and more state exchanges are going out of business.  Premiums continue to spiral out of control for those that can’t afford coverage.  Now reports begin to surface that millions of seniors will face massive premium increases.  We need a system where consumers are empowered and protected.  We need a system where you and your doctor decide what is best for you.  We need a system where each of us can monitor costs and levels of service.  I will soon offer such plan.  Until then, please take these press attacks for what they are…the last gasps of the Washington power class.  Finally tonight, I want to end on what many people sent me regarding the two new polls in Iowa today.  Three polls in two days all with the same results.  Each has me significantly ahead by 8 or nine points in Iowa. While of course I am delighted with the results and all of our hard work, now is the time to work even harder.  I am in Iowa tonight and all day tomorrow.  We will continue to fight to deliver our We the People message not just in Iowa but in every state across the country.  Thank you for standing with me.    Goodnight!   Ben"},{"comment_id":"10152812337251749","commenter_b":"#iAmProudiAmBlack. #MyGirlFriendisBlack bcoz i only wanted a beautiful lady. Make these hashtags go viral and discourage nutty whites around the world who see blacks as apes. Tell them that: #BlacksRuleTheWorld. #ObamaIsBlack bcoz he is a great.","commenter_a":"Then it needs to be made a right","post_message":"'We have finally ended the debate in this country of whether or not health insurance is a right or a privilege. We think everyone in America has a right to have adequate health care insurance. And the Affordable Care Act gives them that right.' —Vice President Biden  Watch the weekly address: @webpagelink"},{"comment_id":"10153859068156955","commenter_b":"Leave the mug and leave her alone.","commenter_a":"She didn't like the interview either, ('Not one bit'). Did they ask Ms Flossie if & when SHE wanted to be interviewed? It was all very awkward. They gave her a station coffee mug (shameful)... Put flowers on her lap that she can't hold... The kicker to me was the opening where the interviewer held up the newspaper RIGHT IN FRONT OF HER FACE!!!! The whole thing was disrespectful.","post_message":"BEST INTERVIEW EVER"},{"comment_id":"10153111787816051","commenter_b":"I think girls are more likely to want to fight for what they feel at the moment and most of the time it's about nothing. Hopefully when they grow up they will become ladies","commenter_a":"Awwww. Look at that gentle giant trying to help that girl up off that park bench","post_message":"This girl was holding a baby when they surrounded her. She didn't want any trouble, but it didn't matter."}]
