[{"comment_id":"10154091446565736","commenter_b":"Get her butt out of there .... YOUR FIRED","commenter_a":"I'm SHOCKED that an Obama-appointed Democrat is trying to undermine the new president. Did you really expect anything less? The Democrats aren't about to let President Trump do his job without throwing up every possible roadblock. They're just sore losers.","post_message":"\"I am responsible for ensuring that the positions we take in court remain consistent with this institution solemn obligation to always seek justice and stand for what is right,\" she said."},{"comment_id":"1050271788402406","commenter_b":"My father is vet and is against privatizing !!!","commenter_a":"Privatizing is what the vets want. Who knows more about it than the vets!","post_message":"\"We cannot – and I will not – put our vets at the mercy of private insurance companies without any care coordination or leave them to fend for themselves with healthcare providers who have no expertise in the unique challenges that are facing our veterans.\"   --Hillary Clinton"},{"comment_id":"10152589003412894","commenter_b":"That bitch got implants","commenter_a":"I agree with C completely. He has God given talent. She has what God and cosmetic surgery gave her. She has no talent. She did not invent big, voluptuous butts.","post_message":"Charlie Sheen Pops All the Way Off on 'Zero Talent' Kim Kardashian: 'Go F Yourself'"},{"comment_id":"10154528764136955","commenter_b":"TO ALL AMERICANS - PLEASE WAKE UP AND SMELL THE ROSES. Whether you like TRUMP or not, he is the only viable candidate. If you want all of the above to happen, the lost of 5 amendments to the Constitution that we all learned about in school and everything else she wants to do to put this country into the ground for her benefit only ( REMEMBER, SHE LIVES ON OTHER PEOPLE'S MONEY), we have to work hard for ours, then HILLARY is your girl. If you want the opposite, to save all our rights and freedom, more jobs, getting better and cheaper health insurance (UNLESS YOU WANT TO PAY REALLY HIGH PREMIUMS), a strong military should we ever need it, keeping the refugees out of this country (otherwise you will find them right in YOUR OWN BACKYARD), childcare for all working women (who make up 40% of the workforce), ...","commenter_a":"Lol Trump was winning anyway see yea dumas Hillary quacks","post_message":"PAPER: Dems should ask her to step aside..."},{"comment_id":"349993335204181","commenter_b":"Since nobody will charge her with anything, she is above the law","commenter_a":"Yelp the Clintonss. Obama .Kerry's .. all do.","post_message":"Rand Paul says Hillary thinks She Above the Law"},{"comment_id":"10153522493691167","commenter_b":"Wow I wish this guy would go away","commenter_a":"He is who? A old confused white guy","post_message":"Nope."},{"comment_id":"10153573437688984","commenter_b":"That makes sense since she's a woman","commenter_a":"Bruce Jenner is a disgraceful, sick, fake excuse of a man. ..","post_message":"Wow. Franklin Graham just made a massive statement about \"Caitlyn\" Jenner on Facebook... now it's going viral.  Nearly half a million people just \"liked\" this post... because it's absolutely perfect.  Spread this absolutely everywhere."}]
