[{"comment_id":"10153551437246336","commenter_b":"Hello!! They treated him like that bc they believe him to be a wolf in Sheep's clothing. I find him very entertaining but he is the Clintons wild card. He will divide the republicans so democrats will win. They even point blank asked him when he became a republican and all he can say is I changed my mind.","commenter_a":"'@username owes Donald Trump an apology. Get rid of Megyn Kelly while you're at it.","post_message":"Which GOP presidential candidate do you think gave the most impressive performance during the Fox News-Facebook prime-time debate?"},{"comment_id":"432908550224359","commenter_b":"She is soooo very off base!!","commenter_a":"Trollette.","post_message":"This woman wants to be President. #NeverForget"},{"comment_id":"10153750563214497","commenter_b":"Liar. You're not a prostitute.","commenter_a":"As an African American prostitute I find this offensive.","post_message":"For more world-renowned reportage, visit theonion.com."},{"comment_id":"10153199114815950","commenter_b":"I'd pick up the deal with her in it and put her outside. Call her parents and tell them she's outside. She looked small enough. The cop lost his cool. Out smarter by a brat. Now he is fired and they will sue. Sad all around.","commenter_a":"I was raised very conservatively about manners and respect, and I agree that she was wrong for her actions. However, that deputy does not need to be a SRO if he is going to deal with students this way. It's unprofessional and disturbing.","post_message":"'I was praying out loud for the girl and I just, I couldn't believe it was happening. I was just crying, and he was like, well since you've got so much to say you're coming too.'"},{"comment_id":"10153634685079255","commenter_b":"You are ill informed at your preference. REAGAN was the first president to turn a blind eye with a wink = let the Latinos and work for way below minimum wage as we all get RICH RICH =GREED TAKES OVER AMERICA AND BLATANT HATE ABOUNDS.","commenter_a":"Typical Democratic attack. People, the bottom line is this: ENFORCE THE IMMIGRATION LAWS already in place!! The Republican attacks on immigration are soley to counter Hussain Obamas illegal actions concerning immigrants! We as a Nation CANNOT AFFORD what his policy is going to do us! I believe we all know Thuh Donald's ideas are out of bounds, what is your solution?? I don't want to see children born of illegals deported,.. I do want to see those families placed into the process of becoming American citizens. The system is broken and quite frankly NO ONE has an answer to fix it, all you want to do is bitch about the other party. Politics as usual...","post_message":"Nailed it.  By Daily Kos user and AFL-CIO President Richard Trumka"},{"comment_id":"10153620963073984","commenter_b":"When will Americans wakeup to the fact that Hillary is for Hillary and she don't give atinkers damn about anyone else!!! She BITCH!!","commenter_a":"Who in their right mind would vote for her???","post_message":"As cynical as I may be about politics, I just don't see how Hillary can survive this avalanche of scandals.  Do you think Hillary is destined for the ash heap of history?"},{"comment_id":"703956159761577","commenter_b":"this universe. She is vermin! Excuse me vermin.","commenter_a":"NOTHING is too horrible to say to her. She embodies every disgusting thing wrong in thi","post_message":"Ann Coulter wasn't the star of the roast, but she took a lot of the heat."}]
