[{"comment_id":"10155779626265725","commenter_b":"'@username here @webpagelink","commenter_a":"It's Sad How there's many Mexican's in these comments saying they will vote for Donald Trump. Maybe because some of you don't know the struggle of coming to the United States & been judge just because we want a better life. Donald Trump NOT FOR PRESIDENT. smh","post_message":"Jorge Ramos- Please send me your new number, your old one’s not working. Sincerely, Donald J. Trump"},{"comment_id":"10152967828847061","commenter_b":"Yes legal immigrants ma'am","commenter_a":"I am ashamed at the negative narrow minded comments. Check your heritage. We are all immigrants","post_message":"America Ferrera to Donald Trump: Thanks, your comments will send more Latino voters to polls: abcn.ws/1Iw7NNn"},{"comment_id":"1817386261807116","commenter_b":"I agree! She is pure evil!!","commenter_a":"Totally agree with Newt Gingrich! She has no scruples! She belongs in prison! Cannot stand this heartless woman! She just won't disappear!","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"10153740988490530","commenter_b":"This Bi..ch ran him over!! WITH HIS OWN TRUCK!!! She must pay!!!","commenter_a":"wow that's just a tragedy all over... All those lives destroyed forever","post_message":"Police say addiction led a suburban mom to carjack and run over a senior citizen in a Burger King parking lot."},{"comment_id":"1194953337245391","commenter_b":"😂😂😂","commenter_a":"'@username... it's all about perspective","post_message":"'[Donald J. Trump] was contributing to America by regrowing his business, which now employs thousands of people ... I think that's a better contribution to the economy and to America than pumping into the government, which wastes an awful lot of it.' – Stuart Varney"},{"comment_id":"10154637857483188","commenter_b":"He's been doing that since way before anybody else","commenter_a":"When are you going to report on Hillarys emails? Speeches? Ties with foreign governments?","post_message":"Tough situation."},{"comment_id":"10152688677486491","commenter_b":"'@username Was 9/11 an act of American terrorism? WTC and Pentagon are both on US soil, right?","commenter_a":"Not Polish camp but German!!","post_message":"Hundreds of survivors returned to the Holocaust’s most infamous concentration camp today."}]
