[{"comment_id":"1195742003797367","commenter_b":"Nothing, they won't do anything to her. She is above the law.","commenter_a":"What difference does it make? It's only the law for everyone else, well non-liberals anyway.","post_message":"This literally just happened, folks!"},{"comment_id":"942000482502078","commenter_b":"Celebrities = whores. Whatever pays the bills","commenter_a":"(And yet he keeps playing bond...?)","post_message":"Wow."},{"comment_id":"1027338487301572","commenter_b":"I agree with you , Carol. But, Illinois law forbids us from asking for ID at this point in time.","commenter_a":"Going back many years to JFK's election to the presidency. He won by a very slim margin. Cook county Illinois (Chicago's county) had many votes cast by people who were dead. It is still happening but in many more states. Everybody should have to show a legal picture ID before voting.","post_message":"Voter Fraud is REAL!"},{"comment_id":"10153492553852869","commenter_b":"Nope!","commenter_a":"Amen thanks to Obama. He rewarded themg for 9 11","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"984113211608432","commenter_b":"Why are girls doing this! It's so ugly!","commenter_a":"Elle Paiva-Wilson","post_message":"In a dangerous new beauty ritual, teens are sucking on shot glasses to pump their lips, then posting photos of the disastrous results on social media. >>@webpagelink"},{"comment_id":"10153384160134087","commenter_b":"RINO","commenter_a":"And we should listen to Kasich because his numbers are so high? Isn't that why he was on the end?","post_message":"“I don’t have anything against Mr. Trump personally, but we’re not going to scoop up 11-and-a-half million people and ship them out,' said GOP presidential candidate Gov. John Kasich.  'He’s disparaged Hispanics and Muslims, and he’s insulted women. These are not the things that unify the country and make us stronger.'"},{"comment_id":"10154026278303812","commenter_b":"She killed herself she was the ignorant idiot","commenter_a":"How about a conviction and prison time for a change, send the message loud and clear.","post_message":"JUST IN: TX grand jury indicts trooper who first stopped Sandra Bland in her car on perjury charge. @webpagelink"}]
