[{"comment_id":"10153689413136336","commenter_b":"Because 1471717696187557gallathat is not how God works in a church. If the pastor is wrong God will deal with him, it's not her place to do that. @username we don't know if he spoke to her privately & just because he rebuked her behavior doesn't mean it wasn't in love or that he doesn't love her. She may truly have been disrupting the services. God rebuked the behavior of many in the bible. The bible also says that God disciplines those he loves. No pastor is going to be able to preach in a way that makes everyone happy & making people happy isn't part of his job. He's supposed to preach the truth of God's word without compromise. His delivery can change, but the truth cannot.","commenter_a":"What kind of pastor throws out a 103 year old woman? Not even non-Christians would do this to an elderly woman. Madness. They hate her for believing the same doctrine that she learned at that church every Sunday for a century. The bible charges Christians to take care of the elderly and the widowed.","post_message":"Genora Biggs said that she and the current pastor, Rev. Tim Mattox, have long sparred over his form of preaching, which she characterizes as a \"Holiness style\" that doesn't belong in the Baptist church."},{"comment_id":"1465398613511181","commenter_b":"Beyond stupid . Just be careful and keep your ear anus clean !!!","commenter_a":"Afiya Tavera Cunningham","post_message":"Doctors are once again letting us all know that you should not use Q-tips in your ears."},{"comment_id":"10154216584759203","commenter_b":"Ivory towers allow a lot of false logic. She'll just fly away to her mansion. No skin off her nose.","commenter_a":"I thought, \"Well she is on with Bill Maher. Lets see how she explains this away. And all she did was lie. She said she simply said yada and the people who were complaining didn't see the interview. Well I saw the interview and she lied. Not to be undone though, after a few minutes with Bill Maher, she actually showed her true colors and did admit what she believes. Then to top it off, as soon as Bill Maher brought up their support for Ralph Nader, which cost the country GW Bush and millions of lives, she simply interrupted, pivoted and changed the subject. She is a horrible human being and I wouldn't watch another movie with her in it on a bet...even if she does have the best rack of any 70 year old(Oct) I've seen.","post_message":"Susan Sarandon found herself in the hot seat Friday night."},{"comment_id":"1028264733936445","commenter_b":"It's it funny how liberals say they can get guns from other place but amazing thing is that these people can't make it down to get a ID to vote. Guns we can get cross states lines a ID nope can't do it.","commenter_a":"Cant be. They have banned guns in Chicago. Every one of those murders had guns? Doubt it, cuz guns are Illegal. Hey murderers, stop breaking gun laws and start stabbing people the legal way! #Sarcasm","post_message":"2,326 people were shot in Chicago in 2015."},{"comment_id":"10153248729158908","commenter_b":"Sharon Wilkshire","commenter_a":"Nancy Brown","post_message":"Coconut oil has many health, home, and beauty uses. This oil is a simple, easy, and inexpensive replacement for many commercial products that you may be using at home."},{"comment_id":"1805566076381553","commenter_b":"Leave it alone!!!!","commenter_a":"I vote no!!","post_message":"They are going to change Ole' Glory to this! Leave our flag alone. Do you think the American flag should not be altered?"},{"comment_id":"1639738129419643","commenter_b":"@username he hasn't done anything yet. He is the President elect. He won because People are tired of the false unemployment rate Obama is pushing. Tired of the rising cost of Insurance except for people like you who probably get it for free. Tired of the war with radical Islam that he has no strategy for winning. Tired of illegal aliens pushed on us and tired of sanctuary cities and tired of people like Kate Steinle being murdered by them. You certainly can't blame Trump for any of those things. Have a nice day in your la-la land world.","commenter_a":"Actually, Barack Obama is responsible for Trumps win because he has screwed this country so badly and people are sick of his shit and knew that Killary is not only unqualified, dishonest as hell, and a total liar but that she would continue Obamas agenda to destroy our country.","post_message":"Barack Obama said that Russia is responsible for Donald J. Trump's win, but he didn't expect Sean Hannity to knock his lies right back in his face. The democrats just got schooled.  Let's get 2,000 shares to show that America can't wait to get Obama out of office."}]
