[{"comment_id":"639543372893417","commenter_b":"As I said the jobs are what this is all about. Yet we continue to give unlimited tax breaks to these major corporations to stay here. Just look at all the money LOANED to GM that has never wholly been repaid and never will. Major corporations are \"pimping\" themselves out so WE the middle class can continue to pay for all their tax breaks. When our American companies relocate outside of our country they should be heavily taxed for importing there product here. Since they're paying these third world workers nothing anyway for once let's get into their profits.","commenter_a":"Oh well thank you is in order for saving those jobs. Too bad we the middle class have to make up for that $7m tax break you just gave them. What should have been done is let them leave and import their products back here and tax the crap out of them. Since they are going to pay some Mexican $2 hour. ONLY IN AMERICA!","post_message":"Trump's Carrier deal shows corporations they can: ✅ Threaten to outsource jobs ✅ Actually outsource jobs ✅ Still get a tax cut"},{"comment_id":"671041439725180","commenter_b":"Cause she's crooked","commenter_a":"Come on North Carolina !!!!! Don't let us down!!!","post_message":"Live Now: Donald J. Trump speaks at a rally in Concord, NC."},{"comment_id":"10152724701755927","commenter_b":"I don't know who he is, but I do not like him.","commenter_a":"And? Who cares what Chris Hayes thinks!","post_message":"Remember this from Chris Hayes?"},{"comment_id":"10153619175294753","commenter_b":"I know right?? It kills brain cells!!!...lol","commenter_a":"I heard it was worse than 2 Broke Girls.... I don't know how that is humanly possible .......","post_message":"Fuller House, the spin-off of the classic ABC sitcom Full House, finally hit Netflix this past Friday and the reviews are in. With all apologies to John Stamos, there are a lot of critics out there that simply have no mercy for this nostalgic reboot (okay, that was a really bad pun). Fuller House picks up 21 years after Full House, which left television screens in 1995 after eight seasons on ABC. This time around, DJ (Candace Cameron Bure) takes the Danny Tanner (Bob Saget) role as she’s... @webpagelink"},{"comment_id":"10153871094319705","commenter_b":"@username guys, also keep your pants up, before an INDIAN decides to rape you !","commenter_a":"Only one religion is at the ROOT of so much misery on this planet... STATISTICS that highlight the problem: In 2011, Sunni Muslims accounted for the greatest number of terrorist attacks and fatalities for the third year in a row. Over 5,700 incidents were committed by Sunni Muslims, responsible for nearly 56 percent of all attacks and about 70 percent of 12,533 fatalities.* Another 24 percent of the fatalities are on Shi Muslims. So in 2011, Muslims were responsible for 94 percent of the fatalities in terrorist attacks. Since 2011, with ISIS on the scene, the number of the fatalities victims of the Muslim terrorist attacks- sharply grew, together with Muslims share in the world terrorism that is steadily closing in on 100%. In 2013, according to the US Department of State, a total of 9,707 terrorist attacks occurred worldwide, resulting in more than 17,800 deaths and more than 32,500 ...","post_message":"So devastating."},{"comment_id":"10153778379533984","commenter_b":"They are disgusting!","commenter_a":"Cancel it immediately!","post_message":"If you thought the controversial comments that were made on air by 'The View' co-hosts were bad, wait till you see what was reportedly said backstage... What do you think of 'The View'? Have they gone too far this time?"},{"comment_id":"533141560209757","commenter_b":"Brainwashed stupid women!!!!!!!","commenter_a":"Let them go back to the country they came from if they want to wear their Burkas","post_message":"This Muslim woman refused to remove her veil, then something awesome happened. Good. There's no room for fanatical Islamic culture in the US. Do you support a Burka ban?"}]
