[{"comment_id":"10153184020474726","commenter_b":"What a disgusting a hole.","commenter_a":"what a piece of dog feces","post_message":"\"He didn't win, did he?\"    Harry Reid confronted on his lies, with no regrets."},{"comment_id":"349993335204181","commenter_b":"Since nobody will charge her with anything, she is above the law","commenter_a":"Yelp the Clintonss. Obama .Kerry's .. all do.","post_message":"Rand Paul says Hillary thinks She Above the Law"},{"comment_id":"1115942415111321","commenter_b":"You are a woman, you are worthless, you shouldn't vote. See? That's how you sound. Btw, #hillaryforjail.","commenter_a":"I did not know Gov. Mike Pence. Thanks @username, I like his backbone. Voting Trump/Pence Donald J. Trump thanks for standing firm for the safety of America.","post_message":"If you ever had any doubts about Donald J. Trump sticking with his divisive and dangerous plan for America—say hello to his new running mate."},{"comment_id":"163756660695086","commenter_b":"She's unbelievable. I swear she better not get into office. WAKE UP AMERICA!!!","commenter_a":"I think Hillary is channeling Marie Antoinette.","post_message":"Hillary Clinton just landed her plane in Nantucket...   Almost immediately after people saw her, this HUGE problem went viral..."},{"comment_id":"577516445785152","commenter_b":"Sarasota canceled the witch!","commenter_a":"The pumkins look just like trumps he ad. Lol","post_message":"WATCH LIVE: Hillary Clinton continues to campaign in Florida, where she leads Donald Trump 45% to 44%, according to an NBC/WSJ/Marist poll reported by FOX News.  This morning, she's at the New Mt. Olive Baptist Church in Ft. Lauderdale."},{"comment_id":"10153436699476337","commenter_b":"Yea and he's got a fake pussy.","commenter_a":"No one here read the article did they? She's not being called out for being a white NAACP supporter or for \"not being black enough\", she's being called out for lying about being black. She's totally not black at all. She's a white woman pretending to be black saying that she grew up poor, black, and racially profiled. When she wasn't. At all. -_-,","post_message":"HOW DOES THIS HAPPEN? Is this NAACP leader pretending to be black? Many on the Internet certainly think so..."},{"comment_id":"10154048567109203","commenter_b":"She's a turd","commenter_a":"Hillary 2016","post_message":"How could you, Will Ferrell??"}]
