[{"comment_id":"10153095975513606","commenter_b":"Unreal. Where I grew up the \"N\" word was used frequently. Every time I was called that I retaliated. Im not a thug or a criminal. The teacher has to respect the students and vice versa. In hindsight the student should have went to the principal and then to his parents. Im in no way condoning what the student did but its a 2 way street. Dont bash the student when we dont know exactly what rhe teacher said. Racial slurs or any other forms of racism has no place in society. My kids or the kids I coach cant even say anything like that. Either way whatever was said isn't the problem. It was the lack of respect from the teacher and STUDENT.","commenter_a":"@username you say teachers need to watch what they say. I don't get it. What about the child. Dosen't he need to be taught. I don't like what you said so I punch you. There are other ways of handling verbal abuse. This is disgraceful.","post_message":"Witnesses say a Prince George's County Schools student punched his teacher over a racially insensitive comment: @webpagelink"},{"comment_id":"10154132565089087","commenter_b":"Thats it?? Popping a bottle of champagne??? He wasn't fucking any one...SHE WAS....GIVE ME A BREAK!!!","commenter_a":"Treasonous Clinton is going to be burned on Bills rapping of women when he was the AG of Arkansas that right Clinton you covered it up","post_message":"\"There’s been a lot of talk about sex tapes today and in a strange turn of events, only one adult film has emerged today and its star is Donald Trump,\" said the Hillary Clinton campaign in a statement."},{"comment_id":"10153188549718812","commenter_b":"Why don't they beat men cuz the guy cant","commenter_a":"Good","post_message":"JUST IN: NASCAR says driver Kurt Busch has been suspended indefinitely: @webpagelink"},{"comment_id":"1746288005610861","commenter_b":"Women do not get kicked out of restaurants because their children cry. What world do you live in ?","commenter_a":"Whatever. If that kid was crying in the middle of some restaurant & the owner told the mother to leave for the sake of the rest of the patrons he'd be applauded. Taking a baby to a political rally is as foolish as taking a baby to a Slayer concert. The exception being Slayer fans are far more courteous than the average politcal junky.","post_message":"\"I think she really believed me that I love having a baby crying while I'm speaking. People don't understand.\""},{"comment_id":"10155015262498690","commenter_b":"Yes why give the terrorists hope? As soon as Obomber gets out, terrorist support will weaken dramatically.","commenter_a":"If 9/11 deserves a moment of silence, than The #Syrians & #Palestinians deserve that we never speak again...","post_message":"Does Assad have enough manpower and weapons to protect the territory his forces have retaken while at the same time trying to win back more areas?"},{"comment_id":"10154094208712483","commenter_b":"I always love the people who shout about \"Damn SJWs always trying to shut down things they don't like! Get over it!\" because they're the same people that whine about things like the \"War on Christmas\". Who needs those safe spaces again?","commenter_a":"Oh no! Somebody got offended again so let's shut it down!","post_message":"The series, which has elicited a fierce backlash, will be shelved."},{"comment_id":"1732269190330470","commenter_b":"Lol sure","commenter_a":"This just in, scientists baffled that the universe is not that old, may have been created by a a Supernatural being....\" I can't wait.","post_message":"The breakthrough could offer greater understanding of the Big Bang among other things. @webpagelink"}]
