[{"comment_id":"1302575163172066","commenter_b":"@username and why isn't Hillary in jail right now? Oh yeah, dirty politics.","commenter_a":"He's a fraud. Last night he said he would (be able to) release his tax returns if Hillary released the emails. So according to Trumb...HE CAN RELEASE HIS TAX RETURNS IF HE WANTS Period","post_message":"“If not paying taxes makes him 'smart,' what does that make all the rest of us?”  - Hillary Clinton"},{"comment_id":"1300733136636619","commenter_b":"Crooked Hilary!! She lose everything ad her life evil woman!","commenter_a":"The Clintons are Milliinaires who t.Trump values over his loser voters","post_message":"They illegally set up a charity to line their pockets for foreign influence...most countries call that treason."},{"comment_id":"10154321857710575","commenter_b":"Another loud mouth fat bitch and if you want to live se some weight cut off your head","commenter_a":"If you think this woman is a hero, go get your gun and shoot yourself with it, it is a better choice than what is coming","post_message":"Unbelievable . . ."},{"comment_id":"10152641860006135","commenter_b":"What a joke","commenter_a":"How do you find out if you have fines?","post_message":"Just a HEADS-UP If you've skipped out on jury duty in Michigan in the last 12 months...  READ: @webpagelink  You have until the end of the business day today to request a new jury service date to avoid fines."},{"comment_id":"10154512331514087","commenter_b":"I don't blame them! I wouldn't want to work with the Chump either. But is that more inexperienced, mindless sheep the Chump can put in their place?","commenter_a":"LOL, I wasn't fired, I quit","post_message":"BREAKING: All State Department senior management officials have abruptly resigned."},{"comment_id":"10153161008224087","commenter_b":"Yvette Eva Hirsch. Where does everyone come up with this comparison? Hitler wanted to kill any non white people. If you weren't blonde haired with blue eyes you were killed. And even then if you meet that criteria and a Jew you where still killed. Trump wants to build a wall and establish a true border which should have been done long ago. He wants to have illegals leave. They are illegal after all and by the current laws shouldn't be able to work due to its illegal to employ a illegal. Notice there is no killing, no rounding up of people based on race. Mexico's constitution doesn't even allow citizens from Mexico to be given citizenship to a child born in another country citizenship in that country. This all started when everyone stopped trying to offend illegals by calling them UN documented to make it sound better. The fact ...","commenter_a":"Maybe the establishment should sign a pledge to treat him fairly, and honor the will of their base!","post_message":"Donald J. Trump said that if he signed the pledge not to run as a third-party candidate, he expects to \"go up 10 or 15 percent\" in polls."},{"comment_id":"1163546927012391","commenter_b":"Janette Smith just wow I can't even!! U are delusional do u have kids? I hope not","commenter_a":"I hope he escapes.","post_message":"MISSING: Louis Dean Rende, 12, has run away from his Spring Hill home. He is 4-foot-6, and was wearing a red or orange shirt, dark shorts, and might be wearing hiking boots. He has a scar above the right knee. If you see him please call 911 or the Pasco sheriff at 727-847-8102. Leave a tip at 800-706-2488."}]
