[{"comment_id":"10153270058159497","commenter_b":"We are all snacks, can't we get along?","commenter_a":"Oh SO SNACKS DON'T HAVE THE RIGHT TO DEFEND THEMSELVES?","post_message":"From our sister publication, ClickHole:"},{"comment_id":"10153782383018984","commenter_b":"Yes I agree with the teacher. With the country like it is, how did she know it was not a bomb. Thank, to her for keeping our students safe. I wish they would all go back to there own Country .","commenter_a":"Just wanting to get more free money. They need to kick the whole damn family out of the country.","post_message":"There's already plenty of controversy and speculation surrounding the case of the 14-year-old boy Ahmed Mohamed, who brought his clock to school - and now what his family just did is taking it all one step further, Do you still stand by this school's decision to call the authorities?"},{"comment_id":"10153113291310667","commenter_b":"He needs nothing...but some of his followers want to contribute anyway..Trump for president 2016!...","commenter_a":"Only person that can change America.","post_message":"He says he doesn't need the money -- he's getting it anyway."},{"comment_id":"10153784232529255","commenter_b":"Money. Sickening greed. If taxes were confiscatory for the top rates, we'd have less of this.","commenter_a":"Do these companies that are selling...like a pharmaceutical or National Geographic not know WHO they are selling to or even care?","post_message":"RIP From Daily Kos user Eyesbright"},{"comment_id":"10154394730455695","commenter_b":"Watch the Saints win the SuperBowl this season... Who Dat baby!!!","commenter_a":"CONGRATULATIONS ATL!!!","post_message":"#BREAKING: It's official! Welcome to Atlanta Super Bowl LIII! @webpagelink"},{"comment_id":"10153697709133984","commenter_b":"He'd never make it to prison if that was my daughter or granddaughter. But since he will hopefully go to prison, its a shame someone never showed him an illustration on a blackboard about the size of your asshole before prison and the size it is when/if you get out. Maybe he would then have had sense enough not to rape a child. When he goes to prison he's going to find out what real rape is like...good.","commenter_a":"Castration sounds good to me. He wouldn't do it again","post_message":"This sick punk raped a young girl and admitted to it... but the disgusting thing is his absurd excuse. Our country is in deep trouble and this proves it... this little girl did nothing to deserve this."},{"comment_id":"1196543867052750","commenter_b":"This bitch is hilarious, please keep validating all of the stereotypes of a trump supporters! Please wipe your mouth there is shit everywhere!","commenter_a":"Wow we got some really stupid people on here first let me say I'm pre-med graduated with honors I have served as an EMT and probably took care of you idiots in the o.r apparently your lobotomy didn't work we are smart people and educated people the dumb ones are the ones that think he's wasting his time trying to save assholes like you","post_message":"Someone shared a meme featuring an Adolf Hitler quote attributed to Donald Trump -- and his supporters ate it up!"}]
