[{"comment_id":"551369591720287","commenter_b":"She is a disgrace to every First Lady America ever had, not to mention every woman in America. neither she or her husband know their ass from their elbow.","commenter_a":"They need to be GONE !!!!!!!!","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"},{"comment_id":"10153070274883010","commenter_b":"Wait, so your bathroom at home is a symbol of Sodom and Gomorrah?","commenter_a":"Welcome to Sodom and Gomorrah.","post_message":"A new West Hollywood law will require gender-neutral restrooms."},{"comment_id":"10156240306950551","commenter_b":"God, this women is a beast.","commenter_a":"Then bitch move to Africa.","post_message":"This woman is RACIST!"},{"comment_id":"1040430382659049","commenter_b":"they are getting to close for comfort. she will play the stroke card any day now.","commenter_a":"She looks like a wore out old saddle bag.","post_message":"Hillary, EXPOSED!"},{"comment_id":"10154466445410399","commenter_b":"@username Don't you have some wheelchairs to kick?","commenter_a":"The mom was an anti-Trump plant using her kid as a tool -- so it is another non-troversy for those fearful of the complete Clinton crushing coming tomorrow.","post_message":"“The crowd started chanting 'U-S-A' and pushing his wheelchair,” his mother said. “We were put out by security. Mr. Trump kept saying, 'Get them out.' \""},{"comment_id":"10154569592984497","commenter_b":"@username GO FUCK YOUR MOTHER","commenter_a":"Mom really in love with new fat penis-shaped exotic veggie.","post_message":"\"Carol from book club told me about it and sent me a recipe to cook it in a skillet.\""},{"comment_id":"1190103767694524","commenter_b":"SOROS supposedly promised her the election so that is why she thinks she has it. THEY WERENT COUNTING ON TRUMP TO TAKE OVER!!! LOL GO TO HELL BITCH> WE NEED TRUMP NOT SOME GANGSTER BITCH AND HER CULT!!!","commenter_a":"Nobody bothers to mention that the last time the Clintons were in the white house they stole furniture and silverware and were forced to pay or return it.","post_message":"Hillary thinks she's already won. This kind of sick behavior is UNACCEPTABLE in a constitutional republic!"}]
