[{"comment_id":"10153389679411350","commenter_b":"the dirty creep is the one defending a perv family Linda!!!!!!","commenter_a":"Why is this even a question????","post_message":"Should TLC cancel 19 Kids and Counting?"},{"comment_id":"888390488018194","commenter_b":"Feminazi bitches","commenter_a":"This program has got to go...what is Disney thinking...stopped watching it long ago....they have become left extremists...they are just like the long time politicians...our view is the one that you people should be thinking...totally out of touch with common people...don't these so called stars get it...we don't care what you think","post_message":"Let's help them pack their bags. Do you want The View gone?"},{"comment_id":"979742035426993","commenter_b":"Send this JEW to ISREAL , they don't Belong in the USA !!","commenter_a":"What an idiot and people are ACT voting for him","post_message":"COMMUNIST LUNATIC Bernie Sanders Just Called For Total Gun Confiscation! @webpagelink"},{"comment_id":"10153058951371045","commenter_b":"send her to Hollywood she can act!! send to JAIL!!!!!!","commenter_a":"It seemed like a pretty fake cry to me, you know that baby was there just sorry she got caught!","post_message":" God. Oh God. I can believe I did that. Oh my God. My husband going to kill me. Oh my God! That's the reaction police body cameras caught when a frantic mother was confronted for leaving her 1-year-old daughter in a sweltering van parked in an Oklahoma Wal-Mart parking lot."},{"comment_id":"850731841652961","commenter_b":"Another inbred rightwing BITCH! lmao.. Throw her to the lions! :) I wouldn't wipe my ass with the satanic black book of lies she learns from.. \"C-NT!","commenter_a":"One ugly MF !!!","post_message":"Her lawyer says it's not about bigotry. She says it's about her faith. But bigotry comes in many forms, and she's using her faith to justify it:"},{"comment_id":"10153844066851770","commenter_b":"******* PENCE WHIPPED WITH A KAINE *******","commenter_a":"Not too much for me to say, I hope they both lose. God bless the U.S., amen.","post_message":"The #VPDebate is over, but there's still a lot to talk about. Like that rumor that Trump is mad about Mike Pence doing so well, or all those times Tim Kaine interrupted him. Keep watching for a special round of trivia, starring a giant tub of Nutella. Your hosts: Christopher Bedford, Christian Datoc and Katie Frates."},{"comment_id":"10154042547832411","commenter_b":"Let's get rid of the illegal immigrants you wanna come here do it the legal way and learn to speak English too","commenter_a":"Why don't you dream up a way to protect Chicago!","post_message":"Emanuel asked Trump to continue deportation protections for \"DREAMers\" who were brought to the country before they were 16."}]
