[{"comment_id":"10153288291318812","commenter_b":"That is great! I had to tell a mom to stop playing games on her phone in the theatre once. She was playing for nearly half an hr into the movie & it was totally distracting cuz of her huge bright screen & she was holding it up right in front of her face.","commenter_a":"Praise God it is so good to know that some people do still believe in kids being obedient and respectful to their elders.","post_message":"'This rude, disrespectful, and awful behavior is unacceptable and they owe you an apology.'  Mom's Facebook apology for kids' bad behavior at the movies brings recipient to tears: @webpagelink"},{"comment_id":"10152957045101316","commenter_b":"that is why... Joran","commenter_a":"'Messing with our veines/immune system, why?'","post_message":"#Vaccine industry attempted bribery of #Disney, #ESPN, Oprah and CNN: @webpagelink"},{"comment_id":"998273030249779","commenter_b":"Men use mens room women use womens room","commenter_a":"obama done it allready","post_message":"Once again the president wades into a state issue, ignoring the will of the people.   @webpagelink"},{"comment_id":"435422649916109","commenter_b":"Look at her scarf. Clearly a terrorist","commenter_a":"Who do you trust these days? Don't call a cop on a cop.FOP same as KKK. FATURNTY ORDER OF POLICE.I see FUCK OTHER PEOPLE.","post_message":"BREAKING: Cop Says He Doesn't Need a Warrant, Forces Way Into Woman's Home  Video posted by Facebook user New York, NY resident Diane Malikah Moomin Pinkston with this caption (Follow The Anti-Media for further updates on this story)  'Just happened about an hour ago April 9, 2015 2pm they didn't give me their names or badge numbers . They ran like cowards wanting people to do their ob for them and they get paid. they all left without giving me their info. this is what the system allows them to do. And I'm holding the whole system responsible. they keep screwing up n need to pay to make sure this never happens again.'  Update: the victim of this warrantless search has posted another video responding to this incident: @webpagelink  via The Rundown Live  Full story: @webpagelink"},{"comment_id":"1090190811037255","commenter_b":"Dear Charlotte She gonna frack it up","commenter_a":"So proud of you @username! Can't wait to vote for you in Kentucky on May 17th! Hillary 2016!","post_message":"What kind of president would Leslie Knope be? Amy Poehler: 'Full speed ahead!'"},{"comment_id":"778618008970820","commenter_b":"I am hoping for a selective hailstorm just on the protest groups, with BIG stones.","commenter_a":"This is not protesting. These are forceful dictator type actions that are not consistent with what our country is about. And if the whole point of this is to start up Martial Law, you have no idea what you are trying to start. I am confident God is bigger than this. :) Lord, protect our freedom from dictators and those who wish to act like them.","post_message":"These left-wing groups have vowed to 'shut down' Trump's inauguration. Here's how."},{"comment_id":"10154255486503812","commenter_b":"'@username She was talking about your looks (see, that's a joke).","commenter_a":"Because seeing a gigantic animal in front of your car with your own eyes is somehow just too hard these days.","post_message":"Moo-ve over! Volvo shows off its large animal detection system coming to its vehicles in 2017."}]
