[{"comment_id":"954260038007303","commenter_b":"Shut up pain your wife's ugly","commenter_a":"@username 1254149964595086mond DeBusschere @username @username reminds me of the good ol days at the barracks","post_message":"Friends like this #WSHH"},{"comment_id":"10152976534071955","commenter_b":"Bonehead stole Christmas and gave it to the illegals.","commenter_a":"POS!!!","post_message":"PAYBACK: BOEHNER FOES BOOTED FROM POSTS"},{"comment_id":"10153369191183984","commenter_b":"Yes it is.The best we can do is try to covert those that are a,ready here. I'm not sure how many would even listen.Its a job for the Holy Spirit. In the mean time we should stop immigration of Muslim population into the USA . When it reaches a certain percentage than there will be major problems. Satan is a master at deception and he came to kill steal and destroy.Jesus came to give life and give it more abundantly .","commenter_a":"OOOOH boy!! are we sitting by and letting this happen before it grows too late? Hell no!!!! Anyone interesting to get rid the prez, say aye!","post_message":"Wow, after watching this, I've got to wonder how this guy can say what he does and get away with it! Unbelievable! Do you think that radical Islam is the threat this woman claims?"},{"comment_id":"10154653626394024","commenter_b":"oh hell no !","commenter_a":"I want him back in the WH .","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1201578119864976","commenter_b":"All rapists should be killed.","commenter_a":"Yes it does","post_message":"This reeks of white privilege."},{"comment_id":"10157043455730206","commenter_b":"May God keep you stronger, Celine","commenter_a":"So sorry for your loss!","post_message":"Celine's brother Daniel had been battling cancer of the the throat, tongue and brain."},{"comment_id":"483464435177470","commenter_b":"Fuck you cunt lips","commenter_a":"The reason you are seeing her all of a sudden is to take the heat off of Obama . When thing get sticky with Obama his handlers bring out Michelle, or Biden. It is to take our minds off of Obama. Don't be fooled, Michele has no power, she is a fixture . I would venture to say she and her husband have very little to do with each other. It's for the television camera only. She was bought and paid for just like he was but her thing is just until he leaves office..","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"}]
