[{"comment_id":"10157769548850725","commenter_b":"Go kick her butt.","commenter_a":"you go donald !","post_message":""},{"comment_id":"10153430194047042","commenter_b":"To answer your question politically I don't like Hilary and I don't believe I would care for her personally either.","commenter_a":"How did Americans become so Dumb? No matter what kind of Facts you show them they will still support this Fool of a President.There is a Health Care Crisis is Puerto Rico yet they love this Fool.Israel will soon be whipped off the map by Iran yet Jews Love this President.Not a single Latin family has been untouched by this Man and his Policies yet we are about to elect someone worst Hilary.The Mexicans don't understand that there being used like a mule to further a democratic Political agenda.The president could have made millions of illegals legal yet there left in limbo and now he is gonna lecture us on race relations when he is the most divisive of Presidents..","post_message":"\"RACISM, WE ARE NOT CURED OF IT\": President Barack Obama used the n-word to make a point about the reality of racism in America."},{"comment_id":"10155678849387004","commenter_b":"GET SOROS- GET SOROS!~ FREE AMERICA!","commenter_a":"This shows you how STUPID people at Berkeley are...","post_message":"In the 1960s, leftists at UC Berkeley fought for their free speech. Now they use violence and mayhem to trample on the rights of others..."},{"comment_id":"10154800990580575","commenter_b":"Lock her up.","commenter_a":"Terroristic Threat","post_message":"This Has Got To Stop..."},{"comment_id":"1181685188533567","commenter_b":"This picture is missing a muzzle for that big mouth!","commenter_a":"Her eye bags and pouchy cheeks disappear somewhat when her mouth is open like this. But then you see her overbite and buck teeth.","post_message":"It's happening!"},{"comment_id":"1795036153889458","commenter_b":"because women dont cheat. lol","commenter_a":"A male will cheat if they want. Tattoos or no tattoos. Plain and simple. I hate how they always try to blame other things instead of a man owning up to being scum","post_message":"Do tattoos do it for you?"},{"comment_id":"10154491672598843","commenter_b":"Nice but ignorant..just because it looks nice doesn't mean it is. Well if we're going to have a March about saving babies, we must teach to save wome and men. Teach women knowlage of self worth not through sex to have standars. Teach men to stick around and train this child up. Their are far to many women who trust in the wrong Ideas about relationships and sex. A comunity of ignorance instead of in the scools teaching to waite and young girls to choose a good partner who is consistent. Also have father's taking responsibility instead of running off and leaving women to fend for themselves. Child support isn't always enforced, if she has no family, if she is in poverty look at where plan pearenthood is located in the getto where the poor is and if you think the CPS system isn't filled up over populated, better look ...","commenter_a":"However, they left behind lots of litter for someone else to clean up. How thoughtful.","post_message":""}]
