[{"comment_id":"1086229651436699","commenter_b":"I bet the real problem some have is that Black females got into West point, never mind graduate from there.","commenter_a":"When you lower the entrance standards to one of the world's greatest Military Academy, this is what you get...","post_message":"The image has spurred questions about whether the gesture violates military restrictions on political activity."},{"comment_id":"10154039827188984","commenter_b":"I hope it was a woman that pulled the trigger","commenter_a":"I am so grateful to my Lord that I do not have to live in a war torn place like this... never feeling safe and never knowing when you went to market if a suicide boomer was going to show up and kill you and others!! Never knowing when you rhusband was going to demand sex or molest your little daughter!! What a horrible life that would be!","post_message":"This terrorist fighter was excited to show off his machine gun skills to his buddies.  He stepped out beside a building, started to open fire, and then there was a CRACK followed by a dull thud."},{"comment_id":"1706668932888007","commenter_b":"Hillary is just another branch of the incompitent Obama tree. Only difference is she's a criminal and she'll be far worse for this country because she'll have to prove a point soley because she's a woman. Sorry, but I don't vote based on race or sex and I certainly won't vote for someone who has spent most of their political career filled with lies and cover ups.","commenter_a":"I CALL B.S....HILLARY HOMERS,...VOTE Donald Trump 2016..\"THE MAN FOR AMERICA\".","post_message":"Donald J. Trump's odds of winning the Republican nomination dropped 3 points on the Political Prediction Market after the #GOPDebate. Meanwhile Ted Cruz's odds ticked upward..."},{"comment_id":"10155014119221178","commenter_b":"Democrats have always gotten away with MURDER!!","commenter_a":"Accountability was not a word he knew--or enjoyed.","post_message":"Talk about a major understatement from The Daily Beast."},{"comment_id":"10153428772146509","commenter_b":"Cause she was worthless and weak that's why!!","commenter_a":"Why would you choose the classroom to do that?","post_message":"There was no indication of foul play, and every indication that she took her own life, officials said. @webpagelink"},{"comment_id":"1023389334348744","commenter_b":"freaking australia","commenter_a":"How so they come up with 95 millions years?","post_message":"This bizarre species of shark is thought to date back at least 95 million years."},{"comment_id":"773980632650962","commenter_b":"i cannot stand that woman","commenter_a":"Why don't you just all tell the truth and say \"he's a muslim that's why he didn't go\" it's like anyone would do anything about it!","post_message":"Very painful to watch."}]
