[{"comment_id":"1219402711410410","commenter_b":"i did not know we had 18000 + illegals in our country keep signing and we can take the list and round them all up and send them all home illegals NO legals YES if any one wants to come live in the U.S.A do it right by the law and we will embrace you any thing illegal in America will be prosecuted to the full existent of the law Americans don't care where you are from just do it wright","commenter_a":"Likely, they/#SNL have to give \"equal time\", since the top candidate from the other party was prominently featured.","post_message":""},{"comment_id":"1743445975938698","commenter_b":"Devil at work.","commenter_a":"we should not remove any thing if they don't want to come to come our churches let them go back to there country where they can do as they please..","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More ‘Comfortable’.  America was founded on Christianity!  Do you think this is ridiculous?"},{"comment_id":"550965321772492","commenter_b":"@username I think there's more chance of a war with Clinton. She's voted for a couple already and seems intent on aggregating Russia with unfounded accusations.","commenter_a":"The Clintons always try to \"cover their tracks\" because their corruption is so deep. And they make sure they have info on others who can be manipulated via blackmail at a later date to further the Clinton agenda. PRISON is where they deserve to be!!","post_message":"This is worrisome..."},{"comment_id":"10153253558949575","commenter_b":"Just go ahead and remove her from this planet. That kind of person isn't needed here.","commenter_a":"What a POS! Hopefully she will never get custody of her child back! WTH is wrong with ppl!?!....SMH!","post_message":"An Ohio woman has been indicted on charges she trafficked her 11-year-old daughter to a drug dealer in a sex/heroin exchange."},{"comment_id":"10157076549400354","commenter_b":"Does the rules say you can steal another candidates votes like he did with Ben Carson?","commenter_a":"Cruz is playing by the rules...PERIOD. Elections have been done this way your entire life. There is nothing different from other elections, with the exception of a whiny, sniveling, jealous loudmouth. Too bad Trump hasn't been paying attention to the rules.","post_message":"\"Ted Cruz has no chance of winning this without bribing the delegates. That’s his game at this point. He’s mathematically eliminated....\"  WATCH:"},{"comment_id":"1071143486278732","commenter_b":"Good point kind sir haha","commenter_a":"Lmao Joshua this would be you...","post_message":"Husband practically demolishes house to build massive fish tank"},{"comment_id":"10152893596581336","commenter_b":"Oh look, Obama making his own rules again...surprise","commenter_a":"Who's the party of NO now.","post_message":"\"Congress needs to show patience.\"  Moments ago, President Barack Obama said he will veto any legislation from Congress that added new sanctions against Iran. @webpagelink"}]
