[{"comment_id":"10152899469751130","commenter_b":"Women tearing women down. This is why we can never have nice things.","commenter_a":"The face and stance totally remind me of the gorillas at the zoo lol.","post_message":"Do not f**k with Ronda."},{"comment_id":"10153106111768717","commenter_b":"Ha Ariana Grande get out of America and don't come back and American people should boy cot all her music","commenter_a":"Well if she can lick donuts then it is the shop's problem in leaving them where she can do this, so the shop should be the ones facing criminal charges.....","post_message":"A doughnut shop owner wants Ariana Grande to face criminal charges for licking and spitting on doughnuts -- @webpagelink"},{"comment_id":"1275765532466713","commenter_b":"THIS IS WHAT america going to get if hillery elected .. this Muslim imam funded to Hillary clinton campaign.@webpagelink.. have a great islamic future for Americans","commenter_a":"thie is a foto shop pic trump u moron","post_message":"ANY FELLOW JEW VOTING FOR CLINTON IS A DISGRACE TO OUR PEOPLE!"},{"comment_id":"525682007598270","commenter_b":"The man is awesome!","commenter_a":"Yes Ben Carson Says truthfully he is an OBAMANITE~~~ TRUST HIM....!!!","post_message":""},{"comment_id":"10153079527196051","commenter_b":"Darwin Award!","commenter_a":"The boy appears to be under the influence.....too bad.","post_message":"This girl thought it would be fun to take selfies while she and her boyfriend were driving. This is what they looked like before the crash. Now check them out after."},{"comment_id":"1824233217832680","commenter_b":"Yep! I saw what DT paid for in this campaign, thousands and thousands of his campaign signs , thru WV, Ohio, Mi. Drove it many times from NC due to a deaths in my family. I couldn't believe how many I saw and where they were. Really in the oddest of places too. Someone was paid to put them up.","commenter_a":"I love my Affordable health Care, it has saved my life. It's very important to have coverage for everyone in our country. You never know when you my need it. The health care conglomerate has made it expensive, big Pharm etc..etc.. not OUR President! What he did was great for this nation, and yes I would tweak a few things but all-in-all we need this for a healthy people!","post_message":"Your experience with the Affordable Care Act? #ACA"},{"comment_id":"606144009518781","commenter_b":"She didn't get the revenge my butt would have gotten......I would have burned the house with him IN it chained to the bed.","commenter_a":"I agree that he should have been inside too bad that's cruel and unusual punishment. What kind of person does something like that to a child?!?!! Happens all the time unfortunately :( Exactly why I don't let my kids our of my sight, too many crazies in the world.","post_message":"The only thing better would have been if he was inside. ;)"}]
