[{"comment_id":"624394087751170","commenter_b":"SO TIRED OF STUPID RACISTS. !!!!!!!!!!!!","commenter_a":"Doesn't she want her peep to show? What a POS this he/she is.","post_message":"Michelle Obama suffers a humiliating wardrobe malfunction during vacation. This is hilarious. Do you agree Michelle Obama is a disgrace to America?"},{"comment_id":"10152900481316336","commenter_b":"Racist bitch^^^","commenter_a":"She must be a Muslim....no sensativity to killing her own new born?","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."},{"comment_id":"852403371522583","commenter_b":"Deport Europeans!!!","commenter_a":"deport them all...","post_message":"5,000,000 undocumented immigrants may be left in limbo..."},{"comment_id":"10153891729051680","commenter_b":"While Melania was pregnant.","commenter_a":"Right, because he was just a young, naïve, 59-year-old predator.","post_message":"Donald Trump released a video statement apologizing for his sexually aggressive comments about women, saying the words caught on tape in 2005 do not regret who he is."},{"comment_id":"10153242802786336","commenter_b":"She needs to step down. Bad form lady!","commenter_a":"recue her self all the way back to college, and stay awake the second time around , , and learn the law. don't judge out of hate to please your president and holder ,and al.","post_message":"Defense attorneys representing six Baltimore police officers charged in the death of Freddie Gray filed a motion to have the case dismissed, or for the city’s top prosecutor to be replaced."},{"comment_id":"10150612418424999","commenter_b":"A hoe is a garden tool, ferchrissakes.","commenter_a":"Being a hoe ain't new or modern..No matter how many flowery. Words u use.","post_message":"\"If an open relationship was necessary to prove how well I loved my boyfriend, I was happy to comply.\""},{"comment_id":"10154221226031509","commenter_b":"Its not a stare down, lol! Whe one talks the other listens & thinks, then vise versa.","commenter_a":"Obama is intimidated by Putin he can't even look at him in the eyes.","post_message":"Heads slightly bowed, looking extremely serious: What were Obama and Putin discussing?"}]
