[{"comment_id":"10152624556380667","commenter_b":"He was a true man in every word about iranian government. Thanks Mr President","commenter_a":"America gives you billions, trillions over time and when you include weapons, Iron dome, etc and America does it while American children and American poor struggle and as America infrastructure crumbles, really?????","post_message":"Israeli Prime Minister Benjamin Netanyahu pleaded with Congress  on Tuesday to take a harder line against Iran, saying the nuclear deal being negotiated 'doesn't block Iran's path to the bomb; it paves Iran's path to the bomb.'"},{"comment_id":"1788331291434935","commenter_b":"She is a nasty woman","commenter_a":"If those liberals ever lost their middle fingers they'd never be able to drive in Oklahoma.","post_message":"Leftist Amy Schumer battling charges of racism..."},{"comment_id":"905632936170129","commenter_b":"No mames wey pobre jente k vive cercas!!!","commenter_a":"Luis atacko godzila.","post_message":"Huge Chemical Plant Explosion In Tianjin, China!"},{"comment_id":"1012961912156618","commenter_b":"I would give my share to put there asses on a boat and send the ass holes somewhere else","commenter_a":"Big mouth and no brains. This is what Obama has done for this country. What a disappointment.","post_message":"'Pay me consistently, provide me safe housing, offer me a job with benefits, run me those Beyonce tickets' She must have lost her mind, if she thinks we are going to pay her anything. Will you pay for this entitled BLM organizer to go to a Beyonce concert?"},{"comment_id":"10154148373635736","commenter_b":"His daughter/wife would hate that.","commenter_a":"When they said 'small hard object' I just assumed the president had gotten excited.","post_message":"Police received a report Friday that President Trump's motorcade 'had been struck by what was believed to be a small hard object.' He was passing through Palm Beach on his way to his Mar-a-Lago resort nearby, where he spent part of the weekend."},{"comment_id":"519056438282649","commenter_b":"cair can go to hell","commenter_a":"Our country. .USA..AMERICA","post_message":"PLEASE SHARE AND HELP PROTECT OUR VETERANS!"},{"comment_id":"10153641823407217","commenter_b":"Inbreeding for centuries and lack of education. Most Middle Eastern People are genetically incapable of being anything more than what you are seeing. TRUTH. Which is why we MUST contain them. Putin knows....it's why he is working to get them back home to their litter box...I mean sand box Islam is a political movement designed to install Sharia Law...He doesn't want the creatures No-one does. There is NO such thing as a Moderate Muslim- And BTW Zionist Jews are JUST as Bad.","commenter_a":"That's a stupid question! It got that way because Dick Cheney ordered George Bush to depose Saddam Hussein. All HELL broke loose after that.","post_message":"BBC Middle East Correspondent Jim Muir explores the state of the region he's covered for decades."}]
