[{"comment_id":"611037522408756","commenter_b":"Is this trump's doing ? Has he stirred up so much open racism that a judge would feel more compassion for a white kid ?? Was there a bribe ? Maybe the judge himself is a pedophile? ? This absolutely makes no sense whatsoever. I'm so sick of these judges who release all these rapists back into society. Arrest these judges !!!","commenter_a":"I agree. It is an outrage! I am sure if he had been a minority he would have gotten life in prison!!","post_message":"This is an absolute OUTRAGE."},{"comment_id":"1401035306583488","commenter_b":"Trump was sneaking in another drug shipment.","commenter_a":"Well government systems are remarkably insecure compared to the sensitivity of information on them. If Republicans would stop slashing operational budgets maybe we would have security of information across government. So shortsighted. So small minded.","post_message":"U.S. Department of Homeland Security employees in the Washington area were unable to access some agency computer networks on Tuesday, according to three sources familiar with the matter."},{"comment_id":"10153549578273984","commenter_b":"Kims a whore so who cares","commenter_a":"If killing people make me happy, should I go around and do it? No. I hate when people say, do what makes YOU happy. Hmm. That can apply to a lot of things which are wrong. We should do what makes the Lord happy.","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with... Do you side with Megyn Kelly on this one?"},{"comment_id":"1218557638174745","commenter_b":"Jennifer look's like you like to swallow dick","commenter_a":"Chris brown beats in women","post_message":"LIVE NOW: Police are outside artist Chris Brown's home. Police were called to his home after a woman called 911 requesting help. MORE: fox13news.com/news/@username-story"},{"comment_id":"10152910071581130","commenter_b":"@username, cry me a River. You don't see that those women keep on having babies that they can't take care of and are sold into prostitution. Oh, but im wrong for believing in controlling the problem. And no bitch, I got my tubes cut and burned, because I dont believe in having more then what I can take care of.","commenter_a":"Since they don't have protection & clearly can't afford children why not find alternatives to intercourse? Or maybe idk use some self control & abstain from sex altogether? They are consenting adult women fully aware of the possible outcome/consequences of their choices. Only people I feel sorry for are those babies born into a piss poor life because they have SELFISH parents.","post_message":"“Sharing a bed is fine, it’s okay to share and be all together. But it’s tough because what if the person next to you is sick? What if they pass that illness on to you and your baby?”"},{"comment_id":"1132428533502348","commenter_b":"I think they should be deported back to Mexico. There here because Obama wants more democratic votes. He is now trying to give them rights to vote. A lot of Hispanic legals who work hard are against them.","commenter_a":"This should anger all Americans!! BUILD THAT WALL TRUMP!!!!","post_message":"This firefighter and 2 kids were just killed... if that weren't infuriating enough, wait til you see WHO murdered them. This is EXACTLY what Donald J. Trump has been talking about..."},{"comment_id":"659700944220484","commenter_b":"yes beat her ass for being arrogant","commenter_a":"REALLY,??","post_message":"This entitled woman just demanded a free drink... Because of slavery? This is absolutely ridiculous. We owe her nothing. Should she be compensated for slavery?"}]
