[{"comment_id":"1310724188980341","commenter_b":"This woman has nothing better to do.","commenter_a":"idiot","post_message":"Hey, stop \"appropriating\" our language..."},{"comment_id":"876171829182663","commenter_b":"Moderate moslems DO NOT exist!","commenter_a":"YEP, They are ALL extremists, and should ALL be deported! Its simple!","post_message":"I'm not joking when I say this is the most important video I will ever share..."},{"comment_id":"10153512540611491","commenter_b":"Blow this mf off the face of the earth","commenter_a":"@username Camangyan","post_message":"\"The only way for defending the sovereignty of our nation and its right to existence under the present extreme situation is to bolster up nuclear force.\""},{"comment_id":"10153641394251350","commenter_b":"I think she would be a skank in a princess gown.","commenter_a":"Hilarious ! She has guts. Good for her!","post_message":"What did you think of Miley Cyrus' first outfit of the night at the MTV Video Music Awards?"},{"comment_id":"1040857019285867","commenter_b":"Go back to Cuba shitstain.","commenter_a":" II Bill of Rights. A well-regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed........................ . MOLON LABE (Come And Take Them). Obama, you pussy, from my cold dead hand!. . \"A well-regulated militia being necessary to the security of a free state, the right of the people to keep and bear arms shall not be infringed.\" \"I ask, sir, what is the militia? It is the whole people, except for a few public officials.\" George Mason, in Debates in Virginia Convention on Ratification of the Constitution, Elliot, Vol. 3, June 16, 1788.. NOT ONE of the new obama regulations will prevent a terrorist or thug from securing a weapon and using it ... That is the issue.... This is just more political BS for resume enhancement..... Terrorist and thugs DO NOT buy their ...","post_message":"This is only the beginning folks..."},{"comment_id":"10153974696736943","commenter_b":"Double talk.!","commenter_a":"This is how you stand for law in government?","post_message":"Wednesday, June 01, 2016 Judicial Watch Director of Research and Investigations Chris Farrell appeared on\"America's Newsroom\" on Fox News Channel to discuss the latest developments in the depositions of Former Secretary of State Hillary Clinton inner circle regarding her use of private email while serving at the State Department."},{"comment_id":"10154105863319087","commenter_b":"Anyone who has an education voted for Bernie, because they know that Hillary is a liar and a right-leaning moderate. #BernieOrBust","commenter_a":"Clinton also leads with people who have educations. Gee, go figure","post_message":"Donald Trump may be rich, but the rich actually prefer Hillary Clinton."}]
