[{"comment_id":"1826661334287644","commenter_b":"These two comments made me laugh out loud!","commenter_a":"I didn't see Elizabeth Warren in there...","post_message":"Can you imagine seeing this in the distance? Unbelievable..."},{"comment_id":"998135870245890","commenter_b":"One thing about Hillary she's use to it","commenter_a":"Who are they going to blame when the current President is gone? If GOP members weren't so low information they'd know that these gifts stay with the US government unless the Obamas reimburse the government for the price of the \"gifts\". Another pathetic attempt to start an issue there isn't one.","post_message":"Once again, the right-wing media left out a few important details..."},{"comment_id":"10153685089913037","commenter_b":"@username how about we deport you Michelle? You see my Apache and Mexican ancestors were here before you ancestors ever set foot, RAPED and KILLED my people. Texas belongs to us. So, get it straight. YOU are the illegal here Michelle.","commenter_a":"Omg if you are legal he doesn't want to send you back. If you are illegal you should be in jail anyway","post_message":"\"It was kind of demeaning.\""},{"comment_id":"1044585922265355","commenter_b":"Poor little Marco.","commenter_a":"Senator Rubio, please stop getting in the gutter. Your recent comments make you sound like like you are 5 years old. You are better than that and I am so very disappointed.","post_message":"\"And you know what they say about guys with small hands...\" Marco Rubio said of Donald J. Trump."},{"comment_id":"10154170827586756","commenter_b":"@username dont u have a planned parenthood office to firebomb like your christian boy did in denver? come at me asshat i'll beat your ass down and light your hairy persian ass on fire to worship in lol","commenter_a":"I hope American culture and goods don't start to flood Iran and ruin it","post_message":"NPR's Steve Inskeep revisits three Iranians he met last year to find out if their lives have changed because of Iran's nuclear agreement with world powers. \"We are actually in a new world,\" says one."},{"comment_id":"1109934812394016","commenter_b":"ah so cute. huma and hillary both have repeatedly philandering husbands.","commenter_a":"when your wife's in bed with the democratic presidential candidate and your home watching the children you have to do something ?????","post_message":"ANTHONY WEINER CAUGHT AGAIN: Sends Kinky Shot To Brunette With 4-Year Old Son Next To Him Get out the eye bleach..."},{"comment_id":"10156331027250354","commenter_b":"She's an idiot!!","commenter_a":"She's not speaking for me that's BS","post_message":"Does she speak for you?"}]
