[{"comment_id":"875716175906497","commenter_b":"No Muslim majority country throws gays off of buildings (unless you want to recognize the legitimacy of the \"Islamic State\"). Genital mutilation has no semblance of a relation to Islam. It's a cultural problem endemic of Northern Africa, not Islam (Christians and Jews from this region have the same problems with this practice).","commenter_a":"Yeah, except this ancient religion doesn't through gays off buildings, mutilate female sexual organs, and and want to kill anyone who doesn't become a Jedi! DUMBASS!!!!","post_message":""},{"comment_id":"10158034065045277","commenter_b":"No","commenter_a":"No","post_message":"Right-to-Work... Right for Missouri? We want to know your opinions, so tell us!"},{"comment_id":"10155026863931509","commenter_b":"she doesnt look that bad for a transgender","commenter_a":"What a beautiful woman our first lady is.","post_message":"First families join hands for a rendition of \"The Battle Hymn of the Republic\" during memorial for slain Dallas officers. @webpagelink"},{"comment_id":"784296501703530","commenter_b":"Gross! It smells like Hitler up in this bitch.","commenter_a":"Isn't this another thing he can be impeached for?","post_message":"BREAKING NEWS...."},{"comment_id":"10153903712141051","commenter_b":"Your a bitch !!'","commenter_a":"Black lives matter??????? Nop!","post_message":"You read that right: this man raped not only his 82-year-old grandmother but also his uncle. She had just one question for him."},{"comment_id":"1165649100139095","commenter_b":"All he's ever done is ramble on. His supporters are just too stupid to realize it.","commenter_a":"I'm still waiting for Obama to answer the 2nd part of his question, which was, \"Why won't you light up the White House in blue\"? He just rambled on for about 5 minutes and completely dismissed the question.","post_message":"\"I'm not happy.\""},{"comment_id":"927016837412270","commenter_b":"So therefore, our tax dollars wouldn't be an issue in that legislation.","commenter_a":"Donald Trump is smeared 24/7 by the media, so I'd say no. Probably the most unfair media coverage I've ever seen. Mainly because he's at odds with the globalists that own almost all the media outlets. Hell time warner owns cnn and they've given the Clinton campaign over $600K.. so what does that tell you.","post_message":"Has the media treated your 2016 candidate fairly?"}]
