[{"comment_id":"10150578591129999","commenter_b":"she has class","commenter_a":"Sexy","post_message":"Jennifer Lawrence in Dior couture at the Met Gala. See more photos: @webpagelink Credit: Josh Haner/ The New York Times"},{"comment_id":"767374910062356","commenter_b":"Yes!","commenter_a":"Lord help us she is just like Obama.","post_message":"Can we PLEASE learn from last time?"},{"comment_id":"10154042161636910","commenter_b":"USA Vets, homeless, the disabled! All of our own meaning legal USA citizens need to be taken care of FIRST. That's what we pay into. Get rid of who is faking it also.","commenter_a":"9th Circuit Court of Appeals issued a decision backing an earlier decision by a federal district court judge in Washington State that put President Trump national security Executive order affecting seven countries that harbor terrorists on hold. Activist Judges intruded into areas reserved by the Constitution powers which unambiguously gives constitutional powers to the President. That is why the 9th Circuit ruling is so fundamentally wrong by assuming the power of the President. It is the 9th Circuit that violated the Constitution under the Separation of Powers with its ruling. The fact is that President Trump clearly has the constitutional and statutory authority to issue this order. It is clear: radical Islamic terrorists are at war with America. President Trump order is a proper and constitutional way to protect America. Again, the directives contained in the President Executive Order are closely tethered to discretionary powers vested in the Executive Branch ...","post_message":"A MAJOR SETBACK FOR PRESIDENT TRUMP: The 9TH Circuit Court of Appeals has ruled unanimously against reinstating Trump's travel ban. Do you agree with the ruling? @webpagelink"},{"comment_id":"611037522408756","commenter_b":"Is this trump's doing ? Has he stirred up so much open racism that a judge would feel more compassion for a white kid ?? Was there a bribe ? Maybe the judge himself is a pedophile? ? This absolutely makes no sense whatsoever. I'm so sick of these judges who release all these rapists back into society. Arrest these judges !!!","commenter_a":"I agree. It is an outrage! I am sure if he had been a minority he would have gotten life in prison!!","post_message":"This is an absolute OUTRAGE."},{"comment_id":"10153774153353145","commenter_b":"hello your in AMERICA","commenter_a":"If this sign dictated what language I spoke at home or with my friends, I would take offense. But if this sign was at work, I think it is appropriate to expect English. You shouldn't be off carrying on non-work related conversations anyway, English or not.","post_message":"English only? Many Hispanics who use the Deltona Community Center took offense to this sign. How would you feel if your job tried to enforce this rule? The organization said the sign was necessary for safety reasons. @webpagelink"},{"comment_id":"10153810212319087","commenter_b":"stupid picture talking bitch. @webpagelink","commenter_a":"this is good. \"Rarely does a presidential election hit the unthinkable issues that can completely divide a nation and endanger the peace and security of that nation. It seems Donald Trump is poised to kick down doors concealing issues that mainstream media and mainstream candidates fear to even discuss. The competence level of our leaders in government and their weak attempt to compete in world markets is one of this countries forbidden issues. The other forbidden issue is the democratic party position that Islam has nothing to do with violence, as opposed to Donald Trump explosive position that hates us. It a good bet that America is about to get an education in what Islam represents and what its intentions are, as perceived by Donald Trump. I believe the two afore stated issues will sharply divide the American electorate and could possibly threaten the peace in some instances. Donald Trump ...","post_message":"Here are five of the most important primary fights to watch this month that could determine who will win this fall's battle for control of Congress."},{"comment_id":"10155023002574740","commenter_b":"Leave that girl alone","commenter_a":"Shepard Smith Reporting Donald Trump President of USA doesn't want the media or anyone announcing his plans to defeat Isys enough already of selling our plans out globally, do like Donald Trump says we're going to take action without letting them know when, stop @username with telling Isys our plans","post_message":"The Office of Government Ethics is asking The White House to investigate Kellyanne Conway over her remarks regarding Ivanka Trump and Nordstrom. @webpagelink"}]
