[{"comment_id":"10154009646005695","commenter_b":"Add this to the list of reasons why #ChikFilA is so awesome","commenter_a":"That's bc CFL is a Christian company....no PB sandwiches....love it, gives u hope nation has not completely brought into 'crap on everybody while I make my millions' type of company.","post_message":"AWESOME! Volunteers delivered free sandwiches to first responders and victims of the storms."},{"comment_id":"10153193564170326","commenter_b":"Hell, they should move to texas!","commenter_a":"The GOP and their love for guns should move to Somalia where even children carry guns","post_message":"\"More guns\" is always the answer."},{"comment_id":"444470795746949","commenter_b":"It's all about him he really doesn't care about us what a dick","commenter_a":"He has zero fuks to give.","post_message":"As 43 Americans are killed by tornadoes during the Christmas holiday, Obama golfs (again)..."},{"comment_id":"10153572834548132","commenter_b":"He fucked his sisters......BIG difference","commenter_a":"She's right. There was virtually no mention from the media of Lena Dunham's admission of touching her sister when her book came out. Complete double standard.","post_message":"Sarah Palin isn't too happy with what she calls \"obvious double standards\" between the Duggar family and actress Lena Dunham."},{"comment_id":"1121854401168903","commenter_b":"Stfu fat bitch","commenter_a":"Is it because they're assholes?","post_message":"They spend their lives eating rotten meat - so why don't they get sick?"},{"comment_id":"1657355931148625","commenter_b":"We are armed. Don't kid yourself Mitchell. The difference is that we would take up arms to protect the land by preventing poaching, over-grazing and unsustainable resource extraction, whereas these fucks want unregulated access to sensitive ecosystems.","commenter_a":"Oregon is an open carry state. These Militia men aren't doing anything wrong. The BLM outpost is on public property and was unlocked. There was no violent takeover. They are protesting just like the black lives matter movement that all you libs support The only difference is these men are willing to fight for their land","post_message":"\"We're planning on staying here for years.\""},{"comment_id":"10155086794306729","commenter_b":"What did she care....that bitch was in it for the money.","commenter_a":"Pantsuit Nazi...","post_message":"Wow... Help spread the word folks!"}]
