[{"comment_id":"1737362022990205","commenter_b":"#fingersinthebootyassbitch","commenter_a":"He looks miserable. ..","post_message":"Kim Kardashian West is reportedly 'annoyed at him for refusing to rest' following 'psychotic break' (Via Daily Mail Celebrity)"},{"comment_id":"10154067022696336","commenter_b":"All you have to do is watch him lady.","commenter_a":"Well, I don't know if Donald Trump is a Christian or not and neither does that pope. Only Donald Trump and God knows that. And I heard a man on TV this morning calling the pope \"the Holy Father\" and my bible says to call NO MAN Father, but your Father in Heaven and I DO KNOW THAT IS GOD.","post_message":"Donald J. Trump responded to Pope Francis suggesting that Trump is \"not Christian.\" @webpagelink"},{"comment_id":"10153831851540695","commenter_b":"There are meds for your issues.","commenter_a":"They got to make Room for these Muslims... We Americans get kicked aside or a Boot in the rear.... Getting More Crazy by the day... America has been Captured by the Islamic Nation... Muslims are taking over... Life is about to change in America... to the Worse........","post_message":"Dozens of residents are homeless after being given 60 days to leave. The city says it plans to build high-rise apartments on the land."},{"comment_id":"1181717725240095","commenter_b":"lol actually u support a murderous witch AKA BENGHAZI BITCH","commenter_a":"TO BAD ALL THE BULLSHIT HE TOLD WAS A LIE.","post_message":"Donald J. Trump just gave the speech of a lifetime... but more importantly, he totally destroyed Hillary Clinton. He put a very special message to Hillary in there that you won't want to miss."},{"comment_id":"464203950436852","commenter_b":"No way. Let the Muslims get over it. If you don't like it here go back where you came from.","commenter_a":"We should shoot them with bullets dipped in bacon!","post_message":"Should The Words 'Bacon', 'Pork', 'Sausage' Be Banned? Comment 'yes' or 'no'."},{"comment_id":"10154688029234749","commenter_b":"No, not all woman. Just ugly dogs like yourself","commenter_a":"Because the beard makes them extra ugly and nobody else wants them","post_message":"A little bit of stubble has a whole other meaning though..."},{"comment_id":"851850534874696","commenter_b":"Loads of respect for her now:) well done woman! Anything to wind those twats up makes my day","commenter_a":"Good","post_message":"Selena Gomez sparks fury by violating religious dress code in mosque."}]
