[{"comment_id":"10155406467768812","commenter_b":"Didn't miss em. Had same day as any other.","commenter_a":"Idiots. Proof of the problem","post_message":"People protest around the country in support of a \"Day Without Immigrants,\" a protest against President Donald J. Trump's promises to crack down on illegal immigration. abcn.ws/2kX8c5V"},{"comment_id":"10154553416661162","commenter_b":"Our marriage will never end then!","commenter_a":"@username I guess this was the problem lol","post_message":"CHEERS! A new study says couples who drink together, stay together."},{"comment_id":"10156390039050725","commenter_b":"That would be the best way to guarantee Hillary into the White House!","commenter_a":"I will!","post_message":"A new poll indicates that 68% of my supporters would vote for me if I departed the GOP & ran as an independent.   @webpagelink"},{"comment_id":"1018828211502577","commenter_b":"Thank you, that's what I'd like to know! B**** needs to SIT DOWN lol","commenter_a":"Wtf for?!?","post_message":"She's up against Malala Yousafzai and Pope Francis."},{"comment_id":"558362490993134","commenter_b":"Why is it we are so intent to run our country into the ground?? Follow Trump, and mark my words, there will be a WWIII, and everyone will be pointing their guns here. We will have no allies as he will insult them all. Wake up, America.","commenter_a":"\"I will not forget.\" What in the hell do that suppose to mean?","post_message":"Do you agree with Donald J. Trump's tweet?"},{"comment_id":"10154228784001378","commenter_b":"Yes ty @username I did","commenter_a":"@username did you get one yet?","post_message":"The Hatchimals are coming! The Hatchimals are coming! Target has announced that a new shipment of the hottest toy of the holidays will be popping up in stores nationwide starting today. Are Hatchimals on the list this year?"},{"comment_id":"10153803729806336","commenter_b":"Yes, and McCain and Graham were WRONG! Just like letting all these muslim immigrants into our country...we dont know WHO THEY ARE!!!","commenter_a":"Wait. You cry and cry that he has not done enough in Syria. He then sends some. And you get upset over that??? Fox / GOP supporters make zero sense.","post_message":"On \"Justice,\" Judge Jeanine Pirro slammed President Barack Obama's decision to send U.S. troops into Syria, after repeated pledges of no boots on the ground. @webpagelink"}]
