[{"comment_id":"10153311119075329","commenter_b":"I want to know how many of the women that are saying 'I use soap to clean my vag !' Are really only using soap on their vulva and are NOT actually sticking soap in their vagina.","commenter_a":"Jonathan Perez hahahzha jk","post_message":"FYI"},{"comment_id":"10154633798866729","commenter_b":"Jamie i am totally sober at all times Jamie…..maybe you are on drugs for believing she is not an Evil Satanic Whore who laughs at Raped 12 year old Girls when she knowingly defends their guilty Rapist ?","commenter_a":"Many in the FBI still do love this country very much and are NOT blind followers of Obama and his Anti American Commie nonsense….it would be a good tactical move to wait till Hillary is nominated as the 'Head Liberal Witch' before they Arrest her and burn her at the Stake ( like we are all praying) happens on live TV so we can rub one out while watching her salty tears run down her Reptillian Alien face.","post_message":"Finally, the end may be near..."},{"comment_id":"901969823182419","commenter_b":"Girls like my weiner better.","commenter_a":"Nassssty fat pill..... puke","post_message":"A hot dog on a donut packed with bacon and jam... Here's where you can get it: @webpagelink"},{"comment_id":"10153310876381770","commenter_b":"'@username right lol these idiots.","commenter_a":"Even as a Republican voter, I believe that we don't need another Bush in the White House.","post_message":"Jeb Bush is suspending his campaign for the Republican presidential nomination following a dismal performance in the South Carolina primary."},{"comment_id":"10154164610665796","commenter_b":"These people aren't here illegally...","commenter_a":"they dont need our help if there illegal except for a plane ride back to were they came from so they can do it the right way","post_message":"The state plans to end its part in the resettlement of refugees, who have fled war or persecution, on March 4.   The full responsibility for resettling refugees and overseeing federal money for refugee services is expected to shift to Catholic Charities Maine."},{"comment_id":"10156506667295354","commenter_b":"MUCK FUSLIMS","commenter_a":"They hate what it stands for Freedom, and they want to take it over, take away all freedom and replace it with Sharia. They will by population growth win this battle and eliminate all non muslim men, women, and your children if you allow them to settle in our Country.","post_message":"'The hatred of infidels is a religious imperative in Islam. No matter how fast we dance, appease, pay, accommodate, and submit, the hatred and holy war will not cease. On the contrary, the more we submit and reward the hatred and terror, the more we will have to surrender.'"},{"comment_id":"10153021059601051","commenter_b":"What a cruel woman","commenter_a":"All I can say, is he is better off without her for a mother.","post_message":"This baby's mom decided she didn't want him anymore and had him deported."}]
