[{"comment_id":"1757840827811038","commenter_b":"Cindi, your an idiot. She is legal.","commenter_a":"She has bad health,think how much more will she take from we all to stay alive","post_message":"LIVE Trump! DRAIN THE SWAMP FOLLOW US for Conservative news!---> Freedom Daily Donald J. Trump Donald Trump For President #maga"},{"comment_id":"10154522973374102","commenter_b":"She may be the lesser of two evils, a female, a scapegoat, but she's still a nut job.","commenter_a":"I'm not saying she doesn't deserve disciplinary action, because she does. But I find it disgusting that they are targeting ONLY her, and not Trump's tweets against Nordstrom. I get that she's an easier target for the GOP, but grow a pair of balls, please.","post_message":"BREAKING: The Republican chairman of the Oversight Committee is recommending disciplinary action against Kellyanne Conway for promoting Ivanka Trump products from the White House, including \"reprimand, suspension, demotion, or dismissal.”"},{"comment_id":"10155810026285725","commenter_b":"Now Mr Trump you know as well as I do Obobblehead is a backstroker, he says one thing and then does another, then tries to back stroke to cover his lies","commenter_a":"Finally someone who thinks like a REAL American!! You have our vote.","post_message":"Make our borders strong and stop illegal immigration. Even President Obama agrees-"},{"comment_id":"952692328160353","commenter_b":"I actually do darling. No go back to sticking your head back into a special orafice... ;-)","commenter_a":"As he should. Obamacrap only works, if you don't. LEACHES.","post_message":"It wasn't a good day for Justice Scalia."},{"comment_id":"10153199958166051","commenter_b":"The bitch is lucky to be alive","commenter_a":"Why sue the apt for our own stupidity??? You don't block windows with any furniture you know in case of FIRES!!!! Geeze what a stupid smuck","post_message":"This woman fell out of bed, though an open window and three stories down to the hard ground below. Now she's suing."},{"comment_id":"961657090560706","commenter_b":"Ugly woman!","commenter_a":"I am sorry but on this point I do agree with her,but I do not agree with the fact she is on 20k a year,","post_message":"Benefits mum does not understand why we send money to Africa"},{"comment_id":"1011118955590810","commenter_b":"This woman has to go, she is crazy :(","commenter_a":"Yes, it's about the continued spread of the lefts fourth Reich! Whose ultimate leader, Satan, must be proud! Hillary, Bernie, Obama and his flunkies all cut from the same deprived mindset!","post_message":"PAY ATTENTION “This action is about a great deal more than just bathrooms,” Loretta Lynch declared."}]
