[{"comment_id":"10153050457656037","commenter_b":"Oh poor thing she cant make her 10,000 a month rent and shes too good for an average joe apt what a predicament and if its not acting or showbiz im not working they are all the same","commenter_a":"Come over to my house free rent plus all the free SEX you can get x10 =!","post_message":"66-year-old actress #DianneWiest, who begins previews Tuesday for off-Broadway production Rasheeda Speaking, told the New York Times she is facing money issues due to a lack of high-paying work."},{"comment_id":"10153672821839270","commenter_b":"Illegal aliens, syrian refugees, and every other worthless non-american can get all the free stuff at no cost. WE veterans have to pay for what we earned. There is a revolution coming. WE THE PEOPLE have had enough.","commenter_a":"Lier lier lied,,,, sign here and have free health care for life. I'm so glad I have full VA benefits.","post_message":"Some big changes."},{"comment_id":"1157727034250343","commenter_b":"Bunch of scum bags","commenter_a":"Spin, spin, spin, is that all we get today ?","post_message":"CBS journalist ADMITS it's their job to protect Hillary Clinton's past."},{"comment_id":"642366659287246","commenter_b":"Megan, you do a great job for Fox. They are lucky to have you.","commenter_a":"Fair and Balanced?!?!?","post_message":"Megyn Kelly may be getting kicked off the air... FOX needs our support, let's give it to them. Do you support FOX News?"},{"comment_id":"10153259767028132","commenter_b":"Go back to stinky Bay City!","commenter_a":"Who cares about Madonna. She looked horrible at the Grammys and she has no room to talj","post_message":"Madonna is not a Fifty Shades of Grey fan."},{"comment_id":"10152882564604024","commenter_b":"This chick def. has mental issues like Julie stated. You need to know when to just not add fuel to her fire. Who knows what she would've done if this argument escalated.","commenter_a":"I've been taking NYC subway all my life and this is rare and far between. The vast majority of people are actually pretty nice. I hate watching these things because it makes us look really bad to outsiders. There are over 8 million people in this city, of course you're going to get a few bad ones, it's just the odds. Please don't judge us all based on a few..","post_message":"If you witness this fight, would you try to settle it? How?"},{"comment_id":"10155326860884199","commenter_b":"lmao, and this woman is fit to be President? People have lost their everlasting minds!","commenter_a":"Hillary sucks","post_message":"Hillary Clinton is speaking at the Congressional Hispanic Caucus Institute."}]
