[{"comment_id":"546377932240042","commenter_b":"Wage gap seems like it is there but you femminists are being insincere about what it really means. You dont take so many factors into account. Men are more likely to work overtime. Woman take maternity. Woman should be thankful for that! How about that woman tend to get degrees that end up being useless and so they have to take lower paying jobs that arent what they studied for. There are SOOOOOOO many factors yoi ignore but without a doubt a woman WILL BE PAID THE SAME IF SHE DOES THE SAME WORK AS A MAN","commenter_a":"As a guy, I still love this. Great idea to raise awareness and galvanize support for an end to the gender gap and income inequality","post_message":"Take a deep breath, guys."},{"comment_id":"1510912668928758","commenter_b":"The choice is simple one's a white supremacist with thousands of racist supporters.....and the other is a woman that rubs you the wrong way","commenter_a":"What a surprise","post_message":"The endorsement will run in Sunday's edition of The Times — a day before Hillary Clinton and Donald J. Trump go head-to-head in the first presidential debate."},{"comment_id":"10156923997390354","commenter_b":"She is a hoe so how do you defend that!","commenter_a":"Gee, imagine Trump doing the same to Cruz and his wife. If you don't want bullets shot at you don't start the war. So low class on Cruz's part to attack Trump's wife. She isn't running for president.","post_message":"Legit?   Here's the side-by-side comparison of the 2 lines..."},{"comment_id":"10156223165790354","commenter_b":"Hell no they wouldn't. I'm still waiting on them to post the story about the white guy in South Dakota, that accidently shot his penis, while purchasing a gun illegally and tried to blame it on a black guy. They didn't even post the story about the white people in TX, that vandalized their vehicles and tried to put the blame on BLM. This page is a joke.","commenter_a":"I wonder if @username would have featured this news item if the chick was white ? Somehow I doubt it.","post_message":"And look what ELSE she did..."},{"comment_id":"1054986811286811","commenter_b":"She is looking weak","commenter_a":"Hillary Clinton is as transparent as mud. She's so deplorable....no wait...I don't want her sharing my basket. Trump/Pence 2016","post_message":"Question of the Day: Do you think Hillary Clinton has been transparent about her health? Share your thoughts below!"},{"comment_id":"10154742195526178","commenter_b":"The X miss universe is Hillary's friend plus the miss X universe is in a world of hurt on her own now she's in trouble with the law","commenter_a":"RUSH: The thing that's ironic about this, they're claiming that Donald Trump bullied this ex-Miss Universe. Has anybody asked about Hillary Clinton bullying all of the bimbos that have erupted during the course of her and her husband's political career? This is so screwed up. If there is anybody in this campaign who doesn't pay women what she pays men in her office, it's Hillary Clinton. If there's a woman in this campaign that bullies other women and has been acclaimed for it, it is Hillary Clinton","post_message":"Now First Lady Michelle Obama is getting into it with Donald Trump."},{"comment_id":"10155618780610093","commenter_b":"Go stick your head back in the ground Anne...clearly you have failed to realize that unless ISIS is wiped out..they will not stop...period. And yes they want to strike us here. You want that? You rather they come here on our turf? Lady you better do a gut check and wake the hell up.","commenter_a":"Sorry but we should NOT have boots on the ground in Syria.","post_message":"\"It involved hand-to-hand combat, the jihadists tried to use women and children as human shields, and about a dozen jihadists were killed.\""}]
