[{"comment_id":"10152777603232093","commenter_b":"Idiots","commenter_a":"I say bring a fire truck and water there down. Keep then at a distance.","post_message":"15 officers have been injured in Baltimore riot, 2 still in hospital; 2 dozen arrested..... @webpagelink"},{"comment_id":"10153694012485779","commenter_b":"Smart women!","commenter_a":"See some women aren't as smart as men","post_message":"Part support group, part grassroots political organization, Republican Women For Hillary was founded in Washington, D.C. where GOP women were commiserating about Donald J. Trump. Meet the Republican women who are backing Hillary Clinton."},{"comment_id":"10156128714545725","commenter_b":"About time he helped his teammates out","commenter_a":"Them mugfucken Cubs been killen","post_message":"What a game! Let's hear it for the Cubs ----> @webpagelink"},{"comment_id":"10154414118997042","commenter_b":"Exactly, she's just a trophy Wife to Donald anyway.","commenter_a":"Mealania Trump's If she only had a brain","post_message":"Melania Trump is being accused of plagiarizing from Michelle Obama's 2008 Democratic National Convention speech.   Judge it for yourself:"},{"comment_id":"10158383797715093","commenter_b":"what do we care? get the wall built!","commenter_a":"I BET THE PEOPLE WHO LEAKED WERE DEMOCRATS","post_message":"\"It time for the constitutional system to work. It time for the legislative branch to investigate the executive. Simply put, it time for the truth.\""},{"comment_id":"10153273876007377","commenter_b":"Lady!!1 It's Jail time !!!","commenter_a":"She is a LIAR and TRAITOR.","post_message":"This is a clear violation of federal law that has put these agents in harm's way."},{"comment_id":"10153361519746813","commenter_b":"That's the point. You said it yourself. Men have been using the men's room and women have been using the ladies room without an issue since forever without any problems. My point is that the law allows for men to use the ladies room and women to use the men's room, that is the basis of this law.","commenter_a":"I want to know why this is such a \"hateful\" law. The \"party of science\" is arguing against a law that basically says \"You know this restroom that's for boys/men? Only boys/men can use it. You know this bathroom that's for girls/women? It's only for girls/women\". So you think if women feel uncomfortable that a man that says \"Hey, I feel like a woman\" goes into a woman's locker room must hate LGBT people? Really? It's not the trans people I'm concerned about. It's the people POSING as trans people. Why should women be made to feel uncomfortable just so a man that thinks he's a woman can use the women's restroom/bathroom? Wanting people to use the bathroom of the sex they were BORN with (and actually STILL are, as science dictates) does NOT = hate.","post_message":"After nationwide outcry about North Carolina's harmful anti-LGBT law, Gov. McCrory said let's \"work on solutions that will make this bill better\" because NC is \"a state of inclusiveness, openness and diversity.\" Let’s make it clear - that means REPEAL HB2. Keep the pressure on. Add your name: @webpagelink"}]
