[{"comment_id":"10153036362074411","commenter_b":"I wasn't looking at the women.","commenter_a":"I've been to the Middle East and the people there are so beautiful. Their eyes mesmerize me.","post_message":"The corporal punishment will be carried out for 20 weeks after Friday prayers outside the mosque in Jeddah. That is the place famous for executions carried out in and it has got a nickname \"Chop Chop Square\""},{"comment_id":"10152777603232093","commenter_b":"Idiots","commenter_a":"I say bring a fire truck and water there down. Keep then at a distance.","post_message":"15 officers have been injured in Baltimore riot, 2 still in hospital; 2 dozen arrested..... @webpagelink"},{"comment_id":"10153903202659641","commenter_b":"Suck one Ortiz","commenter_a":"All those who dont like Zuckerberg you are free to delete your facebook account","post_message":"Mark Zuckerberg isn't happy about what people have been writing on Facebook's chalkboards."},{"comment_id":"1184948411561852","commenter_b":"FOREIGN WORKERS MEANS TAX BREAKS FOR THE COMPANIES AND LOWER WAGES..... ALSO MEANS NO JOBS FOR USA CITIZENS!!!!! TRUMP FOR POTUS - DEPORT THE ILLEGALS AND STOP WORK VISAS !!!!","commenter_a":"In my lifetime, I have been through 3 amnesties. Each was promised to be the last. Does anyone in the Congress, who made this promise to the American people, have enough backbone to honor their word? Seems not. Why believe anything they tell us?","post_message":"Not good."},{"comment_id":"1115675945183452","commenter_b":"Your the one that is shaming Donald @username, you have found him guilty in public opinion.","commenter_a":"I don't believe her! She said it went on for 15mims, could have done something to stop it in that amount of time, and in a plane at that.","post_message":"Jessica Leeds said Donald J. Trump kissed her \"wherever he could find a landing spot\"  @webpagelink"},{"comment_id":"848078538560940","commenter_b":"Only fucking idiots want her","commenter_a":"Am I the only person who likes her? Yikes.","post_message":"Hillary Clinton could finally shatter that glass ceiling."},{"comment_id":"10153811785661486","commenter_b":"Aamen","commenter_a":"Wow","post_message":"A relative of Princess Diana, Prince William and Prince Harry has moved one step closer to sainthood."}]
