[{"comment_id":"1359423070754409","commenter_b":"WOW gives a whole new meaning to hard boiled and 3 minute egg","commenter_a":"So we're any charges filed on the creeps who took advantage of her bad luck?","post_message":"The woman admitted she exchanged sex for money and that she performed sexual acts in a chicken coop."},{"comment_id":"756897567834154","commenter_b":"Bitch","commenter_a":"We all talk on facebook but it does no good.The women can't see what Hillary is or they haven't Google her.She was not brought up poor.never went one day without food clothes or shoes .She is a liar er and a traitor. And those who are voting for must be as bad as she is She will end USA as we see it.Hasnt the zebra done enough destroy our country? Apparently not for you dumb asses voting for the murder.I guess you have no relation in the armed forces. Because if you do there's no way you would even consider voting her in.Open your eyes","post_message":"Hillary Clinton's Career Could Be Over After She Was Caught Endorsing The KKK [VIDEO]  She is doing everything she can to get this video taken down. Let's spread it.  Do you think Hillary Clinton is not fit to be president?"},{"comment_id":"10154024832271756","commenter_b":"Garbage men make a shitload of money. pun intended.","commenter_a":"I found a great way to pay off my student loans....after college I got a job","post_message":"The government estimates that some 41 million students together owe more than $1.2 trillion."},{"comment_id":"10153486710565779","commenter_b":"You, madam, are an idiot","commenter_a":"Well Bruce would allow a hairy old pervert in the restroom with that 10 year old girl, as long as he thought he was a woman. Let's all go to the zoo, and think we are lions and tigers, and go in their cage to do our business....... See how that works out Bruce. ;)","post_message":"Bruce Springsteen and the E Street Band closed out the U.S. leg of their 'The River' tour at Barclays Center last night with a three-and-a-half hour set that included covers of Prince's \"Purple Rain,\" John Lee Hooker's \"Boom Boom\" and Jimmy Cliff's \"Trapped.\" But it was a 10-year-old fan that provided one of the night's biggest highlights. Watch their performance of \"Blinded by the Light\" below."},{"comment_id":"10153684606323487","commenter_b":"There is no part of any of the Planned Parenthood video footage of a fully-formed aborted fetus on the table, with its heart beating, its legs kicking, IT IS A LIE!!!!!! The damned bitch lied!!!!!","commenter_a":"In the sense that she lied louder and slower than the others, Carly owned the night.","post_message":"Carly Fiorina owned the night."},{"comment_id":"10153799919868352","commenter_b":"She trying to get relevant","commenter_a":"Whaaaaaat","post_message":"‘Whitney will haunt you from the grave': Fight breaks out at Bobbi Kristina’s funeral after Bobby Brown’s screaming aunt has to be ‘escorted out by Tyler Perry’ for attack on Pat Houston mid-service"},{"comment_id":"975168222494648","commenter_b":"Not really , I was talking about little pussy Libtards like you Chucky boy !","commenter_a":"Yea , all money belongs to the Dear Leader. And he gives us only what we need or deserves ! Just look at how that worked out with Joseph Stalin !","post_message":"Oh no."}]
