[{"comment_id":"10155788720365405","commenter_b":"What are you smoking Kate!","commenter_a":"Let's all remember that when Reagan was inaugurated, within hours he was greeting our 50+ hostages held in Iran for more than 400 days. Gov. Walker, you may be the one that will greet them in those hours following your inauguration.","post_message":"In this bad Iran deal, Obama has given up a lot and he hasn't even managed to bring back our Americans currently held hostage in Iran's prisons. We have to stop this reckless and irresponsible deal today. Join me in calling on Congress to stop this deal: @webpagelink"},{"comment_id":"1079787262080732","commenter_b":"BYE BITCH","commenter_a":"@username this is SCARY accurate dont hug me when u come home","post_message":"\"I love you.\" \"Ew. Stop.\""},{"comment_id":"1122482747785208","commenter_b":"Nice fat white chick.....the black man's kryptonire....","commenter_a":"\"He shouldn't be golfing he should be working. How dare he.\" Sincerely, Everyone who didn't care when GW Bush did the same thing while he was in office.","post_message":"WATCH: President Barack Obama sinks 40-foot chip shot on 18th hole while on Hawaiian vacation: @webpagelink"},{"comment_id":"10153062603882235","commenter_b":"What is it about the name Cheney that brings out the stupid? Good God woman shut the hell up and stop sounding like your father. smdh","commenter_a":"Blackface was always intended to degrade. Drag is something else entirely.","post_message":"Mary Cheney — the lesbian daughter of former Vice President Dick Cheney — asked in a Facebook post this week why drag performers are allowed to blur gender lines in their work while society frowns on the form of racial minstrelsy known as “blackface.”"},{"comment_id":"10153295593767452","commenter_b":"Put her in jail!! She had no right to throw her father down the stairs! She's an abuser!!","commenter_a":"I bet her Dad took her to, and paid for, many, many, many, ski lessons and trips to many competitions, and was always in the crowd and supported her all the way, and all that comes with giving your child everything for your child to become a champion. She didn't get that far without a ton of support. If she did this to MY Dad, I'd be in the slammer too, surely with a much higher bail. Wasn't Picabo a downhill champ? Now, she is definitely a downhill champ - Picabo, you beat everyone to the bottom this time! This makes me happy I have no children - I'd rather be abused by a stranger than someone that I gave much love and support to. Picabo, thanks for making it to the bottom before all of the competition once again! Hope you have a kid that can maybe return the ...","post_message":"Olympic gold-medalist skier Picabo Street has been charged with assault and domestic violence after authorities say she pushed her 76-year-old father down the stairs and then locked him in a basement."},{"comment_id":"10154128572736378","commenter_b":"Shouldn't they have to go back home before mommy and daddy lock the basement door","commenter_a":"Wonder if they voted?","post_message":"#BREAKING - Hundreds of protesters are marching through Center City, Philadelphia tonight, near City Hall. They are unhappy with Donald Trump's election. Many of these protesters are local college students, others say they are supporters of former democratic presidential candidate Bernie Sanders. @webpagelink"},{"comment_id":"10153618615406320","commenter_b":"I think this moms do it on purpose.","commenter_a":"Please don't give this woman her kid back. They should take both. Her son will be next. Smdh","post_message":"SHOCKING: Child found 'Sweating profusely' Police in New Jersey had to rescue an child from a car seat in hot van while her mom went shopping. Details: @webpagelink"}]
