[{"comment_id":"775477502501275","commenter_b":"I agree with Mark Colwell.one muslim won't go against the other.they are all for crap..","commenter_a":"Gee, really, and what would they do if he made them angry? Another Dem moron speaks in defense of her Beloved Leader and what she says is as stupid as they both are. How do these people get through even elementary school being this dumb?","post_message":"And this is what Democrats think about terrorists... #facepalm"},{"comment_id":"10155076076173987","commenter_b":"You do realize refugees are the ones fleeing the terrorists right?","commenter_a":"Well, Starbucks, you give 10,000 refugees easy access to kill 10,000 veterans. Yeah, great plan.","post_message":"“To those who would suggest Starbucks is not committed to hiring veterans, we are here to say: check your facts,' the Starbucks Armed Forces Network wrote in a letter to customers."},{"comment_id":"1766066213681675","commenter_b":"'@username trophy wife No. 3 was a soft porn model who also lies like through her teeth. No wonder she squints so much, trying to find her sugar daddy's pee pee!","commenter_a":"'Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s.' --Melania Trump","post_message":"'Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s,'  Charles Harder, a lawyer representing Trump, said in a statement."},{"comment_id":"1619982001628404","commenter_b":"HILLARY WILL BRING MORE OF THESE TERRORISTS INTO THE UNITED STATES !!!!! SHE MUST BE STOPPED !!","commenter_a":"Who would predict that...lol...: @webpagelink","post_message":"Hillary Clinton's weakness while she was Secretary of State, has emboldened terrorists all over the world to attack the U.S., even on our own soil. They are hoping and praying that Hillary Clinton becomes President - so that they can continue their savagery and murder."},{"comment_id":"937962582913649","commenter_b":"I think Not... Voting is suppose to be a privilege, illegals don't have that privilege, they are illegal!!!","commenter_a":"I say if they vote, then they should work and pay taxes","post_message":"More than half the voters who identified themselves as Democrats in a recent Rasmussen poll said they believe illegals should be allowed to vote. Among all voters, more than one in three believes illegals should be allowed to vote. What do you think? @webpagelink"},{"comment_id":"10154449321726729","commenter_b":"Fuck u bitch.. I'm an Obama supporter and wouldn't say no shit.like.that.. FUCK U!","commenter_a":"You know what's amazing about Trump's supporters? They are so cult-like that if Donald Trump raped a little girl, his supporters would insist that's okay. They would say that she was probably asking for it. No true conservative supports Trump.","post_message":"BREAKING: The decision desk has now called the winner of Kansas..."},{"comment_id":"1838073153099439","commenter_b":"Well, she's certainly dum enough for the part!","commenter_a":"But she looks like Hulk Hogan","post_message":"Amy Schumer has been cast to play a blonde doll with impossibly perfect physical proportions...."}]
