[{"comment_id":"10152546378774071","commenter_b":"Same thing as Pie-o-logy?","commenter_a":"This has been around for years...finally blowing up I guess. Thank you Cosmo Kramer lol","post_message":"Pizza Studio hopes to expand to 100 locations by the end of 2015."},{"comment_id":"1057781130958942","commenter_b":"Hmmm... say the Lil bitch talking shit on Facebook","commenter_a":"Wtf that nigga a pussy how you going to slap another man and walk away straight pussy.... I would of shot that nigga since he want to duel","post_message":"The disrespect!"},{"comment_id":"10155409638445725","commenter_b":"I hope she goes to hell","commenter_a":"Crazy selfish bitch","post_message":"Attorneys for the woman accused of faking cancer and pocketing thousands of dollars in donations from strangers, family and friends for more than a year, spoke alongside the woman today. What they said about the incident and the woman----> @webpagelink"},{"comment_id":"2180920135465808","commenter_b":"@username Where did you get that nonsense? She doesn't get a pension.","commenter_a":"Imagine if Michelle did this. They would say she doesn't love her country and she's disrespecting the The White House (as if that were a thing). Repugs are the biggest hypocrites ever","post_message":""},{"comment_id":"10155060869437439","commenter_b":"(HOW DID A MUSLIM GET IN THE POLICE FORCE ANYWAY WE ARE AMERICANS????????????","commenter_a":"a phony bitch sitting next to an absolute idiot.....","post_message":"Police officers are being targeted for murder. Black Lives Matter has put a bounty on their heads. NYC Mayor Bill de Blasio has not supported the police. But Mayor Bill de Blasio calls an urgent press conference on \"anti-Muslim\" crime after a Muslim police officer claims to have been offended."},{"comment_id":"1054028271282063","commenter_b":"You know thats an opinion. My grandfather fought some battles i could never even imagine in my worst nightmares. He earned his title and passed it down and if to a woman so be it. I stick with this country has the best military not because of our abilities but the devotion of our troops make it so. If a woman earns a ranger tab she did it because she truly wanted it. She pushed herself beyond her limits and succeeded. So no matter what others think because its only their opinion i am proud of these women and i ambproud of our troops. Sure they may be women but look how many millions of americans wouldnt dream of going to war yet these women are willing to risk it","commenter_a":"You know Russia in world war 2 fought with women on the front and never had an issue. Israel has women in their military and has never had an issue. Heck they have yet to be defeated. My question is why not allow women the opportunity to serve as well? Set a standard and if a man or a woman either one have the skill and determination to achieve it then that is what we need in our military. It reminds me of a story in Vietnam I heard once (Of course before my time) there was an older black man and an older white man I spoke with once. They were best friends and would do anything for each other. They told me that each was in the 1960s very prejudice. The black was raised to hate whites and the white raised to hate blacks. They went to Vietnam ...","post_message":""},{"comment_id":"10154079684393812","commenter_b":"A bitter old lady move on. About as important as blm.... Next","commenter_a":"And I care what the stepsister of Ann Frank thinks????","post_message":"Anne Frank's stepsister: \"If Donald J. Trump became the next president of the U.S. it would be a complete disaster...I think [Trump] is acting like another Hitler by inciting racism.\""}]
