[{"comment_id":"976666089019811","commenter_b":"You're all correct....but the easiest clue is the shadows on the stairs. Show the cat is clearly going down.","commenter_a":"down, the trim and the lip on the edge of the stair confirms that.","post_message":"No dress or Llamas in this morning's big Internet debate ..."},{"comment_id":"10155472847782178","commenter_b":"This about sums up his platform. To bad his plans don't include everyone. Especially when it comes to healthcare. Did you know that if Obama care is rebuild and replaced if you have a pre-existing condition then you cannot get medical coverage just like before during the Bush administration","commenter_a":"Truth! Dirty Donnie is playing us like a fiddle! All about him so he can make $$$$! He is not FOR anything but himself! Do you really think he is for you blue collar workers or the struggling middle class? Once he gets what he wants, he'll throw you to the gutter like a piece of trash. He is all about the $$ going into his pocket. His \"plan\" would put the workers back into the industrial age. Company town and company store, no unions, no rights, keep your mouth shut and just maybe you won't get fired, thrown out of your home, and dumped on the street! Tax cuts for the rich and everyone else can pay for it. Build a personal defense for to consolidate his power, throw opponents in jail, purge the government of the opposition,and align himself with his buddy Putin! Run away from NATO allies ...","post_message":"Donald Trump's priority today is clear: His personal brand and business."},{"comment_id":"953749507999241","commenter_b":"I don't care if someone is breast feeding, but I cannot stand when attention seeking bitches claim they want equal \"rights\" but actually want to go around showing off their shitty bodies, crying for attention. Don't even try to tell me men and women's chests are the same, our chests have evolved for thousands of years to feed a child, men's have not. Just like men generally have a lot more muscle mass, they have evolved to meet the needs of his family while the mom nurtures and takes care of the babies. You are NOT feminists, you are an embarrassment to the female society. I want to fight for the rights of women who can't leave the house without a male, and are brutally forced into genital mutilation. The ones who are so \"oppressed\" because it's not socially acceptable to be naked in public make my blood boil. Like ...","commenter_a":"sorry, I don't want to see it either and I have 3 children myself. it's wonderful, its necessary and its private.","post_message":"Talk about a great response from the mom. (via TakePart.com)"},{"comment_id":"10153114597787507","commenter_b":"I thought women were the snakes","commenter_a":"An old lady told me about 30 years ago: Some men would screw a snake if someone would hold the head. So there you go!","post_message":"Go get em!"},{"comment_id":"1409042789109576","commenter_b":"@username no they didn't. Both were smart enough to use classified systems to access classified information...","commenter_a":"The problem is that his supporters are not intelligent enough to care about any of this. The one true thing he has said is that he could commit a murder in Times Square and his supporters will still support him. That's why he panders to the low intellect crowd.","post_message":"ALERT! Yet another corruption scandal threatens the whole Trump family."},{"comment_id":"10153158036376756","commenter_b":"Haha or they're super annoying beats made on a computer by another artist.. Then they take that same beat again change a few things and bam another two chains song!","commenter_a":"Modern day hip hop is way worse! All the beats are the same n the lyrics are garbage!","post_message":"Maybe you've noticed that many hit country songs sound the same. Now you have proof."},{"comment_id":"868204976635103","commenter_b":"wow u got gender-feminists handing out federally funded dildos and rubbers to 6th graders...and you say \"porn' is the public health hazard?? lol","commenter_a":"Hey hey, this is a serious problem now, let's stop everything and focus on this!","post_message":"What do you think of this development?"}]
