[{"comment_id":"10153130457761162","commenter_b":"P.s pimps should be illegal, prostitutes should regulate their own self on how.much they make an what not","commenter_a":"Would it have been better if he had raped someone?","post_message":"NEW: NFL Hall of Fame lineman Warren Sapp arrested for allegedly hiring a prostitute after covering the Super Bowl for the NFL Network: @webpagelink"},{"comment_id":"1005063259586728","commenter_b":"I don't mean In Syria. Whatever safe country they might be in. Buy them something Since ur gov has voted against letting refugees in the USA.","commenter_a":"Or buy them a home where they are.","post_message":"Kudos to Moore for taking a stand in the name of American compassion."},{"comment_id":"10154333235104726","commenter_b":"So all the gun owners need to boycott Hawaii. See how they do when there money source dries up.","commenter_a":"It's begining","post_message":"Hawaii became the first U.S. state to sign into law a bill requiring all residents who register as gun owners to be placed in a federal criminal records database that monitors them for any crimes committed."},{"comment_id":"10153064490042483","commenter_b":"Funny @username nowhere in your meme is there a picture of the woman you would force to become an incubator.","commenter_a":"Conservatives aren't pro life, they are just pro birth. They defund welfare and unemployment programs, don't support universal heathcare, want to deport \"anchor babies\" and so on. They need to stop pretending they care so much for unborn lives","post_message":"\"The federal government and several courts have made clear that a state cannot kick Planned Parenthood out of its Medicaid program simply because Planned Parenthood provides abortion,\" said Susan Watson, executive director of the ACLU of Alabama."},{"comment_id":"1949140865300152","commenter_b":"Yo baby daddy work at the post office now? 😩😂 Imani Ave","commenter_a":"MsJackson Ifyounasty i think I would have sprayed them too would you??","post_message":"A postal worker caught on camera appearing to pepper spray three dogs. What happened to the dogs and how did USPS respond? ABC13-Jessica Willey has the details: @webpagelink"},{"comment_id":"10154456212209060","commenter_b":"Have yall seen an uncircumcised vagina? Yikes","commenter_a":",,,,yea but have yall seen an uncircumcised penis???? Yikes","post_message":"If men can become astrophysicists or master carpenters, surely they can learn to wash? Campaigners are fighting the perception that the benefits of circumcision outweigh the risks"},{"comment_id":"10153422363668984","commenter_b":"It was a fake statement, you irrelevant moron of an actress.","commenter_a":"So you find an actress that is stupid. Duh","post_message":"One word -- wow. ADVISORY: This article contains unedited profanity and obscenity that may be offensive to some readers. Do you think Senator Ted Cruz deserves an apology from this actress?"}]
