[{"comment_id":"10155599554315354","commenter_b":"Why are we still seeing this crazy whore.","commenter_a":"Sure she's an idiot...but can't she practice the religion of her choice wihout scrutiny?","post_message":"Raised Catholic....dabbled in Kabbalah...and now this... ...Check it out."},{"comment_id":"1787494751536145","commenter_b":"Such a whiner just give me a bottle of wine so I can shut the hell up","commenter_a":"Compared to what we have had the last eight years if Nixon was running I'd vote for him","post_message":"Clinton's running mate says Trump is even worse than President Nixon because he won't release his tax returns. Is he right?"},{"comment_id":"10152947380749099","commenter_b":"Yes, because women never get pregnant on birth control....","commenter_a":"If women would practice birth control then these horrible things wouldn't happen. Bless their little souls. May God have them in his embrace.","post_message":"A man found two dead fetuses wrapped in a blanket on the street @webpagelink"},{"comment_id":"10153215250940329","commenter_b":"You clearly don't live in the country.","commenter_a":"\" Why are your large pizzas the size of our personal pizzas?\" because we aren't a country full of fat fucks.","post_message":"Dear BuzzFeed Oz."},{"comment_id":"1116491755058348","commenter_b":"This is great! Pam Sept Hill, Janet Blessinger Gleason, Kandace Herring and Colleen Lafferty Wilson did you see?","commenter_a":"Terri Andrews Joanna Tugwell. We so need to print this X","post_message":"More of this, please!"},{"comment_id":"10153910482357464","commenter_b":"We don't need another illegal immigrant running our country!! Vote for Trump","commenter_a":"We don't need another Obama in office be smart!! Vote for Trump","post_message":"Spoke with Hugh Hewitt yesterday on the eve of the Nevada caucuses. You can hear the discussion here: @webpagelink"},{"comment_id":"860890883954153","commenter_b":"Goons On Parade!","commenter_a":"You weren't put there to be \"kinder, gentler\" When are you folks going to get the message!","post_message":"New Senate Majority Leader Mitch McConnell (R-Ky.) is indicating he’ll attempt to steer his party in a benign direction as his leadership style helps shape public perceptions of the GOP — and its presidential nominee’s chances — heading into the 2016 election cycle. @webpagelink"}]
