[{"comment_id":"10153924016401130","commenter_b":"Oh grow up all of you. Why should she need to put a cover over her breasts. You put a cover over your mind and give thanks that mothers can feed portably whilst not being excluded. I'm sure you can train your mind to manage to view a pair of breasts as a feeding devise and look at how your own mind processes this function. Women relinquish enough do to our biology - can't we at least feed and belong at the same time?","commenter_a":"She should have stayed home. Not her day.","post_message":"Now THIS is a cool mom. 😎"},{"comment_id":"10153077946636037","commenter_b":"How about you stop being a stripper?","commenter_a":"Good for them. That's their job and everyone deserves fare treatment. Whether their dancing on a poll or serving meals at a local diner. This is America.","post_message":"Tired of watching well-meaning strangers impose their own visions for improving the plight of the exotic dancer, some of Portland's seasoned #strippers are working directly with state lawmakers and professional lobbyists."},{"comment_id":"1104255989636871","commenter_b":"#westoppedtrump #fucktrump","commenter_a":"You saved countless lives last night on the streets of Chicago, they stopped the gang banging for a few hours to come together in your honor...you've already made America great again.","post_message":"Good morning! Departing for Dayton, Ohio now! WE ARE GOING TO MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153134555889753","commenter_b":"They should lock her down before she kills some one.","commenter_a":"Yes! This was a full on assault! When there is a minor present it is a felony. She should be tried to the fullest extent of the law!","post_message":"Do you think this teen should be tried as an adult?"},{"comment_id":"1148538801848206","commenter_b":"Get well soon.","commenter_a":"That was an amazing thing he did. He is too be commended. Oorah","post_message":"BREAKING NEWS"},{"comment_id":"1006897696063097","commenter_b":"Praying for a awesome woman of God and Crouch family.....such seeds she has sown...","commenter_a":"Pamela Houston","post_message":"The TBN family continues to ask for prayers and promises to keep us updated on Jan's condition. #JanCrouch #TBN #stroke"},{"comment_id":"10156351239605093","commenter_b":"I just wish humans leave wild life alone.","commenter_a":"Signed ✔️","post_message":"Hanako lives alone in a barren, concrete enclosure without grass, trees, or a pool. Elephants are well-known for having complex social bonds, but it's unclear when Hanako has last seen another elephant."}]
