[{"comment_id":"1738783449718030","commenter_b":"Lmfaoooo she's just so fed up","commenter_a":"The teacher at 52 seconds hung her head low like \"these mfs here \" Ty1253184741396567","post_message":"Move over, #MannequinChallenge. The #TrumpsComingChallenge is sending students fleeing @webpagelink"},{"comment_id":"1859800897573502","commenter_b":"His daughters are no exception .","commenter_a":"50/50 sounds fair","post_message":"Would he let his daughters be drafted?"},{"comment_id":"1029861463715941","commenter_b":"You are wrong about Cruz but, everybody has their own thoughts but if you want a change then start listening to Senator Ted Cruz.","commenter_a":"Who?? Never heard of this guy! Looks like he never heard of a shower? Regardless, I will not vote for Rafael \"Ted\" Cruz, who has only been in this country since 1974!!","post_message":"OFFICIAL ENDORSEMENT... This changes everything!"},{"comment_id":"945724052142706","commenter_b":"Why would anyone vote for Hillary though? She's worse","commenter_a":"How could any Americans ever vote for a bigoted, vulgar, narcissistic billionaire who lies about almost everything and has advanced no policies or arguments other than strong and smart enough to do it. This is what happens when you get voters whose worldview consists of \"The Apprentice\", \"Keeping Up With the Kardashians\" along with \"Fox and Friends\". The masses of stupid going to the polls, very scary indeed.","post_message":"Donald Trump is on the verge of winning the Republican National Committee nomination, as the party plummets into a civil war that could destroy it entirely."},{"comment_id":"1061695460512781","commenter_b":"Forget about the suicidal Muslims getting atomic bombs, let's get those guns WTF","commenter_a":"\"Sniper ammo\" is next...wait for it....","post_message":"We didn't say anything about gun control, but it is gun control. Everybody knows they want gun control, and if they can't get your gun, what better secondary way than to get you bullets? Anybody with a brain knows what's going on here."},{"comment_id":"1183772531660175","commenter_b":"However, he will be a much better President for the nation then fumbling Obama. Rather have competent than classy.","commenter_a":"I agree","post_message":"AMEN."},{"comment_id":"10154030392435329","commenter_b":"Hahahaha this is so us","commenter_a":"This is like 95% us! @username","post_message":"♫ People, let me tell you about my best friend. ♫"}]
