[{"comment_id":"861020107291072","commenter_b":"So many F$&k wits out there. How can they be so cruel?","commenter_a":"What a atrocious father!","post_message":"Girl thrown off bridge by man believed to be her father."},{"comment_id":"10153461345971130","commenter_b":"Arrogant bitch. Who does she think she is? Shut up and go back to whatever latin dump you crawled out of.","commenter_a":"Coreena Christensen could agree any more!!! perfectly said","post_message":""},{"comment_id":"10153003088197377","commenter_b":"It will be a huge shake up.","commenter_a":"Now they talking I guess they are coming out of there dream closets, they better rally around him and make this country great again.#Trump/Cruz.","post_message":"Newt Gingrich says Donald Trump is capable of winning not only the Republican presidential nomination."},{"comment_id":"1226169560742155","commenter_b":"In other words what you want is to shut her up like Christians have been doing for too long in order of political correctness. And accept this mockery of a gay marriage. All religions in the world are against gay marriage. Its unholy, unatural and discusting and a general majority agree with that. Look at how muslims treat them lol. You wanna be a fruitcake? Fine, but stop throwing your discusting life in normal ppl's faces with ur ridiculous parade of freaks and now want to step into normal familly life of husband and wife. Its not for you. Adam and Eve. Man and Woman. NOT adam and steve! Marriage is between a MAN and a WOMAN. Amen to the sister with enough conviction to stand her ground. This is just the beginning. Her stand has awakened MANY. Its about to get nasty for a few :)","commenter_a":"Kentucky Christians should march for her. Don't remain silent, be there for the sister. Amen","post_message":""},{"comment_id":"10154684364106130","commenter_b":"Jerry's beautiful wife. Who looks like that","commenter_a":"Gayle Gergich, you rock Pawnee!","post_message":"Slay, Christie Brinkley!"},{"comment_id":"1011665845530135","commenter_b":"Cassandra is a fox!","commenter_a":"She is beautiful, and yes, I think it's a step in the right direction, but she is NOT plus sized! I am a plus sized woman.","post_message":"PLUS-SIZED MODEL: Model Robyn Lawley just became the first plus-sized model to snag a page in Sports Illustrated's swimsuit edition. Do you think it's a step in the right direction for the modeling industry? Or is it sending the wrong message?"},{"comment_id":"10152612107376636","commenter_b":"Women have to cover their hair in 2015 Ffs as if hair tempts men into sinning, give me a break.","commenter_a":"Not true! I am a Muslim woman and NEVER been pushed away from any mosque; whether it be in my home country Egypt or in Tunisia where I currently live with my husban. I am totally sick of the Independent and of all the bogus they keep spreading on Islam","post_message":"This is a problem that has been going on for decades, and little has been done to change it"}]
