[{"comment_id":"10153619308152235","commenter_b":"@username a racist comment about baking!?? Okay, surely you jest. You don't know what you're talking about so you're automatically excluded. @username I agree it could be seen as sexist except I am a female and bake all the time, but MORE IMPORTANTLY Men are known to be the best chefs😉. @username she didn't make any valid point when she stated \"nothing new, threats made against students daily\" She's out of touch with the article and with reality if she is trying to compare unspecified kids being threatened to a RACIST threatening to kill only BLACK KIDS posing with ak47 on the school grounds!! ARE YOU FREAKING KIDDING ME!??? The generalization she attached to this comment is uncanny, disturbing, and I'm sorry RACIST in an of itself. Because the DENIAL of racism IS racism also.","commenter_a":"This is nothing new. Threats are made against students daily! We went through this last year and most kids were kept at home until the instagram poster was identified.","post_message":"Another effing beautiful day in post-racial America."},{"comment_id":"1527023290939672","commenter_b":"@username Jesus Christ, woman....","commenter_a":"well, Oprah, I didnt hear you claiming racist when all us white people were watching your shows and buying your magazine, and saying how great we thought you were,now u got a big bundle of money and suddenly we are racist.....well, thanks a lot for the truth of how you really feel, we will be sure not to bother you with watching your shows or buying your magazine or singing your praises anymore....what an idiot","post_message":"Oprah Claims White People Are The Cause Of Racism In America. She's lost it. What a hypocrite. Do you think Oprah is the racist?"},{"comment_id":"10156070915820354","commenter_b":"We all know what Jorge Ramos is full of !!","commenter_a":"No, sir you are a loud mouth rude, obnoxious piece of shit!","post_message":"Reporter?   Or Activist?"},{"comment_id":"10153288794126336","commenter_b":"we do love blonde women with breast enhancements and tight dresses , you nasty girl","commenter_a":"on fox news war on women","post_message":"Memorial Day originally honored soldiers from which American war?  How well do you know your #MemorialDay history? Take this quiz with FOX & Friends Weekend! #ProudAmerican"},{"comment_id":"10153447709650667","commenter_b":"If this would ever happen to my mom. I would make room so she can live with me.","commenter_a":"Good just because your old , you still have to follow the rules . If they make exemptions based on age that would be discrimination .","post_message":"“I have four grandsons, but I don’t want to be dependent on them. I can’t be a burden to my family. They don’t have room for me. That happens in life.”"},{"comment_id":"649975575168534","commenter_b":"God Bless Heal Comfort Renew & Keep that poor innocent child...as 4 Them(Mr Swollen & Miss Crazy Lookin) ..Vengeance is Mine said the Lord!!!","commenter_a":"😡😡😡😡","post_message":"True tragedy. A 4-year-old was found beaten and zip tied to her bed. Not only that, she didn't know her own name and told police she thought it was 'Idiot'."},{"comment_id":"10154216491251943","commenter_b":"WAKE UP AMERICANS .. This May be the Last Chance American and the American people (voters) have to retain and Guarantee, our American Heritages, Customs and Constitutional Rights .. We need to rid American of the Radical Muslims and Illegals who are here and trying to take over America .. Do You want a Clinton Corrupted Government Controlled Life or a Trump Love America Lifestyle for your Children's Children .. SERIOUSLY - that is the Choice Were making and There going to be Living with .. This is more for our Children and there Children than for US but only WE can Guarantee them a life and Future that we had .. Clinton will be a Disaster for America and all Americans .. Surely you can realize that - listen to the news , ,LISTEN .. WE THE PEOPLE - need to Bring back GOD, COUNTRY AND CONSTITUTIONAL FREEDOMS to ...","commenter_a":"Burn the witch!!!","post_message":"Hillary Clinton must be held responsible for using \"private\" email accounts and a hidden email server as Secretary of State to conduct government business in violation of the law!  Judicial Watch is the one organization with a proven 20-year track record of investigating, exposing, and prosecuting Hillary Rodham Clinton and company. Please SHARE!"}]
