[{"comment_id":"1865774367000002","commenter_b":"If you think that way then you should leave as well. This Country actually belongs to the Native Americans.","commenter_a":"I am a lifetime member of the Sons of the American Revolution. My ancestors landed in 1732 and father and son fought in the revolution. All of you republicans whose family landed AFTER that revolution are not \"pure Americans\" and must get MY permission to remain. Ban half breed Americans..only the descendants of REAL patriots may remain","post_message":"\"We're not going to shut up. We're going to resist.\""},{"comment_id":"10154819113006336","commenter_b":"She'll pay one way or another! I would like to see her drug through a trial, but if it's going to take away from necessary changes to bring America back to its roots, then let Hillary continue to slowly sink her own ship! It being brought to light solely to cost her the election was good enough for me.","commenter_a":"Truth be told she has been tried and found guilty November 8 she was sentenced RIP girlfriend","post_message":"In a meeting with The New York Times, President-elect Donald J. Trump said he would not take the investigations of the Clintons off the table."},{"comment_id":"10152594286750779","commenter_b":"I hope she never gets a boob job","commenter_a":"Did she trademark small breasts as well?","post_message":"If you want to \"Party Like It's 1989\" to \"This Sick Beat,\" you better ask Taylor Swift's permission first. The pop star has trademarked those phrases – along with \"'Cause We Never Go Out of Style,\" \"Could Show You Incredible Things\" and \"Nice to Meet You, Where You Been?\" – with the U.S. government."},{"comment_id":"1362884163768725","commenter_b":"A grown ass man, with a meme of a \"butthurt report\" ,shows the intelligents of trump supporters. Trump supporters and memes go hand and hand.","commenter_a":"I did not see any bitching when Obama was elected, all you cultural marxists can fill up your \"safe\" spaces and fill out butthurt reports, not that anyone cares for you snowflakes","post_message":"Whether you support trump, hate him, or don't care either way — you need to see this:"},{"comment_id":"10156718983275206","commenter_b":"@username's campaign is not particularly offensive to women neither is her platform desirable for America. Gender is a prominent component of her campaign. There is nothing even suggesting leadership ability; but everything suggesting bias and intractable partisanship.","commenter_a":"love your definition of feminism Carly, so true","post_message":"I know I’m not the liberal Left’s fantasy candidate. But a feminist is a woman who lives the life she chooses for herself—not the life that The View, or Hillary Clinton, or Planned Parenthood orders her to live. I told that to the women of The View last time I was there. It remains true today."},{"comment_id":"1043808669085644","commenter_b":"Thankfully she kept her mouth shut and performed and the liberals are pissed? She's a liberal! It amazes me how they are quick to crucify her for making the decision to simply perform, keep some class during the halftime show unlike that ghetto trash bitch Beyonce","commenter_a":"The Hamilton cast members rocked just as hard as Gaga, and I loved their amendment.","post_message":"This is just sad..."},{"comment_id":"1787974808090517","commenter_b":"When a woman as dumb as a rock has been a Senator, Secy of State, and candidate for president of the USA, my God , makes one wonder how many ignorant people have voted for her.","commenter_a":"awwwww wasn't trained???? They keep saying she's so \"intelligent\" and the most \"Qualified\". Everything about her is BS! The absolute worst Democratic candidate EVER!","post_message":"A senior Department of State official claimed there is no documentation showing former Secretary of State Hillary Clinton ever received training in the proper handling of classified materials, according to a June 30 Department of Justice filing in U.S. District Court."}]
