[{"comment_id":"10152617466356680","commenter_b":"For those who want to deport, are the GOP taxpayers going to pick up the $50 billion tab? Dems won't because anyone with a brain knows the addition of these people into legal residency will boost our economy.","commenter_a":"Obama, siding with illegals against Americans, yes, Obama DOES NOT LOVE OUR COUNTRY.","post_message":"President Barack Obama is calling out John Boehner for not bringing comprehensive immigration reform up for a vote in the House last year."},{"comment_id":"991971067506900","commenter_b":"Islam IS the Problem !!","commenter_a":"That would stop all protests if you take a couple of the looters out!!","post_message":"\"After handing over his ID card, the terrorist stabbed one of the officers in the neck and another one in the upper body.\""},{"comment_id":"1168375003221975","commenter_b":"This smacks of Naziism!! He is trying to intimidate the minority vote. He is so disgusting and despicable . We must come out in force to stand up to this type of scare tactics!!!!","commenter_a":"Well in my State, of Washington, like many other States, voting is done by mail or can be dropped off at drop boxes for elections only. So will his people be harassing the Postal employees? And for any States that still go to the polls, those State governments better damn well make sure that ALL citizens can get to their polling places unmolested. And if that means with police protection, so be it. Then, charge the GOP for all of the overtime for said protections that will need to be paid.","post_message":"Unable to win, Trump now looks to blocking Hillary voters with an army of deranged volunteers."},{"comment_id":"10153653685189099","commenter_b":"Go burn your bra somewhere else please","commenter_a":"If she got things done Monica wouldn't have had to step in.","post_message":"Asked whether she's progressive or moderate, Hillary Clinton described herself as a \"progressive\" with \"a long history of getting things done\" @webpagelink #DemDebate"},{"comment_id":"510871105704596","commenter_b":"great man spreading peace, love, and equality.","commenter_a":"Evil wolf in sheeps clothing","post_message":"What are your thoughts on Pope Francis?"},{"comment_id":"10154193452504087","commenter_b":"2 choices: 1. Hillary(blue pill) 2. Trump(red pill)","commenter_a":"Donald Trump killed his own chances to win the presidency. He should shut his mouth. Keep his zipper closed. Closed his Twitter account. Prepare for the debates. Finally, listen to the advice of your children and staff.","post_message":"Trump interrupted Clinton during the debate to call her a \"nasty woman\" as she was reiterating her commitment to raise taxes on the wealthy."},{"comment_id":"481924841998096","commenter_b":"No Islam. This is The USA, not the Middle-East.","commenter_a":"Yes i support him completely get that islam shit out of our schools and our country","post_message":"A veteran was banned from his daughter's school... for speaking out against Islam? This is absurd. We support this veteran 100%. Do you support his stand against Islam?"}]
