[{"comment_id":"10152890902061336","commenter_b":"Immigrants must obey the law...review history.","commenter_a":"What's wrong conservatives are these immigrants too brown for you?","post_message":"Mexico is now issuing birth certificates at its U.S. consulates so illegal immigrants can avoid deportation."},{"comment_id":"10158563017270354","commenter_b":"She is too good for you a hole","commenter_a":"All of you hypocrites who are protesting and rioting over Trumps's decision that was very similar to Obama's that you didn't even bat an eye for, is the reason Trump will be here for 8 years.","post_message":"Grammy Award-winning rapper Eminem called President Donald Trump a \"bitch\" and fantasied about sexually assaulting conservative author Ann Coulter in a new song."},{"comment_id":"10153694817752293","commenter_b":"All they have to do is ask and I'd let a nurse snap all the dick pics she wanted.","commenter_a":"And her name is Johnson ....","post_message":"Police discovered a photo and video on the nurse’s laptop."},{"comment_id":"1009004349187234","commenter_b":"first she needs to be a lady","commenter_a":"Watch out she will pick your pocket ...","post_message":"Michelle Obama Invites Muslim Refugee To Sit With Her At State Of The Union  She should invite a soldier who fought for our country. This is ridiculous.  Do you think Michelle Obama is the worst first lady ever?"},{"comment_id":"1141182859235076","commenter_b":"I only like woman","commenter_a":"Anyone on this thread that defends the confederate flag or the klan, please kill yourself and do not procreate.","post_message":"\"The Klan today is weak, poorly led, divided internally and without any political support\""},{"comment_id":"10153628238979071","commenter_b":"Oh yes omg yall are so smart im so duum whyd i ever doubt yeuuu.. illiterate tards","commenter_a":"Why do people believe that ice melting in a closed ecosystem will cause the water to rise? I do live in one of these areas. I'll move when my toes get wet. Pretty sure FL has been becoming swampland for a super long time.","post_message":"Not good."},{"comment_id":"10153235359857093","commenter_b":"Same procedure as a mandatory hurricane evac. Some people just have to cause issues tho","commenter_a":"Are they going to arrest people who do? It's interesting that the homeowners aren't allowed to determine if their own home is safe.","post_message":"The Garland Police Department is asking those people who are able to remain safely sheltered in their homes to do so.  Residents who leave the damaged area will not be allowed to return until it is deemed safe.  Officials are working to identify and secure any possible utility hazards such as gas leaks and downed power lines."}]
