[{"comment_id":"10153797502305779","commenter_b":"I wonder how people react to a naked hillary statue where you get to see that bitch in all her glory. Lol. Bet people would respond differently","commenter_a":"Gross!!!! The looks are uncanny!!!!!","post_message":"New naked Donald J. Trump statues appeared today, and now they're legal, backed by a mega-developer of their own."},{"comment_id":"1113814495365780","commenter_b":"@username Illegal immigrants cost taxpayers money and jobs as well as their lives.","commenter_a":"American taxpayers are spending over $130 Billion a year on welfare programs for illegal immigrants and that doesn't include prison for the felons.","post_message":"American taxpayers have already spent billions of dollars on border security, including a 700-mile long physical barrier along the southern border."},{"comment_id":"10153512557096130","commenter_b":"LOL!!! NO SEX. WOMAN LISTEN TO MAN. YOU MADE OF RIB. SHUT UP. NO WORDS. BE SLAVE. yay the bible...-.-","commenter_a":"Well, I suppose human nature, being what it is, things won't change much for the better. However, if people would follow some of the teachings of the Holy Bible, regardless of their personal religious beliefs, the need for Planned Parenthood would pretty much go away.","post_message":"Enough is enough."},{"comment_id":"10156556593115725","commenter_b":"she looks hot","commenter_a":"Nando Martinez - SHE IS A DOCTOR - @username","post_message":"A doctor has been placed on administrative leave after a controversial video showing her violent scuffle with an Uber driver went viral -----> @webpagelink"},{"comment_id":"1136331029759977","commenter_b":"Stupid Brazillian woman. I hope she was arrested.","commenter_a":"Karen Ramsden","post_message":"Don’t mess with my man!"},{"comment_id":"1803705829897591","commenter_b":"@username and she wasn't wrong. They are deplorable.","commenter_a":"I am a Hillary supporter but instead of casting blame she should've been a better candidate. She should've visited more cities and counties and not just the ones that she thought would've secured her the election. She shouldn't have insulted the American people and expect that they were going to magically convert to her side by debating Trump. Yes, the FBI director and the emails definitely contributed towards her loss but maybe if she didn't have major corporations and banks and foreign countries on her payroll she would've won. Edit: To everybody saying that I'm not a real Hillary supporter or that I'm a troll/not a real person. I voted for Hillary so if that doesn't show my support then I don't know what will. Because just like you can love/support your children/parents but not agree with some of their beliefs or with some of the things they do, you ...","post_message":"Breaking News: Hillary Clinton cast blame for her loss on a decision by James Comey, the FBI chief, to revive an email inquiry ahead of the election."},{"comment_id":"10153320820056051","commenter_b":"Think it's a good idea, then neighbors can tattle on those. We must find some way to catch the thieves. And I agree with Marilyn , also. And there are many, many whites on welfare that shouldn't be,also.","commenter_a":"I like to see what I am buying and if ny money is well spent or wasted.","post_message":"This mayor is going to make the names and addresses of all welfare recipients public."}]
