[{"comment_id":"924673837566701","commenter_b":"I meant divided we fall","commenter_a":"At least learn how to spell 'Missile' Then you can be an educated bigot!","post_message":"I have joined with a bipartisan group of 16 senators to introduce legislation that would impose economic pressure on Iran if international negotiations do not yield a final nuclear deal by June 30, 2015. This is the most important foreign policy issue facing our country. A nuclear Iran will threaten the security and safety of the United States and send a message of weakness to our allies and partners in the Middle East. This legislation is an important signal to Iran and the entire international community that the current negotiations are not endless and the Iranians cannot continue their dangerous nuclear activities."},{"comment_id":"10155973415020354","commenter_b":"Shame on you Fox. Personal feelings are so beyond this forum. You putzes might as well learn how to say, \"large sized or regular?\"","commenter_a":"I'm for Ted all the way, but if Fox wanted to hurt trump it was a mistake,","post_message":"Trumpnado!"},{"comment_id":"1136752646369001","commenter_b":"No the world is laughing at America","commenter_a":"The most pathetic, delusional president in history by far. Terror, hatred, murder and division all over the world like none in recent history and he says something so outrageous? Embarrassing and the world is laughing at this fool.","post_message":"Obama thinks we're living in the most peaceful time in history."},{"comment_id":"10153572022092293","commenter_b":"We should see this McKenzie","commenter_a":"@username ayoooo","post_message":"The Witch is a must-see for any horror fan -- just be ready to be creeped out."},{"comment_id":"10152944650032894","commenter_b":"Bitch suck a dick and eat shit with you shit faced ass @username","commenter_a":"Whet? 😕","post_message":"Caitlyn Jenner is Already in Talks to Become the New Face of MAC Cosmetics"},{"comment_id":"10153034727835667","commenter_b":"Wtf she's ugly and weird","commenter_a":"Linzee Kay @username","post_message":"Miss Piggy will not be pleased."},{"comment_id":"858343807629738","commenter_b":"Yes! Lock her up!!!","commenter_a":"She looks much better BEHIND BARS !!!!!!","post_message":"Trump Nominated - Christie Calls for Prosecution of Hillary: “Lock Her Up” @webpagelink"}]
