[{"comment_id":"910295292400057","commenter_b":"God bless that woman. Sure hope some jerk doesn`t get on her for hitting her kid. He deserved it.","commenter_a":"This is a great mother! I would have done the same thing!","post_message":"A Baltimore mother hailed as #momoftheyear after disciplining her son in the middle of yesterday's riots. That moment was caught on camera: @webpagelink"},{"comment_id":"10153562591278487","commenter_b":"It's disturbing that someone who presents as a cop on Facebook would be one of the few people to say \"this was a good shoot.\" But #notallcops or #bluelivesmatter or some other inaccurate bullshit to keep people hero worshipping, right? Please.","commenter_a":"I hope you all understand that because the prosecutor went for a murder charge, this officer will be found not guilty. One, due to the fact that the prosecution will have to prove that an on duty officer was out there to kill someone, which won't happen. Two, for the fact that a vehicle is a deadly weapon and shooting a suspect using a vehicle in a manner that puts an officers life in danger is standard procedure and is taught in every academy in the U.S. This was a good shoot and the officer will be exonerated. But get ready to torch your local cvs for justice.","post_message":" is without question a murder, the prosecutor said about Sam Dubose's death.  didn do anything violent toward the officer. He wasn dragging him. And [the officer] pulled out his gun and shot him in the head."},{"comment_id":"10152606580602434","commenter_b":"The \"greedy bitch\" is a man.","commenter_a":"Getting married doesn't automatically entitle you to gifts or money, your guests will give what they can, if they can but surely their attendance is more important than receiving things from them? This is the most jacked up article I've read in a long time, far too much misdirected vitriol. Hope this greedy bitch gets nothing! Equating the whole situation of gift/money giving to 'living in sin' is so ridiculous and the amount of times people are directly cursed out is excessive. If you wanted to express your opinion so badly, you should have learned how to write first. Bridezilla!","post_message":"These people often fall in the same group as elitist jerks who think getting a dress from David's Bridal is \"tacky.\""},{"comment_id":"1131244553635264","commenter_b":"#BernieOrBust #BernieAllTheWay #DropOutHillary","commenter_a":"Either way it will be a Democrat all the way to the White House again for another eight years along with a Democratic majority in Congress! Many thanks to the GOP for putting up unelectable candidates election after election,those dumb idiots will never learn","post_message":"Trump must be stopped.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1153087074711321","commenter_b":"we need more sex workers to solve crimes the cops can't","commenter_a":"They should give her an award. She has saved countless lives.","post_message":"Police found what they described as a \"kill kit\" in the trunk of Falls' car — including handcuffs, several long knives, a box cutter, two axes, a machete, a sledgehammer, a bulletproof vest, another gun, shovels, a rubber tub large enough to hold an adult, and bleach and other cleaning supplies."},{"comment_id":"10153877840551337","commenter_b":"I always hated rousey I'm glad her ass got knock the fuck out","commenter_a":"Truth is holly Holm is a real fighter n Dana white thought he picked another easy girl for Ronda to destroy well plan back fired ,Holm is a real fighter and real champion now let's see her n cyborg fight two top fighters Rousey is finished","post_message":"DAMN: Holly Holm didn't hold back with these comments about Ronda Rousey."},{"comment_id":"10156744379040093","commenter_b":"@username Have you SEEN Trump on the debate stage? He doesn't know policy, he doesn't think ahead, and he stumbles when it comes to content. Add to that the media penchant for tailoring questions to compliment the dem candidate, and <bam> Hillary looks like a freaking scholar on the stage. The thought makes me physically ill. On top of that, Trump has considerable damning words and actions the media and dems (but I repeat myself) will toss like confetti upon constituents. In multiple polls, Trump sits in the mid-30s, without waver. This is going to suck.","commenter_a":"Do the right thing and vote for Cruz. I write such because the thought of Trump facing Hillary in debate makes me cringe. Kasich, the newest favorite of the GOP, cannot win. I love my home state, but Ohio doesn't save Kasich from toppling.","post_message":"Not budging."}]
