[{"comment_id":"1221148801300111","commenter_b":"Such a demented mind-set. Let us all pray that the Lord will convict her and turn her from her wicked ways.","commenter_a":"Evil","post_message":"“Christian” Abortion Doc Says: “I Love” Killing Babies in Abortions, “I’m Proud to Do So”"},{"comment_id":"10153395223571336","commenter_b":"Pull up your skirt and grow a pair .","commenter_a":"I'm not Mexican but his comments were offensive. There are many honorable Mexican Americans and his words disrespected all Latin Americans. I happen to be a conservative republican, and in favor of tightening up the border issue. Donald Trump is an emotional and impulsive idiot and we don't need that in the White House. We need someone that will unite us, not separate us.","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10153506761069091","commenter_b":"Imagine if nothing was found like the weapons of mass destruction....mmmmm and you are right @username","commenter_a":"Yes","post_message":"Should Apple be required to help police unlock the San Bernardino gunman's phone? @webpagelink"},{"comment_id":"1035291306577703","commenter_b":"Science does trump random personal stories. (pun intended)","commenter_a":"I live in Savannah Georgia the South Carolina border is 10 mins away from me, 9 out of every 10 people I meet regardless of sex color sexuality or background supports trump, most support him silently they are not going to run around screaming that they support trump they are not participating in polls their voices will be heard at the ballots","post_message":"Hillary Clinton and Donald J. Trump are tied in South Carolina according to new polling. Rachel Maddow breaks down the surprising development.  More analysis on the latest polling from The Rachel Maddow Show: @webpagelink"},{"comment_id":"463096490547598","commenter_b":"Yes","commenter_a":"yes, yes","post_message":"Should This Family Be Taken Off Welfare?  Comment 'yes' or 'no'."},{"comment_id":"958028154307215","commenter_b":"@username bitch!","commenter_a":"Does she realized she joined the military to defend the constitution....if she is that ashamed of America, she should request a dishonorable discharge.","post_message":"A sailor refused to stand for the National Anthem. She might be in big trouble over the protest. Should she be punished?"},{"comment_id":"1772017636373096","commenter_b":"Women have no business being police officers. Would you give her the Nuke Codes? Imagine Hillary Clinton","commenter_a":"Surrounded by 5 fellow officers? Whatever! You murdered a father of 4 on a disabled Vehicle call.","post_message":"The attorney for Tulsa Police Officer Betty Shelby says she believed Terence Crutcher was attempting to reach into his car to retrieve a weapon. In her interview with homicide detectives, she said, \"I was never so scared in my life as in that moment right then.\""}]
