[{"comment_id":"1151519384914815","commenter_b":"Bol bitch deserved it","commenter_a":"Mykel Connors","post_message":"Chick knocks out an old lady on a bus!  #WSHH"},{"comment_id":"10154667232099270","commenter_b":"But lord lord that wall has to go up!","commenter_a":"Axe the F35 and you got your new engines","post_message":"The Air Force wants new engines for its venerable B-52 Stratofortress bomber fleet, but there’s no money in the budget to pay for them."},{"comment_id":"10153049017301323","commenter_b":"Leave her alone, can't we just all be pleased that Andy is through to the final. There were very tense moments in the match!","commenter_a":"Stone her","post_message":"F is for ferociously supportive, amongst other things.  What was Kim Sears saying to Andy Murray's opponent at the Australian Open?"},{"comment_id":"10154410865644091","commenter_b":"He better be ready for BIG POPPA'S in jail bc there gonna rip his A$$ for raping those little angels...Let's see how he likes it now! #ThrowAwayTheKey","commenter_a":"I hope you get yours in jail you pos","post_message":"JUST AWFUL: This Long Island man is accused of raping 2 young girls -- ages 6 and 7."},{"comment_id":"10153639666243138","commenter_b":"You, m'dear, are brilliant. Wish I was a Floridian.","commenter_a":"Since we have Debbie Wasserman Schultz to hold to the fire for unfairly slanting the elections, I thought it might be productive to take her to task and donate to her democratic rival in Florida's 23 district Tim Canova. Knock her right the hell out of her seat in congress. Might wanna throw him 5 bucks and help him send her packing. It matters.You don't have to live in Fla to donate, it affects us all. @webpagelink #TellHimBernieSentYa","post_message":"I'm not saying Donald J. Trump won by appealing to the KKK, but if the hood fits…"},{"comment_id":"10154502608806051","commenter_b":"Shut up","commenter_a":"Chelsea sorry to say don't qualify as woman she is a pig .only flilthy mouth people it would draw to the show . Its isn't either from the species called human the bag she has she took from garbage dump she lives in","post_message":"Chelsea Handler is sparking some serious controversy over what she's holding in her hands outside the White House in this viral picture."},{"comment_id":"10154264363424071","commenter_b":"@webpagelink Nice keffiyeh scarf right ?","commenter_a":"@username why is it that every single shooter and terrorist has been \"known\" by the FBI. Why wasn't there an alert with TSA to make sure he didn't have firearms etc.","post_message":"Here's what we know so far."}]
