[{"comment_id":"10153854981326509","commenter_b":"No mardi, flo is absolutely correct. There's no mass influx of Mexicans if that fence comes down. They can already cross the border with very little paperwork anyhow. Your fears are quite blown out of proportion.","commenter_a":"Highly dislike this man. He's everything America doesn't stand for.","post_message":"To quote the businessman himself, Donald J. Trump seems to be a \"very rich\" man. @webpagelink"},{"comment_id":"10153082331816600","commenter_b":"I agree Kaliah Nichole! I am not a fan of what Obama is doing either, however, to say that vaccinations don't work is absolutely ridiculous! The comment about hippie is because there are so many people \"hippies in the 70s\" that thought that we were all invincible and that we shouldn't have any restrictions and that the whole world was all about \"love\". This is not a game and even though our children get vaccinated and should be immune and resilient to certain viruses, this is not a game and not all immunizations are foolproof! So it's better to be safe than sorry and if people don't want to have their children vaccinated then they should all go to a communal area and go to school with each other and spread diseases amongst one another.","commenter_a":"Let's BAN @username! Go to a foreign country and bring back all types of diseases and parasites because of your lack of knowledge! Clearly by the looks of your picture you're a hippie who thinks that every thing you do is okay and that your indestructible because you smoke weed! Get an education and do your research!","post_message":"If a parent refuses to vaccinate their child and the child goes on to spread a deadly illness to others, do you think there should be consequences?"},{"comment_id":"10152817661912623","commenter_b":"like I say the only good snake is a DEAD ONE, since they ate my baby turkeys-I HATE THEM MORE","commenter_a":"Time to move. Fr.","post_message":"WATCH: What one North Carolina couple found in their spice cabinet will shock you.   Warning: There is some language in the video."},{"comment_id":"596327983852216","commenter_b":"@username... The woman is CHEATING. She's actually bussing mentally deficient people to the polls to vote for her! She and Bill are colluding to steal elections by interfering with voters at the polls! She is so despicable, and frankly, anyone who knows about this stuff and supports her anyway DESERVES a Trump presidency.","commenter_a":"(DISCLAIMER: YES I VOTED FOR BERNIE IN THE PRIMARY. THE FOLLOWING POST CONCERNS A HYPOTHETICAL SITUATION WHERE HILLARY IS THE NOMINEE) To the Hillary bashers, you do realize that she is ideologically identical to Bill Clinton and almost identical to Obama, right? If you found those presidencies to be solid, ok, or even mediocre, that is a hell of a lot better than the potential authoritarian nightmare we have coming with a Trump presidency or republican control of all of government (see Kansas or Louisiana for what happens when the tea party can do whatever they want unchecked). And yes, again, I voted for Bernie in the primary.","post_message":"One thing is certain: While I’m excited to cast my vote for Bernie Sanders next month, I’ll be more than ready to cast my vote for Hillary Clinton in November."},{"comment_id":"583593931828899","commenter_b":"We Can't Let This Happen ! Deport Them !","commenter_a":"Horrible","post_message":"Our Kids are in DANGER!"},{"comment_id":"10153331816764087","commenter_b":"Time to make another donation to PP!","commenter_a":"and this is how our tax money is spent! Disgusting, we should defund all these Republicans, 1 month no pay for each time you waste our money on senseless, going nowhere bills. Aren't there bigger problems to solve?","post_message":"Senate Majority Leader Mitch McConnell on Tuesday dispelled speculation that Republicans might drop a provision defunding Planned Parenthood from an ObamaCare repeal package."},{"comment_id":"1639044993063408","commenter_b":"Hahahaha english language correctly? Hahahahahahahahaha english language accurately yiu filthy Camel Cunt. India will rape your mother and your sisters till kingdom come. We will shove the Quran up your mom's asshole and tear it open page by page. When yiu stick yiur forehead on the ground and say allahu fuckbur your mom will moan with pleasure coz her vagina will be stuck to your forehead. Go fuck a camel you cunt l.","commenter_a":"Arabs will and have never won against Israel. If I were Arab I'd get on me camel and hoot into the unknown if me desert shit hole.","post_message":"LIVE: Netanyahu responds to Kerry speech on Middle East"}]
