[{"comment_id":"10156899433320354","commenter_b":"If you're a f****** illegal mexican, get the hell out!","commenter_a":"Illegal immigrants built part of this country cause people like Trumpet hired them! All of a sudden they're bad? Screw you all! Im proud to be a fucking Mexican!","post_message":"“[O]ne party has made it okay to say you can hate people, you can spit on them.” What would you like to tell Julieta Garibay? WATCH:"},{"comment_id":"1250130898332398","commenter_b":"Fuck off bitch!","commenter_a":"I voted for Bernie. I'm voting for whoever stops that White Nationalist Donald Trump. If Bernie is voting Hillary, so am I.","post_message":"Bernie just put the nail in the coffin for the Trump campaign. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"547874932072371","commenter_b":"This bitch needs to get ready for jail!!!","commenter_a":"I think someone is throwing. Dinner !!","post_message":"WASH POST PAGE ONE SUNDAY: Hillary begins laying plans for White House agenda..."},{"comment_id":"1015377538499586","commenter_b":"Once they gain a hold in our political system does anyone think they won't usher in Sharia Law? Incompatible with our Democratic Republic!","commenter_a":"When Islam got started it destroyed what was decent in the Middle East. It's incompatible with anything.","post_message":"\"Do you think, fundamentally, Muslims from the Middle East are incompatible with American democracy?”"},{"comment_id":"10153683930231323","commenter_b":"@username No, your country has still resposibilities coming from your good age of colonialism and be honest to your self: IS are nothing else than organised crime and don't be so stupid to believe, that an group of organised crime needs \"illegal immigrants\" to spread the business. BTW: find out where the largest number of historical artefacts from the middle east, coming with an unclear origin, are traded? Don't be surprised when you find out that it is London and you you can easily find out, that it is business of billionGBP earning. Why do you think IS is destroying historical sites? So, all this happens under the control of your government, right in your neighbourhood...","commenter_a":"The people were on their way and Germany take action to relief all surrounding countries, who where not able to cope with a minor percentage of the people floating their countries. Yes, it is not easy, but Germany helps a lot of people and countries and yes, it is a massive task, but we (you and me and our governments...) have to deal with it.Why? Because we are causing the situations, why the people have to flee and have seek for shelter. So, I am living in Hamburg, my borough is called \"Bahrenfeld\" and we have a polpulation 23.000 people. Currently we have 3.200 refugee living here. And I can hardly understand, why a country, which has caused and initilized a lot of the current wars in the middle east, in order to earn oil money ----NO---- to fight terrorism (hahaaa), refuses to take part in the resposibility...Yes, my dear ...","post_message":"“Sometimes the smugglers arrive in the middle of the night and drop underage refugees off at the service station. The police call my child protection officer at 3am, who has to go to them, and if no accommodation can be found, he often ends up taking them home with him.\""},{"comment_id":"10153306712306323","commenter_b":"Women are garbage collectors in the US. I've worked with a woman in construction 25 years ago in construction. I quit that job, and got an easier one. She remained, lol. I don't mind Feminism, I think it's something that needs to exist. I just don't like the internet clusters of nutjobs, who believe if you smile or say \"hello\" to a woman, you are promoting rape culture-whatever the fuck that is. These types of Feminists are useless. They need to fuck off.","commenter_a":"According to 2010 BLS data, the following jobs contain 1 percent female workers or less: boiler making, brick masonry, stonemasonry, septic tank servicing, sewer pipe cleaning and working with reinforcing iron and rebar. Maybe the reason female workers aren't in these occupations is that too many are in other occupations. Females are 97 percent of preschool and kindergarten teachers, 80 percent of social workers, 82 percent of librarians and 92 percent of dietitians and nutritionists and registered nurses. Women have demanded more professorships, seats in congress and chairs in the boardroom, but have never complained that there were not enough female garbage collectors, waste water treatment workers, plumbers, welders, pipe fitters, coal miners, truck drivers, brick masons an block masons, lumberjacks, oil rig workers, well drillers, surveyors, longshoremen, construction workers, landscapers, sheet metal workers, HVAC repair persons, meat packers, high rise window washers, car mechanics, iron workers or any physically ...","post_message":"\"Philip Zimbardo is one of the first people undergraduate psychologists learn about. His prison experiment in the basement of Stanford University showed a darker side of humanity. He now tells us that there are fewer men than women at college, stating that positive discrimination is now needed to increase the numbers of men at university, but this is because ‘one reason you go to college is to find a guy’. Not only are these kinds of views horribly sexist and outdated, they’re also far too simplistic.\""},{"comment_id":"1699015597030344","commenter_b":"A no vote IS a vote - for the candidate you least want.","commenter_a":"Adding or not adding the next Scalia to the Court seems like something that will have pretty wide implications for the next couple decades.","post_message":"\"I'm not interested anymore. I don't see any immediate, significant changes happening. I don't see voting as a means to an end.\""}]
