[{"comment_id":"1280477518640408","commenter_b":"Who cares,he is nobody.","commenter_a":"Who can respect this so called intelligent person (jerk), wearing a batman tshirt making important statements? My 5 year old grandson loves to wear his batman tshirt to the play ground. Makes me think Cuban is doing this for publicity. Yep...his money success has gone to his head!","post_message":"He's rooting for..."},{"comment_id":"704049616452283","commenter_b":"fuck that stinky black ugly bitch","commenter_a":"She maybe a First but NO LADY..","post_message":"Our first lady just disrespected all the white women in our country. She is a hypocrite and a racist. We miss Laura Bush. Do you agree Michelle Obama is a disgrace of a first lady?"},{"comment_id":"897074360335805","commenter_b":"She is an creep and liar..NO FOR PRESIDENT..","commenter_a":"Treason :How about collecting those deleted e-mails .We know you can do it .Obama and few more need to go with her .Sheis not in the boat by herself .Communist","post_message":"Which Hillary Clinton scandal is bigger? Is it the one involving her likely illegal secreting and destruction of email records from her time as secretary of state, or is it the one involving the massive conflict of interest she wholeheartedly embraced by using her family’s nonprofit foundation to collect millions of dollars from foreign government donors — again, during her time as secretary of state? @webpagelink"},{"comment_id":"10153592234263132","commenter_b":"She got dem dreads doh!","commenter_a":"SHE DOESNT EVEN LOOK BLACK!","post_message":"\"We are her birth parents. We do not understand why she feels it's necessary to misrepresent her ethnicity.\""},{"comment_id":"10154970022528690","commenter_b":"The world and so call United Nation have no interest in alepo people just because they are muslim, if its christian region this is happening the UN will have take action, but we the muslims are just folding our arm doing nothing, the only thing is to back to Allah, by saying; HASBUNALLAHU WANI'IMAL WAKIL, WANI'IMAL MAULA WANI'IMAL WAKIL,","commenter_a":"there is tubelight, internet, electricity bla bla. it seemed she is speaking from hotel pan pacific Singapore. we didn't heard even a sound of bullet fired. weird.","post_message":"Residents of East Aleppo are giving their final messages to the world."},{"comment_id":"752107674943648","commenter_b":"Loretta Lynch is a corrupt dirty rotten scoundrel is about to be charged herself for crime. Why? Stay tuned for more Wikileaks coming to a theater near you.! Loretta and Obama on the hit list for being nasty dirty people who have smirked and abused their positions in the greatest country. They will meet their maker on earth.","commenter_a":"HilLIARy has already admitted guilt and felonious actions??? She has admitted that her staff reviewed all her emails so they could delete her \"Personal emails\", right? Since this occurred AFTER she left the government, it is an admission of guilt!!! Why? It is a violation of law to reveal or share classified information with anyone that does not have a current active security clearance equal to or exceeding the classification of the material. Further it is required that the person have a \"need to know\" even if they have security clearance. Since her staff has neither a current and active security clearance or even if some did they did not have a need to know. Since it is now known that some of those emails were Top Secret SAP it is virtually certain none of those staff were listed as having access. The argument that none of the released emails ...","post_message":"President Bill Clinton – whose wife is currently in the crosshairs of the Justice Department over her use of a private email server – met privately with Attorney General Loretta Lynch."},{"comment_id":"10153743354289614","commenter_b":"He doesn't like illegals","commenter_a":"You know TRUMP is mad!","post_message":"BREAKING: Mexico has defeated the U.S., 3-2, in the CONCACAF Cup match at Rose Bowl Stadium in Pasadena."}]
