[{"comment_id":"10153609828841051","commenter_b":"and where are these little bastards from ? shot there little asses down like the dogs they are and make there parents pay for this lady for the rest of her life and a huge settlement to her first.","commenter_a":"People are VENDICTIVE!!!! Mean...and must be CRAZY! What makes people want to do these things! We need an island , or send them to the Muslim area. There they will see what CRAZY IS!!!","post_message":"First these boys attacked an 87-year-old woman. Then they raped her. And then they poured bleach down her throat."},{"comment_id":"1107974842571087","commenter_b":"She lies and lies and lies and lies and . . .","commenter_a":"I AM SO DISAPPOINTED BY YOUR NEW JOB DR BEN CARSON , YOU WERE BETTER AROUND WHITE COAT....[...]","post_message":"Is anyone surprised?"},{"comment_id":"10153187015096051","commenter_b":"Carolyn, have some respect. He is our President after all. President Obama has made America great. We don't need Trump to mess it up.","commenter_a":"Agree. Obama is a joke and think the world knows it. He's like a bad kid. Just had to say something because he's mad. And the rest....thought he was talking about himself. The US does deserve better than him","post_message":"President Obama had some harsh words for Donald Trump today."},{"comment_id":"682746131874162","commenter_b":"sorry i would not F%%% hillary the whore bitch, too many germs","commenter_a":"Hillary is a whore is better","post_message":"Drivers got one hilarious shock, but is it enough to turn Texas blue? -- Ellen"},{"comment_id":"10154827367754197","commenter_b":"@username your a tart.","commenter_a":"Trump's ignorance is astounding. He should stop tweeting narcissistic nonsense and start reading the security briefings. We are the laughing stock of the world now that we elected a buffoon as president. God help us.","post_message":"Donald J. Trump is very upset with the United Nations after a recent vote. Read his comments on WFSB.com and the Channel 3 app. Then, tell us your thoughts on the statements by the president-elect."},{"comment_id":"10156322425460725","commenter_b":"Maybe ISIS knew America would take in the refugees, it was there plan all along to have a easy way into America to destroy us! Lord help us all.","commenter_a":"He's a traitor, he is just a resident of the white house, he has broken the oath and is no longer legally the president","post_message":"What is our President doing?"},{"comment_id":"10153875456235329","commenter_b":"Dear women, stop giving us all of your stuff to put in our pockets","commenter_a":"YES! Matt","post_message":"This is not a drill."}]
