[{"comment_id":"1349378628409086","commenter_b":"If the left gets anymore crazier than it already is, they will probably force all heterosexual women who got impregnated the natural way from a heterosexual male to undergo an abortion, and only lesbians and transgender \"men\" can have babies. They want a world where only lesbians, homosexual men, and transgenders exist.","commenter_a":"The day is going to come when it will be possible to determine if your child will turn out like \"They\" before they are born. We shall see how much the left loves abortion then.","post_message":"This is getting out of hand..."},{"comment_id":"10153228124522235","commenter_b":"You scaring kitty. You BAD man.","commenter_a":"Scum!","post_message":"Convicted felon, Tom Delay, crawled out from under his rock to share his very important opinion about rights and liberties."},{"comment_id":"10154287365081130","commenter_b":"Bitter angry woman hater. I feel sorry for your kids, especially if you have daughters.","commenter_a":"We should let children make their own decision about whether they get to live or not. All Americans have basic civil rights and women do not have the right to take the right to life away from another living human being.","post_message":"\"We should let women make their own decisions.\" 👏"},{"comment_id":"1149773515076812","commenter_b":"Hillary should be in prison.","commenter_a":"Intelligent much??? I heard she said he was like an octopus...with six arms...omg","post_message":"OOPS! HILLARY'S HIT WOMAN LIED About Trump Groping Her…Eye-Witness Comes Forward: \"It was she that was the one being flirtatious”"},{"comment_id":"721943014570974","commenter_b":"lol bitches just saying the same shit to get pity and money","commenter_a":"Oh I bet she's a 'liar' too. So many baseless accusations that all sound exactly the same from people who never knew each other. Amazing.","post_message":"A protest was planned at the event."},{"comment_id":"508965689228025","commenter_b":"The Dem's blocked Bushes nominations when he still had 18months to go. What goes around comes around. Oh yea, they forgot that fact.","commenter_a":"Eat shit and dye hillary.","post_message":"Agree or disagree?"},{"comment_id":"1059948200694894","commenter_b":"She isn't a women, if she was slick Willie would deny ever having sex with her","commenter_a":"Unlike him, she should be under federal indictment and disallowed from running for any office at all.","post_message":"It's getting downright catty between Hillary Clinton and Donald Trump."}]
