[{"comment_id":"10150791998559999","commenter_b":"They are thieves!","commenter_a":"The cable industry as a whole is pretty much a monopoly. #Comcast","post_message":"In an unusual step, President Obama singled out cable set-top boxes as an outdated symbol of corporate power over consumers."},{"comment_id":"10153273305921051","commenter_b":"Sick ass Mother fucking Bastard, needs to be castrated and beat to death so he can feel the pain that poor baby felt, it just sickens me to hear of these evil people in the world.","commenter_a":"Convicts will likely shove reality up his ass!","post_message":"This guy did something awful to a 19-month-old girl. Now he's going to face the consequences."},{"comment_id":"785803421556302","commenter_b":"GREAT!!! MAKE HER LIVE BY OUR LAWS!!!","commenter_a":"Yes sir jail or take that crap off , its disrespectful !!!","post_message":"Judge Throws Muslim Woman In Jail For Refusing To Remove Headscarf In Court. If you can't obey our laws, you go to jail. Do you think she had this coming?"},{"comment_id":"983083455063224","commenter_b":"Don't apologize, you have a right to feel the way you do, you are a woman","commenter_a":"GEEZE","post_message":""},{"comment_id":"607614076095838","commenter_b":"Sorry asshole there is noway you're going to get rid of Jesus, don't believe it, just keep doing what you're doing.","commenter_a":"No thank you I'll follow Jesus","post_message":"What Obama just said will have you quivering in your sheets. He has completely lost it. Spread this and show America his true intentions. Do you agree Obama is a threat to American life?"},{"comment_id":"10152917193351813","commenter_b":"Women have options. Don't have sex if you can't afford the reprocussions.","commenter_a":"Why would you vote to decrease the options women have for health care? Makes no sense at all.","post_message":"BREAKING: Senate fails to defund Planned Parenthood. The road ahead is uncertain, but for today logic prevails. We’ll continue to stand alongside our partner and access to care for millions."},{"comment_id":"10153374154140329","commenter_b":"Karmas a bitch if you're an asshole","commenter_a":"People do spit in the food. I did it myself at McD's way the hell back when. Only when someone I really hated from school came through the line though. Nice big hock in their drink. Mmm...good times.","post_message":"\"We have all tried, and failed, to make a burger that looks like they do in the ad.\""}]
