[{"comment_id":"10153679869402629","commenter_b":"Who cares... Let her be a kid!","commenter_a":"good for her","post_message":"Malia Obama. is touring colleges to decide where she will go to school (and maybe play beer pong?) next year."},{"comment_id":"1786615071570542","commenter_b":"Send them to Cuba , please. We do not want them.","commenter_a":"We dont really care what you think John Legend!! Why dont you, Colin, Beyonce, Kanye, Will & Barbara & all the other negative so-called celebrities move to Canada or Cuba & give us Americans a friggin break!!","post_message":"Singer John Legend also tweeted that the Star Spangled Banner is \"weak.\" @webpagelink"},{"comment_id":"10153442006357061","commenter_b":"Sometimes a girl just needs help getting all gorgeous for the day.","commenter_a":"Ahhhh. The small amount of time this took will pay dividends in the future to this little gem. We should all make investments like this.","post_message":"Deputy helps 2-year-old toddler put her pants on after she calls 911 while struggling to get dressed. \"I'm just grateful for the deputy and her kind, wonderful heart.\""},{"comment_id":"10156550543770389","commenter_b":"Tonya I thought you were referring to refugees especially Syrian ones. My mistake. Sanctuary cities are liberal ridiculousness and need to stop. I don't agree with them at all. I see what you mean about a major delay.","commenter_a":"I am amazed at how Christians can look at Trump and Cruz and not see that Cruz is clearly the choice for POTUS. 'By their fruits you will know them', Matt. 7:16. Very disappointed with Sara Palin and Rev. Falwell; they should know better.","post_message":"Question of the Day: Which Republican do you think will be the best candidate for evangelicals?"},{"comment_id":"10155835827900615","commenter_b":"About damn time they got these creeps off the air!","commenter_a":"Unfortunately another network will probably pick them up.","post_message":"BIG BREAKING NEWS –"},{"comment_id":"10154382058398606","commenter_b":"These chicks will walk on hot stones for me but keep disrespecting their sisters","commenter_a":"@username Smdh. Why would anyone do that?","post_message":"More than 30 people suffered burns to their feet and lower extremities at a Tony Robbins seminar after the motivational speaker encouraged them to walk across hot coals. @webpagelink"},{"comment_id":"10153493306391636","commenter_b":"Kd Ray what Arabs have to do with this?","commenter_a":"And Michigan shooter who drove uber said the app told him to kill people, mental illness comes in different shapes, this lady is terribly ill, not because she's Muslim!","post_message":"Horrific"}]
