[{"comment_id":"10154475090187098","commenter_b":"Let's nuke 'em now !","commenter_a":"Can we drop some nukes on them already? What's taking so long?","post_message":"MISSILE TEST: North Korea reportedly fired a ballistic missile in what would be its first such test of the year and an implicit challenge to President Donald Trump new administration."},{"comment_id":"10152771526960950","commenter_b":"She didn't tell people to do this so she isn't responsible for what happens. She is only on the show since her older sisters were in the lime light to begin with and then as she got older she got in the light! It's not her fault these girls are dumb af!!! She paid money to get filler in her lips she didn't suck her lips into a bottle!","commenter_a":"I know kids who have done is following that crazy K lead. She should be held responsible if anyone becomes disfigured. Time for a public statement, Kylie.","post_message":"WARNING: Teens who participate in the #KylieJennerLipChallenge by suctioning their lips with a bottle or jar could be left permanently disfigured or deformed, doctors say."},{"comment_id":"10154814008013797","commenter_b":"Why feed nd house this p.o.s just torture em till.hes dead","commenter_a":"Piece of 💩","post_message":"LIFE IN PRISON: In the man's car, police found children's toys, chloroform, sleeping pills, cable straps, thumb cuffs, a stun gun, latex skull masks, gags and various strangulation devices."},{"comment_id":"10156983080310354","commenter_b":"throw his ass in prison HES NOT FIT TO WALK STREETS WITH REAL AMERICANS","commenter_a":"Only 5 years?! When he gets out of prison,strip him of his Texas residency,send him to live where he belongs ,Washington D.C.,with all the rest of the anti-American felons.","post_message":"You heard about this, right?"},{"comment_id":"787208168094254","commenter_b":"That woman's a little unhinged!","commenter_a":"You are a has been. Good luck in finding work. You might need President Trumps help in finding a job.","post_message":"Classy!"},{"comment_id":"911367582233916","commenter_b":"If she was, she wouldn't have been fired, period.","commenter_a":"I wouldn't give her a job, she will steal me blind.","post_message":"The Lead with Jake Tapper host said it is his favorite \"live TV\" moment of 2015."},{"comment_id":"10154949382818010","commenter_b":"Amen Danny. This Ed guy is Obamas gay boyfriend.","commenter_a":"Where do you think they learned that from? Very close ties to the Obama administration, and of course, \"we're with her\" too.","post_message":"You're not supposed to say, “I think we broke the law,\" even in internal emails, according to the lawsuit."}]
