[{"comment_id":"10154362042947756","commenter_b":"I would like to point out, this is myself debating with other women, not only do they act insane, but they will hate on any woman whom has a different opinion, get rid of the illegals, they are a drain on our economy...period, if you don't like, then let them live in your home, your a bunch of rabid animals acting like crazy people...how can anyone ever take you seriously...this was an experiment for my college professor whom wanted us to learn abouy equality...lol","commenter_a":"Well once all the blood sucking illegal's are gone, we can put money towards our vet's and the wall, we all know Mexico is to cheap and lazy to pay for it.","post_message":"President Donald Trump is expected Wednesday to move forward with plans for border wall, increased deportations."},{"comment_id":"10154961510296729","commenter_b":"Lying bitch!","commenter_a":"ALWAYS REMEMBER BENGHAZI","post_message":"And I'll tell you EXACTLY what difference it makes..."},{"comment_id":"10153302293701051","commenter_b":"EVERY country is populated at some point in its history by people who migrated to it ... THAT is how all countries began.... good grief. No one is against LEGAL immigration.","commenter_a":"Nearly 100% Americans ARE immigrants. Through their ancestors. :-))","post_message":"Do you agree with the vast majority of Americans on this?"},{"comment_id":"10156113177590725","commenter_b":"@username What was your last name @username again? we really need the wall!","commenter_a":"Like you always say China is eating our lunch.","post_message":"Depression- be careful of China!"},{"comment_id":"10153724968238145","commenter_b":"Wow the desperation of perverts grown woman don't want you so you seek a teenager . Get rid of scum bag .","commenter_a":"Glad they got him.","post_message":"BREAKING: This happened at the Publix on SR-434 and Wekiva Springs Road. Angela Jacobs will have a live report at 12pm."},{"comment_id":"10155086902812235","commenter_b":"UK agrees Americans you created this problem now fix it Europe do not want a war","commenter_a":"How much longer are the American people, the ones who didn't vote this idiot in, going to let this go on, this ego maniac is ruining your beloved country, it is the laughing stock of the world thanks to him, how can any government anywhere take this moron seriously and trust him with anything, he lies through his teeth, blames everyone else for whatever is going on, it has only been 4 weeks and look at the state of things ! My thoughts are with the American people who didn't vote for this buffoon, i hope your country can get rid quick and recover from his dreadful influence !","post_message":"\"I was hoping you could tell me what the f*ck is going on over there?\" - European security services ask."},{"comment_id":"10153448398281350","commenter_b":"She lied to get jobs","commenter_a":"Why is ok for Bruce Jenner to claim to be a woman and not ok for Rachel to be black if that is what she wants ?","post_message":"\"I did feel at some point I would need to address the complexity about my identity.\""}]
