[{"comment_id":"10153155041977439","commenter_b":"Her. Defence allah made me do it ☺","commenter_a":"I hope they arrested this trash!","post_message":"MIAMI AIRPORT JIHAD TERROR: Muslim rams her car into a checkpoint and screaming in Arabic, threatens to BLOW UP airport. Go to pamelageller.com"},{"comment_id":"938570362850489","commenter_b":"I love this woman.....","commenter_a":"Thank you for sharing this work of art...beauty born through the transformative act of a life examined...","post_message":"Listen to a woman who isn't supposed to share her story do it flawlessly. Whoa."},{"comment_id":"10155752505360354","commenter_b":"He is done by wanting Oprah as his VP! He shot himself in the foot in one day;","commenter_a":"A man who's made billions... yea, that's what we need, another corporate hive-mind in a leadership position. Wake up.","post_message":"Think Donald Trump lacks serious policy proposals? Think again."},{"comment_id":"1240488536029680","commenter_b":"Would she use such foul mouth language if so she would be in the gutter with you","commenter_a":"And I really think she would of said \" you're the anti Christ you cunt\" that's what she would of said to hitlary Clinton","post_message":"The late, great Mother Teresa was just sainted, but what she said about Hillary before she died will come as a surprise to a LOT of people. Everyone in America needs to see what she said about Hillary before she died."},{"comment_id":"471354216346689","commenter_b":"It's far easier to cheat on your taxes than it is to receive SSI.","commenter_a":"I don't believe it is a real disability either but a ploy to rob the taxpayers of more money.","post_message":"Please put me in a room with this man. Just for 30 minutes. I'm diagnosed as bipolar. There are varying degrees of bipolar disorder. Some are well managed on medication. Some aren't and are disabled.. I am one of those that is great on medications. However, off of medications? I can't function, and seriously, I become a danger to myself because I make TERRIBLE decisions in a manic phase. So yea, let me at him. ~ Liz"},{"comment_id":"10153378828583984","commenter_b":"Yes","commenter_a":"Yes","post_message":"The Obama Administration’s pattern of rubber stamping these cases has significantly increased this percentage in the US. Do you support securing our border?"},{"comment_id":"10154471840033433","commenter_b":"John Mossman well then he took one for the team when he helped conceive his daughters.","commenter_a":"Worst Muslim eva. Eating bacon on a non zabihah beef burger, drinking beer, smoking, wearing shorts, not observing Ramadan...","post_message":"Pants on Fire for town hall audience member: \"You know our current president is (Muslim). You know he's not even an American.\""}]
