[{"comment_id":"10153745171813837","commenter_b":"She lied. There's a difference.","commenter_a":"Far more honest about her mistakes than Hillary Clinton.","post_message":"MRS. TRUMP: Melania Trump announced Thursday that she took down her website, acknowledging that it contained inaccuracies."},{"comment_id":"10153322373749087","commenter_b":"Ladies, don't embarrass yourselves....you got your asses kicked in both elections. ;)","commenter_a":"Well vote for the Republicans so they can make you feel more comfortable by taking you back to that time.","post_message":"Sister Souljah on Hillary Clinton: “She reminds me too much of the slave plantation white wife of the white ‘master.’ She talks down to people [and] is condescending and pandering. She even talked down to the commander in chief, President Barack Obama, while she was under his command.\""},{"comment_id":"10155823067465492","commenter_b":"Oh God there she goes again someone gotta find this chick a map","commenter_a":"Thank you Di Blassio!","post_message":"\"We are currently investigating and stand ready to assist the NYPD in bringing these individuals to justice,\" an Uber spokesman said."},{"comment_id":"1902414739981573","commenter_b":"Do these woman have any idea how stupid they are?","commenter_a":"How stupid","post_message":"Whoopi Goldberg: Right to Celebrate Christmas is the Same as a “Woman’s Right” to Abortion"},{"comment_id":"10156487496090615","commenter_b":"Give it up, David. If they'd vote for someone who votes for war, flip flops on the Keystone pipeline, takes money from Wall Street, and until very recently did not support marriage equality, I don't think they're interested in the truth. They'd rather just take their half truths and stir up crap, just like the candidate they support.","commenter_a":"So many Bernie fans complained that not enough debates were scheduled before the primaries. Now Bernie refuses to debate when the other two candidates are willing. Yet another reason I'll be voting for Hillary.","post_message":""},{"comment_id":"10155507784285405","commenter_b":"DO NOT LET the criminal illegal invaders take over our military .","commenter_a":"Karl Keyzer-Andre","post_message":"As we celebrate Armed Forces Day, I want to take a minute to honor and thank all our servicemebers and veterans for your sacrifice. America owes each and every one of you a great debt of gratitude."},{"comment_id":"521579714699275","commenter_b":"She is like a pile of dung. Worthless!","commenter_a":"Yes","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way.  What a disgrace. She needs to deported to the Middle East.  Do you think Nicole Kidman is a sell out?"}]
