[{"comment_id":"10153179398831051","commenter_b":"I wouldn't make my daughter wear a sign as punishment. I would just give her a spanking.","commenter_a":"I like it!","post_message":"This is how a dad decided to punish his teenage daughter. Good idea or bad idea?"},{"comment_id":"10153308382443145","commenter_b":"How sad ! Ban the Frat !!","commenter_a":"Two bills allowing guns on college campuses are about to be introduced. Alcohol, hubris, testosterone, guns. What could go wrong?","post_message":"The UCF chapter of the Sigma Nu fraternity was suspended after a video surfaced of a member chanting the word \"rape\" and encouraging sexual violence toward women, the university said. The organization will have a formal hearing Thursday. #wftv"},{"comment_id":"10155066289616336","commenter_b":"@username is a dumb pussy","commenter_a":"Can't wait to hear!! PA deplorable here","post_message":"President Donald J. Trump has announced Judge Neil Gorsuch as his nominee for Supreme Court of the United States."},{"comment_id":"10153061896611051","commenter_b":"She did nothing wrong. I applaud her.","commenter_a":"What IN the hell is this World coming too this kid don't have MONEY and she was nice too give her food too eat I thank her for her kindness and Love and a heart, caring!!!!!","post_message":"A hungry first grader who didn't have money for lunch started crying in front of this kitchen manager, so she gave her some food. Bad move."},{"comment_id":"10156580556107228","commenter_b":"No sweetheart they don't have no idea what fighting for their rights is about. I don't recall any civil wars that were fought to free the transgender. How many transgender have had crosses burned in their yards, how many transgender have been hung in trees? How many transgender were murdered for being transgender? Special kinda of stupid are the folks that think that the struggles the black community have faced and continues to face compares to Johnny who wants to wear a dress!!!!","commenter_a":"Sorry but to try to compare the two is insulting. I don't recall transgenders ever being enslaved, I don't recall transgender ever having to fight for their civil rights. Being transgender is a choice you make, wether you feel you were born this way or not is debatable. Black is black, no debate there.","post_message":"I sat on the plane this week with a beautiful family.  The mother introduced her three children to me and opened up to me that her youngest daughter is a trans child. She is actually a documentary producer and is working on a film about trans children, a film that will try to confront and dispel the wide spread fear, ignorance and bigotry that surround trans Americans. She allowed me to watch the trailer and the beauty, struggle and courage of the families she highlighted resonated with me deeply. I pray that we all grow more courageous in our empathy, that we all seek to understand each other more and that we all become better agents of love and justice. As for me, I condemn the actions of the Trump administration in their reversal of transgender student protections. I will not yield in the fight for equal rights and equal protection under the law. We all owe an obligation to those freedom fighters who fought for civil rights, women's rights, workers rights and human rights over the past generations. We can not pay those heroes of love back, we can only pay it forward. Now is the time that history calls on us to make for a better future for all. #protecttranskids"},{"comment_id":"10154141552967426","commenter_b":"Those who are always accusing others of hate don't seem to have enough self awareness,intelligence or what ever to know how obvious it is who they hate.","commenter_a":"Welcome to Hillary's America RVA.....","post_message":"\"Your vote was a hate crime,\" was sprayed painted on statues that honor Civil War icons along Monument Avenue in Richmond.  The graffiti was discovered as hundreds protested the election of  Donald Trump as president.  Updates: @webpagelink"},{"comment_id":"10154244294358132","commenter_b":"I love me who do you love? Stop posting naked pictures of yourself you hoe!!!","commenter_a":"Omg! She doesnt know what to do to get attention!","post_message":"Kim Kardashian West is letting it all out."}]
