[{"comment_id":"1052489598132806","commenter_b":"A vote for Brad Thor is a vote for lying Hilary!","commenter_a":"beck cares about MONEY & POWER.he has to keep this mess up to TRY and stay in the limelight. just STOP-we want to WIN in nov. TRUMP 2016","post_message":"#Thor2016"},{"comment_id":"1693365440922113","commenter_b":"We need to take back our country from these liberal Morons! How dare they: your rights STOP where ours begin!","commenter_a":"Funded by MUSLIM BROTHERHOOD to divide & conquer!","post_message":"Black Lives Matter supporters spat and stood on the American flag outside a Donald J. Trump rally Sunday."},{"comment_id":"10153321594333812","commenter_b":"Hahahahahaha","commenter_a":"what strong messages? I thought she deleted all her messages. lol","post_message":"President Obama says Hillary Clinton will have \"some strong messages to deliver\" if she runs for president. @webpagelink"},{"comment_id":"10152831288276636","commenter_b":"Terrible woman screaming like that I'm glad she was sacked","commenter_a":"If it doesn't affect your pay don't let it affect your day let star bucks hire security you getting pay regardless you sell coffee and straw LESSON \"I WILL NEVER BE JOBS WORTH AGAIN\"","post_message":"\"Give me the straw, give me the straw, give me the straw, give me the straw... call the cops.\""},{"comment_id":"1388401547878144","commenter_b":"They ain't people fuck em and their cars","commenter_a":"Even if its a serious rush it doesnt give them the right to fkin hammer through like that, imo. Yes they should move over more than they do, but to run into every car they can is idiotic. Shows the disrespect of people even if some may be the enemy, everyone isnt","post_message":"More throwbacks at > Afghanistan Combat Footage - Funker530 You think you know road rage? ~Josh"},{"comment_id":"1001578793209206","commenter_b":"I should hope so. I thought charges had been brought before the court. Let's hope these 2 black women thugs go away for a long while and go to finishing school. Sarcasm intended","commenter_a":"Way to be behind in the news. Also i believeit was in indianapolis and the girl has been arrested on an unrelated charge. Yup mainstream news media at its best","post_message":"Shocking video out of Texas where a woman holding a child was assaulted by two other women."},{"comment_id":"10154072479709586","commenter_b":"This is so wrong... Those poor chicks.","commenter_a":"What fking country is that, where?! This is filmed. Why isn't someone there to do something about that?!","post_message":"People actually do this for #Easter. All the babies are just DUMPED in there :("}]
