[{"comment_id":"1765122613748965","commenter_b":"NO YOU SHOULD SHUT THE F UP","commenter_a":"#Podesta should stfu...","post_message":"\"I think the men and women of the FBI are doing a tremendous job out here across the country. But the leakers should shut up,\" Podesta said"},{"comment_id":"10153660041871770","commenter_b":"Shes a idiot to.like we care what a gold digger has to say oh she fits in with crooked Hilary","commenter_a":"Who cares care","post_message":"What?!"},{"comment_id":"1420716084688108","commenter_b":"Lol who said I support the wall..guck the wall just spend more deporting illegals... end of story","commenter_a":"Warren is a liberal piece of fucking shit!!!","post_message":"Republicans did NOT want you to hear this letter. Pass it on!"},{"comment_id":"10154833870921336","commenter_b":"The pussy you are referring to is a family who call themselves Lisa, nice safety pin by the way, do they make them in mens?","commenter_a":"If Trump states that 'Nothing will Change', then he should stop being such a pussy and stop belly-aching about the recount. He's a complete WIMP.","post_message":"Reince Priebus slammed Dr. Jill Stein's presidential election recount effort, which was recently joined by Hillary Clinton's campaign."},{"comment_id":"1762909607309407","commenter_b":"Hey Trump you going to build a wall for these people.","commenter_a":"Idiot","post_message":"During a Colorado rally on Sunday, Trump unfurled an upside-down rainbow flag with the words \"LGBTs for Trump\" written on it."},{"comment_id":"10154904389672235","commenter_b":"First, someone like me will have to tell the old hag to STFU and get out of the lady's face.","commenter_a":"I wonder how long it willl take for it to sink in to the deplorables that this sort of behaviour is intolerable, and they will be held in contempt for it by civilized people?","post_message":"BOOM!"},{"comment_id":"10153883413908797","commenter_b":"Wayne if weren't a firefighter then don't offer an opinion you don't know anything about, the twit woman had it coming!","commenter_a":"They didn't have to do it. .could've went over her car and just give her a ticket","post_message":"DRASTIC MOVE: Look close. That’s Yasmine’s car. The windows are smashed and a fire hose has been pulled through it. Firefighters say they had to do it to get to a house engulfed flames. And they point to what Yasmine did just minutes earlier as the reason. Do you think she has any right to complain?"}]
