[{"comment_id":"10154772615548701","commenter_b":"Od the bitch","commenter_a":"U fux'n C U N T.... Let me c u any where... U will wish ur momma swallowed the load u were conceived...","post_message":"A Washington mother is accused of giving her three young children heroin to sleep. One of the children told investigators his parents gave him and his sisters the 'feel-good medicine.'"},{"comment_id":"1028894700543062","commenter_b":"Is that a slit in her dress up to her you know what? Inappropriate for the First Lady. Not running for first slut!","commenter_a":"Moochie, it's gonna take more than $12000.00 to make you the Lady of Camelot.","post_message":"Woman of the People"},{"comment_id":"1541468506160349","commenter_b":"If, they take away guns criminals will build bombs !","commenter_a":"America has got to be in the grip of a a gun cult. When reason and logic doesn't work, you know the NRA propaganda has got a serious grip on us. We've shown the world how much our armed gun citizenry has worked - America's mass shootings are on a continuous news cycle being aired around the world. They must think we are arrogant when we refuse to look at their own country's statics as proof that less guns indeed do work. It's so logical, so reasonable, less guns, less gun related deaths. Yet we continue to be surprised at each mass shooting and continue to have vigils and prayers only to buy more guns. Other country's must laugh sadly at our arguments of death by spoon, forks or auto or our description of a gun being an inanimate object or that guns don't kill. Other countries must seriously hate ...","post_message":"Mic drop.   Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"894646007249901","commenter_b":"Go home","commenter_a":"Shut your eyes or put a bag over your head !!!","post_message":"This is the real agenda of radical Muslims."},{"comment_id":"1069939893102262","commenter_b":"Agree ^^^","commenter_a":"More far right wing Christian terrorism supported by fox news and the NRA.","post_message":"Anti-Muslim rhetoric has spiked since San Bernardino."},{"comment_id":"857055204364524","commenter_b":"Just proves that he's good at beating up women too. And it's probably more fun since the women can't punch.","commenter_a":"Manny is no angel","post_message":"Floyd Mayweather has been charged with domestic violence on six separate occasions, convicted on five of those charges and has only served two months in prison, never receiving any penalties from the Nevada Athletic Commission regarding his professional boxing career."},{"comment_id":"10155015963219199","commenter_b":"Always use condoms jeez you never know who has it.","commenter_a":"This senseless act could have been avoided if we would have banned all Mustangs after the first Mustang ran into a crowd.","post_message":"Surveillance video shows a man on a bicycle in the Phoenix area being run down by a Ford Mustang."}]
