[{"comment_id":"10153371491386336","commenter_b":"Not American and horrible woman","commenter_a":"Mother Teresa.","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"591748790988611","commenter_b":"She is such a lying two-faced b**** and anybody that believes anything that she says is a moron! That woman has more money and more houses and more luxury than anyone. Everytime she opens her mouth she's lying","commenter_a":"Pot calling the kettle? Except for Trump never having killed anyone","post_message":"Is this hypocritical?  WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"1532037343754150","commenter_b":"Forcing an innocent girl to say sorry to China due to afraid of losing a large profit. Good job Communist China and JYPE!! And if Taiwan and Communist China are the same state. Why Taiwan has her own flag, currency, army and diplomacy? And why does her people have the universal suffrage to vote to elect her own president? Why those chinese doesn't have the right to elect their leader directly? A \"small\" state like Taiwan has so many political parties. And A Big China just rule by Communist Party. How good to see democracy and dictatorship really works in! From those I have mentioned and others have talked with. It shows that Taiwan is an independent State. Try show some respect Chinese. Or even China wants to unit Taiwan. They should have guts to take action to invade Taiwan but not by talking those nonsense. And we shall see ...","commenter_a":"Chinese netizens says Lies Obviously is Chinese netizens because she Holding a Taiwan flag Began to attack She","post_message":"Her name is Chou Tzuyu and she is now the focus of attention."},{"comment_id":"1601888236769214","commenter_b":"I personally like the idea of amnesty for those already here, then very strict implementation of immigration laws and immigration reform after that. Breaking up families is not a solution to this problem. These raids will just cause more pain and foster bad feelings. If they're here, let them stay, get them legalized so they help support the system they're using. Then lock it down and form a clear, sensible, reasonable, doable path to citizenship. we don't need a wall. We need penalties on companies that hire illegals, and serious reform on the \"war on drugs\" that incubates environments that force people to flee their homes. We have to stop blaming people who are looking for a better life, and start finding ways to help our neighbors reach the same level of community peace that we enjoy.","commenter_a":"I know this is going to be unpopular, but I know many Hispanics who agree with me. There is a legal way to come to the country, and contrary to some of the attacks I have seen on other posts, it does affect our low income Black, Hispanic, and White communities. They are used to a more extreme poverty, so they are willing to work for less than minimum wage, and are off the books, so taxes, SS are not paid. This means an American citizen or legal immigrant is denied a job. When so many of our jobs are being sent to Mexico, China, India how can we not address the issue of those who came here illegally. My nephew's wife is from Mexico. 2 of my nephews have dual citizenship. US/Brazil. I am far from racist or anti-immigration, but our own citizens and legal immigrants are suffering. We ...","post_message":"This week the media reported something that I find not just wrong, but inhumane: President Obama is currently planning \"a month-long series of raids in May and June to deport hundreds of Central American mothers and children\" who came to our country fleeing that same violence.  Sending women and children back into harm's way after they already fled horrendous violence in Central America is painful and inhumane, and must be stopped.  Sign my petition asking President Obama to stop these raids and to make sure that families fleeing violence in Central America are protected from deportation."},{"comment_id":"10153179631761833","commenter_b":"lots of canadians too,,but they have to do it ILLEGALLY,,,lol..","commenter_a":"The enemy fears us does not matter if they are in Washington or are muslim extremists the end results will be the same. We will protect our 2nd Amendment rights.","post_message":"John Lott: Terrorists can strike anywhere and at any time, giving them a huge strategic advantage.Unfortunately, too many politicians around the world are refusing to admit this.  In the U.S., over 12 million American civilians are licensed to carry concealed handguns.  These Americans save lives."},{"comment_id":"10153240957300950","commenter_b":"We need a new president - but not Hillary!","commenter_a":"Putin keep up the good work","post_message":"\"He needs to go after the people who killed Russian citizens,\" Obama said of Putin."},{"comment_id":"521171901404436","commenter_b":"No I sure hope they stop these refugees from coming to our state in Arizona!!! Don't want them here!!!","commenter_a":"Come on fla...join texas","post_message":"Is your state in this MAP?"}]
