[{"comment_id":"10157793591820354","commenter_b":"Yes He should have been the nominee to begin with. She is crooked and shouldn't have been allowed to run.","commenter_a":"Screw Bernie, he showed me he is an ass, gave my money and vote to Hillary, I have move on, I have become a deplorable American","post_message":"Feel the Bern!"},{"comment_id":"10155384146056509","commenter_b":"You have to be a goddess first.","commenter_a":"There are no emojis that look like me either... When will Apple give a goddess as an option","post_message":"She couldn't find an emoji that looked like her, so she took it upon herself to make it happen.  Meet the 15-year-old that brought the hijab emoji into the picture @webpagelink"},{"comment_id":"852403371522583","commenter_b":"Deport Europeans!!!","commenter_a":"deport them all...","post_message":"5,000,000 undocumented immigrants may be left in limbo..."},{"comment_id":"10154478839956636","commenter_b":"'@username without god, noone can hear you get shot. Your worldview is wuite hopeless. Without god, who will punish evil ppl then evil has won. Rofl","commenter_a":"They found the remains of velociraptor Jesus used to ride on.","post_message":"Incredible"},{"comment_id":"527974647394206","commenter_b":"It is not the gun! It is the government's purposeful lack of enforcing the gun laws that we already have, allowing criminals and drugs to pour into this country, no border protection, telling people to rise up and kill cops, stop that, then you will see these horrific murders stop. Wake the frig up.","commenter_a":"They are banned and have been for many years","post_message":"The shooter in Orlando used an AR-15, the same semi-automatic assault rifle used in Newtown and Aurora. There is no constitutional right to easily slaughter 50 people. End of discussion.  Image by Occupy Democrats, like our page for more."},{"comment_id":"1716977158581874","commenter_b":"You are a troll. Won't work here. Illegals will be deported en masse.","commenter_a":"'@username I've been saying this for years. NOW, USE THIS INFO! If you state this info you will find more acceptance from the immigrants and especially the children who are now protesting you. For you will enlighten them and show them that they are being taken to the cleaners. The illegal immigrant is enticed to the USA. Have your people look this up.. The immigrant is being used and abused. The very children you see protesting you have no idea that the WELFARE they are receiving (and their parents are spending) is to be PAID BACK. Poof can be seen by how SSA is now taking retirement benefits from people (up to 15%) to pay back college loans. Loans that were taken out years upon years ago. Also if citizens received SNAP, TANF, Medicaid, or SSI they are paying back that money they received before retirement age by a lowering ...","post_message":"When illegal immigrant households receive far more in federal welfare benefits - than 'native American households - there is something CLEARLY WRONG with the system! Continuing this track will NOT MAKE AMERICA GREAT AGAIN! I will fix it, Crooked Hillary will not!"},{"comment_id":"969542393176866","commenter_b":"these woman being paid by Hillary..it took them all 30 years to come out...they want their 15 minutes of fame...wonder if they'd like it if someone did that to their Dad or brother...?","commenter_a":"I think his own recording is pretty factual","post_message":"'He has been nothing but completely respectful.'  Chelsea Cooley Altman, who was Miss USA 2005, gave her assessment of Donald J. Trump in the wake of multiple women accusing him of sexual misconduct."}]
