[{"comment_id":"1194642483887307","commenter_b":"Still need to deal this evil bitch a Blow","commenter_a":"easy defense... animal was not collared, violated leash laws, and was a threat to their own pets and property.","post_message":"She killed the cat because she believed it was a stray and became a nuisance, but a couple who testified in court this week said “Tiger” was their pet."},{"comment_id":"1765509470395082","commenter_b":"This morning someone on ABC said Trump supporters don't take him seriously. Republicans never gave President Obama a chance. They blamed him for everything and they worked tirelessly to make him a one term president. If Trump wins America will be the laughing stock. Even the Russian government knows that. Donald a Trump blames everyone democrats for everything that is wrong but he has yet to say how he's going make America great again. Unless building a wall to keep out the illegals is how few intends to make America great again. I was team Bernie but since he didn't make the cut I have to go with the lesser of two evils. I can't vote for someone who fuels hate and bigotry.","commenter_a":"It's not up to this man to judge anyone soul. He is filled with hate against Mr Trump, he need look inside to his own darkness!!","post_message":"Khizr Khan, the father of a US soldier slain in Iraq in 2004, says Donald J. Trump has a \"black soul.\" @webpagelink"},{"comment_id":"10154672765359760","commenter_b":"Why? Ugly horse face bitch!","commenter_a":"Hell No! She didn't belong there in the first place. Garbage.","post_message":"Michelle Obama was loved by millions of people around the world as First Lady. Do you miss seeing her in the White House?"},{"comment_id":"706998779490700","commenter_b":"I'll help her pack!!! Don't let the door hit your big fat ass on the way out!!!!","commenter_a":"She is as big a piece of shit as her husband","post_message":"Michelle Obama was caught bad mouthing America in this newly surfaced video. If she doesn't like America, she can leave. Would you be happy if Michelle was gone?"},{"comment_id":"853572084739045","commenter_b":"Lol! Wow!","commenter_a":"I agrees with the Judge! Come here by the proper channels! WTH","post_message":"Here's a breakdown of what the immigration ruling means."},{"comment_id":"10153891408869062","commenter_b":"Yeah","commenter_a":"Waiting on PA","post_message":"JUST IN: The Texas House Committee approved a bill to make marijuana legal for adults. It still has a long way to go before becoming law, but what do you think?"},{"comment_id":"10153721547731378","commenter_b":"Says a skinny woman","commenter_a":"Life is short. Eat the cake.","post_message":"Are \"Cheat Days\" helpful or harmful to your diet? Some say giving into cravings can decrease your appetite. What do you think?"}]
