[{"comment_id":"10155842055160354","commenter_b":"F**K that Little C*nt , deport the little bitch immediately !!!!!!","commenter_a":"Maybe she should give back all those American dollars she has made from a country she hates so much.","post_message":"Not the sentiment America's past time was looking for..... WATCH the video and hear it for yourself...."},{"comment_id":"1642472956011827","commenter_b":"Hillary Clinton is against Christ and she is for anything illegal immigrants bring her money. .","commenter_a":"What would you have us call them, Hillary? They are in our country illegal,,,duh.","post_message":"Hillary Clinton says the term \"illegal immigrant\" is offensive and shouldn't be used. Is she right, or is this political correctness gone too far?"},{"comment_id":"1173905836039000","commenter_b":"She's not my plan b.","commenter_a":", Sanders is a good man, sad what the DNC did to him, they rigged the rules against him, Hillary is running all the way to the bank laughing her big fat @ss off, this Democrat will not vote for that money sucking Hag !!","post_message":"Bernie Sanders shoots some hoops with NBC's Chris Jansing. More from the court: @webpagelink"},{"comment_id":"10154819113006336","commenter_b":"She'll pay one way or another! I would like to see her drug through a trial, but if it's going to take away from necessary changes to bring America back to its roots, then let Hillary continue to slowly sink her own ship! It being brought to light solely to cost her the election was good enough for me.","commenter_a":"Truth be told she has been tried and found guilty November 8 she was sentenced RIP girlfriend","post_message":"In a meeting with The New York Times, President-elect Donald J. Trump said he would not take the investigations of the Clintons off the table."},{"comment_id":"531668583690388","commenter_b":"GO AWAY!","commenter_a":"This bitch needs to change, or else....","post_message":"Hillary Clinton just said all Christians have to change their beliefs. She is the one who needs to change her beliefs. Do you agree Hillary Clinton it out of line?"},{"comment_id":"10154521519049726","commenter_b":"I'm not especially interested in Mexico paying for it - our wall and WE NEED TO GET IT DONE!","commenter_a":"Trump will not only get Mexico to pay for a wall but he will get them to see it's value to them and want it!","post_message":"From Pence's appearance on my show today — Pence all detailed how he and Trump will make Mexico pay for the border wall:"},{"comment_id":"10153286881869197","commenter_b":"the mother better be caring about who next door than what on facebook the people she see everyday","commenter_a":"That not discipline that torture and making a mockery of her child in front of the world what if she cause harm to herself mom can discipline at home not on Facebook","post_message":"VIRAL VIDEO: A 13-year-old girl secretly posted racy photos to #Facebook. Check out what her mother did when she found out: @webpagelink What do you think? Too harsh... or effective punishment?"}]
