[{"comment_id":"1767519713512114","commenter_b":"She's a joke","commenter_a":"She is running the lowest, dirtiest campaign in USA history","post_message":"Clinton to voters: \"Reject the dark and divisive and hateful campaign that is being run by my opponent.\" What do you think?"},{"comment_id":"1297356170285821","commenter_b":"But a man still has no say over a woman's body. When men have the capability to carry a baby inside them, I'll gladly have a 3rd and let my husband experience the joys of pregnancy","commenter_a":"I think it is totally acceptable. They get to terminate like it's no big deal and others get to mourn that loss as an actual baby. Win=win situation.","post_message":"\"Forcing a woman to pay for a burial after she ends a pregnancy or experiences a miscarriage is not just absurd — it is an unnecessary burden and an intrusion on her personal beliefs.”"},{"comment_id":"999687850098947","commenter_b":"FGM - Female Genital Mutilation. The stats about it: @webpagelink","commenter_a":"The awkward moment where liberal values clash with Islam and no one wants to stand up for the gay man to avoid insulting Muslims...","post_message":"“My religion is very clear about what happens to gay people...\""},{"comment_id":"10153963536777235","commenter_b":"And a large percentage of illegal immigrants simply come here legally with a visa and just don't leave.","commenter_a":"The wall is absolutely absurd. See the ocean? You can use it to go around the big ugly wall. See the airplanes? You can go over the wall. Ask El Chappo about going under things. It's nostril flaringly stupid. Ancient technology. Pre airplane, backhoe and no ocean on either side. It would be funny if there weren't so many truly stupid people believing it. Gag, cough, hurl.","post_message":"BUSTED!"},{"comment_id":"10153937424304205","commenter_b":"This is why rape is so prevalent these days","commenter_a":"Every kids goes to thier mom in utah for this like this. Go spend a few years here then bitch about utah. Your making fun of thier Mormon culture... Look I've grown up in utah and I don't disagree that it's ridiculous. But your making fun of thier religion.","post_message":"A Utah high school student was having what he believed to be impure thoughts toward his female classmates when they wore their cheerleader uniforms in class."},{"comment_id":"890315697769072","commenter_b":"@username boycott the Shamrock inn, this pos. people are more dangerous than animals.","commenter_a":"If the bear was causing harm that's one thing. But he wasn't, he was minding his own business only to be stalked by this idiot. Honestly, why don't we hunt down this creep and see how he likes it?","post_message":"A sad day for the hundreds and thousands of animals lovers who were following the story of Pedals the bear.  The bear that became famous for roaming around New Jersey on his hind legs like a human has been killed during New Jersey hunt.  A hunter shot the bear with a bow and arrow.  The hunter has reportedly been stalking Pedals for three years."},{"comment_id":"1116798981710579","commenter_b":"She's feeding her baby. Shut the fuck up and move on","commenter_a":"Well it isn't racey,it's natural. This is ridiculous people need to approve of the way babies were intended to eat and get over it. When they do mom's will stop plastering feeding photos all over the internet.","post_message":"An interesting discourse here about nursing in public. What are your thoughts?"}]
