[{"comment_id":"10153519153652042","commenter_b":"Men go crazy over some pussy..smh","commenter_a":"Men gon wild..smh","post_message":"WANTED: This man allegedly shot the mother of his children twice in her face, police say."},{"comment_id":"10153315951826336","commenter_b":"Start the engines and suck her up like a seagull.","commenter_a":"What's wrong this photo? Nothing I can see....","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"10153316007267144","commenter_b":"Why doesn't she ever just answer the questions and stop telling everyone everything else!! Oh yeah, because she is the biggest liar ever!!!!!","commenter_a":"Way to go Hillary Clinton!","post_message":"The whole room joined her. Watch."},{"comment_id":"1740170942902081","commenter_b":"Yeah! Say that to UN! They should go to thoses places rather than bothering Philippines!","commenter_a":"Philippine leader must have nothing better to do... He just want to become famous for a little bit...Do you want to see humans right violations every day? Do you want to see people getting kill by the government? Do you really want to help people because humans right violations?? Go to Cuba!!! Go to Venezuela!!!!!move to Central America!!!! You idiot!!!","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"10153525456151438","commenter_b":"I've saved this to read for later because I'm in denial. I will always remember Richard Dawkins the way he was in his Growing Up in the Universe christmas lectures.","commenter_a":"He might be a brilliant scientist and author, but he's also a bigoted asshole too filled with his own sense of superiority to recognize that he can be as much of an intolerant hypocrite as the religious extremists he (rightfully) criticizes.","post_message":"He’s charming in his books, but he picks fights on the Internet."},{"comment_id":"1258599470822378","commenter_b":"Trump contributed millions to liberals and their policies and now says he wants to fix the mess that he funded. No thanks.","commenter_a":"i have decided its safer with cruz, he has a record, trump is all talk, there is no certainty how he would be as president.","post_message":"I think Trump going after Cruz is quite normal; it's understandable. But I think he's making a tactical error the way he's doing it. Whatever you want to say, Cruz is not a \"nasty\" guy. When you get into criticism, it better be believable."},{"comment_id":"10153189013365736","commenter_b":"Please don't insult scum. Scum must be very embarrassed to be compared to HER!","commenter_a":"Of course she did it. Using that poor boys abduction to get her face on T.V. What an evil woman n","post_message":"Kyron Horman's stepmother Terri Horman gives People magazine an exclusive interview about the disappearance in June, 2010 of the 7-year-old."}]
