[{"comment_id":"1202853869734641","commenter_b":"Muslim go home","commenter_a":"I don't believe we should elect a president so delusional he believes the Earth is only 6000 years old and that going to prison can make a person be gay...","post_message":"'I would not advocate that we put a Muslim in charge of this nation,' Dr. Ben Carson told Meet the Press."},{"comment_id":"10154546397896162","commenter_b":"Wow. What an inbred type comment. Do us all a favor and move into a cave with a black bear so he can eat your face off.","commenter_a":"dig this monster up and mail him back to the middle east with his family in tow.","post_message":"Visitors gather in Arlington National Cemetery around the grave of Humayun Khan, the U.S. Army Captain whose family has been in public dispute with Donald J. Trump... @webpagelink"},{"comment_id":"10157491368855389","commenter_b":"Now she needs to seperate from our government. A few years in the slammer or off to Syria where she'll be treated like every other woman.","commenter_a":"Don't care for your relationship with the Hil, but good for you on your separation from the Weiner. Anyone deserves better than that scumbag.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153203365116615","commenter_b":"your right she shouldn't be. she should be just shot!","commenter_a":"Good. She shouldn't be.","post_message":"Her baby was just hours old and still had his umbilical cord when he was found by a church custodian who heard him crying."},{"comment_id":"10154258847492014","commenter_b":"Go ahead and lose money for a day. It don't prove we need illegal's coming here, not when Americans of all colors need a job and are living on the street. Before some moron says something stupid, yes there is Americans that will do the jobs illegals are doing for les money.","commenter_a":"Isn't it illegal to employ illegal immigrants? You are not paying taxes for those employees right? The people Trump wants deported are Criminals! Are those the employees you have working for you? Why don't we work together to find a way to get the immigrants who want to become American citizens and follow our laws a way to do that, like most of our grand and great grand parents did.","post_message":"'It's snowballing into something huge and is sending a message about the importance of immigrants to the economy'"},{"comment_id":"996644970358551","commenter_b":"Arrogant bitch.","commenter_a":"And there are idiots out there that support this bi---!","post_message":"Whoa, Hillary Clinton put this reporter in her place."},{"comment_id":"10153171348750736","commenter_b":"Yeah, I want my 30 cents! in a check.. pronto!","commenter_a":"Instead of someone winning, split thee winnings with everyone who bought a ticket!!","post_message":"#BREAKING  No winner in tonight's Powerball Jackpot.  Wednesday's draw will be worth at least $1.3 BILLION.  Is there a billionaire's equivalent to the Dollar store??"}]
