[{"comment_id":"10157205870170354","commenter_b":"Cats don't like her.","commenter_a":"She can hate him all she wants but I bet more people in this world hate her pathetic ass. She is a washed up piece of shit who is completely irrelevant and means nothing to no one except maybe a few fucking cats","post_message":"Rosie O'Donnell's worst yet..."},{"comment_id":"10154848442742235","commenter_b":"Duh, you think! Not a difficult prediction","commenter_a":"I'm sorry but GOOD. I hope this country is brought to its knees. Then maybe. Just maybe people will get their heads out of their asses","post_message":"A sociologist who predicted the collapse of the Soviet Union and 9/11 attacks warns that American global power will collapse under Donald Trump."},{"comment_id":"660327817491130","commenter_b":"I love that woman !!!","commenter_a":"Read the artical..Where does Obama himself go after Sarah's family? What did I miss? I do not like Obama, (even saying his name makes me shudder) but I do not like miss information. What I read was the IRS is going after her dad.","post_message":"Obama is now targeting Sarah Palin's family, but she's not backing down. Way to go Sarah. We love you and your family, God bless. Can we get 30,000 'LIKES' for Sarah Palin?"},{"comment_id":"825278590901728","commenter_b":"And 11 million illegal aliens","commenter_a":"Please just go away, Cruz. You have nothing good to add to our country!","post_message":"“You cannot win a war against radical Islamic terrorism with an administration that is unwilling to utter the words radical Islamic terrorism.” - Ted Cruz"},{"comment_id":"1333824080002554","commenter_b":"@username love that red dress","commenter_a":"Jessica Phillips @username Jasmin Pluto this is great","post_message":"WTF does \"girlfriend material\" even mean?..."},{"comment_id":"10153058951371045","commenter_b":"send her to Hollywood she can act!! send to JAIL!!!!!!","commenter_a":"It seemed like a pretty fake cry to me, you know that baby was there just sorry she got caught!","post_message":" God. Oh God. I can believe I did that. Oh my God. My husband going to kill me. Oh my God! That's the reaction police body cameras caught when a frantic mother was confronted for leaving her 1-year-old daughter in a sweltering van parked in an Oklahoma Wal-Mart parking lot."},{"comment_id":"10152996410034330","commenter_b":"How about if we all carried guns to protect ourselves from worthless losers like this. Just kick them off the planet and they never will rob anyone else, thats for sure...","commenter_a":"Yes Paulette in a perfect world one could go to the ATM, grocery store, or anyplace else anytime at all, however in the real world there are criminals and scum who do prey on people when they make themselves vulnerable. Police and other security people cannot be everywhere to ensure nothing ever goes wrong. It's just common sense to use caution and good judgment when out alone.","post_message":"FRIGHTENING VIDEO: A woman who pulled up to an ATM was kidnapped at gunpoint and forced into her trunk and the whole ordeal was caught on video ---> @webpagelink The suspect even gave police a good look at him"}]
