[{"comment_id":"879492268908016","commenter_b":"I wouldn't vote for the loud mouth scumbag for trash collector. She is the most unlady like female ever. All she does is run her big (I mean BIG) mouth. She just needs to go away with her non American husband and disappear.","commenter_a":"Donald","post_message":"There's a huge movement supporting Michelle making a run at POTUS in 2020. Who would you vote for, Donald Trump or Michelle Obama?"},{"comment_id":"1034820419922610","commenter_b":"Fuck her","commenter_a":"Oh please she has an easy life it's the soldiers and other people have it hard and uncomfortable not her","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"10153655047616130","commenter_b":"When someone makes those comments, they will learn what my bitch face REALLY looks like!","commenter_a":"Everyone: Are you okay? Everyone: You look tired. Everyone: You look upset. Everyone: You look confused. Everyone: Are you mad at me? Everyone: Why are you mad at me? Me: IT'S JUST MY FACE!!!!! This has been an accurate description on what it's like to live with Resting Bitch Face.","post_message":"Scientists say resting bitch face is real."},{"comment_id":"812894658799894","commenter_b":"GI, Hillary, go.","commenter_a":"Hillary is a strong woman and won't tolerate any Republican CRAP.","post_message":"This is Hillary in full badass mode. You may not love her, but you should love her passion!"},{"comment_id":"1222871987767261","commenter_b":"@username no yo are for supporting that muslim scum","commenter_a":"HES DONE MORE FOR THE USA THEN OBAMA DID IN 8 YRS YOU PPL NEED TO GET A LIFE AND MOVE ON","post_message":"BREAKING NEWS: President Trump holds surprise press conference at the White House"},{"comment_id":"10154472139428271","commenter_b":"@username always cleared denotes nothing about guilt .","commenter_a":"I don't care how it happens the cops will always be cleared until we say no more.","post_message":"His mom called police because she knew he was in trouble. But minutes later her son was dead. The DA has cleared the officer involved in the shooting because the suspect had reached another officer's gun and fired a shot."},{"comment_id":"1077965912287650","commenter_b":"What policy? The only policy she had was to make money for herself!!!","commenter_a":"HILLARY IS DISTURBING","post_message":"...says the Benghazi butcher and the woman who transferred 20% of all U.S. uranium (the stuff used to build nuclear bombs) to Putin's Russia as 9 investors in the deal funneled $145 million to the Clinton Foundation."}]
