[{"comment_id":"10155811623205594","commenter_b":"You are $hit. This is about a little girls recipe. keep your poitical agenda where it belongs. in the crapper","commenter_a":"Must look like SH!T...","post_message":"Barack Obama told her it was a standout dish for him."},{"comment_id":"909912449057779","commenter_b":"She is a CRIMINAL LIAR !!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Poor, really, couldn't they spell abysmal?","post_message":"Well if the shoe fits..."},{"comment_id":"10153042151741680","commenter_b":"Aww, she don't like jail, maybe , I love being able to use this line right now, maybe if she wouldn't break the law, she wouldn't be in jail. Isn't that the line republicans always use.","commenter_a":"Davis is being duped by her attorney. As long as she refuses neither to resign her office nor to do her job, her attorney is the only person who's winning. She is a pawn.","post_message":"The controversy swirling around Kentucky county clerk Kim Davis is not letting up."},{"comment_id":"10153513530884456","commenter_b":"Yeah right. @webpagelink","commenter_a":"I have learned through the years that you initially say what is in your heart. Her statement trying to brush away her post is BS and everyone including herself knows that. Her feelings will not change, she will simply do a better job of hiding them. The commission and the public should call for her resignation.","post_message":"An elected Montgomery County official has released a statement following a controversial post on Facebook, which has sparked outrage among Montgomery County leaders and citizens. @webpagelink"},{"comment_id":"1368996799860037","commenter_b":"She's an ugly see hag and formerly a man.","commenter_a":"Kellyann is wearing some weird kind of uplift bra in this picture.Her tits actually hand down and get crushed between her thighs. She tires to hide them and never goes to the beach because they are full of zits and varicose veins.","post_message":"LOL"},{"comment_id":"10153898128831509","commenter_b":"Stay home until your baby is weaned? Seriously stop! If you want to live some backwards, 1950s lifestyle, you go right ahead. While you're at it, why don't you just keep your opinions to yourself, since that's what a nice housewife would do, right? Give me a break. This misogynist refused to give her a break. There is also nothing to be modest about when it comes to breast feeding or pumping. Maybe you're the one who should work on modesty when you're over there over sexualizing a part of the female anatomy that is meant to help sustain life.","commenter_a":"She should have Left the room To Pump! Really Embarrassing for the female and males in a business Meeting! Have you no Modesty or even Selfrespect ! Stay home till your baby is weaned !!","post_message":"Donald J. Trump's attorney says Trump's language wasn't about her decision to pump breast milk, but solely on where she chose to do it: @webpagelink"},{"comment_id":"10155818590289657","commenter_b":"Democrats always want more. They're parasites .","commenter_a":"Who cares what the democrats want. I am so tired of them making demands. They are nothing more then a pack of bullies and I am tired of them. They should try to fix themselves rather than telling other people how to think.","post_message":"\"Ridiculous shame.\""}]
