[{"comment_id":"10153270797394342","commenter_b":".","commenter_a":"Climate change. The earth is warmer than it has ever been, which means bacteria, viruses, diseases, all have the perfect breeding ground to multiply in larger numbers than we have ever seen before.","post_message":"LEGIONNAIRES' DISEASE LATEST: As New York City grapples with its worst-ever outbreak of Legionnaires' disease, health experts are trying to understand why reported cases of the illness have risen across the country in recent years."},{"comment_id":"1055483257833554","commenter_b":"Hell no lol","commenter_a":"@username Marcela Guzman-Medina","post_message":"NIGHTMARE: What began as a normal day at the beach ended with amputation after a man contracted a flesh-eating virus."},{"comment_id":"914235348632517","commenter_b":"So sad","commenter_a":"He'll claim it was medicinal for his PTSD.","post_message":"Bowe Bergdahl, the U.S. soldier who was released in a prisoner exchange in Afghanistan for five Taliban detainees, wound up in the middle of a pot raid earlier this week @webpagelink"},{"comment_id":"10154647718578132","commenter_b":"Ahhhh...women tearing other women down! How mature!","commenter_a":"At least she did the mop on her head somewhat decent tonight","post_message":"First Lady Michelle Obama delivered an unusually personal and emotional speech at tonight's #DNC."},{"comment_id":"10153599310496037","commenter_b":"I feel sorry for his wife, NO money in the world is worth having to sleep beside that every night.","commenter_a":"Arise Trump Republicans! Demand that all the other lame Republicans running for the GOP nomination quit AND bow down to The Don.. and boycott Fox News.. (^^^) (y)","post_message":"Donald J. Trump, angered by Megyn Kelly's line of questioning during the GOP debate, later told CNN that she had \"blood coming out of her eyes, blood coming out of her wherever.\""},{"comment_id":"773502486092553","commenter_b":"The profit mohammad is a pedophile goat raping POS.","commenter_a":"Even Hitler would hate Obama.","post_message":"OBAMA THROAT: FOLLOW ISLAMIC MONEY? If you look into Obama’s foreign student status the subject is quite involved. It is not just if he was a foreign student, but was he an American posing as a foreign student? Is Obama an American that received funding from foreigners? Did he just get student loans and work hard? Is Obama keeping his records confidential to cover something even bigger than Obama himself? Ask yourself this question, would opening up Obama’s Harvard records cause people to closely examine the influence of oil rich Arabs that may want to impose Islam on the United States? In 1979 Vernon Jarrett, father in law of Valerie Jarrett, wrote about expecting Arabs to help disadvantaged black students. Khalid Abdullah Tariq Al-Mansour, formerly known as Donald Warden, had apparently been working with “rich Arab kingdoms” for this very purpose. Jarrett insisted that this is coming. @webpagelink So a ..."},{"comment_id":"913575248773260","commenter_b":"Hillery is a known lesbian predator get it out and end her run to destroy this nation","commenter_a":"God i feel sorry for her","post_message":"Sex slave survivor Cathy Obrien swears that Hillary Clinton raped her when she was a child in Arkansas @webpagelink"}]
