[{"comment_id":"10153206578922483","commenter_b":"Lol Caitlyn, you poor misguided... Whatever you are. I can't tell if you're a child or just an uneducated woman.","commenter_a":"But, muh freedoms...","post_message":"Angered after an argument over his smoking, the customer went to his vehicle and retrieved a 9-mm pistol, which he used to shoot the employee once in the head, according to reports."},{"comment_id":"10153823675392235","commenter_b":"Truth hurts bitches!","commenter_a":"Oh you f****** douchebag liberals have your head so far up your asses if it wasn't for us good white heterosexuals paying all the bills for your lazy asses because you want everything handed to you for free because you believe you're entitled to everything that anyone else has and not willing to work your ass off for it Donald Trump is point on need to shut our f****** borders down. If that's racist then I'm proud to be a racist and stand up for my white skin! You f****** liberals can f*** off and die!!","post_message":"This is truly hilarious."},{"comment_id":"1077871268936068","commenter_b":"I guess being a lawyer, U.S. Senator and Secretary of State aren't real jobs?","commenter_a":"So fun to meet someone whose actually worked a real job..eh Hillary?","post_message":"The best part of being at Caesar's Palace at midnight? Meeting the amazing staff."},{"comment_id":"10153335574974384","commenter_b":"A complete waste of good female human flesh.","commenter_a":"Communist scum.","post_message":"Celebrating Women’s History Month by honoring women of 'Supreme' achievements! Indeed, an inspiration to us all."},{"comment_id":"960457477322681","commenter_b":"Hunt these cops! Good Germans would say this!","commenter_a":"police state","post_message":"Officer Thomas Webster was just found not guilty of assault... even though he was caught KICKING and UNARMED MAN IN THE FACE as he obeyed police commands.  This is America, 2015. Not the Jim Crow Era.  From (Y) Counter Current News - MBD"},{"comment_id":"10153086168389411","commenter_b":"that is why she is the ex","commenter_a":"Hell hath no fury like a woman scorned.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"968012613239597","commenter_b":"Wtf? This is annoying. She was extremely fat, tried out for a show, lost all kinds of weight and is now complaining. If it was horrible she should have left. Choices! I'm sure this wasn't the first time she felt humiliated. I mean come on... She was all about it when she was trying to win some money... She sucks","commenter_a":"Totally off topic but her mannerisms remind me of Ginny Goodwin as Gigi in He's Just Not That Into You","post_message":"The way she describes her experience competing in the show ... it's so messed up."}]
