[{"comment_id":"10155940183045354","commenter_b":"Does she have an extra kidney. You really only need one. Never mind it comes from her scummy body. Monster","commenter_a":"You go Hollywood stars. I wouldn't put anything past you stupid people. If you agree to selling aborted baby parts, I can only imagine how many times you all have done it. It is no wonder I can't stand almost all Hollywood stars.","post_message":"Check out the Instagram video Scar Jo appeared in for Planned Parenthood"},{"comment_id":"638058836332906","commenter_b":"Keep praying! @username is a Warrior for Christ!","commenter_a":"I was born and raised in Pennsylvania, and I'm hoping and praying that come election day the good people of PA will vote for a Presidential candidate who is a life long Conservative, versus an Entertainer!","post_message":"For seven years we've seen an administration that abandons our friends and allies.  That ends when I am president!"},{"comment_id":"975510729232372","commenter_b":"Those animals have to be destroyed and kept out of America","commenter_a":"TIME TO GET RIGHT","post_message":"What radical muslims are allowed to do to their own families is absolutely horrifying. We cannot let this ever happen in America no matter how hard these radicals try to impose their ideologies on our great nation.   SHARE if you agree that this disgusting practice needs to be wiped off the face of the earth!"},{"comment_id":"10154575005093645","commenter_b":"Beyonc sucks..adele is 10 times the singer","commenter_a":"It's crazy because BEYONC deserved that award. Everyone knows it.","post_message":"She beat Beyonce in the top three categories with her comeback album , and repeated her accomplishments from 2012, when the British star also won album, song and record of the year at the Grammys.  She used her speech to honor Beyonce and her groundbreaking  album, which was also nominated."},{"comment_id":"1532770816783042","commenter_b":"You are a gross old creeper anyways. Have fun jerking off the rest of your life.","commenter_a":"Fuck black Lives matter!","post_message":"Black Lives Matter is a racist hate group! Share if you agree!!"},{"comment_id":"10152827185410047","commenter_b":"Welfare mothers should not get any money either","commenter_a":"like","post_message":"Planned Parenthood is the leading abortion provider in the United States while continuing to receive millions of dollars in federal government funding each year.   Our tax dollars shouldn't be funding the slaughter of innocent unborn babies. SIGN & SHARE to defend life and defund abortion: @webpagelink"},{"comment_id":"741809245917684","commenter_b":"THOSE 3 BITCHES...ARE GETTING THE SHIT GANG BANGED OUT OF THEM NOW.","commenter_a":"IS is recruiting sluts for sex only son","post_message":"Aqsa Mahmood, 20, left her home in Glasgow in 2013, and married an IS militant in Syria."}]
