[{"comment_id":"516357545155952","commenter_b":"I'd be pissed,then sue everybody.Which I'm sure she'll do.","commenter_a":"How did they get the right to determine her mental state?","post_message":"Via Filming Cops -- How would you feel if within 24 hours you go from being a successful corporate executive to being forced to become a patient at a mental ward, stripped naked, where no one believes you? It feels straight out of a psycho thriller, but this is what cops did to her."},{"comment_id":"1011632632284104","commenter_b":"yall nasty","commenter_a":"Emmanuel Esquivel @username","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153923340133635","commenter_b":"Vicki C: So true re immigrants across the border. They caused more than half our hospitals and emergency rooms to close in Los Angeles years ago!!! Now, it's difficult for REAL Americans to get care when they require it. Just disgusting! Add to that, the planeloads of moozies Ovomit has been bringing in for years and I'm surprised any healthcare is available at all! Even our Vets can't get care and they should be first!","commenter_a":"Border Patrol Agent Defies “Gag Order” to Expose Obama The massive exodus of illegals crossing over into Texas and other border states is becoming more than local communities can handle. This influx of illegal immigration is causing emergency shelters, areas typically designated for use during catastrophes, to overflow, leaving local government scratching their heads as to what to do with immigrants who have no place to go and can’t be deported back to their home country.... Border Patrol agent Hector Garcia accused the Obama administration of “aiding, abetting and facilitating the smuggling of illegal aliens across the border.” In an interview with CNN, Garza said the current influx of illegal immigrants is “organized” and “orchestrated” by the drug cartels. Additionally, he said the federal government is giving illegal immigrants a “free pass.” He said the feds are using the equivalent of the honor system in asking illegal immigrants to later ...","post_message":"#1 Republican President Teddy Roosevelt was also a proponent of eugenics theories by Planned Parenthood founder Margaret Sanger"},{"comment_id":"10154892796939927","commenter_b":"Hi Kay Facebook Animal Adventure Park","commenter_a":"When the hooves start to come out they are gonna go live from a ground cam, if u like their page u can turn on notifications for videos so u will get a notification to make sure u don't miss it :)","post_message":"LIVE: Giraffe Cam! We continue to watch and wait for April the giraffe to deliver her new bundle of joy."},{"comment_id":"10154315697078984","commenter_b":"That whore needs to go to hell","commenter_a":"She DOES NOT HAVE THE AUTHORITY TO DO THIS. ALL WE NEED TO DO IS IGNORE HER. KEEP BUYING IT SHE WILL BE GONE IN 8 MONTHS","post_message":"Michelle Obama has been messing with our children's food for years, but now she's gone to far.  She just banned one of America's favorite cereals, and there's not a darn thing anyone can do about it.  It's time to throw her and her America-hating husband out of the White House for good."},{"comment_id":"10154346437467464","commenter_b":"Because of Ted and politicians like him, we are going to have Hillary for president. There won't be a America left for another president. They will bring in millions more illegal aliens that will vote democrat and the republicans will be an endangered species.","commenter_a":"Too bad Cruz's Pride is giving it away to the democrat socialist party!!!","post_message":"Texas is blessed to be home to so many of our men and women in uniform, and El Paso’s Fort Bliss is a crucial base for those who serve on the front lines to keep our entire nation safe and secure."},{"comment_id":"10154809033061320","commenter_b":"Whoopi goldberg should move now she is very hard on the eyes","commenter_a":"Hillary 2016❤️❤️","post_message":"REPLAY: Donald Trump in Raleigh, North Carolina."}]
