[{"comment_id":"10153904664428010","commenter_b":"Illegals deserve to be deported not unseat Americans for health care.","commenter_a":"Anyone who has ever worked in a hospital could have told you. So many before the ACA never would have qualified or been able to afford. Everybody in this nation deserves access to our health care system.","post_message":"California's version of Medicaid will test the power of the Affordable Care Act."},{"comment_id":"936644226390980","commenter_b":"The typical holiness young woman will argue with a tree and maybe this is why they got together and removed this mother from the church the reason refused to listen to anyone else way of thinking you be bless and I hope you live as long as the 103, may the same happen to you","commenter_a":"From what the article said... she thinks he's trying to change the denomination of the church. .. this beautiful 103 mother misunderstands that Holiness is a way of life.. not a denomination.. the Pastor could have handled this better. .. there's no need to put her out of the church. . To be sanctified means to live a life separated from sin.. that's not a denomination either. .. sounds to me that teaching through love and kindness is in order.. people seem to fear what they don't understand. . To call her names and disrespect her by leaving her in a dark church is not right and does not reflect Holy living . They need to repent of that.. always respect your elders regardless. .. but also remember .. just because your old does not mean you know all the way of the Lord... no one does.. that's why we ...","post_message":"A 103-year-old Georgia woman was banned from the Elberton church she’s served for 92 years after she voiced concerns about the pastor’s sermons.  After ignoring the ban and attending church the weeks after getting the letter, the pastor dismissed the service and left her sitting in the pew with the lights off. Police were notified, but refused to throw a 103-year-old woman out of church.   She was also subjected to slurs from their former fellow churchgoers. MORE ----->  @webpagelink"},{"comment_id":"496937747163472","commenter_b":"Put the hag in prison","commenter_a":"I like that picture of Hilliary, 'hands up, bitch, you're under arrest.","post_message":"New documents released shows incriminating evidence that could put Hillary away for good.  She is a terrorist. We need to act now.  Should Hillary Clinton be arrested for treason?"},{"comment_id":"1420936454624649","commenter_b":"I hope that this administration will figure out how to keep us safe without becoming totally isolationist. Not all immigrants or Muslims are terrorists. Weed out the bad but don't turn away those who honestly need our help and who only want to make this counrty a better place.","commenter_a":"Do you know you have done more than every other country to help?","post_message":"Senior Politics Writer John Haltiwanger is at JFK International Airport where there's a massive protest against President Donald Trump's refugee and Muslim traveler ban."},{"comment_id":"10153364798139877","commenter_b":"Robin! Amen! Everybody wrong for agreeing with that old woman!","commenter_a":"She is so wrong , she is not the Pastor nor is she the head of the Church. So far out of place in the Church , just because you put in a offering or your family started the church its not your church nor are you the Pastor. Dang shame! Guess she wants to go to hell in a hand basket.","post_message":"103-year-old woman who was kicked out of her church clapped back...now the pastor is in hot water. Watch what happened next below.   Grio fam, we're glad she put up a fight. What's your reaction?"},{"comment_id":"826031280920782","commenter_b":"She's just disgusting to look at..","commenter_a":"About time now she can pack so she can leave !!#!!","post_message":"Liberal trash has no place on tv.  This is the best news all year.  Do you think Whoopi deserves to be kicked off the air?"},{"comment_id":"10156419008515725","commenter_b":"#VoteTrump #TheDonald #ArrestObama #TrumpTrueAmerican #TheTrumpArmy #TrumpNow #MakeAmericaGreatAgain #TrumpFan #TrumpTrainSNL #TrumpForPresident #CompetentTrump #ItsGonnaBeYuge #NoRefugees #GetOnBoardTheTrumpTrain #BuildTheWall #TakeAmericaBack #Trump #OurVeteransMatter #WomenForTrump #TrumpNation #GeorgiaForTrump #CitizensForTrump #TrumpBreathOfFreshAir #MerryChristmasPresidentTrump #LoveTheDonaldsTone #BalancedBudget #TermLimitsForCongressAndSenators #GodBlessDonaldJTrump #GodBlessAmerica","commenter_a":"Americans are sick and tired of being on the back burner . We are the American people who work and should have a voice . We need a President whos gonna have our backs and Trump your it .","post_message":"People like what I say, people respect what I say. I started a discussion that needed to happen. #GOPDebate"}]
