[{"comment_id":"388733381251257","commenter_b":"ABSOLUTELY YES !","commenter_a":"Real need/ felt need.","post_message":"This could be bad news for some people on food stamps."},{"comment_id":"1075906369172131","commenter_b":"These people ARE violent CRIMINALS!","commenter_a":"You're crazy sue","post_message":"WATCH: Protests in Charlotte, North Carolina after a man was shot, killed by an officer in the University City section. [WARNING: This live video is RAW and UNEDITED. Viewer discretion is advised.] Read more: @webpagelink"},{"comment_id":"10156328907740354","commenter_b":"This cheap harlot is getting a high price for her prostitution. I can only expect less from someone as low as her.","commenter_a":"Nasty skank!","post_message":"Surely Scarlett Johansson is working on a Koran version as well. Surely that's happening, right?"},{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation. It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation. Read the whole story at Reverb Press HERE: @webpagelink"},{"comment_id":"10154223685116409","commenter_b":"@username it is what it is, he is president elect, I did not vote for him but we always need to see the bright side of things.","commenter_a":"Everyone should give him a try, ACA is unaffordable for middle class families.","post_message":""},{"comment_id":"10153238674498984","commenter_b":"this bitch will have blood on her hands","commenter_a":"good now i have more reasons to cut myself and attempt suicide.... this really set me off ..","post_message":"What she said about \"fat white Americans\" and \"racist white conservatives\" is absolutely sickening... Are you outraged by these comments?"},{"comment_id":"1830155707222526","commenter_b":"@username ...Well, CA did vote her out...but the rest of America did!!! Oh, HAPPY DAYS!!!","commenter_a":"This \"Deplorable\" American Christian is voting for TRUMP, I live in California and all my neighbors and friends are voting for TRUMP...We are tired of the lies and corruption of career politicians!!!!","post_message":"Matt Walsh: A Clinton win won’t be a victory for women but a victory for corruption."}]
