[{"comment_id":"1345080275507252","commenter_b":"I cannot believe how many selfish bastard whites live in this country that they stole from Mexico with a trumped up phony war. These selfish bastards all belong to the Repubtard party. which we need to destroy.","commenter_a":"Why do we have to pay for every disgruntled citizen from every country in the world.....you politicians have us deep in debt but want more from us....All you are doing is enabling irresponsible government around the world.....everyone sees the US as the international welfare program....we have too many of our own citizens who need to be cared for....and their violence is no worse than our own....","post_message":"I hope the administration reconsiders these raids. These children and their families are fleeing extreme violence in Central America and they should have a chance to seek relief, which is why I introduced the “Fair Day in Court for Kids Act” — a bill that mandates counsel for these vulnerable individuals. Instead of separating children from their parents, the administration should continue to address the violence and instability in the region that is forcing these families to leave."},{"comment_id":"847757325414844","commenter_b":"fly your flag and tell these invaders to get out","commenter_a":"Let him fly his flag, this is America","post_message":"There is nothing threatening about an American flag.  He wants to show his pride for his country, let the man!  Do you think he should be able to fly his flag?"},{"comment_id":"10153553750251051","commenter_b":"You are a sneaky bitch that can not fool me you brought up color stop with the bullshit. @username","commenter_a":"What do you expect from a repeat offender? Hey justice system you spineless useless system! It's because if your stupidity and loop holes that got that child a life sentence. Those children were given a death sentence by this useless pos. This vile inhumane waste if life still breathes because of your inept logic. If that were my child, I'd hunt that diseased vile pos down and set his black ass on fire...","post_message":"It was already bad enough that this man raped a 14-year-old and a baby. Then it got even worse."},{"comment_id":"1713989815484209","commenter_b":"The Senate's duty is to listen to its constituents. Therefore it should or should not act on this matter based on what they know we want.","commenter_a":"Oh how quickly Obama forgot that he filibustered the nomination of Supreme Court Justice Samuel Alito in 2006. Hypocrite!","post_message":"'I have fulfilled my constitutional duty. Now it's time for the Senate to do theirs.'   WATCH: President Barack Obama says if the Senate does not vote on SCOTUS nominee Merrick Garland, 'our democracy will ultimately suffer.'"},{"comment_id":"844804189043491","commenter_b":"Bye bye bitch","commenter_a":"never did like the ugly bitch","post_message":"Liberal trash has no place on tv. This is the best news all year. Do you think Whoopi deserves to be kicked off the air?"},{"comment_id":"10153429350692623","commenter_b":"She would have gotten her old azz beat. Period!","commenter_a":"My question is what did these people do to provoke the volunteer? Why did they not comply with her request to leave and then they could have gone to someone else for help. I have seen people treat the volunteers like dirt- maybe this woman couldn't take it any longer. Don't judge unless you were there and saw the entire event unfold.","post_message":"Wake Forest Baptist Medical Center is responding to a disturbing incident caught on camera involving one of their volunteers."},{"comment_id":"989615211072231","commenter_b":"Awesome","commenter_a":"WTG BOLTS! :-) :-)","post_message":"GO BOLTS! Tampa Bay Lightning wins Game 2 of the #StanleyCupFinal, ties series 1-1!   WOOOOOOO HOOOOO! Missed a moment? Check out the game details: @webpagelink"}]
