[{"comment_id":"517382478450045","commenter_b":"Anyone know whats happening in Europe? Muslim takeover. By sheer numbers they are over running countries and residents are falling back on rioting to fight the takeover. Muslims come into a country and this usually ends up in war and destruction of lifestyles and sovereignities. The US would be better off without them sad to say.","commenter_a":"They have NO BUSINESS in our Government!!!! Stop Muslim Take Over!!!!!!","post_message":"This is not unexpected. Click to Read ALL the SICK Details..."},{"comment_id":"10152771532479342","commenter_b":"His other girlfriend","commenter_a":"Who do you think he's talking to on the phone.... his wife....","post_message":"The game is tied in the fourth quarter and you're not even paying enough attention to realize you and your girlfriend are on the kiss cam?   There are many things wrong with this sports 'fan,' and he gets what's coming to him.    SEE VIDEO --> @webpagelink/  What do you think -- real or staged?"},{"comment_id":"917056878424478","commenter_b":"#fuckhillary she and the DNC planted this upon us","commenter_a":"#fucktrump","post_message":"Friday, January 20, 2017: Presidential Inauguration of Donald Trump & Mike Pence - LIVE on C-SPAN, C-SPAN Radio & @webpagelink"},{"comment_id":"1669850779963439","commenter_b":"Fat bastard","commenter_a":"Another big jerk, oh bye the way michael were not muslim","post_message":"CLOWN SHOW."},{"comment_id":"1420716084688108","commenter_b":"Lol who said I support the wall..guck the wall just spend more deporting illegals... end of story","commenter_a":"Warren is a liberal piece of fucking shit!!!","post_message":"Republicans did NOT want you to hear this letter. Pass it on!"},{"comment_id":"10154229049319369","commenter_b":"Being against Christians isn't a religion.","commenter_a":"I am against Christianity so that means I can not serve Christians in Mississippi because it goes against my beliefs?? This law is stupid.","post_message":"The measure allows churches, religious charities and privately held businesses to decline services to people whose lifestyles violate their religious beliefs."},{"comment_id":"10156580556107228","commenter_b":"No sweetheart they don't have no idea what fighting for their rights is about. I don't recall any civil wars that were fought to free the transgender. How many transgender have had crosses burned in their yards, how many transgender have been hung in trees? How many transgender were murdered for being transgender? Special kinda of stupid are the folks that think that the struggles the black community have faced and continues to face compares to Johnny who wants to wear a dress!!!!","commenter_a":"Sorry but to try to compare the two is insulting. I don't recall transgenders ever being enslaved, I don't recall transgender ever having to fight for their civil rights. Being transgender is a choice you make, wether you feel you were born this way or not is debatable. Black is black, no debate there.","post_message":"I sat on the plane this week with a beautiful family.  The mother introduced her three children to me and opened up to me that her youngest daughter is a trans child. She is actually a documentary producer and is working on a film about trans children, a film that will try to confront and dispel the wide spread fear, ignorance and bigotry that surround trans Americans. She allowed me to watch the trailer and the beauty, struggle and courage of the families she highlighted resonated with me deeply. I pray that we all grow more courageous in our empathy, that we all seek to understand each other more and that we all become better agents of love and justice. As for me, I condemn the actions of the Trump administration in their reversal of transgender student protections. I will not yield in the fight for equal rights and equal protection under the law. We all owe an obligation to those freedom fighters who fought for civil rights, women's rights, workers rights and human rights over the past generations. We can not pay those heroes of love back, we can only pay it forward. Now is the time that history calls on us to make for a better future for all. #protecttranskids"}]
