[{"comment_id":"930444230329383","commenter_b":"And big SUCK IT to rupert & roger, FUCK the both of ya weasels!","commenter_a":"Awesome","post_message":"The folks over at Fox News had hoped to bully Dish Network into giving their toxic channel the cheap air time it demands, but going into a second week of being banished from the television lineup is only proving that Dish has more clout."},{"comment_id":"1010496572318771","commenter_b":"'@username You should be ashamed of yourself, liberal whore.","commenter_a":"'Trump rallies are becoming increasingly dangerous to protest' Then stay the fuck away. You didn't see white folks showing up at Obama rallies, shouting racist bs. Goes to show the intellect of these animals. Fair is fair, equality for all! My ass! History has proven that equality never stops when things become equal. It's supremacy these animals want at this point.","post_message":"Happening NOW:"},{"comment_id":"556591217846893","commenter_b":"America needs alot less hate as well as banning corrupt career politicians, NWO,Open borders to fill there own greedy pockets Clinton the lieing witch with soldiers blood on her hands","commenter_a":"To all the hateful mean trolls, seriously and you call yourself an American. Maybe you skipped the part in school that teaches you to be human and love humanity. You can disagree with political views but when you just get mean spirited about a person...thats just wrong!! I think Americans need more love and a lot less hate!!!! Next time you call someone something, look into the mirror and see if you ever sinned yourself. 'Those without sin...cast the first stone'!!","post_message":"A smiling Hillary Clinton just arrived on Capitol Hill for meetings with Democratic lawmakers. @webpagelink"},{"comment_id":"10157985698230594","commenter_b":"Hillsborough residents don't want the riffraff coming through their fancy neighborhood? Mountain lions can eat your pets.","commenter_a":"And the point is?","post_message":"Peter Rauenbuehler has posted video online showing a mountain lion attacking a deer and then dragging the limp animal away from his Hillsborough home."},{"comment_id":"485248075011731","commenter_b":"thats one ugly he bitch","commenter_a":"To damn bad","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"588617174663431","commenter_b":"Hillary Clinton is a criminal!","commenter_a":"Republican's are the enemy of millenials. They have been ruining America since before we were born. It's time to vote blue and vote for Hillary. We need to stand up against hate and bigotry. #Hillary2016","post_message":"'And believe it or not there are even some Republicans in Congress who have already said they want to start the impeachment process,' President Obama says."},{"comment_id":"10153382589804411","commenter_b":"shutup bastard","commenter_a":"Fuck them they are just as much terrorists as Isis","post_message":"we are facing a kind of danger that is unprecedented in history, which targets humanity itself,"}]
