[{"comment_id":"471937499632872","commenter_b":"Give it up lady. Your lies won't work with me.","commenter_a":"He's what a president should be and it's a shame the next won't try half as hard as he did.","post_message":"'When they describe their youth and their childhood, these are young people who made mistakes that aren't that different from the mistakes I made.'"},{"comment_id":"10153961468913132","commenter_b":"'@username she better step away from my man","commenter_a":"'@username @username @username I'm sure you've already heard, but it's foreal.","post_message":"So it IS true! Happy for Gwen Stefani and Blake Shelton. <3"},{"comment_id":"455180294641926","commenter_b":"Why don't the Italians just feed them to the the lions or do they only do that to Christians?","commenter_a":"It's karma for Columbus.","post_message":"Nearly 6,000 people were rescued just this weekend alone."},{"comment_id":"794329380660118","commenter_b":"Away with dumb blonde teleprompter readers, away!!!","commenter_a":"Considering it's the only one she has, you'd think she'd find a better use for it.","post_message":"Sorry, Fox News! The 2015 Obamacare enrollment numbers just came out, and once again they smashed expectations.   Read more here: @webpagelink Image by Occupy Democrats."},{"comment_id":"1242790859084298","commenter_b":"She's a wife and mother. Needs to grow up, cover up, and act like a lady!","commenter_a":"Fortunately the majority of police officers are good, hard working people serving/protecting their communities. Are there a few bad ones? Of course! The media really hypes the bad police officers, the knuckle heads looting and destroying communities 'in protest'. Not highlight the wonderful police officers laying their life on the line to protect our butts. Not highlighting the people that truly feel stepped on and are peacefully coming together with all to promote positive changes. 'Be the change that you wish to see in this this world.' This is what I live by and teach my children. We should be brought together by love, not torn apart by hate.","post_message":"#EntertainmentNews  And the #BoycottBeyonce battle continues...the singer is being accused of using her recent Super Bowl performance 'to divide Americans by promoting the Black Panthers and her antipolice message.'  Do you agree?"},{"comment_id":"10153345194546833","commenter_b":"Tell this liberal she can keep her money. I","commenter_a":"They just need to come take them","post_message":"The Hill:  Congresswoman Rosa DeLauro is expected to reintroduce the the 'Support Assault Firearm Elimination and Education of our (SAFER) Streets Act' which would offer gun owners tax breaks for voluntarily turning in 'assault rifles' to local police departments.    'Assault weapons are not about hunting, or even self-defense, says Rep. Rosa DeLauro (D-Conn.).  is no reason on earth, other than to kill as many people as possible in as short a time as possible, that anyone needs a gun designed for a battlefield."},{"comment_id":"10154658986437034","commenter_b":"Stop illegal immigration!!!!!!!","commenter_a":"Is it too early to begin impeachment proceedings???","post_message":"THE WHITE HOUSE. We are now exactly 3 weeks into the Trump presidency. Thoughts?"}]
