[{"comment_id":"2035328873360726","commenter_b":"Touch my wife and you're a dead goat-humping mf.","commenter_a":"So this must be why American women want muslims in our country?","post_message":"SHARIA LAW BEATING Of Woman Captured On Cell Phones By Cheering Crowd…Woman Savagely Lashed With Cane By Masked Men…Screams In Pain Before Collapsing The smiling women in the large crowd is almost equally disturbing… ***WARNING***VIDEO IS VERY GRAPHIC And DISTURBING!"},{"comment_id":"10153658403039726","commenter_b":"OK !! There are 42,000,000 illegals in this country, squatting out \"anchor babies\" like cockroaches---WHAT\"S HIS PLAN.","commenter_a":"Carsons' stand on illegal aliens is almost as bad as obamas. Vote what's best for America---Trump.","post_message":"WATCH: Carson Jokes: I Heard Trump Dropped Out!"},{"comment_id":"1163610097050858","commenter_b":"So you would prefer a lying heartless uncaring self serving witch? Who tried to play down her predator husband's affairs.","commenter_a":"Trump is only for Trump and now the Republican Party is his new trophy...Good Luck GOP....I am out of there for good","post_message":"More great content from our friends over at Team Trump!"},{"comment_id":"10153467458013984","commenter_b":"Sick of hearing about Bruce and the damn Diggers","commenter_a":"enough of this crap...give it a rest","post_message":"If what Rush Limbaugh says is true, this whole Jenner thing could be just the tip of the iceberg. Scary... Do you think the liberal media has an agenda in pushing the Jenner story?"},{"comment_id":"10156112188370354","commenter_b":"this woman is an idoit drinking kool aid","commenter_a":"This woman looks exactly as Bruce Jenner, do we care what she says??? Nooooo.","post_message":"Enforcing the law fairly and equally is not \"beating up\" on poor illegal aliens. Rather, it is honoring the Constitution and respecting those who have respected America enough to LEGALLY apply for citizenship and LAWFULLY wait in line. Face it, Leftists: you're losing--and you know it."},{"comment_id":"10154885110756509","commenter_b":"Build a wall around Connecticut.","commenter_a":"Of course and that is why we love Trump!! He is the only one daring to say the truth!!!","post_message":"\"He's saying what a good amount of people are thinking and don't want to say,\" a Donald J. Trump adviser said."},{"comment_id":"10152982959796130","commenter_b":"AMEN!","commenter_a":"Every member of Congress should do the same","post_message":"The #FoodBankNYCChallenge is meant to raise awareness about hunger and the struggle to live on such a limited budget."}]
