[{"comment_id":"10153081593500090","commenter_b":"She is also a terrible so called human being !","commenter_a":"esta esta mas choteada que cantante desafinado","post_message":"She may be hiding emails, but there's no hiding this fact: Hillary Clinton would make a terrible president.  Tell us WHY you don't want another Clinton in the White House: @webpagelink"},{"comment_id":"1131302460296897","commenter_b":"@username let Bill Clinton around them it might really happen.","commenter_a":"Pandering 101 taught by Professor @username. African Americans KNOW that you will ignore them again once the election is over. Your KKK ties and hot sauce lies are blatantly obvious. #NeverHillary #HotSauce #HillaryLies #TRUMPPENCE2016","post_message":"\"You want to give me a good send off? Go vote!\" —President Obama IWillVote.com"},{"comment_id":"10153752215990575","commenter_b":"Better yet, deport them each and every one ASAP !!!","commenter_a":"Shoot everyone of them no more rape","post_message":"Good question!"},{"comment_id":"10153089105414753","commenter_b":"I had twin daughters at 18, me and their mother had been married over a year when she got pregnant. My daughters have NEVER been abused, so yes teens can be good parents. This is a fucking offending question","commenter_a":"A lot of adults do the same to. Their children and i was a teen parent without any help and my children are fine and i am married now so it had nothing to do with him being young","post_message":"Should teens be allowed to have babies? What do you think should happen to this 19-year-old father? @webpagelink"},{"comment_id":"10153440624016680","commenter_b":"@username KILLERY LOVER<< YOUR SICK GO LIVE IN CANADA YOU LIBERAL IDIOT>>","commenter_a":"Donald Trump all the Way to the White House,,Heck with all the Haters and the Crooked Sander Backers,, and the ones that Love Hilary yea way to Support her a Criminal That Killed 4 American Servicemen,, she should be in prison,!!!!!!!!!!!!!!","post_message":"Donald J. Trump: Michelle Fields grabbed me."},{"comment_id":"560732980781661","commenter_b":"GOOD, SHE IS SUCH A RACIST, GET HER OWN SECURITY.","commenter_a":"Good for them let her pay for the security and take a little less pay home...she'll get the message","post_message":"HAHAHA!!! THIS NEEDS 10,000 LIKES!!!"},{"comment_id":"1377566012257306","commenter_b":"Sarah Elizabeth Pool like I said all that Shit is fake babe","commenter_a":"Janine April May","post_message":"Americans literally lose billions on weight loss scams."}]
