[{"comment_id":"10153780723343984","commenter_b":"the Muslim parents could have kept their brats at home that day and celebrate their butts off.","commenter_a":"Yes","post_message":"Tempers flared after this city's board of education refused to take a day off of school in observance of an Islamic holiday, and these Muslim parents were NOT happy about it.  Do you agree with the decision these school officials made?"},{"comment_id":"1807363586202385","commenter_b":"Yes WE NEED TO LOCK HILLARY AND HER FRIENDS UP!","commenter_a":"Hell yes !!!!!!!","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"10153396131721130","commenter_b":"Some chick stealing ya flow.","commenter_a":"'@username, you could do a better job at this! But either way, I like it.","post_message":"“This s***t was dope as hell.”"},{"comment_id":"884868911589338","commenter_b":"More like the Supreme Joke of the United States, where the highest bidder wins the votes. They should just remove the robes and wear clown outfits.","commenter_a":"Franklin Graham The Supreme Court of the United States has ruled today that same-sex marriage is legal in all 50 states. With all due respect to the court, it did not define marriage, and therefore is not entitled to re-define it. Long before our government came into existence, marriage was created by the One who created man and womanAlmighty Godand His decisions are not subject to review or revision by any manmade court. God is clear about the definition of marriage in His Holy Word: a man shall leave his father and his mother and hold fast to his wife, and they shall become one flesh (Genesis 2:24). I pray God will spare America from His judgment, though, by our actions as a nation, we give Him less and less reason to do so.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10156113177590725","commenter_b":"'@username What was your last name @username again? we really need the wall!","commenter_a":"Like you always say China is eating our lunch.","post_message":"Depression- be careful of China!"},{"comment_id":"1195176803855108","commenter_b":"They, Mexicans, would have had more support, and got more support, but the riots have highlighted the burden they are on our nation AND the quality of the people involved. Now more than ever we want them out of here. The illegal aliens are criminals, it is that simple - but not only here illegally, but getting benefits and even legal advantages not given to Americans (like conviction and released to streets). Illegals are getting better benefits than many American's in need, BUT let's just consider one aspect that without any doubt is unacceptable; illegals are getting aid while vets die waiting for help. We must correct this problem. ONLY Trump will start the process. Thanks you Mexican rioters - you have reached a new low of acceptance in OUR nations. You are creating a new population of racists - it isn't hard to hate watching your antics!","commenter_a":"Taxpayers On BOTH Sides -- Aren't you sick and tired of all the destruction and crapola coming from these little punks and thugs, illegals, and paid rioters?? Taxpayers have to PAY for their destruction and mess! These PAID for Rioters should be ARRESTED, given LONGER jail time and VERY HIGH FINES -- also, if on government welfare programs or student benefit programs - they should be TERMINATED Immediately! Also, Make Them Do Community Service - Cleaning up All That They Destroyed. No Punks & Thugs, or George Sorsos Paid for Rioters, Muslim Agitators, or Law Breaking Illegals Are Going to Stop Donald from Making America Safe, Secure and Great Again! No Left Wing Owned, Biased Media will stop Mr. Trump! The more they try to throw the dirt and lies on Mr. Trump - the more I support him and his agenda, which is to make America SAFE, SECURE and ...","post_message":"KEEP WAVING THOSE MEXICANS FLAGS AROUND....    @webpagelink"},{"comment_id":"1750956915163116","commenter_b":"Leave voters have woken up, it's time for these people to accept this country belong to people who have been here for centuries. The racist abuse that comes from people who have no rights to be here, is killing our country. EU is based on lies and corruption, people need to be protected from people who have no respect for the British people. Immigration need to be stamped out people who are not suppose to be here should be returned home. Enough of the rubbish people keep trying to push the boundaries of the country to an extent of hatered breeding in a peaceful country. Stay campaign maybe help all those who have no rights to be here, leave campaign had been made to rebuild their country for those who live for the moment.","commenter_a":"A 'so-called' majority can be wrong. The referendum was a bad idea. The parliament are the elected representatives meant to lead and decide. It's a bad outcome for everyone, and is a very bad example to all in the world on how to get along in the global economy, and especially from a social perspective. We live on the same planet. We're not going anywhere else soon. We should share it. Borders are historically recent and arbitrary. Nationality is random (not a choice where you are born, just luck). It is not the most important thing. We all belong to the same human race.","post_message":"Join our live debate and tell us where you stand on a second referendum on leaving the EU."}]
