[{"comment_id":"10156088559505294","commenter_b":"In my opinion, the collarbone issue and sleeveless tops or dresses are a bit over the top. The women in most offices I've worked at wore sleeveless dresses and tops that were tasteful and appropriate. Even the women news anchors wear tasteful sleeveless outfits. I don't see a problem with that. I do however agree a dress code should be in place for kids in school. When they get out in the real world, there are rules, and they have to be followed. 48-50 years ago, we had to wear skirts or dresses that touched the floor if kneeled down. If it didn't touch the floor, we had to change. The guys had to wear belts. If they didn't have a belt, they had to pay 50 cents for a piece of masking tape with the word belt on it and tape it to their pants, and they better have ...","commenter_a":"I say all schools should have a dress code and make sure all students adhere to it. It teaches them to accept things in life their not happy about, but rules must be followed.","post_message":"It's back to school time, and we're hearing more stories about dress code violations. Students at one school in Chicago are protesting a rule that they wear only shirts and dresses with sleeves. Click below for more, and tell us: Are dress codes these days fair? Unfair? Do they go too far?"},{"comment_id":"492568140946699","commenter_b":"Keep it close to the Whitehouse for the next few months, 2 fer 1! (JOKE)","commenter_a":"No.","post_message":"Guess who was at the ribbon cutting ceremony?"},{"comment_id":"1082470525182532","commenter_b":"You tell them Horace. Spend that EBT somewhere else.","commenter_a":"Well Texas is off my vacation choice permanently.","post_message":"In Texas, adults with the proper permits no longer need to hide the handguns they carry in their shoulder or belt holsters."},{"comment_id":"1794738107245611","commenter_b":"Mexico has no standing in America. The reason Mexico is upset is because the majority of Mexico!s economy depends on money sent from Illegals in America and illegal drug traffic. The rich in Mexico will lose their illegal source of income and Mexican economy may crash.","commenter_a":"Screw you.","post_message":"Yea, good luck with number 11..."},{"comment_id":"884256465098263","commenter_b":"Illegals.","commenter_a":"You dumbo s Hillary won the popular vote by 2. Million","post_message":"Liberal media is forcing this down, they really don't want anyone to get a hold of this information. Let's spread it. America deserves to know the truth. Are you happy with the results?"},{"comment_id":"10152816643679877","commenter_b":"She don't need to she's not Muslim","commenter_a":"They would criticize her either way. If she wore it, they would be hollering about how she supports terrorists, then the ignorant right wing tea party types would link it to Obama being a Muslim.","post_message":"Oh boy, they're coming for Michelle Obama for not wearing a headscarf in Saudi Arabia. Read more about her critics below. Grio fam, this seems foul to us. What do you think?"},{"comment_id":"774112892726570","commenter_b":"Shit up traitor go suck on Hillary's nipple","commenter_a":"Know why? Because your last name means he who sands as in sandpaper.","post_message":"Boom. #DemocraticDebate #DemDebate"}]
