[{"comment_id":"10153598643443812","commenter_b":"Hmmm....will it help us grow perfect women with nice titts?","commenter_a":"Cristian Reyes","post_message":"World's largest atom smasher detects new kind of subatomic particle called the 'pentaquark' -- a new form of matter: @webpagelink"},{"comment_id":"902972626429153","commenter_b":"This has nothing to do with muslims.Shut up!","commenter_a":"give muslims a planet and they'd still not be satisfied","post_message":"The barbarism continues"},{"comment_id":"924300044274003","commenter_b":"Duh...He's a Liberal!!! He wants Fox to continue pying him, even thought he won't kick his alcohol and drug problem!!!","commenter_a":"Can you send Juan Williams with him?","post_message":"Bob Beckel isn't going to stay silent in the face of a harsh Fox News statement announcing his departure form the network."},{"comment_id":"10154153489278984","commenter_b":"They are grasping at straws! VOTE TRUMP!!","commenter_a":"all president getting sworn into office! before giving testimony in a courtroom! WAKE UP AND THINK SHEEPLE","post_message":"Donald Trump just addressed some of his loudest critics head on, and it's sure to have his supporters grinning... Do you support Donald Trump?"},{"comment_id":"599734130175363","commenter_b":"she is such a idiot","commenter_a":"Repeat a lie long enough and loud enough . . . Welcome to Nazi America, 2015","post_message":"Temper, temper, Carly."},{"comment_id":"10154818711864586","commenter_b":"BASTARDS","commenter_a":"these idiots should beSHOT!! \"COWARDS\"","post_message":"[GRAPHIC] If you drive a Toyota USA, General Motors, or Volkswagen car, you need to see this."},{"comment_id":"1048574538534260","commenter_b":"Please vote for Trump , Wisconsin !","commenter_a":"The career politicians in the runnng - all of them except Mr. Trump, have had many opportunities to do their job of protecting us, providing good paying jobs, help get a handle on the ever-increasing debt - - and they have done Nothing, but bask in the political paradise they have created - - getting paid with our valuable tax dollars to do nothing but make matters worse. I hope Wisconsin voters will not allow themselves to be bamboozled into voting for more of the same for the next 4 years. I don't think this country could take it. Trump 2016 !c","post_message":"My new radio ad, airing today in Wisconsin! See you soon! #MakeAmericaGreatAgain"}]
