[{"comment_id":"10153723751980667","commenter_b":"I wonder how many people actually read Hillary's dumped emails on wiki leak. I'd strongly encourage people to do their homework before voting for her. Be prepared for some stomach turning, treasonous info. #scary #makeamericagreat","commenter_a":"ROFLMAO. I'm thinking that kindergarten name-calling is *not* an effective general election strategy.","post_message":"'She should get an award from them as the founder of ISIS,' Trump said Wednesday."},{"comment_id":"898217656867757","commenter_b":"That dress >>>>>","commenter_a":"She looks absolutely stunning~","post_message":"And finally Miss Viola Davis! #HTGAWM #Oscars"},{"comment_id":"10152693166980047","commenter_b":"Get out of our lives and leave us alone you can not even run your own country leave our children alone also","commenter_a":"No way","post_message":"Schools are forcing our children to 'pretend' to be Muslim for a day?  We must stop Islamic indoctrination in our schools.   Sign and Share the petition to defend the religious liberty of our students:  @webpagelink"},{"comment_id":"10152698000912452","commenter_b":"I would still as long as she doesnt talk.","commenter_a":"Jessica acting like she ain't asking for attention lol girl you would be doing the same crap. Earn the beads Jessica","post_message":"UPDATE: The girl in the photo had been identified. She is 17 years old and does not attend college. Although she says her interaction with the group was consensual, she did not realize her photo was being taken. @webpagelink  Do you know her? Police in Florida are concerned this spring breaker, spotted in naked photos, may be in danger."},{"comment_id":"10153294543663701","commenter_b":"Lets here the song about an old woman molesting you when you were a kid.. LMAO!","commenter_a":"'@username :)","post_message":"Garth Brooks rocked the Rose City on Sunday! If you missed out, the Moda Center just announced that limited tickets are available for his three remaining Portland performances."},{"comment_id":"10154261503546770","commenter_b":"Hollywood is full of whores!","commenter_a":"Omg. It's just a dress! Didn't your mothers teach you that if you don't have anything nice to say, don't say anything at all!!! Looks like you could all use a lesson in kindness!!","post_message":"Holy moly, Jennifer Aniston."},{"comment_id":"1112768188788371","commenter_b":"This is his third baby mama. The guy is an absolute psycho and she is a dumb doormat.","commenter_a":"It's not about breastfeeding. It's domestic violence. He has strict rules for his partner, including this new one related to breastfeeding. He's a controlling arsehole.","post_message":"He wants his wife to stop breastfeeding when their son turns 8 months old."}]
