[{"comment_id":"10156399276440354","commenter_b":"What are you a freaking psychic? How would you know who is Christian?","commenter_a":"Man look all this Christian compassion.","post_message":"Ex-porn star Bree Olsen: \"It's bulls**t.\""},{"comment_id":"10153066527856336","commenter_b":"Please woman go troll somewhere else","commenter_a":"Poor guy","post_message":"Bristol Palin is engaged to Medal of Honor recipient Dakota Meyer – the Kentucky native is credited with saving the lives of 36 Marines, Army soldiers and Afghan soldiers."},{"comment_id":"10154172121273010","commenter_b":"They are moving the focus to have room to build a new ranger...","commenter_a":"This is disgusting. All respect for Ford, gone. After 2 Rangers, no more.","post_message":"It's cheaper and more profitable to make the cars in Mexico."},{"comment_id":"10154291301186337","commenter_b":"They better pay that woman right this time, she'll put your ass on blast if you negotiate her pay in any way.","commenter_a":"So they are doing a reboot of a remake? Hollywood has really run out of ideas.","post_message":"J-LAW BREAKIN' THE LAW! If Sandra Bullock plays Clooney, then is Jennifer Lawrence Brad Pitt?"},{"comment_id":"10152910071581130","commenter_b":"@username, cry me a River. You don't see that those women keep on having babies that they can't take care of and are sold into prostitution. Oh, but im wrong for believing in controlling the problem. And no bitch, I got my tubes cut and burned, because I dont believe in having more then what I can take care of.","commenter_a":"Since they don't have protection & clearly can't afford children why not find alternatives to intercourse? Or maybe idk use some self control & abstain from sex altogether? They are consenting adult women fully aware of the possible outcome/consequences of their choices. Only people I feel sorry for are those babies born into a piss poor life because they have SELFISH parents.","post_message":"“Sharing a bed is fine, it’s okay to share and be all together. But it’s tough because what if the person next to you is sick? What if they pass that illness on to you and your baby?”"},{"comment_id":"981459371894535","commenter_b":"We need more proof than just being a female. gee","commenter_a":"This proves we need a female president !","post_message":"Justice Sonia Sotomayor cornered the conservative justices on the court by framing the Obamacare case as one of federalism vs states rights."},{"comment_id":"10153302418660329","commenter_b":"lol","commenter_a":"I swear the only good thing from this post are all the pictures i'm stealing from the comments for future use.","post_message":"So you ~maybe~ shouldn’t do this while your wife is pregnant."}]
