[{"comment_id":"1617460714934208","commenter_b":"Hopefully she'll waste away and go away","commenter_a":"Apparently not","post_message":"Since she's not moving to Canada, Dunham could always try eating all that crow."},{"comment_id":"1322047887828041","commenter_b":"seriously these 2 girls acting like trash why would you act like that in front of your kids??","commenter_a":"Eddie Fregoso @username lol","post_message":"BRAWL AT CHUCK E. CHEESE: A huge fight broke out among parents at a Chuck E. Cheese. This scene went on for about 10 minutes until officers finally arrived to break it up. VIDEO: Philip D. MORE: @webpagelink"},{"comment_id":"10154969261836320","commenter_b":"So sad Amen","commenter_a":"Dammm i had no idea","post_message":"We're remembering actress Brittany Murphy who tragically died in Los Angeles on this date in 2009. She was just 32."},{"comment_id":"1513700471996539","commenter_b":"I agree with a person that wants sources: he is right to ask for them. I did not give some simply because it would take too much time on my part to gather them (about the same it would take to do the research on CRS and FATCA's actual consequences). These are the keywords you want: FATCA CRS money laundering Nevada","commenter_a":"Jumping on the demonize Putin wagon eh, big surprise coming from vice. This has nothing to do with Putin, but I see his name a hundred times. Clearly this leak came from the u.s. How about the American banks laundering drug money, or the us govt selling weapons to drug cartels, or CIA plane crashing full of cocaine, or u.s Senator macconell s boat full of cocaine. Won't touch that, because that's actual truth, stay away from that. Just another propaganda outlet for the u.s government.","post_message":"The Panama Papers were a big deal."},{"comment_id":"443280275797013","commenter_b":"Its not just the cops with thug goggles on. The actions of blacks in Ferguson and Baltimore do nothing but reinforce that view. Racism, disrespect of laws and common decency toward others and their possessions, just begets more of the same focussed in the opposite direction.","commenter_a":"You are so racist against white people it's not funny.","post_message":"As a news team, we are not agreeing with either side of this photo as a philosophy but sharing it for perspective and as a piece of artwork which should generate honest conversation."},{"comment_id":"659111814237594","commenter_b":"I hope you both get shot in the head!","commenter_a":"OMG! I can't believe I live in this country!","post_message":"All in the name of fighting tyrannical Obama and his assault on the Second Amendment. -- Robert"},{"comment_id":"10154518044354342","commenter_b":"An animal gives birth to its young......will care for it, and not abandon its young. Humans are worse than animals..........spay this thing at once, she needs not tpo reproduce again, EVER!!!!","commenter_a":"Praying for healing.","post_message":"UPDATE: Police say the mother of a baby born in a Walmart bathroom, then left in a trashcan has been arrested. The baby is still alive, but in critical condition."}]
