[{"comment_id":"761596003989174","commenter_b":"Sure","commenter_a":"TRUMPET THE SCARIEST ORANGE CAT GRABBING PSYCHOTIC CLOWN AFTER TRUMPET LEARNED A FOREIGN DIGNITARY SAID TRUMPET SHOULD PRODUCE HIS BIRTH CERTIFICATE TO PROVE TRUMPET WAS NOT SPAWNED BY A SCARY ORANGE APE ! TRUST TRUMPET WITH NUCLEAR WEAPONS ?!!!","post_message":"Too soon? Lol. - kyle"},{"comment_id":"10154911182244714","commenter_b":"This lady is crazy","commenter_a":"Y'all just can't stop hating on a man that has the highest presidential approval rating since Reagan, can you? Higher, actually. If you can't say something nice, don't say anything at all.","post_message":"The First Family is heading west."},{"comment_id":"521358881400958","commenter_b":"They never would of been allowed into Our Great America.","commenter_a":"Vote all Democrats out of office Be Smart America they are worthless hypocritical self centerd murdering traitors","post_message":"If you were in charge, would you have these deported back to where they came from?"},{"comment_id":"1251358764916884","commenter_b":"@username she is the epitome of EVIL...","commenter_a":"This happens when you are stressed and not comfortable with what you are saying. She has to stay in the race or she goes to jail. There are a lot of people depending on her to keep them out of jail. She will crack and meltdown if pushed long enough...","post_message":"@webpagelink"},{"comment_id":"10152984814394641","commenter_b":"Ban Islam!","commenter_a":"if you Arrest Jihadist, you are hurting religious sentiments of Muslims. Beware!","post_message":"Five men arrested in France, accused of belonging to jihadist cell that was recruiting young people, authorities say."},{"comment_id":"900994056627010","commenter_b":"@username if it's their religion then they shouldn't have been lesbians in the first place but your comment speaks volumes about you","commenter_a":"Nothing to do with religion.","post_message":"Muslim lesbian and her vampire-loving girlfriend, then it gets weird"},{"comment_id":"10155373271046509","commenter_b":"Megan Kelly spoke with her for less than five minutes and all that was uncovered was that this chick lied. That's enough for me.","commenter_a":"cheap attention. sorry, but this is pathetic","post_message":"\"He was really aggressive. He was really rude. He was a bad person with me.\""}]
