[{"comment_id":"967905263263639","commenter_b":"She needs to be in jail!","commenter_a":"No just you","post_message":"EPA Chief Reveals Her 'Trashy' Upbringing And What She's Sure All Families Did Pre-EPA [Video]"},{"comment_id":"2049944575230110","commenter_b":"Should have Shot those idiots","commenter_a":"Awwww poor police. .. terrible. . They r great people who never ever do any wrong. . I wish I could be sad for that mf... but I'm not","post_message":"OFFICER ASSAULT: A crowd watched as 2 people became entangled with an officer. Those 2 face charges after this video surfaced.   STORY: @webpagelink"},{"comment_id":"1122007374532683","commenter_b":"She's in a bikini with something over it, not a big deal. Trumps wife on the other hand is butt ass naked and might be the next First Lady.","commenter_a":"Erik Björnfot","post_message":"#President #Obama's Daughter #MaliaObama twerks & shows her booty cheeks at #Lollapalooza! #WSHH"},{"comment_id":"10153660324311491","commenter_b":"@username Girl, your HR prowess is EVERYTHING. Reading these comments with a cup of tea. *sips slowly*","commenter_a":"Earned the right to what? To throw a tantrum and not show up for work? They did tell her but she did not like the news? When, how it was delivered? Kelly is not responsible for Michael's career! If she is acting unprofessionally and retaliating or is having behavior that is inappropriate in a workplace, the network will need to enforce the EEOC policies and review her contract for creating a hostile environment. The decision to move his day to depart is in everyone's best interest. Maybe after 26 years she should look for a new job, maybe advance herself too. She does not decide when any employee leaves. I now refuse to even watch this show anymore since the Kelly drama and I hope family and friends turn her off and let the network see who has the power to decrease ratings here! He's advancing his career period. If ...","post_message":"“I needed a couple of days to gather my thoughts. After 26 years with this company, I earned the right.”"},{"comment_id":"10153412977987293","commenter_b":"Racist white lady alert","commenter_a":"I've never seen or heard of another president blamed for more things out of their control.","post_message":"It's not like he keeps a dais parked in front of the desk all the time."},{"comment_id":"416029885255267","commenter_b":"@username why your government killing cows on throw them on street to make violence ?","commenter_a":"If Islam follows their one and only Prophet Muhammad who was a rapist, murderer, and pedophile be peaceful? Remember his youngest wife being 6 and forced to have sex at 9. Please tell to me how this is possible? No jokes or hate being meant just really need answers.","post_message":"For the past 5 months - media poll experts & establishment politicians have predicted that my campaign will fail. As the polls indicate - we are growing, and will continue to do so - thanks to your support!  What else do you think they are capable of under estimating? Terrorism? Threats of cyber-attacks? I DO NOT WANT TO FIND OUT! When I am elected #POTUS - I will see to it that we DO NOT find out!"},{"comment_id":"909436415764813","commenter_b":"@username is right. Our India is safe for females.","commenter_a":"India more safe than so-called muslim nations..its just that media show these news here and the other countries like pak n iran highlight such news of India.. they never show good things about India.","post_message":"The victim's mother said the men had harassed her daughter after they boarded the bus."}]
