[{"comment_id":"10152742631486680","commenter_b":"Go Hillary ! Fun to watch these morons head explode!!","commenter_a":"Although I'd love to see a woman president, the very last thing we need is a career criminal like Hillary Clinton (who's currently in violation of Article VI of the Constitution) . She's proven herself time and again to be both incompetent and dishonest. She has no new ideas, and will continue to push Obama's tired old routine of increasing taxes, not for the domestic good, but so that we can send billions to Iran, Iraq, Pakistan, Afghanistan, Egypt and Israel. I would like a President who puts America first, for a change. The only candidate I've seen who shares these sentiments is Rand Paul, and he deserves my vote. By the way, many people are unaware that Obama's Democratic administration added $1.3 trillion in new taxes to small businesses, which lowers both wages and job creation. If you love America, vote Republican.","post_message":"Opinion: When Ayatollah Khamenei speaks, it pays to listen."},{"comment_id":"10153797602872060","commenter_b":"Bless you Chase!","commenter_a":"Thanks Chase!","post_message":"Chase Landry of The History Channel's \"Swamp People\" hitched his 20-foot aluminum flat-bottom boat and has rescued more people than he can count."},{"comment_id":"10153621315776037","commenter_b":"Me either, but because of my mom, I've been around terminally ill people as I worked for her. This is a big deal and I believe it's important. Suffering through a long painful death is hard on families as well as patients.","commenter_a":"Death with dignity is a big deal to people. Unless you're living with a terminal illness, I suggest you leave your judgement at the door.","post_message":"Religious groups and advocates for people with disabilities opposed a nearly identical California bill earlier this year."},{"comment_id":"10154488301629228","commenter_b":"Good God she's a monster","commenter_a":"This woman is a liar, she lied to the police about Betsy Faria's death and her role in it and tried her best to imply Russ had killed his wife. Why she's not in jail is beyond me. I think this new story stinks to high heaven and hopefully the O'Fallon PD does a very through investigation. This woman is dangerous, avoid her for your own safety","post_message":"\"For him to be alone at all is shocking for me.  He doesn drive.  He doesn leave the house by himself."},{"comment_id":"10153111787816051","commenter_b":"I think girls are more likely to want to fight for what they feel at the moment and most of the time it's about nothing. Hopefully when they grow up they will become ladies","commenter_a":"Awwww. Look at that gentle giant trying to help that girl up off that park bench","post_message":"This girl was holding a baby when they surrounded her. She didn't want any trouble, but it didn't matter."},{"comment_id":"1158142194215832","commenter_b":"aw poor huntsman","commenter_a":"Sergio Andrade Sergio Andrade Vergara Gisella Casillas","post_message":"A good reason to always flush the toilet.  Barry Morrissey captured video of a Huntsman spider hiding in a toilet bowl in Australia.  The video has been viewed more than 30-million times around the world."},{"comment_id":"10153128305820933","commenter_b":"Kasich and Taylor can't be responsible when a trusted employee breaks rules behind their backs. Taylor has come out strong against the actions and has expressed deep disappointment that the Trust of the people was broken... as for Spencer (Tim) Balls crazy assertions. Kasich had nothing to do with the ordeal. Spencer (Tim) Ball has a vendetta against Worthington Christian Schools. Kasich's daughters attend the school. That is the only connection between the 2.","commenter_a":"Today's Columbus Dispatch (newspaper) had a good article revealing problems in the Lt. Gov.'s house.","post_message":"Gov. Kasich stopped to greet a small group in beautiful Peterborough, New Hampshire to end the week. See you again soon, New Hampshire! #nhpolitics #fitn"}]
