[{"comment_id":"1054180274641720","commenter_b":"Sam , isn't a lesbian so why would they have lesbian in the house?","commenter_a":"It's homophobic too, since there are no lesbians on the show either.","post_message":"Is The Bachelorette Australia RACIST? (via Daily Mail Australia)"},{"comment_id":"727349494120008","commenter_b":"are you kidding me. Get rid of these lowlife scum bags. It didn't have a dining room. well soon they will be Trumped.","commenter_a":"If this is true .they need to go pitch a couple tents ⛺️ somewhere . Give the house to someone who will be grateful to have a roof over there heads 😡😡","post_message":"This shows the welfare mentality at it's absolute WORST! This family has rejected 2 different taxpayer funded 5-bedroom houses and is now staying in a taxpayer funded hotel but they are making another VERY special demand..."},{"comment_id":"10153657767106051","commenter_b":"OMG... A bunch of women who can't stfu!","commenter_a":"This isn't a political website Lorretta so move on.","post_message":"Olivia Newton-John's ex vanished on a fishing trip 10 years ago. Now, more than a decade later, we finally know what happened to him."},{"comment_id":"10152983591416491","commenter_b":"Lena did it for 10 yrs. She's gross!!","commenter_a":"Lena was seven. Not 14 or 15. And Duggar raped his own sisters many times over many years. And who the hell is Palin? An irrelevant person seeking relevance.","post_message":"“I’m sickened that the media gives their chosen ones a pass for any behavior as long as they share their left-wing politics.”"},{"comment_id":"594928020669934","commenter_b":"@username she said with her own mouth she wanna build a wall.","commenter_a":"@username once again dominating the night showing that she is clearly more knowledgeable, articulate and experienced to be President and commander-in-chief. Ready or not, Madame President here she comes!!!","post_message":"One candidate delivers catchy lines—the other delivers results. Add your name to say you're with Hillary. #DemDebate"},{"comment_id":"10153122245742377","commenter_b":"Ford didn't take any bail out money yet it is thriving.","commenter_a":"Bankruptcy isn't illegal or immoral, unlike some of Rubio's financial issues. And he never filed for personal bankruptcy, it was a few of his companies out of a thousand. He's a billionaire, yet Rubio has trouble paying credit cards. Truly Rubio doesn't want to go down this path with Trump.","post_message":"Rubio and Trump trade trash talk on finances."},{"comment_id":"1076303882387835","commenter_b":"Stoooopid bitch! ! ! ! ! ! !","commenter_a":"Folks, QUIT talking about her, just let her fade away to hell.","post_message":""}]
