[{"comment_id":"10154379818081509","commenter_b":"Go away Judy womble","commenter_a":"Shut up Donald...go away","post_message":"\"I think she's right -- I am angry.\" In an interview on Erin Burnett OutFront, Donald J. Trump responded to Nikki Haley's remarks about him after #SOTU. @webpagelink #TrumpOnCNN #SOTUresponse"},{"comment_id":"10153480166187235","commenter_b":"Oh,COME ON! In ALL of Florida there wasn't ANYTHING happening that was MORE illegal than two CONSENTING adults having SEX? RIGHT.😑","commenter_a":"Huh. If everybody who had ever had sex on the beach went to jail, well, spring break in Florida would be much less popular.","post_message":"Reminder: No one involved in the mortgage scandal has served a single day in jail."},{"comment_id":"913202388702552","commenter_b":"For women, there's always danger no matter how much you use your head.","commenter_a":"No danger if you use your head. Crime is down in most of the civilized world. The news cycle is just longer.","post_message":"\"Are you alone?\""},{"comment_id":"10153827950153797","commenter_b":"Devastating but why didn't the mother have them in the first place ?","commenter_a":"Another child in the cruel system","post_message":"CHILD DIES IN CPS CUSTODY: Several days have passed since the mother of 6-month-old Aailyah was told, \"There's been a little accident.\""},{"comment_id":"993863733987432","commenter_b":"Shut up Meg","commenter_a":"If only this call had been made in September 2001.","post_message":"That's probably not the kind of congratulatory phone call Netanyahu wanted."},{"comment_id":"1145540435508072","commenter_b":"No job , 6 kids , no husband . Stop !","commenter_a":"Waited in line for six hours if you would've been working kids would've ate","post_message":"Entitlement Mentality: Welfare Recipients React to Food Stamps Being Cancelled. This shows everything wrong with the entitlement mentality."},{"comment_id":"10154007626519456","commenter_b":"Yea, maybe this guy is right...slaves should learn to be free if they feel entitled to it!! Bring back discrimination!","commenter_a":"Isn't the govs job to tell anyone what they have to pay anyone for services. If you don't like what you make, increase your skill set instead of having the gov hold your hand.","post_message":"The bill passed on a 71-31 vote, and will now move to the Alabama Senate."}]
