[{"comment_id":"495965727273607","commenter_b":"we don't want that pussy here anyway","commenter_a":"Whatever","post_message":"Bruce Springsteen and Bryan Adams are HUGE Hypocrites!!!  They play their \"music\" in countries that throw gay people off buildings, but ban perverts from going into a little girls room and all of a sudden they got a problem???P"},{"comment_id":"1345056415554103","commenter_b":"Parents fault? No, it was the sick pervert who raped her fault!!","commenter_a":"What the hell is a 13 year old child doing on a beach at 02 in the morning Even if her brother was with her The child should have been at her home in bed How could her brother let her out of site I just hope they will be able to catch the guy And made him pay for what he did to this young girl","post_message":"She lost her brother before she was attacked."},{"comment_id":"1711622465785020","commenter_b":"Let us take a look @ a hypothetical example? Every house in your neighborhood left all of their doors & windows wide open when they were home & when they went away. When they returned some had many people living in their home that refused to leave, use everything that they work years for. Took over the master bed room & some decided to kill their pets for religious reasons. Others kill neighbors as they walk home. The neighborhoods within 100 miles of your home became rapid with sex trafficking, drugs, gangs, shootings, suicide bombing, & more. Will U still leave your doors, windows wide open? Would U want better protection from unwelcome intruders? U may even ask for a gated community. So Y would anyone get upset about Trumps logic on protecting America. Build a wall, only let legal immigration through our front doors. Build a strong military & ...","commenter_a":"BELGIUM JUST ENDORSED TRUMP! #BRUSSELS #VOTETRUMP @webpagelink","post_message":"**BREAKING NEWS**  I agree!!"},{"comment_id":"10153507378388487","commenter_b":"Not one female player could play to the standard of the men's World Cup","commenter_a":"Value is determined by the market. If we want to constrain the market in the name of fairness, we could get rid of the divide between men's and women's soccer and have one World Cup where the best athletes compete regardless of sex. Ensuring all players are selected based upon ability rather than sex seems fair.","post_message":"The World Cup concludes today, but the battle to equalize women's soccer with the men's game is only beginning"},{"comment_id":"10153246589888445","commenter_b":"I hope all these dumb fucks on her get arrested by the feds no one wants your dirty swag bitch","commenter_a":"Haha don't worry we got your back here in co haha oh and water","post_message":"NEW: California Wildfires Are Affecting the Pot Industry."},{"comment_id":"10153201550225329","commenter_b":"I agree she thought she untied the cloak and when they pulled she realized it was not untied so it was a mistake and I doubted anyone will get blamed for it.","commenter_a":"Because of my job, I saw the Brit Awards here in the US. What people DID NOT SEE (unless you live in the UK) is the fact that she did her entire performance. She may not have been able to dance to the best of her ability because of what happened, but she made it throughout the end.","post_message":"Poor Madonna"},{"comment_id":"10153214804429641","commenter_b":"Why are these counties better to mothers?","commenter_a":"Ironic, the top five are all Nordic!","post_message":"These are the best and worst countries for mothers -- how does your country stack up? @webpagelink"}]
