[{"comment_id":"10153363808198010","commenter_b":"How do we know the restaurant would go out of business anyway? It happens all of the time. I live in Seattle and the rate increase is just slowly beginning to take effect. No conclusions of this sort can be made.","commenter_a":"In Seattle where they just raised minimun wage to $15 a hour some restaurants are now going out of businss as restaurants are having to pass on to their customers a lot higher prices for the food they serve.","post_message":"An L.A. City Council committee has endorsed a hotly contested plan to raise the citywide minimum wage to $15 by 2020, up from the current $9 an hour. The proposal now heads to the full city council."},{"comment_id":"10154744279541323","commenter_b":"ooh, you bitch you. i wouldn't invite you to your own funeral","commenter_a":"Hillary looked like she could use a shower and some crayons when she slithered out from under her rock last night.","post_message":"'None are without controversy.'"},{"comment_id":"10153286970856167","commenter_b":"Help the refugees by free their homelands from the bad people the world support with weapon and money for other profit exchange !! They are running away from their own evil ... This evil was created by the collective separations of this planet God of profit America is the only place in the planet When soon or later the origin of the people is not matter any more .. This will hopefully be our new planet order","commenter_a":"In the 1930s we turned away thousands Jews due to xenophobia, many of them later died in camps. Are we going to repeat the same mistake now?","post_message":"Since the Paris attacks, there's been a lot of hate. Here are the top five best responses to all the bigotry. Watch:"},{"comment_id":"10153182922011943","commenter_b":"Time to round up these extremist traitors and deport to Muslim countries!","commenter_a":"She is the POTUS, Obamass is her puppet clown. George Soros funds the riots, paid Obamass millions and Valarie transmits all the government information to Iran where her father-in-law gives to his Iranian people. They know whats going on in Iran before we do here in the states. She had her office and quarters in the WH before Obamass and Mooschelle moved in.","post_message":"It been well documented that Valerie Jarrett, a Chicago lawyer and longtime Obama confidant, is a liberal extremist who wields tremendous power in the White House.   She has connections to many Communist and extremist groups, as FBI files obtained by Judicial Watch show. (SHARE THIS!)"},{"comment_id":"1685131825099212","commenter_b":"Bitch!","commenter_a":"Bitch","post_message":"Can you describe #Trump with 1 word?  The Free Thought Project.com (y)"},{"comment_id":"1111151122296756","commenter_b":"This makes Chicago sound a lot like Baltimore for the 'quality' (corrupt, criminal) of incumbent leadership (I grew up in the south side of Chicago all the way back to the 60's - and am not much impressed with what the present day enthusiasts think of my opinion. I also lived for a while in Viet Nam, and there we were allowed to call the other guys 'enemy', and to shoot back at targets of opportunity, ... just sayin') @webpagelink","commenter_a":"I knew there was a dirty Democrat involved in that ruckus!","post_message":"Inside scoop, here . . ."},{"comment_id":"10152688677486491","commenter_b":"'@username Was 9/11 an act of American terrorism? WTC and Pentagon are both on US soil, right?","commenter_a":"Not Polish camp but German!!","post_message":"Hundreds of survivors returned to the Holocaust’s most infamous concentration camp today."}]
