[{"comment_id":"10154008998213797","commenter_b":"Whites wouldn't understand discrimination lol you sound stupid how about the jews they were white how about the Irish when they came to America they were white what about any German that came over after ww2 they were white now tell me again how ur comments are relevant","commenter_a":"It's not like she labeled their ticket with racial slurs. I guess I don't see what the big deal is. If the waitress had put \"white couple\" on a ticket, no one would care.","post_message":"WAITRESS LABELS CUSTOMERS: Kimberli Wilson went out to eat, and when the bill came, she couldn't believe what was written at the top. The waitress labeled her table by race. Here's what happened when she confronted the manager:"},{"comment_id":"10154454034611350","commenter_b":"At least they can wear pants other than jeans","commenter_a":"I like the new rule. Ass and tits are not school appropriate.","post_message":"We shouldn't be teaching girls to alter their dress as to not 'distract' the boys.\""},{"comment_id":"10154064553747464","commenter_b":"Gaining delegates is part of how you win, especially in an open convention. He'd be crazy *not* to. It's something Trump is learning the hard way.","commenter_a":"Why use every edge known to man Cruz, just have a straight up best man with the most votes win's. You cheapened yourself pandering for delegates, it appeared slimey and desperate. Also why did you go to the border with Beck to hand out welcome boxes to ILLEGALS that were entering our country ILLEGALLY if you really believe in the wall and making already existing ILLEGALS leave this country????","post_message":"Join us on Monday for #CruzOnGMA!"},{"comment_id":"1469871926366166","commenter_b":"@username...... leave Our country!!!!","commenter_a":"Too late you racist p.o.s. you are hatred and bigotry..","post_message":"\"We will reject bigotry and hatred and oppression in all its forms, and seek a new future built on our common culture and values as one American people.\""},{"comment_id":"853235784752651","commenter_b":"Too bad there aren't more moms like her.","commenter_a":"I love that she is wearing bright yellow...for all to see.","post_message":""},{"comment_id":"10154586302758822","commenter_b":"Nobody hire ur nasty bitch ass","commenter_a":"Kdka u must b gettn pressure from ur execs to push all this liberal garbage ur only local news i watch but its gettn harder and harder to watch","post_message":"Have you noticed a drastic spike in Insulin costs? What gives? Is there anything you can do about it? #KDKA-TV News at 5:45"},{"comment_id":"10153804113241770","commenter_b":"Wasn't it Hillary yesterday stating that she has always been in favor of strong vetting of refugees? Obviously she sees which way the wind is blowing on that issue, so she's trying to get onboard. Wish she and Obama had been in favor of that when they started letting this evil, diseased crap into the country by the tens of thousands.","commenter_a":"I've always been amused at the people who say you shouldn't profile. But EVERYONE does it on a daily basis. That's a bit of reality for you... Yes to profiling, more stop and frisk.","post_message":"Republican presidential nominee Donald Trump called for profiling techniques to combat U.S. domestic terrorism threats during an appearance on Fox News Monday."}]
