[{"comment_id":"10153743310093606","commenter_b":"Sad, if she didnt want the child I would have taken her no questions asked","commenter_a":"She needs shoot","post_message":"HORRIFIC: A 6-month-old baby girl died Thursday afternoon after police and witnesses say her naked mother dangled her from the window of an apartment building in the Bronx before throwing her to the pavement six stories below. @webpagelink"},{"comment_id":"10154559728153812","commenter_b":"@username He has lead our country in more debt than any other presidents He doesn't give social security costs of living raise in 3 years He's letting illegals into our country without being vetted He's trying to take guns away","commenter_a":"You Americans, I can't believe how you can produce great leaders like Obama and then still show up with Trump for the next elections.","post_message":"Donald J. Trump on #Dallas: \"This isn't the American Dream we all want for our children.\" abcn.ws/29mnwVr"},{"comment_id":"533413536846939","commenter_b":"They all need to go back to thier countries and fight thier own battles against extremist.","commenter_a":"U GO TRUMP","post_message":"Looks like Trump said what many across the world were already thinking..."},{"comment_id":"1179430858762542","commenter_b":"@username what an a**","commenter_a":"Not even the president yet, and already proving himself to be the leader we so desperately need!","post_message":"As soon as Donald J. Trump heard the news that 1.5 million people are being asked to leave their homes, he knew exactly what to do..."},{"comment_id":"10154739260431509","commenter_b":"2","commenter_a":"Let's make a small poll: 1- Donald Trump 2- Hilary Clinton","post_message":"What was meant to be a fun day of riding roller coasters at the amusement park turned into a very scary ordeal for this family."},{"comment_id":"10153029788371545","commenter_b":"Calm down, crazy.","commenter_a":"This country IS BASED ON THE BIBLE. I have no problem with them marrying, but by a court or Justice of the Peace. NOT THE CHURCH. THAT IS SACRED, which tells me one thing about these evil people: THEY WANT TO DESTROY RIGHTEOUSNESS and anyone who stands for it. 36 states have already told them they could marry, but NO, now they will force righteous Pastors, Priests, etc. to marry them and there will be conscientious objectors standing up against it. Then, this country will be divided worst than it is. YOU ARE A FOOL FOR SATAN. YOU CANNOT LEGISLATE MORALITY FROM THE BENCH. It just doesn work because MARRIAGE IS A HOLY MORAL ISSUE, not a carnal issue. You watch. These homosexuals will go after the churches who refuse to marry them, OUT OF SPITE AND EVIL. And, this is the beginning of the end for America. SHE WILL ...","post_message":"For three years, Dallas County Judge Tonya Parker has quietly declined to perform wedding ceremonies. It didn't feel right to exclude some couples from the institution of marriage, she said. Today, all 12 of her fellow district court judges sat inside Parker's courtroom for her first marriage ceremony in years."},{"comment_id":"1770447173221488","commenter_b":"She's bitching because Trump will make her put on clothes lol","commenter_a":"She hasn't enough brains to have that much feeling for a cause","post_message":"Miley Cyrus has a clear message about Donald Trump becoming President."}]
