[{"comment_id":"1210812922267700","commenter_b":"Fools! All of them!","commenter_a":"Liberalism hit squads at their finnest huh Rush.","post_message":""},{"comment_id":"992416424184745","commenter_b":"Well I know it wasn't a baseball stadium or shopping mall","commenter_a":"Remember that first moron who said \"maybe, just maybe the earth is round\"? Unless there's a time machine, people can have their own thought who built the pyramids in what year, and for what purpose.... My theory was that aliens or time travelers built them as some sort of energy source....","post_message":"Wow.. and he's supposed to the SMART Republican? Reality check: the EGYPTIANS -- not the Jews -- decided to build the pyramids for the pharaoh's graves -- NOT to store grain!  “My own personal theory is that Joseph built the pyramids to store grain,” Carson said. “Now all the archeologists think that they were made for the pharaohs’ graves. But, you know, it would have to be something awfully big if you stop and think about it. And I don’t think it’d just disappear over the course of time to store that much grain. And when you look at the way that the pyramids are made, with many chambers that are hermetically sealed, they’d have to be that way for a reason.”  Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154141762806162","commenter_b":"Wild animals!!!!! trump is the wild animal causing all this bs PIED PIPER !!!","commenter_a":"People need to stop blaming Trump for the actions of low life people. They get out of hand, then don't want to own up to their actions. It's the generation of placing the blame elsewhere. Trump didn't tell them to act like wild animals. That's just how they act.","post_message":"\"We're going to take our country back from 'these people,'\" Trump told supporters after his canceled Chicago rally. \"These are bad, bad people.\""},{"comment_id":"974532882587184","commenter_b":"Yeah but what are you going to do about your wife?","commenter_a":"Me too def on the pedophile down low","post_message":"Welcome to this crazy Christian Dad's painfully awkward attempt at sex-ed."},{"comment_id":"10155184641741509","commenter_b":"They wanted that sweet Brazilian booty","commenter_a":"I really think these dudes were out looking for mad hookers and they got robbed because of it LMFAO!!!!","post_message":"JUST IN: US swimmers Jack Conger and Gunnar Bentz were removed from their flight from Rio de Janeiro to the United States by Brazilian authorities, US Olympic Committee spokesman Patrick Sandusky told CNN Sports contributor Christine Brennan. Earlier this week, the two swimmers were with teammates Ryan Lochte and James Feigen, who are wanted for questioning by Brazilian police after questions were raised over their accounts of being robbed."},{"comment_id":"10155002829744411","commenter_b":"Leaks: the new news.","commenter_a":"u re a loooooser baby ...so why dont you kill yourself....","post_message":" appears, however, that after eight years the administration has suddenly awoken to the threat."},{"comment_id":"1313767168664034","commenter_b":"Just a bunch of self absorbed leftist lesbians.","commenter_a":"Just say there prayin see what happens","post_message":"Wait...so the WNBA is still a thing??"}]
