[{"comment_id":"1339288666111988","commenter_b":"🙄🙄🙄 could have killed thatboy","commenter_a":"@username when @username used to wake us up every morning with his music","post_message":"Peace, love, and coexistence — this Christian man helps Muslims observe their holy month. (via NowThis)"},{"comment_id":"10154091486669445","commenter_b":"As is history. It is the dark side of humankind.","commenter_a":"We're all in, but especially Europe, for a very tough long haul. When you have people hating as a lot of terrorists do, willing to give up their lives, there's practically no way to stop them. And Europe is full of them","post_message":"The Eiffel tower is lit up in the colors of Belgian national flag after #Brussels terror attacks @webpagelink"},{"comment_id":"10154584993799497","commenter_b":"Thanks pussy","commenter_a":"U fuckin cucks","post_message":"Here what you need to know about the alt-right:"},{"comment_id":"10154375998138145","commenter_b":"Some women get pregnant and have babies only to blackmail the father of the baby . 5 min sex with a crazy chick get you scrued for lifetime","commenter_a":"REVOKE her parent card!!! right now before anything happens to that baby. I will gladly adopt","post_message":"She got 2 months in jail, but could have faced 5 years in prison. The baby now lives with his grandmother."},{"comment_id":"1815485588708872","commenter_b":"Kill your self woman!","commenter_a":"These are 2 polls of manyyyyyyy. These were outlier polls. The AP is a 14 pt spread in favor of Hillary. If they don't make this look like a horse race the last week or so, people won't watch. Nate Silver pointed this out last night. Go check out 538 polls. Imagine 100s of weather models predicting a snow storm predominately tracking east and 1 or 2 suddenly say west. Those are outliers and not a reflection of the whole. People are in here all excited bc they don't know what they are looking at.","post_message":"JUST IN: Florida and Nevada move back to Donald J. Trump's direction, with now six states and 87 electoral votes up for grabs"},{"comment_id":"10154005218489749","commenter_b":"@username fool","commenter_a":"Galloway is a racist..anti-semite...he needs to be thrown out of any meeting of decent minds.","post_message":"\"This has ruined this evening, as far as I am concerned, it's disgusting,\" one angry attendee said."},{"comment_id":"10155961820435725","commenter_b":"Time for Americans to play the TRUMP card!!! Adios Illegals!!!","commenter_a":"Mr Trump ...the RNC will NEVER give you the nomination .... This is a chance for America to rid itself of the GOP for good... Start a third party... American Patriot Party... A Party of the People!!! If it doesnt work... so be it... You are the only one who can beat Hillary and if you are not the nominee ...she will win.. But at least we gave it a shot... If you dont win...then the GOP wont win!!!!","post_message":"Our online store is officially open! Visit www.DonaldJTrump.com/shop to shop the latest #MakeAmericaGreatAgain merchandise."}]
