[{"comment_id":"10153652003074203","commenter_b":"he's going to destroy both political parties!","commenter_a":"Hes for real gonna destroy the republican party... and all of us love him for it","post_message":"One thing is pretty clear: Donald J. Trump isn going away for awhile."},{"comment_id":"760883910715426","commenter_b":"We will give her up to you Iran! Go let her ruin your country!","commenter_a":"Don't you need a brain to be a spy?","post_message":"Is Kim Kardashian West a secret agent?"},{"comment_id":"1014316725248091","commenter_b":"Sondra, you sound like someone who doesn't know what she is talking about. For many women PP is the only place where they can get cancer screening. PP provides birth control. How dare you assume that you get to make the health decisions for even a single person. Shame on you.","commenter_a":"Mr. Bera, the real \"consequences\" of ending funding to PP would be an end to PP altogether..they should be brought to justice for their depravity and disregard of the law by selling baby parts-- we taxpayers have been funding them TWICE OVER for years and are sick of their lies are many other reputable womens health centers you know all of this but are afraid to vote your conscience.I'm really ashamed of you..and if you are a pyhsician as you claim, you are not a humanitarian nor a normal human being.","post_message":"As one of the few practicing doctors serving in Congress, I understand the real consequences ending federal funding to Planned Parenthood would have for patients. That’s why I stand with Planned Parenthood and will not vote to defund it. We need to keep politicians out of the exam room and instead work together to make sure women have access to preventive health care → @webpagelink"},{"comment_id":"10153332153777377","commenter_b":"But yet Megyn cried otherwise. Such a Bimbo.","commenter_a":"BBB gave Trump an A on his Trump University, so Cruz needs to hit the unemployment line","post_message":"Ted Cruz hammered Donald Trump on Thursday, tweeting out what he called a \"Certificate of Deception\" for Trump's now-defunct Trump University."},{"comment_id":"10154283340572061","commenter_b":"You need an education woman. The president has already spoken. People like you really scare me. Your like a lose cannon with no direction, hurting the innocent! I don't agree with you but would never think of slamming you or causing you hurt. Everyone needs to figure out how to get along or there's not going to be a world to live in for any of us.","commenter_a":"Where are words from the president? Words, that's right, he has a short vocabulary. He can't say it's going to be great, really, really, great. When I tell you, it's going to be yuge. Sad America, when disaster strikes, your president is somewhere eating caviar sulking about his weak inauguration numbers. smh","post_message":"At least 16 people have died over the last 48 hours due to tornadoes, as a violent system of storms works its way across the Florida Panhandle and parts Georgia and Alabama: @webpagelink"},{"comment_id":"918834358153905","commenter_b":"It's not liberalism it's victimism. Justifing everything you do and tring to force others to change by acting like everything that happens is victimizing you","commenter_a":"Agreed.","post_message":"The latest COMMENTARY from Matt Walsh:"},{"comment_id":"1142380192485341","commenter_b":"Wow are you serious they are trying to take out the Americans 1 job at a time and all the free handouts our government will give them. While our own government let's the Americans suffer by allowing them to free load off our system. Really they get social security for what . Americans get denied SSI while the immigrants step right up and no problem. really ?? Go Trump","commenter_a":"Welcome to the future!!!","post_message":"Nearly 40% of less-educated, working-age Millennials ages 18-29 don’t have a job.  That’s more than 15 million young-adult high school grads and high school dropouts who aren’t working."}]
