[{"comment_id":"10154129008215329","commenter_b":"Sharon lol i couldnt find the woooorrddd","commenter_a":"I'm 15... i mean, i know how to use a CD player, and i know how to listen to a CD. i also know how to use a cassette and all but now a days, most computers don't even have a slot... we also got rid of our CD player ages ago... i haven't bought a movie on DVD in soooo long because everything is digital now","post_message":"So you've purchased Adele's \"compact disc\"..."},{"comment_id":"10152777670593525","commenter_b":"Hahaha she can do it, especially since she has that walker she'll smoke that nigga","commenter_a":"@username Xana Smith @username Alice needs to get on her grind! Lol","post_message":"95 years old and still setting records on the track…"},{"comment_id":"10153220883066491","commenter_b":"Unnecessary! Girls that are having their period don't play with barbies","commenter_a":"LOL - that is just rich.","post_message":"“It’s just what happens in real life.”"},{"comment_id":"1792493044351097","commenter_b":"For the safety of the country, her and everyone linked to her SHOULD BE PERSUED, THEY NEED TO DO IT. Unless all this was just political carpet-bagging, I'd hate to have to believe that, but their out to break this country, and if they aren't taken to task They Will Break This Country!!! Trump, keep your promise, were counting on you...","commenter_a":"He's just another elite ..with promises to get elected and being schooled by the negro ..he never meant to do anything he said ..he panderd to us all..","post_message":"President-elect Donald Trump and his transition team signaled Tuesday that his administration will not pursue further investigations of Hillary Clinton, backing off a vow on the campaign trail to appoint a special counsel to probe his Democratic rival secret email setup as secretary of state and suspected pay-to-play deals involving her family foundation."},{"comment_id":"10155528648886729","commenter_b":"Let those people lose a day's wage and let those business' lose a day's earnings. Who cares. We should have no illegals working, instead the long term welfare kings and queens should be working to earn those welfare checks.","commenter_a":"I have a question. If all the Chavez supermarkets, which the Hispanic community supports by shopping there, closes for the day where will a mother go to get that gallon of milk she needs? Also, will the supermarket pay any employee that doesn't work today?","post_message":"Oops."},{"comment_id":"10154808382292235","commenter_b":"What about Ted (Shit my pants draft dodger) Nugent? He can play his one and only hit about pussy grabbing.","commenter_a":"Ted will need to wear a diaper","post_message":"Looks like it's just Ted Nugent and Kanye."},{"comment_id":"10153984611959614","commenter_b":"Walk in front of my car. Karma will get u","commenter_a":"You see how faithful this poor dog is his master was going to kill him.My brother told me one time as he was coming home from work.He saw a little dog on the road this truck purposely hit that little dog and killed him.What kind of animals do we have on the roads.I guess it speaks for it self","post_message":"A heartless driver shoved a dog out of an SUV, then sped away as the abandoned pet desperately scrambled to get back in.   The dog was struck by another vehicle as it chased after the driver on a Long Island road. Incredibly, the canine survived.   Suffolk County SPCA is offering a reward to find the person who abandoned the dog. The driver's vehicle is described only as a dark green, early 2000s Jeep Cherokee."}]
