[{"comment_id":"982881765080578","commenter_b":"I hope so how can that woman even sleep much less lead a country would she do that to all Americans how can anybody vote for her","commenter_a":"I look at this picture and am reminded of the horrible torture this man endured, before his death, and wonder what really happened and who was responsible for not seeing the embassy was secured for their safety. It may not matter to Hillary, but it does to us and the the family members of those who died.","post_message":"Could we finally bring Hillary to justice?"},{"comment_id":"1740879046184782","commenter_b":"lock this crooked Bitch up.","commenter_a":"They are untouchable. We all know that by now. Waste of time reporting anything they do. Dems see them as heroes and the saviors of all...","post_message":"It's about time."},{"comment_id":"2193117860914394","commenter_b":"As if I would let her lick my face when she cleans her asshole 😂😂😂 come on now","commenter_a":"@username Munro","post_message":"It's not just gross, it's dangerous."},{"comment_id":"1302575163172066","commenter_b":"@username and why isn't Hillary in jail right now? Oh yeah, dirty politics.","commenter_a":"He's a fraud. Last night he said he would (be able to) release his tax returns if Hillary released the emails. So according to Trumb...HE CAN RELEASE HIS TAX RETURNS IF HE WANTS Period","post_message":"“If not paying taxes makes him 'smart,' what does that make all the rest of us?”  - Hillary Clinton"},{"comment_id":"1765372970348268","commenter_b":"No she is a lier","commenter_a":"Feel free, one and all, to hit me in the head with something hard and heavy if you ever get wind of me agreeing with Hillary on anything.","post_message":"Hillary Clinton rebukes Senate Republicans for refusing to hold a hearing on U.S. Supreme Court nominee Merrick Garland, calling it \"low-minded politics\". Do you agree or disagree with her?"},{"comment_id":"10153045402661336","commenter_b":"Shut up idiot!!!!","commenter_a":"Early Bird gets the cage","post_message":"A Georgia sanitation worker has been sentenced to 30 days in jail for picking up trash too early in the morning."},{"comment_id":"483283155193311","commenter_b":"Good ridance! Sorriest show on TV. Sorriest people on a show on TV. Both of the women above should be in a mental institution. Lock them two and Obama in a room together and let them live out their lives in peace. :)","commenter_a":"Hope so , it will be a blessing","post_message":"FINALLY!"}]
