[{"comment_id":"10155456219056509","commenter_b":"Both are adulterous stalkers.","commenter_a":"Trump is lying about his own words he says he didn't do what these women say but on tape he brags he did. What a liar, lying Trump calls himself a liar. LOL","post_message":"For some women, Donald J. Trump's denial of wrongdoing has made them feel compelled to speak out"},{"comment_id":"1729670857287408","commenter_b":"HILLARY CLINTON YOUR HONEST, LOVING, CARING CANDIDATE! @webpagelink","commenter_a":"Be patient my precious. Von Clownstick will not win the White House. Hillary will crush him come November. Then all these Dumpsters can slither back to their respective holes. Bye Drumpf.","post_message":"Donald Trump is closer than ever to clinching the GOP nomination. There's only one candidate who has more votes."},{"comment_id":"1097859700233782","commenter_b":"Thanks! It's true!","commenter_a":"The woman had every right to post on yelp.","post_message":"Last night we told you the story about how a woman who was upset about her treatment by a doctor and gave a bad review on Yelp. That review then led to the doctor filing a lawsuit against her >> @webpagelink"},{"comment_id":"10155260669520557","commenter_b":"Death row is just fun. ;)","commenter_a":"Death is the easy way out, watch some of the programs on prisons Then you will feel better knowing that each and every day he or she will wake up in their 4x6 house shared with another body, no privacy to use the bathroom or get dressed, no delicious food and if their lucky can get through a shower safely. Every day they will think about what they have done and to me this is worst punishment than death!","post_message":"'I'm disappointed... he did not consult with district attorneys or consult with the families of victims whose lives have been torn apart by the people who have been sentenced to death for their actions,' Berks County DA says in speaking out today against Gov. Tom Wolf's moratorium on the death penalty in Pennsylvania."},{"comment_id":"1033670103395908","commenter_b":"If I looked like Debbie, I would be a liberal to. Democrats know they got messed up looking chicks.","commenter_a":"Can we have at least 10 debates?","post_message":"Chair of the DNC Debbie Wasserman Schultz is taking your questions about the Democratic debate. What would you like to ask? Leave your questions in the comments, and we'll post Rep. Wasserman Shultz's answers in a follow-up tomorrow!"},{"comment_id":"10153227857229330","commenter_b":"I'd do the same thing - little punk needs a good whipping from his mom","commenter_a":"There is one parent in Baltimore that has her priorities straight.","post_message":"Mom of the Year? Check out what a mom did when she caught her son out rioting in Baltimore. ---> @webpagelink What would you do?"},{"comment_id":"1474175135944775","commenter_b":"Two idiots,","commenter_a":"Hard to do when she said she wrote the speech herself, how did we get to this guy being nominee, wow","post_message":"Did they do it on purpose?"}]
