[{"comment_id":"10153880714231509","commenter_b":"It's her baby. If she says no then it's human trafficking.","commenter_a":"It's HER baby. Period. And the father and her can share it.","post_message":"Should the surrogate mother be able to keep her? This baby's future is now in the hands of the courts: @webpagelink"},{"comment_id":"1756436014601478","commenter_b":"Bye BITCH","commenter_a":"Makes me want to vote Trump","post_message":"The Fate of the Republic Hangs in the Balance..."},{"comment_id":"563771597144022","commenter_b":"Stfu","commenter_a":"Why the Attacks on Gary Johnson, are you Afriad he's going to take it, from crocked Hillary ? I like some of his Policies, his open boarder policy is why I am not voting for him. but A vote for him is a vote for Him, and you saying he doesn't know any Foreign leaders, this is the same guy who climbed Mt. Everest. and Kilimanjaro. You are trying to twist what he said, He said he can't think of any World Leaders he admires.","post_message":"Here's what happened when Libertarian presidential candidate Gary Johnson was asked if he knew the name of North Korea's dictator."},{"comment_id":"10153536976196336","commenter_b":"Talk to Moon beam aka governor Brown of California. It is in San Francisco that an illegal alien killed a beautiful person. He encourages sanctuary cities for illegal immigrants and lets them get drivers licenses and so with liberals it's take from the people who work and pay taxes and let them pay for all the illegals. I don't want to give my hard earned money to whatever the state chooses to spend it on but liberals will continue until they are ousted. And that goes for Republicans as well. No one in either party deserves to hold office if \"our\" welfare doesn't come first. And I don't mean welfare as in free stuff.","commenter_a":"what...how can any illegal alien hold a government position? Oh yeah...California the land of goofballs.","post_message":"\"This is worse than sanctuary cities. Now we're giving them sanctuary boards.\" – Neil Cavuto"},{"comment_id":"10153206999136336","commenter_b":"I love it. She should have her wooden spoon with her","commenter_a":"She is going to be arrested. She beat him that is abuse. Some Social worker will have her arrested.","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"},{"comment_id":"10155056114144749","commenter_b":"hoorah!","commenter_a":"Good review worth reading.","post_message":""},{"comment_id":"10154306572928812","commenter_b":"Go Peggy... how could anybody vote for her especially women????!","commenter_a":"Hillary has the most experienceand best judgmentof any candidate running for president. Eight years as a team member under her husband Bill. point here is that Hillary Rodham Clinton has been doing this for a long time: seeing the world through a political lens and revealing an uncommon solidity of judgment and perspective. ... just because she has risen higher than any woman in American politics, but because she is by far the most experienced candidate of any of those running in either party this year. In fact, she is one of the most experienced people to ever run for president.","post_message":"As the remaining candidates turn their attention eastward, the style and locations of events are going to look different than they have in the past."}]
