[{"comment_id":"1131999030168888","commenter_b":"Heroin is effecting all colors all races from all backgrounds!!!","commenter_a":"I like how heroin is effecting white people the way crack effected the black community but the way the media and police are dealing with it is completely different. Instead of calling them junkies or addicts it's an epidemic and now it's a family issue. Just lock them up like you did to black people in the 80's.","post_message":"Police want you to see these viral images of what heroin is doing to families."},{"comment_id":"1410976518925134","commenter_b":"like dying in the sea coming from Europe to steal Mexican and Native American land?","commenter_a":"I wish people would realize this is actually happening and innocent people are losing their lives! of course under ignorant trump supporters everyone is Mexican","post_message":"Donald J. Trump is already deporting people to Mexico  even if they're not Mexican."},{"comment_id":"1090370634418986","commenter_b":"@username lol nah it's the bitchy women that make good men run from all women.","commenter_a":"The man is my younger brother and this girl is a psycho. She broke into his house, they WERE engaged but not living together, and she stole $2.1 MILLION worth of jewelry. And this stuff happened AFTER he paid off her house and bought her a business, (just a nail salon). My brother was married for over 20 years and his x will tell you just as I will that he is the most laid back and passive guy you'll ever meet. She sent the jewelry to her parents via UPS and now they're in just as much trouble. The stolen merchandise was never recovered","post_message":"This woman has said her ex-fiance hit her, causing a black eye and other injuries. But now his attorney says this home surveillance video tells a different story.  It's the latest round in a legal battle involving allegations of millions of dollars in stolen jewelry that's unfolding in a Bay Area courtroom: @webpagelink"},{"comment_id":"1038152239553568","commenter_b":"She is dumb","commenter_a":"Guess she will have to work for a living now","post_message":"This model lost everything."},{"comment_id":"1357316664288360","commenter_b":"You have got to be kidding. These people are making bad decisions how long are we going to baby adults too stupid not to do drugs? Why can't our country figure out what ILLEGAL means? How about illegal immigrants and illegal heroin.","commenter_a":"its better then clinton","post_message":"Ithaca's mayor wants to open safe injection rooms for heroin users."},{"comment_id":"10158241911570405","commenter_b":"That part about Kansas is not true. Our state is so far in the hole and we do not have the \"workers\" with that income. It was a pipe dream. The state just passed the largest tax increase in history because of the lack of income. Our budget fell short ever since this governor installed is plans.","commenter_a":"Once again @username when you source things from right wing rags, you lose credibility. Most won't even read it and those who do already support you. It's concerning that these are the only sources you can reference...","post_message":"Welfare Reform & Wisconsin: Walker Is Leading the Way | National Review @webpagelink"},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. \"We hope and pray the U.S. Coast Guard is able to bring Samantha home.\" @webpagelink"}]
