[{"comment_id":"1203190183110565","commenter_b":"And Trump will build a wall and call you a rapist!","commenter_a":"It happens every election year, Bill Clinton (2 terms), G.Bush 2 terms, Obama 2 terms they pander for our votre (Hispanic) and once they get into office what do they do for the Hispanics. Bill Clinton had a few token Hispanics in his administration so did George Bush and very few with President Obama. Now Clinton and Sanders are also clamoring for our vote. They will probably get the majority of Hispanics to vote for a Democrat but I have a feeling that once Sanders or Clinton get in it will be more of the same for Hispanics in high governmental positions, Nada or muy poquito!, Trump has alienated about 99.9% of Latinos and every other race and if he gets in who knows what he will try to do with every so called minority group in America. The KKK will administer Homeland Security, the Amereican Nazi Party will administer ...","post_message":"The state so rarely has much say in a presidential race..."},{"comment_id":"10154325210061336","commenter_b":"Let's just deport him. I'm sure that he has learned his lesson and he will never come back. (Sarcasm) Seriously, just shoot him. He's a criminal non citizen, here illegally. He shouldn't be entitled to any of the protections that our constitution affords us and neither should any other illegal immigrants that further engage in criminal activity.","commenter_a":"It may happen more then you can imagine!!","post_message":"Rene Ortiz Quintana, 69, took the identity of Ruben J. Gallardo – who has been dead since 1994 – to get Social Security, VA and other Federal, state and local benefits since 2012."},{"comment_id":"1357245971012470","commenter_b":"I prefer her to LEAVE!!!","commenter_a":"The way you get around those problems young lady is to loudly speak out against radical Islam, disavow any sympathy for them or their cause, encourage other like minded Muslims to do the same. That's how you stop the American people from associating you with them. Or you could just leave the country.","post_message":"She joins CNN's Costello to trash Trump after his victory..."},{"comment_id":"10153885822754087","commenter_b":"Lmao.. She's a moron","commenter_a":"@username hysterical","post_message":"Hillary Clinton took things a bit too literally during a recent campaign stop when she read the word “sigh” off her TelePrompTer instead of actually doing one. WATCH:"},{"comment_id":"1003970486337899","commenter_b":"Oh pls woman get a grip. Really if you think that then move your was out of this co","commenter_a":"She must be racist then to think that.","post_message":"Oprah Claims White People Are The Cause Of Racism In America. What a hypocrite, she is the racist. Do you think Oprah is bigot?"},{"comment_id":"10156034180320389","commenter_b":"He is a crybaby and moron. I used to watch him until he started with the crocodile tears and he looked so pathetic. The media should report news and not shove their opinions on anyone. If he hates Trump, that's his opinion and he should not voice it on the air","commenter_a":"It's crazy how Trump fans treat those who disagree with them. Many Megan Kelly fans and Beck fans threw a fit that someone didn't believe as they did about Trump. Is this how we treat each other? Drop people like a rock when they disagree with us? Start name calling? Sean answered Beck honestly and with class. Which is more than most of you are doing. I have great respect for Beck AND Hannity. Even if I don't always agree with them. But after years of following Glen Beck- it's clear that nothing drives him more than a love for this country.","post_message":"My response to Glenn Beck who criticized me earlier this week for supporting Donald Trump."},{"comment_id":"10154020630826636","commenter_b":"@username however... that's detracting from my point! My original comment was about the UK's inability to prosecute migrant sex offenders!","commenter_a":"The only problem people in the uk have with immigrants, new British, Muslims etc... is the lack of police prosecution and \"special treatment\" minority groups get. There are an estimated 1 million cases of Islamic grooming, which've been swept under the carpet, by social services or went uninvestigated by police because of fear of being branded racist! That's not just some \"bigoted\" or \"islamphobic\" propaganda.. that's the reality of people living in a heavily Muslim populated area! The problem isn't with immigrants or non white Christian Brits... it's the lack of ability to deal with the crime coming from their community's by the authorities!","post_message":"Ironic?"}]
