[{"comment_id":"1549806335319114","commenter_b":"She is why we don't need women leading our country.","commenter_a":"She is nuts!","post_message":"An RNC delegate just announced the great lengths she’d go to make sure Trump doesn’t win, it's not going to sit well with many people..."},{"comment_id":"1517058091671594","commenter_b":"Sisters don't destroy our men like BECKYS DO....WHEN THEY FINISH WITH YOU...YOU ARE DONE!!!! PERIOD","commenter_a":"not really a black white thing. but a man woman thing. woman of all colors have gotten away with assaulting men since forever, only it now comes with a nap. as it should.","post_message":"New Video of Joe Mixon Altercation and How Society Ignores White Female Violence Towards Black Men"},{"comment_id":"1231385010209866","commenter_b":"Hahahahaha en fisica te salve de tu proyecto :v","commenter_a":"@username pa que se te de mejor química xD","post_message":"This is how they should teach chemistry in school. Video by Marie Skłodowska-Curie Actions."},{"comment_id":"10154480088981636","commenter_b":"female subjugation, taught from birth, how disgusting","commenter_a":"I hope they wear something to let people know they are the police","post_message":"Brilliant"},{"comment_id":"10152633763458525","commenter_b":"So because somebody disagrees with you they lack common sense. That's very adult of you.","commenter_a":"And people say that pot doesn't hurt anyone.... That's two deaths due to pot sales just during the holiday season. Pot hurts....even kills.","post_message":"They are just 15 and 16."},{"comment_id":"1013860195337176","commenter_b":"Vanessa: Do give Hillary's accomplishments that make you so proud. Are you proud of being lied to?","commenter_a":"The republicans are bunch of jokers ,am so proud to be a hillary supporter.","post_message":"If you're proud to be a Democrat after watching tonight's Republican debate, add your name here: hrc.io/1L9yvI6"},{"comment_id":"1285543264804515","commenter_b":"No, and unless her ancestors were Native Americans, they were illegals and traitors to the Crown.","commenter_a":"She's as ignorant as she is ugly, does she not know anything about American history for Christ sake.","post_message":"Someone should tell Ann Coulter cocaine makes you age poorly."}]
