[{"comment_id":"10153948812912434","commenter_b":"@username you are a AntiWhite and you are for White Genocide that is why you call me a Nazi. ALL White countries and ONLY White countries are being flooded with third-world non-whites, and Whites are forced by law to integrate with them so as to “assimilate,” i.e. intermarry and be blended out of existence. Massive immigration and forced assimilation is genocide when it’s done to Tibetans in Tibet. When it’s done to Whites in White countries, it’s called “diversity.” By UN Convention, it’s genocide: “Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part.” Diversity is a code word for #WhiteGenocide!","commenter_a":"White genocide is real and we can prove it. Learn the truth. @webpagelink","post_message":"The threat of ‘white genocide’ is a conspiracy theory, promoted by elements of the so-called alt-right and fueled by anxiety over fertility and immigration trends, that was popularized by South Carolina segregationist Bob Whitaker. The idea also comes up in the writings of Dylann Roof, who murdered nine black parishioners at a church in Charleston."},{"comment_id":"585287011661878","commenter_b":"We don't need Muslims here for s*** this is America... They need to stay the f*** home...","commenter_a":"Get out of my country.","post_message":"Furious Muslim students rush stage during American Sniper showing.  They have no respect. If they don't like American Sniper they can leave.  Do you agree these Muslims are out of line?"},{"comment_id":"10154744245648812","commenter_b":"If these thug out moms stop killing their kids everyday in the dam news","commenter_a":"And not one BLM protester was there. It's glaringly obvious that black lives really don't matter to them when it comes to black on black violence and by the way...contrary to popular belief and as told by one of those protesters black on black violence is not a myth, it is real and one should look no further than Chicago to see that black on black violence continues to rise at a rapid rate.","post_message":"Chicago saw its bloodiest month in two decades this August, with 90 murders, 384 shootings and 472 total shooting victims."},{"comment_id":"10153663985481509","commenter_b":"Americans don't know half the stuff the government does.","commenter_a":"Loose lips don't sink ships anymore or what?","post_message":"The U.S Air Force's 'secretive space plane'... what exactly is it? CNN Rachel Crane reports: @webpagelink"},{"comment_id":"10154732730043132","commenter_b":"BUT is he jewish?!","commenter_a":"Daniel Foisset","post_message":"It looks like Aly Raisman has plans for after Rio!"},{"comment_id":"10153394655753908","commenter_b":"is anyone here surprised by this information?","commenter_a":"Get a grip","post_message":"For those who haven't seen this yet. \"Ever single terrorist attack in the US was a false flag attack.\"  There is a tremendous amount of research to back up this statement."},{"comment_id":"1642358432731311","commenter_b":"She was queen to Obammy's King. Both suck!","commenter_a":"This dumb bitch needs to shut the fuck up!","post_message":"Do you think Oprah is a bigot?"}]
