[{"comment_id":"10152813780680950","commenter_b":"Kill the devil baby it comes from a rapist. The seed of evil grows within her.","commenter_a":"EVERYONE SHOULD REMEMBER U WERE ALL A FETUS AT ONE POINT TOO, MAYBE SOMEONE DEBATED ABORTIONING U WHEN THEY WERE PREGNANT, BUY UR HERE!!! I BET ALL U PEOPLE ARE AGAINST THE DEATH PENALTY TOO.....DAMN HYPOCRITS DONT WANT TO KILL AN ADULT BUT U WANT TO KILL A BABY!?!?!?!?","post_message":"In Paraguay, abortions are banned in all cases — even rape — except when the mother's life is in danger."},{"comment_id":"1015223798498631","commenter_b":"I see what you did there","commenter_a":"That's gold","post_message":"Sorry folks."},{"comment_id":"10158155475600615","commenter_b":"Man baby. Strong women make them crazy.","commenter_a":"No surprise! We might respect the office of the President, but that's not \"carte blanche\" for Trump to do whatever pleases his whim.","post_message":"Check out these images from Women's Marches around the world."},{"comment_id":"523969991126914","commenter_b":"That's the whole purpose of the melting pot. To asimilate and not for every culture to impose their beliefs on the rest of the country, loyalty to the people and to the American flag.","commenter_a":"Get them the he'll out of our country !!!","post_message":"A lunch lady was fired for serving pork to a Muslim student. We are in America, give that poor lady her job back. Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"10154534078174445","commenter_b":"I know. Is that close to where you live? It's scary","commenter_a":"Sharon Leahy-Lind Elizabeth Lind","post_message":"Imagine you're enjoying a day in the woods, walking down a trail when you see THIS: a large snakeskin. @webpagelink"},{"comment_id":"970468323009697","commenter_b":"@username PLEASE vote for Hillary she is on her way out, just ask Biden, ask Obama, ask Bernie, ask the FBI. So plz do us a favor and vote for her, she will need something to read in jail and your voting ballot will be perfect.","commenter_a":"She might have a college plan but how could she do it from jail?","post_message":"How much could your family save with Hillary’s college plan? In Oklahoma, a family earning $75,000 per year could save $22,300."},{"comment_id":"10154498360755958","commenter_b":"You mean the Virginia Mary who gave birth to JESUS. I highly doubt that is the reason for the hijab..when many women rose up in the middle east against wearing it.","commenter_a":"I am amazed and sickened by the racist comments posted here. She is a doctor working in America saving American lives. She can wear whatever she chooses because this is America. Wow...","post_message":"\"I'm so happy to be back here in Cleveland.\" The Cleveland Clinic resident who was forced out of the U.S. under President Trump's executive order is back home and speaking out for the first time."}]
