[{"comment_id":"511284652397563","commenter_b":"@username Riddle me this Kat Can you please enlighten any or all of us exactly what it is that Trump can and will do for us? BESIDES build that wall and MAKE AMERICA GREAT AGAIN????","commenter_a":"Serious question: Hasn't there been enough debates? Cruz has had plenty of opportunities and has yet to take advantage.","post_message":"\"Let’s make it a two-hour debate. CNN has already scheduled it. You’ve got a venue. You’ve got a location. You’ve got TV cameras. The only thing missing is Donald Trump because he’s too scared to debate.” —Ted Cruz"},{"comment_id":"10157109427360354","commenter_b":"but.. its ok if your a doctor and have permission?","commenter_a":"She looks evil!","post_message":"A woman from Boulder, Colorado, was sentenced to 100 years in prison for attempted murder and unlawful termination of a pregnancy after attacking a stranger and cutting her baby out of her womb."},{"comment_id":"787010171427640","commenter_b":"so much for tolerance","commenter_a":"I'd of accepted her resignation effective right then!","post_message":"Citing \"separation of church and state,\" the councilwoman resigned.  What she did almost immediately afterwards is raising eyebrows."},{"comment_id":"872957136089257","commenter_b":"lol bitch...u aint smart","commenter_a":"Harashi Dang u get this pic? Lol","post_message":"Classic. ~Will  More photos at Afghanistan Combat Footage - Funker530"},{"comment_id":"1154513944599658","commenter_b":"Open primaries work just fine Terrence.","commenter_a":"Yea- Bernie baby! This was a closed primary and they are near a tie!!!!! Can you imagine if they \"allowed\" everyone to vote?!!!!! #therevolutionishere","post_message":"UPDATE: Sanders wins the Oregon primary, while Clinton appears likely to eke out a narrow win in Kentucky. Sanders' cut into Clinton's 270+ pledged-delegate lead likely will be single-digits."},{"comment_id":"555636131271583","commenter_b":"I HOPE THE IDIOTS NAME LIST I HAVE SEEN DO! We Will cleanup AMERICA! BY THESE WEAKKNEED BITCHES LEAVING WE CAN HAVE A REVIVED NATION","commenter_a":"If only it were true. Jobs for everyone!","post_message":"28 percent of American voters said they would likely consider leaving the country if Donald Trump becomes president."},{"comment_id":"992902970750561","commenter_b":":/ I think misogyny runs pretty rampant here. Look at what happened recently in Alberta. A dead woman's genitals were presented in court as evidence that she was stabbed in the vagina after she died from internal injuries to that organ. Usually, a doctor simply saying \"there was a stab wound\" would be alright.","commenter_a":"How long before someone argues some ridiculous point on this?!","post_message":"Thanks for the image, ATTN:!"}]
