[{"comment_id":"1796926360545603","commenter_b":"I well tell you some thing... The isis was made by usa","commenter_a":"Vote Trump. .... what's the matter killary fans u guys worried. ... U should be","post_message":"We are going to get rid of ISIS! America needs real leadership. #MakeAmericaSafeAgain"},{"comment_id":"1723943734489970","commenter_b":"Not only ridiculous, but stupid. What did Muslims have to do with the Holocaust? There far more people that are not offended by things that offend the Muslims. It is still our country, who make only one race happy all the time. Leave this alone and it may just prevent the horrible era from ever happening again. God please help us.","commenter_a":"WRONG!!!","post_message":"Schools Are Dropping The Holocaust From History Lessons To Avoid Offending Muslims. Things are getting ridiculous. Do you think this is wrong?"},{"comment_id":"10153840727706341","commenter_b":"Not allowed in Israel!","commenter_a":"Hmmmm,its agreed if the Arab (Muslims)will condone their daughters marrying a Jew husband.But how about the Jews too?will they agreed their daughters to marry an Arab?","post_message":"More than half of the French-Muslim adults surveyed would react positively if their daughter married a Jew."},{"comment_id":"1384915431551722","commenter_b":"Sorry dear i said this woman is really DISGUSTING ohh","commenter_a":"is she speaking from experience?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154682154393984","commenter_b":"She's the whore of Babylon","commenter_a":"Let me tell you all her dx.......she needs Jesus Christ!!! Maybe she is possessed by a demon, highly likely......! God has allowed her to come to ruin because she wont turn from her wicked ways.....for those who do not like my comment.....read your bible, you will find out lots a things God allowed to turn people away from sin!!!","post_message":"There's been lots of speculation about what might be ailing Hillary Clinton, if anything. One dental expert took a look inside Hillary's mouth... and almost instantly, he said he knew the condition that's been causing all of her health problems.  Could this expert be right?"},{"comment_id":"1361368557222876","commenter_b":"Toni, I never commented previously so I don't know what your delusion of reality is. Trump never banned all Muslims. My buddy Wayne Allen is very capable of comprehending what the fuck Trump said. He isn't an intellectually lacking derelict who has lost his way and found himself sucking Democratic titty. What Trump stated is that he would implement a vetting procedure to insure ISIS doesn't send men in with the hundred thousand other young refugees this piece of shit Democratic government is wanting to allow in. I fight for the people, brotha. Not the government. I protect this land we walk on from those who wish to impose radicalism here. Those people are our government. I am the mother fucker that will bleed on my home soil, for the real interest of our nation, not individual interests. As far as Native Americans suffering from our conquering; yeah, well, that's ...","commenter_a":"You people are the most ignorant people around. Your even more so then the Trump idiots. Leave these people alone. You should be more afraid of your neighbors. More Americans kill Americans then Muslims do. Watch the news.","post_message":"More than 20 people were stung by a swarm of bees outside a mosque in Phoenix, Arizona."},{"comment_id":"10153202617203690","commenter_b":"Stupid girls!!","commenter_a":"We must ask ourselves why and find the antidote. The only way.","post_message":"Security forces estimate some 600 British Muslims have travelled to Syria to join the conflict there, some of them with the Islamic State of Iraq and Levant group."}]
