[{"comment_id":"10154179510106409","commenter_b":"Lmao. Now she can STFU.","commenter_a":"Lol. Yes!!! I saw this coming and I'm loving it. Fall of the bully. Does she still want to fight Mayweather? Dwl","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10156665343745725","commenter_b":"Build the Wall!","commenter_a":"Thank you Donald Trump, I know all of this campaigning is a lot of work and tiresome. I sure hope you can find all of the strength and energy you need to keep up with negative stuff, because I know you are fighting for us the people. And we sure want you to go all the way to the Presidency. There has been no one will to fight for common sense and for the normal and real people of the great country. We all just need a chance to do and be great! Thank you again","post_message":"GOOD MORNING SOUTH CAROLINA! Do not forget to get out and vote today! The poll numbers are outstanding. They mean nothing, if we don't ALL get out to the polls & VOTE! Together, we will MAKE AMERICA SAFE & GREAT AGAIN! Thank you!"},{"comment_id":"1016384461715898","commenter_b":"So stop your judgemental whining bitch","commenter_a":"Sorry mice, but as someone with crohns I fully support this research.","post_message":"Researchers have engineered small intestinal tissue from human cells, and when placed in mice, the transplants were able to digest and absorb like the real thing."},{"comment_id":"895085380544226","commenter_b":"she shouldn't be driving on suspended license and the police where doing there jobs","commenter_a":"go back to where you blong","post_message":"(Video) If she wins, it will place Sharia law above our own and above the safety of police officers.  It wouldn't be the first time this part of Michigan has seen Sharia law placed above the law of the land....  @webpagelink"},{"comment_id":"10152564935772217","commenter_b":"pussy","commenter_a":"D man is a fool is dis how you catch a thief","post_message":"Brave or stupid? This passer-by tackled a robber who'd just raided a jewellery shop in London: @webpagelink"},{"comment_id":"10153242310616336","commenter_b":"Well what does Baltimore have to say now? I just can't believe those two cops were harassing those two nice men.","commenter_a":"They thoght they could get away with it!","post_message":"UPDATE: A third suspect has now been arrested after the shooting prompted a statewide manhunt.   The suspects accused of killing two Mississippi police officers in the line of duty were reportedly arrested early this morning."},{"comment_id":"10153172465199255","commenter_b":"Bye Felicia!","commenter_a":"Thank God!!","post_message":"Whoa."}]
