[{"comment_id":"610661985768228","commenter_b":"white kids of lower middle class know what it is like to be in those areas of transformation and watch their towns become unsafe ghetto's. These immigrants always come forcefully in the streets to establish turf and whites have dealt with it from every race that comes in. don't know ghetto's eh, some of us know and were forged in them. what an ill guided statement to make","commenter_a":"Love the positive comments here, and even if theres negative comments bernie will always have a great comeback as he did in the debate last night. This man deserves the title of president. So much can come from this stop thinking about it & vote for him","post_message":"I am very proud of being Jewish, and that is an essential part of who I am as a human being. My father’s family was wiped out by Hitler in the Holocaust. I know about what crazy and radical, and extremist politics mean. I learned that lesson as a tiny, tiny child when my mother would take me shopping, and we would see people working in stores who had numbers on their arms because they were in Hitler’s concentration camp."},{"comment_id":"841387199293221","commenter_b":"Lol bitch ass no life","commenter_a":"Who cares about a road named after we want justice for her and her killer or killers in jail for murder so sad hoping we get justice sad it takes this to game a road names after you praying for your family and friends rip Sandra justice 4 Sandra","post_message":"It is the same stretch of road on which she was arrested."},{"comment_id":"10153089034256051","commenter_b":"She should have either buckled herself then got sick or she could have knead down holding door and do it that way ( some vans have a handles)..or have a push window..or found something to vomit in","commenter_a":"There is a reason why yiu are suppose to wear a seat belt. Glad she is ok though.","post_message":"This woman began feeling sick while driving and ended up opening a car door to throw up. The problem is, the car was still moving at the time."},{"comment_id":"1222107054548141","commenter_b":"Fucking weird bitch","commenter_a":"'@username @username wdf","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"10154100013603598","commenter_b":"I have no more words to write about this witch","commenter_a":"Add murdering human life to the list of HER immorality!","post_message":"Hillary Clinton: An Unborn Child Just Hours Before Delivery Has No Constitutional Rights"},{"comment_id":"10153583881674087","commenter_b":"What Hillary Clinton is going to do about the unpaid maternity leave that women have to take there is no coverage for that in the United States","commenter_a":"Nancy was backing trump","post_message":"Hillary Clinton will leave the campaign trail on Friday to attend the funeral of Nancy Reagan and pay her respects to her fellow former First Lady who passed away this week at the age of 94."},{"comment_id":"883241831711239","commenter_b":"'@username another liberal who's mother should have swallowed","commenter_a":"I back the police , i hope they do turn their backs on Obama , he is a worthless piece of sh**","post_message":"PLEASE do this, cops!"}]
