[{"comment_id":"10153621477392293","commenter_b":"Holy crap. Did you even read it?","commenter_a":"UCMJ does prohibit frat w subordinates. This was NOT RAPE. Rape is not consensual. She was consenting then because he pulled away? She claims rape?? Not fair. If she wanted to be an officer then suck it up buttercup.","post_message":"A Naval Academy teacher fights to prove he’s innocent of sexual misconduct. Then a lost cell phone is found."},{"comment_id":"1115407108512795","commenter_b":"Jay Z is trash just like his skank wife!","commenter_a":"Can't stand Jay-Z, or his mop! Sad she has to pull the hypocrite card but in office she never did anything that's credible anyway!","post_message":"“He used every word in the book. Can you imagine if I said that?” asked Donald J. Trump."},{"comment_id":"10153316472741336","commenter_b":"Hell no she shouldn't lose her job, she should of took another pic with her legs wide open !!!","commenter_a":"@username I agree!!","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"966472163391020","commenter_b":"They won't last very long if they show up here!","commenter_a":"Already here","post_message":"Nothing but a change in leadership can stop this."},{"comment_id":"628365077296674","commenter_b":"\"Woman\"","commenter_a":"woman?","post_message":"I want her sick face everywhere......people need to know how twisted this woman is!"},{"comment_id":"10153664512035530","commenter_b":"Ya Chaldean girls are cute ;) lol","commenter_a":"Honestly it's about half right. But if you want to talk about the Metro Detroit area as a whole there are some really beautiful women in the area. I was at Exodos rooftop (in Greektown) in the Summer a couple years back talking to a girl that was there from Philly and she said how good looking everyone was. The Albanian and Chaldean women in Metro Detroit are GORGEOUS. The city itself might not be the prettiest but there are some beautiful foreign women in the area. But I know the article wasn't just focused on the people.","post_message":"Detroit takes it on the chin in this survey based on nightlife, setting, hot locals and \"an undercurrent of desire.\""},{"comment_id":"569394436600860","commenter_b":"I'm going to Mexico...go ahead Trump, make Mexico build that wall. Im ready to get tha hell outta of US now!! () cant wait to see you make them pay for it!!","commenter_a":"this is just the start of making America great again.......brace yourself....:(","post_message":"Donald J. Trump's win has sparked turmoil in the global market. CNNMoney's Christine Romans and Richard Quest are talking about how the world’s economies are reacting to the election – share your comments and questions below."}]
