[{"comment_id":"10154959476789411","commenter_b":"@username president Melania Trump after Pence. Lollll","commenter_a":"\"Psychologists tell us that 3 and 4 year olds often lie to get their way because they don’t have a moral understanding of the importance of telling the truth. 4 and 5 year olds often bully other children because bullying is a way of asserting their dominance and making themselves feel more secure in a world that is beginning to seem very scary. 5 and 6 year olds are often thin-skinned and vindictive toward peers who criticize or make fun of them because they are at a stage when they have exaggerated concerns about the opinions of others toward them. 6 and 7 year olds are often excessively narcissistic because they don’t understand their place in the world and haven’t yet developed the moral capacity for empathy. It follows that Donald Trump’s emotional age is somewhere between 3 and 7. Assuming that the Electoral College makes him President on December ...","post_message":"Unlike most presidents, Carter has refused to let his successors do the job they were elected to do. On Jan. 20, he will be pushed aside by Obama."},{"comment_id":"1836028549960584","commenter_b":"She is our next President.actually Trump made it easier for her .","commenter_a":"Yeah, it pisses me off ... but my respect for her has just gotten greater.","post_message":"She and her supporters smile and thrive despite a daily avalanche of hatred."},{"comment_id":"10154898475594657","commenter_b":"Trump Beat Trump.","commenter_a":"Bunch of lying scumbags! They've always known that Trump was going to crush them. They scurry around like the rats they are, searching in vain, for a way to beat Trump! TRUMP 2016!!!","post_message":"\"All of us shouldn't even have answered that question.\""},{"comment_id":"10153351807966130","commenter_b":"*you're behind a foolish *woman","commenter_a":"GO GIRL. WE'RE BEHIND YOU!!'","post_message":"Ashley Burnham was the first Canadian and aboriginal contestant to win the Mrs. Universe contest."},{"comment_id":"1882169925350064","commenter_b":"she needs 2 take a step back! She also needs 2 learn 2 RESPECT OTHER PEOPLE,S OPINIONS! If she doesn't like it here...LEAVE!","commenter_a":"Get rid of her. She's a real Bitch. Jeanie","post_message":"Whoopi Goldberg just crossed the line when she said this about Trump's children. She just got taught a lesson she'll never forget. Should Whoopi be kicked off the air?"},{"comment_id":"10153054434811051","commenter_b":"So sorry he killed himself. The creeps that haunted him should all be rounded up and put in jail.","commenter_a":"Well I hope those bullies are proud of themselves. ...they know who they are and they all have blood on their hands. KIDS.... BE CAREFUL WHO YOU BULLY....THAT PERSON MAY BE YOUR BOSS SOMEDAY! In school everything that happens seems like its life altering end of the world BS. Guess what....it's just high school....life goes on....nothing is worse than suicide. ...sometimes the worst thing that happens turns out to be the best thing.","post_message":"This boy loved hunting and trapping, and other students made fun of him all the time for it. He just couldn't fit in with them. Eventually it became too much."},{"comment_id":"10153064195022377","commenter_b":"This lady is destined to be behind bars. Narcissus is her mode of operation and her eye shadow displays deceit.","commenter_a":"As I always Say, Can't Fix Stupid. SHE IS.","post_message":"Newsmax shares the 10 most crucial moments from the Planned Parenthood hearing."}]
