[{"comment_id":"10153032045224411","commenter_b":"Don't waste your time here Ana! The reason why some of these people have tunnel vision is because their heads are deeeep up the RACIST European and American governments ASSHOLES they can't turn their heads to see what is really happening on side...","commenter_a":"Sadly people are not intelligent enough to draw a line between a religion and extremism. Had these cartoons been about Jesus instead of Mohammed a crazy christian extremist could have done the same thing, but I doubt that would be followed by throwing grenade at a church.","post_message":"'I personally believe that the death penalty should exist in our legal arsenal.'"},{"comment_id":"864444063671976","commenter_b":"Super gross. I can't stand that feeling how some women think it's sexy is beyond me.","commenter_a":"Gross","post_message":"Armpit Hair Is Trending, And It’s A Step Forward For Women Everywhere"},{"comment_id":"10153621315776037","commenter_b":"Me either, but because of my mom, I've been around terminally ill people as I worked for her. This is a big deal and I believe it's important. Suffering through a long painful death is hard on families as well as patients.","commenter_a":"Death with dignity is a big deal to people. Unless you're living with a terminal illness, I suggest you leave your judgement at the door.","post_message":"Religious groups and advocates for people with disabilities opposed a nearly identical California bill earlier this year."},{"comment_id":"10154623133343812","commenter_b":"maybe you cheat a wife","commenter_a":"Bill stated how wonderful a wife Hillary is...question...why did you have all those affairs then Bill???","post_message":"JUST IN: Tim Kaine officially wins the Democratic vice presidential nomination. @webpagelink"},{"comment_id":"1013220235397406","commenter_b":"She is an ugly witch. No wonder Bill looks elsewhere.","commenter_a":"Hillary is a has been Murder Embezzlement List ghost oes on","post_message":"ISIS just needs a hug..."},{"comment_id":"1409042789109576","commenter_b":"@username no they didn't. Both were smart enough to use classified systems to access classified information...","commenter_a":"The problem is that his supporters are not intelligent enough to care about any of this. The one true thing he has said is that he could commit a murder in Times Square and his supporters will still support him. That's why he panders to the low intellect crowd.","post_message":"ALERT! Yet another corruption scandal threatens the whole Trump family."},{"comment_id":"1219528801419908","commenter_b":"^^^dumb bitch","commenter_a":"The one and only way it could have been prevented was if he complied with the officers instead of resisting after being tasered twice and thrown to the ground.","post_message":"CASE CLOSED....  @webpagelink"}]
