[{"comment_id":"1851225291776966","commenter_b":"well said ,","commenter_a":"Trump's Victory, in another term (American people's Victory) has proven that the good citizens of the USA are great at determining their future, and changing the game and the whole regime for a better living and even world because America has a big influence on the whole world. Despite the massive media war that had been trying and pushing hard to find a way to put Mr. Trump aside or down to fail him by any dirty politics, means and ways... BUT they couldn't do you know why? Because he is capable and honest and most of all I believe that the church of humble believers everywhere have had an input in this victory asking the Good Father for this amazing nation to shine His face upon America again as He did in the past...!","post_message":"Former President George W. Bush had this message for President-elect Donald J. Trump."},{"comment_id":"390976721026923","commenter_b":"She needs a new Do!!! Lol","commenter_a":"Yep holder in a skirt","post_message":"What do you think of the White House nominee for Attorney General?"},{"comment_id":"383095042054511","commenter_b":"'@username who the fuck needs a third world country when animal whore leaches like u and your mom keep my taxes well spent in my own country. Keep up all the hard work in defending the fucking animals in the post and I'll set aside a little part of everyone of my days providing good reading pleasure for all of the rest of us the know a money grubbing whore when we see one. And u would definitely make a great whore make no mistake. Just like your mom was.... Now go out and b the best whore u can b and quit falling back on my taxes to earn a cocksucking living. Thanks","commenter_a":"Limit welfare to 3 yrs unless disabled. ,quit paying for children to be born with taxpayets money. If you have achild and cant pay uour hospitol bill keep thier tax returns n apply them untill bill is paid off","post_message":"This mother of 12 lives entirely off government benefits. She also funds her plastic surgery with taxpayer money. She makes more per year than most people earn at work annually.  A petition has been created demanding that she get her benefits revoked. Do you support revoking her benefits?"},{"comment_id":"795518530581327","commenter_b":"There is definitely something wrong with this lady...","commenter_a":"Bully like Hily Holbrook from 'The Help' except for the racism.","post_message":"I can't stop laughing.....at HER."},{"comment_id":"1157156847640695","commenter_b":"All we need is more illegal Queers !!!!!","commenter_a":"Bullshit people!","post_message":"American taxpayers must now pay for separate facilities for folks who come across the border and don know what gender they are."},{"comment_id":"10154588771167178","commenter_b":"Are expecting any more snow or ice around Roanoke Rapids?","commenter_a":"Is it going to be windy today?","post_message":"WRAL Elizabeth Gardner is taking questions now about today's forecast and what you should expect. For the latest weather conditions go to wral.com/weather."},{"comment_id":"10153357248947061","commenter_b":"silly girl","commenter_a":"'@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."}]
