[{"comment_id":"10153561186861323","commenter_b":"Unfortunately that's just not true. Gangs control the production in the UK just like they do everywhere else. @webpagelink","commenter_a":"80% of cannabis consumed in the UK has been grown here. Your argument on that level is invalid.","post_message":"Jay Rayner: 'We are, it seems, living in the age of the wonky moral compass: of middle-class couples who swear by their weekly organic veg box, and yet relax after dinner with a line of something produced by impoverished, subjugated Bolivian peasants.'"},{"comment_id":"1283735711683013","commenter_b":"horrible woman","commenter_a":"How bitchy she is...very bad attitude though","post_message":"The Hungarian camerawoman who tripped and kicked migrants has been sentenced."},{"comment_id":"420321631489464","commenter_b":"how about someone do a drive by on these losers, it would do the world a great deed.","commenter_a":"Non existent","post_message":"Can you Imagine the Media Coverage if These Guys Were White?"},{"comment_id":"1202153396486746","commenter_b":"It takes 2 to tango","commenter_a":"That's not news! Thats standard procedure.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10157022006200725","commenter_b":"Crooked she is in everything!","commenter_a":"anything related to Hillary would Just get worse if she is in office","post_message":"Crooked Hillary just can't close the deal with Bernie. It will be the same way with ISIS, and China on trade, and Mexico at the border. Bad!"},{"comment_id":"10153420455089087","commenter_b":"Oh Brett. That's terrible. I am the wife Brett. I live in Texas, 10 generations next door to Mexico. Are there bad people there coming here? yes! Do we need immigration laws? yes! Will a wall stop it. No Brett. It wont matter how beautiful the wall is or how much it cost or who pays for it. Those drugs you smoke are going to make it here. Nothing you can do about it. The cartel will get immigrants and dope here. If anything there will be more killing and keeping that wall up is going to be draining on the economy. It's impossible.","commenter_a":"Trump's ability to showboat and boast out loud has a hypnotic impact on people who should know better. Please don't buy into Trumpmania.... he is all talk and I thought we were tired of that. You people have short memories. He was a full on liberal democrat just a few short years ago. Trump is telling you what you want to hear. He has no intentions of fulfilling these vocal obligations. It's all lip service and he will cater to his businesses before the people. Just because Bush isn't a loud mouth narcissist doesn't mean he can't get the job done. Trust me, you will never be so sick of anything as you will be of The Donald and his ego driven power play.","post_message":"“Donald I’ll take you on one-on-one in a debate, any time, any place,” Jeb Bush declared. “You name it and I’ll do it.”"},{"comment_id":"949797868421279","commenter_b":"Funny more women looking to have affairs on there then men","commenter_a":"Huffington Post UK, bad for those men, they cheating dirtbags and deserve no such discretion...' ? The point of a dating site is to meet potential partners, usually of the opposite sex. How many women are subscribed to Ashley Madison I wonder? Oh, wait. I forgot! If a woman is on a site like this it can't be because she is a 'cheating dirtbag'! It must be because she is 'exploring female empowerment'. Both sexes have a sex drive that can override sensible decision making processes. Both men and women are equally capable of cheating on their partners, so please The Huffington Post drop the 'all men are evil' act and think before you type!","post_message":"“Too bad for those men, they’re cheating dirtbags and deserve no such discretion...' Ashley Madison"}]
