[{"comment_id":"10155300892045354","commenter_b":"Pompous ass!!!","commenter_a":"the blank is \"Delta Sierra\"","post_message":"Watch this incredible video and then fill in the blank: \"John Kerry is a _________.\""},{"comment_id":"800436556756837","commenter_b":"And for what he's done to military, vets... Americans! Bringing illegals and terrorists into our country to kill us!!!!","commenter_a":"Yes! Obama should be put in prison for intentionally violating the law and for threatening others, who do enforce the law, with being punished for that enforcement.","post_message":"This Federal Judge Just Took Down Obama For Betraying America. We need more people in this country who will stand up against him. Do you support this judge?"},{"comment_id":"908796952508643","commenter_b":"@username, I think the big difference is that a brain dead person has NO CHANCE of neurological recovery. The same cannot be said for the vast majority of fetuses. A young fetus does have brain waves, does have a heart beat, and if left alone, an excellent chance of normal neurological function. We certainly would not be discontinuing life support in this situation on an older person.","commenter_a":"Women already have more access to healthcare than men. Show me a government funded chain of facilities specifically there for prostate cancer treatment. At any rate, cutting a living human out of a woman's body isn't healthcare and the living child certainly doesn't have a choice to be murdered or not during an abortion.","post_message":"When you tell a woman that she cannot control her own body, that’s extremism. Let's say it loud and clear: women control their bodies, not the government."},{"comment_id":"10154622879034024","commenter_b":"I think she should sue the college to go back and redo the 4 years and maybe learn something.","commenter_a":"There's no way she could be that dumb and have finished high school.I think we need to have a new law enacted Where our leading officials must have t least a IQ of 117 or above.But Them that would knock out 85-90% of them .","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"480329612157619","commenter_b":"deport all illegals","commenter_a":"and I went through 2 WTC bombings 5 months pregnant in the first one.. 2 back surgeries had and foot surgeries in the second and I could not get a dime to support myself and my daughter other than the Social Security Disability I worked for for 23 years ...in fact was told \"I made too much money to get any help\" Really????","post_message":"This illegal immigrant has been collecting welfare for 20 years... This is outrageous. Illegals on welfare should be kicked off and deported immediately. Should we deport all illegals collecting welfare?"},{"comment_id":"10156672176230615","commenter_b":"@username you're amazing. Marry me haha","commenter_a":"Let me be honest here. When the California primary happens I'm voting for Bernie. But if Hilary does win the democratic side I'll vote for her. No way am I letting a republican be president. Republicans will just do what they can to get rid of Obamacare, canceling out the rights for the LGBT community, sending our troops to meaningless wars. Hilary might go to war but however she might not. In the end I'm voting democrat for the presidency. A republican will just destroy this country and send us to hell. Not voting for democrat cause Hilary is it is voting for a republican.","post_message":"BREAKING –"},{"comment_id":"1284242998285633","commenter_b":"Proving they are not protesting anything really. They are just out to murder anyone they can for fun! Thugs paid for by Soros, Clinton's, Obama and others wanting one world government. Just like the Nazi regime but it will be 10 times worse. Liberals are too stupid to realize that. Until something they voted for creates a bad situation for them. Then they blame everyone else.","commenter_a":"That is really beneath everyone.","post_message":"So basically, this is incitement to murder and cops should treat them accordingly...what should they do?"}]
