[{"comment_id":"10153055472862293","commenter_b":"Shut Up..get outta here!!!! Lol...forgive blacks..?? psscvhh","commenter_a":"Should \"White America\" forgive racist blacks?","post_message":"\"If we really believe that black lives matter, we won’t devalue our reality and cheapen our forgiveness by giving it away so quickly and easily.\" via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"855360527843909","commenter_b":"Really clueless woman","commenter_a":"Shes not relevant!","post_message":"How's this for abortion logic?"},{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: \"Oh for goodness, that is not going to happen. I'm not even answering that question.\" #DemDebate"},{"comment_id":"10153195924381130","commenter_b":"I agree.......who the hell cares!! Dumb ass bitch!","commenter_a":"@username @username ...at that point, who the hell cares aye? Lol","post_message":"Do you even wanna know?"},{"comment_id":"10153422547304138","commenter_b":"I watched it go down from the top of the parking ramp it was a woman cop that chased him down #Girlpower","commenter_a":"Haha scary I live on that intersection thank god I'm moving","post_message":"Not every day an inmate escapes in your neighborhood."},{"comment_id":"10153864002342217","commenter_b":"Always the ones left behind, always on the pity party stage, always the why me question, always on the help me podium, it is exhausting.","commenter_a":"Most atletes from other climes left Rio as soon as they completed their stakes. Africa! Africa!! Africa!!! They will never cease to amaze.","post_message":"Kenyan athletes are stranded in a Rio shanty town after the closure of the Olympic village, the team captain says."},{"comment_id":"1868770480033724","commenter_b":"Why, because the system is being drained my illegal aliens and the corrupt gov. Trump is fixing that open your eyes.","commenter_a":"This is as embarrassing as it can get. I wouldn't want to be president of a country if I had to think so negative about it. America is a great place to live but they r making some poorer each day. Cut Social Security, cut Medicare, cut insurance , cut food stamp, cut cut. Why?","post_message":"No. Words."}]
