[{"comment_id":"10153003248257383","commenter_b":"And boot bitches like you.","commenter_a":"I wonder how many of you bitching about Audie Murphy are going to do something about getting him a day. He did a good job, told a good story, and Texas is proud of him. Get your panties out of a bunch and carry on.","post_message":"There is now an official 'Chris Kyle Day' in Texas."},{"comment_id":"1153743537971235","commenter_b":"She needs to be in prison!!!","commenter_a":"Really! I don't believe it! Her conscience must be getting to her. But I doubt it. Are they trying to make us feel sorry for her?","post_message":"Is this the real reason Hillary has so many \"issues\" when it comes to her health?"},{"comment_id":"1267016713333785","commenter_b":"Spanish and Latina aren't synonyms- Latina=a woman from Latin America. Spanish is from Spain. Jsyk !","commenter_a":"It's not really a stereotype when the cleaning industry is dominated by a majority of Latina woman. But I agree Latina women shouldn't be isolated to only this role, Spanish women work in a wide range of fields including healthcare, law and science. Many of these women have gone on to play great roles that where not maids. You start from the bottom.","post_message":"It's time to stop casting Latinas as hot-headed, sexy, maids."},{"comment_id":"10157481563535354","commenter_b":"Silly Rabbit illegals can't and most don't want to vote or do anything to bring attention to themselves....try again!","commenter_a":"Did anyone else notice that Bill Clinton basically told illegal aliens to vote for Hillary in his speech?","post_message":"Bill Clinton's Big Bomb of a #DNC Speech was SO bad, Even Progressive MSNBC Host Rachel Maddow is TRASHING it... WATCH:"},{"comment_id":"1082059028539299","commenter_b":"And whites don't hey dumbass All lives matter you would know that if you stayed in school 😬","commenter_a":"Because Black LIES Matter to those thugs.","post_message":"It's no surprise that the people at Black Lives Matter aren't exactly known for their ability to stick to the facts. However, this new data about black \"victims\" absolutely DEMOLISHES their whole agenda. I guarantee the media doesn't report on this... let's spread this everywhere."},{"comment_id":"10153750734644369","commenter_b":"Ya, and you will go after corrupt windbags in D.C next? It looks good on paper, but it wont happen. There are laws in place that wont allow this to happen. Take the LLC for example, go after the company but cant get the person. But then again, when did laws ever apply to this administration.","commenter_a":"They need a home now!!","post_message":"It is a \"significant scaling up\" of the U.S. commitment to accept refugees from Syria."},{"comment_id":"10153850798269614","commenter_b":"we definitely need to build this wall and make Mexicans pay for it","commenter_a":"donald trump is right we need to get this people out of this country","post_message":"U.S.-born Syed Rizwan Farook, 28, was one of two suspects identified in the fatal shooting rampage at the Inland Regional Center, police said. He and a female suspect, 27-year-old Tashfeen Malik, later died in a shootout with authorities."}]
