[{"comment_id":"10155824563490725","commenter_b":"White girl","commenter_a":"I am praying 'IN JESUS NAME' that Donald Trump becomes our President, WE should all pray 'IN JESUS NAME' that Donald Trump becomes our President so we can get our America back to the way God wants it to be. I know with Donald Trump as our President he will 'Make America Great Again', Amen!","post_message":"The U.S. will invite El Chapo, the Mexican drug lord who just escaped prison, to become a U.S. citizen because our 'leaders' can't say no!"},{"comment_id":"10153900355041378","commenter_b":"They are all crooked! This is what happens to women who try to play (and cause trouble) in the all boys club that is politics.","commenter_a":"Clinton should of appointed her to be her VP","post_message":"#BREAKING - One day after she was convicted of perjury and other offenses, Pa's Attorney General answers calls for her resignation. @webpagelink"},{"comment_id":"10153871706276051","commenter_b":"Who wears Crocs anymore?","commenter_a":"Debbie Pruitt French","post_message":"Do you wear Crocs? If so, you're probably going to want to stop ASAP."},{"comment_id":"10153825781392522","commenter_b":"There goes the fake Native American vote!","commenter_a":"Another documented lying Democrat fanning the flames. STFU Pocahontas","post_message":"'We will fight harder, we will fight longer and we will fight more passionately than ever.'"},{"comment_id":"10153721123493132","commenter_b":"Just another hoe looking for her five minutes of fame smh","commenter_a":"Remember when it was shameful and embarrassing to be the other woman.","post_message":"She is no longer an employee of the family."},{"comment_id":"1124537887639264","commenter_b":"It is a shame that one of the frontrunners for the Presidency is directly responsible for spreading the fears and bigotry that lead to this nonsense. Islamaphobia is going to ruin this country from within..","commenter_a":"And so it begins again The seeds of hate, distrust and ignorance have sprouted","post_message":"She never could have expected this. Not in America..."},{"comment_id":"10153867165952144","commenter_b":"Obviously not Mike. If she belonged in jail, they'd have put her there.","commenter_a":"So instead of corrupt it's lazy, stupid, or incompetent...hardly QUALIFICATIONS.","post_message":"This is a really smart piece from David Corn."}]
