[{"comment_id":"1213161752065703","commenter_b":"Report real news leave this story alone","commenter_a":"Do you realize that this constant back and forth over this story just reminds us that so-called 'journalists' in this age have NFI what they're doing? Being thorough is better than first, you all sound like a cross between TMZ paparazzi and the National Enquirer. Get a grip, you hacks.","post_message":"REAL OR FAKE? A Tennessee TV station stands by reports of a Santa's encounter with a dying child."},{"comment_id":"363905233797771","commenter_b":"Stupid wench. I hope her show and all of her movies bomb.","commenter_a":"And the answer to your question, YES. Oprah is a racist....","post_message":"Is Oprah a race-baiter?"},{"comment_id":"10153488869101636","commenter_b":"I am nothing close to a conspiracy theorist, but doing what I did in the military, I seen how cut throat people could be. Especially if they are scared that information will get out there that will harm them. I'm not saying that anybody did tamper with his breaks, all I am saying is that it is possible. Nobody cut his break line obviously because he would of known, but had some drilled a pin hole in a brake line or reservoir, then sealed it to make sure it didn't leak out while sitting stationary. Then as he leaves the drive way he is still able to brake because there is fluid there to press the caliper in, but it breaks the seal and starts to leak out and he could use the brakes so long that the hydraulic fluid is still able to pressure the system. By the time ...","commenter_a":"I am just throwing it out there but Im pretty sure if his brakes had been tampered with he would have known it after the first stop sign or stop light after he started his car.... They dont pick and choose when to work and when not to work when tampered with","post_message":"Police say the data box from Aubrey McClendon's vehicle registered what was happening just seconds before the crash."},{"comment_id":"10153550456286337","commenter_b":"Fat lisa loeb looking bitch","commenter_a":"Yeaaaaaah... That guy can fuck directly off.","post_message":"\"Somebody who’s overweight? I find that utterly repulsive and disgusting.\"  WORST. TRAINER. EVER."},{"comment_id":"10153533144730399","commenter_b":"@username, you might be a pussy as well...","commenter_a":"he is right and the American people share the responsibility for what happened in Oregon today....they continue to elect NRA bought and paid for officials","post_message":"\"Well this is something we should politicize. It is relevant to our common life together, to the body politic.\""},{"comment_id":"10153109103456636","commenter_b":"Shut our doors and keep them out","commenter_a":"Am I the only one disgusted by negative comments here? there is a big difference between migrants and refugees? if that was your child? seriously? and the fact that 99% of migrants pay a hell of a lot into society? that doesn't count? unnaceptable - we need to be helping now.","post_message":"'David Cameron’s muted response to the crisis is disgraceful"},{"comment_id":"10154345294706002","commenter_b":"We are fat enough. Plus the ratio is already perf","commenter_a":"No thanks Hershey can choke on there candy When they stop making it in USA like they used to we stopped buying it. We are so done.","post_message":"Hershey's says it will start selling Hershey's Kisses Deluxe in the United States beginning Nov. 5."}]
