[{"comment_id":"10154728738598352","commenter_b":"No excuse for those stupid people if that was my mom let me tell u poop would hit the fan they would have the biggest law suit and have everyone fired. No excuse for their stupidity bunch of idiots","commenter_a":"Thank God for Islam. We don't put our elders in these places and forget about them, alhamd lellah.","post_message":"Bedridden grandmother, 86, screams for help for three hours after staff at a dialysis clinic forget about her and lock up for the day"},{"comment_id":"1499576316724205","commenter_b":"Leave now. You are discase","commenter_a":"CANT WAIT","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"1612302922163164","commenter_b":"No idiots!!!","commenter_a":"No. Sickening. Stop enabling these nuts.","post_message":"Should Germany allow child brides out of respect for Muslim culture?"},{"comment_id":"1226784960751087","commenter_b":"How much is this going to coast the tax payers? What do you know about Hillary's REAL immigration policy, which will bring MILLIONS of radical, ideologically subverted maniacs here, who believe it is their right to oppress, enslave and kill women, gays and all LGBT people? Below are just a few of the extreme immigration positions held by Clinton. (1) Amnesty Within 100 Days *note: she has said she greatly admires Angela Merkel and will emulate her policies if she becomes president. Full amnesty for the illegal immigrant population will cost U.S. taxpayers $6.3 (2) Expanding Unconstitutional Executive Amnesty (3) Freezing deportations (4) Closing Detention Centers (5) Obamacare for illegal aliens (6) Full path to citizenship Hillary Clinton has called for a massive expansion in Middle East migration. As Donald Trump has observed, “Crooked Hillary wants a radical 500% increase in Syrian refugees.” “I’ll work to ensure that every single ...","commenter_a":"It's really sad to see so many of you Liberal Americans not caring about TRUTH, HONOR AND PRIDE.... To just over look the LIES AND HYPOCRISY of Hillary Clinton is pathetic.","post_message":"Given the biggest political gift yet of his troubled campaign, Donald J. Trump muddled his message and diminished its impact."},{"comment_id":"10153974538694228","commenter_b":"Wow. Two uneducated racists here.....Jean and Gary! Shame on you both!","commenter_a":"You can thank Trump for perpetuating this problem.","post_message":" Muslim? All of you should die! The man yelled from his car. He then went inside for his gun. Police are seeking hate crime charges."},{"comment_id":"1007015132691568","commenter_b":"They're a success for the home invaders, they don't have to worry about getting shot now.","commenter_a":"Sadly gun crime happens so many time in the USA one wonders why they just don't legislate for firmer gun laws, but then again that will never happen...","post_message":"'America is a financially failing filth farm', he ranted"},{"comment_id":"10154392424871130","commenter_b":"She has always been irrelevant!","commenter_a":"She is a Kellyanne wannabe. Open mouth, speak without thinking, non-stop, digressing, interrupting and not letting anyone else start or finish a thought. Hopefully very soon all of these people will be irrelevant.","post_message":"Mazel tov for (unintentionally) making us laugh before the election."}]
