[{"comment_id":"1900645696822355","commenter_b":"Fucking pigs!","commenter_a":"2seconds in & I can't even watch.","post_message":"His screams for helping are truly disturbing.."},{"comment_id":"10153614768367550","commenter_b":"Women shut da hell up I'm short hand writing","commenter_a":"People be ready to dissect the situation, wen in reality it's the system fault. What do you expect it's no jobs in Fayetteville. People looking at what I'm saying and they're lik Wat is he talking bout. Like I said it is no jobs in Fayetteville, and this is suppose to be a military town it should be jobs all over the place but it's not. It's three types of ppl in Fayetteville. The military, the civilians that's what they call us. And the third is ppl who do what ever it takes to get paid or feed they family. Now don't get me wrong yea it's messed up ppl breaking in ppl houses. But give these ppl job's and I bet all the money in the world they become a better civilian then the first person who commented on this topic. @username. No job's and this is Wat u ...","post_message":"\"And you're charged with a similar crime that you just went to prison for?\"  \"Yes, Sir\""},{"comment_id":"10155513356146350","commenter_b":"We need a Boog!","commenter_a":"@username Hannah Prior Joel","post_message":"WATCH: A baby bear named Boog meet his new fawn friend. HIS NAME IS BOOG. @webpagelink"},{"comment_id":"988941504498931","commenter_b":"@username c'est beau...","commenter_a":"@username Let them","post_message":"'I love you, wait for me, I'll be there soon'"},{"comment_id":"10154264363424071","commenter_b":"@webpagelink Nice keffiyeh scarf right ?","commenter_a":"@username why is it that every single shooter and terrorist has been \"known\" by the FBI. Why wasn't there an alert with TSA to make sure he didn't have firearms etc.","post_message":"Here's what we know so far."},{"comment_id":"539522582917416","commenter_b":"Well screw the NBA Players . . . pansy ass bitches!","commenter_a":"WHO GIVES A BIG RATS ASS WHEN YOU BACK A LOSER !!!!!","post_message":""},{"comment_id":"10154914956884411","commenter_b":"Agree! The protesters should just chill out, given everything we know about Trump, let's all PRETEND that this will be a normal president or let Murphy's law take its course!","commenter_a":"If you are an American, he is your president. Doesn't matter if you like him or not. I didn't want Hillary, however if she won, I would have still considered her my president. People need to grow up.","post_message":" is our chance to show the world that Donald Trump is not California president and that we are going to take direct action to defend our values, preserve our way of life, and protect our people."}]
