[{"comment_id":"1835427256744336","commenter_b":"Lock her up already!","commenter_a":"It's not important how many people are there what's important is how many VOTE BLUE!!!!!!!!!!! These two ladies have have more integrity in one finger than all of you HATERS.","post_message":"WATCH LIVE: FLOTUS Michelle Obama and Hillary Clinton campaign side-by-side in NC."},{"comment_id":"10153624513811336","commenter_b":"Now the world knows what Cheryl is all about when it comes to black people..","commenter_a":"We also have a president who has made it open season on our police officers.","post_message":"This week on Fox News Sunday: Gov. Chris Christie discusses his 2016 strategy, the government and more. Check your local listings or tune in to Fox News Channel at 2p/6p ET."},{"comment_id":"10153732430689117","commenter_b":"It is a completely legitimate discussion. In the 21st century private corporations have power equal to or even greater than a government's over people's platforms for speech and expression. In 10 years it is entirely possible that a single multi-national company will control all of the major social media platforms. Which means they could quite easily silence any viewpoint that they don't like. This in fact is already happening in many places around the world. Mark Zuckerberg will eagerly jump into bed with any ruthless dictator and agree to censorship on that country's population.","commenter_a":"There is no free speech war to be had. Twitter is a private entity and can ban who ever they like, for what ever reason. They do not have to abide but the first amendment, the government does.","post_message":"#FreeMilo just became a thing. Thanks, Twitter."},{"comment_id":"644885305702048","commenter_b":"A treasonous bitch","commenter_a":"How long is it going to take to get them both out. Seems to be all talk. They should have been long gone.","post_message":"Michelle was just caught red handed and is about to be charged with treason. Good. It's about time she was exposed. Do you agree Michelle Obama does not belong in the White House?"},{"comment_id":"1458627227490636","commenter_b":"We refused to take Germanies Immigrants & the Nazi's killed 6 Million! Racist, Bigots still lurk in all corners of OUR Country!","commenter_a":"^5","post_message":"State Department figures show that 2,340 Syrian refugees arrived last month in the United States."},{"comment_id":"10153434124594032","commenter_b":"@username illegals aren't just Mexican stop being ignorant.","commenter_a":"I'm on the fence about this, the immigrants being lazy living off the state should be taken back. BUT the hard workers doing what they can taking care of their families should not be bothered!!!","post_message":"#BREAKING: The deportation operation by U.S. Immigration and Customs Enforcement would begin as soon as next month, the report said. UPDATE: DHS plan to raid Central American immigrants draws criticism. Details: @webpagelink"},{"comment_id":"1174084612658964","commenter_b":"They are sex obsessed weak willed bonobos.","commenter_a":"What is the anti gunners obsession with genitals and degeneracy","post_message":"Cocks Not Glocks, the gun control group that literally strapped gigantic dildos to backpacks and made lewd gestures that would get any man thrown in prison, was invited to the White House last week. They actually completed their trip on Friday while I was enjoying my time fishing on the Oregon coast. The Cocks Not Glocks organizers posted their White House trip on all their social media accounts making it a big deal - all while Trump was taking flack for saying the word \"p*ssy.\" Now, as a woman, I have said before that I… [ 224 more words ] @webpagelink"}]
