[{"comment_id":"10157702092900354","commenter_b":"And yet she's still allowed to run for POTUS... And there are still fools who will vote for her","commenter_a":"They thought no one would ever notice .","post_message":"The Clinton Cash Foundation is a $2 Billion Corruption Racket."},{"comment_id":"10154279210266028","commenter_b":"Don't you say Hey to me you ugly girl!","commenter_a":"@username @username Oh geez!","post_message":"The two classic American novels have been temporarily pulled from shelves in one Virginia school district following complaints from a parent. @webpagelink"},{"comment_id":"1754494444782298","commenter_b":"If you have to ask what's wrong with him then you need to get a checkup from the neck up and have your ears cleaned out","commenter_a":"I sure hope he's getting 2 a.m. calls in the morning from people who hate his guts","post_message":"THEY DID IT: #Anonymous just released all of Donald J. Trump's personal information to the public..."},{"comment_id":"1253710404722011","commenter_b":"@username you nailed it","commenter_a":"Actually, it's bullying - in his case, you know he would be doing just the same to a male competitor. I believe sexism is a river that runs through him, but I see a ogre of a bully when I see him...","post_message":"TRUTH. Thanks to Hostile Politics."},{"comment_id":"10150676513679999","commenter_b":"You're right @username, when I bought my Yankees jersey, I bought the Rivera one. Best closer ever.","commenter_a":"Nothing like the Yankees of my childhood. Subway series, tino Martinez, Alfonso Soriano, David justice, pettitte, Bernie Williams, posada and jeter. It won't ever be the same.","post_message":"The New York Yankees are knocked out of the playoffs after losing, 3-0, to the Houston Astros in a wild-card game."},{"comment_id":"1113532561997426","commenter_b":"@username you are dumb idiot. W. Bush was the want that gave the tax break to the richest and the big corporations. Do you think that the MF Republica will go along with that, has much they hate like you the President. Went you moron , stupid and idiot use the word SOCIALISM find first the meaning of that word MORON. THE LUCKY ONE IS THAT MF BUSH THAT SEND OUR KIDS TO BE KILL FOR HIS GREED. BUSH NEED NOT THE BE IN JAIL , NO BE PUT IN THE ELECTRY CHAIR, TOGETHER WITH CHENEY AND HIS ADMINISTRATION.","commenter_a":"More for the rich..less for the poor..thanks a lot.","post_message":""},{"comment_id":"1392423634112580","commenter_b":"MESSAGE TO DONALD TRUMP AND TO THOSE WHO VOTED FOR: THE DEVIL IS AT HOME. EVERYONE MUST PROTECT HIS RIGHT BY LAW. MAKES YOU QUESTION WHY MADE THIS MILLONARY HUMAN BEING MADE OF FINITO DUST? THANK YOU TO THESE COUNTRIES. IN INDIA HAS 16 BUSINESSES, ARAB EMIRATES 13, CANADA 12, CHINA 9, INDONESIA 8, PANAMA 8, SAUDI ARABIA 8, SCOTLAND 7, AZERBAIYAN 5, BRASIL 4, IRELAND 4, ISRAEL 4, CATAR 4, FRENCH ANTILLES 2, SOUTH AFRICA 2, TURKEY 2 URUGUAY 2, BERMUDA ISLANDS 2. AND CASINO IS ONLY YOUR MASK. HOW EASY IS TOMB TO THE GOLIAT. AND IF IT CONDEMNS CUBA? EVERYONE CONDEMNS THEM; UNTIL WHERE THIS DONALD HITLER ADOLF TRUMP DICTATOR HAS ARRIVED. THE CURRENT MOMENT IS OF ABRUMING INTEREST FOR ALL REPUBLICANISMS THAT OCCUPY POSITIONS OF CONFIDENCE, THE REPUBLICANISMS HAVE CHOSEN THE MOST VIOLENT MAN WHO HAD ALREADY HAD SINCE THE FOUNDATION OF THE UNITED STATES OF ...","commenter_a":"So what happens now?? Castro brother takes over???same crap or the people change this?","post_message":"\"Everybody's been partying, basically, all night long.\" Earlier this morning on \"FOX & Friends Weekend,\" Phil Keating gave us a look at the pre-dawn celebrations occurring in Miami, Florida, in response to Fidel Castro's death. @webpagelink"}]
