[{"comment_id":"453308998193014","commenter_b":"She's in AMERICA and that gives her the right to display the flag. Leave it up !!!","commenter_a":"Yes","post_message":"Do You Support This Woman's Refusal To Remove Her Flag?  Comment 'yes' or 'no'."},{"comment_id":"10152885514044342","commenter_b":"Ain't that the truth. These hoes need to held ACCOUNTABLE!!","commenter_a":"It's always a mental thing.. Always an excuse...","post_message":"MOTHER CHARGED: A 23-year-old mother has now been charged in a brutal attack on her 4-year-old son that left deputies responding to the scene shaken and disturbed --> @webpagelink"},{"comment_id":"10153972084976336","commenter_b":"Pretty white chick..Thug?...heck no...let her go....","commenter_a":"Thugs come in all shapes, sizes, genders and races! Thanks to the Law Enforcement for removing this thug from our streets.","post_message":"Abigail Lee Kemp was taken into custody in Smyrna without incident, the FBI’s Jacksonville, Florida, office announced."},{"comment_id":"555357001316722","commenter_b":"@username open your eyes hill right hand person Muslim female yea so Trump might not be perfect or what this country really wants but he is 100 times better then hillary","commenter_a":"Mitt I actually liked you and voted for you! Thank you for giving me even more reasons to vote for an outsider! All of you politicians disgust me and are hypocrites! #trump2016","post_message":"WATCH: Mitt Romney slammed Donald J. Trump as \"a fraud\" and called on the 2016 GOP candidate to release his tax returns.  What do you think of Romney's speech? @webpagelink"},{"comment_id":"1072716372784891","commenter_b":"You want \"the happy, secure, tested and moderate side of life every day\" ? Happiness? Even Russia is above the US : en.wikipedia.org/wiki/World_Happiness_Report Tested ? Europe says hi. Moderate ? Bernie is centrist left here.","commenter_a":"I read something the other day from my pal and it's stuck with me all week. I'm paraphrasing here but in a nut shell... He said \"I don't like extremes. We have one guy saying he's \"going to make America great again\" and on the opposite end of extremes we have another fella shouting for \"revolution\"!! \" I'll take the happy, secure, tested and moderate side of life every day. #ImWithHer","post_message":"\"The most qualified candidate, and someone who is, by all reality-based measures, progressive.\""},{"comment_id":"10154036425721336","commenter_b":"Mary yes they will be out, and then be invited right back in as legals. We call that boomerang amnesty.","commenter_a":"Trump belongs in prison along with Hillary and Obama.","post_message":"TONIGHT: GOP presidential candidate Donald J. Trump like you’ve never seen him before – Don't miss 'Watters' World' at 5p and 8p ET."},{"comment_id":"10153004075042061","commenter_b":"These magnificent creatures were never meant to be made to stand on their heads or do any of the other ridiculous tricks they're forced to do.","commenter_a":"Stop hitting elephants.","post_message":"An elephant attacking your car - never a good thing: abcn.ws/1LxMzPP"}]
