[{"comment_id":"10153861308944087","commenter_b":"@username and u so fucking stupid","commenter_a":"The sad part is people in this country seriously think she is worth voting for...","post_message":"#BREAKING: A federal judge blocked Judicial Watch’s effort to begin interviewing State Department officials under oath and collecting evidence as part of a lawsuit over Hillary Clinton’s private emails."},{"comment_id":"10153313566903908","commenter_b":"Like the symbolism...but don't know about using it as a flag...we tend to fly flags when we want to differentiate our selfs from others...this differentiation leads to conflict and destruction...no flag","commenter_a":"I see that beautiful symbol as being interconnected and one. Almost reminds me of the flower of life or a lotus","post_message":"This could become the flag that is used to represent our planet as a whole when we travel to other worlds. It was designed to \"evoke the feeling of global community in people all over the world, reminding us that we all are connected and should take care of our home planet and each other.\" Sacred geometry, anyone?"},{"comment_id":"468340716665733","commenter_b":"I suppose those of you refusing to vote for him because of vaccinations would rather live in a socialist regime under Hillary.","commenter_a":"Yes!!!","post_message":"Will you stand with me. Together we can take our country back! @webpagelink"},{"comment_id":"10154517988145329","commenter_b":"Stfu!!","commenter_a":"@username I found a picture of me when I wake up in the morning.","post_message":"??? (via So Relatable)"},{"comment_id":"1060450227347787","commenter_b":"Media whore...can't help herself.","commenter_a":"Yup....Good old Alaska values.","post_message":"She chose to spend her time - not with her critically injured husband in Alaska - but thousands of miles away with Donald Trump."},{"comment_id":"10153213545451336","commenter_b":"Lady , you've lost all credibility.","commenter_a":"You can't Change what has already happened or bring back the dead .","post_message":"Moments ago, Baltimore Mayor Stephanie Rawlings-Blake defended her decision-making to critics and vowed there will be justice for Freddie Gray."},{"comment_id":"10153353453448132","commenter_b":"She is a brat !","commenter_a":"I love her ! Hopefully she doesn't become a total brat","post_message":"AMAZING!"}]
