[{"comment_id":"10153941294344342","commenter_b":"Trump = hate, fear, Hillary = corporate rep, liar, Bernie = peace, unity. He is right. I'd be happy to vote for him. Sad to just vote because I dislike someone more than the other option.","commenter_a":"Bernie wants to ban hydraulic fracturing everywhere. This would significantly reduce American energy production and directly cause oil&gas prices to raise. Not only this, the United States would have to depend on foreign oil once again. There is no reason to ban hydraulic fracturing and deny our citizens the right to exploit their resources for the benefit of us all. If you are convince fracking cause water to catch fire. I really encourage you to pull back a layer and devour the research. You can start by researching academic studies from Standford and Ohio University regarding hydraulic fracturing. Some of the chemicals used in the prop or fluid are hydrocarbons. Ofcourse if you go to ecowatch or earthjustice you will get an exaggerated and depressing perspective that is meant to excite you and encourage you to make a donation. So the few activist can pay for their mortgage and car ...","post_message":"\"I am running for president because I want to give the American people a real choice in this election.\""},{"comment_id":"961148523904901","commenter_b":"Every female I pursued that said \"No, I am not interested in more than being friends\" at some point had sexual relations with me and enjoyed it after I kept pursuing her in ways she WAS responsive to! some women want gifts and loads of flattery before they say. When they dont want to be friends, I stop pursuing them, until then its their choice to hang or not. The only clause is when they ended up being lesbian women!","commenter_a":"No means No! Some people don't get it. If someone is not interested in you move on.","post_message":"After a 14-year-old girl told her mom that a boy was aggressively pursuing her at school, her mom, a clinical sexologist and video blogger, decided to post a video to the boy on YouTube. >>@webpagelink"},{"comment_id":"1029861463715941","commenter_b":"You are wrong about Cruz but, everybody has their own thoughts but if you want a change then start listening to Senator Ted Cruz.","commenter_a":"Who?? Never heard of this guy! Looks like he never heard of a shower? Regardless, I will not vote for Rafael \"Ted\" Cruz, who has only been in this country since 1974!!","post_message":"OFFICIAL ENDORSEMENT... This changes everything!"},{"comment_id":"10154110742322439","commenter_b":"Cowards !! Stay to fight for your country !! You are Iran's puppets !!","commenter_a":"No problem. Enlist them in the French Foreign Legion - minimum 12 year enlistment; send them to Corsica for Basic and Combat training, and then deploy them to Libya to fight ISIS.","post_message":""},{"comment_id":"1874033892840716","commenter_b":"REALLY,Jim !#!#!!!","commenter_a":"We are concerned about you Al and the other nuts who wouldn't recognize the great things Trump will n is doing for the USA. Pray God continue blessing Trump doing good work for us.","post_message":"\"We all have this suspicion that — he lies a lot. He says thing that aren't true.\""},{"comment_id":"950334638377899","commenter_b":"Put this bitch in jail","commenter_a":"Clinton should be in Jail.","post_message":"Hillary Clinton says the Republican party's hatred for President Obama crosses political lines and is simply disrespectful. Do you agree with her?"},{"comment_id":"1346770152082702","commenter_b":"Robert Best then take ur bitch cockservative ass 2 bed.....damn!!!!","commenter_a":"Sadly the same dimwits that voted for Trump still aren't listening...","post_message":"Trump has shoved his foot in his mouth once again."}]
