[{"comment_id":"10154388275884087","commenter_b":"@username yes. Literally. @webpagelink","commenter_a":"He literally yelled \"Allahu Akbar.\" Why isn't anyone reporting that?","post_message":"#BREAKING: Russia’s ambassador to Turkey Andrey Karlov was shot and killed by a Turkish police officer who shouted \"do not forget Aleppo.\""},{"comment_id":"485687248279822","commenter_b":"The problem is when she decided to do this job the law was different. Leave her alone. Why should she be penalized for her beliefs?","commenter_a":"she, does not want to work....so go home lady","post_message":"If you can't do your job, maybe you shouldn't have it..."},{"comment_id":"10154655136218984","commenter_b":"Makes you wonder why she's riding in a van! Not very comfortable and certainly not presidential.","commenter_a":"Not a Hillary fan but have you ever tried getting out of one of those van back seats?","post_message":"There's some new footage of Hillary Clinton making the rounds, and it's exactly what her campaign does NOT want America to see. Here's what happened to Hillary when she tried to get out of a van. This confirms a lot of things that we'd feared about the Democrat nominee..."},{"comment_id":"934872919883382","commenter_b":"Did you listen to how Oklahoma handled the questions? She is no fake Barbie. Women can be beautiful and smart.","commenter_a":"Eeeeew, another fake blond Barbie miss USA. Miss Texas should have won .","post_message":"Wow."},{"comment_id":"750335681823676","commenter_b":"Trump and his mindless supporters are a NATIONAL EMBARRASSMENT !!","commenter_a":"Trump gonna have alot obama f-ups to fix right","post_message":"BREAKING: Trump Drops Bombshell About Obama... He Just Exposed The Unthinkable He is trying to cover this up as quickly as possible. Let's spread it. Do you think Trump would make a better president than Obama?"},{"comment_id":"10152867281821051","commenter_b":"Give it your best shot bitches","commenter_a":"Full of crap","post_message":"ISIS just announced the specific targets they’re looking to blow up – including the American ones."},{"comment_id":"10152944029886316","commenter_b":"Well that settles it, she paid $600.00 for that?","commenter_a":"no no","post_message":"In recent days, Hillary forces half a department store to shut down just so she could get a $600 haircut in a luxury salon, even as she refuses to engage the very public she is trying to convince to vote for her for president: @webpagelink"}]
