[{"comment_id":"10153123096616770","commenter_b":"They'll leave on their own !","commenter_a":"Send back the illegals!","post_message":"Donald J. Trump wants a “deportation force” to remove the illegal immigrants currently living in the United States."},{"comment_id":"968475119944707","commenter_b":"Man this website is So So So Biased, how can you take a political stance all day long to put down trump(4 to 5 articles a day) trump is this, trump is that, can we even call you a news website anymore??? How much money did the hill team fill your coffers with??? Do you not care about the world?? It's bleeding out in the middleeast :( you completely put out the best prospective candidates bernie, Jill, Gary. You leave trump cuz he doesn't say too many intelligent things but he is more human than any of the Warhawks that's been running the murica for a decade now!!!! Please people we need to spread the truth and love not put people down and dish out hate all day!!! Here's my finger to you Huffington","commenter_a":"put a toothbrush moustache on hillary and then it would be appropriate to yell 'heil hillary!' What is going on in 2016, appears to match severial elements to the 1934 German presidental election. For example: 2016 Democrate liberials ruthlessly beating up on Republican voters. Local Police (Fresno Ca) allowing violence as a policital objective at a Trump event. Propaganda; political acuity against conservative thought and the deceptiveness of 90% the media to sway voters towards hillary. Can anyone define all the promises from this great fuhrer hillary to buy their votes? HEIL HILLARY! Even the Universities and High Schools are exercising power over speech they disagree with. This is a time of struggle 'Kampfjahre.'","post_message":"They really got riled up about his birther-announcement fiasco."},{"comment_id":"1353337611353126","commenter_b":"What needs to happen if Trump wants to make America great again is give it back to the original owners. I think it's funny when Trump supporters say their not racist and some aren't, yet you must know that so many are. That's why there's a popular Trump chant \"Make America white again\" which is ignorant because it never was!!! You killed off the main population of natives then brought the Africans here to work your farms without as much as a thank you. If true justice and freedom or anything great were to happen in that case we would pack all you European folk up and send ya shipping. You bitch about minorities yet your ancestors brought our ancestors here, to a land stolen from anothers ancestors. You are the problem and the contradiction, you should leave. But really all we want is to live peacefully with everyone now ...","commenter_a":"Went from racist, Muslim, and a wife who was one of the uncouth \"first lady\" ever.","post_message":"America DOES NOT stand with Trump. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1911868089040262","commenter_b":"Who are they surveying because not all people thinks Asians aren't hot","commenter_a":"Kyan Khalil Khalili-Broojeni heyy","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"10153201313814255","commenter_b":"How is this even legal?! How do these cretins get to refuse to act on ONE thing because they don't LIKE another?!!!!!","commenter_a":"Geriatric Mutant Ninny Turtle. Competing with Agent Orange to see who is the worst leader in Congress.","post_message":"Thugs."},{"comment_id":"10154264315237550","commenter_b":"Yes you and your mother, @username! You old goat!","commenter_a":"They look real stupid with riot gear on outside a stadium!! There's no bomb threat! That Chief Of Police is a idiot. People are coming to enjoy a football game. Don't bring unnecessary rhetoric to this.","post_message":"Police are in riot gear outside of Bank of America Stadium in Charlotte ahead of the Panthers game. Read more here: abc11.com/@username/"},{"comment_id":"10153702293656636","commenter_b":"better christian refugees than islamic terrorists.","commenter_a":"This is a Christian country and if you dont like it, dont worry!! We will not cut your head off or throw you off a building, or blow up innocent people ...we all know the \"kind\" religion that does all that kind of stuff..","post_message":"'One question they asked me was very strange'"}]
