[{"comment_id":"10154703624496077","commenter_b":"These are all men! Lame. Almost any female is hotter than all of these (or does that make me sexist?)!","commenter_a":"Its the beard. Come on ladies, you know you love it!","post_message":"On Friday, Buzzfeed ranked our very own Kyle Clark #4 on their list of the hottest news anchors. We thought we'd share what we think makes Kyle so unique."},{"comment_id":"10153217086893984","commenter_b":"Get them outta there ,","commenter_a":"IDIOT.","post_message":"Unreal. Does she realize what she's doing? Is Michelle Obama bad for America?"},{"comment_id":"1225000220856314","commenter_b":"You're so evil Hillary! @webpagelink","commenter_a":"We don't have a depleted military, you moron.","post_message":"\"We cannot have a depleted military.\" Donald J. Trump speaks to supporters about the military @webpagelink"},{"comment_id":"675517259277271","commenter_b":"And now you know .......the rest of the story","commenter_a":"Good questions","post_message":"Hear, hear!"},{"comment_id":"852398211532955","commenter_b":"The DEMOCRAT PARTY IS A DEATH CULT! American deaths do not matter except to attack the Constitution! Democrats and their media mouthpieces HATE Christians, Jews, and conservatives, but support Islam because... ISLAM = DEATH CULT DEMOCRAT PARTY = DEATH CULT (facts): - The Democrat Party has a KNOWN NAZI (Soros) as its key financier and leader. - Fast & Furiously providing weapons to murdering gangs while trying to disarm Americans. - Freeing violent felons to MAIM AND MURDER AMERICANS! - Pushing an open border illegal alien invasion to RAPE AND MURDER AMERICANS, INCLUDING CHILDREN--, then BLOCKING KATE'S LAW which would have reduced all of this! - Treasonous support to fund Iranian terrorism (and nukes). - Ignoring the Islamic RAPE AND MURDEROUS SLAUGHTER OF CHILDREN, WOMEN, AND CHRISTIANS. - Freeing terrorists for a deserting traitor. - Promoting a race war that Satanist Charles Manson would be proud of. - Supporting Planned ...","commenter_a":"It's only been \"home grown\" since you started importing your Muslim brothers into the country.","post_message":"Here it comes..."},{"comment_id":"10153140414189071","commenter_b":"Read previous comments about the difference of Free Climbing and Free Solo climbing.","commenter_a":"Incredible athleticism yes!free climb? not if he's got a rope.","post_message":"What an incredible athlete."},{"comment_id":"10153127976631162","commenter_b":"You sound ignorant you stupid old lady","commenter_a":"A 3, 2, year old and she is 8 months pg. give her birth control.","post_message":"TODDLER SHOOTS PARENTS: A 3-year-old boy shot his dad and his 8-months-pregnant mom when he found a loaded handgun in her purse while looking for an iPod. READ MORE: @webpagelink"}]
