[{"comment_id":"10154287334146636","commenter_b":"It's very disgusting seeing the fake news of rape and burning alive. Burning alive is the nature of Muslims and Myanmars never do that act. Rape? All Myanmars are laughing the accusing of rape because Myanmar men even don't dream to rape Bengali Muslim women.","commenter_a":"Whether true or not, Myanmar needs to show evidence rather than blanket denying n also ppl should stop pointing finger from one side n stop calling ' Buddhist terrorist' unless u want to be called ur religion as ' terrorist' too, think in their place before u say ! Plus I AM DONE WITH ALL SOCIAL MEDIA NEWS especially like BBC !","post_message":"Horrific"},{"comment_id":"10154138263431323","commenter_b":"It's about what you want to do. Maybe a younger person follows what is 'the done thing' but with age and life experience, I think women just do what they want!","commenter_a":"It's just like the shaved pubes issue - all the same arguments. 'I do it for myself' etc etc. Look, virtually no young women shaved their pubes before porn videos made men expect it. And virtually no older women dyed their hair before looking our age became unacceptable. I've had enough of all this 'I do it for me' nonsense - look a bit deeper for god's sake and let's be a bit more honest about our motives and the forces that drive us.","post_message":"“We’ve been groomed – by the media, by advertisers, and now by ourselves – to understand that our gender has to try harder, to consume more, when it comes to our appearance. We’ve been taught to fear growing old.”"},{"comment_id":"10153251176006509","commenter_b":"Ignore luci. She is a troll.","commenter_a":"White supremacy tip of the day: If a black person commits a crime, blame him and every black person via Al. If a black person is the victim of a crime against them by a white person, blame him and every black person for bringing the violence upon them.","post_message":"A device had detonated, but failed to ignite a gasoline can placed alongside it. The incident left some shaken in Colorado Springs. @webpagelink"},{"comment_id":"10153724288582577","commenter_b":"Your wife is ugly.","commenter_a":"Fuck you Zuckerberg. I'm gonna blast Facebook non stop u faggot piece of shit","post_message":"Facebook CEO Mark Zuckerberg was caught discussing the censorship of anti-migrant posts at the United Nations development summit Saturday while speaking with German Chancellor Angela Merkel."},{"comment_id":"10153412850346519","commenter_b":"Oh, honey, sweetie, bless your little heart. #Derp #LowInformationVoter #UsefulIdiot","commenter_a":"It's time our tax dollars worked for us instead of the Koch's and their ilk.","post_message":"Free rides are a solution, not a problem..."},{"comment_id":"10153153775676350","commenter_b":"Girls, keep on winning!","commenter_a":"Stop your whinning..","post_message":"'Please do something about this. Girls read comics, too, and they care.'  Read Rowan's full (awesome) letter here."},{"comment_id":"958116217578241","commenter_b":"Hillary had two terms (8) years in the White House. Hillary was involved in everything bill Clinton did!! Hillary had two terms (8) as a New York senator. Hillary had a term (4) years as Secretary of State. Yet, the old girl thought she could have her own server and NOT be held accountable for classified emails... When are Americans going to get pissed enough to hold the shrew responsible?? Hillary left four AMERICAN men to be tortured until dead in Benghazi. Could this be what she and her aids are hiding? As of Friday, as per a JUDGES order nothing has been turned over. The two aids hide behind an attorney and Hillary just never answered... Monday such be very interesting!","commenter_a":"She needs to STOP Monsanto instead of defending them. We all have a right to know what is in our food.","post_message":"Join Hillary's fight to build an America where we don't leave anyone out or anyone behind: @webpagelink"}]
