[{"comment_id":"10154379049296028","commenter_b":"The tourist started it. There are reasons they had to close up. Their computers weren't working and they were forced to close maybe for an hour. Stupid tourist wanted to fight. She assaulted the employee first (yes, throwing water at someone is considered assault) causing the employee to be in defensive mode. Maybe that employee should be suspended for 2 days and hopefully she's not fired.","commenter_a":"What? You are not going to stack the coupons and price match??","post_message":"A woman's desire for a post-Christmas bargain took a violent turn. The confrontation caught on camera shows a store manager and a customer get into a scuffle in front of awaiting shoppers at a Florida mall. @webpagelink"},{"comment_id":"1573634599333254","commenter_b":"I know smh that's it I'm looking for new locations tomorrow","commenter_a":"@username Eder Marure","post_message":"A drive-by shooting left 1 person dead on Cypresswood Drive on Monday night."},{"comment_id":"682213861917317","commenter_b":"We continue to deport illegals but tgey come back. We need trumps wall","commenter_a":"All traitors MUST be put into jails, All illegals MUST be deported!!! Vote Trump and Reject the evil socialism of crooked Hillary as well as insane and hypocritical Bernie! Think of North Korea and Venezuela! \"The problem with socialism is that eventually you run out of other people's money\" - Margaret Thatcher","post_message":"The protesters in New Mexico were thugs who were flying the Mexican flag. The rally inside was big and beautiful, but outside, criminals!"},{"comment_id":"903935252988832","commenter_b":"That strategy has never once worked. In fact, we created ISIS by doing exactly that to Iraq.","commenter_a":"Just another reason to bomb them into little pieces. If done correctly, these vermin could be wiped out in a matter of weeks.","post_message":"\"Since ISIL declared a caliphate in Iraq and Syria in July 2014, the group has become one of the world’s most well-financed terrorist organizations.\""},{"comment_id":"631726717035650","commenter_b":"You go girls don't let them do something that you dont want to do","commenter_a":"We should be WAY past forcing women to perform (in any capacity) against their will. Especially for a degenerate like Trump!!! Resist ladies. A stand must be taken against this. Millions of people are are your side. Let Trump hire his knucke-dragging Klan supporters for entertainment if he wants to get his jollies.","post_message":"These Rockettes are NOT taking this lying down. You go, ladies!"},{"comment_id":"594388797376563","commenter_b":"To all of you saying fair game and all that.... You are no better than the republicans that did it Michelle Obama, you should be ashamed of yourselves","commenter_a":"People of character do not talk negatively about someones' spouse nor kids. End of that discussion. With that said, I sincerely hope Carson never holds any public office at this stage of his life due to what appears to be his deteriorating mental faculties. He is running for president of my country so that is a legitimate comment of my concern of his abilities. This comment does not in any way extend to any members of his family.","post_message":"He's a candidate, so that means she is automatically in the spotlight - but do people really need to be so cruel?"},{"comment_id":"10152853716122894","commenter_b":"I get tired of hearing about this lil hoe everyday","commenter_a":"Biancaa Ft Blue","post_message":"Watch: Kylie Jenner Gets 'High as F*ck', Tries Popeye's Chicken for the First Time [Video]"}]
