[{"comment_id":"1017838814918244","commenter_b":"Feminazis everywhere","commenter_a":"@username Fucking Feminazis...","post_message":"It's time to rethink sexism in toys."},{"comment_id":"1045921455457754","commenter_b":"Thank you for being a voice for many of us.","commenter_a":"Martha (stupid) Stewart did a lot less than what shrilary Clinton has done and she went to prison !!! What is this crazy world comming to? EVERY BODY KNOWS she is GUILTY as SIN!!!:-(:-(:-(","post_message":">> Sign the petition and tell the DOJ Hillary isn't above the law: @webpagelink  Today the FBI announced Hillary Clinton violated classified procedures, carelessly and recklessly endangered national security - and had done so repeatedly, over 100 times.   The FBI then announced she would face no charges. This is an outrage and the rule of law has been turned upside down.  This weekend, we learned former President Clinton met with the Obama Administration Attorney general - the FBI director's boss - in private.   Three days later the FBI director announces no charges are being brought against Hillary Clinton.  The appearance is terrible. The decision is astounding. People have gone to jail for less severe breaches of classified information and national security.    Today Director Comey and the Obama Administration Department of Justice made it clear to the American people, and all those being unfairly prosecuted by the DOJ, that there is no accountability, no justice, and the Clintons are allowed to live by a different set of rules.   This is a loss for the rule of law and further degrades Americans' faith in the justice system."},{"comment_id":"10153082331816600","commenter_b":"I agree Kaliah Nichole! I am not a fan of what Obama is doing either, however, to say that vaccinations don't work is absolutely ridiculous! The comment about hippie is because there are so many people \"hippies in the 70s\" that thought that we were all invincible and that we shouldn't have any restrictions and that the whole world was all about \"love\". This is not a game and even though our children get vaccinated and should be immune and resilient to certain viruses, this is not a game and not all immunizations are foolproof! So it's better to be safe than sorry and if people don't want to have their children vaccinated then they should all go to a communal area and go to school with each other and spread diseases amongst one another.","commenter_a":"Let's BAN @username! Go to a foreign country and bring back all types of diseases and parasites because of your lack of knowledge! Clearly by the looks of your picture you're a hippie who thinks that every thing you do is okay and that your indestructible because you smoke weed! Get an education and do your research!","post_message":"If a parent refuses to vaccinate their child and the child goes on to spread a deadly illness to others, do you think there should be consequences?"},{"comment_id":"10154456762501509","commenter_b":"Why not?!?!.Woman need to protect them selves.At least they got to train some combat skills hehehe...","commenter_a":"Feminism did not make a stride forward in the fight for women's rights. All they did was to send your daughters and granddaughters to potential war. They themselves didn't get anything out of it. They will never see war most likely. I hope they're proud of themselves.","post_message":"Do you agree?"},{"comment_id":"10152804418020326","commenter_b":"Another FREAKING ASSHOLE. You repeat that comment you idiot after someone rapes you!","commenter_a":"what a sicko","post_message":""},{"comment_id":"10154525745813893","commenter_b":"Your right ILLEGAL immigrants aren't eligible for benefits but the assumed identity they use is! Again seen it first hand! The children who are born here (AKA:Anchor Babies) are also eligible. With that in mind generally mom won't get deported and OUR government will assist her in getting a temp visa to stay. Then guess what she becomes eligible for the same benefits. Illegal documents are created at flea markets etc.","commenter_a":"Well.... Will the ILLEGAL immigrants also be boycotting emergency rooms, welfare, etc. today? If so we could save millions of tax payer dollars today..... I won't be holding my breath.","post_message":"\"Due to insufficient staffing levels, we will be closed today. Please come back and see us tomorrow,\" Torchy's Tacos - Houston Heights posted on Facebook."},{"comment_id":"10153292055736367","commenter_b":"This is the problem with the Left: too dogmatic, judgmental and lacking in imagination. There is more than one way to think about this and more than one way to vote one's conscience... @webpagelink","commenter_a":"I'm voting for Stein if Sanders loses the nomination. Here's why... @webpagelink","post_message":"\"It is time to stop playing the game.\""}]
