[{"comment_id":"10156255899575147","commenter_b":"I agree with you. It could have went awry. Maybe the mother has some mental issues. Only God knows what was in her mind. One thing for sure though, its alive n has chance to be somebody. Not just an aborted baby thrown in a trash can or its innocent body parts sold on the black market. Evil comes in all shapes n sizes. One of them is planned parenthood.","commenter_a":"I'm glad she didn't abort the baby, but this is still a sad story. Calling it a \"selfless\" act, as this article does, is a head scratcher. \"Desperate\" maybe, but if anything, abandoning a baby without notifying anyone is exactly the opposite of selfless. There are safe havens in NY where she could have turned over the baby to actual people","post_message":"\"I followed the cries. I walked to the little nativity home we had installed inside the church… I couldn’t believe my eyes.\""},{"comment_id":"596327983852216","commenter_b":"@username... The woman is CHEATING. She's actually bussing mentally deficient people to the polls to vote for her! She and Bill are colluding to steal elections by interfering with voters at the polls! She is so despicable, and frankly, anyone who knows about this stuff and supports her anyway DESERVES a Trump presidency.","commenter_a":"(DISCLAIMER: YES I VOTED FOR BERNIE IN THE PRIMARY. THE FOLLOWING POST CONCERNS A HYPOTHETICAL SITUATION WHERE HILLARY IS THE NOMINEE) To the Hillary bashers, you do realize that she is ideologically identical to Bill Clinton and almost identical to Obama, right? If you found those presidencies to be solid, ok, or even mediocre, that is a hell of a lot better than the potential authoritarian nightmare we have coming with a Trump presidency or republican control of all of government (see Kansas or Louisiana for what happens when the tea party can do whatever they want unchecked). And yes, again, I voted for Bernie in the primary.","post_message":"One thing is certain: While I’m excited to cast my vote for Bernie Sanders next month, I’ll be more than ready to cast my vote for Hillary Clinton in November."},{"comment_id":"10153396902714270","commenter_b":"There are jobs women cannot do in our military, because they are unable to meet our standards.. (Combat arms) Pretending to be a man would get them in. Unable to meet standards, they would damage our combat effectiveness, ability to adapt, and endanger the mission. That, and people will get killed dragging them along instead of fighting the enemy. IF it is tolerated too long, they will wind up deployed in a combat situation. It will cost lives. Caught unable to meet standards in the rear will cost them a possible career, and they will be processed out. Nothing wrong with that to you?","commenter_a":"Being transgender is not a mental disorder. Both the APA and the AMA agree. Also nearly every single western military in the world allows transgender people to serve openly in the military. Even Israel, a country that has significant treats to their nation allows transgender people to serve openly. Plus there are already 15,000 transgender people serving in the US military right now. Their service should be honored and not conditioned upon whether or not they can keep their gender identity a secret.","post_message":"\"He began to suspect that the military, despite its ban on allowing transgender people to serve, was somehow attracting them at a disproportionately high rate.\""},{"comment_id":"1681790358712525","commenter_b":"what a liar.....she is so happy to have a plane....go away","commenter_a":"Clinton=","post_message":"Hillary Clinton traveled with the press for the very first time today in her new campaign plane. Critics are still pressuring Clinton to hold a press conference, which she has not done in 275 days. @webpagelink"},{"comment_id":"10153109185578812","commenter_b":"I hope people know the women in Iowa aren't all like her.","commenter_a":"I'm from Iowa. So embarrassing!","post_message":"The Republican Response to #SOTU2015: Who is Joni Ernst?"},{"comment_id":"1730897643856292","commenter_b":"who cares she just a slut","commenter_a":"Yes by a long shot","post_message":"Scandalous Photos Of Donald Trump’s Wife Leak To The Public [SEE PHOTOS]. Regardless, she is 100x classier then Michelle Obama. Do you think Melania Trump would make a good first lady?"},{"comment_id":"630659240427363","commenter_b":"See. Look at this fucking cunt here. ^","commenter_a":"As much as I don't understand the obsession with Pokemon Go, it's done more good than any public health initiative that that any state or federal government has spent millions.","post_message":"The health consequences of sedentary lifestyles are costing the US $27.8 billion a year."}]
