[{"comment_id":"1008404635861662","commenter_b":"Nasty ass bitches!","commenter_a":"Breastfeeding should be done in private. For God's sake this is an industrialized country. People should not be displaying public nudity (displaying breasts) while feeding a child. Yes it is natural to feed children breast milk. But have common decency about it!","post_message":"These defiant moms just occupied a food court to stand up for breastfeeding in public."},{"comment_id":"10153809111181336","commenter_b":"You will feel it when your movies plays to less than half the audience shows up..","commenter_a":"IDIOT","post_message":"Quentin Tarantino has finally responded to the firestorm that’s been brewing since he criticized police officers at a rally last weekend, and he says he won't be \"intimidated.”"},{"comment_id":"1837165426513406","commenter_b":"Kiss my white ass","commenter_a":"and let me tell you something about being poor we were poor when i grew up i was very lucky we had food on the table there were times we didn't have ckristmas cuz we didn't have the money so when the democraps say we dont know how it feels to be poor they are so fucking full of shit minimum wage was less was about 3.00 an hour so you people today dont know how it is to be really poor","post_message":"Black Lives Matter Co-Founder Makes SICKENING Demand For Whites To Do THIS [VIDEO]. She is a bigot, her demands are creating racial tension. Do you think she is the racist?"},{"comment_id":"10153306499856770","commenter_b":"She's pathological. Plain and simple.","commenter_a":"Yeah Hillary, you are just the best liar around!!!","post_message":"Hillary Clinton claimed, \"I have tried in every way I know how, literally from my years as a young lawyer, all the way through my time as Secretary of State to level with the American people.\""},{"comment_id":"1022737904430216","commenter_b":"Yuge piss on Shillery Clinton. Name ONE more disgusting pig who ever lived?","commenter_a":"Nobody kicks a dead dog. Hillary's attack shows that her campaign sees Cruz as a real threat. Ron Nehring, keep up the good fight.","post_message":"Ted Cruz: “John Kerry was not a little wrong, he was wildly, extraordinarily wrong. Facts matter. Science matters. Data matters.\""},{"comment_id":"10153750780819062","commenter_b":"Why would you trust two gals that looked like that for anything cosmetic?","commenter_a":"Hope they catch them","post_message":"Police have issued arrest warrants for two people in connection to the death of a woman who police say received injections of a substance in her buttocks in a botched cosmetic procedure."},{"comment_id":"936532806442972","commenter_b":"Is that a bad thing?","commenter_a":"Oh, please. He will become the biggest clown in the clown car.","post_message":"Donald Trump knows what he’s doing in 2016 ..."}]
