[{"comment_id":"10154263809393598","commenter_b":"A very sick lady, Murderer. Lier. Corrupt.","commenter_a":"SHE WILL EAT THOSE WORDS ONE OF THESE DAYS","post_message":"As the debate begins, remember.... Hillary Clinton: An Unborn Child Just Hours Before Delivery Has No Constitutional Rights"},{"comment_id":"10155086902812235","commenter_b":"UK agrees Americans you created this problem now fix it Europe do not want a war","commenter_a":"How much longer are the American people, the ones who didn't vote this idiot in, going to let this go on, this ego maniac is ruining your beloved country, it is the laughing stock of the world thanks to him, how can any government anywhere take this moron seriously and trust him with anything, he lies through his teeth, blames everyone else for whatever is going on, it has only been 4 weeks and look at the state of things ! My thoughts are with the American people who didn't vote for this buffoon, i hope your country can get rid quick and recover from his dreadful influence !","post_message":"'I was hoping you could tell me what the f*ck is going on over there?' - European security services ask."},{"comment_id":"10155220975479218","commenter_b":"'@username tell that to a nun","commenter_a":"You wouldn't need to be pro choice or pro life if people were just responsible when it comes to their sex lives. Both men and women, responsibility!","post_message":"Thousands of people demonstrated in the annual March For Life, marching from the Washington Monument to the Supreme Court, advocating the right to life >> @webpagelink"},{"comment_id":"10154509463236162","commenter_b":"Same Jen same","commenter_a":"'@username... worried for @username","post_message":"HOT DOG RECALL: Put down the hot dogs!   372,000 pounds of hot dogs and corn dogs are being recalled over concerns of listeria contamination.  Bar-S Foods is recalling five chicken and pork products.   The recalled items include Bar-S bun-length and classic franks made with chicken and pork, Bar-S classic corn dogs and Signature Pick 5 corn dogs."},{"comment_id":"1215546011816966","commenter_b":"This is still AMERICA. MOST OF US STILL. BELIEVE AND HAVE LET OUR CONSTITUTION , BILL OF RIGHTS AND AMENDMENTS. WORKING IN THIS COUNTRY. YOU DONT LIKE THOSE LAWS OF OUR LAND. YOU ARE NOT A TRUE AMERICAN. SO YOU HAVE NO SAY. BECAUSE YOU HAVE NOT PASSED THE LAWS OF IMMIGRATION TO BE A CITIZEN OF THIS UNITED STATES OF AMERICA. AND JUST BECAUSE YOU ARE BORN HERE DOES NOT. GIVE YOU THE RIGHT. TO UNDO OUR LAWS. IT IS BREAKING THOSE LAWS TO DO SO","commenter_a":"Bimbo has been drinking the koolaid","post_message":"This is ABSURD."},{"comment_id":"10154570466249575","commenter_b":"Funny how a white teen cant even go to a middle school without murdering a classroom full of people. Funny how a white man cant go into a black church and not kill 8 or 9 people. Funny how a white man cant be around his cousin without sleeping with her","commenter_a":"Amazing how I can attend a tractor show in middle America with 100+ people and not one person was shot,stabbed,assaulted, but yet have one black cookout and all hell breaks out","post_message":"This man is facing preliminary charges of attempted murder and criminal recklessness after police say he shot two men having a backyard cookout Saturday.   Officers say the incident started when the suspect confronted the men about a vehicle blocking the alley where he was trying to drive."},{"comment_id":"10154316871838203","commenter_b":"'@username Jesus only chose men to be Apostles - but He had many female followers. The reason that women cannot be priests is that the priest acts in the person of Christ in the Mass. If it's a woman offering the Mass the sacrifice becomes one of bride to bride - and the significance is lost. Humans are sensual creatures. God knew that; that's why He created sensual experiments (the Sacraments) as visible signs of His grace. You cannot baptize someone with motor oil because it's not a sign of cleansing. Similarly, you cannot ordain a woman. It is not possible.","commenter_a":"st paul says there is no difference between men and women now that we are in Christ Jesus. there is nothing to suggest that women cannot be ordained priests or deacons from the mouth of Jesus himself. the fact that only men were chosen by him could be due to the fact that the social fabric of his day could not tolerate or make it possible otherwise. the holy spirit will continue to guide the church according to christ's own promise. let's not bar the way forward when we see he is driving along that path. we need to go to the spirit of our faith and not be kept back by men made rules and practices. WE HAVE TO LET THE LORD SPEAK.....AND LET US BE SILENT.","post_message":"The Catholic Church can never ordain women priests, so why all the confusing signals?"}]
