[{"comment_id":"10153903650539087","commenter_b":"@username - You're behaving like a whining whore. Give it a rest.","commenter_a":"It's good that she's fielding questions about her emails? It would probably be even better if she wasn't such a unethical, lying piece of crap and didn't have to be in the position to have to answer those said questions, wouldn't it?","post_message":"Hillary Clinton showed that she's a skilled politician who understands exactly the way media works."},{"comment_id":"1184451798317737","commenter_b":"Foolish, foolish woman.","commenter_a":"SHE IS INSANE TO WANT DONALD TRUMP! I HOPE SHE KNOWS THAT SHE AND ALL THE REST WILL BE THROWN OUT ON THEIR HEADS!!! CAN NOT BELIEVE THIS!!!","post_message":"Saba Ahmed is trying to convince other Muslims to support Donald J. Trump."},{"comment_id":"10154257550106491","commenter_b":"Beyonce is racist scum","commenter_a":"Fuching nightmare.","post_message":"It's the ultimate playdate."},{"comment_id":"10154110742322439","commenter_b":"Cowards !! Stay to fight for your country !! You are Iran's puppets !!","commenter_a":"No problem. Enlist them in the French Foreign Legion - minimum 12 year enlistment; send them to Corsica for Basic and Combat training, and then deploy them to Libya to fight ISIS.","post_message":""},{"comment_id":"996595140397015","commenter_b":"These gun nutters are too chicken to go fight a REAL threat, so they try to intimate normal people. You freaks are just trying to intimidate people. Red beck, Inbreeds!","commenter_a":"You don'y have to give up your guns, and no one is proposing that (I'm a gun owner and a vet), to have sensible regulation.","post_message":"“I grew up in Tucson, Arizona, and I live there now. And I'm a gun owner and a supporter of the Second Amendment. But I couldn't give you more credit that we need to deal with the wrong people getting guns, especially with mental illness. As you know, in Tucson we had a person who had all kinds of trouble and was able to buy a gun. In Virginia Tech. In Louisiana… So from a gun owner, from a reddest of red states, and a person who owns guns, more power to you.” —an attendee at Hillary’s town hall on gun violence prevention in Manchester, NH"},{"comment_id":"1789900814667772","commenter_b":"She needs to leave this country ....POS !!!","commenter_a":"Idiot!","post_message":"Actress and activist Ashley Judd delivered harsh words aimed at President Trump from a poem written by a 19-year-old girl from Tennessee."},{"comment_id":"932489970229038","commenter_b":"Nothing compares to what Bill Clinton did as Gov of Ark, and in the White House with Monika Lewinsky and other women..same with John F Kennedy, with Marilyn Monroe, and mistress of a Gang boss, and nude swimming parties. They both dis honored our White House...where was the media..and why were they voted in twice...","commenter_a":"I agree! Mr. Trump has changed in the past 11 years but Hillary Clinton has not except for the worst!!","post_message":"Dr. Robert Jeffress, Senior Pastor of the First Baptist Church in Dallas, Texas, stated that he still supports Donald J. Trump, despite the GOP nominee's controversial 2005 comments."}]
