[{"comment_id":"10153007024072894","commenter_b":"He dumb why have that baby get close to him if he didn't know for sure if she is his baby he should've got that done first","commenter_a":"Maury would have done it for free","post_message":"Chris Brown Files Petition to Establish Paternity of Daughter Royalty"},{"comment_id":"10153780723343984","commenter_b":"the Muslim parents could have kept their brats at home that day and celebrate their butts off.","commenter_a":"Yes","post_message":"Tempers flared after this city's board of education refused to take a day off of school in observance of an Islamic holiday, and these Muslim parents were NOT happy about it. Do you agree with the decision these school officials made?"},{"comment_id":"588976734614882","commenter_b":"She couldn't sexually satisfy ol slick willy either","commenter_a":"Don't want her in the War Room...Remember Benghazi!!!","post_message":"Ahead of President Obama's speech to the Democratic National Convention tonight, The White House released excerpts touting Hillary Clinton's experience."},{"comment_id":"997862486926485","commenter_b":"She also set up a GoFundMe account. It's a publicity stunt to make money. She's a nasty person","commenter_a":"She showed she had class. Love this story.","post_message":"Two women called this mom a \"whale\" because of her size, what she did next is truly remarkable: @webpagelink"},{"comment_id":"10153574901357217","commenter_b":"Pete Bayliss Yes i no , the Muslims from the Middle east are taking over the World. we have more trouble with the Muslims from the Middle east then any other race of people here in Australia they are born hatters and want to kill us the free World , they give all the good Muslim people a bad name","commenter_a":"This is very sad but its WAR , and all kind of people get killed in WARS. we the World needs to get rid of ISIS no matter what it takes and innocent people are going to die while doing this . i hate Putin but he is the only one doing the best Jb in getting rid of ISIS.","post_message":"\"There will be no more doctors in Syria.\""},{"comment_id":"757206074401067","commenter_b":"Go suck off another jihadi, Dilosh asshoIe.","commenter_a":"How can you go into someone else's land. Occupy it, then claim self defence when a 16 year old kid attacks. Isn't he the one doing self defence since its you that on his land?","post_message":""},{"comment_id":"1183094928399954","commenter_b":"Hate this woman!","commenter_a":"Imagine that.","post_message":""}]
