[{"comment_id":"487160908141156","commenter_b":"Well Boo Fing Whoo you dont Like what she wore . Its Not a Fashion show , and this Women as been through More then I ever Hope you Ball less Lib Media assHoles ever have to go through. Leave her alone.","commenter_a":"Any one that saw the movie must know that we saw just a portion of what This couple meant to each other. We have no idea of what she is going through. Her grief is probably a lot worse than any one can imagine. So do us all a big favor and leave her alone. As far as I'm concerned, it's no bodies business what she wears. I applaud her for honoring him in the way she deams appropriate. He's definitely an AMERICAN HERO. So isn't she. God's Speed to her.","post_message":"Liberals slam Taya Kyle over what she wore, but she's not backing down.  We stand behind the Kyle family 100%. Let's show her our support.  Can we get 20,000 'LIKES' for Taya Kyle?"},{"comment_id":"505113796343580","commenter_b":"They reproduce like rabbits, anytime a Muslim gives birth in an American hospital they should be sterilized.","commenter_a":"Screw the Muslims, they are all sheep in the cult of Islam.","post_message":"Watch what happens when Muslim Brotherhood extremists attack journalist in front of the NYPD!"},{"comment_id":"1729422480677478","commenter_b":"I'm for the wall. Now!","commenter_a":"Immigration across the southern boarder is at an all time low level. President Obama has deported more illegals than any other president.","post_message":"Donald Trump says a border wall is a common sense way to slow the flow of illegal immigration at the border. Are you for or against his plan?"},{"comment_id":"10153922019898812","commenter_b":"Anyone but Hillary!!","commenter_a":"The only thing I fear is a Republican getting elected in 2016","post_message":"President Barack Obama: \"We cannot and we will not succumb to fear.\" @webpagelink"},{"comment_id":"1335655576501194","commenter_b":"Omg this little girl does need someone to beat her ass. Khloe can do it lol","commenter_a":"This lil girl is trash shame on her people need to stop giving her 5 minutes of fame","post_message":"She's calling out Kylie Jenner!  #WSHH #CatchMeOutside #KylieJenner"},{"comment_id":"539180629598484","commenter_b":"Good one. That made me chuckle.","commenter_a":"Because nothing screams, \"I'm protecting the environment\" like flying your private jet to accept an environmental award.... lol","post_message":"Some eyebrows were raised when DiCaprio took a private jet from Cannes to New York City to pick up an award from Robert De Niro's clean water advocacy group."},{"comment_id":"10154358010096037","commenter_b":"why would u put this animals pic on here??u people r the problem,neither his name nor his pic should be glorified","commenter_a":"Coward, plain and simple. Bury him in a casket of gay smut and pork.","post_message":"Omar Mateen, identified as the Orlando gunman, pledged his support for ISIS in 911 calls made amid his attack, according to the FBI. @webpagelink"}]
