[{"comment_id":"1324741860927476","commenter_b":"You need to stop getting your news from the crazy woman on the View!","commenter_a":"No terrorists came out of the 7 countries he banned why doesn't he ban Saudi Arabia where most 911 terrorists were from. Also Egypt and two other countries. Neither was the ban about illegals people with valid visas and green cards were also detained, even the ex prime minister of Norway traveling on a diplomatic passport was detained for questioning..I support Washington states action. The president is not above the LAW .","post_message":"'We're not going to allow anyone in Washington, D.C. to trample on our rights as Washingtonians, President or otherwise.' Gov. Jay Inlsee reacts to the judge's ruling to temporarily block President Trump's travel ban. READ MORE >> @webpagelink"},{"comment_id":"10154479010956636","commenter_b":"And I've heard real life accounts from people I know who live in Germany. But let me ask you, have you heard what white male Christians are doing in the US? They are the biggest threat at campuses nation wide. Should we not allow them into schools and colleges?","commenter_a":"Big WIN for the people!!! Let the brave Americans welcome doctors, scholars, extended families, and refugees into our Country. I promise we aren't all cowards hiding from the scary muslim doctors. The scary muslim students and those awful muslim grandparents coming for a visit!","post_message":"#BREAKING: A federal appeals court has ruled against President Trump's ban on travelers from 7 countries."},{"comment_id":"10155101545959866","commenter_b":"I was in prison and the c.o.s and inmates were always like buddies","commenter_a":"Do you even know what C.O goes through everyday? Well you guys are probably working at mickey D's thinking you have a hard job","post_message":"LIVE: Delaware prison guards taken hostage by inmates a maximum security prison - live ground video. MORE at @webpagelink"},{"comment_id":"1765071860379740","commenter_b":"damn elizabeth coming out swinging","commenter_a":"That was EXACTLY what happened to another person that was supposed to be deposed and speak out against the Clintons years ago, and was found three days later by the FBI after the guy missed his deposition:-(","post_message":"Do you think the Clinton's were involved in his death?"},{"comment_id":"10153898443761770","commenter_b":"In GOD we TRUST....Vote for Trump/Pence 2016..Hillary hate guns because dangerous to the toddlers!!! But In the GOD's name why she's ok to rip out the unborn 9 months in the womb...and Hillary sharing our national classify to others and exchange to pay her ...GOD bless American people to support Trump... because only Trump/Pence can stop government corrupt, bring job, boom the economy, protect our family and help veterans, military and make America safe and great again... that Hillary been extremely careless to protect our national security....and Trump will stop Hillary accepting money from foreign country that treat LGBTQ and women like animal... and Hillary call all my Africa-American friends 'SUPER PREDATOR ' and insulting all my Latinos & Latinas 'NEEDY & BOWL of TACO'","commenter_a":"Who gives a damn","post_message":"Nate Schmidt of the Washington Capitals sits down with David Hookstead to talk about life as an NHL player."},{"comment_id":"10152979635977483","commenter_b":"Then ban the naacp bitch","commenter_a":"This flag was specifically adopted In response to the civil rights movement.. the confederate flag should be banned across the u.s point blank period","post_message":"'Just by the outpouring of support I've gotten from all over the world, I know for a fact I'm doing the right thing,' said Belinda Kennedy, owner of Alabama Flag & Banner."},{"comment_id":"10153233984390950","commenter_b":"Did you think women are incapable of evil","commenter_a":"And the people who are saying the women and children are safe, check out who blew herself up with the suicide vest","post_message":"Police give update on raid near Paris: • Woman wearing explosive suicide vest blew herself up • 7 suspects taken into custody; 2 suspects dead • 5 officers reportedly injured; police dog killed"}]
