[{"comment_id":"1241741129230844","commenter_b":"Donald Trump made racist white folks take they mask off, if you support Trump you are lowKey crazy and Racist, Trump's rich ass don't give a fck bout the poor, #BlackLivesMatter #Mexicans , he dont give a fck bout people from the bottom, the ones stuck in the hood, he only gives a fck bout the rich white and wealthy, ,...he started a Race war, he just motivated and inspired the KKK even more, kkk supports him to the fullest, he's gonna make this country more heated and more and more hatred between white people and the rest of the Race's , ...fck hillary too, but trust me Donald Trump is not a good option, he wanna make America white again","commenter_a":"Be a good time to start deporting.....thats how you catch illigals hold a Trump rally just bring in the busses and load them up....lmao","post_message":"Protesters remove their clothes at a Trump rally just before they flood the streets and destroy property."},{"comment_id":"1268420859891333","commenter_b":"Stfu lol","commenter_a":"Amanda merry christmas lmao","post_message":"Bruh!  #Gifts #WSHH"},{"comment_id":"662069217316990","commenter_b":"Sorry Bitches !!! Go to jail !!","commenter_a":"Yes!!yes!!!!!yes!!! that;s a shame!! just think?? if that was your mom! or dad????","post_message":"These thugs tortured nursing home patients for an insane reason.  These two are monsters. Let's lock them up and throw away the key.  Do you agree these thugs should do life?"},{"comment_id":"10153311050083037","commenter_b":"Just remember these are people fleeing terrorism NOT terrorist! Living breathing people who are desprete. THEY HAVE NO LESS RIGHT TO DO THAT THEN YOU DO... just because an accident of birth MADE YOU AN AMERICAN","commenter_a":"That is assault, and the spitter better be charged.","post_message":"'It sickens me to know that no matter how hard I try, there still exists a blur between myself and the decency a human life entails,' said the student."},{"comment_id":"1020783114655014","commenter_b":"Hillary is a racist!!!","commenter_a":"always my president hillary clinton the best of live 100% help fanta t jolie kant","post_message":"Hillary Clinton holds a net favorability rating of 58 percent among Democrats -- an increase of nearly 10 points since October."},{"comment_id":"10153984611959614","commenter_b":"Walk in front of my car. Karma will get u","commenter_a":"You see how faithful this poor dog is his master was going to kill him.My brother told me one time as he was coming home from work.He saw a little dog on the road this truck purposely hit that little dog and killed him.What kind of animals do we have on the roads.I guess it speaks for it self","post_message":"A heartless driver shoved a dog out of an SUV, then sped away as the abandoned pet desperately scrambled to get back in.   The dog was struck by another vehicle as it chased after the driver on a Long Island road. Incredibly, the canine survived.   Suffolk County SPCA is offering a reward to find the person who abandoned the dog. The driver's vehicle is described only as a dark green, early 2000s Jeep Cherokee."},{"comment_id":"967606389917498","commenter_b":"YOU're gross.","commenter_a":"gross. why did you have to post a photo?","post_message":"The most sexist obituary you've ever seen"}]
