[{"comment_id":"10153395749836336","commenter_b":"Well what if I said I'm tired of boarder jumpers and we need a 50' tall concrete wall put up to keep them out cuz I'm tired of dealing with them. But I do love Mexicans. I mean all of it. I love the ppl just don't care as much for those who try to come to the states illegally.","commenter_a":"I'm totally on Trump's side here. The U.S. does need to end its TPA with ALL FOREIGN COUNTRIES! Regardless of how the ppl feel. Mexico is taking this offensively because they know that Trump will keep his word, he will stop doing business with them, he will put up a wall to stop immigration and Mexico doesn't want to deal with losing our money and then having to take care of all of their people who have illegally made a life in the states and are sent back to their homeland. I think the U.S. should do as Canada does and anyone who wants to become a citizen should have a sponsor.","post_message":"“I’m going to have to sue Univision now.” Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10152884720337217","commenter_b":"Humans suck 😕","commenter_a":"Man. The death of all animals, plants, and everything else. I swear. Smdh.","post_message":"The tiger that mauled a man to death after escaping from a flooded zoo in Georgia has been shot dead. (Footage from Georgia Ministry of Internal Affairs)"},{"comment_id":"1034964553205670","commenter_b":"@username I do not know of anyone who has demanded to, \"get even\" with whites. Not sure who you are referring to.","commenter_a":"Idk, I was bullied and made fun of for being white by black girls. It's just racism, saying \"reverse\" racism implies that only white people can be racist. That's pretty racist, in of itself. :/","post_message":"News flash: Reverse racism doesn't exist."},{"comment_id":"961657090560706","commenter_b":"Ugly woman!","commenter_a":"I am sorry but on this point I do agree with her,but I do not agree with the fact she is on 20k a year,","post_message":"Benefits mum does not understand why we send money to Africa"},{"comment_id":"1089012597882184","commenter_b":"ANTI AMERICAN ASSHOLES","commenter_a":"That's what jackass's do!","post_message":"ClashDaily.com"},{"comment_id":"10157682940820389","commenter_b":"Such bullcrap that she can get away with this!!!","commenter_a":"OF COURSE THEY DID....TWO OF AMERICA'S BIGGEST MISTAKES... WAKE UP AMERICA...VOTE DONALD TRUMP .....","post_message":""},{"comment_id":"10154476724188352","commenter_b":"On God I'll beat this hoe up!! Sick twisted bitch","commenter_a":"Wth","post_message":"Toddlers found chained up in Texas yard covered in hundreds of wounds are now in an 'excellent' foster home and are 'eating like they have never seen food before'"}]
