[{"comment_id":"10152978558206051","commenter_b":"Ive seen mothers making babies for the purpose of the money BULLSHIT lazy ass mothers","commenter_a":"if you're TOO POSH to push STOP HAVING BABIES :p","post_message":"This pregnant mom of 11 gets $60,000 per year in benefits, but she still wants the government to pay for a c-section for her next baby. And that's not her only request."},{"comment_id":"1554605091501420","commenter_b":"Merry Christmas","commenter_a":"True Patriots True Americans for Donald Trump Keep the White House Hillary Free 2016 This Is Why I Support The Ban On Illegal Refuges/Muslims, Deport Illegals No Amnesty, No Tax Dollars Spent On Any Of Them Watch How FAST They Self Deport Themselves!!! Bernie Supporters That Are Feeling The Burn Should Jump On The Trump Train To Defeat Hillary Who Would Be The Worst President In US History!!! Next Stop Novembers General Elections Then On To The White House Were Donald J. Trump Will Be The President Of The Unites States Of America! Thanks To You And All His Supportes Across This Great Nation!","post_message":"You think we can coexist with these people!? They HATE our way of life! Let's get 5000 SHARES if you believe Muslims will NEVER Assimilate in America!"},{"comment_id":"954338344712964","commenter_b":"Idiot she has no place in the white house","commenter_a":"When her Secret Service Protectors lay down their guns, I will lay down mine.","post_message":"Hillary Clinton made the case for the United States to implement tougher restrictions on gun purchases following the terror attack in Orlando. @webpagelink"},{"comment_id":"10155070762506037","commenter_b":"But the person doing the watching had intentions maybe","commenter_a":"Something sounds like she wondered off but someone had been watching her.","post_message":""},{"comment_id":"10153724163922452","commenter_b":"A black woman would have been acting up and resisting the officers. Did you SEE how the lady DID NOT act stupid? She OBEYED. It's really that simple.","commenter_a":"If this was an African American she would have been roughly handled, beaten b/4 forcefully taken into custody ..#basedonwhat #how #ihaveseenthemdoonTV# God please help us...Amen","post_message":"A woman led authorities on a chase through Los Angeles, Orange and San Diego counties that lasted more than two hours. @webpagelink"},{"comment_id":"10156722273625354","commenter_b":"I hope the whole crowd good her sorry ass.","commenter_a":"And who allows them their STAGE? Disgustingly racial, anti police and presidential common, ticket of 8 yrs. Ugh! Don't buy their future stage!","post_message":"***BLACK PANTHER PARTY SUPPORTER AND BLM RADICAL DONOR BEYONCE OWES AMERICA'S POLICE, ARMED FORCES, & VETERANS AN APOLOGY***"},{"comment_id":"10153296674076323","commenter_b":"i can't deal with her","commenter_a":"@username thought you might find this interesting","post_message":"After Frida Kahlo died in 1954, her husband Diego Rivera shut her belongings in a bathroom at their Mexico City home – then demanded it be locked until 15 years after his death. In fact, the room wasn’t opened until 2004. See the full gallery of what was inside: @webpagelink"}]
