[{"comment_id":"10152591778190927","commenter_b":"Give them an inch they will take a mile!","commenter_a":"Lies, lies, and more lies, this is all this administration knows how to do.","post_message":"They finally admit it."},{"comment_id":"10152609996648663","commenter_b":"Do you think, if things progress in the next 10 years as they have, the next generation will have our privileges and freedom? Look at the debt. Look how the 2nd amendment has been attacked. And our religious freedoms. What about the Isis.....we are walking away from the America I have known, and I am 78 yrs old,","commenter_a":"My husband and I are fine, but woe to my grand and great grandchildren in the years to come. They will never understand how truly great Ametica was, they will never know what freedom was...","post_message":"In November, Americans sent a clear message to Washington that they were tired of political gridlock and want solutions and real results to the problems facing our country. Both President Bush and President Clinton used their State of the Union address following difficult midterm elections to acknowledge that they no longer have control of both chambers and that it was time for them to work with Congress. Unfortunately, tonight was another missed opportunity for President Obama and his legacy.    President Obama used this evening to appease his political base and focused on dividing our Nation and using bureaucratic control to run our country with top-down Washington-centered solutions. I believe the key to growing a healthy economy begins by strengthening the paycheck of hard working Americans, putting more money into Kansans pockets, and growing our economy from the bottom-up.     While I was disappointed in many of the President's remarks, I remain hopeful there will be opportunities in the near future to work together to expand trade and fix our broken tax code. I remain hopeful that this President will seize those opportunities just as those who preceded him did."},{"comment_id":"10154210423796973","commenter_b":"Aleksey Olenin","commenter_a":"What's the deal with this Westworld show? It doesn't look like anything to me... ;)","post_message":"\"Westworld\" has become the kind of watercooler-buzz show HBO loves."},{"comment_id":"10154312691707577","commenter_b":"Only cowards suck on another cowards goat dick the system been broken since mr queer got in office the fact that our government already let the enemies in our country soon there will be more of this false flag shootings","commenter_a":"According to Breitart...the Orlando shooter worked as a security guard for a company, G4S who has a contract with Homeland Security to pick up illegal aliens at the border & transport them inland & just release them. No legal repurcussions nothing. Obama's policies are very sinister & treasonous. And why has nobody done anything?!","post_message":"The brother-in-law of nightclub jihadist Omar Mateen hates Donald Trump, works with refugees, and liked a video on YouTube that argued Islam isn’t violent, according to his social media profiles."},{"comment_id":"1180323918655284","commenter_b":"My cats r broken, both are at best apathetic toward boxes, at worst terrified of them, depending entirely on size and location","commenter_a":"Elizabeth Dain","post_message":"Happy international cat day!  Here's a question for you - why do cats love boxes so damn much?  Find out: bit.ly/1zUeu4c"},{"comment_id":"10156463430895354","commenter_b":"Look another bitch working for Obama","commenter_a":"What about anti american hate speech from scuzzy muslims ? Real americans dont like having to suck up to people who want to kill real americans !A plot by our government to change America into a third world craphole !","post_message":"Obama prepares the muzzle to silence Americans who are FED UP with his coddling of terrorists."},{"comment_id":"10155823067465492","commenter_b":"Oh God there she goes again someone gotta find this chick a map","commenter_a":"Thank you Di Blassio!","post_message":"\"We are currently investigating and stand ready to assist the NYPD in bringing these individuals to justice,\" an Uber spokesman said."}]
