[{"comment_id":"557140984486841","commenter_b":".....Hypocrite HILLARY SAYS DONALD DOES NO RESPECT ALL AMERICAN AS SHE HAS NO RESPECT FOR AMERICA OR AMERICANS ONLY GLOBALISM....HILLARY HAS LOST HER WAY SHE HAS FORGOTTEN THIS IS OUR HOME 'AMERICA'. WE WANT TO KEEP OUR FAMILY SAFE!, WHILE HILLARY JUST WANTS TO APPEASE THE ILLEGALS ..","commenter_a":"#NeverEverHILLARY PERIOD!! #BILLANDHILLARYCAREERLIARS","post_message":"Hillary Clinton’s actions constitute all of the elements of a major criminal enterprise - she created a private illegal email server in order to hide her corrupt dealings. She did so knowing full well it would put American lives at risk by making classified information highly vulnerable to foreign hacking. But, she didn’t care – as long as it helped her get away with her crime, no risk to America was too great.  Then, to further cover-up her crime, she deleted 33,000 emails to keep them out of the hands of authorities and the American public.  As a further element of the criminal cover-up, she claimed under penalty of perjury that she turned over all of her work related emails. We now know this to be one more massive Clinton lie. The FBI found thousands of work-related emails she failed to turn over, including the new discovery this week of 15,000 more work-related emails she failed to disclose.  What is being uncovered now is one of the most shocking scandals in American political history."},{"comment_id":"1307228812630479","commenter_b":"Yes! !!","commenter_a":"@username take Alice","post_message":"Thousands of purebred dogs from more than a dozen countries are competing at the annual Westminster Kennel Club Dog Show in New York.  See more photos here: @webpagelink"},{"comment_id":"10154342764073701","commenter_b":"Listen to yourselves! Stop just stop! Do you realize that YOU are part of the problem?","commenter_a":"People, they are donating money to people in need. That's it! Why is everyone in such a hurry to provoke anger. Myself I feel all that needs to be said is, Thank you Disney!","post_message":"Disney announced it's donating $1 million to a fund set up to help those affected by the attack at Pulse nightclub in #Orlando."},{"comment_id":"10154292047384877","commenter_b":"She out here looking like Nick now","commenter_a":"Wait so you can demand money for a breakup now?? I must have missed that memo, lol","post_message":"Mariah Carey also took to Instagram to confirm the split and her break-up hashtag game is brutal."},{"comment_id":"10153263764260329","commenter_b":"But what does she think of fat bastard?","commenter_a":"Who is this bitch?? Oh yeah that's right... #Irrelevant","post_message":"Azealia Banks said a whole bunch of interesting stuff, but let's not ignore that startled cat 0_0"},{"comment_id":"1275227535851049","commenter_b":"she can go back to sleeping with cruz! lol","commenter_a":"When he loses, I hope this woman just disappears into obscurity, and gets to feel what it's like to be left behind by Trump. She's an ignorant tool.","post_message":"She had a meltdown after the host repeated Trump’s words verbatim."},{"comment_id":"10153112038031770","commenter_b":"We need TRUMP we need the wall 11 mil illegals today 25 mil tomorrow when will it stop !!!!! North Carolina here voting TRUMP 2016","commenter_a":"And just another reason NOT to have this trash in our country!!!","post_message":"The District of Columbia started issuing drivers licenses to illegal immigrants in 2014, and now some are complaining because the process takes longer than they would like."}]
