[{"comment_id":"10154407674347756","commenter_b":"Muzzie lover go eat crap","commenter_a":"key word temporary oh maybe we republicans should go burn a few cities down now too and a few police cars right! Hmnnn oh thats right we like law and order imagine that.. Good things take time go TRUMP go we have your back...","post_message":"A Federal Appeals court Thursday evening ruled against the Trump Administration’s controversial transportation order, upholding a district court judge’s ruling to block the order."},{"comment_id":"10154764685995470","commenter_b":"Walls do work... ask any prisoner. They keep the bad guy's in and on the border they will keep the bad guy's out... and pregnant mothers wanting a free birth provided by an American hospital. The border invasion has to stop and Trump will stop it.. The wall is a cheap way to get the job done.","commenter_a":"I hope all the geniuses that voted for these clowns are ready to part with their hard earned money...","post_message":"House Speaker Paul Ryan says Congress will front the money for President Donald Trump's newly announced wall on the U.S.-Mexico border."},{"comment_id":"10150710732969999","commenter_b":"@username Under Trump she would probably be stopped from entering the US.","commenter_a":"Now watch Trump dismiss this intelligent young Muslim woman with a bigoted insult as his ignorant fans cheer him on.","post_message":"\"Well, that’s really tragic that you hear these comments which are full of hatred, full of this ideology of being discriminative towards others,\" Malala Yousafzai said in response to Donald J. Trump's remarks on Muslims."},{"comment_id":"1591380840922039","commenter_b":"Legal Mexicans will stay,illegals will get deported..as it should be!!!","commenter_a":"Mexicans broke the fence at the border to come here illeagally, breaking the American immigration laws, so they should pay for the new repaired version (aka the wall) Copy & paste and share this comment if you agree, that way we can support Trump by making him look good.","post_message":"Wow, Mexico sounds like they're literally in the Apprentice boardroom with @Donald J. Trump pleading for him not to fire them. THIS is what it looks like when you've got a president who refuses to back down. It's a new day for America!"},{"comment_id":"949410461745800","commenter_b":"well said Bonnie","commenter_a":"I am from Middle East and full face cover has nothing to do with Islam, it is clearly oppression of woman. Disgusting. Those who say this is freedom of choice or religion should also be sympathetic to Nazi insignia or brutality","post_message":"What do you think?"},{"comment_id":"1009017532480603","commenter_b":"Has this vile woman ever told the truth?","commenter_a":"Hillary For Prison 2016","post_message":"\"What difference does it make?\""},{"comment_id":"10154016611014087","commenter_b":"I agree but Jill can't win. It'd be impossible. So Hillary because of the Supreme Court","commenter_a":"\"The dems candidate is a disgusting violent criminal who should be locked up\" - every republican. \"The Republicans candidate is a disgusting violent criminal who should be locked up\" - every Democrat. \"You both are right\" - every sane person in the country #jillnothill","post_message":"Minnesotans have not voted in a Republican at the presidential level since Richard Nixon's landslide victory in 1972."}]
