[{"comment_id":"1019297701444035","commenter_b":"Fix it or pay the consequences rich people.","commenter_a":"What I want to know, is why in the hell is the contractor, not a American company but one from the UK ?","post_message":"This worker does everything right. He works hard, and all the time, and he still can't feed his kids without food stamps. Why does the Senate allow this?"},{"comment_id":"454178371439410","commenter_b":"Deport all savage backward ass cave dwelling Muslim","commenter_a":"Should ban all muslims completely","post_message":"Should The US Ban Islamic Veils In Public? Comment 'yes' or 'no'."},{"comment_id":"10153788091955950","commenter_b":"Jay the only way Hillary will win is if she lies cheats an steels the votes. Oh wait that's what she does for a living !!!","commenter_a":"This is nonsince TRUMP is not a quiter. He's in it to win it. An he WILL !!! TRUMP FOR PRESIDENT !!!!!!","post_message":"A Clinton plant? A Russian agent? Here's everything you need to know about all the far-fetched explanations of Trump's behavior."},{"comment_id":"10152823352857093","commenter_b":"Manslaughter is manslaughter no matter who you are or what you got...","commenter_a":"I think she's disoriented by her cash! Not the crash..man so a if","post_message":"YOUR TURN: Nicole Hutchison faces an intoxication manslaughter charge, accused of hitting and killing a TXDOT worker on U.S. 75 Central. Police say she told them she was wealthy, they would regret arresting her & asked about her 3 dogs but not the victim. Her attorney says she was disoriented by the chain reaction crash... WATCH: @webpagelink READ: @webpagelink"},{"comment_id":"1093108914084558","commenter_b":"exterminate the cockroaches!!!!!!!!!!!!!!!!","commenter_a":"Muslims are a cancer.","post_message":"Top U.S. Commander In Europe: ISIS is Like Cancer Among Refugees @webpagelink"},{"comment_id":"10156372463505354","commenter_b":"OMG that laugh of hers is so annoying and she is a ugly old bitch! Carley is so much more a women than Hillary could ever be and much more knowledge than the old hag. She let four Americans die in Benghazi she should not even be able to run for President and her emails and her and Bills Clinton foundation fiasco I could go on !","commenter_a":"She is sick","post_message":"*DEMOCRATS' WAR ON WOMEN* Remember how the liberal media EXPLODED when a questioner asked Trump about \"Muslim Obama\"? Well, look at THIS..."},{"comment_id":"10154067022696336","commenter_b":"All you have to do is watch him lady.","commenter_a":"Well, I don't know if Donald Trump is a Christian or not and neither does that pope. Only Donald Trump and God knows that. And I heard a man on TV this morning calling the pope \"the Holy Father\" and my bible says to call NO MAN Father, but your Father in Heaven and I DO KNOW THAT IS GOD.","post_message":"Donald J. Trump responded to Pope Francis suggesting that Trump is \"not Christian.\" @webpagelink"}]
