[{"comment_id":"1043010225790700","commenter_b":"She'll want you to lie and cheat just like she does. Better stay clear of that lot.","commenter_a":"This is why I'm proud to be a Democrat Hillary is on her way Sign me up Hilary Whatever you need me to do Love is better than hate Love you Republicans","post_message":"Tonight: Hillary Clinton at the #DemConvention. Watch the speeches LIVE on Twitter now."},{"comment_id":"10155507784285405","commenter_b":"DO NOT LET the criminal illegal invaders take over our military .","commenter_a":"Karl Keyzer-Andre","post_message":"As we celebrate Armed Forces Day, I want to take a minute to honor and thank all our servicemebers and veterans for your sacrifice. America owes each and every one of you a great debt of gratitude."},{"comment_id":"10152578499710950","commenter_b":"Sore ass losers.","commenter_a":"Redonkulous !!!","post_message":"'Uh, excuse me?'  LISTEN: Reporters ask New England Patriots coach Bill Belichick about 'Deflate-Gate,' and he is not amused: @webpagelink"},{"comment_id":"1243855252377391","commenter_b":"Jennifer, Donald trump doesn't care who you sleep with. Yes, it's better to vote GOP than to vote to import non assimilating Muslims who will cost a fortune and harm our citizens.","commenter_a":"I'm a Bernie supporter who's voting for Hillary whom I think is going to lose to Trump","post_message":"These names would be a huge draw in any feature film, but on Tuesday they lent their star power to another production -- the Democratic National Convention."},{"comment_id":"1841512796060882","commenter_b":"'@username till the wall is complete lol there isn't going to be anyone picking lettuce you better grow your own","commenter_a":"Well Boston Mayor...... you are not the President so you don't get to decide what he focuses on. He's up holding his priority promises to his supporters first then comes the rest. Not the Democrats vision the Trump vision","post_message":"Boston Mayor Marty Walsh says President Trump should focus more on creating jobs and addressing urban issues such as homelessness.  Watch more: @webpagelink"},{"comment_id":"10154216491251943","commenter_b":"WAKE UP AMERICANS .. This May be the Last Chance American and the American people (voters) have to retain and Guarantee, our American Heritages, Customs and Constitutional Rights .. We need to rid American of the Radical Muslims and Illegals who are here and trying to take over America .. Do You want a Clinton Corrupted Government Controlled Life or a Trump Love America Lifestyle for your Children's Children .. SERIOUSLY - that is the Choice Were making and There going to be Living with .. This is more for our Children and there Children than for US but only WE can Guarantee them a life and Future that we had .. Clinton will be a Disaster for America and all Americans .. Surely you can realize that - listen to the news , ,LISTEN .. WE THE PEOPLE - need to Bring back GOD, COUNTRY AND CONSTITUTIONAL FREEDOMS to ...","commenter_a":"Burn the witch!!!","post_message":"Hillary Clinton must be held responsible for using 'private' email accounts and a hidden email server as Secretary of State to conduct government business in violation of the law!  Judicial Watch is the one organization with a proven 20-year track record of investigating, exposing, and prosecuting Hillary Rodham Clinton and company. Please SHARE!"},{"comment_id":"10154979828776729","commenter_b":"Is a mean evil witch all she wants to do is kill us Americans in line her Pockets with more money how can she even be running for president? What is this country turned into?","commenter_a":"Bet she has an allergic reaction tonight !","post_message":"Holy cow!"}]
