[{"comment_id":"1062283227145482","commenter_b":"Glad you decided to be a Republican, Eric! Your bigoted remarks belong with them.","commenter_a":"Chan Zilla, even white people are getting sick of white people's bullshit...","post_message":"The significance of the march on the Confederate museum should not be lost. The Confederacy in and of itself was built on racial terrorism."},{"comment_id":"1005094719524280","commenter_b":"Well lets send Trump to the southern border...im sure he will find all the rapists he is looking for....as matter of fact he should say to the all latino people in their faces,..you all bring nothing but rapists here....im sure when people came thru Ellis Island to start a new life Trump would have greeted them as well.","commenter_a":"Too bad the Coast Guard isn't on the southern border. The Cubans are actually fleeing a dictatorship.","post_message":"A USA Today reporter observed a U.S. Coast Guard crew intercepting Cuban rafters attempting to reach freedom on U.S. shores. Despite the recent news of normalizing relations between the U.S. and Cuba, these rafters were sent back to Cuba before they could celebrate on the 4th of July."},{"comment_id":"10153368767146694","commenter_b":"Those were not feminists, those were trolls.","commenter_a":"Meh to all the feminist crying. If you hate her characterization, you don't have to force the entire female gender into the issue. Also, the action figure industry is asinine. See how it screwed over Green Lantern TAS and Young Justice.","post_message":"Let's talk about The Avengers' Black Widow problem."},{"comment_id":"10155547019200389","commenter_b":"Once again jay you are incorrect as Cheney resigned from Hali when he became VP. As you say google it","commenter_a":"We need to do the same with Bush and Chaney for the Iraq war","post_message":"Egyptian criminal court sentenced ousted Islamist President Mohammed Morsi to 20 years in prison on charges linked to the killing of protesters in 2012."},{"comment_id":"1188852334521434","commenter_b":"These drugs are coming across the southern border.... #buildthewall","commenter_a":"I DON'T BLAME THEM I BLAME DRUG RULES TOO BAD","post_message":"The photos show a couple passed out in an SUV with a 4-year-old child sitting in the back seat."},{"comment_id":"10154743139306508","commenter_b":"She's a liar ....","commenter_a":"The funny thing is the same scenario happened in Egypt four years ago with the Muslim brotherhood president Morsi, when someone beside him was telling him what to say and was caught the very same way Pelosi is caught now. I think same same school, no difference","post_message":"She didn't know people could hear her"},{"comment_id":"740770189446892","commenter_b":"Close all the borders already!!! Damn Obama!!","commenter_a":"Hang that Mo**ey!","post_message":"BREAKING: Muslim Teen Refugee Charged With Murder For Beating 97 Yr Old WWII Veteran To Death This is what happens if we let refugees into our country. This needs to stop. Do you agree we should close our borders?"}]
