[{"comment_id":"421525971373828","commenter_b":"Stop apologizing women! I had an abortion, cause I wanted to and no one ever new! Lol! Ya know why, cause its not your business! Stop saying ,well my birth control didn't work, blah blah blah. Its not illegal! If you don't like abortions, don't have one.","commenter_a":"What does that actually have to do with abortion? Viagra is not causing the death of a living being. It's not about hurting women's reproductive decisions. I mean, I'm all for birth control methods. Just imagine how many abortions could've been avoided if the women were using a very effective form of birth control? And, before anyone says that you can get pregnant on birth control or while using condoms, let me just state that it is over 99% effective if used properly. Although it is possible, it would be a fairly rare occurrence.","post_message":"\"I purposely tried to make it as invasive, as intrusive, as hypocritical and unnecessary as possible,\" the lawmaker said."},{"comment_id":"890262117675915","commenter_b":"When ur young u can wear them, and let's face it, men are men. The girls should be proud they can wear them, and too bad dudes. Let's start a men's line LOL.","commenter_a":"Who is proposing the prevention of girls wearing shorts in Summer? I hadn't heard anything about that.","post_message":"There's no excuse."},{"comment_id":"576869582486929","commenter_b":"BULLSHIT !","commenter_a":"And who's to pay for the insurance? Oh forgot the WORKING CLASS WITH TAX THAT'S WHO!!!!","post_message":"Congress Approves Bill Offering Free Cars To Welfare Recipients. Your tax dollars hard at work. Does this disgust you?"},{"comment_id":"1816060081994479","commenter_b":"Worst lady","commenter_a":"Healthy lunch...kids that depend on this for their only meal for the day are going home hungry.","post_message":"Vice President Joe Biden calls Michelle Obama the \"finest first lady in history\"."},{"comment_id":"1027313147330802","commenter_b":"Jerry, I hadn't thought about Arab nations not taking them for that reason. So-called common wisdom has it that they don't want them because they're potential troublemakers. Your idea makes more (and scarier) sense.","commenter_a":"I don know if anyone realizes what is going on. I always tried to grasp the larger picture; go from the general to the specific and not the other way around. Europe and soon America are under invasion. None of the typical Arab countries have taken the Syrian refugees. Fact. Why? Because they want them to overwhelm the western nations. Infiltrate the society. Surround the culture and change civilization as we know it. At that point, it done. Pretty simple, isn it? Sorry, not if I can help it. Islam is a political movement masquerading as a religion. Smell any coffee?","post_message":"Muslims Tried To Go Big In This U.S. Town, MAD Patriots Shut Them Down (VIDEO) @webpagelink"},{"comment_id":"10153330049981159","commenter_b":"Really? Whatever lady....","commenter_a":"No.","post_message":"Would you support this kind of bill in your state?"},{"comment_id":"828705883906152","commenter_b":"Trump for me all the way! We can't have Hillary. Socialism whatever","commenter_a":"Donald Trump is what we need not another stupid politician. Wake up people stop being so bling of the BS from Hillary, Cruz, Rubio. Those candidates are a joke. We need America back agin the strong country that once was until Obama and now Hillary, please the woman is a liar and a joke. She gets away with everything. Wake. Up America Trump will bring this country back, AMEN!","post_message":"Positive change is not going to come from someone such as Donald J. Trump. He is running for the wrong reasons, nothing good comes out from him. @webpagelink"}]
