[{"comment_id":"10153479348993812","commenter_b":"Nobody wants to see your tears lady, we are saving them for the hero you murdered and left to die. Piece of crap.","commenter_a":"She got what she so obviously deserves!!!","post_message":"Woman charged with murder, accused of killing US Navy sailor in fit of road rage: @webpagelink"},{"comment_id":"10153809983489486","commenter_b":"She needs jail","commenter_a":"oh hell, I know of NO ONE brave enough to bully Hillary","post_message":"Lol, Hillary fishing for sympathy.."},{"comment_id":"1015223798498631","commenter_b":"I see what you did there","commenter_a":"That's gold","post_message":"Sorry folks."},{"comment_id":"1736136556654311","commenter_b":"Secure our borders. ..Start deporting. AMERICA FIRST. ..GO TRUMP.","commenter_a":"This wasn't a racist comment trump was saying the judge could very well be prejudiced against trump because he wants to build a wall to keel illegals out and drugs and people who wants to do harm to our Country and judges parents are Mexican","post_message":"\"Claiming a person can't do their job because of their race is sort of like the textbook definition of a racist comment,\" Paul Ryan said of Donald J. Trump's recent comments about a judge. @webpagelink"},{"comment_id":"1610662465894059","commenter_b":"And she should be out of a job.","commenter_a":"Yes","post_message":"\"These hands clean the rooms every single day for Mr. Trump so he can be rich.\" Meet the Trump workers who are not voting for Donald J. Trump @webpagelink"},{"comment_id":"10153394971818984","commenter_b":"She is as stupid as her 2 sons. one is hell now ,, the otherone will follow .","commenter_a":"I wanted him to get life in prison I did not want him to become a martyr","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing... Do you think this Boston bomber got what he deserved?"},{"comment_id":"10154522869261051","commenter_b":"The only thing Melania will do as first lady is give free head and hand jobs","commenter_a":"He can't handle being President is a joke just like his supporters he is being a reality show president","post_message":"This is not what Donald Trump wanted to hear today."}]
