[{"comment_id":"10153680219934641","commenter_b":"Problem solved!","commenter_a":"I'd still like to know why they need to come HERE? It would be cheaper and safer to house and secure them over THERE. The need to vet them would be nearly eliminated, language issues would be non-existent, violence and criminal acts would be lessened, etc. We can't adequately provide for our nations homeless population as it is. We're going to bring in 10's of thousands of them from another country and shelter THEM, but leave our own (many of whom are veterans) out in the cold? (literally)","post_message":"\"If there's a rabid dog running around in your neighborhood, you're probably not going to assume something good about that dog,\" Dr. Ben Carson said Thursday, speaking about refugees. @webpagelink"},{"comment_id":"1015573841835697","commenter_b":"She'd be fiesty in bed","commenter_a":"Sam WantAndre Szukilojc10154044729995518","post_message":"Don’t you know who I am?   No!"},{"comment_id":"10155155433964778","commenter_b":"She wasn't a black swimmer to me until the media and people who keep stressing the fact of the first \"African American\" ... First off the has been in the past but what I see of anyone in the Olympics is an athlete who trained very hard and worked through their own adversities to reach their goals. To me African Americans want the dividing line to diminish, I know I treat people as people so I think the media should stop putting a dividing line there. I don't care who you are if you want to do a sport and make it to the Olympics with hard work and perseverance you can make it, it's not your color that helps you make it.","commenter_a":"She was just another amazing swimmer to me. I didn't think about her race...SHE made that the issue. It's hard to be colorblind when it keeps getting made an issue BY THE ONES COMPLAINING!! WTF!","post_message":"\"I want to be an inspiration, but I would like there to be a day when it is not ‘Simone the black swimmer.’"},{"comment_id":"10154162076211943","commenter_b":"@username IF 60 % of conservatives and church goers stay home and do not vote. She will win. In 2012 they did not want to vote for a Mormon. SO they allowed a muslim sympathizer to stay in the White House.","commenter_a":"Lold she will just put it in Chelsea's name......","post_message":"The Boston Globe Wednesday demanded that Hillary Clinton shut down her family foundation if she wins in November because the entity \"will always look too much like a conflict of interest for comfort.\"  \"The Clinton Foundation is also clearly a liability for Hillary Clinton as she seeks the presidency,\" the newspaper said in an editorial. \"The foundation should remove a political  and actual  distraction and stop accepting funding.\" - via Newsmax"},{"comment_id":"894715537301698","commenter_b":"The best thing you are doing, Mr. Trump, is weeding the un-Americans out from our society. You are already making the change for America being great.","commenter_a":"@username how was your preteen sexparty with you friend Epstein. It sound s you got a problem dude. Defloration of a 12 year old girl is not ok, if you know what I mean","post_message":"The \"protesters\" in California were thugs and criminals. Many are professionals. They should be dealt with strongly by law enforcement!"},{"comment_id":"1056254801076607","commenter_b":"That's funny but I don't think you could trust Rubio on the border. He's too in to amnesty and letting illegals in.","commenter_a":"Won't it be great when Trump is President , and Rubio is reassigned to mixing cement on the Mexican border ?","post_message":"BOOM!!!"},{"comment_id":"10152722810447014","commenter_b":"Go back to your country, boy! \"We don't like yo kind around here!\" WHITE POWER!!! Lol","commenter_a":"Her come the racist white people...","post_message":"Do you agree with President Obama's executive action on immigration, which shields millions of undocumented immigrants from deportation?"}]
