[{"comment_id":"10152768793527377","commenter_b":"I am white and I criticize him because he is an nut. I voted for Obama twice and decry racism. Much of the criticism toward Obama was WAY over the top that NO white guy with the same basic Democrat policies would have faced. The fact that Snopes had to crerate a whole separate page dedicated to just the massive amount of fake viral emails smearing Obama and outright lying with claims so outrageous that any snae person would immediately question but Conservatives swallowed hoook, line and sinker because of their hateful, irrational, racist bias says it all","commenter_a":"He's a good man and could be a good leader , Vice President too!","post_message":"Black “mascot,” “court jester,” “minstrel show”? Tucker says about Dr. Carson."},{"comment_id":"581788285320289","commenter_b":"Great bitches pun","commenter_a":"@username future job","post_message":"All aboard! These rescued puppies are seeing the entire town on this custom \"dog train.\" (via NowThis)"},{"comment_id":"10153171636986756","commenter_b":"Trust me, women are interested in computer science. The brogrammer culture is very offputting.","commenter_a":"Considering that there were more women in computer science back in Turing's day than there are now?","post_message":"There are fewer women in fields where genius is a perceived prerequisite, a study finds. Does the stereotype of the male \"lone genius\" in art have an impact?"},{"comment_id":"10154665799440141","commenter_b":"We need to stand by our country and our values. Anyone who is allowed into the United States needs to be totally vetted first. I'm sorry, all of you \"open-minded\" people, this just makes sense. Because we are 'Merica!!!","commenter_a":"Islam is evil","post_message":"“All over Europe, all over America we have seen the devastation of evil in our time which is radical Islamic terror.\" Sean Hannity hosted this heated panel on the rise of radial Islamic terrorism."},{"comment_id":"10152880338496636","commenter_b":"Says the white woman...","commenter_a":"Personally I think if the tribes want it built, the tribes should pay for it. It doesn't bother me one bit sitting unfinished and there are so many other things the state could spend the money on. How about paying our teachers a decent wage.","post_message":"You probably driven by this empty building. It had thousands of dollars poured into it, but it still sits as an empty shell. Thanks to a bill Gov. Mary Fallin signed, that may be changing soon."},{"comment_id":"10153620531441157","commenter_b":"Their just upset because she's not Hispanic!","commenter_a":"terriorist at its finest","post_message":"Islamic State claimed responsibility."},{"comment_id":"10152940333217061","commenter_b":"@username shes a hoe","commenter_a":"Hi Guys :) I'm Ashley :) 19 years <3 , I m Single and beautiful <3 girl <3 please like my page :) in 2 secs and i'll send you a friend request and inbox you <3 you will never regret, :( i promise you, please support me by just 1 like <3 1 Like (y) = 99 Help <3","post_message":"Police: Jake Lloyd, the actor known for his role as young Anakin Skywalker in 'Star Wars', arrested: @webpagelink"}]
