[{"comment_id":"10153619308152235","commenter_b":"'@username a racist comment about baking!?? Okay, surely you jest. You don't know what you're talking about so you're automatically excluded. @username I agree it could be seen as sexist except I am a female and bake all the time, but MORE IMPORTANTLY Men are known to be the best chefs😉. @username she didn't make any valid point when she stated 'nothing new, threats made against students daily' She's out of touch with the article and with reality if she is trying to compare unspecified kids being threatened to a RACIST threatening to kill only BLACK KIDS posing with ak47 on the school grounds!! ARE YOU FREAKING KIDDING ME!??? The generalization she attached to this comment is uncanny, disturbing, and I'm sorry RACIST in an of itself. Because the DENIAL of racism IS racism also.","commenter_a":"This is nothing new. Threats are made against students daily! We went through this last year and most kids were kept at home until the instagram poster was identified.","post_message":"Another effing beautiful day in post-racial America."},{"comment_id":"623158744555639","commenter_b":"Oh my that thing looks scary","commenter_a":"Adriana R. Eiro","post_message":"A baby chameleon is born"},{"comment_id":"1559248597428498","commenter_b":"Trump is a friggen rapist!","commenter_a":"Donald Trump and Hillary Clinton walk in to a bar. Donald leans over, and with a smile on his face, says, 'The media is really tearing you apart for that Scandal.' Hillary: 'You mean my lying about Benghazi?' Trump: 'No, the other one.' Hillary: 'You mean the massive voter fraud?' Trump: 'No, the other one.' Hillary: 'You mean the military not getting their votes counted?' Trump: 'No, the other one.' Hillary: 'Using my secret private server with classified material to Hide my Activities?' Trump: 'No, the other one.' Hillary: 'The NSA monitoring our phone calls, emails and everything Else?' Trump: 'No, the other one.' Hillary: 'Using the Clinton Foundation as a cover for tax evasion, Hiring Cronies, And taking bribes from foreign countries?' Trump: 'No, the other one.' Hillary: 'You mean the drones being operated in our own country without The Benefit of the law?' Trump: 'No, the other one.' ...","post_message":"A 36-foot model of Donald J. Trump holding Hillary Clinton's head was burned during annual bonfire celebrations in a British town."},{"comment_id":"1802927083306226","commenter_b":"Well you got what you wanted...he called Illegal Aliens, 'Guests' Now wallow in it.","commenter_a":"Only people glad he's gone are the criminals and illegals","post_message":"LIVE VIDEO: There's a new sheriff in town as Paul Penzone is sworn-in as Maricopa County's 37th sheriff after defeating Joe Arpaio in November's election. Arpaio served as sheriff for the last 24 years."},{"comment_id":"10154899725050329","commenter_b":"All of those children have worked since before they were 16. A simple Google search would have told you that. I love how everyone assumes shit like this.","commenter_a":"I bet Ivanka or Donal Jr never humbled them selves like Sasha. It's obviously not about the money but about her learning the definition of hard work. @username Santiago Wolf @username","post_message":"'You ain't lying around my house all summer.' —FLOTUS"},{"comment_id":"957899690952352","commenter_b":"If they're refugees where have they got the money to buy fireworks - surely they need it for food, clothes & shelter","commenter_a":"Scare them all back where they came from..... And walk a few swine around with you.","post_message":"German officials have asked residents to refrain from using fireworks to avoid traumatizing refugees."},{"comment_id":"10154099091458984","commenter_b":"He is another politician and a big lier as well he cheated in the other debate with Ben Carson he will say anything to get a vote and he will owe a million favors for all the lobbyist sending him,all this money","commenter_a":"Why are people at war all the time with a Democrat or a republican let's change this to U.S. political leaders and vote for a person not a party. They always have to make people take sides and it needs to be changed.","post_message":"With the South Carolina primary right around the corner, Ted Cruz is doing his best to diminish Donald Trump's lead. Cruz's latest attack is getting a lot of attention, and it may cause some voters to ditch 'The Donald.'  Is Ted Cruz right about Donald Trump?"}]
