[{"comment_id":"10158911278605206","commenter_b":"@username, would you feel that way too if you were on an airplane and didn't like the pilot? According to you lilies Trump will destroy America. You might want to hold off on purchasing any party supplies. According to you dandelion's Putin will take over America because of Trump. You daffodils won't be allowed to throw any party's if that's true...","commenter_a":"The world deserves Donald Trump. No doubt about it.","post_message":""},{"comment_id":"10153990107026955","commenter_b":"See you at Blade Show bitch!","commenter_a":"The rights to a free press, free speech, assembly, and religion are extremely important but none of them matters very much if you can’t defend your own life against aggression. Leave your hands off my guns!","post_message":"BREAKING: Active shooter at Lackland Air Force Base in Texas, at least 2 dead"},{"comment_id":"10152747594996051","commenter_b":"@username smart lady","commenter_a":"All this complaining about someone suggesting that one be responsible when getting our tax money. This is crap something needs to be done but then again the bleeding heart unimformed idiots will start crying. Look around and show me the starving people just look at the size u don't get that size while starving.","post_message":"People getting food stamps in this state need to get ready for some big changes."},{"comment_id":"10153167814539203","commenter_b":"typical, bend over asshole, and I'll shove a hammer up your ass. 😊","commenter_a":"leave it to a man, to be an ass.","post_message":"Will Smith on After Earth PTSD: \"After the failure of 'After Earth,' a thing got broken in my mind...\""},{"comment_id":"10153370720431509","commenter_b":"Well the real word is cold and full of corruption and greed. This type of harvesting happens on a daily basis in 3rd world countries, poor desperate individuals selling their kidneys in back allies to rich benefactors. Most illegal organs are stolen form human trafficking.","commenter_a":"Organ harvesting and transport is complicated. You can't just slash a body and grab them out. This sounds like a ploy by the Iraqi govt to get headlines","post_message":"It's a startling claim. If true, what could be driving increasingly extreme tactics #ISIS is employing? @webpagelink"},{"comment_id":"1695743490702170","commenter_b":"@username Hillary should be in Prison!!!!","commenter_a":"I'm 18 years old. This will be my first election to vote in. I'm proud to say that I am supporting Donald Trump! Save my generation, Donald! #MakeAmericaGreatAgain","post_message":"I want to win for the people of this great country. The only people I will owe are the voters. The media, special interests, and lobbyists are all trying to stop me. We won't let that happen! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"10153070035530399","commenter_b":"I thought I saw this woman at Hooters the other night. That's always been a good source of Broadcast talent for Faux.","commenter_a":"Just a new way for the Dummycrats to steal more votes!!!!!!!!!!!!!!!!!","post_message":"It's always Andrea Tantaros."}]
