[{"comment_id":"10156410445115354","commenter_b":"Rebecca the clan was founded in 1865....u ignorant slut....","commenter_a":"If this paper had any business sense and compassion, they would fire that guy.","post_message":"When you see the CARTOON mocking Republican Gov-elect Matt Bevin's adopted children from Ethiopia, just remind yourself: it's only racist when attacks are against Democrats, not Republicans."},{"comment_id":"10153468487630530","commenter_b":"To conservative for you liberal","commenter_a":"Big ol lame duck","post_message":"Is Governor Rick Snyder a lame duck in the making?"},{"comment_id":"10154166667183205","commenter_b":"Very well done mr. Congressman, proud to have shaken ur hand once when u visited vegas.","commenter_a":"Thank you! I'm proud of you! great speech! Facts and more facts!","post_message":"I gave a speech this morning on the House Floor welcoming the new leader of the Republican Party to Capitol Hill and showing him what is on the menu in the cafeterias today -- taco salads (the food Republicans eat to show their love for The Hispanics) and strawberries (which almost certainly were picked and packed by undocumented farmworkers), which is a little ironic given that the GOP now wants to deport 11 million people, mostly Latinos, from the U.S."},{"comment_id":"10158098122215192","commenter_b":"The Crusades need to happen again in Europe @username. Run out the same invaders once more.","commenter_a":"They should add terrorism to those charges. Just because he is not a muslim, doesnt mean he isnt a terrorist. He sure comes off as a muslim in appearance though. Could be a muslim convert. FBI and other authorities just doesnt want to tell us!","post_message":"Esteban Santiago, 26, was charged with an act of violence at an international airport resulting in death - which carries a maximum punishment of execution."},{"comment_id":"921294477938692","commenter_b":"Damn that bitch is fugly.","commenter_a":"Rothschild , Soros, Bush, Hillary, Bill, Hubbard, Gore, Planned Parenthood all are illuminati members. Sold their Soul to Satan","post_message":"“We don’t know all of the details about this particular incident, but we do know that our national epidemic of gun violence must be addressed,” Debbie Wasserman Schultz said Saturday after 3 people were killed at a Planned Parenthood in Colorado."},{"comment_id":"10153647598586077","commenter_b":"Put her back in prison!","commenter_a":"Welcome home Mom!","post_message":"Demaryius Thomas' mom, Katina Smith, will be wearing this custom made jersey today. (photo courtesy Michelle Martinez)"},{"comment_id":"487411828113777","commenter_b":"No kill these mofos","commenter_a":"These people are evil beast.","post_message":"This is INSANE...Deport Them ALL!"}]
