[{"comment_id":"1714479032139903","commenter_b":"Omg","commenter_a":"Amy I want a kangaroo","post_message":"Meet Jimmy, the baby therapy kangaroo! (Footage via @webpagelink"},{"comment_id":"10153851389446955","commenter_b":"@username this guy Julio & Cruz are dangerous crazy nuts that do not understand our European culture & they are racist loonies. BUILD the WALL. Go TRUMP 2016. lol","commenter_a":"Little Jebbie & Cruz is a LIAR & I want to watch sue the crap out of him, maybe Cruz can get another Goldman Sachs loan to pay the damages.","post_message":"FRUSTRATED JEB: 'I Should Stop Campaigning Maybe'..."},{"comment_id":"1261193330568342","commenter_b":"George Papasotiriou","commenter_a":"Bruce Cada","post_message":"Here's what it could mean about your brain."},{"comment_id":"434085210113797","commenter_b":"You've gotta love all the women on here tooting their own horns, huh? lol","commenter_a":"My kids aren't teens quite yet (11 and 6 year old).. But people always thing thy're my brothers... They're in shock when I tell them I've been married for 12 years and my actual age LOL","post_message":"Mom genes.  Which of these women gave birth to the other two?"},{"comment_id":"10153254582474877","commenter_b":"I think that was a reply to the poster.","commenter_a":"Atheists are the first ones to cry Jesus as soon as they get hurt!","post_message":"NFL star Arian Foster reveals he's an atheist: 'Faith isn't enough for me.' Read more on his perspective below.   Grio fam, what's your reaction to Foster's remarks? Sound off..."},{"comment_id":"10153279094626051","commenter_b":"Get her out of there before she does any more damage.","commenter_a":"Kim Davis is where she belongs for disobeying the LAW.","post_message":"Hillary Clinton says Kim Davis belongs in jail. Do you agree or disagree with her?"},{"comment_id":"10152698672020927","commenter_b":"This is the same dolt that though islands could over-populate and flip over.......Donkey","commenter_a":"Another out of touch dem.","post_message":"The GOP budget will cause riots?"}]
