[{"comment_id":"1565559713753745","commenter_b":"Boy are you missing it!!!! Blacks kill each other 1000% more!!!!","commenter_a":"Wow. I didn't really support this dudes agenda before but after this, I can get down with him somewhat. It's a shame a man from another country has to speak on behalf of black Americans.","post_message":"'Why are you Americans killing the black people there, shooting them down when they are already on the ground?' he said. 'Answer that question, because even if it's just one or two or three, it is still human rights violations.'"},{"comment_id":"1010418702314511","commenter_b":"It nothing to do with race. She is a moron!","commenter_a":"they say everything is racist","post_message":"Is racism hampering Serena Williams' career?"},{"comment_id":"1205061579572376","commenter_b":"Christina @username you stupid c-unt you clearly can't read into my post. Go suck on Killerys nip..... Trump 2016","commenter_a":"For all of you who want to tell us it's a leased Eastern Airlines plane. Save it we got it and read it.....","post_message":"Barely 24 hours after Donald J. Trump accepted the GOP nomination for president, something incredible happened with his plane.  What Trump ordered for the plane has conservatives cheering and liberals pitching a hissy fit."},{"comment_id":"10157044490065093","commenter_b":"The only con-artist is Hillary!","commenter_a":"Wow. You work so hard to justify your position. What a word smith. What's your answer. Third party's ? Just how would that work? How would you fix it. You complain but you don't have any idea of merit to beat Clinton except trumps is wrong. A lot of us know he is a jerk and all the other adjectives. But unfortunately in life we have to make unsatisfactory choices when there are no other options. We have no other options except staying home and electing Clinton.","post_message":"'I'm talking about his core supporters, the people who didn just enthusiastically buy his con, they helped sell it to the rest of us.' -- David French"},{"comment_id":"10153447709650667","commenter_b":"If this would ever happen to my mom. I would make room so she can live with me.","commenter_a":"Good just because your old , you still have to follow the rules . If they make exemptions based on age that would be discrimination .","post_message":"“I have four grandsons, but I don’t want to be dependent on them. I can’t be a burden to my family. They don’t have room for me. That happens in life.”"},{"comment_id":"1751080988447451","commenter_b":"FUCKING IDIOT!","commenter_a":"Tyler Steinle","post_message":"You should be VERY careful with things that go BOOM!"},{"comment_id":"953722131412277","commenter_b":"Bye bye little bitch","commenter_a":"All of this MORMON bailting tactics.......declaring him the prophecy.....ARE YOU ALL KIDDING ME....YOU REALLY BELIEVE THIS GARBAGE?? LOOK INTO HIS EVIL EYES and you will see what he plans for us!!!","post_message":"A new poll shows Sen. Ted Cruz (R-TX) with a sizable lead in Utah's upcoming caucus vote..."}]
