[{"comment_id":"10155011219571729","commenter_b":"She can't... And she doesn't plan on it either!!","commenter_a":"do not trust her to protect us.","post_message":""},{"comment_id":"1273163526055538","commenter_b":"Amen we owe them big time, send illegals back to their oun country , start shooting at the border that will stop them lol","commenter_a":"I have been given the option to use an outside provider when they weren't able to get me in within 30 days.","post_message":""},{"comment_id":"10156784755310354","commenter_b":"Fly on your Broomstick Hillary!!","commenter_a":"The fact that she has not been indicted by now with the mountain of evidence stacked against her is proof that it will NEVER happen, folks.","post_message":"There is zero irony in this story."},{"comment_id":"494096337456103","commenter_b":"Thank you San Diego Border Patrol for stopping these two.","commenter_a":"Aren't they lovely.","post_message":"BREAKING: Johnny Lewis Hartley, 39, and Mercy Mary Becerra, 43, were arrested midday Tuesday and are being held on suspicion of murder and child cruelty. When they tried to cross at the San Ysidro Port of Entry, Mexican authorities found the body of a 2-year-old child inside a duffel bag that Hartley had. \"The incident may have occurred in Whittier,\" San Diego police said."},{"comment_id":"1718297721743930","commenter_b":"Lmao","commenter_a":"Lmao....stupid. but let's give them $15 an hour @username @username","post_message":"PRANKSTER: Someone called a Minnesota Burger King and convinced employees there was a gas leak - and they needed to smash the windows to release the pressure. So they did. STORY: @webpagelink"},{"comment_id":"10154044362479024","commenter_b":"Let's cleanse American by not letting his sorry ass back into the USA","commenter_a":"tell Will Smith that we were here frist , and to fuck off","post_message":"With video. Bad things usually happen when leftists start talking about \"cleansing...\""},{"comment_id":"10153771956525428","commenter_b":"@username He is beholden to we the people and he just said he isn't showing up for his interview..","commenter_a":"Trump just lost the election skipping debate.","post_message":"What is the meaning behind Trump long-lasting surge in the polls?"}]
