[{"comment_id":"455232604658620","commenter_b":"Hillary Clinton!!!","commenter_a":"Bernie Sanders!!!","post_message":"Listening is always better."},{"comment_id":"10152821064059342","commenter_b":"^ they just don't have enough self control to keep from raping a woman unless shes covered apparently.","commenter_a":"Why do we have a muslim Capitol day?","post_message":"FBI RESPONDING TO MUSLIM CAPITOL DAY THREATS: Organizers say demonstrators are expected to protest against Thursday's rally. A spokesperson said the event began in 2003 and has never drawn opposition before, but this year online threats have prompted the council giving event to contact the FBI."},{"comment_id":"1091917874180626","commenter_b":"MAKE AMERICA GR8 AGAIN 2016! # AMERICA FIRST # BUILD THE WALL!","commenter_a":"Let's see a lot more arrests...these are terrorists!!","post_message":"Democrats' voter outreach to gang members is apparently working..."},{"comment_id":"10152987943491636","commenter_b":"We all foreigners no one stay for ever on this big country called earth.","commenter_a":"She's not banning foreign students only getting them to leave after they have qualified. It's not part of the deal that they can settle in The UK","post_message":"It's not a very popular decision"},{"comment_id":"10152578499710950","commenter_b":"Sore ass losers.","commenter_a":"Redonkulous !!!","post_message":"\"Uh, excuse me?\"  LISTEN: Reporters ask New England Patriots coach Bill Belichick about \"Deflate-Gate,\" and he is not amused: @webpagelink"},{"comment_id":"10153692790361323","commenter_b":"I have a rare photo of Barack Obama actually working as President instead of playing golf. Rarest thing around. Unfortunately, as with everything connected to Obama, it is worth SQUAT.","commenter_a":"lovely","post_message":"Henry McCarty, known in Wild West lore as Billy the Kid, lived a brief and violent life, stealing and killing before his death in a gunfight aged 21. He lived with a gun in his hand – and sometimes, it seems, a croquet mallet.  Read the extraordinary story of how only the second photo ever authenticated as showing Billy the Kid came to light: @webpagelink"},{"comment_id":"10152823501296130","commenter_b":"They're some weird people ..these should not reproduce so good for her weird ass","commenter_a":"I would rather marry for love than for desperations.......","post_message":"Taking matters into her own hands!"}]
