[{"comment_id":"636474266540179","commenter_b":"She's an idiot!!","commenter_a":"I watched her speech on the live stream and was absolutely blown away. Credit is definitely due to the writer, but Ashley's delivery was perfect. The emotion as well as strength behind those words brought tears to my eyes!","post_message":" am nasty like Susan, Elizabeth, Eleanor, Amelia, Rosa, Gloria, Condoleezza, Sonia, Malala, Michelle, Hillary! Ashley Judd at the Women's March on Washington"},{"comment_id":"1837423903207723","commenter_b":"She speaks in a strange language called hooking and whoring.","commenter_a":"Jackie Kennedy: BA in Arts Hilary Clinton: graduate Yale Law Michelle Obama: graduate Harvard law Laura Bush: degree in eduction, Masters in library science Pat Nixon: worked odd jobs to put herself through college including sweeping the floor of a bank! Graduated with the equivalent of a masters degree from the University of Southern Cali. Lady Bid Johnson: BA in journalism from the university of Texas Nancy Raegan: drama and English major graduate of Smith Melania Trump: college dropout. Model, married her sugar daddy, excuses his misogyny as \"boys will be boys\" lies on command. I don't care if she's posed nude so long as she has integrity. If she's honest. If she's got a mind of her own. But she doesn't. And that's a problem. Yep. Awesome role model. AWESOME. 🙄 #GiveMeABreak","post_message":"Liberal or conservative, misogyny is misogyny."},{"comment_id":"10153337350877217","commenter_b":"This is like a long running sentance And Jimmy saville is still dead.this often crops up in papers.","commenter_a":"Yaw hear about Colbert Chischilly?","post_message":"Tributes were paid to Leslie Nielsen today but he died 5 years ago..."},{"comment_id":"1588983808072440","commenter_b":"Why are gender confused women so ugly??","commenter_a":"Very dangerous! Students looking for a leader. Maybe a Pol Pot?","post_message":"“I’m never going to argue with people’s feelings,” she says... before explaining why she rejects the feelings of conservatives who have been silenced."},{"comment_id":"10155350061090231","commenter_b":"He couldn't shoot him in the leg and let him live?????","commenter_a":"Did he sprinkle crack on him before calling it in?","post_message":"BREAKING NEWS: Video shows SC police officer, Michael T. Slage, shooting Walter L. Scott, 50, in the back as he fled."},{"comment_id":"1164695216980191","commenter_b":"@username if you don't appreciate how this site reports things or how it's run, do us all a favor and take your clicker to someone else's bait!! Life's too short to have to deal with such negativity! Peace!","commenter_a":"This happened a year ago... Wonder why it is recirculating?","post_message":""},{"comment_id":"10154306922931943","commenter_b":"Can I demand answers to what laws ye dupes say she broke?","commenter_a":"Criminal","post_message":"Hillary Clinton must be held responsible for using \"private\" email accounts and a hidden email server as Secretary of State to conduct government business in violation of the law! Judicial Watch is the one organization with a proven 20-year track record of investigating, exposing, and prosecuting Hillary Rodham Clinton and company. Please SHARE!"}]
