[{"comment_id":"10153678796416491","commenter_b":"If its a libby female like killary, she'll be fine on the side of the road ;-)","commenter_a":"Dude. You left a lady on the side of the road. I don't know how you were raised, but someone needs to kick your teeth in.","post_message":"The driver said the woman was “obviously a socialist”"},{"comment_id":"1271408779539022","commenter_b":"You girls are hilarious 😘😘","commenter_a":"Marijoe!!!!","post_message":"The whole thing is very ~Mermaid goth.~"},{"comment_id":"1357303384289688","commenter_b":"Well how black do you have to be to be considered black... Since you have a PHD in biology","commenter_a":"\"If celebrating my roots and culture during Black History Month made anyone uncomfortable, those feelings were there long before a video and long before me,\" - Beyonce I totally agree!","post_message":"\"I'm an artist and I think the most powerful art is usually misunderstood.\""},{"comment_id":"10153574405058352","commenter_b":"No lesson learned. Maybe she wore her moms shoes because she could not afford a pair of her own","commenter_a":"She should have stayed down and took those shoes OFF and kept it movin","post_message":"Lesson learned! Moment girl graduating from high school wobbles for 12 SECONDS in platform heels before crashing to ground"},{"comment_id":"1738314809766910","commenter_b":"She should have moved here...we don't know who she is","commenter_a":"no matter what happened, she is the one who took the decision (??!) to take her own life. Unfortunately, she seemed a desperate and lost soul...","post_message":"Screenshots and soundbites from the video were mocked by Italian social media users and YouTubers."},{"comment_id":"850014095139630","commenter_b":"Those illegals and Refugees are everywhere,and plenty of them,obama has been busy letting them in the last 8 hills,hillary killed off soldiers[American] and wanted muslims in,guess she wanted to kill babies that was full term so they would not grow up for the usa,,what a mess,in the usa,why don;t they stop all of this junk? This is America?","commenter_a":"So I have posted this many times.... How many of our citizens have to die or be injured before these Far Left Dems understand and see the light! These illegals and Refugees are not good people......","post_message":"John Kasich opened up Ohio's borders to refugees and himself to a tidal wave of Twitter hate..."},{"comment_id":"1018549428199222","commenter_b":"Deport all of them before they have greater numbers!","commenter_a":"“The thing about Muslims that you should realize, is that they do not assimilate. Islamists don’t adapt to the existing culture of the host country, they simply try to force citizens of that country to conform to their beliefs or suffer the consequences,” wrote Diana Spirit. 1. @webpagelink 2. @webpagelink 3. @webpagelink","post_message":"MUSLIM IMAM: Be Compassionate...Kill Gays [Video]"}]
