[{"comment_id":"530005010538423","commenter_b":"Hey @username! U must identify yourself the opposite of what you were born as!?!?!?","commenter_a":"There are SO many other REAL issues the VA should be working on, and this is NOT one of them.","post_message":"A proposed rule would end the U.S. Department of Veterans Affairs' longstanding ban on gender reassignment surgery."},{"comment_id":"1269700346456350","commenter_b":"Too bad the women in 296047720780605s life are undeserving.","commenter_a":"I've tried to explain this to friends and family.... and that I have no problems with them being Republicans, it's their blind support of this horrible man that is problematic.","post_message":"Let's get this straight...  Thanks to CAFE."},{"comment_id":"930011010437419","commenter_b":"Lady u need help fuck grump","commenter_a":"'Semame?' Really, is spell checking really that difficult? I'm only pointing this out because it's a constant with your memes and videos. As funny as they are and as much as I enjoy them, please, for the love of God, use spell check. You look like buffoons when you misspell such easy words.","post_message":"WATCH: 10 years ago, Sesame Street called out trashy Donald Grump.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"512225352297167","commenter_b":"put that baby arm away bitch get tight hoooeeeee","commenter_a":"Savage","post_message":"It be like that"},{"comment_id":"10153213932211051","commenter_b":"Dumb fucking bitch","commenter_a":"Tabby Witt This lion was in a protected park and was lured out by a dead animal carcus on a stic. Then shot by the dentist with a bow and arrow and after 2 days went by the dentist finally caught up with the lion and then shot him. If you can't see the problem here then you are part of the problem.","post_message":"The hits just keep coming for Cecil The Lion's pride."},{"comment_id":"1727638077485478","commenter_b":"Theyre cool. But they claw into you. Very clingy animals","commenter_a":"'@username this is why i wana go Australia - want one asa pet lets get one","post_message":"Koala joey plays in baby basket. Via Symbio Wildlife Park"},{"comment_id":"10155111311329170","commenter_b":"Another Crazy Woman, she needs to go away, Far away !","commenter_a":"This woman belongs in an institution. She is delusional. Medicate her and get her out of office. My god.","post_message":"VIDEO: Somewhere in California there's an entire district of people who keep sending this woman back to Washington. Wut."}]
