[{"comment_id":"10153350173059255","commenter_b":"Isn't that one of their anchorwomen?","commenter_a":"Most 'Sex Obsessed' persons constanty ruminate about avoiding and policing sex.","post_message":"Really, guys?"},{"comment_id":"10153537278823984","commenter_b":"Women in that cult are beaten and stoned and daughters married off at nine. Honor this way of life????","commenter_a":"Emperor PINOCCHIO is trying to make his MUSLIM brothers happy!","post_message":"News of this has been met with sharp criticism by many.   Do you believe the military is enforcing policies hypocritically?"},{"comment_id":"10154221226031509","commenter_b":"Its not a stare down, lol! Whe one talks the other listens & thinks, then vise versa.","commenter_a":"Obama is intimidated by Putin he can't even look at him in the eyes.","post_message":"Heads slightly bowed, looking extremely serious: What were Obama and Putin discussing?"},{"comment_id":"10154465141311037","commenter_b":"Melania DUMP","commenter_a":"Think the media wants to sh!t all over this to distract the public on what's really going on...","post_message":"Did Donald J. Trump's campaign literally just RickRoll the nation?"},{"comment_id":"609328869267784","commenter_b":"Racist woman","commenter_a":"It's always been great.","post_message":"Beyoncé appeared Monday night at the Grammys and led a visual and musical performance celebrating motherhood."},{"comment_id":"10154515362469087","commenter_b":"Way too big of words for this crowd guys. Need to simplify it. Mexicans are the cause. Build a wall and it will rain in California.","commenter_a":"Science is no longer about science. It has become driven to support a liberal socialistic goal. They are as political as anything else and just as suspect of being true.","post_message":"Bernie Sanders: 'A modern society cannot survive unless decisions are made on evidence-based research. Congratulations to those scientists and researchers who are fighting back.”"},{"comment_id":"603575639802390","commenter_b":"Dumb bitch but I completely understand there decision to shoot the Silverback.","commenter_a":"If you are such a negligent parent that you allow your 4 year old child to fall into the pen of a wild animal, you should have to descend into the pen yourself and fight the animal with your bare hands to show society that you are still fit to be a parent.","post_message":"The zoo's decision to kill a 17-year-old, critically endangered gorilla after a 4-year-old boy fell into the animal's habitat has sparked outrage."}]
