[{"comment_id":"10154153179614445","commenter_b":"She is a female plain and simple dna dont lie!!!!!","commenter_a":"Good sorry but proud of the boys for standing up for their rights...you are a boy not a girl therefore no you shouldnt have the right to be king ...go home and sit in a corner and cry","post_message":"A transgender teen and his peers are protesting their high school’s decision to deny his bid for prom king. Hear Ash’s story: @webpagelink"},{"comment_id":"1079778352065591","commenter_b":"She is cum bumb","commenter_a":"Hillary may be her Girlfriend!","post_message":"Talk about condescending!"},{"comment_id":"10152764281491680","commenter_b":"Reminds me of Nancy Reagan. Stepford wives, both of them.","commenter_a":"Not surprised that a cheater would support a fellow cheater. Also...why does his wife always looked demonically smiley at literally everything he says. She creeps me out.","post_message":"Chris Christie addresses the controversy surrounding Tom Brady, the New England Patriots and Deflategate."},{"comment_id":"10156946907525389","commenter_b":"@username you are just a hater. Stop disrespecting people specially Muslims.","commenter_a":"Love this man!","post_message":"\"Why didn't she say, 'Hey, make better lifestyle choices?' If you want to join something, why don't you join a church, why don't you join the Boy Scouts or the Girl Scouts?\" Milwaukee County Sheriff David A. Clarke Jr criticized Hillary Clinton's comment on joining \"positive gangs.\" @webpagelink"},{"comment_id":"10153308445179342","commenter_b":"You right, had he been a negro, that M.F would be pushing up daisy right about now.","commenter_a":"If he was black I doubt he'd be alive to take pics","post_message":"SUSPECT PHOTO RELEASED: Kevin Daigle, 54, of Lake Charles was arrested for allegedly shooting a trooper in the head during a traffic stop. Charges against Daigle will include attempted murder of a police officer. DETAILS --> @webpagelink"},{"comment_id":"1118758671477300","commenter_b":"Illegal immigration is what Americans are against Trump for president 2016 !!!","commenter_a":"Biden doesn't speak Spanish either. I bet he had a huge crowd","post_message":"Joe Biden went to Mexico on Friday and delivered a clear message: The views of Trump absolutely do not represent the views of most Americans. Do you agree with the VP?"},{"comment_id":"10153080990943812","commenter_b":"Scumbag","commenter_a":"Why wasn't the mother given custody ? Custody was given to a parent with mental ssues ? This is not the rest of the story yet . Florida fails aagain and again we hear about more changes. Meanwhile NO ONE is held accountable and a child is dead. Oh well.","post_message":"UPDATE: Attorney says she reported to authorities that father was acting erratically before he allegedly threw 5-year-old girl from bridge to her death in Tampa Bay: @webpagelink"}]
