[{"comment_id":"1068743996585956","commenter_b":"No deport non americans and those who wish to leave..escort them to Mexico..let themtry their bullshit with them..see how far they get..I am fed up with the demorats/libtards!","commenter_a":"No","post_message":""},{"comment_id":"10154348216771337","commenter_b":"Michael Joseph wow this guy has balls, he's about to lose 100,000 to the Rap God","commenter_a":"That's cute","post_message":"WTF? Nick Cannon has quite the challenge for Eminem."},{"comment_id":"10153295619909384","commenter_b":"I beg to clarify this situation. As we all know, Pelosi has been psychotic for several years. I think the question that should be answered is this: How many blind and ignorant lemming liberals have kept this shameful person in the powerful position she is in, for as many years she has been elected? That is where the real shame lies.","commenter_a":"Since when do you care about Homeland security, Nancy. You who totally have supported all that obama has done to destroy the security of our nation's borders and let millions in including criminals whose own country does not want them. You are a joke and a puppet whose love of our nation was destroyed by your love of power and party. Just shut up.","post_message":"We shouldn't wait another day to remove all doubt to our enemies, to American families and to the affected workers that we will fully fund the Department of Homeland Security. My full statement: @webpagelink"},{"comment_id":"10154343629676636","commenter_b":"Muslims treat you way better then any Jew would.","commenter_a":"Israelites are the best . shut up you muslim dicks","post_message":"BREAKING"},{"comment_id":"10153186192812550","commenter_b":"Oh @username its so sad. First of a talking back is not a threat. Second if he wanted to arrest her , he did not need to throw her on the ground & pull her hair. Those kids were running up to save their friend & I would have done the same thing. Third she was all ready sitting down , it was no need to push her head down in the dirt & sit on her. Apparently the kids were invited by a guest. They didn't start the fight at the party some old ladies started it.","commenter_a":"Absolutely NOT! 1.The video is incomplete. 2. The cops appeared to be outnumbered at least 4:1 3. He did not use lethal force. He restrained an individual who was not obeying his directive. 4. When another individual came from behind him; he did as any police officer would and drew their weapon. He then quickly holstered it when the threat was lessened. 5. If these kids showed proper respect for law enforcement; this would have been a different story.","post_message":"Call for cop to be fired after pool party video @webpagelink"},{"comment_id":"488632654671676","commenter_b":"55555","commenter_a":"Nonthawat Ford Focus @username","post_message":"Watch this T-Rex own ‘American Ninja Warrior.’"},{"comment_id":"1778455155709145","commenter_b":"Didn't \"us\" apes breastfeed your people? Lol...Some people were too lazy to breastfeed their own damn babies. Got some of that ape milk in ya'll system still from slavery!! 😏","commenter_a":"Black guy deserved it stupid black idiot not being racist being honest the black guy should have kept his mouth shut why was he at the Donald trump convention if he did not like Donald trump black retard","post_message":"The 78-year-old white man accused of punching a black protester in the face at a Donald Trump rally in North Carolina made his first court appearance on Wednesday. If found guilty, how would you punish him?"}]
