[{"comment_id":"1089862507690725","commenter_b":"NO!!! Girls are NOT Intelligent enough, Athletic enough, Independent enough, Mechanically minded enough, Wood Working enough, Outdoors enough, Tough enough, Strong enough, Brave enough, Work Hard enough AND are Too clean, Too emotional, Too femine, Too Goofy PLUS don't like Spiders, Roaches, Vermin , nor Bats. Need any other reasons?? Let's stop being so PC and keep the girls where they belong, in the House, Kitchen, Laundry Room, barefoot, definitely barefoot and making babies. That's GOD'S will!!! If you don't agree, we can just have the BOYS join the GIRLY Scouts. BTW, I'm a LIBERAL, oSCUMa, Kerry and HITLERy lover!!! Can't you tell.","commenter_a":"No-they have girl scouts.","post_message":"Should girls be allowed to join the Boy Scouts?"},{"comment_id":"10153098035411336","commenter_b":"No black race can prosper in caucasian society africa today has more midlle class than india our people in united states are in hell we africans has more future than them i hope one day they would come back to their motherland and leave the caucasians with their stolen land","commenter_a":"Time to clean up your act. Why do Asians, Europeans and other immigrants acclimate themselves into society but after 150 years blacks still expect others to take care of them. They are a society of takers and beggers. I'm sick of it. Why has Oprah, Conde Rice, Colin Powell and many others succeeded? ... they conformed to society, got an education and accepted responsibility for their own life and THEY WON.","post_message":"'Nobody from ISIS ever terrorized us as a people as the police do us daily,' Nebraska State Sen. Ernie Chambers said during a recent legislative hearing."},{"comment_id":"10153248022411336","commenter_b":"John V Salazar","commenter_a":"We had a similar issue at a university I worked at years ago. The guy was just a creepy freak but he cried 'academic freedom' and got away with showing porn in a music class and 'relating it to music'. Oddly enough, once he FINALLY retired, the class was discontinued as it had no value. There are times academic freedom goes too far and yet that is the basic premise of any university and with tenured faculty your hands are tied if they 'justify' it.","post_message":"Parents, what do you think of this? A professor at UC San Diego is reportedly asking students to be naked to pass the final exam."},{"comment_id":"10154884706896729","commenter_b":"She wasn't worthy to be a. Olympican","commenter_a":"Then she gets disqualified and out of the Olympics!!! Send her home!","post_message":"Islamic anti-semitism on full display, folks..."},{"comment_id":"10154570057689369","commenter_b":"Hillary was dead broke, now worth 100 million. How much taxes did she pay on that? 100% growth should be taxed at a high rate according to Hillary.","commenter_a":"Can Trump shut up for atleast one week. Every day, he is making a point, where more n more people are hating him","post_message":"'No one should be surprised, though, if Donald J. Trump has paid far less - perhaps even zero federal income tax in some years.'"},{"comment_id":"10152817661912623","commenter_b":"like I say the only good snake is a DEAD ONE, since they ate my baby turkeys-I HATE THEM MORE","commenter_a":"Time to move. Fr.","post_message":"WATCH: What one North Carolina couple found in their spice cabinet will shock you.   Warning: There is some language in the video."},{"comment_id":"10153503112318812","commenter_b":"Stephanie is a dumbass.","commenter_a":"STAGED!","post_message":"UPDATE: Dallas police: Sniper shot driver who opened fire on officers from armored van; unable to say whether he was killed: abcn.ws/1KNBxWA"}]
