[{"comment_id":"10152987522331336","commenter_b":"Hahaha stupid white girls","commenter_a":"Wish we could deport him..","post_message":"Moments ago, President Barack Obama vowed to appeal a federal judge’s ruling to block executive action on immigration. @webpagelink Don't miss Texas Governor Greg Abbott's response tonight at 10p ET on 'Hannity.'"},{"comment_id":"410085892484700","commenter_b":"Yes, look at Seattle. They're thriving. Lol WTF. Way to make a point against yourself. The two highest min wage cities are Seattle and San Francisco and they're also the top two fastest growing metropolitan areas in the country right now.","commenter_a":"If you think shit is expensive now, just wait when the minimum wage is 10 bucks an hour...Walmart is in favor of this because people will only be able to afford to shop at Walmart instead of the locally owned businesses","post_message":"Walmart's announcement that it will raise its minimum wage to $10 an hour was claimed as a victory by both advocates and opponents of raising the federal minimum wage."},{"comment_id":"828114997284754","commenter_b":"Can goats give consent?","commenter_a":"Polygamy is next. Then incest not far behind. Chris you gonna marry a goat?","post_message":"BREAKING"},{"comment_id":"985606431474778","commenter_b":"@username, I understand what you're saying. I'm supporting Ben Carson for potus. But with all the voter fraud, illegals voting Hillary will be president. That scares the crap out of me.","commenter_a":"Sadly, I fear she will be our next POTUS. It's a bad, bad time in America.","post_message":"This is so sad."},{"comment_id":"1507272636242022","commenter_b":"@username, that is exactly what Americans are so angry about , is our own traitorous bunches of Bureaucratic terrorists that not only has funded but brought into our own country on our own American soil, these terrorists that they somehow continue to push on the public and is why Trump stood up and heard American peoples complaint, not one politician up in that white house is a true American, or else they would have long ago removed the terrorists as well as not funded them with the peoples hard earned tax dollars, all Trump is saying is know whom we are allowing into our country, something the now Manics in the white house are not doing..","commenter_a":"Yeah Donald Trump is protecting Americans. Maybe if some of his supporters read a little about Hitler and Nazi Germany, they would see some similarities. I mean, the Jews and Communists were plotting against the Germans, right? They did start that tragic Reichstag fire, didn't they? Oh! And let's not forget the gay people and the mentally ill! America has a problem with them too! Yeah and women too. We've just gotten all uppity during the last 40 years, trying to steal men's jobs. Send us away too. And while we're at it, let's round up the Japanese again. I mean, they attacked us once, what's to stop them from doing it again? Of course, we should forget they were mostly citizens and born here! It absolutely amazes me how many people believe this!!! It's unamerican! It's dangerous. When you start sending a group of people off like that, where ...","post_message":"This is one of the most powerful segments we've ever seen. Tom Brokaw compares Donald Trump's call to bar Muslims from America to Japanese internment, Nazi Germany, McCarthyism, and Jim Crow - and he didn't stop there. This amazing video is well worth taking a moment to watch, via NBC News"},{"comment_id":"10153591407472293","commenter_b":"So youre saying,sir , that you may agree with some of their values and not be aware that you do because of conditionally environmental blindness.","commenter_a":"We're seeing some of the results of Donald Trump's subpar education. He makes up for his lack of intelligence with bluster, but in the end it won't serve him or our country well. Next Trump will boast that he will make the trains run on time.","post_message":"Donald J. Trump's responses quickly prompted criticism from his Republican rivals and others."},{"comment_id":"1393410924025989","commenter_b":"Sam","commenter_a":"They should name the chicks Liberty and Freedom","post_message":"HATCH WATCH CONTINUES: Eagle parents Harriet and M15 have taken turns incubating two eggs. We could have an eaglet hatchling soon. (Video courtesy of Dick Pritchett Real Estate) @webpagelink"}]
