[{"comment_id":"459523527541329","commenter_b":"Because so many criminals in this country. That's why I'm so confused why so many foreigners want to come here and live. Just stay in your own country and make it better there.","commenter_a":"Drugs and drug dealing. No good role models. Role models that are drug dealers ,pimps and prostitutes. Ex. Jay zeee. Beyonce, barrack oboma. All thugs. That promote drug use and degrade women.","post_message":"The U.S. incarcerates more people than any other country in the world. One in three African-American males born today are expected to go to jail or prison at some point in their lives."},{"comment_id":"10154506752502619","commenter_b":"Call Sarah please let me leave you with this I am Hebrew my tribe is Nazarene but I am not Jewish a lot of people and I know that you're not one of them get that mixed up quite a bit for it is possible to be Hebrew and not to be Jewish","commenter_a":"There were no unions until the 19th century when a bunch of Jewish garment workers in NYC publicly protested and marched through the streets for safe,decent places to work and a living wage. How dare this bunch of ignorant,uneducated pigs discuss human rights. They couldn't find Israel on a map if their lives depended on it. Their hatred is based on jealousy of the achievements of Israel and the will to survive in a world where hatred of Jews is very fashionable.","post_message":"Citing the Jewish state's \"long history of violating the human rights of the Palestinians,\" the United Electrical, Radio and Machine Workers of America have reportedly become the first nationwide union to join the boycott against Israel."},{"comment_id":"1228480800579306","commenter_b":"also don't worry about the food, mods gave another interesting fact Eagles do not waste food they will eat it!","commenter_a":"Watching from Buckley Michigan","post_message":"SNUGGLE TIME: Fuzzy eaglet is snuggling as lunchtime approaches! VIDEO: Southwest Florida Eagle Cam"},{"comment_id":"10153106152611336","commenter_b":"Imagine, Christian leaders to lead a Christian group? Lol!","commenter_a":"Maybe Cal state I should be recognized","post_message":"A Christian organization at California State University, Stanislaus has been de-recognized because the group wanted its leaders to be Christian."},{"comment_id":"10153825338913690","commenter_b":"... and what does anybody to prevent it, concerning slave traffickers???,","commenter_a":"Well it's right what you say, but where is Qatar in that case? Shouldn't Muslims help Muslims. I can't see any help from Saudi Arabia, Qatar or UAE!","post_message":"\"To have the small bodies of babies and children carried ashore or washed up on these idyllic beaches is devastating. I have seen children sleeping in the mud under a flimsy bit of cardboard, and kids shivering with blue lips and hands. We expect the situation to get much worse as winter really bites.\""},{"comment_id":"1231536326885822","commenter_b":"She's not getting in the White House !","commenter_a":"The real sad thing is that Hillary won this election a long time ago with lies , blackmail, payoffs etc. The list goes n and on. She and her party are so dangerous and I fear our world will never recover from her.","post_message":"SHADY KAINE @webpagelink"},{"comment_id":"10154285889541350","commenter_b":"Congrats Dylan and Savannah must be something in the water up there. Have a great day to all of you guys. From Georgia","commenter_a":"Good morning","post_message":"Join our weekend TODAY anchors for their first Facebook Live Q&A! Comment below with any questions you have for a chance to have them answered live!!"}]
