[{"comment_id":"1187260984619751","commenter_b":"Build the wall then bill his estate","commenter_a":"Build a wall on the edge.","post_message":"Tell the truth....what would you do?"},{"comment_id":"10154259751471509","commenter_b":"What because he supports the laws of the land? Yeah. Illegal immigrants are illegal. Period. Muslims harbor terrorists.. Period. We are 19 trillion in debt. Will take a business person to get out of it, not a crooked politician who put us here..period.. I can keep going","commenter_a":"That's the main reason Trump will be elected, we the people are pissed, Hillary lies, Obama lies, Congress lies and the media lies for them","post_message":"Ever felt that politicians were fibbing? Several CNN Opinion contributors weigh in on truth and lies in the political realm."},{"comment_id":"10153356332992169","commenter_b":"Going to watch all the seasons leading up to it. I'm so excited, but already sad it's the last season.","commenter_a":"I CAN'T WAIT!!!!!","post_message":"NEW Downton Abbey video: Seeing is believing! The Final Season premieres Sunday, January 3 at 9/8c on MASTERPIECE | PBS (Masterpiece Theatre)."},{"comment_id":"373714942816800","commenter_b":"these two remind me of demons..... boy are they in for a surprise on judgement day... I will pray for them.........they are so misguided........","commenter_a":"It is my understanding that there are some Seal team guys in the middle east that would like these guys to come and visit....and they will be glad to indoctrinate you about how things work in their part of the world...please make a reservation as soon as possible.","post_message":"Bill Maher joins Michael Moore in the war against Chris Kyle..."},{"comment_id":"10154261283691350","commenter_b":"Yes, those dang gators.","commenter_a":"@username, is this the real reason you're leaving Florida lol","post_message":"Is that thing real?!"},{"comment_id":"10154242655245470","commenter_b":"@username bush got much much more killed. Both are evil.","commenter_a":"Wasn't there a war going on? You all are concerned about her supposedly lying and 4 military personnel died? Any concern about weapons of mass destruction lie GW Bush told and has been responsible for 7000 deaths?","post_message":"The suit claims the victims' deaths \"were directly and proximately caused by the negligent and reckless actions of Defendant Clinton.\""},{"comment_id":"10153085738765163","commenter_b":"Yep @username. Sophia was a crazy cat lady. Lol","commenter_a":"Renee Rudd","post_message":"SHE WINS. 😂💛😸"}]
