[{"comment_id":"367721800082095","commenter_b":"Lol \"rape culture\" sweetie go live in the Congo where the war lords use rape as a tool and come back and tell me this label is \"rape culture\" rape is a serious and horrible crime that doesn't need to be trivialized with your suburban feminist mindset.","commenter_a":"Rape culture nonsense again. The world gone mad. Get a life feminists. A slogan on the beer isnt going to encourage rape for fuck sake.","post_message":"\"The perfect beer for removing 'no' from your vocabulary for the night.\"   What?!?!"},{"comment_id":"10153140603601051","commenter_b":"Shut up bitch [Lizzie] !!!","commenter_a":"I believe you were given an explanation...if your son didn't understand, you sure did and should have suggested he put it on the wall or door of his bedroom. You are the parent.","post_message":"This mom didn't think anything would happen when her disabled son displayed something in his window. A few days later she got a letter from her community's management company: Pack your things and leave."},{"comment_id":"10154130394501545","commenter_b":"@username I think CNN is giving you false hopes. You might want to turn off the biased media.","commenter_a":"I love how \"news\" organizations report this as news. Headline should read \"Professor got lucky with one correct prediction, and hopes another will come true.\"","post_message":"A professor who has correctly predicted the outcome of every presidential election since 1984 has a new prediction..."},{"comment_id":"528408970683016","commenter_b":"ghetto skank bitch","commenter_a":"They have,gotten away with it for six years and will keep doing it tell they leave the white house","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"10153541380362093","commenter_b":"@username obviously you think you are what you arent thats why its called a disorder im not going argue... is the sky green? is grass blue.. no... and im not going to argue that it is.... and the problem isnt so much trannies like i said its men who know what they are that are now not looked at twice for going to the womens restroom, nobody will bat an eye even if his intentions are evil...","commenter_a":"As a transgender person, I'm sorry that me having to do a natural bodily function in the bathroom that matches my gender identity affects your life so much. Get over it, we're here to stay. I was born and raised in Texas, regardless of what y'all say about us, I'll still be using the men's room.","post_message":"The founder of the movie theater believes the bathroom debate has gotten out of control and hopes his new design will make the issue a non-issue for customers... @webpagelink"},{"comment_id":"10153409431986336","commenter_b":"Give it a rest ! Donald Trump has every right to his opinion. I agree that this country has had an influx of illegals for years. Be informed and know that Mexico and Guatemala have cut a deal to send thousands more to cross our borders illegally. The monies they send back to Mexico and Guatemala is $120 Billion dollars. This president wants to give them a free pass plus $35 thousand tax refunds? So they cross illegally, burden our health centers, schools, and oh only so you get my disgust! All I used to hear at the hospital is people telling other relatives of theirs to \"Come to the U.S., because this country is so stupid. They give you money for living, food stamps and oh if you have your babies in the U.S. , then they are citizens and you can stay\"... So these so called nice people ...","commenter_a":"Its a PR move. All they really care about are the $$$$$$ NBC and MSNBC are financially hurting. Low ratings low viewership.","post_message":"Breaking News: NBC is ending its business relationship with Donald J. Trump due to his \"recent derogatory statements\" regarding immigrants.   DETAILS: @webpagelink"},{"comment_id":"513245565531981","commenter_b":"I rarely say bad things on fabebook , but she 's a real bitch.","commenter_a":"Coulter and FOX's best days are wayyy behind them. Here's hoping this ideology of thiers dies a slow death","post_message":" know what this convention really needed? An angry Muslim with a thick accent,\" she said."}]
