[{"comment_id":"543124655889625","commenter_b":"How much more money does she need ??!!!!!!!!??","commenter_a":"Is this really Hillary Clinton? @webpagelink","post_message":"This is truly shocking..."},{"comment_id":"1639738129419643","commenter_b":"@username he hasn't done anything yet. He is the President elect. He won because People are tired of the false unemployment rate Obama is pushing. Tired of the rising cost of Insurance except for people like you who probably get it for free. Tired of the war with radical Islam that he has no strategy for winning. Tired of illegal aliens pushed on us and tired of sanctuary cities and tired of people like Kate Steinle being murdered by them. You certainly can't blame Trump for any of those things. Have a nice day in your la-la land world.","commenter_a":"Actually, Barack Obama is responsible for Trumps win because he has screwed this country so badly and people are sick of his shit and knew that Killary is not only unqualified, dishonest as hell, and a total liar but that she would continue Obamas agenda to destroy our country.","post_message":"Barack Obama said that Russia is responsible for Donald J. Trump's win, but he didn't expect Sean Hannity to knock his lies right back in his face. The democrats just got schooled.  Let's get 2,000 shares to show that America can't wait to get Obama out of office."},{"comment_id":"10154183744199091","commenter_b":"She is a baby killer","commenter_a":"Trump belives in God and life & Americans clinton she is evil she is for aborting a baby in late term open borders allowing evil in our country no I voted Trump.","post_message":"Who do you think will be the next president of the United States? Send us a blue thumbs up for Hillary Clinton or a red heart for Donald J. Trump."},{"comment_id":"10153070666326336","commenter_b":"Kill all the non believers Haider? That's killing innocents!!!","commenter_a":"if anyone believes Iran will not pursue nuclear power they are delusional...they are playing the obama admin the same as every politician before.","post_message":"\"It is necessary that the stance of the U.S. administration be defined about this move.” - Iranian Foreign Minister Javad Zarif"},{"comment_id":"10153035783794877","commenter_b":"hes right yall hoes more worried about her hair then her policies..","commenter_a":"Pretty amazing the priorities of the majority of blacks. Grio post an article about a federal investigation on police, and folks talking about how the Mayor hair and lips... Then we wonder why black folks are look down on.","post_message":"The Baltimore Police Department probably isn't happy with what Mayor Stephanie Rawlings-Blake just asked for. Get the scoop below.  Grio fam, was this the right move? Will it pan out? Sound off..."},{"comment_id":"10153311119075329","commenter_b":"I want to know how many of the women that are saying \"I use soap to clean my vag !\" Are really only using soap on their vulva and are NOT actually sticking soap in their vagina.","commenter_a":"Jonathan Perez hahahzha jk","post_message":"FYI"},{"comment_id":"1227830950637889","commenter_b":"What a idiot, Mexico is NOT going to pay for any wall","commenter_a":"the worst. the absolute worst.","post_message":"With the inauguration only 15 days away, how are you feeling?  Here's what Donald J. Trump says he will do during his first 100 days in office: kiro.tv/TrumpsFirstDays"}]
