[{"comment_id":"10152861396861051","commenter_b":"Shut up","commenter_a":"Sick. Stay with your own race.","post_message":"A police officer came in, handcuffed this teen and dragged him out of school. When they got outside, the teen realized what was happening."},{"comment_id":"10153935292307434","commenter_b":"Shay shut the fuck up","commenter_a":"\"Transgendered\" sooooo 2013. BOOOORRRING No one cares. We get it, you're edgy. Zzzzzzzzz","post_message":"\"Trans women are not only sex objects or prostitutes,\" said Amiyah Scott, explaining her departure from the show."},{"comment_id":"872932106099872","commenter_b":"Immigrants built this country","commenter_a":"Why can't the homeless get benefits? Or a hostel? but when immigrants come over they get everything at there feet!! How about giving the homeless everything they get and let the immigrants sleep in a fking box!!","post_message":"It has a solar panel to power radio, light and phone"},{"comment_id":"1175628809124795","commenter_b":"Geena -_- those jerks","commenter_a":"Leave it to the u.s to ruin this cool idea!","post_message":"Why are people such assholes?!"},{"comment_id":"10154453372292149","commenter_b":"She, Bill are too quiet. Beware: they are coming back.","commenter_a":"Go to Jail........","post_message":""},{"comment_id":"896505850386756","commenter_b":"Hillary is evil. The only people vote for her is either they think she is \"Good\" and/or \"Qualifies for President\" or simply the fact that she is a woman.","commenter_a":"Be carful her crew is monitoring this","post_message":"\"I have to ask, though, if you want cops to turn over camera footage of every single moment of their shifts, why did you turn over only some of your e-mails from your time as secretary of state?   What is the difference?\""},{"comment_id":"10152964297833445","commenter_b":"what we dont want is a bullshit feminist agenda","commenter_a":"oh fuck off dont invade weed with your feminist bullshit","post_message":"Women Aim to Avoid Glass Ceiling in Marijuana Industry Before It Forms.   @webpagelink"}]
