[{"comment_id":"925335920856271","commenter_b":"What has she done is any of her \"jobs\" ??","commenter_a":"let's see.... do nothing, do nothing. who cares.. liar, philanderer, cheat.....","post_message":"Some familiar faces on Roosevelt Island."},{"comment_id":"1195176803855108","commenter_b":"They, Mexicans, would have had more support, and got more support, but the riots have highlighted the burden they are on our nation AND the quality of the people involved. Now more than ever we want them out of here. The illegal aliens are criminals, it is that simple - but not only here illegally, but getting benefits and even legal advantages not given to Americans (like conviction and released to streets). Illegals are getting better benefits than many American's in need, BUT let's just consider one aspect that without any doubt is unacceptable; illegals are getting aid while vets die waiting for help. We must correct this problem. ONLY Trump will start the process. Thanks you Mexican rioters - you have reached a new low of acceptance in OUR nations. You are creating a new population of racists - it isn't hard to hate watching your antics!","commenter_a":"Taxpayers On BOTH Sides -- Aren't you sick and tired of all the destruction and crapola coming from these little punks and thugs, illegals, and paid rioters?? Taxpayers have to PAY for their destruction and mess! These PAID for Rioters should be ARRESTED, given LONGER jail time and VERY HIGH FINES -- also, if on government welfare programs or student benefit programs - they should be TERMINATED Immediately! Also, Make Them Do Community Service - Cleaning up All That They Destroyed. No Punks & Thugs, or George Sorsos Paid for Rioters, Muslim Agitators, or Law Breaking Illegals Are Going to Stop Donald from Making America Safe, Secure and Great Again! No Left Wing Owned, Biased Media will stop Mr. Trump! The more they try to throw the dirt and lies on Mr. Trump - the more I support him and his agenda, which is to make America SAFE, SECURE and ...","post_message":"KEEP WAVING THOSE MEXICANS FLAGS AROUND....    @webpagelink"},{"comment_id":"1079564272093616","commenter_b":"Keep the Government off our backs and away from our wallets President Trump, and put up that Wall, enforce The US Constitution, and Bill Of Rights and that should help Us all to have a Better 2016 !","commenter_a":"Happy New Year Mr. Trump! My son loves the Christmas card you sent him.. God bless you.. We love you! Trump 2016!!!!!!","post_message":"I would like to wish everyone A HAPPY AND HEALTHY NEW YEAR. WE MUST ALL WORK TOGETHER TO, FINALLY, MAKE AMERICA SAFE AGAIN AND GREAT AGAIN!"},{"comment_id":"824943850887973","commenter_b":"What dumb a holes. They can't destroy anyone. The U.S. Would squash them like a bug.","commenter_a":"Someone shoot this idiot......he is the problem.","post_message":"Warns that \"Tehran will set fire to every military base from which a hostile U.S. plane takes off for bombing Iran.\""},{"comment_id":"10153514022490047","commenter_b":"Why couldn't they give birth control wouldn't that been cheaper going have to do better than that","commenter_a":"Except what little they give women for birth control. When I couldn't afford birth control, much less a birth, they were there to help.","post_message":"A senior Planned Parenthood abortionist was caught on camera detailing how they \"crush\" the baby and sell the organs.       Planned Parenthood must be stopped.  SIGN our petition to take action: @webpagelink"},{"comment_id":"10153609114867212","commenter_b":"@username and the other \"haters\", tension in the city? \"Maybe\" criminals and snipers will think twice before shooting someone like the officers, if they know they have fire power back! In Dallas most of those officers only had hand guns to defend theirselves and the innocent people! Their hand guns didn't reach the distance needed! Now, that's TENSION! You think it would be \"tension\" if your Police Officers were equipped properly in your city, but what would you do if this same thing happened in your city like it did in Dallas? Dont ever say it can't! The world is changing, wake up! It shows you do NOT have a son, brother, father, uncle or a good friend out there daily in a police uniform or you would want them protected! Keep hiding your head in the sand and hope one day you, your child, parent or loved one never ...","commenter_a":"They should carry their guns on duty n off back off the cops they save life's no matter what anyone says they have been their when I needed them and I have my blue to show it. Chief is doing what he thinks is right period","post_message":"The American Civil Liberties Union of Oklahoma (ACLU) is speaking out against Oklahoma City Police Chief decision allowing officers to carry personal rifles, saying it is likely to increase tension between the public and law enforcement. #News9"},{"comment_id":"10153813009729497","commenter_b":"Birth order matters: by the third kid he or she can tell through the uterine lining how lame life is going to get","commenter_a":"Most of us are now. Thanks to big business. Bought politicians","post_message":""}]
