[{"comment_id":"10154258976231770","commenter_b":"@username and for the record we did do something about, we went after the people responsible for it! It just took 10 years because these animals lives in caves, and theses lots of caves over there!","commenter_a":"Trump said he will take care of America first and he is he said he will deport Illegal aliens and he is he said he will bring back jobs to America and he is and he said he will build a wall on our southern boarder and he will !!! AMERICA FIRST !!!","post_message":"\"There are lots of constitutional questions that reasonable people can disagree about. Whether the president can exclude foreigners from seven terror-prone countries is not one of them,\" writes Ann Coulter."},{"comment_id":"10157168676140293","commenter_b":"Get off it already. There are bigger issues in our country to deal with such as gun control, racism and all these shootings, immigration, abortion, same sex unions, and the list goes on. Not whether or not she used the same words as our current first lady or not. I don't care if she copied the whole speech word for word as long as he can put our country in better shape than out current president and first lady.","commenter_a":"Not her fault...She just read what they gave her.. Don't blame her...","post_message":"Melania Trump's speech last night at the 2016 Republican National Convention is now the subject of a plagiarism controversy.  READ why some are saying some of her words were lifted from the current First Lady:"},{"comment_id":"1793385047544902","commenter_b":"@webpagelink wrap.com/trumps-law-firm-won-firm-of-the-year-award-in-russia/","commenter_a":"How are we continuing to allow this to happen? How high a mountain of evidence must be built before someone in charge realizes something has to done to prevent his reign from commencing?","post_message":"You literally can't make this up..."},{"comment_id":"10154456762501509","commenter_b":"Why not?!?!.Woman need to protect them selves.At least they got to train some combat skills hehehe...","commenter_a":"Feminism did not make a stride forward in the fight for women's rights. All they did was to send your daughters and granddaughters to potential war. They themselves didn't get anything out of it. They will never see war most likely. I hope they're proud of themselves.","post_message":"Do you agree?"},{"comment_id":"1126887640660229","commenter_b":"If she's black, the barry is white !","commenter_a":"You will always be that lovable little fuzz ball, however you identify yourself!","post_message":"You know, I think I'm going to \"identify\" as skinny.  That way I will not have to ever go on a diet. I'm just gonna identify as skinny.  I just am.  You think I'm not?  Screw you!"},{"comment_id":"729100880559027","commenter_b":"Damn right! Put that bitch in office and watch what \"We the people\" do!","commenter_a":"If Hillary wins, it will be because the electoral college was bought out!! The government has already bought the media and they are lying about the margin between Trump and Hillary---Trump is way ahead. The American people are fed up!","post_message":"“I am winning. I am beating everybody and, in my opinion, beating Hillary is easier than beating [my Republican adversaries],\" GOP front-runner Donald J. Trump said."},{"comment_id":"10153542134849753","commenter_b":"She needs to get away from his crazy abusive ass!","commenter_a":"Lmfao fuck her and he a dick for doing it","post_message":"A man from Harlem, New York has forced his wife to walk down the street naked as a punishment for talking to other men. Jason Melo recorded the incident, hurling insults at her the entire time. The video was uploaded to Youtube, but has since been taken down. However, an edited version that blurs out his Melo’s wife’s naked body has surfaced and shows the humiliating situation unravel. The video has sent outrage across the internet, causing people to wonder how such an embarrassing form of... @webpagelink"}]
