[{"comment_id":"10153819979530950","commenter_b":"Hillary has kept blacks where she thinks they belong. I am sick of her lies! Trump!","commenter_a":"What in the FACK is he talking abt? That an that has embraced white nationalism is calling Hillary a bigot.. Hillary has been to many black churches over the years and has many ppl of color as friends. Trump??? Never mind.. What a buffoon!!! Unfit....","post_message":"“We reject the bigotry of Hillary Clinton, which panders to and talks down to communities of color and sees them only as votes,” Donald J. Trump said."},{"comment_id":"10152621933698067","commenter_b":"You nuts lady!","commenter_a":"Of course it is not free but at least your taxes are going to education instead of wars all the time. I can't believe how many Americans are so brainwashed against a little socialism. You guys at \"the top\" gotta get back to basics. The greed in your country is appalling. We are the lucky ones to still have subsidized healthcare. Taxes should go first to education and not onky spelling and writing, but to teaching life-skills, budgeting, health. 2nd to health including dental health. Tax the crap out of the fat and sugar laden processed foods. Start caring for community and stop supporting the conglomerates. Yay for Obama. The best president since JFK, only mote moral in his private life.","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"966205513390919","commenter_b":"Ms Quintana what a selfish, entitled attitude you have. Who is going to pay to train the temp, who is going to have to take on the extra duty of getting them up to speed, and who is going to pick up the slack while they get adjusted? Someone has to make up for that lost productivity. So the woman makes a decision to have a baby, and everyone around her pays for that decision. How is that fair? And not only that, but she expects to waltz back in a year later like nothing happened! She will most likely have to be retrained, creating yet another burden on top of kicking out the person who has done her job for the past year. Why should that temp have to step aside because queen mommy came back? Shouldn't that be HER job now? Why should she have to step aside ...","commenter_a":"How very \"pro-life\" of them ;). It's no wonder some women need abortions, if you can lose your job or be forced to go on unpaid leave while pregnant, and there's no maternity leave after you have your child... having a child can seriously cause you financial distress to the point of ruin! States need to pick one or the other! You can't be pro-life if you're not going to support a woman who has a child at all.","post_message":"\"I loved my job. I was really hurt.”"},{"comment_id":"507357776079666","commenter_b":"This bitch","commenter_a":"What a whacko...and who says \"keen\" anymore?!","post_message":"Look at me! Look at meeee! I'm better than Hillary!   -Linda"},{"comment_id":"10153624598653132","commenter_b":"Shoot, I'd feel sorry for the plants. She should have to work with people who are just like her. They can take jabs at each other all day. What a bunch of douche bags. And the doc himself needs to get a backbone..you can tell he's only going along with her ridiculous antics.","commenter_a":"How did he still have his cellphone during surgery","post_message":"The patient used his phone to record the instructions the doctor gave him for post-surgery care, but ended up taping the entire procedure - and what he heard shocked him."},{"comment_id":"1214762191878123","commenter_b":"🙈🙈🙈🙈","commenter_a":"Beynimde... 😱😱😱 @username","post_message":"This was living in her brain."},{"comment_id":"10153789765316770","commenter_b":"All for it don't need to spend our hard earn money on racists black bastards that haven't Done anything for our country America ! ! ! But disrespect our American laws our American Flag and our national anthem along with discriminating against white Americans and our American Veterans","commenter_a":"Boycott all nfl games and their sponsors.","post_message":"If they thought their fans would blindly go along with any insult to their country, they were sorely mistaken..."}]
