[{"comment_id":"10153187015096051","commenter_b":"Carolyn, have some respect. He is our President after all. President Obama has made America great. We don't need Trump to mess it up.","commenter_a":"Agree. Obama is a joke and think the world knows it. He's like a bad kid. Just had to say something because he's mad. And the rest....thought he was talking about himself. The US does deserve better than him","post_message":"President Obama had some harsh words for Donald Trump today."},{"comment_id":"10154934744787403","commenter_b":"@username sorry to disappoint but I'm all for Trump kicking all you Mexicans out of the country 😂😂😂😂😂","commenter_a":"Hypocrite","post_message":"BREAKING NEWS: President Donald Trump plans to suspend visas to seven Muslim-majority countries, draft order shows."},{"comment_id":"1271695059532579","commenter_b":"she is so miserable with herself she just lashes out at everyone such a poor excuse for a female","commenter_a":"Rosie is not well! Needs Mental Health help!","post_message":"Rosie is disgusting!"},{"comment_id":"963331227036554","commenter_b":"So could Samsung actually be catching up?","commenter_a":"Eh...not really impressed enough to upgrade from the 6. I'll wait till the 7!","post_message":"Our first look at Apple's new iPhones:"},{"comment_id":"1166954960025334","commenter_b":"You are so right. All this is her own doing.","commenter_a":"Why didn't Hillary say, I have heard the question? Shows character of Hillary.","post_message":"CNN FIRES BLACK DEM Party Chair: New Wikileaks Email Exposes SECOND Question Donna Brazile Gave To Crooked Hillary In Advance Of Debate"},{"comment_id":"952596034775492","commenter_b":"@username Shooter FU! You are a whinny little bitch.","commenter_a":"lol we are fucking idiots, we believe in make believe deities, we salute the flag of the sickest country in the history of existence, we salute brainwashed troops who murder innocent people behind imaginary lines, welcome to brain dead Georgia lol","post_message":"If you don't love the nationalistic rhetoric of the state, LEAVE! Police The Police | The Free Thought Project.com"},{"comment_id":"10153806132721051","commenter_b":"@username How is going to all those with the wars he's going to start increasing taxes on the middle income and lowering it on the rich. Building a wall where's that money coming from? not Mexico. Putting a 35% tariff on goods from China. Good move Trump and the China and other countries do the same to us. How about that lost American jobs?. You don't think Mexico buys from us? What about machinery, minerals, autos, trucks and military equipment anf farming equipment.","commenter_a":"Interestingly Trump praised all of Obama's policies. Now he says he's done a terrible job. He praised Hillary's job performance as Senator and Secretary of State and endorsed her for POTUS, now he calls her incompetent. Hmm. Should we really elect someone with such horrible judgement?","post_message":"In an interview today, Donald Trump said President Obama has done a \"terrible job\" in office and has allowed countries to take advantage of America. Is he right?"}]
