[{"comment_id":"966205513390919","commenter_b":"Ms Quintana what a selfish, entitled attitude you have. Who is going to pay to train the temp, who is going to have to take on the extra duty of getting them up to speed, and who is going to pick up the slack while they get adjusted? Someone has to make up for that lost productivity. So the woman makes a decision to have a baby, and everyone around her pays for that decision. How is that fair? And not only that, but she expects to waltz back in a year later like nothing happened! She will most likely have to be retrained, creating yet another burden on top of kicking out the person who has done her job for the past year. Why should that temp have to step aside because queen mommy came back? Shouldn't that be HER job now? Why should she have to step aside ...","commenter_a":"How very \"pro-life\" of them ;). It's no wonder some women need abortions, if you can lose your job or be forced to go on unpaid leave while pregnant, and there's no maternity leave after you have your child... having a child can seriously cause you financial distress to the point of ruin! States need to pick one or the other! You can't be pro-life if you're not going to support a woman who has a child at all.","post_message":"\"I loved my job. I was really hurt.”"},{"comment_id":"10153362119139087","commenter_b":"IF I WERE A JEW ,,,, i would not want this broad on my side shes a idiot !!!!!","commenter_a":"Oh, please nitwit.","post_message":"“Our country turned [900 Jewish refugees fleeing Germany] away, and many who were sent back to mainland Europe were killed in the Holocaust,” said Democratic National Committee Chairwoman Rep. Debbie Wasserman Schultz. “Instead of learning from that mistake, Republican candidates and politicians were eager to repeat it.”"},{"comment_id":"1012231985511331","commenter_b":"She has NO BRAIN CELLS!!!!!","commenter_a":"Nuts for sure","post_message":"Americas Freedom Fighters"},{"comment_id":"10157991607240354","commenter_b":"Get them out of our country!!!","commenter_a":"Can't wait to have Trump in the White House soon enough. Obama and Hillary both want to stuff America with these sexual Islamic deviants in thousands. #SaveAmerica #VoteTrump","post_message":"Had they not been allowed in the country, it never would have happened."},{"comment_id":"10153533392786337","commenter_b":"You wish you were a woman","commenter_a":"Bruce Jenner has 0 murders. Caitlin has 1","post_message":"MUST SEE MOMENT: Caitlyn Jenner gave a graceful speech while accepting ther Arthur Ashe Courage Award at the ESPY awards..."},{"comment_id":"10154559728153812","commenter_b":"@username He has lead our country in more debt than any other presidents He doesn't give social security costs of living raise in 3 years He's letting illegals into our country without being vetted He's trying to take guns away","commenter_a":"You Americans, I can't believe how you can produce great leaders like Obama and then still show up with Trump for the next elections.","post_message":"Donald J. Trump on #Dallas: \"This isn't the American Dream we all want for our children.\" abcn.ws/29mnwVr"},{"comment_id":"1285821781534200","commenter_b":"nasty reptilian","commenter_a":"Well i think there is no more people to die,there was only one left so G Michael was that,the question is why they need people to die?","post_message":"I think she was right"}]
