[{"comment_id":"10152610219894071","commenter_b":"Gabriel Emilio","commenter_a":"Bates PAPA Creighton","post_message":"They're killing it right now."},{"comment_id":"10153864977558812","commenter_b":"I hate Bigots smfh","commenter_a":"As a Muslim we have a problem in this country, It's called Donald J. Trump !","post_message":"Mike Huckabee: \"Donald Trump would be a better president every day of the week and twice on Sunday rather than Hillary Clinton.\""},{"comment_id":"1536355363064383","commenter_b":"I can go tomorrow bitch","commenter_a":"Uriel Campos explains it all","post_message":"\"I don't think I've ever been without sex for as long as I have now.\""},{"comment_id":"1859800897573502","commenter_b":"His daughters are no exception .","commenter_a":"50/50 sounds fair","post_message":"Would he let his daughters be drafted?"},{"comment_id":"942501505798873","commenter_b":"just burn the lying btch","commenter_a":"She needs to be in prison for the next 30 years or longer.","post_message":"Good grief, Hillary Clinton..."},{"comment_id":"736942216449300","commenter_b":"The most logical way to deal with the Real ID Act is to stop rewarding illegal activities. The people that make it possible for illegals to get driver's license are the same people who refuse to correct the laws that allow career criminals to run the streets killing cops and our children.","commenter_a":"How about we stop issuing drivers licenses to people that have broken the law and are here illegally? Blaming the current governor for this is absolute stupidity. Blame Richardson and the democrats in Santa Fe, this is all on them!","post_message":"The most logical way to comply with the REAL ID law is for the Governor to agree to a bipartisan plan for a two-tier driver’s license in New Mexico. Republicans and Democrats in the state Senate crafted a compromise last session that would have resolved this issue. The Governor should agree to that compromise. This will address concerns about public safety, meet the requirements of the REAL ID law, and assure that New Mexicans can continue to access federal facilities and airports. @webpagelink"},{"comment_id":"10153577547513352","commenter_b":"Amber shut your ass up looking like momma June. Fat ass","commenter_a":"This sight sucks","post_message":"In sickness and in health: Soldier marries fiancée despite brain injury that left her unable to recognise him just days before their wedding… and then spent five years teaching her to walk, eat and speak again"}]
