[{"comment_id":"1216674918389035","commenter_b":"Vote Hillary","commenter_a":"Vote Hillary","post_message":"“En mis primeros 100 días, voy a introducir legislación para una reforma migratoria integral con camino a la ciudadanía. Esto no solo es lo correcto sino que cada análisis independiente ha demostrado que añadiría cientos de miles de millones de dólares a nuestra economía. Mantendría también a las familias juntas. Tenemos que sacar a las personas trabajadoras fuera de las sombras. Estados Unidos siempre ha sido un lugar donde personas de alrededor del mundo trabajan duro y aplican sus talentos al crecimiento e innovación del país en la búsqueda de sus sueños. Así que haremos todo lo posible para lograrlo” —Hillary."},{"comment_id":"10154242244603635","commenter_b":"\"I agree you can still do all those things.\" So then you were making things up before. Glad we got that straightened out. \"I've known of kids getting suspend from school for praying before they ate lunch\" If that actually happened, the school involved broke the law. \"Employees were not allowed to say Merry Christmas it was happy holidays. She told me that.\" Right, because saying \"happy holidays\" is more inclusive. Of course, while not on the job, she was completely allowed to say \"Merry Christmas\" to her heart's content. \"There has been a huge change in this country for the last 25 years of Christianity being slowly phased out by our government.\" Not really. Christianity has never been part of our government, since it's not supposed to be. The first amendment makes that clear.","commenter_a":"I guess this is another step on kicking God out of this country.","post_message":"Indiana city renames Good Friday \"Spring Holiday\" to be more inclusive"},{"comment_id":"10153123685718690","commenter_b":"Exactly , he got 72 Virgin girls.","commenter_a":"So jihad was killing none believers and was killed? so he died a hero?","post_message":"The mood was sombre as mourners gathered in Beirut southern suburbs to pay their respects to Jihad Mughniyeh, one of the six Hezbollah fighters killed in an alleged Israeli air strike in Syria. @webpagelink"},{"comment_id":"10153520477923132","commenter_b":"Those freaks should have never been on TV anyway!!","commenter_a":"Yep thy absolutely should. Should never have a show on the air that advocates bigotry and hatred while showing women as animals for breeding purposes that are be owned. Also the show advocates for having more children than you can afford (unless you have a reality show to pay the bills) and more kids than you can physically and emotionally take care of.","post_message":"Do you think TLC should cancel 19 Kids and Counting?"},{"comment_id":"10154036323171337","commenter_b":"Rat face versus Moron","commenter_a":"Fuck Kanye. He's the biggest skank that ever was.","post_message":"WHOA! Did Taylor Swift just drop a whole lot of shade on Kanye West??"},{"comment_id":"1183208918440780","commenter_b":"Stupid women. I'm one but Savannah is a regular person, comfortable in who she is. Why must she have makeup on after just having a baby. I'm not going to criticize her for that. Some people just don't know where their nose ends. Leave peoples' business alone. Who are you to make it your business?","commenter_a":"Seriously? People care whether or not she's wearing makeup? Giving birth is one of God's greatest gifts and I doubt He - nor Savannah's precious baby- cares about her beauty routine.","post_message":"\"We don't need any 'tips' on how to look good without makeup. We all look good without makeup. We just don't realize it until we realize what life is truly about.\""},{"comment_id":"1656175608015779","commenter_b":"You go girl get the pig rapist","commenter_a":"Another one 😂","post_message":"WATCH LIVE: Donald J. Trump to face lawsuit from woman alleging sexual misconduct."}]
