[{"comment_id":"10153500482753598","commenter_b":"nothing that comes out of this woman's mouth is ever true!!!!!","commenter_a":"She is an idiot..","post_message":"Hillary Clinton Claims “All of Us Want to Fund Planned Parenthood”"},{"comment_id":"482704838584476","commenter_b":"Yea just can't fix stupid... While Obama tries to shove his deal down Americas throat - Iran is laughing at us, buying weapons and building bombs - Better war with them today than tomorrow - Iran has no purpose, no value - Just make it a dust bowl.","commenter_a":"Nuke China & Iran!","post_message":"So, please Obama explain us, how this deal prevent war?"},{"comment_id":"10154040549579411","commenter_b":"YOU STUPID WOMAN! Read some history first...","commenter_a":"Muslims ruled India from 7th century till 1856. All Indian heritage is created by Muslims rulers they civilized curry mouncher but still not enough... In entire Muslim India history you cannot find Hindu execution or forced convert to Islam..... Same 700 years Muslim rule on Spain... No force to converte to Islam.. No execution.","post_message":"5 assailants arrested, including a barber"},{"comment_id":"1525627194121061","commenter_b":"no one wants californians","commenter_a":"Why, Canadian provinces are constantly talking about seceding from Canada.","post_message":"Canadians are inviting Washington, Oregon, and California to secede and join Canada."},{"comment_id":"10153877851737217","commenter_b":"A girl has no name","commenter_a":"Don't you mean 'so called' Abu Mohammad al-Adnani. If you are going to pre fix names with 'so called' you might as well be consistent. Silly 'so called' BBC Lol","post_message":"Spokesman for so-called Islamic State Abu Mohammad al-Adnani has been killed in Syria, IS-affiliated media has said."},{"comment_id":"1796841757230844","commenter_b":"well how disgusting women walking around half naked in front of men!!","commenter_a":"More made up BS","post_message":"Former Miss Arizona Tasha Dixon says Donald J. Trump walked into a dress rehearsal for the 2001 Miss USA pageant while the contestants were \"half-naked\" and that women were told to \"fawn all over him.\" The Trump camp says the accusations \"have no merit.\""},{"comment_id":"1050901851597824","commenter_b":"It wont be single payer with this Congress. Thank God the sane people control Congress. Liberalism is a mental disorder.","commenter_a":"Wrong. The ACA was intended to fail. This will be replaced by single-payer, all Medicare/Medicaid type system.","post_message":"Obamacare was supposed to fix the problems created in the healthcare system by pre-Obamacare government meddling. I wonder why it didn't work? Be warned - an Obamacare bailout (mostly for the insurance companies) could be on the way."}]
