[{"comment_id":"1728134044133544","commenter_b":"Screw off with trump both candidates suck","commenter_a":"IM STAYING AROUND TO SEE HOW BAD IT IS HAHA","post_message":"This was a 'Behind the scenes TV Production Meeting'.  The really good part to me comes about half way through where we begin to discuss show on future tech and AI."},{"comment_id":"10153622998001323","commenter_b":"Don't give the bastard any ideas !","commenter_a":"This is why there are so few Tory comedians, they're about as funny as a burning orphanage.","post_message":"Barmpot."},{"comment_id":"1255092294541839","commenter_b":"He could be doing Mexico a favour by building this wall. Just think of how many tourists will flock to see this Great Wall of Mexico. Just like in China with their wall it could be worth millions of dollars every year to the Mexican economy. Also if he thinks that building this wall will stop people crossing the border into America every year from Mexico he's deluded what's he gonna do build it sky high to stop them coming in by air or build it around the coast to stop them coming in by sea and check every single shipping container coming into the country to make sure they aren't hiding inside or close off the border with Canada to make sure they haven't flown north first and are then coming in from the North. Get real people. This guy is deluded and the people who believe him are ...","commenter_a":"WTF !!!","post_message":"'We will build a great wall along the southern border,' Donald J. Trump told a crowd in Phoenix, Arizona, during his immigration speech. After a long pause, he continued: 'And Mexico will pay for the wall.' @webpagelink"},{"comment_id":"1310250435687007","commenter_b":"'@username listen bitch you better do your research the final votes were counted today he won popular vote by 699k","commenter_a":"Wow ! Get over it ! Trump won the electoral and popular vote as of today ! If Hillary hadn't been so crooked lies and selling America out to the highest bidder she might have won, but she was caught in way to many back room deals and bad things she should be in prison for treason ! Shame on SNL. To even praise her when the people have spoken !","post_message":"Wow, SNL dropped the comedy and got real."},{"comment_id":"10155394034488352","commenter_b":"I used to work as cashier and I witnessed a couple of white people trying to pay for others people groceries so they will get the cash . They will go around asking Hispanics mostly Mexicans to pay for their groceries so the Mexicans could give the cash to them??? Yup cheating the damn system , of course we wouldn't do it for them . This bitch came to me one time and Infront of me she offered to pay this Mexican ladys stuff and I said to the Mexican lady don't do it , she's asking to do something illegal . The bitch was like why you telling her that ,I was like look I can take your name right now , you are on camera and I have this lady as witnessed. I can contact social services right now and tell them what you doing .... You will ...","commenter_a":"If you gave them citizenship most would turn it down. These people don't want that. Then they would have to pay taxes. I work with mexicans and and other immigrants. The legal ones I work with didn't like the illegals on Fridays cause they brought home more. If yaw people want all these immigrants here so bad take them into your homes. Our country can't handle anymore forms of welfare.","post_message":"It's open season on illegal immigrants: Trump declares that ANYONE in the US illegally can be deported, regardless of whether they've committed a crime"},{"comment_id":"1569576153350573","commenter_b":"Oh, and your fat head out of women's uterine issues!","commenter_a":"The goverment has no right to interfere in a very personal decision, hard enough without some men thinking they can decide for us.","post_message":"Don't doubt him for a second..."},{"comment_id":"10153442091264877","commenter_b":"That's right, Westley :) * waits for the obligatory hoteper insult about evil black feminists*","commenter_a":"This song is not about Black women. At best, the song attempts to denounce negative stereotypes of Black men. I appreciate the effort, but he has a lot more work to do.","post_message":"David Banner Shows Support for Black Women in New Song 'Marry Me.' It's the rapper like you've never heard him before. Listen to the audio below.   Grio fam, what do you think of Banner's tribute? Sound off!"}]
