[{"comment_id":"10152859683207434","commenter_b":"@username is a pathetic cesspool. Pandering feminist Cosmo garbage","commenter_a":"Lenny Kravitz’s dick fell out on stage. Look at it dangling. Kravitz was performing at a show in Stockholm on Monday when his (perhaps cock-ringed) penis came tumbling out. Just as the rocker was getting low to the flo’, the D broke out from its restrictive leather pant cage and gave the world a show.Note how the tongue and the penis simultaneously present themselves during this tragic wardrobe malfunction. Is it a beautiful thing? Who knew.","post_message":"Note how the tongue and the penis simultaneously present themselves during this tragic wardrobe malfunction."},{"comment_id":"10152594766464071","commenter_b":"Why do men think big boobs mean fat?","commenter_a":"Don't be fat. Problem solved.","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"10154363998161756","commenter_b":"You're right @username, it's easier to lie to the people and then change nothing. #sheisworthless","commenter_a":"The mainstream media - and @username is that - has done the work of the status quo establishment and convinced the American people that nothing can be done anymore because it's too hard and too complicated. Anything is possible, but it will take the will of the people to continue the political revolution. Change is coming, but it will be a long struggle. A hard fight against the establishment. Bernie or bust. Don't ever give up.","post_message":"The effort ultimately would rely on Sanders getting stalwart backers of his plan into key positions, followed by a difficult, drawn-out fight with the powerful industry."},{"comment_id":"1006273402742336","commenter_b":"You kiss your mother with that mouth?","commenter_a":"How funny, lot of idiots on here don't realize that bin laden in the white house tremendously cut funding to nasa a while back.... This is probably giving back what he took...... Lib and Bernie voters aren't expected to","post_message":"That even more than Barack Obama asked for."},{"comment_id":"10154034711816770","commenter_b":"You know damn well its the ladies who wizz all over the seat when they do their \"hover\"","commenter_a":"Tired of people thinking they can change the law because they are a part of a small percent of people married to same sex. It's bad enough we have men in a dress pissing all over the toilets in the ladies room.. Being gay shouldn't give you special entitlement.","post_message":"The Supreme Court of Arkansas ruled late this week that LGBT persons who are married to a child’s birth parent but not biologically related to the child do not have a constitutional right to be listed on the child’s birth certificate."},{"comment_id":"10152848525036749","commenter_b":"Happy bday!!!","commenter_a":"Happy Bday!!!","post_message":"Happy birthday to an amazing, inspiring First Lady."},{"comment_id":"1012561098824705","commenter_b":"The fact that this slut could possibly be our First Lady is a very important issue to me,","commenter_a":"Really people, this is what you talk about when there are real issues affecting people in the US. Shame on you. Is this what we have become as a nation?","post_message":"Conservative hypocrisy knows no bounds."}]
