[{"comment_id":"10154212889868822","commenter_b":"2 fecking idiots!!! That is all I have to say!","commenter_a":"Just look how dangerous Pittsburgh has become in itself!! There are murders every single day and crime is most def on the rise!! Jobs are scarce unless you want to work part time in fast food or at a gas station","post_message":"Boston Mayor Marty Walsh joined Pittsburgh Mayor Bill Peduto for breakfast before hitting the campaign trail to drum up support for Hillary Clinton ."},{"comment_id":"10153156333212093","commenter_b":"Agree @username, I appreciate your candor.","commenter_a":"I would have to say too bad. There are reasons why adoption laws are written the way they are. Just because various individuals attempted to circumvent the prior marriage laws to gain legal status instead of going about the legal routes and legal boundaries others have until the recent decision on same sex unions, is not a good enough reason to change the laws surrounding adoption and the laws against adoptive parents becoming involved with adopted children. Do they think they are the only \"couple\" who have this issue. There are countless stories of parents who adopted a child, got divorced, and one of the \"parents\" wanting to change the legal definition of the legal parent-child relationship. How about you made your bed when you tried to circumvent the laws to get around state and federal laws regarding things like insurance eligibility, income tax deductions, ect., just because there are ...","post_message":"Roland and Nino want to get married now that same-sex marriage has been legalized. The only catch is that they are already legally father and adopted son... @webpagelink"},{"comment_id":"972410229461065","commenter_b":"It doesn't seem to matter, does it?...she's slicker than Willy!","commenter_a":"Oh stop it","post_message":"Arrest her, TODAY!"},{"comment_id":"10152841074616051","commenter_b":"I am woman...hear me roar!!!","commenter_a":"Love my Hillary!!!","post_message":"A judge said that Hillary Clinton’s e-mail violations are punishable by jail time."},{"comment_id":"10154664462516337","commenter_b":"Blaming a group of people before you even know the full story = ignorance","commenter_a":"Please bring more Syrian refugees to this country","post_message":"Explosions and IED discoveries continue to rock the northeast."},{"comment_id":"539636529560260","commenter_b":"She should be in jail","commenter_a":"NO FU*K YOU liberal artist Abby Martin !","post_message":"Liberal artist slams Chris Kyle with this t-shirt, but that's not even the worst part. This is awful. He was a true patriot who protected our country. Let's show his family our support. Can we get 20,000 'LIKES' for Chris Kyle?"},{"comment_id":"10154246558899575","commenter_b":"I think she should have been charged with negligent homicide. She caused the child's death.","commenter_a":"Agree.","post_message":"The mother of a 2-year-old boy who fatally shot himself last month has been charged with neglect. Police say the child found the gun in her purse."}]
