[{"comment_id":"10152965357956336","commenter_b":"Lets face it, the ppl this upsets the most are the females that could never pull it off.","commenter_a":"I think all you who say it's too far are the same ones waiting for fifty shades of grey.","post_message":"Did Sports Illustrated Swimsuit go too far this year?"},{"comment_id":"10154308942676336","commenter_b":"Build the wall screw the Mexicans","commenter_a":"no need to .. i mean their ignorant puppet master says it all the time :P","post_message":"The student said he wanted to do something \"provocative\" to protest restrictions on freedom of speech and didn't realize until later that the phrase held such a strong, threatening connotation."},{"comment_id":"1616469018618909","commenter_b":"Trending: Obama's Fault Racism Gun Violence Marines holding umbrellas Climate change (that is simultaneously not real) ISIS Al Queda Hot days Cold days Rainy days The economy Abortion rate Teen pregnancy rate Hurricanes Tsunamis Butterflies that flap their wings and cause Tsunamis Terror attacks in Paris Russia attacking Ukraine North Korea hating everyone Syrian Refugees Illegal Immigration Muslims Christians hating Muslims Cops \"fearing for their lives\" #BlackLivesMatter Fox News hatred The wealthy 1% Everyone else Fantastic Four being a horrible movie _________ Fill in the blank.","commenter_a":"I don't see how you blame our first African American president for racists coming out of the wood work.","post_message":"Barack Obama is seen as one of America's most racially polarizing presidents, numerous polls show. So will tensions ease once his term ends? #RaceAndReality"},{"comment_id":"447409202129260","commenter_b":"She is the best candidate!","commenter_a":"Dear God deliver us from this evil!","post_message":"Slap Yo'self! www.eaglerising.com"},{"comment_id":"10155981845940354","commenter_b":"Trump is a media whore. Anyone dumb enough to support him might as well give your vote to Hillary because that is what you asshats are doing NOTHING in Trump's history suggests he is a real conservative. He is just repeating what we say and making republicans look like clowns. His close friend Oprah Winfrey, the person who did more to get Obama elected than anyone else and endorsed by Trump to be vp is ecstatic.","commenter_a":"Hes right pc has got to go. I heard him this morning, if cnn would have allowed him to finish his sentence, he was referring to nose mouth obviously. Typical, cut them off and use it for a soundbite.","post_message":"\"I’ve had lots of men imply that I was unfit for decision-making because maybe I was having my period…\""},{"comment_id":"10154713029439411","commenter_b":"Good on her. If only she had a shot gun or military rifle she may have got the others too.","commenter_a":"Looks good on him and them. These three losers garner no sympathy from me. Karma has been served.","post_message":"They picked the wrong house"},{"comment_id":"1016888675050426","commenter_b":"Go Trump!","commenter_a":"God Bless you, Mr Trump, we've needed someone like you for a very long time, someone e who really cares about the a","post_message":"WOW! Thank you, America! LETS GO - it is Super Tuesday -- get out & VOTE TRUMP!"}]
