[{"comment_id":"10153148530580329","commenter_b":"It's not a fuckbuddy it's a weak ass pussy who ain't bout shit","commenter_a":"What is a f*ckboy? I must be getting old...","post_message":""},{"comment_id":"1038233369545417","commenter_b":"Can't stand her!","commenter_a":"I stop to watch her program Always bashing on the same person all the time ! I did think that during the first debate the question was legitimated after all he has to respond because the question was going to be asked from her or somebody else But after all the bashing my trust in what they call fair and balance news under her reports was gone and I was certain that She did have an agenda by starting by this type of question Also what is making me mad is all the spin around her the queen She giggles all the time even when her guests are vulgar in her program It made me laugh when I ear that she is a respectable journalist and fox stands for her Did they listen when she was giggling from her heart when somebody said that during one of the debate \" ...","post_message":"Megyn Kelly didn't hold back! (WATCH)"},{"comment_id":"10152912093186749","commenter_b":"PUKE.","commenter_a":"PUKE","post_message":"This Valentine's Day, Nicholas and Dylan are finally able to celebrate their legal marriage. This is progress. @webpagelink"},{"comment_id":"1241639679186713","commenter_b":"What A Dumb Bastard !","commenter_a":"Without Freedom of and from Religion America is not a Free Country! Separation of Church and State! #VOTE The Republican #PARTYOFHATE out of local state and Federal Government #ENOUGH #VOTE #GUNSENSE #VOTE #Hillary2016","post_message":""},{"comment_id":"10153348075419255","commenter_b":"who would want texass anyway","commenter_a":"I laugh every time I see these two big wusses trying to play badass.","post_message":"Idiots."},{"comment_id":"10152984633716770","commenter_b":"ENJOY ALL YOUR WELFARE BENEFITS BECAUSE THEY WON'T BE THERE FOREVER! WAKE-UP AMERICA! WE BETTER GET OUR VOTES RIGHT THIS TIME OR WE COULD SEE ISIS TERRORISTS UNLOADING IN OUR DRIVEWAYS! LET'S ALL HELP TRUMP MAKE AMERICA GREAT AGAIN! TRUMP ALL THE WAY!","commenter_a":"Can Trump ever stop with all the \"self praise\" while belittling and insulting everyone else......well except for those Democrats who are running? Since he was a liberal long before his sudden transformation to the GOP, I gotta wonder what side he's really on. Don't trust him one bit.","post_message":"Donald J. Trump believes the moment an Iraqi reporter thew a shoe at George W. Bush and Bush didn't blink \"may have been his best moment if you want to know the truth, that is very sad to say.\""},{"comment_id":"870676293063413","commenter_b":"She can leave anyway. Useless","commenter_a":"Well,bye","post_message":""}]
