[{"comment_id":"780568308754036","commenter_b":"She is a pig!","commenter_a":"Loved it you will not see another first lady as classy and beautiful as Michelle Obama for a while. She is gorgeous!","post_message":"What did you think of the First Lady's sunny State of the Union dress?"},{"comment_id":"10153170015287690","commenter_b":"Eeewww No girl!!! Hate Snakes","commenter_a":"Margaret thought of your pet at Millies.","post_message":"\"If one got in the house or in the cars, I would have to move.\" One North Texas family fights hundreds of copperheads on their property: @webpagelink"},{"comment_id":"10154007566964091","commenter_b":"Sick women..","commenter_a":"Something is really wrong with this world.","post_message":"The mom claims she and her daughter \"hit it off.\" She lost custody of her children when they were young, and had only recently reconnected with her."},{"comment_id":"10153434193979138","commenter_b":"Time to ban women..","commenter_a":"Women are crazy!","post_message":"DEVELOPING- A St. Paul woman has been taken into custody after her boyfriend was stabbed to death this morning"},{"comment_id":"10152650775565496","commenter_b":"Agreed. They gave that lady not one, but TWO! black eyes. They liked to beat her brains in.","commenter_a":"Why are they out on bond? If I were the D.A. I would be pushing for attempted murder charges.","post_message":"The trio of woman accused in a brutal beating over a squished hamburger were scheduled for court this morning. UPDATE on the case: @webpagelink"},{"comment_id":"10152952082057452","commenter_b":"Shes beautiful","commenter_a":"So precious!","post_message":"This video of a baby seeing her parents’ faces for the first time after getting glasses will melt your heart: @webpagelink"},{"comment_id":"10153229424353352","commenter_b":"What a crock of shit. She's a crazy bitch who needs life in prison.","commenter_a":"Postpartum depression is a real illness. This women obviously is in psychosis; not recognizing her action at the time. Praying for these babies, her husband and her. When she is in her right mind; she will have to live with this action for the rest of her life. Also, if her husband and doctors were aware of her illness; they should also be accountable. A women this sick should never be unattended with her children. I pray for these babies health.","post_message":"Army wife says she slashed throats of her three crying babies with kitchen knife to keep them from disturbing her Special Forces husband"}]
