[{"comment_id":"10153952900813984","commenter_b":"She should Benin jail!","commenter_a":"How many of those radical Islamic terrorist countries donated to the Hillary fund. She knows they did.","post_message":"Hillary thought she'd jump on the opportunity to steal some attention from the Republicans during the debate, but it did NOT go as planned. Critics immediately fired back and pointed out something hilarious... Is Hillary Clinton one of the last people you would ever want to become president?"},{"comment_id":"10157375449970354","commenter_b":"Fuck off you little bitch!","commenter_a":"Its ok. Nobody was listening.","post_message":"Isn't that so thoughtful of Leftists who deride religion to lecture Christians on their faith?"},{"comment_id":"1056321337718549","commenter_b":"Racist bitch!!","commenter_a":"republicans say they are not scientists. Then they should keep their mouths shut about science.","post_message":""},{"comment_id":"1115407108512795","commenter_b":"Jay Z is trash just like his skank wife!","commenter_a":"Can't stand Jay-Z, or his mop! Sad she has to pull the hypocrite card but in office she never did anything that's credible anyway!","post_message":"“He used every word in the book. Can you imagine if I said that?” asked Donald J. Trump."},{"comment_id":"10153342829529170","commenter_b":"Then STOP Them, enough already!!!","commenter_a":"homegrown terrorist and a president that wants Americans Disarmed.......YEA, THAT'LL WORK!","post_message":"If you're a liberal claiming ISIS doesn't exist inside the US, Barack Obama's own FBI Director has a message for you...."},{"comment_id":"10154917565918690","commenter_b":"how about stop raping women and build some toilets?","commenter_a":"Great job ....we feel proud of our national anthem..haters ...f****k offf","post_message":"\"The time has come, the citizens of the country realise that they live in a nation and are duty bound to show respect to the national anthem. @webpagelink"},{"comment_id":"598083523681641","commenter_b":"She really shouldn't enter into a battle of wits unarmed!!","commenter_a":"Right... because Mechanical Engineering has nothing to do with science..... *rolls eyes*","post_message":"-_-"}]
