[{"comment_id":"10153472333633352","commenter_b":"So how do you teach your girls how to be in a stable relationship?","commenter_a":"I have 3 daughters & until they grow up, no man will harm them under my roof. I sacrifice my dating a man or finding a love, so they can always feel safe. I won't allow a man to enter my life until my task is finished!","post_message":"Woman Murdered by Boyfriend After She Allegedly Asks Him If He Assaulted Her Daughter in a Sexual Manner – Daughter Also Murdered, Then Man Takes Own Life."},{"comment_id":"10153936646970329","commenter_b":"The American government steals from us and treat its American citizens like crap.","commenter_a":"Everyone's shit scared of the Americans cause they lie, are arrogant, have big weapons, invade any country and are religion obsessed. Same as Islam extremists. The thing they say they hate.","post_message":"Including some disturbing news for America..."},{"comment_id":"1253938284627180","commenter_b":"Your mom's a joke","commenter_a":"Because vag isn't gonna pound itself........","post_message":"From an evolutionary perspective, men are a really bad idea. So why do they exist?"},{"comment_id":"10155044912398010","commenter_b":"Trump doesn't want any more tunnels, after he builds his wall.","commenter_a":"Maybe it is true? Trump appointed him to head the DEA and he is going to pay for the wall??","post_message":"The Sinaloa cartel boss was recaptured a year ago after his second jailbreak."},{"comment_id":"369489863429570","commenter_b":"Ship her out ban her from AMERICA","commenter_a":"I agree she should be arrested","post_message":"President Trump says Madonna is 'disgusting' and a 'disgrace' to America because she said she wanted to blow up the White House. Agree or disagree?"},{"comment_id":"10158409138265725","commenter_b":"Now we know why she's bitter and single","commenter_a":"I can't believe she told that woman that her husband was cheating on her!!!! For her to go home","post_message":"Re-watch the video that started it all: @webpagelink"},{"comment_id":"10153332297102061","commenter_b":"What's racist about putting Americans protection FIRST from illegal alien Mexican criminals and potentially ISIS infiltrated refugees?","commenter_a":"Trump is a racist piece of trash. He needs to just step down and hide for a few years","post_message":"TOP STORY: Trump rally draws hundreds of protesters in Bernie Sanders' home state of Vermont: abcn.ws/1JxW5UZ -- see more on GMA..."}]
