[{"comment_id":"1121910377840173","commenter_b":"CAN NOT STAND HER TRUMP2016","commenter_a":"watching the debate now can't sand Carley","post_message":"It's not too late! Get your Make America Great Again hat today and join the movement to take America back from the all talk no action politicians!"},{"comment_id":"481193578737889","commenter_b":"After the shit she did she should be quiet people that live in glass houses should not through stones!!!!!","commenter_a":"A great concept and certainly worth attempting. We pray for success and abolishing obamas illegal actions.","post_message":"Sarah Palin is starting a revolution... and Obama's first to go. She's leading the 50 states and we’re right behind her. Do you support Sarah Palin?"},{"comment_id":"1271975762826442","commenter_b":"You guys are so right & prosperous blacks had their own black slaves too. Our troublemaker-in-chief is keeping this going, stirring up strife so he can cry Marshal Law & keep his seat in our White House. We're in big trouble folks but most people don't even know that. Keepin' on puter & cell phone games, partying, gettin' high & working 2 jobs just to keep the bills paid. The average person has no time to protest & make trouble but we have the government paying people to not work so THEY have lots of time. It's how barry wants it to be.","commenter_a":"Loretta, Sadly, you're an intricate part of the problem. Just another old racist white person that cannot and/or will not recognize the murder of our young Black men by white racist police officers. Your kind will always find an excuse to somehow blame the victim...the evidence be Damn!","post_message":""},{"comment_id":"10153824144307235","commenter_b":"These Kurdish Women have more Balls than these Idiots...","commenter_a":"Give dad and son some boots and send them to iraq","post_message":"The photo was rejected because school officials believe “it promotes violence and breaks federal and state law.”"},{"comment_id":"10153538645367232","commenter_b":"Yous are CRAZY, certainly it HAD to ALWAYS be a GHETTO, NO one would ruin a neighborhood ;)","commenter_a":"What Camden used to look like before the take over.","post_message":"Females attack woman with pole on South Jersey street in broad daylight and it was caught on camera: WATCH THE VIDEO => @webpagelink"},{"comment_id":"10153747063291336","commenter_b":"I agree with him we don't need any more illegal Mexicans in the US","commenter_a":"Even dead Trump is making money! Trump 2016!","post_message":"A former NYPD commissioner is warning Donald J. Trump to not take the purported threat lightly."},{"comment_id":"10153194467946756","commenter_b":"OH. MY. GOD.","commenter_a":"the 33 1/3 book he did is awesome","post_message":"\"Whether it's a song, or a book, or a conversation you have at dinner, the creative thing is what happens in the process—not the relic of it,\" says the man behind the band the Mountain Goats."}]
