[{"comment_id":"10153575697359087","commenter_b":"I love American Politics... Hillary Clinton is the People's Champion yet she Support the 1994 Massive Incarceration Bill, the 1996 Welfare Reform that double poverty in America between 1996-2001, 1999 Glass-Steagall Act which caused the 2008 Financial Collapse and NAFTA which as a result 70,000 Factories and millions of Jobs have gone Overseas... But hey she can't be judge on her RECORD because she is a Woman and that would be SEXIST...","commenter_a":"This is a garbage article by not even mentioning Bernie Sanders.","post_message":"\"Donald Trump versus Hillary Clinton in November? Don't bet on it.\""},{"comment_id":"10153541842375329","commenter_b":"Kim has a nice body","commenter_a":"Who wore it better? Kim or Doug the Pug?","post_message":"Way to turn the tables, girls. (via BuzzFeed Trending)"},{"comment_id":"10153325446200950","commenter_b":"@username you dumb ass, read the initial comment before you come for me bitch.","commenter_a":"Get them all out of here!!!","post_message":"Two refugees from Iraq with alleged ties to ISIS are due in court Friday to face federal charges of supporting terrorism. According to an affidavit, both men are accused of lying to cover up their efforts to support terrorism. The arrests are now renewing a debate over bringing refugees from Syria and other countries to the U.S."},{"comment_id":"10153557407432964","commenter_b":"Did they really come legally? I think not. America was first inhabited by the Indians. Christopher Columbus discovered this country by chance and we were not invited, so legally I would think not. We took over, slaughtered many Indians in the take over. So please don't go there. If immigrants come to America I agree we need to now come legally and apply for citizenship, but that is not the issue. The issue is the children born here! This is where they were born and with that they are American! Period!","commenter_a":"I'm not sure I agree with that statement because regardless of whether their parents are immigrants, they too have the ability to become Americans. The children who are born in this country are born on American soil and should be considered Americans, just my thoughts. After all we were all once immigrants and at one time even if we ourselves are not immigrants, we were born on American soil from an ancestry of immigrants and for that reason we too are Americans. I agree with many things about you Senator Vitter, but I have to say on this I don't agree.","post_message":"I think it's flat out wrong for children of illegal immigrants to become U.S. citizens just because they were born here, especially when it’s justified using a false technicality of the Constitution. I made this argument in a guest column in USA Today. Read more:"},{"comment_id":"582484121909678","commenter_b":"Man she need to stop with her owe puppy monkey baby looking ass","commenter_a":"Donte Grant","post_message":"She's not ready for a tattoo"},{"comment_id":"10153232515139087","commenter_b":"Will she go away now?","commenter_a":"Rosa Parks, Martin Luther King, and Abe Lincoln all fought for equality. Kim Davis is trying to deny equality to people.","post_message":"Kim Davis was compared to Abraham Lincoln, Martin Luther King and Rosa Parks as she was given the \"Cost of Discipleship Award\" by the Family Research Council."},{"comment_id":"10153676230638984","commenter_b":"Hillary u r one dumb fucking bitch.u have to treat every race equal. An the man in the interview I have a question for you. (WERE U BORN IN AFRICA AND IF U WERE NOT THEN U R A BLACK AMERICAN.","commenter_a":"Where is the surprise in this? She's always been a radical.","post_message":"While Black Lives Matter is disruptively crashing other candidates' events, they're getting treated to behind the scenes meetings at Hillary Clinton events. Thank goodness this was captured on camera... Spread this video so everyone can see the real Hillary in action..."}]
