[{"comment_id":"1364883926864562","commenter_b":"Go tell her that bitch","commenter_a":"You are nothing but a disgusting pos Michelle after the sex scandals you have had, you are a freakin hypocrite lady, at least Trump's children were brought up right and with class unlike your daughter, you just need to shut the Fk up.","post_message":"Michelle Obama says Trump is guilty of \"bragging about sexually assaulting women, and this has 'shaken' her. What do you think about her comments?"},{"comment_id":"10153068133586135","commenter_b":"Nope kids do not belong at wedding receptions! Especially with the cost of plates being so expensive!","commenter_a":"Can't stand the non-kid weddings. Just bring them. HA!!","post_message":"After their babysitter cancelled, Jessica Baker and her husband didn't attend the wedding because kids weren't invited. A couple weeks later, they received a bill for $75.90 in the mail to cover the meals they would've eaten at the reception."},{"comment_id":"10153608158096336","commenter_b":"Takes all kinds of a--holes to make up this world and he/she is certainly the biggest one!!!","commenter_a":"Why is this getting news? It's not mandatory to tip. If you don't get good service you don't tip. Shut up, stop whining and do right by the next customer.","post_message":"A Rutgers University student who is waiting tables at a Jersey Shore restaurant this summer to help put herself through school was given no tip on a $112.03 bill and instead a taunting message."},{"comment_id":"1725002974382878","commenter_b":"Send this fool to the hangman to show that that USA won't put up with this crap, my husband post this","commenter_a":"obama 's sons if had them","post_message":"These disgusting Donald J. Trump-haters showed up to protest Trump as publicly and obscenely as possible.  And part of their protest was a SICK demonstration involving the American flag.  But before they could finish, they heard a voice give 1 order they never expected to hear..."},{"comment_id":"733056316849024","commenter_b":"Bitch has a nasty vagina","commenter_a":"They're wondering how to explain to their daughter that Trump won. How do you explain an adult woman wearing a vaginal out in public? What the heck is wrong with these people?","post_message":"ClashDaily.com"},{"comment_id":"656303624531597","commenter_b":"Fuck off bitch!","commenter_a":"What the hell does Mexico have to do with our policies, Take care of your own place and f-off Mexico.","post_message":"Claudia Ruiz Massieu, foreign minister of Mexico, has called on the U.S. to pass a new ban on firearms that she labels “assault weapons.”"},{"comment_id":"10153732358683984","commenter_b":"And let Sherriff Joe and border patrol do their jobs. The murder rate in Arizona is out of control and it's all illegals criminals","commenter_a":"Amen! TOTAL SUPPORT for Trump!! :-)","post_message":"The Donald just made a BOLD promise to a certain group of people if he becomes president - and boy oh boy, he is NOT messing around.  Do you support Donald Trump's tough position on this?"}]
