[{"comment_id":"1755262658020828","commenter_b":"@username, good thing you have a vagina, or your head would be fair game. STFU","commenter_a":"Would anyone want him to be their pilot knowing how little he cares for a human? I wouldn't.","post_message":"It seems that words do have consequences after all."},{"comment_id":"1253721481351661","commenter_b":"whoop, found some time capsules","commenter_a":"Chris Lloyd","post_message":"According to a new study, there are two massive structures, located around 2,896 kilometers below the planet’s surface – one below the Pacific Ocean and the other beneath the Atlantic Ocean."},{"comment_id":"10152931413566491","commenter_b":"Love how in America, its the land of free ONLY if you don't go against the status quo or what's defined as \"normal.\" I'm a straight dude, and guess what? When it comes to gay people, I mind my own business. I support the human right to love, so long as no one is hurt. I just wish minding one's business was actually expressed by the many who love to use it for themselves only.","commenter_a":"Obviously there are a lot of Christians or Islamists or whatever commenting on here with a ton of negativity about this. Being a Christian myself, God does not teach us to hate on people for choosing to marry the same sex. He teaches us to love others amd treat them fairly. Give your head a shake people.","post_message":"After the historic Ireland vote, here's where else gay marriage is legal."},{"comment_id":"10154455008597509","commenter_b":"Andre Ceasar","commenter_a":"Brittany Benoit, Jade Walker","post_message":"Take a look at the friends who you have outgrown, who you don’t talk to anymore, who makes no effort to see you. Focus on the friends who matter most."},{"comment_id":"535892949940559","commenter_b":"Courtney Stark can we do this with apple juice? Cara Jean Stark you can do it with Busch light","commenter_a":"Oh Stephen Conley","post_message":"BRILLIANT."},{"comment_id":"986689444723866","commenter_b":"She's an idiot","commenter_a":"She's as smart as a bag of hammers. Attention seeking dweeb.","post_message":"Wait until you see this."},{"comment_id":"10152983460914342","commenter_b":"Good to hear","commenter_a":"When my grandmother got very sick we put her in a nursing home it was bad they make people thing it was the best place ever but it was not after my grandmother passed away that was the only day i saw my grandmother nice and clean ,(.... but now after my dads stroke we have him in a nursing skill facility and is the best of all i being into is call Grace Care here in katy is super clean nurses are super nice the whole staff is very friendly my dads loves this place the way they treat their patients is absolutely amazing i will recommend this place to anyone!!!!!!","post_message":"\"Most people don't realize how expensive this care can be until a parent or family member needs it...and then it's a real shock.\""}]
