[{"comment_id":"1820431918212382","commenter_b":"Stupid whore","commenter_a":"Good !!!!","post_message":"My, my, my..."},{"comment_id":"10155496447630603","commenter_b":"What's it going to be? Pick your switch? The belt?","commenter_a":"Did someone call scan","post_message":"This mother saw her son on TV throwing rocks at police, so she went to the rioting scene, found him and let him have it for taking part in the violence, according to local reports. @webpagelink"},{"comment_id":"964624156930666","commenter_b":"Fat wives also can wear jeans ^_^","commenter_a":"He must have a really fat wife.","post_message":"Sounds reasonable :/"},{"comment_id":"10157894599650291","commenter_b":"Every time a Democrat gets in, we lose more of our state and lively hood. Need to cut the head off of that green snake.","commenter_a":"how are you even still in office?...","post_message":"Today President Barack Obama placed the entire Chukchi Sea and the vast majority of the Beaufort Sea off-limits to energy development. The only thing more shocking than this reckless, short-sighted, last-minute gift to the extreme environmental agenda is that President Obama had the nerve to claim he is doing Alaska a favor. President Obama has once again treated the Arctic like a snow globe, ignoring the desires of the people who live, work, and raise a family there. I cannot wait to work with the next administration to reverse this decision."},{"comment_id":"10152677348991523","commenter_b":"I wasnt there but innocent until proven guilty and its always a bunch of white women","commenter_a":"They are liars. Every time these women have a press conference, I've noticed while they're speaking they have to keep looking down at their notes. Their statements should freely flow out of their mouths if it was true.","post_message":"Phylicia Rashad says she was misquoted on Bill Cosby, and sets the record straight."},{"comment_id":"1657660854509683","commenter_b":"His wife was from Saudi Arabia the home of Isis and bin ladan. She radicalized him! These people mindset are very scary","commenter_a":"Islamic terrorist scumbags.. His wife should never have been admitted into the USA. America has the dumbest immigration policy on earth. Thanks for the 1965 \"turn America into the world's dumping ground \" immigration act teddy Kennedy!! NOT","post_message":"The gunman who turned a holiday party into a mass murder scene with his wife had complained that his co-workers made fun of him."},{"comment_id":"10154939052379218","commenter_b":"@username grammar Nazi feeling smug over a typo.","commenter_a":"But hey remember Love Trumps Hate lmfao libtards and there hypocritical ways","post_message":"Police say a teen wearing a cap with a Donald Trump campaign slogan was beaten and kicked as hundreds of students staged a walk-out to protest Trump's election."}]
