[{"comment_id":"1066188120157365","commenter_b":"You don't know shit lady !","commenter_a":"Those of you that are saying \"cry me a river\" are the same ones who probably laughed along with Trump when he mocked that disabled reporter, but it's all good because you get what you give, karma doesn't forget about anyone","post_message":"Meryl Streep just called out Donald Trump for bullying at the Golden Globes."},{"comment_id":"10153053153366717","commenter_b":"I can't believe how selfish this woman really is! How can she make a whole office and try to make the whole county think the way she does?! She gives no condition the others in her office that have to work under these stressful conditions. Amazingly selfish. God must be so proud.","commenter_a":"The Devil is your boss and no she is not going to let this die","post_message":""},{"comment_id":"674485572723233","commenter_b":"she needs to sit down and shut up","commenter_a":"Talk about a nightmare! Handler, look in the mirror!","post_message":"Lefty comedienne Chelsea Handler goes on a racially charged rant against Trump.  Just imagine if a conservative said anything like this?"},{"comment_id":"10153341871609411","commenter_b":"Lady is.Europe.is ur ultimate paradise huh wow, what's ur talks pointing out? Ur a pervert who looks at European ladies as 'new lady to rape'? U think European ladies are the ultimate ones in world? U must be an ignorant fool since birth","commenter_a":"Just thinking about sex is not life, u can be happy with out thinking about sex Thinking of sex make us animal and blind and leads u to rape a new woman","post_message":""},{"comment_id":"569672173222127","commenter_b":"Why does this women even receive a paycheck? I'd rather they give that money to a homeless woman in front of a 7-Eleven. You'd probably even get smarter conversation.","commenter_a":"Wasting your breath talking to these Trump members on his staff. They're like the movie The Stepford Wives! I think they all got their brains reprogrammed to say exactly what Trump wants & needs them to say to keep him looking sane!! It's scary!!","post_message":"\"'Alternative facts' are not facts. They're falsehoods.\" Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it.   Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"914457525280663","commenter_b":"she put it there herself those i sue you i sue you money on those lazy people.","commenter_a":"So granny doesn't love metal sausage.Why?","post_message":"Definitely not lovin' it"},{"comment_id":"10153670710614255","commenter_b":"Nitwit with not very many followers - whew!","commenter_a":"Check the 14th Amendment Mike - you are dead wrong.","post_message":"Facepalm."}]
