[{"comment_id":"10154620452720575","commenter_b":"She should have had a gun!!!!!","commenter_a":"Was it a Muslim?","post_message":"WIFE OF MISSOURI GOVERNOR-ELECT IS ROBBED AT GUNPOINT IN ST. LOUIS!"},{"comment_id":"1205822416127529","commenter_b":"And you're a Pussy!","commenter_a":"Not only that you're violent Mr. Trump but you're a racist, narcissist, bigot, mygonist, rapist, thug and the worst presidential candidate that the USA has ever had! You're everything bad that has ever happened on planet earth. You're the Ebola, Zinka, Meningitis, HIV/AIDS, Swine Flu, Hepatisis, Malaria, jiggers, Lice and Hemorrhoids and not to forget, you're the spread of cancer in the entire world! Go away already mtsweeeeew. #NeverTrump","post_message":"EXCLUSIVE PREVIEW: Tonight at 11/10c, Trump’s plan for his first 100 days: suing his female accusers."},{"comment_id":"10153866991751130","commenter_b":"@username You racists seem to always LOL, when you are exposed.","commenter_a":"Love this idea. I hope all the black LIES matter racists move to Canada. They can take all the haters, like Al Sharpton, Jesse Jackson, Louis Farrakhan, and Comrade Obama with them.","post_message":"Canada's black guy weighs in on race and politics in the U.S.  The Canada Party  Outspeak"},{"comment_id":"10152557601575950","commenter_b":"Well they can't come back and tell the others that there are no virgins","commenter_a":"French terrorist ? I never heard viva la France during a plane hijacking and if I hear Allah Akbar I'm knocking that son of a bitch out","post_message":"There is evidence the three dead suspects -- brothers Said and Cherif Kouachi and grocery store gunman Amedy Coulibaly -- knew each other and shared common ties with known terrorists."},{"comment_id":"10153698610918132","commenter_b":"She is a jerk","commenter_a":"Yeah, God forbid anyone may ever be inconvenienced. Typical Americans -- it's all about ME ME ME. \"Oh my gawd! My dinner was ruined because a toddler was crying! I want my money back! Boo hoo!!!!\"","post_message":"Nope, not sorry."},{"comment_id":"1026833867373308","commenter_b":"We don;t want or need your amnesty, illegals are criminals.","commenter_a":"If he's all smiles with those morons, he can't be trusted. TRUMP.","post_message":"Sen. Rubio co-sponsored the gang of eight amnesty bill in 2013 that would've granted amnesty to 11 million illegal aliens, weakened border security, weakened interior enforcement, and TRIPLED immigration."},{"comment_id":"10154856564546438","commenter_b":"Fake IDs fake visas...so why are we sure illegals never voted?? Illegals pose threat because of how much they owe coyotes that families back in Mexico maybe threatened if they dont run drugs for cartels...Trump is right to close this border.","commenter_a":"Ooooo","post_message":"\"You notice the Republicans are not saying, 'Hey, those aren the facts,' or 'something has changed,' or 'he did all these other things afterward.' No, what they saying is, 'You don get to talk about that.'"}]
