[{"comment_id":"10154165020726943","commenter_b":"Hillary, you look really tired. Even with all that makeup on. Just think how tired and hot you'd be if you were in Louisiana now like Donald Trump. Think how tired you would be if you had his schedule. Think how exhausted you would be trying to be President every single day. Please just give up now. With all your money, wouldn't it be nice to just stay home and spend time with your grandchildren?","commenter_a":"keep up the good work","post_message":"A federal judge in Washington, D.C. ruled Friday that Hillary Clinton must answer written questions from a group that filed a lawsuit over her private email server.  Lawyers for Judicial Watch, a conservative government watchdog organization, asked to interview her under oath as part of their Freedom of Information Act lawsuit against the State Department. - via NBC News"},{"comment_id":"378947809141289","commenter_b":"Alex check your fact on the cost","commenter_a":"Yes","post_message":"It is now being estimated that a border wall will cost $21.6 billion, which is much higher than Trump's initial estimate of $12 billion. Would you support the wall being built at this cost?"},{"comment_id":"1404388792935308","commenter_b":"For those of you that vision oriented. 😝","commenter_a":"Michael is a cutie, btw. 😉","post_message":"You have to admit that this is a pretty great way to highlight the hypocrisy of anti-trans politicians."},{"comment_id":"10154618646328812","commenter_b":"Europe will never be the same again thanks to refugees","commenter_a":"Ever notice how politicians insist on framing the narrative?","post_message":"French President François Hollande said today's attack and hostage situation at a church in Normandy was carried out by \"terrorists who claimed allegiance to ISIS.\""},{"comment_id":"10154980169065789","commenter_b":"@username poor little bitch, guess what trumps your president now ! Lol","commenter_a":"He's accomplished so much in such a short period of time, compared to the last administration. So thankful we have someone who will strengthen our nation and our military. God bless you President Trump!!","post_message":"Donald Trump has been in the White House for 13 days. Do you like or dislike what you've seen from his administration so far?"},{"comment_id":"615120388649797","commenter_b":"I don't think it should be considered treason, I think it IS treason. How do you Snopes check this? And where is the link to the Washington Post article?","commenter_a":"Guys we have no choice. They are so advanced we have no choice","post_message":"This should be considered treason."},{"comment_id":"1587581361533554","commenter_b":"Can we let her off with this one? I think it's in the public interest if we don't see that. The photographs of her having sex in a field were enough.","commenter_a":"I protest to this, I wouldn't wish that sort of cruelty on any sausage. Plus lets face it there would be no room for the sausage when her head is so far up there..","post_message":"On 4th May Hopkins tweeted \"If Sadiq Khan wins London, I will run naked down Regent Street with a sausage up my bum in protest #LondonMayor2016.\"  She later tweeted: \"I'm a woman of my word.\""}]
