[{"comment_id":"10152909457852869","commenter_b":"*morons* there is not an \"a\" in the word and you do not use an apostrophe in a plural. Have a nice day!","commenter_a":"Please do not compare the rattlesnake to Islamic Jihad. The rattlesnake believes in live and let live. Leave them alone and the rattlesnake will leave you alone!","post_message":"What do Islamic Jihad and rattlesnakes have in common? You don't negotiate with them, you don't feed them...you take their heads off before they bite you. WATCH and SHARE..."},{"comment_id":"10154222477216717","commenter_b":"I want her and trump dropped in the middle of Aleppo ASAP.","commenter_a":"What swamp did this creature slime her way out of!!!' I wish she would slither back in!!'","post_message":"Trump advisor Kellyanne Conway also said that detained Muslim travelers would be \"disposed of\" on a case-by-case basis."},{"comment_id":"10154858559120259","commenter_b":"Good! I hope they lock that bitch up for as long as they can!","commenter_a":"Time for prison.","post_message":"Student Nikki Yovino claimed she was raped by two football players, both of whom lost their scholarships and maintained the sex was consensual. Now, Yovino admits it was a lie designed to gain sympathy from another man she liked. She now faces charges that could bring 5 years in prison if convicted."},{"comment_id":"1189126694470722","commenter_b":"With all the beutiful woman in NYC you get a mop","commenter_a":"She only cares about money she will never have true love' She must work for the IRS or the Goverment","post_message":"When it comes to love, Martina Paillant won’t settle for someone who has a credit score below 700."},{"comment_id":"900098320056924","commenter_b":"What a stupid bitch","commenter_a":"Carmen Favela girls dick ride the shit out of drake 😂😂","post_message":"Drake Fan Calls Cops On Meek Mill & Rats Him Out To His Probation Officer For Threatening Drizzy!"},{"comment_id":"1056321874481529","commenter_b":"Why don't you purify yourself in the waters of Lake Minnetonka?\"","commenter_a":"All lives matter","post_message":"Hillary Clinton and Donald Trump face off now in the first presidential debate of the 2016 campaign:"},{"comment_id":"10152910836255779","commenter_b":"Simply stated, the majority of the comments on this thread express what she is all about. Feminism, my eye tooth!","commenter_a":"Remember the days when you had to have talent to make the cover of @username? #TakeMeBack","post_message":"Reality-TV juggernaut, selfie queen, actress, model, mother, Internet-breaker, entrepreneur and video game subject Kim Kardashian has something to say: \"I believe that I am so much smarter than I'm portrayed.\" The 34-year-old megastar talks about her scandals, family, and feminism in our wide-ranging new cover story. Here are 11 highlights you won’t want to miss: @webpagelink"}]
