[{"comment_id":"1091887850889750","commenter_b":"She is a POS racist cluck bum bitch and NFL you Scumbag should give all the ticket holders half their money back","commenter_a":"What about the planners of NFL Super Bowl did they not know what her performance was about there's a little bit more to blame then just solely on Beyonce. The Super Bowl planners NFL new what hurts halftime show was about was not announced or advertised of being such as low blow off base nutcase to let it going on so take that NFL maybe you should pay attention what's going on around you to","post_message":"Last weekend Beyonce got to have her racist fun at the Super Bowl. But now she's gotten some massive bad news. Looks like you can't go off and support cop killers without having to pay a big price later on. Boom!"},{"comment_id":"10154151078661002","commenter_b":"Oh please just remember who killed the most Americans on American soil they were not Black or White that's what's wrong with this country if we banned together we would never worry about muslim terrorist! They wouldn't stand a chance against the blacks and whites of America","commenter_a":"Because he's a pale person his information is not even released yet","post_message":"3 dead in Lafayette theater shooting WATCH: @webpagelink #Local4Today"},{"comment_id":"988396247881207","commenter_b":"She should have walked with a pig","commenter_a":"So stupid.","post_message":"Woman Hitchhiked Through The Middle East To Prove Muslims Are Peaceful. What They Did Next..."},{"comment_id":"1090226121037135","commenter_b":"Islam and muslims are biggest threat.","commenter_a":"Israel stands with France against terrorism. Do France stands with Israel against the same terrorism?","post_message":"France's year of terror"},{"comment_id":"10153690611426756","commenter_b":"The woman is the patient.","commenter_a":"It's interesting the idea that the woman is the \"patient\" so her health is all that matters. I've always pictured prenatal care as for both the mom and baby together.","post_message":"Over the years, residents have come to Janet Singer, a nurse midwife, with tricky questions about performing abortions: Where does life actually begin? How do doctors’ personal beliefs play out in their clinical care? And what’s really best for mothers? She thought the public would benefit from hearing their experiences, so she asked four residents to write about them."},{"comment_id":"10153269356147452","commenter_b":"@username the Marine Corps taught me nothing. You must be a weapons expert","commenter_a":"So you can hear two people yelling but not a gunshot?","post_message":"BREAKING NEWS: A homicide investigation is underway after one person was found dead following a report of two men yelling in an Alhambra neighborhood, police said. One person is being questioned, and there is no active search for other suspects."},{"comment_id":"10150823645789963","commenter_b":"She was a hoe..","commenter_a":"But having relations with an intern is something private. A blow job is no big deal. The Leftists sure do rationalize a lot.","post_message":""}]
