[{"comment_id":"395997370588557","commenter_b":"all these weman want is his money and 15 minutes of fame ,,,REALLY","commenter_a":"Had to tell her name because not getting any attention.","post_message":"Do you believe Jane Doe #2, Jennifer Thompson, considering she said she took the $700 Bill Cosby reportedly gave her after this act???"},{"comment_id":"10152966731859342","commenter_b":"She needs a hanging.","commenter_a":"Sierra Gotti","post_message":"\"Not just one kid, but multiple kids. That's a plan. You're making a plan and continue to do it. I think you are sorry for the last two years, but frankly you're just sorry that you got caught,\" a judge said of a former special education teacher.  WATCH THE TEARFUL COURT PROCEEDINGS:"},{"comment_id":"10153188400898352","commenter_b":"Do u.not care bout the girl","commenter_a":"Devil dogs","post_message":"Erin Ingram who lost an arm aged 8 in pitbull attack awarded $72M by jury"},{"comment_id":"10154091613326491","commenter_b":"@username, being dumb is a choice. Well done. Did you decide to be straight ?","commenter_a":"Stop... you are American or you arent. Quit separating people by what body parts a person likes to sleep with and what color of skin they have... Just stop","post_message":"“When you don’t have data about a community, at times it can seem like the community doesn’t exist.”"},{"comment_id":"10154530724213645","commenter_b":"Yes Ryleigh this is really awesome. Great job !","commenter_a":"Nam Breanne Ewing NAM @username did you see this? Ryleigh @username and I are sooo proud of you. This is fantastic! Congratulations!!! I hope we are going to see you again this year in June!!! @username","post_message":"Meet Ryleigh!   Despite her physical challenges, she's beating the odds and inspiring everyone she meets with her story."},{"comment_id":"10153889787166337","commenter_b":"This sucks this is such a good show","commenter_a":"Not happy! Love the show! Can they not find a replacement for Molly? Your messing with my Monday and I don't like Supergirl.","post_message":"CANCELED? Sad news for Melissa McCarthy and Mike & Molly fans..."},{"comment_id":"405246192933309","commenter_b":"To many people have nothing to do but bitch","commenter_a":"What is wrong with it, it could mean God bless or whatever God you pray to","post_message":"Should this religious phrase have been banned?"}]
