[{"comment_id":"962496207173455","commenter_b":"#trumpnation #teamtrump #trump #votetrump #riseup #crushpoliticalcorrectness #getourjobsback #deporttheillegals #stirupwashington #shakeupDC #BANMUSLIMS #rebelflag #no2NikkiHaleytheTraitor #merrychristmas #makeourmilitarygr8again #keepguitmoOpen","commenter_a":"Go F your self Cruz! Voting for TRUMP!","post_message":"\"The truth of the matter is if Donald Trump became president, nobody knows what the heck he would do. He doesn't know what the heck he would do,\" Ted Cruz said."},{"comment_id":"10155007854069170","commenter_b":"Suck it up and move on lady","commenter_a":"this occurs when they go off their medication","post_message":"Enjoy this video. Watch it repeatedly. Savor it like a fine wine..."},{"comment_id":"10153438263919087","commenter_b":"Lol what a pussy","commenter_a":"I a Democrat and everyone is making a big deal out of this. Give them their snacks and they will leave.","post_message":"Congresswoman Donna F. Edwards slammed the media for condemning activists protesting the deaths of unarmed black men at the hands of white police officers as “thugs, criminals and drug users” while \"a group of armed men illegally occupying a federal building have been referred to as an ‘armed militia,’ or simply ‘occupiers,’ as though that behavior is acceptable in a nation of laws.\""},{"comment_id":"1069739979818471","commenter_b":"I thought she'd be gone by now! How the F can they relect that bitch!","commenter_a":"This lady can hide her own Easter Eggs...","post_message":"Folks, Pelosi is at it again..."},{"comment_id":"988569754496111","commenter_b":"Wow, get jobs? because we kill all the whales every year","commenter_a":"I have no respect for the tribe. Why don't they get jobs and stop killing all the whales.","post_message":"The public weighed in tonight on whether the Makah Tribe should be allowed to hunt gray whales again >> @webpagelink"},{"comment_id":"909196299140119","commenter_b":"She aint no fun!","commenter_a":"Jack King","post_message":"Virgin wife who won't have sex is trying to set husband up with live-in lover"},{"comment_id":"845732068898255","commenter_b":"bring all our soldiers home to protect us from the illegals, n's, and queers. let those other countries fight their own battles. money paid by americans stays in america","commenter_a":"I told you from day 1. We Americans are so super sick and tired of you liberals and media trying to water down America. We're sick and tired of you trying to pussify America. We're sick and tired of you trying to force liberalism down our throat. So guess what ? Open wide because now you forced us to shove Trump down your throat !! Enjoy !! We just got our balls back !! Liberals and socialists suck ... They don't like guns, So they don't think you should have one. They like social programs, So they think you should pay for them They don't like religion, So they don't think you should be religious They like abortion, So they think you should like abortion They hate success, So they think you should pay more taxes. They elected the first Muslim president, So they think you are a racist.","post_message":"ClashDaily.com"}]
