[{"comment_id":"943053922418420","commenter_b":"It's like 5 minutes and it's good. Watch it goddamn!","commenter_a":"@username watch the video xo","post_message":"Alan Watts delivered this profound message decades ago, and unfortunately not much has changed.  Vis Reset.Me"},{"comment_id":"1088726504494434","commenter_b":"Ni en los concursos de pueblo se ve algo tan bochornoso!","commenter_a":"omg I am huge HARVEY FAN this was a horrible mistake i cant imagine how awful he must feel but thats live TV ...","post_message":"Something very unusual happened at the #MissUniverse pageant tonight...  #MissColombia was incorrectly crowned and she had to relinquish her crown to #MissPhilippines.  Social media has exploded from the result of this: @webpagelink"},{"comment_id":"10153690862048812","commenter_b":"@username number 2 would be thugees not thugs","commenter_a":"Over rated NFL attention seeking drama thug using his kids for media attention.","post_message":"NFL star James Harrison strips his kids of their participation trophies. “These trophies will be given back until they EARN a real trophy.” @webpagelink"},{"comment_id":"872299812875772","commenter_b":"Hillary is spreading disgust. She's a shameless, pathological liar with no morals at all.","commenter_a":"She is a complete idiot as well as a liar.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"},{"comment_id":"10154897891195530","commenter_b":"@username you kiss your mama with that nasty mouth?","commenter_a":"Trump is frightening for everyone. Period.","post_message":"There are up to 127,000 undocumented immigrants in Michigan, many of them anxious about Donald J. Trump."},{"comment_id":"10154177400546756","commenter_b":"I do not intend to vote for her in Any case. Her shady politics, her Attitude, the skewed way this contest has been run, and my basic gut reaction of Strong Dislike for her are nearly overwhelming enough but... This recent tack she has made Insisting that the Democratic party MUST Permanently Give Up on things like Universal Health Care, drug reform, campaign reform, college access, and essentially Everything that Really Matters to ME as a voter has Convinced me that I CANNOT - under Any Circumstances pledge My Vote for her. To do so would be to Agree with her disgusting defeatist position. The truth is, this is the Same reason I will not vote repugnican. And, while you may say my actions make it more likely a Rep. will win, I see no Real hope in a Hillary win Worth Voting FOR. Deal with it.","commenter_a":"So, for those who will not vote for Hillary Clinton if she becomes the democratic nominee, do you think it is possible that this will result in a GOP victory? Would that actually be better for the country?","post_message":"Hillary Clinton is projected as the winner of the Nevada Democratic caucus, according to AP. #NVcaucus"},{"comment_id":"915727415130269","commenter_b":"Dại Lâm what do you think?","commenter_a":"I'm getting burned out on the Rock he was in 13 movies last year and it's only June and he's already in 6 movies this year give somebody else a job dam he's not the only actor in Hollywood. ..gee","post_message":"From Fast & Furious to Big Trouble in Little China."}]
