[{"comment_id":"10153249048488352","commenter_b":"Pure evil heartless bitch","commenter_a":"The same thing should happen to her no doubt about it","post_message":"Texas woman, 26, found guilty of suffocating fiancé's two-year-old daughter to death using duct tape after he broke up with her"},{"comment_id":"10152976248907232","commenter_b":"I am guessing both Pamela and Leslie are cop wives, or just like giving cops free head","commenter_a":"You know what boggles my mind is how they are here to protect and to serve but it goes both ways here .. they are paid by our tax $ to protect and to serve and yes there job is a hard job but at the end of the day these ppl are just like anyone of us ppl of the streets but I'm confused as to why if little mikey off the block killed somebody beat somebody or whichever would get a he'll of lot of years in prison and cops who are supposed to be here to protect and serve us would get a slap on the wrist or a leave of absence and paid .. so in reality we are all not treated the same by the system but let's just keep being blinded to the matter it has nothing to do with race it has to ...","post_message":"Thousands of demonstrators stood on sidewalks in Delaware County to show their support for law enforcement. STORY HERE: @webpagelink"},{"comment_id":"1573408882718854","commenter_b":"These women are crazy to boycot her clothes. She is so classy.","commenter_a":"Please leave Ivanka out of this. She is a hard-working, talented woman, and her clothes are beautiful and affordable!","post_message":"Feeling the chill, Ivanka Trump?"},{"comment_id":"919624348099683","commenter_b":"They don't want to assimilate; they want to take over. That's why ovomit is here","commenter_a":"Quit allowing Muslims into our nation as immigrants...we do not need people that will never assimilate into our culture....their god Is not our God!","post_message":"ISLAMIC TERRORISM: Texas Gunman Mother Says He Wasn Religious Until Attending Phoenix Mosque, Meeting Elton Simpson @webpagelink"},{"comment_id":"1313980255294149","commenter_b":"this woman simply cannot be a fisrt lady.. Why doesn't trump talk about deporting her ass?","commenter_a":"I am sure he didn't marry her for her to speak. When I think of all the haters who said Michelle Obama had no class (ridiculous), I wonder if they will be thrilled with FLOTUS, Melania Trump.","post_message":"Ha."},{"comment_id":"847481612018670","commenter_b":"Kick them out of the country,they do not deserve to live here! DEPORT!","commenter_a":"Deport them to Iran.","post_message":"OUTRAGEOUS: Little Muslim Rats At Public School Walk Out When NATIONAL ANTHEM Plays Do you agree they should be deported?! Share this EVERYWHERE if you do! @webpagelink"},{"comment_id":"396542397200035","commenter_b":"And that's why Racism is continuing on!","commenter_a":"RACISM IS ALIVE AND WELL! However, I DON'T CARE. PEOPLE OF COLOR ARE MOVING UP! YEP! Moving on up. 👍👍🇺🇸😛","post_message":"One of the most dangerous myths about hatred of black people is that it will disappear on its own. Dylann Roof was born in 1994."}]
