[{"comment_id":"1048024048598660","commenter_b":"Disgusting.","commenter_a":"The blessings of new life. I think it's wonderful","post_message":"'It looks like an alien'"},{"comment_id":"10153562430331350","commenter_b":"Shut up you stupid woman","commenter_a":"Why do white think they can break rules ? Anyone hunts is a savage, and they are going to suffer, that's the way they think you can treat black people also, you and your seeds will suffer, and it's long overdue, there is no way God gave me this same book to worship as the white man. Break the curse and burn the bible.","post_message":"Legal analyst Lisa Bloom explains what could be next for the dentist."},{"comment_id":"10153244569769087","commenter_b":"Youare a fucking ignorant whore.","commenter_a":"Benjamin Netanyahu - is protecting the Free World while Hussein Obama wants the Deadly Suicide Pact with Iran. Wait until Iran hits America with their ICBM's, Iran can already Hit Israel.","post_message":"Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו delivered an intense silent protest of the Iran nuclear deal by staring down members of the United Nations General Assembly for nearly a minute without saying a word. WATCH:"},{"comment_id":"10153949050391037","commenter_b":"One word: uneducated","commenter_a":"Trump has had my vote from the start to finish ... Nothing anyone says can ' change ' my mind .... We need a business person in the seat to lead not be a tyrant.","post_message":"“During anxious times, it can be tempting to follow the siren call of the angriest voices. We must resist that temptation,' Nikki Haley said."},{"comment_id":"513866205470626","commenter_b":"This IS STILL AMERICA and I'll go where ever I want, if those pigs fuckers try to stop me it will be the last thing they do before meeting allah in hell","commenter_a":"They need to obey American laws. As all do who live in this great country.","post_message":"Video coverage from the Shariah 'No-Go Zone' has been released.  This is America. If you don't like it you can get out.  Do you agree Shariah Law should be banned in America?"},{"comment_id":"640840709429112","commenter_b":"QUIT RAPING AMERICA ..........WHY ARE YOU NOT IN PRISON. .........WHY","commenter_a":"oooh, I bet they are shaking in their boots","post_message":"BREAKING NEWS: Obama fires back at Russia..."},{"comment_id":"836200936476160","commenter_b":"Don't think ANY woman could run this country as well as a man could.","commenter_a":"Bring on mashed potatoe legs","post_message":"“I’m ready for Hillary, are you? Are you coming?”  - Sarah Palin"}]
