[{"comment_id":"943618162339946","commenter_b":"^ What an asslicking, apologist bitch.","commenter_a":"It's his fathers fault.... He had warrants and ran.... Then tried to run over police.... Look up the story before u believe this wack ass page- that boys father deserves to be charged with murder","post_message":"Courage, bravery, hero, protect, serve... These words are not affiliated with the cops who killed this boy.   Full story → @webpagelink Police The Police | Filming Cops"},{"comment_id":"10158544268330713","commenter_b":"Well she is a devil whore.","commenter_a":"I would have paid her to wear it if it have covered that ugly face...","post_message":"Progressives hate capitalism, except when they don't."},{"comment_id":"10153903054649753","commenter_b":"good ...she needs you to buy a ticket....unless she has already been forced to cancel all...","commenter_a":"of course she loves him....who ever heard of her before Blake....her new on tour being canceled for lack of sales suprise?????","post_message":"Blake Shelton started his 40th birthday celebrations with a cute note from Gwen Stefani. “Happy birthday to my favorite person I ever met @blakeshelton,” Stefani posted on Twitter. According to People, Stefani and Shelton’s PDA didn’t stop there. Stefani went on to share several messages to Shelton on Twitter and even changed her avatar to a photo of her country boyfriend. On Instagram, Stefani shared a photo of Shelton as a kid with the caption: “Happy birthday to @blakeshelton literally my... @webpagelink"},{"comment_id":"10155085398339726","commenter_b":"I believe the term is illegal aliens... They are not immigrants. Immigrants come here legally.","commenter_a":"They spent billions of dollars on illegal immigrants every year and little to nothing on infrastructure.","post_message":"This is why you should care:"},{"comment_id":"1011840532205809","commenter_b":"She's always been a corrupt liar","commenter_a":"One thing I know, Hillary has always been involved in community service. Go Hillary! ; .)","post_message":"A young man met Hillary at the NewsOne town hall and asked: What did you learn from the Girl Scouts that you would use to be a successful president?"},{"comment_id":"10152650786516491","commenter_b":"^^hoes got problems","commenter_a":"Dont like him, Dont Respect him can care less where , Rapist, Thief and total idiot goes except to jail","post_message":"Winston lost only one game as a starting quarterback."},{"comment_id":"10153506761069091","commenter_b":"Imagine if nothing was found like the weapons of mass destruction....mmmmm and you are right @username","commenter_a":"Yes","post_message":"Should Apple be required to help police unlock the San Bernardino gunman's phone? @webpagelink"}]
