[{"comment_id":"10153761646217439","commenter_b":"Dorrie America is a christian country. No one has to live under Sharia law unless they desire to participate. Women that are abused need to run to a shelter with their children ASAP.","commenter_a":"Brilliant and brave that Ben Carson would say openly what a majority of Americans are to afraid to say about Islam. Obvious to non-politicians what the incompatibility is all about.","post_message":"Carson is the first presidential candidate ever – or perhaps since Thomas Jefferson – to show a detailed knowledge of Islam and Sharia: “Right now,” he said about the possibility of a Muslim President, “when you have something that is against the rights of women, against the rights of gays, subjugates other religions and a host of things that are not compatible with our Constitution, why in fact would you take that chance?” Brilliant. Contrast those clear and simple and accurate words to the Obama administration’s systematic and deliberate denial of the nature and reality of the jihad threat. The entire Obama response to the jihad is called “Countering Violent Extremism.” Note the glaring absence of any reference to Islam and jihad. Obama is trying to fight a war while pretending that the enemy is other than what he is, or even worse, is nameless, faceless, and bereft of ideology. ..."},{"comment_id":"1168211463199863","commenter_b":"It's there. (Fuscia)","commenter_a":"I couldn't find New Zealand in there either. I suppose with a population of only 4.5 million...it's no wonder why.","post_message":"Where did Australia disappear to ..."},{"comment_id":"10154558604929411","commenter_b":"dont worry Ann, no one would wana rape your fat ass","commenter_a":"What I find terrible is that if anybody wears a bikini they \"have chances of being raped\". Sorry, but France has to keep their country free of this BS. Next time a french woman steps into a pool in a bikini, will she be molested by this woman hating monsters?","post_message":"The pool park has allowed bathers to wear burqinis and jilbab de bains as way of exception"},{"comment_id":"985606431474778","commenter_b":"@username, I understand what you're saying. I'm supporting Ben Carson for potus. But with all the voter fraud, illegals voting Hillary will be president. That scares the crap out of me.","commenter_a":"Sadly, I fear she will be our next POTUS. It's a bad, bad time in America.","post_message":"This is so sad."},{"comment_id":"10152860755326051","commenter_b":"way to go Arizona..mebbe the first shot of the Revolution...we MUST abide by the Constitution or it means NOTHING!!","commenter_a":"What does any one expect for any state to follow the president even when he not following the law of the lands that was put there for a reason... His theory is he have a pen n a phone so that gives him the right to over step the government that he has to go through because it's the Law! He hasn't done nothing for me nor my family, all he has done is given my taxes away freely while we struggle.. Nothing he has done has improve my family living not one bit... At the end of the day we don't need his helping hand at all it does us more harm then good for us... If anyone expect any state to follow the president then he needs to lead by example n follow the laws that was put there way before his time n stop acting like the ...","post_message":"This state just passed a bill allowing them to ignore anything President Obama asks them to do. And that’s not even the most controversial part of the bill."},{"comment_id":"10153434124594032","commenter_b":"@username illegals aren't just Mexican stop being ignorant.","commenter_a":"I'm on the fence about this, the immigrants being lazy living off the state should be taken back. BUT the hard workers doing what they can taking care of their families should not be bothered!!!","post_message":"#BREAKING: The deportation operation by U.S. Immigration and Customs Enforcement would begin as soon as next month, the report said. UPDATE: DHS plan to raid Central American immigrants draws criticism. Details: @webpagelink"},{"comment_id":"10153526773721350","commenter_b":"Those hips are MALE hips!","commenter_a":"She look so stunning & beautiful tonight","post_message":"Caitlyn Jenner shared some very powerful words from the podium."}]
