[{"comment_id":"10154838138336509","commenter_b":"If she does a good job, why should anyone care that she is single?","commenter_a":"China, it's non of your business. So proud of our new president.","post_message":"'As a single female politician, she has no emotional encumbrances of love, no family restraint, no children to worry about. Her political style and tactics are often emotional, personalized, and extreme.'"},{"comment_id":"1052974981463934","commenter_b":"Where is our government's back bone they should have someone down there telling them that we have our own laws. Instead they act they have a yellow streak down their backs this is the USA if they don't like it leave","commenter_a":"Go back to your shit hole in the sand'","post_message":"Muslims OUTRAGED After Texas Major After She Bans Shariah Court... [VIDEO]  She's taking heat.  Do you support this Texas mayor?"},{"comment_id":"848788448587668","commenter_b":"'@username is trying to use bully tactics to shut up anyone that doesn't agree with him. It won't work. We're fed up!! We will not call evil good and good evil, so crawl back to your safe space and stay out of the women's bathrooms!!","commenter_a":"I am NOT a bigot and i hate being told i am because i do not like what Target did.. that is crazy !! i really do not care what they do.. but not in the little girls room","post_message":"I hope this video makes the rounds....Target has completely LOST IT at this point....shame on them."},{"comment_id":"10154609681272300","commenter_b":"Actually she was not fat. The rules do not say you have to be a size 2.","commenter_a":"trump has no room to talk about calling anybody miss piggy especially when he posts pictures of him eating Mcdonalds and KFC on his private jets.","post_message":"Donald J. Trump called her “Miss Piggy” and “Miss Eating Machine” because she gained weight after winning the Miss Universe crown."},{"comment_id":"10153936528885695","commenter_b":"You run like a girl","commenter_a":"Jose Arellano that's probably why we saw the traffic earlier today","post_message":"Wait for it...wait for it -- a police officer chased three shoplifting suspects across Georgia 400 after this car crash. See the full video, plus we'll explain how it all started, at 5:14! @webpagelink"},{"comment_id":"10153635432868690","commenter_b":"Its not and has never been your land. You have no heritage nor history there except at best been that of tenant felaheens the Ottomans brought to milk the land for them or at worst; as more than half of you people are, illegal immigrants from the surrounding Arab states who flooded the land from the 1920s to 1940s as migrant workers and mujahideen who came to steal the land from the Jews. That your right of return better get its head swivelled to the Arab states. Besides, the Jews you ran out of the Arab states also has the keys to their doors and need their properties you stole and their own right of return.","commenter_a":"You will return and all Muslims will pray in Israhell won't last more than a decade","post_message":"'For Palestinians to give up the Right of Return- even those who have no intention of ever returning - is to acknowledge that we are lesser beings; that kicking us out of our homes and ripping our hearts out was okay. It is to affirm that we do not deserve our own history and heritage; that it was okay for our proud parents and grandparents to wither in the ashes of their memories inside refugee camps unfit for animals.'  Palestinian novelist Susan Abulhawa explores the meaning of the Right of Return."},{"comment_id":"10153508480963984","commenter_b":"She is a disgrace","commenter_a":"There is nothing here for a reality show. Maybe a show on mental illness.","post_message":"NAACP race faker Rachel Dolezal stepped down from her job, but she already has a new gig in the works. You might be shaking your head when you see it..."}]
