[{"comment_id":"10153571738266350","commenter_b":"This gotta be the dumbest bitch on this plant","commenter_a":"She has a lot of nerves, respect WHAT! killing the animal is not respect, shooting them with a camera is respect. Love to hunt and after your dead.... I respected her so much!","post_message":"\"Everybody just thinks we're cold-hearted killers, and it's not that. There is a connection with the animal, and just because we hunt them doesn't mean we don't have a respect for them.\""},{"comment_id":"10154522973374102","commenter_b":"She may be the lesser of two evils, a female, a scapegoat, but she's still a nut job.","commenter_a":"I'm not saying she doesn't deserve disciplinary action, because she does. But I find it disgusting that they are targeting ONLY her, and not Trump's tweets against Nordstrom. I get that she's an easier target for the GOP, but grow a pair of balls, please.","post_message":"BREAKING: The Republican chairman of the Oversight Committee is recommending disciplinary action against Kellyanne Conway for promoting Ivanka Trump products from the White House, including \"reprimand, suspension, demotion, or dismissal.”"},{"comment_id":"1409547482430213","commenter_b":"I will cut that bee-och","commenter_a":"And your boo Jennifer","post_message":"WE CANNOT HANDLE THIS."},{"comment_id":"1065259396852375","commenter_b":"Oh @username, you're so fucking stupid it's not even funny. I hope you can't reproduce.","commenter_a":"Have you recuperated from all the fun last week ? Glad everyone made it home with no problems. If you're planning to go to the DNC convention; here's the schedule. DNC convention Schedule Saturday, 27 August 2016 11:15 AM Free lunch, medical marijuana, and bus ride to the Convention. Forms distributed for Food Stamp enrollment. 2:30 PM Group Voter Registration for Undocumented Immigrants. 4:00 PM Opening Flag Burning Ceremony Sponsored by CNN 4:15 PM Address on \"Being the Real You\" Rachel Dolezal, former Head of the Seattle NAACP and Caitlyn Jenner 4:30 PM \"How to Bank $200 Million as a Public Servant and Claim to be Broke\" Hillary Clinton 4:45 PM \"How to have a successful career without ever having a job, and still avoid paying taxes!\" A Seminar Moderated by Al Sharpton and Jesse Jackson 5:00 PM Medals of Freedom presentation to Army deserter Bo Berghdal and the Baltimore ...","post_message":"Stand with Democratic leaders: tell the RNC to DISBAND Trey Gowdy's fraudulent Benghazi committee and have Republicans pay back taxpayers! PETITION: @webpagelink (hat tip to Occupy Democrats)"},{"comment_id":"1125870684199336","commenter_b":"If just like to see her run away!","commenter_a":"Please, NO !","post_message":"Would you like to see Michelle Obama run for office one day?"},{"comment_id":"1800084686916109","commenter_b":"Since 1952 Muslims are here ILLEGALLY. They need to get the hell out.","commenter_a":"Dear Democrats and Liberals, I'm noticing that a lot of you aren't graciously accepting the fact that your candidate lost. In fact you seem to be posting even more hateful things about those of us who voted for Trump. Some of you are apparently \"triggered\". Because you are posting how \"sick\" you feel about the results. How did this happen you ask. You created \"us\" when you attacked our freedom of speech. You created \"us\" when you attacked our right to bear arms. You created \"us\" when you attacked our Christian beliefs. You created \"us\" when you constantly referred to us as racists. You created \"us\" when you constantly called us xenophobic. You created \"us\" when you told us to get on board or get out of the way. You created \"us\" when you forced us to buy health care and then financially penalized us for not participating. You created ...","post_message":"President-elect Donald J. Trump​, Melania Trump, Speaker Paul Ryan​ and VP-elect Mike Pence​ meet at Capitol Hill."},{"comment_id":"10153180250311051","commenter_b":"Bitch","commenter_a":"matt bac she couldnt control her husband, the whole usa wtf","post_message":"Here's what Hillary Clinton had to say about her State Department e-mail scandal. Simple question: Do you think she'll be the next President of the United States?"}]
