[{"comment_id":"1542895312670081","commenter_b":"#Trump #Trump2016 #MakeAmericaGreatAgain #WomenForTrump #VeteransForTrump #IllinoisForTrump #ArizonaForTrump #TrumpTrain #TrumpForPresident #TrumpAmerica #TrumpBuildThatWall","commenter_a":"All you guys are a joke trump is running as a republican because he knows you're dumb enough to fall for his show, look up trump interview news week 98","post_message":"Politicians are trying to chip away at the 2nd Amendment. I won’t let them take away our guns!! #MakeAmericaGreatAgain #Trump2016 Text TRUMP to 88022 to get exclusive updates!"},{"comment_id":"930011010437419","commenter_b":"Lady u need help fuck grump","commenter_a":"\"Semame?\" Really, is spell checking really that difficult? I'm only pointing this out because it's a constant with your memes and videos. As funny as they are and as much as I enjoy them, please, for the love of God, use spell check. You look like buffoons when you misspell such easy words.","post_message":"WATCH: 10 years ago, Sesame Street called out trashy Donald Grump. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153296674076323","commenter_b":"i can't deal with her","commenter_a":"@username thought you might find this interesting","post_message":"After Frida Kahlo died in 1954, her husband Diego Rivera shut her belongings in a bathroom at their Mexico City home – then demanded it be locked until 15 years after his death. In fact, the room wasn’t opened until 2004. See the full gallery of what was inside: @webpagelink"},{"comment_id":"507506722754821","commenter_b":"Who cares what he thinks?","commenter_a":"Is Kanye West Racist,,, he sure acts like it. In one word \"DENIAL\"... And yes Kanye if it was a \"WHITE\" entertainer I would feel the same way. This whole race card is getting played out, BILL COSBY is a rich NARCISSISTIC PREDATOR. Color shouldn't give ANYONE a pass.","post_message":"With just three words, Kanye West succeeded at creating yet another Twitter storm."},{"comment_id":"1178825752155659","commenter_b":"Bitch is crazy","commenter_a":"Delusional!","post_message":"HILARIOUS"},{"comment_id":"988329747869113","commenter_b":"she should be arrested for making false statement, amd be fired from her job. This crab is getting old.","commenter_a":"She lied","post_message":"WOW this lady...shamelessly LIED about her entire encounter with the Police Officers..and here's the proof! What a fool."},{"comment_id":"857390540965850","commenter_b":"I resent paying for any illegal immigrant through our tax money...It is fundamentally wrong and immoral to take away from the next generation of real Americans.... Obama is evil......how about taking care of our elderly, our Veterans and our AMERICAN children?","commenter_a":"thanks obama","post_message":"This is insane, no rational government would do this, or am I off base on this one?"}]
