[{"comment_id":"712544572223659","commenter_b":"The devils soldiers are out of control.beating and killing everybody.And they're not going to stop until we start fighting back","commenter_a":"That pig had wonderful training---can't ya see that?","post_message":"The police officer accused the man of a DUI - driving while drunk. He didn't realize that the man was having a stroke. When he didn't answer (because he was HAVING A STROKE), the officer beat the living hell out of him!"},{"comment_id":"1121854401168903","commenter_b":"Stfu fat bitch","commenter_a":"Is it because they're assholes?","post_message":"They spend their lives eating rotten meat - so why don't they get sick?"},{"comment_id":"10153070562531051","commenter_b":"She needs to be put in a hospital were criminals go. They need to put all the weirdos on a dam island somewhere.","commenter_a":"THere has to be a way to trace the video, find this woman and make her pay for this horrible murder of an innocent dog. Nothing could be gained by this act and the woman needs to be stopped before she kills again.","post_message":"First she tied the dog up. Then she took out her blowtorch."},{"comment_id":"1131104760243867","commenter_b":"Because no feminist says that.","commenter_a":"So when feminists say, genders should be separated in school, it's just a valid opinion. But if a straight white male says the same thing about science labs, it's sexist? How does this logic work? Oh, sorry, I forgot it isn't logic, it's stupidity. ;)","post_message":"I'm crying with laughter over some of these."},{"comment_id":"859646614169357","commenter_b":"Even the stupid people are starting to figure out that @username is a scumbag. It's not that tough to connect the dots that she's a liar, who's willing to sell our children's safety to the highest bidder. by #AnthonyRamirez #ImAgainstHer #LockHerUp #HillarySucks #NeverHillary","commenter_a":"No mention of Michael Phelps? O yeah, he's a white male and the most successful Olympian in history who also happens to be American. Stupid me...doesn't fit your crooked script.","post_message":"Well said, Coach Auriemma. Keep winning, USA Basketball."},{"comment_id":"1385280774831907","commenter_b":"#NEVERTRUMP #NEVERHILLARY #NEVERBERNIE @webpagelink","commenter_a":"Have stop watch Faux News! #nevertrump","post_message":"\"In Hillary's America we focus on Hillary, but we also focus on the whole sordid history of the Democratic Party. We're telling an unknown story, and it's going to rile up this race.\""},{"comment_id":"10153058619121051","commenter_b":"She should go to prison for years and starved on a day bases! She is disgusting!!","commenter_a":"Poor little baby","post_message":"Even the police were stunned that someone would treat a dog like this for no reason."}]
