[{"comment_id":"10153609114867212","commenter_b":"'@username and the other 'haters', tension in the city? 'Maybe' criminals and snipers will think twice before shooting someone like the officers, if they know they have fire power back! In Dallas most of those officers only had hand guns to defend theirselves and the innocent people! Their hand guns didn't reach the distance needed! Now, that's TENSION! You think it would be 'tension' if your Police Officers were equipped properly in your city, but what would you do if this same thing happened in your city like it did in Dallas? Dont ever say it can't! The world is changing, wake up! It shows you do NOT have a son, brother, father, uncle or a good friend out there daily in a police uniform or you would want them protected! Keep hiding your head in the sand and hope one day you, your child, parent or loved one never ...","commenter_a":"They should carry their guns on duty n off back off the cops they save life's no matter what anyone says they have been their when I needed them and I have my blue to show it. Chief is doing what he thinks is right period","post_message":"The American Civil Liberties Union of Oklahoma (ACLU) is speaking out against Oklahoma City Police Chief decision allowing officers to carry personal rifles, saying it is likely to increase tension between the public and law enforcement. #News9"},{"comment_id":"10153061707381051","commenter_b":"Stupid bitch needs her face slapped until she falls out..","commenter_a":"She is no mother, glad to see someone finally called the police on one of these child abusers rather then just posting it.","post_message":"Onlookers were genuinely shocked when they saw how this teen mom was treating her child."},{"comment_id":"1647473612211471","commenter_b":"Trump has done nothing against the law and if he did why didn't they file charges or even report it....This is just bull and not important...but on the other hand Hillary can and will be in trouble with these email leaks...statue of limitations is not up on her...so there can be charges brought up on her","commenter_a":"The fact is, that you people have lost all credibility with anyone with the ability to think for themselves...Your obscene bias, is so obvious, it's not even funny anymore....The NY Times has even less credibility, and is viewed as even more bias and corrupt than @username or People, because the previous allegation the Times made a few months ago, was **proven false by the 'victim' herself**. And you have to understand that the election is *temporary*, and after the election is over, your ratings will still be at records lows, except your reputation/credibility will have been permanently shot, permanently destroyed. This is the price you, your producers and executives have paid to try and skew this election towards Hillary at any and all costs...","post_message":"Ex-beauty queen says it was humiliating for Donald J. Trump to be backstage, 'before you could put a robe or kind of dress yourself, he walked in. Some women were half naked, others were in the process of changing.” @webpagelink"},{"comment_id":"10153350460578690","commenter_b":"Haha innocent people. You're funny Ceyda. A Muslim living in Germany saying hitler, who is dead by the way, should finish all the Jews. I hope the west wakes up to the problem of you disgusting vermin and destroys you. You have been sent by the devil through your peodo prophet.","commenter_a":"This stupid Israelis how long would they continue harming innocent people Israel is behaving as if even that land is there's forgetting then were also refugees I wish Hitler could finish all jews","post_message":"Anyone who's received a letter has 30 days to leave Israel. If they refuse to leave they will face a hearing to determine their indefinite imprisonment. @webpagelink"},{"comment_id":"10154522973374102","commenter_b":"She may be the lesser of two evils, a female, a scapegoat, but she's still a nut job.","commenter_a":"I'm not saying she doesn't deserve disciplinary action, because she does. But I find it disgusting that they are targeting ONLY her, and not Trump's tweets against Nordstrom. I get that she's an easier target for the GOP, but grow a pair of balls, please.","post_message":"BREAKING: The Republican chairman of the Oversight Committee is recommending disciplinary action against Kellyanne Conway for promoting Ivanka Trump products from the White House, including 'reprimand, suspension, demotion, or dismissal.”"},{"comment_id":"1901824630047376","commenter_b":"Meant to be","commenter_a":"Catherine her name... :)","post_message":"She’s a Republican college student and she’s proof that marching is about more than politics. #WomensMarch"},{"comment_id":"651967471607752","commenter_b":"How does she stand on marriage! Does she believe it's alright to have girlfriends when you are married??","commenter_a":"I voted for Hillary last time and Ive always been with her until now, and as of now Im unsure thats because of 3 issues...Healthcare, College, and Marijuana. Obamacare is only so so....singlepayer system is possible because I think we are the last 1st world country without it.......free college is possible because we already public school k-12, extending it through college would basically just be keeping up with the times. Heck so State already let their kids go to college their final two years and its included wiht the public system...so we are almost there.......last Marijuana....Hillary needs to be more Democrat and less Grandma on this issue....even the Republicans are seeing the light on this...actually Rand and Ron Paul both Drs say the harsh laws are worse than the usage. The only reason to keep it illegal is if you are being supported by the prison and pill industries both ...","post_message":"Hillary just became the first woman to win the Iowa Caucus! hrc.io/1RYmIp5"}]
