[{"comment_id":"10153561162560530","commenter_b":"No, she hit him and kneed him in the balls","commenter_a":"Why didn't this show how he was shoving through the crowd and her up against the bar and that's why she got mad?","post_message":"Surveillance video from a Tallahassee, Florida bar shows Florida State University quarterback De'Andre Johnson and a woman engaging in a bar fight in June 2015. STORY: @webpagelink"},{"comment_id":"10153330910164497","commenter_b":"Hillary is a sex addict; shes always screwing herself.","commenter_a":"Idk if she'd be a good president though; last time she had a job, she outsourced it to Monica.","post_message":"This Week's Top Story:"},{"comment_id":"10153417590345329","commenter_b":"Nah,cause then feminists will bitch.","commenter_a":"Stop that already! Or make MomBodies a thing!","post_message":"DadBody goals right here via Leonardo DiCaprio."},{"comment_id":"10158270376090381","commenter_b":"Wacky Woman!","commenter_a":"Perserverance! Thanks for keeping us strong!","post_message":"Last night, Majority Leader Mitch McConnell attempted to silence not only Senator Elizabeth Warren, but the late Coretta Scott King. It was a shameful attempt to stifle the thorough debate on President Trump’s nominees that the American people expect and deserve. I applaud Senator Warren and my Democratic colleagues in the Senate for fighting on behalf of the millions of Americans who have demanded that the next U.S. Attorney General be committed to upholding our most fundamental constitutional rights. In the battles to come, both in Washington and in communities nationwide, I urge my colleagues to follow Senator Warren’s lead—as she persisted last night, so must we. We do not have the right to remain silent."},{"comment_id":"1575163439454943","commenter_b":"Thank God for this smart young man I hope he can get thru to these thugs who have done this.","commenter_a":"I tip my hat to this young man who certainly possesses a depth of wisdom and pray he and many more like minded can be first to reach out in some way that only he and others are acceptable for the larger purpose TALKING to others about the failure that they have caused but need to turn back to!!!!","post_message":"One Milwaukee resident has a message for rioters destroying his community. And it completely DEFIES the liberal media's narrative."},{"comment_id":"1068079936600104","commenter_b":"Most Mexicans ARE Indians....there for they are home.....my people the INDIANS OWN THIS LAND!","commenter_a":"Dems are the ones dividing the nation by spewing their judgement and hate on all those that don't agree with their views.","post_message":"WATCH: Donald J. Trump hosts campaign rally at the Fox Theatre in Atlanta. @webpagelink"},{"comment_id":"10153452410792235","commenter_b":"LOL He is such a nut","commenter_a":"Ted, I prescribe driving your chevy to the levy...","post_message":"You mad, bro?"}]
