[{"comment_id":"10153535805923352","commenter_b":"You dumb wet back bitch and @username you ugly bitch go ahead. Pink monkey bitch","commenter_a":"He is though. What happened to \"freedom of speech\"? Oh it's selective I see.","post_message":"Female middle school teacher forced to resign after telling students that President Obama is a ‘Muslim baby killer’"},{"comment_id":"897189237043996","commenter_b":"No I hope not we need Hillary to run in 2016 . With all her baggage she will guarantee a Republican in the White House . She will be so busy trying to cover her tracks in crimes she won't have time to campaign ! And Billy's little visits to Orgy Island is going to be the next ship to sail !","commenter_a":"Hillary will walk all over him!","post_message":"He went to high school with Jeb Bush."},{"comment_id":"946602502043757","commenter_b":"She is not presidential material!!!","commenter_a":"This is one shady lady.","post_message":"\"But we also are extremely troubled by the events...\""},{"comment_id":"10153523815251636","commenter_b":"This Guy is a Catholic Hater. Think women are 2nd class humans. Would kill all LGBT if he gets the chance. Yet he's pretending to be the victim. Oh and always blame Israel.","commenter_a":"How many people will have the iraqi flag on their profile? More selective outrage from ..........","post_message":"More as we get it"},{"comment_id":"1284456268283154","commenter_b":"Take her down, NOW! Before the Election!","commenter_a":"Vote Trump! There is just to much evidence of serious corruption to ignore. She is a criminal and a traitor to America!","post_message":"This is the end of Hillary Clinton's campaign, and it's all due to Congressman Jason Chaffetz releasing damning new evidence that will make sure Hillary sees the inside of a jail cell. The FBI isn't ignoring this anymore. Let's get 2,000 shares to prove that America has spoken and we want Hillary behind bars."},{"comment_id":"10153127480747411","commenter_b":"That's what boobs are for, to feed your children. Yet women can walk around in boob pasties and thongs but that's ok, get real!!!!","commenter_a":"Proud nursing in public Momma right here.. never feel shamed. If you want to cover, go for it. If you want to go in private, do it. If you want to feed your baby in front of the world, go right on ahead. It's boobs people. But you have no problem with bikinis that show WAY more of most women than when nursing their child. Grow up","post_message":"NURSING MOTHER: POLICE SHAMED ME A Nebraska mother breastfeeding her 4-month-old son in public says an officer threatened to cite her for indecent exposure if she refused to cover up. What do you think about this?"},{"comment_id":"10153264215531051","commenter_b":"prison is to good for thay bitch","commenter_a":"How about in her not taking care of an American ambassador in Bengazi","post_message":"Question: Do you think Hillary Clinton is guilty of criminal wrongdoing in her email scandal?"}]
