[{"comment_id":"1148884565168237","commenter_b":"Snipers on the borders. Fill the Rio Grande with gators!","commenter_a":"build the wall close our borders down deport illegals out of America.","post_message":"For years, Trump and Bernie have both been saying that immigration policy is RIGGED by corporate special interests who want cheap labor."},{"comment_id":"1878063365760713","commenter_b":"All illegals have committed crimes, hence the term ILLEGAL!!!","commenter_a":"Trump is more concerned with illegals that have committed crimes and securing the borders if you think Trump is going to round up all the immigrants like cattle and send them packing then you haven't been paying attention to the news","post_message":"“There is a long tradition in American law enforcement of not breaking into churches in order to arrest someone unless the person is wanted for an act of violence,” Judge Andrew Napolitano said."},{"comment_id":"998201713572910","commenter_b":"Don't stop there. Get the rest of the scum","commenter_a":"How sad....","post_message":"Islamic State's chief singer-songwriter has been killed in an airstrike in Syria"},{"comment_id":"10153613777506323","commenter_b":"Women shave too.","commenter_a":"Shaving is no fun","post_message":"Periods aren't a luxury. Full stop."},{"comment_id":"10153525456151438","commenter_b":"I've saved this to read for later because I'm in denial. I will always remember Richard Dawkins the way he was in his Growing Up in the Universe christmas lectures.","commenter_a":"He might be a brilliant scientist and author, but he's also a bigoted asshole too filled with his own sense of superiority to recognize that he can be as much of an intolerant hypocrite as the religious extremists he (rightfully) criticizes.","post_message":"He’s charming in his books, but he picks fights on the Internet."},{"comment_id":"10152554042082623","commenter_b":"Girl bye lol","commenter_a":"It looks like a H.I.M. sticker lol also the pentagram/pentacle is an ancient symbol that represents the great spirit, and the elements air fire earth and water...upside down means nothing as there is no Satan and no Jesus. .... someone needs to read something OTHER THAN THE BIBLE HAHAHA","post_message":"A woman says she snapped a picture as soon as she spotted what she says is a symbol of evil in these school bus brake lights."},{"comment_id":"10154529062833132","commenter_b":"Your son probably won't even know what's going on unless he's seen the first one. Gtfo with your nonsense lady. I hope your son grows up to be a better adult then you.","commenter_a":"Cant they just leave the kids movie alone? Kid's dont need to see that. My son isn't going to see the movie now. I swear the gays have to take over","post_message":"Ellen DeGeneres is addressing the issue some people had after the recent Finding Dory trailer."}]
