[{"comment_id":"10153633951734170","commenter_b":"They are undocumented aliens.","commenter_a":"I find the term \"undocumented immigrant\" offensive. The press should stop using it.","post_message":"Epic VIDEO. Trump slams the proverbial door on a reporter who warns him that the term \"Anchor Baby\" could hurt someone's widdle feewings."},{"comment_id":"10153615779772452","commenter_b":"Fake IDs are already illegal. It's a third degree felony.","commenter_a":"17 and in a nightclub? Maybe now we should BAN fake ID'S. Should of never been there!","post_message":"One of the youngest victims of the #OrlandoShooting was 18-year-old Akyra Murray, a recent graduate of West Catholic Preparatory High School in Philadelphia. She graduated third in her class just last week. She was in Florida to celebrate her graduation and visit her brother."},{"comment_id":"788216704618375","commenter_b":"Sure he is Jewish but how could a man of his intellect believe the cartoon that created this shithole country?","commenter_a":"Put on your yarmulka even though it's not Chanukah....welcome to Israel.","post_message":"Welcome to Israel, Jerry Seinfeld ðŸ˜ðŸ˜ðŸ˜"},{"comment_id":"1086698044698949","commenter_b":"THINK ABOUT THIS ,TRUMP SAYS HE'LL ADD A 45% TARIFF ON IMPORTS FROM MEXICO AND CHINA ,STOP MONEY TRANSFERS OUT TO MEXICO TO GET THEM TO PAY FOR A WALL ,WE EXPORT 236 BILLION A YEAR TO MEXICO IF WE ADD A 45% TARIFF TO IMPORTS THEY WILL DO THE SAME ,BOOM! THOUSANDS OF PEOPLE OUT OF WORK !! CHINA IMPORTS 116 BILLION FROM AMERICA INCLUDING ALMOST OUR INTIRE CROP OF SOYBEANS ,WE MESS WITH THEM THEY GO SOMEWHERE ELSE ONCE AGAIN FARMS SHUT DOWN, FARM HANDS OUT OF WORK .WE'RE TALKING 1930'S STYLE DEPRESSION.WHY ?..........DONALD TRUMP WE IMPORT MORE FROM MEXICO THAN WE EXPORT TO THEM TRUE 5 BILLION A YEAR IS DIAMONDS AND PRECIOUS METAL,14BILLION A YEAR IN OIL,AND 11 BILLION A YEAR IN FRUIT,NUTS AND VEGETABLES ,YOU WANT YOUR FOOD AND FUEL COST TO GO UP 45 % IT WON'T BOTHER TRUMP HE'S WORTH 10 BILLION","commenter_a":"Our current administration is a joke. They have been living off of the tax payers for years without one concern for the US Citizens. People, wake up. Take a good long look at your life, are you living better now or five years ago? or even 10 years ago, Is your income the same, are you now needing to work 2 jobs just to make ends meet. People, we are now competing with our teenagers for the jobs we held as teenagers to learn responsibility just to make ends meet. Wake up people, I don't think this is what our parents believed was the American Dream. And we certainly aren't living better than they did. Think long and hard about your future and that of your children and the generations to come, will they have a FUTURE!!!!!!","post_message":"Whoa!! Do you still support Trump?"},{"comment_id":"1230461060352731","commenter_b":"Finish your comment. What type of women are these?","commenter_a":"I'm actually quite amazed at the amount of women attempting to justify this. As if abusive culture isn't hard enough on you. Just wow. Like demographic though.","post_message":"UPDATE: According to Rolesville Mayor Frank Eagles, the officer seen slamming a student to the ground is school resource officer Ruben De Los Santos, who has been placed on paid administrative leave. Follow this story>>wral.com/@username/"},{"comment_id":"1601162620179200","commenter_b":"Idiot. Build a wall","commenter_a":"Go back to Europe white folks... This is are land","post_message":"We're at a \"wall\" of taco trucks -- a protest in front of Trump International Hotel in Las Vegas ahead of tonight's final presidential debate."},{"comment_id":"773429869426968","commenter_b":"This is why the crooked libs are trying to let illegals vote. Another law breaking move. Criminals. That's what libs are.","commenter_a":"He is a waffler. Stop the insanity. Everyday. He takes a different stand. Go away. Please","post_message":"Trump's rally in Phoenix, Arizona immediately made headlines all over the country - and there's 10 big reasons why..."}]
