[{"comment_id":"10156021598895354","commenter_b":"And she is a witch and should be hunted-certainly not a good witch-her broom needs to be parked","commenter_a":"To think Obama and Bill Clinton are playing golf tpgether. I guess they feel shes going to jail anyway.","post_message":"So wait, you're saying Obama's Justice Dept. is conducting a politically-motivated witch-hunt via the FBI??? #NiceTry #LiberalLogic"},{"comment_id":"10154101126057680","commenter_b":"That's why we as black folk don't claim her ass! She can take a seat over there with O.J. and Tiger Woods!","commenter_a":"She is going straight to hell for stating people will BOW DOWN to that clown. Who talks like that????? OMG! Sad part about it ... she's oh, so serious. smh This chick needs to be mentally evaluated. Clearly, the elevator doesn't reach the top floor in that screwed up head of hers. Delusional is an understatement! She is so embarrassing ... :(","post_message":"Omarosa Injured at the White House, Reportedly Rushed to the Hospital on a Stretcher"},{"comment_id":"10154150780421028","commenter_b":"@username, she may be immoral and gross TOO but shes not running for president","commenter_a":"Just wondering if NBC will be firing Miley Cyrus from the Voice? There are some really raunchy offensive videos of her out there. Can't imagine why it's ok for her to put that filth out there recently, but he's being punished for something so old.","post_message":"Billy Bush is leaving the \"Today\" show following outrage over the leaked Donald Trump tape, the show's producer says. @webpagelink"},{"comment_id":"10153572594101051","commenter_b":"Gee, did you even graduate from high school????!!!!! You foul mouthed witch!!!!","commenter_a":"I dont blame them!! It probably sickens them that crazy angry trump uses their music while he talks his trash!!","post_message":"One of the world's most legendary rock bands just told Donald Trump they want nothing to do with him."},{"comment_id":"228156194316478","commenter_b":"Trump 2016, Trump 2020","commenter_a":"AND THAT'S Y HIS ASS GOT TO GO!","post_message":"WOW. Listen carefully... EVERYTHING she said back then was right! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155260669520557","commenter_b":"Death row is just fun. ;)","commenter_a":"Death is the easy way out, watch some of the programs on prisons Then you will feel better knowing that each and every day he or she will wake up in their 4x6 house shared with another body, no privacy to use the bathroom or get dressed, no delicious food and if their lucky can get through a shower safely. Every day they will think about what they have done and to me this is worst punishment than death!","post_message":"'I'm disappointed... he did not consult with district attorneys or consult with the families of victims whose lives have been torn apart by the people who have been sentenced to death for their actions,' Berks County DA says in speaking out today against Gov. Tom Wolf's moratorium on the death penalty in Pennsylvania."},{"comment_id":"10153206229641336","commenter_b":"You Carol, are a Goddess if you can swallow that orange whole! Puh-tow!","commenter_a":"Great. We need someone like him. He gets my vote.","post_message":"Vermont Senator Bernie Sanders is set to announce his decision to run for the Democratic nomination for the presidency as soon as Thursday, according to multiple reports. @webpagelink"}]
