[{"comment_id":"10158574220485206","commenter_b":"Ur a racist #sitthefuckdow","commenter_a":"We cannot wait for a Trump presidency. #WeThePeople must rise now & take back America which has been stolen from us!!! Trump touched me a year ago. He reached inside me and touched my heart and built a patriotic fire that flows deep through my veins and has given me hope that we can save America from the elitist New World Order Puppet Masters who would end our freedoms forever God bless Donald Trump!","post_message":"It would be a rare revolt."},{"comment_id":"10152702805232452","commenter_b":"No!!! Go away. ...far away","commenter_a":"Crystal Porras...No!!! Not SB!!","post_message":"A person who was being monitored by the Santa Barbara County Public Health Department for Ebola was being taken Sunday night to a Los Angeles area hospital as precautionary measure after displaying signs of illness. @webpagelink"},{"comment_id":"983254505089966","commenter_b":"I can't imagine any other first lady doing that. Both of them are not comporting themselves as befitting their roles","commenter_a":"Michelle is no rocket she looks like Ichabod crane","post_message":"What an embarrassment"},{"comment_id":"10153072153096157","commenter_b":"If you're here Illegally you Wil pay the consequences. Deportation!","commenter_a":"stupid question any of u talkers served","post_message":"The ICE operation would begin as soon as next month and would likely affect hundreds of immigrants who fled violence in Central America."},{"comment_id":"10154004343429440","commenter_b":"@username and if you call me sweetheart again, I will find you and feed you your balls. \"Figuratively\"","commenter_a":"Trump has the worst politfact record of any candidate for president ever. Hillary is among the best. Making all of your reports 50-50 so you don't have to listen to Republican whining distorts the truth","post_message":"Denver Post Politics takes a look at how Hillary's statements stack up to the facts."},{"comment_id":"10153389679411350","commenter_b":"the dirty creep is the one defending a perv family Linda!!!!!!","commenter_a":"Why is this even a question????","post_message":"Should TLC cancel 19 Kids and Counting?"},{"comment_id":"1072309979477455","commenter_b":"So basically she is happy wearing those 40 yards. If she wasn't she wouldn't be wearing it","commenter_a":"I hope she's happy wearing 40 yards of material everyday! Happiness is a warm burka....","post_message":"VIDEO: United Arab Emirates appoints first minister of happiness"}]
