[{"comment_id":"10154179155026051","commenter_b":"Yup","commenter_a":"Nop","post_message":"Do you think Donald Trump would be a better president than Hillary Clinton?"},{"comment_id":"10153725146380667","commenter_b":"no one cares I'm tired of heading about him","commenter_a":"People get punched in the face everyday.","post_message":"“He said he was going to kill me.\""},{"comment_id":"10153330634768128","commenter_b":"I saw her get whipped in Cali....she is weak.","commenter_a":"I would support Carly over Hillary. Carly has a record of solid leadership.","post_message":"The former Hewlett-Packard CEO will formally declare her Republican campaign online on May 4."},{"comment_id":"483635665160347","commenter_b":"Ban it out of our country!","commenter_a":"These black robe people are not making decisions that we like they need to Go.","post_message":"The Supreme Court just made a shocking ruling on Shariah Law. We must voice ourselves publicly, Shariah Law has no place in America. Do you agree Shariah should be banned?"},{"comment_id":"10154152866009575","commenter_b":"@username Maybe she did not know her hair was too long like to cover the screen? Where I live people ask me often to remove my hair from the seat at the bus because is too long so I have to because my hair does not move by itself. It is funny when they realize I am not a woman when I face them lol I say I am sorry and take my hair over my chest. No big deal and sooo what he was trying to watch anyway that was too mad, porn? hahahahaha :)","commenter_a":"People taking pictures and making a stink on social media instead of being an adult and asking someone to do something.","post_message":"An airplane passenger flung her ponytail over the back of her seat, covering the screen of the person behind her. That annoyed person snapped a picture and it's going viral. What are some of your biggest pet peeves?"},{"comment_id":"1069162493180002","commenter_b":"Black LIES Matter!","commenter_a":"Life is what you make it....if you obey the laws and live a clean life none of this would happen....put the blame where it belongs.","post_message":"\"The idea that there are tensions between police and particularly black youth is something that kind of went without saying.\""},{"comment_id":"892166267491828","commenter_b":"Why always Iran?","commenter_a":"Erdogan is a disgrace to Turkish people.","post_message":"Iran has summoned Turkey's charge d’affaires to hear Tehran's protest against Turkish President Recep Tayyip Erdogan's “improper” remarks regarding the Islamic Republic's alleged regional ambitions. Read more: @webpagelink"}]
