[{"comment_id":"1167878733267392","commenter_b":"Just a worthless pos","commenter_a":"What a loser","post_message":"Unbelievable! Michael Moore is now calling on liberals to disrupt and shut down Trump's inauguration. @webpagelink"},{"comment_id":"10156419798640354","commenter_b":"John Lansing Hillary is a right winger?? She is the queen of liars!1","commenter_a":"What a tool Brokaw is.. people actually saw it too.. WE KNOW who is spreading lies and it's not Donald J. Trump","post_message":"You saw what Tom Brokaw said on-air this morning, right?   If not, we've got the VIDEO for you here..."},{"comment_id":"10153416119358203","commenter_b":"WTF is wrong with these people? How could they do that to such an innocent life","commenter_a":"that's outright murder!","post_message":"‘This baby won’t stop breathing!’: Abortionist strangled baby born alive while nurses stood and watched"},{"comment_id":"10153461006671717","commenter_b":"Welp since all the lesbians I see on here basically think its hilarious, and a silly hearted statement meant with no hate or bias I guess you're just one of those super bitchy ' right to be offended' people that wake up everyday looking for a reason to be Cunty.","commenter_a":"I'm not buying it. I don't think the joke was just in good humor. There's enough language here to clearly see that he was being hateful towards the LGBT community. After all, he did say the word 'lesbian'. Isn't that enough to ban him and boycott him from everything? Shouldn't we be calling him hateful names for his aweful transgretions?","post_message":"Funny or die?"},{"comment_id":"10154243663794160","commenter_b":"I bet he's caring a lot more women. As a woman, couldn't vote for Clinton. As a woman, she's an embarrassment to women.","commenter_a":"I pray, I pray, I pray","post_message":"Donald J. Trump is losing female voters."},{"comment_id":"10156794589450231","commenter_b":"She looking like a dog tie her azz up","commenter_a":"Need her tubes snatched from her body...","post_message":"Pregnant mom arrested after 2 toddlers found tied up like dogs behind home."},{"comment_id":"10153314247693812","commenter_b":"She beautiful","commenter_a":"Amaxing love the smiles love technolgy","post_message":"Girl all smiles 6 months after major surgery to reshape her face with help of 3D printing: @webpagelink"}]
