[{"comment_id":"1389869284386873","commenter_b":"Nothing, absolutely nothing. Vote them all out, they deserve to be jobless.","commenter_a":"They took a lot of time off, which means they weren't doing even more stupid hurtful stuff.","post_message":"We'll wait.  Like Addicting Info for more great content!"},{"comment_id":"1174610022559026","commenter_b":"Build a wall , deport all illegal but no one will believe you","commenter_a":"Send them and their anchor babies home where they belong ,, Trump in 2016 ,,, I'll help with the roundup for free ,,,","post_message":"@JebBush faces Trump-led headwinds in attempt to change the GOP's tone on immigration."},{"comment_id":"979819422085921","commenter_b":"@username don't curse Canada with the likes of people like her. Send them to mexico!","commenter_a":"Just because a person is an actor/actress does not mean they know their head from their a$$ ... proof right there in that statement","post_message":"Americas Freedom Fighters"},{"comment_id":"10153649421859138","commenter_b":"Why would you post such a thing Dan??? Wtf?","commenter_a":"Meanwhile in Chicago this weekend, more people were gunned down by those whose lives matter. But let's not protest that.","post_message":"The Twin Cities Marathon went on today without major disruptions, and police did not make any arrests."},{"comment_id":"10152739973466519","commenter_b":"The Democrats are the snakes. Here come the eagles.","commenter_a":"At least the Republicans are growing a spine and starting to stand up to the Democrats properly rather than just whining about impeaching Obama.","post_message":"It took long enough, but here's how Obama realized that playing nice with Republicans is a sucker's game..."},{"comment_id":"1195382713852612","commenter_b":"Okurumoniwonba Orimekunluyi, you are an idiot. None of what you say is even remotely true. Please pay attention.","commenter_a":"If Elizabeth Warren called me she would certainly get an earful of how despicable she is. She would hang up on me but I wouldn't hang up on her.","post_message":"When Elizabeth Warren isn't busy holding special interests accountable, she finds the time to make some calls for Hillary. Join her: hillaryclinton.com/calls"},{"comment_id":"10154254253351336","commenter_b":"She's Nasty !","commenter_a":"White guilt is a real thing. Sad but true.","post_message":"“I’m a white lady. I’m an easy target,” Melissa Click said in an article."}]
