[{"comment_id":"1043060679149891","commenter_b":"The hell with Muslims! If you don't like our national anthem, you are free to leave.","commenter_a":"Immigration without assimilation is invasion. Get out!","post_message":"Claiming they are being oppressed..."},{"comment_id":"2077791549112023","commenter_b":"@username, They are both illegal, just being born here doesn't mean a thing if your parents are illegal to begin with. 2 illegals cannot make a legal.","commenter_a":"How did she get there? If she had to fly? I don't fly, don't you need an Id and if she has a letter to be deported, how does this work?","post_message":"Democrats just got busted violating federal law at the DNC convention. This is HUGE, but apparently the law doesn't apply to Democrats. Can you imagine if a Republican had done this?"},{"comment_id":"10153790561559407","commenter_b":"Eco tourism is the answer to the local economy of these communities, not hunting animals into extinction. Man has done enough damage to Africa. The west needs to stick it's hand in its pocket and spend the money to educate them and show them how to diversify their economy so they don't need to rely on sports hunting. It's not sport to hunt and kill these beautiful animals.","commenter_a":"The UN should encourage all nations to make it illegal for their citizens to go to Africa and hunt the Lion or any other African wildlife.","post_message":"A small victory for the king of beasts:"},{"comment_id":"10153709060366037","commenter_b":"She is a disgusting hypocrite!","commenter_a":"That's OK, Kim. You're getting what you really wanted all along. Attention. May your 15 minutes be over soon.","post_message":"\"What probably hurt me the worst is when someone tells me that my God does not love me.\""},{"comment_id":"10153987186985329","commenter_b":"Fuck off bitch","commenter_a":"Dorotea Lazio Batistoni I'm ded","post_message":"It's finally happened."},{"comment_id":"10150886165499999","commenter_b":"feminists are pro-islam, so of course this concerns them","commenter_a":"What does that word 'feminism* do here? Feminism does not say what you should or should not wear. Some feminists may have delusions of what is best for some, but it is still not the feminism itself, what people belive or does not belive.","post_message":"Our top 10 comments of the week."},{"comment_id":"10153396676558837","commenter_b":"What cracker dnt steal money there all crooks","commenter_a":"At Least in sweet water PD This is standard procedure","post_message":"OFFICER ARRESTED: Detective Armando Socarras, a 10-year veteran, was accused of taking $1,300 in drug money."}]
