[{"comment_id":"10154462849065695","commenter_b":"True and at the end of the day she going to be black im going to be white and nothing can be done about it. Oh and what the crap about drunk like most white girls? Yes that is a stupid remark","commenter_a":"Wow Sabrina why even make it a race thing.","post_message":"Police are asking anyone with information about what happened to Brenda Arreguin to come forward."},{"comment_id":"967043476669844","commenter_b":"I heard it was originated by harem members trying to catch the attention of sheiks so fat the women had to do all the work!?.","commenter_a":"There are spiritual aspects to female sexuality, this is where belly dancing comes from...before it was a way for women to show their sexual fertility to their husbands it was a practice done by female worshipers of the snake goddess. Not sure but to me this seems like a modern take on that...in most cases such dancing is done for the benefit of men. But when it is done to express one's sexuality in a personal way, it does have an empowering effect. It suggests that a woman's sexuality belongs to her and doesn't need a male audience to be valid.","post_message":"I never thought a pole-dancing video could be such a tearjerker. Man, was I ever wrong! - Andrea Garcia-Vargas"},{"comment_id":"10153698610918132","commenter_b":"She is a jerk","commenter_a":"Yeah, God forbid anyone may ever be inconvenienced. Typical Americans -- it's all about ME ME ME. 'Oh my gawd! My dinner was ruined because a toddler was crying! I want my money back! Boo hoo!!!!'","post_message":"Nope, not sorry."},{"comment_id":"10157633958190389","commenter_b":"'@username IDIOT.","commenter_a":"I'm voting Donald Trump and I will not let the media influence me. Yes he has made some clear mistakes in his campaign with 'words' but, Secretary Clinton has made clear mistakes multiple times with ACTIONS. She's a politician, getting paid by Saudi, Benghazi, getting paid to speak, email server, the list goes on. BUT, Trump showed more heart last night then any candidate I have seen; not because he wants power but because he cares for you & me. After seeing Lester Holt TRY to demolish trump, it did hit me, that the media does have power, and will do anything it takes to get what they want.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153606211671509","commenter_b":"Gee I wonder where he gets his behavior from ?","commenter_a":"Good job mama :) the world needs more like u","post_message":"What do you think of this mom's actions? Taking matters into her own hands, her son got a heavy dose of discipline on live TV: @webpagelink"},{"comment_id":"10155472847782178","commenter_b":"This about sums up his platform. To bad his plans don't include everyone. Especially when it comes to healthcare. Did you know that if Obama care is rebuild and replaced if you have a pre-existing condition then you cannot get medical coverage just like before during the Bush administration","commenter_a":"Truth! Dirty Donnie is playing us like a fiddle! All about him so he can make $$$$! He is not FOR anything but himself! Do you really think he is for you blue collar workers or the struggling middle class? Once he gets what he wants, he'll throw you to the gutter like a piece of trash. He is all about the $$ going into his pocket. His 'plan' would put the workers back into the industrial age. Company town and company store, no unions, no rights, keep your mouth shut and just maybe you won't get fired, thrown out of your home, and dumped on the street! Tax cuts for the rich and everyone else can pay for it. Build a personal defense for to consolidate his power, throw opponents in jail, purge the government of the opposition,and align himself with his buddy Putin! Run away from NATO allies ...","post_message":"Donald Trump's priority today is clear: His personal brand and business."},{"comment_id":"10156346841015725","commenter_b":"Build the wall","commenter_a":"America should close the borders. You do not lock the front door of your house because you hate the people outside. You lock it because you love the people inside. A country's border is its front door.","post_message":"From South Carolina last night- this is what I call a real supporter! #MakeAmericaGreatAgain #Trump2016"}]
