[{"comment_id":"10153394655753908","commenter_b":"is anyone here surprised by this information?","commenter_a":"Get a grip","post_message":"For those who haven't seen this yet. \"Ever single terrorist attack in the US was a false flag attack.\"  There is a tremendous amount of research to back up this statement."},{"comment_id":"1576025939362143","commenter_b":"This is America not European dont like America go back to European take DONALD TRUMP with you ok gringo","commenter_a":"Why are people dumb enough to think people who do not want illegals in the US hate Mexicans? Or any other foreigner? It is ILLEGALS that they want to regulate, no those entering the country legally. We could do without the wall, just get more Border Patrol and more bullets...and do like other nations, shoot those crossing illegally, maybe that would satisfy the supporters of illegal immigration... Read up on Mexico's illegal immigration law.","post_message":"Former Mexico President Vicente Fox is sorry, not sorry about his big middle finger to Donald J. Trump and his proposed wall along the U.S. southern border."},{"comment_id":"488489361275658","commenter_b":"Don't think she will get off easy this time.","commenter_a":"She will get off easy because she's a cops wife","post_message":"A cop's wife did this to another cop's wife. I wonder what on earth she was thinking!"},{"comment_id":"10153740264340667","commenter_b":"This woman is unethical and unprofessional and immoral @webpagelink","commenter_a":"It's not just him who sees it. Many people see how biased and one-sided the media is. Very unprofessional. No shame left. I'm not against anyone here. I simply criticize the corrupt system.","post_message":"Not the first time it's happened this election cycle."},{"comment_id":"10153331361449228","commenter_b":"I give up on our government and justice system. You mess with me or my family I'll kill you! There is no more calling the cops to help. I'm done! I can't belive this. My advice to every woman is get your cc and protect yourself!","commenter_a":"Police were still looking for him....I believe he will now be found dead from suicide..","post_message":"She was found with her teenage son.  Police are looking for this man"},{"comment_id":"1104831912912258","commenter_b":"Muslims are scum!","commenter_a":"Check google about this. On site it says mother told husband to hit 10 year old if she denied her husband sex. Under Yemeni law this is not rape, wife's duty. Most sickening nationality. Her own family says face up to her duty and honour families commitment, don't shame her family. One girl 10 years old got away, went to court and filed for divorce. She won, husband was not prosecuted for raping a child, he was paid $200.00 compensation. Many of these kids die from bleeding to death from sex or during child birth.","post_message":"Why isn't Barrack Hussein Obama talking about this???!!"},{"comment_id":"1260941960612940","commenter_b":"To unite for all the right concerns all of them with us in mind because is 100% for and by the people...please for your families...you have to check learn help in anyway you can act and share and share again...because species are disappearing everyday...everyday...for you your loved ones for the nation for the world the planet..hiring humans for humanity and peace for all not the few...www.jill2016.com","commenter_a":"What a lot of people don't know about Trump that support him is, that those same people would not survive him ...Trump would even eat his own kind....it's just his nature.","post_message":"This teen just figured out the perfect question to start asking Trump and his supporters."}]
