[{"comment_id":"10154473881370329","commenter_b":"Ivan Roy Rasmussen YESS!!!!! Hahahahaha","commenter_a":"Katie KocajSierra Weiner squid ward tortellini","post_message":"\"Am I a pretty girl?\" // SpongeBob SquarePants"},{"comment_id":"472128496314627","commenter_b":"Yeah lol she cray","commenter_a":"She was talking all kinds of mess about Prince. Maybe someone scooped her up for interrogation.","post_message":"Irish singer Sinead O'Connor was reported missing Monday a day after she went on a bike ride in the posh Chicago suburb of Wilmette and did not return."},{"comment_id":"1118917194866740","commenter_b":"Thanks for stating this. I'm a follower of Christ and so glad you get it about Tebow.","commenter_a":"I'm not a Tebow fan, or a Florida Gators fan, or religious. But I never understood the hate directed at what seems to me to be a decent human being that threw his actions has shown hes willing to help anyone. Funny my fellow Athiest scream about this man \"shoving his faith in our face!\" Don't seem to mind shoving their Athiest views down everyone else's throat.","post_message":"\"The goal of this book was if you pick it up with your head down, you finish the book with your head held high knowing that God has an awesome plan for your life, you matter, and you're important -- and that's a bigger identity than anything that the world could ever offer.\" — Tim Tebow on his new book \"Shaken\""},{"comment_id":"925749584134949","commenter_b":"May they name a FEMA camp after you. What a totally ignorant woman you are! Unbelievable!","commenter_a":"You need some solid intelligence. We had these under Bush , he is the one who stated war and depleted the reserve funds. Obama replenished them. I am happy to have such a high IQ, highly educated president with multiple graduate degrees including a Doctorate in Constitutional Law. He even taught it at Harvard. I have worked on secure govt projects . The govt can show power to those in the Middle East . Fox News? keeps the fear mongering going. It has a 20% accuracy rate. The elites are the Koch brothers & Corporate powers. Get a reality check!","post_message":"In case you missed it, here's the top story from Tuesday: The recent exposure of the nationwide Jade Helm 15 exercise has made many people suspicious, and with good reason. Federal crisis exercises have a strange historical tendency to suddenly coincide with very real crisis events. The elites are clearly preparing for something big. When the elites wage war on America, this is how they will do it: They will control public opinion, control the public, isolate population centers, decapitate leadership, and initiate fourth-generation warfare. Crisis is the best weapon the elites have at their disposal, and exercises like Jade Helm show that they may use it in the near term. The defense that defeats crisis is preparation — preparation not just for yourself, but for others around you. War is coming, and while we can’t know the exact timing, we can assume the worst and do our best to ..."},{"comment_id":"10153199958166051","commenter_b":"The bitch is lucky to be alive","commenter_a":"Why sue the apt for our own stupidity??? You don't block windows with any furniture you know in case of FIRES!!!! Geeze what a stupid smuck","post_message":"This woman fell out of bed, though an open window and three stories down to the hard ground below. Now she's suing."},{"comment_id":"992176534225146","commenter_b":"Then pick that worthless POS Hillary.","commenter_a":"You can say trump is the lessor of 2 evils but if you think trump will be a good president you are a moron","post_message":"Here's what we've learned from undercover videos. Is this how our next President will do business? @webpagelink"},{"comment_id":"907515899315838","commenter_b":"Thought it was Vermont?","commenter_a":"And yet the latest FBI Uniform Crime Report shows that Maine is the safest state in the US. Hmmm...Coincidence?","post_message":"They're quarantining themselves!"}]
