[{"comment_id":"10153246182423188","commenter_b":"She allowed her cheeks to hang out. This woman POSTED this video to YouTube. They clearly received the attention that they were seeking.","commenter_a":"Michael shouldn't have posted a pic that shows a woman's butt cheeks hanging out, @username. I'm surprised as a Christian you condone this.","post_message":"My wife and I are laying in bed talking about this non sense with Michael Bublé and she pulled up something a girlfriend sent to her.  Holy cow!  Some people are just Shoot milk through your nose funny without trying.  Look out.  What follows makes Michael's butt cheek photo look like a bible pic.  Excuse the title on youtube.  No profanity on vid.  @webpagelink"},{"comment_id":"1489236791096346","commenter_b":"Only 7% of the illegal aliens work in the fields, most work in the construction jobs, fast foods etc etc. 95 million unemployed americans need jobs, deport all illegal aliens and open up jobs for citizens not criminals.","commenter_a":"Hey Trumppets if you need a job...go apply in the fields....there's always jobs available! You got a teen that needs work, send them to pick out in the fields....give them those American jobs you ppl keep claiming immigrants are taking away!","post_message":"Donald J. Trump doubled down on his stance on immigration this week. Here's a breakdown of U.S. immigration by the numbers.  Read more about Trump's immigration speech: @webpagelink"},{"comment_id":"1011822325526221","commenter_b":"Iran needs to get with the times. You se to want tourism but then scare people off by arresting people for no reason. Wake up!!","commenter_a":"generally muslim men under lucifer Allah do not respect women very well, look obama does not he muslim islamic religion","post_message":"In recent years, debate in the west has largely focused on the more visible aspects of the status of Muslim women and Islam, with many claiming that women have fewer rights than men."},{"comment_id":"10156940473490354","commenter_b":"She was having plastic surgery!","commenter_a":"Where were you Maria, when Obama was proposing this last year. That's when you should have objected! It's too late now!","post_message":"BLISTERING..."},{"comment_id":"898000640266692","commenter_b":"True sir but he a bitch for that lol","commenter_a":"If he would have kept talking he could have ended up dead. People man have no chill, calling dude a bitch. He avoided confrontation!","post_message":"Cop Goes On A Major Power Trip After Being Asked A Simple Question!"},{"comment_id":"10153230104286051","commenter_b":"I agree with that woman keep your garbage with you","commenter_a":"Just a ? For all who are being so harsh. Witch one of you would want that sign by the grave of your loved one. I sure wouldn't want it by my nephews grave. He died from a drug over dose. Oh yes I fully understand and can see both sides.","post_message":"These grieving parents went to visit their teenage son's grave one day when they noticed something on a tree behind his headstone."},{"comment_id":"10153885880700667","commenter_b":"His wife is an idiot","commenter_a":"He is still body shaming this woman? Really Trump?","post_message":"\"I saved her job because they wanted to fire her for putting on so much weight.\""}]
