[{"comment_id":"10153717683207894","commenter_b":"@username Nobody's voting for Hillary? Why does she have 3 million more votes than Bernie??? I'll wait","commenter_a":"I don't know why people spew unnecessary hate for this woman, She has millions more votes than Bernie and is the better between her and Trump. What did she do so bad to you all? Bernie Sanders got yall head messed up. And that whole Bernie or bust thing is IGNORANT as hell. Writing in Bernie Sanders name is basically a vote for trump, smh","post_message":"Hillary Clinton Reaches Delegate Count, IS the Presumptive Democractic Nominee for President"},{"comment_id":"10152939538841051","commenter_b":"what a stupid bitch duh","commenter_a":"It seems to me that they have no control of their sexual needs and have to use children because they can't get anyone their age to have sex with.","post_message":"This woman thought the photos she sent via Snapchat would disappear. Well, they didn’t. Police took one look at them and had all the evidence they needed."},{"comment_id":"1750985641784496","commenter_b":"What that is the craziest thing I have ever heard he's not racist just because he wants to build a wall and stop Muslims from coming into the country until we have a better way of verifying documents he said nothing about that","commenter_a":"are you kidding me. assama has set this country back 50 years","post_message":"Democratic leader says Donald Trump will bring back segregation.  Is he being this obtuse on purpose, or does he really believe this? #TTT16"},{"comment_id":"959095867528667","commenter_b":"I want to hear the story too","commenter_a":"Trump fix SS","post_message":"DML discusses the best way to fund Social Security, and how the media disrespects veterans.  Please watch and share."},{"comment_id":"10156385367815354","commenter_b":"Stop the influx NOW!!! It's sheer INSANITY!!!","commenter_a":"how do we stop Obama from doing this?","post_message":"“President Obama and Hillary Clinton’s idea that we should bring tens of thousands of Syrian Muslim refugees to America is nothing less than lunacy...I recognize that Barack Obama does not wish to defend this country, that he may have been tired of war, but our enemies are not tired of killing us, and they’re getting stronger....\""},{"comment_id":"10153147185484342","commenter_b":"Bruce Jenner is a woman, this lady is black, and I'm a billionaire.","commenter_a":"Since she was 5? Then this just didn't happen since she entered into adulthood. She had a identity problem since she was a kid and I blame her parents on that because they should've noticed it way back then. To all you parents out there who have little kids, pay more attention to your kids.","post_message":"\"I was drawing self-portraits with the brown crayon instead of the peach crayon.\"  #RachelDolezal has broken her silence, saying she started identifying herself as black around the age of 5."},{"comment_id":"10153115200467217","commenter_b":"He would embrace you but insist you stop sinning if his embrace is to continue . John 5:1-14..\"SIN NO MORE\"....","commenter_a":"Gemma Dunnell homophobes Homophobes everywhere","post_message":"\"I found a relationship with God... right around the same time I realised I was gay.\""}]
