[{"comment_id":"10153048383476336","commenter_b":"women are beaten in the us lot more than in the arab countries","commenter_a":"She won't get hurt... this guy is not isis ... he is just a scholar. .. she tried to make a point but he was right they promised him more time to get his point clear... they had no patience both because the show time was short just a huge misunderstanding. .. people like him show Islam bad because he wasn't showing Islamic real manners ... he was disrespectful and impatient. ..","post_message":"We may have found the Middle Eastern Megyn Kelly."},{"comment_id":"694654787391766","commenter_b":"I'm suprised that asshole can even find a bathroom.","commenter_a":"The worst President in US history.........","post_message":"ISIS has officially declared they are coming to America. Obama needs to step up before it’s too late. Is Obama unfit to handle this situation?"},{"comment_id":"2179339492291943","commenter_b":"Stick that thumb up your assssss.....","commenter_a":"Bang bang trumpty","post_message":"Trump wants guns in your classrooms, but not at his inauguration."},{"comment_id":"1786796021584513","commenter_b":"Pathetic human being","commenter_a":"You are wasting your time.","post_message":"Madonna said she \"will not back down.\""},{"comment_id":"1553198684973790","commenter_b":"LOSERS! ONLY TRUMP FOR PRESIDENT!","commenter_a":"Trumps my guy!!! GO","post_message":"Washington insiders and politicians have failed America. If I am elected President I will create jobs, end illegal immigration and #MakeAmericaGreatAgain. #Trump2016 Support Trump: @webpagelink"},{"comment_id":"10153484638827507","commenter_b":"Whining lil Bitch!","commenter_a":"Activist farmers? REALLY?! They got time for that shit?! I have a better idea, STOP suckling from the federal ethanol teat, get back to your damned fields, and grow the crops that feed the people!!!! I hope that you make a fortune, the HONEST way, and keep your damned MORONIC racial political opinions to yourself!","post_message":"This is important."},{"comment_id":"10153135601604575","commenter_b":"If they come here legally and are not criminals then they should be allowed to become citizens but if they just plan on breaking laws and feeding off everyone's tax dollars then no they should be shipped out regardless of where they come from.","commenter_a":"Well that sucks. Aside from the idiotic general opinion of the public, I've met more illegals that really want to be here to work and provide a better life for their families. Unlike many of the current inhabitants of this country that just can't wait for the first of the month for that government check. And let's be honest, we're a country of immigrants. Seems a bit hypocritical. And on the plus side at least immigrants want their children vaccinated.","post_message":"Thousands of immigrants seeking legalization through the U.S. court system have had their hearings canceled and are being told by the government that it may be 2019 or later before their futures are resolved. The increase in cancellations began late last summer after the Justice Department prioritized the tens of thousands of Central American families and unaccompanied children crossing the U.S.-Mexico border."}]
