[{"comment_id":"10157199580185231","commenter_b":"Congratulations!","commenter_a":"Congratulations","post_message":"This will make her the first African American recipient in the award’s 21-year history. Congrats Gwen Ifill!!"},{"comment_id":"10154097655775736","commenter_b":"Threatening our non violent non threatening neighbors with war just because why not! Grounds for immediate impeachment!","commenter_a":"And there's no bad hombres up here?","post_message":"\"You have a bunch of bad hombres down there,\" Trump told Mexican President Enrique Pena Nieto, according to the excerpt seen by the Associated Press. \"You aren't doing enough to stop them. I think your military is scared. Our military isn't, so I just might send them down to take care of it.\""},{"comment_id":"458263531022194","commenter_b":"I sure don't consider Ann Coulter a Patriot! She is a vile and hate spewing!","commenter_a":"What an ass!","post_message":"Even for Coulter this is outrageous."},{"comment_id":"889715544460386","commenter_b":"So tired of this progressive rant. If you come here illegally you need to go home. PERIOD!","commenter_a":"Are they trying to lose the election?","post_message":"She says the holiday-season roundups were \"mass deportations\" that are sowing \"division and fear.\""},{"comment_id":"10154054920697093","commenter_b":"Just let this crazy lady live in her imaginary world.","commenter_a":"I feel the closet racists gathering on this post.","post_message":"Small protest happening now at the old Tarrant County Courthouse in response to the Fort Worth viral video arrest. bit.ly/2hYduuA"},{"comment_id":"10154136361277293","commenter_b":"@username Oh! Just saw the guns!!!! You can live in your own basket. Would not want you as my neighbor. I'll live near a refugee.","commenter_a":"All these \"deplorable\" comments make me truly ashamed of my fellow Americans. SMDH at all the lies, irrational hate and fear mongering.","post_message":"Kerry told lawmakers \"that if it is possible to do more\" in terms of accepting refugees, \"we would.\""},{"comment_id":"1051072661621517","commenter_b":"Get them the hell out of America!","commenter_a":"Sadly delusional.","post_message":"THIS IS ISLAM: Typical Muslim Cockroach  And Tortures Co-Worker For 5 Days To Make Her Convert  @webpagelink"}]
