[{"comment_id":"1512686248764628","commenter_b":"Oranges are offensive, they resembles balls, likes men's balls! such a coincidence that white males eat oranges?! patriarchy for sure","commenter_a":"This article is very misandrist and perpetuating the matriarchy. All men are handsome inside and out. Try being more accepting, less shallow, and do less femsplaining UGG #triggered","post_message":"'If someone was quite a weird child, he tends to be a great date.'"},{"comment_id":"10154689824655575","commenter_b":"get rid of this bitch","commenter_a":"Morons","post_message":"Is Jill trying to keep the money rolling in?"},{"comment_id":"1789900814667772","commenter_b":"She needs to leave this country ....POS !!!","commenter_a":"Idiot!","post_message":"Actress and activist Ashley Judd delivered harsh words aimed at President Trump from a poem written by a 19-year-old girl from Tennessee."},{"comment_id":"10153090058473984","commenter_b":"Fry her dam ass","commenter_a":"GOOD!!!","post_message":"She probably thought she had gotten away with it. Not so fast, Hillary...  Should she face criminal charges for this?"},{"comment_id":"1332904726749996","commenter_b":"It'll never happen - no minorities, no women. He would need 80% of all the white males in America to vote for him.","commenter_a":"This ad isn't even a reliable ad. It's a lying rag. Not been anything on news about this. So it's just another lie. Wake up idiots Trump will be President, no matter what so get use to it. Go Trump","post_message":"Wow...this isn't good for the Republican party."},{"comment_id":"10153717076186680","commenter_b":"Hillary Clinton is unfit!","commenter_a":"Odummy you aren't fit to tie Trumps shoe laces sorry doesn't even begin to describe you.You are just a halfbreed SOB that got elected for your skin color nothing more.","post_message":"President Obama on Donald J. Trump : 'The Republican nominee is unfit to serve as president.'"},{"comment_id":"10156577107260725","commenter_b":"Rand Paul is already crying he is your typical corrupt out of touch Washington politician. He wants to rid us of the US military. So that jerk will be at the debate.","commenter_a":"I can make a difference between Winning & Losing & i really want Donald Trump to Win. I have lots of valuable inputs to give. How do i get in touch with you. Warm Regards, @username...","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
