[{"comment_id":"10153662620879877","commenter_b":"So that make it cool huh ? Betta keep close eye on ya little one bro ^^^^","commenter_a":"So you found people unconscious, didnt call an ambulance or anything you shot them . That's murder.","post_message":"Black Couple Killed by Police Were ‘Unconscious’ Inside Their Car When Officers Arrived. Watch what happened next below.   Grio fam, what's going on here? Seven children are now without parents..."},{"comment_id":"10153242618583132","commenter_b":"First Dr. Nancy Snyderman and now Brian Williams betrayed us!","commenter_a":"Yea a permanent one lol","post_message":"Brian Williams tells staffers that he is taking a break from NBC Nightly News amid his recent scandal."},{"comment_id":"10154177421583734","commenter_b":"OK, toss in Jesus too, and all the Angles, and it still won't get him the Seat.","commenter_a":"He could have God running with him . He still has no shot at winning","post_message":"Do you think Fiorina was a good choice for Cruz?"},{"comment_id":"10153986219495950","commenter_b":"You must be getting paid a pretty penny, lady. #HillaryForPrison2016","commenter_a":"Wikileaks, Hitlery's thugs throwing bombs, stinking libtard filth?","post_message":"“I’m very excited to see Hillary become president,” gushed Natalie Portman."},{"comment_id":"860452347398311","commenter_b":"What an idiot, can she really be this stupid? If this passes for high intelligence, I must be a genius","commenter_a":"You really cannot fix stupid","post_message":""},{"comment_id":"10153866991751130","commenter_b":"@username You racists seem to always LOL, when you are exposed.","commenter_a":"Love this idea. I hope all the black LIES matter racists move to Canada. They can take all the haters, like Al Sharpton, Jesse Jackson, Louis Farrakhan, and Comrade Obama with them.","post_message":"Canada's black guy weighs in on race and politics in the U.S.  The Canada Party  Outspeak"},{"comment_id":"10153149110684877","commenter_b":"Yes, she should be arrested. This type of crap gets people killed.","commenter_a":"She deserves prison time.","post_message":"Woman claims she was attacked by black men, allegedly faked injuries with makeup. She TRIED it! You have to see the pics for yourself.   Grio fam, should authorities press charges if it's proven she faked her claims? Sound off below!"}]
