[{"comment_id":"10154275464344024","commenter_b":"@username You stfu!","commenter_a":"It's so nice to see that Black Lives Matter to Black People!","post_message":"Two people were killed early this morning, and several others were wounded, in a shooting at a Halloween party in Newburgh, Orange County. Details: @webpagelink"},{"comment_id":"10154125251399726","commenter_b":"Trump quick build the wall!!! Try to stop them. There is nothing wrong with Ford investing where they want. It's a great big world. We used to lead it and WELCOME business and capitalism and now we just take and tax to DEATH. Maybe if Mexico has something like Ford, creating jobs, it could slow off the illegal immigrants.","commenter_a":"then tax the vehicles made in that plant","post_message":"Ford announced Tuesday that it is investing $1.6 billion to build a new plant in San Luis Potosi, Mexico."},{"comment_id":"10153123096616770","commenter_b":"They'll leave on their own !","commenter_a":"Send back the illegals!","post_message":"Donald J. Trump wants a “deportation force” to remove the illegal immigrants currently living in the United States."},{"comment_id":"10153184116079330","commenter_b":"She is just the white female version of what we already have. Time for a woman, yes, but not time one!","commenter_a":"Way to go Hillary - We need a lady in the white house and get rid of the Joker that is there now.","post_message":"Sources tell NBC News that former Secretary of State Hillary Clinton will announce her candidacy for president of the United States \"as early as Sunday.\" ---> nbcnews.to/1FHI9C6"},{"comment_id":"598181650332929","commenter_b":"If this is a representation of the caliber of people America is attracting we're in trouble. It's obvious that we seem to attract a large criminal element, and what does that say about America??? It says we're soft on immigration and soft on criminals, it also says that our Social Services are out of control and way too generous. Trust me these illegals KNOW that they well be given everything for free !!!! and that they can yell Police brutality and that they can do anything they want and get anything they want...welcome to liberal socialism..","commenter_a":"Pigs go to market","post_message":"I agree!"},{"comment_id":"10152898071811336","commenter_b":"illegal aliens no doubt !","commenter_a":"Are you kidding me, do parents have any responsibly any more.","post_message":"The nation's second-largest school district is eyeing a move to offer dinner to students at every school."},{"comment_id":"10154362244534778","commenter_b":"This is a symptom of disrespect. Did the office overreact, perhaps. What do you do with a teenager that doesn't listen to authority? Continue to let her disrupt the class? This girls deserves to be punished. She may have gotten hurt because of her initial defiance but she is not a victim. They should review the incident and I hope they clear the officer of everything and I hope they give the girl detention. If we don't stop the disrespect, the result is anarchy.","commenter_a":"This kid did not attack anyone she may have ignored commands peacefully as most protestors will do but in no way is that a crime. The violent attack from this cop was in fact a crime.","post_message":"About 100 students wore T-shirts reading \"Free Fields\" or \"#BringBackFields.\""}]
