[{"comment_id":"10152584446122014","commenter_b":"No money for illegals!","commenter_a":"He's not an immigrant. He's a POS rock-throwing illegal alien coyote that's had 14 prior incidents with the border patrol.","post_message":"The judge ruled that the officer was not justified in opening fire on the immigrant who was crossing illegally into Arizona."},{"comment_id":"10155308331690354","commenter_b":"If these 400 men are really that stupid...do we really want them populating the world anyway?!","commenter_a":"I wasn't aware obama was a follower","post_message":"Other than charisma, how does one convince 400 men this is a good idea?"},{"comment_id":"1308657809199446","commenter_b":"Please! Let her stay home.she's not needed there are many others to take her place.","commenter_a":"Let her stay home.","post_message":"One of the dancers felt \"embarrassed and disappointed\" by performing at Trump's inauguration."},{"comment_id":"10153397415338984","commenter_b":"Guess you are be careful about who you ask to suck your dick!","commenter_a":"Very old","post_message":"Watch what happens when this bully starts a fight with the wrong guy... he didn't see this coming.  The cameras caught this entire fight... Are you happy he got a giant slice of justice?"},{"comment_id":"10156286873240389","commenter_b":"As Hillary Clinton would say \"What difference does it make\".....NONE!!! #DefundTheGOP!","commenter_a":"Welcome back John Boehner!","post_message":""},{"comment_id":"1016519435107777","commenter_b":"Yes, and the idea that we should force women to wear a veil in the USA makes me physically ill. Women are NOT 3rd class citizens, which is what they are in strict Muslim households!","commenter_a":"There are many women who are voting republican because they are against abortions and they do not believe PP is anything other than there to do abortions. At age 72 I am with Stevie. I think we worked too hard to go backwards. I remember when I was first married there were states where it was against the law for a woman to use any form of birth control other than abstinence. If abortion is outlawed, how long before birth control will be outlawed.","post_message":"TRUTH."},{"comment_id":"633195336830149","commenter_b":"Illegal invaders","commenter_a":"Feed them, clothe them. Try to teach them in our schools. Send them back where their parents came from.","post_message":"Where are their parents?"}]
