[{"comment_id":"10153579142479170","commenter_b":"she's never right !","commenter_a":"Sorry the American voters frustrated you. You can just stay home and learn to deal.","post_message":"According to Hillary, we're all just too stupid to understand how brilliant she is. She gets frustrated by that, and admits that her frustration is her \"greatest weakness.\""},{"comment_id":"1052877944789070","commenter_b":"Hillary Clinton is more smarter and experienced lady rather than her opponents, she worked in government on different positions as well as in different conditions. As soon as she become President, she will require very short time to implement her plans. #Germany has Lady Chancellor, #UK has Lady PM, now it's time for #US to have Lady President. I am not against Donald Trump and also agree with his views regarding migrated people's who cause Terror activities, Hillary too must think on this issue. No one can't risk it's own people's life for other nations innocent people. In Europe, France and Germany already paying for it...","commenter_a":"Yes!!! And then you can try to explain to your child why the first \"Woman President\" is being investigated for her actions. Then you get to try to explain impeachment. And then how to dig out of the hole of \"Well I guess girls can't do the job.\" Little kids don't get politics. That is the job for adults. And if you as an adult vote for a woman who lies, cheats, and puts her privacy above the security of the nation, then you get to pay for it down the road. But you have a choice vote Jill Stein. 2016.","post_message":"\"Mommy, how come they're all boys?\""},{"comment_id":"1155384687884221","commenter_b":"That's what you get for working for him.....I wonder if he ever payed the little girls who sang and danced for him for a rally","commenter_a":"Trumps motto : if you're stupid enough to trust me you get what you deserve.","post_message":"If you work for Trump, you're going to get burned."},{"comment_id":"10153074507087908","commenter_b":"Only Decent Republican President lol !!! @webpagelink","commenter_a":"Today, Ike would be a center-right Democrat.","post_message":""},{"comment_id":"10154314532254218","commenter_b":"Gee thank you,I haven't heard anything about Freddie Grey for at least 10 mlnutes!!","commenter_a":"She's a joke... Disgrace to Maryland","post_message":"The trials of the six Baltimore City police officers charged in the police in-custody death of Freddie Gray are still ongoing."},{"comment_id":"10153790439861680","commenter_b":"This woman should shut up since she and her husband were just as corrupt as the current one!","commenter_a":"Mexico is a cesspool. There's nothing we need from them but they rely on everything from the USA. We've bailed them out so many times and the American Government is making taxpayers flip the bill for Mexico's $50 billion bailout. Build the wall, tax their imports and tax the $35 billion the illegals are sending through wire transfers a year. Punish companies leaving the USA and moving operations to Mexico and over seas!","post_message":"\"Mexicans have dignity and repudiate his hate speech,\" she writes."},{"comment_id":"1731115690475220","commenter_b":"She should just go NOW!!!","commenter_a":"Another nut.","post_message":"Barbara Streissand says she's joining Al Sharpton and leaving the country if Donald Trump becomes president. Would you miss them?"}]
