[{"comment_id":"890220867779354","commenter_b":"I'm sure she doesn't care. She's a coon. They love being used and abused by white people","commenter_a":"Maybe she didn't swab his knob as good as the other women at Fox News","post_message":"Ex-Fox News CEO Allegedly Referred to Stacey Dash as 'Mean Black Girl'"},{"comment_id":"10155325034607439","commenter_b":"Women will be wearing them just to be so called fashionable","commenter_a":"YUK","post_message":"Fascist fashion. It's just plain ugly. Anti-fashion, anti-woman, anti-beauty."},{"comment_id":"10153339835009087","commenter_b":"Does this apply to Christian refugees too ?","commenter_a":"youtube title; William Blum - CIA murder and torture of Hundreds of thousands of people...use transgenders & lesbians deuteronomy 22:5 man should not wear the headdress of a woman & a woman should not wear the headdress of a man... youtube title; Collapse of Europe and the United States Of America ...vengence is mine say the living god psalms 104:16 of israel who's name is JEHOVAH deuteronomy 32:35 & romans 12:19-21..john hopkins mount sinai nyu medical bellvue hospital fraudulet med scam bill penis breath clinton irish shit god of luck death trap robert & patrick kennedy section 508 mental illness research nazi's... article title; The Clinton Crime Family...vengence is mine say's JEHOVAH the god of israel deuteronomy 32:35..bill penis breath clinton irish god of luck death trap section 508 disability... article title; Willie Lynch letter: The Making of a Slave...bill penis breath clinton great white satan irish god of luck ...","post_message":"“[Refugee children] are indistinguishable from any child in America,” President Barack Obama said. “The notion that we should somehow be fearful of them, that our politics would somehow leave them to turn our sights away from their plight, is not representative of the best of who we are.”"},{"comment_id":"10153236038721336","commenter_b":"See this is what I mean, we know this guy is a terrorist. He admits so on TV and trains other MUSLIMS the most effective ways to be a terrorist. Why is he allowed to walk the streets? We need a force not answerable to normal athority that can move in on MUSLIM terrorist like this without constraints and not having to watch them for 10 years then wait a week after they attack to make an arrest. Get the job done and move on to the next one.","commenter_a":"Why giving your air time to this evil, wicked man","post_message":"Imam Choudary: 'The United States of America are the champions of murdering innocent people!'  Muhammad contest organizer Pamela Geller: '[We're] the champions of freedom, sir!'"},{"comment_id":"10154364961931320","commenter_b":"I don't like seeing fat chicks in spandex but yet I'm made to tolerate it.","commenter_a":"Was she covered up or like in the article picture? I am a mother and have no desire to see someone breastfeeding. Cover it up. That experience is between you and your baby and no one else.","post_message":"The sight of a woman breastfeeding her baby was enough to cause a male Target shopper to go off in a series of verbal assaults. @webpagelink"},{"comment_id":"939606616115567","commenter_b":"Slaves to Islamic vermin. not MEN","commenter_a":"Sharia and Islam are only good for Muslim Males ................Males get all the advantages............... BUT .women, children, gays, Christians , Buddhists, Jews, Hindu and anyother religion not 'their ' brand of Islam will be punished , raped , enslaved , or killed . Women of the world wake up and see this truth . Fight for freedom .Women Fight for your life....Women you can be more than slaves to men ........","post_message":"They're just sweet refugees', they said. 'Who just want a better life', they said. Welcome, and then .... German girls... cover up... so you don't get raped by the 'refugees'?"},{"comment_id":"934836243223515","commenter_b":"Take the cop dick out of your mouth, June. It's not a good look for you.","commenter_a":"This is ridiculous! Officers, please forgive the Mayor for having a more 'balanced' perspective, because of the diversity of his family. He is in a unique position to be able to 'see both sides.' It would behoove you, officers , to learn something from him and his family!","post_message":"America has told the NYPD in no uncertain terms that using a funeral to make a political point is not okay, and they just did it again."}]
