[{"comment_id":"10153545304972452","commenter_b":"Happy mothers day mom, have a cheeseburger, see ya later!","commenter_a":"was it on a friday ?","post_message":"When they both went for the cheeseburger, investigators said Benjamin Middendorf had enough and shot his brother."},{"comment_id":"10153930858301320","commenter_b":"Hoes will be hoes","commenter_a":"Kinda what he gets for being stupid.","post_message":"It was an expensive night. After a night of clubbing Knicks forward Derrick Williams took these two women back to his apartment and they made off with more than $600,000 worth of jewelry. Details: @webpagelink"},{"comment_id":"1090578067658503","commenter_b":"Then came Tuesday, \"decades day.\" Ibe dressed as a slave. The student said that, through his outfit, he had wanted to keep the dialogue about slavery going. He felt that at school the topic was sometimes covered up. \"I was like, OK, I need to make my voice heard and make sure these people did know that slavery did happen back in the day,\" he said in a phone interview Wednesday. Ibe's look didn't last long. He arrived Tuesday to the school in Missouri City about 30 minutes early, he said. When he walked through the main entrance and began down the hallway, he said an assistant principal pulled him into an office. They waited for the principal, who told him the outfit was inappropriate and that he needed to change, Ibe said. But taking off the outfit didn't mean he would drop the issue. At 9:29 a.m., Ibe asked ...","commenter_a":"Deplorable behavior!!! Trump has brought out the worst in people. God helps us.","post_message":"This is BEYOND deplorable..."},{"comment_id":"953345841476863","commenter_b":"that same lie every fuckin time. let me guess. Cherokee. fuck that shit. bitch is lying. and she's just another white racist tryna curve us from the truth. you're nice shit don't fly around me. I'm gonna bring out the racist in you for everyone to see if you keep on. let's play","commenter_a":"I rarely hear a white person say either of these things, and if anything I hear blacks alday long say go back to Mexico to Spanish Americans","post_message":"We're waiting..."},{"comment_id":"616683421873704","commenter_b":"I do too, Hillary won that election! They stole it and tainted our votes.","commenter_a":"Not my President impeach impeach impeach","post_message":"Share if you do too! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"990898310953409","commenter_b":"\"Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you\"","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas. @webpagelink"},{"comment_id":"721943014570974","commenter_b":"lol bitches just saying the same shit to get pity and money","commenter_a":"Oh I bet she's a 'liar' too. So many baseless accusations that all sound exactly the same from people who never knew each other. Amazing.","post_message":"A protest was planned at the event."}]
