[{"comment_id":"734861966642849","commenter_b":"Abortion should be legal everywhere and easily accessed for any women or young girl. It is their body and their right. A fetus that cannot process a though does not trump the right over an already born human being, especially when it lacks a social security card, birth certificate, valid first and last name, etc. A fetus does not reserve the right to life over the person it feeds off of and needs for survival. It is her property and as her property, she has a right to decide what does does with it where her physical and mental healthy is concerned.","commenter_a":"So disappointed you tossed in a nod to the Terry Shivo debacle...bad move. Most were probably not savvy enough to catch it. I did, you lost my vote. John Kasich won. Compassion and tolerance always beats government intrusion","post_message":"\"My record is clear. My record as a pro-life governor is not in dispute. I am completely pro-life and I believe that we should have a culture of life.\" – Jeb More on Jeb's conservative record: @webpagelink"},{"comment_id":"10158120208050557","commenter_b":"You attempting to make this about ME, so as to DISTRACT from the FACTS, TRUTH and REALITY, is a very \"cute\" little trick, implemented by YOU and so many others, who comment on this page.","commenter_a":"The PRICKTATOR's is at it again. If you're not concerned yet, you're either brain dead or a complete idiot.","post_message":"President Donald Trump fired acting Attorney General Sally Yates Monday night for refusing to enforce a legal order designed to protect the citizens of the United States, the White House said."},{"comment_id":"10153782445088984","commenter_b":"Interesting that this is the same city where the Muslims tried to impose Sharia law and got shut down by the mayor, a woman at that!","commenter_a":"This whole thing looks like it was aset up from the beginning, but too many people are jumping to conclusions before the facts are out ...","post_message":"The mayor of Irving, Texas -- the home of the Muslim \"bomb-clock\" boy -- just came forward with a shocking statement about the boy and his family. What she revealed shows exactly what's going on here. This was a setup from the first, and this mayor refuses to stay quiet about it. She needs our support."},{"comment_id":"840567656083161","commenter_b":"Karla Huitron cause yo ass can eat","commenter_a":"Marry her ass quick!!!","post_message":"What u doing? #WSHH"},{"comment_id":"1182540631781356","commenter_b":"ISLAM'S WHORE","commenter_a":"One Can Only Hope!","post_message":"FINALLY!"},{"comment_id":"1039779686062503","commenter_b":"Oh dear Lord! Yet you can have these so called \"Barbies\" walk around nude and no brains or respect for themselves or anyone else! They rob good hearted men and steal their hearts and yet this shyt is okay?","commenter_a":"People need to mind their own business if no one is getting hurt","post_message":"Is any place safe for moms anymore?"},{"comment_id":"10153255366409205","commenter_b":"You still had a chance to recognize the genders and learned from them, yes you are lucky that child is not!","commenter_a":"Justice! How about the child? Without father and stock at the house with 2 mothers? What kind of justice is this. Most of us grow up with family mother and father on site and easy for u to say is justified!","post_message":"JUSTICE! Lesbian Couple Gets Their Child Back"}]
