[{"comment_id":"1492050597481632","commenter_b":"Then your whole family is \"skewed\".","commenter_a":"That's funny, because all of the vets in my family are voting for Hillary. Is this another skewed poll? I'd love to see where survey monkey dug up the survey subjects. Here's the problem with the poll... Only people who are passionate enough or crazy enough are going to hang on the line to take a survey at this point... I.E. Trump supporters. Most smart people usually just vote and don't waste their time with surveys.","post_message":"But Hillary Clinton is perceived more favorably on the use of nuclear weapons. Here's where things stand."},{"comment_id":"10154529409364342","commenter_b":"There was 4 people in that house and one person died. It was one of those three","commenter_a":"I would sue too! His SISTER was murdered and this network is blindly claiming he did it.....WITH NO PROOF! Court of public opinion is harmful..... he's innocent he's never been put to trial it's not fair for this network to claim that this guy did it","post_message":"Burke Ramsey claims that his reputation was ruined as a result of the a series that accused him of killing his 6-year-old sister, JonBenet."},{"comment_id":"1089067221104747","commenter_b":"it's only good enough for those of us that don't pray to the gun god!","commenter_a":"Republicans; \"Carry a gun everywhere, except near us.\"","post_message":"If conservatives are so convinced that gun-free zones attract killers, then why do so many conservative places and events ban guns?"},{"comment_id":"10155000451429228","commenter_b":"When the Ayatollah came to power in Iran, Iran had a major drug problem. They hung their way out of it; they didn't hang anywhere near all the addicts . . . It's just that, apparently, people can get the \"disease\" of the addiction under control if they see government is serious. **** The Nation of Islam cleaned up some housing projects in the 90s, again, with lots of negative reinforcement--then the ACLU and bleeding hearts put a stop to that. **** If such measures here could stop drug-related deaths and murders, and give people in projects safe places to live, we would have a net gain. Kindness to the guilty is cruelty to the innocent.","commenter_a":"Oh, well then . . . If criminals don't care, I guess we shouldn't punish them at all. ***** Getting real, living things seek pleasure and avoid pain. If negative reinforcement does not seem to be working, we're just not using enough of it.","post_message":"Missouri's new Governor is asking for tougher laws.  Some experts say criminals don't care."},{"comment_id":"10154153789003010","commenter_b":"Gee, I bet General Petraeus wishes people held him to the same standard they hold Clinton. Maybe if he put a (D) next to his name, he could have gotten away with it.....","commenter_a":"Hillary Clinton has been a dedicated public servant for decades and she will be an awesome president.","post_message":"Let's not mince words: Clinton screwed up. But did she commit a crime, asks columnist Doyle McManus.   (via Los Angeles Times Opinion)"},{"comment_id":"10153911608872577","commenter_b":"The definition of terrorist declares them terrorists.","commenter_a":"No, a Heavily armed group of people using fear and power to push their beliefs on a government is what makes them Domestic Terrorists.....","post_message":"Non-violent occupation now considered domestic terror. #CNN #Bundy #Oregon @webpagelink"},{"comment_id":"884938878291056","commenter_b":"I'll fuck her up","commenter_a":"@username let matce do this she won't ever have that boy again!!!!!! I'll do everything in my power to get him from her","post_message":"Woman Checks A Mother Abusing Her Autistic Son At A Wafflehouse!"}]
