[{"comment_id":"617240545084050","commenter_b":"Gabe Monfried","commenter_a":"She was checking up on Bill","post_message":"It was really strange when Hillary was missing from the podium last night. Not very presidential!"},{"comment_id":"10153239404845329","commenter_b":"If a women wants to hate on men and bring them down, she is not a feminist no matter how much she claims to be. Feminists just want complete gender equality!","commenter_a":"I'm pretty sure that most men aren't like \"rape is so cool bruh, I'm going raping this weekend bruh, you coming?\" Stop lol And not all men get all \"EEEEEKKK\" about periods. Personally, I can listen to my female friends talk about it and not even get slightly sick.","post_message":"\"Imagine if men were as disgusted with rape as they are with periods.\""},{"comment_id":"10152836781859117","commenter_b":"Couldnt agree more. My sister had to go take a nursing exam the day after her 6 year old son died. Then missed the following exam for his funeral and had to make up the days the following weekend. If this bitch wants sympathy she can look in the dictionary between shit and syphilis.","commenter_a":"She is full of shit and her so called \"crippling anxiety\" is also a mound of shit.","post_message":"Brace yourselves for what might be the most frivolous higher education lawsuit of the century."},{"comment_id":"10153996390124071","commenter_b":"@username STOP ALL WELFARE PROGRAMS AND WE WILL NOT BE FINE! THERE WILL BE MORE MENTAL HEALTH ISSUES, MORE DRUG ISSUES, MORE CRIME, MORE HOMELESSNESS, MORE TRAUMA.. THAT IS NOT THE ANSWER BUT IF THERE WAS A LIVING WAGE PUT IN PLACE WE WOULD HAVE LESS PEOPLE ON WELFARE THAT IS A GIVEN. TOO EASY..","commenter_a":"Velocity of Money: I think it's quite simple if you look at something called velocity of money. What does that mean? That is the money that gets spent back into the economy. When you have the top 1% getting money, they spend 5-10% of what they earn. When you have the lower end of the economy getting money, they spend 100-110% of what they earn. Since we are a consumer economy this will be good for business in the long term. Not for the people getting the $15 per hour.","post_message":"An economist explains why Clinton’s plan to raise the minimum wage to $15 might be 'too much, too quickly.'"},{"comment_id":"1152094041550315","commenter_b":"This is Trump he's racist or rapists he brings crime and does drugs is insane and sometimes maybe nice but lies all the time! He only hooks up with foreign women probably keeps them in the basement until needed no American woman would ever marry him no matter how much money he has!","commenter_a":"Make America great again by getting rid of Trump! Check out the smile on that white boys face makes me sick and I'm white! Trump is nothing but a trouble maker and an embarrassment for America! Do any of his supporters listen to him I mean really listen and heed what he says and does?? I doubt it must be mental illness","post_message":"The laughter of the Trump supporters will haunt you."},{"comment_id":"10153497941541130","commenter_b":"Exactly, because feminism is about equality","commenter_a":"The funny thing is, if the ad said men are preferred, the women would be yelling sexism. Women are preferred? Sexism.","post_message":"\"The position requires filling in the responsibilities of a receptionist, so female candidates are preferred.\""},{"comment_id":"1233486323342287","commenter_b":"Would rather have this girl as president than hillary.","commenter_a":"As a tax payer I don't mind paying for something like that.....I can't be mad....","post_message":"This 4.95 GPA student revealed her status as undocumented immigrant during her graduation speech. #MicBrights"}]
