[{"comment_id":"10153182690520667","commenter_b":"Good grief","commenter_a":"Eric Stewart lol","post_message":"\"This game should not have been played at the airport.\""},{"comment_id":"1056978507726395","commenter_b":"we Irish and Scottish built it","commenter_a":"Why does she have to keep using the \"I live in a house built by slaves\"? What about the whites, free blacks and immigrants who also helped build the White House? Stop playing the damn slave card already.","post_message":"Warning: Sharing this with your liberal Facebook friends may spontaneously burst bubbles..."},{"comment_id":"1720045178285132","commenter_b":"She didn't make it running for president what makes her think she can do it for VP","commenter_a":"SHUT UP","post_message":"Donald Trump would be \"shellacked\" in a general election showdown with Democrat Hillary Clinton, Carly Fiorina said after being named Ted Cruz's running mate."},{"comment_id":"915559728526390","commenter_b":"Go f u co.yourself you ugly bitch","commenter_a":"I thought this might be a joke till I opened up and read more. This is absurd. I'm just saying","post_message":"Obama just announced that he is issuing you a new Muslim holiday that you must celebrate. This is ridiculous. He can't make us do anything. Will you refuse to celebrate this holiday?"},{"comment_id":"10154137959598701","commenter_b":"Dumb tweaker bitch","commenter_a":"Debbie someone actually fell for it.","post_message":"In Case You Missed It on Good Day Oregon: A contender for world's dumbest criminal. A Texas woman fell for a police department joke: a Facebook post with a warning about meth and heroin \"contaminated with Ebola\"."},{"comment_id":"10155373271046509","commenter_b":"Megan Kelly spoke with her for less than five minutes and all that was uncovered was that this chick lied. That's enough for me.","commenter_a":"cheap attention. sorry, but this is pathetic","post_message":"\"He was really aggressive. He was really rude. He was a bad person with me.\""},{"comment_id":"10154229601211179","commenter_b":"Ash Kay- see? I'm not the only one thinking this! 😂","commenter_a":"That is sadly amusing","post_message":"via @buzzfeed"}]
