[{"comment_id":"1775999165978650","commenter_b":"No","commenter_a":"'HELL NO '","post_message":"Is Hillary Clinton America's best choice for president in 2016?"},{"comment_id":"10153854891839032","commenter_b":"Get guns out of the hands of THUG CRIMINALS and TERRORIST and problem solved","commenter_a":"Being around guns isnt safe... who would have though","post_message":"The study also found that in many self-defense cases, use of a gun didn't lead to a better outcome for the victim."},{"comment_id":"10154043523939203","commenter_b":"Mr Pope! Tear down that wall!","commenter_a":"If somone keeps coming on my porch and coming in through my door and rapes and kills, at some point I am going to lock the door!","post_message":"person who thinks only about building walls, wherever they may be, and not of building bridges, is not Christian.'"},{"comment_id":"1192416514111710","commenter_b":"Then he cuffs the man after shooting him in the back smh","commenter_a":"How in the hell do you feel threatened by a man who is running in the other direction? This guy is full of crap.","post_message":"Former officer Michael Slager: 'What makes me upset is that nobody knows what actually happened.'"},{"comment_id":"10153074507087908","commenter_b":"Only Decent Republican President lol !!! @webpagelink","commenter_a":"Today, Ike would be a center-right Democrat.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"977688075599947","commenter_b":"Dirty whore","commenter_a":"HOA president needs to remember where she lives!","post_message":"How idiotic!"},{"comment_id":"1370428343050216","commenter_b":"Keep this animal in jail","commenter_a":"These two idiots actually represent the sick mentality of the republican party. They are both sick and depraved. What I really find interesting is how much american men admire that behavior and vote for them. They seem to have a lot in common with these two.","post_message":"SPREAD HIS SHAME."}]
