[{"comment_id":"946732062040088","commenter_b":"Right. Because all those women raped enjoyed it. *eyeroll*","commenter_a":"If you don't want to get pregnant that is a choice. If you don't want to get pregnant, don't have sexual intercourse. There's other ways to find physical satisfaction than sexual intercourse & they won't create a baby. Abortion IS NOT a means of birth control. It's murder. For those who are for abortion as a woman's choice, what about the choice of all of those female babies that have been aborted?","post_message":"So true."},{"comment_id":"10154563720189087","commenter_b":"Religion and government is intertwined...Muslim ban that include pushing Christian refugees to the top of the list. Unconstitutional violates church state seperation however her trump wanta to also allow tax exempt churches to be allowed to donate to politicians. And if you don't understand why that's wrong please re-read your constitution.","commenter_a":"I am so proud of Muslims, Hispanics & Women. To be abused and treated so badly by Mango Mussolini, and to still hold their head so high, is truly wonderful!\"","post_message":"President Donald J. Trump: \"I am so proud of my daughter Ivanka. To be abused and treated so badly by the media, and to still hold her head so high, is truly wonderful!\""},{"comment_id":"10153881330947434","commenter_b":"So funny how some morons predict an armageddon just because their feminist messiah didn't win.","commenter_a":"Except for the fact that Jill is only asking for recounts in places where Trump won narrowly and has continually ignored asking for recounts in areas where Hillary won by even less votes. It's not about electoral integrity, it's about a woman having an infantile, foot stomping temper tantrum because she didn't get her own way.","post_message":"Jill Stein herself, standing across the street from Trump Tower, encouraged the president-elect to support her campaign’s efforts to ensure that every vote is accurately counted. “There is nothing to be afraid of,” Stein said, “if you believe in democracy.”"},{"comment_id":"10153428290568487","commenter_b":"?? Do you think it while turn a woman into a fuck machine? Does Viagra turn men into drooling cock monsters?? WTF are you even talking about??","commenter_a":"Am I the only one with a slight concern that this could be used to spike women's drinks? Just a thought in the back of my mind....","post_message":"A FDA panel has recommended approving female Viagra for the market. Is it even necessary?"},{"comment_id":"1722780531335461","commenter_b":"That's what my husband says, so why does he get to run.","commenter_a":"@username, answer the question - how can Ted Cruz run for President and be born in Canada.","post_message":""},{"comment_id":"648946631962582","commenter_b":"NO. This will never happen to me.","commenter_a":"No","post_message":"Every single American is to be microchipped within the next year.  This is a violation of our rights.  Will you let them do this to you?"},{"comment_id":"10153289786066491","commenter_b":"Here's the thing. You need to go # 1? You need to go # 2? Go to bathroom of your current sex. Drop the bomb, Cut loose, wipe clean, get out. That simple. Bathroom is not social grounds It's not grounds to dispute how you feel as gender. Do your business, in out less than 2 minutes..... WTF is wrong with the world today. Everyone wants to be special.","commenter_a":"Are we that far gone from reality that we want to make bathrooms for the trans in our society. Im sorry you were born as a boy or girl. How about you just stick with that while you are in public. Problem solved and no money spent on suppling a unneeded bathroom","post_message":"\"Before the 5th grade, my classmates were able to accept and be friends with me.\""}]
