[{"comment_id":"1143828785650872","commenter_b":"Funny how they show all this stuff because its TRUMP...I am sure that there was stuff like this when Obama was running oh ya it has been bad for 7 years since he has been President...GROW UP PEOPLE...you are making bad examples for our future kids...","commenter_a":"Common sense: Using seat belts, texting and driving, drinking, smoking, walking in traffic....should I go on? You are responsible for your actions, not some politician!!!!!!!!! WAKE UP AMERICA......","post_message":"This protester was sucker-punched and kicked by a Trump supporter as he was escorted out of yesterday's rally in Arizona. You have to see the video of the violent confrontation."},{"comment_id":"990789407625962","commenter_b":"In coming President~Trump ^ seek and destroy all opposition within our borders and outside our borders VOTE TRUMP","commenter_a":"These and all jehadic Muslims are evil and need to be killed period.","post_message":"Who saw this coming? [Read below]"},{"comment_id":"10153019604880399","commenter_b":"Yes we do!","commenter_a":"We NEED to get rid of THE TYRANTS","post_message":"Dr. Ben Carson wants a country that \"puts our Constitution on the top shelf — and for those who have any doubt, that includes the Second Amendment.\""},{"comment_id":"1432544963425545","commenter_b":"As Usual Asian people don't respect anything. They are doomed!","commenter_a":"Typical Asian - they'll eat anything that moves","post_message":"Their cries will make you question everything you put on your plate. How can anyone treat animals this way?"},{"comment_id":"10152829318850667","commenter_b":"I concur, Josh! Emimen is a great rapper and I don't recall him ever saying the word. I could be wrong, but I don't recall it. I don't like the word used by any person but it definitely should not be said by him.","commenter_a":"You have the right to say whatever you want. The question is, do you have enough respect for others to know you shouldn't?","post_message":"Rapper Chet Haze, the son of Oscar-winning actor Tom Hanks and actress Rita Wilson, says that the slur is part of hip-hop culture and that he has a right to say it."},{"comment_id":"921974804515254","commenter_b":"my favorite teacher was/is Mrs Cathy Zavacky-Barrek. She was my kindergarten teacher and I was a cry baby.she always made me feel comfortable and loved away from my mommy....The sweetest teacher ever, nice, loving, but also had control of her class...","commenter_a":"My favorite teacher was in 6th grade. He believed in me when I felt like no one else did- may he rest in peace. My favorite college professor (also my academic advisor) helped guide me along the path I needed to be the first in my immediate family to get a Bachelor's degree (thank you for that Bob)","post_message":"What stories do you have about YOUR favorite teacher?! #NationalTeacherAppreciationDay"},{"comment_id":"593869030794976","commenter_b":"#killery #neverforget #emailscandal #saudibribes #womandestroyer #liesthroughherteethwithasmile #corrupt #unfitleader","commenter_a":"Headline reads...CLINTON AND TRUMP UNFIT 2B PRESIDENT","post_message":"It was one of the great body slams of presidential politics. Donald is hurting at this moment."}]
