[{"comment_id":"474408059350901","commenter_b":"Stay off their land!","commenter_a":"Err... They only kill white people because their other fellow tribes who join the \"democratic\" world suffered a lot of losses and they warned them. There is a documentary on this. You should check it out.","post_message":"Anyone who has ever tried to come ashore the island was attacked or even killed."},{"comment_id":"1369422333077793","commenter_b":"Witch Hillary and hubby slick Willie..","commenter_a":"#Trumphasmyvote","post_message":"Is there any stopping Hillary Clinton and Donald J. Trump now? Let's take a look at the math."},{"comment_id":"10154090150895329","commenter_b":"OMFG she's such a bitch...","commenter_a":"@username STRUGGLE SO REAL","post_message":"\"I will bleed on everything you love.\""},{"comment_id":"629803473847253","commenter_b":"she is a bitch to treat that young woman like that","commenter_a":"What a bitch!","post_message":"MUST WATCH: Hillary doesn't like being challenged by black woman. Welcome to the DEMOCRAT plantation."},{"comment_id":"10154406577771051","commenter_b":"Ray >Melania isn't even from the US can't speak English an is a HOE!!!!!","commenter_a":"There is nothing wrong with her dress.","post_message":"This photo of Melania Trump sparked serious backlash after people noticed one thing about her dress."},{"comment_id":"10156390568200354","commenter_b":"Then why has socialism worked anywhere ??????","commenter_a":"No.","post_message":"\"...the word ‘socialist’ has become a dirty word.\""},{"comment_id":"1368444483166524","commenter_b":"Best line of the day....Hillary: \"RELEASE YOUR TAX RETURNS.\" TRUMP: \"I EMAILED THEM TO YOU.\" HAHAHAHAHA","commenter_a":"One reason I support Trump is not because he knows everything, but because I agree with his position on most things. I like his energy and desire to solve problems, and he seems to be willing to change when something isn't working..unlike most politicians who refuse to admit when they're wrong. However, (and this is an example) when Hillary says he doesn't believe in climate change, he needs to back up his position with facts on why. Sure she can say scientists believe in it..well not all of them do. Trump needs to bring up scientists that don't support that theory. Also I would like to see him release his taxes, so she can't bring it up anymore.","post_message":"'CNBC, Time magazine online polls say Donald Trump won the first presidential debate' via The Washington Times."}]
