[{"comment_id":"879835912051831","commenter_b":"I wish her big mouth would go away ; what a disgusting woman","commenter_a":"A message for Rosie. It is one thing for people to think you ignorant and it is another for you to open your mouth and prove it.","post_message":"Tom Selleck is awesome!"},{"comment_id":"1374717489237646","commenter_b":"Deport all Mexicans","commenter_a":"Alot of snowflakes on here. Trump!!!!!","post_message":"LIVE NOW: Donald Trump speaks at a \"Thank You Tour\" rally in Mobile, Alabama."},{"comment_id":"10153096865294614","commenter_b":"Adorable, precious, blessed by God! What a wonderful father & lucky to have this special little boy in his life! That woman is disgusting & I agree with another comment that she should have her tubes severed forever & never be allowed to have a child, not even adopted!","commenter_a":"Thank you everybody for sharing all the beautiful pictures of your wonderful and special family members, they are truly a blessing on this earth. I work in an Adult Foster Care home and we have cared for Downs Syndrome of all ages. Due to rapid decline in health recently, two of my special guys have left this earth to be angels. I cannot explain the special spark that they put in my heart when I was with them. I will never understand how people can be so heartless. God Bless Leo and his amazing father!","post_message":"After this baby mom abandoned him because he was born with Down syndrome, his father stepped in to raise the son he calls and as a single dad. Leo Forrest was born in Armenia last month. Upon learning of the genetic condition, his mother and her family gave up on the child. They also told Samuel Forest he would no longer be welcome in their home if they decided to keep him, according to a GoFundMe page set up to help Forrest and the baby. Faced with a difficult choice -- his wife or his infant son the new father chose Leo. She has since filed for divorce, he says. Forrest is returning to Auckland, New Zealand, where he is originally from, to raise the baby. Read KTLA story here: @webpagelink"},{"comment_id":"10154888986680579","commenter_b":"Build that wall..","commenter_a":"Where will he get the money if he cuts taxes with our huge debt? Borrow it?","post_message":"Military Only: Your choice for 2016?"},{"comment_id":"10154413353871519","commenter_b":"Nope. Good luck, though!","commenter_a":"They better NOT. You will get the same help you gave President Obama, 0. Now, GTFOH","post_message":"This is an offer they are not likely to take him up on."},{"comment_id":"1645437002375216","commenter_b":"i like thin women but umm. no, just no","commenter_a":"That is just grotesque","post_message":"Hot or not?"},{"comment_id":"856527364484863","commenter_b":"@username shut ur dumb-ass up!","commenter_a":"First point of order the car is in the middle of road. Second point yes his hands were raised but he moved to the car and did not stop not typical behavior of a stranded motorist when given an order to stop or asked hey why is your car in the road. Third point the suspension is typical following any ois during an investigation. So is the officer right or wrong if you can make that judment based on clips of an entire interaction with the police you're an idiot, and are part of what's wrong with America as well.","post_message":"GRAPHIC VIDEO: Video released today shows Tulsa police shooting and killing Terence Crutcher, an UNARMED father of 4 and college student for the crime of having his car stall down on the road. His hands are raised shortly before shots are fired. From the helicopter, a cop can be heard on the radio saying, \"That looks like a bad dude, too.\" A federal Justice Department investigation has been launched and the officer who shot him has been suspended. Video by Occupy Democrats, LIKE our page for more. Read more here: @webpagelink"}]
