[{"comment_id":"1700674326840051","commenter_b":"Leave our flag alone!","commenter_a":"Leave it alone!","post_message":"Men and women have died defending our flag, don't mess with it. Do you think the flag should be left alone?"},{"comment_id":"1243601928984608","commenter_b":"Speak for yourself, Bertha. Don't pretend you speak for the majority of women because you sure as hell don't!","commenter_a":"Don't have the right to impose their beliefs on others.. huh? Well, then the religious right should stop right there...","post_message":"Ted Cruz’s tour de transphobia has embraced a new extreme position."},{"comment_id":"1390020544359635","commenter_b":"I would turn the hose on her and spray that STD filled flea bag off my property","commenter_a":"please knock on my door. we have lots of property and a back hoe","post_message":"I would rather ___________ than have Miley Cyrus knock on my door."},{"comment_id":"10154160813994657","commenter_b":"She is a criminal","commenter_a":"She's a disgrace, so are the people that support this nonsense","post_message":"Playing by her own rules?"},{"comment_id":"10154354422615950","commenter_b":"$400,000 a day for Melania to stay in NYC.","commenter_a":"Two weekends in a row out of three weeks in office we've flown him to Florida. Where is the Republican outrage?","post_message":"On Saturday, President Donald J. Trump is hosting Japanese Prime Minister Shinzo Abe at his resort in West Palm Beach."},{"comment_id":"1317863694976546","commenter_b":"She is not his type","commenter_a":"Hillary paid them","post_message":"BREAKING Trump campaign adviser A.J. Delgado tells Brian Williams the allegations of inappropriate touching against Donald J. Trump aren't credible."},{"comment_id":"1579218252372572","commenter_b":"You k ow it is . She can't win. Otherwise","commenter_a":"Narcissists must have someone or something to blame for their inadequacies and failures.","post_message":"\"I'm afraid the election is going to be rigged, I'm going to be honest,\" Donald J. Trump told a crowd on Monday, just days after he criticized the \"unacceptable\" general election debate schedule."}]
