[{"comment_id":"10154135870346336","commenter_b":"@username OMG---More Trump Fabricated LIES!!!Trump Played Everyone Like A FIDDLE With Those TRUMP Planted PAID Protesters, Trump Now Has 20 Secret Service Guys Guarding Him At His Rally, EGO IS THE WORD...He Really Knows How To Play the Media & Followers *NEVER TRUMP* TRUMP Wants to TURN Our Military INTO ZOMBIE TeRRORIST Animals To Beat ISIS...BUT OUR MILITARY IS AN ELITE GROUP & Has Rules & Morals.... ISIS is A BAND Of MURDERS & CRIMINALS.... TRUMP Wants A WAR $$.....People Are Blinded by Trump's Rhetoric and can't SEE Trump Sending Our Young Adults To Fight An All OUT WAR AGAIN! Government Welfare KING DUMP Trump doesn't need anyone's HELP exposing His LIES Trumps own EGO Is His Own Nemesis.. ??Has Trump Gone From Selling Realestate Properties To Selling Our Whole Country!TRUMP wants to Do Away with Social Security & Medicaid For Our ELDERLY!!! HOW is Trump Helping American JOBS when ...","commenter_a":"Typical Trump...talking about anything other than specifically HOW he is going to make AMERICA great again!! Just saying it won't make it so!! Maybe that's why he gets no more than 35% of the vote. The other 65% are on to his BS...He only cares about Trump not one of his supporters! Wake up people!!!","post_message":"\"[Marco Rubio] made a statement that I had small hands. He made it up. He's a politician. Politicians lie.\"  Today on \"MediaBuzz,\" Donald J. Trump talked about the \"hands\" story."},{"comment_id":"1756313234607564","commenter_b":"Hillary the Corrupt Witch Bitch !","commenter_a":"#NeverHillary!","post_message":"***UNPRECEDENTED CORRUPTION***"},{"comment_id":"10154439835324203","commenter_b":"It takes brain power to watch a documentary? Lol","commenter_a":"not many of Trump's supporters read these guys, nor watch PBS documentaries, too much brainpower needed.","post_message":"David McCullough, Robert A. Caro, Ken Burns (PBS), and more have stepped up."},{"comment_id":"1563692830591111","commenter_b":"@username We don't need to build a wall... we need to make all employers use E2Verify, get our Congress to quit allowing corporations to import H1b and H2b workers... Then move military bases from sanctuary cities and put them along the border...use the open spaces for war practice and bombing ranges to collapse the tunnels.","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, preserve the sanctity of the unborn life, preserve the sanctity of the 2nd amendment ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness","post_message":"We cannot pretend the problem does does not exist. We need to build the wall- in order to make America safe now-- and for future generations!"},{"comment_id":"1146806995375828","commenter_b":"Only lesbians are voting Hillary","commenter_a":"#Hilary said she going to let her husband run the economy.... Way to go #feminists set back 50 years in one sentence...epic fail #TRUMP2016 pls share","post_message":"We just won Kentucky! Thank you to everyone who turned out. We’re always stronger when we’re united. hrc.io/1WDpty0"},{"comment_id":"10153265498530047","commenter_b":"@username over 5million LOL. Dead people and illegals","commenter_a":"SIGN THE PETITION / CLICK ON WEB SITE Justice Scalia one of the most brilliant and ardent defenders of the Constitution has just passed away. This is a huge, deeply felt loss. We must not forget that the next justice could impact the Court and the direction of our nation for decades. The American people deserve a voice in this decision: @webpagelink","post_message":"President Obama will stop at nothing to force his nominee for the U.S. Supreme Court through the Senate before his last year in office comes to an end.      But we can stop this from happening.  SIGN & SHARE our urgent petition to the U.S. Senate today: @webpagelink"},{"comment_id":"780559568801287","commenter_b":"Get a Real Job Bitch!!","commenter_a":"on welfare??? guess how much those tattoos cost>>???","post_message":"Welfare Recipients In THIS State Just Received Some DEVASTATING News  It is unethical to leech off the hard work of others.  Are you fed up with welfare moochers?"}]
