[{"comment_id":"828114997284754","commenter_b":"Can goats give consent?","commenter_a":"Polygamy is next. Then incest not far behind. Chris you gonna marry a goat?","post_message":"BREAKING"},{"comment_id":"1212661252101912","commenter_b":"Lmfao bitch","commenter_a":"@username and you can't even do 5 seconds LOL","post_message":"A policeman just planked for 8 hours and broke the Guinness World Record."},{"comment_id":"10153357244917061","commenter_b":"She should be a shame of herself. A doctor, would not want her to treat me.","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"10155046621507704","commenter_b":"No way these girls aren't boozin b4 these press conferences, no way...","commenter_a":"If these morons didn't play loud music in the background, you might actually be able to hear what the people are saying.","post_message":"They're losing it! In more ways than one..."},{"comment_id":"10153228481536519","commenter_b":"Which means no one should have sex with her, dumb ass.","commenter_a":"Oh jeez these comments are sick! Yeah teach your girls to watch how much they drink (and get help if they can't control themselves).and situational awareness. BUT this girl was still raped. Those men are still guilty. If someone is that wasted they crash a bike into your house, you sure as hell don't have consent to sleep with them. If someone is passed out on a couch, you don't have an open invitation to rape them. You people need help","post_message":"\"The truth is... I don’t know the exact number of times I was sexually assaulted.\""},{"comment_id":"10153844148480579","commenter_b":"Only when they try to use it as the basis of their platform or legislation. Then it is a big negative.","commenter_a":"Media Silent As Muslims Ethnically Cleanse 60,000 Christians In Philippines By: Daniel Greenfield When thousands of Muslims become refugees, then you can’t get the media to shut up about it for weeks. Thousands of Muslim migrants... jewsnews.co.il","post_message":"Do you consider religion when evaluating a candidate?"},{"comment_id":"1164964563593106","commenter_b":"I saw them at Riverside too! I remember crying lol","commenter_a":"@username remember Riverside lol","post_message":"This is Paula first time on tour in 25 years!"}]
