[{"comment_id":"10152895696909342","commenter_b":"shoot her in the face..","commenter_a":"Smh","post_message":"Police: Woman tosses baby out of car window during traffic stop. abc13.com/@username/"},{"comment_id":"10154683704293984","commenter_b":"Lil pussy","commenter_a":"Go Trump!!!","post_message":"Actor Brad Pitt just shook things up with a very public Donald J. Trump rant that caught everyone by surprise..."},{"comment_id":"10153263722107411","commenter_b":"Hold my dick!!","commenter_a":"Yea , meanwhile the murder capital award goes tooo","post_message":"THIS JUST IN: Mayor Rahm Emanuel is expected to introduce an ordinance that will raise the minimum age to purchase tobacco products from 18 to 21."},{"comment_id":"1383456038414113","commenter_b":"We got the house the Senate and the White House. LOL your liberal agenda happen no more.","commenter_a":"TWO YEARS...VOTE EVERY ONE OF THESE BASTARDS OUT!!! They have proven by pass this legislation that they are unfit and untrustworthy to serve the people that they purportedly \"represent!\"","post_message":"They're so brazen..."},{"comment_id":"957899690952352","commenter_b":"If they're refugees where have they got the money to buy fireworks - surely they need it for food, clothes & shelter","commenter_a":"Scare them all back where they came from..... And walk a few swine around with you.","post_message":"German officials have asked residents to refrain from using fireworks to avoid traumatizing refugees."},{"comment_id":"10154534424443984","commenter_b":"If these Punks hates us and hates the American Flag , why ????? Do you live here I'm sure if we came over your home place we would be killed","commenter_a":"I agree. If America is so bad for these buttheads, get the heck out of our Country!!! Second, if any of these a-holes are getting assistance from our Federal Government (alias all of us), STOP THAT SUPPORT NOW AND FOREVER!!! The people who fought and died for that Flag to fly is the reason these a-holes can be protesting in the first place. I would put them on a plane like the other person said, but instead of flying to ISIS country, I would just drop them out over the middle of the Atlantic and see how well they swim. Hopefully they will swim in the other direction from our Country!","post_message":"The protesters in Cleveland thought they could get away with burning an American flag in the streets... but they never expected who was coming right for them.  This is America, punks... don't mess with Old Glory."},{"comment_id":"941709942541740","commenter_b":"Stay out of my relationship","commenter_a":"This is clearly propaganda to boost the cause to have people see same sex marriage in the same light; it's a ploy, not that I have anything against racial marriage, I'm 100 hundred percent for it but it's no coincidence this is being addressed in light of what is happening this month. When a black man or white man marries a latina woman or black or white woman or Aborigine woman, that is still a man marrying a woman, the way that God had intended. The sexes are complementary and marriage has been since the beginning of mankind, the core unit to propagate the family and for mankind to spread and to flourish. Two males and two females cannot propagate the family that is why they have to take other unnatural alternative measures to achieve this because that is the only way they can. Please don't think I'm putting down ...","post_message":"On this day in 1967, the Supreme Court legalized interracial marriage in the United States. Happy Loving Day! #LovingDay"}]
