[{"comment_id":"10153933140869087","commenter_b":"It is their constitutional right to burn the flag just like the constitutional right to carry a gun. I might not agree with it b","commenter_a":"That's constitutional to do. Folks may not like it, but you can burn any flag. Free speech.","post_message":"Chaos as anti-Donald J. Trump protesters burn an American flag outside the GOP convention"},{"comment_id":"10154237826833010","commenter_b":"So no women has ever done the same thing right? Smh","commenter_a":"My son-in-law, a sheriff's deputy, once got a call about a baby in a car seat in a car in the parking lot of a \"gentlemen club\" translation - strip club!! The cops found the father inside getting a lap dance. He was supposed to be caring for his child while his wife, a doctor, worked the night shift at the hospital. What a father :( What a husband :(","post_message":"This week in North Hollywood."},{"comment_id":"10153928566951943","commenter_b":"she's a LYING PIG!!!!","commenter_a":"Bull!!!! They should all have to answer all questions. STOP the cover-up's, the crap, just get the truth out. Put this Liar, Thief, Murderer, traitor in prison where she belongs, and ALL that knew about her doings and didn't do anything to prevent it, or knew of it afterwards, and buried their heads in the sand. ENOUGH IS ENOUGH !!!","post_message":"Senior Hillary Clinton aide Cheryl Mills and her lawyer walked out of a recent interview with the FBI about Clinton's private email system after an investigator asked a question Mills believed to be off limits, according to a published report. - via Fox News"},{"comment_id":"10153803392470950","commenter_b":"And yet again the liberal media twist his words, he never suggested in any form that anybody attempt to cause bodily harm to the hag. Just that we need to exercise our rights as Americans and keep the hag out of office.","commenter_a":"Why did CBS reporters ADD words to what Donald Trump said at his campaign rally the other day? What he said was \"supporters of the second amendment\" might have a way ....... meaning like the NRA's lobby could have a way to PROTECT AND KEEP THE SECOND AMENDMENT FOR ALL AMERICANS. AT NO TIME DID HE EVER SAY OR IMPLY THAT anyone be assassinated. AT NO TIME!!! When you report things that NEVER HAPPENED BY CHANGING WORDS AND ADDING WORDS, You really make yourselves look pathetic! WE ALL KNOW WHAT DONALD TRUMP SAID and it isn't what your are saying. VERY unprofessional of your news staff to do that kind of stuff! You are as bad as Hillary Clinton saying she didn't say WHAT SHE SAID ON THE VIDEO WHICH PROVES WHAT SHE SAID, when the 4 men's coffins from Benghazi were being taken off the plane. HER OWN WORDS ...","post_message":"These latest numbers come out a day after Donald J. Trump came under fire for suggesting \"Second Amendment people\" could do something about Hillary Clinton."},{"comment_id":"10153784576082439","commenter_b":"Yes nazi ideology wasn't rooted in Christianity , any person watching the military channel knows that, they were obsessed with the occult . I believe Islam , and I'm not alone is the new nazi. Same crap Nazis spewed, we are peaceful, trust us . But worse , almost all western leaders except Putin and couple Baltic states are not buying it . You'll see, next world war will be because of Islam","commenter_a":"We are doomed. I'm hoping I get cancer and die before Muslims raise the Isis flag at the Whitehouse, I'm a vet and will for go my veteran cemetery burial as Muslims will dig us all up, toss us aside and build mosques on these honored hallowed grounds!","post_message":"Anywhere American mores and law conflict with Islamic law and supremacism, it's American mores that must give way. Ripping out pews? It's sacrilege."},{"comment_id":"10153638108452894","commenter_b":"Exactly STFU Girl","commenter_a":"........\"my neck,my back,lick my 9ussy and my crack\" is her claim to fame, from like the 90s or something, why is she even doing a interview ?","post_message":"Khia BLASTS Beyoncé & Serena Williams for Making ‘Black People Look Bad’ & The Game Claps BACK: ‘Don’t Yo Neck and Yo Back Hurt?’ [Video]"},{"comment_id":"10153227343366770","commenter_b":"Oh them dumb white people they so racist! Sarc","commenter_a":"She looked so stupid. She clearly made a dumb open statement that wasn't true. Obama told her...it didn't stop her from getting a gun. Brain washed White people. You White Republicans vowed a sworn oath to not give anything to Obama before he took office. A sworn oath. Racist haters. A sworn oath. So don't blame the Black guy You hated and conspired before he took office to hate him. Now you act like you don't understand why he used Executive Orders. Dumb racist White supremist. Shes a NRA crash dummy. Wow....Whites really got no common Sense. Natural born Black haters. Trying to make her a hero...SHE SAID NOTHING NUT GOT SHUT DOWN BY OBAMA FOR QUOTING WHITE MEN AROUND HER. LOL. OBAMA GOT THE LAST WORD.","post_message":"Taya Kyle, the widowed wife of Navy SEAL Chris Kyle confronted Barack Obama Thursday at a CNN town hall event on guns Thursday night."}]
