[{"comment_id":"1317246778287960","commenter_b":"She'd have been funnier if she'd have swallowed her Mic..","commenter_a":"What the he'll is wrong with these mean girls, this country? You don't do that to ANYONE! Not ANYONE EVER! This show allowed this? We teach our children it's wrong, if it was done in school it's called bullying....my God! She should lose her modeling contract!!! Stop this Madness!","post_message":"Gig Hadid threw some serious shade at Melania Trump tonight..."},{"comment_id":"554388108092251","commenter_b":"Merry Christmas to you and your family","commenter_a":"GOOD+++","post_message":"May your Christmas be filled with happiness and hope. Let us not forget the women and men overseas protecting our freedom. Merry Christmas from my family to yours."},{"comment_id":"10155182978984369","commenter_b":"We are animals no different then lions killing each other in self self-defense. i believe killing for money power drugs and such is a sin. Killing for self-defense would be justified","commenter_a":"A few people on here are saying that a gambling debt or drug debt isnt a good enough reason to kill someone. Maybe not for you but obviously a good enough reason for someone who kills...","post_message":"NEW INFO: The victim girlfriend told investigators she drove her boyfriend to the location of the shooting to collect on a Super Bowl bet and when he exited the vehicle, he was shot"},{"comment_id":"10153245276305950","commenter_b":"Right clown ass hoe bitch go die","commenter_a":"And we call these animals humans??! Disgusting how they are getting away with treating the people who put their lives on the line to defend them. We should allow them to continue to kill each other ... that would mean less barbaric, meaningless, animals taking up valuable oxygen","post_message":"WATCH: Some 'angry' protesters clash with police in Chicago video of #LaquanMcDonald's shooting released @webpagelink"},{"comment_id":"10153996676511770","commenter_b":"Her hips are way way too big. She just looks out of proportion","commenter_a":"Fat and ugly wannabe!!! Hope she is going into psychiatry!","post_message":"Do her steamy Instagram photos cross the line?"},{"comment_id":"969391529750304","commenter_b":"Even a whore has the right to decide when she has sex!","commenter_a":"Following a celebrity back to their hotel room doesn't make you ambitious. It makes you a whore.","post_message":"This is the side of the Bill Cosby rape scandal that hardly anyone is talking about  but everyone should."},{"comment_id":"10154030694113812","commenter_b":"I think the kind of look like little foxes... so cute!","commenter_a":"I don't know the reason they call them red pandas when they resemble Raccoons","post_message":"After a 2-year hiatus, red pandas have returned to the Smithsonian’s National Zoo and Conservation Biology Institute."}]
