[{"comment_id":"10152744364061051","commenter_b":"And she can spend all the money she wants...mother nature will eat you from the inside our eventually","commenter_a":"Wonder how many hungry people that money could feed? But why try to end world hunger when you can go to the gym.","post_message":"This couple spends $80,000 per year on their looks, and they say that's why they're the best looking people in America."},{"comment_id":"10153325885524087","commenter_b":"Such an ignorant cow!","commenter_a":"Hideous hag.","post_message":"“They can wait if they like until next November for the actual balloting, but Donald J. Trump   was elected president tonight.” Ann Coulter tweeted."},{"comment_id":"682877985236113","commenter_b":"Carrie is a rich beeeatch!","commenter_a":"Liberals need to keep their views to themselves....Carrie, is a sweet mother and wife, and can teach her son what she wants to teach him, regardless what others might say: Because, He is HER child not the Liberal idiots, out there...!!!!!!","post_message":"Liberals are going after Carrie Underwood for her faith, she needs your support.  She is a true Christian. Let's get her back.  Can we get 85,000 'LIKES' for Carrie Underwood's faith?"},{"comment_id":"10155312985958132","commenter_b":"They are at 20.. they adopted a relatives child.","commenter_a":"@username are they your Laredo neighbors lol","post_message":"Jinger is the first member of the Duggar family to permanently relocate."},{"comment_id":"1064358433623633","commenter_b":"TRUMP GO back TO Hell","commenter_a":"Can these idiots be any more reprehensible?! The Repugs care only about the top 1%.","post_message":"The right's hostility toward the working poor is now front and center."},{"comment_id":"10156577141610603","commenter_b":"Now we have another whack job in Washington today. Something is in the air, like desperation.","commenter_a":"According to public records, Ford has an extensive criminal history, including charges for burglary, fleeing police officers, grand theft and an unspecified felony. Most of the incidents occurred in Broward County, Fla., and date back to 1996. His girlfriend said: He is an alcoholic, violent, depressed. It’s my belief he is in desperate need of medical & psychological help!”","post_message":"Cedric Ford was at work when he was given a 'protection from abuse' order roughly 90 minutes before he went on Thursday's deadly shooting spree, according to police."},{"comment_id":"10158083946035206","commenter_b":"Then clean your ears out!","commenter_a":"Can someone please tell me what the heck Trump stands for because to this day i haven't heard anything positive come from out of his mouth.","post_message":"Donald J. Trump supporters describe why it's sometimes hard to be for Trump. @webpagelink"}]
