[{"comment_id":"1521502694809851","commenter_b":"And once again we don't riot , block busy streets and and make up bullshit like a certain group of people--- absolutely this is murder and a hate crime!!","commenter_a":"absolutely","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news.  No riots, no protests, no media coverage.   Do you think he should be charged with a hate crime?"},{"comment_id":"1244871155548303","commenter_b":"You ain't going anywhere you f. Ing. Liars.......where u gonna make your money.....u should feel lucky that this is the only bonehead country that would pay your assets to do anything on film!!! BIG FAT LIARS......THEY R WHAT THEY IS !!!!!","commenter_a":"Yea.........see ya","post_message":"The last slide Don Jr. has a nice surprise for all of them!"},{"comment_id":"10153669770570950","commenter_b":"My thought exactly. If you see the pictures and videos, there are lounge chairs and tables just feet away from the water. People can read the \"no swimming\" sign, but an alligator is not going to think twice about coming on land. I think Disney needs to close off areas where there are gators. I lived in Tampa for four years, and gators were everywhere near water. You just knew where they were, and if you didn't, there were signs. I doubt people did not know about the alligators; you can always spot them especially if there are more than three. This could have been prevented.","commenter_a":"Why were alligators allowed to be so close to where human activity is? Especially DISNEY WORLD where 1000's of children are on a daily basis??","post_message":"Officials are pulling alligators from the nearby lagoon and putting them down to check for the boy's body; so far, they haven't found him."},{"comment_id":"10155153286483258","commenter_b":"But it's nothing like taking public funds for your business, and then having offshore tax havens, while your skimming operations know no bounds.","commenter_a":"No. It's not at all like taking a great Chagall or Picasso or anything remotely close #boybye","post_message":"“It’s like taking a great Chagall or Picasso or something,” New England Patriots owner Robert Kraft said. “You can never display it.”"},{"comment_id":"10153811889982994","commenter_b":"Isn't that what the looney bin was made for? Lock her up!","commenter_a":"Hansel and Gretel's villain just got made","post_message":"'May I have a taste?' Minnesota woman allegedly threatens to eat neighbors' children"},{"comment_id":"642298305928438","commenter_b":"she needs to bait Bill to keep him away from other lady`s","commenter_a":"Even if this is true, what does it say about Trump that he is so easily baited. Trust me Little Miss Bimbo, Trump doesn't need anyone to bait him, he finds ways to be an ass all by his lonesome.","post_message":"It isn't like he makes it really hard. I don't think he needs any help."},{"comment_id":"913240742032115","commenter_b":"this is not true...try 99999999x","commenter_a":"When you stand 10 x","post_message":"You Know You’re In A Black Church When…"}]
