[{"comment_id":"10153824341126955","commenter_b":"Who has a billion dollars for this nonsense? That obscene wealth needs to be redistributed!","commenter_a":"Sure it Berns now but it will itch latter.","post_message":"HILARIOUS"},{"comment_id":"1792755454298802","commenter_b":"Yeh and you and your daughter took some of those jobs to China.. hypocrite..","commenter_a":"Jonathan oh this guy. How many apologies will he have to make?","post_message":"US presidential candidate Donald J. Trump has issued this apology for obscene comments he made about women in a newly released videotape from 2005. Follow the latest on this story: @webpagelink"},{"comment_id":"10153183843753188","commenter_b":"Boy if they can do all that in Mexico why are they crossing our borders","commenter_a":"i just came home to Seattle from 10 days in Mexico and it made me think. I think it would be better to be in a country like Mexico if the world went crazy. Those people know how to survive on nothing because they have done it all their lives. They know what to do when the lights go out... they know how to grow food and take care of themselves. I can't even imagine what Seattle would be like if this area was thrown into the same poverty level as Mexico... it would be a mad house!!!","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"10152653245300671","commenter_b":"Then get off of their butts and go through and jump the hoops just like all of our legal immigrants.","commenter_a":"this is so wrong. Take care of Americans first. Illegal immigration is wrong. I don't care what country or why you came here illegally, if you were a kid you have had plenty of time to do it legally, yet too lazy......","post_message":"The Migration Policy Institute says about 1.2 million people are eligible for the plan under the DACA rules. But now many more would become eligible if the president expands the program to eliminate the age cap. That cap includes a Modesto woman who’s been in the U.S. since she was a teenager. Ron Jones has her story."},{"comment_id":"10153780845375530","commenter_b":"You can look it up!","commenter_a":"Columbus is neither hero nor monster. Indigenous people were screwin' each other over long before Columbus arrived. Don't like Columbus Day? Don't celebrate it.","post_message":"It was not clear when exactly the statue was vandalized. Detroit police were still looking into the incident when contacted."},{"comment_id":"10153837390443812","commenter_b":"No, just their sperm. Lol","commenter_a":"You mean survivors are contagious for nine months.?","post_message":"Doctors have found that Ebola can linger in some male survivors for up to 9 months."},{"comment_id":"10153700779194062","commenter_b":"No NOT all Latinos are Mexicanos but that would be the first place anyone of that Heritage will head too is that is MEXICO with the quickness !!! You can not hide here in TEXAS we can tell da difference now.. Everybody stands out now a days!!!","commenter_a":"So where is the other guy that was last seen with them now?","post_message":"More: Baytown Police said the bodies were found Thursday afternoon at FM 563 at Eagle Ferry."}]
