[{"comment_id":"933606760085373","commenter_b":"We should have dropped another one !","commenter_a":"He is the 1st president to do so, sometimes it takes a bigger man to start something else. Maybe after this the Japanese will come to Pearl Harbor and do the same. What is wrong with u people. The man is talking peace and yes what happened years ago was evil on both ends, it don't mean u can pay respects. I hope all presidents from around the world take a piece of what Obama has done to try and end hate because it seems like we are going backwards with trump being so popular. He's making it ok to be racist and hateful and it's not. Happy Friday y'all","post_message":"Pres. Barack Obama lays a wreath at the Hiroshima Peace Memorial, mourning the Japanese, Korean and U.S. victims of the world's first atomic blast in WWII. @webpagelink"},{"comment_id":"10153630601128433","commenter_b":"America the beautiful, oh how I miss her. Being offended is the new status symbol.","commenter_a":"Of the 13 attacks, how many went unanswered? How many were abandoned during the attack by their own chain of command? How many had their back up team be ordered to stand down? How many were blamed on a YouTube video?","post_message":"As Hillary Clinton testifies at a House hearing on Benghazi, a lot of you are digging back in our archives to look at a fact-check about past attacks on U.S. diplomatic personnel overseas. @webpagelink"},{"comment_id":"10155164817270093","commenter_b":"Hilarious. And I can't even fault people for mistaking it as serious because that IS how absurd feminists sound most of the time.","commenter_a":"Good one!","post_message":"Talking about mansplaining, manspreading and manslamming is not enough. We also must fight against manterrogating, manpacking, mansulting, and bropen-mouth chewing!"},{"comment_id":"10155007053899641","commenter_b":"Wow people","commenter_a":"Good for them. Sad dt did this to them.","post_message":"Mexico is ready to hit the US where it hurts: Corn."},{"comment_id":"10155783604970293","commenter_b":"If she was defending herself I hope she walks. Woman beaters should all end up like him.","commenter_a":"Likely another abused women who will be in prison for defending herself. I'm so tired of this happening!","post_message":"A Huntsville woman is being charged with manslaughter after her boyfriend died from his stab wounds."},{"comment_id":"10153918680501116","commenter_b":"Mexico take Texas, we will throw in the theocrats for free!","commenter_a":"So much for Hamilton and Madison's half baked notions about 'representative' government. How I wish California would secede from this corrupt Union...","post_message":"But Republicans are sticking with him."},{"comment_id":"10154456467843717","commenter_b":"Real Feminists Don't Kill Babies You just can't ban abortion. You can only ban safe abortion.","commenter_a":"You just can't ban abortion. You can only ban safe abortion.","post_message":"The ban is expected to be challenged in court."}]
