[{"comment_id":"10154382177016756","commenter_b":"Kyle, bad news for you. I'm a Bernie supporter. I'm just not up my own ass about it like so many of the rest","commenter_a":"Thank you for stating the obvious @username. This isn't about winning anymore. It's about spreading the message. This movement isn't going away. And we'll keep donating to see him through, because the message is important. Bernie Sanders, the nobody socialist senator from the boonies, almost took down the strongest possible candidate the establishment could put forward. He did it against rigged elections, big money, money laundering, and voter suppression. Him and our 27 dollar donations.","post_message":"As of March 31, there were 896 people on the Sanders payroll. The campaign says it will retain more than 300 staff."},{"comment_id":"966056150146121","commenter_b":"Slow learners. Blacks keep voting Democratic even though Dems have done nothing but baby them and keep them down.","commenter_a":"They STILL haven't learned about the democrats !!!!!!!!!!!!!!!!!","post_message":"LANDSLIDE"},{"comment_id":"10153537278823984","commenter_b":"Women in that cult are beaten and stoned and daughters married off at nine. Honor this way of life????","commenter_a":"Emperor PINOCCHIO is trying to make his MUSLIM brothers happy!","post_message":"News of this has been met with sharp criticism by many.   Do you believe the military is enforcing policies hypocritically?"},{"comment_id":"1773738762840165","commenter_b":"Yea but she doesn't wear that dress well as Melania .Petty old lady","commenter_a":"This is just tacky and remarkably low class.","post_message":"10/10 burn. 🔥"},{"comment_id":"10153840727706341","commenter_b":"Not allowed in Israel!","commenter_a":"Hmmmm,its agreed if the Arab (Muslims)will condone their daughters marrying a Jew husband.But how about the Jews too?will they agreed their daughters to marry an Arab?","post_message":"More than half of the French-Muslim adults surveyed would react positively if their daughter married a Jew."},{"comment_id":"10153118499596955","commenter_b":"Hemlock, anyone?","commenter_a":"These stories are being given as some form of programming... The nation was taken over and completely changed post Lincoln and forever altered for the globalists post JFK... If they want to move a major agenda forward they throw the nation off by creating spectacular distractions... This is subtext leading to a possible grand piece of theater.","post_message":"'Drunk' Secret Service agents disrupted bomb probe..."},{"comment_id":"1076528565795194","commenter_b":"Let's see ... when he said, \"yes she broke the law, but we don't think it rises to the level of prosecution... \" everyone was happy. Now something changed that ... something explosive enough to convince someone who supported and did everything to protect Hillary ... that \"something\" is enough for me to say I CAN'T TRUST HER! WHERE THERE'S SMOKE... THERE'S A FLIPIN' INFERNO!","commenter_a":"www.mostdamagingwikileaks.com","post_message":""}]
