[{"comment_id":"10153659617321323","commenter_b":"What about the kids, which is the entire point of the article?","commenter_a":"Just one big difference here. Kyle has asked for privacy, and presumably won't be going voluntarily onto TV shows to discuss his divorce. The people that appear on his show do so voluntarily, so are obviously less concerned about privacy for their issues. Stop trying to compare the two. Theirs no hypocracy here.","post_message":"\"What does Jeremy Kyle think is more likely: that a child’s parent or parents appearing on his show will constitute a mere 49 minutes in their childhood, or that its ripples will magnify that car-crash public event enormously – grotesquely – into something that cannot fail to be formative, and endlessly repercussive in its damage?\""},{"comment_id":"1790206457902451","commenter_b":"Michele Obama said Hillary can't run her own house, how can she run the White House","commenter_a":"Bring the jobs back. Throw out the Chinese fakes","post_message":"WATCH: Hillary Clinton and Donald J. Trump go head to head in the final presidential debate, live from Las Vegas."},{"comment_id":"1242224722465203","commenter_b":"\"because they make decisions based on gut feeling and emotions\" - And here come the Facebook comments that'll prove just that. *sigh*","commenter_a":"I'm sure some don't, same with men.","post_message":"This person is also a board member of Women in Science and Engineering. -_-"},{"comment_id":"10152865609926336","commenter_b":"That is insane.what is wrong with her.father","commenter_a":"It's obvious the parents are watching. But, I wouldn't have chanced that. You never know when a preditor will change it's mind and attack. If it had decided to attack and start constricting around the child, they may have had trouble getting it off before it did harm, even with them watching. I don't think the child here is being abused or neglected, that obvious in the film. With all animals, things can go very wrong, very quickly.","post_message":"This video footage of a 14-month-old girl playing with the family pet might make you a little nervous."},{"comment_id":"10154269648496509","commenter_b":"The Old Testament also says if a woman is on her period she needs to live in a hut.","commenter_a":"What kind of gun would jesus own?","post_message":"Las Vegas Assemblywoman Michele Fiore is drawing cheers and jeers for making firearms a family affair in this holiday card. @webpagelink"},{"comment_id":"10153617049593984","commenter_b":"Hillary's a woman chaser to.","commenter_a":"Bill has Always been a Woman chaser... Hillary Must been doing something Wrong... Or she's to busy Scamming People out of their Money.....","post_message":"This woman has struck fear into the hearts of the Clintons for a long time. Now she may have just landed a knockout blow on Hillary... This could be what takes Hillary down. Do your part to make sure that happens by spreading this article to your friends and family."},{"comment_id":"10153102979511545","commenter_b":"I heard of it last night on the news. Disgusting!!!","commenter_a":"@username have you heard about this?","post_message":"Just in: This is gross..."}]
