[{"comment_id":"1733106183573180","commenter_b":"Liar, murderer and thief! Hang that bitch.","commenter_a":"She is such a P.O.S. lol, if there is nothing to hide then why not release them, it's ridiculous! No one is asking for others transcripts, just her's because she is a proven liar...anyone supporting this woman needs to really see the truth and stop denying what she really is.","post_message":"During last night's debate, CNN moderator asked Hillary three times why she won't release transcripts of her speeches to Wall Street banks if there's nothing that she's trying to hide from voters. Do you think Hillary Clinton is hiding something in those speeches?"},{"comment_id":"916726885042526","commenter_b":"Such a FOOL !!","commenter_a":"He must be hitting the bong again","post_message":"President Obama said he thinks he's been a pretty good president, and he could win if he ran again. What do you think? Read more at @webpagelink"},{"comment_id":"1324175080956294","commenter_b":"You'd rather vote for Killary That murdering lier. God help us.","commenter_a":"Can't imagine any decent American voting for this clown!! I'm not the biggest Hillary fan but anything is better than this. Use this weekend while we spend time with family and friends to first of encourage people to VOTE. And then let them know the evils this dude is spewing. We've come too far to let this dude take us backwards!!","post_message":"Just when you thought Trump couldn’t get any more racist and misogynist, he manages to lower the bar of human decency."},{"comment_id":"604349323031583","commenter_b":"You're an idiot. It doesn't matter what book you use to swear I could use The Heir to the Empire by Timothy Zhan and that would be acceptable. This is a secular country not a Christian nation if you want to argue that fact look up the 1st ammendment which is the freedom of religion and freedom from religion in addition to separation of church and state. If she wants to use the Quran let her if you want to use the Bible fine if I want to swear on a star wars book damn those corrupt judges I'm going to swear on my Star Wars book","commenter_a":"No. We use the Bible in this country.","post_message":"Should he have allowed her to take her oath on the Koran?"},{"comment_id":"10154436464143931","commenter_b":"The wall will stop a lot of illegal aliens because they don't usually go thru tunnels. The tunnels are for drugs. They don't want a lot of people knowing where the tunnels are because if the people get caught they will snitch on the tunnels location. That's why they use the tunnels for drugs not people","commenter_a":"The drugs are smuggled thru tunnels underground.","post_message":"A wall would do little, if anything, to stop the flow of illegal drugs - the majority of which are actually smuggled though checkpoints."},{"comment_id":"10155829380115354","commenter_b":"Give it up Rubio!","commenter_a":"Of course he did!","post_message":"16 days after Trump gave his speech... why not stick his neck out before the media created this bandwagon?"},{"comment_id":"1582705788695822","commenter_b":"Hillary Will be President!!","commenter_a":"Liar. Killer. Cold hearted, some one please drop a house on her","post_message":"Thank you, California!"}]
