[{"comment_id":"10153421158184726","commenter_b":"The Confederates nearly destroyed the United States!! They were slave owners and rouges! You lost the war now get over it and burn the damn flag!!!!","commenter_a":"The subject of slavery needs to be relegated to history books and musems right along with the battle flag of the Confederacy. I sick of hearing in about slavery, let's talk about dinosaurs -they don't exist either.!!!","post_message":"WATCH: Rand Paul: It's Time to Put the Confederate Flag in a Museum... Do you agree with Paul?"},{"comment_id":"10153875809248352","commenter_b":"Thank you Doriaan. This bitch hatin ain't she?","commenter_a":"Instant reflex nigga don't touch me while I'm performing bitch you lucky that's all you got...KEVIN GATES THAT MOTHAFUCKING NIGGA","post_message":"RAPPER BRUTALLY KICKS FEMALE FAN BECAUSE SHE TOUCHED HIS SHORTS. REALLY? #DISGUSTING"},{"comment_id":"782076235316287","commenter_b":"Go now obama!","commenter_a":"Yes please leave if you are offended by our flag or if you disrespect it. LEAVE","post_message":"SHARE if you agree!"},{"comment_id":"10153272764696045","commenter_b":"Steals from children and drives drunk to possibly kill someone. She needs to be in jail.","commenter_a":"Mandatory Rehab and therapy","post_message":"Amy McArthur Balch is currently being held in Morgan County Jail with no bail."},{"comment_id":"10152942237502452","commenter_b":"My question is.... Wtf was she doing in lake elsinore....","commenter_a":"Why was she in Lake Elsinore?","post_message":"The owner of Wolfee Donuts in Lake Elsinore wants an apology from Ariana Grande after surveillance video allegedly caught the pop star licking doughnuts at his shop. abc7.la/1CqmnVO   Grande also says \"What the **** is that? I hate Americans. I hate America\" when a tray of doughnuts appears in front of her."},{"comment_id":"10157552769965725","commenter_b":"IF YOU SAW HANNITY'S TOWNHALL WITH MR. TRUMP TONIGHT- NO PARENT WOULD VOTE FOR KILLARY!! #BUILDTHATWALL!","commenter_a":"I mean that's true, but what are you going to do about that? I guess grow a garden, but then you can only harvest every year, maybe twice a year if you plant early","post_message":"Thank you TEXAS!  We are going to declare our independence from failures of the past and create a New American Future.   Once again, we will have a government of, by, and for the people. Americanism, not globalism, will be our credo."},{"comment_id":"698436883649598","commenter_b":"What's the deal with these frogs.","commenter_a":"One of his few good decisions. General Mattis is a fucking fantastic choice","post_message":"Trump wants a military vet to be secretary of defense for the first time in over 60 years."}]
