[{"comment_id":"10154308160836509","commenter_b":"Shes done far worse with all the deleted emails and benghazi blood on her hands","commenter_a":"She doesn't have room to talk","post_message":"Will Hillary Clinton give Bernie Sanders a pass on the data breach or will she tear into him during tonight’s #DemDebate? @webpagelink"},{"comment_id":"10153811229123433","commenter_b":"1. Hardly \"record\" when the number of abortions is going DOWN. In 1990, there were 1.6 million abortions performed. Today, it's a little over a million. Numbers don't lie. 2. Hundreds of thousands of women were getting abortions BEFORE Roe V Wade legalized them. You are more likely to die due to childbirth/pregnancy complications than an abortion. 3. You are contributing to your own problem. Teens that had received comprehensive sex ed were 60% LESS LIKELY to get pregnant. The states with abstinence only education have HIGHER rates of teen pregnancy compared to states that actually teach sex ed. Why do women get abortions? Unwanted pregnancy. Much less likely to get pregnant when you're using contraception. It's not rocket science. 4. Abortion isn't free. The Hyde Amendment prohibits any federal funding of abortions except in the case of incest, rape, or danger to the life of the mother. They most ...","commenter_a":"What do you call 350k annually, or 10,000 late term per year how many is \" record\"?@webpagelink","post_message":"From the trail in Iowa. Carly Fiorina wrongly claims that we're seeing \"record\" abortions. @webpagelink"},{"comment_id":"635093840035049","commenter_b":"The only duty this bitch understands is money and do what frump trump Hitler wants !!","commenter_a":"Hopefully she will realize that she is in way over her head and resign.","post_message":"Betsy DeVos has demonstrated she has a rudimentary understanding of the issues facing our students, teachers, and schools, which should have disqualified her from serving as Secretary of Education. She possesses no experience with the public education system as either a student, parent of a student, educator, or professional working on education policy. Now that Ms. DeVos is confirmed, she is charged with the responsibility of advocating for and protecting ALL students regardless of their background. I hope that she will fully embrace this duty."},{"comment_id":"809566335745494","commenter_b":"So women are just as bad as men, better just keep it men. Got it.","commenter_a":"Sorry but all woman in politics have proven just as deviant and en n efficient as men. So let's not rush anything. They should be recognized for there merits. So are the men that have no connections and money. But stile do amazing work","post_message":"Powerful."},{"comment_id":"10153448214053984","commenter_b":"That lady has a problem nice in front of kids","commenter_a":"He was absolutely right in what he did. People like her should be called out. They have no respect for any rules, they think they don't apply to them.","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"1557919144505066","commenter_b":"Absolutely! The party comes first to Republicans.....the people and the country are not important until they can be used to the advantage of THE PARTY. Sad","commenter_a":"Honestly, I'm worried about 'merica if trump is such an overwhelming decision for them to make. Consider the members of the Republican party, they're going to vote trump because he's not a Democrat. That means, party alliance is more important to them then things like racism and ignorance. Give me a break.","post_message":"President Obama slow jammed the news and also talked about Donald J. Trump, Hillary Clinton and Bernie Sanders."},{"comment_id":"999092436786383","commenter_b":"Somebody needs to go to jail, start with Lois Lerner.","commenter_a":"About fucking time","post_message":"Here at RedState, we’ve already spilled a lot of digital ink covering the IRS scandal."}]
