[{"comment_id":"1089012597882184","commenter_b":"ANTI AMERICAN ASSHOLES","commenter_a":"That's what jackass's do!","post_message":"ClashDaily.com"},{"comment_id":"10153216213261717","commenter_b":"Skars the reason people are so upset is because the bitch is a fucking lesbian for god sakes","commenter_a":"caitlyn jenner may be transgender but she doesnt believe in same sex marriage. she isnt an insparation at all. shes a selfish bitch","post_message":"Caitlyn Jenner prays with fervently antigay preacher"},{"comment_id":"1284368551656196","commenter_b":"It is true that staying home and taking care of the kids is cheaper but also if both parents are working to meet their needs then they can apply for daycare help to cover daycare instead of staying home and collect food stamps and cash from the government.. I'm a single mother and I was working full time and couldn't afford daycare or a full-time nanny and I did went to get help and they cover the daycare or babysitter cost...some people work half on the books and half off the books just so they can collect government help I see it every day...","commenter_a":"Is taking care of several under school age children not a full time job That mothers are not getting paid for. What should they do . For food .","post_message":"EXACTLY!"},{"comment_id":"10154442761894094","commenter_b":"Hopefully the other morons follow his wise protesting technique on Friday. Idiot.","commenter_a":"cool..or should i say hot...lol","post_message":"Two days before the inauguration, one man has started his crusade against President-elect Donald Trump, and it nearly cost him his life."},{"comment_id":"517613611762552","commenter_b":"@username must be an ignorant stinking liberal!","commenter_a":"Why can,t we ban liberals ???????","post_message":"Liberals are trying to get rid of one of your favorite snacks. Stop being so sensitive. We need to put a stop to this. Do you agree Liberals pushing their beliefs on you?"},{"comment_id":"10153828491470329","commenter_b":"marry me","commenter_a":"@username 2, especially 2","post_message":"We might as well put a ring on it at this point."},{"comment_id":"1729905883960126","commenter_b":"That's ridiculous! Stupid woman","commenter_a":"As abreast feeding mother of two.................... She's crazy!! Get organised for Gods sake!!!","post_message":"She was breastfeeding her son in the pool while the wave machine was on"}]
