[{"comment_id":"1125870684199336","commenter_b":"If just like to see her run away!","commenter_a":"Please, NO !","post_message":"Would you like to see Michelle Obama run for office one day?"},{"comment_id":"1741973229385885","commenter_b":"Cus your race isn't nearly as low as the natives or Jews and why do you think you deserve it the Jews didn't get land they might of got paid....but I witness frist hand blacks recive way better benefits then whites or natives.... so natives got land Jews got money blacks got freedom with rights along with benefits what makes the blacks so special to recive more","commenter_a":"Of course, it's okay for them to be racist, but when white people say something we get beat up. Love hypocrites","post_message":"Brian Ogle's mother says her son responded to students wearing Black Lives Matter T-shirts at his school with \"Blue lives matter,\" a defense of police officers. Officers found him bleeding on the ground after a homecoming football game."},{"comment_id":"1692723517682991","commenter_b":"One of you crazy ladies is from Texas.","commenter_a":"Realism is not what I see coming from most of HRC's supporters. There are some extremely hard to admit, and in fact, frightening facts that I think we have all tried to glaze over for years. In Bernie Sanders we have got a candidate that is addressing those facts. Climate Change is real, most democrats are no longer climate change deniers, but I feel like the real threats are being overlooked. For example, droughts are happening all over the United States. We are quickly depleting our fresh water aquifers. When one factors Fracking into this, we are willfully allowing our government to destroy more of our fresh water systems. HRC cannot denounce Fracking. Now, before you think that article that spells out how much HRC is taking in campaign contributions from the fossil fuel industry is another Republican smear tactic, note that it is by Greenpeace. She has to go. ...","post_message":"\"We can open the door to every person in this country again.\" —President Bill Clinton"},{"comment_id":"10154674259718941","commenter_b":"Shuttle up Hillary","commenter_a":"Does she see this as a chance to get more bribes? If not, this will pass.","post_message":"Hillary Clinton: \"I stand with the people gathered across the country tonight defending our values & our Constitution. This is not who we are.\""},{"comment_id":"1776428082627538","commenter_b":"I pray to God that people who think she would be a good president, realize how wrong they are. I don't know that Trump would be good, but so far he seems better to me than her. Sadly the Libertarian candidate has too many views that are not on par with me and it is in the areas that matter most to me. Trump shares my stance on all of the issues that have come out thus far.","commenter_a":"TRUMP....you better not bail on us man. You're our only hope!!!","post_message":"Hillary Clinton Finally Tells The Truth: Pledges She Will Raise Taxes On Middle Class"},{"comment_id":"10156237549955231","commenter_b":"Apples and oranges. American problem vs not America's problem","commenter_a":"White Christians have committed more acts of terrorism in America than Muslims. Some of you are clearly stupid & misinformed","post_message":"It doesn't help that Trump has been \"fanning the flames\" with his anti-Muslim talk."},{"comment_id":"10153875046907235","commenter_b":"So did Ollie North! The fuckery.......","commenter_a":"\"Former United States Attorney general sold guns to drug cartels.\"","post_message":"WHOA"}]
