[{"comment_id":"10154462042369062","commenter_b":"Lmao... Con el nopal en la frente y encontra de illegales.... Everyone with a hispanic latino last names shall research theyre ancestry our families come from illegal immigrants","commenter_a":"We are not 'united' and Trump is not racist. I am against illegal immigration and support Trump!","post_message":"It translates to, 'United Latinos: Don't vote for racists.'"},{"comment_id":"10153547660103854","commenter_b":"Hates those who serve. Loves the illegals","commenter_a":"Scum of the earth","post_message":"ULTIMATE BETRAYAL: Obama To Cut Healthcare Benefits For Active Duty And Retired Military"},{"comment_id":"10157758385010725","commenter_b":"Hillary is a crimnal so are the Radical Muslims and the Fence jumpers deport them all Wait for it","commenter_a":"aye lmao","post_message":"Thank you for the great 'TRUMP' welcoming, Virginia! I realize that takes a lot of time & coordination - and I am grateful to you all, for your support! -DJT"},{"comment_id":"10153368825000329","commenter_b":"Christine, go read the bible or something.","commenter_a":"Congratulations... you all look like lesbians.","post_message":"The students coordinated wearing flannel shirts and wrote 'anti-gay' on their hands, after the school's Gay-Straight Alliance held a 'Day of Silence.' (via BuzzFeed News)"},{"comment_id":"10152911718959342","commenter_b":"Start lining up Muslims and illegals until they leave!","commenter_a":"Amen and Amen!!!","post_message":"FIRING SQUADS MAKING A COMEBACK? Utah -- the only state in the past 40 years to carry out a death sentence by firing squad -- is poised to bring back the Old West-style executions if the state cannot track down drugs used in lethal injections."},{"comment_id":"1108181272536216","commenter_b":"thats how i hid my virginity, yeah do that","commenter_a":"Cilian they're coming for reggie","post_message":"This is awesome."},{"comment_id":"1190105204361047","commenter_b":"Hang the bitch!","commenter_a":"Takes time to plan a coronation!!","post_message":"Hillary thinks she's already won. This kind of sick behavior is UNACCEPTABLE in a constitutional republic!"}]
