[{"comment_id":"998513920215363","commenter_b":"girl needs to sit down","commenter_a":"LOL @username","post_message":"Yeah, Um....No."},{"comment_id":"10153395954276051","commenter_b":"It's a deformed pig fetus.","commenter_a":"Yea right.","post_message":"When a woman found this bizarre creature in her backyard, she was completely horrified."},{"comment_id":"1800107736923413","commenter_b":"FALSELY MY ASS... CNN ( CLINTON NEWS NETWORK) HAS BEEN LYING TO US (WE THE PEOPLE) FOR EIGHT YEARS! ENOUGH WITH POLITICAL PROPAGANDA, ENOUGH WITH PROPAGANDA. BRING BACK JOURNALISTIC INTEGRITY OR GET THE HELL OUT OF THE BUSINESS, WE WILL NOT GO DOWN THE ROAD TO SOCIALISM. WE WILL FIGHT, WE WILL WIN.","commenter_a":"Sieg heil!!! ;-)","post_message":"A free press is a pillar of democracy. So when Trump called CNN \"fake news,\" this Fox News anchor chose to stand by his fellow journalists."},{"comment_id":"10153852965454705","commenter_b":"She's a liability. Period. I wouldn't let someone like that work for me.","commenter_a":"She worked too hard to become a doctor to get fired, she should do community service and pay a fine and formally apologize to the Uber driver. We've all done/said stupid things while drunk.","post_message":"An internal investigation will determine any disciplinary action, including possible termination."},{"comment_id":"10153266437101336","commenter_b":"Real biker gangs are way more dangerous than the pretty actors on that show made them seem.","commenter_a":"They all must have watched a marathon of Sons of Anarchy this past weekend","post_message":"UPDATE: Police adjust the number of people arrested from 192 to 170. \"This is probably one of the most gruesome crime scenes I've ever seen in my 34 years of law enforcement.” – Waco police Sgt. W. Patrick Swanton @webpagelink"},{"comment_id":"10153238674498984","commenter_b":"this bitch will have blood on her hands","commenter_a":"good now i have more reasons to cut myself and attempt suicide.... this really set me off ..","post_message":"What she said about \"fat white Americans\" and \"racist white conservatives\" is absolutely sickening... Are you outraged by these comments?"},{"comment_id":"1642912372619537","commenter_b":"Very nice & her tiara stayed on!!!","commenter_a":"Awesome","post_message":"These two turned up the HEAT!"}]
