[{"comment_id":"10153974318380496","commenter_b":"Let them protest but not riots, vandalism and violence. These people r starting to scare me. Saw a sign outside trump towers saying rape melania and kill trump. What kind of people r they. Trump has to stay cool and not start tweeting.","commenter_a":"Thank God someone with common sense.","post_message":"While protests in Atlanta and around the country have been peaceful, that isn't the case for all. Now a major city's officials are saying that enough is enough.  “If you’re upset with the election, please don’t come out and protest,” the city's police chief said. “We are done with criminal activity in this city. It’s time to move on and to move forward.”"},{"comment_id":"10152969085332623","commenter_b":"Lock up your wives.","commenter_a":"Filling out that trophy case.needs that one for the set!lol","post_message":"Tiger Woods has entered to play in next week's Wyndham Championship in Greensboro:"},{"comment_id":"1055977171151281","commenter_b":"What do you expect from this Muzzie piece of shit.","commenter_a":"...and what did Obummer fight...Oh I know...golf par...didn't happen !","post_message":"***PATRIOT ALERT*** 'It is the inescapable duty of the Congress of the United States today to censure President Barack Obama for casting doubt on the sacrifices and motivations of the Americans who fought the Second World War—on the eve of Memorial Day, no less.'"},{"comment_id":"10153979603521509","commenter_b":"Time for all illegals to go home","commenter_a":"Rather have trump in kkk then black panther party","post_message":"Former Ku Klux Klan leader David Duke said Donald J. Trump is the 'best of the lot' -- but didn't endorse him for 2016: @webpagelink"},{"comment_id":"10153000609386491","commenter_b":"The Russian lady nailed it. For me, I don't want kids and that is unacceptable to so many people. She only wanted one and that was JUST AS UNACCEPTABLE! We know what we want our families to look like. Trust us, we're women!","commenter_a":"I respect your decision to not have kids. Some people don't. It's an important job that should only be done by people who want you. BUT, I think making a decision like that at 28 years old was a little rash. A lot of things change. I had my daughter when I was 39 years old. Things that make you happy in your 20's are not necessarily going to be the same for the rest of your life. And, don't be sad for people who tell you that there is no greater love than one for a child. There isn't!! Don't knock it just because you don't understand.","post_message":"“What I want is to be happy.”"},{"comment_id":"1015237518591880","commenter_b":"When I look at her boobs she spins all the way around. Her face goes halfway then comes back","commenter_a":"Prefer not to care","post_message":"Is she spinning right or left?"},{"comment_id":"778536202281765","commenter_b":"Lynette Houdek You really need to take a class in comprehension. Trump said he would renegotiate the trade deals so America gets a fair deal. You speak of the Colorado fiasco. What is crooked about it is that they locked the Trump delegates out and removed their names from the ballot. That is called rigging the election. Please take the class I suggested.","commenter_a":"Krauthammer, you think Cruz could handle China. Trump has done business with the Chinese. He know's what he is doing. The business in Colorado is a disgrace. Trump delegates were turned away and their names scratched off the ballot. Does that make you proud of our 'Banana Republic'???","post_message":"Is Krauthammer right?  WATCH:"}]
