[{"comment_id":"10153824664946336","commenter_b":"Just like Starbucks, learn to cook woman","commenter_a":"So many people falling for this. Of course the government wants everyone against Chipotle, because it's the first popular public chain against GMO's, which makes the government food companies look bad. I'll still be eating at Chipotle; everything they serve is still way better for you than the majority of fast food restaurants.","post_message":"The Chipotle Mexican Grill stores can open after they replace all produce, do a deep cleaning of their stores, pass a local health inspection and start a new protocol for cleaning produce."},{"comment_id":"10154235366227060","commenter_b":"Yea and Mardi Gras day they'll be showing their breasts for beads!!!","commenter_a":"Yall be safe.....show them","post_message":"The Women's March New Orleans begins now from Washington Square Park."},{"comment_id":"10153000542416336","commenter_b":"tHE aTHEIS GROUP NEEDS TO STOP MAKING TROUBLE. IF THEY DON'T LIKE ANGELS ON THE MEMORIAL MOVE ON WE SURE DON;T WANT YOU.","commenter_a":"What about a Christians First Amendment rights?????? I am so sick of all this...","post_message":"An atheist group wants angels removed from a teacher's memorial, claiming its presence on public grounds violates the First Amendment."},{"comment_id":"10153394565113984","commenter_b":"As my friend @username said, stone the bitch!! I agree","commenter_a":" sorry, I can't take her seriously.","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing...  Do you think this Boston bomber got what he deserved?"},{"comment_id":"10153665573326077","commenter_b":"Yep bet you never did anything wrong in your life","commenter_a":"Wth is wrong with kids nowadays... Everyday they are up to something crazy !! Yesterday was drinking fuel with soda , today is this , tomorrow?? What??","post_message":"Have you heard of the \"duct tape challenge?\""},{"comment_id":"10154798309806002","commenter_b":"Women do it too!","commenter_a":"Why would u allow a man to babysit your kids hell no only man I'd allow is my father and my husband","post_message":"A 30-year-old man allegedly molested toddler-age children he was babysitting while living in Michigan."},{"comment_id":"10153134733596037","commenter_b":"A lot of women where I live buy as much jewelry. I don't think its extraordinary.","commenter_a":"As with Obama, the focus on a first lady is just a witch hunt. Jeb has enough of his own baggage to drag around.","post_message":"#JebBush's wife #ColumbaBush joins a long list of political spouses with a taste for extravagance. Yahoo News' Dylan Stableford reports."}]
