[{"comment_id":"10153477114308984","commenter_b":"She's obviously trashy","commenter_a":"Am I the only one that saw that woman get out of that scooter, clearly nothing wrong with her","post_message":"This woman's young son got involved in her brawl with another Walmart shopper, and the video took the internet by storm. Now she's speaking out to defend their actions...  Do you think her son's behavior was unacceptable?"},{"comment_id":"796247023857405","commenter_b":"Her mouth is perfectly formed for Donny DOUCHEBAG ...","commenter_a":"DISGUSTING human being !!","post_message":"This woman is a disgusting POS!"},{"comment_id":"943377485718781","commenter_b":"Never Bernie. This Latina will vote for Hillary.","commenter_a":"'@username mil veces mi voto para ti..!!","post_message":"'Para el Señor Trump, solo tengo una palabra.'"},{"comment_id":"10153738179686037","commenter_b":"She is looking for $$$. Obamacare is expensive","commenter_a":"Good for her! Everyone else is expected to do their job the way it's suppose to be done..why shouldn't this doctor? Most doctors don't like to be questioned or for you to have an opinion. She ruined this wonderful experience for these parents. Birth is a day to day normal thing for her but for the parents it's something they will never forget. Some docs need to get off their high horse and realize they're not always right!","post_message":"“I can’t be the only person out there this is happening to,” Lindsay Scarborough Switzer tells Yahoo Parenting."},{"comment_id":"10154705927224255","commenter_b":"Pence is no more Christian then I am, but at least I am not a hypocrite. I don't believe at all.","commenter_a":"For as bad as Trump is, Pence is just as horrible and probably more terrifying since he tries to hide his awfulness behind his bible and has no problem signing bills into law that he doesn't even read. With Trump being 'one of the most impeachment-ready candidates ever” Pence is who would be running the White House. Here are just a few of the deplorable and insane things that Pence has done in his career of screwing over Indiana and what we could expect as a Pence run administration. - He looks up to Dick Cheney as a role model for Vice President...that alone should scare the crap out of folks. - He regularly goes blank, forgetting what he was saying, and seemingly losing track where he is and what he is doing. - He is anti-science. - He has made a career out of destroying Planned Parenthood, Roe v ...","post_message":"Bravo, Tim Kaine!"},{"comment_id":"10153280384163812","commenter_b":"Stfu bitchass","commenter_a":"Time to eliminate this threat to life.","post_message":"He's back, but this time, instead of just going for a leisurely stroll, Goliath the massive alligator is spotted trying to eat an entire turtle on his Florida golf course: @webpagelink"},{"comment_id":"1174610022559026","commenter_b":"Build a wall , deport all illegal but no one will believe you","commenter_a":"Send them and their anchor babies home where they belong ,, Trump in 2016 ,,, I'll help with the roundup for free ,,,","post_message":"'@JebBush faces Trump-led headwinds in attempt to change the GOP's tone on immigration."}]
