[{"comment_id":"10153133870041350","commenter_b":"Girl, u r so crazy. LOL!!","commenter_a":"I'm from the old school. My house, my rules. If a child misbehaves, I don't wait for the parents to take action; ESPECIALLY if the little brat hits me. I'll tear that ass up. I wish my daughter would have acted up at someone else's house to the point that they would even have to consider disciplining her. They wouldn't have time because I'd been on her ass. Don't like it, keep the little untrained savage home.","post_message":"Do you think it's OK to discipline someone else's child? Share your opinion in the comment section below. #OrangeRoom"},{"comment_id":"10153122527121051","commenter_b":"Freedom bitch do something about call for help911 ..","commenter_a":"Hey Gonzalez: take your ass back to Mexico since you think you should fly the American flag upside down and the Mexican flag next and in equal position to the American flag. I was born in Cuba but will never fly a Cuban flag. I am an American and there is only one flag for me. You want to disrespect my flag and fly that rag of yours, go the hell back. BTW, you think there is racism against Mexicans, look at the way you act and then see if you can come up with any reasons American citizens might have a problem with Mexicans.","post_message":"An outraged military veteran took one look at this man's flag display and intervened. Soon after, he got a visit from the police"},{"comment_id":"10152653959642894","commenter_b":"my wifey cnt marry ciara's nigga #loveTINASHE","commenter_a":"hmmmmm \"HOW MANY TIMES\" we gonna hear that lie....I love Tinashe but when I found this out...lost so much respect for her. You know it's gotta be true....if you listen to \"How many times\" you know it...and....Ciara been hurt too many times so....she just gonna leave her baby daddy for NO REASON? Oh.....ok","post_message":"Tinashe Denies Rumors That She's Dating Future, Says It's '100% Made Up and Untrue'"},{"comment_id":"10154044845821320","commenter_b":"Will it turn into ice by the morning","commenter_a":"Stay warm all from sunny California.","post_message":"Mike Woods updates the storm. Be sure to download the free FOX5NY WEATHER app to get Fox 5 weather on the go."},{"comment_id":"10153427070736749","commenter_b":"BAN ALL THE POLITICIANS AND YOU WON'T HAVE ALL THESE STUPID IDIOTIC LAW'S WE HAVE TODAY WHERE THEY ARE TRYING TI TAKE ALL OUR GUN RIGHTS AWAY! OUR FOUNDING FATHERS OF THIS GREAT NATION ARE PROBABLY TURNING OVER IN THEIR GRAVES RIGHT NOW THINKING WHAT, WHERE AND WHEN THE NEXT CIVIL WAR WILL BE HERE IN THE U.S.A. WE NEED TO CLEAN HOUSE OF ALL THESE ELECTED OFFICIALS AND ELECT NEW BLOOD INTO THE OFFICE! CASE AND POINT MADE.","commenter_a":"Time to get EVERYONE trained properly on gun safety! Time to re-address the mental illness issues...","post_message":"Gun violence shouldn't be so commonplace. It's time for Congress to do something about it. @webpagelink"},{"comment_id":"10153091738774071","commenter_b":"Tesla already solidified its royalty by breaking the consumer report ranking system 😜","commenter_a":"\"While Porsche's Concept Mission E is just a concept now, Porsche said that it aims to begin production in the next five years.\" The cheaper Tesla will be out by then and Tesla Motors will solidify it's spot as the king of e.v's.","post_message":"The future of Porsche? (via Tech Insider)."},{"comment_id":"10157037705625725","commenter_b":"@username ILLEGALS","commenter_a":"This legal Latino is voting for Trump! Like if Donald Trump has revived your patriotism and faith in your country!","post_message":"We need strong borders to keep our country safe!"}]
