[{"comment_id":"10153179958482377","commenter_b":"I agree - feed her to pigs and feed the pigs to refugees!","commenter_a":"Feed them to pigs, then send the excrement to Mosques","post_message":"No Muslim mosques have offered to conduct a funeral for the terrorist wife. If not claimed, her body will be cremated at taxpayers' expense but there's more...@webpagelink"},{"comment_id":"806970826068192","commenter_b":"shes a scum and should of been executed","commenter_a":"20 years later omg you mean this scum is not dead yet?","post_message":"\"I was a good mother and I loved my boys.\""},{"comment_id":"909853555777564","commenter_b":"7 officers injured and one unresponsive..... Rioting, looting and destroying public and private property is not the answer. Attitudes of revenge and justification only feed into the hatred.","commenter_a":"Has anyone died from a spinal injury from one of these rocks? Oh...","post_message":"Developing: Reports of youth throwing rocks at police in Baltimore."},{"comment_id":"10153547017035950","commenter_b":"There is no excuse for paddling in school. Sounds like mom has serious issues too.","commenter_a":"He has missed 18 days of school, he's got in two fights this week, he spit on a kid and his mother is on the verge of going to jail not only because he has missed school but because of things she does in her personal life. If she doesn't want to be a parent to that child somebody has to be.","post_message":"\"It was not a spanking. It was abuse,\" said the boy's mother."},{"comment_id":"1661665617421412","commenter_b":"Ignorant dick shouldn't of been running his mouth and chest bumping him. No pity","commenter_a":"Why was the reporter saying \"F you\" to the agent? Why did the agent feel such a response was needed? Enjoy the circus.","post_message":"A photographer was choked and slammed to the ground by a Secret Service agent during a Donald Trump rally in Virginia today. @webpagelink"},{"comment_id":"435485493243158","commenter_b":"Criminals don't get one...why require them for law abiding citizens","commenter_a":"i cannot believe how brainwashed and idiotic everyone is, you actually believe concealing more weapons, allowing no permits and actually believing it is the right thing to do because its in your constitution is fucking ridiculous, lets see how many more kids are massacred in schools now that shooters can conceal their weapons","post_message":"Good idea?"},{"comment_id":"10153677449116336","commenter_b":"Have you ever noticed it's always pretty women getting killed? Eat more cheeseburgers.","commenter_a":"Yolanda Mejia","post_message":"A body found on a rural property in northwest Spain is most likely that of Denise Thiem, an American woman who went missing while walking along a pilgrimage route, Spanish officials said."}]
