[{"comment_id":"10152687758547093","commenter_b":"That woman has NO business with a baby.","commenter_a":"Wat is happening to these people ADOPT a baby,dam.","post_message":"HORROR: This woman is accused of cutting the baby out a pregnant mom who answered her Craigslist ad for baby clothes... @webpagelink"},{"comment_id":"1583049088381782","commenter_b":"@username crazy women beat their selves up.","commenter_a":"Before this is over, the \"two women\" will be just ONE MAN, and the \"abduction\" will likely turn into an \"affair\". The reason why she is saying it was women, is so that there's no suspicion of rape. = Less of an investigation.","post_message":"Authorities are searching for two women suspected in the abduction of a California mother. via NBC Bay Area"},{"comment_id":"10153077775262994","commenter_b":"Linda shove it up your butt. Lions all the way!","commenter_a":"Detroit needs to suck it up, quit whining, and get over it!","post_message":"What more can he say?"},{"comment_id":"1358265534191667","commenter_b":"She is an ignorant cunt and let some one break into her house and use it up and then she will change her mind","commenter_a":" .. . The problem is not guns. It is hearts without G-o-d. It is homes without discipline. It is schools without p-r-a-y-e-r. It is courts without justice. It is Obama willful destruction of the economy and good jobs, families to flourish. It is Obama directive to not enforce gun laws, giving himself the perfect excuse to label guns as the problem. Right out of the Marxist Playbook. HE is the problem. HE is the greatest traitor in the history of human civilization.","post_message":"The founder of Moms Demand Action for Gun Sense in America says she's done wallowing in disappointment following Donald Trump's victory last week."},{"comment_id":"1012827362091069","commenter_b":"The ugly bitch is back. She hasn't been on for a while and I hoped she had disappeared.","commenter_a":"Lay down dog","post_message":"Ann Coulter and Fox News take another step closer to flat out saying they don't want \"THOSE\" people to vote."},{"comment_id":"10153224178386336","commenter_b":"You cannot deport american citizens out of america, it makes no sense. lol","commenter_a":"Gather them up and ship them out of the country. Anyone who doesn't respect America should leave. No one is asking them to stay.","post_message":"A new social media \"challenge\" is encouraging people across the country to disrespect and stomp on the American flag."},{"comment_id":"602980583159868","commenter_b":"The majority of these people have never seen much less used a toilet. The do it everywhere at any time. It's sickening besides disgusting and a health problem. Expect to see toilets broken or destroyed in bathrooms from now on.","commenter_a":"Another cost to be added to culturally incompatible immigration","post_message":"Public restrooms are going to get an unusual addition due to all the immigrants coming in. The reason for the change will make you sick."}]
