[{"comment_id":"10155447635791509","commenter_b":"She just needs to shut up. She's backing a rapist wife","commenter_a":"Wikileaks is Hillary's nightmare","post_message":"\"I can't believe that I am saying that a candidate for President of the United States has bragged about sexually assaulting women,\" Michelle Obama, speaking in New Hampshire, addresses the Donald J. Trump tape @webpagelink"},{"comment_id":"1687479528205826","commenter_b":"You can come to America if you do it legally if you want to go over the wall if there was a wall yes shoot to kill. That will be a deterrent to stop other illegals from trying to do it.","commenter_a":"Yes and shoot to kill anyone crossing from Mexico to the USA","post_message":"Yes, I do!"},{"comment_id":"703561329834445","commenter_b":"Get that pos out at any cost.","commenter_a":"Dreams Dreams. What The Fuck Ever. I only get 3 wishes. Anyone got a lamp I can rub.","post_message":"Obama impeachment process takes huge steps forward... he's finished. This is great news. He should have been gone long ago. Can we get 30,000 'LIKES' to have Obama impeached?"},{"comment_id":"10153122280259877","commenter_b":"Beautiful girls. Happy birthday","commenter_a":"Happy birthday Sasha,,,my twin girls birthday is today,,14yrs old","post_message":"We are wishing #SashaObama a very HAPPY BIRTHDAY today!! COMMENT to sign our #GrioBirthdays card for Sasha!!"},{"comment_id":"10153095051856770","commenter_b":"\"please everyone\" stop paying attention to the talking pig.","commenter_a":"AMY you need to get out of your dad's shadow. He's an idiot. Just look at the death rate in every city the has very strick gun laws. If we did not count them in death by guns the United States would have the lowest death by fire arms than any other nation.","post_message":"Amy Schumer continues to advocate for stricter gun laws after a man opened fire and killed two people during a July screening of her movie “Trainwreck.”"},{"comment_id":"464590737066851","commenter_b":"Unbelievable , to do that to an Elephant . Ought to cut his ta#@#@ fingers off.","commenter_a":"Neither.","post_message":"Left side: Donald Trump's son holding the tail that he cut off an elephant he shot in Africa. Right side: Chelsea Clinton working to prevent the illegal trade of ivory in the world. Whose family values do you prefer?"},{"comment_id":"565035256989762","commenter_b":"What would the us do if mexicans where stealing land putting colonies into their land? Only rockets?!","commenter_a":"Military action would be used against a country which sends rockets, terrorists and death into any western democratic country. Why is it unacceptable when the only democracy in the Middle East does it to protect their own democratic citizens? If the vice news offices where destroyed by a Mexican rocket would their be a US reaction.","post_message":"The armed wing of Hamas has vowed to retaliate for the deaths of the two children."}]
