[{"comment_id":"10150532816329999","commenter_b":"It's also ingrained that we're each other's competition. Women don't hate each other naturally any more than men do. That's nurtured behavior. If we support each other more, things will change. This goes on all fronts. I can't tell you how many housewives hate me just b/c I'm not a submissive woman who pushes out kids and reads mommy porn (those ideas are also ingrained on far too many women-in the year 2015...)","commenter_a":"I've definitely seen it and it's so ingrained that a lot of people don't notice.","post_message":"When a man talks in a meeting, he gets heard, but when a woman does, she gets interrupted, Sheryl Sandberg and Adam Grant write. Have you experienced gender bias at your workplace? If so, how have you dealt with it? Share your stories in the comments, or within the article."},{"comment_id":"10152982642761336","commenter_b":"Where are the sires of these brooding mares? I know they are out making many more welfare babies! Really!","commenter_a":"Let me clear this up for y'all make it real simple. I grew up in Jackson and the school is in the heart of the ghetto. I am talking section 8 housing, five homeless shelters with in a five block radius of each other. This is the part of town most people don't like to be in after dark. Most of the children you will run into at the school will be children of welfare brood mares. Jacksonville is very lenient on getting welfare and other government assistance, so a lot of welfare babies are born and never taught respect or manners. Most of the people living in the zip codes surrounding the school have six to eight children and are on welfare and any government assistance they can be on. So schools are over crowded and under staffed. Also these parents are either not going to care or get ...","post_message":"A Florida kindergarten teacher has been suspended without pay after she videotaped a boy beating other students on three occasions."},{"comment_id":"1371535832866166","commenter_b":"What's wrong with strippers? Lol","commenter_a":"I cant believe you fools who support absolute political corruption.... you will lose your homes and jobs, mark my words, she is Obama part 2, choose wisely sheeple","post_message":"ELECTION DAY: People are casting their ballots across the country today. Have you cast your vote yet? Who do you think will win? Our coverage starts at 4 p.m."},{"comment_id":"10156132117065725","commenter_b":"I appreciate you being so kind and politically correct. And you laid out a solid, arguably INDISPUTABLE, case there. But, as you pointed out, this is absolutely willful ignorance, so real facts don't mean anything when talking to a trump supporter. They have a feeling, form a belief from that feeling, and then that feeling morphs into a \"fact\" without any due diligence. And, unfortunately, all of their beliefs stem from feelings of bigotry (irrational hatred of an entire group of people). I'd love to have an honest conversation with a trump supporter about his policies. But they won't, because trump doesn't have any feasible policies, he simply says things are bad or good (which we all have the ability to do). What any trump supporter does when confronted with a lack of actual policy, with his track record of insults and short sighted aggression, is blame someone else somewhere ...","commenter_a":"The man did not make a \"nasty or controversial statement.\" He made a series of absolutely false allegations. Correcting him after he spoke could not possibly have been construed as interfering with his right of free speech; you would have only been interfering with his right to be ignorant. Which, apparently, is a sacred right to some of your supporters. And if somebody had made a series of absolutely false statements about you to the President, yeah, I'm pretty sure he would have corrected them.","post_message":"If someone made a nasty or controversial statement about me to the President, do you really think he would come to my rescue? No chance! If I would have challenged the man, the media would have accused me of interfering with that man's right of free speech. A no win situation!"},{"comment_id":"10153310344686157","commenter_b":"If she gets droped off by the bus shes to young for you bruh","commenter_a":"If her shoes light up when she walks she is too young for you bro.","post_message":"Investigators believe 23-year-old Estevan Garcia sent naked Instagram photos to a 14-year-old girl. He worked for the Donna school district as a security guard."},{"comment_id":"10153460596675779","commenter_b":"Complete agree David!!! Oh, by the way, I'm a female gun owner ;)","commenter_a":"She is a genius. I hope she realizes how hard your life can get when you make an enemy of the NRA! All you have to do is casually mention gun control or background checks and 50 whack - jobs will jump down your throat. If you're on t.v. it must be much much worse. Look what happened with Amy Schumer.","post_message":"Samantha Bee highlighted a glaring, surreal NRA double standard on Full Frontal with Samantha Bee yesterday, stockpiling a small weapons arsenal while trudging through red tape as she tried to nab her own Eddie Eagle costume, the NRA's gun safety mascot. Watch below."},{"comment_id":"10153391027640950","commenter_b":"THEY DONT WANT CONTROL FOLKS.","commenter_a":"CBS, you need to get control of that audience, they really are ruining the debate. I want to listen to the candidates, not to cheers and jeers","post_message":"Marco Rubio to Ted Cruz: I don’t know how you know what I said on Univision because you don’t speak Spanish. Immediately, Cruz responds…in Spanish @webpagelink"}]
