[{"comment_id":"943135932412822","commenter_b":"Shake those lady lumps","commenter_a":"Hump on a Hump!!!","post_message":"He denounces the idea of marital rape as 'made up by European people'"},{"comment_id":"10153918741113854","commenter_b":"@username You stupid racist the C word that women don't like! Will be glad when people like you die out!!!!!!!!!!!!!!","commenter_a":"Barack Obama has done NOTHING to improve this country....he has improved his own lifestyle at our expense!","post_message":""},{"comment_id":"1777601655795113","commenter_b":"Hilary is such a hypocrite. She is lighting the matches.","commenter_a":"But hey, Hillary over Trump for sure.","post_message":"The divisive rhetoric and encouragement of violence we're hearing from Donald Trump isn't just wrong—it's dangerous."},{"comment_id":"10153661567171336","commenter_b":"This thug lady needs whatever the cops want to do to handle thugs","commenter_a":"So breaking the law is okay, right @username?","post_message":""},{"comment_id":"1229197387109219","commenter_b":"Putin to Obama stop protecting Muslims I know Putin he is insane. What do you want from 1st a Muslim then a racist 1/2 black 1/2 white that own family owned slaves. And a bi sexual with a jar of Vaseline in his side table","commenter_a":"And so how is this different from supporting Israel which is pro-pro abortion? How does the GOP electorate square Israel's pro-abortion record with U.S. Southern Christian position on abortion? @webpagelink","post_message":"\"If I told you in 2008 that Barack Obama would negotiate a deal that he acknowledges will fund terrorism, you'd have thought me a conspiracy theorist.\""},{"comment_id":"10157053900475354","commenter_b":"Crooked Hillary could not/ would not keep America and Americans safe. She ignored the call for help from Ambassador Stevens even before the attack. Then she tells Americans one story while she tells her daughter a different one...crooked, crooked Hillary can't be trusted.","commenter_a":"The BLM and anybody who supports them are just a bunch of RACIST ass holes and Dirty Fukn TRAITORS to themselves and to the USA. \"Multiculturalism\" and \"diversity\" is all BULLSHIT and VERY DANGEROUS to EVERYBODY it will DESTROY everything. Islam is DEATH. DEATH to Islam long live the Infidel","post_message":"BOLD."},{"comment_id":"1339369766115783","commenter_b":"There are so many other places to shop.A woman`s dignity is valuable to her self esteem.","commenter_a":"I still think this is another part of Obama's plan to cause unrest and confusion so he can carry on the New World Order Plan. Wake up folks the end is almost here.","post_message":"@webpagelink"}]
