[{"comment_id":"10153091862830329","commenter_b":"Some women like to be told.","commenter_a":"This world needs to stop being offended by everything, and just let people live their lives.","post_message":"A pledge email from the University of Southern California’s Alpha Chi Omega chapter published by Jezebel today shows how authoritarian the sorority’s rules are for things like hair color, eyebrow shape, and required Spanx wearing."},{"comment_id":"689148981239347","commenter_b":"That's one way to get rid of the Muslims and have them leave on their own Trump wins","commenter_a":"These guys can go to? Just go! Scum.","post_message":"Donald Trump will win, and then they will have to face reality.  If they don't like it, good riddance.  Do you support Donald Trump?"},{"comment_id":"10155571867589062","commenter_b":"She's a thug communist married to a drug pusher.","commenter_a":"She's a Texan so I can't say anything bad about a fellow Texas gal.","post_message":"Beyonce will be performing tonight at the CMA Awards. Do you think she was a good choice?"},{"comment_id":"10153904904228812","commenter_b":"Yes Danold deport all the white supremacist, terrorising the USA. Too.","commenter_a":"this is not even our country lol. Native Americans were here first. If Trump says he will deport all immigrants, he should deport himself first.","post_message":"\"Anybody that's brought into this country from the migration is going to be out,” Trump said at a rally in Knoxville, Tenn., Monday night. “We’re not gonna do it. We’re gonna have a country again, we’re gonna have borders, we’re gonna have a country again, right now we don't have a country.\""},{"comment_id":"1304805006248280","commenter_b":"That's what he wants beware","commenter_a":"They try to do anything they can to make his life more miserable-how petty!!!!!","post_message":"TRUMP WON'T BE ABLE To Use Oval Office For A Year Have To Use Nixon's Old Office Across Street"},{"comment_id":"10153544587506350","commenter_b":"Real women dont need all that! They are content with the gift of life they just grew in their body for months!!!! This is a little overkill.","commenter_a":"Oh good grief...isn't the baby enough to show off? Must one be materialistic to have to have a push ring?","post_message":"Push presents (the bling or gift an expectant mom is given for, um, pushing) are getting more and more popular."},{"comment_id":"10154897891195530","commenter_b":"@username you kiss your mama with that nasty mouth?","commenter_a":"Trump is frightening for everyone. Period.","post_message":"There are up to 127,000 undocumented immigrants in Michigan, many of them anxious about Donald J. Trump."}]
