[{"comment_id":"10153420150224087","commenter_b":"jeanne ruzzin: Ivana is a big woman and anyone who tried to push her around would surely regret it.","commenter_a":"Donald Trump, serial adulterer. Brutally assaulted Ivana and paid her off. Talks constantly about wanting to bang his daughter. Meanwhile, Hillary has been a faithful spouse, who had every right to choose whatever she wanted in the wake of her husband's cheating. Figures The Donald would stoop to #VictimBlaming.","post_message":"“If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women’s card on me, she’s wrong!” Donald J. Trump tweeted."},{"comment_id":"532673453589901","commenter_b":"Linda are you drunk? Your comment makes no sense. Girl get yourself together.","commenter_a":"If he does not support Obama he should not have to speak to him. It's a free country so far.","post_message":"Obama is outraged after Tom Brady made an epic stand against him. This is amazing. We have is back, let's show him our support. Can we get 10,000 'LIKES' for Tom Brady's stand against Obama?"},{"comment_id":"10154449321726729","commenter_b":"Fuck u bitch.. I'm an Obama supporter and wouldn't say no shit.like.that.. FUCK U!","commenter_a":"You know what's amazing about Trump's supporters? They are so cult-like that if Donald Trump raped a little girl, his supporters would insist that's okay. They would say that she was probably asking for it. No true conservative supports Trump.","post_message":"BREAKING: The decision desk has now called the winner of Kansas..."},{"comment_id":"10153342473651336","commenter_b":"The girl was mouthing off and ignoring him when he said get the hell away, if that was my daughter I'd slap the taste out her mouth, she wouldn't even have to worry about the cop.","commenter_a":"These cops are constantly thrown into situations where there are multiple combative people and ONE officer. Was he in the right or wrong? I don't know, but cops are constantly put in these dangerous positions as a part of their job.","post_message":"The video appears to show the officer using his knees to pin the girl face down, pointing his gun at other teens and cursing."},{"comment_id":"895356030506185","commenter_b":"Saudees R disgusting devils.","commenter_a":"Saudi regime should be removed out of power and kicked out of the country.","post_message":"What do you expect of the #Saudi aggression against #Yemen? Raise your voice by taking part in our poll: www.presstv.ir"},{"comment_id":"10153803392470950","commenter_b":"And yet again the liberal media twist his words, he never suggested in any form that anybody attempt to cause bodily harm to the hag. Just that we need to exercise our rights as Americans and keep the hag out of office.","commenter_a":"Why did CBS reporters ADD words to what Donald Trump said at his campaign rally the other day? What he said was \"supporters of the second amendment\" might have a way ....... meaning like the NRA's lobby could have a way to PROTECT AND KEEP THE SECOND AMENDMENT FOR ALL AMERICANS. AT NO TIME DID HE EVER SAY OR IMPLY THAT anyone be assassinated. AT NO TIME!!! When you report things that NEVER HAPPENED BY CHANGING WORDS AND ADDING WORDS, You really make yourselves look pathetic! WE ALL KNOW WHAT DONALD TRUMP SAID and it isn't what your are saying. VERY unprofessional of your news staff to do that kind of stuff! You are as bad as Hillary Clinton saying she didn't say WHAT SHE SAID ON THE VIDEO WHICH PROVES WHAT SHE SAID, when the 4 men's coffins from Benghazi were being taken off the plane. HER OWN WORDS ...","post_message":"These latest numbers come out a day after Donald J. Trump came under fire for suggesting \"Second Amendment people\" could do something about Hillary Clinton."},{"comment_id":"10153258325486680","commenter_b":"Dear Airlines:* Dump the male flight attendants. No one wanted them in the first place. Replace all the female flight attendants with young good-looking strippers. They don't even serve food anymore, so what's the loss. The strippers would at least triple the alcohol sales and get a \"party atmosphere\" going in the cabin. And, of course, every businessman in this country would start flying again, hoping to see naked women. Because of the tips, female flight attendants wouldn't need a salary, thus saving even more money. Muslims would be afraid to get on the planes for fear of seeing naked women. Hijackings would come to a screeching halt, and the airline industry would see record revenues. This is definitely a win - win situation if we handle it right -- a golden opportunity to turn a liability into an asset. Why didn't Bush or Obama think of this? Why do ...","commenter_a":"Bernie would trounce him! Trump would get absolutely destroyed! Lmao 😂","post_message":"Donald J. Trump: \"Oh would I love to run against Bernie. That would be a dream come true.\""}]
