[{"comment_id":"636870959836816","commenter_b":"Good for her they should all be arrested where the heck is the National Guard?","commenter_a":"Need to arrest everyone on street. Thugs have taken over again ??? Let the police do their job . If they have to shoot a few of them so be it.","post_message":"Ferguson Protesters got in the way, so this patriotic driver does this.  Race rioters are out of control. They are the true menace to our society.  Are you sick and tired of race rioters?"},{"comment_id":"10153170406841770","commenter_b":"I SAY MERRY CHRISTMAS And Happy Easter !! NO MORE REFUGEES ! THE PEOPLE NEED TO BE REMINDED THAT FDR AND CARTER DID WHAT TRUMP IS SUGGESTING ! THE PEOPLE NEED TO HELP DONALD J TRUMP [ MAKE AMERICA SAFE AND GREAT AGAIN ] VOTE FOR AMERICA ! ABOLISH ALL GUN FREE ZONES AND ESTABLISH A NATIONAL RECOGNIZED CONCEALED CARRY ! NEVER FORGET WHAT THE DEMislamOCRAPS AND obuma HAVE DONE AND ARE TRYING TO DO TO AMERICA ! PASS IT ON !","commenter_a":"Saying a specific group of people matter above others is highly racist and prejudicial.","post_message":"Black Lives Matter protesters are filling the streets of Chicago Wednesday, blocking traffic and disrupting the city to protest police actions relating to the death of 17-year-old Laquan McDonald."},{"comment_id":"10153310022881051","commenter_b":"Why is this vermin still alive?","commenter_a":"Blow him off the face of this Gods earth!","post_message":"Al Qaeda's leader just called for a 'lone wolf' terror attack on the United States - and that's not even the worst thing he said. (via VICE News)"},{"comment_id":"10154122755384641","commenter_b":"Jajajajajajajajajajajajaja Trump for better world? ...dig a hole in your yard lady. ..","commenter_a":"Wish I could go back to 1945, find Donald Trump's father and give him a condom.","post_message":"With the growing chances of a Donald J. Trump presidency, world leaders are beginning to swallow their previous distaste."},{"comment_id":"711540485694496","commenter_b":"The noose tightens.","commenter_a":"Deport him to Russia","post_message":"Dems bringing pressure."},{"comment_id":"10152694433051045","commenter_b":"twatwaffle.","commenter_a":"Melissa YES HE DOES! Can you imagine just how i said that, YES HE DOES!!!!","post_message":"Alabama Chief Justice Roy Moore sent a letter to probate judges Sunday evening ordering them to refuse to issue same-sex marriage licenses."},{"comment_id":"735467686595927","commenter_b":"Immigrants are welcome here. Illegal aliens are not.","commenter_a":"I'm very proud of my family's race. I'm white my stepfather is Mexican and he's from the states my grandparents are from Mexico so I believe that they have the right to come to the United States and make something out of yourself and y'all want to say here and criticize them being immigrants and using us for money when they're the ones that will work harder than any other people . So as I was raised this post be a free country and we supposed to love each other not hate each other and be there for each other. But with everybody with all this hate and everything yeller going to regret it because the day that you have to go and speak to the heavenly father is the date you're going to have to answer for how your reactions are everybody should be equal. So I'm very proud ...","post_message":"Live from Donald Trump protest in River Oaks: coverage all day on Eyewitness News"}]
