[{"comment_id":"913998228643418","commenter_b":"As if inflation isn't a tax increase unto itself. Total money grubbers...","commenter_a":"The present gas tax money, originally intended to maintain or build our roads is not being used exclusively for that purpose. If it was we'd know exactly how much money we need to do this job","post_message":"The nation’s gas tax will be raised to 30 cents per gallon and increase at pace with inflation if a bipartisan group of House lawmakers get their way in seeking funding for a new transportation bill. @webpagelink"},{"comment_id":"1920926941484648","commenter_b":"Worst president ever... and she's never been a First Lady... low class trash is what she is!","commenter_a":"Not at all","post_message":"Are the Obamas a good representation of the American people?"},{"comment_id":"1815699362041993","commenter_b":"Can't stand that wretched woman","commenter_a":"I was gonna click for sound but then I saw a clip of Tomi Lahren pop up and thank god I dodged that bullet #iamsaved #toliveanotherday","post_message":"Republicans think protesters should just get over it and accept the results of the election just like they did when Obama won in 2008 and 2012  Oh wait..."},{"comment_id":"839844146064134","commenter_b":"Women want it all, money,, looks, and a man who does everything right?, that has made me want all the same from a woman, sO far no luck, it's not a hero juzca person who shows love everyday, in everyway and a REAL woman not a Queen to appreciate it!","commenter_a":"If only we were all blessed with that. He's a hero plus a husband who gets it!!","post_message":"SO SWEET! The way to a man's heart may be his stomach, but one devoted husband has proven that women's love can come from a man who can"},{"comment_id":"10153773404108984","commenter_b":"You Gotta Love America !!! :) I Do !!!","commenter_a":"Go Obama.","post_message":"The head of the National Sheriff's Association just threw down and issued a blunt threat to Barack Obama. This cop isn't going to take Obama's anti-cop attitude any longer, and now he's going to do something about it. This is awesome."},{"comment_id":"676190932571485","commenter_b":"She needs to be committed to a psychiatric ward for life","commenter_a":"OH Puke.","post_message":"Rosie O’Donnell wants to go head to head with Trump by wiping this on peoples' faces.  This is absolutely ridiculous. She should be ashamed of herself.  Do you think Rosie O’Donnell needs to keep her nose out of politics?"},{"comment_id":"990097811101554","commenter_b":"That looks disgusting 😱","commenter_a":"@username BONG","post_message":"Not all heroes wear capes. 🍔+🌭"}]
