[{"comment_id":"10153990107026955","commenter_b":"See you at Blade Show bitch!","commenter_a":"The rights to a free press, free speech, assembly, and religion are extremely important but none of them matters very much if you can’t defend your own life against aggression. Leave your hands off my guns!","post_message":"BREAKING: Active shooter at Lackland Air Force Base in Texas, at least 2 dead"},{"comment_id":"1140671769377398","commenter_b":"This lady is such a trash!","commenter_a":"Why didn't they do this when Obama was in office?","post_message":"Thankfully we have Elizabeth Warren in the Senate to call him out.  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1150998668273937","commenter_b":"There are 5 videos.","commenter_a":"This girl was told to leave the classroom. She refused. An officer was called since a teacher cannot physically remove a student from a classroom. The officer asked her to come with him, she refused and pushed him. She had then assaulted a police officer. Which is an arrest-able offense. She then resists arrest while further assaulting the officer (hitting him). Why does anyone think this is ok? These children have no respect for authority. I see most people defending her. Seriously?","post_message":"This guy can bench press 605 pounds, and he threw that tiny girl across the room. And the one they arrest is the girl who was brave enough to stand up to him."},{"comment_id":"10153813591902293","commenter_b":"Jealous women!","commenter_a":"Hmmm.....now what kind of people would call in and complain about a woman's bare shoulders......any guesses?","post_message":"The station received several e-mails during the broadcast complaining about her bare shoulders."},{"comment_id":"1090200961078541","commenter_b":"No sympathy.. The German people should have turned on their Government years ago for not putting the German people first.. The German people have sat back and just watched as their Government have let these migrant, immigrant and refugee vermin infect their country like a cancer.. And now innocent people have died.. How many more are going to die before someone does something and boots these parasites not just out of Germany, but out of Europe.. Can you imagine it.. a Muslim free Europe..","commenter_a":"Islam to be wiped off planet all together","post_message":"LIVE: 9 dead, multiple injured as truck plows into Christmas market in Berlin in likely terrorist attack Watch Ruptly LIVE here @webpagelink"},{"comment_id":"10154265505298188","commenter_b":"Ugly woman???","commenter_a":"Ugly jacket!","post_message":"The hypocrisy of these progressives is beyond shocking."},{"comment_id":"10154339020461729","commenter_b":"Can that woman ever give a straight answer?","commenter_a":"She sucks! Just not Bubba...","post_message":"This woman...SMH"}]
