[{"comment_id":"10154306553151729","commenter_b":"@username then you should be glad that we want to stay out of it, dumbass! Unless you want us to go back to our 1940s mindset and you won't have anything but a glass parking lot over there.","commenter_a":"They have been fighting over there for centuries. Stay out of it let them finish each other off.","post_message":"This is very serious folks."},{"comment_id":"554182668075021","commenter_b":"What lower wages, you mean lower taxes. If you don't want to birth a child, just keep those nasty little knees together","commenter_a":"They are poor, jobless and believe the American dream is dead because they are stupid enough to keep being tricked into voting democrat.","post_message":"Last year was the first time that millennials surpassed baby boomers and Gen-Xers to become the largest voting demographic in the US."},{"comment_id":"10154162450013812","commenter_b":"This alone would make me patronize your establishment on a regular basis.","commenter_a":"I salute you! way to be a decent human.","post_message":"Pizzeria owner makes it a point to hire workers with disabilities: \"We did it because it needed to be done. There are no jobs out there for these kids, so they are being prepared for nothing.\""},{"comment_id":"1537745596485739","commenter_b":"Got it STOCKINGS !!!!!!","commenter_a":"salt","post_message":"Riddle of the day! What is it?   Quiznatic Media"},{"comment_id":"10153489644226680","commenter_b":"@username Hillary 2016!","commenter_a":"I support Bernie but, in a democracy you don't always win. Clinton's big victory in NY is not the result of some sort of conspiracy. It is a result of counting the votes. I am not one of the \"Bernie or Bust\" people. Trump/Cruz are too dangerous to advocate some sort of 3d party campaign where Bernie is the candidate. When Ralph Nader took votes away from Al Gore, it resulted in George W. I do not want a rerun of that movie. I am not happy about how the race seems to have ended, but, Hillary got more votes than Bernie and that ends it.","post_message":"Hillary Clinton gets emotional telling the story of Sandy Hook Elementary principal Dawn Hochsprung, whose daughter is at the victory rally."},{"comment_id":"1225927100760651","commenter_b":"@username And this from the person from Farmville?","commenter_a":"When do we decide that our gun culture is not worth another child dying? What a sad story. Prayers for her family.","post_message":"\"She's not going to first grade, because he made a choice to pull out his gun,\" Lilly's mother said. Read more: @webpagelink"},{"comment_id":"1305722922778581","commenter_b":"Sean Connolly","commenter_a":"Logan Laybolt","post_message":"Tian Tian the panda enjoyed the snow this morning!  Video via the Smithsonian’s National Zoo and Conservation Biology Institute"}]
