[{"comment_id":"10153647228236336","commenter_b":"Hello...Mr. Mahon? You there? Anything else you can steal from the white race and make you feel like a real man? Got our heritage, took over football, basketball, baseball. What's next? Hunting, nascar, women. Oh well...guess your are a superior race. Except in my neighborhood.","commenter_a":"Execution is exactly what the criminal who did this deserves.","post_message":"An estimated 11,000 people attended Texas Deputy Darren Goforth’s funeral today. The husband and father was killed \"execution-style\" at a suburban Houston gas station last week."},{"comment_id":"10152609113745950","commenter_b":"Those \"children\" walk around with ak-47's and would not hesitate to kill an American or any other national that isn't one of their own upon first sight. They are bred with hatred from birth. Sad to say they are already tainted. BOMB THEM ALL! What do you do when roaches run rampant in your house? You call an exterminator correct? Do you take the baby roaches into consideration simply because they're innocent? It's still a roach. BOMB THEM ALL!","commenter_a":"When we get a President with a backbone to go into these countries and bomb the hell out of them, we will continue with these problems....Clean house no matter if there are innocent people or not....Get the Job Done Now...","post_message":"According to a CIA insider, it would take 100,000 ground troops to effectively respond to ISIS."},{"comment_id":"10153304939531350","commenter_b":"He's a combo look of Chandler from \"Friends\" and her ex-husband","commenter_a":"Courtney Cox marrying band member Johnny McDaid from Snow Patrol. My favorite \"Friends\" and my favorite band!","post_message":"\"She wants to be the flower girl, all the bridesmaids. She's very excited about it.\"  CC: The Ellen DeGeneres Show"},{"comment_id":"10153333221058984","commenter_b":"illegals cant vote and thats a fact","commenter_a":"yes especially with this crap happening in europe w radical muslims id say def close the borders latin americans dont want that crap either","post_message":"If you don't believe immigration is going to be THE issue in 2016, read this. My eyes were opened in a big way.  Do you support securing our borders?"},{"comment_id":"1641151569508654","commenter_b":"@username: no fault but Puerto Ricos...pretty sure they had a chance to vote for independence, and y'all didn't take it. You can have all the cultural pride you want...but it's the Olympics man, it is only for countries to compete in. Why not have Coca Cola and Pepsi join in?","commenter_a":"The underdog defeating the #2 in the world for gold.. Monica eres grande!!! PUERTO RICO!!! and to the bunch of salty Americans go read a book and learn about the damage the USA has done to PR!!","post_message":"After some of her more dramatic points, fans were shouting \"Si se puede\" and waving the flag of Puerto Rico."},{"comment_id":"10156284616795354","commenter_b":"Lol, they weren't immigrants.","commenter_a":"Immigrants....","post_message":"What in the world is going on?"},{"comment_id":"1960555887503751","commenter_b":"TRUMP! Go, go go ... Defeat that evil woman and make America great AGAIN!","commenter_a":"Killary is a beast and needs to be in prison........TRUMP is the only candidate that deserves to be president","post_message":"I will defeat Hillary Clinton - and MAKE AMERICA GREAT AGAIN!"}]
