[{"comment_id":"1068442033272574","commenter_b":"If they don't like this country they should leave. Why don't they each donate a couple of million each to some of these black communities that need the money to make things better. They won't because they are talkers not doers.","commenter_a":"If the Giants do this I will give up my Tickets","post_message":"#BoycottNFL is gaining MASSIVE momentum online. Fans are FED-UP and FURIOUS with the anti-American hatred NFL players are increasingly showing.  Let's get 5,000 SHARES and LIKES to Boycott the NFL!!!  @webpagelink"},{"comment_id":"10155515421201509","commenter_b":"That woman is the devil incarnated in a human body.","commenter_a":"Change profile pic to RED to show your support of TRUMP/PENCE","post_message":"\"I will not defend or endorse @realDonaldTrump, but I am voting for him. HRC is that bad. HRC is bad for the USA\" the House Oversight Committee chairman tweeted."},{"comment_id":"937660539681364","commenter_b":"He did not say the wall was to keep you or anybody else in...but to keep out Drug Dealers...I agree !!!","commenter_a":"What the hell? Now Trump want to build a wall both Mexico and Canada boarders. So the Americans are going to be imprisoned in his Presidency?? Dump Trump","post_message":"Drug dealers are pouring in from the southern border. We will build a wall on time and on budget. #GOPDebate"},{"comment_id":"1360247024053830","commenter_b":"Get these bastards out of our country they are worse than maggots","commenter_a":"Ship her sorry ass back to the Middle East. She will be the one spit on.","post_message":"This Muslim did something absolutely SICK to white Americans at Walmart... She's now facing hate crimes charges over this... wow."},{"comment_id":"1006176036165841","commenter_b":"Just why is this bitch here ??","commenter_a":"You're right. I didn't see anything about this on the news networks.","post_message":"You will DEFINITELY not see THIS on CNN. Nor, will you hear BHO condemn her violent, F-bomb laden, BS. @webpagelink"},{"comment_id":"10155794432670354","commenter_b":"she'll never get that stink off her!","commenter_a":"What was that idiot doing there anyway.","post_message":"What was she thinking?"},{"comment_id":"10153021059601051","commenter_b":"What a cruel woman","commenter_a":"All I can say, is he is better off without her for a mother.","post_message":"This baby's mom decided she didn't want him anymore and had him deported."}]
