[{"comment_id":"471354216346689","commenter_b":"It's far easier to cheat on your taxes than it is to receive SSI.","commenter_a":"I don't believe it is a real disability either but a ploy to rob the taxpayers of more money.","post_message":"Please put me in a room with this man. Just for 30 minutes. I'm diagnosed as bipolar. There are varying degrees of bipolar disorder. Some are well managed on medication. Some aren't and are disabled.. I am one of those that is great on medications. However, off of medications? I can't function, and seriously, I become a danger to myself because I make TERRIBLE decisions in a manic phase. So yea, let me at him. ~ Liz"},{"comment_id":"919474584812263","commenter_b":"She's in the white one percent of income earners selling darkness for light, propaganda and bullshit spewing pays well in America, the scary black men are race baiting ha","commenter_a":"To paraphrase the great Nelson Mandela: \"We are not less life loving than you are.\"","post_message":"Why didn't she have the same concerns about American Sniper?"},{"comment_id":"1060076290679393","commenter_b":"I believe you! Just saying IMF found some crazy monetary practices. Matching 8% would create a crazily unsustainable and unattainable and unrealistic economic goal. We had our state government promise such riches for a 20 year period to public employees and it's not a practice followed and linger because we have had to fund that same crazy generosity despite economic ups and downs. This created alot of resentment as courts say we must continue to fund these government employees who gave themselves this great pension!","commenter_a":"This is just like Greece, nepotism, expensive payrolls and pensions created to benefit a few individuals and their families while real public needs are neglected...this is the opposite of socialism @username","post_message":"The budget crisis faced by Illinois is dire - the state government itself is drowning in $37 billion of debt. Read more: @webpagelink via Special Reports"},{"comment_id":"10153991299268984","commenter_b":"Make sure he meets his virgins..","commenter_a":"Coming SOON to an ENTIRE COUNTRY near you . . . !!!!!","post_message":"This ISIS supporter had planned something truly terrifying for New Year's Eve... Thankfully, law enforcement caught him just in time. Do we need to do more to support law enforcement against ISIS?"},{"comment_id":"10153438152599087","commenter_b":"What a phony!","commenter_a":"This man should win an award . I wanted to hurl. Wake up people, he is setting you up, playing you like a fiddle for his own political agenda. What a low life to use the children over and over. Not one damn thing he is going to use that damn pen for, will stop the issues we have. The gun doesn't pull its own trigger and mentally ill, terrorists, and murderers do not obey damn laws. He wants to disarm the law abiding. Ask him to dismiss the secret service that carry guns to protect his ass and see how far you get.","post_message":"“Every time I think about those kids [in Newtown], it gets me mad,” President Barack Obama said as tears rolled down his cheek. WATCH:"},{"comment_id":"10154182818316943","commenter_b":"WE ALL KNOW WHAT SHE DID WITH THEM!!! TRAITOR","commenter_a":"Breaking Leaders who are above the Law. Oh but what Hillary did isn't wrong... Give us a break. Amazing when American Citizens even a Police Officer was arrested & charged for helping the enemy. But she can do it and not held accountable... Since when did Leaders come under a double standard system. Even other's say for one to commit treason not held accountable. Law & Order a Justice System that's fair & honest...","post_message":"Among the 14,900 federal documents Hillary Clinton is said to have failed to turn over to the State Department in 2014 are some related to the Benghazi attacks, according to Judicial Watch. - via The Daily Caller"},{"comment_id":"109818942877901","commenter_b":"Pussy ass crackas","commenter_a":"Whatever you need","post_message":"Name it! #WSHH"}]
