[{"comment_id":"10153257437420950","commenter_b":"Just hang the filthy basterds","commenter_a":"But then again they are innocent unarmed harmless individuals with bright futures ahead and their victim is the evil one","post_message":"Two 20-year-old men allegedly stole a cellphone from a man with cerebral palsy, beat him, recorded the assault on his phone and posted it to his Facebook page, police said."},{"comment_id":"10154993397619254","commenter_b":"Hello from erie pa my is he getting big","commenter_a":"His fur is waterproof.","post_message":"HAPPY FRI-YAY! Eaglet E9 is relaxing in the nest this morning. We can't believe how big E9 is! The eaglet will look more like an eagle as soon as white feathers start coming in :) Where are you watching from? @webpagelink"},{"comment_id":"10152653934397169","commenter_b":"A woman should never lose her chic!","commenter_a":"Go girl!","post_message":"Part of a growing trend of older fashion icons:"},{"comment_id":"10153380286877293","commenter_b":"You sound like a sensible woman out of all the waste of sperms in your state","commenter_a":"Should they all be Christian? Should they all be Muslim? How about the fact that they're human? However, we need to be sure that terrorists are not infiltrating and posing as refugees. THAT is the concern for our national security.","post_message":"Season’s greetings. A cartoon by Tom Toles via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"10154608695637994","commenter_b":"These girls are exactly why we have insecure girls in high starving themselves! There are consequences to your actions! I bet she ain't laughing now!","commenter_a":"I was just wondering what happened with this.","post_message":"Playboy model Dani Mathers could face prosecution for posting a photo of a naked woman, without her knowledge, in the locker room of an LA Fitness. Mather posted a photo of the naked woman in July to her Snapchat with the caption, I can unseen this, then you can either. Do you think she should spend some time in jail?"},{"comment_id":"1742914335970564","commenter_b":"Where are we going to put all these people . ???? I just have not seem many pictures of great families knocking on our countr's door but mostly young to middle age men with anger and mean expression written all over their faces . How will we cope ????","commenter_a":"Noooooo","post_message":"That's a 550% increase!"},{"comment_id":"496116510576642","commenter_b":"There are no virgins they rape them all","commenter_a":"Kill them all and let them find Allah and the virgins","post_message":"SICKOS!"}]
