[{"comment_id":"620617391457056","commenter_b":"Cleavage queen","commenter_a":"Just once I would love to see Mariah dressed in a turtleneck !","post_message":"It really is the most wonderful time of the year!"},{"comment_id":"1905080359721745","commenter_b":"I. Bet money the daughter started it and got in her feelings when white girl wasn't going for the bullshit.","commenter_a":"But yet where were you at when your monkey was jumping around and disrespecting people.","post_message":"Used that right hand like a weapon!  #WSHH #Fight"},{"comment_id":"1328759877154299","commenter_b":"Karen >>> Integrity is not exactly an attribute of the Leftists. BIRDS of FEATHER, flock TOGETHER!","commenter_a":"My message to these \"journalists\". I don't care if you're talking about Trump, Obama, Clinton, or aliens. Using that kind of language is a disgrace to your job, which you obviously don't deserve. Your blatant disregard for any kind of integrity obliterates any credibility or respect you had with me. If you expect people to listen to you, make your use of language worth listening to or find another career that better employs your lack of ethics, if such a thing exists. Good luck with that.","post_message":"If a journalist said this about Barack Obama, the collective outrage from the press could be measured on the Richter scale."},{"comment_id":"10153880713234753","commenter_b":"Do better job then Hillary","commenter_a":"Vote trump","post_message":"A Latino Trump supporter in California claims it’s a lot more difficult to publicly support Donald Trump than to come out as gay. Juan Hernandez, who is a member of the Log Cab Republicans, a gay conservative group, indicated that he was leaving the Trump rally in San Jose, California, on June 2, when a mob of violent Trump protesters attacked him, breaking his nose in the process. A friend was similarly set upon by the assailants, some of whom carried the Mexican flag and were burning the... @webpagelink"},{"comment_id":"10153878198208984","commenter_b":"Decrepit old Hellary needs her fatA$$ ship sunk already!!! DESPERATION makes her even uglier!!!","commenter_a":"everything about this bitch is fake.","post_message":"Wow. Hillary is in a rough spot, and what was just revealed will NOT do her any favors. I knew she had sunk low, but I didn't realize she was this low...  Do you hope Hillary loses in 2016?"},{"comment_id":"786106801492916","commenter_b":"How in the world someone in the right mind, not see how how corrupt this woman is! She meeds to go back to school , she needs to learn what the meaning of \"C\" is. Not recalling 39 very important information, i think this Rat should be in jail. Go Trump, keep doing your thing, I'm sure you can destroy her nerves, and soon she will have a nervous breakdown. This is America, American decide our President, not immigration or the Latinos. I'm a Cuban American and very proud, of this country! Trump for America","commenter_a":"Its already been answered. Its because she is CROOKED!","post_message":"The polls are close so Crooked Hillary is getting out of bed and will campaign tomorrow. Why did she hammer 13 devices and acid-wash e-mails?"},{"comment_id":"10153772356976323","commenter_b":"Fuck off cocksucking bitch","commenter_a":"There is no climate crisis. It is a hoax of liberal desperation. There is however CYCLICAL climate changes.","post_message":"The fate of 70 million people rests on what happens to the Mekong river. Featuring extraordinary and beautiful drone footage of south-east Asia’s vast waterway, this important piece meets people struggling to deal with the impacts of climate change."}]
