[{"comment_id":"1358800054143336","commenter_b":"Are you for real???","commenter_a":"Yes @username, they are so utterly disgusting!! But remember, \"when they go low, we go high!'\". And they're just pissed knowing that Every penny Donald J. Trump has had or will ever have, can't buy him the class, dignity, and humanity of Barack Obama. #FarewellObama","post_message":"But wait -- where was Sasha?"},{"comment_id":"10153713540778984","commenter_b":"Chicago and Detroit have been run by democrats for years , as is california. This welfare state is all about staying in power, so is illegal immigration. The end result is bankruptcy, the next result Greece .","commenter_a":"If you're not disabled you need to work! HAVING CHILDREN IS NOT A DISABILITY! BEING A DRUG ADDICT IS NOT A DISABILITY!","post_message":"Wow. The welfare abusers about about to get some VERY bad news... they didn't see this coming. It's about time the cheating and the fraud got shut down... this needs to happen EVERYWHERE."},{"comment_id":"10152869461365927","commenter_b":"\"kill another Fetus now, we don't like Children anyhow\"","commenter_a":"If Republicans supported an organization that murdered 90,000 black babies last year OMG. PP would be the worst place since the death camps of the Nazi's. But godless \"Demon\"crats like Hillary are the true racist as they use PP as a form of population control to keep black birth rates down and the black population under control. Dems have always been the party of hate(KKK) and division, they still are they have just convinced the black race that they are their friends and supporters,,,,, really","post_message":"Planned Parenthood Director of Research Melissa Farrell makes STARTLING statement about dissecting aborted babies ..."},{"comment_id":"1772774552977135","commenter_b":"These women are hypocrites.","commenter_a":"So explain to me how Trump is horrible because he was talking to another man in private about a women who cares get over it you crybabies. I'm sure she liked it too","post_message":"BREAKING: Protesters have gathered in front of the Trump Tower on Michigan Ave. They're holding graphic signs referencing Donald Trump's lewd comments about women. No arrests so far. MORE: @webpagelink"},{"comment_id":"10153470522401545","commenter_b":"I totally agree. It won't happen because it generates big money. A bunch of sick people","commenter_a":"And Porn is still accepted & allowed in our country & world ?!?! Porn is a horrible addiction causing harm to others. I want our elected officials to get porn out of our lives forever !","post_message":"In police documents obtained by WFAA, school bus driver Leonard Bradford told investigators he swam in a public pool with 40 to 60 children in the summers of 2014 and 2015. According to police, Bradford admitted to investigators that he purposefully rubbed his genitals on five girls."},{"comment_id":"10154648260827550","commenter_b":"That's fine! Welcome to all who want to come to America LEGALLY.","commenter_a":"Grew up in a farming family. I admired and respected the migrant workers' desire to find a better life here in the United States.","post_message":"Do you support a border wall with Mexico?"},{"comment_id":"10153519405836680","commenter_b":"You are exactly right @username. It's so sad how ignorant and blind people have become. Saying we need illegal immigrants. Wow. Have you people not seen what's going on in Europe. No they need to come to this country legally people... Thank God we are gonna get it fixed this November. And that's how it will be. We will have a safer country. Trump2016!!!!!!!!!!!!","commenter_a":"Let us call it what it really is \"Bernie Sanders hugs illegal aliens at campaign rally.\". They are not undocumented immigrants because they have not followed the immigration process to get here. They are criminals. Justice needs to be dealt out to them.","post_message":"Bernie Sanders hugs undocumented immigrants at campaign rally."}]
