[{"comment_id":"10156035361815354","commenter_b":"and its only the begining","commenter_a":"WHAY ELSE????","post_message":"An UNDERWATER tunnel."},{"comment_id":"915863931882175","commenter_b":"I think he should be raped until bleeds to death","commenter_a":"Let him go to prison and play with REAL BIG MEN","post_message":"Amanda awoke to find her baby was missing. She found her in the basement bleeding and unconscious. This man had raped the 9-month-old infant until she was brain dead. He was arrested and is in jail, but many people think he deserves a harsher punishment for his crimes. A new petition is calling for him to be hanged in public for his disgusting crime.   Should he be hanged?"},{"comment_id":"10152808147960927","commenter_b":"That is a disgrace and a dishonor to our nation's flag god help us people needs to open their eyes and stop being stupid!!!!!!!!!!!........","commenter_a":"Just filthy sexual habits","post_message":"MLK's niece warns on gay marriage: 'God will have the final word in this matter.'"},{"comment_id":"374997102688584","commenter_b":"she broke the law driving illegal you an i would be locked up so give her 30 days an feed her the same as they feed everybody else might make her see the light or get the hell out","commenter_a":"Tuff shit!! Take it off!","post_message":"Should head scarfs be banned in America?"},{"comment_id":"10156608436570354","commenter_b":"We need to STOP celebrating arrests.... and STOP the influx of these fuckers (LITERALLY) in the first place.... They breed like rats.... Once they infiltrate, there's NO GETTING RID OF THEM.... Think of the rat problems in NYC! How about cockroaches? How about emerald ash bore? Zebra snails? Asian carp? GET IT????????????","commenter_a":"There is no such thing as 'Moderate muslims.' They all read from the same Quran.","post_message":"German police have now made a staggering 379 charges for the attacks in which women were sexually assaulted by migrant gangs on New Year’s Eve.  All the latest DETAILS here..."},{"comment_id":"10154712376336756","commenter_b":"He was a pastor in the Southern Baptist Conference whose strict, written doctrine is anti-LGBT. Whether rabidly or tacitly he was promoting anti-LGBT beliefs by choosing to hold that job.","commenter_a":"The story doesn't address how the pastor felt about gays before his son 'came out' ? Did he always think that gays should be loved, treated fairly, equally like every one else, or is he just coming to that realization because of his son.","post_message":"After the pastor told his congregation about his son's coming out, 'I felt like this weight had just been lifted out of me, and people knew where we stood.'"},{"comment_id":"10153981290586519","commenter_b":"'@username The war was based on a racist desire to see Arabs burn. That's why the American people wanted it. The goal was simply to slaughter a few hundred thousand of 'them' after 9/11, and that racism is something Clinton and half her fellow elected Democrats knowingly pandered to.","commenter_a":"The ideological purity of the Left gave us 8 years of Bush while sitting out the midterms. Sanders and his dead-enders repeat every bullshit right wing talking point. Tired of him and then.","post_message":"Establishment liberals have an unhealthy relationship with the left."}]
