[{"comment_id":"10156250216360354","commenter_b":"Twisted woman","commenter_a":"So, she is trying to say she is with them as a fellow commie? I think someone farted.","post_message":"Yeah, so, um, this happened..."},{"comment_id":"1337533142938860","commenter_b":"an untalented hooker","commenter_a":"That creepy dame who's his spokes person ought to be banned from every network and media outlet.","post_message":"Whoa, CNN grew a backbone! After what was said, he should be banned from America."},{"comment_id":"1219889091393445","commenter_b":"Is it racist to say pot calling kettle black ?","commenter_a":"Cummings is a walking violation of ethics. Pot call.","post_message":"Whoops."},{"comment_id":"10153184330157507","commenter_b":"Two people committing to care for each other for life serves society and is why government encourages it through 1100+ rights, privileges and responsibilities. If you think it's a hypocritical institution, the solution is simple. Stay out of it.","commenter_a":"Marriage is hypocrisy. The 'Government' should have no part what so ever in it.","post_message":"That time Fox News forgot to reprogram Shep Smith"},{"comment_id":"1756628007939155","commenter_b":"Stop and think!....before you vote for Hillary just to have a female as President...You are hanging yourself for women making it again in the future. Stop and think!","commenter_a":"DUNP THE TRUMP & GUILIANI!","post_message":"MAYOR RUDY GIULIANI STATEMENT ON LATEST CLINTON FOUNDATION DONOR SCANDAL:                           (New York, NY) – Former New York City Mayor and U.S. Attorney Rudy Giuliani today released the following statement on the Associated Press’ analysis revealing that 55 percent of Hillary Clinton’s non-government meetings while at the State Department were Clinton Foundation donors whose contributions totaled at least $156 million:   “From the facts revealed to-date, it is impossible to figure out where the Clinton Foundation ends and the State Department begins. It is now abundantly clear that the Clintons set up a business to profit from public office. They sold access and specific actions by and to them for money. This makes a mockery of her promise to Congress and the President to keep the Clinton Foundation and the Clinton State Department entirely separate. In other words, they merged the two into the Clinton Family racketeering enterprise. The need for a Special Prosecutor to investigate these apparent crimes mounts with every passing day and the revelation of new sets of e-mails and phone logs. I’m sure all we’ve seen is the tip of the iceberg and there will be more to follow.” -Rudy Giuliani"},{"comment_id":"610785519070224","commenter_b":"Check that woman's mouth for raw....","commenter_a":"Keep in mind, these people are not working real jobs.","post_message":"Has anyone seen this Fox host's soul? It appears to be missing.   -Conover"},{"comment_id":"1091280717559605","commenter_b":"'@username, are you really that concerned this man will not reach his full potential of sexual pleasure!? He's a man for christ sake! The last thing he needs is anymore reason.. I don't miss the excess skin they removed from vag after giving birth. Wasn't doing me any good, and it would've been in the way. You still got the umbilical cord hanging out of your puss or what!? Never know, you might miss it..","commenter_a":"I knew it caused both my boys pain, but I still had them both circumcised. Haven't regretted the decision at all.","post_message":"Maybe that circumcision was a bad idea after all, huh?"}]
