[{"comment_id":"10153646092561167","commenter_b":"Liberals hate women!!!","commenter_a":"If Megyn Kelly didn't have her looks and her little fued with the Donald to capitalize on she'd be a non issue.","post_message":"Can everyone finally stop pretending Megyn Kelly is any kind of “hard-hitting journalist”?"},{"comment_id":"10153373415836130","commenter_b":"That's right.","commenter_a":"They NEVER thought it was a bomb. If they had, why was the school NEVER evacuated? They were racist, bigoted asses who lied when their hatred was bared to public scrutiny","post_message":"The family is “still deciding where he will go next.\""},{"comment_id":"1046533445373310","commenter_b":"that's not fair to pres o","commenter_a":"MLK would be ASHAMED of those useless race-baiters. He would spit in their eyes himself, if he were still alive.","post_message":"How I wish we had a Martin Luther King today instead of thugs and scam-artists like Sharpton, Jackson, Holder—and Obama."},{"comment_id":"1745160079101455","commenter_b":"No, I am convinced she has a serious mental health issue. She lies and lies about lying. She questions your temperament to lead? She is the psycho, literally, staying with her husband solely for political purposes while constantly defending her indefensible record of blatant corruption. And for what? Her relentless pursuit of more power to abuse. Hillary is not mentally fit to lead","commenter_a":"she looks sedated","post_message":"Bad performance with foreign policy \"speech\" yesterday, by Crooked Hillary Clinton! Reading poorly from the telepromter! She doesn't even look presidential!"},{"comment_id":"10154570947183822","commenter_b":"his ass should of been hung long ago.....his mother should of been charged as an accomplice too.. she knew damn well those officers would be walking into an ambush.","commenter_a":"Yeah...and I want a million dollars....sorry buddy...you earned it. No remorse ...no care....there are no words...","post_message":"The man convicted of killing three police officers in Stanton Heights appeared in court today. Richard Poplawski wants all charges against him dropped, and declared \"Let's Go Pens\" as he was led into court."},{"comment_id":"1019752221480019","commenter_b":"@username then leave!!!!","commenter_a":"Trump does not represent most people in America and he certainly does not represent me. He may be in office 4 years, but I can guarantee you he will not be in another 4 years after that. We will have war in America because of this!","post_message":"President Barack Obama and President-elect Donald J. Trump just met for the first time — and this is what happened. @webpagelink"},{"comment_id":"1658924690814663","commenter_b":"And last time I checked, Treason still carries the death penalty! That would certainly get rid of a bunch of \"bad actors\"! It would go a LONG WAY towards \"making America great again\"!!!","commenter_a":"Trump and Bannon are complicit in Flynn's actions. Does anyone remember Trump tweeting about how \"smart\" Putin is after Putin chose to not retaliate against the sanctions?? This was all coordinated at the highest levels. The whole administration should be in jail for conspiring with a foreign government against America's interests both before and after the election. If all of this put together isn't treason, I don't know what is.","post_message":"Bet Trump knew about this...."}]
