[{"comment_id":"10153347711966680","commenter_b":"And from your own site @webpagelink","commenter_a":"No one has ever really cared what David Duke says so people don't need to flare up over his nonsense.","post_message":"Former KKK grand wizard David Duke on Donald J. Trump: “He’s meant a lot for the human rights of European Americans.”"},{"comment_id":"895290923994817","commenter_b":"Charlotte u must b mistaken u must mean SLICK WILLIE & HIS FAMOUS LEWINSKY & HIS ASHTRAY WHERE HE PLACED HUS CIGAR!!! HE SAID HE DID NOT HAVE SEX WITH THAT WOMAN & THEN HE ADMITTED HE DID!!! Also remember the FOUR BRAVE AMERICANS WHO DIED UNDER LYING HILLARY!! She shd b in jail!! U have been carrying the water for the dems & it is disgusting!! Grow up cupcake & if u can't go get a coloring book and color!!","commenter_a":"We need a liar, rapist and whore nude model in the White House . U bet","post_message":"With every announcement America is falling more and more in love with the Trump family. This is awesome, it's exactly what was needed. Can we get 5,000 'LIKES' for the Trump family?"},{"comment_id":"1827543604143155","commenter_b":"That's right, all you chowder-heads SEE and HEAR what you want to. If MALEIFCENT does win, it will be through 100% corruption...but then that doesn't matter as long ad she wins, right? That way all the unemployed, druggie, scumbags can keep up the anarchy. Well, hold on to your backpacks cause there's a shit storm coming, along with rude awakenings.","commenter_a":"Alexis Marie","post_message":"Even this focus group by Fox News's Frank Luntz agrees Hillary CRUSHED Trump. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153808852885950","commenter_b":"She Looks Like A Damn Meth Whore!","commenter_a":"The doctor should have never inseminated an old hag like this, i am 40 and have suffered two losses and it's so hard to adopt and this psycho bitch was allowed to keep these kids...will her doctor keep doing this and letting her have more innocent babies... Poor baby May She RIP","post_message":"The 13-day-old died inside the van where her mother had left the children for 38 minutes while she visited a cellphone store, police say."},{"comment_id":"994031577299051","commenter_b":"scumbags who cross the border are exactly that illigal criminals who purposely defy US laws. The wall just got taller.","commenter_a":"Keep your citizens and residents on your side of the border. When I travel to Mexico, I have to fill out paperwork. To get back into the United States, I have to fill out paperwork. It is unacceptable that someone can come into this country through Mexico without having filled out anything and no record of them in existence while they're here.","post_message":"Vicente Fox Quesada: \"I'm not going to pay for that f---ing wall.\" Donald J. Trump: \"The wall just got ten feet taller.\" Presidente Enrique Peña Nieto: Trump has damaged the relationship between the U.S. and Mexico."},{"comment_id":"1790088647891885","commenter_b":"Lois did you listen to Hillary's speech . It sounded like she didn't know democrats policies or didn't take thousands from PP and believes in term abortion . Oh she forgot thAt, 🇺🇸Trump🇺🇸","commenter_a":"Hillary calling someone corrupt? Wtf kind of drugs is she on? Her and her so called husband are the biggest, most corrupt crooks ever involved in American politics!","post_message":"Donald J. Trump: \"Hillary Clinton may be the most corrupt person ever to seek the presidency of the United States.\""},{"comment_id":"10152936340096770","commenter_b":"She is such a Train Wreck","commenter_a":"Bored","post_message":"Kim Richards spent the night in jail and was released Monday afternoon on a $5,000 bail."}]
