[{"comment_id":"1142812899111790","commenter_b":"Jade White Ali omg & before ?? Ur a nun then now !","commenter_a":"It's all false to get people to make racist comment, and it's illegal in UK to have more than one wife it's called bigamy","post_message":"Men with more than one wife to get bigger benefits"},{"comment_id":"1145471028827087","commenter_b":"Joy yes the Bible said far be it from the true God to act wickedly! Death is the last enemy, the pain we feel when a love one dies is beyond words indeed God don't cause wickedness n bad things to happen but he \"ALLOWS\" I lost my son who I love dearly and reading and focusing on JOB experience help me to keep my sanity! THANKS BE TO GOD.","commenter_a":"You would not believe how many people said \"everything happens for a reason\" or \"this was God's plan\" when my son was stillborn. It made me so angry, still does. There is no reason, the autopsy proved that.","post_message":"In case you missed it: Sometimes saying \"Everything happens for a reason\" can hurt the folks we mean to help."},{"comment_id":"1551736915123020","commenter_b":"Pssssh please.....ive worked in an immigration office and let me tell you. The GOVERNMENT is taking advantage of illegals and will NEVER get rid of them lmfao. People such as yourself must educate yourselves on the topic. In which, may i add, you know nothing about. Furthermore, illegals PAY taxes which INCLUDE medicare and social security. The government KNOWS that they are working under Americans social security numbers and even submit them ALONG with their real name and address to apply for an ITIN number. This allows them to PAY taxes even though they are in fact illegal. And guess what??? They will NEVER alert the American that their social is being used, these \"illegals\" will NEVER see a dime of social security benefits Nor will YOU!! And oh ya....they CANT apply for medicare / welfare either. And WHY would the government not tell you your social is being used?? ...","commenter_a":"The question is why are illegals getting benefits instead of being deported. No longer should illegals receive benefits from our tax dollars. I read earlier our social security funds have been used for illegals benefits. I for one sure didn't pay into social security so a non citizen could receive these benefits.","post_message":"\"The American taxpayers have reached a boiling point. We are tired of illegals taking American jobs. We are tired of illegals living off our tax dollars. We are tired of illegals causing mayhem in our streets,\" says Todd Starnes. Do you agree?"},{"comment_id":"10153574901357217","commenter_b":"Pete Bayliss Yes i no , the Muslims from the Middle east are taking over the World. we have more trouble with the Muslims from the Middle east then any other race of people here in Australia they are born hatters and want to kill us the free World , they give all the good Muslim people a bad name","commenter_a":"This is very sad but its WAR , and all kind of people get killed in WARS. we the World needs to get rid of ISIS no matter what it takes and innocent people are going to die while doing this . i hate Putin but he is the only one doing the best Jb in getting rid of ISIS.","post_message":"\"There will be no more doctors in Syria.\""},{"comment_id":"1118046224877704","commenter_b":"If her lips are moving SHE is lying!!","commenter_a":"looks like the daily shot of botox is overdue","post_message":"Mrs. Clinton is out accusing the Republicans once again of plotting voter fraud, and she is making this allegation in front of African-American audiences."},{"comment_id":"10153161322294726","commenter_b":"If she moves her lips She is lying","commenter_a":"Think she bad now if she WIN. White house .no stopping HER","post_message":"WATCH: Bombshell Report Clinton Did Use Private Email For State Department Business"},{"comment_id":"10153963007189160","commenter_b":"@username: Michelle Obama is not an entitled wife she is just an ordinary male in women's clothing. GO TRUMP GO!!!!! America is the land that I love.","commenter_a":"Finally now the truth starts to come out. Hopefully Obama cannot put the spin on this now. Hillary for jail with the rest of her crooked family and Obama and his family also. Especially his entitled wife.","post_message":"Wikileaks is out with more than 1,200 emails from Hillary Clinton's private inbox."}]
