[{"comment_id":"1728684567380415","commenter_b":"#NotMeUs hillary just want your vote so she can work hard for the rich people!","commenter_a":"Please exit out of video , share the post by clicking SHARE button on bottom right. Come back and join us❤️","post_message":"Bernie Sanders rally in Pittsburgh: Part I"},{"comment_id":"1478041665558122","commenter_b":"@username - very serious! Just wait and you will see!! Thanks for allowing Clinton to be our next president!!","commenter_a":"Sorry- false!! Most military is for Trump!! Voting for Johnson is a vote for Clinton!! Why would the military want a person who believes in open borders!!","post_message":"These pushups are more than Trump has done."},{"comment_id":"1282426895139188","commenter_b":"Build That Wall","commenter_a":"So sad! Blue lives matter","post_message":"LIVE NOW: Procession now underway in the LA area, for an officer who died in a shooting there this morning. FULL STORY: @webpagelink"},{"comment_id":"728966150600250","commenter_b":"FEMALE ON THE NEST","commenter_a":"Where is the first baby ?","post_message":"WATCH LIVE: We're ringing in the new year with Harriet, M15 and their new eaglet!  We're still waiting for the second egg to hatch!  Where are you joining us from tonight?  WATCH the video of the hatching- @webpagelink Pix provided by Southwest Florida Eagle Cam"},{"comment_id":"1501291303224228","commenter_b":"@username one of the Deplorables. He quotes Breitbart. You instantly lose all credibility; and can't be taken serious. Here let me fix this for you...... @webpagelink","commenter_a":"Nevermind the Democrats who are actually poisoning the people of Flint, right?","post_message":"“Mr. Trump, I invited you here to thank us for what we’ve done in Flint, not give a political speech,” the pastor said."},{"comment_id":"10155119419651320","commenter_b":"Looks pumping","commenter_a":"THE ISSUE IS NOOOOTTTTT MUSLIM!!!!!","post_message":"Democrats hold an anti-Trump protest in Washington D.C."},{"comment_id":"958116217578241","commenter_b":"Hillary had two terms (8) years in the White House. Hillary was involved in everything bill Clinton did!! Hillary had two terms (8) as a New York senator. Hillary had a term (4) years as Secretary of State. Yet, the old girl thought she could have her own server and NOT be held accountable for classified emails... When are Americans going to get pissed enough to hold the shrew responsible?? Hillary left four AMERICAN men to be tortured until dead in Benghazi. Could this be what she and her aids are hiding? As of Friday, as per a JUDGES order nothing has been turned over. The two aids hide behind an attorney and Hillary just never answered... Monday such be very interesting!","commenter_a":"She needs to STOP Monsanto instead of defending them. We all have a right to know what is in our food.","post_message":"Join Hillary's fight to build an America where we don't leave anyone out or anyone behind: @webpagelink"}]
