[{"comment_id":"10153278641039087","commenter_b":"Absolutey prison is where this bitch belongs.","commenter_a":"MADAM PRESIDENT HILLARY CLINTON","post_message":"“I have no doubt on [Thursday's appearance before the House Benghazi Committee] she will be remarkable, and that Americans will really see why so strongly I believe she should be our next president,” Chelsea Clinton said about her mom Hillary Clinton."},{"comment_id":"10152987583472014","commenter_b":"If you don't want the responsibility of a baby, get yourself fixed or some type of contraceptive","commenter_a":"Punch her in the face","post_message":"A teen mother says she didn't know she was pregnant before delivering a baby girl, but court documents detail chilling details of her searching the Internet for ways to induce a miscarriage while 38 weeks pregnant."},{"comment_id":"10153442535983132","commenter_b":"there is tons of transgender models lol","commenter_a":"Beautiful!","post_message":"If 2015 wasn her year already, it sure is now."},{"comment_id":"991950690936939","commenter_b":"Looks can be deceiving. The slob has way too much power and his history is terrible.","commenter_a":"How is Bannon so canny?? He always looks like he just work up in a bus stop with a bad hangover and isn't 100 percent sure where he left his pants.","post_message":"Trump's aides also reportedly don't know how to properly turn the White House lights on and off."},{"comment_id":"10153527716947623","commenter_b":"Trump will get enough advertising on Buzz feed by way of the anti Trump protestors acting like idiots. If you watch a video of people getting assaulted and are ok with it then you don't have much of a moral character. Why should America allow illegal immigrants to keep coming in and why shouldn't we have the ones here deported? There are legal ways of coming to this country use that rout and people will respect you more. Don't want to become legal then don't come to the USA. Stay in the country you are from.","commenter_a":"Wow, this is pretty pathetic. Considering Trump's numbers I believe we can infer he'll continue to do just fine without Buzzfeed's advertising lol. Can't wait to see their reaction this January! #Trump2016!","post_message":"\"We don't run cigarette ads because they are hazardous to our health, and we won't accept (Donald J. Trump) ads for the exact same reason.\""},{"comment_id":"497892010370754","commenter_b":"I should be arrested for the nuclear bomb I just dropped in the women's bathroom at my work. You'll never take me alive!","commenter_a":"I hope his family sues the shit outta that school so his entire future is paid for, Racists fucks","post_message":"\"Cool clock, Ahmed. Want to bring it to the White House? We should inspire more kids like you to like science. It's what makes America great.\"  - President Barack Obama"},{"comment_id":"10153039611668984","commenter_b":"Shoot this prick and his offspring","commenter_a":"I support the 25 congressmen that voted against you! And ALL YOU DID WAS PROVE THEM RIGHT MR! JOHN HUSSEIN BOEHNER! YOUR A VINDICTIVE DISGRACEFUL representative!","post_message":"John Boehner may have just sunk to a new low with this move. This is the type of thing I would expect from a 3rd grader, not a supposed leader like Boehner.  Do you support the Republicans who stood against John Boehner?"}]
