[{"comment_id":"10153517844123984","commenter_b":"They needed to know.","commenter_a":"This is the most retarded thing anyone has ever posted on faceboook.","post_message":"Mega-church TV pastor Joel Osteen just made a sickening announcement about Muslims... Spread this absolutely everywhere... the REAL Joel Osteen needs to be exposed. Do you agree that Osteen is a fraud?"},{"comment_id":"1037969679612623","commenter_b":"Preach it brother!! Racial hangups. More racial tension in this nation since the 1960's. that is a fact. Does every speech have to include how everyone use to be slaves, so down trodden and pitiful. I know alot of blacks. They are smart, educated and are not prisoners of the past. We understand history, we know what happened. But my goodness, dont be so beat down by killary. Dont let her use you. After all, she said, \"blacks are predators and she needs to bring them to heel\". So who has racial hangupsI I'll check back for your answer.","commenter_a":"I realize slaves help build the whitehouse. Whtes also helped build the whitehouse. That would have been a good statement. Like, blacks and whites worked together to build the place where our presidents live. It was a joint effort. But as usual, race baiting and on and on about how slaves had to rise up etc... We have had a potus who has made racial tensions the worst they have been since I was a teenager. How is this unity? How have bama and shelly brought unity to our nation? More rioting in the streets more blacks killing each other, our people are fighting and against each other. So much for the legacy of the first black potus. Now they want a woman to be the nxt black potus.","post_message":"Well said, Kelly Clarkson!"},{"comment_id":"10156732658910492","commenter_b":"What is it with older ladies and dislike of bike lanes? @webpagelink","commenter_a":"These ladies probably shouldn't be driving anyway","post_message":"\"New York City is not Amsterdam, it never will be Amsterdam, and that's all there is to it.\""},{"comment_id":"595790673878859","commenter_b":"SHE NEEDED TO LEAVE!!!","commenter_a":"Ragheads go home .","post_message":"This Muslim woman walked into a salon and demanded all the men leave so she could remove her headscarf. It didn't take long for her to realize she had made a huge mistake and this hairdresser was not going to accommodate her entitled behavior."},{"comment_id":"1411220458918808","commenter_b":"I honestly think you just don't understand because you have never been through it. Hopefully you never will. It's a tough road as a parent. But My SON JASON is the love of my life!","commenter_a":"why do people with autistic children often talk about \"mourning the death of the child they thought they had\"?? its the same kid. we're not car accidents to be grieved over. we are people.","post_message":"Greg and Maya are doing everything they can to make sure their son with autism is safe, comfortable, and — most of all — happy. Parenting 2.0 | An Upworthy Original Series"},{"comment_id":"882717625081928","commenter_b":"Keep negotiating with Muslim terrorist and they will only become more determined. The world needs to unite and eradicate this cancer.","commenter_a":"Life for a life,Peace talks Needed.","post_message":"Japan has vowed to work with Jordan to secure the release of a Japanese journalist held by Islamic State militants in a crisis that has become a test for Prime Minister Shinzo Abe. Read more: @webpagelink"},{"comment_id":"579603902228604","commenter_b":"She must have morals","commenter_a":"Oh the horror of it all! Freedom of speech, freedom of choice, oh now we have her! Pathetic!","post_message":"People are freaking out over what's being said about Taylor Swift today..."}]
