[{"comment_id":"10155004778474136","commenter_b":"This woman is a nut case.","commenter_a":"Skimmers...","post_message":"\"I think he is leading himself into that kind of position where folks are beginning to ask what are we going to do and the answer is going to be, eventually, we have to do something about him,\" Maxine Waters waters said of President Donald J. Trump. FULL STORY: @webpagelink"},{"comment_id":"10153617049593984","commenter_b":"Hillary's a woman chaser to.","commenter_a":"Bill has Always been a Woman chaser... Hillary Must been doing something Wrong... Or she's to busy Scamming People out of their Money.....","post_message":"This woman has struck fear into the hearts of the Clintons for a long time. Now she may have just landed a knockout blow on Hillary... This could be what takes Hillary down. Do your part to make sure that happens by spreading this article to your friends and family."},{"comment_id":"10153535690187235","commenter_b":"Smh then leave America . most people who care about a lion will definitely care about a person .... They are both worthy .","commenter_a":"Because the lion will see actual justice and the same can't be said about Sandra or any other person who has died while in police custody......how sad is America smh","post_message":"Someone had to say it ..."},{"comment_id":"10153235408755090","commenter_b":"Can anyone tell me why Hillary wants to be President?","commenter_a":"Another \"heir apparent \" to the presidency.","post_message":"One question: Why don't you want Hillary Clinton to be president? Tell us here: @webpagelink"},{"comment_id":"1167588859974389","commenter_b":"Bo Go Back To Fucking Your Sistermommy","commenter_a":"Isn't that great ! I am happy to see Trump gets that endorsement. Hillary is probably sick with envy but she got an endorsement from BLM...and other terrorist groups.","post_message":"Major Endorsement from our Heroes on the Frontlines..."},{"comment_id":"10153495487996770","commenter_b":"It's never a joke untill they come for you, then you want to cry, I'm just joking. So is that prison cell dumbass.","commenter_a":"This is just another instance, where Obama should be stepping up to this kind of talk!","post_message":"A #BLM sympathizer posted \"Death to all White Cops\" on Facebook but was completely unprepared for what immediately happened next. Then she did something even dumber!"},{"comment_id":"10153526250577431","commenter_b":"The swastika is an inverted cross of the Buddha. He was also inspired by Indian (India as in East Asian) mysticism.","commenter_a":"As a historian, I was amazed at what was copied by the Nazi regime as a way of dealing with racial, etnic, and religious cleansing. The more that I learned about Hitler's insanity the more I realized that he copied the concept of the concentration camp from the US answer to the Indigenous people of this land. The Nazi's swastika is even taken from Native American symbols. This is why the UN still holds the US as guilty of crimes against humanity.","post_message":"Ugly Precursor to Auschwitz: Hitler Said to Have Been Inspired by U.S. Indian Reservation System @webpagelink"}]
