[{"comment_id":"10153119045143145","commenter_b":"You are actually showing your colors, stop trying this woman about race card when it was all about race.","commenter_a":"She was stupid and uncooperative. Why didn't she just do what they asked her instead of acting like a complete assh*le.","post_message":"This woman got into a road rage argument in a school parking lot. Then this is what happened when police arrived. #WFTV WATCH THE VIDEO: @webpagelink"},{"comment_id":"10154753068623812","commenter_b":"Send them all back and send Mexico into a Panic Mode. The Wall will be up in no time.","commenter_a":"Maybe he can bring back the auto manufacturing jobs from Mexico, and hire legal citizens, and then the illegals will stop coming. Oh wait. They come here because there are those willing to pay pitiful salaries and no benefits to make a buck.","post_message":"Donald J. Trump has made his promise that Mexico would pay to build a wall along the U.S. border a centerpiece of his proposed immigration policy. But only 13% of voters believe he could deliver on that promise if elected."},{"comment_id":"959266487466433","commenter_b":"O girls have brains too?","commenter_a":"Only frustrated sick person can prefer physical fearure otherwise normal and true men appreciate beauty with brain","post_message":"Men care more about a woman’s brains than her bust, allegedly"},{"comment_id":"1538307646229359","commenter_b":"Let it burn ...what a dumb bitch...","commenter_a":"Let's see how that works out!","post_message":"What do you think?"},{"comment_id":"10154691100574369","commenter_b":"Stfu","commenter_a":"Stop showing the younger smiling picture of this kid. Get a current picture...and then imagine it behind a gun. I guarantee this kid didn't look so innocent that night.","post_message":""},{"comment_id":"1126946630726765","commenter_b":"@username accepted money/bribe from the Clinton Campaign/Foundation. Recent documents released from wikileaks show! He is part of the problem and is an enemy of Americans at this point!","commenter_a":"clinton-foundation-invoiceAs you can see, the page from the Accounts Payable Invoice lists 14 names to whom the Clinton Foundation had paid considerable sums of money for suppression: $89,000 to A.C.O.R.N. $42,300 to William (Bill) Ayers: unrepentant former Weather Underground domestic terrorist; early supporter of and like ghostwriter for Barack Obama. $109,000 to @username, the radio show host who was an avid supporter of Ted Cruz during the GOP primaries, and continues to be a diehard opponent of Donald Trump. (See suspended by SiriusXM radio for hinting at Trump assassination) $203,000 to Black Lives Matter. $333,400 to the Black Panthers. $10,000 to Bill Kristol, founder and editor of the conservative magazine The Weekly Standard and, like Beck, is dead set against Trump. (See Kristol declares there will be a 3rd-party candidate against Trump) $80,600 to Monmouth University, presumably the university Polling Institute that conducts political and election public opinion polls. $12,000 ...","post_message":"Must watch."},{"comment_id":"545037952353451","commenter_b":"Racist people!","commenter_a":"He is right ON. Sick of all this PC!!","post_message":"This man chose to stand up to Obama's lies, and now he's facing this. What a sick joke. This man needs our help, let's show him we have his back. Do you support this Sheriff standing up to Obama?"}]
