[{"comment_id":"10153240957300950","commenter_b":"We need a new president - but not Hillary!","commenter_a":"Putin keep up the good work","post_message":"'He needs to go after the people who killed Russian citizens,' Obama said of Putin."},{"comment_id":"10154082437051051","commenter_b":"As usual she is lying.","commenter_a":"Wrongagain.","post_message":"Hillary Clinton says there's no question Obama will go down in history as a successful president. Is she right?"},{"comment_id":"885881534804929","commenter_b":"That what she said.","commenter_a":"Her neck looks like huge lips.","post_message":"She shared explicit messages and pictures with pupil after the schoolgirl came out to her"},{"comment_id":"10154743598641323","commenter_b":"Yep. Greedy bastards.","commenter_a":"Ladies and gentleman. I present to you - Capitalism at its finest......","post_message":"Michelin-starred TV chef Michel Roux Jr. has been paying some kitchen staff at his Mayfair restaurant less than the minimum wage, the Guardian can reveal, while charging over £60 for one starter."},{"comment_id":"1342320752468340","commenter_b":"Happy to see a change in the Mayor's house! See ya!","commenter_a":"if first lady gets this, what can common man expect,...","post_message":"The mayor said she was merely expressing happiness for 'change in the White House.'"},{"comment_id":"10154985622284687","commenter_b":"She schould blame her father for this","commenter_a":"Brilliant ! Will do","post_message":"is just  it's a wonderful line. I own some of it. I fully  I'm going to give a free commercial here. Go buy it today, everybody. You can find it online."},{"comment_id":"10153173313535090","commenter_b":"<(') Those whom approve of ILLEGALS in our country are either here illegally themselves Or are Profiting off of them in some way. The Government equates Illegals to two things, more tax revenue for them to spend & more votes for the democratic party. To insure this, they are flooding our society with individuals from every country possible. They couldn't care less about The American Citizens or LEGAL Immigrants. To Overpopulate any country places an undue burden on it's natural resources, it's firemen, it's police, it's agriculture ( food ), it's educational & medical centers. Obama Openly stated : I will immigrate 100,000 Muslims from the middle east annually for the next 8 years... :( He recently aided 100,000 Illegals prior to a Judge filing a stay of his executive order. He & Hilary Clinton are receiving money from Saudi Arabia & other middle eastern governments to insure their agenda ...","commenter_a":"51 million immigrants in the last 8 years! When are you guys going to do your jobs and stop this madness!!!","post_message":"Do what's best for your health.   Stand in opposition to Obama's government bureaucrats: @webpagelink"}]
