[{"comment_id":"10153912025664030","commenter_b":"Kiss my ass.","commenter_a":"@username lol sleep tight","post_message":"Not Safe with Nikki Glaser asks the questions you didn't know you wanted answered.  All-new episode, tonight at 10:30/9:30c."},{"comment_id":"10152991778321336","commenter_b":"Illegal aliens beau","commenter_a":"scary stuff","post_message":"More than 100 patients may have been exposed to a potentially deadly \"superbug\" at the Ronald Reagan UCLA Medical Center."},{"comment_id":"1593060860989996","commenter_b":"Thats how they want America ....in a trance.","commenter_a":"May I suggest Sarah Palin as a running mate? We've heard that she not only supports you, but offered her services :)","post_message":"You could tell Donald J. Trump knew the debate went badly by the way he barreled into the \"spin room\" last night, immediately disavowing things he'd said in front of more than 80 million people just moments before. The back-peddles and lies have only grown more mystifying in the hours since."},{"comment_id":"10154773205966037","commenter_b":"Hillary is the liar and murderer deserves to be in prison right now!","commenter_a":"SHUT UP TRUMP","post_message":"WATCH LIVE: Donald J. Trump holds a rally following last night's debate and says he will totally accept results \"if I win.\""},{"comment_id":"883354948459698","commenter_b":"Literally you're the only person I could think of that would find this as interesting as I did.","commenter_a":"@username this cell has no mitochondria and is kicking, but my phone dies on 15% #whatatime","post_message":"Time to rewrite the textbooks again."},{"comment_id":"1282426895139188","commenter_b":"Build That Wall","commenter_a":"So sad! Blue lives matter","post_message":"LIVE NOW: Procession now underway in the LA area, for an officer who died in a shooting there this morning. FULL STORY: @webpagelink"},{"comment_id":"1119027841463579","commenter_b":"Julie, if you want perky get a coffee maker. Geez.","commenter_a":"Wouldnt Dr Carson be a more appropriate choice for Dr Jeffers to endorse? Dr Carson doesnt bash anyone like Trump does. Trump is so rude. Im embarrassed for First Baptist Church.","post_message":"\"It's not that Evangelicals have given up on their values, but they no longer believe that government can uphold those values.\"  Today on \"FOX & Friends Weekend,\" Dr. Robert Jeffress explained the \"huge paradigm shift\" in what Evangelical Christians are looking for in a candidate."}]
