[{"comment_id":"1692899604103495","commenter_b":"She is a skank","commenter_a":"Chelsea Clinton is the poster child for white privilege.","post_message":"She CANNOT be serious."},{"comment_id":"10153444962923984","commenter_b":"Yes since he is their best muslim buddy","commenter_a":"Duh Yeah","post_message":"Well, this is worrisome. It's bad news for pretty much the entire Middle East, except for ISIS.  Do you think Obama has entirely botched the ISIS situation?"},{"comment_id":"10153057043503984","commenter_b":"Kick her dumb ass out of office!","commenter_a":"NO!!!!!! We the people need to come together and figure out what to do about these people. No one in Washington is.","post_message":"I guess she's revealing her true intentions behind becoming someone in power... I wouldn't want to live under her rule.  Do you think this new mayor should be allowed to put restrictions on the Constitution?"},{"comment_id":"641559742659462","commenter_b":"This woman is either a complete idiot or a pure propagandist.","commenter_a":"Oh how people forget that gore won the votes of the people","post_message":"'Not since the American Revolution has the ruling class tried so hard and so blatantly to take away our vote.' – Judge Jeanine Pirro @webpagelink"},{"comment_id":"1016566111717194","commenter_b":"What a fucking hypocritic Bitch.","commenter_a":"Please don't accuse her for stealing a flag. She needed one to wear for a photo shoot to feel nostalgic about a time when she was a playmate.","post_message":"An enraged conservative attempted to steal an American flag from African-American protesters and fought with police, but was not arrested...at a demonstration regarding white privilege."},{"comment_id":"10154038979953279","commenter_b":"Very simple by democratically changing the Congress /Senate, and local states governments with stateswomen /men that supports Bernie's and we the people's agenda. If you think outside the subjugated status quo box where you live it is possible to allocate the economic resources where we want it to be instead of for example spending trillions on wars and then passing a debt bill to we the people so we paid more to wall street. Simple enough. We can even pass legislation specifying since that Iraq war was illegal due to lies for greed we can write off that illegal debt and don't paid to wall street. Hmm just brain storming the possibilities once we change the Congress, Senate, and Bernie is our POTUS. Just follow THE PANAMA PAPERS.","commenter_a":"Hillary is Cynical. But we the people know who the real champion for the 99% working class wealth producers is. Only Bernie Sanders is genuine and legit to the people. #NotHer15 #berniesanders #latinosforbernie #bernieorbust #creditgoestobernie","post_message":"'I’m supporting Bernie Sanders because he says no to fracking. I’m supporting Bernie Sanders because we do need a single-payer healthcare system that takes care of everyone. And that is not a pipe dream.' - Rosario Dawson"},{"comment_id":"10155014119221178","commenter_b":"Democrats have always gotten away with MURDER!!","commenter_a":"Accountability was not a word he knew--or enjoyed.","post_message":"Talk about a major understatement from The Daily Beast."}]
