[{"comment_id":"10153079527196051","commenter_b":"Darwin Award!","commenter_a":"The boy appears to be under the influence.....too bad.","post_message":"This girl thought it would be fun to take selfies while she and her boyfriend were driving. This is what they looked like before the crash. Now check them out after."},{"comment_id":"10152969596402452","commenter_b":"Exactly @username, you apply these same rule to your god daughters.😊","commenter_a":"No one cares about the children lol pets ftw!","post_message":"PET SAFETY: Arizona Cardinals player Tyrann Mathieu sits in an SUV with the windows rolled up on a sunny day in a new PSA about the dangers of leaving pets in a hot car. He lasted only eight minutes. WATCH: @webpagelink"},{"comment_id":"10153720536124087","commenter_b":"@username I bet you're wife is a illegal ass immigrant. Get ready to never see her again once he wins","commenter_a":"Cool. Soon there will be no minorities left for trump to insult. He'll start insulting the lackof intelligence of his supporters.","post_message":"GOP front-runner Donald J. Trump recalls phoning his credit-card company to see if an Indian call center would answer."},{"comment_id":"1149506871736008","commenter_b":"You're welcome.","commenter_a":"What an embarrassment this guy is. Shameful. smh....","post_message":"President Obama took a jab at the so-called \"birther\" movement on Saturday night while in Kenya, his father's homeland."},{"comment_id":"1740459202903983","commenter_b":"SHE IS A FELT POINT SPOILED BITCH THAT HAS NEVER WORKED A DAY IN HER LIFE","commenter_a":"Having second and third generation entitled political hacks like Pelosi is what breeds assholes like Trump. In the end, Karma is a bitch. This country can do better.","post_message":"Nancy Pelosi blasted her Republican colleagues for not taking action on gun control, saying after every shooting there is a moment of silence, which means nothing without action. Pelosi states \"a moment of silence just left there is a moment of denial.\" Do you agree?"},{"comment_id":"10154986550662767","commenter_b":"@username DO SOME RESEARCH, BITCH!","commenter_a":"I hope he meets a terrible demise. Like I am talking, Isis style, execution. In high definition, with fabulous audio. Now, I would read THAT book, for sure. I wish nothing but the worst, to this radical islamic Kenyon born, Isis daddy! I wonder what chapter of the book describes Michelle, peeling off sweaty duct tape, and revealing the SCHLONG, that MADE THE FREAK BATHROOM BILL? Trump is wiping any, and everything, this TERRORIST has done. #HeDontMatter #GhostPresident","post_message":"Obama is widely expected to get the most lucrative contract ever for a post-presidential memoir."},{"comment_id":"1101968433174725","commenter_b":"Okay? That doesn't mean he wasn't talking to all Americans in this quote.","commenter_a":"He was actually talking to the wealthy in America with that phrase. He was about to raise their taxes.","post_message":"BOOM!"}]
