[{"comment_id":"990316741094881","commenter_b":"Fuck her","commenter_a":"Never heard of her.....moving along now","post_message":"Was she right??"},{"comment_id":"10153974201673445","commenter_b":"They don't care about you & me.Ain't it always about the buck & Greed.Karma will get those Clowns.Lawsuits are coming!! Let's put these clowns on Min.wage.We won't have to worry about them working overtime.Take away the free Health Insurance,put them on O'Duma care.Take away their pension.It's the taxpayers money.","commenter_a":"They continue to reject medical marijuana but continue to give out pain killers and other sedatives wow seriously","post_message":"VA Hospitals Will Continue to Reject Medical Marijuana."},{"comment_id":"10154602894018145","commenter_b":"wcjb tv 20 out of gainesville covers you daily too.","commenter_a":"Hardly news when you live in the Ocala area............and BTW, we are in YOUR viewing area and could use the same weather 'attention' that Orlando/Daytona/Melbourne get.....especially those of us in the rural area.....thanks","post_message":"MUCH colder weather is around the corner!"},{"comment_id":"10153889638518598","commenter_b":"You have it all wrong. The time to take-down Planned Parenthood and stop the murder of babies is now.","commenter_a":"Excellent! State's rights in action!!","post_message":"BREAKING: Kansas Governor Sam Brownback Signs Bill to Permanently De-Fund Planned Parenthood"},{"comment_id":"10155196605381178","commenter_b":"I suggest duct tape over her mouth...such a sad woman !","commenter_a":"Alveda King, Martin Luther King Jr.’s niece, accused Massachusetts Sen. Elizabeth Warren of playing the “race card” when she attempted, on the Senate floor, to read a letter written by Coretta Scott King in order to make her case against Sen. Jeff Sessions for attorney general. “It’s almost like a bait and switch, stir up the emotions, in the name of King—and my name is Alveda King—stir up people’s emotions, play the race card, which she was attempting to do,” King, who supported Donald Trump for president, said Wednesday on Fox Business Network. Sessions was confirmed Wednesday to be the next attorney general despite efforts by Democrats to derail the nomination. The full body voted along party lines to silence Warren for violating Senate rules after she attempted to read Coretta Scott King’s letter.","post_message":"Bitter, much?"},{"comment_id":"10154212192071955","commenter_b":"Stupid troll whore","commenter_a":"TRUMP!!! lets see. he thinks SADDAM HUSSAIN is great!! makes fun of people with medical problems! AMERICANS wages are to high !! P.O.W.S are losers!! he is a draft dodger!! will not show AMERICA his taxes!! he did say women are bimbos pigs!! he has so for 3500 lawsuits against him not paying his employees!! all of his products are made in other countries!! he flip flops more than a fish out of water! said he will be self funding now he has his tin cup out!! he is the king of bankruptcy!! Donnie only cares about Donnie and his golf courses!! TRUMP NEVER!!! OHIO FOR HILLARY!!!","post_message":"ISIS KILLS 5,200 IN MONTH"},{"comment_id":"274137179658285","commenter_b":"@username paying for this useless wall? Yeah I know. It must be stopped!","commenter_a":"I wonder how many of these people are willing to take any of it illegals home, feed them, pay their medical bill and totally care for them?","post_message":"LIVE: Protesters gather at JFK Airport in New York in response to Trump's immigration order. A Yellow Springs resident is planning a local protest for Sunday: @webpagelink"}]
