[{"comment_id":"1099239800197691","commenter_b":"Brave Women! I hope they don't beat you with a shoe!","commenter_a":"Yet, elsewhere they are romanticizing misogyny.","post_message":"Women in Iran risk prosecution if caught contravening the ban, which was issued by Supreme leader Ayatollah Ali Khamenei."},{"comment_id":"10153259534778145","commenter_b":"Hehe","commenter_a":"Happiest place on earth!!!!!!","post_message":"EPCOT BRAWL: Looks like these Disney guests weren't exactly having a blast at the happiest place on Earth. Three women were recorded having a full-fledged fistfight while waiting in line at the Test Track at Epcot. Watch the full video: @webpagelink"},{"comment_id":"1092094194179315","commenter_b":"Because I have read other shit she has posted and the BITCH talks crazy THAT'S WHY @username!!!!","commenter_a":"Wondering, where are the people saying, 'he should've complied with police orders?'","post_message":"Protesters in Fresno, California, waved the Confederate flag & signs that read “White Lives Matter” to express outrage over a local unarmed white man’s police-involved shooting death.   Several shouted “f**k the police” and threw water bottles and glass toward a line of policeman gathered near the crime scene. DETAILS ---> @webpagelink"},{"comment_id":"965413580245506","commenter_b":"Keep trying @username. Killery the lying hag will fall short.","commenter_a":"PT Barnum is running for president!!","post_message":"Donald J. Trump tried to remember #DDay with a photo that wasn't from D-Day."},{"comment_id":"10152841390816491","commenter_b":"Men wouldn't would they!!!","commenter_a":"What the hell? Who cares? I mean honestly. Who the hell cares?","post_message":"“Every ounce of milk I’m able to produce for my child is nothing short of a miracle and to watch that milk be thrown away without any regard for my baby was heartbreaking.”"},{"comment_id":"1230794190274923","commenter_b":"Umm for a free orgasm I bet you would.","commenter_a":"'@username how do we get our hands on some of those mushrooms!","post_message":"This fungus can give a woman an instant orgasm."},{"comment_id":"1614898715485754","commenter_b":"No need to worry, Just Drink a Coffee ☕","commenter_a":"Brad Sherman","post_message":"Two days ago, an enormous asteroid flew past Earth. It was half as close as the moon. And we barely saw it coming."}]
