[{"comment_id":"682877985236113","commenter_b":"Carrie is a rich beeeatch!","commenter_a":"Liberals need to keep their views to themselves....Carrie, is a sweet mother and wife, and can teach her son what she wants to teach him, regardless what others might say: Because, He is HER child not the Liberal idiots, out there...!!!!!!","post_message":"Liberals are going after Carrie Underwood for her faith, she needs your support.  She is a true Christian. Let's get her back.  Can we get 85,000 'LIKES' for Carrie Underwood's faith?"},{"comment_id":"10155588637195389","commenter_b":"Amen!!! Good post...","commenter_a":"Every police officers in this country should take their badges to the white house and give it to the biggest racist in the country.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153818527657623","commenter_b":"Nope, because how would we get our food? Most illegals work in Agriculture, and farmers said they don't want them removed. I don't think illegals are our problem. They pay billions each year in taxes. For example, food, sales, telecommunications, cable, transtportation, gas, etc. If we got rid of them, we would lose in the end no matter how many jobs we would get in industries that don't require I-9s.","commenter_a":"It's sad, heartbreaking, and demoralizing to people on that side of town that have tried to do anything to help curb the problems. The answer is not to make the situation worse by closing the store. The store is the lone grocery story on that side of town @username. That is not going to help. The solution is to deal with the poverty on that side of town. People steal and rob and sell drugs for economic reasons. They are broke basically. That's why on the Westside the BP got robbed by the White lady. She was broke, and she committed an armed robbery because she got desperate and didn't know what else to do. It's the same thing that has been happening on the Eastside, it's just spreading across the city. We have to build up both sides. There are things the city could do to help, such as, ...","post_message":"'Everybody was like 'yes' when we saw him come in. Because we knew it was going to be a good night. Because he would make us laugh.'"},{"comment_id":"1263042020429217","commenter_b":"She started the whole thing ...she spit on him and was calling him a n***** ...she even lied and said she didn't even hit him or anything and begged for the video to not be shown.she is also suing the restaurant and this is not the first time she assaulted someone and lied about it .she is scum and a money hungry bitch","commenter_a":"Everybody saying she deserved it, just hope your daughters don't instigate something and get her ass beat.","post_message":"Totally uncalled for!  #WSHH #Oklahoma #JoeMixon"},{"comment_id":"1109305832420099","commenter_b":"It's time for a female to make some real changes...","commenter_a":"Hes no match for #Hillary","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"693308824147234","commenter_b":"and being hoes..laaag","commenter_a":"This shit here is crazy. All week we been talking bout Kylie like she beyond famous. Her family is known for fucking and being hoes. Malala opens up a school and nobody don't say nothing the worlds view point on things is fucked up.","post_message":"Quit making stupid people famous."},{"comment_id":"10155055910404411","commenter_b":"RACISMRACISMRACISM!!!!blahblah blah","commenter_a":"Funny how it's white people who are quick to discredit this as well as add in fake stats. But you're not racist right?","post_message":"D410 Code - 'to alert co-workers that  black person is in the store'"}]
