[{"comment_id":"1031319243615345","commenter_b":"What?","commenter_a":"What so if the creep has aids the victim can't get justice and if the victim gets drugged and is attacked what happens ??? Maybe you may have not thought this through???????","post_message":"... Seriously, America?"},{"comment_id":"712691792254732","commenter_b":"Nothing going to happen to the bitch, cannot wait for her and Mr Muslim to be out of White House....","commenter_a":"The American people were fools to ever put them in the White House . Now we have to find a way to get them the hell out","post_message":"Michelle Obama facing hug charges after being enveloped in lawsuit. Good it's about time. She couldn't get away with this. Do you think Michelle Obama is a criminal?"},{"comment_id":"1017113771678485","commenter_b":"@username no dont get mad because Hillary is a corporate puppet slave and black people dont like her!!!","commenter_a":"Sorry black folks don't like Hillary","post_message":"Speeches, selfies and heart-to-hearts: A look inside Hillary's recent events in African American communities."},{"comment_id":"10154959437824369","commenter_b":"If I was impregnated by my rapist, I can assure you that I would not be having that child!","commenter_a":"Again, this does not make exceptions for rape. Also, the only people getting abortions at that stage are women whose lives are in danger or something is terrible wrong with the fetus. This is more unnecessary legislation.","post_message":"Abortions would be banned after 20 weeks under a bill Republican lawmakers hoped to pass Wednesday"},{"comment_id":"10154133402331770","commenter_b":"She needs to pull up her big girl panties,get over herself,go sit in a corner an SHUT UP!!!!","commenter_a":"she must have a lot of pull huh? Get of your bandwagon and properly take care of your children why don't you.","post_message":"Should Obama declare martial law and prevent Trump from being president \"UNTIL TRUMP IS 'CLEARED' OF ALL CHARGES\" as Rosie O'Donnell argues?"},{"comment_id":"10155347376155389","commenter_b":"She certainly is a cow!","commenter_a":"I would vote for a dead cow before id vote for her. Oh I forgot she is one.","post_message":"It's your turn to answer Sean's Question of the Day! Will the growing list of scandals hurt Hillary Clinton if she runs for president?"},{"comment_id":"1765102733707241","commenter_b":"What a pig","commenter_a":"Mariana Vilella","post_message":"Hillary Clinton: \"It's just awfully good that someone with the temperament of Donald Trump is not in charge of the law in our country.\" Donald J. Trump: \"Because you'd be in jail.\""}]
