[{"comment_id":"943670819034115","commenter_b":"lol..that is a joke...that skank aint pretty at all..not cause her skin color..its because shes ugly..Id rather hit precious","commenter_a":"She is the most racist, evil, conniving bitch to ever be in the white house! With her 22 \"assistants\"! And you know most of them are probably white so she can treat them like slaves!","post_message":"Americas Freedom Fighters"},{"comment_id":"10152797657587144","commenter_b":"Those \"additives\" include vitamins and minerals. I'll take it.","commenter_a":"Oh yeah, I just remembered why I unliked @username in the first place.","post_message":"\"A jug of almond milk containing roughly 39 cents worth of almonds, plus filtered water and additives, retails for $3.99.\""},{"comment_id":"1709198036011185","commenter_b":"@username!!!! Stop!!!!","commenter_a":"Jenna Pitt @username","post_message":"The baby is the first in the continental U.S. to be born with the Zika virus-related brain condition."},{"comment_id":"10153854573245779","commenter_b":"Bullshit","commenter_a":"If were a boy... all feminazis here asking death penalty.... hypocrisy","post_message":"A 14-year-old girl sent suggestive pictures to a classmate and now she might have to register as a sex offender. Here's why this is absurd."},{"comment_id":"10153617541751770","commenter_b":"As Hillary would reply, \"What difference does it make now? I've WON! Sadly, has she?","commenter_a":"You have no anything to go on except you love to hear your lips flap self righteousness find some proof not just the dolts you hang with","post_message":"Dana Perino destroyed Hillary Clinton in an epic rant over her use of a private email server..."},{"comment_id":"809566335745494","commenter_b":"So women are just as bad as men, better just keep it men. Got it.","commenter_a":"Sorry but all woman in politics have proven just as deviant and en n efficient as men. So let's not rush anything. They should be recognized for there merits. So are the men that have no connections and money. But stile do amazing work","post_message":"Powerful."},{"comment_id":"1099239800197691","commenter_b":"Brave Women! I hope they don't beat you with a shoe!","commenter_a":"Yet, elsewhere they are romanticizing misogyny.","post_message":"Women in Iran risk prosecution if caught contravening the ban, which was issued by Supreme leader Ayatollah Ali Khamenei."}]
