[{"comment_id":"1675805602436783","commenter_b":"Wicked prick!","commenter_a":"That is what happens when you try to work \"across the aisle\" with a group of people that have no desire to work with you.","post_message":""},{"comment_id":"10153512540611491","commenter_b":"Blow this mf off the face of the earth","commenter_a":"@username Camangyan","post_message":"\"The only way for defending the sovereignty of our nation and its right to existence under the present extreme situation is to bolster up nuclear force.\""},{"comment_id":"1157175910989546","commenter_b":"Why would ANYBODY admit they were a Republican after this years parade of idiots, never mind vote for them?","commenter_a":"Assholes are use of SHIT !!!!","post_message":"Three Republican presidential candidates befriend a pastor who just went on stage and gave the most bizarre anti-gay speech ever."},{"comment_id":"10153475900679705","commenter_b":"Excuse me, but what kind of a MOTHER leaves her DAUGHTER behind because there's no seat for her?!","commenter_a":"There's very easy way to avoid these things. Don't piss about at the last minute and end up being the last person to check in. Guaranteed a seat on the plane.","post_message":"Unbelievable."},{"comment_id":"10153084060819330","commenter_b":"I. Jesus. Side. Way. I am not. Crazy. Even. With. Alzheimer. If. He. Every. Receive. Jesus. He. Still can. Today","commenter_a":"Elvis with his wings bowing his head.","post_message":"Do you see the angel in this ice formation on a porch in Bristol? Audrey Totire sent us this See It, Share It photo after her friends noticed the image of what they say looks like an angel.  What do you think?  See more top photos from the week here ---> @webpagelink"},{"comment_id":"10153447810474575","commenter_b":"Krista, i sure hope your child don't get molested, seems all you Duggar nut huggers have kids.","commenter_a":"Drive into traffic, Palin. Nitwit.","post_message":"Sarah Palin is lashing out against ‘radical liberals in media’ and their portrayal of the family behind the popular TV show “19 Kids in Counting,” after reports of Josh Duggar's sexual misconduct surfaced.  Palin said there was a double standard, stating actress Lena Dunham did not receive the same backlash after she revealed in her book that, as a child, she used ‘anything a sexual predator might do’ to bribe her young sister for kisses and more.   Palin began her rant on Facebook in all caps, writing \"HEY LENA, WHY NOT LAUGH OFF EVERYONE'S SEXUAL \"EXPERIMENTS\" AS YOU HAUGHTILY ENJOY REWARDS FOR YOUR OWN PERVERSION? YOU PEDOPHILE, YOU.”"},{"comment_id":"10154949669541037","commenter_b":"Great, ban it in the entire America now. God didn't create us females to abuse our bodies atall. You could always give up for adoption if it's already done. But prevention is better.","commenter_a":"Here we go....","post_message":"The law bans abortion once a fetal heartbeat can be detected, as early as six weeks after conception."}]
