[{"comment_id":"10153255421196028","commenter_b":"AMERICA IS MY COUNTRY AND I SPEAK ENGLISH!!!!! ENGLISH ONLY IN AMERICA. NOT SPANISH. I have nothing against latinos BUT come here and get legal.. speak English.. STOP HAVING BAMBINOS IN AMERICA SO WE PAY FOR IT.","commenter_a":"@username, I hope one day you decide to go home as well. Maybe to your own country? Thank you.","post_message":"\"I feel hope again.\" Lorenza Cardenas and her two daughters were living in a small storage unit in a San Diego junkyard -- until things finally turned around for the family: @webpagelink"},{"comment_id":"10153464811106028","commenter_b":"@username, yes, jail is vacation. You should go there when you get tired of working. Many of our jails are full of illegal immigrants waiting to be deported or just released back into society. You should really think before you open you mouth Mario. Some people are just plane dumb. To think jail or prison is a vacation. If we sent home the illegal immigrants that are currently in our jail system, we could close 20% of our jails and put that money to better use.","commenter_a":"More people would have been there but it was morning and they were sleeping. It's also not the 1st or 15th so they don't have their free government checks, so no gas to get there. I say deport them, if they are here illegally they need to go. I'm tired of paying tax for them to get a free ride. We don't even take care of our own vets as well as we take care of illegal immigrants. That's a bunch of bull.","post_message":"Immigration policy protests continued throughout the morning in downtown LA, forcing closures at Los Angeles and Main streets. Protesters in a circle at the intersection called for a stop to recent federal deportation raids: @webpagelink"},{"comment_id":"10152505642191770","commenter_b":"She finally bought herself some new boobs?","commenter_a":"People dont realize that both Kim K and Paris are shrewed business women.","post_message":"Remember Paris Hilton? She's back, and she's letting it all hang out."},{"comment_id":"1285542031522022","commenter_b":"A lot of women with four children worked.","commenter_a":"BOOYAH!!!","post_message":"MUST WATCH: Kellyanne Conway PUNCHES BACK After Juan Williams Questioned How She Could Work And Raise 4 Kids: \"I don't play golf and I don't have a mistress\" [VIDEO]  I can't stop cheering for Trump's #1 woman! Just like her boss, the Left is going to quickly discover that she is not one to sit back quietly and be attacked…"},{"comment_id":"10153554692703984","commenter_b":"There's whores in all races, and drug dealers don't going stereotyping with that bullshit!!!","commenter_a":"A American should have right before any one from another country, should speak English and love the American way it's not just Mexican it's all.trying to bring their laws. Sorry America needs to stand up and fight for what's right.","post_message":"Hispanic employees were furious after this employer implemented this new rule, so they decided to sue.  But the employer won't be stopped. He says he has a good reason for doing this and they need to get over it...  Do you support the employer's decision?"},{"comment_id":"1007038892685973","commenter_b":"Liar liar","commenter_a":"@username for President of the United Sates of America, 2016-2024!!","post_message":"Read the texts Hillary sent some friends last night during the GOP debate."},{"comment_id":"10153525959526336","commenter_b":"The mom is a idiot No common sense dumb woman that is it Let lock her up in a hot car and see if she likes it That little girl was soak with sweat even with the windows rolled down a little bit duh","commenter_a":"She took one kid with her and left the other one in the car????","post_message":"Video below shows the moment that officers freed the little girl from the van."}]
