[{"comment_id":"10153399838202411","commenter_b":"\"Do the right thing\", go away for good.","commenter_a":"Don't care for him..Chi raq was a horrible movie and I didn't even see and will never ever see it (just from previews). True Chicagoans will agree with me...Ugh, go away and take Kanye west and his family with u too..","post_message":"Happy Birthday, Spike Lee! The director of \"Chi-Raq\" and \"Do the Right Thing\" turns 59 today."},{"comment_id":"10153678323388908","commenter_b":"Interesting - are Israelis more tightfisted than racis","commenter_a":"Luisa","post_message":"A cafe in Israel has decided to give a 50 percent discount to tables mixing Jewish and Arab diners, in an attempt to ease racial tension..."},{"comment_id":"10153735112473984","commenter_b":"No joke you heathen bitch.","commenter_a":"Let's make an example of liberals and nonChristians by getting rid of them permanently. Bullets are cheap.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"},{"comment_id":"494539450746362","commenter_b":"one ugly woman","commenter_a":"Cruz started this slanderous crap and it backfired on him. But he is still trying to blame Trump for a rags publication. But he's right about one thing, we don't give a shit so he can shut the hell up about it. Trump has already moved on.","post_message":"Carly Fiorina accused Donald Trump of being a serial philanderer. Do you think there's any truth to it?"},{"comment_id":"10158042812305551","commenter_b":"I have trouble with Rhinos who profess to be one thing, but are LYING. I have not trusted John McCain for several years. I am beginning to wonder about Marco. Time will tell. As for Hillary and John Kerry, They are trying to destroy what America stands for and that is FREEDOM. Than there is Eric Holder who along with Obama and Clinton, sold guns to Mexico Mafia. Corruption is what WE THE PEOPLE are sick of.","commenter_a":"Trump is right again. John McCain is no war hero and never has been.","post_message":"Two Senators Have a Problem with Tillerson, but not Hillary Clinton or John Kerry"},{"comment_id":"10155018116889371","commenter_b":"She broke the Law, simple as that","commenter_a":"Wait, did Kelleyanne get a new job? Is she now a spokeswoman for Ivanka? 45 will have to fire her. She can't do two things at once. Especially since at least one would be illegal.","post_message":"This is completely unethical and may even violate federal law. Kellyanne Conway—counselor to the President of the United States—just went on live TV to urge people to \"go buy Ivanka's stuff.”"},{"comment_id":"1126715847370658","commenter_b":"A very excellent metaphor. Kinda bugged that I didn't come up with it myself!","commenter_a":"Ok, lets operate in the realm of hypothetical for a moment. Assume, if you will, the following: 1) There is a civilization capable of inter-solar system travel. 2) They would be bothered enough to interact with a species that cannot manage such travel. 3) We could hope to withstand attack if a species fulfilling [1] and [2] decides that we aren't worth keeping around. It seems to me that such a civilization, if it exists and meets those conditions, would be able to discern the effect of the gravitational field produced by our humble planet. To make it invisible in a visually perceptive sense is naive and utterly useless in the face of such circumstance.","post_message":"Should we be hiding?"}]
