[{"comment_id":"468706906587237","commenter_b":"She is a Dumb Idiot!","commenter_a":"We dont need awoman Preident .that is for immigration ....","post_message":"Carly Fiorina just had these harsh words for Donald Trump. Do you agree or disagree?"},{"comment_id":"10154073514135950","commenter_b":"Are those ACTUAL immigrants or illegal trespassing criminals?","commenter_a":"\"Anyone not willing to accept the results of an election is a danger to democracy.\" ~ Hillary Clinton","post_message":"Immigrants and their advocates take to streets in major cities from coast to coast to voice their dissent."},{"comment_id":"664601907063721","commenter_b":"What a FFFFFFFFFFing Bitch.","commenter_a":"Yes","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"},{"comment_id":"10154090084173690","commenter_b":"That will not happen, they will NEVER dominate Europeans. It would take a better class of people than the rough beasts who are now slouching toward Europe.","commenter_a":"Saudi Arabia and other rich muslim countries take in muslim refugees,,,,muslims have a big plan to dominate europ and later force Sharia laws on them","post_message":"Four Balkans countries have announced a daily cap on how many people can pass through and Austria has restricted entry for hundreds of thousands."},{"comment_id":"10152612105311636","commenter_b":"Stupid women","commenter_a":"Because it causes serious mental health pronlems","post_message":"Remind us why this isn't legal in the UK again?  via Independent US"},{"comment_id":"1100128256666646","commenter_b":"The refugees are not the terrorists. As more information becomes available, the assumption that they are looks more and more ridiculous. Also, the vetting for the small percentage of refugees the US has been willing to accept is much stronger than anything happening in Europe at this time. Shame on our Governor. She is smart enough to know better.","commenter_a":"Governor Baker of MA has stated they're not accepting Syrian refugees. When will we hear this from you, Governor?","post_message":"President Obama has issued a proclamation ordering the lowering of flags on all public buildings and grounds to half-staff immediately and until sunset, Thursday, November 19, in honor of the victims of the terror attacks in Paris.  Governor Maggie Hassan has issued the following statement:  “I continue to join all Granite Staters and all Americans in mourning with and sending our thoughts and prayers to the people of France following these horrific terror attacks. State emergency management officials and the State Police will continue working with national Homeland Security, the FBI and local police departments to exercise extra vigilance and ensure that all necessary security precautions are taken in New Hampshire. As people across the country and the world stand together in support of the French people and one another, these heinous acts of terror will only strengthen our collective resolve to rid the world of violent extremism.”"},{"comment_id":"10153049017301323","commenter_b":"Leave her alone, can't we just all be pleased that Andy is through to the final. There were very tense moments in the match!","commenter_a":"Stone her","post_message":"F is for ferociously supportive, amongst other things.  What was Kim Sears saying to Andy Murray's opponent at the Australian Open?"}]
