[{"comment_id":"1068356466583942","commenter_b":"Chris clown is a pussy ass retard all this motherfucking bitch can do is beat on women","commenter_a":"Asswipe","post_message":"Chris Brown Threatens Trump And The Police: ‘Black People, Go Together 40, 50 Deep’ ⋆ UFP NEWS @webpagelink"},{"comment_id":"1113637395343398","commenter_b":"Bye Bitch!","commenter_a":"Now that is ridiculous! Waste of time and very presumptuous woman.","post_message":"Fox News host Harris Faulkner is furious that a cute hamster toy bears the same name as her -- and she wants $5 million from the company that created it."},{"comment_id":"405363642956925","commenter_b":"Bitches can try","commenter_a":"Come bring that b.s. this way I'm ready","post_message":"The video is titled \"A Message Signed With Blood to the Nation of the Cross.\""},{"comment_id":"10157707332290354","commenter_b":"Deport her ass","commenter_a":"If you vote Hillary you are just inviting scum like this into our country.","post_message":"What did she mean by this?"},{"comment_id":"10153359196206234","commenter_b":"She can leave the house!","commenter_a":"If she can't leave the house,what does she need it for","post_message":"The new Lexus was waiting for Giudice when she returned home from prison earlier this week."},{"comment_id":"10153003248257383","commenter_b":"And boot bitches like you.","commenter_a":"I wonder how many of you bitching about Audie Murphy are going to do something about getting him a day. He did a good job, told a good story, and Texas is proud of him. Get your panties out of a bunch and carry on.","post_message":"There is now an official 'Chris Kyle Day' in Texas."},{"comment_id":"1184927621535157","commenter_b":"Obama is an IDIOT! \"Yeah we have Muslim terrorist in this country so now take all the gun away from all the other CITIZENS!\" NO! IMPEACH THIS IDIOT!","commenter_a":"Now you watch yesterday's massacre was intentional. The went to Syria so guess what Obama you ass hole your climate control and gun control is bullshit. Prayers for the Families.","post_message":"Obama responds to the shooting by tightening gun control laws. This is unbelievable. Is Obama incompetent, or just intentionally trying to ruin America?"}]
