[{"comment_id":"10154949382818010","commenter_b":"Amen Danny. This Ed guy is Obamas gay boyfriend.","commenter_a":"Where do you think they learned that from? Very close ties to the Obama administration, and of course, 'we're with her' too.","post_message":"You're not supposed to say, “I think we broke the law,' even in internal emails, according to the lawsuit."},{"comment_id":"1142484579135691","commenter_b":"It will recover","commenter_a":"Guess what the pound is at a 31 year low at the moment, figure out for yourself what will happen to your economy in about an year, idiots.","post_message":"'And we'll have done it without a single bullet being fired' - Nigel Farage @webpagelink #EURef"},{"comment_id":"10155578231251509","commenter_b":"Leave then illegal.","commenter_a":"If Trump wins I'm leaving the country. If Hillary wins I'm still leaving the country. This isn't a political comment, I just want to travel.","post_message":"Watch Donald J. Trump supporters in Cincinnati, Ohio, react to the candidate's projected win in that state.  Live election results and coverage: @webpagelink"},{"comment_id":"10153533392786337","commenter_b":"You wish you were a woman","commenter_a":"Bruce Jenner has 0 murders. Caitlin has 1","post_message":"MUST SEE MOMENT: Caitlyn Jenner gave a graceful speech while accepting ther Arthur Ashe Courage Award at the ESPY awards..."},{"comment_id":"1865190080165091","commenter_b":"What about the serial killers child molesters child rapists murderers here in the United States we should get rid of all of them as well have them sent somewhere so they can stop all this craziness here and yes there are many Savages right here in the United States","commenter_a":"These people are f--king sick get them out of our Country.","post_message":"Muslim Nurse Mutilates Little Girl’s Genitals, What She Told Her Is Even SICKER"},{"comment_id":"10153414168399024","commenter_b":"it's a big city...Houston may have enough fag votes for that bitch, but Texas does not! The voters of Houston will wake up and dump the fag...","commenter_a":"My question is, how did a liberal get elected in....Texas.","post_message":"Of course, Annise Parker doesn't care what the voters think. Typical liberal. @webpagelink #tcot #ccot"},{"comment_id":"10153188549718812","commenter_b":"Why don't they beat men cuz the guy cant","commenter_a":"Good","post_message":"JUST IN: NASCAR says driver Kurt Busch has been suspended indefinitely: @webpagelink"}]
