[{"comment_id":"10153333221058984","commenter_b":"illegals cant vote and thats a fact","commenter_a":"yes especially with this crap happening in europe w radical muslims id say def close the borders latin americans dont want that crap either","post_message":"If you don't believe immigration is going to be THE issue in 2016, read this. My eyes were opened in a big way.  Do you support securing our borders?"},{"comment_id":"780004342132746","commenter_b":"He said he wants all immigrants to be required to carry an ID with their status, which sounds logical to me and he repeated what others said. \"We know not all muslims are terrorists but it appears all of the terrorists are muslims\". When was the last time you saw a Buddhist terrorist, or a sikh terrorist, or for that matter an atheist terrorist? You just don't. Our biggest threats come from the middle east right now. It was perfectly fine while we were at war with the Japanese to pay extra attention to them. It was perfectly fine during WWII to keep an eye on immigrant Germans. What is the difference now? Why are we going to try and justify keeping our sovereign nation secure. Every other country does it. There is no law that says we have to accept immigrants. We are allowed to pick and choose, just ...","commenter_a":"Well, all was well and good until the part that was speaking of hate speech from the presidential candidate. Well he was obviously speaking of Mr. Trump. Unfortunately he is completely wrong. Mr. Trump used no hate speech at all. The only thing said was that he thinks we should stop the middle eastern refugee immigration until we could confidently vet them. This would be a temporary action. But of course the way the bleeding heart liberal media spins it, is that he want to cut off all immigration. This is another one of those stories that is attempting to drive the narrative and falsely force people to have negative opinions without the facts. The media wants people to believe that Mr. Trump said these awful things because the media hasn't been able to manipulate him and force him to fall into step. The media and the establishment are scared ...","post_message":"It's the little things... ;)"},{"comment_id":"10154057367791600","commenter_b":"Exactlyyyyyyy","commenter_a":"My dogs would be out of there before me","post_message":"The cause of the early-morning fire is under investigation."},{"comment_id":"10154009209659087","commenter_b":"@username if they were legal the kids would be citizens","commenter_a":"I don't know how much credence we can give any of the polls after they caught Reuters \"cooking\" that poll a few weeks ago. It goes without saying the media bias has never been this strong ever.","post_message":"CNN anchor Brianna Keilar is challenged by Donald Trump's lawyer Michael Cohen to identify which polls show his campaign losing. Her response stuns him."},{"comment_id":"1317246778287960","commenter_b":"She'd have been funnier if she'd have swallowed her Mic..","commenter_a":"What the he'll is wrong with these mean girls, this country? You don't do that to ANYONE! Not ANYONE EVER! This show allowed this? We teach our children it's wrong, if it was done in school it's called bullying....my God! She should lose her modeling contract!!! Stop this Madness!","post_message":"Gig Hadid threw some serious shade at Melania Trump tonight..."},{"comment_id":"963644947039340","commenter_b":"But she is dirty","commenter_a":"She knows women's issues best","post_message":"Watch live as Hillary talks to students at New England College in New Hampshire about the issues on their minds."},{"comment_id":"10154512852146350","commenter_b":"@username I'm well aware that her mother is white. Someone should let HER know that","commenter_a":"Alicia Keys is so talented and beautiful. It's really a shame that she's a racist.","post_message":"\"It's about just being who you are and not letting anybody tell you who you should be, Alicia Keys said."}]
