[{"comment_id":"10153266523095927","commenter_b":"Should have BABY MURDERER on the FRONT of that DRESS!!","commenter_a":"DISGUSTING!!","post_message":"Dress is part of a social media campaign that encourages women to share \"POSITIVE STORIES about their abortion experience ...\""},{"comment_id":"10154620951999714","commenter_b":"Phelps and Beyonce can go both choke on razor blades.","commenter_a":"And more","post_message":"Beyoncé, Britney Spears, Rihanna, Michael Phelps and more! #VMAs2016"},{"comment_id":"782624725204041","commenter_b":"SJ Shang dumbshit, the topic is how the allegedly peace-loving Muslims treat their kids. We have enough problems with idiots shooting each other in the US, we don't need more sand monkeys doing the same, whats so hard to understand about that? But you want to digress, fine. Americans desperately want to have dope legalized, to make themselves feel good. 80% of Americans are overweight, because they are lazy, they love to pop and abuse prescription pills and illegal drugs. They don't drink and drive responsibly, insist on texting while driving and play Candy Crush on the job. They refuse to live within their means, balance a checkbook. The last thing they need is one more useless addiction, and yet they whine and yammer about their right to be high .\"Dope fixes everything. If we smoked dope nobody would die from cancer anymore\"","commenter_a":"But we don't want Obama to address white Christian American murderers of children here because he might take our guns. Seems legit.","post_message":"I want a REAL president to step in and take these bastards out once and for all..."},{"comment_id":"749120498611861","commenter_b":"Ghetto trashy bitch.","commenter_a":"TELL ME WHO IS RACIST,,HE WAS A GENTLEMEN..I WOULD HAVE SLAPED HER ASS","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO] Racebaiters will never say anything about this. What would you do in this situation?"},{"comment_id":"1051849191502758","commenter_b":"Dirty lady lol","commenter_a":"I WANT PICTURES !!","post_message":"How do you measure up?"},{"comment_id":"749306348569686","commenter_b":"@username - free cell phones started under Bush administration, food stamps under FDR.. try again.","commenter_a":"He is a real man.Best president with class and a brain. That'swhat make people hate him because he has education . and know how to be humble even when haters come along with silly response. HATERS","post_message":""},{"comment_id":"10153675678941037","commenter_b":"I always thought I was a billionaire on Fridays, but by Monday reality always let me know otherwise.","commenter_a":"Hey John J. Reardon check out this guy disrespecting the Marines !","post_message":"From the upcoming Donald J. Trump biography"}]
