[{"comment_id":"604349323031583","commenter_b":"You're an idiot. It doesn't matter what book you use to swear I could use The Heir to the Empire by Timothy Zhan and that would be acceptable. This is a secular country not a Christian nation if you want to argue that fact look up the 1st ammendment which is the freedom of religion and freedom from religion in addition to separation of church and state. If she wants to use the Quran let her if you want to use the Bible fine if I want to swear on a star wars book damn those corrupt judges I'm going to swear on my Star Wars book","commenter_a":"No. We use the Bible in this country.","post_message":"Should he have allowed her to take her oath on the Koran?"},{"comment_id":"10153802989025927","commenter_b":"If you are here legally you have nothing to fear, stop listening to liberals who pander fear...If you are here illegally than yes, you might wanna vacate before being made to leave...This is not a hard concept, it's quite simple, if you are here illegally leave and immigrate back legally, if you are here legally ...What are you worrying about?","commenter_a":"If these people want to engage in disrespecting this country by burning the American Flag and demonstrating allegiance to another the authorities should round them up and deposit them in that country they love so much. This is getting to be far far too common and needs to be stopped. They can go to these countries they love so much and demonstrate and destroy things there","post_message":"PROFESSOR: am getting many heartfelt notes from students who are in shock over the election returns and , rightly or wrongly for their families ..."},{"comment_id":"10153685449009060","commenter_b":"They do. This, in itself, isn't a problem anymore than relying on other countries to buy your goods is a problem.","commenter_a":"Most of the British public are blissfully unaware of this worrying problem. They still think they live in a \"rich\" country.","post_message":"As warning signs flash across the global economy, Britain is a favoured bolthole for skittish investors. But there’s a flipside to this: the country’s huge current-account deficit. Time to worry?"},{"comment_id":"723294587810406","commenter_b":"Leah sure! Hillary's leaked email referrer's to Mexican's as \"taco bowls\". That says it all right there. Racist as anybody can be.","commenter_a":"Hillary no lo hace un coche de usted . Solo su voto","post_message":"\"Do all the good you can. Measure your life by the positive effect you can have on other people’s lives. Be of service to one another.\" —Tim Kaine"},{"comment_id":"488632654671676","commenter_b":"55555","commenter_a":"Nonthawat Ford Focus @username","post_message":"Watch this T-Rex own ‘American Ninja Warrior.’"},{"comment_id":"1203190183110565","commenter_b":"And Trump will build a wall and call you a rapist!","commenter_a":"It happens every election year, Bill Clinton (2 terms), G.Bush 2 terms, Obama 2 terms they pander for our votre (Hispanic) and once they get into office what do they do for the Hispanics. Bill Clinton had a few token Hispanics in his administration so did George Bush and very few with President Obama. Now Clinton and Sanders are also clamoring for our vote. They will probably get the majority of Hispanics to vote for a Democrat but I have a feeling that once Sanders or Clinton get in it will be more of the same for Hispanics in high governmental positions, Nada or muy poquito!, Trump has alienated about 99.9% of Latinos and every other race and if he gets in who knows what he will try to do with every so called minority group in America. The KKK will administer Homeland Security, the Amereican Nazi Party will administer ...","post_message":"The state so rarely has much say in a presidential race..."},{"comment_id":"10154339117992619","commenter_b":"THERE JOINING ISIS WILL LIBERATE THEM FROM ALL THERE PROBLEMS","commenter_a":"SO YOUR POINT IS ????","post_message":"A transsexual man and his gay female friend, have left to join ISIS, unaware that ISIS publicly executes gay people by throwing them off buildings and stoning them."}]
