[{"comment_id":"10154173951544199","commenter_b":"I agree.....and you know that kind of thing is coming....gender nutral bathrooms.","commenter_a":"I think this is just another poor choice.If I am going to buy a toy for a child its helpful to know where I'm going.If I want one for my grandson or grand daughter it saves me time knowing which section to go to.Kind of like going to grocery shop and trying to find a specific item but every aisle just says \"Groceries\".","post_message":" change is a step towards removing gender limitations in childhood, but when one of the world largest retailers does this, the ripple effect will be significant."},{"comment_id":"10153486672691336","commenter_b":"What do we have in place for allowing Muslims into the United States? I would like ALL OF THEM to be on a watch list. Same with anyone else coming here to settle. Also, what are we going to do with these illegals coming over our borders?? Until you are a United States citizen you should not be receiving benefits!!","commenter_a":"Why aren't race crimes punished on both whites and blacks? I know this question will not make it due to the fear of what will be said but it needs to be asked.","post_message":"What is YOUR one question for the candidates? Fox News and Facebook are teaming up to bring you the first GOP presidential debate. Submit your question in the comments below or click here: @webpagelink to upload a photo or video. It could be featured in the debate August 6th on Fox News Channel!"},{"comment_id":"10154343066022507","commenter_b":"@username But they were to be submissive to white brutes if married to them. And she was married to a white brute. Her lies did not influence either Till's murder or the trial's outcome.","commenter_a":"People are quick to point out how different things were back then for blacks but don't forget how different they were for women, especially in the Deep South. What she did was horrendous, don't get me wrong, but I have no doubt that she feared for her own life. She was married to a man that could commit that kind of a crime. The article said that she was hidden away around the time of the trial with HER HUSBAND'S FAMILY. Don't you think she was threatened by them? I have no doubt of it. Being a women, even a white woman, was only marginally better than being black down there at that time. She will answer to God but, have no doubt, she has had to live with the knowledge of what she's done and had reminders along the way of what that entailed with reminders in her own ...","post_message":"60 years after this poor boy was brutally murdered, she finally admits the truth?"},{"comment_id":"10154341988949203","commenter_b":"Hillary can gfh, I'm writing Bernie in!","commenter_a":"If you are for Clinton then you are for more jobs moving abroad. NAFTA, TPP, etc. It might be your job or your town next that is affected.","post_message":"Hillary Clinton has long pushed to regulate access to guns."},{"comment_id":"10156208561685354","commenter_b":"So is this a rally call to hate blacks or something? I mean, if SHE said it, then EVERYBODY in the black race must feel the same way, right? You extremists only care about the opinions of other extremists. Fuck a race war, fuck a holy war, fuck an unnecessary war.","commenter_a":"There is the face of a true racist.....","post_message":"“Right now we declare, it’s open season on a motherf–king cracker. All you motherf–king crackers y’all need to watch your motherf–king heads.”"},{"comment_id":"1256135284407480","commenter_b":"Er, spider silk has almost nothing to do with a spider's reproductive system, other than if some species use it for mating rituals. So I don't think you can rape a spider. If they were to take off the harmless pins, it would find a corner and immediately start building a web, because it's a spider and it has no conscience. The closest I can relate to this spider is giving blood.","commenter_a":"Wow. That's horrific and pretty fucked up","post_message":"Poor spider!"},{"comment_id":"591608484297524","commenter_b":"smh....","commenter_a":"John","post_message":""}]
