[{"comment_id":"10156049439790725","commenter_b":"because we know how to build stuff that's why..... Why u think Latinos rule the construction industry?? Lol... Really building a wall huh? Who u guys going to get to build the wall?","commenter_a":"What about the fence the Mexicans put up to keep People from Guadamalia out> If it works for them why not for us??","post_message":"For those that don’t think a wall (fence) works, why don’t they suggest taking down the fence around the White House? Foolish people!"},{"comment_id":"1358800054143336","commenter_b":"Are you for real???","commenter_a":"Yes @username, they are so utterly disgusting!! But remember, \"when they go low, we go high!'\". And they're just pissed knowing that Every penny Donald J. Trump has had or will ever have, can't buy him the class, dignity, and humanity of Barack Obama. #FarewellObama","post_message":"But wait -- where was Sasha?"},{"comment_id":"10153382769757411","commenter_b":"I don't know who you've been talking to but it seems to me that America has been supporting the illegal Mexicans for quite a while and we have been paying for it with our tax dollars! So now people are angry because there is no money in our checking accounts because the government is taking it to pay for all the refugees and the illegals that is using our system! We have no country without a border, we have no country if everybody comes in that wants to! without doing it properly! Now is the time to take our country back and get it out of the true terrorist hands, that is in our government and has been for past several years, using the people to their advantage!","commenter_a":"People should protest all of Donald Trump's rallies and stop this man before he gets out of control. America does not need to return to the days of racism and prejudice to be \"great again\". I can't imagine Donald Trump as President of the United States. Everything will be one big reality show for him and he will be the host who gets to fire whoever gets in his way. His supporters are exhibiting the same attitude and acting like they are judge and jury treating protesters as if they should be deemed as Enemy Combatants who do not have rights. Donald Trump has stated that if he becomes President of the United States that he would wage war against Mexico in order to recuperate the cost to build his wall. Racism is his underlying motive. Just like when Hitler waged war against the Jews. His sole ambition to gain ...","post_message":"\"Donald Trump has created a toxic environment. And the toxic environment has allowed his supporters and those who sometimes seek confrontation to come together in violence.\" John Kasich today blasted Donald J. Trump for \"preying on the fears\" of Americans. Both Kasich and Marco Rubio suggested they may not support Trump should he become the GOP nominee. Story: @webpagelink"},{"comment_id":"10156120572270354","commenter_b":"She is a Dumb o crap","commenter_a":"The city of Baltimore has an idiot for a mayor. I wonder if he is a Democrat or a Republican?","post_message":"“This settlement...avoids costly and protracted litigation that would only make it more difficult for our city to heal and potentially cost taxpayers many millions more in damages,” said Baltimore Mayor Stephanie Rawlings-Blake."},{"comment_id":"10153461331093635","commenter_b":"Do you know common law as well as you think you know the Bible? Courts of common law MAKE law. While Congress enacts statutes, the courts write case law. So, let's put to rest the ERROR that courts don't make law. If you don't believe me, find me the statute in your state that defines the elements of slander. The decision in Obergefell doesn't require that you do anything, unless you are a marriage officiant, so I don't see how you can refuse to obey the decision.","commenter_a":"The Supreme Court \"ruling\" is NOT the Law! It's only the insane opinion of 5 corrupt arrogant judges that think they can wield more authority than God Almighty!","post_message":"No Gay Marriage in Alabama, Chief Justice Roy Moore Says"},{"comment_id":"10152682791936167","commenter_b":"The thing that pisses me off is he gets paid for his bullshit!","commenter_a":"That rules him out.","post_message":"How Rush Limbaugh talks about female politicians:"},{"comment_id":"1122159437825214","commenter_b":"Hillary is only qualified for prison , Americans that vote for her are idiots, wake up !!!!","commenter_a":"That is how politicians make their fortunes. Crooked Hillary should not get near the White House. Who knows what she will continue to do; she believes she is untouchable.","post_message":"TREAT PEOPLE WITH DIGNITY? HILLARY TAKES MILLIONS FROM REGIMES THAT BRUTALIZE WOMEN & LGBT RESIDENTS: What Clinton said today, \"If you believe as I do, America values hard work and treats people with dignity and offering everyone the chance to live our dreams and cares for those in need, well, the formula for America's success have always been that we are stronger together.\" Versus Behind closed doors, Hillary Clinton uses State Department access and favors to rake in massive sums of money from some of the most oppressive regimes on planet Earth. “Rarely, If Ever, Has A Potential Commander In Chief Been So Closely Associated With An Organization That Has Solicited Financial Support From Foreign Governments.” “Rarely, if ever, has a potential commander in chief been so closely associated with an organization that has solicited financial support from foreign governments. Clinton formally joined the foundation in 2013 after leaving the ..."}]
