[{"comment_id":"980300718729649","commenter_b":"The 2 trillion plus mentioned was already taxed in the countries their products were sold into! Why is it that our government is the only nation that promotes the idea of US companies paying taxes on products they never sold here? That is pure greed and BS! If our government was really interested in repatriation of those funds they would create a tax environment that encouraged companies to keep their plants and wealth here!","commenter_a":"and the moron we have now is no better and the douch bag is not the answer either","post_message":"We have much bigger problems to worry about. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1202675816432455","commenter_b":"Anyone is better than Killary. I'd rather look at and hear him than her.","commenter_a":"Guess Rush has already forgotten all of Trump's promises to \"cut deals\" with all the Reids and Pelosis out there. The left probably won't have to worry very much.","post_message":"I want you to fast forward to November to Trump winning the presidency in November. I want you to think, using your intelligence guided by experience, what's gonna happen that night? What's gonna happen the next day? What's going to happen every day thereafter? What's gonna happen the day Trump gets inaugurated? What is the left gonna do? They're not gonna just sit idly by and accept this and say, \"Good fight. We gave it everything we had, but we lost.\" They're gonna do everything they can to undermine it. And I think we're gonna see levels of violence that we have not seen."},{"comment_id":"10154072934058352","commenter_b":"Bitch bye u all in mii shit","commenter_a":"But thatz still her bro .....","post_message":"Nicki Minaj posts $100,000 bail for older brother Jelani Maraj after he is charged with raping a 12-year-old"},{"comment_id":"1666312230322556","commenter_b":"what an idiot. she luck to b alive","commenter_a":"@username Whosoever","post_message":"This is why you don't mess with truckers."},{"comment_id":"519430408242325","commenter_b":"What do expect from narcicistic bullies? They steal cheat etc...go figure....most poor folk who steal get arrested..why not trimp chimp rabid rat","commenter_a":"Well it's nice to see how Trumplestiltskin would use Meredith McIver as a scapegoat for that plagiarized speech that dipstick Melanoma Trumplestiltskin gave!! C'mon, surely you can see through the Trumplestiltskins I mean honestly am I the only one!? LOL!!","post_message":"Meredith McIver is listed as a co-author with Donald J. Trump on several of the books he's had his name on spanning more than a decade."},{"comment_id":"10154622879034024","commenter_b":"I think she should sue the college to go back and redo the 4 years and maybe learn something.","commenter_a":"There's no way she could be that dumb and have finished high school.I think we need to have a new law enacted Where our leading officials must have t least a IQ of 117 or above.But Them that would knock out 85-90% of them .","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1874042932818866","commenter_b":"She is the mentally unstable one.","commenter_a":"And you should have left by now. We already elected him!","post_message":"Rosie O'Donnell says Trump is mentally unstable, and we have \"less than 3 weeks to stop him America. Do you think her comments are treasonous?"}]
