[{"comment_id":"1052919424727810","commenter_b":"@username go ride your train off a cliff ya Californicator!","commenter_a":"I think we should ban people who wear socks with sandals next! They look even dumber than people using selfie sticks!","post_message":"Planning on going to the Evergreen State Fair in Monroe this year? Well keep your selfie sticks at home."},{"comment_id":"1168574929824833","commenter_b":"She's extremely wealthy, money buys votes!","commenter_a":"Wait...Hillary is still leading in overall polls? Americans in general really are stupid.","post_message":"I don't care whatever else you think of Donald Trump, but one thing Trump is doing is killing political correctness.  He's wiping it out.  He's leaving political correctness in a trail of dust.  He has violated tenets of political correctness from day one, and he is leading in the Republican polls and has pulled within six points of Hillary in a general."},{"comment_id":"10155024301581600","commenter_b":"Yeah, what's a whinner?","commenter_a":"Proof we have become a nation of whiners.","post_message":"Tens of thousands packed into downtown."},{"comment_id":"1059210544118408","commenter_b":"Ramos is a Mexican so he won't listen to reason. When we lived in Temecula, Ca., our Mexican neighbors next door would go down to the Mexico/San Diego border & pick up illegals & bring them up to live in their garage!!! So I know firsthand what goes on at the border!!!","commenter_a":"Immigrants aren't the root of this country's problem. #scapegoat.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"10155209769476337","commenter_b":"And he destroyed the liberal press...made them look like the fools they are.","commenter_a":"All you hillary sorry pussys get real the Donald is the president deal with it","post_message":"Trump spoke for over an hour, and what an hour it was..."},{"comment_id":"10153744432513984","commenter_b":"Keep hammer at them. Abortion is murder.","commenter_a":"I like Trey Gowdy...good for him.","post_message":"BOOM! Gowdy just laid the smack down on libs and Planned Parenthood with a series of hard-hitting questions that totally undermined the arguments in favor of abortion.  Do you support Trey Gowdy's fight to defund Planned Parenthood?"},{"comment_id":"10152670187577483","commenter_b":"Or two women","commenter_a":"All of you people that back same sex marriage wouldn't even exist on this Earth right now if it wasn't for a man and woman making you like GOD intended for it to be. Just think if all of yalls parents would've been gay yall would have never existed.","post_message":"If you're trying to get married, check out this map before you go to the courthouse. The majority of counties have either suspended the issuance of all marriage licenses or are only accepting applications."}]
