[{"comment_id":"868576086513962","commenter_b":"My mako 10 rounder has never feed a full magazine flawlessly","commenter_a":"I think we shouldn't have to do this, there shouldn't be a magazine restriction","post_message":"What do you think about this?"},{"comment_id":"395052417343306","commenter_b":"We aren't screwed...again, RESEARCH MELLIE! See how much illegal immigrants attribute to the economy, then come back.","commenter_a":"Yay for Texas on this. But too bad Abbott was able to get Obama's immigration reform halted by a federal judge.","post_message":"Did you ever think you'd see this happen? Congrats Texas!!!"},{"comment_id":"907300286012867","commenter_b":"She gives blondes a bad name.","commenter_a":"There's no such thing as liberal intelligence","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153348953162217","commenter_b":"I saw a mother the other day getting into her car with her pjs, slippers and a cup of tea/coffee. I would be so embarrassed to take my kids to school like that.","commenter_a":"It's really difficult to put a top and jeans on. Come on it's 2016 😉","post_message":"'There has been an increasing tendency for parents to escort children while still wearing their pyjamas and, on occasion, even slippers.'"},{"comment_id":"10153490516091337","commenter_b":"You mean unlike theAmerican Killers of babies, rapist, serial killers, the ones signing up to be terrorist! Jake you're a blinded fool!!","commenter_a":"Illegal immigrants are coming in from all over South America , through Mexico, and the Mexican government is doing nothing to prevent it. And if you people watched anything besides cnn and msnbc, you would know that a lot of them, not all, maybe not a majority, but a lot, are killers, rapists, or drug cartel agents, and since crossing our border which is leaking like a sieve have continued those harmful activities in the US. But obviously Trump is a bigot for describing what is really occurring. The fact is he is one of the few candidates who has described a coherent plan for what he would do as president, and been more open to the media by far in the short time since announcing his candidacy than Hillary ever has. I hope he blasts her back into the Stone Age in the general election if he wins the ...","post_message":"'It’s not Mexicans necessarily. They’re coming from all over.'  2016 GOP presidential candidate Donald J. Trump talked about 'killers' and 'rapists' again..."},{"comment_id":"1086229651436699","commenter_b":"I bet the real problem some have is that Black females got into West point, never mind graduate from there.","commenter_a":"When you lower the entrance standards to one of the world's greatest Military Academy, this is what you get...","post_message":"The image has spurred questions about whether the gesture violates military restrictions on political activity."},{"comment_id":"942704895828117","commenter_b":"Wow your a cold heart bitch With a small dick","commenter_a":"A druggie died of an overdose with assistance from his mom and grandmother - unfortunately only he died and not all of them.","post_message":"The teen's mother and her mother face multiple charges."}]
