[{"comment_id":"1042018525819158","commenter_b":"This ladies dumb AF","commenter_a":"It should have been there when it could have helped my husband before he died. It doesn't matter much now whether they develop it or not. It can't help him now.","post_message":"A breath test for lung cancer could be on the horizon."},{"comment_id":"10154306572928812","commenter_b":"Go Peggy... how could anybody vote for her especially women????!","commenter_a":"Hillary has the most experienceand best judgmentof any candidate running for president. Eight years as a team member under her husband Bill. point here is that Hillary Rodham Clinton has been doing this for a long time: seeing the world through a political lens and revealing an uncommon solidity of judgment and perspective. ... just because she has risen higher than any woman in American politics, but because she is by far the most experienced candidate of any of those running in either party this year. In fact, she is one of the most experienced people to ever run for president.","post_message":"As the remaining candidates turn their attention eastward, the style and locations of events are going to look different than they have in the past."},{"comment_id":"1031885216864241","commenter_b":"no kidding wow","commenter_a":"Kerry is a moron!","post_message":"If only he could've predicted their reaction..."},{"comment_id":"1131958793506245","commenter_b":"What did you expect from a trash bitch","commenter_a":"Sad, Sad, Sad. How dare you bring a child into this earth, if you do not plan to put them before yourselves. I imagine this is an ongoing problem and I truly hope that child is taken from them and placed in a loving home. If only I had the space, time, and money. I would rescue all children in a heart beat. :(","post_message":"Police want you to see these viral images of what heroin is doing to families."},{"comment_id":"10152827185410047","commenter_b":"Welfare mothers should not get any money either","commenter_a":"like","post_message":"Planned Parenthood is the leading abortion provider in the United States while continuing to receive millions of dollars in federal government funding each year.   Our tax dollars shouldn't be funding the slaughter of innocent unborn babies. SIGN & SHARE to defend life and defund abortion: @webpagelink"},{"comment_id":"1014316725248091","commenter_b":"Sondra, you sound like someone who doesn't know what she is talking about. For many women PP is the only place where they can get cancer screening. PP provides birth control. How dare you assume that you get to make the health decisions for even a single person. Shame on you.","commenter_a":"Mr. Bera, the real \"consequences\" of ending funding to PP would be an end to PP altogether..they should be brought to justice for their depravity and disregard of the law by selling baby parts-- we taxpayers have been funding them TWICE OVER for years and are sick of their lies are many other reputable womens health centers you know all of this but are afraid to vote your conscience.I'm really ashamed of you..and if you are a pyhsician as you claim, you are not a humanitarian nor a normal human being.","post_message":"As one of the few practicing doctors serving in Congress, I understand the real consequences ending federal funding to Planned Parenthood would have for patients. That’s why I stand with Planned Parenthood and will not vote to defund it. We need to keep politicians out of the exam room and instead work together to make sure women have access to preventive health care → @webpagelink"},{"comment_id":"1194642483887307","commenter_b":"Still need to deal this evil bitch a Blow","commenter_a":"easy defense... animal was not collared, violated leash laws, and was a threat to their own pets and property.","post_message":"She killed the cat because she believed it was a stray and became a nuisance, but a couple who testified in court this week said “Tiger” was their pet."}]
