[{"comment_id":"10154389152146955","commenter_b":"It's just what she does","commenter_a":"Its not like she left 4 people to die in Benghazi, Blamed a terrorist attack on youtube video, deleted 33,000 emails and Lied to congress,, accepted money from terrorist countries, or called millions of Americans Deplorable, this was just a small Lie about her health. At this point, What Difference does it make.","post_message":"FLASHBACK: SCARY COUGHING FIT AT BENGHAZI HEARING..."},{"comment_id":"786188861571691","commenter_b":"That is stupid why can't the welfare people get a job and beside who going to pay for their car insurance and car payment get real","commenter_a":"This is not true.if so think about the timing of it Killary is losing against Donald Trump and she is going to try and bye your votes but we are all to smart for that","post_message":"Congress Approves Bill Offering Free Cars To Welfare Recipients. Your tax dollars hard at work. Does this disgust you?"},{"comment_id":"891542370901815","commenter_b":"Behead the shitbag goat fuckers","commenter_a":"Hehehe","post_message":""},{"comment_id":"10155384146056509","commenter_b":"You have to be a goddess first.","commenter_a":"There are no emojis that look like me either... When will Apple give a goddess as an option","post_message":"She couldn't find an emoji that looked like her, so she took it upon herself to make it happen.  Meet the 15-year-old that brought the hijab emoji into the picture @webpagelink"},{"comment_id":"10154273295026051","commenter_b":"Illegals cant vote genius, doesnt Trumps morin base know 95% of his workers are illegals working on HB2 visas ? He games the laws to get illegals to work for less money because he says he cant find experienced US workers, he thinks Americans are fucking idiots and lazy and Boy did he get that right !!","commenter_a":"Once you take all the illegals out, she will have lost the popular vote too. The electoral college was created for a reason. Should not be changed!","post_message":"Hillary Clinton continues to increase her lead in votes over Trump despite losing the election. Do you think the electoral college should stay?"},{"comment_id":"1073442816041814","commenter_b":"We all get there no matter who you are 4 days coming it will be so funny she doesn't know what she's talking about but you have to look at it he's an ignorant liberal socialist!!!!!!!! When she gets old just let her die!!!!!!!!! She is stuck on stupid!!!!!!!","commenter_a":"You will be old idiot","post_message":"Totally nuts!"},{"comment_id":"10153709063006350","commenter_b":"I can't stand Matt Lauer -- he's too much of a liberal for me.","commenter_a":"Hope not trump !!!","post_message":"\"If I think for some reason it's not going to work, then I go back to my business,\" Donald J. Trump told Matt Lauer about whether he would drop out of the presidential race. \"There's no question about that.\""}]
