[{"comment_id":"1104531886270791","commenter_b":"She's a pussy cat","commenter_a":"@username take your next vaca with Marina","post_message":"Welcome to dog paradise — tons of land to run free and daily visits from human playmates. (via INSIDER)"},{"comment_id":"10153117964021162","commenter_b":"Killer her","commenter_a":"At the very least, SPAY THIS MONSTER!!!!!!","post_message":"DISTURBING: This mother is accused of deliberately making her 9-year-old son sick by putting feces in his IV.  FULL STORY: @webpagelink"},{"comment_id":"1846250902324669","commenter_b":"Don't pay pajama boy any mind! He'll be out of office in 30 days. Thank God! Then a real alpha male will show him how to run a country. Can't wait until the wuss is out of our White House and Trumps takes over.","commenter_a":"\"They don't produce anything that anybody wants to buy\", well, dear Americans, you are using Russian Soyuz space rocket to go into space, cause you just can't anymore.","post_message":"President Obama on Russia: \"They're a smaller country, they're a weaker country, they don't produce anything that anybody wants to buy.\""},{"comment_id":"10154697358601037","commenter_b":"Where's Hitlery?-Oh Yea, Taking ANOTHER Sick Day Because Yesterday She Had 300 Supporters Show Up To One Of Her Rallies While President Trump Was Speaking To 3 THOUSAND Of His Supporters.....#Laughable #HitleryIsToast #RepublicansWinning","commenter_a":"In business you make profits If you don't. Then you not in Business.","post_message":"“Can you imagine Ronald Reagan ... saying, ‘It’s good business to take advantage of people’s misery’? Rooting for that misery?” — Joe Biden on Donald J. Trump"},{"comment_id":"1016134698454262","commenter_b":"She'll just speak to someone else. Challenge her!","commenter_a":"I hate Hopkins as much or more than they do. But this behaviour is just babyish. If you want to defeat her, debate her with facts and the moral superiority of your argument. This is just forfeiting the chair to a racist moron.","post_message":"Brunel students just gave us all a masterclass in how to deal with Hopkins"},{"comment_id":"10153120807760671","commenter_b":"I think it a historical landmark and therefore cannot be torn down and if its not it should be. Even in its dilapidated stated it is still beautiful and the history that building has is a part of everyone who grew up on this area. #SAVETHEHOTELMARYSVILLE!!!","commenter_a":"Make it a church","post_message":"What should happen to this hotel?"},{"comment_id":"10153385478086756","commenter_b":"Real women do what they want to do. Feminism is about equality not which activity you prefer to do.","commenter_a":"real women go outside and play.","post_message":"Maddie found that in many video games, she could unlock the female characters by playing the game and amassing credit, but that could take hours. Or she could buy the character. On average, the female character cost $7.53."}]
