[{"comment_id":"560286244096415","commenter_b":"Conversion to Christianity. Messing with the Germans so the tribes demolished Rome. (Where we get the word vandalism from... The Vandal tribe.","commenter_a":"Hmmm how did greece burn this year...","post_message":"Does this seem familiar to you?"},{"comment_id":"597418893776211","commenter_b":"@username Jill stein is a communist and belongs in jail for vandalizing construction vehicles at standing rock and she's crazy","commenter_a":"Bernie needs to take a young politician under his wing and mentor them so one or two elections down the road the only politician in america with a moral bone in their body isn't pushing 90.","post_message":"Mr. Trump, you told working people you were on their side. You know what? Millions of us are going to demand you keep your promise."},{"comment_id":"10154491672598843","commenter_b":"Nice but ignorant..just because it looks nice doesn't mean it is. Well if we're going to have a March about saving babies, we must teach to save wome and men. Teach women knowlage of self worth not through sex to have standars. Teach men to stick around and train this child up. Their are far to many women who trust in the wrong Ideas about relationships and sex. A comunity of ignorance instead of in the scools teaching to waite and young girls to choose a good partner who is consistent. Also have father's taking responsibility instead of running off and leaving women to fend for themselves. Child support isn't always enforced, if she has no family, if she is in poverty look at where plan pearenthood is located in the getto where the poor is and if you think the CPS system isn't filled up over populated, better look ...","commenter_a":"However, they left behind lots of litter for someone else to clean up. How thoughtful.","post_message":""},{"comment_id":"10152984157398598","commenter_b":"If she didn't want to get pregnant and ruin her career she should have kept her legs closed!! Selfish pos","commenter_a":"All u negative people will never understand...a baby can dampen your career...or just job if u have one...just think that if the mother is single...she will be out of work for six weeks...how do u pay rent..carnote..bills..ect..then when its time to go back to work how are u going to pay for daycare after being out of work..oh not to mention in todays society how many sick perverted people there are in the world and to know u may possibly give ur child up to one of those...SMH. shame on all of u who judge this woman....A REAL woman knows whats best for her and a child...and is certainly no ones place to judge...y dont all u negative people become a social worker and go find the real children who need help from a parent who decided to have them for their own sick pleasure! Thousands of children being born ...","post_message":"She Aborted Her Baby Twice and Both Abortions Failed, So She Aborted Her Baby Again"},{"comment_id":"444065119108702","commenter_b":"Please don't come. You would ruin the peace with your complaining.","commenter_a":"Would never go to Texas! Actually none of these states that are so in love with guns!","post_message":"College campuses need books, not weapons."},{"comment_id":"1901824630047376","commenter_b":"Meant to be","commenter_a":"Catherine her name... :)","post_message":"She’s a Republican college student and she’s proof that marching is about more than politics. #WomensMarch"},{"comment_id":"10153676106271636","commenter_b":"Jaysus.. its 2016 and still people believe this is real... all the people in these prank videos are in on it... are we just going to ignore that? And for the record I have seen tons of videos of girls clipping guys' crotches with paperclips and pouring hot sauce over them in the name of prank .. these videos are cutely dubbed \"bf/gf pranks\" what the hell?","commenter_a":"What a F**CKING idiot...","post_message":"It's been branded misogynistic"}]
