[{"comment_id":"10153117785839440","commenter_b":"close your trap you negative nancy!","commenter_a":"Who cares- nuggets are less than irrelevant.","post_message":"Denver Nuggets selected Emmanuel Mudiay with seventh pick of the NBA Draft @webpagelink"},{"comment_id":"1309577419062434","commenter_b":"Did they have fair trials? Do gays need to be re-educated??","commenter_a":"Leave the man alone in his way Castro was great not a fair leader in terms of his military policy's but he did great things forcuba like healthcare and education!","post_message":"Marco Rubio called it \"embarrassing.\""},{"comment_id":"405687699555825","commenter_b":"They all do it, he was just to stupid and got caught.","commenter_a":"SOP,,,,,since forever!!!! Most all are getting away with it and have since day one!!!!","post_message":"How many politicians are getting away with this every day?"},{"comment_id":"10152767059646519","commenter_b":"She is not a stripper!","commenter_a":"Really? Praising a stripper mom? You lost me today, @username.","post_message":"Go mom!"},{"comment_id":"1273163526055538","commenter_b":"Amen we owe them big time, send illegals back to their oun country , start shooting at the border that will stop them lol","commenter_a":"I have been given the option to use an outside provider when they weren't able to get me in within 30 days.","post_message":""},{"comment_id":"409403839241497","commenter_b":"The tea baggers mistresses have abortions too.","commenter_a":"It's funny how the party of limited govt wants the govt in every OBGYN office in America. Sounds like big govt to me. Teabaggers, why not just attach cameras to every uterus to make sure women are doing what you say at all times? The tea party lunacy and hypocrisy is too much. I don't like abortion but it is legal and what others do is no one else's business. You ass backwards tea baggers seem to forget that your southern women have abortions too.","post_message":"He went too far."},{"comment_id":"10153047823716336","commenter_b":"Out of the mouth of babe!","commenter_a":"Someone's gotta tell her!!","post_message":"\"Dear Mrs. Obama, Thank you for trying to make my school lunch better, but you have ruined Taco Tuesday.\""}]
