[{"comment_id":"896653263722173","commenter_b":"Why is she getting away with this lawless behavior?","commenter_a":"told ya!","post_message":"HILLARY CLINTON HANDS OVER A BLANK SERVER TO THE FBI Slick Grifter..."},{"comment_id":"10152638370431167","commenter_b":"Skinny, blond, white ladies can't be racist.","commenter_a":"What the...","post_message":"Reminder: This person is still on the payroll at ABC."},{"comment_id":"1120997057921304","commenter_b":"In my way to get wine lol!!!!!!","commenter_a":"Bad science!","post_message":""},{"comment_id":"1086347321421796","commenter_b":"Oh my, kicking out the Black Lives Matter people AGAIN during your Atlanta, GA rally. Second time in how many days, Shill? Awww, she loves the Blacks, she sure does, except for when they might just question her. @webpagelink","commenter_a":"I was one of them too! Now I'm a 29 year old man and I'm voting for Hillary!! You had our back and now we have yours!!","post_message":"Eight million kids have healthier lives and brighter futures thanks to the Children’s Health Insurance Program. Connar is one of them."},{"comment_id":"692519350938643","commenter_b":"not even a woman!","commenter_a":"I don't think he should have gotten the award he's not a hero. Give it to someone who has really done something who is a hero. He looks like talks like and walks like a man playing dress up in his mothers clothes","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"10154616109355575","commenter_b":"THEY DON'T NEED A TAX BREAK. JUST TAX THEM COMING IN.","commenter_a":"Do it Donald, show all these NaySayers it can be done, save our Jobs, put America back to work.","post_message":"Trump doing more before he's President than Obama did in 8 years!"},{"comment_id":"10153400314832183","commenter_b":"...and he thinks that threat is going to deter anyone from voting for Bernie. It makes me MORE determined to vote for Bernie. Don't let the door hit you in the ass Bill.","commenter_a":"PLEASE, vote for U.S. Senator Bernie Sanders for president so O'Reilly will go!!","post_message":""}]
