[{"comment_id":"577042442420795","commenter_b":"Lmao and crystal you're vote dosent count dumb ass. Have fun. In the end the government is choosing hillary over the rest of the puppets. This country was never and will never be good. And like I said cunt. He ships jobs out of fucking state. But hey research dosent count when a babbling moron says shit you like does it fucking broad? And you're voting for another greedy old men who has already said we're going back to war. And starting another war with Mexico if they don't pay for his little wall. You're stupid as fuck. Fucking little sheep. No a pig. Eating the shit they tell you. Fuck the media. It's all bull shit. Just like your vote. The world would be better without trump and his little feeble supporters. All so violent. All short of a few brain cells. Lmao you all get dumber and dumber ...","commenter_a":"This really exposes the mass ignorance in this country. The media brainwashed assses will stoop to any level. I remember when nobody hated Trump. Then the government owned media started a smear campaign. Wonder why the media would tell so many lies on one person. He's obviously a threat to the punks running things in this country.","post_message":"Because Donald Trump’s star continues to be vandalized, the Hollywood Historic Trust is considering removing it from the Hollywood Walk of Fame."},{"comment_id":"10153202645506350","commenter_b":"This women should go talk to parents.","commenter_a":"Everyone saying \"she could have dealt with this privately, how embarrassing for the kid\". She never even mentioned his name... She is just addressing him along with all the other boys out there who do this. Something similar happened to me when I was in grade school and instead of having my back, all my friends labeled me as a bitch for not giving this guy a chance. He WAS harassing me but it was seen as \"cute\" because women are taught to appreciate male attention no matter the circumstances. We are taught it is the best thing that could ever happen to us. Just bear in mind that if a teenage daughter willingly comes to her mother for help, during a time when most teens seek distance from their parents, there is clearly a huge problem. This is video that can help a lot of other parents and teens ...","post_message":"This mom has a message for the boy repeatedly being rejected by her 14-year-old daughter: No means no."},{"comment_id":"937892139587360","commenter_b":"OF COURSE democrats WANT illegal aliens to vote. This would give them a VAST majority for all future elections. If this were to happen, the America that we know would cease to exist. ALL American citizens, regardless of party affiliation, must prevent illegals from being allowed to vote.","commenter_a":"What do expect it will help them to continue getting their freebies!!","post_message":"More than half the voters who identified themselves as Democrats in a recent Rasmussen poll said they believe illegals should be allowed to vote. Among all voters, more than one in three believes illegals should be allowed to vote. What do you think? @webpagelink"},{"comment_id":"10153929399138598","commenter_b":"she does NOT belong in prison","commenter_a":"You pig","post_message":"Woman Who Killed Her 25-Week-Old Unborn Baby and Threw Him in Dumpster Appeals Conviction"},{"comment_id":"464367687084172","commenter_b":"Please be specific and truthful. Trump is only against ILLEGAL immigration. Trump is only calling for a temporary hiatus on muslim immigration until we can ensure that terrorists aren't taking advantage of the opportunity to come to America. Otherwise peddle your bs somewhere else.","commenter_a":"And of course Trump said nothing of the sort. Bernie is a liar, plain and simple.","post_message":"Watch Bernie Sanders's explanation for Donald J. Trump's rise. -------- Read more on the third Democratic debate: @webpagelink"},{"comment_id":"753406171459230","commenter_b":"She should be drawn and quartered. That will hush he up.","commenter_a":"Blacks are useless lot of people. over 90% vote democrat and are indoctrinated in marixist doctrine. useless.","post_message":"MSNBC's Melissa Harris-Perry slammed a Latino Republican guest for using the word “hard worker,” because to her, the term “hard worker” only applies to former black slaves.  Here's Mike Rowe's BRILLIANT response. Spread this everywhere!"},{"comment_id":"10153450761424024","commenter_b":"blacks kill more blacks than any other race in this nation...but their little jungle minds don't see that !","commenter_a":"we don't want you because your dragging your diapers all over town. Get rid of the load, then we'll talk Leroy","post_message":""}]
