[{"comment_id":"1420023134696147","commenter_b":"She really believes she has the right to treat that man disrespectfully because she disagrees with his views. What is wrong with people? Great job by the airline.","commenter_a":"Need to see more in many other places.","post_message":"WATCH! Anti-Trump Hag Gets Kicked Off Flight After Threatening TRUMP Supporter...Passengers Clap! [Video]"},{"comment_id":"10158501442080389","commenter_b":"Why is she in our country?","commenter_a":"March away and try not to get run over by a car or truck. Most of us have jobs and families to tend to.","post_message":"Despicable."},{"comment_id":"10152614023801519","commenter_b":"Paula - The money spent by Democrats and Republicans on the Senate election was about equal - Big Corpoarate Money did not win the election for Republicans. The major reason was that 70% of Americans think the country is heading in the wrong direction under six years of the Obama administration. The WSJ Editorial Democrats vs. the Middle Class shows the devastating impact of Obama and Democratic Party progressive policies over the last five years on the middle and lower income class. Progressive Policies buy votes, but destroy prosperity. Anybody with incomes less than $70,000 has been devastated with losses of around 6% to 8% while inflation lowers buying power. @webpagelink","commenter_a":" 12-Step Program for Recovering Democrats is a WSJ Editorial to help Democrats make a recovery from the shock of the last election. Liberals call Republicans names when they have no rational argument to make. @webpagelink","post_message":"Jon Stewart lines 'em up and knocks 'em down..."},{"comment_id":"10153830223561756","commenter_b":"why were they refugees and not called migrants... humm good for the goose good for the gander..","commenter_a":"Thank you for calling them migrants. The \"refugees\" stayed in Turkey, Greece, Lebanon etc. The ones migrating all the way to Germany - some 10 countries' borders away! - are economic migrants who risk their and their poor kids lives to get to the country with the highest GDP and best social services about 2,000 miles away. Hungary has had enough of them coming through, demanding food and services all the while disrespecting Hungarians laws and badmouthing the country. Enough! Go around or go back, Hungary has no interest in catering to this group, the country has enough problems already with unemployment etc. Watch this video, Hungarian cops trying to disperse food and drinks to migrants and refugees: @webpagelink","post_message":"The scene at at least one processing area in southern Hungary is starkly different from recent days. Aid agencies are dismantling huge tents. Cleanup crews rake trash into piles.  Migrants who slept in a cornfield here for days have been bused to the Austrian border. The Hungarian border is now closed."},{"comment_id":"10153255474016509","commenter_b":"Avi Cohen she has money my $45,000 a year is her daily parking fee money","commenter_a":"I need to find her and get her pregnant ... I wonder if she likes chocolate","post_message":"After all that back-and-forth about their billion-dollar divorce, oil tycoon Harold Hamm's ex-wife has finally cashed the check for $975 million. @webpagelink via CNNMoney"},{"comment_id":"10154733856841509","commenter_b":"Hillary is a farce ridding on husbands shirt tails belongs in the kitchen not in the White House. She is a joke","commenter_a":"Trump says He's gonna make america great again but what he is actually doing is just taking all you idiots back in time and starting war and being racist again. He's kicking protestors out of the rally and saying \"All lives matter\" well then why are you kicking them? Trump's supporters are uneducated and racist as he is. Trump shames America's name. I dont really have a right to say all this since i haven't changed my nationality but i had to spit them words out as an American resident.","post_message":"CNN projects Hillary Clinton will win Maryland; Donald J. Trump will win Connecticut, Maryland and Pennsylvania. @webpagelink #SuperTuesday"},{"comment_id":"1073442816041814","commenter_b":"We all get there no matter who you are 4 days coming it will be so funny she doesn't know what she's talking about but you have to look at it he's an ignorant liberal socialist!!!!!!!! When she gets old just let her die!!!!!!!!! She is stuck on stupid!!!!!!!","commenter_a":"You will be old idiot","post_message":"Totally nuts!"}]
