[{"comment_id":"1277154398974272","commenter_b":"How does she keep getting elected ??","commenter_a":"Liberal Ass Clown","post_message":"Remember that time Nancy Pelosi reassured us that Obamacare was going to be 'affordable?'"},{"comment_id":"10153942138341770","commenter_b":"She is disgusting!!","commenter_a":"Now we don't have to look at her on the Voice with that nasty tongue, hope she's packed","post_message":"Don't let the door hit you on the way out!"},{"comment_id":"10153273654150329","commenter_b":"I can't stand feminists.","commenter_a":"Feminist are so fucking annoying.","post_message":"'Meghan Trainor needs to take a women's studies class at the Taylor Swift school for pop stars who can't feminist good.'"},{"comment_id":"1562278293792195","commenter_b":"Hillary for PRISON !!!","commenter_a":"Deplorable in fl","post_message":"Join Chris Jansing at the polls from the key battleground state of Ohio Live! Full coverage all day: @webpagelink"},{"comment_id":"1118891848162172","commenter_b":"YES! And I hope they do throw her in jail!","commenter_a":"WTF!! Put her ass in jail! She is just as guilty, that's premeditated...she knew about the plan and let it happen","post_message":"She reportedly 'tried to talk him out of it,' but that's it."},{"comment_id":"1234949299869862","commenter_b":"Really irritate me how she copies her speech","commenter_a":"Better to repeat the inteligent words of an inteligent woman, than stupid words of a stupid husband! Since an empty head isn't capable of producing words of her own!","post_message":"Listen to Melania Trump's speech last night vs. Michelle Obama's speech in 2008 @webpagelink"},{"comment_id":"540250699432857","commenter_b":"Really? ?? So does that go both ways, women cant be trusted watching kids that arent theirs I? ?? Your blanket statement, is kinda bullshit","commenter_a":"Some people treat their animals better than they treat their children. Why not take the baby with you? Never trust boyfriends with your kids.","post_message":"A woman and her friend wanted to run to the store, so she asked her boyfriend to watch her friend's kids for a little while. The women returned about a half hour later to find the man had done something horrific."}]
