[{"comment_id":"10153912277130329","commenter_b":"We should exile this dumb bitch to Syria!","commenter_a":"I rather vote for Kanye than for trump","post_message":"Kanye West revealed he would be running for president during last night's MTV VMAs."},{"comment_id":"10153436202258855","commenter_b":"No a chick with a dick Courtney Danielle Banks","commenter_a":"That one ugly dude","post_message":"Go get 'em, Vanessa!"},{"comment_id":"10153709556991880","commenter_b":"Mario","commenter_a":"Maggie Urgupluoglu","post_message":"The city's five boroughs are filled with hidden spots."},{"comment_id":"10153986690345329","commenter_b":"Sebastian Franklin my hand on the way to the clippers game on the bus","commenter_a":"@username you","post_message":"You're not alone."},{"comment_id":"10155170466528984","commenter_b":"Hire American instead of illegals","commenter_a":"COWARDICE","post_message":"This just in..."},{"comment_id":"565139210325963","commenter_b":"Just a thought, but doesn't having a system of getting illegal aliens jobs that no on else wants to do sound a little like the Slave-plantations system? After all, employers get poor, uneducated people to do jobs that others won't do. And they can abuse these workers with meager pay and living conditions. They can violate rights without facing consequences. Could be seen as a human rights violation fueled by greed.","commenter_a":"For everyone who thinks Mexican are illegal n don't know their history the white man is an illegal.. We Mexicans always been here","post_message":"Diego Reyna, a Mexican-Canadian, said he placed the Mexican flag atop the nearly completed Trump Tower because he was tired of disparaging remarks made by Donald Trump. \"MR Trump, we did our best work, your tower here in Vancouver is premium quality, and we were a crucial part of it, not just Mexicans but immigrants as a whole,\" he wrote on Facebook. \"The insults you have said about us, have not changed our work ethics.\" Reyna says he hopes his message of \"love and unity\" will reach the Republican presidential candidate."},{"comment_id":"10154440259724060","commenter_b":"Bitch i know everything","commenter_a":"@username stay humble","post_message":"Our quote of the day is from English poet Percy Bysshe Shelley"}]
