[{"comment_id":"10153620766011337","commenter_b":"I would only wish there were black only sororities, but no, whites are free to join and pollute the heritage","commenter_a":"So I'm just asking. On campus at Grambling University pretty sure there are ALL BLACK sorority houses. Why no uproar over that ?;","post_message":"RACIALLY INSENSITIVE? This Alabama sorority video had to be deleted after a diversity backlash.  Watch it and judge for yourself..."},{"comment_id":"10150614186964999","commenter_b":"Amen. However they are supposedly there to educate humans. In some cases it is educating them. Unfortunately not in all.","commenter_a":"Happy would be happier with other elephants. However (if you read the article), her buddy Grumpy was killed by the other two elephants when they charged him. The Bronx Zoo is not bringing in any more elephants and would put Happy at risk with the two they have. She does need to be moved to another zoo. Maybe they all do, but there is no guarantee she will be accepted with other elephants. Sad, but maybe it's time to focus on getting rid of zoo's altogether and leave these animals in their natural habitat where they belong.","post_message":"For close to a decade Happy has lived alone, separated from the zoo’s 2 other elephants. Her solitary existence is quite unlike the life of a wild elephant."},{"comment_id":"10152856815999753","commenter_b":"Lol. A lot of people. A perk of being a sociopath is the ability to manipulate people like butter. She's mentally unstable. The worst they do is put her in a padded room until they believe her meds and treatment are good enough to let her back out in society.","commenter_a":"Smfh.. Good! Let's see who she can manipulate like that behind bars!!! R.I.P.","post_message":"Michelle Carter said all the right things when her friend Conrad committed suicide. She even organized a fundraiser in the teen's name. Then police discovered the texts she had sent him."},{"comment_id":"10153811917026162","commenter_b":"Uhhh no!","commenter_a":"@username @username told me you like spiders!!","post_message":"NIGHTMARE FUEL: A puppy-sized spider with fangs strong enough to punch through bone is discovered in the South American rainforest.  For stories you care about -- \"Like\" ABC 7 Chicago!  PHOTOS: @webpagelink"},{"comment_id":"613032028845756","commenter_b":"Well I can only say if you had to live with Barack Obama as president for 8 years she might see herself that way.","commenter_a":"Else get bitch out of.thire","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"10152823238956130","commenter_b":"Women graduate at a far higher rate than men. From high school and college.","commenter_a":"And no the factors you listed clearly are important, not to discussing what wages should be, but to the discussion of why wages are not equal. Data clearly shows the problem is economic insufficiency, regardless of there being widespread discrimination. So we could make more progress closing the gap by everyone getting a better education (even at the library or online if you know how to source good) building your own successful business, or something innovative.","post_message":"This is what the wage gender page gap looks like."},{"comment_id":"1021077537953055","commenter_b":"Stupid assbag thug asshole !! Stupid is as stupid does !","commenter_a":"yes","post_message":"Chevez Antwann Fiason wasn’t expecting this homeowner to be armed. This is why Americans have the right to bear arms. Can we get 70,000 ‘LIKES’ for the Second Amendment?"}]
