[{"comment_id":"1788072574740832","commenter_b":"jesus Christ those girls look petrified","commenter_a":"@username @username 😱😱","post_message":"Parents in remote parts of Malawi are sending their daughters to be sexually initiated by local men - called \"hyenas\" - when they reach puberty. Meet Eric, he’s proud of his role as a \"hyena\". Learn more from BBC News Magazine: @webpagelink Listen to the documentary: @webpagelink"},{"comment_id":"10154602767897619","commenter_b":"We are with you Isreal, kill the muslim trash and leave them in the desert","commenter_a":"i do pray for Jerusalem !","post_message":"We <3 Israel. -VirtualJerusalem.com"},{"comment_id":"10154253294384486","commenter_b":"Jack, this heartless bitch is worse than an animal","commenter_a":"make no mistake,this is an animal","post_message":"Only 12,000 more signatures needed...."},{"comment_id":"977500405643041","commenter_b":"this picture says it all.their only destination is here.sorry no we have enough.","commenter_a":"oh deer what did they exspect no room left in britain","post_message":"Refugees are sleeping on rocks because France won’t let them in"},{"comment_id":"545673352289911","commenter_b":"Bitch","commenter_a":"Well the bitch is rich and scared of her own shadow... I will never watch a show hers again","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way. What a disgrace. She needs to deported to the Middle East. Do you think Nicole Kidman is a sell out?"},{"comment_id":"10153190279501336","commenter_b":"Haha!","commenter_a":"Oh Lord, they'll hug the bark off the tree over this","post_message":"Fifteen buffalo who escaped an upstate New York farm have been shot and killed."},{"comment_id":"10153302488640329","commenter_b":"You obviously don't know what feminists sound like then.","commenter_a":"\"How dare you show women's breasts you pervert\" - Feminists \"How dare you censor women's breasts you oppressor\" - Feminists.","post_message":"Warning: NSFW due to lots of nipples. (via BuzzFeed News)"}]
