[{"comment_id":"10153553106522411","commenter_b":"Can i pee on you","commenter_a":"It's sad that in this age for a 15 yr old to be out she is automatically labeled! Times change hell its summer break maybe her parents actually trust her. It's sad that people are blind to the fact that the issue is the guns and not enough enforcement this Lil girl will never come back ever! We live in the number one city in homicide many people know this but few are willing to do something","post_message":"UPDATE: Chicago police are still looking for suspects in the shooting death of 15-year-old Veronica Lopez, who was a passenger in a car on Lake Shore Drive early this morning. Police say she's just one of the victims in what's turning out to be a violent Memorial Day weekend. LATEST DETAILS: @webpagelink"},{"comment_id":"10153469277832093","commenter_b":"You know right off the back it wasn't a girl bc the rims aren't scraped from the curb lol","commenter_a":"Jeffrey id say that his parking skills are top notch.","post_message":"File this under the 'smart criminals' tab. @webpagelink"},{"comment_id":"10154622487769342","commenter_b":"Ignorance. Many Americans with family there. Not your brothers/sisters? Or don't they count?","commenter_a":"Fall out from whom? Iran saying Americans aren't welcome there? Darn. Or is it the shrieking protestors? Tiresome.","post_message":"Legal residents and visa-holders were being denied entry Saturday to the U.S. under the Trump action."},{"comment_id":"1180801771932078","commenter_b":"Thugs v thugs - time for trump to go","commenter_a":"This should get Trump even more votes, they are showing their true character!! Violence and Thugs....the Bernie and Hillary supporters, \"Democrats\"!!","post_message":"GRAMMY WINNER URGES BLACK MOBS TO PROVOKE TRUMP VOTERS 'See what they do then. Keep touching us, motherf----r'"},{"comment_id":"10155256275191002","commenter_b":"She's a cunt","commenter_a":"I was there! It was great! So exciting, so much energy, great speakers and it was wonderful to see our future President in person! :) She is marvelous!","post_message":"LIVE: Hillary Clinton is set to speak at a rally in Eastern Market Corporation."},{"comment_id":"10153529907489087","commenter_b":"Anybody is more trustworthy than Hillary","commenter_a":"Bernie is the only one to stand up to corruption, and is honest. Hillary changes her opinion like the wind to appeal to voters, she is bought and sold. Nothing she says is genuine.","post_message":"Bernie Sanders is still seen as the more trustworthy candidate, according to a new poll, with an overwhelming 75 percent of respondents agreeing he is “honest and trustworthy.”"},{"comment_id":"10153352043126756","commenter_b":"Not a chance until the millions of illegal parasites are returned and hospitals offer them nothing.","commenter_a":"America is for real fucked up. You pride yourself on being a democracy yet you tolerate this kind of crap. Why aren't you all in the streets raising hell? No other first world country would allow a system like this.","post_message":"At the end of her life, MaryLou's family owed $100,000 for her medical bills, after insurance. This is how they struggled to manage both the care and the cost of cancer."}]
