[{"comment_id":"10152885727286336","commenter_b":"All women are trained assassins HAH","commenter_a":"If it's true, hopefully he isn't that stupid to actually claim that","post_message":"NASCAR driver Kurt Busch claims his ex-girlfriend, who accused him of assault, is a trained assassin."},{"comment_id":"937487649627809","commenter_b":"NO, NO, NO. Why is there even a question about this. Too many illegals in this country already. Do you want more?????","commenter_a":"Everytime I think I hear the dumbest thing ever, something else trumps it. I cant believe how unpatriotic some folks are now days. America is for Americans. Become an American and then you can vote. No intelegent group would ever let an outsider make a decision for them. It doesent make sense.","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"},{"comment_id":"1393104724052131","commenter_b":"@username - Woman you should stop watching Fox!!","commenter_a":"This is so stupid. History will show that President Obama is one of our best presidents and also one of my most maligned president for no other reason for the color of his skin . He is one of our most educated presidents, he is also one of our most Christian presidents who didn't have to say he was Christian because he's lived it by being a faithful husband a wonderful father and a patient man who has reached across the aisle and had his hand slapped over and over and over again by hateful Republicans who put party before their duty as servants of this country . He without any help from the Republicans have brought us back from financial ruin that was left by the last Republican president given millions healthcare and under his leadership on military has killed those perpetrated 911 and killed hundreds of Isys and ...","post_message":"A Louisiana newspaper sent a very strong message to President Obama today. Do you agree with the paper on this?"},{"comment_id":"10155922805640725","commenter_b":"He will. Ana Smith . you are sick. Nasty mouth.","commenter_a":"Trump 2016 !! Make this country GREAT again!","post_message":"My #GOPDebate Facebook question for the other candidates-"},{"comment_id":"10153953096951336","commenter_b":"So according to your logic @username driving home after having a few beers is equivalent to shooting a gun into a crowd of people? Am I understanding you correct? I bet you still believe Marijuana makes people go crazy.","commenter_a":"People who drink and drive should serve prison time. At least a 1to 5 year minimum . And if they kill or hurt someone while driving drunk they should serve life in prison.","post_message":"\"Social media led us straight to this suspect to stop him before he was able to hurt himself or others,\" the Franklin County Sheriff's office said."},{"comment_id":"10153869953961680","commenter_b":"I'd rather see him on the Supreme Court.","commenter_a":"My dream for \"O\" is that he picks up where MLK left off. That he becomes a source of moral courage and reconciliation and justice for all of us here in America and around the world.","post_message":"President Obama: “He knew better than the cynic that if you look at the arc of history, human beings should be filled not with fear but with hope.\""},{"comment_id":"10153760568196162","commenter_b":"I wish except i don't think my mom would know how to play the lotto lol!!!","commenter_a":"@username your mom won","post_message":"POWERBALL WINNER: Someone in Michigan just won the second largest Powerball jackpot this year. @webpagelink   The winning ticket is worth $310.5 million.  Here are the winning numbers:"}]
