[{"comment_id":"1153444948105615","commenter_b":"To bad she didn't get her way !!! Sick ass bitch !! And fugly as shit too !!! F&skin cry baby !!!","commenter_a":"Are you all that stupid she treats everyone that way she belives you all our not to smart","post_message":"THIS sounds about right. @webpagelink"},{"comment_id":"1685131825099212","commenter_b":"Bitch!","commenter_a":"Bitch","post_message":"Can you describe #Trump with 1 word?  The Free Thought Project.com (y)"},{"comment_id":"753406171459230","commenter_b":"She should be drawn and quartered. That will hush he up.","commenter_a":"Blacks are useless lot of people. over 90% vote democrat and are indoctrinated in marixist doctrine. useless.","post_message":"MSNBC's Melissa Harris-Perry slammed a Latino Republican guest for using the word “hard worker,” because to her, the term “hard worker” only applies to former black slaves.  Here's Mike Rowe's BRILLIANT response. Spread this everywhere!"},{"comment_id":"760149437402889","commenter_b":"She's a fucking looney bitch","commenter_a":"Right wing shrieking is true.","post_message":"Chris Hayes throws down with Americans for Prosperity's Jennifer Stefano over the right’s relentless focus on destroying the health care law. #BestOf2014"},{"comment_id":"10153702004727464","commenter_b":"He is my Prince.","commenter_a":"Conservative....I don't think that word means what you think it means.","post_message":"Act out a scene from The Princess Bride?  As you wish..."},{"comment_id":"10154553793429712","commenter_b":"They work harder, are ambitious, and always have the American Dream end goal in mind to own a business. If there are all these loop holes and advantages that a non-native English speaking LEGAL immigrant can utilize, how the hell can a English speaking American familiar with the system not be able to take advantage? The answer is some do and the others complain. Want a hint? Take a job in a profession like trade work, food, cleaning, retail, etc work there for years to establish yourself financially and become experienced. Take a calculated risk in opening up your business with all your set up in mind, keep working your butt off and you've done it. People say ohhh ILLEGAL not legal immigrants, as if a lot of Trump don't already see anyone darker than Macklemore as an illegal immigrant, terrorist, or possible threat.","commenter_a":"Lazy entitled Trump voters think it's unfair how immigrants do better than them by working smarter and harder and willing to be entrepreneurs.","post_message":"In Baltimore, foreign-born residents make up 9 percent of the city's population but own nearly 21 percent of the city's businesses, according to a 2012 report from the Fiscal Policy Institute."},{"comment_id":"10155495493551509","commenter_b":"I love SNL.Meanwhike Trump should realize his comments about women aint no laughing matter.He's going to lose then divorce Melania then marry a young p*ssy!","commenter_a":"@username SUCKS AND BLOWS..HILLARY PLACED NATIONAL SECURITY OF THIS COUNTRY IN DANGER BECAUSE OF HER EMAILS AND YOU GO AFTER TRUMP BECAUSE OF A TIRED LATE NIGHT COMEDY SHOW..HAVE YOU NO DECENCY SO PETTY SO SMALL @username HAS BECOME","post_message":"\"Donald J. Trump's tweet that Saturday Night Live  needs to be canceled because the show did a 'hit job' on him should concern every American,\" writes Dean Obeidallah for CNN Opinion"}]
