[{"comment_id":"1119954238024715","commenter_b":"I'm for Trump! Politicians are afraid they will not get to keep lining their pockets if we vote OUT the good for nothing's. All they seem to do while in office is keep running for office. Raising taxes. They have good insurance. Do most of the people??They don't care about the American people! Let's get rid of them. Let's break up the good ol boys club!","commenter_a":"Trump Trump Trump! All the way!!!!!","post_message":""},{"comment_id":"10154292587651336","commenter_b":"@username he has submitted the required financial statements","commenter_a":"Running a country isn't the same as running a business. It'd better not be, since Trump has a habit of declaring bankruptcy...and that's not an option for the country. Sure, he's rich. However, he STARTED really rich and would be about as wealthy now or even more so if he didn't go into business at all, based on average stock market gains. @webpagelink/ With his unwillingness to release his tax returns and his inability have to have a serious discussion of policy, beyond 140-character tweets and repetition of: \"tremendous\", \"problems\", \"so many people tell me\", \"better deals\", and \"believe me\", Trump is most certainly NOT qualified for the job.","post_message":"\"I feel Mr. Trump can come and get us better deals. He is a businessman,\" former Kentucky councilman David Abbott said. \"I don't want my children Dave and Erika to grow up in debt all their lives.\""},{"comment_id":"1101493276543118","commenter_b":"More than possible! I always thought this would be the case when he first got put in jail. Been praying for his release and for all those associated with him. Been praying for his family.","commenter_a":"Is it possible that GOD used Saeed to bring the gospel to the prisoners...,GOD works in mysterious way?","post_message":""},{"comment_id":"10154077308573128","commenter_b":"would they let someone come in and do this to the liars Scruz and Ruby!","commenter_a":"When's the next GOP Debate?","post_message":"Republican leaders who had hoped Trump would stumble on Super Tuesday now face tough choices, writes Gerald F. Seib."},{"comment_id":"843332055796851","commenter_b":"CRIMINAL","commenter_a":"LIAR","post_message":"Hillary Clinton doubled down on her assertion that the FBI declared her public remarks on the email scandal “consistent and truthful,” despite independent fact-checkers concluding otherwise. @webpagelink"},{"comment_id":"10154720282189170","commenter_b":"B.S. She's campaigning for Hillary, and fighting for gun control. She's an adult who's inserted herself into the process. Don't want to take the heat? Stay out of the fight.","commenter_a":"She is not a politician. She should be left out of it.","post_message":"Wow.  Five bucks says Chelsea will do everything in her power to dodge this question in the future."},{"comment_id":"437108856413709","commenter_b":"He will CERTAINLY BE BETTER THAN THE MORON IN THE WHITE HOUSE NOW!","commenter_a":"Agree","post_message":"\"I will be the greatest jobs president that God ever created\". Agree or disagree?"}]
