[{"comment_id":"10153531244887377","commenter_b":"If she wanted privacy then don't run hypocrite","commenter_a":"they nef to vote you also a has been","post_message":"Sen. Dianne Feinstein: Criticism against Hillary Clinton is taken out of context and she broke no laws."},{"comment_id":"10153942931813132","commenter_b":"Show this picture to the stupid drunk driver!!! Ask her if it was worth it!!!","commenter_a":"Blessings!!!","post_message":"Unbelievably sad."},{"comment_id":"10153672821839270","commenter_b":"Illegal aliens, syrian refugees, and every other worthless non-american can get all the free stuff at no cost. WE veterans have to pay for what we earned. There is a revolution coming. WE THE PEOPLE have had enough.","commenter_a":"Lier lier lied,,,, sign here and have free health care for life. I'm so glad I have full VA benefits.","post_message":"Some big changes."},{"comment_id":"10153465651246545","commenter_b":"She Have to have police officers to work security. That's a city ordinance. If police don't work the event, her show will get cancelled. I think It will blow over tho and she'll be ok...","commenter_a":"I will say one thing...Police or No Police. The show will go on and will be sold out. So she is winning either way. So for those that are calling her racist. Why would all nationalities join in on the hate monger party and pay for a ticket. IJS","post_message":"The president of the Dallas Police Association said Saturday his group is not calling for a boycott of working security for Beyoncé's May concert at AT&T Stadium. However, he also said he wouldn't be surprised if many Arlington officers chose not to work the event."},{"comment_id":"10153687088042235","commenter_b":"Quit giving him attention...if you quit he will kill himself sooner.","commenter_a":"Georgie got a death wish.","post_message":"Seriously. F this douchebag."},{"comment_id":"10152572021501680","commenter_b":"Jew haters","commenter_a":"This is not the United States of Israel.","post_message":"Israeli officials rushed to meetings on Capitol Hill, trying to calm a furor created by Benjamin Netanyahu’s planned speech. It didn’t work. @webpagelink"},{"comment_id":"710448769145701","commenter_b":"I tell these slouches to pull up there pants.","commenter_a":"Someone told me that came from prison and meant you want to get fucked in the ass ?","post_message":"Two thugs had the pleasure of living in a jail cell for a few days. This is great. Do you think all thugs with sagging pants should be arrested?"}]
