[{"comment_id":"1623707571270874","commenter_b":"I hope she does and goes to prison and becomes somebody's bitch there ..","commenter_a":"They act like no one has do wrong when it came to Republican establishment, get real. I look at it very differently every dog has there day, sooner or later!!!","post_message":"Hillary Clinton has just declared that there's 'not even the remotest chance' that any charges against her will stem from the investigation into her emails, but I am sure MANY Americans are hoping she's wrong..."},{"comment_id":"952878738162068","commenter_b":"Than go home! Are laws not yours","commenter_a":"mix bacon with it .../","post_message":"'The Islamic form of slaughtering animals involves killing through a cut to neck when the animal is still alive. An Islamic prayer is then read as the blood is drained from the body. In the UK animals are legally required to be stunned before their neck is cut, but some Muslim argue this is against their religion.'"},{"comment_id":"10153608463849440","commenter_b":"You are so uneducated, illiterate and pathetic. Worthless. Parasite. A rodent of no worth or accomplishment.Stop #WhiteGenocide 14/88","commenter_a":"Colorado is the epicenter of #WhiteGenocide and the GOP here is allowing it because they're afraid of calling Amy E. Brown and her #Blacklivesmatter5280 terrorist friends out.","post_message":"Editorial: Colorado Republicans made a big mistake in abandoning the 2016 presidential caucus."},{"comment_id":"10154255735864411","commenter_b":"It doesn't hurt to have sense of humour :)","commenter_a":"It's pretty stupid how media outlets are sharing such pathetic content. It's Obviously and clearly not a frikin time traveller. What's even more pathetic, is how the public seem so hooked onto such rubbish.","post_message":"'Time travel is real?'"},{"comment_id":"515532941989754","commenter_b":"She so sickening","commenter_a":"And your high taxes and high minimum wage and Obamacare will put small businesses out of business so just stop. Americans can see through your BS .","post_message":"Hillary went off her rocker today. She is YELLING at voters. Very Bizarre."},{"comment_id":"1230732883614387","commenter_b":"Well, since they found a genetic marker for homosexuality that automatically means that the same genetic marker influenes heterosexuality.","commenter_a":"No specific gene links heterosexual people and the preferred gender of their partners, and I'm fairly certain the same goes for gay people.","post_message":"The science of homosexuality."},{"comment_id":"10154394638207042","commenter_b":"Christianity in mind? But what Christianity type of Christianity was happening through the genocides..? Lol never been to prison or even arrested but thanks for the weak statements 😁","commenter_a":"Crosses don't belong in public spaces much less public institutions. If you truly believe in your faith, symbols and manmade objects shouldn't matter. Actions and kindness to your neighbors should be more than enough of a display.","post_message":"CROSS COVER-UP: After one family's complaint about a cross displayed on a public school in Staten Island, it was covered up. Now, a community is outraged.   Do you think it should have been covered?"}]
