[{"comment_id":"546785352178711","commenter_b":"Hey Cliff f u bitch.","commenter_a":"Hey @username go f yourself.","post_message":"Hillary Clinton wants the Fox News host's head, but she's not backing down.  She is in trouble. Let's show her our support.  Can we get 10,000 'LIKES' for this Fox News Host's stand against Hillary?"},{"comment_id":"537541949759320","commenter_b":"She needs to go","commenter_a":"Love you Judge!","post_message":"“As the world comes crashing down around her - Hillary Clinton in panic mode - displays what kind of president she would be. One who simply can't cope, can't take the pressure and would be a danger to this country.”  Judge Jeanine Pirro slammed Clinton for lashing out at an activist while on the campaign trail earlier this week. @webpagelink"},{"comment_id":"10154736458587300","commenter_b":"Clinton's own faith says she should not be elected. For it is told in the bible, \" For the love of money is the root of all evil; which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows.\" ...and Jesus said to the Money Changers that his house was a house of prayers and they had made it into a den of thieves\" There is no Baptist, Catholic, or any other Christian that should be voting for Hillary Clinton. Next class...Murdering children in the womb!","commenter_a":"Geraldine Donze Berlingeri this is amazing mom!","post_message":"Protons destroy cancer cells while avoiding healthy tissue and minimizing side effects."},{"comment_id":"10152762726845779","commenter_b":"Crystal","commenter_a":"Ash Cooper","post_message":"Nirvana's 'Unplugged' concert is often presented as the band's final show, but they actually played another month of American dates after that MTV taping and then headed over to Europe the following February. The band's last concert ever took place on March 1st, 1994 in Munich, Germany, at Terminal Einz, an airplane hanger that fit 3,050 people. Click through to listen to \"Heart Shaped Box,\" the encore from that show and the last song Kurt Cobain ever played in public."},{"comment_id":"1103463889708572","commenter_b":"@username, it's not a C-Section if the spine is snipped. That's not a C-Section, that's partial birth abortion, aka infanticide.","commenter_a":"Hillary has stated that unborn children have no rights and that they can be aborted within hours of birth. Yet, when someone kills a pregnant woman, there are TWO charges of murder. Hmmmm....","post_message":"Trump said the procedure can happen \"as late as one or two or three or four days prior to birth.\" But that is not at all likely, writes NPR's Jennifer Ludden."},{"comment_id":"10157863685855354","commenter_b":"she will be the death of our country","commenter_a":"She ain't no lady. She's a hydra. Think about it- during the whole day every MSM outlet was focused on a 10 yr old comment while- An arms dealer was not charged because he said he'd tell on POTUS and Clinton Russia had drills for its citizens to go to underground shelters The FBI was caught being more than complicit in helping destroy evidence The internet was given away The UN is coming for our small arms- both thanks to POTUS","post_message":"JUST IN..."},{"comment_id":"855184514566047","commenter_b":"Oh, he wont' do that - she's white.","commenter_a":"I Jeb Bush should set up a public shaming.","post_message":"What are your thoughts about this tweet about Bristol Palin, Sarah's daughter?!"}]
