[{"comment_id":"10153440964853606","commenter_b":"Omg","commenter_a":"prayer for him and were r parents hope parents go to jail","post_message":"A 2-year-old boy is in life-threatening condition after he was found at the bottom of a pool Sunday evening. @webpagelink"},{"comment_id":"10154251884613701","commenter_b":"Oh my wow...this bitch right here is why we need to stop immigration...","commenter_a":"It kills me that LGBT wants special rights when they are going against God's Commandments. It's a fact that the LGBT have mental illness, look it up. America was not built on Gay rights. Also what about people of color we are still fighting for our rights in 2016.God commanded that Marriage should be between a man and, a woman. We are living in the last days. Sodom and Gomorrah. You can't say you believe in God when God condemns homosexuality.","post_message":"The 1969 riots at the Stonewall Inn launched the modern gay rights movement and the annual New York City pride parade."},{"comment_id":"883164491718973","commenter_b":"She is evil & a liar!!!","commenter_a":"She's a bigger liar than her husband and he lied to the Supreme Court and got away with it","post_message":"We must STOP HILLARY!"},{"comment_id":"944507348950462","commenter_b":"this women is a moron!!!","commenter_a":"are you sure her last name isn't Clinton?","post_message":"Furious Germans Send This 20 Ton “GIFT” To German Chancellor Who Demands Muslims Be Let In These people mean business. Spread this absolutely everywhere."},{"comment_id":"10154179770204330","commenter_b":"How did this happen,if the Zoo was secured? Just so happens this is a Black child. Had it been a White child,there wouldn't be no complaints. Hypocrites!","commenter_a":"Accidents happen. They do. However, accountability and fault are determined and responsibility for the loss of this priceless animal (financial) should be taken in a court of law.","post_message":"\"Accidents happen.\" That's the response from the mother of the 4-year-old boy who fell into the gorilla exhibit at the Cincinnati Zoo over the weekend, forcing zoo staff to shoot and kill the gorilla. She says too many people are judging her. Thoughts? @webpagelink"},{"comment_id":"972410229461065","commenter_b":"It doesn't seem to matter, does it?...she's slicker than Willy!","commenter_a":"Oh stop it","post_message":"Arrest her, TODAY!"},{"comment_id":"1047100888663716","commenter_b":"She's an embarrassment to womanhood.","commenter_a":"This woman is always putting her foot in her mouth. She's right up there with Sara Palin.","post_message":"Watch her crash and burn."}]
