[{"comment_id":"10155022606302501","commenter_b":"Why. Dont. U. Suck. His. Cock. Bitch.","commenter_a":"Donald Trump is a psycho and a nut has no business running for president","post_message":"John Kasich will be on the outside looking in for the RNC, but what is he really up to?"},{"comment_id":"10154174167571509","commenter_b":"@username no the little girl thought she was the boss.. the cop showed her she is not","commenter_a":"this is very extreme who taught the school police officer to do this. she did not look like a threat he just had to talk her into complying","post_message":"\"You're either going to come with me, or I'm going to make you.\"  A school district in South Carolina is investigating the actions of a school resource officer after video showed him violently removing a student from her desk."},{"comment_id":"10154241082384170","commenter_b":"@username, I like you a lot, but how is this woman good, when we had sanctions against Iran, she was selling to them like crazy....of course she was trying to save herself and get her numbers up, but just so wrong of her....that's just another one of the many things she did, she couldn't even win the Senate seat in CA...how could she help him win the Presidency? We just all need to stick with the best....TRUMP!","commenter_a":"Uh--oh! I hope he has a portable stage and plenty of microphones. That's her specialty.","post_message":"Smart move, if it pans out."},{"comment_id":"10157919704880354","commenter_b":"Any woman is capable of cheating","commenter_a":"Deplorable in State Of Jefferson!","post_message":"LIVE: Behind-the-Scenes Look of the New Store with Breitbart's Alex Swoyer,  Sonnie Johnson and Charlie Spiering"},{"comment_id":"10154442937338690","commenter_b":"@username sunni Arabs do not deserve a state.","commenter_a":"Since Iraq invasion, the people have only seen bloodshed, division and their oil is stolen. I guess, this is what 'divide and conquer' looks like!","post_message":"More than 200 people were killed in Iraq's capital, Baghdad, in a suicide bombing attack claimed by ISIL"},{"comment_id":"1715965605357218","commenter_b":"Y E S. I D O. ! ! !","commenter_a":"Of course they should","post_message":"Yes, I agree!"},{"comment_id":"1140920095928019","commenter_b":"Mexicans and Americans are the same. they both are sheep","commenter_a":"most latinos want everything handed to them so of course they would vote democrat. duh","post_message":"GOP candidates might not want to overlook Latino voters."}]
