[{"comment_id":"10153519481412377","commenter_b":"She'll just continue to perjure herself if they do and unfortunately with the Obama DOJ behind her, nothing will ever come of it. Miscarriage of justice? You know it.","commenter_a":"This is such bull, it goes on and on and on. If they were going to do something , it would have been done.","post_message":"Agents will probably seek to interview Clinton soon, if they haven't already, former Justice Department officials said."},{"comment_id":"1051374008255409","commenter_b":"Oh please. half a million is chump change to those guys. BUY A CLUE.","commenter_a":"People, We're talking about Goldman Sachs here. Don't think for an instant that they'd shell our half a million with no expected returns on their \"investment\". Besides, hillary said she'll look into releasing those transcripts. so I'll hold my breath until I see them(getting a little lightheaded tho\")","post_message":"Another lie about Hillary Clinton goes down in flames."},{"comment_id":"10153613777506323","commenter_b":"Women shave too.","commenter_a":"Shaving is no fun","post_message":"Periods aren't a luxury. Full stop."},{"comment_id":"10153359647714138","commenter_b":"Get the place shut down, then sue them for everything.","commenter_a":"Oh no!!","post_message":"When the family didn't hear back from Petco after a few hours they called the store and were told to meet the manager at an animal hospital."},{"comment_id":"10154865590730329","commenter_b":"Yey!! 69 for the win!! Lemme eat dat booty too girl!","commenter_a":"All you dick suckers out there are appreciated. Just remember that. Thank you so much.","post_message":"\"Honey, they don't call it a job for nothing.\""},{"comment_id":"1724103797869883","commenter_b":"This black pig needs to be publicly executed by being hung till dead,then tossed in the garbage tho I doubt the land fill will allow the garbage truck to dump their garbage with him in it .","commenter_a":"BLM, baby ! BLM !","post_message":"Media Silent After Black Teen Shoots Newlywed Veteran And Executes His Pregnant Wife. Tragedy strikes again, please pray. What do you think his punishment should be?"},{"comment_id":"1251904504850405","commenter_b":"scum. I hope someone cuts your dick off. Then you can really be a women. Until then stay in your own damn bathroom and leave us women alone. One of these days yours is coming.!!!!!!!!!!!!!!!!","commenter_a":"single occupancy facilities is the only sensible answer. But that ain't good enough for the terminally aggrieved.","post_message":"👏 👏 👏 (via The Huffington Post)"}]
