[{"comment_id":"10154164610665796","commenter_b":"These people aren't here illegally...","commenter_a":"they dont need our help if there illegal except for a plane ride back to were they came from so they can do it the right way","post_message":"The state plans to end its part in the resettlement of refugees, who have fled war or persecution, on March 4.   The full responsibility for resettling refugees and overseeing federal money for refugee services is expected to shift to Catholic Charities Maine."},{"comment_id":"670200283170550","commenter_b":"Yeah,Yeah,Yeah...I keep hearing this on FB but NOT anywhere on any news network....I just HOPE this true and NOT a fantasy!","commenter_a":"The sooner the better!!! Hopefully he will take Biden, Kerry, Pelosi, Killary, Harry Reid, Al and Jesse with him when he goes. Preferably out of the country. Let them go live with the Muslim terrorist that they love so much.","post_message":"Obama's time in the white house could be coming to a screeching halt.  This is the best news of the year. Get rid of him.  Would you be happy if Obama was forced out of office?"},{"comment_id":"1141577959271788","commenter_b":"Then do you forgive slavery?","commenter_a":"I see nothing wrong with it. It is inappropriate to judge a previous generation by the information and ethics of another generation.","post_message":"\"The first thing I thought when I stepped off the train was, 'I don’t belong here.' \"  - Jim Tanimoto, recounting his life spent behind the camp's barbed wire."},{"comment_id":"10153975105390950","commenter_b":"Lock her up for life","commenter_a":"Sounds like she should have found a new career. A long time ago","post_message":"In one incident, the woman hung up on a caller reporting a robbery at a convenience store. The man called back and spoke to a different operator, but by the time police arrived, the store manager was dead."},{"comment_id":"10153802169701519","commenter_b":"Lol that's it. I'm mad women can do something. You got me. Get real","commenter_a":"No it isn't. Feminism is. Hey dummies you realize this whole free love shit means men win right? You don't want to make a man commit, so men sleep with you and then drop you when they want. They don't have to commit or treat you right because they can go find some other chick not interested in holding a man down, fuck her then leave again. Men win you idiots","post_message":"Literally."},{"comment_id":"10153134733596037","commenter_b":"A lot of women where I live buy as much jewelry. I don't think its extraordinary.","commenter_a":"As with Obama, the focus on a first lady is just a witch hunt. Jeb has enough of his own baggage to drag around.","post_message":"#JebBush's wife #ColumbaBush joins a long list of political spouses with a taste for extravagance. Yahoo News' Dylan Stableford reports."},{"comment_id":"10154478152135326","commenter_b":"Lying hyena she worse than she dog","commenter_a":"We all got something to say about Donald Trump, and his supporters and helpers but he still the president and he's still putting our lives in danger.","post_message":""}]
