[{"comment_id":"10152781007061615","commenter_b":"Our veterans go without while lazy a**es and foreigners collect cash, food stamps and free medical. What's wrong with this picture??? VETERANS AND ALL MILITARY SHOULD COME FIRST! They put their lives on the line so the lazy idiots and illegals don't have to. WAKE UP AMERICA AND GET YOUR PRIORITIES STRAIGHT!!! Rant over.","commenter_a":"but it was OK that he put his life on the line for this country give the man what he deserves","post_message":"DENIED. An American hero, unable to collect his military benefits when he needed them most. WPXI Rick Earle gets help for this veteran. His story is coming up tonight at 5:45 p.m."},{"comment_id":"10154088708589087","commenter_b":"Including Melania Trump, she's illegal so vote for Hillary Melania!! LOL!","commenter_a":"the legal immigrants (hispanic and otherwise) should get onboard the Trump train...the illegal immigrants should vote for Hillary.","post_message":"House Hispanic Democrats said Trump is a \"cloud hanging over us\" as they begin celebrating Hispanic Heritage Month."},{"comment_id":"1133405013362371","commenter_b":"She looks that way from years of only having a tiny withered Cheeto to satisfy her","commenter_a":"Why does every picture of Melanie look constipated or disgusted. Her eyes are always squinted, and her lips are always tight. I mean it is not a happy look. This is not a rant because she is female, and it is not a comment on her worth or attractiveness. It is a comment on how people show expression in their face. She doesn't look happy at all.","post_message":"Could you imagine the right-wing reaction if the Obamas did this?"},{"comment_id":"1231862310212247","commenter_b":"We better get building that wall","commenter_a":"This will be interesting. Will President Trump undo what Obama did to lift sanctions and travel restrictions to Cuba?","post_message":"Live Look: Celebrations in Miami over the death of Fidel Castro, and images from Cuba."},{"comment_id":"1369581076434970","commenter_b":"Stay on your meds lady","commenter_a":"If you go and read her fb page you will see this is FALSE reporting.","post_message":"Sinead O'Connor has 'threatened to jump off a bridge'"},{"comment_id":"701702956662495","commenter_b":"She should be locked up","commenter_a":"Rusty Shackelford stand by more to come","post_message":"We wanted Hillary Clinton to know we captured all of her best moments from the past year!"},{"comment_id":"10153173329758984","commenter_b":"Wolves in sheep's clothing.","commenter_a":"Watch Yer back,Sheriff Joe,Yer dealin with Snakes...","post_message":"Look out, Obama. The sheriff's in town. Do you support what Sheriff Joe Arpaio just did to stop Obama's amnesty?"}]
