[{"comment_id":"923310344378873","commenter_b":"What a fucking idiot and a disgrace to the United States. this mother fucker needs to be stopped and now, impeachment is not good enough for the disgrace that he is I am thinking more like a firing squad!!!! Illegal immigrants are illegal hence the name and should not be counted in any vote, voters should have to show I.D. proving who they are and that they are citizens of the USA!!!!!!","commenter_a":"BS!!!!","post_message":"The Obama administration’s insistence that all states must use the same federal voter registration form effectively forbids any state from verifying – or even asking about – the citizenship status of would-be voters. @webpagelink"},{"comment_id":"1179936415364556","commenter_b":"No but it might save a few Americans! Instead of worrying about illegals they need to be worried about their own selves!","commenter_a":"Hows those gated estates working for you and Georgie .","post_message":"Says the British-Lebanese human rights attorney..."},{"comment_id":"10152647068355927","commenter_b":"She can be rich,but doesn't want the rest of us to be","commenter_a":"What's wrong with being rich? We pretty much all strive to be rich but the government does its utmost to prevent you. Good grief Hil.","post_message":"Great question..."},{"comment_id":"10153386310193869","commenter_b":"Not from NYC... but upstate. Older and forgot spelling.","commenter_a":"Concerto for Horne and Hardart (spelling?)","post_message":"Alex Ross listens to both satirical and serious compositions by Peter Schickele, the man behind the comic persona of P.D.Q. Bach."},{"comment_id":"1438922076159420","commenter_b":"Chill your butthurt bitches lol","commenter_a":"Are you kidding me? You people need to get a life!!!","post_message":"Was it inappropriate?"},{"comment_id":"584112685109576","commenter_b":"Nah that was Sanders @username. Hillary will lead us into an even more corporate America with a short economy and allow foreign threats to come in while the middle class die and Hillary and the elite get richer and richer.","commenter_a":"Clinton will lead us into corruption, loss of independence and freedo,... she will lead us into a socialist communist state bowing to russia and north korea. Vote Trump and save our future.","post_message":"If you've ever wondered what Hillary's like as a friend, you could ask Janelle."},{"comment_id":"1157609597663965","commenter_b":"Go Grab your mother's Pussy","commenter_a":"Dumb a$$ people - looking to start a war here on our home land - won't be happy until they do - hope they are truly ready for it - and hope they know what that will really mean.","post_message":"BREAKING: A massive protest of President-Elect Donald Trump is happening in downtown Chicago. It started outside the Trump Tower and is growing @webpagelink"}]
