[{"comment_id":"695324637324781","commenter_b":"Get ISIS and obammy out of AMERICA first. We need to protect ourselves and children. Then we can help ours.","commenter_a":"Wipe them off the face of the earth!!!!!!","post_message":"An innocent American girl was found in the middle of this ISIS debacle. America now truly stands with France against ISIS. Do you think that America should wipe ISIS from the face of this planet?"},{"comment_id":"899588953421066","commenter_b":"Even Satan and the demons in Hell believe God exists. They know He does. Why aren't they in Heaven?","commenter_a":"There Will Never Be An Excuse Big Enough To Convince Our GOD That Killing Innocent Babies Is Okay! :(","post_message":"Do you agree?"},{"comment_id":"10155235641066037","commenter_b":"Very true, so it's OK for them to think they can sneak in because they can't afford to become a citizen? We have plenty of people out of work and those are jobs the unemployed could be working now isn't it. No wonder Trump wants to cut funds to these city's. That opens up more jobs to Americans, because there is a minimum wage in states and you are not suppose to hire illegals.","commenter_a":"Sanctuary city's think the above the law and don't have to enforce the law.","post_message":"\"I don't have a clue,\" said U.S. Homeland Security Secretary John Kelly."},{"comment_id":"10154534822598132","commenter_b":"The only way,she should have stop him is by calling the authorities. She need to go to jail,knonkle head","commenter_a":"She is as guilty as that stupid dude!!! She knows a thing or two she should be charged!!!!","post_message":"The second wife of #Orlando killer Omar Mateen has reportedly said she pleaded with him not to do anything violent."},{"comment_id":"1673100576267383","commenter_b":"Happy Birthday Goldie, what a delight you have been over the years!","commenter_a":"Yep, gotta love our girrrrrl....","post_message":"Happy birthday, Goldie Hawn!"},{"comment_id":"966993893421492","commenter_b":"Republicans and Democrats been divided .. how did he divide us.. two different view points","commenter_a":"Can't wait for Obama to get out of there so things can go back to normal once Trumps in there to clean up the mess!","post_message":"UPDATE: The White House lockdown has been lifted. Secret Service agent shot an armed suspect outside the White House compound after he refused to drop his weapon.  Breaking News: The White House is on lockdown after reports of a shooting nearby. Secret Service members and police officers are getting people off of the White House North Lawn. @webpagelink"},{"comment_id":"1281382285238371","commenter_b":"Well said. If this Jolie live in Muslim country like we do ,then her opinion about Islam will radically change. She should know the Muslim will never compromise with others..stupid","commenter_a":"I don't listen to rich new world order liberal fucking wackos. If the come out and try to tell us all to do something. Its never ever good. This Bitch is rich living in nice safe places. Safe from the hell the rest of us would have to deal with","post_message":"DOES ANYONE CARE WHAT THIS LOSER HAS TO SAY?"}]
