[{"comment_id":"10154240769776438","commenter_b":"@username No. You're being dishonest. The \"second amendment solution\" is to use the guns to kill people, and he was talking about his followers killing Secretary Clinton, and he was talking about his followers killing the judges she will appoint as President. You can try to say that he didn't actually think they would follow his advice, but you can't say that isn't what the words mean.","commenter_a":"Hmm I wonder if he's talking about the NRA? Taking things out of context, as usual","post_message":"\"Nothing you can do folk—although, the Second Amendment people, maybe there is, I don't know.”"},{"comment_id":"839189072876028","commenter_b":"Women 4 Trump","commenter_a":"@username is the smartest, strongest, most beautiful woman in America, and she will be our next president. #ImWithHer #SheGotOurBack #WeGotHerBack #HillaryAllTheWay","post_message":"Trump’s attacks on women’s health are inexcusable—and the rest of the Republican candidates are just as bad. hrc.io/1St92h4"},{"comment_id":"599536596905185","commenter_b":"I want them to be deported and go back where they came from.","commenter_a":"I am absolutely shocked that a welfare state would attract welfare-minded reprobates who expect to receive cradle-to-grave welfare benefits, and then throw violent temper tantrums when they don't get what they think they're entitled to! Where in the world did these guys get such an idea? Oh yeah, after hearing the Marxist's constant demands for cradle-to-grave welfare benefits all of their lives.","post_message":"New post (Sweden: Muslim migrants enraged over not being given \"own house\") has been published on Jihad Watch"},{"comment_id":"10153350644952212","commenter_b":"Bet it was you","commenter_a":"JhonnySSodas what you finess","post_message":"An Oklahoma City Whataburger was robbed at gunpoint early Monday morning #News9"},{"comment_id":"10153266860506167","commenter_b":"No, there is something very seriously wrong with the people who think he could run the country and vote for him","commenter_a":"There is something seriously wrong with Carson.","post_message":"A CNN host shuts down Ben Carson's complaints about the media: \"Journalists ask questions. That's the process. And if you don't like journalism, we should talk about that with presidential candidates.\""},{"comment_id":"1039445359429269","commenter_b":"Ewe, she looks drugged. GHB, JEB.","commenter_a":"I hate that... its like telling you , your my pet.I be your master.","post_message":"At least the younger Bush is a little more smooth with his moves."},{"comment_id":"951876701600434","commenter_b":"Send her AND O'dummy to Gitmo!!!","commenter_a":"Hillary has character and integrity? How easy it is to forget all the criminal activity this woman has engaged in. She's nothing but a liar, cheat and disgrace to this country. She belongs somewhere alright it's called prison.","post_message":"BREAKING NEWS: AP projects Hillary Clinton as the winner of the Arizona Democratic Primary."}]
