[{"comment_id":"1056873814372366","commenter_b":"Rightly so with people like you ..muslim countries would be crazy to let you in","commenter_a":"No churches can be build in Muslim countries, why should mosques be in Britain .Woman got 200 lashes for just reading a bible in Sadia Arabia just last week.","post_message":"The largest Mosque in western Europe is engulfed in flames"},{"comment_id":"1769093619989896","commenter_b":"Send them all back across the border, they'll never get away with this crap in Mexico, they'll shot them there","commenter_a":"'America was never great.' Then why the fuck are you here?","post_message":"Blood flows in San Jose, California as Mexican flag-waving anti-Trump radicals attack Trump supporters, rip up American flag, chant 'Mexican Power!'...'America was NEVER great!' PHOTOS...VIDEO..."},{"comment_id":"10153335788334714","commenter_b":"Still a bitchh","commenter_a":"They named it the failed 'parenting' tree in honor of welfare checks, EBT cards, and Section 8 vouchers.","post_message":"The trees were chopped off at the trunk"},{"comment_id":"914001441995307","commenter_b":"Awsome woman!","commenter_a":"Barry Sheldon this was what I was talking about earlier","post_message":"BREAKING VIDEO: Mother Beats Her Son When She See Him Rioting in Baltimore  Mother of the Year Award? She goes straight hood on her son.   @webpagelink"},{"comment_id":"748124945338392","commenter_b":"Ima start fukin new bitches","commenter_a":"Kisses from Mar del Plata!","post_message":"We're less than 5 days away!"},{"comment_id":"366282870162354","commenter_b":"Shot in head","commenter_a":"Death","post_message":"89 Year Old WWII Veteran Beaten To Death By Thugs. This is tragic. Please send your prayers. What do you think their punishment should be?"},{"comment_id":"1725539231054043","commenter_b":"Big wall!!","commenter_a":"I read the interview with Kirsten. It was great and it does reveal a side of Donald Trump that we don't see at rallies. Very nice!!! Trump 2016!!!","post_message":"A very interesting piece, by a very good writer, Kirsten Powers."}]
