[{"comment_id":"1393712353985142","commenter_b":"Someone send this to Senator Warren...but use small words so she MAY understand it!","commenter_a":"No one cares !!!!!","post_message":"Wow! Coretta Scott King gives a thank you to Sen. Jeff Sessions at the opening of the Rosa Parks library."},{"comment_id":"10156450025520551","commenter_b":"She is as dangerous as Hillary","commenter_a":"both---jail time","post_message":"Issa: FBI director would like to indict Clinton and Abedin [VIDEO]"},{"comment_id":"868659363156855","commenter_b":"You have never been raped!","commenter_a":"The allegations are a joke.","post_message":"Too much?  #GoldenGlobes"},{"comment_id":"10153542250533812","commenter_b":"Chriss if you lease a car. Can anybody come in that vehicle and disrespect you. Chriss you happened to get a job that you get assigned a vehicle can anybody come tell you what and how. You're a smart man. You might get a job that requires you to move out of the state or even the country. That job comes with all expenses paid for four years including the house and the car. You tell me who can come in there and disrespect you. Not even the ceo or cfo of that company can do that without proper protocol. You had to move your family. And your doing your best job. Think about that chriss. YOUR A SMART INTELLIGENT MAN","commenter_a":"Pres. Obama. It is America's house we only let you borrow it for a little bit! Respect all people as you desire to be respected. You are in my house and every legal Americans house. Not that they were right but you are wrong!","post_message":"WATCH: Pres. Obama normally lets hecklers speak, but this time, he put his foot down: 'OK, you know what? No, no, no...'"},{"comment_id":"1843613252518265","commenter_b":"Squirting and peeing may release the same fluids but the acts are totally different. You would know if you've ever made a woman squirt...","commenter_a":"Think the only people who care are the women who can't squirt and the guys who can't make women squirt","post_message":"Happy Valentine's Day!"},{"comment_id":"10155999999550389","commenter_b":"The Donald's only plan, make the Mexicans build the wall","commenter_a":"smart and beautiful","post_message":"Tonight on “Hannity,” Ann Coulter said she understands why Donald J. Trump wouldn’t vow to support the GOP nominee because none of the other candidates have a clear plan to deal with illegal immigration."},{"comment_id":"1713481288905957","commenter_b":"'@username...does that include the Canadian illegals that are here?","commenter_a":"But trump supporters are racist!! The only racist people I see are the one rioting at trump rallies!! You don't see that type of behavior at Hillary or Bernie rallies","post_message":"Protesters attacked Donald J. Trump supporters on the sidelines of a San Jose rally Thursday, in a raucous scene where a dozen or more people were punched and at least one woman was pelted with an egg."}]
