[{"comment_id":"10153634923619885","commenter_b":"Nah she's a girl, but keep on denying. Y'all have a lovely day.","commenter_a":"That brat holding up that sign probably wouldn't want this person using their locker room either. So it's go with the ladies where you are not welcome, or go with the boys who will treat you like garbage. This is stupid. Leave this young person alone and let her get an education.","post_message":"Students at Hillsboro High School briefly walked out in protest Monday morning as part of a dispute over whether a transgender student should be able to use gender-specific locker rooms."},{"comment_id":"689502327907012","commenter_b":"Such an amazing message.","commenter_a":"Amen..and yay for them for standing their ground! I love them,and the show.","post_message":"Obama didn't want them not to talk about Christianity on TV, so they did this instead. In America we have freedom of speech. Let's show them our support. Can we get 175,000 'LIKES' because they refused to censor their faith?"},{"comment_id":"906397572824353","commenter_b":"Wow!! She's got u brainwashed!","commenter_a":"Dear Mrs.Hilary, Sweetness in your speech , talent in your mind, Peace in your eyes, strength in your hands & I wish always victory in your life..Pl accept my heartiest congrats & do your best to bring peace & harmony to the whole world. I am from Sri Lanka & once again pl accept my best wishes for you madam...go ahead go ahead & do your best not only for America but to the whole world madam..May the blessings of the triple gem be always upon you..tc, Gd luck","post_message":"Hillary Clinton supporter screams \"Not your fault\" after candidate says she \"deeply\" regrets the \"angry tone\" of the campaign. @webpagelink"},{"comment_id":"10153753103761037","commenter_b":"@username tell me that in 12 months... no Bernie, no Trump, no Clinton and no JEB... then who's left? Let's talk again when there's only days left of this nonsense.","commenter_a":"Jim Webb won this debate: he got more exposure out of the media tonight than he has had since he began his candidacy. Compared to Clinton he looks honorable, compared to Sanders he looks responsible. Since those two are the media darlings, those are the only two he needs to be compared to until he can get out of single digit polls. If any of those candidates expect to get moderate Independent and Republican voters next fall, they need Webb on the ticket… unless Trump manages to stay in the race.","post_message":"Bernie Sanders defends his record on guns after Hillary Clinton pounces. #DemDebate"},{"comment_id":"10154628102671800","commenter_b":"@username You're saying bullying didn't work in 3rd grade so it won't work now, but most of Trump's campaign IS based on bullying and it's gotten him pretty far. And Trump has had multiple scandals of his own, including email scandals. It's also a known fact that every politician in history has had some sort of scandal in the course of their career.","commenter_a":"And according to James comey if you do what Hillary Clinton did you would be reprimanded, probably fired and have your clearance pulled if not have criminal charges like in the military, but you can still run for president. Oh the hypocrisy. Say bad things, shouldn't be able to be president, compromise national security and the lives of Americans, no problem.","post_message":"Billy Bush was suspended indefinitely from NBC following the leaked Trump tapes.  ►Full video: @webpagelink"},{"comment_id":"10153754425932431","commenter_b":"Americans are so evil they kill 99% of us and steal our land and then when we stand up to them, they say hey you better kiss our ass or we won't help you","commenter_a":"If americans want their pipeline then just put it on their land over their water not ours, They should have to pay the price for their greed not us, I am tired of americans living good lives off our suffering.","post_message":"Video: 7 Arrested After Pipeline Protesters 'Invade'  Enbridge's Duluth Offices  bit.ly/1Ms7Sjy"},{"comment_id":"10153646612799071","commenter_b":"Thank you my sweet. Lucky dog!","commenter_a":"@username here is the video I was talking about 🐶","post_message":"Rumbo Mediterráneo quit his job to kayak the sea with his dog."}]
