[{"comment_id":"575161529335569","commenter_b":"That sick women will never be fine ! Who you kidding !","commenter_a":"Why is this such a big deal? After some rest, and antibiotics she will be fine.","post_message":"Is Hillary Clinton just run down, or is it more serious?"},{"comment_id":"10153576489935667","commenter_b":"Their aliens","commenter_a":"I wonder what it looks like now","post_message":"Experts have yet to identify their breed but guess they could have a bit of wild cat in their DNA."},{"comment_id":"10158027884060354","commenter_b":"I'm proud I didn't vote for Trump who is a racist, woman groping sleaze and fails to pay a hard working startup business owner caterer because he told her she would get more business when people hear she catered his wedding and had to pay her employees out of her pocket. And believes because he is rich he has the right to treat women as he pleases. You can vote for him not me. My husband thinks he's NUTS!","commenter_a":"He's still under numerous criminal and civil investigations, whether they are by the FBI or not. Numerous court dates, numerous lawsuits, etc, etc.","post_message":""},{"comment_id":"10153202984559726","commenter_b":"California can have all the nation's illegal aliens! Start shipping them over right now. California sucks donkey balls.","commenter_a":"Give them all the water they can drink!","post_message":"California proposes $1.2 billion MORE in benefits to illegal immigrants--including healthcare & Office of \"New Americans.\""},{"comment_id":"1584761528498475","commenter_b":"Women should have the right to decide, but whomever is willing to oblige her and perform the abortion should be arrested and thrown in prison for being willing to be an accomplice to a murder. If it were illegal for doctors to perform abortions then she can decide all she wants. Decide away!","commenter_a":"Nicholas Moore","post_message":"If you think Trump has bad ideas - Gov. Mike Pence has actually taken women's rights away. These two make up one of the most anti-woman tickets in history!"},{"comment_id":"1260466927330937","commenter_b":"@username agreed! She's a fecking CRIMINAL... PERIOD!","commenter_a":"Watergate would be jaywalking compared to the Clinton scandals","post_message":"Rudy Giuliani claims the Clinton Foundation scandal will be \"bigger than Watergate.\" Do you think there is truth to what he is saying?"},{"comment_id":"10152732275938645","commenter_b":"fat a** hoe.","commenter_a":"Report me all you want trick","post_message":"The victim said the attacker threatened her during the rape, saying he knew where she lived and would return to kill her if she called the police."}]
