[{"comment_id":"10156346724510725","commenter_b":"YOU ARE THE ANTI-CHRIST!!! SHAAAAAA lucifer!!!","commenter_a":"Thank you.","post_message":"THANK YOU for your support this evening Myrtle Beach, South Carolina! My family and I had a fabulous time with you this evening. Together we will #MakeAmericaGreatAgain!"},{"comment_id":"704776766379568","commenter_b":"Yes deport them","commenter_a":"Only if it's to hell. I would never let her lose on another","post_message":"Controversial photo of Michelle Obama has many calling for deportation.  She doesn't deserve to be our First lady.  Would you vote to have Michelle Obama deported?"},{"comment_id":"10154282422068128","commenter_b":"\"So Veli, I saw an article about you in the WSJ today...\" Haha, but my only interactions with him were over email, so as far as I know...","commenter_a":"@username veli?","post_message":"“Just when I wanted to nominate Jill Watson as an outstanding TA,\" it turned out she was computer."},{"comment_id":"10155146081185725","commenter_b":"I would never allow a nun within a telephone poles reach of me! Hahahah","commenter_a":"At least the club is consenting adults! Not a priest on scared little boy! Protest that instead you concrete vagina bitches!","post_message":"A group of suburban nuns is suing a neighboring strip club for the second time. What their complaint is this time --> @webpagelink"},{"comment_id":"1731115690475220","commenter_b":"She should just go NOW!!!","commenter_a":"Another nut.","post_message":"Barbara Streissand says she's joining Al Sharpton and leaving the country if Donald Trump becomes president. Would you miss them?"},{"comment_id":"10153260495114087","commenter_b":"She should run to prison!","commenter_a":"100 percent right","post_message":"\"I can tell you this, if that were a Republican that did what she did with the emails, they would have been in jail 12 months ago,\" Donald J. Trump said."},{"comment_id":"1412960289011405","commenter_b":"THE CORRUPT NAZICRATS ARE THE ONES THAT WILL BE DEFEATED!!!!!","commenter_a":"That's what you think American people got news for you","post_message":"Thanks Liz, this should increase membership..."}]
