[{"comment_id":"10153604514287293","commenter_b":"'@username Deport the illegal immigrants in Palestine, back to Minsk, Krakov, Vilnius and Brooklyn, where they were BORN.","commenter_a":"Stop all to the Israeli Colony.","post_message":"“Even the United States doesn’t have anything as complex, as sophisticated.”"},{"comment_id":"10153919933534342","commenter_b":"ABC 13 Houston could you please explain what 'stunning' about a kid riding a bike?","commenter_a":"At least its a 2 stroke bike","post_message":"Stunning video captured the moment a teen rode a dirt bike through a HS campus.  For the FULL story --> @webpagelink"},{"comment_id":"10153982553531955","commenter_b":"Fire her!","commenter_a":"Where is this? Chicago..oh yeah..that crime riddled LIBERAL MESS..that place where there are 100's of black on black murders each week..that place where black lives matter the LEAST...that place where this ignorant fool of a so called teacher is. SAD AND IGNORANT.","post_message":"Public School Teacher Preaches 'Fuck The Police'"},{"comment_id":"10153521258341990","commenter_b":"Stfu","commenter_a":"Respect to this guy! :D","post_message":"#Update: Police say a man who was arrested for weapons and explosive materials wanted to harm today's LA's Pride Festival. @webpagelink"},{"comment_id":"1482796298404171","commenter_b":"'@username that's such a nice thing to say","commenter_a":"As an Asian non-American, I have a lot of similar feelings with people from the video. However, one thing I do not share is the that even I am not American, not born here, you still don't get to say 'go back to China' to me. I go where I want and I came here legally. America could be more friendly.","post_message":"An editor for The New York Times wrote an open letter to a woman who told him to 'go back to China.' Asian-Americans responded by sharing their own racist moments using #thisis2016. Here are some of those moments.  Warning: This video includes racial slurs and vulgarities."},{"comment_id":"10154014383211636","commenter_b":"hmmmmmmmmmmmmmmmmmmm, she needs to be hanged.","commenter_a":"good! even the uk police can be corrupted.","post_message":"She was shot in the stomach, but not by the man she claimed"},{"comment_id":"10154179510106409","commenter_b":"Lmao. Now she can STFU.","commenter_a":"Lol. Yes!!! I saw this coming and I'm loving it. Fall of the bully. Does she still want to fight Mayweather? Dwl","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
