[{"comment_id":"10154225245793483","commenter_b":"Wtf is wrong with this woman. She needs to be arrested for abuse. I take care of elderly people and this is despicable!!","commenter_a":"That's disgusting. Has she been arrested?","post_message":"A 94-year-old woman was supposed to be taken care of by a home health care provider. But she was screamed at and even hit by the woman.  'I told you stop feeding that dog human food,' the worker screamed at the 94-year-old woman. FOUL LANGUAGE WARNING FULL STORY --> @webpagelink"},{"comment_id":"10153147861257060","commenter_b":"That's her dumb ass then.","commenter_a":"She fell for the Kenyan Prince trick, lol","post_message":"A Metairie woman was duped into sending more than $195,000 to man she knew only through Facebook, according to the Jefferson Parish Sheriff's Office."},{"comment_id":"1035959943168617","commenter_b":"'@username Trumper Humpers have elected her through their ignorance.","commenter_a":"We will never forget scum like u Vote TRUMP","post_message":"Did Obamacare deliver lower premiums & more choices? No. Our office has done the research. Read our full report here: @webpagelink"},{"comment_id":"10154097450244641","commenter_b":"She legally can't give consent if she was drunk so it would still be considered rape......","commenter_a":"'The alleged perpetrator initially told police that the sex act was consensual, but the girl told them that she had no memory of it'. She is suing although she doesn't know if she consented. I wouldn't be surprised if she had consented when she was drunk. This isn't your average 'She was raped. Case closed' case. She shouldn't drink like an animal and have sex like one and then sue someone...If you can't handle yourself when you drink, you shouldn't drink! At 16 it is illegal to drink alcohol, so she should be charged as well for her own offense.","post_message":"The court dismissed the charge because unconsciousness and intoxication are not mentioned in the state's forcible sodomy law."},{"comment_id":"1378443058862829","commenter_b":"SHES WAVING TO THE CROWD YOU ASSHOLES..","commenter_a":"Conservatives suck","post_message":"Wait till you see what she appears to be saluting."},{"comment_id":"883919521667797","commenter_b":"newsflash, genius. there's a bunch of dumb females already in ISIS.","commenter_a":"no female should be deployed where isis are, you are just asking for trouble.","post_message":"Kayla Jean Mueller, 26, traveled the globe fighting genocide, AIDS and domestic abuse."},{"comment_id":"10152633154612452","commenter_b":"You do know I meant loving","commenter_a":"'@username living all the comments. Brian Williams lol","post_message":"DRAMATIC PHOTOS: Two police officers were able to save a woman trapped in a sinking BMW after smashing the vehicle's rear windshield. @webpagelink"}]
