[{"comment_id":"474511766072737","commenter_b":"Can't do that until you remove the Muslim president who encourages them to take over.","commenter_a":"we need to take our Country back. We outnumber them let stop the insanity. Dont let any mosks be built in this country. We cant build Churches in theirs. If they dont like it here than leave. No one would care.","post_message":"Muslims force this school to ban Christian holidays. America is under attack, this is treasonous. 'LIKE' if banning Easter is WRONG!"},{"comment_id":"1065756060184114","commenter_b":"Scums they are.","commenter_a":"So not only do Republicans want to send our children to war while Bernie wants to send them to college, they now want our soldiers to suffer longer so they can continue their attempts to bash Obama and destroy our great country. These Republicans need to be put in a POW camp until after the election. Scum of the Earth!","post_message":"This is absolutely disgraceful."},{"comment_id":"564066700424981","commenter_b":"She's a cunt.","commenter_a":"Please, it's time to serve her!","post_message":"It's about time!"},{"comment_id":"10153709060366037","commenter_b":"She is a disgusting hypocrite!","commenter_a":"That's OK, Kim. You're getting what you really wanted all along. Attention. May your 15 minutes be over soon.","post_message":"\"What probably hurt me the worst is when someone tells me that my God does not love me.\""},{"comment_id":"10152902566136336","commenter_b":"Don't worry she will burn ....hell has a special place for people like her !","commenter_a":"Burn her too","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."},{"comment_id":"10153965204071680","commenter_b":"Vote Hillary !","commenter_a":"Bruce Moss","post_message":"Joe Biden: \"It gets down to Florida, Florida, Florida – not a joke! You all do your job, we get to go to bed early Tuesday night.\""},{"comment_id":"10154059836575667","commenter_b":"follow please Happiness is not that owns everything you see beautiful, but happiness can see all of its holdings beautifu","commenter_a":"What a nitwit, well good for him, a felony record for life, he earned it and deserves it !!! Hope he gets at least a year to boot !!","post_message":"Will the man who destroyed Donald Trump's star on the Hollywood Walk of Fame go to jail?"}]
