[{"comment_id":"606144009518781","commenter_b":"She didn't get the revenge my butt would have gotten......I would have burned the house with him IN it chained to the bed.","commenter_a":"I agree that he should have been inside too bad that's cruel and unusual punishment. What kind of person does something like that to a child?!?!! Happens all the time unfortunately :( Exactly why I don't let my kids our of my sight, too many crazies in the world.","post_message":"The only thing better would have been if he was inside. ;)"},{"comment_id":"1205011436232276","commenter_b":"Hahaja pornhub and fat bitches fighting over fooood lmfao","commenter_a":"@username #14 😂. That's Steve","post_message":"Enjoy This Week's Vine Comp! #WSHH #Vine #Compilation"},{"comment_id":"1753089554908587","commenter_b":"Race has nothing to do with him being a dumbass.","commenter_a":"and he owes over 10.000.000 to creditors in US","post_message":"Kanye West is finally leaving. Thank the lord. We don't want him anyway. Can we get 5,000 'LIKES' to have Kanye leave for good!"},{"comment_id":"10153937537377894","commenter_b":"No wonder she's an Ex","commenter_a":"Wait. So she is saying he disrespected the flag, what he is doing is wrong, and after all of that she has the nerve to say he needs to be humble? The stupid ass Star Spangled Banner is NOT the Pledge of fucking Allegiance, first of all. I wish people would recognize that. Second, draft dodging is ILLEGAL, you \"allegedly\" advised Muhammad to do that and now you want to split hairs about the \"right way to protest\"? Third, how is he not humble and if he wasn't why should he be? Muhammad Ali famously talked all types of shit now she telling a nigga to humble himself, bih, go away.","post_message":"Girl, Bye! Muhammad Ali’s Ex-Wife Says Colin Kaepernick Should ‘Get Off His High Horse and Humble Himself’"},{"comment_id":"10156077468780354","commenter_b":"She'll be worse then Obama","commenter_a":"We can all hope that she is 80% of the way to the Big House!","post_message":"Before a single vote is cast?"},{"comment_id":"1832453327028289","commenter_b":"Always thought she is trash and this proves it.","commenter_a":"Arrest her","post_message":"Ever the provocateur, Madonna dropped a trio of f-bombs and admitted that she's \"thought an awful lot about blowing up the White House\" during a speech at the Women's March on Washington on Saturday."},{"comment_id":"10154322509929087","commenter_b":"Truth Hurts huh you little bitch? go whine and cry somewhere else. you sound like a little girl.. Here I'll give you your wubby","commenter_a":"This is the death of the Republican Party written as a victory. The backlash will be fierce and overwhelming if Trump behaves in office as if he has a mandate.","post_message":"#BREAKING: Hillary Clinton 's popular vote lead over Donald J. Trump is now over 2.3 million or 48.1 percent of the vote."}]
