[{"comment_id":"1051602538269331","commenter_b":"STFU!","commenter_a":"Obama is one of them! The blood of those in Paris rests on him. \"The greatest threat is global warming....\" Obama caused those deaths in Paris.","post_message":"UPDATE"},{"comment_id":"10154362431207293","commenter_b":"@username She may surprise you.","commenter_a":"Pennsylvania must be filled with idiots. The KKK and White Supremacists have always held high number of members in that state","post_message":"“Put in Trump and we’ll win again,\" one voter said."},{"comment_id":"1041548139262556","commenter_b":"I applaud those who came to discuss the matter at hand. To those who just want to attack me...lmao you have to do so much better than pulling your \"trump\" card","commenter_a":"Good. Maybe the Republican Party can stop killing our soldiers and blaming it on Hilary","post_message":"\"I'm worried that I will be the last Republican president,\" said Former President George W. Bush"},{"comment_id":"522407631280177","commenter_b":"Translation: her vagina scares me.","commenter_a":"Maybe it is because Hillary Clinton is just plain unlikable. I am not a Trump fan but will hold my nose and vote for him over her. Her voice scares people, she just can't connect with anyone. She is the female John Kerry.","post_message":"Hillary Clinton and Democrats think  or hope  that once the primary wraps up, tensions will subside."},{"comment_id":"10152774422166051","commenter_b":"Why are some people allowed to have kids??","commenter_a":"Please, can we eliminate these sh*tbags from the gene pool?","post_message":"Police found this 3-year-old boy sitting in the backseat of a car in freezing cold temperatures. His dad and babysitter had something more important to worry about."},{"comment_id":"488489361275658","commenter_b":"Don't think she will get off easy this time.","commenter_a":"She will get off easy because she's a cops wife","post_message":"A cop's wife did this to another cop's wife. I wonder what on earth she was thinking!"},{"comment_id":"10154045575585575","commenter_b":"Who cares what you say ASSHOLE...............","commenter_a":"And how long would you last in a war with America fool?","post_message":"Vicente Fox jumps shark. Says Trump election will lead to war."}]
