[{"comment_id":"10153444828331770","commenter_b":"Ignorant blacks thugs","commenter_a":"G.U.N. ?","post_message":"\"Man, I got that sh*t on camera, bro!\""},{"comment_id":"758122781044966","commenter_b":"Pack it up asshole your fired","commenter_a":"Traitor","post_message":"While Everyone Was Distracted By Super Tuesday Obama Secretly Did THIS We can't let him get away with this. He needs to be stopped. Do you think Obama is running this country into the ground?"},{"comment_id":"10153997696177300","commenter_b":"@username I feel so sorry for you ... I wish he wins and become president so you learn what immigration is ... I want to see you get kick out of another country. Remember the wall is for you not to scape. You Americans dumb supporters are morrons and losers","commenter_a":"The establishment wants a puppet, and clearly they found one in Rubio! The establishment hasn't learned that the more they ram their same old politics (taking care of donors and lobbying corporations) down our throats by telling us to vote AGAINST Trump, that we stand taller, rise stronger with you Mr. Trump. You are for us and we are for you.","post_message":"Yes, Donald Trump could win the White House in November."},{"comment_id":"1742743236000370","commenter_b":"Typical Bernie speech sounds like this.I like to thank my legs for supporting me.My arms for always having been by my side and as for my fingers-------I could always count on them.","commenter_a":"Thank you West Virginia and Nebraska...Im glad several of our states including Pa..can see what Trump needs to do.. JOBS....people need to get back to work.and Most hard working people want this...everyone needs to pay into the system..","post_message":"It is a great honor to have won both West Virginia and Nebraska, especially by such massive margins. My time spent in both states was a wonderful and enlightening experience for me. I learned a lot, and that knowledge will be put to good use towards the creation of businesses, jobs, and the strengthening and revival of their economies. I look forward to returning to West Virginia and Nebraska soon, and hope to win both states in the general election. Likewise, my time spent last week with the great people of Oregon will hopefully lead to another victory next Tuesday. Thank you! Donald J. Trump"},{"comment_id":"10154528365584342","commenter_b":"@username. Kim kardashian has done nothing in her life compared to Trump. Except suck like 10 ninjas dikks.","commenter_a":"Haha, once again ch. 13 is being biased. Haven't y'all seen all the libtards going unhinged on social media. Or commie elected democrat officials too. Democrats are the ones talking non stop about the results of the election. And calling president elect Trump not their president. Now that's un-American and petty.","post_message":"One expert blames it on Trump's insecurity from losing the popular vote. Others say it's just Trump being Trump."},{"comment_id":"10153990315029062","commenter_b":"So sad.......where are the parents???","commenter_a":"Seriously? the kids are really that dumb/stupid......those grades are apalling......what did the students/teachers do from the start of the school year until now?","post_message":"Monroe demanded the HISD Superintendent Terry Grier immediately step down."},{"comment_id":"1001125933342993","commenter_b":"Poor little Ivanka, I wonder what her price tag was? High class whore!","commenter_a":"Michelle had bare arms and got criticized by Republitards. Meanwhile, Melania posed nude and Republitards were silent. It's that self-serving double standard once again!","post_message":"Would Melania Trump be a good First Lady?"}]
