[{"comment_id":"10156409017440354","commenter_b":"Hillary is a stupid c*** and anybody who votes for her is a f****** moron.","commenter_a":"@webpagelink George Soros is the money and the monster backing them all!","post_message":"Don't ask questions. Just trust Hillary."},{"comment_id":"10153156704581051","commenter_b":"So what should he have done? If a chick is crazy like this chances are she isn't just gonna let him walk away. Men can be abused to and it's never right her ass is exactly where it should be.","commenter_a":"What kind of wimp does a guy have to be to call the police because his girl friend slapped his sensitive little face, and hurt his widdle feelings.","post_message":"This woman set up a secret camera to keep an eye on her boyfriend. When she reviewed the footage and saw what he was doing while she was gone, she snapped."},{"comment_id":"10155998790520294","commenter_b":"No!!! I'll pass on swimming in everyone's pee and who knows what else lol. Germ infestation!","commenter_a":"I want to do this","post_message":"Would you take a ride on this 800 foot water slide? A few thousand people in Akron are!"},{"comment_id":"1095905513769436","commenter_b":"But he couldn't get our marine out of Mexico, anybody had enough","commenter_a":"i do not believe that he was ever a prisoner of the taliban. he was working with them","post_message":"#Bergdahl wasn't just a DESERTER who left our side; he was a DEFECTOR who joined the other side!"},{"comment_id":"860902143955854","commenter_b":"That woman is a melodramatic idiot.","commenter_a":"Hey Nancy! Pot IS illegal and it STILL didn't stop him from giving it to his daughter! Legalize it already. Lets save Mexico from gang violence, free up the prisons, and start bringing in tax dollars from paper rolls and business sales. Enough is enough!","post_message":"What's YOUR take on the legalization of marijuana? @webpagelink #Pot2Blame?"},{"comment_id":"10153328594703132","commenter_b":"She needs to just quit. Can't stand her","commenter_a":"Jennifer Lesher","post_message":"\"I do not want to use my comedy to contribute to a culture of unattainable perfectionism and intolerance towards difference.\""},{"comment_id":"10153365745456749","commenter_b":"playing to the media.. he has done more to MAKE it happen again than anyone in history","commenter_a":"ALLAHU AKBAR!!!! #MMBR #M23BR","post_message":"\"In memory of those we lost, we resolved to shape a world where events like those of September 11, 2001, could never happen again, and we see this unbreakable spirit live on every day across America.\" —President Obama"}]
