[{"comment_id":"450286948495219","commenter_b":"Jo Jo What ever bitch, I have never called the cops and never will when I wish to commit suicide I'll call the pigs. You are a statist bitch.","commenter_a":"Whats the difference? Police are thugs.","post_message":"Do You Support Our Police Over Thugs?  Comment 'yes' or 'no'."},{"comment_id":"10153517289928352","commenter_b":"They needa kill your ignorant ass.","commenter_a":"Idk but kill it","post_message":"An alien-like creature fished out of a toxic river or a neglected bear: What IS this scary looking beast which can chew through its steel cage?"},{"comment_id":"923666907700065","commenter_b":"That hoe better learned how to fight cuz we gon square up lmao","commenter_a":"@username if I ever find out my daughter sucking dick idgaf she can get it . lmao go to her school and embarrass her. lmao","post_message":"Mom Beats Her Daughter In Broad Daylight For Sucking D!"},{"comment_id":"10153889126257144","commenter_b":"@username stfu ass!","commenter_a":"Obama is going there to give a speech about how the truck manufacturers have flooded the market, so it is easier to buy a truck than it is to buy a book.","post_message":"This is awful."},{"comment_id":"1167878733267392","commenter_b":"Just a worthless pos","commenter_a":"What a loser","post_message":"Unbelievable! Michael Moore is now calling on liberals to disrupt and shut down Trump's inauguration. @webpagelink"},{"comment_id":"10153051963761350","commenter_b":"Honorary Dame in England is a big honor -","commenter_a":"I'm a fan Angelina you too pope francis","post_message":"First comes being named an honorary dame by the Queen of England, and now Angelina Jolie is shaking hands with the pope!"},{"comment_id":"10153981335574060","commenter_b":"While we're at it, how bout you just shut your sass mouth, too.","commenter_a":"I love you, Economist. I do. And I'm no Trump supporter. But my reaction to this is the same as any time you tell America how to run itself: Mind your own damned business.","post_message":"The Economist cover story in the Americas and Asia Pacific  Donald Trump is unfit to lead a great political party, let alone America. It's time to fire him.   February 27th - March 4th  Read free via @webpagelink"}]
