[{"comment_id":"10153227457334170","commenter_b":"Rush says Ted Cruz is one of the most intelligent people he's ever talked with.thats good enough for me.so tell old has been Pete go jump and take all the other old pretenders with him.if we r only left with the tea party just think what we could do!!!","commenter_a":"Please do.","post_message":"Pete King says he may \"jump off a bridge\" if Ted Cruz is nominated...."},{"comment_id":"1202757773119671","commenter_b":"Yes Ivanka Trump would not be anywhere without her rich daddy!","commenter_a":"If it was not for her family name no one would listen to a word this really stupid spoiled brat has to say. You actually have to do something or have accomplished something to be a voice worth listening to and this twit as done nothing. Additionally hanging around with a child molester like Dunham shows just how pathetic she is.","post_message":"Chelsea Clinton tried to shame Ivanka Trump on live TV, but it immediately blew up in her FACE! This proves that Hillary Clinton has NO CHANCE!   Let's get 3,000 SHARES to show that we don't need a Clinton anywhere near a position of power!"},{"comment_id":"636643946488247","commenter_b":"WHY DON'T YOU JUST SHUT UP-SAVE YOUR MUSLIM THREATS FOR THE MUSLIMS ! LONDON SURE SCREWED UP WHEN THEY LET SO MANY OF YOU MOVE INTO LONDON-AMERICA WILL NOT MAKE THAT MISTAKE !","commenter_a":"They will try to attack us anyway so if we don't allow them in it will be easier to contain the ones who are here already.","post_message":"The new Muslim mayor of London has issued a warning to Donald J. Trump: Moderate your stance on Muslims, or they will launch more attacks against America."},{"comment_id":"10154568418189062","commenter_b":"Your right...Then she may get out and have more kids","commenter_a":"You kill your kids and get 6 years.. Serve 2 maybe 3 and then go on with your life.. Sad","post_message":"JUST IN: Barbara Russo has pleaded guilty in the drowning deaths of her 14-month-old twin daughters. The mother entered pleas of guilty to two counts of criminally negligent homicide. She was sentenced to six years in prison. More: @webpagelink"},{"comment_id":"942693669149238","commenter_b":"None of the name calling is necessary... My views and opinions stand. ... And I can get my own personal point across WITHOUT name calling :)","commenter_a":"Wooooow people are so ignorant!! Since when is it \"crazy\" to fight for freedom from a tyrannical government? They aren't trying to hurt anyone. They are wanting the ability to live free!! People are fined and jailed for living \"off the grid.\" THIS IS WHAT WE CALL TYRANY PEOPLE!!! The constitution was created to help protect us from corrupt government... hence the ability to bear arms. This is why. GUNS DONT KILL PEOPLE, PEOPLE KILL PEOPLE!!!!","post_message":"BREAKING: Ammon Bundy says he, 150 militiamen taking over national forest reserve in Oregon to  up lands for ranchers, miners, loggers & to oppose  of the federal government. The group is also calling on  patriots to join them with arms."},{"comment_id":"10153203209001336","commenter_b":"THANK GOD THERE ARE MOTHERS LIKE HER I WOULD DO THE SAME THING IF IT WAS MY KID!!","commenter_a":"Lets hope she isn't accused of child abuse!","post_message":"VIDEO: A woman is seen beating a rioter in Baltimore. It turns out he is her son."},{"comment_id":"10153277341923188","commenter_b":"I do believe the \"offended\" have been organized by an outsider to bombard anyone helping to stabilize the area. It is not Whole Foods, The National Guard or the Police who need scrutinized! It's the Promoters who keep unrest in the media way beyond the time it is newsworthy! Always seems to be when there is a \"Political\" issue, Ferguson-illegal aliens, Baltimore- Clinton Foundation and the very questionable donations. Of course the nuke treaty with Iran, etc.! Protesters in both cities started out fairly calm. Then hordes of people started pouring out of the woodwork, looting, burning, destroying, many were not even from that area! How did they get organized so quick? I agree that All Lives Matter in every community. I also believe a huge % of our Police Departments are doing what they have to do with the Thugs who lack any respect for our laws! Rap sheets ...","commenter_a":"So sad they were doing the right thing.","post_message":""}]
