[{"comment_id":"1162763547153229","commenter_b":"Betty White Anyone born after 1507 in America is a NATIVE AMERICAN... Those born before 1507 were not NATIVE AMERICANS.. This land mass was not named America until 1507... So Betty White, you are a NATIVE AMERICAN if you were born in America..","commenter_a":"Iwelcome to America, Ahmad Al-Abboud. I hope you, like many refugees, find the American dream!","post_message":"Ahmad al-Abboud, a Syrian refugee who recently relocated to Kansas City, discusses his harrowing ordeal. Watch more: @webpagelink"},{"comment_id":"10153385020755329","commenter_b":"don't talk that way about yourself.","commenter_a":"Pathetic idiot","post_message":"\"Growing up, I thought of Bruce Jenner as the kind of man I could never become. Now, I think of her as the kind of woman I try to be.\""},{"comment_id":"1237296066293181","commenter_b":"Stupid Hoe","commenter_a":"I think she is mad talented but until she stops dressing like a skank and humping everything from the air to the ground to the men in her music videos, the attention she gets will not be based off her amazing talent but on her sexuality. Becuase I think she is so talented I have watched many of her videos looking more for talent than her soft core porno ways and found that only a handful of her videos showcase her talent and not her ASSets. Soooo I mean, do something else girl cuz that talent is off the hook.","post_message":"There's a tendency to read Minaj solely through her sexuality."},{"comment_id":"10153590629541336","commenter_b":"Lady?","commenter_a":"How the hell is this \"lady\" not behind bars","post_message":"Ed Henry: “You were the official in charge. Did you wipe the server?” Hillary Clinton: “Like with a cloth or something?” WATCH: Today at a news conference, Ed Henry pressed Hillary Clinton as to whether or not she wiped emails from her personal server."},{"comment_id":"485687248279822","commenter_b":"The problem is when she decided to do this job the law was different. Leave her alone. Why should she be penalized for her beliefs?","commenter_a":"she, does not want to work....so go home lady","post_message":"If you can't do your job, maybe you shouldn't have it..."},{"comment_id":"10154151138320399","commenter_b":"muhammad ali was a muslim. karreem abdul jabbar is a muslim. the rw always misses that.","commenter_a":"So what's wrong to be a Muslim? Is being a Muslim evil and being an evangelical Christian holy? Republicans are bunch of hypocrites. Very discriminatory and hateful bunch of bigots.","post_message":"He made his name as a Calvin Klein model and actor on \"General Hospital.\""},{"comment_id":"1303998932977651","commenter_b":"Your a straight up pussy for that one. News flash dumbass your girls a ho","commenter_a":"A \"real nigga\" dont sneak shit..look like he aint wake dude up till bout the 5th punch..weak shit 😂😂","post_message":"He beat his a$$! #WSHH"}]
