[{"comment_id":"1180801771932078","commenter_b":"Thugs v thugs - time for trump to go","commenter_a":"This should get Trump even more votes, they are showing their true character!! Violence and Thugs....the Bernie and Hillary supporters, \"Democrats\"!!","post_message":"GRAMMY WINNER URGES BLACK MOBS TO PROVOKE TRUMP VOTERS 'See what they do then. Keep touching us, motherf----r'"},{"comment_id":"10156018657180389","commenter_b":"Carly Fiorina thinks that men that do not want to vote for her are \"Sexist\"... All of you that support her are actually Feminist, or men that are ashamed of being men... Do you really want a Feminist like Hillary or Carly in the White House?","commenter_a":"Hey Sean! Gonna be seeing our man Ted Cruz tomorrow:))!","post_message":""},{"comment_id":"10156264408410725","commenter_b":"The smart Americans will vote for Trump and Cruz. And that includes the \"legal\" Hispanics here. Trump wants to deport the millions of \"illegal\" immigrants..the ones who sneak in undocumented, or overstay their visas, or get deported and sneak back in...THE ONES THAT KEEP KILLING INNOCENT AMERICANS and drain our system! Get them the hell out.","commenter_a":"Go Trump!!! Hispanics for Trump 2016","post_message":"Join me Tuesday, November 3rd at 12PM in Trump Tower New York. I'll be signing copies of my new book CRIPPLED AMERICA. Don't miss it!"},{"comment_id":"477998972394364","commenter_b":"Me too, but sometimes I go overboard and can't keep track of all my comments on the Internet.. So I have to take a break.. Also I get discouraged when people call me names :(","commenter_a":"They didn't say \"get over it.\" They promised to look into it, did so, and concluded that their pop culture reference was fine and that people misconstruing it would be in the minority and no changes needed to be made. Kinda funny how you can spin a story with a contentious headline. Ben & Jerry's seemed concientuous and compassionate here, not combative and dismissive as the headline suggests.","post_message":"These folks became very upset over the name of Ben & Jerry's new ice cream flavor and demanded it be changed. Ben & Jerry's response: Get over it."},{"comment_id":"10153267785502894","commenter_b":"Lol I knew I was gonna get somebody! Yes it does and that's why being faithful and protecting ourselves is so important! It's too many fake porn stars out here...","commenter_a":"I bet too many thots out here having unprotected sex 😏","post_message":"STD Rates Have Hit a Record High in the United States"},{"comment_id":"10154310279241409","commenter_b":"@username I'm not against deporting any illegal immigrant that cannot qualify for resident alien status. If they have minor children, the children should stay with their deported families, but be allowed the reenter the US after the age of 18 with the proper paperwork. Legal migrant workers are the backbone of many US industries which would not survive without that work force. We don't really need a wall we only need to change the orders that have been forced upon our border patrol officers which makes the ineffective in most interactions with illegal migrants.","commenter_a":"Does anyone know what it is that they are protesting? Do they have any suggestions on how to handle illegal immigration, and the vetting process of refugees and immigrates? This seems like it may just be a way to get a day off work and get on TV.","post_message":""},{"comment_id":"10153200958788837","commenter_b":"?","commenter_a":"That cop needs to be arrested for having an illegal \"agresive breed\"","post_message":"PUPPY THROWN - Local 10's Michael Seiden has the latest on a poor little puppy that was thrown from a passing car right near the North Miami Beach Police Department"}]
