[{"comment_id":"698823633563273","commenter_b":"Well then stop her. Isn't that your job?","commenter_a":"Yes a female Eric Holder,","post_message":"GOP leadership should stop the Loretta Lynch nomination by not reporting it to the floor for a vote. We must reject lawlessness, outright."},{"comment_id":"1004203859620086","commenter_b":"Awful woman !!!","commenter_a":"I don't want to see this face in my newsfeed.","post_message":"Leave it to Michele Bachmann to exploit a tragedy to take a swing at President Obama"},{"comment_id":"580872065400762","commenter_b":"She is a big mess","commenter_a":"Dress by Radical Christian Dior.","post_message":"LOL! Sorry, but we just couldn't resist... where did Kim Davis think she was going tonight? If she wasn't such a homophobic bigot we'd recommend she go on Queer Eye for the Straight Girl! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153811887041770","commenter_b":"I never liked Nancy until I saw her genuine love and grief for the loss of her Husband.","commenter_a":"Well honey you know everybody laughed at Ronald Reagan because he was a movie star not a reality star cuz they didn't have that back then but he was still a movie star and they all laughed at him but guess what he broke down the wall he made this country great he made us unified and we love him and we love Nancy for The Classy wonderful woman that she was. Can we actually say that about what's an office now?","post_message":"Ann Coulter: “Why couldn’t it be a more genteel, a more elegant person like Mitt Romney. But as soon as you think that to yourself, you realize that is a creature that doesn’t exist in nature. For the attacks that Trump has come under, you have to be a tacky reality-TV star.”"},{"comment_id":"10152873946396045","commenter_b":"she is an idiot","commenter_a":"I think most people who don't like her are sore about her portrayals of Sarah Palin.","post_message":"Tina Fey literally gave David Letterman the dress off her back -- right there on the spot, leaving her stripped down to her Spanx, which had a special goodbye message written on them. #lastdressever"},{"comment_id":"1169765843057166","commenter_b":"Leave them alone, they have to live somewhere!","commenter_a":"DON'T CARE.... Kids are hungry.. Will be more hungry when school out !!!!! Focus on important things in the Community!!!!!","post_message":"Rumors are flying! Are Beyoncé and Jay Z living in Tampa? Our news partner the Tampa Bay Times went to check out the rumors and here's what happened..."},{"comment_id":"10152978558206051","commenter_b":"Ive seen mothers making babies for the purpose of the money BULLSHIT lazy ass mothers","commenter_a":"if you're TOO POSH to push STOP HAVING BABIES :p","post_message":"This pregnant mom of 11 gets $60,000 per year in benefits, but she still wants the government to pay for a c-section for her next baby. And that's not her only request."}]
