[{"comment_id":"1014820688580048","commenter_b":"Time for muslims to take their a$$e$ back where they came from","commenter_a":"That's the national anthem. If you aren't willing to be An American than go home! And take the stinking socialist with you. You can take the atheists and the Mexicans.","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays @webpagelink"},{"comment_id":"953630401426610","commenter_b":"You are not Deplorable Hunny!! She is just Evil!!","commenter_a":"I am an immigrant who came here LEGALLY...just because I want LEGAL immigration and I want nthe Border Wall...Acc. to Hilary I am in the basket of \"DEPLORABLES\"","post_message":"Donald J. Trump speaks at the The Remembrance Project National Conference in Houston."},{"comment_id":"10154195854358256","commenter_b":"Nice strawman Julia. Careful you don't smoke around that one.","commenter_a":"Palin is as irrelevant on the right as Debra Wasserman Schultz is on the left.","post_message":"Sarah Palin, take a seat."},{"comment_id":"10154102446149749","commenter_b":"@username, STFU and go lick the pope's ass ..","commenter_a":"Well why doesn't the Catholic Church hand over some of its many billions and do something about it and relax their pathetic view on contraception No wonder there are so many of them","post_message":"The Pope laments Europe's handling of the influx of migrants and refugees fleeing war and persecution."},{"comment_id":"10153783158317894","commenter_b":"Where do you find women naturally shaped like that without intense waist training?","commenter_a":"I do question if she's had work but there are woman shaped like that in life actually. Not all women have that tire around their waist. Only reason I question her because her butt never changes size despite increasing or loosing weight and mine definitely does.","post_message":"Kim Kardashian Claps Back at ‘M.I.L.F. $’ Photoshop Accusations: ‘F*ckYoPhotoshop’ [Photos + Video]"},{"comment_id":"10153603915850667","commenter_b":"Thank you sir. You are right. Prayers for the family.","commenter_a":"Prayers^^^ These parents have to live with this loss for the rest of their days.This isn't the time to be judgemental or self righteous. Prayers and condolences are in order.","post_message":"The father struggled with the alligator to try to save his son, but was “unsuccessful.\" @webpagelink"},{"comment_id":"10153124217341051","commenter_b":"Ive seen women pulling crap everything from getting a friend to flirt to wrecking a guys car.Stupid and insecure....","commenter_a":"she was watching too much titanic","post_message":"This woman wanted to test her boyfriend's love for her by climbing over the railing on a cruise ship to see if he'd come to her rescue. You can probably guess how that worked out."}]
