[{"comment_id":"10154529341826178","commenter_b":"This may be fun! Hillary won't be debating a politician! I see a house falling on her and watching her toes curl!","commenter_a":"Illegals and dead people voting","post_message":"Mika seems so sure of this...#RNCINCLE"},{"comment_id":"10153805413233352","commenter_b":"There is no such thing as going to far I would do the same shit....I'll kill a little bitch or nigga that lay a had on my child....no matter your age..or gender..daddy got your back....","commenter_a":"And???","post_message":"Shocking moment angry dad ‘tried to run over a group of teens for bullying his 13-year-old daughter’"},{"comment_id":"10154888080729099","commenter_b":"@username idiot","commenter_a":"Yorkshire UK. Police shot a person the other Day, Last time they shot someone was 6 years ago.","post_message":"Breaking News: Police have shot and killed a man in Prospect Heights. The shooting comes less than 12 hours after an NYPD officer fatally shot a man in Canarsie @webpagelink"},{"comment_id":"1313980255294149","commenter_b":"this woman simply cannot be a fisrt lady.. Why doesn't trump talk about deporting her ass?","commenter_a":"I am sure he didn't marry her for her to speak. When I think of all the haters who said Michelle Obama had no class (ridiculous), I wonder if they will be thrilled with FLOTUS, Melania Trump.","post_message":"Ha."},{"comment_id":"10157214530105615","commenter_b":"Now if Rupert Murdoch could just croak and leave us all alone, particularly National Geographic...","commenter_a":"40 million to leave?","post_message":"BREAKING – Maybe now Americans can have their country back... Best thing to happen to America in years!"},{"comment_id":"10153238960151438","commenter_b":"Ok clark. You win. All lesbians are fat hairy and ugly. That is completely accurate. No bullshit. You are a really smart person. So glad we had this talk.","commenter_a":"why are most queer women obese now thats a question","post_message":"Why don’t queer women flirt with other queer women?"},{"comment_id":"1392678767477322","commenter_b":"I lived there for awhile, when I got out of the Navy and met a lot of great people.Trust me, we know there are many good people there.Just the idiots have loud voices. lol","commenter_a":"I have lived here for 66 years except for military time. Don't count me as one of these idiots I love this country, third generation Navy👍🇺🇸","post_message":"A new poll shows 1/3 or Californians want to secede from the USA over Trump. Here's EXACTLY what would happen if they got their way!"}]
