[{"comment_id":"10153484724071509","commenter_b":"Jason, go tell it to your momma, she's use to your hot air, and I don't have time for idiots. Go get your daily fertilizer. Move along!","commenter_a":"They will get unsupervised probation. Maybe six months tops in lock up. \"Privileged monsters\" just itching to kill!","post_message":"Five teens have been charged with planning a classmate's murder. Their plot was discovered when another student talked to school administrators, police say. @webpagelink"},{"comment_id":"1157488834340407","commenter_b":"I thought she was leaving. No one cares what she says","commenter_a":"She lies as much as killery","post_message":"Miley Cyrus, a Hillary Clinton supporter, is extremely sad."},{"comment_id":"10152995336151037","commenter_b":"This chick is nuts lmao. Anyone who pretends to know what happened is dillusional.","commenter_a":"This was NEVER about a RACIST Cop shooting someone. The Lame Stream Media made Darrin Wil\\bson into a Racist, despite NO Evidence ever being presented that showed Mr. Wilson as being racist. It is sickening.","post_message":"A member of the grand jury that declined to indict the white Missouri police officer who fatally shot an unarmed black 18-year-old sued the prosecutor in the case, criticizing the way evidence was presented to grand jurors and seeking court permission to speak publicly about the way the case was handled."},{"comment_id":"10154959360378812","commenter_b":"She's a nasty nasty woman","commenter_a":"charge her for what.......whats the charge...stop interfering in the election......","post_message":"Congressman Bob Goodlatte: FBI – Federal Bureau of Investigation Director James Comey \"very conscious of the controversy\" within the bureau over decision not to charge Hillary Clinton. @webpagelink #thisweek"},{"comment_id":"941236165936132","commenter_b":"Je vais m'y opposer a son mariage ! Ce n'est pas normal qu'il est pas pense a nous...","commenter_a":"@username il nous a meme pas invite","post_message":"Congratulations Nikki Reed and Ian Somerhalder!"},{"comment_id":"10153090581796749","commenter_b":"Go fack your mam","commenter_a":"Fack you","post_message":"This is no longer a problem to leave for the next generation to fix. We have to act now."},{"comment_id":"10154743598641323","commenter_b":"Yep. Greedy bastards.","commenter_a":"Ladies and gentleman. I present to you - Capitalism at its finest......","post_message":"Michelin-starred TV chef Michel Roux Jr. has been paying some kitchen staff at his Mayfair restaurant less than the minimum wage, the Guardian can reveal, while charging over £60 for one starter."}]
