[{"comment_id":"10153147282168701","commenter_b":"Shut up Leah Jesus Christ.","commenter_a":"GUILT BY ASSOCIATION! I GUESS IN AMERICA YOU CAN BE HELD RESPONSIBLE FOR WHAT OTHERS DO, I THOUGHT YOU WHERE INOCENT UNTIL PROVEN GUILTY, BUT THE WHORES OF SOCIETY-AKA THE NEW STATIONS, REPORTERS, OREGONIAN, HAVE TRIED, COVICTED, AND SENTENCED A MAN FOR CRIMES HIS GIRLFRIEND COMMITTED, SOME PRIOR TO THEM EVEN MEETING BUT SOME HOW IT IS HIS CRIME, SHAME ON YOU WHORES!!!!","post_message":"Here's the full resignation letter from Gov. John Kitzhaber, who says: 'I understand that I have become a liability to the very institutions and policies to which I have dedicated my career and, indeed, my entire adult life.'"},{"comment_id":"10154586781928598","commenter_b":"Good for them, proud of you both, goes to show you how much they really respect themselves","commenter_a":"Blessings for your marriage!!","post_message":"#6 most-read LifeNews story of 2016: After Abstaining Until Marriage, NFL Star Russell Wilson and Ciara Get Married: “We Did It Jesus’ Way”"},{"comment_id":"10153823007621636","commenter_b":"The US is no longer safe for the blacks, pls find other homes.","commenter_a":"'He's put on a paid administrative leave'!!!!!!! What on earth is happening in America???? These are not police officers in fact they're BLACKAMERICANKILLERS.. cos surely where I live police officers protect people from harm and do not to blindly shoot them.","post_message":"In North Miami"},{"comment_id":"10154292047384877","commenter_b":"She out here looking like Nick now","commenter_a":"Wait so you can demand money for a breakup now?? I must have missed that memo, lol","post_message":"Mariah Carey also took to Instagram to confirm the split and her break-up hashtag game is brutal."},{"comment_id":"968962986483662","commenter_b":"Exactly @username. @username, has already contradicted herself more than once. She is all over the place. That's one weird Troll.","commenter_a":"Barack Obama has done more damage to the USA then all past presidents put together...............He lies continually, he is anti-police, pro-thug, anti-life for gay marriage..... he says he is Christian but his fruits of his works are anti-Christ.....he sides with Islamic terrorists....goes against are biggest ally the Jewish Nation and has done everything he can to bring racial division to this once great nation. Treason is an understatement!!! Why don the Senate evoke the NUCLEAR option so to force our Divider and Chief veto all of the bills coming out of the Senate??? We the people should elect a person who will obey our Constitution and has faith in God, and a person who truly cares for the people and our Veteran!","post_message":"In 5 days, Congress will have to send 'must pass' legislation to President Obama's desk to fund the government.  Sign your emergency fax petition urging them not to send a single penny of taxpayer dollars for abortion or abortion providers! Click here! @webpagelink"},{"comment_id":"10153085660518010","commenter_b":"'@username - Why are you afraid of strong women?","commenter_a":"If women can complete the same physical testing that men have to then they should be allowed to become full combat ready Army Rangers","post_message":"About 60 women will be allowed to take the next Army Ranger course assessment for the first time ever.  But women are still not allowed to become members of the regiment and will not serve as Rangers in combat."},{"comment_id":"895405060572025","commenter_b":"Just like that nut","commenter_a":"Looks to me Democrats are pretty scared of Trump and that way they send these people to his campaigning events and start up problems, fights in crowds. Democrats can't play fair cause they know they are not going to win people are tired of being lied to and their rights being striped away...people this is a wake up call!!!! If you value your freedom you better dig deep in who your voting for...because all Democrats are trying to take our rights away!!!","post_message":"This is hilarious.  Video by the Canadian comedy show 'This Hour Has 22 Minutes.' Shared by Occupy Democrats, LIKE our page for more!"}]
