[{"comment_id":"10152564935772217","commenter_b":"pussy","commenter_a":"D man is a fool is dis how you catch a thief","post_message":"Brave or stupid? This passer-by tackled a robber who'd just raided a jewellery shop in London: @webpagelink"},{"comment_id":"10152960081691051","commenter_b":"My ex wife is a chupacabra!","commenter_a":"Yeah right !!","post_message":"This woman is confident that she found a Chupacabra - and she has proof."},{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation.  It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation.  Read the whole story at Reverb Press HERE: @webpagelink"},{"comment_id":"10153631429237098","commenter_b":"Get your mind out of the gutter ladies.","commenter_a":"What a pig, No little girl's first introduction to sex should be with some slime like this.","post_message":"#BREAKING - The dental assistant was arrested over the weekend for allegedly molesting a sedated 8-year-old girl  Police say there may be more potential victims"},{"comment_id":"10153011050796717","commenter_b":"Exactly what does that have to do with anything!","commenter_a":"Why does it matter what his sexual orientation is?!","post_message":""},{"comment_id":"10153311050083037","commenter_b":"Just remember these are people fleeing terrorism NOT terrorist! Living breathing people who are desprete. THEY HAVE NO LESS RIGHT TO DO THAT THEN YOU DO... just because an accident of birth MADE YOU AN AMERICAN","commenter_a":"That is assault, and the spitter better be charged.","post_message":"\"It sickens me to know that no matter how hard I try, there still exists a blur between myself and the decency a human life entails,\" said the student."},{"comment_id":"10153198619131378","commenter_b":"Hell no he has lost his mind please hurry 2016 so he can take a much needed seat lol","commenter_a":"No more illegal","post_message":"\"Now we know the scale of this problem. It's significant. And there are millions of people who have been driven from their homes because of this violence,\" President Obama said."}]
