[{"comment_id":"10153223168071509","commenter_b":"The Christ is real but Roman Catholicsm is a Pagan Religion I think","commenter_a":"Hopefully they are totally different from the other out of touch cardinals we now have .","post_message":"For the second time during his papacy, Pope Francis has announced a new group of bishops and archbishops set to become cardinals -- and they come from all over the world. @webpagelink"},{"comment_id":"1836299966658207","commenter_b":"Damn @username is just as bad as those UNAmericam bitches","commenter_a":"Hey whoopie knuckle dragging Goldberg, I thought you were leaving if Trump got elected, get the fk OUT of OUR COUNTRY and take your brainless bimbos with you!","post_message":"Things got CRAZY on the set of 'The View'  when one host went completely over the edge, and then demanded that Donald Trump do the unthinkable. Viewers could hardly believe it..."},{"comment_id":"10154776330225831","commenter_b":"@john, Lets talk abt the difference please.....Lets talk abt the American Citizens who took a gay man, James Byrd Jr.....beat him...tied behind a truck, and then dragged him for miles until some of his body parts started ripping off of him....when they finally stopped to toss his body over a cliff....all that was left was his torso....all done by Americans.....Legal US Citizens, in 1998..... Or better yet......the Oklahoma bombings, in 1995, who was carried out by Timmothy McVeigh.....let me reminded you how this Legal American Citizen; bombed the Alfred P. Murrah Federal Building in downtown, Oklahoma City, killed 168 people, and injured more than 680 others ...here's another legal Citizen attack for you, since we Americans forget how we're our own enemies {but I guess thats okay}.....: Eric Rudolph carried out the Olympic Park bombing in Atlanta during the 1996 Summer Olympics.....that blast killed spectator Alice Hawthorne and wounded 111.....lets ...","commenter_a":"Instead of deporting \"illegal immigrants\" kick out all the Nazis skin heads KKK alt right Moran's and we shouldn't have any problems with the rest of the world","post_message":"The 9th U.S. Circuit Court of Appeals has refused to reinstate President Donald J. Trump's travel ban. In response, President Trump tweeted, \"See you in court\" and \"the security of our nation is at stake.\" Do you agree with the court's decision?"},{"comment_id":"10153548009250575","commenter_b":"Women need to be cooking and cleaning for a man. Free time and they just get weird.","commenter_a":"That's just fkn nasty!!!!","post_message":"The Gateway Pundit - GROSS. Leftist Artist Uses Her Menstrual Blood to Paint Angry Portrait of Donald Trump"},{"comment_id":"10154061542714411","commenter_b":"\"Hey, Jews are getting their own country, let's all go be our typical fuckhead selves and try to butcher them all.... we'll need a name, someone go digging around and come up with something while I strap a bomb to my kid\" (The founding of Palestine).","commenter_a":"O God!!! hahahahahaha...Ignorant Mr.MP...","post_message":"Letters matter"},{"comment_id":"1234498396590570","commenter_b":"Carole, keep your day job and drop the politics. You're a suffering liberal.","commenter_a":"This is big news because conservatives want you NOT to notice that the economy is way up, the deficit is way down, unemployment claims are at a 42 year low, and Obama has unprecedented world approval. So Obama has almost rescued us from the disaster the Republicans left us when Bush was in office. But don't notice that stuff, focus on bathrooms and what Muslims are doing in countries you can't even find on a map.","post_message":"#BoycottTarget  #PRDisaster #TalkIsCheap"},{"comment_id":"693806690773834","commenter_b":"Women should be prosscuted!","commenter_a":"I think this is where the word HOG WASH, came to be.... just saying...","post_message":"How rotten this administration is to the core when the attorney general takes the fifth to avoid incrimination!"}]
