[{"comment_id":"10153835209313380","commenter_b":"Outstanding. Congratulations.","commenter_a":"CONGRATULATIONS","post_message":"Today, I want to recognize Commander Zeita Merchant as she relieves Capt. Ryan Manning as Commanding Officer of Marine Safety Unit Chicago. Zeita is a native of Jackson, MS, and a Tougaloo College graduate. She will be the first African-American female commanding officer in history to command a Coast Guard marine safety unit and the first female officer to command Marine Safety Unit Chicago. Marine Safety Unit Chicago comprises 52 active duty, reserve and civilian personnel. Marine Safety Unit Chicago’s area of responsibility includes a fleet of 266 vessels, 118 regulated waterfront facilities, Lake Michigan shorelines of Illinois and Indiana, as well as 186 miles of the Illinois River System segmented by seven locks and more than 250 bridges. Congratulations Zeita! We know you will continue to make us proud. #MississippiMade #MississippiSupports #MyMS02 #BGTMS02 #FeelGoodFriday"},{"comment_id":"10153540502734411","commenter_b":"Wow--look at that face. That woman needs to smile more.","commenter_a":"Links of blood and marriage tied Battenbergs/Mountbattens to Germany/or.also Saxe-Coburg-Gotha into \"Windsor\" didn't transform Edward..","post_message":"'She was a child when this film was shot, long before the atrocities of the Nazis became widely known. But Edward was already welcoming the regime as Prince of Wales in 1933 and remained pro-Nazi after war broke out in 1939. He could well be teaching the Queen and Princess Margaret how to do the salute.'"},{"comment_id":"838447029619520","commenter_b":"Why is that ugly cat so moist.","commenter_a":"Brittany Gallo","post_message":"WATCH: Obi the baby pygmy hippo has splashed into the water with his mother for the first time in front of viewers at the Melbourne Zoo in Australia."},{"comment_id":"10155153286483258","commenter_b":"But it's nothing like taking public funds for your business, and then having offshore tax havens, while your skimming operations know no bounds.","commenter_a":"No. It's not at all like taking a great Chagall or Picasso or anything remotely close #boybye","post_message":"“It’s like taking a great Chagall or Picasso or something,” New England Patriots owner Robert Kraft said. “You can never display it.”"},{"comment_id":"10153671794761770","commenter_b":"Gross ! She's too fat ! Lol","commenter_a":"- Someone whisper in Dereks ear, ALL beauty is fleeting","post_message":"Derek Jeter clearly hit the jackpot."},{"comment_id":"10154292908136545","commenter_b":"That claim was bogus. She was an angry girl out to get him. There was supposedly proof of that.","commenter_a":"Seriously??!!! Pray he's ok. He needs to be in protective custody until game time","post_message":"JUST IN: Frisco police confirm Ezekiel Elliott was involved in a minor car crash near #Cowboys practice facility. No injuries were reported.   MORE: @webpagelink"},{"comment_id":"635715443285701","commenter_b":"Should have knocked her out cold","commenter_a":"shoot that bitch with that soldiers gun.","post_message":"This liberal garbage spit in a soldier's face, receives instant karma.  What a pig. If you don't support our troops you can leave.  Do you agree she got exactly what she deserved?"}]
