[{"comment_id":"10152994622700796","commenter_b":"Women are more likely to have chronic pain, be prescribed prescription painkillers, be given higher doses, and use them for longer time periods than men. Women may become dependent on prescription painkillers more quickly than men. Women may be more likely than men to engage in “doctor shopping” (obtaining prescriptions from multiple prescribers). Abuse of prescription painkillers by pregnant women can put an infant at risk. Cases of neonatal abstinence syndrome (NAS)—which is a group of problems that can occur in newborns exposed to prescription painkillers or other drugs while in the womb—grew by almost 300% in the US between 2000 and 2009. ---@webpagelink","commenter_a":"These addictions for many were not choices but had a slow way of happening. Many were prescribed pain relieving drugs after surgery or have a bad back or another painful injury and the doctors wrote prescriptions for opioid medicine like the were going out of style. The family that owes the company that make Oxy, are literally billionaires now just by selling Oxycontin. When you write millions of prescriptions for Oxy in less than 20 years, what the hell do you think that will happen? Many of those people become addicts if you take these drugs for a long enough time. When the doctors stop writing scrips, the people turn to any source available. IMO, Doctors are responsible for the current heroin epidemic in this state and country.","post_message":"“It focuses on a social service intervention as opposed to criminal justice intervention, and it’s been very successful in Seattle,” Portland Mayor Michael Brennan, who is a licensed clinical social worker, said."},{"comment_id":"482642515272130","commenter_b":"Absolutely it is. We're nearing the point of no return for this planet (relative statement. Could be in 100, 300, 500 years) and without a plan to continue our species (even if generations have to spend their lives in a travelling spaceship) we will go extinct. Planning for the future is always a worthwhile investment no matter how far ahead the worst case scenario seems.","commenter_a":"In other news more useless discoveries that are so far away they might as well not exist","post_message":"AMAZING news."},{"comment_id":"1025129017543627","commenter_b":"Preoccupied? Can women still vote? $$ facebook doesn't want you to see this $$ As long as America's richest 1%, who now possess 70% of the wealth and don't bother to vote, have the Senators in their pockets the United States Government isn't representing the will of the people, it's the 1% that's running the show. I stand with Bernie Sanders, 'We're governed by an Oligarchy.' The number of Americans living in poverty will continue to grow while the middle class will continue to shrink and working women will continue to enrich the wealthiest 1% for the next 20 years easily! (Able to afford the best and brightest, Hillary is a great political actor with a well rehearsed script.) Hillary Will make another Fortune!","commenter_a":"VOTEHfor both of US","post_message":"Women deserve access to the health care they need—without interference, intimidation, or violence. #StandWithPP -H"},{"comment_id":"1052170041539020","commenter_b":"she sucks","commenter_a":"Great","post_message":"Clinton is clobbering Trump in poll after poll."},{"comment_id":"1046596102028067","commenter_b":"I hope you'll be the pregnant one cause you're a bitch >:(","commenter_a":"Lol wut @username","post_message":"No women required."},{"comment_id":"1064050356984826","commenter_b":"Karen why do you want a President that would say, 'single payer will never ever come to pass'? Despite over 58% of Americans supporting it, knowing it will save us money and insure everyone, and that every other industrialized country in the world has had it for years and years. @webpagelink Or someone who corporate lobbysists know will end up supporting the TPP? Do you know what this trade deal would do to my generations future? If you did you would not be voting for her. @webpagelink Please for my future and my generation future vote for Bernie in the primaries. #NoMoreTradeDealsThatSendJobsOverseas #HealthCareForAll #BernieForPresident #NinaTurnerForVP #WarrenForMajorityLeader","commenter_a":"It's Hillary's time! Bernie is good in the Senate.","post_message":"This is it—the Iowa caucus is today! If you’re standing with Hillary, share this."},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"}]
