[{"comment_id":"10156995809880354","commenter_b":"Someone needs to tell that ugly old bitch to put some fucking clothes on.","commenter_a":"I have respect for this woman. She isn't funny and she is without class.","post_message":"Chelsea Handler's thirst for attention is seemingly unquenchable..."},{"comment_id":"10154148249086336","commenter_b":"KILL ALL RNC PIGS,LIBS,RINOS,SQUAEL PIG SQUEAL","commenter_a":"Caleb Benitez these are those higher power that people don't know about ,they try controlling the world ,not this time","post_message":"The letter reportedly contained a threatening message that implied Donald J. Trump's children would be hurt if the GOP candidate did not withdraw from the 2016 presidential race."},{"comment_id":"10156259154010354","commenter_b":"Well, she won't have to worry so much about those tax breaks she was looking for in America. Now she has not reason to stay here.","commenter_a":"You hate America and Republicans, well, that's fine, we won't bother to see your movies.","post_message":"The America hater's new movie is hemorrhaging cash..."},{"comment_id":"10157068560150354","commenter_b":"When you ignorant fucking blacks start acting like black lives matter, maybe then I'll start to believe that black lives matter. Until that happens, and I doubt it ever will, keep killing each other and SHUT THE FUCK UP. Your BLM movement is a FUCKING JOKE;nothing more than LOW LIFE, FUCKING ANIMALS.","commenter_a":"I HOPE THIS IS AN ISOLATED INCIDENT. FOR THOSE WHO STOOD BY AND WATCHED, MAY THE SAME HAPPEN TO YOU.","post_message":"A shocking Chicago video reveals the horrifying death of 32-year-old Marques Gaines..."},{"comment_id":"10152958371844342","commenter_b":"sbot negroes are just going to keep raping robbing murdering , shooting looting and then '' pointiong out no one likes them''' ahhhhh dahhhhhh mr prez-a-dent","commenter_a":"so, this was 3 years ago, and you're just now getting upset?","post_message":"\"They got a slap in the face.\" A couple is now suing the owner of a photo booth who was taking pics at their wedding in 2012. Apparently, some of the guests had racial slurs printed on their wedding day photo. FULL STORY --> @webpagelink"},{"comment_id":"10153317099366051","commenter_b":"Caleb I agree. @username you are a fucking Looney toon. Crazy bitch","commenter_a":"She didn't kill him & usually if someone is threatening suicide it's because they're not gonna do it anyway! I have attempted suicide & have suicidal tendencies that I battle everyday but when you get ready to do it you don't inform others you just do it! I think it's bs that she is being charged when he had every opportunity to walk away....he chose to die no matter what she said to him! If you're steady telling me you're gonna kill yourself then I'm gonna tell you to go ahead and stop feeding me your empty threats!","post_message":"Remember the teen who convinced her boyfriend to kill himself? Well, she just got some bad news."},{"comment_id":"10153776630979714","commenter_b":"Woman here. Would never get an abortion myself, but don't want to impose my beliefs on others so if others want to abort, go ahead. I do not feel the American tax payers should have to fund others abortions, though.","commenter_a":"You have no place to discuss abortion or planned parenthood unless you are a female.... If you're a man, shut the hell up because most of you cant even tell me how many days are in between menstral cycles.","post_message":"Do you, Lena Dunham."}]
