[{"comment_id":"1115766885107801","commenter_b":"Carly Fiorina is so lame she should be charged for being a Phony! (Fake).","commenter_a":"Her comment alone discourages me from wanting to see more. SILLY","post_message":"Carly Fiorina used the opportunity to bring up the time President Obama once ate dog meat."},{"comment_id":"10153790439861680","commenter_b":"This woman should shut up since she and her husband were just as corrupt as the current one!","commenter_a":"Mexico is a cesspool. There's nothing we need from them but they rely on everything from the USA. We've bailed them out so many times and the American Government is making taxpayers flip the bill for Mexico's $50 billion bailout. Build the wall, tax their imports and tax the $35 billion the illegals are sending through wire transfers a year. Punish companies leaving the USA and moving operations to Mexico and over seas!","post_message":"\"Mexicans have dignity and repudiate his hate speech,\" she writes."},{"comment_id":"1454008947960907","commenter_b":"Just stop we will help them build a wall gladly","commenter_a":"Not going to happen. Not only has it been deemed unconstitutional, isolationism DOES NOT WORK in a multinational economy. This makes me roll my eyes just like when Texans were crying the same thing after Obama was elected (both times).","post_message":"Group calling for California to secede from the U.S. hopes to put question on the ballot authorizing vote on independence."},{"comment_id":"463669483844276","commenter_b":"OHHHH.....now I understand. We have been talking past one another for half an hour.","commenter_a":"If Cruz is not a natural born citizen, but the offspring of two illegals who came here 2 weeks ago is, there is something SERIOUSLY wrong with our system.","post_message":"Ted Cruz was born in Canada and was a Canadian citizen until 15 months ago. Lawsuits have just been filed with more to follow. I told you so!"},{"comment_id":"10154036554629411","commenter_b":"God I hope Trump gets in not Clinton , he may open his mouth and speak as he feels refreshing Realy , but I'd rather him than warmongering old B like her!","commenter_a":"yes, we can tell them apart very well :D Greetings from Czech republic BTW :D","post_message":"'Death to teetotalers and vegetarians'"},{"comment_id":"10153169137025950","commenter_b":"Ella Patrice Nierva","commenter_a":"Ricardo Alvarez","post_message":"WATCH: Little girl can't wait another second to hug her soldier dad, runs to him in the middle of a ceremony @webpagelink"},{"comment_id":"10154274374674445","commenter_b":"Meant north Falmouth not Nana! These txt terms get ahead of me lol!","commenter_a":"Granddaughters & sister-in-law-,law live in E,& Nana Falmouth have to check it out!, saw on local TV Chronicle last night!","post_message":"Chronicle on WCVB Channel 5 is exploring the beauty of Cape Cod. What's your favorite spot to visit each year?   Watch live: @webpagelink"}]
