[{"comment_id":"10153318242754087","commenter_b":"I'm not a gynecologist, but I know a cunt when I see one.","commenter_a":"Bernie doesn't accept SuperPAC money, yes, which is very honorable. But he still takes money from unions. Trump is the only candidate who is self-funding his campaign.","post_message":"“I’m voting for Bernie Sanders, because he doesn’t take any corporate money,” said undefeated UFC champion Ronda Rousey. “I don’t think politicians should be allowed to take money for their campaigns from outside interests.”"},{"comment_id":"1554819554825337","commenter_b":"i dont have to even listen , i can tell by how stupid she looks","commenter_a":"Lunatic left.","post_message":"This is downright shameful."},{"comment_id":"1525627194121061","commenter_b":"no one wants californians","commenter_a":"Why, Canadian provinces are constantly talking about seceding from Canada.","post_message":"Canadians are inviting Washington, Oregon, and California to secede and join Canada."},{"comment_id":"1263029653753561","commenter_b":"This wasn't even a debate, it was #RealityTV. But yeah, Clinton couldn't have lost because #herOpponent has a #MentalDisability. Trump supporters are right, it's unfair to him to expect him to be competent. Donald show us your crooked tax returns #WordsMatter. Do you want the most powerful person on Earth to have the mouth, the character, the words of Donald Trump?? There is no argument for Trump. #ItsAVoteForHillaryAndHerAgenda #StrongerTogether #Progress #AFutureToBelieveIn #LoveTrumpsHate #LatinosArentRapists #WomenArentMissHouseKeeping #UnitedAgainstRacism #YesWeCan #DontBooVote #WhenYouGoDownWeGoHigh #LatinosArentPigs #ClimateChangeIsntAHoax #MissUniverse1996IsntMissPigy","commenter_a":"Its pretty simple boycott all these biased media outlets. Let their billionaires spend their money keeping it afloat. They don't help their own countrymen. But, sure want to take down America. Sorry, you are a idiot if you can't see this. Sad, but true Hillary is their puppet a long with Bush. The problem is the people are waking up. I can only say arm yourselves. These outlets and their mindless bots working for them are going to still put out the same trash everyday. You take down Law enforcement, then Military divide the people and conquer Keep being idiots.You will be telling of the America I love as \"Once upon a time\" You know those pastuers are always greener till your there. Don't you bots find it interesting Hillary is pulling a large number of Jewish vote and Muslim. WTH do you think she has promised each side to ...","post_message":"Trump's tax plan: 1. Huge tax cuts for billionaires and millionaires like him. 2. A tax hike for millions of middle-class families."},{"comment_id":"1800766070155339","commenter_b":"#NeverHillary #Hillaryforprison","commenter_a":"we are all trapped","post_message":"Hillary Clinton just became the first female presidential nominee of a major party. Here's the reaction on the floor."},{"comment_id":"1204572852997751","commenter_b":"Oh man....","commenter_a":"Alex Chapman WTF is it even gonna be worth watching that's 3/4 out of it now","post_message":"'No more soggy bottoms'"},{"comment_id":"10154532453451051","commenter_b":"@username, do you kiss your boyfriend with that mouth?","commenter_a":"You're goddamn right I do. Hope he cracks down on the obstructionist Dems swiftly, and mercilessly, and for those who will inevitably say \"Oh, but the GOP were nothing but obstructionist with Obama! Buhuhuhu.\" To that I say: Elections are a game of King of the Hill, we now have the Hill and soon all 3 branches of Government. I'm not gonna entertain that \"moral high ground\" game, no, this is strategic warfare plain and simple, and we have the strategical advantages.","post_message":"Do you support Jeff Sessions as attorney general?"}]
