[{"comment_id":"10153394886826336","commenter_b":"Mexicans run America now and there is nothing u can do about trump ur screwed...don't run for president no more there is no way ur going to win piece of","commenter_a":"Sue them to Mexico and back!","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"1371941172817349","commenter_b":"TRUMP AMERICAS WELFARE QUEEN!","commenter_a":"Bahaha, looks like your corrupt Hildabeast hasn't paid em either. Oh and why don't you ask the Haitians how much of that Clinton Foundation windfall made it to the Haitians. You liberals are absolute blind sheep. Don't you think if Trump broke any tax laws that Obozo's IRS henchman Koskinen would have taken him down already? Can't you leftist idiots run a campaign on pressing issues of the day rather than ad hominem attack and character assassination? Oh, I forgot you can't cause you fools have nothing other than soap opera drama. Hey, did ya hear Kardashian got jacked in France today? Bwahaha, such useless idiots, the lot of you!","post_message":"Contrary to Trump's claims, undocumented immigrants contribute roughly $11.64 billion in taxes every year."},{"comment_id":"543375892529200","commenter_b":"She wouldn't survive!","commenter_a":"She should go to Sinaloa, they've been purging for a couple of years now, plenty of Mexicans to choose from there","post_message":"\"I would kill as many Mexicans as I could in one night.\"  A waitress, who was apparently upset that a customer didn't leave a tip, has been fired after she tweeted a racist comment."},{"comment_id":"1505305382822543","commenter_b":"Well i guess that's better than a illegal immigrant..","commenter_a":"Don't judge maybe that's his girl","post_message":"At least both the driver and the \"passenger\" were wearing seat belts."},{"comment_id":"10153683983505575","commenter_b":"This country is OWNED AND RAN by Muslims.... Obama will make you accept Terrorist Muslim Refugees... There is nothing you can do about it,,, UNLESS YOU FIGHT his Civil war ( Marshall Law ) he is forcing upon you..","commenter_a":"I think it time .... all the state stand up to penis head... fight for our freedom of speech and rights to bear arms.... protect our U.S....","post_message":"BREAKING. . . ."},{"comment_id":"496956050512713","commenter_b":"THEY SHOULD KEEP WALKING BACK TO THEIR COUNTRY .... IN OTHER WORDS ...... GTFO OF AMERICA !!!","commenter_a":"Feel free to walk back to where you came from!","post_message":"If you don't respect our country, feel free to leave.  'LIKE' if you think they should leave!"},{"comment_id":"10157199868050354","commenter_b":"THE WALL, THE WALL, THE WALL........TRUMP 2016 !!!","commenter_a":"To our Canadian friends and partners. We know you watch the going's on in the U. S. sometimes even better than we do. The time is drawing near for this country to rectify its self. Please stand by and give assistance when needed to those involved. Thanks and good luck up there with your country. Hey.","post_message":"Wow."}]
