[{"comment_id":"10153855259970329","commenter_b":"So the same saying goes if a female swimmer ... participated with the same enthusiasm. .. in a common wealth games ... yeah menstural blood after all ain't unhygienic. .. its holy","commenter_a":"It's not about it being shameful, it's about it being a private thing. Like going to the bathroom is a private thing.","post_message":"“We’re the ones having a period and we’re the ones having to pretend it doesn’t exist.\""},{"comment_id":"1065854716799003","commenter_b":"It looks like a piece of food. Im a Trump supporter. I think these stupid battles between the two are immature and I think making this some huge talking point in the world is exactly why all of us keep electing the wrong people. We care more about a piece of food on someones face then what theyre actually saying. I don't like Cruz. my money is on Trump all the way but we need to all grow up and look at the issues because this isnt Saturday night live. This is real life and the wellbeing of many people is at stake here.","commenter_a":"What about Father's Rights Movement and an overhaul to how child custody and parental time and child support are handled? If elected is Mr. Trump looking at this issue?","post_message":"We will save over $300 billion a year if we properly negotiate our healthcare expenses! #GOPDebate"},{"comment_id":"1068974126482547","commenter_b":"@username, that is so true! WHORES ARE NOT WOMEN!","commenter_a":"Obama by far has been the worst president this country has ever had. He put America straight into the crapper. If Hillary gets elected she's going to pull the handle.","post_message":"We need to elect men and women who uphold the Sanctity of Life!"},{"comment_id":"1857403831172162","commenter_b":"If brains were dynomite these broads couldn't blow their tampx loose.","commenter_a":"Reality sometimes is in our face This just the beginning","post_message":"Classy!"},{"comment_id":"10153076397462452","commenter_b":"Yikes!!! Kill it with fire before it rapes again.","commenter_a":"Why do child molesters look so child molestery?","post_message":"A former drama teacher at Sycamore Junior High School in Anaheim has been arrested on child molestation and child pornography charges. @webpagelink"},{"comment_id":"499057813618132","commenter_b":"just a rich, fat, black bitch","commenter_a":"Sick idiot","post_message":"Oprah is going after white people on live television. The hypocrisy is overwhelming. We need to show her we're not going to stand for this. Do you agree Oprah is a racist?"},{"comment_id":"10153071705477093","commenter_b":"^ Alex I almost did but I knew she as well as many others wouldn't grasp that concept.","commenter_a":"\" AGAINST HATE\" in Dallas,Texas SEPTEMBER 14, 2015- MONDAY At the American Airlines Center At 5:30pm....all those that want to stand against hate are welcomed. march to the... American Airlines Center In Victory Square...from Cathedral of Guadalupe Off Ross St in Downtown. Police Department will be on site but I would like to note that everyone should be very cautious & on guard. There have been reports that peaceful protesters have been attacked by Trump supporters & some dressed like protesters & assult others within the crowd & reported spitting in their faces. Have your groups be alert & camera rolling just in case, if this happens, attackers can be on record & prosecuted! Thank you everyone & remain peaceful yet boldly stand for Justice. Arm & Arm. Wearing Red,White & Blue colors.","post_message":"A \"Dump Trump\" rally is now scheduled ahead of Trump's rally in downtown Dallas tomorrow."}]
