[{"comment_id":"10154025197726717","commenter_b":"She leaked information about innocent people being murdered!!! I see nothing wrong with that!!!","commenter_a":"Fuck her, she leaked secrets. It's against the law, doesn't matter how you identify or what's between your legs","post_message":"Manning recently asked President Obama to commute her sentence, and supporters worry what a Trump presidency will mean for her."},{"comment_id":"10153378197295950","commenter_b":"go home please","commenter_a":"When will she realize she is in the wrong party for the rights of women and minorities?","post_message":"\"I have battled breast cancer,\" Fiorina voice says in the ad as clips of the candidate at various campaign events play out. \"I have buried a child. I have read my Bible. I know the value of life.\""},{"comment_id":"995099337179781","commenter_b":"Crazy dumb old witch.","commenter_a":"I think democrats are more like terrorist. Terrorist maim and tear people's bodies apart. Democrats do the same thing to unborn babies by allowing Planned Parenthood to Harvest baby body parts. As far as I know no terrorist organization sells body parts. Guess that makes Democrats and Hillary Clinton worse than terrorist.","post_message":"BREAKING: Hillary Clinton says GOP candidates are like terrorists because they're...pro-life?"},{"comment_id":"1053937954629059","commenter_b":"Crystal...I'm beyond sick of those trifling girls.","commenter_a":"Who cares???...I'm so sick of B news","post_message":"Un-Clutch Your Pearls: Beyoncé Has Nothing To Do With The Sarah Baartman Project @webpagelink"},{"comment_id":"10157147438325354","commenter_b":"Mariah, pull your panties out of your crack.","commenter_a":"LOL Calvin Klein clothing. Made for dainty feminine pajama boys with no shoulders and 24\" waists.","post_message":"Kendall Jenner, the lurid Calvin Klein PHOTOS, and the major PR backlash..."},{"comment_id":"10154534078174445","commenter_b":"I know. Is that close to where you live? It's scary","commenter_a":"Sharon Leahy-Lind Elizabeth Lind","post_message":"Imagine you're enjoying a day in the woods, walking down a trail when you see THIS: a large snakeskin. @webpagelink"},{"comment_id":"1346164815479767","commenter_b":"She will not ever be our president","commenter_a":"The Department of Justice is now the Department of Clinton. The FBI are just employees of Clinton also. Do not trust the FBI. Join your local militia! Support your 2nd and 1st amendment. Remember Hillary Clinton is everyone's enemy and all Liberals are animals and terrorists. The North should have there own country. The South and Midwest our own also. Liberals can't be trusted. Liberals are not patriots.","post_message":"BREAKING: Here are the NBC News presidential race updates for 8PM ET poll closings @webpagelink #Decision2016"}]
