[{"comment_id":"1234200423314954","commenter_b":"Yes they are I seen it. \"All white people to the back of the line\"","commenter_a":"It is! People need to get over it. Standing on freeways and burning buildings is not the answer!","post_message":"Do you support or oppose anti-Trump protests?"},{"comment_id":"10153181342983812","commenter_b":"I do agree not to go looking for trouble. Often times, ya get more than ya bargained for ;)","commenter_a":"You can not go looking for trouble, find it, then decide you don't want said trouble. Its already too late!","post_message":"Relatives held a candlelight vigil to honor the life of Tammy Meyers. @webpagelink"},{"comment_id":"10153081593500090","commenter_b":"She is also a terrible so called human being !","commenter_a":"esta esta mas choteada que cantante desafinado","post_message":"She may be hiding emails, but there's no hiding this fact: Hillary Clinton would make a terrible president.  Tell us WHY you don't want another Clinton in the White House: @webpagelink"},{"comment_id":"1673100576267383","commenter_b":"Happy Birthday Goldie, what a delight you have been over the years!","commenter_a":"Yep, gotta love our girrrrrl....","post_message":"Happy birthday, Goldie Hawn!"},{"comment_id":"10152702377667869","commenter_b":"Praying that God leads you to serve in the best way possible.","commenter_a":"We will miss your show","post_message":"This evening I wanted to share with you some news that is very personal to me.  Because you have been such a good friend and a strong supporter of all my efforts, I wanted you to know first that tonight I will do more than just say goodnight on my Fox show.  I will say goodbye.  This is the last edition of Huckabee on the Fox News Channel. It has been the ride of a lifetime, and I have never had so much fun in my life. But I also realize that God hasn¹t put me on earth just to have a good time or to make a good living, but rather has put me on earth to try to make a good life.  There has been a great deal of speculation as to whether I would run for President.  I won't make a decision about running until late in the spring of 2015, but the continued chatter has put Fox News into a position that is not fair to them. The honorable thing to do at this point is to end my tenure here at Fox so I can openly talk with potential donors and supporters and gauge support.  As much as I have loved doing the show, I love my country more, and feel that it may be time for me to leave a zone of comfort to engage in the conflicts that have almost destroyed the bedrock foundations of America.  I feel compelled to ascertain if the support exists strongly enough for another Presidential run. So as we say in television, stay tuned!"},{"comment_id":"1593060860989996","commenter_b":"Thats how they want America ....in a trance.","commenter_a":"May I suggest Sarah Palin as a running mate? We've heard that she not only supports you, but offered her services :)","post_message":"You could tell Donald J. Trump knew the debate went badly by the way he barreled into the \"spin room\" last night, immediately disavowing things he'd said in front of more than 80 million people just moments before. The back-peddles and lies have only grown more mystifying in the hours since."},{"comment_id":"683462628486873","commenter_b":"Thank you for sharing!!","commenter_a":"Every time I attend a sporting event in our great country it infuriates and saddens me at how many \"Americans\" won't remove their hat or stop what they are doing while the National Anthem is played. Well done Mr. Bolt! Thank You for your great respect!","post_message":"A great American..."}]
