[{"comment_id":"10154575281024877","commenter_b":"Melania looks like Caitlyn Jenner. !! !!","commenter_a":"Jobin, I fell the same way sometime it takes something to open her eyes maybe this is it","post_message":"This is one of the main reasons we need to stop treating Melania like a helpless victim."},{"comment_id":"886270021416239","commenter_b":"This is not good! We should close our borders for all foreigners indefinitely until further notice.","commenter_a":"Hey Rachel suck my cock","post_message":"A growing Muslim population in the U.S. is raising concerns that the nation could be at increased risk for instances of Islamic extremism in coming years. @webpagelink"},{"comment_id":"954338344712964","commenter_b":"Idiot she has no place in the white house","commenter_a":"When her Secret Service Protectors lay down their guns, I will lay down mine.","post_message":"Hillary Clinton made the case for the United States to implement tougher restrictions on gun purchases following the terror attack in Orlando. @webpagelink"},{"comment_id":"785040181594590","commenter_b":"Lol...let's put all small business out of business because no skill workers want to get paid what skilled labor is paid..country is going to hell and fast","commenter_a":"I don't think a fast food employee should get $15. Maybe $8 start out and earn your raise, but not $15. If you want to make money in the food industry, become a server. Yeah, we make $2.13 and hr (yes our minimum wage hasn't changed in DECADES) but I work part time for full time pay as I call it. I work 3-5 hr a day which give s plenty of family time and can make $15+ an hr from tips off the table. That is how we pay our bills for those of you who feel tipping is dumb. My $2.13 pays the taxes and the smallest check I've gotten was 10 cents, some don't even get checks.","post_message":"\"We need you out there leading the fight ...\""},{"comment_id":"10154587626459411","commenter_b":"holding a sign for 20 minutes ,","commenter_a":"Mishelle obama cares for them, #bring back our girls :D","post_message":"'No one cares for us'"},{"comment_id":"10153132255848145","commenter_b":"Thank you Rachel Payne Nunlist! :)","commenter_a":"I'm sure I will get major flack for this, but the older kids were 10 & 8!!!! Why don't they OPEN THE STUPID DOOR??? I'm not saying the mom was right, the kids could have for sure been taken, but for heavens sake, 10 & 8 is still 10 & 8 when it comes to a hot locked car!!!","post_message":"When a passerby found three young children alone in a locked car, police were called. The children's mom was found a few minutes later in a tanning salon. Here's what happened: @webpagelink #wftv"},{"comment_id":"10153564798429614","commenter_b":"Don't crucify this jesus but put his head on a rope and pull him on a tall tree. Hope am communicating?","commenter_a":"Another senseless act of violence, may the victims RIP","post_message":"Two parents were killed and their daughter wounded when they stopped to help a man who appeared to be having car trouble on a road inside a Montana reservation. When the family approached Jesus Deniz Mendoza, he pulled out a gun and ordered them out of their car, the surviving daughter said. He then told them to walk away from their car. As they turned to leave, the daughter heard a gunshot. She looked back and saw her father lying in the road, she said. The next shot killed her mother. The third shot hit her in the back. Mendoza said he the victims because he was getting tired of waiting around, and because the daughter laughed at him, the criminal complaint says. Read KTLA's story here: @webpagelink"}]
