[{"comment_id":"10153466611918635","commenter_b":"Amen","commenter_a":"Amen, aleluya","post_message":""},{"comment_id":"10153725146380667","commenter_b":"no one cares I'm tired of heading about him","commenter_a":"People get punched in the face everyday.","post_message":"“He said he was going to kill me.\""},{"comment_id":"1661235427481336","commenter_b":"We need the wall Canada has a wall but i forgot all the famers might lose there free lador","commenter_a":"hahaha... a very accurate comparison! Lol.","post_message":"\"On Feb. 9, we trust New Hampshire Republicans will send 'Biff Trump' back to somewhere — anywhere but on the road to the most important elective office in the United States at a most crucial time for this nation.\""},{"comment_id":"522564217947920","commenter_b":"Lmao 😂😂😂","commenter_a":"Sanders is turning into John Kasich, showing up to places and losing.","post_message":"\"We're in it until the convention,\" she said."},{"comment_id":"900706196692300","commenter_b":"So, David, share some more of your white Texan wisdom. What is a \"real woman.\" Please, mansplain it to us.","commenter_a":"I still have trouble with why anyone would want to become an elderly woman.","post_message":"\"I think [Bruce] Jenner has a right to do what Jenner wants to do, and the way Jenner wants to do it.\" -Jeffrey Tambor"},{"comment_id":"10152901034836636","commenter_b":"Karina a poopoo head","commenter_a":"Great! Don't terrorize kids! Be the adult. Do your job and treat everyone equally. Don't only attack the black kids.","post_message":"This just in: That Texas officer videotaped outside an pool party has reportedly stepped down from the police force."},{"comment_id":"10153435038829753","commenter_b":"tape her mouth","commenter_a":"KARMA is a BITCH....BITCH....I must say YOU are One SORRY ASS LOW LIFE BITCH .....I CAN'T STAND PEOPLE THAT ARE CRUEL TO ANIMALS.........If YOU are CRUEL to a Dog.. There's no telling what YOU might do to a Person....","post_message":"With over 100-thousand shares as of Saturday morning, Katie Brown, the woman who taped her dog’s mouth shut to stop it from barking, has still not removed the photo she took of her canine-reprimand off of her Facebook page. The photo has reportedly caused a flood of phone calls to the police station in South Daytona, Florida, where the woman’s Facebook account says she is residing. “This is what happens when you dont shut up!!!” That is the caption of the photo post Katie Brown put on her... @webpagelink"}]
