[{"comment_id":"1113705405389179","commenter_b":"Why do we have 400,000 permanently disabled Americans? Oh because of the 2,996 people killed and more than 6,000 injured during 9/11? So we lost more Americans in good health because war mongers like Hillary Clinton wanted to strike back? Thanks Hillary for your vote on the Iraq War.","commenter_a":"Thank you, Obama...we love you as a President!","post_message":"Excellent news for 400,000 Americans!"},{"comment_id":"903300846390748","commenter_b":"Shoot her, her life does not matter here","commenter_a":"All lives matter, but standing on the flag is WRONG","post_message":"REPULSIVE: [VIDEO] WOMAN WALKS ON AMERICAN FLAG AT #BlackLivesMatter PROTEST, As US Service Members In Uniform Turn Their Backs On Her"},{"comment_id":"10153400550747042","commenter_b":"Good thing those girls were white, if they were black they probably would've been arrested","commenter_a":"The cops are doing their job! These girls are breaking the law. Now let's give the cops a big round applause (being sarcastic)","post_message":"KIDS' STAND SHUT DOWN: They were trying to earn money to buy their dad a special gift for Father's Day."},{"comment_id":"788040247961250","commenter_b":"you were pounced on by women....","commenter_a":"I feel so sorry for him. When did we as a people become so cynical, unfeeling, intolerant and belittling. He made an old person's mistake - we old farts are often out of sync with the modern culture - it's not a crime. Did anybody consult the women he worked with before they dumped him??","post_message":"\"They haven’t even bothered to ask for my side of affairs.\""},{"comment_id":"1776292422637356","commenter_b":"I think that Donald Trump needs to demand a conservative moderator for the next debate or refuse to debate. He needs to demand to get the questions ahead of time like Hillary(doesn't need them). Oh yes, and be able to wear an ear piece and get fed all the answers(not that he needs them). He also needs to learn the hand signals(doesn't need them either). Play that wicked game better that that witch!!!! Do not let her rig another debate, or pay off the moderator. Do not get on the defense or let her get off by not answering for her sins. Be hard on her in this next debate and bring out all her skeletons. The media will continue to make you out to be the bad guy but America is not stupid and this deplorable is behind you!!!!","commenter_a":"TRUMP","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"},{"comment_id":"907515899315838","commenter_b":"Thought it was Vermont?","commenter_a":"And yet the latest FBI Uniform Crime Report shows that Maine is the safest state in the US. Hmmm...Coincidence?","post_message":"They're quarantining themselves!"},{"comment_id":"10154407674347756","commenter_b":"Muzzie lover go eat crap","commenter_a":"key word temporary oh maybe we republicans should go burn a few cities down now too and a few police cars right! Hmnnn oh thats right we like law and order imagine that.. Good things take time go TRUMP go we have your back...","post_message":"A Federal Appeals court Thursday evening ruled against the Trump Administration’s controversial transportation order, upholding a district court judge’s ruling to block the order."}]
