[{"comment_id":"10153434470306323","commenter_b":"Vahan alko tanssijalkaa vipattaa :D","commenter_a":"Nora ootkos tanssinut taas?","post_message":"Five passengers were injured after a train derailed at Mumbai's Churchgate station on Sunday. CCTV shows the local passenger train crashing into the barriers and partly mounting the platform. Officials have blamed human error for the incident."},{"comment_id":"1678937325726713","commenter_b":"Prayer is on the way","commenter_a":"Prayers for Ava. Willie Nelson is GREAT!!","post_message":"Please spread this and send your prayers."},{"comment_id":"1150655941656075","commenter_b":"@username SUCKER !!!","commenter_a":"We wish no illness upon Secretary Clinton, but the reality is if she steps aside and you become the nominee, the democrats will win the White House with a double digit lead. If she decides to be selfish and stays in, Trump will win. #bringbernieback","post_message":"The United States has the duty to guarantee equal opportunity and justice for all citizens, including our Native American brothers and sisters. And let us be honest and acknowledge that we are not doing that today."},{"comment_id":"10153669076314641","commenter_b":"Stop immigrant in Europe","commenter_a":"ISIS/ISIL/ the so called religious GROUP they r not MUSLISMS they created by americans & isreal 2 blacklash islam! ABOUT JAHADY JOHN as his from where he born said AN \"ANIMAL A DOG\"","post_message":"\"Jihadi John,\" who may have been killed in a U.S. airstrike, is a Kuwaiti-born, middle-class Londoner."},{"comment_id":"1269332673102189","commenter_b":"Becky, RAISE YOUR HEAD UP OUT YOUR BOYFRIENDS LAP, CHILD!","commenter_a":"Sorry but safety of USA citizens comes before everyone else!! This is All on Obumfuck!","post_message":"The youngest Nobel Prize winner says it perfectly."},{"comment_id":"10153054434811051","commenter_b":"So sorry he killed himself. The creeps that haunted him should all be rounded up and put in jail.","commenter_a":"Well I hope those bullies are proud of themselves. ...they know who they are and they all have blood on their hands. KIDS.... BE CAREFUL WHO YOU BULLY....THAT PERSON MAY BE YOUR BOSS SOMEDAY! In school everything that happens seems like its life altering end of the world BS. Guess what....it's just high school....life goes on....nothing is worse than suicide. ...sometimes the worst thing that happens turns out to be the best thing.","post_message":"This boy loved hunting and trapping, and other students made fun of him all the time for it. He just couldn't fit in with them. Eventually it became too much."},{"comment_id":"726323540858316","commenter_b":"Meryl shut your hole, no one cares what you have to say. Matter of fact put your money in California and pay their way. You are a dried up old hag from the movies and you didn't get their by yourself. We put you there. Get the hell over it and go get laid. LOL you probably can't even get that.","commenter_a":"Dodo. She will not only in be hibernation but soon will be extinct","post_message":""}]
