[{"comment_id":"1701436866776634","commenter_b":"Tell hr to quit being one then","commenter_a":"PAC Lapdog","post_message":"You heard about the whole \"whore\" comment, right?  Well, after Dr. Paul Song said it, the hashtag #DemocraticWhores began trending..."},{"comment_id":"10153825781392522","commenter_b":"There goes the fake Native American vote!","commenter_a":"Another documented lying Democrat fanning the flames. STFU Pocahontas","post_message":"\"We will fight harder, we will fight longer and we will fight more passionately than ever.\""},{"comment_id":"897196563636468","commenter_b":"Nailed it! Being as, I saw this last night and asked, who is this woman!","commenter_a":"Funny how Kelly Clarkson's known over a couple of continents, yet what's her face has never been heard of over here.","post_message":"Some people wait a lifetime for a comeback like this  well done, Kelly Clarkson."},{"comment_id":"10153092087111438","commenter_b":"Ha! You said it before I finished my statement.","commenter_a":"It's very obvious what happened here, it has been right from the start. This plane was intentionally driven into the ground by one of the pilots on the plane. This was very clearly a suicide/mass murder. Sadly, this is not the first time a pilot on a major airline has done this either. We are going to need to start doing a FAR better job of digging deep into the backgrounds of the pilots that we entrust to fly our major airliners going forward now. Or, we are going to have to start piloting these planes remotely from the ground and only using on-board pilots as a back-up in case the remote piloting system fails for some reason.","post_message":"A bit of eerie evidence has turned up on the cockpit voice recorder from the Germanwings flight that crashed into the French Alps this week."},{"comment_id":"10153359134519060","commenter_b":"Oh! You are a geographer or a history specialist Scott. Sounds good. For sure you know Europe is more than UK, Latin America is more than Mexico, and that Egypt is in Africa. Glad to know you really understand the reality and the specifics outside US. It is rare.","commenter_a":"When I read \"Latin America\" as a generalization in an article, I tend to be skeptic. You can not compare Guatemala with Chile, Argentina with Mexico. Completely different cultures, histories, corruption level, etc, although all of them are Latin American countries.","post_message":"Crisis in Guatemala: the vice-president quits, the heads of the central bank and social-security institute are arrested and three ministers sacked. Corruption scandals are two-a-penny in Latin America. Few inflict this much damage @webpagelink"},{"comment_id":"1324643474244952","commenter_b":"Do you need money?","commenter_a":"We're going to get back at a companies CEO for endorsing a different candidate by buying their product! Genius! I'm a registered Democrat. Why don't you throw some money at me while you're at it. Morons.","post_message":"Supporters of Donald J. Trump are getting back at Starbucks but putting the President-elect's name on the company's cups and filming any barista who refuses."},{"comment_id":"604853703036255","commenter_b":"HOW she could stand there and openly lie to those families is just beyond me!! That is one dangerous woman!!","commenter_a":"People will still vote for her. Don't they know what a evil heartless lying phony she is. Here we have a vet who knows the truth she left those men to die despite numerous calls for help none came under her watch. She lied about the video not only to Americans but she lied straight to the faces of the victims families. She knew it was a planned attack that night but no she went to bed and I'm sure she slept peacefully. But as she yelled at the hearings \"What difference does it make.\" Her supporters should watch this over and over this will show her true colors.","post_message":"He exposed Hillary!!!"}]
