[{"comment_id":"10152908039036491","commenter_b":"Exactly mark. What about people who use PED's? Where is that integrity?! Why isn't their team also punished? Wes Welker violated those rules with Denver. But it got retroactively sustained due to rule changes. Are you kidding?!?!","commenter_a":"In the end his punishment had nothing to do with deflated footballs. It was for behavior detrimental to the integrity of the game and the league. Read the letter to Brady explaining his punishment. Accountability goes a long way, too bad tb, belicheck and Kraft don't know the first thing about it.","post_message":"More bad news for Tom Brady."},{"comment_id":"10152758880516636","commenter_b":"Would it mean I get to touch a woman?","commenter_a":"No i would get stage freight","post_message":"Who actually volunteers to have sex in a laboratory?"},{"comment_id":"10153173112591130","commenter_b":"Still wished the lowlife bitch had fallen and broke her neck 😁😀😀","commenter_a":"Lol what a retard she is. Her stupid tail is in jail has to pay a large fine ( I'm sure she's part of millions living off working people so it won't matter to her ) and the flag was raised again. Great to see the flag rise again","post_message":"\"We removed the flag today because we can't wait any longer.\""},{"comment_id":"1759120751072019","commenter_b":"I don't want refugees coming in and I want Muslims out","commenter_a":"Wear a Make America Great Again hat! Fuckem!","post_message":"This was powerful!"},{"comment_id":"618837121600063","commenter_b":"bitch","commenter_a":"Donald Trump is beginning to understand why they did want him involve, right? @webpagelink","post_message":"Paul Ryan is a ___________."},{"comment_id":"10152963225776135","commenter_b":"I don't have daughters. I have sons. I teach them to keep their hands to themselves. When they're old enough to date, they'll be taught not to touch a woman unless invited. We shouldn't have to tell girls how to not get raped. We should be teaching our boys to not rape.","commenter_a":"When I was becoming old enough to go to parties as a teenager my mother started giving me the heads up about how to act when I went to out. One of the things she taught me was never drink so much that you lose control of yourself, watch who you accept drinks from, don't go to rooms with beds with men, etcetera. I'm curious as to what other mothers tell their daughters? And as a mother of sons around this age I wonder why the guy gets charged with rape if they're both drunk? Doesn't seem quite right to me.","post_message":"Former Tigers pitcher Evan Reed has been sentenced to probation after accepting a plea in his assault case. The victim strongly objected to that plea in court. VIDEO here: @webpagelink"},{"comment_id":"10154261503546770","commenter_b":"Hollywood is full of whores!","commenter_a":"Omg. It's just a dress! Didn't your mothers teach you that if you don't have anything nice to say, don't say anything at all!!! Looks like you could all use a lesson in kindness!!","post_message":"Holy moly, Jennifer Aniston."}]
