[{"comment_id":"1084755811580947","commenter_b":"She well be Charming President .","commenter_a":"Unless Democrats want to see President Obama hand over the keys to the White House to Donald Trump, we Bernie and Hillary supporters had better start aiming attacks at Trump and the Republicans, and not at each other.","post_message":"'She cares. She tries. She perseveres. And now she has a chance to tell the story she’s always wanted about America: the story about a country that found the courage to turn away from our darkest impulses; that chose to embrace our growing diversity as a strength, not a weakness; that pushed the boundaries of opportunity outward and upward, until there are no more barriers, and no more ceilings.' —Jon Favreau, President Obama's former speechwriter"},{"comment_id":"10153709197621336","commenter_b":"Was he having a stroke?","commenter_a":"Billynyvy Martinez","post_message":"WATCH: One Southwest Airlines employee could barely get through his safety spiel without nodding off and slurring his words."},{"comment_id":"1875772702705471","commenter_b":"These hoes aint loyal","commenter_a":"'@username 😴","post_message":"So messed up  #WSHH"},{"comment_id":"1222948041117063","commenter_b":"Grow some balls bitch!","commenter_a":"You look redickuselse's.........","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"827935373908552","commenter_b":"A straight shooter, she would do this country good","commenter_a":"Barack Obama is NOT furious about anything Sarah Palin does or says; he is the President of the United States, and she is a moron.","post_message":"Sarah Palin lays into Obama for this reckless call!  Do you agree with her?"},{"comment_id":"638889179634994","commenter_b":"Fat hoes crack me up","commenter_a":"Yep. Fat people shouldn't fly","post_message":"This airline is not going to allow people who weigh too much to fly on their plane.  They have absolutely no right to subject us to this.  Do you think this is out of line?"},{"comment_id":"1097246043649586","commenter_b":"'@username @username - that is still land grabbing of a different sort. Basically they can't use it for their cattle if it is protected for other wildlife. And they can't shoot the wolves that might harm their cattle because it is public land. (or they should not be allowed to). The deal is - for any business (including ranching and farming) there is risk for loss. The ranchers just don't want there to be any loss for them. But that is tough. That is life and that is business.","commenter_a":"Seriously amazing. .. I don't understand why they are so hell bent on getting rid of wild horses. . They are beautiful and majestic animals ... and for this woman to try to recreate that atmosphere for these rescue horses is astounding! !","post_message":"A sanctuary in Oregon lets rescue horses live our their lives in comfort. (via Places To See Before You Die)"}]
