[{"comment_id":"10152942942461130","commenter_b":"You'd call them 'girls with their vaginas hanging out, ass showing and everything else.' Cool ?","commenter_a":"Good. This needed to happen.","post_message":"Um..."},{"comment_id":"10152777670593525","commenter_b":"Hahaha she can do it, especially since she has that walker she'll smoke that nigga","commenter_a":"'@username Xana Smith @username Alice needs to get on her grind! Lol","post_message":"95 years old and still setting records on the track…"},{"comment_id":"1242442195775531","commenter_b":"Some people like me are deathly afraid of spiders!!! Black widows can kill people!","commenter_a":"These foods are from plants. They grow outside on a farm. There are bugs and animals outside. Bugs crawl on plants! Good grief. Dump your produce in a colander in the sink and wash it.","post_message":"YIKES! A Bothell woman tells KIRO 7 she found a black widow spider hiding in her package of grapes.  Gary Horcher is talking to the woman, who has a warning for shoppers. >> @webpagelink"},{"comment_id":"902494896546891","commenter_b":"I told you I was going to get her out","commenter_a":"'@username she's a chunk! Pictures were a lie! 😁 She's out @username lol","post_message":"Our camera caught the middle school teacher who reportedly got pregnant during an affair with an 8th grader as she left the jail. We had questions, but she didn't have any answers. Full video: @webpagelink"},{"comment_id":"10153571607004411","commenter_b":"Fuck you Kike hook nosed cunt","commenter_a":"Just a usual palestine jewhating fascist lmao, good way of solving the problem Canaan belongs to nobody, especially not to muslims","post_message":"'My hope is that at some time, [Israel] is no longer there, but only Palestine'"},{"comment_id":"1072164979509916","commenter_b":"If sash doesn't get picked","commenter_a":"I'm so done ffs @username","post_message":"The Bachelorette Australia favourite and Sam just happen to holiday in the same place at the same time   (via Daily Mail Australia)"},{"comment_id":"1554600804845563","commenter_b":"Only way undocumented immigrants get benefits is if they have a usa born baby...they get benefits from the kid since the baby is a us citizen.","commenter_a":"They are so scared and desperate of losing their welfare and EBT cards and being deported , they know Trump Is For Real they know he means business..... so the last resort they have is they think they can scare America's law abiding citizens from attending perfectly legal, legitimate rally for the candidate of their choice which is 100% in their right to do. These people are not protesters, they are rioters, violent disrespectful, criminal thugs. The main stream , elite owned media is not reporting on this, you will not hear Hillary Clinton tell the Democrats or anyone outside of trump rallies to stop the violence, they support this, they support black lives matter. As long as they feel it is helpful to their side especially Hillary, (getting in the White house will keep her from going to jail), they will let it continue. If it was the other ...","post_message":"WATCH: Trump rally riots - supporters attacked by a mob of protesters at a rally in California."}]
