[{"comment_id":"1656739891212938","commenter_b":"JJ Fuller Jeffrey Kalmonson Jojo Stewart","commenter_a":"Those who are caught in the left/right paradigm are often not ready for critical thought and the unforgiving truth. If you agree please comment (even 2 words) and share! (y)","post_message":"Free minds, free people.. this world needs more of them Follow: The Free Thought Project.com #B2TF"},{"comment_id":"1641203876178008","commenter_b":"God Bless You PRESIDENT DONALD J. Trump","commenter_a":"I called illinois state election they didn't do anything","post_message":"WATCH #LIVE: Donald J. Trump speaks at his second event on #Halloween at a rally in Warren, Michigan."},{"comment_id":"10153824144307235","commenter_b":"These Kurdish Women have more Balls than these Idiots...","commenter_a":"Give dad and son some boots and send them to iraq","post_message":"The photo was rejected because school officials believe “it promotes violence and breaks federal and state law.”"},{"comment_id":"1690646117862352","commenter_b":"Yes. She's milking it like she used to milk her moms boobs lmao","commenter_a":"@username Jacob Nowell @username aww sky used to do this shit lmao","post_message":"Wouldn't you want a nice massage from this cat too?"},{"comment_id":"444002905787317","commenter_b":"I wish someone would shoot that muslim nigger","commenter_a":"Unfortunately, the mass shootings will continue in the USA as long as the NRA continues to have such a strong influence, through its lobby, with the Republican Party in control of Congress. So many simple steps could be taken...background checks for instance or the banning of multiple-firing weapons ( one doesn't need a machine gun to kill Bambi! ) but the Republicans in Congress blocked even the discussion of background checks the last time it was brought up. With such intransigence in not even allowing discussion of the issue, I am afraid that no gun control law will be passed. President Obama is right to be furious as I am. As an American, I feel distressed, angry and frustrated but also, sadly, resigned. It is simply a matter of time until the next mass shooting. PS: Fewer than half of all Americans actually own a gun but those who do ...","post_message":"President Barack Obama is furious. Watch as he addresses the nation after another mass shooting. At least 10 were killed and 7 injured in a shooting at a community college in southwestern Oregon."},{"comment_id":"10154620951999714","commenter_b":"Phelps and Beyonce can go both choke on razor blades.","commenter_a":"And more","post_message":"Beyoncé, Britney Spears, Rihanna, Michael Phelps and more! #VMAs2016"},{"comment_id":"10153190313663984","commenter_b":"Get the bitch away from our kids school's.","commenter_a":"She fills up on bananas! Hard to keep her out of the tree!","post_message":"Ouch - Michelle Obama will not be happy to hear this. Are you sick and tired of the Obamas telling us all how to live?"}]
