[{"comment_id":"1171399196245487","commenter_b":"She's better than me!..step into my personal space uninvited and your eye will get dot!!!","commenter_a":"Where's the guy in the 8 ball jacket when you need him???","post_message":"A racist Trump supporter went ballistic on a black subway passenger in NYC. #MicBrights"},{"comment_id":"10153960643118984","commenter_b":"Just take ur stinking ass and ir ugly ass women with u","commenter_a":"You all need to vote ... get rid of this crap ....","post_message":"I can't imagine what this woman must have felt when this Muslim cab driver did this... Do you support this judge's decision?"},{"comment_id":"2471637393058961","commenter_b":"@username still better than that lying bitch you voted for","commenter_a":"Why do you guys keep asking the same stupid question...I guarantee you no one on the right has changed their minds...now maybe some on the left came to their senses","post_message":"Would you like to see this duo in the White House again?"},{"comment_id":"10153246280989411","commenter_b":"Why there is nobody helping Palestine. Come on Russia or China. Could you plz give Palestine nukes. Let those two countries to finally start playing a little more realistic games.","commenter_a":"So they are trying to destroy them............fuckers...","post_message":"'Israel cannot maintain military control of another people indefinitely.'"},{"comment_id":"10153736965291336","commenter_b":"She dosen't know what she's talking about .Shout up !!","commenter_a":"Think she's irrelevant at this point","post_message":"\"Every single Republican candidate for president is against marriage equality. Every one of them. Many of them are against anti-discrimination laws. Many are against same sex couples adopting.” – Hillary Clinton"},{"comment_id":"1081696675193718","commenter_b":"Y.e.s. lol","commenter_a":"@username is this the lovely place you worked?","post_message":"Thanks to #KPRC2 viewer Harold K. for this video of a manhole cover flooding outside the Houston Museum of Natural Science. Live coverage --> @webpagelink Radar --> @webpagelink Photos --> @webpagelink"},{"comment_id":"10154780331641072","commenter_b":"Nm wait for her to have this baby lmfao","commenter_a":"Exactly Kelly","post_message":"Giraffe Watch: Is today the day? April the giraffe at Animal Adventure Park is expecting a calf anytime. More: on.kgw.com/aprilgiraffe"}]
