[{"comment_id":"10155155813577642","commenter_b":"Yes my last name is Perez, so what. My family and I aren't afraid because they did it the right way when coming over, they obeyed the law! No matter what ones last name is we are all immigrants, but there is a difference between immigrants and illegal immigrants. So sad that many people people don't realize the difference like yourself.","commenter_a":"What part do you all not understand or haven't read??? She entered the United States illegally November 2015!!!! Judge ordered her out of the US on January 26th. She broke the law!!! Yes it's sad that she MAY have a brain tumor but even the doctors have said they aren't for sure that it's cancerous. Doctors have cleared her medically to be discharged from the hospital in a stable condition! She had a medical episode on February 11th but once again got discharged from the hospital! So what makes this case \"non humane\" that you all speak of?!?!? She has broken the law, she has gotten medical help and was released from a medical team outside the detention center. Nothing inhumane going on!","post_message":"An undocumented 26-year-old woman from El Salvador who has a brain tumor was moved from a hospital to an ICE detention center in Texas."},{"comment_id":"1763785047184730","commenter_b":"Nice mouth for a lady?","commenter_a":"and this is supposed to negate every racist, woman hating, derisive thing he's said in the past 9 months???? Fuck off!","post_message":"Do you support Trump?"},{"comment_id":"1004765479656630","commenter_b":"That's no lady. Bigger dick than Barry.","commenter_a":"Disgraceful First Lady","post_message":"Hot diggity dog..."},{"comment_id":"949029821890932","commenter_b":"@username Before you vote for Clinton remember this. a vote for her is vote for a another kilo of heroin across an open border polluting Americans and contributing to more crime.","commenter_a":"If you are privileged enough so that a Trump presidency doesn't matter to you, vote against him for the many people he will take advantage of if he wins.","post_message":"Most Americans, regardless of their political views, do not want to see us go backwards, and are not going to be supporting a candidate for president who has made bigotry the cornerstone of his campaign."},{"comment_id":"1271419419547512","commenter_b":"Lil bitch","commenter_a":"12 jurors acquitted these guys based on the lack of evidence. This had nothing to do with white privilege, they were locked up in solitary confinement while rioters get away with burning down towns.","post_message":"Heavily armed ranchers forcefully occupied a federal building in Oregon, but they got acquitted because white privilege is real."},{"comment_id":"10155157065294749","commenter_b":"Jade Louise Caswell can we go to chicken house again Sunday pls","commenter_a":"Jade Louise Caswell","post_message":"\"He pointed a gun at her head, demanding that she give him a nugget.\""},{"comment_id":"844439005656552","commenter_b":"breaks my heart to see what my son and brother actually see. These people don't just mad out on red and green. When they see anything that has a red or green in it. They don't see it with the colors they can interpret. So nothing is as it should be. You need red to Make purple, purple doesn't appear the way the rest of us see it for them.","commenter_a":"Sylvain St-Arneault","post_message":"Watch people see color for the first time thanks to these high-tech glasses."}]
