[{"comment_id":"10153147518933984","commenter_b":"This guy must be screwing oshithead or he wouldn't get so mad.If he loves illegals so much he needs to go live with the scum.If the illegals get into our country,crime will run rampant.","commenter_a":"Vote the asshole out next term.","post_message":"Who does he think he is to make these kinds of threats?"},{"comment_id":"550962398414284","commenter_b":"2","commenter_a":"Two(2)","post_message":"WARNING: This photo will make you feel like you have forgotten how to count. (via HelloGiggles)"},{"comment_id":"10153227271719228","commenter_b":"If she didn't go to the hospital another couple hours she would have been gone cuz it would have went to her heart it was that close to her heart they caught it in time","commenter_a":"The exact same thing happened to my daughter they went in a Lana ectomy scraped her spinal cord put her in a coma for 2 weeks it took her 2 months to learn how to walk again but she is walking again","post_message":"Her body started to go numb and she lost feeling in her legs."},{"comment_id":"10153302212427439","commenter_b":"All other real religious beliefs will be outlawed !! Muslims don't do real religion ,,!!","commenter_a":"I guess he's all for isis and how shiria law can't be separted from the musilim religion they go hand and hand. And he's all in for this no such thing as islamophobia we can and will protest any genocide against anyone","post_message":"This is full blown sharia in the UK – not only will our ban not be lifted, I would expect more voices of freedom banned. UK: Labour leader says his government will criminalize “Islamophobia”, (thanks to Jihad Watch), April 26, 2015 We are going to …"},{"comment_id":"10154158954704641","commenter_b":"Good luck!!! Wonderful! !","commenter_a":"This is the guy that we need to operate our military","post_message":"He's been attending community college part-time since he was 7."},{"comment_id":"1280033575423027","commenter_b":"She didn't say anything that hasn't been said before.","commenter_a":"The trouble with Trump is he doesn't his rallies long enough to study for the job he is trying to get elected to which is so important. Hillary has the experience plus she takes off for a few days to study what is going on in this country and around the world. Hillary gets an A+ and is definitely ready to take over the Oval Office on day one. Go Hillary!","post_message":"Another right-wing conspiracy bites the dust."},{"comment_id":"10154836011454641","commenter_b":"Muslims should be exterminated..ambassadors of evil!","commenter_a":"And now he funds terrorism, giving weapons to the same people that have just been found to of made a mass grave in Aleppo of civilians. Scumbag.","post_message":"He was broke after running a losing campaign, his credit card was declined and he was quickly losing hope on pursuing a career in politics."}]
