[{"comment_id":"1282583651782104","commenter_b":"People are starting to pee on the streets, into fountains, garbage cans, on car tires, between parked cars, the state is stinking like a outhouse what if confused people take to shitting between parked cars?????","commenter_a":"If you go in the bathroom with my daughter I will.","post_message":"These people are literally threatening murder on a public forum."},{"comment_id":"1781647542076913","commenter_b":"I know that's Ivanka on the right, who's that chick on the left side?","commenter_a":"We need a food addict intervention for Mr. Moore. A good barber, too.","post_message":"Michael Moore is a ____________."},{"comment_id":"10154686785341323","commenter_b":"Clarkson and Mary Berry should do a show together. Cut from the same cloth - she's just quieter about it.","commenter_a":"Wells said sir David. We all love clarkson.","post_message":"Unnatural history."},{"comment_id":"486861261504454","commenter_b":"She wouldn't make a pimple on the queens ass","commenter_a":"YES","post_message":"The Jordanian Queen just put Michelle Obama to shame.  Good. Our first lady is classless. In no way does she represent our country.  Would the Jordanian Queen make a better First Lady?"},{"comment_id":"10154324391116336","commenter_b":"This lady is nuts! His mom just died.","commenter_a":"Whoah not cool. The judge must have seen something he didn't like. :(","post_message":"Amber Heard was reportedly granted a temporary restraining order against Johnny Depp."},{"comment_id":"573913712787669","commenter_b":"Yada, yada, yada. This woman(?) Is so full of BS she makes me ill.","commenter_a":"Get over it!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"697700797087165","commenter_b":"No refugees, there only intent to come here is to bring harm to us and destroy our country.","commenter_a":"Yes..... Take care of our own homeless people","post_message":"The refugee program has resulted in the death of two American soldiers. This is sickening. Should the US deny access to all refugees?"}]
