[{"comment_id":"10156742886720354","commenter_b":"Maybe they will accept the migrants destined for the USA.","commenter_a":"Good luck. You can have ours tooo","post_message":"The government of Canada has ordered its military to draw up plans for migrant camps that will allow more than 6,000 Muslims to be housed on a long-term basis at several Canadian Forces Bases...."},{"comment_id":"1861753934052329","commenter_b":"I'm pretty sure @username was being sarcastic","commenter_a":"Lol wow. That tool didn't \"destroy\" anything. He just confirmed how idiotic the Obama administration is and how clueless they are when it comes to guns. He says the guns were legally purchased in California, but then says if there were \"common sense gun laws\", terrorists would change their mind about committing acts of terrorism, completely ignoring the fact that the legally purchased guns in California were purchased under the \"common sense gun laws\" you faggots have been calling for!!! Here is a question, have common sense pot laws prevented any of you jackasses from buying and smoking your weed?? Have common sense alcohol laws, like making it completely illegal to drink and drive, ended deaths caused by DUIs!? The fact that most of you idiots following this page actually believe the bullshit posted and the nonsense this president and his fuckbuddies spew out of their assholes means we are ...","post_message":"This sums it up. His reaction is great. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"453758594748735","commenter_b":"Hey Keith when leeches use my hard earned money to live it's my right to how it's used so STFU!","commenter_a":"Look at it this way, if they can afford to go on cruises, go to psychics and buy liquor, then they don't need to be on welfare.","post_message":"This state just banned welfare recipients from spending their benefits on cruises and tattoos - and officials didn't stop there."},{"comment_id":"10156021598895354","commenter_b":"And she is a witch and should be hunted-certainly not a good witch-her broom needs to be parked","commenter_a":"To think Obama and Bill Clinton are playing golf tpgether. I guess they feel shes going to jail anyway.","post_message":"So wait, you're saying Obama's Justice Dept. is conducting a politically-motivated witch-hunt via the FBI??? #NiceTry #LiberalLogic"},{"comment_id":"1292791090782624","commenter_b":"She's a paralegal? She should make much more than a fast food worker. This is why Sanders lost. He only helps the poor. He doesn't help the hard working middle class. Where is our mandated raise?","commenter_a":"Um I went to college to make $15 an hour and I have student loans. So now people working at Burger King are going to make the same or more than me? WTF I need a raise too!!","post_message":"When working people stand together, we win. And we are winning the fight for a living wage. In 2016, a total of 25 states and localities approved minimum wage increases."},{"comment_id":"1477546275595181","commenter_b":"Hillary Clinton is a phony champion of the working class! She takes millions from Wall Street the same people who have made Billions shipping are jobs out of the country!","commenter_a":"As it should be...when is the rest of the nation gonna wake up and at least acknowledge what's happening?","post_message":"Donald J. Trump leads Hillary Clinton by 5 points among likely voters in Ohio, according to a new poll."},{"comment_id":"10153046934697894","commenter_b":"#SaveYourself #hatinAssHoes","commenter_a":"Because she can't find a job doing anything else #shade","post_message":"Dawn Richard Announces She’s a New Spokeswoman for PETA (People for the Ethical Treatment of Animals) [Photo]"}]
