[{"comment_id":"10155083272367994","commenter_b":"I don't care if this woman is a mental reject, I'd like to throw her off a bridge to see if she can fly.","commenter_a":"She forgot to take her psychotic pills...","post_message":"Officials: Woman throws dog from bridge, claiming it can fly."},{"comment_id":"10154601814298812","commenter_b":"Beaver girl you are the lowest BS, send you to middle east good luck, Israel girls know how to fight, and the Frenchie girls know how to fight, you know like the French under ground","commenter_a":"Maybe they could present plans to \"Make America Great/Safe/White/America again\" Instead of hosting the \"We hate Hillary\" show. They really do just pander do the lowest common denominator.","post_message":"So far, speakers have mentioned Hillary Clinton an average of just over six times in evening speeches at the GOP Convention."},{"comment_id":"10153877840551337","commenter_b":"I always hated rousey I'm glad her ass got knock the fuck out","commenter_a":"Truth is holly Holm is a real fighter n Dana white thought he picked another easy girl for Ronda to destroy well plan back fired ,Holm is a real fighter and real champion now let's see her n cyborg fight two top fighters Rousey is finished","post_message":"DAMN: Holly Holm didn't hold back with these comments about Ronda Rousey."},{"comment_id":"10153815226441636","commenter_b":"@username, I think you and @username are on the same side..","commenter_a":"Western propaganda won't stop! Imagine of a situation if the coup would succeeded?! It would be worst than Egypt, killing of thousands in one night!","post_message":"Warning: graphic mages"},{"comment_id":"416369798522976","commenter_b":"Cheeko you ignorant slut. Stop acting like you know anything.","commenter_a":"Russia, get your shit together.","post_message":"Last year, fans of the Moscow CSKA team chanted racist slurs during a match against Manchester City. A year earlier, fans of Torpedo Moscow threw bananas at player Christopher Samba, who is from Congo, during a game against another rival Moscow team."},{"comment_id":"10152869817141130","commenter_b":"Sounds like you're a bitch who can't take a compliment.","commenter_a":"Maybe because when men try to pick me up it goes like this: Them: \"Hi, gorgeous.\" Me: \"F*ck off.\"","post_message":"\"It's not that I'm opposed to meeting someone. I just don't feel it's necessary.\""},{"comment_id":"10154596759964166","commenter_b":"Only applies to men though... Women can murder their babies. Just ask killery","commenter_a":"What is \"feticide\" ?","post_message":"JUST IN: The man accused of killing a pregnant teacher and dumping her body has bonded out of jail. His bond was set at $500,000."}]
