[{"comment_id":"1905981339634270","commenter_b":"O, yea...nothing to do with what a shit candidate Hillary was or the DNC rigging the primary...it's all stupid, racist, immigrant hating, uneducated fools...still don't get it do you. Bullying people you don't agree with by \"being offended\" and calling names lost y'all the election. Try a conversation without inviting your hate first, and stop listening to the alphabet news hate and fear mongers.","commenter_a":"Laura Dittmann watch this. I tell you wutttttt lol","post_message":"Donald Trump's own voters fell for a giant lie. -- Trae Crowder"},{"comment_id":"10153748803376077","commenter_b":"Greed!!","commenter_a":"Whoa!!","post_message":"9NEWS Denver Broncos Insider Mike Klis has confirmed that quarterback Brock Osweiler is going to the Houston Texans."},{"comment_id":"609800865864857","commenter_b":"#NeverTrump #NeverHillary","commenter_a":"Everyone of us who supports Mr. Trump, must come out and vote. It's great to talk, but we need to actually cast a vote. NO EXCUSES!! The Libertards will stop at nothing to cheat, lie and steal this election. Pass the word on to everyone. Republicans have to come out and support Mr. Trump like no other has been before. #TRUMP2016","post_message":"Crooked Hillary Clinton rakes in millions from nations that fund terrorism, oppress women, and spread hatred."},{"comment_id":"1169884533107797","commenter_b":"Google William Jennings Bryan or Dixiecrats. Tories and Confederates were conservatives too. Wrong side of history since day one.","commenter_a":"The first black senator and congressman were Republicans :)","post_message":"Only one black woman has ever served in the Senate. Will that change this year?"},{"comment_id":"878088758974173","commenter_b":"I agree some people need to do there research on Noble Dru Ali.","commenter_a":"Nothing about that medallion is racist people are just uneducated and stupid!","post_message":"Jay-Z Stirs Outrage by Wearing Medallion of Racist Group"},{"comment_id":"1878063365760713","commenter_b":"All illegals have committed crimes, hence the term ILLEGAL!!!","commenter_a":"Trump is more concerned with illegals that have committed crimes and securing the borders if you think Trump is going to round up all the immigrants like cattle and send them packing then you haven't been paying attention to the news","post_message":"“There is a long tradition in American law enforcement of not breaking into churches in order to arrest someone unless the person is wanted for an act of violence,” Judge Andrew Napolitano said."},{"comment_id":"10153072331466051","commenter_b":"This woman is nuts and needs put away for a long time. How crewel!","commenter_a":"These people are so evil !!! what is this world coming to","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."}]
