[{"comment_id":"10153240346384087","commenter_b":"You are remarkably uninformed. Why do you passively accept propaganda?","commenter_a":"Abortions account for over 86% of Planned Parenthood revenues, according to President Cecile Richards, who makes over $520,000 annually. Richards made the admission while testifying before the House Oversight and Government Reform Committee on Tuesday. @webpagelink","post_message":"Rep. Jim Jordan interrupted Planned Parenthood President and CEO Cecile Richards 19 times in five minutes as he grilled her about the previous apology she had given about the leaked footage."},{"comment_id":"1701496370115384","commenter_b":"GET OUT OF OUR home & go back to hell where u belong!","commenter_a":"yes!","post_message":"16 U.S. States Come Together To Ban Shariah Law It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"1088028091217546","commenter_b":"They'll just keep those desperate women safe in prison","commenter_a":"To all of the people who believe in blocking a women's right to choose by making legal abortions harder to obtain and want women to travel hundreds of miles to get one, if the law in Texas passes, I shudder to think how many \"complications\" (as if that was *really* the GOP's concern at ALL) there will be when desperate women resort to desperate measures. #keepabortionsafeandlegal","post_message":"The Supreme Court, two days after hearing a major abortion case from Texas, on Friday temporarily blocked a Louisiana law imposing regulations on doctors who perform abortions in a move that would allow two recently closed clinics to reopen."},{"comment_id":"1143200309023611","commenter_b":"Neither is \"snakeshit ted\"","commenter_a":"Rubio is not going to make it!","post_message":"Pressure on Rubio to pull off win in Nevada"},{"comment_id":"10154532453451051","commenter_b":"@username, do you kiss your boyfriend with that mouth?","commenter_a":"You're goddamn right I do. Hope he cracks down on the obstructionist Dems swiftly, and mercilessly, and for those who will inevitably say \"Oh, but the GOP were nothing but obstructionist with Obama! Buhuhuhu.\" To that I say: Elections are a game of King of the Hill, we now have the Hill and soon all 3 branches of Government. I'm not gonna entertain that \"moral high ground\" game, no, this is strategic warfare plain and simple, and we have the strategical advantages.","post_message":"Do you support Jeff Sessions as attorney general?"},{"comment_id":"10153992655564740","commenter_b":"Both groups are basically the same and it's sad that people can't or won't stand up and think for themselves.","commenter_a":"Story was after the 30 protesters souround the 6 kkk and begin getting violent the 6 defended themselves... 4 of the 6 were arrested... Wtf is going on here.","post_message":"Anaheim police have said “one or two” self-described KKK members have been seen in the city in the last two years."},{"comment_id":"1342374952487749","commenter_b":"We dont need these winers let them stay home,they wont be missed","commenter_a":"Let them skip more peaceful that way no whining","post_message":"LAME EXCUSES! CRYBABY DEMOCRATS To Skip Inauguration For FAKE Reasons Petty AND Partisan!"}]
