[{"comment_id":"10153319908498352","commenter_b":"And we know she sell pussy how??","commenter_a":"So she's gonna stop posting pics of her kid!?? How about stop posting pics of your ass.... Bash is better off with his daddy","post_message":"Amber Rose Responds To Wiz Khalifa Saying She Has A Dirty House & Baby Bash Birthday Issues"},{"comment_id":"662343567228023","commenter_b":"Great Woman!","commenter_a":"Wonderful tribute","post_message":"I wanted to highlight a few women in my life who inspire me every day. My wife, Columba, for her work to curb domestic violence and for so much more. My mother, Barbara, who has been a tireless advocate for literacy for a quarter century and Toni Jennings, who was a fantastic partner and Lt. Governor of Florida. These women are all examples of what can be achieved when we #LeanInTogether"},{"comment_id":"10153996062974203","commenter_b":"Take them all out by any means necessary, they are enemies of this country.","commenter_a":"In other reports, Ammon has told those left at the refuge to give up and go home. Why should they just get to go home, as if nothing happened and they hadn't done anything wrong. Every last one of them should be charged with crimes of all sorts.","post_message":"They're not going anywhere."},{"comment_id":"1876818559213436","commenter_b":"If NFL can't support National Anthem, then we can't support NFL or anyone else that can't support the Anthem.","commenter_a":"Back to Africa with him!","post_message":"NFL National Anthem Protests Sink TV Ratings To Five-Year Low Week Six!!! They had the chance to make things better but are allowing thugs to dictate their business.... KEEP BOYCOTTING!!! MAKE THEM PAY!"},{"comment_id":"10155298164813132","commenter_b":"This dumb broad just made her ignorance known.","commenter_a":"@username Kenya Hall I'm waiting for Riri to read her to filth.","post_message":"Azealia Banks shared several Instagram posts and a video attacking Rihanna for her post about Trump's immigration ban."},{"comment_id":"10154232027346491","commenter_b":"Tom....amen","commenter_a":"PRESIDENT DONALD TRUMP, PRESIDENT OF THE UNITED STATES OF AMERICA...EVEN THOUGH obama DIVIDED MORE THAN ANY SITTING PRESIDENT... SHOW YOUR BIAS time mag...THAT'S WHY YOUR PART OF HISTORY, AND NOT FOR THE PRESENT !!!!","post_message":"How TIME Person of the Year runner up Beyoncé went from pop star to political force. @webpagelink"},{"comment_id":"1101197406562586","commenter_b":"wheredid they dig these women up she does not know what she is doing..she mite as well givr the city to the thugs, disarm the police and go home and take a nap","commenter_a":"Burn it","post_message":"There are people openly worrying if Mosby's case fails, if Baltimore will burn to the ground."}]
