[{"comment_id":"1178538995510357","commenter_b":"I would have moved too.","commenter_a":"Ungrateful people if they really look at the whole picture officers are out there protecting us,don't judge the rest because of the other bad apples.Now they got to deal with criminals and the society plus news reporters.Too bad the officers can't close their eyes and walk away and say I don't want to help you guys!!!!!! But they swore under oath they will serve and protect you!!!!!!!","post_message":"The officers even covered the couple's tip."},{"comment_id":"1074056242615386","commenter_b":"Because people destroy their habitat and poach them for money.","commenter_a":"Wild animals shouldn't be kept captive! They should be in the wild if people want to see them why don't they go to there homelands instead of leaving them kept in cages!","post_message":"This gorgeous little jaguar cub made his public debut this week at the San Diego Zoo."},{"comment_id":"10154383385775975","commenter_b":"Thank you, OUR President Donald J. Trump❤️🇺🇸 #MAGA","commenter_a":"Loving it loving it","post_message":"\"I didn't come along and divide this country. This country was seriously divided before I got here.\"  President Donald J. Trump addressed the deep division Americans face.  Read more about today's press conference: @webpagelink"},{"comment_id":"10153743944261337","commenter_b":"GO HAWKS! We love you hating little bitches!","commenter_a":"It's okay. Knowing that their jackass coach screwed them out of the Super Bowl last season, it makes it better. Overrated team from Seattle.","post_message":"THEY BLEW IT: The blown call in Monday's Seattle Seahawks -Detroit Lions game inspired some hilarious fan reactions..."},{"comment_id":"1008491449210603","commenter_b":"@username You are scum simple as that!","commenter_a":"she was a drug taking piece of trash...","post_message":"Bobby Brown: 'Bobbi Kristina Brown was and is an angel'"},{"comment_id":"10153548972367093","commenter_b":"LOL. Go back to California.","commenter_a":"This Texan will be voting ALL BLUE in November! Bigotry and hatred has to end! #voteTxBlue - you #GOP small minded idiots don't remember that Texas WAS a blue state for a long time! LBJ was a Democrat from Texas, and TX was a Blue state until 1994!","post_message":"With Trump as the Republican nominee, Clinton thinks a large turnout of minority voters could put Texas in play... @webpagelink"},{"comment_id":"10157535598360389","commenter_b":"The press just like the FBI is covering for Hillary!","commenter_a":"The media are stupid and if it was not for Mr. Trump running against their Idol they would not have a paycheck. They all need to take a long vacation and never come back. There grins are annoying.","post_message":"Question of the Day: What do you think of some of the press' softball questions to Hillary Clinton? Share your thoughts below!"}]
