[{"comment_id":"10153064039634411","commenter_b":"Apart from the many proven lies? He was a cold blooded killer, how's that heroic?","commenter_a":"That bit about Jewish controlled media ... Whoa! How repetitive. And untrue. A sniper's job is to reduce the length of war by taking out one person at a time who appears to be aiding the killing of Americans. Thus Not mowing down a big group, thus not continuing backlash. Yes, he died young, at age 38. The movie is portraying the truth.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1867582453468544","commenter_b":"Stupid bitch","commenter_a":"you make it like i did , hard work bitch , no hand outs","post_message":"One of the co-founders of Black Lives Matter just said that 'white folks' need to 'sacrifice' THIS for her movement... this is an outrage.  America needs to know the goals of this movement... they're not going to like this."},{"comment_id":"10153358491932217","commenter_b":"where were these anti-facists when Women were attacked in Cologne","commenter_a":"Natalie","post_message":"Bricks were thrown as far-right & anti-racism protesters clashed in Dover."},{"comment_id":"10153602244842894","commenter_b":"It's a lot of women who are really Jr.","commenter_a":"Ok, so she doesn't mind showing her man's good...That is indeed a fools game but ok. I am really trying to wrap my mind around how the baby girl is a JR. should I not be distracted by that?","post_message":"Oh My! Teyana Taylor Shares Snaps of Iman Shumpert Holding Baby Iman Jr, But His Big Ol’ Bulge Steals the Show [Photos]"},{"comment_id":"591336634387962","commenter_b":"Build the wall!!","commenter_a":"That's California for ya. I find nothing wrong with what he said in 1971. Things were different then. I said things in 1971. Does that mean I'm a racist today? I am military where everyone's color is either desert camo or woodland camo. I find affirmative action quite racist. Employers should be able to hire people because of their skills not because of the color of their skin. Absolutely ridiculous.","post_message":"California lawmakers refuse to honor John Wayne! and here's why..."},{"comment_id":"598112180339217","commenter_b":"'@username buzz off back to the Rove hive","commenter_a":"How to Steal an Election 101...Despite winning Wyoming 56-44 percent on Saturday, Bernie Sanders will split the pledged delegates evenly with @username, plus Clinton gets the state's 4 superdelegates, tilting the delegate count to her favor, 11-7.","post_message":"We need a leader who will bring us together—not drive us apart."},{"comment_id":"2029120557147682","commenter_b":"Thanks, Candice......I didn't know about Cooper.","commenter_a":"I feel badly for the cast of Moonlight! They missed out on having their movie called, and all the fan flair that accompanies an Oscar win! Shame in you PWH!","post_message":"Emma Stone: 'It was one of the most horrible moments of my life'"}]
