[{"comment_id":"10152829564776770","commenter_b":"Go home Clintons","commenter_a":"Bullshit cover up","post_message":"Hillary is secretly a great person, says Clinton campaign"},{"comment_id":"10152979635977483","commenter_b":"Then ban the naacp bitch","commenter_a":"This flag was specifically adopted In response to the civil rights movement.. the confederate flag should be banned across the u.s point blank period","post_message":"\"Just by the outpouring of support I've gotten from all over the world, I know for a fact I'm doing the right thing,\" said Belinda Kennedy, owner of Alabama Flag & Banner."},{"comment_id":"941193142664131","commenter_b":"Hope it blind the liberal bitch! LOL","commenter_a":"Get more of them","post_message":"Mace to the face = ouch. Did she deserve it? Did the old man deserve getting punched by her? And for a bonus for being nice I've added a video of a high protester doing a backflip and landing on his head. #theplacewecallthezoo @webpagelink"},{"comment_id":"10155074124493258","commenter_b":"Hold fast against the Turd !","commenter_a":"\"A man reaps what he sows.\" Galatians 6:7. If you sow hate during the primary and the general election campaign, you reap hate, if you sow discord, you reap discord. #Galatians6","post_message":"‘‘We march today for the moral core of this nation, against which our new president is waging a war,’’ America Ferrera told the crowd at Women's March on Washington."},{"comment_id":"754556321401612","commenter_b":"Tie them by their ankles to a fast moving train!!","commenter_a":"This is the mine set of Muslims. That it's ok . Send their asses back","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News They deserve much worse than this. What do you their punishment should be?"},{"comment_id":"10152992734357894","commenter_b":"I hope Nick Gordon get the Death penalty lazy Ass Bastard","commenter_a":"Praying for her...","post_message":"Nick Gordon Could be Charged with Murder for the Impending Death of Bobbi Kristina"},{"comment_id":"10153256299899726","commenter_b":"The bakers were physically raped by this couple","commenter_a":"We let people wear rags which scares me to be approached but this is silly","post_message":"WATCH: Lesbian Couple Accuses Christian Bakers of  Mental Rape"}]
