[{"comment_id":"10153941419749614","commenter_b":"how is she an idiot, Frank? your original post does indeed come across as victim blaming. rapists don't discriminate. it doesn't matter if it's 9pm or 9am - if they wanna rape someone, they will do it. also, this girl was with her father so I'm sure she felt pretty safe to be out after dark.","commenter_a":"Why would they be at a Playground in Brooklyn around 9 p.m.???","post_message":"Update: Police say they have four of the five males in custody in connection with the incident. Original post: New York police are looking for five men who forced a father at gunpoint to leave his teen daughter behind so they could take turns raping her, authorities say. The 18-year-old was with her father at the Osborn Playground in Brooklyn around 9 p.m. Thursday when the brutal gang rape took place, according to NYPD. Authorities released this grainy surveillance video, taken in a bodega before the violent assault, that they say shows the suspected attackers. Police are asking for the public's assistance in identifying them. Read KTLA story here: @webpagelink"},{"comment_id":"775509592583157","commenter_b":"@username they are home how about the real immigrants go home for a change ?","commenter_a":"Illegals come here from Mexico looking for a better life yet they want to turn the U.S. into Mexico...freakin' crazy, and stupid!","post_message":"\"The American taxpayers have reached a boiling point. We are tired of illegals taking American jobs. We are tired of illegals living off our tax dollars. We are tired of illegals causing mayhem in our streets,\" says Todd Starnes. Do you agree?"},{"comment_id":"10154554439281602","commenter_b":"@username you must be a very lonely man","commenter_a":"The metal scrap yard is located on the same street as the historic Colt Factory. To pretend they had no knowledge of it's origin is BS. They should be fined and held accountable. I lived across the street from this monument for two years and while the area does have its issues, there is no reason to bash Hartford. There is a multitude of beautiful and historical architecture to see in that area if you are willing to get out of your car. Many state and local residents have worked long and hard to have the Colt area designated as a National Park. This is a slap in the face to a city that is trying to restore some remnants of it's former glory. Take the tour - learn a little history and have an appreciation for some of the treasures in our own back yard.","post_message":"\"When I first saw it, it almost made you want to cry.\""},{"comment_id":"940305309340143","commenter_b":"Muslims should be ban from Guns & Knives !","commenter_a":"Nice sentiment, but It'll never stand. If People can be forced to bake a cake against their beliefs, the muslum-loving bunch in D.C. won't allow this!","post_message":"\"I will not arm and train those who wish to do harm to my fellow patriots.”"},{"comment_id":"10153099385609255","commenter_b":"Of course there is climate change. It's been jumping around forever.","commenter_a":"The animals are a bit smarter than the scientists and they live in the weather not a lab","post_message":"Happy Groundhog Day—here's to six more weeks of winter. Thanks to Believing in imaginary friends and fairy tales is outside of my age bracket for sharing."},{"comment_id":"10153477026528352","commenter_b":"She should be buried under the jail,","commenter_a":"She's a LOSER.... There's no copping out of the fact that SHE murdered her kids.. Whether dad was around or not is irrelevant.. Plenty of women like myself are single moms and we aren't doing crazy shit like this","post_message":"Mother in court for ‘killing two of her kids and putting them in freezer’ has to be removed after flying into a rage over their absent father"},{"comment_id":"10153834571832439","commenter_b":"Because we have a pussy in the White house","commenter_a":"Like no!","post_message":"Why? These migrants are coming to our countries from failed, devastated cultures. When and why was it decided that we have to mute and censor our traditions and mores for theirs - a failed society that suffocates and destroys."}]
