[{"comment_id":"494909614001888","commenter_b":"That's it Chris we're all fucked - fucking wall climbing alligators!!!!!!!","commenter_a":"Abraham Guimaraes","post_message":"Nope. Not photoshopped."},{"comment_id":"10155020907765329","commenter_b":"I mean fuck the patriarchy, but like FUCK the patriarchy... amiright?","commenter_a":"'@username #17 please","post_message":"So your dirty mind can go back to school."},{"comment_id":"10153590364786409","commenter_b":"What a bunch of caddie women","commenter_a":"Oh I could never stand her....once Regis was gone,so was the show.....","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."},{"comment_id":"716711075186137","commenter_b":"Then go back home. Get out of America. We don't want you Islam or Sharia law.","commenter_a":"If that is what they want, I would assume they would be buying airline tickets for a flight back to a Muslims country.","post_message":"Muslims Try To Pass Sharia Law In Alabama So Citizens Do THIS.  We live under the law of the constitution. They are taking a stand.   Do you support these patriots?"},{"comment_id":"1294253327262342","commenter_b":"Build a big wall","commenter_a":"Keep a look out for us Jonathon Organ","post_message":"Huge comets could destroy civilization."},{"comment_id":"672161809583667","commenter_b":"This gal is a piece of .......","commenter_a":"Nothing quick about judging this one. It's been years in the coming","post_message":"I'm sorry....I'm not a fan."},{"comment_id":"895664467159698","commenter_b":"Elinor, cite your source. As recently as 2010, the Democrats made a former member of the KKK President pro Tempore of the Senate. Shawn, who these people may have voted for is irrelevant. A lot of Obama supporters are criminals. Does that mean they all are? Do you judge an entire group by the behavior of a few?","commenter_a":"I can explain it easily. THEY'RE NOT CONSERVATIVES!!! Liberals and conservatives aren't the only labels that exist to identify people. If you're claiming that they represent conservatives, you are at best, a cherry picker. But liar is the more appropriate label.","post_message":"Conservatives welcomed President Obama to Twitter in the only way they know how: By calling him a 'n*gger.'"}]
