[{"comment_id":"10153506757381509","commenter_b":"Maybe the people voting on abortion laws should reconsider......","commenter_a":"She needs to be charged with murder.","post_message":"Dynel Lane, 34, has been charged with criminal attempt to commit murder in the first degree, unlawful termination of pregnancy, and seven other counts for allegedly cutting a fetus from a pregnant woman's womb. @webpagelink"},{"comment_id":"1246779605377041","commenter_b":"this is the first smart commnet I read on here","commenter_a":"People just need to work harder and not be lazy is all.","post_message":"To bring back the so-called  dream, we desperately need to address the massive inequality that exists in America today."},{"comment_id":"1749284951998475","commenter_b":"I love this","commenter_a":"'@username @username me in second year","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"10154998158283734","commenter_b":"She needs to be only allowed to Work at a Garbage Dump!! No Place else as long as she's alive!!","commenter_a":"She should get three to fives years of community service clean up","post_message":"According to police, the woman pictured below is accused of putting menstrual blood and saliva on a customer's burger."},{"comment_id":"579776192190480","commenter_b":"Leave now bitch","commenter_a":"Good Bye.","post_message":"Whoopi Goldberg Says She Might Leave The Country If Trump Is Elected. Well I guess she's going to say goodbye. Will you happy to see her go?"},{"comment_id":"650282881785927","commenter_b":"She is such a fool. And not even a human. She needs to be in jail","commenter_a":"Putin looks at Killary, like you are in way over your head old lady. Don't even try to match wits with me.","post_message":"Busted: Clinton News Network's 'Fact-Check' Proven 100% False!"},{"comment_id":"10153839661300950","commenter_b":"Hell NO! I won't vote for that woman!! She needs to be in prison!","commenter_a":"Don't believe Trump - don't believe Trump Campaign VOTE HILLARY VOTE TIM KAINE VOTE DEMOCRAT","post_message":"The Democratic nominee will tie Trump to the 'alt-right' in a speech on Thursday."}]
