[{"comment_id":"487493421441238","commenter_b":"Get these terrorists out of our country.","commenter_a":"This being wrong is minor compared to the knowledge that someone, supposedly an AMERICAN allowed the demand of a group of visitors in our country to undermine one of the pillars of freedom that this country was founded upon. If our observances offend them , then we should at very minimum expect and get quid pro quo, their presence insults us, so leave, and don't come back.","post_message":"Muslims force this school to ban Christian holidays. America is under attack, we need to spread this. Do you agree this is wrong?"},{"comment_id":"10154486445542994","commenter_b":"There is no male. It is a transgendered woman.","commenter_a":"they beat his anus","post_message":"Courtney Purvis says she was attacked outside of a bar in Dearborn because she identifies herself as transgender."},{"comment_id":"10153727750436336","commenter_b":"You do realize that without spiders the world would be overrun with bugs which do a lot of damage to the earth if not contained","commenter_a":"This happened to me before when I was a kid, I was riding my bike branch hit me by my ear. Felt something weird went to the bathroom spider came out half way to say \"hi\" then went back in when I screamed for mommy. Went to the doctors then I lay down and the spider came out itself! And yes I killed it with my bare hands!!","post_message":"Each attempt doctors made to remove the spider caused it to react violently, but they eventually were able to subdue the insect with medicine and pull it out with tweezers."},{"comment_id":"10154367276527293","commenter_b":"@username, stay away from our country!!","commenter_a":"I don't think I have ever been so ashamed of this country. Deplorables, indeed. The morons clearly vastly outnumber the intelligent among us.","post_message":"The uncertainty over the outcome of one of the most contentious presidential elections in modern history rattled investors around the world."},{"comment_id":"10154754635023352","commenter_b":"Bridgette,u r s/o but ur lettin dem bitches knw wat it is.","commenter_a":"Her vagina is probably getting dry and can't keep up with him anymore..jk","post_message":"It’s over! Jennifer Lopez, 47, splits from toyboy Casper Smart, 29, after five years together"},{"comment_id":"474651159350328","commenter_b":"I had to take a class on how to handle union situations at wal mart.","commenter_a":"Ya outta see Targets 20 minute \"what to do if a union approaches you\" training video that every target employee must view before they are hired... It's Reduculus...","post_message":"In recent years Walmart has been labeled the bad apple in Corporate America, but recent news may give Target that title. ~Tanner"},{"comment_id":"1142853059119585","commenter_b":"So's my father. Personally, I served a three year tour in the US Army.","commenter_a":"No! George Bush was in the service. But no one knows how he got out.","post_message":"Don't you EVER forget this... nor let these Republican chicken-hawks send your children off to die in wars for profit."}]
