[{"comment_id":"10152884498052293","commenter_b":"not really","commenter_a":"This is the internet they cant ban anything.","post_message":"Sad Keanu? Nope. And sad Putin? Absolutely not."},{"comment_id":"997888900251582","commenter_b":"this lady is crazzy.","commenter_a":"The Amerikan Taliban.","post_message":"Hey you! You should go to church every Sunday! And the government should require it. Because America and morals and stuff."},{"comment_id":"10152938707421130","commenter_b":"So did God fall of his throne and let Obama take over until he's better . I think not Obamas words are and have the hissss of a ankle butting supreme.","commenter_a":"I agree with the president. BB is a dick","post_message":"President Barack Obama tells HuffPost that he dismisses Israeli Prime Minister Benjamin Netanyahu's backtrack on Palestinian statehood."},{"comment_id":"10153268129696782","commenter_b":"$50 charge on all transfers of money to Mexico. Wall built!","commenter_a":"Since illegals sending money back to Mexico props up the Mexican economy, I would propose a fifteen percent tax on all wire transfers and international money orders bound for Mexico. That alone would pay for the wall in a short amount of time.","post_message":"Mexico won't pay a single peso to help build the bigger border wall Republican presidential candidate Donald Trump is proposing, the country's treasury secretary said."},{"comment_id":"10153235652851519","commenter_b":"He has a brain?","commenter_a":"Trump's hair is getting into his brain, not Mansanto.","post_message":"Very presidential..."},{"comment_id":"10154930329184411","commenter_b":"eeehh how much cost an ukranian whore that can make this? 20 euros?","commenter_a":"OH someone throw these naked chicks money and maybe they'll start dancing to finally enterain us","post_message":"'Ukraine to EU', 'Break the Wall': The one-woman demonstration."},{"comment_id":"1023375851016759","commenter_b":"You're wasting every body else's.","commenter_a":"67 out of the HOW MANY THOUSANDS of people that visit daily? Get your shit straight IFLS. scaring people for no reason. Pathetic.","post_message":"Way to go, anti-vaxxers."}]
