[{"comment_id":"10154388349554657","commenter_b":"Put the witch on a stick and burn her.","commenter_a":"Should be incarserating her.","post_message":"It is the political story that just won’t go away for Hillary Rodham Clinton:"},{"comment_id":"10154411705371336","commenter_b":"@username Did you purposefully neglect the part that this is what happened in every parts of the Earth? They did the same thing with the Aborigines here in Australia, when Arabs invaded Constantinople and established Istanbul...smh","commenter_a":"She is one of the few Christian celebrities. God Bless Her. Amen this nation was founded on Judeo-Christian values.","post_message":"Candace Cameron Bure is grateful to be living in the USA because \"we have the ability to love God here.\""},{"comment_id":"10153078285427217","commenter_b":"Melissa single mum? yep you can talk you trollop.","commenter_a":"Doesnt look to Australian to me. i wonder if she speaks english?.","post_message":"Thousands set out to #lightthedark 🔦"},{"comment_id":"1820350008207308","commenter_b":"She will sell us out to the highest Middle Eastern bidder","commenter_a":"GIVE US A LIKE! -----> @username your TRUSTED Conservative News","post_message":"TRUMP LIVE! Donald J. Trump Rally in Sioux City, IA Like us for TRUSTED conservative news---> Freedom Daily"},{"comment_id":"1127007594082684","commenter_b":"Hell yes, round em up & send em back in those pink boxers.","commenter_a":"HE 's the best man for the job","post_message":"ClashDaily.com"},{"comment_id":"939237909458566","commenter_b":"Time to put two carrier groups in the area and drop lots of big fire crackers and line up some goats for the departed cave rats....but that raghead POS that lives in the WHITEHOUSE will do nothing","commenter_a":"Uh....why????","post_message":"BREAKING NEWS:"},{"comment_id":"10155466728060354","commenter_b":"Lol...I remember when a female Dem said that recently.","commenter_a":"What will he do about all the women driven to prostitution as a result of global warming?","post_message":"We look forward to your witty comments on this one. The possibilities are endless."}]
