[{"comment_id":"1163328470392328","commenter_b":"A worthless bitch","commenter_a":"She is an amazing woman that should be admired. A class act.","post_message":"First Lady Michelle Obama continues to top lists of most admired women in the world. Do you admire her?"},{"comment_id":"10153000556273855","commenter_b":"You're the most ignorant bitch here so far. Congratulations on stepping back two centuries.","commenter_a":"If a Christtian owned biz loses business for serving gays, it has the right to say, hey guys, dont take it personal, i need to make a living...go elsewhere. WTF U MEAN I CANNOT REFUSE SERVICE? THE ONLY PEOPLE I CANNOT REFUSE SERVICE IS TO BLACKS DUE TO SLAVERY AND BLSCKS BEING OUSTED AS AMERICANS SIMPLY BECAUSE OF SKIN color. Sexual stuff...can be a challenge to many. Leave people alone. Ask them to leave you alone. By the way - imFOR gay union, but not in a church.","post_message":"First Yelp, now Angie's List!"},{"comment_id":"10153667125634087","commenter_b":"@username its like talking to children that can't do math.","commenter_a":"Nate Silver has moved Sanders to winning this primary with a close to 60% chance . Mind you, just DAYS ago he had Hillary with an 80% chance of winning. The wider the margin the merrier. The small Wyoming caucus is next. And Hillary's lead in the April 19th NY primary is down from 30 to 40 point lead down to 12 in the latest poll","post_message":"#BREAKING: Another poll shows Bernie Sanders slightly ahead of Hillary Clinton in the all-important Wisconsin primary"},{"comment_id":"10157534463145354","commenter_b":"Ass holes","commenter_a":"Tell the Lebanese to get the F off","post_message":"Antisemitism mars Rio Olympics... “The 2016 Olympics – a disgrace!!”"},{"comment_id":"10153732430689117","commenter_b":"It is a completely legitimate discussion. In the 21st century private corporations have power equal to or even greater than a government's over people's platforms for speech and expression. In 10 years it is entirely possible that a single multi-national company will control all of the major social media platforms. Which means they could quite easily silence any viewpoint that they don't like. This in fact is already happening in many places around the world. Mark Zuckerberg will eagerly jump into bed with any ruthless dictator and agree to censorship on that country's population.","commenter_a":"There is no free speech war to be had. Twitter is a private entity and can ban who ever they like, for what ever reason. They do not have to abide but the first amendment, the government does.","post_message":"#FreeMilo just became a thing. Thanks, Twitter."},{"comment_id":"10154662767663188","commenter_b":"Absolutely Michael! No Jake herrin Idiots like You are ruining this country!","commenter_a":"Sick of your BS Beck and I don't need your critique on any of this! He cleaned her clock and your whining butt just doesn't like it. If we lose this country it's because of idiots like you Beck!","post_message":"This was Donald Trumps best Performance in the debate. BUT remember the only goal is to ADD undecided voters. Charles Krauthammer just called Trumps performance Political Suicide. He is right. He was winning and then it began to break apart. They both have sealed their core long ago. Tonight was the last chance to bring the women that have been lost or questioning. Those Reagan democrats who worry about foreign policy, Russia or temperament. First 30 minutes were strong for him. He had some good lines and looked (at times) well informed. He had a great open borders section. While I cringed in the gun debate and abortion section. On the second Amendment Rubio, Cruz or almost any other candidate would have cleaned her clock when she spoke about 12 toddlers shooting people in DC. His pro choice response On partial birth abortion was the weakest I have ever heard. ..."},{"comment_id":"10153840747221336","commenter_b":"Let every congressman in Washington put up 10 \"refugees\" each in their own homes. The White House could take care of at least 100 of them. Just keep them out of our towns and cities.","commenter_a":"\"Stupid is as stupid does.\" - Forrest Gump","post_message":"On Monday, Governor Greg Abbott announced that he sent a letter to President Barack Obama saying that Texas will not take any Syrian refugees in light of the Paris attacks."}]
