[{"comment_id":"10154550088456633","commenter_b":"I don't know HOW she got pregnant, she is such a tease!","commenter_a":"Oliver is pacing more this morning!","post_message":"Will today be the day? When will New York's April the giraffe give birth? More info >> @webpagelink Stream via Animal Adventure Park in New York."},{"comment_id":"10154334657668797","commenter_b":"I'LL SKIN THAT DOG AN THROW IT ON THE GRILL FOR DINNER. .. MMMMM MMMMM MMMMM DOG.....","commenter_a":"The newest FB trend....disabled animals as \"news.\"","post_message":"LIFE ROLLS ON: A puppy born without front legs was found abandoned and shivering in a cardboard box on a busy street. But now, she has her very own set of wheels to get around! See here:"},{"comment_id":"10154212192071955","commenter_b":"Stupid troll whore","commenter_a":"TRUMP!!! lets see. he thinks SADDAM HUSSAIN is great!! makes fun of people with medical problems! AMERICANS wages are to high !! P.O.W.S are losers!! he is a draft dodger!! will not show AMERICA his taxes!! he did say women are bimbos pigs!! he has so for 3500 lawsuits against him not paying his employees!! all of his products are made in other countries!! he flip flops more than a fish out of water! said he will be self funding now he has his tin cup out!! he is the king of bankruptcy!! Donnie only cares about Donnie and his golf courses!! TRUMP NEVER!!! OHIO FOR HILLARY!!!","post_message":"ISIS KILLS 5,200 IN MONTH"},{"comment_id":"1014158221952970","commenter_b":"It's true doe","commenter_a":"Lol the amount of white people defending trump #whitetears","post_message":"Wendy slammed Ivanka Trump and her siblings over Donald."},{"comment_id":"904173296345590","commenter_b":"For the amount it too severe a sentence","commenter_a":"YES!!!!!","post_message":"Weldon Angelos is serving a 55-year-term for the sale of about $1,000 of marijuana. By the time he's out, he'll be in his 70s."},{"comment_id":"10153631215978984","commenter_b":"Please take the baby away and never should she get back any of the children. Also, make sure that she cannot have any more kids.","commenter_a":"What a shame...","post_message":"The cops got the call so they went to this pregnant woman's home... but once they got there, they were stunned at what they saw. This was not something they had been trained for... they will never forget this."},{"comment_id":"1487031254643822","commenter_b":"Stupid? Of course they are. These are the women that will vote for Hillary for one reason only. Because she's a woman.","commenter_a":"The stupidity of some Americans gas gotten it of hand. Grow up baby cakes.","post_message":"Sorry Wonder Woman, feminists hate you because you have big boobs."}]
