[{"comment_id":"1037567749698799","commenter_b":"Facebook is trying to silence him tonite","commenter_a":"Completely cut off","post_message":"Watch Live: Donald J. Trump holds a rally in Sterling Heights, Michigan."},{"comment_id":"10153366613454712","commenter_b":"She's a joke","commenter_a":"So how is she suppose to be courageous when she hides reports that was commonly issued? She hide knife? How is she courageous? How courageous to point a muder finger at innocent driver","post_message":"Memo to Marilyn Mosby: Baltimore wants transparency, not sealed documents and gag orders."},{"comment_id":"963507617048798","commenter_b":"Black women live in public housing for generations it is time to let them live in the streets like white people do. 5 year limits on public housing so it does not continue as a breeding center for black skanks.","commenter_a":"Why do we have so many homeless? if our country has immediate help and housing for All the refugees then this country should have housing and help for all Americans immediately. No American citizen should be homeless, take care of our own First. Homelessness breeds all kind of crimes.","post_message":"Three teenage brothers suspected of a fatal attack in a #Seattle homeless camp known as ‘the Jungle’ have been charged with first-degree murder and assault. Michelle Millman reports what we know >> kiro.tv/JungleCharges"},{"comment_id":"944373212266686","commenter_b":"Planned Parenthoods primary function is abortion. Enough said. Defund it.","commenter_a":"Only 3% of Planned Parenthood's funding goes to providing abortion. None of that money comes from taxpayers. Defunding Planned Parenthood means defunding millions of dollars in preventive care, cancer screening, contraception (which reduces abortion), STI screening, and other such essential services. I'm pro-choice, but if you guys have such a problem with abortion, why don't you just campaign to force Planned Parenthood to stop providing abortion services and leave everything else intact?","post_message":"Wow."},{"comment_id":"10154061542714411","commenter_b":"'Hey, Jews are getting their own country, let's all go be our typical fuckhead selves and try to butcher them all.... we'll need a name, someone go digging around and come up with something while I strap a bomb to my kid' (The founding of Palestine).","commenter_a":"O God!!! hahahahahaha...Ignorant Mr.MP...","post_message":"Letters matter"},{"comment_id":"10153508480963984","commenter_b":"She is a disgrace","commenter_a":"There is nothing here for a reality show. Maybe a show on mental illness.","post_message":"NAACP race faker Rachel Dolezal stepped down from her job, but she already has a new gig in the works. You might be shaking your head when you see it..."},{"comment_id":"10153860133856336","commenter_b":"He just figured this out LOL i knew ever since he took office.","commenter_a":"Absolutely.","post_message":"Do you agree with Mike Huckabee?"}]
