[{"comment_id":"1009393132499179","commenter_b":"Is this guy even alive? He looks like a bad wax figure.","commenter_a":"Trump set the tone and this jerks lowered the bar to a new level. He should be removed from his position immediately!","post_message":"This is definitely disturbing."},{"comment_id":"1181986708533713","commenter_b":"if they don't like it they should leave America. Sure mexico, africa, iran or even canada would take them.","commenter_a":"Exactly! Behavior like this is a major part of why Hillary and her supporters just lost the election! Protesting is good, but not when you're whining about a person who won an election fair and square just because you disagree with them.","post_message":"\"This is not helping.\" One Hillary Clinton supporter in Chicago said he was unhappy with how some of the the anti-Donald J. Trump protests were being carried out @webpagelink"},{"comment_id":"1205011436232276","commenter_b":"Hahaja pornhub and fat bitches fighting over fooood lmfao","commenter_a":"@username #14 😂. That's Steve","post_message":"Enjoy This Week's Vine Comp! #WSHH #Vine #Compilation"},{"comment_id":"1120798904674131","commenter_b":"#NeverCrookedHillary #HillaryTheLiar","commenter_a":"If taxes will pay for it, and I pay taxes, shouldn't this read \"How much money will Hillary's plan cost you?\"","post_message":"Whether you already have student loan debt or you're preparing to go to school, Hillary's college plan can help you save money. Find out how much using our new calculator: hrc.io/2cH4yGX"},{"comment_id":"10154596744362439","commenter_b":"Shoot that prick.","commenter_a":"so WE GIVE UP ON YOU BASTARD.","post_message":"That's why Europeans have to give up on the EU, if they hope to survive."},{"comment_id":"10153486383431037","commenter_b":"So how many cops takes to capture one guy?","commenter_a":"Tantiana Valentina","post_message":"MORE DETAILS: Second escaped prisoner shot by police, in custody and taken to hospital"},{"comment_id":"10153851640243984","commenter_b":"Fire that going bitch","commenter_a":"Isaiah 5 : 20 ~ Woe unto them that call evil good, and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter!","post_message":"This young Texan is standing up for her religious beliefs BIG time after her teacher tried to force students to deny that God is real, and threatened them with failing grades if they did not. Do you support this young girl for taking this stand?"}]
