[{"comment_id":"972410229461065","commenter_b":"It doesn't seem to matter, does it?...she's slicker than Willy!","commenter_a":"Oh stop it","post_message":"Arrest her, TODAY!"},{"comment_id":"1357769630924322","commenter_b":"This story is a distraction tactic to pull attention away from the real story. Americans seem to fall for it every time. Next week it will be something else..keeps us divvied and look we are.","commenter_a":"Oh, and another thing Far Left Liberals. The Head Muslim wants to destroy USA with his crazy Muslim immigration scheme so the U.S. \"can be lowered to the standard of the rest of the world\" is lunacy! Obama is a Muslim, this is not a Muslim state although he is trying to make it so..that is his Legacy. That is why Trump was elected. We are not the Muslim States of America!","post_message":"Hell has officially frozen over. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1326442960748782","commenter_b":"She looks too white and pasty...","commenter_a":"Hope she burns to a crisp","post_message":"Kendall Jenner looks sensational as she soaks up the sun (via Daily Mail Celebrity)"},{"comment_id":"1563567157272928","commenter_b":"Stupid ass motherfucker","commenter_a":"way to go rosie, now evryone knows why trump treats you like he does. you usless POS. Done let the door hit you in the ass on the way out. if Canada doesnt want you, please dont come back","post_message":"Rosie O'Donnell just restarted an epic feud."},{"comment_id":"10152938422949877","commenter_b":"girl shut up","commenter_a":"#foodforthought","post_message":"Half Of Atlanta's Newly Diagnosed HIV Patients Have AIDS, Study Finds. Read more on these staggering numbers out of Atlanta. Grio fam, share your thoughts on what needs to happen to reverse this."},{"comment_id":"10153228481536519","commenter_b":"Which means no one should have sex with her, dumb ass.","commenter_a":"Oh jeez these comments are sick! Yeah teach your girls to watch how much they drink (and get help if they can't control themselves).and situational awareness. BUT this girl was still raped. Those men are still guilty. If someone is that wasted they crash a bike into your house, you sure as hell don't have consent to sleep with them. If someone is passed out on a couch, you don't have an open invitation to rape them. You people need help","post_message":"\"The truth is... I don’t know the exact number of times I was sexually assaulted.\""},{"comment_id":"809483035820491","commenter_b":"Send her little ass over there to stay and take her ma ma with her","commenter_a":"NO FOR GOD SAKES , NO MORE CLINTON'S.","post_message":"Send Chelsea to Benghazi! Dc Gazette (y)"}]
