[{"comment_id":"1505789769441048","commenter_b":"Boycott NBC","commenter_a":"When has NBC ever put a spot light on Trump in a positive way? Lol.","post_message":"The 2016 election has been quite the seesaw ride."},{"comment_id":"939606616115567","commenter_b":"Slaves to Islamic vermin. not MEN","commenter_a":"Sharia and Islam are only good for Muslim Males ................Males get all the advantages............... BUT .women, children, gays, Christians , Buddhists, Jews, Hindu and anyother religion not \"their \" brand of Islam will be punished , raped , enslaved , or killed . Women of the world wake up and see this truth . Fight for freedom .Women Fight for your life....Women you can be more than slaves to men ........","post_message":"They're just sweet refugees', they said. 'Who just want a better life', they said. Welcome, and then .... German girls... cover up... so you don't get raped by the 'refugees'?"},{"comment_id":"10154746753444657","commenter_b":"@username, while I agree that security along our border is non existent and with the possibility of terrorist using it to their advantage it needs to be dealt with. I think it's a complete fallacy that illegal immigration should be such a focal point in this election. Its not our biggest problem. Our growing deficit and out of control federal government seem to be a bigger threat to our country!","commenter_a":"We are going to loose this election while small minded people focus on small minded things. Stock footage and former adult stars in commercials aren't going to destroy this country the people are! Because they can't seem to focus on the problems we are facing and examine the solutions of the candidates.","post_message":"Oh, the perils of stock footage."},{"comment_id":"10153208513188812","commenter_b":"WWF on wheels....","commenter_a":"He should b able to race it wasn't his fault his car got stolen they should make an acceptation","post_message":"UPDATE: Police find stolen NASCAR Sprint Cup race car: @webpagelink"},{"comment_id":"1266165143423955","commenter_b":"This woman is such a moron. Send that lunatic Syria then see if she still thinks they ate doing gods work what an idiot","commenter_a":"Your kidding right ? Sick out of it, to hate that much.","post_message":"HOLY F*CK!"},{"comment_id":"10155983890750354","commenter_b":"Yea I enslaved your lazy asses. That's the only way to get you to earn your keep.","commenter_a":"Agreed. Kill us all and then who will pay for your entitlements.","post_message":"“You mother-f**ckers...came and stole us from Africa and put us in chains and murdered us for over 400 years, so yeah, you do need to die.\""},{"comment_id":"10154476200391037","commenter_b":"Experts still deny Free trade causing poverty joblessness....they still maintain America cant make its own goods that we must import or fall into some economic abyss! At the same time they back Hillarys claim that she can create some kind of new jobs that doesnt involve manufacturing?? Lets speculatefor a moment that 25 years ago our govt agreed to stabilize China by implementing Free trade...it created a middle class helped create a market for us to trade with down the road... they have enough money to buy from us but 25 years ago the large population was mainly poor. and it made Chinese govt more stable...Govts make these kinds of trade offs everyday...greater good it will pay dividends we have to think of the future all of that kind of nonsense while sentencing 3 generations of American workers to a deadend future.","commenter_a":"obama has done a great job dividing people...Time to fix that!!..TRUMP 2016!!","post_message":"\"We need more love and kindness in this country,” Hillary Clinton said. \"The last thing we need are leaders who try to divide us even more than we are.\""}]
