[{"comment_id":"971472706302942","commenter_b":"That's where she belongs! That's where she belongs! That's where she belongs! That's where she belongs! LOCK HER UP!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"More Wikileaks revelations: 1) Ted Cruz allegedly asked the DNC for MONEY to help fund his delegate fight in Cleveland (specifically: Eric Bennett to and from Ken Cuccinelli, R-Virginia working with Ted Cruz and the DNC to undermine the delegate selection before the convention). Working to push through rules changes in the rules committee and working to flip bound delegates against the rules and state law. All co-ordinated with the DNC. 2) Jake Tapper of CNN allegedly colluded with the DNC. They gave him questions to ask his interview guests. 3) Chuck Todd of NBC allegedly was also colluding with the DNC and put pressure on others at the network to go easy on Democrats at the DNC’s request. 4) The New York Times allegedly co hosted parties with the DNC. This is against the law. 5) Hillary Clinton allegedly setup a slush fund through the DNC to launder donor ...","post_message":"Live Now: Jesse Watters and Brian Kilmeade are here at the Facebook Live Lounge from the Democratic National Convention and they're taking your questions! Comment below:"},{"comment_id":"10152805783329342","commenter_b":"Kristine Bak","commenter_a":"It's been ALWAYS happening ....everywhere","post_message":"WARNING FOR PET OWNERS: There's a growing trend called dog flipping; someone takes your dog and then tries to sell it, and it is happening right here in Houston. FULL STORY ---> @webpagelink"},{"comment_id":"1297388806970322","commenter_b":"Being ashamed of himself is not enough. Fire this idiot and boycott the idiots who hired him, and him being a professed republican. Rino.","commenter_a":"Con Hannity always a victim! Lester Holt is a registered Republican. FACT!","post_message":"The numbers don't lie."},{"comment_id":"10154549448869342","commenter_b":"That's not her!","commenter_a":"She ain't gangster now lmao","post_message":"Police became aware of a \"disturbing video\" on Facebook Live showing an adult man being bound and beaten."},{"comment_id":"453687788168068","commenter_b":"The 2ND Amendment was created to stop future Politicians after 1789 From EVER disarming the American POPULACE, It was a RULE OVER The FEDERAL GOVERNMENT to Say Congress the courts and the President Could Not EVER! Make a Law to CURTAIL the AMERICAN PEOPLE FROM OWNING AND USING FIRERARMS, THE GOD GIVEN RIGHT OF THE PEOPLE TO KEEP AND BEAR ARMS, wait for it SHALL NOT!!! BE!! INFRINGED , THAT MEANS NO FIREARMS RESTRICTIONS, TO MY GOVERNMENT THAT MEANS YOU SHALL NOT PERIOD!. END OF DISCUSSION. NEXT GRIPE, SERVANTS OF WE THE PEOPLE.","commenter_a":"Seeing that his commands are what the fighting & killings are all about, it sounds about right, & if you believe that you will believe anything.","post_message":"Why Owning a Firearm is Not Just a Constitutional Right but a God-Given One!"},{"comment_id":"967920213241731","commenter_b":"Stay out of Florida's business.","commenter_a":"Yes","post_message":"A bill to require a 24-hour waiting period for abortions passed the Florida Legislature and is now heading to Gov. Rick Scott's desk. Do you think he should sign it?"},{"comment_id":"10153274022815326","commenter_b":"The DNC are the ones calling in the second string. I do like VP Biden, and respect him, but it is obvious that the DNC establishment see Hillary as a loser now. Senator Sanders is the ONLY candidate who is fighting for ALL of WE are the 99%. The media and their Oligarch Masters are afraid of Bernie Sanders, which is why they have been ignoring him. Bernie is fighting for WE the 99% regardless of race, age, gender, sexual orientation or beliefs. He should be getting 99% of ALL votes including republicans, democrats and independents. Let's all vote for our own self interests for a CHANGE. FEEL THE BERN? Everyone had better or we are doomed.","commenter_a":"The Dem establishment can't be too pleased if Biden does decide to run. Could hurt Hillary by splitting the establishment vote.","post_message":"Vice President Joe Biden is still figuring out if it is in his heart to run for President again in 2016. Biden is a fighter for the middle class, Ed Schultz and Katrina vanden Heuvel discuss. Watch the entire show at: @webpagelink"}]
