[{"comment_id":"1286110978131794","commenter_b":"Oh you mean like all the people who first came to America and created the United States? Then took half of Mexico? Oh ok. As long as this is clear and there are no glaring hypocrisies!","commenter_a":"Sorry, incorrect...if you overstay a visa, you are an illegal alien, If you ENTER the country illegally, you are an INVADER!!","post_message":"Allen West Republic"},{"comment_id":"10152710214754205","commenter_b":"Bitch, you're from Missouri.","commenter_a":"Another reason to hate chicago","post_message":"Secret CIA Black Sites In American Heartland For 'Disappearing' Citizens"},{"comment_id":"10153430194047042","commenter_b":"To answer your question politically I don't like Hilary and I don't believe I would care for her personally either.","commenter_a":"How did Americans become so Dumb? No matter what kind of Facts you show them they will still support this Fool of a President.There is a Health Care Crisis is Puerto Rico yet they love this Fool.Israel will soon be whipped off the map by Iran yet Jews Love this President.Not a single Latin family has been untouched by this Man and his Policies yet we are about to elect someone worst Hilary.The Mexicans don't understand that there being used like a mule to further a democratic Political agenda.The president could have made millions of illegals legal yet there left in limbo and now he is gonna lecture us on race relations when he is the most divisive of Presidents..","post_message":"\"RACISM, WE ARE NOT CURED OF IT\": President Barack Obama used the n-word to make a point about the reality of racism in America."},{"comment_id":"10154997987663812","commenter_b":"@username Lie cheat and delete.","commenter_a":"What are the successes? Stealing millions via the ClintonFoundation? Seriously what has she done in 30 years?? Name three things, that's 1 per decade","post_message":"Hillary Clinton's message to young Americans and young girls in particular: \"Never doubt that you are valuable and powerful and deserving of every chance and opportunity in the world.\" @webpagelink #Election2016"},{"comment_id":"10153658403039726","commenter_b":"OK !! There are 42,000,000 illegals in this country, squatting out \"anchor babies\" like cockroaches---WHAT\"S HIS PLAN.","commenter_a":"Carsons' stand on illegal aliens is almost as bad as obamas. Vote what's best for America---Trump.","post_message":"WATCH: Carson Jokes: I Heard Trump Dropped Out!"},{"comment_id":"1393941760623890","commenter_b":"Just like they blocked Obama?","commenter_a":"It's a shame that Democrat voters don't vote on issues such as jobs, the economy, and security... They vote for the candidate who has the most celebrity backing... Low info voters.","post_message":"Lady Gaga criticized Melania Trump for saying she wants to end cyber-bullying if she becomes first lady. @webpagelink"},{"comment_id":"10153263925251990","commenter_b":"@username hubby leaves for work and I wake up","commenter_a":"Jackie Owens @username-Hernandez @username","post_message":"JUST IN: The CHP says two people were struck by blow darts while walking on the Golden Gate Bridge --> @webpagelink We will have more on this story in our News at 11 p.m."}]
