[{"comment_id":"800970150035571","commenter_b":"Stupid...sheeple its a bathroom!","commenter_a":"Target Please close doors move out of there where they respect all the people,,,,","post_message":" continue to believe that this is the right thing for Target,'' the company told TODAY in response to the boycott."},{"comment_id":"1129680070463931","commenter_b":"I don't know where you get this clump of cells thing... maybe in the beginning... before a mother even knows she's pregnant, but by the time they would know that fetus reacts to pain and sounds (especially it's mother's voice)... fairly quickly it dreams... science has shown this... putting religion aside... before the end of the 1st trimester it is a living being and respirates like any other human (just gets its oxygen and nutrition differently). Much more than a lump of cells. At 18-22 week the child can be born and live a normal life 9 time s out of 10 even if the mother's life is in danger at this point there is no more dangers to birth over abortion. On top of that... healthy infants get adopted by people that want them...","commenter_a":"This has nothing whatsoever to do with humane treatment. It's another attempt at shaming the woman for making her own personal choice and finding a way to punish her. This is also another ill-fated attempt at giving a fetus, a few cells, personhood. A fetus nor a clump of cells can be made to be treated as a once living, breathing human being, nor should it be treated as such. As soon as these \"lawmakers\" can dictate that, it's a short road to personhood, to claiming murder and denying a woman a choice and having autonomy over her own body.","post_message":"About 35,000 public comments poured into the Texas Health and Human Services Commission about the rule change."},{"comment_id":"10154010909024916","commenter_b":"I said it first along time ago. Its better for her to be Sanders VP then Hillary's. Two women running is dicey for guy voters. Plus hillary is too conservative for Elizabeth. it wouldn't work. Just Sanders/Warren. and secret service knows they would work to protect them the same as blacks running for president.","commenter_a":"Elizabeth Warren would make a great Vice-President and the next great President after Bernie!","post_message":""},{"comment_id":"1738373569725506","commenter_b":"Nasty bitch!","commenter_a":"Thief don't need to words","post_message":"This should be interesting....ClashDaily.com"},{"comment_id":"10153191536946051","commenter_b":"I was thinking of eradication of the scum and I don't care what color they are!","commenter_a":"Doesn't matter what nationality, they need there legs broken, if that was my daughter?","post_message":"This teen was at the gas station with her boyfriend when a group approached them."},{"comment_id":"10153757618426336","commenter_b":"You're a complete @$$hole !","commenter_a":"Hey Campus Employee where are you going to? I'm going to Disneyworld (Suckers!!!)","post_message":"Kathryn Thompson, who works the night shift at an on-campus coffee shop, has always dreamed of taking her autistic grandson to Walt Disney World."},{"comment_id":"10153590950708145","commenter_b":"You can turn it off though.","commenter_a":"Ever tried to uninstall Facebook? YOU CAN'T!!!!","post_message":"Apparently, Facebook wants its Messenger app to take over your phone."}]
