[{"comment_id":"164458724060246","commenter_b":"Should give all their jobs to legal immigrants","commenter_a":"Good for the owner. Behind him all the way.","post_message":"30 WORKERS FIRED For Skipping Work To Protest On Behalf Of Illegal Immigrants…Calls Employer Who Fired Them A \"Racist\" [VIDEO]"},{"comment_id":"1014969508525839","commenter_b":"It only matter what the FBI thinks about the emails. It's obvious when obama's FBI investigates it's something serious.","commenter_a":"Socialist nut job or a lying criminal oh the options we have.","post_message":"This is the surprise moment from the #DemDebates everyone will be talking about tomorrow."},{"comment_id":"10153430098934342","commenter_b":"Lame","commenter_a":"Keep control of your dog. If your uncontrolled dog bites someone it is a felony.","post_message":"The dog darted between her owner's legs and out the door. Seconds later, the beloved pet was lying in a pool of blood."},{"comment_id":"10156149888525389","commenter_b":"Now they are coming over by sea they are still illegalls","commenter_a":"Oh Great,more people coming in !!","post_message":"A Miami Beach Police spokesperson said it is unknown how long the group were at sea."},{"comment_id":"10153551321648984","commenter_b":"A coal burning slut","commenter_a":"Kardashian is nothing more than a SLUT! Don't watch anything to do with her, PERIOD!","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with...  Do you side with Megyn Kelly on this one?"},{"comment_id":"855684411135567","commenter_b":"what mexicans smuggling drugs into our country? no WAY! shoot them","commenter_a":"Hmmm... hemp mattresses.","post_message":"Nice try."},{"comment_id":"972848449477340","commenter_b":"@username YOUR PARENTS MADE A BAD DECISION WHEN THEY CONCEIVED YOU...YOU ASSHOLE!!!!","commenter_a":"Does anyone really think Hillary Clinton is presidential material or qualified to be president of the United States? Think about that for a sec. She's made bad decisions and poor choices all of her life. From whitewater to Benghazi. She's incompetent to say the least and can't be trusted in her decision making abilities. She's been fired for being unethical or ethics violations and just recently had national security issues with her email. Not to mention being a lying ass crook. Presidential? Not hardly!","post_message":"Early polls show Hillary Clinton would handily beat both Trump and Cruz in a general election. Are you hoping to see Clinton become America's next president?"}]
