[{"comment_id":"10153431961096130","commenter_b":"Look what she made him do!","commenter_a":"I was NEVER a fan of Johnny Fraud!","post_message":"Johnny told police that his girlfriend was both “a little mad” at him and “a little bit intoxicated.”"},{"comment_id":"10154341352611729","commenter_b":"I am tired of hearing about this. Nothing will happen to her. Why? Who knows. Just let us know if and when she is charged. That will be news and surprising. She gets away with every thing like that damn man in the oval office.","commenter_a":"Yeah, right......","post_message":"This could be it..."},{"comment_id":"948419235220194","commenter_b":"If she wont follow the dress code I wonder what other codes she would break...Be compliant or be gone !!","commenter_a":"How refreshing !! Parts of this country is still the U.S.A.","post_message":"Ohio Police Takes BOLD Stand Against Islam After Offended Muslim Woman Issues Threat @webpagelink"},{"comment_id":"10157177074000354","commenter_b":"And she will continue where he leaves off","commenter_a":"We've had more terrorist attacks on our soil during the Obama administration than on GW Bush's watch. I think Obama is doing a fine job of recruiting terrorists.","post_message":"So the basis of Hillary Clinton's corrupt candidacy is that she is more popular with terrorists? WATCH:"},{"comment_id":"10153764706938984","commenter_b":"Bring the hostages home AND KILL THE IRAN DEAL!!!","commenter_a":"Anything to stop him is ok","post_message":"Senate Republicans just revealed their bold new plan to stop Obama, and Democrats are NOT happy they're putting up this fight... Do you support what these Republicans are doing?"},{"comment_id":"1796841757230844","commenter_b":"well how disgusting women walking around half naked in front of men!!","commenter_a":"More made up BS","post_message":"Former Miss Arizona Tasha Dixon says Donald J. Trump walked into a dress rehearsal for the 2001 Miss USA pageant while the contestants were \"half-naked\" and that women were told to \"fawn all over him.\" The Trump camp says the accusations \"have no merit.\""},{"comment_id":"10153085738765163","commenter_b":"Yep @username. Sophia was a crazy cat lady. Lol","commenter_a":"Renee Rudd","post_message":"SHE WINS. 😂💛😸"}]
