[{"comment_id":"688602181316881","commenter_b":"Bitch bye","commenter_a":"@username smh","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"401125753409052","commenter_b":"Josh go live with the muzzies and obey THEIR laws in their land!!!","commenter_a":"It should be like that in America, too!","post_message":"\"I don't want to take off my Muslim Head Covering in Court\"..."},{"comment_id":"495888253922598","commenter_b":"I don't know many people that leave the doors to their homes unlocked when they leave for the day, when they go to sleep at night or just go about living with their family and friends. Also I don't know anyone that does not ask guests to leave at some point after a visit. Additionally most people use common sense to screen individuals that enter their homes. If the individual being considered as a guest is affiliated with a suspect group we error in the side of caution to protect or family and do not invite that individual or their affiliated friends into our home. In comparison to legal and illegal immigration into the USA it seems like the Democrats are telling us to unlock your doors while you sleep, don't use the locks on your doors while you watch TV, and when you leave for the day leave your ...","commenter_a":"The parallel is Jews = Christians. Not hitler to trump. Hitler killed the Jews. Not the other way around. Radical Muslims are killing Christians and Americans. Get it ?","post_message":"It would not surprise me either! What I am seeing & hearing from around the country is disturbing. Time for us all to #MakeAmericaGreatAgain. Remember! We need to energize EVERYONE to get out and VOTE!#Trump2016"},{"comment_id":"10154525745813893","commenter_b":"Your right ILLEGAL immigrants aren't eligible for benefits but the assumed identity they use is! Again seen it first hand! The children who are born here (AKA:Anchor Babies) are also eligible. With that in mind generally mom won't get deported and OUR government will assist her in getting a temp visa to stay. Then guess what she becomes eligible for the same benefits. Illegal documents are created at flea markets etc.","commenter_a":"Well.... Will the ILLEGAL immigrants also be boycotting emergency rooms, welfare, etc. today? If so we could save millions of tax payer dollars today..... I won't be holding my breath.","post_message":"\"Due to insufficient staffing levels, we will be closed today. Please come back and see us tomorrow,\" Torchy's Tacos - Houston Heights posted on Facebook."},{"comment_id":"10154490901549062","commenter_b":"She has that privilege","commenter_a":"Well at least she looks happy.","post_message":"The Drug Enforcement Agency has confirmed that a woman arrested for allegedly selling drugs in College Station is the daughter of a DEA agent."},{"comment_id":"10154499778649091","commenter_b":"Edwin, you only sound ignorant.","commenter_a":"I proposed a law in which all pit bull owners and their dogs take obedience training. The dogs and owners should take some test to see if dog can handle being around people. Too many times do I read stories about pit bull attacks. I know they all aren't bad, but some tend to snap and kill or severely injured people. Let's all write to trump so he can executive order this law","post_message":"After a young boy was seriously injured after being mauled by one of two pit bulls inside his Brooklyn home, his uncle says the 5-year-old took the brunt of the horrific attack to protect his younger siblings."},{"comment_id":"10153312840067098","commenter_b":"My point is, YOU don't know what people do.","commenter_a":"How about we worry about our homeless vets and not other countries people.","post_message":"The results come amid a heated debate in the wake of the attacks in Paris..."}]
