[{"comment_id":"10153245198116323","commenter_b":"The women has no idea , if you want to walk in the shoes of a low income American, dont play at it go and talk to one and find out how they really live from day today ,week to week,then come back and try and put your self in there shoes see then how hard it is","commenter_a":"'watching roaches climb the wall, if you called your dad he could stop it all '","post_message":"As Gwyneth Paltrow put it, she is walking in a low-income American’s shoes. But is she really?   The reality is more complicated."},{"comment_id":"10154476200391037","commenter_b":"Experts still deny Free trade causing poverty joblessness....they still maintain America cant make its own goods that we must import or fall into some economic abyss! At the same time they back Hillarys claim that she can create some kind of new jobs that doesnt involve manufacturing?? Lets speculatefor a moment that 25 years ago our govt agreed to stabilize China by implementing Free trade...it created a middle class helped create a market for us to trade with down the road... they have enough money to buy from us but 25 years ago the large population was mainly poor. and it made Chinese govt more stable...Govts make these kinds of trade offs everyday...greater good it will pay dividends we have to think of the future all of that kind of nonsense while sentencing 3 generations of American workers to a deadend future.","commenter_a":"obama has done a great job dividing people...Time to fix that!!..TRUMP 2016!!","post_message":"'We need more love and kindness in this country,” Hillary Clinton said. 'The last thing we need are leaders who try to divide us even more than we are.'"},{"comment_id":"10153526551574497","commenter_b":"Now those fuckers will manage to rename their country as 'Aaaamerica' to undisputably top the list...","commenter_a":"Not if you use America","post_message":"Via ClickHole"},{"comment_id":"1049118838444933","commenter_b":"Ross I'm quiet familiar with what you and others want, but that's not the way it is,especially me. I served this country for my beliefs and I'll be damned whether people like you like my opinions or not. One day when the liberals get their way and all the refugees and ILLEGALS are let in this country then maybe you may see what I'm talking about. Either way its not my problem, I've served my time and paid a life time of taxes and still paying. No I think Ross today's society are out of touch with reality is the problem.","commenter_a":"As an older person I've come to the conclusion you can't blame these young snot nose, entitled brats. This is the environment that's been created by the liberals, so everybody can feel hunky dory.","post_message":"She probably won't be too pleased..."},{"comment_id":"10155761644675725","commenter_b":"The employee should of knocked that bitches teeth out","commenter_a":"Kristin Nugent Grigsby","post_message":"A woman has been arrested after allegedly biting a Macy’s employee over a Michael Kors handbag ---> @webpagelink"},{"comment_id":"10157030256485615","commenter_b":"'The Tennessee hardware store owner who banned 'the homosexual people' and posted a 'No Gays Allowed' sign at his business last year recently constructed an outhouse that he's calling a 'Transgender Bathroom.' @webpagelink","commenter_a":"yeah he test each person that comes in his store","post_message":"And yes, he sells 'choose god or gays' hats, too..."},{"comment_id":"660877367410427","commenter_b":"RACISTpig fucker","commenter_a":"Fuck you nigger u suck anyway","post_message":"Can i get a collective '______this Guy'?  Shop.tacticalshit.com"}]
