[{"comment_id":"317547525326742","commenter_b":"To pay the illegals","commenter_a":"GREAT NEWS!! You just keep spiking those taxes..why stop there..RAISE TAXES ON EVERYTHING....YOUR GOING TO NEED IT! Besides..dont you left winged morons believe in taxing yourselves into welfare?? Good job!! GO CALIFUCKUP!!","post_message":"Robbing Peter to pay Paul..."},{"comment_id":"1130900020321866","commenter_b":"'@username, it's a meme, I'm not a cop. Ignorant women these days, geez.","commenter_a":"I don't see a problem. Carson is honest and leaves room for error. The ONLY perfect man was crucified. Trump/Carson. Make America Great Again","post_message":"Dr. Ben Carson just made an absolutely stunning statement about Donald J. Trump.  What Carson said has some asking if he's really on Trump's side at all.  NOBODY saw this coming..."},{"comment_id":"10153916227396756","commenter_b":"I'd still prefer to toss Mississippi out of the US. For this exact kind of thing, actually.","commenter_a":"Whenever someone complains about the Confederate Flag i just look over at the ol' Stars and Stripes and think 'guess your times coming too'.","post_message":"After the student senate vote, Mississippi Gov. Phil Bryant said, 'I think college students react a lot emotionally,'"},{"comment_id":"10153180369332042","commenter_b":"Idiots.there goes their life down the drains.","commenter_a":"White trash ! Throw Away the key","post_message":"SINISTER GROUP 'PROJECT:' These 5 students met before and after school for week -- but they weren't working on a group project for class or a fundraiser for a pep rally.   Cops say what they were planning on doing was deadly."},{"comment_id":"1136752646369001","commenter_b":"No the world is laughing at America","commenter_a":"The most pathetic, delusional president in history by far. Terror, hatred, murder and division all over the world like none in recent history and he says something so outrageous? Embarrassing and the world is laughing at this fool.","post_message":"Obama thinks we're living in the most peaceful time in history."},{"comment_id":"10156122397820354","commenter_b":"Hang her worthless ass for treason!!!","commenter_a":"Sickening","post_message":"Yesterday, a defiant Hillary told the AP she wouldn't apologize for endangering U.S. national security with her unprecedented secret server scheme. Today, she flipped.    FACT: No other Sec. of State in American history has EVER set up a secret private server. Period."},{"comment_id":"10153071973637217","commenter_b":"Whats up with the broken leg? Haha random","commenter_a":"... well ... coulda been worse !","post_message":"24 unconscious, several dislocated shoulders and 1 broken leg"}]
