[{"comment_id":"515781365279110","commenter_b":"I wouldn't give any fucking nigger s dime fuck them blue gum peace of shit","commenter_a":"No way! It has been so long it did not personally affect them. Get over it, and move on.","post_message":"This state just approved a resolution which will require residents to compensate blacks for slavery. Everybody is looking for a handout. Slavery has been abolished for a long time. Do you think you should be required to compensate blacks for slavery?"},{"comment_id":"10152898071811336","commenter_b":"illegal aliens no doubt !","commenter_a":"Are you kidding me, do parents have any responsibly any more.","post_message":"The nation's second-largest school district is eyeing a move to offer dinner to students at every school."},{"comment_id":"1753991328222832","commenter_b":"Angry, angry woman.","commenter_a":"I hear some sniffles coming out of Philly, sure sounds like a bad case of the Blue Flu may be headed that way","post_message":"We'll see what ends up happening..."},{"comment_id":"10152976248907232","commenter_b":"I am guessing both Pamela and Leslie are cop wives, or just like giving cops free head","commenter_a":"You know what boggles my mind is how they are here to protect and to serve but it goes both ways here .. they are paid by our tax $ to protect and to serve and yes there job is a hard job but at the end of the day these ppl are just like anyone of us ppl of the streets but I'm confused as to why if little mikey off the block killed somebody beat somebody or whichever would get a he'll of lot of years in prison and cops who are supposed to be here to protect and serve us would get a slap on the wrist or a leave of absence and paid .. so in reality we are all not treated the same by the system but let's just keep being blinded to the matter it has nothing to do with race it has to ...","post_message":"Thousands of demonstrators stood on sidewalks in Delaware County to show their support for law enforcement. STORY HERE: @webpagelink"},{"comment_id":"10152724871896045","commenter_b":"She wasn't spanked. She was whipped with a STUDDED belt.","commenter_a":"I wouldn't shame my kid in that way but there's nothing wrong with a spanking. Spare the rod spoil the child. If you don't guide them as parents they don't learn.","post_message":"A Florida woman is charged with child abuse after she sent her daughter to school with a t-shirt shaming her about bad grades. It's what the school noticed after giving the girl a new shirt to wear that got the mother arrested."},{"comment_id":"1036339909720353","commenter_b":"Skye Waters Maite Roman","commenter_a":"You guys just love to look down your noses at others. Yes, it is an incorrect viewpoint, but ridicule is for idiots and children.","post_message":""},{"comment_id":"1596151633736175","commenter_b":"This is what happens when their is no understanding of the real threat. Neither Iran or North Korea pose as large a threat as Climate Change. Not belief, understanding.","commenter_a":"Climate change does not matter to me North Korea and Iran want to destroy us probably a more urgent matter?","post_message":"Twenty-one kids and climate scientist James Hansen sued the Obama administration to take more aggressive action on climate. As of Thursday, the climate-change-denying 45th president has inherited the case."}]
