[{"comment_id":"10153286970856167","commenter_b":"Help the refugees by free their homelands from the bad people the world support with weapon and money for other profit exchange !! They are running away from their own evil ... This evil was created by the collective separations of this planet God of profit America is the only place in the planet When soon or later the origin of the people is not matter any more .. This will hopefully be our new planet order","commenter_a":"In the 1930s we turned away thousands Jews due to xenophobia, many of them later died in camps. Are we going to repeat the same mistake now?","post_message":"Since the Paris attacks, there's been a lot of hate. Here are the top five best responses to all the bigotry. Watch:"},{"comment_id":"1335655576501194","commenter_b":"Omg this little girl does need someone to beat her ass. Khloe can do it lol","commenter_a":"This lil girl is trash shame on her people need to stop giving her 5 minutes of fame","post_message":"She's calling out Kylie Jenner!  #WSHH #CatchMeOutside #KylieJenner"},{"comment_id":"10154973031601509","commenter_b":"yah ! you r big brother of DONAL TRUMP .","commenter_a":"Farage is a racist. And Trump is a racist. Racists love each other.","post_message":"Brexit leader Nigel Farage: Donald J. Trump 'dares to talk about things that other people want to brush under the carpet... For the United Kingdom, I think Trump would better for us than Barack Obama's been.' @webpagelink"},{"comment_id":"10153384076168984","commenter_b":"Pussy fks will never face us directly","commenter_a":"Absolutely","post_message":"ISIS is not backing down. Last week’s attack in Texas is only the beginning of its plans to reign terror on the people of the United States...  Would you support wiping out ISIS?"},{"comment_id":"1001794969843293","commenter_b":"Feminism is cancer.","commenter_a":"Sorry lady but I put my arm around my wife because I lover her. She does the same to me and we have been married for 49 years. Maybe you ought to try a little bit of love instead of hate.","post_message":"The Dame has spoken."},{"comment_id":"1382876735088925","commenter_b":"This bitch is evil","commenter_a":"I bet bin laden isn't dead. !","post_message":"THIS IS ABSOLUTELY HORRIFYING!"},{"comment_id":"1824785004425894","commenter_b":"Women who support Trump have severe Stockholm syndrome and suffer insecurity","commenter_a":"Three times divorced, womanizer dares to talk about morality.","post_message":"Let's talk about the debate...what just happened?"}]
