[{"comment_id":"10154110742322439","commenter_b":"Cowards !! Stay to fight for your country !! You are Iran's puppets !!","commenter_a":"No problem. Enlist them in the French Foreign Legion - minimum 12 year enlistment; send them to Corsica for Basic and Combat training, and then deploy them to Libya to fight ISIS.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153236448557042","commenter_b":"What's she trying to prove? Don't let her use her bank account or any money she has.","commenter_a":"And what about cheap clothes too , as well as cheap beauty products .","post_message":"OSCAR WINNER LIVES OFF FOOD STAMPS: Gwyneth Paltrow, often criticized for elitist comments she made in the past, is going on food stamps.   The actress will live off just $29 in groceries for a week to bring awareness to the difficulties of living under the program."},{"comment_id":"10154023438494486","commenter_b":"WHERE IS HILLARY? SHE SHOULD BE THERE, SHE WOULD HAVE GIVE HIM A BIG HUG OR A BIG KISS.....LMAO","commenter_a":"I don't think Obama was trying to shake his hand. it was almost like he tried to put his arm around Castro's shoulder and Castro stopped him or something. It was weird.","post_message":"Be careful! That's his THROWING ARM"},{"comment_id":"10153026927846051","commenter_b":"Cut down on fraud and kick out the illegals","commenter_a":"I live in Arizona. Thank you Gov. Ducey. So much welfare fraud. So many illegals getting enough benefits, to make you see red! 4 million people waiting in line to come here legally. They have been put on hold to accomodate the illegals. This is sooooo wrong.","post_message":"This state just reduced the amount of time people can spend on welfare to the shortest in the whole country."},{"comment_id":"1263988416963489","commenter_b":"'@username yes it means no crime was committed. It means she's innocent of any wrongdoing. This is America.","commenter_a":"Did they fit her for her orange jumpsuit yet? A woman in the White House is just a novelty. Wake up America! She is a criminal!!","post_message":"“The other day, Mr. Trump accused me of playing the ‘woman card’…”  WATCH: During her victory speech tonight, Hillary Clinton turned her attention to Donald J. Trump and Republican talking points."},{"comment_id":"10154362083273325","commenter_b":"Oh Baloney California is the Welfare , Illegal State !","commenter_a":"California is what's known as a donor State, in other words, we pay more in Federal taxes than the services/benefits we receive. This idiot needs to do some research before threaten us with his ridiculous tweets. #Resist #NoBanNoWall #RussianPoodle","post_message":"Describing California as 'out of control,' President Trump said he would not be opposed to using defunding as a 'weapon' against states that want to be sanctuaries for undocumented immigrants."},{"comment_id":"10153847161829203","commenter_b":"He probably didn't know the virgins are 20 year-old males who still play Pokemon.","commenter_a":"Enjoy the virgins, shithead.","post_message":"CONFIRMED: Paris Mastermind Dead"}]
