[{"comment_id":"1211860118868990","commenter_b":"Hopefully Bernie can take control of congress, and we can keep moving this country forward! #DontPushAmericaBackwardsAgain","commenter_a":"It's gonna be ... Huge ...!","post_message":"I hope today we defeat Donald Trump, and we defeat him badly. iwillvote.com"},{"comment_id":"579603902228604","commenter_b":"She must have morals","commenter_a":"Oh the horror of it all! Freedom of speech, freedom of choice, oh now we have her! Pathetic!","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"10152887029056336","commenter_b":"The yatahays are the illegals!!!","commenter_a":"We're all immigrant, except the native Indians.","post_message":"JUST IN: In a 237-190 vote, the House has voted to overturn President Obama's executive actions on immigration that extended protections to millions of people in the US illegally. @webpagelink"},{"comment_id":"10154415286659445","commenter_b":"I don't know I live in a 3 family Black family on the first floor Hispanics on the second & Im Italian but white on the third","commenter_a":"woah?!?!?","post_message":"WCVB presents a town hall meeting on #RaceInBoston in partnership with The Boston Foundation. Watch on WCVB and share your comments below. @webpagelink"},{"comment_id":"958986307470162","commenter_b":"Beware, ladies!","commenter_a":"There's zero evidence supporting that he was filming her. The only harassment caught on film was of the women berating a man. This guy will have a great lawsuit for slander against her.","post_message":"This woman just gave a street harasser a taste of his own medicine."},{"comment_id":"843529112375874","commenter_b":"About time someone takes a stand. Great job now everyone else needs to fall in line and do the same.","commenter_a":"Good for them","post_message":"REVENGE: French Attack Mosques And Blow Up A Muslim Kebab Shop Looks like the French have had enough of the Muslims immigrants living there and are fighting back! @webpagelink"},{"comment_id":"1768726713375361","commenter_b":"I agree tone down a little and let her hang herself.!!!!!","commenter_a":"I think Trump would be the best of the 2 evils, but with all his smart remarks it looks like he is trying to help Hillary. He needs to tone down and run on his own platform and let her hang herself.","post_message":"YES!!"}]
