[{"comment_id":"1792151467673200","commenter_b":"Right a true nasty woman!","commenter_a":"The only \"educational\" facet in Rosie is her nastiness! Period.","post_message":"Rosie O'Donnell says she posted a tweet questioning whether Donald Trump's 10-year-old son is autistic because she found it \"educational.\""},{"comment_id":"425439057626422","commenter_b":"Can you imagine an entire supreme court of Ginsburgs? Elect Hillary and we'll have it. She is a wretched witch that is a discrace to the court and she's not alone.","commenter_a":"She woke up cranky from her nap.","post_message":"It was completely inappropriate for Justice Ruth Bader Ginsburg to attack Donald Trump’s candidacy. This is not the role of the Supreme Court, and it serves as another reminder of what we’re up against in 2016. Help me fight for the Constitution and protect the integrity of the Supreme Court by joining my Fight for the Court campaign. www.fightforthecourt.org"},{"comment_id":"850412481815995","commenter_b":"Ungrateful bitch deserve to be slaped","commenter_a":"Y can't fix stupid","post_message":"If you disrespect our troops, you don't deserve to live in this country. They are the reason you have freedom. They keep us safe. What do you think her punishment should be?"},{"comment_id":"10155810026285725","commenter_b":"Now Mr Trump you know as well as I do Obobblehead is a backstroker, he says one thing and then does another, then tries to back stroke to cover his lies","commenter_a":"Finally someone who thinks like a REAL American!! You have our vote.","post_message":"Make our borders strong and stop illegal immigration. Even President Obama agrees-"},{"comment_id":"1122827437738266","commenter_b":"Go home Elsa, you're drunk....","commenter_a":"the cold never bothered us anyways... amirighyt?","post_message":""},{"comment_id":"1049777781778246","commenter_b":"@username aw did I offend you?, I'll consider your little bitch feelings next time you comment ok. Lmfao pathetic","commenter_a":"Approx 100 million gun owners in US , approx 200 million guns, several trillion rounds of ammo. If us \"white guys\" were the problem, you'd Damned sure know it.","post_message":"Clear as crystal. FOLLOW US at Reverb Press and Stories That Resonate."},{"comment_id":"1753991328222832","commenter_b":"Angry, angry woman.","commenter_a":"I hear some sniffles coming out of Philly, sure sounds like a bad case of the Blue Flu may be headed that way","post_message":"We'll see what ends up happening..."}]
