[{"comment_id":"517589811698946","commenter_b":"No it is a religious theme park what is wrong people want to let Muslims in our schools and force our American children to learn there karen but they don't want a Mural of God in a theme park .","commenter_a":"Freedom of speech. Don't like it go to another country.","post_message":"A theme park in Orlando with a Christian message was challenged by the Freedom From Religion Foundation over a mural that could be seen on the highway."},{"comment_id":"1217783301639772","commenter_b":"It's new- tella. Stfu","commenter_a":"Some people say nut-ell-uh and he's right. Nutella is absolutely nut-ell-uh. New-tell-uh is wrong.","post_message":"The right way to say 12 brand names you've been mispronouncing your whole life."},{"comment_id":"853169931483995","commenter_b":"The article isnt dissing Melania, it's reflecting on a direct quote where Trump said giving Ivanna control of a business property was the end of his marriage, and he learned he didn't want a wife who was ambitious, who worked, because that meant she didn't focus 100% on him. Which is sexist af. But he wants his daughter to be an Ivanna, so ... also hypocritical. Should women be successful in business or not, according to Trump? Are successful woman attractive to men like Trump. Read the article, it's not made up.","commenter_a":"Such an interesting article Christine Johnson!!! I find it all fascinating, will be so interesting to be around in Nov - when the country decides! Hope to see u tomorrow? Ax","post_message":"The Trump family embodies a very old sexist hypocrisy: men who want one thing for their wives and another for their children. Read in The New York Times Opinion Section."},{"comment_id":"738710359595478","commenter_b":"Where the statement from Obama to put an end to the violence, condemning of those who perform these horrific acts. Do you hear the crickets? Our prayers are with the family","commenter_a":"Fry that fucker no trial save taxpayers money.","post_message":"It keeps happening.....rest in peace."},{"comment_id":"10153212114294087","commenter_b":"You're a vile fucking stupid bitch.","commenter_a":"this Pope is insane he's the worst one ever he says blasphemous stuff no wonder that idiot Obama ass licker biden likes him","post_message":"Joe Biden: \"I admire Pope Francis deeply and I'm excited about his upcoming visit. Pope Francis has become a moral rudder for the world on some of the most important issues of our time, from inequality to climate change.\""},{"comment_id":"10154197437622426","commenter_b":"It's reality, white suburban women. It's not fair but it's a fact. If you're so concerned why don't you go down to Hillside Court and walk the kids home from the bus stop.","commenter_a":"School need more money but kids have 300$ shoes .500$ phones and say look at me and wonder why this happens.","post_message":"The robbers, described by police as young adults, threatened to beat-up the student if he did not take off his shoes and hand them over."},{"comment_id":"843529112375874","commenter_b":"About time someone takes a stand. Great job now everyone else needs to fall in line and do the same.","commenter_a":"Good for them","post_message":"REVENGE: French Attack Mosques And Blow Up A Muslim Kebab Shop Looks like the French have had enough of the Muslims immigrants living there and are fighting back! @webpagelink"}]
