[{"comment_id":"10152705258007144","commenter_b":"How can we believe anything he says after lying so many times??..and they said Obama lies!!!! And I am one of the 47%!","commenter_a":"Dipshit: Same path doesn't equal new outcome","post_message":"Mitt Romney is quickly rebuilding his campaign network for an \"almost certain\" run."},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. \"We hope and pray the U.S. Coast Guard is able to bring Samantha home.\" @webpagelink"},{"comment_id":"1241741129230844","commenter_b":"Donald Trump made racist white folks take they mask off, if you support Trump you are lowKey crazy and Racist, Trump's rich ass don't give a fck bout the poor, #BlackLivesMatter #Mexicans , he dont give a fck bout people from the bottom, the ones stuck in the hood, he only gives a fck bout the rich white and wealthy, ,...he started a Race war, he just motivated and inspired the KKK even more, kkk supports him to the fullest, he's gonna make this country more heated and more and more hatred between white people and the rest of the Race's , ...fck hillary too, but trust me Donald Trump is not a good option, he wanna make America white again","commenter_a":"Be a good time to start deporting.....thats how you catch illigals hold a Trump rally just bring in the busses and load them up....lmao","post_message":"Protesters remove their clothes at a Trump rally just before they flood the streets and destroy property."},{"comment_id":"1765015350452806","commenter_b":"This tells the whole story.","commenter_a":"Why can't people understand that the Clinton's are career politicians who amassed millions for themselves while being public servants and working in government? While working \"supposedly\" for we the people, they became millionaires. The same group of 1%s Hillary rallies against she is card carrying a member of.","post_message":"Don't let U.S. Senator Tim Kaine fool you -- the Clinton Foundation is a bastion of corruption."},{"comment_id":"10153494218169705","commenter_b":"If only we had as much passion directed towards stopping child slave hunters around the world","commenter_a":"Betty is a National Treasure and girlfriend can let loose whenever she wants","post_message":"Betty White has some harsh words for the Minnesota dentist."},{"comment_id":"10153068039414586","commenter_b":"Bitch if they could ride a Real tiger they would","commenter_a":"Uhh hello, theres elephants that are raised domestically in zoos and sanctuaries and in places where they're trained. And how would you know they're beaten? And btw horses started out as wild animals so your argument is mute. Pick a side, not just a specific animal","post_message":"PROOF that you don't need to use real animals to amaze a crowd.   CC: Ringling Bros. and Barnum & Bailey Circus #NotOurs2Use   SHARE if you're glad Katy Perry chose NOT to use live animals! #SuperBowl"},{"comment_id":"10154429082261378","commenter_b":"Yes...fix her a$$...so she can't bring any more babies in the world...","commenter_a":"Yes","post_message":"A judge ordered a drug-addicted mother of 4 who has worked as a prostitute not to get pregnant again. Is this order fair?"}]
