[{"comment_id":"10154347053069411","commenter_b":"45 million people on food stamps. 30 million illegal aliens allowed to run free while a record 2.3 million Americans are locked in jail. The largest national debt in the last 240 years. A record 95 million Americans are not in the labor force. The longest streak of war time in American history with 22 veterans committing suicide a day. A healthcare system than now kills a record 500,000 Americans each and every year while maiming millions more. The muslim Democrat Obama has proven he is an epic failure. Obama is killing Christians globally.","commenter_a":"People need to stop acting like that to cops if you keep resisting that's what happens! These cops are doing the best they can.","post_message":"'We f**ked'"},{"comment_id":"10153482997507550","commenter_b":"All illegals go back to where you came from. You are breaking the law. Get out.","commenter_a":"Arrest. Deport. Go back to Mexico and protest.","post_message":"View from #Chopper11HD of the #HB318 (immigration bill) protest in Raleigh abc11.tv/20e0DVL"},{"comment_id":"10152969881283188","commenter_b":"Leave Sarah alone!","commenter_a":"I agree with ya Glenn. Any dog will let you know if they don't like being bothered- for whatever reason. If the dog had wanted to move, he would have done so. Some people just like causing grief for others.","post_message":"On hate and Sarah Palin  In seeing that we have not seen or spoken to one another in maybe two years, sadly, I would not describe Sarah and I as \"friends\".   With that being said, \"lay off her!\"  As a huge dog lover myself, and two dogs that are like members of the family, I know that NO dog is going to lay around or take abuse.   For their dogs to lay down and allow trig to \"use him as a stepping stone\" shows that this dog loves, understands and is one with trig.  What is wrong with people.  Don't you have any cops to shout down, or chant \"kill, kill, kill\" or worse yet, don't you have any cops to gun down and execute in cold blood?\"  Where is the outrage?  Where is the media?  Where is our God?  Forgive me.  I know where he is.  We have exchanged Him for a cheap electronic, silicon filled or Wall Street version of God.     \"The gods of the copy book heading with terror and slaughter return.\"  Look out here they come.  I have been unplugged from the news for two weeks.  As I am making my final leg home with my dogs by my side, I decide that I would catch up on the news only to click on this story on the blaze.  What a mistake.  My wife always says, \"stop looking, it will all still be there in a week or two.\"   How right she is.  Look at what we have become.   Get a life.   Stop hating people.  We are not all going to agree.  As I said, the well between Sarah and I was poisoned by those who wished to control and hate.  I think.  Maybe I did something to poison it myself.  Could be.  I have done stupid stuff in the past without realizing it.  Her, them or me, makes no difference.  History bends toward justice and this it will all sort itself out.   That is okay.  We are not meant to agree nor am I someone that \"needs\" celebrity friends.   She doesn't always agree with me I am sure AND THAT IS OKAY!     I bring this up for all those on the left that think that we are all cut from the same cloth politically or socially.  We are not.   I have nothing to gain politically here, what I do have in common with Sarah is what I have in common with you too ... HUMANITY.    Do we even understand that concept anymore?  This has nothing to do with dogs, and if it does, you don't know what the hell you are talking about.  Maybe you have one of those little purse dogs.  This is a lab.    A boy and his dog.  This is all about hate for the Palins.    What is the meaning of diversity on the planet on which you live?    Sure there are crazy haters on the right and it is up to those who choose to set examples to shun them from our own personal ranks, but Personally, I have found the most violent and hateful are those who preach tolerance.   If you think it is horrible what a little sweet boy is doing with his dogs permission, Let me show you what millions of girls and women are doing to their children in the death camps of planned parenthood,  Black lives matter!   White lives matter!   Blue lives matter!    ALL LIVES MATTER!  I despise what we are allowing ourselves to become.  I will not join any one on this journey to the gates of hell.    LOVE and charity, forgiveness and understanding are the answers.  We all want to belong to something bigger and better than what we currently see.  We want to know we are being heard and can make an impact and we want control of our lives.  No one in Washington, republican or democrat, is helping us build that world.  The parties, universities and the media are shaping a culture of the silence of the lambs.    I reject that view and personally, because I can only effect me and those around me, I will take the beam out of my own eye first.   I have changed how I say and approach much of what I do, with the understanding that tables need to be upturned from time to time, but I will also work to wake those willing to be awakened about who is helping shape this culture.  Defund the GOP.  Democrats, unite.  When you clean out your house and we clean out ours, with malice toward none and charity toward all, we will be on the road of recovery and maybe our children will be able to live in a world where you income, sexuality, gender or political leanings mean exactly what they should mean:  NOTHING.  \"Forgive them Father, for they know not what they do.\" @webpagelink"},{"comment_id":"10154437809561491","commenter_b":"Sorry, no. She is front and centre in this kangaroo court of #45. She cannot have it both ways.","commenter_a":"Let the woman live her life. Sure, I cannot stand Donald Trump to save my life. But what is going to set us apart him? We do not judge people based off of the behavior of someone else. That's what being a liberal is all about. Acceptance of each and every person on the basis of their individual character.","post_message":"The Internet is not happy with the latest post by Ivanka Trump's brand."},{"comment_id":"857055204364524","commenter_b":"Just proves that he's good at beating up women too. And it's probably more fun since the women can't punch.","commenter_a":"Manny is no angel","post_message":"Floyd Mayweather has been charged with domestic violence on six separate occasions, convicted on five of those charges and has only served two months in prison, never receiving any penalties from the Nevada Athletic Commission regarding his professional boxing career."},{"comment_id":"891291447630577","commenter_b":"Turn the channel from Fox and get educated","commenter_a":"How anyone can back him after everything going on is beyond ignorant!!!! There r reasons he's the worst president ever!!!","post_message":"This one is HILARIOUS.   Thanks to Being Liberal."},{"comment_id":"536499096509675","commenter_b":"he is absolutely right, this would not be permanent just temporary until we can get a system in place to do more accurate check on these people coming into our country. fdr did it. and for a good reason .....to protect the American people from harm... that was his job.","commenter_a":"Hell Yes!","post_message":"Do you agree with Trump?"}]
