[{"comment_id":"10153136004245090","commenter_b":"She's an idiot","commenter_a":"She is a liar, sneaky, underhanded, untrustworthy and she needs to answer for Benghazi and the killing of those four innocent men. I hold her and Obama responsible. Would never want someone like this as President.","post_message":"Bottom line: Why don't you want Hillary Clinton to be President? Sound off here: @webpagelink"},{"comment_id":"10156202756245354","commenter_b":"@username, lol, I'm doing just fine sitting here on the beach. Awful life? Bitch please.","commenter_a":"How much did the Pope's dress cost?","post_message":"Pro-Tip: When bashing capitalism is your brand, it's best not to wear dresses that cost $2,300.00."},{"comment_id":"783731095008773","commenter_b":"Because illegals are the only ones driving without insurance right... please i bet more illegals have insurnace on their vechile then citizens for the fact they want no problem with authority","commenter_a":"Idiot","post_message":"Should dreamer's driver's licenses include the label \"non-citizen\" on them? The debate over that question is heating up after a rookie lawmaker tweeted about an upcoming bill he's working on."},{"comment_id":"10153437934696943","commenter_b":"Hillary did. She locked herself up in closet to take him down. That was when she lost her bar license for being both unethical and lying.","commenter_a":"Frankly, the Obama presidency, with all its scandals/crimes, has set incredible legal precedence for defendants to get away with almost anything, from lying, to destroying evidence, to treason, to tax evasion, you name it. Now, anyone accused of anything can simply demand equal protection and have their attorneys cite any one or all of the Obama Defenses.","post_message":"*** UPDATE *** This was a very big week for us, with tremendous results! As has been widely reported, we found almost a five-month gap in the emails Madam Hillary reluctantly returned to the State Department last year. But there more to the story..."},{"comment_id":"1017433231703049","commenter_b":"Cách đốt mỡ =)))))))))))))))))))))))","commenter_a":"Vivi Nguyen733970070144470 á đm....","post_message":"This is a giant ball of fire ants."},{"comment_id":"1259567494078669","commenter_b":"Just stop the CRYING,We didnt cry when Obama got in.Grow up!!","commenter_a":"Stupid is as stupid does.","post_message":"This just in..."},{"comment_id":"645079822349263","commenter_b":"Get Him the Hell out of the White House!!!!!","commenter_a":"Yeah no! Maybe make some toilet paper with his face on it","post_message":"Obama is trying change our countries money. He has absolutely no right to even consider this change. Do you think Obama deserves to have his face on a dollar bill?"}]
