[{"comment_id":"649071821906476","commenter_b":"THATS WRONG WITH THIS WORLD! Let her whipr children!","commenter_a":"Next time the boys won't be so lucky. Somebody just might get killed.","post_message":"Louisiana mother arrested after allegedly whipping her three children as punishment for breaking into a neighbor's home. \"I never could imagine that trying to be a good mother would end me up in jail.\""},{"comment_id":"10153986690345329","commenter_b":"Sebastian Franklin my hand on the way to the clippers game on the bus","commenter_a":"@username you","post_message":"You're not alone."},{"comment_id":"10152843821379440","commenter_b":"And what teams did you watch in the playoffs","commenter_a":"peyton manning and the broncos superbowl 50 champions :)","post_message":"Peyton Manning and Denver Broncos are working on revising his contract, which could explain why there's been a perceived delay in him formally announcing his intention to return in 2015. dpo.st/1LJlYy4"},{"comment_id":"10154042161636910","commenter_b":"USA Vets, homeless, the disabled! All of our own meaning legal USA citizens need to be taken care of FIRST. That's what we pay into. Get rid of who is faking it also.","commenter_a":"9th Circuit Court of Appeals issued a decision backing an earlier decision by a federal district court judge in Washington State that put President Trump national security Executive order affecting seven countries that harbor terrorists on hold. Activist Judges intruded into areas reserved by the Constitution powers which unambiguously gives constitutional powers to the President. That is why the 9th Circuit ruling is so fundamentally wrong by assuming the power of the President. It is the 9th Circuit that violated the Constitution under the Separation of Powers with its ruling. The fact is that President Trump clearly has the constitutional and statutory authority to issue this order. It is clear: radical Islamic terrorists are at war with America. President Trump order is a proper and constitutional way to protect America. Again, the directives contained in the President Executive Order are closely tethered to discretionary powers vested in the Executive Branch ...","post_message":"A MAJOR SETBACK FOR PRESIDENT TRUMP: The 9TH Circuit Court of Appeals has ruled unanimously against reinstating Trump's travel ban. Do you agree with the ruling? @webpagelink"},{"comment_id":"10153109594476519","commenter_b":"Women always tell there sob stories, leaving out key facts and events, seen it, been through it, went to jail over it!","commenter_a":"Men that beat woman usually don't get in fights with men.","post_message":"You'll never look at unrepentant woman-beater Dr. Dre again the same way after reading this..."},{"comment_id":"10153448155621045","commenter_b":"Sure","commenter_a":"Elizabeth Kidd can we please please please go see this in 3D when it comes out ? Without the kids the first time lol","post_message":"Cannot wait! \"Keep on swimming.\""},{"comment_id":"955377877852075","commenter_b":"Most corrupt woman in American history.","commenter_a":"Hillary is not only the MOST QUALIFIED candidate for president, she is an American shero. She has done and continues to do so much for our country and its people. I know she will create jobs, equality and so much more. Go Hillary, go!!","post_message":"Hillary has spent her entire life standing up for kids and families. That's why she's running for president. Watch one of our first TV ads of the 2016 campaign:"}]
