[{"comment_id":"10153763731329170","commenter_b":"Of course Obama and the Democrats will send them to Texas. That conservative state must stand their ground against the onslaught of terror on America.","commenter_a":"They are stuffing them into Texas in an effort to change us from conservative to liberal","post_message":"This shocking map shows exactly where Islamic extremism is festering within the United States... Has this scourge reached your community yet?"},{"comment_id":"10153192759821519","commenter_b":"Ignorant racist pig.","commenter_a":"You show a black Republican and I show you an Uncle Tom","post_message":"\"Ultimately, he has rejected the legacy and burden of the Black Freedom Struggle...\""},{"comment_id":"10154033192724087","commenter_b":"The white trash vote can win you the primary, just not a GE. They don't have enough Electoral votes.","commenter_a":"At this point, should really stop insisting he can't possibly become president. If we lived in a sane world, he wouldn't even be the nominee. But, here he is, and no matter what he does, people continue to support him.","post_message":"\"Donald Trump won’t be our next president come January 20, 2017, and here are 5 reasons why.\""},{"comment_id":"1009028342550450","commenter_b":"She is having them killed","commenter_a":"Hell yes she is responsible for that","post_message":"BREAKING: Another Clinton Associate Set To Testify Against Hillary Found Dead There's no way this is a coincidence. America deserves to know the truth. Do you think Hillary is responsible for this?"},{"comment_id":"10157286339920093","commenter_b":"There's no such thing as humane murder, just like there's no such thing as humane rape. Either way they're going to die and nobody wants to die. It's not our choice, these are foreign proteins that make our bodies suffer . They have a negative impact on us yet were continuing this vile massacre. Did you know that they rape cows ( the artificially inseminate them with a \"rape rack\").","commenter_a":"Humans love to kill land and sea animals. People are like cavemen and think they still have to kill to eat. I've been doing great for 20 years now without eating meat or seafood. I don't believe in killing things it's a pretty crappy thing to do. Heartless and inhumane. It's called using your brain and evolving. How can anyone with a conscience bully and kill something I don't get it.","post_message":"Hundreds of lobsters avoided being boiled alive thanks to a group of Buddhist monks."},{"comment_id":"10153292399553984","commenter_b":"He has it coming to him.","commenter_a":"yes I do","post_message":"Obama's big plans have blown up in his face! That's got to hurt... Do you hope Obama finally gets the message?"},{"comment_id":"10153656654198598","commenter_b":"I guess Margaret Sanger and her biggest admirer, Hillary, are accomplishing their evil goals!","commenter_a":"Whoa! That is alarming.","post_message":"More Black Babies in New York City are Aborted Than Born Alive"}]
