[{"comment_id":"10153566353686323","commenter_b":"Paul, I live in Heidelberg Germany. The Americans have left, and the army barracks have been filled with refugees. The plan was for 1200, but we have 1900. This summer, I drove to the UK. The British press reported trouble and riots in Calais and Dover - we sailed through, in both directions. Germany has taken 8x the number of refugees than Britain. And, incidently, I find that if I post here, I often receive an extremely rude and aggressive reply from someone in the UK. I find the British to be quite aggressive, probably frustration with the pro military, right wing, Banker Government, for whom they voted. (Preparing for a tirade of abuse here :) )","commenter_a":"Considering that the surge in recent immigration to EU is mainly due to military and political actions initiated and undeertaken by UK, US and France the hospitality displayed by Germany is more than commandable ... And the British attempts to refuse responsobility for the Lybian and middle eastern mess is plain shameful ...","post_message":"In July, Germany received 37,531 asylum applications, that is 5,586 more applications than the UK had in the whole of 2014."},{"comment_id":"1425850460773794","commenter_b":"She has obviously got a different understanding of Constitutional law than most citizens!","commenter_a":"Please go eat some cyanide soup...","post_message":"She is not fit for public office. Do you agree?"},{"comment_id":"1068974126482547","commenter_b":"@username, that is so true! WHORES ARE NOT WOMEN!","commenter_a":"Obama by far has been the worst president this country has ever had. He put America straight into the crapper. If Hillary gets elected she's going to pull the handle.","post_message":"We need to elect men and women who uphold the Sanctity of Life!"},{"comment_id":"1179704828736654","commenter_b":"What do you expect their natural prey is vermin after all!","commenter_a":"Omen? It probably thought his hair was a nest.","post_message":"This might be the greatest story of the week."},{"comment_id":"10153059346813525","commenter_b":"Stacey Panarelli","commenter_a":"If you read the whole story, the girl was able to free the dog and it came back to help her when she was in danger! What a HERO, Awesome dog that gave its life to save hers. About it being off leash, how many of us at a park take a pet off leash to fetch a ball or play or whatever? Have a HEART!!! I cant imagine what they are going through and its terrible those kids and Haze`s family watched in horror. My prayers and heart go out to them!!!!! Haze youre a hero dog!!!!","post_message":"\"By the time I got on the bank with 'Haze,' the gator is eyeing both of us.\" www.myfoxtampabay.com/story/@username/gator-snags-dog-on-hillsborough-river-as-family-watches-in-horror"},{"comment_id":"1779050492377737","commenter_b":"She can suck a large hot dog my dog is smarter than her","commenter_a":"He can sue her and make her prove it.","post_message":"Star Wars actress Carrie Fisher speculated Sunday night that Donald Trump’s occasional sniffling during the second presidential debate stems from the fact that he is “absolutely” a cocaine user..."},{"comment_id":"1546996122269558","commenter_b":"They should kill all the illegal immigrants.","commenter_a":"Cute he Looks Like A Real nice Guy?? Surprised Yo Mama Didn't pardon Him","post_message":"Texas Executes Illegal Immigrant Murderer, Despite Protests From Mexico. Good riddance. The world will be a better place. Do you think he deserved the death sentence?"}]
