[{"comment_id":"10153899711236509","commenter_b":"I'd hate to see when an STD breaks out lol!!!","commenter_a":"Mahalia","post_message":"Imagine living in a town where everything you need is under one roof. Welcome to Whittier: @webpagelink #GreatAmericanStories"},{"comment_id":"10156282327890294","commenter_b":"screw u u hateful witch\\\\","commenter_a":"Society isn't the problem. Men dressing like women and visa versa is the problem. Also, walking in to traffic is a problem. Don't walk in to traffic. Don't blame other people for your actions.","post_message":"“From a very young age I was told that people like me are freaks and abominations, that we are sick in the head and society hates us. This made me hate who I was, ' she said in the post.    She asked others to share her story and said, 'Please help fix society;' then she did something heartbreaking:"},{"comment_id":"10153706538451680","commenter_b":"Shut the F' Up","commenter_a":"I think it's great that Ghoul-iani and Drumpf both have direct lines of communication open to Russian intelligence, even more so than the CIA or FBI! That will make it easier for them to set up quick and easy direct deposit accounts to collect their paychecks from Putin.","post_message":"By casting the hack as a 'national security issue,' Giuliani said, Clinton's campaign and Democrats have 'proved ... she's a liar.'"},{"comment_id":"1030297853698998","commenter_b":"Wow NOW THIS IS A TRAGEDY! A YOUNG BOY GUNED DOWN FOR NO REASON BY A THUG GANG MEMBER ! I GUESS IF A BLACK MAN KILLS A BLACK CHILD IT DOESN'T MATTER! BUT IF A WHITE COP KILLS A BLACK THUG COMMITTING A CRIME IT'S A BIG DEAL ! LORD FATHER GOD TAKE THIS PRECIOUS CHILD AND HOLD AND CHERISH HIM IN YOUR ARMS ! COMFORT HIS FAMILY AND SEE THE JUSTICE IS FOUND FOR THIS CHILD ! AMEN","commenter_a":"So where is the Black Lives Matter group now?","post_message":"Chicago Black Gang Member Lured Child From Playground And Executed Him Point Blank  You mean #blackLivesMatter protestors are not rallying for this 9 year old boy who was executed by a thug! I guess his Black Life Didn't matter   @webpagelink"},{"comment_id":"10154177421583734","commenter_b":"OK, toss in Jesus too, and all the Angles, and it still won't get him the Seat.","commenter_a":"He could have God running with him . He still has no shot at winning","post_message":"Do you think Fiorina was a good choice for Cruz?"},{"comment_id":"619138891610023","commenter_b":"that alright. She can just leave the white","commenter_a":"Just shut up","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with.  Nobody cares. What a joke.  Do you agree Michelle Obama should keep her mouth shut?"},{"comment_id":"1783246305275728","commenter_b":"'@username Yes She did","commenter_a":"I am Dutch. Sylvana Simons said 'All White people are Racists'. Now everybody is angry at her. She never changed her opinion and never said sorry. She is a member of Denk, a Dutch Turkeys political party. The party has very extreme opinions and backs Erdogan without questions. They like sharia law, and child marriage.","post_message":"'People shouldn't turn it into something negative,' says one mum whose son dressed up as 'Black Pete' for a parade."}]
