[{"comment_id":"1702718559987828","commenter_b":"Vote Trump & #MakeAmericaHateAgain","commenter_a":"Enjoyed seeing everyone and the interaction. Refreshing to see and will support Trump all the way. Vote Trump and let's Make America Great!!","post_message":"GOOD MORNING! If you missed last nights #TrumpFamily Town Hall on CNN with Anderson Cooper- you can watch the full version here! My family and I had a wonderful time. Enjoy!"},{"comment_id":"584420751713216","commenter_b":"STOP muslim immigration permanently !","commenter_a":"Yes!!!! And not just muslins!!!!","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"},{"comment_id":"1287096984651728","commenter_b":"A Muslim Communist Terrorist...","commenter_a":"You mean 70% of America? The same 70% that pays the most taxes and fills our military ranks? I'd rather he just said thank you, ate pork and died.","post_message":"Is he racist?"},{"comment_id":"10152823238956130","commenter_b":"Women graduate at a far higher rate than men. From high school and college.","commenter_a":"And no the factors you listed clearly are important, not to discussing what wages should be, but to the discussion of why wages are not equal. Data clearly shows the problem is economic insufficiency, regardless of there being widespread discrimination. So we could make more progress closing the gap by everyone getting a better education (even at the library or online if you know how to source good) building your own successful business, or something innovative.","post_message":"This is what the wage gender page gap looks like."},{"comment_id":"1188981914457930","commenter_b":"A better statement than any feminist has ever made...","commenter_a":"Curtis Oakley","post_message":"They are doing it for a powerful reason."},{"comment_id":"10153948326234497","commenter_b":"I could totally help this bitch out","commenter_a":"@username, you could help this chick out for sure.","post_message":"\"I think I ready to put myself out there again.\""},{"comment_id":"10153137257982869","commenter_b":"Mr. McCain should not have called Trump backers, \"crazies\" but I dont hear any of you calling him on that. I like you Mr. Huckabee and would vote for you but understand that Trump is saying what we want ALL of you to say, the truth! McCain can no longer ride on his service alone, he is an awful senator and has done much to hurt veterans today!!!!","commenter_a":"I agree! I respect him for my freedom! He has been outspoken about issues I agree with - don't know what will steer our country In the right direction. I know we need prayer first! Who loves America the most should be elected! I love my country and love it's history! To all who love our red, white and blue!","post_message":"John McCain is an American hero. When our troops return from combat, they should be treated with the utmost respect and admiration. Every breath I breathe and every step I take is free because of brave Americans like John McCain."}]
