[{"comment_id":"10153889126257144","commenter_b":"@username stfu ass!","commenter_a":"Obama is going there to give a speech about how the truck manufacturers have flooded the market, so it is easier to buy a truck than it is to buy a book.","post_message":"This is awful."},{"comment_id":"10154898999434705","commenter_b":"Michael MacLeod are you kidding? Who says they are not. They have the most amount of refugees.","commenter_a":"Snowflakes and Hollywood dummies....read the executive order....no mention of Muslims any where. Still trying to figure out how so many of you could support muslims...they have no respect for women, queers, children, Christians and idiots like you.","post_message":"Helberg and wife Jocelyn Towne sent a clear message to Donald J. Trump."},{"comment_id":"10154440357348256","commenter_b":"ANY WOMAN BUT HILLARY!","commenter_a":"Looking forward to the Change!","post_message":"All 50 signed a letter warning that, if elected, Donald Trump \"would be the most reckless President in American history.\""},{"comment_id":"10154030310632061","commenter_b":"Hillary can send emails to Satan but Donald still won't get my vote!!","commenter_a":"She should be in jail!!! And she should have never been allowed to run for president! Now we have two people running and I can't stand neither","post_message":"The newly discovered emails that prompted the FBI to reopen the investigation into Hillary Clinton private server came from a separate federal investigation of former Congressman Anthony Weiner, multiple sources tell ABC News."},{"comment_id":"378200662557944","commenter_b":"Three of them are real ladies - the other two cannot even spell the word!","commenter_a":"Nancy Regan","post_message":"Who is your favorite First Lady ?"},{"comment_id":"1267309513345274","commenter_b":"Great comeback! :)","commenter_a":"Ya gotta love the way the Dems embarrass themselves in front of the entire world .... just say'n .. JBeale","post_message":"Allen West Republic"},{"comment_id":"10153057732666051","commenter_b":"She would of been bothering me..can I pull my junk out in public? No","commenter_a":"People and their phones need to get a life. This young Lady was not bothering him unless he had never seen a nursing child before. Sad world we now live in......","post_message":"A mother from Indiana was genuinely stunned when she found out that this photo of her had gone viral."}]
