[{"comment_id":"1061033490639256","commenter_b":"We don't have Sharia law in America, so count your blessings and quit squawking. You're only 4-5 % of the population, so don't blame us if you are outnumbered by the straights.","commenter_a":"dont know who she is dont care","post_message":"“Being a gay American, I know what it means to look at the flag and not have it protect all of your liberties,” said soccer player Megan Rapinoe."},{"comment_id":"10153705260739218","commenter_b":"All Lives Mater...another life ended and another life over.","commenter_a":"Every man woman and child makes their own decisions in life...don't know the circumstances but he has to deal with the outcome..not his father...prAyers to both families","post_message":"The son of a Baltimore Police Department commander has been charged with murder, sources have confirmed to the 11 News I-Team on Tuesday >> @webpagelink"},{"comment_id":"1752604474967964","commenter_b":"Feel bad that all she did went right over my head. We couldn't understand the words but we made many comments on her big butt and thighs! Someone that big should never wear what she was wearing on national TV!","commenter_a":"LL Cool JJ, what a douche. Looks like the Wayans brothers had this jackass pegged, way back when, with \" Momma's Gonna Kick Me Out ! \" Maybe on youtube? Funny stuff, but about right, apparently.","post_message":"LOOK who LL Cool J just compared Black Panther Party Supporter and radical BLM donor Beyonce to..."},{"comment_id":"10152949521626051","commenter_b":"she is not a mother no mother puts a man before her kids . sick bitch","commenter_a":"Wonderful Mom!!!! She should be locked up !!!!","post_message":"Every night this little girl has to lock her bedroom door so that the child molester who lives with her mother can't get to her."},{"comment_id":"758262410976191","commenter_b":"What a f--king liar!","commenter_a":"Chris is wrong Trump is right. Trump is the right man for the presidency. Get it and stop fighting a good thing for our country.","post_message":"Wow...Donald J. Trump and Chris Matthews agree that many Republican leaders and corporations don't want to stop illegal-alien hiring because they want the cheap labor."},{"comment_id":"10153408065894087","commenter_b":"Think all of you are missing the point. Women does it , Throw the book at her !!!!!!! Guy does it , oh yeah no problem .","commenter_a":"All these criminals need to go down, Hillary included","post_message":"Congressional Republicans are largely brushing off the news Defense Secretary Ash Carter used his personal email to conduct business at the Pentagon, in stark contrast to the scrutiny that has fallen on Hillary Clinton."},{"comment_id":"10156328907740354","commenter_b":"This cheap harlot is getting a high price for her prostitution. I can only expect less from someone as low as her.","commenter_a":"Nasty skank!","post_message":"Surely Scarlett Johansson is working on a Koran version as well. Surely that's happening, right?"}]
