[{"comment_id":"10154103102004170","commenter_b":"hillary is a pig liar","commenter_a":"Despicable HRC is! Oh, so despicable! 👎👎👎👎","post_message":"What kind of First Lady has so little class that she would say something nice about another First Lady, then apologize for saying the nice thing? Oh. Right."},{"comment_id":"1036060346447359","commenter_b":"No. They're asking for 80million guns to be pointed at their stupid ignorant ugly faces.","commenter_a":"Are they asking for another wounded knee?","post_message":" never seen anything like it, Cleveland resident Sheila Rodriguez told Fox News Latino. everyone is gathered in one place and everyone attention is focused on one place, a lot of things can happen."},{"comment_id":"10156131278050725","commenter_b":"only one that needs to apologize is hillary the corupt crook who lined her pockets and sold out the entire USA to make millions. where are those emails hillary?","commenter_a":"HELL NO!!! He doesn't defend America. When he starts defending America and her citizens, then we can start defending him.... if he does something right, that is.","post_message":"Am I morally obligated to defend the President every time somebody says something bad or controversial about him? I don't think so!"},{"comment_id":"1180802641955155","commenter_b":"Don't let this wicked woman get away !!!!!!","commenter_a":"BETTER LATE THAN NEVER!!!!!!","post_message":"GET HER!"},{"comment_id":"10153614298213812","commenter_b":"muslims are animals","commenter_a":"They need to do this to all Muslims so they can't breed....gfu","post_message":"Experts say the ancient practice is not officially linked to religion in any way: @webpagelink"},{"comment_id":"10152700491620779","commenter_b":"Heavens to Betsy, woman. Have you tried Fortitude?","commenter_a":"Thanks @username. I'm currently watching BB. Yes, I really am.","post_message":"Let's face it: We are currently living in the all-you-can-eat-smorgasbord era of TV viewing choices. The downside is that the abundance of stuff at our fingertips also makes it easier for jaw-dropping, mind-expanding small-screen masterpieces to come and go without so much as a peep. From a British gangster thriller to a surreal riff on twentysomething single life, click through for 10 shows you should be watching this year."},{"comment_id":"1813691558875997","commenter_b":"FU lying bitch","commenter_a":"She's fill of crap","post_message":"Hillary Clinton says people are \"concerned\" by Trump's \"divisive rhetoric\" and he needs to be stopped \"conclusively.\" Is she right?"}]
