[{"comment_id":"820316618158915","commenter_b":"Kick his ass out of this country,","commenter_a":"Black price of shit","post_message":"Trump Hating Thugs Split On Flag… Look What Happens Next [VIDEO]. If he was a real man and doesn't like this country or our flag he should leave. Do you think he should deported?"},{"comment_id":"10156566417190354","commenter_b":"Lets oblige her in a dumpster; place for Islam garbage.","commenter_a":"Did you know bullets and explosives have pig by products in them ?","post_message":"Her full statement is unbelievable..."},{"comment_id":"1757774521121112","commenter_b":"This is so DUMB! I would vote for any Republican before I would vote for \"Killery\" You sure don't know what you will get with her!.","commenter_a":"@username Agreed","post_message":"An RNC delegate just announced the great lengths she’d go to make sure Trump doesn’t win, it's not going to sit well with many people..."},{"comment_id":"685842924908994","commenter_b":"@username and you are a millennial piece of shit who does not know his ass from a whole in the ground. You should be stepped on like the cockroach you are.","commenter_a":"FYI, George Soros, Move On and Black Lives Matter are responsible for all of the protests going on. These are NOT groups of people who suddenly decided to protest. Therefore, the is more Hillary BS. However, CNN and MSNBC are blaming Bernie and Stein supporters. These people are insane. I am so tired of this BS.","post_message":"Protesters targeted buildings owned by Trump – burning effigies, setting flags on fire and chanting: “Not my president.”"},{"comment_id":"10154221931919199","commenter_b":"Idiot woman.","commenter_a":"At 44, she needs parenting classes! Did you read she's been stopped before for this! Someone call CPS for endangering a child!","post_message":""},{"comment_id":"10158045305755206","commenter_b":"Never get a mortgage if you lose ur job your F ed.My gran always said get a council house,If anything goes wrong they have to fix it,If you lose your job they have to pay your rent.","commenter_a":"@username read the comments.We Defo got to do the outer boroughs next time! X","post_message":"“I wouldn’t give this up for anything.”"},{"comment_id":"1640792116219030","commenter_b":"That takes some balls","commenter_a":"What a pair to draw too. How can anyone support these idiots.","post_message":"Details you'll want to know are here: @webpagelink"}]
