[{"comment_id":"943053922418420","commenter_b":"It's like 5 minutes and it's good. Watch it goddamn!","commenter_a":"@username watch the video xo","post_message":"Alan Watts delivered this profound message decades ago, and unfortunately not much has changed.  Vis Reset.Me"},{"comment_id":"10153218789208132","commenter_b":"What about women who cheat?","commenter_a":"If my husband cheated on me I'd do a lot more then throw a shoe at his face. This man should consider him lucky. Its SAS that people stick up for men when they cheat. And people wonder why women get upset in relationships.","post_message":"\"Wouldn't you be this upset if you came home to this?\" she said when asked if she had thrown the shoe."},{"comment_id":"10154012875581523","commenter_b":"Dawn did you see this mother fucker?","commenter_a":"Such a thug","post_message":"Was an Alabama man pushed to apologize because of public outrage over a social media post?  It sure seems that way."},{"comment_id":"1058824504164459","commenter_b":"@username are they in mexico legally? if they aren't, they'd be in a mexican jail. if they are. then go after your gvt for not preventing the assaults. the fact is this.. ILLEGAL entry to any country, including mexico, is against the LAW. Mexico has enforced their law and the US MUST TOO. That means a wall since mexican cartels have made another business out of smuggling people into the us and those who can't pay the cartels, find a different way. Mexico didn't like it when Guatemala did it to them and we don't like it here either.","commenter_a":"Mexico has the largest border wall on earth bordering Guatemala to the south in order to protect it from the violence and to protect its mexican culture. It shows the historically true nature of mexican politics since Maximilian was executed. Nothing in mexico is good for America at this time. We dont need there people drugs or crime.","post_message":"\"Suicide bombings in Israel went from 1,000 a year to zero a year once they put that fence up.\"  Yesterday, Mike Huckabee spoke to Uma Pemmaraju about walls, using Israel as an example of why they work."},{"comment_id":"10153847208137894","commenter_b":"Bitch get your pasty ass on with that lie. What personal struggles has to do with you utilizing the word??? White people are full of shit bc whatever was said she meant it. They love to come back with a weak ass apology as though that changes anything. I love it when they make an ass of themselves or get fired bc it shows them that that so called white privilege isn't paying off like they want. Well opps dumb bitch your bad.","commenter_a":"Miss 'm y ass ..bullcrab","post_message":"Miss Teen USA Apologizes for All of Her N-Word Tweets, Blames Them on ‘Personal Struggles’"},{"comment_id":"10153248489871037","commenter_b":"Rob your a pussy.","commenter_a":"Hillary for Prison 2016","post_message":"A variety of sources in the Clinton orbit say they are anticipating an imminent announcement of #Hillary2016."},{"comment_id":"10153940302636770","commenter_b":"Hillary need to be placed in jail","commenter_a":"Trump is going to say , Hillery u'r Fired !!!!!!!","post_message":"TheDC Election Night: Race is tight!"}]
