[{"comment_id":"10153154705006051","commenter_b":"Can't stand your ass either","commenter_a":"Can't stand Al Sharpton!! He is an evil racist!","post_message":"Al Sharpton was asked if the $5.9 million settlement for Eric Garner's death was enough. His response: No. He also has another demand. Do you agree or disagree with Sharpton?"},{"comment_id":"683007381889840","commenter_b":"Shut, your, cunt .","commenter_a":"She has no right to be called a first lady any more than her husband has a right to be called a president!!","post_message":"The White House is trying to cover this up as quick as possible. This comes as no surprise. She is the worst first lady ever. Are you disgusted by Michelle Obama?"},{"comment_id":"1136992022978933","commenter_b":"Every Bill which shall have passed the House of Representatives and the Senate, shall, before it become a Law, be presented to the President of the United States; If he approve he shall sign it, but if not he shall return it, with his Objections to that House in which it shall have originated, who shall enter the Objections at large on their Journal, and proceed to reconsider it. If after such Reconsideration two thirds of that House shall agree to pass the Bill, it shall be sent, together with the Objections, to the other House, by which it shall likewise be reconsidered, and if approved by two thirds of that House, it shall become a Law. But in all such Cases the Votes of both Houses shall be determined by yeas and Nays, and the Names of the Persons voting for and against the Bill shall be entered on ...","commenter_a":"It'll fail in the Senate, and if not Obama will veto it","post_message":"Even Democrats voted for a 'pause' on the Syrian refugee program."},{"comment_id":"10153918981451509","commenter_b":"Illegals are a huge problem","commenter_a":"Where is Donald Trump and his outrage????? Ohhh wait, you got to be illegal for him to care who gets killed!!!!!!","post_message":"The suspect in a shooting in an Antioch, Tennessee, movie theater is dead, Nashville police say. @webpagelink"},{"comment_id":"10153311857346323","commenter_b":"It's an attempt at humour, not political analysis. Lighten up.","commenter_a":"Guardian is now as bad as the Daily Mail , completely biased with dumb pointless analysis , just left versus right , I used to appreciate the Guardian but sadly it has lost its way","post_message":"Bill Brewster: \"The Milibands have arrived just in time for Ibiza's season opening parties, but there are plenty of issues on which they could campaign in Ibiza. There are the young workers on zero-hour contracts who flyer the beaches, often working on a basic of €50 per week. Then there’s the scandalous prices of the leading clubs, or the police, often accused of corruption and being heavy-handed. Mind you, after the campaign he’s just had, if I were him, I’d kick back the slingbacks and hit the horse drugs.\""},{"comment_id":"10152961609451336","commenter_b":"Suck my dick!","commenter_a":"Kanye is absolutely right!","post_message":"Kanye West stole the show again at The GRAMMYs after Beck was announced as the winner for “Album of the Year.” @webpagelink But was it funny this time or just offensive?"},{"comment_id":"1756436014601478","commenter_b":"Bye BITCH","commenter_a":"Makes me want to vote Trump","post_message":"The Fate of the Republic Hangs in the Balance..."}]
