[{"comment_id":"1172990589388617","commenter_b":"Bitch","commenter_a":"Marjolaine Morin","post_message":"Shouldn't their legs relax? Why do they curl up?"},{"comment_id":"10156455116700354","commenter_b":"Plenty of real women out there that they could have photographed","commenter_a":"A fucking lie from the liberal media why pretend.","post_message":"All 8 PHOTOS here..."},{"comment_id":"10153121276986051","commenter_b":"Tie her tubes. Now. Horrible mother.","commenter_a":"She is a great reason for forced sterilization","post_message":"This mom decided to let her 14-year-old have an alcohol-fueled, destructive party that lasted 3 days. You can probably guess what her neighborhood looks like now."},{"comment_id":"10154453372292149","commenter_b":"She, Bill are too quiet. Beware: they are coming back.","commenter_a":"Go to Jail........","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153576489935667","commenter_b":"Their aliens","commenter_a":"I wonder what it looks like now","post_message":"Experts have yet to identify their breed but guess they could have a bit of wild cat in their DNA."},{"comment_id":"10153062550892235","commenter_b":"Those ...fools...do not represent This Christian!😱😱. 😞😢. 😠😡. 😈😈. 😇😇","commenter_a":"Any religion that tells you where your going after you die is a CON JOB. What happens if it's just nothing but darkness after you die. You'd live your entire life by someone else's way. I say FUCK THAT! live your own life, make your own choices! Have sex with whoever you want. There is no hell. Let the pleasures flow! THERE IS NO JESUS TO SEND YOU TO A PIT OF FIRE. Hello..... your being manipulated, lied to, bamboozled!","post_message":"Way to keep it classy, bigots.   Attack a bunch of kids singing the National Anthem ..."},{"comment_id":"1084559504898393","commenter_b":"It altars your natural hormomes! Explains why there are so many beta bitches running around. Wonder if the artificial hormones affect future children somehow too","commenter_a":"'@username 😬","post_message":"Could the pill be altering your brain?"}]
