[{"comment_id":"10154310787426130","commenter_b":"I'm very disappointed with Meg Ryan. She must be in the pocket.","commenter_a":"Actual, I think Richard Dreyfus won that one (see his tweet at the end of the article).","post_message":"Megyn Kelly set him straight."},{"comment_id":"992882130761178","commenter_b":"#__ #__ #StopYazidiGenocide #StandforYazidiWomen","commenter_a":"'@username: .","post_message":"A behind-the-scenes look at a historic night. hrc.io/269ym4J"},{"comment_id":"1349219015129494","commenter_b":"Stfu","commenter_a":"Trumpers 2 days ago: yay Castro is dead! yuge win for free speech and human rights! CheetoJesus: citizens whom use their rights of free speech and ability to protest should be jailed or deported! Trumpers today: praise our Dear Leader! deport those commies!","post_message":"A fiery debate erupted over President-elect Donald J. Trump's proposed penalty for burning the American flag"},{"comment_id":"863998766982005","commenter_b":"Women. Are. Psycho.","commenter_a":"not worth it.","post_message":"A woman has died in a car crash after chasing down her husband who was with another woman. What do you think? Crazy details here:"},{"comment_id":"535259990005462","commenter_b":"I wish Dr Carson was our nominee! However, Trump is and he must win or our nation is doomed. Clinton has proven to be the most corrupted, evil lying politician ever!! It's beyond me that anyone in their right mind could support her!","commenter_a":"How can you defend this man?","post_message":"It's a shame that The New York Times and the media are on an all out witch hunt against Donald J. Trump. The media should be fair and balanced, not biased."},{"comment_id":"10153551674003984","commenter_b":"Latino's vote democrat most of the time anyway. Illegals shouldn't be voting. Lets crack down on cheating. voter ID.","commenter_a":"So now conservatives have to worry about the huge amount of Latinos who will vote Democrat in the 2016 elections, just because Trump voiced the truth about those coming here illegally. We have over a year to go before a candidate is chosen, giving the criminals who came over the border illegally plenty of time to change the minds of Americans.","post_message":"These days, Donald Trump seems to be at the center of every controversy.  He might just be in the midst of another one after this actress just thanked him for his stance on immigration...  Do you agree with Donald Trump's views on immigration?"},{"comment_id":"1588980671119277","commenter_b":"Agree all the way.the truth is black or white, can be proved.lies can not be proven.the cons get mad because facts on mostly on the liberal side. We can't help it if they love lies and are prejudiced to believe them.warped sub humans.","commenter_a":"Without fake news he and the GOP are dead in the water. Then all they have left is election rigging, voter suppression, and Gerrymandering. Oh yeah, and help from COMMUNIST Russia! And that just ain't enough!! #GOPTraitors","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
