[{"comment_id":"10154748214069486","commenter_b":"Fools all of them grrrrd","commenter_a":"WRONG!!!!...ARREST THE CLINTONS NOW!!!!...THEY WILL NEVER STOP ALL THEIR CORRUPTION UNTIL THEY ARE ALL BEHINDS BARS!!!!!!!","post_message":"Is this throwing in the towel?"},{"comment_id":"640100692862928","commenter_b":"Trolls- in 4 years we have elections again- what if next time the candidate you don't like cheats to win? Will you be OK with a corrupt election system then?","commenter_a":"THEY HAVE A RIGHT TO TRY TO STOP IT JUST LIKE YOU THINK YOU HAVE A RIGHT TO DO IT.","post_message":"The fight for #Recount2016 continues! We deserve a voting system we can trust, that is accurate, secure and just. Despite the sabotage, political cronyism, bureaucratic hurdles, economic extortion, and legal maneuvering that has been thrown in our way, this historic first-ever multi-state presidential recount carries on. I'm here to give you the latest updates, answer your questions, and talk about next steps."},{"comment_id":"10152933531687434","commenter_b":"Sex is only for straight, married, rich people!","commenter_a":"It's like they WANT teenagers to have babies. No sex ed, no planned parenthood. Since we know abstinence only education does not work, what else can we take from this?","post_message":"“If they’re doing such a great job, why aren’t these things better?” Bobby Jindal asked of Planned Parenthood."},{"comment_id":"10156385306200231","commenter_b":"She nonce play a white girl maybe she believe she one of them","commenter_a":"Can she be traded in???","post_message":"Why Stacey Dash? Why?"},{"comment_id":"10153321006269087","commenter_b":"What fucking jobs are the illegal immigrants are taking dum ass?? Please fucking tell me!!!","commenter_a":"94 million Americans are not working. Is it because they have become dependent upon the government? Or is it because the Illegal immigrants have all the jobs? 30 percent of all federal prisoners are illegal immigrants. Immigrants are killing Americans: According to the Center for Immigration Studies, 57 percent of the 76 fugitive murderers wanted by the FBI in 2009 immigrants entering the country illegally have a criminal record in the U.S.: In 2010, the Border Patrol reported that 212,000 illegals were caught in the Tucson, Ariz., sector alone, and as many as 30 percent of them already had a criminal record in the U.S. The Pew Research Center estimated that there are nearly 12 million illegal aliens in the nation and the key word is 'estimated'. What's wrong with deportation of illegals? The answer is: nothing. The country would be greater without them.","post_message":"'The idea of tracking down and deporting 11 million people is absurd, inhumane, and un-American,' Hillary Clinton tweeted. 'No, Trump.'"},{"comment_id":"10154037878823984","commenter_b":"Mr. Trump from the time he started his campaign he has always states that all the illegals have to go back have to go back to Mexico and Central America but yet he is one of the largest employers in the Real Estate , Casinos , Hotels, and Golf Courses business, has bragged about hiring illegals to including his contractors and subcontractors and they love him 1. did he use e-verification to see if he or his contractors and subs to see if they had a work permit or they are who they say they are. 2. you claim you want to help the veterans but your company hires more illegals than vets. 3. if you are serious about what you are campaigning on why not be the first to fire or dismiss the illegal aliens and fill those jobs with veterans lead by example and make America great again ...","commenter_a":"Yup another lifer. GET RID OF POLITICAL LIFERS THAT ARE FEATHER BEDDING Stump for Trump. You Go Don, Go Don all the way to the WHITE HOUSE.","post_message":"Wow. The governor of Iowa is actively working against one of the GOP's most popular presidential candidates. This is very unusual for the Iowa caucus... the Iowa governor must feel very strongly about this.  Do you agree with the Iowa Gov.?"},{"comment_id":"10153009921992507","commenter_b":"I'm with you. I could teach a class in this at this point, because most women DO NOT CLIMAX without clitoral stimulation, no amount of deep thrusting will do","commenter_a":"This is quite common, and enjoyable for the man if he grows up. When she's using the vibrator & he is inside it feels like the penis is vibrating","post_message":"Awkward!"}]
