[{"comment_id":"1134556746600853","commenter_b":"She's no better.","commenter_a":"Trump is the devil...if he be elected to be the president...he's gonna start the world war III. HILLARY 2016-2020 !!!","post_message":"Estas son las promesas de Trump. Así podría ser su presidencia…."},{"comment_id":"1187762051262009","commenter_b":"Build a defense wall also protects from evil ducks.","commenter_a":"President Trump will think of something.","post_message":"China have finally confirmed that they have lost control of their space station."},{"comment_id":"1440023386030632","commenter_b":"Amen","commenter_a":"It's really a fresh wind","post_message":"Find out why Judea and Samaria leaders say, 'a new wind is blowing from the US.'"},{"comment_id":"10152916992026749","commenter_b":"stfu","commenter_a":"Horrible man!!!!!!","post_message":"First Steps."},{"comment_id":"1349180015160531","commenter_b":"I'm guessing it won't be Christians?","commenter_a":"Now we know what iran is using all that money obama gave them for. Old Valerie has been running the government for some time. Once these nuts get you guns guess who will march in.","post_message":"In a sickening op-ed piece for The Huffington Post, Valerie Jarrett basically 'killed off' her own grandpa in order to push for her agenda... GUN CONTROL.  This is absolutely revolting... take a look at what she did."},{"comment_id":"10153141686007093","commenter_b":"No she isnt..cause when you see a 400 lb woman wear them and you can see through them then you will be on her side! !!!!!!!!!!!!!!!!!!#!!!!!!!!!","commenter_a":"She's just all butt hurt because she doesn't have a nice body to pull off wearing leggings like they're pants ;)","post_message":"It's leggings season. But according to one woman's viral rant, a lot of people don't wear them correctly... @webpagelink"},{"comment_id":"1329754913767400","commenter_b":"Both those women have lost their minds.","commenter_a":"The comedy act of Waters and Pelosi are more entertaining than SNL. Keep up the good work, this will assure another republican landslide in 2018","post_message":"TIME TRAVELER NANCY PELOSI Says She Just Can't Work With...President Bush??? [Video]  Haha! Check out Maxine Waters!"}]
