[{"comment_id":"10153955830944087","commenter_b":"Never trust a woman in a white pants suit.","commenter_a":"No bitch, that's not how this works!","post_message":"#BREAKING: Hillary Clinton accepted the Democratic Party’s nomination for president Thursday, making history as the first woman to lead a major political party."},{"comment_id":"1606743262959812","commenter_b":"Run cock roaches run!","commenter_a":"If only","post_message":"WATCH LIVE: Protesters are filling the streets in Charlotte after police say an officer shot and killed an armed man. @webpagelink"},{"comment_id":"884237154958166","commenter_b":"I would rather help pay his court fees than support all the illegals obummer opened the door for.","commenter_a":"Once Joe is gone the new one will see what it is costing the county and shut it down. The court problems Joe is going through now is just the beginning of his downfall.","post_message":"SOUND OFF: Tent City Jail turns 22 years old, and some people think it is time for Sheriff Joe to shut it down. Let us know what you think, then tune in to FOX 10 Arizona Morning and we will use some of your comments on the air."},{"comment_id":"10152767856712426","commenter_b":"Hide yo kids hide yo wife","commenter_a":"Michelle Grider","post_message":"Startling!"},{"comment_id":"1681074165464529","commenter_b":"All the deplorables need to donate a brick for the wall with their name on it for the illegals to see who wants them gone....","commenter_a":"NO REFUGEES AND SEND THE ONES THAT ARE HERE BACK!!!!!","post_message":"Donald Trump LIVE! WATCH NOW     Best Conservative NEWS-----> Freedom Daily LIKE OUR PAGE!  Donald J. Trump Donald Trump For President #maga"},{"comment_id":"1147055582023224","commenter_b":"She is a thief put her in jail","commenter_a":"She is obviously enjoying her new found freedom . Notice there is no hajji .","post_message":"Muslim Welfare Queen Loses Benefits After Cops See THIS On Her Facebook Page..WOW!  Do you agree that Muslims come to America just to soak up free money?"},{"comment_id":"10155783604970293","commenter_b":"If she was defending herself I hope she walks. Woman beaters should all end up like him.","commenter_a":"Likely another abused women who will be in prison for defending herself. I'm so tired of this happening!","post_message":"A Huntsville woman is being charged with manslaughter after her boyfriend died from his stab wounds."}]
