[{"comment_id":"945163755529692","commenter_b":"The teacher needs the bag a brown bad cause she butt. Ugly","commenter_a":"What the hell","post_message":"An after-school elementary teacher is accused of putting a plastic grocery bag over a child’s head until he could no longer breathe: @webpagelink"},{"comment_id":"10153594366538352","commenter_b":"Kiss my black ass old lady!","commenter_a":"Wait let me get this straight well never mind because I know if he was black it would've been reported when he took a crayon from school because that's how deep they dig! #BlackManCantFartWithoutBeingCalledAnAnimal","post_message":"Biker killed in Waco shoot-out was a law-abiding decorated Vietnam veteran with Purple Heart, records reveal – despite police claims that all 9 dead were criminals"},{"comment_id":"10153267588169497","commenter_b":"'@username's a big ole pussy","commenter_a":"Deserter.","post_message":"In Focus:   The Onion breaks down what you need to know about the former POW"},{"comment_id":"10153947614518855","commenter_b":"They have tiny dicks lol","commenter_a":"'@username @username she was a grindho","post_message":"Surprised?"},{"comment_id":"10153987081447894","commenter_b":"D muthafucka!!! Learn to speak English!! Well Muthafuck you!!!!","commenter_a":"My condolences to his family and friends 🙏🏽😔","post_message":"Actor Bill Nunn, Best Known as Radio Raheem in ‘Do the Right Thing,’ Dead at 62 [Photos]"},{"comment_id":"10153881194507464","commenter_b":"My FB wall today is swamped with nothing short of filthy dirt on Cruz, thanks to a handful of Trump supporters. Just how ugly will this get?","commenter_a":"absolutely right, @username is the only consistant conservative in this race. CRUZ missile to the White House 2016!","post_message":"Rush Limbaugh: 'If conservatism is the dominating factor in how you vote, there is no other choice for you in this campaign than Ted Cruz... this is the closest in our lifetimes we have ever been to Ronald Reagan.'"},{"comment_id":"10152872139971130","commenter_b":"Says the bitch who makes more than most men... Lmao","commenter_a":"Says the woman who makes a million dollars a movie for acting while the teacher at her kids school makes 50k or less a year! #equalpay","post_message":"PREACH, Patricia Arquette!"}]
