[{"comment_id":"10153607443456130","commenter_b":"She is a fucking war criminal.Are you guys fucking high?","commenter_a":"I hope when this all over H.A. Goodman writes Hillary Clinton a thank you letter, because writing about how bad he thinks she is regardless of the facts is basically his entire career.","post_message":"\"The only leading candidate in 2016 (Ted Cruz, like Trump and Clinton has a negative favorability rating) with positive favorability numbers is Bernie Sanders. Think about that for a moment.\""},{"comment_id":"1278850128860187","commenter_b":"No way in hell will I change my faith or anything else for this evil bitch!!","commenter_a":"Wear red at the polls. Let's show the Clinton machine how we can show our support another way that can't be rigged. Polling lines full of Trump supporters should skew the view of the biased media. We are the media. We are the people. For the people by the people we will make this country great again. Go Trump!!","post_message":"This literally just happened, folks!"},{"comment_id":"1241124305907597","commenter_b":"Mexicans R not the enemies! The Enemies come with visas on Air planes! They are already here! Keep bringing refugees! From overseas!!","commenter_a":"Trump will secure our borders!","post_message":"The New York Police Department said it dispatched its \"critical response group\" which is equipped with high-powered weapons, and other security to crowded areas of the city."},{"comment_id":"1180802641955155","commenter_b":"Don't let this wicked woman get away !!!!!!","commenter_a":"BETTER LATE THAN NEVER!!!!!!","post_message":"GET HER!"},{"comment_id":"10154984225302300","commenter_b":"Dee you are what's wrong with white people...","commenter_a":"Those darn white people attacking blacks.. oh wait.. this was black on black crime. Guess there won't be any riots over it.","post_message":"UPDATED: Eight people now confirmed shot Monday afternoon during a Martin Luther King Jr. celebration at a Northwest Miami-Dade Park, according to police."},{"comment_id":"1062283227145482","commenter_b":"Glad you decided to be a Republican, Eric! Your bigoted remarks belong with them.","commenter_a":"Chan Zilla, even white people are getting sick of white people's bullshit...","post_message":"The significance of the march on the Confederate museum should not be lost. The Confederacy in and of itself was built on racial terrorism."},{"comment_id":"800436556756837","commenter_b":"And for what he's done to military, vets... Americans! Bringing illegals and terrorists into our country to kill us!!!!","commenter_a":"Yes! Obama should be put in prison for intentionally violating the law and for threatening others, who do enforce the law, with being punished for that enforcement.","post_message":"This Federal Judge Just Took Down Obama For Betraying America. We need more people in this country who will stand up against him. Do you support this judge?"}]
