[{"comment_id":"10154146066447623","commenter_b":"@username Im against this executive order because it wasnt thought out very well at all and is just a blanket order to block everyone that is a citizen of certain countries from getting into America, even if theyve been here for years and just happen to be out of the US at the time. Im all for protection, but Trump's actions are based on nothing but his ignorance and fear. That is no way to live and that is no way to run a country.","commenter_a":"If DHS doesn't support this, isn't that a sign that maybe it's not the right thing to be doing? I'm pretty sure they're not a liberal organization, so this isn't a partisan issue. If you're scared of terrorists, I get that. But wouldn't it be better to open your mind a little and try to understand why so many people are against this?","post_message":"The Department of Homeland Security said Saturday it has suspended all actions to implement President Donald Trump’s immigration order."},{"comment_id":"10152747594996051","commenter_b":"@username smart lady","commenter_a":"All this complaining about someone suggesting that one be responsible when getting our tax money. This is crap something needs to be done but then again the bleeding heart unimformed idiots will start crying. Look around and show me the starving people just look at the size u don't get that size while starving.","post_message":"People getting food stamps in this state need to get ready for some big changes."},{"comment_id":"10152956831331130","commenter_b":"Wow... talk about a student taking the teachers to school.","commenter_a":"Her parents really wrote a good speech.","post_message":"Somebody give this little girl a medal!"},{"comment_id":"1084778228228546","commenter_b":"they go around and touch people like mother theresa What is your POLICY?!","commenter_a":"The only barriers I have is the hidden files on JFK. Please be more of a transparent President and release all of the hidden files regarding my (past life) assassination. Thank You, very much.","post_message":"\"We can open the door to every person in this country again.\" —President Bill Clinton"},{"comment_id":"1007831625924362","commenter_b":"Aka: a bitch wasn't a slut cause she refused to go along ( re: politically, sexually, maternally, etcetera.)","commenter_a":"Never, even when I thought it of myself. Maybe since I'm \"of a different generation \" I'm prouder of some other word","post_message":"You keep using this word. I do not think it means what you think it means. - Alisha Huber"},{"comment_id":"944224732371213","commenter_b":"Yeah, she didn't want to have sex with an Orange baboon.","commenter_a":"I guess Trump would know a lot about attitude. He has a very bad attitude and has the emotional age of three!","post_message":"\"She gained a massive amount of weight, and it was a real problem. We had a real problem. Not only that, her attitude,\" Trump said Tuesday morning."},{"comment_id":"1851225291776966","commenter_b":"well said ,","commenter_a":"Trump's Victory, in another term (American people's Victory) has proven that the good citizens of the USA are great at determining their future, and changing the game and the whole regime for a better living and even world because America has a big influence on the whole world. Despite the massive media war that had been trying and pushing hard to find a way to put Mr. Trump aside or down to fail him by any dirty politics, means and ways... BUT they couldn't do you know why? Because he is capable and honest and most of all I believe that the church of humble believers everywhere have had an input in this victory asking the Good Father for this amazing nation to shine His face upon America again as He did in the past...!","post_message":"Former President George W. Bush had this message for President-elect Donald J. Trump."}]
