[{"comment_id":"10153230993584342","commenter_b":"No. Lol. I would have done that too.","commenter_a":"The restaurant manager obviously handled the situation poorly. She waited too long to intervene and then did it in anger. That is unprofessional. BUT.... The parent who allows their child to disturb all the people around them trying to enjoy a meal is inconsiderate and selfish! The excuse that the child is waiting too long for food is poor at best. You as a parent and should come prepared to entertain your child... That includes providing them snacks and toys. The parents should have removed that child from the table within 5 minutes of the unresolved tantrum. Yes... I am a parent and never allowed that to happen. Remember that you are not the only person in that establishment spending hard earned money to enjoy a simple meal!","post_message":"DINER OWNER YELLS AT CRYING CHILD: \"I turned around, slammed both hands on the counter and then pointed at the child and said, 'This has got to stop!'\" said Darla Neugebauer, after she says a toddler cried for more than 40 minutes. The child's mother is furious. Did the diner owner go too far?"},{"comment_id":"10154315230081051","commenter_b":"Kelly knows the enemy is coming from the south and must be stopped . Declare war and deport all foreigners !!!","commenter_a":"Military to the front again Obama to da back of the","post_message":"Trump's Homeland Security pick is dead serious about stopping the flow of illegal immigration into America. Does that sound good to you?"},{"comment_id":"1694209280599095","commenter_b":"Illegal aliens have to register for the draft as do green card holders and U.S. citizens or immigrants who are born male and have changed their gender to female! You want to see a run for the border, get a good skirmish started in NK and use a military draft to man it, you'll see the mad rush to leave the U.S. by freebie wanters.","commenter_a":"And \" The last person that wants to play the nuclear card...is me. But you can never take cards off the table \" - Donald Trump -","post_message":"\"America's commitments to defending our allies remain iron clad.\""},{"comment_id":"10154326754201636","commenter_b":"Well I don't think she has that strength","commenter_a":"Can she slap Nigel Farage and Boris Johnson, and get away with it?","post_message":"The incredible powers you didn't know the Queen wields"},{"comment_id":"10153440458394087","commenter_b":"God please give us her in the White House so we can see her on TV everyday!!","commenter_a":"just a dumb shit for hanging with trump","post_message":"“Do I agree with him all the time? No,\" Melania Trump says of her husband Donald J. Trump. \"I think it is good for a healthy relationship. I am not a ‘yes’ person. No matter who you are married to, you still need to lead your life.”"},{"comment_id":"10152885159374342","commenter_b":"That witch would be 6 ft under! !!","commenter_a":"@username lol","post_message":"A 30-year-old woman faces criminal charges after a video surfaced that appears to show her storming onto a school bus and slapping a 5-year-old she believed was bullying her child.  FULL VIDEO/STORY --> @webpagelink"},{"comment_id":"924923120897717","commenter_b":"That is what the Supreme Court is for! To keep the Executive branch from VIOLATING THE HOLY MONKEY SNOT out of the Constitution. This administration is shameless and arrogant to the EXTREME!","commenter_a":"Yes","post_message":"A Federal Court upheld a block on Obama's executive amnesty. Do you support their ruling? -- COMMENT with YES or NO"}]
