[{"comment_id":"10153163966344255","commenter_b":"Where my confusion comes in is most people don't trust the government with their money but they will trust it with their children's lives....","commenter_a":"See fellow liberals? This is the fanatic pro-vaxxers showing their true face. Fascist totalitarianism. Hitler and Mengele would be proud of the folks signing this petition. These are not liberals. These are corporate thugs in disguise using liberal forums like @username to try to convince us that the pro-vax position is the smart, scientific , modern one and that vax-skeptics are a bunch of right wing anti-science fundamentalist boneheads. Its simply not the case. The real smart folk can see right thru this Big Lie that all vaccines are perfectly safe. They clearly are not. And most of us do not want to ban vaccines as they would have you believe. We just want safer vaccines, common sense, and for folks to see both sides of the scientific debate. And yes, vax fanatics, there IS a scientific debate.","post_message":"Public health must trump parental choice. Tell your governor to introduce legislation to ban all belief-based vaccination exemptions."},{"comment_id":"1871694196449652","commenter_b":"Bahaha Anna O'Toole","commenter_a":"Kaylee Parsons-Cordrey Jessica Shoffner k I don't really give a fuck about either of them but ajdvabsjz skz yes","post_message":"The most bromantic sign of the day."},{"comment_id":"737091973148047","commenter_b":"Imigrants that come here with four wives and ten kids need to be kicked off welfare they cost tax payers a 100.000 dollars a year per family","commenter_a":"Cut her off.","post_message":"Debbie Merton lives off of government tax money. But it’s what she’s doing NOW that will make you want to punch a wall. Should this woman be cut off from the government?"},{"comment_id":"10154069182538128","commenter_b":"You're disgusting!","commenter_a":"Disgusting crap Chris Rock!!","post_message":"Chris Rock didn’t waste any time diving into the controversy over the lack of diversity at this year’s Academy Awards."},{"comment_id":"10155335860455968","commenter_b":"So true!","commenter_a":"Yeah if someone could add a \"satire\" tag, that would be helpful, too. It is getting pretty hard to tell the difference between crazy real news and satire these days.","post_message":"About time."},{"comment_id":"649171271940118","commenter_b":"So how many times would we pay for the same illegals to be deported again and again and again","commenter_a":"Yes deport all the illegals that are in Our Country, if they can't come in our Country legally then they don't belong here, the illegals are nothing but a drain on our economy, with welfare, food stamps, medical housing and transportation which Obummer is giving them all, and Bankrupting our Country, all at the tax payers expense. I feel that they should have been deported long ago and not allowed to come back into the US since they came in illegally in the first place and those that have done this they should never also be allowed to try for Citizenship to The United States...","post_message":"Donald Trump just showed everyone how much illegals really cost. Enough is enough. Send them all back! Do you agree all illegals should be deported?"},{"comment_id":"1238359136216847","commenter_b":"Ah shut up!!!","commenter_a":"Ding- Dong.","post_message":"Come again??"}]
