[{"comment_id":"10155057562030725","commenter_b":"\"Bu-but! If we ban guns evildoers would be unable to buy them!! Rig-Right?\"","commenter_a":"you are so right MR, TRUMP ,","post_message":"If the people so violently shot down in Paris had guns, at least they would have had a fighting chance."},{"comment_id":"10153646192799342","commenter_b":"I hope they have to serve every minute if those 60 years! What trash!","commenter_a":"So sad......","post_message":"The details of this case are just awful."},{"comment_id":"536487383205696","commenter_b":"Here's some facts for you Gerry - I NEVER want to be someone's \"arm candy\", I will NEVER marry for money and I don't have relationships with people because of the way they look. I do agree with you when you say we are our worst enemies, but that doesn't give you the right to generalise all women. Unless you're happy to be lumped with the guys that are shallow and only date women with big breasts","commenter_a":"Who the hell cares if she is pregnant? unfortunately women are their own worst enemies, happy to be arm candy of some of the most groteste males alive,providing they are millionaires, fact!","post_message":"Jennifer Anniston has said we’ll be the first to know if she's pregnant. Writing for The Huffington Post, the actor blasted the “sport-like scrutiny” she lives under, saying it’s indicative of society’s warped view of women which sets a dangerous example for girls."},{"comment_id":"10153221007429575","commenter_b":"Lmao. Guess who isn't surprised. I just wish I was there. There'd be holes in some stupid flat brim hats.","commenter_a":"Where's Jackson? Where's Sharpton? Where's Eric Holder? Where's the NAACP? Where's the constant 24/7 national news coverage? Oh wait, the attackers were black and the victims were white? Well in that case, move along, no big deal, nothing to see here.","post_message":"\"Their children and grandchildren were running around while we were fighting and they don’t know what’s going on and there’s blood everywhere.\" A party at an Ohio Chuck E. Cheese's got out of control after the store manager told guests the photo booth wasn't working."},{"comment_id":"10154996363431337","commenter_b":"We have a incest pedohpile leading USA. The ignorants have come out from their caves.","commenter_a":"At least he'll bring back jobs!- every ignorant trump supporter.","post_message":"Donald J. Trump really shouldn't be tweeting about nuclear weapons..."},{"comment_id":"1240054509382884","commenter_b":"my state of AZ just paid a 3 million dollar fine to a private prison because it did not keep it filled to 97%.....they lock up undocumented immigrants for 6 months on the taxpayer dime before deporting them.","commenter_a":"When taxpayer money is given to private corporations to house prisoners we end up with the highest prison population in the world. That is not a coincidence at all. We taxpayers, the People, are paying for the subjugation and torment of a large portion of our population. Mostly a minority inmate population, I might add. It's just wrong no matter how you look at it.","post_message":"The U.S. has more people in jail than any other country on earth. To my mind, it makes a lot more sense to invest in jobs and education than in jails and incarceration. Our job: end the war on drugs, end private prisons and pass real criminal justice reform."},{"comment_id":"10153402450349456","commenter_b":"And he's out on bond in Montgomery and Elmore counties? What a joke","commenter_a":"Thug life is no good.","post_message":"One official said this is the worst case of home repair fraud he's ever seen. The suspect is also facing a murder charge in Elmore County."}]
