[{"comment_id":"10154082437051051","commenter_b":"As usual she is lying.","commenter_a":"Wrongagain.","post_message":"Hillary Clinton says there's no question Obama will go down in history as a successful president. Is she right?"},{"comment_id":"416896861831941","commenter_b":"I do not think Hillary will win (fairly anyway).","commenter_a":"The even bigger issue is that 46% of people still think he's a good president.","post_message":"I am ONE of them...do you?"},{"comment_id":"10153061426624411","commenter_b":"In prison in U.S. A child killer is gang raped and beat to death they hate child killers !","commenter_a":"Well it sparred prisoners a job of having to kill her. Deserves to die child killer!","post_message":""},{"comment_id":"930066893697318","commenter_b":"Screw Jeb Bush, just because he married a foreigner doesn't make it right for our borders to be infiltrated by illegals looking to live off of our hard earned dollars that we worked for all our lives. Vote for Donald Trump for President and he will end this and make our country strong and proud again.","commenter_a":"He needs to get in bed with the Democrats!! He's not a Republican","post_message":"\"Trump is wrong on this.”"},{"comment_id":"10153030361596636","commenter_b":"y'all feminists need some patriarchy","commenter_a":"Well when it comes to equality between the sexes I can easily say that Sweden is equally retarded and out of touch as Saudi Arabia in regards to the rights of women in society. This whole feminism movement has gone totally out of control here in Sweden and become something like the Catholic church.","post_message":"Maybe it's time we did the same?"},{"comment_id":"387361158112432","commenter_b":"the WHAT?","commenter_a":"A lot better then the B.N.R. CRAP","post_message":"What did the Christian left do to draw the ire of Fox News?"},{"comment_id":"1665137810414324","commenter_b":"Beyonce is a racist and a cop hater.","commenter_a":"God Bless You.","post_message":"Whoa, this outspoken Obama critic didn't hold back at all when discussing Beyonce's Super Bowl halftime performance... and he pointed out EXACTLY what made it so hypocritical.  If you thought Beyonce's halftime performance was unacceptable, spread this video far and wide,,,"}]
