[{"comment_id":"1035142053187556","commenter_b":"Either sit quietly or shoot em. Dont bitch until they get pissed to","commenter_a":"I know the cops were doing wrong but for fuck sake shut your damn mouths and calm down and shit wouldn't escalate","post_message":"WTF! Just because they \"smelled marijuana\"??? Full story here: @webpagelink"},{"comment_id":"10155376064740389","commenter_b":"She's needs to be prosecuted for breaking the law!","commenter_a":"OF COURSE..... She is a huge narcissist, just like Obama. I am thoroughly disgusted!!!","post_message":"The White House tried to push past the Hillary Clinton email controversy on Wednesday, with Press Secretary Josh Earnest telling reporters he's \"not particularly interested in\" discussing the issue.   Question of the Day: Do you believe the former secretary of state's explanation for using one email account for work and personal use?"},{"comment_id":"536114256579154","commenter_b":"the only thing she needs to do is run straight out of this country.....begone.","commenter_a":"I thought Its name was Michael","post_message":"Michelle Obama could be running for president.  This is a joke. She needs to keep her mouth shut.  Do you agree Michelle Obama is a joke?"},{"comment_id":"10154500289369091","commenter_b":"Build that wall","commenter_a":"Trump is making up his own stories !! What would he like the ppl to do with the Syrians kill them ? They are human beings ! Smh.. All the other countries took them in ...Trump has No heart , Maybe we should put him in Syria and see how he likes it !","post_message":"Swedes have been ridiculing President Trump's remarks at his rally yesterday that suggested a major incident had happened in the Scandinavian country."},{"comment_id":"10155094195189766","commenter_b":"F Germany! Let the Jihadis have that country! They deserve what they get!","commenter_a":"How pathetic.","post_message":"Here's a German parade with a float of President Trump raping a national icon then getting his head cut off by the same. Thanks, guys.  Credit: Instagram/aladine_saidi via Storyful"},{"comment_id":"1237520902934076","commenter_b":"She's a criminal, with really bad hair.","commenter_a":"She did what she was hired to do.","post_message":"The American people deserve better. The DNC and Hillary Rotten Clinton rigged the system and completely ignored what the people wanted! They are so, SO corrupt!"},{"comment_id":"578168169046751","commenter_b":"We do still have freedom of religion but I think these women would be so much better off just being free of wearing a hijab. Their so oppressed by men. Dumb the religion and live your life without restraint","commenter_a":"Let's say wear whatever you want in public, but when you go into a store, gas station, etc., EVERYTHING comes off from the neck up. Sunglasses included. And how about we lower the surveillance cameras to head height so we can get a decent face picture instead of a grainy aerial shot. Why are we continually so bad at surveillance? Be whatever religion you want, but for everyone's public safety, we deserve to get a good look at you so we can quickly identify you later on. Nuf sed.","post_message":"Pretty soon it may be illegal to wear a hijab in public in Georgia. Do you think the ban would be a good thing?"}]
