[{"comment_id":"960199417353864","commenter_b":"You think allowing illegals to become citizens will not increase your \"real problems?\"","commenter_a":"What in the world are those loony Republicans thinking? Oh yeah, it's the \"me, me, me, f**k you!\" mentality that keeps them going. They ignore the real problems of gang wars, poverty, human strife, and persecution in the places where immigrants come from while at the same time, those idiot neocons perpetuate the \"War on Drugs\", \"War on Syria\". and all other unnecessary wars. Those people show no mercy on fellow human beings... Why is it that people remember to hate and separate while struggling to love and unite?","post_message":"Republicans are so eager to see brown-skinned children deported that they're willing to put the entire country at risk in hopes of making it happen."},{"comment_id":"1190272557692172","commenter_b":"I noticed, I don't believe I have ever before seen this. You can tell, they are sooo far distanced from our so called leader, lol. How is he allowed to carry on???","commenter_a":"In Obamas mind 9/11 didn't happen either. This man is a nut. Kick him out before he destroys this country. If you didn't know he was crazy before now, here's proof that he is. Pure old mean and crazy. America Please wake up. You can't be this brain dead.","post_message":"Somehow, Pentagon leaders don't seem too convinced..."},{"comment_id":"10153949050391037","commenter_b":"One word: uneducated","commenter_a":"Trump has had my vote from the start to finish ... Nothing anyone says can \" change \" my mind .... We need a business person in the seat to lead not be a tyrant.","post_message":"“During anxious times, it can be tempting to follow the siren call of the angriest voices. We must resist that temptation,\" Nikki Haley said."},{"comment_id":"929829353743480","commenter_b":"Gee, you'd think women would be smart enough to either (a) buy better shoes or (b) switch them out when they start to hurt. I guess not.","commenter_a":"I don't know why people wear them tbf,not if they're uncomfortable","post_message":"Time to switch to flats, ladies!"},{"comment_id":"546417122231127","commenter_b":"You're so racist it's sick. Tell that to the kids who can't go to school because they can build multimillion dollar stadiums or provide tourist attractions all while shutting down schools. You grew up a sheltered white girl. I already know.","commenter_a":"They lack the testicular fortitude to do this on a Saturday night around 2 Am in Miami 's Liberty City or Overtown or in front of Snoop Dog's house in LA. Instead they go on a Sunday afternoon, when this office is closed. I see nothing but loudmouth cowards with missing teeth and bad clothes.","post_message":"White Lives Matter group protests outside of the NAACP in Houston's third ward! #WSHH #NAACP #Houston #WhiteLivesMatter #BlackLivesMatter #AllLivesMatter"},{"comment_id":"1687768148176964","commenter_b":"Just love that woman","commenter_a":"Love it","post_message":"YES This is why we LOVE you, Reba McEntire!"},{"comment_id":"1013860195337176","commenter_b":"Vanessa: Do give Hillary's accomplishments that make you so proud. Are you proud of being lied to?","commenter_a":"The republicans are bunch of jokers ,am so proud to be a hillary supporter.","post_message":"If you're proud to be a Democrat after watching tonight's Republican debate, add your name here: hrc.io/1L9yvI6"}]
