[{"comment_id":"10152738606735950","commenter_b":"What an asshole!","commenter_a":"That makes me happy","post_message":"WATCH: First Lady Michelle Obama shows off her dance moves during the annual White House Easter egg roll @webpagelink"},{"comment_id":"730165010456352","commenter_b":"@username I love women who are well read xxx","commenter_a":"Is price to paid, for this people, crazy,terrorist! ! I don't blame cpd.just keep us safe!!","post_message":"One minute a Chicago Muslim woman was running to catch her train. The next, she was tackled by Chicago police, and it didn't end there. Itemad \"Angel\" ALmatar said she faced more humiliation at the hands of police before being arrested."},{"comment_id":"966636103398507","commenter_b":"Racism is alive and well and all the race baiters are enjoying tearing this country apart.","commenter_a":"This country is screwed up,this is what happens when people are as divided as modern day white people are. Who are the whites of these days owns slaves or would want to own anybody. The bible says u cannot enter into heaven if u don't forgive the ones who wronged u,yet some raise hell about a hundred years ago.what about the tribes in africa who captured weaker tribes and sold them to slave traders never her about that from the fame hunters.what about the poor whites who were treated the same and had to work all week for slab bacon,6 ears corn.","post_message":"RIDICULOUS: I can't figure this one out! Americans need to get their acts straight and realize who really protects them. LIKE our PAGE! www.facebook.com/Briankolfage"},{"comment_id":"1323967450977057","commenter_b":"Golden showers for a golden girl!!!! LOL!","commenter_a":"He's gonna cry.........all the way to the Whitehouse!!!! LOL!","post_message":"Trump has never looked so pathetic."},{"comment_id":"470896363098657","commenter_b":"That's called free speech in Obama America. Sad. I would love to see them meet their maker. Hell is going to be a busy place.","commenter_a":"They will do anything to RUB their ideas into our faces. If your part of this just keep it in your bedroom(house). Enough is enough.","post_message":"This is INSANE!"},{"comment_id":"10152604672427894","commenter_b":"I bet the beautiful lupita will be married before her silly ass will ever be...hell Walter didn't want her .","commenter_a":"Kenya need to stfu with her stupid ass","post_message":"Kenya Moore Shades Lupita Nyong'o Over Golden Globes Photo Snub: 'Girl Bye'"},{"comment_id":"10153743824977093","commenter_b":"Ain't no snake ever hurt no one. My niece Becky got bit by a dog","commenter_a":"Am glad y'all found this snake","post_message":"UPDATE: The missing king cobra has been found. That time your deadly pet snake escaped the house.. bit.ly/2bPTSGW"}]
