[{"comment_id":"923311821095206","commenter_b":"Mexicans never botherd me. Keep'em! Deport Trump!!-","commenter_a":"Not a good idea!!! Go Trump","post_message":"Excellent idea! Share if you support this.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1370743996276280","commenter_b":"She knows, because she spent a lot of money buying all those super delegates. Fact is neither will have enough pledged delegates to win outright, so bribed insiders will determine the outcome. That's really democratic isn't it. It really the Clintons and the DNC that are killing the party.","commenter_a":"Vote SANDERS","post_message":"Hillary Clinton said what everybody outside of Bernie Sanders and his supporters are thinking. The Democratic nomination process is in effect over, and there is no way that she won't be the nominee."},{"comment_id":"10158695661875206","commenter_b":"Check this out i mean Inc.org","commenter_a":"Humans have souls and can live etrnally and that is according to what is written in the holly scripture \"the bible.\" God forwarned us that earth will be burned during the secon d coming of jesus ... judgement day.. The bad ones will be burned and gids chosen people will be saved and have second life eternally","post_message":"If there really are multiple, interacting universes, then it would be possible for time travellers to visit Earth, and every imaginable scenario would be played out in a parallel universe at some point."},{"comment_id":"1170579889643596","commenter_b":"Haha I thought the same thing. She should cover up!!! Lol","commenter_a":"She shouldn't be breastfeeding in public.....she should cover up.......oh wait animals breastfeed their babies out in the open too and no one bats an eye. Sorry just had to","post_message":"Prague Zoo's 24-year-old gorilla, Shinda, gave birth unexpectedly to a baby girl. Zookeepers didn't know Shinda was pregnant; they thought she was just overweight. @webpagelink  Correction: Prague Zoo has not yet released the official name of the baby gorilla. Shinda, its mother, has been living at the zoo since 2001, not 2003."},{"comment_id":"10154320609521636","commenter_b":"SohailAnwer wow what an example.. pakistan ha?? Wow","commenter_a":"Islam gives rights to many and that can be seen if we open our eyes. In all Muslim countries that have stable governments, even minorities enjoy their rights. Look at Pakistan, its having a Santa Themed train that is traveling nationwide for Christmas. How many western governments give so much to their minorities?","post_message":"Fantastic"},{"comment_id":"1287965734605309","commenter_b":"Fuck Trump. There's my dignity. I'll grab him by the pussy.","commenter_a":"All of you need to remember that you are not in the fourth grade anymore, and that we can actually behave as adults. Cut out the filthy language and the belittling insults. If you have something to say, say it with a little dignity. Also, try to improve your spelling and grammar.","post_message":"Gullible fools...  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1807147956208492","commenter_b":"All of the above?","commenter_a":"@username. We should try this..","post_message":"Winter just got a lot more bearable."}]
