[{"comment_id":"10157152156085354","commenter_b":"BUILD THAT WALL!!!","commenter_a":"I hope he is the first to meet with them. He will only make the news one more time.","post_message":"WOW"},{"comment_id":"674830109374234","commenter_b":"This America and every body should be able to fly our flag and if any muslim feels threaned then they can just leave your country and go back to where they belong and stay there","commenter_a":"I say- 'TOUGH'","post_message":"You'll never believe why this man was forced to remove his flag.  This is absolutely wrong. If you're offended by the flag, LEAVE.  Can we get 20,000 'LIKES' in support of the American Flag?"},{"comment_id":"10153759061706051","commenter_b":"This is soo EVIL & SICK!!! Where were\\\\ R the kids parents??? Future Monsters in Society?","commenter_a":"poor little guy. he wanted to belong with the older ones. I hope the parents of this little guy sue the crap out of the murder's parents. The older kids had to be displaying signs of aggression.","post_message":"A 6-year-old boy was brutally tortured and killed by 5 other children. It gets worse."},{"comment_id":"1172654749497442","commenter_b":"I don't get the talk of someone 'forced' on us . She has millions more votes , sorry but except in the final Presidential election (ala 2000) the person with the most votes wins .","commenter_a":"Screw @username","post_message":"The numbers are revealing a slow but steady climb for Hillary Clinton"},{"comment_id":"10153115741995950","commenter_b":"That is BULLSHIT there terrorist right now in AZ 1out of 4 children are starving obama cant feed and house. Ours so what the hell he is gonna feed and house them. You hate the US you love terrorist get the hell out of here","commenter_a":"Good!","post_message":"NEW: The U.S. is preparing to accept at least 10,000 Syrian refugees in the next fiscal year, which begins in October."},{"comment_id":"10153084028785667","commenter_b":"Uhh bc illegals.. This makes it easy for anyone","commenter_a":"Why would people not use their drivers license? Using library cards and Costco cards? Packing your driver's license? Seriously? Stupidity at its finest. Some people should just stay home.","post_message":"A credit card, prescription, student ID or even a Costco card could be enough to convince the TSA you are who you say you are."},{"comment_id":"864444063671976","commenter_b":"Super gross. I can't stand that feeling how some women think it's sexy is beyond me.","commenter_a":"Gross","post_message":"Armpit Hair Is Trending, And It’s A Step Forward For Women Everywhere"}]
