[{"comment_id":"10154061329228352","commenter_b":"Fucking neither of them. Both pieces of dog shit.","commenter_a":"These two look alike younger you vs newer you ewwwww","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10156314605160354","commenter_b":"Dems care more about illegals than Americans! Vote all democrats out!","commenter_a":"Here is a list of the DEMS that blocked the vote for Kates Law and to stop Sanctuary Cities.Tweet or Facebook your Congressman or woman.","post_message":"'With a vote of 54-45, the measure failed to obtain the 60 votes necessary to end debate.'"},{"comment_id":"10152955099256336","commenter_b":"They sound like a bunch of babies saying the same thing over and over again. Do it don't just say words.that mean nothing. You are not scaring these animals do something.","commenter_a":"Lt. Col. Peters ,just another fool on FOX, Susan Rice.... heads the NSA.","post_message":"“Secure, expand, defend, leverage – her four points. Bill, that’s not a strategy, that’s a bumper sticker. The yogurt I had for breakfast had more intellectual structure.'   Lt. Col. Ralph Peters slammed National Security Advisor Susan Rice’s speech on the United States’ national security agenda."},{"comment_id":"10153541648111336","commenter_b":"Trump is in favor of obumercare or something like it.","commenter_a":"WE HAD AN ELECTION AND WERE PROMISED BY THOSE WHE ELECTED THAT THEY WOULD DEFUND AND REPEAL OBAMACARE they haven't done either or even tried looks like both sides are out to destroy us!!!!!TRUMP FOR PRESIDENT!!!!!!","post_message":"The first Obamacare-created insurer to go under could cost federal taxpayers up to $140 million, according to a new court filing."},{"comment_id":"1038011639567708","commenter_b":"Hell no, look at her go though Kalen would move","commenter_a":"Wtf imagine if this was kalen lol @username","post_message":"At 6 months and 27 days old, little girl breaks the record for the youngest person to ever water ski. @webpagelink"},{"comment_id":"10154580142688132","commenter_b":"Me too! Those hot mamas work for those bodies!!","commenter_a":"I personally loved it","post_message":"Fergie is making a statement!"},{"comment_id":"528408970683016","commenter_b":"ghetto skank bitch","commenter_a":"They have,gotten away with it for six years and will keep doing it tell they leave the white house","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"}]
