[{"comment_id":"1203394389723827","commenter_b":"We need to run over them with a truck. They will move.","commenter_a":"I don't think protestors should block any roads or destroy any property. Its says a peaceful assembly, not blocking roads, jumping and climbing on trucks and trashing others property or businesses. If they can't assembly peacefully then they need to be arrested.","post_message":""},{"comment_id":"648235325326484","commenter_b":"She has! Wake up!","commenter_a":"Killary should release her tax papers too! She is a liar and a murderer!","post_message":"Yesterday, Hillary Clinton blasted Donald J. Trump in a heated speech on the economy. So now, Trump is firing back... hard: @webpagelink"},{"comment_id":"10153941436496770","commenter_b":"Open your closed minds. Someday we will have a woman president but NOT THAT WOMAN!!!","commenter_a":"What s lie findlly give it up and give it a break. People make the most insane comments. Give the Rep. Some credit because we believe in ethics. You need to grow up and accept Trumps win . If you feel you need to live the country now then leave on the Miley train!","post_message":"And so begins the liberal blame game."},{"comment_id":"10155022062873984","commenter_b":"Support the Gaines-not the pastor!","commenter_a":"Yes I stand for u chip and joanne","post_message":"'Fixer Upper' stars Chip and Joanna Gaines are being targeted by the media for their church's support of traditional marriage. Liberals are trying to destroy the Gaines family, and now they need your support more than ever. Stand behind Chip and Joanna Gaines and fight the liberal media by signing this petition!"},{"comment_id":"10155157527128132","commenter_b":"Two scary women1","commenter_a":"That is one scary woman.","post_message":"Like always, Janice Dickinson is not holding back."},{"comment_id":"1901824630047376","commenter_b":"Meant to be","commenter_a":"Catherine her name... :)","post_message":"She’s a Republican college student and she’s proof that marching is about more than politics. #WomensMarch"},{"comment_id":"10153552801752464","commenter_b":"@username>>>>I like and agree with your post about \"freedom of press\", but I also agree with what Mark posted about \"mainstream media\". The truth is Soros owns most of the news media and everyone , including the media, is getting \"paid off these days. I am even starting to believe that our SCOTUS is getting paid for their votes from what I have been seeing lately. After saying all that, what you say is true that people can pick and choose; but we live in a day of uninterested, uninformed, misinformed people who only go with what they hear the most, whether it is factual or not. Do you ever watch \"Watters World\" on the Bill O'Reilly show, \"The Factor\". It is so discouraging to see people of voting age, especially college kids, who are so uninformed, just dumb about history and politics. Maybe you can find it on YouTube ...","commenter_a":"I'm for @username. Donald Trump has nothing on Cruz, but Cruz has on Trump. Cruz is an honest, God fearing man who has been standing up AGAINST Washington ( Washington Cartel is what Ted calls them) ever since he has been a senator. He has fought against democrats AND republicans FOR the choices of the American people. HE never cowered or gave in to Obama's wishes even though he has been falsely accused and criticized for being against Obama policies that Mitch McConnel and John Boehner gave into.","post_message":"An honor to join thousands of courageous conservatives in South Carolina yesterday who agree now is a time to lead and #DefundPlannedParenthood: @webpagelink"}]
