[{"comment_id":"10152704334291051","commenter_b":"Good! Take that piece of :poop: !","commenter_a":"GREAT JOB! (y) Hope the girlfriend is okay.","post_message":"A man walked in on his uncle trying to rape his girlfriend. This is what the uncle looked like after the nephew was done with him."},{"comment_id":"10153134555889753","commenter_b":"They should lock her down before she kills some one.","commenter_a":"Yes! This was a full on assault! When there is a minor present it is a felony. She should be tried to the fullest extent of the law!","post_message":"Do you think this teen should be tried as an adult?"},{"comment_id":"10153647598586077","commenter_b":"Put her back in prison!","commenter_a":"Welcome home Mom!","post_message":"Demaryius Thomas' mom, Katina Smith, will be wearing this custom made jersey today. (photo courtesy Michelle Martinez)"},{"comment_id":"10152948972001051","commenter_b":"You wouldn't see tomorrow if you shot my dog you pussy. I'll put a new asshole in your forehead","commenter_a":"NO DOG should be loose in public, PERIOD. Your loose dog will be neutralized if it approaches me. NO APOLOGY.","post_message":"Some people say the officer handled this situation correctly. Others say it was an overreaction. Decide for yourselves who is right."},{"comment_id":"10153722562581800","commenter_b":"Gosh, I hope you are not able to reproduce. Idiot!!!","commenter_a":"I think no one bars militant Christians from the country, or seeks to deport them, just because Christians are responsible for most acts of violence and terror in this nation.","post_message":"Mike Huckabee went on an alliteration spree on cable news recently, saying the following about the response to the Paris attacks: \"[Democrats are] more interested in protecting the image of Islam than they are in protecting Americans...If these were Militant Methodists, Extreme Episcopalians, Bad Boy Baptists, do you think we would be afraid to say that?\" \"No we would not be afraid to say that. Because Bad Boy Baptists is an awful name for a terrorist group, but a GREAT name for your Christian Soul Rock, one man, bass-only album.\" - Trevor Noah ►Watch now: @webpagelink"},{"comment_id":"891775107623863","commenter_b":"Michelle isn't a woman for women. Let someone rape one of her babies and watch out!! And of course Bill Clinton may try! I've worked with sex offender's like Bill all my life and they DONT change. They like white, black, Asian, and ALL the girlees. Even baby girls. Bill is a threat to our children. Hillary doesn't stand for the security of our babies... she hands them over to Bill to be F...!!","commenter_a":"two faced .... you heard what what she said when Obama ran for office","post_message":"Michelle Obama did not get emotional for Juanita Broaddrick. Michelle Obama did not get emotional for Kathleen Willey. Michelle Obama did not get emotional for Paula Jones. Michelle Obama did not get emotional for Connie Hamzy. Michelle Obama did not get emotional for Eileen Wellstone. Michelle Obama did not get emotional for Sandra Allen James. Michelle Obama did not get emotional for Christy Zercher. When will Michelle Obama get emotional about all of Clinton's alleged sexual assault and rape victims?"},{"comment_id":"10154262416956037","commenter_b":"Remember if you need some hot sauce Hilbilary carries it in her purse!","commenter_a":"Why? So this is the type of journalism Yahoo gives us after laying off 25% of their staff?","post_message":"Yahoo News reporter Hunter Walker is heading to the Trump Tower Grill for a Facebook live stream to get reaction to Donald J. Trump's Cinco de Mayo fiesta. Tune in soon ..."}]
