[{"comment_id":"1220005224782920","commenter_b":"She was a fucking stripper! Yeah, real class!!!","commenter_a":"Yes, what a wonderful change. And so does Mellania - what a classy First Lady we have!","post_message":"ClashDaily.com"},{"comment_id":"10153393648949228","commenter_b":"Actually, it's not normal for any woman to expose herself in public... feeding or not. It's quite self-centered.","commenter_a":"We all have to have something to complain about. It's like the news gives us one good story and the rest has to be bad. Give it a rest people. It's a normal mother instinct. LEAVE IT ALONE","post_message":"\"The mall told me it's perfectly fine, perfectly legal to breast-feed."},{"comment_id":"10154137219211323","commenter_b":"Except I don't know any bores.","commenter_a":"How the shallow half lives. My parties are made up of kinder people and we include bores, shy people and those who feel rubbish but know they will be treated with kindness and respect.","post_message":"“They don’t know they’re bores, so they’re happy.\""},{"comment_id":"488461684677745","commenter_b":"There idiots ,this woman can handle a weapon and herself ,and shes beautiful to boot","commenter_a":"beside ,in front,behind shes good from any view, wish she was President ,one smart lady !","post_message":"Controversy erupts after this video of Palin surfaces. Sarah is in trouble. She needs our help. Do you stand behind Sarah Palin?"},{"comment_id":"703232799867298","commenter_b":"Yes! Wipe them off of the Earth!","commenter_a":"Unfortunately this is what needs to be done to get this sickness out as best we can","post_message":"Several ISIS leaders have just been taken out. Good riddance. Should we send our air force back to Syria to end ISIS for good?"},{"comment_id":"950475968345485","commenter_b":"she is fuking fat end off...","commenter_a":"I'm sorry, but fat people are NOT hot, sexy, or beautiful. Just ask a obese persons heart how healthy it is.","post_message":"'I want to challenge society's perception of beauty' - Tess Holliday"},{"comment_id":"10153828343101051","commenter_b":"You are a brave girl I'm happy you kids are out off that hell hole","commenter_a":"This so sick and so sad! I pray for these children are in a good foster home. The mother and the boyfriend and the other person go to jail for life. This child was very brave to email the teacher. Didn't anyone at school see that something was wrong with these kids? The boyfriend should be castrated! How can this happen in America?","post_message":"This teacher was reading her e-mails when she noticed a message from one of her students. Because of how young the kids in her class are, they rarely sent her e-mails. She realized almost immediately that something was wrong."}]
