[{"comment_id":"1273048739421267","commenter_b":"I don't believe very many Republicans are \"in to\" the arts except at fundraisers. lol","commenter_a":"They are Trumps uneducated.Gotta love STUPID!","post_message":""},{"comment_id":"10154161281331636","commenter_b":"But if you are in line at the time of closing they have to stay open to allow you to vote. This orange plague on our Country needs to GO!","commenter_a":"Seriously he doesn't like democracy you elect him you'll have a dictator who you will have to overthrow","post_message":"BREAKING"},{"comment_id":"10157322113810354","commenter_b":"She is the spitting image of miss piggy. Shut up bitch","commenter_a":"@username keep this irrelevant fat slam pig off my feed, k?","post_message":"Amy Schumer: you know what Americans are \"sickened\" by? We dumb, poor, working class folk are \"sickened\" by rich, elitist, Leftist \"celebrities\" who can afford to live in million dollar homes with high-end security and bodyguards lecturing us for protecting our families and children. Sorry, Amy Schumer, that we can't afford to live in a gated mansion with state of the art alarm systems. But your pal Obama destroyed the American economy. So spare us the lectures!"},{"comment_id":"10154031009040329","commenter_b":"I'm crying about all of this all over again!!!!!!!!!!","commenter_a":"Riley","post_message":"People keep telling you “it’s only a show,” but then why does your heart hurt so much?"},{"comment_id":"10153222909878132","commenter_b":"Why do women ALWAYS havevto comment on other women's hair..ugh","commenter_a":"sienna looks better as a brunette.","post_message":"\"She just understood. We just connected. It's been a tremendous blessing.\""},{"comment_id":"10153577547513352","commenter_b":"Amber shut your ass up looking like momma June. Fat ass","commenter_a":"This sight sucks","post_message":"In sickness and in health: Soldier marries fiancée despite brain injury that left her unable to recognise him just days before their wedding… and then spent five years teaching her to walk, eat and speak again"},{"comment_id":"1043787832310738","commenter_b":"So she cooks for him he does not eat rigjt away he showers then she but instead of making a plate of cooked food he decides to cook something different and its her fault.no he just know he can take advantage.nothibg wrong fixing a plate but he was petty.its childish","commenter_a":"This lady has time to waste, why is she asking the internet for advice when she could simply have a conversation with her man about this habit or preference. if she has an issue with making him a plate, then she should make it known..........geesh, communicate with the man instead asking us for our opinions since we do not know the whole story.","post_message":"Are his legs broken?! Anywho, what should this woman do?"}]
