[{"comment_id":"1299985666689108","commenter_b":"typical woman sexism","commenter_a":"Almost every man I know that gets the flu is a big baby about it and stays home to be pampered and relax, while women who get sick continue with their daily routine of kids and work and household duties, so, ppft. Women still get it worse!","post_message":"Turns out, cold ad flu viruses might actually be worse for men after all."},{"comment_id":"899262110108885","commenter_b":"So Damian... You too... Just bAck up bitch .... READ THE 4TH AMENDMENT !!!!","commenter_a":"I saw this video when it first came out. During the struggle the kid mounts the cop and beats his face in.. Consistently , cop struggled and shot him. Tall goofy for this one. Watch the full vid , kid is a douche asking for trouble","post_message":"\"I don't have a weapon..\" -- Some of Deven's last words. He was shot 7 times by a cop. Get RISE OF THE WARRIOR COP for free: @webpagelink WARNING: This video contains graphic content. The full story has finally been exposed, thanks to Matthew Cooke."},{"comment_id":"10153153444601051","commenter_b":"Go ahead baby girl google dat, ill wait.... Lol","commenter_a":"This Latina is a trump supporter.","post_message":"We went to the Donald Trump protest this week to speak to his supporters and critics. Here's what they had to say. Do you agree or disagree with Trump when it comes to immigration?"},{"comment_id":"10154212889868822","commenter_b":"2 fecking idiots!!! That is all I have to say!","commenter_a":"Just look how dangerous Pittsburgh has become in itself!! There are murders every single day and crime is most def on the rise!! Jobs are scarce unless you want to work part time in fast food or at a gas station","post_message":"Boston Mayor Marty Walsh joined Pittsburgh Mayor Bill Peduto for breakfast before hitting the campaign trail to drum up support for Hillary Clinton ."},{"comment_id":"10155549933771729","commenter_b":"They are terrorists. Maybe, its time to form our militias and eliminate these crazy evil nuts.","commenter_a":"Yes indeed. Love it!","post_message":"Oh, so sorry..."},{"comment_id":"1796145143964177","commenter_b":"If this one was another girl we would probably try one more time and call it quits bc three is the most I could possibly handle EVER. I'm still iffy on having a third bc I can't possibly handle another Jacey lmao she crazy","commenter_a":"@username at least we got lucky","post_message":"A Brazilian couple has 13 sons and won't stop having kids until they have a girl."},{"comment_id":"860171507364731","commenter_b":"Wow... really? So sad.. moms please be very careful who u leave ur kids with..","commenter_a":"she looks like she is a... \"few bricks short of a load\"","post_message":"This 18-year-old girl is accused of leaving her little sister in a hot car while her and her friend went shopping for swimsuits. Investigators say the 2-year-old's temperature was already at 100 degrees when she was rescued:"}]
