[{"comment_id":"499431526914094","commenter_b":"Leave our flag alone!","commenter_a":"I think the old saying is true. If It ain't broke, don't fix it!","post_message":"The American flag might be redesigned, see here. No one should touch the flag. It is the symbol of the greatest country on earth. Do you agree no one has the right to change the American Flag?"},{"comment_id":"1015138285280684","commenter_b":"To the bone","commenter_a":"They cut his head","post_message":"Ron Mott said the four Chicago teens who kidnapped and tortured a mentally challenged young man weren't \"trying\" to be criminals."},{"comment_id":"10154770911376323","commenter_b":"\"according to the people involved\"...yeah ok.... i prefer data that is unbiased. as for now, unbiased data overwhelmingly shows brexit a reality.","commenter_a":"\"We want our own parliamentary sovereignty back!!\" Parliaments exercise sovereignty \"Rarw!! Rabble rabble rabble!\"","post_message":"A series of informal but concerted efforts by pro-remain politicians to reshape or even derail the Brexit process is under way and gaining momentum, according to people involved."},{"comment_id":"10154948296594203","commenter_b":"all the illegals voted too..","commenter_a":"Hillary has 2,017,563 extra votes then Trump. The difference of extra Two Million+ vote which can give a decisive victory to a candidate \"anywhere else in the world\" has ZERO value in America?","post_message":"BREAKING."},{"comment_id":"1184765668249575","commenter_b":"Bye bitch","commenter_a":"Please stop giving her attention","post_message":"Poor Sarah, she has a boo-boo and it's all Hillary's fault."},{"comment_id":"10158446067150354","commenter_b":"You little queer. I think my grandkids could fuck you up, fag!","commenter_a":"You won't stand a chance asshole come on bring it I'll save a hospital Bed it's waiting on you fucking RACIST RAT","post_message":"The shutdown of MILO event at UC Davis may be a preview of what to expect at next week inauguration of Donald Trump. Just who are these hooligans? Lee Stranahan investigates..."},{"comment_id":"10153054078171336","commenter_b":"hey @username you guys have been saying that for 6 years. Settle down haters! And you sound like an idiot.","commenter_a":"Dig deeper because this is not enough to derail her run. She kept the records!","post_message":"“Can we trust Hillary Clinton to produce all of her email when we couldn’t trust her to obey the law that she had to use a State Department email?” – Senator Rand Paul asked on tonight's The Kelly File. @webpagelink"}]
