[{"comment_id":"1053026444717108","commenter_b":"Good. She is druggy scum! She deserves to never ever see him again!!","commenter_a":"Mother, child bond, find away to keep them together","post_message":"PLEASE SHARE: Puyallup police are asking the public to be on the lookout for endangered 5-day-old Jeshua Taylor and his mother (pictured) Myra Maria Aguilar. Police said Myra appears to have fled with Jeshua in an attempt to keep the child from state custody. >> @webpagelink"},{"comment_id":"10153695152617507","commenter_b":"No difference, Bullshit, it is the same as endorsing him, even worse, it is a cowardly way of endorsement.","commenter_a":"He didn't endorse Trump, he just doesn't care if they play his music, big difference","post_message":"Wait. What?"},{"comment_id":"10156940473490354","commenter_b":"She was having plastic surgery!","commenter_a":"Where were you Maria, when Obama was proposing this last year. That's when you should have objected! It's too late now!","post_message":"BLISTERING..."},{"comment_id":"934295046610968","commenter_b":"Run Sarah RUN!! President Palin has a certain 'RING' to it !!!","commenter_a":"SHE IS OK WITH TORTURE. REMEMBER?","post_message":"When Sarah Palin posted a picture on Facebook bragging about how her son used their family dog as a 'stepping stone,' she proved once again that animal abuse doesn't bother her at all, and animal rights groups are now slamming her for it."},{"comment_id":"1072525059447912","commenter_b":"Well actually Tara bring em all to your house ok AMERICA FOR AMERICANS !","commenter_a":"Correct me if I'm wrong but majority is suppose to rule in AMERICA and you only have 4 States that want these people and 20 that don't keep them the F out of America !!! AMERICA FOR AMERICANS !!!","post_message":"'There is absolutely no constitutional power for a state to exclude anyone from its territories,' said one legal scholar."},{"comment_id":"10153695789091336","commenter_b":"No women in combat puts the men at risk to protect them they are targets of the enemy..don't care how strong or tough you think you are you get in the enemy's hands you will see the truth","commenter_a":"There is no way a woman is as physically strong as a man. That is just the way it is. It is just common sense. A woman could be jeopardize the safety of other marines when in battle","post_message":"The U.S. Marine Corps would request a waiver to keep women excluded from infantry and artillery positions, but not armor positions like serving in tank units, according to an official."},{"comment_id":"1007061529350376","commenter_b":"Merry I'm very aware it won't be Carly. It's not time for a female President :-) No female running has the ability to do the job. They're both failures in their past jobs.","commenter_a":"The debate proved why we need a Republican President and not Hillary.","post_message":"If you watched yesterday’s debate, you know we can’t afford to have a Republican in the White House. Say you're with Hillary—add your name: @webpagelink"}]
