[{"comment_id":"717054201797155","commenter_b":"Yeah, she'll get sammich stains all over the front.","commenter_a":"That's a strange dress to wear in a kitchen... Doesn't she know women are better off today than being nothing more than owned objects","post_message":"Kellyanne Conway dressed as the era Trump wants to take America back to. #InaugurationDay"},{"comment_id":"756693807767590","commenter_b":"Ian","commenter_a":"Joshua","post_message":"...bruh"},{"comment_id":"10153127710904726","commenter_b":"This woman is as stupid as she is ugly!","commenter_a":"Brilliant question.","post_message":"WATCH: State Department is called out: Why Have Russian Hackers Seen More Emails Than American Public?"},{"comment_id":"1039200399433046","commenter_b":"What were her parents thinking? I never left either of my children unattended in a car. That could have killed their most precious thing in the world. It is crazy to leave your child unattended in a car at such a tender age. I applaud the rescuers.","commenter_a":"Stupid people shouldn't breed.","post_message":"HOT CAR TODDLER RESCUE>> From Michelle Millman: This just breaks my heart for this little girl trapped in a hot car. A woman broke a car's window in Kansas after seeing a toddler trapped inside. Police say a couple left the girl while they shopped! Sadly, the woman says the parents seemed to care only about the damaged car."},{"comment_id":"10152708692641051","commenter_b":"Dumb girls, they were warned and went anyway.","commenter_a":"Earlier articles said they ran away to join ISIS's cause, they went , now they have to deal with their decision. Sorry, I have very little empathy for them. They basically told their parents, their government and God to go ___ themselves.","post_message":"These parents begged their daughters not to go. They went anyway."},{"comment_id":"908989295805078","commenter_b":"She was discriminatory to Israel in her tweet islamaphibia Israel. The middle east wants us wiped out! She is lucky she is in the USA where she can say what she wants as a woman in her country she would be stoned for the same accusation. Get over yourself lady!!!!!!","commenter_a":"Better yet, just stay home","post_message":"\"This discriminatory and disgusting behavior.\""},{"comment_id":"1628196954146655","commenter_b":"It is in the constitution !!!!","commenter_a":"Yes","post_message":"POLL: Do you support the 2nd Amendment? Comment YES or NO."}]
