[{"comment_id":"10157872915845354","commenter_b":"Sadly, anyone can be an American these days, just run across the border or call yourself a refugee. Too many problems...","commenter_a":"I'd prefer \"firearmS\"","post_message":"Amen!"},{"comment_id":"10153148435072098","commenter_b":"Wrong person died","commenter_a":"Guess his high heels got stuck on the gas pedal haha 😂","post_message":"BREAKING..."},{"comment_id":"10153183466936336","commenter_b":"It's an escort. Nothing will be done to prevent arms to Syria. Another red line crossed. He is an embarrassment and puts us all in danger from terror.","commenter_a":"Iran knows we have a coward President. Even these ships are like a lion without teeth because Obama is Commander in Coward!!","post_message":"U.S. Navy warships are shadowing an Iranian convoy approaching Yemen as the U.S. beefs up its presence in the region. Tune in to 'Special Report with Bret Baier,' tonight at 6p ET for the latest."},{"comment_id":"1221087354570479","commenter_b":"It is French and Spanish ancestries some of the women probably do have more hair than the guys... I should know I was one pretty hairy teenage girl growing up in New Orleans!","commenter_a":" school board has a policy that does not allow any facial hair on male students, Tangipahoa Parish school superintendent Mark Kolwe told ABC News. So female students can have facial hair? Seems sexist to me.","post_message":"The school told all students with facial hair that they had to shave before the ceremony, but the rule was not enforced during the school year."},{"comment_id":"486501341528450","commenter_b":"She's a skank. Thought she was going to leave the us if bush was elected. Leave the us bitch","commenter_a":"The fucking Libtards heads will explode when Trump gets elected. I will fucking LOVE IT!!!!","post_message":"You've GOT to see her characteristically snooty and elitist statement..."},{"comment_id":"10152800967581545","commenter_b":"I'm with you on that","commenter_a":"Thats why i don't let my kids go to other peoples houses. I know im responsible but are they?","post_message":"Police investigated the death of a 13-year-old Garland boy as a possible suicide but later determined his friend likely shot him while the pair were playing with a gun they thought wasn't loaded."},{"comment_id":"1626970717590041","commenter_b":"Just another dumb ass girl.","commenter_a":"Great job to a fellow veteran to set her straight. As a veteran we all lay our lives on the line and people like this little girl has no concept of what that means. It seems to me her family hasn't taught her or the school's she has gone to they need to wake up","post_message":"What an epic response by this Veteran!"}]
