[{"comment_id":"1879546605644644","commenter_b":"She should be in jail","commenter_a":"How is she any different that a Timothy McVeigh home grown terrorist?","post_message":"Ugh"},{"comment_id":"10152593835691135","commenter_b":"Something my psycho ex would do","commenter_a":"YUCK","post_message":"Some men will try almost anything when it comes to building their body...  The latest craze: drinking breast milk.  STORY: @webpagelink"},{"comment_id":"1809742349269568","commenter_b":"IF YOU CAN DUMP TRUMP OVER SOMETHING HE DID YEARS AGO IN PRIVATE LIFE. THEN HILLARY SHOULD BE IN PRISON NOW.LOOK AT 5HE TREASONOUS ACTS AGAINST AMERICANS. THIS IS ALL SHE CAN COME UP WITH TO DEBATE TRUMP SHE HAS LOST ALREADY.","commenter_a":"It's not happening folks, he IS our next president !!!! He has done nothing most guys haven't done around a bar table or a camp fire with their friends, and most girls have done talking to their girlfriends and men, his words can't even come close to what that female has done, so get over it he is the only smart choice !!!!!","post_message":"Lawyers at the Republican National Committee are assessing what legal remedies, if any, could allow the committee to remove Donald Trump as the party’s standard bearer."},{"comment_id":"10153906125115736","commenter_b":"So should grabbing pussy.","commenter_a":"It's already beginning to sound like a dictatorship!","post_message":"Trump says burning the flag should be punishable by \"perhaps loss of citizenship or a year in jail.\""},{"comment_id":"773980632650962","commenter_b":"i cannot stand that woman","commenter_a":"Why don't you just all tell the truth and say \"he's a muslim that's why he didn't go\" it's like anyone would do anything about it!","post_message":"Very painful to watch."},{"comment_id":"10152979533166438","commenter_b":"I love Katy, But I did noticed that and it made me laugh. She has no swag! But I think that's part of who she is she knew she couldn't dance for shit but she went and did her thing with a fresh face.","commenter_a":"What makes me laugh is how people are talking about the shark... Did we not notice Katy herself completely unable to move as a quasi-good dance partner with Elliott's dancers?!?!","post_message":"\"We should leave Left Shark alone.\""},{"comment_id":"10153850035618445","commenter_b":"Your post smells like it was done by a pussy with a badge.baaaacooonn!!","commenter_a":"Text/call us at @username We got good Quality medical marijuana strains for you with optimal potency and of absolute highest quality, I believe that marijuana is a good medicine and should be freely available to everyone regardless of unjust laws. We provide prescriptions for your health issues including: Many more just hit us @username","post_message":"Opponents of Florida's Medical Marijuana Initiative Slam Legalization.   @webpagelink"}]
