[{"comment_id":"10153752215990575","commenter_b":"Better yet, deport them each and every one ASAP !!!","commenter_a":"Shoot everyone of them no more rape","post_message":"Good question!"},{"comment_id":"10154991280103812","commenter_b":"Make America Hate Again","commenter_a":"Hopefully trumps followers do not take this the wrong way and try to overturn the world if he looses.... smh","post_message":"In final campaign stop before Election Day, Donald J. Trump calls on working class to 'strike back.' 'Today is our Independence Day.' @webpagelink"},{"comment_id":"10153988476564255","commenter_b":"Who is this dumb bitch this must be Stacy dash sister","commenter_a":"Unbelievable!!!","post_message":"This is how Fox News celebrates Black History Month."},{"comment_id":"944224732371213","commenter_b":"Yeah, she didn't want to have sex with an Orange baboon.","commenter_a":"I guess Trump would know a lot about attitude. He has a very bad attitude and has the emotional age of three!","post_message":"'She gained a massive amount of weight, and it was a real problem. We had a real problem. Not only that, her attitude,' Trump said Tuesday morning."},{"comment_id":"10153165565220399","commenter_b":"The Democratic President Lyndon B Johnson, the father of the 'Great Society' that was the rebuilding of the Urban Center for the Black communities to populate and be the new beginning for the poor blacks.. How did that workout... Detroit was setup as the model city.. As was Baltimore and Chicago... In reality, all the democrats did was move the blacks from the southern plantations to the Urban Plantations and laugh as they did it!! Here is the quote from LBJ as he did this: 'These Negroes, they're getting pretty uppity these days and that's a problem for us since they've got something now they never had before, the political pull to back up their uppityness. Now we've got to do something about this, we've got to give them a little something, just enough to quiet them down, not enough to make a difference... I'll have them niggers voting Democratic ...","commenter_a":"Blame it on anyone else but your OWN failed policies, GOP.","post_message":"The conservative blame game is in full effect."},{"comment_id":"934315223319642","commenter_b":"Michelle Owen Nyki KiKi 😂😂😂😂","commenter_a":"AHAHAHAGA help","post_message":"Via The Everlasting GOP Stoppers"},{"comment_id":"1022450851126484","commenter_b":"And let's not forget, all of the terrorist attacks on United States soil have been committed by less then 100 Muslims. How many more United States citizens must die before this insanity is stopped?","commenter_a":"How about we see how she rules on things before we pass judgement? If her rulings are in accordance with the laws then who cares. If she starts using Sharia law to pass judgements then we can raise an issue.","post_message":"This is why we can't have nice things...but SERIOUSLY!"}]
