[{"comment_id":"1384307571620555","commenter_b":"I think this woman just swallowed her safety pin.! Lol .","commenter_a":"Grow up you he she","post_message":"Give it a rest..."},{"comment_id":"920944947962651","commenter_b":"soo then Michael is right , those other species of plants are no good , , chop em down & replace them with hemp.","commenter_a":"they need to fix this, and they can, if every person in China planted even just one tree, imagine :) Jude","post_message":"This documentary film went wildly viral with over 200 million views in it's first week online. Now Chinese officials are afraid that you'll see it too."},{"comment_id":"10155754872529778","commenter_b":"@username The more educated? Ooookay... Silly. Smh They're out there marching for you too. Remember that, girlfriend.","commenter_a":"@username Wow look at these comments. Even from women... Ignorant people... This country is in trouble.","post_message":"Ashley Judd says blood on your pants is a sign you're a woman. FULL SPEECH: @webpagelink MORE: @webpagelink"},{"comment_id":"10152792831586130","commenter_b":"Nasty booby feeders??? Really thats ignorant! Howbabout you eat on a damn toilet and tell us how that goes","commenter_a":"Do that in private...how is that difficult?! Restrooms...everywhere!","post_message":"In a time when women are often shamed for nursing their children in public, it's good to know that one of the world's most influential leaders is in support of breastfeeding mothers."},{"comment_id":"1151260644926345","commenter_b":"she is pathetic","commenter_a":"Jenner and malania do look a lot alike .","post_message":"Caitlyn Jenner joined the festivities in Cleveland where she explained her reasons for being a Republican."},{"comment_id":"1077135272363972","commenter_b":"Stop the madness! Go home!!","commenter_a":"Ignorant people taking up the time of our officers who put their lives on the line everyday. Hope none of them have to call 911 one day.","post_message":"Hundreds of protesters marched through Buckhead, blocking part of Peachtree Road. Several people were arrested. @webpagelink"},{"comment_id":"1714085968841110","commenter_b":"WTF WORLD U LIVIN IN THEN MOTHA FUCKA GTFOH","commenter_a":"He need to take him and his gang go play I'm traffic","post_message":""}]
