[{"comment_id":"10154258956738352","commenter_b":"Congratulations. Amazing lady.","commenter_a":"Twins!","post_message":""},{"comment_id":"1137787319581255","commenter_b":"She is a disgrace!","commenter_a":"\"When Democrats win, America wins.\" 😂","post_message":"Everything about the Clintons is fake, including Hillary's faux-Southern accent—listen! #Hillary2016"},{"comment_id":"10153312021701756","commenter_b":"Please Sharon, share sources of actual statistics/studies for this belief. Thanks.","commenter_a":"How about environmental impact? How about helping ourselves? It seems apparent to me that most people truly do not care about animal welfare.","post_message":"Three activists, three answers on how veganism — or vegetarianism, or even just cutting way back on meat consumption — can actually make an impact for animals, and for global inequality."},{"comment_id":"592897514209538","commenter_b":"That'll get a lot of these men shot in the ladies room !!! Hey ladies , keep shooting till you're sure they're dead","commenter_a":"A bunch of idiots!","post_message":"A bill to repeal a rule allowing transgender individuals in Washington state to use public bathrooms based on their gender identity has cleared a state Senate committee."},{"comment_id":"1040232792739639","commenter_b":"Maybe the politicians should take a course in medical health","commenter_a":"She needs to have her nurses license taken away.","post_message":"“You cannot forcibly incarcerate someone if it’s not based on legal grounds” - Kaci Hickox on why she's suing Chris Christie"},{"comment_id":"941382172583454","commenter_b":"Done","commenter_a":"Hey everyone! This is great, and welcome news for the campaign. I wanted to point out that there's another organization we can influence with our votes: Democracy for America is a MAJOR progressive group and they're putting their endorsement up to a vote like a real democracy. All you need to do is put your Name, Email, and Zip Code and once you press enter, go to your email to confirm your vote. It's that easy. Bernie can easily win this endorsement! Spread this message! Voting ends 15 December! @webpagelink","post_message":"\"Bernie has devoted his career to helping working families and is gratified by the support of the Working Families Party. Together they will work to take on the billionaire class and change the the rigged economy that is being held up by a corrupt political system.\" - Jeff Weaver, Campaign Manager"},{"comment_id":"1071556556193998","commenter_b":"So true , I love this","commenter_a":"It all starts within by releasing denial, accepting where we are, and then seeing what opportunities are there. <3","post_message":""}]
