[{"comment_id":"1505305382822543","commenter_b":"Well i guess that's better than a illegal immigrant..","commenter_a":"Don't judge maybe that's his girl","post_message":"At least both the driver and the \"passenger\" were wearing seat belts."},{"comment_id":"10154456636350695","commenter_b":"@username - you sir have won the internet today! That is hilarious!!","commenter_a":"What didn't this guy do during the rampage? I'm sure we're gonna hear he saved 15% on his car insurance next.","post_message":"NEW: Authorities say the shooter texted his wife while he was hiding in a bathroom, asking if she'd watched the news..."},{"comment_id":"1264114950298416","commenter_b":"Trump is a dick and you are a piece of ooow, I'm so scared! As if!","commenter_a":"Hey Kellyanne, I'm going to criticize the orange menace every chance I get!! Come and get me!!","post_message":"Apparently this dimwit has never heard of the First Amendment. --Andrew"},{"comment_id":"10154996300568827","commenter_b":"And when they do they can get arrested for indecent exposer. And if they do it in front of one child they should ALL have to register as a sex offender.","commenter_a":"Why do we need to see his returns...? He was a private citizen...show me yours...","post_message":"Protesters plan to pull their pants down to protest Trump."},{"comment_id":"1665486166837473","commenter_b":"Globalization needs to be ended for this country. Fight against UN agenda 2021/30 with every breathe you have!!!!","commenter_a":"It's a new day the second revolution has come we are taking back America and there will be some changes around here.Joinn us or leave us it's your choice.","post_message":"Everyday patriots..."},{"comment_id":"10153896668671990","commenter_b":"She need the flowjob","commenter_a":"Why didn't this happen to my poll areas","post_message":"Two women, naked from the chest up, bust into a Manhattan polling station early Tuesday, shouting:  of our polls Trump, out of our polls Trump! Donald Trump was expected to show up later to cast a vote himself.  Our reporter Mark Matthews was in the basement of PS 59. @webpagelink"},{"comment_id":"1124493864242596","commenter_b":"I'm not sure why he was with her to begin with if that's the way she feels. She apparently doesn't have the same Christian values, which could only result in disaster for any potential marriage. Tim, you can do much, much better!","commenter_a":"Tebow is a good man......I couldn't care less about his football abilities...","post_message":"Tim Tebow loses girlfriend over Christian values."}]
