[{"comment_id":"939835422761174","commenter_b":"Damn...you are still at it? Get off the computer and go talk to the young men whose lives were destroyed. Go peer at those missing eyes. Go stand near the them who lost legs. Listen to the stories of the PTSD stricken. Then come speak this hunger for war. I took an oath to support and defend this constitution. I have great pride when I see little American children stumble to daycare with their backpacks on. I also know, the threat to us doesn't lie in a desert. No donkeys can cross the ocean alive. It's in the profiteers. Those folk who rattle dangers but are too old to pick up arms. Defending our country has been my lifelong business, but I won't say it's been without questioning where the profit is going! Re-read Sodom and Gomorrah. It wasn't about being gay...it was about PRIDE and INHOSPITALITY both of which ...","commenter_a":"You all should do a little research on Trump, did you know that when his father died Trump stole his brother's inheritance and did not get anything to his brothers kids either. He is a greedy bastard. The pathetic part of all of this is that this ignorant population who is supporting him right now think that he is going to do more for them. He doesn't give a rats ass about any of them at all whatsoever. He would structure tax laws and policies that would for their benefit him once he left the White House if he ever made it to presidency. And all those morons who voted for him would sit there with their asses handed to them.","post_message":"LOL! Somewhere, Pres. Obama is rolling on the floor with laughter! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1033268563393975","commenter_b":"Build the wall already and gas up the coaches to take the illegals home!","commenter_a":"Scumbag democrats and other illegal scumbags.","post_message":"PROTEST TURNS VIOLENT OUTSIDE TRUMP RALLY: \"There won't be no United States without Mexicans.\" [Video]"},{"comment_id":"10153646418046770","commenter_b":"Me too...bad ole' white Cain and Trump lovin' women...shame on us...NOT!","commenter_a":"Love you Herman Cane! Oh, wait, you are black and I am racist! Isn't that what they say! Oh well, I love you, Dr Ben, Allen West! I guess I can be racist some other day!","post_message":"The Cain Train is Back in the Station - Herman Cain is back again live on day 2 of Trump's Convention"},{"comment_id":"10153739914549714","commenter_b":"@username I was going to say that. Both are smokin' tho.","commenter_a":"Cara looks like a dude without makeup","post_message":"Richard Madden was pretty critical of Cara Delevingne and her cringeworthy Good Day Sacramento interview."},{"comment_id":"1259514897430388","commenter_b":"I hope the other women in jail rip her to shreds BARE HANDED","commenter_a":"They outta stab her and rip her cords out without painkillers so she cant have any more kids","post_message":"JUST IN: Buckeye mother Andrea Portillo is accused of stabbing her 5-month-old infant to death. MORE: @webpagelink"},{"comment_id":"10153448155621045","commenter_b":"Sure","commenter_a":"Elizabeth Kidd can we please please please go see this in 3D when it comes out ? Without the kids the first time lol","post_message":"Cannot wait! \"Keep on swimming.\""},{"comment_id":"10153475865743645","commenter_b":"Yes and she is a real b:tch","commenter_a":"Was the gator named karma ?","post_message":"He jumped into a pond to hide from authorities and an alligator attacked him."}]
