[{"comment_id":"10153278657786336","commenter_b":"Nice to meet you as well Sherrell.","commenter_a":"White lives matter too","post_message":"Police believe Daron Dylon Wint – the suspect in the D.C. quadruple murder – may be in Brooklyn, New York. DETAILS: @webpagelink"},{"comment_id":"10153847085126162","commenter_b":"Girl stfu ^^^ u dumb. That's not y.","commenter_a":"As long as her son has a decnt funeral, I dont judge her for using donations for what she needed besides funeral expenses. If it was enough for her to buy a house out of the hood Im sure she would have done that too! If she is partying and gloating about thats not cool. But a scandal after tour the death is kind of hard to deal with so...i cast no judgement.","post_message":"9-year-old Tyshawn Lee's mom is accused of spending money donated for her son's funeral expenses on a new car. FULL STORY: @webpagelink"},{"comment_id":"1134361886576067","commenter_b":"Totally agree!","commenter_a":"We need to have Trump supporters at all polling places. ALOT of cheating will be going on to stop Trump GET THIS WORD OUT.","post_message":"Things could always change, of course nothing is ever set in stone in a presidential race. But for the time being, Trump not only the party frontrunner, he is actually defining the race for everyone else"},{"comment_id":"10153224974921051","commenter_b":"bunch of ignorant women","commenter_a":"Murderous trailer park trash. That is so sad. So the government will feed them anyway.","post_message":"Even the police were shocked that someone could do something so brutal over food stamps."},{"comment_id":"1717801081829837","commenter_b":"Crazy lady.","commenter_a":"go Killery.","post_message":"Is this hypocritical? WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"10153624513811336","commenter_b":"Now the world knows what Cheryl is all about when it comes to black people..","commenter_a":"We also have a president who has made it open season on our police officers.","post_message":"This week on Fox News Sunday: Gov. Chris Christie discusses his 2016 strategy, the government and more. Check your local listings or tune in to Fox News Channel at 2p/6p ET."},{"comment_id":"10154743139306508","commenter_b":"She's a liar ....","commenter_a":"The funny thing is the same scenario happened in Egypt four years ago with the Muslim brotherhood president Morsi, when someone beside him was telling him what to say and was caught the very same way Pelosi is caught now. I think same same school, no difference","post_message":"She didn't know people could hear her"}]
