[{"comment_id":"10153416483736162","commenter_b":"Her heels are scratching up the scoop and that just kills airflow efficiency!","commenter_a":"ALL OF US have pictures like this.","post_message":"A Chicago flight attendant for Spirit Airlines is in trouble for some photos taken on the tarmac at O'Hare Airport @webpagelink  For the stories you care about - \"Like\" ABC 7 Chicago!  Instagram.com/abc7chicago"},{"comment_id":"10153831418716336","commenter_b":"The wall is a good thing and will create thousands of jobs on both sides of the border. It will diminish drug trafficking and illegal entries. Trump has many options with regard to financing this colossal project. Furthermore, there will be no need to round up and deport millions. Simply register and background check everyone that is here illegally. Anyone beyond the dead line to register will be deported when discovered during routine traffic stops for example. The remainder should pay into the system until they complete the legal entry process, whatever that may be.","commenter_a":"Bryan NY Chow","post_message":"\"It's not only deportation. It's building a wall, and I mean a real wall. Mexico will pay for the wall.\"  Tonight on \"Special Report with Bret Baier,\" Donald J. Trump explained his plans for dealing with illegal immigration. @webpagelink"},{"comment_id":"10153309653924614","commenter_b":"She doesn't love him if she's trying to take off his mask","commenter_a":"About time.","post_message":"A Baltimore mother is being praised after cameras captured her berating and smacking her son after reportedly seeing him throw rocks at police during the city violent protests.   wish I had more parents that took charge of their kids out there tonight, the police commissioner said.   Nearly 200 people were arrested on Monday after more than 140 vehicles were set on fire and at least 15 police officers were injured during the protests.   Read KTLA story here: @webpagelink"},{"comment_id":"10154280774612690","commenter_b":"Maybe you're not an American and you wouldn't understand anyway. Your fear is what leads you.","commenter_a":"After this election, the world has truly changed the way they see us. We have become a laughing stock for electing this idiot. If you can truly say you're okay, and you feel safe with Trump as president and his supporters on anew high, then I envy your privilege. Sit back and watch the fall of the American empire.","post_message":"In the largest Texas border city of El Paso, many people are reacting with fear and anger to the election of Donald Trump as president: @webpagelink"},{"comment_id":"10154326338646336","commenter_b":"I don't have a family or children. I am not offended in the least. It might be a downer for those couples that are trying to start a family but geez........just quit being so sensitive. The world is not fair nor is it perfect. Keep moving forward.","commenter_a":"START A FAMILY, START A FAMILY, START A FAMILY. get over it you big babies.","post_message":"Is the phrase \"start a family\" offensive? Apparently some people think so."},{"comment_id":"10152999247891037","commenter_b":"Women dont fight wars....","commenter_a":"If a woman has a bright future she has an option to abort the baby, men don't. Give Men equal rights!!!","post_message":"A new report out today from the Guttmacher Institute shows that 57% of women now live in a state considered to be hostile or extremely hostile to #abortion rights."},{"comment_id":"10154172496221717","commenter_b":"Indiana needs to leave the transgenders alone!!!","commenter_a":"They refused to hear the bill and it's officially dead.","post_message":"Freedom Indiana warns that the the proposed legislation \"could be used to target transgender individuals for discrimination and harassment.”"}]
