[{"comment_id":"10153491404021680","commenter_b":"We live in a generation that feels like everybody owes them something. @webpagelink","commenter_a":"You guys are so biased, it's disgusting.","post_message":"Bernie Sanders must run a gauntlet of closed primaries and Hillary Clinton strongholds next week."},{"comment_id":"10155247808221729","commenter_b":"Jill stein was just in it for the money! She pulled one over on her own people.","commenter_a":"When will these #NOTMYPRESIDENT jerks learn. Get over it. If Hillary would've won we would be over it and preparing for all the bad she'd unleash on the USA!","post_message":"EPIC FAIL."},{"comment_id":"1266839853337023","commenter_b":"Hey Mario, stfu !","commenter_a":"You're an idiot if you think you can light a fire in the airless vacuum of space","post_message":"That classic 'teardrop' shape only forms because of gravity. So what happens when there's no gravity?"},{"comment_id":"10154242349186336","commenter_b":"Darwin is going to get this woman one day soon.","commenter_a":"stupidity !!!!!!!!!!","post_message":"'This woman is extremely lucky. We can’t explain why he didn’t get up.'"},{"comment_id":"10153448214053984","commenter_b":"That lady has a problem nice in front of kids","commenter_a":"He was absolutely right in what he did. People like her should be called out. They have no respect for any rules, they think they don't apply to them.","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"10152854045581749","commenter_b":"Yeah. ..not so much","commenter_a":"Dear President Mr. Obama May God Bless you And your family.","post_message":"'I believe Americans are tired of the political back and forth. People want to see an agenda that moves us all forward.' —President Obama  Read the President's latest message to OFA supporters: @webpagelink"},{"comment_id":"803156879823481","commenter_b":"And people shouldn't look, it's wrong, people have self control, they should use it rather than having breasts being sexualised","commenter_a":"Hey ladies, breast feed away....just remember...there are creepy, shady guys out there who get off on that...why draw attention to yourself...she could have easily done that somewhere else...she wanted the attention...just fkn stupid","post_message":"This stranger started harassing a woman because she was breastfeeding at Target  but customers and staff defended in the most beautiful way."}]
