[{"comment_id":"1708937832702911","commenter_b":"I would like one illegal immigrant or one Mexican to please answer this question. Why is an American considered a racist because we want a wall to control the people that we allow in this country. You just can't have open borders and allow anybody and everybody to come in that is not a country anymore. Furthermore why is it that Mexico has a Huge fence with Barbwire and guards in towers with rifles by the Mexican Guatemala border??? What hypocrites!!! Maybe because Mexico does not want illegal immigrants coming into their country from the Guatemala border but Americans are racist if we don't want illegal immigrants coming into our country. Totally absurd!!","commenter_a":"And they have the Bundy 's in jail and killed Levoy . These violent protesters get to go home alive .","post_message":"HOW INSANE! Photos and videos you must see from last night:  @webpagelink"},{"comment_id":"10152784038336491","commenter_b":"Preaching to the choir, sister! One of many reasons I'm now divorced.","commenter_a":"Now if only science could find a man worth having......","post_message":"Science shows that there are quite a few health benefits of getting intimate."},{"comment_id":"10154448446471636","commenter_b":"If liberalism is bad, what, IYO, is good?","commenter_a":"The coup is being instigated by the political establishment and the media against the people who dared to vote in what they dictated was the wrong way. They are mobilising the generations brain washed by leftist infiltration of the education systems to do their will. This is going to get bloody","post_message":"'If you're still trying to convince yourself that a 21st century coup is not underway, please, please snap out of it'"},{"comment_id":"1114761541897178","commenter_b":"Do me a favor. Never EVER put this ugly bitch's face on my timeline again","commenter_a":"moron","post_message":"***FIRESTORM OF DEMOCRAT LIES***"},{"comment_id":"546543972211278","commenter_b":"More Bullshit they don't do any of the test you say they do... Your make how much money off Dead Babies at 9 months? Disgusting Women","commenter_a":"Only a woman should decide what happens to her and her body!! Unbelievable that a so called modern nation is still discussing about that issue ! The body of a woman is not a incubator without any rights!!","post_message":"\"I will defend Planned Parenthood. I will defend Roe v. Wade. And I will defend women's rights to make their own health care decisions.\" —Hillary"},{"comment_id":"370042553184039","commenter_b":"marriage was not meant to be a shitty relationship depends have a market I would like to invest","commenter_a":"evolution and same sex cannot coexist","post_message":"POLL: God's design for marriage? (man and woman)"},{"comment_id":"10153197187718132","commenter_b":"The other woman is nuts and seriously needs to commit herself. She's making a bad name for herself doing stupid things like billing other children.","commenter_a":"Both parents failed here!! Poor kids.","post_message":"This is serious business."}]
