[{"comment_id":"628365077296674","commenter_b":"\"Woman\"","commenter_a":"woman?","post_message":"I want her sick face everywhere......people need to know how twisted this woman is!"},{"comment_id":"10153601261735861","commenter_b":"LOSER!!!!","commenter_a":"boomer","post_message":"Oklahoma State slips in the AP Top 25- OU moves up"},{"comment_id":"1874042932818866","commenter_b":"She is the mentally unstable one.","commenter_a":"And you should have left by now. We already elected him!","post_message":"Rosie O'Donnell says Trump is mentally unstable, and we have \"less than 3 weeks to stop him America. Do you think her comments are treasonous?"},{"comment_id":"581788285320289","commenter_b":"Great bitches pun","commenter_a":"@username future job","post_message":"All aboard! These rescued puppies are seeing the entire town on this custom \"dog train.\" (via NowThis)"},{"comment_id":"1160927630633650","commenter_b":"I don't care, I eat it. Yum yum.","commenter_a":"But this is exactly what you do when you eat meat, fish or any kind of breathing animal....but you don't realise because someone did the dirty job for you. Wake up animal eaters.","post_message":"Not what you want to see when you're out shopping"},{"comment_id":"10153217092086943","commenter_b":"Heads need to roll for this and indictments handed down. My what our government has come to. Nothing but self serving law breaking idiots.","commenter_a":"@username is relentless about getting to the truth. They work for the people by continuing to tirelessly go after these corrupt polititions and agencies in our government who some how think they are above the law. Congress has caved into the stall tactics by this corrupt administrations Justice dept, Irs, and State Dept. Thanks @username.","post_message":"This is from an Investor's Business Daily editorial yesterday: \"Thanks to a band of lawyers called Judicial Watch, and no thanks at all to the mainstream press, we are learning about a shady October 2010 meeting between former IRS official Lois Lerner, Justice Department officials and the FBI.\""},{"comment_id":"10157411786570594","commenter_b":"Mean douches create little mean douches. The parents created these mean little spawns.","commenter_a":"why does the school district tolerate this? those kids should be expelled and parents should be educated about this....","post_message":"His mother has pulled him out of the school."}]
