[{"comment_id":"10154774473425575","commenter_b":"@username - islamic women are smart enuf to use these clueless American women to further their islamic agenda. but the women marching think its a march to protest defunding planned parenthood. very sad to be very dumb.","commenter_a":"can the 200K marching women be shipped to syria or where ever hamas HQ is? - lmao","post_message":""},{"comment_id":"10153304270661051","commenter_b":"(Sigh) Non sequiturs everywhere.","commenter_a":"So. Arrested him for killing a lion and thugs that kill cops are going free what's wrong with picture so animals are more important than people's lives","post_message":"Cecil the Lion's hunter has been arrested."},{"comment_id":"370743173113977","commenter_b":"Should have thrown the book at her!!!","commenter_a":"Hell yes she deserved it!","post_message":"Did she deserve that?"},{"comment_id":"1281382285238371","commenter_b":"Well said. If this Jolie live in Muslim country like we do ,then her opinion about Islam will radically change. She should know the Muslim will never compromise with others..stupid","commenter_a":"I don't listen to rich new world order liberal fucking wackos. If the come out and try to tell us all to do something. Its never ever good. This Bitch is rich living in nice safe places. Safe from the hell the rest of us would have to deal with","post_message":"DOES ANYONE CARE WHAT THIS LOSER HAS TO SAY?"},{"comment_id":"10153606211671509","commenter_b":"Gee I wonder where he gets his behavior from ?","commenter_a":"Good job mama :) the world needs more like u","post_message":"What do you think of this mom's actions? Taking matters into her own hands, her son got a heavy dose of discipline on live TV: @webpagelink"},{"comment_id":"10152896825378635","commenter_b":"What cowards!!! Five against i woman!! Day of judgement belongs to the Father\" Animals!!! There will be no rest , or prizes , at end of life for you .. How C an you be so dumb!!!! .so so evil ... Under the control of satan, and do not even know it!!!","commenter_a":"There are bad people in every religion.","post_message":"\"The five Muslims took hold of me, and they raped me there,\" the church source quoted the daughter as saying. \"I tried to scream, but they threatened to kill me. One of them said, 'Your father should stop this prayer meeting of trying to change Muslims to become Christians and close the church building — we have warned him several times.'\""},{"comment_id":"10153880714231509","commenter_b":"It's her baby. If she says no then it's human trafficking.","commenter_a":"It's HER baby. Period. And the father and her can share it.","post_message":"Should the surrogate mother be able to keep her? This baby's future is now in the hands of the courts: @webpagelink"}]
