[{"comment_id":"10154165020726943","commenter_b":"Hillary, you look really tired. Even with all that makeup on. Just think how tired and hot you'd be if you were in Louisiana now like Donald Trump. Think how tired you would be if you had his schedule. Think how exhausted you would be trying to be President every single day. Please just give up now. With all your money, wouldn't it be nice to just stay home and spend time with your grandchildren?","commenter_a":"keep up the good work","post_message":"A federal judge in Washington, D.C. ruled Friday that Hillary Clinton must answer written questions from a group that filed a lawsuit over her private email server.  Lawyers for Judicial Watch, a conservative government watchdog organization, asked to interview her under oath as part of their Freedom of Information Act lawsuit against the State Department. - via NBC News"},{"comment_id":"608627489270433","commenter_b":"More like the other way around...in Indian culture it's arranged for money issues, not love...and then the wife's are treated like maids...atheist she can be a maid to a person who loves her, for her and not for the money","commenter_a":"At least he didn't end up stuck with her.","post_message":"This has to be the worst Bride OF ALL TIME!"},{"comment_id":"493850430805537","commenter_b":"Shut Her Down !","commenter_a":"They spend money that is not theirs and should be made to pay it back.","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"10153916227396756","commenter_b":"I'd still prefer to toss Mississippi out of the US. For this exact kind of thing, actually.","commenter_a":"Whenever someone complains about the Confederate Flag i just look over at the ol' Stars and Stripes and think \"guess your times coming too\".","post_message":"After the student senate vote, Mississippi Gov. Phil Bryant said, \"I think college students react a lot emotionally,\""},{"comment_id":"10152879286473961","commenter_b":"Only ridiculous and delusional if you think like a liberal Democrat.","commenter_a":"We've had 6 years of progressive liberal foreign policy. It can be summed up as alienate our allies, embolden our enemies, abandon our gains and weaken American prestige throughout the world. Obama has managed to squeeze this in between rounds of golf.","post_message":"It’s time for progressives to outline a coherent, proactive foreign policy vision. Check out my op-ed on Medium where I share my ideas and add yours at www.chanceforpeace.org."},{"comment_id":"841387199293221","commenter_b":"Lol bitch ass no life","commenter_a":"Who cares about a road named after we want justice for her and her killer or killers in jail for murder so sad hoping we get justice sad it takes this to game a road names after you praying for your family and friends rip Sandra justice 4 Sandra","post_message":"It is the same stretch of road on which she was arrested."},{"comment_id":"10153567353788984","commenter_b":"I will have one long after your ass is gone","commenter_a":"that just show the driver of the truck isn't paying attention what is going around his ride. That ass hole would be wearing salt rock in his britches","post_message":"I don't care what your opinion on the Confederate flag is, there's no denying that what this guy did is truly insane..."}]
