[{"comment_id":"10153100496946051","commenter_b":"i hope the fry his fat white ass","commenter_a":"He deserves life. He has destroyed that child's .Sending prayers for that little Man","post_message":"An 8-year-old boy was playing outside his apartment complex when this man showed up and shot him in the face. Decide for yourselves if the man's punishment was severe enough."},{"comment_id":"1019686794754611","commenter_b":"Words that are meaningless. Go Hillary, really, go (away)","commenter_a":"whole as in Benghazi?????","post_message":"\"Despite what you hear, we don't need to make America great again. America has never stopped being great. But we do need to make America whole again.\"  Moments ago at her #SCPrimary victory speech, Hillary Clinton invoked Donald J. Trump's campaign."},{"comment_id":"198765370606154","commenter_b":"Bye Bye!","commenter_a":"Also you suck at acting","post_message":"George Lopez is still angry about the outcome of the presidential election. Let's make 200,000 #SHARES if you Never want to see Lopez Again !!!!"},{"comment_id":"10152997147654411","commenter_b":"All the western puppets are traitors,DIVIDING AND CONQUERING USING IMMIGRATION AS A TOOL TO PUT THERE SOCIALIST POLICIES THROUGH.","commenter_a":"wheres ya burka merkel,traitor bitch","post_message":"Angela Merkel has accused leaders of Pegida anti-Islamic movement, which is gaining popularity in Germany, of hijacking the slogan of 1989 Berlin Wall demonstrations,  sind das Volk ( are the people) for their xenophobic purposes."},{"comment_id":"10154499778649091","commenter_b":"Edwin, you only sound ignorant.","commenter_a":"I proposed a law in which all pit bull owners and their dogs take obedience training. The dogs and owners should take some test to see if dog can handle being around people. Too many times do I read stories about pit bull attacks. I know they all aren't bad, but some tend to snap and kill or severely injured people. Let's all write to trump so he can executive order this law","post_message":"After a young boy was seriously injured after being mauled by one of two pit bulls inside his Brooklyn home, his uncle says the 5-year-old took the brunt of the horrific attack to protect his younger siblings."},{"comment_id":"889715544460386","commenter_b":"So tired of this progressive rant. If you come here illegally you need to go home. PERIOD!","commenter_a":"Are they trying to lose the election?","post_message":"She says the holiday-season roundups were \"mass deportations\" that are sowing \"division and fear.\""},{"comment_id":"10153815674903299","commenter_b":"Funny how y'all are judging but if you think you're perfect you're wrong. Trump may not be perfect but at least he's not selling out to the ones trying to take away our Christian beliefs.he wants Christian morals back in our schools and families and I don't care about the rest. God will handle the rest. If Hillary gets in you better learn Sharia law because shes already sold out. At least we have a chance with trump.","commenter_a":"1168434116541793maybe you should research Hillary 100% lies","post_message":"\"What you really have to do is you have to pray to get everybody out to vote for one specific person.\""}]
