[{"comment_id":"10153560600894087","commenter_b":"DUDE ....PAYED FOR? ....REALLY? ....Hillary Clinton is the biggest political whore to ever walk the planet....SMARTIN UP","commenter_a":"Chris Christie is bought and paid for. Don't be surprised when he gets a position in Trump's cabinet. Donald Trump is used to paying off politicians. And some think he will change things in Washington. Lol. What a joke. \"I've got to give to them. Because when I want something, I get it. When I call, they kiss my ass.\" - Donald Trump on giving money to politicians.","post_message":"“Get in the plane and go home,” Donald J. Trump told Chris Christie after the New Jersey governor introduced the real estate mogul at a campaign rally. WATCH:"},{"comment_id":"10156094482870354","commenter_b":"Throw that fat stank ass pig in the pen!","commenter_a":"She deserves the same","post_message":"***UPDATE***"},{"comment_id":"1757425844524023","commenter_b":"Is not as easy as you put it my friend, illegal immigrats don't just \"apply\" to get their papers...if it were that easy we woudnt have so many illegal immigrants.","commenter_a":"I am sure this girl is worried about deportation of her parent's. I am also certain that many kids of illegal immigrants living in the US are fearful.. but wouldn't parents apply for a visa and for proper citizenship? So their kids wouldn't live in fear? And set an example that this is exactly why the US is the greatest place to live!","post_message":"Young child of undocumented parents speaks at the Democratic convention about her fear of being deported: \"I’m scared that at any moment my mom and my dad will be forced to leave. And I wonder what if i come home and find it empty?\" @webpagelink #DemsInPhilly"},{"comment_id":"10153470149826234","commenter_b":"By a lot !!","commenter_a":"Amy check out HR. Looks like you got low balled","post_message":"Nice work, if you can get it."},{"comment_id":"908423465917375","commenter_b":"And all this time the US is an OLIGARCHY","commenter_a":"Never could understand how socialist was an insult to Americans","post_message":"Do they even really know what that word means?  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"596504240534222","commenter_b":"She is such a liar!","commenter_a":"If Donald would answer the question instead of just attacking Hillary perhaps she could stop having to check and correct his accusations first before actually answering the question in her own 2 minutes. Geez it's insulting that this man shows up to a debate unprepared. #whatajoke","post_message":"RT LIVE STREAM: Hillary Clinton / Donald Trump 2nd Presidential Debate (Courtesy: Ruptly)"},{"comment_id":"684786888378556","commenter_b":"everyone has a right to their opinion, some are better than others, Go Clint","commenter_a":"He is furious with Clint but LOVES all the celebrities that pander to him........","post_message":"Obama wants Clint Eastwood finished, but he is holding his ground. H's in trouble. Let's show him our support. Can we get 100,000 'LIKES' for Clint Eastwood?"}]
