[{"comment_id":"10152925868341336","commenter_b":"I agree Joanie, impeachable offense to release enemies from Gitmo to try to kill Americans again!","commenter_a":"Obama has committed treason with this big time!!! Why hasn't congress started impeachment.","post_message":"The U.S. Army has decided to charge Sgt. Bowe Bergdahl with desertion, according to Retired Lt. Col. Tony Shaffer. He told Bill O'Reilly that the Army \"wants to do the right thing\" but The White House \"wants this to go away.\" @webpagelink"},{"comment_id":"1640792116219030","commenter_b":"That takes some balls","commenter_a":"What a pair to draw too. How can anyone support these idiots.","post_message":"Details you'll want to know are here: @webpagelink"},{"comment_id":"956693264446697","commenter_b":"If my 2 daughters were still in school now and this begins I would not send them to public school it would be private or at home its just not safe, I don't have a problem with transgender boys don't belong in giur!s bathrooms and visa versa","commenter_a":"Wow..that's a big problem..!..put a extra bathroom in for Transgender..simple..problem solved..","post_message":"President Obama recently said all public schools must allow transgender students to use the bathroom of their choice. Let us know your thoughts below:"},{"comment_id":"10153974201673445","commenter_b":"They don't care about you & me.Ain't it always about the buck & Greed.Karma will get those Clowns.Lawsuits are coming!! Let's put these clowns on Min.wage.We won't have to worry about them working overtime.Take away the free Health Insurance,put them on O'Duma care.Take away their pension.It's the taxpayers money.","commenter_a":"They continue to reject medical marijuana but continue to give out pain killers and other sedatives wow seriously","post_message":"VA Hospitals Will Continue to Reject Medical Marijuana."},{"comment_id":"10153825929880399","commenter_b":"Domestic Terrorists","commenter_a":"Let's say Trump gets defeated; narrowly or by wide margins, makes no difference. Will his supporters begrudgingly acknowledge defeat in the public forum of a democratic vote? Will they accept hat their ideas and policies, such as they are, are not accepted by the majority of their fellow citizens? I don't believe they will. And what then? Will they turn to other methods to advance political ideas that cannot be achieved through conventional democratic means? And what will we call them then...?","post_message":"Josh Marshall \"You can say all sorts of things about these folks being crazy, or extremists or whatever else. But set aside all these evaluative or partisan interpretations and one thing is fairly clear in objective terms: a large portion of the GOP is not satisfied with what can realistically be achieved by conventional political means.\""},{"comment_id":"676191809238064","commenter_b":"I`ll say it agin, if the damn guns would stop shoten off there damn barrols!","commenter_a":"This father did not know his son was mentally ill and did not know his son was planning to commit mass murder with the dozen or so guns that unknown to this same father. This father is such a failure and out of touch with his son that his opinion doesn't count. He failed his son and now wants to put the blame some where else.","post_message":"The father of the shooter in Oregon just blamed guns for what happened. He must be out of his mind. This is a sick joke. Do you think his son is to blame?"},{"comment_id":"10155810276030725","commenter_b":"DO AM I STUMPING FOR DONALD? NOT SURE YET, MAYBE. Definitely our country has had already more than enough from LYING lawyers turning politicians! After all, LYING is the job they do best and nothing else really matters to them. Talking to many Hispanic,- with common sense- good friends of mine, I found out that they all agreeing with DONALD TRUMP! And it's not because they aren't hospitable and compassionate people. To the contrary! It's because of the fact that most of these illegal bad apples in their efforts to blend in and avoid being getting caught, always have settled in their neighborhoods bringing their drugs their street gang attitudes and criminal ways with, and my friends are the very first to have been victimized by. Now of course not all illegals are bad, but some are and one is too many. That's the reason we have legal immigration so ...","commenter_a":"I'd like to know how many illegal immigrants Trump employs and has employed.","post_message":"Statement on Relationship with NBC-"}]
