[{"comment_id":"1170571449649992","commenter_b":"A lot of dumb chicks out there..","commenter_a":"Love it!!!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"748895108560603","commenter_b":"Wonder where she got those mouth sores?","commenter_a":"from people that scream to be treated fairly the gay community and its supporters sure spew a drastic amount of hate.","post_message":"It's good for thee but not for me. -1000pts. @webpagelink"},{"comment_id":"10154217110321770","commenter_b":"We have a lot of work to do in America cleaning our schools of these liberal crazy teachers.","commenter_a":"This country, well the insane left, has lost it completely. Just flat out have gone rabidly insane. They need STOPPED. Now.","post_message":"These are the people teaching your children"},{"comment_id":"377454052442889","commenter_b":"Let's BAN Muslims, this is our country and our freedom of religion!!!! They need to go back home where they belong to do this in their own country!!!!😡😡","commenter_a":"If the Muslims choose t o.live here, Don' t tell us what you want. This is America and a lot of us are Christians and we don't need or want immigrants telling us to change our beliefs. If you don't like our beliefs and our freedoms, maybe you should g o back to you country and try to get along. If you choose to stay here and enjoy our life and freedoms, then stop telling us to give up.our beliefs. I suggest you join a branch of service and share the responsibility of living here instead of holding your hands out for every thing you can get for free. It's time we stand up to you and what you want. I'm tired of it. God bless America!!!!","post_message":"The want to change Easter in 'Spring Break'..."},{"comment_id":"10152776744107217","commenter_b":"Vicki Wray better start thinking of other names 😂😂😂😂","commenter_a":"Beautiful names xxx","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"},{"comment_id":"977192562373798","commenter_b":"why not a woman","commenter_a":"Great news. Some disquieting news is that Hillie is considering Julian Castro for her VP. He is a good one and I guarantee he would jump. I really wish I knew who Bernie is considering. It should be a person of color imho.","post_message":"The American people are definitely feeling the Bern."},{"comment_id":"1632165196804485","commenter_b":"'@username how are we snowflakes if we don't want to hear the opinion of some feminist being sad about a pipeline when there are thousands already in this country. To the other side of the wall for you.","commenter_a":"Unfollow.","post_message":":("}]
