[{"comment_id":"10152797657587144","commenter_b":"Those \"additives\" include vitamins and minerals. I'll take it.","commenter_a":"Oh yeah, I just remembered why I unliked @username in the first place.","post_message":"\"A jug of almond milk containing roughly 39 cents worth of almonds, plus filtered water and additives, retails for $3.99.\""},{"comment_id":"1841606822750087","commenter_b":"KORDSTAN","commenter_a":"So glad he is gone!","post_message":"President Obama delivered his final address to the American public in Chicago. How will you remember Obama's legacy? #ObamaFarewell"},{"comment_id":"10153344624090326","commenter_b":"Sit down and shut up!","commenter_a":"He has hearing problems nothing is free","post_message":""},{"comment_id":"899557670234809","commenter_b":"This is the STUPID BITCH that just spent 8 years in the White House, what a piece of shit she is","commenter_a":"She has always been a JOKE","post_message":"He stepped to Michelle in a way she probably never thought anyone would.  Serious respect for this man. Let's get his back.  Let's get 3,000 'LIKES' for this soldier!"},{"comment_id":"1022617317773941","commenter_b":"Is the virus an illegal alien?","commenter_a":"Where's you sense of urgency to find and deport illegal alien fellons!","post_message":"Unlike Congress, Zika infected mosquitoes aren’t going to be on recess next week – they’ll be working. The emerging Zika virus poses a serious threat to our public health, and members of Congress should not leave for recess without passing President Obama's emergency funding to fight this virus."},{"comment_id":"10154735713113132","commenter_b":"She lives for the fame..controversy and all.","commenter_a":"Why discuss this with tabloids? What does her children gain from it? That's private. Quit putting your kids out there to be vulnerable like this.","post_message":"Kate Gosselin is opening up about her son Collin."},{"comment_id":"10152955885854641","commenter_b":"we never tolerate any humiliation to our beloved prophet","commenter_a":"For some idiots act why do you drag the entire religion and keep mocking them... By speaking m I terrorist to you that I'm a Muslim ??? What do you have in mind?","post_message":"Muslims respond to Charlie Hebdo’s new Mohammed cover with mixed emotions: cnn.it/14xIMA6"}]
