[{"comment_id":"1024646927570802","commenter_b":"What RUBBISH!","commenter_a":"Reality is that even if you consider it a minor incident, which it appears to be, the trumpster and his campaign manager lied about it, and are still doing so. He doesn't apologize. He doesn't ask for forgiveness. See a pattern?","post_message":"WATCH: Florida police have released surveillance video showing the incident between Donald J. Trump's campaign manager Corey Lewandowski and reporter Michelle Fields. Trump's campaign issued a statement calling Lewandowski “absolutely innocent” after he was charged with misdemeanor battery. @webpagelink"},{"comment_id":"1789421224648085","commenter_b":"Ohio RED","commenter_a":"Trump 2016 #MAGA vote","post_message":"Donald Trump rallies at Michigan"},{"comment_id":"10154054531268984","commenter_b":"shes a bitch, and has over inflated the facts and and did not do the research in her questions it was all edited as thats what the media does they piece the words together to suit them sick of of all news media they do not report anything truth anymore just the lies they try to make into thier own little fantasy world to get them in the spotlights of the media world ........","commenter_a":"M KELLY IS A LOW-CLASS BITCH","post_message":"Megyn Kelly was in the middle of her live TV show when news broke that Donald Trump would officially be skipping the Fox News GOP debate. Talk about a captivating moment of live television... Do you think Donald J. Trump made the right decision?"},{"comment_id":"1022015544612032","commenter_b":"lol these pansies lmao","commenter_a":"Trump is a honest president Obama and Clinton's can go way impeach Obama.","post_message":"BREAKING: Hillary Supporters Threaten To Kill Trump Electors Oath Keepers Response Is EPIC Electors are getting death threats from Hillary's and Obama's THUGS. That's TREASON! Support the Oath Keepers!"},{"comment_id":"418116258312969","commenter_b":"Heaven help us if voter fraud (no picture ID) elects this incompetent lady","commenter_a":"Zero chance","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"},{"comment_id":"370852156623268","commenter_b":"It appears that She doesn\"t know how to do anything. Maybe she can pole dance or do hoing!!!!","commenter_a":"Guevona!","post_message":"She hasn't done anything..."},{"comment_id":"483277565194949","commenter_b":"Jesus wouldnt like that she kills babies for a living.","commenter_a":"So sorry you folks are tearing this young woman apart, would Jesus do this?","post_message":"What'd you think, folks?"}]
