[{"comment_id":"10156303577690354","commenter_b":"She should be in jail for her do nothing in Benghazi.She is a liar and I hope she gets what she deserves.She thinks She is above the laws the rest of us must follow.Oh and why is Sharpton not in jail for not paying his taxes.We've got to get rid of all of these politicians.","commenter_a":"Yes she did","post_message":"\"Clinton may have committed perjury, then, when she signed a sworn statement promising that she turned over all of her work-related emails pursuant to a Judicial Watch lawsuit for Clinton’s email records.\""},{"comment_id":"1130006897113975","commenter_b":"Get out of America then","commenter_a":"It is a sad day in America. One of the most disgusting men in in our country won the election. I am so sickened by the citizens who would cast their vote for such an evil man. Do they really feel he is person to speak for us as a nation. I find him so repulsive by his words and actions.","post_message":"THESE 23 HOLLYWOOD IDIOTS PROMISED TO MOVE IF TRUMP WINS..... LET'S HOLD THEM TO IT"},{"comment_id":"683847751805803","commenter_b":"WTF!!! Enough of the PC climate in today's world! We celebrate American holidays in AMERICA! If the illegal immigrants want to be celebrated they should NOT break our LAWS and just STAY the hell in their own country!","commenter_a":"will not!!!!!!!","post_message":"Obama has created his own 'Holiday' and is forcing it upon American citizens.  We will stick to our own holidays thank you very much.  Will you refuse to celebrate Obama's made up holiday?"},{"comment_id":"1514259995548132","commenter_b":"... People do realize the article isn't about humans right? None among us can store the seminal fluid of various males and asses it for quality before choosing our baby daddy's, just FYI. ;)","commenter_a":"Rachel Pratt :)","post_message":"There's more to semen than just sperm."},{"comment_id":"1420083668051377","commenter_b":"Oh shes a female.. whoops","commenter_a":"Muslims r like a football team. The radicals /terrorist r the strikers. The extremists r the midfielders who feed the radicals. The defenders r the moderate Muslims who create diversions, deflect, defend and save Islam from legitimate criticisms n any accusations. They work as a team though they create the perception that the defenders have nothing to do with the strikers. The Liberals r the goalies who jump in when the situation gets worse with statements like Islam is a religion of peace @ De Joe Int'l ur comment had to be repeated.","post_message":"'We march through the night to cut and behead... Allahu Akbar'"},{"comment_id":"10153881330947434","commenter_b":"So funny how some morons predict an armageddon just because their feminist messiah didn't win.","commenter_a":"Except for the fact that Jill is only asking for recounts in places where Trump won narrowly and has continually ignored asking for recounts in areas where Hillary won by even less votes. It's not about electoral integrity, it's about a woman having an infantile, foot stomping temper tantrum because she didn't get her own way.","post_message":"Jill Stein herself, standing across the street from Trump Tower, encouraged the president-elect to support her campaign’s efforts to ensure that every vote is accurately counted. “There is nothing to be afraid of,” Stein said, “if you believe in democracy.”"},{"comment_id":"884868911589338","commenter_b":"More like the Supreme Joke of the United States, where the highest bidder wins the votes. They should just remove the robes and wear clown outfits.","commenter_a":"Franklin Graham The Supreme Court of the United States has ruled today that same-sex marriage is legal in all 50 states. With all due respect to the court, it did not define marriage, and therefore is not entitled to re-define it. Long before our government came into existence, marriage was created by the One who created man and womanAlmighty Godand His decisions are not subject to review or revision by any manmade court. God is clear about the definition of marriage in His Holy Word: a man shall leave his father and his mother and hold fast to his wife, and they shall become one flesh (Genesis 2:24). I pray God will spare America from His judgment, though, by our actions as a nation, we give Him less and less reason to do so.","post_message":""}]
