[{"comment_id":"10154478152135326","commenter_b":"Lying hyena she worse than she dog","commenter_a":"We all got something to say about Donald Trump, and his supporters and helpers but he still the president and he's still putting our lives in danger.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"706978382784196","commenter_b":"MAKE AMERICA AMERICA AGAIN!!!!!!","commenter_a":"Come on Bill, let us hear the speakers, please.....","post_message":"Duck Dynasty on A&E's Willie Robertson, former Texas Governor Rick Perry, retired U.S. Navy SEAL Marcus Luttrell, actor Scott Baio and Patricia Smith, mother of Benghazi victim Sean Smith, speak at the Republican National Convention."},{"comment_id":"10153787170708338","commenter_b":"'@username would you like an A for English ? You got the picture right? That's all that matters, just for you I'll make it politically correct Lose!!!! Here you go","commenter_a":"Round the gangbangers up, they need to see what it looks like to lose an innocent child!!! Round them up and have them put in detainee prisons and ship they butts off to a open area so they can be at war with each other so that Chicago can live in peace!!! No need for burials and insurance just leave them right where they lay!!!! This is truly sad , this baby won't see thanksgiving or look forward to the surprise of his favorite gift on Christmas","post_message":"Visitation for 9-year-old Tyshawn Lee is being held today at Haven of Rest Missionary Baptist Church. CBS2's Mai Martinez will have a live report at 5:00 PM."},{"comment_id":"10155292076102501","commenter_b":"can't we keep her out of this state somehow? I tihnk every time I see her kids commercial how many unborn infants have died because of her support for abortion. Protect kids? Get serious lieing Hillary","commenter_a":". --------------------------------------------------------------------- HILLARY - BREAKING THE GLASS CEILING? --------------------------------------------------------------------- Mrs. Clinton, how can I possibly tell my daughter to follow you as an example after you allowed your husband to assault and demean multiple women throughout his political career? Were those women not important? Tell me, will you fight for my rights like you fought for those womens? Ummmm, I hope not. What about the sisterhood, Mrs. Clinton? Did you expose your husband for his abuse? No! Instead, you enabled him as the abuser and tried to silence his victims. How can you live with yourself? Female empowerment? ......... Nice try!","post_message":"Hillary is coming back."},{"comment_id":"566067710239006","commenter_b":"Her momma should have sucked it","commenter_a":"Jennifer who!","post_message":"Jennifer Lawrence to Donald Trump: F*** YOU!"},{"comment_id":"1320166798020657","commenter_b":"You are Sooo Pretty, Young Lady!","commenter_a":"Why is right. Totally agree, Brandon!!","post_message":"TheBlaze news update with Sara Gonzales and Brandon Morse."},{"comment_id":"496464583811469","commenter_b":"we are not picking on her because she is a women!!!!!!!!!!!!!! Get that straight right off! we are stating that she has a very long line of a shady past, and if you people dont get your head out of the sand it could very well damage our country more than what we can correct. She will never get my vote, already saw her in action and it was not a pretty site.","commenter_a":"I can't believe how mean and cruel people are!!! It's sad. Hillary is not perfect, no one is!! She has made mistakes just like all the other presidential candidates. Every person that has run for President and every President in the White House has made lots of mistakes. Everyone picks on her because she's a woman!!!!! I'm thinking seriously about voting for her.","post_message":"Trump says Clinton is a woman abuser who would be a horrible president. Agree or disagree?"}]
