[{"comment_id":"908022272624161","commenter_b":"How dare they,women please make your votes count!","commenter_a":"I don't understand how any woman can be a republican!","post_message":"Another day, another Republican attack on women. Shame on them.  Read more here: @webpagelink  Image by Occupy Democrats, LIKE out page for more!"},{"comment_id":"10154753086323967","commenter_b":"He is building a wall","commenter_a":"Come on, guys. Our new president told us this was all a hoax perpetrated by the Chinese. We're clearly in good hands.","post_message":"Unstoppable."},{"comment_id":"1027413480657895","commenter_b":"Cause he wanted to, yall white people ready to see a brother arrested","commenter_a":"He has already turn himself in people are so stupid","post_message":"UPDATE: The brother of the man identified as a person of interest in the downtown shooting tells NBC 5 his brother has nothing to do with the shooting - in fact he said his brother handed his gun over to officers when the shooting happened: @webpagelink"},{"comment_id":"10152781007061615","commenter_b":"Our veterans go without while lazy a**es and foreigners collect cash, food stamps and free medical. What's wrong with this picture??? VETERANS AND ALL MILITARY SHOULD COME FIRST! They put their lives on the line so the lazy idiots and illegals don't have to. WAKE UP AMERICA AND GET YOUR PRIORITIES STRAIGHT!!! Rant over.","commenter_a":"but it was OK that he put his life on the line for this country give the man what he deserves","post_message":"DENIED. An American hero, unable to collect his military benefits when he needed them most. WPXI Rick Earle gets help for this veteran. His story is coming up tonight at 5:45 p.m."},{"comment_id":"902293323230618","commenter_b":"Please put the lying pig in prison where she belongs","commenter_a":"Isn't it ironic the Bill Clinton appointed Loretta Lynch in New York City to her appointment as federal judge there! Obama appoints Loretta Lynch to be attorney general after ever called or left! Barack Obama supports Hillary Clinton for president of the United States saying he doesn't think she did anything wrong! Loretta Lynch Meats with Bill Clinton by coincidence in Arizona Airport where they both went with private planes and just happens to be on this farm at together! After Loretta Lynch meet with Bill Clinton by chance and the Arizona taubat she requests the judge postponed releasing Hillary Clinton's emails for 200 and some days after the November election! How are you folks believe Barack Hussein Obama's administration is not totally corrupt I guess you're waiting for the Easter Bunny, Santa Claus and any other mythical person to come by your side along with the Unicorn! I guess ...","post_message":"An iconic photograph of Hillary Clinton using her BlackBerry while wearing sunglasses on a military plane prompted an official in her office to inquire about whether Clinton had been assigned a government email address...  The information came out in sworn testimony in a Judicial Watch deposition of Karin Lang, a former State Department official. Please SHARE!"},{"comment_id":"10154031990961636","commenter_b":"Yusuf Saleh shut up","commenter_a":"It disturbs me that people have used the laughing response to this. Because domestic violence and child abuse (not to mention sheer ignorance and sexism) is just hilarious(!)","post_message":"He's on the run"},{"comment_id":"10152776744107217","commenter_b":"Vicki Wray better start thinking of other names 😂😂😂😂","commenter_a":"Beautiful names xxx","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"}]
