[{"comment_id":"10153465235771316","commenter_b":"I guess the woman in this pic is borderline retarded...","commenter_a":"They can store more farts too so that's good","post_message":"Women with larger behinds are healthier and more intelligent, study finds: @webpagelink"},{"comment_id":"10153659427149087","commenter_b":"@username Yeah, I've been to a few strip clubs in my life. Good looks though don't mean a girl can perform.","commenter_a":"It's the old emperor with no clothes on eyesight ... The schmuck can't see. He can't even see that his wife is a little hoish, not just the adulterous sex while he was married to his prior wife, but the many pictures like the one I've got in my downloads of a Melania Drumpf doing full frontal nudity, with a wet soapy body, wet hair, seductive pout, and a hand over her crotch doing the two finger simulated insertion. Ha, he can see everybody else and their blemishes .... and talk about them ad nauseum in the most insulting and revolting fashion, but he can't see his naked self .. nor, ha, his naked wife.","post_message":"\"Wow, Corey Lewandowski, my campaign manager and a very decent man, was just charged with assaulting a reporter,\" Donald J. Trump tweeted. \"Look at tapes-nothing there!\" WATCH THE VIDEO HERE:"},{"comment_id":"1076188252391484","commenter_b":"body slammed my ass this little cunt held on to the desk causing it to fall over with her nasty ass in it!!!! and now we'll have a litany about the evil whitey cop from some negro lawyer and welfare mama.","commenter_a":"Quick make a judgement before the facts come out.","post_message":"Student body-slammed by South Carolina officer"},{"comment_id":"10153660734489726","commenter_b":"what a mess she is!","commenter_a":"You mean murder!!!","post_message":"WATCH: Goldberg: Planned Parenthood Founded for Abortions"},{"comment_id":"10152911089911491","commenter_b":"There's already two women on the dollar coin","commenter_a":"So... doesnt it cost money to change the bill ? Im not paying for it. Are you Ms.Hillary Clinton ?","post_message":"Hillary Clinton: Harriet Tubman on the $20 bill would be \"awesome, well deserved — and about time.”"},{"comment_id":"10157350648655354","commenter_b":"Even if this woman is a prostitute...does that make it OK for the \"boy's club\"?????","commenter_a":"Wasn't that long ago if a girl did this it wasn't bragged about. It was an embarrassment to herself and family. I'm not that old and I think it's disgusting, and she should be cited for it.","post_message":"+++SHOCK+++ OAKLAND POLICE SEX SCANDAL WIDENS... WATCH:"},{"comment_id":"1128844340487134","commenter_b":"I believe in planned parenthood, but I believe it starts before you get pregnant, not after. Grab a couple condoms, take the pill or shot. Get your tubes tied. Life starts at the time of conception. Murder is murder, I don't care how old the person is.","commenter_a":"Can Hillary tell us on what date she considered Chelsea a human being?","post_message":"Sadly, true."}]
