[{"comment_id":"1298794080158825","commenter_b":"OK. Sacrifice your two daughters first....and we will all follow suit (he is a big asshole)","commenter_a":"Obama's a damn clown","post_message":"More evidence that this president believes in sacrificing military readiness on the altar of social engineering."},{"comment_id":"10152920092525736","commenter_b":"Because I dive in pussy. No fecal flakes on my","commenter_a":"Because they know what they're doing is wrong & disgusting.","post_message":"41% of transgender people try to kill themselves, compared with 4.6% of the general public, according to a study."},{"comment_id":"10154913988378701","commenter_b":"I would ban that woman from the store.","commenter_a":"What a fucken cunt!!!","post_message":"\"One of their female employees Jessie? Jennifer? J something is disgustingly obese, and each time we come in, although she does her job and is very polite, instantly makes my appetite disappear,\" the customer's Yelp review read in part."},{"comment_id":"10153167804586770","commenter_b":"What size cupp is she?","commenter_a":"can't be any worse than Obama.","post_message":"S.E. Cupp: \"I don't know how Trump's surrogates can sleep at night peddling this unconstitutional, un-conservative, and un-American garbage that is, frankly, from a guy that is never going to be president.\""},{"comment_id":"10154942733646873","commenter_b":"Sally Yates we need more of you. Well done.","commenter_a":"We have a dictator as presidentDon't agree with him ,you are fired","post_message":"Sally Yates had said the Justice Department would not defend in court Trump's immigration order."},{"comment_id":"10153306237383984","commenter_b":"It's about d**n time......quit dragging your feet and file the articles....make sure to include all his bogus names in the charges including the name Davis","commenter_a":"If it hasn't been done by now,it's not going to happen.He might be impeached, but to actually 'remove' him from office takes a seperate action,and that's the ultimate goal.But.........don't get your hopes up. Saying and doing....are seperate issues as well!","post_message":"Wow. This guy has a lot of guts to go after Obama in this way. Do you hope his plan to take down Obama is successful?"},{"comment_id":"10154034067333701","commenter_b":"Is that a dude in drag? Or a real girl","commenter_a":"It is a bad eyebrow day.","post_message":"Court documents showed Perry had at least 15 prior criminal convictions, including five felonies and driving violations, along with a felony warrant for ID theft, methamphetamine possession and providing false information to police."}]
