[{"comment_id":"10153352212341162","commenter_b":"So, Michael \"TheArtist\" Louis, what you're saying is- the young man in the meme isn't \"black\" enough for you? That only people who subscribe to the stereotypical depiction of how black people dress and behave are \"real\" black people? If that's not racist against African Americans, I don't know what is... Smh. And isn't the point of ending racism getting AWAY from stereotyping based on the color of a person's skin? The funny thing is, the meme maker -who is presumably black based on what the meme says- is *trying to* say that white people are racist, when in reality - they have such deeply rooted issues of their own that they didn't even realize their meme was racist against themselves. Start with yourself...","commenter_a":"Looks like she for sent home for having a black date nothing's wrong with her dress","post_message":"TOO REVEALING? A girl was sent home from prom because school officials thought her dress showed too much skin. What do you think?   PHOTOS: @webpagelink"},{"comment_id":"1048024048598660","commenter_b":"Disgusting.","commenter_a":"The blessings of new life. I think it's wonderful","post_message":"\"It looks like an alien\""},{"comment_id":"10153066092873445","commenter_b":"I bet the strippers were forced to strip and what not","commenter_a":"Okay... Retracting previous statement, these fucks need to be jailed... Illegal immigrants being forced into prostitution... Nope! Pigs","post_message":"More DEA Scandal!  DEA Agents Arrested for Lying About Owning a Strip Club"},{"comment_id":"10153074507087908","commenter_b":"Only Decent Republican President lol !!! @webpagelink","commenter_a":"Today, Ike would be a center-right Democrat.","post_message":""},{"comment_id":"10154145894181973","commenter_b":"I sure wish FB had an option to simply unlike a post.","commenter_a":"I have never been prouder to be an Oregonian. THANK YOU, protesters! WE ARE BETTER THAN DONALD TRUMP!!","post_message":"At least 200 protesters marched through downtown Portland and blocked lanes of Interstate 5 early Wednesday to voice their displeasure with Donald Trump's election as the 45th president of the United States."},{"comment_id":"10152805642283145","commenter_b":"Nope.","commenter_a":"@username te montas?","post_message":"The Orlando Eye attraction will be the tallest observation wheel on the east coast of the United States, and today the first passenger capsule was installed.   Will you ride the Orlando Eye? Check out photos of the progress >> @webpagelink #WFTVat5"},{"comment_id":"10153520082123132","commenter_b":"YES CANCEL, PLEEEEASE!! ONCE A CHILD MOLESTER ALWAYS A CHILD MOLESTER!!! CHILD MOLESTERS NEVER GET REHABILITATED!!! IT'S BEEN PROVEN!!!","commenter_a":"NO!!!","post_message":"Do you think TLC should cancel 19 Kids and Counting?"}]
