[{"comment_id":"1196992380374839","commenter_b":"Too bad all his accusers wernt nasty enough!!! .lmao...","commenter_a":"Not going to happen!","post_message":"We're in Raleigh, North Carolina where Elizabeth Warren is campaigning for Hillary Clinton. @webpagelink"},{"comment_id":"1089590774419709","commenter_b":"The most stupid people in America are and has been those always vote against their own economical interests. While the Democrat Party still was the people's party, all the aforementioned idiots were working class Republicans, but not anymore. Now the most disgusting idiots are Democrats whom supporting Queen of Monsanto, Hillary Clinton.","commenter_a":"Vote for the ONLY Candidate who stands up against Monsanto! Bernie Sanders!","post_message":"“If Monsanto gets its way, the American people will pay a high price for corporate greed and political corruption.”"},{"comment_id":"10153935292307434","commenter_b":"Shay shut the fuck up","commenter_a":"\"Transgendered\" sooooo 2013. BOOOORRRING No one cares. We get it, you're edgy. Zzzzzzzzz","post_message":"\"Trans women are not only sex objects or prostitutes,\" said Amiyah Scott, explaining her departure from the show."},{"comment_id":"10153891687451782","commenter_b":"And what of Betty Shelby??? When will they lock that monster up? When will her day come?","commenter_a":"It is not over he may not but I saw a tweet today by a new elect and NY police are ready for several charges including the spirit dinners were those poor children are molested and then killed!! It may take time but all of them will be charged! Trump will be too busy to do it but their day will come!!","post_message":"President-elect Donald Trump's aide is suggesting that he will not pursue a probe of Hillary Clinton private email server in an effort to help her ;  @webpagelink"},{"comment_id":"10153835209313380","commenter_b":"Outstanding. Congratulations.","commenter_a":"CONGRATULATIONS","post_message":"Today, I want to recognize Commander Zeita Merchant as she relieves Capt. Ryan Manning as Commanding Officer of Marine Safety Unit Chicago. Zeita is a native of Jackson, MS, and a Tougaloo College graduate. She will be the first African-American female commanding officer in history to command a Coast Guard marine safety unit and the first female officer to command Marine Safety Unit Chicago. Marine Safety Unit Chicago comprises 52 active duty, reserve and civilian personnel. Marine Safety Unit Chicago’s area of responsibility includes a fleet of 266 vessels, 118 regulated waterfront facilities, Lake Michigan shorelines of Illinois and Indiana, as well as 186 miles of the Illinois River System segmented by seven locks and more than 250 bridges. Congratulations Zeita! We know you will continue to make us proud. #MississippiMade #MississippiSupports #MyMS02 #BGTMS02 #FeelGoodFriday"},{"comment_id":"891235850923043","commenter_b":"She is such a disgusting, hateful, ugly hag!","commenter_a":"Democrats are ALREADY on record favoring abortion AFTER birth.","post_message":"Unreal.  So the Supreme Court's imposed policy of abortion-on-demand for the full nine months of pregnancy isn't enough for Hillary?   Enough is enough.  Sign the petition to defend unborn babies from radicals like Hillary! Click here! @webpagelink"},{"comment_id":"10153809354827169","commenter_b":"Let's make a new list and start it with Tamir Rice.","commenter_a":"White people in America don't have Race Hustlers disguised as Christian Reverends telling the young men that they can't win in life because they're a victim, nor have Whites exalted bards who glorify violence against sex objects that once were loved as women, violence to police, and street crime. In short, White people are starved for heroes, but Black people have chosen villains for their heroes, and feed their souls on poison. And what people of any age can rise above their heroes?","post_message":"Four out of 10 African-Americans said they doubt the nation will ever achieve racial equality, but as many white Americans believe racial equality has been achieved, according to a national study released by the Pew Research Center (From PBS NewsHour)"}]
