[{"comment_id":"10153533239272464","commenter_b":"Dream Team? Cruz/Fiorina Gowdy - AG Carson - Sec HHS West - SecDef Rubio - Sen Maj Leader Issa - House Maj Leader","commenter_a":"Protestant Christian liberty to be exact!","post_message":"We’re a nation that was founded on religious liberty.  Stand with us to defend it: @webpagelink"},{"comment_id":"797617833687933","commenter_b":"Angela is brainwashed to believe that she'll suffer in the afterlife if she doesn't believe in Jesus.","commenter_a":"there is no jesus....little ceaser maybe","post_message":""},{"comment_id":"1014349388612957","commenter_b":"931389766893258R931389766893258o931389766893258c931389766893258h931389766893258e931389766893258l931389766893258l931389766893258e931389766893258 931389766893258C931389766893258h931389766893258a931389766893258r931389766893258l931389766893258e931389766893258s931389766893258","commenter_a":"931389766893258C931389766893258a931389766893258r931389766893258l931389766893258e931389766893258t931389766893258t931389766893258a931389766893258 931389766893258S931389766893258t931389766893258e931389766893258w931389766893258a931389766893258r931389766893258t931389766893258 931389766893258y931389766893258o931389766893258 931389766893258c931389766893258o931389766893258m931389766893258e931389766893258 931389766893258l931389766893258o931389766893258o931389766893258k931389766893258 931389766893258a931389766893258t931389766893258 931389766893258t931389766893258h931389766893258i931389766893258s931389766893258 931389766893258b931389766893258s931389766893258","post_message":"Slavery Happened A Long Time Ago?  Scientist Are Now Saying the Trauma May Be Encoded In The Genes of Black People"},{"comment_id":"10153464024014087","commenter_b":"Nothing will convince me that illegals not being here would not mean more money in the pockets of people in my nation who are living in poverty today and because my fellow countrymen are the only thing important when it comes to my nation.....my political support will only be for candidates who will remove illegals from my nation as my Constitution requires","commenter_a":"If illegals were back outside our nation....jobs would be much easier to get for our citizens","post_message":"President Barack Obama's three-pronged plan includes wage insurance of up to $10,000 over two years, expanded unemployment insurance coverage and more opportunities for laid off workers to retrain and reenter the workforce. WATCH:"},{"comment_id":"10153220581496336","commenter_b":"And the rap sheet of those deceased are mind blowing. Sad to be in A profession where u care so much but the ones u protect care so little.","commenter_a":"A bad situation when police are persecuted for doing their jobs. The whole force should resign. I would.","post_message":"The booking photos of the six Baltimore police officers charged in the Freddie Gray case have been released."},{"comment_id":"10152686509170950","commenter_b":"Inbreds","commenter_a":"James Carville writes, \"There was nothing in the law that prohibited Secretary Clinton from using her personal email to conduct business as long as those emails were preserved, which they were. She preserved them and turned over all of them that had to do with State Department business -- 55,000 pages of them. But that's not enough for the right wing, who will continue to obsess over this issue until they find a new one. Let's watch the Clinton Rule in effect: Colin Powell and Jeb Bush also used their personal email, but they are held to a different standard in the press. Colin Powell admitted on ABC's This Week on Sunday that not only did he also use his personal email while secretary of state, but that he didn't preserve them or turn any of them over to the State Department as requested. Everyone went wild when they heard ...","post_message":"An archives expert tells \"Time\" that Hillary Rodham Clinton's methods for determining which emails to hand over to the government \"did not meet best practices.\""},{"comment_id":"1765015350452806","commenter_b":"This tells the whole story.","commenter_a":"Why can't people understand that the Clinton's are career politicians who amassed millions for themselves while being public servants and working in government? While working \"supposedly\" for we the people, they became millionaires. The same group of 1%s Hillary rallies against she is card carrying a member of.","post_message":"Don't let U.S. Senator Tim Kaine fool you -- the Clinton Foundation is a bastion of corruption."}]
