[{"comment_id":"10156239205725354","commenter_b":"Let America become a car and truck free nation! and make it against the law to have any types of butter knives, butcher knives, and no hatchets, swords or knives of any shape or form, no sharp spears or sticks of any kind, pointed objects, needles including knitting, or sewing needles and absolutly NO clubs or bats or rocks of any shape or kind!! No ropes or twine or chains or braided objects! If they break the law and have any of these weapons in posession they will be put in prison untill they rot! Now tell me how is the government going to house and feeed all these lawbreakers????????............................................?","commenter_a":"You guys have no frigin idea what your talking about.","post_message":"No word yet on when they will call for a car-free America..."},{"comment_id":"513918755467368","commenter_b":"Screw that fat ass bitch","commenter_a":"Her and the view should of been gone long ago","post_message":"Joy Behar took a turn attacking the mother of the Benghazi victim. #RNCINCLE"},{"comment_id":"10153720536124087","commenter_b":"@username I bet you're wife is a illegal ass immigrant. Get ready to never see her again once he wins","commenter_a":"Cool. Soon there will be no minorities left for trump to insult. He'll start insulting the lackof intelligence of his supporters.","post_message":"GOP front-runner Donald J. Trump recalls phoning his credit-card company to see if an Indian call center would answer."},{"comment_id":"540716409449985","commenter_b":"they screwed up their country, and all they want is to screw up the rest of the countries","commenter_a":"Hell No !","post_message":"COMING SOON in your city and town..."},{"comment_id":"10153807891284062","commenter_b":"He served our country well and is our Founding Father.","commenter_a":"Only one problem with having to be a dead president. Ben Franklin was never president.","post_message":"Which of these women would you like to see on the $20, if any?"},{"comment_id":"10153430470412217","commenter_b":"Oh no no no....this woman is only about herself. My America would be a disaster if this witch were to gain the presidency. She is a fake and a phoney. She lies more then she tells the truth. She thinks our rules don't apply to her. God helps us if she wins!","commenter_a":"Speaking as a Scotsman who likes the USA, I think Hillary is the best choice to be the next president","post_message":"The latest in the battle to be the Democratic presidential candidate."},{"comment_id":"10153662465839714","commenter_b":"Am I the only one who gets the joke?","commenter_a":"Mr trump, explain to me why something in the constitution is unconstitutional?","post_message":"Donald J. Trump continues to defend his controversial immigration plan."}]
