[{"comment_id":"10153507506919877","commenter_b":"Wendy get a life","commenter_a":"People always get offended when you say that you love dark skinned women. For some reason we have been deemed as \"too masculine\" or \"dirty looking\" or \"just unattractive\" because some how all dark skinned women everywhere are all unattractive *insert eye roll here*. We don't have the standard European features so when people say they love us they get offended and say \"well what about the rest of us?!\". No one said that he wouldn't date other races but he loves dark skinned women. Good for him because we are some beautiful women indeed!","post_message":"Mack Wilds Professes his Love for Dark-Skinned Women...and Wendy Williams Gets...Offended? Watch the clip below. Grio fam, what do you think of the young actor's remarks?"},{"comment_id":"746525202204724","commenter_b":"how stupid is she in the first place.","commenter_a":"Yes","post_message":"Clinton's Panic After Mistress Does THIS In Public [VIDEO] They never ever wanted this to happen. Do you think Hillary will lose?"},{"comment_id":"542901459225067","commenter_b":"Go Hillary !","commenter_a":"She is honest and I am tired of people accusing her of everything when she has been for the USA since Clinton was President and after that, etc. She loves her country and will be an excellent President. Grow up world!","post_message":"The people of Iowa versus pollsters and pundits. The people win."},{"comment_id":"10153563127821680","commenter_b":"Gotta love how she tries to spin this. No other SOS ever had a orivate, unsecured server in their house. Morning Joe shows her lie repeatedly. @webpagelink She needs to drop out. Even Politifact.com found her statement to be a lie. @webpagelink/ #NeverHillary #BernieOrBust","commenter_a":"I lied and I'm going to lie some more.. Hillary2016","post_message":"\"There may be reports that come out, but nothing has changed,\" Hillary Clinton said. \"It's the same story.\" Read more: politi.co/1P0pUQK"},{"comment_id":"1678604362359824","commenter_b":"@username how about i fuck your wife?","commenter_a":"Ah yes, Israel defending themselves against the crazed islamists wanting to destroy the country and kill all the jews. This page is turning into a progressive shitehole full of regressive thinking. NASTY.","post_message":"Literally the biggest assholes on the planet."},{"comment_id":"1187509331305594","commenter_b":"She's losing Florida.","commenter_a":"She's losing in national polls !!! Americans don't trust her!!!","post_message":"Let’s think better of each other, and hold together in the face of our challenges—not turn on each other or tear each other down."},{"comment_id":"468040403386540","commenter_b":"They need to leave America!!!","commenter_a":"No, do we get ours? Did any of our relatives from the past get their's","post_message":"Should The US Allow Muslims To Have Their Own Areas? Comment 'yes' or 'no'."}]
