[{"comment_id":"10155300892045354","commenter_b":"Pompous ass!!!","commenter_a":"the blank is \"Delta Sierra\"","post_message":"Watch this incredible video and then fill in the blank: \"John Kerry is a _________.\""},{"comment_id":"1795597093801212","commenter_b":"But Hillary won the popular vote..at least you won something","commenter_a":"Hopefully they get deported","post_message":"BREAKING: A massive protest of President-Elect Donald Trump is happening in downtown Chicago. It started outside the Trump Tower and is growing @webpagelink"},{"comment_id":"1513798078640217","commenter_b":"@username Prove that lady!!!!!!","commenter_a":"Obama has publicly said he was born in Kenya so has his tranny wife.... What more do you need ?","post_message":"Donald J. Trump \"has really started his political activity based on this racist lie,\" Hillary Clinton said."},{"comment_id":"10153068105811316","commenter_b":"That had to have been written by a 12 year old republican. Lol.","commenter_a":"hes telling the truth most dont want to hear","post_message":"Rapper: Caitlyn Jenner & MSM Promotion of Poor Values A Rebuke To God - @webpagelink"},{"comment_id":"1109934812394016","commenter_b":"ah so cute. huma and hillary both have repeatedly philandering husbands.","commenter_a":"when your wife's in bed with the democratic presidential candidate and your home watching the children you have to do something ?????","post_message":"ANTHONY WEINER CAUGHT AGAIN: Sends Kinky Shot To Brunette With 4-Year Old Son Next To Him Get out the eye bleach..."},{"comment_id":"690460261111351","commenter_b":"spelling lady...... come on now.","commenter_a":"I think I will get off here and work. Better than listening to his lioes","post_message":"Watch LIVE as President Obama speaks at a town hall at Fort Lee. Do you know someone taking part in the event?"},{"comment_id":"968043416588740","commenter_b":"I don't think the majority of people in England would believe any of this rubbish any more than you or I","commenter_a":"The danger of this kind of journalism is the Anti Scottish fervour that it builds up in England. English nationalism is not the civic nationalism that we are trying to achieve in Scotland. The feathers of the establishment have been rattled by,first the referendum, and then the GE. The audacity as the Mail sees it is for Scotland to be ungrateful subsidy junkies who have sent 56 SNP MPs to Westminster to represent their constituents. To carry on this vilification that Cameron promoted during the GE campaign, only months after love bombing Scotland, is to let a Genie out of a bottle that won't go back in. The union could and should end in an agreement between too friendly nations who share an island by the voting power of the people of Scotland, and not by this ever increasing acrimony fostered by the English press. It's a dangerous and unprincipled ...","post_message":"Did the Scottish National Party (SNP) hound Charles Kennedy to his death?"}]
