[{"comment_id":"10154090778463822","commenter_b":"@username Ummmm So your a priest and admitting being a child molester? Sound like a real POS...Find someone of legal age","commenter_a":"Penn State fans must be proud to cheer for a POS coach that condoned child molestation and rape. \"We Are....Child Molesters\"","post_message":"As soon as Paterno’s familiar image – shirt and tie, thick glasses and rolled-up pants – appeared,fans erupted and kept cheering...  GAME RECAP: @webpagelink"},{"comment_id":"10153480074973352","commenter_b":"She need the death penalty","commenter_a":"PROTECTED CUSTODY CAUSE YOUR ASS IS GRASSED BABY KILLER .","post_message":"Mother who drugged her two-year-old daughter and suffocated her because she was worried her ex's new girlfriends would take her place is jailed for 37 years"},{"comment_id":"10153026446831336","commenter_b":"I know makes me wanna puke.. she'll finish off destroying what Obama didn't...","commenter_a":"The United States part , we supply job applications to ISIS fighters","post_message":"Iraqi forces backed by Shiite and Sunni fighters have begun an offensive to recapture the northern town of Tikrit from ISIS militants, state TV reported."},{"comment_id":"10153435939769087","commenter_b":"@username Sorry you feel that way. She'll cheat and lie to you also.","commenter_a":"Who cares anymore what Bill Clinton has to say? He has no influence anymore. Why doesn't Bill & Hillary Clinton follow the law? why are they exempt from following the law?","post_message":"\"It's important that we not be chumps when we decide what security provisions should be employed to check people's background,\" former President Bill Clinton said. \"America is a place that welcomes all people who are willing to treat people the way they want to be treated, willing to follow the law, willing to create a common community.\""},{"comment_id":"10155343627345389","commenter_b":"She is to old to run for President. She is a liar and a cheaters.The women is another socialist like Obama. She need to go away for good.I'am sick of the Clinton and Bushes.","commenter_a":"She is a felon","post_message":"JUST IN: House panel subpoenas former Secretary of State Hillary Clinton's personal emails in Benghazi probe.  Question of the Day: Will the growing list of scandals hurt Clinton if she runs for president?"},{"comment_id":"1165649100139095","commenter_b":"All he's ever done is ramble on. His supporters are just too stupid to realize it.","commenter_a":"I'm still waiting for Obama to answer the 2nd part of his question, which was, \"Why won't you light up the White House in blue\"? He just rambled on for about 5 minutes and completely dismissed the question.","post_message":"\"I'm not happy.\""},{"comment_id":"882724591787290","commenter_b":"Battered but still a warrior, great courage.","commenter_a":"This kid needed a gun and a CCL. So as to defend himself!....oh wait he lives in Newtongrange, Midlothian. Is that in....the UK? They not allowed to defend themselves with lethal force, from Thugs! Thanks to people that think like Piers Morgan.","post_message":"Left for dead with a battered face and multiple fractures by man he stopped to help"}]
