[{"comment_id":"10153058403318984","commenter_b":"Americans should shoot and kill all radical invading muslims on sight.","commenter_a":"Stop by my place I will make you a BLT with extra bacon","post_message":"Mind blown. One of the world’s biggest schoolbook publishers just ‘banned’ this to avoid offending people... There is no way they can be serious!  Do you agree that we have got to get a grip on all this nonsensical political correctness?"},{"comment_id":"934086226709659","commenter_b":"Put more women in your cabinet!","commenter_a":"I AM MY SISTERS VOICE VOTE DEM :::::::::::REVELATION 21 = THE TWO ARE ONE = TWO TRUMP AND WALKERIGHT ONLYESATANACYES <DID 911 SATANACYESEENTHREE THE FATHER THE SON THE HOLYESPIRIT <<< THEY DID IT NY INDYESHUALLHEARTRUTHEART:::::KY DC = DOVESON CHRIST < TRUE IN THE FLEASH CAME ON THE 3RDAYESON ROCKING < THE TRUTH USABLE <++++}:::::::::::::::::::::::::::::::>ART<:::::::::::::::::::::::::::::::{+++>:<>","post_message":"Born five years before most women could vote in America, Shirley has lived through the Great Depression, two world wars, the Civil Rights Movement, and the moon landing. Today, she’s rooting for something she never thought she’d live to see: the first woman president of the United States."},{"comment_id":"10153391185232217","commenter_b":"Lol. First...there are,a lot of people that doesn't know who she is. I personally have seen some of her exploits, but wouldn't recognize her voice. And second most that do follow her 'music' doesn't care what she does. Nobody gets mad at strippers. Nobody expects her to be smart...just dress in as few clothes as is legal and shake that azz. And lastly...the demographic that was knowledgeable enough to be outraged...went to work.","commenter_a":"Silly racist white people!!!","post_message":"They really weren't happy about Beyoncé's Super Bowl performance, calling it 'racism'."},{"comment_id":"10155458466225354","commenter_b":"Just a bunch of average women.","commenter_a":"I still cannot wrap my head around the positive reinforcement people give instead of being honest and constructive. Don't take her to dinner, take her to the gym.","post_message":"'They’re no angels—and they own it'"},{"comment_id":"1003724273013669","commenter_b":"This woman is dumber than a box of rocks!","commenter_a":"freaking nut case!","post_message":"Dems know where to get their votes..."},{"comment_id":"1110020542374518","commenter_b":"She makes me sick to my stomach. What a hypocritical arrogant witch.","commenter_a":"What me worry, the election is in the bag, my lemmings will vote for me regardless of what I do........","post_message":"Hillary Clinton is quickly running out of ways to make herself appealing to voters on the left increasingly turned off by her political corruption and ties to corporate cronyism. Grasping for something to counter her weaknesses, Clinton has decided to patronize black voters with talking points attacking “white privilege.” @webpagelink"},{"comment_id":"1548781162079004","commenter_b":"Found the stupid feminist.","commenter_a":"if U want to End ALL Abortions, eliminate the NEED for abortions!! STOP RAPE First!!!","post_message":"Flip the Script is back!  We asked pro-lifers why they think abortion is murder  and then they sorta threatened to kill us."}]
