[{"comment_id":"962481017216016","commenter_b":"@username I do not believe God condoned offering children to the fire as is abortion. the dogs ate jezebel. hillery was lucky, so far.","commenter_a":"YOU can't be a christian and vote for Hillary but it is all over, Hillary lost.","post_message":"Apostate “Pastor” Tony Campolo says Christians Should Vote for Hillary @webpagelink"},{"comment_id":"10154233578003352","commenter_b":"Right! Stupid lady. No man is worth that.","commenter_a":"Here we go again....... The Childs mother is dead, the side chick is going to Jail and the Man is sleeping with a New Woman TONIGHT. IJS.","post_message":"Woman Allegedly Murdered Boyfriend’s Baby Mother Because He Got Her A Valentine's Gift!"},{"comment_id":"1809165166033201","commenter_b":"You want healthcare get a job why should we pay for others","commenter_a":"You just say it and think it us true???? Lies!!!","post_message":"President Barack Obama holds news conference at The White House ahead of overseas trip. @webpagelink"},{"comment_id":"1084079061644582","commenter_b":"Isn't she too powerful to jail?","commenter_a":"Says the rich woman","post_message":"\"Wall Street can never be allowed to threaten Main Street again, no bank can be too big to fail, no executive too powerful to jail,\" says Hillary Clinton during Nevada victory speech. @webpagelink"},{"comment_id":"1758718481082543","commenter_b":"Illegal aliens should not be allowed to have drivers licenses. They should not be allowed to vote, should not get Social Security which they did not work for, should not get food stamps, welfare or any other type of financial assistance. If one of us went to their country, would be get financial assistance? No way! So why should they expect it here in the US, when we have seniors, veterans, children, homeless in need!","commenter_a":"More than WRONG !!!!!","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"},{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation. It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation. Read the whole story at Reverb Press HERE: @webpagelink"},{"comment_id":"1504505429602215","commenter_b":"Screw Obama and the muslim horse he rode in on.","commenter_a":"first time i,ve seen odummer with his head out of his obummer.","post_message":"The first marine national monument..."}]
