[{"comment_id":"10156809440295725","commenter_b":"Time to get tough with these vermin muzzies. We need to kill them before they kill us. Wake up, America, this is not CandyLand anymore.","commenter_a":"It is time! We have been too relaxed on this matter for too long. It is not that we do not love and welcome diversity and other nationalities and cultures into the amazing USA; however, we must have order and we must have processes in place to be proactive rather than reactive about our safety. We must take care of the people in our country first and then use the wealth that those resources will bring to help others throughout. My mother always said, if you cannot take care of yourself first, you cannot take care of anyone else and that simple advice applies here greatly.","post_message":"As president- I would be very, very tough on the borders, and I would NOT be allowing certain people to come into this country without absolute perfect documentation!"},{"comment_id":"10153504938416336","commenter_b":"This woman, is what evil looks like. They all must be shut down!!!!!!!!!!!!!!!!!!!!","commenter_a":"Wonder what she would do with video of Charlie boy's gang inside the Tate house? Give them medals? #FreeCharlie!","post_message":"Calif. AG Kamala Harris will use her office’s authority to regulate charity organizations to see if the organization that made the videos violated registration or reporting requirements, or broke any other rules."},{"comment_id":"1630541213899658","commenter_b":"I TOTALLY AGREE..........ILLMINATE THEM AS SOON AS POSSIBLE..OR they will do it to YOU first!!!!!!!!!!!!! They DO NOT NEED to be here in the US of A but ONLY TO KILL MORE Americans.shoot first ask questions later.","commenter_a":"Dang, I need to get out of this hell hole state of celebrity librals and move to Texas where leaders are more concerned with the safety of our nation and not the designer dress to wear to the next award party.","post_message":"Get em' Sheriff... This is why you don't mess with Texas."},{"comment_id":"766553903477790","commenter_b":"Obama will call it workplace problems.","commenter_a":"It's not ISIS committing these violent crimes it's the guns, we have to start a war against guns!!!!!","post_message":"Oh my God.....BREAKING NEWS. Share it folks. We need you."},{"comment_id":"10153892633433812","commenter_b":"STFU","commenter_a":"Sex is meant for procreation. If you don't want kids the only sure way is to not have sex. Birth control, even when packaged correctly is not 100% I have had multiple friends become pregnant while properly using birth control. Stupidest reason to sue ever.","post_message":"More than 100 women are suing Qualitest Pharmaceuticals after they say they got pregnant while taking incorrectly packaged birth control pills."},{"comment_id":"1708950036028896","commenter_b":"@username I have a problem with Mexicans coming back even after the wall is built. What they did to this country is almost irreparable damage, it's overwhelming, and the amount of people they killed is staggering. You NEVER read about an American killing a Mexican. But you do read the opposite. You can't take the illegal out of an illegal. They will always be a dark cloud of problems to any society they get it. They can't change, they're programmed that way. They will bring virus' disease and plunder. Even the ones running their country a derelicts of the 3rd kind, their intent is to make America part of Mexico, that's why they send them, that's why they don't assimilate and want YOU- (Americans to assimilate) ...(google \"The RECONQUISTA / Mexicans say they will take America without firing a single shot\")..this is why Vinente Fox and Jorge Ramos are trying ...","commenter_a":"The role of our government is to keep its citizens safe.....sadly they are failing \"A house with no walls will collapse\"","post_message":"“This is something that’s happening almost on a daily basis now, that we have illegal immigrant criminals that are committing murder or rape or numerous child predator type actions.” – Steve Ronnebeck"},{"comment_id":"10152778500617093","commenter_b":"@username lol! I saw this earlier. Had me crackin up. She was playin NO games with him","commenter_a":"He may not see it now but when he gets older, he will thank her. God bless them.","post_message":"Mom finds her son in the middle of the Baltimore riots... many are calling her Mom of the Year for what she does next. @webpagelink"}]
