[{"comment_id":"10156788909185354","commenter_b":"She's a dick!","commenter_a":"A good start. Now take back the universities, colleges and America from these thugs!","post_message":"BOOM."},{"comment_id":"10153721033369575","commenter_b":"Karen Crowder what the hell does immigrants have to do with it?!","commenter_a":"What's low gas prices have to do with bed bug's? Are they in the gas?","post_message":""},{"comment_id":"1130006897113975","commenter_b":"Get out of America then","commenter_a":"It is a sad day in America. One of the most disgusting men in in our country won the election. I am so sickened by the citizens who would cast their vote for such an evil man. Do they really feel he is person to speak for us as a nation. I find him so repulsive by his words and actions.","post_message":"THESE 23 HOLLYWOOD IDIOTS PROMISED TO MOVE IF TRUMP WINS..... LET'S HOLD THEM TO IT"},{"comment_id":"10153228594071615","commenter_b":"Does it involve SPIDERsSsssssss????","commenter_a":"What doctor would even do this?","post_message":"Are you afraid of spiders? If so, there might be hope for you..."},{"comment_id":"10153667125634087","commenter_b":"@username its like talking to children that can't do math.","commenter_a":"Nate Silver has moved Sanders to winning this primary with a close to 60% chance . Mind you, just DAYS ago he had Hillary with an 80% chance of winning. The wider the margin the merrier. The small Wyoming caucus is next. And Hillary's lead in the April 19th NY primary is down from 30 to 40 point lead down to 12 in the latest poll","post_message":"#BREAKING: Another poll shows Bernie Sanders slightly ahead of Hillary Clinton in the all-important Wisconsin primary"},{"comment_id":"10153356332992169","commenter_b":"Going to watch all the seasons leading up to it. I'm so excited, but already sad it's the last season.","commenter_a":"I CAN'T WAIT!!!!!","post_message":"NEW Downton Abbey video: Seeing is believing! The Final Season premieres Sunday, January 3 at 9/8c on MASTERPIECE | PBS (Masterpiece Theatre)."},{"comment_id":"10153699957431336","commenter_b":"Muslims need to stay in the Middle East. Or hell. Same thing.","commenter_a":"The Tsarnaev brothers were \"refugees\". Don't forget that.","post_message":"Secretary of State John Kerry says the U.S. will accept 85,000 refugees from around the world next year, up from 70,000, and the number will rise to 100,000 in 2017."}]
