[{"comment_id":"10153005003572377","commenter_b":"Obama in the Alaskan wilderness? Ha, Grylls will be smothered by the Obama entourage!","commenter_a":"Guess I won't be watching that show any more unless. .......Obama doesn't make it!","post_message":"President Obama will soon be running wild Bear Grylls in the Alaskan wilderness."},{"comment_id":"10153480904281162","commenter_b":"I just would like to know, how much money has she spent in tanning salons...","commenter_a":"i've been black since I was 5 yrs. old. look at my pic.","post_message":"BREAKING: Did Rachel Dolezal lie about her race? Dolezal, the woman at the center of the race controversy, has resigned as the president of the Spokane NAACP @webpagelink"},{"comment_id":"10153231132726336","commenter_b":"they should leave and not allowed back","commenter_a":"Look all black","post_message":"'If you don't like what that flag stands for... leave!'  On 'Fox & Friends,' Medal of Honor recipient Dakota Meyer called for a social media campaign to counter a movement encouraging Americans to stomp on the flag."},{"comment_id":"924673837566701","commenter_b":"I meant divided we fall","commenter_a":"At least learn how to spell 'Missile' Then you can be an educated bigot!","post_message":"I have joined with a bipartisan group of 16 senators to introduce legislation that would impose economic pressure on Iran if international negotiations do not yield a final nuclear deal by June 30, 2015. This is the most important foreign policy issue facing our country. A nuclear Iran will threaten the security and safety of the United States and send a message of weakness to our allies and partners in the Middle East. This legislation is an important signal to Iran and the entire international community that the current negotiations are not endless and the Iranians cannot continue their dangerous nuclear activities."},{"comment_id":"10153906452296409","commenter_b":"Hahahah This is all she has. Anger lies and name calling. She would make a horrible leader. Sorry it wasn't a poll. This is the article. Trump lies more than Hillary. So what. He still will not be the next President I can't wait for you to make America Great/Safe again!! These attacks have to stop taking the lives of innocent Americans. We need a Leader that will call the enemy by name! Trump2016!!! Is there an actual plan as to where all this extra revenue will go towards? Will our personal taxes and property taxes go down? I am a deplorable TRUMPAZEE and love every moment of it. ANOTHER NO pic, NO history and NO friends TROLL - F/B is being flooded with these locally and from FOREIGN countries And why would he? He has made it this far and hasn't released them yet? It's an unnecessary risk to ...","commenter_a":"Are they crazy? Trump has had same platform and mantra since day 1. Hes not the one who bleached his servers and beat them with a hammer AFTER being subpoenaed. That was hillary","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"992749454106935","commenter_b":"Truth be told and Trump will get to it publically soon: we're at war with Mexico. Take back southern AZ from the drug cartels. Put the military and night vision drones on the border along with the wall. No way will I go there either. And right on look at labels and BUY AMERICAN!","commenter_a":"Go Trump. Excellent rally. Gotta love truth and intelligence.","post_message":"Donald J. Trump spoke to thousands who braved the heat at a rally in Fountain Hills today. If you missed the event, you can watch it here: @webpagelink"},{"comment_id":"1017002171709344","commenter_b":"I would feel equally disgusted voting for either one.","commenter_a":"That's a Question ?","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B?"}]
