[{"comment_id":"1746481058744968","commenter_b":"Get out of here","commenter_a":"Traduction: Our thoughts are with the people of ISIS","post_message":"Our thoughts are with the people of Aleppo"},{"comment_id":"10153617966566051","commenter_b":"Becky Jensen sorry but you are a dumb bitch","commenter_a":"Thank God","post_message":"The man noticed that a woman was crying next to him in line. When he asked her daughter what was wrong, he knew he had to take immediate action."},{"comment_id":"967270790032642","commenter_b":"You plutocratic blithering batch of flabbergasted infidels have the combined iq of less than one dead skin cell from the shmuck of @username's majestic penis post-circumcision and he in his infinite wisdom has confirmed that over 50% of all American penises have regressed so far due to their sheeple tendencies that they are considered vaginas by anatomists everywhere","commenter_a":"According to experts in the field of computer science the most logical, and therefore most correct, outcome would be for us to all vote Republican in the next election, the obvious pattern must be continued. Humans are not capable of conscious thought (especially not Americans) and must therefore follow trends like the herd animals they are.","post_message":"The jobs numbers say it ALL.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153929324394586","commenter_b":"WAIT WHY DID HE KILL IT ANYWAY WAS IT HIS TO BEGIN WITH IS HE IN JAIL HE NEEDS TO BE FOR ANIMAL ABUSE HAS The Dodo HEARD ABOUT THIS?!? I CANT BELIEVE SUCH AN INNOCENT CREATURE WOULD BE HURT LIKE THIS HUMANS ARE SUCH IDIOTS HE/SHE NEEDS TO BE LOCKED UP IM JUST SO MAD","commenter_a":"Where is the proof that this specific coyote was killed for the fur? I've witnessed coyotes stalking my dogs while they're in the back yard, and I can't have barn cats because the coyotes kill them. The coyotes get closer and closer to my house every chance they get. I'm all for nature taking its course, but you can guarantee I'm going to protect my pets' lives over the life of a coyote. How do you know this coyote didn't just attack a farmers chickens or livestock? How are you so sure this guy executed this specific coyote for the sake of its fur? I don't think you are. Posting graphic videos for awareness is one thing, but posting a graphic video with the wrong facts is nothing but propaganda.","post_message":"WARNING: EXTREMELY HARD TO WATCH.   Coyotes bark just like dogs when they're scared. Even the coyotes killed for fur trim.   CC: Canada Goose   [via Robert Banks]"},{"comment_id":"10153272091283271","commenter_b":"lol. And the elephants will inherit the earth and as the most intelligent animal.","commenter_a":"This is why the aliens won't talk to us","post_message":"Kentucky clerk Kim Davis is free as of Tuesday. Former Arkansas Gov. Mike Huckabee stood alongside Davis outside the jail, calling her \"incredibly brave.\" Hear her words in the video. What's next for her career? ---> @webpagelink"},{"comment_id":"928001893961910","commenter_b":"Thank you Rubio for all your hard work. God bless you and your family.","commenter_a":"NO RUBIO ND NO CRUZ.","post_message":"Marco Rubio is a friend and a colleague who ran an optimistic campaign focused on the future of our party, conservative principles, and uplifting the American people. The Republican primary was stronger because of the ideas he brought forth.   Marco’s story embodies the promise of our great nation. I know he will continue to be a champion for limitless opportunity in America, and I wish Marco, Jeanette, and their four kids the very best."},{"comment_id":"10153921224283132","commenter_b":"They tend to get bigger when you are pregnant","commenter_a":"Are her tits hanging out far enough?","post_message":"Kim Kardashian West and her family are rallying around Lamar Odom."}]
