[{"comment_id":"10153758962823445","commenter_b":"Trump wants to build a 30 trillion dollar wall. I'm guessing you thought that would be free....","commenter_a":"Everything should be free or according to Bernie. Typical politician lying out his ass just so he can get more young people votes. He needs to go back to the old folks home and have his depends changed He's so full of shit.","post_message":"Bernie Sanders: \"Pot Should Not Be a Federal Crime.\""},{"comment_id":"1340551885984265","commenter_b":"Your a believer if you believe what you said, people been saying that crap every election. I know you don't like either nobody does but someone is going to win Who would you rather","commenter_a":"@username I know you won't but watch this....","post_message":"TOTALLY VIRAL --- HOW TRUMP WINS (VIDEO) @webpagelink"},{"comment_id":"10154271893261336","commenter_b":"He should deport the freeloaders and criminals. There are a lot of nice people out there who want to work and be a part of America","commenter_a":"Trump just told CNN he is for a raise to the minimum wage. I am waiting for Trump to say he will not deport the 11 Million undocumented immigrants he promised his rightwing base. Look for that next week.","post_message":"After emerging as the presumptive GOP nominee following a major victory in Indiana, Donald J. Trump is responding to questions about whether he'd choose John Kasich as his running mate. Don't miss Trump tonight on \"The O'Reilly Factor\" starting at 8p ET."},{"comment_id":"1183772531660175","commenter_b":"However, he will be a much better President for the nation then fumbling Obama. Rather have competent than classy.","commenter_a":"I agree","post_message":"AMEN."},{"comment_id":"1170909956275538","commenter_b":"This women is a trashy slut","commenter_a":"So I guess there is no point here. Don't waste my time.","post_message":"\"Look, people are only voting for Donald Trump, most of his supporters are only voting for him because he’s a white guy. And frankly, if he were a woman, or if he were, I don’t know, let’s pick, Latino, Muslim, any of the groups that he’s stoked hatred amongst his supporters, if he were any of those, I don’t think he’d be getting support either.\""},{"comment_id":"10153951989588701","commenter_b":"Is not like police had other things to do","commenter_a":"Seriously a 38 year old man. Grow up","post_message":"The Camas Police Department said every available officer responded to the scene and canvassed the neighborhood looking for a suspect that didn't even exist."},{"comment_id":"10154594345964749","commenter_b":"@username leave arab countries ask you governments to stop killing people there . and the immigrants will go back","commenter_a":"I think the comment has to be taken into context... Looking at Hungary's demographics, Muslims don't even account for 0.1% of the population. The politician is probably representative of the general public mood there. Although in a more colourful tone!","post_message":"The Hungarian politician was described as “a sad old man full of hate” and his comment was branded as “disgusting”."}]
