[{"comment_id":"1814664762098886","commenter_b":"But you sure don't mind taking white people's money do you Colin?","commenter_a":"Then have him sit on the locker room bench and not the field","post_message":"NFL player Colin Kaepernick isn't apologizing for his controversial decision to not stand during the national anthem."},{"comment_id":"10153875456235329","commenter_b":"Dear women, stop giving us all of your stuff to put in our pockets","commenter_a":"YES! Matt","post_message":"This is not a drill."},{"comment_id":"10153678136737217","commenter_b":"You are falling into the hands of the extreme right wing portraying themselves as, \"for the working class.\"","commenter_a":"Voting out because the EU is corrupt. This country full and we should trade with the world. And I don't wont to be under a dictatorship . If it was not for the dedication of the doctors and nurses the NHS cant cope with demand .schools need a teacher. And two teaching assistants .not enough. Housing. And foreign criminals cant besent back","post_message":"What does Brexit mean? And who will be able to vote? Nine days before #EUref, here's a guide about some of the key questions."},{"comment_id":"10153750734644369","commenter_b":"Ya, and you will go after corrupt windbags in D.C next? It looks good on paper, but it wont happen. There are laws in place that wont allow this to happen. Take the LLC for example, go after the company but cant get the person. But then again, when did laws ever apply to this administration.","commenter_a":"They need a home now!!","post_message":"It is a \"significant scaling up\" of the U.S. commitment to accept refugees from Syria."},{"comment_id":"1113947365314026","commenter_b":"@username you piss with the men, but u have no balls,bitch","commenter_a":"PRETTY SOON IT WILL BE A JOY TO VISIT NORTH CAROLINA","post_message":"North Carolina: Land of Fewer and Fewer Progressive Wingnuts by the Day!"},{"comment_id":"1025021754204963","commenter_b":"Will make the perverted staff , horny ?","commenter_a":"Give gun control without rules. Makes a lot of sense. Not. But tell a little girl she can't feel pretty. :(","post_message":"A father bought an adorable dress for his adorable little 5-year-old girl but her school forced her to wear a t-shirt and a pair of jeans because her shoulders were showing and Texas school officials couldn't handle it."},{"comment_id":"10153377124609705","commenter_b":"Women's restrooms are nastier than the men's.","commenter_a":"i don't have any issues with trans-friendly bathrooms. But unisex? Have you tried those? they're never clean!","post_message":"This intimate act is now a battleground for transgender acceptance."}]
