[{"comment_id":"10153408065894087","commenter_b":"Think all of you are missing the point. Women does it , Throw the book at her !!!!!!! Guy does it , oh yeah no problem .","commenter_a":"All these criminals need to go down, Hillary included","post_message":"Congressional Republicans are largely brushing off the news Defense Secretary Ash Carter used his personal email to conduct business at the Pentagon, in stark contrast to the scrutiny that has fallen on Hillary Clinton."},{"comment_id":"10154403030526523","commenter_b":"@username your a pussy.","commenter_a":"TRUMP IS A FLAMING HOMO","post_message":"President-elect Donald Trump responds to a new poll from CNN/ORC which found that he has an approval rating of just 40% ahead of his Friday inauguration. @webpagelink"},{"comment_id":"1727638077485478","commenter_b":"Theyre cool. But they claw into you. Very clingy animals","commenter_a":"@username this is why i wana go Australia - want one asa pet lets get one","post_message":"Koala joey plays in baby basket. Via Symbio Wildlife Park"},{"comment_id":"999515513474836","commenter_b":"No shit ..told u that a while ago......u stubborn Dominican","commenter_a":"Especially after what happened in France.... I usually dont say much but liberal democrats can go scratch... ...its gonna happen here soon.......","post_message":"Watch: Pres. Obama calls out Republicans for pretending the Bush Recession was the \"golden era\" and refusing to give him credit for fixing their mess."},{"comment_id":"10154459591051320","commenter_b":"A Man hungry woman will sale their children's soul to keep a man at whatever price...Sad to say ...but true.","commenter_a":"I don't get how the mother didn't know. I'm sure this poor little girl had to be showing signs of withdrawing from people, especially him. She had to be acting different. Jesus this was going on for 5 years under this woman's nose. It's so sad that this child had no one to go to and kept this secret up to this point. I pray they don't let her have this baby. And for all you right to lifers, I'm sorry, this is a 13 year old child who shouldn't be expected to keep a baby resulting from a rape, when she's a baby herself. I pray that she doesn't have severe emotional scarring and other issues. Poor child... Smh. As for the POS, I hope they split him in half in prison and he bleeds to death.","post_message":"Disgusting: Police say Mark Sutton had been raping his girlfriend's daughter since she was 8-years-old. The mother found out when she took her 13-year-old daughter to the hospital and discovered she was four months pregnant."},{"comment_id":"10153942859244024","commenter_b":"Let's ban YOU !","commenter_a":"Disgraceful","post_message":"He supposedly got \"PTSD\" from shooting an AR-15 and now wants to ban \"God Bless America\" from baseball games. @webpagelink"},{"comment_id":"10154231947457411","commenter_b":"You would think they would have heard all the bee's buzzing around up in the attic long before it got to this point. DUH.","commenter_a":"This is common wasps or bees or Lizards I have seen a lot but not this much","post_message":"A Texas homeowner found herself in a sticky situation after calling for help with what she thought was going to be a simple roof repair."}]
