[{"comment_id":"10153198594904342","commenter_b":"Really!!! Fix the F***** System. And make her suffer for what she did. Why let her out?","commenter_a":"If that's the case, then let her go 3 or 4 days w/o food. Just give her nothing but Water, and/Gatorade/Powerade. The Human Body can go 3 or 4 days without food; just not Liquids. The Human Body, can run off it's Reserves, If We have Excess weight, don't worry. You'll only feel hungry for a little while, then whenever Our Body's stop growling; that means, that your Body will start Eating off it's reserves.","post_message":"A story working on for Eyewitness News today -- a Houston mother is facing multiple charges on allegations of child abuse.  Investigators say her son  'like a prisoner of war who had been starved.'   @webpagelink"},{"comment_id":"826951857397870","commenter_b":"Don't listen to all the crap! Half of it has been proven a lie and who knows about the rest? What kind of woman has these accomplishments? Surely not the ones they're talking about! @webpagelink","commenter_a":"too much baggage for me","post_message":"You know what to do!  Thanks to Liberal And Proud Of It."},{"comment_id":"10153428206108984","commenter_b":"She needs prison time!","commenter_a":"As far away as possible","post_message":"Looks like this is coming back to haunt her...  Do you think Hillary Clinton needs to stay far away from the White House?"},{"comment_id":"1675805602436783","commenter_b":"Wicked prick!","commenter_a":"That is what happens when you try to work 'across the aisle' with a group of people that have no desire to work with you.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1320166798020657","commenter_b":"You are Sooo Pretty, Young Lady!","commenter_a":"Why is right. Totally agree, Brandon!!","post_message":"TheBlaze news update with Sara Gonzales and Brandon Morse."},{"comment_id":"10152961317706636","commenter_b":"What an odious man, he should be stripped of his Irish surname, he's unworthy of it!!","commenter_a":"I'm sure that O'Reilly curses everyday his bad luck of not being old enough to have been part of the glory days he admires and sees as a role model of traditional values .... the book burning and massive rallies in Nuremberg....","post_message":"O'Reilly is rarely shy when it comes to the 'degradation' of conservative values..."},{"comment_id":"10152728420456519","commenter_b":"Ducking duckers lol","commenter_a":"'@username hahaha","post_message":"No one should be forced to drop this kind of money to celebrate a loved one..."}]
