[{"comment_id":"755392124560784","commenter_b":"Happy New year","commenter_a":"Go Bernie..he's the right person for the job!!","post_message":""},{"comment_id":"10154844264313132","commenter_b":"Sorry katie but i think you are confused between who hillary is and who trump is cuz clearly he was the one interupting her on soo many questions and tring to intimidate her just like he does every other woman but thank goodness she is a strong woman and did not let him get to her lol","commenter_a":"Wow this just goes to prove that hillary is the better candidate hands down. She definately killed trump and i think he got angry and became soo defensive lol she was very prepared and he was not","post_message":"Donald J. Trump says he will release his tax returns when Hillary Clinton releases her deleted emails. @webpagelink"},{"comment_id":"917503514939106","commenter_b":"Shut up bitch","commenter_a":"Surely another upstanding citizen.","post_message":"BREAKING: New police body cam video reveals the disturbing moment a white cop killed Eric Harris, an unarmed black man in Tulsa, Oklahoma. #EricHarris #BlackLivesMatter"},{"comment_id":"10153612983935329","commenter_b":"Where's the fat men in crop tops","commenter_a":"@username this is why buzzfeed is terrible lol. So hypocritical","post_message":"God bless you, Roberto Bolle. God bless the male body and also tights."},{"comment_id":"10154129472871509","commenter_b":"Shut up Muslim trash","commenter_a":"Middle East bloodshed happened due U.S invasion of Iraq. Sadam was a great leader. U.S is responsible for Shia occupation of Iraq, syria and Yamen.","post_message":"At least 30 killed after airstrikes hit wedding @webpagelink"},{"comment_id":"10153021389625399","commenter_b":"All you have to do is look it up .they are in key positions and were placed there by Plummer. Thank you Franklin Graham keep telling it like it is","commenter_a":"Listened to him!","post_message":"\"Washington, has been infiltrated by Muslims who are advising the White House, who I think are part of the problem.\""},{"comment_id":"10153465147033812","commenter_b":"Don't worry about turning white in the White House, your dumbass isn't even gonna make it in there you dumb twit!","commenter_a":"No your a has been go home","post_message":""}]
