[{"comment_id":"10152997127479330","commenter_b":"Oh my now there going to ban scissors.","commenter_a":"Oh my god scissors are bad the scissors just killed someone ban the scissors","post_message":"A horrifying story out of California… Police say a 15-year-old boy was stabbed to death with a pair of scissors right outside a middle school in LA. Now authorities are trying to figure out what led up to the deadly attack ---> @webpagelink"},{"comment_id":"1754772134792927","commenter_b":"@username is voting for hillary just because she is a female","commenter_a":"I can't wait for you to be the next POTUS @username. You've got my vote Madam Secretary. #Imwithher.","post_message":"You saw the Democratic National Convention. Now, watch the never-before-seen footage from backstage:"},{"comment_id":"10153461006671717","commenter_b":"Welp since all the lesbians I see on here basically think its hilarious, and a silly hearted statement meant with no hate or bias I guess you're just one of those super bitchy \" right to be offended\" people that wake up everyday looking for a reason to be Cunty.","commenter_a":"I'm not buying it. I don't think the joke was just in good humor. There's enough language here to clearly see that he was being hateful towards the LGBT community. After all, he did say the word \"lesbian\". Isn't that enough to ban him and boycott him from everything? Shouldn't we be calling him hateful names for his aweful transgretions?","post_message":"Funny or die?"},{"comment_id":"10154394948753494","commenter_b":"When one door close another will open, smh","commenter_a":"I hate to break it to anyone, but unless you own the company very few people can not show up for work and still have a job. There are plenty of others who need a job, that will step right up and be thankful to have a job.","post_message":"Juvenito Quintana and 20 others missed work February 16th. The following day, they all received a termination letter."},{"comment_id":"10153092364080779","commenter_b":"how about enforcing the laws.....dumb bitch.....","commenter_a":"If I hear gun control one more time... I couldn't feel worse for the families that lost loved ones today, but laws are NOT going to keep law abiding citizens safe from criminals, the mentally ill or those that intend on dying in a blaze of glory.","post_message":"Calling America's epidemic of gun violence \"a political choice we make\" and declaring of the nation's political class, \"we, collectively, are answerable to those families who lose their loved ones because of our inaction,\" President Barack Obama delivered one of the rawest speeches of his presidency today in response to the Umpqua Community College shooting rampage. Read it below."},{"comment_id":"10152769527894877","commenter_b":"No. Ladies came up short they guys didn't end up in the board room. Lamas was dead weight though.","commenter_a":"I thought the female team won their challenge. Why did she get fired and not lamas?","post_message":"Keisha Knight Pulliam Fired From 'The Apprentice' For Not Calling Bill Cosby And Asking Him For Money. Watch it and read more here. Grio fam, was this at all fair? Sound off."},{"comment_id":"1558275617531277","commenter_b":"NICE PERSON..SHE LIES, ARGUES LIKE HE DOES. INTERUPTS,ALL SHE DOES IS TRASH HILLARY","commenter_a":"She really seemed like a nice person and I am hoping she gets as far way from that idiot as she can. She is way too good for him. She was going down the tubes with him.","post_message":"The wheels are falling off!"}]
