[{"comment_id":"587779548050076","commenter_b":"NO NO NO NO NO !!! AND HELL NO! Keep them out and send all illegals back!!!!!","commenter_a":"Hell no","post_message":"I'm thinking ... uh ... duh. But then again, we have the SFB Liberals who see 'no wrong' in Sharia. Vote in our CLASH Poll and let the US know how u feel. @webpagelink"},{"comment_id":"1710841849170298","commenter_b":"We cant have a woman as president we need Bernie or a republican","commenter_a":"Hillary is the devil.","post_message":"We did it, New York. Together, there's nothing we can't do. Watch Hillary live from NYC—and if you've got her back, chip in here: hrc.io/1VhzzV3"},{"comment_id":"465155073666373","commenter_b":"Tax and spend.....are investments in our society.","commenter_a":"The problem with liberals they preach their beliefs and are hypocrites. Look at All Gore with his huge carbon footprint. Yes science is real and climate change is real this coming from a conservative but unless we get our house in order this country won't survive. The answer from liberals is a carbon tax. Let's see gas and electricity go through the roof and see the gap between the rich, middle-class and poor widen even deeper. You have to live what you preach and ultimately politicians are out only for themselves. There poor decisions impact the masses and we all need to wakeup. The problem with liberals is they think everyone who doesn't believe exactly like them are bigots or racists and there is no compromise. Tax and spend is not the answer the rich just find new ways to hide it and the middle class families keep falling into ...","post_message":"More proof they can't deal with facts."},{"comment_id":"10153769557012411","commenter_b":"Very few companies offer health insurance to retirees.. very few!!! Probably government retirees is about it..","commenter_a":"Congratulations to her, but did the massive company McDonalds, give her retirement benefits or health insurance after 32 years?","post_message":"“She is one of the most beautiful and upbeat people you could ever hope to know.\""},{"comment_id":"1283553535022959","commenter_b":"Ryan got a totally cushy job.","commenter_a":"Aleks Evans","post_message":"LOL! Not helping anyone, Ryan!! SHARE if you agree! (Hat tip to The Christian Left)"},{"comment_id":"1122159437825214","commenter_b":"Hillary is only qualified for prison , Americans that vote for her are idiots, wake up !!!!","commenter_a":"That is how politicians make their fortunes. Crooked Hillary should not get near the White House. Who knows what she will continue to do; she believes she is untouchable.","post_message":"TREAT PEOPLE WITH DIGNITY? HILLARY TAKES MILLIONS FROM REGIMES THAT BRUTALIZE WOMEN & LGBT RESIDENTS: What Clinton said today, \"If you believe as I do, America values hard work and treats people with dignity and offering everyone the chance to live our dreams and cares for those in need, well, the formula for America's success have always been that we are stronger together.\" Versus Behind closed doors, Hillary Clinton uses State Department access and favors to rake in massive sums of money from some of the most oppressive regimes on planet Earth. “Rarely, If Ever, Has A Potential Commander In Chief Been So Closely Associated With An Organization That Has Solicited Financial Support From Foreign Governments.” “Rarely, if ever, has a potential commander in chief been so closely associated with an organization that has solicited financial support from foreign governments. Clinton formally joined the foundation in 2013 after leaving the ..."},{"comment_id":"10153227271719228","commenter_b":"If she didn't go to the hospital another couple hours she would have been gone cuz it would have went to her heart it was that close to her heart they caught it in time","commenter_a":"The exact same thing happened to my daughter they went in a Lana ectomy scraped her spinal cord put her in a coma for 2 weeks it took her 2 months to learn how to walk again but she is walking again","post_message":"Her body started to go numb and she lost feeling in her legs."}]
