[{"comment_id":"956149327758873","commenter_b":"Hit it girl","commenter_a":"Indeed I do agree and it's another reason why I dislike them.","post_message":"Veterans have had it with Republicans using them as political props, while screwing them every chance they get. Do you agree with this veteran's take?"},{"comment_id":"10153275307228132","commenter_b":"You're a total dick!!!","commenter_a":"Junkie","post_message":"'So funny, honest and loving. We lost a great one today.'"},{"comment_id":"10153628863174575","commenter_b":"She's just a troll, Crystal. Ignore her.","commenter_a":"I stand with Kim Davis","post_message":"Rowan County Clerk Kim Davis is under fire for defying a judge’s order to issue same-sex marriage licenses.  'This is how gay people are treated in this country.If nothing comes of this, at least I hope that other people understand that this is wrong. It's just wrong,” said David Ermold who was denied a marriage license."},{"comment_id":"1710894845846679","commenter_b":"somebody please...slap this bitch!!!","commenter_a":"This is interesting as the Black and Hispanic communities are some of the most 'Biblically religious' communities in this country!","post_message":"Say what?"},{"comment_id":"10153858416863271","commenter_b":"Sick woman. I mean the one who posted this comment.","commenter_a":"I've been looking at her Facebook pages(she has two), I'm not justifying her actions and believe it's absolutely disgusting but I'm pretty pretty sure she's special needs. I'm not saying she shouldn't be punished or condoning her behavior but I honestly don't think she knew any better. I'll be willing to go out on a limb and say she was sexually abused. She probably did to him what had been done to her or what was told to do. I can't even imagine what's going on behind those walls.","post_message":"Jessica McCain told investigators that she recorded the sex act on a borrowed cell phone, according to court documents."},{"comment_id":"1902414739981573","commenter_b":"Do these woman have any idea how stupid they are?","commenter_a":"How stupid","post_message":"Whoopi Goldberg: Right to Celebrate Christmas is the Same as a “Woman’s Right” to Abortion"},{"comment_id":"10150581639814999","commenter_b":"its called cheating and it is still cheating if the score 47-7 hope you dont have kids...","commenter_a":"Seems like a very very cheap price for a championship","post_message":"A report commissioned by the NFL concluded that it was “more probable than not” that Tom Brady was aware of New England Patriots personnel deflating footballs to gain an advantage against the Indianapolis Colts."}]
