[{"comment_id":"10153971816072869","commenter_b":"Ugly nasty ol bill has givin her what she never wanted ol monica. Diseased up hoes.","commenter_a":"Why isn't the Mainstream Media talking about this Story?? News - 1) ABC News executive producer Ian Cameron is married to Susan Rice, Obama's National Security Adviser. 2) CBS President David Rhodes is the brother of Ben Rhodes, Obama Deputy National Security Adviser for Strategic Communications. 3) ABC News correspondent Claire Shipman is married to former Obama Whitehouse Press Secretary Jay Carney. 4) ABC News and Univision reporter Matthew Jaffe is married to Katie Hogan, Obama Deputy Press Secretary. 5) ABC President Ben Sherwood is the brother of Obama Special Adviser Elizabeth Sherwood. 6) CNN President Virginia Moseley is married to former Hillary Clinton Deputy Secretary Tom Nides.Etc... etc... Get the picture? Please copy and share *Muslim influence in America*: John Kerry's son in-law is an Iranian Muslim and, the best man at their daughter's wedding was the son of the man Kerry negotiated the Iranian Nuke Deal with. John ...","post_message":"NO deed goes unpunished..."},{"comment_id":"1001682469851506","commenter_b":"This lady is so delusional. .... how did this happen","commenter_a":"Does no one get the part where they are wielding skateboards at police? This isnt because a WHITE COP or two BLACK KIDS.... this is because TWO CRIMINALS TRIED TO ESCAPE AND USED SKATEBOARDS TO ASSAULT POLICE!!!!!!!!","post_message":"JUST IN: This footage shows step-brothers, Bryson Chaplin and Andre Thompson, at Safeway -- before they were shot by an #Olympia police officer. >> kiro.tv/SurveillanceOly  They are both expected to survive."},{"comment_id":"10152630103907894","commenter_b":"Ladies love you to death but clearly you are being unfair in this matter 70 to 80 percent of custody battles in this country land in your favor whether the father is fit or not whether he is financially stable or not so for you guys to be sitting here some type of quote unquote outraged about this is ridiculous. knock it off.","commenter_a":"Some women needs to be careful who they sleep with","post_message":"Ludacris Wins Primary Custody of His Daughter"},{"comment_id":"10152954231420399","commenter_b":"Paybacks are a bitch!","commenter_a":"Karma isn't it great","post_message":"An extraordinary act of trolling:"},{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."},{"comment_id":"10153397291788984","commenter_b":"Couldn't agree more.","commenter_a":"Great message...lousy article.","post_message":"Famous actor Matthew McConaughey just spoke at a graduation, and he had a very blunt message for whiny college kids...  What he said is going viral... and it couldn't be any more perfect."},{"comment_id":"10154153451894197","commenter_b":"nice, she can afford to leave, no doubt on our dime.","commenter_a":"and who didn't see this coming","post_message":"Former Governor Rell is moving to Florida, and she is not happy about the direction of Connecticut.   Have you considered moving for tax reasons?  Watch Face the State with Dennis House this morning at 11.    Preview here: @webpagelink"}]
