[{"comment_id":"1521164361521907","commenter_b":"11, MILLION illegal immigrants, @username. I won't write it out, you might have trouble counting the zeros. That would cost the US 4+ BILLION dollars, but hey- you might not realize how much money that is. Once the current illegals are removed from the work force, it would cost 1.4 TRILLION dollars and the likes of a recession no one in our lifetime has ever seen, but in the meantime, you rock on with your idiot self.","commenter_a":"Good fella for calling his royal Ass out on such ridiculousness.","post_message":"Kudos to the NBC reporter for calling Trump out to his face. Earlier today, Trump said he wouldn't rule out creating a national registry of Muslims, or giving them special IDs. That's NOT the American way. Spread his shame.  Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"838550182928031","commenter_b":"i feel bad 4 you girls cuz i used my dick tip","commenter_a":"Christoffer Kindmark","post_message":"@webpagelink"},{"comment_id":"10153730476318145","commenter_b":"Lol Hilary is a f** murderer and needs to rot in a prison cell.","commenter_a":"I never thought I would say this but I really hope Hilary wins !! Republican Party has become a freaking joke !!","post_message":"#BREAKING: Former presidential candidate Dr. Ben Carson will endorse Donald J. Trump, the real estate mogul said. Watch Channel 9 Eyewitness News at Noon for details and a recap of the GOP debate."},{"comment_id":"10153376364371770","commenter_b":"These leftist thugs should go get jobs!","commenter_a":"Look at them. You can tell they are all scholars, have jobs, homes, and a lovely life. LOL.","post_message":"Protesters disrupted several of Donald J. Trump's events over the weekend."},{"comment_id":"10153711323820695","commenter_b":"Girl, STOP!","commenter_a":"A true example of faith. My prayers go out to him and his family. They'll get what they deserve, evil doers do not prosper.","post_message":"FORGIVENESS: That's what the wife of a man shot during a home invasion is expressing as her husband recovers."},{"comment_id":"1891107191121894","commenter_b":"America America God shed His grace on thee!!!!","commenter_a":"seems like a funeral more than a parade","post_message":"We're live from President Donald J. Trump's Inaugural Parade:"},{"comment_id":"10154609681272300","commenter_b":"Actually she was not fat. The rules do not say you have to be a size 2.","commenter_a":"trump has no room to talk about calling anybody miss piggy especially when he posts pictures of him eating Mcdonalds and KFC on his private jets.","post_message":"Donald J. Trump called her “Miss Piggy” and “Miss Eating Machine” because she gained weight after winning the Miss Universe crown."}]
