[{"comment_id":"10153840102456523","commenter_b":"Your ignorant Jessica. Just Stfu","commenter_a":"Gang members shoot people to they do drive byes or just randomly shoot somebody it could be any if us blk kill blks latinos kill latinos white kil whites wow only in America","post_message":"The graphic video shows the three men listening to music, and a man in the front passenger seat holding the phone.   Suddenly, the phone drops to the floor of the car as what sounds like at least 30 gunshots can be heard in the background."},{"comment_id":"10155911765540389","commenter_b":"hillary can win if they let enough illegals in","commenter_a":"Stay on her, Mr. Trump!!!","post_message":"'Hillary was the worst secretary of state in the history of our country.” – Donald J. Trump"},{"comment_id":"1219986431394436","commenter_b":"Why are women today so violent?","commenter_a":"No wonder kids are so screwed up today in America...just look at their mothers.","post_message":"Boom box brawl erupts in the sky"},{"comment_id":"1151424271590993","commenter_b":"Hillary is a racist bitch.","commenter_a":"Sums up trumps campaign..... even his surrogates are full of shit.","post_message":"He walked out of his own church because of his lies! #DonaldTrump #MarkBurns"},{"comment_id":"517382478450045","commenter_b":"Anyone know whats happening in Europe? Muslim takeover. By sheer numbers they are over running countries and residents are falling back on rioting to fight the takeover. Muslims come into a country and this usually ends up in war and destruction of lifestyles and sovereignities. The US would be better off without them sad to say.","commenter_a":"They have NO BUSINESS in our Government!!!! Stop Muslim Take Over!!!!!!","post_message":"This is not unexpected. Click to Read ALL the SICK Details..."},{"comment_id":"10156983080310354","commenter_b":"throw his ass in prison HES NOT FIT TO WALK STREETS WITH REAL AMERICANS","commenter_a":"Only 5 years?! When he gets out of prison,strip him of his Texas residency,send him to live where he belongs ,Washington D.C.,with all the rest of the anti-American felons.","post_message":"You heard about this, right?"},{"comment_id":"769355346496407","commenter_b":"I am on Pam side screw the rest of them assholes.","commenter_a":"Bullshit she clearly antagonized this lame ass broad","post_message":"She believes she saved lives by hosting the contest."}]
