[{"comment_id":"456122197909407","commenter_b":"Evil beast","commenter_a":"And that black power flag of the black panthers.","post_message":"OKAY THEN..."},{"comment_id":"10152706820701051","commenter_b":"A lot of the comments posted here are no better then the girls who did this. Nothing but a lot of hate.the girls had no right to hurt anyone.But are you any better.look at your comments.and yes I think this girls should pay for what they did.Bottom line no has a right to go beating up people .Got a problem do it right call the law.that's is if your not just personally the one wrong","commenter_a":"Its racially insensitive to assume black girls can tell the difference between right and wrong. As well as controlling their impulses. Seriously white folk....one step at a time.","post_message":"One of the women who beat up this teen girl says she’s the real victim. Here’s why."},{"comment_id":"10155104320669614","commenter_b":"Liliana Sanchez ghetto AF.","commenter_a":"Losers","post_message":"Officers recovered a large amount of stolen mail, checks, W-2's, government identification cards, and narcotics after arresting the pair, authorities say.   Police estimate there are more than 50 victims in San Bernardino and Riverside counties."},{"comment_id":"10154212521629087","commenter_b":"The best present she could give America would either be a full confession of her crimes or better yet, get a pistol, load it, put it in her mouth and pull the fucking trigger.","commenter_a":"I believe it was the other way around. Liberal loons twisting facts to make it look good for them. Lol. Happy birthday Hillary! The best present you can offer to the American people would be to quit! :) #NeverHillary!","post_message":"\"Can we call Megyn Kelly’s total obliteration of Newt Gingrich on live television the kick off to Hillary Clinton’s 69th birthday celebration?\""},{"comment_id":"10154242646146336","commenter_b":"Lots of ladies in Texas have CHL (concealed handgun license) enter at your own risk!","commenter_a":"Caitlyn Jenner is harmless. But lots of creeps out there will go into the women's room to do things other than pee. It's only a matter of time before we hear the horror stories. Be careful ladies.","post_message":"Donald J. Trump said this morning that he does not agree with North Carolina passing a law on bathroom use by transgender people.  He added that if Caitlyn Jenner visited Trump Tower she could use whichever bathroom she prefers. @webpagelink"},{"comment_id":"10153382120572293","commenter_b":"They are not the same at all","commenter_a":"Deidri","post_message":"Why the analogy is important."},{"comment_id":"10153974645223132","commenter_b":"ITS NOT A WOMEN!!!!! Check the DNA!!!! It has not had ANY of the real struggles of a REAL women. Tell it to give birth, have a period, nurse a newborn baby!!!!! Completly undeserving!!","commenter_a":"maybe if the men who hink that they are women should have the gender description of woman and all women change to the smartersex as our descriptive verb!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","post_message":"Congratulations, Caitlyn Jenner, who was an honoree!"}]
