[{"comment_id":"710829429070596","commenter_b":"That a girl","commenter_a":"That's all you got NBC? IF that is even true, it pales in comparison to the lies and scandals of the Clinton's. Both candidates are far from perfect but I'm going with the one who doesn't support the butchering of full-term babies, who doesn't support millions of immigrants being granted citizenship, who is in favor of term limits and ending special interest groups in DC, who will create jobs through trade reform rather than the government creating yet another program and who will reform the health care system and end Obamacare, which, in case you haven't checked, your policy is going up by 25% next year, who supports our military and vets and our police officers and supports the NRA and my second amendment rights and the list goes on and on. If the truth were ever told by the media, this would be no contest.","post_message":"Federal agencies are barred by law from endorsing candidates in political elections"},{"comment_id":"10153456187686615","commenter_b":"That chick must be high","commenter_a":"Please everyone lets leave her in an empty room. I seriously don't understand how anyone could like her!!","post_message":"JUST IN: Hillary Clinton's campaign says the Democratic presidential candidate will be making a stop in Pittsburgh next week."},{"comment_id":"10152783958260667","commenter_b":"You need to wake up lady !","commenter_a":"They are not public property. They are her private emails. You are all so crazy about your rights but not anyone else's. They were on a private server that had more security than her work emails. You need to take a cold shower.","post_message":"Looks like those who want a look at Hillary Clinton's emails have a long wait ahead of them."},{"comment_id":"10154095575861051","commenter_b":"Hillary ain't sending no one back she'll let the whole world here, terrorists included","commenter_a":"I just hope that when Hillary wins she will issue a deportation order for Ted's old man.and sends his goofy ass back to Cuba.","post_message":"Ted Cruz says Trump would absolutely be a better president than Hillary Clinton, so he'll be casting his vote for him this November. Do you feel the same way?"},{"comment_id":"10153771279973908","commenter_b":"Gotta be relaxed, to perform","commenter_a":"Another reason why Trump is not Presidential material. (LOL)","post_message":"Collective Evolution"},{"comment_id":"777437579026197","commenter_b":"No I think the lying words wouldn't come out,she was choking on them.","commenter_a":"BS","post_message":"I don't think she had ANYONE fooled..."},{"comment_id":"1526598987356152","commenter_b":"First Ladies are suppose to always embrace hope and not be pessimists.","commenter_a":"Her lavish vacations on the taxpayers backs are over !!!!","post_message":"SHE'S BACK TO HATING AMERICA: It's the end of \"hope and change\" and Michelle, for one, isn't happy about it."}]
