[{"comment_id":"367438390047230","commenter_b":"Devora Sexton and you are a cheap whore","commenter_a":"If a man's children and wife are a measure of him, Trump is a hell of a guy.","post_message":"Another reason Dems are terrified..."},{"comment_id":"971595456226551","commenter_b":"there is a problem with a Black man being president and not standing for a black man, or a white man!! but only standing for illegals and Terrorist!!! thats what should be bombed!!! leave white babies or any babies out of it!! SPILLING INNOCENT BLOOD MAKES YOU JUST AS LOW AND WRONG AS WHAT IS HAPPENING NOW!!!","commenter_a":"I will gladly Kill you for the White Nation!!!","post_message":"(Audio) A war cry... @webpagelink"},{"comment_id":"521485418039751","commenter_b":"Caitlyn Jenner is a repudlicrat.","commenter_a":"Who wants a killer around them and yes HE killed someone","post_message":"'Transphobic'... Republican-hating... CONFUSION!!!"},{"comment_id":"1044884802218658","commenter_b":"exactly...if they don't want to procreate, they get it from somewhere else...LOL","commenter_a":"Now wait a minute! I thought they only had sex to procreate!","post_message":"Finally! A \"Christian\" guide to dealing with the \"sexual immorality\" of a wife refusing to give her husband sex-on-demand without a \"legitimate\" physical or mental health reason!"},{"comment_id":"10154037878823984","commenter_b":"Mr. Trump from the time he started his campaign he has always states that all the illegals have to go back have to go back to Mexico and Central America but yet he is one of the largest employers in the Real Estate , Casinos , Hotels, and Golf Courses business, has bragged about hiring illegals to including his contractors and subcontractors and they love him 1. did he use e-verification to see if he or his contractors and subs to see if they had a work permit or they are who they say they are. 2. you claim you want to help the veterans but your company hires more illegals than vets. 3. if you are serious about what you are campaigning on why not be the first to fire or dismiss the illegal aliens and fill those jobs with veterans lead by example and make America great again ...","commenter_a":"Yup another lifer. GET RID OF POLITICAL LIFERS THAT ARE FEATHER BEDDING Stump for Trump. You Go Don, Go Don all the way to the WHITE HOUSE.","post_message":"Wow. The governor of Iowa is actively working against one of the GOP's most popular presidential candidates. This is very unusual for the Iowa caucus... the Iowa governor must feel very strongly about this. Do you agree with the Iowa Gov.?"},{"comment_id":"10152921328085950","commenter_b":"Wow, Janet Fix, your comment just proves how uninformed you are. Or are you just trying to be obnoxious?","commenter_a":"lol If its Michelle Obama I'm asking for two fives.","post_message":"Move over, Alexander Hamilton... A woman is about to replace you on the $10 bill."},{"comment_id":"1415185618534424","commenter_b":"@username Spaniards have been in this country for a very long time and that will never change. It is very raciest of you to assume only Hispanics are illegal and most legal Hispanics would like illegals deported. We have immigration laws in this country and they will be enforced .You are nothing but a hateful bigot. Eva's country doesn't deal with an illegal immigration problem because they strictly enforce their immigration laws; as soon as Canada takes in 10 million illegals Eva can have an opinion on this matter.","commenter_a":"Trump stirred it up with all his comments during the campaign. He brought out the worst in people. And because he was so verbal againgst race...religions...women...all the racist bigots who kept semi silent for a while have come outta of the woodwork and guess who led the way. And to think he is now going to be the leader of your country.","post_message":"Chili's provides veterans a free meal every Veterans Day, so US Army veteran Ernest Walker went to his local Chili's for a burger. Instead, he was denied a meal after an altercation over his service record. @webpagelink"}]
