[{"comment_id":"490217177839688","commenter_b":"YOU BITCHES DON'T MISS ANY WELFARE MEALS DO YOU!","commenter_a":"Only thw Daily Dummies would bring more media attention to something like this. Learn the legal system who iduots. This guy wasn't guilty ever and the rest of Baltimore now knows it too.","post_message":"Baltimore city residents expressed disappointment in response to the city circuit court Monday finding a police officer not guilty in connection to the death of Freddie Gray."},{"comment_id":"1213471005342343","commenter_b":"Amnesty International can't even help the refugees that are dying in the Mediterranean today, all they can do is pick on Israel which is a democratic country and an easy target.","commenter_a":"Shame on you Amnesty International!","post_message":"This is ABSURD! How could they get away with this??"},{"comment_id":"10153330773746336","commenter_b":"Killing America ....... Job by job......","commenter_a":"Good it should not be right to work, should be the best man for the job.","post_message":"“This proposed action by Obama’s Big Labor NLRB is a direct assault on a worker’s fundamental First Amendment right to freedom of association.\" – Greg Mourad, National Right to Work Committee"},{"comment_id":"10153442848704474","commenter_b":"She gives women a bad name.","commenter_a":"Bah bye! Don't let the door hit ya where the good Lord split ya! JUST LEAVE!","post_message":"REPORT: House Democrats ready for Pelosi to retire. Where do you stand?"},{"comment_id":"704402909750287","commenter_b":"1st lady my ass","commenter_a":"She destroyed the school lunch program. Absolutely destroyed it...","post_message":"Michelle Obama gets blind sided with this devastating blow, it's over. No one cares about her. She is a disgrace. Are you tired of hearing about Michelle Obama?"},{"comment_id":"10153468487630530","commenter_b":"To conservative for you liberal","commenter_a":"Big ol lame duck","post_message":"Is Governor Rick Snyder a lame duck in the making?"},{"comment_id":"539787562878490","commenter_b":"Send Them back to their sand pile home, get them out of this country!","commenter_a":"Why were they even there watching if they didn't like it","post_message":"Furious Muslim students rush stage during American Sniper showing. They have no respect. If they don't like American Sniper they can leave. Do you agree these Muslims are out of line?"}]
