[{"comment_id":"10154201803933869","commenter_b":"44?","commenter_a":"In fairness, what President hasn't had to pay $25 million to make a massive class action fraud lawsuit go away before assuming office?","post_message":"The election of Donald J. Trump to the Presidency is nothing less than a tragedy for the American republic, David Remnick writes."},{"comment_id":"10153095122281770","commenter_b":"Screw her","commenter_a":"DONALD TRUMP for PRESIDENT","post_message":"Hillary Clinton urged attendees at her Alexandria, Virginia, campaign rally on Friday to “start a competing organization” to the National Rifle Association and join her fight to end the “plague of gun violence.”"},{"comment_id":"1035505973211617","commenter_b":"Rondell....you are missing something","commenter_a":"What makes Melania Trump's speech troubling is not that she \"plagiarized\" words/phrases from FLOTUS Michelle Obama's 2008 speech. But rather that Melania was not able to speak \"authentically\" about how she feels about \"her\" own husband, Donald J. Trump. The fact that Melania had to use another woman's words to speak about her husband versus using her own words underscores something deeper--not just about the Trump campaign, but whether America can trust a man whom his wife does not even know.","post_message":"In-house writer with the Donald J. Trump campaign steps forward with apology for Melania Trump's speech and tries to resign - but Trump camp rejects resignation."},{"comment_id":"10152997685931336","commenter_b":"Now we have the iic ( idiots in charge ) fighting the isis. Stop talking about it and just do it.","commenter_a":"I hope isis dont watch tv...","post_message":"A U.S. military official has outlined plans to retake the key Iraq city of Mosul from ISIS terrorists as early as April, but the move has swiftly drawn criticism that the Pentagon is revealing too much information. @webpagelink"},{"comment_id":"10153378828583984","commenter_b":"Yes","commenter_a":"Yes","post_message":"The Obama Administration’s pattern of rubber stamping these cases has significantly increased this percentage in the US. Do you support securing our border?"},{"comment_id":"991848417558053","commenter_b":"what woman?","commenter_a":"If this woman is willing to show such an overt act of patriotic disrespect, how will she ever effectively enforce our laws in an unbiased way? She should be removed from her position. End of story.","post_message":"VIDEO: Muslim Police Chief Shows This Act Of Complete Disrespect To America And Is Under Heavy Fire For It."},{"comment_id":"775594199191746","commenter_b":"You should be in a burka, you slut.","commenter_a":"I suppose next the religious right will insist that women wear burkas next. They're getting more and more like muslim terrorists every day.","post_message":"“Somehow my shoulders are sexualized? Like it’s my responsibility to make sure the boys’ thoughts are not unclean.”"}]
