[{"comment_id":"727273657378849","commenter_b":"We can not trust Iran and we definitely do not need to give them money. Thanks for standing up against this deal and a deal that does not even include the release of our Americans held in the Iran prison.","commenter_a":"hey rodney you pathetic weasel,the US has violated almost every treaty they have ever signed you delusional fool.","post_message":"My statement on the nuclear deal reached with Iran: “In the coming days and weeks, I will carefully analyze the details of this agreement, but remain skeptical that the Iranian regime will live up to its end of the deal,” said Davis. “We’ve been here before with North Korea who two decades later have cheated its way out of a deal and onto a path to dozens of nuclear weapons. I fear this administration has agreed to terms that will leave the world’s leader in state-sponsored terrorism stronger economically with a nuclear program largely intact.” Last week, I spoke on the House floor warning against a bad deal with Iran →"},{"comment_id":"10153642078228132","commenter_b":"So sad for them.","commenter_a":"Nathaniel Gaytan","post_message":"EXCLUSIVE: It's the end of the road for Ben Affleck and Jennifer Garner."},{"comment_id":"10152826020480927","commenter_b":"It;s simple sex, between a man and a woman burns calories.","commenter_a":"CRAZY","post_message":"Remember, these are your taxes at work."},{"comment_id":"425439057626422","commenter_b":"Can you imagine an entire supreme court of Ginsburgs? Elect Hillary and we'll have it. She is a wretched witch that is a discrace to the court and she's not alone.","commenter_a":"She woke up cranky from her nap.","post_message":"It was completely inappropriate for Justice Ruth Bader Ginsburg to attack Donald Trump’s candidacy. This is not the role of the Supreme Court, and it serves as another reminder of what we’re up against in 2016. Help me fight for the Constitution and protect the integrity of the Supreme Court by joining my Fight for the Court campaign. www.fightforthecourt.org"},{"comment_id":"10153958527368822","commenter_b":"apparently you havent done your homework or been around long enough to have seen and heard her bigot comments in the past. She stated she will raise all taxes and healthcare. unless you are wealthy and dont care about others who are not your ok with paying more. Also I would still love to see Bush in prison right beside OBUMMER and KILLary. She is not for woman. She was the lawyer for a man who raped a 14 year old girl and got him off. Do some homework. Ive studied both sides and a liar , a cheat and a murderer for president of my country. our country that so many have died for no F_G way. Your so hung up on a stupid wall and blinded on real issues. Our parents and grand parents have worked all there lives for ss and its a loosing battle because the ...","commenter_a":"So to the people that are angry by this. You are willingly admitting that you are and support racism, bigotry, homophobia, xenophobia, getting rid of women's rights, allowing abuse of children and women to be legal. To literally rounding up whole races of people tagging them and putting them in camps. Exactly what the Nazi's did. You are saying that you are unable to think for yourselves, that you think there is this america that you are being held back from that doesn't actually exist. If so I hope you are proud of being a horrific human being. You are a traitor to America and all that it stands for. You are scum, a filthy plague on human society. You are the embodiment of everything that you hate.","post_message":"\"We are a city of bridges, not a city of walls,\" said Congressman Mike Doyle, referencing Donald J. Trump, at Clinton-Kaine rally in #Pittsburgh."},{"comment_id":"10152866488206336","commenter_b":"that IS child endangerment..someone needs to be locked up--along with the snake........","commenter_a":"Some are just nuts","post_message":"This video footage of a 14-month-old girl playing with the family pet might make you a little nervous."},{"comment_id":"1267539270005791","commenter_b":"@username , is it all intelligent, competent and strong women that intimidate you, or just Hillary? Hillary 2016","commenter_a":"He can only intimidate weak people... She's the exact opposite of that! #VoteBlue","post_message":"BOOM."}]
