[{"comment_id":"868880693208184","commenter_b":"She is a liar","commenter_a":"You idiots have hit the bottom of your now famous SKUM barrell!!!! Cant you all find anything on the first woman president to be besides a cell phone E-MAIL really!!!!","post_message":"Blackberry-toting Clinton is now an action figure."},{"comment_id":"853673114823265","commenter_b":"Hilderbeast is a lesbian. She don't want no pecker...just power.","commenter_a":"Bill said he couldn't father a child because he contracted mumps as a teenager that made him sterile. Hillary had an affair with Webb Hubbell who is the father of Chelsea. How could he then be this girl's father? A paternity test will answer the question.","post_message":"Teen girl comes forward at worst possible time. She just dropped a bombshell right in the Clinton's lap. Do you think Hillary has no chance at winning?"},{"comment_id":"10154001788011770","commenter_b":"They not that sexy to me at all need some meat on the bones Sarah Palin is sexy","commenter_a":"Mama's baby papas maybe They look nothing alike","post_message":"Gigi and Bella Hadid proved they are the sexiest sisters in the world at the Victoria's Secret Fashion Show."},{"comment_id":"976160855782499","commenter_b":"Oprah is racist trash.","commenter_a":"I hate Obama & I hate you to stinking race baiting pig","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"10154698586269641","commenter_b":"Or avoid stealing from worker or outsider, as well as free up labor to provide a cleaner environment","commenter_a":"What they're doing is phasing out people so they don't have to pay $15/hr wages.","post_message":"McDonald's is getting fancy - the chain is rolling out self-order kiosks, mobile pay options, and even table service"},{"comment_id":"10153120906398205","commenter_b":"95percent of the illegal immigrants are hard workers.... So much so that many citizens feel threatened will take their jobs.....i would never be scared if an illegal taking my job......","commenter_a":"Thus is what you spend your time on. Your dedication should be the American people I think your priorities are screwed up. As a congressman you work for the citizens of this country.","post_message":"Central Florida - I'm coming to talk about how to get ready for DACA and DAPA!"},{"comment_id":"1397444103681973","commenter_b":"Welcome to the internet hun.","commenter_a":"90% percent of the people calling others cry babies are the same who were crying and complaining when obama was president.","post_message":"This one sums up today's women's rights marches beautifully..."}]
