[{"comment_id":"10155762960395354","commenter_b":"commands...???...commands what....","commenter_a":"Obama's greatest tool in his propaganda arsenal.","post_message":"Hollywood? Check out what he told supporters...."},{"comment_id":"10152816607284877","commenter_b":"Girl you better zoom in! Boom","commenter_a":"Yet not a word about the lady in black. They can all kick rocks!","post_message":"Oh boy, they're coming for Michelle Obama for not wearing a headscarf in Saudi Arabia. Read more about her critics below. Grio fam, this seems foul to us. What do you think?"},{"comment_id":"1012689648797790","commenter_b":"Lmao she getting that good shit. 😂😂😂😂😂","commenter_a":"Leslley Santana Raudel Flores","post_message":"She's not ready for a tattoo"},{"comment_id":"1114612235259607","commenter_b":"So wait, now they don't WANT jobs? All this time they've been saying they want equal opportunity and a piece of the pie. Clearly, this group do sent want to work for it. They just want a free piece of pie. Give me a break! At least those inside the church get it. The Democrats have kept blacks down for decades and more but the fools outside just can't see beyond their hate.","commenter_a":"Democrats always wanted all black not to progress so they can pen them for their vote every election for a hand out then abandon them for 3 to 4 years.And the cycle goes on and on.","post_message":"DETROIT POLICE FORCED To Call Out BOMB SQUAD To Protect Trump From Hillary Supporters Offended By Speech About Bringing Jobs Back To Blacks…Faith I don't remember seeing a bomb squad when Hillary recently visited Detroit… @webpagelink"},{"comment_id":"982212811884970","commenter_b":"This is so outrageous! Homeless Americans, hungry children,and people out of work and these people live like royalty. They need to be gone.","commenter_a":"shameful","post_message":"This was the Obamas eighth Hawaiian family vacation. The trip has become an annual event for the Obamas. To date, Obama and his family travel expenses total at least $85,029,819."},{"comment_id":"10155456952478797","commenter_b":"His mom was white you racist white hater!","commenter_a":"African american? He's interacial! His mother is white, let's not forget her!","post_message":"Honoring Barack Obama, the 44th President of the United States and the first African American to serve as president. bit.ly/2mfD3IE"},{"comment_id":"936764406358981","commenter_b":"what tits. he was smelling her fart","commenter_a":"\"Joe stop staring at my tits, thanks.\" ~ Hillary","post_message":"Can you imagine? Talk about our country going to hell in a handbasket…"}]
