[{"comment_id":"10153261123996179","commenter_b":"Siiiiiii 😍😍😍😍😍","commenter_a":"@username 😍","post_message":"Puppy bravely protects infant from very evil bad no good hair dryer."},{"comment_id":"10156471247000354","commenter_b":"Yes...IT IS A WAR AGAINST ISLAM SO...your point is?@webpagelink","commenter_a":"Sticking up for your golden Gose?","post_message":"Can't make this stuff up.   It happened this morning. VIDEO on the flipside..."},{"comment_id":"10152859650389877","commenter_b":"Girl, bye.","commenter_a":"It looks like there's another sign that says \"Down\" so, I'm hoping the other sign, which we can't see, says with... Would spell out \"Down With White Power\". I'm curious to know what the colors of the other team are?","post_message":"High school students flash 'white power' signs at basketball game. Read what happened next below.   Grio fam, what should the punishment be 4 this ignorance? #soundoff"},{"comment_id":"447163662137908","commenter_b":"Sinc you obviously are just a walk around, I'll ask you directly. HOW DOES LIMITING THE LAW ABIDING HELP ANYONE?","commenter_a":"You forget one little thing about this video. No matter what type of gun is used, gun laws only make the law abiding victims and give criminals an advantage.","post_message":"When the 2nd Amendment was written, the world did not have machine guns or assault rifles."},{"comment_id":"506386899562882","commenter_b":"@username. Hillary Clinton is nothing but a liar and a criminal. Her whole life is been about criminal activities.","commenter_a":"Hillary will be the next president for sure","post_message":"Donald J. Trump fans in China?  The U.S. presidential candidate who accused China of stealing American jobs also says the \"people from China love me.\"  Is this really the case?  CNN's Matt Rivers is live from Beijing, China, answering your questions and telling us what people think of the U.S. Republican candidate."},{"comment_id":"692144217642823","commenter_b":"A lesbian trap in a mans body...say what.","commenter_a":"How can Caitlyn get the award for woman of the year if she still has a dick ????","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award.  This is what our world has come to. It doesn't get more absurd than this.  Do you think this is wrong?"},{"comment_id":"10153746096543984","commenter_b":"shut Obama down, stop paying congress until they do their jobs","commenter_a":"not a dime til this is resolved","post_message":"Obama has just announced the number of Syrian refugees the U.S. will take in, and liberals aren't too happy about it.   What do you think the U.S. should do about the Syrian refugee crisis?"}]
