[{"comment_id":"1529798700659483","commenter_b":"Compensate us all for the injuries we suffered because of what our ancestors did. We had no part I f it. Then compensate the Irish remember, \"Irish and dogs, need not apply\" Chinese, italians, \"WOPS\". And then we women, are expecting big checks for years of abuse. Finally, when you finish paying everyone off, well all go to work to pay the huge federal debt you ran up, and will have reached \"slave\"status. I want my check too, otherwise I'm going on wekfare. Get over it. Get real.","commenter_a":"I'm excited. I had an ancestor who fought with Sherman's army....so I certainly will not be required to contribute, and maybe even receive compensation for the hardship he endured.","post_message":"BREAKING: Obama Just Announced That He Will Be Forcing You To Compensate Blacks For Slavery.  The slave trade was hundreds of years ago, get over it.  Will you pay up?"},{"comment_id":"10153302851129087","commenter_b":"@username Medicare advantage.","commenter_a":"The ACA made billions in cuts to medicare.......","post_message":"\"[W]hy do Republican politicians keep bringing up the idea of cutting or eliminating Medicare, a losing proposition among every voting group, including Republicans?\""},{"comment_id":"10153230104286051","commenter_b":"I agree with that woman keep your garbage with you","commenter_a":"Just a ? For all who are being so harsh. Witch one of you would want that sign by the grave of your loved one. I sure wouldn't want it by my nephews grave. He died from a drug over dose. Oh yes I fully understand and can see both sides.","post_message":"These grieving parents went to visit their teenage son's grave one day when they noticed something on a tree behind his headstone."},{"comment_id":"10154860386705470","commenter_b":"So why are you flocking to America?","commenter_a":"Of course we should. We should also stop doing drugs, selling drugs, prostitution, eating high cholesterol. What kind of a story is this. No one is advocating hate crimes and there are more hate crimes in India from Hindus and Muslims than almost anywhere else in the world.","post_message":"It’s been a long day for Srinivas Kuchibhotla’s widow, his coworkers at Garmin, those in his home country of India, members of the Olathe community, and those with Indian heritage who live in the US.  “Even though that guy was talking so discriminately about his race, he was still minding his own business... He did not deserve a death like this.\""},{"comment_id":"10152814296572377","commenter_b":"Creepy lady","commenter_a":"and Obama has invited them...","post_message":"Geller stands tall saying \"Give Me Liberty or Give Me Death,\" even though she is being targeted by ISIS. But they aren't just coming for her she says..."},{"comment_id":"10153746708116770","commenter_b":"That's the style whores wear today","commenter_a":"She's need to be excuted !","post_message":"Holy sheer."},{"comment_id":"1420510454708671","commenter_b":"i wonder if there will be a point when the majority, or at least, SOME, Republicans will grow some balls, and say ENOUGH???.....and i just sent an email to both of my state's gutless excuses for elected officials and pledged my unwavering dedication to get their sorry asses whipped come next election...","commenter_a":"Lol your funny Trump you don't have all the control like u think u do lol","post_message":"Got him!"}]
