[{"comment_id":"1432544963425545","commenter_b":"As Usual Asian people don't respect anything. They are doomed!","commenter_a":"Typical Asian - they'll eat anything that moves","post_message":"Their cries will make you question everything you put on your plate. How can anyone treat animals this way?"},{"comment_id":"1039031896153505","commenter_b":"How many immigrants do you personally know? I'm guessing none","commenter_a":"Every one of you idiots came from immigrants","post_message":"The immigrant population in the U.S. is more than 4 TIMES what it was in 1970."},{"comment_id":"898221040294675","commenter_b":"Kill the mother fucker","commenter_a":"I would put a shotgun up his ass and let the trigger fly!","post_message":"Multiple Choice Quiz time, kiddies. I chose option 'C'. What about you? @webpagelink"},{"comment_id":"10153649421859138","commenter_b":"Why would you post such a thing Dan??? Wtf?","commenter_a":"Meanwhile in Chicago this weekend, more people were gunned down by those whose lives matter. But let's not protest that.","post_message":"The Twin Cities Marathon went on today without major disruptions, and police did not make any arrests."},{"comment_id":"10152736436045496","commenter_b":"negative much?","commenter_a":"Where was the GoFundMe started for her? She lost her job after having a gun shoved in her face, did anyone start a fundraiser? If they did was the link shared? Hundreds of thousands of dollars raised in the name of hate and not one single penny raised for a working MARRIED mother who valued her life over a companies money. Yep, this is indeed a \"Christian Nation\".","post_message":"The pregnant Popeyes manager, who was fired less than 36 hours after a robbery, has been offered her job back. See more: @webpagelink Would you go back to work for the restaurant?"},{"comment_id":"10154992215446729","commenter_b":"Stephanie Hallstrom Hillary is from Chicago.....send her back there. They grew her. They can keep her.","commenter_a":"You can see her jerking several times prior to falling / collapsing. Clearly from a seizure people know the difference. She should stop her thirst for greed and power and live her life and take care of herself in the private sector for herself and the American People. It was not weather people were there saw others in worse health and heavier clothing...she came out wearing same clothes as before. She is not well. Go Home Hillary!!","post_message":"Help get this out there, folks! People need to know the TRUTH."},{"comment_id":"10153273305921051","commenter_b":"Sick ass Mother fucking Bastard, needs to be castrated and beat to death so he can feel the pain that poor baby felt, it just sickens me to hear of these evil people in the world.","commenter_a":"Convicts will likely shove reality up his ass!","post_message":"This guy did something awful to a 19-month-old girl. Now he's going to face the consequences."}]
