[{"comment_id":"10153321709602217","commenter_b":"shes dissolving the trends in the fashion world","commenter_a":"Nigeria is looking for their 2016 budget","post_message":"She's fronting a campaign called the \"Face of Courage\"."},{"comment_id":"459815194143521","commenter_b":"I personally just don't give a shit. They can walk around naked as a jay bird for all I care. But I'll bet other women would be the ones that bitch the loudest.","commenter_a":"this means that we can have video games and movies with naked women in them ??","post_message":"Female nipples are causing an internet storm & here's why: #FreeTheNipple"},{"comment_id":"734527313335610","commenter_b":"Corina doesn't have a head occupying her brain. She doesn't seem to be aware that Jews have been \"occupying\" that region for 4000 years.","commenter_a":"State who creates biggest terror in the world since 1948 doesn't know anything about human rights.","post_message":"Iranian President Hassan Rouhani famously said in 2013 that ethnicities, all religions, even religious minorities, must feel justice..."},{"comment_id":"10152871405466717","commenter_b":"I remember seeing this it really touched my heart loved it!!! And those moms can suck it!","commenter_a":"Moms... eat shit and die! Hypocritical, bigoted ass-holes..... 1,000,000 Moms = about 12 homophobic morons!","post_message":""},{"comment_id":"10154420630831378","commenter_b":"That's because she's a big liar too","commenter_a":"And less than 7 hours ago Kellyanne Conway said the White House has full confidence in Flynn.","post_message":"#BREAKING National security adviser Michael Flynn has resigned. @webpagelink"},{"comment_id":"10153376239848984","commenter_b":"Kill the fucking idiot","commenter_a":"He is now someone's girlfriend...","post_message":"He stabbed a police officer 14 times and what he said here was even WORSE. Do you think this criminal deserves life behind bars after this?"},{"comment_id":"10153602906656509","commenter_b":"You can buy them too.","commenter_a":"I think she means she wants to make a lot of money. Those GEDs aren't cheap.","post_message":"Is America ready for #marijuana moguls? Follow one young couple's journey as they attempt to franchise legal marijuana @webpagelink #HighProfits"}]
