[{"comment_id":"10153002802946051","commenter_b":"Why do these girls think they can just come and do as they please and disturb ppl....that's good he wacked her off the desk...pinche mocosa pendeja","commenter_a":"Seriously? These kids might as well start applying at the dam circus","post_message":"This student was just sitting there, not taking part in any of the craziness, when one of the dancing girls decided to step forward. It didn't end well."},{"comment_id":"513918755467368","commenter_b":"Screw that fat ass bitch","commenter_a":"Her and the view should of been gone long ago","post_message":"Joy Behar took a turn attacking the mother of the Benghazi victim. #RNCINCLE"},{"comment_id":"10153590500421409","commenter_b":"she is full of herself","commenter_a":"Wow what kind of so called \"FRIEND\" is she. Can't even be happy for Michael. So much drama. Nobody needs a friend like that.","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."},{"comment_id":"1180596495393685","commenter_b":"We ain't going to miss you don't let the door hit you on the way out","commenter_a":"He accomplish nothing but racial tension","post_message":"Here is how Americans feel about Obama as he leaves office. Are you proud of what he accomplished for our country?"},{"comment_id":"967606389917498","commenter_b":"YOU're gross.","commenter_a":"gross. why did you have to post a photo?","post_message":"The most sexist obituary you've ever seen"},{"comment_id":"10153106152611336","commenter_b":"Imagine, Christian leaders to lead a Christian group? Lol!","commenter_a":"Maybe Cal state I should be recognized","post_message":"A Christian organization at California State University, Stanislaus has been de-recognized because the group wanted its leaders to be Christian."},{"comment_id":"10157147438325354","commenter_b":"Mariah, pull your panties out of your crack.","commenter_a":"LOL Calvin Klein clothing. Made for dainty feminine pajama boys with no shoulders and 24\" waists.","post_message":"Kendall Jenner, the lurid Calvin Klein PHOTOS, and the major PR backlash..."}]
