[{"comment_id":"10156349571840354","commenter_b":"Racist illegals","commenter_a":"We deport your sorry ass, illegal!","post_message":"Brace yourselves.  Amnesty activists just launched a VIDEO that EVERY American should WATCH..."},{"comment_id":"1146246835410774","commenter_b":"Yes is no and no is no! Stupid males! Raaarg","commenter_a":"Dennis Kiil Andersen Mats Hellan Tobias Berntsen @username Magnus Nadheim sykt at denne artikkelen faktisk er legit og ikke laget for tull","post_message":"It's not just 'no means no' and 'yes means yes.'"},{"comment_id":"1123039051096182","commenter_b":"'@username Y u so MAD!","commenter_a":"Everyone who verbally attacks BLM are silent supporters of the kkk!! Show me why u hate BLM so much. Show us pics of the smiling around a dead white person or any other ethnic groups body!!! U can't so fuck u","post_message":"Lol: #Virginia #police pulls a woman over for driving without an ice cream cone!  #WSHH"},{"comment_id":"460052980821324","commenter_b":"Put the pussy on the chain-wax","commenter_a":"This headline is complete and utter garbage click bait bullshit. Mumford & Sons had nothing to do with THE CITIES/RESIDENTS. You can't blame a band for the amount of fans they attract, they're grammy award winning musciams coming of a 2 year hiatus after releasng a long awaited album. The city is the problem here for using this 'cleanout method' which they are literally treating these people, HUMAN BEINGS, like trash and obviously have no problem using terms that state that. Blame the city not the band, oh and actually read the article.","post_message":"Not cool."},{"comment_id":"1193491007392830","commenter_b":"'@username she better pray that she does. Her crooked butt will see prison bars.","commenter_a":"Horrifying? No, what is horrifying is you ignoring the pleas for help from four Americans, for 13 hours, while they were tortured, raped, and murdered, you evil witch.","post_message":"Debate question: Will Donald Trump accept the results of the election?  Donald J. Trump: “I will tell you at the time. I’ll keep you in suspense.”  Hillary Clinton: “That’s horrifying.”"},{"comment_id":"683824238474821","commenter_b":"STFU you pussy. Why don't you go join ISIS.","commenter_a":"Really? This is just pathetic. Who in their right mind would even think if suing someone because they offered a book bible or not. The soldier is not fit to be in the military. All he had to say was he was an atheist. Unless he is to ashamed too.","post_message":"An Atheist soldier is suing a Christian soldier for recommending the bible. This is blown way out of proportion. Let's backup this christian soldier. Can we get 50,000 'LIKES' for this soldiers commitment to god?"},{"comment_id":"1296273287105505","commenter_b":"You can go to hell liar","commenter_a":"Thank you president Obama. You will always be my president . The orange one will never be able to walk in your shoes he is a lier and con man and most of all a racist sob. Never put president before his name.","post_message":"'That's what separates us from tyrants and terrorists.' Nearing the end of his presidency, President Obama shared his hopeful vision of America's future."}]
