[{"comment_id":"520938298031470","commenter_b":"This woman isn't on benefits","commenter_a":"It does make you think!!! As I pay out per week for my sons bass guitar lesson, each Saturday for my daughter to spend the day at the stables....school trips etc. ....and still moan about having no money, whilst running two cars and paying for three seats at Bath rugby...plus drinks!! This has put my \"poverty\" into a proper perspective...and changed my opinion of ALL people on benefits being the same. Good luck to her and her family.","post_message":"Kathleen Kerridge’s family food budget is £40 per week – to feed five people. She says there is a big gap between the public perception of poverty and what it means for people like her. We should stop talking about poverty, she argues, until we know what being poor in this country really means."},{"comment_id":"10155045713159073","commenter_b":"Risking war lol? You do realize that we would utterly destroy Mexico in less than a few weeks. Mexico would never declare war on us.","commenter_a":"We're is your proff..........for this post","post_message":"A wall would do little, if anything, to stop the flow of illegal drugs - the majority of which are actually smuggled though checkpoints."},{"comment_id":"10150922009204999","commenter_b":"Oh shut up!","commenter_a":"Let us have a rich street thug unfit to be a watchman of your house as Pres and ruin US. Anything that goes up should be his argument after 5 years. Pathetic","post_message":"Donald J. Trump talked to Billy Bush about women in vulgar terms, in a 2005 video obtained by The Washington Post."},{"comment_id":"10154274724531320","commenter_b":"Let us see the lady you're talking to.","commenter_a":"Where is Greg?","post_message":"Good Day After Show!"},{"comment_id":"1682640372017419","commenter_b":"I'm not gonna even comment on this ignorant racist bitch 🤐","commenter_a":"@username Sundae Vibes","post_message":"Anchor Upset Beyoncé Wants “An Overthrow Of White Domination\""},{"comment_id":"1003069729713383","commenter_b":"Can they impeach her?","commenter_a":"Don`t forget she too has her rights, if you think some one has the right to forget his or her gender then she has the right to forget her job","post_message":"Davis, who returned to work on today, told a news conference any marriage licenses issued would not carry her name, title or her personal authorization. She added she would take no action against deputy clerks who issue licenses, although she does not believe they have the authority to do so. Read more: @webpagelink"},{"comment_id":"477818462421667","commenter_b":"Good for him, we support him 100%. If the Muslims can burn our Flag we can burn theirs.","commenter_a":"Burn it!!! And send it back to hell where it came from.","post_message":"VIDEO: College Students Burn ISIS Flag And Muslims Are Outraged. SHARE to support these students are taking a stand against those ISIS pigs!"}]
