[{"comment_id":"516205071910642","commenter_b":"The white lady isn't a part of the scam, but she made upwards of a million dollars in a year, okay ojay,we believe that the white woman's hands are clean, not!!!","commenter_a":"This a way to steal African children, a form of modern day slavery. African children was stolen from their parents over 400 years ago, and they were paid to do that then. What is wrong with you people?","post_message":"Watch How Thousands of Children Are Currently Being Stolen From Africa"},{"comment_id":"10154284155303908","commenter_b":"Alexandria Lindquist Larry bought the lease for 14 million, Bumped up his policies just prior and netted a 4.5 bn dollar payout. Funny that!","commenter_a":"Tallest structure in the world. Located in the middle of one of the largest and most populated cities. And you're telling me that the developers didn't take into account the possibility of the structures collapsing? I think they did. And in the midst of a terrorist attack, the split second decision had to be made; whether or not to take down the Structures in a controlled explosion ( which was probably designed during conception ) How would they have known whether or not any more explosives were going to go off? Tough call","post_message":"Were the twin towers, and more specifically, building 7 blown up by bombs on 9/11? Researchers at the University of Alaska are about to find out."},{"comment_id":"10153281305806770","commenter_b":"Ladies need to have a knife, walk in pairs and stab to death the attacker. Do not attempt to wound.","commenter_a":"MODERN GERMANS NOT ACCUSTOMED TO ANIMALS","post_message":"The Cologne Carnival kicked off Thursday with 22 reported cases of sexual assaults, including two rapes, despite increased security."},{"comment_id":"1547989355230019","commenter_b":"@username I hate Hillary but when you say she killed four people you sound crazy.","commenter_a":"Wow all these libtards hating on Hannity. What about all your bais media reporters? ??? They bend over and let Hilary use her strap on to them Cnnn already said Hilary won the next debate . When she didn't win the last . Is he going a little overboard yes. But let's face facts , if he was saying the same things about Hilary. He would be a genius in your eyes.","post_message":"What a week."},{"comment_id":"814574258686460","commenter_b":"The ladies of The View were rude and disrespectful. It seems like they only invited you on the show to badger you. Whoopi is worse than Bill O'Reilly. She kept interrupting you & would not let you get your point across, and Joy just laughed at everything you said like it was some kind of a joke. They don't care about their guests' viewpoints at all. I have to say that I admire you for being the great person that you are.","commenter_a":"Thank you, Dr. Carson, for remaining the gentleman you are while on The View today. I must say I stopped watching that show years ago. I watched today because you were on. I have great respect and admiration for you. Donald Trump is not my first choice for President. I will vote for him if he is the Republican nominee. Maybe some of your calmness, thinking before you speak, will rub off on Donald if he is nominated and elected President. The women of The View are not my cup of tea. I turned the show off as soon as your segment was over.","post_message":"I would like to thank the Ladies of The View for having me on. Though we disagree on politics, the beautiful thing about America is that we're able to have platforms where we can discuss those differences. I will continue to work hard to ensure that this remains for generations to come."},{"comment_id":"510533845803862","commenter_b":"Leave you camel humpers","commenter_a":"get OUT","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"10154592681344445","commenter_b":"Yup, they are trying to invade the US as we type. Better build that wall.","commenter_a":"Now that half the Republicans in the house have been officially brain-washed, his confirmation will take place. This country will be taken over by Islam, when it happens. Bad news for women and gays.","post_message":"\"I am confident he will serve the American people with integrity and a steadfast commitment to justice,\" the president said. @webpagelink"}]
