[{"comment_id":"10153871706276051","commenter_b":"Who wears Crocs anymore?","commenter_a":"Debbie Pruitt French","post_message":"Do you wear Crocs? If so, you're probably going to want to stop ASAP."},{"comment_id":"1773749052877981","commenter_b":"So full of CRAP Hillary.","commenter_a":"Hillary is such a liar. Only person under investigation is Hillary and her staff... Yet Hillary tries to turn it around, LOL.... Hillary is such a liar.","post_message":"WATCH LIVE: Hillary Clinton speaks to supporters in Ohio. Ohio is a crucial swing state in the election."},{"comment_id":"10153286809849726","commenter_b":"She is a racist","commenter_a":"What a loser ..Disgrace to the United States..","post_message":"WATCH: Ann Coulter Blasts Michelle Obama on Race: 'I Think She's Just Letting Out Her Reverend Wright Now'"},{"comment_id":"10153385478086756","commenter_b":"Real women do what they want to do. Feminism is about equality not which activity you prefer to do.","commenter_a":"real women go outside and play.","post_message":"Maddie found that in many video games, she could unlock the female characters by playing the game and amassing credit, but that could take hours. Or she could buy the character. On average, the female character cost $7.53."},{"comment_id":"1049317721755905","commenter_b":"full retard mode: engaged","commenter_a":"This is the evidence of existence of Allah !!!","post_message":"Our brains are truly amazing.  By Emily's Quotes, via AsapSCIENCE."},{"comment_id":"10153719642089091","commenter_b":"@username so you've gotten an infection from using a public restroom ?","commenter_a":"Why would you let your 8 year old daughter go to a public bathroom by herself??!! Smdh.","post_message":"Thank goodness for the customers and staff members who helped rescue the 8-year-old after her mother heard her scream. Police say the man was caught carrying the unconscious girl into a bathroom stall."},{"comment_id":"880575888650866","commenter_b":"The christians and jews cause more terror","commenter_a":"muslim are terrorist i repeat","post_message":"An Ohio man accused of plotting a terrorist attack on the US Capitol says before his arrest he was planning to go to Washington, DC and shot President Barack Obama in the head.  Full story: @webpagelink"}]
