[{"comment_id":"1199381900178382","commenter_b":"They were not illegals!!","commenter_a":"#WomenAgainstSessions #LGBTQAgainstSessions #MinoritiesAgainstSessions!!!!","post_message":"WATCH: The Senate Judiciary Committee meets to vote on Attorney General nominee Sen. Jeff Sessions, hours after the firing of the acting attorney general. Read more: @webpagelink"},{"comment_id":"10152804036658145","commenter_b":"I disagree... there are less and less males signing up to become priests ...Ireland of all places had 1 ..yes that is right 1 ordained priest last year...they either open the doors to the females soon or people will have to do their own masses...","commenter_a":"I kind of believe this Pope Francis might be very welcoming to having female priests...Congrats on reaching your life long dream...","post_message":"CORRECTION: While the woman was ordained through a non-denominational church, and she considers herself Catholic, the Catholic Diocese has not responded to WFTV's story and she has not been ordained by the Catholic Church. Rita Lucey says she faces excommunication from the Catholic Church, but would rather fulfill her lifelong dream of becoming a priest."},{"comment_id":"432628273528434","commenter_b":"\"Riot Whores\" want to get paid? Tip: a smart whore always gets paid BEFORE the act!","commenter_a":"Soros wanted them, now pay them you socialistic pig!","post_message":"You might agree that these greedy people are missing the whole point."},{"comment_id":"10153086832391051","commenter_b":"She looks like she is fat enough to go to HELL, sweathog","commenter_a":"Well damn i'm moving over there wht","post_message":"This woman killed someone. She says she doesn't belong in jail for one reason and one reason only."},{"comment_id":"1324204954284728","commenter_b":"This is the future of the Democratic Party. She's sick .","commenter_a":"Thank goodness she got what she deserved.","post_message":"While out preaching on the sidewalk, a man was shocked to see a woman quickly approaching. Unfortunately, things would take a horrifying turn as the vile woman pulled something from between her legs and decided to gift him with it – but she wouldn’t be laughing just a few short days later. @webpagelink"},{"comment_id":"418030251654903","commenter_b":"Why not, she gets away with murder!!","commenter_a":"Bad, evil, lying laugh quack! 👎","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"},{"comment_id":"10152888732626680","commenter_b":"This recent ruling by the Supreme Court on gay marriage is only about civil unions. Those who are making this about church unions could not be more wrong as the Majority Opinion of Justice Kennedy points out: \"Finally, it must be emphasized that religions, and those who adhere to religious doctrines, may continue to advocate with utmost, sincere conviction that, by divine precepts, same-sex marriage should not be condoned. The First Amendment ensures that religious organizations and persons are given proper protection as they seek to teach the principles that are so fulfilling and so central to their lives and faiths, and to their own deep aspirations to continue the family structure they have long revered.","commenter_a":"Here come the lawsuits from the States!","post_message":"The Supreme Court has legalized gay marriage nationwide by ruling that the U.S. Constitution bars states from denying marriage licenses to same-sex couples. Full story: @webpagelink The landmark, 5-4 decision split the court along the usual ideological lines, with Republican appointee Justice Anthony Kennedy joining the court’s liberal wing to back same-sex marriage rights and the court’s remaining GOP appointees dissenting. Before the court acted Friday, 37 states authorized marriages by same-sex couples, but most of those states did so due to court rulings that could have been overturned if the Supreme Court reached the opposite result."}]
