[{"comment_id":"525207624325250","commenter_b":"Call girl wife! And not melania. Haha","commenter_a":"Can't wait! Donald has something huuuugggee. Haha lyin Ted. Spill the beans just before next primary voting!","post_message":"Ohhh boy....  You know about this, right?"},{"comment_id":"550730825100820","commenter_b":"Smash these racist fucks with the same pipe, then hit them in the throat with it.","commenter_a":"Public beating","post_message":"Black Thugs Smash White Girl's Face With Metal Pipe For This Unbelievable Reason  This is horrifying. Imagine if this was your daughter.  What punishment would you want for them?"},{"comment_id":"10154949382818010","commenter_b":"Amen Danny. This Ed guy is Obamas gay boyfriend.","commenter_a":"Where do you think they learned that from? Very close ties to the Obama administration, and of course, \"we're with her\" too.","post_message":"You're not supposed to say, “I think we broke the law,\" even in internal emails, according to the lawsuit."},{"comment_id":"1000660886660326","commenter_b":"Send her to Pluto to cool off!","commenter_a":"I bet her mother is sooooo proud...","post_message":"'I'm not really ashamed'"},{"comment_id":"10156250216360354","commenter_b":"Twisted woman","commenter_a":"So, she is trying to say she is with them as a fellow commie? I think someone farted.","post_message":"Yeah, so, um, this happened..."},{"comment_id":"10153372391166509","commenter_b":"Chris? Am I? Interesting. Here I thought I was just pointing out the facts! :)","commenter_a":"Gotta love Global Warming!","post_message":"It's so cold, #NiagaraFalls froze. Photographers were drawn to the breathtaking icy formations: @webpagelink via CNN iReport"},{"comment_id":"10153428324682293","commenter_b":"Yes but she identify as female sexually fluid","commenter_a":"My daughter is sexually fluid, she identified herself as a lesbian during high school years and she wasn't allowed to have girls sleep over ( unless they were childhood friends), my other two daughters were not allowed to have teenager males sleeping over.","post_message":"\"I wouldn’t have dared bring a boy into my room while I was in high school. Do the same house rules apply to same-sex relationships?\""}]
