[{"comment_id":"814364195330989","commenter_b":"Do that shit over here!","commenter_a":"and they wonder why most of Americans don`t want them here,Trump is right.Not all muslims are killers,but how would we know>?","post_message":"VIDEO: This is What Muslims Did in The Streets After Orlando Massacre…"},{"comment_id":"535308666651013","commenter_b":"Go Hillary!","commenter_a":"One thing is clear, They are terrified of Hillary and they hate America. Smh","post_message":"A twisted mindset."},{"comment_id":"1619826891648925","commenter_b":"@username Killary's hips are evidently widening. Must be all the hot sauce and watermelons she stashes in her pants.","commenter_a":"Why I'm backing D.T., he's against the establishment, can't stand Obama & Hillary, called out lying Cruz, wants America first, he doesn't come from a political family, treats his 30,000 employees with respect, supports law enforcement, will put a border up, deal with illegals & radical muslims, doesn't act like a scumbag politician, he's not part of the \"Good Old Boys\", helps military and families, great family man, very passionate about this country & the citizens, doesn't take BS from anyone and wants to Make America Great Again! #VoteTrump2016","post_message":"FLORIDA -- THANK YOU --- WE CAN WIN! Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"484244465097180","commenter_b":"Why does anyone listen to her?","commenter_a":"PIG","post_message":""},{"comment_id":"1241762795876481","commenter_b":"SPEAK FOR YOURSELF I AM.NO MUSLIM IN NO WAY","commenter_a":"NOT ME, OLD MAN!","post_message":"Come again???"},{"comment_id":"1452044741482218","commenter_b":"You need to put down your crack pipe that crap has fried your brain; dumb witch","commenter_a":"Democrats r a bunch if liars ..republicans are honest and classy","post_message":"\"I knew Ronald Reagan. I worked for Ronald Reagan. Donald Trump, you are no Ronald Reagan.\"  -Republican Doug Elmets says he's voting for a Democrat for the first time in 40 years.  More: @webpagelink"},{"comment_id":"10154633221506162","commenter_b":"Chelsea so this was my bike ride","commenter_a":"Lexi","post_message":"Cool clouds rolling over the Chicago area!"}]
