[{"comment_id":"593124330856614","commenter_b":"@username where did she go?","commenter_a":"I hate Donald Trump, but these idiots are playing right into his rhetoric, and not doing anything but acting like thugs.","post_message":"Watch: Protesters set fire to a Donald J. Trump supporter's hat.  Read more about the San Jose assaults here: @webpagelink"},{"comment_id":"10153353457471037","commenter_b":"@username he fondled them vaginally. He violated them. Fine line when denying it is rape...","commenter_a":"How can they know he touched his sisters and allow him to continue to live in their home?","post_message":"Josh Duggar of 19 Kids and Counting is embroiled in scandal"},{"comment_id":"10153112038031770","commenter_b":"We need TRUMP we need the wall 11 mil illegals today 25 mil tomorrow when will it stop !!!!! North Carolina here voting TRUMP 2016","commenter_a":"And just another reason NOT to have this trash in our country!!!","post_message":"The District of Columbia started issuing drivers licenses to illegal immigrants in 2014, and now some are complaining because the process takes longer than they would like."},{"comment_id":"10154164626642293","commenter_b":"This is so very tragic and sad. Based on the videos that have been released, this officer appears to have fired for no reason. Police need to be held accountable, just like everyone else, when they break the law.","commenter_a":"And we need female policepersons exactly why?","post_message":"Officer Betty Shelby has been charged with manslaughter for the shooting of Terence Crutcher."},{"comment_id":"10154822738529369","commenter_b":"You know she had to be shitting her pants up there","commenter_a":"Shell be alright it another Trump curve ball","post_message":"A Clinton campaign representative told NBC News that the campaign had \"no idea\" what Comey was referencing in the letter he sent Congress on Friday."},{"comment_id":"10154027986557293","commenter_b":"She might Not be a ten but she still has Some Nice tits","commenter_a":"Can i drAw your Attention to an unrelated issue though; Chelsea , Being a mildly Hot Chick, is married to a nerdy looking dude with Glasses. I absolutely hate iT when beauriful women marry or have a relationship with nerdy looking men","post_message":"Ivanka Trump says she supports working moms. The women who design her fashion line don’t get paid maternity leave."},{"comment_id":"10153057043503984","commenter_b":"Kick her dumb ass out of office!","commenter_a":"NO!!!!!! We the people need to come together and figure out what to do about these people. No one in Washington is.","post_message":"I guess she's revealing her true intentions behind becoming someone in power... I wouldn't want to live under her rule.  Do you think this new mayor should be allowed to put restrictions on the Constitution?"}]
