[{"comment_id":"10153544587506350","commenter_b":"Real women dont need all that! They are content with the gift of life they just grew in their body for months!!!! This is a little overkill.","commenter_a":"Oh good grief...isn't the baby enough to show off? Must one be materialistic to have to have a push ring?","post_message":"Push presents (the bling or gift an expectant mom is given for, um, pushing) are getting more and more popular."},{"comment_id":"853806161323392","commenter_b":"Ya I always thought she was odd shaped... not anymore. Taylor is way hot","commenter_a":"Smart girl: screw the paparazzi out of a big pay day and staying true to her values; all while looking gorgeous and being a positive role model for girls everywhere.","post_message":"She had a good reason – and it wasn't vanity."},{"comment_id":"10153395340948984","commenter_b":"She's the one who put the hatred for America in his heart, she should be deported immediately!","commenter_a":"Give her the same!!!","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing... Do you think this Boston bomber got what he deserved?"},{"comment_id":"10153648874092060","commenter_b":"You made Nola.com Michelle!","commenter_a":"Tammy, we should have gone to target last night instead!","post_message":"Metairie Target shoppers got a little help with last-minute Father's Day shopping last night from a special guest – New Orleans Saints Quarterback Drew Brees."},{"comment_id":"1231714623549367","commenter_b":"She will fit in better there, anybody who watched Fox on election night knew how desperately she wanted Hillary to win!","commenter_a":"Good bye bye democratic stooge","post_message":"BREAKING: BUH-BYE MEGYN…The Woman Who Miscalculated Her Power With Viewers Is Leaving FOX To Join Liberal, Anti-Trump NBC"},{"comment_id":"10153757238999411","commenter_b":"Maria J Haloho A slut will be a slut anywhere","commenter_a":"Most Arabs are depraved sexual predators.Anyone who has ever seen Arabs on holiday in a European country can confirm that","post_message":"'Obviously neighbors aren happy about it, but it is what it is'"},{"comment_id":"10154939979936729","commenter_b":"she belongs behind bars","commenter_a":"Hillary Clinton goes to a gifted-student primary school in New York to talk about the world. After her talk she offers to answer questions from the kids. One little boy puts up his hand. Hillary asks him what his name is. \"Kenny,\" he says. \"And what is your question, Kenny?\" she asks. \"I have three questions,\" he says. \"First -- what happened in Benghazi? \"Second -- why would you run for president if you are not capable of handling two e-mail accounts? \"Third -- what happened to that six billion dollars that went missing while you were Secretary of State?” Just then the bell rings for recess. Hillary tells the students that they will continue after recess. When they resume Hillary says, \"Okay, where were we? Oh, that's right, question time. Who has a question?” A different boy -- little Johnny -- puts his hand up. Hillary points to him ...","post_message":"Yes. She. Did."}]
