[{"comment_id":"10153103857862377","commenter_b":"I think a woman who has been victimized should be allowed to regain control of her life. She should not be required to Continue a pregnancy she doesn't want","commenter_a":"But what about the women in those cases! Shouldn't they be in control of their bodies after being violated so inhumanly? Of course they should! I just lost lots of respect for you! You can't make judgements on those women or decisions for them! Someone has to stand up for them!","post_message":"\"Rape and incest, I would not be in favor of killing a baby because the baby came about in that way. And all you have to do is go and look up the many stories of people who have led very useful lives who were the result of rape or incest,\" Carson said."},{"comment_id":"859334654119032","commenter_b":"Btw, military grade doesn't always mean what you think it means.","commenter_a":"There is no such thing as an assault rifle. It's a made up term to scare ppl.","post_message":"DEVELOPING - Father of Patient Takes Hostages at Houston Hospital with Rifle   Hoping for a peaceful resolution."},{"comment_id":"1678080125806065","commenter_b":"THE ONLY GOOD FILTHY MUSLIM IS A DEAD ONE.........KILL ALL THE BARBARIC BASTARDS........KEEP THEM OUT OF THE UNITED STATES....THERE IS NO PLACE IN THE WESTERN WORLD FOR SUCH 3RD. WORLD SCUMBAG BASTARDS LIKE THEY ARE.......GOD BLESS HIM AND HER FAMILIES......ODUMMER IS TO BLAME FOR THE RAPES AND KILLINGS HIS BARBARIC BROTHERS ARE DOING.....HE HAS COMMENTED MURDER FROM LETTING THOSE BASTARDS INTO \"OUR\" COUNTRY.....ODUMMER IS TO BLAME FOR ALL THE RAPES AND KILLINGS THOSE MUSLIMS ARE DOING............HE SHOULD BE BROUGHT UP FOR TREASON AND MURDER JUST LIKE KILLARY.........","commenter_a":"Oh yeah, we need to b ring them all here with their religion of love!!!!When is our government going to wake up and smell the coffee????","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack  This is tragic. His died with honor, let's send our prayers for his family.  Can we get 100,000 'LIKES' for him and his family?"},{"comment_id":"883354948459698","commenter_b":"Literally you're the only person I could think of that would find this as interesting as I did.","commenter_a":"@username this cell has no mitochondria and is kicking, but my phone dies on 15% #whatatime","post_message":"Time to rewrite the textbooks again."},{"comment_id":"493684487507628","commenter_b":"Keep em out our we go the way of Europe. No Trojan Terrorists!","commenter_a":"Vet everyone coming in","post_message":"“No. I would not allow people to come in from Syria. They’re not vetted properly. They’re moving in by the thousands.”   Donald J. Trump reaffirmed his commitment to a ban on Muslims immigrating to the United States, arguing that it is better to build \"safe zones\" in Syria. What do you think?"},{"comment_id":"10154291212970329","commenter_b":"hahahaha!! for real though!","commenter_a":"Hahaha @username Alyssa Purnell Mimi Zink @username @username","post_message":"oh heeyyyy (via So Relatable)"},{"comment_id":"1681685855452013","commenter_b":"Joke...","commenter_a":"Jail and no bail.","post_message":"President Obama is taking guns out of all forms of entertainment.  This is ridiculous. He can't get away with this.  Do you think he is abusing his power to push his propaganda?"}]
