[{"comment_id":"628028950680040","commenter_b":"Finally intelligent smart women say what the leader of this country needs to say. It's simple as that. They could prevent this attack they chose to be Muslim lovers.","commenter_a":"Yes sir I have many.","post_message":"\"Get a gun. Because this government ain't in a position to help.\" – Judge Jeanine Pirro bit.ly/1UgPEW4"},{"comment_id":"10153220983921770","commenter_b":"@username Then why did her husband push Trump to run?","commenter_a":"Trump is nothing but a Clinton crony who is trying to split the Republican vote to ensure a Clinton win. He is NOT a Conservative! @webpagelink","post_message":"After PolitiFact found that Donald J. Trump's first television advertisement uses footage of immigrants pouring over the Morocco-Spain border instead of the U.S.-Mexico border, the Trump campaign gave a blunt response to NBC News."},{"comment_id":"10154399903958797","commenter_b":"Idiots!!","commenter_a":"And then people wonder why they are shot. First responders should be licensed to carry and use if needed.","post_message":"WHO DOES THAT?! Two people have been charged with scratching and hitting paramedics on a Red Line platform in the South Loop Sunday night. Officials say the suspects walked up and hit the responders in the face and body before spitting in their faces."},{"comment_id":"484907421700536","commenter_b":"What an idiot, move to another country with the other celebrity dumbasses.","commenter_a":"His opinion matters?","post_message":"And that's not all Patton Oswald said either..."},{"comment_id":"254814161629338","commenter_b":"She is a big mouth stupid bitch . They all are","commenter_a":"Can't watch this show anymore...it's all about political bashing.","post_message":"The View host Joy Behar just launched an attack on Barron Trump. This is terrible. She should be absolutely ashamed. Can we get 10,000 'LIKES' to have The View cancelled!"},{"comment_id":"10154880634893984","commenter_b":"Move out!","commenter_a":"So, who packs there bags first","post_message":"Just as Trump begins to defy the odds, Hollywood is losing it in an unforgettable way..."},{"comment_id":"838151202944602","commenter_b":"Perhaps she is trying to prove that while she is a Loser at every turn...she is no quitter. She enjoys Losing!","commenter_a":"Why do these people waste money to this degree ??? She's got no shot not even remotely possible . I'm just sayin ....what is the purpose of this ???","post_message":"Her presidential campaign just went down in flames."}]
