[{"comment_id":"471937499632872","commenter_b":"Give it up lady. Your lies won't work with me.","commenter_a":"He's what a president should be and it's a shame the next won't try half as hard as he did.","post_message":"'When they describe their youth and their childhood, these are young people who made mistakes that aren't that different from the mistakes I made.'"},{"comment_id":"549265795241268","commenter_b":"Those boarders should never been opened... Obama fault all the evil happening in the world, is all due to Obama turning loose the Muslim maggots and Mexicans by mostly the Muslims... Their eating up all the good stuff in the world just like maggots do and ruining everything!!!!","commenter_a":"Yes","post_message":"BREAKING: Mexican Military Invading US, Begin Shooting Texas Residents.  We Trump's wall now. This is getting out of hand.  Do you think we should close our borders?"},{"comment_id":"1092995934129991","commenter_b":"Who has Hillary been taking campaign money from? Can you even make the connection lol","commenter_a":"I wonder why @username won't report the latest WSJ national poll. @webpagelink #ImWithHer #HillYes","post_message":"Electability has become a cornerstone of Hillary's campaign."},{"comment_id":"10152785064574753","commenter_b":"Still, those girls can probably sue state of Montana.","commenter_a":"So when he was a sex offender where was social services to take the girls away! Now look at how he has damaged his grand children. He should be hung!","post_message":"A Montana man was sentenced to 200 years in prison for impregnating his 11-year-old granddaughter and sexually abusing her little sister. Although he was a previously convicted sex offender, authorities confirmed 55-year-old Makeal Shane Pruett was the legal guardian of both girls."},{"comment_id":"10154479942176509","commenter_b":"It's why we need the wall","commenter_a":"I wish the people of Mexico could do something to rid their country of all the corruption and hideous violence there. They deserve so much better.","post_message":"Five years ago Carlos Gutierrez had his legs cut off by Mexican police officers after not being able to give them extortion payments.  Today, he'll join a group of 400 people receiving blessings from the pope."},{"comment_id":"10152800967581545","commenter_b":"I'm with you on that","commenter_a":"Thats why i don't let my kids go to other peoples houses. I know im responsible but are they?","post_message":"Police investigated the death of a 13-year-old Garland boy as a possible suicide but later determined his friend likely shot him while the pair were playing with a gun they thought wasn't loaded."},{"comment_id":"1180323918655284","commenter_b":"My cats r broken, both are at best apathetic toward boxes, at worst terrified of them, depending entirely on size and location","commenter_a":"Elizabeth Dain","post_message":"Happy international cat day!  Here's a question for you - why do cats love boxes so damn much?  Find out: bit.ly/1zUeu4c"}]
