[{"comment_id":"1698243613797536","commenter_b":"@username u racist chink","commenter_a":"Dimash Shayan we gotta do this","post_message":"Japan is hiring full-time ninjas!!!"},{"comment_id":"10153633420073132","commenter_b":"Keep up with the misogyny","commenter_a":"These are the lowest life, vilest example of human being that exist today. And that's the best that I can say about them.","post_message":"\"We aren't sisters, we never were. We just dated the same guy at the same damn time.\" - Kendra Wilkinson on Holly Madison"},{"comment_id":"1205288416198545","commenter_b":"in tears watching this. God keep him with you and give the family strength and patience to heal.","commenter_a":"Priceless....God bless this little tyke and his family and friends..","post_message":"WATCH: 6-year-old boy killed in SC school shooting laid to rest dressed as Batman at superhero-themed funeral: @webpagelink"},{"comment_id":"10153696558342629","commenter_b":"SO MANY fucking people are up in arms for this person. Unless her mental illness was so severe, that she couldn't have had the slightest idea that driving into a crowd of people was a BAD thing to do, then I don't think her being an angry, evil nut job is enough to let this thing off the hook.","commenter_a":"Is anyone surprised that Adacia Chambers already has a days-old Facebook support group? Yeah, me either.","post_message":"“The evidence suggests this was an intentional act, not an accident.”"},{"comment_id":"447034255487155","commenter_b":"No vet should have to remove their stickers, as for the Obama supporters they should be kicked out of the neighborhood.","commenter_a":",yes","post_message":"Should This Vet Refuse To Remove His Decals? Comment 'yes' or 'no'."},{"comment_id":"10153699809290496","commenter_b":"Haha their wives might...lol","commenter_a":"As long as they bring home the gold, who cares??","post_message":"Three members of Team USA basketball reportedly ended up in a high-end brothel, but it was an apparent misunderstanding: @webpagelink"},{"comment_id":"10153904847648128","commenter_b":"100% true","commenter_a":"Miss Colombia says: happens for a reason. Now Steve Harvey, Miss Colombia, and Miss Philippines are more famous than if the crowning had been flub-free.","post_message":"This year's Miss Universe is Miss Philippines, Pia Alonzo Wurtzbach, but host Steve Harvey initially announced the runner-up, Miss Colombia, as the winner."}]
