[{"comment_id":"10153235422567994","commenter_b":"Hahahaha mathieu blocked me awe","commenter_a":"Who are these people with nothing better to do than just constantly complain about everything being racist? My God shut up.","post_message":"It's a bank robbery for Skittles. Is it a student video gone wrong?"},{"comment_id":"987574278005491","commenter_b":"Killary for prison 16","commenter_a":"Very true, Hillary has been called horrible things not just by men but women to. HILLARY 2016.","post_message":"'I don’t know that a man would be treated the same way that Hillary is.”   - Senator Bernie Sanders"},{"comment_id":"525047394321882","commenter_b":"its not about muslims or syrians. It's about smart people and dumb people. Dumb people do stupid things And r always careless and go to prison Regardless of race colour ethnicity in every nation. Just as some kids who try being gangsters and get all hyped up and dont care about family and bettering themselves. Smart people in every nations try bettering there lives family living standard etc Education. I just like to say something That I want My message to be shared throughout the whole of the mainstream media. If i was ruler there b no prison i would make all dummies clean roads toilets for free or beat them these rude violance fuckers","commenter_a":"Laura Silk","post_message":"'This is what happens when you f*** with mother Syria all of your blood will be spilled.'"},{"comment_id":"975168222494648","commenter_b":"Not really , I was talking about little pussy Libtards like you Chucky boy !","commenter_a":"Yea , all money belongs to the Dear Leader. And he gives us only what we need or deserves ! Just look at how that worked out with Joseph Stalin !","post_message":"Oh no."},{"comment_id":"10155534707951509","commenter_b":"Hillary is going to prison, The wicked witch is dead.","commenter_a":"Black people don't vote for Hillary Clinton. In 1994, she signed the mass incarceration bill with her husband, which put many black people in prison for small related crimes. Trump wants to fix the black communities, get a better educational system, and invest more in the schools. Vote for Hillary and black people will be suffering for another 4-8 years, just like the last 8 years when we had all these promises that never came.","post_message":"Michael Dale Vance Jr., the Oklahoma fugitive who authorities said shot two officers and killed two of his relatives last week, was killed in a shootout Sunday night, according to the FBI's Terry Weber."},{"comment_id":"10154073349643132","commenter_b":"Piss off you twit and merry Christmas","commenter_a":"Why would you congratulate someone who goes out of their way to shame woman for pre-marital sex yet does it herself?","post_message":"Congratulations are in order for new mama Bristol Palin!"},{"comment_id":"10153189678699342","commenter_b":"Its just a restrainin b device the kid will learn to be still nithing wrong here ppl get upset about anything ive had to ohysically jold my 18 month old down to get his shots this would have been better","commenter_a":"There is the option of oral sedation.","post_message":"couldn see my kid in the body bag just strapped down to the bed, I couldn handle it.'  A man heard his daughter screaming during a dental checkup and then found her like this: Restrained in place with a device known as a 'papoose board. It's legal for dentists to use them."}]
