[{"comment_id":"1389565734436504","commenter_b":"Wow this kind of women u dot want mess with super power","commenter_a":"OMG!!!! I am bereft for words!","post_message":"He started to beat her, so she squeezed his testicles in response"},{"comment_id":"619503418188720","commenter_b":"This monkey is a joke.","commenter_a":"Spoken like a true tyrant.","post_message":"Barack Obama: Soft on ISIS, Brutal on States"},{"comment_id":"10154289975556336","commenter_b":"She agreed to follow the dress code if she was unable to wear heels then she should have asked for an accommodation.","commenter_a":"Dress code violation..if you don't like the dress code find another job. I'd rather not wear pants to work, but I have to anyway because it's the dress code. Suck it up.","post_message":"Dress code violation or sexism?"},{"comment_id":"10154298865889099","commenter_b":"Smh","commenter_a":"Jessica Milla","post_message":"\"Her ribs are broken. He beat her ribs and breast saying her milk was useless and she was worthless,\" the woman's mother said. \"He tried to blind her so she couldn't see her baby, he tried to make her deaf so she couldn't hear him crying for her.\" WARNING: Some may find the images in this story disturbing. @webpagelink"},{"comment_id":"1084755811580947","commenter_b":"She well be Charming President .","commenter_a":"Unless Democrats want to see President Obama hand over the keys to the White House to Donald Trump, we Bernie and Hillary supporters had better start aiming attacks at Trump and the Republicans, and not at each other.","post_message":"\"She cares. She tries. She perseveres. And now she has a chance to tell the story she’s always wanted about America: the story about a country that found the courage to turn away from our darkest impulses; that chose to embrace our growing diversity as a strength, not a weakness; that pushed the boundaries of opportunity outward and upward, until there are no more barriers, and no more ceilings.\" —Jon Favreau, President Obama's former speechwriter"},{"comment_id":"985301294841116","commenter_b":"@username woman you dip.","commenter_a":"Can’t we call Ted Cruz by his real name Rafael Eduardo Cruz? He never misses a chance to call the President “Barrack Hussein Obama“. including his middle name to make sure we all know he’s a “Muslim“….and good old “Ted” was born in the united states of CANADA!","post_message":"Do you agree with the ruling?"},{"comment_id":"10153324881199312","commenter_b":"1 in 100,000 people infected with measles died before the measles vaccine, meaning even if EVERYONE caught measles in the USA today only 3,000 would die, BUT thats if EVERYONE in America caught it, not millions, and because we take care of ourselves and wash our hands and eat slightly healthier that would not be the amount today anyhow, measles does not mean instant death, and if one more person tries to spread \"herd immunity\" crap I'm gonna lose it, it's not real! We do NOT have herd immunity!","commenter_a":"What concern. Everybody got measles when I was a kid.","post_message":"More than 1,000 students are exempted from measles vaccine in St. Louis area schools. Tonight at 10, 5 On Your Side investigates the concern, the controversy and how quickly an outbreak could occur."}]
