[{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation.  It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation.  Read the whole story at Reverb Press HERE: @webpagelink"},{"comment_id":"10153763460367629","commenter_b":"The wall will be built of hatred and ignorance.","commenter_a":"Creepy!","post_message":"So cute!"},{"comment_id":"1265448890160011","commenter_b":"Dana, what if it's you who's the bitch and not Hillary?","commenter_a":"There isn't a nail in the coffin. At this point in time either you see her for the corrupt lying bitch that she is and refuse to vote for her or you vote for her in spite of it. No one can say she's not a corrupt liar. Either you admit she is and you're voting for her anyway or you are not. The table is set. The pieces are moving.","post_message":"JUST IN!"},{"comment_id":"10153070035530399","commenter_b":"I thought I saw this woman at Hooters the other night. That's always been a good source of Broadcast talent for Faux.","commenter_a":"Just a new way for the Dummycrats to steal more votes!!!!!!!!!!!!!!!!!","post_message":"It's always Andrea Tantaros."},{"comment_id":"10153061326484586","commenter_b":"this is sick how the hell does this go unnoticed","commenter_a":"tangeneng yan!!!!!","post_message":"HARD TO BELIEVE:   Do people know that THIS could be what they're paying for when they buy leather?!   [Warning: Some of the most GRAPHIC footage] #DogLeather"},{"comment_id":"899421576802371","commenter_b":"Stupid BITCH !!!","commenter_a":"Why don't you release your vitriolic hatered towards the real enemies the Muslims, the Obama administration, Hillary Clinton, the democrats, black lives matter and other groups like that and anyone on the left that thinks like you. Unfortunately the rest of us don't have the money to buy protection so we have to protect ourselves. There is not enough police to protect everyone. I use to like you but I don't anymore.","post_message":"Actress Rose McGowan Unloads Hate-Filled Rant Over Muslim Murderers Syed Rezwan Farook and Tashfeen Malik. Her target: American gun owners and Republicans.    Sorry, Rose, but we poor, regular folks can't afford ARMED bodyguards and a million dollar house like you and your Rich Hollywood Liberal pals.  #elitist #1Percenter"},{"comment_id":"10153533144730399","commenter_b":"@username, you might be a pussy as well...","commenter_a":"he is right and the American people share the responsibility for what happened in Oregon today....they continue to elect NRA bought and paid for officials","post_message":"\"Well this is something we should politicize. It is relevant to our common life together, to the body politic.\""}]
