[{"comment_id":"1165741570143303","commenter_b":"Why so serious... The whole world just needs to lighten up.. even if it's for 5 minutes.. colour is talked about so much it's actually part of the problem now.. just let it be...","commenter_a":"How the hell is this pic racist!!","post_message":"Opinion is divided ... (via BBC Trending)"},{"comment_id":"1793346000922790","commenter_b":"The only women that believe that they shouldn't be checked out are the ones that don't have to worry about it anyways.","commenter_a":"I got dress coded while still in school for my skirt being to short when i argued this saying that it was well pass my finger tips she agreed but since i had long legs the skirt looked short so i would have to change","post_message":"Portland just completely flipped the script on sexist school dress codes."},{"comment_id":"718075635009295","commenter_b":"Mrs Trump has nice Tits too lol","commenter_a":"Mrs. Trump, what an elegant peaceful person, a very classy confident individual...reminds me of Nancy Reagan!!!","post_message":"Michelle Obama will be remembered as the most vile and arrogant First Lady in US history!!! Let's get 4,000 SHARES to support our NEW First Lady Melania TRUMP!"},{"comment_id":"10155262901820231","commenter_b":"Fraud!","commenter_a":"He's just a man and not god","post_message":"Social media: 1  Ceflo Dollar fundraising for a private jet: 0"},{"comment_id":"10153308382443145","commenter_b":"How sad ! Ban the Frat !!","commenter_a":"Two bills allowing guns on college campuses are about to be introduced. Alcohol, hubris, testosterone, guns. What could go wrong?","post_message":"The UCF chapter of the Sigma Nu fraternity was suspended after a video surfaced of a member chanting the word \"rape\" and encouraging sexual violence toward women, the university said. The organization will have a formal hearing Thursday. #wftv"},{"comment_id":"10154183673293132","commenter_b":"It's usually the accuser that's doing the cheating. Good for her for getting rid of that douche.","commenter_a":"The same thing happened to my best friend when she started to make a healthier lifestyle for herself. Her now ex wouldn't support her at all! She was supposed to come to the gym with me one day and completely bailed out because she was fighting with her a**hole boyfriend. Turns out he told her that she's fat, will always be fat and that there was no point in going to the gym with me when she'll quit anyway. Now I wasn't aware about what he told her until recently because she was so ashamed of what he told her and knew I'd bash the crap out of him. He'd also accuse her of cheating every single time she went out or \"joke\" to her about texting other guys whenever she pulled her phone out. He was the one who ended up cheating (or so we think but I'm sure ...","post_message":"Alexander's husband started calling her \"fat\" after she dropped weight to save her health."},{"comment_id":"1380609545301335","commenter_b":"GOOO NORTH DAKOTA, WISCONSIN, CA. , NEW YORK BRING IT ON IN!!!!! ALL ABOARD NEXT STOP THE WHITE HOUSE!!! ADDING COAL TO THE TRAIN!!! MEDIA,MEDIA, MEDIA!!! NO MATTER HOW YOU TRY YOU CAN'T TRUMP THE DONALD!!!! CRUZ KASICH =ESTABLISHMENT'S COCKROACHES!!! A VOTE FOR THEM IS A VOTE FOR HILLARY OR BERNIE!!!!!! ALL ABOARD !!!! NEXT STOP THE WHITE HOUSE!! T TRAIN R ROLLING U UNITED M MOVED BY THE PEOPLE P PRESIDENT TRUMP","commenter_a":"Any word on royal booze taster Glenn Beeks and his daily abuse of Christianity. I mean what a embarrassment that guy is using God and Christianity to prop up that disgusting philanderer Cruz","post_message":"It's a super religious day or something, he maybe thinks."}]
