[{"comment_id":"1678604362359824","commenter_b":"@username how about i fuck your wife?","commenter_a":"Ah yes, Israel defending themselves against the crazed islamists wanting to destroy the country and kill all the jews. This page is turning into a progressive shitehole full of regressive thinking. NASTY.","post_message":"Literally the biggest assholes on the planet."},{"comment_id":"10154288935233984","commenter_b":"What a bitch!","commenter_a":"You will know for sure when we run out water","post_message":"Dem Sen. Barbara Boxer just laid into this Catholic priest for appearing to question Pope Francis's warning on the dangers of global warming. Do you think global warming is a hoax?"},{"comment_id":"986811718026353","commenter_b":"\"The kids will eat it up, if it's packaged properly Steal a sound and imitate\"","commenter_a":"And thats why i loved him 👊","post_message":"Nirvana's Kurt Cobain is known for being something of a legend in music, but that's not all. In fact, he said some pretty on-point things during his time, especially about rape, bigotry, racism, and feminism."},{"comment_id":"10153444568593984","commenter_b":"hillary shouldn't even be allowed to run, she and all her and obamas co-horts should be in jail for treason. and what would be so bad about going back to the 50's. that was a great time to grow up. at least the govt. was 80% honest and not 99% dishonest. if she gets elected then something is diffinitely wrong with this country and the people in it.","commenter_a":"Sorry Mr. Levin but unless the Republicans can come up with a candidate who doesn't still live in the 1950s and can stay out of people's bedrooms, Hillary will win.","post_message":"BOOM! Outspoken Levin just stepped up to the plate and asked what everyone else is thinking. Hillary will NOT like this one bit... Do you support Mark Levin?"},{"comment_id":"583876271812949","commenter_b":"Niggah Please","commenter_a":"Um....why walmart though?","post_message":"Trump's #1 supporter has a disgusting warning for voters..."},{"comment_id":"10152653934397169","commenter_b":"A woman should never lose her chic!","commenter_a":"Go girl!","post_message":"Part of a growing trend of older fashion icons:"},{"comment_id":"10153641231211337","commenter_b":"More like a Cabbage Patch doll had sex with that weird chick who snorts Ajax in Up in Smoke.","commenter_a":"Amy Schumer looks like Reece Witherspoon had a baby with the Pillsbury Dough Boy","post_message":"PERFECT: Amy Schumer was ready when someone compared her to the American Gothic lady..."}]
