[{"comment_id":"10153395170866162","commenter_b":"Alien had azz. Kmsl. Female leaves there kids with anyone for bad love..","commenter_a":"Shaun Sullivan look at this guys head. wtf","post_message":"DISTURBING: A 19-year-old man is charged with the murder of 2-year-old girl whom he was babysitting @webpagelink For the stories you care about -\" like\" ABC 7 Chicago!"},{"comment_id":"864868203550521","commenter_b":"ROFLOL!!!","commenter_a":"I see a white guy in a gold shirt.","post_message":"Photo: 20-year-old Jeffrey Williams, suspect charged in shooting of two police officers in Ferguson, Mo. @webpagelink"},{"comment_id":"10154153426863812","commenter_b":"I'm praying!!","commenter_a":"Pray for a safe return","post_message":"Amber alert issued for 2-month-old girl who was abducted from her home by armed kidnappers: @webpagelink"},{"comment_id":"10153643322467434","commenter_b":"@username, I am an actress...I can rip you apart in iambic pentameter. Words do matter and so do definitions. In order for RAPE to occur, SEX has to happen...or it is considered MOLESTATION...","commenter_a":"Wow...semantics. Yes, Brock Turner DID have sexual relations...or else he couldn't have RAPED her. Sex is kind of a requirement...the headline does NOT say \"consensual\". #GoodGrief","post_message":"Just because the law smiled upon a man who had sex with an unconscious woman behind a dumpster doesn’t mean this group of angry, armed protesters will do the same."},{"comment_id":"1393467647339928","commenter_b":"Yep, that is exactly what I believe!","commenter_a":"I was a democrat and anti gun, after I saw San Barnadino I changed my opinion .rump is right if we had few people in that work place gun straped around their hip bullets would have go the other way too. We could have kill those radical fanatics right there and the death toll of Americans would have been much less. I can guarantee that.","post_message":"BREAKING: NRA endorses Donald Trump at national convention"},{"comment_id":"1043158469105219","commenter_b":"That's the spirit. Women, don't let anything keep you from making sandwiches!","commenter_a":"Suck it up buttercup,not everyone likes tattoos..","post_message":"'I don't understand how tattoos can stop me from making a sandwich'"},{"comment_id":"10153500393969087","commenter_b":"Lmao!! Yes that woman really said that. She's a looney bin","commenter_a":"@username did you really just say \"Kid Rock is a patriot and has billions of fans that respect him?\" You really just summed up the average Trump supporter quite perfectly: someone who doesn't quite know the difference between an extra 0...","post_message":"\"I'm digging [Donald J. Trump],\" Kid Rock told Rolling Stone magazine. \"I think he will [win]. To me, I'm just like, 'We gotta try something else.'\""}]
