[{"comment_id":"1036949889659355","commenter_b":"Mother fucker that shot him should be shot","commenter_a":":(","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"10153718216276680","commenter_b":"That woman is a lunatic just like donald duck","commenter_a":"She must have drank the Trump kool aid!!!!","post_message":"Donald Trump’s spokeswoman blamed the policies of President Barack Obama and Hillary Clinton for the death of Army Capt. Humayun Khan, despite the fact that Captain Khan died in 2004."},{"comment_id":"10153910519885695","commenter_b":"What a pig.","commenter_a":"He should be castrated .","post_message":"Jared Fogle's attorneys asked a judge for leniency, saying he is \"profoundly sorry.\""},{"comment_id":"10153769557012411","commenter_b":"Very few companies offer health insurance to retirees.. very few!!! Probably government retirees is about it..","commenter_a":"Congratulations to her, but did the massive company McDonalds, give her retirement benefits or health insurance after 32 years?","post_message":"“She is one of the most beautiful and upbeat people you could ever hope to know.\""},{"comment_id":"885286484921464","commenter_b":"This woman is delusional.","commenter_a":"Bat shit crazy","post_message":"ClashDaily.com"},{"comment_id":"970145053025967","commenter_b":"Remember: it's all politics ...and about votes. The GOP is garnering for the 'jewish' vote in 2016.","commenter_a":"Talk about shooting yourself in the foot...! Between this \"journalist\", Boehner, and Bibi, the court of public opinion may not be so kind. Obama will most likely rise above the pettiness, but like he said, there WILL be consequences. He is after all the actual elected President of the United States.","post_message":"Conservatives and Pro-Israel groups are now actively undermining the US President. This is about as un-American as it gets."},{"comment_id":"10153312471793606","commenter_b":"Enough Rioting In Baltimore Already It's Time To Cleanup The Damage Those Idiots Made And To Restore Peace Better Yet Make Those Monkeys Who Damaged Baltimore Cleanup Their Own Mess","commenter_a":"<iframe width=\"330\" height=\"180\" src=\"@webpagelink\" frameborder=\"0\" allowfullscreen><\/iframe>","post_message":"#BaltimoreRiots: We're monitoring social media right now, and some people are tweeting to get out and riot AGAIN. @webpagelink"}]
