[{"comment_id":"376942655827362","commenter_b":"Go Back To your frickin homeland!! We did not invite you here!!","commenter_a":"Deport them","post_message":"The want to change Easter in \"Spring Break\"..."},{"comment_id":"10153652043082452","commenter_b":"Ok....we'll make the insect kingdom pay for it.","commenter_a":"We must build a wall to keep them out!","post_message":"Southern California's iconic palm-tree landscape could be threatened by a new invasive pest migrating north from Mexico.  The South American weevil kills palm trees by eating their leaves and spreading disease. It's already made its way to San Diego after devastating palm trees in Tijuana."},{"comment_id":"10158241911570405","commenter_b":"That part about Kansas is not true. Our state is so far in the hole and we do not have the \"workers\" with that income. It was a pipe dream. The state just passed the largest tax increase in history because of the lack of income. Our budget fell short ever since this governor installed is plans.","commenter_a":"Once again @username when you source things from right wing rags, you lose credibility. Most won't even read it and those who do already support you. It's concerning that these are the only sources you can reference...","post_message":"Welfare Reform & Wisconsin: Walker Is Leading the Way | National Review @webpagelink"},{"comment_id":"738344672965380","commenter_b":"They'll never get in!","commenter_a":"I wouldn't say he told Obama off...more like explaining the way of things in Radical Islam...because that moron needs to have it explained to him...2016...get here quick!!!","post_message":"Ohhhhhhbama."},{"comment_id":"10154805398708812","commenter_b":"Ha ha. That'll teach them.","commenter_a":"George R. Sadler DW Adams","post_message":"Police in Southern California on the lookout for brazen thief who broke into a YMCA and stole fake cash from a toy register."},{"comment_id":"1354339577942641","commenter_b":"Education, do u have?","commenter_a":"I f*****g hate Islam.","post_message":"Behold the peaceful religion..."},{"comment_id":"10153750072683352","commenter_b":"Or she was a trashed up slut waiting to get picked up by anyone..","commenter_a":"She was probably a law abiding citizen he only calls felons and degenerates","post_message":"‘We’ve not heard a word': Relatives of woman shot dead on San Francisco pier criticize Obama for not contacting them as they demand tougher immigration laws"}]
