[{"comment_id":"1155777891187482","commenter_b":"Clear to me this woman is smarter than you will ever be.","commenter_a":"This woman is a mercenary. She has no morals, ethics or integrity. Just a few months ago when she was on Ted Cruz' team she was bashing Trump for all the things that she is now defending him. She would say just about anything for a buck.","post_message":"Reports about Kellyanne Conway are greatly exaggerated."},{"comment_id":"725221097581400","commenter_b":"This Latino American Women thinks its terrible that people here illegally are breaking laws & think its ok no its not..","commenter_a":"The petty haters whining about tax dollars need to just have a seat. And take a long, hard look at themselves. A) she's a CHILD B) she's going to go further in life than any of you small-minded simpletons because of her drive and determination, and her GPA and scholarships were a direct result of that. She didn't show up on free Yale day. She is smart, worked her butt off, and is on track for the kind of success she deserves.","post_message":"Larissa Martinez held a 4.95 GPA and took 17 AP classes over her McKinney Boyd High School career. She's also an undocumented immigrant who arrived in the U.S. in 2010 -- but only 10 of her classmates knew that before last week. After her speech, they gave her a standing ovation."},{"comment_id":"995263523875544","commenter_b":"And u look like what came out of my anus this morning, except not as attractive...","commenter_a":"Her face looks like the whole butt!","post_message":"Rosie O’Donnell unloads on Donald Trump..."},{"comment_id":"10155070444570603","commenter_b":"This disease is curable with treatment. If she puts it off she will die. Just as an abortion her parents still have the right to choose life for their child.","commenter_a":"This is crazy!","post_message":"UPDATE: Cassandra was diagnosed with Hodgkin Lymphoma in September. For three weeks she was getting chemotherapy, but then changed her mind and decided she didn't want it."},{"comment_id":"10153269295123352","commenter_b":"That last statement not only make her a dumb bitch but a ignorant one at that. Please use some of that money your boyfriend is making and educate yourself.","commenter_a":"So fake she has 3 kids no where does she have the time to make all of this stuff.","post_message":"Meet Etsy's richest seller: Mom-of-three sells 3,000 items a day and earns $65,000 a month from handmade socks and scarves"},{"comment_id":"10154252490299778","commenter_b":"These horrible people who dare believe their status in a car is ever more important than a pedestrian need to be banished from all car transportation for the rest of their born days. If that were my kid, he'd be leaving town ASAP :(","commenter_a":"Get him","post_message":"A man is being sought after he ran over the top of a child and then sped out of the Arlington, McDonald's parking lot."},{"comment_id":"781508608584844","commenter_b":"Problem is giving amnesty to the ones here only perpetuates the problem. The next ones to jump the border will believe they will be given amnesty and so on and so on. Companies employing illegals need to be punished and no freebies, IE entitlements to non citizens.","commenter_a":"Do the house republicans have a plan to actually fix the problem? I know the tough talk is to \"just send them all back\" but those aren't plans. Sure wish yall had answers to problems instead of continuing this political theatre.","post_message":"Last night, a federal judge issued a preliminary injunction that effectively blocks President Obama's unilateral executive actions on immigration. The magnitude of the President's executive overreach on immigration cannot be ignored. The House passed legislation to stop the President's unlawful plan, but Senate Democrats will not even allow it to be debated. It is my sincere hope that Senate Democrats see this legal action as a wakeup call and let the House bill be considered in the Senate."}]
