[{"comment_id":"10153483775401409","commenter_b":"You are a troll anyway. I can tell by looking at your page. Funny thing is you have a picture of the twin towers on your page saying never forget but you want to let illegals stay and I bet are all for the refugee program.","commenter_a":"Its because Trump loves attacking women but not his own. I bet he doesn't treat his wife good at home and only likes his wife and daughter as sex objects to him. He's a disgusting man.","post_message":"Here's how Heidi Cruz responded after Donald Trump threatened to 'spill the beans' on her Tuesday."},{"comment_id":"1282558331837218","commenter_b":"\"Accidently\" lol fucking worthless Muslim and dumb bitch.","commenter_a":"Lies way less maybe but on a much higher scale lady. Really how does she sleep at night knowing she wants to butt fuck half the country and rape our military. I look at that bitch and I cringe bc she just says hello kindly and you know she is lying.","post_message":"Another day, another Trump lie debunked."},{"comment_id":"10153008628783721","commenter_b":"of course I'm involved!","commenter_a":"Sara Kasperski are you involved? I know Shia is...","post_message":"The watchers become the watched."},{"comment_id":"795005380646682","commenter_b":"Y'all must be crazy","commenter_a":"Drain the swamp","post_message":"The United Nations resides on American soil, and the U.S. pays about 25% of its budget."},{"comment_id":"10156085666465354","commenter_b":"@username Nah ..shes a Wanna be Black!!","commenter_a":"Why are these F*%^ ers not being hunted down, arrested and prosecuted as the 60's radicals were? Why do we even have an FBI????","post_message":"“The revolution is on…Off the pigs.”"},{"comment_id":"641541669369745","commenter_b":"She is a ass. Get her shit and get out","commenter_a":"Go back to where ever the hell you came from then you spoiled bitch. I'll pitch in on a plane ticket!","post_message":"This spoiled brat got exactly what she deserved. If you don't like our country you can leave. Do you agree this is karma?"},{"comment_id":"1032518616814893","commenter_b":"Watch her pop that shit out right in the gym straining to hard","commenter_a":"People are so stuck on looking good they don't even take time out to enjoy being pregnant it's sad and looks nasty!","post_message":"Fitness Model Chontel Duncan Isn't Stopping Her Intense Workout Sessions Even During Her Pregnancy!"}]
