[{"comment_id":"1362231057136004","commenter_b":"Why should prayer bother an atheist? Bc deep down they know that God is real.","commenter_a":"Keep standing up for God, no matter what anyone says.","post_message":""},{"comment_id":"578481392330649","commenter_b":"THEY LOOK SO FOOL OF IT.....SSSSSSSSSSSSSSSSSSS","commenter_a":"Pot, meet Kettle...","post_message":"“One of the greatest frauds in modern electoral history is Donald J. Trump pretending to be an outsider.\" Tonight on “Hannity,” Ted Cruz said that Trump is part of the establishment because he funded liberal Democrats for years."},{"comment_id":"1114475591908563","commenter_b":"Scum","commenter_a":"Two interviews; one discussing the present, when he declares no share ownership etc, etc, and a second interview, which was today, discussing the past when he did own some. Two very different things. Perhaps it's wise to point that out, instead of skewing the facts to confuse your poor readers....","post_message":"BREAKING #MicBrights"},{"comment_id":"10153286893164032","commenter_b":"She does not have the authority to get rid of common core. That will have to go through the state legislature and governor. She's all talk with nothing to support her. She truly is an embarrassment to her job and party.","commenter_a":"Bye bye common core. It sucks. The testing needs to stay. But common core needs to be kick-booted out. Talk about lowering self esteem for kids who already struggled before with math. Always a fun time in my house with my 4th grader.","post_message":"#BREAKING: Arizona students would take fewer standardized tests and Common Core standards would be thrown out under a plan just announced by schools chief Diane Douglas. Here's a look at what else she has in mind."},{"comment_id":"10157597315525294","commenter_b":"if ya momma was playing she,d get fined too!!!","commenter_a":"As usual we find a way to lose!!!!","post_message":"Plugged in: Josh McCown and Cam Erving injured. Browns blow first half lead. If McCown can't go, who should QB this week against Miami??"},{"comment_id":"1269059086447452","commenter_b":"Can you imagine how outraged the freeloading Obama brown nosers minion would be if that would be the Obama girls.","commenter_a":"But the images of the Obamas as monkeys is ok?","post_message":"Sen. Ted Cruz launched an \"emergency\" fundraising appeal after the Washington Post published a cartoon online depicting his daughters as dancing monkeys."},{"comment_id":"10152933844790667","commenter_b":"He probably figured he could demand equality for animals, since now people of same sex can get married. Next, it will be polygamy. Watch the Muslims in the US asking for equality.","commenter_a":"Yep could have gone all day w/o reading this. sick","post_message":"Crawford posted an ad on a popular website soliciting a willing horse owner, according to officials."}]
