[{"comment_id":"873396172789454","commenter_b":"Taking our RIGHTS to to fulfill your agenda is not going to happen. Do you have armed security? I bet if a person walked in and brandished a weapon he/she would be taken out by a person you hired or are in connection with you and your party that is wielding a gun. You would say its protection...... We say the same thing.... It is for Protection.... While you want to make guns illegal for law abiding citizens to obtain, you will only make it Illegal to own them. Causing a bigger issue for some. People will always have guns. Ask a Drug dealer if they have issues getting illegal drugs.... NOPE. they will straight laugh at you. All you are doing is wasting taxpayer money and time. If you want to make change, ban together to reform Immigration to be fair and swift, Vote laws to tax churches to ...","commenter_a":"Real action","post_message":""},{"comment_id":"859046174191636","commenter_b":"she sucks like spike lee","commenter_a":"why is it important that she was a black female director? is it not good enough to be the Best Director?","post_message":"\"I do think it was a snub. But, I do believe she’s the first black female director whose film was nominated for an Oscar, so that’s already been history making.\" - Director Yoruba Richen on \"Selma\" and Ava DuVernay"},{"comment_id":"10153521630153984","commenter_b":"Why fight it? Gay marriage can't do any more harm to the sanctity of marraige then us heterosexuals have already done! 50% of marraiges or more end in divorce! We spend billions on weddings creating unesseccary specticals that have nothing to do with the marraige spoken of in the Bible! Jesus would not condemn, He would love. Point fingers if you want but my goodness people, haven't we learned our lesson yet?","commenter_a":"Thank you Judge Wes Allen! May others follow you!","post_message":"This official took a bold stand for traditional marriage, and the initiative is spreading across the state. Do you support what this probate judge did?"},{"comment_id":"10153563956586519","commenter_b":"Hello??? It is time for you poor ladies to start being your own role model. Stop whining.","commenter_a":"Sooooooo, losing weight is selling out now? You damned if you do, damned if you don't.","post_message":"\"I’m left longing for stories about fat women that don’t tumble off the wrong side of that thin tightrope between laughing with and laughing at...\""},{"comment_id":"10152847056142411","commenter_b":"Bill","commenter_a":"Its because Chicago is ran by a bunch of idiots.","post_message":"Have you ever witnessed a utility company ripping up a street or sidewalk that had recently been repaved? Chicago has a department that's supposed to coordinate schedules between the city and utilities. But it's not working as well as it should - and that means taxpayer money is being wasted. Dan Ponce reports: @webpagelink"},{"comment_id":"998929483475806","commenter_b":"Don't know why.He has much more intelligence than Trump","commenter_a":"Cruz will make a great president and trump vice p.","post_message":"Thank you, Ted Cruz!"},{"comment_id":"10153051831985950","commenter_b":"WTF?! I would have knocked that bitch the fuck out if that were my child. And the so called DAD is a piece of SHIT too! They need to light her ass up in PRISON! >:(","commenter_a":"What?! I can't comprehend this... why,,,,","post_message":"Police say a stepmom bullied her now 15-year-old stepson: \"She asked me if I wanted to play the game,\" the boy said. \"And I said no. So then she called me 'punk,' so we did it. We went in the bathroom, she poured a whole bunch [of alcohol] on my butt and then she lit it on fire.\""}]
