[{"comment_id":"10154603264491756","commenter_b":"That's a huge stretch of the truth but I'm guessing you prefer a plagiarizing lying college drop out \"model\" as First Lady. And who of all people did she plagiarize? Michelle Obama.","commenter_a":"So phony! Had to be distracted since she probably couldn't give much details of the White House since she spends more time at her house in Hawaii!","post_message":"First lady Michelle Obama says she's only been able to \"rock out\" from the passenger's seat of a car one time in 7 1/2 years — when her daughter Malia learned how to drive."},{"comment_id":"438573499666627","commenter_b":"@username. She's an idiot","commenter_a":"Another liberal sheep just voting for a female!","post_message":"Lena Dunham isn’t worried about Michael Bloomberg."},{"comment_id":"10154289426723797","commenter_b":"@username I am an alcohol manufacturer.","commenter_a":"They should never have been in prison to begin with.","post_message":"OBAMA COMMUTES DRUG SENTENCES: Nine people from Illinois are among the 95 whose prison sentences have been commuted by President Barack Obama."},{"comment_id":"10157253812445725","commenter_b":"#VoteTrump2016 #StopTheEstablishment #ProtectTrump #ImWithYou #MAGA","commenter_a":"We believe!!!! #trump2016","post_message":"IF YOU DO NOT BELIEVE IN YOURSELF- NOBODY WILL! •DJT"},{"comment_id":"10156328983890389","commenter_b":"just a dried up old liberal lying witch .","commenter_a":"The appearance of former secretary of State Hillary Clinton before the House Select Committee on Benghazi raised very important questions on diplomatic security, the relationship between the secretary of State and her ambassadors and leadership. My experience during 38 years in the Foreign Service, including six assignments as an ambassador, has given me a perspective on these issues that differs from some of the arguments developed by the Committee. First, about security. Every secretary of State and every ambassador has security as a top priority. It is a dangerous world, and we are everywhere in it. An ambassador is responsible for the security of her personnel and her embassy. Internal defense plans, risk assessment, movement controls, adequate defensive systems these are all on the shoulders of the chief of mission. The department is responsible for getting her what she says she needs. There is no perfect security. Risk has to ...","post_message":""},{"comment_id":"10155153286483258","commenter_b":"But it's nothing like taking public funds for your business, and then having offshore tax havens, while your skimming operations know no bounds.","commenter_a":"No. It's not at all like taking a great Chagall or Picasso or anything remotely close #boybye","post_message":"“It’s like taking a great Chagall or Picasso or something,” New England Patriots owner Robert Kraft said. “You can never display it.”"},{"comment_id":"10154291489851130","commenter_b":"*woman","commenter_a":"I am a women and I agree with pence!","post_message":""}]
