[{"comment_id":"10153492553852869","commenter_b":"Nope!","commenter_a":"Amen thanks to Obama. He rewarded themg for 9 11","post_message":""},{"comment_id":"10153089911647483","commenter_b":"Noo, not this sweet looking nice white lady!!","commenter_a":"That's sad","post_message":"She was arrested for stealing an 8-foot HDMI cable priced at $39.99 from the Best Buy."},{"comment_id":"10152784038336491","commenter_b":"Preaching to the choir, sister! One of many reasons I'm now divorced.","commenter_a":"Now if only science could find a man worth having......","post_message":"Science shows that there are quite a few health benefits of getting intimate."},{"comment_id":"439739816151059","commenter_b":"Last election, I voted democrat, for the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the ...","commenter_a":"Why the fuck is UW Cali giving her money? Naughty naughty.","post_message":"Three of her top political donors are Goldman Sachs, Citigroup and JP Morgan. Is there anyone left that still believes the shit politicians say?"},{"comment_id":"1510101482356438","commenter_b":"Lol that's not even close to what Asexual means.","commenter_a":"Asexual isn't real. Asexual means you reproduce without a partner. Use a different word cause that's not how this word is used in species. Asexual is like a bacteria. You are just without-sexual-wants.","post_message":"\"I fantasize about my future with my partner, achieving a certain level of success in our careers, getting out of debt. Oh, and cake. Don't forget about cake.\""},{"comment_id":"10153602244842894","commenter_b":"It's a lot of women who are really Jr.","commenter_a":"Ok, so she doesn't mind showing her man's good...That is indeed a fools game but ok. I am really trying to wrap my mind around how the baby girl is a JR. should I not be distracted by that?","post_message":"Oh My! Teyana Taylor Shares Snaps of Iman Shumpert Holding Baby Iman Jr, But His Big Ol’ Bulge Steals the Show [Photos]"},{"comment_id":"10153255153245329","commenter_b":"Jason Winter you must","commenter_a":"@username eeeeee","post_message":"These dogs don't know what to do now."}]
