[{"comment_id":"10153979570636378","commenter_b":"@username shut your trashy face","commenter_a":"Hey NFL PLAYERS, you guys got something you can do before the game to protest the mistreatment of POLICE OFFICERS??? HMMM??? Yeh, nothing, I thought so....","post_message":"DEVELOPING: Seven people were shot, including two police officers, after an ambush-style attack that led to a fatal shootout in West Philadelphia. A civilian and the gunman are dead. --> @webpagelink"},{"comment_id":"1349633901749900","commenter_b":"@username, real women protect their babies, not kill them","commenter_a":"Any \"man\" who wants to try to control what women do with their body is a worthless piece of feces and they will be treated as such.","post_message":"The gift of life must be protected from the slaughter!  Click here to sign your petition in support of the Life at Conception Act!  @webpagelink"},{"comment_id":"10152641860006135","commenter_b":"What a joke","commenter_a":"How do you find out if you have fines?","post_message":"Just a HEADS-UP If you've skipped out on jury duty in Michigan in the last 12 months...  READ: @webpagelink  You have until the end of the business day today to request a new jury service date to avoid fines."},{"comment_id":"10153794102616051","commenter_b":"Agree,she should be in prison","commenter_a":"AGREE","post_message":"Donald Trump says Hillary Clinton's record of scandals make her unqualified to be president. Do you agree or disagree?"},{"comment_id":"10152869817141130","commenter_b":"Sounds like you're a bitch who can't take a compliment.","commenter_a":"Maybe because when men try to pick me up it goes like this: Them: \"Hi, gorgeous.\" Me: \"F*ck off.\"","post_message":"\"It's not that I'm opposed to meeting someone. I just don't feel it's necessary.\""},{"comment_id":"10153595542620575","commenter_b":"If its pure crap please backup that statement with facts. America is importing more Muslims than ever before in history.","commenter_a":"He IS scary with his beliefs and agenda for Muslim takeover of the world.","post_message":"The Gateway Pundit - Obama Blasts FOX News, Conservative Media for Making Him Look ‘Scary’"},{"comment_id":"10153694133994330","commenter_b":"Feminists live in fantasy land","commenter_a":"She should be in a cheer outfit not a football jersey if she was to play that's fine make a all female team","post_message":"She's in 8th grade and she's no joke on the football field.  That's right, we said she!!  Watch NBC Connecticut news at 6:20 tonight as NBC Connecticut's Kevin Nathan brings you her amazing story. --> @webpagelink"}]
