[{"comment_id":"10153828127059749","commenter_b":"\"...coming to a fridge near you.\" No! No it's not! I don't associate with those they of people!","commenter_a":"George had this idea decades ago in form of Pudding skin singles :D","post_message":"We have reached new culinary lows."},{"comment_id":"10153045091301336","commenter_b":"YOU CAN BET YOUR LAST PENNY THAT MR OBOMO HAS HIS GUNS, PLURAL..SHOULD THEIR CHILDREN BE REMOVED, ALL THOSE THAT ARE MAKING THESE LAWS ..HOW ABOUT REMOVING THEIR CHILDREN, THEY ARE IN DANGER IF THERE IS A KNIFE IN THE KITCHEN..OH THEY WANT OUR GUNS..WE MUST STOP THIS NOW..THE CRIMINAL WILL NEVER GIVE UP THEIRS. THEY ARE STOLEN SO NOONE KNOWS UNTIL THEY ARE SHOT SO,THEY CAN ROB THEM.WE HAVE THE MOST STUPID THINGS TO OBJECT THOSE CHILDREN BEING LOVED AND CARED FOR..GET THAT LAWYER AND SHOW THEM YOU HAVE RIGHTS..GO GET THOSE LITTLE ONES WHO ARE NEEDING YOUR LOVE..PLEASE AMERICANS STAND UP FOR THESE PEOPLES DILEMMAS . DEMAND THEY GET THOSE BABIES..GOD BLESS THEM TOTALLY !","commenter_a":"well we better not let foster parents that have a car,knife, prescription drugs,dogs,plastic bags,power tools,bow and arrows,swimmimg pools etc., cause all of theses items can kill!! Get real!!!! The government is trying so hard to take our guns away from us !!! They don't care about these children!! They just want control of our guns and they don't care if children have to stay in orphanages with no hope of having a family to love them!!","post_message":"“I want to help some of these children that don’t have the luxury of a family to love them. Everyone deserves to be loved and cared for.” Valerie and Brian Wilson were denied their request to serve as foster parents because they have legal concealed-carry permits. WATCH more from their interview on 'FOX & Friends Weekend': @webpagelink"},{"comment_id":"10154308446053984","commenter_b":"Unfortunately there is no share here or I would share it. Hate that lying crazy woman. Thanks for that info.","commenter_a":"This piece was copied from another post. It can be found on you tube in something called The Clinton Chronicles. If you're under 50 you really need to read this. If you over 50, you lived through it, so share it with those under 50. Amazing to me how much I had forgotten! When Bill Clinton was president, he allowed Hillary to assume authority over a health care reform. Even after threats and intimidation, she couldn even get a vote in a democratic controlled congress. This fiasco cost the American taxpayers about $13 million in cost for studies, promotion, and other efforts. Y Then President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were Zoe Baird and Kimba Wood both were forced to withdraw their names from consideration. Next she chose Janet Reno husband Bill described her selection as worst mistake. Some may not ...","post_message":"Democratic presidential front-runner Hillary Clinton just revealed that she believes Americans have too many guns in their homes, and I don't think one would have to take too wild of a guess as to what she would do about it if elected president... Do you think a Hillary presidency would be bad for America?"},{"comment_id":"986861908039953","commenter_b":"President Obama is the best. Elizabeth Warren should have run for president because she would have been great just like Obama..STOP HATING PEOPLE. Recognize greatness...","commenter_a":"That's just great Thank you Mr President and Elizabeth Warren , your the best !!","post_message":"They are kicking Wall Street's ass!"},{"comment_id":"749306348569686","commenter_b":"@username - free cell phones started under Bush administration, food stamps under FDR.. try again.","commenter_a":"He is a real man.Best president with class and a brain. That'swhat make people hate him because he has education . and know how to be humble even when haters come along with silly response. HATERS","post_message":""},{"comment_id":"1070629882958022","commenter_b":"Look mr. TopHeavy, when you get pregnant let me know lol. I know many women who smoked while pregnant and had/have extremely healthy babies and children.","commenter_a":"Btw.. I'll call bullshit on this","post_message":"Here's what smoking does to your unborn baby."},{"comment_id":"1744224175810403","commenter_b":"Stupid girls lol","commenter_a":"Jeen Russel how dumbs lool 😂","post_message":""}]
