[{"comment_id":"1641330872574045","commenter_b":"His payment for the presidency","commenter_a":"I just love hearing you babies cry. 8 years of total bullshit from your man Obama, and we never rioted, burned down neighborhoods, dressed up as vaginas and marched (like a bunch of embarassing idiots), destroy businesses, drag old men out of their cars to beat the shit out of them for an Obama sticker, and the list of shame goes on. Trump hasn't been president for 90 damn days and you crybabies are already curled up in the fetal position, sucking your thumbs, squealing and kicking like little piglets. You guys make me smile real big. You're the biggest pile of disrespectful pussies on the planet! Suck it up buttercups, TRUMP IS YOUR PRESIDENT! AND GOD BLESS DONALD TRUMP!","post_message":"This isn't a joke."},{"comment_id":"10153355238374411","commenter_b":"People who live in Palestine are Palestinians. People who live in Israel are Israelis. Most Israelis are immigrants.","commenter_a":"Israel may destroy the Gaza Strip but they will never destroy the Palestinian Spirt. Long Live Palestine!","post_message":"A new flotilla with humanitarian aid on board is going to help people in Gaza; the mission is beyond political polarization and in full compliance with international law, Osama Qashoo, member of the first flotilla to Gaza, told RT In The Now."},{"comment_id":"842473555789986","commenter_b":"Why doesn't she leave planet earth!","commenter_a":"And the bad news is what?","post_message":"She's gone."},{"comment_id":"1281953805157000","commenter_b":"Fuck Obama and his white trash skank bitch Hillary","commenter_a":"Our wonderful President, sorry to see you and your family go.","post_message":"President Obama has been known to break into song from time to time..."},{"comment_id":"681728708652647","commenter_b":"why would anyone want a sick old lady in office @webpagelink","commenter_a":"We are stronger together unless you're a minority! Then people like @username and Obama will use your vote every single election while destroying your family and destroying your wealth! If you do get out of the horrible system that they have helped create, they will take credit for it when you have success! She is an embarrassment!","post_message":"We're stronger together—and the diversity of our athletes in Rio proved it."},{"comment_id":"10153100399077377","commenter_b":"We The People, continuously have said, \"Impeach Obummer Now!\" He has by far surpassed any former president with impeachable offenses, but not one congressman has started the process! Do we sit here yelling in vain? What are we waiting for? We all know he is not looking out for our best interest. And yet our congress wonders why Donald Trump is FIRST in All POLLS! Let's MAKE AMERICA GREAT AGAIN! VOTE FOR DONALD TRUMP","commenter_a":"They are always talking about working and being hard working. When someone tries, the republicans shut them down. Make up your freaking minds , republicans. Or is it you people to work at what you say, for the pay you say, when you say, without any remarks or compensation . That's called slavery. Republicans ended that years ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"},{"comment_id":"10153120614663203","commenter_b":"Women have degraded themselves to unbelievable depths. How sad, how very very very sad.","commenter_a":"This movie distorts how Love is supposed to be expressed. Women deserve better than to be chained and beaten.","post_message":"Say no to porn. Boycott 50 Shades of Grey, the movie: sign the petition"}]
