[{"comment_id":"598181650332929","commenter_b":"If this is a representation of the caliber of people America is attracting we're in trouble. It's obvious that we seem to attract a large criminal element, and what does that say about America??? It says we're soft on immigration and soft on criminals, it also says that our Social Services are out of control and way too generous. Trust me these illegals KNOW that they well be given everything for free !!!! and that they can yell Police brutality and that they can do anything they want and get anything they want...welcome to liberal socialism..","commenter_a":"Pigs go to market","post_message":"I agree!"},{"comment_id":"10153199702710095","commenter_b":"We'll soon be seeing the kids wearing these shirts. Happens every election. Thanks for helping to clothe the poor in Africa and South America.","commenter_a":"Please take the time to read my little rant! And the article! Monday morning trash x 2 floors.. Plus 6 bathrooms to wipe up and make presentable, a floor and a half to sweep and mop, vacuum 1 study room, then I can begin in my own bathrooms according to schedule.. Ive mopped my half of 5th and finished up there about to sweep and mop my own whole floor.. All for $7.57 an hour.. Oh and I left our the part about the beer poured all over the floor near and in back of fifth floor trash cans.. Im not usually a complainer and I really feel sorry for the people that have been here longer than me. Pack the students in and don't worry these petty people will clean up whatever the students can throw at them.. I was also promised a raise after 6 months of my ...","post_message":"New Jindal for President shirts are available. Buy one today."},{"comment_id":"10153077775262994","commenter_b":"Linda shove it up your butt. Lions all the way!","commenter_a":"Detroit needs to suck it up, quit whining, and get over it!","post_message":"What more can he say?"},{"comment_id":"1171652696248712","commenter_b":"You used the word \"was\" almost every other sentence and, rest assured, you took advantage of her \"used to be\" caring & living and giving up her career for her, like a dog. But doggier....she \"kept\" you. She got you back. By completely NOT ANYTHING like what you thought you married. She's an evil, money-hungry, evil, liar, in a position in government she shouldn't even be a janitor that empties her garbage can, ugly (well, she's always been ugly) and a moral-less female. So I guess it does end up how it should be in the end. She should sit in jail the rest of her life. You two are the epitome if what a marriage should not ever be. And you sound proud! You're both despicable.","commenter_a":"Terri Bock","post_message":"\"I married my best friend. I was still in awe after more than four years of being around [Hillary Clinton] at how smart and strong and loving and caring she was.\" – President Bill Clinton"},{"comment_id":"1703284416593951","commenter_b":"Cruz pussy fake!","commenter_a":"Not true and you know it.","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"},{"comment_id":"10152775428266051","commenter_b":"Tell the Moms to buy it themselves.","commenter_a":"How low can you get.","post_message":"These moms decided to e-mail their daughters’ class and ask for everyone to pitch in for their birthday gifts. Here’s how one mom responded to that."},{"comment_id":"10154335392498812","commenter_b":"learn the law because you look like an idiot. TRANSGENDER people can use the bathroom, not men like you and I. I cant just say oh I want to go pee in the ladies room. that isn't how it works. I have a friend who is transgender and her license now says female. she looks like a female. should she go into the mens room? the law is for people like that, not just people who decide today to go in the opposite sex bathroom.","commenter_a":"I won't be listening to them anymore!!! Transgender people are not the only ones with rights,,,if you're a man who wants to use the ladies room get a sex change ....Liberalism is ruining our country,,,,what was a constitutional republic is turning into a socialist hell hole","post_message":"Pearl Jam cancels North Carolina concert, calling HB2 law \"a despicable piece of legislation that encourages discrimination.\" @webpagelink"}]
