[{"comment_id":"1269429443084021","commenter_b":"I prefer the lady in the center.","commenter_a":"I bet I can tell you which one sells the most copies haha.","post_message":"For the first time ever, there are three different Sports Illustrated Swimsuit covers – representing women of all shapes and sizes. @webpagelink"},{"comment_id":"944665885579479","commenter_b":"There is something seriously wrong with this monster. Send him straight to the chair!","commenter_a":"the devil lives here","post_message":"#CharlestonShooting suspect #DylannRoof has arrived in Charleston, SC. Authorities released this new mugshot. @webpagelink"},{"comment_id":"501076896740857","commenter_b":"Please jailer give that crazy lady a good short hair cut. Get rid of that horses tail.......","commenter_a":"She wants more of the spotlight I do hope that they send her back and let her stay there enough of her do your job or resign enough of you","post_message":"Send her back!"},{"comment_id":"10157653306165354","commenter_b":"Vote Trump 2016 to keep Hillary out of the White House.","commenter_a":"What about giving those jobs to jobless Americans?","post_message":"REVEALED:"},{"comment_id":"10154282373471636","commenter_b":"@username the uk intends on putting it's own citizens first. .to achieve this we intend to control the flow of immigration here ( not close them) the problem with the EU free movement is that the poorer member citizens prefer to go and live in the more welthiest members causing a flood in the labour market. .all other countries outside the uk have this policy","commenter_a":"They realise they can't risk all the british emigrants in the EU, the majority of them being pensioners, returning to the uk and putting a financial and physical strain on things like the health service.","post_message":"Excellent"},{"comment_id":"10154062692302439","commenter_b":"How will all the \"empowered\" women of America take this? I say there will be a revolt.","commenter_a":"Has the U S stooped so low. No gentlemen, no ladies, no gender. Just human bodies. Numb, mindless zombies.","post_message":"Another gift we can thank the feminists for. Let's see; the epidemic of single motherhood, the breakdown of the American family, the street vernacular of \"bitches and hos,\" the emasculation of men, defense of Islamic misogyny, suppression and oppression, silence on sharia, and the bone-crushing responsibility of one woman being mother, father, breadwinner, chief cook and bottle washer we owe to the feminists. And now this - one can only imagine what the likes of the Islamic State will do to our female soldiers."},{"comment_id":"10153432953951130","commenter_b":"Its not hard at all. Check craiglast there everywhere. I can sell you mine. Thats the point!!","commenter_a":"It's such a pain in the ass to get guns now. Why would anyone want more gun laws?","post_message":"A majority of Americans want stricter gun laws, and now we have the poll numbers to prove it."}]
