[{"comment_id":"10154122931756756","commenter_b":"Ugly, spoiled killer.","commenter_a":"The apple didn't fall far from that tree.","post_message":"In a video released by Mexico's immigration institute, an expressionless Ethan Couch is shown being led into a truck and placed on a plane at a Mexico City airport."},{"comment_id":"938755412831598","commenter_b":"If she's a white lady, I'm a white lady.","commenter_a":"I am surprised she still has those white teeth in her mouth wow.","post_message":"Let's be honest. If this woman was black, she wouldn't be smiling for a cute little mugshot...because she'd most likely be dead now. #WhitePrivilege"},{"comment_id":"10154047358589641","commenter_b":"But same time they let undocumented emigrants to enter their countries. This is why Europe never will be united.","commenter_a":"Crazy! Why do we want to go to Europe anyway when we have so much to explore and see in the great USA !","post_message":"The European Union is considering requiring Americans and Canadians to apply for visas, even if they only want to come for a short vacation."},{"comment_id":"1725328477744790","commenter_b":"A blow job from what you call an ugly woman is still a blow job. We drank, screwed, and partied in cemeteries when I was a teenager.","commenter_a":"Cemetary, huh? Could be 'cause the kid didn't wanta be seen anywhere with such an ugly woman.........","post_message":"Police say that an officer caught 49-year-old Kelly Aldinger in the act with a 17-year-old student at Easton Cemetery."},{"comment_id":"1184855771553940","commenter_b":"I won't be watching @username tonight. I will not be watching that Hag!! Why is @username making such a big deal out of THAT LYING WITCH??","commenter_a":"Here's me not watching","post_message":"\"We know that Russian intelligence services... hacked into the DNC.\" Today on \"Fox News Sunday,\" Hillary Clinton commented on the recent hack and Donald J. Trump's attitude towards Putin."},{"comment_id":"932721720195935","commenter_b":"who is wiping out Africans?","commenter_a":"They need to do something before brazil becomes the next africa or Australia....white people taking over while the indigenous people get wiped out.","post_message":"EXCLUSIVE: Brazil, the World Second-Largest Black Nation, Has Been Taken Over by an All White Male Cabinet #ABSArchives"},{"comment_id":"999172976798392","commenter_b":"Corruption in the state department is at an all-time high.","commenter_a":"Where does obeying law fall in this action? Do you collectively feel above the law and justified in defying it? Perhaps a bit of prison time and being branded as felons for the rest of your miserable entitled life will bring you back to your senses.","post_message":"¯\\\\_(ツ)_/¯"}]
