[{"comment_id":"697839387073306","commenter_b":"She should have been arrested months ago!!!! Arrest her now and put her away for good!","commenter_a":"Our Justice Department is corrupt. They will not take appropriate action.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"},{"comment_id":"10153937537377894","commenter_b":"No wonder she's an Ex","commenter_a":"Wait. So she is saying he disrespected the flag, what he is doing is wrong, and after all of that she has the nerve to say he needs to be humble? The stupid ass Star Spangled Banner is NOT the Pledge of fucking Allegiance, first of all. I wish people would recognize that. Second, draft dodging is ILLEGAL, you \"allegedly\" advised Muhammad to do that and now you want to split hairs about the \"right way to protest\"? Third, how is he not humble and if he wasn't why should he be? Muhammad Ali famously talked all types of shit now she telling a nigga to humble himself, bih, go away.","post_message":"Girl, Bye! Muhammad Ali’s Ex-Wife Says Colin Kaepernick Should ‘Get Off His High Horse and Humble Himself’"},{"comment_id":"500763203381607","commenter_b":"This crap started with Clinton. Oliver North warned us what was coming.","commenter_a":"He warned Bush,but wasn't taken seriously.","post_message":"Do you agree or disagree with Donald Trump on this?"},{"comment_id":"1012223128870741","commenter_b":"Finally, someone says something. Geez, spot on Sean Penn 😊","commenter_a":"All trash talk by liberal wimps","post_message":"He's right. America must never forget who is truly responsible for creating ISIS. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"551488165033429","commenter_b":"Wendy is my bitch","commenter_a":"@username wendy is the most annoying motherfucker. Bitch always has something to say, never intelligently or well spoken, and always speak out of her ass. SHHHHHHHHHHHHHHHHHH.","post_message":"This is how you shut down breastfeeding shamers. Read more about Alyssa Milano's activism here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"1335611113123776","commenter_b":"Give her a Public Horsewhipping too......Fraud","commenter_a":"One down, thousands to go.","post_message":"Former Pennsylvania state Attorney General Kathleen Kane, who came to office on support from gun control groups, has been sentenced on felony perjury charges."},{"comment_id":"1197525123667075","commenter_b":"Time for her to be fired!","commenter_a":"That also includes Mountain Dew, Mug Root Beer and Mist Twist, Aquafina bottled water, Propel water, Gatorade and Rockstar Energy drinks. Also all Frito-Lay products including Fritos, Cheetos, Lay's and Ruffles potato chips and Rold Gold pretzels. All Quaker products. This is only a partial list.","post_message":"Follow us for more at President Trump"}]
