[{"comment_id":"10153354052466770","commenter_b":"Who cares what a woman beater thinks fk off chrissy","commenter_a":"Racist lives matter","post_message":"He had nothing good to say."},{"comment_id":"10153527468435399","commenter_b":"Now,that's got to be a bunch of crock,they don't even know that hag.","commenter_a":"Why is a rally in Peru for a clerk in Kentucky hard to fathom? Does Rob Schneider work for this firm?","post_message":"According to a report by ThinkProgress, the rally never actually happened."},{"comment_id":"10156451475900500","commenter_b":"Fire her","commenter_a":"So this woman or all the people she was ordering food for did not have a cell phone to order lunch? It should have never been done with a 911 phone.","post_message":"DANGEROUS SITUATION- What do you think of her punishment?  @webpagelink"},{"comment_id":"10157246765295294","commenter_b":"Deport this piece of crap!","commenter_a":"He can be charge with a misdemeanor for starting a fire with out a permit","post_message":"An expression of free speech? Or a crime? That's the debate sparked by this man's arrest."},{"comment_id":"10154031292643132","commenter_b":"She still looks like a dude","commenter_a":"Good for her! She took care of herself, had a HEALTHY weight gain, and gets to enjoy the results.","post_message":"It's hard to believe this is just after ONE week!"},{"comment_id":"10153500455846336","commenter_b":"Mr Rubio: While it might be nice to possess 'class', we don't need 'class' as much as we need a 'leader' who has the nerve to say what's on everyone's mind and then do something. It remains to be seen if he can get past the nefarious 'electoral college' that elects the president no matter what the 'popular' 'people's' vote is.","commenter_a":"how about instead of commenting on another persons comments you actually tell us how you are going to fix all the crap wrong with our government, waste and abuse of tax payer dollars, so how are you any better??? so tried of you all","post_message":"Sen. Marco Rubio addressed immigration and Donald J. Trump's controversial comments. @webpagelink (via Fox & Friends)"},{"comment_id":"909734362398134","commenter_b":"Their already lawless. Nothing but thugs in many of the public schools, who by the way are running the schools. The kids tell the adults what to do!","commenter_a":"Sounds like she wants to give 'minority students and other risk youth, including migrants and LGBT students.' a free pass whenever they get into trouble. How about teaching them to OBEY the law?","post_message":"Things go from bad to worse..."}]
