[{"comment_id":"530286710492597","commenter_b":"When are we going to smarten up and deport Muslims and ban Islam once and for all.","commenter_a":"The Quran says it's ok to lie to the infidels . Can't believe anything they say","post_message":"\"How would you stand before God and answer to your crimes against… thousands of innocent people – Muslims, Christians and other minorities? You do not speak for us. You do not represent us. You are an aberration. You are an outlaw.\"  The CAIR  national director condemned ISIS and their supporters in the wake of the #OrlandoShooting."},{"comment_id":"10154743598641323","commenter_b":"Yep. Greedy bastards.","commenter_a":"Ladies and gentleman. I present to you - Capitalism at its finest......","post_message":"Michelin-starred TV chef Michel Roux Jr. has been paying some kitchen staff at his Mayfair restaurant less than the minimum wage, the Guardian can reveal, while charging over £60 for one starter."},{"comment_id":"10154397725896509","commenter_b":"She should teach her son how to respect women","commenter_a":"Cold Autumnbreeze","post_message":"Sarah Palin speaking at a Donald J. Trump event: \"We need to elect a commander in chief who will respect our troops... you realize that our vets deserve a commander in chief who will let them do their job and go kick ISIS ass.\" @webpagelink"},{"comment_id":"10153420455089087","commenter_b":"Oh Brett. That's terrible. I am the wife Brett. I live in Texas, 10 generations next door to Mexico. Are there bad people there coming here? yes! Do we need immigration laws? yes! Will a wall stop it. No Brett. It wont matter how beautiful the wall is or how much it cost or who pays for it. Those drugs you smoke are going to make it here. Nothing you can do about it. The cartel will get immigrants and dope here. If anything there will be more killing and keeping that wall up is going to be draining on the economy. It's impossible.","commenter_a":"Trump's ability to showboat and boast out loud has a hypnotic impact on people who should know better. Please don't buy into Trumpmania.... he is all talk and I thought we were tired of that. You people have short memories. He was a full on liberal democrat just a few short years ago. Trump is telling you what you want to hear. He has no intentions of fulfilling these vocal obligations. It's all lip service and he will cater to his businesses before the people. Just because Bush isn't a loud mouth narcissist doesn't mean he can't get the job done. Trust me, you will never be so sick of anything as you will be of The Donald and his ego driven power play.","post_message":"“Donald I’ll take you on one-on-one in a debate, any time, any place,” Jeb Bush declared. “You name it and I’ll do it.”"},{"comment_id":"1832691560303641","commenter_b":"Good don't want you back in the White House!","commenter_a":"Thank goodness, not that she would ever get elected after her husband's lousy job.","post_message":"It looks like we'll never see an Obama in the White House again. Is that good news to you?"},{"comment_id":"778618008970820","commenter_b":"I am hoping for a selective hailstorm just on the protest groups, with BIG stones.","commenter_a":"This is not protesting. These are forceful dictator type actions that are not consistent with what our country is about. And if the whole point of this is to start up Martial Law, you have no idea what you are trying to start. I am confident God is bigger than this. :) Lord, protect our freedom from dictators and those who wish to act like them.","post_message":"These left-wing groups have vowed to \"shut down\" Trump's inauguration. Here's how."},{"comment_id":"1823601691207734","commenter_b":"Share it with everyone, we must insure Hillary is not elected!","commenter_a":"\"BILL CLINTON'S LOVING WIFE --- by DICK MORRIS If you happen to see the Bill Clinton five minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware as I was there for most of their presidency and know them better than just about anyone. I offer a few corrections: Bill says: \"In law school Hillary worked on legal services for the poor.\" Facts are: Hillary's main extra-curricular activity in 'Law School' was helping the Black Panthers, on trial in Connecticut for torturing and killing a 'Federal Agent.' She went to Court every day as part of a Law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: \"Hillary spent a year after graduation working on a Children's rights project for poor kids.\" Facts are: Hillary interned ...","post_message":"He actually said it."}]
