[{"comment_id":"10153756780250695","commenter_b":"Respect everybody-easy on the sir crap","commenter_a":"the police and are like any other person they put there pants on and go to work ........they chose the job we didnt force it on them.i see no reason to buy there meals and say sir and ma'am to them.i work hard for what i have and i get nothing free so why should police get anything free.they have to come if you call them anyway........................!","post_message":"\"Put their charities on your giving list. If your local law enforcement has volunteer-citizen job opportunities, sign up.” Do you agree with his idea?"},{"comment_id":"10153941294344342","commenter_b":"Trump = hate, fear, Hillary = corporate rep, liar, Bernie = peace, unity. He is right. I'd be happy to vote for him. Sad to just vote because I dislike someone more than the other option.","commenter_a":"Bernie wants to ban hydraulic fracturing everywhere. This would significantly reduce American energy production and directly cause oil&gas prices to raise. Not only this, the United States would have to depend on foreign oil once again. There is no reason to ban hydraulic fracturing and deny our citizens the right to exploit their resources for the benefit of us all. If you are convince fracking cause water to catch fire. I really encourage you to pull back a layer and devour the research. You can start by researching academic studies from Standford and Ohio University regarding hydraulic fracturing. Some of the chemicals used in the prop or fluid are hydrocarbons. Ofcourse if you go to ecowatch or earthjustice you will get an exaggerated and depressing perspective that is meant to excite you and encourage you to make a donation. So the few activist can pay for their mortgage and car ...","post_message":"\"I am running for president because I want to give the American people a real choice in this election.\""},{"comment_id":"10156658380360354","commenter_b":"Has anyone noticed how the name has changed from refugees to migrants. They are not migrants they are foreign invaders Some people will never learn. You need to know who you are letting in your country. Know the history of Islam. We need to wake up in this country stop paying people to come here and destroy us. This was copied from a post by William Parrott When politically correct, tolerant, and culturally diverse societies agree to Muslim demands for their religious privileges, some of the other components tend to creep in as well. Here how it works. As long as the Muslim population remains around or under 2% in any given country, they will be for the most part be regarded as a peace-loving minority, and not as a threat to other citizens. This is the case in: United States Muslim 0.6% Australia Muslim 1.5% Canada Muslim 1.9% China ...","commenter_a":"How can anyone say that their religion does not allow this violence against non - Muslims?","post_message":"“How dare you run away from us?” one Muslim man allegedly yelled. “Christian girls are only meant for one thing. The pleasure of Muslim men.”"},{"comment_id":"895899747125716","commenter_b":"These child rapists are our allies?? No F-----G way!!!","commenter_a":"Please help this soldier who was trying to stop the rape of a boy!","post_message":"All of Congress should support this...."},{"comment_id":"10153749072149411","commenter_b":"This is why aliens don't want to talk to us","commenter_a":"There are no aliens from other planets riding around in spaceships people. If you really want truth read the Bible.","post_message":"An alien invasion unlikely at all?"},{"comment_id":"1078994498821381","commenter_b":"This is OHBLOWME's army!!","commenter_a":"Obama has blood on his hands","post_message":"BATON ROUGE KILLER'S SOCIAL MEDIA Bought Into Obama's Anti-Cop \"JUSTICE\" Rhetoric [Video] Obama is heard by people like this killer...blood on Obama's hands!"},{"comment_id":"10152880805672377","commenter_b":"Worried ???? then I suggest she better get her BUTT in gear and start letting us know what HER AGENDA is !!!!!","commenter_a":"Go Betnie, GO. We need candidates that are not corrupt and money grabbers without all of the baggage the Queen carries. Someone who has the interest if the country in mind not self- aggrandisement.","post_message":"Hillary Clinton's campaign is \"worried about\" the challenge being posed by Sen. Bernie Sanders, whose popularity and poll numbers are continuing to grow."}]
