[{"comment_id":"10153770425869153","commenter_b":"You can't possibly be that stupid Christine ....","commenter_a":"just read where radical islamic muslims will come in with Syrian refugees so yes I agree with Trump","post_message":"What are your thoughts on Donald Trump's comments?"},{"comment_id":"717054201797155","commenter_b":"Yeah, she'll get sammich stains all over the front.","commenter_a":"That's a strange dress to wear in a kitchen... Doesn't she know women are better off today than being nothing more than owned objects","post_message":"Kellyanne Conway dressed as the era Trump wants to take America back to. #InaugurationDay"},{"comment_id":"10153932069946523","commenter_b":"Lana Gonzalez @username I changed it just for you guys feel better now","commenter_a":"This is irrelevant and does not Justify his life being taken !!!","post_message":"Bryan Polcyn - FOX6 Investigators - did a little digging on the criminal past of Sylville Smith. Take a look."},{"comment_id":"10152794611951636","commenter_b":"It is just that!.we women have no say....we just get on with it!.","commenter_a":"Really?? A marketing campaign for icecream?? You don't know half of what happens .","post_message":"We’re not supposed to break the silence and secrecy surrounding women’s bleeding bodies..."},{"comment_id":"1007375585988585","commenter_b":"You're a bitch brady","commenter_a":"Yet another reason to dislike Tom Brady.","post_message":"Tom Brady's support for Trump may be as soft as his balls."},{"comment_id":"900759883386314","commenter_b":"Hillary's supporters don't care that she's a sold-out Wall Street neocon. It's weird.","commenter_a":"She is the ONLY person on earth to know how it felt to take that place in history........glad she was the one who knew how to really cherish it for all of us... thanks Hillary... Girl, you rock!","post_message":"When history's in the making, sleep can wait."},{"comment_id":"10152935286327426","commenter_b":"Medical \"miracle.\" Plus, you're not dead yet, so you're dreaming of what you expect to see. If you were convinced you were going to an eternal punishment, you'd have a very different dream outcome. Also, funny how this doesn't work trans-culturally, don't you think?","commenter_a":"Amen","post_message":"His family is convinced it was a miracle."}]
