[{"comment_id":"10153015286404641","commenter_b":"Check out dis video @webpagelink","commenter_a":"Pls. friends click the link and like the photo of cedrick he's good and intelligent student he doesn't have money for his college. your like is to help for his scholarship and share to your friends .. we really need ur help .. just click the Link below .. Please Like Candidate #1 .. Thank you po .. :-) @webpagelink","post_message":"Nigerian voters refuse to be silent in wake of election delays @webpagelink"},{"comment_id":"10153434645860329","commenter_b":"no, #4 killllllled me. so funny.","commenter_a":"Matt Megan Freeman @username Megan KellyThis is actually the funniest thing I've read in a while.","post_message":"LOL"},{"comment_id":"10154709341603984","commenter_b":"Jealous bitch","commenter_a":"Could it be Mark Cuban is trying to get Trump to look like he would sell his party out for similar money Hillary has taken? :Edited, nah he needs to find a way to ruin Trump. He is looking for a weakness to exploit. I'm sure of it.","post_message":"Billionaire Mark Cuban just stunned everyone with a jaw-dropping offer for Donald J. Trump that NO ONE expected. There's something he wants the Republican candidate to do, and he's willing to give something massive in return..."},{"comment_id":"10154422219571509","commenter_b":"Guys it's an easy fix. Just vote for whoever is black in any movie that's how they want it","commenter_a":"I never watch that mess anyway. I do love movies but I'm not into Hollywood all patting each other on the back.","post_message":"When it comes to diversity at The Academy Awards, most Americans shrug their shoulders."},{"comment_id":"941252249248581","commenter_b":"Oh Bill, you handsome devil...lol, NOT!!!","commenter_a":"It couldn't happen to a more deserving bunch of lying propagandists Hell Bent on fomenting Hate, Racial War & Spewing Male Bovine Feces.","post_message":"Fox News has enlisted two of their biggest twits to play the victim card and accuse Dish Network of censorship as the battle between the two rages on for a fourth straight week."},{"comment_id":"10153439531452235","commenter_b":"Bitch is bucking for re-election.","commenter_a":"As Governor, I would think she had the power to do so on her orders.","post_message":"WHOA!"},{"comment_id":"10158313140330206","commenter_b":"She's obviously drunk.","commenter_a":"The employees shouldn't have stood there like that and just took it. I would've gone straight for security. The other customers are waiting.","post_message":"This woman takes the cake for being one of the WORST customers."}]
