[{"comment_id":"10152926251994071","commenter_b":"Their porn is awesome. Fully filled girls, unlike the skinny twigs the US has to offer.","commenter_a":"Small wonder. Have you ever seen their porn? Horrifying.","post_message":"It's a 'time bomb.'"},{"comment_id":"10153694012485779","commenter_b":"Smart women!","commenter_a":"See some women aren't as smart as men","post_message":"Part support group, part grassroots political organization, Republican Women For Hillary was founded in Washington, D.C. where GOP women were commiserating about Donald J. Trump. Meet the Republican women who are backing Hillary Clinton."},{"comment_id":"10154029813093812","commenter_b":"While we are at it, let's ban people like you for having guns.","commenter_a":"Ban all Muslims from owning guns","post_message":"JUST IN: Man accused of shooting Philadelphia officer pledged his allegiance to ISIS and used stolen firearm, police say."},{"comment_id":"10153085333861336","commenter_b":"Go back in the basement and smoke another duby.. This is an adult conversation sight.","commenter_a":"If Israel has nukes Iran should be able to as well. However, in a perfect world neither country would have them, as Israel has threatened to use them and Iran is a loose cannon.","post_message":"CIA Director John Brennan discusses ISIS, Iran’s nuclear program and Putin’s global ambitions, this week in a 'Fox News Sunday' EXCLUSIVE!  Check your local listings and tune in to Fox News Channel at 2p and 6p ET."},{"comment_id":"10154248049506337","commenter_b":"Chevy only beats up womens self esteem which is better I guess. Do your research.","commenter_a":"Chevy is awesome leave him alone. Seagal is a little bitch that beats women. He's hardly even a celebrity. Chuck Norris should round house his ass.","post_message":"WHEN THE HOT SEAT GETS TOO HOT... From Chevy Chase to Steven Seagal, these celebs just couldn't handle getting roasted. Check out 'Comedy Knockout' on truTV. @webpagelink #ad"},{"comment_id":"10153152461759170","commenter_b":"Because many people don't understand the effects of war on our men and woman of the war they fight overseas and home. It's the sadest thing I've come to know and yet sooooo many people can't understand. Watch and learn what they suffer along with there Loved ones. Then remember there sacrifice!!","commenter_a":"No they don't hate war movies, they hate war movies when an American is the Hero.","post_message":"No one should be surprised that American Sniper didn't win much at last night's Oscars..."},{"comment_id":"1155392447817135","commenter_b":"Since she can't take the heat she gets out of the debate. (Kitchen).","commenter_a":"She knows she has already taken both sides of every topic. There's simply nothing left to lie about.","post_message":"Would Clinton benefit from another debate with Sanders?   She doesn't think so."}]
