[{"comment_id":"10153126119146770","commenter_b":"You aint no Woman Be otch","commenter_a":"What a joke, your no hero you did this by choice!","post_message":"Protesters hurled insults at Caitlyn Jenner as he left a Chicago hotel yesterday."},{"comment_id":"10154771311354312","commenter_b":"Suck it up buttercups, she lost, move on!","commenter_a":"Trump won so how is it that anyone can change that! that would be like all the Indian fans protesting the Cubs winning the world series and changing it to the Indians winning! he won just like any other president has won! I did not want Obama in for the second 4 years as a lot of people didn't but you did not see all of us out there doing what Clintons people are doing. If you ask me all of Clintons people are the problem here. If Trump does not do his job then impeach him! but give the guy a chance to MAKE AMERICA GREAT AGAIN!!","post_message":"People upset about Donald Trump's election floated an option that could deny him the White House."},{"comment_id":"1162973243743146","commenter_b":"@username haha why does she always look psychotic?","commenter_a":"Bristol Is Pregnant Again Because...","post_message":"Hypocrisy at its finest."},{"comment_id":"10154768873318132","commenter_b":"First off who the hell is she ? I've never even heard of her . Lol like seriously what does she do ? Furthermore nobody really cares about her opinion because it's a very poor one. More important things going on in the world then you crying about someone not hitting on you he probably doesn't even know who she is","commenter_a":"It seemed pretty clear to me that she was poking fun at herself, talking about her own feeling, not bashing the athlete in any way. Can everyone just relax and remember that everyone is entitled to their opinions and their own insecurities and maybe, just maybe, not twist every single thing that anyone says into something offensive? Geeeeeeeez!","post_message":"Lena Dunham is setting the record straight on her comments about NFL star Odell Beckham Jr."},{"comment_id":"927164187324440","commenter_b":"A real woman appreciates foreskin and it's functions. I prefer a whole full functioning penis.","commenter_a":"Yeah well.. circumcised guys get blown more often scientific fact","post_message":"And now for a quick but fun history break from CollegeHumor. - Rollie Williams"},{"comment_id":"10153945489322522","commenter_b":"And more illegal aliens in states Trump won","commenter_a":"If the electoral College didn't exist. There would be no need to campaign outside of New York and California. The election is over. The results are in. Clinton conceded. Trump won. Move on. If America really wanted to elect Clinton, perhaps more Americans should have voted!","post_message":"It's official:"},{"comment_id":"1742093019366838","commenter_b":"SUCKS","commenter_a":"Lisa Nicklas Villota!!!!!","post_message":"Thank you to the LGBT community! I will fight for you while Hillary brings in more people that will threaten your freedoms and beliefs."}]
