[{"comment_id":"10153153528689071","commenter_b":"You mean in the houses where tragedy still occurred, like drownings, accidental poisonings, falls etc? Not the sharpest tool in Lowes are ya?","commenter_a":"This sort of thing happens less often in houses without guns, but I'm sure that's just a strange coincidence.","post_message":"An awful tragedy happened in Chicago."},{"comment_id":"1187848264597052","commenter_b":"Do you want to be responsible for a bus full of kids? Better to keep them home than risk it","commenter_a":"Why don't people buy chains? I don't get it","post_message":"JUST IN: Per the Flagstaff Unified School District, all FUSD schools will be closed on November 29th due to icy road conditions."},{"comment_id":"618975741614411","commenter_b":"She's just mad no one wants to grab her pussy","commenter_a":"🙄","post_message":"Can you believe this, folks?"},{"comment_id":"10152880521321051","commenter_b":"What did this person drink in her baby bottle??","commenter_a":"I would trip if my kids rode with strangers even if they were cops. I don't trust anyone with my children. You can't trust anyone today.","post_message":"This woman is outraged that the police gave her daughters a ride to school."},{"comment_id":"10153876614269024","commenter_b":"Kick this fucker right in the mouth","commenter_a":"What a poor excuse for a Mayor.","post_message":"'@conservativebyt"},{"comment_id":"10153510348059411","commenter_b":"serious lips on that lady, shes got Grace Jones beat even.","commenter_a":"She has no ideas worth repeating-FIRE her.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154838480761729","commenter_b":"Nothing will stop this because they want to become martyrs and are ready to die for Allah. Killing them before they kill you is the only solution.","commenter_a":"Here we go again, it's the guns! Oh wait, I thought ALL guns were illegal in Germany? They need to tell these criminals that they are not supposed to have guns! How dare them break the law and get illegal guns! They need to make more gun laws because that will make it harder to get guns.","post_message":"UDPATE: Authorities warning MASS TERROR ATTACK UNDERWAY  Manhunt underway, public transit shut down..."}]
