[{"comment_id":"10154041877500586","commenter_b":"Oh really Dan... sounds like Nevia has your panties in a bunch, bc she struck the right nerve.","commenter_a":"Really Fox 13 this is your news let's hear about something that actually matters for once please","post_message":"So how many of your passwords made this list of the worst from 2015? It turns out, longer isn't always better."},{"comment_id":"1512598459048144","commenter_b":"Your the dumb ass!!","commenter_a":"You people are stupid if you think illegal immigrants get assistance. They stay in hiding so that they don't get caught and sent back. They can't get assistance without a social security card. Stop listening to dumb ass Trump.","post_message":"Trump says his plan to build a wall at the border is absolutely not negotiable. Do you support or oppose the wall?"},{"comment_id":"1096493903701292","commenter_b":"suck republican dick, thomas! asshole!","commenter_a":"conservatives will go nuts in: 3, 2, 1...","post_message":"More than time to recognize that Black Lives Matter and there are too many incidents of police officers who believe otherwise."},{"comment_id":"1322864184423514","commenter_b":"Tear down their tereorist head quarters that's what all mosque's are . And deport them all","commenter_a":"good on you Donald deport them all","post_message":"TRUMP IS GOING TO CLEAN UP THE INSANITY THAT HAS BECOME AMERICA!"},{"comment_id":"10153685089913037","commenter_b":"@username how about we deport you Michelle? You see my Apache and Mexican ancestors were here before you ancestors ever set foot, RAPED and KILLED my people. Texas belongs to us. So, get it straight. YOU are the illegal here Michelle.","commenter_a":"Omg if you are legal he doesn't want to send you back. If you are illegal you should be in jail anyway","post_message":"\"It was kind of demeaning.\""},{"comment_id":"10153678565299062","commenter_b":"*** Important","commenter_a":"Support tradition marriage","post_message":"SHOWDOWN: Officials and lawmakers continue to clash over same-sex marriage debate in Austin."},{"comment_id":"10153052525021748","commenter_b":"Does she know how many Muslims Obama kills every day?","commenter_a":"She's really losing it.","post_message":"\"Muslims would like to take over the world and establish their caliphate, and Obama has let so many Muslims in.\""}]
