[{"comment_id":"1386005081478024","commenter_b":"Thank God! We are the voice of this babies.","commenter_a":"So let me get this straight.. These wingnut lefty/leberial woman who are marching all over today are really attempting to fight over their treasured planned parenthood. They want to keep the free goverment \"healthcare\" for women. Correct me if I'm wrong but, isn't their local welfare office giving out medical cards to cover 100% of their \"healthcare\" needs?? Oh wait, this is primarily an adult sized temper tantrum because they want the right to abort babies. PLAIN AND SIMPLE. Can't wait for Trump to sign the bill for defunding😡🇺🇸","post_message":"Baby-killing organizations that have been using government money to fund their sick, worldwide abortion agenda just got some seriously bad news... here's what Donald J. Trump just did to send them into total panic.  A lot of liberals are going to be furious about this... what do you think?"},{"comment_id":"10154978803416509","commenter_b":"@username even your pussy is ugly...","commenter_a":"Anyone who is upset, mad or sad about this, please evolve otherwise you are apart of the pedophile culture.","post_message":"In a nod to a more modern approach, the Miss Teen USA pageant is ending the swimsuit portion of its competition."},{"comment_id":"806494949541082","commenter_b":"The same way , but don't get caught . You will go to jail and stay . They get a pat on the back !","commenter_a":"Bullet to the head","post_message":"Muslim Terrorist Arrested After Threatening FOX In The Worst Way Possible.  Radical Islam is becoming a domestic threat.  How should America respond?"},{"comment_id":"10156189535540354","commenter_b":"@username you do know that Sharia Law requires gays to be destroyed?","commenter_a":"I can't imagine any conservative/Republican not standing with Dr. Carson on this.","post_message":"\"Sharia law is so inconsistent with the US Constitution Ben Carson could not be more right.\""},{"comment_id":"946663845429868","commenter_b":"One thing that is jumping out at me about this shooting in South Carolina is the way the community has come together, whites and blacks as ONE community. I look at this and than think back to Ferguson and Baltimore, what a difference. And yet so many times I have listened to liberals post on @username about the hateful, bigoted small minded people of the south. God Bless the people of Charleston and the families of the victims of this hateful crime.","commenter_a":"Hold on, those who love God will see you through, especially, those from that Church and all Churches that love the Lord Jesus Christ.","post_message":"“Oh my lord, he’s done made our life a living hell. What he did was unspeakable.”   -Carson Cowles, Dylan Roof's uncle"},{"comment_id":"868283350028908","commenter_b":"Those women are a group of sick , twisted bitches. But their outlook is the killary twist. Blame the victim . You bitches make all women look bad.","commenter_a":"Take conservative Fox with you","post_message":"This is absolutely shameful. Get this liberal trash off the air immediately. Can we get 30,000 'LIKES' to have this show shut down?"},{"comment_id":"10154589153096336","commenter_b":"The only place Hillary should be is in prison! #trump2016","commenter_a":"MAY HAVE???????","post_message":"Newly released emails suggest a senior Hillary Clinton aide stage-managed her first hearing on Benghazi by feeding specific topics to Democratic Senator Robert Menendez. @webpagelink"}]
