[{"comment_id":"10154167582371770","commenter_b":"LMAO they are their own worst enemy","commenter_a":"Sweet, we probably bought it as taxpayers.","post_message":"Liberals protest Trump by ... setting a Muslim immigrant's limo on fire."},{"comment_id":"10153775888041756","commenter_b":"Some of these countries send their boys to war as young as age 6. That's gendercide too. And a much more painful form of it. Like in Sparta where they would kill the boys if they didn't have a warrior's body. Male disposability exists throughout the world including the West. And it persists regardless of the sex of the leader. The Queens of England ruled half the world for long periods of time but it was still the men who were disposable. I would never expect the mass media to address that. Not for another hundred years that is.","commenter_a":"Those are going to be some very unhappy boys.","post_message":"Technology has enabled even the poorest of countries to boost the ratio of boys over girls. One expert even goes so far as to use the term \"culling\" when talking about what's going on in these countries — a word otherwise reserved for describing the removal of undesirable animals from the herd."},{"comment_id":"10152700132182434","commenter_b":"Also, can I state for the record Sansa had a good idea she would in fact have to have sex that night, but it's the only way to get her revenge on the boltons. She had a choice to get into the family, Littlefinger gave her one, but she chose to do this. This is fucking Westeros, people, hell, in many states in the US a husband can't rape his wife.","commenter_a":"i'd like to point out that Danaerys' rape occurred in the same way as Sansa's and had a lot to do with her character development","post_message":"Whoever titled last night’s episode of Game of Thrones “Unbowed, Unbent, Unbroken” has a grim sense of humor and solid sense of irony."},{"comment_id":"1199679816751446","commenter_b":"@Jim. that sucks! But does not eliminate Trump. We need to get Muslim Terrorist Lovers and their people out before we start on removing the money grabers!","commenter_a":"Who much money are you making Mitch, to allow the Obama's Muslims Terrorist Groups, mainly \"The Brotherhood\", to get more weapons and other support? You are supposed to be stopping this, not helping it! You are already helping Obama, not our Country, by you and Ryan allowing him to much spending money to begin with, now you are screwing us again! You'll get your's as soon as Trump or Cruz are President, there will be some Audit's taking place to stop what you and Obama are now doing!","post_message":"Truly terrifying!"},{"comment_id":"10153552801752464","commenter_b":"@username>>>>I like and agree with your post about \"freedom of press\", but I also agree with what Mark posted about \"mainstream media\". The truth is Soros owns most of the news media and everyone , including the media, is getting \"paid off these days. I am even starting to believe that our SCOTUS is getting paid for their votes from what I have been seeing lately. After saying all that, what you say is true that people can pick and choose; but we live in a day of uninterested, uninformed, misinformed people who only go with what they hear the most, whether it is factual or not. Do you ever watch \"Watters World\" on the Bill O'Reilly show, \"The Factor\". It is so discouraging to see people of voting age, especially college kids, who are so uninformed, just dumb about history and politics. Maybe you can find it on YouTube ...","commenter_a":"I'm for @username. Donald Trump has nothing on Cruz, but Cruz has on Trump. Cruz is an honest, God fearing man who has been standing up AGAINST Washington ( Washington Cartel is what Ted calls them) ever since he has been a senator. He has fought against democrats AND republicans FOR the choices of the American people. HE never cowered or gave in to Obama's wishes even though he has been falsely accused and criticized for being against Obama policies that Mitch McConnel and John Boehner gave into.","post_message":"An honor to join thousands of courageous conservatives in South Carolina yesterday who agree now is a time to lead and #DefundPlannedParenthood: @webpagelink"},{"comment_id":"10153910972008812","commenter_b":"it should be 25 to life","commenter_a":"He's gonna be getting plenty of footlongs where he's going lol","post_message":"JUST IN: Ex-Subway spokesman Jared Fogle sentenced to over 15 years in prison after pleading guilty to child pornography charges."},{"comment_id":"10153549615210667","commenter_b":"But not in the women's room with a dress on..","commenter_a":"Wow! Another church minister bites the dust.This is so sickening.","post_message":"Authorities say the two suspects answered online ads specifically offering sex with an underage girl."}]
