[{"comment_id":"10153459531098855","commenter_b":"Attention whore","commenter_a":"Even her wig looks sad to be there","post_message":"Not another one!"},{"comment_id":"555636131271583","commenter_b":"I HOPE THE IDIOTS NAME LIST I HAVE SEEN DO! We Will cleanup AMERICA! BY THESE WEAKKNEED BITCHES LEAVING WE CAN HAVE A REVIVED NATION","commenter_a":"If only it were true. Jobs for everyone!","post_message":"28 percent of American voters said they would likely consider leaving the country if Donald Trump becomes president."},{"comment_id":"10153304563395927","commenter_b":"Democrats own guns,.. You Brainwashed idiots...Gullible fools","commenter_a":"Because their agenda is to control the people without being contested against. Don't you read your Bible? How can a government control its people without being toppled - remove the guns.","post_message":"Criminals don't follow the law.  Why is that so hard for the Left to understand?"},{"comment_id":"10154325852416323","commenter_b":"The woman is a perpetually grinning dimwit. She'll probably become PM.","commenter_a":"Fucking moron","post_message":"\"At least 50% of her public statements sound as if they were said for a dare. 'Let’s banish pessimists.' 'Boris Johnson is a lovely man.' The rest sound like she’s assembling endtimes magnetic fridge poetry.\""},{"comment_id":"1245886292171089","commenter_b":"@username me too","commenter_a":"Maybe they were afraid the non-white people were not going to use the proper restroom for the gender on their birth certificate. Hey, do we have to bring our birth certificates along if we visit your fine state so we can pee? Oh, nevermind, I forgot...NO ONE IS GOING THERE, so we don't need to know! As long as you have McCrory as your governor, you best get used to this kind of thing happening. (Note: this bit of sarcasm was aimed at this Nightclub, not the City of Charlotte. Charlotte is the city that passed an ordinance on Anti-Discrimination to protect the LBGTQ community, which lead to the stupid HB2 being passed by the state legislature. Too bad Charlotte suffers along with the rest of the State for trying to be open and fair.)","post_message":"This is an outrage."},{"comment_id":"10154766887574199","commenter_b":"What's his out of state criminal history? 50k for even felony Malicious Mischief is absurd. He's got no in state history.","commenter_a":"they got me y'all i should have never came down","post_message":"Prosecution had asked for court to set $100,000 bail; judge set it at $50,000"},{"comment_id":"937882449580510","commenter_b":"Can't stand her","commenter_a":"No no! Remember the first amendment? She was and is free to ask anything of anybody. Man up everyone. Hopefully this will stay a free country.","post_message":"Uh oh..."}]
