[{"comment_id":"1769368463122894","commenter_b":"I mean, I don't know who tf this woman is but I'm guessing she didn't mean it how everyone thinks she meant it","commenter_a":"People have blown what she said way out of proportion. Please read the article and really absorb what she actually said, a lot of people read but don't understand what they are actually reading.","post_message":"What a moron"},{"comment_id":"10153153444601051","commenter_b":"Go ahead baby girl google dat, ill wait.... Lol","commenter_a":"This Latina is a trump supporter.","post_message":"We went to the Donald Trump protest this week to speak to his supporters and critics. Here's what they had to say. Do you agree or disagree with Trump when it comes to immigration?"},{"comment_id":"704812552989083","commenter_b":"I would too....she is ugly!","commenter_a":"Poka dots look good on her. Muslim men are just jealous their women dont look like that.","post_message":"What in the...?! And no, it's not a joke. It's a REAL lawsuit. Look at the documents..."},{"comment_id":"715065121964948","commenter_b":"Good luck competing with India and China for FDI by multinational corporations. Unless you guys are okay with working for <US$1 an hour.","commenter_a":"Correct me if I'm wrong, cost of living will rise and NHS is at serious risk........... As far as I can see we're in real trouble!","post_message":"Is #Dexit on the cards? Could Denmark follow Britain? Paul Adams was in Copenhagen where there are already calls for a similar #EURef. You put your questions to him and Eurosceptic Danish pollster Erik Høgh-Sørensen. #FacebookLive"},{"comment_id":"10157547755435206","commenter_b":"I don't know who's worse: a rapist or a pedophile. This psycho is both.","commenter_a":"Should of chopped him in pieces .","post_message":"An Indian man took revenge against a 17-year-old boy who raped his 7-month-old baby daughter — by tying him to a tree and chopping off his hands."},{"comment_id":"846327085437336","commenter_b":"How any woman could vote republican(step ford) is beyond me, but they need to turn off Fox and Friends. Lol","commenter_a":"I STAND WITH RAND! I am a woman that has worked hard to build a career and strong skill set and I have no complaints about my salary. I earn what I deserve based on what I have done for MYSELF. Women are not inferior, stop acting like it!","post_message":"Ugh. Senator Rand Paul announced his bid for the White House, and he's one of the most anti-woman politicians out there. If he thinks the war on women is over, he just doesn't get it."},{"comment_id":"983924208336363","commenter_b":"America matters. They have been told we are the land of the free.some people here know what free is.if our government would stop the hand outs then and only then we wouldn't have to support them or anybody else...take care of our own first.","commenter_a":"This is the UN top priority to control these flood of people leaving their own country for a better life/safety of their family, and if they make it all the way....The human smuggling organizations like this type of situation and it brings a large revenue to their business all over the globe... We only can hope and pray that all nations will come together try to come up a solutions to stop the displacement of these people of the terrorist activity and senseless killing of innocent people base of their religion.... Here we are, we spent millions or billions in a exploration way out deep in our universe to study a planet that can sustain a human in the near future?...Yet, we have all of these important issues that needs to be fix, and maybe, we make our planet a better place for everyone.... We only can hope and pray ...","post_message":"RIDICULOUS: Over 700 African Illegals Caught in Panama en Route to the United States The number of Africans who have illegally traveled through Panama on their way to the United Sates has more than doubled so far this year. GREAT WALL OF TRUMP PLEASE! @webpagelink"}]
