[{"comment_id":"1201578119864976","commenter_b":"All rapists should be killed.","commenter_a":"Yes it does","post_message":"This reeks of white privilege."},{"comment_id":"10154072934058352","commenter_b":"Bitch bye u all in mii shit","commenter_a":"But thatz still her bro .....","post_message":"Nicki Minaj posts $100,000 bail for older brother Jelani Maraj after he is charged with raping a 12-year-old"},{"comment_id":"755708104563829","commenter_b":"And what happened when bush was president. This woman is going to do what's best for our country","commenter_a":"Didn't isis grow under her watch, and lybia burn. Nothing was accomplished while she was secretary of state.","post_message":"There's one candidate who's ready to be Commander-in-Chief on Day One."},{"comment_id":"1189205214435858","commenter_b":"Go suck or the black dicks racist bitch","commenter_a":"Look black on black crime is the number death rate among blacks! They need to talk to each other. They also need to fix their family unit, that's how young kids make it in life!","post_message":"#BlackLivesMatter were not happy with this speech"},{"comment_id":"10152829806276636","commenter_b":"U can't find african american in this kind of situation coz they are at home just waiting for their money from welfare...since when african american have their sense of urgency in going to work?","commenter_a":"Ironically, wasn't there a case in US of an african american single parent who was desperate for a job, left her children (older than this one) in car in car park so that she could attend interview....put in prison and her children removed, that just doesn't seem very fair does it?","post_message":"He'd got half an hour to work before making the realisation..."},{"comment_id":"10154336399174342","commenter_b":"🤔 alright hoe😭😭","commenter_a":"@username @username Rest In Peace Damiyah","post_message":"Happy #NationalCatDay Don't be a scaredy-cat! Watch these purr-fect #kittens reenact horror films: @webpagelink"},{"comment_id":"10154660299872501","commenter_b":"She can work anywhere in these United States.","commenter_a":"So she can be a lawyer not a judge cool.","post_message":"We reached out to Angela Stokes today to ask about her future legal plans. If she responds, we'll add her comments to the story."}]
