[{"comment_id":"630903010433611","commenter_b":"Get her out of the White House!!","commenter_a":"out of her mind !!!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason. She is a racist. This is complete madness. Do you think Michelle Obama is out of her mind?"},{"comment_id":"895899747125716","commenter_b":"These child rapists are our allies?? No F-----G way!!!","commenter_a":"Please help this soldier who was trying to stop the rape of a boy!","post_message":"All of Congress should support this...."},{"comment_id":"10153328651014342","commenter_b":"wonder if her phone was busy? congress write the laws why is no one talking about them?","commenter_a":"Well he calls after someone writes the words to say....the deputy was killed on Friday night and this is Monday....","post_message":"Today, President Obama called the widow of fallen Harris County Sheriff's Office Deputy #DarrenGoforth. After that, he released the following statement: \"This afternoon, on my way to Alaska, I called Kathleen Goforth, the widow of Harris County Deputy Sheriff Darren Goforth - a veteran law enforcement officer who was contemptibly shot and killed over the weekend. On behalf of the American people, I offered Mrs. Goforth my condolences, and told her that Michelle and I would keep her and her family in our prayers. I also promised that I would continue to highlight the uncommon bravery that police officers show in our communities every single day. They put their lives on the line for our safety. Targeting police officers is completely unacceptable - an affront to civilized society. As I said in my State of the Union Address, we've got to be able to put ourselves in the shoes of ..."},{"comment_id":"10154133402331770","commenter_b":"She needs to pull up her big girl panties,get over herself,go sit in a corner an SHUT UP!!!!","commenter_a":"she must have a lot of pull huh? Get of your bandwagon and properly take care of your children why don't you.","post_message":"Should Obama declare martial law and prevent Trump from being president \"UNTIL TRUMP IS 'CLEARED' OF ALL CHARGES\" as Rosie O'Donnell argues?"},{"comment_id":"1163551927039667","commenter_b":"What's on the inside is what matters. On the inside, Trump is pure puke and crap. Sher, on the other hand, is a decent human being who has paid plenty of dues.","commenter_a":"I don't like Trump, but at least he still has the face he was born with. Cher...not so much.","post_message":"\"I just wish he'd fall off the face of the earth,\" Cher said about Donald J. Trump"},{"comment_id":"10154095575861051","commenter_b":"Hillary ain't sending no one back she'll let the whole world here, terrorists included","commenter_a":"I just hope that when Hillary wins she will issue a deportation order for Ted's old man.and sends his goofy ass back to Cuba.","post_message":"Ted Cruz says Trump would absolutely be a better president than Hillary Clinton, so he'll be casting his vote for him this November. Do you feel the same way?"},{"comment_id":"922774087855770","commenter_b":"And my favorite flavor of boot is the one I'd plant square in your ass for being such a pussy...sir.","commenter_a":"SO, he converted to Islam a couple months ago and he is talking about oppression in America!!!!! He is some kind of stupid ignoramus.","post_message":"You thought him not standing was bad? This is FAR WORSE."}]
