[{"comment_id":"831043426931080","commenter_b":"Yes, she needs to be held accountable! She has NO business being president!!!","commenter_a":"Good luck on this one, sure hope it all works!","post_message":"Hillary might as well retire her future plans for the White House! Gowdy's gunning for something that will DESTROY her!"},{"comment_id":"1271439512904593","commenter_b":"Now this is the kind of moms we need in America. This the type of mom who deserves happiness","commenter_a":"wow","post_message":"MOM OF THE YEAR: She says she promised herself she'd do anything to give her kids a normal life."},{"comment_id":"10154394163921509","commenter_b":"It's the food were eating gmo and all the chemicals they put on our food","commenter_a":"Rest In Peace Great Grang Pa. How Comes Our Generation Dies Too Young?","post_message":"Yasutaro Koide was born a few months before the Wright brothers made the world's first powered flight."},{"comment_id":"1164072160294870","commenter_b":"Did I hurt your feelings Harvard? Suck it up Nancy","commenter_a":"No I don't want you out of the White House I want you in prison he's a lowlife scumbag Obama you're just as bad as Hillary Clinton prisons too good for you I think you we voted a terrorist to run our country. U scumbag","post_message":"Yes!"},{"comment_id":"10153342666393132","commenter_b":"She still is basic!","commenter_a":"He just swerrrved on her! Ayeeee! She needs to remember her roots and remember she was once 'basic'.","post_message":"\"Madonna, you have achieved unbelievable success and while we appreciate your talent and achievement, we expect you to appreciate ours.\""},{"comment_id":"1570144263286969","commenter_b":"AMEN. Michele sure didn't/doesn't get it!","commenter_a":"I agree","post_message":"\"There is one crucial sentiment Donald Trump’s Slovenian born wife certainly didn’t copy from Obama’s — the inherent pride of being an American citizen.\""},{"comment_id":"750864925104085","commenter_b":"with OUR money !!","commenter_a":"Absolutely","post_message":"Obama Caught Red Handed Financing Mosques Around The World He has been hiding who he is for his entire presidency. Do you think Obama is a Muslim?"}]
