[{"comment_id":"10153425250862217","commenter_b":"I had a design like that when I was in seventh grade in 1993. It was an idea from Dick traci and knight rider. Knight could talk to kit with. Glade it took so long for this to happen 23 years was all! lol","commenter_a":"Yall now getting this lol to late","post_message":"It's a lot more hi-tech than our day. Times tables written on our arms was the height of sophistication back then..."},{"comment_id":"10153115741995950","commenter_b":"That is BULLSHIT there terrorist right now in AZ 1out of 4 children are starving obama cant feed and house. Ours so what the hell he is gonna feed and house them. You hate the US you love terrorist get the hell out of here","commenter_a":"Good!","post_message":"NEW: The U.S. is preparing to accept at least 10,000 Syrian refugees in the next fiscal year, which begins in October."},{"comment_id":"10153359134519060","commenter_b":"Oh! You are a geographer or a history specialist Scott. Sounds good. For sure you know Europe is more than UK, Latin America is more than Mexico, and that Egypt is in Africa. Glad to know you really understand the reality and the specifics outside US. It is rare.","commenter_a":"When I read \"Latin America\" as a generalization in an article, I tend to be skeptic. You can not compare Guatemala with Chile, Argentina with Mexico. Completely different cultures, histories, corruption level, etc, although all of them are Latin American countries.","post_message":"Crisis in Guatemala: the vice-president quits, the heads of the central bank and social-security institute are arrested and three ministers sacked. Corruption scandals are two-a-penny in Latin America. Few inflict this much damage @webpagelink"},{"comment_id":"626503050873607","commenter_b":"Man she's one ugly silver back","commenter_a":"I am sick of all the threats and lies on FB have you no shame? This President only has a year to go what do you gain with the BS about him and his family. Crawl back in your hole!","post_message":"Michelle Obama was just hit with a multi-million dollar law suit for this reason.  Totally justified. She deserves prison.  Do you agree Michelle Obama is a criminal?"},{"comment_id":"1563584047268472","commenter_b":"Our society does not need assault weapons!!!The politicians have blood on their hands, because of their inaction when it comes to the NRA!!!!","commenter_a":"President Obama tried to enforce stricter gun regulations but Congress voted against it. They voted for individuals on the terror watch list to keep rights to own assault weapons and now they're blaming Isis. How convenient.","post_message":"This is infuriating.  Image by Occupy Democrats, like our page for more."},{"comment_id":"1728134044133544","commenter_b":"Screw off with trump both candidates suck","commenter_a":"IM STAYING AROUND TO SEE HOW BAD IT IS HAHA","post_message":"This was a \"Behind the scenes TV Production Meeting\".  The really good part to me comes about half way through where we begin to discuss show on future tech and AI."},{"comment_id":"10154834976184885","commenter_b":"Laws change and some should including this one. At one time I could own a person and woman couldnt even vote 100 years ago. This flag represents the ultimate sacrifice made by millions of Americans including my family. I can guarantee that if I see it I will gladly go to prison to make sure they will never be able to burn another flag.","commenter_a":"It's OK to not pay your taxes, just don't burn the flag.","post_message":"The Supreme Court ruled in 1969 that burning the flag was protected by the First Amendment"}]
