[{"comment_id":"1000833706595553","commenter_b":"Too bad we can't deport people who desecrate our flag, but hey, this is America and they have rights! Too bad they can't send these idiots to live in Iran, North Korea or Russia!! Let them try that there and they'll find themselves in front of a firing squad!","commenter_a":"They would","post_message":"Obama's America  Air Force Veteran arrested at Valdosta State University trying to stop Black Power group from desecrating American Flag."},{"comment_id":"10153768350172452","commenter_b":"It's not when you split lanes... it's when traffic is going about 30mph, motorcycles are going 60, and we in larger vehicles try to switch lanes. A small bike going twice our speed appears almost out of no where.","commenter_a":"We split lanes for one main reason: Safety! In a world with endless distractions, the rear ending of motorcyclist almost always ends up with a fatality.","post_message":"Gov. Jerry Brown has signed legislation that moves California toward condoning the practice of lane splitting, in which motorcyclists drive between two lanes of cars."},{"comment_id":"10153469864552144","commenter_b":"Damn illegal immigrants voting illegally!","commenter_a":"His mother is on the voting rolls in Canada in 1974. You cannot have dual citizenship and vote in Canada. The question becomes, when did she renounce her American citizenship to vote in Canada? Or did she vote illegally?","post_message":"Hahahaha."},{"comment_id":"10153323546831747","commenter_b":"Now plural marriages are next.","commenter_a":"What a crock! States rights were dealt a severe blow today. Yesterday SCOTUS-care, today five judges ignore the constitution to impose more leftist agenda on the entire country. Overall a bad week for the USA!","post_message":"I've had some time to think about today's historic ruling. Here are my fuller thoughts...  Today, the arc of history bent further toward justice. We are a country that embraces the ideal of life, liberty, and the pursuit of happiness for everyone. With today's Supreme Court ruling guaranteeing the right to marry for LGBT couples, we came even closer to making that ideal a reality.  This decision is a reminder that we should come together as a nation in support of civil rights for all. LGBT Americans and their allies are joyously celebrating today’s landmark decision, as they should. On this same day, in Charleston, South Carolina, Reverend Clementa Pinckney, a martyr to the civil rights struggle, is being laid to rest. He was one of nine African Americans robbed of life in an act of white supremacist terrorism.  Our work to build a more perfect union never ends. Marriage equality is now the law of the land, yet there are no federal safeguards protecting LGBT Americans against employment and housing discrimination. The same Supreme Court that ruled today in favor of marriage equality two years ago gutted the Voting Rights Act, and to this day, Congress has failed in its duty to restore vital voting rights protections. Rights can be won, and rights can be lost.  We’ve helped create a fairer and more just society today, but new and longstanding civil rights struggles are on the horizon. I’m prepared to wage those battles too, because I want my grandchildren to see progress in their time. I want them to believe as I do that America’s best days are still to come."},{"comment_id":"10153011050796717","commenter_b":"Exactly what does that have to do with anything!","commenter_a":"Why does it matter what his sexual orientation is?!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153394285461336","commenter_b":"We love them white girls","commenter_a":"All you Mexican ' s love Mexico so much why did you leave ???","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"1187550147931680","commenter_b":"It is her job totally, but let's be fair, her job duties changed abruptly in June after SCOTUS ruled. That said, she should resign if she can't/won't carry out her duties and leave her religion out of the office. She can be as devout as she wants, but not on the taxpayer's dime. Those couples are paying her salary and deserve better","commenter_a":"If she don't want to issue gay marriage licenses she shouldn't have to...","post_message":"JUST IN: Kentucky clerk who refused marriage licenses for gay couples taken into custody @webpagelink"}]
