[{"comment_id":"10157646411850093","commenter_b":"But a woman who puts dow","commenter_a":"Who wants to manage him? It is just human nature to defend yourself when someone tells lies about you. There is no proof that he called this lady Miss a Piggy and Miss Housekeeping. The video showed him defending her and complimenting her. I don't believe her story. She just wanted her 15 minutes of fame and the Clinton campaign probably paid her. I want a President who stands up for himself when attacked. I certainly defend myself when someone lies about me!! We need a strong leader!!!","post_message":"Leading conservatives are engaging in wishful thinking."},{"comment_id":"10156102999530354","commenter_b":"If he's not an illegal, he should be. What a POS. If you feel uncomfortable around the American flag, then get the hell out of our country.","commenter_a":"while your education comes out of our pocket screw you anti american crap","post_message":"Look what Matthew Guevara has to say about the American flag..."},{"comment_id":"443037622487945","commenter_b":"Lol leftist get out","commenter_a":"Wrong, it isn't the IRS it is all the rich corporate fascists. The pentagon spends how much on the military? I hardly think taxation on the regular guy is so bad, but when the rich fail to pay and the greedy steal it all well, you gotta blame somebody, right?","post_message":"The Anti-Media radio show from tonight can be heard here: @webpagelink"},{"comment_id":"10152818451732014","commenter_b":"Can't believe it. She had black heart so seem didn't care own baby. Y are abuse own child.","commenter_a":"How can people be so freaking stupid??!!!!!!!","post_message":"A Phoenix mother has been arrested for allegedly leaving her 4-month-old daughter in a hot SUV."},{"comment_id":"536487383205696","commenter_b":"Here's some facts for you Gerry - I NEVER want to be someone's 'arm candy', I will NEVER marry for money and I don't have relationships with people because of the way they look. I do agree with you when you say we are our worst enemies, but that doesn't give you the right to generalise all women. Unless you're happy to be lumped with the guys that are shallow and only date women with big breasts","commenter_a":"Who the hell cares if she is pregnant? unfortunately women are their own worst enemies, happy to be arm candy of some of the most groteste males alive,providing they are millionaires, fact!","post_message":"Jennifer Anniston has said we’ll be the first to know if she's pregnant. Writing for The Huffington Post, the actor blasted the “sport-like scrutiny” she lives under, saying it’s indicative of society’s warped view of women which sets a dangerous example for girls."},{"comment_id":"1323559051002906","commenter_b":"YOU CAN'T TAKE OUR RELIGION AWAY FROM US.","commenter_a":"Keep it. Just don't use it when class is in session.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"},{"comment_id":"10153829751724060","commenter_b":"Well. The Christians have overcome Crusades. Try yourself to see the present and stop to be a stupid moron","commenter_a":"You mean Islam was used as a vehicle of war?","post_message":"In 2015 religion was used as a vehicle of war. My God versus your God"}]
