[{"comment_id":"993534210682000","commenter_b":"These illiterate students should be in class learning something !!!","commenter_a":"I agree with every post here! They should have forfeited the game and then raised the tuition to cover what loss incurred that reduces tuition. End of story. But know we have encouraged the sports programs to make policy and remove employees at their will. Just crazy.","post_message":"Literally no understanding of 1st amendment rights whatsoever!  Behold your 'tolerant', liberal colleges..."},{"comment_id":"245227072596737","commenter_b":"She's a freaking retard!","commenter_a":"One thing he is not insecure, but you are Nancy","post_message":"'I feel sorry for you. You're the president of the US and you're so insecure...I pray for your Mr. President. And more importantly, I pray for the United States of America.'  Do you think Trump is insecure?"},{"comment_id":"10152784038336491","commenter_b":"Preaching to the choir, sister! One of many reasons I'm now divorced.","commenter_a":"Now if only science could find a man worth having......","post_message":"Science shows that there are quite a few health benefits of getting intimate."},{"comment_id":"493705967486650","commenter_b":"She should be in prison anyway!","commenter_a":"Finally justice might be done!","post_message":"Hillary's career could be over after she was exposed doing this.  Good. Let's end it right here, right now, once and for all.  Do you agree Hillary Clinton should be relieved of her duties?"},{"comment_id":"10154724621788984","commenter_b":"Hey Walmart has glasses 2 for the Price of one One for your dumb Head and one for Your your brown spot","commenter_a":"Lady you need to get your head out!Quit your job cause you are not of sound mind like Hillary Clinton","post_message":"Attorney General Loretta Lynch just issued a message to Charlotte rioters - and something about it immediately raised eyebrows."},{"comment_id":"10152841390816491","commenter_b":"Men wouldn't would they!!!","commenter_a":"What the hell? Who cares? I mean honestly. Who the hell cares?","post_message":"“Every ounce of milk I’m able to produce for my child is nothing short of a miracle and to watch that milk be thrown away without any regard for my baby was heartbreaking.”"},{"comment_id":"492044497655936","commenter_b":"Is she for real? Did someone really vote her stupid ass into office?","commenter_a":"Elizabeth Warren is a Douchebag","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."}]
