[{"comment_id":"10153155550251051","commenter_b":"Oh Erika bitch still has vagina","commenter_a":"HUGE.....SORRY ISRAEL...OUR PRESIDENT IS SETTING US UP FOR WAR....SORRY HES SUCH AN EVIL P.O.S....an i for one stand with my people an Israel....suk it obama....rot!!!!!","post_message":"Israel came out and called President Obama's nuclear deal with Iran a big mistake. Here's how they're going to respond to it. Do you agree or disagree with the idea that the Iran deal is a mistake?"},{"comment_id":"10153451961173717","commenter_b":"Jamie Woods well we don't have any respect or trust in the lying liberals democRATS..who believes in killing unborn babies and selling their body parts, nor allowing illegals into our country so they can suck the life out of America by getting on welfare and to kill,also not support our troops..democrats only care about their own pockets..","commenter_a":"he isnt any worse then the other ones that are running at least TRUMP tells the truth doesnt mince words doesnt try and manipulate and cheat his way through and election.","post_message":"Skywriters stole the show at the 127th Rose Parade in California on Friday, dashing out a message for Donald Trump just as the last float left the gate. \"America is great! Trump is disgusting,\" were the words dotted clearly across the sky on what appe..."},{"comment_id":"10154086939802994","commenter_b":"I will never shop at cvs again until he is rehired","commenter_a":"Go figure if I was him I would have told him take anything you want this job don't pay enough money it's not worth losing my life over","post_message":"Two men hopped the pharmacy counter and tried to rob the CVS. The manager, a trained Army vet, fought them off and took their weapon from them - but they got away. He was rewarded for protecting the store and people inside...with a pink slip."},{"comment_id":"10152978558206051","commenter_b":"Ive seen mothers making babies for the purpose of the money BULLSHIT lazy ass mothers","commenter_a":"if you're TOO POSH to push STOP HAVING BABIES :p","post_message":"This pregnant mom of 11 gets $60,000 per year in benefits, but she still wants the government to pay for a c-section for her next baby. And that's not her only request."},{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: \"This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.\" Watch complete press conference here: @webpagelink"},{"comment_id":"832375306811018","commenter_b":"Fire her, is this what she is teaching kids? She need to teach the prisoners not the kids!","commenter_a":"What an idiot teacher, she should be suspended and never get anymore money !!","post_message":"An elementary school teacher has been suspended for having her 3rd-grade students write \"get well\" letters to an inmate convicted of killing a police officer. What would you do if your child was in that classroom?"},{"comment_id":"969471999775996","commenter_b":"You're stupid lady","commenter_a":"yes! Possessing a gun doesn't make you American. Leaving your pride behind for the safety of others does. European countries are proof gun control is effective.","post_message":"Heartbroken and angry. We must act to stop gun violence, and we cannot wait any longer. Praying for the victims' families in Virginia. -H"}]
