[{"comment_id":"10153706538451680","commenter_b":"Shut the F' Up","commenter_a":"I think it's great that Ghoul-iani and Drumpf both have direct lines of communication open to Russian intelligence, even more so than the CIA or FBI! That will make it easier for them to set up quick and easy direct deposit accounts to collect their paychecks from Putin.","post_message":"By casting the hack as a \"national security issue,\" Giuliani said, Clinton's campaign and Democrats have \"proved ... she's a liar.\""},{"comment_id":"10154530724213645","commenter_b":"Yes Ryleigh this is really awesome. Great job !","commenter_a":"Nam Breanne Ewing NAM @username did you see this? Ryleigh @username and I are sooo proud of you. This is fantastic! Congratulations!!! I hope we are going to see you again this year in June!!! @username","post_message":"Meet Ryleigh!   Despite her physical challenges, she's beating the odds and inspiring everyone she meets with her story."},{"comment_id":"1721863561367662","commenter_b":"Hopefully to die of a stroke while receiving anal from pence, while he dies of a heart attack from actually getting his tiny penis erect.","commenter_a":"Lol... Wow at all the hate. Smh... Do you all think that the Muslims that come over here are going to accept your Christianity.... Lol.... Maybe some researching on how they are behaving in other Country's with the mix of the two is in order. But you all continue with your hate and see where that takes you.","post_message":"Reminder: If Trump attempts to discriminate against Muslims, we will sue."},{"comment_id":"1208640665842055","commenter_b":"#NEVER HELLARY CLINTON !","commenter_a":"Be careful. People who cross the Clintons have a strange way of \"committing suicide\" by a few \"self inflicted gunshot wounds\" to the back of their heads.","post_message":"CROOKED HILLARY really SCARED  @webpagelink"},{"comment_id":"988494927933952","commenter_b":"SEND THE MUTHA-FUKA BACK TO SYRIA WITH ALL OF HIS WIVES AND A FEW WELFARE WOMEN AND THEIR CHILDREN.","commenter_a":"Hell no tell him to get a job","post_message":"How do you say, 'Kiss my ass' in Farsi? Check this crap out. @webpagelink"},{"comment_id":"667207133381416","commenter_b":"She should be fired!!","commenter_a":"Should absolutely be fired!!! This is a prime example of how sad our society is!!!","post_message":"VA Manager Thinks Veteran Suicide Is Funny, Here is Her INFURIATING Email Read more at @webpagelink"},{"comment_id":"620315121449719","commenter_b":"Would make a great couple . Two freaks .","commenter_a":"HE likes. HE likes. HE aint a SHE!!!","post_message":"Caitlyn Jenner says she likes Ted Cruz because “he's very conservative, and a great constitutionalist.” @webpagelink"}]
