[{"comment_id":"10153086168389411","commenter_b":"that is why she is the ex","commenter_a":"Hell hath no fury like a woman scorned.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10155444032526509","commenter_b":"'@username Hillary is a good start then! She devil in the flesh you're so smart","commenter_a":"How quickly we forget! If you over 35, take a walk with me down memory laneyou won believe what you have forgotten. If you under 35, read onI promise you that you will be amazed at what you missed! (By the way, sadly, this isn a joke. I wish it was.) REMEMBER WHEN BILL CLINTON WAS PRESIDENT? (January 20, 1993 to January 20, 2001two terms) When Bill Clinton was president, he allowed Hillary to assume authority over an attempt to reform health care. Her proposed plan was so bad that many Democrats came up with competing plans of their own in protest, and in spite of threats and intimidation, on September 26, 1994, the bill was declared dead. This fiasco cost the American taxpayers about $13 million for studies, promotion, and other efforts. Then, President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were ...","post_message":"The Donald J. Trump campaign issued a statement denying all the allegations, saying the reports were politically motivated."},{"comment_id":"10150514383944999","commenter_b":"All terrorists are Muslim?","commenter_a":"'Boko Haram ('Western education is forbidden'), officially called Jama'atu Ahlis Sunna Lidda'Awati Wal-Jihad (People Committed to the Prophet's Teachings for Propagation and Jihad), is a militant Islamist movement based in northeast Nigeria.' There's that common denominator again: Islam.","post_message":"Soon after Boko Haram kidnapped nearly 300 teenage girls in Nigeria, the U.S. sent surveillance drones and about 30 intelligence and security experts to help the Nigerian military try to rescue them. Seven months later, not one of the kidnapped girls has been found."},{"comment_id":"1783677398519787","commenter_b":"'@username TRUMP IS OUR NEXT PRESIDENT.GET OVER IT.","commenter_a":"I am really not a trump fan.. But if his election gets rid of half the asshats that say they will leave he's got my vote","post_message":"She's out."},{"comment_id":"10153169137025950","commenter_b":"Ella Patrice Nierva","commenter_a":"Ricardo Alvarez","post_message":"WATCH: Little girl can't wait another second to hug her soldier dad, runs to him in the middle of a ceremony @webpagelink"},{"comment_id":"10153954150653606","commenter_b":"actually I love me some Tom Collins","commenter_a":"Love me some Pat Collins","post_message":"FUNNY MOMENT OF THE MORNING: 'I have more layers than a Smith Island Cake'- Pat Collins"},{"comment_id":"2049822328577410","commenter_b":"'@username Mexican rapists.","commenter_a":"My question is, why is the inauguration not being cancelled until all of this has been investigated and charges brought together? Why is nothing being done?","post_message":"'Either Donald J. Trump and friends have engaged in treasonous acts or America’s intelligence officials are guilty of a colossal lapse in judgment — or worse, a conspiracy against Trump. Either way — whether any of these allegations are true or false — the entire matter must be investigated thoroughly and immediately.' - Bill Moyers and Michael Winship"}]
