[{"comment_id":"10152838085232014","commenter_b":"That woman is not a mother. A mother loving, nurturing, protective. That woman is a disgrace. She should never get those precious babies back.","commenter_a":"What's wrong with these people leaving their kids in cars alone o in apartments....seriously people stop having kids or don't have them at all if you're not going to be responsible.","post_message":"Police say a Phoenix mom left her two babies alone in an apartment with a bathtub full of water, a switchblade in reach, and an open door to the third-floor balcony."},{"comment_id":"10153335992009071","commenter_b":"Malia Young-Williams","commenter_a":"Omar Kashmir","post_message":"We tried Shake Shack’s new Chick-fil-A killer."},{"comment_id":"10152932277682093","commenter_b":"Ppl who support a rapist are ignorant! PERIOD !","commenter_a":"I think rape is a very good reason to take a star off the walk of fame. Rape is not just any thing. You're right people do bad things all the time. Rape is not a bag thing. It's one of the worst things. And he did it over and over. He is a sick man. And they should take it away. And if any other rapist are there let's get rid of them all","post_message":"COSBY CONTROVERSY – Activists call for the removal of Cosby’s star from the Walk of Fame. Thoughts?"},{"comment_id":"10153252005637235","commenter_b":"Stupid girls","commenter_a":"Racist comments aside their flow is terrible.","post_message":"The girls insist they are not racists or bigots."},{"comment_id":"696428793854373","commenter_b":"Because his mother does what every south african women does ! Drink and try to get pregnant so they can qualify for more government grants so they can get more money for doing nothing and then they will leave a child at the grandparents for the full monty payout !","commenter_a":"At the end of the day. Why the hell why was a 3 month old its own.","post_message":"This is horrifying!"},{"comment_id":"1298830980155135","commenter_b":"No wonder we are in the decline we find in our country...these people obviously do not want to deal with reality and make excuses.","commenter_a":"The indoctrination of the Sheeple.","post_message":"When asked about the Ohio State University terrorist attack that took place on Monday, the students just could not bring themselves to be honest."},{"comment_id":"1267309513345274","commenter_b":"Great comeback! :)","commenter_a":"Ya gotta love the way the Dems embarrass themselves in front of the entire world .... just say'n .. JBeale","post_message":"Allen West Republic"}]
