[{"comment_id":"10153765423589170","commenter_b":"@username you are spot on 100%. You don't allow a foreign entity into your country and let them have an area nor let them \"work it out\". Because that area gets a little bigger then a little bit more before soon they are running the country.","commenter_a":"Rahm assisted his Muslim brother Obama in degrading the police when they did do their job. Now the police are afraid to do their jobs.","post_message":"The irony here is that it's HIS ideology that has cops afraid to do their jobs.  His ilk spent the last eight years calling everyone racists.  Now he has the nerve to complain about the outcome?"},{"comment_id":"1758501704379005","commenter_b":"That cow can't just shut up can't wait till she moves to Canada","commenter_a":"yes she is","post_message":"Whoopi Goldberg Insults TV Host For Being White, See What Happens Next. She is the biggest hypocrite. What a bigot. Do you think Whoopi is a racist?"},{"comment_id":"10153352781442217","commenter_b":"Haha She will never take any more selfies in life","commenter_a":"Pauline Mcgovern","post_message":"An Austrian tourist has had to be rescued from a well, after she fell into it while taking a selfie."},{"comment_id":"10153728622221336","commenter_b":"Women do have their own football league, Jake...","commenter_a":"A lot of sexist men just cried.","post_message":"The Oakland Athletics have hired Justine Siegal, MLB's first female coach.  Siegal is also the founder of Baseball For All, a nonprofit organization that provides meaningful instruction and opportunity in baseball, especially for girls. @webpagelink"},{"comment_id":"1017475884956418","commenter_b":"And bruce will NEVER be a woman!!","commenter_a":"How about this we let kids be kids and not put labels on everything until they're old enough to know what it means","post_message":"\"We believe all students deserve respect... regardless of their gender identity.\""},{"comment_id":"979496535445797","commenter_b":"Good KICK ASS !","commenter_a":"Good for you","post_message":"BOOM! American's save the French yet again!"},{"comment_id":"1297673556961425","commenter_b":"She has taken UGLY to a new LOW!!!!","commenter_a":"This awesome. Trump just keeps on winning.","post_message":"Awful Rosie O Got Slammed With Worst News Of Her Career After Election, She Screwed!!!  The news just keeps getting better for America!!!"}]
