[{"comment_id":"1063797583686996","commenter_b":"Giant vagina","commenter_a":"@username you","post_message":"It be like that"},{"comment_id":"10152866488206336","commenter_b":"that IS child endangerment..someone needs to be locked up--along with the snake........","commenter_a":"Some are just nuts","post_message":"This video footage of a 14-month-old girl playing with the family pet might make you a little nervous."},{"comment_id":"1502446079775417","commenter_b":"Hillary is doing so badly she has to stir up whatever she can. Notice at all of her rally's or speeches instead of substance,all she does is pick on Trump. Guess that and lying are her specialities, along with hating half the country.","commenter_a":"Go Trump Say NO to Hillary And YES to Trump Save America from WW3 so go out and vote for Mr Trump When I as a Muslim wants him to be come a president so what is wrong with you Go out and make history vote for trump Thanks Don't listen to the media they are one sided","post_message":"It's possible that Donald J. Trump will try to backtrack today. But here's why he can't."},{"comment_id":"935570869827883","commenter_b":"You don't have to apoligize for that bitch","commenter_a":"Don't worry, she is a fringe politician who's party holds only one seat in parliament. She doesn't speak for most Canadians (like me) who abhor Omar Khadr. Our apologies.","post_message":"This video makes me sick. Praising a Taliban war criminal for his \"class\", making light of the death of a U.S. soldier, and having to be dragged off stage all in one speech. I hope her career ends in a fiery explosion ASAP. Here is her Facebook page if you want to share your opinions on her speech > @webpagelink ~Funker"},{"comment_id":"10153359196206234","commenter_b":"She can leave the house!","commenter_a":"If she can't leave the house,what does she need it for","post_message":"The new Lexus was waiting for Giudice when she returned home from prison earlier this week."},{"comment_id":"1703634343208850","commenter_b":"Demo's must be high on something, another unquaified and under accomplished democrat running for the highest office in the land. Jail is where she belongs.","commenter_a":"Clinton should be in jail!!!!","post_message":"Sen. Jeanne Shaheen says there's no question Hillary Clinton is the most qualified candidate in the presidential race. Would you like to see Clinton become America's next president?"},{"comment_id":"1269059086447452","commenter_b":"Can you imagine how outraged the freeloading Obama brown nosers minion would be if that would be the Obama girls.","commenter_a":"But the images of the Obamas as monkeys is ok?","post_message":"Sen. Ted Cruz launched an \"emergency\" fundraising appeal after the Washington Post published a cartoon online depicting his daughters as dancing monkeys."}]
