[{"comment_id":"10154135106979330","commenter_b":"Scumbag","commenter_a":"Conservative idiots who are happy.. it will ultimately go to the Supreme Court and your ace has died. Oops.","post_message":"A judge has just ruled that the Obama administration is unconstitutionally spending federal money to fund Obamacare @webpagelink"},{"comment_id":"10155087301336509","commenter_b":"@username once stench like you and others weeded from this country, then decency and class will return. Its your choice to be losers. Stop blaming others for your failures in life..CLASSLESS!!!!!","commenter_a":"Michelle Obama is the strongest and the women with the most elegance I've ever heard of. Hopes she stays in politics and still get involved after she leaves the White House!","post_message":"\"Don't let anyone tell you that this country isn't great. This right now is the greatest country on earth,\" Michelle Obama said."},{"comment_id":"10153186192812550","commenter_b":"Oh @username its so sad. First of a talking back is not a threat. Second if he wanted to arrest her , he did not need to throw her on the ground & pull her hair. Those kids were running up to save their friend & I would have done the same thing. Third she was all ready sitting down , it was no need to push her head down in the dirt & sit on her. Apparently the kids were invited by a guest. They didn't start the fight at the party some old ladies started it.","commenter_a":"Absolutely NOT! 1.The video is incomplete. 2. The cops appeared to be outnumbered at least 4:1 3. He did not use lethal force. He restrained an individual who was not obeying his directive. 4. When another individual came from behind him; he did as any police officer would and drew their weapon. He then quickly holstered it when the threat was lessened. 5. If these kids showed proper respect for law enforcement; this would have been a different story.","post_message":"Call for cop to be fired after pool party video @webpagelink"},{"comment_id":"1705740913046354","commenter_b":"Bitch!","commenter_a":"Go whoop, go now.","post_message":"Oh my gosh, I can't believe Whoopi Goldberg said this. Cancel The View right now."},{"comment_id":"612643332237670","commenter_b":"It's really crazy that some men are coming up with more excuses for this kid","commenter_a":"What, now alcohol is being used as an excuse to rape a girl. People still know right from wrong, drunk or not. Rape is illegal. Justice needs to be served. Disbar that judge, also.","post_message":"The judge, also a Stanford alum, noted that the defendant was intoxicated at the time of the assault."},{"comment_id":"363912913812223","commenter_b":"This LOSER should not even be in this country!!!!!!","commenter_a":"I say disarm the cops on the same day that this turd becomes a vegitarian!","post_message":"Michael Moore Demands Cops Disarm!"},{"comment_id":"127551884528757","commenter_b":"@username she was female","commenter_a":"She got what she asked for. Had she left room between her and the vehicle in front of her, she would have had adequate time to take evasive action to avoid the mattress and been able to maintain control of her vehicle. Both trucks were traveling at a reasonable and prudent speed. The ford was passim the semi safely. She grew impatient. Ford took evasive action, maintained control of his vehicle. She was tailgating and did not have time to take evasive action SAFELY. Over corrected and lost control of her vehicle. She is 100% at fault. There is no negligence on either driver. Her car is obviously totaled hopefully she carries collision coverage. She will also be paying for the damage to the semi. Hope she has enough liability. I am a claims adjuster. I explain this to people allllllllll day. She was impatient, and now she will have ...","post_message":"TAILGATING GONE WRONG: Watch as a car that was tailgating another vehicle on the I-10 ends up ramming into a semi-truck and flipping in the air. Luckily, the driver and her cat were not severely injured."}]
