[{"comment_id":"10152578291366636","commenter_b":"But I'm not joking. Why would a western woman live there ?","commenter_a":"A list of things that doesn't offend these clowns needs to be published. How can any intelligent women move to this place?","post_message":"Pakistan is not happy with Imran Khan's new wife..."},{"comment_id":"10153646092561167","commenter_b":"Liberals hate women!!!","commenter_a":"If Megyn Kelly didn't have her looks and her little fued with the Donald to capitalize on she'd be a non issue.","post_message":"Can everyone finally stop pretending Megyn Kelly is any kind of “hard-hitting journalist”?"},{"comment_id":"469071613283419","commenter_b":"she b a back stabber","commenter_a":"She fits in with Sharpton an Jackson","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"10156660915665354","commenter_b":"The woman should thank Ms Palin for keeping her employed. If she didn't resemble Sarah she wouldn't be working. Since there isn't much talent there.","commenter_a":"Sure, Sarah made Tina famous and rich. But Tina helped do the same for Sarah. I believe Sarah is laughing all the way to the bank....just as much as Tina is. Sarah did look a bit disjointed at the endorsement and Tina jumped on the opportunity to mock her. But Tina....sorry. You failed miserably. Didn't laugh at all. SNL is just sad. Don't watch any longer. The constant right bashing is boring and predictable.","post_message":"You saw this, right?"},{"comment_id":"434665249991403","commenter_b":"Like Ms. Richards said \" get over it\"","commenter_a":"The supreme court has been and is political. It has jettisoned the straight forward and logical meaning of the Constitution in a growing social activism. The concept of heterosexual marriage has been intact from the beginning of historical time...until the present attempts to normalize the homosexual perversion . Legal liasons by contract have always been possible to all persons but the attempts to socially institutionalize and legally legitimize homosexual marriage as an equal and legitimate alternative to heterosexual marriage will never legitimize it. It may legalize it - but unborn baby murder is legal but will never be morally normal nor moral.","post_message":"Rick Santorum thinks that Congress should fight the Supreme Court if the court rules in favor of gay marriage. Is he right or wrong?"},{"comment_id":"998167890303719","commenter_b":" y ayuda tmbn a Los autistas","commenter_a":"Diego Alberto Rodriguez Pesaresi @username","post_message":"Marijuana can literally stop a seizure in its tracks. Like ATTN: on Facebook."},{"comment_id":"983924208336363","commenter_b":"America matters. They have been told we are the land of the free.some people here know what free is.if our government would stop the hand outs then and only then we wouldn't have to support them or anybody else...take care of our own first.","commenter_a":"This is the UN top priority to control these flood of people leaving their own country for a better life/safety of their family, and if they make it all the way....The human smuggling organizations like this type of situation and it brings a large revenue to their business all over the globe... We only can hope and pray that all nations will come together try to come up a solutions to stop the displacement of these people of the terrorist activity and senseless killing of innocent people base of their religion.... Here we are, we spent millions or billions in a exploration way out deep in our universe to study a planet that can sustain a human in the near future?...Yet, we have all of these important issues that needs to be fix, and maybe, we make our planet a better place for everyone.... We only can hope and pray ...","post_message":"RIDICULOUS: Over 700 African Illegals Caught in Panama en Route to the United States The number of Africans who have illegally traveled through Panama on their way to the United Sates has more than doubled so far this year. GREAT WALL OF TRUMP PLEASE! @webpagelink"}]
