[{"comment_id":"10153603206034342","commenter_b":"Make her Vice President...you will truly be elected","commenter_a":"Sarah Palin is Hott","post_message":"Sarah Palin is endorsing Donald Trump..."},{"comment_id":"1596477097312385","commenter_b":"Illegal immigrants must not vote. That is against the law. All people must be made to show ID to make sure illegal immigrants are not voting and to make sure nobody votes more than once. It is simple common sense. For the very rare citizen who may not have ID they can assist them and pay the fees. It would only be a very few people. But everybody must show ID to vote and prevent voter fraud.","commenter_a":"Why do judges think only black people don't have IDs and considering everyone needs an ID for just about anything else, why would anyone not have an ID? All this law does is make sure there is not voter fraud...so in essence this ruling shows me that the court wants voter fraud, it's the only thing that makes logical sense. I think it may be time for other countries to oversee our democratic process or we need to stop telling them we will oversee theirs because we obviously have no moral high ground to speak on the subject in other countries.","post_message":"Unreal."},{"comment_id":"1269059086447452","commenter_b":"Can you imagine how outraged the freeloading Obama brown nosers minion would be if that would be the Obama girls.","commenter_a":"But the images of the Obamas as monkeys is ok?","post_message":"Sen. Ted Cruz launched an \"emergency\" fundraising appeal after the Washington Post published a cartoon online depicting his daughters as dancing monkeys."},{"comment_id":"10153123601201051","commenter_b":"Every one that supports this is freaking stupid put the bitch in jail than when she is ready to pop take the baby put the child in a good home than hang the bitch...","commenter_a":"The woman in this picture is not 7 weeks pregnant. It is also her choice to make not mine.","post_message":"This woman is planning on having an abortion - but she says she'll cancel it on one condition."},{"comment_id":"1245546388827745","commenter_b":"Don't disparage whores.","commenter_a":"Barrasso. It's embarassing to watch these whores. These scumbags have gotten so emboldened they don't even try to hide their crimes.","post_message":"Right after leading the floor debate in support of Scott Pruitt’s nomination to lead the EPA, Sen. John Barrasso attended a high-dollar fundraiser hosted by energy lobbyists."},{"comment_id":"10152831288276636","commenter_b":"Terrible woman screaming like that I'm glad she was sacked","commenter_a":"If it doesn't affect your pay don't let it affect your day let star bucks hire security you getting pay regardless you sell coffee and straw LESSON \"I WILL NEVER BE JOBS WORTH AGAIN\"","post_message":"\"Give me the straw, give me the straw, give me the straw, give me the straw... call the cops.\""},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."}]
