[{"comment_id":"719584654846906","commenter_b":"LOL, OH LET HER, SHE'S THE CRIMINAL, DO YOU LIVE UNDER A ROCK?","commenter_a":"Con-man-Don, \"The Conald\", just a Common Carpet Bagger wanting to benefit from the ruin he would inflict on America. @username needs to call him to the carpet and allow the Criminal Justice system have their way with him.","post_message":"Donald Trump has painted a dark, divisive picture of America. We have 102 days to stop him from becoming president."},{"comment_id":"835612693201651","commenter_b":"HE IS LOOKING FOR MORE FREE REPUBLICAN MONEY !","commenter_a":"These people have to keep up the lie..because if you do your research. .then you will come to one and only one conclusion. .These people have no claim to the land..they were put there in 1948...but their blood line does not trace back to Abraham a hebrew..don't take my word for it do the research. .information is out there!!!!","post_message":"\"I will go anywhere I am invited to make the State of Israel’s case and defend its future and existence.” -Israeli Prime Minister Benjamin Netanyahu"},{"comment_id":"10153116909760671","commenter_b":"As they should I would not want men in a women's locker room even if he dresses like a women, just think about how it smells that would be enough for me to wait until there showered.","commenter_a":"Try sending in a transgender reporter, that'll make 'em happy!","post_message":"“I have covered male sporting events all over the world and it took coming to Indianapolis to face my first gender discrimination,” one of the journalists wrote on Twitter. Thoughts?"},{"comment_id":"1526598987356152","commenter_b":"First Ladies are suppose to always embrace hope and not be pessimists.","commenter_a":"Her lavish vacations on the taxpayers backs are over !!!!","post_message":"SHE'S BACK TO HATING AMERICA: It's the end of \"hope and change\" and Michelle, for one, isn't happy about it."},{"comment_id":"10153320110664641","commenter_b":"her kids are black, derp","commenter_a":"As long as she is not racist and is doing good she is my sister! Her being white does not change anything","post_message":"Rachel Dolezal represents the black community publicly and vocally. But her birth certificate says she's white."},{"comment_id":"10153373946241833","commenter_b":"HE is a mental defective!","commenter_a":"he can leave anyday and take his moron buddies with him.","post_message":"The chairman of the Senate Judiciary Committee wants Attorney General Eric H. Holder Jr. to explain why a Department of Justice gun ban list has a defective category consisting almost entirely of names belonging to military veterans and their dependents. disturbing to think that the men and women who dedicated themselves to defending our freedom and values face undue threats to their fundamental Second Amendment rights from the very agency established to serve them, Sen. Chuck Grassley, Iowa Republican, said in a statement Wednesday."},{"comment_id":"10153725721616770","commenter_b":"Donald is getting rid of illegal immigrants That doesn't belong in America","commenter_a":"Judy white your are a Democratic like them ripping the people of America no jobs Don't you know that God got Donald trump's back Revelation 18 the fall of Babylon and all trades deals .if Hillery Clinton knew god maybe she would be president But she hates god . remember god is greater.any humans On earth no one can overcome what god Has planned can try .","post_message":"New pro-amnesty campaign manager for Donald J. Trump says \"deportation force\" now \"TBD\""}]
