[{"comment_id":"1062072083905575","commenter_b":"@username this is the saddest thing I have ever seen","commenter_a":"AND SOME OF TH AUDIENCE LAUGHED? Grrrrrrr!","post_message":"UPDATE: See the response from Caleb's dad and school, plus CALEB GIVES HIS LAST LINE! WATCH: @webpagelink  PREVIOUS: A 6-year-old boy with autism was brought to tears on stage when a teacher grabbed the microphone away from him when he was about to speak during his school's Thanksgiving play. Caleb was dressed as a turkey, and just wanted to say, \"gobble, gobble.\" STORY: @webpagelink"},{"comment_id":"10153672228046130","commenter_b":"She's not plus size... She's average!!!!!","commenter_a":"How hilarious.","post_message":"A trailblazing move by Sports Illustrated Swimsuit."},{"comment_id":"969371743179604","commenter_b":"Too bad Donald Trump is here to stay he's going to be the president and beware lady he's going to build a wall and you're probably one of the ones that he's going to be sending back to Mexico because you're probably illegal","commenter_a":"Bought and paid for I might add!!!","post_message":"Protestors in Mexico, I mean California, are saying Trump doesn belong in the United States. What do you think? @webpagelink"},{"comment_id":"671681693020122","commenter_b":"Donna should be in jail!","commenter_a":"She is a cheater","post_message":"Does she DESERVE TO BE ARRESTED?"},{"comment_id":"10153289142823984","commenter_b":"I had high hopes .........what a big disappointment to all Americans so sad............","commenter_a":"Yes, start the impeachment procedures NOW!","post_message":"This might be Obama's biggest miscalculation yet, and it's going to cost him dearly.  Should this get Obama impeached?"},{"comment_id":"10154679787223751","commenter_b":"we dont want to lecture anyone on how to govern their own country, but Canadians will lead by example","commenter_a":"That's whet they need to be.","post_message":"Canada's border has seen a surge in people crossing illegally from the U.S., with a 230% increase in people crossing into Quebec in January compared to a year ago. @webpagelink"},{"comment_id":"589335207936802","commenter_b":"Can some one please explain to her that her relevancy has expired and she has a court date in ND for vandalism to appear for?!","commenter_a":"IDIOT","post_message":"Ha ha ha ha ha ha ha. She's turning into quite the side show."}]
