[{"comment_id":"10153721168204170","commenter_b":"We have no room for their made up Allah in OUR Country!!!!! Go back to your Motherlands and take Nobama and Moochelle with you!!!!!","commenter_a":"Jeeze. I'm shocked","post_message":"Guess what block of foreign-born immigrants is growing fastest in the U.S?  If you said \"Muslims,\" you win a cookie. Make sure it's halal"},{"comment_id":"367783356938627","commenter_b":"McDonald's drive thru but taco bell taco...hmmm🤔","commenter_a":"China Navarro Faviola Quiralte @username Natalie King","post_message":"Gotta be more specific  #WSHH"},{"comment_id":"540250699432857","commenter_b":"Really? ?? So does that go both ways, women cant be trusted watching kids that arent theirs I? ?? Your blanket statement, is kinda bullshit","commenter_a":"Some people treat their animals better than they treat their children. Why not take the baby with you? Never trust boyfriends with your kids.","post_message":"A woman and her friend wanted to run to the store, so she asked her boyfriend to watch her friend's kids for a little while. The women returned about a half hour later to find the man had done something horrific."},{"comment_id":"1152390574850299","commenter_b":"Wish these women would press charges! That would be wonderful...","commenter_a":"This woman should bring legal charges. It is too bad she did not haul off and slug him then and there. There are too many honest credible women coming forward to ignore. Even die-hard Trump supporters should think twice about supporting such a lech. And no, the Clintons are not paying all these women to come forward. Use spell check if you want to be taken seriously Maynard.","post_message":"This makes 12 women that Trump is accused of not being able to keep his grubby, tiny hands off of."},{"comment_id":"552483671600179","commenter_b":"Hillary does all of the same things too. Get real.","commenter_a":"Its not really gender...its just more crap to throw at our future PRESIDENT Hillary Rodham Clinton..every week its some other lie or smear..you would think people would figure out what republicans have been doing for decades..!! An yawn like I do each time they raise their ugly heads. !! Tell them no an leave it at that !! Go Hillary Clinton🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸","post_message":"The 'transcripts' hit on Hillary is sexism in its purist form: holding a woman to a different standard because of her gender."},{"comment_id":"10155175769803984","commenter_b":"and we are not giveing up our freedom just stoping people entering oir country...our constitution does not apply to immigrates","commenter_a":"*\"B4 you blame Trump read this\"* ******************** *I still DO NOT understand why there's so much noise about Trump's decision to ban refugees from Muslim countries?? There are '100,000 empty fully air conditioned tents' in Mina- Saudi Arabia capable of housing 3 million people yet Saudi Arabia refuses to take the refugees, who speaks same language, same culture, same tradition, same religion, yet Saudi Arabia feels it's 'a security risks to accept the refugees' but wants the Christian world to do so? I'm trying to understand this thing called 'common sense', how it's been used. Is Saudi Arabia not too wicked for turning it's back against its own? Why blaming the US? Remember it is part of Trump's election promises, yet the Americans voted for him, meaning dats what they want.* *Germany took over 1 million refugees and Saudi Arabia came up with a proposal of spending billions to build ...","post_message":"Donald J. Trump gave Iran 1 chance to straighten up, and they defied him.  So now he's made a massive move to teach them we're the ones in charge.  Thank the Lord for a president with an actual backbone!"},{"comment_id":"909813239056017","commenter_b":"And ya wonder why his kids are so messed up...duh. apple doesn't fall far from the tree.","commenter_a":"Who cares, ?","post_message":"\"I'm so happy after such a long struggle to be living my true self.\""}]
