[{"comment_id":"1143828785650872","commenter_b":"Funny how they show all this stuff because its TRUMP...I am sure that there was stuff like this when Obama was running oh ya it has been bad for 7 years since he has been President...GROW UP PEOPLE...you are making bad examples for our future kids...","commenter_a":"Common sense: Using seat belts, texting and driving, drinking, smoking, walking in traffic....should I go on? You are responsible for your actions, not some politician!!!!!!!!! WAKE UP AMERICA......","post_message":"This protester was sucker-punched and kicked by a Trump supporter as he was escorted out of yesterday's rally in Arizona. You have to see the video of the violent confrontation."},{"comment_id":"648669105287702","commenter_b":"That Bitch be ugly!!!!","commenter_a":"So be it","post_message":"Whoopi Goldberg Says She Might Leave The Country If Trump Is Elected. Well I guess she's going to say goodbye. Will you happy to see her go?"},{"comment_id":"10153397675031323","commenter_b":"sure!our women too commit crimes like women in any part of the world and when caught,they go to prison","commenter_a":"Disgusting! I live in Iraq and our prisons are never like that! huh! and they teach us democracy!","post_message":"\"Even though keeping inmates clean would seem to be in the prison’s self-interest, prisons control their wards by keeping sanitation just out of reach. Stains on clothes seep into self-esteem and serve as an indelible reminder of one’s powerlessness in prison\""},{"comment_id":"10154029279516341","commenter_b":"By the Gods. Now they do have a chance to tell that envoy to give back Roman territory and she fucks it all up ! To the Circus with her !","commenter_a":"Bum nutter","post_message":""},{"comment_id":"1870076373211219","commenter_b":"My first thought was to wonder where the women are.","commenter_a":"One small detail though. Local women are not even allowed to even try to approach the beach without their burkas and totally covered. OUTRAGEOUSLY INHUMANE TREATMENT OF WOMAN.","post_message":"Put us on the next plane to Dubai."},{"comment_id":"10153590500421409","commenter_b":"she is full of herself","commenter_a":"Wow what kind of so called \"FRIEND\" is she. Can't even be happy for Michael. So much drama. Nobody needs a friend like that.","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."},{"comment_id":"1801521536786663","commenter_b":"We can send all the \"safe space\" cry babies here. It will be perfect Trump will just need a longer wall. Oregon? You want in on this? Please speak up before we order materials for the wall","commenter_a":"Please do.","post_message":"The group said they plan to seek independence through the United Nations."}]
