[{"comment_id":"10152768405859032","commenter_b":"Good!! She should appreciate the fact that she got hired & HAD a job!! What a dumb ass!!","commenter_a":"@username talk about #keepingitghetto hahaha!","post_message":"The boss didn't appreciate all those thumbs-down emojis."},{"comment_id":"10153283312806130","commenter_b":"Denis I applaud you for teaching what you do. Big problem in our country is young girls are getting pregnant, guys leaving, single mom/hard to get education, etc ----> leads to broken family structures/children not raised properly---> leading to most problems we are facing in our country","commenter_a":"She didn't have sex, she had intercourse, or made love. Her sex is female. Why must we depersonalize coitus, to like farting or blowing your nose?? Let's put the LOVE back into making love, then our kids might make the connection to a loving act that sometimes leads to pregnancy. It's supposed to belong to people who are committed not a spectator sport or a recreational past time. :)","post_message":"She handled them pretty well though."},{"comment_id":"1131664770254026","commenter_b":"You should try to get one. Aiden needs a service dog as well.","commenter_a":"@username you need one!","post_message":"✔ Laundry ✔ Dishes ✔ Shopping WATCH: This service dog in training is wowing the internet with all the ways she helps her chronically ill owner @webpagelink"},{"comment_id":"10156018657180389","commenter_b":"Carly Fiorina thinks that men that do not want to vote for her are \"Sexist\"... All of you that support her are actually Feminist, or men that are ashamed of being men... Do you really want a Feminist like Hillary or Carly in the White House?","commenter_a":"Hey Sean! Gonna be seeing our man Ted Cruz tomorrow:))!","post_message":""},{"comment_id":"10153267785502894","commenter_b":"Lol I knew I was gonna get somebody! Yes it does and that's why being faithful and protecting ourselves is so important! It's too many fake porn stars out here...","commenter_a":"I bet too many thots out here having unprotected sex 😏","post_message":"STD Rates Have Hit a Record High in the United States"},{"comment_id":"10158604415035206","commenter_b":"@username The woman can speak five languages... get a grip","commenter_a":"I have never said anything negative about Barack Hussein Obama's wife, but since that's gonna be the new norm for the liberal lunatics, let me just say this. Melanie Trump has more class in her little finger than Michelle Obama ever had or ever will have. But just look at all the jealous women who are putting her down and all the worthless men with mangina's who are putting her down. You people are pathetic.","post_message":"“Melania will be an excellent first lady who will take Slovenian values of generosity, loyalty and trust to the United States and the world,\" said one fan from Melania's hometown."},{"comment_id":"222401854833654","commenter_b":"Build the wall","commenter_a":"Say it to mexico, who build the wall with...? u know the answer, and it turned up very good, no illegal immigration and less crime , Israel built the wall too, and no muslims terrorist attack, bulgaria and hungary have kinda wall/fence, and no attacks, there you go...","post_message":"Those who don't know history are doomed to repeat it Details: @webpagelink #BerlinWall | #TrumpsGreatWall Join Us The Free Thought Project"}]
