[{"comment_id":"10153050664571615","commenter_b":"@username stfu","commenter_a":"Omg abortions cops killing people rape wtf were talking about a dog killer people come on try and keep up lol people make me laugh","post_message":"NEW FALLOUT: Last night we told you how the Animal Rescue League was distancing itself from The Pittsburgh Steelers following the signing of quarterback Michael Vick.   The second organization that has decided to suspended all activity with the team plus reaction from fans – tonight on Channel 11 News at 11."},{"comment_id":"10156221471665725","commenter_b":"Trump is only enforcing a fedral law, by deporting illegals !!! This is already the law !!!","commenter_a":"I am inviting all of TRUMP FAN to PRAY , from the HEART everyday and all the time, he need it and we need him, please let get together , for our country and for our new president TRUMP, TRUMP 2016, AMEN !!!!","post_message":"I will be hosting Saturday Night Live on November 7th. Looking forward to it!"},{"comment_id":"10153729892456509","commenter_b":"I'm certainly not by any mean defending China's actions but it's quite hypocritical to criticize them while America commits terrible animal crimes too. That chicken, beef, bacon, etc. are almost from animals living in poor conditions and slaughtered. It's just favoritism to defend one animal and not another. To condemn one country and not another. Like Ramapriyan says, stop trying to be the world police.","commenter_a":"Just returned from Singapore and Hong Kong. Both very awesome cities.","post_message":"Plan on visiting any of these cities this year? @webpagelink"},{"comment_id":"10154592077846756","commenter_b":"Good grief. I could pee a puddle deeper than her.","commenter_a":"She will never be first lady.","post_message":"As she readies to address the Republican National Convention Monday night, it's not so clear exactly what kind of first lady Melania Trump would be. But she's left some clues."},{"comment_id":"1213204015381722","commenter_b":"Trash talk was and currently still is part LJ personality. Nice try though . Gotcha bitch","commenter_a":"STICK TO BASKETBALL.","post_message":"LeBron is leaving no room for interpretation here."},{"comment_id":"1159441540761968","commenter_b":"Vote for Trump, he is the only one that will build the wall!!!!!!","commenter_a":"WTH?? Since when has this become acceptable? Build the Frigin wall!","post_message":"ILLEGALS.... ILLEGALS... ILLEGALS... They are terrorists.  @webpagelink"},{"comment_id":"379639485727556","commenter_b":"#buildthatwall","commenter_a":"BUILD THAT FUCKING WALL & FUCK FOX & PENA NIETO!!!!","post_message":"Looks like Mexico isn't feeling that border wall!  #WSHH #Mexico #DonaldTrump #VicenteFox"}]
