[{"comment_id":"793038077515812","commenter_b":"Omg yes","commenter_a":"'@username we need this","post_message":"This is the perfect party game to play with your stupid friends: @webpagelink"},{"comment_id":"10154789513347908","commenter_b":"Bernie concede and join forces with Hillary. We all know this is what will happen anyway. We have to start now if not we will be wishing so if trump wins!","commenter_a":"Thank you, Bernie Sanders.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152542079335927","commenter_b":"What state elected this Muslim trash","commenter_a":"Minnesota has a Muslim problem. There has been over 40 of its citizens gone over to the Middle East to fight for ISIS. The liberal democrats will welcome these terrorists make to the United States with open arms.","post_message":"It's a tricky situation preventing money from getting into the hands of terrorists."},{"comment_id":"1004595529587074","commenter_b":"Show me where I said that Jeep!! Assume much?? Many woman have had very easy deliveries and others more difficult. You cannot predict which way it will go. HOWEVER, every successful abortion kills a new human.","commenter_a":"Choose Love, Choose Life! All human beings deserve a chance at life. If you agree with saving trees or animals but, not human beings you are an idiot.","post_message":"Every life is a blessing!"},{"comment_id":"10153236028424087","commenter_b":"Oh @username, beautiful, sexy, intelligent. You're a dream girl, woman.","commenter_a":"Exactly! Time to move on. Love wins errrr maybe","post_message":"“We've got to keep striving every day to treat each other the way I believe God sees us, as equal in His eyes,” Barack Obama said."},{"comment_id":"1173335299353316","commenter_b":"Lady...Just give it up and go home!!!!","commenter_a":"Pathetic!!","post_message":"'I don't think what Donald J. Trump says is worse than actually what Hillary Clinton in fact has done.'  - Green Party presidential nominee Dr. Jill Stein"},{"comment_id":"922540534474731","commenter_b":"DO IT! I am afraid that he will fire them all and replace them with illegals and give them citizenship.","commenter_a":"I'll support police officers","post_message":"Cops Threatening To Turn Their Backs On Obama At Annual Police Memorial Friday  @webpagelink"}]
