[{"comment_id":"978935178808244","commenter_b":"Good. She looks like a menace.","commenter_a":"hey asshats...it was a 12 year old..not 2 year old....daddy put her in harms way......","post_message":"BREAKING NEWS! Police just SHOT AND KILLED a 12-year-old girl while evicting her family from their home!   Help us SPREAD THE WORD because the #MainstreamMedia is not TOUCHING this!  From >> Counter Current News for the latest!"},{"comment_id":"901969823182419","commenter_b":"Girls like my weiner better.","commenter_a":"Nassssty fat pill..... puke","post_message":"A hot dog on a donut packed with bacon and jam... Here's where you can get it: @webpagelink"},{"comment_id":"10155880167920354","commenter_b":"Uh you don't feel safe here? GO BACK!","commenter_a":"And salon will say that the US military threatened this poor muslim and made him feel unsafe.","post_message":"The Huffington Post Says It's a \"Mystery\" Why Kuwaiti-Born Practicing Muslim Mohammad Youssef Abdulazeez Murdered 4 U.S. Marines During Ramadan."},{"comment_id":"10153229649411770","commenter_b":"Spank her, then send her to jail where she belongs!!","commenter_a":"If we are going to keep Hillary out of office we need Trump and Cruz to team up. That's a ticket that would put the republican's in office and would reverse all of this crap. But it's going to be left up to us to flush this Muslim crap down the toilet and out of our country. It does not belong here, it will never get along with western culture.","post_message":"Ted Cruz warns Hillary Clinton that \"in America the voters have a way of administering a spanking.\""},{"comment_id":"10152906216427522","commenter_b":"Freddi Birkhder you are too stupid to pour piss out of a boot even if the instructions are on the heel. The Cheney/bush thugs negotiated the withdrawal from Iraq you mindless twit. GFY","commenter_a":"Not surprised!!! Christians are being blown up!by Isis,and Obama is smiling!evil man.","post_message":"Yes, he too is reading Ta-Nehisi Coates' new book:"},{"comment_id":"10153632198263908","commenter_b":"These girls suck. There's no way around it.","commenter_a":"So enlightened yet judging girls because they take a selfie..","post_message":""},{"comment_id":"10154001175786336","commenter_b":"She should be held to the same standards as men. Clearly she thought that since she's a 100lbs 5'0 female she should get away with it. She should be held to even higher standards because she is a doctor.... For now at least","commenter_a":"Don't complain about equality between the sexes as long as your OK with women not being held accountable for their actions. A man would be in jail right, now where she belongs. We giggle when women break the law and demand justice when men do the same thing.","post_message":"The confrontation reportedly began when the woman got into the Uber car without a reservation."}]
