[{"comment_id":"1134554249934436","commenter_b":"Lol. She is a democrat. I hope you never wander into a voting booth","commenter_a":"We must stop the democrats and Hillarys war on women and the unborn!","post_message":"Every dollar goes toward making sure Donald J. Trump never becomes president."},{"comment_id":"10153921067764203","commenter_b":"@username, But many Women would and I bet You were going to have A lot more Women shooting themselves.","commenter_a":"Yah most women can't find their keys in their purse! As they fumble for the gun, they'll be long gone!","post_message":" new motto may just be you see something, say something. But make sure you packing heat and have good aim."},{"comment_id":"1225936470775105","commenter_b":"Bye naked fool","commenter_a":"What a worthless p.o.s. go get out its types like you we need to be rid of.","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"614898638719277","commenter_b":"She's to stupid to no anything","commenter_a":"Reason for term limits are these two examples of our Representatives being out of touch with reality.","post_message":"So thoroughly unhinged it is impressive."},{"comment_id":"930466986973481","commenter_b":"I believe that the Goverment ( teachers ) should mind their own and stay out of our lives and work on being a better teacher ! It's up to the parent to decide when it is appropriate time to educate the child . Teaching a child inappropriate touching is about the limit that the school should be doing . Nothing else !","commenter_a":"Just be open and honest with your kids about sex. Answer questions, create an environment that allows for discussion and be open minded when they tell you what they think. It's not a bad subject. It's part of life.","post_message":"Would you call this educational plan \"age-inappropriate\"?"},{"comment_id":"10153199547146130","commenter_b":"Woman in front of the man is just perfect though.","commenter_a":"I noticed. I hated the woman behind the man. And her stupid hair cut.","post_message":"We can't believe we never noticed this before."},{"comment_id":"10153055472862293","commenter_b":"Shut Up..get outta here!!!! Lol...forgive blacks..?? psscvhh","commenter_a":"Should \"White America\" forgive racist blacks?","post_message":"\"If we really believe that black lives matter, we won’t devalue our reality and cheapen our forgiveness by giving it away so quickly and easily.\" via Washington Post Opinions, Outlook, and PostEverything"}]
