[{"comment_id":"1157169374320401","commenter_b":"I swear not EVERYTHING is racist just because you are offended by it. He isn't anti-immigrant..he is against ILLEGAL immigration and un-vetted refugees. Get the facts straight already","commenter_a":"Go to your safe space and shut up","post_message":"The phrase “is associated with the political campaign of a candidate widely known to voice anti-immigrant and bigoted views.”"},{"comment_id":"10153858591813279","commenter_b":"Clinton is a republicrat! When will people realize she is only \"progressive\" when it comes to lining the pockets of Wall Street, big corporations & the ultra rich?","commenter_a":"\"When [Clinton] says let talk about issues and let look forward, what she really saying is let not talk about my campaign financing, or my policy history, because it won bear the scrutiny my new, new, new progressive brand demands.\"Look, let get this straight. It wasn't very long ago when Hillary Clinton favored the TPP, the Keystone XL Pipeline and the death penalty. She also opposed gay marriage and reinstating Glass-Steagall. Her foreign policy is closer to the neocons who got us into Iraq (which she voted for) than what the American people favor. She flipped on immigration, gun control, and NAFTA. That not progressive. She attributes her changes towards progressivism to as a result of information. But as Politico points out, for most of these issues, there was no new information. For example, what changed on gay marriage, other than public opinion? It also begs a question: if Sanders ...","post_message":"The most heated exchange during last night's MSNBC Democratic presidential debate began after Bernie Sanders accused Hillary Clinton of being part of the political establishment."},{"comment_id":"10154004343429440","commenter_b":"@username and if you call me sweetheart again, I will find you and feed you your balls. \"Figuratively\"","commenter_a":"Trump has the worst politfact record of any candidate for president ever. Hillary is among the best. Making all of your reports 50-50 so you don't have to listen to Republican whining distorts the truth","post_message":"Denver Post Politics takes a look at how Hillary's statements stack up to the facts."},{"comment_id":"572501256275839","commenter_b":"Why aren't people moving to Mexico instead of Canada??? LMAO CAUSE THEY ARE RACIST","commenter_a":"That woman who said women that voted for Trump are dumb was speaking for herselfLast laugh on us that voted for Mr. Trump","post_message":"Donald Trump STUNNED the media with his big win. Here's #2 in the media's stages of grief: ANGER."},{"comment_id":"10153188976024087","commenter_b":"Ethyl Rosenberg did less and thy fried her in the electric chair!","commenter_a":"Go Hillary , ignore the naysayers , they don't even have a real scandal , crime or violation , ignore the fake media , stay focused on the real issues that Americans truly care about","post_message":"Senior aides to Hillary Clinton will meet with Democratic lawmakers at the Democratic National Committee offices on Thursday to discuss messaging and strategy as the presumptive front-runner's numbers continue to fall."},{"comment_id":"472703329582291","commenter_b":"How does Trump make Mexico pay for the wall, When America has no authority over Mexico ?","commenter_a":"We need the good people of Florida to Vote Trump!","post_message":"FLORIDA: Early voting is now open! Do not miss this opportunity to #MakeAmericaGreatAgain #Trump2016 Ivanka Trump Find Florida early polling locations: @webpagelink"},{"comment_id":"1298794080158825","commenter_b":"OK. Sacrifice your two daughters first....and we will all follow suit (he is a big asshole)","commenter_a":"Obama's a damn clown","post_message":"More evidence that this president believes in sacrificing military readiness on the altar of social engineering."}]
