[{"comment_id":"10153202654871107","commenter_b":"Deport all 30M illegal aliens.","commenter_a":"This makes me so angery that our government cant even enforce laws already there, time to replace everyone of our politicians for not doing their jobs and getting caught up with deal making, sick ,sick of it, PUT MORE INS AGENTS ON THE JOB AND GET ALL OF THE ILLEGALS OUT NOW!! and may I add i'm sick of politicians asking for money to do their jobs this includes you Mr. @username!!","post_message":"Our nation now has whole cities and states who stand up and willingly defy federal immigration laws in order to protect illegal immigrants who have broken our nation’s laws. This must end and it must end now. Today, I introduced legislation in U.S. Senate that would cut federal funding to cities and states who refuse to follow our immigration laws. My bill makes it clear, the American people will not stand for cities harboring violent criminals. But I need to know if you are with me. Please sign your \"Enforce Immigration Law\" petition right away, then consider chipping in $20.16 or more to help me spread my message to voters in early primary states."},{"comment_id":"1115305561859305","commenter_b":"And this so called wall would cost Americans billions of dollars. We can't afford that. No one can force Mexico to pay for it. And what about the water ways and the mountians? How will you put the wall on those?","commenter_a":"The WALL will seriously squelch the drug cartels, crime will decrease and the land value will increase, - It's called tough love, if we continue with open borders California will collapse, we flat-out can't afford it anymore, we're broke. Mexico has the best land in the world.","post_message":"\"Es una amiga nuestra de mucho antes y de siempre\". —Congresista Luis Gutiérrez sobre Hillary Clinton"},{"comment_id":"1068079936600104","commenter_b":"Most Mexicans ARE Indians....there for they are home.....my people the INDIANS OWN THIS LAND!","commenter_a":"Dems are the ones dividing the nation by spewing their judgement and hate on all those that don't agree with their views.","post_message":"WATCH: Donald J. Trump hosts campaign rally at the Fox Theatre in Atlanta. @webpagelink"},{"comment_id":"10153637464097377","commenter_b":"@username That's lame .The females in my family would not let it go for 10 seconds much less 10 years .","commenter_a":"10 years ago? It's not that I don't believe it, but you wait 10 years to report . Does not sound kosher .","post_message":"BOMBSHELL: Megyn Kelly has accused Fox News Chairman Roger Ailes of sexual harassment! New York magazine reports that Ailes has until August 1 to resign or be fired. Read the story: @webpagelink"},{"comment_id":"10157322113810354","commenter_b":"She is the spitting image of miss piggy. Shut up bitch","commenter_a":"@username keep this irrelevant fat slam pig off my feed, k?","post_message":"Amy Schumer: you know what Americans are \"sickened\" by? We dumb, poor, working class folk are \"sickened\" by rich, elitist, Leftist \"celebrities\" who can afford to live in million dollar homes with high-end security and bodyguards lecturing us for protecting our families and children. Sorry, Amy Schumer, that we can't afford to live in a gated mansion with state of the art alarm systems. But your pal Obama destroyed the American economy. So spare us the lectures!"},{"comment_id":"10154312293629330","commenter_b":"She's a lying murderer","commenter_a":"God help us if he wins!","post_message":"Donald Trump has been officially nominated as the Republican candidate for president at the GOP convention in Cleveland ---> @webpagelink"},{"comment_id":"10153138059356336","commenter_b":"Why women think they have to expose most all of their boobs is beyond me. Not sexy at all, just crude and tasteless","commenter_a":"Need to prove it? Does not \"represent\" anybody.","post_message":"\"I decided that I wanted to do it not only to represent myself as a professional athlete and a golfer, but to represent just all women athletes in general.\" LPGA golfer Lexi Thompson appeared on 'Fox & Friends' to address criticism of her controversial \"GolfDigest\" cover photo."}]
