[{"comment_id":"914387928629071","commenter_b":"Send all illegals home now","commenter_a":"YES YES YES","post_message":"Americas Freedom Fighters"},{"comment_id":"1071384586215885","commenter_b":"No, she's just a crazy bitch.","commenter_a":"This is silly. A healthy lifestyle stops Cancer 90% of the time . The other 10% is the govt and environment","post_message":""},{"comment_id":"1117421238280665","commenter_b":"Mary please do your homework. It would be great to have a woman president but not her. She's a chameleon. If she hasn't flip flopped on something that matters to you just wait...","commenter_a":"Hillary Clinton is the single most qualified candidate in the race, and of the last 60 years. she is the right woman for the job, and in 284 days, i will be proud to call her Madam President.","post_message":"EXCLUSIVE: Vice President Joe Biden reveals what he thinks about the US electing a female president. \"This country's ready for a woman.\""},{"comment_id":"618479561657305","commenter_b":"You should really pay a visit to area 51 theres aliens there","commenter_a":"Why didn't you bring up in your speech how the people at the Bataclan were tortured and videotaped before being murdered - oh and that it was hidden by the media...","post_message":"Hillary Clinton will increase Syrian refugees by 550% without a realistic screening process."},{"comment_id":"1649676571963807","commenter_b":"Oh no she didn't, hand of God should of slap her head...","commenter_a":"I'm very proud of you and the stand you are taking for your Savior. Stay strong, and God bless.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"},{"comment_id":"507278876143443","commenter_b":"Sorry but I do not understand why faces of those son of bitches are hidden! People should know who they are ....","commenter_a":"Cut them off and save them This is why when they become adults they attack humans!!!!!!!!!!! Ps. We should not be entertained at a circus by animals but actual talent of humans. Animals should be left in their habitat!!!!!","post_message":"Have you ever heard a baby bear's spirit break? THIS is the circus."},{"comment_id":"1325194690833614","commenter_b":"People need to slow down","commenter_a":"I hope this guy gets a huge fine and jail time. He could have killed someone.","post_message":"A driver was not injured after this violent crash that landed on Seattle's Burke-Gilman Trail. Gary Horcher shares the story >> @webpagelink"}]
