[{"comment_id":"1333672556666443","commenter_b":"but know to make tanks and bombs 😅","commenter_a":"Those migrants were never going to fulfill those jobs anyway. The Syrian migrants are larely unable to learn German to a competent level, and lacked basic education before they came. They are just going to be on the taxpayers' dole. Huge mistake bringing that many in.","post_message":"Unemployment in the engine room of Europe is at a 25-year low."},{"comment_id":"1197376426946372","commenter_b":"Closed minds are amazing to watch!","commenter_a":"Derogatory terms are part of their playbook. I'd repost this but for that in the title.","post_message":""},{"comment_id":"10153081516228822","commenter_b":"Eliza sounds like she's the one going to hell.","commenter_a":"Why is this topic constantly being forced down our throats","post_message":"It was a historic day for marriage equality in the US -- and Pittsburghers had a lot to say."},{"comment_id":"10154012429911509","commenter_b":"Shut-up and go away!!","commenter_a":"Hi i am Ellie I am 17 years old hot Girl want to some Love able friend I live in USA Follow me I will Follow you Back Like me And make me friend <3 :D <3","post_message":"In Malibu, people call the cops on other people just for sitting on the beach. It's been going on for decades. Last weekend, we put access to beach property to the test. @webpagelink"},{"comment_id":"10154702328234411","commenter_b":"Trump build that wall","commenter_a":"ONLY IF THEY'RE SWIMMING BACK ACROSS THE OPEN SEWER!","post_message":"\"This policy de facto creates an open border with Mexico.\""},{"comment_id":"1754772134792927","commenter_b":"@username is voting for hillary just because she is a female","commenter_a":"I can't wait for you to be the next POTUS @username. You've got my vote Madam Secretary. #Imwithher.","post_message":"You saw the Democratic National Convention. Now, watch the never-before-seen footage from backstage:"},{"comment_id":"1103020493078450","commenter_b":"@username and Donald Trump's wife is a illegal alien what's your point","commenter_a":"Can somebody explain this to me. Donald Trump just had a physical done and all of his stats are great for 70-year-old man. But yet factor in the draft he couldn't pass a physical exam. Did he get more healthy in the last 50 years? No I don't think so. And it wasn't because of a physical disability. Because right after he dodge the draft he just went to college and play physical sports such as tennis squash and football. So now the medical Side of the argument is contradicting 50 years later. The physical part of it is completely out of the question at the time of the draft because of the sports he played right after he dodged a war. So what other excuse is there to keep you out of the draft? Please somebody answer this question. And these veterans today deserve to hear the answer to ...","post_message":"After four days spent recovering from pneumonia, Hillary Clinton returns to the campaign trail, chats with reporters aboard her plane @webpagelink"}]
