[{"comment_id":"404025676388694","commenter_b":"Hes a piece of shit its not there country and the middle class has suffered enough from its temp wages and illegal pay for us we cant get all the benefits illegals do we do not qualify lol he just wants votes for liberal Democrats","commenter_a":"At this point ,what difference does it make","post_message":"Is President Obama breaking the law with Immigration Reform measures?"},{"comment_id":"1267016713333785","commenter_b":"Spanish and Latina aren't synonyms- Latina=a woman from Latin America. Spanish is from Spain. Jsyk !","commenter_a":"It's not really a stereotype when the cleaning industry is dominated by a majority of Latina woman. But I agree Latina women shouldn't be isolated to only this role, Spanish women work in a wide range of fields including healthcare, law and science. Many of these women have gone on to play great roles that where not maids. You start from the bottom.","post_message":"It's time to stop casting Latinas as hot-headed, sexy, maids."},{"comment_id":"10153102217682994","commenter_b":"Thugs","commenter_a":"Thugs","post_message":"Authorities say a modern-day 'Bonnie and Clyde' situation is unfolding in the Southeast right now."},{"comment_id":"1820380214887532","commenter_b":"I will bet you $10.00 to a donut she is a liberal.","commenter_a":"This is insanity, this principle needs to be removed.","post_message":"Angry yet??"},{"comment_id":"10154459591051320","commenter_b":"A Man hungry woman will sale their children's soul to keep a man at whatever price...Sad to say ...but true.","commenter_a":"I don't get how the mother didn't know. I'm sure this poor little girl had to be showing signs of withdrawing from people, especially him. She had to be acting different. Jesus this was going on for 5 years under this woman's nose. It's so sad that this child had no one to go to and kept this secret up to this point. I pray they don't let her have this baby. And for all you right to lifers, I'm sorry, this is a 13 year old child who shouldn't be expected to keep a baby resulting from a rape, when she's a baby herself. I pray that she doesn't have severe emotional scarring and other issues. Poor child... Smh. As for the POS, I hope they split him in half in prison and he bleeds to death.","post_message":"Disgusting: Police say Mark Sutton had been raping his girlfriend's daughter since she was 8-years-old. The mother found out when she took her 13-year-old daughter to the hospital and discovered she was four months pregnant."},{"comment_id":"1122113947823699","commenter_b":"Her feet are dangling fucking idiot","commenter_a":"And when exactly does he lift her and smash her against the car? Fuckin race baiter, who runs this page yo? Its gotta be a black person, racist bitch","post_message":"He LITERALLY lifted her off the ground and smashed her little body against the car! We just received this, will have more details soon."},{"comment_id":"1859800897573502","commenter_b":"His daughters are no exception .","commenter_a":"50/50 sounds fair","post_message":"Would he let his daughters be drafted?"}]
