[{"comment_id":"10153618615406320","commenter_b":"I think this moms do it on purpose.","commenter_a":"Please don't give this woman her kid back. They should take both. Her son will be next. Smdh","post_message":"SHOCKING: Child found 'Sweating profusely' Police in New Jersey had to rescue an child from a car seat in hot van while her mom went shopping. Details: @webpagelink"},{"comment_id":"1828017460760580","commenter_b":"Care less what Martha Stewart has to say period!","commenter_a":"I like Martha Stewart a lot.","post_message":"We're here live with Martha Stewart, who's ready to answer all your veggie-related questions! Ask away in the comments."},{"comment_id":"10154017496904753","commenter_b":"@username, shame on you as , should be, a lady sharing that garbage!!","commenter_a":"He should shout up and move on with is washed up singer Gwen. Miranda has kept silent . She is the classy one.","post_message":"Until today, Blake Shelton and Miranda Lambert have kept people guessing who really caused the divorce in their relationship. During an interview with Billboard a few weeks ago, the 40-year-old country superstar hinted that the 32-year-old songstress cheated on him. His song “She’s Got A Way With Words” was about a lover who cheated and lied. Shelton may not have written the song, but he said that he won’t stop people from thinking that some of the lines were about his relationship with his... @webpagelink"},{"comment_id":"1239839009369460","commenter_b":"@username is a wetback that's gonna be deported.","commenter_a":"When the immigrants - illegal or not - leave the USA, be prepared to clean your own toilets. Americans are lazy. Plain and sheer.","post_message":"Under the Eisenhower program, immigrants inside the U.S. were rounded up and deported to remote places, resulting in deaths and criticism of human rights abuses."},{"comment_id":"579603902228604","commenter_b":"She must have morals","commenter_a":"Oh the horror of it all! Freedom of speech, freedom of choice, oh now we have her! Pathetic!","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"474902102708278","commenter_b":"Suck a dick cnn","commenter_a":"The Dallas Police Officers were not killed by BLM members, but by an ex military man who was involved with ISIS! Pay attention!!! So much hate in this state. Disgusting. Thankful for the police protection here and their professional attitude. Stay safe all !","post_message":"We're in Phoenix, Arizona, where residents have gathered at City Hall to protest police violence and the recent shootings in Minnesota and Louisiana. (Source: CBS 5 AZ - KPHO/KTVK)"},{"comment_id":"10154211018961337","commenter_b":"Hot chick","commenter_a":"Dont agree rob schneider is funny in some movies","post_message":"WHOA, sorry Rob Schneider and Jennifer Love Hewitt (and all the other actors on this list)..."}]
