[{"comment_id":"1027529210615833","commenter_b":"PLEASE DON'T Watt just leave already ! AND DON'T COME BACK !","commenter_a":"I hope the hell so!","post_message":"Bye Rosie!"},{"comment_id":"637619203037928","commenter_b":"Screw you DOUCHE BAG!","commenter_a":"Death penalty on her to just for giving birth to him and the other syco!","post_message":"This is upsetting."},{"comment_id":"10153731246222217","commenter_b":"VOTE FOR TRUMP!! Screw this hoe","commenter_a":"Isn't that what Trump is actively doing? At least Clinton only accidently put others in danger, where as trump is one bad day away from bringing back Lynching, well try to anyway.","post_message":"He added that she would make \"such a lousy president\"."},{"comment_id":"10156887460220093","commenter_b":"@username @webpagelink","commenter_a":"Trump is a die hard Liberal","post_message":", I lived in New York City and Manhattan all my life, okay? So, you know, my views are a little bit different than if I lived in Iowa, perhaps. -- Donald J. Trump"},{"comment_id":"1769645119990268","commenter_b":"@username Says a blind woman","commenter_a":"Trump supporters say Trump should not be judged on his past actions, yet when it comes to Hillary Clinton, all they can talk about is the past. Hypocrisy? Also FYI, Hillary Clinton is running for Oval Office not Bill Clinton looks like that needs to be clarified for some people * You want to talk about Bill Clinton, why don't we talk about Melania Trump","post_message":"Donald J. Trump got a heck of an October Surprise."},{"comment_id":"1867582453468544","commenter_b":"Stupid bitch","commenter_a":"you make it like i did , hard work bitch , no hand outs","post_message":"One of the co-founders of Black Lives Matter just said that \"white folks\" need to \"sacrifice\" THIS for her movement... this is an outrage.  America needs to know the goals of this movement... they're not going to like this."},{"comment_id":"10152839812269753","commenter_b":"It's the POLIC WHO ARE PAID TO USE EXTRA FORCE (excessive force). It's not the job of employees, unless it's a security guard. They can RESTRAIN A PERSON UNTIL THE POLICE GET THERE.","commenter_a":"no she deserves it","post_message":"Even though she was able to successfully open the driver’s door of her getaway car, the man did not allow her to get much farther than that. He grabbed the shoplifting woman as she opened the door, turned her on her back and slammed her on the ground seconds later.  You think he used excessive force?"}]
