[{"comment_id":"10154485360681323","commenter_b":"She won the election. Period.","commenter_a":"I congratulate Brazil for their courage and determination. The Latin-American left likes to keep the people they rule poor, uneducated and frightened. They like to pretend to be the saviors. But the truth is they always leave a country poorer, they become richer, and as in the case of Nicaragua, Cuba, Venezuela, and Bolivia, they do not leave, ever.","post_message":"In keeping with her pledge to fight until the end for the 54 million voters who put her in office, Rousseff – a former Marxist guerrilla – ended her presidency this week with a gritty 14-hour defence of her government’s achievements and a sharply worded attack on the “usurpers” and “coup-mongers” who ejected her from power without an election."},{"comment_id":"1003873189632434","commenter_b":"When you take into account what these 2 young men did taking beer from a grocery store well there's going to be consequences plus swinging a skate board well the Police have to do something...I wish I were standing holding a sign I Support the Police Department !!","commenter_a":"I hate to say this but the store video does not lie. Now hopefully they'll release the bodycam video too. Now would be a great time to prove just how successful those are.","post_message":"The Olympia police officer who shot two men last week has given his account of what happened to investigators, and the department isn't releasing information. More than 100 people packed city hall tonight demanding immediate changes in police accountability >> @webpagelink"},{"comment_id":"1145540435508072","commenter_b":"No job , 6 kids , no husband . Stop !","commenter_a":"Waited in line for six hours if you would've been working kids would've ate","post_message":"Entitlement Mentality: Welfare Recipients React to Food Stamps Being Cancelled. This shows everything wrong with the entitlement mentality."},{"comment_id":"696122653842743","commenter_b":"They will catch these 2 cowards soon. Police Force do maximum.","commenter_a":"Going Back to origin country, muslim are not belong to europe, they are many coming politecal, assylum in germany, they should send bact to origen country , there muslim,","post_message":"Report: Two armed suspects in Paris shooting located in northern France"},{"comment_id":"10153123685718690","commenter_b":"Exactly , he got 72 Virgin girls.","commenter_a":"So jihad was killing none believers and was killed? so he died a hero?","post_message":"The mood was sombre as mourners gathered in Beirut southern suburbs to pay their respects to Jihad Mughniyeh, one of the six Hezbollah fighters killed in an alleged Israeli air strike in Syria. @webpagelink"},{"comment_id":"1681683485379770","commenter_b":"That should be a crime leave OUR money alone I'm sad to see this .don't we have rights what was this country built on!!!","commenter_a":"Why !!!!!! Muslims ????? Why !!!!! They need to remove there burkka and all the drag queen garb all the poof ta\"s wear !!!!!!!!","post_message":"\"In God We Trust\" To Be Removed From The Dollar Bill Leave the dollar alone. Are country was built on Christian beliefs. Do you think they should leave 'In God We Trust\" on the dollar bill?"},{"comment_id":"1029144867143578","commenter_b":"@username maybe they should all go to Mexico instead .","commenter_a":"Trump. A habitual liar, narcissist, racist, fascist, five time draft dodger, four time bankruptcy filing, woman hating misogynist, bigoted bully. A man who only has money because he's a vaginal success. (Born into wealth.) A man who represents everything that's wrong with this country. Yet, people will vote for him. The very same individuals who stand to lose the most. Wake up. He only cares about himself.","post_message":"New Jersey Gov. Chris Christie offered up the latest twist of the Republican presidential primary when he endorsed Donald J. Trump on Friday."}]
