[{"comment_id":"10154221705040530","commenter_b":"What a dumb bitch!","commenter_a":"Black on Black crime really needs to stop. So sad this young lady endured such hatered and pain from peers of her own. Rest in peace. I'm praying the killers are soon arrested and face the fate of their punishment real soon, behind bars for the rest of there life and no parole it will serve them right","post_message":"Amy Inita Joyner-Francis, 16, died Thursday morning during a violent attack in the girls bathroom."},{"comment_id":"498469603689886","commenter_b":"This sissy should go into a latino hood, she won't be talking smack for long","commenter_a":"Get outta here.","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING. Enjoy. ~ DG"},{"comment_id":"10155023527124614","commenter_b":"Oh it was...Sears. It's been awhile since this happened.","commenter_a":"It's sad to see Sears going this way. They lost their way and are seemingly heading towards permanent closure. What's sad is I think Kmart is to blame, whoever at Sears approved that merger with Kmart as they were going through bankruptcy was crazy.","post_message":"Sears Holdings announced today the closure of dozens of Kmart and Sears locations, including multiple locations in California. Stores in Riverside, Bakersfield, Coalinga and Kingsburg will be closed by the end of March, according to officials. decision to close stores is a difficult but necessary step as we take actions to strengthen the Company operations and fund its transformation. Many of these stores have struggled with their financial performance for years and we have kept them open to maintain local jobs and in the hopes that they would turn around,\" officials said in a statement."},{"comment_id":"10154008919327439","commenter_b":"I cant stand these lying disgusting woman abusing savage animals MUSLIM MEN","commenter_a":"Didn't take long for \"moderate\", \"peaceful\" muslims to take on a new tactic. One that the liberal media will blame on Christians. These followers of allah/satan are true examples of evil!","post_message":"ISIS has issued a handbook for Muslims in the West. The gist of the instruction booklet is the necessity to blend in with the western way of life and to avoid ‘looking like a Muslim’ - pretend to be Christian -- so as to stay below the radar of the security services. This is important. It is key to understanding the enemy and their tactics. The media and the Democrats are deliberately misleading the public. You must educate yourself and those around you. Share this article on Facebook, Twitter, email. Build our army."},{"comment_id":"10154499233438132","commenter_b":"All men have hoes.","commenter_a":"your universal super power What if I told you that you hold the universal super power of anticipating life-altering encounters with strangers... tapping into your unlimited abundance frequency predicting upcoming challenges and lucrative opportunities... and following through on your BIG goals without any hesitation or uncertainty How? You might be wondering... Because you have access to a secret weapon that most don know about: Numerology. You be amazed at the shockingly accurate and revealing information that can be deciphered from nothing more than your name and date of birth. @webpagelink","post_message":"John F. Kennedy's scandalous handwritten love letters have been revealed."},{"comment_id":"10152785056866051","commenter_b":"how dumb are these women","commenter_a":"WTH!","post_message":"This prisoner impregnated not one, not two, not three, but four prison guards."},{"comment_id":"910206839098639","commenter_b":"How is this funny, what an ignorant woman!!","commenter_a":"Sarah Silverman is a moron who needs to go back to school and learn what the real Hitler was all about.","post_message":"Was this a good idea?"}]
