[{"comment_id":"1348114028561384","commenter_b":"This woman is supposed to be a reliable, professional journalist? Bitch please, she is a joke!","commenter_a":"F Kaine he's a hillbilly","post_message":"LIBERAL MEDIA's meltdown.  @webpagelink"},{"comment_id":"10154654748316320","commenter_b":"What barbarians","commenter_a":"Savages","post_message":"SHOCKING:  Video posted on social media during demonstrations Wednesday night in Charlotte appears to show a group of protesters beating up a man and stripping him of his clothes as he begs for mercy.  @webpagelink"},{"comment_id":"10153903650539087","commenter_b":"@username - You're behaving like a whining whore. Give it a rest.","commenter_a":"It's good that she's fielding questions about her emails? It would probably be even better if she wasn't such a unethical, lying piece of crap and didn't have to be in the position to have to answer those said questions, wouldn't it?","post_message":"Hillary Clinton showed that she's a skilled politician who understands exactly the way media works."},{"comment_id":"10153572356905329","commenter_b":"Yeah Cheryl. You stupid bitch.","commenter_a":"Not very honest of you @username - you have deliberately failed to mention the marginalization & persecution of christians & other groups who morally oppose same sex marriage, & the hardship & tyranny they now endure. You have also quite 'conveniently' chosen to ignore the increasing body of evidence that is emerging of the sense of loss, disadvantage & suffering, those raised in same sex relationships, & who have now reached adulthood, have & are experiencing - nor the vilification & persecution they can face for daring to speak out....","post_message":"Eighteen other countries have legalized same-sex marriage before America. Let's see how some of them are holding up."},{"comment_id":"846208402083168","commenter_b":"Sounds like she has her head screwed on pretty straight !","commenter_a":"Amazing !!i am actually so happy for this girl... Finally, someone who I think really deserves and will truely appreciate what has just happened to her...","post_message":"\"I’m just grateful for this moment.\""},{"comment_id":"447635222089017","commenter_b":"You are probably pro abortion cause you hate child support...","commenter_a":"This is great. You idiots that are against abortion are just that Idiots. Quite trying to take rights from Women . Plus Planned Parenthood doesn't pay for abortions. The client does. They provide health care. Get your facts right.","post_message":"JUST IN: A Houston grand jury investigating undercover footage of Planned Parenthood found no wrongdoing by the abortion provider but instead indicted anti-abortion activists involved in making the videos that provoked outrage among Republican leaders nationwide."},{"comment_id":"1345080275507252","commenter_b":"I cannot believe how many selfish bastard whites live in this country that they stole from Mexico with a trumped up phony war. These selfish bastards all belong to the Repubtard party. which we need to destroy.","commenter_a":"Why do we have to pay for every disgruntled citizen from every country in the world.....you politicians have us deep in debt but want more from us....All you are doing is enabling irresponsible government around the world.....everyone sees the US as the international welfare program....we have too many of our own citizens who need to be cared for....and their violence is no worse than our own....","post_message":"I hope the administration reconsiders these raids. These children and their families are fleeing extreme violence in Central America and they should have a chance to seek relief, which is why I introduced the “Fair Day in Court for Kids Act” — a bill that mandates counsel for these vulnerable individuals. Instead of separating children from their parents, the administration should continue to address the violence and instability in the region that is forcing these families to leave."}]
