[{"comment_id":"10153159766848701","commenter_b":"Pigs... Sterilize them both!!!","commenter_a":"Slam thier ASS in jail till they both get the hell beat out of them or killed by inmates.. Thier parents are proud of them now ...","post_message":"A man and woman charged with murder are accused of starving their 7-week-old baby to death in Douglas County."},{"comment_id":"965589516846855","commenter_b":"Rubbish. MUSLIMS are 90%terrorist","commenter_a":"If someone calls themselves a Christian and then goes and shoots people at a movie theatre, are you going to then say all Christians are bad? The thing is, all Muslims are not terrorists. My fiance is a Muslim his family are Muslim but they are not terrorists. Why should he have to wear a badge and be watched when he did absolutely nothing. Terrorists do not have a religion they don't have a 'look' anyone can be a terrorist and saying we should badge all Muslims is just plain hate.","post_message":"'Being Muslim doesn't make me any less American than you are,' she wrote in a letter to Donald J. Trump that's now gone viral."},{"comment_id":"10153468728217507","commenter_b":"By RIGHTS she should be arrested, Constititutionally tried on TV and executed for TREASON. The first woman","commenter_a":"Hillary is a disgrace","post_message":"47 more states to go!"},{"comment_id":"10152758880516636","commenter_b":"Would it mean I get to touch a woman?","commenter_a":"No i would get stage freight","post_message":"Who actually volunteers to have sex in a laboratory?"},{"comment_id":"10154347053069411","commenter_b":"45 million people on food stamps. 30 million illegal aliens allowed to run free while a record 2.3 million Americans are locked in jail. The largest national debt in the last 240 years. A record 95 million Americans are not in the labor force. The longest streak of war time in American history with 22 veterans committing suicide a day. A healthcare system than now kills a record 500,000 Americans each and every year while maiming millions more. The muslim Democrat Obama has proven he is an epic failure. Obama is killing Christians globally.","commenter_a":"People need to stop acting like that to cops if you keep resisting that's what happens! These cops are doing the best they can.","post_message":"'We f**ked'"},{"comment_id":"10153576265156336","commenter_b":"Suck it up, buttercup.","commenter_a":"Wonder if this clown avoids baseball games","post_message":"Lambert’s Café is known as “Home of the Throwed Roll,” where servers at the restaurant are known for tossing the rolls to customers."},{"comment_id":"10153160382606491","commenter_b":"Lauren Kirby","commenter_a":"1577961212219543s","post_message":"'Amy and I were creatively made for each other,' Jennifer Lawrence said."}]
