[{"comment_id":"1756313234607564","commenter_b":"Hillary the Corrupt Witch Bitch !","commenter_a":"#NeverHillary!","post_message":"***UNPRECEDENTED CORRUPTION***"},{"comment_id":"10153846038466336","commenter_b":"Smug calculated shrew. She's nothing short of evil. WHY ISN'T SHE IN PRISON?","commenter_a":"She is a lying self serving witch and she has a list of dead people that believed in her and knew to much that could destroy her and Bill.","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"1191494990889956","commenter_b":"I could care less what that judge has or says, I AM TRUMPED ALL THE WAY TO THE WHITE HOUSE !!!!!! THAT FREAKIN JUDGE JUST DON'T WANT THE WALL !!!!!!!! TRUMP 2016","commenter_a":"Boy, if Obama worked as hard pleasing the people as he does trying to destroy the republican front runner we'd all say he was great instead of destructive.","post_message":"HISPANIC JUDGE THE NEWEST ATTEMPT TO DERAIL TRUMP  @webpagelink"},{"comment_id":"10155060869437439","commenter_b":"(HOW DID A MUSLIM GET IN THE POLICE FORCE ANYWAY WE ARE AMERICANS????????????","commenter_a":"a phony bitch sitting next to an absolute idiot.....","post_message":"Police officers are being targeted for murder. Black Lives Matter has put a bounty on their heads. NYC Mayor Bill de Blasio has not supported the police. But Mayor Bill de Blasio calls an urgent press conference on \"anti-Muslim\" crime after a Muslim police officer claims to have been offended."},{"comment_id":"10153717683207894","commenter_b":"@username Nobody's voting for Hillary? Why does she have 3 million more votes than Bernie??? I'll wait","commenter_a":"I don't know why people spew unnecessary hate for this woman, She has millions more votes than Bernie and is the better between her and Trump. What did she do so bad to you all? Bernie Sanders got yall head messed up. And that whole Bernie or bust thing is IGNORANT as hell. Writing in Bernie Sanders name is basically a vote for trump, smh","post_message":"Hillary Clinton Reaches Delegate Count, IS the Presumptive Democractic Nominee for President"},{"comment_id":"1270088773057875","commenter_b":"@username cocain bottles and bitches *","commenter_a":"Let me get a 300$ tip in Christmas I'll spend that shit on cocaine and bitches","post_message":"Faith in humanity restored!  #WSHH"},{"comment_id":"496464583811469","commenter_b":"we are not picking on her because she is a women!!!!!!!!!!!!!! Get that straight right off! we are stating that she has a very long line of a shady past, and if you people dont get your head out of the sand it could very well damage our country more than what we can correct. She will never get my vote, already saw her in action and it was not a pretty site.","commenter_a":"I can't believe how mean and cruel people are!!! It's sad. Hillary is not perfect, no one is!! She has made mistakes just like all the other presidential candidates. Every person that has run for President and every President in the White House has made lots of mistakes. Everyone picks on her because she's a woman!!!!! I'm thinking seriously about voting for her.","post_message":"Trump says Clinton is a woman abuser who would be a horrible president. Agree or disagree?"}]
