[{"comment_id":"1811243409145396","commenter_b":"what kind of genius stays with a man who outright cheats on you and is a womanizer....","commenter_a":"what kinda genius puts our deficit at $20 trillion....","post_message":"\"Now, how anybody can lose a dollar, let alone a billion dollars in the casino industry, is kind of beyond me,\" Hillary Clinton said of her opponent."},{"comment_id":"10155027451044411","commenter_b":"Boooo :) make them strong :) We kick your ass in Afghanistan... @username should respect other cultures and their traditions.. These Indian Muslims doing this due to their believes.. This is racism what is @username doing..","commenter_a":"What about you Russian whores bathing their babies in Ice cold water... shit heads @webpagelink","post_message":""},{"comment_id":"10152979893954753","commenter_b":"fuck you bitch","commenter_a":"No pay","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"871246712910789","commenter_b":"The face of an ugly, pathetic bitch.","commenter_a":"I would never have breast fed my daughter in public. A woman can go to the ladies room or bring a bottle with her when she's out. I think it's distasteful to breastfeed in public.","post_message":"\"I was almost in tears and creating my own wet t-shirt contest by the time I could pump again.\""},{"comment_id":"934633189910873","commenter_b":"Ah, Danielle, so you had the choice because of feminists who paved the way for you to do so.","commenter_a":"It user to be Matt but anymore it's just crazy man hating women destroying family dynamics in this country. I believe in equality, rights and fair treatment of all. Men, women, and all races, but I'm not a feminist. I support my family the best way I can now which is to stay home and take care of them. My children are smarter and safer with me here, plus they have a structured living environment. I plan on getting a p/t job when they both start full time school but as for now this is where I'm needed. And I love every minute of it even the hard days.","post_message":"Ellen Page has a point here, ya know... Thanks for the photo, MTV Act!"},{"comment_id":"559259350942537","commenter_b":"Lord,bless this precious child, hold this family in your loving arms. In the name of Jesus. Amen","commenter_a":"Sad, she is a pretty young lady! Prayers for Hannah and her family!","post_message":"\"We have all been waiting and praying for a miracle,\" a post on the Facebook page 'Prayers for Hannah Katherine' said. \"We are now waiting for her to join the angels in heaven.\""},{"comment_id":"502242713299642","commenter_b":"Fire him","commenter_a":"Break his legs then he will have an excuse not to stand.","post_message":"This Muslim NBA Star refuses to stand for the U.S. National Anthem. How disrespectful. Regardless of religion, you need to respect our country. Do you agree this NBA player needs to learn some respect?"}]
