[{"comment_id":"582726195242593","commenter_b":"Omg seems that all woman are becoming liars now ^ smh^ unbelievable","commenter_a":"There are two women Trump doesn't want to tangle with. Elizabeth Warren has forgotten more about economics than he ever knew. And Hillary's foreign policy knowledge is something he will never acquire. She will decimate him in a debate because he will have to be ready to speak on issues, not just make personal attacks. He is so thin skinned that he will self destruct as soon as she holds his feet to the fire. He and his followers don't have a clue. They have demonstrated time and again that when all else fails, thuggery rules. That doesn't win elections once reasonable people make up their minds not to put up with it any more. Now I just hope that reasonable people do that sooner than later. Put him out of his misery as quickly as possible.","post_message":"He's got a problem."},{"comment_id":"1154295914627380","commenter_b":"This woman is crazy for thinking of that.","commenter_a":"You remind me of the politicians who turned away boats full of Jewish refugees, and sent them back to Germany to suffer in the Holocaust.","post_message":"Hillary Clinton will increase Syrian refugees by 550% without a realistic screening process."},{"comment_id":"492568140946699","commenter_b":"Keep it close to the Whitehouse for the next few months, 2 fer 1! (JOKE)","commenter_a":"No.","post_message":"Guess who was at the ribbon cutting ceremony?"},{"comment_id":"10154413353871519","commenter_b":"Nope. Good luck, though!","commenter_a":"They better NOT. You will get the same help you gave President Obama, 0. Now, GTFOH","post_message":"This is an offer they are not likely to take him up on."},{"comment_id":"10155790641929778","commenter_b":"Were you guys offended when Obama did it? This is why nobody trusts the media, it's completely bias!","commenter_a":"If you, or anyone you know, is personally affected by this ban, please reach out to us. Message us on Facebook or email newstips@wusa9.com.","post_message":"More than 30 protesters are holding signs against President Donald J. Trump's immigration plan at Washington Dulles International Airport. @webpagelink"},{"comment_id":"914583611910394","commenter_b":"Trump is right about illegal immigrants. Our government has committed treason by leaving the borders open.","commenter_a":"Give em a right and then a left upper cut ,don't quit,you have em on the ropes...","post_message":"Hot off the press!"},{"comment_id":"1271975762826442","commenter_b":"You guys are so right & prosperous blacks had their own black slaves too. Our troublemaker-in-chief is keeping this going, stirring up strife so he can cry Marshal Law & keep his seat in our White House. We're in big trouble folks but most people don't even know that. Keepin' on puter & cell phone games, partying, gettin' high & working 2 jobs just to keep the bills paid. The average person has no time to protest & make trouble but we have the government paying people to not work so THEY have lots of time. It's how barry wants it to be.","commenter_a":"Loretta, Sadly, you're an intricate part of the problem. Just another old racist white person that cannot and/or will not recognize the murder of our young Black men by white racist police officers. Your kind will always find an excuse to somehow blame the victim...the evidence be Damn!","post_message":""}]
