[{"comment_id":"1048332608520428","commenter_b":"Lmao Persian women though.. Gorgeous.","commenter_a":"You are free to choose between Arab uneducated fundamental extremists and moderate enlightened Persian Cats..","post_message":"Iranian Foreign Minister Mohammad Javad Zarif said on Wednesday a new U.S. law putting visa restrictions on Iranians and those who had visited Iran would, if implemented, breach a nuclear deal Tehran had struck with world powers earlier this year. Read more: @webpagelink"},{"comment_id":"10157371541105231","commenter_b":"But they pay for it smh","commenter_a":"Sorry but if she was white I would still find this inappropriate. For me it has absolutely nothing to do with the color of her skin or the shape of her body as a human resources manager I have had to have many a talk with white, brown, and black women regarding their inappropriate attire. That's what dress codes in the workplace are for. FYI men also come to work in inappropriate attire. They tend to dress sloppy, they don't bath, and when they think they're sexy they tend to show us way more than we want to see. So it works both ways.","post_message":"It isn't the clothes they have an issue with."},{"comment_id":"793441997371016","commenter_b":"If they don't want to be detained. The scum should not steal. We pay for that! We need to get tougher on criminals","commenter_a":"Don't break the LAW!!! Then resist as well! Quit sticking up for criminals. This lady is an idiot to begin with don't do the crime. Choices... Make the right ones or like anyone else suffer the consequences from your choices. Maybe crime will go down if we actually don't try to protect the criminals and support our police forces. Remember enforcing the Law is for our safety. So for all you law breakers don't break the law if you don't want to take the risk of suffering the consequences.","post_message":"RAW VIDEO: A shopper claims she caught security guards at a Chandler Walmart putting a suspected shoplifter in a chokehold.  She took the video below on her cell phone. You can hear the woman shouting \"I can't breathe. I can't breathe.\" She then appears to be passed out on the ground.   Do you think security was too rough, or just doing their job?  FULL STORY: @webpagelink"},{"comment_id":"10153018260001130","commenter_b":"Darin, what exactly, is a slut?","commenter_a":"abstinence based=teachs them nothing and then they get curious and then once curious they start having sex and when that happens boom teen pregnancies and after that begins the slut shaming when the only people who should really be blamed is the schools and parents for not being more educational","post_message":"Young people still aren't getting much from sex ed."},{"comment_id":"10153614768367550","commenter_b":"Women shut da hell up I'm short hand writing","commenter_a":"People be ready to dissect the situation, wen in reality it's the system fault. What do you expect it's no jobs in Fayetteville. People looking at what I'm saying and they're lik Wat is he talking bout. Like I said it is no jobs in Fayetteville, and this is suppose to be a military town it should be jobs all over the place but it's not. It's three types of ppl in Fayetteville. The military, the civilians that's what they call us. And the third is ppl who do what ever it takes to get paid or feed they family. Now don't get me wrong yea it's messed up ppl breaking in ppl houses. But give these ppl job's and I bet all the money in the world they become a better civilian then the first person who commented on this topic. @username. No job's and this is Wat u ...","post_message":"\"And you're charged with a similar crime that you just went to prison for?\"  \"Yes, Sir\""},{"comment_id":"10153051145414094","commenter_b":"And if gun laws don't work, why have any safety laws? Should hardware stores sell nuclear material because the bad guys will get anyways? Should we not have traffic laws because the bad drivers will run a stop light anyways and crash into a school bus?","commenter_a":"While Republicans were defending the lack of sensible gun laws and calling this an \"accident\", the families and communities of this Church showed such dignity and Christian values by first saying that they forgive the shooter. They are such an amazing example and inspiration to this country. God bless them.","post_message":"Relatives of people killed in a shooting at a black church in Charleston, S.C., addressed the suspect in court Friday In an extraordinary display of grief and forgiveness."},{"comment_id":"10155161723871037","commenter_b":"You are so gross ...","commenter_a":"States where mestizos who refuse to learn English because we made it possible to not have to learn English and tell them assimilation is bad, have horrendous scores.","post_message":"Number 1? Massachusetts."}]
