[{"comment_id":"1055104137833836","commenter_b":"Let 'em try! They'll fail miserably!","commenter_a":"Because they welcomed the terrorists with open arms. And because the French people allowed their government to disarm them. They were sitting ducks. Thank God for the Second Amendment. If they could, the gun grabbers would disarm us.","post_message":"Why Paris? Why now?"},{"comment_id":"1172494429493450","commenter_b":"These dumbasses should be ashamed ... No one will ever vote for either of these liars again . No Honor ..No Vote","commenter_a":"These three men will never get my vote in the future. Anyone that is with her is corrupt... Republican or not you need to go.","post_message":"GOP 'Never Trump' Candidates get a Warning"},{"comment_id":"564500333698743","commenter_b":"Liz is either stoned or drunk on the kool aide.","commenter_a":"yeah right","post_message":"Hmm...gratitude was not exactly the word I had in mind."},{"comment_id":"1130148643687222","commenter_b":"Never. Who would be stupid enough to want murderer Hillary to be over our beautiful nation and wonderful people.","commenter_a":"Utah vote TRUMP!","post_message":"**BREAKING**"},{"comment_id":"10153885822754087","commenter_b":"Lmao.. She's a moron","commenter_a":"@username hysterical","post_message":"Hillary Clinton took things a bit too literally during a recent campaign stop when she read the word “sigh” off her TelePrompTer instead of actually doing one. WATCH:"},{"comment_id":"10152839305921680","commenter_b":"Not this half latino nor his wife and father!","commenter_a":"And Latino will fall for it again.","post_message":"\"As a mother, grandmother, and American, I don’t know how a person can meet these young people ... and think of threatening them and their families with deportation,\" Hillary Clinton said."},{"comment_id":"421728768009004","commenter_b":"Burn her as a witch","commenter_a":"So intelligent, and powerful women","post_message":"Share if you're Ready For Hillary!  Get all the best HRC coverage you need here:  @webpagelink"}]
