[{"comment_id":"1438259686194057","commenter_b":"Say No to drigs","commenter_a":"I tired this in high school a few times when it was sold in gas stations. Knew a girk that made it too. So dangerous! Just smoke pot. I'm glad Co legalized weed and got rid if this stuff.","post_message":"Everything you need to know about K2, the drug linked to a mass overdose of 33 people in New York: @webpagelink"},{"comment_id":"1724103797869883","commenter_b":"This black pig needs to be publicly executed by being hung till dead,then tossed in the garbage tho I doubt the land fill will allow the garbage truck to dump their garbage with him in it .","commenter_a":"BLM, baby ! BLM !","post_message":"Media Silent After Black Teen Shoots Newlywed Veteran And Executes His Pregnant Wife. Tragedy strikes again, please pray. What do you think his punishment should be?"},{"comment_id":"1069087446447636","commenter_b":"Put her on the street .","commenter_a":"She looks flashy","post_message":"The liberal media loved Michelle Obama's tang SOTU dress. Take a guess at how much it cost."},{"comment_id":"10153131128315950","commenter_b":"I hope their daughters get pregnant out of Wedlock","commenter_a":"I'm sorry, but your country deserves one more crazy, running it. Welcome Donald!","post_message":"The House voted to block Planned Parenthood's federal funds for a year."},{"comment_id":"10153276508787144","commenter_b":"I certainly hope you don't have daughters with that repulsive, misogynistic mouth.","commenter_a":"Grace under fire?? I just love how you baby murdering dirtbag sluts try to make yourselves out to be the victims instead of the human beings you kill. Why don't you show the exchange how it really happened? @webpagelink","post_message":"Yep."},{"comment_id":"963644947039340","commenter_b":"But she is dirty","commenter_a":"She knows women's issues best","post_message":"Watch live as Hillary talks to students at New England College in New Hampshire about the issues on their minds."},{"comment_id":"10153561162560530","commenter_b":"No, she hit him and kneed him in the balls","commenter_a":"Why didn't this show how he was shoving through the crowd and her up against the bar and that's why she got mad?","post_message":"Surveillance video from a Tallahassee, Florida bar shows Florida State University quarterback De'Andre Johnson and a woman engaging in a bar fight in June 2015. STORY: @webpagelink"}]
