[{"comment_id":"949528478479092","commenter_b":"why can't they just leave things alone change this change that !!!!!","commenter_a":"The man who stopped the corrupt bankers is dumped. How extraordinary.","post_message":"Not everyone is happy about the change."},{"comment_id":"10153982625649087","commenter_b":"Nobody cares that she wants to redistribute their money to the millions and millions of illegal alien Freeloaders and refuess","commenter_a":"Trump needs to start hammering Hillary Clinton just like Bernie Sanders did","post_message":"Donald J. Trump lashed out at former CIA Director Michael Morell after he announced his support for Hillary Clinton and said Russian President Vladimir Putin 'played' the Republican nominee."},{"comment_id":"10153803729806336","commenter_b":"Yes, and McCain and Graham were WRONG! Just like letting all these muslim immigrants into our country...we dont know WHO THEY ARE!!!","commenter_a":"Wait. You cry and cry that he has not done enough in Syria. He then sends some. And you get upset over that??? Fox / GOP supporters make zero sense.","post_message":"On 'Justice,' Judge Jeanine Pirro slammed President Barack Obama's decision to send U.S. troops into Syria, after repeated pledges of no boots on the ground. @webpagelink"},{"comment_id":"10153127700606491","commenter_b":"That females are equal to males. Google the definition of feminism. That's all it is. Males and females equal. No enforced culturally engrained gender roles. It goes very deep.","commenter_a":"Amazing that no one commenting but me is for gender equality! I thought it was 2015 :( oh well you can't teach ignorant adults I suppose.","post_message":"'Every child is an individual.'"},{"comment_id":"10153994527466509","commenter_b":"Cnn is getting paid big time to support him.","commenter_a":"'@username, is Trump paying you to write about him, not an hour passes by without you guys writing about Trump. Looks likes he is the only one running for presidency, can't even remember last time I saw a story about Obama. Please give everyone a fair playing field.","post_message":"Donald J. Trump is going to make a decision 'very soon' regarding a third-party run, he says. @webpagelink"},{"comment_id":"10153650644833812","commenter_b":"Feminism at its finest.","commenter_a":"Hillary Clinton has a beautiful spirit God bless","post_message":"Hillary Clinton's mom, family life at center of $2,000,000 TV ad buys directed at Iowa and New Hampshire: @webpagelink"},{"comment_id":"10153750563214497","commenter_b":"Liar. You're not a prostitute.","commenter_a":"As an African American prostitute I find this offensive.","post_message":"For more world-renowned reportage, visit theonion.com."}]
