[{"comment_id":"1721734318116068","commenter_b":"Ean hahaha","commenter_a":"Daniel Howe","post_message":""},{"comment_id":"1214214798614861","commenter_b":"From Chris (Author of this article) he mentioned \"dangerous batteries\". Well what did you know the whole world is putting blames on a company instead of the provider. Talented consumers indeed. Personally the problem probably lies with the performance output and the batteries supplying the phone. Note 7 is a heavy powerhorse so... overexerting the battery could damage it.","commenter_a":"This is worst than the BlackBerry disaster.","post_message":"BREAKING: Samsung ends production of the Galaxy Note 7."},{"comment_id":"10153328594703132","commenter_b":"She needs to just quit. Can't stand her","commenter_a":"Jennifer Lesher","post_message":"\"I do not want to use my comedy to contribute to a culture of unattainable perfectionism and intolerance towards difference.\""},{"comment_id":"1321956137825394","commenter_b":"Great, I'm off to Havana tomorrow!","commenter_a":"Cahl Denni Sharknado?","post_message":"Every single one of those black dots is a 2-meter-long shark."},{"comment_id":"1733753426842494","commenter_b":"@username Subtract the illegals and convicted felons that cannot vote those minority numbers are laughable .","commenter_a":"I see Hillary's sheep say Trump will Lose the Latino, Woman, LGBT, Veterans and Blacks votes. I am sure Latinos enjoyed seeing they are called taco bowl voters to the democrats. Women Yeah because Women most likely respect the way Hillary treated women when her husband sexually assaulted them, LGBT yeah because her policies are directly responsible for 49 of there deaths in Orlando and she wants to increase that by 500%, Veterans yeah because every service man/woman wants a women who will abandon them. Blacks yeah because blacks love to be called super predators, The only votes Trump is losing is to brain dead people who care more about a business mans taxes then they do Clinton's proven corruption and lies. and the only polls Trump is losing is broadcast on the same media outlets that have been proven to be corrupt. Watch a Trump rally and then watch ...","post_message":"\"[Hillary Clinton] is bought, controlled and paid for by her donors and special interests.\" Donald J. Trump gave a speech on economic policy this afternoon, saying \"Hillary Clinton will never withdraw from TPP.\""},{"comment_id":"1736136556654311","commenter_b":"Secure our borders. ..Start deporting. AMERICA FIRST. ..GO TRUMP.","commenter_a":"This wasn't a racist comment trump was saying the judge could very well be prejudiced against trump because he wants to build a wall to keel illegals out and drugs and people who wants to do harm to our Country and judges parents are Mexican","post_message":"\"Claiming a person can't do their job because of their race is sort of like the textbook definition of a racist comment,\" Paul Ryan said of Donald J. Trump's recent comments about a judge. @webpagelink"},{"comment_id":"1166911916662170","commenter_b":"Quit being a girl!!!!!!!!!","commenter_a":"People should remember that clearly there are innocent people in both jails and prisons. How would you like to be an innocent person in jail or prison, getting beaten up....with people cheering on further for you to be additionally brutalized?","post_message":"Inmates at New York's Clinton Correctional Facility say they were beaten, choked and slammed against walls by guards seeking information after 2 convicted killers escaped."}]
