[{"comment_id":"1016269761823135","commenter_b":"Disgrace to this country she is a racist bitch of another type BAN this bitch from your cities stop buying her crap she calls music no talent bitch.. Yes I am pissed she is allowed to keep going.","commenter_a":"She has shown her true stripes and needs jail time to think about what she did knowing her idiot followers would try to please her.","post_message":"Beyonce has morphed from pop-star to Jesse Jackson in a D-Cup. Check this BS out. BTW, She foments more hate than any zany right-winger 'the media' makes up. @webpagelink"},{"comment_id":"10153907295491680","commenter_b":"@username your a bitter woman","commenter_a":"Another classless moron that thinks sexual abuse is ok 👌 way to go Rush, you are pathetic","post_message":"\"Men brag,\" Rush Limbaugh said on his long-running radio show."},{"comment_id":"10153330405506130","commenter_b":"Exactly. Plus her job is simply to determine if a couple qualify for marriage under the law, not to marry them. She isn't advocating gay marriage by signing the licenses, her signature simply states they are lawfully allowed to wed. Her fucking religious views don't even apply to her job, the fucktard! She is simply trying to use religion to justify her bigoted attempt to judge others and not do her job. She is an employee of her state/county, and bound to the law. If she wants to have her religious views dictate her job she needs to be a clerk for a church. Then she can be a bigot all she wants.","commenter_a":"She is a public servant...to serve ALL the people...not just the ones she agrees with...there's a little thing called \"separation of church and state\"...","post_message":"\"We cannot be held hostage to the theatrics of religious extremists.\""},{"comment_id":"10153270653234091","commenter_b":"It should of been called player interference he did not slide with intent to advance to 2nd his sole purpose was to take out the 2nd baseman and break up a double play you can call it dirty call it aggressive I believe the rule says you have to start your slide before you reach the base and that he did not do . With all the new rules to protect the catchers and collisions at the plate this is no different . I believe he should be suspended . Unless you want the benches to clear every time he comes up to hit","commenter_a":"Here are the rules! Evidently, the umps didn't get that memo!!!","post_message":"UNDER REVIEW: Major League Baseball executive Joe Torre will review last night's controversial slide by the Dodgers Chase Utley that broke the leg of Mets shortstop Ruben Tejada for possible disciplinary action. What are your thoughts about the play? Read more: @webpagelink"},{"comment_id":"1807011322902281","commenter_b":"In what part did she say super predators? Actually finish watching the video instead of make false accusations!!","commenter_a":"Do you guys have one recorded incident of Trump saying anything negative towards the black community like this? We have a recording of Hillary calling African-American super predators and saying to a group of black people that if they did not like what she had to say then she would just go talk to white people. @webpagelink","post_message":"BREAKING: Trump's own rental agent just told MSNBC that the Trumps told him: \"WE DON'T RENT TO N-WORDS\" Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153281917270090","commenter_b":"And what does that have to do with what his stand on immigration has cost all tax payers!","commenter_a":"Illegal immigrants!","post_message":"All of the above! Choose Obama's #1 failure as president: @webpagelink"},{"comment_id":"10154376040464641","commenter_b":"making of The Taken 3 (Must watch Unbelievable) @webpagelink","commenter_a":"That's what we should be doing focusing on the dummies in the audience, the cockroaches","post_message":"Donald J. Trump's controversial \"Second Amendment people\" comment made Darrell Vickers' bearded jaw drop."}]
