[{"comment_id":"1642335606053552","commenter_b":"It's a shame what Obama has done...","commenter_a":"We'll See If You Mock Jesus When He Returns For All Us CHRISTIANS! CHRISTIANS Are Praying for You Obama.......","post_message":"Wow. Thank you for defending Christians David Cameron."},{"comment_id":"10152867504581336","commenter_b":"What a ugly woman she is","commenter_a":"This is what Islam is all about........ @webpagelink","post_message":"Ayaan Hirsi Ali has something in common with the #CharlieHebdo editor murdered by terrorists in Paris: She is also on al Qaeda’s death list. She spoke to Megyn Kelly tonight on 'The Kelly File.'"},{"comment_id":"10153703275114384","commenter_b":"Whine, whine, whine. All the illegals will vote for hand outs, what more do you corrupt fools need? Lying POS!","commenter_a":"BLUE ALL THE WAY!!!","post_message":"It is inexcusable for Republicans to have left town without acting to restore the Voting Rights Act. Click LIKE if you agree: Nothing should stand between American citizens and their most sacred right to vote."},{"comment_id":"935532149828645","commenter_b":"No refugees immigtants.We're your great great.oh Grandparents Irish immigrant ?","commenter_a":"NO REFUGEES, NONE ! We Americans do not need more problems in our country. Stop them, am I CLEAR ?","post_message":"Our nation has always been welcoming, but we can’t let terrorists take advantage of our compassion. We should not bring Syrian refugees into this country unless we can be 100 percent confident that they are not here to do us harm."},{"comment_id":"524517941072119","commenter_b":"This is USA .Muslims can eat pork and go to hell.","commenter_a":"Yall think they are pissed now ????? we aint done with them yet, still gotta play Cowboys and Muslims and then those who are left get to play the part of the Mexican Army at our reenactment of the \":Battle of San Jacinto\" although this time we aint takin prisoners ... Remember the Alamo !!!!!!","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy. Let them be angry. This America and if you don't like it, get out. Do you agree that Muslims should assimilate or leave?"},{"comment_id":"10152717878976770","commenter_b":"Too many nut-jobs in higher education these days. Bet she sues the school if she gets sunburn.","commenter_a":"Stupid is as stupid does and we all know you can't fix stupid.","post_message":"We're pretty sure that's not going to work..."},{"comment_id":"10153247625591179","commenter_b":"vi sim. mas fiquei sabendo que legal mesmo é um creeper de pelúcia.","commenter_a":"Fernanda","post_message":"Same."}]
