[{"comment_id":"1293729747316737","commenter_b":"God she's a rotten pos","commenter_a":"Oh stop the whining! Grow up. The people have spoken so move on!!","post_message":"Chelsea Handler and Sen. Barbara Boxer didn't hesitate to shed tears at the \"sexism\" of Trump's victory."},{"comment_id":"1297208260357707","commenter_b":"How can she do that from behind bars","commenter_a":"Only three more days of this fake bullshit, then Hillary will shut your lying asses up.","post_message":"The Associated Press may be the most venerable wire service in the world. However, they're now under massive fire after the sickening offer they made to the Clinton camp was just discovered...  The press is willing to do anything to stop Donald J. Trump, and this is yet more proof."},{"comment_id":"10155036585354108","commenter_b":"The first lady also has shown everybody her breast","commenter_a":"again","post_message":"LIVE | BREAKING: President Donald Trump will soon speak to supporters at a rally in Melbourne, Florida."},{"comment_id":"10154731295753145","commenter_b":"A lot of merchandise with the \"Trump\" name on it is lagging in sales. When the sales of anything is down, stores WILL drop them.","commenter_a":"Geez ppl grow the F up and quit crying, he is our president and what the USA needs the most is for all Americans to come together.....united as one!!! This country needs help our own people are starving let's feed them first.","post_message":"Just last week Nordstrom stopped selling Ivanka Trump fashion brand."},{"comment_id":"1001040969952432","commenter_b":"Hillary says she landed under sniper fire and had to put her head down and run for cover? Hillary says she and slick Willie were broke when they left the white house? INTELLIGENT PEOPLE DO NOT SUPPORT A proven documented habitual liar for the highest office in the country TRUTH MATTERS","commenter_a":"Hillary 2016! Got my vote!","post_message":"\"I want you to remember: when you vote, when anyone votes, your vote matters as much as anybody else’s. Now, we may be up against super PACs and billionaires, but when the election comes around, Donald Trump and the Koch brothers with all their money, they only get one vote each. One person, one vote. That’s what we believe.  No one should be able to take that vote away. That’s why we cannot turn away and close our eyes from all of the attacks on voting rights that are happening right now. They don’t just threaten the integrity of our elections, although they do. They threaten what it means to be a citizen—indeed, what it means to be an American.\" —Hillary yesterday in Birmingham, Alabama"},{"comment_id":"493850430805537","commenter_b":"Shut Her Down !","commenter_a":"They spend money that is not theirs and should be made to pay it back.","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"10154831309643984","commenter_b":"She is SCUM","commenter_a":"She is pure unadulterated bullsh**.","post_message":"Of Hillary's hundreds of scandals, this is by far the worst. And most people have no idea she was even involved, let alone behind it.  This makes her scandals (and the ones she's made up about Donald J. Trump, look like nothing."}]
