[{"comment_id":"10154039785538010","commenter_b":"Johnny Vega They saw an opportunity created by Democrats in the first place....who let all the illegals in? Democrats...why? So they could sick their KKK members on the Republicans and stage stabbings in Anaheim one day before David Duke ran his fat mouth. You don't know a setup when you see one?","commenter_a":"Interesting not once in the article do they mention the Political Party of the KKK. Democrat on Democrat violence...oh when will it end?!?","post_message":"In light of today's violent KKK rally in Anaheim."},{"comment_id":"1241741129230844","commenter_b":"Donald Trump made racist white folks take they mask off, if you support Trump you are lowKey crazy and Racist, Trump's rich ass don't give a fck bout the poor, #BlackLivesMatter #Mexicans , he dont give a fck bout people from the bottom, the ones stuck in the hood, he only gives a fck bout the rich white and wealthy, ,...he started a Race war, he just motivated and inspired the KKK even more, kkk supports him to the fullest, he's gonna make this country more heated and more and more hatred between white people and the rest of the Race's , ...fck hillary too, but trust me Donald Trump is not a good option, he wanna make America white again","commenter_a":"Be a good time to start deporting.....thats how you catch illigals hold a Trump rally just bring in the busses and load them up....lmao","post_message":"Protesters remove their clothes at a Trump rally just before they flood the streets and destroy property."},{"comment_id":"1112791138738235","commenter_b":"1 stupid bitch","commenter_a":"Unfortunately she is right more often than not.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1258337087519652","commenter_b":"Found the domestic enemy of our Constitution. As a soldier, I vowed to defend against you.","commenter_a":"Time to disband the Supreme Court. Time to hold all these people who violate our Constitutional rights accountable.","post_message":"The U.S. Supreme Court Monday handed a legal victory to advocates of banning firearms commonly known as assault weapons."},{"comment_id":"10157646411850093","commenter_b":"But a woman who puts dow","commenter_a":"Who wants to manage him? It is just human nature to defend yourself when someone tells lies about you. There is no proof that he called this lady Miss a Piggy and Miss Housekeeping. The video showed him defending her and complimenting her. I don't believe her story. She just wanted her 15 minutes of fame and the Clinton campaign probably paid her. I want a President who stands up for himself when attacked. I certainly defend myself when someone lies about me!! We need a strong leader!!!","post_message":"Leading conservatives are engaging in wishful thinking."},{"comment_id":"10153522197479255","commenter_b":"Fuck you, lady.","commenter_a":"This people have been drinking the Kool-Aid!!!","post_message":"Obama is officially the best president the U.S. has had in a long, looong time.  By Daily Kos user PCalith"},{"comment_id":"988569754496111","commenter_b":"Wow, get jobs? because we kill all the whales every year","commenter_a":"I have no respect for the tribe. Why don't they get jobs and stop killing all the whales.","post_message":"The public weighed in tonight on whether the Makah Tribe should be allowed to hunt gray whales again >> @webpagelink"}]
