[{"comment_id":"10153997171416486","commenter_b":"Fools don't you see that your woman are raped by Muslim refugees.Germany is now blocked Christian immigrants in their country.","commenter_a":"Some of the biggest idiots .You people are.","post_message":"\"...we think that this is our time as Catholics to be the Good Samaritan, regardless of what is expected of us from countries overseas.\""},{"comment_id":"10152875626591051","commenter_b":"Yep.. she should have her vehicle towed for parking in the handicap spot. That will give her an attitude adjustment real quick!","commenter_a":"The American Disability Act will allow the police to fine this nasty man. I'd call the police. Let them handle him.","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"10153023573702452","commenter_b":"The bizarre part : Women buy purses but don't want to carry them ?? Who leaves their purse???","commenter_a":"Por pendeja!","post_message":"BIZARRE VIDEO: A thief was caught on surveillance video stealing a purse inside a Philadelphia restaurant - and then dancing away. @webpagelink"},{"comment_id":"10152998486166680","commenter_b":"BRAVO TO TRUMP!!!! We LOVE your IMMIGRATION POLICY!!! But, you \"must\" repeal the 1965 Immigration Policy to make sure things go back to normal!! Those who use the \"RACE CARD\" and cll names are really part of the problem!! Place them on \"BLOCK\"!! Of course they will rant and scream racism, because that is the very tool and threat they use that they are so used to getting their own way with! THEY are also destroying this Country! What is unconstitutional is what is being done NOW! Deporting ILLEGALS is the LAW!!! The LEFT are out in droves to slander, to name call, to label, to smear, to relentlessly attack all supporters of Trump and anyone else who is trying to save this Country!","commenter_a":"2016 TRUMP FOR PRESIDENT 2016","post_message":"Donald J. Trump's three-principle plan: “1. A nation without borders is not a nation. There must be a wall across the southern border. 2. A nation without laws is not a nation. Laws passed in accordance with our Constitutional system of government must be enforced. 3. A nation that does not serve its own citizens is not a nation. Any immigration plan must improve jobs, wages and security for all Americans.”"},{"comment_id":"10154298930434497","commenter_b":"Also, I don't appreciate you insulting my intelligence without provocation and based on assumption. You should work on how to prevent yourself from treating people like shit who don't deserve it.","commenter_a":"I know this is satire, but they broke my suspension of disbelief, with the suggestion that a television company actually covered Bernie's campaign...","post_message":"Via Onion Politics:"},{"comment_id":"10154371662414117","commenter_b":"This will make it easier to build a wall. Then Mexico can invade and get back it's land.","commenter_a":"God I hate my damn State.","post_message":"The people who are pointing to CalExit as a possibility have little grasp of either the demographics of the state, nor its actual finances. It is oblivious to the fact that the non-coastal parts of California are similar to the non-coastal parts of the rest of the United States. It is oblivious to the reality that the state's financial crisis is due to overspending within California and not because they're sending money to D.C."},{"comment_id":"10153631022078812","commenter_b":"When my sister and I owned a dual outboard, she had the ridiculous idea to do this exact same thing. We were fully grown women. I told her in no uncertain terms that she would do that one alone. The water between FL and the Bahamas is full of unsavory people, weather, and sea life.","commenter_a":"The ocean is cruel. Regardless of how prepared you are for anything, the ocean is unpredictable as well as man. Anything could have occurred. Rouge wave, pirates, drug runners, etc. Either way it must be Hell on that family right now as you start to wonder \"what if\"? From one parent to another that has lost a Son God Bless and I hope this story has a happy ending but it doesn't look good. Nature, sadly, normally wins in the end.","post_message":"UPDATE: The missing teens' boat was found capsized off the Florida coast. @webpagelink"}]
