[{"comment_id":"10153753811221051","commenter_b":"So tell me, how does a colored woman have a bronzed beachy glow? They want whites only.","commenter_a":"Oh lame. So now every ad for everything (make-up, sports, clubs, restaurants...) has to have a picture of male and female, old and young, straight and gay and transgendered, and ever single culture/race, etc. on EVERY single ad so as not to exclude? STOP IT.","post_message":"It only took a few hours for this photo to spark outrage. Take a look and decide for yourself if it's worthy of the controversy."},{"comment_id":"1720336911319665","commenter_b":"'@username ....but she can't stay out of the politics, can she?","commenter_a":"Fake awards made fake news today with the known results by the presenter Warren Beatty, admitting 'I KNEW WHO WON (in this super secret ballot), SO I WAS PUZZELED WHY IT WASN'T LA LA LAND'. Just like Hillarys victory, she won until reality stepped up and slapped her in the face.","post_message":"La La Land producer Jordan Horowitz has been praised for his handling of the epic #Oscars fail."},{"comment_id":"522395871281301","commenter_b":"'@username then tear it down and build bridges smh","commenter_a":"The wall was already built before he ever thought about becoming pope. Trump is a moron and needs to have people tell him how it is.","post_message":"'@webpagelink"},{"comment_id":"1037623106257736","commenter_b":"Many foreigners are required to take English in school unlike Americans.","commenter_a":"if you want to go to murica you have to speak engrish","post_message":"A study found that 77% of immigrants have high school diplomas and over 40% graduated from college."},{"comment_id":"1004046419654835","commenter_b":"This woman is a disgusting human.","commenter_a":"She has A 'TWATTER' account.......","post_message":"Another Coulter Twitter rant brings out the right-wing idiots."},{"comment_id":"10153288204601130","commenter_b":"'@username And don't even get me started on that bullshit that women think they 'feel free' because they can hide their faces and bodies behind that stupid piece of cloth. That's not freedom dummies, that's another way of mind fucking, you can also feel free of not needed to know how you look if you spend 40 years in jail in a separate cell where no one will even know you exist.","commenter_a":"He's not holy, no one has ever been a holy person , enough your closed mind religious bullshit.","post_message":"No one rocks a baseball cap quite like the Holy Father."},{"comment_id":"1857903094453796","commenter_b":"'@username AND U DON'T YOURSELF.","commenter_a":"Please leave MLK's son alone. Focus black people, stop criticizing on something or someone you know nothing about or the reason behind it. You do you. Keep out of everyone else's business! We're black/African Americans but we're individuals.","post_message":"He went off on the Civil Rights icon's son."}]
