[{"comment_id":"10152556429696680","commenter_b":"I think it has been established that there would be a guest worker allocation. I am more concerned with the 40% of Illegals that are OVER stayed Visa workers! They come here on Visitor,Student and Work Visa's and don't leave when their term limit is up!! They are taking jobs from all levels of American workers!!","commenter_a":"In the meantime how about passing E-Verify and prison and fines to those employers that hire illegals??","post_message":"The House might have to delay consideration of its border security bill until the middle of February. @webpagelink"},{"comment_id":"1761144924140317","commenter_b":"If Mexico wont pay for wall, lets put our own electric fence 2 miles from the border then put our violent offender prisoners behind it ! In tents. With no back wall.","commenter_a":"Please vote for trump!!!!!!!!!!!!!","post_message":"Truth."},{"comment_id":"10155694737870294","commenter_b":"Why not?! Criminals can do it like gun-free zones didn't exist!","commenter_a":"Doesn't matter they'll do it anyway.","post_message":"Even if it passes, each university would still be able to decide if they wanted to allow guns on their campus."},{"comment_id":"10153573613391037","commenter_b":"An interesting job for our President on how to get these kids off the street at night and up in the morning to go to school.","commenter_a":"If it's done the right way!!!!","post_message":"The president says helping America's minority youth and making sure young people have the opportunity to succeed is \"an economic imperative.\" Liz Goodwin details the push behind the My Brother's Keeper initiative."},{"comment_id":"10156866881005231","commenter_b":"Porsha Williams (Dish Nation)should be next.loud mouth and Crazy.Don't take the Club to you Job. Stop Emphacizeing and Profileing your rear end Porsha.Professsionalism evidently is not in your vocabulary. You are not the only woman with a big butt.Its most likely paid for anyway.","commenter_a":"All that smacking her mouth waveing her hand poping her fingers and all that darn yelling in the mic.Enough!Don't take the Club to your JOB.","post_message":"Did the leader of the 'Tamartian army' get the boot?"},{"comment_id":"10154277505591509","commenter_b":"At the end of the day, Banning Muslims from this country isn't going to fix the problem. They will find another way to hurt us. It's an ongoing threat that's not going to stop unless you eliminate the threat.","commenter_a":"I've never seen so much racism in my life, say it ain't so, but the comments and the reactions are very disturbing.","post_message":"\"The fact is what Donald J. Trump said yesterday disqualifies him from serving as president,\" The White House Press Secretary Josh Earnest said Tuesday. @webpagelink"},{"comment_id":"543745795816000","commenter_b":"We need to start carrying bacon with us and when they disrespect an American Bitch slap them with the bacon.","commenter_a":"Yes,yes! Or send their butts back! We don't want them here!","post_message":"This Fox News reporter was absolutely disrespected by these Muslims. They are out of control. If Muslims are going to live in our country they need to learn some manners. Do you agree Muslims have to assimilate or get out?"}]
