[{"comment_id":"10153328235374087","commenter_b":"Common ground to Ryan means all his way.","commenter_a":"Ass hole. One of the boys","post_message":"“You know, we have two ears and one mouth,” Paul Ryan said. “We got to use those in that proportion.”"},{"comment_id":"1338680576172411","commenter_b":"Omg pathetic!","commenter_a":"@username, a good laugh.","post_message":"This is hilarious and sad."},{"comment_id":"10152875626591051","commenter_b":"Yep.. she should have her vehicle towed for parking in the handicap spot. That will give her an attitude adjustment real quick!","commenter_a":"The American Disability Act will allow the police to fine this nasty man. I'd call the police. Let them handle him.","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"389420827906465","commenter_b":"Tony, Many of today's pillars of righteous GOPer's come from illegal entry to the U.S. We often forget the illegal passage of our Italian, Irish, English, ancestors. You know the \"mention pot\". Key word that you are ignoring is RACISM. Hope that's not you, but it sounds like it might be. Have a good day !!!","commenter_a":"In a Nation of immigrants,mi would expect nothing less. The reactionary GOP is just plain backwards and have forgotten our heritage.","post_message":"President Obama has their back."},{"comment_id":"418399244951783","commenter_b":"People Conroling People , Money Conroling people , Paper controlling people , hu? Paper seems to be more in control here , get ready for a tree farm congress , congress: wants more trees , People: why, Congress: environmentally safe ecosystem, People: yeh, Congress: Money money money","commenter_a":"Seems legit.","post_message":"Lobbyists and politicians getting together, and yet it's the people who get screwed."},{"comment_id":"1229145840456983","commenter_b":"Clinton can't tell the truth! Can't remember her lies ! Gives her daughter 1,000,000$ a year of stolen money gained from corruption even year making Chelsea an accomplice ! As well as an accomplice to her email crimes! Arrest them all 2017!!!! Obama and Clintons open boarder policy and the invasion led by both to destroy America while millions come their way ! A record number of illegal aliens penetrate our wide open borders and manipulate a dysfunctional visa system, the boys now urinate in the girls bathroom if they identify as a female, the growth of Islam in America is unstoppable, the debt is so high the number appears fake, the shrinking of the military is sickening, veterans are killing themselves at alarming rates, the war on cops is an epidemic, we back to segregating college campuses, Obamacare is worse than what we had before it was a law, ...","commenter_a":"Hello she bed IP with people ehp kills hays","post_message":"She is the LAST person in the world who should be lecturing anybody about respecting anybody's rights, with her own HORRIFYING connections..."},{"comment_id":"10153641231211337","commenter_b":"More like a Cabbage Patch doll had sex with that weird chick who snorts Ajax in Up in Smoke.","commenter_a":"Amy Schumer looks like Reece Witherspoon had a baby with the Pillsbury Dough Boy","post_message":"PERFECT: Amy Schumer was ready when someone compared her to the American Gothic lady..."}]
