[{"comment_id":"10154005509605575","commenter_b":"Go back to Canada you slimy rat","commenter_a":"THIS IS THE MAN THAT HELPED DEVELOPE NAFTA FOR THE BUSH'S IN ORDER THAT WE WILL HAVE OPEN BORDERS","post_message":"Trump blasts Natural born Canadian Ted Cruz..."},{"comment_id":"10153646612799071","commenter_b":"Thank you my sweet. Lucky dog!","commenter_a":"@username here is the video I was talking about 🐶","post_message":"Rumbo Mediterráneo quit his job to kayak the sea with his dog."},{"comment_id":"880245452022083","commenter_b":"@username // Lets jail women for miscarriage oh wait we already are -_-// Who's advocating to throw woman in jail for miscarriages. Again how many time's have been through this? Hiring, a contract killer to end the life of ANOTHER HUMAN BEING is NOT a miscarriage. Miscarriage's happen naturally, not by FORCED.","commenter_a":"People who cannot distinguish a fetus from an infant have no right legislating against abortion","post_message":"Tell Congress to protect ALL babies.  Click here to urge your Congressman and Senators to cosponsor the Life at Conception Act! @webpagelink"},{"comment_id":"750651481734699","commenter_b":"Sounds to me like the other parrents in the school system should demand the girls immediate expulsion for the good of their own children.","commenter_a":"Fuck that cop if that was my daughter he'd be a dead mother fucker","post_message":"This could be BIG. Does this change your opinion on the whole incident?"},{"comment_id":"10155927830195354","commenter_b":"Donald Trump is going to be the next President...you can take that to the bank...","commenter_a":"Why don't they read these polls, it's too obvious to conservatives like me. Do I trust Trump, not totally, but I do more than most of the GOP minus Ted and Rand. Let's get this country back conservatives, go Trump","post_message":"When over half your voters don't feel like you're looking out for them..."},{"comment_id":"10153917559886770","commenter_b":"Nah, her girl fans drink boiler-makers.","commenter_a":"Amy Schumer fans do not drink beer. They drink fruity drinks with umbrellas in them. And her female fans drink those, too.","post_message":"This doesn't sound good...."},{"comment_id":"1760155984214134","commenter_b":"she makes money that way she is a media whore","commenter_a":"She is worse then a racist, bigot she hates whites and everything whites stand for. It the view comes on a channel any place I am at I change the channel I will not watch a racist show that she is on","post_message":"Whoopi Goldberg Insults TV Host For Being White, See What Happens Next. She is the biggest hypocrite. What a bigot. Do you think Whoopi is a racist?"}]
