[{"comment_id":"10153033026636336","commenter_b":"She should have let him back on","commenter_a":"Somebody better contact Social Services about that bus driver! He let a child walk 1/2 mile alone!","post_message":"An Indianapolis mother is outraged after her 6-year-old son was forced to walk home a half-mile through knee-deep snow after a bus driver dropped him off at the wrong stop and wouldn't let him back on."},{"comment_id":"542505495955041","commenter_b":"@username you're a racist bitch. I hope you rot in hell.","commenter_a":"He was mentally ill he suffered from PTSD . Isn't that what they say when the white boys do it?","post_message":"Dallas Shooting Suspect Identified as 25-Year-Old Army Veteran Micah Xavier Johnson"},{"comment_id":"10154099227939877","commenter_b":"She's stupid... Dont waste your time.","commenter_a":"If you can't cut your vacation short to do your job as president of the united states you aren't fit for the job.","post_message":"Today President Obama visited the flood-ravaged state of Louisiana, despite critics like Donald Trump who say he came too late. Grio Fam, check out what the President promised he would do to help Louisiana going forward. What do you think his trip accomplished? Sound off!"},{"comment_id":"928293913874616","commenter_b":"Brain dead liberals.Why would you want to force someone to marry you?","commenter_a":"What makes anyone think that someone would want the clergy in your faith to perform their ceremony if they did not believe in it. Two people in love that want to get married would never choose someone to marry them that was not accepting of them. There are many other clergy accepting out there. Not all WANT religious rites. Civil ceremonies performed are the legal ones that count. Not one person (straight or gay) can get married in the church without that civil license first. People are getting totally out of hand on this. The church is going to do what they want anyway. What really counts is marriage is legal for all.","post_message":"Wow."},{"comment_id":"10153707515144778","commenter_b":"Laura, by all means move to Georgia and so you can all the naked men you want.","commenter_a":"A Georgia police officer shot and killed a naked, unarmed man at an apartment complex Monday and this is local news because?","post_message":"A Georgia police officer shot and killed a naked, unarmed man at an apartment complex Monday. What exactly happened is now being debated."},{"comment_id":"10154450699361323","commenter_b":"Umm... because she's a woman!","commenter_a":".On what grounds does such a person NOT rather enter in the MALE-items?....","post_message":"\"It is unquestionably a sensitive and complicated issue and one that has arisen many times at the Olympics and other sporting competitions where it has been alleged that male athletes have attempted to compete as women or, in Caster Semenya’s case, that a woman has an intersex condition, which provides an alleged unfair advantage.\""},{"comment_id":"902972626429153","commenter_b":"This has nothing to do with muslims.Shut up!","commenter_a":"give muslims a planet and they'd still not be satisfied","post_message":"The barbarism continues"}]
