[{"comment_id":"10153961468913132","commenter_b":"'@username she better step away from my man","commenter_a":"'@username @username @username I'm sure you've already heard, but it's foreal.","post_message":"So it IS true! Happy for Gwen Stefani and Blake Shelton. <3"},{"comment_id":"593592797513564","commenter_b":"Absolutely. Bitches get treated!","commenter_a":"'@username 😂","post_message":"Watch out"},{"comment_id":"10154379213963812","commenter_b":"Go back to Europe. Lol","commenter_a":"Go TRUMP build the wal!! Deport illegal all of em Ban muslims Lets make america great again! !!","post_message":"Donald J. Trump announced on Good Morning America that he 'probably will take small contributions.'"},{"comment_id":"1234855006552733","commenter_b":"trump = sexual predator. You really feel ok getting behind this rapey racist creep? Wake up you ignorant fool!","commenter_a":"If you are a woman who is offended by what Donald Trump said a decade ago but you enjoyed 'Fifty Shades of Grey' and other movies and books like this than you are a hypocrite! Do you laugh when comedians talk like this or do you stand up and leave the room!?! I was not offended, I could care less what he said BS's with men in private - give me a break! I care about what he says and does now - I care about what he will do for our country! Look what Hillary did that mainstream media is covering up - her speeched released show she also refers to people as bucket of losers....has two different policies, one for public,one for private...not to mention the entire email scandal with her 'innocent' friends all getting immunity...why do innocent people needimmunity?","post_message":"After audio was released of Donald J. Trump saying highly controversial things about women, Christian Coalition founder Ralph Reed shocked the media with a huge announcement on the Republican nominee.  Nobody saw this one coming... what do you think about what Reed said?"},{"comment_id":"812160358905862","commenter_b":"Please make sure you are registered REPUBLICAN to vote for TRUMP. He's our only hope. Corrupt Washington DC will continue as usual with the rest who are beholden to big donors/super pacs. This corruption has been going on for 35 plus years. Vote TRUMP to take back our country. If Trump don't win our children and grandchildren will have a miserable life with Muslims and illegals taking over our country and to top it off we have no jobs.","commenter_a":"Question: If #BillClinton is campaigning for #HillaryClinton, does this mean he can charge any fee he sees fit? In other words, no matter the outcome, the #Clintons are making bank! Also, is this true? HIGH Treason Traitor Hillary Rodham Clinton UNITED States of America - As Wanta-Reagan-Mitterrand Protocols implementation remains imminent with an April 1st U.S. Supreme Court ordered deadline, it can now be reported that former U.S. Secretary of State Hillary Rodham Clinton has been placed under house arrest by the U.S. military on charges of financial treason. On week ago Friday, the same day Jack Lew was sworn in as U.S. Treasury Secretary, sociopath Hillary attempted to illegally divert $1.7 TRILLION of U.S. Treasury funds to a secret CIA proprietary account in the People Republic of China. Both Chelsea Clinton (Hillary daughter) and former Citibank CEO and Clinton era Treasury Secretary Robert Rubin have power of attorney over ...","post_message":"Good morning America! Thank you for your support in the latest national Reuters poll. TOGETHER, we will #MakeAmericaGreatAgain!"},{"comment_id":"688195661362262","commenter_b":"You are awesome president Obama! !!! Thank you for all you've done","commenter_a":"This guy is a crook 2","post_message":"LIVE - President Obama on the Election Night win of President-elect Donald Trump."},{"comment_id":"2196085043950203","commenter_b":"When is she moving. Shut her up","commenter_a":"She needs ducktape","post_message":"The Left in America is unhinged: why is this woman on TV?"}]
