[{"comment_id":"10153302488640329","commenter_b":"You obviously don't know what feminists sound like then.","commenter_a":"\"How dare you show women's breasts you pervert\" - Feminists \"How dare you censor women's breasts you oppressor\" - Feminists.","post_message":"Warning: NSFW due to lots of nipples. (via BuzzFeed News)"},{"comment_id":"10153007851971051","commenter_b":"Sick ass bitch!wtf","commenter_a":"Why don't sickos like this get life in prison or death? Rapists and molesters are released to hurt more people? The system is messed up!!!!!","post_message":"This babysitter repeatedly sexually assaulted a little girl. Last week, justice was finally served."},{"comment_id":"10153604770703984","commenter_b":"I know that Obama was slow to react. The main reason is the fallen were White and Hispanic soldiers killed by a Islamic terrorist. He has zero respect for our military and would be very happy if all military members that don't support his new direction for this country would resign. We have a President that wants to convert America into a third world country that will allow him to remain its Dictator. Everyone needs to remember the USSR and how it broke up into many small countries that are loaded with the rich leadership and the overtaxed people who just want to live in peace. Russia's streets are ruled by gangs and the mafia. WAKE UP AMERICA!!!","commenter_a":"Obama is some commander in chief NOT!! He should be ashamed! What happened to freedom of speech?","post_message":"What just happened in a crowd of veterans during an Obama speech says a lot about his presidency. The bold veteran who stood up even after he was dragged down is attracting a lot of attention. Do you support what this veteran did?"},{"comment_id":"880520761983346","commenter_b":"Perfect pic of her with her mouth wide open.","commenter_a":"She is scum.","post_message":"Tom Selleck is awesome!"},{"comment_id":"1096205787130648","commenter_b":"this bitch looks horrible","commenter_a":"He sure doesn't call the Super predators you pos","post_message":"...says the woman who trashed tens of millions of working class Americans."},{"comment_id":"1863241907237719","commenter_b":"You better not get one or I'm on your ass like a black cock!!","commenter_a":"Lamar Dent Damon Hardison","post_message":"Roast sessions all day! #WSHH"},{"comment_id":"10157009352015557","commenter_b":"Did you not read the article? Duh","commenter_a":"They need to arrest the parents of these minors who gift him their child","post_message":"A Bucks County man is facing multiple sex charges after police say a dozen girls were found in his home, including one girl who was \"gifted\" to the man by her parents."}]
