[{"comment_id":"1001898416489082","commenter_b":"Puke and barf!","commenter_a":"Muslim views and laws have no place in America. We have our own laws we don't need islamic sharia laws here,say no to anything muslim.","post_message":"\"Forget the so-called \"Jewish controlled media.\" In the West today wealthy Saudi royals pull all media strings.\""},{"comment_id":"557077507818161","commenter_b":"Take her ass down","commenter_a":"We owe Nixon an apology. Watergate was nothing compared to this.","post_message":"BREAKING..."},{"comment_id":"10153442091264877","commenter_b":"That's right, Westley :) * waits for the obligatory hoteper insult about evil black feminists*","commenter_a":"This song is not about Black women. At best, the song attempts to denounce negative stereotypes of Black men. I appreciate the effort, but he has a lot more work to do.","post_message":"David Banner Shows Support for Black Women in New Song 'Marry Me.' It's the rapper like you've never heard him before. Listen to the audio below. Grio fam, what do you think of Banner's tribute? Sound off!"},{"comment_id":"10154963214296178","commenter_b":"Did that woman just get out of bed ?","commenter_a":"How is he behaving like an authoritarian? By having the EPA enforce regulations that Congress wouldn't pass? By giving amnesty to people who are here illegally, with his pen and phone? By allowing an underling to leave men for dead in Benghazi because it was politically expedient?","post_message":"According to Brian Stelter, Donald Trump is acting like the leader of an \"authoritarian regime.\" His solution? Have the media act MORE biased."},{"comment_id":"853999368022756","commenter_b":"He's a busy man filing all his bankruptcies!!! Lol","commenter_a":"His excuse for failed marriages is hes a busy man. Whats his excuse for all his bankruptcies.","post_message":"Trump admitted that his marriages aren't traditional but claimed that it's different for him because he a \"hardworking person.\""},{"comment_id":"768354383300233","commenter_b":"@username Go ahead and Kick the Tea Partiers and Trumpetiers out of the GOP, MARY JANE FAGALA! WHAT YOU WILL HAVE LEFT SHOULD BE ENOUGH TO HOLD A STRATEGY SESSION ON HOW TO REACH OUT TO DISAFFECTED DEMOCRATS, SOCIALISTS, COMMUNISTS AND LOTS OF OTHER \"ISTS,\" BUT YOU WILL HAVE LOST ALL THE POWER THAT THE TEA PARTY DELIVERED TO YOU. LOTS OF LUCK!!","commenter_a":"If the GOP think the people are ANGRY NOW,,,,just wait until they try a brokered convention!! It will be mayhem. The LAST NAIL in the coffin of the Republican Party!! You can take THAT TO THE BANK.","post_message":"A brokered convention seems to be all the talk in the Republican party right now, but there's a real split in who's supportive of the idea... Do you think Ted Cruz is right about this?"},{"comment_id":"10154574159493445","commenter_b":"The only wall is much needed to keep illegals out that are a drain on society. Mexico doesn't want them back and they send millions if not billions to pump up Mexico's economy and drain our economy. Many of these immigrants are from further south than Mexico. Mexico wants to keep them out of their country as well that's why they put a large wall on their southern border. Why are they allowed to do that yet we are not??? I've had several friends killed my illegals because they can't drive. I also have a very good friend that can't walk, can hardly talk and will never work again all because a car load of illegals didn't know what double yellow lines on the highway stood for. They passed around car load of illegals at the top of the hill and hit him head on at 60 mph. 3 of ...","commenter_a":"Texas.","post_message":"Creative smugglers will always come up with ways to get drugs over the border - and many doubt the effectiveness of a wall to curb the flow."}]
