[{"comment_id":"1395648327124620","commenter_b":"You're pretty much a stupid whore. I feel bad for your kids","commenter_a":"WAHT DONT U GET?????????????????SHE IS ILLEGAL.......Rayos has been required to check in with ICE every year since 2008, when she was caught working under a fake Social Security number...................NO ONE EVEN KNEW SHE WAS HERE UNTIL 2008....WAKE UP STUPID AMERICANS","post_message":"The 36-year-old mother of two is among the first undocumented immigrants to be deported under Trump strict new policies."},{"comment_id":"10153330910164497","commenter_b":"Hillary is a sex addict; shes always screwing herself.","commenter_a":"Idk if she'd be a good president though; last time she had a job, she outsourced it to Monica.","post_message":"This Week's Top Story:"},{"comment_id":"970318416341964","commenter_b":"Airbrushed and retouched photos set unrealistic goals for women, and set us up to believe that we are JUST NOT GOOD ENOUGH. Since we can't ever achieve \"the look\" that we see in ads, we are consistently striving it, and so continue to buy more cosmetics than we need. Pictures and articles like this are absolutely necessary if women are to ever claim their power as more than objects.","commenter_a":"News Flash! Most of us know what people look like in real life. This story is useless.","post_message":"These pictures are everything cosmetic companies DON'T want you to know."},{"comment_id":"10153256342071336","commenter_b":"Thank you.","commenter_a":"Good! He deserves it!","post_message":"Breaking News: Jury sentences convicted Boston Marathon bomber Dzhokhar Tsarnaev to death."},{"comment_id":"1104255989636871","commenter_b":"#westoppedtrump #fucktrump","commenter_a":"You saved countless lives last night on the streets of Chicago, they stopped the gang banging for a few hours to come together in your honor...you've already made America great again.","post_message":"Good morning! Departing for Dayton, Ohio now! WE ARE GOING TO MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153562599204087","commenter_b":"#DumpTrump","commenter_a":"cruz your a fool the media has been trying to destroy trump and help you. cruz you are stupid","post_message":"“Every accusation you raised is incorrect,” Ted Cruz told Fox News host Chris Wallace when asked about his campaign’s role in spreading falsehoods about rival Ben Carson in Iowa. “I appreciate you reading the Donald Trump attack file on that.”"},{"comment_id":"10152592127946717","commenter_b":"I wonder why she hasn't refused service to other heathens? You know, non-Christians, like Muslims or women who cut their hair...wait...that bitch cuts her hair! Where's my stone!","commenter_a":"So let's get this right. She's in the business of making money but she didn't want to accept money and now she's willing to spend money in order to avoid making money. She is logically 'out of business'.","post_message":""}]
