[{"comment_id":"530424503814796","commenter_b":"I'd be out of a job!","commenter_a":"what is illegal is letting ASS HOLE groups like the GAY patriot put their STUIPD SHIT on facebook they should be put in jail for life","post_message":"A popular company is forcing their employees to wear head scarfs.  This has to be illegal.  Would you quit if they tried to force you to wear a headscarf?"},{"comment_id":"10154364197411336","commenter_b":"Lady you are unbelievable","commenter_a":"Chris Kyle: American Liar","post_message":"A federal appeals court has thrown out a $1.8 million judgment awarded to Jesse Ventura, who says he was defamed in Navy SEAL Chris Kyle's book 'American Sniper.'"},{"comment_id":"10153250211681336","commenter_b":"Seems like a lot of immigrants spouting out of their pie holes when no one knows what happened yet.","commenter_a":"AM I THE ONLY ONE WHO THINKS ALL THESE DERAILMENTS IN THE LAST FEW YEARS ARE BY TERRORISTS????","post_message":"“It is an absolute disastrous mess. Never seen anything like this in my life.”  Philadelphia Mayor Michael Nutter confirms at least five people are dead and 53 have been transported to hospitals with six in critical condition after Amtrak train 188 traveling from Washington, D.C. to New York derailed Tuesday night. @webpagelink"},{"comment_id":"10153400883926813","commenter_b":"'@username SHE is a girl.","commenter_a":"I love this brave kid.","post_message":"Great victory today! Court rules in favor of our client, transgender student Gavin Grimm, in his challenge to Gloucester High School’s discriminatory restroom policies!  Watch Gavin's video where he stands up for students everywhere."},{"comment_id":"915008615188661","commenter_b":"The other race of women say the same things, they just not on here.","commenter_a":"Good for him, this happens to men all the time. The women on here that are outraged are the type of women that men should stay away from. Nothing worse than a hypocrite. I can't help but notice that the women that are upset are mostly black. Very telling","post_message":"Tasha Smith forced to pay ex-husband $7K a month, in addition to the $50K she gave him last year @webpagelink"},{"comment_id":"10152969085332623","commenter_b":"Lock up your wives.","commenter_a":"Filling out that trophy case.needs that one for the set!lol","post_message":"Tiger Woods has entered to play in next week's Wyndham Championship in Greensboro:"},{"comment_id":"10155588637195389","commenter_b":"Amen!!! Good post...","commenter_a":"Every police officers in this country should take their badges to the white house and give it to the biggest racist in the country.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
