[{"comment_id":"1172261136143561","commenter_b":"iPhone 7 will murder Note 7, with its 720p display and 2000 mAh battery. *Slow claps*","commenter_a":"Verge commenters won't like to admit verge is now defending samsuck. Looks like Samsung paid Verge, the iPhone 7 will murder this on benchmarks AS IT ALWAYS DOES","post_message":"Seriously, everybody chill."},{"comment_id":"10154407865186636","commenter_b":"Not by quite a wide margin however. How much Norbert get? 47% was it? It's already getting dangerous","commenter_a":"Austrians rejected the Far-Right, let's hope the French do the same, otherwise Europe will become a more dangerous place.","post_message":"Elections take place in April"},{"comment_id":"1027708620606666","commenter_b":"They have no sense of humor! They can not take any kind of criticism or satire! The most boring people on this planet!","commenter_a":"Because he exposes the truth of Muslim infiltrators! Roaches hate the light.","post_message":"Why is designated terrorist group CAIR condemning this FOX News report about Muslims as “racist and Islamophobic?” What ‘race’ is Islam?"},{"comment_id":"679630052167782","commenter_b":"She needs to be deported.","commenter_a":"i think you belong over there","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"10154367276527293","commenter_b":"@username, stay away from our country!!","commenter_a":"I don't think I have ever been so ashamed of this country. Deplorables, indeed. The morons clearly vastly outnumber the intelligent among us.","post_message":"The uncertainty over the outcome of one of the most contentious presidential elections in modern history rattled investors around the world."},{"comment_id":"860890883954153","commenter_b":"Goons On Parade!","commenter_a":"You weren't put there to be \"kinder, gentler\" When are you folks going to get the message!","post_message":"New Senate Majority Leader Mitch McConnell (R-Ky.) is indicating he’ll attempt to steer his party in a benign direction as his leadership style helps shape public perceptions of the GOP — and its presidential nominee’s chances — heading into the 2016 election cycle. @webpagelink"},{"comment_id":"1242328489179018","commenter_b":"Sick bitch. I hope she chokes to near death and has a fucking stroke. I don't hate people but this pos. needs to disappear for good.","commenter_a":"Wow, is everyone scared of killery ? Geeze really ? Oops, forgot about the Clinton Mafia and all the dead bodies in their wake. Maybe they have reason to be.","post_message":"After months of pressure, the mainstream media has finally begun asking questions about Hillary Clinton's health. Just as they do, however, Hillary and her people have made a SICK threat to all of them... and it could mean that the truth stays hidden from America."}]
