[{"comment_id":"1196791103694693","commenter_b":"David, better vote for anyone on the GOP side than voting for the criminal Hillary \"Cankles\" Clinton. The woman should be in prison.","commenter_a":"DO NOT be complacent. Progressives need to come out in the MILLIONS and vote. Otherwise, the Republicans/teaparty, who sold out to crazies who actually want to take a dump on the Constitution and make America a \"Christian\" Theocracy, will win.","post_message":"Republicans are losing ground in key demographics."},{"comment_id":"1788613674701059","commenter_b":"Shut up hoe","commenter_a":"It amazes me how rude some of you people can be . They're having a fucking child! Like come on now , stop being so immature talking about \" he's carrying the baby , \" or \" his girlfriend looks like a man\". Smh people 😒😑. Congratulations Dj Khaled & Nicole Turk ❤️","post_message":"Baby Alert! "},{"comment_id":"10154945545241002","commenter_b":"Let them fight \" Darwin \" will take over !","commenter_a":"Terrible!","post_message":" loved everyone, said Robert Ybarra daughter. \"He was one of those neighborhood dads that people could count on.\""},{"comment_id":"10153055610099877","commenter_b":"Do you see the sick people that are holding office? Beautiful child; disgusting/sick thought pattern to justify abuse.","commenter_a":"The mind can be a wicked thing!!!","post_message":"Republican lawmaker: Rape can be ‘beautiful’ if it produces a child.    Grio fam, do you think anti-abortion laws should make exceptions for victims of sexual assault?"},{"comment_id":"683878711749701","commenter_b":"By the way, good little robot response, Hudson. Care to elaborate?","commenter_a":"I've always admired Colin Powell. Mr. Powell said the Iran deal is a good deal. That's good enough for me.","post_message":"The nuclear deal with Iran risks the safety and security of America and our allies. It must be stopped. #NoNuclearIran"},{"comment_id":"1190463677676992","commenter_b":"Immigration laws are not being in forest because it only applies to legals and not illegals. It's time to make stronger laws and strongly in force them. Also illegals shouldn't be given drivers licenses or any form of ID until they become American citizens.","commenter_a":"The way I see it is this, if people come here and they are illegals SEND THEM BACK TO WHERE EVER IT WAS THAT THEY CAME FROM, the next step is build a wall that's high enough with barbwire around it so they can't try anything","post_message":"Do you agree?"},{"comment_id":"10153505158314877","commenter_b":"Racist POS!","commenter_a":"Stupid POS.","post_message":"Sam's Club CEO Blasted as 'Racist'...Because She Believes in Diversity. Watch how the backlash started below.  Grio fam, here's our message for Rosalind: Keep up the good work. What's your reaction?"}]
