[{"comment_id":"10152918950086336","commenter_b":"What a doll!","commenter_a":"What a cutie and smart too!","post_message":"An incredibly brave 4-year-old girl is being credited with saving her pregnant mother who suffered a seizure and couldn't reach the phone."},{"comment_id":"10154589059624087","commenter_b":"If you look real hard you may find your own identity or Soros'","commenter_a":"Questions: How many states do we have? What was actually written on that red, plastic button your mommy brought to Russia to reset our relationship? Did the crippled man Biden ask to stand up ever...stand up? What exactly is a CORPSEman? Hmmmmm....perhaps you should stfu?","post_message":"\"What happened in Sweden Friday night? Did they catch the Bowling Green Massacre perpetrators?” Chelsea Clinton tweeted."},{"comment_id":"10153309026372452","commenter_b":"Please move out of Communist California.","commenter_a":"Hunter 😒😒😒😒😒","post_message":"The more you drive the more you pay? California could soon charge you for every mile you drive. abc7.la/1JjBX9b The state is looking for volunteers to test a new \"mileage tax.\" It's designed to replace the gas tax, but could you end up paying more? And how would they track every driver in the state?"},{"comment_id":"10152871641536051","commenter_b":"My husband served 20 years for this country and then a bitch like u get the freedom. U need to get the hell out of here and there may be someone out there that will really get mad and look for u bitch.","commenter_a":"Then WHY IS SHE HERE??? OHHHHH!!!! Cause she makes her $$$$$ here. Proud Americans STOP SUPPORTING THIS LOSER!!!!","post_message":"This musician says she hates absolutely everything about America."},{"comment_id":"10154335392498812","commenter_b":"learn the law because you look like an idiot. TRANSGENDER people can use the bathroom, not men like you and I. I cant just say oh I want to go pee in the ladies room. that isn't how it works. I have a friend who is transgender and her license now says female. she looks like a female. should she go into the mens room? the law is for people like that, not just people who decide today to go in the opposite sex bathroom.","commenter_a":"I won't be listening to them anymore!!! Transgender people are not the only ones with rights,,,if you're a man who wants to use the ladies room get a sex change ....Liberalism is ruining our country,,,,what was a constitutional republic is turning into a socialist hell hole","post_message":"Pearl Jam cancels North Carolina concert, calling HB2 law \"a despicable piece of legislation that encourages discrimination.\" @webpagelink"},{"comment_id":"10153114063969091","commenter_b":"Why wouldn't they? Everyone is scared to stand up for something. Sodomites wont be around my kids cause they're not gonna be in the scouts.","commenter_a":"Just close the organization down no one is going to send There kids with the Boy Scout leader who is gay, it's another thing to gay people have screwed up","post_message":"BREAKING NEWS: Boy Scouts expected to announce that it will allow openly gay adult leaders."},{"comment_id":"865465356933659","commenter_b":"But you DIDN'T worry when YOU went after Trump. NOW you're worried? I guess the old Texas saying is true: Your alligator mouth over loaded your mocking bird butt. TUFF SHIT. DEAL WITH IT.","commenter_a":"Oh, please. She'd do just about anything to Mr Trump to denounce him. You need another job, or stop putting your own opinions on your show. Get a life. I used to like you, but I'm not a fan of yours anymore","post_message":"Megyn Kelly tells Mediaite she worries that “someone’s gonna hurt me in the presence of my children.”"}]
