[{"comment_id":"892479024147549","commenter_b":"The majority of people who act out racism, cry about racism, are the most racist...are black people....you want a safe space where whites won't be around...Liberia...Nigeria...Botswana...many places...but here's the thing...no welfare, no food stamps, no healthcare, no free housing(except in the jungle and you build it), no opportunity for education, ....not one of you would survive in any of these African countries.....because you've been spoon fed for to many generations! I've been to Africa many times, I've spoken to hundreds of Africans.....they will rot and die in poverty because of the black government that runs the countries....take a very close look at who's in charge of America now!!! Except in America the white tax payer affords you the life you don't even deserve.....and now he's giving your life...yes your life to illegals...he's done with you....make the best of it...because that stupid monkey president couldn't care less about you!!!!","commenter_a":"Hell No. There are no more minorities","post_message":"Huffington Post:  Deserve Safe Spaces Without White People  A couple of weeks ago, two students from Ryerson University Journalism program were barred from attending an event organized by the ' BECAUSE THEY WERE WHITE!  @webpagelink"},{"comment_id":"1096402407066897","commenter_b":"Girl, bye. If you indeed weren't trying to get over on our great state, you have nothing to worry about, right?? Hey, you may very well be a crook...","commenter_a":"He said.....she said. Truth is most likely somewhere in the middle. Pffffffft...","post_message":"It does kind of smell like revenge. What do you think?"},{"comment_id":"10154773205966037","commenter_b":"Hillary is the liar and murderer deserves to be in prison right now!","commenter_a":"SHUT UP TRUMP","post_message":"WATCH LIVE: Donald J. Trump holds a rally following last night's debate and says he will totally accept results \"if I win.\""},{"comment_id":"10153350973886051","commenter_b":"She lost !!","commenter_a":"that Aunt is a brain dead moron. She doesn't deserve to have any family members.","post_message":"This aunt is suing her 12-year-old nephew for $127,000 over a hug."},{"comment_id":"1056097081119075","commenter_b":"These lowlife Muslims are doing that in every country they are aloud into ! It's even going on here in America . It's how they take over a country without fireing a shot , they just out reproduce the natives and within a decade or two they will out number and be able to inpliment sharia laws ! We know Muslims have completely taken over one American city and are working on many more ! All these Muslims Obama has been bringing in are sent to certain cities for a reason ! Obama and Hillary are traitors and she will just pick up were Obama left off !","commenter_a":"Surprise, surprise.","post_message":"Muslim Pig Explains How He LIED To European Authorities To Bring In 4 WIVES  They are all about gaming the system and abusing our freedoms.   @webpagelink"},{"comment_id":"10153165727051770","commenter_b":"No to Muslim Migrants..call congress..made four calls today..totally agree..Europe is in chaos..rapes and violence..and the media does not talk about it","commenter_a":"Yes sir, exactly what we need. Thank you for caring for the true Americans.","post_message":"BREAKING: Donald J. Trump calls for a moratorium on allowing Muslims to enter the United States.  \"Until we are able to determine and understand this problem and the dangerous threat it poses, our country cannot be the victims of horrendous attacks by people that believe only in Jihad, and have no sense of reason or respect for human life.\""},{"comment_id":"1111506912205431","commenter_b":"The video basically implied that Donald Trump was a racist simply because he doesn't want illegal immigration in this country. There is an enormous amount of drug trafficking, Sex trafficking and a lot of bad people are coming through our borders. Yes their are a lot of great Latinos in this country and my husband is one of them but what basically everybody is saying is that Donald Trump is a horrible person and a racist simply because he wants to stop illegal immigration in this country. let's not get started on what people are saying about Donald Trump supporters. That we're ignorant that we are racist. And please don't lecture me on how I should respond to things! Like I'm some child in a classroom and you're the teacher. You're being extremely condescending.","commenter_a":"This is total bullshit!!Mexicans that think we are racist because we want to have a wall how about the wall you have between Guatemala and the Mexico border. None of you ever answer that question. (and if you want to get technical it's not a wall it's a huge fence with Barbwire on top of it)And I'm not a racist my husband is Latino and my children are considered biracial so stick it where the sun don't shine,I don't want to hear any of that crap.The people in this country are totally fine with legal immigration it is illegal immigration that Americans have a problem with. I don't see Mexico having open borders and even if they did they certainly wouldn't be giving illegal immigrants welfare food stamps Medicaid I could go on and on and it's all being paid for by the hard-working American taxpayers.it sucks when you live ...","post_message":"The Latino community has a powerful message for Donald Trump.  #MicBrights"}]
