[{"comment_id":"10153248729158908","commenter_b":"Sharon Wilkshire","commenter_a":"Nancy Brown","post_message":"Coconut oil has many health, home, and beauty uses. This oil is a simple, easy, and inexpensive replacement for many commercial products that you may be using at home."},{"comment_id":"1711039005849878","commenter_b":"This Mexican thug should be the one that's taken out. Lots of people would like to see that happen.","commenter_a":"This is so fake people will write anything to make a story","post_message":"This is bone-chilling.  Our prayers are with you, Donald J. Trump!"},{"comment_id":"10152723762841545","commenter_b":"WE OCCUPY THEIR COUNTRIES FOR MONEY!!!!!!!! how would you feel if that happened here. we had foreign soliders occupy us for 10 years for the elite to make more money based on lies!","commenter_a":"The more you know liberals","post_message":"Three students from campuses including University of North Texas, University of Texas at Arlington, and at University of Texas at Dallas each reported being the targets of anti-Muslim threats this week."},{"comment_id":"1548076978821767","commenter_b":"'@username Illegals are already criminals by definition.","commenter_a":"These liberal are making more and more people want to vote for Trump.","post_message":"Top progressives are terrified the Democrat mob attacks on Americans will send millions of voters running to Trump."},{"comment_id":"10153539515518984","commenter_b":"The Feds own substantial acres of land in several of these states and when they pass these more restrictive rulings guess what? They exempt themselves from said compliance AND if they choose to return some of said land to the state, guess what? The state is forced to bring land into compliance. Tks AZ for joining with the 26 sister states in this fight.","commenter_a":"It gets worse and worse and yet our congress , senate, supreme court , fbi ,cia all seem afraid, They do not represent the people.","post_message":"These 27 states just made an epic move against Obama's federal power grab... they are not going to let Obama take over their states without a fight.  This is exactly the right move... share their strategy everywhere."},{"comment_id":"10153722857026336","commenter_b":"How sad! God be with his family at this time.","commenter_a":"Who won the game ?","post_message":"17-year-old Evan Murray was a victim of internal bleeding caused by a ruptured spleen, an autopsy revealed Monday."},{"comment_id":"10154774250570575","commenter_b":"He is the ugliest woman I have EVER seen!","commenter_a":"He is a women himself","post_message":"LOL..."}]
