[{"comment_id":"421525971373828","commenter_b":"Stop apologizing women! I had an abortion, cause I wanted to and no one ever new! Lol! Ya know why, cause its not your business! Stop saying ,well my birth control didn't work, blah blah blah. Its not illegal! If you don't like abortions, don't have one.","commenter_a":"What does that actually have to do with abortion? Viagra is not causing the death of a living being. It's not about hurting women's reproductive decisions. I mean, I'm all for birth control methods. Just imagine how many abortions could've been avoided if the women were using a very effective form of birth control? And, before anyone says that you can get pregnant on birth control or while using condoms, let me just state that it is over 99% effective if used properly. Although it is possible, it would be a fairly rare occurrence.","post_message":"\"I purposely tried to make it as invasive, as intrusive, as hypocritical and unnecessary as possible,\" the lawmaker said."},{"comment_id":"10153947557669753","commenter_b":"Police and your government bosses, STOP PREYING ON BLACK PEOPLE LIKE HUNTING WILD GAME AND SHOOTING US TO KILL!!!","commenter_a":"She is crying a hell of a lot more now that she is being interviewed than when sitting next to a dying man with her child in a car... Still say something fishy about the whole situation","post_message":"Police scanner recordings obtained by a local Minneapolis news station reveals that St. Anthony police officers pulled over Philando Castile not because of a busted tail light but because he looked similar to a robbery suspect due to his “wide nose.” The startling dispatch recording indicates that not only was Castile seemingly racially profiled for his “wide nose”, his girlfriend says that officers lied when they claimed the stop was for a tail light that was out as the tail light was seen... @webpagelink"},{"comment_id":"517364508436536","commenter_b":"The other candidates are disappointed because they need Trump's ideas","commenter_a":"I wander if I can have my cable provider remove FOX channel from airing in our home period...ha..oh, I can do that. #TRUMP !!","post_message":"The Trump campaign is saying that Donald J. Trump will skip Thursday’s Fox News-Google #GOPDebate. @webpagelink"},{"comment_id":"777437579026197","commenter_b":"No I think the lying words wouldn't come out,she was choking on them.","commenter_a":"BS","post_message":"I don't think she had ANYONE fooled..."},{"comment_id":"1362983927059832","commenter_b":"Found the \"run the USA into the ground\" voter.","commenter_a":"In a close election, to falsely broadcast that a candidate \"faces indictment\" is an act of sedition, especially when they know their viewers are hungry to believe such a ridiculous lie and would eat it up. Absolute treachery!","post_message":"In fact, Baier said, after checking with his sources, there is no evidence at this time for either statement."},{"comment_id":"10153263925251990","commenter_b":"@username hubby leaves for work and I wake up","commenter_a":"Jackie Owens @username-Hernandez @username","post_message":"JUST IN: The CHP says two people were struck by blow darts while walking on the Golden Gate Bridge --> @webpagelink We will have more on this story in our News at 11 p.m."},{"comment_id":"10153345373924087","commenter_b":"Quit being a bitch you got your guns right?","commenter_a":"And Obama is going to let more terrorist in here so what's worse","post_message":"“He’s whipping up hatred to scapegoat a minority religious group, which has some very dangerous precedents,” Rep. Keith Ellison said of Donald Trump’s claims that thousands of Muslim Americans cheered the 9/11 attacks. “I mean, it’s the kind of behavior [that is] classic demagoguery, and you know, he’s going to get somebody hurt.\""}]
