[{"comment_id":"1803726116573607","commenter_b":"Graham disbrow are you on a loop?","commenter_a":"looks like more reporters the protestors.....","post_message":"HAPPENING NOW: Protesters plan to block the Mill Avenue bridge in #Tempe as part of a police brutality demonstration.  WARNING: This is a live feed. Viewer discretion is advised."},{"comment_id":"533139670207659","commenter_b":"She can take her sorry ass over there and live bet they wouldn't let her stay long","commenter_a":"she is a complete WASTE AND NEEDS TO BE PUT IN JAIL ALONG WITH HER COHORTS..","post_message":"She is DELUSIONAL..."},{"comment_id":"10153992040756336","commenter_b":"This is a must read. I copied it from a post. These are things you need to know about Islam and Muslims. Allah IS NOT the same God who is worshiped by Jews and Christians. Allah is no more a God than the Golden calf of Egypt. Allah predates Islam by over a thousand years, and was a minor deity in the Temple of Baal, the Canaanite Sun God, who was worshiped throughout the Middle East. Baal (ba'al) was an ancient Canaanite and Mesopotamian deity associated with agriculture. He was believed to be the 'giver of life' and mankind was dependent upon him for providing what was necessary to sustain the farms, flocks and herds. Allah was the moon god who's sign was the crescent moon. Mohammad, born 570 years after the Birth of Christ, was very familiar with Judaism and Christianity and stole traditions from both religions to create ...","commenter_a":"Why does Christianity need protecting? It is the dominate religion and is afforded special privileges. Christians are just upset that they don't have the right anymore to force their beliefs on others.","post_message":"Donald J. Trump spoke about protecting Christianity during a speech at Liberty University today. @webpagelink"},{"comment_id":"1577321485900379","commenter_b":"Women yes! Hillary no!!!!","commenter_a":"No victory to any women! She does NOT represent me! she's a liar, fraud.. and doesn't even come close to respectable... What a shame for 'women'","post_message":"Hillary Clinton: “We’ve reached a milestone: The first time in our nation’s history that a woman will be a major party’s nominee for President of the United States.”"},{"comment_id":"10153767217919497","commenter_b":"Let's really make a team effort to versnitchinize the fizemignots.","commenter_a":"Area intern tells employer 'I'm more into first person shooters, than platforming' is fired on the spot","post_message":"The buzzword has yet to be expounded on or put in context by anyone at the company."},{"comment_id":"10153667597986770","commenter_b":"She belongs in prison!","commenter_a":"Prison","post_message":"Hillary Clinton thinks she should be president. But does she really belong in prison? @webpagelink"},{"comment_id":"10153448230456680","commenter_b":"'@username Lucky for you these modern day Hitler's didn't murder you in your womb.","commenter_a":"The innocent handicapped underdeveloped should not be punished by death. Some are responsible and need to be punished. Donald J. Trump is correct again. Trump for president 2016.","post_message":"Planned Parenthood Action also issued a five-figure ad buy in partnership with Priorities USA Action – a super PAC supporting Hillary Clinton."}]
