[{"comment_id":"817764698322138","commenter_b":"What Melissa said !!","commenter_a":"You know if everyone hates you, you must be doing something RIGHT. Trump isn't an ASS KISSER.","post_message":"\"I understand why he got angry. She was asking insulting questions.\""},{"comment_id":"531668583690388","commenter_b":"GO AWAY!","commenter_a":"This bitch needs to change, or else....","post_message":"Hillary Clinton just said all Christians have to change their beliefs. She is the one who needs to change her beliefs. Do you agree Hillary Clinton it out of line?"},{"comment_id":"10155072860698690","commenter_b":"Cedric-Herrou, wherever you're you're my \"Hero\" Blessed are those hands that giveths.","commenter_a":"Diego Dab","post_message":"Farmer Cedric Herrou is standing trial for helping people cross into France, but his actions have made him a local hero."},{"comment_id":"799759520167266","commenter_b":"DONALD TRUMP IS NOT A RACIST HES HIRED ALL NATIONALITIES ALL OVER THE PLACES HE OWNS AND PAYED THEM GOOD AND WAS FAIR TO ALL OF THE PEOPLE WHO WORKED FOR HIM AND HE WILL DEFINITLY MAKE A GREAT PRESIDENT FOR US AMERICANS NO MATTER WHAT RACE THEY ARE ,WERE HILLARY COULD CARE LESS ABOUT US AMERICANS SHE JUST SAYS THINGS TO BLACKS OR WHITES OR ALL OTHER RACES TO GET VOTES JUST LOOK AT HER BACK ROUND AND WHAT DID HILLARY OR OBAMA DO WHILE THEY WERE IN THE WHITE HOUSE FOR US ABSOLUTELY NOTHING BUT BROKEN PROMISES AND THEY GOT RICHER WHILE WE GOT POORER","commenter_a":"HILLARY 2016...","post_message":"REPLAY: Donald Trump at a rally in Wilmington, Ohio."},{"comment_id":"474050886118825","commenter_b":"Good Idea !!!","commenter_a":"If a Muslim man sees a naked woman other than his wife, He must commit suicide. There for, call for a father daughter dance instead of having Easter, have all the Playboy Bunnies show up naked! Problem Solved!","post_message":"Muslims force this school to ban Christian holidays. America is under attack, this is treasonous. 'LIKE' if banning Easter is WRONG!"},{"comment_id":"10153664693511336","commenter_b":"Until Obama resigns she stays","commenter_a":"I'm sorry Governor Huckabee chose to support this action. She is a public official and her religious beliefs can not interfere with her professional responsibilities and duties. Is this how he would respond if he was Prresident of the U.S.? I'm disappointed in you Governor. She should resign her position if she is unwilling to comply with the law!","post_message":"Gov. Mike Huckabee joined Fox & Friends this morning to discuss his support of Kentucky county clerk Kim Davis, and why he believes she's remaining \"steadfast\" to her beliefs."},{"comment_id":"1154933824548403","commenter_b":"Kill every last pig","commenter_a":"Well done Syria","post_message":"Watch Syrian forces closing in on the Daesh Takfiri terrorist group’s de facto capital Raqqah."}]
