[{"comment_id":"1305722922778581","commenter_b":"Sean Connolly","commenter_a":"Logan Laybolt","post_message":"Tian Tian the panda enjoyed the snow this morning!  Video via the Smithsonian’s National Zoo and Conservation Biology Institute"},{"comment_id":"10156410644080725","commenter_b":".... And thats why im voting for Bernie Sanders and not a wealthy racist biggot like yourself.Mr. Trump our country doesnt need you.. you talk about about immagrants but all your wives were immagrants? What are you but an immagrant to this country yourself! Unless your native but that would be news to us! What tribe you belong to?? I.D cards to all the muslims in this country? Is this Nazi Germany???","commenter_a":"Trump is like a pre-PC candidate! So refreshing!! I remember feeling just a leetle bit awkward at first. That made me realize just how far we've fallen! #TeamTrump2016 #MakeAmericaGreatAgain #DitchAndSwitchNow","post_message":"People have got to stop working to be so politically correct and focus all of their energy on finding solutions to very complex problems!"},{"comment_id":"512225352297167","commenter_b":"put that baby arm away bitch get tight hoooeeeee","commenter_a":"Savage","post_message":"It be like that"},{"comment_id":"10156679024980354","commenter_b":"She is one wacky broad.","commenter_a":"I love that she's calling Hillary out for who she really is, but then again she's backing Bernie.... So, she can't be that bright.","post_message":"And that's not all she said about Hillary Clinton either..."},{"comment_id":"10156536159770354","commenter_b":"That's not a woman. It's a guy","commenter_a":"definitely a man","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"},{"comment_id":"10153086168389411","commenter_b":"that is why she is the ex","commenter_a":"Hell hath no fury like a woman scorned.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1457804240939001","commenter_b":"Don't forget the nra was starred by giving rifles to free slaves in the south to protect themselves from mobs and the kkk","commenter_a":"Just like President Obama, Al Sharpton is losing his grip on reality . Dr. Martin Luther King would roll over in his grave if he knew how far backwards race relations have slipped because of the ideals of Mr. Obama and Al Sharpton. I'm 51 years old, and I'm seeing more race related problems than I can EVER remember.","post_message":"Watch David Webb destory the Reverend..."}]
