[{"comment_id":"10153937537377894","commenter_b":"No wonder she's an Ex","commenter_a":"Wait. So she is saying he disrespected the flag, what he is doing is wrong, and after all of that she has the nerve to say he needs to be humble? The stupid ass Star Spangled Banner is NOT the Pledge of fucking Allegiance, first of all. I wish people would recognize that. Second, draft dodging is ILLEGAL, you \"allegedly\" advised Muhammad to do that and now you want to split hairs about the \"right way to protest\"? Third, how is he not humble and if he wasn't why should he be? Muhammad Ali famously talked all types of shit now she telling a nigga to humble himself, bih, go away.","post_message":"Girl, Bye! Muhammad Ali’s Ex-Wife Says Colin Kaepernick Should ‘Get Off His High Horse and Humble Himself’"},{"comment_id":"10150603929279999","commenter_b":"Aren't they real women? What's a real woman, and who doesn't qualify ?","commenter_a":"Perhaps a more diverse group by race, ethnicity and cultural but alarmingly the same re: the skinny, young and sullen look of mannequins rather than real women...","post_message":"Meet the woman behind the unconventional beauty of today's most successful models."},{"comment_id":"10155119419651320","commenter_b":"Looks pumping","commenter_a":"THE ISSUE IS NOOOOTTTTT MUSLIM!!!!!","post_message":"Democrats hold an anti-Trump protest in Washington D.C."},{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: \"Oh for goodness, that is not going to happen. I'm not even answering that question.\" #DemDebate"},{"comment_id":"1845364932419184","commenter_b":"Little girl go sit down and shut the hell up.","commenter_a":"she is an bitter root from the tree","post_message":"Not a good choice of words, Bristol."},{"comment_id":"10153021389625399","commenter_b":"All you have to do is look it up .they are in key positions and were placed there by Plummer. Thank you Franklin Graham keep telling it like it is","commenter_a":"Listened to him!","post_message":"\"Washington, has been infiltrated by Muslims who are advising the White House, who I think are part of the problem.\""},{"comment_id":"10154276902002908","commenter_b":"Juan. Not one illegal should be in this country. Trump is spot on. If you were in someone's house with a fake ID you would be charged with breaking and entering and impersonation and sent to jail. Illegals should be deported and sent back to their country on the spot just like criminals in America are. It's that simple.","commenter_a":"Plus they do like 32% of the actual work","post_message":""}]
