[{"comment_id":"943402869028468","commenter_b":"It is only because all the other politicians want illegal's here. Trump is watching out for the American People!","commenter_a":"It's being said that Mr. Trump is causing problems for the GOP; taking votes from the others. BS! I'm Indy/democrat, and trust me, I'm voting for Mr. Trump! Any other Indy/democrats doing the same?","post_message":"BREAKING"},{"comment_id":"10153182751728145","commenter_b":"Can the a/c compressor fit in my car? My A/C isn't working, I'll take the air over a flag! lol lol","commenter_a":"Give it a rest already","post_message":"Say goodbye to General Lee. Now toy versions of the iconic orange Dodge Charger will end production. Here's why: @webpagelink What do you think about this move? #WFTV"},{"comment_id":"809439485771743","commenter_b":"no sh-- sherlock, and obummer is running circles around the media....idiots.","commenter_a":"Andrea you are so astute! That is more than obvious, with that clown Kerry doing the negotiating!","post_message":"We could've told you that, Andrea. #Iran"},{"comment_id":"10153686038898984","commenter_b":"DO NOT PASS GO....DO NOT COLLECT ANY MORE OF OUR MONEY......GO DIRECTLY TO JAIL....GITMO.......HOPEFULLY....barack HUSSEIN ......WILL FOLLOW !!!!","commenter_a":"YES!","post_message":"Wow. It looks like winning the presidency is about to become the last thing on Hillary's mind... Do you think Hillary should be indicted?"},{"comment_id":"1305307819486565","commenter_b":"#DUMPTRUMP NOW!","commenter_a":"TRUMP will have them shot, Obama let them make it with their lives. He's already making plans for Paul Ryan, he has ties to the Mafia and will use them. They will have to get rid of Trump.","post_message":""},{"comment_id":"525857150938198","commenter_b":"She is the female anti-Christ.","commenter_a":"Oh but there are plenty of sheep out there that think this idiot is wonderful how stupid can people be???","post_message":"Hillary Clinton's sex slave just exposed her for doing THIS. What a disgrace. She will never be president. Can we get 20,000 'LIKES' to make sure Hillary never becomes president?"},{"comment_id":"1133469633342492","commenter_b":"Women's bathrooms have that too bc some haven't mastered the art of hovering. Then add on period stuff.","commenter_a":"Joke's on you, pal. Men's public bathrooms are usually pretty disgusting.","post_message":"This. Is. AMAZING."}]
