[{"comment_id":"481790668675893","commenter_b":"GET THIS TROUBLE MAKER OUT OF THIS COUNTRY ....BEHEAD iSLAM","commenter_a":"Now that is one hell of a costume","post_message":"ARREST HIM!!!!!!!"},{"comment_id":"977904432246897","commenter_b":"She is an EVIL woman an not sure why she isn't in JAIL @username!","commenter_a":"Who is that masked woman?","post_message":"It's a very simple question: “Have you seen those very, very controversial videos?”"},{"comment_id":"10153632745068812","commenter_b":"Get her a feed bag and shut the pig up!","commenter_a":"Yet big oil is in her pocket","post_message":"\"You don't have to be scientist to take on this urgent challenge that threatens us all. You just have to be willing to act,\" she says: @webpagelink"},{"comment_id":"10152987199648645","commenter_b":"We are fed up with illegals and their anchor babies.","commenter_a":"What an idiot!! Those poor children! Obviously the program was already english hence the translator for the parents. Have some compassion and MANNERS!!!","post_message":"Witnesses at the Kindergarten concert said the man stood up as a Spanish translator began speaking and repeatedly shouted ! English only!"},{"comment_id":"1009798209043227","commenter_b":"That woman will never learn.","commenter_a":"Pig","post_message":"Joy Behar calls out Carly Fiorina. Is she right?"},{"comment_id":"1909759522584421","commenter_b":"Isn't that Gail, Oprah's secret girlfriend ? She's a racist along with Oprah.","commenter_a":"Go back to Oprah!","post_message":"CBS acted like #BlackLivesMatter's personal PR group."},{"comment_id":"10153617049593984","commenter_b":"Hillary's a woman chaser to.","commenter_a":"Bill has Always been a Woman chaser... Hillary Must been doing something Wrong... Or she's to busy Scamming People out of their Money.....","post_message":"This woman has struck fear into the hearts of the Clintons for a long time. Now she may have just landed a knockout blow on Hillary... This could be what takes Hillary down. Do your part to make sure that happens by spreading this article to your friends and family."}]
