[{"comment_id":"10154249392839445","commenter_b":"date on picture is July 2008 took almost 8 years to figure out he was a fraud no wonder this country is going to SH-T","commenter_a":"Shame on him","post_message":"In his application for disability benefits, John Caltabiano claimed he couldn’t drive, cook for himself, exercise at the gym, move around his house or even shave without help."},{"comment_id":"1386644204686259","commenter_b":"It's all geared for her to win. She knows this. The corruptness is too great and the winner will be whomever bows to the big $. Sanders and Trump won't do it but she does and will continue to do so.","commenter_a":"And, that a$$hat in the photo has never accomplished a thing worth mentioning.","post_message":""},{"comment_id":"1093117534044369","commenter_b":"He should be slut shamed with a fire ant bath!!","commenter_a":"The term \"slut shame\" is fucking ridiculous in and of itself, but saying that the judge was \"slut shaming\" a rape victim is fucking horrendously disgusting. This judge should be suspended, and whoever made the title for this article should be fired.","post_message":"Holy sh*t."},{"comment_id":"10153649297241756","commenter_b":"William, the real shame is that this woman has likely already procreated or will procreate and pass on her low level of intelligence and ignorant, backwards redneck beliefs onto her offspring.","commenter_a":"As a historical relic, it belongs in a museum. The Confederates lost the war. The only flags that should be flying at the South Carolina Capitol are the United States & South Carolina flags.","post_message":"The crowd chanted \"USA! USA!\" as the flag was lowered."},{"comment_id":"10154403628496336","commenter_b":"Ban all bombs - Obama","commenter_a":"Obama will call for more gun Control in Istanbul!!! It's not a terrorist attack in his eyes. Because of him these cowards are killing innocent people.","post_message":"Breaking News Update: At least 10 people were killed in the two blasts at the Ataturk Airport in Istanbul, according to the Turkish Justice Minister. @webpagelink"},{"comment_id":"652310991589660","commenter_b":"LMFAO. Stupid dumb Bitch.","commenter_a":"@username i can see u doing this. so smart of him","post_message":"When the mother who was in line behind him refused to do anything about her loud, obnoxious child, this man decided to take matters into his own hands."},{"comment_id":"10156047259680231","commenter_b":"Kayne and Wiz are dirty whores!","commenter_a":"How you gonna forgive someone for you being a hoe? js","post_message":"Rose broke down in tears while talking about her exes during the SlutWalk she organized."}]
