[{"comment_id":"495708673953046","commenter_b":"A Bullet to the head! No need to play nurse maid to this POS!","commenter_a":"shitbum","post_message":"This thug thought he was tough, not so tough now.   Good, he got exactly what he deserved. He is scum.  Do you agree all thugs should be deported?"},{"comment_id":"10156505662180354","commenter_b":"Give the stupid bitch the boot for good. Free her up so she can go over the Syria and suck up to those murdering rag heads.","commenter_a":"GOOD! This 'professor' NEEDED to be fired!","post_message":"Read the Christian college's powerful statement..."},{"comment_id":"10153328775418128","commenter_b":"I thing that puts our 18 trillion in debt in perspective...","commenter_a":"No doubt that population and geographical size - density as a dependent variable of income per-capita help construct the value perspective.","post_message":"The most valuable U.S. states by land value: 1. California 2. Texas 3. New York"},{"comment_id":"10154184245291943","commenter_b":"This evil woman needs to fall, through what ever means necessary.","commenter_a":"Oh quit messing with us. Either do it or s t f u!!!","post_message":"With 75 days before voters pick their new president, email revelations are threatening to overtake Hillary Clinton campaign  with WikiLeaks founder Julian Assange hurling another log on an already raging fire with a vow to release  Clinton documents.  In an exclusive interview Wednesday night with Fox News Megyn Kelly, Assange was asked whether new information culled from Clinton emails would be released before the general election: 'Yes, absolutely.  - via Fox News"},{"comment_id":"10154385047759714","commenter_b":"Mmm seems she has friends in high place above the law she is!","commenter_a":"RIP America....","post_message":"1916: The first woman is elected to Congress.  2016: The first woman wins the Democratic race for president. #Election2016 @webpagelink"},{"comment_id":"10153943709566509","commenter_b":"Humans ruin everything they touch.","commenter_a":"why kill the bear!!!!!! humans were encroaching on it's territory! makes me ill","post_message":"Fatal human-bear encounters in Yellowstone National Park are rare, a spokeswoman said. @webpagelink"},{"comment_id":"10153517502611770","commenter_b":"She should give all her money away","commenter_a":"What an idiot","post_message":"You can't make this stuff up, folks."}]
