[{"comment_id":"10154189776881130","commenter_b":"I'm ready, bitch.","commenter_a":"Not reading the article--no time for it. But to pass along, a commentator on CNN today said that the Clintons operate from a stance of self - righteousness, thus they cant see what they're doing is oh so wrong. Hit it on the head! Two major party candidates, to major flawed choices!","post_message":"If Hillary Clinton wins in November, brace yourselves."},{"comment_id":"919415154748007","commenter_b":"Really u sound SPECIAL!!! thanks for making the black race look retarded all by urself!!! Ur what the white man lives to have on his side.. Wake up my sister. Don't matter what shade we are we are all black","commenter_a":"stop f****** with them mixies and get a. SISTER","post_message":"\"Dark Skin Activist\" Slams Kendrick Lamar Over Light-Skinned Fianceé: “I Will Never Support Him”"},{"comment_id":"940190486114130","commenter_b":"What a fucking shitbag","commenter_a":"Bill Clinton was President and the Commander in Chief during part of my time in the National Guard. I had no respect for him as a man but had I ever encountered him I would have rendered proper military courtesy out of respect for the office of the President. When you put on the uniform you mo longer get to pick and choose.","post_message":"HA! She should've thought twice..."},{"comment_id":"659276420929603","commenter_b":"I guess she could go back to Africa Ebola does that ring a bell","commenter_a":"Dam she's got lips like monkey boy.I bet she could suck the crome off a trailer hitch.","post_message":"This entitled woman just demanded a free drink... Because of slavery? This is absolutely ridiculous. We owe her nothing. Should she be compensated for slavery?"},{"comment_id":"10154481877908411","commenter_b":"That's why she gets oaid the BIG BUCKS.","commenter_a":"Same to you and your family. Thank you for your sincerity and hard work.","post_message":"Wishing you all a safe & fun celebration as you ring in the new year tonight. Happy New Year!"},{"comment_id":"1672968102966647","commenter_b":"@username If she's 201 lbs I'm a dolphin.","commenter_a":"Plus sized? She's not even rubenesque. A way to help Sports Illustrated tell if their model is plus size or not to ask ask \"if we don't tell people she is plus size, will anyone know?\"","post_message":"A trailblazing move by Sports Illustrated Swimsuit."},{"comment_id":"464688210388426","commenter_b":"Well yeah, I too would rather YOU be MORBIDLY OBESE and therefore die early........mental midgets like you guys just should NOT reproduce !","commenter_a":"Different if had medical problems, just being lazy isn't one","post_message":"Should This Family Be Taken Off Welfare? Comment 'yes' or 'no'."}]
