[{"comment_id":"10153760568196162","commenter_b":"I wish except i don't think my mom would know how to play the lotto lol!!!","commenter_a":"@username your mom won","post_message":"POWERBALL WINNER: Someone in Michigan just won the second largest Powerball jackpot this year. @webpagelink   The winning ticket is worth $310.5 million.  Here are the winning numbers:"},{"comment_id":"521579714699275","commenter_b":"She is like a pile of dung. Worthless!","commenter_a":"Yes","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way.  What a disgrace. She needs to deported to the Middle East.  Do you think Nicole Kidman is a sell out?"},{"comment_id":"10154862382515329","commenter_b":"OHHHH yes yes darkest timeline better forgotten","commenter_a":"April Corey","post_message":"You're gonna want to grab some tissues for this one. // Dawson's Creek"},{"comment_id":"595052750663656","commenter_b":"So RACIST I used to really like her. Now o can't stand her..","commenter_a":"And we don't want to hear you talkm","post_message":"THE VIEW’S Whoopie Goldberg To Co-Host: “This Is Why Black People Don’t Wanna Talk To White People” [VIDEO]"},{"comment_id":"10153672504893812","commenter_b":"Demonstrators showing their ignorance.","commenter_a":"Jade helm time to test what you got","post_message":"JUST IN: State of emergency declared in St. Louis County due to Ferguson unrest: @webpagelink"},{"comment_id":"1127692307251779","commenter_b":"Fucking dumb bitch.","commenter_a":"Here we go again with the IFLS lies and propaganda","post_message":"The parents, who had chosen not to vaccinate their child, are “devastated” and have now had their younger daughter immunized as a result."},{"comment_id":"10153141603253352","commenter_b":"Melissa shut the fuck up!","commenter_a":"Those Black Companies are NOT affiliated with ANY Black Supremacy Groups that's the BIG DAMN DIFFERENCE. WAKE THE FUCK UP PEOPLE.","post_message":"KKK erects billboard in Arkansas advertising local White Pride radio station featuring shows 'This is the Klan' and 'White Women’s Perspective'"}]
