[{"comment_id":"10154006446451680","commenter_b":"She is a joke.","commenter_a":"Making sure this cult leader doesn't get away with anything and Elizabeth Warren is one tough woman. Good for her.","post_message":"\"The American people understand the revolving door,\" Elizabeth Warren said. \"They're really sick of it.\""},{"comment_id":"10153184324863984","commenter_b":"One dumb ugly bitch","commenter_a":"Dislike this skag.........","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10153689322651162","commenter_b":"Typical female cant let another female live. Lol","commenter_a":"Stupid a@@! She probably walks faster than the Barbie Jeep.","post_message":"WOW: A 20-year-old college student's license was suspended when she was busted for a DUI... So she decided to get around campus on a Barbie Jeep instead: @webpagelink"},{"comment_id":"10153422547304138","commenter_b":"I watched it go down from the top of the parking ramp it was a woman cop that chased him down #Girlpower","commenter_a":"Haha scary I live on that intersection thank god I'm moving","post_message":"Not every day an inmate escapes in your neighborhood."},{"comment_id":"468706906587237","commenter_b":"She is a Dumb Idiot!","commenter_a":"We dont need awoman Preident .that is for immigration ....","post_message":"Carly Fiorina just had these harsh words for Donald Trump. Do you agree or disagree?"},{"comment_id":"10153854560011378","commenter_b":"Hillary is nothing but a liar... Trump 2016","commenter_a":"I'll be so glad once Hillary Clinton wins and becomes our new president because her speech she gave the other night everything that she said about keeping the guns out of the hands of criminals terrorist and these bad people that shouldn't have guns in the first place she will keep us good people from getting shot will be great we need a change in America please God let Hillary Clinton get enough votes to win in November","post_message":"A shooting victim has died and one man was taken into custody after a police chase and crash in South Philadelphia."},{"comment_id":"1140745955997895","commenter_b":"@username just who do you think you are? It's not over until the FAT lady sings.","commenter_a":"Are you kidding me? Trump nor Newt will NEVER get NEAR the White House!!!","post_message":"Would you like to see Newt Gingrich serve as Chief of Staff in a Trump administration?"}]
