[{"comment_id":"10153881107946680","commenter_b":"Another Misogynist","commenter_a":"'I'd grown up fearing the lynch mobs of the Ku Klux Klan; as an adult I was starting to wonder if I'd been afraid of the wrong white people all along - where I was being pursued not by bigots in white robes but, by left-wing zealots draped in flowing sanctimony.' -- Clarence Thomas Vote Trump. He's easier to impeach.","post_message":"'Long overshadowed by Scalia, the quiet radical is poised to shape his legacy.' Via POLITICO Magazine"},{"comment_id":"1119027841463579","commenter_b":"Julie, if you want perky get a coffee maker. Geez.","commenter_a":"Wouldnt Dr Carson be a more appropriate choice for Dr Jeffers to endorse? Dr Carson doesnt bash anyone like Trump does. Trump is so rude. Im embarrassed for First Baptist Church.","post_message":"'It's not that Evangelicals have given up on their values, but they no longer believe that government can uphold those values.'  Today on 'FOX & Friends Weekend,' Dr. Robert Jeffress explained the 'huge paradigm shift' in what Evangelical Christians are looking for in a candidate."},{"comment_id":"1811292265824545","commenter_b":"Lack off question mark ? Get a life lefty. It's Facebook , not a GCSE","commenter_a":"When I was the age they look,,,,,I'd got my apprenticeship done, bought my first house and was engaged!! How very strange,,,,,,,","post_message":"'Things are moving quickly now.'"},{"comment_id":"10150609954164999","commenter_b":"He got elected because he was the best man for the job and he keeps proving it over and over.","commenter_a":"Spread the 'word.' The 'word' is love.","post_message":"'Societies don’t overnight completely erase everything that happened two to 300 years prior,” President Barack Obama said."},{"comment_id":"10153354052466770","commenter_b":"Who cares what a woman beater thinks fk off chrissy","commenter_a":"Racist lives matter","post_message":"He had nothing good to say."},{"comment_id":"10153428772146509","commenter_b":"Cause she was worthless and weak that's why!!","commenter_a":"Why would you choose the classroom to do that?","post_message":"There was no indication of foul play, and every indication that she took her own life, officials said. @webpagelink"},{"comment_id":"10153444924104312","commenter_b":"Because it would cost pharmacutical companies lots of money if they didn't have cancer and other illnesses. Basically, all it is is reducing the amount of acid you put into your body from drinking soda, etc. They even make stuff you add to your water to alkalize it. Things like soda, obviously, and even milk although it is alkali in the container, once ingested it turns acidic and wreacks havoc on your body. Lemons, albeit acidic on the outside actually turn alkaline once ingested. You can actually look up guides to acidic and alkaline type foods. If you go to a Walgreens, health store, or wherever and pick up a roll of test strips in the health aisle, you go home, pee in a cup/container, dip the test strip in and look on the chart to see how much acid is in your body, then you take the steps necessary ...","commenter_a":"Want the cure? Eat right and use alkaline test strips until you test as alkaline as possible. Cancer feeds off the acid in the body, the more acidic you are, the better chance of the cancer spreading. If you are alkalized, cancer has nothing to feed on.","post_message":"A young woman has become the first person in the world to give birth to a healthy baby using ovarian tissue that was removed and frozen when she was still a child."}]
