[{"comment_id":"1237650529605618","commenter_b":"Who is going on the Walking Dead cruise in February","commenter_a":"This is kindergarten.....,childish.........by.....","post_message":"The Walking Dead gift reveal party"},{"comment_id":"10156017725535405","commenter_b":"Btw, Bob, Walker has never had a surplus. He borrowed $3 billion in a series of loans, threw it in the bank and called it a \"surplus\" withput taking into account the 30 debt payments on his loans. Links to the official records are here, mostly oin the footnotes: @webpagelink","commenter_a":"Scott's ok in my book. He reduced my property tax by about $500. Better than tax and spend Doyle who raised every tax and fee he could, typical tax and spend democrat. Scott let's clean house, enough with the time for a change, it's definitely time for a change.","post_message":"Governor Walker was on \"The Kelly File\" last night, highlighting his plan to challenge big-government special interests at the national level and put the hardworking people of America back in charge."},{"comment_id":"10153422739691167","commenter_b":"Oh goodie, now pass the popcorn.","commenter_a":"Who gives a damn? Why was he looking at her? I bet he kept watching nasty irrelevant ass","post_message":"Rudy Giuliani and Fox News are livid at Beyoncé this morning."},{"comment_id":"1118930614814076","commenter_b":"Palin has a mental disorder, do not vote for this woman at all Americans.","commenter_a":"She gives all Alaskan women a bad name. Duct tape would be useful over her mouth.","post_message":"She's mind-bogglingly dimwitted."},{"comment_id":"10154584590253812","commenter_b":"HILLARY TO WELCOME 1 MILLION MUSLIMS IN 1ST TERM Clinton's plan to expand refugee resettlement could cost U.S. taxpayers over $400 billion","commenter_a":"So we are being lead into war against each other and to blind to see the obvious of what is happening. When we need to be standing together fighting against these foreign countries and what we have been fighting for way before our time. Instead of allowing the color of your skin be an issue and using it towards one another. If you have so much hate use the energy towards standing up together fighting together working together and being there for one another to stand strong and conquer these hard times. We are giving in to everything we have fought to protect and save. Stop fighting against one another and fight for one another. Stop allowing this society to break us and the government to control us. Stop giving the enemy what they want and give them what they deserve. Stop being that slave to the government and allowing ...","post_message":"President Obama in comments on Nice attack: “These terrorists are targeting and killing innocent people, including Muslims.\" @webpagelink"},{"comment_id":"10152820448531051","commenter_b":"John Jo, you say, don't fight the battle until they come knocking on your door, well how many Americans have been killed, beheaded, this isn't knocking on our door ,than what is. He's the BIGGEST POS TRAITOR WE HAVE EVER HAD, HE WILL GO DOWN AS THE WORST PRESIDENT IN HISTORY. HIS ONLY CLAIM TO FAME, HE TRIED TO DESTROY THE UNITED STATES. HIS ASD SHOULD BE IN PRISON.","commenter_a":"Thanks to Obama!!!","post_message":"As if ISIS didn’t have enough weapons at their disposal – now they have chemical weapons."},{"comment_id":"1841512796060882","commenter_b":"@username till the wall is complete lol there isn't going to be anyone picking lettuce you better grow your own","commenter_a":"Well Boston Mayor...... you are not the President so you don't get to decide what he focuses on. He's up holding his priority promises to his supporters first then comes the rest. Not the Democrats vision the Trump vision","post_message":"Boston Mayor Marty Walsh says President Trump should focus more on creating jobs and addressing urban issues such as homelessness.  Watch more: @webpagelink"}]
