[{"comment_id":"636643946488247","commenter_b":"WHY DON'T YOU JUST SHUT UP-SAVE YOUR MUSLIM THREATS FOR THE MUSLIMS ! LONDON SURE SCREWED UP WHEN THEY LET SO MANY OF YOU MOVE INTO LONDON-AMERICA WILL NOT MAKE THAT MISTAKE !","commenter_a":"They will try to attack us anyway so if we don't allow them in it will be easier to contain the ones who are here already.","post_message":"The new Muslim mayor of London has issued a warning to Donald J. Trump: Moderate your stance on Muslims, or they will launch more attacks against America."},{"comment_id":"1115311211854904","commenter_b":"We don't need more people coming here from anywhere. Immigration is to benefit the country not the immigrant. We gain nothing by allowing more here when we can take care of our own","commenter_a":"North Carolina here voting TRUMP 2016","post_message":"\"I'm the only one that speaks my mind and tells the truth and everybody knows I'm right.\"  Today on \"MediaBuzz,\" Donald J. Trump discussed his proposed temporary Muslim ban. @webpagelink"},{"comment_id":"1832691560303641","commenter_b":"Good don't want you back in the White House!","commenter_a":"Thank goodness, not that she would ever get elected after her husband's lousy job.","post_message":"It looks like we'll never see an Obama in the White House again. Is that good news to you?"},{"comment_id":"1700109030241371","commenter_b":"@username @username lol this lady","commenter_a":"@username I so see this being you in like 100 years","post_message":"This 105-year-old woman has the best reason for ignoring her doctor's advice about drinking soda."},{"comment_id":"1380514481968578","commenter_b":"You're way too late. It's all Hillary now #imwithher","commenter_a":"If you live in a state that has yet to hold a primary, join with Sanders and stop both Hillary and Trump. #nevertrump #neverhillary","post_message":"Ohio Gov. John Kasich will suspend his presidential campaign on Wednesday, a senior campaign adviser tells NBC News."},{"comment_id":"10152972266751051","commenter_b":"No, phuck you, Eric! Get out of my country if you can't respect it. And that stupid bitch is just another moron who probably thinks we have a black president, too. Can't have a white momma and be black........DUH!","commenter_a":"Go to a country who has a flag you like, BITCH.","post_message":"This American flag social media challenge has become increasingly popular over the past week."},{"comment_id":"761877867244155","commenter_b":"STFU Shannon....stop raising a queer!","commenter_a":"A lot of folks are making \"wink wink\" comments but she is a sexual predator and you might feel differently if it were your son who was involved. I hope she gets treatment and does not teach again. Find another profession--I can think of one.","post_message":"The running joke was allegedly: \"Who is Ms. Altice sleeping with now?\""}]
