[{"comment_id":"1033224813385043","commenter_b":"My favorite lesbians work at Home Depot............","commenter_a":"I think my favorite part is that the guy was uncomfortable that gay men were running a hair salon. What? Don't you know that's where gay men come from? Salons and interior decorating warehouses. (Edit: Apparently I need to state that I am a lesbian and an activist and this is a joke poking fun at the stereotype. If you're offended by this, I suggest you take your efforts and make a change instead of complaining on an internet post.)","post_message":"*slow clap*"},{"comment_id":"950144531689554","commenter_b":"pathetic drama queen!!!","commenter_a":"Let's remember who this guy is....his history, his previous shows, his personality, his tweeting naked pics of himself....self-absorbed little twit!! he is one of the reasons I am not watching Fox News as much as I once did. He's a twit and he's all about the legalizing all illegals.....as he calls it, the \"Brown Tide\".","post_message":"After Trump adviser called Geraldo an \"embarrassing hack,\" the Fox News correspondent threatened violence."},{"comment_id":"10154301833998487","commenter_b":"The onus should be on the Jewish men: if they believe that women should not be swimming with them, then the men will just have to find someplace to swim.","commenter_a":"No. Your religion is your problem. If the pool wants to allow certain groups, including religious groups, to reserve the pool for certain blocks of time (like a water fitness class), that would be okay.","post_message":"Should city pools accommodate women whose religious beliefs forbid them to swim in front of men?"},{"comment_id":"1075434165805577","commenter_b":"I'll make my own mind up thanks","commenter_a":"BS","post_message":""},{"comment_id":"10153128305820933","commenter_b":"Kasich and Taylor can't be responsible when a trusted employee breaks rules behind their backs. Taylor has come out strong against the actions and has expressed deep disappointment that the Trust of the people was broken... as for Spencer (Tim) Balls crazy assertions. Kasich had nothing to do with the ordeal. Spencer (Tim) Ball has a vendetta against Worthington Christian Schools. Kasich's daughters attend the school. That is the only connection between the 2.","commenter_a":"Today's Columbus Dispatch (newspaper) had a good article revealing problems in the Lt. Gov.'s house.","post_message":"Gov. Kasich stopped to greet a small group in beautiful Peterborough, New Hampshire to end the week. See you again soon, New Hampshire! #nhpolitics #fitn"},{"comment_id":"1141972632481659","commenter_b":"I think they should exact a form of sharia law on these ME males. Cut their peckers off. They are stealing from these women","commenter_a":"Europe wake up and time to get you at of my bed. We can't except no more of this crime it's disgusting and these middle eastern got to go bye bye and ready for there deportation sentence. We don't want to hear no more of liberal excuses oh it's racist.Racist my face those people deserve there jail sentence and then there deportation sentence.","post_message":"Drip, drip, drip: News of more Muslim sex attacks leaks out"},{"comment_id":"1234184189935923","commenter_b":"Júlia, por favor, não vire uma crazy cat lady!","commenter_a":"Se encontró una asociación entre tenencia de gatos a temprana edad y desarrollo de trastornos siquiátricos en la adultez. Según el journal of schizophrenia research. Doble de probabilidad de desarrollar esquizofrenia, post infección por Toxoplasma gondii. (Por arañazo de gato) Cuidado con quedar como la vieja de los simpson. Paulina Santander","post_message":"A parasite common in house cats has been linked to mental illness."}]
