[{"comment_id":"10154058052466336","commenter_b":"the muzroach must not remain on the face of the earth no more","commenter_a":"He probably wouldn't have been caught coming across Obama's border.","post_message":"Police say they seized four air rifles, eight scopes and 200,000 .22-caliber bullets."},{"comment_id":"10153130276219071","commenter_b":"Want to know who fought against any and all mental health checks for firearm purchases? The ACLU and liberal groups...that's right...the ones screaming the most about \"guns\" are the ones with \"Blood on their hands\".","commenter_a":"All these gun nuts won't even consider the possibility of mandating thorough background checks before purchasing a gun. That's all that is necessary in my view. Instead they keep covering their ears and screaming \"taking away our guns won't change anything\". People wanting better gun control legislation don't necessarily want to take away normal/healthy/stable/non-criminals ability to purchase guns, we just don't want any psycho to be able to walk into any store and purchase a gun in 5 minutes.","post_message":"He says he's shocked that his son owned 14 firearms."},{"comment_id":"1738373569725506","commenter_b":"Nasty bitch!","commenter_a":"Thief don't need to words","post_message":"This should be interesting....ClashDaily.com"},{"comment_id":"10156653866510725","commenter_b":"Has anyone seen the documentary \"Cartel Land\" available on Netflix? Serious people we need an individual to build that wall. The Mexican/So.American border needs to be secure. We need Trump!!!","commenter_a":"#makeamericagreatagain","post_message":"GOOD MORNING! Put me to work for America- and I assure you that WE will MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"10153889238948984","commenter_b":"Send them BACK to Syria!","commenter_a":"Go back....","post_message":"You would think that Syrian \"refugees\" wouldn't be able to make many demands of their host nations. However, they have -- and some of them are completely RIDICULOUS. This should put the lie to the myth that these migrants are only coming to the West to escape persecution... and this is what Obama wants to import HERE?"},{"comment_id":"10153549615210667","commenter_b":"But not in the women's room with a dress on..","commenter_a":"Wow! Another church minister bites the dust.This is so sickening.","post_message":"Authorities say the two suspects answered online ads specifically offering sex with an underage girl."},{"comment_id":"10153199547146130","commenter_b":"Woman in front of the man is just perfect though.","commenter_a":"I noticed. I hated the woman behind the man. And her stupid hair cut.","post_message":"We can't believe we never noticed this before."}]
