[{"comment_id":"10152948081757144","commenter_b":"She's just as bad. I will never vote for her.","commenter_a":"Not a fan. She's a liar and a thief. In bed with Walmart and Monsanto. She's a evil war hawk.","post_message":"So much for transparency."},{"comment_id":"919474584812263","commenter_b":"She's in the white one percent of income earners selling darkness for light, propaganda and bullshit spewing pays well in America, the scary black men are race baiting ha","commenter_a":"To paraphrase the great Nelson Mandela: \"We are not less life loving than you are.\"","post_message":"Why didn't she have the same concerns about American Sniper?"},{"comment_id":"1755875524653363","commenter_b":"The real coruption and illegal a tivities existing in this administration are the issues, but you are to cowardly to address them. Payments have already been made for Hillary to continue to play her corrupt anti American game. It is easy for the Clinton crime family to justify their dark Anti American activity. The message to her foreign friends antagonistic to the United States, and those buying positions on our taxpayer payed government payroll; Hillary is still open for bribery. Trying to rationalize their evil destructive behavior is despicable. The present administration and Hillary, studied, we're mentored, and follow the agenda of the most corrupt genocidal ideologies on earth. National Socialism, Communism, and Islam. Combined these ideologies have murdered and plundered close to a billion human beings. So why would any sane person with good intentions follow any of these ideologies? They would not, but the Clinton's do. The death, ...","commenter_a":"I've heard a lot of people say they used to like Beck but now they think he is completely bonkers.!","post_message":"Glenn Beck harshly criticized Breitbart executive Stephen Bannon, who is now the CEO of the Donald Trump campaign, saying that Andrew Breitbart himself is “spinning in his grave.”"},{"comment_id":"10153935705086756","commenter_b":"@username And millions of flys eat shit daily.","commenter_a":"I agree with Paul Ryan. I didn't want him to have the job either. Or any other job. Anywhere.","post_message":"Ryan has said at least three times in the past year that he did not want the job. Now it's his."},{"comment_id":"10153873967388797","commenter_b":"Women want equal treatment. Then cry they don't get special treatment...","commenter_a":"The Man Should be on the Right.","post_message":"WHAT'S WRONG WITH THIS PHOTO? A picture of a couple walking down the sidewalk has sparked a heated debate on social media. What do you think? Here's why people are talking:"},{"comment_id":"10154336216583010","commenter_b":"An illegal aliens will take the job for pennies on the dollar...or a machine will replace you.","commenter_a":"But..but, if we raise minimum wage and pay people overtime, that would just create \"Dependency\". Then everyone who works for a living will expect to be paid a fair wage. Because you know, minimum wage jobs weren't meant to teenagers the hoopnard tractor socks because the hoodad ya ya. You're not supposed to pay for stuff like luxuries like food and rent because inflation. Death. Destruction. Burger flipping robots, twenty dollar Big Macs, dogs and cats sleeping together, locusts with the face of man, all because a soldier gets less than a french fries cook. Benghazi. Save up 112 years and go to school if you want $15 an hour, moochers ! Tuition isn't that expensive if you sell a kidney. You have TWO, stop feeling entitled to your organs. If you really want to help people get ahead, give MORE TAX breaks to the rich and keep the gay ...","post_message":"More than two-thirds of Californians support the state gradually increasing the minimum wage to $15 an hour."},{"comment_id":"1278741865525899","commenter_b":"@username dese bitch jam cuz","commenter_a":"🤘🏼OUS🚀ON","post_message":"Slim Thug's new joint \"King\" off the new album, \"Hogg Life, Vol 4: American King\"! #WSHH #SlimThug #Exclusive"}]
