[{"comment_id":"10153808334131337","commenter_b":"Y should people have to log out of FB cause they don't like her?","commenter_a":"If you don't like her and don't like hearing about her then I don't know keep scrolling, log out of Facebook, go on about your life!","post_message":"Oh, sure, Kim Kardashian West..."},{"comment_id":"10155741989330192","commenter_b":"There are many democrats who share many of conservertive ideas.like ideas about gays ,abortions,veterans rights,the militery.","commenter_a":"They are called libtards for a reason... Those that oppose legal hunting are just bad shots.","post_message":"A group of conservationists is urging Gov. Rick Scott to cancel the bear hunt that is set to take place this fall."},{"comment_id":"892607410865802","commenter_b":"As far as an analogy, this is not \"I don't agree with you so I get to beat you.\" This was more like \"you're an abusive boss and I will not be quiet about it.\"","commenter_a":"I find it funny how these pro Trumpers freak out and say how violent Bernie supporters are when in reality it is Trump's hate filled rhetoric that instigates this reaction. God help us all.","post_message":"Californians are having none of Donald Trump's bigoted hate speech."},{"comment_id":"10153561162560530","commenter_b":"No, she hit him and kneed him in the balls","commenter_a":"Why didn't this show how he was shoving through the crowd and her up against the bar and that's why she got mad?","post_message":"Surveillance video from a Tallahassee, Florida bar shows Florida State University quarterback De'Andre Johnson and a woman engaging in a bar fight in June 2015. STORY: @webpagelink"},{"comment_id":"10153394971818984","commenter_b":"She is as stupid as her 2 sons. one is hell now ,, the otherone will follow .","commenter_a":"I wanted him to get life in prison I did not want him to become a martyr","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing... Do you think this Boston bomber got what he deserved?"},{"comment_id":"1522438461149611","commenter_b":"OMG!! She has loads and loads of BULLSHIT in there!!!","commenter_a":"GOT METH?","post_message":"There's been lots of speculation about what might be ailing Hillary Clinton, if anything. One dental expert took a look inside Hillary's mouth... and almost instantly, he said he knew the condition that's been causing all of her health problems. Could this expert be right?"},{"comment_id":"834927826574487","commenter_b":"She's a waste of air & space.","commenter_a":"Someone said \"Free stuff\"?","post_message":"You know Queen of the 'Aisle Hogs' Sheila Jackson Lee @JacksonLeeTX18 will be there 10 hours early for her SOTU seat"}]
