[{"comment_id":"10153535731001157","commenter_b":"I don't 100% agree , but same happens when they send my child home from school with nothing but Spanish letters in a supposed \"Bilingual\" setting .","commenter_a":"Look's like a fag","post_message":"An Arizona mayor has refused an invitation to a meeting of U.S. and Mexican border city mayors because it was written in both English and \"Spanish/Mexican.\""},{"comment_id":"1068356466583942","commenter_b":"Chris clown is a pussy ass retard all this motherfucking bitch can do is beat on women","commenter_a":"Asswipe","post_message":"Chris Brown Threatens Trump And The Police: ‘Black People, Go Together 40, 50 Deep’ ⋆ UFP NEWS @webpagelink"},{"comment_id":"1294762407204042","commenter_b":"She should be arrested!! She a used this horse and disrespected the law","commenter_a":"Arrest her, let her do her time cleaning out stables of horse droppings .. It's equal to mentality !","post_message":"\"She seems nice\""},{"comment_id":"1106845012659268","commenter_b":"But are they Immigrants???","commenter_a":"Stop the hate!!!","post_message":"Mass shootings are becoming an almost-everyday occurrence in this country. This sickening and senseless gun violence must stop."},{"comment_id":"466095273584336","commenter_b":"Good maybe that will keep a lot of those liberals and illegals out of the rest of America.","commenter_a":"Have it your way Jerry...","post_message":"Liberal California Governor Jerry Brown: ‘If Trump Wins, we’ll build a wall around California’"},{"comment_id":"10153471883581509","commenter_b":"Can we remove obese women who wear the wrong sized clothing and bathing suits? Tired of seeing leopard print spandex stretched to its capacity, duck faced selfies and moose knuckles. Help me retain my eyesight please FB.","commenter_a":"Or 'dirty' words, children can be confused.","post_message":"Facebook is getting super-specific about what is and isn't allowed on the social network. @webpagelink via CNNMoney"},{"comment_id":"10153585908813984","commenter_b":"See it turning into a Muslim state.lets wipe out all history.","commenter_a":"This is the stupidest bluff I have ever heard! Deny the NAACP and all they can do is hurt themselves. What's next? B.E.T. threatening to go off the air?","post_message":"The NAACP just made a stunning demand about this historical monument... this is shocking move. Nobody thought they would go this far... What do you think about the NAACP's demand?"}]
