[{"comment_id":"10153327625216833","commenter_b":"She's a puppet","commenter_a":"Seems to me that the police that have been in danger are in the black communities.","post_message":"On March 28, MSNBC Melissa Harris-Perry suggested the push away from gun control and toward expanded gun rightswhich means more armed, law-abiding citizensactually puts police lives in danger."},{"comment_id":"10153216157089087","commenter_b":"Screw Carly the bitch","commenter_a":"She hit the nail on the head with that statement. Problem is that people are so selfish, narcissistic, and apathetic that they don't really LOOK at a person until its too late. Did I mention lazy? Handle problems on the front end and there will be less on the back end. Do you want to elect Carly Fiorina? Or a woman with multiple murders under her belt? Or a hatemongerer? Not my first choice, but I still like her.","post_message":"“The reason I’m running for president is because I don’t want to see hope fading from anyone’s eyes,\" Carly Fiorina said. \"When someone is addicted, you watch them disappear before your eyes.\""},{"comment_id":"1526333487662909","commenter_b":"Trump, you just jealous it was not you to be the first to go there. Get a life you weirdo.","commenter_a":"Big talk for someone who is a national embarrassment.","post_message":"Wow, President Obama just landed in Cuba, a big deal, and Raul Castro wasn't even there to greet him. He greeted Pope and others. No respect!"},{"comment_id":"10153853111962217","commenter_b":"Well done Team GB proud to be British and the achievements of our wee islands athletes.","commenter_a":"US is winning the olympics. That's good. I heard who ever wins the olympics has home field advantage during the next world war.","post_message":"Good job Team GB 👏🇬🇧"},{"comment_id":"551488165033429","commenter_b":"Wendy is my bitch","commenter_a":"@username wendy is the most annoying motherfucker. Bitch always has something to say, never intelligently or well spoken, and always speak out of her ass. SHHHHHHHHHHHHHHHHHH.","post_message":"This is how you shut down breastfeeding shamers. Read more about Alyssa Milano's activism here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"10153114544546943","commenter_b":"Charge her with something!","commenter_a":"Hilliary has blood of our soldiers on her hands","post_message":" Obama administration including Hillary Clinton and Susan Rice knew immediately that the Benghazi attack was a terrorist attack. The State Department new smoking gun documents put to rest any question about what Hillary Clinton and Susan Rice knew and when they knew it, said Judicial Watch President Tom Fitton. minutes of the attack, the administration, specifically Hillary Clinton, began lying to the American people by blaming an obscure Internet video. No wonder Hillary Clinton is the great destroyer of State Department emails. One can assume that Mrs. Clinton would not have stolen and destroyed emails in violation of law and various court orders if she didn have something to hide. And it shouldn take a federal court order to find out that Hillary Clinton evidently had no clue how the State Department and the FBI responded to terrorist attacks on State Department personnel."},{"comment_id":"10153423597850779","commenter_b":"Who is that chick on the left","commenter_a":"Sasha Banks, who is the by far the best wrestler male or female in the WWE, is Snoop's first cousin. I'm guessing a storyline should emerge.","post_message":"WWE has confirmed that Snoop Dogg will be inducted into the WWE Hall of Fame's celebrity wing, joining a list of alumni that includes Pete Rose, Mike Tyson, Arnold Schwarzenegger and Donald J. Trump."}]
