[{"comment_id":"10154492398684199","commenter_b":"Wolves are not endangered.They kill livestock.","commenter_a":"Holly","post_message":"A federal judge in Tacoma has rejected plans to increase the killing of wolves in Washington state by a federal agency."},{"comment_id":"1064458436973745","commenter_b":"FIRE HIS ASS !","commenter_a":"Fox should remove shep ,,,,he was absolutely rude because he only wanted his views to be discussed, Time to go,,,,","post_message":"Many are Calling for Shepard Smith to be FIRED After What he Just did ON AIR... @webpagelink"},{"comment_id":"694737757326072","commenter_b":"Unemployment is down because you can't get it silly woman.","commenter_a":"That's all of ya dumbass president who ya voted for should've just kept the house republican","post_message":"WHAT?!??!!?"},{"comment_id":"10153184314438984","commenter_b":"This lady is a disgrace to our country. She needs to retire or get voted out so she can get a real life.","commenter_a":"Nancy Pelosi needs to shut up. Who cares what she thinks. She knew what to expect of the speech, stay away. People were there to support the PM not to listen to her senseless sniveling.","post_message":"People are NOT happy about this, and they're calling her out for it big time.  Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10154522993923854","commenter_b":"She's a crazy idiot!","commenter_a":"TIME TO END THE CLINTONS POLITICAL CAREERS NOW..","post_message":"IT TURNS OUT HILLARY CLINTON IS THE ONLY PRESIDENTIAL CANDIDATE WITH TIES TO THE KKK"},{"comment_id":"10154723895793734","commenter_b":"Of course that's the type of trash that wants Clinton elected","commenter_a":"The guy who did this is a Republican","post_message":"Donald Trump's campaign manager is saying without evidence that a Trump protester involved in a disturbance at a rally in Reno, Nevada, was 'a Democratic plant or operative.'"},{"comment_id":"550965321772492","commenter_b":"'@username I think there's more chance of a war with Clinton. She's voted for a couple already and seems intent on aggregating Russia with unfounded accusations.","commenter_a":"The Clintons always try to 'cover their tracks' because their corruption is so deep. And they make sure they have info on others who can be manipulated via blackmail at a later date to further the Clinton agenda. PRISON is where they deserve to be!!","post_message":"This is worrisome..."}]
