[{"comment_id":"10154339330179087","commenter_b":"@username, who is afraid of immigrants? There are laws. Laws need to be followed to become a citizen. Do you want a POTUS ignoring federal laws?","commenter_a":"The left just can't help themselves. They have to cast this Trump... They have to portray him as somebody that's a walking mental midget, that literally has no idea what he's done here by winning the presidency, that has no idea how to talk, has no idea how to behave. They continue to make the mistake of plugging him into their model. They're plugging him into what they think an accomplished politician is, and he's not that, he's never been that, and he's not going to be that.","post_message":"“Trump and Pence, they pulled a dog and pony show on the numbers. I almost threw up in my mouth.”"},{"comment_id":"894715537301698","commenter_b":"The best thing you are doing, Mr. Trump, is weeding the un-Americans out from our society. You are already making the change for America being great.","commenter_a":"@username how was your preteen sexparty with you friend Epstein. It sound s you got a problem dude. Defloration of a 12 year old girl is not ok, if you know what I mean","post_message":"The \"protesters\" in California were thugs and criminals. Many are professionals. They should be dealt with strongly by law enforcement!"},{"comment_id":"10153599019231323","commenter_b":"Sack the bitch","commenter_a":"Either the bigot does the job she's paid to do by the taxpayer or quit. Its quite simple.","post_message":"“To issue a marriage license which conflicts with God’s definition of marriage, with my name affixed to the certificate, would violate my conscience.”"},{"comment_id":"10153377527143984","commenter_b":"Are some people just figuring out she's a LIAR and always will be!","commenter_a":"People need to wake up & research the person they are going to vote for....She is hiding so many things....","post_message":"Supporters of Hillary Clinton are reconsidering their choice for president after learning some stunning facts.   Are you glad to see Clinton's hypocrisy exposed?"},{"comment_id":"10154862382515329","commenter_b":"OHHHH yes yes darkest timeline better forgotten","commenter_a":"April Corey","post_message":"You're gonna want to grab some tissues for this one. // Dawson's Creek"},{"comment_id":"967437919978383","commenter_b":"Bruce, you're just doing way to much now....you've had your 'fun' trying to outdue the Tupperware Girls and all, but this is enough now","commenter_a":"Ratings dropped.","post_message":"In one tweet, it seems Caitlyn Jenner's political support may have shifted."},{"comment_id":"10152723867461680","commenter_b":"No, LIb. First of all you ASSume that every business owner in the country is a Republican, which is just more made up shyte by a LIb. Secondly, its called supply and demand. By flooding the labor market via illegal immigration and REWARDING illegal immigration, Libs increase the supply of labor in relation to the demand for labor, which lowers the price of labor.","commenter_a":"IT is amazing how those who vote republican seem to forget that Reagan and both Bush's gave amnasty to illegals, Reagan even went on to say that he would like to see an open border where the Mexicans could come and go any time they wanted, For all of you simpleminded republicans who want proof you have a computer look it up,","post_message":"Texas and other states suing over the moves say that only Congress can authorize the kind of sweeping actions Obama took."}]
