[{"comment_id":"493850430805537","commenter_b":"Shut Her Down !","commenter_a":"They spend money that is not theirs and should be made to pay it back.","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"10152947351429091","commenter_b":"They should send these idiots to go fight Isis since there so big and bad let's see how big n bad they are then..","commenter_a":"I hate ghetto children! Yes hate! That is our future? I'm scared.","post_message":"UPDATE: 2 arrests were made in a vicious beating at a McDonald's in Brooklyn. Teens were trading blows when a Good Samaritan jumped in...then he became a target, too. MORE: @webpagelink"},{"comment_id":"10155651168671509","commenter_b":"And the only illegal immigrants that are going to be deported are criminal illegals.","commenter_a":"I wish the best for Trump. Anyone hoping that he fails is like wishing that the pilot crashes the plane that we're all on.","post_message":"This CNN Opinion writer believes a Donald J. Trump presidency might actually help US-China relations."},{"comment_id":"961446100576222","commenter_b":"Send the worthless goat-f***ers home!","commenter_a":"Don't send them to America!","post_message":"UNREAL! Muslim 'Refugees' Camp At Terror Memorial And Protest Over Lack Of Housing In Paris [Video]"},{"comment_id":"10153594349921162","commenter_b":"Yolo","commenter_a":"Cesar Orozco @username @username","post_message":"Tomorrow could be the hottest day in nearly 2 years - if we reach 93!"},{"comment_id":"10152982491580927","commenter_b":"She is only interested in Pelosi.","commenter_a":"She wouldn't know, hers never started","post_message":"Pelosi:  think I know more about this subject than you, with all due respect."},{"comment_id":"1773749052877981","commenter_b":"So full of CRAP Hillary.","commenter_a":"Hillary is such a liar. Only person under investigation is Hillary and her staff... Yet Hillary tries to turn it around, LOL.... Hillary is such a liar.","post_message":"WATCH LIVE: Hillary Clinton speaks to supporters in Ohio. Ohio is a crucial swing state in the election."}]
