[{"comment_id":"10153311065101167","commenter_b":"Three words: Token. Black. Woman.","commenter_a":"Why does anyone care what Stacey Dash has to say?","post_message":"Today on live TV on two separate programs, Fox News called Obama a \"total pussy\" who doesn't \"give a shit\" about terrorism:"},{"comment_id":"10153639993996135","commenter_b":"She is a criminal....wake up!","commenter_a":"Her speech was excellent! Very well spoken and original.","post_message":"What did you think of the First Lady's speech?"},{"comment_id":"971579579554776","commenter_b":"Trump.. love him","commenter_a":"The hugs he remembers were on September 11th? I believe what rand Paul was talking about was when New Jersey got slammed with a hurricane and he was thanking Obama for sending assistance so quickly. That isn't anything more than being an adult professional. Something 99% of republicans are incapable of being.","post_message":"ICYMI: Here are the top moments you were talking about during the #GOPDebate. Who do YOU think won? @webpagelink"},{"comment_id":"1561742504135313","commenter_b":"Gonna try this for sureeee","commenter_a":"@username yess","post_message":"Making your own crepes is the perfect way to start the weekend. (via Real Simple)"},{"comment_id":"10153664452407183","commenter_b":"Very good comment !!!","commenter_a":"Mr. Robertson you do know that the Bible is a compilation of 66 books and letters written by more than 40 authors during a period of approximately 1,500 years. Its original text was communicated in just three languages. The Bible's authors were very human and may have been inspired by what they understood to be God's words, thoughts, actions. These 40 individuals came from various walks of life. Moses was probably the most educated, while the others were shepherds who became the King of Israel (David), farmers, fisherman and warriors. These earliest accounts were handed on from generation to generation in songs, narratives, and poetry. In those early societies there was no writing as yet and people passed on these oral accounts and with that the stories are exaggerated, changed, misrepresented, and contradictions, so we admit the humans creating the bible were not infallible or God is bi-polar. The creation ...","post_message":"Who knew that being kind to gays was a death sentence?"},{"comment_id":"10153167764854714","commenter_b":"Well,please make sure neither of you go out in a bikini then.","commenter_a":"Empowering her to be a porn star. Tacky tacky tacky","post_message":"Model Hannah Davis says her Sports Illustrated Swimsuit Issue cover is “empowering.” What do you think? @webpagelink"},{"comment_id":"1784321135174854","commenter_b":"No you not voting makes you a hypocrite","commenter_a":"I am so done with this mentality.","post_message":"\"...the oppressor isn't going to allow you to vote your way out of your oppression.\" Colin Kaepernick explains why he didn't vote."}]
