[{"comment_id":"10153461070784614","commenter_b":"Yup they should FRY !!! Not next week not next year but NOW !! Those are extremely sick people who can do that and don't deserve to breathe air .","commenter_a":"Sick. There are really some evil people in this world. God rest his soul","post_message":"A good Samaritan who offered his help as an AA sponsor was lured to a downtown L.A. hotel by a couple for the purpose of fulfilling 'long-held fantasy' of dismembering a body, prosecutors say.  Edward Garcia was convicted of murder Tuesday in the torture and dismemberment death of Herbert Tracy White.  Prosecutors say Garcia carved up White's body with a 3 1/2-inch blade and dissected and sliced a piece of leg muscle from the bone.  Hotel employees found White's severed arms and a backpack full of flesh in the room. Under the blood-soaked bed was White's torso riddled with scratches and small punctures.  'It was a bloodbath,' prosecutor John McKinney said. 'They took this man apart.'  Read KTLA's story here: @webpagelink"},{"comment_id":"1192440530796417","commenter_b":"She abstained from marriage and birth control","commenter_a":"I don't think abstinence means what she thinks it means.....","post_message":"Teen abstinence superstar Bristol Palin just gave birth to her second little bundle of hypocrisy."},{"comment_id":"10153973841258598","commenter_b":"She is a liar , a cheat, a murderer, and a disgrace to womanhood!!!","commenter_a":"FIRST WOMAN MURDERER!!! If she would kill innocent little American babies, what would she do to the rest of us?? Don't vote gender, vote for a great leader, vote TRUMP!!!","post_message":"Pro-Life Women Leaders: “We Can’t Celebrate Pro-Abortion Hillary Clinton as First Woman President”"},{"comment_id":"10153132227035326","commenter_b":"great white mess","commenter_a":"White Affirmative Action.. Donald Trump- another great White Hope! Trump joins a long list of rich entitled white boys who, were it not for their daddies, handing them everything on a silver platter, would have probably ended up on public assistance. Trump represents everything that is wrong with America. He is a gaudy bully and fake gold plated braggart who has showcased his business and moral acumen through a unending series of bankruptcies and divorces. He is a racist grifter and a criminal environmental rapist. In terms of patriotism and service to country, Bush, Romney, Cheney, Trump did not serve this country that they profess to love. But none of these fake ass patriots apparently have any qualms about sending other American children into harms way. For this crowd of 'real Americans' it's all about the Benjamins and what's in it for me. If America needs a cautionary tale as ...","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154661777626336","commenter_b":"I encourage all you Hillary supporters to each take in 3 Syrian refugees, because we don't want them here. Let them live in your homes. And while you're at it, since you Hillary sheep hate #Walls, start the #movement by taking the walls down, doors and windows off your houses and let people come in and out freely. And while you're at it, put up your gun free zones. #Trump2016 #BuildThatWall","commenter_a":"It's now reported that Hillary is going to appoint Loretta Lynch to the Supreme Court if elected president....pay for play, and corruption to the max. UNBELIEVABLE but not unexpected.","post_message":"'You tell me what’s worse: Name-calling or lying to grieving parents as their sons' bodies lay cold in caskets... and then turning around and calling those parents liars?' – Judge Jeanine Pirro @webpagelink"},{"comment_id":"1017021978357279","commenter_b":"Her daughter is a whoring little bitch.","commenter_a":"She is a screwball & her daughter is just like her. What is sexy about a big mouth drunk who is an idiot. I don't know any men who think she is hot stuff, they all say she is stupid & loves herself.","post_message":"Sad but true."},{"comment_id":"896147533775276","commenter_b":"We Americans are beat. Face it effort to assist citizens verses supposed immigrants (illegal) is futile. We are sold out! The few elite own the few corporations and all are subjects of the foreign owned NON 'federal' reserve! GOVT benefits were advertised south of the border. The border is not secure. Enforcing US deportation laws are ordered on STANDING DOWN. An increasing invasion of illegal foreigners flock into our nation. So now, the govt is offering huge tax rebates to illegals never having paid taxes! I give up! America can never survive.","commenter_a":"NO I DO NOT AGREE!!!!!!!!!!!!!!!","post_message":"PETITION HERE: @webpagelink"}]
