[{"comment_id":"644948305695748","commenter_b":"She is still ugly","commenter_a":"I wish I could believe she would pay for this and Obama too","post_message":"Michelle was just caught red handed and is about to be charged with treason.  Good. It's about time she was exposed.  Do you agree Michelle Obama does not belong in the White House?"},{"comment_id":"1048840968488441","commenter_b":"Or is the environment of higher education overwhelmingly dominated by dogmatic liberal and neo-progressive worldviews, while openly and often aggressively shunning anything resembling 'conservative.'","commenter_a":"You're imposing some causality here, @username... Does education make people more liberal? Or do people with liberal tendencies put a higher value on education?","post_message":"One possibility might be the growing numbers of women (who tend to vote for Democrats more than men) getting college and advanced degrees."},{"comment_id":"1586246148346927","commenter_b":"It looks like the hind end of A stripe ass baboon !","commenter_a":"Not just no but hell no I will burn any I find","post_message":"Michelle Obama does not deserve to have her face on anything. Will you buy these stamps?"},{"comment_id":"10153376436094087","commenter_b":"Ok some of you all don't get it. I like Trumps idea on closing our borders for a time being and this is why and a simple example. Please come to my house I have a bowl of 10,000 M&M's and in that bowl I may have 100 but at least 2 M&M's that are poisoned and will kill you the moment you put them in your mouth and slowly corrupting the bowl. So I want you to stick your hand in the bowl and eat a handful! Oh you won't? Why not oh cause the odds are your gonna die? Oh I see but it's ok to let 10,000 immigrants in knowing some are most likely deadly. But won't eat 20 M&M's because at least 2 out the 10 grand will kill you what's the difference??","commenter_a":"The immigration and Nationality Act passed June 27, 1952, revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in chapter 2 Section 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by , violence or other unconstitutional means. This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House. Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the Hadith all require complete submission to Islam, which is antithetical to the ...","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"},{"comment_id":"911723728894896","commenter_b":"Witnesses lying on the police..glad there was camera...+1 for the good guys 😀","commenter_a":"All 'community leaders/organizers' who make snap judgments about how an officer handled a situation should be made to go through a re-enactment of what the officer went through while making their decision. Maybe by walking a mile in their shoes they will have an inkling of an iota.","post_message":"Here we go! Witnesses say a white officer shot him in cold blood, this newly released video tells different story"},{"comment_id":"10153826127084024","commenter_b":"funny how she started all of it and then plays the victim","commenter_a":"With a native name like NO ONE WANTS TO POKE HER TUNA.","post_message":"It’s the latest in a series of Internet “tweetstorms” calling Trump on the carpet for his treatment of women and his insults toward her."},{"comment_id":"780004342132746","commenter_b":"He said he wants all immigrants to be required to carry an ID with their status, which sounds logical to me and he repeated what others said. 'We know not all muslims are terrorists but it appears all of the terrorists are muslims'. When was the last time you saw a Buddhist terrorist, or a sikh terrorist, or for that matter an atheist terrorist? You just don't. Our biggest threats come from the middle east right now. It was perfectly fine while we were at war with the Japanese to pay extra attention to them. It was perfectly fine during WWII to keep an eye on immigrant Germans. What is the difference now? Why are we going to try and justify keeping our sovereign nation secure. Every other country does it. There is no law that says we have to accept immigrants. We are allowed to pick and choose, just ...","commenter_a":"Well, all was well and good until the part that was speaking of hate speech from the presidential candidate. Well he was obviously speaking of Mr. Trump. Unfortunately he is completely wrong. Mr. Trump used no hate speech at all. The only thing said was that he thinks we should stop the middle eastern refugee immigration until we could confidently vet them. This would be a temporary action. But of course the way the bleeding heart liberal media spins it, is that he want to cut off all immigration. This is another one of those stories that is attempting to drive the narrative and falsely force people to have negative opinions without the facts. The media wants people to believe that Mr. Trump said these awful things because the media hasn't been able to manipulate him and force him to fall into step. The media and the establishment are scared ...","post_message":"It's the little things... ;)"}]
