[{"comment_id":"10153560622578984","commenter_b":"Gotta get around it some how. And drugs is my number 2 family problem, I HATE DRUGS!","commenter_a":"I do support this family, the only thing is I think all bakers and places that sell Wedding cakes need to go out of business or stop baking cakes, stick with pastries.","post_message":"The government is after this family for refusing to bake a cake for a lesbian couple's wedding. The way they just responded is absolutely perfect... Do you support this family?"},{"comment_id":"10153707771213598","commenter_b":"Oh wow, so I guess she never felt them moving around in there for the last FOUR months of her pregnancies. That was probably a monkey or a frog moving around in there. Right. Stupid, evil excuse for a woman.","commenter_a":"Her remarks don't make a bit of sense. What in the world she thought was growing in her body got 9 months, and she is swelling and gaming weight, etc. did any of her babies kick and move around? Was she skinny when her children were born? She just instantly gave birth to a baby out of the blue! Wow! Just plain stupid.","post_message":"Planned Parenthood President: My Childrens’ Lives Began at Delivery, Not Conception"},{"comment_id":"862939013836884","commenter_b":"Go away woman.","commenter_a":"I believe she is a bigot for supporting Sharia. Go blow Max.","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"10152981955661336","commenter_b":"Obama the terrorist wants Islam to take over America!","commenter_a":"There's no sense in complaining!The people can get rid of obuma anyday they choose to!!","post_message":"\"[President Obama] clearly romanticizes Islam and treats it as though Islam is above all criticism… And until we hold Islam to the same standards as every other religion, ethically and behaviorally, terrorism wins.\" – Lt. Col. Ralph Peters"},{"comment_id":"10153254096516509","commenter_b":"Send her to India","commenter_a":"I hope they capture her alive and she spends the rest of her days rotting in prison. Death for her is too kind.","post_message":"BREAKING NEWS: The female suspect in the #Paris grocery siege has escaped, the police union spokesman says. Watch Live Now: @webpagelink"},{"comment_id":"10153911405746509","commenter_b":"Lesbians rock","commenter_a":"its possible that he may have some mental issues :P but seems like a practicing Jewish...!!","post_message":"A 16-year-old girl, who was one of the people stabbed during a gay pride parade last week in Jerusalem, has died, police said. @webpagelink"},{"comment_id":"10153180295086051","commenter_b":"shes a smooth talking criminal, i'll give her that","commenter_a":"I very much hope so. The \"scandal\" the regressive party is touting is an expression of the kind of fear they have of her. I absolutely want Hillary to be the next President of the United States.","post_message":"Here's what Hillary Clinton had to say about her State Department e-mail scandal. Simple question: Do you think she'll be the next President of the United States?"}]
