[{"comment_id":"10153842971535950","commenter_b":"Mary, please remove yourself from the gene pool. Don't reproduce.","commenter_a":"Many western people feel targeted and afraid of muslims. You never know what they have underneath all that crap they have on. Why don't they go back to Muslims countries?! If they can't adapt them should not migrate.","post_message":"In Nice, a city with the ban, police can fine any woman wearing a burkini -- or force her to disrobe."},{"comment_id":"810137155781996","commenter_b":"If we wouldn't have killed them you would be dead by now","commenter_a":"Jebs brother George gave the go ahead to invade Iraq for something they didn't do leading to the death of over 500'000 innocent civilians. Jebs brother George. Jebs brother.......... Let that sink in. 500'000 men, women and children.","post_message":"The Obama-Clinton-Kerry team's stance towards Israel has been a disgrace. I’ll rebuild this crucial alliance."},{"comment_id":"10152947208161336","commenter_b":"There's a chic that would still date this guy, that's news!","commenter_a":"He proved himself to be an a** years ago.","post_message":"Lance Armstrong crashed his SUV into two parked cars after a night of partying and then let his girlfriend take the blame, according to police."},{"comment_id":"10153283394148984","commenter_b":"She needs to be in the big house not the white house","commenter_a":"Grill her ass !","post_message":"Trey Gowdy has invited Hillary Clinton to testify, in private, on her decision to delete thousands of emails from her private server as well as the full scope of her responsibility in the 2012 attacks at Benghazi. Let Rep. Trey Gowdy know how you feel and customize an email just for him!"},{"comment_id":"10153994674826051","commenter_b":"What a sick woman!","commenter_a":"I'm disgusted at the thought of such a thing. I hope they sue.","post_message":"This 8-year-old came home from school distraught. His dad asked him what was wrong. The boy explained that the teacher had forced him to stick his head into a bucket. Dad asked: \"What was inside the bucket?\" When his son told him, he snapped."},{"comment_id":"10153501793088837","commenter_b":"I don't care that they kissed but I think all PDA should be refrained. I won't do it in public and I don't like it when straight people do it. Save for privacy of your home. I don't mind seeing a quick kiss, but the groping is nasty.","commenter_a":"keep your private life private... and when you go to a different place be modest n respectful..carry yourselves accordingly","post_message":"UPDATE: Jordan Schaeffer still hasn't recovered from his Miami vacation when he and his boyfriend were beaten at a BK Whopper Bar in Miami Beach after they kissed."},{"comment_id":"1553570801369710","commenter_b":"The head of black panthers got robbed at gun point called police. They got his stuff back and arrested the criminal. Ben and jerry time to get your heads out of your ass. I won't buy any thing from you hope all true Americans stop buying your products let the boycott begin hope you lose millions in sales","commenter_a":"All lives matter.","post_message":"Why? Just...why"}]
