[{"comment_id":"10154402940891636","commenter_b":"Americans with guns are more of a threat than any other nation, must loose more lives with kids and their \"toys\"","commenter_a":"If he'd spent the $trillions he'd wasted on wars on so-called 'Climate Change' instead, then im sure the world would've been closer to 'normality' by now, but no, 8 solid years of bombs in the Middle-East is what you get. Why thank him for this, its given us EU terrorism.!!","post_message":"Hero"},{"comment_id":"1565531100423273","commenter_b":"WoW... I have never been to the USA, but i fear already for the Afro-americans living there now, after reading this comment (n)","commenter_a":"The ones the cops shoot, is because hey are criminals. Felons with weapons. Threatening others and getting the police called on them. All the others, is just fightin and being dumbasses. White people do that do. White felons and criminals get shot too. But since they are white, no one cares to make a news story.","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"10153153963941336","commenter_b":"***SCHEXNAYDER SPEAKS ON: HILLIARY*** ========================================= Is that the same Hil-liar-y who was fired from the Watergate Staff? The same weasel who could not find Rose Law Firm records for years? The same shrill potty mouth who said “I don’t recall” 23 times under oath to avoid answering? The same feminist who stayed with a known 30 year serial adulterer, bold liar and pure slime ball? Who lied and trashed women abused by her horndog perjurer hubby? Who wrote the book on arrogance with refusals and rants? Who, at the very minimum, enabled Benghazi? It is! And her 2015 slime update…HRC had an ILLEGAL private server for her State Dept. e mail! Hillary won't take questions -- at event honoring journalism... Drama over e-mail intensifies... Committee: 'Scheme To Conceal'... Violated 'clear-cut' State Dept. rules... Clinton Internal Cable Banned Use! Team Evaded Records With Instant Message... FLASHBACK: Hillary Bashes Bush Officials for ...","commenter_a":"It is obvious that @username and the other main stream media are supporting Hillary. After all, how many times do the public have to be told that she is running. It is apparent that you all are anxious to keep her name in the public eye.","post_message":"BREAKING NEWS: Hillary Clinton announces 2016 presidential campaign. @webpagelink"},{"comment_id":"1041013112628492","commenter_b":"COUGH ON ALL YOUR LIES BITCH! THE WRATH OF THE LORD IS COMING FOR HER!","commenter_a":"Is she still alive? Damm she is","post_message":"Well this was just revolting. Clinton cannot stop coughing during speech."},{"comment_id":"10153500482753598","commenter_b":"nothing that comes out of this woman's mouth is ever true!!!!!","commenter_a":"She is an idiot..","post_message":"Hillary Clinton Claims “All of Us Want to Fund Planned Parenthood”"},{"comment_id":"964740956976016","commenter_b":"I am glad to see someone else that sees what is happening. Right now there are 76k Islamic refugees that have arrived and continue to come. Barack Husein Obama has strategically placed them throughout the U.S. Now ask yourself, how long will it take before key cities fall to Islam within the U.S..? He knew what he was doing, and his plan is working due to tolerance and bleeding heart liberals. It may not be next year, however, in the near future, we will see more turmoil through Islam than anything else. Bullets and beans brother...","commenter_a":"Notice that the UN is NOT pushing to fight Muslim extremists so these people don't have to flee their homes? That they're trying to export them around the World instead? The reason is OBVIOUS. To create chaos and bring down western culture. Look at France and Germany's problems with the bastards..","post_message":"That was a ... BAD idea. Check it out. @webpagelink"},{"comment_id":"10153078285427217","commenter_b":"Melissa single mum? yep you can talk you trollop.","commenter_a":"Doesnt look to Australian to me. i wonder if she speaks english?.","post_message":"Thousands set out to #lightthedark 🔦"}]
