[{"comment_id":"10155094195189766","commenter_b":"F Germany! Let the Jihadis have that country! They deserve what they get!","commenter_a":"How pathetic.","post_message":"Here's a German parade with a float of President Trump raping a national icon then getting his head cut off by the same. Thanks, guys.  Credit: Instagram/aladine_saidi via Storyful"},{"comment_id":"1027028344015468","commenter_b":"Then slapped it in the face with my dick","commenter_a":"But if it was an Airman that got jumped the Marines would be applauded.","post_message":"We're on the look out for two scum bags who jumped a Phantom Fury vet in a case of mistaken stolen valor. If you have any information, please message the page, and we'll take care of the rest. Any factual information provided, leading to an arrest, will earn you a free Funker530 \"Winning Hand\" T-Shirt. ~Josh"},{"comment_id":"1879546605644644","commenter_b":"She should be in jail","commenter_a":"How is she any different that a Timothy McVeigh home grown terrorist?","post_message":"Ugh"},{"comment_id":"392468917544370","commenter_b":"He said \"unvaccinated foreigners\" caused this. Read that again... Slowly.","commenter_a":"Fran Cella I agree with Rush.","post_message":"What do you think of Rush Limbaugh's theory on the vaccinations debate?"},{"comment_id":"1676201889329258","commenter_b":"This is old news, these slimy pieces of shit should be behind bars!","commenter_a":"How is that a bombshell...? The whole thing was fishy from the beginning. It's like I fully expect more shit to come out about the Wall Street Bailout...","post_message":"They lied to us anyway."},{"comment_id":"494982004030385","commenter_b":"The towers that Donald Trump built ... Border Patrol endorses you to build that wall too, Mr. Trump ... A BUILDER ... not a destroyer ... of American liberties/freedom FOR POTUS!!! @webpagelink @webpagelink #DONALDTRUMP #POTUS #REPUBLICANPARTY #GOP #2016ELECTION #BORDERWALL #BORDERPATROL #TRUMPTOWERS #PRESIDENTIALPRIMARIES #VOTETRUMP #TRUMPTRAIN #MAKEAMERICAGREATAGAIN","commenter_a":"7% lead is good but you know that you need to win by double digits to shut ted up. IF you have any last minute secret weapons or anything you haven't used now is the time. Win NY huge and then take Cali and then proceed to destroy the liar and the commie.","post_message":"Thank you, California! I will see you soon! Have a great day - and remember - - TOGETHER WE WILL MAKE AMERICA GREAT AGAIN! #TrumpTrain"},{"comment_id":"450286948495219","commenter_b":"Jo Jo What ever bitch, I have never called the cops and never will when I wish to commit suicide I'll call the pigs. You are a statist bitch.","commenter_a":"Whats the difference? Police are thugs.","post_message":"Do You Support Our Police Over Thugs?  Comment 'yes' or 'no'."}]
