[{"comment_id":"1808975196000308","commenter_b":"This news is pretty old. ..... hanging on by a thread NBC","commenter_a":"Chris El Paisitahh","post_message":"The painter who turned Donald Trump's penis into a viral sensation says she's received death threats and alleges one Trump supporter punched her."},{"comment_id":"10153395954276051","commenter_b":"It's a deformed pig fetus.","commenter_a":"Yea right.","post_message":"When a woman found this bizarre creature in her backyard, she was completely horrified."},{"comment_id":"470896363098657","commenter_b":"That's called free speech in Obama America. Sad. I would love to see them meet their maker. Hell is going to be a busy place.","commenter_a":"They will do anything to RUB their ideas into our faces. If your part of this just keep it in your bedroom(house). Enough is enough.","post_message":"This is INSANE!"},{"comment_id":"10157734459025354","commenter_b":"Bill can't wait to be in Las Vegas were the hookers are like running water! I did not have sexual relations with those hookers!","commenter_a":"The real deplorables are the 40 something % of true idiots that are still backing the Clintons- Trump people are fed up taxpayers-","post_message":"If she's \"feeling great\" as Team Hillary claims, why isn't she campaigning? What is going on? And why can't these two ever tell the truth?!"},{"comment_id":"1036501259720547","commenter_b":"If illegals are going to remain here what difference does it make?","commenter_a":"Trump/Cruz will have my vote.... but if Trump is not on the ballot......don't expect me to cast one","post_message":"Ted Cruz explains why he thinks \"2016 is going to be an incredible year.\""},{"comment_id":"503269356530311","commenter_b":"Yes they should keep it in there country. We do not want it here.","commenter_a":"Yeah right. I don't think so. This is BS","post_message":"Legislature passed in Florida that is forcing Shariah Law on local women. These women are in trouble. Let's put a stop to this now. Do you agree Shariah Law should be banned in America?"},{"comment_id":"10154746027261350","commenter_b":"He's the Man!","commenter_a":"@username thought you'd appreciate this story.","post_message":"WATCH: 8 years. Over 2 million photos. White House photographer Pete Souza has captured some amazing moments during President Obama time in office. @webpagelink"}]
