[{"comment_id":"1527023290939672","commenter_b":"@username Jesus Christ, woman....","commenter_a":"well, Oprah, I didnt hear you claiming racist when all us white people were watching your shows and buying your magazine, and saying how great we thought you were,now u got a big bundle of money and suddenly we are racist.....well, thanks a lot for the truth of how you really feel, we will be sure not to bother you with watching your shows or buying your magazine or singing your praises anymore....what an idiot","post_message":"Oprah Claims White People Are The Cause Of Racism In America. She's lost it. What a hypocrite. Do you think Oprah is the racist?"},{"comment_id":"10153041187141037","commenter_b":"Which one Rebecca?","commenter_a":"Life begins when that egg is fertilized life begins when that baby Not a fetus has a heart beat life begins when that baby can survive outside the body. This isn't religion this is real talk","post_message":"In an embarrassing setback, House #Republicans abruptly decided to drop planned debate of a bill criminalizing virtually all late-term #abortions after objections from GOP women and other lawmakers left them short of votes."},{"comment_id":"10154416632443701","commenter_b":"He already said he's voting for her lol","commenter_a":"Ugh!! Until I hear it from his mouth I don't believe it. Why should we believe ANYTHING a biased news station and a corrupt politicians say? In fact, if you read the article, it specifically says Bernie has not announced he endorsed her. Coming together in issues is NOT the same. Mis-leading headline, once again!! Sanders has not yet said he will endorse Clinton but told reporters on Saturday that the two campaigns were coming together and to stay tuned.","post_message":"Former Democratic rival Bernie Sanders will join Hillary Clinton at a New Hampshire event on Tuesday where he plans to endorse her."},{"comment_id":"843772605660081","commenter_b":"We no longer have a president. I impeached him for tyranny & not protecting Americans & for not following our constitution. Since we have no leader, no harm fine, no foul. Hearing whst a great leader has to say like Mr N is hood hoe America","commenter_a":"Good he's not good enough to walk in Bibis shadow !","post_message":"Socialist Senator Bernie Sanders: \"The idea that the president wasn’t even consulted… that is wrong and not a good thing for our country.”"},{"comment_id":"641559742659462","commenter_b":"This woman is either a complete idiot or a pure propagandist.","commenter_a":"Oh how people forget that gore won the votes of the people","post_message":"\"Not since the American Revolution has the ruling class tried so hard and so blatantly to take away our vote.\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"524146164440320","commenter_b":"Pos","commenter_a":"Why was he even there!!!! Ugh","post_message":"I don't even know what to say."},{"comment_id":"1238174809572379","commenter_b":"Con-woman!.....criminal.","commenter_a":"And you believe that both Pence and The Wall Street journal are saying the truth!! Pence is campaigning although, as an honest Republican, he'd better stay silence. And WSJ, I have not seen it but it sounds like somebody's opinion.","post_message":"Labor Day is a time to pause and honor the hard-working Americans who have built our nation's infrastructure, and powered our economy for generations."}]
