[{"comment_id":"10154741052673812","commenter_b":"Angela, your an idiot","commenter_a":"I love the comments so far. These folks probably have no idea that we have the largest prison population in the world filled with non violent offenders.","post_message":"NEW: Pres. Barack Obama grants commutation of sentences to 111 individuals. He's now commuted sentences for 673 people - more than the past 10 presidents combined. abcn.ws/2bPG0zc"},{"comment_id":"1792810264314039","commenter_b":"Encoded in every religion is the belief of the family unit,man and women create children and society moves on. The radical notion that homosexuals can reproduce and create this dynamic is laughable and should not be lauded as some great thing for society. Man and women really do have different roles in society and its quite apparent no matter how society wants to change it. Secondly, racism is flat out wrong but we are doing a damn good job for a country so young with diverse groups of people.Religious freedom made this country and most of its core tenets come from the Christian bible and not the quran or any other text. Churches should be taxed if they become political and held to task on their beliefs in the marketplace. The past 8yrs tried to change America but Americans bit back and won.I am not talking political just basic morality ...","commenter_a":"Let's get rid of tax free status for churches.","post_message":"What a great idea. Let's end the separation of church and state. Let's convert religious organizations into political organizations. Let's funnel dark money funds raised by religious organizations into political campaigns. Let's sanction racism, sexism, homophobia and other forms of discrimination under the guise of \"religious freedom.\" This absurd and unconstitutional idea must not be passed by Congress."},{"comment_id":"10154295725641162","commenter_b":"@username Says the ignorant person. I'm not trashy, so I won't stoop to your level.","commenter_a":"Time to take the trash out. Waited 8 years for this.","post_message":"Pres. Obama *literally* drops the mic at the end of his last White House Correspondent's Dinner: @webpagelink"},{"comment_id":"1015168871918572","commenter_b":"Build the wall","commenter_a":"Bring it on, freight train.","post_message":"RT U.S. Imam “Muslims Have The RIGHT To Take The Property Of FILTHY Christians And Jews” @webpagelink"},{"comment_id":"787563944661438","commenter_b":"No more shrubs!","commenter_a":"What do you expect from him, he is a Bush.","post_message":"Democrats have a field day mocking Jeb Bush for pretending to be \"his own man\" despite the fact his policy advisors list reads like a Who's Who from the Reagan administration and those of his father, George H.W. Bush, and his brother, George W. Bush #ItDoesntFallFarFromTheTree"},{"comment_id":"1105433506199543","commenter_b":"This Woman is not Presidential Material ! Please don't listen to her lies!","commenter_a":"So true","post_message":"#NeverHillary Allen West Republic @webpagelink"},{"comment_id":"467950796728834","commenter_b":"Don't deport them-KILL THEM! They will only return if we don't . Simple truth","commenter_a":"He'll yes. Send them back were they came from. We are running out of bed sheets. Lol","post_message":"Do You Support Muslim Deportation In The United States? Comment 'yes' or 'no'."}]
