[{"comment_id":"10153165565220399","commenter_b":"The Democratic President Lyndon B Johnson, the father of the \"Great Society\" that was the rebuilding of the Urban Center for the Black communities to populate and be the new beginning for the poor blacks.. How did that workout... Detroit was setup as the model city.. As was Baltimore and Chicago... In reality, all the democrats did was move the blacks from the southern plantations to the Urban Plantations and laugh as they did it!! Here is the quote from LBJ as he did this: \"These Negroes, they're getting pretty uppity these days and that's a problem for us since they've got something now they never had before, the political pull to back up their uppityness. Now we've got to do something about this, we've got to give them a little something, just enough to quiet them down, not enough to make a difference... I'll have them niggers voting Democratic ...","commenter_a":"Blame it on anyone else but your OWN failed policies, GOP.","post_message":"The conservative blame game is in full effect."},{"comment_id":"1119178091433245","commenter_b":"She's going crazy from lack of schlong!!!!!!","commenter_a":"She is both a liar and totally stupid....and murderer.","post_message":""},{"comment_id":"594388797376563","commenter_b":"To all of you saying fair game and all that.... You are no better than the republicans that did it Michelle Obama, you should be ashamed of yourselves","commenter_a":"People of character do not talk negatively about someones' spouse nor kids. End of that discussion. With that said, I sincerely hope Carson never holds any public office at this stage of his life due to what appears to be his deteriorating mental faculties. He is running for president of my country so that is a legitimate comment of my concern of his abilities. This comment does not in any way extend to any members of his family.","post_message":"He's a candidate, so that means she is automatically in the spotlight - but do people really need to be so cruel?"},{"comment_id":"10153474525188812","commenter_b":"Is she a Mormon? Cause those kinds believe differently.","commenter_a":"This is not ok!! he has said God made him wrong, God is NOT a liar and He makes no mistakes....repent cause looking like you made a true blasphemy against God, please don't comment ignorance, if you have an issue take it to God.....","post_message":"NEW: Meet Caitlyn Jenner -- formerly known as Bruce Jenner: @webpagelink"},{"comment_id":"1024212657594017","commenter_b":"Your Emperor said himself 22 times on record that he doesn't have the power to do this. Game over.","commenter_a":"@username, President Obama has only threatened Veto if the try to screw his Immigration E.O.s, which by the way are Constitutional, your party is still playing their very dangerous game of obstructing everything President Obama does. As for your erroneous statement about the First Family's Christmas vacation, I will enlighten you as to the fact that other than Secret Service detail, they paid their own vacation expenses. The taxpayers always pick up the tab for security and use of Air Force One for ALL Presidents while they were in office. Now you go research!","post_message":"Republicans have only been in control for a week and already they are picking an unnecessary political fight that risks shutting down the Department of Homeland Security and endangering our security. Republicans should stop playing games and pass a clean bill to fund the Department of Homeland Security because the pointless, political bill passed in the House today will not pass the Senate.   House Republicans voted to tear families apart and deport young people who came to this country as babies. Tearing families apart does nothing to secure our borders, fix our broken immigration system or strengthen our economy.   This is not a game and it is time for Republicans to take their responsibility to govern seriously, instead of playing to the most extreme voices in their party."},{"comment_id":"10153370779851094","commenter_b":"The key attraction is hate and greed from the 1%ers and the few others who will complain we made a mistake were on rationing due to war in Syria Making America Great the trump way hahahah!","commenter_a":"People love to be dominated and abused.","post_message":"Is Donald Trump's candidacy a short-term spectacle or a national nightmare in the making? Mark Karlin discusses the dangers of writing off the billionaire's current electoral efforts."},{"comment_id":"10153718777033690","commenter_b":"Why don't the Saudis and Qatari take them all. The are wealthy nations with more real state than Europe. We definitely don't want them here in the US we have enough dealing with illegals coming from our southern border...!","commenter_a":"Take 30 seconds to sign (and possibly share) this petition asking the US government to take in 65000 Syrian refugees. Germany is expected to accept 800,000 refugees this year, while the US has accepted less than 1,000 thus far. Let's do a small part to encourage the U.S. government to be socially responsible. This is a humanitarian crisis and the Syrian refugees have nowhere to go. You can vote no matter where you are from. @webpagelink","post_message":"\"The world sees Germany as a country of hope and chances,\" German Chancellor Angela Merkel said at a news conference last week.  Despite all the positive energy, however, some observers are questioning how the tens of thousands of newcomers, many of whom are conservative Muslims, will integrate and adapt to German society."}]
