[{"comment_id":"10153182690520667","commenter_b":"Good grief","commenter_a":"Eric Stewart lol","post_message":"\"This game should not have been played at the airport.\""},{"comment_id":"940305309340143","commenter_b":"Muslims should be ban from Guns & Knives !","commenter_a":"Nice sentiment, but It'll never stand. If People can be forced to bake a cake against their beliefs, the muslum-loving bunch in D.C. won't allow this!","post_message":"\"I will not arm and train those who wish to do harm to my fellow patriots.”"},{"comment_id":"10155280506710329","commenter_b":"Things real vaginas eat","commenter_a":"I read that as \"vagina\" and then saw a picture of the cupcake looking thing...didn't think twice until I read the caption again. =)","post_message":"It's tastier than you think it is."},{"comment_id":"404730193048608","commenter_b":"Go back to your own country and suck off your own people!!!! Get out!!","commenter_a":"How about dog food it has no bacon in it.","post_message":"This group wants a low price halal food shelf..."},{"comment_id":"10156069283810354","commenter_b":"@Kristin ... \"you serious Clark?\" is a quote from the movie Christmas Vacation : )","commenter_a":"Well, when schools in a Tennessee district are banning the USA flag, why not the gay pride flag?","post_message":"“...police reportedly confiscated a gay pride flag…” Will the Left ban the gay pride flag now?"},{"comment_id":"10153903118333690","commenter_b":"Israeisl go there with American pasports","commenter_a":"Donald Trump need to stop Americans going to Muslim Countries whether it,s visit or work","post_message":"US Republican front-runner Donald Trump wants to ban all Muslims from entering the United States. Elsewhere in the world, Tuesday marked the 50th anniversary of the Race Relations Act in the UK, which outlaws discrimination on the grounds of colour, race, ethnic or national origin. So, how has racism changed over time?"},{"comment_id":"1022015544612032","commenter_b":"lol these pansies lmao","commenter_a":"Trump is a honest president Obama and Clinton's can go way impeach Obama.","post_message":"BREAKING: Hillary Supporters Threaten To Kill Trump Electors Oath Keepers Response Is EPIC Electors are getting death threats from Hillary's and Obama's THUGS. That's TREASON! Support the Oath Keepers!"}]
