[{"comment_id":"10154940269859614","commenter_b":"Sorry @username but there is no place for white gangs here in California . Many Latino gangs are backed by dangerous cartels. White racist trailer trash should lay low or move to another state and spread their hate. If they try to Lynch a Mexican or African American, they will get decapitated.","commenter_a":"I know I may sound vulgar for saying this but they better not pick fights with the wrong people here they will get shot at lol","post_message":"A white supremacist gang known as the SFV Peckerwoods, which authorities say has operated at three homes close to schools and a library, is the target of L.A. city prosecutors and LAPD.  'We're now fighting to prevent white supremacist gangs from infesting neighborhoods. They bring with them  this toxic mix of violence and crime and hate,' the L.A. city attorney said."},{"comment_id":"10153533239272464","commenter_b":"Dream Team? Cruz/Fiorina Gowdy - AG Carson - Sec HHS West - SecDef Rubio - Sen Maj Leader Issa - House Maj Leader","commenter_a":"Protestant Christian liberty to be exact!","post_message":"We’re a nation that was founded on religious liberty.  Stand with us to defend it: @webpagelink"},{"comment_id":"10153666245398984","commenter_b":"All this just so the Dems can have more illegals to for for them....Could Trump be more dead on?","commenter_a":"Thank Obama for all these murders, he is the one responsible for letting thdm in the country!!!","post_message":"This is a horribly tragic story, especially since it involves an illegal who should never have been in this country. Please join us in sending thoughts and prayers to the families of the victims.  Are you against amnesty for illegals?"},{"comment_id":"10153798375353984","commenter_b":"She looks like saying anything about anything .she's a criminal herself.","commenter_a":"She has been untruthful about alot. Wonder about the taxes for them. Why is the government supporting their foundation. Need to separate them from government.","post_message":"Hillary just got caught admitting she would do something BIG to guns in America and the NRA if elected, and it's going to have conservative's heads spin.  Do you think a Hillary Clinton presidency would be one of the worst things that could happen to America?"},{"comment_id":"683824238474821","commenter_b":"STFU you pussy. Why don't you go join ISIS.","commenter_a":"Really? This is just pathetic. Who in their right mind would even think if suing someone because they offered a book bible or not. The soldier is not fit to be in the military. All he had to say was he was an atheist. Unless he is to ashamed too.","post_message":"An Atheist soldier is suing a Christian soldier for recommending the bible. This is blown way out of proportion. Let's backup this christian soldier. Can we get 50,000 'LIKES' for this soldiers commitment to god?"},{"comment_id":"10153436372151337","commenter_b":"But Mariah has the booty","commenter_a":"The only reason this game sells is because of kate upton's nice tits. Big mistake","post_message":"A NEW 'FACE': Those Game of War - Fire Age commercials will no longer feature Kate Upton..."},{"comment_id":"10152763984611051","commenter_b":"they need to fire those officers, charge them criminally and hope she wins the lawsuit","commenter_a":"I'm thinking alot of you didn't read the article. Female police officer, in Canada, one month on the job, immediately suspended from the job after the attack, has since resigned.","post_message":"This officer arrested two people: a drunk teen and a rapist. She put them in the same backseat but only handcuffed one. Guess which one."}]
