[{"comment_id":"10156121117545354","commenter_b":"Go after his sorry ass also","commenter_a":"Kerry is a fool. I respect Gowdy. Great research Elizabeth ...","post_message":"You need to see this..."},{"comment_id":"10152608268042452","commenter_b":"I know right she's thick not plus size","commenter_a":"She doesn't look so plus to some of us who are","post_message":"There's a big change coming to Sports Illustrated's swimsuit edition. For the first time, the magazine will feature a plus-sized model on its pages.  Model Ashley Graham will appear in a campaign for 'Swimsuits For All', heralding a new chapter in the magazine's famous swimsuit issue.  So what do you think about a plus-sized model gracing the pages of SI? A sneak peek tonight at 11 from ABC7 Eyewitness News. abc7.la/1zifFNK"},{"comment_id":"10154520499329705","commenter_b":"Silly women. Tricks are for kids. Everyone knows women aren't real people. We should go back to the original constitution. Only men should vote and black guys should only count as 1/3rd a vote. I think Trump can help make that happen #Trump2016atleastIdidntrapethem","commenter_a":"More mainstream media hype to distract from the real issues. Wake up people.","post_message":"The Times to Donald Trump: Make. Our. Day."},{"comment_id":"10155902934120294","commenter_b":"I agree, if its fact its clearly ok to say it. That chick had no place in that store","commenter_a":"They said it loud enough for her to hear. She heard it and it hurts. Just be kind. If you can't say something nice don't say anything.","post_message":"This woman knew what she had to do after the hurtful conversation she said she overheard between a teenage girl and her mom at Old Navy."},{"comment_id":"10153165727051770","commenter_b":"No to Muslim Migrants..call congress..made four calls today..totally agree..Europe is in chaos..rapes and violence..and the media does not talk about it","commenter_a":"Yes sir, exactly what we need. Thank you for caring for the true Americans.","post_message":"BREAKING: Donald J. Trump calls for a moratorium on allowing Muslims to enter the United States.  'Until we are able to determine and understand this problem and the dangerous threat it poses, our country cannot be the victims of horrendous attacks by people that believe only in Jihad, and have no sense of reason or respect for human life.'"},{"comment_id":"10155119419651320","commenter_b":"Looks pumping","commenter_a":"THE ISSUE IS NOOOOTTTTT MUSLIM!!!!!","post_message":"Democrats hold an anti-Trump protest in Washington D.C."},{"comment_id":"10153813340919342","commenter_b":"I am also. But unfortunately not all women have that same luxury.","commenter_a":"They don't do thorough background checks?!!!!!!! My heart hurts every time I see stories like this! That's why I'm a stay at home mom. Can't trust anyone now a days.","post_message":"A parent's worst nightmare comes true. #abc13"}]
