[{"comment_id":"1125221904203952","commenter_b":"Wow...you can't judge an entire religion by the actions of a few?!!! wow...where have we heard that before? yet...it goes ignored, until that line of thinking works for the christian cult members....then its supposed to be real........nice one cindy! this is just more proof that there is no such thing as \"GOD\"....or if one is up there, he is a mean spirited, vindictive SOB and i want nothing to do with him","commenter_a":"I hope all these co called Christians that praise what has happen have something awful happen to them Human beings were killed it does not matter who or what they were. You poeple should be ashamed","post_message":"This is not how decent people react to tragedy."},{"comment_id":"10153875546363352","commenter_b":"Smh girl please...","commenter_a":"Let's see how much he's kicking out for a settlement","post_message":"RAPPER BRUTALLY KICKS FEMALE FAN BECAUSE SHE TOUCHED HIS SHORTS. REALLY? #DISGUSTING"},{"comment_id":"10156612932690354","commenter_b":"Washed up schmuck","commenter_a":"The difficulties were not due to him being black.","post_message":"WATCH Geraldo Rivera blame, well, YOU for Obama's failed presidency!"},{"comment_id":"10154653727828812","commenter_b":"Don't Feed the Trolls","commenter_a":"Oblunder doesn't have a problem spending other people's money. A true Saul Alinsky Elitist.","post_message":"Ellen DeGeneres, Magic Johnson, NBA star Grant Hill, and Hollywood heavyweight George Lucas were among the party-goers at President Obama's blowout birthday bash at the White House Friday."},{"comment_id":"10154126859997293","commenter_b":"They why are these alligators thriving in florida. They love the heat","commenter_a":"Why is this news? It's 90 degrees outside in a dense crowd and someone is hot. Big deal. Trump is a cold-blooded snake so I'm sure he could stand out there forever.","post_message":"Hillary Clinton was diagnosed with pneumonia before falling ill at the 9/11 memorial service."},{"comment_id":"1333179716775079","commenter_b":"Um isn't that the parents job? How is this not just instantly obvious?...","commenter_a":"Pssst......they only care about the fetus until the second it is born. When it is a child they lose all interest. They don't feed, clothe, vaccinate, educate, protect, nurture, house, inspire, enrich or love it.","post_message":""},{"comment_id":"521952154659744","commenter_b":"When pigs fly, I'll believe it when I see it!","commenter_a":"Thank you for finally thinking of Americans and our safety !","post_message":"BREAKING..."}]
