[{"comment_id":"547874932072371","commenter_b":"This bitch needs to get ready for jail!!!","commenter_a":"I think someone is throwing. Dinner !!","post_message":"WASH POST PAGE ONE SUNDAY: Hillary begins laying plans for White House agenda..."},{"comment_id":"1391779917508701","commenter_b":"lol white girl troll","commenter_a":"The confederate flag, rebel flag doesn't stand for slavery nor against blacks. But it's OK for them to tote around black panther crap which is known as a black supremacy group?? Get a life and find something meaningful and real to whine about.","post_message":"The House has voted to ban the display of the Confederate flag on flagpoles at Veterans Administration cemeteries."},{"comment_id":"895447730553834","commenter_b":"You can both GFYS , typical ignorant trash","commenter_a":"Fuck the Oneida nation","post_message":"Mayor Patrick O'Connor said the long-time village seal shows a historic wrestling match between village founder Hugh White and an Oneida Indian that figured into good relations between early settlers and the Oneidas."},{"comment_id":"10153412068770667","commenter_b":"Ban all muslims from America!","commenter_a":"Muslims are hitting Facebook and other social media to proclaim that Islam is a religion of peace again... The only difference between \"moderate\" Muslims and radical ones is the distance from the suicide vest.","post_message":"BREAKING: Three explosions have left more than 30 dead and dozens injured at an airport and subway station in Brussels. Officials expect the death toll to continue to rise."},{"comment_id":"10154099893448132","commenter_b":"all she has to do is prove it, Will she?","commenter_a":"This is so pathetic!","post_message":"Donald J. Trump and Megyn Kelly have quite a history."},{"comment_id":"1755814751326418","commenter_b":"Not my words but totally agree. Found this on another FBook site. VOTE YOUR CONSCIOUS NOT YOUR PARTY! Don't be influenced & persuaded, been going on far to long. WHY WOULD YOU VOTE FOR HILLARY WHEN.... Most cover ups & lies by a family in America's history. If you are #Gay, why are you voting for Hillary when she wants to bring in 1,000's of refugees that believe all Gays should be executed? Criminalizing Christians who don't believe this? If you are #Black, why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood when they want to abort as many black babies as possible. Exterminate the black race because they are like \"weeds\". Most of those clinics are in Black neighborhoods? If you are a #Christian, why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who dedicated his ...","commenter_a":"Can even stand to listen to her! *wave*","post_message":"Watch: Hillary Clinton speaks during a campaign rally."},{"comment_id":"990316741094881","commenter_b":"Fuck her","commenter_a":"Never heard of her.....moving along now","post_message":"Was she right??"}]
