[{"comment_id":"985973531519425","commenter_b":"All republicans should stand behind \"the people's \" choice!!!","commenter_a":"Who needs him I hope he gets fired","post_message":"What do you think? Is it too late? @webpagelink"},{"comment_id":"1113471052062455","commenter_b":"Spot on Allen West ... that's Donald Trump","commenter_a":"\"I want to raise a generation of young people who are devoid of conscience, imperious, relentless, and cruel.\" - Adolf Hitler Obama and Hillary read this and are following it. Hillary did her college thesis on this topic. Now you can add Bernie Sanders to the mix. From Alinsky's Book, \"Rules For Radicals\": How To Create A Socialist State by Saul Alinsky There are 8 levels of control that must be obtained before you are able to create a social state. **The first is the most important.* *1) Healthcare Control healthcare and you control the people* *2) Poverty Increase the Poverty level as high as possible, poor people are easier to control and will not fight back if you are providing everything for them to live.* *3) Debt Increase the debt to an unsustainable level. That way you are able to increase taxes, and this will produce more poverty.* *4) ...","post_message":"Allen West Republic @webpagelink"},{"comment_id":"10153892633433812","commenter_b":"STFU","commenter_a":"Sex is meant for procreation. If you don't want kids the only sure way is to not have sex. Birth control, even when packaged correctly is not 100% I have had multiple friends become pregnant while properly using birth control. Stupidest reason to sue ever.","post_message":"More than 100 women are suing Qualitest Pharmaceuticals after they say they got pregnant while taking incorrectly packaged birth control pills."},{"comment_id":"10153078285427217","commenter_b":"Melissa single mum? yep you can talk you trollop.","commenter_a":"Doesnt look to Australian to me. i wonder if she speaks english?.","post_message":"Thousands set out to #lightthedark 🔦"},{"comment_id":"1108096825935519","commenter_b":"Lol...dumbass","commenter_a":"Funny.","post_message":"Anybody who holds up a cop car at gunpoint isn't the brightest person in the world. This thug, however, was especially dumb... he didn't see what was behind him. This ended REALLY badly... and it was all caught on video."},{"comment_id":"10153129588721051","commenter_b":"Bitch, the only person rotting is you.","commenter_a":"The US has went to hell. Gays allowed, and 10 Commandments comes down. Shameful.","post_message":"Should this Ten Commandments statue stay up?"},{"comment_id":"10152851523876680","commenter_b":"Exactly. Just because he is being observed by being a dad doesnt mean anything negative. Bush wasnt...why? Because his daughters were already grown no reason to be.","commenter_a":"Still have no clue why all of the media treat the Obamas like some sort of Kardashian reality tv celebrities. Sick!","post_message":"Barack Obama drives a bumper car with Sasha Obama, who turned 14 today, at the Iowa State Fair in August 2007."}]
