[{"comment_id":"10154303006941636","commenter_b":"Ted I'm pretty sure that the home grown rapist far out weighs the immigrant/refugee rapist...all you people blaming all crime on immigrants and refugees must have been living in lala land cos I can't speak for Sweden but all of those crimes were in the U.K. Way before this flood of people hit britains shores","commenter_a":"Nothing to do with wanting their sovereignty back and not being dictated to by unelected EU bureaucrats? Good grief, this page is a shocker!","post_message":"According to a new study"},{"comment_id":"756073464525834","commenter_b":"The best part about all these whining Christians & their rhetoric to defend Christ against a money hungry corporation(which bye strives to destroy mom& pop coffee shops) when ppl are already starving to death or hooked up on drugs. Your Christmas was actually started by Constantine, centered around & similar to pagan holidays to make the transition to Christianity easier. Constantine was actually a pagan until his death bed to where he rejoiced unto God and saved his soul. Why don't you silly Christians who so vehemently judge and live so unlike jesus did do some research on the Christmas tree... It's also pagan, right down to the star on top to the ornaments around it. America was founded on freedom of religion, but that only seems to apply if it's Christian. And yes, the indigenous natives were massacred by bible carrying spaniards, priests, English, Dutch etc. It doesn't matter ...","commenter_a":"This is my last bit about the god forsaken red cups (no pun intended), and thats it. And please read before commenting. Starbucks, is not \"catering to people outside this country\"... Starbucks is a free enterprise, and not obligated to tell you Merry Christmas, in fact, they are not obligated to even do something for the holidays. There are many born and raised here with different faiths and they ALL believe in god, just not Christmas. For example the Jewish believe in God whole heartedly, just not Jesus, which Christmas is about. They also celebrate Hanukkah this time of year. Christianity is not even the first religion in this country, and Christians came here and slaughtered the indiginous for not being Christian, so it's not surprising they still don't accept other religions or respect them. That being said, businesses SHOULD absolutely have the right to say Merry Christmas If they ...","post_message":"Oops doesn't really cover it."},{"comment_id":"10150832975979963","commenter_b":"Something tells me that the Bulletin of Atomic Scientists probably knows more about \"international nuclear weapons relations\" than you do.","commenter_a":"Anyone who thinks that this is \"Trumps fault\" doesn't know much about international nuclear weapons relations and the money exchange that goes with it, be it legal or not. Trump wasn't president then....","post_message":"According to the Doomsday Clock there's an increasing probability that the world will observe nuclear conflict."},{"comment_id":"10154467754523010","commenter_b":"@username .... Look who's talking?! Trump got his mistress pregnant, that's were his second daughter came from. Malania said, in her plagiarized speech, that she Trump had been together 18yrs....Trump was still married to wife number two at that time! Children with three different women!!!!! Can you imagine what the Republicans would be saying, if that was Hillary?! Hypocrites!!","commenter_a":"He and Bill should hang out since they both cheated on their wives multiple times. Nothing like knocking up the maid. #NeverHillary #ImAgainstHer #VoteTrump","post_message":"Not quite hasta la vista to the Republican party."},{"comment_id":"1793905347490203","commenter_b":"Plus she is nasty and disgusting","commenter_a":"This young lady is very talented, but she has no clue what this country is all about. It happens when you grow up with the world revolving around you. She has no idea what she supports! Or Who!","post_message":"Miley Cyrus is begging people to vote for Hillary Clinton"},{"comment_id":"10150782154259999","commenter_b":"I'm a woman and I am voting Sander's. Actually MOST women I know are voting Sander's. I won't vote for Hillary. I'm done with the Clinton's.","commenter_a":"Cue 8,000 virtually identical comments by Bernie Bots, clogging up the comments so no one else can be heard. All nearly identical, all arriving at the same time. Almost like some sort of organized social networking plan. Feel the burn.","post_message":"\"Some folks may have the luxury to hold out for the perfect, but a lot of Americans are hurting right now, and they can’t wait for that. They need the good, and they need it today,\" Hillary Clinton said today."},{"comment_id":"1403734329688680","commenter_b":"these mobs are planed and paid for by the elites and must be stoped","commenter_a":"These people need to be arrested. This is not peaceful protest. It's criminal.","post_message":"BREAKING: Trump Official RUSHED To Safety After What Mobb of Attackers Just Did To Her Outside Child School"}]
