[{"comment_id":"10154953238254497","commenter_b":"Cthulhu. Keeping it super old school.","commenter_a":"@username Cthulhu or FSM?","post_message":" haste, before His Holiness is torn asunder by the dark horror."},{"comment_id":"1033502426742811","commenter_b":"True!","commenter_a":"That cop had been dismissed from another police dept for being 'too immature to handle a gun' and lack of ability to follow orders. Fact.","post_message":"BREAKING: a grand jury has chosen not to indict the cop who murdered Tamir Rice in cold blood. Something is seriously wrong with our criminal justice system when a cop can kill a fully innocent kid with impunity. Read more here: @webpagelink Image by Occupy Democrats, like our page or more."},{"comment_id":"983273481708073","commenter_b":"She's just a lying skank!","commenter_a":"You need to be investigated from the beginning to the end","post_message":"You know Hillary is in trouble when her fellow Democrats stop protecting her!"},{"comment_id":"1160655937308596","commenter_b":"Many Muslim women are sick of being told what they are and what they can be from western women who have no clue about their culture, that's why Muslim Feminism had to develop on its own instead being part of the bigger movement, _that's_ sad if you ask me. Feminism should be about equality not about following one group of women's notion about what you should look, feel or talk like.","commenter_a":"I'm seeing a lot of diversity in the Muslim community about the concept of World Hijab Day (non-Muslim women wearing the hijab for a day in solidarity). Would love to get your thoughts on whether it's cultural appropriation, or upholding the more conservative aspects of your faith. I did participate last year, but not sure if I will again.","post_message":"Her \"Ask a Muslim\" booth was a huge success! - Parker Molloy"},{"comment_id":"10153224960603984","commenter_b":"oh boo fuckin who leave bitch and take your husband with you","commenter_a":"She's out of touch on everything!!","post_message":"People are furious, and I can understand why. Do you think Michelle is an out of touch First Lady?"},{"comment_id":"934685129905679","commenter_b":"I am a feminist and proud of it.","commenter_a":"This is feminism.","post_message":"Ellen Page has a point here, ya know... Thanks for the photo, MTV Act!"},{"comment_id":"10154755276262619","commenter_b":"Heads up!","commenter_a":"Natanyahu is not an Orthodox Jew. He is a secularist.","post_message":"The Israeli Ministry of Defense Missile Defense Organization head Yair Ramati has been dismissed from his post due to grave security violations."}]
