[{"comment_id":"1648797488740697","commenter_b":"Sadie is a lady Miley is a joke!!","commenter_a":"LOVE LOVE LOVE!","post_message":"America needs more Sadie Robertson and less Miley Cyrus."},{"comment_id":"10153825778449877","commenter_b":"So what now only black women have abortions! GTFOH!","commenter_a":"No words. Just disgust","post_message":"College Newspaper Cartoon Depicts Black Woman Being 'Late' for Her 'Abortion.' Oh, and she was wearing a Black Lives Matter T-shirt. Read the full details below. Grio fam, what in the world is going on here?"},{"comment_id":"736296849894226","commenter_b":"POOR GAS ON THEM AND LET THEM BURN","commenter_a":"He should have the same thing done to him.","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news. No riots, no protests, no media coverage. Do you think he should be charged with a hate crime?"},{"comment_id":"10153598643443812","commenter_b":"Hmmm....will it help us grow perfect women with nice titts?","commenter_a":"Cristian Reyes","post_message":"World's largest atom smasher detects new kind of subatomic particle called the 'pentaquark' -- a new form of matter: @webpagelink"},{"comment_id":"10156112188370354","commenter_b":"this woman is an idoit drinking kool aid","commenter_a":"This woman looks exactly as Bruce Jenner, do we care what she says??? Nooooo.","post_message":"Enforcing the law fairly and equally is not \"beating up\" on poor illegal aliens. Rather, it is honoring the Constitution and respecting those who have respected America enough to LEGALLY apply for citizenship and LAWFULLY wait in line. Face it, Leftists: you're losing--and you know it."},{"comment_id":"10154208723663984","commenter_b":"The Clinton's are the world's greatest LIARS and they do not give a Damm about you fools who will vote for her ,this woman is a evil woman , but her sheep are if the dumbest people in this country.","commenter_a":"Boy, the \"free\" press keeping her back. Boy, they do the same for the Republicans, the only difference they erase the good comments.","post_message":"A CBS reporter asked Hillary a question about the Brussels attack, but then after she said this 1 thing they IMMEDIATELY cut her off and cut to commercial. This is absolutely nuts."},{"comment_id":"754556321401612","commenter_b":"Tie them by their ankles to a fast moving train!!","commenter_a":"This is the mine set of Muslims. That it's ok . Send their asses back","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News They deserve much worse than this. What do you their punishment should be?"}]
