[{"comment_id":"966202806772801","commenter_b":"#dumbasses","commenter_a":"Robbie Raul Markosyan","post_message":"Kate Upton among scores taking part in #HoldACokeWithYourBoobsChallenge for breast cancer... unaware the trend ISN'T raising money"},{"comment_id":"897302730329476","commenter_b":"and youre famous for? ABSOLUTELY NOTHING","commenter_a":"It's funny how Your ugly dress made you famous more than your music did !","post_message":"#thedress girl speaks: 'It's madness. I feel like I'm living in a dream'"},{"comment_id":"1014316725248091","commenter_b":"Sondra, you sound like someone who doesn't know what she is talking about. For many women PP is the only place where they can get cancer screening. PP provides birth control. How dare you assume that you get to make the health decisions for even a single person. Shame on you.","commenter_a":"Mr. Bera, the real \"consequences\" of ending funding to PP would be an end to PP altogether..they should be brought to justice for their depravity and disregard of the law by selling baby parts-- we taxpayers have been funding them TWICE OVER for years and are sick of their lies are many other reputable womens health centers you know all of this but are afraid to vote your conscience.I'm really ashamed of you..and if you are a pyhsician as you claim, you are not a humanitarian nor a normal human being.","post_message":"As one of the few practicing doctors serving in Congress, I understand the real consequences ending federal funding to Planned Parenthood would have for patients. That’s why I stand with Planned Parenthood and will not vote to defund it. We need to keep politicians out of the exam room and instead work together to make sure women have access to preventive health care → @webpagelink"},{"comment_id":"10154435373078279","commenter_b":"@username shut the fuck bitch","commenter_a":"Unbelievable. Marissa Alexander gets 20 years behind bars for firing a warning shot at her abuser where no one even got hurt, and the same prosecutor can't get a child-murdering lowlife scumbag like George Zimmerman put away.","post_message":"Angela Corey had been dubbed the \"worst\" and \"cruelest\" prosecutor in the United States."},{"comment_id":"10153999056241323","commenter_b":"She is pickled she will last a long while yet","commenter_a":"And when the Queen kicks the bucket we will have our money overhauled yet again. How much does it cost to overhaul the money all these times?","post_message":"To be eligible to appear on the new bill, the woman must be Canadian, either by birth or naturalization, and she must have died at least 25 years ago."},{"comment_id":"10153976851960950","commenter_b":"Hillary husband, Bill Clinton, makes Bill Cosby look like a Saint.....","commenter_a":"Bring it baby. I used to feel sorry for Melania, but she is as bad as her bully pervert of a husband. All Trump cares about is his money. All Melania cares about is Trump's money.","post_message":"She is demanding a retraction and apology."},{"comment_id":"10153992733094726","commenter_b":"Beautiful, smart elegant lady","commenter_a":"Let Ivanka rest for a while . she will have a new Baby soon .","post_message":"Trump's wife Melania steps into the spotlight, joining his daughter Ivanka"}]
