[{"comment_id":"10153846448114087","commenter_b":"No matter what I will never vote for Hillary!","commenter_a":"If, and that's s big if, she ousts her you can guarantee she'll give/get her some other position of influence and big money either public or private sector.","post_message":"Bernie Sanders has put ousting Democratic National Committee Chairwoman Debbie Wasserman Schultz at the top of his list of demands, putting pressure on Hillary Clinton to get rid of an ally accused by her rival’s supporters of tilting the race in her favor."},{"comment_id":"992371087511918","commenter_b":"So she is only part Native American because you think they must have been raped? Um.. I am part Native American because my great grandmother was savagely raped by a Native American, so please tell me how innocent and peaceful they were. And yes illegals now are a different story. Whether you like it or not, when Europeans came here it was a hostile takeover. There was a war. Which the Native Americans lost. So if illegals want to wage war, than they can bring it on. If not, they can go the he'll home to whatever country they came from. I honestly don't care which country it is.","commenter_a":"If Native Americans had @username \"Illegal European scumbags have yet again raided local villages, they crashed their boats into our shores, raped our women and children and then killed them for not turning into Christianity..\" #Talk about several overdue sentences","post_message":"Margarito Quintero didn’t have a license and was in the United States illegally. He was previously arrested and deported in 2008."},{"comment_id":"10152887029056336","commenter_b":"The yatahays are the illegals!!!","commenter_a":"We're all immigrant, except the native Indians.","post_message":"JUST IN: In a 237-190 vote, the House has voted to overturn President Obama's executive actions on immigration that extended protections to millions of people in the US illegally. @webpagelink"},{"comment_id":"435485493243158","commenter_b":"Criminals don't get one...why require them for law abiding citizens","commenter_a":"i cannot believe how brainwashed and idiotic everyone is, you actually believe concealing more weapons, allowing no permits and actually believing it is the right thing to do because its in your constitution is fucking ridiculous, lets see how many more kids are massacred in schools now that shooters can conceal their weapons","post_message":"Good idea?"},{"comment_id":"1140463419377942","commenter_b":"Oh a gold dress, is that all? I thought maybe her penis was showing through her dress! Ha!","commenter_a":"For what she spent on that dress they could let all of the Afghanistan veterans keep the Enlistment bonuses they received 10 years ago instead of charging them $650 each a month until the entire $10,000 plus interest is paid back!","post_message":"It was Michelle Obama's final state dinner, and the first lady was trying to make a good impression. However, people noticed something wrong with her dress in a big way... now, it's making news everywhere. This is sick... it shows you who the Obama's REALLY are."},{"comment_id":"10153041862786045","commenter_b":"I also like all those racist flags in your picture reference there.","commenter_a":"What should they expect, the flag does represent slavery and Jim Crow. But I guess folks must cater to the idea that \"Southern Heritage\" must only be represented by the confederate battle flag and not the U.S. flag.","post_message":"Controversy continues to surround the #ConfederateFlag. Two men in Decatur say they were fired from their jobs at Turner Industries because they refused to remove the Confederate Battle Flag from their personal vehicles."},{"comment_id":"10153233109924170","commenter_b":"DEPORT ALL ILLEGALS !!!!!! Put Americans back to work !","commenter_a":"hes an idiot","post_message":"Chuck Schumer is doing his absolute best to play the blame game in regards to his terrible immigration bill. ...And it's all about paving the way for 2016 race-baiting."}]
