[{"comment_id":"10155262901820231","commenter_b":"Fraud!","commenter_a":"He's just a man and not god","post_message":"Social media: 1  Ceflo Dollar fundraising for a private jet: 0"},{"comment_id":"10153459873801756","commenter_b":"She's a Jew deliberately provoking hatred between Christians and Muslims.. Ask yourself why...","commenter_a":"I have to say I thought more people would be for protecting speech from violence, since we're in the liberal west and all, but apparently not. Paris gets shot up and the claim is to be \"je suis charlie,\" Texas gets shot up and \"they were asking for it.\" Makes no damn sense. You're either for the rights of us all to speak without fear of being shot, or you're not. I went to a public school and I learned that Voltaire quote. Small minded terrorists of an idiot ideology that requires giving your life to kill anyone who mocks your \"sacred\" beliefs. What a load of bullshit.","post_message":"The group's executive director runs a website called Atlas Shrugs, which The New York Times says \"attacks Islam with a rhetoric venomous enough that PayPal at one point branded it a hate site.\""},{"comment_id":"10154874909449369","commenter_b":"No actually one of my best friends is a gay black woman. She knows I love her.. she is just not childish enough to allow difference of vote affect our friendship.. we have had since we children. :) Bcuz she is grown.","commenter_a":"I have grown to respect Mike Pence. Great choice!","post_message":"Vice President-Elect Mike Pence is taking over President-elect Donald Trump's transition team, replacing the former chair of the operation."},{"comment_id":"529925163864730","commenter_b":"Kool","commenter_a":"This poor (morally) man reminds me of the KKK and how most whites were offended and embarrassed by them in the early 60's.","post_message":"Al Sharpton's career is going to come to a screeching halt after this.  His own people are turning against him. Now is the time to strike.  Can we get 30,000 'LIKES' for Al Sharpton getting fired?"},{"comment_id":"436426606545633","commenter_b":"Women are too smart for an old fish tale lol","commenter_a":"Good job, Mrs. Wifey","post_message":"This is great..."},{"comment_id":"10153629118828132","commenter_b":"She is a moron...","commenter_a":"No she did not do the right thing,she was very disrespectful,rude,nasty.","post_message":"Is Jennicet Gutierrez a heckler - or a hero?"},{"comment_id":"10154585681040329","commenter_b":"Dan Mulligan","commenter_a":"Alan Baird","post_message":"This is how you get strong enough to crush a guy's skull. // Game of Thrones"}]
