[{"comment_id":"1471521346221666","commenter_b":"@username I cannot in this day and age believe that someone as backwards uneducated,unread as you still exists. You know all that crap has been debunked yet you continue to stream it. I don't know if you are a troll or not but there is no brain matter in your skull.","commenter_a":"He is just a rich piece of trash. Money can buy you tons of stuff, but it cannot buy you decency, morals, health or happiness.","post_message":"It just keeps getting worse!"},{"comment_id":"614399705409669","commenter_b":"@username NO ONE IS AS CORRUPT AS SLICK WILLY & SLICK HILLY!","commenter_a":"If Trump has done anything he has brought attention to the corruption in government!! Old man Bush cannot stand that Baby Jeb was soiling his diaper on the debate stage....it's all about $$$$ & the fact that the Clintons charged $250,000 for their fundraiser the other night should make hard working taxpayers sick!","post_message":"Kathleen Kennedy Townsend says former Republican President George H.W. Bush told her he's voting for Hillary Clinton."},{"comment_id":"980669235328527","commenter_b":"That is exactly what they should do no money","commenter_a":"I do not know who those three boys are but they sure made me a proud American--What angers me with these Administrators do not care that the cemeteries are full men and women who fought and died for what that flag represents--I with @username","post_message":"Tennessee School District Bans All Flags, Including the American Flag (VIDEO)  @webpagelink"},{"comment_id":"10155015262498690","commenter_b":"Yes why give the terrorists hope? As soon as Obomber gets out, terrorist support will weaken dramatically.","commenter_a":"If 9/11 deserves a moment of silence, than The #Syrians & #Palestinians deserve that we never speak again...","post_message":"Does Assad have enough manpower and weapons to protect the territory his forces have retaken while at the same time trying to win back more areas?"},{"comment_id":"10153196939420047","commenter_b":"Remove yourself from The United States of America. You Don'T America's Ways. LEAVE!!!","commenter_a":"It probably should be removed. Does a nation that promotes the murder of the unborn and celebrates a counterfeit\"marriage\" trust in the one, true God who has revealed Himself in Scripture? Nope. Meaningless words that don't impress the God of all creation at all. Repent and believe the Gospel.","post_message":"Avowed atheist Michael Newdow is at it again.  He's just filed a federal lawsuit demanding that \"In God We Trust\" be removed from U.S. currency.    We must remain vigilant in defending the Constitution from yet another assault on our religious heritage."},{"comment_id":"583491245168645","commenter_b":"Yup @username, same old Hillary, will say Anything. Flippity Flopping as usual.","commenter_a":"Well Hillary Wallstreet Clinton, your group phot does Not contain any Important popular opinions!! Now on to a question for you. If Nothing to hide regarding your emails, why would you destroy evidence after a Subpoena? Why did You lie to Congress and the FBI? Why did your aides plead the 5th? Why did some of your aides receive Immunity? Why did you recently Under Oath answer 21 questions with,(I Don't Recall ), and other questions with,( I Object) ? These Issues are VERY CONCERNING, and you're Ignoring these!!","post_message":"Nobody knows better than these five people what it means to be president—and not a single one of them believes Donald Trump has what it takes to do the job."},{"comment_id":"10152720000536051","commenter_b":"I've always been told a white woman will do things that will make a black woman puke they were right.","commenter_a":"Yuk!","post_message":"Officials took one look at this couple’s video and arrested them immediately."}]
