[{"comment_id":"10152872155116051","commenter_b":"She is a pig.","commenter_a":"Michelle Obama is a beautiful woman inside and out, and highly intelligent. Unlike most of these commentators!","post_message":"Raven-Symone’s take on Michelle Obama-Planet Of The Apes incident left the cast of The View at a loss for words."},{"comment_id":"1015321351850138","commenter_b":"Obama has been working on changes to second amendment....all we need is more of the same...no way!!!","commenter_a":"Get over it....Hillary wants to take away oil field jobs and our guns too...no way she'll get my vote!","post_message":"\"I say that I will beat her easier than beating some of the people that I've just won [against.]\" Donald J. Trump hit at Hillary Clinton's record and explained why he believes women will vote for him. @webpagelink"},{"comment_id":"1055649497786607","commenter_b":"I have been doing some serious thinking on this. I have always been pro second amendment, but maybe it is time to take a look at this from another direction. I propose we start here and see how this new gun control thing works. I propose that all people convicted of felonies be banned from owning/possessing firearms. All convicted felons should be made to turn in the guns the legally own now. Once we have all of those, lets move to people convicted of misdemeanor crimes of violence, like assault, sexual battery and so on. Lets get all those criminals that currently legally owning guns to turn those in. I figure it will take a year or so for all these people to disarm and turn in their guns and then we can see if we are having a positive impact on violent gun crimes. If so, then we can ...","commenter_a":"What don't the gun grabbers understand, if you take every gun out of every house hold we have no defense against the bad guys with the guns because they don't give a shit about the laws to start with...","post_message":""},{"comment_id":"10151088515799999","commenter_b":"Such a misogynist!","commenter_a":"I was at Smith College when Maher came and spoke in the late 90s. His contempt for women was palpable. Not a surprise that he feels avuncular towards Milo. Once you accept it is okay to dehumanized one group, it is just a hop skip and jump away from demumanizing anyone.","post_message":"Bill Maher's interview with Milo Yiannopoulos was a mostly chummy affair. Then in a segment that ran after the broadcast, Yiannopoulos attacked transgender people."},{"comment_id":"875277045852257","commenter_b":"You are a woman your body is naturally designed to bear children. It is worse when you make the choice to get pregnant.","commenter_a":"Most pro-aborts know there is an actual baby being killed. 99 percent of them have never had an abortion, yet have no problem telling others it's perfectly okay to have one. Pro-aborts are sick people.","post_message":"When was the last time you saw a baby announcement like this?"},{"comment_id":"860890883954153","commenter_b":"Goons On Parade!","commenter_a":"You weren't put there to be \"kinder, gentler\" When are you folks going to get the message!","post_message":"New Senate Majority Leader Mitch McConnell (R-Ky.) is indicating he’ll attempt to steer his party in a benign direction as his leadership style helps shape public perceptions of the GOP — and its presidential nominee’s chances — heading into the 2016 election cycle. @webpagelink"},{"comment_id":"1517058091671594","commenter_b":"Sisters don't destroy our men like BECKYS DO....WHEN THEY FINISH WITH YOU...YOU ARE DONE!!!! PERIOD","commenter_a":"not really a black white thing. but a man woman thing. woman of all colors have gotten away with assaulting men since forever, only it now comes with a nap. as it should.","post_message":"New Video of Joe Mixon Altercation and How Society Ignores White Female Violence Towards Black Men"}]
