[{"comment_id":"10153523667426336","commenter_b":"Please don't reproduce, the stupid must stop with you!","commenter_a":"TRUMP ALL THE WAY!","post_message":"The 2016 election kicks off on Fox News Channel August 6th!  Fox News and Facebook are teaming up to bring you the first Republican presidential debate! LIVE coverage begins at 5p ET. Don’t miss it."},{"comment_id":"10154101108342217","commenter_b":"TRUMPERS: Instead of saying get rid of abortion, why not use POSITIVE REINFORCEMENT by encouraging safe sex, and making birth control available in stores - WITHOUT HAVING TO GET A PRESCRIPTION. SILLY goose. SSSOOOO, are you saying that if a mentally retarded person is raped, then they should have the baby? Even though they don't have the mental capacity to care for themselves?.......... thats really stupid to state that they would have to go to another state in order for them to have an abortion, or to exclude ALL abortions. WOW. I bet you didn't consider mentally handicapped people being raped, or even 10 year olds. The youngest parents ever recorded, from my knowledge are the age of 10. Do you see the issue here? Think about it. Seriously. THINK people.","commenter_a":"TRUMPERS: Instead of saying get rid of abortion, why not use POSITIVE REINFORCEMENT by encouraging safe sex, and making birth control available in stores - WITHOUT HAVING TO GET A PRESCRIPTION. SILLY goose. SSSOOOO, are you saying that if a mentally retarded person is raped, then they should have the baby? Even though they don't have the mental capacity to care for themselves?.......... thats really stupid to state that they would have to go to another state in order for them to have an abortion, or to exclude ALL abortions. WOW. I bet you didn't consider mentally handicapped people being raped, or even 10 year olds. The youngest parents ever recorded, from my knowledge are the age of 10. Do you see the issue here? Think about it. Seriously. THINK people.","post_message":"The BBC's newsroom does the #MannequinChallenge.  BBC Children in Need."},{"comment_id":"10153085951882507","commenter_b":"no problem at all, as long as the part of the ----> well regulated militia <------ is the main factor, and not as is current, --> any inbred psychopath can buy any number of military grade weapons and high capacity magazine and then proceed to walk into restaurants with them.","commenter_a":"So this of course applies to second amendment rights also, correct?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153476534618721","commenter_b":"You do not turn the Super Bowl into a platform for any agendas. The Super Bowl is about the teams on the field. That is all. If she wants to do that at her concerts, fine. But she was out of line doing it at the Super Bowl.","commenter_a":"Is Beyonce just another ghetto ho?","post_message":"'Is Beyonce pregnant?' and other dumb things people Googled during the singer's Super Bowl performance. (via Quartz)"},{"comment_id":"10155421751074062","commenter_b":"Another idiot...","commenter_a":"To late to act like your civil now !","post_message":"Black Lives Matter activists led a peaceful march in Houston on Saturday."},{"comment_id":"748895108560603","commenter_b":"Wonder where she got those mouth sores?","commenter_a":"from people that scream to be treated fairly the gay community and its supporters sure spew a drastic amount of hate.","post_message":"It's good for thee but not for me. -1000pts. @webpagelink"},{"comment_id":"961733343862087","commenter_b":"Because she's an evil witch!","commenter_a":"She does not speak the truth !!!!","post_message":"No way, no how do I want her in the White House!"}]
