[{"comment_id":"466095273584336","commenter_b":"Good maybe that will keep a lot of those liberals and illegals out of the rest of America.","commenter_a":"Have it your way Jerry...","post_message":"Liberal California Governor Jerry Brown: ‘If Trump Wins, we’ll build a wall around California’"},{"comment_id":"10153456483261051","commenter_b":"I suggest you keep your bitch ass on the internet @username. You don't want to handle it in person.","commenter_a":"Most of the commenters here are transphobic scum. I hope none of you end up with a transgender child.","post_message":"This man handled his child’s funeral arrangements. When her friends showed up and looked inside the casket, they couldn’t believe their eyes."},{"comment_id":"1359337234126021","commenter_b":"Kids learn this behaviour. Violence/bullying maybe the norm in their households. Young bullies grow into big bullies unless they are dealt with","commenter_a":"Ban kicking , feet and bullying","post_message":"All because he stepped in to defend an autistic friend. Shocking."},{"comment_id":"497839773741528","commenter_b":"SO TIRED OF THE MUSLIM'S THINKING THEY CAN TELL US HOW TO LIVE IN OUR COUNTRY,,,,,,,THIS IS AMERICA NOT THE MIDDLE EAST......LEAVE AND TAKE YOUR MUSLIM BROTHER OBAMA WITH YOU...........","commenter_a":"@webpagelink I am a proud American, but this is a false story that is meant to instill false patriotism, and sadly by these comments it has worked.","post_message":"Muslim picks fight with patriotic cashier, and then this happened. If you don't like our country's flag, you don't have to live here. Can we get 35,000 'LIKES' for this patriot?"},{"comment_id":"10154202048116336","commenter_b":"piss off, Dirty Mary. We're having fun!","commenter_a":"Who cares lol. We have terrorist cutting people's heads off and we are freely bringing them HERE to America and your talking about this nonsense? Wow!","post_message":"Miranda Lambert brought a date to the ACM - Academy of Country Music Awards! Lambert, who split with husband Blake Shelton in July, brought her new boyfriend Anderson East. @webpagelink"},{"comment_id":"10153835231273984","commenter_b":"If it were any of us, we would be held accountable! This IS her mess!!!","commenter_a":"Fry the bitch! Tired of listening to her lies, and hearing her giggle when she's asked about her emails as if she knows she already got away with murder!","post_message":"WOW. There's no doubt Hillary did NOT want this to get out there. This makes things looks so much worse for her... Do you think Hillary Clinton should be held accountable for her actions?"},{"comment_id":"10153507200311336","commenter_b":"Cool end abortion I'll send all the mothers that can't afford to take care of their kids to you.","commenter_a":"Amen! I can't believe people are so desensitized to what is happening all around us. It is our duty as human beings to stand against this, which is actual murder. Abortion is wrong at any point and specifically aborting a baby at 24 weeks, the same time they can live out of the womb is just completely inhumane and murderous.","post_message":"ICYMI: \"Destroying innocent life and harvesting human organs is beyond barbaric -- it is unimaginably immoral, grotesque, and evil,\" writes 2016 presidential contender Gov. Mike Huckabee."}]
