[{"comment_id":"10153127374764753","commenter_b":"Pig drug whore doesnt deserve kids","commenter_a":"And I feel like a bad parent because of my mountain of dirty laundry... some people don't deserve children!","post_message":"Kodi Faircloth, though she may look quit a bit older, is only 38 and already the mom of 12 kids with another on the way. But it’s a safe bet that this Tulsa, Oklahoma, woman won’t be winning any Mom Of The Year awards anytime soon — not after what police report that they found in her home last Thursday."},{"comment_id":"10153511062521336","commenter_b":"None of them, should be able to Vote, till they Pay American Taxes for at least 10 years, then They would Understand, how We all feel, about having to Pay for their being here!","commenter_a":"Here is a photo and article - Are our elections being unfairly skewed through legal and illegal immigration ? @webpagelink","post_message":"Show us in one photo what you think needs to change in America and your photo could be featured in the first Republican presidential debate. Submit it here: @webpagelink  Don’t miss the Fox News-Facebook debate live from Cleveland August 6th on Fox News Channel!"},{"comment_id":"965206956824108","commenter_b":"Heena thank you for that original post. More level headed than many on social media. Personally I think Islam and Christianity are both a blight to our species- but it is your RIGHT to believe whatever you want. I'll gladly defend your right to be or believe whatever you want. I know Islam and Christendom view me as an abomination because I am gay- I think that is incredibly stupid but I still respect their right to believe it. There is no reason a female officer could not have dealt with this lady and, after checking for contraband, allowed her to keep it on.","commenter_a":"I'm so tired of seeing this article. I wear a hijab and I've been wearing it for 10 years and it's just as much my identity. But if I'm asked to take it off, I will. There's plenty of times I've been asked to remove it for security reasons and I comply, and that's not even because I got arrested. I'm pretty sure God isn't going to smite me for showing my hair to comply with the laws of the country I was born in and choose to reside in, which ironically gives me more religious freedom than living in a Muslim country. Is it entirely fair that this happened, probably not. A female officer could have taken her picture. But that didn't happen, and unfortunately being asked to remove your headscarf in a non-Islamic county doesn't amount to a violation of rights in the same way as it would ...","post_message":"“I’ve worn my scarf for 12 years and my religion says that I can’t take it off. It’s not just a religious issue; this is a part of me. It’s my culture, my life and my identity.”"},{"comment_id":"800418456754419","commenter_b":"She shd be in jail","commenter_a":"Nobody in the GOP can't come to Hillary's standards, there is no comparison.. She is one smart and prepared capable Madam President!","post_message":"The #GOPDebate may have ended, but CNN’s Chris Moody is live, taking your questions from the post-debate spin room in Miami."},{"comment_id":"10158219481290331","commenter_b":"the regardless part won't happen. if they are illegals with serious crimes on record, they will be deported. if they're citizens of rightful and legal to stay, they won't. no matter how people try to twist the issue into a hate retoric, it is for ILLEGAL IMMIGRATION.","commenter_a":"I wish I was there to ask some students why they walked out of class and I bet half of them don't know or just want to miss class. Bet!","post_message":"Large group of students at Molina HS in Dallas ISD have walked out of class in support of today's 'Day Without Immigrants' protests. @webpagelink"},{"comment_id":"980669235328527","commenter_b":"That is exactly what they should do no money","commenter_a":"I do not know who those three boys are but they sure made me a proud American--What angers me with these Administrators do not care that the cemeteries are full men and women who fought and died for what that flag represents--I with @username","post_message":"Tennessee School District Bans All Flags, Including the American Flag (VIDEO)  @webpagelink"},{"comment_id":"1038011639567708","commenter_b":"Hell no, look at her go though Kalen would move","commenter_a":"Wtf imagine if this was kalen lol @username","post_message":"At 6 months and 27 days old, little girl breaks the record for the youngest person to ever water ski. @webpagelink"}]
