[{"comment_id":"418399244951783","commenter_b":"People Conroling People , Money Conroling people , Paper controlling people , hu? Paper seems to be more in control here , get ready for a tree farm congress , congress: wants more trees , People: why, Congress: environmentally safe ecosystem, People: yeh, Congress: Money money money","commenter_a":"Seems legit.","post_message":"Lobbyists and politicians getting together, and yet it's the people who get screwed."},{"comment_id":"1088954241145047","commenter_b":"To all the women bitching","commenter_a":"He paid 50,000 for it! It's his! You big fat sissys!","post_message":"The identity of the American man who lured a treasured African lion out of a national park, shot it, stalked it for two days, then beheaded and skinned the animal, has been revealed. He's a dentist from Minnesota."},{"comment_id":"10153575430048525","commenter_b":"It is absolutely ludicrous that a law had to be made for that. What she did was animal cruelty.","commenter_a":"It used to be legal but in 2011 they pass the bill in Florida banning sex between humans and animals.","post_message":"Deputies say they arrested her after seeing video. STORY: www.fox13news.com/news/florida-news/@username-story"},{"comment_id":"1218654931501590","commenter_b":"Amen!","commenter_a":"It might have something to do with the fact that they make veteran Officers from other agencies retake the academy if they try to switch to their Department.","post_message":"10News' Phil Buck digging deeper to find out how Hillsborough County Sheriff's Office is still working to keep you safe in spite of deputy shortage @webpagelink"},{"comment_id":"10153428723486636","commenter_b":"no thank you","commenter_a":"No wonder @username is no longer going to print-regurgitating 8 month old articles without cause to is pretty embarrassing.","post_message":"The WHAT?"},{"comment_id":"10153179958482377","commenter_b":"I agree - feed her to pigs and feed the pigs to refugees!","commenter_a":"Feed them to pigs, then send the excrement to Mosques","post_message":"No Muslim mosques have offered to conduct a funeral for the terrorist wife. If not claimed, her body will be cremated at taxpayers' expense but there's more...@webpagelink"},{"comment_id":"10153080181251519","commenter_b":"Like StepFord Wives.. Im ashamed that A Women could trash and allow other sisters to have their rights taken away!!","commenter_a":"How can these people especially GOP WOMEN accept that party????","post_message":"Megyn Kelly slams Trump for calling women ‘fat pigs,’ ‘dogs,’ ‘slobs,’ and ‘disgusting animals'... and he laughs -- and so does the GOP crowd."}]
