[{"comment_id":"10153517218270329","commenter_b":"Yes, we do want what we can't have. Love what you have (unless you hate your big boobs. Then know there are ways to help a girl out).","commenter_a":"Having big boobs is a nightmare. I would never ever ever want big boobs again EVER!!!! Ladies with small ones have no clue what it is like and should stop pretending like they have the same issues. It is patronizing to women that really do suffer. And men, shut it because your opinion is not important when it comes to living with the issues that come with big boobs. OK, so have a great day everyone :))","post_message":"Hey there, boob sweat."},{"comment_id":"10154221226031509","commenter_b":"Its not a stare down, lol! Whe one talks the other listens & thinks, then vise versa.","commenter_a":"Obama is intimidated by Putin he can't even look at him in the eyes.","post_message":"Heads slightly bowed, looking extremely serious: What were Obama and Putin discussing?"},{"comment_id":"1699015597030344","commenter_b":"A no vote IS a vote - for the candidate you least want.","commenter_a":"Adding or not adding the next Scalia to the Court seems like something that will have pretty wide implications for the next couple decades.","post_message":"\"I'm not interested anymore. I don't see any immediate, significant changes happening. I don't see voting as a means to an end.\""},{"comment_id":"1685131825099212","commenter_b":"Bitch!","commenter_a":"Bitch","post_message":"Can you describe #Trump with 1 word?  The Free Thought Project.com (y)"},{"comment_id":"10153081622630329","commenter_b":"Yeah because all Muslims are terrorists....you absolute dickhead","commenter_a":"I've been saying this for many many years now and this just proves me right. Especially after 911 we should have turned that entire part of the world into a sheet of glass. The women breed them, the kids are trained like them and are used as mercenaries. KILL THEM ALL. There are to many to sort out and sift through to decide who's good and who's not. Point blank end them all.","post_message":""},{"comment_id":"10153233796523717","commenter_b":"If she did this to one of my children, she would be begging to go to prison or she would beg for the death penalty!","commenter_a":"Judging by similar cases involving females, she will probably get probation.","post_message":"A Concord woman arrested last week faces multiple child pornography charges. The arrest was made in connection with an investigation started by Hollis police: @webpagelink"},{"comment_id":"1769292306444953","commenter_b":"With you in that thought...sad but so true. In jail all his basic needs would be met and even medical. Sad we treat jailbirds better than the homeless.","commenter_a":"Imagine if he'd actually been trying to steal the food so he could go to jail and have a roof over his head and food in his belly. But good on the judge anyways for showing some compassion in a world that is lacking these days.","post_message":"A bit of compassion in the courts can go a long way."}]
