[{"comment_id":"1640586052910285","commenter_b":"Close them.Then make it tough to come to America.Its to DAMN easy now,,that's why were lousy with illegals.","commenter_a":"NO!","post_message":"Senator Tom Cotton just introduced Trump's immigration proposal through the Senate! Sign the petition SUPPORTING the bill HERE: @webpagelink"},{"comment_id":"10153848346775470","commenter_b":"Shes just drunk leave her alone","commenter_a":"Johnny Saenz","post_message":"Parents of students at an elementary school were outraged after they found out kindergarten teacher Klara Bowman had been fired after an accusation she was intoxicated in her classroom."},{"comment_id":"10154178082379726","commenter_b":"Yea and less than that are for your boy Cruz, and even less than that (way less) for Kasich. What is your point. Look who got 60% of the third largest state (NY) and watch where he is in the primary's tonight.","commenter_a":"For me, I hope Trump supporters realize he is only getting about 37-39 % of Republican votes on the average. I'm not talking about the one national poll that has him at 50%, I'm talking about the current raw, known facts, of these primaries. Nearly 2/3 of Republican voters want other than Trump.","post_message":"It's begun — even his fiercest critics are resigned to Trump's likely nomination."},{"comment_id":"10153722269186680","commenter_b":"Helene....her supporters have jobs....what planet do you live on ???","commenter_a":"Trump draws crowds of 15k, while Hillary can't draw 100 people to come to her rallies, yet the polls say that Hillary is ahead....something smells foul.","post_message":"The independent says he'll continue to find ways to support Hillary Clinton and defeat Donald J. Trump."},{"comment_id":"1718149915138787","commenter_b":"Why don't they remove these 3 evil women?","commenter_a":"I wouldn't waste 1 minute watching this group! They all look like they are wearing Halloween masks!","post_message":"Come... ON... Joy Behar needs to be banned from TV!"},{"comment_id":"1642912372619537","commenter_b":"Very nice & her tiara stayed on!!!","commenter_a":"Awesome","post_message":"These two turned up the HEAT!"},{"comment_id":"1349045918521792","commenter_b":"You have a lot of names there Laurren.. The typical liberal feminist skank.. Way to go","commenter_a":"Just a suggestion for you @username people. If you dislike Trump and hate that he won a fair election then I suggest you retreat into your safe space for the next 4 years (at least). Shouldn't cause you too many problems as you probably don't have jobs anyway.","post_message":"This website is going viral, and Trump is not happy. You know what to do!"}]
