[{"comment_id":"651982771617164","commenter_b":"SEND HER BACK TO WHERE EVER SHE CAME FROM ! LET HER WHINE ALL THE WAY HOME !","commenter_a":"Yap she's crazy..go home.","post_message":"Woman Goes On National TV And Blames Americans For Banning Sharia Law And Executing Kids In... This must be some kind of sick joke. Do you think she has completely lost her mind?"},{"comment_id":"754801571296723","commenter_b":"You possess a gun! Must include you and your Force. No, possession of a gun or any other weapon by an honest citizen and who Carrie's it legally is not the problem, it's your drug dealing gangs and the shitbags they cater to that are committing all the crime and violence, when the politicians and legal system gets real and grows a pair, maybe then the police can finally do the job they are required to do, try some aggressive patrolling and \"stop and frisk\" along with prosecution of those who illegally possess guns and stop throwing out the gun charge for a quick \"plea bargain case\" maybe you'll see some results!","commenter_a":"That's why Chicago had 62 shootings over there weekend their in the wrong hands.","post_message":"Garry McCarthy has no interest in stopping the thug culture destroying Chicago. Instead, he wants to blame law-abiding gun owners for his failures."},{"comment_id":"10154145520606770","commenter_b":"Never, they're pigs. Tell them to oink off.","commenter_a":"When did they stop calling women like Kim who have no decency or moral compass pigs?","post_message":"The outfits that Kim Kardashian and Kendall Jenner wore were absolutely stunning."},{"comment_id":"1312061745499049","commenter_b":"You two are makeing it hard for people that are serious about their beliefs your making them look bad,so knock it off!","commenter_a":"#Theydontrepresentme","post_message":"\"After sharing my thoughts about the recent Women's March on Facebook, rabid feminists quickly attacked, displaying their 'tolerance' as they 'lovingly' called me a twat and worse. That didn't bother me. What irritated me was the 'We did this for you' remarks. Before these feminists march for me again, there's something I want them to know.\" @webpagelink"},{"comment_id":"10153333360391130","commenter_b":"@username, how is she a cheat? Please validate your contention.","commenter_a":"She's a bit of a cheat though and how she treats officials... Great player, not a great person","post_message":"These attacks aren't anything new."},{"comment_id":"1033927403316825","commenter_b":"Good! Hopefully this will deter those damn anti-vaxxers from using Facebook and spreading their total stupidity. One can dream.","commenter_a":"Hip hip hor ehhhh","post_message":"Three cheers for Mark."},{"comment_id":"2035328873360726","commenter_b":"Touch my wife and you're a dead goat-humping mf.","commenter_a":"So this must be why American women want muslims in our country?","post_message":"SHARIA LAW BEATING Of Woman Captured On Cell Phones By Cheering Crowd…Woman Savagely Lashed With Cane By Masked Men…Screams In Pain Before Collapsing The smiling women in the large crowd is almost equally disturbing… ***WARNING***VIDEO IS VERY GRAPHIC And DISTURBING!"}]
