[{"comment_id":"10153109185578812","commenter_b":"I hope people know the women in Iowa aren't all like her.","commenter_a":"I'm from Iowa. So embarrassing!","post_message":"The Republican Response to #SOTU2015: Who is Joni Ernst?"},{"comment_id":"1202853869734641","commenter_b":"Muslim go home","commenter_a":"I don't believe we should elect a president so delusional he believes the Earth is only 6000 years old and that going to prison can make a person be gay...","post_message":"\"I would not advocate that we put a Muslim in charge of this nation,\" Dr. Ben Carson told Meet the Press."},{"comment_id":"1131317030222640","commenter_b":"Nice trolling bitch.","commenter_a":"If I want my kids taught fairy tales I will send them to church. As a Louisiana resident this does not come as a surprise.","post_message":"This is appalling."},{"comment_id":"10156195234480093","commenter_b":"Guns are not only made here...","commenter_a":"People said America is full of nuts but before reading these comments i did not believe it. Take all the guns and destroy all the gun factories and find out what living in peace means","post_message":"Let's have an HONEST conversation about it."},{"comment_id":"1267539270005791","commenter_b":"@username , is it all intelligent, competent and strong women that intimidate you, or just Hillary? Hillary 2016","commenter_a":"He can only intimidate weak people... She's the exact opposite of that! #VoteBlue","post_message":"BOOM."},{"comment_id":"10153042217565047","commenter_b":"JH move to Israel","commenter_a":"Because our communist muslim pig so called president is one if them. America stand for Israel Defy the leadership of this commie government and fight for what is right. Stand with Gods people.","post_message":"The terrorist-led Palestinian Authority (PA) has ended its peace with Israel.  War could be imminent, so why are we still sending millions of dollars to the PA?   We must stand with Israel.  SIGN & SHARE our petition to stand with us: @webpagelink"},{"comment_id":"620617391457056","commenter_b":"Cleavage queen","commenter_a":"Just once I would love to see Mariah dressed in a turtleneck !","post_message":"It really is the most wonderful time of the year!"}]
