[{"comment_id":"10153636348708132","commenter_b":"Eww she ugly","commenter_a":"I love her comedy routines and I think she is beautiful. I like to hold hips not bones.","post_message":"The endlessly quotable Amy Schumer!"},{"comment_id":"1036339909720353","commenter_b":"Skye Waters Maite Roman","commenter_a":"You guys just love to look down your noses at others. Yes, it is an incorrect viewpoint, but ridicule is for idiots and children.","post_message":""},{"comment_id":"738159049657328","commenter_b":"I think that crooked, lying, evil bitch needs to be in prison","commenter_a":"K, this bit%h is really out there! She and her cronies want total power! I pray that God stops her!","post_message":"WOW. People NEED to listen to Hillary's response when asked if an individual's right to bear arms is a constitutional right... Do you think Americans should be scared of a Hillary Clinton presidency?"},{"comment_id":"1265995716788763","commenter_b":"^fuck that baby","commenter_a":"What is up with this country? A woman owns her body and nobody can tell here what she can and can't do. Its called freedom.","post_message":"Millions of women rely on the health care services of Planned Parenthood, and we must stand with them. The women of this country have the right to control their own bodies, not politicians. No cuts to Planned Parenthood."},{"comment_id":"10153394561766336","commenter_b":"Only one I see judging is you","commenter_a":"Her Christian mother must be so proud. This is why you don't preach and judge. Once you put yourself out there, you are now the target to being judged.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child. “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"10158500628960389","commenter_b":"As a Hispanic born in the US, no Jorge Ramos! This country does not belong to illegals! You're are crazy and delusional, if you love Mexico so much go back there and see how it goes for you! We are not against legal immigrants, it's the criminal illegals that should go back! So screw off and shut up!","commenter_a":"Deport Ramos. I'm an immigrant and can't stand him.","post_message":"Univision anchor goes on an ethno-nationalist tirade."},{"comment_id":"10155070762506037","commenter_b":"But the person doing the watching had intentions maybe","commenter_a":"Something sounds like she wondered off but someone had been watching her.","post_message":""}]
