[{"comment_id":"493286290862389","commenter_b":"Now if we could just get her to STAY in Africa. ..and her little pea brained spouse. .","commenter_a":"I believe Hillary and Bill did something similar before they left office, milked the system for all they could and stole hundreds of thousands of dollars worth of White House furniture and art work.","post_message":"First lady Michelle Obama's family trip to Africa, Spain and Morocco to promote her \"Let Girls Learn\" initiative, and cut a CNN documentary on the effort, has already crossed the $1 million mark with many more expenses still to be tabulated. According to the bills that have already come in, Obama, accompanied by an entourage that includes her mom and daughters, has spent about $1.06 million: $512,737 for hotels and $252,471 for limos and transportation. - via Washington Examiner"},{"comment_id":"10153345373924087","commenter_b":"Quit being a bitch you got your guns right?","commenter_a":"And Obama is going to let more terrorist in here so what's worse","post_message":"“He’s whipping up hatred to scapegoat a minority religious group, which has some very dangerous precedents,” Rep. Keith Ellison said of Donald Trump’s claims that thousands of Muslim Americans cheered the 9/11 attacks. “I mean, it’s the kind of behavior [that is] classic demagoguery, and you know, he’s going to get somebody hurt.\""},{"comment_id":"10150524320899999","commenter_b":"So once again punish people who are trying to help themselves","commenter_a":"Un-American","post_message":"Millions of families may need to rethink their approach to college savings."},{"comment_id":"801914353278362","commenter_b":"Trump will crush this fat ugly lying lady","commenter_a":"Love how the little girl scout is pointing out the cookies to you. Rock on Hillary -supporting you in Colorado. Ignore the haters inWV","post_message":"Cookie stop in Kentucky. Picked up some tagalongs and samoas before heading across the border to West Virginia."},{"comment_id":"10153287032506770","commenter_b":"Ugliest drag queen","commenter_a":"She sucked big time!!","post_message":"Did you see her performance?"},{"comment_id":"1729670857287408","commenter_b":"HILLARY CLINTON YOUR HONEST, LOVING, CARING CANDIDATE! @webpagelink","commenter_a":"Be patient my precious. Von Clownstick will not win the White House. Hillary will crush him come November. Then all these Dumpsters can slither back to their respective holes. Bye Drumpf.","post_message":"Donald Trump is closer than ever to clinching the GOP nomination. There's only one candidate who has more votes."},{"comment_id":"10153497244196051","commenter_b":"You are such a bitch. You need put to death just like you did your baby. You bitch","commenter_a":"Glad she didn't get off like Casey Anthony","post_message":"This woman didn't want her ex-boyfriend dating other women. Her 2-year-old daughter ended up paying the price."}]
