[{"comment_id":"635715443285701","commenter_b":"Should have knocked her out cold","commenter_a":"shoot that bitch with that soldiers gun.","post_message":"This liberal garbage spit in a soldier's face, receives instant karma.  What a pig. If you don't support our troops you can leave.  Do you agree she got exactly what she deserved?"},{"comment_id":"899517350083687","commenter_b":"GOD BLESS AMERICA ! We really need His Help !!","commenter_a":"Screw the Muslims and the Camels they rode in on!!!","post_message":"Pathetic! (MUST READ)"},{"comment_id":"815444651917532","commenter_b":"Pathetic woman.","commenter_a":"I now understand why she has those dark bags under her eyes. She stays awake all night long thinking and writing down excuses she will have to use the following day to explain her ignorance and untruthful behavior.","post_message":"\"Well, I don't know,\" Clinton said. \"That's what they offered.\""},{"comment_id":"10154319378806337","commenter_b":"Mfs are crazy someone please give this puppy mf a show so i can laugh everyday as he humps his wifes leg and smell her butt. Wait i do all those things. This guy is normal","commenter_a":"Oh what the fuck happened to this world..lol","post_message":"UHHHH..."},{"comment_id":"10153468910666037","commenter_b":"Kids from low income communities and families qualify for free college education through goverment grants and programs... some choose to use those programs to better themselves and their famalies... others would rather point fingers and blame others... the only person to point the finger at in a capitalist society is the dude in the mirror because you can truly be anything you wanna be if you want it bad enough...","commenter_a":"This is awesome... more boots on the ground hopefully with the full support of the community and politicians to clean the crime up on the streets of this country... Every single city should follow in their footsteps!!","post_message":"The country's largest police force says it will also hire 400 administrative aides to take over desk jobs, which will free up more officers to walk the streets for community policing."},{"comment_id":"10154831309643984","commenter_b":"She is SCUM","commenter_a":"She is pure unadulterated bullsh**.","post_message":"Of Hillary's hundreds of scandals, this is by far the worst. And most people have no idea she was even involved, let alone behind it.  This makes her scandals (and the ones she's made up about Donald J. Trump, look like nothing."},{"comment_id":"1797347700498169","commenter_b":"If a cop ask you multiple times to put your hands where I can see them you do it!","commenter_a":"How you raise a black son in America? Tell them not to break the law and do what a cop is telling you to do. That's how","post_message":"It's an important question, without easy answers."}]
