[{"comment_id":"10153427375089726","commenter_b":"this brain dead old witch needs to be in a mental ward","commenter_a":"Congress can deny funding and they better. Premiums are going through the roof . Supreme are bunch of liberals out of touch with the average folks.","post_message":"According to Pelosi, Scalia ... joined the majority?  @webpagelink"},{"comment_id":"10152897660675950","commenter_b":"I wondered the same thing. Those bitches be crazy!","commenter_a":"where's part 3??","post_message":"In a video of the incident, two women are heard yelling at one another before the argument escalates and gets physical. Then a 6-year-old gets involved; at one point, the boy is seen hitting a woman with a shampoo bottle as the women wrestle on the ground."},{"comment_id":"10153525959526336","commenter_b":"The mom is a idiot No common sense dumb woman that is it Let lock her up in a hot car and see if she likes it That little girl was soak with sweat even with the windows rolled down a little bit duh","commenter_a":"She took one kid with her and left the other one in the car????","post_message":"Video below shows the moment that officers freed the little girl from the van."},{"comment_id":"10156149888525389","commenter_b":"Now they are coming over by sea they are still illegalls","commenter_a":"Oh Great,more people coming in !!","post_message":"A Miami Beach Police spokesperson said it is unknown how long the group were at sea."},{"comment_id":"1188981914457930","commenter_b":"A better statement than any feminist has ever made...","commenter_a":"Curtis Oakley","post_message":"They are doing it for a powerful reason."},{"comment_id":"10152962610452894","commenter_b":"Lady, what a dumb comment","commenter_a":"So what. If Bruce Jenner can be a woman, she can be black. People can be whatever they want.","post_message":"Exposed! Spokane NAACP Leader Rachel Dolezal Lied About Being Black — She’s Actually a White Woman from Montana [Photos + Video]"},{"comment_id":"1711039005849878","commenter_b":"This Mexican thug should be the one that's taken out. Lots of people would like to see that happen.","commenter_a":"This is so fake people will write anything to make a story","post_message":"This is bone-chilling.  Our prayers are with you, Donald J. Trump!"}]
