[{"comment_id":"1151260644926345","commenter_b":"she is pathetic","commenter_a":"Jenner and malania do look a lot alike .","post_message":"Caitlyn Jenner joined the festivities in Cleveland where she explained her reasons for being a Republican."},{"comment_id":"533413536846939","commenter_b":"They all need to go back to thier countries and fight thier own battles against extremist.","commenter_a":"U GO TRUMP","post_message":"Looks like Trump said what many across the world were already thinking..."},{"comment_id":"10155648404180354","commenter_b":"Fire the bitch.","commenter_a":"He wasn't rude, she just didn't want to answer his question! She made a very bad decision and now she doesn't want to face the consequences of her stupidity.","post_message":"What do you think? Was the reporter being rude?"},{"comment_id":"10153551437246336","commenter_b":"Hello!! They treated him like that bc they believe him to be a wolf in Sheep's clothing. I find him very entertaining but he is the Clintons wild card. He will divide the republicans so democrats will win. They even point blank asked him when he became a republican and all he can say is I changed my mind.","commenter_a":"@username owes Donald Trump an apology. Get rid of Megyn Kelly while you're at it.","post_message":"Which GOP presidential candidate do you think gave the most impressive performance during the Fox News-Facebook prime-time debate?"},{"comment_id":"10153916920276350","commenter_b":"The dumb lady who filed said her lips started drying after putting it on...so she put more on. Idiot.","commenter_a":"I used this, got a rash and it dried my lips out so bad that they cracked and bled. I had to get medication to heal my lips, but I STOPPED USING IT!!!!!! It's not rocket science. If it hurts you or doesn't work, don't use it. I wouldn't sue over it even though it was nasty looking and hurt like no other.","post_message":"Have you had any skin issues using eos lip balm?"},{"comment_id":"506998642821762","commenter_b":"I'd say a feminist who pees themselves might be drunk.","commenter_a":"Well, that has to be uncomfortable. Only a mental moron would pee themselves. I'm telling you, libs are retarded.","post_message":"How stupid can some people be..."},{"comment_id":"10154662205964575","commenter_b":"Good she needs to be arrested!","commenter_a":"Yes this girl has done this before. She willingly is w him! She needs to be charged for running away over and over again. And it's her mothers vehicle. Something needs to be done!","post_message":"UPDATE: The teen at the center of the Amber Alert has been found safe, according to police.  --------------------- An Amber Alert has been issued for a for a missing 17-year-old girl who authorities believe is in extreme danger.   Police believe an escaped convict out of Hancock County, Dustin Fisher, 20, abducted the teen. Fisher is also considered a violent sex offender."}]
