[{"comment_id":"10154786029086833","commenter_b":"Arrest her","commenter_a":"While she has her entourage of security with every bit of modern rapid fire","post_message":"So the NRA isn't being \"reasonable\" for defending your individual right to keep a gun in your home for self-defense...yet it's \"reasonable\" to advocate for an Australia-style gun confiscation program? Uh, ok."},{"comment_id":"1136778326378278","commenter_b":"Mizo I am not shia. But i am sure shia love this place aswell I can never imagine they can do this cowardly act it is time to hug each other regardless of there beleive let Allah to decide and guide us all the ryt path. I am in the favor of a united muslims across the world regardless of there beleive. Muslims getting butchered across the world. Innocent children women are getting bombed every single day. For God sake be united. May Allah protect all the muslims across the world.","commenter_a":"inshallah everything would be alright because the Angels of Allah look after our prophet house so I have suggest to King of Saudi to whip Shia from Saudi Arabia to somewhere else","post_message":"It exploded near the Prophet's Mosque, one of Islam's holiest sites. Update at 23:00 BST: Interior ministry has confirmed four security officers have been killed and five others injured."},{"comment_id":"1000663273302101","commenter_b":"Fuck you pig boot licker.","commenter_a":"HAHAHAHAHA. Just because they be black,,,,,,,,you think yo sorry black asses BE safe with Islamists \"protecting\" yo ASSES? HAHAHAHAHA","post_message":"The police thought they were the only alternative for security. They just found out that there are many groups willing to do their jobs for them, for cheaper and with more accountability if they mess up! Do you support this move? Or will their be utter chaos without the police there? Follow >> (Y) Counter Current News for the latest!"},{"comment_id":"934248849943870","commenter_b":"American's just as guilty for ALLOWING these Satanic PIGS to roam our country and have their way! THIS----IS---OUR---COUNTRY!!! NOT the POA - NOT Islams!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"These MUSLIMS think they can come to this Country and do what they want, NO if you don't like it go back rape you women and kill but not in AMERICA!","post_message":"Must Watch!"},{"comment_id":"892166267491828","commenter_b":"Why always Iran?","commenter_a":"Erdogan is a disgrace to Turkish people.","post_message":"Iran has summoned Turkey's charge d’affaires to hear Tehran's protest against Turkish President Recep Tayyip Erdogan's “improper” remarks regarding the Islamic Republic's alleged regional ambitions. Read more: @webpagelink"},{"comment_id":"10153644073950861","commenter_b":"They can get married with benefits now. What the hell else do they want?","commenter_a":"The Florda man is at it again","post_message":"The display, based on the holiday depicted in \"Seinfeld\", will be 6-feet tall, wrapped in the colors of the gay pride rainbow flag and topped with a disco ball."},{"comment_id":"10152579324632093","commenter_b":"especially coming from a girl who's spent plenty of time barefoot in the kitchen pregnant...","commenter_a":"That's what makes Texas so awesome.... everyone here knows their place..","post_message":"Same topic... different take. A man claims a bakery discriminated against his religious beliefs by refusing to make an anti-gay cake. @webpagelink"}]
