[{"comment_id":"10153034761287235","commenter_b":"you learn to write, bitch...","commenter_a":"oh boo hoo it's fucking war get a life moron","post_message":"“My uncle killed by sniper in WW2. We were taught snipers were cowards. Will shoot u in the back. Snipers aren’t heroes. And invaders r worse.” -- Michael Moore"},{"comment_id":"1260941960612940","commenter_b":"To unite for all the right concerns all of them with us in mind because is 100% for and by the people...please for your families...you have to check learn help in anyway you can act and share and share again...because species are disappearing everyday...everyday...for you your loved ones for the nation for the world the planet..hiring humans for humanity and peace for all not the few...www.jill2016.com","commenter_a":"What a lot of people don't know about Trump that support him is, that those same people would not survive him ...Trump would even eat his own kind....it's just his nature.","post_message":"This teen just figured out the perfect question to start asking Trump and his supporters."},{"comment_id":"10153114659021336","commenter_b":"i just hope she is prosecuted for her crimes, and they let her know she is NOT above the law....she is a disgrace.","commenter_a":"Right on schedule.","post_message":"Let us know your thoughts on Rep. Trey Gowdy asking that Hillary Clinton agree to a transcribed interview over her deleted records and tune in to 'Special Report with Bret Baier' at 6p ET."},{"comment_id":"10154184964563352","commenter_b":"Melissa..legalizing illegals will devastate black employment..for every available job it will be 150 Mexicans to every 3 blacks...it be horrible for us","commenter_a":"Hes gonna stop illegals from coming taking black jobs..hes gonna kill obamacare fines..wat sensible black would disagree","post_message":"Trump says black Americans 'are going to like me better than they like Obama' – even though the president has 'a slight advantage'"},{"comment_id":"391857781002516","commenter_b":"Animals! That's why they're in prison!","commenter_a":"They would live there no matter what the conditions are! They destroyed it now let them lay in it!","post_message":"The corrections officers could only watch as the thousands of inmates broke the heating, cooling, and ventilation systems, and forcefully shook the gates in the prison lawn..."},{"comment_id":"1276333032401449","commenter_b":"And your first lady has a dick","commenter_a":"Haters are real, she is beautiful as fuck with a clown ass husband, I enjoy having a crazy First Lady because I DONT GIVE A FUCK ABOUT A FIRST LADY! STAY FOCUSED ITS ABOUT VOTING FOR THE PRESIDENT NOT THE FIRST LADY YOU FUCKS!","post_message":"This HAS to be said!"},{"comment_id":"485248011623976","commenter_b":"Ugly little bitch.","commenter_a":"Bush murdered 4500 American soldiers for a lie in Iraq, got another 50,000 maimed, killed 100,000 innocent Iraquis, allowed 9-11 to happened, bungled the response to Katrina, bankrupted the nation, allowed our enemy bin Laden to literally go free, and had 9 US embassies/consulates attacked with over 90 dead, yet these mother fuckers stiil pretend to be outraged over this bullshit....republicans investigated this 9 mother fucking times, at a cost of millions of dollars, and found nothing. This is perverse. Conservatives are the worst enemy this country has ever faced.","post_message":"The GOP wants nothing less than the total destruction of Hillary. -Clay"}]
