[{"comment_id":"1071940456151087","commenter_b":"the medias role should be to challenge state lies... now their main role is to amplify it","commenter_a":"this is not good.","post_message":"Barry Grey: Addressing the United Nations General Assembly on Monday, President Barack Obama portrayed himself and the US government as the preeminent defenders of international law and diplomacy. He did so even as the catastrophic consequences of the illegal wars of aggression he has overseen continued to send waves of refugees fleeing the ruins of entire countries—including Afghanistan, Iraq, Libya, Syria and Yemen—and as Washington took new steps to turn Eastern Europe into a militarized zone for eventual war against Russia."},{"comment_id":"10156586680480354","commenter_b":"Well @username be a man and stop hiding your face pussy","commenter_a":"Harry Truman was reigned back when it came to steel factories and labor unions. Obama needs to be reigned back with infringing on the 2nd Amendment!!!","post_message":"Today Obama destroys the 2nd Amendment.   And it's FAR worse than Americans feared..."},{"comment_id":"10154478047941051","commenter_b":"Well one girl just said that is white privilege so thats why you got to play with guns.","commenter_a":"I never liked Sarah Palin but don't see her grandson playing with a toy gun as an issue(key word being TOY here). I recall having a few toy guns as a kid myself and certainly didn't grow up to be a serial killer or anything of the sort.","post_message":"Bristol Palin is coming under fire after what her 8-year-old son is doing in this viral picture"},{"comment_id":"10153080670828721","commenter_b":"ITT: Idiots. Everywhere.","commenter_a":"No matter what does someone have something -ve to say","post_message":"ConnectHome is a pilot program through which Google and other Internet service providers will give free or low-cost Internet access to 275,000 homes in 27 cities across the country."},{"comment_id":"10153464811106028","commenter_b":"@username, yes, jail is vacation. You should go there when you get tired of working. Many of our jails are full of illegal immigrants waiting to be deported or just released back into society. You should really think before you open you mouth Mario. Some people are just plane dumb. To think jail or prison is a vacation. If we sent home the illegal immigrants that are currently in our jail system, we could close 20% of our jails and put that money to better use.","commenter_a":"More people would have been there but it was morning and they were sleeping. It's also not the 1st or 15th so they don't have their free government checks, so no gas to get there. I say deport them, if they are here illegally they need to go. I'm tired of paying tax for them to get a free ride. We don't even take care of our own vets as well as we take care of illegal immigrants. That's a bunch of bull.","post_message":"Immigration policy protests continued throughout the morning in downtown LA, forcing closures at Los Angeles and Main streets. Protesters in a circle at the intersection called for a stop to recent federal deportation raids: @webpagelink"},{"comment_id":"1056445444376466","commenter_b":"Happy International Women's day.","commenter_a":"A woman got recognition in the late 1800s? Wasn't the womans rights movement kind of non existent at that point? Wouldn't she have just been laughed out by any male doctor of the era without a chance to prove herself","post_message":"#womenyoushouldhaveheardof"},{"comment_id":"444470795746949","commenter_b":"It's all about him he really doesn't care about us what a dick","commenter_a":"He has zero fuks to give.","post_message":"As 43 Americans are killed by tornadoes during the Christmas holiday, Obama golfs (again)..."}]
