[{"comment_id":"923822694380650","commenter_b":"@username, Hillary is not a good choice for president. I'll take Bernie Sanders!","commenter_a":"How pathetic is this woman??? EVERYTHING she does has an ULTERIOR motive....EVERY word is calculated......she is not genuine in the least bit.....","post_message":"Hillary Clinton will soon meet this history-making couple."},{"comment_id":"10155130620974060","commenter_b":"Yeah Yeah okey then you are one of those...","commenter_a":"UK will go out on a Friday and apply to go in on a Monday....that will suit the FTSE trading too....","post_message":"If the public is to turn against Brexit, it will do so on its own terms. The task of Remainers is to be ready"},{"comment_id":"1485464441513680","commenter_b":"ASICK woman needs to be jailed","commenter_a":"Hang them both!","post_message":"What kind of woman could do this to her own child?"},{"comment_id":"1250451044993129","commenter_b":"Her supporters are indebted to her for what she has connected them with of course you're not going to spit in her eye the whole group including her supported just crave Power by any means necessary and feel they are much Superior to all other beings and should be allowed to run the world according to their plan blow them all out of the water please go vote for the one who loves his country it's the only hope we have","commenter_a":"The love of money is the root of all evil. They should be in jail. Anyone else who did this would be.","post_message":"This is important."},{"comment_id":"10153510075534087","commenter_b":"So, there is no room for reasonable art of the deal on either side, now? Remember what happened in 2012, fellow Republicans. You didn't turn out because Romney wasn't \"conservative enough\" for you. Then you did nothing but whine and bitch and blame it on voter fraud and your grandmother's Impetigo. The problem is not PEOPLE a from another country, it is SUBSIDIES that politicians buy votes with and ABUSE of unskilled labor and QUOTAS set by those who use prejudice to their advantage. We cannot round up 12 million entrenched undocumenteds, nor should we- it would be political and fiscal suicide. So let's get an electable candidate, get him in the WH, and start doing what we can to enforce immigration laws that protect us from terrorists and criminals, the ones Obama and this DOJ flip the bird to the SCOTUS a about, create an environment where inclusion with ...","commenter_a":"Trump all the way to the White House.","post_message":"“Marco Rubio is the front man for the open borders syndicate,” Donald J. Trump's senior policy adviser Stephen Miller said in a radio interview. “And understand this, Marco Rubio is determined to finish what he started with the Gang of Eight bill and to be President Obama’s third term on immigration.”"},{"comment_id":"1367333429993068","commenter_b":"^^^^ angry feminist.....who'da thunk it","commenter_a":"so much narcicism in society these days...so many women demanding to be seen as \"beautiful\"....its ridiculous. And the kicker, if youre a man, and you say they are fat and unattractive then you are a \"chauvanist\" or \"intolerant\" etc etc etc....but you know what, why do women not go crazy over fat rotund men??? where is the fat acceptance movement for those guys? I rest my case.....no ladies, that isnt attractive.","post_message":"'These are the women you've rolled your eyes at... or joked about with your friends'  (via Daily Mail Australia)"},{"comment_id":"10153244727383352","commenter_b":"such a bitch whore ,","commenter_a":"And In \"Other Breaking News...\" Kim Kardashian is laughing all the way to the bank! !","post_message":"Kim Kardashian gets slammed on Twitter for her new Super Bowl T-Mobile ad where she shows off her body while taking selfies"}]
