[{"comment_id":"1142990589094021","commenter_b":"ugly women","commenter_a":"what are you animals?.....in britian?......wth!","post_message":"'Still not asking for it'"},{"comment_id":"1041013112628492","commenter_b":"COUGH ON ALL YOUR LIES BITCH! THE WRATH OF THE LORD IS COMING FOR HER!","commenter_a":"Is she still alive? Damm she is","post_message":"Well this was just revolting. Clinton cannot stop coughing during speech."},{"comment_id":"1025373750832154","commenter_b":"@username, nope, not voting for her, either.","commenter_a":"The Trump train is full speed ahead. Get on board the Trump train. You will get run over. It is full speed ahead to making America great again. Mr. Trump for president 2016!!!!","post_message":"America is proud to stand shoulder-to-shoulder with a free & independent UK. We stand together as friends, as allies, & as a people with a shared history."},{"comment_id":"10153997969131770","commenter_b":"No we want our WALL","commenter_a":"I bet she does. I want the wall right now.","post_message":"Mexico foreign affairs minister says her dream is OPEN BORDERS, with no walls."},{"comment_id":"1166520376798072","commenter_b":"Grow up you sick witch. Get a life of your own.","commenter_a":"Congratulations men. One psycho off the market.","post_message":"HAHAHAHAHAHA... HAHAHAHAHAHAHAAAA!!! @webpagelink"},{"comment_id":"519829538184192","commenter_b":"Santagini - you are either batshit crazy or very funny.","commenter_a":"The traitor flag belongs in a military museum next to Nazi war memorabilia we took from dead Germans. You want heritage? Wave the white flag, that's your heritage.","post_message":"\"The time surely comes when [justice] must and will be heard,\" New Orleans Mayor Mitch Landrieu told the city council, calling for the statues of Jefferson Davis and Robert E. Lee.to be put in a museum. \"Members of the council, that day is today. The Confederacy, you see, was on the wrong side of history and humanity.\""},{"comment_id":"749889551868289","commenter_b":"damn bitch!!!","commenter_a":"Fuck that BITCH she has no authority to do anything the American people own the schools not your ugly f****** Muslim ass you're a disgrace to the American people and funny thing is you're on your way out you and your Muslim Brotherhood m*******f******","post_message":"Michelle Obama Banned Valentines Day In Schools She can't take love away from America's children. Do you think she is a horrible first lady?"}]
