[{"comment_id":"10154064553747464","commenter_b":"Gaining delegates is part of how you win, especially in an open convention. He'd be crazy *not* to. It's something Trump is learning the hard way.","commenter_a":"Why use every edge known to man Cruz, just have a straight up best man with the most votes win's. You cheapened yourself pandering for delegates, it appeared slimey and desperate. Also why did you go to the border with Beck to hand out welcome boxes to ILLEGALS that were entering our country ILLEGALLY if you really believe in the wall and making already existing ILLEGALS leave this country????","post_message":"Join us on Monday for #CruzOnGMA!"},{"comment_id":"1045198175503230","commenter_b":"BS, keep our money home to help Americans who need it.","commenter_a":"What the??","post_message":"Obama pledged millions of dollars to fight climate change abroad. And it comes straight from YOUR pocket!"},{"comment_id":"10153352524191179","commenter_b":"B**ches","commenter_a":"No class!...it really starts at home","post_message":"Arizona high school students' racism even offends Arizona"},{"comment_id":"10153941294344342","commenter_b":"Trump = hate, fear, Hillary = corporate rep, liar, Bernie = peace, unity. He is right. I'd be happy to vote for him. Sad to just vote because I dislike someone more than the other option.","commenter_a":"Bernie wants to ban hydraulic fracturing everywhere. This would significantly reduce American energy production and directly cause oil&gas prices to raise. Not only this, the United States would have to depend on foreign oil once again. There is no reason to ban hydraulic fracturing and deny our citizens the right to exploit their resources for the benefit of us all. If you are convince fracking cause water to catch fire. I really encourage you to pull back a layer and devour the research. You can start by researching academic studies from Standford and Ohio University regarding hydraulic fracturing. Some of the chemicals used in the prop or fluid are hydrocarbons. Ofcourse if you go to ecowatch or earthjustice you will get an exaggerated and depressing perspective that is meant to excite you and encourage you to make a donation. So the few activist can pay for their mortgage and car ...","post_message":"\"I am running for president because I want to give the American people a real choice in this election.\""},{"comment_id":"1025902810798360","commenter_b":"@username you are crooked and You are a loser. You are a complete disgrace. You will not make America great again. You have no idea what you are doing. You are a complete idiot. Do us all a favor and drop out. Stop spreading hate. The only reason your rich is because you got money from your father. you are going to make America a laughing stock. please reply to this message. Be a man and reply to my message. Debate me. don't be a chicken.","commenter_a":"@username you are crooked and You are a loser. You are a complete disgrace. You will not make America great again. You have no idea what you are doing. You are a complete idiot. Do us all a favor and drop out. Stop spreading hate. The only reason your rich is because you got money from your father. you are going to make America a laughing stock. please reply to this message. Be a man and reply to my message. Debate me. don't be a chicken.","post_message":"Thank you for the incredible amount of support last night- San Jose, California. I love you all - we will deal with the thugs & criminals -- we will build the wall --- and Mexico will pay for it!"},{"comment_id":"1786910708245530","commenter_b":"She is a liar !!","commenter_a":"Imagine a Trump led America With a vision to make us great, Builder, businessman, father, With a leader, fighter trait. Imagine factories buzzing, Oil flowing out of the ground, Coal miners packing their lunches, People talking about jobs they've found. Soldiers, sailors, airmen, marines, Showered with Presidential Pride, Strong and able to keep us safe, Respected and feared worldwide. Imagine a really, really big wall, With a big, beautiful door, Swings one way to put out the bad, The other to let in the good. ISIS not even a JV team, Russian Bear back in its cage, Iran decided to take a new deal, Israel safe from all rage. Imagine a man of integrity, A man the world will respect, A man who will fill the office With all the honor we expect. Imagine a Trump led America With a vision to make us Great, Imagine a Trump led America ...","post_message":"FACT-CHECK:"},{"comment_id":"957334017635027","commenter_b":"He actually was not shackled. Its amazing how many people read cop blocks statement and dont even watch video or just flat out imagine what your seeing all because cop block intentionally manipulated you.","commenter_a":"Look, whatever the guy was arrested for, it doesn't make it right for that cop to beat on him. Even with the guy getting in the cops face and yelling. It doesn't make it right. The fucking guy is shackled. Cops aren't gods! They have no right to pass judgment and treat you like an animal.","post_message":"POLICE BRUTALITY caught on video! Is anyone REALLY going to try to justify this? From (Y) Counter Current News - MBD"}]
