[{"comment_id":"688195661362262","commenter_b":"You are awesome president Obama! !!! Thank you for all you've done","commenter_a":"This guy is a crook 2","post_message":"LIVE - President Obama on the Election Night win of President-elect Donald Trump."},{"comment_id":"1211910735512691","commenter_b":"Duck you you racist old bitch","commenter_a":"Stop drinking you juice head.","post_message":"This racist woman went off on two Hispanic shoppers with a racist rant  and no one did anything to stop her.  More on this story here: @webpagelink"},{"comment_id":"10153891729051680","commenter_b":"While Melania was pregnant.","commenter_a":"Right, because he was just a young, naïve, 59-year-old predator.","post_message":"Donald Trump released a video statement apologizing for his sexually aggressive comments about women, saying the words caught on tape in 2005 do not regret who he is."},{"comment_id":"10153215772461943","commenter_b":"I don't trust her, Should be tried for treason","commenter_a":"Was never any doubt, when her mouth moves, she is lying!","post_message":"** Now we have smoking gun proof of Hillary Clinton involvement in the lying Benghazi  points used by Susan Rice... Please SHARE this breaking news story! **"},{"comment_id":"10153005003572377","commenter_b":"Obama in the Alaskan wilderness? Ha, Grylls will be smothered by the Obama entourage!","commenter_a":"Guess I won't be watching that show any more unless. .......Obama doesn't make it!","post_message":"President Obama will soon be running wild Bear Grylls in the Alaskan wilderness."},{"comment_id":"10153051145414094","commenter_b":"And if gun laws don't work, why have any safety laws? Should hardware stores sell nuclear material because the bad guys will get anyways? Should we not have traffic laws because the bad drivers will run a stop light anyways and crash into a school bus?","commenter_a":"While Republicans were defending the lack of sensible gun laws and calling this an 'accident', the families and communities of this Church showed such dignity and Christian values by first saying that they forgive the shooter. They are such an amazing example and inspiration to this country. God bless them.","post_message":"Relatives of people killed in a shooting at a black church in Charleston, S.C., addressed the suspect in court Friday In an extraordinary display of grief and forgiveness."},{"comment_id":"994271287356316","commenter_b":"Hell no our government is so jacked in the head they need a 50 caliber hole there to straighten them out","commenter_a":"🖕🏿off your selfs in silence. how ignorant","post_message":"Would it be unchristian if I said in a Texas accent ... 'Eff them?' Help me. Your friend, Doug in Texas. @webpagelink"}]
