[{"comment_id":"10153898665266336","commenter_b":"Don't forget about us crazy white women !!","commenter_a":"The white boys who are already here have horrible things on their minds. When are you going to call for them to be banned Donald the clown? @webpagelink","post_message":"On last night's 'The O'Reilly Factor,' Donald J. Trump defended his proposed Muslim ban and said the U.S. \"cannot allow people to come into this country that have horrible things on their mind.\" @webpagelink"},{"comment_id":"10153451466636336","commenter_b":"That's why I tagged you in this lol","commenter_a":"Sarah Garvey","post_message":"NEWLY RELEASED: The official images from the christening of Princess Charlotte have been made public by Kensington Palace."},{"comment_id":"10155900570730354","commenter_b":"IRAN PUT OUT A MESSAGE TODAY SAYING \"DEATH TO AMERICANS\". THAT WAS TODAY FOLKS TODAY....OBAMA IS THE WORST MAN IN THE HISTORY OF THE WORLD. HE WILL HAVE PAY FOR WHAT HE IS DOING TO THIS COUNTRY. IT WONT BE TOMORROW BUT IT WILL HAPPEN. KARMA IS A BITCH.","commenter_a":"AND IS ANYBODY REALLY SURPRISED OR SHOCKED THAT OBAMA LIED? THAT'S WHAT HE DOES BEST.","post_message":"See the updated language comparison... this just keeps getting more PATHETIC:"},{"comment_id":"10153132008994497","commenter_b":"Conceded bitch... this shit practically writes itself. Lol","commenter_a":"This sick beat. Oh no!! Now what? Gimme a break. Never heard something so idiotic. A phrase? Boooooo!! :)","post_message":"From our sister publication:  The A.V. Club: \"From this day forward, any and all sick beats belong to Taylor Swift, under penalty of law.\""},{"comment_id":"902473139819442","commenter_b":"Even woodpeckers for fucks sake. If they're damaging your house, or your property, guess what, you can shoot it","commenter_a":"Bring back fox hunting - look at the state of this fox -","post_message":"Fox Busted In The Hen House Literally!"},{"comment_id":"10154743377731037","commenter_b":"Keep 'em coming. Nothing's going to change my mind or anyone else's. The one thing that all of you had in common before today is that Hillary already had you fooled. It's not working on the rest of us, so sit back and enjoy the next four years that not only I know is coming, but SHE CLEARLY KNOWS IS COMING, hence the grasping at straws that we are witnessing this morning.","commenter_a":"It's hard to distinguish between the most rotten pile of trash this morning! You have: -the \"accusers\", who have remained silent throughout the whole campaign until Andy Cooper asked a question that, in his coke-addled and cock-obsessed mind, he thought would surely win him a Pulitzer. -the Clintons. ('Nuff said) -the MSM thinking that we'd all just magically buy this crap. Don't be fooled, America. You see the direction that they are bending over backwards to point you in. Vote Trump and let them know that you're not going to stand for it any longer!","post_message":"A woman alleges she was raped by Donald J. Trump when she was 13 years old in the mid-1990 — and now Law & Order: Special Victims Unit' is taking on the case."},{"comment_id":"10152746114636545","commenter_b":"That's bootylicious","commenter_a":"Kaci, Ryan, Anthony and Cory - get home ASAP but do so in a safe manner.","post_message":"The roads are getting worse everywhere in North Texas and accidents are starting to pile up. Check the traffic conditions if you need to go anywhere.   TRAFFIC: @webpagelink"}]
