[{"comment_id":"1625393254140954","commenter_b":"This guy is a certified idiot!","commenter_a":"This Cummings punk is the king of demegogoury. The only person I find more dispicable is Chucky Schumer.","post_message":"The Democrats have been parodies of themselves for so long they fell for another parody."},{"comment_id":"1397503370290352","commenter_b":"Shellie","commenter_a":"Hahahaha fool","post_message":"Absolutely Hilarious... Spread this everywhere!"},{"comment_id":"10153982122994071","commenter_b":"Stfu","commenter_a":"No, no they shouldn't ... this is a classic example of over extending and away from your core business. The ramp up time is too long and the others can fill the gap fast. They need to stick to immediate delivery systems.","post_message":"Amazon.com is coming for the grocery industry."},{"comment_id":"10153956285791880","commenter_b":"@username I'm white. I'm not mad bro. But was that kid in Ferguson mo a thug and literally just robbed. Convenience store? Sure back lives matter.. I'm indifferent tho.. Any race, sex or creed comes at me Wrong I'll end you. Period.","commenter_a":"All the white ppl mad!! Lmao, after the 400+yrs of oppression that they weren't victims of, they want to be included in a black lives matter movement... Smh, never been discriminated against, but black lives matter is a racist cult?? Can't c the forest from the trees...","post_message":"The Facebook CEO issued a companywide memo chastising employees who have been crossing out the phrase “black lives matter” and writing “all lives matter.”"},{"comment_id":"939636916071768","commenter_b":"She's a whore? @username you are a crude, ignorant troll.","commenter_a":"The first real scientific post-debate poll results are out and they are great news for Hillary Clinton. According to the just released Huffington Post/YouGov poll, 55% say Clinton won the debate as compared to just 22% who said Sanders did. Furthermore, 52% in the national poll now say they want Clinton to be the nominee, up from 44% prior to the debate. All in all, a great result that matches the media's assessment of who won the debate, our next President, Hillary Clinton!","post_message":"Larry David is Bernie Sanders."},{"comment_id":"1279026295523755","commenter_b":"Translation: \"such a nasty woman\"/\"Bitch\"","commenter_a":"I just have to laugh about this because he represents himself so horribly and it just scores points for Hillary. She is tough and takes it like a woman because women are strong and tough!","post_message":"Absolutely deplorable."},{"comment_id":"10153480820949726","commenter_b":"Skank whore.","commenter_a":"That song is getting a little old hillary...just like you","post_message":"WATCH: Hillary Clinton targets Wall Street!"}]
