[{"comment_id":"10153698259961320","commenter_b":"She's the devil in disguise.","commenter_a":"She doesn't have to worry about any boyfriend and hopefully for a long time!","post_message":"What a horrible human being.  Authorities have released text messages that allegedly detail how 18-year-old Michelle Carter texted her boyfriend, Conrad Roy III encouraging him to commit suicide. Read what she said: @webpagelink"},{"comment_id":"1128964310481999","commenter_b":"Dayton Huebner thank you for proving yet again that one can't cure stupid or open a closed mind. Just once I wish people who are still stuck in the 50's definition of communism would educate themselves. You aren't even close.","commenter_a":"I've never contributed any financial assistance to a political campaign before. Couple days ago, I did, and it went to the campaign of Bernie Sanders. I don't usually trust politicians, and I don't ever remember being as excited as I am today about a candidate running for the White House. Bernie Sanders has not only earned my vote, but also my contribution to his campaign. Bernie Sanders has raised millions of dollars from small contributions from middle-class, ordinary families, unlike most politicians that go to their Wall Street buddies to beg for big cash donations. Bernie Sanders doesn't flip-flop on issues like most politicians do, his message was the same back in the 1990's. You can youtube it, it's incredible how honest and passionate he is, and has been about the need for our government to work and represent all Americans, and not just those at the very top. I ...","post_message":"In 1944, President Franklin D. Roosevelt presaged Bernie Sanders by calling for a \"Second Bill of Rights\" of an economic nature. They were:  The right to a useful and remunerative job in the industries or shops or farms or mines of the nation; The right to earn enough to provide adequate food and clothing and recreation; The right of every businessman, large and small, to trade in an atmosphere of freedom from unfair competition and domination by monopolies at home or abroad; The right of every family to a decent home; The right to adequate medical care and the opportunity to achieve and enjoy good health; The right to adequate protection from the economic fears of old age, sickness, accident, and unemployment; The right to a good education.  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153584523586336","commenter_b":"I'm not an Alabama fan, but if I was, I'd be truly upset with this video..... Not one time did those girls say \"roll tide\".... I'd ban it too!! GBO #rockytop","commenter_a":"I just love when someone judges something they know nothing about.","post_message":"The recruitment video has been criticized for lacking diversity and objectifying women."},{"comment_id":"2049822328577410","commenter_b":"@username Mexican rapists.","commenter_a":"My question is, why is the inauguration not being cancelled until all of this has been investigated and charges brought together? Why is nothing being done?","post_message":"\"Either Donald J. Trump and friends have engaged in treasonous acts or America’s intelligence officials are guilty of a colossal lapse in judgment — or worse, a conspiracy against Trump. Either way — whether any of these allegations are true or false — the entire matter must be investigated thoroughly and immediately.\" - Bill Moyers and Michael Winship"},{"comment_id":"1847137338904678","commenter_b":"Everywhere these devils go, they rape and murder the rest of the people. Just ask the Native Americans, the Aboriginies of Australia, and the countless number of African countries that still suffer from the effects of all the death and destruction caused by what the devils call imperialism and colonization. The devil who comes disguised as white people is absolutely disagreeable to live with in peace. It's been proven time and time again.","commenter_a":"Didn't take long for the racial comments on a post that has nothing to do with race. You are the people that make today's issues more of an issue than it needs to be. This man is disgusting","post_message":"SHOCKING! A sheriff's deputy is charged after he allegedly posted video of himself performing a sex act with a dog."},{"comment_id":"1011935972208484","commenter_b":"No amnesty. We need to figure out exactly how many workers our farmers need and make it easy to give immigrants return visas once they have been vetted then give them 5 year vias, before needing to reapply.","commenter_a":"Democrats, you have one job this November: Don't give our country to the GOP! Elect a Democratic President and give them a Democratic Congress to work with! And complete the job by dumping the GOP from state and local government!","post_message":"'Nuff said.   Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154650449348987","commenter_b":"What are the plans for Jax airport?","commenter_a":"Protect outside animals from water, rising, falling etc...","post_message":"Mike has the latest track change for Hurricane Matthew. Tune in and ask questions!"}]
