[{"comment_id":"652024288284285","commenter_b":"I'm so glad.","commenter_a":"Yes","post_message":"Muslim Miss USA Chooses Jesus Over Mohammed... Islamic Community FURIOUS  She has the right to believe whatever she wants to believe.   Do you support her choice?"},{"comment_id":"1111151122296756","commenter_b":"This makes Chicago sound a lot like Baltimore for the \"quality\" (corrupt, criminal) of incumbent leadership (I grew up in the south side of Chicago all the way back to the 60's - and am not much impressed with what the present day enthusiasts think of my opinion. I also lived for a while in Viet Nam, and there we were allowed to call the other guys \"enemy\", and to shoot back at targets of opportunity, ... just sayin\") @webpagelink","commenter_a":"I knew there was a dirty Democrat involved in that ruckus!","post_message":"Inside scoop, here . . ."},{"comment_id":"367721800082095","commenter_b":"Lol \"rape culture\" sweetie go live in the Congo where the war lords use rape as a tool and come back and tell me this label is \"rape culture\" rape is a serious and horrible crime that doesn't need to be trivialized with your suburban feminist mindset.","commenter_a":"Rape culture nonsense again. The world gone mad. Get a life feminists. A slogan on the beer isnt going to encourage rape for fuck sake.","post_message":"\"The perfect beer for removing 'no' from your vocabulary for the night.\"   What?!?!"},{"comment_id":"10152922830971491","commenter_b":"@username, you killed my sides.","commenter_a":"So many hateful comments. Why?!","post_message":"“God chose us to take care of these babies.”"},{"comment_id":"10150715134694999","commenter_b":"@username Illegal immigrants steal roughly 9 billion dollars worth of resources reserved for American citizens every year. Deporting them per our existing laws will save us a ton of money...any more brain busters?","commenter_a":"What's even more appalling is that he's polling at 39% of Republican + Republican-leaning registered voters in the latest CNN poll. ...What does this say about our country and how folks want our supposed leaders to behave? What is this acceptance of ongoing crass commentary? ...And what happened to equanimity and professionalism?","post_message":"Donald J. Trump called Hillary Clinton's mid-debate bathroom break \"disgusting.\" Frank Bruni says it's \"the rare man-child who finds that worthy of ridicule.\"  Read on in The New York Times Opinion Section."},{"comment_id":"906810012772083","commenter_b":"He hit that hoe!","commenter_a":"@username found it","post_message":"Chik-Fil-A Stays Lit!"},{"comment_id":"1588980671119277","commenter_b":"Agree all the way.the truth is black or white, can be proved.lies can not be proven.the cons get mad because facts on mostly on the liberal side. We can't help it if they love lies and are prejudiced to believe them.warped sub humans.","commenter_a":"Without fake news he and the GOP are dead in the water. Then all they have left is election rigging, voter suppression, and Gerrymandering. Oh yeah, and help from COMMUNIST Russia! And that just ain't enough!! #GOPTraitors","post_message":""}]
