[{"comment_id":"1701200686777335","commenter_b":"Gun laws will not effect non-American \"Crazy\" residents taking advantage of our Freedoms.","commenter_a":"What do you think the USA has done all over the planet.....we have bombed and killed thousands upon thousands of innocents and we are the victims? I think not","post_message":"“They want to blow up our country. They want to blow up our cities. They want to knock down our buildings, and [Pres. Barack Obama’s] worried about global warming. We have somebody that’s not in touch.” – Donald J. Trump"},{"comment_id":"10153506145308690","commenter_b":"and one manyetanyahu or whatever is his name of israel","commenter_a":"Arrest Bush , Cheney , Blair , Rumsfeld and all the WarCriminals !","post_message":"\"I wanted SA to arrest #Bashir. Not because of ICC, but more to see the shock and fear in the eyes of all the other African leaders.\""},{"comment_id":"10153538645367232","commenter_b":"Yous are CRAZY, certainly it HAD to ALWAYS be a GHETTO, NO one would ruin a neighborhood ;)","commenter_a":"What Camden used to look like before the take over.","post_message":"Females attack woman with pole on South Jersey street in broad daylight and it was caught on camera: WATCH THE VIDEO => @webpagelink"},{"comment_id":"10154507086148984","commenter_b":"She was instructed to keep her hands on the dash...smh","commenter_a":"Not even surprised by this video, their false narratives always fall apart.. And instead of rendering aid to her boyfriend she continues to record, can't be more self-centered than that.","post_message":"Right after Philando Castile was identified as the man killed by police, people started talking about what a wonderful guy he was. But we've found video of what he was caught doing to a helpless child before he was killed, and it will make you sick. Don't expect to hear about this anywhere but here..."},{"comment_id":"675915449265700","commenter_b":"Muslims are animals,filthy Scum!","commenter_a":"Get rid of all muslims there nothing but problems.","post_message":"Putin just verbally destroyed this Muslim ambassador. He's on a mission to put an end to Muslim brotherhood. Are you glad someone is standing up to ISIS?"},{"comment_id":"1154585737915740","commenter_b":"She wasn't going anything wrong. Shame on these liars!!!!!!!","commenter_a":"No class . Needs to move to Detroit where she belongs .Lol Trump for president","post_message":"What Michelle Obama Was Caught Doing At Nancy Reagan's Funeral Will Make You SICK The Obama's have absolutely no respect. Do you think she is the worst first lady ever?"},{"comment_id":"1001016903307871","commenter_b":"this woman is vial","commenter_a":"Can she get away with everything!! She and Bill both should have been in prison over this too!!","post_message":"Independent Counsel Laying Out Criminal Case against Hillary Clinton in Whitewater Land Scandal."}]
