[{"comment_id":"1163546927012391","commenter_b":"Janette Smith just wow I can't even!! U are delusional do u have kids? I hope not","commenter_a":"I hope he escapes.","post_message":"MISSING: Louis Dean Rende, 12, has run away from his Spring Hill home. He is 4-foot-6, and was wearing a red or orange shirt, dark shorts, and might be wearing hiking boots. He has a scar above the right knee. If you see him please call 911 or the Pasco sheriff at 727-847-8102. Leave a tip at 800-706-2488."},{"comment_id":"1382199778464035","commenter_b":"Your a bitch","commenter_a":"I'm sure the First Sasquatch offered so much advice, what did she do...come to the defense of her brother Harambe?","post_message":"First Lady Obama took apart Trump, and just gave Republicans even more to worry about."},{"comment_id":"10154895009386337","commenter_b":"A pussy with a ring...yah right!","commenter_a":"Jefferson has always been a pussy!","post_message":"LOL. Joel Embiid cares not for your veteran status, Richard Jefferson..."},{"comment_id":"10153614768367550","commenter_b":"Women shut da hell up I'm short hand writing","commenter_a":"People be ready to dissect the situation, wen in reality it's the system fault. What do you expect it's no jobs in Fayetteville. People looking at what I'm saying and they're lik Wat is he talking bout. Like I said it is no jobs in Fayetteville, and this is suppose to be a military town it should be jobs all over the place but it's not. It's three types of ppl in Fayetteville. The military, the civilians that's what they call us. And the third is ppl who do what ever it takes to get paid or feed they family. Now don't get me wrong yea it's messed up ppl breaking in ppl houses. But give these ppl job's and I bet all the money in the world they become a better civilian then the first person who commented on this topic. @username. No job's and this is Wat u ...","post_message":"\"And you're charged with a similar crime that you just went to prison for?\"  \"Yes, Sir\""},{"comment_id":"10154296449440329","commenter_b":"@username no need to hide farts no? HAHAHA","commenter_a":"Oliver Wales","post_message":"\"Someday you'll meet someone amazing who just gets you. And they won't want to date you either.\""},{"comment_id":"10153529915413010","commenter_b":"slave labor??","commenter_a":"Here's an idea..... Send the illegals home and put nonviolent incarcerated inmates to work on these farms.","post_message":"\"We have a large population of people who came here to work, not to be any kind of a security threat to anybody,\" said Bryan Little, of the California Farm Bureau Association.   \"And they came to work in an industry that needs them badly.\""},{"comment_id":"10152578962070736","commenter_b":"Women don't have penises.","commenter_a":"If this woman was so uncomfortable being in a locker room with a transgendered person, would she be just as uncomfortable being in the locker room with another female? Because that is essentially what she is complaining about.","post_message":"LGBT activists have applauded the gym's decision, saying the 'no judgment zone' promotes privacy and safety."}]
