[{"comment_id":"853673114823265","commenter_b":"Hilderbeast is a lesbian. She don't want no pecker...just power.","commenter_a":"Bill said he couldn't father a child because he contracted mumps as a teenager that made him sterile. Hillary had an affair with Webb Hubbell who is the father of Chelsea. How could he then be this girl's father? A paternity test will answer the question.","post_message":"Teen girl comes forward at worst possible time. She just dropped a bombshell right in the Clinton's lap. Do you think Hillary has no chance at winning?"},{"comment_id":"456493334475707","commenter_b":"Fuck u bitch and that pedophile country PISSRAEL","commenter_a":"PISSRAEL","post_message":"In the following report, we’ve replaced references to Israel with the Islamic State of Iraq and Syria (ISIS) to make a point about how differently they are treated by the media and politicians."},{"comment_id":"10153219716141336","commenter_b":"Geraldo is out there looking for trouble. He does not belong there.","commenter_a":"Sick of All of this!","post_message":"Geraldo Rivera reacts to the current atmosphere in Baltimore as police make arrests: \"The cops are swarming over the demonstrators that have defied the curfew.\"  Tune in to 'Hannity' for continuing LIVE coverage."},{"comment_id":"10153608717341491","commenter_b":"You can't win when 74% of women hate you","commenter_a":"They're saying \"it's the beginning of the end of Donald Trump\" since the first quarter of 2015. It's the beginning of the end of USA.","post_message":"Elise Jordan writes that Donald Trump's treatment of women will destroy his chances of being elected"},{"comment_id":"1124947717560231","commenter_b":"Hurry up woman!!","commenter_a":"Alright, that's it...we're moving to Colorado. @username","post_message":"It is absurd that here in America, we remain the only major country on earth not to guarantee health care to all people. If this proposal for universal health care can win in Colorado, I believe it will spread around the country."},{"comment_id":"1050627531700165","commenter_b":"Go Hillary!","commenter_a":"I don't think Republicans even talk a good game. Nothing but LIES and the people who vote for them are too stupid to see it.","post_message":"\"We cannot – and I will not – put our vets at the mercy of private insurance companies without any care coordination or leave them to fend for themselves with healthcare providers who have no expertise in the unique challenges that are facing our veterans.\"   --Hillary Clinton"},{"comment_id":"10153361671334032","commenter_b":"There's a huge difference between hearing loss and deafness. Its nothing at all like your eyes that are fixed with glasses. Patti. There are resources. Tomorrow if I can remember and find this again I'll list them or PM you. I don't know what the current name for the former Self Help for the Hard of Hearing. I'm not sure if you still have hearing aids. If you do find a good audiologist ASAP and don't stop until you find someone who treats you like you are their only client and their business dependent on your satisfaction. Anything less you shouldn't accept. If you can ever afford new hearing aids you MUST get digital. They don't know how long the current ones last. They haven't been out long enough to start failing. 10+ years for the current Gen. The biggest and very common thing people with hearing loss do is ...","commenter_a":"I just want to interject that driving while hearing impaired is not any more dangerous than while hearing. Your freaking out while driving is only in your head.","post_message":"What could just one day with a slight hearing loss teach a woman about what it's like to live every day without one of her five senses?"}]
