[{"comment_id":"10153732758118487","commenter_b":"Lolololololol people still believing in the \"good savage\" myth.","commenter_a":"Read it and weep. Colombus himself perhaps best conveyed this in his writings, describing the indigenous people as \"...the best people in the world and above all the gentlest—without knowledge of what is evil—nor do they murder or steal…they love their neighbors as themselves and they have the sweetest talk in the world…always laughing....They are very simple and honest and exceedingly liberal with all they have, none of them refusing anything he may possess when he is asked for it. They exhibit great love toward all others in preference to themselves.” Colombus shamelessly describes his vicious thoughts, oblivious to his own inhumanity : “They would make fine servants. With fifty men we could subjugate them all and make them do whatever we want.” -Howard Zinn's A People's History","post_message":"Before it became the New World, the Western Hemisphere was vastly more populous and sophisticated than has been thought."},{"comment_id":"10154134497810575","commenter_b":"I'm so sorry for your lost child. It sad and terrible we are being made to put up with these illegal criminal invaders.","commenter_a":"Hang him and the next ten people who allowed him to be here.","post_message":"NEW YORK GIRL DIES AFTER BEING HIT BY TWICE DEPORTED ILLEGAL ALIEN...."},{"comment_id":"10153312130831051","commenter_b":"its a MUTE SUBJECT!!! THERES NOT ONE RUNNING FOR PRESIDENT ... AMERICANS ARE SICK OF THIS CRAP !!!!!!!!!!!","commenter_a":"I would beleive Mr Carson anyday over Obama or any of his men......","post_message":"The Obama administration just slammed Ben Carson for saying America shouldn’t elect a Muslim president. Who do you think is right here: Carson or the Obama administration?"},{"comment_id":"10154969717088352","commenter_b":"She need to sit in jail for a good 30 days!! Bet she won't think that's funny!","commenter_a":"And what's her punishment??!!!","post_message":"Massachusetts cop’s wife ‘faked robbery and spray-painted the letters BLM on her own home to blame Black Lives Matter supporters’"},{"comment_id":"1312061745499049","commenter_b":"You two are makeing it hard for people that are serious about their beliefs your making them look bad,so knock it off!","commenter_a":"#Theydontrepresentme","post_message":"\"After sharing my thoughts about the recent Women's March on Facebook, rabid feminists quickly attacked, displaying their 'tolerance' as they 'lovingly' called me a twat and worse. That didn't bother me. What irritated me was the 'We did this for you' remarks. Before these feminists march for me again, there's something I want them to know.\" @webpagelink"},{"comment_id":"10152975606714205","commenter_b":"Oh me and Lamar was talkin bout it all day lol","commenter_a":"Nae you hear about this??","post_message":"Rapper Rick Ross arrested after pistol-whipping a man."},{"comment_id":"756073464525834","commenter_b":"The best part about all these whining Christians & their rhetoric to defend Christ against a money hungry corporation(which bye strives to destroy mom& pop coffee shops) when ppl are already starving to death or hooked up on drugs. Your Christmas was actually started by Constantine, centered around & similar to pagan holidays to make the transition to Christianity easier. Constantine was actually a pagan until his death bed to where he rejoiced unto God and saved his soul. Why don't you silly Christians who so vehemently judge and live so unlike jesus did do some research on the Christmas tree... It's also pagan, right down to the star on top to the ornaments around it. America was founded on freedom of religion, but that only seems to apply if it's Christian. And yes, the indigenous natives were massacred by bible carrying spaniards, priests, English, Dutch etc. It doesn't matter ...","commenter_a":"This is my last bit about the god forsaken red cups (no pun intended), and thats it. And please read before commenting. Starbucks, is not \"catering to people outside this country\"... Starbucks is a free enterprise, and not obligated to tell you Merry Christmas, in fact, they are not obligated to even do something for the holidays. There are many born and raised here with different faiths and they ALL believe in god, just not Christmas. For example the Jewish believe in God whole heartedly, just not Jesus, which Christmas is about. They also celebrate Hanukkah this time of year. Christianity is not even the first religion in this country, and Christians came here and slaughtered the indiginous for not being Christian, so it's not surprising they still don't accept other religions or respect them. That being said, businesses SHOULD absolutely have the right to say Merry Christmas If they ...","post_message":"Oops doesn't really cover it."}]
