[{"comment_id":"557140984486841","commenter_b":".....Hypocrite HILLARY SAYS DONALD DOES NO RESPECT ALL AMERICAN AS SHE HAS NO RESPECT FOR AMERICA OR AMERICANS ONLY GLOBALISM....HILLARY HAS LOST HER WAY SHE HAS FORGOTTEN THIS IS OUR HOME 'AMERICA'. WE WANT TO KEEP OUR FAMILY SAFE!, WHILE HILLARY JUST WANTS TO APPEASE THE ILLEGALS ..","commenter_a":"#NeverEverHILLARY PERIOD!! #BILLANDHILLARYCAREERLIARS","post_message":"Hillary Clinton’s actions constitute all of the elements of a major criminal enterprise - she created a private illegal email server in order to hide her corrupt dealings. She did so knowing full well it would put American lives at risk by making classified information highly vulnerable to foreign hacking. But, she didn’t care – as long as it helped her get away with her crime, no risk to America was too great.  Then, to further cover-up her crime, she deleted 33,000 emails to keep them out of the hands of authorities and the American public.  As a further element of the criminal cover-up, she claimed under penalty of perjury that she turned over all of her work related emails. We now know this to be one more massive Clinton lie. The FBI found thousands of work-related emails she failed to turn over, including the new discovery this week of 15,000 more work-related emails she failed to disclose.  What is being uncovered now is one of the most shocking scandals in American political history."},{"comment_id":"367411220096110","commenter_b":"Dalia Montosa","commenter_a":"Katherine Cardenas","post_message":"No bridesmaids assistance necessary!"},{"comment_id":"1198210753566421","commenter_b":"She's a hack","commenter_a":"This isn't right. What is wrong with her?","post_message":"CNN HOST To Jill Stein: \"Have You Seen Any Direct Evidence That Anyone Hacked The Voting Systems In MI, WI And PA?\"...\"Um...no\" [VIDEO]   And then there's that whole issue with one of the states that only uses paper ballots...."},{"comment_id":"1131302460296897","commenter_b":"@username let Bill Clinton around them it might really happen.","commenter_a":"Pandering 101 taught by Professor @username. African Americans KNOW that you will ignore them again once the election is over. Your KKK ties and hot sauce lies are blatantly obvious. #NeverHillary #HotSauce #HillaryLies #TRUMPPENCE2016","post_message":"\"You want to give me a good send off? Go vote!\" —President Obama IWillVote.com"},{"comment_id":"640100692862928","commenter_b":"Trolls- in 4 years we have elections again- what if next time the candidate you don't like cheats to win? Will you be OK with a corrupt election system then?","commenter_a":"THEY HAVE A RIGHT TO TRY TO STOP IT JUST LIKE YOU THINK YOU HAVE A RIGHT TO DO IT.","post_message":"The fight for #Recount2016 continues! We deserve a voting system we can trust, that is accurate, secure and just. Despite the sabotage, political cronyism, bureaucratic hurdles, economic extortion, and legal maneuvering that has been thrown in our way, this historic first-ever multi-state presidential recount carries on. I'm here to give you the latest updates, answer your questions, and talk about next steps."},{"comment_id":"824413534273149","commenter_b":"She should point those racist fingers back at self!","commenter_a":"Do you really expect anything else from her? I'm not shocked at all. She's an idiot.","post_message":"This speech is shocking... even for her!  What Michelle says at this graduation ceremony will make you cringe!"},{"comment_id":"10152955356009071","commenter_b":"I know I said LMAO, but really hit me up... could use the help. ;-)","commenter_a":"Dear anyone... please contact me if you're up for some pro bono work to sharpen your skills! Lmao!","post_message":"It's a known fact that hacking makes money. But how much money?"}]
