[{"comment_id":"10152604943386615","commenter_b":"Ladies*","commenter_a":"It depends on if you see someone at the gym wearing them, or someone at Walmart...","post_message":"Lawmaker says yoga pants should be illegal: @webpagelink"},{"comment_id":"10153811229123433","commenter_b":"1. Hardly \"record\" when the number of abortions is going DOWN. In 1990, there were 1.6 million abortions performed. Today, it's a little over a million. Numbers don't lie. 2. Hundreds of thousands of women were getting abortions BEFORE Roe V Wade legalized them. You are more likely to die due to childbirth/pregnancy complications than an abortion. 3. You are contributing to your own problem. Teens that had received comprehensive sex ed were 60% LESS LIKELY to get pregnant. The states with abstinence only education have HIGHER rates of teen pregnancy compared to states that actually teach sex ed. Why do women get abortions? Unwanted pregnancy. Much less likely to get pregnant when you're using contraception. It's not rocket science. 4. Abortion isn't free. The Hyde Amendment prohibits any federal funding of abortions except in the case of incest, rape, or danger to the life of the mother. They most ...","commenter_a":"What do you call 350k annually, or 10,000 late term per year how many is \" record\"?@webpagelink","post_message":"From the trail in Iowa. Carly Fiorina wrongly claims that we're seeing \"record\" abortions. @webpagelink"},{"comment_id":"10153986689364916","commenter_b":"\"Ever sinned bitch?\" Christ would be so proud @username","commenter_a":"Umm...which value first? Cheating on your wives (plural). Coveting your daughter? Bigotry? Hate? Self- love? Love of money? The commandment \"Love your neighbor (does not say except Muslim, Black and/or Hispanic) as yourself\"","post_message":""},{"comment_id":"943023235797122","commenter_b":"And California lets the illegals vote so it is no good!","commenter_a":"California and NY for Hillary of course.... Trump the rest of the Country so","post_message":"Hillary Clinton won the popular vote for President by almost 3 million votes. Donald Trump will be inaugurated as the next President. That doesn't make sense for a democracy. The electoral college system needs to be changed."},{"comment_id":"10153500345233352","commenter_b":"Real women make it happen!! (:","commenter_a":"10.50 ???? I make $8.00 hr with 4 kids and a grandbaby,no child support,no housing I can tell a story","post_message":"Single mom, 22, reveals her struggle to live on McDonald’s wages of $10.50 an hour… and how she and her young son have to live in a moldy basement"},{"comment_id":"1052630838137004","commenter_b":"This bitch know all the new snacks before they hit the streets bitch be snoring and dont even sleep","commenter_a":"@username thug life overload","post_message":"Oh No: Big Girl Back At It Again & This Time She Has Lil Terrio Rapping!"},{"comment_id":"10153829014724091","commenter_b":"Does the witch have pizza","commenter_a":"Sounds like trump","post_message":"We're under a Tornado Watch -- checking in with Lee Goldberg on what we can expect."}]
