[{"comment_id":"10153704994641337","commenter_b":"Fuck off fag","commenter_a":"Here come the \"cause Obama is a Muslim\" comments","post_message":"#IStandWithAhmed: Even Barack Obama is showing his support for Ahmed Mohamed..."},{"comment_id":"10152919389451491","commenter_b":"I always knew that America needed more violent rape on TV.","commenter_a":"Patrick","post_message":"Game of Thrones is famous for its tragic weddings, but last night the show pushed that into even darker territory."},{"comment_id":"1163431957079567","commenter_b":"Lord knows what kind of sinister crap Letterman is in to. Look at him.","commenter_a":"Letterman stopped being funny/relevant in 1994.","post_message":"When did David Letterman morph into Father Time?  Yeesh."},{"comment_id":"1206961029346060","commenter_b":"You still haven't answered the RACE question","commenter_a":"He sounds like when I BS for word count in an essay.","post_message":"Donald J. Trump and Hillary Clinton faced off in their first presidential debate. TELL US: What questions did you want them to answer? Your comments may be used on our newscasts. You can also watch the debate live on CBS2 or on CBSNewYork.com, Join us on CBS2 at 11. #Debates2016"},{"comment_id":"10153321006269087","commenter_b":"What fucking jobs are the illegal immigrants are taking dum ass?? Please fucking tell me!!!","commenter_a":"94 million Americans are not working. Is it because they have become dependent upon the government? Or is it because the Illegal immigrants have all the jobs? 30 percent of all federal prisoners are illegal immigrants. Immigrants are killing Americans: According to the Center for Immigration Studies, 57 percent of the 76 fugitive murderers wanted by the FBI in 2009 immigrants entering the country illegally have a criminal record in the U.S.: In 2010, the Border Patrol reported that 212,000 illegals were caught in the Tucson, Ariz., sector alone, and as many as 30 percent of them already had a criminal record in the U.S. The Pew Research Center estimated that there are nearly 12 million illegal aliens in the nation and the key word is \"estimated\". What's wrong with deportation of illegals? The answer is: nothing. The country would be greater without them.","post_message":"\"The idea of tracking down and deporting 11 million people is absurd, inhumane, and un-American,\" Hillary Clinton tweeted. \"No, Trump.\""},{"comment_id":"949896131712475","commenter_b":"Even the black panthers want to kill white folks, lets start picking them up first and do something about them standing at festivals with AK 47's and other numerous guns, quit harping about only white folks having guns","commenter_a":"IT'S TIME TO DO SOMETHING ABOUT THE IDIOT'S THAT USE THE GUNS TO KILL PEOPLE SENSELESS...JUST CAUSE THEY PISSED OR DON'T LIKE YOUR COLOR!!!!!! NOT THE GUNS FAULT...THAT IS SO STUPID TO THINK IT'S THE GUNS FAULT...THAT'S LIKE SAYING BAN FORKS AND SPOONS FOR ALL THE OBESITY!!! TOTALLY INSANE!!!!!! LET'S BAN CARS FOR ALL THE WRECKS THAT KILL PEOPLE!!!! HEIGHT OF IGNORANCE!!!!!","post_message":"HELL YES!"},{"comment_id":"649308955259683","commenter_b":"Stfu you stupid bitch.","commenter_a":"Gifts from the illegals","post_message":"A new disease is spreading like wildfire, doctors calling it the new aids.  Share this with your friends and family.  Have you seen these symptoms?"}]
