[{"comment_id":"681728708652647","commenter_b":"why would anyone want a sick old lady in office @webpagelink","commenter_a":"We are stronger together unless you're a minority! Then people like @username and Obama will use your vote every single election while destroying your family and destroying your wealth! If you do get out of the horrible system that they have helped create, they will take credit for it when you have success! She is an embarrassment!","post_message":"We're stronger together—and the diversity of our athletes in Rio proved it."},{"comment_id":"10153091862830329","commenter_b":"Some women like to be told.","commenter_a":"This world needs to stop being offended by everything, and just let people live their lives.","post_message":"A pledge email from the University of Southern California’s Alpha Chi Omega chapter published by Jezebel today shows how authoritarian the sorority’s rules are for things like hair color, eyebrow shape, and required Spanx wearing."},{"comment_id":"10154020579286051","commenter_b":"Old dumb bitch","commenter_a":"This is a GOP lying bash Hillary bunch of bitches","post_message":"Describe Hillary Clinton in one word."},{"comment_id":"495634957263126","commenter_b":"u get the fuck away from us first we will leave ur shit","commenter_a":"Muzzies. This is why these scum don't belong in the West, they refuse to assimilate.","post_message":"\"We've kind of been forced back to the primitive ways of schooling.\""},{"comment_id":"992259924200395","commenter_b":"I do not believe recreational marijuana should be legalized. Medicinal marijuana, yes. But there are enough zombies wandering our streets and driving our roads already, we do not need a bunch of stoners driving.","commenter_a":"It's about time, the stigma needs to go.","post_message":"Finally! It's time to stop throwing kids in prison over a little pot."},{"comment_id":"533434026816552","commenter_b":"is that how YOU got in?? god dam roach.....","commenter_a":"Displaced... Bullshit . they are like Roach's spreading themselves out to bring their evil to more places","post_message":"\"Never has there been a greater need for tolerance, compassion and solidarity with people who have lost everything.\""},{"comment_id":"1043006319050712","commenter_b":"Limit the size of corporations ! Make them pay better wages and of course pay there taxes !","commenter_a":"It is important for one of the worlds' largest companies making huge profits, paying substandard wages, few benifits, manufacturing goods in the worst labor markets, akin to slavery to also hide it's money to avoid paying taxes to the government that provides medical care and food stamps to it's employees. After all what fun would it be to make obscene profits if you actually paid your fair share of taxes.....","post_message":"You won't find a Wal-Mart store in Luxembourg, but it does help the retailer avoid major US taxes."}]
