[{"comment_id":"10152785056866051","commenter_b":"how dumb are these women","commenter_a":"WTH!","post_message":"This prisoner impregnated not one, not two, not three, but four prison guards."},{"comment_id":"545673352289911","commenter_b":"Bitch","commenter_a":"Well the bitch is rich and scared of her own shadow... I will never watch a show hers again","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way. What a disgrace. She needs to deported to the Middle East. Do you think Nicole Kidman is a sell out?"},{"comment_id":"1125811740844678","commenter_b":"That is one crazy bitch!","commenter_a":"Am I dreaming?! Bernie supporters BOOED Nancy Pelosi?! Well, YAY! Be still my trembling heart! It couldn't happen to a \"nicer\" Democrat...except for ol' Hillary!!","post_message":"Hard not to enjoy this"},{"comment_id":"1363588373682001","commenter_b":"She should be a circus act, a walking talking pig!","commenter_a":"She's such a pig! She's irrelevant and is desperately attempting to retain some sort of notability. Yeah Rosie you and your big disgusting mouth will be remembered for the hateful words you've inflicted on society. Nice going!! I'm pretty sure you're own adopted kids figured you out and want nothing to do with you!? Very telling!","post_message":"Her tweet of a video questioning whether his young son, Barron, is autistic is nothing short of bullying."},{"comment_id":"1800130780216983","commenter_b":"Any misguided female.","commenter_a":"You should not talk about lying crooked murdering KILLERY that Way!,, her day is coming in jump suit in prison!!!!!! GOOOOOOOOO TRUMP TRUMP!!!!!","post_message":"\"Vote your conscience.\" Ted Cruz declines to endorse Donald J. Trump during his speech at the GOP Convention: @webpagelink"},{"comment_id":"1224398304283560","commenter_b":"I'm not here to judge anybody but whoever has the experiences will ultimately become the President. It's a done deal and nobody can deprive a woman of what she is duely qualified for . Our next president of United iiiStates of America is president @username.","commenter_a":"Kitty cat ? Lolololol So Republicans want a pig who assaults women as the next president of the mighty US of A","post_message":"This is horrific. We cannot allow this man to become president."},{"comment_id":"10153270679648984","commenter_b":"Get rid of them","commenter_a":"Didn't look bcz I don't care much for trash","post_message":"Holy cow, I did not see this coming! After so many years lurking in the shadows!"}]
