[{"comment_id":"10154729754221729","commenter_b":"She's a cunt.","commenter_a":"It does matter what you call it Killary , our young people in the United States were once again attacked .","post_message":"Whoa. About damn time."},{"comment_id":"1085651791446290","commenter_b":"I say shut them down. There are many clinics for health reason, but NOT abortions! We need to STOP abortions (murder)!","commenter_a":"health screenings,fine..but why do our taxes have to pay for birthcontrol??Tell me again, I don't understand....","post_message":"Americans want funding for women's health."},{"comment_id":"10154466561263701","commenter_b":"Shawna you just said what I'm thinking!!!","commenter_a":"Reading these comments show that the majority is against her, read a trump article and the majority is in favor of him. If she wins we will know how truly corrupt our election system is.","post_message":"What did you think of Hillary Clinton's DNC speech?"},{"comment_id":"530303733802764","commenter_b":"Today is your Birthday? Well, then Happy Birthday!!!","commenter_a":"Happy birthday! God bless","post_message":"My birthday wish is that our nation would once again recognize God as our leader."},{"comment_id":"10156556593115725","commenter_b":"she looks hot","commenter_a":"Nando Martinez - SHE IS A DOCTOR - @username","post_message":"A doctor has been placed on administrative leave after a controversial video showing her violent scuffle with an Uber driver went viral -----> @webpagelink"},{"comment_id":"10153773304673869","commenter_b":"shut up, fool.","commenter_a":"It's a Prince song and it belongs to him. She just found a hit that he threw away. He was just that good.","post_message":"There's a moment in “Nothing Compares 2 U” in which a doctor tells O’Connor “Girl, you better try to have fun, no matter what you do.” The advice is patently dumb—though not unfamiliar to any woman who has ever been told to just smile."},{"comment_id":"10154490897799657","commenter_b":"That bitch wants your guns so she wont get shot.","commenter_a":"she is brain damaged","post_message":"How far is Hillary willing to go to get your guns?"}]
