[{"comment_id":"802416633249035","commenter_b":"Trump supporters do not listen to reason or facts.. Exhibit A above","commenter_a":"Shameful. Was it a DNC rally??All of those actors from other countries that she showcased... They are not illegal immigrants!!! There's is a huge difference.","post_message":"What did you think of Meryl Streep speech?"},{"comment_id":"392258217629139","commenter_b":"Does that mean old fat women can go to a strip club and ask for a job when there is an opening and sue if they are turned down?...","commenter_a":"No it's not \"fair\"...she should conform like the rest of us. What the heck is she doing in the \"fashion world\" in the first place? There is absolutely no fashion in wearing a hijab. NONE.","post_message":"Is it fair that this Muslim girl sues for not being able to wear her headscarf when it goes against company's policy???"},{"comment_id":"10153319872961770","commenter_b":"What does Mexico have we can't go without WE don't need the Border jumpers We don't need all the drugs coming across they have nothing WE need in this Country and they will realize this and pay for the wall","commenter_a":"Great! Time to get these jobs back. TRUMP 2016!","post_message":"Donald J. Trump said he would be willing to start a trade war with Mexico in order to make the country pay for the wall along the US/Mexico border."},{"comment_id":"1805645433016457","commenter_b":"Congress stop her","commenter_a":"Hell Yes she's a racist traitor and one ugly Ass HE SHE or whatever it is.","post_message":"Michelle Obama is leaving her mark before she leaves. She wants to shut down our National museums for this absurd reason. Do you think Michelle Obama is a racist?"},{"comment_id":"578168169046751","commenter_b":"We do still have freedom of religion but I think these women would be so much better off just being free of wearing a hijab. Their so oppressed by men. Dumb the religion and live your life without restraint","commenter_a":"Let's say wear whatever you want in public, but when you go into a store, gas station, etc., EVERYTHING comes off from the neck up. Sunglasses included. And how about we lower the surveillance cameras to head height so we can get a decent face picture instead of a grainy aerial shot. Why are we continually so bad at surveillance? Be whatever religion you want, but for everyone's public safety, we deserve to get a good look at you so we can quickly identify you later on. Nuf sed.","post_message":"Pretty soon it may be illegal to wear a hijab in public in Georgia. Do you think the ban would be a good thing?"},{"comment_id":"1129640290462357","commenter_b":"My absolute joy will be when (not IF) Madame President is officially elected and we can all look back and say, once upon a time, Trump took out 15 Republican men, but 1 Democratic woman is the one who took HIM out. Music to my ears!!! I can't wait!!! All the haters NEED to get used to hearing Madame President. PERIOD, END OF DISCUSSION.","commenter_a":"I don't know what I'm more excited for- that Hillary is practically a guaranteed win or that I get to watch Trump fail miserably in front of the entire country.","post_message":"The Republican end times are here."},{"comment_id":"1163941390354988","commenter_b":"I'm also mad that she is not wearing the gloves. I couldn't care less about a corset. Wear the gloves!","commenter_a":"Ummmm...okay?","post_message":"Emma Watson isn't wearing a corset under that yellow dress. // Beauty and the Beast"}]
