[{"comment_id":"10154296566836491","commenter_b":"Cristina Cojocaru","commenter_a":"I can do this.","post_message":"Prepare to be amazed."},{"comment_id":"10152857633614753","commenter_b":"why these people even walking the earth...round them up and send them to isis","commenter_a":"Assholes a","post_message":"These people need to be banned from America."},{"comment_id":"10154641460388734","commenter_b":"Where there is smoke. There is fire. Only the individuals involved will ever know the truth.","commenter_a":"Hi Tony","post_message":"A woman accusing Republican Presidential nominee Donald Trump of ‘of victimizing her with inappropriate sexual conduct’ is speaking with the press for the first time."},{"comment_id":"10154242646146336","commenter_b":"Lots of ladies in Texas have CHL (concealed handgun license) enter at your own risk!","commenter_a":"Caitlyn Jenner is harmless. But lots of creeps out there will go into the women's room to do things other than pee. It's only a matter of time before we hear the horror stories. Be careful ladies.","post_message":"Donald J. Trump said this morning that he does not agree with North Carolina passing a law on bathroom use by transgender people.  He added that if Caitlyn Jenner visited Trump Tower she could use whichever bathroom she prefers. @webpagelink"},{"comment_id":"10153812435979218","commenter_b":"Watch out these Fkn MUSLIMS WILL BURN THEY'RE WAY INTO TOWN!!!?? MAKW EVERYONE LEAVE!?? GOOD JOB SHO EVER LET THE BLOCK GET BUSTED !!!?? I'D LOVE TO KNOW HOW MUCH INSURANCE WAS ON IT!! POOR DAMM FIRE FIGHTERS FIGHTING FOR NOTHING!!! GOD BLESS THE AMERICANS. UNITED WE STAND!!??","commenter_a":"Yeah arson. Hmmm.","post_message":"UPDATE: More photos from SkyTeam 11 of a large fire that has engulfed the old Milford Mill Swim Club >> @webpagelink"},{"comment_id":"10154159520288037","commenter_b":"They weren't misbehaving.im sure this girl was engaging in the drama as well","commenter_a":"Should've gone home and put on a Trump for prison shirt. I bet you the administration wouldn't have a problem with a short bashing a conservative","post_message":"She says she was told to change her shirt or go to in school suspension for the rest of the day because her shirt caused a classroom disruption."},{"comment_id":"10153847623528812","commenter_b":"Na u should go back to Europe and take inbred fascist friends with u","commenter_a":"Beat it and take Obama too","post_message":"14-year-old arrested after a homemade clock he brought to school was mistaken for a possible bomb will be attending school in the Middle East."}]
