[{"comment_id":"1372232146121032","commenter_b":"Chris Schiraldi really? Please tell me your source besides your opinion because that sure as hell isn't fact!!!!","commenter_a":"Yeah thanks for the lowest workforce participation rate in decades. Thanks for creating so many low wage/ low benefit jobs. Thanks for so many on food stamps because the economy sucks. And thanks yahoo for being yahoo... and that isn't much","post_message":"75 straight months of job gains. 15.8 million private sector jobs added since 2010.   Thanks, Barack Obama."},{"comment_id":"1137397219630950","commenter_b":"Hey Josh this chick is tripping. Lol","commenter_a":"#newyorkvalues","post_message":"“I don’t want money, I’m going to rape you.”"},{"comment_id":"10153683265791336","commenter_b":"Most illegals do not get food stamps or welfare. Tons of Republicans ARE on welfare.","commenter_a":"That's great all the illegals like to hit Trump..they have money for parties and pinatas thanks to welfare Checks and food stamps! If I was living off the government tit I would hate him too..but I don't and I want my country strong again so I like Donald Trump. Trump 2016","post_message":"“We sell out pretty fast.” - Guadalupe Mendez, salesperson   (CC: Donald J. Trump)"},{"comment_id":"10153236165233984","commenter_b":"Someone needs to sew a ZIPPER in her face!","commenter_a":"please STOPP","post_message":"Are you kidding me lady? Stop, just stop, please.  Do you think this new mandate is completely over the line?"},{"comment_id":"10153744432513984","commenter_b":"Keep hammer at them. Abortion is murder.","commenter_a":"I like Trey Gowdy...good for him.","post_message":"BOOM! Gowdy just laid the smack down on libs and Planned Parenthood with a series of hard-hitting questions that totally undermined the arguments in favor of abortion.  Do you support Trey Gowdy's fight to defund Planned Parenthood?"},{"comment_id":"1087153308047587","commenter_b":"I'll vote for a female for our President, but Hillary is not one that I want to vote for for President. I also think that if your spouse, or former spouse was already President, then you should not be allowed to run/be President; I also think that it should at least skip one generation for sons/daughters.","commenter_a":"Voted for President Obama because he is Black. Voting for Hilary because she's a woman. Why did anyone vote for the last 40 white male Presidents?","post_message":"\"Nothing gets me angrier than when someone implies that I'm voting for Hillary Clinton because she's a woman.\"  - Lena Dunham"},{"comment_id":"977002452335214","commenter_b":"Slaves","commenter_a":"the American people need to rebel against this. Citizens of a nation( especially one a great as america) should not have to live in fear of police persecution. The whole police force needs reform. The dirty cops, racist cops and just dam right bad police officers need to go. If your a trigger happy racist peace of shit who hides behind a badge and a gun to only parade around saying your a protector of peace, you need to be weeded out. Police in america don't know how to be police. Other countries around the world have polices forces that can control far greater numbers than america and without the casualties.","post_message":"Very disturbing video shows police killing a restrained man with three shots to the back."}]
