[{"comment_id":"10154179510106409","commenter_b":"Lmao. Now she can STFU.","commenter_a":"Lol. Yes!!! I saw this coming and I'm loving it. Fall of the bully. Does she still want to fight Mayweather? Dwl","post_message":""},{"comment_id":"10153976851960950","commenter_b":"Hillary husband, Bill Clinton, makes Bill Cosby look like a Saint.....","commenter_a":"Bring it baby. I used to feel sorry for Melania, but she is as bad as her bully pervert of a husband. All Trump cares about is his money. All Melania cares about is Trump's money.","post_message":"She is demanding a retraction and apology."},{"comment_id":"10153292055736367","commenter_b":"This is the problem with the Left: too dogmatic, judgmental and lacking in imagination. There is more than one way to think about this and more than one way to vote one's conscience... @webpagelink","commenter_a":"I'm voting for Stein if Sanders loses the nomination. Here's why... @webpagelink","post_message":"\"It is time to stop playing the game.\""},{"comment_id":"10154097655775736","commenter_b":"Threatening our non violent non threatening neighbors with war just because why not! Grounds for immediate impeachment!","commenter_a":"And there's no bad hombres up here?","post_message":"\"You have a bunch of bad hombres down there,\" Trump told Mexican President Enrique Pena Nieto, according to the excerpt seen by the Associated Press. \"You aren't doing enough to stop them. I think your military is scared. Our military isn't, so I just might send them down to take care of it.\""},{"comment_id":"10154522973374102","commenter_b":"She may be the lesser of two evils, a female, a scapegoat, but she's still a nut job.","commenter_a":"I'm not saying she doesn't deserve disciplinary action, because she does. But I find it disgusting that they are targeting ONLY her, and not Trump's tweets against Nordstrom. I get that she's an easier target for the GOP, but grow a pair of balls, please.","post_message":"BREAKING: The Republican chairman of the Oversight Committee is recommending disciplinary action against Kellyanne Conway for promoting Ivanka Trump products from the White House, including \"reprimand, suspension, demotion, or dismissal.”"},{"comment_id":"10153277341923188","commenter_b":"I do believe the \"offended\" have been organized by an outsider to bombard anyone helping to stabilize the area. It is not Whole Foods, The National Guard or the Police who need scrutinized! It's the Promoters who keep unrest in the media way beyond the time it is newsworthy! Always seems to be when there is a \"Political\" issue, Ferguson-illegal aliens, Baltimore- Clinton Foundation and the very questionable donations. Of course the nuke treaty with Iran, etc.! Protesters in both cities started out fairly calm. Then hordes of people started pouring out of the woodwork, looting, burning, destroying, many were not even from that area! How did they get organized so quick? I agree that All Lives Matter in every community. I also believe a huge % of our Police Departments are doing what they have to do with the Thugs who lack any respect for our laws! Rap sheets ...","commenter_a":"So sad they were doing the right thing.","post_message":""},{"comment_id":"10154469641506051","commenter_b":"Absolutely not. She's a damn joke too.","commenter_a":"I will never claim Trump as my president. What a damn joke!","post_message":"If this goes the way some expect it to, Donald Trump could very well be impeached."}]
