[{"comment_id":"936644226390980","commenter_b":"The typical holiness young woman will argue with a tree and maybe this is why they got together and removed this mother from the church the reason refused to listen to anyone else way of thinking you be bless and I hope you live as long as the 103, may the same happen to you","commenter_a":"From what the article said... she thinks he's trying to change the denomination of the church. .. this beautiful 103 mother misunderstands that Holiness is a way of life.. not a denomination.. the Pastor could have handled this better. .. there's no need to put her out of the church. . To be sanctified means to live a life separated from sin.. that's not a denomination either. .. sounds to me that teaching through love and kindness is in order.. people seem to fear what they don't understand. . To call her names and disrespect her by leaving her in a dark church is not right and does not reflect Holy living . They need to repent of that.. always respect your elders regardless. .. but also remember .. just because your old does not mean you know all the way of the Lord... no one does.. that's why we ...","post_message":"A 103-year-old Georgia woman was banned from the Elberton church she’s served for 92 years after she voiced concerns about the pastor’s sermons.  After ignoring the ban and attending church the weeks after getting the letter, the pastor dismissed the service and left her sitting in the pew with the lights off. Police were notified, but refused to throw a 103-year-old woman out of church.   She was also subjected to slurs from their former fellow churchgoers. MORE ----->  @webpagelink"},{"comment_id":"758408480932531","commenter_b":"A BRAVE WOMAN!","commenter_a":"Brave lady. Stay safe!","post_message":"Thanaa Jawabreh prompts a heated debate following a public apology for the ‘horrendous’ shooting attack that killed aIsraeli couple."},{"comment_id":"10153775506759203","commenter_b":"'@username Look over this list....Drugs & guns to YOUR front door, so tell me again how gun control works!!!! @webpagelink","commenter_a":"Gun bans have always had the same effect once implemented: none. They do not create a (sustained) period of increased murders, nor do they reduce the rate of homicides.. @webpagelink","post_message":"'We can toughen background checks and stop the sale of firearms to folks who have a violent history or history of mental illness.'  Amy Schumer"},{"comment_id":"1107229992636988","commenter_b":"This old Killer Bag just never gives up with her Lies. LIER, LIER, YOUR PANTS SUIT IS ON FIRE AGAIN.","commenter_a":"The thought of getting ready for Hillary is like getting ready for an 8 year long colonoscopy except the colonoscopy would be more pleasant.","post_message":"Ready or not, here she comes! Hillary is getting ready to announce, and I am getting ready for Hillary.  #HillarysBigAnnouncement #Hillary2016"},{"comment_id":"537038436486736","commenter_b":"PUKEBAG, Tax-evading, racist POS!","commenter_a":"What A Joke HE IS DEFINATELY TALKING OUT HIS ASS NOW","post_message":"Dr. Alveda slams Al Sharpton for comparing himself to MLK on live TV.  Al Sharpton and MLK should never be used in the same sentence.  Do your agree Al Sharpton is a criminal?"},{"comment_id":"1482796298404171","commenter_b":"'@username that's such a nice thing to say","commenter_a":"As an Asian non-American, I have a lot of similar feelings with people from the video. However, one thing I do not share is the that even I am not American, not born here, you still don't get to say 'go back to China' to me. I go where I want and I came here legally. America could be more friendly.","post_message":"An editor for The New York Times wrote an open letter to a woman who told him to 'go back to China.' Asian-Americans responded by sharing their own racist moments using #thisis2016. Here are some of those moments.  Warning: This video includes racial slurs and vulgarities."},{"comment_id":"10153039031790329","commenter_b":"Kriti Kothari","commenter_a":"One for you Bella La Verde","post_message":"Find out which one of these redheads will light your fire."}]
