[{"comment_id":"10153499650978132","commenter_b":"She's skanky. ...that's a door the should have stayed closed.","commenter_a":"Why can't she just retire and go away.","post_message":"Pink ambition!"},{"comment_id":"10154722156744749","commenter_b":"The 'girl who prepared' has a name. Her name is Hilary. When this 'dastardly' person can be called by name why not this lady?","commenter_a":"What a terrible statement...Clinton is a terrible example. She is a garbage","post_message":"\"Ten inches shorter, she towered over her rival. In 42 days’ time, Dastardly Donald deserves to get beaten by the girl who prepared.\""},{"comment_id":"10155498405191729","commenter_b":"That's where he belongs. Back stabbing ungrateful dodo.","commenter_a":"Eeek. What ticket would he be on? Dem?","post_message":"Interesting..."},{"comment_id":"10156346030730725","commenter_b":"@username We know you're illegal, Pack your bags buddy you're getting deported!!","commenter_a":"We love you here in South Carolina Mr Trump! #MAKEAMERICAGREATAGAIN #TRUMP2016","post_message":"THANK YOU for your support this evening Myrtle Beach, South Carolina! My family and I had a fabulous time with you this evening. Together we will #MakeAmericaGreatAgain!"},{"comment_id":"10153866172049411","commenter_b":"Jews can suck a dick","commenter_a":"Satanism and Islam are the same thing","post_message":" dudes have offered to escort Muslims and Sikhs afraid of hate-attacks for groceries and elsewhere."},{"comment_id":"10153150337159607","commenter_b":"He didn't live there 6 years. Stop believing everything you read, or make up in your head. Respect his family and friends right now and stop thinking this was a conspiracy","commenter_a":"Police did it he was going to expose the police for the dirty","post_message":"A Baltimore City police officer was found facedown in the water in South Baltimore Tuesday night. Officer Prashanth Davis, 34, was pronounced deceased at the scene."},{"comment_id":"10155930528244657","commenter_b":"Little brat!","commenter_a":"Disgusting beyond words!","post_message":"Even kids are joining in on the protesting."}]
