[{"comment_id":"10157390239980354","commenter_b":"Strip their citizenship and deport them. They do not deserve to be American citizens.","commenter_a":"BLM must be destroyed as a movement...just like the mob, or any other organized terrorist group.","post_message":"The BLM radicals shut down a CA freeway and vandalized an Oakland police station..."},{"comment_id":"1706668932888007","commenter_b":"Hillary is just another branch of the incompitent Obama tree. Only difference is she's a criminal and she'll be far worse for this country because she'll have to prove a point soley because she's a woman. Sorry, but I don't vote based on race or sex and I certainly won't vote for someone who has spent most of their political career filled with lies and cover ups.","commenter_a":"I CALL B.S....HILLARY HOMERS,...VOTE Donald Trump 2016..\"THE MAN FOR AMERICA\".","post_message":"Donald J. Trump's odds of winning the Republican nomination dropped 3 points on the Political Prediction Market after the #GOPDebate. Meanwhile Ted Cruz's odds ticked upward..."},{"comment_id":"10153707738441680","commenter_b":"Pathological liar","commenter_a":"When I read these hate filled comments I want to cry. All this hate for a person you do not know and neither do I. I just know that I read bills and reports . I try to see what you all say about Hillary but I just do not see it. I am educated And I am a women I also know if all that is said about her is true men she has defeated would have locked her up a long time ago She is not perfect has she made mistakes sure Haven't we all. I will cont to listen and research and vote for who is best for my children and grandchildren That vote will go to Hillary","post_message":"Hillary Clinton: \"Whatever party you belong to, or if you belong to no party at all, if you share these beliefs, this is your campaign.\""},{"comment_id":"10152869358831336","commenter_b":"We should get rid of the Kkk. This is not their land either.","commenter_a":"We should Deport Obama and his Kind back to Kenya or where they all came from this is our Land Not their's!!!","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad?  Watch and weigh in: @webpagelink"},{"comment_id":"464935007030413","commenter_b":"Best place in the world for a daily Pork roast.","commenter_a":"Deport their @&$)(;:/,?))&@@&))","post_message":"Should Islamberg Be Shut Down?  Comment 'yes' or 'no'."},{"comment_id":"10153455356180779","commenter_b":"@username Yes, she is, without a doubt!","commenter_a":"Dude is garbage. Talented but garbage. LOL trying to spark a feud with Taylor swift, makes a song about gold diggers then marries one...","post_message":"Nearly two months after 'The Life of Pablo' debuted at Madison Square Garden – followed by a Tidal stream-only release, a declaration that the album would never be on Apple Music, then the eventual dispersion of 'The Life of Pablo' to Apple Music and other streaming services – Kanye West's latest LP has finally found its way to the top of the Billboard 200."},{"comment_id":"10157133614025354","commenter_b":"Put the bitch in jail once and for all","commenter_a":"It's better to wait until after Obama is president to do anything to her. If something was to happen before then, he would give her a pardon.","post_message":"Don't worry, Hillary. The FBI is just getting all the findings from its one year investigation in order before giving you the chance to lie yet again about how you committed HISTORIC breaches of national security and auctioned State Dept. policies through the Clinton Foundation. #ClintonCash"}]
