[{"comment_id":"10153235771901167","commenter_b":"Pay close attention! And the Liberals love this guy? @webpagelink","commenter_a":"Exactly. Hate crime.","post_message":"Multiple Planned Parenthood clinics have been targeted in arson attacks since the release of highly edited videos trying to smear them. Why aren't you hearing about that on the news?"},{"comment_id":"10157371932040500","commenter_b":"Build that wall!","commenter_a":"Lithia FL","post_message":"WFLA Ian Oliver talking about Sunday weather and the latest on the tropics including Invest 99L."},{"comment_id":"10157706187460354","commenter_b":"She was a joke","commenter_a":"Thud... Rolling stumble... Face plant. \"Humph, that pit of lies I just tripped on was not clearly marked.\"","post_message":"Did you HEAR what Hillary said at the Commander-in-Chief Forum?!"},{"comment_id":"639520732905172","commenter_b":"Just the bitch she's always been","commenter_a":"Thank goodness she doesn't have her period any more at least now the women don't have to claim her gender what ever that is now. I agree with @username. I suppose when Buddy Borberly called her a bull dyke is a fair description.","post_message":"Rosie O’Donnell wants to go head to head with Trump by wiping this on peoples' faces. This is absolutely ridiculous. She should be ashamed of herself. Do you think Rosie O’Donnell needs to keep her nose out of politics?"},{"comment_id":"10154537125069024","commenter_b":"Bunch of boobs.","commenter_a":" Congratulations America!!Finally...a leader!!!! @webpagelink","post_message":""},{"comment_id":"10154199374772894","commenter_b":"Women need to stop playing themselves. He only wants money on his books.","commenter_a":"Well it's the thought that count.. At least she know that and accept it for what it is... But some of these hoes don't know bout that tho","post_message":"ICYMI: Apollo Nida Gave His New Fiancée an Engagement Ring Made Out of Paper Towels [Photos]"},{"comment_id":"221003188363637","commenter_b":"@username And worse!!!! No wonder she needs to shop!","commenter_a":"Wait wait wait...I thought Trump's doctor told us that if elected, Trump would be the fittest, healthiest man to ever serve as President! You mean I was lied to about Trump???","post_message":"TELL US IN THE COMMENTS!"}]
