[{"comment_id":"10152688677486491","commenter_b":"'@username Was 9/11 an act of American terrorism? WTC and Pentagon are both on US soil, right?","commenter_a":"Not Polish camp but German!!","post_message":"Hundreds of survivors returned to the Holocaust’s most infamous concentration camp today."},{"comment_id":"10153332076309411","commenter_b":"Remove NATO from their borders","commenter_a":"Russia must stop being aggressive by removing all warships, and submarines, from international waters - these waters belong to the US and its allies, even though they are international :)","post_message":"The 'hunt' is on"},{"comment_id":"10155160536813132","commenter_b":"I can't stand her...","commenter_a":"I don't know about her being an A-lister...","post_message":"Donald J. Trump spoke out about the decision on Twitter."},{"comment_id":"10154686014913010","commenter_b":"That idiot grabs my pussy and makes it hurt and I dont even have one","commenter_a":"Wow I can sleep better","post_message":"At least one prominent Republican is still backing Trump."},{"comment_id":"10158241911570405","commenter_b":"That part about Kansas is not true. Our state is so far in the hole and we do not have the 'workers' with that income. It was a pipe dream. The state just passed the largest tax increase in history because of the lack of income. Our budget fell short ever since this governor installed is plans.","commenter_a":"Once again @username when you source things from right wing rags, you lose credibility. Most won't even read it and those who do already support you. It's concerning that these are the only sources you can reference...","post_message":"Welfare Reform & Wisconsin: Walker Is Leading the Way | National Review @webpagelink"},{"comment_id":"10152988460430090","commenter_b":"Don't believe this stuuuupiiidd libtard propaganda!!!!!!! 64% of AMERICANS want the PIPELINE built l!!!!!!!!!!!!!! It will create 40000 jobs!!!!!!!!!","commenter_a":"So what that the Keystone has passed the Senate! That makes this oil no less dangerous to the American people! He has every right to veto something that only benefits 2 people, and of course those who were paid, Republicans and Democrats alike. Some ' American people' you are! Traitors to your own land! My guess is that none of you have read about the countless oil spills going on at this moment in America and Canada. With the Keystone XXL, you get only larger amounts of oil in our ecosystems. Yellowstone already has at least 50,00 gallons of oil in it!","post_message":"The House, the Senate and the American people have spoken.  Tell Obama: DO NOT VETO: @webpagelink"},{"comment_id":"10153471873556770","commenter_b":"'@username - afraid your husband will be deported huh?","commenter_a":"These Clowns are hilarious Dracula aka Cruz and Cruella Devile aka Fiorina ....She was dying for some spotlight....Well she will get if for about another month...Then Bye Bye weirdos","post_message":"During Carly Fiorina’s acceptance speech for running mate with Sen. Ted Cruz, Fiorina sang a made up nursery rhyme to Cruz’s daughters."}]
