[{"comment_id":"10153146580383352","commenter_b":"@username she is one lost soul,","commenter_a":"I Pray that evil spirt of homosexuality never come upon my kids, those demons had their way with that young boy, this is sad, when a person is not happy with who The Lord made them, an idol mind is the devil workshop, the devil does not care who he comes after, teach Boys to be boys and girls to be girls., no need to reply to comment with negative remarks, if you don't agree, but this is a sad and ridiculous situation.","post_message":"Suicide note of 17-year-old transgender girl is DELETED from her Tumblr page after her Christian parents demand message blaming them for her death be removed"},{"comment_id":"10153764229426323","commenter_b":"It certainly is for most women. :)","commenter_a":"To be brutally honest, the female body starts to prepare for a possible pregnancy every month growing a miniscule placenta in the womb. If the conception doesn't happen the pre-placenta is rejected as menstruation blood and all.","post_message":"\"It's relief for a lot of us to finally see periods being talked about in a frank, forward-looking way.\""},{"comment_id":"536456796544900","commenter_b":"Go home.. This is not ur country.. To bring ur confusion here....","commenter_a":"Amen !","post_message":"Muslims try to pass Shariah Law in Alabama but these patriots refused to back down.  We are not in the Middle East. No Shariah Law here.  Do you support these patriots’ stand against Shariah Law?"},{"comment_id":"458537397670174","commenter_b":"NO She can Stick it !!!","commenter_a":"No way and the kids are not going to either.","post_message":"Will You Cave To Michelle And Only Eat Where She Wants?  Comment 'yes' or 'no'."},{"comment_id":"10153245617818908","commenter_b":"So, let me get this straight, a man with his foreskin is unhygienic, but a woman with her parts all tucked away inside is hygienic? How does that logic make any sense? It's called basic hygiene practices. FYI, as men age (much older) their penis could fold inside of him and it will need pulled out to keep clean. This could be the issue your Family member was talking about. It's no different than when you wash your own genitals.","commenter_a":"I have 3 boys and all are circumcised. As a person that has family in the medical field it's for cleanliness when they get older. My mother worked in a nursing home and she has horror stories from having to bath uncircumcised men. It's gross not to be. Infection and bacterial growth is more common if the foreskin is still intact","post_message":"Why do Americans go out of their way to remove this part of human anatomy, when the rest of the world does not?"},{"comment_id":"10153523440189071","commenter_b":"You should always bet with Olly when he's had a few, he always loses.","commenter_a":"Olly Cairns @username","post_message":"It has a ton of benefits."},{"comment_id":"10153091519691680","commenter_b":"Yeah, but Vance. Don't forget the illegals & their anchor babies ? Factor them in, & you have a wipe out. Yes, foreign, along with illegals, WILL DECIDE THE NEXT PRESIDENT & GOVT","commenter_a":"Democrats only need 38% of the white vote-- we get that with no problem. Romney only got 24% of Hispanic vote and 5% of African American voter. Because of Trump, Hillary will EASILY get 85% of Hispanic vote. Hillary will also score 80% of Asian vote for a landslide win in electoral college","post_message":"Noncitizens are factored into the electoral college. @webpagelink POLITICO Magazine"}]
