[{"comment_id":"10154852299903690","commenter_b":"Women are slave under islam","commenter_a":"Let him grab those who voted for him by the p*ssy...","post_message":"53% of white women cast their ballot for Trump."},{"comment_id":"10152884498052293","commenter_b":"not really","commenter_a":"This is the internet they cant ban anything.","post_message":"Sad Keanu? Nope. And sad Putin? Absolutely not."},{"comment_id":"1061679133872558","commenter_b":" The US has the highest gun ownership rate in the world - an average of 88 per 100 people. That puts it first in the world for gun ownership - and even the number two country, Yemen, has significantly fewer - 54.8 per 100 people But the US does not have the worst firearm murder rate - that prize belongs to Honduras, El Salvador and Jamaica. In fact, the US is number 28, with a rate of 2.97 per 100,000 people Puerto Rico tops the world's table for firearms murders as a percentage of all homicides - 94.8%. It's followed by Sierra Leone in Africa and Saint Kitts and Nevis in the Caribbean","commenter_a":"Stephen king stick to writing shitty movies. You have no clue. How else can you explain to morons that criminals and crazies don't care about gun restrictions. Guns help protect... There are numerous countries that have worse records for mass shootings than us, that have more gun laws than we ever have had.","post_message":"Stephen King, like most reasonable people, is fed up. His message to fellow gun owners is AWESOME!"},{"comment_id":"10153141690015861","commenter_b":"@username she can ride that motorcycle off into the sunset away from here.","commenter_a":"Class act!! Thank you obama for showing Oklahoma some love... Unlike our governor.","post_message":"President Obama released a powerful statement to the friends and family of the people who lost their lives in the Oklahoma City Bombing, referencing the strength and unity of our community."},{"comment_id":"480699562111924","commenter_b":"What a phony. She could care less about the working class. But she's got a lot of people fooled. Poor souls.","commenter_a":"Hillary has fought all her life for the common people Bernie just the last ten years, so I want Hilary over Bernie.","post_message":"This is something all voters should see."},{"comment_id":"979362338768669","commenter_b":"Guys don't have tits !","commenter_a":"It's called hooters. No man with big boobs should be allowed to serve food in a skimpy outfit. Gross","post_message":"This may surprise a lot of people!"},{"comment_id":"10155007911979228","commenter_b":"Couldn't agree more. This is a global women's health issue and we put so many women at risk by this gag. Women will be dying from this order.","commenter_a":"Thankyou for showing positive leadership against these attacks on women's rights! This is the kind of action we need in DC right now!","post_message":"Two days after millions of women marched to oppose the new president's backward policies, he reinstated the Global Gag Rule, a federal ban that will directly affect a woman's access adequate healthcare in the U.S. and abroad. It's up to Congress to permanently repeal this dangerous rule and I've cosponsored the Global HER Act to end this outdated policy once and for all.  @webpagelink"}]
