[{"comment_id":"10152807038616636","commenter_b":"Muslims are still a small minority in England. They may cause trouble, but they are controllable.","commenter_a":"Message to Islamlist functionalists.... don't fu**k with the British people...if you want war ....you have it !!!! We'll wipe you off the planet !!!","post_message":"Breaking: Isis have warned of ‘even bigger and more bitter’ things to come..."},{"comment_id":"10154297413016378","commenter_b":"And, as usual when in the playoffs, promptly lose","commenter_a":"Haha, pretty sure Garrett said he wanted to keep the momentum going into the postseason. The only QB to move the ball was Romo and he got most of his yards through PI. The Boys were flat out beaten today. No excuses. Dallas has looked pretty weak the past few weeks.","post_message":"The Philadelphia Eagles end the season on a high note with a win over The Dallas Cowboys! Final Score: 27-13. @webpagelink Way to go Birds! E-A-G-L-E-S EAGLES!"},{"comment_id":"1539781299650210","commenter_b":"Trump will CRUSH Hillary!!","commenter_a":"if you know Hillary will lose against Trump click like","post_message":"Wendy Long: Trump's 'America First' Platform Will Grow GOP Nationwide."},{"comment_id":"444684015719892","commenter_b":"killing over a pizza.. one less tax payer.. those black thugs aren't too worried about their welfare checks these days","commenter_a":"They need to be stabbed to see how it feels than shoot","post_message":"Where are the rioters?"},{"comment_id":"10153831797228132","commenter_b":"She is not doing her job!","commenter_a":"I love all these comments","post_message":"\"Kim Davis should have never been locked-up for being a Christian,\" said Mike Huckabee."},{"comment_id":"10153140551051051","commenter_b":"Absolutely. It's a broken system. What I don't get is that in any other country if you enter the country illegally, you get sent back. Why is it soo hard here for that to happen? It's a bigger problem then an illegal person killing another person. Maybe it's time to close the borders and get our country and its laws in order?","commenter_a":"deport trump to mexico...","post_message":"The man who had been deported 5 times before killing an innocent S.F. woman entered a surprising plea. Do you think he's an example of how the current immigration policy isn't working?"},{"comment_id":"10155425307145615","commenter_b":"\"But no use trying to educate them...\" I feel the same way, because after all: 1) This law is not discriminatory. Anti-discrimination law always trumps Religious freedom law, especially when discrimination is not explicitly addressed, as if the case for RFRA laws. If this was an attempted to legalize discrimination, the analogy would be like a man throwing a feather at a door to force it open. It is a sad attempt. 2) This is not religion being forced down your throat. It is religious liberty. Perhaps, it bothers you that a man would be allowed to wear long hair in an office that requires a clean cut, or that the Amish would not be forced to \"drive\" a minimum speed limit, but it hardly qualifies as religion being forced down one's throat, in my opinion. 3) This is merely a copy of the federal law with some of the ...","commenter_a":"I'm tired of Pence and all his follower's trying to \"defend\" him. They're all discriminating bigots!! Plain and simple!","post_message":"Wow!"}]
