[{"comment_id":"10154284439844749","commenter_b":"Women should lift each other up? Good luck lifting her up!","commenter_a":"Beauty comes in all shapes and sizes. Women should lift each other up, not let little girls tear each other down.","post_message":"'When I tell people I'm a model, they look at me like I've said I've murdered someone.'"},{"comment_id":"506386899562882","commenter_b":"'@username. Hillary Clinton is nothing but a liar and a criminal. Her whole life is been about criminal activities.","commenter_a":"Hillary will be the next president for sure","post_message":"Donald J. Trump fans in China?  The U.S. presidential candidate who accused China of stealing American jobs also says the 'people from China love me.'  Is this really the case?  CNN's Matt Rivers is live from Beijing, China, answering your questions and telling us what people think of the U.S. Republican candidate."},{"comment_id":"10154169270413908","commenter_b":"Tony 'Osman' Andrews","commenter_a":"Ups, that was ,me...:)","post_message":"For those of you who are unaware of this observatory, it's captured some fascinating shots of unexplained aerial phenomena."},{"comment_id":"1641330872574045","commenter_b":"His payment for the presidency","commenter_a":"I just love hearing you babies cry. 8 years of total bullshit from your man Obama, and we never rioted, burned down neighborhoods, dressed up as vaginas and marched (like a bunch of embarassing idiots), destroy businesses, drag old men out of their cars to beat the shit out of them for an Obama sticker, and the list of shame goes on. Trump hasn't been president for 90 damn days and you crybabies are already curled up in the fetal position, sucking your thumbs, squealing and kicking like little piglets. You guys make me smile real big. You're the biggest pile of disrespectful pussies on the planet! Suck it up buttercups, TRUMP IS YOUR PRESIDENT! AND GOD BLESS DONALD TRUMP!","post_message":"This isn't a joke."},{"comment_id":"10153835564541002","commenter_b":"'@username, LEAVE then!","commenter_a":"What happen to 'Land of the free' ?","post_message":"President Barack Obama suggested maybe it's time to make voting a requirement.  Share your thoughts on this idea -- good idea or bad idea?"},{"comment_id":"10153221736289087","commenter_b":"Hey Reid we do not want this BS in our country!! YOU GET IT?? WE THE PEOPLE WANT ALL OF YOU TO FOLLOW THE CONSTITUTION! WE STILL HAVE FREEDOM OF SPEECH IN THIS COUNTRY! WE WILL NOT BE PUSHED AROUND! WE DO NOT WANT SHARIA LAW HERE! WE DO NOT WANT ANYONE WHO WANTS IT HERE TO LIVE IN THIS COUNTRY! GET IT? GOT IT? GOOD!!!!!","commenter_a":"When will,Dirty Harry apologize for his Viscious atracks,insultscandvcharges,against innocent republicans like mitt Romney ????? Reid is a very bad person.","post_message":"“I call on every Republican to denounce Ben Carson’s disgusting remarks,” Senate Minority Leader Harry Reid said. “That shameful intolerance and bigotry should have no place here."},{"comment_id":"1219402711410410","commenter_b":"i did not know we had 18000 + illegals in our country keep signing and we can take the list and round them all up and send them all home illegals NO legals YES if any one wants to come live in the U.S.A do it right by the law and we will embrace you any thing illegal in America will be prosecuted to the full existent of the law Americans don't care where you are from just do it wright","commenter_a":"Likely, they/#SNL have to give 'equal time', since the top candidate from the other party was prominently featured.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
