[{"comment_id":"10156572722830354","commenter_b":"You are so stupid it hurts.","commenter_a":"SPOILERS: The fact the chick was able to learn the force on her own, without even really knowing anything about it? And then to be able to defeat ren without any sort of training? That alone ruined the movie","post_message":"'...may be the worst thing ever to have happened in the history of cinema.'"},{"comment_id":"420321631489464","commenter_b":"how about someone do a drive by on these losers, it would do the world a great deed.","commenter_a":"Non existent","post_message":"Can you Imagine the Media Coverage if These Guys Were White?"},{"comment_id":"10154362433106509","commenter_b":"What a pussy","commenter_a":"Obama = anti christ he wants to disarm us so he can let his refugees attack and we be left defenceless","post_message":"Barack Obama addresses the notion of a 'conspiracy' that 'we are creating a plot to take everybody's guns away so that we can impose martial law...' #GunsInAmerica @webpagelink"},{"comment_id":"967087283327615","commenter_b":"Yes you scared little woman","commenter_a":"This muslim kid brings a suitcase filled with wires and people are being mocked for over reacting?","post_message":"Standing tall after an outrageous arrest."},{"comment_id":"10154974610048896","commenter_b":"Lets make this clear Theres only to genders And youre born with the parts youre supposed to have Fucking millineals","commenter_a":"Ah just give him some money. He wont shut up until they do. Maybe he'll use it to treat his mental illness.","post_message":"'I'm not unique in all of this — this upheaval happens to trans people all the time.'"},{"comment_id":"10153405844391955","commenter_b":"Cruz is a phony with his evangelical persona","commenter_a":"Trump's record makes him look like the flip flopping, inconsistent political opportunist he is. The right personality and talking the way we like without looking at policies, are the criteria the Democrats selected Obama in 2008. Donald Trump has supported a net worth tax, 35% tarrif, he supports amnesty and a path to citizenship, 'because there are jobs Americans just won't do,' He's donated to clinton Pelosi & Harry Reid, and has said Bush is the worst president ever. He's a RINO and a caricature of a conservative inartfully voicing every failed mudsling of the left against conservatives. Ted Cruz is a world class debater, with a nearly perfect record who takes on both Democrats and spineless Republicans. He has all the positives and then some without the negatives of Trump. #TedCruz2016 @webpagelink","post_message":"NEW 'SILENT MAJORITY'"},{"comment_id":"10154751454678010","commenter_b":"'@username --You are a woman, but lady? Highly questionable.","commenter_a":"Aren't 'Indians' a part of American History, whether or not their story is positive or negative? Why does every damn thing have to be racist? I think your article/argument would have been more effective if you had taken statements by full blooded Indians who are actually offended by this rather than just mention that the mascot and 'red face' really 'do harm to actual people.'","post_message":"Cleveland knows its mascot is racist. They removed 'Chief Wahoo' from their caps at the beginning of the season.   And yet now he's reappeared on baseball's biggest stage.   via Los Angeles Times Opinion"}]
