[{"comment_id":"10155149699869558","commenter_b":"I just watched two segments of news, that being just a plain old person, it seems to me could be mutually worked out to everyone's benefit. It costs to become a citizen. AND our infrastructure is failing..Why cant' we find how willing these people are to be here by having them work for 2 or 3 months for construction, they could work for 4 hours for free to pay for citizenship, and 4 hours for pay for living expenses, A place to stay would be provided while they go through a 2 or 3 month vetting and so prove they really want to be here and are willing to honestly work for it.","commenter_a":"All you americans opposing trump are thick as hell he trying to save your country leave him alone let him do what is needed i wish we had him back off dont be thick all your lives","post_message":"\"That's not press bias. That's blatant dishonesty... The illegal immigration issue has been set up by the media to demonize Mr. Trump as a racist and a brutalizer of the poor.\" In his Talking Points Memo tonight, Bill O'Reilly ripped the mainstream media coverage of federal immigration officials arresting more than 600 people across at least 11 states last week. MORE: @webpagelink"},{"comment_id":"943180705778182","commenter_b":"It's a ROCKET SHIP.... Feel the Bernie Ship!","commenter_a":"All I can say is Wow","post_message":"Bernie Sanders closes in on Hillary Clinton in a big way in this \"shocking\" new New Hampshire poll. Watch more here: @webpagelink"},{"comment_id":"1921686894724985","commenter_b":"Looks like paid protesters to me....LOL ...Your here with no papers take your happy azz home.....","commenter_a":"Arrested all","post_message":"Protests at the RNC in Cleveland - \"A Human Wall\""},{"comment_id":"471958379619606","commenter_b":"People like carl can't help themselves... He is a result of stupid people having children.... they raise more stupid people... in turn that have more children.....which sadly are unleashed on the rest of us..... It's and incredible and sadly unstoppable event...... OR its that he has to call his mommy Aunt Mommy and his daddy Uncle Daddy... Showing us why incest is illegal... . either way they unleash these morons on the rest of us to deal with....","commenter_a":"Wow talk about prostituting your site @username. Look what I found as an advertisement on your story.","post_message":"Unbelievable."},{"comment_id":"10153202654871107","commenter_b":"Deport all 30M illegal aliens.","commenter_a":"This makes me so angery that our government cant even enforce laws already there, time to replace everyone of our politicians for not doing their jobs and getting caught up with deal making, sick ,sick of it, PUT MORE INS AGENTS ON THE JOB AND GET ALL OF THE ILLEGALS OUT NOW!! and may I add i'm sick of politicians asking for money to do their jobs this includes you Mr. @username!!","post_message":"Our nation now has whole cities and states who stand up and willingly defy federal immigration laws in order to protect illegal immigrants who have broken our nation’s laws. This must end and it must end now. Today, I introduced legislation in U.S. Senate that would cut federal funding to cities and states who refuse to follow our immigration laws. My bill makes it clear, the American people will not stand for cities harboring violent criminals. But I need to know if you are with me. Please sign your \"Enforce Immigration Law\" petition right away, then consider chipping in $20.16 or more to help me spread my message to voters in early primary states."},{"comment_id":"891587657549689","commenter_b":"Two bullies fightng for power all over the arab both are terrorist","commenter_a":"Saudi arabia please don't do this because you are not killing your enemy you are killing your own brother","post_message":"The Saudi King says his country’s military operations against #Yemen will continue. Three days of airstrikes have killed over 50 people, many of them civilians. What do you think about the attacks on Yemen? Join us on #presstvdebate at 18:33 GMT"},{"comment_id":"10154269953567439","commenter_b":"Wouldn't be Muslim refugees if our leader would fight for them . He wants them to spread out and start a war of Islam","commenter_a":"Those Muslims were Barack Obama's son's","post_message":"This woman is brave to come forward and tell this gruesome story. Only one of the five Muslim migrants were apprehended. The other four \"escaped the country.\" Don't believe it. They are being hidden by the Muslim community much the way the Paris jihadis were."}]
