[{"comment_id":"10154645431764445","commenter_b":"Why? Herr Drumpf is a racist bigoted sexist pig","commenter_a":"Of course he's white","post_message":"BREAKING: The suspect in the deadly Washington state mall shooting is in custody, according to officials: @webpagelink"},{"comment_id":"10153010169898984","commenter_b":"Truth or not, IMPEACH him now. He is not good for America or for the American people.","commenter_a":"He's another Teflon Politician!!!! Makes no sense!","post_message":"[Best of 2014 Compilation] Back in Feb. 2014, Steven Seagal had some pretty harsh words for Barack Obama. Surprise! There are actually some actors in Hollywood who don't follow the party line..."},{"comment_id":"1015835041846081","commenter_b":"She needs to take her conscience to another job.","commenter_a":"I'm getting real tired of her behind. My God's name is not Kim Davis. It's time for her to find a new job.","post_message":"BREAKING"},{"comment_id":"10154703624496077","commenter_b":"These are all men! Lame. Almost any female is hotter than all of these (or does that make me sexist?)!","commenter_a":"Its the beard. Come on ladies, you know you love it!","post_message":"On Friday, Buzzfeed ranked our very own Kyle Clark #4 on their list of the hottest news anchors. We thought we'd share what we think makes Kyle so unique."},{"comment_id":"10153945154891323","commenter_b":"Naser E. Kandjani many nations in Asia and Europe and Africa have million Muslims without conquests or wars and they were just spread by talking through Muslim merchants and travellers in these countries..you can read how Islam spread in east Africa and many Asian countries especially China Indonesia phillipines Malaysia ...all these countries have Muslims though no wars or conquests arrived there ...most Muslim nations today became Muslims without wars","commenter_a":"Anti-islam movements in Europe are treated as any political group and not called terrorist organizations ...What if there were anti Christian organization in any European country ..how will u react to it? Your double standards created extremisim in the whole world...","post_message":"'Islam has failed': Former EDL leader Tommy Robinson brings Pegida to the UK. Tommy Robinson stepped down as leader of the far right English Defence League in 2013. Alongside two former Ukip candidates, he is now setting up the UK arm of Pegida, the pan-European anti-Islam movement. Film-maker Simon Winkler joins Robinson as he prepares for Pegida’s first march in the UK."},{"comment_id":"10153330634768128","commenter_b":"I saw her get whipped in Cali....she is weak.","commenter_a":"I would support Carly over Hillary. Carly has a record of solid leadership.","post_message":"The former Hewlett-Packard CEO will formally declare her Republican campaign online on May 4."},{"comment_id":"861215140607271","commenter_b":"Alex, it wasn't proven to be false. Please cite the \"proof\".","commenter_a":"I respect you Senior Airman but your comparing Ron Paul & Jessie Ventura to the killer as \"typical\", is absolutely ludicrous. I don't even know where to start I'm so disappointed.","post_message":"EXPOSED: Chris Kyle Killer Didn Have PTSD, Was A Typical Anti-War Punk Like Bradley Manning. I like to know if Routh or his family had any contact with Jesse Ventura in the days before he murdered Chris Kyle. Allen West and Walid Shoebat are also trying to sort out if his anti-war beliefs had graduated to jihadi sympathizing or... #americansniper #dallasobserver #guns @webpagelink"}]
