[{"comment_id":"402701206566786","commenter_b":"Wake up Bitch!","commenter_a":"I don't watch her channel anymore. I don't like Oprah!","post_message":"Oprah: ‘Anyone Who Doesn’t Like Obama Is Racist’. Unbelievable. What a bigot. Do you think Oprah is the racist?"},{"comment_id":"1226253117412922","commenter_b":"White peoples God George Soros funds these riots !","commenter_a":"If there is any one in the car, it is also attempted murder, and MUST be prosecuted.","post_message":"Nails it!"},{"comment_id":"1734707080142446","commenter_b":"@username fuck outta here!!! Hahaha biggie pulled more bitches!!!!! REALIZE THAT NONE OF THOSE FEMALES U NAMED IS BAD ALL UGLY ASS HOES!! THE BEST LOOKIN FEMALE BIGGIE GOT TUPAC FUCKED (Faith)!!!!! Jada Smith shut biggies females down lol","commenter_a":"Biggie, cus todays people are too stupid to understand Tupacs lyrics lol","post_message":"VOTE NOW! 2pac vs. The Notorious B.I.G. -- Who'd be bigger today? #DEWcision2016 #sp See how your fellow hip-hop fans are voting here..."},{"comment_id":"10153301288059411","commenter_b":"Yeh the Danish who's having sex with dogs are Muslims too. Many US states still legalize animal sex until today. Bow down to your ziojew masters and shag some horses","commenter_a":"Jews been making porno videos using American girls and animals ( dogs, horses) for centuries now. Disgusting vermin","post_message":"No more animal brothels"},{"comment_id":"10154390206939342","commenter_b":"Racism is at an all time high in this country and ignorant people have no shame when expressing their hate nor do they seem to understand that social media is the best place to go viral and get fired, keep em coming.","commenter_a":"This guy is a dirtbag and should be removed from office immediately.","post_message":"Parents want a school board member to be removed after a picture of him dressed in blackface hit social media."},{"comment_id":"791518854323422","commenter_b":"@username She won't even make it out of 2016 before being arrested!!","commenter_a":"When I voted in Virginia on 10/13/2016, they never checked my ID. Just sayin folks .................. better watch these cheating people .... just in case!!!!!","post_message":"Live Now: Donald J. Trump speaks at a rally in Johnstown, Pennsylvania."},{"comment_id":"728623440630942","commenter_b":"Adam , undocumented immigrants pay billions in taxes.","commenter_a":"The wall we take longer than 4 years to build. He won't get re-Elected and the wall won't be finished. Then us tax payers will be stuck paying for it.","post_message":"U.S. taxpayers will foot the bill for the wall, at least initially."}]
