[{"comment_id":"10153309249299740","commenter_b":"Send her the bill...stupid","commenter_a":"Well played Baltimore...... @webpagelink","post_message":"200 rioters arrested, 144 vehicle fires, 15 officers recovering from injuries, and one big mess to clean up."},{"comment_id":"1104396149581395","commenter_b":"Because women aren't people?!","commenter_a":"*women with depression","post_message":""},{"comment_id":"10154292449213525","commenter_b":"She didn't sleep with babe in bed purposefully by the sounds of it... She fell asleep. Big difference in that one is purposeful, one is accidental. New moms are exhausted.","commenter_a":"So sad..so dangerous. I had my baby in his crib until he was 1","post_message":"\"Do not co-sleep with an infant,\" Sheriff Grady Judd insists.  \"Co-sleeping with infants is just an absolute no.\"  His deputies have arrested a Winter Haven woman after they say her \"horrific negligence\" while co-sleeping with her newborn baby led to his death -- for a second time: @webpagelink"},{"comment_id":"10153148690502014","commenter_b":"I remote control my grandson to clean my auto engine. He's for hire. Lol. .","commenter_a":"Good morning from Flagstaff!","post_message":"It's Sunday Shoutout time! Post your pics here!! Jaime Cerreta"},{"comment_id":"10154203393907994","commenter_b":"Cut their dicks off.!!","commenter_a":"Wow","post_message":"THIS JUST IN: Police have released a picture of the second man wanted in the abduction and rape of a woman from a Walgreen's parking lot. Police say the two drove around and took turns raping her. More info:"},{"comment_id":"1124947717560231","commenter_b":"Hurry up woman!!","commenter_a":"Alright, that's it...we're moving to Colorado. @username","post_message":"It is absurd that here in America, we remain the only major country on earth not to guarantee health care to all people. If this proposal for universal health care can win in Colorado, I believe it will spread around the country."},{"comment_id":"10158076017090577","commenter_b":"It is the Muslims that enslave women to the day!!!!","commenter_a":"Really? Muslims want to bring up slavery? It was Muslims that SOLD the slaves to the US. It is Muslims that perpetuate slavery in Africa and the Middle East today! Where is the outrage for THAT?","post_message":"What this guy said about America won't sit well with Donald J. Trump voters..."}]
