[{"comment_id":"769546029761706","commenter_b":"karmas a bitch","commenter_a":"Tolerance! Take their Allah and Mohammed, tear up and urinate on it. Then we will talk tolerance.","post_message":"Italy: Muslims Destroy and Urinate on Virgin Mary Statue   @webpagelink"},{"comment_id":"974047066004855","commenter_b":"These tanks could easily create the blast heard around the world. Should that take place, this nation will erupt in a revolution unseen for hundreds of years. The resident of the white house should have his escape plan worked out because We the People will coming to evict him and his whole family .....and his mother in law too......!!!!","commenter_a":"Be afraid, be VERY afraid!!!!!","post_message":"FBI ON ALERT: Theft of dozens of propane tanks, purchase of 150 prepaid cell phones  [READ MORE]"},{"comment_id":"10153147861257060","commenter_b":"That's her dumb ass then.","commenter_a":"She fell for the Kenyan Prince trick, lol","post_message":"A Metairie woman was duped into sending more than $195,000 to man she knew only through Facebook, according to the Jefferson Parish Sheriff's Office."},{"comment_id":"10152787006691545","commenter_b":"What time?","commenter_a":"I can't believe they just showed up out of the blue. There should have some fore-warning. *drum snare*","post_message":"About 30 members and supporters of Bloodstained Men, a nonprofit group based in California, held signs that read, 'Foreskin is not a birth defect.'"},{"comment_id":"10154362083273325","commenter_b":"Oh Baloney California is the Welfare , Illegal State !","commenter_a":"California is what's known as a donor State, in other words, we pay more in Federal taxes than the services/benefits we receive. This idiot needs to do some research before threaten us with his ridiculous tweets. #Resist #NoBanNoWall #RussianPoodle","post_message":"Describing California as 'out of control,' President Trump said he would not be opposed to using defunding as a 'weapon' against states that want to be sanctuaries for undocumented immigrants."},{"comment_id":"1707295909299362","commenter_b":"During WWII there was a very true saying: 'Loose lips sink ships.'","commenter_a":"Nope","post_message":"This whole thing is ugly."},{"comment_id":"602448696614153","commenter_b":"Racist pigs","commenter_a":"'@username CHILD RAPIST LOVER!","post_message":"President Obama holds his first news conference at the White House following the election of Donald Trump.  @webpagelink"}]
