[{"comment_id":"1012231985511331","commenter_b":"She has NO BRAIN CELLS!!!!!","commenter_a":"Nuts for sure","post_message":"Americas Freedom Fighters"},{"comment_id":"1256816384396895","commenter_b":"Then those women will one day regret their stupidity!!","commenter_a":"The Clinton's know there in trouble with the common voter. So now they are trying to go woman power... so tragic.... but a lot of women will vote just cause she is a woman...","post_message":"Chelsea Clinton recently tried to stump for her mom on local TV at a rally in Michigan. Later on, she wore a shirt that had a LOT of people talking.  What do you think about what was on Chelsea Clinton's shirt?"},{"comment_id":"10155066370401509","commenter_b":"So trump does something good and the left will still whine like stuck pigs and try to spin it.","commenter_a":"Sadam Hussein was Trumps mentor.","post_message":"Donald J. Trump  last month forgave more than $47 million in loans he made to his own campaign committee"},{"comment_id":"1248101021932790","commenter_b":"ALL CiTIZENS in this country have ID, ALL of them. so STFU about ID laws, only the corrupt want them","commenter_a":"Only clueless and the corrupt don't want voter id laws, REAL citizens WANT them as they stop the DEAD, non citizens and people voting multiple times. All of which are the exclusive territory of the left and the Dems.","post_message":"Dem Strategist Blames Hillary's Wisconsin Loss on Voter ID Laws [VIDEO]"},{"comment_id":"460052980821324","commenter_b":"Put the pussy on the chain-wax","commenter_a":"This headline is complete and utter garbage click bait bullshit. Mumford & Sons had nothing to do with THE CITIES/RESIDENTS. You can't blame a band for the amount of fans they attract, they're grammy award winning musciams coming of a 2 year hiatus after releasng a long awaited album. The city is the problem here for using this 'cleanout method' which they are literally treating these people, HUMAN BEINGS, like trash and obviously have no problem using terms that state that. Blame the city not the band, oh and actually read the article.","post_message":"Not cool."},{"comment_id":"896505850386756","commenter_b":"Hillary is evil. The only people vote for her is either they think she is 'Good' and/or 'Qualifies for President' or simply the fact that she is a woman.","commenter_a":"Be carful her crew is monitoring this","post_message":"'I have to ask, though, if you want cops to turn over camera footage of every single moment of their shifts, why did you turn over only some of your e-mails from your time as secretary of state?   What is the difference?'"},{"comment_id":"763624153793368","commenter_b":"'@username..Bye Felicia, go suck an egg","commenter_a":"I would waited until he falls asleep, and pull me a loreana bobbitt ...get a Surgical scapple do a nice clean quick slice, get me some tweezers and carry it and throw it on the freeway, and let someone run over it. it ain't big anyway. second scenario, get some super glue and glue his little hands to his little tilwinkle!","post_message":"Did you catch this moment from Melania Trump at the inauguration?  Via In The Know"}]
