[{"comment_id":"1289706671107866","commenter_b":"I say fire her ass and let her get her 20 mil from someone else, she isn't worth it.","commenter_a":"#FoxFireMegynKelly! She is no journalist and has to go, help make that happen by signing this petition and sharing! @webpagelink","post_message":"Fox News' Megyn Kelly just got some bad news... after trashing Newt Gingrich in a Tuesday interview over Donald J. Trump, here's what Rupert Murdoch said about the controversial anchor. What do you think should happen to Megyn Kelly?"},{"comment_id":"10153574901357217","commenter_b":"Pete Bayliss Yes i no , the Muslims from the Middle east are taking over the World. we have more trouble with the Muslims from the Middle east then any other race of people here in Australia they are born hatters and want to kill us the free World , they give all the good Muslim people a bad name","commenter_a":"This is very sad but its WAR , and all kind of people get killed in WARS. we the World needs to get rid of ISIS no matter what it takes and innocent people are going to die while doing this . i hate Putin but he is the only one doing the best Jb in getting rid of ISIS.","post_message":"\"There will be no more doctors in Syria.\""},{"comment_id":"10153063738641135","commenter_b":"Ladies","commenter_a":"Except, it turns out she is not a very kind person either. Her facebook is private now but before this story broke and it was visible, she had posted many things making fun of those with disabilities. She is also appears to be a 9/11 conspiracy theorist. I wish news outlets would look into this before constantly sharing this story.","post_message":"ICYMI: A Michigan mom bought coffee for two women behind her at a Tim Hortons despite insulting comments made about her looks. STORY: @webpagelink"},{"comment_id":"1813322542237935","commenter_b":"Then what makes her capable of running our country","commenter_a":"Mrs Magoo👹","post_message":"Hillary Clinton tells the public: Don't bring up my health! Then she tells the FBI: My health kept me from remembering the answers to your questions!"},{"comment_id":"10153571319289342","commenter_b":"¡¡¡¡Omg esta cara voy a poner si ganó !!!!","commenter_a":"Will Htx Larisa Valcy Brian Valcy Jovannii N Juliet Mendoza Luisao Roberto Galvez @username Beldy Salvador","post_message":"$400 MILLION POWERBALL JACKPOT: Are you planning on buying a Powerball ticket this week? With the potential jackpot now standing at $400 million, this Wednesday drawing could be one of the largest in U.S. history. While you're dreaming of how you'll spend your winnings, here's a look at the 10 largest U.S. lottery jackpots: #abc13"},{"comment_id":"10154355616737293","commenter_b":"He deserves a bullet.","commenter_a":"He looks like Gov. Christie","post_message":"The gruesome revelations are a stark contrast to Kohlhepp’s professional image. But details from his childhood hint at a deeply troubled individual."},{"comment_id":"913906465331025","commenter_b":"Bernie, please keep THEIR laws off OUR bodies. #BERNIESANDERS","commenter_a":"The government only cares because it's the life of another tax payer. It's the basic human right of the individual.","post_message":"I understand that not everyone agrees on this issue but my view is that a woman has the right to make decisions regarding her own body, not the United States government."}]
