[{"comment_id":"10152603189787894","commenter_b":"She's Just NASTY & wants White people to think it's a Race thing","commenter_a":"Nasty bitch","post_message":"Say What Now? Naya Rivera Insists White People Shower More Than 'Ethnics' on 'The View' [Video]"},{"comment_id":"10157252246585354","commenter_b":"Lorena Bobbitt needs to take care of this demonic trash creature!","commenter_a":"Deplorable.","post_message":"**UPDATE**  That's it?!"},{"comment_id":"10155008790239214","commenter_b":"'@username please educate me as to exactly how NM receipt of federal dollars will be affected by the senator's boycott of the inauguration.","commenter_a":"Please don't join that ship of fools boycotting the inauguration. New Mexico needs those federal dollars.","post_message":"The president-elect is taking to twitter this weekend to harass a civil rights icon and the Director of National Intelligence. I think we can all agree that is not how Donald Trump should be spending his time."},{"comment_id":"10153564532183984","commenter_b":"'@username All immigrants who enter LEGALLY are welcome!! We dont need or welcome ILLEGALS. There is a difference.","commenter_a":"I don't understand good, law-abiding Latinos taking a position against following our immigration law and supporting programs that shelter criminals just because they too are Latino. I would be incensed that my good name and that of my race was being damaged by those lawless usurpers.","post_message":"Donald Trump isn’t backing away from his position on illegal immigration and his disgust for sanctuary cities. These policies endanger the lives of innocent Americans, and they must be put to an end.   Obama needs to rethink his plans for amnesty before more Americans die at the hand of violent illegal immigrant criminals.   Sign the petition to block Obama’s plans for amnesty!"},{"comment_id":"10156589848265354","commenter_b":"Lady, please don't be ignorant....","commenter_a":"Ted Cruz , and Marco Rubio are not eligible to be president , neither is Obama ! BOTH parents must be citizens of the United States !","post_message":"Ohhhh boy...."},{"comment_id":"10152698391808717","commenter_b":"She's no Zumba instructor but she's not","commenter_a":"She's a hottie","post_message":"Claremont police say two people face charges after selling cocaine, crack cocaine and heroin in a school zone. @webpagelink"},{"comment_id":"855612107818751","commenter_b":"So then please elaborate what does happen once that sperm penetrates that egg-I'll wait.","commenter_a":"The egg, once fertilized, then has to implant to become life. Not sure conception counts, not without implantation. Otherwise, you're telling every woman who takes birth control pills she is a murderer.","post_message":"The evidence is clear: life begins at conception!"}]
