[{"comment_id":"1832691560303641","commenter_b":"Good don't want you back in the White House!","commenter_a":"Thank goodness, not that she would ever get elected after her husband's lousy job.","post_message":"It looks like we'll never see an Obama in the White House again. Is that good news to you?"},{"comment_id":"1411832842165706","commenter_b":"No sympathy here...he's a paid hack for Hillary...and so he just lost all credibility..He supports sharia law,with connections to her foundation and Saudi's...he has worked on policies for moohslim immigration into this country..He's dangerous and a radical.....Of course we find this out after the fact...which were lie perpetrated by the left..progressive librals..with an agenda....always a strategy and agenda..!!!!!!!!!!!!","commenter_a":"You are correct Rush, he needs to move away from attacking the attacker (old Scientology technique) and focus on his message.","post_message":"If Trump does not start seeing things through an ideological prism, he will never understand the method, the motive, and the how and why these attacks against him happen."},{"comment_id":"1554113821370873","commenter_b":"What an ASS!","commenter_a":"Now we see how close he is to that N word, he will before to long.","post_message":"Speechless."},{"comment_id":"10153145036396167","commenter_b":"Maybe a big dick up there asses just makes them crazy!! It drives my ex-wife batty!! ha!! B|","commenter_a":"The violence wasn't connected with his homosexuality but it's pretty common for gays, particularly gay men, to be mentally unstable.","post_message":"Seriously, CNN?"},{"comment_id":"10153139193807377","commenter_b":"It's very hard to forget that he was voted in not only by the majority but by illegal aliens and dead people. Yes that's true, and just because he was voted in doesn't mean that there are more people who want him out of office. He is not a leader, he doesn't know foreign policies . Isis is his fault! He removed all our military from Afghanistan and the other countries. Had we stayed they would not be where they are today! Hellery Will follow obuma in his running this country, and if You think he is Bad you Haven't seen anything yet. Her lies and deceit hopefully will Take her out for Good. Do you know that more than likely he will Go down in history as one of the worse presidents in our country so you might rethink that statement.","commenter_a":"Why can't you impeach him? If the majority agrees that he needs to be impeached, so what are you waiting for?","post_message":"The top Republican lawmaker joined half of US state governors in urging President Barack Obama to suspend the scheme. Do you support Speaker Ryan's efforts on this? Vote Here: @webpagelink"},{"comment_id":"10153440852086051","commenter_b":"'@username If you are a woman voting Republican then your a full blown retard with helmet","commenter_a":"When major and I mean MAJOR republicans are threatening to vote democrat . Because of Trump something is wrong with the party.","post_message":"Here's how Donald Trump wants to deal with the families of terrorists."},{"comment_id":"975510729232372","commenter_b":"Those animals have to be destroyed and kept out of America","commenter_a":"TIME TO GET RIGHT","post_message":"What radical muslims are allowed to do to their own families is absolutely horrifying. We cannot let this ever happen in America no matter how hard these radicals try to impose their ideologies on our great nation.   SHARE if you agree that this disgusting practice needs to be wiped off the face of the earth!"}]
