[{"comment_id":"10154047559291770","commenter_b":"Jail her","commenter_a":"hope they CHARGE HER","post_message":"Muslim woman lied about subway attack by Donald Trump supporters."},{"comment_id":"10153559590411051","commenter_b":"Lol, she can't read","commenter_a":"If a citizen from another state isn't eligible for in-state tuition, why should someone here illegally from another country have that benefit? I agree with the ruling.","post_message":"The Georgia Supreme Court's decision was clear: Illegal immigrants are not eligible for in-state tuition. Do you agree or disagree with the ruling?"},{"comment_id":"1183772531660175","commenter_b":"However, he will be a much better President for the nation then fumbling Obama. Rather have competent than classy.","commenter_a":"I agree","post_message":"AMEN."},{"comment_id":"10154975691779859","commenter_b":"Not only NO but hell NO!","commenter_a":"No","post_message":"Should Betsy DeVos be confirmed by the Senate. Although Roy Blunt supports her, local educators and politicians have expressed concerns about her nomination. Vote and then tells us why you support or do not support her in the comments."},{"comment_id":"1168639523214582","commenter_b":"Just another paid for asshole who got caught with his dick in his mouth. Now disbar this worthless piece of shit and scum.","commenter_a":"You cannot believe the media at all they're just liars liars and Liars and they make up s*** and tell it like it's real you can't believe nothing they say think or do and as far as thinking I think they're incapable of thinking anything they're being paid to Railroad this guy and they're going to do it for the money","post_message":"The judge in Donald J. Trump's Trump University case was just HUMILIATED... here's why he just had to undo his own ruling. This shows exactly why he shouldn't be on this case... it's time for him to recuse himself."},{"comment_id":"10154298930434497","commenter_b":"Also, I don't appreciate you insulting my intelligence without provocation and based on assumption. You should work on how to prevent yourself from treating people like shit who don't deserve it.","commenter_a":"I know this is satire, but they broke my suspension of disbelief, with the suggestion that a television company actually covered Bernie's campaign...","post_message":"Via Onion Politics:"},{"comment_id":"10152558711931770","commenter_b":"When was the last time the Climate beheaded, butchers and burned to death with gas someone?","commenter_a":"what a goof","post_message":"The president compares climate change with ISIS..."}]
