[{"comment_id":"10154961510296729","commenter_b":"Lying bitch!","commenter_a":"ALWAYS REMEMBER BENGHAZI","post_message":"And I'll tell you EXACTLY what difference it makes..."},{"comment_id":"10153508194124087","commenter_b":"Paid shills","commenter_a":"Twenty-six years ago when Savvy Woman ran him on the cover, four of the eight people in Trump innermost circle were women, including his then wife Ivana, who was not in any of these particular photos but who was running the Plaza Hotel at the time. The others, all executive vice presidents, were: Barbara Res, who was in charge of construction of Trump Tower and then the Plaza; Blanche Sprague, head of project development; and Susan Heilbron, who was Trump chief lawyer.","post_message":"“Nobody has more respect for women than I do,” Donald J. Trump said. “Thirty years ago I had a woman building a major construction project in New York City. That never happens. I’ve been great to women and they’ve been great to me. I’ve had so many women executives [and] they’ve done a great job.”"},{"comment_id":"10154505390413037","commenter_b":"Well most of those benefits we pay go to lazy white people. Look up the facts lol","commenter_a":"So people who have been here 20 plus years....working, shopping, law abiding and not on welfare.....being healthy, productive members of society should be forced to leave.....i don't agree with that nor do I think that is fair! So called Christian people! Our country is not right......","post_message":" now because a lot of people came in illegally there no way we can even apply for papers.   Lara graduated in 2016, was her high school valedictorian and received a full scholarship to UT."},{"comment_id":"751318988350209","commenter_b":"Wondering if Melania has to listen to the snorting every night in bed!!!","commenter_a":"Why doesn't he realize that he has this problem with his nose, which only appears at the debates and not at any other occasions.","post_message":"It's just allergies, right? Right?! --Andrew"},{"comment_id":"257235498048585","commenter_b":"BYE BITCH!","commenter_a":"When we get to the \"Stupid\" ones...your name will be among the first !!","post_message":"NY-Born Governor: 'If There is a Move to Deport Immigrants, I Say Then Start With Me' [VIDEO]"},{"comment_id":"1182482298496971","commenter_b":"Praying🙏","commenter_a":"Get well soon.","post_message":"Prayers are with the Fox News family today..."},{"comment_id":"1422614517766820","commenter_b":"Turn off your speakers when Hillary starts speaking or she will break your ear drum","commenter_a":"Maybe every issue liberals care about like letting men in girls showers and rest rooms","post_message":"A Donald J. Trump presidency would pull us backward on nearly every issue we care about. We can't let that happen."}]
