[{"comment_id":"1276041149107332","commenter_b":"Just another moronic Hollywood actress.","commenter_a":"Idiot no but of Obama and kilary have their way then you need to worry cause people like me want save you from the Muslims you help let in our country","post_message":"SARAH JESSICA PARKER FEARS She'll Be Attacked And Killed If Trump Is Elected…LOL! Has She Not Seen MULTIPLE TRUMP Supporters Who've Been Bloodied By Hillary's Lib Mobs? [VIDEO]"},{"comment_id":"10154305889759312","commenter_b":"Walmart doesn't pay a \"living wage\" either. They can't go get a job at Kmart.","commenter_a":"There are a lot of businesses that do this, why only go after jimmy johns? It's not \"unfair\". What are e in 2nd grade? If you work at Pepsi, you can't work at Coke.","post_message":"The state of Illinois says a practice at Jimmy John's is \"unfair to Illinois workers and bad for Illinois businesses. Do you agree?"},{"comment_id":"10153573613391037","commenter_b":"An interesting job for our President on how to get these kids off the street at night and up in the morning to go to school.","commenter_a":"If it's done the right way!!!!","post_message":"The president says helping America's minority youth and making sure young people have the opportunity to succeed is \"an economic imperative.\" Liz Goodwin details the push behind the My Brother's Keeper initiative."},{"comment_id":"10153806132721051","commenter_b":"@username How is going to all those with the wars he's going to start increasing taxes on the middle income and lowering it on the rich. Building a wall where's that money coming from? not Mexico. Putting a 35% tariff on goods from China. Good move Trump and the China and other countries do the same to us. How about that lost American jobs?. You don't think Mexico buys from us? What about machinery, minerals, autos, trucks and military equipment anf farming equipment.","commenter_a":"Interestingly Trump praised all of Obama's policies. Now he says he's done a terrible job. He praised Hillary's job performance as Senator and Secretary of State and endorsed her for POTUS, now he calls her incompetent. Hmm. Should we really elect someone with such horrible judgement?","post_message":"In an interview today, Donald Trump said President Obama has done a \"terrible job\" in office and has allowed countries to take advantage of America. Is he right?"},{"comment_id":"10154512310684726","commenter_b":"her face looks like a duck.","commenter_a":"Liar","post_message":"Tammy Duckworth says they’re all orphans and widows because the men are 'all dead.'"},{"comment_id":"591215384344977","commenter_b":"Wash your mouth lady!","commenter_a":"Ummm it's not a white thing, it's a hygiene thing.....","post_message":"Imagine if a Republican had said this about Black people...... They'd be destroyed."},{"comment_id":"10154449321726729","commenter_b":"Fuck u bitch.. I'm an Obama supporter and wouldn't say no shit.like.that.. FUCK U!","commenter_a":"You know what's amazing about Trump's supporters? They are so cult-like that if Donald Trump raped a little girl, his supporters would insist that's okay. They would say that she was probably asking for it. No true conservative supports Trump.","post_message":"BREAKING: The decision desk has now called the winner of Kansas..."}]
