[{"comment_id":"10153819979530950","commenter_b":"Hillary has kept blacks where she thinks they belong. I am sick of her lies! Trump!","commenter_a":"What in the FACK is he talking abt? That an that has embraced white nationalism is calling Hillary a bigot.. Hillary has been to many black churches over the years and has many ppl of color as friends. Trump??? Never mind.. What a buffoon!!! Unfit....","post_message":"“We reject the bigotry of Hillary Clinton, which panders to and talks down to communities of color and sees them only as votes,” Donald J. Trump said."},{"comment_id":"557366464412130","commenter_b":"She's anti-woman.","commenter_a":"and, an eyesore.","post_message":"Carly Fiorina is gaining in the polls because Trump gave her his attention in a tweet. Now Republicans are claiming she supports women's rights."},{"comment_id":"10154678664866037","commenter_b":"#CutHerLoose","commenter_a":"She should stay in jail where she belongs.","post_message":"Tulsa police officer Betty Shelby turns herself in after being charged with first-degree manslaughter — but has since been released on $50,000 bond."},{"comment_id":"10154255735864411","commenter_b":"It doesn't hurt to have sense of humour :)","commenter_a":"It's pretty stupid how media outlets are sharing such pathetic content. It's Obviously and clearly not a frikin time traveller. What's even more pathetic, is how the public seem so hooked onto such rubbish.","post_message":"'Time travel is real?'"},{"comment_id":"10153378758554575","commenter_b":"Would this woman have been willing to pay the stewardess' salary when the stewardess got fired for allowing her to make the phone call? Bet not....","commenter_a":"Why is she leaving if her husband was suicidal","post_message":"A woman says Southwest Airlines refused to let her call her husband after she received a troubling text message shortly before her flight was scheduled to take off.  The woman said the text read, “Karen, please forgive me for what I am about to do, I am going to kill myself…” She said she replied \"no\" and immediately tried to call her husband, before a steward \"slapped the phone down\" and told her to put her phone on airplane mode."},{"comment_id":"10154933688831037","commenter_b":"She's a snake!!!","commenter_a":"This girl looks horrible, think she needs some rest.","post_message":"Trump will \"be the president of all Americans, including those that did not vote for him.\""},{"comment_id":"988508257851300","commenter_b":"what a women feel when do this?","commenter_a":"Back before social media, women's magazines used to use this as a rule of thumb for whether you could get away with going braless (if the pen falls, you can ditch the brassiere. if it stays, strap 'em in.) Which would be shaming in the other direction, by today's standards, I guess?","post_message":"Why #Underboobchallenge is going viral."}]
