[{"comment_id":"881902655289442","commenter_b":"Something is wrong with this woman's reasoning. If the plumbing says you are a man, you are a man.","commenter_a":"Just more of Obummer bullshit, today I feel like woman ,today I feel boy, today I feel privilege so today ogle little girls. ,today I'm black or am I white, damn asswipe..","post_message":"According to the attorney general, laws cannot be made to define gender because individual feelings trump the law.  What if I feel like I already paid my taxes, even if I didn't. Do I still have to pay them?"},{"comment_id":"893070080803922","commenter_b":"I wouldn't vote for Killary,If she was last person on Earth! She A Liar and a Bad egg!!","commenter_a":"The movie idiocracy.....we are living it!","post_message":"Jesse Watters: \"What do you think Hillary Clinton's biggest accomplishment has been?\"  Answer: \"She has gone around to certain places – Brooklyn, she's been to Queens.\"  MORE: @webpagelink"},{"comment_id":"10154130033413797","commenter_b":"so she should keep her legs together","commenter_a":"you have a brain tumor and you are suing bc you want your tubes. out.. are you sure you are just not brain dead?","post_message":"A woman suffering from a brain tumor is threatening legal action against a Catholic health system because the hospital is allegedly refusing to tie her fallopian tubes based on religious belief. The procedure could be life saving for the woman..."},{"comment_id":"1335655576501194","commenter_b":"Omg this little girl does need someone to beat her ass. Khloe can do it lol","commenter_a":"This lil girl is trash shame on her people need to stop giving her 5 minutes of fame","post_message":"She's calling out Kylie Jenner!  #WSHH #CatchMeOutside #KylieJenner"},{"comment_id":"1313010822072720","commenter_b":"And she thinks the transgendered individuals are scary","commenter_a":"sick.","post_message":"‘Are you going to let the Devil rape your children?’"},{"comment_id":"10155382822311729","commenter_b":"Dumb ass","commenter_a":"What legacy?? Racial divide war on our police officers open our boarders to ever illegal and terrorist trillions of dollars in debt millions on vacations for him and his family no decent jobs no affordable healthcare despicable treatment of our military and veterans... shall I continue I say good riddance finally this country is going to get a leader who's for American and its people we have hope finally","post_message":"Yes."},{"comment_id":"619138891610023","commenter_b":"that alright. She can just leave the white","commenter_a":"Just shut up","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with.  Nobody cares. What a joke.  Do you agree Michelle Obama should keep her mouth shut?"}]
