[{"comment_id":"1368996799860037","commenter_b":"She's an ugly see hag and formerly a man.","commenter_a":"Kellyann is wearing some weird kind of uplift bra in this picture.Her tits actually hand down and get crushed between her thighs. She tires to hide them and never goes to the beach because they are full of zits and varicose veins.","post_message":"LOL"},{"comment_id":"10153223186871336","commenter_b":"Lol @username it wouldn't be America without us it would still be Native American land Indian land you call crazy and aliens would still be over in Europe living without sign in famine","commenter_a":"Actually 52-0 if you count all the woman beatings and cheap shots outside of the ring.","post_message":"ICYMI: Floyd Mayweather piled up enough points against Manny Pacquiao to win by unanimous decision in their welterweight title bout last night. Mayweather extended his win record to 48-0, cementing his legacy as the best of his generation."},{"comment_id":"10154525720961323","commenter_b":"@username: \"In any case, the only way to deal with migration is to recognise what really causes it (inequality, proxy wars, global warming you name it) and to start coming up with responsible and honest solutions rather than shutting yourself off.\" I definitely agree. Our high levels of foreign aid and international development is only the beginning. We need to stop bombing other peoples countries and begin accepting a LOT more refugees. ------------------------------------- \"Voting yourself out of the EU has not solved that problem at all and it will most certainly not lead to more non-EU migration\" But with control of our own borders we can stop priority status for Europeans over non-Europeans and decide our immigration policies at election time. ------------------------------------- \"And if you are so concerned by population control on your island\" I'm concerned about population control on earth. I've absolutely no idea what we do about never-ending ...","commenter_a":"That is the future the masses chose. If you don't like it, do your research next time instead of foolishly buying into far-right propaganda.","post_message":"\"There is very little evidence of people knowing what they are trying to do.\""},{"comment_id":"549044465305156","commenter_b":"You mean illegals who want free shit? Trump 2016 Killary Corrupt and OSUCKO Shitbag for Prison 2016","commenter_a":"To all the Hispanic and women out there, we all need to VOTE!!! Our vote has to be the one that makes the difference of who will be our new President Mrs. Clinton.. lets all make sure that we the piggy, uglys fat black and hispanic show Mr. Trump that we where the ones we the power for him not to be our new President, trust me he will always remember us women.","post_message":"This is Alicia Machado, the former Miss Universe who Trump bullied and harassed, calling her an \"ugly\" \"Miss Piggy\" and \"Miss Housekeeping\" -- just because she is Latina. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153400579000329","commenter_b":"He's all yours, ladies lol","commenter_a":"Greg Paul Rachelle Krista","post_message":"His name is Brock O’Hurn and he's the king of man buns."},{"comment_id":"10154262733576615","commenter_b":"The men don't have to be gay .. the killer doesn't have to be gay.. if there even is a killer, it could be male or female.. (although the odds are low of that ) .. I'm just saying it's funny how I feel it would be different if this many bodies were found and they were female. I don't like how ppl instantly assume this many men just walked into the river accidently drunk.. especially when their have been bodies found in garbage cans and other areas as well. It may be a big city but a serial killer theory is plausible and cannot be excluded when this many individuals seemingly \"walked into the river\" accidentally. The men are young mostly college aged looking ... if someone is targeting them it could be for a variety of reasons. The only thing they seem to have in common is they ...","commenter_a":"I can't be the only person that's starting to get the impression there may be a serial killer in Pittsburgh","post_message":"JUST IN: Skeletal remains found earlier this week in a trash can have been identified as Dominick Brown, a Penn Hills man who went missing in 2012, his family tells Channel 11 News."},{"comment_id":"767530393325420","commenter_b":"If employers are fined and punished who hire illegals and no welfare benefits were given to illegals, they'd have no incentive to be in the US and they go home..","commenter_a":"Senate Democrats need to stop being obstructionists!!! Keep up the good work Congressman.","post_message":"If Senate Democrats aren't happy with the House-passed #DHS funding bill, then they should allow debate & amendments-- that is how our government is supposed to work. I fear that Senate Democrats are playing politics with America's national security in an effort to protect the President's unconstitutional #executiveaction and to protect themselves from having to go on the record with their pro-#amnesty positions. #DontShutDownOurSecurity"}]
