[{"comment_id":"10154429543778196","commenter_b":"Better than watching u suck dick in public","commenter_a":"Really maybe he and Putin should just get a room sick of watching them suck face in public","post_message":""},{"comment_id":"10153635584924575","commenter_b":"What about rap videos or BET...come on people","commenter_a":"All them white girls in one video.....thats RACIST","post_message":"A University of Alabama sorority has taken down a recruitment video after receiving a lot of criticism. One website described it as, \"Stepford Wives: College Edition. It’s all so…unempowering.\""},{"comment_id":"10153457336028525","commenter_b":"Brian","commenter_a":"Jose J Torres","post_message":"A cure for diabetes? It could happen, and they've already begun testing it in a small number of diabetic patients. STORY: @webpagelink"},{"comment_id":"1012223128870741","commenter_b":"Finally, someone says something. Geez, spot on Sean Penn 😊","commenter_a":"All trash talk by liberal wimps","post_message":"He's right. America must never forget who is truly responsible for creating ISIS. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154428619792144","commenter_b":"Kimberly, other than Melania Trump, you wouldn't know an illegal immigrant from a U.S citizen if your life depended on it. Get ahold of yourself woman!","commenter_a":"Seriously????? Let it go.....He's done, THANK GOD!!!!!! The end of an ERROR....","post_message":"Thank God."},{"comment_id":"10153573726630950","commenter_b":"bitch shut your half dead looking ass up !!!","commenter_a":"I am watching on television and I am seeing a lot of Mexican Flags. This is absolutely unacceptable. Last time I looked, California is still a state in the United States of America. If you want to fly the Mexican Flag, go back to Mexico!","post_message":"WATCH: Protesters are gathering outside of a Donald J. Trump event, shouting chants and clashing with police @webpagelink"},{"comment_id":"1615919975382867","commenter_b":"Jake Jutras the first eagle has landed","commenter_a":"Virgil John Ariel John Monique John","post_message":"#BREAKING: The first eaglet has HATCHED! Harriet and her mate M15 were both at the nest during our first sighting of the eaglet, which is almost fully out of his or her shell. A New Year's Eve eaglet - SO EXCITING! Video: Southwest Florida Eagle Cam STORY: @webpagelink"}]
