[{"comment_id":"10153582550231336","commenter_b":"Hi Donald Trump, what about putting those illegal people in the row to go fight against IS IS if they want to stay so bad. The America way!!!!just a thought.","commenter_a":"Hillary will send food stamps.","post_message":"In an interview, Donald J. Trump said that he would deploy U.S. troops to Iraq to seize ISIS-held oil fields, in order to choke the financial spigot that fuels the terror group."},{"comment_id":"10154166026884342","commenter_b":"Phulleeezzzee this woman isn't going to get caught","commenter_a":"There are freaking cameras everywhere. You will get caught. Not worth it. And the problem with leaving your purse in the car is her lousy boyfriend is watching in the parking lot and waiting to break into your car as soon as you're in the store. And these are the same ones videoing as a cop takes them down and screaming police brutality. You live by the camera, you are gonna go down because of the camera. Smile!","post_message":"A California woman is drawing eyes after she appears to brazenly snatch a wallet from the purse of a fellow shopper. @webpagelink"},{"comment_id":"10153728692094117","commenter_b":"Lol pussy","commenter_a":"Reason can go fuck itself. If you are a pro-Trump libertarian, like my page.","post_message":"'You know−the Constitution−there's nothing like it. But it doesn't necessarily give us the right to commit suicide, as a country, OK?'"},{"comment_id":"703909133102373","commenter_b":"Keep it going and that shithole country might be cleaned up someday👍","commenter_a":"the result is the same be it honor killing (Indian way) or random shooting of school kids (US way)","post_message":"India reports a spike in “honor killings” — but the numbers are probably even higher."},{"comment_id":"10152853525740667","commenter_b":"If she needs to step down than Bruce Jenner needs to be a man","commenter_a":"Michelle","post_message":"Last week, Rachel Dolezal's parents said she was born Caucasian and has been deceiving people into thinking she was African American."},{"comment_id":"10154034198879749","commenter_b":"And here we have it ladies and gentlemen. You see, when you dare to question one of these social justice creatures and it becomes apparent that absolutely none of their arguments hold up to scrutiny, they start with the personal attacks just like they've been taught. Thank you Tracy, for showing us all just what an utter lack of both argument and character you possess. Why don't you pop off back to Tumblr and tell all your sympathetic sisters how the nasty misogynist was harassing you.","commenter_a":"And if they end up working less hours, and being paid less as a result I'm sure we'll hear all about the sexist 'wage gap' a little more from the social justice cretins.","post_message":"A Bristol firm allows women to work flexibly at different times of the month to tap into employees' 'natural cycle to create happier working environments.'"},{"comment_id":"10158072025935354","commenter_b":"I'm for @username!!! How does the left even get through the day?!!! So brainless!!!","commenter_a":"This campaign has shown us how truly mentally ill a large part of our population is.","post_message":"America is seeing the Left for the hate machine it truly is.   #Exposed"}]
