[{"comment_id":"10153770425869153","commenter_b":"You can't possibly be that stupid Christine ....","commenter_a":"just read where radical islamic muslims will come in with Syrian refugees so yes I agree with Trump","post_message":"What are your thoughts on Donald Trump's comments?"},{"comment_id":"1129911067026242","commenter_b":"Well said my friend....well said!! Megan Kelly WILL tear them apart...no doubt about it!","commenter_a":"Oh trust me they are in for a rude awaking during this interview. Big mistake if they think it will be a walk in the park. Megyn Kelly will rip them a new one. She is awesome at her job and takes no prisoners. Fox News is the only station not on Obama's payroll. ( not that this has anything to do with him) but it's the only news station were you can expect to hear the truth!!!! Love Megyn and Fox!!","post_message":""},{"comment_id":"10152734752677434","commenter_b":"Lol","commenter_a":"Hmmmm I actually do think he's kinda sketchy re: women. If he's so power to the people, then where was he when Gore or Kerry ran? Just sayin","post_message":"Bernie Sanders wrote an essay in 1972 that mentions rape, and it's weird as hell"},{"comment_id":"10153794023656051","commenter_b":"If she had broken into my house, I would have gotten in bed with her and just laid there waiting for her to wake up.","commenter_a":"I'd shag her then call po po","post_message":"This wife came home early and found this woman in her bed. She immediately assumed her husband was having an affair. It was only after she ordered him to come home and confronted him about it that she finally discovered the truth."},{"comment_id":"1022963947726395","commenter_b":"are all lesbians feminists?","commenter_a":"Fat shaming is a hate crime.","post_message":"A disgusting new low."},{"comment_id":"894432780616200","commenter_b":"Baltimore is am example of liberal policies failure people want jobs not government social handouts","commenter_a":"This is a Democrat liberal myth if any of the Democrats they would read a history books they would learn that the Democratic Party was the original racist party remember Lincoln was a Republican","post_message":"Can't say we weren't warned ahead of time this might be a problem."},{"comment_id":"10152729165306051","commenter_b":"Why , is a pig smarter?","commenter_a":"I am offended that they are catered to. I love pork and will continue to eat it unless my doctor says not to... then I may eat it any way. No religious cult will tell me what to or what not to eat, wear, pray, etc.","post_message":"This publishing house just banned all references to sausages or pigs because they offend certain religious groups."}]
