[{"comment_id":"10152841582006130","commenter_b":"Yas girl","commenter_a":"Phebe Kim Gignac","post_message":"Your taste buds are going to explode."},{"comment_id":"10156148528265725","commenter_b":"Trump has the mentality of an 8 year old class bully","commenter_a":"Suzanna Mikolajczak Trump is a Beast","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"10153619223127042","commenter_b":"My condolences to the family","commenter_a":"Kristopher Jadoo omg","post_message":"BREAKING: New details have emerged about an entire New Jersey family found dead at a burned home."},{"comment_id":"10153939512524087","commenter_b":"@username .... Why would anyone vote for Hilary the war monger ? She stands for nothing that benefits American citizens... all she talks about is illegals and bringing in Muslims... blacks are totally used by her.... She dumps illegals in poor black communities... but will never have Muslims or illegals where she and her friends live.... people like you are a joke.. total fools.. and Trump is not a racist stick that card up your asss... its old used outdated game...","commenter_a":"After Trump loses in the election I wonder what's next for Republicans. Atleast he brung out the closest racist and exposed the Republican party for what it is","post_message":"Prominent Donald J. Trump critic GOP Sen. Jeff Flake had kind words to say about Trump following last night's nomination speech at the Republican convention."},{"comment_id":"10155602222490354","commenter_b":"I would let my daughter be a part of this group, it has been infiltrated by radical lesbian feminist. Children are not safe with them!!!","commenter_a":"Is this a great country or what?","post_message":"It's not clear how this will affect cookie sales...."},{"comment_id":"10153758605053132","commenter_b":"These woman work these jobs to get rich. Tigers Woods wife was a nanny Arnold Schwarzenegger's, house keeper, now this chick. These women plot & plan to insert themselves into the money by any means necessary.","commenter_a":"Bad woman what goes around comes around! She will be sorry! Down with Affleck and her!!","post_message":"She's staying busy."},{"comment_id":"10155143556313701","commenter_b":"Watch and you might learn something. @webpagelink","commenter_a":"The woman left behind her child in a hostile environment so she could save her own skin just to turn around and blame Trump's temporary travel ban as why her reunion with her child got delayed. Talk about one selfish mother.","post_message":"While in the vetting process a Somali refugee, named Sahara, gave birth to her son. Children are not automatically approved to travel, though, so she left her son with her mother in Uganda to speed up the process."}]
