[{"comment_id":"984113211608432","commenter_b":"Why are girls doing this! It's so ugly!","commenter_a":"Elle Paiva-Wilson","post_message":"In a dangerous new beauty ritual, teens are sucking on shot glasses to pump their lips, then posting photos of the disastrous results on social media. >>@webpagelink"},{"comment_id":"10153467245366770","commenter_b":"@username are you doing your homework?","commenter_a":"According to Roger Stone, 182919686769s Mens Fashion Editor and the only named \"source\" in the National Enquirer smear story about Ted Cruz cheating on his wife with five women. Ted Cruz doesn't have time for that crap, he's too busy pushing back the establishment.","post_message":"\"Despite the old guard and amateur pundits blaming Donald J. Trump and the majority of GOP voters who support him, much of the rift in the Republican Party has been caused by Texas Senator Ted Cruz conning nationalists into believing he is one of them.\""},{"comment_id":"1696699610390161","commenter_b":"She deserves prison put her there please then we won't have to see that disgusting face of hers","commenter_a":"Total investigation","post_message":"Does she deserve to go to PRISON for breaking the law?"},{"comment_id":"1180033235377842","commenter_b":"Obamo is nothing but a Fuc##^#gJerk that is trying to desroy AMERICA !!!!!!","commenter_a":"Shocked, Hassan rejected Syrian refugees! Of course Obama told the Govenors to pound sand! He's sending them in under the darkness of night on buses!","post_message":"Did your state make the list?"},{"comment_id":"10155973415020354","commenter_b":"Shame on you Fox. Personal feelings are so beyond this forum. You putzes might as well learn how to say, \"large sized or regular?\"","commenter_a":"I'm for Ted all the way, but if Fox wanted to hurt trump it was a mistake,","post_message":"Trumpnado!"},{"comment_id":"936764406358981","commenter_b":"what tits. he was smelling her fart","commenter_a":"\"Joe stop staring at my tits, thanks.\" ~ Hillary","post_message":"Can you imagine?  Talk about our country going to hell in a handbasket…"},{"comment_id":"920923791276376","commenter_b":"She is a scandal ridden low life scum.","commenter_a":"What does this say about Hillary Clinton?","post_message":"BREAKING - Hillary Clinton's Sex Scandal"}]
