[{"comment_id":"10153502660004087","commenter_b":"Obviously! She won by less than 2 delegates- 6 of which were won by COIN TOSS.","commenter_a":"She will enjoy in prison","post_message":"“Obviously, Secretary Clinton has won. So congratulations to her,\" said White House press secretary Josh Earnest said. I am sure they feel good about that. They should.\""},{"comment_id":"10152740114462623","commenter_b":"He dumb sis","commenter_a":"Bos Larry look...","post_message":"A Greensboro teen has been charged with inciting a riot for allegedly using social media to encourage followers to meet at a mall to loot stores and attack police this weekend."},{"comment_id":"1368996799860037","commenter_b":"She's an ugly see hag and formerly a man.","commenter_a":"Kellyann is wearing some weird kind of uplift bra in this picture.Her tits actually hand down and get crushed between her thighs. She tires to hide them and never goes to the beach because they are full of zits and varicose veins.","post_message":"LOL"},{"comment_id":"10155189089842439","commenter_b":"Please believe...that they are AT WAR with the rest of the non-islamic planet!!! The rest of the world will have to join together and obliterate them!!","commenter_a":"Why this evil group, can still perpetuate these senseless brutal killings of people, is difficult to fathom! This is one legacy!, Obama will be remembered for!....under him, the killings of human beings in the middle east became a sport! Obama, thank you very much!","post_message":"ISIS has released a new video showing a brutal execution of an Iraqi man. ISIS drowned the man in liquid detergent."},{"comment_id":"848836128595379","commenter_b":"Eat shit loser!","commenter_a":"No one has won any war against Afghanis.It is history.","post_message":"When you're on a mission to defeat the Taliban, but fly fishing is life. ~Josh"},{"comment_id":"10153660734489726","commenter_b":"what a mess she is!","commenter_a":"You mean murder!!!","post_message":"WATCH: Goldberg: Planned Parenthood Founded for Abortions"},{"comment_id":"1010236605683478","commenter_b":"What a joke. Most of those assclowns couldnt get laid without a prostitute. Legalize it so the ladies can get paid. Quit hating on people.","commenter_a":"put more people out of work!","post_message":"Eric Holder had to send an unbelievably embarrassing memo to his DOJ staff that shouldn't even be necessary, telling them not to hire prostitutes."}]
