[{"comment_id":"10153180369332042","commenter_b":"Idiots.there goes their life down the drains.","commenter_a":"White trash ! Throw Away the key","post_message":"SINISTER GROUP 'PROJECT:' These 5 students met before and after school for week -- but they weren't working on a group project for class or a fundraiser for a pep rally.   Cops say what they were planning on doing was deadly."},{"comment_id":"10156726524125725","commenter_b":"Hide yo kids, hide yo wives.","commenter_a":"Will he be blocking polling places and stopping people from voting like he did in MA? After all, if you can't win an election honestly CHEAT, just like you did TO your wife!","post_message":"Illinois is shaping up to be an important state in the Democratic presidential race, so much so that former President Bill Clinton will be stumping in the Chicago area this week ----> @webpagelink"},{"comment_id":"10150514383944999","commenter_b":"All terrorists are Muslim?","commenter_a":"\"Boko Haram (\"Western education is forbidden\"), officially called Jama'atu Ahlis Sunna Lidda'Awati Wal-Jihad (People Committed to the Prophet's Teachings for Propagation and Jihad), is a militant Islamist movement based in northeast Nigeria.\" There's that common denominator again: Islam.","post_message":"Soon after Boko Haram kidnapped nearly 300 teenage girls in Nigeria, the U.S. sent surveillance drones and about 30 intelligence and security experts to help the Nigerian military try to rescue them. Seven months later, not one of the kidnapped girls has been found."},{"comment_id":"893708487388873","commenter_b":"Barbara can't you see what this Idiot is doing to this country?","commenter_a":"I agree. It makes no difference to me if a Republican or Democrat occupies the White House. This HATRED for this PRESIDENT is appalling. In their HATRED they are destroying America! But they're too ignorant to realize it!!","post_message":"Too true.  Image by Occupy Democrats."},{"comment_id":"952115494844980","commenter_b":"Because Mark she would be a WOMAN President!!! That's it!!!","commenter_a":"I'm from Brazil, and i support @username to President of USA. <3 #GoHillary","post_message":"Rising fifth grader Emily had a big question for Hillary in New Hampshire:"},{"comment_id":"613162948816887","commenter_b":"Try to imagine how little I care about anything this pre-teen brain has to say.","commenter_a":"She's a f*cking but job anyway....","post_message":"She is PSYCHO crazy folks."},{"comment_id":"1029734007098210","commenter_b":"Poor old bitch. Still eat up with dumbass","commenter_a":"Cannot wait! This should be fun. Trump has his problems but hillary is such a liar that I hope she turns pknk.","post_message":"Democratic presidential candidate Hillary Clinton took aim at Republican rivals saying she is looking forward to debating with them about the economy if she becomes the Democratic nominee."}]
