[{"comment_id":"10154528365584342","commenter_b":"@username. Kim kardashian has done nothing in her life compared to Trump. Except suck like 10 ninjas dikks.","commenter_a":"Haha, once again ch. 13 is being biased. Haven't y'all seen all the libtards going unhinged on social media. Or commie elected democrat officials too. Democrats are the ones talking non stop about the results of the election. And calling president elect Trump not their president. Now that's un-American and petty.","post_message":"One expert blames it on Trump's insecurity from losing the popular vote. Others say it's just Trump being Trump."},{"comment_id":"10154232902826600","commenter_b":"It's called hustle lady! Wtf? No it's called dirt bag thief. It's not hustle it's theft. What a douch.","commenter_a":"Just don't understand why people think it's ok to take things that don't belong to them...no freakin' values or morals.. Disgusting!","post_message":"She was taken into custody without incident after being found through social media tips and “old fashion police work.”"},{"comment_id":"1553198684973790","commenter_b":"LOSERS! ONLY TRUMP FOR PRESIDENT!","commenter_a":"Trumps my guy!!! GO","post_message":"Washington insiders and politicians have failed America. If I am elected President I will create jobs, end illegal immigration and #MakeAmericaGreatAgain. #Trump2016 Support Trump: @webpagelink"},{"comment_id":"1101969979880290","commenter_b":"@username and @username You are both aware that faith is not a verifiable thing,correct? You also don't need religion to have the emotion of faith in something. My goodness...where do you people get your educations?","commenter_a":"Pretty happy we have the technology to make this happen. Thanks to the doctors for their experirnce and service. god has nothing to do with this surgery how about you thank the heros the doctors.","post_message":"After over 26 hours of a remarkable surgery, the moment when the parents saw one of their conjoined twins separate for the first time. The twins, Anias and Jadon were successfully separated after being born conjoined at the head 13 months ago. #JadonAndAnias. @webpagelink"},{"comment_id":"1262934473727561","commenter_b":"There is no 'weaker' version of the species. Both genders are the same species, just with physical differences.","commenter_a":"12,000 yrs. ago and they're still Lions 😭😭","post_message":"These images are just extraordinary. The cubs were just a few weeks old when they died."},{"comment_id":"485687248279822","commenter_b":"The problem is when she decided to do this job the law was different. Leave her alone. Why should she be penalized for her beliefs?","commenter_a":"she, does not want to work....so go home lady","post_message":"If you can't do your job, maybe you shouldn't have it..."},{"comment_id":"10153504055809024","commenter_b":"If she is that ugly let her hide.","commenter_a":"It dies offend me that someone would hate women so much to do this to them","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"}]
