[{"comment_id":"465974283593152","commenter_b":"too damn bad. if they dont like get their asses out of our country. they dont and will not control america.","commenter_a":"Hell no!! They offend us just being here!","post_message":"Should The Words 'Bacon', 'Pork', 'Sausage' Be Banned?  Comment 'yes' or 'no'."},{"comment_id":"10153233984390950","commenter_b":"Did you think women are incapable of evil","commenter_a":"And the people who are saying the women and children are safe, check out who blew herself up with the suicide vest","post_message":"Police give update on raid near Paris: • Woman wearing explosive suicide vest blew herself up • 7 suspects taken into custody; 2 suspects dead • 5 officers reportedly injured; police dog killed"},{"comment_id":"10154460256056509","commenter_b":"Let's not forget she's a sleazy hooker who is doing the work of an immigrant that no American would do.","commenter_a":"Oh so what! trump made fun of Bush having his 90 yr okd Mom campaigning. At least you can understand her, unlike Trumps trophy wife who needs speech lessons. Do we really need a flotus who barely speaks u derstandable englush!","post_message":"See if you can tell why Ted Cruz's campaign pulled this ad."},{"comment_id":"10153978069921178","commenter_b":"Rosa, that is not your place to say","commenter_a":"andyou need to get out of the United States","post_message":"Michael Moore goes off the rails (more than usual) in bizarre interview."},{"comment_id":"980597458645157","commenter_b":"Let's start following it, shall we?","commenter_a":"God bless the Constitution of the USA","post_message":"Happy Constitution Day!"},{"comment_id":"607938739358501","commenter_b":"Then dont go watch guadian of the galaxy 2 ..groot hates you!","commenter_a":"Look! Its raw meat! Its eel on the grill.. so it is food! We human are mammal and also carnivore. So eat things raw is a way of eating. Only when you kill for fun and waste the meats of throw away too much leftover then that would consider a sin for others may not have enough to eat! If you think eating thing raw is immoral or gross then throw away your fruits, veggies because they are still living things and have souls and you may not know it! Damn you people with no understanding and misjudgement","post_message":"What. The. Hell."},{"comment_id":"10152938461282293","commenter_b":"GOOD. We need less politics. Clinton's and Bush's destroy this country. Carson is an actual person, not a career politician. Wise people WANT someone who is not a politician, unless you would prefer to stick with the status quo.","commenter_a":"Gifted hands, doesn't mean meant for politics...","post_message":"In Opinion, Dana Milbank writes: 'Carson has little in common with the political class but for one thing: his absolute confidence in his own greatness.'"}]
