[{"comment_id":"991078264282036","commenter_b":"Tom Schmidt I beg to differ !!!!!! She is very much for woman and for men to!!!!!!","commenter_a":"Women let's unite for Hillary. President Hillary.","post_message":"Raising the minimum wage, paid family leave, child care: These aren’t just women’s issues -- they’re also family issues and economic issues."},{"comment_id":"10153383817802061","commenter_b":"Super cute","commenter_a":"Dad's are important too","post_message":"WATCH: Heartwarming and powerful new message with NFL's DeAngelo Williams, Jason Witten and Ben Watson on spending time with daughters, as they do their hair and bond with them."},{"comment_id":"1032567170171905","commenter_b":"Remove her ass from the team.","commenter_a":"We are glad you are unhappy here... Please feel free to hightail it home!!! You are an embarrassment to our country!!!","post_message":"Ibtihaj Muhammad - the first American Muslim to compete in the Olympics wearing a hijab - just went on a disgusting rant about how much she hates the United States. This is SICK..."},{"comment_id":"503378786489136","commenter_b":"She is nothing but a bigot. Keep her locked up until she complies","commenter_a":"Do the right thing. Spread hate in the name of Jesus and shield your bigory with the bible. Claim you are a christian to defend your sorrid past to justify issuing your twisted moral judgment on others. Yes than you will be a twisted evangelical christian spreading the hate of your chosen religion.","post_message":"Who is the clerk in the middle of the same-sex marriage debate?"},{"comment_id":"10153963116971341","commenter_b":"Better one soldier in jail and one terrorist dead then one terrorist in jail and one Israeli dead. That Palestinian is a terrorist who tried to stub innocent civilians.","commenter_a":"A large proportion of the Israeli population supports these extra-judicial killings @webpagelink","post_message":"\"What happened in Hebron does not represent the values of the Israel Defense Forces.\""},{"comment_id":"883164491718973","commenter_b":"She is evil & a liar!!!","commenter_a":"She's a bigger liar than her husband and he lied to the Supreme Court and got away with it","post_message":"We must STOP HILLARY!"},{"comment_id":"10154150775406636","commenter_b":"The House of Lords are having this overturned? Since 2005 The House of Lords do not have the authority to overturn a court decision. The highest court in the UK is now the Supreme Court.","commenter_a":"the country voted that Judges are tw@s...but the house of lords are having this overturned..","post_message":"More follows"}]
