[{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154689577603812","commenter_b":"He also has many lawsuits in the 80's and 90's for discrimination against blacks and people of color.","commenter_a":"TRUMP STOOD UP FOR BLACKS AND JEWS: About 20 years ago the rich elites ran Palm Beach and wouldn allow Jews and blacks to use the golf and country club facilities. When he bought Mar-a-lago, MR. TRUMP WENT TO COURT TO END THAT DISCRIMINATION, won in court and forever changed how minorities are treated in Palm Beach. That THE REAL Donald Trump. What has Hillary or ANY politician done? @webpagelink","post_message":"A potentially record-breaking gap between two groups marks one of the most striking elements of preferences in the 2016 presidential race: college-educated white women for Hillary Clinton vs. non-college white men for Donald J. Trump."},{"comment_id":"1112791138738235","commenter_b":"1 stupid bitch","commenter_a":"Unfortunately she is right more often than not.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153373281922434","commenter_b":"'@username debates anything that's pro-woman.","commenter_a":"Why should I believe a man who says, 'Fighting for us'? Women are an afterthought in those situation, a 'rising tides lifts all ships'. I have never bought that line in total. If you say a man can fight for women, then a women can fight for men. Men need to deal.","post_message":"'Consider her slogan, 'Fighting for us.' For many men, this slogan would have to be experienced as emasculating. A woman fighting for them?'"},{"comment_id":"1394774427201577","commenter_b":"She shouldn't even have a job because she is an illegal alien.","commenter_a":"Frank tokar maybe if you were in her parents situation would do the same , you do anything to make sure sure your children are safe and have the best you can give them , USA is a líder no a low un respectful selfish heartless country thanks god no every American think that way USA is a country of opportunities no one takes your jobs away all depends on you how hard you work .","post_message":"Rick Santorum and Anna Navarro engage in a passionate exchange with a DREAMer who says she may lose her career if the new administration ends DACA. @webpagelink"},{"comment_id":"1749284951998475","commenter_b":"I love this","commenter_a":"'@username @username me in second year","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"1776934572577306","commenter_b":"I will be voting for Hillary, because trump is grabbing pussy","commenter_a":"If you still plan to vote for HilLIARy after this, you must hate Trump more than you love your country. Think about it. Long and hard. Is your pride worth placing an untrustworthy, corrupt criminal, who flippantly handles our national security, in the highest office in the land?","post_message":"Hillary Clinton's campaign is waging a full-out war on FBI Director James Comey in the final 10 days of the election."}]
