[{"comment_id":"1098705460221855","commenter_b":"@username, you are for Hillary because she is all for bringing others like you here. When you come here, what did you get given to you???? I know you didn't come here with your own money, food, clothing, transportation, etcetera.... It's one thing when people came to this country because they had the hunger for the \"American dream.\" All of the immigrants coming into our country NOW, are money grubbing leaches. They don't respect our values, our flag, and don't care to make this country better.... Just to suck off uncle Sam's teet. I don't WANT to buy health insurance!!!!! WHY should I have to??!! What kind of freedom is THAT???? I think YOU need to do YOUR research!!","commenter_a":"We are taught at schools of what @username did for all American,especially The affordable Health cards. I believe that she will make tramandous change if elected. TRUMP is all set to be Casino manager. That's all.","post_message":"This is really happening—Donald Trump just officially accepted the Republican nomination for president. Share this if you agree: We can't let him anywhere near the White House."},{"comment_id":"1170528036314405","commenter_b":"She knows she can't do it. She has to bring her husband in to do it for her. I guess we are not ready for a woman President.","commenter_a":"Hillary says she will appoint Bill to run the economy. We've seen the Clintons in action together before in the Whiter House. We call that getting two crooks for the price of one.","post_message":"The Clinton Foundation's business relationship with 20 foreign governments raises real questions about her judgment. Simply put, Crooked Hillary is in no position to be President of the United States of America."},{"comment_id":"1259514897430388","commenter_b":"I hope the other women in jail rip her to shreds BARE HANDED","commenter_a":"They outta stab her and rip her cords out without painkillers so she cant have any more kids","post_message":"JUST IN: Buckeye mother Andrea Portillo is accused of stabbing her 5-month-old infant to death. MORE: @webpagelink"},{"comment_id":"1549351415084883","commenter_b":"Dear Miss Jordan the idiot is not I that's for sure, just remember this this is not your land to start with. I hope you don't have an issue with the Native Americans because if it's true you should go back with you where you from.","commenter_a":"Why does the police have military style vehicles, why does the Native Americans still have to defend their land, why our government doesn't do anything about it.... Same old story oil companies rule the world.","post_message":"Watch as police in riot gear use pepper spray on activists protesting against the Dakota Access Pipeline. Multiple were arrested. More: @webpagelink"},{"comment_id":"1044884802218658","commenter_b":"exactly...if they don't want to procreate, they get it from somewhere else...LOL","commenter_a":"Now wait a minute! I thought they only had sex to procreate!","post_message":"Finally! A \"Christian\" guide to dealing with the \"sexual immorality\" of a wife refusing to give her husband sex-on-demand without a \"legitimate\" physical or mental health reason!"},{"comment_id":"10154369959116509","commenter_b":"Trump will eat her alive!","commenter_a":"So ... u think u luv Hilary Clinton .... u like Hillary Clinton .. u want to vote for Hillary Clinton ... u r impressed how the liberal media only shows u her smiles ... well.... here is some of her smiles ... enjoy ... @webpagelink","post_message":"Former Rep. Gabby Giffords and her husband Mark Kelly endorse Hillary Clinton on Sunday, she is the only \"candidate for president that has the determination and toughness to stand up to the corporate gun lobby -- and the record to prove it.\""},{"comment_id":"10153994248378132","commenter_b":"Illegals. Not immigrants.","commenter_a":"Ironic to be married to someone with such disdain for immigrants.","post_message":"Barbara Walters says she was surprised by Melania Trump."}]
