[{"comment_id":"960663503945907","commenter_b":"If you don't love her(America) then leave now !","commenter_a":"Good bye Felicia!","post_message":"U.S. students jump off deep end: Renounce America Now it's official. Many American students want to have nothing to do with the U.S., and they're pressing for this astonishing action."},{"comment_id":"10153117785839440","commenter_b":"close your trap you negative nancy!","commenter_a":"Who cares- nuggets are less than irrelevant.","post_message":"Denver Nuggets selected Emmanuel Mudiay with seventh pick of the NBA Draft @webpagelink"},{"comment_id":"920858977949524","commenter_b":"Hillary is a whore!","commenter_a":"What does this say about Hillary Clinton?","post_message":"BREAKING - Hillary Clinton's Sex Scandal"},{"comment_id":"468340716665733","commenter_b":"I suppose those of you refusing to vote for him because of vaccinations would rather live in a socialist regime under Hillary.","commenter_a":"Yes!!!","post_message":"Will you stand with me. Together we can take our country back! @webpagelink"},{"comment_id":"10153759489753812","commenter_b":"How do you know? One year of college did not teach you much","commenter_a":"Creationist heads explode...","post_message":"Researchers in South Africa believe they may have uncovered a brand new “relative” to humans, and they have named the new branch of the family tree Homo naledi.@webpagelink"},{"comment_id":"1152094041550315","commenter_b":"This is Trump he's racist or rapists he brings crime and does drugs is insane and sometimes maybe nice but lies all the time! He only hooks up with foreign women probably keeps them in the basement until needed no American woman would ever marry him no matter how much money he has!","commenter_a":"Make America great again by getting rid of Trump! Check out the smile on that white boys face makes me sick and I'm white! Trump is nothing but a trouble maker and an embarrassment for America! Do any of his supporters listen to him I mean really listen and heed what he says and does?? I doubt it must be mental illness","post_message":"The laughter of the Trump supporters will haunt you."},{"comment_id":"896989227005981","commenter_b":"How much longer are we going to let this jackass destroy OUR country","commenter_a":"Will they cover whitr slaves also...or will they remain color blind???? NEVER HAPPEN ON AMERICAN SOIL WOTHOUT ANOTHER CIVIL WAR........JUST WHAT OBAMA WANTS...DIVIDE AND CONQUER","post_message":"Wait. WHAT?!"}]
