[{"comment_id":"10153015286404641","commenter_b":"Check out dis video @webpagelink","commenter_a":"Pls. friends click the link and like the photo of cedrick he's good and intelligent student he doesn't have money for his college. your like is to help for his scholarship and share to your friends .. we really need ur help .. just click the Link below .. Please Like Candidate #1 .. Thank you po .. :-) @webpagelink","post_message":"Nigerian voters refuse to be silent in wake of election delays @webpagelink"},{"comment_id":"10153837390443812","commenter_b":"No, just their sperm. Lol","commenter_a":"You mean survivors are contagious for nine months.?","post_message":"Doctors have found that Ebola can linger in some male survivors for up to 9 months."},{"comment_id":"927473010672643","commenter_b":"@username this has made my day!! When are you and Rene coming to visit I miss you guys!!!!","commenter_a":"Eyes bigger than stomach? 😜","post_message":"That's the most metal thing I ever heard. \\\\m/"},{"comment_id":"10153881891966782","commenter_b":"I think you ladies are missing the point of the story","commenter_a":"Here let me help you pay attention Army=soldier Navy=sailor Marine corps=marines Air force=AIRMAN you're welcome get it straight","post_message":"A Kirtland Air Force Base soldier and his wife are getting a lot of attention for something they posted online. @webpagelink"},{"comment_id":"10153649665288352","commenter_b":"Also he still has a dick so HE is still a man. No woman has a dick and balls","commenter_a":"Kylie is the insensitive one for calling Catilyn her DAD ...","post_message":"KYLIE JENNER CHECKS CHRIS BROWN OVER HIS POST ABOUT HER DAD"},{"comment_id":"1263312547023087","commenter_b":"James Walters watch it","commenter_a":"I feel deceived. I thought he was going to explain the theory briefly with the popcorn.","post_message":"It's the 100th anniversary of Einstein's theory of relativity this year. Here's an explanation so good, it won $400,000"},{"comment_id":"1054288197942749","commenter_b":"Even if that is the case (and that is some BULLSHIT) that is not what the feminist gender gap argument is all about. What happened to you is illegal, what THEY are bitching and whining about is NOT, nor should it ever be.","commenter_a":"And many women support kids on what they earn while the fathers of their children do no pay child support. Talk about discrimination!","post_message":"BOOM!"}]
