[{"comment_id":"10154047914259740","commenter_b":"Prayers for him and his family and all the law enforcement.","commenter_a":"Prayers for the officers","post_message":"The officer was shot Saturday morning while investigating a report of a break-in."},{"comment_id":"10152899469751130","commenter_b":"Women tearing women down. This is why we can never have nice things.","commenter_a":"The face and stance totally remind me of the gorillas at the zoo lol.","post_message":"Do not f**k with Ronda."},{"comment_id":"10152774943488717","commenter_b":"Women drivers..","commenter_a":"hmmm - am I the only one who doesn't \"buy\" the foot caught on accelerator? I feel for anyone who reaches the point where they should no longer be driving - this appears to be one of them.","post_message":"Watch as a driver in Wisconsin slams into nine cars in a parking lot: @webpagelink"},{"comment_id":"10153187094616636","commenter_b":"Typical Welsh comments !!!","commenter_a":"Hoog cheats by throwing himself to the ground in an attempt to get a South African player a yellow card or worse. Not a word of aplogy from the player, coach or former players. Why is it the Scots are such bad losers.?","post_message":"Gavin Hastings said the sight of Joubert leaving the pitch was \"the worst thing I have seen on a rugby field in a very long time\""},{"comment_id":"10152894841766636","commenter_b":"So they should ! Sex with a drunken person should never happen !","commenter_a":"It's funny, you could have had drunken sex over there without fear of prosecution. But if that new law comes in over here in the UK? A guy potentially could be charged with rape even though it was consensual at the time?!","post_message":"RIP Shagaluf."},{"comment_id":"893147240733824","commenter_b":"If the women go topless I'll go lol","commenter_a":"Aida Nunez really. Kids should not see this. Go home and do that at your own home. At least! Or in your backyard lol","post_message":"Go Topless Arizona organized a protest in Central Phoenix today. The group organized a protest march this morning down Indian School protesting what they view as discrimination against women. The law allows men to go topless,they say, while women cannot. We \"cover\" the story tonight at 9 & 10."},{"comment_id":"10153689211286438","commenter_b":"Are uggos ugly women who like to hire pretty secretaries for pay raise kitty chow.","commenter_a":"Lesbians can rape just as easily as men.","post_message":"It’s time to stop pretending that only men perpetuate violence and women are only victims of it."}]
