[{"comment_id":"1802884339926690","commenter_b":"evil woman","commenter_a":"You're right, Donald. She doesn't give up. She's been fighting to keep people like you from preying on others - all her life! You aren't even qualified to clean toilets.","post_message":"\"You interrupt me all the time. Why don't you interrupt her?\" All the times tonight's #debate moderators and Donald J. Trump talked over each other. @webpagelink"},{"comment_id":"804935616266161","commenter_b":"will the ACLU take up a case for violation of free speech?","commenter_a":"Floridians voted for him. Too bad the smart ones got him too.","post_message":"Governor Rick Scott is committing political malpractice. Parts of Miami Beach are already sinking into the rising ocean. Read more here: @webpagelink Image by Occupy Democrats."},{"comment_id":"10153599468079024","commenter_b":"Obnoxious establishment audience. Am I watching Jerry Springer folks?","commenter_a":"can you have the audience quit with the noise, so we can actually hear the questions being asked? it's rude","post_message":"Republican presidential hopefuls take the stage in South Carolina as CBS hosts the ninth GOP debate tonight. Watch live here: @webpagelink. Read the latest updates on CBS New York: @webpagelink"},{"comment_id":"10153299356731051","commenter_b":"@username IGNORE THE TROLL. NO FRIENDS ..NO SITE..NO BRAINS!!!","commenter_a":"Yes I agree with Trump make this nation great again","post_message":"Donald Trump wants to make America's military so powerful that the whole world will be afraid to challenge us. Would you like to see it happen?"},{"comment_id":"880698808638574","commenter_b":"Bilble is all about sex","commenter_a":"This is done in public? Wonder what goes on in private.. But Wait! Do we not hear of the domestic violence in this country also. Christian , Jewish, Hindu as well? Religion is not true religion if it practices such violence.","post_message":"A Saudi female victim of a gang-rape is sentenced to 200 lashes and six months in jail More details: @webpagelink"},{"comment_id":"1011521052257456","commenter_b":"SHOWA. I would say if you didn't think it could happen again, it's happening again.","commenter_a":"INVADERS don't assimilate!!!","post_message":"Unreal. Stupid public schools ... celebrating the subjugation of women."},{"comment_id":"413560098853531","commenter_b":"How can any woman murder a baby like this??? @webpagelink","commenter_a":"Well, when they intentionally murder babies and sell their body parts, what do they expect to happen? They are murderers, spiritual people do hate that. Here is a 18-week old baby, how can folks not get upset about murdering innocent babies? If you don't want to get pregnant, close your legs or be responsible. Stop using abortion as birth control; it's that simple.","post_message":"\"We've seen an alarming increase in hateful rhetoric and smear campaigns against abortion providers and patients over the last few months. That environment breeds acts of violence.\""}]
