[{"comment_id":"1401167556601539","commenter_b":"Well if you get appendicitis which is a sepsis or a serious infection in your appendix and it can burst you can die so if that's the case and you get appendicitis I would recommend your removing it","commenter_a":"God made humans with an appendix not about to remove it just because scientists have not quite figured out a use for it. Think about it","post_message":"Be grateful if you still have yours."},{"comment_id":"10153823736048128","commenter_b":"Gee Rickie: thanks for clarifying this And, I know my geography idiot; I was referring to Europe in a cultural sense. Did you forget to take your Autism meds Rain Man? By the way, we thick Yanks haven't allowed an invasion of Muslims into our Country on a scale no where near proportional to your own Country. Your Nation is finished you morons! So, go choke on a hookah you snarly toothed Lime!","commenter_a":"Why bother at this point when they are allowing millions of Islamists to openly invade Europe?!?! Seems like an exercise in futility or just some good media PR to appease scared & irate native Europeans.","post_message":"Authorities in Italy, Germany, Switzerland, the U.K. and Scandinavia searched 26 premises and seized electronic devices and documents."},{"comment_id":"10153444962923984","commenter_b":"Yes since he is their best muslim buddy","commenter_a":"Duh Yeah","post_message":"Well, this is worrisome. It's bad news for pretty much the entire Middle East, except for ISIS.  Do you think Obama has entirely botched the ISIS situation?"},{"comment_id":"10155146637143984","commenter_b":"Sad part Brenda Gantt at best they will pat him on the hand deport him without any consequence for ehat he did, he will turn around without a wall to stop them and illegally enter again.There was an incident ehere a woman lost her daughter unborn grandchild and new son in law to an illegal no consequences.She and several tried to get illegals deported what she got in my oppinion was a slap in the face, it cost too much to send them back where they came from.SERIOUSLY SHE PAID THE ULTIMATE PRICE TO BE TOLD THAT? No i say meet the authorities at the border say here are illegals we are returning.We need stricter rules if they are here they need to suffer same consequences a citizen does, whether here on a visa or illegal with no consequences for judgement given from court","commenter_a":"Ha ha Mexico will never pay for the wall and when they send the illegals back I can't wait to see all of you working in the fields","post_message":"Jaws hit the floor as soon as Trump revealed when the Mexico wall is going up. This came as a complete shock to Mexico, and is going to go a long way in shaping Trump's presidency..."},{"comment_id":"1777693052452722","commenter_b":"NOTHING BUT A BUNCH OF FILTHY FUCKING NIGGERS KILL THEM NOW!!!","commenter_a":"Come and get it you cowards. I'm just about fed up with idiots like you. Have you ever looked at who's out number.","post_message":"RACISM: Black Panther Promises To Kill All White Babies.  No media outrage, no riots, nothing.  Do you think they should all be arrested?"},{"comment_id":"1052165474817204","commenter_b":"Problem with getting help for these people is that they have to realize they have a problem and want to get help. Otherwise, it's a moot point.","commenter_a":"Why take his photo down? This is the poster boy for the NRA. His photo along with the rest should be displayed everywhere guns and ammo are sold.","post_message":"Chris Harper, 26, had posted on a blog about the TV reporter and cameraman who were shot dead: 'Seems like the more people you kill, the more you're in the limelight.'"},{"comment_id":"10153507892259203","commenter_b":"Figure out how to get guns from criminals. They won't follow the law and they the criminals are the problems. Use a little common sense. Let's fix places like Chicago were control is not working. Or do no lives matter.","commenter_a":"If you go by empirical data from countries with gun restriction laws to those that don't. ...it's a no brainer decision. ...gun control and restrictions DO work. The data shows less of these types of crimes. Does it completely stop gun related violence (where a gun was used to commit a crime)....NO. Does it lessen the chances of these crimes from happening. ..YES! Its been proven that there are less crimes where guns are used within countries with solid gun control laws...period. Every country that has gun restrictive laws and gun control is a prosperous nation whose avid hunters and gun clubs (shooting ranges) also prosper. Now if your argument and reason for no gun control is because you have the right to defend yourself...THEN you must also believe that the world would be a safer place if every country in the world had nuclear weapons to defend themselves... the ...","post_message":"Bill Maher blames right-wing media and Fox News for Charleston: 'They present a really twisted view.'"}]
