[{"comment_id":"533052596897970","commenter_b":"Her coloring is terrible. Bad makeup artist. It's not natural looking.","commenter_a":"they should've casted danai gurira from the walking dead. She'd do an amazing job. The fact that they couldn't get a beautiful chocolate actress is plain disrespectful","post_message":"Here's Why Casting Zoe Saldana with Blackface is a Major Problem. What do you think? Please share this video! #NinaSimone"},{"comment_id":"10154827367754197","commenter_b":"@username your a tart.","commenter_a":"Trump's ignorance is astounding. He should stop tweeting narcissistic nonsense and start reading the security briefings. We are the laughing stock of the world now that we elected a buffoon as president. God help us.","post_message":"Donald J. Trump is very upset with the United Nations after a recent vote. Read his comments on WFSB.com and the Channel 3 app. Then, tell us your thoughts on the statements by the president-elect."},{"comment_id":"10154716032249714","commenter_b":"Triggered a feminist. Didn't take long. What benefits will hillary do for you? Decrease tax rates hah funny. Zoe you sound little butt hurt you might need to see proctologist.","commenter_a":"Woah Woah Woah More Democratic Propaganda. Time to settle down @username.","post_message":"\"The first time I doubted my looks and worth was in kindergarten.\""},{"comment_id":"1257959987602294","commenter_b":"You are completely ignoring many of the issues such as the inequality in wages between men and women, the dearth of equality in positions of power such as government and business, and, many other issues which have been a problem for many years. Most murders of women are by men as are rapes. Women are often expected to wear short skirts and behave in what men deem a \"feminine\" way on TV and in many businesses. An excellent example is Fox news.","commenter_a":"I think this poem/speech misses a huge issue and ignores the obvious. Humans as a whole are failing. This isn't just a man's issue. I see, daily, women tearing other women down. Calling them the same things you hear. It is a problem from all sides. We have failed to raise children with respect, love, and caring. That is the issue. To suggest it is only males is dishonest. We should accept it is a societal issue and not a male/female issue.","post_message":"She’s a “dangerous\" woman because she dares to speak her mind in an online community that openly harasses, disparages, and threatens women. Warning: contains strong language. (via Agnes Török Poetry)"},{"comment_id":"10153095051856770","commenter_b":"\"please everyone\" stop paying attention to the talking pig.","commenter_a":"AMY you need to get out of your dad's shadow. He's an idiot. Just look at the death rate in every city the has very strick gun laws. If we did not count them in death by guns the United States would have the lowest death by fire arms than any other nation.","post_message":"Amy Schumer continues to advocate for stricter gun laws after a man opened fire and killed two people during a July screening of her movie “Trainwreck.”"},{"comment_id":"10154493541114060","commenter_b":"Karolina Kulewicz yeyeee","commenter_a":"Congrats Daniel your city came second again! No shame in being runners up 😂😂","post_message":"1. Melbourne 2. Vienna 3. Vancouver"},{"comment_id":"10153540366322061","commenter_b":"It's not. But I've never seen it happen. Making laws to protect the rights of others is NOT discrimination. Even if you find the laws offensive.","commenter_a":"So why is it alright to discriminate against Christians?","post_message":"Charles Barkley pushing the NBA to move the All-Star game from North Carolina due to state's so-called \"anti-LGBT\" law. \"As a black person, I against any form of discrimination.\" @webpagelink"}]
