[{"comment_id":"533221760173934","commenter_b":"If this CRAP ever does fly,WE the PEOPLE,aka The Government,aka TAX PAYERS,will be SUED by LEGAL IMMIGRANTS who became CITIZENS for a HEFTY PRICE($650 per or better)wanting their money BACK because these CRIMINALS got in for FREE and remain on the TAX PAYERS TEAT...Check the story on he IRS scandle of earned income tax credit for the illegals collecting on kids(nieces.nephews,kids)IN MEXICO...They are aware(news station expose')& claime it's up to congress to close the \"loopholes\"...","commenter_a":"a vow of silence would be greatly appreciated by all career politicians and family dynasty politics","post_message":"\"The people at the heart of this issue are children, parents, families, DREAMers. They have names, and hopes and dreams that deserve to be respected\" - Hillary Clinton"},{"comment_id":"466002853760417","commenter_b":"Screw your health care - you can buy a freaking wall instead America.","commenter_a":"Trump suffers from major PARANOIA....💰💵😎","post_message":"Speaker Paul Ryan on President Trump's executive order to build a wall on the U.S.-Mexico border: \"We're going to pay for it and front the money.\" Watch Greta Van Susteren's full interview with Speaker Ryan. @webpagelink"},{"comment_id":"909853555777564","commenter_b":"7 officers injured and one unresponsive..... Rioting, looting and destroying public and private property is not the answer. Attitudes of revenge and justification only feed into the hatred.","commenter_a":"Has anyone died from a spinal injury from one of these rocks? Oh...","post_message":"Developing: Reports of youth throwing rocks at police in Baltimore."},{"comment_id":"814799585299285","commenter_b":"Yes me to!! We better not be dumb enough to let another one get in like Hillary Clinton! We can't afford to have her ruin our country and drive it farther into the ground than Obama already has!!","commenter_a":"Can't wait for Obama to leave office","post_message":"President Obama will address the nation tonight. He needs to acknowledge RADICAL ISLAMIC TERRORISM! On Friday night in North Carolina, I was asked what I would say to Obama - at this point:"},{"comment_id":"10154098504122541","commenter_b":"Omg you. Are too much really","commenter_a":"Ugh, putting my faith in Mike Pence to save us from Trump? Lose Lose situation. Pence is actually scarier, he just tweets less. Hmm, decisions lol","post_message":"Let's talk about the 25th Amendment."},{"comment_id":"2117406141818910","commenter_b":"@username Lmao...lmao...lmao...lmao...lmao","commenter_a":"So now he he is blaming his own voters if he loses. Face it trump you are going to be the one who loses to a girl and in a big way.","post_message":"Donald J. Trump says he \"will never, ever forgive\" voters if he loses the election."},{"comment_id":"644967912360454","commenter_b":"That's a women? !","commenter_a":"He ain't banning a damned thing!","post_message":"A Hispanic student is banning whites from using this term... because it's racist? 'LIKE' if this is WRONG!!!"}]
