[{"comment_id":"10153668595164099","commenter_b":"This woman again? The Nurse who doesn't care if she infects everyone else? Go away! Your 15 minutes are over.","commenter_a":"Why are there so many greedy people in health care.","post_message":" never had Ebola. I never had symptoms of Ebola. I tested negative for Ebola the first night I stayed in New Jersey governor Chris Christie private prison, Kaci Hickox, 34, said. -----> @webpagelink"},{"comment_id":"10154965744184641","commenter_b":"I would agree that would be a good reason to March however that March said absolutely nothing about this. As a matter of fact the lady running the March believes in Sharia law and in her belief system this is perfectly acceptable","commenter_a":"This why we march. This is not acceptable for ANY culture.","post_message":"When she was 12, she was sold into \"marriage\" with a 70-year-old man -- and there are hundreds like her."},{"comment_id":"1106022556087458","commenter_b":"Her agenda with democrat socialist is to end all jobs in America. Prove to Me they intend to increase opportunities . Jobless rate only lowering past few years due to millions that left and no longer participating in work force .. They want more of that trend for sure.","commenter_a":"This is the only truth she has told.","post_message":"Clinton promises to put people out of work."},{"comment_id":"963507617048798","commenter_b":"Black women live in public housing for generations it is time to let them live in the streets like white people do. 5 year limits on public housing so it does not continue as a breeding center for black skanks.","commenter_a":"Why do we have so many homeless? if our country has immediate help and housing for All the refugees then this country should have housing and help for all Americans immediately. No American citizen should be homeless, take care of our own First. Homelessness breeds all kind of crimes.","post_message":"Three teenage brothers suspected of a fatal attack in a #Seattle homeless camp known as ‘the Jungle’ have been charged with first-degree murder and assault. Michelle Millman reports what we know >> kiro.tv/JungleCharges"},{"comment_id":"421728768009004","commenter_b":"Burn her as a witch","commenter_a":"So intelligent, and powerful women","post_message":"Share if you're Ready For Hillary!  Get all the best HRC coverage you need here:  @webpagelink"},{"comment_id":"10155026545836337","commenter_b":"Not the worse but close.","commenter_a":"Chuck is on point","post_message":"WOW. Charles Barkley torched the entire NBA..."},{"comment_id":"773846622745734","commenter_b":"@username Hillary is For everyone . Remember being rich does not make for a bad American. Honesty and integrity and caring about each other is what matters . Turn on ur heart lite ( just like Hillary said ) Everyone matters and together we can be a united people .","commenter_a":"Well, now I feel guilty! Before her uplifting victory speech about sticking together and lifting each other up, I was on another site smacking Bernie Brats upside the head. I'm gonna work a little harder on that \" love each other \" thing! Sorry, Bernie folk! So, gently, respectfully, and with loving patience in my heart: Go Hillary, go!","post_message":"It may seem odd to hear someone running for president say we need more love and kindness in America—but we do."}]
