[{"comment_id":"10155588637195389","commenter_b":"Amen!!! Good post...","commenter_a":"Every police officers in this country should take their badges to the white house and give it to the biggest racist in the country.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"479579702230323","commenter_b":"Yes","commenter_a":"Finally!!","post_message":"Do you think Hillary should be facing criminal charges right now? [Watch below]"},{"comment_id":"10153800001886336","commenter_b":"OK all immigrants should loose there language and culture. Derp","commenter_a":"Gop crybabys don't ask me questions the Fox news debate asked basically the same questions does Reince Priebus realize that was the only gop debate to be simulcast on a Spanish network effectively telling Spanish Americans we don't care about you","post_message":"Reince Priebus  told Fox News that aside from making sure “CNBC isn’t hosting and moderating another debate with our candidates,” the Republican Party is going to review “everything” about the debates. @webpagelink"},{"comment_id":"10155207800518132","commenter_b":"She looks like a drag queen!","commenter_a":"Sad she hates herself so much to keep mutilating her body.","post_message":"Kim Zolciak Biermann is feeling nostalgic!"},{"comment_id":"1095436653882721","commenter_b":"Shut the Hell Up!","commenter_a":"this asshole can;t handle protesters and people actually think he can handle trained killers. Yeah DISASTER BELIEVE ME DISASTER IS TRUMP","post_message":"Exactly.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1056213647735452","commenter_b":"I didn't watch it, but I don't think it was appropriate to turn a sports event into a platform for a political statement. Perhaps the NFL should start requiring artists to submit song choices & performance videos ahead of time for approval or better yet just have a military or top-ranked college marching band perform.","commenter_a":"She's disgusting and an embarrassment to the entire country. The Superbowl was not the place for a political statement and someone at the NFL should be held responsible for her selection. She degraded the event and insulted the vast majority of Americans who chose to watch. I for one did not.","post_message":"Buckle up, 'cuz Rudy's got something to say...."},{"comment_id":"10153542250533812","commenter_b":"Chriss if you lease a car. Can anybody come in that vehicle and disrespect you. Chriss you happened to get a job that you get assigned a vehicle can anybody come tell you what and how. You're a smart man. You might get a job that requires you to move out of the state or even the country. That job comes with all expenses paid for four years including the house and the car. You tell me who can come in there and disrespect you. Not even the ceo or cfo of that company can do that without proper protocol. You had to move your family. And your doing your best job. Think about that chriss. YOUR A SMART INTELLIGENT MAN","commenter_a":"Pres. Obama. It is America's house we only let you borrow it for a little bit! Respect all people as you desire to be respected. You are in my house and every legal Americans house. Not that they were right but you are wrong!","post_message":"WATCH: Pres. Obama normally lets hecklers speak, but this time, he put his foot down: 'OK, you know what? No, no, no...'"}]
