[{"comment_id":"1552138465081005","commenter_b":"How does she not get dissy","commenter_a":"Matthew Boyd","post_message":"This record-breaking teenage gymnast is showing the world her incredible tumbling talent."},{"comment_id":"10152867173405667","commenter_b":"Can't stand her","commenter_a":"Start with the thugs then will talk","post_message":"\"How is it possible that we as a nation allow guns to fall into the hands of people whose hearts are filled with hate?\" Hillary Clintonsaid."},{"comment_id":"10153672821839270","commenter_b":"Illegal aliens, syrian refugees, and every other worthless non-american can get all the free stuff at no cost. WE veterans have to pay for what we earned. There is a revolution coming. WE THE PEOPLE have had enough.","commenter_a":"Lier lier lied,,,, sign here and have free health care for life. I'm so glad I have full VA benefits.","post_message":"Some big changes."},{"comment_id":"10154517988145329","commenter_b":"Stfu!!","commenter_a":"@username I found a picture of me when I wake up in the morning.","post_message":"??? (via So Relatable)"},{"comment_id":"10156687877045725","commenter_b":"you are 100% illegal .","commenter_a":"Yeah you've hired illegal immigrants too","post_message":"I’m the only one on this stage who’s hired people. I’ve hired thousands of people! #GOPDebate"},{"comment_id":"1341519315888255","commenter_b":"Nice fireplace!","commenter_a":"#TurnOnGreenLightGreenShirt","post_message":"I'm live in my third Fireside Chat to talk about #NoDAPL and other pressing issues important to the 99%."},{"comment_id":"947484675311281","commenter_b":"This is why so many people are against Muslims. I've sat and ate meals with people from all over the world with differnt faiths and never had a cross word. It's all about give and take yet some Muslims can't grasp the idea of peace and harmony. The reason why they all want to come to England and screw our little island up is the free hand outs. VOTE UKIP and maybe we can stamp the minority out and make it harder for these people to enter our island.","commenter_a":"This not surprising. What surprising is he is not in jail for what he just said.","post_message":"Sean Hannity: 'You want her to die!?'"}]
