[{"comment_id":"893350990721431","commenter_b":"She's not getting my vote","commenter_a":"Go Hillary!!! :)","post_message":"All across the country, people are working hard and making plans for their futures. Hillary is getting started too. Be a part of her campaign from the very beginning:"},{"comment_id":"10153867280412377","commenter_b":"When illegals, dead people and multiple pollers etc, wait c and see how it goes, did the blm intimidate or black panthers block door or maybe machines were screwed up again Save your voting receipt just incase","commenter_a":"Donald Trump has 0% chance of winning the election. Gary Johnson 2016","post_message":"Pete Hoekstra to Newsmax TV: Trump reserved the right to reject. Watch coverage on @webpagelink"},{"comment_id":"10152850762031748","commenter_b":"Whose boobs is he reaching for? :)","commenter_a":"This is beyond bizarre!","post_message":"Religious Right pundit claims Satan is using gay rights to persecute Christian athletes"},{"comment_id":"1697928997118346","commenter_b":"I DON'T WISH TO RUIN MY DAY WITH THIS MISERABLE COWARD MAGGOT--CORWARD RACIST EVIL VOLDEMORT.","commenter_a":"Vote blue across the board. Vote Democratic party in the next election. Go Hillary. DUMP TRUMP THE IDIOT","post_message":"Well, it's official: Donald Trump will be the GOP presidential nominee. Simple question: Are you voting for him?  LIKE Opposing Views for all of the latest 2016 election breaking news and debates."},{"comment_id":"10153049677426051","commenter_b":"She's in her 20's?? Seriously at first glance she looks like an old woman, she needs to lay off the drugs","commenter_a":"Damn.!!!","post_message":"A customer was walking through the Walmart parking lot when she noticed something odd about a nearby green Hyundai. After taking a quick peak inside, she immediately called 911."},{"comment_id":"654122978061007","commenter_b":"I know you do","commenter_a":"Omg I want to hold one!!! @username","post_message":"PANDAMONIUM: 4-month-old giant panda cubs at The Toronto Zoo are learning to walk."},{"comment_id":"566305263572986","commenter_b":"When are they going to be persecuted?","commenter_a":"Vote! Vote Donald J Trump!","post_message":"WIKILEAKS BOMBSHELL.... The election should be OVER. The Clinton campaign admits to Obama having emails from Hillary off her personal server and that the president knew before he heard about it from the press.  SEE EMAIL"}]
