[{"comment_id":"10152797676794753","commenter_b":"Typical female.","commenter_a":"He replies.. ' sorry Hun I forgot u said light toast not dark. My bad not happen again' lol","post_message":"A solider at Fort Bragg in Fayetteville, North Carolina, tried to bring his wife a surprise breakfast in bed Friday morning, but things went terribly wrong."},{"comment_id":"1283300368381949","commenter_b":"Sonny Omelis hmm what do you think?","commenter_a":"Jaouad Jijeli","post_message":"...leaving Paris and New York in its wake!!!"},{"comment_id":"1103463889708572","commenter_b":"'@username, it's not a C-Section if the spine is snipped. That's not a C-Section, that's partial birth abortion, aka infanticide.","commenter_a":"Hillary has stated that unborn children have no rights and that they can be aborted within hours of birth. Yet, when someone kills a pregnant woman, there are TWO charges of murder. Hmmmm....","post_message":"Trump said the procedure can happen 'as late as one or two or three or four days prior to birth.' But that is not at all likely, writes NPR's Jennifer Ludden."},{"comment_id":"10153414254384203","commenter_b":"50 cent throws like a girl... Lol. Might as well back one.","commenter_a":"That's the only way he can get his name out without dissing someone...","post_message":"'Hillary was the president already once. You know what I sayin?'"},{"comment_id":"10153888604683812","commenter_b":"Bye dumbass. Take the illegals with you, of ALL nationalities","commenter_a":"I respect our president and all past Presidents. I will respect all future Presidents. ( unless Donald Trump is elected, I will move to MEXICO AND HELP BUILD THE WALL!!!!!!)","post_message":"President Obama has joined Facebook! Here's what the President wrote in his very first post: @webpagelink"},{"comment_id":"10153504352285329","commenter_b":"She's been on hormones for years-that's where the breasts come from. And you can't see anything under the suit because it was removed. Think ya need your eyes checked","commenter_a":"Guys... Where did that breast come from so suddenly?","post_message":"The olympian and reality star has made her debut in the July issue of Vanity Fair)"},{"comment_id":"561569204031372","commenter_b":"Sounds like grounds for a great law suit.","commenter_a":"I absolutly think it's wrong. Who has the right to tell someone to take of the flag when it fly's high and proud for our country. I'm proud to be an American but absolutly hate our govt.","post_message":"lorida Man Fired For Refusing To Remove His American Flag Pin  This man is a patriot, we live in AMERICA.  Do you think this is wrong?"}]
