[{"comment_id":"10156217952900725","commenter_b":"Illegals only make it harder for the ones who have done it legal. If I were a legal immagrant I would u of be pissed off about the illegals. It's not an easy process and considering the economy I'm wondering if it's worth it to them to try to come in legally. Especially with the liberals making all these empty promises.","commenter_a":"Like if you are voting trump 2016!!","post_message":"The debate last night proved that Hillary is running against the “B” team. She won’t be so lucky when it comes to me!"},{"comment_id":"10153576810758984","commenter_b":"Lot of good women out there but she's not one of them!!!","commenter_a":"Hillary is another Obama in a pantsuit. Maybe even worse! PPL didn't listen when Obama was exposed..... Will they listen now about Hillary?????","post_message":"I watched this over and over again to try and figure out what Hillary possibly could have been thinking. I'm still stumped. Like the news anchors reporting on this did, all I could do was laugh... Do you want to see Hillary suffer a resounding loss in 2016?"},{"comment_id":"1050256608364201","commenter_b":"Lol. Ridiculous! Hillary2016! !!","commenter_a":"Hillary, Hillary, Hillary. Time to throw in the towel NOW, so when you eventually convicted there is still a Democrat in the White House to pardon you. Keep on campaigning and the Grey Bar Hotel has your name all over it. As I said in my post titled, Smoking Gun: Hillary E-mail Instructs Aide to Delete Classified Markings, I don think anyone really expected Hillary to get a prison sentence, even if indicted, and then convicted, not until the most recent email anyway. Several days ago, The Daily Caller Reported: [FBI] has so much information about criminal conduct by her and her staff that there is no way that they walk away from this, Joseph diGenova, formerly the District of Columbia U.S. Attorney, told Laura Ingraham in a Tuesday radio interview. are going to make a recommendation that people be charged and then Loretta Lynch is going to have the ...","post_message":"Thank you, Ellen DeGeneres."},{"comment_id":"10154517988145329","commenter_b":"Stfu!!","commenter_a":"@username I found a picture of me when I wake up in the morning.","post_message":"??? (via So Relatable)"},{"comment_id":"10153848346775470","commenter_b":"Shes just drunk leave her alone","commenter_a":"Johnny Saenz","post_message":"Parents of students at an elementary school were outraged after they found out kindergarten teacher Klara Bowman had been fired after an accusation she was intoxicated in her classroom."},{"comment_id":"10156197802695354","commenter_b":"More proof that starlets should keep their thoughts and actions to themselves.","commenter_a":"Trash ball----please take out with the rest of the garbage...!","post_message":"The America-hating, donut-licking, liberal icon, Ariana Grande, enlightens the country she hates yet again..."},{"comment_id":"10153141257132490","commenter_b":"Seems like it's the only thing they are worried about .. LEAVE THEM BE. focus time and energy elsewhere. Geeeeesh!!!!!!","commenter_a":"For god sakes leave the uniforms alone!! They are fine as is.","post_message":"YOUR TAKE: CRACKERJACKS -- It's taken a decade to develop new service dress white and blue uniforms. Do you really need both types of crackerjacks? Send your thoughts to staff writer Mark D. Faram at mfaram@navytimes.com:"}]
