[{"comment_id":"10153535805923352","commenter_b":"You dumb wet back bitch and @username you ugly bitch go ahead. Pink monkey bitch","commenter_a":"He is though. What happened to \"freedom of speech\"? Oh it's selective I see.","post_message":"Female middle school teacher forced to resign after telling students that President Obama is a ‘Muslim baby killer’"},{"comment_id":"1522859634396359","commenter_b":"\"Liberalism is a mental disorder\"...Dr Michael Savage. That woman is not fit to be that precious little boy's mother!","commenter_a":"I cannot watch this. This monster (mother) is horrible and I cannot imagine how frightened this little child was. She deserved to be punished.","post_message":"Imagine how the media would have been all over this story if the mother had been a Trump supporter furious at his defeat. And this story still hasn't made out of Houston. It's still just a local story."},{"comment_id":"1134245933335126","commenter_b":"@username sadly I think in a Trumparchy dipsticks like Susan will become Senators. Oh wait, they already have.","commenter_a":"It looks like your allies have a far more accurate picture of Trump that the American morons who vote for him do. He has made America a great laughing stock around the world. If America is to regain any pride, you MUST DUMP HERR TRUMP.; he is a danger to the whole world. If we could all vote, about 6 Billion people would vote No to Trump..","post_message":"These drawings are PERFECT."},{"comment_id":"10153203713812894","commenter_b":"She's a damn lie! Ain't nobody stupid! That's what's wrong with her lying ass all them babies and surgeries!","commenter_a":"What did she do to her face? She looks weird","post_message":"Kim Zolciak Reveals Doctors Discovered a Hole in Her Heart While She Was Hospitalized After Her Stroke"},{"comment_id":"1088236524530691","commenter_b":"Humans are a parasite on this planet, we are unable to live in balance it's time for another extinction.","commenter_a":"It prob all happened because of climate change","post_message":"New evidence suggests there have been 6 mass-extinctions since life began."},{"comment_id":"1162973243743146","commenter_b":"@username haha why does she always look psychotic?","commenter_a":"Bristol Is Pregnant Again Because...","post_message":"Hypocrisy at its finest."},{"comment_id":"1112383468868962","commenter_b":"So she's been here illegally since 1993........of course she'd vote for a criminal.","commenter_a":"If Facebook was not a thrown for liberals, and they removed news pages for being one sided, this would be the smoking gun","post_message":"She survived the holocaust — and years later, she’s getting her citizenship so she can vote for Hillary Clinton @webpagelink"}]
