[{"comment_id":"1260728277356755","commenter_b":"Can we talk about your taxes Trump and some of your wife's well kept secrets since you are always pointing your finger at everybody else!!!","commenter_a":"Instance 302-A when Trump is actually projecting himself.","post_message":"\"She also lacks the mental and physical stamina to take on ISIS and all of the many adversaries we face.\" - Donald J. Trump questions Hillary Clinton's health"},{"comment_id":"943135932412822","commenter_b":"Shake those lady lumps","commenter_a":"Hump on a Hump!!!","post_message":"He denounces the idea of marital rape as 'made up by European people'"},{"comment_id":"10154951386859655","commenter_b":"Lmfao! Did he refuse to grab her vagina? Awww!","commenter_a":"Arrest is in her future. You don't threaten the life of the President.","post_message":"***BREAKING***"},{"comment_id":"560649254116954","commenter_b":"Lady you are just plain stupid.","commenter_a":"I want to see a Sanders-Trump debate. If you think Hillary would wipe the floor with Trump, Bernie would \"bern\" the floor with Trump! Either way, Trump is a Loser.","post_message":"Wonder what a Hillary Clinton/Donald Trump debate would look like? Take a look."},{"comment_id":"10153128305820933","commenter_b":"Kasich and Taylor can't be responsible when a trusted employee breaks rules behind their backs. Taylor has come out strong against the actions and has expressed deep disappointment that the Trust of the people was broken... as for Spencer (Tim) Balls crazy assertions. Kasich had nothing to do with the ordeal. Spencer (Tim) Ball has a vendetta against Worthington Christian Schools. Kasich's daughters attend the school. That is the only connection between the 2.","commenter_a":"Today's Columbus Dispatch (newspaper) had a good article revealing problems in the Lt. Gov.'s house.","post_message":"Gov. Kasich stopped to greet a small group in beautiful Peterborough, New Hampshire to end the week. See you again soon, New Hampshire! #nhpolitics #fitn"},{"comment_id":"10153000605642060","commenter_b":"The way all states should be.","commenter_a":"When purchasing a firearm in a Louisiana gun shop, a buyer will encounter limited procedural barriers. Louisiana is commonly referred to as a \"gun loving state.\" The only necessary requirement for purchase is a valid driver's license, which can prove the buyer meets the federal age limits: 21 for handguns and 18 for shotguns or rifles. There is no gun permit required to purchase a firearm in the state, nor is a gun license mandatory to detail ownership. Registration of long guns or handguns is also not required under Louisiana law. There are no restrictions on long guns in the state; the only areas where an individual cannot carry a loaded shotgun or rifle are on college campuses, or properties that specifically designate the barring of weapons. Areas such as schools, hospitals, municipalities, and places of worship often disallow carrying privileges. It is also permissible to transport loaded long guns ...","post_message":"Gov. Bobby Jindal believes Louisiana law is strong enough to prevent people with mental illnesses, like the Lafayette shooter, from purchasing a gun."},{"comment_id":"693471650843413","commenter_b":"Yes they should be deported!","commenter_a":"Yes it should!!!","post_message":"Unbelievable fate for this liberal that disrespected our flag. This man will never be the same. Should burning the flag be grounds for deportation?"}]
