[{"comment_id":"1007444045971350","commenter_b":"don't change anything","commenter_a":"STOP","post_message":"First The 20, Now The $5 Bill - Obama Announces More 'Diverse' Face For The Bill Stop it. Leave our money alone. Do you think they should keep honest Abe on the 5$ bill?"},{"comment_id":"1128841157202139","commenter_b":"You STUPID, STUPID WOMAN. NO we as you call us\" White Folks\"are NOT going to stop saying ALL LIVES MATTER!!!. That is in no way a RACIST comment. In fact it is a very true comment. Where does all this stupidity come from. You need to read your BIBLE & pray long & hard before you start spouting these comments.","commenter_a":"NOT THE SHARPEST KNIFE IN THE DRAWER !!!!!","post_message":""},{"comment_id":"10152955356009071","commenter_b":"I know I said LMAO, but really hit me up... could use the help. ;-)","commenter_a":"Dear anyone... please contact me if you're up for some pro bono work to sharpen your skills! Lmao!","post_message":"It's a known fact that hacking makes money. But how much money?"},{"comment_id":"10152842669910779","commenter_b":"Feminazi alert","commenter_a":"Why aren't you showing her as an athlete, instead of an object? Such utter bullshit.","post_message":"She’s “a beast.” The “most dominant athlete alive.” The “greatest athlete” UFC president Dana White has ever worked with. But what’s her life really like? And how did she go from living in her car to being MMA’s unstoppable force? Erik Hedegaard tangles with Ronda Rousey. Click through to read the full feature."},{"comment_id":"10153054078171336","commenter_b":"hey @username you guys have been saying that for 6 years. Settle down haters! And you sound like an idiot.","commenter_a":"Dig deeper because this is not enough to derail her run. She kept the records!","post_message":"“Can we trust Hillary Clinton to produce all of her email when we couldn’t trust her to obey the law that she had to use a State Department email?” – Senator Rand Paul asked on tonight's The Kelly File. @webpagelink"},{"comment_id":"10152962676067060","commenter_b":"ASSclown !","commenter_a":"Mitch, Moon the coon's little boy people are begging to have their streets fixed, once you remove the monuments your murder rate and black on black crime will disappear.You are a special kind of stupid","post_message":"WATCH: Mitch Landrieu's full Confederate monuments speech he delivered to the City Council today."},{"comment_id":"1190272557692172","commenter_b":"I noticed, I don't believe I have ever before seen this. You can tell, they are sooo far distanced from our so called leader, lol. How is he allowed to carry on???","commenter_a":"In Obamas mind 9/11 didn't happen either. This man is a nut. Kick him out before he destroys this country. If you didn't know he was crazy before now, here's proof that he is. Pure old mean and crazy. America Please wake up. You can't be this brain dead.","post_message":"Somehow, Pentagon leaders don't seem too convinced..."}]
