[{"comment_id":"1184087691636663","commenter_b":"Donald Trump doesn't smoke, drink or do drugs. One of biggest problems in USA. Golden Crescent (@webpagelink) Build that Wall....Fence Act of 2006...Ask yourself the ???? Make America Great Again! Corruption!!!! Stop Trump!!!!","commenter_a":"Well Done Donald.","post_message":"Thank you Republican National Committee."},{"comment_id":"1267539270005791","commenter_b":"'@username , is it all intelligent, competent and strong women that intimidate you, or just Hillary? Hillary 2016","commenter_a":"He can only intimidate weak people... She's the exact opposite of that! #VoteBlue","post_message":"BOOM."},{"comment_id":"981969021843756","commenter_b":"Republicans want to end abortions so that they will have more population to draw on for their future wars. Think about it: End abortions, brings on many children that the parents can't care for (likely because of finances). The child likely grows up in poverty, being told (by the same people that ended abortions) he/she is a leech on society (parents likely getting assistance), so that child will grow up and most likely do one of two things (a few will take a different path, of course). 1) begin a criminal career 2) join the military to be fodder Republicans want to abort YOUR children when they are adults....THAT is why they want to end the termination of unwanted pregnancies.","commenter_a":"Attack on women!!!!! All you saying baby killers start adopting them then...start helping poor young women survive during pregnancy and after child is born, start fighting for wic, head start, etc...how many severely disabled children have you adopted? Big mouths refuse to help real babies only care for fetus","post_message":"Every child is a gift from God.  That's why the House just passed some of the most pro-life legislation to ever come before Congress – banning abortions after 20 weeks."},{"comment_id":"10154585681040329","commenter_b":"Dan Mulligan","commenter_a":"Alan Baird","post_message":"This is how you get strong enough to crush a guy's skull. // Game of Thrones"},{"comment_id":"1741880082723097","commenter_b":"If you have any red blood running through your veins,If you LOVE THE USA BOYCOTT ALL,I MEAN ALL DISNEY PRODUCTS,PROPERTIES,MOVIES,ALL!! LET THEM SEE WHAT 'WE THE PEOPLE' ARE CAPABLE OF DOING!!!","commenter_a":"Are you kidding me? Trump Hires illegals. He was fined for doing so. Check your facts people.","post_message":"A Disney IT worker who was laid off and replaced by foreign H-1b workers along with hundreds of his colleagues broke down in tears before a Senate panel Thursday while telling his story."},{"comment_id":"10156390039050725","commenter_b":"That would be the best way to guarantee Hillary into the White House!","commenter_a":"I will!","post_message":"A new poll indicates that 68% of my supporters would vote for me if I departed the GOP & ran as an independent.   @webpagelink"},{"comment_id":"10152633154612452","commenter_b":"You do know I meant loving","commenter_a":"'@username living all the comments. Brian Williams lol","post_message":"DRAMATIC PHOTOS: Two police officers were able to save a woman trapped in a sinking BMW after smashing the vehicle's rear windshield. @webpagelink"}]
