[{"comment_id":"10154019579790530","commenter_b":"Boot him out immediately! !!","commenter_a":"Tick uh errr.....Rick Snyder has a net worth of $200 million!! I think HE needs to bust his wallet out and help flint. There's no initiative in this case, we all know the pipes need replacing. So do it!! Might as well start because it's going to be a long process.","post_message":"The board unanimously approved a petition stemming from Gov. Snyder’s authorization to move the office dealing with struggling schools..."},{"comment_id":"10152797088006051","commenter_b":"Burn em all down. And roast a pig in the process.","commenter_a":"That is deplorable. He is entrusted to safeguard civilians, he does not have the right to pick and choose based on his personal beliefs and bigotry. One cannot condemn an entire religion because of a group of extremist radicals. EVERY religion has its bad...Catholics raping little boys, Christians murdering and blowing up abortion doctors and clinics. With the hateful logic all mosques should burn, burn all churches as well, right? I so sincerely hope he is removed from his station. Hate begets hate.","post_message":"This fireman tweeted out the first thing that popped into his head when he heard that an Islamic Center was on fire."},{"comment_id":"909362045826715","commenter_b":"NO!","commenter_a":"You idiot libs! Most of us conservatives carry a gun everywhere we go. You just dont know it. And if a criminal tries to go on a killing spree, we will save your dumb a$$es too.","post_message":"Should guns be allowed in parks and playgrounds?   What do you think? Sound off below!"},{"comment_id":"10153772701693271","commenter_b":"If you look back, I didn't say \"productive\". I said \"meaningful\" and, I'm hardly \"bent out of shape\". Does this effect me personally? Not really. But, it does effect my community/state/culture...whatever you want to call it. A day to celebrate pot? It's laughable to most. You can think I'm ignorant all you want, I still think it's ridiculous. Again, my opinion. Not sure why you feel the need to argue with me.","commenter_a":"Go to work. Volunteer. Do something meaningful. Beyond ridiculous.","post_message":"Denver's 4/20 rally has been rescheduled."},{"comment_id":"10152694335031094","commenter_b":"^Calls other women whores^","commenter_a":"Anti-science lunatics...UGH!!!!!!","post_message":"The federal government has confirmed more than 100 people across 14 states have now developed measles. Will state governments respond by rescinding personal belief exemptions for parents who choose not to vaccinate their children?"},{"comment_id":"10154249002506409","commenter_b":"At the opposite end of the mall where Trump stood you are only able to see 1/2 of the mall. That 1/2 had a crowd, the rest of the mall was sparsely filled but you could only see that from an ariel view. Crowd scientists say Trump's inauguration crowd was half the size of Obama's and they are correct, especially when you compare views of both ends of the mall--anyway--who really cares about this anymore?","commenter_a":"Obama was the first African American president I would expect the crowd to be quite larger for him","post_message":""},{"comment_id":"984298984944293","commenter_b":"👏👏👏👏","commenter_a":"For those of you patiently waiting on a squirrel update: According to Jeremy \"*UPDATE * the two suspect squirrels have moved into an older squirrel nest in the garden district of the property and decorated the heck out of it. They are eating higher quality squirrel food and are in much better health than the heterosexual squirrels.\"","post_message":"When marriage equality became legal in his state, this man bravely reported from the frontlines of his backyard to see *exactly* what had changed. And it's hilarious."}]
