[{"comment_id":"10153564532183984","commenter_b":"@username All immigrants who enter LEGALLY are welcome!! We dont need or welcome ILLEGALS. There is a difference.","commenter_a":"I don't understand good, law-abiding Latinos taking a position against following our immigration law and supporting programs that shelter criminals just because they too are Latino. I would be incensed that my good name and that of my race was being damaged by those lawless usurpers.","post_message":"Donald Trump isn’t backing away from his position on illegal immigration and his disgust for sanctuary cities. These policies endanger the lives of innocent Americans, and they must be put to an end.   Obama needs to rethink his plans for amnesty before more Americans die at the hand of violent illegal immigrant criminals.   Sign the petition to block Obama’s plans for amnesty!"},{"comment_id":"10153597569599411","commenter_b":"@Zoran...again, you get a life...we are pretty happy and fine. Not like a poor illegal immigrants as Zoran trying to stay in the west....","commenter_a":"No one should feed barbarian Russian junta fascism invaders.","post_message":""},{"comment_id":"10153623447343352","commenter_b":"Girl that's what kids do they fight...they just need to teach her ass how to swing back next time.","commenter_a":"I feel bad for the little girl but kids get into fights all the time. If that was the case we'd all be rich!!! Including my mom!! But 10 million is extreme. I can see her doctor bills being paid (if any) and maybe her going to a different school but that's just a bit much.","post_message":"Family files $10 MILLION lawsuit after their 9-year-old daughter is beaten up on a school bus"},{"comment_id":"10154280185019032","commenter_b":"Why are there exceptions made to people who are in the US ILLEGALLY? No other country changes their laws to fit the demands of illegals!","commenter_a":"From a friend.... Friends, I desperately implore you to please please educate yourself on DACA, one of President Obama's Executive Orders which our President-Elect Donald Trump is threatening to revoke. DACA is intended to be a temporary solution because our gridlocked, partisan Congress refused to pass the Dream Act, for which there has been wide bipartisan support. DACA allows undocumented young people whose parents brought them to the US as children to have just a few temporary rights. If these kids meet several requirements and pay about $500 initially and when they renew (after two years), they can defer deportation and be allowed to work legally. DACA is especially important because it allows these young people to legally work and to pay taxes. In my experience, most of these young people quickly find work and use their money to pay for college tuition, to buy school supplies for their younger ...","post_message":"President Obama created DACA as an executive action in 2012. President-elect Donald Trump has said he will \"immediately terminate\" it."},{"comment_id":"10153619360488132","commenter_b":"Your not a father!!!","commenter_a":"Jennifer Ramirez","post_message":"It was a very happy Father's Day for Caitlyn Jenner."},{"comment_id":"10154592681344445","commenter_b":"Yup, they are trying to invade the US as we type. Better build that wall.","commenter_a":"Now that half the Republicans in the house have been officially brain-washed, his confirmation will take place. This country will be taken over by Islam, when it happens. Bad news for women and gays.","post_message":"\"I am confident he will serve the American people with integrity and a steadfast commitment to justice,\" the president said. @webpagelink"},{"comment_id":"1223870594319795","commenter_b":"What if he might win this time","commenter_a":"I honestly feel if Bernie and Jill teamed up they could win and the world would definitely be a better place. This needs to happen badly!","post_message":"Here's the Guardian article everyone is asking about.  Please read my clarifying statement about our offer to Bernie Sanders: @webpagelink"}]
