[{"comment_id":"10153855927834330","commenter_b":"Wow","commenter_a":"You kids are borderline retarded","post_message":"\"Dewshine\" is a mix of racing fuel and Mountain Dew. Two teens are now dead after consuming the highly toxic mixture ---> @webpagelink"},{"comment_id":"10154076651981955","commenter_b":"She needs... Wait for it... To be ARMED. That jackass would think twice about that move if she was packin a pc....cmon ladies.. Do NOT be this asshole's next victim","commenter_a":"Horrible black bastard, should be shot! 100 times!","post_message":"WARNING THIS WILL MAKE YOU FURIOUS"},{"comment_id":"10153897345459726","commenter_b":"As a man, whenever I hear Hilary's shrill angry voice my blood runs cold. Bernie should be more careful attacking Hilary, she'll wave her wand and turn him into a frog.","commenter_a":"Same old crap.!!!!!!!!!!!!!!!!","post_message":"WATCH: Clinton and Sanders called out for lies!"},{"comment_id":"1036501259720547","commenter_b":"If illegals are going to remain here what difference does it make?","commenter_a":"Trump/Cruz will have my vote.... but if Trump is not on the ballot......don't expect me to cast one","post_message":"Ted Cruz explains why he thinks \"2016 is going to be an incredible year.\""},{"comment_id":"991848417558053","commenter_b":"what woman?","commenter_a":"If this woman is willing to show such an overt act of patriotic disrespect, how will she ever effectively enforce our laws in an unbiased way? She should be removed from her position. End of story.","post_message":"VIDEO: Muslim Police Chief Shows This Act Of Complete Disrespect To America And Is Under Heavy Fire For It."},{"comment_id":"832838423431849","commenter_b":"She won't be in the White House.","commenter_a":"A-hole","post_message":"Say WHAT?!?!? In remarks today to the South Carolina Democratic Women's Council, Hillary Clinton says \"You're not going to see me turn white in the White House!\""},{"comment_id":"10153846163628984","commenter_b":"So invite some of those Muslim refugees into your home, fool....see how that works out","commenter_a":"The Koran speaks extensively about Jesus Christ. U fools who do not know. Look it up.","post_message":"She was riding the bus when two Muslim men starting attacking, as soon as one started stabbing her she let out four simple but powerful words that she credits to saving her life. This woman's story of survival is truly incredible."}]
