[{"comment_id":"950959664958199","commenter_b":"She's a skunk","commenter_a":"Jackie Kennedy is turning in her grave.","post_message":"Michelle Obama Makes Rap Video: YoYo! Only Way To Succeed Is To \"Go to college!\""},{"comment_id":"1109626375800280","commenter_b":"Yup! They are afraid of her!","commenter_a":"Hillary is a joke","post_message":"\"They are afraid of me!\" - Hillary Clinton"},{"comment_id":"10152861667311045","commenter_b":"I don't agree with abortion, but when you have an abortion the baby dies, it's suffering is over. Women who do drugs while they are pregnant can cause problems for these children their entire lives. And we foot the bill for it. They should be charged, never given their kids back and the law should stop having these double standards. And if they didn't cause their kids damage then they still did the equivalent of putting a gun to its head and playing Russian roulette, which would also be child endangerment and child abuse.","commenter_a":"Does anybody find it ironic that they can be charged for exposing their unborn babies to drugs while it is legal for them to kill/abort those same babies? Either unborn babies are people with rights or they aren't. Odd how \"the law\" can have it both ways.","post_message":"Two Shoals women are charged with exposing their children to drugs. Both women are pregnant, and are in the community corrections program. Investigators say the two failed mandatory drug tests."},{"comment_id":"1022130381169318","commenter_b":"CUMMING are stupid brats !","commenter_a":"OMG what a crock","post_message":"Come on..."},{"comment_id":"10153706992631955","commenter_b":"Let's bpmb those fagots.","commenter_a":"The machine that makes invincible passports! We must take it for the empire!","post_message":"ISIS May Have Passport Printing Machine..."},{"comment_id":"10153153729864726","commenter_b":"your mother is white your white bunch of zebras in the white house","commenter_a":"what an ass","post_message":"WATCH: Michelle Obama's mom admits she is worried about mixing races and is glad Barack Obama isn't completely white!"},{"comment_id":"10153624837111770","commenter_b":"BLM is simply trying to create so much chaos that Marshall Law will be declared and in turn that means that if its declared Obummer will stay in office that's what they want! I have no idea why they want that because he does not care about them he does not care about anyone accept his third world Muslime buddies (no that's not a misspelling they are Muslim slimes)!","commenter_a":"Great! Trapper keeps sticking his foot in his mouth.","post_message":"\"Listen, Jake, I wasn't born last night,\" Police Chief David Brown told CNN's Jake Tapper. \"You ask me a policy question that policy-makers haven't resolved, I'm going to punt and kick it back to you.\" READ MORE: @webpagelink"}]
