[{"comment_id":"10153555053111037","commenter_b":"I bet you any money she can't breathe anymore","commenter_a":"When will people learn the cops will not lose!! I don't care what color u r, she said \" I'm gonna see u in court \"! She baited him. Why would cops kill her in jail? It's another cry baby black!","post_message":"Newly released dash cam footage shows the events that led to Sandra Bland’s arrest."},{"comment_id":"1765071860379740","commenter_b":"damn elizabeth coming out swinging","commenter_a":"That was EXACTLY what happened to another person that was supposed to be deposed and speak out against the Clintons years ago, and was found three days later by the FBI after the guy missed his deposition:-(","post_message":"Do you think the Clinton's were involved in his death?"},{"comment_id":"1262038440498279","commenter_b":"I don't. Some women do.","commenter_a":"As a man, I have to ask, what is it that you women want from me? More of my money in divorce court? You want me to stop holding the door open for you? Maybe I should stop fixing your car or the plumbing in your home. In combat, maybe you should \"take the point,\" would that make you happy? Centuries have passed since Adam & Eve and the world is still asking, \"what do women want.?\"","post_message":"Huge crowds are marching worldwide for women's rights."},{"comment_id":"1140721385968332","commenter_b":"I like her filthy mouth. Filthy mouths FTW!","commenter_a":"Hardly a roll model really. She's got a filthy mouth.","post_message":"\"We have to be a role model for these little girls, because who do they have? All they have, literally, is the Kardashians!\""},{"comment_id":"10153548009250575","commenter_b":"Women need to be cooking and cleaning for a man. Free time and they just get weird.","commenter_a":"That's just fkn nasty!!!!","post_message":"The Gateway Pundit - GROSS. Leftist Artist Uses Her Menstrual Blood to Paint Angry Portrait of Donald Trump"},{"comment_id":"908896759158872","commenter_b":"Us is what I recorded","commenter_a":"@username let's go to Vegas and stop off here!","post_message":"It one of the strangest motels you will ever visit  the Clown Motel, next to a grave yard in Tonopah, Nevada.  And if you don like clowns, or are afraid of ghosts, you may want to stop somewhere else.  Story: @webpagelink"},{"comment_id":"10153325376679091","commenter_b":"Send these terrorists back to where they came from","commenter_a":"Coming from the idiot that wants to let all these refugees into our country... pfffft","post_message":"\"Once again we have seen an outrageous attempt to terrorize innocent civilians... We send our deepest condolences, offered our full support to the French people\" - President Obama."}]
