[{"comment_id":"10155481461845405","commenter_b":"And I mean prosecute the farmers not the illegal immigrants. You can't blame them for coming here and getting a job . My point is Republicans won't deal with the issue in a responsible manner.","commenter_a":"And they vote Republican and employ the largest number of illegal immigrants and get away with it. The one that do should be prosecuted for it .","post_message":"Did you know that 97% of Wisconsin farms are family-owned? Wisconsin agriculture also employs 413,500 employees and that's 12% of the workforce."},{"comment_id":"611945445596715","commenter_b":"To accept defeat to a liar, who had the questions ahead of time, who has lied over and over - HOW CAN HE ACCEPT IT? I doubt the American's will acept Hillary as president, as they rejected Obama!!!! Voter fraud is alive and well. NO voter ID? Illegals being PAID TO VOTE DEMOCRAT? HARDLY FAIR OR BALANCED.","commenter_a":"Why wasnt it asked to hillary..","post_message":"During the final Presidential debate, Trump refused to say if he would accept the results of the election. Many believe this will threaten the time-honored tradition in which the loser recognizes the legitimacy of his opponents election to office in order for a peaceful transfer of power to occur.   Should Trump accept the results of the election if he loses?"},{"comment_id":"1854247478194959","commenter_b":"Why you do this to me","commenter_a":"@username try not to cry","post_message":"Walnut the whippet was not alone on his final walk 🐶😢 #walkwithwalnut (via BBC England)"},{"comment_id":"1367333429993068","commenter_b":"^^^^ angry feminist.....who'da thunk it","commenter_a":"so much narcicism in society these days...so many women demanding to be seen as \"beautiful\"....its ridiculous. And the kicker, if youre a man, and you say they are fat and unattractive then you are a \"chauvanist\" or \"intolerant\" etc etc etc....but you know what, why do women not go crazy over fat rotund men??? where is the fat acceptance movement for those guys? I rest my case.....no ladies, that isnt attractive.","post_message":"'These are the women you've rolled your eyes at... or joked about with your friends'  (via Daily Mail Australia)"},{"comment_id":"1824334044515363","commenter_b":"She won't do anything","commenter_a":"Undocumented immigrants pay more taxes than Donald Trump plus a lot of them bring fresh vegetable and cheap food to american tables.. Hillary President !!","post_message":"Donald J. Trump on immigration during final presidential #debate: \"We have some bad hombres\" @webpagelink"},{"comment_id":"10154295602821037","commenter_b":"Claude, women who use the term \"Feminist libtard\" are sexy.","commenter_a":"Good lord! If men couldn't get a job because they hit on a woman at one time or another throughout the years, there wouldn't be any in the workplace! Women like this give us all a bad name. She must me a feminist Libtard! I'm sorry....some people will do anything to get attention and they are coming out of the woodwork! She acts like he raped her! I'm guessing she's trying to make a name for herself through Trump since she couldn't with her writing skills.","post_message":"Our reporter attended a Donald J. Trump event in 1987: \"Trump said there would be an even better afterparty and I was welcome to join him, but only if I came alone.\""},{"comment_id":"10153737877981409","commenter_b":"What a jerk!!! He thought what he did was a start for his 2020 presidential run. After tonight, he'll never be elected. He shot himself in the foot and his chances for 2020.","commenter_a":"Unfortunate choice. He committed political suicide and will take the name \"Lyin' Ted\" to his grave.","post_message":"Former Trump rival Cruz met with boos during GOP convention speech."}]
