[{"comment_id":"10153288827596523","commenter_b":"'@username her momma should have taught her manners, and respect, you might consider doing the same.","commenter_a":"That poor little girl just learned she can cause problems, then ignore her teacher and the school administrator and the police. She really learned a lesson, didn't she?","post_message":"The South Carolina deputy who slammed a disruptive student on the floor and tossed her several feet has been fired."},{"comment_id":"1277810208923879","commenter_b":"I wouldn't trust him to drain anything","commenter_a":"Ryan is a swamp rat.","post_message":"Let the draining begin!"},{"comment_id":"1589692694655762","commenter_b":"Nothing racist about, I have the same problem. Some do not understand us and takes forever","commenter_a":"How can you criticize this? Who actually likes calling those?","post_message":"'So I called up, under the guise I’m checking on my card. I say, 'Where are you from?' They say, 'We are from India.' Oh, great. That's wonderful. Thank you very much,' Donald J. Trump said, signaling as if hanging up a phone."},{"comment_id":"1091917874180626","commenter_b":"MAKE AMERICA GR8 AGAIN 2016! # AMERICA FIRST # BUILD THE WALL!","commenter_a":"Let's see a lot more arrests...these are terrorists!!","post_message":"Democrats' voter outreach to gang members is apparently working..."},{"comment_id":"1122007374532683","commenter_b":"She's in a bikini with something over it, not a big deal. Trumps wife on the other hand is butt ass naked and might be the next First Lady.","commenter_a":"Erik Björnfot","post_message":"#President #Obama's Daughter #MaliaObama twerks & shows her booty cheeks at #Lollapalooza! #WSHH"},{"comment_id":"10153467245366770","commenter_b":"'@username are you doing your homework?","commenter_a":"According to Roger Stone, 182919686769s Mens Fashion Editor and the only named 'source' in the National Enquirer smear story about Ted Cruz cheating on his wife with five women. Ted Cruz doesn't have time for that crap, he's too busy pushing back the establishment.","post_message":"'Despite the old guard and amateur pundits blaming Donald J. Trump and the majority of GOP voters who support him, much of the rift in the Republican Party has been caused by Texas Senator Ted Cruz conning nationalists into believing he is one of them.'"},{"comment_id":"10153043162846130","commenter_b":"'@username do us all a favor get a vasectomy","commenter_a":"You could skip the asking your boss to buy it for you and just buy it? Saved you a step. :)","post_message":"“Ask your doctor if birth control is right for you… then ask your boss if birth control is right for you.'"}]
