[{"comment_id":"1766246316922622","commenter_b":"@username don't be nervous I'll only use My 2nd Amendment if you were to try to come into my home & try to harm my Family. I'm a nice guy. Now you're saying that other country's are doing just fine without Guns? Lol NO NO NO!!! Do you see what the hell is going on in Europe with the Muslim invasion or did you forget to Mention that part? The Europeans are telling us NOT to ever give up our GOD Giving Right of the 2nd Amendment. There homes are being invaded there women & children are being Raped & the FUKIN Government are sitting back & watching it all OH & they now have a Muslim PM. Something doesn't smell right wouldn't you agree? Just like I said they take your guns so when they come like they're doing now in Europe you won't be able to defend yourself. ...","commenter_a":"You gun loving Americans are so funny. I will bet all I have, that if one of you ever find yourself in a situation like the one this douche bag is referring to, which 99,9 to 100 % of you never will, you and your gun won't do anything but piss your pants. Guns would not have stopped this, nor any other terrorist attack, just like guns isn't stopping anything in your country, quite the opposite in fact. You won't see european people from Copenhagen, Paris, Brussels or any other high risk cities demand a right to carry guns, because we don't want to, because we know it don't work and because we are not stupid. Trump is a freaking idiot and sadly many of you Americans are brainwashed and scared so easily. I really really hate using the over used and annoying word, sheep, but that is what you ...","post_message":"At the National Rifle Association convention, Donald J. Trump said the Paris attacks may not have happened if people had guns to take down the terrorists. @webpagelink"},{"comment_id":"788324967967350","commenter_b":"When all is over and you. Round up the clowns for arrest make sure you get this bimbo she cared nothing about any of us","commenter_a":"I agree idiocy speaks for itself.","post_message":"I can't believe this.....I knew they were stupid but stupid and dangerous?!? COME ON."},{"comment_id":"961900420609625","commenter_b":"Of course Mary doesn't care lol ignorant people usually don't listen","commenter_a":"Your was hoping he would be our first African American president. Instead we got a communist African Muslim!!!","post_message":"President Obama delivers his farewell speech in Chicago."},{"comment_id":"10153225477750736","commenter_b":"The show pits women against each other and promotes dangerous stereotypes and archaic gender roles. It isn't entertainment and this isn't news.","commenter_a":"Leann Allisgood","post_message":"ICYMI: Lauren Bushnell, the flight attendant from West Linn, got another rose during 'The Bachelor' in The Bahamas, but not until she swam with unruly pigs first:"},{"comment_id":"10155984439405354","commenter_b":"She's gross and needs to go away. Now.","commenter_a":"She's making too much money telling bad jokes.","post_message":"Schumer did not mention that the shooting during her movie took place in a theater with a total gun ban–**100 percent gun control**."},{"comment_id":"10152738606735950","commenter_b":"What an asshole!","commenter_a":"That makes me happy","post_message":"WATCH: First Lady Michelle Obama shows off her dance moves during the annual White House Easter egg roll @webpagelink"},{"comment_id":"1179936415364556","commenter_b":"No but it might save a few Americans! Instead of worrying about illegals they need to be worried about their own selves!","commenter_a":"Hows those gated estates working for you and Georgie .","post_message":"Says the British-Lebanese human rights attorney..."}]
