[{"comment_id":"10152911718959342","commenter_b":"Start lining up Muslims and illegals until they leave!","commenter_a":"Amen and Amen!!!","post_message":"FIRING SQUADS MAKING A COMEBACK? Utah -- the only state in the past 40 years to carry out a death sentence by firing squad -- is poised to bring back the Old West-style executions if the state cannot track down drugs used in lethal injections."},{"comment_id":"1715308212052135","commenter_b":"That is the good thing about voting for Trump! It is bad for Mexico and good for the USA!","commenter_a":"Bite me you greaser","post_message":"Mexico's former president claimed voting for Trump is \"treason.\""},{"comment_id":"10156349547100354","commenter_b":"Conservatives learned the lessons of MLK. I think the left needs to review what he preached. It is not the color of the skin but the content of character.","commenter_a":"These people just say what they think and then if it bites them in the rearend they come back with some ridiculous other story which nobody believes but they seem to think that we will.","post_message":"FIRESTORM: MSNBC Liberal Claims She Wasn’t Calling Dr. Ben Carson Racial Epithet...\"Safe Negro\"...Backpedals Quickly...Dr. Carson Campaign Blasts...MORE..."},{"comment_id":"10153284422191323","commenter_b":"White people are often unaware of their privilege as it is invisible a lot of the time. Happened to me when I got pulled over by a cop for cutting in front of them. I got an angry warning. If I were black, there's a better chance I would have gotten a ticket. I'm not 100% white, but eh, close enough in terms of looks to get the benefits of privilege most of the time. Except at hoity toity Connecticut country clubs.","commenter_a":"Do you understand now white folks?? Its not about you as a person but the system that programs these prejudice biases into you without you knowing consciously.... So when we speak out about institutional racism and bias...its not a direct knock against you as ppl but the fabric your ancestors created and is still maintained today.....","post_message":"Racism is a business. Its marketing is so successful that even Akala looks sideways at a young black man holding a lot of cash"},{"comment_id":"10153272276901323","commenter_b":"Yeah too right let's let everyone in one big party what could possibly go wrong","commenter_a":"Ella Wellington","post_message":"A quarter of Britons think the government should encourage immigrants and their families to leave. That's people like Mehdi Hasan. He argues that while hostility to outsiders may not be a new phenomenon, the so-called immigration debate is now toxically out of control. Anti-immigration sentiment isn't a result of increased immigration, but fear and prejudice  Meera Syal: Growing up between cultures is tough – until you realise it’s a creative blessing: @webpagelink"},{"comment_id":"10153477974742217","commenter_b":"When u search at this matter, u will find that these are european muslims.... not arab muslims or the east muslims. they misunderstood the islamic religion. I hope return to their mind.","commenter_a":"We reject and condemn terroristic attacks which happened in Brussels today. These attacks make our travel to the Union Europeans' countries a more difficulty, and will sufer the syrian refugees and arab muslims who work there from a compulsive procedures at this regard from now on. These actions obstruct anyone wants to travel so as learning and resume his study and those that travel to enjoy short trip. #Islam is a peace religion. we will find your media tell u that muslim persons commited these actions..... but these persons don't believe in any religion, yes. they are extremists. they don't belong to us. All of us feel sad for u","post_message":"Belgian PM calls for \"calmness and solidarity\" in \"black moment\" for country. #Brussels   Latest: bbc.in/21ENlj8"},{"comment_id":"530887710369602","commenter_b":"fuck that cunt","commenter_a":"@username explain this","post_message":"Thoughts?"}]
