[{"comment_id":"1656739891212938","commenter_b":"JJ Fuller Jeffrey Kalmonson Jojo Stewart","commenter_a":"Those who are caught in the left/right paradigm are often not ready for critical thought and the unforgiving truth. If you agree please comment (even 2 words) and share! (y)","post_message":"Free minds, free people.. this world needs more of them Follow: The Free Thought Project.com #B2TF"},{"comment_id":"1017996811629034","commenter_b":"Wat a dumb bitch","commenter_a":"PUT YOUR GUNS DOWN????? What the fuck she's stupid","post_message":"This Black cop is furious about other cops not owning up to police brutality."},{"comment_id":"10155273231713132","commenter_b":"She has medicine that causes it, you hateful witch!","commenter_a":"Umm not a role model for my child, sorry. Good dancing though, kid seems happy","post_message":"You go girl!"},{"comment_id":"618929588274862","commenter_b":"No one is now or ever has been against immigrants. It is ILLEGAL immigrants who are the issue.","commenter_a":"Republicans so easily forget that we are a nation of immigrants.","post_message":"WOW. Presidents Reagan and Bush Sr. sound an awful lot like Democrats in this 1980 debate... Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153206037935399","commenter_b":"Even if the fight is with a women","commenter_a":"Just like all of the allegations about his false claims about the Falklands and being at the suicide of the JFK witness etc..........","post_message":"O'Reilly isn't one to go down without a fight."},{"comment_id":"10154934744787403","commenter_b":"@username sorry to disappoint but I'm all for Trump kicking all you Mexicans out of the country 😂😂😂😂😂","commenter_a":"Hypocrite","post_message":"BREAKING NEWS: President Donald Trump plans to suspend visas to seven Muslim-majority countries, draft order shows."},{"comment_id":"10155398572138797","commenter_b":"The man never said it doesnt happen in the white community. But its not \"white history month\" he was pertaining to this month and what the race can do to honor their dedicated month. He did not say anything about tje white people not killing. Oh wait thought blacks killing blacks is justified right? The constant drive bys and convictions is oj because of your race? How about we say how about all the ghetto gang bangers and the wanna bes stop killing to honor this month whether black or white a thug is a freaking thug. Whites killing whites needs to stop also but we do not have a month dedicated to our history whether it be polish irish English. We will take gary and Chicago and all the mindless killing what race is it primarily? Oh wait its ok or white people's fault.","commenter_a":"I have an idea maybe for Black History Month. The young black kids can stop killing each other. But of course that won't happen.","post_message":"BLACK HISTORY MONTH: Today, and all month long, join us in celebrating the achievements, culture and contributions from black Americans across U.S. history."}]
