[{"comment_id":"596524653885918","commenter_b":"Hell no she's a racist and a bigot . Her husband did our country more harm than good. No way would I ever vote her into office.","commenter_a":"no way in Hell","post_message":"Would you vote for Michelle Obama if she ran for president one day?"},{"comment_id":"428518377308118","commenter_b":"Please don't breed.","commenter_a":"But what if I just want to pee in the girls bathroom? You mean my behavior and emotions don't drive the judicial system? #keepyourdick","post_message":"In 19 countries in Europe, transgender people are forced to undergo surgery and sterilization in order to legally change their gender."},{"comment_id":"10156422552765354","commenter_b":"Mexcans, niggard and white hoes need a good kick in the ass.","commenter_a":"Unbelievable! ! Round their butts up and get them out!!","post_message":"The group chanted “Let them in, Abbott let them in” and “Governor Abbott shame on you.”"},{"comment_id":"1773311049564873","commenter_b":"Jerk","commenter_a":"Mitt Romney should be quiet. I worked very hard for him, was sick when he lost to Obama mostly because he would not fight back. He broke a lot of hearts the way he ran and loss. He has absolutely no RIGHT to open his mouth now. I am angry at him.","post_message":"Mitt Romney wants Donald Trump as FAR from the White House as possible... but nobody thought he would go this far to accomplish it. Is Mitt Romney irrelevant?"},{"comment_id":"10156240306950551","commenter_b":"God, this women is a beast.","commenter_a":"Then bitch move to Africa.","post_message":"This woman is RACIST!"},{"comment_id":"711583065610489","commenter_b":"He hates America and the American people, why cant people see that...","commenter_a":"He is a Traitor and Muslim.","post_message":""},{"comment_id":"10153575076007411","commenter_b":"He was probably lured in by a crazy lady offering him pizza","commenter_a":"Susie Gollehon","post_message":"UPDATE: The boy has been found safe Police in Glen Ellyn are searching for a missing 12-year-old boy who was last seen riding his bike Monday. Story: @webpagelink"}]
