[{"comment_id":"10153906444119705","commenter_b":"All these people on here saying Apple is supporting terrorism have no clue. If the software is created to unlock this phone, it can be used to unlock any phone. They all use the same data encryption software. This would put all of Apple's customers (hundreds of millions of us around the world) in danger of our privacy being breached by thieves or overreaching governments. Apple has complied with every aspect of this investigation otherwise, including providing data stored on its servers as required by warrant. But the software needed to break into the rest of the data on this phone doesn't and shouldn't exist.","commenter_a":"The order specifically refers to *this* phone, specifically allows Apple the option of doing it on *their* premises, and specifically allows *Apple* to retain control of the method used. What? They can't keep that process secure themselves?","post_message":"Apple vs. the FBI explained, how this case might affect your iPhone."},{"comment_id":"10153984129784497","commenter_b":"Area woman would have crashed car regardless of spider's presence.","commenter_a":"Area woman crashes car trying to get away from spider","post_message":"Report: Spider"},{"comment_id":"787010171427640","commenter_b":"so much for tolerance","commenter_a":"I'd of accepted her resignation effective right then!","post_message":"Citing \"separation of church and state,\" the councilwoman resigned.  What she did almost immediately afterwards is raising eyebrows."},{"comment_id":"1132943900117478","commenter_b":"Knock that bitch down when he gets in your face. Trump 16","commenter_a":"What a bunch of disgusting, vile, ignorant, hypocritical, liberal scumbags!! Totally revolting behavior typical of the left with absolutely NONE of the \"tolerance\" they preach for anyone who disagrees with them!! Sickening!!","post_message":"Liberals try to portray themselves as the voice of \"tolerance.\" You'll realize just how \"tolerant\" they really are when you see this video, where they made a SICK move at a meeting that supported Donald J. Trump.  This is the REAL face of the left, folks... America needs to see this."},{"comment_id":"904920249698551","commenter_b":"Fuck this bitch in do care who sings at this bitch shit he's not my president fuckem","commenter_a":"No","post_message":"What they just confirmed about the Trump's inauguration... This is just what we've been waiting for. Are you excited for Trump's inauguration?"},{"comment_id":"10153358341224726","commenter_b":"She need to get out of there","commenter_a":"the mayor of Baltimore is what you have a news conference but she cant handle a news reporter how did she get the job ,WE ALL KNOW ????????????dumb. .","post_message":"WATCH: Baltimore Mayor Snaps At Fox News Reporter for Asking Questions"},{"comment_id":"10153722267976509","commenter_b":"The Duggars are not Christians. They are members of a sex cult","commenter_a":"Your son molested four of your children and you tried to keep it secret? Disgusting! I'm going to pray for you when I take my birth control.","post_message":"Four of the five girls #JoshDuggar molested were his sisters, their parents said in an interview with Fox News anchor Megyn Kelly. @webpagelink via CNNMoney"}]
