[{"comment_id":"10154256296041130","commenter_b":"is she for Citizens United? how about the ACA? How about Roe v. Wade, what's her position there? Now compare Republican's position on these...","commenter_a":"Only further proving that Hilary is a Republican, but delusional liberals will still vote for her","post_message":"'This is not a traditional race, and these are not traditional times.'"},{"comment_id":"10153477334723984","commenter_b":"She doesn't care , she just wants the money,","commenter_a":"Go die you ugly whore what a fucken disgrace","post_message":"Pop star Miley Cyrus just said something highly disturbing about Christians. It's especially sad when you consider where she came from..."},{"comment_id":"1735932806679169","commenter_b":"Considering those men put their lives on the line to save ours let them fly the American Flag ,","commenter_a":"This is stupid son of a bitch","post_message":"A Rhode Island city official just called local firefighters “terrorists” and compared them to ISIS for putting THIS on their firetruck.  You just can't make this stuff up..."},{"comment_id":"10153546137853352","commenter_b":"Black cop should shoot to kill her ass","commenter_a":"And today in white folks news","post_message":"Tulsa Woman Caught At Funeral Home Cutting Up Face, Hair, and Messing Up Makeup of Corpse Who Once Dated Her Boyfriend"},{"comment_id":"10154148373635736","commenter_b":"His daughter/wife would hate that.","commenter_a":"When they said 'small hard object' I just assumed the president had gotten excited.","post_message":"Police received a report Friday that President Trump's motorcade 'had been struck by what was believed to be a small hard object.' He was passing through Palm Beach on his way to his Mar-a-Lago resort nearby, where he spent part of the weekend."},{"comment_id":"10154105863319087","commenter_b":"Anyone who has an education voted for Bernie, because they know that Hillary is a liar and a right-leaning moderate. #BernieOrBust","commenter_a":"Clinton also leads with people who have educations. Gee, go figure","post_message":"Donald Trump may be rich, but the rich actually prefer Hillary Clinton."},{"comment_id":"10153536976196336","commenter_b":"Talk to Moon beam aka governor Brown of California. It is in San Francisco that an illegal alien killed a beautiful person. He encourages sanctuary cities for illegal immigrants and lets them get drivers licenses and so with liberals it's take from the people who work and pay taxes and let them pay for all the illegals. I don't want to give my hard earned money to whatever the state chooses to spend it on but liberals will continue until they are ousted. And that goes for Republicans as well. No one in either party deserves to hold office if 'our' welfare doesn't come first. And I don't mean welfare as in free stuff.","commenter_a":"what...how can any illegal alien hold a government position? Oh yeah...California the land of goofballs.","post_message":"'This is worse than sanctuary cities. Now we're giving them sanctuary boards.' – Neil Cavuto"}]
