[{"comment_id":"608933979286362","commenter_b":"Gennifer Flowers: Bill Clinton Told Me 'Hillary Had Eaten More Pu**y Than He Had'","commenter_a":"i like hillary clinton","post_message":"If we unite together, we will rise together."},{"comment_id":"10154249002506409","commenter_b":"At the opposite end of the mall where Trump stood you are only able to see 1/2 of the mall. That 1/2 had a crowd, the rest of the mall was sparsely filled but you could only see that from an ariel view. Crowd scientists say Trump's inauguration crowd was half the size of Obama's and they are correct, especially when you compare views of both ends of the mall--anyway--who really cares about this anymore?","commenter_a":"Obama was the first African American president I would expect the crowd to be quite larger for him","post_message":""},{"comment_id":"10153367144158352","commenter_b":"Wow she's a fool!!","commenter_a":"WTF IS WRONG WITH ALL THESE CRAZY ASS PEOPLE IN FLORIDA!!! All these stories lately have been about people in FL just like the mom who made her child jump out 2nd story, there's been a shit load of crazies hitting the headlines recently","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"},{"comment_id":"10153497527962464","commenter_b":"@username Add me..","commenter_a":"from Egypt we Love you. And we will redeem you, Mr. President.","post_message":"Headed into the #GOPDebate. Join us at 9pm ET on Fox News and tedcruz.org/debate"},{"comment_id":"10154416469089342","commenter_b":"@username deal with it, pussy.","commenter_a":"Rip","post_message":"BREAKING: Former Cuban leader Fidel Castro has died at age 90"},{"comment_id":"10153218033713188","commenter_b":"That Mormons even call themselves Christians is a relatively new phenomenon. It dates back to at best sometime in the late 70s/early 80s. I remember a girl in my youth group had brought one of her Mormon friends one summer's eve, and I got into a conversation with her and I'll remember what she said til the day I die- \"I'm not a Christian, I'm a Mormon!\" That would have been 74 or 75. Also, the concept that \"As God was, so man is; as God is so man may become\" is utterly missing from the other thee Abrahamic faiths.","commenter_a":"Um, no. The miracle IS the resurrection. The result is the atonement.","post_message":"A little bit of what I spoke about at church Sunday."},{"comment_id":"614399705409669","commenter_b":"@username NO ONE IS AS CORRUPT AS SLICK WILLY & SLICK HILLY!","commenter_a":"If Trump has done anything he has brought attention to the corruption in government!! Old man Bush cannot stand that Baby Jeb was soiling his diaper on the debate stage....it's all about $$$$ & the fact that the Clintons charged $250,000 for their fundraiser the other night should make hard working taxpayers sick!","post_message":"Kathleen Kennedy Townsend says former Republican President George H.W. Bush told her he's voting for Hillary Clinton."}]
