[{"comment_id":"10153179541492014","commenter_b":"Who cares? She's giving a great Christmas! Good for her!!!!! People need to butt out and mind their own business!!!","commenter_a":"What's the problem? It's her money she works for her family.","post_message":"Sound Off: Is this a great Christmas or way too much?"},{"comment_id":"10153326464497235","commenter_b":"She is definitely a jerk. And that's putting it nicely. lol","commenter_a":"all they needed to do was let her call someone to prevent his suicide. a tragedy when regulations trump basic moral values.","post_message":"She says a Southwest Airlines flight attendant slapped the phone out of her hands ..."},{"comment_id":"1228480800579306","commenter_b":"also don't worry about the food, mods gave another interesting fact Eagles do not waste food they will eat it!","commenter_a":"Watching from Buckley Michigan","post_message":"SNUGGLE TIME: Fuzzy eaglet is snuggling as lunchtime approaches! VIDEO: Southwest Florida Eagle Cam"},{"comment_id":"10156334612930354","commenter_b":"P.S. \"Illegals\" cannot vote.","commenter_a":"Good for Hungary for putting up the fence. It is their country and they have every right to protect it from any invaders. It's too bad our Golfer-in-Chief and the rest of the liberals don't feel the same concern for our country. They don't want to stop illegals because of the votes they can bring. 'Bleeding Hearts\" are a really sick bunch of people.","post_message":"This can't be right... Obama--who lives in a home surrounded by a fence--says border fences don't work. How can this be?!"},{"comment_id":"10153358816899099","commenter_b":"Hide the women and children.","commenter_a":"Countdown until someone is groped/raped or a fight,","post_message":"These streets will be closed Sunday for the Puerto Rican Day parade @webpagelink"},{"comment_id":"985973531519425","commenter_b":"All republicans should stand behind \"the people's \" choice!!!","commenter_a":"Who needs him I hope he gets fired","post_message":"What do you think? Is it too late? @webpagelink"},{"comment_id":"544254699096156","commenter_b":"Eat pig shit Muslim","commenter_a":"If we are so disgusting take your slappy ass back to the Middle East. Live in squalor and let your \"men\" rape, beat, torture and starve your dumbasses!!","post_message":"Obama wants us to believe that Muslim Refugees can easily integrate in our Christian Western society, well watch this VIDEO..."}]
