[{"comment_id":"10153576489935667","commenter_b":"Their aliens","commenter_a":"I wonder what it looks like now","post_message":"Experts have yet to identify their breed but guess they could have a bit of wild cat in their DNA."},{"comment_id":"10154858254049497","commenter_b":"Hopefully, I last a little longer than 24 hours. 🤔","commenter_a":"@username :) Honestly, I admire this about you. You explore things and excel at them. But it's just kinda funny.","post_message":" crazy. He throwing himself into cooking and collecting vinyl when he only had his microbrewing kit 24 hours."},{"comment_id":"10154324674924916","commenter_b":"@username, She's actually the lesser of two evils.","commenter_a":"When you cast your vote for an out right bull shitter, who hasn't one damn idea of how he's going to run the country, except to say, \"it'll be better\", your one dumb son of a bitch, and your dragging the country into the gutter.","post_message":""},{"comment_id":"1258430004197187","commenter_b":"It will never happen. Hillary will win and that will be the end of America kiss your freedom goodbye and welcome Hillary Clintons new and improved America you fools!!!!!","commenter_a":"The regular polls are rigged. This is what's actually real. We need to find a way to get polls of our own. @webpagelink","post_message":"Despite getting barely any attention from traditional media, our numbers have been surging on social media.   See what the buzz is about at tonight's #GreenTownHall!"},{"comment_id":"10153554399159087","commenter_b":"Naw a wall sounds great how's how is he going to pay for it? Oh it's free lol fool","commenter_a":"Trump offering free stuff, free deportations, and a free wall. damn national socialist","post_message":"If Donald J. Trump is victorious in several March 15 winner-take-all contests, including Ohio and Florida in which he is currently leading, it would take an “extraordinary effort to defeat him,” Karl Rove said."},{"comment_id":"10158490372020354","commenter_b":"Hope they make an example out of her","commenter_a":"Jail her.","post_message":"My, my, my..."},{"comment_id":"882254358503349","commenter_b":"My child would be instantly removed!","commenter_a":"Yes it would and yet silence from the sooo offended group.","post_message":"ISLAMIZATION: LA Public School: Teaching Kids  Is The One True God (VIDEO)  @webpagelink"}]
