[{"comment_id":"882454405123315","commenter_b":"Divide and conquer Michelle. This is proof that you and your husband have sent this country back to a time of racial unrest and inequality like never before. I pray our country will soon be able to start healing and undue the damage you two have caused. In 18 more months, we'll be free of this kind of leadership","commenter_a":"She just proved racism towards the whites with every word spoken","post_message":"Michelle Obama is an embarrassment to America. We're ashamed to have her in the White House! WATCH what she just said..."},{"comment_id":"1115555701831927","commenter_b":"Get and keep satan out of the White House!! SAVE AMERICA TRUMP 2016 ALL THE WAY!!!!!!!!!!!","commenter_a":"Done","post_message":"LAUGHABLE: Clinton Press Secretary Gives Conditions Under Which She Will Give A Press Conference Let's just plan on this not happening...EVER!"},{"comment_id":"10154120855527908","commenter_b":"So California can just take water from somewhere else? I thought they already did that... And destroyed the water source. Humans can adapt and migrate with little effort. To dry? Move.","commenter_a":"How about we build a water pipeline instead? Ample areas of the country have excess while others are in drought. The worst that happens if it leaks a little is some flowers or trees grow :)","post_message":""},{"comment_id":"10153302910759087","commenter_b":"But the sheep love the Queen of BS and her Lies, Hillary the evil millionaire theft by deception. and lair","commenter_a":"Carly doesn't back down from a fight. I would NEVER go on that show after that BS. She's a better woman than I!","post_message":"“My message to the ladies of ‘The View’ is, ‘man-up,’” Carly Fiorina said. “The Obama administration, for example, has been bad for women. Planned Parenthood is harvesting body parts. If you don’t like those facts and those messages, than man up and debate me on them. Don’t sink to talking about my face.”"},{"comment_id":"1101281803258742","commenter_b":"Bite me bitch. Ever heard of auto correct.","commenter_a":"This came from the Advocate (our local paper) and I am sharing it because it is exactly how most of us feel about Trump. The Media just doesn't get it....they can't believe that people are so angry that they can no longer be manipulated! Millions of trump supporters feel this way about Donald J. Trump..... \"We don't care if the guy swears... or how many times he's been married...or who he voted for, or what his income tax return shows. We want the problems fixed. Yes he's an egomaniac, but we don't care. We know he's not a racist, or bad to women, or all the other things the liberal media is trying to label him with. We know he's raised a good family, and that says a lot about him. The country is a mess because politicians suck, the Republican Party is two faced & gutless, and illegals are ...","post_message":"Even this focus group by Fox News's Frank Luntz agrees Hillary CRUSHED Trump. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153911405746509","commenter_b":"Lesbians rock","commenter_a":"its possible that he may have some mental issues :P but seems like a practicing Jewish...!!","post_message":"A 16-year-old girl, who was one of the people stabbed during a gay pride parade last week in Jerusalem, has died, police said. @webpagelink"},{"comment_id":"1836032849948227","commenter_b":"I'd say you'll go in for one yourself @username!! Dressed as a lady","commenter_a":"@username I don't feel well","post_message":"😍😍😍"}]
