[{"comment_id":"1370428343050216","commenter_b":"Keep this animal in jail","commenter_a":"These two idiots actually represent the sick mentality of the republican party. They are both sick and depraved. What I really find interesting is how much american men admire that behavior and vote for them. They seem to have a lot in common with these two.","post_message":"SPREAD HIS SHAME."},{"comment_id":"455232604658620","commenter_b":"Hillary Clinton!!!","commenter_a":"Bernie Sanders!!!","post_message":"Listening is always better."},{"comment_id":"10153529159371770","commenter_b":"That's another reason he is known as lying Ted!","commenter_a":"what do you have to say now cruz? ha ha","post_message":"'Donald J. Trump is not getting to 1,237. No one is getting to 1,237.' #ThrowbackThursday"},{"comment_id":"981969021843756","commenter_b":"Republicans want to end abortions so that they will have more population to draw on for their future wars. Think about it: End abortions, brings on many children that the parents can't care for (likely because of finances). The child likely grows up in poverty, being told (by the same people that ended abortions) he/she is a leech on society (parents likely getting assistance), so that child will grow up and most likely do one of two things (a few will take a different path, of course). 1) begin a criminal career 2) join the military to be fodder Republicans want to abort YOUR children when they are adults....THAT is why they want to end the termination of unwanted pregnancies.","commenter_a":"Attack on women!!!!! All you saying baby killers start adopting them then...start helping poor young women survive during pregnancy and after child is born, start fighting for wic, head start, etc...how many severely disabled children have you adopted? Big mouths refuse to help real babies only care for fetus","post_message":"Every child is a gift from God.  That's why the House just passed some of the most pro-life legislation to ever come before Congress – banning abortions after 20 weeks."},{"comment_id":"10152859683207434","commenter_b":"@username is a pathetic cesspool. Pandering feminist Cosmo garbage","commenter_a":"Lenny Kravitz’s dick fell out on stage. Look at it dangling. Kravitz was performing at a show in Stockholm on Monday when his (perhaps cock-ringed) penis came tumbling out. Just as the rocker was getting low to the flo’, the D broke out from its restrictive leather pant cage and gave the world a show.Note how the tongue and the penis simultaneously present themselves during this tragic wardrobe malfunction. Is it a beautiful thing? Who knew.","post_message":"Note how the tongue and the penis simultaneously present themselves during this tragic wardrobe malfunction."},{"comment_id":"10153629881103188","commenter_b":"So why aren't the women and children coming instead of all the able bodied young men who destroy things when they get to Europe?","commenter_a":"Wolves in sheep clothing!! Wake up Europe and do not be so naive!! Do not grant any of these people permanent citizenship. Send all able bodied back to Syria to fight for their country!!","post_message":"Millions of fleeing refugees are crashing into Europe like a tsunami."},{"comment_id":"600606456772491","commenter_b":"Takeaways from the Texas GOP Debate *Donald Trump looked like an absolute buffoon in a nice suit. It was also clear that he has talked out of both sides of his mouth so much, that he cannot even remember what he has said in the past. We heard all the same old talking points and we heard more insults and name calling designed to shame his opponents; and Trump even classless attacked the moderators for asking reasonable questions. The Trump diehards will rush to the Internet to vote for him as the winner. People who were actually listening to him, will change their vote if they thought about supporting him, or be happy with their decision to vote for someone else. * Ted Cruz was once again the most substantive and clear debater. He was unfairly treated by Wolf Blitzer by Blitzer inability to control Trumps interruptions. Ted Cruz was ...","commenter_a":"Good job tonight I wish we could of heard more","post_message":"Real compassion is providing people a ladder of opportunity to climb up from a state of dependency. #GOPDebate   Visit bencarson.com/issues to learn more."}]
