[{"comment_id":"10153813009729497","commenter_b":"Birth order matters: by the third kid he or she can tell through the uterine lining how lame life is going to get","commenter_a":"Most of us are now. Thanks to big business. Bought politicians","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"587553231404572","commenter_b":"Obama is putting up a higher fence around the white house this summer because people keep climbing it!!!! what about our borders?? WE NEED A WALL!!! WE NEED DONALD TRUMP NOW...","commenter_a":"You don't need a political decoder ring to understand Donald Trump he's a straight talker who speaks from the heart who's the only true outsider funding his own campaign and he's set the agenda on everything that matters. Indiana show your support and get out and vote Donald Trump for the republican nominee. If your standing with Trump your standing FOR America! TRUMP NATION 2016! # never lyin ted!","post_message":"I will not let you down. Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153911212003984","commenter_b":"Go Candance!!! Who is the woman on the right with the white duck on her head???","commenter_a":"I support Candace 100% God bless you","post_message":"I have to give major credit to Candace Cameron Bure. It can't be easy to be surrounded by the liberals of 'The View' and stick to your guns like this. She sure got them riled up, and I could watch it over and over again!  Do you agree with Candace Cameron Bure?"},{"comment_id":"1057273917621602","commenter_b":"No lol","commenter_a":"One world order ?","post_message":"You can't possibly understand America's greatness if you look at this country as nothing more than a series of grievances that need to be addressed.  You can't see greatness at the same time you see that."},{"comment_id":"1174610022559026","commenter_b":"Build a wall , deport all illegal but no one will believe you","commenter_a":"Send them and their anchor babies home where they belong ,, Trump in 2016 ,,, I'll help with the roundup for free ,,,","post_message":"'@JebBush faces Trump-led headwinds in attempt to change the GOP's tone on immigration."},{"comment_id":"10153798584711350","commenter_b":"You need attention like that idiot cutting herself.","commenter_a":"She's trying to commit suicide by cutting her upper arm. She's an idiot. A bridge or high building is what she needs to do. Cutting her arm is just a cry for attention.","post_message":"a teenager is hard, school sucks, parents are lame but life has so much to give you.'"},{"comment_id":"10153743132780950","commenter_b":"Fuck you Bitch!!!","commenter_a":"The entire staff cheats on that team !!! Even Bellicheck...fuck the entire Patriots organization!!!!","post_message":"New England Patriots quarterback announces latest move in wake of court rejecting appeal."}]
