[{"comment_id":"10154717381688128","commenter_b":"Liar, liar pants on fire! Immigration takes jobs from Americans and suppresses wages! Illegals have destroyed this country !","commenter_a":"Well Da, this country is made of immigrants","post_message":"A comprehensive study from the National Academies of Sciences, Engineering and Medicine shows that immigrants coming into the U.S. have helped the economy in the long haul and had little lasting impact on the employment levels of native-born Americans. The conclusion runs counter to a popular narrative suggesting that immigrants take the jobs of U.S. citizens."},{"comment_id":"10153912824075579","commenter_b":"This women reminds me of what I leave behind in the toilet!!!!! And It really stinks! FLUSH!","commenter_a":"Whatever her stylist is doing, keep doing it. Love that green leather jacket!","post_message":" had a pretty long day yesterday. Hillary Clinton addresses the DNC Women Leadership Forum.  Watch complete video from the event here: @webpagelink"},{"comment_id":"1195945367091729","commenter_b":"Totally unacceptable. They should be arrested. Deport. Send them back to their country. Can u imagine what they would do if we destroyed their Quaran?","commenter_a":"Kick them out of our country now they do not need to be here","post_message":""},{"comment_id":"1128296473875405","commenter_b":"Hillary is a Crooked lying Killer, Put Her in Jail & Make America Safe Again!!!","commenter_a":"Quanell X, leader of the New Black Panther Party in Houston, Texas, said this week on a local news program that black Americans should examine Donald Trump outreach to the black community and the relationship that black voters have with the Democratic Party. @webpagelink","post_message":"What you need to know about the \"alt-right,\" and Donald J. Trump connections to white supremacy and hate groups: hrc.io/2c3kLXT"},{"comment_id":"1160460537342680","commenter_b":"@username God is with us; not the one @username's people created, but the One who created the rest of us.","commenter_a":"You could make this same argument against every single other country in the world as there is no country that didn't have slavery and there is no race on earth that was not enslaved at some point, I was never a slave nor did my ancestors own any slaves so my question is why in the hell would I owe any reparations? Please explain?","post_message":"U.N. experts believe that the U.S. owes a significant amount of reparations to African-Americans.   With ongoing police shootings, unsolved legacy of slavery and so much more do you believe the U.S. will pay reparations? DETAILS ——> @webpagelink"},{"comment_id":"847297252033195","commenter_b":"Girls run the world!","commenter_a":"No on F'in cares except the racist thugs like OFAILURE & OSHARPTON & BSNBC !","post_message":"Who run the world?"},{"comment_id":"10154633221506162","commenter_b":"Chelsea so this was my bike ride","commenter_a":"Lexi","post_message":"Cool clouds rolling over the Chicago area!"}]
