[{"comment_id":"1238750836185439","commenter_b":"Maybe we \"Military Mothers\" should go protest the \" Temper Tantrum Party Protester's\" for BURNING OUR AMERICAN FLAG that is on our son's and daughter's uniforms. Wonder if that would take away their little spot light and five seconds of fame?","commenter_a":"After watching the new \" Temper Tantrum Party \" BURN OUR AMERICIAN FLAG last night, I'm voting straight up Republican Party Ticket for every Election... big, or small... for the REST of my life.","post_message":"\"We are living in an amazingly destructive, politically correct environment here in America. Just because something offends you, doesn't mean you have the right to hurt or destroy.\" Bill O'Reilly had some strong words for left-wing \"agitators\" who refuse to accept Donald J. Trump's victory in a fair and honest election. @webpagelink"},{"comment_id":"10153407342318352","commenter_b":"I meant, Beast-like BITCH.","commenter_a":"Nothing these beasts say even shocks me anymore.","post_message":"'I just don't like the black kids': Middle school vice principal is suspended after being filmed making outrageous comment on camera"},{"comment_id":"10153060785906519","commenter_b":"Hillary covered up for him all those years in AR because she knew he was going to be president. The wives of predators who cover up for them are almost as guilty as the offender. She only cares about one thing...power.","commenter_a":"Y'all still talking about Clinton and consensual sex. Oh I get it Hillary's running, so y'all need to bring that up again. Never mind that it isn't relevant! Or are we blaming Hillary for a spouse that strays?","post_message":"\"The actual facts of the matter are that Bill Clinton was a serial abuser of working-class women–he had exploited that power differential even in Arkansas...\""},{"comment_id":"10153330773746336","commenter_b":"Killing America ....... Job by job......","commenter_a":"Good it should not be right to work, should be the best man for the job.","post_message":"“This proposed action by Obama’s Big Labor NLRB is a direct assault on a worker’s fundamental First Amendment right to freedom of association.\" – Greg Mourad, National Right to Work Committee"},{"comment_id":"10153031341999705","commenter_b":"Sunset Avenue Dove Dove","commenter_a":"I need this in Florida!!!","post_message":"Ok, Starbucks."},{"comment_id":"992230870799703","commenter_b":"Naw...she's right and yet...people keep fuckin around with white people. Get smart. Leave the crazy bastards alone. Duh.","commenter_a":"Jason, maybe whites should stop shooting up their own movie theaters and schools. And show me evidence of blacks attacking police officers. I suggest you worry and take out your own trash before you start with racist bullshit. Serial killers, rapist and mass murders Mostly white.","post_message":"Rebel Wilson's usually so funny so this awful joke about police and black lives came as a huge shock. #VMAs #BlackLivesMatter"},{"comment_id":"10152873946396045","commenter_b":"she is an idiot","commenter_a":"I think most people who don't like her are sore about her portrayals of Sarah Palin.","post_message":"Tina Fey literally gave David Letterman the dress off her back -- right there on the spot, leaving her stripped down to her Spanx, which had a special goodbye message written on them. #lastdressever"}]
