[{"comment_id":"911829685530326","commenter_b":"She is a pig!!","commenter_a":"Sickening!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"10155223291794218","commenter_b":"Hillary didn't get elected. You're a victim of liberal ideology and the dumbing down of society.","commenter_a":"Section 212(f) of the immigration and nationality act of 1952 states: whenever the president finds that the entry of any aliens or of any class of aliens into the united states would be detrimental to the interests of the united states, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or non immigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate. Any questions?","post_message":"The Department of Homeland Security says it will comply with federal orders not to deport detained travelers"},{"comment_id":"1264994986901695","commenter_b":"I am for the national guard to start rounding up these illegal wetbacks.","commenter_a":"Yes!","post_message":"America's Freedom Fighters"},{"comment_id":"10155174752479916","commenter_b":"now suck it!","commenter_a":"Fuck that cop, fuck all cops","post_message":"Protests are ongoing in Anaheim today after an off-duty cop discharged his firearm in a crowd of young teens."},{"comment_id":"10153790439861680","commenter_b":"This woman should shut up since she and her husband were just as corrupt as the current one!","commenter_a":"Mexico is a cesspool. There's nothing we need from them but they rely on everything from the USA. We've bailed them out so many times and the American Government is making taxpayers flip the bill for Mexico's $50 billion bailout. Build the wall, tax their imports and tax the $35 billion the illegals are sending through wire transfers a year. Punish companies leaving the USA and moving operations to Mexico and over seas!","post_message":"'Mexicans have dignity and repudiate his hate speech,' she writes."},{"comment_id":"10153242618583132","commenter_b":"First Dr. Nancy Snyderman and now Brian Williams betrayed us!","commenter_a":"Yea a permanent one lol","post_message":"Brian Williams tells staffers that he is taking a break from NBC Nightly News amid his recent scandal."},{"comment_id":"10153502951211336","commenter_b":"Anyone who votes for her does not have a brain!","commenter_a":"She will be the next president","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
