[{"comment_id":"10154537125069024","commenter_b":"Bunch of boobs.","commenter_a":" Congratulations America!!Finally...a leader!!!! @webpagelink","post_message":""},{"comment_id":"10153081703864024","commenter_b":"AMEN!!! Don't let these racist win, because all the cops are going to do is profile and stop people that are poor or of color","commenter_a":"Mayor wrong direction","post_message":"The mayor made clear he's not planning a return to stop & frisk policing, saying “Going back to an unconstitutional, alienating approach is not only inappropriate and unfair to the populace, it doesn’t work.\""},{"comment_id":"1231862310212247","commenter_b":"We better get building that wall","commenter_a":"This will be interesting. Will President Trump undo what Obama did to lift sanctions and travel restrictions to Cuba?","post_message":"Live Look: Celebrations in Miami over the death of Fidel Castro, and images from Cuba."},{"comment_id":"481924841998096","commenter_b":"No Islam. This is The USA, not the Middle-East.","commenter_a":"Yes i support him completely get that islam shit out of our schools and our country","post_message":"A veteran was banned from his daughter's school... for speaking out against Islam? This is absurd. We support this veteran 100%. Do you support his stand against Islam?"},{"comment_id":"1128329537202466","commenter_b":"That says it all! Those flag burners and dissenters can leave.","commenter_a":"I'm a proud veteran too.","post_message":"I'm A PROUD AMERICAN!!"},{"comment_id":"10154185935155779","commenter_b":"Minus the \"away\"","commenter_a":"Easy. U2. 9/11-victims' names scrolling through 'Where the Streets Have No Name'....that was not a performance, it was an event...every type of emotion, right on stage.","post_message":"There is no gig in music like the Super Bowl halftime show. You have 12 minutes to justify your legend. And with the Big Game set for this Sunday, what better time to rank the halftime shows from worst to best."},{"comment_id":"10153391212533984","commenter_b":"Dumb ass!!!","commenter_a":"Another actor who thinks his opinion matters to anyone with an IQ over that of a houseplant....sooooo sorry George, but you really should stick to acting.","post_message":"This might lose George a few fans. What's worse than announcing he'll give this candidate 'whatever they want,' was the claim he made about a scandal that surrounds this particular 2016 hopeful..."}]
