[{"comment_id":"10154991489419726","commenter_b":"Oh please! Maybe she'll move to Syria and we'll never hear from her again!","commenter_a":"loser.","post_message":"Her Instagram has us thinking she might..."},{"comment_id":"1253188708034490","commenter_b":"Made me laugh!! Stupid B!TCH she is!!","commenter_a":"lets have fun with duct tape and her, and then post a pic to shame her going \"this is what happens when your an abusive POS pet owner who has no morals or respect for what we call mans best friend\"","post_message":"A woman first shared the disturbing photo Friday morning on Facebook, with the caption, \"This is what happens when you dont shut up!!!\""},{"comment_id":"10153526308641509","commenter_b":"Christians are freaked out because there will be more muslims in the world than Christians soon enough...ha, ha...paranoid! Be very afraid republicans and pee farty hatriots oh and BUY GOLD will ya? lol.....","commenter_a":"Relax people, we got those Iranians right where we want them...","post_message":"President Barack Obama says if a nuclear deal is fully implemented, it will prevent Iran from obtaining a nuclear bomb: @webpagelink"},{"comment_id":"983273481708073","commenter_b":"She's just a lying skank!","commenter_a":"You need to be investigated from the beginning to the end","post_message":"You know Hillary is in trouble when her fellow Democrats stop protecting her!"},{"comment_id":"10153637396193854","commenter_b":"He is a idiot and a monkey like that wife of his both ugly as sin he want be there much longer they have signed impeachment papers","commenter_a":"GO TO HELL","post_message":"Under Obama, U.S. Army Orders Soldiers To Scrape Bible Verses Off Their Rifle Scopes…"},{"comment_id":"10152538895247014","commenter_b":"Suck his dick already","commenter_a":"I bet his pay didn't get any cuts","post_message":"In his state budget proposal, Gov. Doug Ducey announced some big cuts to the state's universities. Now, the Board of Regents responds."},{"comment_id":"1437463806270353","commenter_b":"Can Hillary come to Texas?","commenter_a":"We don't care much for you here in Houston either, Trump. Just wanted to let you know that before you get down here and make ya self at home","post_message":"Heading to Houston, Texas now -- just informed that two police officers in Fort Worth have been shot. Please join me in keeping them in your thoughts and prayers this evening."}]
