[{"comment_id":"10154951386859655","commenter_b":"Lmfao! Did he refuse to grab her vagina? Awww!","commenter_a":"Arrest is in her future. You don't threaten the life of the President.","post_message":"***BREAKING***"},{"comment_id":"1697473917208999","commenter_b":"Joel, We have to pull together!! Please help us get Donald Trump to the White House! We started a small group and we are looking to build it up and educate people Pleaseee pop in from time to time?!? @webpagelink/ Please help us unite!!","commenter_a":"Go Trump! Make America Safe and Great Again!","post_message":"WOW! Great poll. Fox News just released their new GOP national poll - THANK YOU AMERICA! Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10154506752502619","commenter_b":"Call Sarah please let me leave you with this I am Hebrew my tribe is Nazarene but I am not Jewish a lot of people and I know that you're not one of them get that mixed up quite a bit for it is possible to be Hebrew and not to be Jewish","commenter_a":"There were no unions until the 19th century when a bunch of Jewish garment workers in NYC publicly protested and marched through the streets for safe,decent places to work and a living wage. How dare this bunch of ignorant,uneducated pigs discuss human rights. They couldn't find Israel on a map if their lives depended on it. Their hatred is based on jealousy of the achievements of Israel and the will to survive in a world where hatred of Jews is very fashionable.","post_message":"Citing the Jewish state's \"long history of violating the human rights of the Palestinians,\" the United Electrical, Radio and Machine Workers of America have reportedly become the first nationwide union to join the boycott against Israel."},{"comment_id":"585702171625401","commenter_b":"REAL MEN FOLLOW THROUGH WITH PROMISES MADE REGARDLESS OF WHO OBJECTS!!!","commenter_a":"Well fuck you too!","post_message":"Do you side with Garth Brooks? or DONALD TRUMP? Comment your answer below!"},{"comment_id":"1368444483166524","commenter_b":"Best line of the day....Hillary: \"RELEASE YOUR TAX RETURNS.\" TRUMP: \"I EMAILED THEM TO YOU.\" HAHAHAHAHA","commenter_a":"One reason I support Trump is not because he knows everything, but because I agree with his position on most things. I like his energy and desire to solve problems, and he seems to be willing to change when something isn't working..unlike most politicians who refuse to admit when they're wrong. However, (and this is an example) when Hillary says he doesn't believe in climate change, he needs to back up his position with facts on why. Sure she can say scientists believe in it..well not all of them do. Trump needs to bring up scientists that don't support that theory. Also I would like to see him release his taxes, so she can't bring it up anymore.","post_message":"'CNBC, Time magazine online polls say Donald Trump won the first presidential debate' via The Washington Times."},{"comment_id":"905819366142682","commenter_b":"@username if u want to have sex, pay for your birth control. If u don't want to take the chance on getting pregnant, keep your legs together. We should not have to pay for your wants or needs.","commenter_a":"Blunt doesn't think women should have access to birth control and then blocks them from getting an abortion for an unwanted and unplanned for pregnancy.","post_message":"Every day, families in Missouri and nationwide provide loving and safe homes to children in need through adoption. I’m proud to serve as the co-chair of the bipartisan Congressional Coalition on Adoption, and I’ll continue my efforts to help children in need."},{"comment_id":"1166206863447175","commenter_b":"Agree","commenter_a":"when did she say that? when her mother was running against him for the nomination?...can't think she said it recently...","post_message":"Americas Freedom Fighters"}]
