[{"comment_id":"1720013778051378","commenter_b":"No they don't.they are illegally living here ,they all need to be deported back to the desert.","commenter_a":"Nope! Not wanted.","post_message":"Incredible..."},{"comment_id":"1271408779539022","commenter_b":"You girls are hilarious 😘😘","commenter_a":"Marijoe!!!!","post_message":"The whole thing is very ~Mermaid goth.~"},{"comment_id":"10154081202079205","commenter_b":"We now need the DNC to forever get rid of super-delegates. This should be an immediate mission, so this never happens again. Contact the DNC and demand we end the Super-Delegates! #DNC #NoMoreSuperDelegates #ListenToVoters #VotesMatter @webpagelink Mailing address: Democratic National Committee 430 South Capitol St. SE Washington, DC 20003 Main phone number: 202-863-8000","commenter_a":"Yes it was a circus , that's too bad , 15 rounds Trump TKO not a knockout","post_message":"What did the polling look like heading into the CNN New York Democratic Debate, did the polls impact #BernieSanders or #HillaryClinton performance in the debate?"},{"comment_id":"1213471005342343","commenter_b":"Amnesty International can't even help the refugees that are dying in the Mediterranean today, all they can do is pick on Israel which is a democratic country and an easy target.","commenter_a":"Shame on you Amnesty International!","post_message":"This is ABSURD! How could they get away with this??"},{"comment_id":"10153153203728525","commenter_b":"The girls that go there will be fine.","commenter_a":"If you think this is funny just know that you're wrong and a terrible human being. This is the reason that young girls are raped and abused, because \"boys will be boys\". Or they were 'asking for it'. We've become a society where men can get away with sexualizing everything but its okay but they're boys and it's in their nature. But good to know that half of you people (that are most likely all parents) are okay with your daughters being looked at as nothing but a piece of meat.","post_message":"Imagine rolling up to drop your daughter off at college for the first time and seeing this: @webpagelink"},{"comment_id":"1734577893461739","commenter_b":"clinton continues to LIE- wikileaks has proved that-she should be in jail.","commenter_a":"His comeback sounded like something a 3 year old would say","post_message":"Hillary Clinton: \"Well that's because [Putin would] rather have a puppet as president of the United States.\" Donald J. Trump: \"No puppet, no puppet. You're the puppet.\" @webpagelink"},{"comment_id":"10153294741338984","commenter_b":"California idiots are the cause of the decline of morals! Create a safe haven for idiots called Cali weirdness!","commenter_a":"Everyone knows that Parker","post_message":"DEVASTATING! In his own words, Obama proves time and again he's a calculating liar. Will you join millions of other Americans in demanding Obama be impeached?"}]
