[{"comment_id":"10153316443579170","commenter_b":"God, she is a worthless person!","commenter_a":"Sicker than sick.","post_message":"All you Bible believers better change the way you think! The queen-in-waiting has spoken!"},{"comment_id":"1442770955748411","commenter_b":"Well he's better than that BITCH","commenter_a":"That's an insult to pigs!","post_message":""},{"comment_id":"10153994656339714","commenter_b":"I'm sure God told her. ;-)","commenter_a":"And how would Carly know how the Clinton's feel about each other. PLUS -- what good for the country was Carly's statement suppose to serve??? It sure didn't make me want to vote for her. We don't need more petty.","post_message":"Carly Fiorina had it out for Hillary Clinton at last night's #GOPDebate."},{"comment_id":"10153276508787144","commenter_b":"I certainly hope you don't have daughters with that repulsive, misogynistic mouth.","commenter_a":"Grace under fire?? I just love how you baby murdering dirtbag sluts try to make yourselves out to be the victims instead of the human beings you kill. Why don't you show the exchange how it really happened? @webpagelink","post_message":"Yep."},{"comment_id":"1021715281216809","commenter_b":"Definitely Dan!","commenter_a":"We are witnessing the greatest attack on our American Democracy since Citizens United! The DNC has chosen Hillary Clinton to be their next presidential nominee, and is doing whatever it takes to silence the voice of the people. We cease to be a Democracy when the Party receives millions in funding from the same media corporations that report biased coverage in an attempt to deceive voters. We cease to be a Democracy when the Party takes deliberate actions to suppress voter turnout, turns away registered voters, and commits election fraud in Arizona and across the country. We cease to be a Democracy when the Party selects super delegates (many of which are Lobbyists) who refuse to the listen to voice of the people the are intended to represent. We cease to be a Democracy when the Party simply removes a candidate from the ballot in Washington DC! A vote for ...","post_message":"Every success by Bernie is met with a story or column or talking head whose message is “but he can’t possibly win.” That's the media refrain because the Democratic establishment can't conceive of the possibility Bernie will win. That's because they aren't listening to Bernie's message and its resonance among Democratic and independent voters (as well as many Republicans). They don't know how determined Americans are to reverse the increasing concentration of wealth and political power that are eroding our economy and democracy. - Robert Reich"},{"comment_id":"10154154942464205","commenter_b":"WOW. What a time to be alive. <3","commenter_a":"Beautiful ceremony of acknowledgment, forgiveness and healing. Respect 🙏💜","post_message":"\"Many of us, me particularly, are from the units that have hurt you over the many years. We came. We fought you. We took your land. We signed treaties that we broke. We stole minerals from your sacred hills. We blasted the faced of our presidents onto your sacred mountain. When we took still more land and then we took your children and then we tried to make your language and we tried to eliminate your language that God gave you, and the Creator gave you. We didn’t respect you, we polluted your Earth, we’ve hurt you in so many ways but we’ve come to say that we are sorry. We are at your service and we beg for your forgiveness.\" - Wes Clark Jr. @webpagelink"},{"comment_id":"1758718481082543","commenter_b":"Illegal aliens should not be allowed to have drivers licenses. They should not be allowed to vote, should not get Social Security which they did not work for, should not get food stamps, welfare or any other type of financial assistance. If one of us went to their country, would be get financial assistance? No way! So why should they expect it here in the US, when we have seniors, veterans, children, homeless in need!","commenter_a":"More than WRONG !!!!!","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"}]
