[{"comment_id":"1338210979551629","commenter_b":"Lady your way too old to be a cheerleader!!!!","commenter_a":"This woman is not well","post_message":"HOLY SMOKES! NANCY PELOSI: Orders People to Clap, Repeats Words Then Calls John Kasich The Gov. of Illinois [Video] This is embarrassing! She scolds the audience!"},{"comment_id":"10153743132780950","commenter_b":"Fuck you Bitch!!!","commenter_a":"The entire staff cheats on that team !!! Even Bellicheck...fuck the entire Patriots organization!!!!","post_message":"New England Patriots quarterback announces latest move in wake of court rejecting appeal."},{"comment_id":"1044884802218658","commenter_b":"exactly...if they don't want to procreate, they get it from somewhere else...LOL","commenter_a":"Now wait a minute! I thought they only had sex to procreate!","post_message":"Finally! A \"Christian\" guide to dealing with the \"sexual immorality\" of a wife refusing to give her husband sex-on-demand without a \"legitimate\" physical or mental health reason!"},{"comment_id":"1243497535729399","commenter_b":"Who is this angry old lady?","commenter_a":"500,000 Women march on Washington to protest Trump becoming 45th President march today for the moral core of this nation, against which our new president is waging a war, actress America Ferrera told the Washington crowd. ..... for the moral core of this nation - most curious statement ! Both Presidents Jack Kennedy and Bill Clinton were known womanizers - both had long history of doing so Kennedy had his lovers escorted into the White House late at night while Clinton had a young woman intern give him oral sex right in the Oval office ONLY difference was that Kennedy and Clinton were Democrats while Trump is a Republican At the core of the protest is that Trump won the 2016 election in KEY states and the Democrats could not get their vote out in the KEY states Moore, Garry R - Solutions Inc","post_message":"\"Well, good did not win this election. But good will win in the end,\" Madonna delivered a fiery R-rated, anti-Donald J. Trump speech during the #WomensMarch @webpagelink"},{"comment_id":"560649254116954","commenter_b":"Lady you are just plain stupid.","commenter_a":"I want to see a Sanders-Trump debate. If you think Hillary would wipe the floor with Trump, Bernie would \"bern\" the floor with Trump! Either way, Trump is a Loser.","post_message":"Wonder what a Hillary Clinton/Donald Trump debate would look like? Take a look."},{"comment_id":"1777986365799226","commenter_b":"She is above the law,she doesn't, cheat or steal!","commenter_a":"As a woman I don't want the first female president representing me as someone who is a corrupted, lying, manipulator and fraud who thinks she is above the law. #Hillaryforprison.","post_message":"Hillary Clinton holds campaign rally in Cedar Rapids, Iowa after FBI announces they are reviewing email investigation. abcn.ws/2fnHba3"},{"comment_id":"10153225867682061","commenter_b":"How can you cut taxes, increase military spending And balance the budget and the only thing going is Obama Care?","commenter_a":"CHILDREN DON'T CHOOSE TO HAVE POOR OR INCOMPETENT PARENTS. FATE GRABS CHILDREN BY THE THROAT AND SAYS, is your life. Poor Child and the Politicians Beneath the greedy iron fist of the Politicians, a ragged, hungry, poor child dwelled Poor Child family tried to climb over poverty restraining wall, but their fragile world collapsed during a cold-blooded eviction from their shoddy shelter Poor Child moved onto a filthy, freezing street, their destitution once again a widespread and noisy public dispute Poor Child body and hope were quickly fading away, tho for their soul, many fellow sufferers continued to wail Politicians and their cronies only cared that reduced assistance and lowered wages for the poor would increase their already huge fortunes Poor Child only wanted, one last chance to be warm, to be dry, to eat. @username","post_message":"WATCH: The #GOPDebate in a minute. More on the debate from last night: abcn.ws/1NJnjrU"}]
