[{"comment_id":"930468930346189","commenter_b":"It's an interesting idea but she is much older. Re pose these with young girls and I guess there would be little difference.","commenter_a":"Stop making stupid people famous","post_message":"Fashion ads recreated by a normal woman"},{"comment_id":"1010236605683478","commenter_b":"What a joke. Most of those assclowns couldnt get laid without a prostitute. Legalize it so the ladies can get paid. Quit hating on people.","commenter_a":"put more people out of work!","post_message":"Eric Holder had to send an unbelievably embarrassing memo to his DOJ staff that shouldn't even be necessary, telling them not to hire prostitutes."},{"comment_id":"537465956461211","commenter_b":"You are a total BS'er bitch ...","commenter_a":"Total billshit. I am part owner of a restaurant and we don't have this problem. We have health care for all employees and it didn't hurt our bottom line. The owner is just greedy and doesn't care about the employees.","post_message":" don have that kind of money. So instead of 50 or 60 people without health care, we have 50 or 60 people that aren employed anymore. It makes no sense."},{"comment_id":"1209844019025849","commenter_b":"But she will claim , its someone elses fault and she knows nothing !","commenter_a":"Better watch himself or he will have an accident like all the others!!","post_message":"WATCH: Romanian hacker \"Guccifer\" tells Fox News he easily breached then-Secretary of State Hillary Clinton's email server. @webpagelink"},{"comment_id":"10154813371927787","commenter_b":"Hate to tell you, but Nordstrom is an American company..","commenter_a":"President Trump daughter will make it even more with us American women behind her.. I will not be buying from these companies any longer....I buy American and I Support American...","post_message":"Press Secretary Sean Spicer weighs in on Nordstrom dropping Ivanka Trump's fashion line. is a direct attack on [President Donald J. Trump's] policies and [Ivanka's] name. @webpagelink"},{"comment_id":"10152784678501130","commenter_b":"I read a quote from a woman somewhere who said \"When I had kids, I saved up my sick and vacation days.\" She thought this was a major accomplishment. So she took time away from her family and herself (vacation days) and exposed her colleagues when sick. How smart is that. Bootstrap childbearing.","commenter_a":"About time, but still not enough. Germany vives a year.","post_message":"\"[W]e can't say we stand for family values when so many women in this country have to jeopardize their financial security just to take a few weeks off of work after giving birth.\""},{"comment_id":"10153478960668984","commenter_b":"Shows what kinda person she is, she throws her own Dad under the Bus,, Classy, dirt bag.","commenter_a":"They say the acorn doesn't fall from the tree","post_message":"Mosby has made it widely known that she comes from a long line of police officers, but this admission reveals a very different look into her background..."}]
