[{"comment_id":"10154400168208525","commenter_b":"Good grief, you ladies are in a panic. There is the morning-after pill for that kind of thing.","commenter_a":"Believe it or not, you don't have to get pregnant. It's a personal choice","post_message":"#BREAKING: President Donald Trump has signed an executive order withdrawing the U.S. from the Trans-Pacific Partnership deal, and has also placed a hiring freeze on some federal workers and cut off funding for international groups that perform abortions. MORE: @webpagelink"},{"comment_id":"1676227239104065","commenter_b":"What a pig","commenter_a":"Suck it buttercup had your crap 8 years give us 4","post_message":"How classless can you get?"},{"comment_id":"1085472271464242","commenter_b":"If they are on there with consent, are actually single, or are polyamorous, this breech will not hurt any relationship. But this site advertises directly to cheaters.","commenter_a":"How many users on am are there with full consent of their partners? How many are actually single? How many are polyamorous? These things you don't know, and here you are cheering on this invasion of privacy for all am users, because you don't align morally with a subset of users. This kind of punishment never goes away, and that is especially a problem for those who don't deserve it.","post_message":"Will this hack be the one to get people to care about digital privacy?"},{"comment_id":"487132828135264","commenter_b":"What? the lying lame are going to teach other people to be perverts? Really","commenter_a":"OMG!","post_message":"Goooooood Moooooorrning!!"},{"comment_id":"1542852682414651","commenter_b":"Nukes don't care about fetuses.","commenter_a":"Two Minutes to Midnightttt! The tiny hands that threaten doom!","post_message":"It was nice knowing you all."},{"comment_id":"10153476889474087","commenter_b":"How about that Nikki Haley... Traitor bitch","commenter_a":"Yesssss we need a lider no a politician like Cruz","post_message":"Donald J. Trump surged 5 points since last month to open a massive 22-point lead over his Republican rivals in North Carolina."},{"comment_id":"1231549493587943","commenter_b":"Hang her in the public square!","commenter_a":"We need term limits.","post_message":"Liberalism is a MENTAL disorder. Look what the Liberal tinkerpots are seeking to tear down now. BTW, nice glasses Babs!"}]
