[{"comment_id":"10155178808719411","commenter_b":"she so fine would have her sit on my tongue on the day lee","commenter_a":"Ok, so protests are Ok but protesting against the former protest is \"not Okay\".. Double standards imo.","post_message":""},{"comment_id":"1139906406032404","commenter_b":"you are an idiot!! AND STOP KILLING ANIMALS!! They have souls too you creep!!","commenter_a":"Ok. So release the previous 5 years. That will provide an accurate picture of what to expect when the audited returns are ready for release.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"1121407184608726","commenter_b":"Of course it was her idea. The wicked evil witch knows she doesn't have a chance to win, even if she tries to rig, won't happen. God is in control.","commenter_a":"Why doe she not release all the crap, the Gov, has been asking for for years.? WHAT IS SHE HIDING.","post_message":"\"In the end, it was the candidate, Hillary Clinton...who wanted ducks on the ground, so, by God, we will get ducks on the ground,\" Robert Creamer says on the tape."},{"comment_id":"10154672636522994","commenter_b":"Not me Jonathon. I hate anything pumpkin","commenter_a":"Generalizing entire groups of people works both ways. Don't assume all black men are criminals, don't assume all cops are bad, don't assume all white girls like pumpkin spice, all black women are angry, all white men are drunks or that all Asians can't drive. Just be nice to other people.","post_message":"What started as a daughter's effort to plan a retirement party for her police officer father turned into so much more."},{"comment_id":"10156463625885354","commenter_b":"She needs to go blow Bill, be the best use of her mouth in YEARS!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Kiss my butt u dumb idiot if someone had a gun some of those people might not be dead","post_message":"Hillary Clinton is a Fact-Free Zone."},{"comment_id":"670286056475622","commenter_b":"@username Andrew Givney","commenter_a":"Jordan Monroe","post_message":"'Tis the season to turn up."},{"comment_id":"1785965414966824","commenter_b":"Ancient celts had hair like dreads as well. This is her putting a modern spin as an absolute.","commenter_a":"My life my world my rules. You dont tell me what to do","post_message":"It's everyone else's fault!"}]
