[{"comment_id":"10152785745546130","commenter_b":"Also this will happen @webpagelink","commenter_a":"This will end the first girl who gets into a HS foot ball team and the guys decide they're not going to pull their hits for her and hit her like a man twice her size. Look women can be tough. BUT the toughest women are weaker than the toughest men. it's called gender dimorphism. Most mammals have it. That isn't to say that somewhere a woman isn't going to show up that can play running back, but with thinner, softer bones she's also more likely to get killed or seriously hurt.","post_message":"She's not going out without a fight."},{"comment_id":"10154796309533010","commenter_b":"She always plays the race card","commenter_a":"If Donald wins When he goes to court for trump university fraud and is convicted. Its a criminal act. And impeachment process can began","post_message":"Like Al Gore, Clinton may be on track to still earn more votes across the country."},{"comment_id":"1096148677171405","commenter_b":"Trump should avoided all those snakes in the swamps.. They are traitors like Judas..","commenter_a":"No. No. Not at all!","post_message":"Question of the Day: Should President-elect Donald J. Trump trust people like President Obama, Al Gore, Rahm Emanuel and Mitt Romney?"},{"comment_id":"1357029221003198","commenter_b":"Some more cry babies who need their blankie and bottle and their safety pin get over it!!!! God BLESS AMERICA AND GOD BLESS PRESIDENT TRUMP!!!!","commenter_a":"Like the cops dont have better things to do! Should arrest the little bitch \"barista\"!","post_message":"The anti-Trump movement enters Starbucks.  @webpagelink"},{"comment_id":"782996508468592","commenter_b":"@username You know nothing fool.","commenter_a":"U.S. Attorney General Loretta Lynch is an idiot. Her and the Obama Gang are clearly violating the US Constitution and disregarding the rights and safety concerns of women and children. She should be hauled into congress for questioning.","post_message":"Just in: U.S. Attorney General Loretta Lynch announces that the Justice Department is suing North Carolina over bathroom law. \"This action is about a great deal more than bathrooms.\" @webpagelink"},{"comment_id":"1364883926864562","commenter_b":"Go tell her that bitch","commenter_a":"You are nothing but a disgusting pos Michelle after the sex scandals you have had, you are a freakin hypocrite lady, at least Trump's children were brought up right and with class unlike your daughter, you just need to shut the Fk up.","post_message":"Michelle Obama says Trump is guilty of \"bragging about sexually assaulting women, and this has 'shaken' her. What do you think about her comments?"},{"comment_id":"1055104137833836","commenter_b":"Let 'em try! They'll fail miserably!","commenter_a":"Because they welcomed the terrorists with open arms. And because the French people allowed their government to disarm them. They were sitting ducks. Thank God for the Second Amendment. If they could, the gun grabbers would disarm us.","post_message":"Why Paris? Why now?"}]
