[{"comment_id":"793702420758020","commenter_b":"Safer boarders and no more refugees!!!!!!!!!!! WAKE UP AMERICA!!!","commenter_a":"Fox news! Enough said!","post_message":"Two Middle East refugees have been arrested on terror charges in California and Texas. fxn.ws/1Rnioji"},{"comment_id":"725790477519561","commenter_b":"Ernest, I agree with 100%. If they were doing their job we shouldn't have so many illegals in this country.","commenter_a":"With all the illegals coming in. I thought they were already shut down!","post_message":"Would you be worried if Homeland Security shutdown?"},{"comment_id":"10153398427016336","commenter_b":"And Never - Ever - try to make a woman choose between you or her horse! She will most certainly ride off into the sunset w/ o you!","commenter_a":"Ladies, Never make a man choose between you and his kids or his dog! You will lose every time if he is a real man!","post_message":"Faced with the \"it's me or the dog\" decision, a Virginia man chose his beagle."},{"comment_id":"10153311243783690","commenter_b":"Muslims and Crishtians in Kenya have lived among eachother peacefully. How come we never fight religion for thousands of years and these scam bugs are dividing us and using religion because of their own business. Kenya troops has nothing to do being in Somalia. This terror group kill it's own people. If u disagree with them they will kill you even if u are a Muslim . As amuslim somali man, when I was in Kenya I used to play football with Kenyans and respected eachother. They neve harmed me and I never thought harming them because when we know the value of humanlifes. Kenya government should build county police and protect all university, malls, and give good salary to the police and security intelegence. Iam sorry to say this your police are corrupted. Give your police a good salary so they will protect ur citizens and the country. Ethiopian ...","commenter_a":"Just wondering why only Moslem students were freed!","post_message":"\"I am so worried, I had a son who was among the students trapped inside the college, and since yesterday I have heard nothing,\" said Habel Mutinda, an elderly man, his face streaming with tears. \"I tried to identify his body among those killed... I have to do that before the body goes bad in the heat.. I have been camping overnight, it is really hard, it hurts.\" @webpagelink"},{"comment_id":"1421316697902078","commenter_b":"Then go away Monica!","commenter_a":"I think both ladies look great. Love the pink dress and wish I had the shape to wear the red one.","post_message":"LIVE VIDEO: Watch as various entertainers perform at the Inaugural Ball before the arrival of President Donald Trump. @webpagelink"},{"comment_id":"10153027990406130","commenter_b":"I'd add not to be shy about calling your OB for more pain meds, especially after multiple c-sections. They're not surprised, it's actually common. I wish I would have called sooner than suffer unnecessarily.","commenter_a":"I've had 6 c-sections.. 3 of which were After a long labor. While laughing and/or coughing is painful for the 1st day, that's about the worst of it, I never took pain meds after... The first one I might call 'rough'- but the other 5 were not bad at all. #5 was 6 weeks early and I had to pump milk and walk to the nursery (she needed the heat light) every 2 hours to feed her, it really wasn't that bad.","post_message":"Congratulations! Your ab muscles are completely non-existent now. The good news: Your arms are gonna get buff."},{"comment_id":"1075271249191177","commenter_b":"Surprise bitch","commenter_a":"Isso te lembra algo? Matheus 😂😂😂","post_message":"\"I see you.\" ~Will More combat footage at > Afghanistan Combat Footage - Funker530"}]
