[{"comment_id":"758642314270568","commenter_b":"@username @username DAMMM SHUT DOWN","commenter_a":"Hilary is no Obama, she is WEAK. She is a sell out in moments notice. She has no platform. The democratic platform was handed to her by Bill.","post_message":"Bernie Sanders to Hillary Clinton: \"Excuse me, I'm talking.\""},{"comment_id":"10153396408061130","commenter_b":"Why are these men so obsessed with a uterus? I mean I've never obsessed over a prostate...what is going on?","commenter_a":"The same thing happened to Joe McCarthy. Everyone was all for outing Communists, then they watched him bully people at hearings on the TV and realized what a witch hunt it was.","post_message":"\"This hearing is why everyone hates Washington, D.C.\""},{"comment_id":"10153965474855579","commenter_b":"Oppose...no refugees, period.","commenter_a":"TAKE A LONG PAUSE.","post_message":"Syrian Refugee Program: Your Message to Congress? Support, Oppose or Take a Pause?"},{"comment_id":"952953064797748","commenter_b":"She needs to be deported to Alaska. Just like her mother, she does not know what the are talking about!","commenter_a":"Bristol Palin should keep both her ignorant mouth and her legs closed.","post_message":"Apparently, a kind gesture towards a scared teenager is grounds for a political attack these days."},{"comment_id":"10153368825000329","commenter_b":"Christine, go read the bible or something.","commenter_a":"Congratulations... you all look like lesbians.","post_message":"The students coordinated wearing flannel shirts and wrote \"anti-gay\" on their hands, after the school's Gay-Straight Alliance held a \"Day of Silence.\" (via BuzzFeed News)"},{"comment_id":"10154012731783352","commenter_b":"You know there has to be issues with her if the white men think you are crazy!","commenter_a":"I hate when you left a man they started to talking shit Dave Justice go sit your ass down some place and stop talking smh","post_message":"Halle Berry’s ex Dave Justice tells why he’s finally speaking out about the A-list actress, who tried to ruin his life and did the same thing to ‘Eric, Gabriel and Olivier’"},{"comment_id":"10153302418660329","commenter_b":"lol","commenter_a":"I swear the only good thing from this post are all the pictures i'm stealing from the comments for future use.","post_message":"So you ~maybe~ shouldn’t do this while your wife is pregnant."}]
