[{"comment_id":"10154592077846756","commenter_b":"Good grief. I could pee a puddle deeper than her.","commenter_a":"She will never be first lady.","post_message":"As she readies to address the Republican National Convention Monday night, it's not so clear exactly what kind of first lady Melania Trump would be. But she's left some clues."},{"comment_id":"597418893776211","commenter_b":"@username Jill stein is a communist and belongs in jail for vandalizing construction vehicles at standing rock and she's crazy","commenter_a":"Bernie needs to take a young politician under his wing and mentor them so one or two elections down the road the only politician in america with a moral bone in their body isn't pushing 90.","post_message":"Mr. Trump, you told working people you were on their side. You know what? Millions of us are going to demand you keep your promise."},{"comment_id":"10154608248221350","commenter_b":"Wonder how many people asked when he was born...\"does he have hair\"?","commenter_a":"Baby cute","post_message":"WATCH: Look at this little guy mane! @webpagelink"},{"comment_id":"10155251280330294","commenter_b":"The only thing \"frightening\" about this video is how butt ugly that lady is that get out of the car! Ha...","commenter_a":"There's 2 sides to every story...no other side could justify illicit behavior like that but what happened before the video started?","post_message":"\"Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off-road first time.\"  Then- things take an even scarier turn, when the woman stops her vehicle, gets out and walks up to the car."},{"comment_id":"10155025724612940","commenter_b":"And youre a profile of a pussy chucky","commenter_a":"No she is a political hack","post_message":" Yates is a profile in courage.  ICYMI: Senator Chuck Schumer took a shot at the Trump administration over the firing of acting Attorney General Sally Yates for her refusal to enforce Donald J. Trump refugee order."},{"comment_id":"10152763984611051","commenter_b":"they need to fire those officers, charge them criminally and hope she wins the lawsuit","commenter_a":"I'm thinking alot of you didn't read the article. Female police officer, in Canada, one month on the job, immediately suspended from the job after the attack, has since resigned.","post_message":"This officer arrested two people: a drunk teen and a rapist. She put them in the same backseat but only handcuffed one. Guess which one."},{"comment_id":"10154136361277293","commenter_b":"@username Oh! Just saw the guns!!!! You can live in your own basket. Would not want you as my neighbor. I'll live near a refugee.","commenter_a":"All these \"deplorable\" comments make me truly ashamed of my fellow Americans. SMDH at all the lies, irrational hate and fear mongering.","post_message":"Kerry told lawmakers \"that if it is possible to do more\" in terms of accepting refugees, \"we would.\""}]
