[{"comment_id":"1332991433380908","commenter_b":"All im saying is some people shouldnt breed .","commenter_a":"poor skinny white Jesusy guy.. HOW COME I'm THE CHUMP !! ==========>.\"roll tide/ @webpagelink","post_message":"Counter-demonstrators outnumbered attendees of a \"pro-white\" rally at Stone Mountain Park in Georgia, home to a divisive landmark that pays tribute to Confederate leaders."},{"comment_id":"10153333476251770","commenter_b":"My father is an immigrant from France, I lived 15 miles from the border of Mexico for ten years, I love the Mexican people and so does Trump, don't you see??? People who are in the legal process are being cut in line by illegals. Illegals ruin your wage rates, take your jobs, use our governments program resources. By shutting the border down deporting the illegals the Mexican Americans will get the wage they deserve! As acting, legal tax paying citizens!","commenter_a":"Because the legal Latinos want jobs. The illegal compete and lower the wage rate and that affects the legals ability to make a decent wage.","post_message":"Donald J. Trump beat out his Republican rivals in America's most Latin city Tuesday."},{"comment_id":"1532736620362438","commenter_b":"Cool ! I am sure he wants no more illegals!","commenter_a":"Build the wall and lock your self in there","post_message":"Donald Trump speaks live at Indiana State Fairgrounds. For a close-up view, watch our stream on our website: @webpagelink"},{"comment_id":"10154011298015927","commenter_b":"Shut up you non event","commenter_a":"F u dusche bag","post_message":"\"It needed to be said, and you said it beautifully ...\""},{"comment_id":"10154266076039071","commenter_b":"They will be new Amazon GO stores!","commenter_a":"I AM COUNT DRACULA","post_message":"The retail industry is heading into 2017 with a glut of store space."},{"comment_id":"10157692463425389","commenter_b":"Hillary will win due to the corruption within the establishment, and the votes of illegals and dead people!!","commenter_a":"Never permit the Federal government to pass into the traitorous hands of Hillary Clinton","post_message":"Keep in mind-he actually did these things."},{"comment_id":"10153101900003010","commenter_b":"WORTHLESS PIECE OF HUMAN FLESH...","commenter_a":"This world is coming to an end . I feel sick after reading this","post_message":"A 30-year-old Newhall man told sheriff's deputies his newborn daughter was missing. But investigators say he sexually abused, tortured and killed the 19-day-old child."}]
