[{"comment_id":"10153618615406320","commenter_b":"I think this moms do it on purpose.","commenter_a":"Please don't give this woman her kid back. They should take both. Her son will be next. Smdh","post_message":"SHOCKING: Child found 'Sweating profusely' Police in New Jersey had to rescue an child from a car seat in hot van while her mom went shopping. Details: @webpagelink"},{"comment_id":"10153527137233717","commenter_b":"Hell no! The real woman for the job is Hillary! #Hillary2016","commenter_a":"Please support Carly Fiorina tomorrow! Non establishment, proven leadership. Fight against the machine with a level headed conservative. Please support Carly! She needs your help to place in the top 4!","post_message":"Donald J. Trump is holding a rally at the Verizon Wireless Arena in Manchester. Watch live: @webpagelink"},{"comment_id":"10153271978657411","commenter_b":"White trash.","commenter_a":"I don't really care.","post_message":"HAPPY BIRTHDAY, #FLOTUS! First Lady Michelle Obama is celebrating her 52nd birthday today!"},{"comment_id":"831043426931080","commenter_b":"Yes, she needs to be held accountable! She has NO business being president!!!","commenter_a":"Good luck on this one, sure hope it all works!","post_message":"Hillary might as well retire her future plans for the White House! Gowdy's gunning for something that will DESTROY her!"},{"comment_id":"10154996363431337","commenter_b":"We have a incest pedohpile leading USA. The ignorants have come out from their caves.","commenter_a":"At least he'll bring back jobs!- every ignorant trump supporter.","post_message":"Donald J. Trump really shouldn't be tweeting about nuclear weapons..."},{"comment_id":"10153874849832439","commenter_b":"I heard her spine landed on top of police car. Best news I heard today! Rot in hell psychotic bitch!","commenter_a":"Can she blow herself up again, with all her brethren with her?","post_message":"Hmmm, is she making the (Eiffel tower) peace sign? Islam is peace, brother. The good news is -- she's dead. The bad news is Obama wants to bring these 'widows' and 'children' like the refugee Boston bombers to our shores. This savage tried to lure police within detonation range by crying \"help me, help me\" before blowing herself up."},{"comment_id":"552998604866610","commenter_b":"How dare you sir!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Another \"unverified story\" from Dr. Carson. Reporters visited the library and the librarian at the desk does not recall the event at all. Never happened! Carson lied and people died!!!","post_message":""}]
