[{"comment_id":"1236747943048399","commenter_b":"#NeverEverHillary #CrookedHillary #LockHerUp","commenter_a":"I can't believe the uneven coverage you get. Trump lies daily and people don't care. You don't even have to do anything wrong and the republicans and media blow it out of proportion.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154963330566509","commenter_b":"Not if we can help it....She is criminal","commenter_a":"Glad to see all the Democrat converts. Hillary will crush Trump in the general.","post_message":"The conservative columnist George Will is advocating that others do the same."},{"comment_id":"10154522973374102","commenter_b":"She may be the lesser of two evils, a female, a scapegoat, but she's still a nut job.","commenter_a":"I'm not saying she doesn't deserve disciplinary action, because she does. But I find it disgusting that they are targeting ONLY her, and not Trump's tweets against Nordstrom. I get that she's an easier target for the GOP, but grow a pair of balls, please.","post_message":"BREAKING: The Republican chairman of the Oversight Committee is recommending disciplinary action against Kellyanne Conway for promoting Ivanka Trump products from the White House, including 'reprimand, suspension, demotion, or dismissal.”"},{"comment_id":"10153728692094117","commenter_b":"Lol pussy","commenter_a":"Reason can go fuck itself. If you are a pro-Trump libertarian, like my page.","post_message":"'You know−the Constitution−there's nothing like it. But it doesn't necessarily give us the right to commit suicide, as a country, OK?'"},{"comment_id":"10152618671965950","commenter_b":"Don't care about that spoiled rich brat.","commenter_a":"Praying for her .. loved Whitney's music.still love her music.. such a sad time for the.family.. especially Sissy Houston.. God heal Bobbi Khristina.. play her MAMA music. They say that will help. To hear someone they loved voice.","post_message":"Despite mixed reports over Bobbi Kristina Brown's condition, family members ask the public to #StillPrayForBK."},{"comment_id":"10153693446321037","commenter_b":"Women on women issues unless it's Bills sexual affairs then she doesn't care.","commenter_a":"Maybe she should have first looked to tackle it at the White House when she was living there.","post_message":"Hillary Clinton is the first 2016 presidential contender to address the issue of campus sexual assault on the campaign trail, but she may not be alone for long."},{"comment_id":"10154420186151194","commenter_b":"Allah is shopping like à sodomized bitch right now","commenter_a":"who just saw that giant fuckin orb?","post_message":"LIVE: Anti-ISIS military op near Mosul, Iraq"}]
