[{"comment_id":"10152779839917093","commenter_b":"Looks like young man, yes respectful,young man was very patient with his mother for not striking her Yes that was courageous of her to find her child and protect him. God bless you guys. I hope you can see that there is so much unspoken love in this video.","commenter_a":"A mom who cares. Very brave woman!","post_message":"Mom finds her son in the middle of the Baltimore riots... many are calling her Mom of the Year for what she does next. @webpagelink"},{"comment_id":"1199347126788647","commenter_b":"We have to get these people out of here why pay for illegals school when we can't afford school for American kids","commenter_a":"When people have had enough then this will be brought to a stop not until, they think they are entitled to everything free and then they will take your job, then you'll be on welfare without a means to support yourself!","post_message":"What?!?!"},{"comment_id":"10153686254615653","commenter_b":"\"Poor Catholic Hispanic Immigrants\". Key Word : Illegal","commenter_a":"Donald Trump says he would force Mexico to pay for a border wall as president by threatening to cut off (rob) the flow of billions of dollars in payments that poor Catholic Hispanic immigrants send home to their native country, an idea that could decimate the Mexican economy and set up an unprecedented showdown (Trade War) between the United States and a key regional ally. #NeverTrump #ReverseRobinHood","post_message":"Stronger together."},{"comment_id":"10152976505127507","commenter_b":"Kiss my ass!!! Idiot!!!","commenter_a":"NRA go to hell. Enough is enough!!","post_message":"Far too many times. Watch the video here: @webpagelink #CharlestonShooting"},{"comment_id":"582726195242593","commenter_b":"Omg seems that all woman are becoming liars now ^ smh^ unbelievable","commenter_a":"There are two women Trump doesn't want to tangle with. Elizabeth Warren has forgotten more about economics than he ever knew. And Hillary's foreign policy knowledge is something he will never acquire. She will decimate him in a debate because he will have to be ready to speak on issues, not just make personal attacks. He is so thin skinned that he will self destruct as soon as she holds his feet to the fire. He and his followers don't have a clue. They have demonstrated time and again that when all else fails, thuggery rules. That doesn't win elections once reasonable people make up their minds not to put up with it any more. Now I just hope that reasonable people do that sooner than later. Put him out of his misery as quickly as possible.","post_message":"He's got a problem."},{"comment_id":"955398181243627","commenter_b":"And we will ship them out idiots","commenter_a":"BIGGEST WANKER MUSLIM OF ALL TIME","post_message":"This is only the beginning..."},{"comment_id":"1813669392186653","commenter_b":"I believe the only way to stop 5.O Is to kill em all Or stop bitch in, the popo gotta Gun n they Evil law,,Bt every nigga in the hood can shoot back,so kill em before they kill one u","commenter_a":"America you're gone so far.","post_message":""}]
