[{"comment_id":"1361247917304790","commenter_b":"She is a criminal","commenter_a":"His decision to not pursue this is a good thing in my opinion. He won the presidency, why continue to invest energy in Hillary Clinton? She should be irrelevant to him now.","post_message":"Donald J. Trump promised to prosecute Hillary Clinton for her use of a private server if he won the presidency. Now that he has been elected, it seems he has changed his mind."},{"comment_id":"1601888236769214","commenter_b":"I personally like the idea of amnesty for those already here, then very strict implementation of immigration laws and immigration reform after that. Breaking up families is not a solution to this problem. These raids will just cause more pain and foster bad feelings. If they're here, let them stay, get them legalized so they help support the system they're using. Then lock it down and form a clear, sensible, reasonable, doable path to citizenship. we don't need a wall. We need penalties on companies that hire illegals, and serious reform on the \"war on drugs\" that incubates environments that force people to flee their homes. We have to stop blaming people who are looking for a better life, and start finding ways to help our neighbors reach the same level of community peace that we enjoy.","commenter_a":"I know this is going to be unpopular, but I know many Hispanics who agree with me. There is a legal way to come to the country, and contrary to some of the attacks I have seen on other posts, it does affect our low income Black, Hispanic, and White communities. They are used to a more extreme poverty, so they are willing to work for less than minimum wage, and are off the books, so taxes, SS are not paid. This means an American citizen or legal immigrant is denied a job. When so many of our jobs are being sent to Mexico, China, India how can we not address the issue of those who came here illegally. My nephew's wife is from Mexico. 2 of my nephews have dual citizenship. US/Brazil. I am far from racist or anti-immigration, but our own citizens and legal immigrants are suffering. We ...","post_message":"This week the media reported something that I find not just wrong, but inhumane: President Obama is currently planning \"a month-long series of raids in May and June to deport hundreds of Central American mothers and children\" who came to our country fleeing that same violence.  Sending women and children back into harm's way after they already fled horrendous violence in Central America is painful and inhumane, and must be stopped.  Sign my petition asking President Obama to stop these raids and to make sure that families fleeing violence in Central America are protected from deportation."},{"comment_id":"10157671091150294","commenter_b":"Hush.","commenter_a":"Megan Crucis","post_message":"The person she contacted was using a clown photo as a profile picture -- as well as an alias."},{"comment_id":"446969245501847","commenter_b":"We need a first lady with her boobs hanging out ?? Geeeez - that is classy","commenter_a":"Beautiful family! Trump got good taste when it comes to women!","post_message":"Thank you!!"},{"comment_id":"10154753086323967","commenter_b":"He is building a wall","commenter_a":"Come on, guys. Our new president told us this was all a hoax perpetrated by the Chinese. We're clearly in good hands.","post_message":"Unstoppable."},{"comment_id":"405482309640063","commenter_b":"Sharia is contrary to the Constitution and as such cannot coexist with our laws. If muslims want to live by sharia then they need to return to the hellholes they came from. I can guarantee that if a muslim male were to attack me or even confront me that I would take him out. And he would not get his 'virgins' either.","commenter_a":"yep, we enough corruption without this law adding to it.","post_message":"If you don’t believe that sharia law is already creeping into the United States of America, then you need to watch this video."},{"comment_id":"10153285740536336","commenter_b":"Gays can't create life? Hmm. I guess lesbians can't get pregnant or gay men can't inseminate a surrogate either. Anyone can create a life. But can they nuture a life? Plenty of gay parents out there do, while a shitload of straight parents don't.","commenter_a":"Sickening, YES! Just more proof of the changing times and how people deviated from their upbringing b/c they want to do what they want; not what is right...no respect for self or others....DISEASE!!!","post_message":"BREAKING NEWS: Ireland votes to legalize gay marriage. The traditionally Catholic nation saw 62.1 percent of Irish voters vote “yes” on gay marriage referendum in what is seen as a landslide victory for gay-rights advocates."}]
