[{"comment_id":"1787942078130672","commenter_b":"It's a good thing you are there, because you have no idea how evil and vile that woman is.","commenter_a":"I'm not from america , i live in morocco , but i hope from the bottom of my heart for clinton to win and she really deserves to be the president of the white house because if trump was elected he is gonna make america a hell place on the planet earth","post_message":"Barack Obama was elected the 44th President of the United States on this day 8 years ago."},{"comment_id":"10154432896669342","commenter_b":"The first 2 females that get drafted if there is one better be his kids.","commenter_a":"What they need to do is send all the government babies to serve leave the women alone","post_message":"The timing of Obama's support for women registering for the draft makes it mostly symbolic, but where do you stand on the issue?"},{"comment_id":"1009004349187234","commenter_b":"first she needs to be a lady","commenter_a":"Watch out she will pick your pocket ...","post_message":"Michelle Obama Invites Muslim Refugee To Sit With Her At State Of The Union  She should invite a soldier who fought for our country. This is ridiculous.  Do you think Michelle Obama is the worst first lady ever?"},{"comment_id":"835498176546436","commenter_b":"Deb... Your name Is tasty.","commenter_a":"Was he speaking to an empty chair? I can't think of anybody else who would or should listen.","post_message":"The director has spoken."},{"comment_id":"1196725563700232","commenter_b":"You left out the part where Trump plans on cutting taxes on the most wealthy as well., Then there are Trump plans for how trade with China and Mexico is going to be handled, yet even now all the products that bear Trumps name are being manufactured in China and Mexico. Perhaps to show he is working in good faith, don't you think he should have them manufactured here in the US? It is quite simple to say I'm going to do this I'm going to do that but it is far more difficult to actually do them. He might say it, if elected he might try and do it but I guarantee you he is not going to 'make' the Mexicans pay for his wall, a wall that will actually do little to stop the flow of illegals. The gun he will hold to the Mexicans head to make ...","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, preserve the sanctity of the unborn life, preserve the sanctity of the 2nd amendment ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness","post_message":"Take a look at the companies that are partnering with this pro-amnesty open-borders group!   @webpagelink"},{"comment_id":"10154394600380695","commenter_b":"Girl sit down... Really","commenter_a":"Why is this disgusting waste of human flesh still walking amongst us? Lock this rapist up already and throw thr key in the bottom of the Pacific","post_message":"BREAKING: The 78-year-old actor faces up to 10 years in prison if convicted."},{"comment_id":"10154474961664062","commenter_b":"And please don't be a coward and read my msg and don't reply...I wanna know your comeback and actually be real about it...","commenter_a":"I'm sure it was taken out of context by the biased media","post_message":"'You've got to see this guy.' He then ridiculed Kovaleski's appearance by bending his wrists and jerking his arms around."}]
