[{"comment_id":"1277480212306141","commenter_b":"Yeah, she's a racist.","commenter_a":"STOp THE HAte","post_message":"CLAREMONT COLLEGES “Students Of Color” REFUSE To Live With Whites: “I don’t want to live with any white folks”…”Don’t see how this is racist at all”"},{"comment_id":"580872065400762","commenter_b":"She is a big mess","commenter_a":"Dress by Radical Christian Dior.","post_message":"LOL! Sorry, but we just couldn't resist... where did Kim Davis think she was going tonight? If she wasn't such a homophobic bigot we'd recommend she go on Queer Eye for the Straight Girl! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153036751566491","commenter_b":"Your mother is fired","commenter_a":"You're fired!","post_message":"NBC dumps Trump."},{"comment_id":"10152791090146523","commenter_b":"Feminist BS","commenter_a":"See, it doesn't just happen on college campuses. Young men learn young that sex is their \"right\" and if they want it, they take it. And then the girl gets blamed. Why do we focus on young women keeping themselves \"modest\" but do not focus on teaching young men to respect women and keep their pants on?","post_message":"17-year-old Muskego boy accused of sexually assaulting 15-year-old girl at underage drinking party."},{"comment_id":"10153945249138690","commenter_b":"The Muslims massacring Christians citizens","commenter_a":"She is a Christian with big heart offering kindness and help to the Muslims so would Muslims do the same things to Christians ?","post_message":"When refugees arrive at the Greece-Macedonia border, the smiling face that greets them is that of Gabriela Andreevska. Watch more Al Jazeera Shorts - @webpagelink"},{"comment_id":"1069087446447636","commenter_b":"Put her on the street .","commenter_a":"She looks flashy","post_message":"The liberal media loved Michelle Obama's tang SOTU dress. Take a guess at how much it cost."},{"comment_id":"1049399221792530","commenter_b":"A Hillary supporter should be asking themselves why they want a killer in office.","commenter_a":"A Trump supporter should be asking themselves why Putin would be interested in Trump winning the generals. Makes you wonder about where you stand.","post_message":"Donald Trump’s call for Russia to hack America makes this election an easy choice. ►Full Episode: @webpagelink"}]
