[{"comment_id":"10154607163603124","commenter_b":"Awww! You know me","commenter_a":"@username look how cute!","post_message":"Feline stressed? Try to stay paw-sitive! @webpagelink"},{"comment_id":"1077005215689340","commenter_b":"Hillary is an establishment hoe","commenter_a":"She is the most qualified candidate in this race. I strongly believe, Life will be better with @username. <3 #imwithher #weareforher #Hillary2016 #feelthehill #yeshill","post_message":"Anyone asking for your vote has to grapple with the reality of inequality in America—and offer real plans to fix it."},{"comment_id":"10153066527856336","commenter_b":"Please woman go troll somewhere else","commenter_a":"Poor guy","post_message":"Bristol Palin is engaged to Medal of Honor recipient Dakota Meyer – the Kentucky native is credited with saving the lives of 36 Marines, Army soldiers and Afghan soldiers."},{"comment_id":"10154156633758822","commenter_b":"Ship all libs and Democrats there now!!!!","commenter_a":"Can we send the Obamas and Clintons as test citizens? Perhaps their buddies in Isis?","post_message":"Humans on Mars by the 2030s! That's what President Obama's plan calls to do."},{"comment_id":"1342391692491333","commenter_b":"Put her in jail","commenter_a":"Buses...bussed them in and still cannot fill a gym","post_message":"Hillary Clinton spoke at a campaign rally in Sanford, with one week left until the election."},{"comment_id":"10155041928809187","commenter_b":"Good please for ICE to pick up a bunch of illegals.","commenter_a":"i wish mexico would close its borders an treat american they way they treat illegal just for one day","post_message":"We are Live outside City Hall, where protesters are rallying as part of a nationwide demonstration called 'A Day Without Immigrants' to speak out against recent ICE crackdowns, and showing the impact that immigrants have on the community."},{"comment_id":"10156658380360354","commenter_b":"Has anyone noticed how the name has changed from refugees to migrants. They are not migrants they are foreign invaders Some people will never learn. You need to know who you are letting in your country. Know the history of Islam. We need to wake up in this country stop paying people to come here and destroy us. This was copied from a post by William Parrott When politically correct, tolerant, and culturally diverse societies agree to Muslim demands for their religious privileges, some of the other components tend to creep in as well. Here how it works. As long as the Muslim population remains around or under 2% in any given country, they will be for the most part be regarded as a peace-loving minority, and not as a threat to other citizens. This is the case in: United States Muslim 0.6% Australia Muslim 1.5% Canada Muslim 1.9% China ...","commenter_a":"How can anyone say that their religion does not allow this violence against non - Muslims?","post_message":"“How dare you run away from us?” one Muslim man allegedly yelled. “Christian girls are only meant for one thing. The pleasure of Muslim men.”"}]
