[{"comment_id":"10153798525078352","commenter_b":"She needs to be punched in her mouth","commenter_a":"she's just horny.","post_message":"VIDEO OF RACIST WHITE LADY SCREAMING NI@@ER AT KIDS GOES VIRAL AND SHE SAID SHE'S NOT SORRY FOR IT! (VIDEO)"},{"comment_id":"10153254069356130","commenter_b":"God damn feminists","commenter_a":"Kara Capozzi","post_message":"We've got a bearded man who meets his bearded mom, a world-record lady beard and a coiffed competitor on this week's Weird News podcast."},{"comment_id":"750686755029933","commenter_b":"She's a racist","commenter_a":"I guess this only applies to black women since she declared \"Black girls rock\" instead of ALL GIRLS ROCK","post_message":"The \"Barack Obama\" move didn't go over so well."},{"comment_id":"542901459225067","commenter_b":"Go Hillary !","commenter_a":"She is honest and I am tired of people accusing her of everything when she has been for the USA since Clinton was President and after that, etc. She loves her country and will be an excellent President. Grow up world!","post_message":"The people of Iowa versus pollsters and pundits. The people win."},{"comment_id":"1544982162188475","commenter_b":"That's why I have your wife come over","commenter_a":"Yeah it changes kids it doesn't make them limp wristed liberals who don't know which gender they are . It makes them tuff , learn how to solve problems with others and gives them confidence!","post_message":"The more head blows a child sustained, the more changes were seen in their brain tissue, according to the study released Monday."},{"comment_id":"1081696675193718","commenter_b":"Y.e.s. lol","commenter_a":"@username is this the lovely place you worked?","post_message":"Thanks to #KPRC2 viewer Harold K. for this video of a manhole cover flooding outside the Houston Museum of Natural Science. Live coverage --> @webpagelink Radar --> @webpagelink Photos --> @webpagelink"},{"comment_id":"10153709060366037","commenter_b":"She is a disgusting hypocrite!","commenter_a":"That's OK, Kim. You're getting what you really wanted all along. Attention. May your 15 minutes be over soon.","post_message":"\"What probably hurt me the worst is when someone tells me that my God does not love me.\""}]
