[{"comment_id":"1065696356784708","commenter_b":"and it is not round","commenter_a":"So the planet isn't flat.","post_message":"Find out what the world really looks like."},{"comment_id":"1166954960025334","commenter_b":"You are so right. All this is her own doing.","commenter_a":"Why didn't Hillary say, I have heard the question? Shows character of Hillary.","post_message":"CNN FIRES BLACK DEM Party Chair: New Wikileaks Email Exposes SECOND Question Donna Brazile Gave To Crooked Hillary In Advance Of Debate"},{"comment_id":"1359337234126021","commenter_b":"Kids learn this behaviour. Violence/bullying maybe the norm in their households. Young bullies grow into big bullies unless they are dealt with","commenter_a":"Ban kicking , feet and bullying","post_message":"All because he stepped in to defend an autistic friend. Shocking."},{"comment_id":"1754762228138614","commenter_b":"If you think things are bad now if Hillary get in a wall, illegal immigrants and whatever you want talk about are going to be the very least of your (our) problems. She will destroy anything and anyone plus she will cheat, lie and steal and never think twice about it! She not even be in the running! If she gets in everybody better run like hell!","commenter_a":"Actually, Clinton was talking ABOUT trump since trump HIRED illegal immigrants! Clinton didn't put anyone down when stating this. Every president/candidate has said this. It's how and what you say that make a difference. Trump wouldn't be called a racist etc. If he didn't put a whole country/religion down with name calling. There's a HUGE difference between what bill said and what trump says. Whoever can't see that needs help...","post_message":"Do you think this sounds a lot like Donald J. Trump? MORE: @webpagelink"},{"comment_id":"10153658403039726","commenter_b":"OK !! There are 42,000,000 illegals in this country, squatting out \"anchor babies\" like cockroaches---WHAT\"S HIS PLAN.","commenter_a":"Carsons' stand on illegal aliens is almost as bad as obamas. Vote what's best for America---Trump.","post_message":"WATCH: Carson Jokes: I Heard Trump Dropped Out!"},{"comment_id":"1156989694324963","commenter_b":"Fuk that NIG GERR BITCH","commenter_a":"SHE IS A HORRIBLE HUMAN PERIOD","post_message":"Michelle Obama Banned Valentines Day In Schools She can't take love away from America's children. Do you think she is a horrible first lady?"},{"comment_id":"10153297410416770","commenter_b":"She a turd......she better be praying..wrong thing to say,vote Trump","commenter_a":"Too late and why would you support a total liar?????","post_message":"Former Secretary of State Madeleine Albright is trying to fix a mess she made when she told women at a Hillary Clinton rally there's a \"special place in hell\" for them if they don't vote for Clinton."}]
