[{"comment_id":"10154070103774916","commenter_b":"Shillary can't beat Dumper because she can't hold on to the Bernie followers who will leave the DemoRatic Party as soon as she gets the nomination. We aren't Democrats and we won't vote for her. #MassExodusOfTheDNC","commenter_a":"Hillary Clinton and Demographics and the American people will CRUSH Racist Republican Lying Cowards Donald Trump or Cruz.Who are vile bigoted ignorant chicken hawks warmongers un-American racist hateful assholes. HILLARY 2016.","post_message":""},{"comment_id":"10154164626642293","commenter_b":"This is so very tragic and sad. Based on the videos that have been released, this officer appears to have fired for no reason. Police need to be held accountable, just like everyone else, when they break the law.","commenter_a":"And we need female policepersons exactly why?","post_message":"Officer Betty Shelby has been charged with manslaughter for the shooting of Terence Crutcher."},{"comment_id":"10152900862242061","commenter_b":"Sounds awesome! This is funny. Did you post this recipe because he's/she's a fruit?","commenter_a":"I can't think of anything to comment so I'm just going to post a Blueberry - Strawberry Pancake recipe. 1 1/4 cups all-purpose flour 1/2 teaspoon salt 1 tablespoon baking powder 1/2 teaspoon baking soda 1 1/4 teaspoons white sugar 1 egg 1 cup milk 1/2 tablespoon butter, melted 1/2 cup fresh or frozen blueberries, thawed 1 cup of fresh or frozen Strawberries 1. In a large bowl, sift together flour, salt, baking powder, baking soda and sugar. In a small bowl, beat together egg and milk. Stir milk and egg into flour mixture. Mix in the butter and fold in the blueberries and Strawberries Set aside for 1 hour.A 2. Heat a lightly oiled griddle. or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve. EnJoy","post_message":"Caitlyn Jenner unseats Pres. Obama to become fastest Twitter user to hit 1,000,000 followers: @webpagelink"},{"comment_id":"10153479887206037","commenter_b":"There are no grounds to deny 3 women, 4 men or any number imaginable from acquiring a marriage license. Where does the number 2 come from?","commenter_a":"Good job supreme court! Whether you agree or disagree with same sex couples it is not our right to judge them. It is nobody on this earths right to judge anyone. May all same sex couples find happiness","post_message":"Follow our live blog for all the latest updates on the U.S. Supreme Court's #MarriageEquality decision."},{"comment_id":"10154092848234087","commenter_b":"A special letter to Republican nominee Donald J. Trump: Dear Sir, In a way, you are no better than your narcissistic alter ego. When told what you say is considered sexist, racist, classless, hurtful, and you say it more, you are a self-centered narcissist. Speaking off the top of your head, yelling hurtful insults, slinging mud, your unsophisticated intellect comes as somewhat surprising. It is apparent there is no limit to what you will say. For starters you are unapologetically low class: women ooze blood Hillary cofounded ISIS \"Hillary Clinton is a bigot!\" punish women for abortions kill terrorists and their families proposed mass deportation force African Americans use food stamps extreme vetting of Muslim immigrants if Ivanka wasn't daughter, he'd date her Mexican immigrant murderer rapists cancel Obamacare (offers no alternative) \"you have to be wealthy in order to be great\" \"putting a wife to work is a dangerous ...","commenter_a":"WE ARE CONCERNED ABOUT YOUR QUESTIONABLE BUSINESS DEALINGS OVERSEAS AND YOUR FINANCIAL TIES TO THE MOB AND OTHER COUNTRIES 1.\\tWill you sever ties with your company linked to foreign leaders, questionable organizations, and criminals if you become president? 2.\\tHow will you handle non-cancelable contractual obligations with parties whose interests conflict with those of the United States? 3.\\tWhile refusing to release your tax returns, how will you confirm that you do not have dangerous financial ties to bad actors abroad? 4.\\tIf you were willing to work with Qaddafi known terrorist and dictator there anyone you aren't willing to make a deal with? Who? 5.\\tHow can you be tough on Iran, given your business partnership with someone connected to Iranian money laundering? 6.\\tGiven that you've already questioned our commitments to NATO allies, what is your answer to this? For example, how would you handle the millions of dollars flowing into your organization ...","post_message":"Bernie Sanders ripped the media for letting itself be manipulated so easily by Trump."},{"comment_id":"10153746116545326","commenter_b":"@username I'm still waiting for the tons of stepford wives to come.","commenter_a":"Lots of bitterness coming from the Sanders.","post_message":""},{"comment_id":"10153218033713188","commenter_b":"That Mormons even call themselves Christians is a relatively new phenomenon. It dates back to at best sometime in the late 70s/early 80s. I remember a girl in my youth group had brought one of her Mormon friends one summer's eve, and I got into a conversation with her and I'll remember what she said til the day I die- \"I'm not a Christian, I'm a Mormon!\" That would have been 74 or 75. Also, the concept that \"As God was, so man is; as God is so man may become\" is utterly missing from the other thee Abrahamic faiths.","commenter_a":"Um, no. The miracle IS the resurrection. The result is the atonement.","post_message":"A little bit of what I spoke about at church Sunday."}]
