[{"comment_id":"10152959292394753","commenter_b":"I don't think you can read lady. Either that or human compassion is lost on another bitter old woman.","commenter_a":"that is jus nasty to have sex with your stepdad","post_message":"North Las Vegas police are still investigating the rape and child abuse case. The law enforcement are continuing to review what they have a “three-generation case of child abuse” involving the teen rape victim’s mother, Kellie Cherie Phillips, 38, and the man she described as her stepdad, Jondrew Magil Lachaux, 39."},{"comment_id":"10153825781392522","commenter_b":"There goes the fake Native American vote!","commenter_a":"Another documented lying Democrat fanning the flames. STFU Pocahontas","post_message":"\"We will fight harder, we will fight longer and we will fight more passionately than ever.\""},{"comment_id":"10155220975479218","commenter_b":"@username tell that to a nun","commenter_a":"You wouldn't need to be pro choice or pro life if people were just responsible when it comes to their sex lives. Both men and women, responsibility!","post_message":"Thousands of people demonstrated in the annual March For Life, marching from the Washington Monument to the Supreme Court, advocating the right to life >> @webpagelink"},{"comment_id":"857457044291637","commenter_b":"One man will never accomplish that .That will never happen.","commenter_a":"Obama is very naive when it comes to the Arabs. Maybe he is trying to have faith in human nature.that will not work in that cesspool in the middle east.That viewpoint does not even work here in a fairly civilized country.","post_message":"“Even if Israel has to stand alone, Israel will stand.”"},{"comment_id":"10153153528689071","commenter_b":"You mean in the houses where tragedy still occurred, like drownings, accidental poisonings, falls etc? Not the sharpest tool in Lowes are ya?","commenter_a":"This sort of thing happens less often in houses without guns, but I'm sure that's just a strange coincidence.","post_message":"An awful tragedy happened in Chicago."},{"comment_id":"1488583267837295","commenter_b":"Are there ANY sane, normal, decent and honest people who want to do this job?","commenter_a":"He's angling for the Sec State slot if Trump gets elected.","post_message":"Most people don't really struggle with this question."},{"comment_id":"10153614768367550","commenter_b":"Women shut da hell up I'm short hand writing","commenter_a":"People be ready to dissect the situation, wen in reality it's the system fault. What do you expect it's no jobs in Fayetteville. People looking at what I'm saying and they're lik Wat is he talking bout. Like I said it is no jobs in Fayetteville, and this is suppose to be a military town it should be jobs all over the place but it's not. It's three types of ppl in Fayetteville. The military, the civilians that's what they call us. And the third is ppl who do what ever it takes to get paid or feed they family. Now don't get me wrong yea it's messed up ppl breaking in ppl houses. But give these ppl job's and I bet all the money in the world they become a better civilian then the first person who commented on this topic. @username. No job's and this is Wat u ...","post_message":"\"And you're charged with a similar crime that you just went to prison for?\"  \"Yes, Sir\""}]
