[{"comment_id":"10153070035530399","commenter_b":"I thought I saw this woman at Hooters the other night. That's always been a good source of Broadcast talent for Faux.","commenter_a":"Just a new way for the Dummycrats to steal more votes!!!!!!!!!!!!!!!!!","post_message":"It's always Andrea Tantaros."},{"comment_id":"10152767737561636","commenter_b":"I'd happily punch her lights out, evil witch!!","commenter_a":"Hunt without a rifle. Even it up a bit.","post_message":"She has said she will 'never apologise' for being a woman who hunts..."},{"comment_id":"963507617048798","commenter_b":"Black women live in public housing for generations it is time to let them live in the streets like white people do. 5 year limits on public housing so it does not continue as a breeding center for black skanks.","commenter_a":"Why do we have so many homeless? if our country has immediate help and housing for All the refugees then this country should have housing and help for all Americans immediately. No American citizen should be homeless, take care of our own First. Homelessness breeds all kind of crimes.","post_message":"Three teenage brothers suspected of a fatal attack in a #Seattle homeless camp known as ‘the Jungle’ have been charged with first-degree murder and assault. Michelle Millman reports what we know >> kiro.tv/JungleCharges"},{"comment_id":"1857903094453796","commenter_b":"@username AND U DON'T YOURSELF.","commenter_a":"Please leave MLK's son alone. Focus black people, stop criticizing on something or someone you know nothing about or the reason behind it. You do you. Keep out of everyone else's business! We're black/African Americans but we're individuals.","post_message":"He went off on the Civil Rights icon's son."},{"comment_id":"10152577798681316","commenter_b":"A percentage will watch Hannity and cry. The rest are busy being free.","commenter_a":"LOL they said this in 1777","post_message":"Freedom hardly exists in America today, where a family man who helped people purify their water naturally now faces 37 years in prison. Read Daniel Smith's story and support his fight against the corrupt US justice system. @webpagelink"},{"comment_id":"1286274651384789","commenter_b":"Go home.","commenter_a":"Why is this degenerate getting so much coverage....He's Disgraced HIS SON who died in 2004!!","post_message":"Khizr M. Khan has published papers supporting the supremacy of Islamic law over -made Western law  including the very Constitution he championed in his Democratic National Convention speech attacking GOP presidential nod Donald Trump."},{"comment_id":"1225927100760651","commenter_b":"@username And this from the person from Farmville?","commenter_a":"When do we decide that our gun culture is not worth another child dying? What a sad story. Prayers for her family.","post_message":"\"She's not going to first grade, because he made a choice to pull out his gun,\" Lilly's mother said. Read more: @webpagelink"}]
