[{"comment_id":"684886304977884","commenter_b":"I wonder the same thing when I see those clowns busting out the tricorn hats and teabags.","commenter_a":"Don't these people protesting have jobs?","post_message":"I wish there was a LOVE button on Facebook."},{"comment_id":"10154045995555329","commenter_b":"'@username No Danie, they're too scared to do anything because FEMINISTS THREATEN TO KILL THEM.","commenter_a":"As a man who would literally NEVER talk to a woman like this, I'm ashamed and embarrassed that men actually do. Makes me sick. I was always taught to treat women with respect. Guess that doesn't apply to my fellow man...","post_message":"ICYMI"},{"comment_id":"1049118838444933","commenter_b":"Ross I'm quiet familiar with what you and others want, but that's not the way it is,especially me. I served this country for my beliefs and I'll be damned whether people like you like my opinions or not. One day when the liberals get their way and all the refugees and ILLEGALS are let in this country then maybe you may see what I'm talking about. Either way its not my problem, I've served my time and paid a life time of taxes and still paying. No I think Ross today's society are out of touch with reality is the problem.","commenter_a":"As an older person I've come to the conclusion you can't blame these young snot nose, entitled brats. This is the environment that's been created by the liberals, so everybody can feel hunky dory.","post_message":"She probably won't be too pleased..."},{"comment_id":"536456796544900","commenter_b":"Go home.. This is not ur country.. To bring ur confusion here....","commenter_a":"Amen !","post_message":"Muslims try to pass Shariah Law in Alabama but these patriots refused to back down.  We are not in the Middle East. No Shariah Law here.  Do you support these patriots’ stand against Shariah Law?"},{"comment_id":"1797253250554324","commenter_b":"Tax the nfl that might cut into some of the players money lot of overpaid jerks. Funny how middle Americans love this country and those zeros will not embrace it. I see problems not the countries fault it's the politicians, take care of it at the polls.","commenter_a":"I'm done with the NFL you guys play a game and earn millions piss on all of you who disrespect our country!!!!","post_message":"BREAKING NEWS...."},{"comment_id":"10153218033713188","commenter_b":"That Mormons even call themselves Christians is a relatively new phenomenon. It dates back to at best sometime in the late 70s/early 80s. I remember a girl in my youth group had brought one of her Mormon friends one summer's eve, and I got into a conversation with her and I'll remember what she said til the day I die- 'I'm not a Christian, I'm a Mormon!' That would have been 74 or 75. Also, the concept that 'As God was, so man is; as God is so man may become' is utterly missing from the other thee Abrahamic faiths.","commenter_a":"Um, no. The miracle IS the resurrection. The result is the atonement.","post_message":"A little bit of what I spoke about at church Sunday."},{"comment_id":"10153573437688984","commenter_b":"That makes sense since she's a woman","commenter_a":"Bruce Jenner is a disgraceful, sick, fake excuse of a man. ..","post_message":"Wow. Franklin Graham just made a massive statement about 'Caitlyn' Jenner on Facebook... now it's going viral.  Nearly half a million people just 'liked' this post... because it's absolutely perfect.  Spread this absolutely everywhere."}]
