[{"comment_id":"1570131419945845","commenter_b":"How does someone like this get elected in this day and age? Shame on those that vote for such a disgusting human being. I hope Texas sees the day when most of their women have left the state. This is the opinion of a multiple degreed female with a B.A in Mathematics and a Juris Doctorate","commenter_a":"He's an embarrassment to men as well as women. How in this day and age does someone like this still exist?","post_message":"\"It is the job of a woman to stay at home\" - A real Republican in 2016."},{"comment_id":"10154473701808812","commenter_b":"Good for her! This is the American Dream at its finest. All you haters who think this country belongs to you and all immigrants are criminals and steal your jobs can suck it! I was born here and will die for my country if necessary and this is what I will fight for. The right for EVERYONE to pursue life, liberty, and happiness. God bless you little girl!","commenter_a":"This is amazing.","post_message":"Texas high school valedictorian reveals secret in graduation speech: \"I am one of the 11 million undocumented immigrants living in the shadows of the United States.\" @webpagelink"},{"comment_id":"10153947557669753","commenter_b":"Police and your government bosses, STOP PREYING ON BLACK PEOPLE LIKE HUNTING WILD GAME AND SHOOTING US TO KILL!!!","commenter_a":"She is crying a hell of a lot more now that she is being interviewed than when sitting next to a dying man with her child in a car... Still say something fishy about the whole situation","post_message":"Police scanner recordings obtained by a local Minneapolis news station reveals that St. Anthony police officers pulled over Philando Castile not because of a busted tail light but because he looked similar to a robbery suspect due to his “wide nose.” The startling dispatch recording indicates that not only was Castile seemingly racially profiled for his “wide nose”, his girlfriend says that officers lied when they claimed the stop was for a tail light that was out as the tail light was seen... @webpagelink"},{"comment_id":"1419424701411870","commenter_b":"Um no","commenter_a":"Peter Di Benedetto","post_message":":O"},{"comment_id":"10154607163603124","commenter_b":"Awww! You know me","commenter_a":"@username look how cute!","post_message":"Feline stressed? Try to stay paw-sitive! @webpagelink"},{"comment_id":"1004765479656630","commenter_b":"That's no lady. Bigger dick than Barry.","commenter_a":"Disgraceful First Lady","post_message":"Hot diggity dog..."},{"comment_id":"10154088282393145","commenter_b":"@username, if we could just have put a wall up around the DNC convention center, we'd have a great start catching many of the illegal immigrants.","commenter_a":"Didn't See any American Flags on stage or anywhere anyone else notice that I guess showing pride for our country is out the window if your a democrat","post_message":"She took some hard digs at Donald J. Trump and didn't even mention his name. What did you think of her speech?"}]
