[{"comment_id":"10153770178735736","commenter_b":"Hillary is Hillary, not Bill. Duh!","commenter_a":"She should resign.","post_message":" Trump comments in 2005  11 years ago were made when he was a Democrat. The hypocrisy of Hillary Clinton to say Trump does not belong in the White House when her husband defined this behavior."},{"comment_id":"10155018116889371","commenter_b":"She broke the Law, simple as that","commenter_a":"Wait, did Kelleyanne get a new job? Is she now a spokeswoman for Ivanka? 45 will have to fire her. She can't do two things at once. Especially since at least one would be illegal.","post_message":"This is completely unethical and may even violate federal law. Kellyanne Conway—counselor to the President of the United States—just went on live TV to urge people to \"go buy Ivanka's stuff.”"},{"comment_id":"1082137365131066","commenter_b":"So yeah, drug addicts can just stop for a few days to pass a test...yeah no, sorry that isn't how it works.","commenter_a":"Anyone bother reading the article? \"..recipients (of welfare) choose the day and time of the testing..\" This is how it's done in all these examples and *THAT* is why there was only one person that failed. Most drugs are out of your system (and won't show on a dipstick test) in less than 48 hours. Do *RANDOM* drug screening like I have to do for my job. No advance notice, just get here now and pee in a cup. See how many fail then.","post_message":"There are stereotypes and there is reality. Welcome to reality."},{"comment_id":"10153170406841770","commenter_b":"I SAY MERRY CHRISTMAS And Happy Easter !! NO MORE REFUGEES ! THE PEOPLE NEED TO BE REMINDED THAT FDR AND CARTER DID WHAT TRUMP IS SUGGESTING ! THE PEOPLE NEED TO HELP DONALD J TRUMP [ MAKE AMERICA SAFE AND GREAT AGAIN ] VOTE FOR AMERICA ! ABOLISH ALL GUN FREE ZONES AND ESTABLISH A NATIONAL RECOGNIZED CONCEALED CARRY ! NEVER FORGET WHAT THE DEMislamOCRAPS AND obuma HAVE DONE AND ARE TRYING TO DO TO AMERICA ! PASS IT ON !","commenter_a":"Saying a specific group of people matter above others is highly racist and prejudicial.","post_message":"Black Lives Matter protesters are filling the streets of Chicago Wednesday, blocking traffic and disrupting the city to protest police actions relating to the death of 17-year-old Laquan McDonald."},{"comment_id":"1276333032401449","commenter_b":"And your first lady has a dick","commenter_a":"Haters are real, she is beautiful as fuck with a clown ass husband, I enjoy having a crazy First Lady because I DONT GIVE A FUCK ABOUT A FIRST LADY! STAY FOCUSED ITS ABOUT VOTING FOR THE PRESIDENT NOT THE FIRST LADY YOU FUCKS!","post_message":"This HAS to be said!"},{"comment_id":"10153314769416491","commenter_b":"We Aussies don't want this xenophobic, racist bigot back","commenter_a":"I think we should deport Rupert for being UN-AMERICAN.","post_message":"Rupert Murdoch: \"Maybe make special exception for proven Christians.\""},{"comment_id":"10155026863931509","commenter_b":"she doesnt look that bad for a transgender","commenter_a":"What a beautiful woman our first lady is.","post_message":"First families join hands for a rendition of \"The Battle Hymn of the Republic\" during memorial for slain Dallas officers. @webpagelink"}]
