[{"comment_id":"568744853313807","commenter_b":"Take her welfare away from her and force her 2 get a job!","commenter_a":"Their parents must be total Pieces of shlt","post_message":"Did this idiot DESERVE this?"},{"comment_id":"10152610651920667","commenter_b":"This girl is beautiful. Mrs. Rancic is just trying to make herself relevant by saying idiotic ridiculous comments. Amazing what people will do to try and get noticed.","commenter_a":"E! Should cancel the show, before they cause more trouble for them selves","post_message":"In dishing about all the red carpet looks on E!'s Fashion Police, Giuliana Rancic cracked that Zendaya probably \"smells like patchouli oil ... or weed.\" And an angry Zendaya took to Twitter to say there is a \"fine line between what is funny and what is disrespectful.\""},{"comment_id":"10153292946061509","commenter_b":"obama is a standerd POS ! muslim bstrd","commenter_a":"This is asinine. Why would he do this, yet absolutely refuse to meet with Benjamin Netanyahu??","post_message":"There were some hard-hitting questions about drones, college education and racial profiling. But he gets those all the time. Let's focus on the weird: @webpagelink"},{"comment_id":"1175706475803156","commenter_b":"But women shouldn't be able to get birth control or abortions...","commenter_a":"Now thats the Paul Ryan I know.","post_message":"WOW."},{"comment_id":"1004051086318087","commenter_b":"Hillary is a BIG LIAR","commenter_a":"HILLARY CLINTON 2016!ALL THE WAY TO THE OVAL OFFICE!!","post_message":"With just 100 days until the Iowa caucuses, James, a Hillary for Iowa organizer, is taking over @HillaryClinton on Twitter. Follow along to hear why he’s working hard to elect Hillary: @webpagelink"},{"comment_id":"1197525123667075","commenter_b":"Time for her to be fired!","commenter_a":"That also includes Mountain Dew, Mug Root Beer and Mist Twist, Aquafina bottled water, Propel water, Gatorade and Rockstar Energy drinks. Also all Frito-Lay products including Fritos, Cheetos, Lay's and Ruffles potato chips and Rold Gold pretzels. All Quaker products. This is only a partial list.","post_message":"Follow us for more at President Trump"},{"comment_id":"1154241914613147","commenter_b":"Maybe that dickwad should of been aborted.","commenter_a":"The faux outrage is big with this one. Who gives a crap.","post_message":"“How the hell do you think this joke is OK?”"}]
