[{"comment_id":"1876818559213436","commenter_b":"If NFL can't support National Anthem, then we can't support NFL or anyone else that can't support the Anthem.","commenter_a":"Back to Africa with him!","post_message":"NFL National Anthem Protests Sink TV Ratings To Five-Year Low Week Six!!! They had the chance to make things better but are allowing thugs to dictate their business.... KEEP BOYCOTTING!!! MAKE THEM PAY!"},{"comment_id":"10154647559481323","commenter_b":"The woman will never listen","commenter_a":"The public are not - a certain part of it are while the majority supports it.","post_message":"\"People aren’t stupid. They may want less immigration – but not at any cost. The stupidity was a referendum campaign that boiled everything down to that one issue. But people don’t think just one thing, they have many views and priorities: when the facts change, they tend to change their minds.\""},{"comment_id":"1556887964609272","commenter_b":"People need to come in our country the right way. Obama wants to flood our country with illegals.","commenter_a":"Poor you Ted Cruz! You and Trump are almost the same thing!! But, there is a little difference! Do you know why Trump is leading the GOP? Because he is white, and you Cruz, you dont, not for the racist republicans! You has been descriminated for them too! You and Trump never will be president of this country!","post_message":"Ted Cruz on illegal immigration: “The federal government is doing a horrible job of securing the border. It’s utterly failing.”"},{"comment_id":"10153482895003908","commenter_b":"Diet is unhealthy less u r a ufc fighter needing to perform at peek potential. Im more ripped than 85% of ufc fighters cause i burn more calories than i ingest..","commenter_a":"Absolutely true!","post_message":"A powerful ad exposes everything that's wrong with the diet industry in just 31 seconds."},{"comment_id":"10153181956571162","commenter_b":"I guess it depends on how you speak to your mother.","commenter_a":"I thought it was great. Normal mom and daughter banter. They are human after all.","post_message":"50 SHADES OF AWKWARD! Dakota Johnson and Melanie Griffith on-camera spat on Oscars red carpet: @webpagelink"},{"comment_id":"10154273166073445","commenter_b":"Justin Ruffino build that wall!","commenter_a":"Hilarious!","post_message":"Role Reversal. Mexicans Are Smuggling American-Grown Weed South of the Border."},{"comment_id":"556876431104063","commenter_b":"Put a cap in her ass :-)","commenter_a":"I'll still bone her! Even with a mangled face! What's the point of the story?\"did you see her legs?","post_message":"The police state: before and after... The Free Thought Project.com (Y)"}]
