[{"comment_id":"550313591806506","commenter_b":"@username stop trying. Your Hillary will not succeed and if she does she will be taken to jail right after.","commenter_a":"NY press trying to destroy Sanders before the primary? Shocker.. Does anyone really trust any of the media outlets these days? I haven't for almost 10 years..","post_message":"This Bernie Sanders interview did not go as planned..."},{"comment_id":"1801403630131591","commenter_b":"WHEN SHE STEALS THE HAITIANS FOR HER DAUGHTER' S WEDDING, GOD SAVE AMERICA !! LOSER CRIMINAL HITLARY Nutjobs!!","commenter_a":"It feels like Hunger games in here with all the trash talks and the media coverage ... May the odds be ever in your favor ma'am","post_message":"Share this if you know someone who needs to see it. hillaryclinton.com/locate"},{"comment_id":"10154200210407411","commenter_b":"She has to pay her daddy","commenter_a":"Why doesn't she sue to stop the pay of the Senators/Representatives who's job it is to pass a balanced budget but who haven't done so in almost two years? It seems highly suspect to punish people who do their job but allow those who are unable to complete their primary assigned task to continue to be paid. Again, politics over people. Sad.","post_message":"Illinois Attorney General Lisa Madigan is seeking to stop state worker pay until legislators and Gov. Bruce Rauner approve a spending plan."},{"comment_id":"10153188976024087","commenter_b":"Ethyl Rosenberg did less and thy fried her in the electric chair!","commenter_a":"Go Hillary , ignore the naysayers , they don't even have a real scandal , crime or violation , ignore the fake media , stay focused on the real issues that Americans truly care about","post_message":"Senior aides to Hillary Clinton will meet with Democratic lawmakers at the Democratic National Committee offices on Thursday to discuss messaging and strategy as the presumptive front-runner's numbers continue to fall."},{"comment_id":"10154980459782235","commenter_b":"I would suspect it was an operation right out of the Kremlin. If so it's an act of war.","commenter_a":"C span has confirmed it happened and operating right now under the theory that it was an internal routing problem on their end. They advised they will update if they find out anything different happened.","post_message":"What the hell just happened?"},{"comment_id":"1048569925162760","commenter_b":"Prenup is what he needs he doesnt need ladies he see's to try and take His money.. IMO she isnt all that but hey if he likes/loves her... I dont care how much money she has.. Prenup is always the best way to go if your famous.","commenter_a":"Focus on getting the super bowl ring 1st please! If you get her a ring you better get a prenup.. just saying..","post_message":"Seahawks quarterback Russell Wilson hinted on The Dan Patrick Show that he and Ciara could soon be engaged. When asked which would come first, Super Bowl ring or engagement ring, Wilson responded, “hopefully both.” Check out training camp photos here >>kiro.tv/SeahawksCamp"},{"comment_id":"888129164543273","commenter_b":"Now before you say.... \"white women do the same things on their shows!!!\"","commenter_a":"Total waste of an article, this list would have certainly dropped down to less than 10 had the writer just said the entire basketball wives franchise, love and hip hop franchise and real housewives etc. instead of going by each show and each city. Dumb","post_message":"‘Sorority Sisters’ Isn’t Alone… 10 Reality Shows That Were A Bad Look For Black Women"}]
