[{"comment_id":"585280771667035","commenter_b":"This photo is liiiiiiiife!!!! :D :D :D","commenter_a":"Brian Rungeling don't you like Trump's new 'Make Russia Great Again'?","post_message":"Alec Baldwin just trolled Trump again by walking around New York City wearing a “Make America Great Again” hat — with the embroidered logo in Russian.  The timing for Baldwin’s hat couldn’t be better, coming as the president-elect sat down with security officials on Friday who told him the Russians helped him win the election — an assertion Trump flatly denies because it would contribute to the belief that his win is suspect having lost by over 3 million in the popular vote."},{"comment_id":"10155955897895354","commenter_b":"The nasty b*tch just wanted attention and guess what? Now everybody is giving it to her.","commenter_a":"For the life of me I will never understand killing these magnificent animals. I just don't understand how it can be wonderful, thrilling, exciting or in any way fulfilling to kill an exotic animal. And then chop it's head off or whatever you do with that giraffe and have it mounted. Makes not one bit of sense let alone any kind of satisfaction.... Just don't get it.STOP IT NOW!!!!","post_message":"This hunter is single-handedly breaking the Internet today.   Check out the photos of her other controversial kills..."},{"comment_id":"10153663698070950","commenter_b":"I am not goin any where...I am a women of God and you need to read your bible,and as far as my gun,i carry it every where i have a permit and the right to carry it","commenter_a":"All of these peoplev are goin to hell if they dont frepnt,And im not giving my gun up for noone,im a responsable gun owner and its my right to carry a gun.....All these gay people need to repent cause he is coming back!!!","post_message":"Motorcyclists, parade-goers march on in L.A. march on during their annual gay pride parade:"},{"comment_id":"10154620452720575","commenter_b":"She should have had a gun!!!!!","commenter_a":"Was it a Muslim?","post_message":"WIFE OF MISSOURI GOVERNOR-ELECT IS ROBBED AT GUNPOINT IN ST. LOUIS!"},{"comment_id":"10155074124493258","commenter_b":"Hold fast against the Turd !","commenter_a":"'A man reaps what he sows.' Galatians 6:7. If you sow hate during the primary and the general election campaign, you reap hate, if you sow discord, you reap discord. #Galatians6","post_message":"‘‘We march today for the moral core of this nation, against which our new president is waging a war,’’ America Ferrera told the crowd at Women's March on Washington."},{"comment_id":"10154343776387061","commenter_b":"'@username , just wait till he is done,The Republican Party!","commenter_a":"He was a great president, didn't help republicans but republicans don't help democrats. I'd like it if people met in the middle more rather than so far right or left. Obama is professional, polite, and articulate none of that fits Trump. And now that the new Trumpism is 'Alternative Facts,' I am concerned.","post_message":"A look inside the Washington, D.C. residence the Obamas are moving to: @webpagelink"},{"comment_id":"1135264553151680","commenter_b":"Only you idiot liberal want these invaders here... Morons","commenter_a":"But who would want to live there? Especially a refugee, who will be treated worse than they treat their own minorities and poor (which is pretty terrible).","post_message":"Fact check."}]
