[{"comment_id":"10155083896191178","commenter_b":"He might bring racist charges up against you","commenter_a":"OK I'm going to say it Everyone is racist OK we get it wahh wahh wahh!","post_message":"The histrionic grumblings for the liberal parodies over at MSNBC are STILL outraged over Sen. Sessions.  Liberals never seem to realize that they've worn out the racism accusation."},{"comment_id":"1229225200430841","commenter_b":"I do agree though a little white girl wouldn't have been thrown to the ground...","commenter_a":"While the student was wrong in her choices to be disruptive, disrespectful, ignorant and arrogant. The officer also was wrong in the amount of force that he exuded on a MINOR. Regardless of the ignorance and attitude shown by this student. I worked in a school and have 6 children of my own. Some children nowadays are extremely difficult to manage and teach. I agree. My own children know better than to even entertain the thought of being disrespectful, they know their behavior has consequences. Not all children are raised in that type of loving environment. That is NO excuse for this child acting like a spoiled brat with a chip on her shoulder who obviously has authority issues. That being said, back to the police officer who felt the need to use his authority and man handle a child. Simply because you're annoyed and irritated that a child defies ...","post_message":"This video taken from inside a South Carolina high school classroom on Monday shows a police officer body slamming a female student and dragging her across a classroom. The chorus of parties angry over the confrontation continues to grow, as the sheriff's department investigates. @webpagelink"},{"comment_id":"10154037346055329","commenter_b":"See bitch William Huybers","commenter_a":"Andria Gamuza Kimberly C Lin","post_message":"ewww...."},{"comment_id":"941291755930573","commenter_b":"Women are just as bad..","commenter_a":"Men are pigs","post_message":"She reported them to police because she said it made her walk to work an 'awful experience'"},{"comment_id":"464672456990682","commenter_b":"Fire her.","commenter_a":"Go to jail and never see the sun again.","post_message":"Do you believe this lady has the right to continue to defy the law?"},{"comment_id":"10153932654413854","commenter_b":"He has cornered the market on STUPID...","commenter_a":"This guy is absolutely INSANE.","post_message":"Obama cites American Revolution as example of Americans being falsely paranoid about gov’t tyranny"},{"comment_id":"10153114659021336","commenter_b":"i just hope she is prosecuted for her crimes, and they let her know she is NOT above the law....she is a disgrace.","commenter_a":"Right on schedule.","post_message":"Let us know your thoughts on Rep. Trey Gowdy asking that Hillary Clinton agree to a transcribed interview over her deleted records and tune in to 'Special Report with Bret Baier' at 6p ET."}]
