[{"comment_id":"657878574399677","commenter_b":"Shame should be heaped on this persons head. Open your mouth and sing HIS praises..not for Trump but to glorify His name. Shame on you lady!! :-(","commenter_a":"The member states that 'she could never throw roses to Hitler' code for she supported Stalin 😉 she's irrelevant...","post_message":"More pre-inauguration insult and upset from progressives — 'I could never sing for him.'"},{"comment_id":"1748972275334787","commenter_b":"Even if the woman was standing to pee, they are inside a stall with the door shut, Us woman don't peek under the stall to watch other woman pee...only pervs do that","commenter_a":"The thing that makes me LAUGH is people have most likely ALREADY shared a bathroom with someone who is trans and didn't even know it!","post_message":"It doesn't make ANY sense…  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"863410587096986","commenter_b":"90% London is full of foreigners, loud mouth rude boys and junkies.","commenter_a":"But london will not make exception for trump","post_message":"London's new mayor will be an 'exception' to his proposed ban on Muslims."},{"comment_id":"10154038010859205","commenter_b":"That's because it turns out she actually is a nasty woman. With a lot to hide.","commenter_a":"Robbie Mook is a terrible liar. Look at that body language!","post_message":"A blog called “True Pundit” said there were reports of Hillary Clinton asking why the government couldn’t just assassinate Julian Assange via drone strike. Hillary Clinton’s denial is less than convincing."},{"comment_id":"10152763354566051","commenter_b":"kill the bitch","commenter_a":"They need to wrap her head completely in duct tape !!","post_message":"When her fiance broke up with her, this woman decided to make his 3-year-old daughter pay."},{"comment_id":"386115264910101","commenter_b":"She needs to die. She would never have gotten any place in this country without white people. I hate that racist trash.","commenter_a":"She sounds like she is mad at the world .","post_message":"Oprah plays the race card again..."},{"comment_id":"537705639687363","commenter_b":"'@username you are wrong ! All the other religions follow AMERICA Laws!! Only Muslims want to bring in their Sharia laws for their JUSTICE , and their law on us and they can't , because Our Constitution, And We As Real American Citizens Will not change our Laws of Justice, for their BARBARIC 7th century murderous, degrading practice!!! Ship you are a bleeding heart Liberal!! Trump is not trying to divide us , He is trying to save this Country from people like you, Hillary, Bernie and that kiss ass Muslim OBAMA!!","commenter_a":"American Muslims are American. Just like American Catholics. Just like American Jews. Just like American Methodists. Just like American Presbyterians. And all the other Americans of various religions. Stop trying to divide us. Trump wants to secure our borders. Why is that wrong? Trump wants to end ILLEGAL immigration. Why is that wrong? Trump wants to verify that legal immigrants are not here to harm our citizens or create havoc. Why is this wrong?","post_message":"This is what American Muslims think about our presidential candidates. You might not be too surprised by what they had to say."}]
