[{"comment_id":"10154530088657908","commenter_b":"Ginny Gruhler Vanderhoof You are a very dishonest person \"Sanders battled over veterans issues as chairman of the Senate Veterans Affairs Committee from 2013 until early this year, giving him an easy pitch to a crucial voting bloc of veterans, particularly in South Carolina where veterans make up more than 11 percent of the voting-aged population. There stiff competition for these voters, with front-runner Hillary Rodham Clinton wooing them this month during a round table in Nevada. Even the leaders of veterans groups who praise Sanders acknowledge that the 73-year-old Democratic socialist isn an obvious champion for the flag-waving set of former military officers and enlistees. When asked if the Veterans of Foreign Wars, which recognized Sanders with its Congressional Award in March, had ever bestowed the honor on a socialist before, the group Washington executive director, Bob Wallace chuckled a bit. . No. No, said Wallace, a man who ...","commenter_a":"Why does Hillary think she can get anything done? We've seen how the congress works now. Even if the Democrats re-take the Senate, we still won't have the radically gerrymandered House until 2020. It will be nothing but stonewalling until then. That and attempts to repeal the ACA are all the GOP reps remember how to do. Plus, they hate her with the fury of a thousand suns. They'll waste all their time and hundreds of millions of taxpayer dollars investigating her for anything they can think of until they can figure out some way to impeach her as well. She's not getting anything done. But if Bernie is the candidate, and he is able to continue to energize his massive voter base, then suddenly we have a shot at taking the entire congress back and getting something done. Bernie will bring far more folks to the polls than Hillary ...","post_message":""},{"comment_id":"991078264282036","commenter_b":"Tom Schmidt I beg to differ !!!!!! She is very much for woman and for men to!!!!!!","commenter_a":"Women let's unite for Hillary. President Hillary.","post_message":"Raising the minimum wage, paid family leave, child care: These aren’t just women’s issues -- they’re also family issues and economic issues."},{"comment_id":"608045926060248","commenter_b":"Try saying dick her dick her. Another girl commented saying it coulda sounded like that. Lol","commenter_a":"I have alexa... She doesnt curse. She bleeps(literally) out inappropriate words in her speech automatically. Idk about this. I'm gonna try it.","post_message":"An innocent request turned awkward real fast! #WSHH"},{"comment_id":"10154405827009170","commenter_b":"Two evil sisters!","commenter_a":"Goofy the fake indian with Chief \"Lie to your face\" Clinton!","post_message":"Lord help us if we have to listen to these two for the next 4-8 years..."},{"comment_id":"10154664283754778","commenter_b":"We can see all the ex cons..right in this thread...","commenter_a":"He would look good in any back alley dumpster","post_message":"\"If I had to bet, I would say to Kalorama or a neighborhood called Mass Ave. Heights.\" Where do you think?"},{"comment_id":"10152931413566491","commenter_b":"Love how in America, its the land of free ONLY if you don't go against the status quo or what's defined as \"normal.\" I'm a straight dude, and guess what? When it comes to gay people, I mind my own business. I support the human right to love, so long as no one is hurt. I just wish minding one's business was actually expressed by the many who love to use it for themselves only.","commenter_a":"Obviously there are a lot of Christians or Islamists or whatever commenting on here with a ton of negativity about this. Being a Christian myself, God does not teach us to hate on people for choosing to marry the same sex. He teaches us to love others amd treat them fairly. Give your head a shake people.","post_message":"After the historic Ireland vote, here's where else gay marriage is legal."},{"comment_id":"1661235427481336","commenter_b":"We need the wall Canada has a wall but i forgot all the famers might lose there free lador","commenter_a":"hahaha... a very accurate comparison! Lol.","post_message":"\"On Feb. 9, we trust New Hampshire Republicans will send 'Biff Trump' back to somewhere — anywhere but on the road to the most important elective office in the United States at a most crucial time for this nation.\""}]
