[{"comment_id":"10152957563376770","commenter_b":"she should have already been locked up!...","commenter_a":"She has helped fuel the fire instead of being unbiased like she is supposed to be.","post_message":"A veteran Baltimore prosecutor is blaming state's attorney Marilyn Mosby for contributing to dramatic spike in violent crime that has gripped the city in the aftermath of the Freddie Gray case."},{"comment_id":"1065627820160413","commenter_b":"I like Hillary because she will help the illegals... Republicans are against illegals claiming 20-30 kids on their tax refunds from other countries, it's on you tube tax refunds for illegals...","commenter_a":"I am voting for @username it is time for woman to take charge. She will accomplish the Mission.....","post_message":"\"To Democrats around the country...I urge you to raise your own voices this year by voting for the person who shares your values and who will fight tirelessly for you and your family. I know, for me, that candidate is Hillary Clinton.\" —Senator Kirsten Gillibrand"},{"comment_id":"10153976625678162","commenter_b":"Zionists let jews die that didn't obey the transfer agreement","commenter_a":"Just shows how much the Zionists have in common with the Nazis. They killed defenceless people and celebrated the murderers. The fact 35,000 Israelis have signed a petition to get the IDF member a medal is astonishing. @webpagelink","post_message":"As a video recording of an Israeli soldier killing a wounded Palestinian in Hebron on Thursday emerged hours after the shooting Israeli government officials and civil society representatives were split in their responses. Some quickly moved to condemn the shooting, while an outspoken group of Israeli leaders applauded the soldier and circulated a counter-theory of self-defense and heroism."},{"comment_id":"10153929141081800","commenter_b":"he's one of the worst lol best...wtf","commenter_a":"Who cares how Obama grew up?!? He's the best president we've had, he's very intelligent, he's done an amazing job considering the racism and obstructionism from the republicans. Carson is mentally challenged and there's something seriously wrong with him. Stop focusing on color and start looking at ability and integrity. Obama towers over Carson in every way.","post_message":"Dr. Ben Carson accuses President Barack Obama of never living the black experience. ►Watch last night's full episode: @webpagelink"},{"comment_id":"736610399801339","commenter_b":"Then vote for Jeb the choice of illegal aliens","commenter_a":"We need Trump to win and not another Bush.","post_message":"I'm running with heart and running to win. It¹s time to unite to defeat Hillary Clinton. Watch:"},{"comment_id":"995263523875544","commenter_b":"And u look like what came out of my anus this morning, except not as attractive...","commenter_a":"Her face looks like the whole butt!","post_message":"Rosie O’Donnell unloads on Donald Trump..."},{"comment_id":"10153811495701316","commenter_b":"God's will & Grace","commenter_a":"Corrine Amin","post_message":"There's a time for everything."}]
