[{"comment_id":"10153200958788837","commenter_b":"?","commenter_a":"That cop needs to be arrested for having an illegal \"agresive breed\"","post_message":"PUPPY THROWN - Local 10's Michael Seiden has the latest on a poor little puppy that was thrown from a passing car right near the North Miami Beach Police Department"},{"comment_id":"10152771526960950","commenter_b":"She didn't tell people to do this so she isn't responsible for what happens. She is only on the show since her older sisters were in the lime light to begin with and then as she got older she got in the light! It's not her fault these girls are dumb af!!! She paid money to get filler in her lips she didn't suck her lips into a bottle!","commenter_a":"I know kids who have done is following that crazy K lead. She should be held responsible if anyone becomes disfigured. Time for a public statement, Kylie.","post_message":"WARNING: Teens who participate in the #KylieJennerLipChallenge by suctioning their lips with a bottle or jar could be left permanently disfigured or deformed, doctors say."},{"comment_id":"10153247400764614","commenter_b":"It's everyone's BUSINESS to make sure people like this Dispicable mother is prosecuted to the MAX extent.","commenter_a":"Mind your own god dam business people","post_message":"Disturbing video captures a woman hitting a crying 3-year-old in the face with what appears to be a tablet in a Victorville parking lot.  A man decided to film the woman, identified by police as 39-year-old Yvonne Camargo, after allegedly seeing her pull the child out of a Khol store by his hair.  The boy was examined for injuries by a sheriff deputy and officials plan to submit the case to the DA office.  Read KTLA story here: @webpagelink"},{"comment_id":"10153574207499641","commenter_b":"And they are mostly Muslims !!","commenter_a":"that's because indians are breeding like rats","post_message":"If every candidate were granted an interview, the hiring process could take four years to complete, officials said."},{"comment_id":"782996508468592","commenter_b":"@username You know nothing fool.","commenter_a":"U.S. Attorney General Loretta Lynch is an idiot. Her and the Obama Gang are clearly violating the US Constitution and disregarding the rights and safety concerns of women and children. She should be hauled into congress for questioning.","post_message":"Just in: U.S. Attorney General Loretta Lynch announces that the Justice Department is suing North Carolina over bathroom law. \"This action is about a great deal more than bathrooms.\" @webpagelink"},{"comment_id":"10153613146758812","commenter_b":"I am Latino and I vote.....however I am against these liberals and the way they are destroying this country I am against illegal immigration it hurts this country especially on the local level these people get benefits like food stamps welfare....this is not acceptable for you to come into the country illegally and ride tax payers backs....","commenter_a":"Trump all the way..pitbull","post_message":"The rapper called Donald Trump out at Premios Juventad, the Spanish-language awards show that aired Thursday on Univision: abcn.ws/1KcBbra"},{"comment_id":"10153525353934170","commenter_b":"Hillary Rodham Clinton: Not qualified to clean my toilet.","commenter_a":"That picture looks like she has an empty head. Oh! That's Hillary Clinton! !!!","post_message":"CNN asks Hillary about tax policy, spending, the collapse of Greece, the Iran nuclear deal, the future of ObamaCare . . . just kidding! They didn't ask about any of this. They wasted almost the entire interview on trivial nonsense. The VIDEO will have you shaking your head."}]
