[{"comment_id":"953377128015374","commenter_b":"Should if ate a snickers","commenter_a":"Of course it has gone viral.","post_message":"A 21-year-old was charged with beating her so-called friend unconscious over a hamburger. (Graphic warning: Video includes fight)>> kiro.tv/HamburgerBeating “I’m more hurt emotionally than physically.\""},{"comment_id":"550313591806506","commenter_b":"@username stop trying. Your Hillary will not succeed and if she does she will be taken to jail right after.","commenter_a":"NY press trying to destroy Sanders before the primary? Shocker.. Does anyone really trust any of the media outlets these days? I haven't for almost 10 years..","post_message":"This Bernie Sanders interview did not go as planned..."},{"comment_id":"547147818822562","commenter_b":"Get rid of every illegal man woman or child then start the legal process maybe this country will fall back together after that","commenter_a":"Buddy, you are so far behind the curve by now, I'm not sure you can hear me shouting backwards. We're past issues of legality. We're past party lines. We're into basic human dignity and the essential morality of how human beings treat each other. Black lists, registration lists, and round ups and mass deportations are all tools of countries where the rule of law has broken down and democratically designed processes have failed - BY DEFINITION. Yes, illegal immigration is a huge issue and yes, there should be systems in place to allow due process of law to happen based on merit and compassion. Targeting entire groups of people and refusing to treat each person as an individual in assessing their rights and needs is the antithesis of our stated democratic ideal. So this mayor speaking out in defiance of the tools of mass oppression is an act of heroism. ...","post_message":"\"This is New York. We are always New York.\""},{"comment_id":"10153014667776955","commenter_b":"I lived in NY, not the first blizzard or the last...whats different now is the libtards have forced energy production to stagnate or decline while the population increased - aka people are going to freeze to death in their own homes. This is just nature being nature. Lets not make something out of nothing.","commenter_a":"Good place for it.","post_message":"BLIZZARD WATCH NYC, BOSTON HISTORIC"},{"comment_id":"10154169792132629","commenter_b":"@username bye bitch","commenter_a":"BernieOrBust! We are giving the people in the remaining states the opportunity to make the right choice! This is not a threat, its promise! Thanks to social media we are constantly talking to each other, organizing and planning our next steps! The bigger picture doesn't have the Democratic Party playing a role if they are adamant about representing the 1%! Those of us who are Bernie or bust have no party loyalties! We don't care about what happens to the party if they don't care about us in the primary! It's just that simple Trump does not scare us. We plan to vote a bunch of Progressive's in the House to block his agenda, but Hillary scares us more! The ultrarich neocons in the right wing love her and hate Trump! That's a problem! She will get a lot of center right policies signed into law! And we will never ...","post_message":"Hillary Clinton won no delegates, because Washington Democrats already awarded them based on party caucuses in March."},{"comment_id":"10155192232363984","commenter_b":"Amen. These Thugs are going Down.","commenter_a":"Thank you Mr. President Donald Trump. I hand it to you for everything your doing for this country and everything your about to do. It's about time we got a president who's looking after his own country first. GOD BLESS you President Trump. Trump train full speed ahead.","post_message":"That didn't take long. This says everything about Donald Trump's presidency..."},{"comment_id":"475959349195637","commenter_b":"@username BITTER GAY HATER!!!","commenter_a":"@username 2016!","post_message":"Tony Perkins Rallying Iowans for Ted Cruz: @webpagelink"}]
