[{"comment_id":"1011632632284104","commenter_b":"yall nasty","commenter_a":"Emmanuel Esquivel @username","post_message":""},{"comment_id":"10154734525598812","commenter_b":"@T Elliot Cato. The Trump clan is made up of deluded folks. Please let them be...case is chronic!","commenter_a":"Why do Trump supporters keep believing the lies and conspiracy theories?","post_message":"NEW: The FBI expected to release Hillary Clinton interview notes and case documents in the coming days."},{"comment_id":"465186890273018","commenter_b":"This....this is brilliant lol","commenter_a":"No this nation was bast of God an build around it get it right dumbass","post_message":"The Anti-Media radio show is live at NOW! Listen from your computer or phone here: www.UCY.tv/TAMR  Call in and join the conversation: 1-718-717-8296  via Murica Today"},{"comment_id":"1386644204686259","commenter_b":"It's all geared for her to win. She knows this. The corruptness is too great and the winner will be whomever bows to the big $. Sanders and Trump won't do it but she does and will continue to do so.","commenter_a":"And, that a$$hat in the photo has never accomplished a thing worth mentioning.","post_message":""},{"comment_id":"10153734549101323","commenter_b":"Fucking Liberal fucks! Feminist whores! Leave Star Wars alone!","commenter_a":"I'm not sure whether the viewer would have got the right impression of Jabba if instead of enslaving Leia he'd have given her a thatcheresque power suit and asked for her opinion on current affairs!","post_message":"It's one of the most memorable, weird, gross and resonant moments from The Return of the Jedi, and from Star Wars in general – and Disney is working to disavow it."},{"comment_id":"10154433105394087","commenter_b":"I'm an independent, but republicans are completely full of shit. And they don't mind the smell. Their platform is based on racial deportation.","commenter_a":"100% TRUTH","post_message":"\"Unless more leaders in the black church recognize that blindly supporting one party, which has done nothing to earn that support, is not benefiting those that they serve, the church will continue to lose its political influence.\""},{"comment_id":"746903725500205","commenter_b":"she is a disgarce and should be reprimanded so should cbs and the nfl they truly are responsible for giving this racist cop hating person a platform in which she was able to spread hate and racism","commenter_a":"YES.","post_message":"Congressman Absolutely Unloads On Beyonce For Vile Halftime Show  She completely overstepped her boundaries.  Do you agree with this Congressman?"}]
