[{"comment_id":"487132828135264","commenter_b":"What? the lying lame are going to teach other people to be perverts? Really","commenter_a":"OMG!","post_message":"Goooooood Moooooorrning!!"},{"comment_id":"10152783958260667","commenter_b":"You need to wake up lady !","commenter_a":"They are not public property. They are her private emails. You are all so crazy about your rights but not anyone else's. They were on a private server that had more security than her work emails. You need to take a cold shower.","post_message":"Looks like those who want a look at Hillary Clinton's emails have a long wait ahead of them."},{"comment_id":"487880261407401","commenter_b":"He got her ass good","commenter_a":"@username bruhhh lol","post_message":"Barack Obama just hilariously roasted Bernie Sanders and Hillary Clinton. #WHCD"},{"comment_id":"719584654846906","commenter_b":"LOL, OH LET HER, SHE'S THE CRIMINAL, DO YOU LIVE UNDER A ROCK?","commenter_a":"Con-man-Don, \"The Conald\", just a Common Carpet Bagger wanting to benefit from the ruin he would inflict on America. @username needs to call him to the carpet and allow the Criminal Justice system have their way with him.","post_message":"Donald Trump has painted a dark, divisive picture of America. We have 102 days to stop him from becoming president."},{"comment_id":"1850200075215990","commenter_b":"@username and ur moms va jj. And i was being sarcastic you simpleton","commenter_a":"No roof? Im telling you this is deeper than you all realize. Doesnt add up. Id evacuate","post_message":"Chopper 6 was over the foam spill and hazmat situation in Center City around Juniper and Lombard. The foam spilled from a fire supression system at PECO substation. More information: @webpagelink"},{"comment_id":"1552829708351782","commenter_b":"Nor do any of you have the full story like I do, so please don't speculate on what you don't know.","commenter_a":"in this day and age, a woman shouldn't lose her life during childbirth, I surely hope there is a huge investigation","post_message":"He was at the wake for his wife and 5-day-old baby when he got word that his sister had lost her battle with cancer. Many of you saw the heartbreaking story on NewsCenter 5 and have asked, “How can I help?” Here’s how: @webpagelink"},{"comment_id":"1099350153419328","commenter_b":"Wtf😱 she's going to be a double hoe😜","commenter_a":"Madisan","post_message":"A YouTube star recently revealed that she was born with two vaginas. Check out the interview here:"}]
