[{"comment_id":"10153134315811336","commenter_b":"I don't believe a word she says along with that piece of trash ruining our country.","commenter_a":"Would that be illegal voters or the type that is human scum?","post_message":"Clinton's goal, according to two people close to her organization, is to make her second run for The White House more about voters and less about herself."},{"comment_id":"559222970918198","commenter_b":"#WomenForTrump","commenter_a":"Wow, I worked for two presidential campaigns, also as a journalist covering campaigns and in the White House. If I had a dollar for every time I was pushed, grabbed or shoved. Campaign events are feeding frenzies, if you're a reporter covering a campaign event and you don't get pushed around a lot, literally, then you're not cut out for the job. It's par for the course! Thousands of people show up at campaign events and everyone is pushing and shoving to get a piece of the candidate and their staff has a duty to protect the candidate. I was in the White House in the Oval Office with the press pool one time and an aide or SS agent pushed me after I got too close to then Vice President Dick Cheney. It never even crossed my mind to file assault charges. If you watch the video, you can ...","post_message":"\"The culture of this campaign is – as Mr. Trump mentioned from the very beginning – it's not politically correct, and sometimes telling the truth inherently is belligerent.\" Trump campaign spokesperson Katrina Pierson defended campaign manager Corey Lewandowski, saying the incident \"is a '#NeverTrump' idea.\""},{"comment_id":"1570942919862279","commenter_b":"@username how about keeping your dick in your pants if all you men are going to do is walk away.....","commenter_a":"58 million human babies have been victims of abortion in the past 43 years since Roe vs Wade legalized abortion through all 9 months of pregnancy. Science has proven that life begins at conception. Social injustices continue such as poverty, hunger, underemployment, and child abuse has actually increased. Killing innocent life has not and will not solve these problems. Women and men suffer terrible regret for a decision that can never be reversed. They need real help and healing. The website hopeafterabortion.com offers loving help to post abortive women. Prolife Pregnancy Care Centers offer free nonjudgmental, loving support whether a woman decides to give birth or abort. So many women have been exploited and even died due to abortion. Abortionists get rich killing babies. Planned parenthood is the largest abortion provider in the United States. They do not provide any prenatal care or even mammograms. None of their services are ...","post_message":"\"Only when America chooses, remembers, and restores her respect for life will we rediscover our moral bearings and truly find our way,\" Rand Paul said."},{"comment_id":"1060076290679393","commenter_b":"I believe you! Just saying IMF found some crazy monetary practices. Matching 8% would create a crazily unsustainable and unattainable and unrealistic economic goal. We had our state government promise such riches for a 20 year period to public employees and it's not a practice followed and linger because we have had to fund that same crazy generosity despite economic ups and downs. This created alot of resentment as courts say we must continue to fund these government employees who gave themselves this great pension!","commenter_a":"This is just like Greece, nepotism, expensive payrolls and pensions created to benefit a few individuals and their families while real public needs are neglected...this is the opposite of socialism @username","post_message":"The budget crisis faced by Illinois is dire - the state government itself is drowning in $37 billion of debt. Read more: @webpagelink via Special Reports"},{"comment_id":"10153698942976350","commenter_b":"Not everyone has reconstruction surgery. It is hard to find a bra that holds the prosthetic breast without it going sideways so you end up looking off. I opt for a sports bra most days as I have one breast.","commenter_a":"I love Stella!","post_message":"\"We wanted to bring something feminine and beautiful into a bra that is taboo.\""},{"comment_id":"10154600060589641","commenter_b":"Because you never listen properly. Listen closely and you will learn. Building a wall. ..you got it right. That's one policy. it has to do with immigration. That's very big. Walls keep people and things out or in. Keep illegals out. Citizens, can now get the jobs the illegals had and spend that money in their country , instead of it being spent in another country. That's one in a nutshell. That is an economic principal. And it's a big one. It has a trickle down effect. There are many more policies that he has articulated. Learn them a2live.","commenter_a":"I am not an American, but I have one question to the Trump Supporters who thinks that CNN is bias... What Plans does Trump has to make America Great Again? Because since I started following the primaries to the last debate the one thing that I have ever heard from this Man is Building the Wall at the borders. The rest of the things from economy to foreign policies he says we are going to figure that out. By the way he says it is not good to give your agenda to your competitors. Is that the bases under which Donald is going to make America great again? Leaders are voted for their ideas and policies, how much healthcare they can provide, how much education they can give, what can they do with the GDP, etc. but this man knows just nothing. Shame to the Trump supporters!!! I would disowned ...","post_message":"Hillary Clinton: \"What we want to do is replenish the Social Security trust fund...\" Donald J. Trump: \"Such a nasty woman.\""},{"comment_id":"10155169202635231","commenter_b":"You're rare Theresa -- women don't think this way.","commenter_a":"Wow, he couldn't just get married to a good woman???? He could've gotten it for the rest of his life...but that's how crazy some men are. Go figure!!!","post_message":"Warren Sapp paid some $600 for oral sex, which he allegedly taped using his cellphone camera."}]
