[{"comment_id":"10153679672384586","commenter_b":"Cunts","commenter_a":"Aaron Andrew Bantoft this made me physically cry","post_message":"Imagine being alive for just ONE day... And then THIS happens, just because you were born male :("},{"comment_id":"10153536148652426","commenter_b":"That's sad! Lawyers can find many ways of getting people out of trouble. Bet the girl didn't show remorse or learn an important lesson.","commenter_a":"Ok, fine people for smoking around children. Then let's raise the fines for texting and driving and add fines for talking and driving. These fines can be used to further aid in our children's education. But most important-people can use their lessons they learned in driver's ed such as using a turn signal and stopping at a stop sign.","post_message":"Should smokers be fined for smoking in cars with kids? A - Yes B - No"},{"comment_id":"10153470522401545","commenter_b":"I totally agree. It won't happen because it generates big money. A bunch of sick people","commenter_a":"And Porn is still accepted & allowed in our country & world ?!?! Porn is a horrible addiction causing harm to others. I want our elected officials to get porn out of our lives forever !","post_message":"In police documents obtained by WFAA, school bus driver Leonard Bradford told investigators he swam in a public pool with 40 to 60 children in the summers of 2014 and 2015. According to police, Bradford admitted to investigators that he purposefully rubbed his genitals on five girls."},{"comment_id":"1218654931501590","commenter_b":"Amen!","commenter_a":"It might have something to do with the fact that they make veteran Officers from other agencies retake the academy if they try to switch to their Department.","post_message":"10News' Phil Buck digging deeper to find out how Hillsborough County Sheriff's Office is still working to keep you safe in spite of deputy shortage @webpagelink"},{"comment_id":"10153323760987994","commenter_b":"They are puppy mill dogs. They over breed these poor dogs and none of them ever see a vet...so the puppies are that are born are just as unhealthy....","commenter_a":"I purchased two kittens from there and 1 died within 24hrs, they told me \"bring it back and I'll replace it\", they gave me another one and it died 2 days later along with the other one","post_message":"A Mount Clemens pet store is being sued by nearly a dozen customers."},{"comment_id":"10154467163611051","commenter_b":"Madonna this is a women who invaded her on body with a cross,scum is all i can say ,yes she should be in jail","commenter_a":"trump does not have moral privilege to call anyone an ugly name, since he owns every ugly name one can muster to describe his repugnant behavior. Madonna does not come close to the names lying trump has called President Obama. Madonna \"tells it like it is\" and that is too much for Right wing nut bags.","post_message":"Donald Trump says he has only one word to describe Madonna."},{"comment_id":"1031214057011772","commenter_b":"Keeps women from cheating lmao","commenter_a":"So, she wants to be registered, heavily taxed, and locked up at night?","post_message":"Pure gold..."}]
