[{"comment_id":"1186097424786988","commenter_b":"Hillary you're a smart women have faith and be strong you is next President Trump dangerous","commenter_a":"Hillary, you will be a great President.","post_message":"Here’s the sad truth: There is no other Donald Trump. This is it."},{"comment_id":"10154666136846833","commenter_b":"I'm thankful there isn't enough police to stop all crime! Because then we would be living in a police state!","commenter_a":"There is one more Woman who Had a gun to protect her Family, but a lot of Americans who will never be Able to protect there Family's for not owning a Gun. They live in a elusion of Safety that the Police have enough manpower to Protect them. Unfortunate there will never be enough Law enforce Officers to protect everyone. It is up to you to Protect yourself as much as possible.","post_message":"If three intruders break into your home and hold your spouse at gunpoint, what would you do? This Florida woman was faced with that dire scenario last week. Thankfully, she was able to run to the bedroom and grab her own firearm to end the ordeal and save her husband."},{"comment_id":"10153202654871107","commenter_b":"Deport all 30M illegal aliens.","commenter_a":"This makes me so angery that our government cant even enforce laws already there, time to replace everyone of our politicians for not doing their jobs and getting caught up with deal making, sick ,sick of it, PUT MORE INS AGENTS ON THE JOB AND GET ALL OF THE ILLEGALS OUT NOW!! and may I add i'm sick of politicians asking for money to do their jobs this includes you Mr. @username!!","post_message":"Our nation now has whole cities and states who stand up and willingly defy federal immigration laws in order to protect illegal immigrants who have broken our nation’s laws. This must end and it must end now. Today, I introduced legislation in U.S. Senate that would cut federal funding to cities and states who refuse to follow our immigration laws. My bill makes it clear, the American people will not stand for cities harboring violent criminals. But I need to know if you are with me. Please sign your \"Enforce Immigration Law\" petition right away, then consider chipping in $20.16 or more to help me spread my message to voters in early primary states."},{"comment_id":"10154008998213797","commenter_b":"Whites wouldn't understand discrimination lol you sound stupid how about the jews they were white how about the Irish when they came to America they were white what about any German that came over after ww2 they were white now tell me again how ur comments are relevant","commenter_a":"It's not like she labeled their ticket with racial slurs. I guess I don't see what the big deal is. If the waitress had put \"white couple\" on a ticket, no one would care.","post_message":"WAITRESS LABELS CUSTOMERS: Kimberli Wilson went out to eat, and when the bill came, she couldn't believe what was written at the top. The waitress labeled her table by race. Here's what happened when she confronted the manager:"},{"comment_id":"10154624417173010","commenter_b":"Water board this bitch daily then drown her","commenter_a":"Sorry. 21 years is not long enough. That baby is missing out on 80 or so years of Life. Dad is Missing out on 60 years with His son. That is NOT justice for that baby. I don't believe in an afterlife, but hers would Be incredibly cruel And dark.","post_message":"When the boy regained consciousness, she called the child's father to ask him to give up his custody rights. When he said no, she once again held the toddler's head underwater until he died, prosecutors said."},{"comment_id":"10153254451090671","commenter_b":"and that's why you women are pathetic ladies should not twist my words around","commenter_a":"most women are less productive as far as in the construction field is concerned but in the construction field I think they are paid the same I don't like working with women every time I do I have to work harder just to keep the same production schedule going","post_message":"Under the new law, an employer must show the “differences in wages are due to factors other than gender, that the factor is job related and reasonable and that these factors, rather than discrimination, account for the difference in pay.”"},{"comment_id":"10154025018063812","commenter_b":"Haha ahhaha he started a few months early than G! We'll see u there chap!","commenter_a":"@username look at georgie's bf!","post_message":"Prince George attends his first day of nursery school: @webpagelink"}]
