[{"comment_id":"1342320752468340","commenter_b":"Happy to see a change in the Mayor's house! See ya!","commenter_a":"if first lady gets this, what can common man expect,...","post_message":"The mayor said she was merely expressing happiness for \"change in the White House.\""},{"comment_id":"10157704194035725","commenter_b":"MAKE SURE SHE HAS NO EAR PIECE IN HER EAR.","commenter_a":"Great show this morning!","post_message":"I am truly honored and grateful for receiving SO much support from these military leaders -- American heroes -- who have defended our freedoms. THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"},{"comment_id":"10153605570044205","commenter_b":"I held the door for a woman once and she said \" What you think I can't open my own door?\" Aaaaaaaannnnndddd I quit opening doors for women","commenter_a":"Also this bitch is a joke... i live in texas and shes just a narrowed minded republican raised by republicans... look how much make up she has on... lets guess what she cares about. Gtfo with your nonsense... and dont talk about men not holding doors for girls.... you women killed it. Hardly anyone says thank you... you are basically expecting it but not acknowledging it. So we took it away. Bitches always pointing the finger at men like we are always in the wrong. No fuck you.","post_message":"Alexis Bloomer has taken to social media to give a speech on why her generation is so self-centered."},{"comment_id":"10153179690136523","commenter_b":"So that one example involving you makes you come to the idea that lots of females lie..? And the proper way to handle that situation would be to go to the authorities and let them deal with it.","commenter_a":"Lots of girls lie about that stuff it happened to one of me old friends the bitch said he raped her be he really didn't there's lots of girls out there that's are like that","post_message":"19-year-old Owen Labrie, a former student at the elite St. Paul's School, appeared shaken as the verdict was read, at one point nodding his head and reaching for a tissue to wipe tears. At the time of the assault, the accuser was 15 and Labrie was an 18-year-old senior."},{"comment_id":"1232264963481332","commenter_b":"@username, you should read up on the case! It doesn't look good and she's only after what Trump would consider pocket change.","commenter_a":"Wait, Wait, Trump claims he never sexually assaulted anyone, \"I only spoke words, Bill acted\". but Bill was charged and cleared and Trump has been charged. Also, he is being charged with Raping a 13 year old girl. And I don't want to hear from Trump supporters that he \"innocent until proven Guilty\" because every single charge they've made against Hillary, she has not been proven guilty of.","post_message":"WOW. Trump has a lot of explaining to do... in federal court."},{"comment_id":"10153916819542426","commenter_b":"How about what Democrat Bill Clinton did for the black people? And how about Hillary supporting his bill and explaining that black people are \"super predators\"? Now we have a problem with unemployment. People are fighting for jobs, and Obama and Clinton want to allow THOUSANDS of immigants in our country to expand the fight over jobs. Illegal Mexicans are being hired before you or I because they are cheaper. Democrats have done none of you any favors.","commenter_a":"Truth. What gets me is that the Dems get elected in these cities then the voters blame Republicans for holding them back. How can someone you did not elect to run your city have any power to hold you back?","post_message":"\"You're living in poverty, your schools are no good, 58% of your youth are unemployed -- what the hell do you have to lose?\""},{"comment_id":"1387016887980986","commenter_b":"Oh yeah. AMERICANS have to folllow all the rules, but illegals can do just as they damn please. Right? Poppycock.","commenter_a":"Fuck u Cicala !!!","post_message":"Sportscaster on Female Attacked by Democrat Mob: She Was Asking for It by Wearing Trump Jersey!"}]
