[{"comment_id":"10153737493874705","commenter_b":"Up Scumbag!","commenter_a":"But who won between Scumbag and Footlights?","post_message":"Oh, wow."},{"comment_id":"745552312280553","commenter_b":"Racism 101. Get rid of free soeech","commenter_a":"Make America Great Again","post_message":"Is this still AMERICA?!"},{"comment_id":"10150798110624999","commenter_b":"@username, the Constitution says nothing about corporations having the same rights as The People, either.","commenter_a":"The constitution says nothing about abortion","post_message":"Oklahoma lawmakers have voted to ban virtually all abortions. That's flatly unconstitutional, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"1725568321015816","commenter_b":"I see lots of people who are saying \"see a wall won't help..\" Well the truth is the government doesn't give a crap about drugs coming into this country. They will make their money off addicts and death and jail time. What the government won't make money off of is illegal immigrants not paying taxes. That's the only reason for the wall. The government just wants their cut.","commenter_a":"Nick Cal","post_message":"800-yard-long tunnel found between Mexico and San Diego containing 1 ton of cocaine and 7 tons of marijuana. It's believed to be the longest cross-border tunnel ever discovered. @webpagelink"},{"comment_id":"1673236709627945","commenter_b":"I can't stand this big eared liar!","commenter_a":"Bull crap! You say that federal background checks don't work when it relates to gun control but when it relates to checking refugees you say it does so apparently it only works when you are telling the public lies to get what you want = pitiful","post_message":"\"Any refugee coming to the United States, some of them victims of terrorism themselves, will continue to get the most intensive scrutiny of any arrival.\"  After meeting with his national security team, President Barack Obama said that \"our intelligence and counterterrorism professionals do not have any specific and credible information about an attack on the homeland,\" but that \"we have to be vigilant.\""},{"comment_id":"1254290281276196","commenter_b":"He prefers giving the jobs to refugees and Muslims what a POS","commenter_a":"What is he on Obama didn't do anything to create jobs","post_message":"Yesterday, news swept the nation about the amazing feat President-elect Donald Trump was able to accomplish before even taking office. Trump, along with Vice President-elect Mike Pence, forged a deal with Carrier, keeping 1,000 jobs in the US. However, not everyone is taking the news quite so well, and none other than the current president and his administration had a sickening response.  @webpagelink"},{"comment_id":"10153288097452629","commenter_b":"Hmmm. But I'm mixed so do I only get 5% off?","commenter_a":"Ariel help the world is blind","post_message":"If you love BBQ (and you're white), June 11th is your lucky day."}]
