[{"comment_id":"10158240785950641","commenter_b":"LETS GO BACK TO ..WHEN AMERICA WAS WHITE","commenter_a":"I love president Trump","post_message":"Happening Now: Judge Jeanine Pirro delivers remarks at #CPAC2017."},{"comment_id":"462985670577219","commenter_b":"I'm not pro 15, but we need to realize automation would have occurred with or without a min wage hike anyway. This just hastened it. The problem is most jobs can be made automated including yours too. I don't support give intervention but when pharmacists and construction workers find themselves out of jobs there made need to be some government regulation saying no to so much automation in the future. Human labor being supplemented by robots is not only a minimum wage concern, but one for everyone.","commenter_a":"They got what they wanted, you can't blame Wendy's. Or Wendy's could change the \"Dollar menu\" and make it \"Five dollar menu\" then maybe they could afford to keep all the help, but then nobody could afford to eat out. Oh well","post_message":"Congratulations, Democrats! Your push for a $15.00 an hour minimum wage has resulted in the destruction of Wendy's jobs at 6,000 stores!    \"...we work to offset any impacts of future wage inflation through technology initiatives,\" said Wendy's."},{"comment_id":"10153876614269024","commenter_b":"Kick this fucker right in the mouth","commenter_a":"What a poor excuse for a Mayor.","post_message":"@conservativebyt"},{"comment_id":"1292836000742177","commenter_b":"Let her out permanently.She will be a bad influence to our children.","commenter_a":"Good!","post_message":""},{"comment_id":"1552075435096764","commenter_b":"She is the queen of lies! Talk about incoherence!","commenter_a":"POT CALLING THE KETTLE..........(hiding fear and jealousy)","post_message":"Hillary Clinton went after Donald Trump's ideas, calling them \"dangerously incoherent\" and a \"series of bizarre rants, personal feuds, and outright lies.\" What do you think?"},{"comment_id":"693090104129406","commenter_b":"she is a fraud... she was a mecanic in a motor pool","commenter_a":"You go girl!!!","post_message":"One way activists in the United States are supporting an end to poaching is by enlisting retired vets to take part in an organization that puts their years of combat training to work overseas."},{"comment_id":"1064458436973745","commenter_b":"FIRE HIS ASS !","commenter_a":"Fox should remove shep ,,,,he was absolutely rude because he only wanted his views to be discussed, Time to go,,,,","post_message":"Many are Calling for Shepard Smith to be FIRED After What he Just did ON AIR... @webpagelink"}]
