[{"comment_id":"1871395319625852","commenter_b":"I can totally see her talking to the Queens of other countries not clomping around scowling at everyone that is pretty","commenter_a":"For a GOP Super Pac to do this to a presidential candidate's wife and family is inexcusable and wicked as hell. Look at her TODAY. She will be the most glamorous and classy first lady yet and envy of the nations.","post_message":""},{"comment_id":"950475968345485","commenter_b":"she is fuking fat end off...","commenter_a":"I'm sorry, but fat people are NOT hot, sexy, or beautiful. Just ask a obese persons heart how healthy it is.","post_message":"'I want to challenge society's perception of beauty' - Tess Holliday"},{"comment_id":"10155028895888010","commenter_b":"@username this isn't a Democracy. It's a Constitutional Republic. BIG difference.","commenter_a":"I think the LA Times is confused. There is a difference between an attack and a response to an attack. I'm not saying Trump never attacks people...I know he does. But several times now I've seen Trump's responses described as attacks (ie Meryl Streep).","post_message":"The president-elect was responding to criticism."},{"comment_id":"10158515262905725","commenter_b":"Gomez u bitch u","commenter_a":"fukin who're","post_message":"All eyes were on Melania as she stepped into the ballroom."},{"comment_id":"1212661252101912","commenter_b":"Lmfao bitch","commenter_a":"@username and you can't even do 5 seconds LOL","post_message":"A policeman just planked for 8 hours and broke the Guinness World Record."},{"comment_id":"10150863474824999","commenter_b":"As opposed to when exactly? When was this glorious period of time when everyone spoke the truth?","commenter_a":"the problem these days we do not know who or what to believe, everyone seems to have their own agenda and telling lies is at the top of their agendas.","post_message":"\"Few other countries go to such lengths to deliberately inflict suffering on people seeking safety and freedom.\""},{"comment_id":"10155070444570603","commenter_b":"This disease is curable with treatment. If she puts it off she will die. Just as an abortion her parents still have the right to choose life for their child.","commenter_a":"This is crazy!","post_message":"UPDATE: Cassandra was diagnosed with Hodgkin Lymphoma in September. For three weeks she was getting chemotherapy, but then changed her mind and decided she didn't want it."}]
