[{"comment_id":"1172494429493450","commenter_b":"These dumbasses should be ashamed ... No one will ever vote for either of these liars again . No Honor ..No Vote","commenter_a":"These three men will never get my vote in the future. Anyone that is with her is corrupt... Republican or not you need to go.","post_message":"GOP 'Never Trump' Candidates get a Warning"},{"comment_id":"1221087354570479","commenter_b":"It is French and Spanish ancestries some of the women probably do have more hair than the guys... I should know I was one pretty hairy teenage girl growing up in New Orleans!","commenter_a":"school board has a policy that does not allow any facial hair on male students, Tangipahoa Parish school superintendent Mark Kolwe told ABC News. So female students can have facial hair? Seems sexist to me.","post_message":"The school told all students with facial hair that they had to shave before the ceremony, but the rule was not enforced during the school year."},{"comment_id":"1068655089908149","commenter_b":"Beautiful!","commenter_a":"Beautiful!!!","post_message":"Happy 24th anniversary, Barack Obama and Michelle Obama! Here's a look back at the First Couple's sweetest moments."},{"comment_id":"415868471934780","commenter_b":"as soon as they put one foot on our soil we must be ready to drop bombs on them.","commenter_a":"I am ready for them arats.","post_message":"They're here!!"},{"comment_id":"1386644204686259","commenter_b":"It's all geared for her to win. She knows this. The corruptness is too great and the winner will be whomever bows to the big $. Sanders and Trump won't do it but she does and will continue to do so.","commenter_a":"And, that a$$hat in the photo has never accomplished a thing worth mentioning.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10155007132753431","commenter_b":"Wicked Witch of the East.","commenter_a":"It's not about popularity. It's about decency and common sense!","post_message":"DeVos gave no sign that she had reservations about withdrawing key guidance for transgender students."},{"comment_id":"10154486543656037","commenter_b":"Hillary has deceived all of u!!' Rosanna, this is what she wants. You're just as disgusting as her😎😎😎","commenter_a":"Trump has been saying the system aka Democraps is Rigged. I guess they gonna start saying build a wall next lol copy cat libtards!","post_message":"Elizabeth Warren: 'The system is rigged, and Donald J. Trump would make it worse.' @webpagelink"}]
