[{"comment_id":"10155610147785389","commenter_b":"Maybe we all need too draw more Cartoons/dont like it leave our Country.If we went to there Muslin Country they cut your head off are take your body parts for opening your mouth,so i think we all need too fight back too these ugly Muslin who think they are going too rule America and kill us for nothing.All they are Communist and they are brought in too our Country too destroy ,let them destroy there own.Lock these borders and stop letting them build camps too close too us.","commenter_a":"The Lamestream media are sell outs to this great Republic, and therefore deserve nothing but disdain from all true patriots.","post_message":"Question of the Day: Is the mainstream media wrong for criticizing Pamela Geller, instead of the radical Islamists?"},{"comment_id":"964264026942026","commenter_b":"I luv u tooo bitch","commenter_a":"That is fucked Up... But so entertaining...","post_message":"Details → @webpagelink Police The Police (Y)"},{"comment_id":"1270965036267418","commenter_b":"This poor dear is fighting an incurable disease and still want's to see American go back to being a great Nation again. Hillary keep you porn star and all the other jokers you can muster up. Melissa never give up dear, God can do miracles. Thanks for being a strong and down to earth women, unlike Hillary's choice of women.","commenter_a":"Rick Webb","post_message":"Former Miss Wisconsin USA Melissa Young, who is battling an incurable and fatal condition, said a note from Donald J. Trump in her darkest days reminded her that \"my purpose is to fight and I need to get up and fight.\""},{"comment_id":"10153136284189607","commenter_b":"She should resign","commenter_a":"Good! now don't run for anything else","post_message":"#BREAKING: Baltimore Mayor Stephanie Rawlings-Blake will not seek re-election, a spokesperson confirmed. Her 10AM press conference will air on FOX45 and will stream online here: @webpagelink"},{"comment_id":"10154128572736378","commenter_b":"Shouldn't they have to go back home before mommy and daddy lock the basement door","commenter_a":"Wonder if they voted?","post_message":"#BREAKING - Hundreds of protesters are marching through Center City, Philadelphia tonight, near City Hall. They are unhappy with Donald Trump's election. Many of these protesters are local college students, others say they are supporters of former democratic presidential candidate Bernie Sanders. @webpagelink"},{"comment_id":"10152784811780927","commenter_b":"Why give a s**t? You act like he is relevant!","commenter_a":"Why do we care what he thinks?","post_message":"Another rock star goes on the attack against conservatives."},{"comment_id":"1093108914084558","commenter_b":"exterminate the cockroaches!!!!!!!!!!!!!!!!","commenter_a":"Muslims are a cancer.","post_message":"Top U.S. Commander In Europe: ISIS is Like Cancer Among Refugees @webpagelink"}]
