[{"comment_id":"10156745842795725","commenter_b":"This bitch still talking !!","commenter_a":"These rioters are obvious angry, violent, hateful, ignorant people, who can barely speak their own language. They don't like Thump. Chicago people are the Haters, who seem to hate everyone. They also don't like the 1st amendment, and think they are the only ones who have. They are in for a big surprise. Well, we don't live you either. What a bunch of lying hypocrites.","post_message":"Brawls break out at the Donald Trump rally after the Republican presidential candidate postpones his rally over safety concerns. Live coverage ----> @webpagelink"},{"comment_id":"10153129217297377","commenter_b":"There are a couple of million people in prisons and jail right now (Google it). I'm pretty sure they were taken there and didn't voluntarily have themselves incarcerated. Don't say it's impossible. That said, I think it's improbable and impractical to plan on finding 12 million illegal immigrants as a whole and deport them. Just let them remain illegal and deport them as you find them. Let them stand in line with everybody else who is attempting to immigrate LEGALLY.","commenter_a":"I think lots of them will self deport. Especially those who are gang members and have been deported and came back illegally. Cut off benefits and the free loaders will leave. States can deport.","post_message":"\"You're going to have a deportation force, and you're going to do it humanely,\" Trump says."},{"comment_id":"10155174752479916","commenter_b":"now suck it!","commenter_a":"Fuck that cop, fuck all cops","post_message":"Protests are ongoing in Anaheim today after an off-duty cop discharged his firearm in a crowd of young teens."},{"comment_id":"10153753103761037","commenter_b":"@username tell me that in 12 months... no Bernie, no Trump, no Clinton and no JEB... then who's left? Let's talk again when there's only days left of this nonsense.","commenter_a":"Jim Webb won this debate: he got more exposure out of the media tonight than he has had since he began his candidacy. Compared to Clinton he looks honorable, compared to Sanders he looks responsible. Since those two are the media darlings, those are the only two he needs to be compared to until he can get out of single digit polls. If any of those candidates expect to get moderate Independent and Republican voters next fall, they need Webb on the ticket… unless Trump manages to stay in the race.","post_message":"Bernie Sanders defends his record on guns after Hillary Clinton pounces. #DemDebate"},{"comment_id":"10153137487806336","commenter_b":"Because 'not topless' she would never make the cover. Topless, she is on the cover. Follow the money.","commenter_a":"Why the hell do you have to pose topless to represent yourself? She plays golf, she's not a go go dancer so pose with something that represents your sport. As it is all she represents is the moral decay of America.","post_message":"\"I decided that I wanted to do it not only to represent myself as a professional athlete and a golfer, but to represent just all women athletes in general.\"  LPGA golfer Lexi Thompson appeared on 'Fox & Friends' to address criticism of her controversial \"GolfDigest\" cover photo."},{"comment_id":"828297687360808","commenter_b":"she should be dropped from Food Stamps and made to work to pay for everything she's destroyed that is not right she needs to lose a little weight anyway","commenter_a":"Jobs and multiple job... Life isn't free..","post_message":"This is exactly why people should not be given money for doing nothing.  Are you sick and tired of Welfare leeches taking your money?"},{"comment_id":"1324643474244952","commenter_b":"Do you need money?","commenter_a":"We're going to get back at a companies CEO for endorsing a different candidate by buying their product! Genius! I'm a registered Democrat. Why don't you throw some money at me while you're at it. Morons.","post_message":"Supporters of Donald J. Trump are getting back at Starbucks but putting the President-elect's name on the company's cups and filming any barista who refuses."}]
