[{"comment_id":"10153054434811051","commenter_b":"So sorry he killed himself. The creeps that haunted him should all be rounded up and put in jail.","commenter_a":"Well I hope those bullies are proud of themselves. ...they know who they are and they all have blood on their hands. KIDS.... BE CAREFUL WHO YOU BULLY....THAT PERSON MAY BE YOUR BOSS SOMEDAY! In school everything that happens seems like its life altering end of the world BS. Guess what....it's just high school....life goes on....nothing is worse than suicide. ...sometimes the worst thing that happens turns out to be the best thing.","post_message":"This boy loved hunting and trapping, and other students made fun of him all the time for it. He just couldn't fit in with them. Eventually it became too much."},{"comment_id":"10154496837959170","commenter_b":"Only LAZY UNEDUCATED PEOPLE BELIEVE IN A LYING WHITE WOMAN-hillary.","commenter_a":"BOOM killary!","post_message":"Hillary promises to continue Obama's economic policies. The latest results of those policies came out this morning. Splat!"},{"comment_id":"1189532041066824","commenter_b":"only girls use pillow when they fight","commenter_a":"A pillow fight injured more than two dozen people????? Boy, are we ever ready for World War 3 if need be!!!","post_message":"UPDATE: A pillow fight at the United States Military Academy at West Point turned so violent that it caused concussions in 24 cadets, the superintendent of the school told NBC News on Saturday."},{"comment_id":"974731595926313","commenter_b":"Kyle Francis","commenter_a":"Sarah you wonder why I despair......... Senor Berm Eileen","post_message":"We didn't think the 2016 election could get any more bizarre, but Sarah Palin and Donald J. Trump proved us wrong yesterday."},{"comment_id":"10153185971496955","commenter_b":"shoot the illegals","commenter_a":"...and they wonder why we don't trust the police...!","post_message":"California Deputies Are Taped Beating Man in Bizarre Desert Horse Chase... 'Ugly'..."},{"comment_id":"10153374833224497","commenter_b":"I miss that trashy bitch.","commenter_a":"whatever happened to amber richardson?","post_message":"\"I had some great drugs in my day, but seeing my baby for the first time? I wouldn trade that for all the ecstasy in the world.\""},{"comment_id":"1695797427350247","commenter_b":"She is so stupid. That will not fix it it has to be destroyed.","commenter_a":"Does Compassion, Unity, & Love make roundes in 5.56/223.","post_message":"Have you hugged a suicide bomber today?"}]
