[{"comment_id":"472965199559859","commenter_b":"I'd be packing my bags headed for Ecuador.","commenter_a":"If hell freezes over and Trump actually wins the White House, I forecast that the USA will see the largest mass exodus of the intelligentsia class of citizens in the history of our country. Those people capable of using 3-4 syllable words including researchers, doctors, teachers, scientists, and engineers will not be able to stomach the idea of a golden haired baboon driving the nail into the coffin that was once the United States of America. May God have mercy on us.","post_message":"Donald J. Trump: \"Happy #CincoDeMayo...I love Hispanics!\""},{"comment_id":"10154244908884778","commenter_b":"So even if u were be low society's best u would deserve to die ? That's where we should bring some type of responsibility to the government for bringing drugs into this country in order to rid certain races but we don't punish the king pin we look down on those trapped by the government SMDH!! Wake up people white black Puerto Rican Asian r all using drugs of some sort the majority of those being punished are black people & this has been going on for decades!! SLL LIVES MATTER @username I guess you & all your family is perfect so go to work or at least get off my post","commenter_a":"That's a COP OUT pun intended !! Those officers need to be accountable for their actions!! Money won't bring Freddie Gray back SMDH","post_message":"#BREAKING: Baltimore officials came to a $6.4 million wrongful death settlement with Freddie Gray's family on Tuesday, our news partners at the Washington Post report."},{"comment_id":"713882998713829","commenter_b":"...then get to it...show the American citizens that you politicians have some cajones...IMPEACH the MF'er!!!","commenter_a":"THIS IS THE FIRST TIME IN HISTORY THAT A LEADER OF THE FREE WORLD ISN'T HELD ACCOUNTABLE FOR HIS ACTIONS . AND I WOULD LIKE TO KNOW WHY.","post_message":"The American President... Or Jihadist In A Suit? ⋆ Dc Gazette... @webpagelink"},{"comment_id":"10156861000555725","commenter_b":"No more stuffed-shirt limp-wristed men who talk to us in carefully chosen PC correct words .... We need a real man to take control of our country and return us to our glory days! AMERICA FIRST - EVERYONE ELSE IS A DISTANT SECOND ...... #TRUMP2016!!","commenter_a":"Why would anyone believe Breitbart after they made a business deal to screw one of their own?","post_message":"WOW! An honor to be the first-ever presidential candidate in a primary- to be endorsed by the National Border Patrol Council. WE WILL BUILD THE WALL-- WE WILL MAKE AMERICA SAFE AGAIN! Thank you."},{"comment_id":"10152879630121336","commenter_b":"Shes got her hands full.","commenter_a":"Blessings","post_message":"A Montana woman gave birth to a set of identical triplet boys in early December, a rare occurrence — especially without the aid of fertility drugs. @webpagelink"},{"comment_id":"10153291697646350","commenter_b":"It was beautiful . I have seen the stage play at least 20 times with groups and sung by many, and it is great to hear the different sounds.","commenter_a":"If you ever saw Phantom on stage or saw the movie, you know Josh Groban did it justice. Kelly did not. She about ruined my favorite song for me, from which my wedding vows were taken. Kind of like nails on a chalkboard for me.","post_message":"We could listen to Josh Groban and Kelly Clarkson sing The Phantom of the Opera all day."},{"comment_id":"10153828694670779","commenter_b":"So was Hillary's. But don't see you bitching about her. Oh that's right, you're for her, lol. They both suck! And war is coming. Hope you all are ready!","commenter_a":"Poor Frump supporters. At least they have the right temperament. :-D","post_message":"Donald J. Trump's debate conduct is destined to become a future candidate-training video of what not to do. The man dismissed as the most ignorant, uncivil and unprepared major-party candidate in history could not have conducted himself more poorly."}]
