[{"comment_id":"10155922469974199","commenter_b":"All he's got to do is offer residency or citizenship to all of the workers who are here illegally and who are will to work on the wall for minimum wage and he could probably build that wall for 5 billion. And technically Mexico would be paying for it.","commenter_a":"This man is a joke and you guys really elected him. We are all doomed under his watch","post_message":"President Donald Trump tweeted Saturday that he is aware of the new costs estimates for the proposed wall along on the U.S. border with Mexico.   A government analysis suggests the wall could cost $15 billion, and possibly as much as $25 billion.  How much are you willing to pay for the wall?"},{"comment_id":"10152955984226130","commenter_b":"Lesbians STINK","commenter_a":"The image of God is both male and female and is reflected in a godly union between male and female where the creative power of God, His life-giving, His self-giving and His moral nature are perfectly expressed. This is only possible in a heterosexual union. When God created a partner for Adam He created Eve—not another Adam. This means that perfect partnership requires some level of difference as well as a level of similarity so great that Adam could cry out loudly, ”This is now bone of my bones and flesh of my flesh”. Sexual intimacy between a man and a woman is the normal method of male/female bonding (emotionally and physically) because it corresponds to the design of our bodies and because it is the normal means by which offspring are created. If God had intended the human race to be fulfilled through both heterosexual and homosexual marriage, He ...","post_message":"“As long as anti-gay legislation exists in any state, I strongly believe big events such as the Final Four and Super Bowl should not be held in those states’ cities.”"},{"comment_id":"10153399838202411","commenter_b":"\"Do the right thing\", go away for good.","commenter_a":"Don't care for him..Chi raq was a horrible movie and I didn't even see and will never ever see it (just from previews). True Chicagoans will agree with me...Ugh, go away and take Kanye west and his family with u too..","post_message":"Happy Birthday, Spike Lee! The director of \"Chi-Raq\" and \"Do the Right Thing\" turns 59 today."},{"comment_id":"10153933179656509","commenter_b":"Lol see what I mean? \"White people do this all the time.\"","commenter_a":"Who could do such a thing? I don't want to hear that mental illness mess either. Lethal injection time.","post_message":"The suspect broke into the house and handcuffed the victims in their bedrooms -- and then shot them, authorities said. @webpagelink"},{"comment_id":"10153982489146438","commenter_b":"talentless racist bitch","commenter_a":"talentless bitch","post_message":"It's an incredible visual album, but how is it as an aural album?"},{"comment_id":"592518337598551","commenter_b":"Let's ban camel rapists","commenter_a":"No.","post_message":"NO!"},{"comment_id":"10152633233581680","commenter_b":"women are human beings that can die from forced pregnancy.","commenter_a":"A baby is not a CHOICE its a human being thats alive.","post_message":"“Congrats, you’ve earned this for trying to deny women their right to choice,” the note inside read. “Mind your own uterus.”"}]
