[{"comment_id":"10153228124522235","commenter_b":"You scaring kitty. You BAD man.","commenter_a":"Scum!","post_message":"Convicted felon, Tom Delay, crawled out from under his rock to share his very important opinion about rights and liberties."},{"comment_id":"10154467987919342","commenter_b":"Ban cars. They kill more people than guns.","commenter_a":"Guns. Taking people's lives needlessly everyday because we let anyone and everyone have them. Not it's not a mental health issue. It's the acceptance of daily gun violence in our society. People will read this story and move on. Congrats NRA. Kill more Americans daily for our freedom to own guns. #GunsHaveMoreRightsThanPeople","post_message":"#Breaking: I 69 at Spur 527 is completely shutdown after a minor accident led to a deadly shooting."},{"comment_id":"1250106475030208","commenter_b":"There actually is a move to get women to sign up for the draft right now (though it won't matter because there will likely never be another draft) But you wouldn know about that because the draft is one of the only things meninists have to bitch about. But","commenter_a":"Why arent feminists fight for equal representation in sanitation? Or equal representation is crab fishing? Or equal representation in the draft. Women should sign up for the draft #genderequality","post_message":"\"But in order to help, those of us who do understand have to know what women are up against.\""},{"comment_id":"10154779118243701","commenter_b":"Because she didn't want anyone to know she was pregnant in the first place","commenter_a":"Wait so if the baby is dead then you throw it out the window? That is just sick!!! You need help and definitely no more kids that baby dead or alive dose not deserve to be thrown out a window","post_message":"The Nebraska teen said she gave birth to an infant she thought was dead, panicked and threw the baby out the second-story window."},{"comment_id":"551022975088282","commenter_b":"the only thing i would sacrifice for this transvestite is a bullet.","commenter_a":"What the hell makes her think she can change our constitution? She's a nobody married to a mistake & not worth the oxygen she breaths! & he is a waste of oxygen also.","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"},{"comment_id":"874546065914187","commenter_b":"Buy a boat move in land !","commenter_a":"Not just act, but act urgently. Right now, it's all but inevitable that there will be some serious sea level rise from melting glaciers over land.","post_message":"Barack Obama is right. It's time to act. Like ATTN: for coverage of climate change and the environment."},{"comment_id":"1028975063831277","commenter_b":"That lady has no clue","commenter_a":"What was the criminal background of the one shot in chicago by the cop? Just wondering. Did we get rid of an upstanding future physisist, doctor, or a career criminal who's career was cut short? Just wondering !","post_message":"OUTRAGEOUS: Chicago Thug Executes 9-Year-Old Boy Point Blank In The Head, Black Community SILENT! (VIDEO) They won't protest this child killer, but will protest a cop who shot and killed a thug! SICKENING! Share this if you're sick of these people and their bigotry! FOLLOW OUR PAGE---> Freedom Daily @webpagelink"}]
