[{"comment_id":"10153852384658822","commenter_b":"Women wanted equal treatment in the military.. This makes them a little more equal. Be careful what you wish for you just might get it","commenter_a":"I had 3 sons and they all registered when they turned of age. I would have not wanted them to go but if I had a daughter which I don't I would not want her to be drafted and put in the position of getting captured. It is bad enough what they do to men when captured you can imagine what they would do to women before doing to them what they do to men. I do now have a grand daughter and a grandson. I hope neither of them ever have to go thru a war. I also hope everyone else's kids don't either.","post_message":"The Senate voted this week to require women to register for the draft.   What do you think of the change?"},{"comment_id":"1754978767895197","commenter_b":"Trump going to build that wall around your house.","commenter_a":"good lord, no tact at all. Biggest moochers on the planet, biggest joke presidency. Not enough he more than doubled the national debt, now in his mere final weeks, they go ahead and keep living high on the hog. Trump was not my pick among GOP candidates, but doing this stuff for 8 years while telling successful hardworking citizens ,\"you didn't earn that\" or \"some folks are going to have to give up their piece of the pie\" really screamed to everyone on how we don't want this again.","post_message":"Aloha Obamas!"},{"comment_id":"993534210682000","commenter_b":"These illiterate students should be in class learning something !!!","commenter_a":"I agree with every post here! They should have forfeited the game and then raised the tuition to cover what loss incurred that reduces tuition. End of story. But know we have encouraged the sports programs to make policy and remove employees at their will. Just crazy.","post_message":"Literally no understanding of 1st amendment rights whatsoever!  Behold your \"tolerant\", liberal colleges..."},{"comment_id":"1570583689633777","commenter_b":"There is no sense in even trying to reason with these people. They are a whole level of crazy I don't want to be around. Scary! I didn't see riots like this when Obama was elected-because we have class and integrity. Trump will lead this country like no other! I can't wait for the future of America!🇺🇸🚂❤️","commenter_a":"Our country is full of spoiled people who are so used to having things their way, they act like a class of 5 y/o kids who didn't get the green marker! Come on, this country has the same electoral system that has worked without problem for hundreds if years. No one rioted when any other person has been elected, altjpugh i am sure many people felt disappointment. And the democrats and supporters whole campaign slogan was \"stronger together, peace, love, equality\"......... Which all I'm seeing is a true fit being thrown by people who didn't get their way. Funny how true colors come shining out when the world they are used to getting their way in doesn't quite work out. Peace, love, equality, anti hate??? I think not supporters. Your example is clear.","post_message":"Protesters burned American flags and chanted \"not my president\" despite Democrats' calls for a peaceful transition of power."},{"comment_id":"803355223130806","commenter_b":"we love newt, let the whole world know about her shady crap , we don't care about your tax release, she has the nerve to talk crap about that and look at her hiding server deleated emails, noooooo way. go TRUMP","commenter_a":"Good Luck with Today President Trump!!Go Gently, but be Strong!! Stand Your Ground but be Humble!! America needs You!!","post_message":"\"Speaker Newt Gingrich pointed out the pay disparity between male and female executives at the Clinton Foundation, where men earn 38 percent more on average, before telling viewers that Trump is more pro-woman than the former secretary of state. He also noted that this likely would come as a \"shock\" to many voters.\""},{"comment_id":"10153576717714024","commenter_b":"This is what's wrong with our country. Not just the BRAINLESS, CLUELESS, MORONS like her in congress, but THE SAME ONE'S THAT PUT HER THERE!","commenter_a":"They do indeed walk among us and get elected","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink #BB4SP"},{"comment_id":"1410976518925134","commenter_b":"like dying in the sea coming from Europe to steal Mexican and Native American land?","commenter_a":"I wish people would realize this is actually happening and innocent people are losing their lives! of course under ignorant trump supporters everyone is Mexican","post_message":"Donald J. Trump is already deporting people to Mexico  even if they're not Mexican."}]
