[{"comment_id":"10156034180320389","commenter_b":"He is a crybaby and moron. I used to watch him until he started with the crocodile tears and he looked so pathetic. The media should report news and not shove their opinions on anyone. If he hates Trump, that's his opinion and he should not voice it on the air","commenter_a":"It's crazy how Trump fans treat those who disagree with them. Many Megan Kelly fans and Beck fans threw a fit that someone didn't believe as they did about Trump. Is this how we treat each other? Drop people like a rock when they disagree with us? Start name calling? Sean answered Beck honestly and with class. Which is more than most of you are doing. I have great respect for Beck AND Hannity. Even if I don't always agree with them. But after years of following Glen Beck- it's clear that nothing drives him more than a love for this country.","post_message":"My response to Glenn Beck who criticized me earlier this week for supporting Donald Trump."},{"comment_id":"10154054531268984","commenter_b":"shes a bitch, and has over inflated the facts and and did not do the research in her questions it was all edited as thats what the media does they piece the words together to suit them sick of of all news media they do not report anything truth anymore just the lies they try to make into thier own little fantasy world to get them in the spotlights of the media world ........","commenter_a":"M KELLY IS A LOW-CLASS BITCH","post_message":"Megyn Kelly was in the middle of her live TV show when news broke that Donald Trump would officially be skipping the Fox News GOP debate. Talk about a captivating moment of live television... Do you think Donald J. Trump made the right decision?"},{"comment_id":"10153739431762235","commenter_b":"Maybe if more men were any good in bed the women might enjoy it. 90% of men are terrible in bed. Stop putting it on women.","commenter_a":"Horrifying","post_message":"There's so much wrong with this, I don't know where to start ..."},{"comment_id":"1187260984619751","commenter_b":"Build the wall then bill his estate","commenter_a":"Build a wall on the edge.","post_message":"Tell the truth....what would you do?"},{"comment_id":"10153601498992383","commenter_b":"Well your opinions are wrong, ladies! What kind of military expertise do you have besides \"my husband served?\"","commenter_a":"this is getting way out of line.second marine shot at a shooting range at Camp pendleton?","post_message":"Our thoughts are with the family and friends of the Marine."},{"comment_id":"1523513847666621","commenter_b":"Republicans had a smear campaign for him too, beginning with making him out to be a communist, with anti-American rhetoric to prove it. He would've been painted an insider since government is all he knows. They planned to trot out his rape fantasy story as well. Also, Vermont tried and failed it's statewide Healthcare for all system. He was treated with kid gloves compared to what he would've endured against the Trump post-truth machine.","commenter_a":"Sorry, Bill, but half of America already hated her BEFORE she ran. The media and Republicans have been excoriating her for 30 years. SHE NEVER HAD A CHANCE--unlike Bernie, who was almost universally beloved. He would have won. Fault: Democrats","post_message":"In case you missed them, we're counting down the most popular stories on BillMoyers.com during the past year: #9 - The fact is that Hillary Clinton wasn’t unpopular when she announced her decision to run in April 2015. If you look at the Gallup survey in March of 2015, 50 percent of Americans had a favorable impression of Clinton, only 39 percent an unfavorable one. So there was clearly no deep reservoir of Clinton hatred among the general public at the time. On the contrary: Americans liked her; they liked her quite a bit. Hillary Clinton's popularity didn't start to plummet until the press focus turned to her emails."},{"comment_id":"10153480820949726","commenter_b":"Skank whore.","commenter_a":"That song is getting a little old hillary...just like you","post_message":"WATCH: Hillary Clinton targets Wall Street!"}]
