[{"comment_id":"10154169882022061","commenter_b":"Would you rather me say, \"stop your whining and suck it up buttercup!\"","commenter_a":"Good grief, you people kill me. Like it or not he is the next POTUS. Stop with the bashing. If you live in America then he is your President and you will benefit or suffer like the rest, but for crying out loud give him a chance.","post_message":"WATCH: Rick Perry, President-elect Donald J. Trump's expected pick for Secretary of Energy, famously forgot he wanted to abolish the energy department in a 2011 debate: @webpagelink"},{"comment_id":"10153059465629614","commenter_b":"Just because u are a police dose not mean that u have the right to break the laws n u say that police need a break well who give use a break","commenter_a":"She doesn't no her traffic sings lo hahaha","post_message":"A sheriff deputy is under investigation after cell phone video showed her getting into a patrol car that was parked in a disabled parking space at a Circle K store in Sacramento. always park in handicap when you not on a call? A man can be heard saying in the video. allowed to get breaks, the deputy replies. The Sacramento undersheriff said he was disappointed and that punishment could range anywhere from documented counseling all the way to termination. Watch KTLA video here: @webpagelink"},{"comment_id":"10156208772020354","commenter_b":"Now","commenter_a":"I agree....!","post_message":"\"We’re like… Charlie Brown trying to kick the football every time and they keep taking it away…I encourage the Republican Party to get off their ass and fight like we pay them to.”"},{"comment_id":"1861021464115839","commenter_b":"Fits his class level.","commenter_a":"Ignorant","post_message":"WARNING: Graphic content"},{"comment_id":"10158198305710206","commenter_b":"Exactly why women shouldn't be police officers!!","commenter_a":"Hodor.","post_message":"Nice try!"},{"comment_id":"981909798535164","commenter_b":"No, I don't think he have to.","commenter_a":"No","post_message":"Bernie Sanders doesn't talk very much about faith beyond saying he's culturally Jewish. Jimmy Kimmel asked him, point blank, if he believes in God, and he framed his answer in a rather unique way. Do you think a president must have a belief in a god to be a good leader?"},{"comment_id":"1036501259720547","commenter_b":"If illegals are going to remain here what difference does it make?","commenter_a":"Trump/Cruz will have my vote.... but if Trump is not on the ballot......don't expect me to cast one","post_message":"Ted Cruz explains why he thinks \"2016 is going to be an incredible year.\""}]
