[{"comment_id":"10156924134420725","commenter_b":"@username The Wall Is Coming and Mexico Will Pay. No More Hand Outs To Mexico It's Time Mexico Starts Taking Care Of Their Own!!! Donald J Trump President of the United States of America and American People 2016!!!","commenter_a":"Don't Forget: DONALD TRUMP WANTS TO BANG HIS DAUGHTER.","post_message":""},{"comment_id":"10154898631786729","commenter_b":"But at least she was honest enough to release her tax returns,something that Trump still hasnt done.What damning information is Trump hiding in those returns?Has it to do with his business dealings with the Russian oligarchs.","commenter_a":"The old switch a roo...creative tax scheme?","post_message":"Something's rotten all right..."},{"comment_id":"10152803991986491","commenter_b":"This less her chance of cancer . It is possible that cancer my appear else where?","commenter_a":"Anna! I always love to read your comments! Thank you for sharing :)","post_message":"\"I feel feminine, and grounded in the choices I am making for myself and my family.\""},{"comment_id":"10152746450450326","commenter_b":"They are the real terrorists. They need to be stopped.","commenter_a":"Why should they have anything to say about what we do... We don't tell these evil men what to do.","post_message":""},{"comment_id":"10154624417173010","commenter_b":"Water board this bitch daily then drown her","commenter_a":"Sorry. 21 years is not long enough. That baby is missing out on 80 or so years of Life. Dad is Missing out on 60 years with His son. That is NOT justice for that baby. I don't believe in an afterlife, but hers would Be incredibly cruel And dark.","post_message":"When the boy regained consciousness, she called the child's father to ask him to give up his custody rights. When he said no, she once again held the toddler's head underwater until he died, prosecutors said."},{"comment_id":"894913557210733","commenter_b":"That's a very good question. They should have been the first to do that, And Arizona as well. But I don't think we can save lower California. The illegals think they own it anyway........","commenter_a":"ok texas needs to do this fast","post_message":"AND He needs our help!"},{"comment_id":"10153402450349456","commenter_b":"And he's out on bond in Montgomery and Elmore counties? What a joke","commenter_a":"Thug life is no good.","post_message":"One official said this is the worst case of home repair fraud he's ever seen. The suspect is also facing a murder charge in Elmore County."}]
