[{"comment_id":"10153769557012411","commenter_b":"Very few companies offer health insurance to retirees.. very few!!! Probably government retirees is about it..","commenter_a":"Congratulations to her, but did the massive company McDonalds, give her retirement benefits or health insurance after 32 years?","post_message":"“She is one of the most beautiful and upbeat people you could ever hope to know.\""},{"comment_id":"935532149828645","commenter_b":"No refugees immigtants.We're your great great.oh Grandparents Irish immigrant ?","commenter_a":"NO REFUGEES, NONE ! We Americans do not need more problems in our country. Stop them, am I CLEAR ?","post_message":"Our nation has always been welcoming, but we can’t let terrorists take advantage of our compassion. We should not bring Syrian refugees into this country unless we can be 100 percent confident that they are not here to do us harm."},{"comment_id":"1742743236000370","commenter_b":"Typical Bernie speech sounds like this.I like to thank my legs for supporting me.My arms for always having been by my side and as for my fingers-------I could always count on them.","commenter_a":"Thank you West Virginia and Nebraska...Im glad several of our states including Pa..can see what Trump needs to do.. JOBS....people need to get back to work.and Most hard working people want this...everyone needs to pay into the system..","post_message":"It is a great honor to have won both West Virginia and Nebraska, especially by such massive margins. My time spent in both states was a wonderful and enlightening experience for me. I learned a lot, and that knowledge will be put to good use towards the creation of businesses, jobs, and the strengthening and revival of their economies. I look forward to returning to West Virginia and Nebraska soon, and hope to win both states in the general election. Likewise, my time spent last week with the great people of Oregon will hopefully lead to another victory next Tuesday. Thank you! Donald J. Trump"},{"comment_id":"10153486509166320","commenter_b":"Stupid woman. Don't vote for her just because she is a woman. You voted for a color. Remember...","commenter_a":"And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course ‘lest we forget’ what has happened to many “friends” of the Clintons. 1- James McDougal – Clinton’s convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr’s investigation. 2 – Mary Mahoney – A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown.. The murder happened just after she was to go public w:th her story of sexual harassment in the White House. 3 – Vince Foster – Former White House councilor, and colleague of Hillary Clinton at Little Rock’s Rose Law firm. Died of a gunshot wound to the head, ruled a suicide. 4 – Ron Brown – Secretary of Commerce and former DNC Chairman. Reported to have died by impact ...","post_message":"Hillary Clinton held her first major rally of her 2016 presidential campaign on Roosevelt Island today. She called for a new era of shared prosperity in America and told supporters that workers can trust her to fight for them."},{"comment_id":"10153478854858188","commenter_b":"I see he didn't answer the second question. First answer was also rediculous since he has given all our prisoners from guantanamo away","commenter_a":"Glad he was put in his place.","post_message":"Wow."},{"comment_id":"1059194827547028","commenter_b":"He is not even their president. Or that is what their signs say. Besides, they will not be part of the US for much longer.","commenter_a":"Richmond? Bwahahahah! Crime central.","post_message":"So this just happened..."},{"comment_id":"10153059344826336","commenter_b":"So the point is immigrants \"Mexican\" people aren't here to do harm they just want to make a living","commenter_a":"Immigrants that come to this country isnt because there criminals, there coming to work to help there familys back home or have a better living then what they had in there country, do you see immagrants stealling banks or doing criminal acts?!.... so maybe yall need to stop being so judge mental yall dont know what yall saying its not there falut that the goverment in mexico is so stupid and not helping there ppl so next time STOP criticizing OBAMA he's helping people that only want to work","post_message":"President Obama's executive action on immigration may be helping violent criminals stay within America's borders."}]
