[{"comment_id":"10153166657159456","commenter_b":"White devils are a nightmare!!","commenter_a":"Welcome President and Mrs. Obama. It is an honor!","post_message":"UPDATE: President Obama has arrived in Selma. Scheduled to speak at 1:35 p.m.  The President is on his way to Selma after landing in Montgomery. Should be there soon! @webpagelink"},{"comment_id":"1860114807561813","commenter_b":"What a couple of scheisters! They both belong in prison...","commenter_a":"They may have topaysomeback taxes.","post_message":"ANTI-TRUMP REP JOHN LEWIS Skipped Out On Paying Taxes On His DC Townhouse...He must have consulted with Rev Al Sharpton..."},{"comment_id":"987322251337818","commenter_b":"They should be incarcerated. It's just that women who have legal abortions aren't murderers. And NO member of congress should make my reproductive choices for me.","commenter_a":"If you believe in murder, I guess it would be ok for you","post_message":"Yes! It's time to #abortthestigma"},{"comment_id":"10154712423493812","commenter_b":"Oh goody. The racist, sexist, xenophobe will meet the corrupt, mass murderer President of Mexico if he wins.","commenter_a":"To do what? Give him the bill for the wall?","post_message":"Donald J. Trump says, if he's elected, he would meet with Mexico's President Enrique Peña Nieto. Last week, Pres. Nieto said he'd meet with Trump, despite previously comparing him to Hitler and Mussolini."},{"comment_id":"10153252592734138","commenter_b":"R u mad or naw?","commenter_a":"All the white people would try to escape n end up north side n get beat up","post_message":"Today, Gov. Mark Dayton blasted Newberger's remarks, calling them \"disgraceful.\""},{"comment_id":"10153611499316955","commenter_b":"Dumb broad should have to eat it herself before feeding the garbage to our kids.","commenter_a":"Good! If you eat what she eats you might end up looking like her!!!!!","post_message":"Students celebrate as school drops Michelle O lunch rules..."},{"comment_id":"10154570057689369","commenter_b":"Hillary was dead broke, now worth 100 million. How much taxes did she pay on that? 100% growth should be taxed at a high rate according to Hillary.","commenter_a":"Can Trump shut up for atleast one week. Every day, he is making a point, where more n more people are hating him","post_message":"\"No one should be surprised, though, if Donald J. Trump has paid far less - perhaps even zero federal income tax in some years.\""}]
