[{"comment_id":"769355346496407","commenter_b":"I am on Pam side screw the rest of them assholes.","commenter_a":"Bullshit she clearly antagonized this lame ass broad","post_message":"She believes she saved lives by hosting the contest."},{"comment_id":"10153236337040047","commenter_b":"This is an evil,should be exterminated.","commenter_a":"So sad","post_message":"This week, the European Parliament voted unanimously to recognize ISIS's atrocities against Christians as genocide.  When will the U.S. do the same?       Sign and Share our critical legal letter to Secretary of State John Kerry to demand immediate action: @webpagelink"},{"comment_id":"1180323918655284","commenter_b":"My cats r broken, both are at best apathetic toward boxes, at worst terrified of them, depending entirely on size and location","commenter_a":"Elizabeth Dain","post_message":"Happy international cat day!  Here's a question for you - why do cats love boxes so damn much?  Find out: bit.ly/1zUeu4c"},{"comment_id":"693090104129406","commenter_b":"she is a fraud... she was a mecanic in a motor pool","commenter_a":"You go girl!!!","post_message":"One way activists in the United States are supporting an end to poaching is by enlisting retired vets to take part in an organization that puts their years of combat training to work overseas."},{"comment_id":"10154664447603145","commenter_b":"Then LEAVE MY COUNRTY !!!","commenter_a":"Mr. Trump isn my president. I don mean it emotionally; I mean it literally. It not sloganeering; it observable truth. Mr. Trump has no intention of representing me, my family, the people I care about, or the majority of Americans, from the imperiled to the comfortable. It is a stretch to call him anyone president but his own. -Lindy West","post_message":"Every president since 1976 has released his tax returns."},{"comment_id":"10153499650978132","commenter_b":"She's skanky. ...that's a door the should have stayed closed.","commenter_a":"Why can't she just retire and go away.","post_message":"Pink ambition!"},{"comment_id":"10153982625649087","commenter_b":"Nobody cares that she wants to redistribute their money to the millions and millions of illegal alien Freeloaders and refuess","commenter_a":"Trump needs to start hammering Hillary Clinton just like Bernie Sanders did","post_message":"Donald J. Trump lashed out at former CIA Director Michael Morell after he announced his support for Hillary Clinton and said Russian President Vladimir Putin \"played\" the Republican nominee."}]
