[{"comment_id":"10152638370431167","commenter_b":"Skinny, blond, white ladies can't be racist.","commenter_a":"What the...","post_message":"Reminder: This person is still on the payroll at ABC."},{"comment_id":"453827754807805","commenter_b":"HELL YES!!! NOW THEY TRYING TO TAKE THE ONLY. GOOD FAMILY ORIENTED. ON T V TRYING TO GET GOD OUT OF EVERYTHING. THESE. PEOPLE ARE NUTS","commenter_a":"Yes","post_message":"Do You Support Keeping Duck Dynasty On TV? Comment 'yes' or 'no'."},{"comment_id":"1036357393060980","commenter_b":"Criminals are cowards and go for easy prey. Doubt one is going pick a fight with someone who will shoot back. Use your head Raymond","commenter_a":"Welp, the criminals will know who to shoot first.","post_message":"AROUND TEXAS: The Texas Senate gave preliminary approval Monday to a measure that would make the Lone Star State the largest in the country to allow licensed open carry of handguns. Would you support the right to openly carry in Texas? MORE ---> @webpagelink"},{"comment_id":"10155752220095603","commenter_b":"Black lives must not matter too much, stupid idiots cannot stop killing each other.","commenter_a":"Tired of all this carp. Can we get along for a change.","post_message":""},{"comment_id":"1069087446447636","commenter_b":"Put her on the street .","commenter_a":"She looks flashy","post_message":"The liberal media loved Michelle Obama's tang SOTU dress. Take a guess at how much it cost."},{"comment_id":"1574345245925141","commenter_b":"Hillary is a superpredator of immigrants and minorities. Bill is a superDUPERpredator of young women. She panders to Muslims who kill gays and rape women. Hypocrite superpredator. Ouch...","commenter_a":"We Americans know trump is weak. Trumps first trip to Mexico was a failure. He came to lie to American people just hours after the visit. Shame trump","post_message":"Thank you - Conservative Party of New York State. An honor to receive your endorsement! Together, we will MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"582227101946110","commenter_b":"@username wow you're a stupid women aren't you","commenter_a":"Let them come in. Legally. Sure. With good intentions. Make them Learn English. Tell them it's our rules. We're not making special laws for you. Your not coming in and changing our rights. Say the pledge of allegiance with the rest of us. Call it a good day.","post_message":"We are taking in thousands, and thousands of people into or country - we have no idea who they are -- and they believe in things WE DON'T BELIEVE IN! Not happening if I am elected president."}]
