[{"comment_id":"10153084028785667","commenter_b":"Uhh bc illegals.. This makes it easy for anyone","commenter_a":"Why would people not use their drivers license? Using library cards and Costco cards? Packing your driver's license? Seriously? Stupidity at its finest. Some people should just stay home.","post_message":"A credit card, prescription, student ID or even a Costco card could be enough to convince the TSA you are who you say you are."},{"comment_id":"440337219424652","commenter_b":"If your not Born in Africa, how are u African, He's right, I dont say I'm scottish, I say i'm an American, People need to stop playing this devide and conquer game the rich is playin thru the Media, which they own, thru the military with constant wars which profit the rich, and of CORSE MONEY, the one and only thing the rich care about. EAT THE RICH! They are the enemy!","commenter_a":"This is a very poorly written article","post_message":"A Florida Sheriff is in hot water after a 2013 racist rant he recorded on video has surfaced just before he begins to gear up for re-election. Watch the video then read our commentary by Lou Colagiovanni"},{"comment_id":"1560174614269652","commenter_b":"They are both disgusting women!!!! Never watched the show!!","commenter_a":"Rosie has to be one of the Most grating obnoxious people on the planet.","post_message":"I love ABC for doing what's RIGHT!   Rosie O'Donnell & Whoopi Goldberg have no place on TV."},{"comment_id":"1368989116512954","commenter_b":"This is a poorly done troll job","commenter_a":"How about cutting the businesses taxes and then giving that money to illegal immigrants and other countries and people on welfare who can work?","post_message":"After liberals raised the minimum wage again, this restaurant owner had had enough. Here's how he took matters into his own hands and made sure his customers knew it...  This is what the left does NOT want to talk about when it comes to the \"fight for $15.\""},{"comment_id":"10154524280341955","commenter_b":"She's corrupt to the core.","commenter_a":"More of the trash that needs to go.","post_message":"Loretta Lynch 'Pleads Fifth' on Secret Iran 'Ransom' Payments..."},{"comment_id":"913163888732635","commenter_b":"Another NJ Dem on the take.","commenter_a":"n j Need to re think He will stand up to Obama. I wouldn't be surprise that Obama is behind this to start with","post_message":"Pressure is growing..."},{"comment_id":"753100741547170","commenter_b":"That whore cares so much about the us she built a school in Africa!!!!","commenter_a":"Fuck that","post_message":"Obama Wants To Put Oprah Winfrey’s Face On The New Dollar Bill.  This is ridiculous. Leave the dollar alone.  Do you think they should get the dollar bill as it is?"}]
