[{"comment_id":"10152921219620090","commenter_b":"@username , do not believe Florence , we everybody chosen by God. Not Jew , only, hahahaaaa","commenter_a":"Israel can take care of itself! We need to take care of USA and quit spending, spending, spending!","post_message":"We're proud to stand with Israel & stand against terrorism.  We're calling on Arab governments throughout the Middle East to help advance this goal. Join us, here: @webpagelink"},{"comment_id":"10153589906358984","commenter_b":"Stop giving this ignorant b*tch attention.","commenter_a":"Yes I do send them over to join isil","post_message":"Wow. This news makes her challenge even more shocking...  Do you think there should be a punishment for those who desecrate the American flag?"},{"comment_id":"10156349547100354","commenter_b":"Conservatives learned the lessons of MLK. I think the left needs to review what he preached. It is not the color of the skin but the content of character.","commenter_a":"These people just say what they think and then if it bites them in the rearend they come back with some ridiculous other story which nobody believes but they seem to think that we will.","post_message":"FIRESTORM: MSNBC Liberal Claims She Wasn’t Calling Dr. Ben Carson Racial Epithet...\"Safe Negro\"...Backpedals Quickly...Dr. Carson Campaign Blasts...MORE..."},{"comment_id":"10153165455697869","commenter_b":"End stupid people from breeding","commenter_a":"Amen....","post_message":""},{"comment_id":"10153680098799772","commenter_b":"Support SAFE ACT 1214 hr 1942","commenter_a":"That's just a dummy computer. There is no glow on her face from the screen. There is no reflection of the screen in her eyes. Maybe even she is just a mannequin?","post_message":"Getting ready to start this Facebook Q&A!"},{"comment_id":"1696327707324773","commenter_b":"Flawless Pre lil ass threw it back in the family bathroom! 😂😂😂","commenter_a":"Flawless Pre TARGET (we had a home just got caught in the moment) 😂😂😂","post_message":"This should be interesting.  Comment below! #WSHH"},{"comment_id":"1332403530152725","commenter_b":"Beautiful doggies on your page","commenter_a":"Yeah and her third set of boobs.","post_message":"She only be 18...but Kylie Jenner is onto her second mansion"}]
