[{"comment_id":"10150742367724999","commenter_b":"Yes Debra! Preach","commenter_a":"What?!! Do you really think young women voters can ignore that Hillary chose a MONSANTO lobbyist as her campaign manager? We'll wait for Elizabeth Warren, thank you very much. In the meantime- Senator Sanders is our Mr. Clean.","post_message":"Hillary Clinton's older feminist supporters had a message for young women who are not backing her candidacy: Shame on you. Update: Gloria Steinem later said she \"misspoke.\""},{"comment_id":"10154411705371336","commenter_b":"@username Did you purposefully neglect the part that this is what happened in every parts of the Earth? They did the same thing with the Aborigines here in Australia, when Arabs invaded Constantinople and established Istanbul...smh","commenter_a":"She is one of the few Christian celebrities. God Bless Her. Amen this nation was founded on Judeo-Christian values.","post_message":"Candace Cameron Bure is grateful to be living in the USA because \"we have the ability to love God here.\""},{"comment_id":"733367520187159","commenter_b":"we need to get these low lifes out of our country","commenter_a":"I am offended by them. I don't want to take them down but can we send them home. I m gladly contribute with the air fair","post_message":"Muslims Make Massive Move To Change The Flag Because It's Offensive If you don't like the flag you can leave. Do you think this is absurd?"},{"comment_id":"10154828234334714","commenter_b":"No vote Hillary & she have problem health. Prison Hillary.","commenter_a":"I'D EVERYONE!!!! don the con has his sheep voting twice three times in some places!!!","post_message":"Democrats will seek court action to preemptively block potential voter harassment from Republican poll watchers."},{"comment_id":"10153091643525496","commenter_b":"This woman is unreal and needs to get a life!!!","commenter_a":"Bet he won't be excited to see her any more! What kind of aunt does that! She should be ashamed!!","post_message":"The woman says her nephew, whose mother died last year, was so excited to see her arriving at his birthday party that he caused her to break her wrist: @webpagelink"},{"comment_id":"10153467191368132","commenter_b":"She is definitely showing side boob. I wouldn't let my daughters wear that when they're old enough for prom","commenter_a":"I like the dress! Maybe we should teach our boys to control themselves instead of teach our girls they should feel ashamed of their bodies.","post_message":"What do you think of the open-back design?"},{"comment_id":"10153274768969312","commenter_b":"Doesn't look like it! !!!","commenter_a":"Dont inmates get free dental care?","post_message":"Police say 32-year-old Jemayle Johnson escaped from St. Ann jail around 11:30 last night."}]
