[{"comment_id":"10153540749847452","commenter_b":"Yousef Danial","commenter_a":"Mariah Morgan Savannah Marshall wtf hahaha","post_message":"A suspect wanted for attempted murder hits multiple cars while trying to escape the California Highway Patrol during a chase on the 91 Freeway in Orange County. abc7.la/1NlhVx9"},{"comment_id":"1058239930927979","commenter_b":"This woman has to be one of, if not the stupidest person in the world.","commenter_a":"This piece of whale shit....no I stand corrected, whale shit has a purpose. This Is the very definition of dumbocrat....take your old tired ass and retire you outdated elite POS. You are so far out of touch with the human race just knowing you made that statement makes me throw up in my throat. Please go off to your pasture, dig yourself a hole so I can put an outhouse above it and shit upon your face.","post_message":"\"They voted against their own economic interests because of guns, because of gays, and because of God, the three G’s, God being the woman’s right to choose,\" said Pelosi."},{"comment_id":"1342884069080344","commenter_b":"And deport!","commenter_a":"Anyone wearing a mask does not want to get their picture taken when they destroy, throw them in prison and make them pay for damages.","post_message":""},{"comment_id":"1322741314433625","commenter_b":"MORE POWER TO THE AMERICAN PEOPLE AND GO SUCK AN EGG TO U DAM MUSLUMS.","commenter_a":"If that's what they want, let them start their own school, with their own money.","post_message":"JUST IN..."},{"comment_id":"876171829182663","commenter_b":"Moderate moslems DO NOT exist!","commenter_a":"YEP, They are ALL extremists, and should ALL be deported! Its simple!","post_message":"I'm not joking when I say this is the most important video I will ever share..."},{"comment_id":"1439879839405093","commenter_b":"@username this the lady I was talking about","commenter_a":"So beautiful I'd do the same without a doubt","post_message":"After her daughter's battle with leukaemia left her unable to carry to full term, Theresa offered to become a surrogate and gave birth to a healthy boy ❤️"},{"comment_id":"1071811879506489","commenter_b":"^ and I can see you sucking my cock @username.","commenter_a":"I can see Cruz flying a plane into a building or mountain.....","post_message":"Ted Cruz recently compared himself to Galileo, and compared those who accept climate change to flat-Earthers.  No. Just no.  Image via Forecast the Facts."}]
