[{"comment_id":"1811602825768086","commenter_b":"@username they voted for TRUMP because Hillary is lying criminal that should be locked up","commenter_a":"not surprising.... the KKK IS a dem organization so it makes perfect sense that they would be able to get the uniforms.","post_message":""},{"comment_id":"1684672748486504","commenter_b":"Just what is with these piece of shit that will videotape it and allow this to happen without breaking it up. They see a child standing there and they continue to videotape and not stop this fight. They are just as sick as the women that are fighting.","commenter_a":"Lowest of the lowest ignorant white trash. Why can't these fools go back and at least get a third grade education?","post_message":"WHAT!?   I can't believe what I just witnessed..."},{"comment_id":"1011931832233204","commenter_b":"They don't really care about fetuses either. If they did, they'd be storming fertility clinics, demanding that leftover embryos be implanted in someone's uterus. No, this whole thing is about controlling women.","commenter_a":"The Republicans & Right Wing Christians are trying to take woman back to the 50's. Women should know their place, sit down & shut up.","post_message":"After seeing all the pro-lifers cheer the attack on Planned Parenthood yesterday, it's time to remind ourselves of how they really feel about human life.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153259409494060","commenter_b":"Having engaged in a few discussions on the subject of party politics, I think the results of this quiz might suprise some of you. Go on give it a go.","commenter_a":"Could be good if it was resposnsive!","post_message":"Attention all eligible Britons! Not sure how to vote in this year's election? Take our election quiz: a blind test of the parties' policies. Then get yourself to a booth on May 7th @webpagelink"},{"comment_id":"1044742995559452","commenter_b":"Na lock her up n throw away the key, dont need her back in society","commenter_a":"Thanks for posting 3 separate mug shots of a clearly mentally ill person to parade her in front of your audience. Maybe you can sensationalize more Halloween hoarder homes while you're at it. I am glad Nickcole Dykema didn't actually hurt any Deputies (and she most likely could have, ambushing them in her own home like that), and glad the Deputies didn't kill her. This is a lesson for Police dealing w/ the mentally ill everywhere. I do hope this woman gets access to proper mental healthcare, and that through treatment she can find her way back into the world with peace and dignity.","post_message":"Multiple deputies received injuries at the \"house of horrors\"   From removing weapons from the \"booby trapped\" home"},{"comment_id":"10153059830708984","commenter_b":"F--k her, no I wouldn't","commenter_a":"Are you kidding?","post_message":"I can tell you right off the bat that I WON'T be participating in this. But I am not surprised to see this from Dems. Every chance they get..."},{"comment_id":"952878738162068","commenter_b":"Than go home! Are laws not yours","commenter_a":"mix bacon with it .../","post_message":"\"The Islamic form of slaughtering animals involves killing through a cut to neck when the animal is still alive. An Islamic prayer is then read as the blood is drained from the body. In the UK animals are legally required to be stunned before their neck is cut, but some Muslim argue this is against their religion.\""}]
