[{"comment_id":"10152722362786680","commenter_b":"Shut up","commenter_a":"NO","post_message":"\"I think presidents have the right to pick their team.\""},{"comment_id":"953377128015374","commenter_b":"Should if ate a snickers","commenter_a":"Of course it has gone viral.","post_message":"A 21-year-old was charged with beating her so-called friend unconscious over a hamburger. (Graphic warning: Video includes fight)>> kiro.tv/HamburgerBeating “I’m more hurt emotionally than physically.\""},{"comment_id":"10158604415035206","commenter_b":"@username The woman can speak five languages... get a grip","commenter_a":"I have never said anything negative about Barack Hussein Obama's wife, but since that's gonna be the new norm for the liberal lunatics, let me just say this. Melanie Trump has more class in her little finger than Michelle Obama ever had or ever will have. But just look at all the jealous women who are putting her down and all the worthless men with mangina's who are putting her down. You people are pathetic.","post_message":"“Melania will be an excellent first lady who will take Slovenian values of generosity, loyalty and trust to the United States and the world,\" said one fan from Melania's hometown."},{"comment_id":"1317807834918571","commenter_b":"Hillary Clintin is a nasty Woman, I like the sound of that truth.","commenter_a":"TRUMP = TRUTH","post_message":"WATCH LIVE: Donald J. Trump's campaign manager tells Bianna Golodryga about the \"rigged election\" claims."},{"comment_id":"10155469339470093","commenter_b":"NOOOOOOOOOOO!!! PLEASE no!!!!! Idiot progressives!!!","commenter_a":"Why would this NOT piss off everyone in NY who are legal tax paying American citizens??","post_message":"The impossible may soon become possible."},{"comment_id":"1875959669293549","commenter_b":"I believe that she should be charged. I wonder if that would have happened if it was a white MALE officer. Just wondering.","commenter_a":"I believe she checked it for a person.","post_message":"BREAKING: Tulsa police officer Betty Shelby has been charged with manslaughter in the first degree. Shelby fatally shot 40-year-old Terence Crutcher"},{"comment_id":"10153868800692377","commenter_b":"Hillary is a very nasty woman!!!","commenter_a":"He can call her what she is. A nasty woman. And it's just horrible......But she can call all of us deplorables and its ok. Don't be offended.","post_message":"Donald Trump stirred social media ire on Wednesday after he said, \"We have some bad hombres here\" and referred to Hillary Clinton as \"such a nasty woman.\""}]
