[{"comment_id":"10154818711864586","commenter_b":"BASTARDS","commenter_a":"these idiots should beSHOT!! \"COWARDS\"","post_message":"[GRAPHIC] If you drive a Toyota USA, General Motors, or Volkswagen car, you need to see this."},{"comment_id":"1007375585988585","commenter_b":"You're a bitch brady","commenter_a":"Yet another reason to dislike Tom Brady.","post_message":"Tom Brady's support for Trump may be as soft as his balls."},{"comment_id":"821893891240198","commenter_b":"Yes she does I don't believe not one of them dumb as hoes","commenter_a":"If Phylicia Rashad wasn't present when these incidents (allegedly) occurred, (but I would bet they did), then she has nothing of concrete value to say.","post_message":"“Forget these women. What you’re seeing is the destruction of a legacy.\" - Phylicia Rashad"},{"comment_id":"976047545785108","commenter_b":"Go go Hillary, you will be next USA-President.","commenter_a":"Go Hillary all the way","post_message":"“Beijing is normally very hot and very dry in September, but it just poured rain throughout the conference. The Chinese claimed that it was the fault of all these women in Beijing.” Watch the history of Hillary’s stirring speech at the 1995 UN Women’s Conference:"},{"comment_id":"758333967690514","commenter_b":"Pure, unadulterated ignorance. Lots of it going around. That guard shut them down","commenter_a":"Some people have no respect. So sad.","post_message":"These two men laughed at a military memorial. This guard shut them up without hesitation. Do you hate disrespectful people like that?"},{"comment_id":"1345530805539970","commenter_b":"@username again you also admitted to being a bitch so....","commenter_a":"It's funny that all these bad ass, gun toting, 2nd amendment conservatives seem to have no problem becoming Russia's bitch","post_message":"LOL! Thanks to Andy Borowitz for this helpful advice for Trump..."},{"comment_id":"10154453531128256","commenter_b":"I can see a domestic violence commercial. You go girl","commenter_a":"Well, question how do you work shooting or showing a weapon into a McDonald , Pepsi , Kentucky Fried Chicken, Nike commercial? Just asking, maybe that's why no offers.","post_message":"While companies like Winchester, Beretta and Otis Technology support Team USA's Kim Rhode, she doesn't have a single sponsor from outside the firearm industry."}]
