[{"comment_id":"1665137810414324","commenter_b":"Beyonce is a racist and a cop hater.","commenter_a":"God Bless You.","post_message":"Whoa, this outspoken Obama critic didn't hold back at all when discussing Beyonce's Super Bowl halftime performance... and he pointed out EXACTLY what made it so hypocritical.  If you thought Beyonce's halftime performance was unacceptable, spread this video far and wide,,,"},{"comment_id":"457572411058203","commenter_b":"I hate that vile bitch. Dumbest wokman on the planet.","commenter_a":"Sarah and her offspring are all a blight on humanity and whatnot, but the dog doesn't seem bothered. That said I still wouldn't stand on a dog..","post_message":"Just when you thought Sarah Palin couldn't sink any lower, this happens. If this woman can't teach her own kids to have respect for animals, she has no business even thinking about running for anything in 2016.  ~Darrell"},{"comment_id":"1108272855874801","commenter_b":"she has a penis","commenter_a":"She looks like a man..","post_message":"Terrible!"},{"comment_id":"1210812922267700","commenter_b":"Fools! All of them!","commenter_a":"Liberalism hit squads at their finnest huh Rush.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154048567109203","commenter_b":"She's a turd","commenter_a":"Hillary 2016","post_message":"How could you, Will Ferrell??"},{"comment_id":"684314941708338","commenter_b":"You pussy","commenter_a":"A vote for Trump is a blatant vote for racism. I'm so embarrassed at the people who support such hatred.","post_message":"Skywriters' message for Donald J. Trump: 'America is great. Trump is disgusting,'"},{"comment_id":"447635222089017","commenter_b":"You are probably pro abortion cause you hate child support...","commenter_a":"This is great. You idiots that are against abortion are just that Idiots. Quite trying to take rights from Women . Plus Planned Parenthood doesn't pay for abortions. The client does. They provide health care. Get your facts right.","post_message":"JUST IN: A Houston grand jury investigating undercover footage of Planned Parenthood found no wrongdoing by the abortion provider but instead indicted anti-abortion activists involved in making the videos that provoked outrage among Republican leaders nationwide."}]
