[{"comment_id":"1420287694697641","commenter_b":"So where should she be deported for blatantly taking advantage of British taxpayers?","commenter_a":"Reminds me of my mum 9 kids 3 adopted. 4 in care and 2 stayed with her if you cant look after that many kids don't have them ! Keep your legs closed and get your tubes tied !! Why they didn't do that anyway is beyond me","post_message":"'She should have had her tubes tied'"},{"comment_id":"10154001788011770","commenter_b":"They not that sexy to me at all need some meat on the bones Sarah Palin is sexy","commenter_a":"Mama's baby papas maybe They look nothing alike","post_message":"Gigi and Bella Hadid proved they are the sexiest sisters in the world at the Victoria's Secret Fashion Show."},{"comment_id":"934978476568908","commenter_b":"Hahahahaha","commenter_a":"'@username Jeff Smolen @username lmao","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"782076235316287","commenter_b":"Go now obama!","commenter_a":"Yes please leave if you are offended by our flag or if you disrespect it. LEAVE","post_message":"SHARE if you agree!"},{"comment_id":"836575966473062","commenter_b":"Crooked Hillary is the scum of the Earth","commenter_a":"His campaign is a trainwreck.","post_message":"Meet Trump's new campaign chief: a man whose 'news' organization, Breitbart, is known for its racist, homophobic, conspiracy-peddling stories."},{"comment_id":"10153548972367093","commenter_b":"LOL. Go back to California.","commenter_a":"This Texan will be voting ALL BLUE in November! Bigotry and hatred has to end! #voteTxBlue - you #GOP small minded idiots don't remember that Texas WAS a blue state for a long time! LBJ was a Democrat from Texas, and TX was a Blue state until 1994!","post_message":"With Trump as the Republican nominee, Clinton thinks a large turnout of minority voters could put Texas in play... @webpagelink"},{"comment_id":"10153242802786336","commenter_b":"She needs to step down. Bad form lady!","commenter_a":"recue her self all the way back to college, and stay awake the second time around , , and learn the law. don't judge out of hate to please your president and holder ,and al.","post_message":"Defense attorneys representing six Baltimore police officers charged in the death of Freddie Gray filed a motion to have the case dismissed, or for the city’s top prosecutor to be replaced."}]
