[{"comment_id":"10153739265778984","commenter_b":"No need to wonder what you are, being from Liberfornia and all.","commenter_a":"I 100% support her staying in jail until she agrees to do her job as ordered by a federal judge.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"},{"comment_id":"10152852795208717","commenter_b":"@username -- if this Somersworth Daycare is any indication - its quite close to $5/hr over a week -- even for infants at 214/week divide by 5 = ~43/day, and more than likely >8 hr day in daycare as the parents have to work 8+hrs plus travel... @webpagelink","commenter_a":"Daycare rate in nh is $5 per hour. Google it and check the rates. Which I did a pathetic rate.","post_message":"Do you think $13.44 is a fair rate for babysitters?"},{"comment_id":"1429758383703081","commenter_b":"Drain the swamp!","commenter_a":"If this is true the whole bunch including the Obamas need to be in prison. All the laws from the last 8 years need to be scaled back, especially the executive orders. So ridiculous that a birth certificate isn't presented before even running for president. So sick!","post_message":"You already know that Barack Obama's \"birth certificate image\" has been demonstrated to be fake. But now, the trail into the deception goes deeper, as the investigator handling the case has concluded that government officials were involved in the fraud that transformed America ..."},{"comment_id":"10153953968561491","commenter_b":"@username: get it right. SAD!","commenter_a":"when in the hell? @username @username","post_message":"\"Trump’s message to young people of color is simple: what do you have to lose? In my young optimistic eyes, after the last eight years of the Obama presidency, there is little left to lose.\""},{"comment_id":"10153218033713188","commenter_b":"That Mormons even call themselves Christians is a relatively new phenomenon. It dates back to at best sometime in the late 70s/early 80s. I remember a girl in my youth group had brought one of her Mormon friends one summer's eve, and I got into a conversation with her and I'll remember what she said til the day I die- \"I'm not a Christian, I'm a Mormon!\" That would have been 74 or 75. Also, the concept that \"As God was, so man is; as God is so man may become\" is utterly missing from the other thee Abrahamic faiths.","commenter_a":"Um, no. The miracle IS the resurrection. The result is the atonement.","post_message":"A little bit of what I spoke about at church Sunday."},{"comment_id":"1297507013642106","commenter_b":"STFU dumb bitch","commenter_a":"That bitch & her sleazy family need to STFU","post_message":"Palin should leave President Obama and his family alone."},{"comment_id":"10155543749229778","commenter_b":"Perhaps she is the right choice since we'll be obstructing the GOP for the next four years...","commenter_a":"Things are going great. More of the same!!!","post_message":"Rep. Nancy Pelosi won another term Wednesday morning as the leader of House Democrats, turning back calls from some in recent weeks who said it was time for a change."}]
