[{"comment_id":"10150603929279999","commenter_b":"Aren't they real women? What's a real woman, and who doesn't qualify ?","commenter_a":"Perhaps a more diverse group by race, ethnicity and cultural but alarmingly the same re: the skinny, young and sullen look of mannequins rather than real women...","post_message":"Meet the woman behind the unconventional beauty of today's most successful models."},{"comment_id":"10152763572857434","commenter_b":"#whitegirlsbeefin","commenter_a":"Alcoholism is funny if it's at a wedding #sarcasm","post_message":"To say the bride was displeased is a major understatement"},{"comment_id":"397229163813931","commenter_b":"Get these people deported","commenter_a":"if these goat humpers do not like the laws of the US they are free to leave any time they want","post_message":"Shock Poll! More than HALF of Muslim-Americans Think They Should be Allowed to be Governed by Sharia Law!"},{"comment_id":"10153765289899726","commenter_b":"Come to my house and more than their head will fly out the window. #semperfi","commenter_a":"Now, does Allah have 73 virgins for her too?","post_message":"Bomber's severed head 'flew out the window'"},{"comment_id":"10154512685084411","commenter_b":"No copy paste","commenter_a":"copy paste. This is what you do ? Be creative guys.","post_message":"The Big Mac is dead, long live the DonMac!"},{"comment_id":"1630331337026989","commenter_b":"@username Yes. That is certainly a tragedy which no one denies. These people were murdered and their sacrifice should be honored. This article is stating that obama could have stoped it and deliberately did not. This is fake news at its highest degree and is shameful because it uses the dead to tell a lie.","commenter_a":"Fake news: Moreover, the majority report issued by the House Select Committee on Benghazi plainly stated that, minutes after learning about the ongoing attack at the U.S. diplomatic compound, President Obama and Secretary of Defense Leon Panetta issued \"clear orders to deploy military assets\":","post_message":"Here's the proof folks. Both Hillary Clinton AND Barack Obama are now exposed for not pulling the trigger to save anyone's life in Benghazi, when they could. This is the end of their careers! Let's get 5,000 shares if you think they should both be locked away for war crimes."},{"comment_id":"10153304044791336","commenter_b":"Hope they show up in mine, I'll send them to hell.","commenter_a":"Please study these faces they could turn up in your neighborhood","post_message":"The five Taliban leaders traded a year ago for Sgt. Bowe Bergdahl could be free to travel as early as Monday as the terms of their supervised release are set to expire."}]
