[{"comment_id":"913594125361987","commenter_b":"Go ahead vote for her! Stink up America some more you fools!","commenter_a":"She's right, we can't let a Republican in the White House. Vote Blue and support whichever candidate wins the Democratic nomination. I happen to think Hillary has a better chance of beating any Republican, but Bernie as our president would be awesome too.","post_message":"YES! Whether you're a Bernie or Hillary supporter, there's no denying the debate audience really loved Hillary's closing remarks. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1304540879566920","commenter_b":"If Gwyneth puts it in Goop, it's not a feminist thing, lol","commenter_a":"This is a feminist thing, eh?","post_message":"Don't put herbs in your vagina, for goodness sake. Your womb doesn't need a freaking detox."},{"comment_id":"10153834062371337","commenter_b":"You win the Internet today!!!","commenter_a":"Well, maybe when they introduce an HIV vaccine, she can get vaccinated.... Oh, wait...nevermind.","post_message":"Jenny McCarthy is not taking the Charlie Sheen news well..."},{"comment_id":"1723416237718117","commenter_b":"In my book, Angela Merkel will go down as one of the greatest people to have walked the earth. She opened the door for strangers when everyone else closed theirs. There were far worse atrocities happening in Germany and Europe before the arrival of immigrants. Xenophobes that previously had no excuse for their hate are happy to see their own people killed by minority terrorists just to justify their hatred for the rest of humanity.","commenter_a":"Merkel should be tried for treason. She is directly responsible for all of the sexual assaults and murders that have taken place!","post_message":"You can ban the burka, Frau Merkel. But what are you going to do about banning the migrant boats YOU encouraged to come and which are destroying your country?"},{"comment_id":"10153504938416336","commenter_b":"This woman, is what evil looks like. They all must be shut down!!!!!!!!!!!!!!!!!!!!","commenter_a":"Wonder what she would do with video of Charlie boy's gang inside the Tate house? Give them medals? #FreeCharlie!","post_message":"Calif. AG Kamala Harris will use her office’s authority to regulate charity organizations to see if the organization that made the videos violated registration or reporting requirements, or broke any other rules."},{"comment_id":"10153512316881130","commenter_b":"Classy old gal she is....lmao","commenter_a":"I don't know about that if your kid is old enough to eat real food with a spoon its time to take them off the tit.","post_message":"\"There's no difference in me feeding my baby with my breast than you feeding yourself with a spoon.\""},{"comment_id":"719584654846906","commenter_b":"LOL, OH LET HER, SHE'S THE CRIMINAL, DO YOU LIVE UNDER A ROCK?","commenter_a":"Con-man-Don, \"The Conald\", just a Common Carpet Bagger wanting to benefit from the ruin he would inflict on America. @username needs to call him to the carpet and allow the Criminal Justice system have their way with him.","post_message":"Donald Trump has painted a dark, divisive picture of America. We have 102 days to stop him from becoming president."}]
