[{"comment_id":"809196999209345","commenter_b":"you are so full of it jeb - and you don't stand a chance. even insane republicans are done with the bushes. what's the policy on a presidential candidate's brother being a wanted war criminal????","commenter_a":"I am saying \"boo,\" not \"boo Jeb,\" though I AM booing Jeb. Boo!","post_message":"Most passionate moments of #DemDebate are always about who will ban more guns and who will give the gov't more control over your health care."},{"comment_id":"1109027105857009","commenter_b":"As the meme says, \"If you don't have a vagina and womb, keep out of mine!\"","commenter_a":"I support Bernie. Because I can't stand either Hillary or Trump. And because he wants Single Payer health care. But the Democrats are insane to support abortion rights. We will ALL be held accountable before God for the murder of our children.","post_message":"We're PROUD to be Democrats. Are YOU?"},{"comment_id":"1119713804747813","commenter_b":"No-chin bitch.","commenter_a":"I'm changing my first name.","post_message":"Image from Go After the Bad Guys"},{"comment_id":"10153179958482377","commenter_b":"I agree - feed her to pigs and feed the pigs to refugees!","commenter_a":"Feed them to pigs, then send the excrement to Mosques","post_message":"No Muslim mosques have offered to conduct a funeral for the terrorist wife. If not claimed, her body will be cremated at taxpayers' expense but there's more...@webpagelink"},{"comment_id":"10152959541546519","commenter_b":"But it's totally cool that the white women told the black kids to go back to their Section 8 housing, right? Ugh.","commenter_a":"I truly wish people would read the whole story before commenting. This was one of 2 cops (until backup arrived) who had just been charged by dozens of young adults and teens. He has every right to fear for his safety...AND he has every right to restrain a \"kid\" who is illegally trespassing in a gated community and trying to run every chance she gets.","post_message":"This cop picked the wrong kid to harass and abuse..."},{"comment_id":"733367520187159","commenter_b":"we need to get these low lifes out of our country","commenter_a":"I am offended by them. I don't want to take them down but can we send them home. I m gladly contribute with the air fair","post_message":"Muslims Make Massive Move To Change The Flag Because It's Offensive If you don't like the flag you can leave. Do you think this is absurd?"},{"comment_id":"854169234726517","commenter_b":"How about rapist?","commenter_a":"If trump is despicable, what does that make Hillary ?","post_message":"\"He’s just despicable,\" Letterman said, adding that Donald J. Trump may very well prove the saying that \"anyone can grow up to be president.\""}]
