[{"comment_id":"10153904847648128","commenter_b":"100% true","commenter_a":"Miss Colombia says: happens for a reason. Now Steve Harvey, Miss Colombia, and Miss Philippines are more famous than if the crowning had been flub-free.","post_message":"This year's Miss Universe is Miss Philippines, Pia Alonzo Wurtzbach, but host Steve Harvey initially announced the runner-up, Miss Colombia, as the winner."},{"comment_id":"10153722777028822","commenter_b":"if that female can do it and make it big go for it i would like to see it","commenter_a":"Its bound to happen because they are plentiful and killing it in the minors and its just a matter of time before one breaks into the big leagues. Smh...","post_message":"What do you think? Do you agree with Pittsburgh Pirates manager Clint Hurdle?"},{"comment_id":"1069182599857726","commenter_b":"Fine, you'll never get another cent! You bitch or butch or Satan worshiper!","commenter_a":"Their coffee tastes like shit anyway.","post_message":"Starbucks CEO takes hard stand. They just lost our business forever. Will you go somewhere else to get your coffee from now on?"},{"comment_id":"1051849191502758","commenter_b":"Dirty lady lol","commenter_a":"I WANT PICTURES !!","post_message":"How do you measure up?"},{"comment_id":"726384220793520","commenter_b":"Mostly things that happen bad in this country always happen in Texas are with someone from Texas","commenter_a":"That kinda stuff goes on all the time in Texas","post_message":"Terrible."},{"comment_id":"985183654870370","commenter_b":"She's tripping.......","commenter_a":"She got a low i.q. and a low self esteem. Your kids should come before any man. They always say a fool and their money will soon part. And soon, it will all be gone and so will he.","post_message":"The N.C. woman who won a $188 million Powerball last February is facing an onslaught of criticism after she posted a $12 million bond for her boyfriend…for the fourth time. Lamarr (Hot Sauce) McDow was arrested Tuesday for violating the terms of his pre-trial release. As NewsOne reported last year, Marie Holmes, 26, posted bond for McDow three times — once just weeks after she collected her winnings ($3 million), once in August ($6 million) and again in October after he was arrested for possession of a firearm by a felon. Is the public being too hard on Holmes? Is it any of our business what she does with her money? Let us know ----> @webpagelink"},{"comment_id":"756693807767590","commenter_b":"Ian","commenter_a":"Joshua","post_message":"...bruh"}]
