[{"comment_id":"10153910150514657","commenter_b":"Go home","commenter_a":"GITMO","post_message":"One doesn't have to think long or hard about how this would play if Hillary Clinton were a Republican (which she once was)."},{"comment_id":"10157577335255389","commenter_b":"Gonna rain in wall street. The same ones you took millions from you pathetic lying hag","commenter_a":"its hard to listen to her speaks! the first thing came out of her mouth was Trump says did and Trump says that and what Trump did! nothing change she offer nothing! she looks doll up but still a liar!!","post_message":"Journalism. Is. Dead."},{"comment_id":"10155425708285354","commenter_b":"this.mother.fucker.die.when.does.it.end.helloooooo","commenter_a":"Clearly seeking a larger selection pool for White House jobs.","post_message":"Take a look at the rap sheets of the 22 convicted criminals Obama just pardoned..."},{"comment_id":"10153211085979087","commenter_b":"I am not afraid and I know no one who is. Though I support you Dr. Carson, you are wrong. Close the border to Muslims until we can sort all this out. Israel has it right, they profile and so should we.","commenter_a":"So I on board.","post_message":"\"We are losing this war while America looks and feels afraid at home,\" Dr. Ben Carson writes in an op-ed for The Hill. \"By the jihadists’ measure, they are winning. They have changed our country, created a republic of fear and, as Osama bin Laden predicted, his enemies are destroying themselves.\""},{"comment_id":"10154866849395329","commenter_b":"Becky with the good hair have a stadium full of seats please","commenter_a":"*21 things no one asked for. There, fixed it. *waits for angry Trump supporters to start complaining in the comments*","post_message":"We asked Donald J. Trump supporters to write down a misconception about them and here's what happened."},{"comment_id":"10154263730768271","commenter_b":"Perhaps MaryAnn Kosimko would like to be grabbed by the pussy too and go to war while she's at it... what ever you're smoking STOP...","commenter_a":"Yes! We need him for president! Strong! Cares for this Counrty. He's not doing this for the money- he has Money. He can't be bought!! ( not like some one) He is doing this because he wants to make American strong. We have been brow beaten for 8 years. I'm tired of that, aren't you? We need to be Strong and Proud of who we are: Citizens one a great country. We need Trump as our Leader. We don't won't a dictator.","post_message":"JUST IN: Donald Trump will hold a campaign rally in Denver Saturday night as the cherry on top of a busy week in Colorado politics, filled with visits from both major campaigns."},{"comment_id":"1143390539087332","commenter_b":"#HillaryALLTheWay #HillaryClinton2016 #ImWithHer #MadamPresident #Hillary2016 #OutForHillary #ShesWithUs #WomanCard #StandWithHillary! #TeamClinton #LoveTrumpsHate #Ready4MadamPresident #DealMeIn #GoHillary #HillaryForMe #HillaryForPresident #Rally4Hill2016","commenter_a":"Oh Lisa Lampanelli never fails....","post_message":"LOL! The look on his face is PRICELESS."}]
