[{"comment_id":"803355223130806","commenter_b":"we love newt, let the whole world know about her shady crap , we don't care about your tax release, she has the nerve to talk crap about that and look at her hiding server deleated emails, noooooo way. go TRUMP","commenter_a":"Good Luck with Today President Trump!!Go Gently, but be Strong!! Stand Your Ground but be Humble!! America needs You!!","post_message":"\"Speaker Newt Gingrich pointed out the pay disparity between male and female executives at the Clinton Foundation, where men earn 38 percent more on average, before telling viewers that Trump is more pro-woman than the former secretary of state. He also noted that this likely would come as a \"shock\" to many voters.\""},{"comment_id":"10153413861058352","commenter_b":"Keep raping her for the rest of her life like she did to her grands","commenter_a":"Sick piece of shit","post_message":"Woman sent to jail for the rest of her life after raping her four grandchildren is described as the ‘most evil person’ the judge has ever seen. #STILLTRENDING"},{"comment_id":"10155893621460231","commenter_b":"That's her prerogative ....","commenter_a":"Take it are leave it! but get a life.","post_message":"The singer—along with a lot of other people—isn’t buying it."},{"comment_id":"10156149888525389","commenter_b":"Now they are coming over by sea they are still illegalls","commenter_a":"Oh Great,more people coming in !!","post_message":"A Miami Beach Police spokesperson said it is unknown how long the group were at sea."},{"comment_id":"10154184530456167","commenter_b":"And before anyone gets on me for it, personhood is moot and an unsupportable argument because of bodily sovereignty. Nobody, adult or child or fetus, is entitled to use someone else's body parts without their permission, EVER. If you have kidney disease you don't get to take someone else's kidney by force - not even if your life depends on it and you'll die painfully if you don't get it. If you have leukemia and need bone marrow, you cannot take it from someone else without their consent - even though marrow is fully replaceable by a healthy adult and it'd only be a temporary inconvenience to them. Men can't use a woman's genitals for their own pleasure unless she consents - that's why rape is (supposedly) a crime (even though punishment for it has been tragically lax these days). A woman's uterus is HER body part, she has it ...","commenter_a":"It's just a political witch hunt, like usual. It's not about women's safety or anything like that - it's about earning points with their base on the backs of Texas' poor women.","post_message":"**Fourteen** investigations have cleared Planned Parenthood of all wrongdoing, for starters."},{"comment_id":"10153427375089726","commenter_b":"this brain dead old witch needs to be in a mental ward","commenter_a":"Congress can deny funding and they better. Premiums are going through the roof . Supreme are bunch of liberals out of touch with the average folks.","post_message":"According to Pelosi, Scalia ... joined the majority?  @webpagelink"},{"comment_id":"10154165459449087","commenter_b":"Don't stir up the bear, pussy!","commenter_a":"Yet more pathetic infantile nonsense from the shit house otherwise known as the white house","post_message":"The White House is vowing to retaliate without warning to Russia's alleged hacking."}]
