[{"comment_id":"1245500588795529","commenter_b":"Clinton thugs!","commenter_a":"@username-- You proud of this?? After watching this, I'm gladly giving my vote to Trump now. These Mexicans don't represent me, & aren't \"Americans\" acting like thugs.","post_message":"MUST WATCH: Video documents months of violent attacks by the radical left on Donald Trump supporters that are COMPLETELY ignored by the mainstream media. This video compilation shows Trump fans assaulted all ACROSS the nation. Worse and not surprising, the media, the left, and Hillary Clinton herself BLAME Trump for these violent assaults when they should be blaming those attacking the Trump supporters. Show your support for Trump by getting the TRUMP: REAL HOPE, REAL CHANGE bumpersticker! --> @webpagelink"},{"comment_id":"10154251674646636","commenter_b":"O don't back benefit sanctions , however if your gonna make a living out of claiming benefits do the job right , simple as","commenter_a":"He has a sighted carer (his brother) who opens all his mail and should have done it. Obviously they had never requested braille correspondence. So on that aspect I (for once) can't fault the DSS however to not reinstate the money after they appealed the decision is just ridiculous.","post_message":"Awful"},{"comment_id":"836130403149880","commenter_b":"Yes please an easy will for Hillary!","commenter_a":"Get em Sarah! We want you!!","post_message":"“I’m ready for Hillary, are you? Are you coming?” - Sarah Palin"},{"comment_id":"1105433506199543","commenter_b":"This Woman is not Presidential Material ! Please don't listen to her lies!","commenter_a":"So true","post_message":"#NeverHillary Allen West Republic @webpagelink"},{"comment_id":"388626891261906","commenter_b":"Rick have the nerve and turn them in!","commenter_a":"should politicians?","post_message":"This could be bad news for some people on food stamps."},{"comment_id":"10153123506246770","commenter_b":"I have zero respect for someone who marries a low-IQ maid.","commenter_a":"But he is more concerned about foreigners who break our laws than citizens! See ya!","post_message":"Danny Diaz, campaign manager for Republican presidential candidate Jeb Bush, told The Daily Caller that Bush opposes abortion and would not promote it as president."},{"comment_id":"10154473639164749","commenter_b":"Rebecca Jara","commenter_a":"carry knife free zone signs with them. they are very powerful deterrents.","post_message":"\"I would urge parents to speak to their children about the app and the best ways to make sure they stay safe.\""}]
