[{"comment_id":"635715443285701","commenter_b":"Should have knocked her out cold","commenter_a":"shoot that bitch with that soldiers gun.","post_message":"This liberal garbage spit in a soldier's face, receives instant karma.  What a pig. If you don't support our troops you can leave.  Do you agree she got exactly what she deserved?"},{"comment_id":"10154443469472293","commenter_b":"Lady you are what makes liberals look stupid.","commenter_a":"Her rapist will be the next GOP candidate for president.","post_message":"Police were called to his $5 million mansion after a 21-year-old was allegedly assaulted at his annual Halloween gathering."},{"comment_id":"10153396919359087","commenter_b":"X Liberal Pussies who Pimp for Islam! It's Simply one of the MOST Bizzzzaaarre Psychological Spectacles of our Time! The ODD Relationship (do I say 'Love Affair') between ISLAM and LIBERALISM is a WEIRD thing to watch. HELLO!! Liberal FEMINIST Women!! Islam is a SEXIST Male Dominated, Woman TRASHING 'Religion'!! Liberals MOCK, RIDICULE Christianity, then turn around and Protect Islam's 1400 Year 'War on Women' which Treats women like Chattel, and Stones Women to DEATH for adultery. 'Honor Kills' women when their men feel their women aren't obedient, Muslim MEN FORCE Women into castration, Slavery, to wear scarves, and Burkas!! Muslim Women aren't allowed to Drive and be Educated yet Liberals want to be 'tolerant' to Islam, but want Christianity to CHANGE!!?? Oh, and GAYS end up on the wrong side of the Stones/BladesToo!!","commenter_a":"Thank you President Obama. I'm so glad I'm not a pussy like most of the commenters here that live in fear of the great big scary Muslims. It must suck to go to bed at night clinging to their guns and religion wetting their pants afraid that Muslims are coming to kill their family. I'm glad I have a president that rises above that childish fear. I'm blessed that God hasn't made me a coward like so many of my countrymen who would gladly trade their freedoms for the veined vail of security. Cowards all of you. And I already know their response. They will call me a delusional libtard that loves Muslims. Without realizing the irony that these were the same people that called white civil rights activists 'n***ger lovers'. This generation of dolts, will too, be wiped away with time.","post_message":"“It was so moving for Michelle and myself in part because it was so representative of the country. You had people from every background, every faith,” President Barack Obama  said after meeting the families of San Bernardino victims.  “Some described their loved ones who had come to this country as immigrants; others who had lived in the area all their lives — all of them extraordinarily proud of the work they were doing to keep people healthy and safe here in this community.”"},{"comment_id":"10153550520716336","commenter_b":"Hillary might be in jail.","commenter_a":"It's obvious that @username wants Jeb Bush to be the Republican nominee. On the Debate last night, NO ONE received harder questions than Donald Trump. NO ONE! I don't want Jeb Bush or Donald Trump to be the nominee. @username you're NOT being Fair and Balanced.","post_message":"Which GOP presidential candidate do you think gave the most impressive performance during the Fox News-Facebook prime-time debate?"},{"comment_id":"10153907055674199","commenter_b":"She's a straight up hood rat.","commenter_a":"I normally don't comment on things like this, but she has to be very cold hearted to cheer the death of anyone. The actions of some do not represent all. #alllivesmatter","post_message":"'This behavior is unacceptable & does not represent our brand's values & ethics. The franchisee has terminated the employee.'"},{"comment_id":"10158446067150354","commenter_b":"You little queer. I think my grandkids could fuck you up, fag!","commenter_a":"You won't stand a chance asshole come on bring it I'll save a hospital Bed it's waiting on you fucking RACIST RAT","post_message":"The shutdown of MILO event at UC Davis may be a preview of what to expect at next week inauguration of Donald Trump.   Just who are these hooligans?  Lee Stranahan investigates..."},{"comment_id":"10153956657931336","commenter_b":"Amen she needs to go to jail u r correct","commenter_a":"112 million raised and supposedly all from minorities and women. This woman is the single biggest threat to our country. She is actually worse than Obama and as we know that is as bad as it gets. The nazi queen needs to go to prison","post_message":"The Hillary Clinton campaign said that puts her total raised in 2015 to spend on the presidential primary campaign at $112 million."}]
