[{"comment_id":"10158052080890594","commenter_b":"@username Stop being dramatic. Trump's own wife is an immigrant. The only issue is with those here illegally. They should be deported under existing law.","commenter_a":"As long as you are here legally, there's nothing to fear.","post_message":""},{"comment_id":"10154085001886800","commenter_b":"Eve, the most hated woman to ever exist.","commenter_a":"More specifically, women are paying for it. Eve ate the apple, now we're cursed with periods, painful pregnancy, and really shitty mood swings.","post_message":"Connecticut lawmakers want to get rid of the statute of limitations on child sex abuse cases, but they're running into opposition from the Roman Catholic Church."},{"comment_id":"10153441968716756","commenter_b":"Then by your logic no couple on the street should be holding hands or kiss, or hug. You can't just say keep it to yourself. That has been the norm for years. They are tired of hiding. They want to be free like you and me. They want to walk down the street holding hands, they want to marry and they want you to keep your personal preferences to yourself.","commenter_a":"I don't care who you marry Just don't shove it down my throat.","post_message":"The briefs against bans on gay marriage come from the traditional allies -- and some surprising ones: small businesses, law enforcement officers and some Republicans."},{"comment_id":"10153551927158352","commenter_b":"Kill this bitch","commenter_a":"An eye for an eye!!! Babies are innocent little gifts from God!!!!! There are no excuses!! I have no pity for her!!! She will answer for it!!!!","post_message":"Woman, 22, gave birth in tub in secret then dumped her baby in trash compactor – and was only caught because nosy janitor opened suspicious box"},{"comment_id":"1276618955685054","commenter_b":"When are these yahoos going to discuss issues that are important to the American people???","commenter_a":"The funniest joke is Rubio not winning his own state. Hysterical. \"Two weeks left buddy, & counting.\"","post_message":"Spray tan? Is Marco Rubio trying to beat Donald Trump by doing his best impression of Donald Trump?"},{"comment_id":"785168271673750","commenter_b":"These BUTTs ( Bad Uncivilized Terrorist Thugs ) are just showing what they are, BUTTs, they are just showing their colors, this is a sign of ignorance. If this people would listen to intelligent people they would know that pants up don't loot is the best way to go.","commenter_a":"If they want to look like idiots....it's their choice....there are other more pressing issues that is worrisome !!!!","post_message":"Louisiana Passes New Law That Will Fine Anyone Wearing Saggy Pants.  This is amazing. It should be a law in all 50 states.  Do you support this new law?"},{"comment_id":"10153762341043869","commenter_b":"look in g good.","commenter_a":"legend cinemas click the here ..... do not insult before trying X-Men: Apocalypse Full Movie @webpagelink Rangoon 2016 @webpagelink All Ladies do it (1992) @webpagelink Monella @webpagelink captain-america-civil war @webpagelink The Jungle Book Full Movie @webpagelink Batman v Superman: Dawn of Justice Full Movie @webpagelink Barbershop: The Next Cut Full Movie @webpagelink London Has Fallen Full Movie @webpagelink zootopia Full Movie @webpagelink Central Intelligence Full Movie @webpagelink deadpool movie 2016 @webpagelink ride-along @webpagelink The legend of Tarzan @webpagelink fifty shades2016 @webpagelink","post_message":"Like most of his predecessors, Barack Obama used the bombing as a generic invocation of the nuclear age—past tense, passive voice, Alex Wellerstein writes."}]
