[{"comment_id":"495256197331627","commenter_b":"She can't ban nothing she is just a picture hanging on the wall so tell her to stay out of Americans business","commenter_a":"So sad","post_message":"What Michelle Obama is banning now is just plain unacceptable.  The American people are tired and finally fighting back.  Do you agree Michelle Obama should mind her own business?"},{"comment_id":"554676768026413","commenter_b":"Lu Fo see the top comments and it really shows how the middle class sees the negative effects of raising the minimum wage","commenter_a":"so small businesses will make sure they will not hire that 26th person","post_message":"BREAKING: California became the first state in the nation to commit to a $15 per hour minimum wage after Gov. Jerry Brown signed the new law Monday.   Under the plan, minimum wage was expected to increase to $10.50 per hour on Jan. 1, 2017 for businesses with 26 or more employees.  The minimum wage would then rise each year until it reaches $15 per hour in 2022."},{"comment_id":"1123039051096182","commenter_b":"'@username Y u so MAD!","commenter_a":"Everyone who verbally attacks BLM are silent supporters of the kkk!! Show me why u hate BLM so much. Show us pics of the smiling around a dead white person or any other ethnic groups body!!! U can't so fuck u","post_message":"Lol: #Virginia #police pulls a woman over for driving without an ice cream cone!  #WSHH"},{"comment_id":"786188861571691","commenter_b":"That is stupid why can't the welfare people get a job and beside who going to pay for their car insurance and car payment get real","commenter_a":"This is not true.if so think about the timing of it Killary is losing against Donald Trump and she is going to try and bye your votes but we are all to smart for that","post_message":"Congress Approves Bill Offering Free Cars To Welfare Recipients. Your tax dollars hard at work. Does this disgust you?"},{"comment_id":"10153966142134411","commenter_b":"Ahaha...Bryndzova giving all you nazis away...hahahahaha","commenter_a":"Bandera was a patriot who fought the Soviet murderers in his country.Glory to Ukraine!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154024040699497","commenter_b":"Stop being such a pussy!","commenter_a":"And people are just standing for this? I follow the Onion, and certainly didn't fall in line with Justice Scalia's opinions, but let me tell you this - this is a new standard of low. I could leave a brief comment, but this is so far beyond the usual pallor of any statement even a satirical form of journal should ever make, I find myself disgusted into making a statement. As human beings, we are all equal in death, but as Americans, we are something more. We are held to a certain equity of values that we inherit no matter where we fall on the narrow spectrum of political attitudes held in this country. And I am personally offended by the scrapping masses of groundlings hurling insults about a dead political figure before his family had even had a chance to attend the funeral. Shame on all of you. Good ...","post_message":"BREAKING:"},{"comment_id":"10153668595164099","commenter_b":"This woman again? The Nurse who doesn't care if she infects everyone else? Go away! Your 15 minutes are over.","commenter_a":"Why are there so many greedy people in health care.","post_message":"never had Ebola. I never had symptoms of Ebola. I tested negative for Ebola the first night I stayed in New Jersey governor Chris Christie private prison, Kaci Hickox, 34, said. -----> @webpagelink"}]
