[{"comment_id":"10153699957431336","commenter_b":"Muslims need to stay in the Middle East. Or hell. Same thing.","commenter_a":"The Tsarnaev brothers were \"refugees\". Don't forget that.","post_message":"Secretary of State John Kerry says the U.S. will accept 85,000 refugees from around the world next year, up from 70,000, and the number will rise to 100,000 in 2017."},{"comment_id":"10153782383018984","commenter_b":"Yes I agree with the teacher. With the country like it is, how did she know it was not a bomb. Thank, to her for keeping our students safe. I wish they would all go back to there own Country .","commenter_a":"Just wanting to get more free money. They need to kick the whole damn family out of the country.","post_message":"There's already plenty of controversy and speculation surrounding the case of the 14-year-old boy Ahmed Mohamed, who brought his clock to school - and now what his family just did is taking it all one step further, Do you still stand by this school's decision to call the authorities?"},{"comment_id":"680890588768186","commenter_b":"Close them all down and get rid of all the Muslims!!! They dont belong here in Our Country!!!","commenter_a":"Donald Trump is our man and he has the balls to stand up and speak his mine for the people to help us to clean our house and to put the people who made this mess were they belong. We need to get our country back in working conditions. Get our school back saying the pledge ALEIGENT and believing in God again. So let's get our flag flying high and our spirits back. And this rotten president out with his terrorist people and kicking all to the curve (this mean get them the hell out of our Country they destroy our country enough. ).","post_message":"Donald Trump announced his plan to close Mosques, but keep watching. Muslims everywhere are furious. But he doesn't care. Do you support Donald Trump?"},{"comment_id":"10154573950249411","commenter_b":"Wow, it's funny how Democrats claim to be the party of love and tolerance but all her supports sound like you, ignorant!","commenter_a":"Way before this his own party should have replaced this dumb ass! And his dumbed down supporters have only remarks about Clinton whenever this ass wipe says and does something outrageously stupid! Shows they have the same low mentality as Trump! Trump doesn't have the smarts or the temperament for this position. Anyone who would want this dummy anywhere near some nuclear button are just as delusional as Trump or just as dumb and sure don't give two shits about this country! Trump will never ever be president of this country and we can look forward to one of the biggest meltdown and temper tantrums from this maggot!","post_message":"Case study: When mainstream media morphs into political activists."},{"comment_id":"10153612780139614","commenter_b":"Breaking the law is a crime, and that includes illegally immigration. I get it. However, in this country technically only the natives whom they/we (Americans) have taken all their lands away. Any comments ??","commenter_a":"what hell wrong with Gov Mexico, I have been there and not doing dam thing to help county shame Gov.to much Durg going and lost lost people the USA should be Buy it. There lost of them doing wrong in USA. only God fix it not Mexico .","post_message":"Donald J. Trump has again upset immigration activists after he released details Sunday on his plans to deport all \"criminal aliens\" and force Mexico to pay for a wall on its border with the U.S. The GOP frontrunner's immigration plan includes overturning a law that grants citizenship to people born in the U.S. and put stricter limits on legal immigration. His plan is based on three core principles: that the U.S. must build a wall across the U.S.-Mexico border, that immigration laws must be fully enforced and that immigration plan must improve jobs, wages and security for all Americans. Read KTLA's story here: @webpagelink"},{"comment_id":"10156586840470147","commenter_b":"Tildon Peacock, so using your guidelines, abortions should only occur when there was rape?","commenter_a":"The law already acknowledges the unborn child as a human being. If a pregnant women is murdered, it's classified as a double homicide. Regardless, it should have a right to live as we all had the opportunity. If society calls a germinating seed a plant, we can call an unborn child a human being with rights.","post_message":"Wow..."},{"comment_id":"10152999859350090","commenter_b":"He is gone. Concentrate on what is happening NOW!","commenter_a":"yes , in my lifetime. Teddy Roosevelt runs neck and neck. different reasons.","post_message":"Tell us if the Gipper tops your list. The Historical Presidents Poll: @webpagelink"}]
