[{"comment_id":"1158459407522812","commenter_b":"Liberal ay, so telling you that Trump broke the pledge first, makes him a liberal.","commenter_a":"Why don't you Trump people shut the hell up about Cruz, and focus on Killary for a change?","post_message":"I agree with Phil Robertson \"The Duck Commander\"!"},{"comment_id":"913575248773260","commenter_b":"Hillery is a known lesbian predator get it out and end her run to destroy this nation","commenter_a":"God i feel sorry for her","post_message":"Sex slave survivor Cathy Obrien swears that Hillary Clinton raped her when she was a child in Arkansas @webpagelink"},{"comment_id":"925455207491820","commenter_b":"Buzz off Kim and take Kanye with you. Both of you suck....","commenter_a":"Wasn't it Paris Hilton that didn't know what Wal-Mart was?","post_message":"Here's how Kim Kardashian responded when asked to react to Megyn Kelly calling her look \"enhanced.\""},{"comment_id":"1148884565168237","commenter_b":"Snipers on the borders. Fill the Rio Grande with gators!","commenter_a":"build the wall close our borders down deport illegals out of America.","post_message":"For years, Trump and Bernie have both been saying that immigration policy is RIGGED by corporate special interests who want cheap labor."},{"comment_id":"512673055591027","commenter_b":"She's such a joke.","commenter_a":"Why can't this woman get a job and shut up?","post_message":"Sarah Palin says she will work to defeat House Speaker Paul Ryan by backing his primary opponent in Wisconsin. @webpagelink"},{"comment_id":"1180471822029044","commenter_b":"Because she was high as a kite!","commenter_a":"WDF is this?","post_message":"Now this is funny."},{"comment_id":"965586620162170","commenter_b":"Scumbag","commenter_a":"....too many \"GUNS\" on the street....and who is holding these guns????? The criminals, thugs, refugees, muslims, and other monsters that are given free reign and encouragement to commit these crimes against innocent citizens! Another elected official with his head up the governments butt!","post_message":"BREAKING…CAUGHT ON TAPE: 30 Yr Old MUSLIM MAN Ambushes, Shoots Philadelphia Cop Several Times “I’m shot. I’m bleeding heavily!” Muslim shooter says he did it \"In the name of Islam\" When Obama's War On Cops and Islamic Terror collide...."}]
