[{"comment_id":"664826563698227","commenter_b":"She should have been in the nut house a long time ago! Along with most liberals crazies!","commenter_a":"What a brainless numb scull.","post_message":"If there was a prize for \"worst listener ever\", Nancy Pelosi would be the far-and-away winner."},{"comment_id":"10153288794126336","commenter_b":"we do love blonde women with breast enhancements and tight dresses , you nasty girl","commenter_a":"on fox news war on women","post_message":"Memorial Day originally honored soldiers from which American war?  How well do you know your #MemorialDay history? Take this quiz with FOX & Friends Weekend! #ProudAmerican"},{"comment_id":"10154108531615950","commenter_b":"Wrong. Abortion is a huge problem and IS murder. IF A PREGNANT WOMAN GETS MURDERED ITS DOUBLE. HOMICIDE..DOUBLE STANDARDS","commenter_a":"Why are people so fixated on someone's death? That is, ONLY if the tool used happened to be a firearm? Why not by other tools and means? #1. There is no gun death epidemic in America. In fact, many more people are killed each year by abortion, alcohol, tobacco, obesity, vehicles, prescription drugs, drownings, STDS... #2. Murder is not on the rise in America. In fact, violent crimes across the board are down some 50%, and have been falling for the last 20 plus years. This despite the fact that firearm ownership is quickly rising more each year. Studies even show where private firearm ownership is the highest, crime is the lowest. #3. Many of the same people who are supposedly against the deaths of a small percentage of people by firearms, are perfectly happy to murder their own sons and daughters by the millions each year. Talk about hypocrisy! ...","post_message":"Police locked down a South Florida mall after one person was killed and another was injured in a shooting."},{"comment_id":"10153145409004342","commenter_b":"Woman why the hell are you on a Houston news site? Get the hell back to Arkansas.","commenter_a":"You have to kill someone because they pissed you off....seriously? Houston a breeding ground for mental cases","post_message":"Police say a man who was shot and killed while changing a flat tire may have been targeted due to an altercation at another location."},{"comment_id":"1215097765244658","commenter_b":"To announce that there must be no criticism of the President, or that we are to stand by the President, right or wrong, is not only unpatriotic and servile, but is morally treasonable to the American public. Theodore Roosevelt","commenter_a":"Obama top 5 worst presidents ever.","post_message":"President Obama delivers his first news conference since meeting with President-elect Donald Trump."},{"comment_id":"1107986062575198","commenter_b":"Transgendered women do not want to look up your dress or steal your kids. They want to use the facilities.","commenter_a":"When will they wake up?","post_message":"The people that this ad is about aren't disgusting, but the ad is."},{"comment_id":"1800960313527053","commenter_b":"She should wait till 2024 after Trump can't beat her again...","commenter_a":"She can't even walk right. Go to you jail cell and rest.","post_message":"Did I ever tell you the definition of insanity?"}]
