[{"comment_id":"10154734487368352","commenter_b":"You got that right,unless she's a fool","commenter_a":"When they get that paper he'll want a black woman","post_message":"Browns quarterback Robert Griffin III pictured walking hand-in-hand with a blonde Estonian athlete as reports he is divorcing his wife of three years emerges"},{"comment_id":"1871395319625852","commenter_b":"I can totally see her talking to the Queens of other countries not clomping around scowling at everyone that is pretty","commenter_a":"For a GOP Super Pac to do this to a presidential candidate's wife and family is inexcusable and wicked as hell. Look at her TODAY. She will be the most glamorous and classy first lady yet and envy of the nations.","post_message":""},{"comment_id":"828345383930736","commenter_b":"Yes and NO Muslim country is taking ANY refugees!","commenter_a":"I find the hateful, negative comments sad. What is perhaps even sadder, is that I am not surprised by the terrible comments. They are offering to do something kind and selfless.","post_message":"More than 11,000 Icelanders have offered to take Syrian refugees into their homes."},{"comment_id":"10153951464149575","commenter_b":"IU sucks","commenter_a":"They suck though.....","post_message":"The Indiana Hoosiers are back in the top 25!"},{"comment_id":"1131647630206805","commenter_b":"I know. He's been promoting terrorism all throughout his presidency. The liberals are dead set on destroying this country. Obama is'nt even a citizen of this country. All of his records are sealed.","commenter_a":"This pos along with the president who endorses cair need to be locked up or shipped off to a Muslim country where they won't have any problems getting along with their fellow Muslim brothers. Muslims commit more atrocities than any other religion in the world and she has the nerve to call our servicemen and women murderers. This organization is a terrorist group and should be disbanded and everyone of them deported!!!!","post_message":"This is guaranteed to be the most vile and despicable thing you see all day..."},{"comment_id":"10152975467087232","commenter_b":"Would you like them to put a gas grill up there! Get a life California your state has more problems to deal with other than a treehouse","commenter_a":"Their property it should be their choice","post_message":"This California family's treehouse is pretty sweet! But a judge ruled it has got to change. DETAILS---> @webpagelink"},{"comment_id":"10153949819826770","commenter_b":"Trump is not against Muslims. He wants Muslims coming into the country right now to be stopped and vetted completely with what is going around in the world. He wants all the law breakers in the country that are illegally gone. And its not just them it means everyone for now till we can get a handle on jihadists trying to come in to the country. What is wrong with that!??","commenter_a":"A woman protesting in New York City just said she was protesting because Trump doesn't represent her beliefs! Well that's why we had an election yesterday and America spoke clear and loud that they were fed up with the way our country was going. The American people are tired of the murder of our unborn children. We voted!! The American people are tired of people who don't work being rewarded while people who do work are being punished. We voted!! The American people are tired of activists judges making new laws without the approval of we the people. We voted!! The American people are tired of foreigners being treated like first class citizens while our veterans needs are put on the back burner. We voted!! The American people are tired of our enemies disrespecting us. We voted!! The American people are tired of our policemen and other law enforcement people ...","post_message":"Asra Nomani is sick of the \"liberal honor brigade\" turning a blind eye to radical Islamic terrorism..."}]
