[{"comment_id":"10154136784591800","commenter_b":"Why not question why WNBA players don't make the same as NBA players? it's cause we all know the answer to that and it's the same as the answer to this. Only difference is incomplete data has been distributed for soccer players making people think their is a pay divide when in reality their is a revenue divide.","commenter_a":"If they played each other, the men's team would win and if you say 'Well that's because they are men.' I would say 'Exactly, that's why they are paid more.'","post_message":"Hasan Minhaj got the details on the U.S. Soccer pay gap. #EqualPlayEqualPay cc.com/equalpay"},{"comment_id":"10153666561423984","commenter_b":"She doesn't know her ass from a hole in the ground.Correction,she know what her ass is huge.","commenter_a":"Kardashian doesn't have the brain capacity to make those decisions and you better believe Kanye has security we don't have. Go live in the hood, kimmie, and then you can tell us how to protect ourselves.","post_message":"BOOM! Kim K thought she'd talk about gun control laws, and it immediately blew up in her face.   Do you support gun rights in America?"},{"comment_id":"1732772313625197","commenter_b":"Screw those DUMBASS muslims Go to Jail,, Go to Hell,,, Go back to the desert,,,,, JUST GET OUT OF OUR COUNTRY !!!!!!","commenter_a":"If muslims want to live here then they must adhear to our laws, period. If they don't, they can move on to an islamic country..","post_message":"Muslim Woman Refuses To Take Off Head Scarf In Court, So No-Nonsense Judge Does THIS    In our country you have to follow the laws of our court. If not,  suffer the consequences.  Do you support this no-nonsense judge?"},{"comment_id":"1297673556961425","commenter_b":"She has taken UGLY to a new LOW!!!!","commenter_a":"This awesome. Trump just keeps on winning.","post_message":"Awful Rosie O Got Slammed With Worst News Of Her Career After Election, She Screwed!!!  The news just keeps getting better for America!!!"},{"comment_id":"10153536976196336","commenter_b":"Talk to Moon beam aka governor Brown of California. It is in San Francisco that an illegal alien killed a beautiful person. He encourages sanctuary cities for illegal immigrants and lets them get drivers licenses and so with liberals it's take from the people who work and pay taxes and let them pay for all the illegals. I don't want to give my hard earned money to whatever the state chooses to spend it on but liberals will continue until they are ousted. And that goes for Republicans as well. No one in either party deserves to hold office if 'our' welfare doesn't come first. And I don't mean welfare as in free stuff.","commenter_a":"what...how can any illegal alien hold a government position? Oh yeah...California the land of goofballs.","post_message":"'This is worse than sanctuary cities. Now we're giving them sanctuary boards.' – Neil Cavuto"},{"comment_id":"10153087493924641","commenter_b":"Castration ? Wicked ladies always love that","commenter_a":"Rape cases are very high in India....those men need castration","post_message":"India has banned a controversial rape documentary. Are they protecting women or restricting free speech?"},{"comment_id":"976040162431405","commenter_b":"I haven't watched this show in years and don't see how it's still on the air! These women are so 'out of touch' with the real world, they're clueless!","commenter_a":"These women on the view must b a special kind of stupid","post_message":"Thank you, Dr. Ben Carson!"}]
