[{"comment_id":"10153878198208984","commenter_b":"Decrepit old Hellary needs her fatA$$ ship sunk already!!! DESPERATION makes her even uglier!!!","commenter_a":"everything about this bitch is fake.","post_message":"Wow. Hillary is in a rough spot, and what was just revealed will NOT do her any favors. I knew she had sunk low, but I didn't realize she was this low...  Do you hope Hillary loses in 2016?"},{"comment_id":"1879546605644644","commenter_b":"She should be in jail","commenter_a":"How is she any different that a Timothy McVeigh home grown terrorist?","post_message":"Ugh"},{"comment_id":"463669483844276","commenter_b":"OHHHH.....now I understand. We have been talking past one another for half an hour.","commenter_a":"If Cruz is not a natural born citizen, but the offspring of two illegals who came here 2 weeks ago is, there is something SERIOUSLY wrong with our system.","post_message":"Ted Cruz was born in Canada and was a Canadian citizen until 15 months ago. Lawsuits have just been filed with more to follow. I told you so!"},{"comment_id":"10152701049955496","commenter_b":"I had no idea a woman would take offense to the sex part....","commenter_a":"First of all Sex isn't priority one. Marriage is about being there for your spouse, understanding each other, respect and being willing to come to an agreement when you have a difference in opinions. This young buck is confused.","post_message":"A 29-year-old columnist says marriages today just don't work. Here are his reasons: @webpagelink  Do you agree?"},{"comment_id":"1410976518925134","commenter_b":"like dying in the sea coming from Europe to steal Mexican and Native American land?","commenter_a":"I wish people would realize this is actually happening and innocent people are losing their lives! of course under ignorant trump supporters everyone is Mexican","post_message":"Donald J. Trump is already deporting people to Mexico  even if they're not Mexican."},{"comment_id":"1025129017543627","commenter_b":"Preoccupied? Can women still vote? $$ facebook doesn't want you to see this $$ As long as America's richest 1%, who now possess 70% of the wealth and don't bother to vote, have the Senators in their pockets the United States Government isn't representing the will of the people, it's the 1% that's running the show. I stand with Bernie Sanders, \"We're governed by an Oligarchy.\" The number of Americans living in poverty will continue to grow while the middle class will continue to shrink and working women will continue to enrich the wealthiest 1% for the next 20 years easily! (Able to afford the best and brightest, Hillary is a great political actor with a well rehearsed script.) Hillary Will make another Fortune!","commenter_a":"VOTEHfor both of US","post_message":"Women deserve access to the health care they need—without interference, intimidation, or violence. #StandWithPP -H"},{"comment_id":"1343888468964236","commenter_b":"What's Columbus Day? Idk that dude.","commenter_a":"Possibility of a historic windstorm close to the 54th anniversary of the Great Columbus day storm? Wow. The weather here just keeps getting crazier!","post_message":"There is a one in three chance of a “historical windstorm for nearly all of Western Washington that would be long remembered.”  Take today to prepare for possible power outages and have some extra supplies on hand."}]
