[{"comment_id":"10153909407028598","commenter_b":"Girls, start being more selective of your boyfriends. Think first and maybe you won't regret your actions later.","commenter_a":"I hope someone puts him out of commission!!!","post_message":"Boyfriend and Two Others Assault Pregnant Teen, Punch Her Stomach to Kill Her Unborn Baby"},{"comment_id":"974409115948951","commenter_b":"Yes I have! She'll make an excellent prison wife. So biblically submissive.","commenter_a":"Have you seen this yet, Guy?","post_message":"Marriage equality is the law of the land. Officials should be held to their duty to uphold the law—end of story."},{"comment_id":"1267665493274190","commenter_b":"Well Dana maybe if us \"poor white Trump supporters\" didn't have to pay so much in taxes to support all the welfare democratic trash (of all races) and all benefits for the illegals we would be able to live more the style of the freeloaders or better!","commenter_a":"lindo","post_message":"We are going to build a wall - and make America SAFE again!"},{"comment_id":"1514959711853944","commenter_b":"This reminded me of The Series of Unfortunate Events .... But this way wayyy cuter","commenter_a":"Alicia Thomas","post_message":"This is so cute!"},{"comment_id":"10154467991806162","commenter_b":"Put down the pipe lady.","commenter_a":"And I am so tired of the argument that white America doesn't understand the history of slavery, or they are so \"ignorant\" about the contemporary machinations of racism. The claim of ignorance is part of the diabolical ruse but this mess is all cooly calculated and designed to preserve the racial hierarchy, which these days is often called \"racial disparities.\" Which I say is a bureaucratic term used to obscure the genocidal potential of white supremacy. How could a culture of people who have so meticulously sought to prove their superiority in all things, be so intellectually dense about how racism works? Slavery is well understood by white America because for the past 150 years it has ingeniously recreated it over and over again and called it by another name while playing dumb. FOH!","post_message":"The store owner, Abdullah Muflahi, released a video that he said he shot from a slightly different angle. He said Sterling was not holding a gun during the shooting but that he saw officers remove one from his pocket afterward. His video shows an officer reaching into Sterling's pocket to grab an object."},{"comment_id":"10153647642558352","commenter_b":"She's the other woman, this is why women need to stop claiming men until they put a ring on it and claim you","commenter_a":"Sad","post_message":"GIRLFRIEND FINDS OUT ON SOCIAL MEDIA HER SUPERSTAR SOCCER PLAYER BOYFRIEND MARRIED ANOTHER WOMAN RIGHT AFTER SHE DROPPED HIM OFF AT THE AIRPORT (PHOTOS)  This is real bad!"},{"comment_id":"10153381284694087","commenter_b":"And until tools are in place, ban all Muslim immigration!","commenter_a":"Bubio is a big money lobbyists puppet! Vote for Trump!","post_message":"\"How many attacks on the homeland will we have to endure before the president understands that lawful intelligence tools subject to judicial review are necessary to win the long war against radical Islamic jihadism?,\" Sen. Marco Rubio wrote in a scathing op-ed along with Sens. Tom Cotton and Joni Ernst."}]
