[{"comment_id":"10153400579000329","commenter_b":"He's all yours, ladies lol","commenter_a":"Greg Paul Rachelle Krista","post_message":"His name is Brock O’Hurn and he's the king of man buns."},{"comment_id":"1170836056328262","commenter_b":"The last time I posted something about the politics of these bitches, I got dozens of whining bitches, men? and women, extolling on the vitues of these sacks o shit. Piss on 'em. Bring it on bitches!!!!!!!!!!","commenter_a":"GO DIXIE CHICKS--FREEDOM OF SPEACH-TURN TEXAS BLUE--","post_message":"Some Donald J. Trump fans attended this concert wanting to get away from politics and just have a good time listening to music. But then they noticed what the Dixie Chicks has in the background during one number. After that, Trump fans in the audience were absolutely furious... and for good reason. This is sick."},{"comment_id":"10154092058261636","commenter_b":"Did you have to turn on you \"English APP\" to type that?","commenter_a":"Gross! And Then he said: \" I will be dating her in ten years\". His own words","post_message":"She was having none of it"},{"comment_id":"10152593040747093","commenter_b":"Both need supervision. That dog could have killed that child.","commenter_a":"Can't blame a 3 year old.","post_message":"Parents of a 3-yr-old attacked by a dog are not happy...b/c the dog’s owners aren't going to get rid of the pet… @webpagelink"},{"comment_id":"10154619916723812","commenter_b":"she only made that statement because she's salty that Melania got busted lol.","commenter_a":"Again for those that don't have a clue. A speech writer helps to incorporate your thoughts and feelings on paper. As the article reads Michelle was heavily involved in the speech. Read b4 u comment.","post_message":"The woman who wrote Michelle Obama's DNC speech is currently a senior presidential speechwriter and has been a speechwriter for Hillary Clinton, John Kerry, and more in the past."},{"comment_id":"10154001146333598","commenter_b":"Give me a chance at her murderous body!","commenter_a":"Shame on you.","post_message":"This Abortionist Flies in to Planned Parenthood to Abort 31 Babies Every Day"},{"comment_id":"10154466524309203","commenter_b":"She's disgusting","commenter_a":"Enough of the hate and racism. Every time they open their mouths, garbage comes out.","post_message":"CNN political commentator Hughes: \"hoping I not going to have to [brush up on] my #DoratheExplorer to understand some of the speeches given this week. #DNC #TimKaine"}]
