[{"comment_id":"10153015286404641","commenter_b":"Check out dis video @webpagelink","commenter_a":"Pls. friends click the link and like the photo of cedrick he's good and intelligent student he doesn't have money for his college. your like is to help for his scholarship and share to your friends .. we really need ur help .. just click the Link below .. Please Like Candidate #1 .. Thank you po .. :-) @webpagelink","post_message":"Nigerian voters refuse to be silent in wake of election delays @webpagelink"},{"comment_id":"1149894398400704","commenter_b":"Another flip flop by trump,,he once said she would be a great president,,he's pro choice,,he says he's going to deport all illegals,Obama has deported more illegals then any president & it doesn't make any difference,,they just come right back,,Hillary is the only hope we have for the average American,,","commenter_a":"Never killery","post_message":"Trump has no problem with the idea of having a female president in America -- as long as it isn't Hillary Clinton. Do you feel the same way?"},{"comment_id":"10153152962811323","commenter_b":"It doesnt apply both ways. It says it does but woman are malicious and always get their own way.","commenter_a":"Good. And what about divorced men who have brought up the children while the wife goes off to make her fortune without contributing to the children's upbringing?","post_message":"\"At last! The supreme court has just rocked the apple cart of unequal divorce. It has pronounced that being a parent is an obligation that lasts. Even if one parent is no longer around, for better or worse their fortunes are inextricably bound together. Particularly if those fortunes are for better.\""},{"comment_id":"10154360236166523","commenter_b":"He is not a queen","commenter_a":"He is a QUEEN. Only the packers can get dominated the whole 1st half and go into the locker room with the lead.","post_message":"Mr. Aaron Rodgers -- the Hail Mary King! via.fox6now.com/ZsBiQ"},{"comment_id":"10153483775401409","commenter_b":"You are a troll anyway. I can tell by looking at your page. Funny thing is you have a picture of the twin towers on your page saying never forget but you want to let illegals stay and I bet are all for the refugee program.","commenter_a":"Its because Trump loves attacking women but not his own. I bet he doesn't treat his wife good at home and only likes his wife and daughter as sex objects to him. He's a disgusting man.","post_message":"Here's how Heidi Cruz responded after Donald Trump threatened to 'spill the beans' on her Tuesday."},{"comment_id":"10153932713210950","commenter_b":"@username that's my point. If she wanted to look like a pig she should have stayed on the farm lol","commenter_a":"It wasn't a few pounds, she got fat!! It was her job to maintain an appearance and she failed. If she didn't want to be judged for her appearance then don't enter a beauty pageant. Smh","post_message":"This former Miss Universe says Donald J. Trump's comments about her brought up bad memories from 20 years ago when she gained a few pounds after winning his beauty pageant."},{"comment_id":"10153233297426336","commenter_b":"They come over here illegally an you birch about it so you shouldn't celebrate there customs from there country here go back there an live don't do it here","commenter_a":"You can celebrate any way you want....","post_message":"\"I do not think it is the props that are wrong, it is forgetting that this is actually a part of the Mexican heritage.\" Olga Gonzalez, a Northwestern University undergrad from Mexico, takes a nuanced look at Americans' celebration of Cinco de Mayo."}]
