[{"comment_id":"684790694966567","commenter_b":"He is naturally jumping in the election of this man because he is willingly trying to make this united states and land or\\\\f Muslim's. HE continues to support anything he can by continuing to have open doors for these people and also continues to increase the jobs for them and NOT FOR THE AMERICAN PEOPLE this king of leadership is UNAMERICAN JUST LIKE HE IS.","commenter_a":"No doubt!!","post_message":"Now, it is time for a simple question: Has President Obama launched a political campaign against Prime Minister Netanyahu and his allies? @webpagelink"},{"comment_id":"10153446320724087","commenter_b":"I want a woman too, but not a liar, cheap, and a phony","commenter_a":"Fuck no to Hillary. Hell yeah to Feel the Bern!!","post_message":"“It’s imperative that you vote. I want you to vote for [Hillary Clinton]. It’s time for women to be seen as real equals,” soccer hero Abby Wambach said at an event for the Democratic front-runner. “That is one hell of a badass woman in my opinion.”"},{"comment_id":"10153860760766135","commenter_b":"You are so right.","commenter_a":"It was not a mistake, it is business as usual at Detroit Animal Control.","post_message":"\"As a result of a computer status error, a tragic and unacceptable euthanasia was authorized.\" -- Detroit Animal Control"},{"comment_id":"1166947526658609","commenter_b":"I am a Democrat and I will not vote for this woman!","commenter_a":"the bride of frankenfood. no mercy.","post_message":"Is she in trouble?"},{"comment_id":"10154071992886770","commenter_b":"Clinton, Bushes, Obama took away citizen's rights. They betrayed our nation. The USA was hated while they were in office. We are better off turning our backs on these traitors and marching forward in the right direction.","commenter_a":"Thank you, you have more class than some of the others.","post_message":"Both Bushes, Jimmy Carter and Bill Clinton all attended Barack Obama's inauguration in 2009."},{"comment_id":"10150572291974999","commenter_b":"Ok head in a pressure cooker, she chop the guy? that is cold, women have alternatives like \"the police\", runing away, any place she runs to will be better than prison for life or death. So she did the crime, now do the punishment she had her choice.","commenter_a":"....she killed the guy, put his head in a pressure cooker and then chop the rest of him before telling anybody. Do you know how long that must have been? china did exactly what was right and her sentence isnt harsh at all. Anyone asking for a lighter sentence is out of their mind. She needs to sit in jail for a while and maybe see a head doctor.","post_message":"Women in China who killed abusive spouses were once routinely executed, but as the scale of domestic violence began to emerge in the early 2000s — officials say one in four marriages is affected, activists say one in three — lengthy prison sentences became the norm instead."},{"comment_id":"10150883310494999","commenter_b":"will have to wait to see how many generics fail to work","commenter_a":"There is going to be generic? Why is everyone complaining? This medicine just got way cheaper!","post_message":"The move by Mylan is a common tactic: raising prices before a generic competitor reaches the market, as a sort of final attempt to milk big profits from the brand-name drug."}]
