[{"comment_id":"10156669278135354","commenter_b":"Evil disgusting whore","commenter_a":"GRANNY couldn't tell the difference between LOVE and KINDNESS if her life depended on it!!! Her own husband had to go find love in someone else's arms cause she knows NOTHING about love!!!!!","post_message":"There was no \"love and kindness\" in Hillary's lies about Benghazi. It wasn't \"love and kindness\" when Hillary transferred 20% of US uranium to Russia for $145 Million in Clinton Foundation cash. \"Love and kindness\" don't describe her treatment of Bill's sex victims. Exposing US secrets through your server and destroying emails isn't \"love and kindness.\""},{"comment_id":"886270021416239","commenter_b":"This is not good! We should close our borders for all foreigners indefinitely until further notice.","commenter_a":"Hey Rachel suck my cock","post_message":"A growing Muslim population in the U.S. is raising concerns that the nation could be at increased risk for instances of Islamic extremism in coming years. @webpagelink"},{"comment_id":"10154398240872293","commenter_b":"There is strength in numbers. So many Nasty Women","commenter_a":"Bikers for Trump and oath keepers pls be ready to welcome them!","post_message":"While President-elect Donald Trump’s remarks served as an impetus for the protest, a march organizer said it won’t be an anti-Trump rally."},{"comment_id":"10154177421583734","commenter_b":"OK, toss in Jesus too, and all the Angles, and it still won't get him the Seat.","commenter_a":"He could have God running with him . He still has no shot at winning","post_message":"Do you think Fiorina was a good choice for Cruz?"},{"comment_id":"10153662465839714","commenter_b":"Am I the only one who gets the joke?","commenter_a":"Mr trump, explain to me why something in the constitution is unconstitutional?","post_message":"Donald J. Trump continues to defend his controversial immigration plan."},{"comment_id":"10153526250577431","commenter_b":"The swastika is an inverted cross of the Buddha. He was also inspired by Indian (India as in East Asian) mysticism.","commenter_a":"As a historian, I was amazed at what was copied by the Nazi regime as a way of dealing with racial, etnic, and religious cleansing. The more that I learned about Hitler's insanity the more I realized that he copied the concept of the concentration camp from the US answer to the Indigenous people of this land. The Nazi's swastika is even taken from Native American symbols. This is why the UN still holds the US as guilty of crimes against humanity.","post_message":"Ugly Precursor to Auschwitz: Hitler Said to Have Been Inspired by U.S. Indian Reservation System @webpagelink"},{"comment_id":"10153570566941509","commenter_b":"Yes....and take alcohol off the market...","commenter_a":"medical pot SHOULD be legal for those who need it!","post_message":"Do you agree or disagree? Dr. Sanjay Gupta explains why it's time for a medical marijuna revolution on CNN Opinion: @webpagelink"}]
