[{"comment_id":"959639310819514","commenter_b":"Maybe they should also be deported.","commenter_a":"I love the idea!","post_message":"ClashDaily.com"},{"comment_id":"991078264282036","commenter_b":"Tom Schmidt I beg to differ !!!!!! She is very much for woman and for men to!!!!!!","commenter_a":"Women let's unite for Hillary. President Hillary.","post_message":"Raising the minimum wage, paid family leave, child care: These aren’t just women’s issues -- they’re also family issues and economic issues."},{"comment_id":"564263730449143","commenter_b":"She prolly snuck it in in her lady part","commenter_a":"Pam murdered Russ Farias wife Betsy and framed Russ","post_message":"Pam Hupp charged with murder - O'Fallon, Missouri Police and St. Charles County Prosecuting Attorney's Office hold a press conference on charges related to last week's shooting. Hupp has been charged with 1st degree murder in the shooting death of Louis Gumpenberger. She was arrested Tuesday. She was a central figure in a highly publicized murder trial covered extensively by Fox 2 News."},{"comment_id":"10153716736973984","commenter_b":"That's one ugly girl","commenter_a":"This is more disruptive than any dress-code the kids could break. If a kid can't wear a t-shirt with our STARS & STRIPES, for example, then this person should not be allowed in the girls restroom and locker room. Period. There is no reason an alternative restroom shouldn't suffice.","post_message":"These students just sent a BOLD message to this school after a transgender classmate said he should be allowed to use the girls bathrooms and locker room. And it's not a message that the school can overlook... Do you support what these students did?"},{"comment_id":"368033556718272","commenter_b":"Sarah Got A Back Bone She Don't Back Down To That Evil Snake","commenter_a":"does she even know where Paris is?","post_message":"Good God, Mr. President, we were once known as the leader of the free world, standing for what is right! You must not let America’s sacrifices be in vain. When will you learn that actions speak louder than your words?”"},{"comment_id":"10154125153407169","commenter_b":"STOP Election Fraud: Do NOT use Soros voting machines. Please vote to put Billery/Killery on trial for TREASON. She broke the law and belongs in jail. She risked our country and put our people in harm's way, and had Democratic whistleblowers murdered. Not only Billery is very dangerous, she will bring this country to a security collapse with cutting our military and a financial collapse by choosing a fight with Russia and ruining small businesses while sending all jobs overseas. Please don't vote for the DEVIL. This country needs to be free and strong, where people have a real chance at the American Dream. Billery should have never been the Democratic candidate to start with and stole the nomination from Bernie Sanders. She is the most corrupt candidate ever and works for the elite new world order who wants to make people obsolete with new robotic technology. She brings with ...","commenter_a":"It will make money for the drug companies!!!","post_message":"Primary care doctors and nurses are well-positioned to treat addiction and champion care for those struggling with the use of opioid pills or heroin (From PBS NewsHour)"},{"comment_id":"10153560422922629","commenter_b":"Hell yeah bitch","commenter_a":"This post glorifies violent masculinity.","post_message":"Two apparent members of the U.S. Marine Corps reportedly overpowered and halted the gunman."}]
