[{"comment_id":"10154514379914657","commenter_b":"And your answer is to just try to talk them out of killing us Nancy. \"Maybe if we're just nice to them, they won't hate us\". Coward","commenter_a":"Stirring up more hate,the Republican way. Your answer to everything is violence.I have never heard so much vile hate in my life. You are horrible human beings.","post_message":"UPDATE: A Paris prosecutor has also confirmed the passport that was found."},{"comment_id":"1054929361214588","commenter_b":"She* is a woman.","commenter_a":"Sorry Siri, but according to his DNA, he's still Bruce! A rose by any other name.....","post_message":"Siri knows Caitlyn's name and she's going to correct anyone who forgets."},{"comment_id":"460052980821324","commenter_b":"Put the pussy on the chain-wax","commenter_a":"This headline is complete and utter garbage click bait bullshit. Mumford & Sons had nothing to do with THE CITIES/RESIDENTS. You can't blame a band for the amount of fans they attract, they're grammy award winning musciams coming of a 2 year hiatus after releasng a long awaited album. The city is the problem here for using this \"cleanout method\" which they are literally treating these people, HUMAN BEINGS, like trash and obviously have no problem using terms that state that. Blame the city not the band, oh and actually read the article.","post_message":"Not cool."},{"comment_id":"10153248937462235","commenter_b":"Bitch deserves to be skinned","commenter_a":"OK. I read the article. NONE of the animal was wasted. ALL of the beautiful creature fed people. This woman is \"an extreme hunter\" and has made a living at it...tv, radio, etc. WHY SHE WOULD POSE WITH A DEAD AMINAL? BECAUSE SHE DOES IT ALL THE TIME. YUCK.","post_message":"'What must’ve happened to you in your life to make you want to kill a beautiful animal & then lie next to it smiling?' -- Ricky Gervais"},{"comment_id":"10154736430788984","commenter_b":"I think she's loosing her butt and I'm glad!","commenter_a":"So go be a Grandma and get out of the race.","post_message":"It took Hillary Clinton less than 15 words to show her debate strategy in a very clear way. Do you think Donald J. Trump is winning the debate?"},{"comment_id":"10154352514741523","commenter_b":"Are you ready for that wall","commenter_a":"And there's Putin Ridin Trump or the other way around","post_message":"\"He's not a bad man. But his ignorance is so profound, so profound.\""},{"comment_id":"710565325800712","commenter_b":"Get out","commenter_a":"Just what? About this woman isn't alarming?","post_message":"Muslim picks fight with patriotic cashier, and then this happened. If you don't like our country's flag, you don't have to live here. Can we get 75,000 'LIKES' for this patriot?"}]
