[{"comment_id":"164458724060246","commenter_b":"Should give all their jobs to legal immigrants","commenter_a":"Good for the owner. Behind him all the way.","post_message":"30 WORKERS FIRED For Skipping Work To Protest On Behalf Of Illegal Immigrants…Calls Employer Who Fired Them A \"Racist\" [VIDEO]"},{"comment_id":"10154378006503352","commenter_b":"What is a thot?","commenter_a":"Why do they have to call her a thot??? Ridiculous article","post_message":"New photos of Amber Rose Doing Naked Sunbathing Indicate She Might Have Been Wearing Booty Pads All Along – Her Behind Disappeared! (PHOTOS)"},{"comment_id":"10152856815999753","commenter_b":"Lol. A lot of people. A perk of being a sociopath is the ability to manipulate people like butter. She's mentally unstable. The worst they do is put her in a padded room until they believe her meds and treatment are good enough to let her back out in society.","commenter_a":"Smfh.. Good! Let's see who she can manipulate like that behind bars!!! R.I.P.","post_message":"Michelle Carter said all the right things when her friend Conrad committed suicide. She even organized a fundraiser in the teen's name. Then police discovered the texts she had sent him."},{"comment_id":"10153858416863271","commenter_b":"Sick woman. I mean the one who posted this comment.","commenter_a":"I've been looking at her Facebook pages(she has two), I'm not justifying her actions and believe it's absolutely disgusting but I'm pretty pretty sure she's special needs. I'm not saying she shouldn't be punished or condoning her behavior but I honestly don't think she knew any better. I'll be willing to go out on a limb and say she was sexually abused. She probably did to him what had been done to her or what was told to do. I can't even imagine what's going on behind those walls.","post_message":"Jessica McCain told investigators that she recorded the sex act on a borrowed cell phone, according to court documents."},{"comment_id":"1136613006364478","commenter_b":"He told that woman to \"GO AND SIN NO MORE,\" @username. Jesus calls even a single divorce for ANY reason one thing: \"... ADULTERY!\" ~ JESUS \"THOU SHALT NOT COMMIT ADULTERY!\" ~ GOD \"JUDGE YE RIGHTEOUSLY!\" ~ GOD ~ JESUS","commenter_a":"Mark 10:10-12 In the house the disciples began questioning Him about this again. And He *said to them, “Whoever divorces his wife and marries another woman commits adultery against her; and if she herself divorces her husband and marries another man, she is committing adultery.”","post_message":""},{"comment_id":"10153635543308132","commenter_b":"Yes...I'd bury my chin in her and set up camp!!!","commenter_a":"I love skinny (healthy) women. It's kind of silly to be that jealous of them. @username have all of their 40's n 50's to get 'thicker'.","post_message":"The endlessly quotable Amy Schumer!"},{"comment_id":"10154298505504411","commenter_b":"stfu goat lover","commenter_a":"Go police go, do not let bastards ruin the day!","post_message":"Police deployed tear gas to disperse some particularly hostile demonstrators"}]
