[{"comment_id":"1700109030241371","commenter_b":"@username @username lol this lady","commenter_a":"@username I so see this being you in like 100 years","post_message":"This 105-year-old woman has the best reason for ignoring her doctor's advice about drinking soda."},{"comment_id":"435823689939258","commenter_b":"American demand Muslim relocate back in their country!","commenter_a":"Owner's a coward. I would've enlarged the sign.","post_message":"Unacceptable..."},{"comment_id":"10153719642089091","commenter_b":"@username so you've gotten an infection from using a public restroom ?","commenter_a":"Why would you let your 8 year old daughter go to a public bathroom by herself??!! Smdh.","post_message":"Thank goodness for the customers and staff members who helped rescue the 8-year-old after her mother heard her scream. Police say the man was caught carrying the unconscious girl into a bathroom stall."},{"comment_id":"10153963536777235","commenter_b":"And a large percentage of illegal immigrants simply come here legally with a visa and just don't leave.","commenter_a":"The wall is absolutely absurd. See the ocean? You can use it to go around the big ugly wall. See the airplanes? You can go over the wall. Ask El Chappo about going under things. It's nostril flaringly stupid. Ancient technology. Pre airplane, backhoe and no ocean on either side. It would be funny if there weren't so many truly stupid people believing it. Gag, cough, hurl.","post_message":"BUSTED!"},{"comment_id":"10153162470033908","commenter_b":"get outta here","commenter_a":"1 & 6 Katarina Koncarevic","post_message":"Here are 8 things you can do to potatoes you probably didn't know:"},{"comment_id":"10153263764260329","commenter_b":"But what does she think of fat bastard?","commenter_a":"Who is this bitch?? Oh yeah that's right... #Irrelevant","post_message":"Azealia Banks said a whole bunch of interesting stuff, but let's not ignore that startled cat 0_0"},{"comment_id":"820665888078295","commenter_b":"Silly woman","commenter_a":"Wtf? Isn't non schooling illegal (and 5... That's stupid... once they are on solids why breastfeed?)","post_message":"Neither of her kids can read as she refuses to let them go to a mainstream school."}]
