[{"comment_id":"1554605091501420","commenter_b":"Merry Christmas","commenter_a":"True Patriots True Americans for Donald Trump Keep the White House Hillary Free 2016 This Is Why I Support The Ban On Illegal Refuges/Muslims, Deport Illegals No Amnesty, No Tax Dollars Spent On Any Of Them Watch How FAST They Self Deport Themselves!!! Bernie Supporters That Are Feeling The Burn Should Jump On The Trump Train To Defeat Hillary Who Would Be The Worst President In US History!!! Next Stop Novembers General Elections Then On To The White House Were Donald J. Trump Will Be The President Of The Unites States Of America! Thanks To You And All His Supportes Across This Great Nation!","post_message":"You think we can coexist with these people!? They HATE our way of life! Let's get 5000 SHARES if you believe Muslims will NEVER Assimilate in America!"},{"comment_id":"10152887029056336","commenter_b":"The yatahays are the illegals!!!","commenter_a":"We're all immigrant, except the native Indians.","post_message":"JUST IN: In a 237-190 vote, the House has voted to overturn President Obama's executive actions on immigration that extended protections to millions of people in the US illegally. @webpagelink"},{"comment_id":"10153255182937452","commenter_b":"Richard Valdez what's up with that street. Last week was the guy and now this. So sad!","commenter_a":"That's what happens when you think cars can fly 😕","post_message":"1 person is dead and another was hospitalized after a head-on collision with a big rig in Gardena."},{"comment_id":"1017113771678485","commenter_b":"@username no dont get mad because Hillary is a corporate puppet slave and black people dont like her!!!","commenter_a":"Sorry black folks don't like Hillary","post_message":"Speeches, selfies and heart-to-hearts: A look inside Hillary's recent events in African American communities."},{"comment_id":"1337743466286160","commenter_b":"How about we deplorables boycott all of you talentless walking DUMB LIBTURDS!!!","commenter_a":"These slobs have sold their souls years ago on the casting couch of Hollywood! What do they know about the struggle of the everyday @username! Go back to your fantasy world of make believe, most people live in the REAL world!","post_message":"Hollywood Hail Mary: See who's begging the Electoral College to vote against Donald J. Trump."},{"comment_id":"10153278742792144","commenter_b":"Foolish woman do you really think you can reason with a wild animal? Enough already.","commenter_a":"Very irritating.....good for the bear. There was no reason to pepper spray when she could have gone inside.","post_message":"HAHA."},{"comment_id":"10153642344498132","commenter_b":"You can put lipstick on a pig but, it's still a pig!!","commenter_a":"He looks kind of mean as a woman :(","post_message":"Caitlyn Jenner, can we borrow that mini?"}]
