[{"comment_id":"10154014053348984","commenter_b":"SHES A RACIST BIGOT ANYWAY","commenter_a":"I don't know anyone that likes that show, or doesn't think that Whoopie is whoopie.","post_message":"Donald J. Trump has had enough with the liberal ladies of \"The View.\" In just one word, he absolutely destroyed host Whoopi Goldberg... this is brutal.  This goes to prove one thing... never pick a fight with The Donald."},{"comment_id":"258747511232468","commenter_b":"Struck a nerve didnt I @username? Don't dish out what you can't take Snowflake. Now, y'all enjoy picking those grapes.............","commenter_a":"you and your fucking fox news like spin...he requested...not begged. you are as bad as the right wingers with your lies. is your position so weak you have to spin it? you are why trump is in office because you cant be straight up. fuck you occupy democrats.","post_message":"It's obvious that hypocrisy runs in the Trump family."},{"comment_id":"10153785606781636","commenter_b":"@username it is illegal for a felon to be around a gun. Which means a felon shouldn't ever enter a gun range or be able to rent a gun!!!","commenter_a":"So wait?? You can just walk into a gun range and with no background check just \"rent\" a gun? How does the gun range owner know that a person is legally able to possess a gun? How do they know the person isn't a felon or barred from possessing a gun??? Wth?","post_message":"Authorities say the gun range owner had no indication the man was suicidal."},{"comment_id":"10154913059491350","commenter_b":"Shawna Cargill","commenter_a":"Nick Shanahan","post_message":"CHICKEN. TOT. PIE."},{"comment_id":"10153903202659641","commenter_b":"Suck one Ortiz","commenter_a":"All those who dont like Zuckerberg you are free to delete your facebook account","post_message":"Mark Zuckerberg isn't happy about what people have been writing on Facebook's chalkboards."},{"comment_id":"1011822325526221","commenter_b":"Iran needs to get with the times. You se to want tourism but then scare people off by arresting people for no reason. Wake up!!","commenter_a":"generally muslim men under lucifer Allah do not respect women very well, look obama does not he muslim islamic religion","post_message":"In recent years, debate in the west has largely focused on the more visible aspects of the status of Muslim women and Islam, with many claiming that women have fewer rights than men."},{"comment_id":"1110152195742243","commenter_b":"IF Hillary does get in I cannot wait to see people like YOU have to bend over and grab their ankles because of all the Radical Muslims and Syrians she plans to bring into the USA. Within her first 100 days she wants totally open borders and wants to bring in a minimum of 65,000 more Syrians. And within her time as president she plans to bring in a minimum of 1 MILLION Muslims! ....IF Trump does not get in, you can kiss your azz goodby and say hello to ILLEGALS, MUSLIMS, THUGS, and SYRIANS who will rape (you and your family), rob, and want everything you have worked for...........and they will get it! .The USA will go into total bankruptcy, and become a totally socialist nation!............IF this happens, Just Remember: \"I Told You So\"....AND YOU DESERVE IT!","commenter_a":"Republican nominee Donald Trump disdain for the American worker is legendary at this point. He been caught refusing to pay people for doing their jobs, told them that they don deserve a minimum wage, and offers benefit plans that actually won help working families, and scammed thousands of Americans out of their hard-earned money with his fraudulent . He doubled down on insulting the American working class in a truly insulting fashion earlier today when speaking about how too many Americans are working two jobs just to make ends meet, but told the crowd that , I working harder also, so I don feel sorry for any of you. It true. You think this is easy? Mr. Trump has never truly done a day of in his life. After graduating from his high-priced university, he was given a loan of a million dollars from his father, with which he began ...","post_message":"Today - I outlined a plan for American economic revival - it is bold, ambitious, forward-looking plan to massively INCREASE JOBS, WAGES, INCOMES and opportunities for the people of our country!"}]
