[{"comment_id":"1048491781950666","commenter_b":"thats the look we give when they let Kellanne dumbass talk..why they ever listen to that dumb blonde i will never understand..","commenter_a":"That is after barfing.","post_message":"So true!"},{"comment_id":"532673453589901","commenter_b":"Linda are you drunk? Your comment makes no sense. Girl get yourself together.","commenter_a":"If he does not support Obama he should not have to speak to him. It's a free country so far.","post_message":"Obama is outraged after Tom Brady made an epic stand against him. This is amazing. We have is back, let's show him our support. Can we get 10,000 'LIKES' for Tom Brady's stand against Obama?"},{"comment_id":"10153351373259614","commenter_b":"This woman wants to make decisions for you and for me.....","commenter_a":"Dummy","post_message":"A videotaped gaffe by Rep. Loretta Sanchez has sparked outrage among those who found the comment to be racially offensive. Sanchez, a candidate who wants to replace retiring Senator Barbara Boxer, was speaking at a California Democratic party convention event when she made a stereotypical Native American \"war cry.\" Referring to the difference between Indian Americans and Native Americans, the congresswoman tapped her hand to her mouth. Sanchez's main opponent, Attorney General Kamala Harris, was later asked for her reaction to the gesture. \"I don know what to say to that. That that that shocking,\" said Harris, whose mother is Indian. (Video courtesy of Uduak-Joe Ntuk) Read KTLA's story here: @webpagelink"},{"comment_id":"964183830350156","commenter_b":"Somebody give that girl a sammich!","commenter_a":"Kellyanne looks like she is about to physically break down. I would feel sorry for her, but she brings this entirety upon herself.","post_message":"\"'Alternative facts' are not facts. They're falsehoods.\" Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it. Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"10154647842874197","commenter_b":"KHILLARY HAS ROBBED ALL OF US. BILLIONS OF DOLLARS IN HER COFFERS!!! TAKE THEIR MONEY AND GET OUT OF THE US!!!","commenter_a":"He won't save it he will get what he wants at your expense lol","post_message":"WATCH LIVE: Donald Trump speaks in North Carolina."},{"comment_id":"10154492827869497","commenter_b":"Who can believe this story?? After all the woman ?????","commenter_a":"hahaha","post_message":"Highlights Of President Bill Clinton's 2016 DNC Speech"},{"comment_id":"10153271515149087","commenter_b":"Stfu old bitch","commenter_a":"God help America if Hillary or Sanders ever become president","post_message":"Bernie Sanders is leading Hillary Clinton by a stunning 30 points among voters under 30, according to NBC's first post-debate poll."}]
