[{"comment_id":"10153994015308132","commenter_b":"Chile sit her was down Jim Carey prob has Ebola and she sucked that Dick down","commenter_a":"Ignorant woman.","post_message":"Jenny McCarthy has more to say about Charlie Sheen."},{"comment_id":"842369659142996","commenter_b":"Child abuse has actually increased since Roe v Wade. Abortion logic 101...the baby \"might\" be abused later so we'd better kill her now; the baby might actually get to LIVE in a non-traditional home so we'd better kill her now\". Sheeeesh, the stupidity.","commenter_a":"So many young couples would love to take that precious angel growing inside of you. Please don't murder that innocent baby..","post_message":"You don't get to \"choose\" to kill another human being."},{"comment_id":"10152864725267623","commenter_b":"Bajajajajaja!!!! Girl white isn't in it either! Lol","commenter_a":"Lmfao!!!! I am loving how pressed these folks are over this!! Get over it people...and move on!! I'm so happy with my President!","post_message":"Check out what the Obama administration did to the White House:"},{"comment_id":"10154295602821037","commenter_b":"Claude, women who use the term \"Feminist libtard\" are sexy.","commenter_a":"Good lord! If men couldn't get a job because they hit on a woman at one time or another throughout the years, there wouldn't be any in the workplace! Women like this give us all a bad name. She must me a feminist Libtard! I'm sorry....some people will do anything to get attention and they are coming out of the woodwork! She acts like he raped her! I'm guessing she's trying to make a name for herself through Trump since she couldn't with her writing skills.","post_message":"Our reporter attended a Donald J. Trump event in 1987: \"Trump said there would be an even better afterparty and I was welcome to join him, but only if I came alone.\""},{"comment_id":"1117955828258960","commenter_b":"Smart girl","commenter_a":"Why doesn't he acknowledge Tiffany??--- his daughter with Marla??","post_message":"Donald J. Trump has asked the White House if his adult children can have top-secret security clearances."},{"comment_id":"913542928735066","commenter_b":"President Barack Obama saved America while dealing with racism, hate and obstruction.... @webpagelink","commenter_a":"Look at his eyes. He's not just low energy. He's medicated.","post_message":"Ben Carson thinks being called out on homophobia is what's destroying America."},{"comment_id":"455406524619303","commenter_b":"And guess what... that girl who got pinned to the ground.....yeah she has a pass to the pool.","commenter_a":"I love kicking people out from our community Pool. They are not allowed because of \"race\" but because they don't own a house in our \"Gated\" community and pay HOA fees.","post_message":"\"The officer never asked any questions. He jumped out of the car and immediately started running to the black kids.\""}]
