[{"comment_id":"1270150533061172","commenter_b":"Lock her up","commenter_a":"we all know it was a fake story but the truth is 'SHE IS A TERRORIST 'spreading hate is no different than using a knife or a gun.","post_message":"Fake News: Drunk Trump Supporters Assault Muslim Woman in NYC Subway, Call her a 'F***ing Terrorist'"},{"comment_id":"1514026052232145","commenter_b":"Omg can you just shut it, you selfish brat!!!!","commenter_a":"Hey I thought he was leaving this country cause he did not like here. Well be gone with your bad self","post_message":"An expletive-filled clip of Kanye West's alleged tantrum has leaked."},{"comment_id":"968194983273556","commenter_b":"The bitch sucks and is a liar and a cheat","commenter_a":"Is she your next President? I don't think so.","post_message":"She still managed to pay herself back the $1.3 million she lent her disastrous campaign."},{"comment_id":"1760125540941984","commenter_b":"They're far better than Hillary and her crooked minions! If she gets elected, we'll be under Sharia Law so fast your head will spin!","commenter_a":"Too funny - it just continues to be the funniest convention of all time - Hey, Christie a few months ago when you were running yourself - you decardedTrump unqualified to be President - too funny. All of these clowns: Christie; Gingrich; Pence and TRUMP are all an embarassment to the GOP party.","post_message":"Delegates at the Republican National Convention chant 'lock her up' as Governor Chris Christie says 'I welcome the opportunity to hold Hillary Clinton accountable for her performance and her character.' More: @webpagelink"},{"comment_id":"1296306160407617","commenter_b":"I hope that VA dentist is in JAIL!","commenter_a":"No one at the VA loses a job; for any reason. The 2014 fudged wait list debacle resulted in no nurse or lying administrator losing a job or even pay. The VA is a corrupt leviathan in need of elimination. And with my first hand knowledge of the organization, I would put a bullet in my temple before becoming a patient in the system.","post_message":"Absolutely horrific! This department needs to be cleaned out top to bottom, and people need to be punished for letting things get this bad."},{"comment_id":"10153564606248984","commenter_b":"She needs to be taking down. She not worried about what you doing. This needs to be done quickly","commenter_a":"She should not be allowed to run. She is a liar bad person evil evil !!!! If she gets in people pack your bags go anywhere don't stay here she will put the cherry on the demise of our country !!!!!!","post_message":"Hillary’s been caught in another blatant LIE regarding her private email server. In a recent interview, Hillary said she had not been subpoenaed by the Select Committee on Benghazi, but records indicate she was subpoenaed in March 2015. Even the press covered it!  Rep. Trey Gowdy won’t tolerate her deceit, and neither will we.   Send a message to Rep. Trey Gowdy telling him what you think!"},{"comment_id":"1025040644216607","commenter_b":"'@username , I think there is, but would have to look it up. Basically the way it would work though is if impeachment is not possible, a no confidence vote by congress could in effect say we no longer recognize this Presidents authority. Members of congress can be sanctioned, why not the POTUS?","commenter_a":"What we need is Nation wide non-compliance with, or recognition of authority, or any further orders coming out of the White House. Personally I think a no confidence vote is in order. Write your Congress and demand the sanctioning of the President until the end of his term, for gross executive over reach and abuse of power.","post_message":"The president continues to show his disregard for millions of Americans with his 'Bathroom Order,' never bothering to consult with parents. Instead, he decided to issue an order threatening the loss of funding and lawsuits from the government to schools that don't comply."}]
