[{"comment_id":"598960046961241","commenter_b":"YES, fire him!!","commenter_a":"I agree he definitely needs to be fired","post_message":"Police chief announces that he going to enforce Shariah Law.  He can't get away with this. Shariah law has no place in America.  Do you think this police chief should be fired?"},{"comment_id":"10154342587333258","commenter_b":"David Mayhew The problem with your statement is that your assumption is that just because they have been drinking, they are going to use a gun. Just because a guy drove to a bar with his car does not mean that he's going to do something irresponsible with it. I guess we should start seizing the cars of bar hoppers. Or we could categorize those cars that are most often DWI that injure or kill someone as 'assault cars' and start seizing those.","commenter_a":"Fewer guns would not have stopped this lunatic. We need more good people to be able to lawfully carry guns into more public places because the criminals will carry them wherever they want.","post_message":"The common thread in too many mass shootings was the availability of powerful semiautomatic weapons that serve no purpose but to kill. | Via Boston Globe Opinion"},{"comment_id":"884237991635950","commenter_b":"It just makes me disgusted with some of the women of today,maybe like u.","commenter_a":"Woman will perish in disgust trying to do everything man does.....","post_message":"Should every woman SHAVE her face?"},{"comment_id":"10152946649009641","commenter_b":"While I despise Islam I don't hate Muslims.. At all! It's not their fault if they're born in it. But I agree with letting no more immigrants into west! None!!","commenter_a":"allTerrorists should be killed to make the world better","post_message":"Gunfire echoes from two police raids ending terror sieges around Paris. One witness says: 'It's like a war.' Another describes how a suspect told him: 'Go, we don't kill civilians.' @webpagelink"},{"comment_id":"1044302852275608","commenter_b":"Trump wouldn't smoke a joint like billy tho","commenter_a":"'@username. @username we will work on your wall mr trump","post_message":"Outstanding! A top priority- so we can MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"1578043845546293","commenter_b":"Uhhh...Hillary won the election by 2.7 MILLION (and counting) votes.","commenter_a":"Another fake poll.... Just like the poll that claimed Hillary was going to win the election ..... Lie... lie.... Lie!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153220883066491","commenter_b":"Unnecessary! Girls that are having their period don't play with barbies","commenter_a":"LOL - that is just rich.","post_message":"“It’s just what happens in real life.”"}]
