[{"comment_id":"10153513415174342","commenter_b":"They should serve the same time they kep him as their slave...","commenter_a":"Where are theBLM in this?","post_message":"A doctor and his wife moved from Nigeria to Britain in 1989 and with them came a 13-year-old -- whom they told officials was their son."},{"comment_id":"10153563758934607","commenter_b":"Are you a democrat? Yes you are. No thanks","commenter_a":"NO.. Cummings supports Clinton.. Anyone connected to her is a NO VOTE..","post_message":"Congressman Elijah Cummings, who announced Tuesday morning that he was backing Pugh, said she has a proven record of passing meaningful legislation not just in Annapolis but during her time on the Baltimore City Council."},{"comment_id":"10155261002826509","commenter_b":"I can tell you as a white American that she's not going to help me or my family either.","commenter_a":"I love how all you white Trump supporters are trying to convince African Americans how Donald Trump can help them and Hillary Clinton can't when you probably have no freaking idea what the African American Community needs. Hysterical. I know you don't like the analogy, but it would be like Adolf Hitler's supporters trying to convince Jews that the Nazi party is better for them.","post_message":"Senator Jeff Flake says, \"I simply can't\" support Donald J. Trump. cnnpolitics.com"},{"comment_id":"1735699086698296","commenter_b":"HOW - F_N confused is she ---OMG.....totally the opposite.......","commenter_a":"\"Yes We Can\" :)","post_message":"\"'Diversity' has come to mean that you have to be accepting of every different thing but you cannot, in any way, celebrate a traditional viewpoint.\" – Mike Huckabee"},{"comment_id":"1424826404224494","commenter_b":"Evil creeps just like their daddy.","commenter_a":"Assholes someone needs to hunt them down !!","post_message":"Madonna just called out Donald Trump’s privileged sons and it’s EPIC."},{"comment_id":"180851402403803","commenter_b":"Your a dumb bitch 😂😂","commenter_a":"@username dude this reminds of all of us 😂😂😂","post_message":"Friends like this  #WSHH"},{"comment_id":"10154004285427061","commenter_b":"She is so ugly put a sack over her face","commenter_a":"I tried a similar comment above in my own post. Ppl are to busy thinking they are better or truly know or believe in the government to see the truth right in front of them. A little less attacking the comments of others on Fbk, an you could be smart enough to see the truth. Sure everyone deserves to dress lovely; however people continue to starve. Until you have walked a mile as I have struggling to feed your family/children; enjoy your fancy clothes. I will enjoy feeding my family!","post_message":"WATCH: Fashion forward First Lady Michelle Obama stuns at last night's White House State Dinner: abcn.ws/2ejwQwD"}]
