[{"comment_id":"10152987685511051","commenter_b":"She is a whore. Why give her a pretty name. The whore was not forced to spread her legs to two guys in the same month? That makes her a big whore.","commenter_a":"The fathers of these twins are no better! I like how everyone always seems to too put blame on the women for her having sex with multiple men but it's take 2 to tango! Men are just as dirty.. It a 2 way street!","post_message":"The judge just made it official: these twin girls have one mom and two different dads."},{"comment_id":"10157695745225354","commenter_b":"Kanye and his fat ass bitch are 2 POSs.","commenter_a":"Yezzy? I think he probably meant sleezy.","post_message":"FIRESTORM as Twitter backlash grows.   Read the TWEETS:"},{"comment_id":"164458724060246","commenter_b":"Should give all their jobs to legal immigrants","commenter_a":"Good for the owner. Behind him all the way.","post_message":"30 WORKERS FIRED For Skipping Work To Protest On Behalf Of Illegal Immigrants…Calls Employer Who Fired Them A \"Racist\" [VIDEO]"},{"comment_id":"10153823780186051","commenter_b":"No. In fact, I wouldn't piss in her mouth if her teeth were on fire.","commenter_a":"Vote Blue no matter who!","post_message":"Simple question: Will you be voting for Hillary Clinton this November?"},{"comment_id":"10154713474904586","commenter_b":"GO VEGAN LEAVE ANIMALS ONE YOU EVIL PEOPLE","commenter_a":"I hope there is a hell, and the people who inflict this unspeakable cruelty on these poor helpless beings, burn in it for an eternity...lowest form of scumbag life on the planet..","post_message":"This is what \"shackle & hoist\" looks like."},{"comment_id":"1609502052678904","commenter_b":"That ole man wroke that check that his azz couldn't cash....","commenter_a":"shouldnt have been talkin shit","post_message":"Damn! Racist guy gets handled for saying the N-Word!  #WSHH"},{"comment_id":"699563113502060","commenter_b":"I don't like killing of animals or anything what soo ever..... but.... i don't mind hunting to Feed your family.. its just hunting for sport that i hate with a passion","commenter_a":"It doesn't matter how I feel about this! They are free to do as the law allows. My opinion is: this is awesome!","post_message":"How do you feel about this?"}]
