[{"comment_id":"10152931648796491","commenter_b":"They are business women now and could buy everyone on the show. Maybe they will make a cameo appearance, if the show stays on the air? They should just leave the show alone and move on with their lives.","commenter_a":"I believe they've both stated they are through with acting. Its their choice how they live their lives. They don't owe anyone anything. They're both very well suited for their current endeavors in fashion, out of the limelight.","post_message":"“I understand they’re in a different place and I wish them the best,” John Stamos said."},{"comment_id":"1642423912674968","commenter_b":"@username health INSURANCE is NOT health CARE","commenter_a":"Wait....hold on a second. Usually stories like this are about people fighting to keep someone alive who wants to die. This time, this poor guy wants to live and the hospital wants to take his life, while he is coherent and of sound mind? I didn't read the story, but I would bet this is all because of $$$ or medical insurance!","post_message":"Heartbreaking video shows Chris Dunn nodding and putting his hands together in prayer when asked if he wants to live."},{"comment_id":"10154126988050787","commenter_b":"And emma dunsdon, you filty woman.","commenter_a":"Zzzzzzzzz yet more boring posts from the BBC..oo I've got cancer, please feel sorry for me. Yeh we get it, is it a competition to get the most comments ,likes and shares on FB..let's just pull some ..more..on..those..heart strings.","post_message":"Battling cancer with confidence 🙌  Meet Laura, the make-up artist who works with cancer patients in her spare time. (via BBC Three)"},{"comment_id":"10153903054649753","commenter_b":"good ...she needs you to buy a ticket....unless she has already been forced to cancel all...","commenter_a":"of course she loves him....who ever heard of her before Blake....her new on tour being canceled for lack of sales suprise?????","post_message":"Blake Shelton started his 40th birthday celebrations with a cute note from Gwen Stefani. “Happy birthday to my favorite person I ever met @blakeshelton,” Stefani posted on Twitter. According to People, Stefani and Shelton’s PDA didn’t stop there. Stefani went on to share several messages to Shelton on Twitter and even changed her avatar to a photo of her country boyfriend. On Instagram, Stefani shared a photo of Shelton as a kid with the caption: “Happy birthday to @blakeshelton literally my... @webpagelink"},{"comment_id":"10153315040146336","commenter_b":"If the engine can take the stress of lifting a couple of hundred ton into the air at 700 mph I think it's ok after this girl sat on it......just me but then again I'm not STUPID either.........","commenter_a":"Absolutely not!","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"10153557927894411","commenter_b":"they should allow rocket launchers and rpg's to blow out anyone who draws out the frigging gun","commenter_a":"We need to make sure movie theater workers all carry guns so they can pull one from their holster and save the day!","post_message":"BREAKING: One of the deceased is the suspect, who reportedly turned the gun on himself."},{"comment_id":"1384175518259929","commenter_b":"Oh maybe he doesn't want the Hillary supporters burning down our country!!","commenter_a":"Y'all got conned. 😂😂😂. Only idiots would believe him. Go ahead, chant \"Lock her up!\" If there was a reason to, he would - but there isn't.","post_message":"President-elect Donald J. Trump does not plan to pursue charges against Hillary Clinton for her personal email server or allegations of pay-for-play at the Clinton Foundation, senior adviser Kellyanne Conway says. @webpagelink"}]
