[{"comment_id":"1439256216084684","commenter_b":"I ONLY HOPE FOR THE PEOPLE OF MASSACHUSETTS SEE WHAT A PHONY LIBERAL DOLT SHE IS.","commenter_a":"Caught Red-Handed! Elizabeth Warren's Big Secret Just Got Exposed for All to See... @webpagelink","post_message":"Is Elizabeth Warren in political trouble in Massachusetts?"},{"comment_id":"10153908601902629","commenter_b":"Bye bye, bitch!","commenter_a":"Hope Cliven doesn't have any horse shit on those fancy kickers","post_message":"Cliven Bundy, the Nevada cattle rancher who birthed the Oregon militia movement in more ways than one, was arrested last night on felony conspiracy charges after he tried to join the standoff."},{"comment_id":"598436243672056","commenter_b":"Henry Kissinger told Hillary that she can delete the emails too.","commenter_a":"Sure Killary doing what she does best: lie and blame somebody else for what she has done wrong.","post_message":"Hillary Clinton told the FBI that Colin Powell twice recommended using a private email account, according to sources."},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"},{"comment_id":"10152687938146813","commenter_b":"So what? Some women don't want to have kids at a particular time. Some never want to have kids. Second, most women who have abortions do so because of financial reasons. Third, contraception isn't 100% effective. Some types are only 75% or so effective. The diaphragm in a multi-para woman has a low effectiveness rate. I've been pregnant twice on oral contraception. Each woman has her own story. If she wants to tell it, she will. Otherwise, it's none of your damned business. Oh, and if my body is affected, it is my choice. I have self-autonomy over my body.","commenter_a":"Abortion is not a method to avoid pregnancy; a woman can avoid pregnancy by using birth control provided to her for free and not getting herself pregnant. Abortion is, in reality, simply a way to avoid MOTHERHOOD; it's not 'my body, my choice,' it's 'my LIFESTYLE, my choice.'","post_message":"The question matters: More people support abortion rights when the poll language focuses on women. #LetsTalk @webpagelink"},{"comment_id":"10158517971145725","commenter_b":"Another triggered cornflake with vagina envy","commenter_a":"You could fill 2 grand canyons with the amount of leg and vagina hair at this march","post_message":"Despite organizers saying the Women's March on Chicago was too big to march, demonstrators are on the move.   Live updates: nbcchi.com/lsLGCKs"},{"comment_id":"10153248489871037","commenter_b":"Rob your a pussy.","commenter_a":"Hillary for Prison 2016","post_message":"A variety of sources in the Clinton orbit say they are anticipating an imminent announcement of #Hillary2016."}]
