[{"comment_id":"978050422232298","commenter_b":"NOT A FAN of this pro-Muslim woman PERIOD!!","commenter_a":"She is the new definition of cool. Drop that mic and walk away.","post_message":"Mic drop."},{"comment_id":"10154407865186636","commenter_b":"Not by quite a wide margin however. How much Norbert get? 47% was it? It's already getting dangerous","commenter_a":"Austrians rejected the Far-Right, let's hope the French do the same, otherwise Europe will become a more dangerous place.","post_message":"Elections take place in April"},{"comment_id":"10152834207221130","commenter_b":"Suzie Mills when all the GB is gone xx","commenter_a":"Mark O'Halloran","post_message":"Practice makes perfect, little buddy."},{"comment_id":"1556887964609272","commenter_b":"People need to come in our country the right way. Obama wants to flood our country with illegals.","commenter_a":"Poor you Ted Cruz! You and Trump are almost the same thing!! But, there is a little difference! Do you know why Trump is leading the GOP? Because he is white, and you Cruz, you dont, not for the racist republicans! You has been descriminated for them too! You and Trump never will be president of this country!","post_message":"Ted Cruz on illegal immigration: “The federal government is doing a horrible job of securing the border. It’s utterly failing.”"},{"comment_id":"10150676513679999","commenter_b":"You're right @username, when I bought my Yankees jersey, I bought the Rivera one. Best closer ever.","commenter_a":"Nothing like the Yankees of my childhood. Subway series, tino Martinez, Alfonso Soriano, David justice, pettitte, Bernie Williams, posada and jeter. It won't ever be the same.","post_message":"The New York Yankees are knocked out of the playoffs after losing, 3-0, to the Houston Astros in a wild-card game."},{"comment_id":"10154382279344497","commenter_b":"Aye. Fuck bitches, make money.","commenter_a":"Single man enjoying free milk, basking in savings after not buying cows.","post_message":"Via ClickHole:"},{"comment_id":"10154994151726800","commenter_b":"Thinking of spending time at home. On the Galapagos islands with the other tortoises.","commenter_a":"@username dudes face says it ALL!!","post_message":"#LifesAMitch"}]
