[{"comment_id":"962901507102931","commenter_b":"Evil mother!!!","commenter_a":"That's just cruel!!","post_message":"This is what happens when a mum feeds her toddler a spicy Jalapeño chilli pepper ... 🌋🔥"},{"comment_id":"10153715482507452","commenter_b":"@username my point is just because the government calls it illegal doesn't mean so that's my point and hector no conspiracy you just like to believe everything the government tells you","commenter_a":"Even if the lady were to have been illegal, the US low key appreciates the narcotics the government sells it themselves on the side where else can they seize the dirty $$$ that keeps circulating","post_message":"A San Diego woman traveling from Mexico was busted at LAX trying to smuggle in more than 11 pounds of crystal meth tucked away in the lining of her suitcase."},{"comment_id":"10153095892296955","commenter_b":"How childish","commenter_a":"You gotta realize Nancy Pelosi, he's a better man than you'll ever be.","post_message":"White House warns Netanyahu not to reveal Iran details...   'Days when Jewish people remain passive in face of genocidal aggression are over'...   Broadcast Networks Refuse to Carry...   'Enraged' Pelosi freaks on floor...  Dems LASH OUT at Netanyahu, Tell Him to Go Home, Call Him 'a Child'..."},{"comment_id":"1076811719002844","commenter_b":"If this does not prove they are out to destroy America I do not know what will. they succeeded divding this country now they want to conquor it.","commenter_a":"Impeach all of them !","post_message":""},{"comment_id":"430612380465476","commenter_b":"And what about the.over a million citizen muslims already here?","commenter_a":"Muslim immigration should be halted in this country and every other civilized country. Radical Islam is killing the world's people while government ignorance (Political Correctness) stands by and allows it to happen. Obama needs to stop apologizing for America and start protecting the American people.","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"},{"comment_id":"401994746592233","commenter_b":"I haven't done any unlawful thing at all not that big too get my ass in trouble but I get tired of how they treating everyone","commenter_a":"I don't believe they should have their guns taken away. Their are some good cops haven't seen it with my own eyes but, their are some. I want to know why they so scared now. I know their was a dog in this case but, what about the other case where people don't have are unarmed and the officer fears for his life. Cops are pussies now a days this shot didn't happen this often just a few years ago","post_message":"This story is as appalling as it is tragic. The Cop Logic and pure stupidity of this officer is staggering. I still can't wrap my head around it. Yet another case why some people suggest police should be unarmed.  Read more: @webpagelink Via - The Free Thought Project.com <-- (y)"},{"comment_id":"10154028997088132","commenter_b":".. she is ugly","commenter_a":".. & soo - Kris Jenner is ugly","post_message":"Grandma Kris Jenner has arrived!"}]
