[{"comment_id":"10154075834221336","commenter_b":"Jen Beth -I'll probably do that too, but if Trump wins the nomination, Hillary becomes President.","commenter_a":"The only ones surprised at this are fox news , democrats and rinos. The people will put Donald J. Trump in as president","post_message":"\"I'm going to win states that nobody else is going to win on the Republican side... And we will get a lot of Democrats and Independents to cross over.\" – Donald J. Trump"},{"comment_id":"10153279474011680","commenter_b":"She's fat","commenter_a":"Hot daughter, John","post_message":"The daughter of Sen. John McCain, who picked Sarah Palin to be his running mate in 2008, said she was specifically pained because of Donald J. Trump's past remarks about her father's prisoner-of-war status in the Vietnam War."},{"comment_id":"10153076176308188","commenter_b":"Should have called Tiffany. Nothing like a woman to get the boys back on task.","commenter_a":"Did you save the fly or just let it suffer...","post_message":"So a fly landed in my breakfast juice.    Jeffy became fascinated with it struggling to live.  Next thing I know Keith is taking a picture of jeffy taking a picture of the fly and stu on skype with Wilson about the fly.  I had to join in and take a pic of the three of them taking a pic of the three of them with the fly.   Lord please help us.   Sometimes we are small and easily distracted and other times we are positively 12 year old boys."},{"comment_id":"810160139094199","commenter_b":"guns? what guns? we aint got no stinking guns. Now lets play hide and go seek...","commenter_a":"And hopefully this is what ends up being her downfall","post_message":"Band-aids don't fix bullet holes You say sorry just for show If you live like that, you live with ghosts..."},{"comment_id":"10153392928479170","commenter_b":"Don't you feel safe now that the country is being run by grunge mosh pit princesses like this character?","commenter_a":"She is a leftist loon with zero common sense. A perfect fit for the Obama team.","post_message":"The woman who gave you \"jobs for Jihadis\" is now working on the Iran nuclear deal. Time to \"Duck and Cover.\""},{"comment_id":"10153598659872434","commenter_b":"@username you females don't have any sense in your head that oppose this kind of thing.","commenter_a":"It is not any feminism I know that tells a person what they can and can't wear. Beach or not. France should stop blaming their bigotry on feminism.","post_message":"French officials have cited everything from hygiene to feminism in order to ban the swimsuit"},{"comment_id":"10154810175428812","commenter_b":"@username, sthu sodomite and go back where you illegally camd from before we deport you and your family.","commenter_a":"That deal needs to be voided. Why would the U.S.A provide this animals with more weapons? That is ridiculous,they are responsible for so many deaths of innocent people and some of those terrorists are amongst us her in the USA causing death and destruction.","post_message":"Senate expected to vote this week on a resolution to reject a pending arms sale from the U.S. to Saudi Arabia following reports of civilian casualties in Yemen at the hands of the Saudi-led coalition."}]
