[{"comment_id":"10156710754945093","commenter_b":"I dont think so!Murderous old hag!","commenter_a":"Everyone should know she is the liar, news video proves it.","post_message":"This woman knows no shame."},{"comment_id":"1240054509382884","commenter_b":"my state of AZ just paid a 3 million dollar fine to a private prison because it did not keep it filled to 97%.....they lock up undocumented immigrants for 6 months on the taxpayer dime before deporting them.","commenter_a":"When taxpayer money is given to private corporations to house prisoners we end up with the highest prison population in the world. That is not a coincidence at all. We taxpayers, the People, are paying for the subjugation and torment of a large portion of our population. Mostly a minority inmate population, I might add. It's just wrong no matter how you look at it.","post_message":"The U.S. has more people in jail than any other country on earth. To my mind, it makes a lot more sense to invest in jobs and education than in jails and incarceration. Our job: end the war on drugs, end private prisons and pass real criminal justice reform."},{"comment_id":"10153724479619614","commenter_b":"i hope that women go to jail for murder","commenter_a":"This person is not even human. She is garbage","post_message":"A New York woman who once worked for child protective services is accused of throwing her newborn daughter to her death from a seventh-floor window. Officials say the baby, her umbilical cord still attached, was alive when she was tossed from the building. Jennifer Berry, 33, was charged Tuesday with second-degree murder and manslaughter. The medical examiner says the little girl died from multiple blunt-force injuries consistent with a fall. Read KTLA's story here: @webpagelink"},{"comment_id":"10154038979953279","commenter_b":"Very simple by democratically changing the Congress /Senate, and local states governments with stateswomen /men that supports Bernie's and we the people's agenda. If you think outside the subjugated status quo box where you live it is possible to allocate the economic resources where we want it to be instead of for example spending trillions on wars and then passing a debt bill to we the people so we paid more to wall street. Simple enough. We can even pass legislation specifying since that Iraq war was illegal due to lies for greed we can write off that illegal debt and don't paid to wall street. Hmm just brain storming the possibilities once we change the Congress, Senate, and Bernie is our POTUS. Just follow THE PANAMA PAPERS.","commenter_a":"Hillary is Cynical. But we the people know who the real champion for the 99% working class wealth producers is. Only Bernie Sanders is genuine and legit to the people. #NotHer15 #berniesanders #latinosforbernie #bernieorbust #creditgoestobernie","post_message":"\"I’m supporting Bernie Sanders because he says no to fracking. I’m supporting Bernie Sanders because we do need a single-payer healthcare system that takes care of everyone. And that is not a pipe dream.\" - Rosario Dawson"},{"comment_id":"10153587068405329","commenter_b":"Dolphins are such vicious, terrifying monsters!","commenter_a":"@username \"It hit my wife and knocked her over, and punched my daughter.","post_message":"The dolphin jumped in, broke someone’s ankles and “punched” a 16-year-old girl."},{"comment_id":"10153719914114060","commenter_b":"these immigrants dont have a chance getting on the housing market","commenter_a":"Dave Thompson","post_message":"“People feel rich today thanks to these crazy prices.” Swedish house prices"},{"comment_id":"1203685899671880","commenter_b":"In America more people are killed by white guys than Muslims","commenter_a":"She is not brave. American people give folks a chance. Muslims do not. She knew what she was doing. Just like the Muslim who shot the police officer yesterday. She shot Trump the same way. She should have stayed away from the rally. It was a Trump Rally. Not a Muslim rally. What did she think would happen. She knew, she used the media and did not fool anyone. She also showed her true colors. Dressed like some person from the 6th century.","post_message":"This woman will restore some of your faith in humanity. Too bad her treatment at the hands of Trump and his reporters will promptly squash it."}]
