[{"comment_id":"10156282327890294","commenter_b":"screw u u hateful witch\\\\","commenter_a":"Society isn't the problem. Men dressing like women and visa versa is the problem. Also, walking in to traffic is a problem. Don't walk in to traffic. Don't blame other people for your actions.","post_message":"“From a very young age I was told that people like me are freaks and abominations, that we are sick in the head and society hates us. This made me hate who I was, \" she said in the post.    She asked others to share her story and said, \"Please help fix society;\" then she did something heartbreaking:"},{"comment_id":"10153845298899753","commenter_b":"Can 't see what any young girl would see in that creep--what do they see in those guys?","commenter_a":"Doesn't this family have any self respect? Who really gives a crap?","post_message":"Do Kylie Jenner and Tyga have a sex tape to release? Although multiple reports have claimed the former pair starred in a series of explicit films before they split weeks ago, Kylie Jenner and Tyga weren’t planning to release one of their clips last month. Following a report earlier this week, which claimed Kylie Jenner and Tyga were about to become the next celebrity sex tape stars just last month, a second report has shot the idea down. According to a May 23 report by Gossip Cop, Kylie... @webpagelink"},{"comment_id":"10154097450244641","commenter_b":"She legally can't give consent if she was drunk so it would still be considered rape......","commenter_a":"\"The alleged perpetrator initially told police that the sex act was consensual, but the girl told them that she had no memory of it\". She is suing although she doesn't know if she consented. I wouldn't be surprised if she had consented when she was drunk. This isn't your average \"She was raped. Case closed\" case. She shouldn't drink like an animal and have sex like one and then sue someone...If you can't handle yourself when you drink, you shouldn't drink! At 16 it is illegal to drink alcohol, so she should be charged as well for her own offense.","post_message":"The court dismissed the charge because unconsciousness and intoxication are not mentioned in the state's forcible sodomy law."},{"comment_id":"556485904539702","commenter_b":"Will her top fall off?","commenter_a":"What about the Blonde girl on the right? I didn't see anything unusual about her.","post_message":"TAKE A CLOSER LOOK A THE BLONDE GIRL ON THE RIGHT..."},{"comment_id":"10153045514858908","commenter_b":"Wrong. Anti-vaxxers allow a disease to evolve and make said vaccinations useless. If we ALL got vaccinated, the disease is wiped out and it can't evolve or spread. Science.","commenter_a":"So I go to read the article, and directly above it is a fear mongering advertisement with a link...don't catch shingles. Get your vacination now. SMH If you don't want vacinations dont get them. If you want vacinations get them. If you believe vacinations work then you are in no danger of catching the diseases from the people you are bitching at and preaching to. Mind your own business like people did in the old days before Facebook.","post_message":"Many important points made here are not to be ignored...."},{"comment_id":"10152995709171130","commenter_b":"I suggest we send her subservient hormonal ass straight to the Canadian border now!","commenter_a":"Ridiculous! Comment for someone that should know better Ms. CEO.","post_message":"What the..."},{"comment_id":"1296273287105505","commenter_b":"You can go to hell liar","commenter_a":"Thank you president Obama. You will always be my president . The orange one will never be able to walk in your shoes he is a lier and con man and most of all a racist sob. Never put president before his name.","post_message":"\"That's what separates us from tyrants and terrorists.\" Nearing the end of his presidency, President Obama shared his hopeful vision of America's future."}]
