[{"comment_id":"10153297238001051","commenter_b":"YES","commenter_a":"Yup!","post_message":"The man who murdered a Kentucky police officer on Sunday night has been fatally shot. Do you consider this justice served?"},{"comment_id":"10153356332992169","commenter_b":"Going to watch all the seasons leading up to it. I'm so excited, but already sad it's the last season.","commenter_a":"I CAN'T WAIT!!!!!","post_message":"NEW Downton Abbey video: Seeing is believing! The Final Season premieres Sunday, January 3 at 9/8c on MASTERPIECE | PBS (Masterpiece Theatre)."},{"comment_id":"1547490425548819","commenter_b":"Hillary is worse than any of that and if elected she would be appointing supreme court justices who are in there for life. It is unfair to say that we need to re evaluate our values because we want some one who can beat her. In the end America as a whole is not voting evangelical prudence and wisdom would say pick any one who can beat her. My one and only comment. Blessings sister...","commenter_a":"Christians who support Trump need to reevaluate their values. I've never heard of Christians supporting a strip club owner who defends Planned Parenthood and doesn't care about marriage, but that's just me. Oh yeah, and swears continually!","post_message":"Editors' Note: The Christian Post has not taken a position on a political candidate before today. We are making an exception because Trump is exceptionally bad and claims to speak for and represent the interests of evangelicals."},{"comment_id":"10154218056967439","commenter_b":"The ones in the Muslim communities that haven't done anything are still in Stage 1......just wait until they move to Stage 2 & 3....it is in the Quran: @webpagelink","commenter_a":"Cameron what a d-------","post_message":"And do what exactly? Convert? Christianity is not the problem. How many murders, attacks etc will it take for these craven quisling to realize their appeasement and submission is not working? UK PM Cameron: \"Our brothers and sisters who are Muslims, they want our assistance.\" Uh, no they don't."},{"comment_id":"10154194396888010","commenter_b":"Says a woman who has a child... but who only wants people who look like her and have money like her to have opportunities, though. #privilege","commenter_a":"This can't be serious? They want to provide State-finder childcare, too? And, preschool? Every study I read says the current system of young elementary school is failing kids (too much time in seats, not enough art and play, etc.) and the solution is to start them even earlier? Free childcare, free preschool, free K-12, and Bernie wants free college. Where does it end?","post_message":"The goal: free preschool and affordable daycare for all."},{"comment_id":"534617120056639","commenter_b":"Mike Bassenti This is what they get for coming here !! We have to pay for this ! @webpagelink","commenter_a":"Big news is Trump is earning MAJOR support from segments of the population which almost exclusively vote for Democrats. SurveyUSA announced that Donald Trump would receive 25% among black registered voters. That is news that has Hillary Clinton terrified, and is shaking the political establishment to the core!","post_message":"I had an incredible time in Detroit yesterday. A great experience - learned a lot by listening to everyone. I am grateful for their support - and time. You can catch what I had to say to everyone, right here. Thank you! -DJT"},{"comment_id":"10153641179393132","commenter_b":"I agree. She's a scam artist. But other women don't think women do that apparently...","commenter_a":"This woman is a monster in female skin. Let me generalize by saying that she makes you all look bad.","post_message":"\"He thought he owned her.\""}]
