[{"comment_id":"1216368028409389","commenter_b":"Allyson the bitch","commenter_a":"Donald the Clown and his Republican surrogates will lose big time !! Only imbeciles will believe he stand by working class Americans","post_message":"I stand for ALL AMERICANS! Deplorables, basement dwellers, I stand for ALL of YOU!"},{"comment_id":"10156072417220603","commenter_b":"Well take up not enough jobs with the people that keep letting foreigners in the country.","commenter_a":"Yall saying people should be able to support themselves are not understanding that jobs at McDonald's etc are NOT meant to support a family. If you have a job there and have a family they (McDonald's) and us (people that will take the hit of a min wage increase because the cost of products will go up) should not have to pay for your poor choices for not being mature and either going to college or tech school or working your way up in a company. Min. Wage jobs are for high school/college students so if youre past those ages and still making min. wage you should've made better choices and should stop expecting the same pay as people that did!","post_message":"Do you think the minimum wage should be raised?"},{"comment_id":"10154743377731037","commenter_b":"Keep 'em coming. Nothing's going to change my mind or anyone else's. The one thing that all of you had in common before today is that Hillary already had you fooled. It's not working on the rest of us, so sit back and enjoy the next four years that not only I know is coming, but SHE CLEARLY KNOWS IS COMING, hence the grasping at straws that we are witnessing this morning.","commenter_a":"It's hard to distinguish between the most rotten pile of trash this morning! You have: -the 'accusers', who have remained silent throughout the whole campaign until Andy Cooper asked a question that, in his coke-addled and cock-obsessed mind, he thought would surely win him a Pulitzer. -the Clintons. ('Nuff said) -the MSM thinking that we'd all just magically buy this crap. Don't be fooled, America. You see the direction that they are bending over backwards to point you in. Vote Trump and let them know that you're not going to stand for it any longer!","post_message":"A woman alleges she was raped by Donald J. Trump when she was 13 years old in the mid-1990 — and now Law & Order: Special Victims Unit' is taking on the case."},{"comment_id":"10153171021535950","commenter_b":"she gave him head while the lieing bitch watched and then joined in!","commenter_a":"From many people that know them personally, he has a few girlfriends. One in Canada. It's a marriage for show only.","post_message":"The United States' ultimate political power couple, Bill and Hillary Clinton, celebrate 40 years of marriage today. Their marriage certainly hasn't been all smooth sailing..."},{"comment_id":"10155875428813009","commenter_b":"She cant even talk, another wacko","commenter_a":"Fake News! Liar!","post_message":"Nancy Pelosi was asked about Trump's Supreme Court nominee. Her answer left CNN's Jake Tapper speechless."},{"comment_id":"1389869284386873","commenter_b":"Nothing, absolutely nothing. Vote them all out, they deserve to be jobless.","commenter_a":"They took a lot of time off, which means they weren't doing even more stupid hurtful stuff.","post_message":"We'll wait.  Like Addicting Info for more great content!"},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."}]
