[{"comment_id":"10154376306546636","commenter_b":"She did? She'll never get out of prison.","commenter_a":"She got off easy for mowing down people terrorist style. Or maybe they got the idea from her idk","post_message":"A woman accused of a deadly crash that claimed four lives during a homecoming parade in Stillwater has accepted a plea deal."},{"comment_id":"574728392714767","commenter_b":"You should be worried about all of these weekly race riots, terrorist attacks, and minority crime. All three of those factors are why Trump will win. People do not want a third Obama term, which is what Hillary offers. Why do YOU, white person support the Democratic Party, the party that hates you, and legalizes racial discrimination against you? You are like those Jews in 1932 Germany who supported the Nazi Party. You both follow the political party that calls for you demise.","commenter_a":"What I'm worried about is Mr. Reality TV turning what should be a serious debate into another stupid episode of The Apprentice, and the media not giving a damn because it makes for good ratings ... and then our dumbed-down electorate lapping it up.","post_message":"Tonight debate between Hillary Clinton and Donald J. Trump may be one for the ages. But history shows it not the great arguments we remember, but the zingers and gaffes."},{"comment_id":"10153208287689087","commenter_b":"@username ... Trump was the topic being discussed. TRUMP didn't start wars.","commenter_a":"Rand Paul.. u r not only a sore loser, u r also a isolationist. We di not want America to be a isolationist nation. We like Trump and his \"make America Great Again\" message. We are REAL Republicans wanting real RESULTS, not words.","post_message":"“The message hasn’t penetrated yet that Donald Trump isn’t one of us. He’s barely a Republican. He’s been a Democrat,\" Rand Paul said. “I think ultimately when voters fully grasp who he is and what he supports, I think they’ll run away with their hair on fire.\""},{"comment_id":"10154056899827541","commenter_b":"Did you know that one the kkk used to lynch Italians as well?","commenter_a":"All you morons. This is an italian thing. And they are white. Get over it already. Its 2017 almost","post_message":"A high-ranking mob enforcer from Queens told a gambler who owed his boss money he was saved by the color of his skin."},{"comment_id":"10153687652479885","commenter_b":"That was stupid! Sounds like she needs to take that conceal carry class again!","commenter_a":"If you pull a gun out you need to pull the trigger. Shoot to kill not just threaten.","post_message":"A Florissant man was charged Tuesday with grabbing a pistol from a woman Saturday as she was trying to prevent him from attacking her friend in University City, then beating her and her friend with the gun and shooting one of the women."},{"comment_id":"1359039877491459","commenter_b":"Muslims are the devil","commenter_a":"What the hell is he. Trying to make things harder for Trump?","post_message":"SICK: While You Celebrated Christmas, Obama Gave FULL CONTROL Of Christian Holy Sites To Muslims"},{"comment_id":"1271695059532579","commenter_b":"she is so miserable with herself she just lashes out at everyone such a poor excuse for a female","commenter_a":"Rosie is not well! Needs Mental Health help!","post_message":"Rosie is disgusting!"}]
