[{"comment_id":"1865190080165091","commenter_b":"What about the serial killers child molesters child rapists murderers here in the United States we should get rid of all of them as well have them sent somewhere so they can stop all this craziness here and yes there are many Savages right here in the United States","commenter_a":"These people are f--king sick get them out of our Country.","post_message":"Muslim Nurse Mutilates Little Girl’s Genitals, What She Told Her Is Even SICKER"},{"comment_id":"10153307893053352","commenter_b":"They both should quit. There should be a black woman on the panel discussion.","commenter_a":"Kelly your the best always classy","post_message":"Kelly Osbourne Threatens to Quit ‘Fashion Police’ Over Rancic’s Racist Remark on Friend Zendaya"},{"comment_id":"10153776592904087","commenter_b":"Socialists always promote Violence. In Europe They promote Muslim Violence by being WEAK!","commenter_a":"Bernie is an enabler for the lazy self entitled youth of this country.","post_message":"'Party leaders in Nevada...claim that the Sanders campaign has a ‘penchant for violence.' That is nonsense,' Bernie Sanders said in a statement. 'Our campaign has held giant rallies all across this country, including in high-crime areas, and there have been zero reports of violence.'"},{"comment_id":"10153427592702377","commenter_b":"WE NEED TO TAKE THE WHITE HOUSE BACK!!!","commenter_a":"Carefull what you wish for... then stack the $15 minimum wage movement on top of that! :-(","post_message":"April 15 just got a lot worse."},{"comment_id":"10157822759390389","commenter_b":"She is a joke","commenter_a":"Evil woman","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"845590435487585","commenter_b":"There are many ways to keep from getting pregnant and they can be gotten for FREE!!! There is no excuse for getting pregnant!!! Abortion is a crime!!","commenter_a":"Give the moms the hope that they will be helped with expenses after their baby is born...don't vote down programs to help the poor.","post_message":"Tell Congress it's time for them to protect LIFE!  CLICK HERE to urge your Congressman and Senators to cosponsor the Life at Conception Act! @webpagelink"},{"comment_id":"10153530483933872","commenter_b":"We are tired enough of the lies and deceit and are going to vote you out- both of you wicked queens of the damned!","commenter_a":"Oh no, Patty! Why do you have to endorse Hillary? Disappointed that you don't #feelthebern","post_message":"It's great to see Hillary Clinton focus on this critical issue for our families, our economy, and our future."}]
