[{"comment_id":"836657323038276","commenter_b":"She didnt get in trouble for the see through top. She got in trouble for her shoulders. Even if she did wear a shawl over it, it would still show the see through part","commenter_a":"I agree with the school","post_message":"Take a close look."},{"comment_id":"10152587064680667","commenter_b":"Yes because white girls don't fight!","commenter_a":"maybe they should stop fighting #worldstar","post_message":"\"Like white girls, they face gender stereotypes. Like black boys, they face racial stereotypes.\""},{"comment_id":"552107031615918","commenter_b":"Jordan get out of here with that nonsense.","commenter_a":"Doesn't affect me. I'll be voting for Bernie.","post_message":"In response to a VICE News FOIA request, a federal judge on Thursday ordered the State Department to release the bulk of the remaining Clinton emails before the February 27 contest."},{"comment_id":"1802278956685902","commenter_b":"She is winning calm down","commenter_a":"Bahahaha 95% of the comments are anti Hillary and they have us believing she is winning...","post_message":"We're in Denver, Colorado, where both Bernie Sanders and Elizabeth Warren are holding a rally for Hillary Clinton."},{"comment_id":"10153236165233984","commenter_b":"Someone needs to sew a ZIPPER in her face!","commenter_a":"please STOPP","post_message":"Are you kidding me lady? Stop, just stop, please.  Do you think this new mandate is completely over the line?"},{"comment_id":"10153484658844060","commenter_b":"Let me clue you in on something: just saying \"I won, you lost\" doesn't make it so. In the adult world, you must present logic, facts and empirical evidence, which I did. Which enables me to say \"I win, you lose.\" It's ludicrous to even debate about how badly CA has done over the past 20 years due to liberal socialist policies. They're more in debt than most third world countries. Jobs and people are fleeing the state and illegal immigrants are destroying CA. I'd no more debate this than 2 +2 = 5. In summary, you're not only a loser but a leftist idiot. Ciao stronzo.","commenter_a":"America is the same. Some strong states like CA and some very weak states like SD.","post_message":"This week's KAL's cartoon @webpagelink"},{"comment_id":"10154579392684062","commenter_b":"Apparently not a gem if she can't get someone her own age. And it really doesn't matter. She is sick and needs to be Put in jail!","commenter_a":"I bet she's white","post_message":"She hasn't been arrested yet."}]
