[{"comment_id":"880520761983346","commenter_b":"Perfect pic of her with her mouth wide open.","commenter_a":"She is scum.","post_message":"Tom Selleck is awesome!"},{"comment_id":"10158501274630389","commenter_b":"Put her back in prison or deport her.","commenter_a":"She has all the qualifications to head up the DNC or Planned Parenthood.","post_message":"Despicable."},{"comment_id":"10153465334273132","commenter_b":"This case may seem cut n dry but so much time has gone by plus they never found his body.. I would not want to be a juror on this case","commenter_a":"They had a convict in prison who was even more than likely this little boy's killer. I think this is why this guy's 'confession' is so questionable. The investigators refused to admit they made a huge mistake, not surprisingly. I don't think they have the right guy, as for the real killer, I believe he died in prison. The whole thing is tragic.","post_message":"The jury has already been deliberating for 11 days."},{"comment_id":"10152623006528067","commenter_b":"Explain free? Teachers work for free? Colleges get free utilities and maintenance? Books?","commenter_a":"Nothing is free","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"1163296670367051","commenter_b":"Oooooo","commenter_a":"@username @username ummm they airways served alcohol. Unless they are talking about Webster","post_message":"Chuck E. Cheese's: Where a mom can be a mom! The family-friendly chain is hoping to lure in millennial parents by adding beer and wine to the menu."},{"comment_id":"10153973402646350","commenter_b":"Damn her! So bloody uncooperative.","commenter_a":"Every fortnight I clean out the strainers, wipe under the rubber and run an empty dishwasher on hot with vinegar, bicarbonate and eucalyptus oil. Same for my washing machine.","post_message":"The answer is"},{"comment_id":"1574139022896040","commenter_b":"Put this animal to death!","commenter_a":"Yeah, good luck with that.","post_message":"The Attorney General is required by ethics regulations to avoid even the \"appearance\" of a conflict of interest. She has clearly violated this regulation. SIGN THE PETITION to join us in demanding her resignation."}]
