[{"comment_id":"726722780803193","commenter_b":"Bloody Tim with all his Facebook profiles!","commenter_a":"Tim Duurland @username Adam Burns Tim Duurland","post_message":"This \"smart table\" could be the future of ping pong."},{"comment_id":"10153465142866037","commenter_b":"Regina just stfu. Idc","commenter_a":"who cares. its their country their rules. i dont see why people like to police other countries because they find their practices to be disgusting. no different than people consuming pigs, goats, cows and chicken. don like it? donate other possible food sources then. if not stfu","post_message":"\"There are all sorts of cultural norms about what you can eat; you eat turkey, so why are you trying to force us to not eat dog meat?\""},{"comment_id":"10154667540793812","commenter_b":"#theybothsuck","commenter_a":"#VOTETRUMP","post_message":"UPDATE: One person in custody after two officers are injured in shooting in Arkansas. abcn.ws/2aGeleD"},{"comment_id":"10154001964165329","commenter_b":"yep these girls need to be fitted properly and get the right size!","commenter_a":"Dude half of them are in the wrong size & the VS bra featured isn't a push up, it has all over padding. This makes me want to give them all personalized lingerie sessions / lessons","post_message":"Do push-up bras actually work? And if they do, do they make us feel any better?"},{"comment_id":"665234353646282","commenter_b":"Can't make a silk purse out of a sow's ear.","commenter_a":"#klasssa 👌","post_message":"Do you think the Obamas represented America with class as our nation's First Family?"},{"comment_id":"1839325792793827","commenter_b":"Sandra you old hag","commenter_a":"I hope he suffered.","post_message":"State run Press TV said Rafsanjani, 82, died from the heart problems despite efforts by doctors to save him."},{"comment_id":"10152867173405667","commenter_b":"Can't stand her","commenter_a":"Start with the thugs then will talk","post_message":"\"How is it possible that we as a nation allow guns to fall into the hands of people whose hearts are filled with hate?\" Hillary Clintonsaid."}]
