[{"comment_id":"1324418074301084","commenter_b":"And his nephew is married to Chelsea Clinton.","commenter_a":"This EVIL, sob needs something to happen to him, and take him out of his misery. As long as he is around ,this Idiot will keep causing trouble. He needs to go away forever.","post_message":"Take a look at the list... You will be shocked at some of the names on it!"},{"comment_id":"1630331337026989","commenter_b":"@username Yes. That is certainly a tragedy which no one denies. These people were murdered and their sacrifice should be honored. This article is stating that obama could have stoped it and deliberately did not. This is fake news at its highest degree and is shameful because it uses the dead to tell a lie.","commenter_a":"Fake news: Moreover, the majority report issued by the House Select Committee on Benghazi plainly stated that, minutes after learning about the ongoing attack at the U.S. diplomatic compound, President Obama and Secretary of Defense Leon Panetta issued \"clear orders to deploy military assets\":","post_message":"Here's the proof folks. Both Hillary Clinton AND Barack Obama are now exposed for not pulling the trigger to save anyone's life in Benghazi, when they could. This is the end of their careers! Let's get 5,000 shares if you think they should both be locked away for war crimes."},{"comment_id":"865303986949796","commenter_b":"She has the 2nd highest rated show on cable news and all YOU have is this little space on Trumpbart to air your idiotic views. Not hard to see who is more important.","commenter_a":"Grow up Megyn....as I have stated before...YOU went after him and lost ALL credibility you had. As important...your \"love fest\" with the disgusting Michael Moore was the last straw. Get over it...you just are not that important.","post_message":"Megyn Kelly tells Mediaite she worries that “someone’s gonna hurt me in the presence of my children.”"},{"comment_id":"10154336216583010","commenter_b":"An illegal aliens will take the job for pennies on the dollar...or a machine will replace you.","commenter_a":"But..but, if we raise minimum wage and pay people overtime, that would just create \"Dependency\". Then everyone who works for a living will expect to be paid a fair wage. Because you know, minimum wage jobs weren't meant to teenagers the hoopnard tractor socks because the hoodad ya ya. You're not supposed to pay for stuff like luxuries like food and rent because inflation. Death. Destruction. Burger flipping robots, twenty dollar Big Macs, dogs and cats sleeping together, locusts with the face of man, all because a soldier gets less than a french fries cook. Benghazi. Save up 112 years and go to school if you want $15 an hour, moochers ! Tuition isn't that expensive if you sell a kidney. You have TWO, stop feeling entitled to your organs. If you really want to help people get ahead, give MORE TAX breaks to the rich and keep the gay ...","post_message":"More than two-thirds of Californians support the state gradually increasing the minimum wage to $15 an hour."},{"comment_id":"10153166398548812","commenter_b":"If you want current news coverage, go to the news stations. Not Obama","commenter_a":"where is obama,why he is deadly silence now ?","post_message":"\"My best friend was killed and I don’t know why.\" Chapel Hill Shooting: @webpagelink"},{"comment_id":"1678937325726713","commenter_b":"Prayer is on the way","commenter_a":"Prayers for Ava. Willie Nelson is GREAT!!","post_message":"Please spread this and send your prayers."},{"comment_id":"533146616873631","commenter_b":"She is a racist nigga pig","commenter_a":"Not that he's is so bad give up the race crap","post_message":"I AM SICK AND TIRED OF THIS BS..."}]
