[{"comment_id":"10154608695637994","commenter_b":"These girls are exactly why we have insecure girls in high starving themselves! There are consequences to your actions! I bet she ain't laughing now!","commenter_a":"I was just wondering what happened with this.","post_message":"Playboy model Dani Mathers could face prosecution for posting a photo of a naked woman, without her knowledge, in the locker room of an LA Fitness. Mather posted a photo of the naked woman in July to her Snapchat with the caption, I can unseen this, then you can either. Do you think she should spend some time in jail?"},{"comment_id":"894090494050894","commenter_b":"This girl is a sore loser ,,, she rather have Trump as the next potus. That is scary","commenter_a":"I'm disgusted that the potential first female nominee of the Democratic Party (as Jill Stein is the first female nominee of a major political party) will have gotten there through a rigged election process, a purchased dnc, a fraudulent charitable foundation, numerous voter fraud allegations all while under investigation by the FBI. As horrific an individual as Trump is, he won the nomination far and square. He didn't cheat. The GOP didn't rigged the process for him. He appealed to the base, and won. That is the beauty and consequence of true democracy. A man like Trump deserves to win if he is honestly elected by the majority of Americans. The country will then reap what they sewed. Hillary however, through her lies, corrupt politics, money laundering through taking advantage of the horrific Supreme Court Citizens United decision, and unwavering allegiance to the banks and financial systems who almost destroyed ...","post_message":"To every little girl who dreams big: Yes, you can be anything you want—even president. Tonight is for you."},{"comment_id":"10153080407966323","commenter_b":"No but seriously why the hell would a girl shave their face...?","commenter_a":"Um I've shaved my face for like 6 years and had no issues.. hair getting thicker from shaving is a myth.. the reason people think that is because hair tapers to a tip and when you shave that tip off the hair seems thicker.. but its not.. it's just the end of the hair and it has always been that size","post_message":"Is it a terrible idea for women to shave their faces? Yes, yes it is."},{"comment_id":"1039629819427046","commenter_b":"Americans could get jobs if they'd get off their fat asses and go to school. All these uneducated Trailer Trash need to go back and graduate 3rd grade.","commenter_a":"We have Americans that are finding it hard to find work because of the flooding of all the refugees just think that will be 50000 more Americans that won't be getting a job because they will","post_message":"BREAKING: Two Iraqi refugees in the U.S. were arrested on Thursday for supporting terrorist groups in the Middle East. The FBI Director has repeatedly said that the U.S. does not have the ability to thoroughly screen refugees for terrorist ties."},{"comment_id":"10154529100646323","commenter_b":"@username..tanks, anti-missile system or cannons are completely useless in civil war in a country where anybody and everybody can have a gun. And when government doesn't know who has it. There's a reason America in a last century (and before) was the safest place to live in the world. Totaling all the murders in 20th century USA is 10-20 times safer than S. America, Africa, Europe or Asia. Thanks to 2nd Amendment in our Constitution.","commenter_a":"It is odd how right-wing custodians of patriotism have a problem with Kapernick regarding the anthem but hardly emit a peep when scores of people are killed by lunatics with guns who take advantage of that great piece of antediluvian legislation otherwise known as the Second Amendment.","post_message":"\"Declining to stand and laud that country until these outrageous, deadly imbalances are repaired – until our flag actually does represent everyone – is perfectly reasonable. America gets my unreserved, hand-on-heart patriotism when it earns it.\""},{"comment_id":"1267284936616307","commenter_b":"Figures that the media would just cover his Donald Trump comments but not on climate change comments.","commenter_a":"And igloos.","post_message":"Stephen Hawking issued a dire warning, but it wasn't about Trump."},{"comment_id":"977430998961803","commenter_b":"Europe just \"undid\" what the last Christian Crusades accomplished. All who refuse to convert to islam will soon be put to the sword.","commenter_a":"Europe is not the Europe we knew yesterday, history has been made today. Europe will not longer be Europe it is now a Muslim world. We just lost the wonderful world of Germany, France, Spain, England, Poland, Austria, etc. It's sad, the only one fighting for their country is Hungary and I give them a lot of credit, they don't want to lose their Christian faith. And America is next, we will be taking in thousands but the problem is we don't know if we are getting terrorist or good people. All I can say is God Bless us all,","post_message":"Why are the \"refugees\" mainly fighting age men? Where are the women, children and elderly?"}]
