[{"comment_id":"611157035758918","commenter_b":"Deport them","commenter_a":"I would hope the FBI is investigating this organization for violating a US law!","post_message":"The \"religion of peace\" strikes again..."},{"comment_id":"468706906587237","commenter_b":"She is a Dumb Idiot!","commenter_a":"We dont need awoman Preident .that is for immigration ....","post_message":"Carly Fiorina just had these harsh words for Donald Trump. Do you agree or disagree?"},{"comment_id":"10152733465191051","commenter_b":"Karma is a ×itch!","commenter_a":"What goes around, come around. Can't feel sorry for a woman who screwed up her own life, and took it out of a child.","post_message":"A woman who killed her daughter and never served any jail time for it has just been found dead."},{"comment_id":"1728134044133544","commenter_b":"Screw off with trump both candidates suck","commenter_a":"IM STAYING AROUND TO SEE HOW BAD IT IS HAHA","post_message":"This was a \"Behind the scenes TV Production Meeting\".  The really good part to me comes about half way through where we begin to discuss show on future tech and AI."},{"comment_id":"10153000313242383","commenter_b":"you mean Haliburton? .. don't you think they got compensated enough?","commenter_a":"What about the contractors who did everything including making the ultimate sacrifice only to come home and be crapped on","post_message":"Interpreters who helped save Marines lives on the battlefield are fleeing to the U.S. with nothing  so one Marine is pushing to get them veterans benefits. @webpagelink"},{"comment_id":"10153280384163812","commenter_b":"Stfu bitchass","commenter_a":"Time to eliminate this threat to life.","post_message":"He's back, but this time, instead of just going for a leisurely stroll, Goliath the massive alligator is spotted trying to eat an entire turtle on his Florida golf course: @webpagelink"},{"comment_id":"10153952670046509","commenter_b":"Seriously.. Why are people mentioning Asians at all?! Great for them, and when they are highlighted, I praise them too.... However, The point of the article was to bring light to a young man doing exceptionally well. He has a great start to life and a great career. All praises due and deserved. Anything else doesn't even matter.","commenter_a":"Because his SAT scores are off the charts!","post_message":"He was accepted by all 8 Ivy League schools. How’d he do it? @webpagelink"}]
