[{"comment_id":"475516605979471","commenter_b":"Getting a little tired of the, \"MUSLIMS\" trying to change our great country of AMERICA!!! If you infidels don't like our country, please feel free to go back to where you came from or if you're an American muslim, get used to our way of life or ship out & go to a muslim country from which they came. I'm sure they need you in those countries since so many have migrated here.","commenter_a":"So then go eat at Camel humps grill","post_message":"McDonalds, KFC, And Pizza Hut Say No To Halal Meat And Muslims Are OUTRAGED  There is no reason why they should have to change their business for them.  Do you support these food chains?"},{"comment_id":"1010697719021125","commenter_b":"It must be true, it's on Facebook, Melanie. Facebook!","commenter_a":"Chris this was an op ed piece in a psych journal and not scientifically tested - don't tell me not to hug my dogs!😉","post_message":"Noooooo"},{"comment_id":"10155444032526509","commenter_b":"@username Hillary is a good start then! She devil in the flesh you're so smart","commenter_a":"How quickly we forget! If you over 35, take a walk with me down memory laneyou won believe what you have forgotten. If you under 35, read onI promise you that you will be amazed at what you missed! (By the way, sadly, this isn a joke. I wish it was.) REMEMBER WHEN BILL CLINTON WAS PRESIDENT? (January 20, 1993 to January 20, 2001two terms) When Bill Clinton was president, he allowed Hillary to assume authority over an attempt to reform health care. Her proposed plan was so bad that many Democrats came up with competing plans of their own in protest, and in spite of threats and intimidation, on September 26, 1994, the bill was declared dead. This fiasco cost the American taxpayers about $13 million for studies, promotion, and other efforts. Then, President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were ...","post_message":"The Donald J. Trump campaign issued a statement denying all the allegations, saying the reports were politically motivated."},{"comment_id":"1547661255293998","commenter_b":"Bitch you out your rabbit ass mind","commenter_a":"Coo coo!!!!! One flew over the coo coo's nest, and there she is!!!!","post_message":"The classics NEVER cease to amaze..."},{"comment_id":"10158146730430354","commenter_b":"@username pay up bitch @webpagelink","commenter_a":"No way. Not a sanctuary city.","post_message":"***BREAKING***"},{"comment_id":"1787231111544405","commenter_b":"She was sucking the hell out that dick! Stephanie Nicole Goad lmfao","commenter_a":"Macie Knisley @username lol ummmm #Merica lol","post_message":"This Veterans Day party gives free tattoos, haircuts and blowjobs to veterans..."},{"comment_id":"10152886547876051","commenter_b":"Yep, every woman carries black tape in their purse. What they need is to carry.","commenter_a":"A piece of black tape and the whole situation could have been avoided.","post_message":"This woman was putting her shirt back on in the Target dressing room when she suddenly noticed something glowing."}]
