[{"comment_id":"1325783830806579","commenter_b":"Yeah, you're a whore","commenter_a":"Look at all of the money hungry gold digging hussies in the comment section. ☝️️ @username","post_message":"If you've got some extra money to burn..."},{"comment_id":"10152769527894877","commenter_b":"No. Ladies came up short they guys didn't end up in the board room. Lamas was dead weight though.","commenter_a":"I thought the female team won their challenge. Why did she get fired and not lamas?","post_message":"Keisha Knight Pulliam Fired From 'The Apprentice' For Not Calling Bill Cosby And Asking Him For Money. Watch it and read more here. Grio fam, was this at all fair? Sound off."},{"comment_id":"10153798319264087","commenter_b":"fuck you. she didn't do shit when people called for help in libya. she sucks-and she hassled girls bill raped","commenter_a":"he cares about Americans. I always vote democrat, but not any more. i will vote for Bernie in june-but he don't have a chance-ill vote for Trump against that lying bitch","post_message":"“What I’m going to do is I want to focus on 15 or so states because we have to win, and I want my energy to be put in the states where it could go either way,\" Donald J. Trump said. \"And we’re going to play heavy, as an example, in California. No other Republican would, they wouldn’t even go to dinner in California. They wouldn’t do it.”"},{"comment_id":"1068079936600104","commenter_b":"Most Mexicans ARE Indians....there for they are home.....my people the INDIANS OWN THIS LAND!","commenter_a":"Dems are the ones dividing the nation by spewing their judgement and hate on all those that don't agree with their views.","post_message":"WATCH: Donald J. Trump hosts campaign rally at the Fox Theatre in Atlanta. @webpagelink"},{"comment_id":"1398558810203863","commenter_b":"Stay off facebook lady.","commenter_a":"I'm not a hater, and love fashion, but, this dress is absolutely unprofessional! Why would she do something like this...makes a person wonder!!!","post_message":"'She looks like she's working for an escort agency!'"},{"comment_id":"1323967450977057","commenter_b":"Golden showers for a golden girl!!!! LOL!","commenter_a":"He's gonna cry.........all the way to the Whitehouse!!!! LOL!","post_message":"Trump has never looked so pathetic."},{"comment_id":"1154241914613147","commenter_b":"Maybe that dickwad should of been aborted.","commenter_a":"The faux outrage is big with this one. Who gives a crap.","post_message":"“How the hell do you think this joke is OK?”"}]
