[{"comment_id":"512998138876699","commenter_b":"We certainly need to close our borders, so these warmongering murdering Isis people don't creep in, for that is what they plan to do. We need to do that immediately! The infiltration of this violence is not needed here.","commenter_a":"We need to stand united with the world on this issue of terrorism. We are not doing enough and hundreds of thousands have died already.","post_message":"To the people of France, we stand united with you and all of France is on our hearts and in our prayers. If history has taught us anything, it proves we must remain vigilant against such cowardly, terrorist attacks. America can lead, and we have the strength to do so, but currently lack the leadership. My hope is that our national leaders grasp why so many Americans, including myself, want the Border secured so that we not only deal with the issue of illegal immigration but we also ensure terrorists do not cross our border to do us harm. Never has the old adage been more true: The World is safer when America is Strong: Our People know it, Our Allies know it, and most importantly, Our Enemies know it."},{"comment_id":"540506192811626","commenter_b":"@username , the woman who owns the tummy.","commenter_a":"Yes! Absolutely! Women have the right to decide what's in their own best interest. Who does this man think he is to tell any woman what she can and cannot do with her body?","post_message":"“We should let women make their own decisions.” —Tim Kaine"},{"comment_id":"1818799778404105","commenter_b":"It is time for a woman president peeps..........this is not the woman.","commenter_a":"She may have one the debate, but America lost in this Presidential election","post_message":"Join Hillary live in North Carolina for her first rally since winning last night's debate → IWillVote.com"},{"comment_id":"1107371389322608","commenter_b":"The bloke with the pube beard is better looking then mwah? Ok STEVIE WONDER","commenter_a":"Looks like he's put glue on his face and rolled around a barbers floor","post_message":"Hug-me-Muslim ‘threatened to bomb MPs house"},{"comment_id":"10153051967106130","commenter_b":"Aqua man? Bitch please.","commenter_a":"\"Do you have a minute to hear about our lord and savior Jesus Christ?\"","post_message":"YIKES."},{"comment_id":"1279039008785553","commenter_b":"Video by a feminist probably...","commenter_a":"Wait a second. You're mad because 20 people, out of 320 people, dropped out of the study.... so 6%.... and because 6% couldn't handle it..... you reach the conclusion that obiously men can't handle birth control.... isn't that a sexist statement against men? Not to mention I'm sure more than 6% of women don't take birth control because of side effects. Let's just think before we generalize a group.","post_message":"Male birth control is here, but men won't take it because they can't handle the same side-effect of female birth control that women have been dealing with since the 1960s."},{"comment_id":"10153625105923128","commenter_b":"Stop bring toilet in every issue","commenter_a":"India should stop releasing Indian Movies in Pakistan long ago ..i don't knw why still they didn't do that","post_message":"Here's why an alleged Pakistani terror group wants a ban on an Indian movie."}]
