[{"comment_id":"1421191604574730","commenter_b":"Go to hell","commenter_a":"He's perfect for the job and he's american","post_message":"EXPLOSIVE! CNN Columnist Says Michael Phelps Should Not Have Been The Team USA Flag Bearer Purely Because He is WHITE! Liberals are going CRAZY, injecting skin color and religion into the the olympics!   Lets GET 5,000 SHARES For Phelps! He's White and a BADASS! So what!"},{"comment_id":"10152601716778837","commenter_b":"Stupid a$$ b**ch...","commenter_a":"Another arrest, more jail. He's a bully and is still playing god. It's just a matter of time before he kills again..","post_message":"BREAKING -- George Zimmerman arrested in Florida @webpagelink"},{"comment_id":"10153672286196336","commenter_b":"Round em up and send them back to where they come from all illegals","commenter_a":"we are fed up with you're racist personality and we are fed up with you're disrespecting toward women","post_message":"\"People are fed up. They're fed up with incompetence and they're fed up with stupidity.\"  This morning, Donald J. Trump called in to \"FOX & Friends Weekend,\" and shared his take on the national mood and the Iran deal."},{"comment_id":"472031482987432","commenter_b":"If this is the way she believes then she should go to a country that believes in that kind of stupidity. Piss on the rag heads","commenter_a":"Yes the officer was right, keep up the good work.","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"10153285964496749","commenter_b":"White Americans are sexy","commenter_a":":P","post_message":"Add your name if you support the Clean Power Plan—the biggest step America has ever taken in the fight against climate change. @webpagelink"},{"comment_id":"10153939704691178","commenter_b":"With this huge influx of illegals and radicals the REAL AMERICANS are in danger of extinction , wise up Hollywood!","commenter_a":"Must have fallen fron his star ship and landed on his head.","post_message":"Kind of hypocritical coming from a guy who owns tons of planes."},{"comment_id":"558362490993134","commenter_b":"Why is it we are so intent to run our country into the ground?? Follow Trump, and mark my words, there will be a WWIII, and everyone will be pointing their guns here. We will have no allies as he will insult them all. Wake up, America.","commenter_a":"\"I will not forget.\" What in the hell do that suppose to mean?","post_message":"Do you agree with Donald J. Trump's tweet?"}]
