[{"comment_id":"10153829751724060","commenter_b":"Well. The Christians have overcome Crusades. Try yourself to see the present and stop to be a stupid moron","commenter_a":"You mean Islam was used as a vehicle of war?","post_message":"In 2015 religion was used as a vehicle of war. My God versus your God"},{"comment_id":"1548781162079004","commenter_b":"Found the stupid feminist.","commenter_a":"if U want to End ALL Abortions, eliminate the NEED for abortions!! STOP RAPE First!!!","post_message":"Flip the Script is back!  We asked pro-lifers why they think abortion is murder  and then they sorta threatened to kill us."},{"comment_id":"10158211660050725","commenter_b":"Ignorance= a basic understanding in economics.","commenter_a":"All the crying liberals on this feed is enough to make me skip my coffee and still be content at work today.","post_message":"President-elect Donald Trump is poised to take his victory lap today, appearing first in Indiana to salute workers at a factory that he made a campaign promise to save and then in Ohio on the first stop of a \"Thank You Tour\" to honor the supporters in states that gave him his stunning victory."},{"comment_id":"10153250256602439","commenter_b":"All female firing squad","commenter_a":"His last meal should be bacon. Pour pig's blood all over his body before firing squad. Don't forget to soak those bullets in pig's blood.","post_message":"Death penalty is too good for this savage. Boston (CNN)[Breaking news update, posted at 2:32 p.m. ET] Jurors in the Boston Marathon bombing trial have found Dzhokhar Tsarnaev guilty of all 17 counts that carry a possible penalty of death. The jury …"},{"comment_id":"10153096842961748","commenter_b":"The only thing that is happening is Bigots are being exposed, and shown for what they are!","commenter_a":"As ALWAYS - it is just the opposite! Conservatives are attacking the laws that protect EVERYONE, including themselves, from discrimination. Gays are challenging those attacks in order to preserve and PROTECT freedom. Only backwoods IDIOTS would not understand that.","post_message":"Gay people are lighting America on fire! According to a new anti-gay \"documentary,\" anyone who owns a business or holds public office is under attack."},{"comment_id":"984298984944293","commenter_b":"👏👏👏👏","commenter_a":"For those of you patiently waiting on a squirrel update: According to Jeremy \"*UPDATE * the two suspect squirrels have moved into an older squirrel nest in the garden district of the property and decorated the heck out of it. They are eating higher quality squirrel food and are in much better health than the heterosexual squirrels.\"","post_message":"When marriage equality became legal in his state, this man bravely reported from the frontlines of his backyard to see *exactly* what had changed. And it's hilarious."},{"comment_id":"10154010252346350","commenter_b":"The kid didn't make a mistake. If she was driving drunk then she committed a crime. Having someone plow into your home is not only traumatic at the time of the event, but then there are all of the repairs to deal with. It can take months to get it all put back together. And insurance doesn't cover all of the costs. Guess who gets to pick that up. Not the kid. She wasn't over reacting. If anything, she was quite conservative. I would have gladly beat the stuffing out of the one that hit us.","commenter_a":"I'm probably the only one who is think Kim... Is.. Well... Being a little actress like in all these tweets. We get it. The kid made a mistake. One that could of been fatal. One tweet is probably good enough (if at all) but like 4? Get a grip Kim. Ridiculous.","post_message":"\"This young girl could have killed herself, her friends, and me. Frightening.\""}]
