[{"comment_id":"948931958516352","commenter_b":"Somebody exterminate these animals !!!","commenter_a":"Just run their fat black asses over because black lives do not matter - at least not to black people so why should I give a flyin' fuk about 'em.","post_message":"Merry Christmas from Hillary, Barack, and Black Lives Matter!"},{"comment_id":"10153188794046680","commenter_b":"And @username get that male organ out of your mouth.","commenter_a":"@username just how would have more gun control laws have prevented this last shooting? California has already the most stringent gun control laws on the books.","post_message":"A day after the shooting massacre in California, Republican presidential contenders were utterly unapologetic about their opposition to new gun-control laws."},{"comment_id":"1721734318116068","commenter_b":"Ean hahaha","commenter_a":"Daniel Howe","post_message":""},{"comment_id":"10154927875454174","commenter_b":"Build that wall","commenter_a":"Protesters now these days are who are dividing the races","post_message":"Protests are happening in cities across the U.S. once again while President Trump is reacting to the judicial order stopping his policy @webpagelink"},{"comment_id":"1787645241556279","commenter_b":"They look beautiful, professional and feminine. Certainly classy women.","commenter_a":"These are first class ladies No attitude","post_message":"There's great symbolism in Melania Trump and Ivanka Trump's inauguration style."},{"comment_id":"10153092888622507","commenter_b":"I like planned parenthood because it will finally rid all the blacks from the US","commenter_a":"Woman, can you say Obama care? You dems rammed it down my throat saying it would take care of all medical needs. Aren't women part of this? Why should I help pay for obamacare and planned parent hood too!","post_message":"Watch Senator Elizabeth Warren crush it on the Senate floor during the debate to defund Planned Parenthood: “Did you fall down, hit your head and think you woke up in the 1950s or the 1890s? Should we call for a doctor?”"},{"comment_id":"10153659682115399","commenter_b":"Really? In what way could Trump have forestalled the Syrian refugee crisis?","commenter_a":"If Trump would have been in charge before this, these horrendous wars and humanitarian crisis may not be going on. It appears that Obama is way out of his league. #trumpforpresident","post_message":"Reminder: More than 100 people were killed and more than 350 injured in the coordinated terror attacks."}]
