[{"comment_id":"10153698259961320","commenter_b":"She's the devil in disguise.","commenter_a":"She doesn't have to worry about any boyfriend and hopefully for a long time!","post_message":"What a horrible human being.  Authorities have released text messages that allegedly detail how 18-year-old Michelle Carter texted her boyfriend, Conrad Roy III encouraging him to commit suicide. Read what she said: @webpagelink"},{"comment_id":"572406196218003","commenter_b":"@username bigotry people?!? First learn to compose a literate sentence, then read your comic book.","commenter_a":"Unfortunately, anti-gay bigots never seem to go away since we're still dealing with them 40 years later. When will we, as a people, learn to stop hating people who are different than us?","post_message":"TV's \"All in the Family\" was way ahead of its time.   Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"515543338636246","commenter_b":"Go home","commenter_a":"Absolutely...","post_message":"These Muslims thought they could do this, big mistake.  Good. This is America, they need to learn their place.  Do you support these Muslims being thrown out of the building?"},{"comment_id":"2053445024754213","commenter_b":"Just the opposite he carry a 3.95 GPA and has all he life. he Just married that MUSLIM pile of pig shit and was told by Obama you need to rebel.","commenter_a":"He probably doesn't know how to read or write.","post_message":""},{"comment_id":"10153512925208854","commenter_b":"They can take the next boat, plane, or train out of my country!!","commenter_a":"All those who sign this petition should be banned from the USA forever","post_message":"U.S. Citizens Sign Petition to Ban American Flag"},{"comment_id":"10155111456982178","commenter_b":"True, she just lies about everything to get votes. If she wins the WH we are all in trouble. ObamaCare will continue! Taxes will rise! Food prices will rise! More people will be out of work! Education will decline!","commenter_a":"Trump: Make America Hate Again!","post_message":"NEW POLL: Donald Trump is wildly unpopular among young adults, in particular young people of color, and nearly two-thirds of Americans between the ages of 18 and 30 believe the presumptive Republican nominee is racist. wral.com/@username"},{"comment_id":"10156702895000354","commenter_b":"Yeah, poor Oprah. She probably is forced to shop at second hand stores.","commenter_a":"Black women have black privilege","post_message":"Guess how many millions of dollars actress 25-year-old Jennifer Lawrence made in 2015...  *Hint: it's more than you will make in a lifetime--by FAR"}]
