[{"comment_id":"760324150750635","commenter_b":"You sons a bitches!! Lmao","commenter_a":"Thanks a lot sister that was my favorite soda!! Gross! Jessica LeAnn Miko","post_message":"Disturbing Thing A Man Says He Found Inside A Freshly Opened Pepsi Can"},{"comment_id":"1076375005794438","commenter_b":"I bet you are one of those that says it was just \"locker room talk\" when Trump spoke of grabbing a woman's pussy, aren't you? \"Hey, boys will be boys\"","commenter_a":"The flight attendant was not harassed, intimidated or any other federally worded names that aren't allowed. She made a mountain out of a molehill. Very irritating.","post_message":"Alaska Airlines confirmed that a different passenger's Facebook post detailing the incident on Flight 520 was accurate."},{"comment_id":"10153115245746162","commenter_b":"What a pig!","commenter_a":"Unbelievable!!!!!!!!","post_message":"30-year-old Matthew Warner is charged with sexually abusing and killing his 19-day-old daughter.  How he almost got away with it @webpagelink"},{"comment_id":"10153148690502014","commenter_b":"I remote control my grandson to clean my auto engine. He's for hire. Lol. .","commenter_a":"Good morning from Flagstaff!","post_message":"It's Sunday Shoutout time! Post your pics here!! Jaime Cerreta"},{"comment_id":"846208402083168","commenter_b":"Sounds like she has her head screwed on pretty straight !","commenter_a":"Amazing !!i am actually so happy for this girl... Finally, someone who I think really deserves and will truely appreciate what has just happened to her...","post_message":"\"I’m just grateful for this moment.\""},{"comment_id":"10154586781928598","commenter_b":"Good for them, proud of you both, goes to show you how much they really respect themselves","commenter_a":"Blessings for your marriage!!","post_message":"#6 most-read LifeNews story of 2016: After Abstaining Until Marriage, NFL Star Russell Wilson and Ciara Get Married: “We Did It Jesus’ Way”"},{"comment_id":"10154105863319087","commenter_b":"Anyone who has an education voted for Bernie, because they know that Hillary is a liar and a right-leaning moderate. #BernieOrBust","commenter_a":"Clinton also leads with people who have educations. Gee, go figure","post_message":"Donald Trump may be rich, but the rich actually prefer Hillary Clinton."}]
