[{"comment_id":"1255087781177916","commenter_b":"Get on your knees and suck my big fat hillbilly cock. Lol ....","commenter_a":"Republicans deserve a President Cruz who gets his condoms from dive bar bathroom dispensers.","post_message":"It's not who the party's establishment thinks."},{"comment_id":"1236473219748126","commenter_b":"The police did what they needed to do. Woman was out of control","commenter_a":"Yes. NOT because of race, NOT because she is a woman, because she is resisting arrest. Have your day in court and don't try to get your justice in the street. It's just that simple.","post_message":"This Black Lives Thug Chick Gets Her FACE SLAMMED Into the Concrete... But after watching the video did she deserve it? We say yes! You decide! (VIDEO)"},{"comment_id":"1201354526579759","commenter_b":"Can't turn a hoe into a housewife should of known that!!! Smh Anyway in other news?","commenter_a":"When the goin gets tough the fake show true colors","post_message":"\"She's felt trapped for a while... She doesn't want to stay married.\""},{"comment_id":"1142584762463568","commenter_b":"President not dictator","commenter_a":"Donald Trump nuclear war","post_message":"Indiana governor and Republican vice presidential nominee Mike Pence spoke at a rally at the Space Coast Convention Center in Cocoa, Florida."},{"comment_id":"10154173460986051","commenter_b":"What a bitch and that's why I hate all cops in Los Angeles county","commenter_a":"I hope the lawyer does right and gives the kids family money instead and locks up women and her husband and who ever else was involved because the cops at the scene should of did breathalyzer it's the law when they're a wreck to make sure alcohol or drugs is a factor poor family's who have to Deal with this and prayers the kids family's win big","post_message":"This woman was driving home from a bar when she smashed into three kids. Now she's suing them. Guess what her husband does for a living."},{"comment_id":"1538272953143656","commenter_b":"Benjamin Edward I do!!! I like this takes place in Brooklyn too!","commenter_a":"Benjamin Edward","post_message":"Mark Ruffalo and Bernie took a walk through the Brooklyn, New York school yards where Bernie grew up, and talked about his childhood, why he got involved in the Civil Rights Movement and how those experiences translated into his life in politics and this movement. (Directed by Matthew Cooke)"},{"comment_id":"1011635065552183","commenter_b":"Are you surprised by this woman's corruption? She should be in jail with the other corrupt politicians. Wonder what she'd look like if she didn't have access to plastic surgery for a couple of years.","commenter_a":"this woman should be took out and shot for all the corrupt things she has done ,, and throw in her friend Dirty Harry Reid also ...","post_message":"Here's Nancy Pelosi real \"war on women\""}]
