[{"comment_id":"1687154254839815","commenter_b":"To spy over the Congress and international leaders is a serious matter and the Congress should really act immediately to resolve it !","commenter_a":"Try him for his CRIMES!!","post_message":"Obama used the NSA to SPY on members of Congress to ram through his unpopular and disastrous Iran nuclear deal.   What do you want your Congress to do in response?"},{"comment_id":"1532142173492916","commenter_b":"Oh we will because we need to stay united and fight. I mean go out there and protest, boycott Trump businesses, follow advice of people like Michael Moore, Bernie Sanders, Keith Olberman. I am saving my money and will travel to places where protests will be visible and impactful. Also, we have to find a way to help each other. Si se puede.","commenter_a":"2018 is just around the corner. We will clean house and send republicans packing!","post_message":"Conservatives will do anything to win what they perceive as the \"culture war.\""},{"comment_id":"10153933492904411","commenter_b":"lol it makes no fucking difference you whiny bitch","commenter_a":"Miss Universe pageant is all politics.... the Elites crown whichever country they wanna make use of. In this case, the Phillippines in the South China Sea issue. Whereas Colombia is drawing closer to China this year, this is just humiliating Colombia in public.","post_message":"Oops: Steve Harvey crowns wrong #MissUniverse2015"},{"comment_id":"10157460185340725","commenter_b":"Awesome speech in The Motor City, Mr. Trump. Inspiring, uplifting. Gave me goosebumps!","commenter_a":"CHINA = GARBAGE","post_message":"My trade reform means STRONG protection against currency manipulation."},{"comment_id":"1159441540761968","commenter_b":"Vote for Trump, he is the only one that will build the wall!!!!!!","commenter_a":"WTH?? Since when has this become acceptable? Build the Frigin wall!","post_message":"ILLEGALS.... ILLEGALS... ILLEGALS... They are terrorists.  @webpagelink"},{"comment_id":"10152605770366680","commenter_b":"She certainly has enough raging male testosterone !!!!","commenter_a":"She is totally useless and has done absolutely nothing of benefit to the Democratic Party.","post_message":"Running for Senate might be an elegant solution for a woman with no other way to advance her career."},{"comment_id":"605402049616235","commenter_b":"@username AMEN! She's just a stupid troll!!!","commenter_a":"He was probably drunk while being on the snowmobile. It will take more than duct tape to shut his wife's mouth.","post_message":"\"Knowing Todd, once he's cognizant, he'll probably ask docs to duct tape him up and he'll call it good. He's tough,\" Sarah Palin said."}]
