[{"comment_id":"1308930149151726","commenter_b":"Smug asshole !","commenter_a":"and why is anyone voting for this self centered fool ....","post_message":"His response is simply \"deplorable.\""},{"comment_id":"1762539284023573","commenter_b":"Adrian Chapman, Anyone that thinks trump is a racist has their head up their ass. Do you even know what the definition of racism is? Illegal immigrants are not a race. Stopping the flow of terrorism from Muslim dominate countries is a precaution to stop terrorism. Not all Muslims are terrorist but terrorist come from Muslim nations. Common sense not racism.","commenter_a":"How many TRUMP SUPPORTERS do you see on national news blocking highways, trying to stop other candidate's supporters legal right to rally.","post_message":"15-year-old groped and pepper sprayed at Trump rally"},{"comment_id":"987322251337818","commenter_b":"They should be incarcerated. It's just that women who have legal abortions aren't murderers. And NO member of congress should make my reproductive choices for me.","commenter_a":"If you believe in murder, I guess it would be ok for you","post_message":"Yes! It's time to #abortthestigma"},{"comment_id":"533434026816552","commenter_b":"is that how YOU got in?? god dam roach.....","commenter_a":"Displaced... Bullshit . they are like Roach's spreading themselves out to bring their evil to more places","post_message":"\"Never has there been a greater need for tolerance, compassion and solidarity with people who have lost everything.\""},{"comment_id":"10154204294889778","commenter_b":"Then let her pay for it","commenter_a":"They need to get over it! Rename something of their own! Confederates were a part of history too! If this is the case, let's change every building's name that offends every confederate soldier's family too!!! I Have Had Enough of this - so crazy & ridiculous!!!","post_message":"Actress Julianne Moore and Hollywood producer Bruce Cohen want a new name for their old high school in Virginia, named for a Confederate general."},{"comment_id":"10152737954746051","commenter_b":"She should never have bred!","commenter_a":"It's too bad the parents cannot( will not) just pay the fee and get over it.","post_message":"The woman who invoiced a 5-year-old for missing her child’s birthday party has a message for all the haters."},{"comment_id":"599536596905185","commenter_b":"I want them to be deported and go back where they came from.","commenter_a":"I am absolutely shocked that a welfare state would attract welfare-minded reprobates who expect to receive cradle-to-grave welfare benefits, and then throw violent temper tantrums when they don't get what they think they're entitled to! Where in the world did these guys get such an idea? Oh yeah, after hearing the Marxist's constant demands for cradle-to-grave welfare benefits all of their lives.","post_message":"New post (Sweden: Muslim migrants enraged over not being given \"own house\") has been published on Jihad Watch"}]
