[{"comment_id":"10153209825548445","commenter_b":"Not if you make the tincture right","commenter_a":"Don't make edibles at all. If you want an edible high, just buy/make tincture and eat it with cookies. Or just eat the weed in fillable capsules: 1. Decarboxylate your Dry herb 2. Fill swallable capsules with dry herb 3. swallow capsules with food and drink","post_message":"10 Commandments of #Marijuana Edible Safety"},{"comment_id":"1129299917126536","commenter_b":"Hillary is the real war on women.","commenter_a":"Together we Move Forwards Vote to President @username 2016.","post_message":"In ten years, we can generate enough renewable energy to power every home in America. #EarthDay"},{"comment_id":"10153195780106130","commenter_b":"I'd give her an orgasm!","commenter_a":"Who's the asshole out there denying women orgasms??? Selfish prick!","post_message":"'Don’t not have an orgasm. Make sure he knows that you’re entitled to an orgasm.'"},{"comment_id":"10153727550292300","commenter_b":"Go naked girl! Again and again!","commenter_a":"South beach is super ghetto now.","post_message":"In video taken by witnesses and posted on a website where it went viral, Angelic Valle is completely naked when she “placed a steel chair leg into her buttocks,” according to the police report."},{"comment_id":"10155034427609197","commenter_b":"'@username you need to kno this too, @username n Dayna Bianca Haskins too. Pass the word..","commenter_a":"'@username fyii","post_message":"Could finding something on your car hood mean your safety is at risk? See why one woman's Facebook post is going viral!"},{"comment_id":"1372232146121032","commenter_b":"Chris Schiraldi really? Please tell me your source besides your opinion because that sure as hell isn't fact!!!!","commenter_a":"Yeah thanks for the lowest workforce participation rate in decades. Thanks for creating so many low wage/ low benefit jobs. Thanks for so many on food stamps because the economy sucks. And thanks yahoo for being yahoo... and that isn't much","post_message":"75 straight months of job gains. 15.8 million private sector jobs added since 2010.   Thanks, Barack Obama."},{"comment_id":"1439879839405093","commenter_b":"'@username this the lady I was talking about","commenter_a":"So beautiful I'd do the same without a doubt","post_message":"After her daughter's battle with leukaemia left her unable to carry to full term, Theresa offered to become a surrogate and gave birth to a healthy boy ❤️"}]
