[{"comment_id":"933394380031531","commenter_b":"Good girl tell it like it is","commenter_a":"No one should lose their job for honesty","post_message":"Judge Jeanie Could Lose Her Job After Job After Publicly DESTROYING Obama On Live TV [VIDEO]  She just put everything on the line. Let's show her our support.  Can we get 30,000 'LIKES' for Judge Jeanie?"},{"comment_id":"726552340811280","commenter_b":"this female is an ignorant scumbag","commenter_a":"I guess that means yes....","post_message":"I'm not afraid to say these are FAKE TEARS!"},{"comment_id":"504925023037210","commenter_b":"Geez. Is that OLD gal still around?","commenter_a":"She might find out how Hilter was if Hillary gets elected that your guns take away your health care tax away all your money distribute people money after the rich and powerful take most of it. OH MY GOODNESS THAY COMMUNISTISM","post_message":"According to the great celebrity-turned-philosopher Cher, Trump is now a genocidal murderer..."},{"comment_id":"10153430837822061","commenter_b":"beautiful woman","commenter_a":"Beautiful Robin!","post_message":"Robin Roberts looking stunning this afternoon! She's on her way to the red carpet. #Oscars"},{"comment_id":"1260088087350033","commenter_b":"Do not tell her to shut her mouth! That will change the odds of her getting pregnant from 1 outta 3, to 50-50!!!!!","commenter_a":"Her parenting advise is about as competent as her \"abstinence\" advise. Practice what you preach, or better yet, shut your mouth and fade away to oblivion.","post_message":"Pathetic."},{"comment_id":"10152889795339342","commenter_b":"Thanks to the OTHER hospital! Her hospital didn't even say what Duncan had! They kept it from her!","commenter_a":"Personally, I'd just be happy to be alive.","post_message":"SO CALLED \"EBOLA NURSE\" NINA PHAM PLANS TO SUE: The 26-year-old nurse said that the hospital where she had worked in Dallas and its parent company failed her when she contracted Ebola while caring for the first person in the U.S. diagnosed with the deadly disease."},{"comment_id":"10155578231251509","commenter_b":"Leave then illegal.","commenter_a":"If Trump wins I'm leaving the country. If Hillary wins I'm still leaving the country. This isn't a political comment, I just want to travel.","post_message":"Watch Donald J. Trump supporters in Cincinnati, Ohio, react to the candidate's projected win in that state.  Live election results and coverage: @webpagelink"}]
