[{"comment_id":"10154387812405329","commenter_b":"Pretty ladies :)","commenter_a":"My mom and I get asked if we're sister's whenever we're out","post_message":"Um....................................."},{"comment_id":"10152942942461130","commenter_b":"You'd call them \"girls with their vaginas hanging out, ass showing and everything else.\" Cool ?","commenter_a":"Good. This needed to happen.","post_message":"Um..."},{"comment_id":"537545743072047","commenter_b":"Fuck you you damn racist nut!","commenter_a":"Sounds like she just smoked a fat rock. Good job Vice... Keep throwing the crackheads on the top of my news feed. Not sure what I want more this or cat videos...","post_message":"On the Sea Islands along the coasts of South Carolina and Georgia, a painful chapter of American history is playing out again.  Watch our investigation into why Gullah culture is being replaced by waterfront mansions: @webpagelink"},{"comment_id":"10152910640286770","commenter_b":"Buzz off you jerk!","commenter_a":"Who is this \"Jon Stewart\"? Is he Portuguese?","post_message":"Jon Stewart: \"Donald J. Trump has no control over the projectile vomit of dickishness that comes out of his mouth every time he opens it.\""},{"comment_id":"1395591783831296","commenter_b":"If you are depressed, how do you think I am living at 30 minutes away from Russia? This thing sounds real to me because I see what's happening around Russia. If American people don't do nothing to stop the US government, my country and other countries around Russia will be erased before you people even realize that the war is started. Russians have nukes, we have sticks. My country doesn't have an army, half of Russian citizens are soldiers. So while America is still thinking if the news is real or fake, we think why our governments made an alliance with USA and allowed them to build anti-rocket shields and military bases on our territory, making us look like a threat to the Russians when we are not. Here we hate wars and guns. People here don't have guns, we don't go to wars. We don't want this s***. But ...","commenter_a":"always liked the mind unleashed but u get a ton of ppl on here saying u r blowing things out of proportion.. i for one as a parent dont appreciate being scared shitless.. surely u r just feeding the monsters propaganda?.. (the same fear that made ppl think they had to turn to the likes of trump!?..) yep in a ideal world the scum/politicians of the world would do whats best for everyone not just theyr own greedy vile selves but that aint gonna happen with any of the muppets in power right now.. dont u think the world is scarey enough already when someTHING like trump can get into such an important position of power!?? a pathetic joke of a man nobody in a rational mind would ever dream of looking up to! (minus the fear that is).. if this is just sensationalist headlining then give it a rest! ...","post_message":"Time to start paying attention."},{"comment_id":"10153992150958854","commenter_b":"Who's next to meet Satan their Allah. Satan's impatient, don't keep the Virgin hags waiting.","commenter_a":"no more little asshole","post_message":""},{"comment_id":"10153485432146323","commenter_b":"I'm coming niggas!","commenter_a":"@username this was the place I was talking about when we were talking about the travelling think","post_message":"Surfer Mick Fanning makes a lucky escape after being attacked by a shark during the final of the J-Bay surfing competition in South Africa on Sunday. Full story: @webpagelink"}]
