[{"comment_id":"10157992746740594","commenter_b":"@username if I'm going to make my mother get up in the middle of the night and travel four states to feed me she better be bringing more than a hot pocket.","commenter_a":"This is great, this is just what you liberal snowflakes need to cope with reality. It's nice that Google is providing portable \"safe-spaces\" for tomorrow's Captains of State Dependency.","post_message":"Turn photos of Donald Trump into adorable kittens with this Chrome extension."},{"comment_id":"10153338669186323","commenter_b":"^That hyperbolic Feminazi your mother warned you about","commenter_a":"Yeah! It's Natalie PortMAN not Natalie PortWOMAN","post_message":"“It’s a very female thing of being afraid to say: ‘I’m the boss, and this is how I want it.’”"},{"comment_id":"1786910708245530","commenter_b":"She is a liar !!","commenter_a":"Imagine a Trump led America With a vision to make us great, Builder, businessman, father, With a leader, fighter trait. Imagine factories buzzing, Oil flowing out of the ground, Coal miners packing their lunches, People talking about jobs they've found. Soldiers, sailors, airmen, marines, Showered with Presidential Pride, Strong and able to keep us safe, Respected and feared worldwide. Imagine a really, really big wall, With a big, beautiful door, Swings one way to put out the bad, The other to let in the good. ISIS not even a JV team, Russian Bear back in its cage, Iran decided to take a new deal, Israel safe from all rage. Imagine a man of integrity, A man the world will respect, A man who will fill the office With all the honor we expect. Imagine a Trump led America With a vision to make us Great, Imagine a Trump led America ...","post_message":"FACT-CHECK:"},{"comment_id":"10153432982041262","commenter_b":"Haha. That was sarcasm.","commenter_a":"Every month is Teacher appreciation week, they only work about 6 months out of the year and get paid for a full year.","post_message":"Tag a teacher that has made a difference in your life."},{"comment_id":"1197376426946372","commenter_b":"Closed minds are amazing to watch!","commenter_a":"Derogatory terms are part of their playbook. I'd repost this but for that in the title.","post_message":""},{"comment_id":"1039629819427046","commenter_b":"Americans could get jobs if they'd get off their fat asses and go to school. All these uneducated Trailer Trash need to go back and graduate 3rd grade.","commenter_a":"We have Americans that are finding it hard to find work because of the flooding of all the refugees just think that will be 50000 more Americans that won't be getting a job because they will","post_message":"BREAKING: Two Iraqi refugees in the U.S. were arrested on Thursday for supporting terrorist groups in the Middle East. The FBI Director has repeatedly said that the U.S. does not have the ability to thoroughly screen refugees for terrorist ties."},{"comment_id":"1618315388221218","commenter_b":"Disgusting. The trolls perpatrating this clearly have issues with yor mammas.","commenter_a":"I sure hope so","post_message":"She's got to be scared..."}]
