[{"comment_id":"718993818288909","commenter_b":"They're here illegally they don't get rights moron!","commenter_a":"No one is saying we cant police our borders...but we must do so with Constitutionally appropriate actions. After all isnt it our CONSTITUTION that we are protecting, that we are asking out service member to protect with their lives. It makes no sense to me that we are willing to throw out the very basis of our great country because we are so fearful. We must be strong and remember our core values.","post_message":"Trump is keeping his promise! I don’t care how much liberals scream and protest… A NATION HAS A RIGHT TO POLICE ITS BORDERS, ESPECIALLY FROM VIOLENT CRIMINALS!   LET'S get 10,000 SHARES for our President! No Judge Can STOP His plans To Make America GREAT AGAIN!"},{"comment_id":"10153781629863132","commenter_b":"stupid girl","commenter_a":"I feel so sad for Anna and their four little M's","post_message":"Anna Duggar will likely not be leaving her husband Josh despite his admitted infidelity."},{"comment_id":"967437919978383","commenter_b":"Bruce, you're just doing way to much now....you've had your 'fun' trying to outdue the Tupperware Girls and all, but this is enough now","commenter_a":"Ratings dropped.","post_message":"In one tweet, it seems Caitlyn Jenner's political support may have shifted."},{"comment_id":"1616592381975838","commenter_b":"THAT WOULD BE YOU SUCKER","commenter_a":"Anytime a socialist, communist and the far-left is aware of someone who can reshape our country to what it once was, scares the hell out of them and will say things like the above. Sanders statement, viewpoints make no sense at all and fail miserably in the arena of logic.","post_message":"Sanders says Trump is \"a pathological liar who changes his mind every single day.\" Agree or disagree?"},{"comment_id":"10152982959796130","commenter_b":"AMEN!","commenter_a":"Every member of Congress should do the same","post_message":"The #FoodBankNYCChallenge is meant to raise awareness about hunger and the struggle to live on such a limited budget."},{"comment_id":"871266669599749","commenter_b":"Liars lie","commenter_a":"It's odd how no one in the comments section mentions the fact he was beaten over and over again. Good one, anglosaxon humanity!","post_message":"'We're gonna teach you about great American sex'"},{"comment_id":"10152857531566491","commenter_b":"Dustin I spelled behaviour perfectly fine. Only AMERICANS spell it your way. And that's not saying much","commenter_a":"WHAT?! maybe influencing spoiled, childlike behaviour!","post_message":"Kanye West is on TIME's list of the world's most influential people #TIME100 @webpagelink"}]
