[{"comment_id":"10154492654832690","commenter_b":"@username Your belief in polls probably left you disappointed on November 8th didn't it? SMH","commenter_a":"Who actually goes to an inauguration? Ask how many people are happy Obama will no longer have any control. Your poll will be more meaningful.","post_message":"Are you going to President Trump's inauguration?"},{"comment_id":"927870117281087","commenter_b":"How many illegitame grandkids does it take to keep her quiet","commenter_a":"I'm with you Sarah","post_message":"Sarah Palin goes off on Obama to his face. What a woman. Let's show her our support. Can we get 10,000 'LIKES' for Sarah Palin's stand against Obama?"},{"comment_id":"10153252921156833","commenter_b":"Good for the homeowner! Its time these THUGS learn that our homes ARE NOT THEIR PROPERTY AND THEY CAN'T ENTER WITHOUT OUR PERMISSION.","commenter_a":"Love this...","post_message":"An Albuquerque Police spokesperson says that a homeowner awoke to noise in his house and grabbed a firearm, thinking there was possibly an intruder. The homeowner checked the house and found a man, identified as 28-year-old Robert Bartley, crouching in his kitchen holding what the man said \"appeared to be knife.\" According to police, Bartley approached the homeowner saying he was going to kill him."},{"comment_id":"10153978466591002","commenter_b":"These are Outlaw Motorcycle Gangs..not Motorcycle Clubs..Outlaw Gangs are nothing but Thugs","commenter_a":"I am in the minority here, but I feel safer with motorcycle clubs than I would anyone else. I would not turn away of I walked into a place of business and seen club memebrs in the same place. They don't just go out and rob and kill people because they want to. You can't compare existing clubs to SAMCRo from Sons of Anarchy. This is a TV show. Hell, we should have the clubs patrol the streets. Think about that one!","post_message":"After the Waco shootout this weekend, outlaw motorcycle gangs are again in the spotlight. Roger Weber takes a look at local biker gangs: @webpagelink"},{"comment_id":"1930654800491749","commenter_b":"Those idiots need to be kicked out of our country, not immigrants","commenter_a":"What a creepy group of corruption.","post_message":"That was quick –> Most national security advisors spend more than two and a half years in the job. Mike Flynn topped out at 24 days before resigning last night. President Donald Trump and Vice President Mike Pence claim they did not understand that Flynn was regularly in contact with Russian officials, including on the day Barack Obama imposed sanctions on Russia for interfering with the US election. That relationship could become the subject of investigation in Congress — at least one Republican, Marco Rubio, wants more information and has suggested combining it with a broader investigation into Russian meddling. To echo a Watergate-era inquiry from the late Sen. Howard Baker, “What did the president know and when did he know it?”"},{"comment_id":"933293890039082","commenter_b":"And any criminal will just turn in their guns! Like they do in Chicago and California!","commenter_a":"Clinton is so clueless!! This isn't about gun control bitch. This is about Obama allowing Muslims to come here knowing the repercussion of this. They were making IED'S in their garage you stupid fuck Clinton. Better start putting a ban on IED'S. Now all these Syrians Obama? Your the terrorist and the democrats are all equally guilty for putting you in and backing you. Come get my guns. You will get them no problem there but you won't be walking away. Black lives matter and Muslims are all terrorist.","post_message":"Wasting no time..."},{"comment_id":"1229225200430841","commenter_b":"I do agree though a little white girl wouldn't have been thrown to the ground...","commenter_a":"While the student was wrong in her choices to be disruptive, disrespectful, ignorant and arrogant. The officer also was wrong in the amount of force that he exuded on a MINOR. Regardless of the ignorance and attitude shown by this student. I worked in a school and have 6 children of my own. Some children nowadays are extremely difficult to manage and teach. I agree. My own children know better than to even entertain the thought of being disrespectful, they know their behavior has consequences. Not all children are raised in that type of loving environment. That is NO excuse for this child acting like a spoiled brat with a chip on her shoulder who obviously has authority issues. That being said, back to the police officer who felt the need to use his authority and man handle a child. Simply because you're annoyed and irritated that a child defies ...","post_message":"This video taken from inside a South Carolina high school classroom on Monday shows a police officer body slamming a female student and dragging her across a classroom. The chorus of parties angry over the confrontation continues to grow, as the sheriff's department investigates. @webpagelink"}]
