[{"comment_id":"719584654846906","commenter_b":"LOL, OH LET HER, SHE'S THE CRIMINAL, DO YOU LIVE UNDER A ROCK?","commenter_a":"Con-man-Don, \"The Conald\", just a Common Carpet Bagger wanting to benefit from the ruin he would inflict on America. @username needs to call him to the carpet and allow the Criminal Justice system have their way with him.","post_message":"Donald Trump has painted a dark, divisive picture of America. We have 102 days to stop him from becoming president."},{"comment_id":"10154578752917501","commenter_b":"How many actually paid attention and noticed that I was questioning the doctors- NOT THE WOMEN!!!","commenter_a":"I am ever in awe at the things they do at the Clinic. However, I have to wonder at the ethics. Performing a surgery that has major repercussions for the woman involved (anti-rejection meds, etc...) just so she can undergo pregnancy- which has its own set of dangers - seems ethically sketchy. There are so many unwanted children who need homes. Adopt.","post_message":"This is truly amazingThe Cleveland Clinic said the nine-hour surgery was performed on a 26-year-old woman, using a uterus from a deceased donor."},{"comment_id":"1893598704195217","commenter_b":"@username oh I know how to read... Someone is benefiting.","commenter_a":"At least revenue will be generated from taxes! 👍🏼","post_message":"THIS JUST IN: Proposition 64, which legalizes recreational marijuana use, has been approved by California voters. Here's everything you need to know: @webpagelink"},{"comment_id":"788206447982585","commenter_b":"The trump train is heading for the trump wall. toot toot.","commenter_a":"Hurry Hillary call Wall Street call @username call AL Sharpton because your gunna need all the help you can get. The Trump Train is rolling straight for the White House !!!","post_message":"Hillary Clinton and her allies are preparing for the fight against Donald J. Trump."},{"comment_id":"10154312646744726","commenter_b":"For those confused about how an attack like the one in Orlando, Florida, could happen, I'll try to catch you up: Barack Obama's #1 goal has been to turn this nation into an Islamic wasteland. To that end, he appointed Hillary Clinton to be his dirty-dealing Secretary of State, in order to funnel military grade weapons to a then very inchoate ISIS. Hillary Clinton decided that it was appropriate for her to set up a fake Canadian charity, the Clinton Global Initiative, so that she could accept donations from dangerous nations, in return for personal political favors from the Secretary of State. This is the very definition of treason. However, Hillary didn't want anyone to have a paper trail of all her crooked dealings, so she set up a private email server in an attempt to thwart Freedom of Information Act requests. Barack Obama is now protecting Hillary, because he's ...","commenter_a":"It's truly disgusting and disturbing to use a massacre to push a political agenda. It was an Islamic terrorist attack now it's been used by democrats for an anti gun campaign, sickening.","post_message":"Liberals immediately urge gun control measures as terror link emerges in Orlando shooting"},{"comment_id":"509999849159970","commenter_b":"So you live in England and wanna talk about raping places for centuries? Bitch please you would be speaking German in we don't not come to Europe and save you bitches.","commenter_a":"He ain't a Muslim, no outrage #Murica","post_message":"DEVELOPING: The search for the suspected gunman continues this morning."},{"comment_id":"10153754678291336","commenter_b":"Can't play politics and disarm society if you make the kids safe! Gotta get a few kids killed to advance if you're a communist. The end justifies the means with these Freaks.","commenter_a":"jerry brown is a fool","post_message":"Does this make schools safer?"}]
