[{"comment_id":"1482883781727172","commenter_b":"Once the snowflakes find out the expense of their new revolution will cost them their Pot money....they will reconsider. But hey...the gun community is an inclusive bunch. This should be interesting to watch. They will be easy to spot wearing their skinny jeans with a big bulge printing for me to keep an eye on.","commenter_a":"These people give a new meaning to the word stupid!","post_message":"Unreal."},{"comment_id":"10152934995226680","commenter_b":"Seems you want to engage in gossip. I got better things to do with my time. Scoot along Andrew.","commenter_a":"Bernie's right. The biggest mistake of the Clinton administration was dismantling Glass-Steagall.","post_message":"Bernie Sanders: 'Allowing commercial banks to merge with investment banks and insurance companies in 1999 was a huge mistake.'"},{"comment_id":"10153906940493812","commenter_b":"Are you American? If your pro bringing terrorists into the country and giving them free benefits like Medicaid etc. while American citizens starve, how about we send a few to stay with you? Wait... I get it... 'Nuff said!","commenter_a":"After all, some Americans do have a heart. Way to go Pres. Obama.","post_message":"'Apparently, they are scared of widows and orphans coming into the United States of America.'"},{"comment_id":"10154130033413797","commenter_b":"so she should keep her legs together","commenter_a":"you have a brain tumor and you are suing bc you want your tubes. out.. are you sure you are just not brain dead?","post_message":"A woman suffering from a brain tumor is threatening legal action against a Catholic health system because the hospital is allegedly refusing to tie her fallopian tubes based on religious belief. The procedure could be life saving for the woman..."},{"comment_id":"10153188449234087","commenter_b":"Go to jail!","commenter_a":"You should have called it a sin. We readily forgive those, just not mistakes.","post_message":"'That was a mistake. I’m sorry about that. I take responsibility, and I'm trying to be as transparent as I possibly can,” Hillary Clinton told ABC News's David Muir."},{"comment_id":"1300696676663751","commenter_b":"Fuck yo bitch ass fuck you too pussy","commenter_a":"Fuck Donald Trump orange ass","post_message":"Clearly wasn't feeling the jersey!  #WSHH #WakaFlocka"},{"comment_id":"782798865146503","commenter_b":"Bitches be bought and paid for once by us and once by Kocks.","commenter_a":"Greedy bastards.","post_message":"This is a prime example of why we need to get big money out of politics."}]
