[{"comment_id":"1004207899725254","commenter_b":"Nasty woman","commenter_a":"Vote the issues!!! Main stream media has succeeded in blinding and brainwashing its people, spinning half truths and omitting important truths. You will NEVER GET REAL NEWS FROM MSM. Go to TRU NEWS, InfoWArs, and many other investigative journalists who are not afraid to tell the truth or worry about losing their jobs. If you are Gay, Why are you voting for Hillary when she wants to bring in thousands of refugees that believe all Gays should be executed? If you are Black, Why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood who want to abort as many black babies as possible? Exterminate the black race because they are like 'weeds'. (Margaret Sanger quote) Most of those clinics are in Black neighborhoods. If you are a Christian, Why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who ...","post_message":"'I'll do the very best I can if I am fortunate enough to win today,' said Hillary Clinton after casting her vote today @webpagelink"},{"comment_id":"752518631516293","commenter_b":"AND YOU WANT AFRICAN-AMERICANS TO VOTE FOR TRUMP???? I PROBABLY TAUGHT YOU TO READ AND WRITE....LOL","commenter_a":"Who are you to say who is an american citizen? Were your parents born in AMERICA!....You defrauded all your workers to get rich!","post_message":"What I would do on my first day in office. #MakeAmericaGreatAgain  Text TRUMP to 88022 to join the #TrumpTrain"},{"comment_id":"1191417507545813","commenter_b":"HELL, IF THESE PEOPLE WORKED AT A JOB AS HARD AS THEY DO PROTESTING THIS STUPID CRAP, THEY WOULD HAVE PLENTY OF MONEY !!!!!!!!!!!","commenter_a":"So the dems want to shut down Graceland via their personal propaganda terrorist cult Black Lives Matter AND they want to label WikiLeaks a terrorist organization and have put a DEAD OR ALIVE bounty on Julian Assange. These ARE troubling times. I can't believe they think the American people are that stupid. Enough is enough. Stop with the violence and let us now hear what the Clinton camp thought should be deleted. (Despite the State Dept. request for ALL email on server) I think at the end of the day people of all colors and beliefs in America will find they thought we were all stupid enough for them to screw all of us. We really all need to stick together. Unity matters now. #HumanLivesMatter #AllLifeMatters #TruthMatters Now let THAT sink in.","post_message":"Leaders of the protest say they chose Graceland because 'it demonstrates one of Memphis's most common forms of financial inequality and because the site has ties to ... the death of unarmed teen Darrius Stewart.'"},{"comment_id":"10153550945636943","commenter_b":"No Syrian refugees....NONE!...call the Capitol...1-202-224-3121...follow instructions...Let them know you oppose Syrian refugees entering the U.S.. Took me 2 minutes...EASY!","commenter_a":"No","post_message":"Tom Fitton joins Fox News to discuss the danger Syrian refugees pose to the United States. Do you think Obama should allow thousands of Syrian refugees into our country?"},{"comment_id":"10153544562557411","commenter_b":"Maybe if he didnt talk back, laugh and pull away, they would have let it go!!","commenter_a":"How can u steal FREE milk?? Lol smh....","post_message":"'This is ridiculous... this is beyond embarrassing... he's at home for 65 cents.'"},{"comment_id":"10153342820917098","commenter_b":"I am on her side, women now a days are almost naked just to prove that they are sexy.","commenter_a":"Im on her side. Hoes are in their feelings because she feels beautiful and sexy with clothes ON. She clearly didnt have to be half naked to get her man and that should tell you hoes something. Lol Dont be mad, learn something. Know your worth. Get it together.","post_message":"TWITTER DEBATE: Ayesha Curry, wife of Warriors basketball star Steph Curry, found herself in a social media firestorm after tweeting about today's fashion  Many people criticized her for body shaming while others praised her for her modest views. Which side are YOU on??   FIND OUT what she said: kron4.com/2015/12/07/twitter-explodes-after-ayesha-curry-tweets-about-modesty/"},{"comment_id":"10154319378806337","commenter_b":"Mfs are crazy someone please give this puppy mf a show so i can laugh everyday as he humps his wifes leg and smell her butt. Wait i do all those things. This guy is normal","commenter_a":"Oh what the fuck happened to this world..lol","post_message":"UHHHH..."}]
