[{"comment_id":"10156924432505354","commenter_b":"No! What people do sometimes astounds me!","commenter_a":"@username did you hear about this?","post_message":"Tree Hugger Causing Seattle Traffic Back Up  “Issue appears to be between the man and the tree,” Seattle police tweeted...  #ManInTree"},{"comment_id":"10153236038721336","commenter_b":"See this is what I mean, we know this guy is a terrorist. He admits so on TV and trains other MUSLIMS the most effective ways to be a terrorist. Why is he allowed to walk the streets? We need a force not answerable to normal athority that can move in on MUSLIM terrorist like this without constraints and not having to watch them for 10 years then wait a week after they attack to make an arrest. Get the job done and move on to the next one.","commenter_a":"Why giving your air time to this evil, wicked man","post_message":"Imam Choudary: \"The United States of America are the champions of murdering innocent people!\"  Muhammad contest organizer Pamela Geller: \"[We're] the champions of freedom, sir!\""},{"comment_id":"10152617242161680","commenter_b":"@username When did DHS keep illegal aliens out ? They watch our borders watch them walk right in. DHS is a waste of taxpayers money. We have Military FBI & CIA.","commenter_a":"Republican Logic: \"We care so much about stopping illegal immigration that we're going to cut off funding to the Agency responsible for stopping illegal immigration.\" Just brilliant. Truly.","post_message":"Senate Democrats are considering a shift in strategy that could offer a resolution to a long Senate impasse over funding the Department of Homeland Security — and put more pressure on House Speaker John Boehner."},{"comment_id":"1091281260931621","commenter_b":"False? He plead guilty and was a registered sex offender.","commenter_a":"Best known for being a paedophile.","post_message":"RIP Jackass star Vincent 'Don Vito' Margera"},{"comment_id":"1181580438601675","commenter_b":"That's not true but i'm glad she got away with it,I can't wait till she starts debating Trump.","commenter_a":"Not","post_message":"True story..."},{"comment_id":"988941504498931","commenter_b":"@username c'est beau...","commenter_a":"@username Let them","post_message":"'I love you, wait for me, I'll be there soon'"},{"comment_id":"1803612926545625","commenter_b":"I agree ...where they trained to beat the crap out of people because they ran....smh","commenter_a":"What they fail to mention is that even if this man was the actual perpetrator it's still inexcusable for the cops to beat him unless he was resisting. The police's job in this case is to apprehend suspects. Suspects are innocent until proven guilty and should be treated as such.","post_message":"\"I've never been cursed, physically abused, beaten and treated like a slave as I was two days ago.\" A retired corrections officer says he was assaulted by Garden City Police in a case of mistaken identity. CBS2's Carolyn Gusoff shares his story: @webpagelink"}]
