[{"comment_id":"10154028228372060","commenter_b":"B*LL S**T.","commenter_a":"Assuming this is true, this is unacceptable. What a horrible thing to say to someone.","post_message":"A Muslim teacher in a Georgia high school said someone left her an anonymous note in her classroom, telling her that her \"headscarf isn't allowed anymore.\" The note also told her to \"tie\" her headscarf around her neck and \"hang yourself with it.\""},{"comment_id":"10154380784584877","commenter_b":"And this lady is Exhibit A.","commenter_a":"Maybe way back in the day... Im not trying to be funny but women of a certain background look good till about 35 and then start to look haggish","post_message":"People are still coming out of the woodworks to stake their claim on Prince's estate."},{"comment_id":"10153625958496636","commenter_b":"This is why women shouldnt get involved: too emotional. Lets let everyone in...","commenter_a":"The Germans now are having a worse affect on Ireland than nazism did. They are diluting the nation state with mass immigration.70 million muslims from Turkey given visas, austerity and cheap labour frrom countries that should never have been allowed into EU.Dole tourists bleeding us dry . Most importantly our individuality is being merged into a multicultural nightmare","post_message":"Freedom is in decline across the planet"},{"comment_id":"10153590178129497","commenter_b":"You sons of bitches !","commenter_a":"Fearless!","post_message":"Via ClickHole:"},{"comment_id":"10153266523095927","commenter_b":"Should have BABY MURDERER on the FRONT of that DRESS!!","commenter_a":"DISGUSTING!!","post_message":"Dress is part of a social media campaign that encourages women to share \"POSITIVE STORIES about their abortion experience ...\""},{"comment_id":"1694550140816786","commenter_b":"Misogyny!... misogyny everywhere!","commenter_a":"RIP, Chyna. But in your next life don't be a wrestler and a pornstar. Two terrible choices for a woman.","post_message":"She was known as the \"Ninth Wonder of the World\". #RIPChyna"},{"comment_id":"10152717878976770","commenter_b":"Too many nut-jobs in higher education these days. Bet she sues the school if she gets sunburn.","commenter_a":"Stupid is as stupid does and we all know you can't fix stupid.","post_message":"We're pretty sure that's not going to work..."}]
