[{"comment_id":"10157239899915725","commenter_b":"Democrat lives don't matter.","commenter_a":"Say it Mr President .","post_message":"ISIS exploded on Hillary Clinton's watch- she's done nothing about it and never will. Not capable!"},{"comment_id":"712497285538613","commenter_b":"Islamists radicals are killing muslims every day in irak, syria etc! Its about thousand and thousand and for no reason! Israel, when attacked, its only to defend itself! As any country would do!","commenter_a":"Jewish extremists burned a kid alive too. Just stating a simple fact.","post_message":"Netanyahu: ISIS burns people alive, Iran hangs them in city squares"},{"comment_id":"1588312174810373","commenter_b":"Killery destroyed evidence after she received a subpoena from the FBI and she Lied under oath! Alot of people have went to jail for less! Our Government and the Media are so corrupt! The same people that have major shares in every media outlet are same people that fund Killery! Saudi and Arab countries!!! I hope you know how they treat Women? Children! Gays?","commenter_a":"This woman has no shame... She will say and do anything for power.. Wake up Dems you're trying to elect a criminal for president.","post_message":"Latest batch of WikiLeaks emails contain details on Hillary Clinton's narrative on Benghazi. @webpagelink \"We see an email exchange among John Podesta [and] other top aides, where Hillary Clinton was being coached on, in their words, 'how to stir up some moral outrage against Republicans' at this Benghazi hearing several months ago,\" Ed Henry reports."},{"comment_id":"1820380214887532","commenter_b":"I will bet you $10.00 to a donut she is a liberal.","commenter_a":"This is insanity, this principle needs to be removed.","post_message":"Angry yet??"},{"comment_id":"543443959158926","commenter_b":"Time to skewer the witch!!","commenter_a":"Hell Ya !","post_message":"'Hillary Is In for the Ride of Her Life' When She Takes On Trump. Governor Mike Huckabee"},{"comment_id":"618479561657305","commenter_b":"You should really pay a visit to area 51 theres aliens there","commenter_a":"Why didn't you bring up in your speech how the people at the Bataclan were tortured and videotaped before being murdered - oh and that it was hidden by the media...","post_message":"Hillary Clinton will increase Syrian refugees by 550% without a realistic screening process."},{"comment_id":"419941198130475","commenter_b":"Yes, Yes, she is a ruthless women!","commenter_a":"Youll keep up the good work","post_message":"Republican Presidential candidates are all ganging up on Hillary Clinton. Is this fair?"}]
