[{"comment_id":"416369798522976","commenter_b":"Cheeko you ignorant slut. Stop acting like you know anything.","commenter_a":"Russia, get your shit together.","post_message":"Last year, fans of the Moscow CSKA team chanted racist slurs during a match against Manchester City. A year earlier, fans of Torpedo Moscow threw bananas at player Christopher Samba, who is from Congo, during a game against another rival Moscow team."},{"comment_id":"10154514715036077","commenter_b":"You will be glad to know Trump is looking to hire people like you to build that wall. Jobs jobs jobs, and then he'll send you back and bum pay you. That's how he has gotten rich on the sweat of others people like you who believe his propaganda. According to him we are all here illegally. .and a bunch of low life criminals","commenter_a":"As American hispanics, we are tired of how all of these coward racist liberals that hate America like Obama, Clinton, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, we're supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of our skin... disgusting. That's why we elected President Donald J. Trump. Help us reach more people by following our great pro-America page '@username', the only true patriotic cartoon comic strip. And let's Make America Great Again! Thank you.","post_message":"It would take 37 electors nationwide currently pledged to Donald Trump to vote for someone else to derail the election results and trigger a vote in the U.S. House of Representatives"},{"comment_id":"10154329807781051","commenter_b":"These insecure women manage to chase away the good men...then end up with another POS and can't figure out why...imo","commenter_a":"Opps!","post_message":"This girlfriend really, really didn't trust her boyfriend, so she decided to send a porn star to test his fidelity while she watched it unfold on camera. She thought she was ready for anything - but she was definitely not ready to see what he did."},{"comment_id":"10153904904228812","commenter_b":"Yes Danold deport all the white supremacist, terrorising the USA. Too.","commenter_a":"this is not even our country lol. Native Americans were here first. If Trump says he will deport all immigrants, he should deport himself first.","post_message":"'Anybody that's brought into this country from the migration is going to be out,” Trump said at a rally in Knoxville, Tenn., Monday night. “We’re not gonna do it. We’re gonna have a country again, we’re gonna have borders, we’re gonna have a country again, right now we don't have a country.'"},{"comment_id":"822546624556646","commenter_b":"Trying to straight-wash and white wash the situation is terrible. Not only was this guy scoping out gay bars before, he also chose to go on Latinx night, when most of the patrons were PoC, generally of Latin descent. So this was a hate crime. It had to do with race, it had to do with sexual orientation. You trying to bury those facts is deplorable.","commenter_a":"This isn't a gay attack. It's a terrorist attack that's being portrayed as homophobic because that's a cause people will rally for. Anything to further your agenda. No one wants to believe it's radical Islam, but that's what this is. Of course his family and even his own tweets blame gays. A gay bar is a perfect target so we can blame homophobes and call it a a hate crime. Well terror is also a hate crime and gay or straight these people are dead.","post_message":"President Obama on Sunday morning's mass shooting at a gay nightclub in Orlando, Fla. It's the deadliest mass shooting in U.S. history. @webpagelink"},{"comment_id":"10158510929345206","commenter_b":"Then how do you explain her looking at the camera from a certain angle while wearing a head scarf? Only one woman can pull off that move.","commenter_a":"thats not even her.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153087733461350","commenter_b":"She is truly fit and very pretty but sorry I still do NOT think seeing a huge belly and huge belly button sticking out is that appealing. Pregnancy is a beautiful thing, but come one get some class. I know all of you that think showing everything is great will have a fit over my comment. But if people would be honest, see through material showing huge bellies with huge belly buttons is not that appealing. I guess nothing is supposed to be left to the imagination or in the bedroom. I have seen some very sexy maternity outfits and this is not one.","commenter_a":"When is Jenna due ? Amazing fitness ! Love all y'all !","post_message":"Do you have questions for our #startTODAY experts? Ask below!  Jean Chatzky, Joy Bauer, Jill Martin and Jenna Wolfe are taking your questions on money, diet, fitness and getting organized. questions."}]
