[{"comment_id":"10154568633769411","commenter_b":"@username, fuck cows!!","commenter_a":"It's really strange, Facebook isn't offering me a chance to superimpose the Pakistani flag over my profile picture. It's as if they dont really give a fuck unless it suits the agenda of the overlords of western governments.","post_message":"The Khorasan province branch of ISIS has claimed responsibility for the attack"},{"comment_id":"10150755194664999","commenter_b":"Are you suggesting women become prostitutes?","commenter_a":"Domestic housekeeping is correctly dismissed as being of economically minimal value, because in the free labor market performing these tasks for others (child care / babysitting, housecleaning, short-order food preparation) are low- (or no-) skill jobs that are either minimum-wage, or \"under the table\" cash-based work.","post_message":"\"We need to call work what it is — work — whether you do it at home or whether you do it out in the labor force, and then give men and women options to choose what they want to do.\""},{"comment_id":"928783390554410","commenter_b":"This is who he is at his core. This is what he will be. He has done us the great service of showing his true face, not the shiny, practiced veneer of the professional politician. Whether he learns to act presidential or not, this is the man you will be getting if you vote for him, a man who wants to pull out a measuring tape to settle disputes over issues. The fact of the matter is that there are no good choices this time. There aren't even any ok choices. But this man is a bully with all the character flaws that go with that, and he will do almost as much damage to this country as Clinton or Sanders. I am seriously dismayed by the continued popularity of this man, but I am equally dismayed by my other choices. And I am dismayed with a general electorate who ...","commenter_a":"It's past time for him to be acting more presidential. He also needs to do some research in preparation for the debates. Chris Wallace made him look like a fool when he put up those slides on his economic plan. He's making it harder and harder to not only defend him to skeptics, but to also remain an enthusiastic supporter instead of being a reluctant one.","post_message":"Despite what polls had shown days before Super Saturday, DONALD TRUMP lost two of the four states on Saturday to Sen. Ted Cruz, and the states he did win were at a lesser margin than predicted.  Some supporters and pundits are placing the blame on Trump's performance during the Thursday night debate, stating his \"less than presidential\" behavior is catching up to him.  In the past, DT has stated he will act more presidential when the time is right, so we ask you to take our poll knowing DML will read the results later tonight on UNFILTERED.  POLL: Does Trump need to act more presidential in order to win?  @webpagelink"},{"comment_id":"1731162717167272","commenter_b":"Rob Reiner is a slut! Liberal twit, rich and ignorant as a bowl of dung!","commenter_a":"The rich and stupid strike again...","post_message":"You mean racist like the race-baiters who back Hillary Clinton?   Kinda like that, Rob?"},{"comment_id":"10154681794980329","commenter_b":"@username Cringe worthy.. Sounds like a super basic bitch thing to say lol","commenter_a":"As a 6 foot tall lady who is all leg, YAAASSS, SEND THEM ALL TO ME.","post_message":"\"I might keep the jeans for fun now,\" one recipient told BuzzFeed News."},{"comment_id":"10156846569325354","commenter_b":"Get a life lady.","commenter_a":"Freedom of speech is the culprit! Quick! Stop that first amendment drivel!!!","post_message":"It's starting..."},{"comment_id":"431964536928587","commenter_b":"Sluts should be treated like people. So that's fine if you treat a slut \"like a slut\" as long as you consider them people and treat them accordingly","commenter_a":"I don't understand the negative stigma behind girls being sluts. God Damnit, Men love sluts.","post_message":"Regardless of what a person wears, they are worthy of your respect."}]
