[{"comment_id":"10154001737221509","commenter_b":"Because marriage is between a man and a woman, look up sodam and gamora","commenter_a":"Why has she not been fired? Seriously, find another job if performing your duties as a PUBLIC SERVANT conflicts with your religious beliefs. BTW, homosexual marriage is NEVER mentioned in the bible.","post_message":"This Kentucky woman is still refusing to issue marriage licenses to same-sex couples on \"God's authority\" -- and in defiance of the Supreme Court. @webpagelink"},{"comment_id":"1569798589746550","commenter_b":"Lock her away...","commenter_a":"Common assault","post_message":"This is disgusting"},{"comment_id":"1391331507694716","commenter_b":"Shut up hoe","commenter_a":"It's really hard to see the rest of us as people when you have to distance yourself with your extreme views and lifestyle to find some amount of self esteem. Keep fooling yourself apparently NBC loves putting you out there to keep poking us in the eye, but we know we are right and you are wrong. That is the standing in America right now.","post_message":"Rachel Maddow was nearly hysterical over Trump's speech. #RNCINCLE"},{"comment_id":"1066819213408210","commenter_b":"Welcome home honey, Americans take care of each other. We want more proud immigrants like you!","commenter_a":"I am not a us citizen yet,but I hate seeing american burning a us flag..she not the one to fight for her freedom..she didn't even think to the forefathers that fight for her freedom right now..that has no respect at all..","post_message":"WATCH: A police officer takes an American flag away from a protester who was trying to burn it outside the GOP Convention in Cleveland."},{"comment_id":"10153509134104205","commenter_b":"Fuckdonaldbitchasstrump!!! @webpagelink","commenter_a":"Excellent point! That's why I think Unions came out for her, well some Unions! If they didn't and she wins, they aren't represented! If they back her and Bernie wins, he'd still be for them!!","post_message":"Hillary Clinton keeps a list of her political friends and enemies. She does this so her staff can quickly decide who to reward and who to punish when favors are asked. Basically it’s for streamlining corruption."},{"comment_id":"10154289456551336","commenter_b":"No it wouldn't be. It's encouraging to see females that still want equality, rather than superiority.","commenter_a":"It's a dress code, then she should be sent home. Would this still be a story if a man was sent home for not wearing a tie?","post_message":"Dress code violation or sexism?"},{"comment_id":"1057253901026942","commenter_b":"and raising the min wage only cuts jobs, hrs, and closes busnesses","commenter_a":"We've seen this movie! And it doesn't end well for most Americans","post_message":"Research has found that massive tax breaks for the wealthy don’t trickle down into economic growth."}]
