[{"comment_id":"902219749819813","commenter_b":"Mad gangs are those who want to draw another map. If a woman doesn't want you will you force matters. Ukrainians and other countries don't want Russian. For then to survive they want a friend indeed to protect them to the aggressor. PUTIN","commenter_a":"NATO is the biggest ever gangster-organ./ bunch of WARCRIMINALs.. existed on earth.. and as such.. the biggest threat to world-peace of our time..","post_message":"A top Russian military commander says Moscow considers NATO missile installations in Eastern Europe “priority targets.”"},{"comment_id":"863004940415197","commenter_b":"Throw her in jail","commenter_a":"Take her down!","post_message":"'Perfect' was the response Lerner used about the non-archived messaging system."},{"comment_id":"630659240427363","commenter_b":"See. Look at this fucking cunt here. ^","commenter_a":"As much as I don't understand the obsession with Pokemon Go, it's done more good than any public health initiative that that any state or federal government has spent millions.","post_message":"The health consequences of sedentary lifestyles are costing the US $27.8 billion a year."},{"comment_id":"10153128102178145","commenter_b":"NO! She is a murderer!","commenter_a":"only if she tells the truth about what really happened..oh yeah she doesn't know how to tell the truth!!","post_message":"She's been called the 'Most Hated Woman in America'. Now you may soon see Casey Anthony on TV again.  Would you watch her interview? #WFTV  Read more here: @webpagelink"},{"comment_id":"10153415321678812","commenter_b":"Stacey shutup stupid","commenter_a":"So how does something hitting the windshield really effect a train on tracks? It's not like the train swerved to avoid it and hit something...travelling at 106 mph might be the villain in this tragedy.","post_message":"FBI investigating possible links between Amtrak crash and other trains hit by objects: @webpagelink"},{"comment_id":"684673561687958","commenter_b":"Your right I will vote female when it's right and it won't be Chelsea Clinton either. MAYBE IVANKA TRUMP.","commenter_a":"I would have no objection voting for a QUALIFIED female for president. However, I will not vote for anyone of any gender, color, or nationality that is a liar, is a thief, etc to run our country further into the ground. This election is not the time to vote for a female president.","post_message":"'For all you women out there who think that electing a female president will lift us all up, just ask yourselves if electing an African American president lifted up the blacks in this country.' – Judge Jeanine Pirro @webpagelink"},{"comment_id":"604670086348434","commenter_b":"Like that, tbh","commenter_a":"He has the face a typical Republican Tea Party red neck. A Trump voter perhaps who will be voting in jail, if he is allowed. Disgusting asshole punching a physically disabled child.","post_message":"This guy gets my vote for Biggest Jerk of the Holiday season. --Andrew"}]
