[{"comment_id":"10153000609386491","commenter_b":"The Russian lady nailed it. For me, I don't want kids and that is unacceptable to so many people. She only wanted one and that was JUST AS UNACCEPTABLE! We know what we want our families to look like. Trust us, we're women!","commenter_a":"I respect your decision to not have kids. Some people don't. It's an important job that should only be done by people who want you. BUT, I think making a decision like that at 28 years old was a little rash. A lot of things change. I had my daughter when I was 39 years old. Things that make you happy in your 20's are not necessarily going to be the same for the rest of your life. And, don't be sad for people who tell you that there is no greater love than one for a child. There isn't!! Don't knock it just because you don't understand.","post_message":"“What I want is to be happy.”"},{"comment_id":"554388108092251","commenter_b":"Merry Christmas to you and your family","commenter_a":"GOOD+++","post_message":"May your Christmas be filled with happiness and hope. Let us not forget the women and men overseas protecting our freedom. Merry Christmas from my family to yours."},{"comment_id":"880910168618891","commenter_b":"Martial Law.... never heard of her. Lol. 2nd revolution needs to take off","commenter_a":"Rising up with guns will only give them what they want or need to bring down the hammer of martial law","post_message":"In case you missed it, here's our top story from Monday: It’s clear that if the U.S. is to restore human liberty and return to the Federalist system created by the Founders and since destroyed by Abraham Lincoln, the Federal Reserve Act, the 16th and 17th Amendments and an activist Supreme Court that abused the 14th Amendment, one step — and probably the first step — must be to repeal the 17th Amendment. Repealing the 17th Amendment would take the money out of Senate elections on the federal level. Senators would be beholden to their state legislatures again rather than the corporatist class that lines their pockets, finances their re-election campaigns and ensures them seven-figure lobbying gigs once their time in “public service” ends. Senators would not act against their states, as 12 senators from 10 states are currently doing in regard to President Barack Obama’s executive action on amnesty for illegals. @webpagelink"},{"comment_id":"10153328841247377","commenter_b":"she should be in jail what she done to Stevens was murder .","commenter_a":"We The People That For Trump Will Vote For Trump The Hard Core Dem Will Vote Dem If I Told Them My Dog Was Running They Wood Vote For Her Most Of Dem And Rep Wont To See Our Country Great A Gain Will Vote Trump","post_message":"New email released Monday shows slain Ambassador Chris Stevens wanted to leave Benghazi for months before his death, ex-U.N. Ambassador John Bolton said Tuesday."},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"},{"comment_id":"10155845816789778","commenter_b":"Idiots...its about illegal immigrants and nothing more....drama is what they thrive on","commenter_a":"stupid is as stupid does. these people are here legally and commit no crimes, yet they do not want the president to deport those who would cause harm or come in illegally.","post_message":"Delia Goncalves was live with Jose Andres about #ADayWithoutImmigrants.   Several DC-area restaurants will be closing as a part of the movement."},{"comment_id":"497783407099419","commenter_b":"Kill the pigs.","commenter_a":"Killing of police officers is WAY UNACCEPTABLE!!!! I am sure that he didn't know if these police officers were empathizing with the protesters but was doing their sworn duty to protect and serve!","post_message":"\"Oh my god. There's people laying on the ground.\" Video from #Dallas via Twitter user @allisongriz includes audio of what sounds like multiple gunshots. @webpagelink"}]
