[{"comment_id":"10154278742015329","commenter_b":"Thats that lingo dang old times lol","commenter_a":"Diego X Flores Pringle","post_message":"Single and ready for a PRINGLE."},{"comment_id":"10154978803416509","commenter_b":"@username even your pussy is ugly...","commenter_a":"Anyone who is upset, mad or sad about this, please evolve otherwise you are apart of the pedophile culture.","post_message":"In a nod to a more modern approach, the Miss Teen USA pageant is ending the swimsuit portion of its competition."},{"comment_id":"2202427943315983","commenter_b":"@username go beat your wife old man","commenter_a":"The ole draft dodger than said McCain wasn't a war hero because he was captured in battle. Yeah he really respects our military to nominate someone who is already part of the problem with the VA. I am a Republican at heart but I'm not going to blindly follow this man like some are. Words have meaning.","post_message":"Watch: President-elect Donald J. Trump and Vice President-elect Mike Pence lay a wreath to honor the nation's fallen soldiers at Arlington National Cemetery."},{"comment_id":"1663378140627092","commenter_b":"wow cant wait to see u guys in 10 years w ur sugar daddy/ies, and ur lavish lifestyle its gonna be great","commenter_a":"@username time to sign up😂","post_message":"This summit actually teaches young women how to score a sugar daddy..."},{"comment_id":"10154302766323543","commenter_b":"@username The problem in California is that now illegals have driver's licenses and with that, they were simultaneously, automatically REGISTERED to VOTE as well. Thank to Jerry Brown. We in California are also overrun with Sanctuary Cities and BROKE due to these idiotic, liberal politicians!","commenter_a":"Regardless of the number, I am strongly in favor of requiring IDs for voting. NO ONE should be allowed to vote if they don't have the legal right to do so.","post_message":"Hillary Clinton garnered more than 800,000 votes from noncitizens on Nov. 8, an approximation far short of Donald J. Trump estimate of up to 5 million illegal voters but supportive of his charges of fraud. - via The Washington Times"},{"comment_id":"893070080803922","commenter_b":"I wouldn't vote for Killary,If she was last person on Earth! She A Liar and a Bad egg!!","commenter_a":"The movie idiocracy.....we are living it!","post_message":"Jesse Watters: \"What do you think Hillary Clinton's biggest accomplishment has been?\"  Answer: \"She has gone around to certain places – Brooklyn, she's been to Queens.\"  MORE: @webpagelink"},{"comment_id":"515532941989754","commenter_b":"She so sickening","commenter_a":"And your high taxes and high minimum wage and Obamacare will put small businesses out of business so just stop. Americans can see through your BS .","post_message":"Hillary went off her rocker today. She is YELLING at voters. Very Bizarre."}]
