[{"comment_id":"10153177294431336","commenter_b":"How can a female win the MENS race? Read much?","commenter_a":"That's a female???","post_message":"JUST IN: Lelisa Desisa has won the men's race at The Boston Marathon in an unofficial time of 2 hours, 9 minutes, 17 seconds. It's the second victory for the Ethiopian, who won the marathon in 2013 just hours before the attacks. @webpagelink"},{"comment_id":"10152884821337093","commenter_b":"Why a woman?","commenter_a":"If it ain't broke don't fix it","post_message":"Which American woman deserves to be the new face of the $10 bill??? @webpagelink"},{"comment_id":"1009798209043227","commenter_b":"That woman will never learn.","commenter_a":"Pig","post_message":"Joy Behar calls out Carly Fiorina. Is she right?"},{"comment_id":"10153543031078812","commenter_b":"If you are crossing borders illegally... You broke the law, entered our country without proper credentials and then I'm suppose to foot the bill? Hell no, if I have to follow the rules, then so should the ILLEGAL immigrants!!!","commenter_a":"In my opinion he offended not only #mexicans but all imigrantes that have to cross any border w/ USA. MY RESPECT to anyone that comes to the USA trying to have a better life.","post_message":"NEW: Univision dropping Miss USA pageant and cutting all business ties with Donald Trump over comments about Mexican immigrants: @webpagelink"},{"comment_id":"10150611422369999","commenter_b":"The south wants to keep it.....FLY IT HIGH SOUTHERNERS WHO ARE PROUD OF THEIR HERITAGE KEEPING STATE RIGHTS.","commenter_a":"It's a VA battle flag....why was SC flying it? oh yeah, State's rights were taken away...sad so many people think that war was over nothing but slavery...I'm a history major....would never fly it but I know what it's true purpose is...Those who had confederate soldiers die in their family still use it....KKK ruined it and so did this fool....","post_message":"Breaking News: Gov. Nikki Haley of South Carolina called for removal of a Confederate battle flag from the State Capitol grounds after the white man accused of killing 9 black people was seen brandishing that flag in widely circulated pictures. “It’s time to move the flag from the Capitol grounds,” the governor said."},{"comment_id":"1123357077760543","commenter_b":"She's gonna drop-kick Trump in the general election!!!!","commenter_a":"America actually did stop being great, but not for you because you a corporate puppet","post_message":"\"We don't need to make America great again. America has never stopped being great,\" Hillary Clinton delivers victory speech after #SCPrimary win: @webpagelink"},{"comment_id":"10153178962341833","commenter_b":"Oh and not to mention we wouldn't have lasted a day against the British without guns.","commenter_a":"People just don't get the fact that we are still a democracy after 240 years in part because we as a population have the constitutional right to be armed. Let's see how long we would have lasted otherwise.","post_message":"Thank you for helping us reach 4.2 Million LIKES on Facebook! Like and Share the news with your friends!"}]
