[{"comment_id":"500607250129855","commenter_b":"Smoke them if you got them, probably can get the best shit.","commenter_a":"This right wing crap. I am right of the right and this is crap","post_message":"The White House is in uproar after Obama daughters caught doing THIS.  This is outlandish. These are the daughters of our president.  Would you vote to kick the Obamas out of the White House?"},{"comment_id":"215680145570500","commenter_b":"Who cares what she thinks?","commenter_a":"Stick to pretending to be someone else and saying someone else's words!","post_message":"Not a fan of Meryl Streep's politics? According to her, you may as well be a Nazi."},{"comment_id":"1141758235909203","commenter_b":"Bucket of losers and needy Mexicans. She was right.","commenter_a":"Actually, The founding fathers were rich aristocrats who valued property rights at a premium, so much so that they limited the right to vote to land owners, who at the time were the billionaires of their day. It isn't right that billionaires can buy elections, but that probably would have been the intention of the founding fathers.","post_message":"When the Founding Fathers wrote the Constitution, I’m pretty sure they weren’t thinking “Let’s make sure billionaires can buy elections.”"},{"comment_id":"10155151407594575","commenter_b":"Illegals have to hide behind walls to avoid deportation. They build their own walls. Saw absolutely no effects from a day without immigrants, Guess they don't really matter.","commenter_a":"Awesome.","post_message":"Business owners are standing behind their decision to fire workers who participated in \"A Day Without Immigrants\" protests.  They say it's not a political stance but rather a business decision.  \"If you're going to stand up for what you believe in you have to be willing to pay the price.\""},{"comment_id":"598112180339217","commenter_b":"@username buzz off back to the Rove hive","commenter_a":"How to Steal an Election 101...Despite winning Wyoming 56-44 percent on Saturday, Bernie Sanders will split the pledged delegates evenly with @username, plus Clinton gets the state's 4 superdelegates, tilting the delegate count to her favor, 11-7.","post_message":"We need a leader who will bring us together—not drive us apart."},{"comment_id":"1372232146121032","commenter_b":"Chris Schiraldi really? Please tell me your source besides your opinion because that sure as hell isn't fact!!!!","commenter_a":"Yeah thanks for the lowest workforce participation rate in decades. Thanks for creating so many low wage/ low benefit jobs. Thanks for so many on food stamps because the economy sucks. And thanks yahoo for being yahoo... and that isn't much","post_message":"75 straight months of job gains. 15.8 million private sector jobs added since 2010.   Thanks, Barack Obama."},{"comment_id":"10153671011123132","commenter_b":"Being a hooker.","commenter_a":"Oh pleeeeeeeze, her profession is/was a stripper. She posts lots of photos of her body parts all the time. How do you think she pays her bills?","post_message":"Whoa!"}]
