[{"comment_id":"1180631801992422","commenter_b":"THE wall is necessary","commenter_a":"Hell no!!! I don't want to see a big freakin wall between my state (Texas) and Mexico (with whom we've been friendly for a LONG time). Way to go, Trump...maybe you can start a war with Mexico 😠 Brilliant!","post_message":"Agree or disagree: It's time to build Trump's wall at the border."},{"comment_id":"10157151513605231","commenter_b":"Thank u god bless all of his children with love","commenter_a":"He had a dream and we are still dreaming and look how far that has got us police still killing us and now we helping them and everybody's out for themselves king would be shaking his head because we have sold out, we have become a consumer race of people for every other race but our on everybody makes money off of us just look around you where do you spend your black dollars ?","post_message":"On April 3, 1968, Dr. Martin Luther King, Jr. gave what would be his final and most recognized speech. On April 4, 1968, he was assassinated by a coward who doesn't even deserve to be named. Dr. King's contribution to the Civil Rights Movement and to the advancement of black people cannot be ignored. Thank you, Dr. King. \"Well, I don't know what will happen now. We've got some difficult days ahead. But it really doesn't matter with me now, because I've been to the mountaintop. And I don't mind. Like anybody, I would like to live a long life. Longevity has its place. But I'm not concerned about that now. I just want to do God's will. And He's allowed me to go up to the mountain. And I've looked over. And I've seen the Promised Land. I may not get there with you. But I want you to ..."},{"comment_id":"470600046463909","commenter_b":"I will refuse! They have already done enough to erode away our great United States of America. They need to go far away from Washington!","commenter_a":"She is \"one ugly motherfucker\".......to coin a phrase.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"979482032090033","commenter_b":"I hope they fire this liberal girl.","commenter_a":"What do we expect from a company whose owner and chief executive is arrogant and unChristian!They just follow their leader. hope that more people boycott Starbucks. There are better coffee and cheaoer ones out there.","post_message":"Starbucks seems to be on a roll lately, and not in a good way! Should conservatives stay away from Starbucks?"},{"comment_id":"1157609597663965","commenter_b":"Go Grab your mother's Pussy","commenter_a":"Dumb a$$ people - looking to start a war here on our home land - won't be happy until they do - hope they are truly ready for it - and hope they know what that will really mean.","post_message":"BREAKING: A massive protest of President-Elect Donald Trump is happening in downtown Chicago. It started outside the Trump Tower and is growing @webpagelink"},{"comment_id":"10152940333217061","commenter_b":"@username shes a hoe","commenter_a":"Hi Guys :) I'm Ashley :) 19 years <3 , I m Single and beautiful <3 girl <3 please like my page :) in 2 secs and i'll send you a friend request and inbox you <3 you will never regret, :( i promise you, please support me by just 1 like <3 1 Like (y) = 99 Help <3","post_message":"Police: Jake Lloyd, the actor known for his role as young Anakin Skywalker in 'Star Wars', arrested: @webpagelink"},{"comment_id":"10153234639738701","commenter_b":"Portland should be really embarrassed","commenter_a":"Really??? With all the real people who have contributed their time and energy to the Parade over the years all they can come up with is a old smelly piece of rug???????????????????","post_message":"Just in case you were starting to think Portland's obsession with the #pdxcarpet was over..."}]
