[{"comment_id":"1466279580067766","commenter_b":"Yes!","commenter_a":"Yes !!! What choice do we have...?","post_message":""},{"comment_id":"10153113348589885","commenter_b":"A gun saved mine and my families life one night. Guns save more lives than you know . You disarm innocent people, murders will rise.","commenter_a":"This was a hate crime. We should also talk about gun control. This guy was a gun enthusiast. He killed them execution style. He had power over them. Gun power. Do you think he would have approached them if he didn't have a gun?","post_message":"A crowd gathered Thursday night at St. Louis University to pray for three young Muslims who were shot in the head Tuesday in Chapel Hill, N.C."},{"comment_id":"1174271395944428","commenter_b":"The real Hillary afraid that the porn industry wont donate money to her or maybe they have some film!","commenter_a":"Perhaps under the advice from Bubba, he's planning ahead! Lol","post_message":"Hillary Clinton refused to sign a pledge Monday that would protect children from exploitation by the porn industry."},{"comment_id":"10153246280989411","commenter_b":"Why there is nobody helping Palestine. Come on Russia or China. Could you plz give Palestine nukes. Let those two countries to finally start playing a little more realistic games.","commenter_a":"So they are trying to destroy them............fuckers...","post_message":"'Israel cannot maintain military control of another people indefinitely.'"},{"comment_id":"10154125037012377","commenter_b":"Women are smarter than you think. This is always from a man's perspective that we are weaker. Always remember women birth your armies, their children suffer and die. The hands that rock the cradle rule the world. And when they send troops home blind and crippled, it's the woman wives and mother that take up the healing the grieving and the praying. God made us special that way. Someone has to have sense.","commenter_a":"I hope that Trump comes up with some way to penalize the Media when they publish lies.....They should not be able to get away with it.....they put up pictures that are not true with the stories.....the media has become a very negative view on anything with Trump...they dont have the truth in them......I have high hopes for President Trump and do believe he will do a great job.....It is time for all to quit all tthe stupid protesting and join together to help America!!!","post_message":"Americans reactions to President Donald Trump's inauguration were positive with more people saying they are now more hopeful about the next four years than those who are less hopeful, a Gallup Poll reveals."},{"comment_id":"10155996223940354","commenter_b":"Take their citizenship away and deport.","commenter_a":"Black trash","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS. Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"10153727755939117","commenter_b":"@username If Trump were a cat, he would be licking his own balls.","commenter_a":"And the Republican leaders of the past, McCain, Romney, and the entire Bush family? They recognize a fraud when they see one and won't even bother attending, endorsing or having anything to do with a bully liberal like Trump.","post_message":"The list of GOP convention speakers includes a bunch of people better known for harshly criticizing Donald J. Trump, in some cases unambiguously pronouncing him unfit for the presidency. They say he's a \"con artist,\" \"narcissist,\" \"bully,\" and \"pathological liar\" whose candidacy is \"a cancer on conservatism.\""}]
