[{"comment_id":"10153162026679091","commenter_b":"Stephanie, he wants ILLEGAL immigrants gone. And Americans have been doing just fine before the influx of Mecican Illegals before and will after!","commenter_a":"He'll be crying when there is nothing for him to eat because its the immigrants that work the field for our food, and run our plants that provide our meat. He wants immigrants gone, he should be the first to leave. Give this land back to native American people, the earth was pure and clean. Be a leader Trump, lead yourself out","post_message":"Donald Trump has released his specific plan for immigration reform: @webpagelink"},{"comment_id":"10153169832344087","commenter_b":"Can you give an educational description of what is a liberal and a conservative","commenter_a":"Maybe he should have gave the same talk to the average liberal they are after all at the same mental stage as a second grader","post_message":"“The congressman chose to give an example of the current situation in Iran, and made some inappropriate comments about ‘Do you know what a nuclear weapon is? Do you know that there are schools that train children your age to be suicide bombers?'\" one parent said."},{"comment_id":"10153941813117042","commenter_b":"Cuz is not her child . evil face.","commenter_a":"My child is 8 n very timid n shy. The minute i find out some one hurt her in any way. God help them cause ima go after them.","post_message":"A day care director was caught on video hitting a child with toys. But then it gets even more disturbing from there.   Warning: Police described the video as difficult to watch."},{"comment_id":"1106803252686150","commenter_b":"She is a LIAR","commenter_a":"How could Trump have the nerve to accuse Bill Clinton of being abusive to women? Just listen to Megan Kelly: \"You called women slut, pig, dog and disgusting animals. How long will America put up with this low life of a man.","post_message":"“I don't really care about the Monica Lewinsky thing other than I think that Hillary was an enabler,” Donald J. Trump said. \"And a lot of things happened that were obviously very seedy, I mean, he was impeached for Heaven's sake!\""},{"comment_id":"942000482502078","commenter_b":"Celebrities = whores. Whatever pays the bills","commenter_a":"(And yet he keeps playing bond...?)","post_message":"Wow."},{"comment_id":"10153687678068487","commenter_b":"A drama queen is bad enough! But a stupid, manipulating drama queen can mess up your day! She's the wolf in sheep's clothing! Voters...do your own fact checking!","commenter_a":"Fiorina wasn't \"confused\". She was lying.","post_message":"No one can find the scene that Fiorina described at the debate in the Planned Parenthood videos."},{"comment_id":"1266650310018983","commenter_b":"@username so a WOMAN RAPED HAS MENTAL DEPRESSION FROM THE INCIDENT CANNOT NOW BUY A GUN TO FEEL SAFE AND ALL THIS WITHOUT A JUDGE OR DUE PROCESS???","commenter_a":"Meh, I'm glad he's trying something, anything to try and save one child. Better than 7 years of NRA owned congress not even acknowledging the Sandy Hook children. I'm a responsible gun owner that likes the idea of strong background checks and licensed gun dealers.","post_message":""}]
