[{"comment_id":"1083649161732572","commenter_b":"She belongs on the view , just her type 🐀🐀","commenter_a":"This woman is vicious & full of arrogance! Can't believe she can keep a man as her husband! Poor husband! How can he stomach this woman's character. She seems to be high all the time. Wonder if she's in session with Hillary before coming to her show. She deserves to take a hike & disappear from the Fox news screen so we can watch it again! Shooooooo Kitty!","post_message":"HOLY COW...!!!!!!  The TV fight of the century.  Newt tells Megyn she is obsessed with sex and calls her out for her pitiful coverage of Trump.  Megyn laces into Newt by telling him to get help with his anger issues.  It gets vicious.  VIDEO.  This will be the talk of the news tomorrow.  You get to see it now.  VIDEO  @webpagelink"},{"comment_id":"10153445751101782","commenter_b":"for the people that want abortions i ask you one question why did you allow yourself to get knocked up in the first place?","commenter_a":"Thank God!","post_message":"Gov. Mary Fallin has vetoed Oklahoma's anti-abortion bill."},{"comment_id":"1046205432190874","commenter_b":"Paul, I'm in Columbus, too. Do you think this is a Trump thing?","commenter_a":"At 11:35PM tonight, we lost our feed for your show locally on CBS affiliate WBNS. I missed your monologue, but I'm sure it was just an alternative coincidence.","post_message":"Tonight on The Late Show... from the film 'The Comedian,' actress Leslie Mann, an interview with comedian Lewis Black, and from Schitt's Creek, actor Dan Levy!"},{"comment_id":"10154882133170329","commenter_b":"Really people! No arguments please","commenter_a":"The correct term is Native American.","post_message":"\"I realized that half the world made such an effort to get what I am naturally blessed with.”"},{"comment_id":"10152653934397169","commenter_b":"A woman should never lose her chic!","commenter_a":"Go girl!","post_message":"Part of a growing trend of older fashion icons:"},{"comment_id":"10158094006710354","commenter_b":"Great job! This is why some illegals should be deported","commenter_a":"So sad.","post_message":"HORROR:"},{"comment_id":"955924071085730","commenter_b":"Jan St John...ROFLMAO!!!! James Taylor is a lawyer with no training in climatology ...he's a sr. Fellow at the heartland institute which draws major funding from the likes of the coke bros,exxon and a number of other oil&gas companies....this is the best you can come with","commenter_a":"It was 40 above in Alaska last week.","post_message":"TELL ALL YOUR FRIENDS"}]
