[{"comment_id":"876171829182663","commenter_b":"Moderate moslems DO NOT exist!","commenter_a":"YEP, They are ALL extremists, and should ALL be deported! Its simple!","post_message":"I'm not joking when I say this is the most important video I will ever share..."},{"comment_id":"10154146066447623","commenter_b":"@username Im against this executive order because it wasnt thought out very well at all and is just a blanket order to block everyone that is a citizen of certain countries from getting into America, even if theyve been here for years and just happen to be out of the US at the time. Im all for protection, but Trump's actions are based on nothing but his ignorance and fear. That is no way to live and that is no way to run a country.","commenter_a":"If DHS doesn't support this, isn't that a sign that maybe it's not the right thing to be doing? I'm pretty sure they're not a liberal organization, so this isn't a partisan issue. If you're scared of terrorists, I get that. But wouldn't it be better to open your mind a little and try to understand why so many people are against this?","post_message":"The Department of Homeland Security said Saturday it has suspended all actions to implement President Donald Trump’s immigration order."},{"comment_id":"10153423460374087","commenter_b":"@username You will be pleased to know that I will be running for president in 2036, with @username as my running mate. We will be running on the Republican ticket which should also please you. Donald Trump is a man of one line punches with no specificity as to how he will execute his policies. I don't believe that building a wall will solve our immigration problems and banning the immigration of Muslims into the United States is unconstitutional. The First Amendment states, \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.\" Banning Muslims from entering this nation goes against the beliefs of what our founding fathers envisioned for this nation. Now, I am not in favor of President Obama's policies and actions, but I do believe that there are much more suitable candidates for the office than Mr. Trump, at least until ...","commenter_a":"@username what politics have come to, smh","post_message":"Donald J. Trump's daughter Ivanka Trump says she may make her own political run one day."},{"comment_id":"1150774161677077","commenter_b":"She needs to be unseated","commenter_a":"Trump will get rid of the Democrats and Republicans that have been in the Senate and Congress way too long and Barbara Boxer is one to go for sure. All of a sudden because Hillary lost the election now the Electoral votes have to go, maybe if you picked a candidate that wasn't crooked and a continual liar you might have had a better chance. Enough of the liberal bulls--t accept the loss and move on.","post_message":"This comes after Hillary Clinton won the popular vote, but lost the election."},{"comment_id":"10153765423589170","commenter_b":"@username you are spot on 100%. You don't allow a foreign entity into your country and let them have an area nor let them \"work it out\". Because that area gets a little bigger then a little bit more before soon they are running the country.","commenter_a":"Rahm assisted his Muslim brother Obama in degrading the police when they did do their job. Now the police are afraid to do their jobs.","post_message":"The irony here is that it's HIS ideology that has cops afraid to do their jobs.  His ilk spent the last eight years calling everyone racists.  Now he has the nerve to complain about the outcome?"},{"comment_id":"496937747163472","commenter_b":"Put the hag in prison","commenter_a":"I like that picture of Hilliary, \"hands up, bitch, you're under arrest.","post_message":"New documents released shows incriminating evidence that could put Hillary away for good.  She is a terrorist. We need to act now.  Should Hillary Clinton be arrested for treason?"},{"comment_id":"391857781002516","commenter_b":"Animals! That's why they're in prison!","commenter_a":"They would live there no matter what the conditions are! They destroyed it now let them lay in it!","post_message":"The corrections officers could only watch as the thousands of inmates broke the heating, cooling, and ventilation systems, and forcefully shook the gates in the prison lawn..."}]
