[{"comment_id":"10158365855655500","commenter_b":"RIP Carrie Fisher.","commenter_a":"Who cares don't watch, pops that's four words.","post_message":"Fashion, Beats and Bling are WFLA Lila Gross picks. What are your three words to describe the Oscars?"},{"comment_id":"10154937889184885","commenter_b":"She hates white people","commenter_a":"Such hateful petty people. A day after celebrating the birth of your savior and half of you aren't following his example in the slightest. You should be ashamed, but I doubt you really are. Michelle Obama is a human being. Just like you and me. What ill will has she done to you, that you would meet her with such contempt? I am no Trump supporter and I worry about his lack of qualification, but I don't say mean, hateful things about his wife. If she is going to work on internet bullying she may need to start with those that support her husband.","post_message":"\"She's made an effort to wear accessible fashion,\" designer Tracy Reese says. \"I think Jackie (Kennedy) was a great role model but she wore a lot of couture, and things that most Americans could not afford.\" Mrs. Obama, she says, has worn both high-end and moderately priced fashion."},{"comment_id":"1716998008555343","commenter_b":"Me too. Can't concentrate at work","commenter_a":"Sleep in peace. You will be missed.","post_message":"This is what it sounds like when doves cry... #RIPPrince Prince"},{"comment_id":"720191621435846","commenter_b":"Peaceful muslims?? What in the hail is that??? They all believe the same! You and all the misguided people who liked your post get to be first in line for beheading!!! Dear lord do some actual research! There is no such thing as a \" peaceful Muslim\"!!!","commenter_a":"If it's true , hats off to them . We have been wanting \" peaceful \" Muslims to stand up to the \"radicals \" , maybe this is a start ????","post_message":""},{"comment_id":"1229126323813780","commenter_b":"Reaz Tiths tell us what @username has quoted about that book of peace.","commenter_a":"Islam does not teach us to kill others. But in real it is a religion of peace, although some are killing innocent Non Muslims in the name of Islam. What a shame! Islam teaches us to respect others beliefs & not to insult them for their religion. This is the Islam I've been taught","post_message":"'One child said a Muslim prayer and was spared, the other was killed'"},{"comment_id":"10156205584795354","commenter_b":"Right, blacks and immigrants are the problem. It was a white kid who went into a black church and shot and killed 9 blacks while they worshiped. It was a white kid who went into the Sandy Hook Elementary School and shot and killed 20 children while they were trying to learn. He also shot and killed 6 educators who were trying to teach the days lessons. It was a white man who went into a theatre in Lo. and killed people while they were watching a movie for enjoyment. It was a white man who went into the theatre in Co. and shot and killed people who were out for a night of entertainment.","commenter_a":"If people like her wouldn't say dumb shit like this, then most of the \"white people\" wouldn't be racist towards blacks. They just keep it going instead of trying to get to the problem, causing more anger and violence from within everyone.","post_message":"“Right now we declare, it’s open season on a motherf–king cracker. All you motherf–king crackers y’all need to watch your motherf–king heads.”"},{"comment_id":"10154295592708132","commenter_b":"A woman's ribs shouldn't show like that. That is not a healthy body.","commenter_a":"I think she looks great - no doubt about that but remember she has access to so may resources such as chefs, nutritionist, top motivating trainers, laser tightening, etc. Not to mention there is definitely not a daily 9-5 job in her day and don't forget adding in a few nannies to help out as well. All of these resources help alleviate stress and carve out time for you to focus on yourself. All that alone is a great cocktail for motivation.","post_message":"Spring has sprung for Britney Spears!"}]
