[{"comment_id":"1027451010661056","commenter_b":"You old bitch","commenter_a":"Free stuff...what they don't understand is they will be paying for it out of their taxes for the rest of their lives....","post_message":"This would be comical if it weren't so dang scary."},{"comment_id":"1849294941953444","commenter_b":"Illegals don't pay taxes, they may pay sales taxes, but one needs a social security card or a legal visa to get a legal job in America. Illegals are not immigrants, immigrants are people that came to the United States legally. American taxpayers should not have to pay for illegal activity, or anyone that came here illegally. I believe that all illegals need to go back to where they came from and return legally. If a child was born here from an illegal alien they need to go home with their parents, come back legally, they were born here illegally does not make them an American. All illegals should be thanking us for allowing them to stay for long, time for them to take what they have learned here in America and help the people in their homeland/country. Wait your turn like legal immigrants! No Mayor, NO state official, or ...","commenter_a":"Good for you NEW YORK!!","post_message":"\"This is New York. We are always New York.\""},{"comment_id":"10153659904056770","commenter_b":"PEOPLE GUESS WHAT SHE WORKS FOR HILLARY NOW...","commenter_a":"Interesting Demcratic take on LGBT, since it's rumored that Hilary herself might fall into this category!","post_message":"Recently leaked emails from the Democratic National Committee revealed staffers had some less than LGBT-friendly comments."},{"comment_id":"10154062439342541","commenter_b":"Too much fat around the waist can't grab that skank","commenter_a":"Big deal. There's a position waiting for her in the White House after January, 2017. She seems to have the required credentials/ideology that would qualify her for employment under that administration.","post_message":"The non-profit director who called First Lady Michelle Obama an \"ape in heels\" has been fired for good."},{"comment_id":"1071843699548997","commenter_b":"Lol stfu","commenter_a":"God Bless you Donald Jesus has CHOSEN you to lead our country !","post_message":""},{"comment_id":"10153634339640695","commenter_b":"Randy isn't even from the south. He's a Yankee. He has no say in whether it would come down or not. Just trying to yank your chains.","commenter_a":"take that dirty monument down!!!","post_message":"Instead of removing the carving, one councilman says they should add to it to better reflect Georgia history. What do you think?"},{"comment_id":"1097693670320210","commenter_b":"Triple gross, have their hair all over my sheets, NO WAY!!!!","commenter_a":"Gross","post_message":"One New York couple has successfully acquired a bed large enough so that they and all 8 of their rescue pups can sleep comfortably. \"They love to just be near us. So however we can make that happen, they're happy.\""}]
