[{"comment_id":"1185052468202276","commenter_b":"@username . Yes, it has worked out very well for me. My wife doesn't just not mind, she really likes my beard. As for the women \" that do were and are not interested\" in me- I couldn't care less, they are irrelevant. I have a beautiful wife. You are right in that everyone has physical preferences, I for one am not attracted to women with silicone breasts and/or mullets. Perhaps one day soon, when you hit the menopause, you might grow yourself a fine, full beard and be proud of it. All the best!","commenter_a":"If you can grow a beard, then why not? I really couldn't care less if someone finds my beard unsightly. You should be proud of your masculinity, not try and disguise it. I spend most of the daylight hours outside, the beard helps protects me from the elements and from those of a nervous disposition.","post_message":"Just one more reason to love beards!"},{"comment_id":"1383945224964701","commenter_b":"Go away lady","commenter_a":"She definitely needs a half dozen chill pills....","post_message":"Sen. Elizabeth Warren has taken to Twitter to attack what she calls presumptive Republican presidential nominee Donald Trump's toxic stew of hatred insecurity."},{"comment_id":"10153913133146130","commenter_b":"Wtf is a \"puff hoe\"?","commenter_a":"I get all of my political advice from rich Hollywood actors, said no human ever. This just made another 100,000 people vote for trump,, keep it up puff hoe,, you're helping!","post_message":"Nailed it, Angelina Jolie."},{"comment_id":"705952482887629","commenter_b":"#NeverKillary, #CriminalHillary, #Notwithher, #Trump, #MakeAmericagreatagain","commenter_a":"dont you wish people liked you like this????","post_message":"Donald Trump lied to the American people at least 58 times during the first presidential debate. (We counted.)"},{"comment_id":"10158070336085231","commenter_b":"There is no Muslim Ban. Ban is against potential terrorists not against Muslims.","commenter_a":"This is what discrimination looks like to the Black's, sorry to see another people of color experience this!","post_message":"The American people are putting their money where their mouth's are."},{"comment_id":"10153601261735861","commenter_b":"LOSER!!!!","commenter_a":"boomer","post_message":"Oklahoma State slips in the AP Top 25- OU moves up"},{"comment_id":"10154285829964641","commenter_b":"And all of you need to stop sucking this mans dick. He didn't even play today","commenter_a":"Props to Portugal but why does Ronaldo get to be front and center??...let the guy who scored the winning goal get the glory.","post_message":"Portugal gatecrashes France's UEFA EURO 2016 party... and all without Cristiano Ronaldo."}]
