[{"comment_id":"10153589357933984","commenter_b":"Just WHAT THE HE#% IS WRONG WITH AMERICANS, just like the poor Jews in Germany, we just sit back and let all this crap happen!!!","commenter_a":"Screw you","post_message":"The NAACP just made a stunning demand about this historical monument... this is shocking move.  Nobody thought they would go this far...  What do you think about the NAACP's demand?"},{"comment_id":"10153980476181336","commenter_b":"She's a United States Soldier . How dare they ? Iran will soon remember what respect is .","commenter_a":"When you are in a foreign country, you follow the laws, customs, and rules of that country. The female sailor is covering her head because that is what women do in Iran.","post_message":"Megyn Kelly: “What is our female sailor doing with a headscarf on?\"  Newt Gingrich: “She’s being imposed upon by a dictatorship that is deliberately humiliating her and deliberately imposing their value system.”"},{"comment_id":"10153694890631323","commenter_b":"What are black women always the ones who show so much ignorance","commenter_a":"If they aren't defined by it than why change your sex medically? Come on","post_message":"They could have made something positive, but the new Channel 4 series Girls to Men is demeaning to trans people on so many levels: \"Greater visibility for trans people should not mean even more close-up shots of genitalia and 'Ooh, don’t they look different – almost like real men' montages. It should be about taking the focus off surgery, suffering and sensation, because a transgender man is not defined by those things any more than the next person\""},{"comment_id":"602588076598438","commenter_b":"She's just a confused little child in a bad place with no morales","commenter_a":"She is a pervert and don't have enough sense to know it , she thinks Christianity is a fairy tale but she wont when she gets to hell","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"1142380192485341","commenter_b":"Wow are you serious they are trying to take out the Americans 1 job at a time and all the free handouts our government will give them. While our own government let's the Americans suffer by allowing them to free load off our system. Really they get social security for what . Americans get denied SSI while the immigrants step right up and no problem. really ?? Go Trump","commenter_a":"Welcome to the future!!!","post_message":"Nearly 40% of less-educated, working-age Millennials ages 18-29 don’t have a job.  That’s more than 15 million young-adult high school grads and high school dropouts who aren’t working."},{"comment_id":"694737757326072","commenter_b":"Unemployment is down because you can't get it silly woman.","commenter_a":"That's all of ya dumbass president who ya voted for should've just kept the house republican","post_message":"WHAT?!??!!?"},{"comment_id":"10153467924781350","commenter_b":"Men like them that way on women.","commenter_a":"U can wear skinny jeans that aren't painted on","post_message":"Don't be a fashion victim."}]
