[{"comment_id":"456764181180829","commenter_b":"Looking at that ugly bitch may stop people from going to McDonald's","commenter_a":"Ooh i just lost my appetite. Why would McDonalds allow this. She is so BSD about anything dealing with food and nutrition","post_message":"Would You Refuse To Eat An 'Obama' Burger? Comment 'yes' or 'no'."},{"comment_id":"10154331830756028","commenter_b":"They both need to be put in population in prison and let be what needs to be done to these two monsters they didn't protect that beautiful innocent baby","commenter_a":"I am beyond sickened by this....death penalty.....","post_message":"In the days before her death, little Leah Brown-Meza suffered multiple injuries to her head, a broken arm and a second-degree burn to the bottom of her foot. Her mother and her mother's boyfriend sat in blue jail uniforms as they listened to the evidence presented against them in court. @webpagelink"},{"comment_id":"10155070129079445","commenter_b":"Massachusettes as a state is no kill. They'd only euthanize if the dog was extremely sick or aggressive.","commenter_a":"I dunno with all these people saying take the dog to a shelter... Shelters euthanize dogs... I'd be afraid to leave one there. Maybe they thought this would be better it certainly got media attention.","post_message":"The pooch was found on the side of the road... but had food, clothing and blankets with him. @webpagelink"},{"comment_id":"768354383300233","commenter_b":"@username Go ahead and Kick the Tea Partiers and Trumpetiers out of the GOP, MARY JANE FAGALA! WHAT YOU WILL HAVE LEFT SHOULD BE ENOUGH TO HOLD A STRATEGY SESSION ON HOW TO REACH OUT TO DISAFFECTED DEMOCRATS, SOCIALISTS, COMMUNISTS AND LOTS OF OTHER \"ISTS,\" BUT YOU WILL HAVE LOST ALL THE POWER THAT THE TEA PARTY DELIVERED TO YOU. LOTS OF LUCK!!","commenter_a":"If the GOP think the people are ANGRY NOW,,,,just wait until they try a brokered convention!! It will be mayhem. The LAST NAIL in the coffin of the Republican Party!! You can take THAT TO THE BANK.","post_message":"A brokered convention seems to be all the talk in the Republican party right now, but there's a real split in who's supportive of the idea... Do you think Ted Cruz is right about this?"},{"comment_id":"1392116457753526","commenter_b":"Illegals DO NOT FREAKING qualify for SNAP or any Welfare!","commenter_a":"So, how many of these people are illegal?","post_message":"This state is preparing to kick roughly 30,000 people off food stamps."},{"comment_id":"10153626389226336","commenter_b":"Guns don't kill people husbands that come home from work early do.","commenter_a":"You need tougher idiot-control!","post_message":"\"I've got to do something going forward that makes her life meaningful and will always be with me. And this is the way to do it.\" – Andy Parker"},{"comment_id":"10153495487996770","commenter_b":"It's never a joke untill they come for you, then you want to cry, I'm just joking. So is that prison cell dumbass.","commenter_a":"This is just another instance, where Obama should be stepping up to this kind of talk!","post_message":"A #BLM sympathizer posted \"Death to all White Cops\" on Facebook but was completely unprepared for what immediately happened next. Then she did something even dumber!"}]
