[{"comment_id":"10153373038333855","commenter_b":"Kill this witch","commenter_a":"She wants every legal consequence possible so she can be a Christian Martyr!","post_message":"BREAKING: Kentucky clerk defies Supreme Court."},{"comment_id":"1365633703532878","commenter_b":"@username...Such a joke!!! Hillary should just accept it...it's over...Trump won!!!","commenter_a":"“Anyone not willing to accept the results of an election is a danger to democracy.” - Hillary Clinton","post_message":"As Wisconsin prepares for a recount..."},{"comment_id":"10154170781271491","commenter_b":"Oh I bet \"she\" can run alright .. run out of the white house next year take her kids and Obama with \"her\"","commenter_a":"What a beautiful,sane & facts ridden reply !","post_message":"Just because one Obama is preparing to vacate the Oval Office that doesn’t mean everyone in his family has to follow suit."},{"comment_id":"1235978386476227","commenter_b":"someone please give that nasty fat cunt a coupon to jenny criag.","commenter_a":"Get over yourself!! U need to go to the gym","post_message":"Entitled woman claims cashier give her a free drink because her grandmother was a slave. 'LIKE' if this is WRONG!!!!"},{"comment_id":"10154492827869497","commenter_b":"Who can believe this story?? After all the woman ?????","commenter_a":"hahaha","post_message":"Highlights Of President Bill Clinton's 2016 DNC Speech"},{"comment_id":"10154177550736509","commenter_b":"She was legal to have sex in those two states! End of story!","commenter_a":"Did he KNOW she was a minor? That should make all the difference.","post_message":"The 17-year-old girl's cell phone had evidence of \"inappropriate communications over the last several weeks between (25-year-old Steven) Sheerer and the minor,\" the prosecutor said."},{"comment_id":"1353412211336912","commenter_b":"Women outlive men because they don't marry women!","commenter_a":"Good grief, it's been known for eons that women have greater endurance, etc., etc. I'm reminded of a book written in the 1950s by noted anthropologist Ashley-Montagu, entitled \"The Natural Superiority of Women.\" The male anatomy excels in only one area: upper body strength, a left-over from prehistoric humans. Ashley-Montagu is not by any means the first to recognize and write about this. It should be obvious to anyone, really, when you recognize that, despite the physical ravages of child-bearing, women live longer than men.","post_message":"Questions about Clinton’s health just won’t go away — partly because they fit so neatly with longstanding sexist tropes about women’s weakness."}]
