[{"comment_id":"885881534804929","commenter_b":"That what she said.","commenter_a":"Her neck looks like huge lips.","post_message":"She shared explicit messages and pictures with pupil after the schoolgirl came out to her"},{"comment_id":"10153429543136491","commenter_b":"Not that it matters. A white woman would probably been cast anyway.","commenter_a":"WHY?! Are there no LATIN/HISPANIC actresses that can fill this role?","post_message":"Jennifer Lawrence will soon add another splashy biopic to her resume."},{"comment_id":"10154510747482446","commenter_b":"exactly wouldn't lower myself following that nasty woman.","commenter_a":"Hate mongering liberal degenerates that do what they normally do... Act like revolting pieces of trash that they ALL are","post_message":""},{"comment_id":"10153326495519714","commenter_b":"Yeah a little weird but seriously.\"omg he got a picture of my butt.\" so what?","commenter_a":"If I were the girl in the picture, I'd send a thank you to him for making my derriere famous. We should embrace curves! I'm sure he's just goofing around. People need to stop being so sensitive.","post_message":"Do you think Michael Bublé crossed the line with this Instagram post?"},{"comment_id":"10153394569638984","commenter_b":"What's her problem. Can't she walk straight.","commenter_a":"Crook ( I mean acorn or nut ) probly isn't far from the tree","post_message":"Shakedown artist Al Sharpton’s eldest child wants damages for “loss of quality of life,\" but looking at her recent photos, something seems a little fishy about the claim...  Are you glad to see the younger Sharpton outed for this?"},{"comment_id":"752518631516293","commenter_b":"AND YOU WANT AFRICAN-AMERICANS TO VOTE FOR TRUMP???? I PROBABLY TAUGHT YOU TO READ AND WRITE....LOL","commenter_a":"Who are you to say who is an american citizen? Were your parents born in AMERICA!....You defrauded all your workers to get rich!","post_message":"What I would do on my first day in office. #MakeAmericaGreatAgain  Text TRUMP to 88022 to join the #TrumpTrain"},{"comment_id":"10153438263919087","commenter_b":"Lol what a pussy","commenter_a":"I a Democrat and everyone is making a big deal out of this. Give them their snacks and they will leave.","post_message":"Congresswoman Donna F. Edwards slammed the media for condemning activists protesting the deaths of unarmed black men at the hands of white police officers as “thugs, criminals and drug users” while \"a group of armed men illegally occupying a federal building have been referred to as an ‘armed militia,’ or simply ‘occupiers,’ as though that behavior is acceptable in a nation of laws.\""}]
