[{"comment_id":"10153304672057377","commenter_b":"@username, you are just giving me TONS OF REASON ! As i said............, if there are no \"illegals\" to pick it up...............IT ROTTS on the ground.........! They are the ones who pick the fruit and vegetables !","commenter_a":"Trump will be in New York next year ! If anyone thinks that he can win the Presidency calling names to every minority in this Country, better have something else to sleep well because Donald Trump will never be President of the United States of America !","post_message":"The Rev. Franklin Graham Thursday suggested that Pope Francis \"build a bridge\" to Republican front-runner Donald Trump because \"who knows where he may be this time next year.\""},{"comment_id":"1289522947781268","commenter_b":"Spoiled racist brat","commenter_a":"Michelle Obama is the most bitter, most racist First Lady in recent history.","post_message":"First lady Michelle Obama implied this week that many Americans no longer have hope because of Donald Trump's victory.  Thoughts?"},{"comment_id":"1025596987461312","commenter_b":"Sure, blame the illegals. What do you Morons know?","commenter_a":"Kristen Kirschner","post_message":"Let's take a moment to remember that measles was ERADICATED from the USA in 2000. Nice job, anti-vaxxers."},{"comment_id":"10153882814429916","commenter_b":"You can tell she loves BREAD, not that she's inbred.","commenter_a":"Well just look at her, you can tell, she is inbred.","post_message":""},{"comment_id":"2004741493095269","commenter_b":"Because he does suck dick","commenter_a":"Why does he always look like he is about to suck a small dick?","post_message":"What an idiot."},{"comment_id":"1263844570323065","commenter_b":"yep. Sobbing now.","commenter_a":"Started crying before I even opened the article","post_message":"These Holocaust survivors just regained a lost part of their childhood. - Jon Comulada"},{"comment_id":"10153222402864705","commenter_b":"Well......let's see what happens. According to the books it wasn't Mance who was burned.","commenter_a":"Aren't we jumping to conclusions a bit here? (SPOILERS IN NEXT SENTENCE) We believed he was dead for a few chapters in the books too. Even Jon Snow was surprised when he came back. Couldn't that still happen?","post_message":"Game of Thrones may be playing by new rules this season (PS: spoilers spoilers spoilers)."}]
