[{"comment_id":"10152586371551135","commenter_b":"This is unacceptable. We need to stand up and love one another despite differences! Isis has definitely scared a lot of people. It would be nice if the Muslim community would make a statement in response to the killings around the world. Just to declare they are different of the terrorist and that what Isis has done is wrong. Then I think there would be a better understanding of Muslims. But even still there will remain evil people , like this man at Kroger. I'm constantly praying for our world. The world needs love. The world needs God. Blacks against whites. Whites against Arabs. Muslim against christian. Oh God help us all!!!!!","commenter_a":"Kelly Sleiman!!!!!","post_message":"Dearborn Police are investigating the beating of an Arab American man inside a local grocery store.  Police have also contacted state & federal officials to help investigate the attack.  STORY: @webpagelink"},{"comment_id":"1589692694655762","commenter_b":"Nothing racist about, I have the same problem. Some do not understand us and takes forever","commenter_a":"How can you criticize this? Who actually likes calling those?","post_message":"\"So I called up, under the guise I’m checking on my card. I say, 'Where are you from?' They say, 'We are from India.' Oh, great. That's wonderful. Thank you very much,\" Donald J. Trump said, signaling as if hanging up a phone."},{"comment_id":"10153574207499641","commenter_b":"And they are mostly Muslims !!","commenter_a":"that's because indians are breeding like rats","post_message":"If every candidate were granted an interview, the hiring process could take four years to complete, officials said."},{"comment_id":"10153241147678984","commenter_b":"They can go crawl up a hog a-- with there counter parts the muslims.","commenter_a":"All the way !!!","post_message":"The stuff liberals are already saying about Ted Cruz is just disgusting...  Do you support Ted Cruz in the face of liberal criticism?"},{"comment_id":"10154736458587300","commenter_b":"Clinton's own faith says she should not be elected. For it is told in the bible, \" For the love of money is the root of all evil; which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows.\" ...and Jesus said to the Money Changers that his house was a house of prayers and they had made it into a den of thieves\" There is no Baptist, Catholic, or any other Christian that should be voting for Hillary Clinton. Next class...Murdering children in the womb!","commenter_a":"Geraldine Donze Berlingeri this is amazing mom!","post_message":"Protons destroy cancer cells while avoiding healthy tissue and minimizing side effects."},{"comment_id":"10153655296938854","commenter_b":"Kerry is no better than anyone else, if he was involved...Then buddyboy...fess up. This whole situation is starting to smell like Watergate. Where's Woodward and Bernstein...Let them have a crack at it!!! Somebody needs to tell Trey Howdy you have full reign, do whatever you need to do, just get to the bottom of this!! And I'll bet you BARACK OBAMA'S NAME is all over it, just like Richard Nixon's was in Watergate. The major difference between the two is that PEOPLE DIED IN BENGHAZI. And just to show the impertinence of Hillary when she said, \"What difference does it make now?!!\" The difference is you Communist is that AMERICANS DIED YOU HEARTLESS WITCH!!","commenter_a":"Elijah Cummings is one of the dumbest mf'rs on this planet....voted for by a large number of even dumber mf'rs in his illegally gerrymandered district. He is so stupid, that he has no business in congress, and along with the rest of the liberals in Congress and the white house, he should be swinging at the end of a rope. He knows what he's done....we know what he's done.....","post_message":"Elijah Cummings: “Shockingly Disrespectful” To Subpoena John Kerry About Benghazi…"},{"comment_id":"1812875395612222","commenter_b":"@username......................your a @&$)(:; fool","commenter_a":"Such a BS! Obama made a deal to stop nuclear proliferation. Iran's compliance with our demands lifted the sanctions. So they got THEIR money. Eric Trump is total idiot thinking he knows anything about this matter.","post_message":"\"[President Obama] lied about it. He said that it wasn't ransom money... No different than when he lied about ObamaCare.\"  Yesterday on \"Sunday Morning Futures,\" Eric Trump accused President Obama and Hillary Clinton of lying to the American people."}]
