[{"comment_id":"432628273528434","commenter_b":"\"Riot Whores\" want to get paid? Tip: a smart whore always gets paid BEFORE the act!","commenter_a":"Soros wanted them, now pay them you socialistic pig!","post_message":"You might agree that these greedy people are missing the whole point."},{"comment_id":"547874932072371","commenter_b":"This bitch needs to get ready for jail!!!","commenter_a":"I think someone is throwing. Dinner !!","post_message":"WASH POST PAGE ONE SUNDAY: Hillary begins laying plans for White House agenda..."},{"comment_id":"953925358000546","commenter_b":"^^see Lisa....THAT'S good parenting.","commenter_a":"Thats messed up. what if the kid is actually struggling in school ? The dad should help him with homework and take his xbox away TEMPORARILY and see whats the kids real issue.","post_message":"This is a warning to all Xbox-playing students — do your homework!!!"},{"comment_id":"1626970717590041","commenter_b":"Just another dumb ass girl.","commenter_a":"Great job to a fellow veteran to set her straight. As a veteran we all lay our lives on the line and people like this little girl has no concept of what that means. It seems to me her family hasn't taught her or the school's she has gone to they need to wake up","post_message":"What an epic response by this Veteran!"},{"comment_id":"944373212266686","commenter_b":"Planned Parenthoods primary function is abortion. Enough said. Defund it.","commenter_a":"Only 3% of Planned Parenthood's funding goes to providing abortion. None of that money comes from taxpayers. Defunding Planned Parenthood means defunding millions of dollars in preventive care, cancer screening, contraception (which reduces abortion), STI screening, and other such essential services. I'm pro-choice, but if you guys have such a problem with abortion, why don't you just campaign to force Planned Parenthood to stop providing abortion services and leave everything else intact?","post_message":"Wow."},{"comment_id":"10153606624740667","commenter_b":"How's that gun free country law working out for them now ?? President Carter band Iranian Muslims during the hostage crisis & deported over 20,000 Iranian students, Iran is a Islam Islamic nation. Democrat's never called him a racist. US immigration Laws cover religious test for immigrants !! The AR 15 is not a military assault rifle & not fit for hunting deer or elk by some hunting laws, it's a singal shot gun !! Some pistol clips holds 15 rounds of ammo !! PS: Hillary is on record in support of a wall on US Mexican border !!","commenter_a":"So sad. :(","post_message":"BREAKING: Jo Cox has died."},{"comment_id":"10152632178256813","commenter_b":"Shut up Statist. No one deserves jail because of an unpaid weed ticket. Jail should only be for Killers, Rapists, and Burglars. Is that too much to ask?","commenter_a":"I see, so break the law, claim you're poor, and get away with breaking the law. Talk about \"privilege\". :/ Being poor is NOT a \"justification\" for not taking responsibility for one's own acts. No more than being rich is a \"justification\" for not being responsible for one's own acts. It's interesting how people complain that the rich aren't being held responsible for committing violations of the law, then claiming that the poor should NOT be held responsible. Rich person doesn't pay their taxes, they belong in jail. Poor person doesn't pay for legal fines and fees, they should just be entirely excused for breaking the law. Interesting.","post_message":"Kevin Thompson was jailed for five days because he couldn't afford to pay fines and fees from a traffic ticket. Last week, we reached a settlement that promises to prevent others from being improperly jailed for being poor in DeKalb County. @webpagelink"}]
