[{"comment_id":"1786796021584513","commenter_b":"Pathetic human being","commenter_a":"You are wasting your time.","post_message":"Madonna said she \"will not back down.\""},{"comment_id":"1752150585035881","commenter_b":"@username WE ARE GOING TO WIN HITH Hillary Clinton","commenter_a":"Interesting double standard. After all the horrendous things he's said about her this campaign, and the pathetic name calling, she offers one funny and spot on zinger and once again he has to have the last word.","post_message":"Watch the moment Donald J. Trump called rival Hillary Clinton \"a nasty woman.\""},{"comment_id":"323815704455468","commenter_b":"That's why we need someone who isn't a fool. Lindsey, go home, the adults need to take over.","commenter_a":"He should go home...he's really dumb","post_message":"Lindsey Graham needs to _______________."},{"comment_id":"10153881139329456","commenter_b":"Not Thugs , WORTHLESS TRASH!!!!! \\b","commenter_a":"Look all you people who argue what a thug is. Those two are thugs.","post_message":"Missouri police say the 2-year-old was left alone in his crib for 38 hours and reportedly died from hyperthermia."},{"comment_id":"1553198684973790","commenter_b":"LOSERS! ONLY TRUMP FOR PRESIDENT!","commenter_a":"Trumps my guy!!! GO","post_message":"Washington insiders and politicians have failed America. If I am elected President I will create jobs, end illegal immigration and #MakeAmericaGreatAgain. #Trump2016 Support Trump: @webpagelink"},{"comment_id":"10154018789591491","commenter_b":"@username littel girls like that crap thats why.","commenter_a":"Because boys can grow up to be whatever they want, but girls will grow up to only want to look pretty and wear cute clothes...","post_message":"Amy Schumer and Blake Lively are not happy."},{"comment_id":"10155447635791509","commenter_b":"She just needs to shut up. She's backing a rapist wife","commenter_a":"Wikileaks is Hillary's nightmare","post_message":"\"I can't believe that I am saying that a candidate for President of the United States has bragged about sexually assaulting women,\" Michelle Obama, speaking in New Hampshire, addresses the Donald J. Trump tape @webpagelink"}]
