[{"comment_id":"10153030735456378","commenter_b":"Weather this is true or not I don't know,but one thing I do know is none of us would be in the water if we saw what was swimming around or beneath us!!!","commenter_a":"Hoax","post_message":"REAL OR HOAX? A video showing a great white shark circling a surfer has gone viral... but now, people are questioning its authenticity. What do YOU think? Is it real or is it a hoax?"},{"comment_id":"1272162789512502","commenter_b":"She couldn't pay me enough, so I know Trump never tried. What a wrinkled up hag.","commenter_a":"They were all paid of course","post_message":"BREAKING! Newly leaked information shows Jessica Leads, who's accused Trump of raping her, has VERY CLOSE ties to Clinton Foundation.  This is NO COINCIDENCE! The timing of these accusations with these new facts about Leeds are TOO HARD TO IGNORE!!!!  Let's get 3,000 SHARES to spread the TRUTH about these rape accusations against Trump!"},{"comment_id":"10153266614821336","commenter_b":"California has been sicking for some time! One of the things liberals in CA like to do is drive companies out of the state! Also turn off the water to the small farmers, that put 40,000 farm works out of work! Keep building houses when they don't have the water to supply to them. Build a high speed rail road that no one wants or needs!","commenter_a":"Hard to find anything dumber than a California Democrat.","post_message":"Nobody's laughing, Rep. Loretta Sanchez."},{"comment_id":"10153603193848132","commenter_b":"That's cause her hair isn't real. It's fake as that tan she has. Your daughters are beautiful btw!","commenter_a":"My daughters are only half African American. Just thought I would lighten this post up some! Was tired of seeing negative comments.","post_message":"The race scandal continues."},{"comment_id":"1629456670679882","commenter_b":"Little Winnie bitch","commenter_a":"Toddler, bigot, lier","post_message":"Think quick! Then, click 'like' on your favorite answers in the comments.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"957930547633333","commenter_b":"If she finds it so offensive get another job quit inflicting her stuff on us","commenter_a":"Let her rot there.","post_message":"Some people just never learn."},{"comment_id":"1332904726749996","commenter_b":"It'll never happen - no minorities, no women. He would need 80% of all the white males in America to vote for him.","commenter_a":"This ad isn't even a reliable ad. It's a lying rag. Not been anything on news about this. So it's just another lie. Wake up idiots Trump will be President, no matter what so get use to it. Go Trump","post_message":"Wow...this isn't good for the Republican party."}]
