[{"comment_id":"903890666313022","commenter_b":"She better bring a big army.","commenter_a":"Well michelle said before she is out of the White House she is going to have guns taken away from the American people","post_message":"Outrageous!"},{"comment_id":"10153120259284411","commenter_b":"Ran like the bitches they are !!","commenter_a":"Marines don't flee. They were ordered home... there's a difference...","post_message":"Fleeing US marines handed over weapons to random Sanaa airport employees Yemen official"},{"comment_id":"1348467338501928","commenter_b":"Totalbitch","commenter_a":"Fake","post_message":"If you had one word to describe Hillary Clinton, what word would you use? (Be nice.)"},{"comment_id":"10152957950051051","commenter_b":"You know yall need too look back in historey books .do yall remember this wasn't the first flag made back then.","commenter_a":"That's right keep it up","post_message":"This man doesn't care what anyone says – he refuses to take down the decorations on his yard."},{"comment_id":"10153860714632098","commenter_b":"Ok people get real speeches are written for them and each one has something from another as their are only so many things that can be said in a speech such as this. No I am not in favor of our politics right now and feel that neither are a good choice for the US. But that aside do we not have more important things to worry about then what a speech writer gave to the wife of a running mate? Move on and let's get things going in a better place for our country, with so many loosing their lives recently I feel this is a low priority. Let's make change for good elect Mickey Mouse. Lol","commenter_a":"Give her a grade F - fail, flunked, fake !","post_message":"Melania Trump accused of plagiarizing Michelle Obama's speech"},{"comment_id":"10153746801086336","commenter_b":"Sure abuser.","commenter_a":"Go to court when you are told to and this won't happen. Simple.","post_message":"\"I have a one-year-old son and I'm trying to take care of him by myself! I'm begging you, please!\" the woman cried to the judge before she was led away."},{"comment_id":"648669105287702","commenter_b":"That Bitch be ugly!!!!","commenter_a":"So be it","post_message":"Whoopi Goldberg Says She Might Leave The Country If Trump Is Elected. Well I guess she's going to say goodbye. Will you happy to see her go?"}]
