[{"comment_id":"916358841790504","commenter_b":"Gee Sara. you really ARE a blonde.","commenter_a":"Even religious organizations support planned parenthood. Your turn, republicans. Now you can't even use your Christian arguments...","post_message":"Fifty-six religious organizations are standing up in support of women's health and rights."},{"comment_id":"10155845816789778","commenter_b":"Idiots...its about illegal immigrants and nothing more....drama is what they thrive on","commenter_a":"stupid is as stupid does. these people are here legally and commit no crimes, yet they do not want the president to deport those who would cause harm or come in illegally.","post_message":"Delia Goncalves was live with Jose Andres about #ADayWithoutImmigrants.   Several DC-area restaurants will be closing as a part of the movement."},{"comment_id":"1129299917126536","commenter_b":"Hillary is the real war on women.","commenter_a":"Together we Move Forwards Vote to President @username 2016.","post_message":"In ten years, we can generate enough renewable energy to power every home in America. #EarthDay"},{"comment_id":"10153612165593984","commenter_b":"My, my, my....Welcome Home....but, don't ever come back!!!!","commenter_a":"Way to go kenya","post_message":"Wow. These 10 million Kenyans just sent Obama a VERY bold statement about his visit... they aren't pulling any punches.  Obama needs to pay attention to this...  Good for Kenya..."},{"comment_id":"438573499666627","commenter_b":"@username. She's an idiot","commenter_a":"Another liberal sheep just voting for a female!","post_message":"Lena Dunham isn’t worried about Michael Bloomberg."},{"comment_id":"10153050664571615","commenter_b":"@username stfu","commenter_a":"Omg abortions cops killing people rape wtf were talking about a dog killer people come on try and keep up lol people make me laugh","post_message":"NEW FALLOUT: Last night we told you how the Animal Rescue League was distancing itself from The Pittsburgh Steelers following the signing of quarterback Michael Vick.   The second organization that has decided to suspended all activity with the team plus reaction from fans – tonight on Channel 11 News at 11."},{"comment_id":"708398475965965","commenter_b":"@username You a liberal Troll go away.","commenter_a":"Bullshit. Hillary Clinton is losing and losing badly. Hey liberal media....we're not listening to a damn word you say.","post_message":"Hillary Clinton regained her lead in the polls over Republican challenger Donald Trump after she accepted her presidential nomination Thursday evening."}]
