[{"comment_id":"1233839776660853","commenter_b":"Bet they sold a lot of papers....","commenter_a":"Couldn't care less.","post_message":"NYPOST runs naked pics of Trump's wife... again"},{"comment_id":"10153078285427217","commenter_b":"Melissa single mum? yep you can talk you trollop.","commenter_a":"Doesnt look to Australian to me. i wonder if she speaks english?.","post_message":"Thousands set out to #lightthedark 🔦"},{"comment_id":"10153227857229330","commenter_b":"I'd do the same thing - little punk needs a good whipping from his mom","commenter_a":"There is one parent in Baltimore that has her priorities straight.","post_message":"Mom of the Year? Check out what a mom did when she caught her son out rioting in Baltimore. ---> @webpagelink What would you do?"},{"comment_id":"10153463881442235","commenter_b":"Wow @username aren't you just a little dick. I bet you work at fux news you pathetic bitch","commenter_a":"This report was completely one sided. Where were the interviews of white people who are homeless. Bill you just showed your true colors. If this report is not racist i don't know what is. O'REILLY can kiss the center of my ass.","post_message":"This could be the most despicable, manipulative report Fox News has ever produced ..."},{"comment_id":"10153510348059411","commenter_b":"serious lips on that lady, shes got Grace Jones beat even.","commenter_a":"She has no ideas worth repeating-FIRE her.","post_message":""},{"comment_id":"10153092364080779","commenter_b":"how about enforcing the laws.....dumb bitch.....","commenter_a":"If I hear gun control one more time... I couldn't feel worse for the families that lost loved ones today, but laws are NOT going to keep law abiding citizens safe from criminals, the mentally ill or those that intend on dying in a blaze of glory.","post_message":"Calling America's epidemic of gun violence \"a political choice we make\" and declaring of the nation's political class, \"we, collectively, are answerable to those families who lose their loved ones because of our inaction,\" President Barack Obama delivered one of the rawest speeches of his presidency today in response to the Umpqua Community College shooting rampage. Read it below."},{"comment_id":"1142584762463568","commenter_b":"President not dictator","commenter_a":"Donald Trump nuclear war","post_message":"Indiana governor and Republican vice presidential nominee Mike Pence spoke at a rally at the Space Coast Convention Center in Cocoa, Florida."}]
