[{"comment_id":"10153491983334087","commenter_b":"Look , she the cuase of all wars in Middle East , Voted for war in Irag ,war in Libya, war in Syria. She removed notorious terrorist group AKA \" MOJAHIDEEN \" out of terrorist list , so they can go to Syria . She is Republican","commenter_a":"Elizabeth Warren Sinks Clinton's Hopes for Endorsement @webpagelink","post_message":"“The difference between [Hillary Clinton] and Sanders is that she didn’t wait until the campaign to champion gun violence prevention,” said Dan Gross, president of the Brady Campaign to Prevent Gun Violence, which is endorsing Clinton in the presidential race."},{"comment_id":"1113471052062455","commenter_b":"Spot on Allen West ... that's Donald Trump","commenter_a":"\"I want to raise a generation of young people who are devoid of conscience, imperious, relentless, and cruel.\" - Adolf Hitler Obama and Hillary read this and are following it. Hillary did her college thesis on this topic. Now you can add Bernie Sanders to the mix. From Alinsky's Book, \"Rules For Radicals\": How To Create A Socialist State by Saul Alinsky There are 8 levels of control that must be obtained before you are able to create a social state. **The first is the most important.* *1) Healthcare Control healthcare and you control the people* *2) Poverty Increase the Poverty level as high as possible, poor people are easier to control and will not fight back if you are providing everything for them to live.* *3) Debt Increase the debt to an unsustainable level. That way you are able to increase taxes, and this will produce more poverty.* *4) ...","post_message":"Allen West Republic @webpagelink"},{"comment_id":"10153519481412377","commenter_b":"She'll just continue to perjure herself if they do and unfortunately with the Obama DOJ behind her, nothing will ever come of it. Miscarriage of justice? You know it.","commenter_a":"This is such bull, it goes on and on and on. If they were going to do something , it would have been done.","post_message":"Agents will probably seek to interview Clinton soon, if they haven't already, former Justice Department officials said."},{"comment_id":"10153603093348132","commenter_b":"You are not that smart are you?","commenter_a":"DONT RUN","post_message":"\"We feel the system is working but it doesn't bring him back.\""},{"comment_id":"10152535175096813","commenter_b":"Start helping the ppl who are already here. How many Americans are out of work but Obama thinks it's better to hire illegals and give them driver license so they can vote. Yea sounds like he's buying votes for the Democratic party. When a soldier retires from the military where does he go. Shouldn't he have the first pick in a job then someone who crossed the border illegal.","commenter_a":"This was an ideology, not law...come here legally & you'll have no problems!!!!!","post_message":"All of our clients who were locked up in #immigration detention at Artesia are now getting a right to be heard. But there are others who deserve that chance, and aren’t getting it. @webpagelink"},{"comment_id":"1339410646123872","commenter_b":"Now I'm calling her a turkey! At least she could've let us see the eggs before she got comfortable again","commenter_a":"Somebody say bugs","post_message":"EAGLET WATCH! Getting closer, it could be any time now! We are watching and waiting as mom (Harriet) and dad (M15) take turns incubating the two eggs. Live video: Southwest Florida Eagle Cam MORE: @webpagelink"},{"comment_id":"10157375742785389","commenter_b":"The elections are rigged, may not be ACORN this time, but the MEDIA. Republican elite want to protect NAFTA, TPP and Global trade to keep filling their pockets with billions, Wall Street billionaire CEOs all from both parties are campaigning with criminal Hillary because she will protect Global trade agreements.. TRUMP is the only one who will bring back manufacturing, take back our technology which is now stolen by China as it was by Japan 50 yrs ago,stop letting immigrants invade this country, and stop giving money and our military lives away to build up foreign countries, Honestly, I don't care what he says or how he does it , because the USA has no more chances.WHERE IS CRIMINAL HILLARY GETTING JOB # 1 FOR 1 UNEMPLOYED AMERICAN ???? ,.....AND IT BETTER NOT BE A GOVERNMENT SERVICE JOB,PAID BY TAX MONEY TO CREATE BIGGER GOVERNMENT AND NO REAL UPWARD PROSPERITY ...","commenter_a":"Get used to it. Obama is supporting these terrorist organizations and Hillary will follow!","post_message":"\"We have an existential threat against the American homeland and the American people because of what this administration has done.\" Oliver North said the $400 million given to Iran will not only support terrorism, but will help Iran and North Korea move closer to creating nuclear weapons."}]
