[{"comment_id":"1136245463077540","commenter_b":"Amen","commenter_a":"I didn't vote for you the 1st. , or the 2nd. , time! Most all of us True Americans want you out. You, and your Obamanites have done nothing but take America to a all time low!!!","post_message":"YES!"},{"comment_id":"1343888468964236","commenter_b":"What's Columbus Day? Idk that dude.","commenter_a":"Possibility of a historic windstorm close to the 54th anniversary of the Great Columbus day storm? Wow. The weather here just keeps getting crazier!","post_message":"There is a one in three chance of a “historical windstorm for nearly all of Western Washington that would be long remembered.”  Take today to prepare for possible power outages and have some extra supplies on hand."},{"comment_id":"10153904419513984","commenter_b":"She's an ass","commenter_a":"Yeah the photo says it all...\"wha happened?\". Stick to acting, your moral compass is effed up. Be a kinder human being to your fellow humans, not to tou 1%er peers. Thiugh phony and shallow does fit you well","post_message":"She's the biggest female star in Hollywood right now, and she just made a sickening claim about Christians and the cross of Christ.  This is just disgusting.   She has a new movie out. Let's make sure she doesn't make a dime off of us!"},{"comment_id":"849701391772757","commenter_b":"No more Somalis","commenter_a":"Part of barack islama's let everybody from any country come in when they want. No bg checks.","post_message":""},{"comment_id":"550201625175196","commenter_b":"Totally agree","commenter_a":"Lisa you need these!","post_message":"Laboratory beaker wine glasses 😍  From @webpagelink"},{"comment_id":"10153644186381336","commenter_b":"If our courts allow Muslims who demand to be tried under Islam law, to actually be tried under Sharia law - why can't Christians demand be tried under Christian Biblical law? Courts allow it for Muslims. This raises a constitutional question - Under the 'Equal protection Clause' of the 5th and 14th Amendments, should Christians be afforded equal protection under the law - to be tried under Biblical law equal to Muslims demanding to be tried, and their case(s) adjudicated for crimes under Sharia law?","commenter_a":"Why can't another clerk do it ??? Problem solved !","post_message":"“Some people have said I should resign, but I have done my job well,” Rowan County Clerk Kim Davis said in a statement."},{"comment_id":"1082109501809405","commenter_b":"Illegal refugee returns?","commenter_a":"what about the human rights of the children and women raped and molested by islamic immigrants ??","post_message":"Amnesty Secretary General Salil Shetty said that short-term national self-interest and draconian security crackdowns had led to an \"unprecedented assault on human rights\" in 2015. Read more: @webpagelink"}]
