[{"comment_id":"10157370299475725","commenter_b":"@username Here in the Houston area too. This is wrong. Build the wall!!!!","commenter_a":"I thank God for Mr.Trump, being I live here on the border in the San Diego area, we need to take our country back, illegals are everywhere, coming up here to have there baby's. its so wrong! Please help us","post_message":"This is a MOVEMENT - to take back our country! We are going to go non-stop -- all the way up to November 8, 2016 --- and beginning in January 17th, we are going to MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"10154522869261051","commenter_b":"The only thing Melania will do as first lady is give free head and hand jobs","commenter_a":"He can't handle being President is a joke just like his supporters he is being a reality show president","post_message":"This is not what Donald Trump wanted to hear today."},{"comment_id":"10153483472878188","commenter_b":"How can he even be called a woman when he still has his man parts?","commenter_a":"I cannot phantom bestowing the Arthur Ashe Award to this person that has done nothing to deserve it. nOTHING","post_message":""},{"comment_id":"1707811955905494","commenter_b":"Sara are you looking in the mirror while you type???","commenter_a":"Yea its stressing me out my gosh what more does this man have to do before he actually gets in trouble??? OH AND THE FRUSTRATION THAT WE THE PEOPLE OF THE USA HAVE NO VOICE","post_message":"Two-thirds of Americans say that the future of the nation is a significant source of stress, according to a new poll."},{"comment_id":"10153260257844614","commenter_b":"Signed!! And shared!!!","commenter_a":"Let's start a petition to ban this person. Apparently not fit to perform the duty","post_message":"Gabriel Fernandez parents allegedly beat him to death after dousing the little boy with pepper spray, forcing him to eat his own vomit and locking him in a cabinet with a sock stuffed in his mouth, according to court records. Now, the Department of Children and Family Services supervisor who was fired after it was determined he missed opportunities to save the 8-year-old Palmdale boy is close to getting his job back. Gregory Merritt was among those who decided to close Gabriel case shortly before his death even though he knew the boy had written a suicide note and had a BB gun pellet embedded in his chest. A civil service panel recently voted unanimously to reinstate Merritt, imposing a 30-day suspension in lieu of termination, the L.A. Times reported. Read KTLA story here: @webpagelink"},{"comment_id":"508965689228025","commenter_b":"The Dem's blocked Bushes nominations when he still had 18months to go. What goes around comes around. Oh yea, they forgot that fact.","commenter_a":"Eat shit and dye hillary.","post_message":"Agree or disagree?"},{"comment_id":"1674023152845757","commenter_b":"Funny","commenter_a":"Idiots!","post_message":"Just take a guess which Democrat Senator said this..."}]
