[{"comment_id":"10153738132321756","commenter_b":"Awesome. catch 'em.","commenter_a":"Loved this story today! Thank you @username! Very interesting and I can't wait to watch the documentary.","post_message":"To track the route of poached tusks, investigative journalist Bryan Christy commissioned a taxidermist to create fake ivory tusks, which he embedded with specially designed tracking devices."},{"comment_id":"1531352266898026","commenter_b":"'She' don't have dicks, its a he","commenter_a":"Can we please stop misgendering her?","post_message":"'I had tits and a dick and was tattooed and alternative, and I could come over and over again on camera.'"},{"comment_id":"10152788579600736","commenter_b":"Yes, dumb ass lady","commenter_a":"Good!!! @username Kevin Heard","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"769057633200701","commenter_b":"She deserved to be sterilized or shot.","commenter_a":"AMAZING THAT THEY WERE THERE TO HEAR THE BABY THANK GOD, BURY THE MOTHER NOW ALIVE! ANGERS ME","post_message":"A newborn girl thought to be only 36 to 48 hours old was found  alive in Compton on Friday.   The baby muffled cries led sheriff deputies to find her buried under pieces of asphalt and rubble inside a crevice near a riverbed.   Detectives are now asking anyone with information to come forward.  this post to alert others.   Read KTLA story here: @webpagelink"},{"comment_id":"967371493322599","commenter_b":"Yes yes definitely. I'm thinking a hot tire around the neck for the rhino poaches would be justice served.","commenter_a":"Maybe we need to do that to the Rhino poaches here in South Africa...","post_message":"Chinese villagers beat dog thieves for NINE hours and tie the dead animals' bodies around their necks"},{"comment_id":"1765614553704778","commenter_b":"Congress has the power to IMPEACH HILLARY now for all the massive lies & corruption at its highest level. Ask your Congress person WHY THEY ARE NOT?? Where is the integrity of Congress?","commenter_a":"So the White House knew full well about Hillary's email after all .. one false narrative after another. This nation cannot survive another 4 years of corruption like this!","post_message":"'The IT professionals who whitelist devices at places like the White House only add the email addresses authorized by management.'"},{"comment_id":"10153356804576336","commenter_b":"The words that come to mind wouldnt be appropriate for FB or for a lady to say....smh.","commenter_a":"Obuttma is a hug a thug..what is wrong with his brain⁉⁉","post_message":"The number of detainees at the Guantanamo Bay detention center is now 116, compared to 242 when President Barack Obama took office."}]
