[{"comment_id":"1201785943175748","commenter_b":"The unvaccinated will always be a problem...you know why? Because you're all fucking dumb as shit! That's why.","commenter_a":"From another article. It's not the unvaccinated that started this. It's the vaccinated. 'The WHO said the two cases were in the southwestern part of the country -- bordering Romania, Hungary, Slovakia and Poland -- and that the strain responsible, vaccine-derived poliovirus type 1 or cVDPV1, may still be a threat to the region.'","post_message":"Vaccinate your kids folks."},{"comment_id":"10153000609386491","commenter_b":"The Russian lady nailed it. For me, I don't want kids and that is unacceptable to so many people. She only wanted one and that was JUST AS UNACCEPTABLE! We know what we want our families to look like. Trust us, we're women!","commenter_a":"I respect your decision to not have kids. Some people don't. It's an important job that should only be done by people who want you. BUT, I think making a decision like that at 28 years old was a little rash. A lot of things change. I had my daughter when I was 39 years old. Things that make you happy in your 20's are not necessarily going to be the same for the rest of your life. And, don't be sad for people who tell you that there is no greater love than one for a child. There isn't!! Don't knock it just because you don't understand.","post_message":"“What I want is to be happy.”"},{"comment_id":"10152963504506130","commenter_b":"What was she thinking? Dumb model!","commenter_a":"Well they can't fire her now that the world is laughing at it. PR, people, PR.","post_message":"Whoops."},{"comment_id":"652127268253788","commenter_b":"To you Mrs. Michele Obama I say name me just one all white college. I am not racist, I do have several black friends. Being white of course I do have more white friends, then black friends. They seem to under stand my point. But for blacks to say they can't go here or there. I don't see those barriers. I wish we all can stop this racist name calling g and pointing fingers, at each other. I know I can name at least 4 black colleges. I just want to know if anyone can name me just one all white college.","commenter_a":"why is she there? go home & drink some tea","post_message":"A race baiter who is not proud of her country."},{"comment_id":"10152728783180950","commenter_b":"No China, it comes from China !","commenter_a":"Florida.. of course..","post_message":"'We're starting to see a rash of cases of a syndrome referred to as excited delirium.'"},{"comment_id":"10155018116889371","commenter_b":"She broke the Law, simple as that","commenter_a":"Wait, did Kelleyanne get a new job? Is she now a spokeswoman for Ivanka? 45 will have to fire her. She can't do two things at once. Especially since at least one would be illegal.","post_message":"This is completely unethical and may even violate federal law. Kellyanne Conway—counselor to the President of the United States—just went on live TV to urge people to 'go buy Ivanka's stuff.”"},{"comment_id":"607266949431150","commenter_b":"You are So Right. Walter Biscardi Jr","commenter_a":"Wow, that is a match made in heaven. Just when you thought it couldn't get any worse than McCain / Palin, the Republican Party proves us all wrong again......","post_message":"Just in: Ted Cruz will name Carly Fiorina as his vice presidential running mate, according to two sources."}]
