[{"comment_id":"741381376052440","commenter_b":"Big ugly cow, let her bitch.","commenter_a":"So go to another store, what's the big deal?","post_message":"Welfare Queen Goes BALLISTIC After Seeing THIS Sign At The Grocery Store  Let her be mad, this is what she deserves.  Are you sick and tired of entitled welfare leeches?"},{"comment_id":"1022450851126484","commenter_b":"And let's not forget, all of the terrorist attacks on United States soil have been committed by less then 100 Muslims. How many more United States citizens must die before this insanity is stopped?","commenter_a":"How about we see how she rules on things before we pass judgement? If her rulings are in accordance with the laws then who cares. If she starts using Sharia law to pass judgements then we can raise an issue.","post_message":"This is why we can't have nice things...but SERIOUSLY!"},{"comment_id":"1207855142586053","commenter_b":"I was going to reply but you guys have it under control. Stupid bitch","commenter_a":"Hahahaha!!! So much for Freedom when you are forced to stand. If folks cant decide for themselves, then it isnt freedom. Im fairly confident my father died for her right to sit if she feels ashamed of her farce of a military...even when one is enlisted. (I eagerly await your ignorant attacks.)","post_message":"A Navy sailor made national news when she decided to film herself not standing for the flag. Now, she's in trouble... here's the swift justice she received.  Do you think she got what she had coming to her?"},{"comment_id":"10157615901290389","commenter_b":"What about the arrests of all those that beat up and tried to burn people alive?????","commenter_a":"The reporters should have asked the protesters if they had a job etc.........","post_message":"Breaking News: A suspect has been arrested in the shooting death of a protester during rioting Wednesday, Charlotte's police chief says."},{"comment_id":"10153247148866130","commenter_b":"I am educated and that's my opinion and I stand by it !!!!","commenter_a":"I don't believe in post pardum depression !!! I believe it's women loosing their precious freedom and freaking out about it !!! That's why there are a limited amount of cases!!!!!!","post_message":"New research could allow women to get help before they even give birth"},{"comment_id":"1723525614585873","commenter_b":"Brady Wix Baillee Schott","commenter_a":"Elias Deltoro Ryan Michael","post_message":""},{"comment_id":"550201625175196","commenter_b":"Totally agree","commenter_a":"Lisa you need these!","post_message":"Laboratory beaker wine glasses 😍  From @webpagelink"}]
