[{"comment_id":"10156137722715093","commenter_b":"(If we support refugees by letting them into our country ISIS wins.","commenter_a":"And if we accept Syrian refugees without adequate screening America loses.","post_message":""},{"comment_id":"10154183673293132","commenter_b":"It's usually the accuser that's doing the cheating. Good for her for getting rid of that douche.","commenter_a":"The same thing happened to my best friend when she started to make a healthier lifestyle for herself. Her now ex wouldn't support her at all! She was supposed to come to the gym with me one day and completely bailed out because she was fighting with her a**hole boyfriend. Turns out he told her that she's fat, will always be fat and that there was no point in going to the gym with me when she'll quit anyway. Now I wasn't aware about what he told her until recently because she was so ashamed of what he told her and knew I'd bash the crap out of him. He'd also accuse her of cheating every single time she went out or \"joke\" to her about texting other guys whenever she pulled her phone out. He was the one who ended up cheating (or so we think but I'm sure ...","post_message":"Alexander's husband started calling her \"fat\" after she dropped weight to save her health."},{"comment_id":"10153917677820695","commenter_b":"Is that the guy walking/running or it's the photo of a car he supposedly driving?","commenter_a":"Police just released this surveillance photo of the man, who was driving a silver car. They say the victim was a 65-year-old woman.","post_message":"#BREAKING: Officers are searching for the man who sped away from the Walmart parking lot.  We have a reporter on the way to the scene and will have a live report on the Channel 2 Action News Nightbeat at 11."},{"comment_id":"1030591920403417","commenter_b":"Sorry, obama was a bad idea, and hillary was worse.","commenter_a":"Of course it's not. We knew what he was going to be, but his voters were too stupid to listen. They refused to heed either his own goddamn words, or the words of anyone else saying \"THIS IS A BAD IDEA.\"","post_message":"Trump is assembling the wealthiest cabinet in history — so wealthy that its members have more money than the bottom 1/3 of American households combined. That does not sound like an \"anti-establishment\" administration to me."},{"comment_id":"1007821319338322","commenter_b":"She's a piece of work.","commenter_a":"She is nothing but a conceded witch, only standing by her unfaithful husband because he was the POTUS, and therefore a untrustworthy, spiteful person who only cares about herself. I see a demon in her when she laughs!!!","post_message":"The book claims she repeatedly screamed obscenities at her husband, Secret Service personnel and White House staffers — all of whom lived in terror of her next tirade."},{"comment_id":"10153329997574342","commenter_b":"Thanks, Becky.","commenter_a":"Great picture Reed","post_message":"What a fantastic photo sent in by Reed W.  It's a shot of the sun coming up over the HPD Memorial.  Reed posted it to honor HCSO Deputy #DarrenGoforth.  @webpagelink"},{"comment_id":"649975575168534","commenter_b":"God Bless Heal Comfort Renew & Keep that poor innocent child...as 4 Them(Mr Swollen & Miss Crazy Lookin) ..Vengeance is Mine said the Lord!!!","commenter_a":"😡😡😡😡","post_message":"True tragedy. A 4-year-old was found beaten and zip tied to her bed. Not only that, she didn't know her own name and told police she thought it was 'Idiot'."}]
