[{"comment_id":"10152591855036636","commenter_b":"An attractive white girl dies. Everyone loses their minds.","commenter_a":"Oh dear . Was going to say . Oh my God . Hmmm. There are many people out there that need help . Just look around and you will be amazed . Some think that is the only way out . Look deep before before you criticise .","post_message":"Tragic."},{"comment_id":"1067484166661144","commenter_b":"Ignorant woman!","commenter_a":"traitor","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response."},{"comment_id":"718460845008873","commenter_b":"never happen... if they couldn't massage their egos with those little golden idols... their would dry up and blow away.... or perhaps blow each other (y)","commenter_a":"Oscar - a trophy given by actors to actors for being actors. Like it makes the world a better place - NOT.","post_message":"Hollywood SCUMBAGS Might CANCEL the Oscars to Protest Trump"},{"comment_id":"10152879286473961","commenter_b":"Only ridiculous and delusional if you think like a liberal Democrat.","commenter_a":"We've had 6 years of progressive liberal foreign policy. It can be summed up as alienate our allies, embolden our enemies, abandon our gains and weaken American prestige throughout the world. Obama has managed to squeeze this in between rounds of golf.","post_message":"It’s time for progressives to outline a coherent, proactive foreign policy vision. Check out my op-ed on Medium where I share my ideas and add yours at www.chanceforpeace.org."},{"comment_id":"10152885159374342","commenter_b":"That witch would be 6 ft under! !!","commenter_a":"@username lol","post_message":"A 30-year-old woman faces criminal charges after a video surfaced that appears to show her storming onto a school bus and slapping a 5-year-old she believed was bullying her child.  FULL VIDEO/STORY --> @webpagelink"},{"comment_id":"10153189678699342","commenter_b":"Its just a restrainin b device the kid will learn to be still nithing wrong here ppl get upset about anything ive had to ohysically jold my 18 month old down to get his shots this would have been better","commenter_a":"There is the option of oral sedation.","post_message":" couldn see my kid in the body bag just strapped down to the bed, I couldn handle it.\"  A man heard his daughter screaming during a dental checkup and then found her like this: Restrained in place with a device known as a \"papoose board. It's legal for dentists to use them."},{"comment_id":"1729203870680375","commenter_b":"@username Hillary still lies but that's true of most people who are liars. Dr. Carson must be desperate to dredge up a case this old.","commenter_a":"It's too bad these supporters, like Dr. Carson here, doesn't go after the things that Trump says and does everyday instead of something Hillary did 35 years ago. I'll bet a lot of us could dig into our pasts and find things we could have done or said better but yet we're going to vote for Trump, who is supposed to have maturity and says the most mean spirited things any Presidential nominee has ever said and he says these horrible things practically every day.","post_message":"Another woman from Clinton's past is speaking out."}]
