[{"comment_id":"10153535690187235","commenter_b":"Smh then leave America . most people who care about a lion will definitely care about a person .... They are both worthy .","commenter_a":"Because the lion will see actual justice and the same can't be said about Sandra or any other person who has died while in police custody......how sad is America smh","post_message":"Someone had to say it ..."},{"comment_id":"10154256686314641","commenter_b":"What a horrible woman.","commenter_a":"i'hve ,ever seen something like that until she was suffer from mental illness","post_message":"\"Mr. Sheats will have to live the rest of his life with this horrible memory.\""},{"comment_id":"1152822888099590","commenter_b":"Hillary is a liar, a cheat and cares more about money then Americans.","commenter_a":"Another embarrassment p***y grabber to the country...","post_message":"JUST IN: Donald Trump Jr. will be speaking at ASU on Thursday at 2 p.m. MORE: @webpagelink"},{"comment_id":"519430408242325","commenter_b":"What do expect from narcicistic bullies? They steal cheat etc...go figure....most poor folk who steal get arrested..why not trimp chimp rabid rat","commenter_a":"Well it's nice to see how Trumplestiltskin would use Meredith McIver as a scapegoat for that plagiarized speech that dipstick Melanoma Trumplestiltskin gave!! C'mon, surely you can see through the Trumplestiltskins I mean honestly am I the only one!? LOL!!","post_message":"Meredith McIver is listed as a co-author with Donald J. Trump on several of the books he's had his name on spanning more than a decade."},{"comment_id":"1762485630649940","commenter_b":"In the world of medicine, an incorrect diagnosis could possibly be as good as death. So in this case, yeah. Alternative medicine does kill.","commenter_a":"\"Alternative medicine kills\" what the heck?! It didn't kill her, sure it didn't save her, but it certainly wasn't the cause of her death.","post_message":"Being vaccinated could have saved this child. Being taken to a qualified medical doctor rather than a quack could have saved this child. Alternative medicine kills."},{"comment_id":"982549498449953","commenter_b":"Ladies?","commenter_a":"those Ladies need to get off the air and off of their high horses","post_message":"There's even more to that disgusting segment than we thought..."},{"comment_id":"938755412831598","commenter_b":"If she's a white lady, I'm a white lady.","commenter_a":"I am surprised she still has those white teeth in her mouth wow.","post_message":"Let's be honest. If this woman was black, she wouldn't be smiling for a cute little mugshot...because she'd most likely be dead now. #WhitePrivilege"}]
