[{"comment_id":"10152843821379440","commenter_b":"And what teams did you watch in the playoffs","commenter_a":"peyton manning and the broncos superbowl 50 champions :)","post_message":"Peyton Manning and Denver Broncos are working on revising his contract, which could explain why there's been a perceived delay in him formally announcing his intention to return in 2015. dpo.st/1LJlYy4"},{"comment_id":"628508020691140","commenter_b":"Put her out of the white house","commenter_a":"Michelle Obama is a awesome person she certainly a lady of class.","post_message":"Michelle Obama has just broke the last straw. She should have been kicked out of the White House a long time ago. Do you think Michelle Obama is the worst first lady in history?"},{"comment_id":"10153102217682994","commenter_b":"Thugs","commenter_a":"Thugs","post_message":"Authorities say a modern-day 'Bonnie and Clyde' situation is unfolding in the Southeast right now."},{"comment_id":"467950796728834","commenter_b":"Don't deport them-KILL THEM! They will only return if we don't . Simple truth","commenter_a":"He'll yes. Send them back were they came from. We are running out of bed sheets. Lol","post_message":"Do You Support Muslim Deportation In The United States? Comment 'yes' or 'no'."},{"comment_id":"10153314569635950","commenter_b":"Lol yup","commenter_a":"Trump is great at selling fear. Notice how there is almost a \"Trump's fear of the week\" going on? He's great at pitching things and selling himself. Republican voters are eating this up because they like to be scared because they love having an excuse to fight someone or something. Go ahead and cling to your guns and foam at the mouth screaming about the next conspiracy,. I'm over here sipping coffee and watching the GOP sink like the Titanic.","post_message":"\"I don't like anything having to do with changing our Second Amendment. We have plenty of rules and regulations.\""},{"comment_id":"10154169882022061","commenter_b":"Would you rather me say, \"stop your whining and suck it up buttercup!\"","commenter_a":"Good grief, you people kill me. Like it or not he is the next POTUS. Stop with the bashing. If you live in America then he is your President and you will benefit or suffer like the rest, but for crying out loud give him a chance.","post_message":"WATCH: Rick Perry, President-elect Donald J. Trump's expected pick for Secretary of Energy, famously forgot he wanted to abolish the energy department in a 2011 debate: @webpagelink"},{"comment_id":"1738890906325401","commenter_b":"Why no handcuffs? If i break the law and admit to it I'm no longer culpable? This should be challenged in every courtroom.","commenter_a":"California's Latino population is out of control. There are more Hispanics in California than there are people in 46 other states. 30% of all LEGAL immigrants come from Mexico. It's not \"diversity\" taking over, its misogynistic Hispanic rape culture being dumped on this country, and the democrats don't care how many little girls are raped & murdured and beaten & beheaded and sold into slavery & prostitution as long as they get millions of new voters. The age of consent for sex in Mexico is 12. In their culture it's ok to have sex with children. Not only that, these people are putting themselves in enormous risk, dying in the desert, and then we pay for them when they get here. It's madness! The majority of legal(51%)and illegal(72%) immigrants are on welfare according to the center for immigration studies. The number of immigrants on welfare should be 0! New report ...","post_message":"Note the swipe she took at Donald Trump..."}]
