[{"comment_id":"10153357300516051","commenter_b":"@username what part of illegal don't you get! They come here illegally & then have anchor babies which the government pays for & that includes the whole family while the father works under the table! We are spending millions of dollars on illegals & not just Mexicans when we have our own US Citizens who need our help!!! They are breaking the law! Period! CAN'T WAIT FOR A NEW PRESIDENT TO CHANGE THIS ONCE & FOR ALL!!!!!","commenter_a":"If they are born in USA, they deserve their birth certificates. TEXAS, the most ass backwards state there is!!!","post_message":"Right decision or wrong decision?"},{"comment_id":"10153745269073984","commenter_b":"that bitch needs to be in prison, hell yeah she and this country need her to just go away.","commenter_a":"Yes. She is wasting our time!","post_message":"A Fox News correspondent just revealed one surprising thing about this Hillary event that you won't see on TV, and it's definitely an embarrassing moment for the Clinton campaign.  Do you think Hillary Clinton should drop out of the presidential race?"},{"comment_id":"974691752568165","commenter_b":"Lol.","commenter_a":"He has a point.","post_message":"\"You're a despicable human being.\""},{"comment_id":"10153231132726336","commenter_b":"they should leave and not allowed back","commenter_a":"Look all black","post_message":"\"If you don't like what that flag stands for... leave!\"  On 'Fox & Friends,' Medal of Honor recipient Dakota Meyer called for a social media campaign to counter a movement encouraging Americans to stomp on the flag."},{"comment_id":"10155487950195354","commenter_b":"Then will she pay for all her vacations, her clothes, her helpers!","commenter_a":"44.4 Million on vacations alone...She need to pay that back! ..........She's NOT an elected official.........","post_message":"“I want a big paycheck for Michelle.”"},{"comment_id":"10153919889436955","commenter_b":"Trump is the only one who will throw out all of the illegals and anchor babies too stop the influx of Muslims","commenter_a":"Rubio has supporters?????","post_message":"POLL: Who will Marco Rubio supporters vote for?"},{"comment_id":"558350940997625","commenter_b":"TRUMP 16 the rest are weak ! Non presidential . The to Cubans will open our borders to Cuba Canada and Mexico because there parents were illegals also . Period","commenter_a":"Donald J. Trump 2016","post_message":"\"...a man who has a multi-decade history of exploiting the immigration laws to take advantage of the little guy is not someone we can trust to stand with the working men and women of this country.\""}]
