[{"comment_id":"10153486843809091","commenter_b":"I hope his whole family is murdered in front of him","commenter_a":"Good!!!!","post_message":"JUST IN: A teen  from Paterson who was involved in a 'knockout game' attack posted to social media has turned himself into police. --> @webpagelink"},{"comment_id":"494982004030385","commenter_b":"The towers that Donald Trump built ... Border Patrol endorses you to build that wall too, Mr. Trump ... A BUILDER ... not a destroyer ... of American liberties/freedom FOR POTUS!!! @webpagelink @webpagelink #DONALDTRUMP #POTUS #REPUBLICANPARTY #GOP #2016ELECTION #BORDERWALL #BORDERPATROL #TRUMPTOWERS #PRESIDENTIALPRIMARIES #VOTETRUMP #TRUMPTRAIN #MAKEAMERICAGREATAGAIN","commenter_a":"7% lead is good but you know that you need to win by double digits to shut ted up. IF you have any last minute secret weapons or anything you haven't used now is the time. Win NY huge and then take Cali and then proceed to destroy the liar and the commie.","post_message":"Thank you, California! I will see you soon! Have a great day - and remember - - TOGETHER WE WILL MAKE AMERICA GREAT AGAIN! #TrumpTrain"},{"comment_id":"943670819034115","commenter_b":"lol..that is a joke...that skank aint pretty at all..not cause her skin color..its because shes ugly..Id rather hit precious","commenter_a":"She is the most racist, evil, conniving bitch to ever be in the white house! With her 22 \"assistants\"! And you know most of them are probably white so she can treat them like slaves!","post_message":"Americas Freedom Fighters"},{"comment_id":"10153071085836051","commenter_b":"Kill that bitch!!!!","commenter_a":"Hell hath no fury, right? Sick, sick, sick.","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"10153434092834586","commenter_b":"First let's remove these beautiful creatures from these ugly hateful humans, then hook them up to the carriages to earn money. Ugly people with ugly hearts. Disrespectful pos.","commenter_a":"Its not fun for the poor horses","post_message":"This is what happens when you voice concern for injured carriage horses in #NYC.   What kind of person could do this?! #BanHorseCarriages"},{"comment_id":"10154841543903984","commenter_b":"Go to prison Hillary! !","commenter_a":"This is proof this election is and will be rigged. There's absolutely no way Hillary is leading in the polls. She will win but by using massive voter fraud.","post_message":"Fox Business Network just took a serious swing at Hillary Clinton, and it definitely was NOT a miss. The network exposed on-air the one thing mainstream media would never show you, and Hillary does NOT want it seen."},{"comment_id":"10155074124493258","commenter_b":"Hold fast against the Turd !","commenter_a":"\"A man reaps what he sows.\" Galatians 6:7. If you sow hate during the primary and the general election campaign, you reap hate, if you sow discord, you reap discord. #Galatians6","post_message":"‘‘We march today for the moral core of this nation, against which our new president is waging a war,’’ America Ferrera told the crowd at Women's March on Washington."}]
