[{"comment_id":"10153108961506491","commenter_b":"Who cares ,whatever the case, he's richer than me ...who are we to judge and worry about how much money somebody has in their pockets ? .He has more money than any of us here writing crap on Facebook .","commenter_a":" keep teaching them cause it's obvious, America thinks we come from space!","post_message":"Bill Gates barely holds a candle."},{"comment_id":"10153327649961943","commenter_b":"She should be in Prison As well as ALL the rest of that bunch!","commenter_a":"$170,000 is a really hefty pension for the shaft of Obammy's challengers by the crooks in he IRS . AND her boss is still there covering up the evidence !!!","post_message":"This material shows that the IRS cover-up began years ago. We now have smoking-gun proof that top officials in the Obama IRS unlawfully harassed taxpayers just to keep them from complaining to Congress about IRS targeting and abuse. Please SHARE!"},{"comment_id":"512673055591027","commenter_b":"She's such a joke.","commenter_a":"Why can't this woman get a job and shut up?","post_message":"Sarah Palin says she will work to defeat House Speaker Paul Ryan by backing his primary opponent in Wisconsin. @webpagelink"},{"comment_id":"1107644279295319","commenter_b":"I don't agree and what she did is wrong. But Trump can suggesting banning all Muslims from the USA and get away with it?","commenter_a":"Strange but when these muslims say and do the same things..Nothing happens....WHY...","post_message":"The devout Christian has been ordered to do community service"},{"comment_id":"10153238053014586","commenter_b":"plants are living things too... so eat sand... all human should eat sand.","commenter_a":"literally feel sick watching this how can people still let this happen? disgusting","post_message":"Can you imagine having that huge metal tube shoved down your throat?! This is just 60 seconds of how #FoieGras ducks spend THEIR ENTIRE LIVES. They sound so terrified. :("},{"comment_id":"1108284169190819","commenter_b":"Bitch","commenter_a":"Remember Vince Foster!! He was murdered and the Clinton's look like they did it!","post_message":"Hillary Clinton has got to be sweating this one... Do you think this Dem presidential candidate needs to be held accountable for her actions?"},{"comment_id":"10156746539145354","commenter_b":"Is she a horse of a different color? By looking in her mouth I would say this nag is pretty old herself.","commenter_a":"Wow! Maybe someone should check if she's a card carrying nazi. Hey Emma holocaust much?","post_message":"\"Either you wait for them all to die, or kill them off slowly.\""}]
