[{"comment_id":"10153044187631717","commenter_b":"No one wants to physically hurt her, we just want her to do her job. Such exaggeration!","commenter_a":"well they need too cuz this B*tch is Crazy!","post_message":""},{"comment_id":"1300733136636619","commenter_b":"Crooked Hilary!! She lose everything ad her life evil woman!","commenter_a":"The Clintons are Milliinaires who t.Trump values over his loser voters","post_message":"They illegally set up a charity to line their pockets for foreign influence...most countries call that treason."},{"comment_id":"10153084847781350","commenter_b":"Cheaters","commenter_a":"Latest reports state balls were checked at halftime and found deflated. They were changed out for fully inflated ones. And...PATS won the game in second half! What else is there to say? Enough already!","post_message":"\"It's cheating, regardless of how you may want to spin it.\""},{"comment_id":"1135581816480053","commenter_b":"I was just going to say that! I don't even think Taylor Swift could pull off that jacket well. It's apropos for this witch though: an ugly jacket for an ugly person","commenter_a":"What's worse is it looks hideous. She could have found a nicer jacket at Kohls!","post_message":"Does something seem wrong with this picture!"},{"comment_id":"10154684897643872","commenter_b":"Cow Patty is a crooked Hillary corporate baby killing whore and will lose in November!!!!","commenter_a":"Yeah, I'm voting you out for voting for TPP, freedumb act planned unparenthood and supporting crooked Hillary, enjoy unemployment Cow Patty!!!!","post_message":"Voting starts today! Got questions? Visit iwillvote.com for answers."},{"comment_id":"840046962805763","commenter_b":"GREAT! Then we don't have to build the wall!!! But will Mexico take them back?","commenter_a":"Hey, have at it.","post_message":"LOL."},{"comment_id":"716457901822319","commenter_b":"You the ugly one!","commenter_a":"She know she UgMo...lol..","post_message":"Isn't this a great response when they questioned Serena about her beauty?"}]
