[{"comment_id":"10152983460914342","commenter_b":"Good to hear","commenter_a":"When my grandmother got very sick we put her in a nursing home it was bad they make people thing it was the best place ever but it was not after my grandmother passed away that was the only day i saw my grandmother nice and clean ,(.... but now after my dads stroke we have him in a nursing skill facility and is the best of all i being into is call Grace Care here in katy is super clean nurses are super nice the whole staff is very friendly my dads loves this place the way they treat their patients is absolutely amazing i will recommend this place to anyone!!!!!!","post_message":"\"Most people don't realize how expensive this care can be until a parent or family member needs it...and then it's a real shock.\""},{"comment_id":"10154611817649087","commenter_b":"Diana , sthu . Don't call me names . We went through 8 years of that black racist pos muslim traitor obama . Now we get a real American President that wants to help America and people like you don't even give him a chance . So crawl back under your rock and take obama with ya .","commenter_a":"So many liberals . I mean clueless liberals . With obama and hillary we would have been a 3rd world muslim country in no time . STHU and give Trump a chance . He's done more for America in weeks that obama did in 8 years .","post_message":"\"It's apparent that President Trump is clueless when it comes to nuclear weapons.\""},{"comment_id":"1261804000541268","commenter_b":"WHy do you follow him?","commenter_a":"The word \"voter\" isn't in the constitution Bernie. You lost man..too out of touch","post_message":"Hillary Clinton won the popular vote for President by almost 3 million votes. Donald Trump will be inaugurated as the next President. That doesn't make sense for a democracy. The electoral college system needs to be changed."},{"comment_id":"1526598987356152","commenter_b":"First Ladies are suppose to always embrace hope and not be pessimists.","commenter_a":"Her lavish vacations on the taxpayers backs are over !!!!","post_message":"SHE'S BACK TO HATING AMERICA: It's the end of \"hope and change\" and Michelle, for one, isn't happy about it."},{"comment_id":"1328913090468676","commenter_b":"You are kidding! Bush was criticised for reading to kids in a school soon after 9/11, which was actually thoughtful and humane. While Obama is on a world tour with the family!","commenter_a":"We have to be honest. If that was George Bush we wouldn't have cared. This doesn't bother me so much, he was being polite as a guest at a State Dinner. Gallivanting with communists just hours after the bombing (and his dismissive <60 second remarks) was disgraceful, though.","post_message":"Nero has nothing on this guy! Obama shows how he feels about the #BrusselsAttacks."},{"comment_id":"1470713222988421","commenter_b":"Typical British woman. No morals, no values.","commenter_a":"Is this worthy of a news item? I think not.","post_message":"She text him the picture weeks later after not seeing him again"},{"comment_id":"941299175911870","commenter_b":"Trio does not exist.. Just close borders of USA. And Americans go home please.. .","commenter_a":"But why? Much as I hate usa n what it stands for, what it does n how it treats my fellow african brethren, I still don't want it to cease to exist. What kind of sick minds wish such a thing? I'ld understand if z nazis felt zat way, for if it weren't for z Russians nazism would've triumphed, God knows for how long!!! But, why usa? Is my theory of kkk/nazi/zionists existence n zer devious work at z root of things once again? For me z 'trio' are one n z same!!!","post_message":"A top official in Moscow says Washington’s aspiration is to see Russia cease to exist as a country."}]
