[{"comment_id":"1760085394239423","commenter_b":"Is there anything we can actually wear without people and animals being exploited ???","commenter_a":"LETS CONTINUE SPREADING THIS PLEASE!!! IS OUR RESPONSABILITY TO STOP IT!","post_message":"BREAKING VICTORY! UNITED COLORS OF BENETTON announced they will BAN ANGORA after just 24 HOURS into #PETA campaign: @webpagelink THIS is why you should care."},{"comment_id":"10153320376007042","commenter_b":"All five females was arrested","commenter_a":"That poor girl. I hope the person who attacked her gets arrested.","post_message":"A 17-year-old girl viciously attacked inside a Brooklyn McDonald's is speaking out about the brutal assault for the first time. @webpagelink"},{"comment_id":"10153213531701336","commenter_b":"I will bet she cannot fix anything, maybe breakfast if she knew how to turn the stove on.","commenter_a":"Sounds like she's twisted","post_message":"Moments ago, Baltimore Mayor Stephanie Rawlings-Blake defended her decision-making to critics and vowed there will be justice for Freddie Gray."},{"comment_id":"10155786065335329","commenter_b":"I sincerely hope you don't have children or grandchildren. Do not reproduce. You know who needs serious psychological help? People who are so close minded that they can't see out their \"perfect little bubble\" and judge anyone and everyone different than them. I love my generation because we are some accepting individuals. We want equality for all because WE ARE ALL HUMAN!! why does it matter to YOU personally what genitals someone has/wants. Who they lay down with behind closed doors. Why is considered \"crazy\" for the parents to support THEIR child's dreams and aspirations. Like got damn lady. Worry about your own snatch and keep your negativity to yourself. ✌💚","commenter_a":"Wow that family needs serious psychiatric help.","post_message":"\"By four, Samuel broke out in hives when we tried to cut his hair, and at five he told us, through tears, that he wanted to burn his face off because it wasn a girl face.\""},{"comment_id":"10154809751863812","commenter_b":"Yup I'm buying it! Vanessa Duarte I found our house lol","commenter_a":"@username buy it","post_message":"The 3-bedroom property, located in Bracknell, Berkshire, served as the home where Harry Potter grew up with the Dursleys in the movies."},{"comment_id":"10155024202814703","commenter_b":"America has American terrorist's as well. Why no effort on banning them, or shipping them out of our Country???","commenter_a":"Bet you never thought you would see planes crash intentionally into buildings either","post_message":"Thoughts?"},{"comment_id":"10154980459782235","commenter_b":"I would suspect it was an operation right out of the Kremlin. If so it's an act of war.","commenter_a":"C span has confirmed it happened and operating right now under the theory that it was an internal routing problem on their end. They advised they will update if they find out anything different happened.","post_message":"What the hell just happened?"}]
