[{"comment_id":"1277527375611846","commenter_b":"@username, and you KNOW she absolutely will DO it, too!","commenter_a":"This election isn't about picking a president! It's about the Law..Yes the Law!!!!USA Law against Sharia law!! Wake up Americans, don't you Dare be fooled,don't you Dare wear the Americans are stupid label, show all those countries out there that your a brilliant Mind and your family will make a smart choice in votes for your Country and what it stands for! God bless our way of life.Amen","post_message":"Anti-Christian extremists are demanding that senior U.S. military chaplains be investigated and punished for praying in uniform. Sign our petition to fight back. We must defend our brave military chaplains."},{"comment_id":"1276041149107332","commenter_b":"Just another moronic Hollywood actress.","commenter_a":"Idiot no but of Obama and kilary have their way then you need to worry cause people like me want save you from the Muslims you help let in our country","post_message":"SARAH JESSICA PARKER FEARS She'll Be Attacked And Killed If Trump Is Elected…LOL! Has She Not Seen MULTIPLE TRUMP Supporters Who've Been Bloodied By Hillary's Lib Mobs? [VIDEO]"},{"comment_id":"1056647814370639","commenter_b":"Let's be honest. HE is not confused. HE is still a MALE. And absolutely a disgrace.","commenter_a":"NO, are you kidding me?","post_message":"Do you agree with MAC's decision? Yes or no?"},{"comment_id":"10153084604971162","commenter_b":"Oh dear Lord I put this woman in your hands,we don't know her situation,we should not judge her..please Lord find her a place to lay her head protect her let her see the truth which is you..break her chains Lord,I saw in this article that she has a alcohol problem..break these chains Lord...I pray for all involved..in Jesus name amen","commenter_a":"That's sad!! Someone should get her some help like a shelter.","post_message":"WOMAN \"EVICTED\" FROM WALMART: A 45-year-old woman had been living inside Walmart for days before employees noticed her on the store's security cameras. VIDEO: @webpagelink"},{"comment_id":"10153150963247483","commenter_b":"I am totally convinced that libs are the only people that post comments on AL.com. Must be a lib ran organization. Oh I forgot, its part of the media!","commenter_a":"Assholes","post_message":"\"In my judgement, with respect to Hillary Clinton, she will be a unique president if she is elected by the public next November, because the day she's sworn in is the day that she's subject to impeachment because she has committed high crimes and misdemeanors,\" Congressman Mo Brooks"},{"comment_id":"1001556806534263","commenter_b":"A vagina is a sex organ. A boob is not. Stop comparing them.","commenter_a":"Society uses breast on ad to sell cars, burgers and every shits they want but when it comes to the natural uses, which is feeding a baby assholes loses their minds ? Should think twice before saying women who breastfeed don't have respect for themselves. What did our mothers/grandmothers did before powdered milk ?","post_message":"Women are brilliantly standing up to breast-feed shaming. Read a powerful example right here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"1218898121528016","commenter_b":"@username ..... What I really believe , is that the Republicans will have Trump tossed out of office within the first year. He is a Dangerous person , and he also has far too many enemies within the party. That is why he is surrounding himself with people he feels are loyal to him instead of people that actually have some knowledge of what really needs to be done. They are not going to forgive and forget his insults and his horrible attacks on them and their families. Ted Cruz and the gang are just biding their time until the inauguration. Pence Will be President and then the country will be run as a Christian Caliphate.","commenter_a":"Exactly right ! And make no mistake , Pence IS going to be president ! Seriously ... I don't know which one will be worse !!","post_message":""}]
