[{"comment_id":"10155984952470354","commenter_b":"Hanging around With To Many Illegale,s Will Do It !!!Dry Up His Brain !!!!!!!!","commenter_a":"Jerry brown is a twit. He's spent his life in CA and knows huge fires are part and parcel with living in CA.","post_message":"Two words: Moon. Beam."},{"comment_id":"1119811948055147","commenter_b":"You want a female hero? You've got Samus! Leave Link alone and stop this feminism in video games. Ghostbusters already died and they want all of the world become female, not just video game characters...","commenter_a":"while we're at it, should we change harry potter to female as well?","post_message":"Nintendo's reasoning makes zero sense."},{"comment_id":"1013220235397406","commenter_b":"She is an ugly witch. No wonder Bill looks elsewhere.","commenter_a":"Hillary is a has been Murder Embezzlement List ghost oes on","post_message":"ISIS just needs a hug..."},{"comment_id":"10153489644226680","commenter_b":"@username Hillary 2016!","commenter_a":"I support Bernie but, in a democracy you don't always win. Clinton's big victory in NY is not the result of some sort of conspiracy. It is a result of counting the votes. I am not one of the \"Bernie or Bust\" people. Trump/Cruz are too dangerous to advocate some sort of 3d party campaign where Bernie is the candidate. When Ralph Nader took votes away from Al Gore, it resulted in George W. I do not want a rerun of that movie. I am not happy about how the race seems to have ended, but, Hillary got more votes than Bernie and that ends it.","post_message":"Hillary Clinton gets emotional telling the story of Sandy Hook Elementary principal Dawn Hochsprung, whose daughter is at the victory rally."},{"comment_id":"1737148153188324","commenter_b":"That illegal ones should be deported or shot","commenter_a":"Total bullshit! This is a huge part of the democratic voter base by no mistake","post_message":"A Center for Immigration Studies report shows just how much immigration has skyrocketed since 1970. Shocking!"},{"comment_id":"10154753364685225","commenter_b":"@username be quiet old hag","commenter_a":"This is what happens when you have real leadership in charge of the Country.","post_message":" is historic. The Dow Jones Industrial Average hits 20K for the first time. @webpagelink  #Dow20K"},{"comment_id":"936764406358981","commenter_b":"what tits. he was smelling her fart","commenter_a":"\"Joe stop staring at my tits, thanks.\" ~ Hillary","post_message":"Can you imagine?  Talk about our country going to hell in a handbasket…"}]
