[{"comment_id":"10152735279906135","commenter_b":"If there were more moms like here this would not be happening","commenter_a":"Good for Mama!","post_message":"\"What the [BLEEP] is wrong with you?\" Baltimore mom gets fired up after seeing her son cause trouble on TV."},{"comment_id":"621932114627042","commenter_b":"NO MORE POLITICIANS. OR WORSE, A POLITICIAN/LAWYER #TRUMP2016","commenter_a":"UPDATE (4 PM): In addition to the town hall, Donald Trump will also hold a rally at the David L. Lawrence Convention Center Wednesday evening. DETAILS: @webpagelink","post_message":"UPDATE (4 PM): In addition to the town hall, Donald Trump will also hold a rally at the David L. Lawrence Convention Center Wednesday evening. ---------------------------------------------- The Donald is coming to Pittsburgh."},{"comment_id":"10157254857370354","commenter_b":"Punch that Bitch","commenter_a":"If he had a background like that, other wives would come forward. She wasn't going to get alimony...hummmm","post_message":"The latest twist..."},{"comment_id":"10153484724071509","commenter_b":"Jason, go tell it to your momma, she's use to your hot air, and I don't have time for idiots. Go get your daily fertilizer. Move along!","commenter_a":"They will get unsupervised probation. Maybe six months tops in lock up. \"Privileged monsters\" just itching to kill!","post_message":"Five teens have been charged with planning a classmate's murder. Their plot was discovered when another student talked to school administrators, police say. @webpagelink"},{"comment_id":"10153988476564255","commenter_b":"Who is this dumb bitch this must be Stacy dash sister","commenter_a":"Unbelievable!!!","post_message":"This is how Fox News celebrates Black History Month."},{"comment_id":"1124947717560231","commenter_b":"Hurry up woman!!","commenter_a":"Alright, that's it...we're moving to Colorado. @username","post_message":"It is absurd that here in America, we remain the only major country on earth not to guarantee health care to all people. If this proposal for universal health care can win in Colorado, I believe it will spread around the country."},{"comment_id":"2076295639262230","commenter_b":"Who is Jill Stein?????","commenter_a":"Throw your support behind TRUMP all of you Bernie supporters!!!!","post_message":"Breaking News: Democratic National Committee Chairwoman Debbie Wasserman Schultz will not preside over her party’s convention in Philadelphia following email leak suggesting anti-Bernie Sanders bias, Fox News confirms. @webpagelink"}]
