[{"comment_id":"1547989355230019","commenter_b":"@username I hate Hillary but when you say she killed four people you sound crazy.","commenter_a":"Wow all these libtards hating on Hannity. What about all your bais media reporters? ??? They bend over and let Hilary use her strap on to them Cnnn already said Hilary won the next debate . When she didn't win the last . Is he going a little overboard yes. But let's face facts , if he was saying the same things about Hilary. He would be a genius in your eyes.","post_message":"What a week."},{"comment_id":"10153224011251051","commenter_b":"Shoot the the sonofbitch","commenter_a":"Dirt bag!","post_message":"A lot of people considered this man a hero. Then the truth came out."},{"comment_id":"10154119887406167","commenter_b":"LOCK HER UP!","commenter_a":"Why hasn't Hillary been arrested for money laundering and racketeering?","post_message":"It's not just Trump that's the problem -- it's his family too."},{"comment_id":"1571786566441790","commenter_b":"What good will it do, congress passes these laws.","commenter_a":"These people make me sick.","post_message":"These welfare abusers need to be taught a lesson.  Way to go Judge Judy!"},{"comment_id":"883740348483208","commenter_b":"Where are you FBI Ophry openly threatening to Murder White's. Do your duty and arrest her. Where did she get all her Million's from. She is a Racist herself.","commenter_a":"You mean all Blacks are full of hate for Whites including you get your facts straight from one generation to the next on and on forever it is taught to HATE all WHITES","post_message":"Do you think Oprah is a bigot?"},{"comment_id":"10153858888594474","commenter_b":"Actually, she needs to go to jail.","commenter_a":"Not soon enough!!!!! We might get Hillary so it will just be like having Obama in the White House.","post_message":"Let the countdown begin. Share if you're ready for the end of the Obama era!"},{"comment_id":"479371038920143","commenter_b":"Put that stupid bitch in a uniform and make her serve!","commenter_a":"no wonder look who shes married to","post_message":"Michelle Obama just made an outrageous claim...  Our soldiers fight and die for our country, Michelle takes lavish vacations.  Do you respect our veterans over Michelle?"}]
