[{"comment_id":"10152826278642093","commenter_b":"Oooh sweet Jesus take cover my friends in dat area God bless y'all prayers going yalls way","commenter_a":"Duncanville","post_message":"Tornado Warning for portions of Dallas and Tarrant Counties until 2:45 AM this morning. Tornado is radar indicated near Cockrell Hill moving NW at 35 mph."},{"comment_id":"10153678136737217","commenter_b":"You are falling into the hands of the extreme right wing portraying themselves as, \"for the working class.\"","commenter_a":"Voting out because the EU is corrupt. This country full and we should trade with the world. And I don't wont to be under a dictatorship . If it was not for the dedication of the doctors and nurses the NHS cant cope with demand .schools need a teacher. And two teaching assistants .not enough. Housing. And foreign criminals cant besent back","post_message":"What does Brexit mean? And who will be able to vote? Nine days before #EUref, here's a guide about some of the key questions."},{"comment_id":"10155992640990354","commenter_b":"They are none good roll models..they don't need these women as anything but singers..and you need to make sure they are dressing like hos..cause thats what all little girls seem to want to dress like..it's to late anyway..all of us have allowed them to face a world thats gone insane..they wont be in a world like we had..it's over..they will have abortion..hate..sex that kills..and men cutting off their heads and men raping them...so keep worrying about music..clothes..fingernails..princesses..and cutey stuff...they are doomed...and we let it happen.","commenter_a":"Taylor Swift is a good role model. Myley Cyrus is NOT a good role model. Taylor Swift writes and sings her amazing hit songs. What does Mylie Cyrus do? Sing and not good at all. My girls love Taylor Swift!","post_message":"Which is worse: Kiss Kiss or Bang Bang?"},{"comment_id":"10153572716786337","commenter_b":"Well he went to my homeland n cause a problem...we don't bother NOBODY but Americans always causing trouble for us....If he dont go to jail..Maybe a African curse will do the tricks...n if the table was turn y'all would want justice","commenter_a":"Uh, no shit he won't go to jail. He didn't break any laws in America what so ever. While I disagree with what he did, it was done in another country outside of our laws.","post_message":"#CecilTheLion is dead. Walter Palmer probably won't go to jail. Here's what we can do to prevent situations like this..."},{"comment_id":"10155243196880354","commenter_b":"If the border is not closed these terrorists will continue to come into America!!!","commenter_a":"Save the taxpayer some money and just shoot them. Don't tell the world, just shoot them and be done.","post_message":"Meanwhile, as Obama was snapping selfies...."},{"comment_id":"537397173122691","commenter_b":"Letting illegals into the country","commenter_a":"Is there anything that does not get lefties in an uproar? Anything at all?","post_message":"This photo has San Francisco Leftists in an uproar!"},{"comment_id":"1049399221792530","commenter_b":"A Hillary supporter should be asking themselves why they want a killer in office.","commenter_a":"A Trump supporter should be asking themselves why Putin would be interested in Trump winning the generals. Makes you wonder about where you stand.","post_message":"Donald Trump’s call for Russia to hack America makes this election an easy choice. ►Full Episode: @webpagelink"}]
