[{"comment_id":"10154523076746028","commenter_b":"Milo is trash","commenter_a":"And most of you laugh when our president calls all of the BS networks and papers \"fake news\"!","post_message":"Eek."},{"comment_id":"993534210682000","commenter_b":"These illiterate students should be in class learning something !!!","commenter_a":"I agree with every post here! They should have forfeited the game and then raised the tuition to cover what loss incurred that reduces tuition. End of story. But know we have encouraged the sports programs to make policy and remove employees at their will. Just crazy.","post_message":"Literally no understanding of 1st amendment rights whatsoever!  Behold your \"tolerant\", liberal colleges..."},{"comment_id":"1697928997118346","commenter_b":"I DON'T WISH TO RUIN MY DAY WITH THIS MISERABLE COWARD MAGGOT--CORWARD RACIST EVIL VOLDEMORT.","commenter_a":"Vote blue across the board. Vote Democratic party in the next election. Go Hillary. DUMP TRUMP THE IDIOT","post_message":"Well, it's official: Donald Trump will be the GOP presidential nominee. Simple question: Are you voting for him?  LIKE Opposing Views for all of the latest 2016 election breaking news and debates."},{"comment_id":"936780129786105","commenter_b":"This lawlessness will stand until the National Guard is called out to do a sweep for illegals. If these sanctuaries are allowed to continue more lawlessness will occur in its most violent forms.","commenter_a":"Not proud of the mayor of Chicago for sure.","post_message":"Rahm Emanuel to Illegal Aliens after Trump Win: Chicago is Your Home – You are Always Welcome Here. @webpagelink"},{"comment_id":"10153249874686051","commenter_b":"Girl... You are so sooo wrong! I guess you think Hillary would have answered the question.. Lol","commenter_a":"Trump had NO intention of ever calling on this great reporter - his questions would have been too complicated for Trump to answer. Even later when the reporter comes back in after his \"time out\", Trump badgers him.","post_message":"Here's how Donald Trump responded when a reporter interrupted his press conference."},{"comment_id":"891987007503062","commenter_b":"Death row for that bitch!","commenter_a":"DEATH!!!!!!!!!!","post_message":"The trial has finally started for this officer, after witnesses say they saw him pull out a knife and slit the dog's throat open, even though the dog was already restrained.  If you were the judge in this case, what would you sentence him to?"},{"comment_id":"10154071850239456","commenter_b":"Look for Huckabee at VP","commenter_a":"He will make a great VP","post_message":"Do you think he made the right decision?"}]
