[{"comment_id":"10153236648136167","commenter_b":"Pretty sure that Mika just","commenter_a":"MSNBC is such an embarrassment to itself.","post_message":"Hours after MSNBC itself reported that this lie was debunked, Joe Scarborough was still pushing it."},{"comment_id":"10153148300259575","commenter_b":"You certainly are. \"Judge and be judged\" Crystal. I PROMISE you God is watching your actions as much as he's watching mine. Typing \" under a homosexuals death does not, in fact, secure your ticket to heaven babes.","commenter_a":"Let's see if she can have god change his mind","post_message":"A terminally ill woman whose desire to have her same-sex marriage recognized by Indiana before she died helped galvanize efforts to overturn the state’s gay marriage ban has lost her battle with cancer.  Niki Quasney died Thursday, gay rights advocacy group Lambda Legal said Sunday. She was 38."},{"comment_id":"1152891968103883","commenter_b":"She is very cute and beautiful little baby but don't present her like,\" world's most beautiful girl\". You are ruining her childhood, i guess it's already been ruined but better late than never. Let her live her normal life please. I could see her turn into justin bieber like child in the future. He was no doubt blessed child but what media attention has done to him?? Spoliled him forever. One thing more how can you claim WORLD'S most beautiful child? World means 200 countries and over 7 billion human beings! Have you seen all of them?","commenter_a":"Not being funny but kids are cute not beautiful..that really sounds wrong unless it's you perents saying it.","post_message":"The controversial ten-year-old has been dubbed 'the most beautiful girl in the world'"},{"comment_id":"949160488506463","commenter_b":"THIS IS 9AMERICA0 NOT SYRIA","commenter_a":"May I remind everyone, This is America and the judge was correct. Swear to the truth by swearing to it on the Bible!","post_message":"Did a judge violate this woman's religious freedom or were his actions justified?"},{"comment_id":"1879145055641043","commenter_b":"I bet her husband can't wait to their son Ben turns 18 so he can leave this psycho b****","commenter_a":"She went from 102 pound to 104 pound woman in a matter of minutes. Proves that she's full of shit and gaining.","post_message":"I bet she has at least seven cats.   -Admin Rick Birdsall"},{"comment_id":"1081156815254321","commenter_b":"DEPORT ALL MUSLIMS FROM AMERICA IMMEDIATELY : DESTROY EVERY MOSQUE ASAP !","commenter_a":"Back to disliking France again","post_message":"Establishing 'good relations' before Trump takes office..."},{"comment_id":"1225877584098936","commenter_b":"Build a wall!! That'll stop em!! Bahahaha","commenter_a":"El Chapo was there.","post_message":"The \"super tunnel\" – eight football fields in length – was discovered along the U.S-Mexico border south of San Diego.  via NBC 7 San Diego"}]
