[{"comment_id":"1070265606383000","commenter_b":"Love the response. Don't like dogs, don't come to the park.","commenter_a":"Yayness","post_message":"Allen West Republic"},{"comment_id":"10153440859824411","commenter_b":"Fascists? LMAO!","commenter_a":"Both obama & hillary are fascist pigs !","post_message":""},{"comment_id":"1114612235259607","commenter_b":"So wait, now they don't WANT jobs? All this time they've been saying they want equal opportunity and a piece of the pie. Clearly, this group do sent want to work for it. They just want a free piece of pie. Give me a break! At least those inside the church get it. The Democrats have kept blacks down for decades and more but the fools outside just can't see beyond their hate.","commenter_a":"Democrats always wanted all black not to progress so they can pen them for their vote every election for a hand out then abandon them for 3 to 4 years.And the cycle goes on and on.","post_message":"DETROIT POLICE FORCED To Call Out BOMB SQUAD To Protect Trump From Hillary Supporters Offended By Speech About Bringing Jobs Back To Blacks…Faith I don't remember seeing a bomb squad when Hillary recently visited Detroit… @webpagelink"},{"comment_id":"822921484411860","commenter_b":"Run him out of America or sent him to Islam for good !","commenter_a":"Absolutely YES! Police are bound by laws and orders that do not allow any other real form of expressive protest. This sends the message loud and clear. It is also a great honor of solid support to the murdered officer whose Mayor helped provide the hostile environment in which this officer was murdered.","post_message":"Was this the right move?"},{"comment_id":"10153732430689117","commenter_b":"It is a completely legitimate discussion. In the 21st century private corporations have power equal to or even greater than a government's over people's platforms for speech and expression. In 10 years it is entirely possible that a single multi-national company will control all of the major social media platforms. Which means they could quite easily silence any viewpoint that they don't like. This in fact is already happening in many places around the world. Mark Zuckerberg will eagerly jump into bed with any ruthless dictator and agree to censorship on that country's population.","commenter_a":"There is no free speech war to be had. Twitter is a private entity and can ban who ever they like, for what ever reason. They do not have to abide but the first amendment, the government does.","post_message":"#FreeMilo just became a thing. Thanks, Twitter."},{"comment_id":"10153611062907217","commenter_b":"#LetAmericabebadagain trump2016","commenter_a":"If you vote in this racist idiot as your president , Your country will be going down the shitter for many many years to come. The guy is a nut job who hasn't got a clue !! He's a threat to world peace ... Anyway good luck America","post_message":"\"I am offended. Those are very rude statements.\""},{"comment_id":"10152885011267507","commenter_b":"Woman put up with it because we are use to it. Woman are also so busy and have not prioritized changing this. Women will eventually say enough of this nonsense and put a stop to it for good. It is only a matter of time.","commenter_a":"Women in other developed countries are getting treated better ! Why do American women take this abuse ? No paid maternity leave , no paid sick leave , no paid or very meager paid leave , WTH is wrong with American women demand it and demand it now!!!","post_message":"Let's be good to our mothers today and EVERY DAY!"}]
