[{"comment_id":"939262232775539","commenter_b":"Hey pam how about I come over and slam you're stupid ass to the ground and throw you across the room, see how you like being manhandled","commenter_a":"No the policeman was right!! No damn respect for anyone any more, just makes me sick!!!!","post_message":"BREAKING NEWS! The cop ASSAULTED a young girl in her South Carolina high school classroom has JUST been FIRED! Do you agree with this decision by his department? Does it change anything? Let us know and help SPREAD THE WORD about the power of #FilmingThePolice! From (Y) Counter Current News - MBD"},{"comment_id":"10153083977090950","commenter_b":"The costume? Stupid. Offensive? A man who think he's a woman when NUTURE decided MALE for him and no amount of procedures will change his MALE DNA. That's offensive. What is he a salmon? Science needs to come up with some kind of rehabilitation approach or program to try and fix this social diseases, including homosexuality.","commenter_a":"Why not it's holloween nway haha","post_message":"The \"Call Me Caitlyn\" costume faced Internet backlash, with some calling it \"transphobic.\" Stores, however, think the outfit \"celebrates her.\""},{"comment_id":"10153829560109062","commenter_b":"Illegals dont fil lout any forms,","commenter_a":"Who tell him Illegal immigrates do not pay taxes, there are special forms most of them pay by the end of the year simce they know if there a possibility to change their status they will have to show they paid taxes... Ignorance makes people say atupid things... sad!!!","post_message":"What do you think of the sign?"},{"comment_id":"1150301004990909","commenter_b":"Awww don't be jealous little bitch","commenter_a":"Hahaha typical chicken shit Americans","post_message":"For the first time in twelve years the United States has experienced a death from measles."},{"comment_id":"10152546933456776","commenter_b":"Get all the illegals out of our country, Enforce our constitution and the god it was based upon twtf","commenter_a":"Let's get those illegals out of here and all those Muslims who hate us","post_message":"Today I was sworn into the U.S. Senate. It's a great honor to serve the people of Louisiana. Our state has limitless possibilities. Let’s take advantage of our natural resources as a way to create better jobs with better benefits for Louisiana families. Let’s work for healthcare solutions that give patients the power to make their own decisions. Let’s protect family values and the ideals our Founding Fathers established in the Constitution. I look forward to working together. I'm with you."},{"comment_id":"1046767232087074","commenter_b":"@username I know that - he promoted that they would all go back intially and has since changed his agenda. He announced it more or less on Hannity last night - please read the comment again. There are AT LEAST 11.5 of illegals in the nation who would not be classified as criminals. And even tho \"they would not be given citizenship\" who does not know the Left's MO - of course the left will push for voting rights. The Left needs an underclass to stay in power. They are building the numbers year after year of voting blocs to keep themselves in power!","commenter_a":"So you are going to let the 11.5 illegals stay in the nation. You say they will not be given citizenship. You must know that most of us on the right are not stupid by now, right? The Marxists will push for their voting rights anyway - and get them w/a song and dance. And there goes the nation. We will never get her back - ever. The Left is delighted. They did it. They stacked the nation in their favor. WHY do you think the wall was never built? RIP USA.","post_message":"Will be on #Hannity @ 10pE on Fox News - discussing various subjects including immigration - if elected, we will #BuildTheWall & enforce our laws! Tune in - as Donald Trump Jr. Joins me with other special guests!"},{"comment_id":"783948935040375","commenter_b":"I have seen girls wear a lot worse. Actually the dress is beautiful.","commenter_a":"She's beautiful and the dress is fine shame on the teacher for saying such a thing the teacher should have minded her own business !!!","post_message":"Do you have a problem with this dress? This young lady was shamed for wearing this dress to her senior prom. A teacher claimed it was too revealing and said \"Us big girls gotta cover up.\" More: @webpagelink"}]
