[{"comment_id":"1798905343724193","commenter_b":"\"She doesn't want guns, take their let's see what happens to her,\" Trump said. \"Take their guns away, okay? It'll be very dangerous.\"","commenter_a":"How can this extremely ignorant, sorry excuse for a human, still be in office? and in Texas???","post_message":"What say you, Texas?"},{"comment_id":"10153249437958701","commenter_b":"What about whores?","commenter_a":"Taking offers on souls in exchange for this perfect diamond. Virgins get first preference.","post_message":"It's a 100-carat diamond, considered by experts to be \"perfect,\" and it's going on sale. Watch the full story, later tonight."},{"comment_id":"10153291115837411","commenter_b":"@username, he pleaded guilty to 4 counts of manslaughter.","commenter_a":"He killed four ppl, But Bobby shmurder still locked up for a gun smh..White supremacy system for ya.","post_message":"Ethan Couch, the so-called \"affluenza\" teen convicted in a fatal 2013 drunken-driving accident who was taken into custody in Mexico, is back in America."},{"comment_id":"10153017975939205","commenter_b":"Well you'll have to fuck off back to Europe then, cunts !","commenter_a":"I worship Ana.....Every square inch...","post_message":"Who knew Jesus was against immigration!"},{"comment_id":"10154426235974369","commenter_b":"My Smith & Wesson says otherwise, son.","commenter_a":"If you support trump. Every time you Run or walk you will be Trampled","post_message":"Donald J. Trump really went after Hillary Clinton in his speech today."},{"comment_id":"10156020385660725","commenter_b":"#FameWhoresDo","commenter_a":"Brooke the has been dethroned...","post_message":"A new celebrity has claimed the top spot on Instagram, setting a record on the social media site ----> @webpagelink"},{"comment_id":"723019874555257","commenter_b":"Should have turned on this evil muslim way before this get him out","commenter_a":"Shariah women slavery FACTS NOT phobia... TRUTH NOT misguided HATE... Example: Mohamidians mistreat WOMEN soooo badly ends shariah court to determine who can repeatedly RAPE women SLAVED by islam... WASHINGTON - Islamic State theologians have issued an extremely detailed ruling on when \"owners\" of women enslaved by the extremist group can have sex with them, in an apparent bid to curb what they called violations in the treatment of captured females. The ruling or fatwa has the force of law and appears to go beyond the Islamic State's previous known utterances on the subject, a leading Islamic State scholar said. It sheds new light on how the group is trying to reinterpret centuries-old teachings to justify the sexual slavery of women in the swaths of Syria and Iraq it controls. Above from article... @webpagelink","post_message":"BREAKING: Liberals Turn On Obama After He Is Caught In THIS Massive Lie About Bin Laden [VIDEO]. He can't hide any longer. His presidency should be terminated. Do you think Obama should be impeached?"}]
