[{"comment_id":"889054771211302","commenter_b":"It doesn't happen to muslim women because they are all fugly uckers..","commenter_a":"Go fuck yourselves, dune coon","post_message":"ClashDaily.com"},{"comment_id":"1203432829732943","commenter_b":"She'll pardon herself the first day in office","commenter_a":"If Killary gets elected, it may well really become illegal to read anything that could be detrimental about her and her actions.","post_message":"CNN: Remember, it's ILLEGAL to Read WikiLeaks Emails [VIDEO]"},{"comment_id":"10153202858353352","commenter_b":"Nigger Bitch??? Hahaha So Original","commenter_a":"Only because he was a black cop..... If he was a white cop that cracker would be locked up..","post_message":"Gun enthusiast who shot police chief four times during raid walks free because cops 'didn't have enough evidence to charge him'"},{"comment_id":"10152857531566491","commenter_b":"Dustin I spelled behaviour perfectly fine. Only AMERICANS spell it your way. And that's not saying much","commenter_a":"WHAT?! maybe influencing spoiled, childlike behaviour!","post_message":"Kanye West is on TIME's list of the world's most influential people #TIME100 @webpagelink"},{"comment_id":"1353378344701619","commenter_b":"Bring it bitches...Without the U.S. China will starve.","commenter_a":"EFF CHINA!!!!!","post_message":"CHINA WARNS TRUMP.    @webpagelink"},{"comment_id":"895449430498298","commenter_b":"Both are DICKS!","commenter_a":"A shame that both our prez and attorney general drew the guilty card before any investigations. Instigators to anti-police sentiment? Comments like Paul's are simply deniers to the findings of two separate independent investigations that produced identical findings. That is, Brown never had his hands up, was never surrendering and he was the aggressor.","post_message":"The Justice Department has finally confirmed what many of us were certain was the case: Ferguson police officer Darren Wilson told the truth about what happened when he said he shot Michael Brown in self-defense. After a six-month investigation, the DOJ concluded that Brown, allegedly a thug and a thief, was not trying to peacefully surrender when the incident occurred. He did not hold his hands up and say, “Don’t shoot.” And he was not shot in the back, as some alleged. @webpagelink"},{"comment_id":"1259153044105704","commenter_b":"You could try this? :) @webpagelink","commenter_a":"Judy Acres too bad we can't watch this :( UK only","post_message":"Absolutely spectacular footage from the BBC's latest nature documentary, #thehunt. Honestly, some of these shots look almost too perfect to be real.  'Witness a polar bear sneak up on its prey using ice holes to surprise it. This is the first time ever this has been captured on film.'  You can watch on iPlayer here: bbc.in/1j0xI5B"}]
