[{"comment_id":"10154607123003984","commenter_b":"Get a fucking rope around that sorry bitch's fucking neck. Treason is punishable by the death penalty!","commenter_a":"So why aren't we hearing this on all the news channels? This is serious enough that it should be out there! Why are they even allowing her to run for President?","post_message":"Hillary has dodged this way and that on Benghazi, hoping her lies never caught up to her.  But they just did in a huge way.  A high-level, bombshell email was just uncovered by a watchdog group, and it PROVES beyond a doubt that she left those brave men to die in agony, knowing full-well she had a chance to save them. How sick."},{"comment_id":"971252449561175","commenter_b":"Hat's off to this chick!!!! Good for her! To bad she didn't kill the s.o.b.!","commenter_a":"Well done! I would want to do the same thing. These perverts cannot be rehabilitated.","post_message":"The woman took matters into her own hands when she caught  her boyfriend trying to sexually assault a 12-year-old -- by running him over with her car. >> kiro.tv/RunOver  She, and her boyfriend, were arrested."},{"comment_id":"560732980781661","commenter_b":"GOOD, SHE IS SUCH A RACIST, GET HER OWN SECURITY.","commenter_a":"Good for them let her pay for the security and take a little less pay home...she'll get the message","post_message":"HAHAHA!!! THIS NEEDS 10,000 LIKES!!!"},{"comment_id":"1813062615599826","commenter_b":"She was good at taking separate vacations and other unnecessary trips at taxpayer expense!","commenter_a":"Yes","post_message":"Yes or no: Was Michelle Obama a good First Lady?"},{"comment_id":"10153118499596955","commenter_b":"Hemlock, anyone?","commenter_a":"These stories are being given as some form of programming... The nation was taken over and completely changed post Lincoln and forever altered for the globalists post JFK... If they want to move a major agenda forward they throw the nation off by creating spectacular distractions... This is subtext leading to a possible grand piece of theater.","post_message":"'Drunk' Secret Service agents disrupted bomb probe..."},{"comment_id":"10152557601575950","commenter_b":"Well they can't come back and tell the others that there are no virgins","commenter_a":"French terrorist ? I never heard viva la France during a plane hijacking and if I hear Allah Akbar I'm knocking that son of a bitch out","post_message":"There is evidence the three dead suspects -- brothers Said and Cherif Kouachi and grocery store gunman Amedy Coulibaly -- knew each other and shared common ties with known terrorists."},{"comment_id":"635288009979398","commenter_b":"How silly. Some people will sign anything.","commenter_a":"idiot","post_message":"An online petition to remove all air conditioning from Department of State property has gotten more than 1,800 signatures since it was posted online Sunday."}]
