[{"comment_id":"10154184245291943","commenter_b":"This evil woman needs to fall, through what ever means necessary.","commenter_a":"Oh quit messing with us. Either do it or s t f u!!!","post_message":"With 75 days before voters pick their new president, email revelations are threatening to overtake Hillary Clinton campaign  with WikiLeaks founder Julian Assange hurling another log on an already raging fire with a vow to release  Clinton documents.  In an exclusive interview Wednesday night with Fox News Megyn Kelly, Assange was asked whether new information culled from Clinton emails would be released before the general election: 'Yes, absolutely.  - via Fox News"},{"comment_id":"1310724188980341","commenter_b":"This woman has nothing better to do.","commenter_a":"idiot","post_message":"Hey, stop 'appropriating' our language..."},{"comment_id":"10154520353580329","commenter_b":"All humans have breasts, relax","commenter_a":"Not all people with boobs/breasts identify as women.","post_message":"I love you AND I hate you."},{"comment_id":"883919521667797","commenter_b":"newsflash, genius. there's a bunch of dumb females already in ISIS.","commenter_a":"no female should be deployed where isis are, you are just asking for trouble.","post_message":"Kayla Jean Mueller, 26, traveled the globe fighting genocide, AIDS and domestic abuse."},{"comment_id":"1283090895060069","commenter_b":"You don't know what you talking about a****** Hillary love douchebag","commenter_a":"Eric Reynolds","post_message":"Every Trump supporter should see this.   Video by Gavin Newsom. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153505225891615","commenter_b":"These two are animals !!!!","commenter_a":"From that shiner, I wonder if our esteemed and trusted servants might have exacted a little street justice... Nah - THATS ILLEGAL!!!!!","post_message":"Shocking testimony reveals new details about the Uniontown toddler who was only 10 lbs at the time of her death. WPXI Cara Sapida is in court right now.   TONIGHT AT 5: Cara shares the disturbing testimony from an ER doctor and state trooper about the day little Lydia died."},{"comment_id":"10153696766386159","commenter_b":"Blue laws are state laws or local laws that regulate in state commerce and are not the purview of the Federal Government. Few states have Blue Laws any more. In our state, only alcohol (package sales) are banned and that decision is made locally - not by the state. We have dry counties and dry townships. That decision is made by local residents.","commenter_a":"Freedom OF religion is also freedom FROM religion.","post_message":"United States of America did not create religious liberty. Religious liberty created the United States of America."}]
