[{"comment_id":"1736119296633923","commenter_b":"SURE --- IF THEY PAY BACK ALL THE WELFARE AND ABORTIONS WE'VE PAID FOR FIRST --- ------ GET A FREAKING JOB.","commenter_a":"I have never believed in Slavery and have not supported anyone who did. In fact I believe we fought a war and won to free anyone who was inslaved. And Blacks are not the only people that others use as slaves, there is still human trafficing going on and woman that are used as sex slaves... Get over the past as none of us alive can be responsible for what people before us did except not let it happen again.","post_message":"Bernie Sanders Apologizes For Slavery, Demands We Compensate African Americans He can use his own money for that. Will you compensate African Americans for slavery?"},{"comment_id":"955814454527001","commenter_b":"He involves himself into everything other than the priests who get their heads c*** off so called refugees .","commenter_a":"lmao the fact that this is an actual problem and a topic taken up by the pope, speaks volumes about the state of the humans! arent we suppose to be the most intelligent species...i mean we aren't animals that can change genders at will or to reproduce...","post_message":"\"Today, in schools they are teaching this to children -- to children! -- that everyone can choose their gender.\""},{"comment_id":"1053111538057600","commenter_b":"Both of these mooches need to get out.Better make sure they don't steal anything, like clinton did when she left the whitehouse.","commenter_a":"She looks bored big time.","post_message":"I agree!"},{"comment_id":"10153323546831747","commenter_b":"Now plural marriages are next.","commenter_a":"What a crock! States rights were dealt a severe blow today. Yesterday SCOTUS-care, today five judges ignore the constitution to impose more leftist agenda on the entire country. Overall a bad week for the USA!","post_message":"I've had some time to think about today's historic ruling. Here are my fuller thoughts...  Today, the arc of history bent further toward justice. We are a country that embraces the ideal of life, liberty, and the pursuit of happiness for everyone. With today's Supreme Court ruling guaranteeing the right to marry for LGBT couples, we came even closer to making that ideal a reality.  This decision is a reminder that we should come together as a nation in support of civil rights for all. LGBT Americans and their allies are joyously celebrating today’s landmark decision, as they should. On this same day, in Charleston, South Carolina, Reverend Clementa Pinckney, a martyr to the civil rights struggle, is being laid to rest. He was one of nine African Americans robbed of life in an act of white supremacist terrorism.  Our work to build a more perfect union never ends. Marriage equality is now the law of the land, yet there are no federal safeguards protecting LGBT Americans against employment and housing discrimination. The same Supreme Court that ruled today in favor of marriage equality two years ago gutted the Voting Rights Act, and to this day, Congress has failed in its duty to restore vital voting rights protections. Rights can be won, and rights can be lost.  We’ve helped create a fairer and more just society today, but new and longstanding civil rights struggles are on the horizon. I’m prepared to wage those battles too, because I want my grandchildren to see progress in their time. I want them to believe as I do that America’s best days are still to come."},{"comment_id":"10153677801340530","commenter_b":"Wow dicks can talk. .","commenter_a":"But, the SCOTUS said there is no racism in America.","post_message":"Community and city leaders are strongly condemning a racist flyer against blacks that was circulated in Southfield tied to an upcoming mayoral election."},{"comment_id":"1073790629380657","commenter_b":"@username. Just fn Stop it with the Fox \"news\" total BS talking points. Insurance is about LIABILITY, not necessarily self protection..and it's Democratic Socialism at it's core such as our tax code: Put $$$ into the pot to benefit/secure your society's quality of living. The phrase \"free market capitalism\" is nothing but corporate fascist propaganda for dumb asses.","commenter_a":"I like to ask people that hate socialism why they buy insurance? You can almost see them stroke out as they start to think really hard about the question.","post_message":"Brilliantly done."},{"comment_id":"10155507784285405","commenter_b":"DO NOT LET the criminal illegal invaders take over our military .","commenter_a":"Karl Keyzer-Andre","post_message":"As we celebrate Armed Forces Day, I want to take a minute to honor and thank all our servicemebers and veterans for your sacrifice. America owes each and every one of you a great debt of gratitude."}]
