[{"comment_id":"10153060758061162","commenter_b":"What?","commenter_a":"i tink he looks cool and should have done the other side too","post_message":"SENTENCED: A man nicknamed \"Eyeball,\" because of a face tattoo that included the whites of his right eye, is sentenced to 22 years in prison for shooting an Alaska police officer.  PHOTOS: @webpagelink"},{"comment_id":"1201058653247496","commenter_b":"@username Yeah get rid of all laws because you don't like them, shoplifting, welfare and insurance fraud, ect... Do you even know what Jaywalking is where you live it why its a law?","commenter_a":"How about telling the entire story how he ran from the cop and tried to board that red bus in the picture while the cop was writing him a ticket... Also how you can hear the cop tell him to stop resisting while the kid was grabbing his baton. Oh because he doesn't feed your anti cop agenda?.","post_message":"Nine officers can be seen in the video, as an onlooker pleads 'He's just a kid!'"},{"comment_id":"10154154214551509","commenter_b":"Hahahahaha","commenter_a":"All I know is, if I ever overdosed in a whorehouse and my wife and my mama found out, skip the cpr. I am better off dead.","post_message":"After ex-NBA star Lamar Odom was found unresponsive in a brothel owned by Dennis Hof, the reality TV star swung into damage control mode.  \"My business is built on privacy and discretion,\" he said. \"But when the ambulance pulls out and five minutes later TMZ calls me, you have to deal with it.\""},{"comment_id":"1152390574850299","commenter_b":"Wish these women would press charges! That would be wonderful...","commenter_a":"This woman should bring legal charges. It is too bad she did not haul off and slug him then and there. There are too many honest credible women coming forward to ignore. Even die-hard Trump supporters should think twice about supporting such a lech. And no, the Clintons are not paying all these women to come forward. Use spell check if you want to be taken seriously Maynard.","post_message":"This makes 12 women that Trump is accused of not being able to keep his grubby, tiny hands off of."},{"comment_id":"1598639267107557","commenter_b":"#2ChroniclesChapter7V14 #DrainTheSwamp #OneNationUnderGod #InGodWeTrust #TrumpPence2016 #UCMJ4President #UCMJ4Congress #UMCJ4Senate #USConstitution #BillOfRightsNonNegotiable #Paperballotsonly w/ID #NoAmnesty #AmericaFirst #PledgeOfAllegiance #NationalAnthem #ProNRA #ProLife #Pro2A #NoUN #MAGA #Election2016","commenter_a":"Why are tax dollars being spent on our so called president campaigning for her. ..should be illegal","post_message":"Donald J. Trump finally did it. After taking a lot of punches from the first lady, he unloaded on Michelle Obama, dropping an epic truth bomb on the president's wife.  What do you think about what Trump said?"},{"comment_id":"10154879190478812","commenter_b":"Shoot back you spineless worms","commenter_a":"That's a lie. Yemenies love USA soooooooooooo much","post_message":"Two missiles fired at U.S. Navy guided missile destroyer USS Mason in international waters off the coast of Yemen on Sunday, according to the Pentagon."},{"comment_id":"10153727550292300","commenter_b":"Go naked girl! Again and again!","commenter_a":"South beach is super ghetto now.","post_message":"In video taken by witnesses and posted on a website where it went viral, Angelic Valle is completely naked when she “placed a steel chair leg into her buttocks,” according to the police report."}]
