[{"comment_id":"1508488155837876","commenter_b":"Kelli Foltz-Daniels the Bkacks","commenter_a":"Because Latinos live off the welfare system. When you start talking jobs, they tend to get pissed off thinking your gonna take away their government funds","post_message":"Nearly 80 percent of Latinos have a negative opinion of Trump."},{"comment_id":"1121854401168903","commenter_b":"Stfu fat bitch","commenter_a":"Is it because they're assholes?","post_message":"They spend their lives eating rotten meat - so why don't they get sick?"},{"comment_id":"10152869461365927","commenter_b":"\"kill another Fetus now, we don't like Children anyhow\"","commenter_a":"If Republicans supported an organization that murdered 90,000 black babies last year OMG. PP would be the worst place since the death camps of the Nazi's. But godless \"Demon\"crats like Hillary are the true racist as they use PP as a form of population control to keep black birth rates down and the black population under control. Dems have always been the party of hate(KKK) and division, they still are they have just convinced the black race that they are their friends and supporters,,,,, really","post_message":"Planned Parenthood Director of Research Melissa Farrell makes STARTLING statement about dissecting aborted babies ..."},{"comment_id":"1666754860284644","commenter_b":"As a veteran educator with 31 years experience, I am appalled by Betsy DeVos's level of complete and utter incompetence. As a parent of a special needs child, I am alarmed and sickened at her flippant discard of imperative federal laws that protect those that cannot protect themselves. Shame on you, Donald Trump, for promoting her, and shame on you, Betsy DeVos, for accepting a position for which you have zero aptitude.","commenter_a":"Once again Senator Kaine, your questioning along with others brought out that she has NO clue. Our children cannot afford to have this kind of management over their education. Scary!!","post_message":"I worry about the effects of a leader who thinks 'government sucks' on the morale of teachers. Disappointed Betsy DeVos does not support equal accountability and IDEA for all schools getting tax dollars."},{"comment_id":"10153221093818433","commenter_b":"Yeah, because the media doesn't owe Mitt Romney and his family an apology....","commenter_a":"Expose the liars. I am glad he did it!","post_message":"\"I had a mission,\" Pfeifer said. \"I am sick of reading bull- - - -. I am sick of lies. I am sick of people’s lives being destroyed.\" ow.ly/MnI5N from PunditFact"},{"comment_id":"10153997571366378","commenter_b":"So glad they got him! That beautiful child did not deserve to get shot. God bless her.","commenter_a":"Why am I still shocked by such brutal events? Such a sweet looking child.","post_message":"#BREAKING: A man has been charged with murder in the shooting death of 8-year-old Gabrielle Carter in Camden, New Jersey. The 18-year-old suspect was arrested Friday morning at a relative's home in Tennessee."},{"comment_id":"10153560718630950","commenter_b":"She SHOULD be acting like a professional woman!","commenter_a":"I'm with Kelly. Respect goes a long way. There is a right way and a wrong way and ABC and Michael Strahan chose the wrong way. Kelly has a right to be hurt.","post_message":"Kelly Ripa reportedly feels \"disgusted and angry\" that this was done behind her back."}]
