[{"comment_id":"10154269953567439","commenter_b":"Wouldn't be Muslim refugees if our leader would fight for them . He wants them to spread out and start a war of Islam","commenter_a":"Those Muslims were Barack Obama's son's","post_message":"This woman is brave to come forward and tell this gruesome story. Only one of the five Muslim migrants were apprehended. The other four \"escaped the country.\" Don't believe it. They are being hidden by the Muslim community much the way the Paris jihadis were."},{"comment_id":"10153107987369205","commenter_b":"When an illegal alien is here and gives birth to a child the child is still illegal.","commenter_a":"Matt Ely this who you want you dont know shit if this who u want","post_message":"Things get heated between Bill O'Reilly and Donald J. Trump"},{"comment_id":"10154045189272169","commenter_b":"Farmers are already having trouble finding people to work. A lot of illegals have left this country and Americans won't do the work, so there are places that crops are just sitting and going to waste.","commenter_a":"Illegal workers should go back to their own country.","post_message":"Farmers markets are everywhere. But do laborers see benefits? (From PBS NewsHour)"},{"comment_id":"10153287530191336","commenter_b":"A woman who got it 100% correct.","commenter_a":"As women, we have ruined it for ourselves. We can't act like men and then expect a men to act chivalrous towards us. Be a lady, and you might be pleasantly surprised.","post_message":"Is chivalry dead?"},{"comment_id":"535176933316799","commenter_b":"give them hell Mr Trump,she makes me sick everytime i look at her","commenter_a":"Enough of these two !","post_message":"The heat-seeking Trump tweet you just HAVE to see..."},{"comment_id":"10156095135925389","commenter_b":"Donna I believe bush\"s were much better then the Muslim terrorist we have now!","commenter_a":"I do not want Bernie Sanders, Hillary, or Biden!!! Wake up America we need some one who will fix America!!!","post_message":"Question of the Day: Do you think Bernie Sanders can beat Hillary Clinton in Iowa and New Hampshire?"},{"comment_id":"1724147734520564","commenter_b":"First Ladies always ware pearls. Hers are a double strand!","commenter_a":"She's no lady she is only 1 step above hillary Clinton in being the most pathetic excuse for a first lady","post_message":"Has Michelle Obama been a good First Lady?"}]
