[{"comment_id":"1158864987513588","commenter_b":"\"You're the problem\" lol sound like a bitch","commenter_a":"You guys missed the full story here. See what happened was the person who served the food dropped them exact three fries on the floor, that lady was actually being a good Samaritan and helping the cop and taking the dirty fries away for him so he did not get sick. Long story short don't do anything nice for cops because they are assholes and will do everything they can to abuse their power and fuck over the average civilian. I made all of this up of course but all of us know never even talk to a cop unless you absolutely have to because they are just looking for a opportunity to arrest anyone because they are bored. She should have just waited for her own fries. Stupid decisions get stupid results.","post_message":"A woman was arrested in Northwest D.C. for stealing three French fries from a police officer who was dining at a U Street eatery. #WSHH"},{"comment_id":"378200662557944","commenter_b":"Three of them are real ladies - the other two cannot even spell the word!","commenter_a":"Nancy Regan","post_message":"Who is your favorite First Lady ?"},{"comment_id":"10154551399261178","commenter_b":"Ummmmm I don't think so","commenter_a":"The roaches got away...Cleveland turned on the lights , Philadelphia turned out the lights...the roaches got away","post_message":""},{"comment_id":"10154516919809575","commenter_b":"Actually yes it was.","commenter_a":"Full moon?","post_message":"Police are on scene investigating after they say 2 people were shot on the west side.   Six people have been shot since 8:30 p.m. Thursday."},{"comment_id":"10153328761996051","commenter_b":"Put her DUMB ASS in jail","commenter_a":"Meanwhile murders of innocent people take a backseat to this stupid ads story","post_message":"This woman vandalized the office of the dentist who killed Cecil The Lion. Here's how that worked out for her."},{"comment_id":"10153241305633984","commenter_b":"Stupid bitch ,,,,,","commenter_a":"Shes fucking retardes","post_message":"Wow. She is NOT doing herself any favors...  Are her critics right to be outraged?"},{"comment_id":"10152853316636051","commenter_b":"i am with william ship all the illegal immigrants back were they belong and out of here let them do it legally then the trash want make it \\\\","commenter_a":"Deport them all. No hearing, no delay! They broke the law, boot their butts out. Seal the boarders, with deadly force authorized.","post_message":"ICE just rounded up and arrested more than 2,000 immigrants over the course of a five-day operation."}]
