[{"comment_id":"1000962836629860","commenter_b":"Then they need to take ownership of the word terrorists.That is what republicans in congress are. They need accept responsibility for the violence in this country.","commenter_a":"Morons","post_message":"While they sell fear to the American people to get reelected, they sell themselves to the gun lobby."},{"comment_id":"10153703496814087","commenter_b":"#Notwithher #FrackyouHillary","commenter_a":"Hillary is all about terminating babies","post_message":"“I want to say something about this, since we’re talking about the Supreme Court and what’s at stake,” Hillary Clinton said at last night's Democratic debate. \"We've had eight debates before, this is our ninth,” Clinton said. “We've not had one question about a woman's right to make her own decisions about reproductive health care. Not one question.”"},{"comment_id":"10153139427330329","commenter_b":"Jajajaja es el actor secundario N1","commenter_a":"que wea braaaad.. sale hasta en la sopa el ql ajajja Carolina","post_message":"Here is the new Magic Mike trailer. You're welcome."},{"comment_id":"10154869505163812","commenter_b":"Yuck","commenter_a":"Bill Clinton is the pig lets talk about what he did to woman .","post_message":"In light of the release of a recording of a vulgar conversation Donald J. Trump had where he brags about groping women, it seems that very little appears to have ever been off limits for the Republican presidential nominee."},{"comment_id":"10153198007713203","commenter_b":"Poor babies. Why do moms do this....May God for give us all. This needs to stop","commenter_a":"May God have mercy on the world.","post_message":"I left Planned Parenthood after seeing ‘perfectly formed’ quadruplets aborted: former abortion worker"},{"comment_id":"1070333876354408","commenter_b":"She makes my ears hurt.","commenter_a":"She will say anything and she will lie to America like she's always there","post_message":""},{"comment_id":"616683421873704","commenter_b":"I do too, Hillary won that election! They stole it and tainted our votes.","commenter_a":"Not my President impeach impeach impeach","post_message":"Share if you do too! Image by Occupy Democrats, LIKE our page for more!"}]
