[{"comment_id":"10153447585542293","commenter_b":"No, it is true. That's why I've been buying men's razors for years. The women's version of the same razor is always more expensive.","commenter_a":"I don't think this is true. We have options now. I buy a lot of products at the dollar store and later find them in retail for $3-4.00. It's always about comparison shopping.","post_message":"Why it’s smart to buy the men’s version of almost anything."},{"comment_id":"10152691502210927","commenter_b":"I agree they are just like his kids - Brats who think they deserve everything on a silver platter.....Put them back on the top of train cars headed for Central America","commenter_a":"Y r yall so against latinos/ mexicans last i checked they were here n mingled with natives b4 many of urs ancestors, when did they push, steal, lie, march families out of their lands","post_message":"Illegal aliens are just like our kids according to Obama."},{"comment_id":"550023351824286","commenter_b":"Funny Denis.","commenter_a":"Good for North Korea, we have missiles why can't they","post_message":"The rocket was launched on a southward trajectory, as planned, passing over Japan's southern Okinawa islands."},{"comment_id":"10152557805834071","commenter_b":"Exactly in one game... Ooooh make shift O line because no one else in the league had injuries along their oline and threw for 4000 yards right. With those 4000 passing yards how many tds did he throw???","commenter_a":"Wilson = average Qb with any other team besides the shehawk's...","post_message":"He keeps improving."},{"comment_id":"1817386261807116","commenter_b":"I agree! She is pure evil!!","commenter_a":"Totally agree with Newt Gingrich! She has no scruples! She belongs in prison! Cannot stand this heartless woman! She just won't disappear!","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"10154366000234166","commenter_b":"Idiots. Careless. I will be glad to raise the baby.","commenter_a":"Betsy Carver ..unreal","post_message":"Police said neighbors found the toddler outside in 96-degree weather with no water. He was screaming, crying, and trying to get inside."},{"comment_id":"865416670223607","commenter_b":"Your mother is a dumb fuck you ignorant whore.","commenter_a":"WW3","post_message":"Turkish F16s warned the jet over the airspace violations before shooting it down, the military official said."}]
