[{"comment_id":"10153352296609497","commenter_b":"Whether or not you find the humor funny is entirely subjective, of course.","commenter_a":"This isn't satire and it never will be. This is a pathetic example it castigating old people.","post_message":"From our sister publication, ClickHole:"},{"comment_id":"1234498396590570","commenter_b":"Carole, keep your day job and drop the politics. You're a suffering liberal.","commenter_a":"This is big news because conservatives want you NOT to notice that the economy is way up, the deficit is way down, unemployment claims are at a 42 year low, and Obama has unprecedented world approval. So Obama has almost rescued us from the disaster the Republicans left us when Bush was in office. But don't notice that stuff, focus on bathrooms and what Muslims are doing in countries you can't even find on a map.","post_message":"#BoycottTarget  #PRDisaster #TalkIsCheap"},{"comment_id":"10156846569325354","commenter_b":"Get a life lady.","commenter_a":"Freedom of speech is the culprit! Quick! Stop that first amendment drivel!!!","post_message":"It's starting..."},{"comment_id":"419035241611690","commenter_b":"Ladies, use what ever you want, it is no one elses business","commenter_a":"Idiot !","post_message":"This GOP legislator has invented new female anatomy."},{"comment_id":"10154831195946729","commenter_b":"Well, turns out Michelle Obama herself was accused of plagiarizing part of her speech. In fact, the Democrats who are using last night’s speech as a means to cast aspersions might have done well to pause and consider the list of their own high-profile leaders who have been caught plagiarizing.","commenter_a":"Melania Trump Did NOT Plagiarize Michelle Obama’s Speech And This Is Why… The accusation is that Melania Trump “plagiarized” a speech made by Michelle Obama in 2008. Well I’m sorry liberals, she did not. Here are the comments from Michelle Obama in 2008: \"And Barack and I were raised with so many of the same values: that you work hard for what you want in life; that your word is your bond and you do what you say you’re going to do; that you treat people with dignity and respect, even if you don’t know them, and even if you don’t agree with them. And Barack and I set out to build lives guided by these values, and pass them on to the next generation. Because we want our children — and all children in this nation — to know that the only limit to the height of your achievements ...","post_message":"Wow..."},{"comment_id":"10152707448786051","commenter_b":"Are you calling ma a stupid whore","commenter_a":"Humans aren't very nice they are constantly making fun of people for every reason possible so don't be shocked","post_message":"When this police officer heard his co-workers mocking special needs children, he lost it."},{"comment_id":"10154815795872936","commenter_b":"Maybe Canada would take us. They always wanted the Pacific Northwest.","commenter_a":"The rest of the country is dragging California down.. do we really have to be in the same union as knuckle draggers Mississippi, Kentucky, West Virginia, etc.? I'm beginning to agree that California should secede, go our own way.","post_message":"Gov. Jerry Brown's fiery take-down of Donald Trump: \"We've got the scientists, we've got the lawyers, and we're ready to fight.\""}]
