[{"comment_id":"1261193330568342","commenter_b":"George Papasotiriou","commenter_a":"Bruce Cada","post_message":"Here's what it could mean about your brain."},{"comment_id":"10153835564541002","commenter_b":"@username, LEAVE then!","commenter_a":"What happen to \"Land of the free\" ?","post_message":"President Barack Obama suggested maybe it's time to make voting a requirement.  Share your thoughts on this idea -- good idea or bad idea?"},{"comment_id":"683548041835774","commenter_b":"Let them go home!","commenter_a":"Don't like Halloween, keep your children & yourselves in the house with the lights off....","post_message":"Halloween has been banned in this state as not to 'offend Muslims'. This must be some kind of joke. They can't stop us from celebrating. Will you celebrate Halloween regardless?"},{"comment_id":"10153553750251051","commenter_b":"You are a sneaky bitch that can not fool me you brought up color stop with the bullshit. @username","commenter_a":"What do you expect from a repeat offender? Hey justice system you spineless useless system! It's because if your stupidity and loop holes that got that child a life sentence. Those children were given a death sentence by this useless pos. This vile inhumane waste if life still breathes because of your inept logic. If that were my child, I'd hunt that diseased vile pos down and set his black ass on fire...","post_message":"It was already bad enough that this man raped a 14-year-old and a baby. Then it got even worse."},{"comment_id":"10154229049319369","commenter_b":"Being against Christians isn't a religion.","commenter_a":"I am against Christianity so that means I can not serve Christians in Mississippi because it goes against my beliefs?? This law is stupid.","post_message":"The measure allows churches, religious charities and privately held businesses to decline services to people whose lifestyles violate their religious beliefs."},{"comment_id":"897074360335805","commenter_b":"She is an creep and liar..NO FOR PRESIDENT..","commenter_a":"Treason :How about collecting those deleted e-mails .We know you can do it .Obama and few more need to go with her .Sheis not in the boat by herself .Communist","post_message":"Which Hillary Clinton scandal is bigger? Is it the one involving her likely illegal secreting and destruction of email records from her time as secretary of state, or is it the one involving the massive conflict of interest she wholeheartedly embraced by using her family’s nonprofit foundation to collect millions of dollars from foreign government donors — again, during her time as secretary of state? @webpagelink"},{"comment_id":"10155754872529778","commenter_b":"@username The more educated? Ooookay... Silly. Smh They're out there marching for you too. Remember that, girlfriend.","commenter_a":"@username Wow look at these comments. Even from women... Ignorant people... This country is in trouble.","post_message":"Ashley Judd says blood on your pants is a sign you're a woman. FULL SPEECH: @webpagelink MORE: @webpagelink"}]
