[{"comment_id":"608368836001258","commenter_b":"Rigged? Really?? LOL!! Of course ir was and the next ones will be also! Did you notice the \"Hill\" isn't even wearing an American Flag pin? She didn't have any American flags at the convention either till the media mentioned it. A real pice of S===!","commenter_a":"yep when hillery was wired so she could be told what to say","post_message":"A rigged election!!"},{"comment_id":"10154086298502541","commenter_b":"I find this horrific but please take down the pictures","commenter_a":"Where is Al Sharpton when you need him. Lol","post_message":"Police spokesman Anthony Guglielmi said that while the suspects made “terrible racist statements” against white people during the attack, it does not appear to be racially motivated."},{"comment_id":"412094642305750","commenter_b":"Wow, this skank is as dumb as they get. Might be too much time on her back.","commenter_a":"Hey joe, arrest this clown. Lol.","post_message":"It's time for the Sheriff to pay up!"},{"comment_id":"498451153654689","commenter_b":"This is one more reason we need you","commenter_a":"I want to vote for you. However, would you please address the very serious immigration issue.","post_message":"Just spoke to National Right to Life Convention. We are united in cause. Thanks for having me. Defend the defenseless. We are the voice for the voiceless. #HealInspireRevive"},{"comment_id":"771242182992562","commenter_b":"A couple of missals would take care of this problem.","commenter_a":"Hey where are the nasty sharks when you need them?","post_message":"Let's get rid of these scum bags already! @webpagelink"},{"comment_id":"1221564884584907","commenter_b":"No one would stalk you, Hillary!","commenter_a":"Well Hillary, I believe you are safe with Donald. He isn't desperate enough to grab yours ! Besides he is a gentleman, not all men are like Bill Clinton.","post_message":"Seriously? So lame..."},{"comment_id":"10153008307071130","commenter_b":"Justifying double standards while still playing the perpetual victim. Yay modern feminism.","commenter_a":"Are we not gonna talk about how a 50+ year old lady forced herself on a 20 something guy? Because if it was the other way around, I'm sure you'd have milked it every possible way.","post_message":"In the ongoing saga of things brands should never tweet..."}]
