[{"comment_id":"10153231447637217","commenter_b":"But if she was an alcoholic, it would be okay","commenter_a":"...and yet we allow 16 year olds and younger to raise children because 'if you do the crime, do the time' BUT HEAVEN FORBID THAT YOU SMOKE MARIJUANA","post_message":"Sindy Melany Ortiz says a hospital is restricting her access to her newborn daughter because she smoked marijuana."},{"comment_id":"10153396181678908","commenter_b":"Good morning through Facebbok","commenter_a":"Beth Bethy Lockwood","post_message":" are confirming the health benefits of meat-free eating. Nowadays, plant-based eating is recognized as not only nutritionally sufficient but also as a way to reduce the risk for many chronic illnesses. Harvard Medical School"},{"comment_id":"1008939885848662","commenter_b":"Thank you.","commenter_a":"I hate ghetto ratchet ignorant hood people. Their lives are so mediocre they literally just take up space and resources.","post_message":"The disrespect!"},{"comment_id":"421137708047770","commenter_b":"Lady, you're an idiot!","commenter_a":"Your amazing trying to explain to limited, CNN stupid reporter how dangerous Iran is. Thank god for you! I'd vote 4u any day!","post_message":"ICYMI: I joined The Lead with Jake Tapper to discuss my open letter to the Iranian Government. WATCH:"},{"comment_id":"10154190292923908","commenter_b":"My balls itch !","commenter_a":"perhaps they learned something from mother nature, (she fights back) with a swift justice. earthquake anyone else ;) it's time to rethink the old ways and start a new, where nature comes first <3","post_message":"Good..."},{"comment_id":"10154212548441496","commenter_b":"You. Have got to be kidding He is a traitor to America and it's people","commenter_a":"That's a joke","post_message":"Agree or disagree: America is a stronger country after eight years of Obama."},{"comment_id":"10153944195789456","commenter_b":"Wht a woman will do against their children over a man. Smfh","commenter_a":"They should be stoned to death!! Wasting bullets on them is too humane....","post_message":"HORRIBLE: A 3-year-old was found duct taped in a trash bag in a closet in Arizona, and was surrounded by feces. Here’s the disgusting reason the suspect allegedly hid the child:"}]
