[{"comment_id":"10152950210572169","commenter_b":"Clearly this woman lost her remote control long ago","commenter_a":"I will be glad when he is gone","post_message":"Saying goodnight to stupid pet tricks, top 10 lists and David Letterman (From PBS NewsHour)"},{"comment_id":"997885863556217","commenter_b":"LOL -like a woman has time for that","commenter_a":"That was a woman who was all masked up","post_message":"The clinic staff say they aren't going anywhere"},{"comment_id":"1219006891496424","commenter_b":"They do not have a right to do so ILLEGALLY! God's Word says to obey the LAWS!!!! Read your Bible pope.","commenter_a":"In Syria , not here!","post_message":"Pope Francis said each refugee \"has a name, a face and a story, as well as an inalienable right to live in peace and to aspire to a better future\" for their children."},{"comment_id":"1032100616836565","commenter_b":"This Woman is pure Evil.","commenter_a":"hillary maggie mae clinton..........cause the morning sun, when its in her age really shows her age","post_message":"Pro-abortion politicians have ramped up their war on the unborn for 2016. It's up to us to do everything we can to protect them by continuing to build support behind the Life at Conception Act!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb171"},{"comment_id":"10157133614025354","commenter_b":"Put the bitch in jail once and for all","commenter_a":"It's better to wait until after Obama is president to do anything to her. If something was to happen before then, he would give her a pardon.","post_message":"Don't worry, Hillary. The FBI is just getting all the findings from its one year investigation in order before giving you the chance to lie yet again about how you committed HISTORIC breaches of national security and auctioned State Dept. policies through the Clinton Foundation. #ClintonCash"},{"comment_id":"1308657809199446","commenter_b":"Please! Let her stay home.she's not needed there are many others to take her place.","commenter_a":"Let her stay home.","post_message":"One of the dancers felt \"embarrassed and disappointed\" by performing at Trump's inauguration."},{"comment_id":"1730793227218701","commenter_b":"My dad years worked in the fields of Arizona I whent with him knights we would spent checking the water pipes it's hard work but he was a proud man I learned a lot from him the truth is they won't last a night it day in the fields they beg that's all they do lazy","commenter_a":"Yeah right !","post_message":"They wouldn't last a day!  Video by Occupy Democrats, LIKE our page for more!"}]
