[{"comment_id":"10153098697497522","commenter_b":"Let's see how \"sassy\" you dumb bitches are when ISIS gets you. Take your #raisesassygirls bullshit to syria.","commenter_a":"#VOTE The Republican Radical Christian Crazy #PARTYOFHATE out of local state and Federal Government #ENOUGH #VOTE #GUNSENSE #VOTE #Hillary2016 #WitchHunt #BroomsUp #BlackLivesMatter #RAISESASSYGIRLS #FeVoteRising #DontBeAwaLLfloWer #VOTE","post_message":"Is Donald Trump suffering from imposter syndrome?"},{"comment_id":"10153748749906336","commenter_b":"I want to applaud those that entered our country illegally and their main priority was to become legal and accomplished it. Talked to some that did just that as a priority. Yet, we have the illegals that come and breed like rabbits for an anchor babies. Free benefits. Or men that leave family in other countries, shack up with a women here and start rutting to produce too. Instead of becoming legal. Some have been here over 20 years. If only all would follow the steps to be here legally we would not be as we are today.","commenter_a":"I'm Hispanic and I support Donald J Trump for president Donald J Trump for president","post_message":"WATCH: Donald J. Trump invites a woman onto the stage at a Nevada rally. “I’m Hispanic and I vote for Mr. Trump!”"},{"comment_id":"1191127007601184","commenter_b":"Sometimes it takes longer for the other egg. They don't always lay both at the same time. And if was a bad egg she would get rid of it.","commenter_a":"It's crop never seems to look full?","post_message":"AFTERNOON #HATCHWATCH2017: Anytime now, the second eaglet is expected to hatch. A New Year's Day birth, perhaps? Video courtesy of Dick Pritchett Real Estate @webpagelink"},{"comment_id":"10153250211681336","commenter_b":"Seems like a lot of immigrants spouting out of their pie holes when no one knows what happened yet.","commenter_a":"AM I THE ONLY ONE WHO THINKS ALL THESE DERAILMENTS IN THE LAST FEW YEARS ARE BY TERRORISTS????","post_message":"“It is an absolute disastrous mess. Never seen anything like this in my life.”  Philadelphia Mayor Michael Nutter confirms at least five people are dead and 53 have been transported to hospitals with six in critical condition after Amtrak train 188 traveling from Washington, D.C. to New York derailed Tuesday night. @webpagelink"},{"comment_id":"1560631690895039","commenter_b":"Good for his ASS. I hope they rape him in prison nite and day. Carma is a BITCH lol","commenter_a":"the sentence is more lenient than what he deserves","post_message":"There is no punishment severe enough for these heinous crimes."},{"comment_id":"1806555102961372","commenter_b":"Why does she keep bringing up controversy. Be done with it Megan! And get over yourself!!!","commenter_a":"Obama has flooded our country with muslims over the last 8 years to buy votes and destroy our country. America First an no PC.","post_message":"\"I welcome immigrants. I welcome people from all over the world to join us here. But I want to make sure that it's safe for Americans in my country that I fought for,\" Carl Higbie told CAIR Florida leader Hassan Shibly."},{"comment_id":"10153660041871770","commenter_b":"Shes a idiot to.like we care what a gold digger has to say oh she fits in with crooked Hilary","commenter_a":"Who cares care","post_message":"What?!"}]
