[{"comment_id":"10155104140119497","commenter_b":"Build that wall, watch all the libs fall on ground kicking ...priceless..let the shit show begin...popcorn anyone?","commenter_a":"I thought the Onion was supposed to be funny.","post_message":"How The Border Wall Will Be Built"},{"comment_id":"10158045305755206","commenter_b":"Never get a mortgage if you lose ur job your F ed.My gran always said get a council house,If anything goes wrong they have to fix it,If you lose your job they have to pay your rent.","commenter_a":"@username read the comments.We Defo got to do the outer boroughs next time! X","post_message":"“I wouldn’t give this up for anything.”"},{"comment_id":"10152982959796130","commenter_b":"AMEN!","commenter_a":"Every member of Congress should do the same","post_message":"The #FoodBankNYCChallenge is meant to raise awareness about hunger and the struggle to live on such a limited budget."},{"comment_id":"893405944041287","commenter_b":"Slap a hoe","commenter_a":"@username What An Idiot She Is","post_message":"Mom Forgets Her Baby In A Shopping Cart A valley mom walked out of a Fry's store in Gilbert this afternoon but left her newborn behind in the shopping cart. 40 minutes later the panicked mom realized her mistake and went back to get him. The baby is back with his family tonight. Photo: Katie McCulley. Full story: @webpagelink"},{"comment_id":"10152790927666051","commenter_b":"Sport illustrated is worse, these are woman with their babies, that's all. No big deal.","commenter_a":"Kai","post_message":"This woman was very surprised when her photos were removed. She didn’t think they were inappropriate at all. Decide for yourselves whether they should’ve been taken down."},{"comment_id":"10153178842572061","commenter_b":"Give me a break!!! I do NOT want her as a role model for my daughter!!","commenter_a":"So it's for self gratification and not to improve our country? Gotcha Hills. Now go away.","post_message":"Hillary Clinton starts of debate by saying: \"For me, this is about bringing our country together fathers will be able to say to their daughters, you too can grow up to be president.\" abcn.ws/1R9qmZ2"},{"comment_id":"10153126452213854","commenter_b":"Yep, idiots. Gays will lose more than their heads from muslims.","commenter_a":"Good luck with that","post_message":""}]
