[{"comment_id":"10155235641066037","commenter_b":"Very true, so it's OK for them to think they can sneak in because they can't afford to become a citizen? We have plenty of people out of work and those are jobs the unemployed could be working now isn't it. No wonder Trump wants to cut funds to these city's. That opens up more jobs to Americans, because there is a minimum wage in states and you are not suppose to hire illegals.","commenter_a":"Sanctuary city's think the above the law and don't have to enforce the law.","post_message":"'I don't have a clue,' said U.S. Homeland Security Secretary John Kelly."},{"comment_id":"10153257299639071","commenter_b":"'@username another Hilidiot who will blindly vote for a woman for no other reason than wanting a female president.","commenter_a":"Let's be honest about this. The only reason they gave back access is because a court battle over this would have revealed to the public that every democratic campaign had access to those records, and when the Sanders campaign reported it, nothing was done. Which would have highlighted not only the DNC favoritism of Clinton, but of the fact that they have been working to shut down Bernie at every turn. Which would have meant public acknowledgement of Bernie actually having a chance to win.","post_message":"Bernie Sanders sued, and the Democratic National Committee backed off, but it's not over yet."},{"comment_id":"931634046893125","commenter_b":"Because she is vermin....","commenter_a":"Why are there so many Hillary hating Trolls on here?","post_message":"'We can’t hide from hard truths about race and justice. We have to name them and own them and change them.'—Hillary"},{"comment_id":"1087900891233676","commenter_b":"The country would be safer if deported the republican/Tea Party.","commenter_a":"Thats why this year to come. I invite all registered voters to hit the polls. So this son of biatch don't win.","post_message":"After seeing Trump on TV, 8-year-old Sofia was terrified that the army was coming to take her away."},{"comment_id":"2108841499340180","commenter_b":"VICTORY FOR TRUMP ! . .FEDERAL PEN FOR THE LYIN' QUEEN !","commenter_a":"Save your money,this election will not be bought","post_message":"Nigerian billionaire Gilbert Chagoury pledged one BILLION dollars to Hillary and Bill Clinton's Foundation. That's billion--with a 'b.'   Now why would a Nigerian oligarch with a past like his do such a thing?"},{"comment_id":"10154740685431337","commenter_b":"Hillary is the whore of Islam.","commenter_a":"If Hillary is elected president, Putin said he will wage nuclear war against the United States, but I guess that's not a big deal...","post_message":"Barack Obama's 10 Essential Sci-Fi Movies And Shows:  The Matrix Star Wars: Episode IV Star Trek: The Original Series Cosmos (...)"},{"comment_id":"642467755916056","commenter_b":"'@username # F*ck Hillary","commenter_a":"Clinton the queen of Benghazi and hidden e-mails. Just look at the media. They are piling on Trump while giving Hillary a pass. The debates are still too come. There is a long way to go. Hillary is a sociopathic liar and should never be president. @username and the polls mean nothing right now.","post_message":"Hillary Clinton opened up a 15-point margin over Donald J. Trump in one of the polls."}]
