[{"comment_id":"10153606515353132","commenter_b":"She was annoying to watch.","commenter_a":"Brandi was the only person who made the show entertaining #BadMoveBravo","post_message":"Will you miss Brandi on The Real Housewives of Beverly Hills?"},{"comment_id":"750335681823676","commenter_b":"Trump and his mindless supporters are a NATIONAL EMBARRASSMENT !!","commenter_a":"Trump gonna have alot obama f-ups to fix right","post_message":"BREAKING: Trump Drops Bombshell About Obama... He Just Exposed The Unthinkable He is trying to cover this up as quickly as possible. Let's spread it. Do you think Trump would make a better president than Obama?"},{"comment_id":"10154434142778822","commenter_b":"The new laws in place are great for addicts but not so much for those experiencing post-op pain. Again, everyone is paying the price for addiction.","commenter_a":"There are legal opiate drugs and you don't get refills.","post_message":"Opioid addiction is an epidemic in our region and throughout the country. The numbers are preliminary, but deaths from drug overdoses have hit another all-time high in the region in 2016… and the crisis is showing no signs of slowing down."},{"comment_id":"394396457415315","commenter_b":"Muslim women why do you want to stay somewhere your notttttttt wantedddddddd !!!!!!!!!!!","commenter_a":"There was nothing wrong with America until THEY came here to destroy everything we have worked so hard for!!! She and eveyone like her needs to go back where they came from!!","post_message":"“You Are Everything That is Wrong in America”"},{"comment_id":"10154700417126323","commenter_b":" This is why women worldwide have body issues. Because nasty bitches like this one feel it is their duty to mock and body shame. Well shame on her for bringing the world down a notch in my estimation...","commenter_a":"'It's not the person I am' well it is love because you took the picture and posted it. Goes to show beautiful on the outside not at all on the inside.","post_message":"A Playboy model who used social media to body shame a 70-year-old woman at her gym was charged with invasion of privacy by the Los Angeles city prosecutor on Friday."},{"comment_id":"10154277505591509","commenter_b":"At the end of the day, Banning Muslims from this country isn't going to fix the problem. They will find another way to hurt us. It's an ongoing threat that's not going to stop unless you eliminate the threat.","commenter_a":"I've never seen so much racism in my life, say it ain't so, but the comments and the reactions are very disturbing.","post_message":"\"The fact is what Donald J. Trump said yesterday disqualifies him from serving as president,\" The White House Press Secretary Josh Earnest said Tuesday. @webpagelink"},{"comment_id":"1122827437738266","commenter_b":"Go home Elsa, you're drunk....","commenter_a":"the cold never bothered us anyways... amirighyt?","post_message":""}]
