[{"comment_id":"10153451774798132","commenter_b":"Some lesbians dress like men everyday.... Just saying.","commenter_a":"HE SAY'S HE IS A WOMAN BY ALL MEANS, BUT STILL DRESSING IN MEN'S DRESS SHIRTS?? humm I don't get that","post_message":"Here's what everyone will be talking about tomorrow."},{"comment_id":"10153122678405950","commenter_b":"Get another job lady!","commenter_a":"Where was her God when she divorced and remarried three times over? Can't hide behind religious beliefs when you can't follow them yourself.","post_message":"Before returning to work today, Ky. clerk Kim Davis said she is being \"forced to disobey her God,\" and that she still won't authorize marriage licenses for same-sex couples."},{"comment_id":"10155934597900354","commenter_b":"And that is why this RINO will loose ..solution enforce ..the ..laws on the books now . Punish companies for violating the law ..make the fine so harsh they will not even think it ..with no jobs the illegals will self deport ...problem solved .in 3 months here is the 3 rd grade math ..20 million illegals ..10 million Americans out of work a high percentage of them are black .just think if 20 millions jobs opened up in the next 3 months ..what would that do for the black community ..IT WOULD HELP SOLVE A LOT OF PROBLEMS .","commenter_a":"Sneaking into a country illegally is NOT an American value either.","post_message":"Okay Jeb"},{"comment_id":"10153708234594199","commenter_b":"Then go. If they let you in. Otherwise.... You might end up an illegal alien. Ironic, eh?","commenter_a":"Canada looks better everyday.","post_message":""},{"comment_id":"938149182885501","commenter_b":"I lived in a place in LA and I'm a clean freak but the apartment on the other side of the wall was dirty people causing me to get roaches. Now I moved outta Florida for one of those reasons. Thankfully I don't see them in Washington state","commenter_a":"Thanks for the report as high as rental apartment are they should have pest control ridiculous!!","post_message":"Imagine opening up every cabinet and drawer, and seeing nothing but roaches... Mark Rivera took the residents' concerns straight to management STORY: @webpagelink"},{"comment_id":"1393467647339928","commenter_b":"Yep, that is exactly what I believe!","commenter_a":"I was a democrat and anti gun, after I saw San Barnadino I changed my opinion .rump is right if we had few people in that work place gun straped around their hip bullets would have go the other way too. We could have kill those radical fanatics right there and the death toll of Americans would have been much less. I can guarantee that.","post_message":"BREAKING: NRA endorses Donald Trump at national convention"},{"comment_id":"1233016690120338","commenter_b":"I would say #NeverHillary. Write in Bernie OR anybody else. The woman is so corrupt.","commenter_a":"\"Superprepared warrior\" is absolutely nothing you should be proud of. You're a disgrace to world peace and America. America will never elect someone as insidiously corrupt as you. Hope the FBI comes knocking soon!!!","post_message":"“On April 19, New York Democrats will have unusual say over the party’s nominee. They have in Clinton a superprepared warrior realist... By choosing Clinton, Empire State Dems would powerfully signal that the party has gotten real about achieving long-sought goals.” —New York Daily News nydn.us/1Vn9bcK"}]
