[{"comment_id":"1925997537627031","commenter_b":"Hillary is a criminal who should be facing years behind bars.. I can't see why anyone would support a criminal for president.. Felons cannot vote let alone run for president.. How could we expect a actual change from what we have now with her? Never gonna happen. If Trump don't win the election, U.S. is gonna be in worse shape than it is now..","commenter_a":"Mr Trump, there is a stellar idea going around on FB about the possibility of flying in the families of the Benghazi victims to join you at the RNC Convention!! Consensus is strongly for this idea. I hope you or someone on your staff sees this comment..God Bless You.","post_message":"I will be making the announcement of my Vice Presidential pick on Friday at 11am in Manhattan. Details to follow."},{"comment_id":"10155647671150354","commenter_b":"She is a racist and a total disgrace!!! She encouraged the thugs to destroy Baltimore; what a LUNATIC!!!","commenter_a":"She also believe that is disrespectful to ask a Liberal a real question and expect it answered with out making a quote that your question is disrespectful to there position. Attention Liberal Politicians: every aspect of your your public life, how you act, what you say and your political views are all fair game in the management of the public safety.","post_message":"What do you think? Was the reporter being rude?"},{"comment_id":"1703022976604096","commenter_b":"For everyone trying to give intellectual insight to a Trump supporter, you're wasting your time. I don't expect any moron to get it, neither should you. With Newt, he's guaranteed to lose, and be irrelevant, and then the rest of ua educated americans can get back to a #TrumpFreeReality . #TrumpSupportersareMORONS #DumpTrump #AMERICAISALREADYGREAT","commenter_a":"Absolutely I would vote for these two gentlemen. Newt could and would immediately provide the information and experience to \"hit the ground running\" I believe this would be an awesome team.","post_message":"Rumors are swirling that Donald Trump could pick former House Speaker Newt Gingrich as his running mate. Would you vote for this ticket?"},{"comment_id":"10158501274630389","commenter_b":"Put her back in prison or deport her.","commenter_a":"She has all the qualifications to head up the DNC or Planned Parenthood.","post_message":"Despicable."},{"comment_id":"768354383300233","commenter_b":"@username Go ahead and Kick the Tea Partiers and Trumpetiers out of the GOP, MARY JANE FAGALA! WHAT YOU WILL HAVE LEFT SHOULD BE ENOUGH TO HOLD A STRATEGY SESSION ON HOW TO REACH OUT TO DISAFFECTED DEMOCRATS, SOCIALISTS, COMMUNISTS AND LOTS OF OTHER \"ISTS,\" BUT YOU WILL HAVE LOST ALL THE POWER THAT THE TEA PARTY DELIVERED TO YOU. LOTS OF LUCK!!","commenter_a":"If the GOP think the people are ANGRY NOW,,,,just wait until they try a brokered convention!! It will be mayhem. The LAST NAIL in the coffin of the Republican Party!! You can take THAT TO THE BANK.","post_message":"A brokered convention seems to be all the talk in the Republican party right now, but there's a real split in who's supportive of the idea... Do you think Ted Cruz is right about this?"},{"comment_id":"10153747219101350","commenter_b":"Screw you, you ignorant bitch!","commenter_a":"But don't worry, I am sure they psychiatrists will say it is a syndrome, that needs understanding.... TALK!","post_message":"\"There's the anxiety that comes from dealing with unwanted and often unasked-for interaction with the public during an intimate chore [like] folding underwear.\""},{"comment_id":"10158192109115206","commenter_b":"Moms Le Lotpi go to the kitchen? Is that where you think all woman belong? So ignorant.. Put your wife in the kitchen!!","commenter_a":"Wtf is wrong with these parents today. Heartless, deranged animals! Torture her slowly to her death..","post_message":""}]
