[{"comment_id":"10152996410034330","commenter_b":"How about if we all carried guns to protect ourselves from worthless losers like this. Just kick them off the planet and they never will rob anyone else, thats for sure...","commenter_a":"Yes Paulette in a perfect world one could go to the ATM, grocery store, or anyplace else anytime at all, however in the real world there are criminals and scum who do prey on people when they make themselves vulnerable. Police and other security people cannot be everywhere to ensure nothing ever goes wrong. It's just common sense to use caution and good judgment when out alone.","post_message":"FRIGHTENING VIDEO: A woman who pulled up to an ATM was kidnapped at gunpoint and forced into her trunk and the whole ordeal was caught on video ---> @webpagelink The suspect even gave police a good look at him"},{"comment_id":"494998494021091","commenter_b":"Probably because nobody wants to get that shit all over their car. I know I wouldn't.","commenter_a":"Diane Abramson, seriously, how has nobody \"accidentally\" run over Cruz in a crosswalk yet?","post_message":"The man behind Donald J. Trump's Muslim ban is on Ted Cruz's list of trusted experts."},{"comment_id":"10156556593115725","commenter_b":"she looks hot","commenter_a":"Nando Martinez - SHE IS A DOCTOR - @username","post_message":"A doctor has been placed on administrative leave after a controversial video showing her violent scuffle with an Uber driver went viral -----> @webpagelink"},{"comment_id":"713883512069088","commenter_b":"@username you don't look old enough to know what that women has been doing for the last 40 years.You better hope she isn't the next President she is going to bring in 65,000 more illegal immigrants so when they molest part of your family and the police can't do anything about it. Because she has tied their hands what are you going to do. Blame someone else like she does.","commenter_a":"Why don't the democrat fools stop beating on Trump all the time , They would love for him to drop out then we would have crooked Hillary running every thing, She will never be my president she is the biggest liar on this earth and the lowest scum on this earth ! !","post_message":"Donald J. Trump's campaign chairman Paul Manafort said the report that the GOP nominee asked about using nuclear weapons in a security briefing is \"absolutely not true.\" @webpagelink"},{"comment_id":"602171783246943","commenter_b":"I think he is a prick he makeing the country he inn charge with killing off his own people as black. And look at what they saying on here about him he needs to send two b52 bombers and carpet bomb all these evil peope o. Here calling him names lol","commenter_a":"I'm ready!","post_message":"\"The American People must be willing to call Barack Obama what He is in order to Defeat Him\""},{"comment_id":"10153195782398984","commenter_b":"she is a witch","commenter_a":"She's a BIG box of rancid nuts , and there are plenty more in there with her !!!!!","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10153640608237217","commenter_b":"All rights should be removed from these benefit shoppers. Refugees have an easy passage, it is only benefit shoppers that get into a boat. Look at the streets of Germany and Sweden now. Full of parasites loafing around with no intention of getting a job. The come for a free ride and have no intention of contributing.","commenter_a":"Almost all of the migrants in the Mediterranean are coming from Sub-Saharan Africa, who have no excuse to join Europe. It's been highlighted that most refugees from Libya (in civil war) have travelled to Egypt or Tunisia, instead of Europe. Even worse, they're just doing it for economic benefit (trying to get deep into Europe eg. Germany etc)","post_message":"The deaths are the result of three shipwrecks off the Libyan coast, UNHCR, the UN Refugee Agency says."}]
