[{"comment_id":"1945808648983136","commenter_b":"This Fucking pussy","commenter_a":"What a freak thus guy is!","post_message":"Must-watch. Morning Joe, a Republican, was left speechless by top Trump advisor Stephen Miller's dictatorial, lie-filled performance on the Sunday shows.  Shared by Occupy Democrats, LIKE our page for more! Video from MSNBC."},{"comment_id":"10153184111444877","commenter_b":"these now women were looking for an easy ride to stardom so was their mothers who allowed them to be around a grown man in some hotel.","commenter_a":"I think she's screwed up!! I can understand her need to defend black folks but this guy??,","post_message":"Whoopi Goldberg defends Bill Cosby: 'He has not been proven a rapist.' Watch what else Whoopi had to say below.   Grio fam, what do you think of Whoopi's comments?"},{"comment_id":"1115311211854904","commenter_b":"We don't need more people coming here from anywhere. Immigration is to benefit the country not the immigrant. We gain nothing by allowing more here when we can take care of our own","commenter_a":"North Carolina here voting TRUMP 2016","post_message":"'I'm the only one that speaks my mind and tells the truth and everybody knows I'm right.'  Today on 'MediaBuzz,' Donald J. Trump discussed his proposed temporary Muslim ban. @webpagelink"},{"comment_id":"10153138411643717","commenter_b":"FULL SAILS!! SHE CAN TAKE IT!","commenter_a":"Capt. Kenway ?!","post_message":"El Galeon Andalucia, the only galeon class vessel in the world sailing today, will be in Portsmouth Harbor beginning this week: @webpagelink"},{"comment_id":"10153277275566336","commenter_b":"Thugs!!! This has got to stop!","commenter_a":"Breaks my heart!","post_message":"Omaha, Nebraska police officer Kerrie Orozco was killed in a shootout a day before she was scheduled to go on maternity leave."},{"comment_id":"942978109072863","commenter_b":"You're supposed to protect your children not potentially ruin them.","commenter_a":"Ever think of asking her why she steals? How about showing how her loved ones are affected by her stealing, a family intervention. How about telling her that you love her and if there's ever anything that she needs, she can ALWAYS come to her father!","post_message":"Too far or just punishment?"},{"comment_id":"529094357257035","commenter_b":"No, no I'm not.","commenter_a":"You are just another phoney.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
