[{"comment_id":"10153575061332411","commenter_b":"I Won't Vote For Kirk, Either!!!!","commenter_a":"Oh come now, he's a multi-billionaire businessman he knows how to talk nice when he needs to","post_message":"\"Trump has not demonstrated the temperament necessary to assume the greatest office in the world,” Kirk said in a statement."},{"comment_id":"10154290934583258","commenter_b":"She started it!!!","commenter_a":"Elizabeth, do not respond to Trump! Why are u engaging in this? It is beneath u.","post_message":"Donald J. Trump and Elizabeth Warren lobbed insults again on Twitter Wednesday."},{"comment_id":"10154861039595575","commenter_b":"What is this woman doing Hallucigenics?","commenter_a":"i thought she was paying them to leve, and she made a big mistake,,, what the hell, is this old or what,","post_message":"They call her the Hillary Clinton of Europe..."},{"comment_id":"10153734368245950","commenter_b":"Here's another dense one told all her life she's witty","commenter_a":"It sounds like some shyt white Americans did to build this country then brag and say they did. Then tell u get over it.just saying the story sounds familiar","post_message":"The captives were sometimes held in chains, whipped, beaten and threatened, underfed or made to eat off the ground, according to a statement."},{"comment_id":"840567656083161","commenter_b":"Karla Huitron cause yo ass can eat","commenter_a":"Marry her ass quick!!!","post_message":"What u doing? #WSHH"},{"comment_id":"1006112072821407","commenter_b":"Demand Justice..Hillary doesn't deserve a Free ride.....","commenter_a":"Clinton Mafia is on the Move #NeverHillary #NeverAgainBill!!!","post_message":"FBI Director James Comey detailed Hillary Clinton massive destruction of government records and grossly negligent handling of classified information. Frankly, there a disconnect between Comey devastating findings and his weak recommendation not to prosecute Hillary Clinton. Federal prosecutors, independent of politics, need to consider whether to pursue the potential violations of law confirmed by the FBI."},{"comment_id":"10154716616787908","commenter_b":"It looks like GE is moving part of it's head quarters to Boston, since Boston will give them a $25 million dollar tax break! It's all about the deal! I'm told that what they're giving back is just a drop in the bucket compared to what they'll get. We're so lucky!","commenter_a":"Yes BERNIE Yeeeeees","post_message":"I didn’t hear the head of GE and all these CEOs who ship jobs to China asking the Chinese for a bailout check in 2008. Instead, after laying off American workers they came begging the American taxpayers for a bailout."}]
