[{"comment_id":"10154442761894094","commenter_b":"Hopefully the other morons follow his wise protesting technique on Friday. Idiot.","commenter_a":"cool..or should i say hot...lol","post_message":"Two days before the inauguration, one man has started his crusade against President-elect Donald Trump, and it nearly cost him his life."},{"comment_id":"10153577547513352","commenter_b":"Amber shut your ass up looking like momma June. Fat ass","commenter_a":"This sight sucks","post_message":"In sickness and in health: Soldier marries fiancée despite brain injury that left her unable to recognise him just days before their wedding… and then spent five years teaching her to walk, eat and speak again"},{"comment_id":"1493294134044387","commenter_b":"She is pure evil & should be put to death.","commenter_a":"Hillary is done the writings on the wall god look at the rallies know it's there for her no signs no bumper stickers no T-shirts and say Hillary for prison. She's a criminal and should prosecuted","post_message":"Wow!"},{"comment_id":"10153619643270329","commenter_b":"Jordan Selph","commenter_a":"Jackie Hollander","post_message":"Bastille Day, As Told By Sloths"},{"comment_id":"1188535021166526","commenter_b":"This is ridiculous! Impeach her and be done with this !","commenter_a":"\"Just because 5 Supreme Court judges make a ruling, it not a law,\" said Kim Davis's 4th and evidently very well-read husband","post_message":"Kentucky clerk Kim Davis’ husband Joe says his wife will never resign and calls out the judge who ordered her behind bars. @webpagelink"},{"comment_id":"10155790474957316","commenter_b":"*she's a woman","commenter_a":"Um...He's a guy so....","post_message":"Manning had been a candidate for gender-reassignment surgery, which would have been paid for under the Pentagon’s new policy for transgender troops. But the terms of the 35-year sentence the court-martial imposed includes a “dishonorable discharge,” which the commutation did not affect, Army spokeswoman Cynthia Smith said Wednesday."},{"comment_id":"966246990097370","commenter_b":"Umm Ferguson, Watts Riots, La Riots. White people are out of control? Ok","commenter_a":"I pray for their families","post_message":"White supremacists shoot five people near the #BlackLivesMatter protests for Jamar Clark, a 24-year-old unarmed black man who was shot earlier this month by police. Protestors took to Twitter after the shooting & described the scene as chaotic, saying police maced the crowd before an ambulance arrived to assist the wounded. No arrests have yet to be made. DETAILS ----> @webpagelink"}]
