[{"comment_id":"10153796451206491","commenter_b":"STFU","commenter_a":"Wanna help stop racism? Quit talking about it","post_message":"\"The more we learn about who we are and how we got here, the more we will mobilise\""},{"comment_id":"1727548687496080","commenter_b":"HILLARY CLINTON IS AN ARROGANT NARCISSISTIC SOCIOPATHIC LIAR AND VERY EVIL WOMAN !!","commenter_a":"Time will tell","post_message":"We'll see what ends up happening..."},{"comment_id":"10154528764136955","commenter_b":"TO ALL AMERICANS - PLEASE WAKE UP AND SMELL THE ROSES. Whether you like TRUMP or not, he is the only viable candidate. If you want all of the above to happen, the lost of 5 amendments to the Constitution that we all learned about in school and everything else she wants to do to put this country into the ground for her benefit only ( REMEMBER, SHE LIVES ON OTHER PEOPLE'S MONEY), we have to work hard for ours, then HILLARY is your girl. If you want the opposite, to save all our rights and freedom, more jobs, getting better and cheaper health insurance (UNLESS YOU WANT TO PAY REALLY HIGH PREMIUMS), a strong military should we ever need it, keeping the refugees out of this country (otherwise you will find them right in YOUR OWN BACKYARD), childcare for all working women (who make up 40% of the workforce), ...","commenter_a":"Lol Trump was winning anyway see yea dumas Hillary quacks","post_message":"PAPER: Dems should ask her to step aside..."},{"comment_id":"10150833830084963","commenter_b":"What you should get is that it is too bad your mom didnt see you as cells and abort. Ouch stings like that.","commenter_a":"I can not understand why Republican women believe that their bodies and their minds belong to ANY government. If you do not believe in abortion, do not have one.","post_message":"Though the 2017 Official March for Life is happening today, there are indications that most Americans still approve of Roe v. Wade."},{"comment_id":"10155035206479369","commenter_b":"Build that wall!!!","commenter_a":"BUILD THE WALL","post_message":"Immigration fees are being hiked for the first time in six years."},{"comment_id":"1576025939362143","commenter_b":"This is America not European dont like America go back to European take DONALD TRUMP with you ok gringo","commenter_a":"Why are people dumb enough to think people who do not want illegals in the US hate Mexicans? Or any other foreigner? It is ILLEGALS that they want to regulate, no those entering the country legally. We could do without the wall, just get more Border Patrol and more bullets...and do like other nations, shoot those crossing illegally, maybe that would satisfy the supporters of illegal immigration... Read up on Mexico's illegal immigration law.","post_message":"Former Mexico President Vicente Fox is sorry, not sorry about his big middle finger to Donald J. Trump and his proposed wall along the U.S. southern border."},{"comment_id":"513866205470626","commenter_b":"This IS STILL AMERICA and I'll go where ever I want, if those pigs fuckers try to stop me it will be the last thing they do before meeting allah in hell","commenter_a":"They need to obey American laws. As all do who live in this great country.","post_message":"Video coverage from the Shariah 'No-Go Zone' has been released.  This is America. If you don't like it you can get out.  Do you agree Shariah Law should be banned in America?"}]
