[{"comment_id":"10154089645681336","commenter_b":"Seriously Paula??? Smh! Pathetic!","commenter_a":"It's lice. We all got it in the 70's while in school. It's not life threatening. So it's harder to kill. If it's bad, I agree with shaving the head. It's hair. It will grow back. On average hair grows an inch per month. You can't stop kids from being kids and rolling around on the ground or jumping into leaves. So they get lice. Deal with it.","post_message":"What can you do if your child is affected?"},{"comment_id":"10153542197218984","commenter_b":"This wouldn't be my daughter. First, they are in your country not theirs. They need to assimilate. This is why Muslims are taking over Europe. Read the book, \"While Europe Slept!\" Once we get a Christian president in the USA, the Muslims here will go back to their cubby holes. The Muslim president we have are giving them a very false sense of security.","commenter_a":"Unbelievable. They don't want to follow American customs, go back to wherever you came from.","post_message":"This school just ordered parents to make sure their daughters made Muslims happy in a sick way... this is full-on surrender. Spread this story... your children's school could be next!"},{"comment_id":"1286627034690657","commenter_b":"Nope she will lose","commenter_a":"Hillary Clinton the next President of the United States.","post_message":"'WE HAVE A VERY SERIOUS PROBLEM' Hillary Clinton points out a striking divide in the criminal justice system in America during Sunday's NBC News-YouTube #DemDebate. Catch all the highlights here: @webpagelink"},{"comment_id":"10152743678847434","commenter_b":"Danielle D'Andrea This bitch is my hero","commenter_a":"@username lolololol save above the knee","post_message":"\"I didn’t lose my two front teeth until I was in 5th grade, which is late. And that very same week, I got my period. Which is early. So I was just this jack-o-lantern with tits walking around, and I had one of those moms that was like, ‘You don’t need to shave above your knees.’\" - Amy Schumer"},{"comment_id":"953522348018789","commenter_b":"I demand that the offender's stop offending me. I'm tired of being offended. They get offended over Merry Christmas they get offended over In God We Trust, offended over the Ten Commandments... And the list goes on and on well if they don't like it move out of America.","commenter_a":"Why make something as general as a Cracker Barrel a racist issue? Stop creating trouble and problems needlessly! Enjoy this holy season and spread love and goodwill, not hate!","post_message":"Liberals are demanding that Cracker and Barrel change their name to this. We can let this happen. Let's show them our support. Can we get 30,000 'LIKES' to keep Cracker and Barrel the same?"},{"comment_id":"10152739568405796","commenter_b":"Thanks for breaking the \"fear of being called a racist\" barrier Charles. My memory serves to tell me that most of these crimes are done by out of state blacks. National statistics back this up.","commenter_a":"Anyone noticing if it isn't locals its out of staters and 9/10 times they're black...","post_message":"A South Carolina man admitted Friday in U.S. District Court that he imported crack cocaine, powdered cocaine and heroin from out of state and distributed the drugs in the Bangor area."},{"comment_id":"10152940333217061","commenter_b":"@username shes a hoe","commenter_a":"Hi Guys :) I'm Ashley :) 19 years <3 , I m Single and beautiful <3 girl <3 please like my page :) in 2 secs and i'll send you a friend request and inbox you <3 you will never regret, :( i promise you, please support me by just 1 like <3 1 Like (y) = 99 Help <3","post_message":"Police: Jake Lloyd, the actor known for his role as young Anakin Skywalker in 'Star Wars', arrested: @webpagelink"}]
