[{"comment_id":"523996764459649","commenter_b":"She is so full of crap!!!","commenter_a":"Not my husband ... Wrong again Laura !","post_message":"Laura Ingraham makes predictions:"},{"comment_id":"1033161420090232","commenter_b":"Hispanics are illegals? Since when? Your profile photo just proves you're racist.","commenter_a":"Pardon me...illegals don't vote so does it matter","post_message":"A presidential candidate must win at least 40% of the Hispanic vote to win an election in modern America. Here's why that's very bad news for Donald Trump."},{"comment_id":"995263523875544","commenter_b":"And u look like what came out of my anus this morning, except not as attractive...","commenter_a":"Her face looks like the whole butt!","post_message":"Rosie O’Donnell unloads on Donald Trump..."},{"comment_id":"691363511054227","commenter_b":"Get a life and leave her alone!!","commenter_a":"She must be an AWESOME girl as she brings out the second, third, etc. class haters !!!??? Tom","post_message":"Ivanka Trump is taking fire from all directions after this wardrobe mishap. She doesn't deserve this. Let's show her our support. Can we get 10,000 'LIKES' for Ivanka Trump?"},{"comment_id":"789366324587278","commenter_b":"Jesus, doesn't anyone see a pattern here & this dirty insane hobag. I wouldn't vote for her if u paid me. She's evil..I pray Trump wins and try her and Ovomit for TREASON and HANG their sorry asses!!!","commenter_a":"And before everyone gets Butt hurt over this one lets just reminisce some history about the Clinton's... And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock Rose Law firm. Died of a gunshot wound to the head, ruleda suicide. 4 Ron Brown Secretary of Commerce and former DNC ...","post_message":"Clinton Mistress Reveals Herself, Drops Major Bombshell Right On Top Of Hillary This will completely derail her campaign. Do you think the last thing America needs right now is another Clinton?"},{"comment_id":"10153565125016162","commenter_b":"Evil. What is so sick about our world is that moms and dads kill their babies every day by the thousands. It's called abortion. We should be as offended and grieved at the kids killed in the womb and out of the womb.","commenter_a":"Typical crackhead POS!!!! He should commit suicide.","post_message":"CHARGED: Young parents arrested after newborn found to have 20 fractures, police say: @webpagelink"},{"comment_id":"10154108457106782","commenter_b":"She probably screwing him","commenter_a":"Of course she supports him. She's nearly as stupid as he is.","post_message":"Kellyanne Conway, the high-profile White House counselor, has come under fire from Democratic and Republican lawmakers, fact checkers and the media. But she's so far maintained the support of her boss, President Donald Trump. @webpagelink"}]
