[{"comment_id":"10153221460464087","commenter_b":"I don't get why liberals are being such cry babies? Don't get so upset about losing votes. Illegal is illegal. Period. Come back to the country Legally!","commenter_a":"You have my vote MR Trump!!","post_message":"\"The first thing I'd do in my first day as president is close up our borders so that illegal immigrants cannot come into our country,\" Donald J. Trump vowed."},{"comment_id":"10155183414820725","commenter_b":"A whole alot of whores","commenter_a":"He's an attention whore!","post_message":"Remember when Kanye interrupted Taylor Swift at the 2009 Video Music Awards? Well, he rushed the Grammy stage last night, showing off his sense of humor and impeccable timing: @webpagelink"},{"comment_id":"899546906747398","commenter_b":"F muslims, and GTFO!!!","commenter_a":"Heck no he is in the grave why would you move him ..when the Muslim can be buried somenplace else .this is against his family to be removed.","post_message":"Pathetic! (MUST READ)"},{"comment_id":"10152643081825496","commenter_b":"Sadly, it's the day and age were in. My mother died of ALS in June 1973 but was in the hospital and out many times and was never denied care. In fact she spent the last 3 months of her life in the hospital and had her nightly beer with my dad. Hopefully at some point in time they will get it figured out but sadly will probably not happen in my lifetime.","commenter_a":"That's exactly how they work. They deny, deny, deny until the person /family gives up hope. It is terrible how these people can get away with stealing/withholding money that these precious people put in and need.","post_message":"A few weeks ago, 11Alive shared the moving story of 42-year-old Melissa Kern. She had been battling ALS for almost a decade, and had reached a point where she could only move her eyelid to communicate. While she fought the disease, her husband Chris struggled to pay the bills, getting nothing from Social Security for disability benefits. Bill Liss 11Alive took on the case. They succeeded. Tragically, it was too late. See more: @webpagelink"},{"comment_id":"502143199967560","commenter_b":"I wouldn't even give her the Cleveland steamer","commenter_a":"That's a face you could donkey punch.","post_message":"She makes it official!"},{"comment_id":"990789407625962","commenter_b":"In coming President~Trump ^ seek and destroy all opposition within our borders and outside our borders VOTE TRUMP","commenter_a":"These and all jehadic Muslims are evil and need to be killed period.","post_message":"Who saw this coming? [Read below]"},{"comment_id":"10153225010746833","commenter_b":"These people should be tarred and feathered.","commenter_a":"This is what the liberals want.","post_message":" of New Jersey, warns Gordon VanGilder. The retired schoolteacher is the latest to fall victim to the Garden State gun laws the 72-year-old is facing up to 10 years in prison for having an antique flintlock pistol in his car. In this exclusive report, his attorney notes that VanGilder is facing the same felony charge for his unloaded mid-1700s firearm as he would be for a loaded .44 Magnum. is overreach, for sure, says VanGilder. @webpagelink"}]
