[{"comment_id":"882724591787290","commenter_b":"Battered but still a warrior, great courage.","commenter_a":"This kid needed a gun and a CCL. So as to defend himself!....oh wait he lives in Newtongrange, Midlothian. Is that in....the UK? They not allowed to defend themselves with lethal force, from Thugs! Thanks to people that think like Piers Morgan.","post_message":"Left for dead with a battered face and multiple fractures by man he stopped to help"},{"comment_id":"716711075186137","commenter_b":"Then go back home. Get out of America. We don't want you Islam or Sharia law.","commenter_a":"If that is what they want, I would assume they would be buying airline tickets for a flight back to a Muslims country.","post_message":"Muslims Try To Pass Sharia Law In Alabama So Citizens Do THIS.  We live under the law of the constitution. They are taking a stand.   Do you support these patriots?"},{"comment_id":"1081030328612686","commenter_b":"Go bang your mother with a mace","commenter_a":"All you people saying taxation is theft are such complete morons. Taxation is a membership fee to live in the USA where we have benefits that greatly outweigh the cost. Why don't you renounce your citizenship and gtfo out of the USA and move to Antarctica if you don't want to be taxed. Bunch of unpatriotic pieces of human garbage in here.","post_message":"Wouldn’t it be great if you could refuse to pay your taxes until you decided your tax rate was “fair”?"},{"comment_id":"598846743608854","commenter_b":"Death by hanging move to the front of the line two weeks should do","commenter_a":"It's like they are forcing you to become a racist.","post_message":"BREAKING: White Female Cop Shot By Thug Hours Before She Was To Go On Maternity Leave [VIDEO].  This is tragic, let's send our prayers.  Can we get 10,000 'LIKES' for this poor officer?"},{"comment_id":"1140671769377398","commenter_b":"This lady is such a trash!","commenter_a":"Why didn't they do this when Obama was in office?","post_message":"Thankfully we have Elizabeth Warren in the Senate to call him out.  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"673748802758301","commenter_b":"She is probably really a white man","commenter_a":"Bitch is dumb and racist","post_message":"Give it up Mosby."},{"comment_id":"1067971246620705","commenter_b":"This is not a college campus, and she already dropped out of college. Go look, shiney object over there ...","commenter_a":"The media should be reporting on the despicable Republican Platform. #shameful","post_message":"The speechwriters who wrote the original speech are among the best, and weren't going to have their good name besmirched by Trump ..."}]
