[{"comment_id":"10156188886135354","commenter_b":"Suzanne, you're a dumb bitch. Shut the fuck up","commenter_a":"Scott walker Mexican Americans legals are against illegals we are with DonaldTrump not because we are Mexicans but this is our country n our children need a better America not free loader hard working for a better America since 1800 hundreds my family been hereover 200 hundreds years we love America we have to be great again my decision n my family DonaldTrump is the great America we need","post_message":"Scott Walker calls for a “limited number of candidates who can offer a positive conservative alternative to the current front-runner.”"},{"comment_id":"1322047887828041","commenter_b":"seriously these 2 girls acting like trash why would you act like that in front of your kids??","commenter_a":"Eddie Fregoso @username lol","post_message":"BRAWL AT CHUCK E. CHEESE: A huge fight broke out among parents at a Chuck E. Cheese. This scene went on for about 10 minutes until officers finally arrived to break it up. VIDEO: Philip D. MORE: @webpagelink"},{"comment_id":"1861753934052329","commenter_b":"I'm pretty sure @username was being sarcastic","commenter_a":"Lol wow. That tool didn't \"destroy\" anything. He just confirmed how idiotic the Obama administration is and how clueless they are when it comes to guns. He says the guns were legally purchased in California, but then says if there were \"common sense gun laws\", terrorists would change their mind about committing acts of terrorism, completely ignoring the fact that the legally purchased guns in California were purchased under the \"common sense gun laws\" you faggots have been calling for!!! Here is a question, have common sense pot laws prevented any of you jackasses from buying and smoking your weed?? Have common sense alcohol laws, like making it completely illegal to drink and drive, ended deaths caused by DUIs!? The fact that most of you idiots following this page actually believe the bullshit posted and the nonsense this president and his fuckbuddies spew out of their assholes means we are ...","post_message":"This sums it up. His reaction is great. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153271515149087","commenter_b":"Stfu old bitch","commenter_a":"God help America if Hillary or Sanders ever become president","post_message":"Bernie Sanders is leading Hillary Clinton by a stunning 30 points among voters under 30, according to NBC's first post-debate poll."},{"comment_id":"1148538801848206","commenter_b":"Get well soon.","commenter_a":"That was an amazing thing he did. He is too be commended. Oorah","post_message":"BREAKING NEWS"},{"comment_id":"10153786664991336","commenter_b":"You only needed 5 minutes, for her to spend 11 hours lying is a waste of time.","commenter_a":"We need closure and justice for them","post_message":"\"I'd like to believe that no matter what party you are, you want to put American life and safety first and foremost.\" – Gov. Mike Huckabee"},{"comment_id":"10153677449116336","commenter_b":"Have you ever noticed it's always pretty women getting killed? Eat more cheeseburgers.","commenter_a":"Yolanda Mejia","post_message":"A body found on a rural property in northwest Spain is most likely that of Denise Thiem, an American woman who went missing while walking along a pilgrimage route, Spanish officials said."}]
