[{"comment_id":"1225058540866079","commenter_b":"Got to Hell Nancy Pelosi! You are lost.","commenter_a":"Brain damaged fool! You're a disgrace!","post_message":"The American people should know: central to the Ryan budget is voucherizing Medicare and cutting Medicaid. Seniors have a lot to lose."},{"comment_id":"10153590178129497","commenter_b":"You sons of bitches !","commenter_a":"Fearless!","post_message":"Via ClickHole:"},{"comment_id":"10154123509664138","commenter_b":"@username is awesome","commenter_a":"Thank You Fox , great pictures.","post_message":"Our favorite photos of Minneapolis aglow in purple for Prince."},{"comment_id":"1754857141240693","commenter_b":"@username The trash should be put down !","commenter_a":"They saying there's no tv the food crap and can't go to the gym well you shouldn't do the crime","post_message":"Britain's third biggest prison is in the midst of a riot."},{"comment_id":"962481017216016","commenter_b":"@username I do not believe God condoned offering children to the fire as is abortion. the dogs ate jezebel. hillery was lucky, so far.","commenter_a":"YOU can't be a christian and vote for Hillary but it is all over, Hillary lost.","post_message":"Apostate “Pastor” Tony Campolo says Christians Should Vote for Hillary @webpagelink"},{"comment_id":"10153269533886833","commenter_b":"Obama is more dangerous to this country than any ammo.","commenter_a":"Topend Towing","post_message":"Since announcing its proposed ban on commonplace 5.56x45 mm ammunition, the Obama administration has been careful to claim that this attack on gun rights is in the interest of law enforcement officer safety. However, law enforcement doesn't seem to agree. The Executive Director of the Fraternal Order of Police National Legislative Office, James Pasco, was quoted by the Washington Examiner as stating: \"Any ammunition is of concern to police in the wrong hands, but this specific round has historically not posed a law enforcement problem.\" FOP's website describes the organization as \"the world's largest organization of sworn law enforcement officers, with more than 325,000 members in more than 2,100 lodges.\" #M855"},{"comment_id":"1393941760623890","commenter_b":"Just like they blocked Obama?","commenter_a":"It's a shame that Democrat voters don't vote on issues such as jobs, the economy, and security... They vote for the candidate who has the most celebrity backing... Low info voters.","post_message":"Lady Gaga criticized Melania Trump for saying she wants to end cyber-bullying if she becomes first lady. @webpagelink"}]
