[{"comment_id":"10153270058159497","commenter_b":"We are all snacks, can't we get along?","commenter_a":"Oh SO SNACKS DON'T HAVE THE RIGHT TO DEFEND THEMSELVES?","post_message":"From our sister publication, ClickHole:"},{"comment_id":"1045699632192955","commenter_b":"Women can make it!","commenter_a":"Sneaker is sneaky.","post_message":"Clinton inches above Sanders in a key swing state ..."},{"comment_id":"10153360842296162","commenter_b":"Hope they enjoy their 72 male virgins.","commenter_a":"Fuckkkkkkkkkkkk Muhammed!!!!!","post_message":"COP SAVED LIVES: The officer who returned fire at two men who shot assault rifles outside an event displaying cartoons of the Prophet Mohammad \"saved lives,\" according to authorities @webpagelink"},{"comment_id":"510712935755721","commenter_b":"...via the food scraps from their Whole Foods trips found in dumpsters! Now I see the trickle!","commenter_a":"This sounds like a problem that a few more tax cuts for Billionaires will fix. It's really simple. You give ALL the $$$ to a few people, and then it just \"trickles down\", and eventually reaches the homeless.","post_message":"A 2015 report found that an estimated 44,359 homeless people live in LA County — a 12% increase since 2013."},{"comment_id":"10153794621104726","commenter_b":"Thats the REAL ISSUE here..PRAYER and FAITH ..these guys are so far remoived from G-d its pathetic..This all has to do with the men in POWER.....has been since the beginning....even satan wanted to be above our creator..these followers of satan are no different","commenter_a":"Still another reason I'm a pub!","post_message":"Democrats come out against God"},{"comment_id":"10152984157398598","commenter_b":"If she didn't want to get pregnant and ruin her career she should have kept her legs closed!! Selfish pos","commenter_a":"All u negative people will never understand...a baby can dampen your career...or just job if u have one...just think that if the mother is single...she will be out of work for six weeks...how do u pay rent..carnote..bills..ect..then when its time to go back to work how are u going to pay for daycare after being out of work..oh not to mention in todays society how many sick perverted people there are in the world and to know u may possibly give ur child up to one of those...SMH. shame on all of u who judge this woman....A REAL woman knows whats best for her and a child...and is certainly no ones place to judge...y dont all u negative people become a social worker and go find the real children who need help from a parent who decided to have them for their own sick pleasure! Thousands of children being born ...","post_message":"She Aborted Her Baby Twice and Both Abortions Failed, So She Aborted Her Baby Again"},{"comment_id":"10154067213591770","commenter_b":"@username take out Ca and she lost that too illegals told ok to vote by Oblamo","commenter_a":"I'm so fed up with hearing about the \"popular vote\". Our constitution was NOT set up that way, so please stop talking about it. IT DOESN\"T MATTER. Let me break it down for the simpletons. Suppose you live in a homeowners association. If there is an issue, each home has 1 vote, decision is made fairly. However, if it was a \"popular vote\", then each resident would have a say. If you lived by yourself, you'd possibly be outvoted by your neighbors who had a houseful of 5 people, everytime there was a vote. Which would you prefer? That's how our republic is set up: each state has a FAIR vote in electing the president. Forget the popular vote, unless we change the constitution.","post_message":"Liberals did not like what Ann Coulter tweeted."}]
