[{"comment_id":"544829205708653","commenter_b":"Free so the they can bomb and kill Israelis like their surrounding neighbours. No thanks","commenter_a":"I'm sure this will give the Zionists more reasons to steal land in Palestine I hope the poor people of Palestine will be free some day","post_message":"Wildfires are also threatening homes near Jerusalem and in the West Bank."},{"comment_id":"860168877353787","commenter_b":"She has such a nasty attitude and doesn't try to hide it. Very haughty woman.","commenter_a":"She looks like she's giving him attitude. Why's does she always have \"that\" look on her face when she looks at whites and anyone else she considers below her?","post_message":"Caption this photo in the comments! ...... Former President George W. Bush and first lady Michelle Obama speak before President Barack Obama delivers a speech and takes a symbolic walk across the Edmund Pettus Bridge. (AP Photo/Bill Frakes)"},{"comment_id":"10153009704367690","commenter_b":"Attention, single ladies. Line starts to the left - lol","commenter_a":"And where did they pick up the Black man? #1 2nd row!","post_message":"JUST IN: Mugshots of some of those arrested in connection with the deadly biker brawl in Waco. Open link to see information on each mugshot. @webpagelink"},{"comment_id":"10154798019399062","commenter_b":"Russia has been the most proactive but we condemn their actions.... lol","commenter_a":"I wonder how long the leaders of the free world are going to tolerate this without taking the fight to ISIS directly and wiping them out! The scumbags need annihilating!","post_message":"BREAKING: Islamic State group claims responsibility for Brussels attacks, Associated Press reports. READ MORE -> @webpagelink"},{"comment_id":"1117181214965894","commenter_b":"@username , It is kind of a long story... But just as we have labels on cans to tell us whether it's Corn or Peas the label on our Faith denotes how accurately we wish to follow Jesus .","commenter_a":"Many are walking away from Christianity, because not all...but the few, out there in this world use God and the Bible to push their own personal and political agandas! People are so tired of so-called Christians who act so self-righteous and who's actions are far far from what Jesus would do! As a Christian...Many of us do not want to be represented by Greed, bigotry and hatred!","post_message":""},{"comment_id":"935444853215236","commenter_b":"And keeping illegals from working the harvests here will have a devastating effect on our economy.","commenter_a":"Ummm,sorry but fuck the farmers then. If you have to use illegal immigrants for less than minimum wage in order to make your business work, you do not deserve to be in business. Americans are gonna have to learn to put down the bag of cheeto's and do some actual work or these immigrants need to be legalized,be paid a fair wage and pay taxes like the rest of us. When they try to do what they do with TV's and cellphones and have it made with slave wages in other countries,we need to not allow them to sell their products here or fine them to the point of it not being overly profitable by doing this. With that being said ,same needs to be done with TV, cellphone,shoes,clothes etc. People being used as slaves in order for these companies to make major profits and so everyone can afford these ...","post_message":"Turns out America's food production relies heavily on immigrant labor, and our farmers are NOT pleased."},{"comment_id":"703232799867298","commenter_b":"Yes! Wipe them off of the Earth!","commenter_a":"Unfortunately this is what needs to be done to get this sickness out as best we can","post_message":"Several ISIS leaders have just been taken out. Good riddance. Should we send our air force back to Syria to end ISIS for good?"}]
