[{"comment_id":"691444044379507","commenter_b":"Hate Crime.. All of these black criminals are Racists","commenter_a":"This is bullshit! There's hundreds of incidents happening everyday! Want to be fair put them all up everyday!","post_message":"A white father and son were killed by two black teens and there are no riots. The media is completely one sided. Race Baiters are the problem. Do you agree Al Sharpton is the problem not the solution?"},{"comment_id":"1138154636255284","commenter_b":"YOU are so full of it....I bet women probably leave YOUR sorry ass....YOU have NO CLASS. ...I CAN TELL","commenter_a":"I DON'T believe that...Who would want her....No One....Just her husband and she's lucky he gave her the time of day","post_message":"She was just exposed. This family needs to be booted from the White House. Do you think Michelle Obama is a disgrace?"},{"comment_id":"10152906344266717","commenter_b":"#BullShitAssHole","commenter_a":"hater!","post_message":""},{"comment_id":"1836032849948227","commenter_b":"I'd say you'll go in for one yourself @username!! Dressed as a lady","commenter_a":"@username I don't feel well","post_message":"😍😍😍"},{"comment_id":"10153108575014726","commenter_b":"Obama working to hamstring America from fighting the Jihad @webpagelink","commenter_a":"obama is an appeaser and weakling","post_message":"WATCH: The Netanyahu speech that is throwing Obama off his game!"},{"comment_id":"10152836141061130","commenter_b":"A man loves getting molested by his women while he is sleeping he will wake with a bigger erection because he is not sure who is doing him.","commenter_a":"I like red haired, bears","post_message":"A man isn't strong unless he's also vulnerable."},{"comment_id":"958986307470162","commenter_b":"Beware, ladies!","commenter_a":"There's zero evidence supporting that he was filming her. The only harassment caught on film was of the women berating a man. This guy will have a great lawsuit for slander against her.","post_message":"This woman just gave a street harasser a taste of his own medicine."}]
