[{"comment_id":"1167878733267392","commenter_b":"Just a worthless pos","commenter_a":"What a loser","post_message":"Unbelievable! Michael Moore is now calling on liberals to disrupt and shut down Trump's inauguration. @webpagelink"},{"comment_id":"1678495722420749","commenter_b":"She's a POS!","commenter_a":"Um Killery! Benghazi is in Libya!!! You are responsible (Culpable) for 4 Americans dying needlessly over there on September 11 2012! You are a Lying POS!","post_message":"Hillary Clinton did not mention the four Americans who were killed in the Sept. 11, 2012 terror attack in Benghazi."},{"comment_id":"1359423070754409","commenter_b":"WOW gives a whole new meaning to hard boiled and 3 minute egg","commenter_a":"So we're any charges filed on the creeps who took advantage of her bad luck?","post_message":"The woman admitted she exchanged sex for money and that she performed sexual acts in a chicken coop."},{"comment_id":"10154322380197217","commenter_b":"I'm just surprised he didn't grab her in the pussy","commenter_a":"Anyone else shudder when he leaned in to kiss Michelle Obama?","post_message":"Hugs and a gift. The Trumps meet the Obamas at the White House   #InaugurationDay   bbc.co.uk/inauguration"},{"comment_id":"10153846533754641","commenter_b":"A VOTE FOR HILLARY WILL BE THE END OF WHAT WE KNOW OF A FREE AMERICA , NO MORALS, ONLY PROMISES AND MORE LIS ! I WAS SHOCKED AT HOW MANY PPL STILL VOTED FOR HER AFTER KNOWING SHE HAS COMMITED TREASON ALONG WITH OBAMA AND THOSE TOP SECURITY TAPES BEING EXPOSED FOR JUST ANYONE TO SEE , THEY CAUGHTBOTH OBAMA AND HER IN LIES WHEN ASKED ABOUT THOSES TAPES . EVEN IF SHE DID MAKE IT TO BE PRESIDENT SHE BETTER NOT GET SETTLED IN TO QUICK , iI HAVE A FEELING SHE WILL BE INDICTED AND OBAMA WILL BE ALSO !","commenter_a":"Every other one is a liar and owned by big $$. What will they do to help you directly? I don't know any millionaires so I guarantee #Bernie2016 s policies will give you more spendable money. He's not really giving anything away, we already pay for most of it and he's found ways to pay for MORE than the rest, the excess will pay down the deficit. He will create jobs and raise wages, which will lift millions of people out of poverty and they will rely less, or not at all, on welfare. (No, this will not cause massive job loss or inflation. When poor people earn more money, they spend it, giving businesses plenty more money to use to pay the higher wages, usually with little to no increase in price.) He will implement a small tax on wall street transactions and other UNEARNED income, and will invest ...","post_message":"Donald J. Trump after a projected 2nd-place finish at Iowa caucuses: \"We will go on to easily beat [ Hillary Clinton ] or [ Bernie Sanders ], or whoever the hell they throw up there.\"   Live updates from the Iowa caucuses: @webpagelink"},{"comment_id":"10153536003698967","commenter_b":"God... I would love to work here JUST so that I can belittle upper management when they fire my ass for pulling an \"Office Space\"... Also... I can see a documentary in their near future.. Similar to the one about Walmart... ... Can't wait!!!","commenter_a":"I hate to hear that they run Amazon like a Randian dystopia. I use them for so much stuff now. What a shame.","post_message":"Amazon's corporate culture is terrifying."},{"comment_id":"976040162431405","commenter_b":"I haven't watched this show in years and don't see how it's still on the air! These women are so \"out of touch\" with the real world, they're clueless!","commenter_a":"These women on the view must b a special kind of stupid","post_message":"Thank you, Dr. Ben Carson!"}]
