[{"comment_id":"10154931623678812","commenter_b":"Everytime i check most people that like trump are not from the United States like yourself from Australia you moron","commenter_a":"Trump is much more liked on all social media then Clinton the media is clearly lying with these polls","post_message":"Hillary Clinton has vaulted to a double-digit advantage in the inaugural ABC News 2016 election tracking poll, boosted by broad disapproval of Donald J. Trump on two controversial issues: His treatment of women and his reluctance to endorse the election’s legitimacy."},{"comment_id":"897694810421095","commenter_b":"They don't belong here. We are just a safe place until they can outnumber us and overpower us","commenter_a":"She can leave.","post_message":"This is what happened when she refused for the National Anthem. If you don't respect our country, then you can leave. Do you think she should pack her bags?"},{"comment_id":"10153992942406316","commenter_b":"what is the life span of a fruit fly??","commenter_a":"Wayna Biggs","post_message":"Truvia sweetener a powerful pesticide, kills fruit flies in less than a week..."},{"comment_id":"1736087096643244","commenter_b":"She can dig as much dirt as she wants. We all see right through her. What a loser.","commenter_a":"Lied and busted on national tv","post_message":"Alicia Machado blames Donald Trump for her two eating disorders..."},{"comment_id":"10155112285036729","commenter_b":"Just a clone of evil Hillary. Let her be gone and never seen of again!","commenter_a":"We can only hope. Oh, she may be protected as a Native American. Oh, that's right. She lied about that.","post_message":"Your feel-good story of the day, folks!"},{"comment_id":"10153754020631337","commenter_b":"Little Crybaby Bitches....aww","commenter_a":"Mets fans are always crying.","post_message":"'AN ABSOLUTE SCUMBAG': Folks were not happy with Chase Utley's slide against the New York Mets, to the point that they almost went too far..."},{"comment_id":"574474082714162","commenter_b":"A voting majority will not vote for a re-hash of the Bush administration.","commenter_a":"Newt Gingrich, Mike Huckabee","post_message":"Question of the Day: Who should Donald J. Trump pick to be his running mate?"}]
