[{"comment_id":"1241041889268599","commenter_b":"Kelly is an ass wipe. Acts like a two bit sleazy pig with her bottle cap tits, ya know the ones she like talking about","commenter_a":"Get rid of her","post_message":"Megyn Kelly reacts to Trump's Florida speech.  @webpagelink"},{"comment_id":"1355437474524022","commenter_b":"Open season. Was Michelle off limits for you? No? Then neither should this ex porn model.","commenter_a":"Funny, not funny.... Who's paying for the wall? Mexico Mexic Mexi Mex Me.","post_message":"Today we celebrate one week since making history with the swearing-in of President Donald J. Trump and Vice President Pence! Watch the unforgettable inauguration:  @webpagelink"},{"comment_id":"10155251280330294","commenter_b":"The only thing \"frightening\" about this video is how butt ugly that lady is that get out of the car! Ha...","commenter_a":"There's 2 sides to every story...no other side could justify illicit behavior like that but what happened before the video started?","post_message":"\"Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off-road first time.\"  Then- things take an even scarier turn, when the woman stops her vehicle, gets out and walks up to the car."},{"comment_id":"1012961912156618","commenter_b":"I would give my share to put there asses on a boat and send the ass holes somewhere else","commenter_a":"Big mouth and no brains. This is what Obama has done for this country. What a disappointment.","post_message":"\"Pay me consistently, provide me safe housing, offer me a job with benefits, run me those Beyonce tickets\" She must have lost her mind, if she thinks we are going to pay her anything. Will you pay for this entitled BLM organizer to go to a Beyonce concert?"},{"comment_id":"693308824147234","commenter_b":"and being hoes..laaag","commenter_a":"This shit here is crazy. All week we been talking bout Kylie like she beyond famous. Her family is known for fucking and being hoes. Malala opens up a school and nobody don't say nothing the worlds view point on things is fucked up.","post_message":"Quit making stupid people famous."},{"comment_id":"987574278005491","commenter_b":"Killary for prison 16","commenter_a":"Very true, Hillary has been called horrible things not just by men but women to. HILLARY 2016.","post_message":"\"I don’t know that a man would be treated the same way that Hillary is.”   - Senator Bernie Sanders"},{"comment_id":"10153551437246336","commenter_b":"Hello!! They treated him like that bc they believe him to be a wolf in Sheep's clothing. I find him very entertaining but he is the Clintons wild card. He will divide the republicans so democrats will win. They even point blank asked him when he became a republican and all he can say is I changed my mind.","commenter_a":"@username owes Donald Trump an apology. Get rid of Megyn Kelly while you're at it.","post_message":"Which GOP presidential candidate do you think gave the most impressive performance during the Fox News-Facebook prime-time debate?"}]
