[{"comment_id":"10155299383400354","commenter_b":"Those of us who are legal US citizens in need can't get help yet we give those who are illegal help. When I fractured my neck in 3 places and shattered my leg all I got was 200 in food stamps. I was 55 and I lost everything. Stop giving this country away to those who disrespect with their very first action. Coming here illegally.","commenter_a":"They are giving them ids and other things so they can once again steal the presidency through illegals voteing. Get out and vote stop the craziness. Our president is in office illegally as he is not a US born citizen. So of course he is for illegals.","post_message":"NYC's New Illegal Alien ID Program Includes Free Membership to 33 Top NY Venues, Including the Metropolitan Museum of Art."},{"comment_id":"1717801081829837","commenter_b":"Crazy lady.","commenter_a":"go Killery.","post_message":"Is this hypocritical? WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"10153945606794060","commenter_b":"Shut up!","commenter_a":"Turkey is the gateway for Islamists to enter Europe and the birthplace of fascism.","post_message":"For the Turkish nation Turkishness goes beyond nationality. But some citizens consider themselves more Turkish than others"},{"comment_id":"659128370944408","commenter_b":"Ban them all through the U.S.!","commenter_a":"Yes!","post_message":"A town in Michigan just voted to ban mosques, this was the result. Things are about to get very controversial. Would you like to ban Mosques in your town?"},{"comment_id":"943135932412822","commenter_b":"Shake those lady lumps","commenter_a":"Hump on a Hump!!!","post_message":"He denounces the idea of marital rape as 'made up by European people'"},{"comment_id":"10154001620082377","commenter_b":"I don't think that would work here, just look around now, pants below waist so nasty drawers complete with nasty skid marks being worn, woman with breasts hanging out of clothes and jeans with the butts completely exposed, (men and women), FU t-shirts, and on and on. Burkas would improve these types, so no, let them wear burkas.","commenter_a":"The thing is that it is part of their religion and I think we should respect their right to wear it, it is not indecent. I can think of a lot of people who benefit from it , you know to cover up too tight pants on someone who is obese and so on.","post_message":"Angela Merkel calls for Germany to join France, Belgium and others in banning the burqa. Should America be next?"},{"comment_id":"10155399536459199","commenter_b":"Oh ok was wondering how close this happened it didn't specify what a sick man hope they catch him fast.","commenter_a":"Where is Lakewood Commons I live up by Lakewood high school?","post_message":"The man was about 6 feet tall and rode off on a green bicycle after exposing himself to the child."}]
