[{"comment_id":"10154486445542994","commenter_b":"There is no male. It is a transgendered woman.","commenter_a":"they beat his anus","post_message":"Courtney Purvis says she was attacked outside of a bar in Dearborn because she identifies herself as transgender."},{"comment_id":"10153302488640329","commenter_b":"You obviously don't know what feminists sound like then.","commenter_a":"\"How dare you show women's breasts you pervert\" - Feminists \"How dare you censor women's breasts you oppressor\" - Feminists.","post_message":"Warning: NSFW due to lots of nipples. (via BuzzFeed News)"},{"comment_id":"10152721939436051","commenter_b":"Your a cunt ya bitch","commenter_a":"Dumb bitch she would of been mad if the made her fat ass look fater","post_message":"This girl couldn’t believe what her school did to her yearbook photo."},{"comment_id":"542505495955041","commenter_b":"@username you're a racist bitch. I hope you rot in hell.","commenter_a":"He was mentally ill he suffered from PTSD . Isn't that what they say when the white boys do it?","post_message":"Dallas Shooting Suspect Identified as 25-Year-Old Army Veteran Micah Xavier Johnson"},{"comment_id":"1852101905022122","commenter_b":"trump is nasty","commenter_a":"I still can't vote for either of them...","post_message":"WATCH: Hillary Clinton and Donald J. Trump go head to head in the final presidential debate, live from Las Vegas."},{"comment_id":"10154489395427439","commenter_b":"Ritual genital cutting is wrong regardless of sex.","commenter_a":"Barbaric people. Wouldn't expect anything less from this death cult.","post_message":"The gruesome practice of female genital mutilation is at record highs in America due to the influx of Muslim immigrants. FGM is found only within and adjacent to Muslim communities. The fact is that Muhammad justified it: “A woman used to perform circumcision in Medina. Muhammad said, \"Do not cut severely as that is better for a woman and more desirable for a husband.” (Sunan Abu Dawud 41.5251)."},{"comment_id":"10153918675239170","commenter_b":"Incompetent? Really? Jobless rate record low. Economy back on track. Bin Laden dead. Equal rights for everyone. Health care for everyone. I think you need to reevaluate. Perhaps it is the people who you are getting your facts from who are the incompetent ones. And since they're evidently your only source, I'd say you might want to step up your game.","commenter_a":"He's such an incompetent douchbag. 12 more months, thank God!","post_message":"Probably as close as Obama will ever come to actually admitting it."}]
