[{"comment_id":"10154450520586320","commenter_b":"Well said Claudia","commenter_a":"own it. you have ignited and stirred the kettle and walked away. you have failed to address the real crimes of black/black murders happening every day in your 'home town' of chicago. you are perpetuating a false narrative to strip the local police from doing their job, create chaos and mistrust. own it for once and stop blaming everyone else.","post_message":"President Obama is to address the #BatonRougeShooting where 3 police officers were killed."},{"comment_id":"997010993718412","commenter_b":"Islamic Terrorist, go home, stop trying to change the U.S.A.","commenter_a":"No true American is safe as long as Islam is allowed to exist in our nation! We true Americans must unite against this plague and the liberals who allow them to destroy our lives and wipe them from our nation so we can ensure the safety and security of our nation and the American people!","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack. He is a hero, and will always be remembered as so. Can we get 150,000 'LIKES' for this brave boy?"},{"comment_id":"10157066156885389","commenter_b":"Listen... Im pro-Trump and agree with a vast majority of his political stances; however, this wall fallacy is a dream.... a wall doesn't stop illegal entry, it only causes illegal entry to evolve. Initiating an armed presence is one of the most effective ways of mitigating unlawful entry by immigrants.","commenter_a":"Trump wants to rename USA to UST United States of Trump lol","post_message":"“We’re going to build a wall and it’s going to be a real wall… And it’s going to look beautiful because some day they’re going to call it ‘The Trump Wall.’” – Donald J. Trump at a rally in New Mexico"},{"comment_id":"10153996062974203","commenter_b":"Take them all out by any means necessary, they are enemies of this country.","commenter_a":"In other reports, Ammon has told those left at the refuge to give up and go home. Why should they just get to go home, as if nothing happened and they hadn't done anything wrong. Every last one of them should be charged with crimes of all sorts.","post_message":"They're not going anywhere."},{"comment_id":"1753303961361759","commenter_b":"Ooooh a compliment! Now go get your pussy grabbed by some rich wrinkled old prune.","commenter_a":"she's a Hillary wannabe","post_message":"I’m still banned from speaking on the floor of the Senate about the nomination of Jeff Sessions to be Attorney General. But this morning, I met with civil rights leaders and other Democrats right outside the Senate floor to say: Coretta Scott King will not be silenced."},{"comment_id":"1115714755184548","commenter_b":"@username DUMBF TRUMP BUILDING HIS OWN WALL BECAUSE MEXICAN PRESIDENT SENT HIS ASS PACKING.","commenter_a":"Smart women.. COUNTRY COMES FIRST. LET'S VOTE BLUE IN NOVEMBER. HILLARY NEXT PRESIDENT OF THE UNITED STATES OF AMERICA.","post_message":"This is just too good!"},{"comment_id":"10156422552765354","commenter_b":"Mexcans, niggard and white hoes need a good kick in the ass.","commenter_a":"Unbelievable! ! Round their butts up and get them out!!","post_message":"The group chanted “Let them in, Abbott let them in” and “Governor Abbott shame on you.”"}]
