[{"comment_id":"783518591838718","commenter_b":"Hillary needs to change her tampon..","commenter_a":"Eat shit bitch","post_message":"Hillary Clinton Says ‘Christians Have To Change Their Beliefs’ Or Else… [VIDEO].  She is the one who should change her beliefs.  Do stand strong behind your faith?"},{"comment_id":"1054840971250301","commenter_b":"Whats wrong with a severed finger ride. That's what it looks like!","commenter_a":"this world gets stranger by the day, disgusting","post_message":"Because why not?"},{"comment_id":"1079846958771328","commenter_b":"redneck racist are that way","commenter_a":"wtf happened in just 4 years","post_message":"LULZ."},{"comment_id":"10153134531845927","commenter_b":"these gals need a long vacation i mean a longggggggggggg vacation.","commenter_a":"Joy, you are old and stupid.","post_message":"As long as the candidate is a committed liberal...this View host will overlook just about anything!"},{"comment_id":"10152893024866051","commenter_b":"Yeah ? How bout someone take a cane to your goofy ass an lets see if it looks like paint..Oh no...lets not.... forgot your ass looks like a map from rand mcnally with all those ugly stretch marks....yuck","commenter_a":"That looks like paint, not blood.","post_message":"This man’s wife has been found guilty of domestic abuse against him. Even she wasn't expecting so much jail time."},{"comment_id":"10152577798681316","commenter_b":"A percentage will watch Hannity and cry. The rest are busy being free.","commenter_a":"LOL they said this in 1777","post_message":"Freedom hardly exists in America today, where a family man who helped people purify their water naturally now faces 37 years in prison. Read Daniel Smith's story and support his fight against the corrupt US justice system. @webpagelink"},{"comment_id":"10153444962923984","commenter_b":"Yes since he is their best muslim buddy","commenter_a":"Duh Yeah","post_message":"Well, this is worrisome. It's bad news for pretty much the entire Middle East, except for ISIS.  Do you think Obama has entirely botched the ISIS situation?"}]
