[{"comment_id":"10153291339743188","commenter_b":"Under our current president and democratic leaders the constitution is officially thrown out the window. Many thousands of illegal immigrants will be pushed to vote ending our two party system, Obama's ultimate goal.","commenter_a":"The more people taking hits at Killary before the election, the better! And likewise, she doesn't know who the Republican nominee will be. So all she can do is lie low until she knows who to go after.","post_message":"From Stu Burguiere: There are now 6 officially announced candidates for the 2016 GOP nomination, and there are a lot more coming. Are there any of these that you think probably WON'T run? RubioWalkerPaulBushHuckabeeCruzCarsonChristiePerryGrahamSantorumFiorina That super long run-on name is packed with 12(!) options, and doesn't include others like Jindal, Trump, Kasich etc, who might get in. On that note, it's time to refresh our monthly poll. You vote for each candidate by giving them a letter grade. Just remember not to vote on what you think is going to happen. Vote on what you want to happen. Results coming on the radio show Friday."},{"comment_id":"10153660392802217","commenter_b":"Some of London does not speak for all of London.","commenter_a":"London didn't care when the rest of the U.K. Suffer so why should we care about london","post_message":"A mad half hour as \"Biblical\" rain hits London."},{"comment_id":"499431526914094","commenter_b":"Leave our flag alone!","commenter_a":"I think the old saying is true. If It ain't broke, don't fix it!","post_message":"The American flag might be redesigned, see here. No one should touch the flag. It is the symbol of the greatest country on earth. Do you agree no one has the right to change the American Flag?"},{"comment_id":"10153243300499087","commenter_b":"She's a flaming idiot","commenter_a":"She is one sick BITCH !!!!","post_message":"\"I am a devout, practicing Catholic. I’m a mother of five children. When my baby was born, my fifth child, my oldest was six. I think I know more about this subject than you, with all due respect,\" Nancy Pelosi told a CNS News reporter. WATCH:"},{"comment_id":"10153946533833797","commenter_b":"Iam glad this guy grew some and told the girl to take a hike","commenter_a":"Love this! No one comes in between me and my little fur babies! 💜","post_message":"PET PEEVE: They always say a dog is man's best friend. And this guy is really proving it. One man chose his beagle when he was faced with the “it’s me or the dog” decision. More on the ad here:"},{"comment_id":"10154752862228941","commenter_b":"No Weapon formed against us shall prosper...witches have absolutely no power over men of God","commenter_a":"These people are not REAL witches. They do not know what they are doing and only will cause harm to themselves. Real witches look to help and heal. What they put out comes back three fold. These people are just plain evil and should not be considered as witches.","post_message":"The forms of protests against President Donald J. Trump are just getting weirder and weirder..."},{"comment_id":"10155501213150354","commenter_b":"New campaign slogan: A burrito in every pot and a hooker in every bed...Vote for Hillary","commenter_a":"Why not, Hillary has been a pro at f**king everybody.","post_message":"Bill Clinton hits the jackpot."}]
