[{"comment_id":"10157928279665500","commenter_b":"Why did they have babies to begin with? People like them have no business having babies - period. Don't believe in birth control - don't have sex.","commenter_a":"This makes me sick! The parents don't look like they missed any meals! Lock them up and throw away the key!","post_message":"The nurse also told police there were feces in one of the child ears and that the child looked  a skeleton. @webpagelink"},{"comment_id":"10153075277316770","commenter_b":"This hag is despicable,","commenter_a":"anything that comes out of this woman's mouth is bullshit just saying","post_message":"Debbie Wasserman Schultz says Republicans \"alienate women, alienate the LGBT community... [and talk] about it at their debates. Kicking immigrants out of this country, talking about taking away healthcare from Americans, talking about which candidate is worse for women and take their healthcare away, deny their rights, oppose equal pay for equal work.\""},{"comment_id":"1560631690895039","commenter_b":"Good for his ASS. I hope they rape him in prison nite and day. Carma is a BITCH lol","commenter_a":"the sentence is more lenient than what he deserves","post_message":"There is no punishment severe enough for these heinous crimes."},{"comment_id":"10153611062907217","commenter_b":"#LetAmericabebadagain trump2016","commenter_a":"If you vote in this racist idiot as your president , Your country will be going down the shitter for many many years to come. The guy is a nut job who hasn't got a clue !! He's a threat to world peace ... Anyway good luck America","post_message":"\"I am offended. Those are very rude statements.\""},{"comment_id":"10154950558833256","commenter_b":"How on earth can you make this RACIAL?. It grabs EVERYONE!","commenter_a":"I wish I can say I am shocked; but just about every one black who's trying to make a difference is going through it' other races probably are also' its horrible '","post_message":"Calling the practice of intercepting cellphone information secretive and widespread, a federal lawsuit alleges Chicago has an \"arsenal\" of cell site simulators (or \"Stingrays\"). When deployed by police, these devices capture data from any phone in its range — not just the intended target.  \"Government spying on its citizens without appropriate judicial oversight is inconsistent with the freedoms guaranteed by the Constitution,\" said Jerry Boyle, a Chicago attorney who brought the case."},{"comment_id":"949160488506463","commenter_b":"THIS IS 9AMERICA0 NOT SYRIA","commenter_a":"May I remind everyone, This is America and the judge was correct. Swear to the truth by swearing to it on the Bible!","post_message":"Did a judge violate this woman's religious freedom or were his actions justified?"},{"comment_id":"1672686459685954","commenter_b":"She once said she want to let more come in than Obama it is a joke that she cares about us. I would not mind a women in the white house, but not her. Also I do not want her husband messing around there. How could she make good decisions worrying about him cheating.","commenter_a":"Neither. It's Germany. @webpagelink","post_message":"The mother of a police officer who was killed by an illegal immigrant speaks out in support of Donald J. Trump due to his strong stance on illegal immigration. @webpagelink (via Fox & Friends)"}]
