[{"comment_id":"10153542319922629","commenter_b":"Do you job or get the hell out of the way. She should have been fired weeks ago when she first refused to do the job she is being paid to do.","commenter_a":"a woman that has been married 3 times is turning down marriage licenses... go figure","post_message":"Citing religious beliefs (as opposed to, say, deep-seated, bigoted hangups), the county clerk refuses to treat gay people as equal to straight people."},{"comment_id":"848280508611132","commenter_b":"Bye bye illegal parasites. Free ride is over. Self Deport before you're kicked out kicking and screaming.","commenter_a":"Donald Trump is the man. It's time to rid America of career politicians, and put someone in the White House that genuinely loves their country.","post_message":"820,000 crimes committed by illegal immigrants, here in America. Guess what! NOT WHEN I AM YOUR PRESIDENT! I can assure you of that! We will BUILD THE WALL- and Mexico is going to pay for it!"},{"comment_id":"1021280037910232","commenter_b":"Maybe Russia will take care of the roaches for us.","commenter_a":"Sad","post_message":"This is just sad. I never thought an American president would be seen as weaker than the Russian leader."},{"comment_id":"1130006897113975","commenter_b":"Get out of America then","commenter_a":"It is a sad day in America. One of the most disgusting men in in our country won the election. I am so sickened by the citizens who would cast their vote for such an evil man. Do they really feel he is person to speak for us as a nation. I find him so repulsive by his words and actions.","post_message":"THESE 23 HOLLYWOOD IDIOTS PROMISED TO MOVE IF TRUMP WINS..... LET'S HOLD THEM TO IT"},{"comment_id":"1142584762463568","commenter_b":"President not dictator","commenter_a":"Donald Trump nuclear war","post_message":"Indiana governor and Republican vice presidential nominee Mike Pence spoke at a rally at the Space Coast Convention Center in Cocoa, Florida."},{"comment_id":"1244441208928501","commenter_b":"@username, women can't do anything they want to men. Are you saying that because you can't get laid, you should be allowed to kick a woman down the stairs?","commenter_a":"There's no excuse for this. No, none whatsoever. #MisogynySucks #EndViolenceTowardsWomen #TreatHerKindly #TreatHerWithDignity #TreatHerWithRespect Only a #Caveman would do that.","post_message":"A man in Berlin kicked an unsuspecting woman from behind, sending her flying down the stairs."},{"comment_id":"992230870799703","commenter_b":"Naw...she's right and yet...people keep fuckin around with white people. Get smart. Leave the crazy bastards alone. Duh.","commenter_a":"Jason, maybe whites should stop shooting up their own movie theaters and schools. And show me evidence of blacks attacking police officers. I suggest you worry and take out your own trash before you start with racist bullshit. Serial killers, rapist and mass murders Mostly white.","post_message":"Rebel Wilson's usually so funny so this awful joke about police and black lives came as a huge shock. #VMAs #BlackLivesMatter"}]
