[{"comment_id":"10154040346806162","commenter_b":"Low life POS!!!!","commenter_a":"Sad how you kill your own child u will rotten in jail rip","post_message":"FAMILY MURDERED: A man is accused of killing his 2-year-old daughter and her mother over child support: @webpagelink"},{"comment_id":"904790836280638","commenter_b":"Absolutely","commenter_a":"Obama care","post_message":"What's fair is fair! Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1033509070100318","commenter_b":"@username yes you god damn do! Women throw sex parties and drink alcohol through dick straws for Christ sake! Most women are guilty of cheating at some point in their life. That's what we as a species do, we eat and have sex. Like or hate it, men hunt for women and women love it","commenter_a":"I find it very sad that WOMEN are defending it, what the fuck is wrong with you? I'm sorry you feel that you should allow a man to have his way with you. It's sickening.","post_message":"EPIC! Oh, and the woman in red is a REPUBLICAN! This happened tonight on CNN. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10154383180609641","commenter_b":"Now this is the kind of stories we want to see and hear... Not lesbian kissing in public yet in their hearts they know too that unless they repent and accept Jesus as Lord they are on their way to Hell","commenter_a":"Moms...","post_message":"Meet the woman behind Usain Bolt."},{"comment_id":"10153575430048525","commenter_b":"It is absolutely ludicrous that a law had to be made for that. What she did was animal cruelty.","commenter_a":"It used to be legal but in 2011 they pass the bill in Florida banning sex between humans and animals.","post_message":"Deputies say they arrested her after seeing video. STORY: www.fox13news.com/news/florida-news/@username-story"},{"comment_id":"1370641286340188","commenter_b":"HE is transitioning. This FEMALE is taking a hormone that naturally occurs in both sexes bud. The hormone treatments are meant to change the development of certain features. Nails, hair, masculine chest, skin tone, fingers etc. Workout drinks for women such as, pre workout, come with testosterone for added boosts. Now, there are specific weight categories to ensure fairness. There is a woman that goes to my gym, I overheard her say she weighs 150lbs. She can bench as much as me. She can squat more than me. It's all about the work and dedication you put into your day and routine.","commenter_a":"Testosterone. Why SHE, shouldn't have been allowed to compete against boys or girls. Period.","post_message":"He didn't back down."},{"comment_id":"1225000220856314","commenter_b":"You're so evil Hillary! @webpagelink","commenter_a":"We don't have a depleted military, you moron.","post_message":"\"We cannot have a depleted military.\" Donald J. Trump speaks to supporters about the military @webpagelink"}]
