[{"comment_id":"663875460469699","commenter_b":"American news you suck! This story in all of their stories are not real! I cannot believe how many people fall for this b*******! Laughing my f****** ass off! Get a life people go spend some time with your families and try to figure out what you can do to help the country! Unbelievable! American news you suck!","commenter_a":"If they don't like our traditions don't come here...That was easy...","post_message":"The Obama administration is trying to ruin your thanksgiving. This is absurd. We can't let him get away with this. Will you still call it Thanksgiving no matter what?"},{"comment_id":"10153083977090950","commenter_b":"The costume? Stupid. Offensive? A man who think he's a woman when NUTURE decided MALE for him and no amount of procedures will change his MALE DNA. That's offensive. What is he a salmon? Science needs to come up with some kind of rehabilitation approach or program to try and fix this social diseases, including homosexuality.","commenter_a":"Why not it's holloween nway haha","post_message":"The \"Call Me Caitlyn\" costume faced Internet backlash, with some calling it \"transphobic.\" Stores, however, think the outfit \"celebrates her.\""},{"comment_id":"519362884912406","commenter_b":"Unfortunately, the difference is usually that they are dead after interacting with her...","commenter_a":"Bye","post_message":"Hillary Clinton: \"I am not a natural politician like my husband or President Obama...I just have to do the best I can, get the results I can, make a difference in people's lives.\""},{"comment_id":"10153518944503984","commenter_b":"It's the Holy Spirit's job to convict or convince the unbeliever that they need a Savior. We can share the GOOD news that Jesus died and took our punishment for our sins but it is not our job to make people feel bad. Their hearts will know because of the Holy Spirit. We can share the news that we, too, were once sinners but now we are saints. People who come to God out of fear or condemnation usually won't stick around long because those emotions go away. People need to know that Someone has taken their punishment for sin for them and that they are loved more than words can say. We ALL are searching for love. Hope this helps.","commenter_a":"The Bible says it is the KINDNESS of God that leads people to repentance which is what it sounds to me like Joel Osteen is giving. Read the Word!! Jesus was not a hater no matter what people did. Paul or Saul, killed Christians too.","post_message":"Mega-church TV pastor Joel Osteen just made a sickening announcement about Muslims... Spread this absolutely everywhere... the REAL Joel Osteen needs to be exposed. Do you agree that Osteen is a fraud?"},{"comment_id":"10154478022181973","commenter_b":"I was looking at the protest videos of the inauguration and in a couple of clips I saw ppl with anarchists gear on vandalizing those businesses so I don't like it when the media on both sides of the aisle says it's only one group causing something.","commenter_a":"I WANT A ANSWER LIBERALS. WHY HIDE YOUR FACE? I BET I WON'T GET ONE.","post_message":"During the \"Not My Presidents Day\" rally, bike-mounted officers pushed the crowd out of the street and a standoff ensued, with police in riot gear keeping the protesters to the sidewalks. Then, as the protesters stood by and chanted, police charged in and grabbed several people, dragging them from the crowd before they were handcuffed and put in waiting police vans. Read more here: @webpagelink"},{"comment_id":"1265414436832359","commenter_b":"SHAME ON THOSE ASSHOLES","commenter_a":"Alabama - the best argument in favor of mandatory abortion.","post_message":"From Restricting the right to vote to using $1.8 million to renovate his beach house, Republican Governor of Alabama now sinks to a new low with awarding his staff with $73, 405 raises after blocking a minimum wage increase in Birmingham."},{"comment_id":"10153876447145329","commenter_b":"Attention whore.","commenter_a":"Laura This might help you understand some stuff","post_message":"Is ~everyone~ on Twitter fighting? (via BuzzFeed UK)"}]
