[{"comment_id":"1048538675181808","commenter_b":"Grow up yourself...it will not affect her in becoming the next loser female Barry. That was my point!","commenter_a":"So what!","post_message":""},{"comment_id":"10155320618472668","commenter_b":"@username bigly, hum, never heard that word before. She is a hateful lady, period!","commenter_a":"I thought she was moving? Time to leave loser. It's time to take care of your own run-a-way and drug addicted children!!","post_message":"Following reports that President Trump was upset at seeing Sean Spicer impersonated by a woman on SNL, Rosie O’Donnell has stepped up with an offer to play Steve Bannon on the show."},{"comment_id":"10153303118249203","commenter_b":"Beauty.","commenter_a":"That was an awesome episode!","post_message":"John Oliver made NSA whistleblower Edward Snowden crack on Last Week Tonight with John Oliver during a surprisingly contentious interview."},{"comment_id":"1273398092695609","commenter_b":"Rosie is one of the most disgusting women","commenter_a":"protect your kid not your pigs","post_message":"Rosie is disgusting!"},{"comment_id":"10153701487053984","commenter_b":"She need to stay out of all business","commenter_a":"tell that ugly monkey to miind her own business","post_message":"Students have been complaining about Michelle O's lunch rules since they were implemented, but now it just got taken to a whole new level... Do you think schools should quit enforcing Michelle Obama's lunch rules?"},{"comment_id":"1101197406562586","commenter_b":"wheredid they dig these women up she does not know what she is doing..she mite as well givr the city to the thugs, disarm the police and go home and take a nap","commenter_a":"Burn it","post_message":"There are people openly worrying if Mosby's case fails, if Baltimore will burn to the ground."},{"comment_id":"10156140498930206","commenter_b":"She will definitely turn heads if she gets into the debates.","commenter_a":"@username has the knowledge, skills, and class of Reagan. She's disarming when she speaks, and able to get persuasive messages about individual liberty across to people who instinctively resist it. If she's nominated by the GOP, I think she has the best chance to win. If she's elected, she could invigorate the conservative/ libertarian movement and put our nation back on course.","post_message":"Today in Barrington, New Hampshire I toured Turbocam International and heard from voters ready for citizen leadership in Washington at a packed townhall. Join our team today. @webpagelink"}]
