[{"comment_id":"1388976751118684","commenter_b":"STOP KILLING BLACK PEOPLE","commenter_a":"معقول يصير بامريكا","post_message":"Courtesy: Ruptly"},{"comment_id":"1213265855432501","commenter_b":"I quit watching long ago. Now I know why. Bunch of bitches!","commenter_a":"Why don't they just give it up... Everytime they say something bad about Trump their show loses viewers. I never watched them but if I came across it channel surfing I'd stop and see what was on... Now I will keep surfing.... And I'm sure I'm not the only one.","post_message":"Joy Behar of 'The View' just said Donald Trump will bring “mental illness” to the White House."},{"comment_id":"1140950715967044","commenter_b":"Lying two faced cutthroat hag.","commenter_a":"If mouth is open lies are being told.","post_message":"BOOM! Coal Miner Calls Out Hillary to Her FACE! Watch her try to 'umm umm babble babble' a way out of it VIDEO  The entitled hag gets slapped with karma! WATCH!"},{"comment_id":"10153054490024877","commenter_b":"This woman proclaims her ignorance every time she opens her mouth. She would do better to be seen and not heard.","commenter_a":"This thing has no soul. Fox News is her God & it dictate that,she say the most outlandished comments.There is a special place in hell for her. #Judgement day is coming soon.","post_message":"Ann Coulter on black protestors: Haven’t we done ‘Enough’ to make up for slavery? And that's just the beginning of what she has to say.   Grio fam, this video clip is controversial to say the least. Check it out and sound off below!"},{"comment_id":"173468886485698","commenter_b":"Well...Bye!","commenter_a":"California says screw you USA, until they want something from the rest of us in the USA.","post_message":"Spread this everywhere!"},{"comment_id":"10150650975759999","commenter_b":"Idiots will vote for Trump.","commenter_a":"How do you spell landslide? Trump Trump Trump...","post_message":"When it comes to Donald J. Trump and the 2016 race, 'we're still in the swimsuit competition. It gets harder in the talent rounds.'  Read on in The New York Times Opinion."},{"comment_id":"10154417440556729","commenter_b":"Muslim Jihadem Horde!","commenter_a":"And guess which country is going to have to fix things like in WWII?","post_message":"Hello??? Is anybody listening?"}]
