[{"comment_id":"10153389202536051","commenter_b":"Bitch your fake, n ugly to boot !!!! Fake ass , go be with Obama !!!","commenter_a":"Quick somebody wake her up! She's having a nightmare!","post_message":"This model says that after wearing a corset for 7 years and getting four boob jobs, two nose jobs, butt implants and all her teeth removed, she finally has the \"perfect\" body. Decide for yourselves if that's true."},{"comment_id":"999021020109368","commenter_b":"This is legislature that should ONLY be debated and decided BY WOMEN!!","commenter_a":"mayam merouane ok @username","post_message":"What a brave woman"},{"comment_id":"1787231111544405","commenter_b":"She was sucking the hell out that dick! Stephanie Nicole Goad lmfao","commenter_a":"Macie Knisley @username lol ummmm #Merica lol","post_message":"This Veterans Day party gives free tattoos, haircuts and blowjobs to veterans..."},{"comment_id":"10152669039472894","commenter_b":"Amber must have taken your man or shaded you at some point in life miserable hoe. Get some counseling and stfu.","commenter_a":"And I hope he gets it, a son needs his father. And ratchet bald hoes don't need thier kids","post_message":"Wiz Khalifa Claims Amber Rose is a Bad Mother, Seeks More Custody of 1-Year-Old Sebastian"},{"comment_id":"1126715847370658","commenter_b":"A very excellent metaphor. Kinda bugged that I didn't come up with it myself!","commenter_a":"Ok, lets operate in the realm of hypothetical for a moment. Assume, if you will, the following: 1) There is a civilization capable of inter-solar system travel. 2) They would be bothered enough to interact with a species that cannot manage such travel. 3) We could hope to withstand attack if a species fulfilling [1] and [2] decides that we aren't worth keeping around. It seems to me that such a civilization, if it exists and meets those conditions, would be able to discern the effect of the gravitational field produced by our humble planet. To make it invisible in a visually perceptive sense is naive and utterly useless in the face of such circumstance.","post_message":"Should we be hiding?"},{"comment_id":"10153081622630329","commenter_b":"Yeah because all Muslims are terrorists....you absolute dickhead","commenter_a":"I've been saying this for many many years now and this just proves me right. Especially after 911 we should have turned that entire part of the world into a sheet of glass. The women breed them, the kids are trained like them and are used as mercenaries. KILL THEM ALL. There are to many to sort out and sift through to decide who's good and who's not. Point blank end them all.","post_message":""},{"comment_id":"10154941549643057","commenter_b":"@username You can't get back in the US because of a wall.","commenter_a":"Wow! He really showed him! The walls still gonna happen! No more cancerous illegals!","post_message":"#BREAKING: Mexican President Enrique Peña Nieto says he will not attend a planned Jan. 31 meeting with President Donald J. Trump, hours after Trump tweeted the meeting should be canceled if Mexico won't pay for a border wall."}]
