[{"comment_id":"10153654951896519","commenter_b":"@username tell that to Europe where is a hell hole for sex workers in the \"legal\" market and human trafficking of child prostitutes is at an all time high. Prostitution functions on the idea that women and their sex organs are a commodity to be bought and sold for the pleasure and consumption of men, it's dehumanization 101, how on earth could it be empowering when the average age that people start sex work is at 14?","commenter_a":"It is aginst the law yet you break it, You understand that liberals do not want you exploiting these women and yet you are hypocrite for doing so.","post_message":"\"Instead of seeking love, I sought success...\""},{"comment_id":"10153336997560927","commenter_b":"What about the perverts that are wide open now to expose themselves? Are bathrooms their safe place now to sexually harass the opposite sex? What are libtards going to do when they become victims of their own lunacy?","commenter_a":"We truly need to abolish the ACLU they are bad news for America","post_message":"ACLU: \"By requiring people to use restrooms that do not correspond to their GENDER IDENTITY, this policy not only endangers and discriminates against transgender people  it also violates federal law ...\""},{"comment_id":"1080503548665334","commenter_b":"Fry that evil cow!","commenter_a":"Liar liar North Korean Pants suit is on FIRE!!!!","post_message":"“Stunning”"},{"comment_id":"1308930149151726","commenter_b":"Smug asshole !","commenter_a":"and why is anyone voting for this self centered fool ....","post_message":"His response is simply \"deplorable.\""},{"comment_id":"10153634685079255","commenter_b":"You are ill informed at your preference. REAGAN was the first president to turn a blind eye with a wink = let the Latinos and work for way below minimum wage as we all get RICH RICH =GREED TAKES OVER AMERICA AND BLATANT HATE ABOUNDS.","commenter_a":"Typical Democratic attack. People, the bottom line is this: ENFORCE THE IMMIGRATION LAWS already in place!! The Republican attacks on immigration are soley to counter Hussain Obamas illegal actions concerning immigrants! We as a Nation CANNOT AFFORD what his policy is going to do us! I believe we all know Thuh Donald's ideas are out of bounds, what is your solution?? I don't want to see children born of illegals deported,.. I do want to see those families placed into the process of becoming American citizens. The system is broken and quite frankly NO ONE has an answer to fix it, all you want to do is bitch about the other party. Politics as usual...","post_message":"Nailed it.  By Daily Kos user and AFL-CIO President Richard Trumka"},{"comment_id":"1013220235397406","commenter_b":"She is an ugly witch. No wonder Bill looks elsewhere.","commenter_a":"Hillary is a has been Murder Embezzlement List ghost oes on","post_message":"ISIS just needs a hug..."},{"comment_id":"1166718606737699","commenter_b":"Why?","commenter_a":"Anyone realize some veterans actually support Kaepernick. Also if you think this is the best country in the world you must be ignoring the debt, constant war, and division of society by ethnicity, race, sex, religion etc. that is plaguing this country. So if you think this country is not oppressive then you are wrong. If you think this country represents equality you are wrong. If you think this country represents democracy you are wrong. If you think this country represents the bourgeoisie elite and capitalist greed then you are right and that is why I won't support the flag not to disrespect the troops who died but to respect them because they died only for greed and American imperialism.","post_message":"Allen West Republic"}]
