[{"comment_id":"485911244932789","commenter_b":"be head her","commenter_a":"Yes , l support our police","post_message":"A woman is suing the police department... over a hijab? This woman broke the law, the police are completely in the right. Do you support our police?"},{"comment_id":"950475968345485","commenter_b":"she is fuking fat end off...","commenter_a":"I'm sorry, but fat people are NOT hot, sexy, or beautiful. Just ask a obese persons heart how healthy it is.","post_message":"'I want to challenge society's perception of beauty' - Tess Holliday"},{"comment_id":"1037527509601593","commenter_b":"Well America will allow idiots to have guns","commenter_a":"What a dingbat","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"10154092058261636","commenter_b":"Did you have to turn on you \"English APP\" to type that?","commenter_a":"Gross! And Then he said: \" I will be dating her in ten years\". His own words","post_message":"She was having none of it"},{"comment_id":"10153488237764087","commenter_b":"Her looks are irrelevant to the fact that Trump is a punk ass bitch and his supporters leave slime trails.","commenter_a":"I have a challenge for Megyn. How about she show up at the debate wearing ZERO MAKEUP, so she shows her true self and not the all painted up deceptive image of who Megyn Kelly really is. Come on Megyn, quit hiding behind that makeup paint.","post_message":"\"As I've said before, I would rather set myself on fire in front of the Fox News studio than go on the debate stage with [Megyn Kelly],\" Morning Joe's Joe Scarborough said."},{"comment_id":"10153697157652098","commenter_b":"THIS ARE MAMA'S KIDS THEY NEVER DON NOTHING BAD, NO DRINKING, DRUGS, ROBE, HURT OR KILL SOMEONE, WHY THE POLICE DON'T SHUT ALL OF THEME ON THE SPOT, TAKE THEIR CARS AND NEVER LET THEM COME OUT OFF JAIL. EVER. BUT THEY GOT MORE WRITES THAN YOU OR ME. UNTOUCHABLE. IF YOU TOUCH THEM THE STUPID PROTEST WILL START.","commenter_a":"Nancy Jovana","post_message":"VIRAL VIDEO: A CHP vehicle was vandalized as an East Bay sideshow took place... DETAILS & FULL VIDEO: @webpagelink"},{"comment_id":"10154589081180586","commenter_b":"@username YOU ARE A BRAIN DEAD MORON","commenter_a":"Here's the thing- There are plenty of us voting for Hillary, we just don't find the need to scream about it all day long, ya know? And maybe we don't put up signs because we know the kind of needless drama it will start with any childish, loose cannon Trump supporters that happen to come across it... The Hillary supporters are here, we're just too busy working/paying taxes and rocking the good life to yell it from the rooftops everyday...","post_message":"Another national survey shows Hillary Clinton and Donald Trump in a near-even race in the final weekend before Election Day."}]
