[{"comment_id":"10154137959598701","commenter_b":"Dumb tweaker bitch","commenter_a":"Debbie someone actually fell for it.","post_message":"In Case You Missed It on Good Day Oregon: A contender for world's dumbest criminal. A Texas woman fell for a police department joke: a Facebook post with a warning about meth and heroin \"contaminated with Ebola\"."},{"comment_id":"10154776227370399","commenter_b":"Listen to all the cry baby's all the little bitches are just jealous because they don't have what she has and besides it don't make a damn if her daddy gave it to her. So just shut the fuck up","commenter_a":"It's called Democracy. Don't like a company, don't buy it. It's evident large companies want to distance themselves from tRump and his administration.","post_message":"\"If Ivanka were anyone else’s daughter, she would be praised as a trailblazer.\""},{"comment_id":"10152816643679877","commenter_b":"She don't need to she's not Muslim","commenter_a":"They would criticize her either way. If she wore it, they would be hollering about how she supports terrorists, then the ignorant right wing tea party types would link it to Obama being a Muslim.","post_message":"Oh boy, they're coming for Michelle Obama for not wearing a headscarf in Saudi Arabia. Read more about her critics below. Grio fam, this seems foul to us. What do you think?"},{"comment_id":"1225168154206852","commenter_b":"No woman in her right mind would have voted for this man. God help us all.","commenter_a":"Genial","post_message":"'Donald Trump will make our economy great again'"},{"comment_id":"10154249719951615","commenter_b":"Oh for real? That's good to hear bro.","commenter_a":"Poor kid. If Mt Oliver Cops are the lead investigators she may never be found. 😢😢😢😢😢😢😢","post_message":"PLEASE SHARE: Brandi Kolas was last seen Feb. 2 in Mount Oliver. She has blond hair and blue eyes, is 5 feet, 7 inches tall and weighs 110 pounds. Anyone with information about her whereabouts is asked to call 911, the National Center for Missing & Exploited Children or the Mount Oliver Police Department."},{"comment_id":"1820431918212382","commenter_b":"Stupid whore","commenter_a":"Good !!!!","post_message":"My, my, my..."},{"comment_id":"588617531328826","commenter_b":"She is a joke","commenter_a":"Yes she should keep her mouth shut. She is not the president (neither is Obama). She mouths off and there are Americans starving and dying because they cant get medicine. They both need to just go away. They dont need to be in the US.","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with. Nobody cares. What a joke. Do you agree Michelle Obama should keep her mouth shut?"}]
