[{"comment_id":"10153169789203855","commenter_b":"She's a self-hating traitor.","commenter_a":"I thought Caitlyn was a Republican -- not at all a liberal. I'm sure I read that. Maybe Rush thinks party change is part of gender reassignment.","post_message":"A hateful man."},{"comment_id":"1219528801419908","commenter_b":"^^^dumb bitch","commenter_a":"The one and only way it could have been prevented was if he complied with the officers instead of resisting after being tasered twice and thrown to the ground.","post_message":"CASE CLOSED....  @webpagelink"},{"comment_id":"10155498405191729","commenter_b":"That's where he belongs. Back stabbing ungrateful dodo.","commenter_a":"Eeek. What ticket would he be on? Dem?","post_message":"Interesting..."},{"comment_id":"639833176157924","commenter_b":"Data and meta intelligence gathering of phone and internet data has NOT in any way shape or form been Stopped. Theres just been several bills past so that its now need to know disclosed. And America has had the uk parliament put these same laws here. So that from a judge is a downright lie. Also almost every american these days became that way from imigrants. Infact at one point more than half of Scotlands population emigrated to the Usa. To try and scare monger over a handfull of idiots that went mental over the several million who are helping the united states in the military, your hospitals , your restaurants etc. Its just cringeworthy and shamefull. And defending your self is one thing no one would want you to not do. No one wants harm on anyone. But more guns will only mean more dangers and more tragic and ...","commenter_a":"Opening statement? To what!? It'll soon be 2016. How long will you continue to spew this inflammatory propaganda?","post_message":"\"Number one: Get a gun.  Buy one legally.  Learn how to shoot.  And be primed to use it.\"  Last night on \"Justice,\" Judge Jeanine Pirro shared her plan for \"surviving\" in the wake of the #SanBernardino terror attack. @webpagelink"},{"comment_id":"1033160160077065","commenter_b":"And why don't you keep your fat mouth shut?","commenter_a":"Divorce the fat pig and get Urself a nice slim lady!","post_message":"Wife won’t ler husband see her naked after pilling on 140lb"},{"comment_id":"10152934995226680","commenter_b":"Seems you want to engage in gossip. I got better things to do with my time. Scoot along Andrew.","commenter_a":"Bernie's right. The biggest mistake of the Clinton administration was dismantling Glass-Steagall.","post_message":"Bernie Sanders: \"Allowing commercial banks to merge with investment banks and insurance companies in 1999 was a huge mistake.\""},{"comment_id":"10153891408869062","commenter_b":"Yeah","commenter_a":"Waiting on PA","post_message":"JUST IN: The Texas House Committee approved a bill to make marijuana legal for adults. It still has a long way to go before becoming law, but what do you think?"}]
