[{"comment_id":"591336634387962","commenter_b":"Build the wall!!","commenter_a":"That's California for ya. I find nothing wrong with what he said in 1971. Things were different then. I said things in 1971. Does that mean I'm a racist today? I am military where everyone's color is either desert camo or woodland camo. I find affirmative action quite racist. Employers should be able to hire people because of their skills not because of the color of their skin. Absolutely ridiculous.","post_message":"California lawmakers refuse to honor John Wayne! and here's why..."},{"comment_id":"10153412861986167","commenter_b":"A bunch of false prophets and their followers, sickening.","commenter_a":"First of all, for those who wish to criticize my typos complain to google translate. I'm dictating this and I don't have time to go back and correct typos. When it comes to SOCIAL ISSUES, topics like gun control, abortion, gay marriage etc voters who latch on to these things miss the big picture. The big picture involves having a viable economy in which to have debate about social issues. An economy cannot survive on social issue focus. It is a fact that 70% of all entitlement Dollar goes to bureaucrats not to the poor. @webpagelink To this day paychecks from the government are being dispersed to illegal immigrants, prisoners and dead people. There are perhaps hundreds to thousands of programs that have been budgeted by the government which always end up taking longer to implement and always cost more than expected. Under Hillary Clinton and Obama, six billion dollars ...","post_message":"He also thanked the star of Duck Dynasty."},{"comment_id":"1721110158153806","commenter_b":"I wanna see this dumb bitch fight off an intruder in her home with a vibrator","commenter_a":"Pedro Tosta K. Nogueira","post_message":"These students are protesting open-carry laws by handing out dildos.  #Micbrights"},{"comment_id":"10153912123821409","commenter_b":"Wow she should be kicked out for that!!","commenter_a":"You signed on the dotted line !! Hate to break it to you . Your job is to protect the freedom of this great nation. To bad you will be in the brig CHILE !!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154180124161770","commenter_b":"She is an evil witch who got away with murder.","commenter_a":"Poor baby dog","post_message":"The entire nation thought Casey Anthony murdered her daughter..."},{"comment_id":"1124947717560231","commenter_b":"Hurry up woman!!","commenter_a":"Alright, that's it...we're moving to Colorado. @username","post_message":"It is absurd that here in America, we remain the only major country on earth not to guarantee health care to all people. If this proposal for universal health care can win in Colorado, I believe it will spread around the country."},{"comment_id":"10152918122661336","commenter_b":"we cant have a female for president ever, do u know wtf is gonna happen when they hit there monthly period, there gonna be droppping bombs everywhere for no reason","commenter_a":"Omg pls no","post_message":"Former Alaska Gov. Sarah Palin says she is 'seriously interested' in running for president in 2016."}]
