[{"comment_id":"1034492959948582","commenter_b":"Strike one for Bernie. This has been well refuted many times over. Besides the feminists will vote for Hillary only for the fact she is a woman.","commenter_a":"All you brogressives claiming the wage gap doesn't exist don't deserve to have Bernie as your president.","post_message":"Women are making 79 cents on the dollar compared to men. For women of color it's even worse. African American women earn just 63 cents for every dollar a white male earns, while the figure for Hispanic women is just 54 cents. That's nothing but sexism and discrimination."},{"comment_id":"10152998620161770","commenter_b":"She is a liar and cheat .","commenter_a":"That's because thousands of us protested on how the media thinks they can determine who they want on stage and trying to push there own agenda.. This was the absolute right decision on CNN behalf.. Remember CNN, ABC, fox, and the rest of the media scum that keeps trying make decisions on who can and can't be in any presidential debate.. All candidates should be allowed on stage..","post_message":"Carly Fiorina will join the other GOP candidates on CNN's debate stage."},{"comment_id":"10153320110664641","commenter_b":"her kids are black, derp","commenter_a":"As long as she is not racist and is doing good she is my sister! Her being white does not change anything","post_message":"Rachel Dolezal represents the black community publicly and vocally. But her birth certificate says she's white."},{"comment_id":"10153532117044586","commenter_b":"Test on the bimbos that model, that's what I say. Ugly monsters","commenter_a":"Please, help, Humane Society International...please.","post_message":"TERRIBLE NEWS: Here are some of the animals who will be hurt for Victoria's Secret."},{"comment_id":"755392124560784","commenter_b":"Happy New year","commenter_a":"Go Bernie..he's the right person for the job!!","post_message":""},{"comment_id":"455432694647311","commenter_b":"Will not eat there. She would turn my stomach and I couldn't eat---ugh","commenter_a":"Well that does it McDonald's out","post_message":"Would You Refuse To Eat An 'Obama' Burger? Comment 'yes' or 'no'."},{"comment_id":"906483276114592","commenter_b":"Oh shut up Jindal you backward cretin. The world's views have changed and long overdue. I am glad to see that people can choose to marry whomever they want. We all live on this planet and all should be able to marry who they choose.","commenter_a":"Separation of Church & State! What part of that doesn't this fundamentalist christian rube understand?","post_message":"“I hold the view that has been the consensus in our country for over two centuries: that marriage is between one man and one woman. \" -Gov. Bobby Jindal"}]
