[{"comment_id":"741809245917684","commenter_b":"THOSE 3 BITCHES...ARE GETTING THE SHIT GANG BANGED OUT OF THEM NOW.","commenter_a":"IS is recruiting sluts for sex only son","post_message":"Aqsa Mahmood, 20, left her home in Glasgow in 2013, and married an IS militant in Syria."},{"comment_id":"10153348075419255","commenter_b":"who would want texass anyway","commenter_a":"I laugh every time I see these two big wusses trying to play badass.","post_message":"Idiots."},{"comment_id":"10154527348963352","commenter_b":"Kiss his ass","commenter_a":"I agree with him!","post_message":"RUSSELL SIMMONS GOES OFF ON OBAMA WITH NO KIND OF RESPECT! BASICALLY SAYS OBAMA AIN'T SH*T! (PHOTOS) @webpagelink"},{"comment_id":"1082049255206943","commenter_b":"'Claim to be Muslim'??? Muslims marry 6 year old girls! Muslims think that women are 2nd class citizens! Muslims believe that women shouldn't be allowed to drive or leave the house alone! Muslims believe that the punishment for being gay is DEATH! Their culture and our culture can't coexist peacefully! Is there some part of that that you can't understand?!?!?!?","commenter_a":"It reminds me of Sodom and Gomorrah. The whole group would not allow the police to get to the BOY...What the fuck is wrong with these sick Bastards, that claim to be Muslim? Raping of young boys and girls is okay? I ned to re-read the Koran...","post_message":"Some of Obama's Muslim 'refugees' were raping a 10-year-old boy when the cops were called.  The police arrived, but what they did once they got there has left the country furious.  It's time America learned the WHOLE truth..."},{"comment_id":"10153120617440927","commenter_b":"Yep, she's the best they got. crappy pants and all","commenter_a":"You can't help but admire a woman who stays married to a serial rapist and craps her pants during the last Democrat debate.","post_message":"59 TIMES: Billy Graham has been in Top Ten more than any other person Pope Francis and Donald Trump both got 5% this year Teddy Kennedy tied Blessed Mother Teresa with 18 years on the most-admired list"},{"comment_id":"1748877948703805","commenter_b":"Always been there for women? She doesn't even pay equal to men in her own foundation and campaign. Bernie's 'socialist destination' is s fulfillment of FDR's vision. Hillary will fulfill the Koch brothers and Walton family's vision. I don't revere poverty, nor do I support buying an election and using electoral fraud to gain office. No, Bernie won't 'part the Red Sea,' but the electorate he is inspiring will effect a revolution.","commenter_a":"It seems to me that the Super Bernie people are caught up in useless passion over issues that are neither new or original. I distinctly recall when Mrs. Clinton went to capital hill and pitched for universal healthcare on live television. She was eaten alive, but she stood her ground as she has on the grassroots level many many times. She's always been there for women especially where wages were concerned. And there is so much more. Mr. Sanders is not a bad person but it is a bit disinginuous to ride the democratic train to get to a socialistic destination. It's also unfair to insist that anyone who has made the system work for them is a bad person. Bernie is no more deserving of reverence for the money he doesn't have than Hillary for the money she does have. She worked for hers' and he worked for his. ...","post_message":"Time to unify the party."},{"comment_id":"10153970480428734","commenter_b":"support the blue, let her pay for her own security!","commenter_a":"Too bad for Miami, they will just lose all of the tax revenue they would gain by Beyonce performing in their city. She doesn't need them they need her and the police want the overtime pay. All talk.","post_message":"Law enforcement around the country have been critical of the singer since her Super Bowl half-time performance, which referenced the Black Lives Matter movement, Malcolm X and the Black Panthers."}]
