[{"comment_id":"10154385658569197","commenter_b":"@username good one","commenter_a":"They should cancel all outdoor activities in sports .. Those poor kids too hot for them","post_message":"It's 9am and the heat index is already at nearly 100! What are you doing to stay cool today?"},{"comment_id":"944837115644330","commenter_b":"No way trump will win this election! Most white, asian, african american and latinos will unite on november and bit the heck out of trump! Never will vote for a someone that makes fun of disable, a rapist, a liar and a PSYCHO!","commenter_a":"The audacity of your campaign sickness me to my core :/ . You and your minions are the \"deplorables\" . All you that support these monsters should be ashamed of yourselves! #Trump2016","post_message":"If Donald J. Trump becomes president, how can we guarantee that he'll choose America's security over his own financial interests?"},{"comment_id":"1338680576172411","commenter_b":"Omg pathetic!","commenter_a":"@username, a good laugh.","post_message":"This is hilarious and sad."},{"comment_id":"10153099385609255","commenter_b":"Of course there is climate change. It's been jumping around forever.","commenter_a":"The animals are a bit smarter than the scientists and they live in the weather not a lab","post_message":"Happy Groundhog Day—here's to six more weeks of winter. Thanks to Believing in imaginary friends and fairy tales is outside of my age bracket for sharing."},{"comment_id":"1701604063395144","commenter_b":"Ze pretty ladies","commenter_a":"@username William Joseph.. You boys come get me !","post_message":"So I'm on my way to Germany to get arrested."},{"comment_id":"1189693781087315","commenter_b":"so wrong. We need to let Russia have their way with Soros and rid the world of this vermin.","commenter_a":"Soros is behind the refugee flood into Europe. His organizations sent Syrian approx. 19,000 tweets promising them housing and jobs in Europe and telling them how to get around border guards. He also was behind the whole effort led by Hillary to overthrow Middle East governments and replace them with governments of his choice. His influence has cost the deaths of thousands and thousands of people in the Middle East. This is the face of evil.","post_message":"Hacked documents from George Soros’s Open Society Institute state that the billionaire and his foundation helped to successfully convinced the Obama administration into increasing the total number of refugees taken in by the U.S. from 70k to 100k per year."},{"comment_id":"10153146090320667","commenter_b":"Watch out she's going to report u lmao","commenter_a":"Go get a life,","post_message":"In about three days, the group has collected 30,000 signatures."}]
