[{"comment_id":"10153141451562894","commenter_b":"She a dub","commenter_a":"@username 😕","post_message":"Kylie Jenner literally just went from 100 to 0"},{"comment_id":"10153492886881973","commenter_b":"I gave up.","commenter_a":"Could you make the article even less readable on a mobile?","post_message":"Our pop culture reporter didn't think \"Spotlight\" deserved Best Picture last night, so he went back to give us his picks from the past 40 years."},{"comment_id":"948395698606028","commenter_b":"Karma's a b**** and so is Hillary Deplorable Hillary LIES MATTER Pay for play Lining her pockets","commenter_a":"It was not a mistake...it is who she is. Angry bitter vindictive with money and power. Glad she was feeling enough pressure to be who she always was. A spiteful mean spirited person","post_message":"When you are president, you are president of all the people."},{"comment_id":"444065119108702","commenter_b":"Please don't come. You would ruin the peace with your complaining.","commenter_a":"Would never go to Texas! Actually none of these states that are so in love with guns!","post_message":"College campuses need books, not weapons."},{"comment_id":"1697473917208999","commenter_b":"Joel, We have to pull together!! Please help us get Donald Trump to the White House! We started a small group and we are looking to build it up and educate people Pleaseee pop in from time to time?!? @webpagelink/ Please help us unite!!","commenter_a":"Go Trump! Make America Safe and Great Again!","post_message":"WOW! Great poll. Fox News just released their new GOP national poll - THANK YOU AMERICA! Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"464590737066851","commenter_b":"Unbelievable , to do that to an Elephant . Ought to cut his ta#@#@ fingers off.","commenter_a":"Neither.","post_message":"Left side: Donald Trump's son holding the tail that he cut off an elephant he shot in Africa. Right side: Chelsea Clinton working to prevent the illegal trade of ivory in the world. Whose family values do you prefer?"},{"comment_id":"10153204485844087","commenter_b":"Lucky!!! I wish I could have gone.. And TO ALL LIBERALS. I'll end with this.. Yall say if you're not natives to shut up about immigration. Tell you what, when the Mexicans conquer the land like the Europeans, they can have it. When they conquer and claim. Good luck.","commenter_a":"What a fun rally. Sold out and packed American Airlines center. It was beautiful. So beautiful, in fact, they may rename it the Trump center.","post_message":"\"I'm not going anywhere and we're not going anywhere,\" Donald J. Trump told a packed American Airlines Center in Dallas, where an estimated 20,000 rallied. \"We are killing it. They mentioned a little while ago about the silent majority — it's back. And it's not silent. Maybe we should call it the noisy, aggressive, wanting-to-win majority.\""}]
