[{"comment_id":"1499235536803237","commenter_b":"Oh I am pissed, then the ones that need help, can not get it. And that lazy ass gets everything for free and that for 15 years. They should tell her to get her ass out and work, and stop spreading her legs.","commenter_a":"parasites","post_message":"Are you angry yet? Just listen to what she has to say about it!"},{"comment_id":"884938878291056","commenter_b":"I'll fuck her up","commenter_a":"'@username let matce do this she won't ever have that boy again!!!!!! I'll do everything in my power to get him from her","post_message":"Woman Checks A Mother Abusing Her Autistic Son At A Wafflehouse!"},{"comment_id":"1670944519835060","commenter_b":"These women need to learn to lug around bottles with store bought milk that contains half the nutrients in case their baby becomes hungry and fussy and starts bothering everyone around them. They should use their brains!!!!","commenter_a":"Feeding your baby and using your body the way God intended it to be used is absolutely shameful. How on earth could women stand up for such a thing and demand that society accept this!","post_message":"Women are brilliantly standing up to breast-feed shaming.  Read a powerful example right here: @webpagelink  Like ATTN: on Facebook."},{"comment_id":"865539350258452","commenter_b":"Just keep trucking along well have a good president in the office finally","commenter_a":"Vote Trump","post_message":"Thank you Connecticut! See you this evening!! Lets MAKE AMERICA GREAT AGAIN!!"},{"comment_id":"10153541248725950","commenter_b":"Rape and borders. @webpagelink","commenter_a":"If it had been for Berniestan or Queen Hillary, then nobody would have noticed it and @username would not have written any articles on it.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"},{"comment_id":"1096195137073807","commenter_b":"Why are democratic women so scary looking? See what lies do to your face?","commenter_a":"Obama praising himself Hillary looks like she needs to go to the restroom while being admired","post_message":"A note for 2016: the Democrats are the party that abandoned #Israel, enabled the rise of #ISIS and is now helping #Iran to get a nuclear bomb."},{"comment_id":"10154505390413037","commenter_b":"Well most of those benefits we pay go to lazy white people. Look up the facts lol","commenter_a":"So people who have been here 20 plus years....working, shopping, law abiding and not on welfare.....being healthy, productive members of society should be forced to leave.....i don't agree with that nor do I think that is fair! So called Christian people! Our country is not right......","post_message":"now because a lot of people came in illegally there no way we can even apply for papers.   Lara graduated in 2016, was her high school valedictorian and received a full scholarship to UT."}]
