[{"comment_id":"712988442225067","commenter_b":"aint she pretty..i would rather kiss the south end of a north bound mule...","commenter_a":"My God that's one ugly broad she has more rinkles than a road map","post_message":"Like if you agree."},{"comment_id":"10153025578804753","commenter_b":"Which one are you Dave... The chick in the skirt..?","commenter_a":"Cowardly cops should go find work at the library..!","post_message":"Police said the man instead charged at the officer, who retreated behind his patrol car while giving numerous commands for the suspect to drop the rock. The man raised the rock to strike the officer, so the officer fired his weapon 3 times to prevent the suspect from striking him. According to a police statement, the officer, “used deadly force against deadly force”"},{"comment_id":"10154133402331770","commenter_b":"She needs to pull up her big girl panties,get over herself,go sit in a corner an SHUT UP!!!!","commenter_a":"she must have a lot of pull huh? Get of your bandwagon and properly take care of your children why don't you.","post_message":"Should Obama declare martial law and prevent Trump from being president \"UNTIL TRUMP IS 'CLEARED' OF ALL CHARGES\" as Rosie O'Donnell argues?"},{"comment_id":"10153514692996135","commenter_b":"No other president has lived on the \"people's money\" like obama has except maybe the clintons ! They have all had their homes before they got elected and actually used them for \"vacation\" time etc. among other things ! If I have to tell you you must have been asleep for the last 7 1/2 years !","commenter_a":"Pretty good sized house for making pocket change for 8 years. It is funny how all the poor people he was supposed to help are still living on the streets and in the slums of the city ! But the scum always rises to the top ! ! !","post_message":"Check out these photos."},{"comment_id":"841765072552278","commenter_b":"Shoot to kill. This is the only way to stop these people","commenter_a":"I support the police, but I do not think that was the time or place for protest...RIP Officer Liu","post_message":"UNREAL: Here The Disgusting Thing Race Rioters Did To The Widow Of Fallen NYPD Officer @webpagelink"},{"comment_id":"10154299911443128","commenter_b":"40K Cubans today 100K Muslims yesterday.","commenter_a":"I'm sorry, but this old man is as stupid as they come if he really thinks we, as Americans, are buying this inflammatory rhetoric. Get real. Maybe he forgets how or just wants to go the way of his candidate down to LA LA land. Bon Voyage! ;-)","post_message":"Oil billionaire T. Boone Pickens, who endorsed presumptive GOP nominee Donald Trump, is planning to host a fundraising event for the pro-Trump super PAC next month."},{"comment_id":"930011010437419","commenter_b":"Lady u need help fuck grump","commenter_a":"\"Semame?\" Really, is spell checking really that difficult? I'm only pointing this out because it's a constant with your memes and videos. As funny as they are and as much as I enjoy them, please, for the love of God, use spell check. You look like buffoons when you misspell such easy words.","post_message":"WATCH: 10 years ago, Sesame Street called out trashy Donald Grump. Shared by Occupy Democrats, LIKE our page for more!"}]
