[{"comment_id":"10156358767360354","commenter_b":"Fuck that bitch and his man wife","commenter_a":"So sick of this repulsive little sob, 14 more months of the bastard, damn.","post_message":"“We’re going to be aggressive…”"},{"comment_id":"10153464063176509","commenter_b":"Don't correct what I wrote, Gail Mac! Mind your own business. Sarah Palin has no intelligence at all!","commenter_a":"Why her, can you not find someone better with no baggage and have a mother who has no brain.","post_message":"Bristol Palin and Medal of Honor recipient Dakota Meyer are engaged. Meyer, a Marine who received the nation's highest military honor, announced the news on his Instagram account. @webpagelink"},{"comment_id":"10153387791927690","commenter_b":"Amen. If another female in heat walked by, he'd have been on it. He's safe now. But if both had been fixed, neither would have been out by the road.","commenter_a":"Dogs are indeed wonderful. This is a sad story and an all too common story. However, as is the case in many of these sad stories, the male gets loose to chase a female that is in heat. She gets hit by a car and he refuses to leave her side , not because they were best friends or because he is a loyal friend, but rather because he is fixated on the female in heat. The moral of this sad story should be to have your dogs fixed.","post_message":"A heart-wrenching photo tells the story of a loyal dog found by his friend side Sunday morning in Dallas: @webpagelink"},{"comment_id":"10153106111768717","commenter_b":"Ha Ariana Grande get out of America and don't come back and American people should boy cot all her music","commenter_a":"Well if she can lick donuts then it is the shop's problem in leaving them where she can do this, so the shop should be the ones facing criminal charges.....","post_message":"A doughnut shop owner wants Ariana Grande to face criminal charges for licking and spitting on doughnuts -- @webpagelink"},{"comment_id":"10154268012211336","commenter_b":"HURRY UP AND OD, MAKE AMERICA PROUD, FIDDY THENTS.","commenter_a":"50 cent. Ironically, that's also what his career is worth.","post_message":"In a video posted on Instagram, 50 Cent confronts a young man as he pushes a cleaning cart through the terminal and accuses him of appearing to be high on drugs."},{"comment_id":"10154497779774166","commenter_b":"My son. 3 at the time but 6 now, snuck out at 8am to play in the yard and went through child proof knob, door lock and deadbolt. And i was arrested and given a felony for child neglect... Judge here raised voice at me when i told her kids arent dumb. That mine is super smart. And sent me to jail/: now my ptsd is so bad i barely sleep since the day. Because im afraid he'll sneak out again.","commenter_a":"Was he pulled over for \"drunken milk driving\"? LOL! On the serious side, glad he was okay! My children were escape artists when they were younger. Have a toddler now and with having her older siblings around, she doesn't attempt anything like this. She's opened the front door before, but never left the apartment. We used alarms on the front door. Working third shift and having a toddler is hard LOL! But during the week she's at daycare so no worries there... Just worry on weekends when they're home with me.","post_message":"Deputies say the child was found driving down the road wearing only jogging pants and a diaper around 1:55 a.m. Sunday."},{"comment_id":"10153181723473984","commenter_b":"Put all of them in jail there all criminals","commenter_a":"He needs to go!!!!!!!!!","post_message":"Unbelievable! Boehner just gave Obama exactly what he wanted... Do you feel betrayed?"}]
