[{"comment_id":"10155994453335389","commenter_b":"Lady don't hurt me! @webpagelink","commenter_a":"If Trump can't handle a Fox debate against other GOP'ers, how's he going to handle debates in the general election? He may have some good ideas, but he's a sideshow. Always tooting his own horn or would that be a \"Trump\"et?","post_message":"From fiery criticism of ObamaCare and the Iran nuclear deal to support for Israel and the rights of the unborn, the top 10 Republican presidential candidates did all they could to define and separate themselves Thursday night during the Fox News debate in Cleveland, Ohio.  Who do you think won?"},{"comment_id":"533708806819699","commenter_b":"All ready know this she part of the problem","commenter_a":"This is no surprise. Have to be living under a rock if you don't know she's muslim. Her relatives are members of the muslim motherhood and muslim brotherhood.","post_message":"An extremely influential American political figure was just exposed to be a Muslim.  This changes everything. Obama isn't even our biggest problem.  Do you agree Islam is a dangerous religion?"},{"comment_id":"1044742995559452","commenter_b":"Na lock her up n throw away the key, dont need her back in society","commenter_a":"Thanks for posting 3 separate mug shots of a clearly mentally ill person to parade her in front of your audience. Maybe you can sensationalize more Halloween hoarder homes while you're at it. I am glad Nickcole Dykema didn't actually hurt any Deputies (and she most likely could have, ambushing them in her own home like that), and glad the Deputies didn't kill her. This is a lesson for Police dealing w/ the mentally ill everywhere. I do hope this woman gets access to proper mental healthcare, and that through treatment she can find her way back into the world with peace and dignity.","post_message":"Multiple deputies received injuries at the \"house of horrors\"   From removing weapons from the \"booby trapped\" home"},{"comment_id":"800175416791290","commenter_b":"shes disgusting!","commenter_a":"I don't know anyone personally that thinks Amy Schumer is funny . Her only following is a bunch of feminist that think her over the top vulgarity makes her equal to men but even most men aren't as perverted as her .she tries to hard and it just isn't funny or entertaining.","post_message":"\"Of course, we're in Florida, you're going to boo.\" - Amy Schumer after being booed for making jokes about Donald J. Trump"},{"comment_id":"10153584880961336","commenter_b":"@username , IT should be ALL who are here illegally as they ALL have committted a crime by INVADING this country","commenter_a":"So, let me get this strait... Trump is going to deport all immigrants, and take away citizenship from persons naturalized in the United States....That is going to be a lot of deportation since we all have immigrant backgrounds so who is going to check the Family Trees to see how far it goes back..... and who's going to be the \"Gate Keeper\".... I wonder if Trump will also deport himself and his family as well or he planning on being the only person left in America....","post_message":"Donald J. Trump pledges to eliminate the \"biggest magnet\" for illegal immigration by ending birthright citizenship for the children of illegal immigrants. @webpagelink"},{"comment_id":"10154102450848984","commenter_b":"OMG, Hillary is so very, very, very White !","commenter_a":"She just wants to be president, talks a lot of BS.","post_message":"Wow. Hillary Clinton was caught doing something next to Al Sharpton that is fueling the criticism that she is a complete fraud... and it was all caught on camera.  Do you think Hillary will be the Democratic nominee?"},{"comment_id":"1411515005587074","commenter_b":"@username yes you are bitch","commenter_a":"Thank God he is back. Just feel better knowing he is in the USA.","post_message":"Welcome back, President Obama!"}]
