[{"comment_id":"10154915468813984","commenter_b":"The demasses aren't scared of the end. They're scared none of their demon plans to let illegals run our country will be stopped and their kickbacks will end. Yep it's gonna end. We are not your puppets and you can't control us!!!!!","commenter_a":"right on","post_message":"Ann Coulterjust NAILED it... she is going to infuriate a TON of liberals with this."},{"comment_id":"10152730591461545","commenter_b":"^^Is there some kind of cream for that you think? LOL","commenter_a":"Just because it's on paper doesn't mean it is acceptable to God. Period.","post_message":"Sarah Goodfriend and Suzanne Bryant became Texas' first same-sex couple to receive a marriage license this morning. This is them speaking at a press conference in Austin.  MORE: @webpagelink"},{"comment_id":"955924071085730","commenter_b":"Jan St John...ROFLMAO!!!! James Taylor is a lawyer with no training in climatology ...he's a sr. Fellow at the heartland institute which draws major funding from the likes of the coke bros,exxon and a number of other oil&gas companies....this is the best you can come with","commenter_a":"It was 40 above in Alaska last week.","post_message":"TELL ALL YOUR FRIENDS"},{"comment_id":"10154274654574641","commenter_b":"criminals together the murderer of the children in iraq","commenter_a":"We will meet at Hague. ...together with Rumsfeld and Cheney","post_message":"\"I will be with you, whatever\" -- Tony Blair to George W. Bush, 28 July 2002"},{"comment_id":"977678122350240","commenter_b":"Hillary is NOT with us, we are NOT with her.","commenter_a":"The Revolution!!!!! Bernie !!!!","post_message":"Bernie or Bust rally in downtown Philadelphia"},{"comment_id":"10153394285461336","commenter_b":"We love them white girls","commenter_a":"All you Mexican ' s love Mexico so much why did you leave ???","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10153257325640950","commenter_b":"Quit smoking dumb ass broads or don't get pregnant!!!","commenter_a":"Smoking while pregnant should be child abuse. The reason it is not is that Planned Parenthood and the rest of the abortion industry wants no rights assigned to kids when they are in utero, because doing that would admit that they are a person.","post_message":"Smoking during pregnancy can lead to complications including sometimes dangerous premature births and sudden infant death syndrome."}]
