[{"comment_id":"10153535023142522","commenter_b":"fine, let's see what you got","commenter_a":"@username reckon you can make one of these with those design skills of yours?","post_message":"Grill while you chill:"},{"comment_id":"1090710841025167","commenter_b":"Sanders' wife was not known for \"fiscal responsibility while president of Burlington\" as she allegedly overstated pledge donations while filing a loan with the Burlington Diocese of the Catholic Church and forced them to reportedly eat a loss of up to $2 million. Sanders and Wife Accused of Mishandling Campaign Money @webpagelink","commenter_a":"🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸Donald Trump For President 2016/2020","post_message":"Iowa may not be on \"Cruz\" control..."},{"comment_id":"10154001365909497","commenter_b":"There are plenty of nice average looking women that \"nice\" average looking guys ignore because they chase hot chicks. It works both ways.","commenter_a":"Local man who would be good provider for area woman`s kid friendzoned while area woman dates unemployed band members. Area woman complains about lack of good men.","post_message":"\"If they find a cure for Zika tomorrow, it not like I can afford to get pregnant under my current insurance plan.\""},{"comment_id":"1068067499964996","commenter_b":"That's why it's called a Meltdown. Theoretically it is not supposed to stop until it reaches the center of the Earth. This may be a bit far fetched, though. Alien blood ain't got nothin' on a meltdown.","commenter_a":"Lennie","post_message":"Operators of the Fukushima nuclear power plant have identified a gaping hole in a reactor containment vessel, which has resulted in a drastic spike in radiation levels."},{"comment_id":"834927826574487","commenter_b":"She's a waste of air & space.","commenter_a":"Someone said \"Free stuff\"?","post_message":"You know Queen of the 'Aisle Hogs' Sheila Jackson Lee @JacksonLeeTX18 will be there 10 hours early for her SOTU seat"},{"comment_id":"1662312500687681","commenter_b":"She can leave now!","commenter_a":"Thats the best news I've heard all day. !","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"1401866033180478","commenter_b":"Well said!","commenter_a":"Only took mass shootings for something to be done! Stop illegal aliens from getting jobs here, no papers=no jobs or sending our money to help other countries when we have plenty of homelessness & poverty here in our own country. Fix this country first b4 you try to fix others.. Children here need help just like across the world, we have Veteran's dieing & sleeping on streets, starving people & animals everywhere. And the only way something is ever done is when there's some sorta tragedy. The whole state (country) is in need of change. We need to correct us b4 we try to help others.","post_message":"WATCH LIVE: Gov. Rick Scott is in Orlando giving a briefing on the Florida Department of Law Enforcement's counterterrorism efforts. Gov. Scott wants to spend $6 million to increase the number of agents dedicated to fighting terror: on.wtsp.com/2j4OSzV"}]
