[{"comment_id":"1615919975382867","commenter_b":"Jake Jutras the first eagle has landed","commenter_a":"Virgil John Ariel John Monique John","post_message":"#BREAKING: The first eaglet has HATCHED! Harriet and her mate M15 were both at the nest during our first sighting of the eaglet, which is almost fully out of his or her shell. A New Year's Eve eaglet - SO EXCITING! Video: Southwest Florida Eagle Cam STORY: @webpagelink"},{"comment_id":"431677547020539","commenter_b":"Filthy muslims ,deport or tag &bag'em .","commenter_a":"That is disgusting.","post_message":"This is disgusting — would YOU want to use a sink someone had washed their feet in?"},{"comment_id":"1775780972691266","commenter_b":"Andrea Lynnette no way in hell.","commenter_a":"To all the people harping about how \"historic\" the DNC nomination is: There is nothing empowering about this, and by saying otherwise, you are setting the next generation of American women up for failure. You're telling them that it's okay to lie, cheat, and steal, so long as it breaks the glass ceiling. You're telling them that it's okay to stand behind an unrepentant philanderer so long as it is politically expeditious. You're telling them that one does not need to take a principled stance on any issue in order to be successful; one only needs to adhere to populist notions. The only way in which last night was historic is in the sense that this marks the first time in American history that a candidate won the nomination under FBI scrutiny. This is also the first time in which an entire political party was caught actively sabotaging a candidate. ...","post_message":"Democratic Party nominates Hillary Clinton. Your reaction?"},{"comment_id":"10153434193979138","commenter_b":"Time to ban women..","commenter_a":"Women are crazy!","post_message":"DEVELOPING- A St. Paul woman has been taken into custody after her boyfriend was stabbed to death this morning"},{"comment_id":"892287504157347","commenter_b":"America is lost. We haven't won a war since 1945. When did it start? November 1950 when the American X Corps retreated from North Korea during the Battle of Chosin Reservoir. It was spun as a victory. Look who owns North Korea today. Yes! We lost. Harry S Truman was our Democrat president. We are losing peeps! You are getting your welfare checks, but for how much longer? We have aborted away our labor and armed forces. We are importing Islamic labor. (LOL!) Remember this date: 27 November 1950. It's the date the Chinese crossed the Yalu River and began our long, slow decline ...","commenter_a":"if they want to fly their flag go back to your own country, this is America their is only one flag and that is the American flag","post_message":"If the NAACP can have the Confederate flag, which is part of the heritage of THIS country, taken down in places coast to coast, should flags that belong to other nation´s cultures be allowed if they cause strife? Read More: @webpagelink"},{"comment_id":"10155759756435354","commenter_b":"Such a witch. Don't want people saying these things then start arresting and deporting the mexican criminals and all other illegals because they are criminals just by being here.","commenter_a":"How about giving guns to jihadist to fight Syrian Prez. YOU, Clinton, armed ISIS.","post_message":"WATCH Hillary's Race-Baiting Remarks Slamming Donald Trump"},{"comment_id":"865107826951175","commenter_b":"Who cares / she's useless","commenter_a":"And, Donald Trump(ish) is not racist, bigoted, arrogant, insensitive, and lacking in political comprehension ???","post_message":"Fauxcahontas."}]
