[{"comment_id":"10154228299244218","commenter_b":"FYI this was NOT over drugs!","commenter_a":"clean up cecil county get drugs out the killed will stop . can,not count all the kids pasway in 20 year I live in cecil county iam way ingfor a call my son rusty is died I love rusty but he love his drugs","post_message":"Two people were killed in a shooting Monday night in Elkton, police said. @webpagelink"},{"comment_id":"789227971267780","commenter_b":"She's no lady !!!","commenter_a":"I am a democrat, yes a liberal and I have nothing but respect for our law enforcement officers. This young lady has a bad attitude and needs to learn respect. He did his job. No one is entitled.","post_message":"Obama Support Gives Cop Serious Attitude, Immediately Get’s What She Deserves [VIDEO]. Wow, she just made the biggest mistake of her life. Do you support our men and women in blue?"},{"comment_id":"1349594718399369","commenter_b":"Megyn.....one of history's greatest whores. Ever.","commenter_a":"Only because Perry, Walker & Christie already dropped out.","post_message":"This was VERY intense."},{"comment_id":"10155273231713132","commenter_b":"She has medicine that causes it, you hateful witch!","commenter_a":"Umm not a role model for my child, sorry. Good dancing though, kid seems happy","post_message":"You go girl!"},{"comment_id":"1820431918212382","commenter_b":"Stupid whore","commenter_a":"Good !!!!","post_message":"My, my, my..."},{"comment_id":"522078421311711","commenter_b":"Mostly False???? What's that ???? A little white woman lie???? Liar is a liar is a liar period!!!","commenter_a":"Did any of them Lie to the FBI or Congress? YOU DID!!!","post_message":"Fact check: The Republican National Convention speakers are lying to America—at least 67 times so far."},{"comment_id":"10153564191549270","commenter_b":"Chupacabra, pick up DOD Files hay accurate B 52 bombing during knock out gooks ... evaporated socialists and during First Iraq company","commenter_a":"When the last time bombardier B52 knock out targets accurately .... during .Vietnam... Flight over Chinese and just scare... scare Chinese...","post_message":"\"We conduct B-52 flights in international air space in that part of the world all the time.\""}]
