[{"comment_id":"10153927537756350","commenter_b":"Glad she isn't winning the contest. Shallow personality and spoiled.","commenter_a":"He didn't need to interview her and ask for an apology, when he already did the same night the mistake happened. She's a spoiled brat looking for attention, and of course Steve Harvey is the way. What it bothers me more, is the fact that he and his family has been threatened, and the media still paying attention to her, she's greddy! #getoverit #sorelosers","post_message":"See Steve Harvey come face-to-face with Miss Colombia Ariadna Gutierrez, the contestant he accidentally crowned Miss Universe."},{"comment_id":"10154535880412235","commenter_b":"Get your story straight. Us woman shouldn't raised our hands on a man and expect not to get hit back. That's what's wrong with our society.","commenter_a":"She's doing to him the same thing that easy-to-use girl did to Kobe Bryant. She was \"admiring\" his jewelry a little too damn much.","post_message":"THIS JUST IN..."},{"comment_id":"1090226121037135","commenter_b":"Islam and muslims are biggest threat.","commenter_a":"Israel stands with France against terrorism. Do France stands with Israel against the same terrorism?","post_message":"France's year of terror"},{"comment_id":"10153730231431337","commenter_b":"Because women should only pursue careers that focus on their looks, right?","commenter_a":"Fxxx her kickboxing career shes georgus","post_message":"TOO BIG? This MMA fighter's \"12-pound\" breasts are ruining her fighting career..."},{"comment_id":"10153560622578984","commenter_b":"Gotta get around it some how. And drugs is my number 2 family problem, I HATE DRUGS!","commenter_a":"I do support this family, the only thing is I think all bakers and places that sell Wedding cakes need to go out of business or stop baking cakes, stick with pastries.","post_message":"The government is after this family for refusing to bake a cake for a lesbian couple's wedding. The way they just responded is absolutely perfect... Do you support this family?"},{"comment_id":"1290711880990755","commenter_b":"S'il pouvait balayer trump , ca ne serait pas un luxe !!","commenter_a":"SUS!","post_message":"I have been criticized for saying this, so let me say it again: I believe health care should be a right for all people, not a privilege."},{"comment_id":"10157894599650291","commenter_b":"Every time a Democrat gets in, we lose more of our state and lively hood. Need to cut the head off of that green snake.","commenter_a":"how are you even still in office?...","post_message":"Today President Barack Obama placed the entire Chukchi Sea and the vast majority of the Beaufort Sea off-limits to energy development. The only thing more shocking than this reckless, short-sighted, last-minute gift to the extreme environmental agenda is that President Obama had the nerve to claim he is doing Alaska a favor. President Obama has once again treated the Arctic like a snow globe, ignoring the desires of the people who live, work, and raise a family there. I cannot wait to work with the next administration to reverse this decision."}]
