[{"comment_id":"1485178544875222","commenter_b":"Of course we had an impact in the region through corruption but Saudi armed Sunni rebels in Syria to overthrow Assad which formed ISIS, the US is supporting groups against Assad so that Saudi can build a pipeline to Europe and destroy Russia's main source of income","commenter_a":"It does make sense though, when you think about it. Would you just accept thousands of people without carrying out appropriate checks (ie checking if they have criminal record, etc)? You wouldn't. Seeing what has happened in Europe in the last year or so is all the more reason for countries to tighten their borders. Also, people have been spreading this meme for ages so it's nothing new.","post_message":"So crass"},{"comment_id":"1072164979509916","commenter_b":"If sash doesn't get picked","commenter_a":"I'm so done ffs @username","post_message":"The Bachelorette Australia favourite and Sam just happen to holiday in the same place at the same time   (via Daily Mail Australia)"},{"comment_id":"1041407739283520","commenter_b":"Where's BEYONCE crying out against these BLMers?? Or is she FOR IT ALL???","commenter_a":"When will America wake up these people must go","post_message":"\"We must continue working to build trust between communities and law enforcement.\"   Watch Attorney General Loretta Lynch address the #Dallas sniper shooting that killed five police officers."},{"comment_id":"10155124264189679","commenter_b":"Lock this old hag up....","commenter_a":"No No No","post_message":"LIKE to support, comment to discuss."},{"comment_id":"10156586680480354","commenter_b":"Well @username be a man and stop hiding your face pussy","commenter_a":"Harry Truman was reigned back when it came to steel factories and labor unions. Obama needs to be reigned back with infringing on the 2nd Amendment!!!","post_message":"Today Obama destroys the 2nd Amendment.   And it's FAR worse than Americans feared..."},{"comment_id":"1007821319338322","commenter_b":"She's a piece of work.","commenter_a":"She is nothing but a conceded witch, only standing by her unfaithful husband because he was the POTUS, and therefore a untrustworthy, spiteful person who only cares about herself. I see a demon in her when she laughs!!!","post_message":"The book claims she repeatedly screamed obscenities at her husband, Secret Service personnel and White House staffers — all of whom lived in terror of her next tirade."},{"comment_id":"10153148690502014","commenter_b":"I remote control my grandson to clean my auto engine. He's for hire. Lol. .","commenter_a":"Good morning from Flagstaff!","post_message":"It's Sunday Shoutout time! Post your pics here!! Jaime Cerreta"}]
