[{"comment_id":"1681195205453281","commenter_b":"Barbara just needs to go away!","commenter_a":"Her opinion doesn't matter!","post_message":"Barbra Streisand blasted “narcissist” Donald Trump in a 1,228-word Huffington Post op-ed."},{"comment_id":"1344000762286340","commenter_b":"I wonder how much Hillary paid all of these women","commenter_a":"My breast feeding children touched me inappropriately. Good Lord, People,..... Killary's Husband raped people. No comparison. Doh!","post_message":"New allegations against Donald Trump."},{"comment_id":"10154876019385329","commenter_b":"Better fat than a dumb Mexican. Have fun once trump is elected. Fool. Lol","commenter_a":"'Fat' the word you are looking for is 'Fat'","post_message":"Simone Mariposa told BuzzFeed News she created #WeWearWhatWeWant to 'highlight plus-size girls making unconventional fashion choices, and looking amazing'."},{"comment_id":"10153415746649024","commenter_b":"She is not eligible to run..","commenter_a":"The sad truth is that DUMB PEOPLE WILL STILL VOTE FOR HER! !!!! IT SHOULD BE ILLEGAL TO RUN FOR OFFICE IF THERE IS SO MUCH CORRUPTION IN YOUR HISTORY !!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"612030692317870","commenter_b":"HAHA Austria also has an entire budget that is smaller than America's military budget is alone. I'll keep my 19% tax rate thank you. You all had your damn kids, pay for their college yourself. I'm not paying it just so they can go out and buy a new BMW when they graduate.","commenter_a":"Those poor bastards...they will be stuck in an Obama like environment.","post_message":"Austria's election gives hope that the far-right wave sweeping the West can be stopped."},{"comment_id":"10152856815999753","commenter_b":"Lol. A lot of people. A perk of being a sociopath is the ability to manipulate people like butter. She's mentally unstable. The worst they do is put her in a padded room until they believe her meds and treatment are good enough to let her back out in society.","commenter_a":"Smfh.. Good! Let's see who she can manipulate like that behind bars!!! R.I.P.","post_message":"Michelle Carter said all the right things when her friend Conrad committed suicide. She even organized a fundraiser in the teen's name. Then police discovered the texts she had sent him."},{"comment_id":"10153541850619712","commenter_b":"It's Bush's fault, and you're a Racist. Let's audit the EBT accounts of people to ensure that they are not out selling 2 for 1 groceries, to get their Malt Liquor and Newport's. There is no Free Ride, you Generational Welfare Leeches. Some people shouldn't Breed!","commenter_a":"that what they do","post_message":"Despite calls for his ouster after making controversial comments about lead poisoning, Gov. Larry Hogan's housing secretary will keep his job."}]
