[{"comment_id":"1231833570240008","commenter_b":"We voted for Obama twice now we are racist. A lot of african's and Hispanics voted for Trump. If Hillary would have been a better candidate and visited the states Trump won she would be president.","commenter_a":"And you're saying that the BLM, BLACK PANTHERS are any different. This shows how blind that you are","post_message":"\"These white Americans tuck their heads under cone-shaped hats and American flags ... training their guns on the unarmed, the innocent, the scared ...\""},{"comment_id":"1185646658122029","commenter_b":"Yeah, thanks fer nuthin'. Don't need some guy's forgiveness for anything. Not lookin' for it, ain't askin' for it.","commenter_a":"No one but God can forgive sins. The Pope and priests are men.","post_message":"BREAKING NEWS: Pope Francis will allow Roman Catholic priests to absolve women who have had abortions if they seek forgiveness, the Vatican announced Tuesday."},{"comment_id":"10153674136304641","commenter_b":"true... we just cant equate these refugees with terrorists.","commenter_a":"Its not about religion you fool! It's about your country's safety! Get that through your head!","post_message":"U.S. President Barack Obama's harshest remarks were for Texas Sen. Ted Cruz."},{"comment_id":"479766112213969","commenter_b":"Oh that is too funny she claims her life is harder than soldier that bitch don't have a clue","commenter_a":"and they have no vaction poor baby michelle","post_message":"Michelle Obama just made an outrageous claim... Our soldiers fight and die for our country, Michelle takes lavish vacations. Do you respect our veterans over Michelle?"},{"comment_id":"10153243002653984","commenter_b":"Liberal women who are blind & have cement between their ears!","commenter_a":"Why is anyone even considering Hillary for the next president??? Ar","post_message":"Hmmm I wonder why they wanted to keep this a secret... Do you hope Hillary gets defeated in 2016?"},{"comment_id":"1221931671171728","commenter_b":"Whst dumb lady","commenter_a":"No that really is your heart. If she can feel remorse for people shot by cops but not cops shot by people she's just a horrible person. Own it and don't try to dance around it by saying you feel guilty when you don't, I'd respect that more.","post_message":"“I am dealing with a bit of guilt because I don’t feel sad for the officers that lost their lives and I know that’s not really my heart,” James said in the video."},{"comment_id":"1308235872529496","commenter_b":"Such a HORRIBLE breed!! !!","commenter_a":"I hate pit bulls ... If judge Judy doesn't like em.... It's good enough for me .... Example here!!","post_message":"Noah suffered injuries to his head and face and underwent emergency plastic surgery."}]
