[{"comment_id":"1360351430654310","commenter_b":"Thank you for your vote of confidence but as of right now my focus is on college classes and getting my degree ASAP .","commenter_a":"Oh god I hate her . She is such a hypocrite. She calls us snowflakes for complaining but her job is literally to sit behind a desk and complain about things she doesn't like . She is the biggest snowflake of them all ( next to lord twitterfingers of course ) . For someone who's a millennial and who \" doesn't like labels \" she sure does like to label everyone else . She's not even a real journalist, she is a glorified YouTube personality .","post_message":"She came after Meryl Streep  and that was the last straw."},{"comment_id":"10154357156724062","commenter_b":"Short girls struggle too the regular is always too long😔","commenter_a":"Does she wear jeans & where does she purchase them? I'm nowhere near her height but have a helluva time finding them long enough. lol","post_message":"Who is the model with the longest legs in the world? Turns out a Houston girl can now claim that title..."},{"comment_id":"10153115741995950","commenter_b":"That is BULLSHIT there terrorist right now in AZ 1out of 4 children are starving obama cant feed and house. Ours so what the hell he is gonna feed and house them. You hate the US you love terrorist get the hell out of here","commenter_a":"Good!","post_message":"NEW: The U.S. is preparing to accept at least 10,000 Syrian refugees in the next fiscal year, which begins in October."},{"comment_id":"1755937964626463","commenter_b":"Then. Fuck u bitch","commenter_a":"He also said white people are the Devil, that Jews and whites are evil and he proposed racial segregation in his speeches to the Ku Klux Klan. Be like him? No thatnks","post_message":"He was truly the greatest, and not just because of his accomplishments inside the ring.  The Free Thought Project  #RIP #MuhammadAli"},{"comment_id":"10153858416863271","commenter_b":"Sick woman. I mean the one who posted this comment.","commenter_a":"I've been looking at her Facebook pages(she has two), I'm not justifying her actions and believe it's absolutely disgusting but I'm pretty pretty sure she's special needs. I'm not saying she shouldn't be punished or condoning her behavior but I honestly don't think she knew any better. I'll be willing to go out on a limb and say she was sexually abused. She probably did to him what had been done to her or what was told to do. I can't even imagine what's going on behind those walls.","post_message":"Jessica McCain told investigators that she recorded the sex act on a borrowed cell phone, according to court documents."},{"comment_id":"704906709652228","commenter_b":"What a joke this lady is. I bet she is protected by Guns every single day... But she doesn't want Americans to be able to protect themselves. Just ridiculous","commenter_a":"Yah, just fill out form ID-10T and they'll ship a gun right to your doorstep Mrs. Douchebag. This is exactly why the establishment left cannot have nice things.","post_message":"“You shouldn’t be able to exploit loopholes and evade criminal background checks by buying online or at a gun show…We have to make it harder for people who should not have those weapons of war.”  – Hillary Clinton reacts to the #OrlandoShooting @webpagelink"},{"comment_id":"10154333518999641","commenter_b":"It's about time america should have their own female leader, if they truly wanted a real change, that lady touch would make a real difference for a great nation to reach further.","commenter_a":"VOTE FOR HiLLARY CLINTON 2016 . Hillary for America","post_message":"\"We just put the biggest crack in that glass ceiling yet.” - Hillary Clinton appears via satellite at DNC in hat-tip to history @webpagelink"}]
