[{"comment_id":"543491929108734","commenter_b":"Good, send her to prison then send her to Isis!","commenter_a":"She should be jailed for life.","post_message":"For weeks, this Muslim woman sat behind her computer spreading hate and threatening the 'infidels'. She thought she was going to get away with it, then she heard a knock at the door."},{"comment_id":"970231249739794","commenter_b":"Wth are you talking about? What woman? What illegal alien?","commenter_a":"The woman killed in San Francisco by an illegal alien will never go out with her father again.","post_message":"Some quality dad time!"},{"comment_id":"10152961247876680","commenter_b":"That's you and your crowd... Dead and cut up babies sold for the meat market !","commenter_a":"I proudly stand with Planned Parenthood.","post_message":"The move dramatically increases the chances of a government shutdown fight in the fall."},{"comment_id":"10154248174893734","commenter_b":"build the wall with trump under it","commenter_a":"TRUMP 2016..","post_message":"Do you agree or disagree with Donald Trump's speech at the Rolling Thunder motorcycle rally today?"},{"comment_id":"937892139587360","commenter_b":"OF COURSE democrats WANT illegal aliens to vote. This would give them a VAST majority for all future elections. If this were to happen, the America that we know would cease to exist. ALL American citizens, regardless of party affiliation, must prevent illegals from being allowed to vote.","commenter_a":"What do expect it will help them to continue getting their freebies!!","post_message":"More than half the voters who identified themselves as Democrats in a recent Rasmussen poll said they believe illegals should be allowed to vote. Among all voters, more than one in three believes illegals should be allowed to vote. What do you think? @webpagelink"},{"comment_id":"861030830662191","commenter_b":"That's why we can't allow Muslims in","commenter_a":"Tragic.","post_message":"THE LATEST: At least 100 killed inside Paris concert hall"},{"comment_id":"953797061420139","commenter_b":"@username hahaha","commenter_a":"And this witness is just as big a piece of shit, like the article ends with. Haha you cats are seriously not right. Good luck in the big scary liberal future. It's called progress get on board or get left behind.","post_message":"HERE WE GO.............."}]
