[{"comment_id":"10153445338169170","commenter_b":"The best government is the least government!!!!","commenter_a":"Never","post_message":"Net neutrality regulations kick in today. ...So when has government regulation actually helped?"},{"comment_id":"10153013739666336","commenter_b":"Those Iranians Wouldn't Be Dumb Enough To Fire Pop Shots At Our Ships!, That WOULD Be A GRAVE MISTAKE!,","commenter_a":"Haha good luck!!","post_message":"VIDEO: Iranian state TV showed footage of Iran’s Revolutionary Guard conducting a drill that struck a mock U.S. aircraft carrier with missiles. @webpagelink"},{"comment_id":"10153076397462452","commenter_b":"Yikes!!! Kill it with fire before it rapes again.","commenter_a":"Why do child molesters look so child molestery?","post_message":"A former drama teacher at Sycamore Junior High School in Anaheim has been arrested on child molestation and child pornography charges. @webpagelink"},{"comment_id":"1580958245270761","commenter_b":"Charlie Shumate Kind of like how everyone has been brainwashed into becoming a queer, race mixer, feminine male... Man how the times have changed for the worst..","commenter_a":"Rachael Isabella too real though","post_message":"\"We need only go back to Hitler's Germany to see that it can happen to anybody. Anyone can become dissociated to the point where they are not seeing what is happening in front of their eyes.\""},{"comment_id":"944371082289036","commenter_b":"pig stupid bitch","commenter_a":"ass","post_message":"Conservatives really are the worst kind of people."},{"comment_id":"10153597569599411","commenter_b":"@Zoran...again, you get a life...we are pretty happy and fine. Not like a poor illegal immigrants as Zoran trying to stay in the west....","commenter_a":"No one should feed barbarian Russian junta fascism invaders.","post_message":""},{"comment_id":"10153858711711162","commenter_b":"Hell Indianapolis too","commenter_a":"They would get killed in da Chi anyways","post_message":"Illinois will stop accepting Syrian refugees in wake of the Paris Attacks... @webpagelink"}]
