[{"comment_id":"10153429657851323","commenter_b":"You are the ugliest woman I have ever seen","commenter_a":"My biggest headache: is being a gay a choice or disorder? Please someone help me out.","post_message":"\"Marriage equality is just one front for LGBT rights: full LGBT equality, which includes economic justice, gender identity, immigration rights and racial liberation, is far from assured. [...] But today, one chapter in our fight is closed. Love has triumphed.\""},{"comment_id":"10154346191079411","commenter_b":"I don't even think about you or feel absolutely anything for any of the followers of such cult... But i can tell you something: The members of the Western Civilization are entitled to protect Our values, Our culture and Our true religions from the plague that has overshadow every region it has reached... And there is absolutely nothing all of you can do about it. And if it happens that you are an antisemite like a very big portion of the muslim population, i can tell you that your life wouldn't be the same without Google, Whatsapp, Facebook, Oracle... and so on (Those are jewish invetions). Finally how can such a small country like Israel (You live next to it) defend itself from dozens of enemies and at the same time be so strong with such a small population? The brotherhood defends us all with the power of G'd... not ...","commenter_a":"If french people want to be slaved and force to convert to that filthy and pedophiloc religion then Fuck U All... Just wait to be once again a province from another country","post_message":"'I saw Muslims celebrating in the street during the attack. I saw it with my own eyes. In real time!'"},{"comment_id":"764904010309446","commenter_b":"RBG.. ALL DAY NOW","commenter_a":"When it's American soil , it'll be be armed patriots push back Muslim insurgents ,,, the main steam news will not say so ,, but we the people will !","post_message":"Coming to America soon compliments of Barack Obama."},{"comment_id":"10152698391808717","commenter_b":"She's no Zumba instructor but she's not","commenter_a":"She's a hottie","post_message":"Claremont police say two people face charges after selling cocaine, crack cocaine and heroin in a school zone. @webpagelink"},{"comment_id":"215680145570500","commenter_b":"Who cares what she thinks?","commenter_a":"Stick to pretending to be someone else and saying someone else's words!","post_message":"Not a fan of Meryl Streep's politics? According to her, you may as well be a Nazi."},{"comment_id":"10153391824149205","commenter_b":"Was your mom a thing female voice hater .","commenter_a":"Who in their right mind, even if they don't like Trump, would even care what this thing says. My opinion is just as good as hers, or even more informed. Just because someone is a hollywood star does not make them knowledgable one way or the other.","post_message":"TYT Reporter Jordan Chariton caught up with Oscar-winning actress Susan Sarandon in Mason City, IA after a rally in which she introduced presidential candidate Senator Bernie Sanders (D-VT)."},{"comment_id":"10153380578865950","commenter_b":"Maybe you're jealous, because you're a fat bitch.","commenter_a":"Well, considering Beyonce was involved, it was bull. I refused to watch it because of her and the song she was performing. Screw her and her terrible lyrics and slutty wardrobe/dancing. You're lucky Lady Gaga was there (never thought I'd say that...) to save the performance aspect. #nomorebeyonce #shesaterriblerolemodel #picksomeoneelsenexttime","post_message":"Compared to past Super Bowl halftime shows, this year's was relatively tame: no \"left sharks\" or wardrobe malfunctions here. Who was your favorite performer?"}]
