[{"comment_id":"163756660695086","commenter_b":"She's unbelievable. I swear she better not get into office. WAKE UP AMERICA!!!","commenter_a":"I think Hillary is channeling Marie Antoinette.","post_message":"Hillary Clinton just landed her plane in Nantucket... Almost immediately after people saw her, this HUGE problem went viral..."},{"comment_id":"571127086402504","commenter_b":"Come on guys, the woman is desperate and nervous. You will see very soon who will come out on top. It's time for some real change.","commenter_a":"Look like this page is also scrambling to save Hillary. It's good to know sanders is getting to her. #feelthebern","post_message":"Bernie and his campaign are misleading voters about what Hillary said."},{"comment_id":"10154327831686509","commenter_b":"If this candidate is the best the Republican Party has to offer - why vote? Hillary will win! Trump doesn't nothing but trash! What is he going to do for this country other than blame everyone else?","commenter_a":"Sorry Tom. But I like Trump. I like strong men. Who make strong decisions. And I thing he is what we need at this time.","post_message":"For Donald J. Trump, Christmas doesn't seem to be the season of peace"},{"comment_id":"10153194467946756","commenter_b":"OH. MY. GOD.","commenter_a":"the 33 1/3 book he did is awesome","post_message":"\"Whether it's a song, or a book, or a conversation you have at dinner, the creative thing is what happens in the process—not the relic of it,\" says the man behind the band the Mountain Goats."},{"comment_id":"752230248210825","commenter_b":"@username you live in the Philippines, don't worry about our country, stay in your shithole","commenter_a":"***Trump Platform*** 1.) Donald Trump believes that America should not intervene militarily in other country problems without being compensated for doing so. If America is going to risk the lives of our soldiers and incur the expense of going to war, then the nations we help must be willing to pay for our help. Using the Iraq War as an example, he cites the huge monetary expense to American taxpayers (over $1.5 trillion, and possibly much more depending on what sources are used to determine the cost) in addition to the cost in human life. He suggests that Iraq should have been required to give us enough of their oil to pay for the expenses we incurred. He includes in those expenses the medical costs for our military and $5 million for each family that lost a loved one in the war and $2 million for each family of soldiers ...","post_message":"\"What she did is a criminal act ... if she's allowed to run, honestly, it will be a sad day for this country, because what she did was wrong.\" Donald J. Trump slammed Hillary Clinton during his #SuperTuesday speech in Palm Beach, Florida tonight."},{"comment_id":"658627524300508","commenter_b":"Just the way I want them! You have your work cut out for you with Remi your Boston Terrier.","commenter_a":"@username both your dog's made the list","post_message":"What's the laziest dog breed?"},{"comment_id":"10154065483921770","commenter_b":"Welfare mothers make better lovers","commenter_a":"So does America. America doesn't revolve around the Clintons as they think it does . America is sick of them","post_message":"Even MSNBC is sick of hearing the Clintons' excuses: \"Seriously. Nobody cares. The game’s over. They lost.\""}]
