[{"comment_id":"1144750032228005","commenter_b":"Here we have someone taking things just a lil too seriously","commenter_a":"\"Discovered\" more like created...","post_message":"Pokemon are a diverse class of creatures that were first discovered by Japanese scientists Satoshi Tajiri and Ken Sugimori in 1996."},{"comment_id":"786579818199262","commenter_b":"He SUCKS DICK..........","commenter_a":"Dangerous would be the truth.","post_message":"BREAKING: Obama Makes Sickening Announcement, This Will Cost Lives  He will ruin this country before his term is up.  Do you think Obama is reckless?"},{"comment_id":"10155023483731037","commenter_b":"Fetuses are not considered sentient until around 6 months. Nothing wrong with an abortion within that time period","commenter_a":"Well, it would help if people quit having sex like rabbits and then run out and get an abortion because having the baby would be an \"inconvenience\". It's disgusting that 55 million innocent babies have been brutally murdered in a mere 43 years.","post_message":"An uptick in deaths, a slowdown in births and a slight drop in immigration all damped American population growth."},{"comment_id":"10155176603990389","commenter_b":"Don't know of anyone who did. Won by fraud.","commenter_a":"I didn't vote for this useless President!!!","post_message":"ICYMI: Republicans cheered as President Barack Obama said “I have no more campaigns to run.” Obama, cracked a smile and responded: “I know because I won both of them.”"},{"comment_id":"10157791995705206","commenter_b":"Rhd cars are illegal in NJ","commenter_a":"I see how they survived. The driver's side is on the right not the left. If it was an American made Car. The driver would have been dead.","post_message":"How could anyone have survived this horrific car crash? @webpagelink"},{"comment_id":"1158715757578534","commenter_b":"Jail house for this chick!","commenter_a":"Sorry don't remember any championships","post_message":"It's just a matter of Hillary living the rest of her life out in prison or free.  Do you want to see Hillary go to JAIL?  @webpagelink"},{"comment_id":"10154165459449087","commenter_b":"Don't stir up the bear, pussy!","commenter_a":"Yet more pathetic infantile nonsense from the shit house otherwise known as the white house","post_message":"The White House is vowing to retaliate without warning to Russia's alleged hacking."}]
