[{"comment_id":"1310250435687007","commenter_b":"@username listen bitch you better do your research the final votes were counted today he won popular vote by 699k","commenter_a":"Wow ! Get over it ! Trump won the electoral and popular vote as of today ! If Hillary hadn't been so crooked lies and selling America out to the highest bidder she might have won, but she was caught in way to many back room deals and bad things she should be in prison for treason ! Shame on SNL. To even praise her when the people have spoken !","post_message":"Wow, SNL dropped the comedy and got real."},{"comment_id":"550590221774115","commenter_b":"Republican presidential candidate @username has admitted to lying about his application and acceptance to the U.S. Military Academy at West Point, Politico reported on Friday. The retired neurosurgeon and current GOP frontrunner has been using the story as a central point of his personal life during his campaign.","commenter_a":"But its just been confirmed that you lied about West Point. You're done in my book. Before that, I supported you.","post_message":""},{"comment_id":"10153494218169705","commenter_b":"If only we had as much passion directed towards stopping child slave hunters around the world","commenter_a":"Betty is a National Treasure and girlfriend can let loose whenever she wants","post_message":"Betty White has some harsh words for the Minnesota dentist."},{"comment_id":"10155175983529749","commenter_b":"Not fair to use term feminist for these people...might be better to go on \"feminazzi\" :) . It's kinda offensive for the real feminism movement which is still something some part of the world really need no? :)","commenter_a":"Why are they always fat? I have never received a satisfactory explanation.","post_message":"Presenters and staff frantically scrambled to cover the woman's breasts."},{"comment_id":"10153694133994330","commenter_b":"Feminists live in fantasy land","commenter_a":"She should be in a cheer outfit not a football jersey if she was to play that's fine make a all female team","post_message":"She's in 8th grade and she's no joke on the football field.  That's right, we said she!!  Watch NBC Connecticut news at 6:20 tonight as NBC Connecticut's Kevin Nathan brings you her amazing story. --> @webpagelink"},{"comment_id":"10152602775901636","commenter_b":"She could have kept going, but she also could have allowed the crazy lady to get a great distance away from her. She had a kid in the car. Why engage someone and put yourself and your child in danger? I do not blame the victim, however, she could have made the decision to pull over for 3 minutes or so to put some distance between them.","commenter_a":"Maybe that was the road she needed to take? So it's her fault for continuing to drive like she's supposed to??? Geeze","post_message":"Things take a scary turn when the woman stops her vehicle, gets out and walks up to the car."},{"comment_id":"10152872037516316","commenter_b":"YES! I don't understand some of my friends who like her. She's evil.","commenter_a":"As gratitude my wish is that she receives a free year supply of GMO foods! :)","post_message":"Hillary Clinton continues to dodge the press after being revealed as the Bride of Frankenfoods: @webpagelink"}]
