[{"comment_id":"723350911147017","commenter_b":"All this after making remarks that all Mexicans are criminals and rapists and we need to isolate ourselves from them by building a wall between the United States and Mexico at the expense of the Mexican Government. Then hiring undocumented Mexicans to work in his hotels and casinos with no unions to represent them, offering to compensate them under the minimum wage, then refusing to pay them. Now, trying to entice them into voting for him? Unbelievable!","commenter_a":"Say whatever?","post_message":"This should go over good with the GOP! ~Kay"},{"comment_id":"1131958793506245","commenter_b":"What did you expect from a trash bitch","commenter_a":"Sad, Sad, Sad. How dare you bring a child into this earth, if you do not plan to put them before yourselves. I imagine this is an ongoing problem and I truly hope that child is taken from them and placed in a loving home. If only I had the space, time, and money. I would rescue all children in a heart beat. :(","post_message":"Police want you to see these viral images of what heroin is doing to families."},{"comment_id":"10156388159930294","commenter_b":"Racist white trash!!!","commenter_a":"Negro......you was a bad hood rat","post_message":"An Akron man learned his punishment for kidnapping and beating his ex-girlfriend. When the victim tried to escape, she broke her leg. More on the story here: @webpagelink"},{"comment_id":"1658190531136070","commenter_b":"Racist unethical cheater!","commenter_a":"This garbage troll shouldn't be allowed to breathe at all!","post_message":"Geraldo Calls The Constitution Bullsh*t And Then Goes On Epic Rant Slamming Americans  Kick him off Fox. He doesn't deserve to be on the air. Do you think he should fired?"},{"comment_id":"10153422739691167","commenter_b":"Oh goodie, now pass the popcorn.","commenter_a":"Who gives a damn? Why was he looking at her? I bet he kept watching nasty irrelevant ass","post_message":"Rudy Giuliani and Fox News are livid at Beyoncé this morning."},{"comment_id":"524375314431275","commenter_b":"She is a disgusting human being.","commenter_a":"Lord what a pig.","post_message":"President Bill Clinton's accusers are publicly condemning Joy Behar for calling them 'tramps.' @webpagelink"},{"comment_id":"10157204409490206","commenter_b":"This chick is so full of crap.","commenter_a":"He makes John Lennon seem like a man and Ryan Leaf viable.\\b","post_message":"The disgraced quarterback allegedly hit his ex-girlfriend on the side of her face, rupturing her eardrum, and she's reportedly still unable to hear out of that ear."}]
