[{"comment_id":"413560098853531","commenter_b":"How can any woman murder a baby like this??? @webpagelink","commenter_a":"Well, when they intentionally murder babies and sell their body parts, what do they expect to happen? They are murderers, spiritual people do hate that. Here is a 18-week old baby, how can folks not get upset about murdering innocent babies? If you don't want to get pregnant, close your legs or be responsible. Stop using abortion as birth control; it's that simple.","post_message":"\"We've seen an alarming increase in hateful rhetoric and smear campaigns against abortion providers and patients over the last few months. That environment breeds acts of violence.\""},{"comment_id":"10155256275191002","commenter_b":"She's a cunt","commenter_a":"I was there! It was great! So exciting, so much energy, great speakers and it was wonderful to see our future President in person! :) She is marvelous!","post_message":"LIVE: Hillary Clinton is set to speak at a rally in Eastern Market Corporation."},{"comment_id":"10153110921541378","commenter_b":"Very glad the child's okay and I hope that scare woke up that woman to f****** reality","commenter_a":"How do you forget your CHILD in the car.","post_message":"DRAMATIC VIDEO: After allegedly leaving her 1-year-old alone in a hot car, a woman is confronted and a bystander incorrectly tells her that the child has died. That moment was caught on video:"},{"comment_id":"10153270797394342","commenter_b":".","commenter_a":"Climate change. The earth is warmer than it has ever been, which means bacteria, viruses, diseases, all have the perfect breeding ground to multiply in larger numbers than we have ever seen before.","post_message":"LEGIONNAIRES' DISEASE LATEST: As New York City grapples with its worst-ever outbreak of Legionnaires' disease, health experts are trying to understand why reported cases of the illness have risen across the country in recent years."},{"comment_id":"10153925535020579","commenter_b":"Oh, he is VERY Republican. Hardly just in \"name only.\"","commenter_a":"another worthless rino.","post_message":"Clip from Speaker Paul Ryan's address to Congress. Watch full speech here: @webpagelink"},{"comment_id":"10156548921815725","commenter_b":"Shameless lady you are shameless","commenter_a":"Can you only imagine this family in the white house! WOW They will bring back the class that our first family has been missing for the past 8 years.","post_message":"Thank you Ivanka Trump for the kind words. I am very proud of the role model you are for so many."},{"comment_id":"705952482887629","commenter_b":"#NeverKillary, #CriminalHillary, #Notwithher, #Trump, #MakeAmericagreatagain","commenter_a":"dont you wish people liked you like this????","post_message":"Donald Trump lied to the American people at least 58 times during the first presidential debate. (We counted.)"}]
