[{"comment_id":"10154497878598145","commenter_b":"So much White Trash in Florida!","commenter_a":"Omg @username I freaked out for a second....","post_message":"Authorities said the couple and the victim's son were having dinner, and when the child refused to eat his food, Stephen Collins became angry."},{"comment_id":"10156217952900725","commenter_b":"Illegals only make it harder for the ones who have done it legal. If I were a legal immagrant I would u of be pissed off about the illegals. It's not an easy process and considering the economy I'm wondering if it's worth it to them to try to come in legally. Especially with the liberals making all these empty promises.","commenter_a":"Like if you are voting trump 2016!!","post_message":"The debate last night proved that Hillary is running against the “B” team. She won’t be so lucky when it comes to me!"},{"comment_id":"10155610147785389","commenter_b":"Maybe we all need too draw more Cartoons/dont like it leave our Country.If we went to there Muslin Country they cut your head off are take your body parts for opening your mouth,so i think we all need too fight back too these ugly Muslin who think they are going too rule America and kill us for nothing.All they are Communist and they are brought in too our Country too destroy ,let them destroy there own.Lock these borders and stop letting them build camps too close too us.","commenter_a":"The Lamestream media are sell outs to this great Republic, and therefore deserve nothing but disdain from all true patriots.","post_message":"Question of the Day: Is the mainstream media wrong for criticizing Pamela Geller, instead of the radical Islamists?"},{"comment_id":"10154517651704166","commenter_b":"Ash, Nc","commenter_a":"Hi from","post_message":"Mother of son hit with books at school speaks out"},{"comment_id":"1084748028260016","commenter_b":"@username like they said there would never be a GREAT WALL OF CHINA. There will be a wall!!!!!","commenter_a":"Oh my god, people keep talking about Trump's \"wall\" as if it's an actual thing. It's not a thing. It will never be a thing. It's just a distraction so people don't ask him about real issues that he has no answers for!","post_message":"\"At the start of my conversation with Donald Trump I made it clear that Mexico will not pay for the wall,\" Mexican President Enrique Peña Nieto tweeted in Spanish from his official account."},{"comment_id":"1061817873839223","commenter_b":"Insofar as the Hadron Collider is european, how would that help the US government?","commenter_a":"I hope 1.3 trillion dollars, since the U.S government can't seem to find it.","post_message":"What could we find?"},{"comment_id":"10154879829717178","commenter_b":"They are not moving anywhere. Btw transgender is not a protected class.","commenter_a":"BOA is in talks to move it's headquarters out of Charlotte because of the discrimination law. Way to go State Politicians.","post_message":"House Bill 2 has just about everything an editorial cartoonist could want: a well-known story, controversy, key players to lampoon, and toilets. Story >> wral.com/@username"}]
