[{"comment_id":"1136461496426173","commenter_b":"She should be tried for treason","commenter_a":"Smart & Tough!","post_message":"Crooked Hillary Clinton wants to flood our country with Syrian immigrants that we know little or nothing about. The danger is massive. NO!"},{"comment_id":"487493421441238","commenter_b":"Get these terrorists out of our country.","commenter_a":"This being wrong is minor compared to the knowledge that someone, supposedly an AMERICAN allowed the demand of a group of visitors in our country to undermine one of the pillars of freedom that this country was founded upon. If our observances offend them , then we should at very minimum expect and get quid pro quo, their presence insults us, so leave, and don't come back.","post_message":"Muslims force this school to ban Christian holidays. America is under attack, we need to spread this. Do you agree this is wrong?"},{"comment_id":"10153427070736749","commenter_b":"BAN ALL THE POLITICIANS AND YOU WON'T HAVE ALL THESE STUPID IDIOTIC LAW'S WE HAVE TODAY WHERE THEY ARE TRYING TI TAKE ALL OUR GUN RIGHTS AWAY! OUR FOUNDING FATHERS OF THIS GREAT NATION ARE PROBABLY TURNING OVER IN THEIR GRAVES RIGHT NOW THINKING WHAT, WHERE AND WHEN THE NEXT CIVIL WAR WILL BE HERE IN THE U.S.A. WE NEED TO CLEAN HOUSE OF ALL THESE ELECTED OFFICIALS AND ELECT NEW BLOOD INTO THE OFFICE! CASE AND POINT MADE.","commenter_a":"Time to get EVERYONE trained properly on gun safety! Time to re-address the mental illness issues...","post_message":"Gun violence shouldn't be so commonplace. It's time for Congress to do something about it. @webpagelink"},{"comment_id":"10154962501399609","commenter_b":"And I love Mexican women too.","commenter_a":"This will bring in more money for our economy and more jobs to the US and lessen our trade deficit with Mexico. The demand for US products will go up and continue to stimulate our economy. Finally, we have a president making decisions that loves Americans and his country.","post_message":"JUST IN: President Trump wants to pay for the border wall by imposing a 20 percent tax on imports from Mexico. @webpagelink"},{"comment_id":"1119467821481588","commenter_b":"Yay!!!","commenter_a":"Exactly his point!","post_message":"San Francisco 49ers quarterback Colin Kaepernick says he has received death threats for making his views known"},{"comment_id":"10153397675031323","commenter_b":"sure!our women too commit crimes like women in any part of the world and when caught,they go to prison","commenter_a":"Disgusting! I live in Iraq and our prisons are never like that! huh! and they teach us democracy!","post_message":"\"Even though keeping inmates clean would seem to be in the prison’s self-interest, prisons control their wards by keeping sanitation just out of reach. Stains on clothes seep into self-esteem and serve as an indelible reminder of one’s powerlessness in prison\""},{"comment_id":"10154325210061336","commenter_b":"Let's just deport him. I'm sure that he has learned his lesson and he will never come back. (Sarcasm) Seriously, just shoot him. He's a criminal non citizen, here illegally. He shouldn't be entitled to any of the protections that our constitution affords us and neither should any other illegal immigrants that further engage in criminal activity.","commenter_a":"It may happen more then you can imagine!!","post_message":"Rene Ortiz Quintana, 69, took the identity of Ruben J. Gallardo – who has been dead since 1994 – to get Social Security, VA and other Federal, state and local benefits since 2012."}]
