[{"comment_id":"10153829550465575","commenter_b":"Go home Cruz we want trump !","commenter_a":"Trump is a strong supporter of the Second Amendment! This post is another poor attempt to win votes for Cruz. If Killery or Bernie win the Second Amendment is in trouble as will be the first. I am sure the Feds are wanting to shut the internet down so we can't inform each other on what they are up too. Lets face it! The internet has shown America how corrupt our Government has become. Without it we would never have known.","post_message":"These are the lies that TRUMP is referring to. . . ."},{"comment_id":"10153046934697894","commenter_b":"#SaveYourself #hatinAssHoes","commenter_a":"Because she can't find a job doing anything else #shade","post_message":"Dawn Richard Announces She’s a New Spokeswoman for PETA (People for the Ethical Treatment of Animals) [Photo]"},{"comment_id":"1417299944952004","commenter_b":"They are illegal immigrants. Reagan granted amnesty in the 80's and it was to be a one time thing for those already here. Settled once and for all. But they keep coming. And this problem is not just from Hispanics although they make up the majority of inflow. If they couldn't come legally then they shouldn't be here. People have been coming legally for 100 years (like my father and his parents). No excuses. They are breaking the law and need to be deported.","commenter_a":"All he has is big ego","post_message":"Dude! Really??!"},{"comment_id":"10154506752502619","commenter_b":"Call Sarah please let me leave you with this I am Hebrew my tribe is Nazarene but I am not Jewish a lot of people and I know that you're not one of them get that mixed up quite a bit for it is possible to be Hebrew and not to be Jewish","commenter_a":"There were no unions until the 19th century when a bunch of Jewish garment workers in NYC publicly protested and marched through the streets for safe,decent places to work and a living wage. How dare this bunch of ignorant,uneducated pigs discuss human rights. They couldn't find Israel on a map if their lives depended on it. Their hatred is based on jealousy of the achievements of Israel and the will to survive in a world where hatred of Jews is very fashionable.","post_message":"Citing the Jewish state's \"long history of violating the human rights of the Palestinians,\" the United Electrical, Radio and Machine Workers of America have reportedly become the first nationwide union to join the boycott against Israel."},{"comment_id":"911888578926545","commenter_b":"@username SO WHAT ITS LEADING TO THAT WE NEED TO TAKE OUR COUNTRY BACK AND PUT THEM IN PLACE THEY CAN T GET OUT OF OR PUT THEM IN MEXICO","commenter_a":"Civil Disobedience is totally fine and I salute those who stand by their beliefs. Perpetrating violence, burning, looting, damaging property etc. is not and those folks should be arrested and prosecuted.","post_message":"***The Radical Hard Left is plotting a Soros-funded plot to spark upheaval across America***"},{"comment_id":"1233538923335820","commenter_b":"Well she can shove it in my face.","commenter_a":"Climb back into your closet. We are sick of all of you being shoved in our faces.😈😈😈😈","post_message":"\"I knew going in that I had the opportunity to make history ...\""},{"comment_id":"10153795049694199","commenter_b":"I thought he was dead....ooopps","commenter_a":"April fools","post_message":""}]
