[{"comment_id":"10153413521069255","commenter_b":"Loose lips sink ships.","commenter_a":"Santorum doesn't even know that the Pope is in fact a scientist! He is a chemist! Santorum is the idiot!","post_message":"Yes. That Rick Santorum said that."},{"comment_id":"10153021829314712","commenter_b":"If you thought my tone was rude then you should not have replied to me with a lecturing tone. Because clearly you thought that was productive.","commenter_a":"Lauren it isn't dumb and you are rude... I am married 17 years to a bus riding bike riding no driving city worker here in Baltimore and he has made the same observations..riders... walkers..and especially drivers need to do a better job observing traffic laws...but your tone and answer is counter productive..have a safe day and as the Irish say.... Safe home","post_message":"Commentary: Car-centric systems cost lives, and diminish quality of life."},{"comment_id":"1228736923813002","commenter_b":"poor womaan! jail is patently the wrong place for her....she requires help, not punishment!!!","commenter_a":"Monster.","post_message":"A 26-year-old woman on Monday expressed her indescribable pain and regret for the death of her newborn son whom she stuffed into a plastic bag after giving birth to him at her suburban Detroit workplace."},{"comment_id":"1569194983095765","commenter_b":"Immigrants need to assimilate","commenter_a":"I feel sorry for this woman, she is so ignorant. The capability of her brain being able to handle one language and one culture is probably the siza if a pea.","post_message":"A woman captured on video yelling racial slurs at a Spanish-speaking woman as they waited in line at a JCPenney store will be \"permanently banned\" from the mall where the incident took place once she is identified, Jefferson Mall officials say."},{"comment_id":"10153465175281162","commenter_b":"Unbelievable the number of ignorant do gooders on here. If you never handled pigs how can you say what is the best way to do it? if ya pick up a pig like a puppy it will struggle and squeal and put up a fight. but if ya hold it by a hind led it will settle down and let you handle it. The trucks they are on have multiple floors so yes you can get a lot of pigs on there, if they were less densely packed there would have been more mortality. and yes air can circulate. All you planet saver that think vegans are going to save the world, How much fossil fuel, fertilizer, herbicides, pesticides, and other pollutants, are produced in the growing and harvesting of what you eat.","commenter_a":"Jamie Hall","post_message":"A semitrailer carrying 2,200 piglets overturned on a highway. Watch as emergency crews rushed to wrangle the pigs -- > @webpagelink"},{"comment_id":"10153828127059749","commenter_b":"\"...coming to a fridge near you.\" No! No it's not! I don't associate with those they of people!","commenter_a":"George had this idea decades ago in form of Pudding skin singles :D","post_message":"We have reached new culinary lows."},{"comment_id":"10153203883521717","commenter_b":"I was raped by two women when I was 5 years old","commenter_a":"InB4 feminists saying men can't be raped.","post_message":"Human trafficker who forced men to have sex for 20 hours every day gets 11 years in prison"}]
