[{"comment_id":"1083906904965768","commenter_b":"Girl, it was a woman who slapped the horse (read the article, John :) )","commenter_a":"Guy must have thought he was Alex Karras or something. Now draw and quarter the worthless skid-mark.","post_message":"BUSTED"},{"comment_id":"10153395749836336","commenter_b":"Well what if I said I'm tired of boarder jumpers and we need a 50' tall concrete wall put up to keep them out cuz I'm tired of dealing with them. But I do love Mexicans. I mean all of it. I love the ppl just don't care as much for those who try to come to the states illegally.","commenter_a":"I'm totally on Trump's side here. The U.S. does need to end its TPA with ALL FOREIGN COUNTRIES! Regardless of how the ppl feel. Mexico is taking this offensively because they know that Trump will keep his word, he will stop doing business with them, he will put up a wall to stop immigration and Mexico doesn't want to deal with losing our money and then having to take care of all of their people who have illegally made a life in the states and are sent back to their homeland. I think the U.S. should do as Canada does and anyone who wants to become a citizen should have a sponsor.","post_message":"“I’m going to have to sue Univision now.” Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10153480820949726","commenter_b":"Skank whore.","commenter_a":"That song is getting a little old hillary...just like you","post_message":"WATCH: Hillary Clinton targets Wall Street!"},{"comment_id":"2130174917081223","commenter_b":"He is better off with out the old hag!","commenter_a":"Hell of a man","post_message":""},{"comment_id":"1007314029311396","commenter_b":"You stay where ur at and fight ur own dirtiness.... we dont owe u nothing!","commenter_a":"\"We have to reject any politics that targets people because of race or religion\" For brighter future, Americans can't afford Trump to walk into the Oval Office!","post_message":""},{"comment_id":"1529182653808525","commenter_b":"yep, paid lazy fucks, how about we let the illegals stay and ship thse shitbags back","commenter_a":"Liberals out to break this country and doing a very good job at it communist or stand together","post_message":"Are you KIDDING!?"},{"comment_id":"1152899144750942","commenter_b":"She should be more scared of her elder rapists.","commenter_a":"I have this theory that if he wins, at his coronation hes gonna start his speech by saying he doesnt want to be president he just wanted to prove how racist and bigoted people in this country are by going out saying ignorant shit on all levels and poor rednecks eat it up. I mean seriously if people really think trump would be good for America those are the people that are wrong for America. You can spend all day polishing a turd but at the end of day hes still a piece of shit. All the anti muslim shit he spews with all his rich muslim buddies. He has hotels and other businesses in multiple muslim countries are we supposed to ignore that or what.","post_message":"They let her know, in no uncertain terms, that they have her back. - Eric March"}]
