[{"comment_id":"10153162975649205","commenter_b":"Assholes","commenter_a":"JAYWALKING noting wong","post_message":"Cops Beat Black Teen For \"Resisting\" His Jaywalking Ticket"},{"comment_id":"474511766072737","commenter_b":"Can't do that until you remove the Muslim president who encourages them to take over.","commenter_a":"we need to take our Country back. We outnumber them let stop the insanity. Dont let any mosks be built in this country. We cant build Churches in theirs. If they dont like it here than leave. No one would care.","post_message":"Muslims force this school to ban Christian holidays.  America is under attack, this is treasonous.  'LIKE' if banning Easter is WRONG!"},{"comment_id":"1260234220691789","commenter_b":"We don't care anymore you protested us to death.","commenter_a":"UI hope these idiots Freeze out there in MN","post_message":"LIVE NOW: Protest against Trump's immigration order happening in Minneapolis, Minnesota. STORY: @webpagelink"},{"comment_id":"896237380506542","commenter_b":"Guess what all you fools there are just as many women that talk a hell of a lot worst then Trump dreamed of all you holier-than-thou women out there quit acting like Polly pure bread get a grip. What's worse is that all that comes out of Killarrys mouth is diarrhea 💩💩💩😈😈😈😈","commenter_a":"If Hillary & Supporters are so butthurt over something Trump said 11 yrs ago, then why would Clinton accept endorsements from \"Rappers\" who had said FAR Worse things about Women then Donald said in Private 11 yrs ago? Some of the Vile things said by these Musicians is so demeaning to Women but yet Clinton doesn't reject their Support?? Nor does Her Supporters?? Calling the Kettle black!!! Copied","post_message":"“It’s the kind of locker room and frat house talk that personally infuriates me. But guess what? I still, without a doubt, support [Donald J. Trump].\"  Watch Judge Jeanine Pirro's full opening statement."},{"comment_id":"10153160382606491","commenter_b":"Lauren Kirby","commenter_a":"1577961212219543s","post_message":"\"Amy and I were creatively made for each other,\" Jennifer Lawrence said."},{"comment_id":"10154413621893279","commenter_b":"Bet she took the money anyway. How pathetic","commenter_a":"Progressives are all right in the moment Conservatives alway have the best long range strategies for gaining and holding power","post_message":"Hillary Clinton faced protests Monday by Palestinian rights activists outside a fundraising event at the Beverly Hills estate of billionaire Haim Saban."},{"comment_id":"903185543037635","commenter_b":"Noooo... lol. You gals need to stop. Many African men have monster sized d****. That mess ain't fun.","commenter_a":"She's ungrateful","post_message":"Apparently, she didn't see it until after the wedding..."}]
