[{"comment_id":"10153512925208854","commenter_b":"They can take the next boat, plane, or train out of my country!!","commenter_a":"All those who sign this petition should be banned from the USA forever","post_message":"U.S. Citizens Sign Petition to Ban American Flag"},{"comment_id":"10153598049151336","commenter_b":"Kill her","commenter_a":"Molly, America loves you.","post_message":"Former Baltimore Ravens cheerleader Molly Shattuck was sentenced to two years of probation after pleading guilty to raping a 15-year-old boy at a vacation rental home in Delaware."},{"comment_id":"10154284247599575","commenter_b":"Throw her in with the hardened inmates. Id love to see how 'pretty ' shed look then","commenter_a":"Oh god not another one...","post_message":"This bad girl is getting lots of social media love for her attractive mugshot.  Just keep in mind she's charged with aggravated robbery, kidnapping, first degree battery, hindering prosecution, and tampering with physical evidence."},{"comment_id":"1648860662067713","commenter_b":"Why doesn't that useless cunt step in front a speeding train??","commenter_a":"Rosie O'Donnell is against guns, but it's ok for her body guard to carry one to protect her!!! Crazy!!","post_message":"YES!  This is why we love you Tom Selleck."},{"comment_id":"10155020907765329","commenter_b":"I mean fuck the patriarchy, but like FUCK the patriarchy... amiright?","commenter_a":"'@username #17 please","post_message":"So your dirty mind can go back to school."},{"comment_id":"1137481012959422","commenter_b":"Get the hell out, asswipes!","commenter_a":"I wish Scottland would welcome me in. I've had it with the states.","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."},{"comment_id":"1901824630047376","commenter_b":"Meant to be","commenter_a":"Catherine her name... :)","post_message":"She’s a Republican college student and she’s proof that marching is about more than politics. #WomensMarch"}]
