[{"comment_id":"891291447630577","commenter_b":"Turn the channel from Fox and get educated","commenter_a":"How anyone can back him after everything going on is beyond ignorant!!!! There r reasons he's the worst president ever!!!","post_message":"This one is HILARIOUS.   Thanks to Being Liberal."},{"comment_id":"10153270009391770","commenter_b":"This woman is nuts!","commenter_a":"The is one key word in all this ....... ILLEGAL. not legal It's very simple if your here illegally you get sent home. There are proper ways to become a citizen. Many many people have done it. If two illegals have a baby that baby is not now a citizen. If 2 people break in you house and have a baby. Is that baby now part of your family well. No","post_message":"MSNBC host Melissa Harris-Perry on Saturday likened the Obama administration’s deportation of illegal immigrants to “a fugitive slave law” during a discussion about Flint, Michigan’s illegal immigrant community being reluctant to accept clean water aid out of fear of being deported.  Read more: @webpagelink"},{"comment_id":"948553515267521","commenter_b":"Hillary is a big fat liar and she will never be president.","commenter_a":"Lol","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"},{"comment_id":"1814189528815874","commenter_b":"Hillary is use to debates Trumps not and can't even deal with a woman with a baby during his speech","commenter_a":"Wait until the debates, when Hildebeast turns into a shrieking harpy on stage when confronted about her many, many schemes, scams & failures. Take a poll then.","post_message":"A new Fox News poll shows Democratic nominee Hillary Clinton leading Republican nominee Donald J. Trump 49 percent to 39 percent among likely voters, while 61 percent of respondents say they consider Clinton to be dishonest."},{"comment_id":"10153864065907042","commenter_b":"Really 😂😩 home boy was like f that","commenter_a":"Angelo Djresearch Ravioli smh","post_message":"QUEENS 'GRINCH' STEALS CHRISTMAS: A postal worker in Ozone Park, Queens threw away 1,000 pieces of mail -- all because he was \"overwhelmed by the holiday season.\""},{"comment_id":"10153916837714255","commenter_b":"Tennessee ... leading us backwards towards the future.","commenter_a":"4th Amedment.","post_message":"While they worry about their precious guns..."},{"comment_id":"1598639267107557","commenter_b":"#2ChroniclesChapter7V14 #DrainTheSwamp #OneNationUnderGod #InGodWeTrust #TrumpPence2016 #UCMJ4President #UCMJ4Congress #UMCJ4Senate #USConstitution #BillOfRightsNonNegotiable #Paperballotsonly w/ID #NoAmnesty #AmericaFirst #PledgeOfAllegiance #NationalAnthem #ProNRA #ProLife #Pro2A #NoUN #MAGA #Election2016","commenter_a":"Why are tax dollars being spent on our so called president campaigning for her. ..should be illegal","post_message":"Donald J. Trump finally did it. After taking a lot of punches from the first lady, he unloaded on Michelle Obama, dropping an epic truth bomb on the president's wife.  What do you think about what Trump said?"}]
