[{"comment_id":"10153808795866336","commenter_b":"@username Typical Illegal Alien.","commenter_a":"Frankly it feels lousy to be called a murderer when all I'm trying to do is keep you safe. Im not a murder. That is slanderous. That is not how I act","post_message":"Quentin Tarantino has finally responded to the firestorm that’s been brewing since he criticized police officers at a rally last weekend, and he says he won't be \"intimidated.”"},{"comment_id":"929346133862318","commenter_b":"If a bank (any bank or business) is going broke, such as Lehman Bros., how is it up to We the Tax payers to bail it out? A business either prospers of fails on its own merits, period! None should be \"too big to fail\"! Throwing trillions of dollars at a sinking ship is madness, it just prolongs the inevitable and hurts those that are being forced to pay for using their stolen tax paid monies, and harming the entirety of the economy, we are here to bail out the billionaires and globalist elites delusional scam they are perpetrating on man kind!","commenter_a":"What an asshole and she probably makes a 6 figure salary, time to clean house","post_message":"Not sure about you, but this REALLY pisses me off!   H/t: Emancipated Human Subscribe: @webpagelink  Join Us: The Free Thought Project"},{"comment_id":"1029959687044503","commenter_b":"But we DONT need Hillary Clinton.","commenter_a":"If republicans don't come around on immigration they are through.","post_message":"Hillary Clinton's aggressive and boldly progressive stance on immigration just wiped the floor with Republicans and their obstruction and xenophobia. This is..."},{"comment_id":"10153523768927293","commenter_b":"Thank you!","commenter_a":"What do you mean by white? there are white latinos i.e. latinos of European origin, so it isnt about race? pigment and having a tan or lack of deosnt define a race....cleopatra, moses, werent caucasion? what were they then? most experts say caucasion includes indians and that middle eastern are essentially white - although some can be mixed race .. so what exaclty do you mean and why do you care so much? We could find examples of many blacks playing white characters - very common in shakespeare...so keep your racial obsession and race baiting to yourselves please WP!!!","post_message":"From “West Side Story” to “The Birth of a Nation,” watch 13 times that a white actor portrayed a non-white character on the big screen."},{"comment_id":"10153370720431509","commenter_b":"Well the real word is cold and full of corruption and greed. This type of harvesting happens on a daily basis in 3rd world countries, poor desperate individuals selling their kidneys in back allies to rich benefactors. Most illegal organs are stolen form human trafficking.","commenter_a":"Organ harvesting and transport is complicated. You can't just slash a body and grab them out. This sounds like a ploy by the Iraqi govt to get headlines","post_message":"It's a startling claim. If true, what could be driving increasingly extreme tactics #ISIS is employing? @webpagelink"},{"comment_id":"421180878069520","commenter_b":"^^ this idiot supports sanctuary cities and providing safe harbor to illegal alien criminals","commenter_a":"Hillary belongs in prison.","post_message":"More than $400 million has poured into the presidential race so far."},{"comment_id":"795518530581327","commenter_b":"There is definitely something wrong with this lady...","commenter_a":"Bully like Hily Holbrook from \"The Help\" except for the racism.","post_message":"I can't stop laughing.....at HER."}]
