[{"comment_id":"10153395170866162","commenter_b":"Alien had azz. Kmsl. Female leaves there kids with anyone for bad love..","commenter_a":"Shaun Sullivan look at this guys head. wtf","post_message":"DISTURBING: A 19-year-old man is charged with the murder of 2-year-old girl whom he was babysitting @webpagelink For the stories you care about -\" like\" ABC 7 Chicago!"},{"comment_id":"10153203713812894","commenter_b":"She's a damn lie! Ain't nobody stupid! That's what's wrong with her lying ass all them babies and surgeries!","commenter_a":"What did she do to her face? She looks weird","post_message":"Kim Zolciak Reveals Doctors Discovered a Hole in Her Heart While She Was Hospitalized After Her Stroke"},{"comment_id":"10154754635023352","commenter_b":"Bridgette,u r s/o but ur lettin dem bitches knw wat it is.","commenter_a":"Her vagina is probably getting dry and can't keep up with him anymore..jk","post_message":"It’s over! Jennifer Lopez, 47, splits from toyboy Casper Smart, 29, after five years together"},{"comment_id":"1170752382944790","commenter_b":"You can choose at any time not to have sex. Women don't have that luxury when it comes to their menstrual cycle.","commenter_a":"So? We pay sales tax on condoms?","post_message":"Forty U.S. states apply sales tax to menstrual products. via GlobalPost"},{"comment_id":"10154727217281037","commenter_b":"When your cat was grabbed, am sure you did not mind. Trump is an insult to humanity.","commenter_a":"He is a low class guy with money.","post_message":"Melania Trump defended her husband, saying the vulgar remarks were not reflective of him and that she had accepted his apology and hoped others would, too."},{"comment_id":"1152822888099590","commenter_b":"Hillary is a liar, a cheat and cares more about money then Americans.","commenter_a":"Another embarrassment p***y grabber to the country...","post_message":"JUST IN: Donald Trump Jr. will be speaking at ASU on Thursday at 2 p.m. MORE: @webpagelink"},{"comment_id":"10154222975181336","commenter_b":"Throw Megyn Kelly up and over #TrumpWall and into Mexico!","commenter_a":"This is supposed to be a cutting edge news story? I am really disappointed with Megan Kelly. Every episode is guests who trash Trump. Megan always has guests on that attack Donald about women. It is her agenda. it is disingenuous.","post_message":"TONIGHT on The Kelly File: In an exclusive interview, Ted Cruz's wife, Heidi Cruz, speaks out about Donald J. Trump's retweet of an unflattering photo of her: \"I think we have a pattern of behavior here ... when Donald Trump is falling behind.\" Don't miss the entire interview with much more at 9p ET. @webpagelink"}]
