[{"comment_id":"10153513286844575","commenter_b":"This lady is clueless lol","commenter_a":"This is sad leave churches alone go to a justice of peace & get married the ones trying to sue they think it is a way to get rich it makes me sick","post_message":"Four Kentucky couples are suing a clerk who is refusing to issue gay-marriage licenses — or any marriage licenses at all.  Rowan County Clerk Kim Davis says her Christian beliefs prevent her from complying with the #SCOTUSMarriage decision, so she will no longer issue marriage licenses to any couple, gay or straight."},{"comment_id":"10156221471665725","commenter_b":"Trump is only enforcing a fedral law, by deporting illegals !!! This is already the law !!!","commenter_a":"I am inviting all of TRUMP FAN to PRAY , from the HEART everyday and all the time, he need it and we need him, please let get together , for our country and for our new president TRUMP, TRUMP 2016, AMEN !!!!","post_message":"I will be hosting Saturday Night Live on November 7th. Looking forward to it!"},{"comment_id":"739879102780921","commenter_b":"She's biding her time!!!","commenter_a":"Let me offer you, @username, some unsolicited and unqualified advice since I'm not a politician. There is no way you should be neck and neck with Bernie Sanders. But you're playing weak. Go on the attack. Use your willingness to stay in a marriage regardless of your husband's infidelity as a selling point. We all know people make mistakes. Marriages often dissolve over a hint of unfaithfulness and unforgiveness. Only the extremely strong can take a mistake made by a spouse to demonstrate their character. If I'm not mistaken this is Sanders' second wife and 'The Donald' has had three wives and several affairs. How many times have you been married? They can't use President Bill Clinton's infidelity to their advantage, but you can. Who are the people advising you?","post_message":"Jimmy Fallon: Can we do a Snapchat?   Hillary: Sure! 👻"},{"comment_id":"936764406358981","commenter_b":"what tits. he was smelling her fart","commenter_a":"'Joe stop staring at my tits, thanks.' ~ Hillary","post_message":"Can you imagine?  Talk about our country going to hell in a handbasket…"},{"comment_id":"10153233984390950","commenter_b":"Did you think women are incapable of evil","commenter_a":"And the people who are saying the women and children are safe, check out who blew herself up with the suicide vest","post_message":"Police give update on raid near Paris: • Woman wearing explosive suicide vest blew herself up • 7 suspects taken into custody; 2 suspects dead • 5 officers reportedly injured; police dog killed"},{"comment_id":"10157618931615389","commenter_b":"And Hillary has never lied right? Are you serious right now? Hillary has been exposed for who she is and it's not looking good for her. For she is so squeaky clean, why does she keep hiding from the media? She is always at home resting. She used her position to grant favors to foreign governments and took millions from them when they abuse women. You are worried about Trump being exposed on that debate stage? What a joke!","commenter_a":"The snake oil salesman's chickens come home to roost Monday night. Hillary & moderators will quickly expose the lying fraud artist for the flip-flopping liberal he's always been.","post_message":"'Because they can't attack him on policy, they try to make it personal. They appeal to the emotions and the sensitivities of not only the black community, but the foreigners and females.'  Pastor Darrell Scott said the Democrats don't attack Donald J. Trump politically because personal attacks are 'all they have.'"},{"comment_id":"10153475591131051","commenter_b":"What a real sick bitch needs to go down for good she dont need her other kids go down bitch","commenter_a":"Prayers for that baby girl","post_message":"When residents here stumbled across an alcoholic mother trying to eat her own daughter alive, they decided to handle the situation personally."}]
