[{"comment_id":"1937711623123134","commenter_b":"If Clinton is chosen over Trump, there will be a howl in the land like never heard before.....the fix would be in for the political elite and the upper 1%","commenter_a":"OMG. It's over. Get on with life.","post_message":"In Opinion, Harvard professor Lawrence Lessig says there is precedent for such a move."},{"comment_id":"10154889313644411","commenter_b":"Well hes planning to shut alot of military bases around the world, and hes said hes not paying into nato waist of money he said, at the end of the day we all have to wait and see what hes going to do, you never know he might do a better job than all the other so called politicians in the past.....see how","commenter_a":"He has a point, and America needs a business man to balance the books and help the American people.","post_message":""},{"comment_id":"10154206928052431","commenter_b":"Politicians are non caring, or deliberately killing us. After all look at what Jackson did. Small pox ridden blankets. Yep and their attitude has not changed since. Maybe we should force better care of our people and not of these illegals.","commenter_a":"This is so very true. I was a cancer patient. Actively seeking medical help for confirmed CANCER in my body. The doctor at my clinic simply didnt show up for my first 3 appointments. All I needed was a consult, so they could refer me to an oncologist and behin treating the cancer. The first appointment was scheduled 1 month out, when the doctor didnt show, they had me see a nurse who confirmed I needed to be seen as soon as possible, and they scheduled me for 2 weeks later. Then, the same doctor didnt show for that appointment and it was another 2 week wait. Finally, on the 3rd no show I threw a fit and the clinic agreed to let me see a younger doctor who was actually in the clinic. And finally, after 2 months I got my referral to see the oncologist. In addition, because ...","post_message":"Natives Are Dying Because IHS Can’t Assure Timely Access to Health Care  @webpagelink"},{"comment_id":"1859557927611142","commenter_b":"Will be done if u pulled this shit lmao","commenter_a":"@username lol😂😂😂","post_message":"Cold! #WSHH"},{"comment_id":"1064573833613565","commenter_b":"So much hate is was fuels the violence like what happened in Orlando .for all that keep on with with Muslim need to die why hide your face if your so though to say thoughts words only cowers hide behind masks .....","commenter_a":"Gun control does not work and this is proof","post_message":"The FBI, Orlando Police and officials gave an update on the Pulse terror attack. Here's the latest: @webpagelink"},{"comment_id":"10153244569769087","commenter_b":"Youare a fucking ignorant whore.","commenter_a":"Benjamin Netanyahu - is protecting the Free World while Hussein Obama wants the Deadly Suicide Pact with Iran. Wait until Iran hits America with their ICBM's, Iran can already Hit Israel.","post_message":"Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו delivered an intense silent protest of the Iran nuclear deal by staring down members of the United Nations General Assembly for nearly a minute without saying a word. WATCH:"},{"comment_id":"1559763640995949","commenter_b":"What the hell is wrong with this women? What the hell was she thinking? She is going to jail. What a slime bag.","commenter_a":"Good! She should!","post_message":"Dani Mathers could now face criminal charges"}]
