[{"comment_id":"235119820270004","commenter_b":"Haaaaaaaa!!!!! Stupid, stupid lady.","commenter_a":"Too bad crybabies, he is your president. And I hated Obama but I am a grown-up and lived with him and his ugly family for 8 years. So grow up and shut up","post_message":"Trump has now set a record for the most hated president."},{"comment_id":"1231324976946036","commenter_b":"If people believe there are only peace loving Mexican people crossing the southern borders then they think there are no muslim terrorists entering with them....all with fake I.d. All borders need to be shut down ...and shut tight . Let the round up and deportation begin . If they kill...they should pay the death price .","commenter_a":"Build the fence...run electricity through it and man with machine guns . Don't bother even trying to clear these people. They do not want to assimulate into any culture. There is a tent city sitting empty for them to go to...but they can't raise shit there so they are not happy there because there are no luxurious places to visit nor anyone to demand that all their wants and desires are going to be catered to. Deport the ones that are there after your fence is finished.","post_message":"Norway has been one of the European nations hit hardest by the refugee crisis. Instead of lying down about it, they've introduced an EPIC plan to stop the refugee influx... and it will make Donald J. Trump a very proud man."},{"comment_id":"1116491755058348","commenter_b":"This is great! Pam Sept Hill, Janet Blessinger Gleason, Kandace Herring and Colleen Lafferty Wilson did you see?","commenter_a":"Terri Andrews Joanna Tugwell. We so need to print this X","post_message":"More of this, please!"},{"comment_id":"10152818238035927","commenter_b":"LOL! Funny..I've never seen a Good Looking Gay Couple...Lol!","commenter_a":"How can this be a gay Marriage? The one on the right looks like a man!","post_message":"This Ohio judge may take some heat for his recent decision on gay marriage ..."},{"comment_id":"458683577589570","commenter_b":"Negotiations are not PC, you get what you can out of your adversary ! GO AMERICA, to hell with \"global niceties !","commenter_a":"The author is racist against Asians. Trump is not","post_message":"Donald Trump shows that he's not afraid of anyone, especially people from other countries that he does business with every day."},{"comment_id":"466002853760417","commenter_b":"Screw your health care - you can buy a freaking wall instead America.","commenter_a":"Trump suffers from major PARANOIA....💰💵😎","post_message":"Speaker Paul Ryan on President Trump's executive order to build a wall on the U.S.-Mexico border: \"We're going to pay for it and front the money.\" Watch Greta Van Susteren's full interview with Speaker Ryan. @webpagelink"},{"comment_id":"601518073347996","commenter_b":"@username she won't. Madame President!","commenter_a":"Before you write him off, remember mcain was all bug out of the race, and he ended up getting the nomination, and Dr Carson is a better man than mcain for sure","post_message":""}]
