[{"comment_id":"10152999953419205","commenter_b":"....They are racist too is hardly an argument. Plus copy and paste from KKK websites ain't the best source. Still laughing","commenter_a":"You mean whitewashed like how the democrat party did about their racist history? The party you blindly support like Pavlov dogs?","post_message":"Texas textbook publishers caught whitewashing American history"},{"comment_id":"489295787927668","commenter_b":"screw her","commenter_a":"first explain what 20,000 likes will accomplish ......","post_message":"Hillary Clinton is attempting to make it punishable by law to criticize Islam.  She just crossed the line. We can put a stop to this, let's end this right now.  Can we get 20,000 'LIKES' for freedom of speech?"},{"comment_id":"1071940456151087","commenter_b":"the medias role should be to challenge state lies... now their main role is to amplify it","commenter_a":"this is not good.","post_message":"Barry Grey: Addressing the United Nations General Assembly on Monday, President Barack Obama portrayed himself and the US government as the preeminent defenders of international law and diplomacy. He did so even as the catastrophic consequences of the illegal wars of aggression he has overseen continued to send waves of refugees fleeing the ruins of entire countries—including Afghanistan, Iraq, Libya, Syria and Yemen—and as Washington took new steps to turn Eastern Europe into a militarized zone for eventual war against Russia."},{"comment_id":"10155384146056509","commenter_b":"You have to be a goddess first.","commenter_a":"There are no emojis that look like me either... When will Apple give a goddess as an option","post_message":"She couldn't find an emoji that looked like her, so she took it upon herself to make it happen.  Meet the 15-year-old that brought the hijab emoji into the picture @webpagelink"},{"comment_id":"1266165143423955","commenter_b":"This woman is such a moron. Send that lunatic Syria then see if she still thinks they ate doing gods work what an idiot","commenter_a":"Your kidding right ? Sick out of it, to hate that much.","post_message":"HOLY F*CK!"},{"comment_id":"899130260122396","commenter_b":"Eat what we or go back to your own country.","commenter_a":"Just go away.","post_message":"OUTRAGE"},{"comment_id":"1005311662842639","commenter_b":"I would have kicked her in her taco real good!","commenter_a":"Damn what a sicko.","post_message":"This nun decided that students needed a hardcore lesson in Jesus' suffering -- so she stabbed a kid in the forearm."}]
