[{"comment_id":"10154795972864456","commenter_b":"Happy Birthday","commenter_a":"Happy birthday 🎂🎂❤️❤️🎈🎈","post_message":"Help us wish Ms. Effie of Union Springs a happy 108th birthday!!!!"},{"comment_id":"10154080413671162","commenter_b":"You must be a star chaser or useless female cop.","commenter_a":"What a bunch of ignorant aholes....do me a favor and NEVER CALL THE COPS to help your pathetic selves...none of you are worth it....all loser thug scum bags","post_message":"Police say they were trying to pull a car over when it smashed into their patrol SUV in the Loop."},{"comment_id":"1835608856683220","commenter_b":"What shut the fuck up","commenter_a":"Nazi Supremacy! Disgusting Asshats!","post_message":"The university stated that Richard Spencer's views are 'in direct conflict with our core values.'"},{"comment_id":"1087153308047587","commenter_b":"I'll vote for a female for our President, but Hillary is not one that I want to vote for for President. I also think that if your spouse, or former spouse was already President, then you should not be allowed to run/be President; I also think that it should at least skip one generation for sons/daughters.","commenter_a":"Voted for President Obama because he is Black. Voting for Hilary because she's a woman. Why did anyone vote for the last 40 white male Presidents?","post_message":"\"Nothing gets me angrier than when someone implies that I'm voting for Hillary Clinton because she's a woman.\"  - Lena Dunham"},{"comment_id":"10152701982362869","commenter_b":"Will miss you on Fox. Now, go get 'em.","commenter_a":"Choice satellite TV doesn't show FOX NEWS anymore so I don't get to see it. All we get is liberal news and I think this is just propaganda and time to cancel choice for violation of our contract.","post_message":"This evening I wanted to share with you some news that is very personal to me.  Because you have been such a good friend and a strong supporter of all my efforts, I wanted you to know first that tonight I will do more than just say goodnight on my Fox show.  I will say goodbye.  This is the last edition of Huckabee on the Fox News Channel. It has been the ride of a lifetime, and I have never had so much fun in my life. But I also realize that God hasn¹t put me on earth just to have a good time or to make a good living, but rather has put me on earth to try to make a good life.  There has been a great deal of speculation as to whether I would run for President.  I won't make a decision about running until late in the spring of 2015, but the continued chatter has put Fox News into a position that is not fair to them. The honorable thing to do at this point is to end my tenure here at Fox so I can openly talk with potential donors and supporters and gauge support.  As much as I have loved doing the show, I love my country more, and feel that it may be time for me to leave a zone of comfort to engage in the conflicts that have almost destroyed the bedrock foundations of America.  I feel compelled to ascertain if the support exists strongly enough for another Presidential run. So as we say in television, stay tuned!"},{"comment_id":"908814249264770","commenter_b":"@username did you know it will cost 114 billion dollars to deport 11.3 million people then add in the cost of the wall. Who would pay for that. Our taxes would have to go way up to cover that. I don't think Don can cover that out of his own pocket.","commenter_a":"I am an American. My children are American. My Grandparents and Great Grandparents were immigrants to this country. They came from Poland, Germany and Italy. I am a woman. I am successful in the male dominated auto industry. Donald Trump has spoken against every good thing I have been taught to be proud of in America. He is a ignorant, lying buffoon. #imwithher","post_message":"Yesterday, Donald J. Trump said that the judge presiding over a lawsuit against Trump University should be disqualified from his job because, in Trump's words, he has “Mexican heritage.”   Judge Curiel was born in Indiana—and last I checked, that's in the United States of America. Judge Curiel is as much of an American as I am. He’s as much of an American as Donald Trump is.   Let's be clear about what Trump is saying. He thinks that because Judge Curiel's family has Mexican roots, he can’t do his job. Donald Trump isn't just wrong about this; his words show that he’s wrong about America. He’s wrong about what makes this country great. And on a day that we are mourning Muhammad Ali, let's remember that we live in a country where people can break down barriers, worship their own god, choose their own name, and lead and follow their dreams as far as their hard work and talent will take them. I’ve always believed that in America, it doesn’t matter where your parents were born or what color your skin is—we should be judged by our words and our deeds, not our race, heritage, or religion. Well, it's time to judge Donald Trump by his words and deeds. And I believe that his prejudiced, bigoted words and deeds disqualify him from being President of the United States."},{"comment_id":"10153201550225329","commenter_b":"I agree she thought she untied the cloak and when they pulled she realized it was not untied so it was a mistake and I doubted anyone will get blamed for it.","commenter_a":"Because of my job, I saw the Brit Awards here in the US. What people DID NOT SEE (unless you live in the UK) is the fact that she did her entire performance. She may not have been able to dance to the best of her ability because of what happened, but she made it throughout the end.","post_message":"Poor Madonna"}]
