[{"comment_id":"10153060673305329","commenter_b":"Sharon Needles bitch!","commenter_a":"Oh my gosh @username and Tavian Broderick you got to take this shit- i got Bianca","post_message":"Good luck, and DON'T f**k it up."},{"comment_id":"10152965778679641","commenter_b":"Nigeria should not only recall her ambassador but,should ask all indonesians to leave within 7days. Including \"INDOMIE NOODLES\" A Nigerians should stop patrpnizing INDOMIE NOODLES and anything associated with Indonesia","commenter_a":"I guess you better think twice before messing with illegal drugs in Indonesia.","post_message":"Indonesia executes six people, including five foreign nationals, by firing squad; Brazil and the Netherlands recall their ambassadors in response. @webpagelink"},{"comment_id":"624793527653829","commenter_b":"I thought the window sign was funny too.","commenter_a":"Julie! lol","post_message":"If you are a Starbucks customer, you might be a racist... apparently."},{"comment_id":"10153397415338984","commenter_b":"Guess you are be careful about who you ask to suck your dick!","commenter_a":"Very old","post_message":"Watch what happens when this bully starts a fight with the wrong guy... he didn't see this coming. The cameras caught this entire fight... Are you happy he got a giant slice of justice?"},{"comment_id":"10153307590149087","commenter_b":"Bitch got a face like a monkeys nut sack....to friggin ugly to be president","commenter_a":"Of course....he rocks!","post_message":"A poll of Iowa voters found Dr. Ben Carson decisively defeating Hillary Clinton in a hypothetical general election matchup."},{"comment_id":"10152789526371130","commenter_b":"I think her father is a proud lesbian.","commenter_a":"well this little girl is just over the top.. do you think her father is proud? I think not..","post_message":"\"I've been pegged with the word insensitivity. It's just how I've been sensitized and the tone I chose.\""},{"comment_id":"10153855259970329","commenter_b":"So the same saying goes if a female swimmer ... participated with the same enthusiasm. .. in a common wealth games ... yeah menstural blood after all ain't unhygienic. .. its holy","commenter_a":"It's not about it being shameful, it's about it being a private thing. Like going to the bathroom is a private thing.","post_message":"“We’re the ones having a period and we’re the ones having to pretend it doesn’t exist.\""}]
