[{"comment_id":"10153507690103812","commenter_b":"They attack to eat. It's a risk of going into an ocean. Yet millions do multiple times yearly. Safely.","commenter_a":"I wish they could stop telling the lie... \"Sharks don attack humans\".... Yes they do!!","post_message":"UPDATE: Officials: Girl and boy may have lost parts of limbs in separate shark attacks on same stretch of NC beach: @webpagelink"},{"comment_id":"1107309912667398","commenter_b":"Testing , testing , are you awake America , if not you'd better be soon , ISIS is here an they're not gonna wait for us to realize it , to late is to stupid , time to shake the Muslins up to the fact that we've wasted enough time an lives on there nonsense arrest an deport where needed , tolerate nothing , they want changes send them home an let them change there own countries , leave us alone an we'll leave you alone too .","commenter_a":"@username and trump piss off.","post_message":"Donald J. Trump says there may be more terror attacks across the country because \"we've been weak\" and \"our leaders are...stupid!\" @webpagelink"},{"comment_id":"10154666429943258","commenter_b":"Go back to France, sing a song and appease all the Muslims......","commenter_a":"Immature. You should do what your customers ask of you.","post_message":"James Taylor wanted Fox News changed at Boston Logan International Airport. Here's what Bill O'Reilly had to say about that."},{"comment_id":"741319736029564","commenter_b":"@username. That's ridiculous.","commenter_a":"It's just sad. Sad. You are more worried about getting the United States into a war than you are taking care of the people of your own state. @username - makes a great point why, why Tom do you keep opening yourself up to this and then turning around and bragging about Trump being as good as his word. That's worked well for this country so far hasn't it?","post_message":"The president said we were putting Iran on notice, and I'm glad to see he's as good as his word. Iran's ayatollahs will stop their provocations only if the U.S. shows strength and resolve. These sanctions are long overdue, and they're sending the right message to the regime in Tehran: Cease and desist immediately."},{"comment_id":"10152777603232093","commenter_b":"Idiots","commenter_a":"I say bring a fire truck and water there down. Keep then at a distance.","post_message":"15 officers have been injured in Baltimore riot, 2 still in hospital; 2 dozen arrested..... @webpagelink"},{"comment_id":"685062714983869","commenter_b":"So...when will they let Ted Nugent or Trey Gowdy be a moderator?","commenter_a":"Why Matt Lyer? What a CREEP!","post_message":"CLINTON, TRUMP SQUARE OFF"},{"comment_id":"1243101862382258","commenter_b":"Wolves in sheep's clothing!!!!!","commenter_a":"Those of you who comment on this in a judgmental way will face your own judgment because of it. God knows the hearts of everyone. Let's walk with Christ and see the beauty in this video and resist the urge of the Evil One to tear it apart and make it less than what it is. It seems to me that Mr Trump is seeking divine guidance through strong Christian leaders. He is very wise and God will make him wiser for this. (Please read this thread...I have been led to the truth by my brothers and sisters in Christ Jesus. Amen!). May God bless them all.","post_message":""}]
