[{"comment_id":"1110952199024027","commenter_b":"Oh before it was something else American government did wrong. Now it's that we won't solve your problems for you. Well then, build a wall too!","commenter_a":"This is really funny let's see what trump does for yo Greece","post_message":"LIVE: Protest against Barack Obama's visit to Athens"},{"comment_id":"868568856511870","commenter_b":"Chuck is right!","commenter_a":"You go Chuck.","post_message":"Chuck Norris puts Hillary to shame!  His liberal fans will hate what he said about her candidacy! But you'll love it!"},{"comment_id":"10154462042369062","commenter_b":"Lmao... Con el nopal en la frente y encontra de illegales.... Everyone with a hispanic latino last names shall research theyre ancestry our families come from illegal immigrants","commenter_a":"We are not \"united\" and Trump is not racist. I am against illegal immigration and support Trump!","post_message":"It translates to, \"United Latinos: Don't vote for racists.\""},{"comment_id":"826951857397870","commenter_b":"Don't listen to all the crap! Half of it has been proven a lie and who knows about the rest? What kind of woman has these accomplishments? Surely not the ones they're talking about! @webpagelink","commenter_a":"too much baggage for me","post_message":"You know what to do!  Thanks to Liberal And Proud Of It."},{"comment_id":"678380735661527","commenter_b":"@username idiot","commenter_a":"well, well, well, so hillary's leaks are coming out! She makes fun of Catholics and Evangelicals, are you going to report on this? Well probably not since another leak talks about how you in the media and donna Brazile help her by giving her question that will be asked in the debates with Bernie, so she could memorise her answers. Hemmmm ,poor Bernie. They even told her when to smile. But guess you won't be report this becuase you're as guilty as she is. What a shame that we can no longer trust the media, the FBI, and of course lying bigoted hillary. We already knew she found millions of people deplorable and unredeemable, but now she hates Catholics and Evangelicals. . Thanks Wickie Leaks for giving us the truth because we know the media won't.","post_message":"\"I regret coming to the Trump support event, and in particular allowing my son to be a part of it,\" one donor said."},{"comment_id":"551295498386832","commenter_b":"Hillary is crooked af it's the perfect excuse.. Get a life.","commenter_a":"Love you Bernie but I can't support your endorsement. I know you'll continue to do what you can from your position and if given the opportunity to support you I will do so. But it looks like I will have to change my vote to Trump this year. I will not support Hillary under any circumstances.","post_message":"Thank you, Bernie Sanders. Proud to fight alongside you."},{"comment_id":"1160971703940168","commenter_b":"BULL$H!T","commenter_a":"Then the black community should stop committing more than half of the crime in this country and start acting like civilized human being.","post_message":"\"Would this have happened if those passengers would have been white? I don’t think it would have.\""}]
