[{"comment_id":"10154173554642061","commenter_b":"We are all called on to help our fellow man","commenter_a":"Nice guy!!!","post_message":"School bus driver, who is a U.S. Army veteran, noticed one of his students was crying when he boarded the bus, so he bought 10 sets of gloves and hats for that boy and other kids in need. \"No one wants a kid to suffer like that.\" @webpagelink"},{"comment_id":"1641203876178008","commenter_b":"God Bless You PRESIDENT DONALD J. Trump","commenter_a":"I called illinois state election they didn't do anything","post_message":"WATCH #LIVE: Donald J. Trump speaks at his second event on #Halloween at a rally in Warren, Michigan."},{"comment_id":"967042846696781","commenter_b":"No. Smokers gotta find their own way outta hell...not on my tax dollar tganks!","commenter_a":"If you really want to quit smoking you can afford to buy it as cigarettes cost a fortune, put the money to better use","post_message":"Controversial..."},{"comment_id":"10153854087684087","commenter_b":"Bern bitch!","commenter_a":"@username savage lmaoo","post_message":"“Say what you want about Bernie. He doesn't quit. He's in there bitching,\" Donald J. Trump said."},{"comment_id":"10153720536124087","commenter_b":"@username I bet you're wife is a illegal ass immigrant. Get ready to never see her again once he wins","commenter_a":"Cool. Soon there will be no minorities left for trump to insult. He'll start insulting the lackof intelligence of his supporters.","post_message":"GOP front-runner Donald J. Trump recalls phoning his credit-card company to see if an Indian call center would answer."},{"comment_id":"1690646117862352","commenter_b":"Yes. She's milking it like she used to milk her moms boobs lmao","commenter_a":"@username Jacob Nowell @username aww sky used to do this shit lmao","post_message":"Wouldn't you want a nice massage from this cat too?"},{"comment_id":"10153225018458352","commenter_b":"Shut yo strong African ass up","commenter_a":"Stevie Ray Dirt this going to be me if you don't hurry tf up ! lmfao jk","post_message":"Strong Black Woman Marries HERSELF Cause She Couldn’t Find A Husband (True Story)"}]
