[{"comment_id":"1701436866776634","commenter_b":"Tell hr to quit being one then","commenter_a":"PAC Lapdog","post_message":"You heard about the whole \"whore\" comment, right?  Well, after Dr. Paul Song said it, the hashtag #DemocraticWhores began trending..."},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx \" you big dummy \"","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."},{"comment_id":"10154789506552439","commenter_b":"Get the filth back to the sand","commenter_a":"If the president cant name the enemy as Islam then the media and police cant either...im assuming this is a direct order from the whitehouse as Lt Chris Cammock eluded in the press conference that there were \"other\" departments at play...","post_message":"The Muslim targeted women -uncovered women -- in Macy*s, in the cosmetic department and he was shouting. They don't tell us what he was shouting but we already know, don't we? He killed four women and one man."},{"comment_id":"10153003498236051","commenter_b":"He can be somebodys bitch in jail!","commenter_a":"Hang the SOB!","post_message":"This guy picked up a big concrete block and threw it. It landed right on a 7-month-old girl's head."},{"comment_id":"10155376064740389","commenter_b":"She's needs to be prosecuted for breaking the law!","commenter_a":"OF COURSE..... She is a huge narcissist, just like Obama. I am thoroughly disgusted!!!","post_message":"The White House tried to push past the Hillary Clinton email controversy on Wednesday, with Press Secretary Josh Earnest telling reporters he's \"not particularly interested in\" discussing the issue.   Question of the Day: Do you believe the former secretary of state's explanation for using one email account for work and personal use?"},{"comment_id":"10155066492903352","commenter_b":"this dirty ass white trash have nerve to say something rude tlking about in my mother country do Thy use punctuation marks Bitch u just went thru ur pic on Facebook first of all you hve two boys how wuld I feel if some one were to follow the boys in rape them but then again you look like a crak head so u wuld not give two fucks right stop hittin that pip b4 you wanna tlk about other people in there country trailer trash Bitch don't u hve some beans to go warm up in the fire in eat","commenter_a":"Fa real if you can have the nerve to to that to a child who barley can right his name an innocent baby in the Lord's house you shuld get more than yur face ate in my mother country we wuld have tie his ass up in take turns slicing his body parts mKe him then make hungry stray dogs eat his freaking dick in his balls then when thats over set his ass on fire wile the mother stabs him his ass to see","post_message":"A mother let her 4-year-old go to the bathroom alone during Sunday Service…Rolls Wheeler, 39, followed the boy when he got up, and raped him in the restroom. ----> @webpagelink"},{"comment_id":"10155091471801579","commenter_b":"Anything to shut down that lying screeching woman!","commenter_a":"She knew it was coming. It was part of her plan. It's all about playing the victim. Raising money.","post_message":"Uh-oh"}]
