[{"comment_id":"10156220417230354","commenter_b":"Funny how they brought in women who said because of Planned Parenthood they were able to get breat exams. She admitted Planned Parenthood had no mammogram machine! All they do is feel the breast then refer you to an imaging center! Obamacare covers this. Obamacare covers birth control pills as well. Take your pill, no need for an abortion.","commenter_a":"Obamacare (paid by our Taxes) covers all women's health issues and problems - why is Planned Parenthood (which name indicates planning to become a parent) even needed. Women use PP for birth control - seems like double taxation to the taxpayers.","post_message":"Running a human meat grinder and selling human baby parts is lucrative work. And YOUR hard-earned tax dollars help pay for it all!"},{"comment_id":"10153356838133690","commenter_b":"Let ur sister to mumbai to get a rape","commenter_a":"Pak and ISI will use the money to fund terrorists !!","post_message":"Pakistan and China have held close diplomatic, military and economic ties for decades, but these projects would represent the largest investment in Pakistani history. @webpagelink"},{"comment_id":"10152934177006051","commenter_b":"Stupid Bitch you need your ass whipped","commenter_a":"Karma","post_message":"Even the police were stunned that a teen girl could be so cruel to an elderly woman."},{"comment_id":"1734664193415362","commenter_b":"Don't Worry Bernie supporters.. !! Hillary will never win, well never let her ! #FeelTheBern #NotMeUs #HesWithUs","commenter_a":"Hillary is the clear choice for the White House!","post_message":"What a week."},{"comment_id":"613597282122381","commenter_b":"You don't see conservatives trying to preserve the right to vote? Of course they are. Why is it perfectly ok in your eyes that we have to prove ourselves to exercise our right to bear arms, but having to have an id to vote is racist? Mass shootings are still a rare occurrence in our country.","commenter_a":"When Obama's secret servicemen are the first to lay down their guns, and he doesn't get shot, I will believe \"gun control\" works.","post_message":"I support it. Do you? Occupy Democrats"},{"comment_id":"1155951624441179","commenter_b":"\"Security concerns\"... Right. It was probably because smiling is illegal.","commenter_a":"Real reason: Mewtwo is in Tehran 😂","post_message":"Iran isn't going to catch them all."},{"comment_id":"10153635902876130","commenter_b":"Lol. Why do they even give them their name in print. If we ignore them they will hopefully go away...🙄","commenter_a":"Geesh, what an unimpressive list. Was this even worth an article?","post_message":"They all think Donald J. Trump is \"that guy\" for America."}]
