[{"comment_id":"1022858884507686","commenter_b":"Just go away! Crawl into the hole of failed soorts stars, and never come out again, unless you grow up and apologize to America!","commenter_a":"Way to preach Professor Kap! Fool!","post_message":"Colin Kaepernick praised the dictator's commitment to education and criminal justice reform.  \"We do break up families here. That’s what mass incarceration is. That was the foundation of slavery. So our country has been based on that as well as the genocide of Native Americans,\" he added."},{"comment_id":"10153567910251130","commenter_b":"I think you're Ricky Gervais pretending to be a guy a named @username! (Please do not take that as an insult! You look like an incredibly fun dude)","commenter_a":"Kid admiring hard working men before society pollutes his brain with the sad gift of being judgemental. Future empath right there. Well done son.","post_message":"Starstruck!"},{"comment_id":"10153753535205695","commenter_b":"She should be impeached","commenter_a":"I don't think she should be jailed. They should just fire her.","post_message":"#BREAKING: Judge orders defiant Kentucky clerk to jail after she refuses to issue marriage licenses."},{"comment_id":"10154352639558271","commenter_b":"That maybe so but I do agree with her ideas. Today's education is a joke and only benefits unions and their members. You might disagree but that's my story and I'm sticking to it.","commenter_a":"I think generals know more about the military than a civilian. I don't think you would want a dentist fixing your car. Wise up sir.","post_message":"There may be a theme to the way Donald Trump is selecting members of his cabinet.  Metro State professor Norman Provizer talks about the President-elect's choices with Anne Trujillo Denver7 today at 4pm on Politics Unplugged."},{"comment_id":"884868911589338","commenter_b":"More like the Supreme Joke of the United States, where the highest bidder wins the votes. They should just remove the robes and wear clown outfits.","commenter_a":"Franklin Graham The Supreme Court of the United States has ruled today that same-sex marriage is legal in all 50 states. With all due respect to the court, it did not define marriage, and therefore is not entitled to re-define it. Long before our government came into existence, marriage was created by the One who created man and womanAlmighty Godand His decisions are not subject to review or revision by any manmade court. God is clear about the definition of marriage in His Holy Word: a man shall leave his father and his mother and hold fast to his wife, and they shall become one flesh (Genesis 2:24). I pray God will spare America from His judgment, though, by our actions as a nation, we give Him less and less reason to do so.","post_message":""},{"comment_id":"1495672320492892","commenter_b":"Leave her there","commenter_a":"Why?? Why would you tarnish your gold!! The first black woman and you trash your chance to be a roll model and a proud American! Wtf is wrong with you! You just ruined your chance at becoming everything I wished for you! You Dumb bitch!!!","post_message":"I can't even anymore with this garbage..."},{"comment_id":"1015573841835697","commenter_b":"She'd be fiesty in bed","commenter_a":"Sam WantAndre Szukilojc10154044729995518","post_message":"Don’t you know who I am?   No!"}]
