[{"comment_id":"10153098509611813","commenter_b":"The ACLU doesn't stand for white heterosexual males or gun rights...ever.","commenter_a":"The ACLU stands for dead babies and bombings.","post_message":"The ACLU supports refugees and stands against fear mongering by politicians. @webpagelink #refugeeswelcome"},{"comment_id":"10154376323356509","commenter_b":"Screw this Stepford wife!","commenter_a":"I had expected @username to declare Hillary Clinton the winner of this State of the Union but to my surprise @username has decided to no longer boycot Bernie Sanders. Wolf Blitzer called him \"a new face\" and very underestimated by the general public. Yes Wolf, he is a new face on @username and he was underestimated by @username but not by the general public. We all saw this coming, you better explain why you didn't: ignorance or incompetence?","post_message":"5.) \"Many of our best corporate citizens are also our most creative.\" -- Barack Obama during his State of the Union or Nikki Haley during the GOP rebuttal? #SOTU"},{"comment_id":"10153478960668984","commenter_b":"Shows what kinda person she is, she throws her own Dad under the Bus,, Classy, dirt bag.","commenter_a":"They say the acorn doesn't fall from the tree","post_message":"Mosby has made it widely known that she comes from a long line of police officers, but this admission reveals a very different look into her background..."},{"comment_id":"1811896189089892","commenter_b":"Cause she was lying, and she knows we all know she is a liar!","commenter_a":"Wow.. a fair and unbiased job by Chris Wallace..finally!!...Trump didnt expose her as the lying criminal that she is as much as I hoped Hillary must have had an earpiece she was nodding yes through the whole debate...what a fake! Now lets listen to the corrupt media spin it left when its obvious Trump won.","post_message":"There was no doubt about it..."},{"comment_id":"223405771457676","commenter_b":"Greg Allen Bitch was prob Bisexual🤣 There's alot of them women running around claiming they gay when they lowkey bi. Hell the woman I messed with was prob Bi on the low!","commenter_a":"To each their own.. Who cares if she wanna be a stud.. Lol y'all niggas mad that her broad prolly look better than yours.. And you are born with a dick.. lmfao.. Let this person be whatever they want, ain't hurting me or my pockets fam..","post_message":"Crazy difference... #YoungMA #WSHH"},{"comment_id":"10153360842296162","commenter_b":"Hope they enjoy their 72 male virgins.","commenter_a":"Fuckkkkkkkkkkkk Muhammed!!!!!","post_message":"COP SAVED LIVES: The officer who returned fire at two men who shot assault rifles outside an event displaying cartoons of the Prophet Mohammad \"saved lives,\" according to authorities @webpagelink"},{"comment_id":"10153204052806051","commenter_b":"@username-You are a chicken !!!","commenter_a":"Obama is a terrorists","post_message":"This sign about President Obama is sparking a lot of controversy. Decide for yourselves if it's fair."}]
