[{"comment_id":"743858605712748","commenter_b":"I know another PENNY ,and she is worth much more that as a friend !","commenter_a":"Good grief!! And people say pennies are worthless.","post_message":"Are they nuts?"},{"comment_id":"602527166571478","commenter_b":"Certain ppl should stop reproducing","commenter_a":"@username fuckin retard","post_message":"So Dumb: She Thought She Found A Hack To Charge Her Iphone!"},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx \" you big dummy \"","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."},{"comment_id":"10154335593072293","commenter_b":"Doesn't it amaze everyone how trump gets away with not being transparent at all with his tax returns, his business ventures, etc, etc, etc...but if Hillary Clinton spits on the sidewalk, the world comes crashing down on her! #DOUBLESTANDARD","commenter_a":"With most of the criticism coming from left wing gossip rags like WaPo! Lmao at the yellow journalism!","post_message":"On Monday, criticism of Comey continued to mount, notably from prominent former law enforcement officials."},{"comment_id":"723136044452880","commenter_b":"We've had enough of these bull Shite DEBATE CRAP!! Stop this insanity, who agreed to this shite?","commenter_a":"wont be watching","post_message":"The debate you can't miss.  Watch Thursday, March 3rd at 9p ET on Fox News Channel and stream live on foxnews.com."},{"comment_id":"937869812915107","commenter_b":"I hope they suspend her license and hope the liar loses her job!","commenter_a":"She should loose her job & be required to stand on corner with sign showing what she is","post_message":"Our favorite ‘just deserts’ of the week!"},{"comment_id":"543745795816000","commenter_b":"We need to start carrying bacon with us and when they disrespect an American Bitch slap them with the bacon.","commenter_a":"Yes,yes! Or send their butts back! We don't want them here!","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"}]
