[{"comment_id":"10152847768557690","commenter_b":"How do you steal that many cattle without being noticed? Surely someone saw something","commenter_a":"Who let the cows out?!","post_message":"Officials are investigating how 1,121 cattle vanished from a Texas dairy facility >> @webpagelink"},{"comment_id":"1069894739689449","commenter_b":"That is a bunch of hog wash. It is not about keeping your knees together til you are married. If a girl and a boy want to have a sexual relations then they can buy their own rubbers or birth control pills. Since we have Obama Care I am sure birth control pills will be covered. So even the children who have gone to college can have sex responsibly now that parents can keep their kids on their insurance long after they graduate from high school. If these youngsters can afford smart (cell) phones they sure as heck can afford birth control pills. .","commenter_a":"Amen to that","post_message":"\"Ladies, unless you want the stain of guilt upon your soul, keep your knees together until you're married and put Planned Parenthood out of business.\""},{"comment_id":"10152775597868299","commenter_b":"Who does she work for?","commenter_a":"How about you get a job darlin????","post_message":"Chelsea Asks for Clinton Foundation Cash ... @webpagelink"},{"comment_id":"965394473500060","commenter_b":"That's what happens when unqualified people get put in jobs, for fear of hurting someone's feelings!!!!!","commenter_a":"THIS WAS PLANNED , THIS IS HOW NEGRO'S GET RICH !!! I HAVE SAID THIS MANY TIMES BEFORE !!! DUMMY'S","post_message":"A New York City firefighter who was allowed to graduate from the New York City Fire Department (FDNY) training academy despite failing physical fitness tests is now on medical leave after less than two weeks on the job."},{"comment_id":"575480735957321","commenter_b":"I'd rather listen to a milk cow","commenter_a":"Go 3rd Party!","post_message":"Watch the final night Republican Convention live with NPR and PBS NewsHour. Donald Trump accepts the party’s nomination tonight and makes his case to be the nation’s next president. Scheduled speakers include: Brock Mealer, Marsha Blackburn, Mary Fallin, Lisa Shin, Reince Priebus, Peter Thiel, Tom Barrack, Ivanka Trump and Donald Trump."},{"comment_id":"10154396026094714","commenter_b":"Hey woman need your number","commenter_a":"Angie Slater.... awesome words for you","post_message":"\"A strong spirit transcends rules.\" — Prince #RIP"},{"comment_id":"2045292995569416","commenter_b":"Oh shes another one who lied.","commenter_a":"Liar liar pants on fire!","post_message":""}]
