[{"comment_id":"10155154956823487","commenter_b":"These people are like the Clinton's they don't give a damn about the illegal immigrants! All they care about is making money 💰 off the backs of illegal immigrants!! Why didn't they help those poor people before get legal documents in order!! 😡😡😡","commenter_a":"A refreshing glimpse of optimism.","post_message":"Bill Gates: predict a comeback for the truth."},{"comment_id":"1015377538499586","commenter_b":"Once they gain a hold in our political system does anyone think they won't usher in Sharia Law? Incompatible with our Democratic Republic!","commenter_a":"When Islam got started it destroyed what was decent in the Middle East. It's incompatible with anything.","post_message":"\"Do you think, fundamentally, Muslims from the Middle East are incompatible with American democracy?”"},{"comment_id":"10154009579409255","commenter_b":"It's an intense embarrassment for us here in Nevada. It's what happens when rational people don't vote in the midterm elections.","commenter_a":"Nevada? How about every other state in this country?! 😕","post_message":"How in the world are these people getting elected to office in Nevada?"},{"comment_id":"485911244932789","commenter_b":"be head her","commenter_a":"Yes , l support our police","post_message":"A woman is suing the police department... over a hijab? This woman broke the law, the police are completely in the right. Do you support our police?"},{"comment_id":"749120498611861","commenter_b":"Ghetto trashy bitch.","commenter_a":"TELL ME WHO IS RACIST,,HE WAS A GENTLEMEN..I WOULD HAVE SLAPED HER ASS","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO] Racebaiters will never say anything about this. What would you do in this situation?"},{"comment_id":"10153581092769087","commenter_b":"give us a number, @username. How many Americans should be murdered, raped, robbed or maimed by asshole criminals who should not even be here in the first place? Here are some crimes committed against Americans by Illegal ALIENS The Sanctuary city of San Francisco protected the previously convicted illegal alien gang member charged in the murder of Michael Bologna, 20, his brother Matthew, 16, and his father Anthony, 48 @webpagelink Illegal alien stabs to death 24 year old college student Lauren Bump @webpagelink Illegal alien charged with murder for vicious stabbing death of Kathleen Byham in a Wal-Mart parking lot @webpagelink Twice deported illegal alien charged with murder of Sheriff's Deputy Josie Fox, 37 @webpagelink Mary Nagle - was raped and murdered by illegal alien who then uses her cell phone to brag about crime to her friends and family @webpagelink Illegal Alien Kidnaps, Rapes, and Buries Alive an 8 ...","commenter_a":"\"I have been thinking a lot about Donald Trump, people say that he doesn't have a platform, that he just wants to make America great again. I have something to say about that, Donald Trump is not telling you his plan, he's giving you an outline. Why? Every time that he has brought something to the table, the other candidates take it and run. Such as, immigration, \"the wall\" and other issues. I can guarantee you that he won't give you his full plans in detail until he is standing at the podium, next to one of the Democrats. THAT is when he will reveal everything. He doesn't need to do that now. Donald Trump is a visionary. He doesn't go into business, without a strategy, and a form of negotiation already set. This man is prepared in business and will be fully prepared when the time is right, in ...","post_message":"Republican front-runner Donald J. Trump leads his rivals by double digits in Michigan on the eve of the primary, according to a new poll."},{"comment_id":"10153060645251350","commenter_b":"And you'd win a beauty contest for sure ...","commenter_a":"She's so ugly. She has a mouth the size of a horses mouth","post_message":"What do you think: Is this a subtle pregnancy announcement or just a cute silly photo from Beyonce?"}]
