[{"comment_id":"1089340994496293","commenter_b":"Nope ! We won't be voting for her !","commenter_a":"What is she wearing; gift Wrap? I'm glad she's encouraging people to vote. Who you vote for is your personal choice.","post_message":"Miley Cyrus goes door-to-door at George Mason University registering college students to vote for Hillary Clinton abcn.ws/2dx2OnW"},{"comment_id":"10153888535289160","commenter_b":"Donald Trump our only hope for Americans. Illegals should go home and work on making their own country great.","commenter_a":"Donald Trump for President United States of America","post_message":"Trump \"has a right\" to question if Trump U judge is fair the former AG claimed."},{"comment_id":"1275765532466713","commenter_b":"THIS IS WHAT america going to get if hillery elected .. this Muslim imam funded to Hillary clinton campaign.@webpagelink.. have a great islamic future for Americans","commenter_a":"thie is a foto shop pic trump u moron","post_message":"ANY FELLOW JEW VOTING FOR CLINTON IS A DISGRACE TO OUR PEOPLE!"},{"comment_id":"10153206290841037","commenter_b":"And burn all the racist people in America","commenter_a":"burn all the bibles, korans, and any other religious text. They are blights.","post_message":"After being falsely accused of burning a Quran, Farkhunda was beaten, run over with a car and burned before her body was thrown into the Kabul River."},{"comment_id":"10153605782047522","commenter_b":"@username THE MORALS OF THE DEMOCRATIC PARTY AND IT'S FOLLOWERS HAVE RESORTED TO THE MOST LOWLY TO SPEAK IN PUBLIC...LENA DUNHAM SPOKE AT DNC CONVENTION. SHE ALSO WROTE A BOOK AND HEREIN IS A PASSAGE...NASTY...NASTY...GIRL...In the book, Lena Dunham describes an incident during her childhood in which she leaned down between her sister legs and spread open her vagina, saying the behavior did not alarm her mother and was the spectrum of things I did. At another point, she writes that she would try to bribe her sister with candy for a kiss on the lips, joking that a sexual predator might do to woo a small suburban girl I was trying.","commenter_a":"Not surprised. The media has been so bias lately, Clinton doesnt even need the DNC. She has the press. The hatred for this man by the media is astounding. The globalist and globalism will do anything, say anything, to remain in power.","post_message":"The latest in the polls:"},{"comment_id":"1558275617531277","commenter_b":"NICE PERSON..SHE LIES, ARGUES LIKE HE DOES. INTERUPTS,ALL SHE DOES IS TRASH HILLARY","commenter_a":"She really seemed like a nice person and I am hoping she gets as far way from that idiot as she can. She is way too good for him. She was going down the tubes with him.","post_message":"The wheels are falling off!"},{"comment_id":"1831610420459597","commenter_b":"This woman is a lunatic.","commenter_a":"Just when I thought no-one could possibly be worse than Trump..","post_message":"Forget that Donald J. Trump is accused of sexual assault...and that President Bill Clinton is not on the ballot."}]
