[{"comment_id":"1203579539653054","commenter_b":"I'll be sure to let them know you said that Ralf, I'm sure they'll be devastated,.?!","commenter_a":"More bs from HRC,.. H and her half-truths... Number of oil, gas and coal industry lobbyists that have made direct contributions to Hillary Clinton 2016 presidential campaign: 57 57 registered oil, coal and gas lobbyists have personally given $126,200 to the Hillary campaign Of those 57, 11 are bundlers. 11 lobbyists have bundled $1,140,930 in contributions to the Hillary campaign 43 lobbyists have contributed the maximum allowed ($2700). Source : @webpagelink","post_message":"Hillary Clinton showed a flash of anger when confronted by a climate activist: \"I'm so sick of the (Bernie Sanders) campaign lying about me.\" @webpagelink"},{"comment_id":"10153580091211601","commenter_b":"This Bit*h has a special place reserved for her in hell.","commenter_a":"HELL IS WAITING FOR HER","post_message":"In a Washington Post feature on Planned Parenthood, Cecile Richards, President of the nation’s largest abortion chain, says every abortion restriction in this nation must be challenged and removed."},{"comment_id":"1112383468868962","commenter_b":"So she's been here illegally since 1993........of course she'd vote for a criminal.","commenter_a":"If Facebook was not a thrown for liberals, and they removed news pages for being one sided, this would be the smoking gun","post_message":"She survived the holocaust — and years later, she’s getting her citizenship so she can vote for Hillary Clinton @webpagelink"},{"comment_id":"10153160986369705","commenter_b":"stupid cow","commenter_a":"Nothings more eerie than the words \"AMERICA\" and \"ISRAEL\". No photos needed.","post_message":"These eerie photos show Osama Bin Laden before 9/11."},{"comment_id":"10153163546666336","commenter_b":"I bet those racist pigs were cheering.","commenter_a":"I guess Al Sharpton and Jessie Jackson missed this news story...","post_message":"UPDATE: A third man has been charged with sexually assaulting a woman during spring break in Panama City Beach, Florida, that was captured on cellphone video, authorities said."},{"comment_id":"1089143724523512","commenter_b":"Jenny Magnanelli I would pummel him.","commenter_a":"Travis Kieska","post_message":"A Texas mother wants everyone to stay aware when out shopping with your baby. A man walked up picked up her 14-month-old without permission. When confronted, the man never spoke to the mom, just addressed the baby, then left the store with no merchandise. #NBC5Now More: @webpagelink"},{"comment_id":"389420827906465","commenter_b":"Tony, Many of today's pillars of righteous GOPer's come from illegal entry to the U.S. We often forget the illegal passage of our Italian, Irish, English, ancestors. You know the \"mention pot\". Key word that you are ignoring is RACISM. Hope that's not you, but it sounds like it might be. Have a good day !!!","commenter_a":"In a Nation of immigrants,mi would expect nothing less. The reactionary GOP is just plain backwards and have forgotten our heritage.","post_message":"President Obama has their back."}]
