[{"comment_id":"930468930346189","commenter_b":"It's an interesting idea but she is much older. Re pose these with young girls and I guess there would be little difference.","commenter_a":"Stop making stupid people famous","post_message":"Fashion ads recreated by a normal woman"},{"comment_id":"1354157517952129","commenter_b":"Has Ann never looked in a mirror? She may be a skinny bitch, but look at that horse face of hers. Does anybody see the resemblance? She's got great hair, but hair can't cover up that horse face.","commenter_a":"Man Coulter is a vile excuse for a human being.","post_message":"Yes, really."},{"comment_id":"10153686254615653","commenter_b":"\"Poor Catholic Hispanic Immigrants\". Key Word : Illegal","commenter_a":"Donald Trump says he would force Mexico to pay for a border wall as president by threatening to cut off (rob) the flow of billions of dollars in payments that poor Catholic Hispanic immigrants send home to their native country, an idea that could decimate the Mexican economy and set up an unprecedented showdown (Trade War) between the United States and a key regional ally. #NeverTrump #ReverseRobinHood","post_message":"Stronger together."},{"comment_id":"1392678767477322","commenter_b":"I lived there for awhile, when I got out of the Navy and met a lot of great people.Trust me, we know there are many good people there.Just the idiots have loud voices. lol","commenter_a":"I have lived here for 66 years except for military time. Don't count me as one of these idiots I love this country, third generation Navy👍🇺🇸","post_message":"A new poll shows 1/3 or Californians want to secede from the USA over Trump. Here's EXACTLY what would happen if they got their way!"},{"comment_id":"587990821351234","commenter_b":"2","commenter_a":"2","post_message":"Some say two, some say 13 can you tell? Take our TODAY poll!"},{"comment_id":"10155779429195389","commenter_b":"Yep all she would be is loose end","commenter_a":"She is a real winner, did she think she was gonna hook up with these guys? All she would be is a witness, I cannot fathom how stupid some people are!","post_message":"BREAKING NEWS: New York state prison employee Joyce Mitchell has been arrested on felony charges for providing material assistance to prison escapees, state police say. @webpagelink"},{"comment_id":"10153655201276323","commenter_b":"Ha! Real men have curves, lol!","commenter_a":"The typically sexist depiction of what women want men to be... not what men are.","post_message":"Romance isn't dead, but it is dehydrated. What's it like to be be the hunk on the front of 414 romance novels?"}]
