[{"comment_id":"1809017339318525","commenter_b":"happened in bosnia too.","commenter_a":"...not the only nor first time.","post_message":"These cowards sat back and did nothing for 4 HOURS while this was going on!"},{"comment_id":"10153828561639369","commenter_b":"You know all people do is speculate as to what happened but there was clearly better ways to handle this situation then to get your own self in trouble and have your whole neighborhood thinking there is some psycho out there. No the kids shouldn't be doing that kind of stuff but why would a grown woman behave that way over some toys and trash.","commenter_a":"This woman didn't handle this situation well at all. That being said, don't parents teach their children what respect is any more??","post_message":"News of the weird....   An anonymous threat said, \"The children look delicious. May I have a taste?\""},{"comment_id":"10153797602872060","commenter_b":"Bless you Chase!","commenter_a":"Thanks Chase!","post_message":"Chase Landry of The History Channel's \"Swamp People\" hitched his 20-foot aluminum flat-bottom boat and has rescued more people than he can count."},{"comment_id":"1313010822072720","commenter_b":"And she thinks the transgendered individuals are scary","commenter_a":"sick.","post_message":"‘Are you going to let the Devil rape your children?’"},{"comment_id":"10154502038936077","commenter_b":"There is no good reason to watch episodes I, I I, or I I I. They suck, and you know most of the back story just by watching the originals. Episode VII was a great movie and I imagine this one will be as well. The second set of three are trash.","commenter_a":"Daniel Roach","post_message":"Do you agree?"},{"comment_id":"10153666896386749","commenter_b":"Um. It's 4-4 and been controlled by conservatives for like 30 years","commenter_a":"Essentially, the republicans refuse to allow the supreme court to be anymore liberalized than it already is!","post_message":"Stop obstructing our Supreme Court."},{"comment_id":"10153262230564255","commenter_b":"Evil like this should be flogged. He's a monster like the rest of the TeaParty Jerks.","commenter_a":"I truly believe this man, Ted Cruz and their followers have very warped brains that will only bring greater harm to the world than Dubya/Cheney created and we are still trying to repair! They whole group needs to be tried and sentenced to jail for 3 years for TREASON!","post_message":"Losing his grip on reality, or lying shamelessly?"}]
