[{"comment_id":"458392787682348","commenter_b":"I dont think they have been treated bad enough...kick em out of the White House and Ill be happy!","commenter_a":"POS","post_message":"Seriously..."},{"comment_id":"611608348972347","commenter_b":"You just broke the Internet with that post!!!! Lmao! I DESPISE HER! And her INNER GODDESS! Freakin lunatic!","commenter_a":"Just seeing Oprah made me want to take a dump.","post_message":"Absolutely brilliant write up."},{"comment_id":"10154965744184641","commenter_b":"I would agree that would be a good reason to March however that March said absolutely nothing about this. As a matter of fact the lady running the March believes in Sharia law and in her belief system this is perfectly acceptable","commenter_a":"This why we march. This is not acceptable for ANY culture.","post_message":"When she was 12, she was sold into \"marriage\" with a 70-year-old man -- and there are hundreds like her."},{"comment_id":"10154944748138690","commenter_b":"Rohingas living there from 400 years! How much time need to be a citizens of a country? And any illegal citizens can be clear by any countrys government, Bangladesh will do that and India also can clear any illegal citizens from their country.","commenter_a":"He is a Novel laureate for peace from Bangladesh but he didn't said anything about Myanmar Muslim crisis!! Bangladesh facing huge problem for the crisis but as a novel laureate he has some responsibilities to stop violence in Myanmar but he acting like a blind coward and always making way to steal money from poor peoples. That's why Bangladeshi peoples think he is a greedy businessman and Novel price is a joke!","post_message":"\"If it is politically motivated, to victimize a person, then it is a cause of concern.\""},{"comment_id":"10156214197580725","commenter_b":"Right!!...She belong in JAIL, PERIOD!! PERIOD!!!!","commenter_a":"You're all ignorant","post_message":"Check out OAN and compare to what you are watching now! #DemDebate"},{"comment_id":"522407631280177","commenter_b":"Translation: her vagina scares me.","commenter_a":"Maybe it is because Hillary Clinton is just plain unlikable. I am not a Trump fan but will hold my nose and vote for him over her. Her voice scares people, she just can't connect with anyone. She is the female John Kerry.","post_message":"Hillary Clinton and Democrats think  or hope  that once the primary wraps up, tensions will subside."},{"comment_id":"631709593654535","commenter_b":"Just left Great Lakes Navy Recruit Center and such pride in our country and military on full display....folks from all backgrounds. Hillary does not support our troops and I can only pray that my son does NOT have to have that woman as his CIC","commenter_a":"The irland of cyprus to .with u trump","post_message":"I am truly honored and grateful for receiving SO much support from these military leaders -- American heroes -- who have defended our freedoms. THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"}]
