[{"comment_id":"10153306067889087","commenter_b":"I bet they're total bitches!","commenter_a":"Who are these people backing Hillary?! It seems like every Democrat supporter that I come across is supporting Bernie.","post_message":"Hillary Clinton holds a stunning 31 point lead over her closest Democratic presidential rival Bernie Sanders according to a new NBC News/Wall Street Journal poll."},{"comment_id":"10153253318118188","commenter_b":"I don't see women chomping at the bit to be garbage men, roughnecks, boilermakers, crab fishers, or construction workers.","commenter_a":"She's a joke!","post_message":"ICYMI:"},{"comment_id":"1012689648797790","commenter_b":"Lmao she getting that good shit. 😂😂😂😂😂","commenter_a":"Leslley Santana Raudel Flores","post_message":"She's not ready for a tattoo"},{"comment_id":"10154778794215470","commenter_b":"@username Get her to California!","commenter_a":"All I know is that my American dream was quite shattered when I was thrown out of my job after three decades because I was labeled \"old\" (over 50) and insurance premiums were too high, so I was replaced by four cheap employees. Who was protesting for me? Middle class dreams have been more than shattered - we are the poor working ourselves to death to pay for the poor that don't want to work?","post_message":"\"My story will be much like others who dedicated their lives to their dream — the American dream — and whose intentions and lives were turned upside-down on Friday without notice or reason.\""},{"comment_id":"1600332060187317","commenter_b":"she's a skank...","commenter_a":"Megyn seems to know that whether positive or negative, any publicity is good. Think about this Megyn, apologize to Trump and you'll be a headliner in all the major news outlets. .","post_message":"Megyn Kelly EXPOSED!!"},{"comment_id":"10153607443456130","commenter_b":"She is a fucking war criminal.Are you guys fucking high?","commenter_a":"I hope when this all over H.A. Goodman writes Hillary Clinton a thank you letter, because writing about how bad he thinks she is regardless of the facts is basically his entire career.","post_message":"\"The only leading candidate in 2016 (Ted Cruz, like Trump and Clinton has a negative favorability rating) with positive favorability numbers is Bernie Sanders. Think about that for a moment.\""},{"comment_id":"1222800194406675","commenter_b":"we want some in the NW!!!","commenter_a":"Noooooooooooooooo","post_message":"Millions of Americans woke to chilly temperatures Saturday, and many could see (gulp) snow before the weekend is over."}]
