[{"comment_id":"843323745763879","commenter_b":"I do Tim!! I don't care that gays get married & I wouldn't dare force a female to give birth to a baby she doesn't want!!","commenter_a":"i thought you guys hate christians","post_message":"Oh, the irony!"},{"comment_id":"726825177508060","commenter_b":"Muslims offend me. Make them leave.","commenter_a":"God help us all. Leave your American Flag flying high. I sure will. It's OUR country. If u don't like it----- get the h---ll OUT. We didn't invite u here.","post_message":"Texas man ordered to take down American flag because it offends Muslims. In our country we fly our flag. This is absurd. Do you think this is ridiculous?"},{"comment_id":"10154960585818984","commenter_b":"She is wacko bird ...","commenter_a":"Yeah that fact that I can't debate .........because Trump is a bigot.Sexist, homophobic, racist, fear off warrior goddesses (think about it), also. And Hillary told you he was so it must be true.","post_message":"Elizabeth Warren is a liberal favorite, and she LOVES pushing her talking points on CNN. She thought this was going to be another easy opportunity to peddle her views, but this host immediately put her in her place. Her reaction is priceless..."},{"comment_id":"1640586052910285","commenter_b":"Close them.Then make it tough to come to America.Its to DAMN easy now,,that's why were lousy with illegals.","commenter_a":"NO!","post_message":"Senator Tom Cotton just introduced Trump's immigration proposal through the Senate! Sign the petition SUPPORTING the bill HERE: @webpagelink"},{"comment_id":"10154471007837577","commenter_b":"They'll come here get a bunch of \"free stuff\", infest our country, infect our people, then go back to where they came from on vacation with all of the money they \"illegally\" obtained. Vile Criminals........Build that WALL!","commenter_a":"Say no to drugs TB","post_message":"Illegals With Drug-Resistant TB Allowed Into US Schools - @webpagelink/ Large amount of illegals entering US with diseases is alarming"},{"comment_id":"1027693250616162","commenter_b":"Suck","commenter_a":"@username 1mbps","post_message":"The technology is able to transmit up to 224 gigabits per SECOND."},{"comment_id":"10153221947888984","commenter_b":"I pray Bibi wins. I believe he will, because if the Lord is on your side, who can stand against you?","commenter_a":"Please vote wisely Israel; the world needs Bibi to lead in the fight against Iranian nukes. Our administration won't, so we need you to lead the free world.","post_message":"It's down to the wire in Israel, as anti-Bibi Obama keeps a close eye on critical elections there. Do you support Bibi Netanyahu?"}]
