[{"comment_id":"10152772572266051","commenter_b":"Awwww come on people . What the heck .people hunt all the time","commenter_a":"You can tell these activists and Hollywood people have never hunted whitetail?","post_message":"Some people are outraged over Matthew McConaughey’s hunting business. Decide for yourselves if there’s anything wrong with it."},{"comment_id":"904173296345590","commenter_b":"For the amount it too severe a sentence","commenter_a":"YES!!!!!","post_message":"Weldon Angelos is serving a 55-year-term for the sale of about $1,000 of marijuana. By the time he's out, he'll be in his 70s."},{"comment_id":"1160354710653984","commenter_b":"@username Strong action on car deaths, prescription deaths self infliction, immigrants have lower crime rates on average.","commenter_a":"But there are far fewer murders Committed with ARs than with handguns.","post_message":"Its use has taken the worst direction."},{"comment_id":"1542895312670081","commenter_b":"#Trump #Trump2016 #MakeAmericaGreatAgain #WomenForTrump #VeteransForTrump #IllinoisForTrump #ArizonaForTrump #TrumpTrain #TrumpForPresident #TrumpAmerica #TrumpBuildThatWall","commenter_a":"All you guys are a joke trump is running as a republican because he knows you're dumb enough to fall for his show, look up trump interview news week 98","post_message":"Politicians are trying to chip away at the 2nd Amendment. I won’t let them take away our guns!! #MakeAmericaGreatAgain #Trump2016 Text TRUMP to 88022 to get exclusive updates!"},{"comment_id":"1819104865025971","commenter_b":"You're an angel!!","commenter_a":"I literally did this the other day with a dog waking up after a dental. I wrapped her up, rocked her and kissed her and kept saying she would be ok, she was a good girl. It's hard to see them wake up scared and alone so as an assistant, we have to watch them while they're waking up, so why not keep them safe feeling and warm in your arms?","post_message":"Baby Meesha was coming out of surgery and was crying and scared. The vet wrapped her up in his arms and comforted her, singing to her and giving her kisses. A volunteer at the BARCS Animal Shelter walking by caught this tender moment. Turn up the volume for this one. STORY: FOX13news.com/news/@username-story"},{"comment_id":"10153816638906336","commenter_b":"They were to busy kissing her big a**s.","commenter_a":"Wonder what kind of \"humor\" the View women shot at Michelle Obama?","post_message":"“If you meant [the] comment about my face being demented as a Halloween mask as humor, so be it… I have a real thick skin,\" Carly Fiorina fired back."},{"comment_id":"1160837804033382","commenter_b":"This is so STUPID....If you dont like America LEAVE","commenter_a":"National Guard please.","post_message":"Protest in dc"}]
