[{"comment_id":"10153285157239205","commenter_b":"Ignorant bitches 😂😂","commenter_a":"@username time to move for me 😂😂😂","post_message":"Trump Should Probably Start Fact-Checking His Retweets"},{"comment_id":"713245288832825","commenter_b":"I guess you are one of those women","commenter_a":"Yessss lets celebrate that we have a president think women can be treated like trash and women can stay at home creatimg babys. You women that voted him should celebrate for that","post_message":"Watch as President-elect Donald J. Trump and Vice President-elect Mike Pence kick off their  you tour in Cincinnati, Ohio."},{"comment_id":"10153778726835575","commenter_b":"These fuckers are welcome in GB but not Trump. Insane.","commenter_a":"LET'S HOPE ALL OF THESE PROPAGANDA CRAP WILL DISAPPEAR WHEN TRUMP IS SITTING IN THE OVAL OFFICE....OUR ONLY CHANCE..","post_message":"London Islamists think ISIS snuff videos are a riot!"},{"comment_id":"10154796294188256","commenter_b":"Hahaha poor Kellog was trying to introduce cereal to inbreds that eat steaks and drink Budweiser for breakfast. I bet they realized that was a wade of money!","commenter_a":"That will not bring in any more business, only lose customers..","post_message":"Kellogg is pulling its ads from the website Breitbart News, the right-wing news organization whose former chairman Steve Bannon was tapped as a top adviser to President-elect Donald Trump ."},{"comment_id":"10153256294124726","commenter_b":"Deport that illegal!","commenter_a":"Put them all on a boat back to Africa and sink it","post_message":"WATCH: Obama on Baltimore: \"Too Many Instances\" of Police Target Poor African Americans"},{"comment_id":"1033066763409083","commenter_b":"Maybe we could stop the flow of heroin coming into the U.S.","commenter_a":"To associate with Hillary Clinton, you are an EMBARRASSMENT to the residents of VA and to the military who live and serve here!! DISGUSTING!!","post_message":"I’ve seen firsthand how significant an impact the opioid and heroin abuse epidemic is having on communities and families in Virginia. More Virginians now die from these overdoses than car accidents, and law enforcement currently lacks the tools to save more lives. I’m pleased the just passed Comprehensive Addiction and Recovery Act (CARA) will encourage co-prescribing of naloxone – a life-saving drug – alongside opioid prescriptions and also implements a measure to protect the elderly from medication abuse. I worked with a bipartisan group of colleagues to draft and introduce these provisions. Lastly, while I am pleased Congress was able to work in a bipartisan way to address this crisis, we should keep working to provide emergency funding that is critically needed for state substance abuse programs, law enforcement, treatment and other priorities authorized in this bill."},{"comment_id":"10152982438537217","commenter_b":"Hooray! Now show me the first 4 corpses of native Indians killed by the illegal immigrants from Eng And.","commenter_a":"Bet the Native Americans are over the moon about this! #genocide","post_message":"They were four of the first English men to colonise America"}]
