[{"comment_id":"10153797502305779","commenter_b":"I wonder how people react to a naked hillary statue where you get to see that bitch in all her glory. Lol. Bet people would respond differently","commenter_a":"Gross!!!! The looks are uncanny!!!!!","post_message":"New naked Donald J. Trump statues appeared today, and now they're legal, backed by a mega-developer of their own."},{"comment_id":"10152785175031051","commenter_b":"Headbutt got her an ass whipping-lol","commenter_a":"I can't believe I watched this. I liked the headbutt though. lol","post_message":"It started out as an ordinary day at Walmart. Then, without warning – all hell broke loose."},{"comment_id":"1134556746600853","commenter_b":"She's no better.","commenter_a":"Trump is the devil...if he be elected to be the president...he's gonna start the world war III. HILLARY 2016-2020 !!!","post_message":"Estas son las promesas de Trump. Así podría ser su presidencia…."},{"comment_id":"10152853316636051","commenter_b":"i am with william ship all the illegal immigrants back were they belong and out of here let them do it legally then the trash want make it \\\\","commenter_a":"Deport them all. No hearing, no delay! They broke the law, boot their butts out. Seal the boarders, with deadly force authorized.","post_message":"ICE just rounded up and arrested more than 2,000 immigrants over the course of a five-day operation."},{"comment_id":"10152601738206519","commenter_b":"Let The Punk Cops Take Their Licks Like The Chumps They Are !","commenter_a":"They're expressing their displeasure with the Mayor. Suck it up Billy-boy, ypu wanted the job, now take your lumps","post_message":"\"New York police unions’ mini-rebellion against Mayor Bill de Blasio carries anti-democratic undertones, and even a faint odor of right-wing coup...\""},{"comment_id":"1243855252377391","commenter_b":"Jennifer, Donald trump doesn't care who you sleep with. Yes, it's better to vote GOP than to vote to import non assimilating Muslims who will cost a fortune and harm our citizens.","commenter_a":"I'm a Bernie supporter who's voting for Hillary whom I think is going to lose to Trump","post_message":"These names would be a huge draw in any feature film, but on Tuesday they lent their star power to another production -- the Democratic National Convention."},{"comment_id":"10154249032461178","commenter_b":"She should be gangraped!","commenter_a":"Is the reverse also true?? Are you fair game if you disagree with my views?? What an idiot!","post_message":"A rapper with a history of controversy says violence against women is OK as long as they disagree with her politics."}]
