[{"comment_id":"401855663336061","commenter_b":"She is an idiot like Obama","commenter_a":"They are both TRAITORS and need to be dealt with.","post_message":"Watch - Mrs. Obama said that a celebration like the one marking the Iranian New Year is part of the “traditions that make us who we are as a country.”"},{"comment_id":"1138008016249439","commenter_b":"Hillary is a corrupt liar","commenter_a":"Bernie is accepting the will of the majority of democrats, and throwing his support behind an amazing woman who will make an astounding President.","post_message":"Bernie Sanders and Hillary Clinton campaign in Portsmouth, NH. Full video here: @webpagelink"},{"comment_id":"10153118377188812","commenter_b":"She is mitochondrial eve. Not some delusional religious eve. All women contain the mitochondrial DNA of the first woman. It is passed down through all women. It is also evidence female came before male. Looks at my nipples* what do these do?","commenter_a":"She's 5 million years old; She's a Humanoid-Skeleton! She's not Neanderthal, Cro-Mgnon, or Java, they named her Lucy, they were listening to Elton John's; Lucy in the sky w Diamonds when she was dug-up. She's not a Cave-Woman, just a 4'5\" Woman! She was dug-up in South Africa, I don't know what you thought but, Could This be EVE?","post_message":"Study finds 3-million-year-old ancestors were a lot more handy than some thought: abcn.ws/1CuHe7M"},{"comment_id":"939497619530050","commenter_b":"She is a she!!!!!","commenter_a":"People can't see that this is a case of mental illness. I'm all for freedom of expression, but this is a cry for help.","post_message":"He calls it beautiful. You might call it disturbing. He removed his ears, tattooed the whites of his eyes, and did lots more in his transformation from Robert Hernandez to Tiamat, the Dragon Lady."},{"comment_id":"10153559818581519","commenter_b":"I guess you Hillary Shills were just waiting for me to log back in to kick your asses right?","commenter_a":"The West Coast was MADE for Bernie Sanders... If Washington State has gone for him overwhelmingly you can expect California and certainly Oregon to follow suit. We need this man as President! The greed of the 1% cannot continue!","post_message":"3 reasons why Bernie Sanders won’t give up"},{"comment_id":"10152902814047623","commenter_b":"some whites were brought here as slaves cheese whiz","commenter_a":"Well the NAACP is racist but we arent trying take away their heritage or bill of rights","post_message":"Someone scrawled the word “racist” in black paint on a Confederate monument in uptown Charlotte overnight, officials said."},{"comment_id":"1271975762826442","commenter_b":"You guys are so right & prosperous blacks had their own black slaves too. Our troublemaker-in-chief is keeping this going, stirring up strife so he can cry Marshal Law & keep his seat in our White House. We're in big trouble folks but most people don't even know that. Keepin' on puter & cell phone games, partying, gettin' high & working 2 jobs just to keep the bills paid. The average person has no time to protest & make trouble but we have the government paying people to not work so THEY have lots of time. It's how barry wants it to be.","commenter_a":"Loretta, Sadly, you're an intricate part of the problem. Just another old racist white person that cannot and/or will not recognize the murder of our young Black men by white racist police officers. Your kind will always find an excuse to somehow blame the victim...the evidence be Damn!","post_message":""}]
