[{"comment_id":"861148387265123","commenter_b":"Female racist-in-chief.","commenter_a":"-who is she to make that decision, no man has that right - God creates life!","post_message":"What sorts of \"populations\" does it sound like Ruth Bader Ginsberg is interested in \"controlling\" here?"},{"comment_id":"642587655914116","commenter_b":"These people are uneducated and ignorant!!!!","commenter_a":"The blind leading the blind. Good lord they actually believe this nonsense. I'd honestly be embarrassed for them if it wasn't so flipping sad. Dummy down people we're in for a long four years.😥","post_message":"Dear Lord."},{"comment_id":"521358881400958","commenter_b":"They never would of been allowed into Our Great America.","commenter_a":"Vote all Democrats out of office Be Smart America they are worthless hypocritical self centerd murdering traitors","post_message":"If you were in charge, would you have these deported back to where they came from?"},{"comment_id":"10153638037189778","commenter_b":"Wait. What?!? Trixie, sorry for not telling you, but I cannot have crazy women, or effeminate looking men stabbing people to death in my hotel.","commenter_a":"@username Donovan Hotel? You never said a thing about it. ;)","post_message":"POLICE NEED YOUR HELP! Police say this person is suspect in the stabbing death of a 30-year-old lawyer in NW DC. Please SHARE to help him/her to justice."},{"comment_id":"1095905513769436","commenter_b":"But he couldn't get our marine out of Mexico, anybody had enough","commenter_a":"i do not believe that he was ever a prisoner of the taliban. he was working with them","post_message":"#Bergdahl wasn't just a DESERTER who left our side; he was a DEFECTOR who joined the other side!"},{"comment_id":"994006457321423","commenter_b":"She should be drinking it!!","commenter_a":"What are the long term effects on the citizens of Flint Michigan.... Thanks Cher for showing your humanity","post_message":"Cher is doing her part to help out the people of Flint as they continue to deal with city’s water crisis. More than 180,000 bottles of water are being shipped to Flint courtesy of Cher and water company Icelandic Glacial, which pledged to double her donation. DETAILS ----> @webpagelink"},{"comment_id":"10150604575769999","commenter_b":"Why do you suppose all those things are necessary for women? Come on, think!","commenter_a":"Overcoming the confidence gap? Thanks for your concern NYT but I'm doing just fine. I'm so sick of people telling me how disadvantaged I am as a woman. Women get alimony, the children, special scholarship opportunities, special mentorship opportunities, special conferences, support groups for violence against women, priority disembarking off the titanic, the seats on the crowed bus, and the list continues... Let's face it, men are disadvantaged now.","post_message":"While men often overvalue their strengths, women too frequently undervalue theirs. Call it a continuing confidence gap."}]
