[{"comment_id":"841503402609382","commenter_b":"IDIOT!","commenter_a":"Fat White Asshat","post_message":"Shame on him.  \"According to New Jersey Watchdog, Christie reportedly spent over $82,000 of taxpayer money on concessions at MetLife Stadium.\"  Read more here: @webpagelink Image by Occupy Democrats"},{"comment_id":"1785088471737718","commenter_b":"LOCK HER UP!","commenter_a":"TRUMP NUMBER ONE ALWAYS PRESIDENT TRUMP 2016","post_message":"Thank you OHIO! I am in this to win it - we are going to MAKE AMERICA SAFE AND GREAT AGAIN! Off to Ohio now! -DJT"},{"comment_id":"10152984965615950","commenter_b":"@username what a BITCH","commenter_a":"Cute. But this is not the 1st time they put the glasses on the baby.","post_message":"WATCH: Adorable viral video shows a baby seeing clearly for the first time, and it teaches an important lesson for parents: it's never too soon to check your child's eyesight @webpagelink"},{"comment_id":"10153901332209411","commenter_b":"Russians shout their own feet. We do not export our high quailty fruit and veggies anymore. Go and import from china the plastic one !","commenter_a":"We have banned all Turkish produce on our global operations since last week...and will never have any trade relations with that country. May it be Diplomatic or Corporate! For as long as it's erdogan's administration.","post_message":""},{"comment_id":"10153746708116770","commenter_b":"That's the style whores wear today","commenter_a":"She's need to be excuted !","post_message":"Holy sheer."},{"comment_id":"1300696676663751","commenter_b":"Fuck yo bitch ass fuck you too pussy","commenter_a":"Fuck Donald Trump orange ass","post_message":"Clearly wasn't feeling the jersey!  #WSHH #WakaFlocka"},{"comment_id":"10155690406614199","commenter_b":"She started it. First of all she knew it would take her long so why didn't she let him go first. Second of all she poured her drink on him. At it sounds like she isn't very honest. And sorry but she looks like she's on drugs. This is what happens when you push people to far","commenter_a":"I think because she lied and she threw the first thing to get the conflict from verbal to physical either she gets punished or he gets off free. This is soo sexist if a guy threw a drink at a lady and she smacked him in response pretty sure she would get away with it.","post_message":"Police have released surveillance video from an alleged attack at a grocery store that tells a bit of a different story than the one the alleged victim gave."}]
