[{"comment_id":"10154298865889099","commenter_b":"Smh","commenter_a":"Jessica Milla","post_message":"\"Her ribs are broken. He beat her ribs and breast saying her milk was useless and she was worthless,\" the woman's mother said. \"He tried to blind her so she couldn't see her baby, he tried to make her deaf so she couldn't hear him crying for her.\" WARNING: Some may find the images in this story disturbing. @webpagelink"},{"comment_id":"814574258686460","commenter_b":"The ladies of The View were rude and disrespectful. It seems like they only invited you on the show to badger you. Whoopi is worse than Bill O'Reilly. She kept interrupting you & would not let you get your point across, and Joy just laughed at everything you said like it was some kind of a joke. They don't care about their guests' viewpoints at all. I have to say that I admire you for being the great person that you are.","commenter_a":"Thank you, Dr. Carson, for remaining the gentleman you are while on The View today. I must say I stopped watching that show years ago. I watched today because you were on. I have great respect and admiration for you. Donald Trump is not my first choice for President. I will vote for him if he is the Republican nominee. Maybe some of your calmness, thinking before you speak, will rub off on Donald if he is nominated and elected President. The women of The View are not my cup of tea. I turned the show off as soon as your segment was over.","post_message":"I would like to thank the Ladies of The View for having me on. Though we disagree on politics, the beautiful thing about America is that we're able to have platforms where we can discuss those differences. I will continue to work hard to ensure that this remains for generations to come."},{"comment_id":"10156171659485354","commenter_b":"Get the f away from American . I brought my religion to this country !?? I keep mine in side , Don't wear that ugly scary thing over your face !!! That scares me wear it inside or with you groups . You weren't born with it you're gonna die for not wearing it !?? I don't I promised to accept and care for what was in America . I ve got to see with my eyes . It is deadly scary to me , can't be around them .","commenter_a":"It was a fake bomb the next one won't be if that was a white kid he would be jailed you can't even point your finger because it represents a gun and you get kick out of school. So what gives with this","post_message":"Have the media given you the police's side of this story?"},{"comment_id":"924923120897717","commenter_b":"That is what the Supreme Court is for! To keep the Executive branch from VIOLATING THE HOLY MONKEY SNOT out of the Constitution. This administration is shameless and arrogant to the EXTREME!","commenter_a":"Yes","post_message":"A Federal Court upheld a block on Obama's executive amnesty. Do you support their ruling? -- COMMENT with YES or NO"},{"comment_id":"609058575939393","commenter_b":"Not only is she a bigot but she is a lying murdering greedy bigot!!!!","commenter_a":"NO HIL LIAR EE!!!!!","post_message":"Join me in MISSISSIPPI for a few minutes! It is time to MAKE AMERICA SAFE AND GREAT AGAIN!"},{"comment_id":"10154264988769062","commenter_b":"Outta place.","commenter_a":"I hope they put trash bags in his cell.","post_message":"CORRECTION: The Harris County Sheriff's Office released a corrected mugshot of Shannon J. Miles. The mugshot displayed at the HCSO press conference was incorrect. Miles is charged with capital murder in last night's shooting death of Deputy Darren Goforth.@webpagelink"},{"comment_id":"519056438282649","commenter_b":"cair can go to hell","commenter_a":"Our country. .USA..AMERICA","post_message":"PLEASE SHARE AND HELP PROTECT OUR VETERANS!"}]
