[{"comment_id":"364748327062015","commenter_b":"get rid of her","commenter_a":"You just can't fix STUPID !","post_message":"Nancy Pelosi says Math is Hard  Can Understand the Difference Between a Funding Hike and a Funding Cut"},{"comment_id":"10155234005228984","commenter_b":"Shut off the money! Mandate Everify with suspension of business & huuuuge fines if caught hiring illegals. No Welfare or any other benefits to non citizens. Proof of citizenship to attend schools! They will self deport! As for DACA? Ok. Let those poor kids who were dragged here as children BUT deport the parents that dragged them here!","commenter_a":"They are pissed off because of our policies but let ne of us cross their broader and see what happenes.","post_message":"WATCH LIVE: Secretary of State Rex Tillerson, DHS Secretary John Kelly and Foreign Secretary Luis Videgaray make statements from Mexico City on President Donald J. Trump's new immigration proposals."},{"comment_id":"10153752322536523","commenter_b":"He sound dumb then a mfa","commenter_a":"#5 don't count on a police presence to deter being shot .","post_message":"Chief Flynn's four-point plan for not getting shot in Milwaukee is as follows, according to a statement from the Milwaukee Police Association:  1) Don't belong to a gang 2) Don't be a drug dealer 3) Don't carry an \"illegal\" gun 4) Assure you're not going up against someone that has a worse arrest record than yours"},{"comment_id":"10153508480963984","commenter_b":"She is a disgrace","commenter_a":"There is nothing here for a reality show. Maybe a show on mental illness.","post_message":"NAACP race faker Rachel Dolezal stepped down from her job, but she already has a new gig in the works. You might be shaking your head when you see it..."},{"comment_id":"963844390305083","commenter_b":"Atlanta housewives just ratchet!","commenter_a":"We got housewives of Orange County, Beverly Hills, And New York. Those women act like straight up fools. I'm wit you Lisa Ray but Uhmm hey morals are out the door when it comes towards cashing in","post_message":"She says she's trying to bridge the gap between \"us sistas,\" not take part in some of the controversial reality shows out there."},{"comment_id":"857055204364524","commenter_b":"Just proves that he's good at beating up women too. And it's probably more fun since the women can't punch.","commenter_a":"Manny is no angel","post_message":"Floyd Mayweather has been charged with domestic violence on six separate occasions, convicted on five of those charges and has only served two months in prison, never receiving any penalties from the Nevada Athletic Commission regarding his professional boxing career."},{"comment_id":"908443172532257","commenter_b":"She should have NEVER been arrested to begin with !!!!! Anyone who would arrest an AMERICAN for carrying a firearm doesn't deserve to live in AMERICA !!!! PERIOD !!!!!","commenter_a":"Finally!!!","post_message":"Shaneen Allen, a Pennsylvania mother of two who didn’t know she was entering a “gotcha” zone when she drove across the New Jersey state line with a handgun in her purse, is clear of all charges following an 18-month legal ordeal in which a prosecutor had originally hoped to pursue harsh punishment as a caution to others. @webpagelink"}]
