[{"comment_id":"1833287473397659","commenter_b":"Its being kept running by immigrants as it has, its a shortage of money and a deliberate government policy to ruin the NHS so all the Tory dirctors of private health care can ride in and cherry pick the best parts and leave a dead carcass for the rest of us to fund.","commenter_a":"It's simply because the government has closed too many hospitals. That's the only reason.","post_message":"Worst NHS week in 15 years"},{"comment_id":"10154332394779607","commenter_b":"How dare she!","commenter_a":"Democrats cow-tow to any and all unions especially ones tied to government. Follow the money. The only choice they like is abortion.","post_message":"\"Rather than merely enjoying her billions and donating money to fashionable causes, she poured money, time, and energy into education reform with a particular focus on the least economically advantaged...\""},{"comment_id":"10153190910859607","commenter_b":"Little a$$wipe","commenter_a":"Uf you don't like what they serve,bring your own.","post_message":"The video of a UConn student berating food service workers who refused to sell him jalapeno-bacon mac and cheese prompted a group of students to start an online fundraiser to give the beleaguered employees a well-deserved night out."},{"comment_id":"917358028382410","commenter_b":"off with her head!","commenter_a":"Behead here to.","post_message":" ordered me to kill child"},{"comment_id":"622131437962489","commenter_b":"That's a women? Wtf","commenter_a":"Stevo Reed bruh","post_message":"Freddie Gray’s mother Gloria Darden pledged to keep fighting for her son after news broke that all remaining cases against the officers charged with his arrest and death would be dropped: @webpagelink"},{"comment_id":"10156170333030354","commenter_b":"I think they just said on Fox and Friends he didn't want to go back to that school. They never reported any of this. The kids dad said he was not going back to that school and the president is involved so probably private school.","commenter_a":"The kid is probably probing...dont trust Muslims","post_message":"Have the media given you the police's side of this story?"},{"comment_id":"1275116595847182","commenter_b":"@username You pathetic asswipe.","commenter_a":"Look at the number of blacks commiting crimes and try to tell me the only reason it's so obviously more blacks than whites is because of racism.","post_message":"Only White skin deserves justice?"}]
