[{"comment_id":"10154253853418967","commenter_b":"The only reason I stay on with these garbage gawker pages is to see the awesome Hogan memes.","commenter_a":"One Hulkamania isn't enough, Gawk ?","post_message":"The absurdity of Charles Harder threats should not distract from the underlying mission of the man who pays him: To intimidate Gawker and its reporters from publishing true things about public figures."},{"comment_id":"10154540555266509","commenter_b":"Parental responsibility not blame the gun.","commenter_a":"more guns would have prevented this","post_message":"'He shot straight through. ' The Florida pro-gun activist was accidentally shot by her 4-year-old son, authorities say."},{"comment_id":"1662251920662029","commenter_b":"White thugs!!","commenter_a":"Love the broncos, but just for this I would have they're title taken from them and given to the panthers","post_message":"This is disappointing. While many people celebrated the Broncos' Super Bowl victory peacefully, some were destructive. Denver Police made 12 arrests and thankfully, no one was seriously hurt. @webpagelink"},{"comment_id":"844885798949835","commenter_b":"Hillary was responsible for keeping wages at slave wage, oh and she sits on the Walmart board of directors too, if ya didn't know. Hillary sure likes to pull out the ACE cards for protection, still doesn't exclude that she is a liar, and a criminal of the highest order. As truly Democratic Trump holds the GOP hostage, and Cruz is stupid, full of shit, and a wingnut, and Hillary is a criminal: @webpagelink TRUMP BFF and CRIMINAL? REALLY! Get the word out, SHARE THIS! FEEL THE BERN! DOES USA WANT A KNOWN CRIMINAL IN THE MOST POWERFUL SEAT IN THE NATION/WORLD?","commenter_a":"Good for them Walmart can afford it, don't forget Walmart is the reason most of the factories closed b/c they brought cheap shite from China and the working man bought a TV or whatever from China that was cheaper so factories couldn't compete which is what Walmart wanted. I never have and never will shop there.","post_message":"Walmart faces another lawsuit loss..."},{"comment_id":"483277565194949","commenter_b":"Jesus wouldnt like that she kills babies for a living.","commenter_a":"So sorry you folks are tearing this young woman apart, would Jesus do this?","post_message":"What'd you think, folks?"},{"comment_id":"1151823781577341","commenter_b":"He claims he knows more about Isis than any one else","commenter_a":"As a Vietnam vet I may be able assist in the area of adjectives for Trump. I prefer using the term chicken-hawk. It pairs well with draft doger.","post_message":"This one is PERFECT."},{"comment_id":"10156075719260389","commenter_b":"kill the rapist please","commenter_a":"The Military is a disgrace. What the heck has happened to our military?","post_message":"“Your behavior is inexcusable and incompatible with the high standards of performance, military discipline and operational readiness of Special Forces,” the memo states."}]
