[{"comment_id":"1015160651860508","commenter_b":"@username go be stupid with your blond friends elsewhere","commenter_a":"If the little brat would have respected the teachers authority in the first place the cop wouldn't have even needed to be there.","post_message":"No matter how smarmy some snot-nosed teenager might be, even if she’s burning off the teacher’s time, the class time and her own time, there’s never a moment in which it’s appropriate for a law enforcement officer to try out his best WWE moves in order to bring her to heel — even if she takes a swing at him. @webpagelink"},{"comment_id":"10152536307751135","commenter_b":"People are driving 85,90 miles an hour in the fast lane trying to push me out !!! Get em police","commenter_a":"people and trucks drive way to fast on freeway!","post_message":"Police say the driver of the other car was going too fast for conditions at the time of the accident."},{"comment_id":"410085892484700","commenter_b":"Yes, look at Seattle. They're thriving. Lol WTF. Way to make a point against yourself. The two highest min wage cities are Seattle and San Francisco and they're also the top two fastest growing metropolitan areas in the country right now.","commenter_a":"If you think shit is expensive now, just wait when the minimum wage is 10 bucks an hour...Walmart is in favor of this because people will only be able to afford to shop at Walmart instead of the locally owned businesses","post_message":"Walmart's announcement that it will raise its minimum wage to $10 an hour was claimed as a victory by both advocates and opponents of raising the federal minimum wage."},{"comment_id":"10153386535509099","commenter_b":"What shame. Thought most grown women are maternal. I was right \"MOST\" not all.","commenter_a":"Maybe we should stay home with our babies.","post_message":"A hidden nanny cam captured more alleged abuse against the 3-year-old girl and 1-year-old twins @webpagelink"},{"comment_id":"10153062976166680","commenter_b":"Eh. Women do come back in body bags but whatever.","commenter_a":"The candidates should pledge to keep Jackson and Hamilton on the currency. Where does it say a women has to go on a bill. Women don't come back in body bags during our wars. To go on a currency bill as Washington, Lincoln, Hamilton, Jackson, Grant, Franklin, and Jefferson have is b/c of their committment to this country, AND NOT b/c of their genitals. If a woman is to go on a bill let it be on a three-dollar bill.","post_message":"POLITICO Europe: “There is such a thing as society,” Cameron said in an implied retort to Margaret Thatcher’s counter-view, “it’s just not the same thing as the state.”"},{"comment_id":"889604141156365","commenter_b":"YOU LOOK LIKE A GORILLA SLAVE. WAS CHEETA YO MASTER? STUPID FUCKING NIGGER DOESN'T EVEN KNOW THAT IT WAS HER OWN RACE SELLING THEM TO MUSLIMS AND THEN TO WHITE PEOPLE. SOME OF THESE BLACKS ARE THE MOST IGNORANT SOB'S IN THE WORLD. MUST BE A QUEER BLACK WOMAN WITH A NAME LIKE BUBBA.","commenter_a":"First of all she is full of shit! when i worked in burger King you just kept on cooking .you dont know who is getting the Burger.she is pissed because she didnt prepare herself for a better job .Whos fault is that?why do thet put this shit onF.B .It isnt helping anybody It just fans the flames of racism.I find that OFFENSIVE!","post_message":"Did you miss this one? I bet you did because in Obamaland... 'The Media' doesn't cover such stories. Enjoy. @webpagelink"},{"comment_id":"10155064205902178","commenter_b":"Don't they know it's a \"shark free zone\"! This method works for criminals who take heed to gun free notices.","commenter_a":"Joe Daniel","post_message":"An 11-year-old boy was bitten by a shark off the coast of North Carolina yesterday, the second incident in as many weeks. >>>wral.com/@username"}]
