[{"comment_id":"1660263367594109","commenter_b":"May be we should shove firecracker up their A-- & see how they like it. God bless America","commenter_a":"Awesome. ..thank you...","post_message":"\"If you have the right to burn my flag, then i have the right to kick your ass.\" - Creed Fisher"},{"comment_id":"10153701487053984","commenter_b":"She need to stay out of all business","commenter_a":"tell that ugly monkey to miind her own business","post_message":"Students have been complaining about Michelle O's lunch rules since they were implemented, but now it just got taken to a whole new level... Do you think schools should quit enforcing Michelle Obama's lunch rules?"},{"comment_id":"842693252541388","commenter_b":"Go pound sand Joan","commenter_a":"WOO HOO!! #CRUZ4PRESIDENT!!","post_message":"Thank you Governor Mike Pence for your support! #ChooseCruz: votetedcruz.com/in"},{"comment_id":"10154994136091800","commenter_b":"He probably knee jerked so hard he got a bloody nose and blames it on picking it too much!","commenter_a":"Trevor Noah is a puppet... Go back to south Africa where division is welcome stop trying to divide my country with your shitty humor... #Bringbackstewart","post_message":"The Daily Show recaps President Trump’s flurry of executive orders."},{"comment_id":"10153832600184087","commenter_b":"She is simply unwilling to burn her country to the ground with a Trump presidency. That makes her a phony? Good grief.","commenter_a":"Elizabeth Warren is a phony. I am so disappointed. I wish I had never donated to her campaign. She is trash. They can put her on the ticket as their little bone to throw at progressives, but I am not biting. #stillSanders","post_message":"Elizabeth Warren will meet with Hillary Clinton Friday morning just hours after hinting she would be open to being Clinton's vice president."},{"comment_id":"10153227966933984","commenter_b":"The woman is a fukin crook","commenter_a":"I want a moral person leading our country!!","post_message":"Well, here's BIG news that will turn a lot of heads. Do you hope this marks the final chapter of the Clinton saga?"},{"comment_id":"10154303723989411","commenter_b":"@username I'm not sure all of them are refugees","commenter_a":"if cannot adapt the European lifestyle why want to lived in Europe. I just do not understand, much better they lived in arab countries and do their own style.","post_message":"'We are not anti-migration party, we are for controlled immigration. We cannot allow for the borders just to be open for everybody who wants to come in and settle down here. No other country does that'"}]
