[{"comment_id":"10152744778310950","commenter_b":"Yeah, the law is very very clear. @webpagelink","commenter_a":"There is no justification for the killing. However, the entire incident could have been avoided if he would have stayed in the car.","post_message":"JUST IN: Newly released dash cam video shows the moments before the deadly police shooting in South Carolina; Walter Scott is seen running from the driver's seat @webpagelink - CBSN"},{"comment_id":"618929588274862","commenter_b":"No one is now or ever has been against immigrants. It is ILLEGAL immigrants who are the issue.","commenter_a":"Republicans so easily forget that we are a nation of immigrants.","post_message":"WOW. Presidents Reagan and Bush Sr. sound an awful lot like Democrats in this 1980 debate... Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153568531759705","commenter_b":"Umm for reals...","commenter_a":"10154509258848856Eva Sellers Uhm, clearly they missed the Jammie era.","post_message":"What's the sexiest decade of sleepwear?"},{"comment_id":"10154333235104726","commenter_b":"So all the gun owners need to boycott Hawaii. See how they do when there money source dries up.","commenter_a":"It's begining","post_message":"Hawaii became the first U.S. state to sign into law a bill requiring all residents who register as gun owners to be placed in a federal criminal records database that monitors them for any crimes committed."},{"comment_id":"10154029521602411","commenter_b":"They why do u live there.? Give them back their land. U r part of the problem apparently","commenter_a":"Why is that something to celebrate? Another way of saying it is that's when the invaders successfully finished off stealing the land of the Potawatomi and Shawnee","post_message":"On December 3, 1818, Illinois became the 21st U.S. state."},{"comment_id":"899984393370316","commenter_b":"Muslims offend me so throw them out","commenter_a":"Perhaps if the Muslims are so unhappy w/ their environment they might want to go home where they won't have to deal w/ such inconveniences. Furthermore, I hope the Smith family doesn't give up their spare lot. I'm so sick of the non-Muslim world walking on egg shells for these folks. I doubt their mother country would give on one issue to accommodate my American, Christian values if I had the misfortune to relocate to their country. Why are we constantly caving to these folks!?","post_message":"Pathetic! (MUST READ)"},{"comment_id":"10152922886022377","commenter_b":"Lock her up and throw away the key!!!","commenter_a":"Her mug shot will be her best picture.","post_message":"Criminal charges coming soon for Hillary Clinton?"}]
