[{"comment_id":"1333566343323648","commenter_b":"this sow could stand to lose a few pounds.","commenter_a":"That pig in the black shirt ought to be able to hang on for quite a while...","post_message":"When it's all over and they have their ethnic studies degrees in hand, these student activists will never be hungry again."},{"comment_id":"10153563067675667","commenter_b":"'@username Americans are seeing the true colors of Democrats. Most are trash that don't pay taxes. They live off the taxpayers!! They riot. They block traffic. They destroy property. They commit the majority of crimes.","commenter_a":"Democratic TRASH. The party of thugs, Illegals and criminals. The trash of America. The more you riot. The more we want Trump 2016!!!","post_message":"At least 35 Trump protesters were arrested in San Diego. @webpagelink"},{"comment_id":"10154409316811336","commenter_b":"I think like all of us Trump thought no this can't be and thus he thought it was a joke! Then reality of course set in and the man thought as we all do who would expect anything different from the Clintons? My question what is next to come it is something every single day?","commenter_a":"Why would Trump think that such a meeting would be just a joke? All of these democrats are capable of any despicable act imaginable! They have proven it over and over again, but all we ever do about it is whine like little punks! obama should be in prison, hillary should be on trial and lynch should be removed and arrested as well! ENOUGH with the beating around the bush! We need to hit them on the head! They need to be punished severely NOW!!!","post_message":"“I'm flabbergasted by it.”  Donald J. Trump reacted to the news that Attorney General Loretta Lynch met privately with former President Bill Clinton amid the DOJ’s investigation into Hillary Clinton’s emails. Full interview tonight at 10p ET."},{"comment_id":"1011840532205809","commenter_b":"She's always been a corrupt liar","commenter_a":"One thing I know, Hillary has always been involved in community service. Go Hillary! ; .)","post_message":"A young man met Hillary at the NewsOne town hall and asked: What did you learn from the Girl Scouts that you would use to be a successful president?"},{"comment_id":"10154028098571336","commenter_b":"Yeah whatever, clueless lady.","commenter_a":"Oh come on....Carson, a very good man, has hardly run much of a campaign. If your campaign can't get traction, it's not someone else's fault!","post_message":"'A culture exists within the Cruz camp that would allow people to take advantage of a situation like this in a very dishonest way. Isn't this the same thing we see with the Obama administration?'  Dr. Ben Carson slammed Ted Cruz's campaign over allegations they told Iowa caucus-goers Carson was planning to leave the race."},{"comment_id":"10153494218169705","commenter_b":"If only we had as much passion directed towards stopping child slave hunters around the world","commenter_a":"Betty is a National Treasure and girlfriend can let loose whenever she wants","post_message":"Betty White has some harsh words for the Minnesota dentist."},{"comment_id":"1811602825768086","commenter_b":"'@username they voted for TRUMP because Hillary is lying criminal that should be locked up","commenter_a":"not surprising.... the KKK IS a dem organization so it makes perfect sense that they would be able to get the uniforms.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
