[{"comment_id":"729302233879236","commenter_b":"@username No, she is insane and a danger to others.","commenter_a":"Dreadlocks existed in Scandinavian, Mediterranean, and Middle Eastern cultures as well. Also, does this make it permissible to confront black women who have straightened or relaxed hair for taking white people's culture? No?","post_message":"\"You're saying that I can't have a hair style because of your culture? Why?\" the man said. \"Because it's my culture,\" the woman said."},{"comment_id":"10154056899827541","commenter_b":"Did you know that one the kkk used to lynch Italians as well?","commenter_a":"All you morons. This is an italian thing. And they are white. Get over it already. Its 2017 almost","post_message":"A high-ranking mob enforcer from Queens told a gambler who owed his boss money he was saved by the color of his skin."},{"comment_id":"10154170781271491","commenter_b":"Oh I bet \"she\" can run alright .. run out of the white house next year take her kids and Obama with \"her\"","commenter_a":"What a beautiful,sane & facts ridden reply !","post_message":"Just because one Obama is preparing to vacate the Oval Office that doesn’t mean everyone in his family has to follow suit."},{"comment_id":"917503514939106","commenter_b":"Shut up bitch","commenter_a":"Surely another upstanding citizen.","post_message":"BREAKING: New police body cam video reveals the disturbing moment a white cop killed Eric Harris, an unarmed black man in Tulsa, Oklahoma. #EricHarris #BlackLivesMatter"},{"comment_id":"1137251062961589","commenter_b":"Hillary Clinton for President!","commenter_a":"Hillary 2016... and trolls in 3.2.1..","post_message":"The 2016 Democratic candidate said that incomes have stalled even as corporate profits have skyrocketed, creating inequality that is \"a drag on our entire economy.\""},{"comment_id":"543745795816000","commenter_b":"We need to start carrying bacon with us and when they disrespect an American Bitch slap them with the bacon.","commenter_a":"Yes,yes! Or send their butts back! We don't want them here!","post_message":"This Fox News reporter was absolutely disrespected by these Muslims. They are out of control. If Muslims are going to live in our country they need to learn some manners. Do you agree Muslims have to assimilate or get out?"},{"comment_id":"1544777802496810","commenter_b":"i smell a rat and it's not trump and his wife. ignore them,","commenter_a":"Are we still talking about this? Oh Glenn, you've lost your way!","post_message":"She has been done a grave disservice by somebody."}]
