[{"comment_id":"1607217966231983","commenter_b":"Both are trash , miley gross she nuts to she better grow up !","commenter_a":"Both are idiots","post_message":"Hillary Clinton and Miley Cyrus are a match made in Hell"},{"comment_id":"10154332100229369","commenter_b":"??????? Seriously? Crooked Hillary. I will never vote for her.","commenter_a":"The headline is B.S. and I do not mean my undergraduate degree. Hillary is brave, intelligent, tested, Democrat, progressive, public servant. Get used to it.","post_message":"Yikes. Now what?"},{"comment_id":"1425850460773794","commenter_b":"She has obviously got a different understanding of Constitutional law than most citizens!","commenter_a":"Please go eat some cyanide soup...","post_message":"She is not fit for public office. Do you agree?"},{"comment_id":"1020979627937496","commenter_b":"@username you shouldn't talk about yourself and Justin that way, asscrack. Ohhh she's not American so her music sucks? You and people like you are the reason this place sucks so much. God forbid you have to hear something that doesn't cater to you! Try really sacrificing for something worthwhile other than greedy politicians and your bank accounts and egos. Half of this country doesn't believe in the armed forces and government any more for good reason. Sacrifice my asshole, you don't know what sacrifice and hardship are until you've been homeless and still given things up for others. You know why people go into the armed services, most of them? They're too fucking lazy and/ or stupid to figure out something else on their own and sheep need the direction of wolves.","commenter_a":"If you've never heard the language before, don't insult and call it gibberish. You're the reason everyone thinks America is full of morons, thanks!","post_message":"People are getting really worked up over \"Work\" for the WRONG reason."},{"comment_id":"1120798904674131","commenter_b":"#NeverCrookedHillary #HillaryTheLiar","commenter_a":"If taxes will pay for it, and I pay taxes, shouldn't this read \"How much money will Hillary's plan cost you?\"","post_message":"Whether you already have student loan debt or you're preparing to go to school, Hillary's college plan can help you save money. Find out how much using our new calculator: hrc.io/2cH4yGX"},{"comment_id":"1513798078640217","commenter_b":"@username Prove that lady!!!!!!","commenter_a":"Obama has publicly said he was born in Kenya so has his tranny wife.... What more do you need ?","post_message":"Donald J. Trump \"has really started his political activity based on this racist lie,\" Hillary Clinton said."},{"comment_id":"1187051574713979","commenter_b":"She don't care why try and make her lower her standards. Melania is a very classy lady and you want her to lower herself and dress down.","commenter_a":"I'm sure she can find another dresser! No big deal!","post_message":"Michelle Obama's favorite designer, a woman who dressed the First Lady for 8 years in a row, just refused to dress Melania Trump. The reason? She isn't tolerant of her despite asking everyone else to be tolerant of her. The self-professed liberal meant to snub the new First Lady -- but she never saw this coming."}]
