[{"comment_id":"1164591366914667","commenter_b":"Texas, enough said.","commenter_a":"Try to keep your vagina in your pants 'Ladies'","post_message":"The closing of safe, clean clinics across the state has brought the back alley abortion back to Texas."},{"comment_id":"1186921104703676","commenter_b":"Graciela Rojas","commenter_a":"Unfucking believeable!","post_message":"WATCH: Shocking police shooting of an unarmed black man attempting to help a suicidal man with autism, caught on camera; the man is now recovering: @webpagelink"},{"comment_id":"10153952322157994","commenter_b":"Stupid young mfs","commenter_a":"#LifeinaPotHole #VOTE #GUNSENSE #VOTE #Hillary2016 #WitchHunt #BroomsUp #BlackLivesMatter #LATINOS #LGBT #WOMANCARD","post_message":"Three teenagers have been charged in the fatal shooting of an 18-year-old at Eastland Mall the day after Christmas."},{"comment_id":"1916222085104197","commenter_b":"I thought Barbie vaginas were that lot marching in London recently lol","commenter_a":"Haha a what can I get a KenCock then in bits ere me like!!!","post_message":"Increasing numbers of women are going under the knife to have a 'Barbie vagina'  as a result of watching internet porn"},{"comment_id":"1269577516395609","commenter_b":"So your saying CO2 is NOT a gas?? Where did you study chemistry?","commenter_a":"If that was gas.... the fireworks would have gone off as soon as the air was saturated enough to be visible.","post_message":"No, that's not fog. It's a gas leak.  @webpagelink"},{"comment_id":"1038817212861551","commenter_b":"My gurl !!!!","commenter_a":"President Hillary Clinton","post_message":"'Don’t let anyone ever tell you that this country isn’t great.' - Michelle Obama delivers an emotional testimony to the greatness of the United States of America. @webpagelink"},{"comment_id":"10156702895000354","commenter_b":"Yeah, poor Oprah. She probably is forced to shop at second hand stores.","commenter_a":"Black women have black privilege","post_message":"Guess how many millions of dollars actress 25-year-old Jennifer Lawrence made in 2015...  *Hint: it's more than you will make in a lifetime--by FAR"}]
