[{"comment_id":"1601162620179200","commenter_b":"Idiot. Build a wall","commenter_a":"Go back to Europe white folks... This is are land","post_message":"We're at a \"wall\" of taco trucks -- a protest in front of Trump International Hotel in Las Vegas ahead of tonight's final presidential debate."},{"comment_id":"1763785047184730","commenter_b":"Nice mouth for a lady?","commenter_a":"and this is supposed to negate every racist, woman hating, derisive thing he's said in the past 9 months???? Fuck off!","post_message":"Do you support Trump?"},{"comment_id":"1058693167521161","commenter_b":"I died a long time ago, no girl cares about me and it's quite clear.","commenter_a":"Telling the women that you Love, that you Love her.","post_message":""},{"comment_id":"1308350412560406","commenter_b":"She looks like a black snowman... Where's her neck..?","commenter_a":"Who cares what this fat cow thinks???","post_message":"Whoopi Runs Her Big Mouth at Mike Pence GETS A BRUTAL RESPONSE! Wow... she should just shut her mouth! Lets get 5000 SHARES if you agree she should be FIRED!!!"},{"comment_id":"10153197495351378","commenter_b":"Why Yall want her to get charged so bad , ..Focus On them Cop killers niggaz","commenter_a":"Thats really strange... Ive never even heard that song!!","post_message":"VIDEO: A woman slammed on her brakes and then stepped out of her car while it was still moving in a bizarre crash caught on a dashboard camera. @webpagelink"},{"comment_id":"1015321351850138","commenter_b":"Obama has been working on changes to second amendment....all we need is more of the same...no way!!!","commenter_a":"Get over it....Hillary wants to take away oil field jobs and our guns too...no way she'll get my vote!","post_message":"\"I say that I will beat her easier than beating some of the people that I've just won [against.]\" Donald J. Trump hit at Hillary Clinton's record and explained why he believes women will vote for him. @webpagelink"},{"comment_id":"10156429465415354","commenter_b":"Whoopi, you dirty looking bitch Those Islamic Muslim women are in danger of being deported Our female population on the other hand is under threat of gang rape and murder by the Islamic Muslim terrorist.","commenter_a":"Moron...","post_message":"WATCH Whoopi unload on Donald Trump..."}]
