[{"comment_id":"10153751332879369","commenter_b":"Ok, and most of those are probably illegal aliens .. lol","commenter_a":"Well there's tens of thousands of people for every Ex-American that leaves. So...bye.","post_message":"Americans are renouncing their citizenship over this."},{"comment_id":"10153439402362550","commenter_b":"How about instead of locking our doors, we teach thieves not to steal?","commenter_a":"How about instead of teaching our girls how not to get raped, we teach our boys to not rape?","post_message":"California high schools are the first in the nation to teach a new form of sex education instead of \"no means no,\" students will learn that \"yes means yes.\" Details here ---> @webpagelink"},{"comment_id":"1289706671107866","commenter_b":"I say fire her ass and let her get her 20 mil from someone else, she isn't worth it.","commenter_a":"#FoxFireMegynKelly! She is no journalist and has to go, help make that happen by signing this petition and sharing! @webpagelink","post_message":"Fox News' Megyn Kelly just got some bad news... after trashing Newt Gingrich in a Tuesday interview over Donald J. Trump, here's what Rupert Murdoch said about the controversial anchor. What do you think should happen to Megyn Kelly?"},{"comment_id":"959266487466433","commenter_b":"O girls have brains too?","commenter_a":"Only frustrated sick person can prefer physical fearure otherwise normal and true men appreciate beauty with brain","post_message":"Men care more about a woman’s brains than her bust, allegedly"},{"comment_id":"1370641286340188","commenter_b":"HE is transitioning. This FEMALE is taking a hormone that naturally occurs in both sexes bud. The hormone treatments are meant to change the development of certain features. Nails, hair, masculine chest, skin tone, fingers etc. Workout drinks for women such as, pre workout, come with testosterone for added boosts. Now, there are specific weight categories to ensure fairness. There is a woman that goes to my gym, I overheard her say she weighs 150lbs. She can bench as much as me. She can squat more than me. It's all about the work and dedication you put into your day and routine.","commenter_a":"Testosterone. Why SHE, shouldn't have been allowed to compete against boys or girls. Period.","post_message":"He didn't back down."},{"comment_id":"10153881891966782","commenter_b":"I think you ladies are missing the point of the story","commenter_a":"Here let me help you pay attention Army=soldier Navy=sailor Marine corps=marines Air force=AIRMAN you're welcome get it straight","post_message":"A Kirtland Air Force Base soldier and his wife are getting a lot of attention for something they posted online. @webpagelink"},{"comment_id":"1680552935568119","commenter_b":"#TrumpIsMyPresident #SendAllIllegalsHome for all American Citizens involved & thanks for all law enforcement","commenter_a":"Okay Obama, this is your last chance to speak against guns... oh wait , guns were not used?! Oh darn it! Well let's start trying to ban knives now too.","post_message":"Officials hold a news conference on The Ohio State University campus attack. @webpagelink"}]
