[{"comment_id":"515532941989754","commenter_b":"She so sickening","commenter_a":"And your high taxes and high minimum wage and Obamacare will put small businesses out of business so just stop. Americans can see through your BS .","post_message":"Hillary went off her rocker today. She is YELLING at voters. Very Bizarre."},{"comment_id":"10153666636726336","commenter_b":"Karen,all illegal immigrants that have committed crimes are to be deported.Whatever that cost we will pay,and happily.Maybe we should take away all the taxpayers dollars we send to all SANCTUARY CITIES! Illegals cost us in a lot of ways.Tax the hell out of anything coming fro Mexico!Fine every employer that hire a illegal immigrants,$20,000 per illegal! There is many ways. You aren't suggesting that we do nothing I hope ILLEGAL IMMIGRATION is really a costly thing for America.They are welcome to apply for CITIZENSHIP or get a legal VISA. No other country does immigration this stupidity why should we. Have a good afternoon Karen,I just looked and saw you husband is from Mexico and so you probably have strong feelings about this.Please just gain citizenship and if you are a citizen,WHO in the world wants to pay for someone who broke the law and cost US a lot .good day","commenter_a":"Don't worry the 30 year old driver will go to Jail and the illegal will be allowed to stay and become a voter.","post_message":"Border Patrol officers near San Diego noticed that the driver, a U.S. citizen, was acting weird, so they used imaging technology to inspect the car."},{"comment_id":"10157253812445725","commenter_b":"#VoteTrump2016 #StopTheEstablishment #ProtectTrump #ImWithYou #MAGA","commenter_a":"We believe!!!! #trump2016","post_message":"IF YOU DO NOT BELIEVE IN YOURSELF- NOBODY WILL! •DJT"},{"comment_id":"804744199625733","commenter_b":"The Progressive white wash is to say \"America did this\" No You Progressives did this!!!","commenter_a":"BOOM!!!!","post_message":"Watch me take down Cenk Uygur from The Young Turks LIVE at Politicon! Cenk should be a little less smug after this debate. #Politicon2016  Learn more about Hillary's America, in theaters on July 22: hillarysamericathemovie.com."},{"comment_id":"10153621551297377","commenter_b":"Crazy ancient old woman.","commenter_a":"ABSOLUTELY SHE WAS OUT OF LINE. Unbecoming and in appropriate from a person in her position.","post_message":"Some are questioning whether Supreme Court Justice Ruth Bader Ginsburg was out of line for criticizing Donald Trump in two recent interviews."},{"comment_id":"10154173925206498","commenter_b":"She'll give birth at 2-3am like most animals do lol","commenter_a":"The guy in an earlier video said it can take hours to days for the birth to happen it is when nature is ready for it.","post_message":"GIRAFFE CAM: April the giraffe is about to give birth. @webpagelink"},{"comment_id":"10153629881103188","commenter_b":"So why aren't the women and children coming instead of all the able bodied young men who destroy things when they get to Europe?","commenter_a":"Wolves in sheep clothing!! Wake up Europe and do not be so naive!! Do not grant any of these people permanent citizenship. Send all able bodied back to Syria to fight for their country!!","post_message":"Millions of fleeing refugees are crashing into Europe like a tsunami."}]
