[{"comment_id":"10156082273560354","commenter_b":"Why in truth is it impossible to build this wall and yet we can send people to the moon???????????????????????????????","commenter_a":"UNIVISION owns Rick Perry now?","post_message":"\"It’s 1,933 miles from Tijuana to El Paso to Brownsville and you’re not going to build a wall on that distance. What you are going to do is...\""},{"comment_id":"539636529560260","commenter_b":"She should be in jail","commenter_a":"NO FU*K YOU liberal artist Abby Martin !","post_message":"Liberal artist slams Chris Kyle with this t-shirt, but that's not even the worst part. This is awful. He was a true patriot who protected our country. Let's show his family our support. Can we get 20,000 'LIKES' for Chris Kyle?"},{"comment_id":"965089543550794","commenter_b":"Sounds like pure jealousy. Cal looks better than some women","commenter_a":"but why do they all have the need to look like hookers?","post_message":"She only realised she was transgender when she dressed up in hot pants and a wig for a joke"},{"comment_id":"488632654671676","commenter_b":"55555","commenter_a":"Nonthawat Ford Focus @username","post_message":"Watch this T-Rex own ‘American Ninja Warrior.’"},{"comment_id":"10152998620161770","commenter_b":"She is a liar and cheat .","commenter_a":"That's because thousands of us protested on how the media thinks they can determine who they want on stage and trying to push there own agenda.. This was the absolute right decision on CNN behalf.. Remember CNN, ABC, fox, and the rest of the media scum that keeps trying make decisions on who can and can't be in any presidential debate.. All candidates should be allowed on stage..","post_message":"Carly Fiorina will join the other GOP candidates on CNN's debate stage."},{"comment_id":"10153349233138855","commenter_b":"When are they just going to go in with hand cuffs and arrest this ##%!% non law abiding public servant? Enough already! Find a new freaking job in the private sector. Chick Fil A, Hobby Lobby, would embrace her tenacity...","commenter_a":"SHe works for the government FIRED her. If she were in the service and disobeyed an order she would be court martialed. FIRED HER NOW!","post_message":"But, she's the one being persecuted. Right?"},{"comment_id":"10153127710904726","commenter_b":"This woman is as stupid as she is ugly!","commenter_a":"Brilliant question.","post_message":"WATCH: State Department is called out: Why Have Russian Hackers Seen More Emails Than American Public?"}]
