[{"comment_id":"10154552857806955","commenter_b":"How is Hillary performing vs. Obama?","commenter_a":"This is it America. This is our last chance, the alternatives are most unsettling.","post_message":"FLORIDA SHOCK: TRUMP OUTPERFORMS ROMNEY BY 130,000 IN EARLY VOTING!"},{"comment_id":"10150832975979963","commenter_b":"Something tells me that the Bulletin of Atomic Scientists probably knows more about \"international nuclear weapons relations\" than you do.","commenter_a":"Anyone who thinks that this is \"Trumps fault\" doesn't know much about international nuclear weapons relations and the money exchange that goes with it, be it legal or not. Trump wasn't president then....","post_message":"According to the Doomsday Clock there's an increasing probability that the world will observe nuclear conflict."},{"comment_id":"10150600601724999","commenter_b":"A woman is whatever she wants to be. That's kinda the point of feminism.","commenter_a":"For a group - women - who have been arguing for decades that they shouldn't be reduced to their reproductive organs so they can have more opportunities in life that have NOTHING to do reproduction, it's pretty ironic when those same people say someone can't be a woman because she doesn't have the proper bits or experiences with those bits.","post_message":"People who haven’t lived their whole lives as women shouldn’t get to define us. Read on in The New York Times Opinion."},{"comment_id":"10153170586384255","commenter_b":"Yay!! We already have enough leaking pipelines crisscrossing America...","commenter_a":"Eight treacherous Democrats. They should have to fight for their seat sin primaries.","post_message":"As expected."},{"comment_id":"10154360980241336","commenter_b":"I would rather see the winner of the Miss USA pageant as president than that nasty skank Hillary","commenter_a":"That's because most Miss USA contestants are a whole lot smarter than Hillary.","post_message":"Thoughts?"},{"comment_id":"10153356970249087","commenter_b":"#EndOurFreedom #KeepUsSafe","commenter_a":"There is no way to defend against terrorist attacks in a free society and have any freedoms left. Even a cop on every corner checking ID's and frisking people won't stop them.","post_message":"Former police commissioner Howard Safir said the terrorists in Paris changed the dynamic when they \"picked a local restaurant, they picked a theater\" instead of heading for iconic targets like the Eiffel Tower or the Louvre."},{"comment_id":"10154047914259740","commenter_b":"Prayers for him and his family and all the law enforcement.","commenter_a":"Prayers for the officers","post_message":"The officer was shot Saturday morning while investigating a report of a break-in."}]
