[{"comment_id":"10154037878823984","commenter_b":"Mr. Trump from the time he started his campaign he has always states that all the illegals have to go back have to go back to Mexico and Central America but yet he is one of the largest employers in the Real Estate , Casinos , Hotels, and Golf Courses business, has bragged about hiring illegals to including his contractors and subcontractors and they love him 1. did he use e-verification to see if he or his contractors and subs to see if they had a work permit or they are who they say they are. 2. you claim you want to help the veterans but your company hires more illegals than vets. 3. if you are serious about what you are campaigning on why not be the first to fire or dismiss the illegal aliens and fill those jobs with veterans lead by example and make America great again ...","commenter_a":"Yup another lifer. GET RID OF POLITICAL LIFERS THAT ARE FEATHER BEDDING Stump for Trump. You Go Don, Go Don all the way to the WHITE HOUSE.","post_message":"Wow. The governor of Iowa is actively working against one of the GOP's most popular presidential candidates. This is very unusual for the Iowa caucus... the Iowa governor must feel very strongly about this.  Do you agree with the Iowa Gov.?"},{"comment_id":"10155198682596002","commenter_b":"Sad now she is looking like a joke.","commenter_a":"I still remember Hillary as 1st lady saying stand by your man.","post_message":"What do you think of her statements?"},{"comment_id":"1035142053187556","commenter_b":"Either sit quietly or shoot em. Dont bitch until they get pissed to","commenter_a":"I know the cops were doing wrong but for fuck sake shut your damn mouths and calm down and shit wouldn't escalate","post_message":"WTF! Just because they \"smelled marijuana\"??? Full story here: @webpagelink"},{"comment_id":"1244894375530590","commenter_b":"all the illegals are not accounted for, so this is false!!!","commenter_a":"Hope it's true","post_message":"There was one big reason for leaving."},{"comment_id":"1040060042672919","commenter_b":"This is BS, she just knocks the baby down with her & don't care. Stupid lil witch!!!!!!!","commenter_a":"OMG!!! ANIMALS!","post_message":"Life in Obama's America  Disturbing video of a white woman (holding her baby) being attacked by blacks, as blacks film and laugh at the attack."},{"comment_id":"1212963008739156","commenter_b":"Will you force women to wear less since less is \"liberating\"? What gives you the right to choose for anyone? What's next? Fat people can't wear bathing suits? Pretty girls have to wear short skirts? No one... NO ONE has the right to decide what someone wears. Change laws to promote freedom. Let them choose. Don't choose for them. Clothing doesn't oppress any more than guns shoot people. People oppress. Change that.","commenter_a":"It oppresses women. Before everyone says it's s their religion, it was taught to them by a man. And yes all religions use other ways to oppress women that should stop as well. I always find it odd that people champion the right form them to \"choose \" what oppression the want to follow.","post_message":"A new country is debating banning burqas."},{"comment_id":"10154912048588128","commenter_b":"... so now that the republican congress has a republican president, can they start paying down the national debt now? :)","commenter_a":"We need to fight Islamic terrorists and China. Congrats Trump! Let's make America great again. With Love, From India. We are also celebrating in Delhi for your victory!","post_message":"President-elect Donald Trump will likely get the chance to fill the Supreme Court vacancy created by the death of Justice Antonin Scalia, and could have the chance to tilt the balance of the court more solidly conservative for decades if other justices retire."}]
