[{"comment_id":"10155444032526509","commenter_b":"@username Hillary is a good start then! She devil in the flesh you're so smart","commenter_a":"How quickly we forget! If you over 35, take a walk with me down memory laneyou won believe what you have forgotten. If you under 35, read onI promise you that you will be amazed at what you missed! (By the way, sadly, this isn a joke. I wish it was.) REMEMBER WHEN BILL CLINTON WAS PRESIDENT? (January 20, 1993 to January 20, 2001two terms) When Bill Clinton was president, he allowed Hillary to assume authority over an attempt to reform health care. Her proposed plan was so bad that many Democrats came up with competing plans of their own in protest, and in spite of threats and intimidation, on September 26, 1994, the bill was declared dead. This fiasco cost the American taxpayers about $13 million for studies, promotion, and other efforts. Then, President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were ...","post_message":"The Donald J. Trump campaign issued a statement denying all the allegations, saying the reports were politically motivated."},{"comment_id":"639206099603302","commenter_b":"trump chooses palin for vp he loses my vote pay attention america to this family","commenter_a":"why would a person with any common sense support ANY ONE who assaults anohter person? that does not even make good sense. no matter why she assaulted the other person, you do not strike another person. she could have just left the party if she was offended by something said. it was a crime.. crimes are punishable by arrest and payment for that crime no matter who you are.","post_message":"Bristol Palin is in trouble with the law after this incident at a party.  We need to show Bristol our full support. We support her and the entire Palin family.  Do you support Bristol Palin?"},{"comment_id":"1263844570323065","commenter_b":"yep. Sobbing now.","commenter_a":"Started crying before I even opened the article","post_message":"These Holocaust survivors just regained a lost part of their childhood. - Jon Comulada"},{"comment_id":"1069935306362850","commenter_b":"Wooh, I guess different strokes for...that's one ugly woman","commenter_a":"Carly not bad to the eye that's all","post_message":"Carly ROASTED Hillary over her email scandal!  Watch her sound off."},{"comment_id":"849061198475049","commenter_b":"She wants no part of it. Very wise classy lady.","commenter_a":"Condoleezza for President, she'd make a wonderful one. Outstanding human, patriotic, religious.......intelligent, classy. She has much more quality than Hillary any day.","post_message":"Just beautiful. I didn't even know Condi was a musician..."},{"comment_id":"10153700162853010","commenter_b":"By bring them here ,you are taking food out of the mouth of those poor people.","commenter_a":"Don't we have enough ,dogs here..","post_message":"The Humane Society International has apparently taken possession of more than 100 dogs from a South Korean farmer in recent months, paying the farmer to transition to other crops."},{"comment_id":"10154341383138067","commenter_b":"yeah,I think it is a great idea because Arnold make America ruined again and Donald make Apprentice again","commenter_a":"Publicity stunt. Stay tuned America","post_message":""}]
