[{"comment_id":"10154005218489749","commenter_b":"@username fool","commenter_a":"Galloway is a racist..anti-semite...he needs to be thrown out of any meeting of decent minds.","post_message":"\"This has ruined this evening, as far as I am concerned, it's disgusting,\" one angry attendee said."},{"comment_id":"10153440735091130","commenter_b":"We don't want to hear any more about this ugly, perverted, faggot drag queen.","commenter_a":"Done w Huff Post","post_message":"Stunning!"},{"comment_id":"591571124359879","commenter_b":"@username : Educate yourself on the economy No wall it would cost over 530 billion in trade between US and Mexico costing over a million lost jobs in US alone and cause more than 3 states to go bankrupt. You may get a new fortified entry program but no wall.","commenter_a":"Trump failure to get Mexico to back down makes him look like the man who can't makes deals even with friends instead He was laid out and embarrassed by President Nieto of Mexico right from the beginning when they talked about the wall and was told Nexico would not pay for the wall , Nieto put Trump in his place so bad that Trump said they did not talk about payment of the wall . Trump was so embarrassed that on his flight back to US he changed his speech for the Arizona rally . This is a sign of a Man who can't control his emotions and would and could lead us into a Nuclear War .","post_message":"Government access and favors will no longer be for sale, and important email records will no longer be deleted and digitally altered! -DJT"},{"comment_id":"904212379645518","commenter_b":"These thugs and hoodlums should be arrested .","commenter_a":"Thugs","post_message":"He Wasn't Ready!"},{"comment_id":"10155495328191509","commenter_b":"@username you should be ashamed voting a criminal!!!","commenter_a":"Could we think less of him? Really, he's been in the public eye for 30 years. We know what he is and she is. I'm not voting for a person. I am voting for the economy, the Supreme court, and the best chance for the US.","post_message":"Garry Kasparov suggested that the Russians could possess information on Donald J. Trump that is at least as damaging as WikiLeaks releases have been for Hillary Clinton."},{"comment_id":"10153183843753188","commenter_b":"Boy if they can do all that in Mexico why are they crossing our borders","commenter_a":"i just came home to Seattle from 10 days in Mexico and it made me think. I think it would be better to be in a country like Mexico if the world went crazy. Those people know how to survive on nothing because they have done it all their lives. They know what to do when the lights go out... they know how to grow food and take care of themselves. I can't even imagine what Seattle would be like if this area was thrown into the same poverty level as Mexico... it would be a mad house!!!","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"1581294075496417","commenter_b":"Kiss my white ass","commenter_a":"If we give them reparations will they go to school and get a job and stop whining?","post_message":"BREAKING: Obama Just Announced That He Will Be Forcing You To Compensate Blacks For Slavery. Never in a million years. That is old history. Will you compensate blacks for slavery?"}]
