[{"comment_id":"10155754872529778","commenter_b":"@username The more educated? Ooookay... Silly. Smh They're out there marching for you too. Remember that, girlfriend.","commenter_a":"@username Wow look at these comments. Even from women... Ignorant people... This country is in trouble.","post_message":"Ashley Judd says blood on your pants is a sign you're a woman. FULL SPEECH: @webpagelink MORE: @webpagelink"},{"comment_id":"10156331517060725","commenter_b":"hurry up become our president and get rid of these thugs","commenter_a":"A Muslim is one born to a Muslim father who takes on his or her parents' confessional identity without necessarily subscribing to the beliefs and practices associated with the faith. In non-Muslim societies, such Muslims may subscribe to, and be vested with, secular identities. Reminder: Obama father was a Kenyan born muslim. ----- al-Taqiyya: deception; the islamic word for concealing or disguising one beliefs, convictions, ideas, feelings, opinions, and/or strategies. Islam Permits Lying to Deceive Unbelievers and Bring World Domination! Muslims lie when it is in their interest to do so and will not hold them accountable for lying when it is beneficial to the cause of Islam. They can lie without any guilt or fear of accountability or retribution. A lie in the defense of Islam is approved even applauded in their books.","post_message":"Under our President, ISIS is gaining great strength."},{"comment_id":"10152685223867894","commenter_b":"That Bitch Messy Asl !!","commenter_a":"Tameka Lovinglife Mccraney These Celebrity Couples And Exes Are So Messy Lol","post_message":"Naya Rivera Announces Her Pregnancy on the Same Day as Big Sean's Album Release [Photos]"},{"comment_id":"10150715134694999","commenter_b":"@username Illegal immigrants steal roughly 9 billion dollars worth of resources reserved for American citizens every year. Deporting them per our existing laws will save us a ton of money...any more brain busters?","commenter_a":"What's even more appalling is that he's polling at 39% of Republican + Republican-leaning registered voters in the latest CNN poll. ...What does this say about our country and how folks want our supposed leaders to behave? What is this acceptance of ongoing crass commentary? ...And what happened to equanimity and professionalism?","post_message":"Donald J. Trump called Hillary Clinton's mid-debate bathroom break \"disgusting.\" Frank Bruni says it's \"the rare man-child who finds that worthy of ridicule.\"  Read on in The New York Times Opinion Section."},{"comment_id":"10150659306454999","commenter_b":"@username ..her lips not legs","commenter_a":"She is right, raising your arms doesn't mean a lot. Her getting multiple corporate donations to sway the way she passes bills does. U.S. Senator Bernie Sanders pointing out that every other politician does the same thing, and he is attempting to change the precedent does. What a lame attack from Clinton. This just made my opinion of her lower, not raise.","post_message":"Hillary Clinton also said that the candidacy of Donald J. Trump was a \"bad development for our American political system.\""},{"comment_id":"10153746116545326","commenter_b":"@username I'm still waiting for the tons of stepford wives to come.","commenter_a":"Lots of bitterness coming from the Sanders.","post_message":""},{"comment_id":"10154707923201800","commenter_b":"hahahah omg yes!","commenter_a":"Now we're fucked. Like the Civil War and the Civil Rights Movement, this is yet another horrible scar on our nation. The damage was already done, and now it's just worse. I seriously hope our younger generations, myself included, can fix this within our lifetime. Shame on all of you who made this happen.","post_message":"Ready for either outcome. Tune-in to our LIVE Election Special tonight at 11/10c! #election2016"}]
