[{"comment_id":"10155131143925389","commenter_b":"Can't deport an American born stupid","commenter_a":"In a Court of law your reporting would be \" hear say \" Sean","post_message":"One of the two brothers suspected of gunning down 12 people in Wednesday’s attack in Paris traveled to Yemen in 2011, where he was in touch with Al Qaeda training camp leaders, U.S. officials told Fox News."},{"comment_id":"10157180953385389","commenter_b":"she's a waste of skin!","commenter_a":"Oh, that was an Economic Speech. I did not hear anything of her plans for the economy but she was well studied on what she thought Donald J. Trump might do. Why will she not tell us her own plans?","post_message":""},{"comment_id":"10155018398498258","commenter_b":"Who cares She is not that important anyway","commenter_a":"When they go low , we go high","post_message":"Congresswoman Katherine Clark is breaking from tradition to protest Donald J. Trump by boycotting his inauguration."},{"comment_id":"10154438861719726","commenter_b":"While I can understand the basis for some of these observations, the main thing I firmly believe is that perhaps just over half the Democrats who actually voted for Obama in the last election will turn out to vote this cycle. I do not see near the support, energy, emotion, or urgency that I saw in the last two Obama campaigns, and lets be honest here folks... Hillary Clinton IS NOT barak obama. She does not have the well-oiled campaign machine Obama had. All she has is a character-assassination campaign, that's it, and it's exactly what I expected from her too. It honestly would not surprise me if Trump carried a lot of the swing states simply because democrat voters know she's a damaged candidate. Add to that that about half of the Democrat voter bloc in play this cycle was Bernie Sanders supporters of which many of them won't ...","commenter_a":"HIllary doesn't want to talk about the issues because she has no plans except what Obama has told her to say.","post_message":"This is the strategy Trump can use to defeat Clinton:"},{"comment_id":"543574859135802","commenter_b":"Those dang Muslims and their transgender bathrooms...","commenter_a":"No fucking way my child would ever be placed in a school where boys could come into a bathroom with her..fuck is wrong with people?i am SOOOO glad To live in Kentucky these days..in all honesty I've always hated it here but at least my state doesn't go for all this liberal,homo,Muslim bullshit..","post_message":"What can only be described as an absolute shitstorm."},{"comment_id":"10155862004711038","commenter_b":"That is impossible. Teenage girls take up the entire bathroom so you can't share it with them.","commenter_a":"Yeah, teenage boys are gross...but have you ever shared a bathroom with a teenage girl? It's fucking nasty.","post_message":"You love him, of course, but COME ON."},{"comment_id":"587553231404572","commenter_b":"Obama is putting up a higher fence around the white house this summer because people keep climbing it!!!! what about our borders?? WE NEED A WALL!!! WE NEED DONALD TRUMP NOW...","commenter_a":"You don't need a political decoder ring to understand Donald Trump he's a straight talker who speaks from the heart who's the only true outsider funding his own campaign and he's set the agenda on everything that matters. Indiana show your support and get out and vote Donald Trump for the republican nominee. If your standing with Trump your standing FOR America! TRUMP NATION 2016! # never lyin ted!","post_message":"I will not let you down. Lets MAKE AMERICA GREAT AGAIN!"}]
