[{"comment_id":"1009004349187234","commenter_b":"first she needs to be a lady","commenter_a":"Watch out she will pick your pocket ...","post_message":"Michelle Obama Invites Muslim Refugee To Sit With Her At State Of The Union  She should invite a soldier who fought for our country. This is ridiculous.  Do you think Michelle Obama is the worst first lady ever?"},{"comment_id":"1499235536803237","commenter_b":"Oh I am pissed, then the ones that need help, can not get it. And that lazy ass gets everything for free and that for 15 years. They should tell her to get her ass out and work, and stop spreading her legs.","commenter_a":"parasites","post_message":"Are you angry yet? Just listen to what she has to say about it!"},{"comment_id":"1603818663247762","commenter_b":"The Lying Queen","commenter_a":"The Clinton Crime family song Dirty deeds done dirt cheap AC/ DC Clinton Crime family song","post_message":"WATCH: Hillary Clinton news conference on FBI investigation."},{"comment_id":"10156410898495725","commenter_b":"@username he does not have to insult Hillary's looks. She does a good job of insulting herself.","commenter_a":"I would love to watch Donald Trump debate Hillary Clinton! He will tear her a new one!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"},{"comment_id":"10153524909826130","commenter_b":"If Trump had his way Muslims wouldn't be aloud to return if they left the states either.","commenter_a":"Muslim terrorist kills Americans again and liberals continue to make excuses for Muslim terrorist. Over 3,000 killed on 9/11, more than at Pearl Harbor , Fort Hood Muslim terrorist killed many, Muslim Boston pressure cooker bomber mangled several, Muslim husband and wife kills several in Ca. Liberals seems to love Muslim terrorist. Muslim terrorist cuts heads off reporters and airs the videos, Muslim terrorist throws homosexuals off roof tops, Muslim terrorist drown people in a cage, Muslim terrorist burns people alive.","post_message":"Donald J. Trump says he doesn't know any Muslim athletes, but these photos say otherwise."},{"comment_id":"10153717565963812","commenter_b":"Your stupid azz obviously don't have kids... More in like you don't need them you ignorant jerk","commenter_a":"Still a criminal","post_message":"Man accused of robbing a credit union told police he needed the money to help pay for his 1-year-old daughter's chemotherapy treatments. \"I guess it was desperation.\""},{"comment_id":"1023152674374447","commenter_b":"This woman is nuts","commenter_a":"She's dumber than a rock.","post_message":"We asked the DNC Chair if her children were human before they were born. She gave a shocking answer..."}]
