[{"comment_id":"10156383221255354","commenter_b":"I can face God and not fear my fate if all muslims are eradicated from the earth. This is only the first of many attacks and I feel not a single muslim can be trusted. Call it racism, call it profiling or plain ol fashion hatred but they all are the enemy to the rest of us and their death is our only option.","commenter_a":"War involves two sides! Until we realize the Muslims are at war with us, we will continue to lose!","post_message":"\"This is war.\""},{"comment_id":"10154292764041162","commenter_b":"No Theresa but implying that passing through narrow corridors and jumping fences is the only way immigrants \"cross the border\" is just idiotic. Again, not all undocumented immigrants \"jumped fences & crossed the desert\". Many overstay visas, meaning they went through a border check-point.","commenter_a":"\"I felt like I was crossing the border!\" Best line ever!!!","post_message":"WATCH: Trump comments on entering convention surrounded by protesters. \"It felt like I was crossing the border.\" @webpagelink"},{"comment_id":"944371082289036","commenter_b":"pig stupid bitch","commenter_a":"ass","post_message":"Conservatives really are the worst kind of people."},{"comment_id":"624507887756570","commenter_b":"She's a globalist evil one","commenter_a":"Obama don't put the flag on either!!","post_message":"Did you notice THIS?!?!"},{"comment_id":"1087968054553877","commenter_b":"your e next president!","commenter_a":"Sic'em Bernie !","post_message":""},{"comment_id":"10153342473651336","commenter_b":"The girl was mouthing off and ignoring him when he said get the hell away, if that was my daughter I'd slap the taste out her mouth, she wouldn't even have to worry about the cop.","commenter_a":"These cops are constantly thrown into situations where there are multiple combative people and ONE officer. Was he in the right or wrong? I don't know, but cops are constantly put in these dangerous positions as a part of their job.","post_message":"The video appears to show the officer using his knees to pin the girl face down, pointing his gun at other teens and cursing."},{"comment_id":"10154936291493088","commenter_b":"> I don't know why it's impossible to believe it will happen again. Shane Those that are better informed than you are agreeing on this, big time, using measurements, not belief. You can't use your logic&belief on things that have happened over millions of years with this, that has happened over a range of 50 years. Keep reading up on this because you're getting very close.","commenter_a":"While I won't support any of Donald's nominations, I think climate change has always been around, long long before humans. And much longer still before the industrial era. The earth has been a waste land before, and it's also been a water world. I don't know why it's impossible to believe it will happen again.","post_message":"I will vote NO on the nominations of Scott Pruitt to be EPA Administrator and Rick Perry to be Secretary of Energy. The scientific community is virtually unanimous. Climate change is real, it is caused by human activity and it is already causing devastating problems in this country and around the world. We need an EPA Administrator and a Secretary of Energy who are prepared to stand up to the fossil fuel industry and their short term profits, and lead the fight to transform our energy system away from fossil fuels to energy efficiency and sustainable energies. In discussing these issues with Mr. Pruitt and Mr. Perry I found no evidence to believe that they are prepared to do that."}]
