[{"comment_id":"10157076549400354","commenter_b":"Does the rules say you can steal another candidates votes like he did with Ben Carson?","commenter_a":"Cruz is playing by the rules...PERIOD. Elections have been done this way your entire life. There is nothing different from other elections, with the exception of a whiny, sniveling, jealous loudmouth. Too bad Trump hasn't been paying attention to the rules.","post_message":"'Ted Cruz has no chance of winning this without bribing the delegates. That’s his game at this point. He’s mathematically eliminated....'  WATCH:"},{"comment_id":"1262038440498279","commenter_b":"I don't. Some women do.","commenter_a":"As a man, I have to ask, what is it that you women want from me? More of my money in divorce court? You want me to stop holding the door open for you? Maybe I should stop fixing your car or the plumbing in your home. In combat, maybe you should 'take the point,' would that make you happy? Centuries have passed since Adam & Eve and the world is still asking, 'what do women want.?'","post_message":"Huge crowds are marching worldwide for women's rights."},{"comment_id":"826344630889447","commenter_b":"We are sick and ;tierd of feeding these lazy women who just keep laying on their backs , letting free loaders get them Pregnant. We need to sterilize these women. We should pay to get them sterilized.","commenter_a":"Get a JOB, leeches.","post_message":"They are losing it. That's what happens when you mooch for your entire life.  Do you think this was a long time coming?"},{"comment_id":"1354400067935066","commenter_b":"Just try it you fucking bitch! Just try it!","commenter_a":"PRESIDENT TRUMP, PRESIDENT TRUMP, PRESIDENT TRUMP!!!! WE THE PEOPLE SAID SO!","post_message":"Discuss.   SHARE THIS and FOLLOW US at Reverb Press and Stories That Resonate for progressive news and opinion that you can trust."},{"comment_id":"10153677801340530","commenter_b":"Wow dicks can talk. .","commenter_a":"But, the SCOTUS said there is no racism in America.","post_message":"Community and city leaders are strongly condemning a racist flyer against blacks that was circulated in Southfield tied to an upcoming mayoral election."},{"comment_id":"10154164610665796","commenter_b":"These people aren't here illegally...","commenter_a":"they dont need our help if there illegal except for a plane ride back to were they came from so they can do it the right way","post_message":"The state plans to end its part in the resettlement of refugees, who have fled war or persecution, on March 4.   The full responsibility for resettling refugees and overseeing federal money for refugee services is expected to shift to Catholic Charities Maine."},{"comment_id":"842653202518126","commenter_b":"Let them go to hell","commenter_a":"Bunch of Stinky Asses","post_message":"In Obamaland... Islam rules. @webpagelink"}]
