[{"comment_id":"10153727550292300","commenter_b":"Go naked girl! Again and again!","commenter_a":"South beach is super ghetto now.","post_message":"In video taken by witnesses and posted on a website where it went viral, Angelic Valle is completely naked when she “placed a steel chair leg into her buttocks,” according to the police report."},{"comment_id":"10153472198206336","commenter_b":"She is sick!!","commenter_a":"I don't even know who she is; and if I was that bakery, I would sue her butt of, instead of letting her get away with that and having my rating dropped because of it!","post_message":"The California bakery was downgraded to a B rating after a video revealed that Ariana Grande had licked doughnuts in the store."},{"comment_id":"10153171021535950","commenter_b":"she gave him head while the lieing bitch watched and then joined in!","commenter_a":"From many people that know them personally, he has a few girlfriends. One in Canada. It's a marriage for show only.","post_message":"The United States' ultimate political power couple, Bill and Hillary Clinton, celebrate 40 years of marriage today. Their marriage certainly hasn't been all smooth sailing..."},{"comment_id":"936091029833983","commenter_b":"Shut up LIBTARDS","commenter_a":"Trump 2016.","post_message":"We have a message for Donald J. Trump: We're going to do everything we can to make sure you never become president. Sign this letter if you agree: hrc.io/2aaJYl5"},{"comment_id":"1158142194215832","commenter_b":"aw poor huntsman","commenter_a":"Sergio Andrade Sergio Andrade Vergara Gisella Casillas","post_message":"A good reason to always flush the toilet.  Barry Morrissey captured video of a Huntsman spider hiding in a toilet bowl in Australia.  The video has been viewed more than 30-million times around the world."},{"comment_id":"741809245917684","commenter_b":"THOSE 3 BITCHES...ARE GETTING THE SHIT GANG BANGED OUT OF THEM NOW.","commenter_a":"IS is recruiting sluts for sex only son","post_message":"Aqsa Mahmood, 20, left her home in Glasgow in 2013, and married an IS militant in Syria."},{"comment_id":"10153808886723984","commenter_b":"Idiot bitches","commenter_a":"You just GO Ben!","post_message":"Wow! You don't see Dr. Ben Carson get this fired up too often, but  he sure wasn't taking any of Whoopi Goldberg and Joy Behar's nonsense.  Do you stand with Ben Carson despite the constant attacks from the mainstream media?"}]
