[{"comment_id":"1676201889329258","commenter_b":"This is old news, these slimy pieces of shit should be behind bars!","commenter_a":"How is that a bombshell...? The whole thing was fishy from the beginning. It's like I fully expect more shit to come out about the Wall Street Bailout...","post_message":"They lied to us anyway."},{"comment_id":"1115505231842557","commenter_b":"Because there are so many foreigners in London working illegally, they can't keep up!!","commenter_a":"They shouldn't be allowed to operate, they're all rip off merchants on benefits, why does tfl turn a blind eye.","post_message":"'How do you charge £600 for half-an-hour?'"},{"comment_id":"10153560917566615","commenter_b":"Get off of here Martha","commenter_a":"Who cares he got away with rape.","post_message":"WELCOME TO STEELERS NATION, BABY BODIE!  The newest addition to the family of The Pittsburgh Steelers QB Ben Roethlisberger is right along side the rest of the City of Champions tonight, cheering on the Pittsburgh Penguins to a Game 7 win! LET'S GO PENS!  (Photos courtesy of Ben Roethlisberger - BigBen7.com)"},{"comment_id":"507758516015518","commenter_b":"She is illegal","commenter_a":"'@username 2016!!! LETS PUT THIS BEAUTIFUL LADY IN THE WHITE HOUSE!!!","post_message":"Very proud of our next First Lady Melania Trump! #MakeAmericaSafeAgain"},{"comment_id":"10153070035530399","commenter_b":"I thought I saw this woman at Hooters the other night. That's always been a good source of Broadcast talent for Faux.","commenter_a":"Just a new way for the Dummycrats to steal more votes!!!!!!!!!!!!!!!!!","post_message":"It's always Andrea Tantaros."},{"comment_id":"10154001175786336","commenter_b":"She should be held to the same standards as men. Clearly she thought that since she's a 100lbs 5'0 female she should get away with it. She should be held to even higher standards because she is a doctor.... For now at least","commenter_a":"Don't complain about equality between the sexes as long as your OK with women not being held accountable for their actions. A man would be in jail right, now where she belongs. We giggle when women break the law and demand justice when men do the same thing.","post_message":"The confrontation reportedly began when the woman got into the Uber car without a reservation."},{"comment_id":"10155064838244497","commenter_b":"Cankles, in Hillary's case","commenter_a":"Mike Pence is worried that those shameless hussies will show a flash of their ankles during the march.","post_message":"'I can tell you how let down I feel by the heads of these households who did not simply give their wives and daughters a firm, decisive  when they asked to participate in today demonstration.'"}]
