[{"comment_id":"1128228853905897","commenter_b":"EXECUTE the QUEER ----NOW !!before this poor girl is DEAD from being RAPED by this SUBHUMAN PR*CK !!!","commenter_a":"Discusting pervert","post_message":"DISGUSTING! Muslim Migrant Men Pose with Pre-Teen Non-Muslim Girlfriends on Social Media! Obama wants these perverts in your neighborhood!"},{"comment_id":"967042846696781","commenter_b":"No. Smokers gotta find their own way outta hell...not on my tax dollar tganks!","commenter_a":"If you really want to quit smoking you can afford to buy it as cigarettes cost a fortune, put the money to better use","post_message":"Controversial..."},{"comment_id":"10152609562277452","commenter_b":"Can you believe woman these days","commenter_a":"Wtf Hurray for this man.. bless his heart, and for a better woman to come to them..","post_message":"After a father refused to give up his newborn son, who was born with Down syndrome, the mother left both of them. abc7.la/1DEs3a0"},{"comment_id":"10153368767146694","commenter_b":"Those were not feminists, those were trolls.","commenter_a":"Meh to all the feminist crying. If you hate her characterization, you don't have to force the entire female gender into the issue. Also, the action figure industry is asinine. See how it screwed over Green Lantern TAS and Young Justice.","post_message":"Let's talk about The Avengers' Black Widow problem."},{"comment_id":"1062665507148980","commenter_b":"Scum","commenter_a":"They are a terrorist group and should all be locked up.","post_message":"Black Lives Matter Takes to Twitter to Celebrate the Slaughter of Baton Rouge Police. Here are Their Sick and Disturbing Tweets..."},{"comment_id":"10154113063315950","commenter_b":"@username wrong. Polls showed Hillary winning the ELECTORAL vote. Wanna try again delusional one? #ShesNotYourPresidentAndNeverWillBe #GetOverIt #SoreLoser","commenter_a":"Polls Smolls! Haven't we learn anything when it comes to \"polls\"?! Bwhahahaha!","post_message":"Barack Obama has a 50 percent approval rating heading into his final months in office, a new poll found Monday."},{"comment_id":"1039200399433046","commenter_b":"What were her parents thinking? I never left either of my children unattended in a car. That could have killed their most precious thing in the world. It is crazy to leave your child unattended in a car at such a tender age. I applaud the rescuers.","commenter_a":"Stupid people shouldn't breed.","post_message":"HOT CAR TODDLER RESCUE>> From Michelle Millman: This just breaks my heart for this little girl trapped in a hot car. A woman broke a car's window in Kansas after seeing a toddler trapped inside. Police say a couple left the girl while they shopped! Sadly, the woman says the parents seemed to care only about the damaged car."}]
