[{"comment_id":"10153641179393132","commenter_b":"I agree. She's a scam artist. But other women don't think women do that apparently...","commenter_a":"This woman is a monster in female skin. Let me generalize by saying that she makes you all look bad.","post_message":"\"He thought he owned her.\""},{"comment_id":"10150620952809999","commenter_b":"You people don't get it. Keep sticking your heads in the sand. You focus on what he says and not what Hillary has done","commenter_a":"Dump Trump.","post_message":"The P.G.A. became the first major golf organization to pull an event from one of Donald J. Trump's properties in response to his comments about Mexican immigrants."},{"comment_id":"10153149176726636","commenter_b":"Shocking. She should be able to speak openly about her experiences with hardline muslims. Censorship at a students union is about as bad as it gets, but it does not surprise me given the 'right on' nature of some idealistic fools in the student world.","commenter_a":"And the pandering to the nasty ideology goes on, unfortunately!","post_message":"'They’re basically labelling me a racist'"},{"comment_id":"525940174197243","commenter_b":"And that is why we need to vote for Trump...with Cruz you will get an open southern border and amnesty.","commenter_a":"No vote for Cruz, he is a politician, just cannot trust politicians democrat or republican. Politicians will tell you anything to get you to vote for them, they get into office and do not follow thru.","post_message":"Agree or disagree?"},{"comment_id":"1025513424232102","commenter_b":"THAT BITCH NEVER HAD A MIND","commenter_a":"Who's gives a fling f--k what these assholes say .nobody watches that so called show anyway.get ready to pack bitch","post_message":"I think I can see steam coming from her ears! @webpagelink"},{"comment_id":"10154354422615950","commenter_b":"$400,000 a day for Melania to stay in NYC.","commenter_a":"Two weekends in a row out of three weeks in office we've flown him to Florida. Where is the Republican outrage?","post_message":"On Saturday, President Donald J. Trump is hosting Japanese Prime Minister Shinzo Abe at his resort in West Palm Beach."},{"comment_id":"517019608487085","commenter_b":"Hell no, they can NOT stay! They are all guilty of a criminal offence. They are here ILLEGALLY, you dumb...","commenter_a":"The only path they should get is the road to the border where they would be deported.","post_message":"\"For the 11 and a half million who are here illegally, if they've not committed a crime since they've been here, I would give them a path to legalization.\" Today on \"Fox News Sunday,\" John Kasich discussed immigration."}]
