[{"comment_id":"10153134126831051","commenter_b":"Mother fucking bitch..","commenter_a":"A real POS","post_message":"Witnesses called 911 when they noticed this woman begin tossing something out of her car window. When the police finally caught up with her, she didn't bother denying it."},{"comment_id":"10154063535716813","commenter_b":"Can I grab your pussy?","commenter_a":"I am so grateful for the @username and it's willingness to take a stand. I don't always agree with it's position, but I am always thankful for its existence and its hard work.","post_message":"ACLU Legal Director David Cole's closing remarks at Sen. Jeff Sessions’ confirmation hearing for attorney general. \"If someone applying to intern for one of your offices had as many questions in his record as Sen. Sessions has: racist comments, unethical conduct, padding of his resume, you would not hire him — absent the most thorough investigation and inquiry, if then. Sen. Sessions is not seeking to be an intern. He’s nominated to be the most powerful law enforcement officer in the nation.\""},{"comment_id":"939244866171766","commenter_b":"The woman who jumped the young lady works as a loan officer for Bank of America. I guess she still has a job . Tyler thanks , it appears that in many of the comments throughout this post only one race was involved in \" trespassing\".","commenter_a":"Pool passes!!!!! I saw another comment somewhere else from an actual member at the pool. This was a members (HOA) only pool where there WAS several BLACK members and was present at the time. There was a private pool party going on where the DJ that was hired sent out a tweet about was he was doing. The pool was swarmed by kids from another neighborhood with no pass and uninvited. Which is technically \"trespassing\". They was asked to leave and started a fight in which the cops was called. The police had made several requests to leave with no luck. This girl ( if you watch the full video) was asked to leave several times and told the officer \" F-YOU\" and that's when the officer grabbed her. First off she and the rest was trespassing and second refused to leave when asked. @webpagelink","post_message":"A young woman who attended the McKinney pool party gives her explanation for \"how it all began.\" Watch the full interview here: @webpagelink"},{"comment_id":"10153375690709087","commenter_b":"Stop any and all immigrants from coming in until we can financially take care of our own first","commenter_a":"Even BB knows it's not just a \" religion\"....","post_message":"Benjamin Netanyahu - בנימין נתניהו \"rejects Donald Trump’s recent remarks about Muslims,\" the Israeli Prime Minister's office said in a statement. \"The State of Israel respects all religions and strictly guarantees the rights of all its citizens. At the same time, Israel is fighting radical Islam which is attacking Muslims, Christians and Jews alike and threatens the entire world.\""},{"comment_id":"588768447914861","commenter_b":"Good night bitches","commenter_a":"Well if ur dumb enough to punch urself in the face then ur dumb enough to not know Trump is the MAN and Hillary needs to be hung for treason and letting our people die in Bengazi","post_message":"For those who missed: @webpagelink"},{"comment_id":"10152858693731336","commenter_b":"And those countries don't have 30 million illegals and a lazy spoon feed group like we do either!","commenter_a":"No one had actually spoken to a Canadian. They have to wait in hallways for a room. They go to Mexico for medicine and dental. So how is it better. Trust me I have dealt with a lot of them who come to the US to get care. This information comes from the Canadians themselves because they purchase travelers insurance from various American Insurance Co so they can come here. If you have not lived in Canada don't talk about their healthcare you don't know about it.","post_message":"What could a Republican alternative to ObamaCare look like? “We could try freedom for a while,” Sen. Rand Paul said."},{"comment_id":"954144534678601","commenter_b":"Legal immigrants are not citizens so they do not have the right to vote! Educate yourself @username","commenter_a":"So the answer is to let 8 million non tax paying illegal immigrants vote so they can continue to collect government aid. Nice way to F the country up more you idiots.","post_message":"Obama has responded to Trump's hateful rhetoric the best way possible."}]
