[{"comment_id":"1272474692787949","commenter_b":"She looks very ill, mentally, emotionally, physically and spiritually.","commenter_a":"Fuckin mental!","post_message":"WHY. WON'T. YOU. LEAVE? You're like that nasty drunk chick who won't leave the party after it's OVER."},{"comment_id":"10154320018886323","commenter_b":"Fascist dictatorship and destruction of cabinet government system. Democracy under attack.","commenter_a":"I am okay I never voted either tyrant but that's that's English government","post_message":"\"The Tories are about to give us a second female prime minister while much of the left will say gender is an irrelevance or that there are many more important things to deal with. Women, know your limits!\""},{"comment_id":"1176027829155419","commenter_b":"Smart woman","commenter_a":"Big deal!!! She had a right as an American citizen to vote but who she voted for is no one's business but hers.","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"737825183044101","commenter_b":"I would let a refugee stay in my house.","commenter_a":"I thought all of you on the left were going to let them move into your houses","post_message":"Several refugees have lost fingers and hands from walking in sub-zero temperatures."},{"comment_id":"914387928629071","commenter_b":"Send all illegals home now","commenter_a":"YES YES YES","post_message":"Americas Freedom Fighters"},{"comment_id":"533052596897970","commenter_b":"Her coloring is terrible. Bad makeup artist. It's not natural looking.","commenter_a":"they should've casted danai gurira from the walking dead. She'd do an amazing job. The fact that they couldn't get a beautiful chocolate actress is plain disrespectful","post_message":"Here's Why Casting Zoe Saldana with Blackface is a Major Problem. What do you think? Please share this video! #NinaSimone"},{"comment_id":"10153621323058812","commenter_b":"oh grow up Jennifer!","commenter_a":"the cop over reacted why would she have to put her cig out. Give her a fine and move on!","post_message":"At press conference, Sandra Bland's sister shared that she believes Sandra's arresting officer Brian Encinia was \"picking on her. Point blank, period.\" @webpagelink"}]
