[{"comment_id":"10153280743327042","commenter_b":"Let them shoot to kill and get shot whilst doing it!!","commenter_a":"Shoot to kill.... I'm talking to the cops !!!","post_message":"GANGS TEAM UP TO 'TAKE OUT' OFFICERS: Video shows \"lawless\" teens destroying police cars and injuring multiple officers. Today, police learned of a new threat from the city's notorious gangs."},{"comment_id":"10154012959875329","commenter_b":"I was going to tag my bff, and a couple of them made cringe a bit because u do then, but Jesus, that's a real bitch. I must be just a mini bitch.","commenter_a":"Wow I thought I was a judgmental bitch until I read this. Good to know I'm not that bad!","post_message":"You judge everything."},{"comment_id":"10154689577603812","commenter_b":"He also has many lawsuits in the 80's and 90's for discrimination against blacks and people of color.","commenter_a":"TRUMP STOOD UP FOR BLACKS AND JEWS: About 20 years ago the rich elites ran Palm Beach and wouldn allow Jews and blacks to use the golf and country club facilities. When he bought Mar-a-lago, MR. TRUMP WENT TO COURT TO END THAT DISCRIMINATION, won in court and forever changed how minorities are treated in Palm Beach. That THE REAL Donald Trump. What has Hillary or ANY politician done? @webpagelink","post_message":"A potentially record-breaking gap between two groups marks one of the most striking elements of preferences in the 2016 presidential race: college-educated white women for Hillary Clinton vs. non-college white men for Donald J. Trump."},{"comment_id":"10153007949671636","commenter_b":"Cannot stand her!","commenter_a":"@username - your favourite!","post_message":"'What's wrong with you?!'"},{"comment_id":"1874033892840716","commenter_b":"REALLY,Jim !#!#!!!","commenter_a":"We are concerned about you Al and the other nuts who wouldn't recognize the great things Trump will n is doing for the USA. Pray God continue blessing Trump doing good work for us.","post_message":"\"We all have this suspicion that — he lies a lot. He says thing that aren't true.\""},{"comment_id":"1215472705166021","commenter_b":"No, slutty women are.","commenter_a":"I wonder how many these so called rape or incest abortions our taxes go to are really that or women lying. I'm sure planned slaughterhood and other abortion providers don't perform parternity tests.","post_message":"Like and Share if you agree!"},{"comment_id":"1035379929888394","commenter_b":"@username actually if you check the poll aggregates you'll see that Hillary can best Trump.","commenter_a":"Can President Obama become her running mate for her Vice? Or Bill Clinton?","post_message":"The numbers don't lie, but Republicans definitely do."}]
