[{"comment_id":"758642314270568","commenter_b":"'@username @username DAMMM SHUT DOWN","commenter_a":"Hilary is no Obama, she is WEAK. She is a sell out in moments notice. She has no platform. The democratic platform was handed to her by Bill.","post_message":"Bernie Sanders to Hillary Clinton: 'Excuse me, I'm talking.'"},{"comment_id":"994048267321588","commenter_b":"Yes. And paid for by private donations","commenter_a":"Gorgeous yet not gaudy. Most important: Everything was Made in the USA . Wasn't it?","post_message":"Michelle Obama blows $600k on ‘modest’ dining room makeover"},{"comment_id":"1394286020597209","commenter_b":"'@username Cruz voted in the senate to bring in hundreds of thousands of muslims and TRIED TO PUSH THROUGH AMNESTY FOR THEM AND ALL ILLEGALS because he wants NWO and Open borders! Why do you think for the first time in history the BORDER PATROL HAS ENDORSED A CANDIDATE AND IT IS TRUMP? THEY SAY TRUMP IS THE ONLY CANDIDATE THAT WILL BUILD THE WALL AND ALLOW THEM TO DO THEIR JOB!!!! Trump is the ONLY ONE NOT wanting a PRESIDENTIAL SALARY EXCEPT FOR $1 AND NO RETIREMENT! The ONLY ONE who wants AMERICA AND AMERICANS FIRST! The ONLY ONE That wants to KEEP OUR SOCIAL SECURITY for our ELDERLY! The ONLY ONE That wants to rebuild our MILITARY AND HELP OUR VETS! The ONLY ONE Who WILL UNTIE THE HANDS OF OUR POLICE OFFICERS, BORDER PATROL AND MILITARY! And the ONLY WANT TO CUT GOVERNMENT SPENDING AND BRING DOWN ...","commenter_a":"Cruz what are you then?? You change your tone like Hillary does based on whom you are speaking too. Im not pro trump but least he hasnt changed his speech based on whos around him. That says a lot by itself.","post_message":"'Donald J. Trump is the master illusionist - he is the Harry Houdini... Trump is a phony.'  Today while campaigning in Pennsylvania, Ted Cruz slammed his rival for the GOP nomination."},{"comment_id":"1031698180201852","commenter_b":"why did this piece of shit get a job on T V anyway ??????? tampons for ear rings that is one sick hoe !!!!!!!!!!!!!!!!!!!!!","commenter_a":"Good","post_message":"'While MSNBC may believe that I am worthless, I know better.'"},{"comment_id":"910100355702699","commenter_b":"She should have gotten the death penalty!!!","commenter_a":"Hey like they say, you get what you sew!","post_message":"Convicted killer Jodi Arias will now spend the rest of her life behind bars. Watch Travis Alexander's sisters beg the judge for a maximum sentence: @webpagelink"},{"comment_id":"596965907173588","commenter_b":"They BORN there.need to FIX their OWN Country..DON'T COME MESSING UP 'OURS;~~","commenter_a":"Trump will make american tax payers build the wall not mexico","post_message":"Trump Better be Serious about Border Security Promises"},{"comment_id":"10153622480508690","commenter_b":"Nna, infact you get am","commenter_a":"And this is not a problem at all to the world peace, unless when Israel bombs Hamas terrorists, then it will be a problem for the world peace. Hehehehehehehehe One good thing people should learn is that Muslims from the unset, have always wanted to dominate. Whether Muslims like it or not, Israel of today will never succumb to them again. If Israel is the problem of the world, then Palestinians should try and leave the land of Israel and let's see whom Israel will kill again. Thousands are dying in Syria, Yemen and Iraq, yet it's not a problem to the world peace. Tell that to the birds. Never ever succumb to the demands of any Muslim community, if u give them one today, tomorrow they will demand for 3. Always push them back or they will over run u. This is why i pity Europe,maybe they are not ...","post_message":"Syrian government has conducted nearly 7,000 air strikes during the month of July, according to the Syrian Observatory for Human Rights, making it the most intense bombing reported in one month since the beginning of the conflict in 2011. @webpagelink"}]
