[{"comment_id":"10153003088197377","commenter_b":"It will be a huge shake up.","commenter_a":"Now they talking I guess they are coming out of there dream closets, they better rally around him and make this country great again.#Trump/Cruz.","post_message":"Newt Gingrich says Donald Trump is capable of winning not only the Republican presidential nomination."},{"comment_id":"10155089942751037","commenter_b":"Probably a 1% chance I'm wrong, 99% that go clubbing with mom are losers looking for a free ride!","commenter_a":"They'll all end up as Uneducated Ho's, sitting in the corner of a club by themselves when the looks are gone!","post_message":""},{"comment_id":"617179595103961","commenter_b":"She is SUPER PREDATOR HERSELF","commenter_a":"$illary🐍🐍🐍🐍🐍 in the grass she will do any thing say anything to win ... Oh ya she already has","post_message":"This Video SHOULD Cost Hillary Clinton The Black Vote"},{"comment_id":"10153120731383010","commenter_b":"now THAT'S a woman!","commenter_a":"Yay! Now wet can objectify plus - size women too! We're all about equal opportunity around here!","post_message":"When Sports Illustrated's 2015 swimsuit issue hits newsstands next week, it will include an ad featuring plus-size model Ashley Graham. Cause for full-figured celebration?"},{"comment_id":"10154333518999641","commenter_b":"It's about time america should have their own female leader, if they truly wanted a real change, that lady touch would make a real difference for a great nation to reach further.","commenter_a":"VOTE FOR HiLLARY CLINTON 2016 . Hillary for America","post_message":"\"We just put the biggest crack in that glass ceiling yet.” - Hillary Clinton appears via satellite at DNC in hat-tip to history @webpagelink"},{"comment_id":"1839638869615346","commenter_b":"What progress? Isis? Health care costs through the roof? Men hanging out in women's bathrooms? Haiti? Russia ready to attack us? Drawimg a line in the sand? Most terror attacks on US ground ever? The disasterous Common Core? Highest poverty rate with people on welfare..ever!? Even democrats admit it!","commenter_a":"God forbid the president campaigns to protect everything he has accomplished. He doesn't need an idiot like you who would be a bull in a China shop destroying all of the progress that has been made.","post_message":"\"They're losers. They're babies. We have a president-- all he wants to do is campaign,\" Donald J. Trump said of President Obama @webpagelink"},{"comment_id":"552998604866610","commenter_b":"How dare you sir!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Another \"unverified story\" from Dr. Carson. Reporters visited the library and the librarian at the desk does not recall the event at all. Never happened! Carson lied and people died!!!","post_message":""}]
