[{"comment_id":"10157033906465725","commenter_b":"STOP Crooked Hillary from winning the general election! Together we can turn this country back around in the right direction by getting out and voting! TRUMP 2016!","commenter_a":"NO way!!!","post_message":"It is so important to get out and VOTE in 2016. Crooked Hillary Clinton cannot be our next POTUS! Senator Jeff Sessions just warned, 'This will be the end of law in America.' Get out & VOTE TRUMP! We will MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10156113293015725","commenter_b":"all you haters can eat a bag of liberal dicks!","commenter_a":"That's okay - Presidents don't have time to run Celebrity Apprentice! You will be busy saving our country!","post_message":"Congrats to my friend Arnold Schwarzenegger who is doing next season’s Celebrity Apprentice. He'll be great & will raise lots of money for charity. To all my fans, sorry I couldn’t do The Apprentice any longer— but equal time (presidential run) prohibits me from doing so. Love!"},{"comment_id":"10153302293701051","commenter_b":"EVERY country is populated at some point in its history by people who migrated to it ... THAT is how all countries began.... good grief. No one is against LEGAL immigration.","commenter_a":"Nearly 100% Americans ARE immigrants. Through their ancestors. :-))","post_message":"Do you agree with the vast majority of Americans on this?"},{"comment_id":"10153214192574170","commenter_b":"Could care less what she thinks !!!! LEAVE AMERICA!!!!","commenter_a":"Her opinion is s💱t Like her music Ghetto monkey opinions on race is ignorant and illegitimate Black rap culture is immoral dishonorable and gross","post_message":"I know, I know. 'who cares about some rapper?'  The sad answer is 'a lot of people.'  Conservatives have failed to engage in the pop-culture space for too long. That needs to change."},{"comment_id":"1246779605377041","commenter_b":"this is the first smart commnet I read on here","commenter_a":"People just need to work harder and not be lazy is all.","post_message":"To bring back the so-called  dream, we desperately need to address the massive inequality that exists in America today."},{"comment_id":"966246990097370","commenter_b":"Umm Ferguson, Watts Riots, La Riots. White people are out of control? Ok","commenter_a":"I pray for their families","post_message":"White supremacists shoot five people near the #BlackLivesMatter protests for Jamar Clark, a 24-year-old unarmed black man who was shot earlier this month by police.  Protestors took to Twitter after the shooting & described the scene as chaotic, saying police maced the crowd before an ambulance arrived to assist the wounded.  No arrests have yet to be made. DETAILS ----> @webpagelink"},{"comment_id":"10154394600380695","commenter_b":"Girl sit down... Really","commenter_a":"Why is this disgusting waste of human flesh still walking amongst us? Lock this rapist up already and throw thr key in the bottom of the Pacific","post_message":"BREAKING: The 78-year-old actor faces up to 10 years in prison if convicted."}]
