[{"comment_id":"10153316443579170","commenter_b":"God, she is a worthless person!","commenter_a":"Sicker than sick.","post_message":"All you Bible believers better change the way you think! The queen-in-waiting has spoken!"},{"comment_id":"666187176847797","commenter_b":"Too much butt kissing being done. The pilot and his white privilege remark, the seat mate's skin color even being mentioned, the flight attendant feeling compelled to apologize...oh, brother! This chick needs to put her big girl panties on and if she's a peace loving/seeking person, she'd drop the whole issue.","commenter_a":"So let all muslims boycott United, I will feel much safer with them not being there. Muslims are lower than whale shit.","post_message":"Look what happens when a flight attendant refuses to give a Muslim woman a Diet Coke..."},{"comment_id":"10153168114730399","commenter_b":"Go to hell u hypocrit","commenter_a":"Our laws are dictated by the society as a whole, not by anyone's God or church.","post_message":"A unique interpretation of our justice system..."},{"comment_id":"844439005656552","commenter_b":"breaks my heart to see what my son and brother actually see. These people don't just mad out on red and green. When they see anything that has a red or green in it. They don't see it with the colors they can interpret. So nothing is as it should be. You need red to Make purple, purple doesn't appear the way the rest of us see it for them.","commenter_a":"Sylvain St-Arneault","post_message":"Watch people see color for the first time thanks to these high-tech glasses."},{"comment_id":"10153260257844614","commenter_b":"Signed!! And shared!!!","commenter_a":"Let's start a petition to ban this person. Apparently not fit to perform the duty","post_message":"Gabriel Fernandez parents allegedly beat him to death after dousing the little boy with pepper spray, forcing him to eat his own vomit and locking him in a cabinet with a sock stuffed in his mouth, according to court records. Now, the Department of Children and Family Services supervisor who was fired after it was determined he missed opportunities to save the 8-year-old Palmdale boy is close to getting his job back. Gregory Merritt was among those who decided to close Gabriel case shortly before his death even though he knew the boy had written a suicide note and had a BB gun pellet embedded in his chest. A civil service panel recently voted unanimously to reinstate Merritt, imposing a 30-day suspension in lieu of termination, the L.A. Times reported. Read KTLA story here: @webpagelink"},{"comment_id":"1273398092695609","commenter_b":"Rosie is one of the most disgusting women","commenter_a":"protect your kid not your pigs","post_message":"Rosie is disgusting!"},{"comment_id":"10153677754598037","commenter_b":"All these females asking for equality. \"Wait, we don't want that equality.\" Sleep in the bed you make.","commenter_a":"Why are you women saying no? Cry for equal rights then don't want the same responsibilities as men.","post_message":"Do you support requiring women to register for the draft? If passed, 459,000 women in Texas would be eligible."}]
