[{"comment_id":"1174610022559026","commenter_b":"Build a wall , deport all illegal but no one will believe you","commenter_a":"Send them and their anchor babies home where they belong ,, Trump in 2016 ,,, I'll help with the roundup for free ,,,","post_message":"@JebBush faces Trump-led headwinds in attempt to change the GOP's tone on immigration."},{"comment_id":"1584256221591722","commenter_b":"Donna, STFU!!!","commenter_a":"When my kids were young and one of them had pulled some lame brain stunt but I wasn't sure which I'd start a mild-mannered conversation about it when they were all present. Sure enough one of them would just sort of drift away--go outdoors or to his room. It was an instant notification as to whom the culprit was. So the Puffy Orange Juvenile is drifting away? Bingo! That's enough for this old mom.","post_message":""},{"comment_id":"10152944576132061","commenter_b":"Good thing they aren't dogs- the barbarians would skin them alive and eat the,.","commenter_a":"@username I want one for my birthday!!!","post_message":" China debuts its newborn panda twins: @webpagelink"},{"comment_id":"10153978615223812","commenter_b":"Go Hillary! 2016!!!","commenter_a":"GO BERNIE","post_message":"Here's what the ABC team is doing in the minutes leading up to the #DemDebate..."},{"comment_id":"1394765567230964","commenter_b":"Because they enjoy it. They love to rape. That's it.","commenter_a":"Im still confused. Why does it seem that boys need to be educated against forcibly sexually attacking a woman? Like, hey! You shouldn't hurt that girl! Why is that something they need to be taught? Its like saying boys are rabid animals that need to be trained or something. Maybe they are, but why??!! I guess in the case of Nairobi born boys, if one in 4 women have been raped, perhaps they witness a lot of those attacks and it normalises the behaviour. But still. I am struggling to comprehend how a boy in ANY country comes to believe that raping a girl and causing her harm is normal. 😕","post_message":"In case you missed it: Take a look inside Kenya's successful rape prevention program."},{"comment_id":"10153162579468908","commenter_b":"Unfortunately A LOT of people fall into this category. Sex is everywhere and to too many it is everything.","commenter_a":"When sex rules your life you have zero power and nothing to contribute to society. No better than an addict. No power No control over your own life. Puppet. Set yourself free.","post_message":"Something we should all consider when it comes to porn.."},{"comment_id":"695691723946745","commenter_b":"She has no clue !","commenter_a":"Talia Crichton","post_message":"The look on her face when Al Franken calls Betsy DeVos out for being so damn IGNORANT about education policy is simply priceless!  Video by Occupy Democrats, LIKE our page for more!"}]
