[{"comment_id":"10153072162137144","commenter_b":"It was defacing State property. No matter how she feels there are laws. She was right to be arrested.","commenter_a":"Yay for this righteous woman !!","post_message":"Brava! #freeBree"},{"comment_id":"10153467458013984","commenter_b":"Sick of hearing about Bruce and the damn Diggers","commenter_a":"enough of this crap...give it a rest","post_message":"If what Rush Limbaugh says is true, this whole Jenner thing could be just the tip of the iceberg. Scary... Do you think the liberal media has an agenda in pushing the Jenner story?"},{"comment_id":"894913557210733","commenter_b":"That's a very good question. They should have been the first to do that, And Arizona as well. But I don't think we can save lower California. The illegals think they own it anyway........","commenter_a":"ok texas needs to do this fast","post_message":"AND He needs our help!"},{"comment_id":"1079787262080732","commenter_b":"BYE BITCH","commenter_a":"@username this is SCARY accurate dont hug me when u come home","post_message":"\"I love you.\" \"Ew. Stop.\""},{"comment_id":"1217783301639772","commenter_b":"It's new- tella. Stfu","commenter_a":"Some people say nut-ell-uh and he's right. Nutella is absolutely nut-ell-uh. New-tell-uh is wrong.","post_message":"The right way to say 12 brand names you've been mispronouncing your whole life."},{"comment_id":"493650944158819","commenter_b":"Get rid of her","commenter_a":"Well her whole life she's been breaking the law, she corrupt .","post_message":"Hillary's career could be over after she was exposed doing this. Good. Let's end it right here, right now, once and for all. Do you agree Hillary Clinton should be relieved of her duties?"},{"comment_id":"10153344418725326","commenter_b":"Me too..they are owned by Time Warner her 7th largest donor!?!?!","commenter_a":"THE QUESTION IS THIS. DID CNN FEED HILLARY THE QUESTIONS IN ADVANCE. IF YOU LOOK AT HER BODY LANGUAGE AND LACK OF PONDERING THE QUESTION HER RESPONSES WERE CANNED. I FIRMLY BELIEVE CNN FED HER THE SCRIPT.","post_message":"Hillary Clinton was put on the defense Tuesday for her ties to Wall Street. While Sen. Bernie Sanders has been saying for years that the Wall Streets are contributing to the overwhelming income inequality in America. Ed gives Commentary. Don't forget to Subscribe to Ed's YouTube Channel at: goo.gl/ScLQVu"}]
