[{"comment_id":"908006605999185","commenter_b":"Just try to take mine down!","commenter_a":"Good for USA...fuck obama","post_message":"This is HUGE!"},{"comment_id":"10154441744191509","commenter_b":"WE STAND WITH TED CRUZ----WE WONT VOTE FOR JIMMY NUTS CARTER ENDORSE TRUMP OR ILLEGAL ALIEN AMNESTY PROMOTER RUBIO.","commenter_a":"Jessi Spires Ben Kraja Alex Gochis Tyler Teejay Chase","post_message":"Three white nationalist leaders have formed a super PAC for Donald J. Trump, even though Trump doesn't want their support.  #NewHampshire voters are getting a robocall with a simple, disturbing message."},{"comment_id":"946644428709749","commenter_b":"Wow seriously? Talking about reading too much into something. It is a cartoon meant for entertainment. Good grieft! You know where I got my sense of womanism from? My MOTHER! Yep, that is who shaped who I am.","commenter_a":"Missed the most important point fat, ambitious women are evil, unnaturally thin submissive and child-like women are good.","post_message":"Not only is this hilarious, but it is *so* on point. Kudos, ScreenJunkies.com."},{"comment_id":"10153224075406336","commenter_b":"I'm upset about it too, but let's take a look at our current President. He's stomped on the US Flag toward other nations apologizing for Americas stance for years on policy. He just keeps stomping and we just keep believing lies and hypocrisy.","commenter_a":"What a disgrace to our country!","post_message":"A new social media \"challenge\" is encouraging people across the country to disrespect and stomp on the American flag."},{"comment_id":"10156035361815354","commenter_b":"and its only the begining","commenter_a":"WHAY ELSE????","post_message":"An UNDERWATER tunnel."},{"comment_id":"10153513356977061","commenter_b":"Oh god please... What a fake","commenter_a":"Worst First Lady and president ever ....E V E R ...","post_message":"WATCH: Pres. Barack Obama and First Lady Michelle Obama do the Whip/Nae Nae at The White House Easter Egg Roll. abcn.ws/1VPZxxV"},{"comment_id":"642161199307792","commenter_b":"If she get to say what she wants ,WHY can't the other people say what they want ,She talks down to ALL the people You could say that bitch pist me off and kelly would so you think all women are bitches no just the ONE THAT PIST ME OFF She just think she is everything do no wrong.","commenter_a":"No","post_message":"Megyn Kelly may be getting kicked off the air...  FOX needs our support, let's give it to them.  Do you support FOX News?"}]
