[{"comment_id":"483283155193311","commenter_b":"Good ridance! Sorriest show on TV. Sorriest people on a show on TV. Both of the women above should be in a mental institution. Lock them two and Obama in a room together and let them live out their lives in peace. :)","commenter_a":"Hope so , it will be a blessing","post_message":"FINALLY!"},{"comment_id":"10153881194507464","commenter_b":"My FB wall today is swamped with nothing short of filthy dirt on Cruz, thanks to a handful of Trump supporters. Just how ugly will this get?","commenter_a":"absolutely right, @username is the only consistant conservative in this race. CRUZ missile to the White House 2016!","post_message":"Rush Limbaugh: 'If conservatism is the dominating factor in how you vote, there is no other choice for you in this campaign than Ted Cruz... this is the closest in our lifetimes we have ever been to Ronald Reagan.'"},{"comment_id":"1645030555784057","commenter_b":"Every woman who wants an abortion should see this. Children are truly gifts from God!","commenter_a":"If everyone showed that much love for their mother and all their family. This world would not be in the shape its in today. Most beautiful example for everyone!, thanks","post_message":"Incredible."},{"comment_id":"577516445785152","commenter_b":"Sarasota canceled the witch!","commenter_a":"The pumkins look just like trumps he ad. Lol","post_message":"WATCH LIVE: Hillary Clinton continues to campaign in Florida, where she leads Donald Trump 45% to 44%, according to an NBC/WSJ/Marist poll reported by FOX News.  This morning, she's at the New Mt. Olive Baptist Church in Ft. Lauderdale."},{"comment_id":"10152934239186336","commenter_b":"If O had a son!! Hold the phone he would have to be heterosexual!!!","commenter_a":"Home grown terrorist!","post_message":"A former taxi driver from Virginia has been added to FBI's list of most-wanted terrorists."},{"comment_id":"10152800082481051","commenter_b":"Should have killed the scumbag the first time !!!","commenter_a":"It was a domestic violence crime, that should have kept him behind bars. You figure out why.","post_message":"This guy was released after admitting to stabbing a woman to death in front of her children. Guess what he did one month later."},{"comment_id":"10155686821610354","commenter_b":"Please were in Big Trouble if the ASSHOLE gets in. It's bad enough the ASS already in office is dismantling our Country little by little she'll just finish it off. Her and her asshole of a husband.","commenter_a":"She could have changed to state ID if she is no longer driving and that information should have come via letter","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.”  If she didn't want it to expire, she could have driven once or twice since 1996..."}]
