[{"comment_id":"10153051549632169","commenter_b":"She will always genetically be a she period Cat is not a dog just because someone wants it to be","commenter_a":"Why are my tax dollars and donations going to publish this crap????","post_message":"From FRONTLINE:"},{"comment_id":"1763955337222403","commenter_b":"Women over 65 don't have to wear them...lol","commenter_a":"If there was a young Muslim man in America...and Donald Trump was elected by popular vote to pass hateful laws against Muslims...How easy would it be to radicalize them against a nation that has rejected them? Trump is exactly what ISIS wants.","post_message":"Donald J. Trump campaign chair Paul Manafort fired back after President Obama said the New York billionaire's comments about Islam are 'ultimately helping do ISIL's work.'  @webpagelink"},{"comment_id":"10153530679413984","commenter_b":"I hope she gets jail time!","commenter_a":"Some beasty mom will kick her face in I'm sure. As a Juvinal little will happen to her in our current legal system.","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"},{"comment_id":"419169165087070","commenter_b":"'@username nobody wants your Ukranian ass here either. Plastic bitch.","commenter_a":"People with Green cards and visas are also being denied access. So don't tell me it's about 'coming here legally' This is a hate based act. Period.","post_message":"This significance of the court's ruling and the power of protest cannot be overstated.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153902236123812","commenter_b":"The native Americans should have stopped accepting immigrants. They wouldn't have lost millions of life's by those terrorist immigrants!!!","commenter_a":"ISIS doesn't need to be in America. Has everyone forgotten about the mass shootings that happen almost every day now? They can easily recruit here and never step foot on American soil. Blind hatred is still hatred.","post_message":"LATEST: Mississippi joins Ohio, Florida, Illinois, Indiana, Louisiana, Arkansas, Michigan, Alabama and Texas in refusing to accept Syrian refugees in wake of #ParisAttacks."},{"comment_id":"1478041665558122","commenter_b":"'@username - very serious! Just wait and you will see!! Thanks for allowing Clinton to be our next president!!","commenter_a":"Sorry- false!! Most military is for Trump!! Voting for Johnson is a vote for Clinton!! Why would the military want a person who believes in open borders!!","post_message":"These pushups are more than Trump has done."},{"comment_id":"10153376704131051","commenter_b":"Someone needs to beat her the same way","commenter_a":"Dear God in heaven. God bless this poor child.","post_message":"Officials couldn't believe that someone would treat a child like this."}]
