[{"comment_id":"10153889787166337","commenter_b":"This sucks this is such a good show","commenter_a":"Not happy! Love the show! Can they not find a replacement for Molly? Your messing with my Monday and I don't like Supergirl.","post_message":"CANCELED? Sad news for Melissa McCarthy and Mike & Molly fans..."},{"comment_id":"1364681343563732","commenter_b":"@username DA MAO POW!!!","commenter_a":"Kaaren Eric","post_message":"When a  meets a .   Check out more of our panda videos here: bbc.in/2hI4DPR"},{"comment_id":"10153882312643690","commenter_b":"Say this to naked girls and bars in japan .","commenter_a":"What a mistake","post_message":"Islam has never made more than a marginal impact on Japan, although the history of Japanese relations with Muslims stretches back further than most people imagine, the Japanese included."},{"comment_id":"10153573221561336","commenter_b":"Give a clipboard to a woman...And this is what you get. I live on land and not in a neighborhood for this reason. If I wanted to have one painted hot pink it would not matter :)","commenter_a":"That's why I would never buy a home in an subdivision with a HOA they try to control living !!!","post_message":"The homeowners association says the purple playground must be “subdued and within harmony with other colors of the community.”"},{"comment_id":"10153219885266636","commenter_b":"Vicki Horn Bet she'll complain if her wages go down. But thats not her problem until its her problem.","commenter_a":"Don't really think the 'how quickly would we get free tampons if everyone stopped wearing them?' Is a very appropriate question. If you want to walk round with blood all over your trousers knock yourself out - think it's you that would look abit mental but it won't affect the government","post_message":"'How quickly would we get free tampons if everyone stopped wearing them?'"},{"comment_id":"465186890273018","commenter_b":"This....this is brilliant lol","commenter_a":"No this nation was bast of God an build around it get it right dumbass","post_message":"The Anti-Media radio show is live at NOW! Listen from your computer or phone here: www.UCY.tv/TAMR  Call in and join the conversation: 1-718-717-8296  via Murica Today"},{"comment_id":"10152871258752411","commenter_b":"Tradition in high school sports.....especially football.........Give it a rest already!","commenter_a":"Lol omg. To all these people saying how mean it is. It's called having a sense of humor. It's awesome. And I'm SURE the neighborhood helps him clean it up;) relax;)","post_message":"ANYONE NEED TOILET PAPER? Coach Q's house was TP'd after Chicago Blackhawks Stanley Cup win.  Full story: @webpagelink"}]
