[{"comment_id":"10157682940820389","commenter_b":"Such bullcrap that she can get away with this!!!","commenter_a":"OF COURSE THEY DID....TWO OF AMERICA'S BIGGEST MISTAKES... WAKE UP AMERICA...VOTE DONALD TRUMP .....","post_message":""},{"comment_id":"1191302950909160","commenter_b":"Time for the Trump wall","commenter_a":"we don't care that much where they come from, we only care to DEPORT them ASAP","post_message":"UNREAL! Look how many illegals from other countries are now coming in through Mexico!! WHERE they are from is ALARMING! @webpagelink"},{"comment_id":"10157037705625725","commenter_b":"@username ILLEGALS","commenter_a":"This legal Latino is voting for Trump! Like if Donald Trump has revived your patriotism and faith in your country!","post_message":"We need strong borders to keep our country safe!"},{"comment_id":"1072916832798493","commenter_b":"I dont know who's right who's wrong because this is a mourning moment","commenter_a":"God bless President Bush and his wife! Atleast we know they love America! Even Obama's brother knows Barack is a failure, he started isis by withdrawing troops from Iraq and killing Gaddafi! by the way a funeral is a celebration of the person's life morons! The Obama's are an embarrassment!","post_message":"Actions speak a THOUSAND words. Take a look at Michelle's face..."},{"comment_id":"10154331232125530","commenter_b":"Lol frfr and I would have them together honey","commenter_a":"@username they should put U in charge","post_message":"Fire up, Detroit Lions fans! Cheerleaders will be on the field soon!"},{"comment_id":"1240086616006505","commenter_b":"Animals r strange voters... They will vote with the Jews.","commenter_a":"Who? Never heard of him.","post_message":"And then he said where he promises to MOVE if Trump DOES win..."},{"comment_id":"10153615563223812","commenter_b":"Well some people family don't care","commenter_a":"(rolling eyes) if she was white and was found hung in a cell, no one would say a word.","post_message":"While Sandra Bland's family and supporters have been calling for an independent investigation into her death, the DA plans to release the dash-cam footage from her arrest: @webpagelink"}]
