[{"comment_id":"488312324683981","commenter_b":"Hmm if firearms are a replacement for a small penis what are females replacing with firearms @username???","commenter_a":"Gun Worship in The United States of Guns is Killing US...","post_message":"SCARY!!"},{"comment_id":"938570362850489","commenter_b":"I love this woman.....","commenter_a":"Thank you for sharing this work of art...beauty born through the transformative act of a life examined...","post_message":"Listen to a woman who isn't supposed to share her story do it flawlessly. Whoa."},{"comment_id":"779312755503344","commenter_b":"How about in the best interest of the Muslims, they don't belong here.","commenter_a":"why do we need them here??? what benefit are they to America??? wtf....","post_message":"Is Paul Ryan in our country's interests?"},{"comment_id":"10153280743327042","commenter_b":"Let them shoot to kill and get shot whilst doing it!!","commenter_a":"Shoot to kill.... I'm talking to the cops !!!","post_message":"GANGS TEAM UP TO 'TAKE OUT' OFFICERS: Video shows \"lawless\" teens destroying police cars and injuring multiple officers. Today, police learned of a new threat from the city's notorious gangs."},{"comment_id":"985293351528112","commenter_b":"Well the high taxes on import/exported goods and labor, access fees to our harbors and Panama Canal or fees to get visas will sure help to pay for wall. LOL!","commenter_a":"Your country will PAY for the wall knucklehead, we hold the ACE CARD, your economy is DEPENDENT on USA! USA is a self contained nation. This is something a LOT of Americans have forgotten, this country is SELF CONTAINED, we don't need to import, we have RAW MATERIALS for EVERYTHING you can think of! I can't wait for factories growing all over USA like grass when Trump occupy the Oval Office.","post_message":"We're 'Not Going To Pay For That F*cking Wall'"},{"comment_id":"10153049947289170","commenter_b":"From the info I have seen, they have entire areas that could just be surrounded and taken out......all those \"unsafe for non-muslims to enter\" areas......","commenter_a":"At least someone in power will acknowledge these Muslim terrorists need to be taken out! The problem is they have almost completely taken over France at this point. Apparently France has over 750 No-Go zones in which only Muslims are allowed to live and travel in these territories. Sadly the govern has let them take over like this.","post_message":"I guess this was some reality check."},{"comment_id":"10152803991986491","commenter_b":"This less her chance of cancer . It is possible that cancer my appear else where?","commenter_a":"Anna! I always love to read your comments! Thank you for sharing :)","post_message":"\"I feel feminine, and grounded in the choices I am making for myself and my family.\""}]
