[{"comment_id":"10153805659416167","commenter_b":"For some reason I don't find the position of first lady (as you put it) as important as President. He cheated on his wife, maybe you've never done that, but there's many people ou t there who have cheated on their significant others. Not saying it's right of course, but the other presidential candidate cheated on his wife(s) also and I know the Republican's like to compare other political people when they're accused of something. Look at Trumps wife and her past. Do you really think she should be living in the White House? She's not even from America. Not that I think that's a good enough reason, but I know how you Republicans feel about immigrants. If you look at the naked pictures of her you may also feel she doesn't belong in the White House for that reason. Not that I think that's a good enough reason, but ...","commenter_a":"IMAGINE if you can...a useless, disgusting, nasty, corrupt, rapist, POS perverted woman abuser as our 1st Lady...Billy the perverted Clinton!!!","post_message":"Good grief. Uhh Joe why are you just mentioning this now?"},{"comment_id":"1102809566397179","commenter_b":"RACIST .","commenter_a":"Ben is a nice man but he reminds me of my old Catholic priest in high school, out of touch with how other people live and he came up with the most ridiculous things. Voting to me for Carson is like voting for the old priest.","post_message":"Number. Three."},{"comment_id":"388174341307161","commenter_b":"Why not let seniors work and draw social security. Count married people as two on tax returns this would generate more taxes. People would spend more money. Only the very handicapped should not have to work. People on welfare that are capable should have to do community service. They should b drug tested and have valid I'd Think of solutions instead of calling names. Cut out the waste. We need solutions","commenter_a":"Then why don't they shout it out, let their scared party from the Tea baggers know it has to be done, but I'm sure none will stand up to them.","post_message":"Do you agree with this poll?"},{"comment_id":"10154866849395329","commenter_b":"Becky with the good hair have a stadium full of seats please","commenter_a":"*21 things no one asked for. There, fixed it. *waits for angry Trump supporters to start complaining in the comments*","post_message":"We asked Donald J. Trump supporters to write down a misconception about them and here's what happened."},{"comment_id":"1042027782504360","commenter_b":"Bitch would've been sucking soup out of a straw...","commenter_a":"This warms my soul.","post_message":"This is some serious racism. Would you have slapped her after she spit on you?"},{"comment_id":"1906450522914712","commenter_b":"Also, men have their own issues. To claim that MRAs are bad people is simply a generic shaming tactic often employed by feminists. Reminds me of the White feather movement...","commenter_a":"Pretty discouraged reading many of the comments to this post. Fellow Bernie supporters, it would be great if you stopped living up to the misogynist label Clinton supporters have put on us as a group. Piling on here to deny that the wage gap exists is not helping.","post_message":""},{"comment_id":"10153572022092293","commenter_b":"We should see this McKenzie","commenter_a":"@username ayoooo","post_message":"The Witch is a must-see for any horror fan -- just be ready to be creeped out."}]
