[{"comment_id":"10153351458636336","commenter_b":"We have laws that protect our flag,Why are they not enforced? Up to $1000.00 fine or up to 1 year in jail. It is the law people.","commenter_a":"Good!","post_message":"“I don’t care who you are, you’re not gonna disrespect the flag, and if I have to go to jail to defend our flag, I’m gonna do it.” – Richard Pierce, Vietnam War veteran"},{"comment_id":"380847572097124","commenter_b":"This piss-ant compared himself to MLK!!! That's their mentality; he's blinded by hate. Typical rightwing idiocy!","commenter_a":"Idiot.","post_message":"Today is not the day for this nonsense."},{"comment_id":"10154859585584726","commenter_b":"Unfortunately in the eyes of progressives the answer is no. Meanwhile a slutty whore like Madonna can sell anything and everything she wants.","commenter_a":"Boy what hypocrites we have in show business. The left is losing it and it is getting really old!","post_message":"Can't a guy sell what he wants to sell?"},{"comment_id":"527521687455792","commenter_b":"Don't give her anything free ,I bet she would loose some weight then maybe she will like what she sees,maybe if she was real hungry she would find a job,how about stopping everyone's welfare look what a cost saving that would be and it would help our United States we wouldn't have to feed a bunch of free loaders .","commenter_a":"Oink, Oink !!","post_message":"I couldn be more disgusted by what she saying"},{"comment_id":"10153702146296491","commenter_b":"Huh ...well suck his dick already","commenter_a":"John Drumpf Miller and his toxic orange implants.","post_message":"Megyn Kelly: \"I would say the hair is real. I have laid hands on it personally.\""},{"comment_id":"1797648893800416","commenter_b":"Women's bathrooms have in closed stalls get over it.","commenter_a":"I don't do business with Target anyway","post_message":"In the wake of Target's decision to allow men in women's restrooms and changing rooms, the hashtag #BoycottTarget has exploded across social media and trended as high as #1 on U.S. Facebook..."},{"comment_id":"10154450520586320","commenter_b":"Well said Claudia","commenter_a":"own it. you have ignited and stirred the kettle and walked away. you have failed to address the real crimes of black/black murders happening every day in your 'home town' of chicago. you are perpetuating a false narrative to strip the local police from doing their job, create chaos and mistrust. own it for once and stop blaming everyone else.","post_message":"President Obama is to address the #BatonRougeShooting where 3 police officers were killed."}]
