[{"comment_id":"10153273987738984","commenter_b":"Does this F*CKTARD actually think I'll stop saying Thanksgiving? What a moron! Keep poking the bull bitch!!!","commenter_a":"Obama is a Fucking traitor and Muslim Asshole.","post_message":"Seriously Obama? What are you going to take away next? The NFL? Apple Pie?"},{"comment_id":"10153949955984454","commenter_b":"Chicks with green dresses","commenter_a":"What is wrong with this pipeline? Pipeline are the safest way to move oil and natural gas. And the least destructive to the environment. Most of the land recuperates in a few years.","post_message":"An expanded Alberta Clipper pipeline could send up to 880,000 barrels per day of toxic oil from Canada's Alberta tar sands into America's heartland even more than #KeystoneXL. Tell Secretary of State John Kerry to block the Alberta Clipper pipeline: @webpagelink"},{"comment_id":"10156322425460725","commenter_b":"Maybe ISIS knew America would take in the refugees, it was there plan all along to have a easy way into America to destroy us! Lord help us all.","commenter_a":"He's a traitor, he is just a resident of the white house, he has broken the oath and is no longer legally the president","post_message":"What is our President doing?"},{"comment_id":"1245131405583109","commenter_b":"Hillary said she carries hot sauce with her to pander to blacks and said they are predators. New leaked emails said that democrats were making fun of black women names. Yep that's what the democrats think about you. You have been played","commenter_a":"all he really concentrated on is how the speakers totally dogged him out....lol...I loved it but thats all he heard...he didnt hear them talk about Isis...he didnt see them bring up 4 star generals..he didnt hear a thing about what Kareem Abdul- Jabbar said...he didnt see the father of a Muslim man who fought and was killed while serving in our armed forces...he didnt hear them address Black Lives Matter and the Police...he didnt hear them talk about our criminal justice system...so t makes me wonder what convention was he watching..","post_message":"\"They're not talking about radical Islamic terrorism. They're not talking about borders where people just pour across. They're not talking about the crime,\" - Donald J. Trump"},{"comment_id":"850397761665128","commenter_b":"I'm a 20 year retired air force vet and a woman and this kind of treatment is common among the other sex","commenter_a":"In fairness. I wonder if the person thought the parking space was ONLY for physically wounded vet. Just saying. I agree the person was wrong. Vets come in all sizes, shapes, colors and gender. We all served. In AL we can even get the word VET on our drivers lic now. Just new.","post_message":"WOW! What do you think about the note left for this woman?"},{"comment_id":"10153590178129497","commenter_b":"You sons of bitches !","commenter_a":"Fearless!","post_message":"Via ClickHole:"},{"comment_id":"10152860079081130","commenter_b":"Her fat neck though!!","commenter_a":"His hair looks like an old lady! This kid has serious issues!","post_message":"Ellen and the Biebs are at it again."}]
