[{"comment_id":"10153540508969087","commenter_b":"@username BY THE WAY BITCH, YOU ARE THE LOSER!","commenter_a":"HOW ABOUT WHEN YOU CHEATED ON YOUR FIRST WIFE WITH MARLA MAPLES AND GOT HER PREGNANT, DUMPED YOUR EIFE, MARRIED MARLA, THEN DUMPED HER TOO!!","post_message":"\"I have a very good marriage now. Melania's fantastic,\" Donald J. Trump told Anderson Cooper at the CNN town hall in South Carolina. \"But I had two women that I never blamed because I worked so hard that my job came first. Maybe I work too hard. I was a better father than I was a husband. But I worked very, very hard and I love doing it.\""},{"comment_id":"521358881400958","commenter_b":"They never would of been allowed into Our Great America.","commenter_a":"Vote all Democrats out of office Be Smart America they are worthless hypocritical self centerd murdering traitors","post_message":"If you were in charge, would you have these deported back to where they came from?"},{"comment_id":"10156291676570500","commenter_b":"So so sad!","commenter_a":"Was it her baby or was she babysitting ?!","post_message":"Deputies say they found him in possession of child porn sent to him by his wife. @webpagelink"},{"comment_id":"1049777781778246","commenter_b":"@username aw did I offend you?, I'll consider your little bitch feelings next time you comment ok. Lmfao pathetic","commenter_a":"Approx 100 million gun owners in US , approx 200 million guns, several trillion rounds of ammo. If us \"white guys\" were the problem, you'd Damned sure know it.","post_message":"Clear as crystal. FOLLOW US at Reverb Press and Stories That Resonate."},{"comment_id":"10153013352396336","commenter_b":"Once again, an illegal alien!","commenter_a":"sounds like sabo tage to me. maybe even terroristic.","post_message":"\"A brush of death definitely came over me.\" – passenger Joel Bingham As more details emerge in a California train derailment that left dozens injured, investigators say the truck involved was not stuck on the tracks."},{"comment_id":"10152717878976770","commenter_b":"Too many nut-jobs in higher education these days. Bet she sues the school if she gets sunburn.","commenter_a":"Stupid is as stupid does and we all know you can't fix stupid.","post_message":"We're pretty sure that's not going to work..."},{"comment_id":"10153731024366130","commenter_b":"Lmfao girl","commenter_a":"Camellia","post_message":"Contributor Laura A. Jacobs, on Caitlyn Jenner: \"Your visibility has gone from mildly annoying, to problematic, to atrocious, to outright detrimental, and so I ask you, politely: Stop trying to help though the media and public appearances. Please. Stop...\""}]
