[{"comment_id":"10154229601211179","commenter_b":"Ash Kay- see? I'm not the only one thinking this! 😂","commenter_a":"That is sadly amusing","post_message":"via @buzzfeed"},{"comment_id":"10154861039595575","commenter_b":"What is this woman doing Hallucigenics?","commenter_a":"i thought she was paying them to leve, and she made a big mistake,,, what the hell, is this old or what,","post_message":"They call her the Hillary Clinton of Europe..."},{"comment_id":"1092384094157698","commenter_b":"This is a shame, but not unexpected.","commenter_a":"No backbone!!!","post_message":"Donald Trump's takeover of the GOP is complete."},{"comment_id":"959639310819514","commenter_b":"Maybe they should also be deported.","commenter_a":"I love the idea!","post_message":"ClashDaily.com"},{"comment_id":"10153119305979641","commenter_b":"Of course she did. She's corrupt as Hell. Let's elect her president.","commenter_a":"Good for her.","post_message":"Hillary Clinton deleted all emails from her personal server used for official secretary of state business, a Republican lawmaker says. @webpagelink"},{"comment_id":"10153428606317042","commenter_b":"Hell NO. They invited the idiot with the gun","commenter_a":"Yes.. including the idiot that set everything into motion causing the cancellation of the biggest time of their lives.. they could of ACCOMMODATED THEM INTO A ROYAL SWEET OR BALLROOM. ..I MEAN AT THE ASTORIA ...IM SURE THEY,SPENT A PRETTY PENNY. TRAUMATIZED AS WELL. SUE EVERYONE ... Not the doorman.... They were suppose to have a \"Dream Wedding and honeymoon\" ........ . Seriously.....","post_message":"COUPLE SUES HOTEL: The couple whose wedding was canceled after an accidental shooting in the Waldorf Astoria New York is filing a multimillion dollar lawsuit against the hotel. Do you think they should sue?"},{"comment_id":"521485418039751","commenter_b":"Caitlyn Jenner is a repudlicrat.","commenter_a":"Who wants a killer around them and yes HE killed someone","post_message":"'Transphobic'... Republican-hating... CONFUSION!!!"}]
