[{"comment_id":"10153881330947434","commenter_b":"So funny how some morons predict an armageddon just because their feminist messiah didn't win.","commenter_a":"Except for the fact that Jill is only asking for recounts in places where Trump won narrowly and has continually ignored asking for recounts in areas where Hillary won by even less votes. It's not about electoral integrity, it's about a woman having an infantile, foot stomping temper tantrum because she didn't get her own way.","post_message":"Jill Stein herself, standing across the street from Trump Tower, encouraged the president-elect to support her campaign’s efforts to ensure that every vote is accurately counted. “There is nothing to be afraid of,” Stein said, “if you believe in democracy.”"},{"comment_id":"958348850875022","commenter_b":"She is a frickin IDIOT","commenter_a":"Don't screw with my free speech !!! It won't go well for you !!!","post_message":"The Constitution’s 1st Amendment protections for free speech apply only to “institutions of faith” and not individual Americans, according to Sen. Tammy Baldwin (D-Wis.). Baldwin, the nation’s first openly lesbian member of the U.S. Senate, offered that bit of liberal logic during a recent discussion on MSNBC. Asked by the MSNBC host whether a bakery whose owners have religious objections to the ruling should be compelled by the government to bake gay wedding cakes, Baldwin insisted that religious free speech has no place outside churches, synagogues or mosques.  @webpagelink"},{"comment_id":"1011632632284104","commenter_b":"yall nasty","commenter_a":"Emmanuel Esquivel @username","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154660299872501","commenter_b":"She can work anywhere in these United States.","commenter_a":"So she can be a lawyer not a judge cool.","post_message":"We reached out to Angela Stokes today to ask about her future legal plans. If she responds, we'll add her comments to the story."},{"comment_id":"436426606545633","commenter_b":"Women are too smart for an old fish tale lol","commenter_a":"Good job, Mrs. Wifey","post_message":"This is great..."},{"comment_id":"10152991625460409","commenter_b":"GOD BLESS GOV RICK PERRY. I PRAY IF THE LORD LEADS YOU TO RUN FOR THE PRESIDENCY THAT YOU WIN. YOU HAVE BEEN THE BEST GOV THAT TEXAS HAS EVER HAD. I'M PROUD TO CALL YOU A BROTHER IN CHRIST AND I PRAY THAT WHATEVER YOU ARE LEAD OF THE LORD TO DO THAT GODS BLESSINGS WITH OVERFLOW TO YOU.","commenter_a":"I never understood the concept of hurting one class of Americans helps the other! Question for Obama, if the wealthiest 1% is forced to pay their fair share as you say are they more likely to sacrifice their life style to pay the tax hike with or slash the payroll aka are jobs to pay for it ? And if given the choice between getting the rich to pay ( again as you say) their fair share or having a job to provide for my family, I'll take the latter every time!!","post_message":"This administration has failed to prioritize job creation and economic opportunity. The Washington culture may be fundamentally broken, but the American spirit that built this great nation is not. America's leaders should be working to ensure every person who wants a job, has a job. That’s what this is about – making sure mothers and fathers can provide for their families and our children have every opportunity to pursue their dreams. #SOTU"},{"comment_id":"259111647859034","commenter_b":"Yes $85 million!!! They're saying that he abused he used to go to the most expensive hotels, restaurants, and buy so much expensive stuff since tax payers are the ones that were paying !!! A lot of luxury vacations for Mr. Obama !! And before leaving the office he send $221 million to the Palestinians !!!! I wonder since when he was sendings them money. that's why noooo I don't miss Obama ! I don't agree on some stuff Trump is doing but I hope he can makes this country great cause Obama did a lot of F***** up stuff to this country and I guess that's what people want a president that lies to us and do stuff that we don't know !!!","commenter_a":"What? A weekend at his own property? The nerve! He should be on a beach in Hawaii, sucking up the taxpayer's money! The utter gaul of this man!!!","post_message":"LIVE NOW: Trump arrives in Florida on Air Force One."}]
