[{"comment_id":"1592257357455136","commenter_b":"Ew. That girl is a cow","commenter_a":"Soar losers. Get over it.","post_message":"Anti-Trump protesters are outside Trump Hotel in D.C. They've been marching for two hours now.  More about road closures or traffic in D.C.: @webpagelink"},{"comment_id":"10153142288487217","commenter_b":"USA is a dangerous place to live in. even Army men are not safe there. the brave men was unhurt in France even in terrorist attack. but in USA he got stabbed. Muslims terrorists are everywhere in USA TODAY","commenter_a":"Ban knives!!!!","post_message":"The airman, who was hailed as hero after the French train terror attack, is in a stable condition after being stabbed in California"},{"comment_id":"10154732730043132","commenter_b":"BUT is he jewish?!","commenter_a":"Daniel Foisset","post_message":"It looks like Aly Raisman has plans for after Rio!"},{"comment_id":"10153130429581162","commenter_b":"If prostitution ever becomes legal, you can sign your kids up freak.","commenter_a":"Making prostitution illegal is as stupid as pot being illegal. Regulate, tax and monitor.","post_message":"NEW: NFL Hall of Fame lineman Warren Sapp arrested for allegedly hiring a prostitute after covering the Super Bowl for the NFL Network: @webpagelink"},{"comment_id":"841359735901368","commenter_b":"He just 'forgets' that we are in the 21st century, not in the Middle Age. We've learned from the past and they don't.","commenter_a":"We are all aware that this President is ill informed and has had trouble when it comes to Historical accounts... Whether or not you believe the Crusades were meant to stop Islamic atrocities or to spread Christianity, that should not be the focus here. Suggestion: Truly read the differences between Christianity and the Islamic faiths and decide which spreads peace within its holy scriptures.... An interesting example below siting scripture from both religions (read in its entirety). ...Especially, the Ellen Mems comparison. This is a public FB debate between a Muslim and a Christian: Quoting ' Christianity & Islam A debate... Gamal Abouomar Who is Prophet Muhammad, may peace and blessings be upon him? He is the one who defended the rights of all humanity 1400 years ago. He defended men's, women's and children rights He commanded and fostered the love between relatives and neighbors He established a coexistence relationship ...","post_message":"Barack Obama's prayer breakfast comments about Christianity are causing some to perk up.   “Unless we get on our high horse and think this is unique to some other place, remember that during the Crusades and the Inquisition, people committed terrible deeds in the name of Christ.'"},{"comment_id":"528240787342392","commenter_b":"she looks like a fat ape","commenter_a":"What a wonderful First Lady!!! Prayers for Candy & Ben Carson!!!","post_message":"Candy got to meet some great people this weekend in New Hampshire! #BC2DC16"},{"comment_id":"1738525546372400","commenter_b":"Amen","commenter_a":"Amen","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
