[{"comment_id":"842369659142996","commenter_b":"Child abuse has actually increased since Roe v Wade. Abortion logic 101...the baby 'might' be abused later so we'd better kill her now; the baby might actually get to LIVE in a non-traditional home so we'd better kill her now'. Sheeeesh, the stupidity.","commenter_a":"So many young couples would love to take that precious angel growing inside of you. Please don't murder that innocent baby..","post_message":"You don't get to 'choose' to kill another human being."},{"comment_id":"10155015262498690","commenter_b":"Yes why give the terrorists hope? As soon as Obomber gets out, terrorist support will weaken dramatically.","commenter_a":"If 9/11 deserves a moment of silence, than The #Syrians & #Palestinians deserve that we never speak again...","post_message":"Does Assad have enough manpower and weapons to protect the territory his forces have retaken while at the same time trying to win back more areas?"},{"comment_id":"10153986219495950","commenter_b":"You must be getting paid a pretty penny, lady. #HillaryForPrison2016","commenter_a":"Wikileaks, Hitlery's thugs throwing bombs, stinking libtard filth?","post_message":"“I’m very excited to see Hillary become president,” gushed Natalie Portman."},{"comment_id":"10155406467768812","commenter_b":"Didn't miss em. Had same day as any other.","commenter_a":"Idiots. Proof of the problem","post_message":"People protest around the country in support of a 'Day Without Immigrants,' a protest against President Donald J. Trump's promises to crack down on illegal immigration. abcn.ws/2kX8c5V"},{"comment_id":"10153644969898812","commenter_b":"Those flags do not represent the United States that I love.","commenter_a":"The church did not request it. The church is private property. Why does anyone think that TRASH should be placed on church property? If it is so much 'Southern heritage,' why was it placed on a predominantly black church? Is that like burning a cross on someone's lawn?","post_message":"Four Confederate flags were discovered this morning by the Ebenezer Baptist Church and the Martin Luther King, Jr. Center: @webpagelink"},{"comment_id":"970690569690664","commenter_b":"Good luck... Whomever the bitch was that reported my post. Truth hurts don't it troglodyte?","commenter_a":"Am I the only one to realize that all of these mass shootings are done by men?","post_message":"America's easy access to guns almost led to another devastating tragedy..."},{"comment_id":"1442907392435671","commenter_b":"You guys do know you can get disease from women too, right?","commenter_a":"Women who say bisexual men are better have a 130% greater chance of contracting multiple venereal diseases","post_message":"They're better lovers AND fathers"}]
