[{"comment_id":"1036357393060980","commenter_b":"Criminals are cowards and go for easy prey. Doubt one is going pick a fight with someone who will shoot back. Use your head Raymond","commenter_a":"Welp, the criminals will know who to shoot first.","post_message":"AROUND TEXAS: The Texas Senate gave preliminary approval Monday to a measure that would make the Lone Star State the largest in the country to allow licensed open carry of handguns. Would you support the right to openly carry in Texas? MORE ---> @webpagelink"},{"comment_id":"10153149917160667","commenter_b":"@username And I should lose my right to own gun's because of what he and a few others have done? Not going to happen.","commenter_a":"We have to stop this hate Americans have towards Muslims all bc of some crazies. I mean heck go read on Christianity through the years and check out what they've done!","post_message":"#HokiesDontHate is being used in a campaign by Muslim students to \"extinguish ignorance\" on campus."},{"comment_id":"1083798354993969","commenter_b":"You're an ignorant cunt Rosie","commenter_a":"Sell yall anything and then yall prounce on it. He ain't sided with humility that's his only thing he can do to them white bois. As a black police officer he can't beatem, rough them up, shootem, killem like they do \"somebody's\" people. That's for sure a death sentence then.","post_message":"When a KKK member suffered a heat stroke at the hate rally in Columbia, a black police officer put aside his personal feelings and sided with humanity."},{"comment_id":"441930219322192","commenter_b":"Jail this pervert!","commenter_a":"Creep","post_message":"Conservatives are bending over backwards trying to defend the Duggars. Gross!"},{"comment_id":"10154292885141037","commenter_b":"She will never get this vote!","commenter_a":"Democrat Hillary is most qualified, most knowledgeable, and most well informed. Please vote her. Thank. Socialist Bernie and his wife Jane dumped nuclear waste in America where poor Latino people live. Never vote for him Thanks. America: Never ever Trump please. Trump insulted men and women all and sundry.","post_message":"Mitt Romney is “very distraught about” Donald J. Trump, an adviser said. “He thinks Trump is this vulgar, dangerous, principle-less, value-less opportunist — putting it mildly.”"},{"comment_id":"1040495199380065","commenter_b":"Looks like only gays and uninformed women votes get this evil women.","commenter_a":"President Hillary Clinton","post_message":"A win for Hillary."},{"comment_id":"10154578809696336","commenter_b":"They are all corrupt !!! Time to clean house !!!","commenter_a":"Lol , I just remembered that Obama said hillary is more qualified than he is .","post_message":"\"The FBI's not supposed to be involved in spinning the news. Whenever you release sensitive materials on the Friday of a holiday weekend you are trying to affect the news cycle.\" Tucker Carlson said the timing of the FBI's release of documents relating to the Clinton server scandal \"discredits a venerable agency.\" @webpagelink"}]
