[{"comment_id":"10153297238001051","commenter_b":"YES","commenter_a":"Yup!","post_message":"The man who murdered a Kentucky police officer on Sunday night has been fatally shot. Do you consider this justice served?"},{"comment_id":"689624227852673","commenter_b":"They're not ladies either but you don't have a problem with that.","commenter_a":"I agree with British spelling (and actually use it here in the states) except on two accounts- Aluminium and Ladybirds. That's crazy, they're bugs. Ladybugs. They're not birds. Birds eat them. XD","post_message":"The last weekend of October sees ladybirds swarm public spaces, people's homes and ex-footballers."},{"comment_id":"10153491721731337","commenter_b":"He's the biggest Dick","commenter_a":"Rock Star? Don't you have to be able to play an instrument? And sing? If not, then I'm the biggest rock star!","post_message":"SHOTS FIRED: Kanye West claimed to be \"THE GREATEST LIVING ROCK STAR.\" The Who responded perfectly..."},{"comment_id":"10157648853630389","commenter_b":"I cannot stand this woman! She's an evil individual!","commenter_a":"I think Hillary is in for a very soul awakening! God did not choose and Call a man, Donald J. Trump, to lose! Donald J. Trump, answered God's Call, he did not have to do this! God is still in Control and this is God's Creation, not the Clintons, BHO, Soros, the big bankers, or any government! Look at all of the corruption & evil that has been EXPOSED TO THE LIGHT AND HAS BEEN GOING ON FOR YEARS & YEARS AND GOD KNEW IT!!! Life is like a tapestry, we see the underside, the messy side, but God sees the finished beautiful side and knows the reasoning behind every stitch. We have repented and we have asked God to save this country, ask and it shall be given! Deuteronomy 32:35 'Vengeance is Mine, and retribution, In due time their foot will slip; For the day of their calamity is ...","post_message":""},{"comment_id":"957334017635027","commenter_b":"He actually was not shackled. Its amazing how many people read cop blocks statement and dont even watch video or just flat out imagine what your seeing all because cop block intentionally manipulated you.","commenter_a":"Look, whatever the guy was arrested for, it doesn't make it right for that cop to beat on him. Even with the guy getting in the cops face and yelling. It doesn't make it right. The fucking guy is shackled. Cops aren't gods! They have no right to pass judgment and treat you like an animal.","post_message":"POLICE BRUTALITY caught on video! Is anyone REALLY going to try to justify this? From (Y) Counter Current News - MBD"},{"comment_id":"10153183802333188","commenter_b":"\"The walking dead\" are serving as most of our representatives in Washington, take a good look next time someone speaks to the Congress.","commenter_a":"Why do you think it's so good? It prepares us for what we might expect in a SHTF scenario.","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"10154012959875329","commenter_b":"I was going to tag my bff, and a couple of them made cringe a bit because u do then, but Jesus, that's a real bitch. I must be just a mini bitch.","commenter_a":"Wow I thought I was a judgmental bitch until I read this. Good to know I'm not that bad!","post_message":"You judge everything."}]
