[{"comment_id":"10154950558833256","commenter_b":"How on earth can you make this RACIAL?. It grabs EVERYONE!","commenter_a":"I wish I can say I am shocked; but just about every one black who's trying to make a difference is going through it' other races probably are also' its horrible '","post_message":"Calling the practice of intercepting cellphone information secretive and widespread, a federal lawsuit alleges Chicago has an \"arsenal\" of cell site simulators (or \"Stingrays\"). When deployed by police, these devices capture data from any phone in its range — not just the intended target.  \"Government spying on its citizens without appropriate judicial oversight is inconsistent with the freedoms guaranteed by the Constitution,\" said Jerry Boyle, a Chicago attorney who brought the case."},{"comment_id":"10153732358683984","commenter_b":"And let Sherriff Joe and border patrol do their jobs. The murder rate in Arizona is out of control and it's all illegals criminals","commenter_a":"Amen! TOTAL SUPPORT for Trump!! :-)","post_message":"The Donald just made a BOLD promise to a certain group of people if he becomes president - and boy oh boy, he is NOT messing around.  Do you support Donald Trump's tough position on this?"},{"comment_id":"10153155614114411","commenter_b":"Circumcision removes most of the nerve endings from the penis - so no, it is not good for intercourse.","commenter_a":"curcumstich is good for the sexual intercorse between man woman. But the preast outbreath and homosex agenda and child melest could make Even God leave the churche..and the girls virganity and boys firs blow job...fuck them. Herpes is an evel sicknes related both to rosesicknes that makes your body ..","post_message":"Via RT America: City health officials said 17 cases of infant herpes since 2000 have been connected to the traditional Orthodox practice of sucking blood from the circumcision wounds of infants penises."},{"comment_id":"1164591366914667","commenter_b":"Texas, enough said.","commenter_a":"Try to keep your vagina in your pants \"Ladies\"","post_message":"The closing of safe, clean clinics across the state has brought the back alley abortion back to Texas."},{"comment_id":"631726717035650","commenter_b":"You go girls don't let them do something that you dont want to do","commenter_a":"We should be WAY past forcing women to perform (in any capacity) against their will. Especially for a degenerate like Trump!!! Resist ladies. A stand must be taken against this. Millions of people are are your side. Let Trump hire his knucke-dragging Klan supporters for entertainment if he wants to get his jollies.","post_message":"These Rockettes are NOT taking this lying down. You go, ladies!"},{"comment_id":"696420180548560","commenter_b":"Personally I am glad that Texas is not taking any refugees. Imagine the amount of terrorist polluting the state.","commenter_a":"Good for you Texas Gov.!!!! Let's hope that our spineless president doesn't stymie this action.!!!","post_message":"Texas Gov. just released this very bad news for all refugees. The are setting a trend. Let's spread this. Can we get 75,000 'LIKES' for the great state of Texas?"},{"comment_id":"10154719986051130","commenter_b":"I'm a middle income American born and raised in America I paid Social Security and income taxes all my life I'm tired of supporting illegal immigrants and people freeloading from the US government on my nickel pretty soon the freeloading is going to stop","commenter_a":"Now I see a lot of ignorant uneducated and sick people talking about things that don't make any sense against the president when Donald Trump gets going you people that are on welfare illegally you people that get free handouts from the government illegally for you people the freeloading stops you're going to have to get a job and actually work for a living.","post_message":"WATCH LIVE: President Trump to speak in Melbourne. @webpagelink"}]
