[{"comment_id":"1296742057059213","commenter_b":"She is trifling","commenter_a":"This bitch stealing, got caught and now trying to act tough and threaten someone who is working to make a living for themselves. That bitch need to get a reality check and her welfare check taken. Cussing in front of her kid and possibly fighting and then what? Just sad.","post_message":"Rachet behavior at it's finest! #WSHH"},{"comment_id":"872917539471166","commenter_b":"Ohh @username shutup you miserable heifer","commenter_a":"This doesn't surprise me at all - and she looks great doing it !!!!","post_message":"Don't believe us just watch!"},{"comment_id":"1218654931501590","commenter_b":"Amen!","commenter_a":"It might have something to do with the fact that they make veteran Officers from other agencies retake the academy if they try to switch to their Department.","post_message":"10News' Phil Buck digging deeper to find out how Hillsborough County Sheriff's Office is still working to keep you safe in spite of deputy shortage @webpagelink"},{"comment_id":"10154037878823984","commenter_b":"Mr. Trump from the time he started his campaign he has always states that all the illegals have to go back have to go back to Mexico and Central America but yet he is one of the largest employers in the Real Estate , Casinos , Hotels, and Golf Courses business, has bragged about hiring illegals to including his contractors and subcontractors and they love him 1. did he use e-verification to see if he or his contractors and subs to see if they had a work permit or they are who they say they are. 2. you claim you want to help the veterans but your company hires more illegals than vets. 3. if you are serious about what you are campaigning on why not be the first to fire or dismiss the illegal aliens and fill those jobs with veterans lead by example and make America great again ...","commenter_a":"Yup another lifer. GET RID OF POLITICAL LIFERS THAT ARE FEATHER BEDDING Stump for Trump. You Go Don, Go Don all the way to the WHITE HOUSE.","post_message":"Wow. The governor of Iowa is actively working against one of the GOP's most popular presidential candidates. This is very unusual for the Iowa caucus... the Iowa governor must feel very strongly about this. Do you agree with the Iowa Gov.?"},{"comment_id":"10153062603882235","commenter_b":"What is it about the name Cheney that brings out the stupid? Good God woman shut the hell up and stop sounding like your father. smdh","commenter_a":"Blackface was always intended to degrade. Drag is something else entirely.","post_message":"Mary Cheney — the lesbian daughter of former Vice President Dick Cheney — asked in a Facebook post this week why drag performers are allowed to blur gender lines in their work while society frowns on the form of racial minstrelsy known as “blackface.”"},{"comment_id":"10154029521602411","commenter_b":"They why do u live there.? Give them back their land. U r part of the problem apparently","commenter_a":"Why is that something to celebrate? Another way of saying it is that's when the invaders successfully finished off stealing the land of the Potawatomi and Shawnee","post_message":"On December 3, 1818, Illinois became the 21st U.S. state."},{"comment_id":"678910242299554","commenter_b":"She needs to ban herself and all the other idiots","commenter_a":"She has no authority to actually ban anything.","post_message":"You'll never believe what Michelle is trying to ban now... Ridiculous. She has no right and no authority to do this. Should we kick Michelle out of the White House?"}]
