[{"comment_id":"1175870485808384","commenter_b":"YES\"","commenter_a":"Obama does not want us to abide with that law. What the hell are you talking about. Where do you get your information at.","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"1012624708881318","commenter_b":"@username. She speaks 5 languages!! How many do you speak?","commenter_a":"I honestly can't stop crying right now to know that this monster is playing with families like this when his wife can't even speak English herself","post_message":"Watch protests at U.S. airports in opposition to Trump's executive order restricting travelers from specific countries.  Read more details on the travel restrictions issued by President Trump: @webpagelink"},{"comment_id":"912646568790348","commenter_b":"@username i have worked in kane country elections for Dems for 27 years I do my home work ! Bernie only got 8 bills passed in all his 40 years in the sen!!!! Hillary in 4 years got double that!!!! Bernie is ALL TALK NO ACTION!! He is in Bed with the NRA and voted against the brady bill 5 times and voted against amber alert!!! are you kidding amber alert!!!! Now that turns me WAY of Bernie!.And I dont HATE Bernie but Hillary I feel will get the job done and I would love to see what a woman can do!!!! And please dont call me DEAR!!","commenter_a":"Bernie is telling people what they want to hear not what he is capable to really get accomplished.His promises are not doable. They are unrealistic. Hillary has already accomplished many many good things for the poor and the middle class. Bernie is running on our ticket and using us. He is not a democrat and refuses to join our party, and has scorned our party for years. He is a left wing socialist. He voted against the Brady Bill and Amber Alert. He voted to protect the gun corporations and manufacturers against any and all law suits. He said that underage teenage girls should be allowed to have sex with their boyfriends not to get cancer. ( Wierdo) He also said toddlers should be allowed to to explore their sexuality with each other. He refused to serve in our military under concientious objection during the Viet Nam War when 55,000 ...","post_message":"It is clear that the views of the right wing do not reflect the views or the needs of the vast majority of the American people. The Koch brothers and the billionaire class are way, way out of touch with where the American people are."},{"comment_id":"950226215018237","commenter_b":"Or a little pussy like @username","commenter_a":"Conor Lopez Micky Mac","post_message":"The first left me drooling, and the last left me shaking my head. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10154364961931320","commenter_b":"I don't like seeing fat chicks in spandex but yet I'm made to tolerate it.","commenter_a":"Was she covered up or like in the article picture? I am a mother and have no desire to see someone breastfeeding. Cover it up. That experience is between you and your baby and no one else.","post_message":"The sight of a woman breastfeeding her baby was enough to cause a male Target shopper to go off in a series of verbal assaults. @webpagelink"},{"comment_id":"10153301839268854","commenter_b":"Why isn't sharpton in jail for not paying his taxes instead of running around free doing nothing but causing trouble. That is the question.","commenter_a":"Douche bag!","post_message":"Sharpton Calls for Federal Police Laws... 'There must be national policy'..."},{"comment_id":"10152974175586130","commenter_b":"So much prettier than the trashy thong suits of today.","commenter_a":"Courtney Kelley Michler","post_message":"Gorgeous!"}]
