[{"comment_id":"1014969508525839","commenter_b":"It only matter what the FBI thinks about the emails. It's obvious when obama's FBI investigates it's something serious.","commenter_a":"Socialist nut job or a lying criminal oh the options we have.","post_message":"This is the surprise moment from the #DemDebates everyone will be talking about tomorrow."},{"comment_id":"10153577909221756","commenter_b":"And finally, Jesse Jackson IV, since I think he likes Kendrick Lamar too?","commenter_a":"'@username Mata Though I'm sure you have seen this...","post_message":"High school teacher Brian Mooney used rapper Kendrick Lamar's latest album to teach a unit on Toni Morrison's novel, 'The Bluest Eye.' Lamar found out about it, and decided to stop in for a visit. Full story here: @webpagelink"},{"comment_id":"10153967377745894","commenter_b":"She has some fat tits. Lets be real","commenter_a":"I don't know why she feels the need to show her tits Wherever She Goes.","post_message":"See how Mariah Carey's relationship with billionaire James Packer began to fall apart on Mariah's World."},{"comment_id":"1790041197906165","commenter_b":"She should behead you #deplorable","commenter_a":"Hillary could behead a school bus full of children on national TV and she wouldn't get arrested.","post_message":"'Based on our review, we have not changed our conclusions that we expressed in July with respect to Secretary Clinton,' FBI Director James Comey wrote."},{"comment_id":"10153266920996051","commenter_b":"I think he's a muslim sleeper, programmed to distroy this country and let in all the muslims he can recruit.","commenter_a":"Even if he was it's his freedom to choose...why does he have to practice Christianity or Catholicism?","post_message":"Do you think these voters are right about President Obama?"},{"comment_id":"10153835568288128","commenter_b":"'@username what have china done unto the hongkongers?","commenter_a":"Really disgusting actions by these locals. Edit: Not saying I don't understand why this is being done, but a better way to express their discontent than this is still something to be desired for.","post_message":"Fans defied warnings from the Hong Kong Football Association against booing the Chinese national anthem at Tuesday night’s match."},{"comment_id":"10153513286844575","commenter_b":"This lady is clueless lol","commenter_a":"This is sad leave churches alone go to a justice of peace & get married the ones trying to sue they think it is a way to get rich it makes me sick","post_message":"Four Kentucky couples are suing a clerk who is refusing to issue gay-marriage licenses — or any marriage licenses at all.  Rowan County Clerk Kim Davis says her Christian beliefs prevent her from complying with the #SCOTUSMarriage decision, so she will no longer issue marriage licenses to any couple, gay or straight."}]
