[{"comment_id":"1111727715607435","commenter_b":"sick woman in many ways and not to be respected!!","commenter_a":"Clinton stood tall and showed she was someone to be respected, unlike the baby bully who consistently showed his ignorance and called name likes like a third grader.","post_message":"The final presidential debate is in the books. Which candidate made the best case for themselves: Trump or Clinton?"},{"comment_id":"10153929324394586","commenter_b":"WAIT WHY DID HE KILL IT ANYWAY WAS IT HIS TO BEGIN WITH IS HE IN JAIL HE NEEDS TO BE FOR ANIMAL ABUSE HAS The Dodo HEARD ABOUT THIS?!? I CANT BELIEVE SUCH AN INNOCENT CREATURE WOULD BE HURT LIKE THIS HUMANS ARE SUCH IDIOTS HE/SHE NEEDS TO BE LOCKED UP IM JUST SO MAD","commenter_a":"Where is the proof that this specific coyote was killed for the fur? I've witnessed coyotes stalking my dogs while they're in the back yard, and I can't have barn cats because the coyotes kill them. The coyotes get closer and closer to my house every chance they get. I'm all for nature taking its course, but you can guarantee I'm going to protect my pets' lives over the life of a coyote. How do you know this coyote didn't just attack a farmers chickens or livestock? How are you so sure this guy executed this specific coyote for the sake of its fur? I don't think you are. Posting graphic videos for awareness is one thing, but posting a graphic video with the wrong facts is nothing but propaganda.","post_message":"WARNING: EXTREMELY HARD TO WATCH.   Coyotes bark just like dogs when they're scared. Even the coyotes killed for fur trim.   CC: Canada Goose   [via Robert Banks]"},{"comment_id":"10154180246323984","commenter_b":"Ha ha bitch you lost .........","commenter_a":"This is why they Hate Donald Trump, He is upsetting the SCheme they have in PLACE! @webpagelink","post_message":"Many are predicting that Marco Rubio is going to lose his home state of Florida in tonight's primary. Rubio has a plan if that is the case, and it's going to surprise a lot of people.  Is it over for Rubio if he loses Florida?"},{"comment_id":"1153858647985703","commenter_b":"It's the \"Chicago way\".... the end justifies the means.","commenter_a":"And all his ISIS appointees and advisors!","post_message":"Does this about sum it up?"},{"comment_id":"10154275931541509","commenter_b":"Do all the chicks look like you?? Pass....","commenter_a":"Welcome to the best dating agencies believed Malaysia We have a wonderful effect RICH SUGAR MUMMY / DADDY / IN MALAYSIA be among the people to get our exclusive link We are reliable and efficient in our work get a chance to meet with them we have a sugar mummy throughout Malaysia who are willing to lavish money on your car and home a contract extension.. To help get the job started., start calling right now to get in touch within 24 hours and make more money noted., applicants must be 18 years or older and must have a significant personality dinner with mummies , and wealthy Daddies .. Each of the night you spend with her or your daddy , will pay you RM5,000 .. This is a bonus for every interested applicant available . Every interested applicant for a hook up meeting appointment, must contact our Agency Mrs ...","post_message":"\"They were robbed of their stage. ... Tonight, we give them ours,\" Bono told the crowd.  For the first time since  #ParisAttacks, Eagles Of Death Metal make an emotional return to the stage alongside U2 @webpagelink"},{"comment_id":"10153212913058145","commenter_b":"The problem is that She's an evil mean peace of crap, that should had never been born","commenter_a":"Everyone loves kittens so what is the problem?","post_message":"A north Florida woman is facing charges after deputies said she was seen throwing kittens out of her car window. @webpagelink #wftv"},{"comment_id":"10153662758062894","commenter_b":"Naw mama had let that warning out that she addresses her child my bad young lady again she gon catch that fade","commenter_a":"But skai read her so no need for mama to even say anything","post_message":"Not My Child! Skai Jackson’s Mother Has Words for Azealia Banks: ‘I Don’t Play Those Games’ [Photo]"}]
