[{"comment_id":"480665305471830","commenter_b":"Dumb, ignorant witch","commenter_a":"Speaking of frauds!! Having a convicted felon as your top surrogate makes me wanna puke. She is spewing lies on every network, when is this P.O.S. going to be held accountable?#KatrinaPierson","post_message":"YES!"},{"comment_id":"10153391824149205","commenter_b":"Was your mom a thing female voice hater .","commenter_a":"Who in their right mind, even if they don't like Trump, would even care what this thing says. My opinion is just as good as hers, or even more informed. Just because someone is a hollywood star does not make them knowledgable one way or the other.","post_message":"TYT Reporter Jordan Chariton caught up with Oscar-winning actress Susan Sarandon in Mason City, IA after a rally in which she introduced presidential candidate Senator Bernie Sanders (D-VT)."},{"comment_id":"10153858416863271","commenter_b":"Sick woman. I mean the one who posted this comment.","commenter_a":"I've been looking at her Facebook pages(she has two), I'm not justifying her actions and believe it's absolutely disgusting but I'm pretty pretty sure she's special needs. I'm not saying she shouldn't be punished or condoning her behavior but I honestly don't think she knew any better. I'll be willing to go out on a limb and say she was sexually abused. She probably did to him what had been done to her or what was told to do. I can't even imagine what's going on behind those walls.","post_message":"Jessica McCain told investigators that she recorded the sex act on a borrowed cell phone, according to court documents."},{"comment_id":"1715308212052135","commenter_b":"That is the good thing about voting for Trump! It is bad for Mexico and good for the USA!","commenter_a":"Bite me you greaser","post_message":"Mexico's former president claimed voting for Trump is \"treason.\""},{"comment_id":"1844278629192581","commenter_b":"Yep, only the melon and spice tips make sense.","commenter_a":"It's all a bounch of whooie! Put Kerry in the frig and forget about it!","post_message":"Check your fridge ASAP."},{"comment_id":"800883556714802","commenter_b":"Rheemyck Contreras","commenter_a":"Lexx Kennedy can we get one","post_message":"WATCH: Black panther creeps up on a man not paying attention? Wait for it... wait for it..."},{"comment_id":"1591036221183491","commenter_b":"NICE ! Drop that bitch","commenter_a":"That was just so great","post_message":"OUCH! That's gotta hurt.  This bully had it coming."}]
