[{"comment_id":"1023434111010933","commenter_b":"someone can't read the headline in the article lolol","commenter_a":"Stop blaming anti vaccers, we are the ones smart enough not to inject ourself or others with the disease.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"1285821781534200","commenter_b":"nasty reptilian","commenter_a":"Well i think there is no more people to die,there was only one left so G Michael was that,the question is why they need people to die?","post_message":"I think she was right"},{"comment_id":"10152832059200927","commenter_b":"Only in PRC (People Republic of California)","commenter_a":"This guys also looking for a raise, he says he can't make it on $174,000 a year with free medical, vehicle, and perks. I think he needs to be deported.","post_message":"So the murder of an innocent woman by an illegal alien is little thing?  That's what this congressman thinks!"},{"comment_id":"1795750557330111","commenter_b":"Couldn't agree more!! Set up! All the drama, theatrics all made for Reality TV!! Kardashian styling! #Whinylittlebitch","commenter_a":"I believe THAT was completely stage set up!!!!! How can possibly someone can get through with a gun if someone did try to do something.... Complete set up","post_message":"The Secret Service rushed Donald J. Trump off the stage at a rally on Nov. 5 in Reno, Nev.: @webpagelink"},{"comment_id":"10153117500629342","commenter_b":"#seriously what woman wants to see a man in tight shorts? #smh","commenter_a":"Jenn Nunez I will be going to Dallas soon","post_message":"The restaurant says it offers something for both girls and boys."},{"comment_id":"661111504079428","commenter_b":"They are eat up with the dumb ass !!!","commenter_a":"Whats amazing is that I know a lot of people that just love obama. What's the matter with peoples these days ???","post_message":"This group of police officers destroyed Obama, this is hilarious.  Great. We completely support these officers.  Do you support their stand against Obama?"},{"comment_id":"352745464928968","commenter_b":"Her lips weigh more than my kids'!!!!","commenter_a":"Who cares what she wants. She needs to minf her own business.","post_message":"Michelle Obama Wants to Weigh Your Fat Kids"}]
