[{"comment_id":"10153503495739087","commenter_b":"Shut the fuck up bitch","commenter_a":"Bernie lost, give him money, make bernie feel better with money, Bernie wants peoples money. Trump came in second and didn't ask for a dime. Trump 2016!","post_message":"Bernie Sanders presidential campaign had its \"best day ever,\" raising $3 million since the Iowa caucuses on Monday -- most in the form of small online contributions, averaging about $27 each."},{"comment_id":"10154376040464641","commenter_b":"making of The Taken 3 (Must watch Unbelievable) @webpagelink","commenter_a":"That's what we should be doing focusing on the dummies in the audience, the cockroaches","post_message":"Donald J. Trump's controversial \"Second Amendment people\" comment made Darrell Vickers' bearded jaw drop."},{"comment_id":"10152920092525736","commenter_b":"Because I dive in pussy. No fecal flakes on my","commenter_a":"Because they know what they're doing is wrong & disgusting.","post_message":"41% of transgender people try to kill themselves, compared with 4.6% of the general public, according to a study."},{"comment_id":"1278850128860187","commenter_b":"No way in hell will I change my faith or anything else for this evil bitch!!","commenter_a":"Wear red at the polls. Let's show the Clinton machine how we can show our support another way that can't be rigged. Polling lines full of Trump supporters should skew the view of the biased media. We are the media. We are the people. For the people by the people we will make this country great again. Go Trump!!","post_message":"This literally just happened, folks!"},{"comment_id":"750074615183116","commenter_b":"THIS IS AMERICA & WE BETTER START PAYING ATTENTION BEFORE IT'S TOO LATE! SHARIA LAW BELONGS NOWHERE IN AMERICA.","commenter_a":"Let go hunting America ...Get them out of our country before they hurt our love ones ...","post_message":"Muslims take over THIS U.S. town and immediately begin implementing Sharia law. You cannot force others to follow your religious laws. Do you think this is wrong?"},{"comment_id":"1551325111574622","commenter_b":"This is HER country.","commenter_a":"Now do we really care what this looney tune thinks or if she accepts Trump...if she does not accept him....send her out of the country!","post_message":"No one could have said this better."},{"comment_id":"849791398402742","commenter_b":"Well you be sure to let all those people know where that magic land is where all those wonderful jobs are just growing on trees!","commenter_a":"I think this is great. People will no longer abuse welfare and will actually get up and find a job.","post_message":"Arizona's Legislature cut $4 million from the budget by reducing the maximum time you can be on welfare from 5 years to 1 year. Critics say that it will cut funding for those who need it and can't find jobs. Supporters say it will encourage more to get off welfare and find work. What do you think?"}]
