[{"comment_id":"714422425388653","commenter_b":"Get out of this country!!! The USA was great until you damn Devils Muslims started to come here!!!","commenter_a":"I don't care. Take that shit off. What do you have to hide. You want to wear it , wear it at home.","post_message":"She filmed it.   WATCH the video very closely..."},{"comment_id":"1017654374977457","commenter_b":"But if you don't punish them and just deport them, they will be back in a matter of days ! Secure the borders and then release them all back to mexico !","commenter_a":"Depends, they should first pay the consequences for their criminal behavior and then be immediately deported. Maybe the consequences should include the death penalty, financial remuneration, work to give back to the community, such as the CCC did under FDR and the DNC.","post_message":"Donald Trump and Ann Coulter think that immigrants that commit crimes should be deported right after being convicted. What do you think?  Vote in the poll and have your voice heard!"},{"comment_id":"965206956824108","commenter_b":"Heena thank you for that original post. More level headed than many on social media. Personally I think Islam and Christianity are both a blight to our species- but it is your RIGHT to believe whatever you want. I'll gladly defend your right to be or believe whatever you want. I know Islam and Christendom view me as an abomination because I am gay- I think that is incredibly stupid but I still respect their right to believe it. There is no reason a female officer could not have dealt with this lady and, after checking for contraband, allowed her to keep it on.","commenter_a":"I'm so tired of seeing this article. I wear a hijab and I've been wearing it for 10 years and it's just as much my identity. But if I'm asked to take it off, I will. There's plenty of times I've been asked to remove it for security reasons and I comply, and that's not even because I got arrested. I'm pretty sure God isn't going to smite me for showing my hair to comply with the laws of the country I was born in and choose to reside in, which ironically gives me more religious freedom than living in a Muslim country. Is it entirely fair that this happened, probably not. A female officer could have taken her picture. But that didn't happen, and unfortunately being asked to remove your headscarf in a non-Islamic county doesn't amount to a violation of rights in the same way as it would ...","post_message":"“I’ve worn my scarf for 12 years and my religion says that I can’t take it off. It’s not just a religious issue; this is a part of me. It’s my culture, my life and my identity.”"},{"comment_id":"258747511232468","commenter_b":"Struck a nerve didnt I @username? Don't dish out what you can't take Snowflake. Now, y'all enjoy picking those grapes.............","commenter_a":"you and your fucking fox news like spin...he requested...not begged. you are as bad as the right wingers with your lies. is your position so weak you have to spin it? you are why trump is in office because you cant be straight up. fuck you occupy democrats.","post_message":"It's obvious that hypocrisy runs in the Trump family."},{"comment_id":"10157133614025354","commenter_b":"Put the bitch in jail once and for all","commenter_a":"It's better to wait until after Obama is president to do anything to her. If something was to happen before then, he would give her a pardon.","post_message":"Don't worry, Hillary. The FBI is just getting all the findings from its one year investigation in order before giving you the chance to lie yet again about how you committed HISTORIC breaches of national security and auctioned State Dept. policies through the Clinton Foundation. #ClintonCash"},{"comment_id":"10153557927894411","commenter_b":"they should allow rocket launchers and rpg's to blow out anyone who draws out the frigging gun","commenter_a":"We need to make sure movie theater workers all carry guns so they can pull one from their holster and save the day!","post_message":"BREAKING: One of the deceased is the suspect, who reportedly turned the gun on himself."},{"comment_id":"10153469659427042","commenter_b":"She's getting a life now getting away from that abrasive idiot.....stop with the marriage BS married or not no woman should be abused","commenter_a":"It means there not married right!! Now they have a child with no Dad , that's why Hashem laws say first we get married than have children . Are actions will let us all see our Rebbe King Moshich . She should get a life. Yechi Hamelech","post_message":"'I have the courage to actually do something about it this time.'"}]
