[{"comment_id":"875277045852257","commenter_b":"You are a woman your body is naturally designed to bear children. It is worse when you make the choice to get pregnant.","commenter_a":"Most pro-aborts know there is an actual baby being killed. 99 percent of them have never had an abortion, yet have no problem telling others it's perfectly okay to have one. Pro-aborts are sick people.","post_message":"When was the last time you saw a baby announcement like this?"},{"comment_id":"10153306499856770","commenter_b":"She's pathological. Plain and simple.","commenter_a":"Yeah Hillary, you are just the best liar around!!!","post_message":"Hillary Clinton claimed, \"I have tried in every way I know how, literally from my years as a young lawyer, all the way through my time as Secretary of State to level with the American people.\""},{"comment_id":"10155353294040231","commenter_b":"Your mom is a monkey","commenter_a":"I'm going to leave this right here. #Unapologetic #BlackAgenda @webpagelink","post_message":"Yet another black person has become a hashtag after being killed by a police officer."},{"comment_id":"10153134474569369","commenter_b":"@username so then bill Russell should be the greatest to ever play if where talking about rings you idiot SMH it's not about the rings stupid head","commenter_a":"M. J. Loyal to his team.","post_message":"It's one of the big sporting questions of our time."},{"comment_id":"1901231699975547","commenter_b":"That don't count, She is a pig and certainly is Fat. Its not her fault it was the spoons fault.","commenter_a":"Wasserman hates men","post_message":""},{"comment_id":"1044884802218658","commenter_b":"exactly...if they don't want to procreate, they get it from somewhere else...LOL","commenter_a":"Now wait a minute! I thought they only had sex to procreate!","post_message":"Finally! A \"Christian\" guide to dealing with the \"sexual immorality\" of a wife refusing to give her husband sex-on-demand without a \"legitimate\" physical or mental health reason!"},{"comment_id":"1275765532466713","commenter_b":"THIS IS WHAT america going to get if hillery elected .. this Muslim imam funded to Hillary clinton campaign.@webpagelink.. have a great islamic future for Americans","commenter_a":"thie is a foto shop pic trump u moron","post_message":"ANY FELLOW JEW VOTING FOR CLINTON IS A DISGRACE TO OUR PEOPLE!"}]
