[{"comment_id":"10154514668258701","commenter_b":"So, she thinks it's ok for POC to be racist. I see what she did there","commenter_a":"I don't understand why anyone would be upset by this, I mean hell, give this article a few hours and there will be plenty of examples of white hate towards POC in the comments, I see some already. I don't blame her for wanting to keep her room a safe place for herself and her roommate.","post_message":"\"I do not hate white people. That's not what I screamed in that post. What I screamed in that post was I am eagerly desperate to create a safe space on this campus in order for me to return and be successful here.\""},{"comment_id":"1068655089908149","commenter_b":"Beautiful!","commenter_a":"Beautiful!!!","post_message":"Happy 24th anniversary, Barack Obama and Michelle Obama! Here's a look back at the First Couple's sweetest moments."},{"comment_id":"863410587096986","commenter_b":"90% London is full of foreigners, loud mouth rude boys and junkies.","commenter_a":"But london will not make exception for trump","post_message":"London's new mayor will be an \"exception\" to his proposed ban on Muslims."},{"comment_id":"10153089034256051","commenter_b":"She should have either buckled herself then got sick or she could have knead down holding door and do it that way ( some vans have a handles)..or have a push window..or found something to vomit in","commenter_a":"There is a reason why yiu are suppose to wear a seat belt. Glad she is ok though.","post_message":"This woman began feeling sick while driving and ended up opening a car door to throw up. The problem is, the car was still moving at the time."},{"comment_id":"1488163707879902","commenter_b":"she is just as ugly as orange hump","commenter_a":"Yeah I don't think so you idiot Crypt-Keeper","post_message":"Apparently this dimwit has never heard of the First Amendment. --Andrew"},{"comment_id":"10153189927841336","commenter_b":"Mike.... yes all ILLEGALS should be deported.... We have immigration laws which are not being followed... We have a system for people who want to become citizens so I do not support those who break the laws of this country and expect to reep the rewards of citizenship off the backs of the American taxpayer...","commenter_a":"ACLU is out of their minds... abortion is murder!!! illegals need to be deported PERIOD...","post_message":"“The Catholic Bishops are taking millions of dollars in federal grants and then imposing their beliefs on this vulnerable population… that raises serious concerns under the separation of church and state provision in our Constitution,” said an ACLU Nationwide attorney."},{"comment_id":"883919521667797","commenter_b":"newsflash, genius. there's a bunch of dumb females already in ISIS.","commenter_a":"no female should be deployed where isis are, you are just asking for trouble.","post_message":"Kayla Jean Mueller, 26, traveled the globe fighting genocide, AIDS and domestic abuse."}]
