[{"comment_id":"10154517046780329","commenter_b":"Not bad, but these sudden death quizzes are pretty f***ing unpopular. I would have hoped y'all would have gotten the point.","commenter_a":"Mike Snee","post_message":"There are 20 questions, but as soon as you get one wrong, you LOSE. (via BuzzFeed Quiz)"},{"comment_id":"10154072479709586","commenter_b":"This is so wrong... Those poor chicks.","commenter_a":"What fking country is that, where?! This is filmed. Why isn't someone there to do something about that?!","post_message":"People actually do this for #Easter. All the babies are just DUMPED in there :("},{"comment_id":"10156946907525389","commenter_b":"@username you are just a hater. Stop disrespecting people specially Muslims.","commenter_a":"Love this man!","post_message":"\"Why didn't she say, 'Hey, make better lifestyle choices?' If you want to join something, why don't you join a church, why don't you join the Boy Scouts or the Girl Scouts?\" Milwaukee County Sheriff David A. Clarke Jr criticized Hillary Clinton's comment on joining \"positive gangs.\" @webpagelink"},{"comment_id":"10153081460312235","commenter_b":"All depends on version and translation","commenter_a":"Guess they didn't make it on the ark ;)","post_message":"If they are in the Bible, they have to be for real. End of story."},{"comment_id":"10150906812849999","commenter_b":"Which candidate doesn't?","commenter_a":"Guys he meant he is happy that nobody died lol get over it you all know what he meant. He says a gaffe, everyone is on it and saying how ill qualified he is, yet 99% of the time he is showing his wits no one cares.","post_message":"\"Well, first of all, just grateful that nobody got hurt,\" Gary Johnson told CNN after the attacks in New York and Minneapolis."},{"comment_id":"1257226684318485","commenter_b":"Thank god Hillary did not get in she is to dangerous to our constitutional rights. And you know nothing of our constitution or you would know how dangerous Hillary really is. I don't think anybody that is not a American has a right to who we have as a president. Now it's time to make everything great and get along for all of Americans based on the constitution where it all started and will stay.","commenter_a":"If GOD could erase USA right now he would do it, i have no doubt. Trump is a living nightmare, and the American people are in the rollercoaster of stupidity right now. God don bless America...","post_message":"Things are not looking good on Wall Street"},{"comment_id":"10153707450494218","commenter_b":"I DONT CARE if he was Sellings DRUGS or Selling His MOTHERRRRR These Six Police Officers TOOK A LIFEEEEEEE PPL.. ANd for that They Shall SUFFERThat's IT That's ALLLLL","commenter_a":"No justice for the 6 officers who were doing their job. What do we have police officers for? That needs to be explained..... Mr. Gray was a drug dealer plus numerous other things. Baltimore wants to keep drugs in their streets it seems! My thoughts only and Mr. Gray, well he would have gone to prison if he lived I hope.","post_message":"#BREAKING #FreddieGray Judge denies motion to dismiss charges against 6 police officers in death of Freddie Gray. He also denied a motion for State's Attorney Marilyn Mosby to recuse herself. Follow live updates: @webpagelink READ more here: @webpagelink"}]
