[{"comment_id":"971252449561175","commenter_b":"Hat's off to this chick!!!! Good for her! To bad she didn't kill the s.o.b.!","commenter_a":"Well done! I would want to do the same thing. These perverts cannot be rehabilitated.","post_message":"The woman took matters into her own hands when she caught  her boyfriend trying to sexually assault a 12-year-old -- by running him over with her car. >> kiro.tv/RunOver  She, and her boyfriend, were arrested."},{"comment_id":"1030585200364962","commenter_b":"DON'T TRUST HER ... Obama and Hillary want to rescue 200,000 Muslims. This is the same two that couldn't rescue four Americans in Benghazi. ... #VoteTrump2016","commenter_a":"Hillary's background If you happen to see the Bill Clinton 5-minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware. A person who was there for most of their presidency and knows them better than just about anyone has listed a few corrections. Bill says: 'In law school, Hillary worked on legal services for the poor.' The facts are: Hillary's main extra-curricular activity in law school was helping the Black Panthers, on trial in Connecticut for torturing and killing a federal agent. She went to court every day as part of a law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: 'Hillary spent a year after graduation working on a children's rights project for poor kids.' The facts are: Hillary interned with Bob Truehaft, the ...","post_message":"Hoy, el Departamento del Trabajo acaba de anunciar nuevas reglas laborales que garantizarán el pago de horas extras a trabajadores que ganan hasta $913 dólares a la semana o $47,476 al año. Esto es más del doble que el límite pasado de $455 a la semana.   Hillary: 'Aplaudo al presidente Obama y al Secretario del Trabajo, Pérez, por estas reglas sobre horas extras laborales, las cuales levantarán a trabajadores a nivel nacional y ayudará a que los salarios aumenten nuevamente para las familias trabajadoras. Durante el primer año de la implementación de estas reglas, millones de trabajadores adicionales serán elegibles para el pago de horas extras, finalmente cobrando totalmente por las horas que le dedican a sus trabajos... Nadie que trabaje 40 horas a la semana debería tener que mantener una familia en la pobreza”."},{"comment_id":"10154254253351336","commenter_b":"She's Nasty !","commenter_a":"White guilt is a real thing. Sad but true.","post_message":"“I’m a white lady. I’m an easy target,” Melissa Click said in an article."},{"comment_id":"10154115958779740","commenter_b":"How is chatting about baseball anything like questioning someone about their personal relationship with religion...?","commenter_a":"If they can't talk about repentance and God then they can't talk about anything else either outside of the law and professionally defined parameters consistent with law enforcement . We can't be picking and choosing what a man can talk about. What? Are we going to ban cops from discussing baseball? What about 'hello Mrs Jones, how's the husband and kids, has Mr Jones been staying sober?'","post_message":"Should officers be allowed to preach to civilians while on duty?"},{"comment_id":"10153195780106130","commenter_b":"I'd give her an orgasm!","commenter_a":"Who's the asshole out there denying women orgasms??? Selfish prick!","post_message":"'Don’t not have an orgasm. Make sure he knows that you’re entitled to an orgasm.'"},{"comment_id":"10153063718888606","commenter_b":"What would be said if they were male teachers and little girls.... Sick is sick.... They need to go to jail and be on the sex offenders list.....","commenter_a":"Definitely a crazy world we live in!","post_message":"Two California teachers are accused of having sex with students while on trips to the beach, which included one overnight occasion. Police describe what happened here: @webpagelink"},{"comment_id":"939707739399900","commenter_b":"It used to be fairly common to have a cross on the flag pole representing the same thing as Christ above all.","commenter_a":"I am a Christian but, no flags are to be flown over the flag of the United States. I DO feel his frustration but, this is a no-no. God Bless America !","post_message":"Are you OK with this?"}]
