[{"comment_id":"10153971100801600","commenter_b":"If we won when I was a kid my parents would have kept me out. My son deserved to be there... I was more than happy to take him!","commenter_a":"Shouldn't of had school","post_message":"The numbers are in.   Should parents have taken kids out of school for the parade?"},{"comment_id":"10153253558949575","commenter_b":"Just go ahead and remove her from this planet. That kind of person isn't needed here.","commenter_a":"What a POS! Hopefully she will never get custody of her child back! WTH is wrong with ppl!?!....SMH!","post_message":"An Ohio woman has been indicted on charges she trafficked her 11-year-old daughter to a drug dealer in a sex/heroin exchange."},{"comment_id":"10153142288487217","commenter_b":"USA is a dangerous place to live in. even Army men are not safe there. the brave men was unhurt in France even in terrorist attack. but in USA he got stabbed. Muslims terrorists are everywhere in USA TODAY","commenter_a":"Ban knives!!!!","post_message":"The airman, who was hailed as hero after the French train terror attack, is in a stable condition after being stabbed in California"},{"comment_id":"1036789886341367","commenter_b":"There is no way the American people will vote that evil woman into office.","commenter_a":"I think the GOP has had about enough of Trump, lol.","post_message":"U.S. Republican presidential candidate Donald Trump insisted on Sunday he was \"100 percent right\" when he said he saw Muslims in Jersey City, New Jersey, cheering the 9/11 attacks on the World Trade Center even though fact-checkers have debunked his claim."},{"comment_id":"10155218043119411","commenter_b":"But I am American...maybe its not just what is in your dna but what is in your ideals and thoughts","commenter_a":"Just because he lives in one of the countries of europe does't make him a European, Europeans are people just like Asians, Africans or Indians with roots and ancestry from the said places. If I moved to Japan I wouldn't automatically become an Asian.","post_message":"'He European, just like you. [He] has a university degree, a figure that you never have, and a beautiful wife at home (who is white and blond)'"},{"comment_id":"10153700532617894","commenter_b":"Make me. Hip hop is my lane. Silly woman.","commenter_a":"What is she doing at a T.I. concert if she don't want too be questioned.","post_message":"Model Shot at T.I. Concert to Sue ‘Heartless’ NYPD for Treating Her Like a ‘Criminal’ During Their Investigation"},{"comment_id":"704776766379568","commenter_b":"Yes deport them","commenter_a":"Only if it's to hell. I would never let her lose on another","post_message":"Controversial photo of Michelle Obama has many calling for deportation.  She doesn't deserve to be our First lady.  Would you vote to have Michelle Obama deported?"}]
