[{"comment_id":"627551224082449","commenter_b":"What a nasty woman. ...","commenter_a":"Rosie is totally against any heterosexual type of sex,she would prefer all people were gay like her.s","post_message":"Rosie O'Donnell called Donald Trump a “demented human being,\" a “sexual predator,” and several other nasty things."},{"comment_id":"10154274574160329","commenter_b":"Grace Lee Justin Bloch","commenter_a":"Gabriel Cortez","post_message":"OMG!!!"},{"comment_id":"10153597366220329","commenter_b":"Like we're met to be best friends lol","commenter_a":"Craig! I still think it's you.","post_message":"It's not me, it's your god damn chargers."},{"comment_id":"944724415582961","commenter_b":"Fuck all white people they stink as fuck come in my yard I'll kill all yall bitches I don't give a fuck about them crackers when they die they turn black bitch we all come from dust one man one woman dust is what color Brown bitch you black like us","commenter_a":"Sharokina Haghee","post_message":"This happened. A Facebook user who goes by the name of Geris Hilton posted a photo with a black child, who is allegedly the son of his co-worker. What happened next, will leave you disgusted. He and his friends decided to make racist “jokes” at the child’s expense. Had it not been for Black Twitter, they would have gotten away with it. MORE -----> @webpagelink"},{"comment_id":"410883789115113","commenter_b":"I don't understand why they are picking on Trump! If I remember correctly the other candidates said the same thing. They did not want anymore refugees brought into to us but only Trump getts STOMPED for it.. DC is so afraid of him. Go Trump!","commenter_a":"Pot calling the kettle black.","post_message":"Trump is being attacked from all sides. He needs our support. Can we get 70,000 'LIKES' to elect Trump for president?"},{"comment_id":"840187412685267","commenter_b":"How about no sex till your married. No need for pills or protection. Problem solved","commenter_a":"you can't fool Mother Nature","post_message":"New commentary from Matt Walsh on birth control. \"Where is the feminist outrage when you need it?\""},{"comment_id":"10153393648949228","commenter_b":"Actually, it's not normal for any woman to expose herself in public... feeding or not. It's quite self-centered.","commenter_a":"We all have to have something to complain about. It's like the news gives us one good story and the rest has to be bad. Give it a rest people. It's a normal mother instinct. LEAVE IT ALONE","post_message":"\"The mall told me it's perfectly fine, perfectly legal to breast-feed."}]
