[{"comment_id":"1089868204425048","commenter_b":"Ugly racist bitch","commenter_a":"Leave the Sgt alone he is right she shouldn't have done that it took me two times watching it to figure out what she was doing and it not right","post_message":"This officer thought he could speak his mind about Beyonce's halftime performance... but as soon as he spoke out, he got some VERY bad news.  He never though this could happen....  Welcome to Obama's America."},{"comment_id":"10155690406614199","commenter_b":"She started it. First of all she knew it would take her long so why didn't she let him go first. Second of all she poured her drink on him. At it sounds like she isn't very honest. And sorry but she looks like she's on drugs. This is what happens when you push people to far","commenter_a":"I think because she lied and she threw the first thing to get the conflict from verbal to physical either she gets punished or he gets off free. This is soo sexist if a guy threw a drink at a lady and she smacked him in response pretty sure she would get away with it.","post_message":"Police have released surveillance video from an alleged attack at a grocery store that tells a bit of a different story than the one the alleged victim gave."},{"comment_id":"10154373252360329","commenter_b":"Women can wear whatever they want.","commenter_a":"She's very talented & beautiful but please stop trying to normalize the antiquated religious practice of women covering themselves. Women have come too far to regress back to this BS! (That goes for Orthodox Jews, Islam, & Christian nuns.) Little girls all over the world: your body is not shameful! You do not need to be modest to lessen the desires of men or a masculine God! You are beautiful in all of your natural glory!","post_message":"She also does comic book characters and Kardashians."},{"comment_id":"416896861831941","commenter_b":"I do not think Hillary will win (fairly anyway).","commenter_a":"The even bigger issue is that 46% of people still think he's a good president.","post_message":"I am ONE of them...do you?"},{"comment_id":"1769168636661696","commenter_b":"Love her(homegirls)we going to build the wall and who's going to pay for it?????","commenter_a":"Sounds like home girl need to read up on her history! California is was part Mexico territory!!! And native European Californian, she just rambling!!","post_message":"'Will you go out and pick the strawberries?'  Donald Trump protesters clashed with his supporters at his San Jose rally yesterday to make a point about an issue close to their heart: illegal immigration.  @webpagelink"},{"comment_id":"10154475090187098","commenter_b":"Let's nuke 'em now !","commenter_a":"Can we drop some nukes on them already? What's taking so long?","post_message":"MISSILE TEST: North Korea reportedly fired a ballistic missile in what would be its first such test of the year and an implicit challenge to President Donald Trump new administration."},{"comment_id":"682384888576953","commenter_b":"Dumb woman.","commenter_a":"Well she said she meant it in jest and didn't much care if people are offended. So she did admit she was the person that posted it. Now that the voters know who she is the question is will the party still support her. My guess is yes.","post_message":"And you know it wasn't her fault, right?"}]
