[{"comment_id":"10153187015096051","commenter_b":"Carolyn, have some respect. He is our President after all. President Obama has made America great. We don't need Trump to mess it up.","commenter_a":"Agree. Obama is a joke and think the world knows it. He's like a bad kid. Just had to say something because he's mad. And the rest....thought he was talking about himself. The US does deserve better than him","post_message":"President Obama had some harsh words for Donald Trump today."},{"comment_id":"10153175852531990","commenter_b":"That ain't no woman either !","commenter_a":"400 lbs with a beard.....that ain't no woman!","post_message":"BEARDED WOMAN: So this happened. @webpagelink"},{"comment_id":"10154684991066077","commenter_b":"Women are awful","commenter_a":"If it was Chelsea Clinton line every talk show news media blah blah blah would be wearing them...funny Ivanka isnt even a republican.","post_message":"The decision to drop the line, which is owned by the Trump Organization, follows last week’s move by Nordstrom to discontinue sales of evocative Trump’s fashion brand."},{"comment_id":"10153989537064203","commenter_b":"Lots of women in Iran do not wear head scarfs","commenter_a":"I wouldn't want to land there. They'd want me to wear a headscarf to walk off the plane. Nope","post_message":"If they had not become international pariahs, could Tehran have been to airline routes what Dubai now is?"},{"comment_id":"10154913685773132","commenter_b":"can I grab you by the pussy?","commenter_a":"If Hillary is elected, we have a real good shot at losing religious liberty, the Second Amendment, the Fourth and the Fifth, having open borders....This country is going to take a very, very negative direction.","post_message":"Fox News host Shep Smith said Ailes made homophobic remarks around him."},{"comment_id":"10153918892062629","commenter_b":"Nah. We love Israel more than any state as far as funding goes. A Jewish president is more likely than an atheist.","commenter_a":"What the actual fuck?? \"Whites quit being racist long ago\"?? Surely this is satire and I've missed the humor. And it's not just about blacks. If we get a Jewish president, wait until the real pitchforks come out","post_message":"Whites, who are not racist, are ready to commit genocide if that is what it takes to stop black people from being racist."},{"comment_id":"10153806132721051","commenter_b":"@username How is going to all those with the wars he's going to start increasing taxes on the middle income and lowering it on the rich. Building a wall where's that money coming from? not Mexico. Putting a 35% tariff on goods from China. Good move Trump and the China and other countries do the same to us. How about that lost American jobs?. You don't think Mexico buys from us? What about machinery, minerals, autos, trucks and military equipment anf farming equipment.","commenter_a":"Interestingly Trump praised all of Obama's policies. Now he says he's done a terrible job. He praised Hillary's job performance as Senator and Secretary of State and endorsed her for POTUS, now he calls her incompetent. Hmm. Should we really elect someone with such horrible judgement?","post_message":"In an interview today, Donald Trump said President Obama has done a \"terrible job\" in office and has allowed countries to take advantage of America. Is he right?"}]
