[{"comment_id":"10153646970166336","commenter_b":"She'd be worse than that in the role of President!","commenter_a":"She jeopardized National security!! The idiot!!","post_message":"Hillary Clinton said in an interview Friday that she’s “sorry” her use of a personal email for State Department business has “been confusing to people,” but didn’t offer an outright apology for her actions."},{"comment_id":"10153073313318445","commenter_b":"The queen only has a cheeky one tho!","commenter_a":"Come on America if the queen can have it. Why can't we?","post_message":"UK's First #Cannabis Pharmacy Opens in London!"},{"comment_id":"468040403386540","commenter_b":"They need to leave America!!!","commenter_a":"No, do we get ours? Did any of our relatives from the past get their's","post_message":"Should The US Allow Muslims To Have Their Own Areas? Comment 'yes' or 'no'."},{"comment_id":"10155148038011336","commenter_b":"Trump doesn't refute facts in any logical way. He doesn't present evidence to the contrary, just declares that anything negative about him is fake news. Does this not concern any of you?","commenter_a":"Funny how people have forgotten the numerous times Obama called @username out during speeches, press appearances, and other forums. But Trump doing the same thing is suddenly \"horrible\" and shocking...","post_message":"\"He has EVERY RIGHT to call them out.\" On \"FOX & Friends Weekend,\" Herman Cain discussed President Donald J. Trump's often contentious relationship with some in the mainstream media."},{"comment_id":"10153475201369170","commenter_b":"Unreal. Liberal democrats are NOT AMERICANS!!","commenter_a":"And how many admirals and generals have been \"retired\" for their conservative, pro strong military views during the current administration?","post_message":"How can we have possibly let it get to this point?"},{"comment_id":"775605039243294","commenter_b":"Experimental Sexual Preference Network - no longer watching this no moral standards network","commenter_a":"I will not be watching any more","post_message":"Leftist ESPN goes all in..."},{"comment_id":"572501256275839","commenter_b":"Why aren't people moving to Mexico instead of Canada??? LMAO CAUSE THEY ARE RACIST","commenter_a":"That woman who said women that voted for Trump are dumb was speaking for herselfLast laugh on us that voted for Mr. Trump","post_message":"Donald Trump STUNNED the media with his big win. Here's #2 in the media's stages of grief: ANGER."}]
