[{"comment_id":"1141429345895300","commenter_b":"Why doesn't he close the border and escort all of the illegals & especially Muslims out of our country?","commenter_a":"TIME TO DOWNSIZE DHS. Secret police full of pussies. The whole thing is useless.","post_message":"BREAKING NEWS:"},{"comment_id":"484066138450614","commenter_b":"'@username any woman who needs a leader is not going to be the best wife.","commenter_a":"If that was my husband, he'd know his place, and it wouldn't be in my house. More like on the pavement.","post_message":"Kirk Cameron:  'Wives shouldn't tell their husband how he ought to be a better husband'"},{"comment_id":"1061797757169218","commenter_b":"Save Western Civilization? You mean save white people.","commenter_a":"And where was our so called president ??????","post_message":"The prime minister of Israel, Benjamin Netanyahu, gave an historically important speech. A speech that any previous American president could have and maybe would have made, a speech to rally and save Western civilization."},{"comment_id":"10153072865096717","commenter_b":"She would get beat down","commenter_a":"I'm not surprised. The only person she gets along with is Q-Tip, and his single greatest contribution was a cameo on the Dave Chappelle Show where he told kids to 'do the VD dance.'","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153514058971336","commenter_b":"We are all illegal one point American got started by illegals","commenter_a":"13 million illegal aliens keep me up at night.","post_message":"Attorney General Loretta Lynch said that a cyber-attack by the Islamic State is perhaps the terror group’s biggest, emerging threat."},{"comment_id":"10153641394251350","commenter_b":"I think she would be a skank in a princess gown.","commenter_a":"Hilarious ! She has guts. Good for her!","post_message":"What did you think of Miley Cyrus' first outfit of the night at the MTV Video Music Awards?"},{"comment_id":"10153511380259641","commenter_b":"I can't believe some of the comments here - So much hate {that's not justified} :/","commenter_a":"RIP the old England, lost to Islam now.","post_message":"#TBT:"}]
