[{"comment_id":"1065530533487804","commenter_b":"And yet she's still nasty as hell.","commenter_a":"I am a fair-skinned caucasian with vitiligo. I have always been grateful that my light skin color kept it from being as apparent as it is on a person with dark skin. I applaud the openness, but I find it interesting that the earlier pictures had the vitiligo spread on her face much more widely and less symmetrically.","post_message":"Here's a story for anyone who's ever hated feeling different — aka a story for everyone. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10154665799440141","commenter_b":"We need to stand by our country and our values. Anyone who is allowed into the United States needs to be totally vetted first. I'm sorry, all of you \"open-minded\" people, this just makes sense. Because we are 'Merica!!!","commenter_a":"Islam is evil","post_message":"“All over Europe, all over America we have seen the devastation of evil in our time which is radical Islamic terror.\" Sean Hannity hosted this heated panel on the rise of radial Islamic terrorism."},{"comment_id":"10154666136846833","commenter_b":"I'm thankful there isn't enough police to stop all crime! Because then we would be living in a police state!","commenter_a":"There is one more Woman who Had a gun to protect her Family, but a lot of Americans who will never be Able to protect there Family's for not owning a Gun. They live in a elusion of Safety that the Police have enough manpower to Protect them. Unfortunate there will never be enough Law enforce Officers to protect everyone. It is up to you to Protect yourself as much as possible.","post_message":"If three intruders break into your home and hold your spouse at gunpoint, what would you do? This Florida woman was faced with that dire scenario last week. Thankfully, she was able to run to the bedroom and grab her own firearm to end the ordeal and save her husband."},{"comment_id":"10153215419029726","commenter_b":"She is a much bigger problem than wild Willy","commenter_a":"possibly the only reason she wants to be president is so that she avoids prison time.","post_message":"Are YOU Ready for Hillary? Which is her bigger problem... Benghazi, missing emails, Wall Street? @webpagelink"},{"comment_id":"1501229893270468","commenter_b":"IDIOT!","commenter_a":"I want to hear her say it 2 minutes into the stoning. Damn liberals are stupid.","post_message":"Has she LOST her freaking mind!?"},{"comment_id":"1676979775916397","commenter_b":"IF TRUMP CANT HANDLE SOME FEMALE MODERATOR HOW THE HELL WOULD HE HANDLE WORLD LEADERS? GIVE ME A BREAK. DONT EMBARRASS THE REST OF THE COUNTRY NH!!!","commenter_a":"New Hampshire vote for him! Trust Trump! Thank you for volunteers!","post_message":"I enjoyed a great breakfast at the Airport Diner! Everyone get out & vote in New Hampshire! Lets MAKE AMERICA GREAT AGAIN! Voting questions? @webpagelink"},{"comment_id":"10154602767897619","commenter_b":"We are with you Isreal, kill the muslim trash and leave them in the desert","commenter_a":"i do pray for Jerusalem !","post_message":"We <3 Israel. -VirtualJerusalem.com"}]
