[{"comment_id":"10153629371177235","commenter_b":"Gay marriage Trumps Straight Marriage, get lost Huckabee:)","commenter_a":"Down with Huckabee, as Donald would say, LOOSER..... .","post_message":"If God already 'solved' racism, he didn't do a very good job ..."},{"comment_id":"1673680616215825","commenter_b":"Stop letting this mother fucker control our future","commenter_a":"Nope","post_message":"Obama Gives 1.5 Billion Dollars To Muslim Brotherhood For THIS SICKENING Reason.  This shows you where his allegiance really lies.  Do you think Obama is a traitor?"},{"comment_id":"1425446234154201","commenter_b":"That chick Greenville Reece is crazy","commenter_a":"Is an idiotic argument when people say that the world is flat take some Physics classes in college and you will actually do experiments to look at this phenomena. Don't educate yourself off YouTube actually read some Physics books, even physics 201 and 202 in college will answer this a question.","post_message":"Kyrie Irving got defensive when a reporter asked him about his recent comments on the idea of the Earth being flat."},{"comment_id":"1016566111717194","commenter_b":"What a fucking hypocritic Bitch.","commenter_a":"Please don't accuse her for stealing a flag. She needed one to wear for a photo shoot to feel nostalgic about a time when she was a playmate.","post_message":"An enraged conservative attempted to steal an American flag from African-American protesters and fought with police, but was not arrested...at a demonstration regarding white privilege."},{"comment_id":"10153632198263908","commenter_b":"These girls suck. There's no way around it.","commenter_a":"So enlightened yet judging girls because they take a selfie..","post_message":""},{"comment_id":"1004458709688902","commenter_b":"Yo entiendo","commenter_a":"@username should fucking be ashamed of themselves. I see that you are just like most Corporate News Organizations which takes a real issue then contort it for your clicks and likes. I am a Black American. I have been living in the Dominican Republic for 3 years. I hold 3 degrees to include a JD and an LLM. I am going to tell the truth and I hope to never see such nonsense like this published again. As I said I been here for 3 years. I came here not knowing a word of Spanish because I as a Black Man wanted to get away from America. I spent 11 years in the Marines also and I have traveled the World and NO WHERE have I been or felt more free than living in the Dominican Republic and that is a very real yet sad statement, a testimony if you ...","post_message":"This Video Sheds Light on the Deep Racism That Black People Face in the Dominican Republic #ABSArchives"},{"comment_id":"536936909817584","commenter_b":"both plans are BS","commenter_a":"Interesting. Makes sense though. Someone has to pay for all the freeloaders and the Crap that the Dems promise them.","post_message":"Here's how much your taxes could decrease under Donald J. Trump and rise under Bernie Sanders. @webpagelink"}]
