[{"comment_id":"10154729609496729","commenter_b":"Unfit evil lying grandma killery","commenter_a":"She only said it because she wanted to diffuse Trumps statement. Too late to get on that band wagon. Meanwhile American lives are lost due to stupidity.","post_message":"Whoa. About damn time."},{"comment_id":"10154577963871323","commenter_b":"President Mitterand had wife and kids plus a lover with who he had a girl!!! Lol","commenter_a":"If it was France or even Italy it wouldn't be an issue and would be distasteful to bring up in public. In America there is a certain ownership in marriages rather than partnership. Maybe she loves him as a man and equal in mind, the fact that he does have a wandering eye (penis) may be something she is willing to accept the way we accept a partner's handbag obsession.... Just saying....","post_message":"The end of a relationship – even a years-long marriage, even an otherwise-good relationship, even with children in the mix – is, at this point, the only acceptable consequence of infidelity, and staying is posited as the inexplicable choice for a woman to make.  But life and love are more complicated than that for many people, even in 2016."},{"comment_id":"543574859135802","commenter_b":"Those dang Muslims and their transgender bathrooms...","commenter_a":"No fucking way my child would ever be placed in a school where boys could come into a bathroom with her..fuck is wrong with people?i am SOOOO glad To live in Kentucky these days..in all honesty I've always hated it here but at least my state doesn't go for all this liberal,homo,Muslim bullshit..","post_message":"What can only be described as an absolute shitstorm."},{"comment_id":"10153935429529726","commenter_b":"That motherfucker is insane. Period.","commenter_a":"It couldn't be her dishonesty and lack of personality.","post_message":"WATCH: Howard Dean: Sexism to Blame for Hillary's Communication Problems"},{"comment_id":"684886304977884","commenter_b":"I wonder the same thing when I see those clowns busting out the tricorn hats and teabags.","commenter_a":"Don't these people protesting have jobs?","post_message":"I wish there was a LOVE button on Facebook."},{"comment_id":"996595140397015","commenter_b":"These gun nutters are too chicken to go fight a REAL threat, so they try to intimate normal people. You freaks are just trying to intimidate people. Red beck, Inbreeds!","commenter_a":"You don'y have to give up your guns, and no one is proposing that (I'm a gun owner and a vet), to have sensible regulation.","post_message":"“I grew up in Tucson, Arizona, and I live there now. And I'm a gun owner and a supporter of the Second Amendment. But I couldn't give you more credit that we need to deal with the wrong people getting guns, especially with mental illness. As you know, in Tucson we had a person who had all kinds of trouble and was able to buy a gun. In Virginia Tech. In Louisiana… So from a gun owner, from a reddest of red states, and a person who owns guns, more power to you.” —an attendee at Hillary’s town hall on gun violence prevention in Manchester, NH"},{"comment_id":"10153564606248984","commenter_b":"She needs to be taking down. She not worried about what you doing. This needs to be done quickly","commenter_a":"She should not be allowed to run. She is a liar bad person evil evil !!!! If she gets in people pack your bags go anywhere don't stay here she will put the cherry on the demise of our country !!!!!!","post_message":"Hillary’s been caught in another blatant LIE regarding her private email server. In a recent interview, Hillary said she had not been subpoenaed by the Select Committee on Benghazi, but records indicate she was subpoenaed in March 2015. Even the press covered it!  Rep. Trey Gowdy won’t tolerate her deceit, and neither will we.   Send a message to Rep. Trey Gowdy telling him what you think!"}]
