[{"comment_id":"10154300951236519","commenter_b":"But Hillary lost. There will be no Gulag.","commenter_a":"Boy, at least He can feel like he has clean hands as we are all marched into the Gulag. Very comforting.","post_message":"One elector defected so far, but not from Donald Trump."},{"comment_id":"475250429347483","commenter_b":"Everybody in this country already is lying each other up every day!! Just BIG LIARS!!! So what's the big issue with her hidden lies!! OOOOPS!!! I forgot... it's because she is from another country and had way more passion and enthusiasm to drive her to be smart and do well and two other things she a female and of a different skin tone in RACIST, SEXIST AND BIGOTED ALONG WITH ALL SYMPATHIZERS; AMERICA and hell across the world!! AND HELL YEAH I SAID WHAT TOO MANY DON'T HAVE THE HEART ARE SPINE TO SAY ESPECIALLY ALOT OF THE ONES THAT GOT WEALTH, PROFESSIONS, RICHES, POSITIONS, MATERIALISM, FAMILY AND ESPECIALLY MOST THAT ARE MIXED RACED RELATIONSHIPS; AND YOU KNOW WHAT I'M SAYING... BUT IF YOU DON'T THEN: JELLY SPINE OR SPINELESS, WEAK, TAIL TUCKED BETWEEN THE LEGS, GUTLESS YES MEN/WOMEN SUGAR COATED AND WATERED DOWN COWARDS THAT FEEL THEY GOT TOO ...","commenter_a":"How is her schooling funded?","post_message":"This 4.95 GPA student revealed her status as undocumented immigrant during her graduation speech.  #MicBrights"},{"comment_id":"1222948041117063","commenter_b":"Grow some balls bitch!","commenter_a":"You look redickuselse's.........","post_message":""},{"comment_id":"1193495714026101","commenter_b":"If they can live by our laws get out of our country","commenter_a":"Amen !!!!!!!!!! They must be stopped from take over and destruction. All states please follow. Help us keep our great nation. !!!!!!!!!!","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10154178677146943","commenter_b":"Abedin is corrupt woman with an agenda..Hillary's agenda. Watch..if anyone goes down for corruption it will be her, and Hillary Clinton will get off by throwing her under the bus! It seems to me that HC always surrounds herself with live shields for her own protection. Everyone of them should be held accountable..starting with Hillary Clinton!! Why is she even a candidate?","commenter_a":"Lock them up...Lock them up...Lock them up!!!","post_message":"A Clinton Foundation donor and St. Louis-based political consultant begged Huma Abedin to get former Secretary of State Hillary Clinton to meet with her client, the U.S. largest coal company, according to emails released by a conservative legal group.  , I need your help now to intervene please, Joyce Aboussie, a Clinton Foundation donor with close ties to the former First Family, emailed Abedin in June 2009 after Clinton had been leading the State Department for about six months. - via The Daily Caller"},{"comment_id":"972624222819497","commenter_b":"Go get her!!! We cannot have another 8 years of Obama's disastrous policies and her stupidity!","commenter_a":"*WE THE PEOPLE* HAVE SPOKEN, VOTED FOR OUR NEXT PRESIDENT @username.. KILLERY CLINTON NEEDS TO GO TO #HILLERYFORPRISON2016","post_message":"I am the only one who can beat Hillary Clinton. I am not a Mitt Romney, who doesn't know how to win. Hillary wants no part of \"Trump!\""},{"comment_id":"10152829725821051","commenter_b":"if she shop lifts why isn't' the bitch in jail","commenter_a":"You mean she isn't stealing now?","post_message":"This shoplifter has never had a job. She current lives in rent-free housing and receives monthly benefits. She says if her benefits aren't raised, she'll go back to stealing."}]
