[{"comment_id":"748263168643341","commenter_b":"Trump is a racist bigot who drives fear into weak people just like Hitler #dumpthetrump anti-muslim isn't a political opinion its bigotry. and his anti-hispanic is talk is racism","commenter_a":"America doesn't thrive off fear we don't feed off hate and we will certainly not have a president that represents all that is wrong in this country. Hillary is who we need in charge #dumpdrumpf #imwithher","post_message":"\"I don’t think there is anything more important than working to provide every child in this country and beyond the chance to do what that child is meant to do, because I think every child has a God-given purpose and a God-given potential. That means every child deserves a good teacher and a good school regardless of the zip code that child lives in. That means every child deserves the health care that will keep that child healthy, will deal with whatever befalls him or her. That means that the child’s parents and grandparents deserve good jobs with rising incomes to provide a good, solid life for their son and daughter, for their grandchild.\" —Hillary"},{"comment_id":"10153846244313984","commenter_b":"Dumb bitch","commenter_a":"Well said Rubio!","post_message":"WOW. Out of all the things she could have been doing, or should have been doing - THIS is what she chooses. It's pretty unreal to think that some people actually want her to become the next POTUS... Do you think it's time for Hillary Clinton to drop out of the 2016 presidential race?"},{"comment_id":"10153774465069170","commenter_b":"She is Pure Evil.........","commenter_a":"Gosh, I am so sorry that this is a waste of her time by the way she looks in this picture. This woman really believes she's above the law and she really needs to be indicted on this and her email server!!","post_message":"Forget all the analysis of this like it's a boxing match. All that matters is the facts that have been revealed, and these 10 minutes are the most important you can possibly see."},{"comment_id":"1243590202327674","commenter_b":"Hmmmm maybe we should stop any more Christians from coming to the US","commenter_a":"WTH is wrong with people!!!","post_message":"\"Nothing can describe the pain and sorrow of the remaining family members.\""},{"comment_id":"782624725204041","commenter_b":"SJ Shang dumbshit, the topic is how the allegedly peace-loving Muslims treat their kids. We have enough problems with idiots shooting each other in the US, we don't need more sand monkeys doing the same, whats so hard to understand about that? But you want to digress, fine. Americans desperately want to have dope legalized, to make themselves feel good. 80% of Americans are overweight, because they are lazy, they love to pop and abuse prescription pills and illegal drugs. They don't drink and drive responsibly, insist on texting while driving and play Candy Crush on the job. They refuse to live within their means, balance a checkbook. The last thing they need is one more useless addiction, and yet they whine and yammer about their right to be high .\"Dope fixes everything. If we smoked dope nobody would die from cancer anymore\"","commenter_a":"But we don't want Obama to address white Christian American murderers of children here because he might take our guns. Seems legit.","post_message":"I want a REAL president to step in and take these bastards out once and for all..."},{"comment_id":"742199012637343","commenter_b":"No sharia law here. Go back where you came from.","commenter_a":"What many have said thy plan to take over the country. CAIR","post_message":"Muslims Trying To Enforce Sharia Law In America Just Got Some Very Bad News [VIDEO] If you are going to live in America, you will have to abide by our laws. Do you think Sharia Law has no place in America?"},{"comment_id":"10153564847120530","commenter_b":"The father had been living in Israel when this divorce started years ago (I believe I read he currently lives in the states though) and left for a two week business trip the day after the kids were sentenced so he obviously has no time for his children that he \"cares so much to have a healthy relationship with\". He's a bad dad, the woman is a bad mom and this judge is a joke.","commenter_a":"She said all you need to know - that this was an EXCEPTIONAL case - and that there was a disgusting pattern of mental abuse/programming by the mother towards the father. Unless you are a family member who has lived through something like this, you have absolutely no idea what damage can be done to the children permanently. In our case, the The fathers children passed away from a unknown heart disease very young, and those children will never get the chance for any kind of reconciliation with him. The mother is a hateful woman, and her daughters now have no relationship with the father's side of the family because of her. The only the kids may EVER have a chance to not be screwed up permanently is by doing this. Blame the parents? What good has that done? There was cause for extreme action here - and the judge ...","post_message":"\"I wanted to do this because of your horrific behavior a long time ago and your dad begged me not to.\""}]
