[{"comment_id":"10153717683207894","commenter_b":"'@username Nobody's voting for Hillary? Why does she have 3 million more votes than Bernie??? I'll wait","commenter_a":"I don't know why people spew unnecessary hate for this woman, She has millions more votes than Bernie and is the better between her and Trump. What did she do so bad to you all? Bernie Sanders got yall head messed up. And that whole Bernie or bust thing is IGNORANT as hell. Writing in Bernie Sanders name is basically a vote for trump, smh","post_message":"Hillary Clinton Reaches Delegate Count, IS the Presumptive Democractic Nominee for President"},{"comment_id":"10153222485020329","commenter_b":"George Bush","commenter_a":"How come the penis got a fun name but not the vagina???? You're all Sexist Pistols.","post_message":"Urethra Franklin FTW. (A BuzzFeed BFF original.)"},{"comment_id":"1112320072187475","commenter_b":"Comparing this flooding to hurricane katrina is like trying to compare Benghazi to Iraq 😂😂💦","commenter_a":"What's happening in the US of A before the election happened in the Philippines. The big news network had been obviously bias against one candidate and it seems that this candidate cannot do anything right for them for obvious reasons. Even the Roman Catholic hierarchy are all bent on preventing our presidential candidate to win the election. But lo and behold the people have spoken and are up in arms against these giant nerworks and rallied their candidate of choice to win decisively. Wake up America you are being manipulated by a few who have selfish interest and only have themselves to enjoy if their will be done.","post_message":"President George W. Bush was torn to shreds in 2005 by mainstream media commentators for his initial response to Hurricane Katrina – yet President Obama’s detached response to the recent Louisiana floods has been met with resounding silence from those same outlets."},{"comment_id":"479436158913631","commenter_b":"She is a POS that has never done anything but take all she can get. She's an entitlement ho that plays the race card to get her way.","commenter_a":"VETERANS I'VE GOT NO RESPECT FOR THIS WOMAN WHAT SO EVER.","post_message":"Michelle Obama just made an outrageous claim...  Our soldiers fight and die for our country, Michelle takes lavish vacations.  Do you respect our veterans over Michelle?"},{"comment_id":"10154075647091770","commenter_b":"You are totally right, Tucker.","commenter_a":"We turned to Hollywood to be entertained...NOT FOR POLITICAL COMMENTARY OR OP-ED! It really is that simple.","post_message":"Tucker Carlson has a message for Hollywood liberals"},{"comment_id":"10154439835324203","commenter_b":"It takes brain power to watch a documentary? Lol","commenter_a":"not many of Trump's supporters read these guys, nor watch PBS documentaries, too much brainpower needed.","post_message":"David McCullough, Robert A. Caro, Ken Burns (PBS), and more have stepped up."},{"comment_id":"10154465141311037","commenter_b":"Melania DUMP","commenter_a":"Think the media wants to sh!t all over this to distract the public on what's really going on...","post_message":"Did Donald J. Trump's campaign literally just RickRoll the nation?"}]
