[{"comment_id":"1167920019941418","commenter_b":"@username and real men don't use emojis to other men over the Internet","commenter_a":"Donald trump used to endorse boxing a lot. That's why don king and Tyson support him. They actually know him instead of judging him based on the Internet and tv","post_message":"#DonKing is advocating for #DonaldTrump now! #WSHH"},{"comment_id":"1224890174198658","commenter_b":"Alexandre Brault c'est ca le vidéo que je te parlais!!","commenter_a":"Akam HS and yeah as I told you we are a cell of another humans ass","post_message":"This is so trippy. From galaxies all the way down to quarks."},{"comment_id":"674600329361440","commenter_b":"rep need to get a life","commenter_a":"Look at that! I bet there are at least 100 people there! Maybe unpaid to boot!","post_message":"WATCH LIVE: Hillary Clinton and Elizabeth Warren campaign together in New Hampshire."},{"comment_id":"614347815409395","commenter_b":"Easy win! He will roll across her !","commenter_a":"Will she be stoned throughout the debate?","post_message":"Who do you think will win the first presidential debate?"},{"comment_id":"509555075871545","commenter_b":"We will never stop fighting for animals! <3","commenter_a":"OMG ! Enough already ! So very very sad...Cruelty to these animals is dead wrong wrong wrong. Aaron for putting this out there for all to see ! Thanks Keep showing everything you can. You are doing important work. This is your real work here on the planet '","post_message":"It takes the feathers of approximately 75 birds who go through THIS to make ONE down comforter.  It's 2016. There is no excuse for this."},{"comment_id":"902512513119423","commenter_b":"Symbolism over substance. Can't solve problems in the real world. I hope her mommy and daddy are proud...and didn't convert her bedroom...'cause she gonna be needing it for the near future.","commenter_a":"good for them, they are not thinking of themselves but of all the other victims and future victims. God bless every one of them.","post_message":"Hint: The university president was not pleased."},{"comment_id":"1204331449626601","commenter_b":"Lol","commenter_a":"I know I probably shouldn't but I find this diabolically hilarious.","post_message":"Someone sneaked up behind him  (via Daily Mail Australia)"}]
