[{"comment_id":"10152876069325950","commenter_b":"Enjoy your retirement Bob","commenter_a":"A straight shooter w/ a sense of humor and a poet to boot. Sunday won't be the same. We'll miss you, Bob.","post_message":"Bob Schieffer's 46-year career at CBS ends this morning with the 10:30 a.m. ET broadcast of \"Face the Nation.\" As we say goodbye, here's a lighter reflection with some of his best bloopers across the years."},{"comment_id":"10156358767360354","commenter_b":"Fuck that bitch and his man wife","commenter_a":"So sick of this repulsive little sob, 14 more months of the bastard, damn.","post_message":"“We’re going to be aggressive…”"},{"comment_id":"494885290693351","commenter_b":"Say what you will, but she has the right to stick with her belief.","commenter_a":"For one, she's not crazy, for two, Congress has to pass the laws,and no law was passed for her to grant marriage licenses to gays. Gods law, IS LAW","post_message":"One side has got to give in. Right?"},{"comment_id":"582227101946110","commenter_b":"@username wow you're a stupid women aren't you","commenter_a":"Let them come in. Legally. Sure. With good intentions. Make them Learn English. Tell them it's our rules. We're not making special laws for you. Your not coming in and changing our rights. Say the pledge of allegiance with the rest of us. Call it a good day.","post_message":"We are taking in thousands, and thousands of people into or country - we have no idea who they are -- and they believe in things WE DON'T BELIEVE IN! Not happening if I am elected president."},{"comment_id":"10154017496904753","commenter_b":"@username, shame on you as , should be, a lady sharing that garbage!!","commenter_a":"He should shout up and move on with is washed up singer Gwen. Miranda has kept silent . She is the classy one.","post_message":"Until today, Blake Shelton and Miranda Lambert have kept people guessing who really caused the divorce in their relationship. During an interview with Billboard a few weeks ago, the 40-year-old country superstar hinted that the 32-year-old songstress cheated on him. His song “She’s Got A Way With Words” was about a lover who cheated and lied. Shelton may not have written the song, but he said that he won’t stop people from thinking that some of the lines were about his relationship with his... @webpagelink"},{"comment_id":"10154992177868905","commenter_b":"It really is better to have a world view. Try it some time.","commenter_a":"BBC has really gone down the tubes! Stick with news from your own country and leave ours alone!","post_message":"Watch LIVE: Latest Trump news, talking deportation and anti-Semitism. Get your questions to us in the comments section..."},{"comment_id":"10154575281024877","commenter_b":"Melania looks like Caitlyn Jenner. !! !!","commenter_a":"Jobin, I fell the same way sometime it takes something to open her eyes maybe this is it","post_message":"This is one of the main reasons we need to stop treating Melania like a helpless victim."}]
