[{"comment_id":"543983115775139","commenter_b":"Let them keep walking to wherever they came from","commenter_a":"Let them walk all the way to the muddeled East.","post_message":"Muslim Students Walk Out During National Anthem [VIDEO] If don't want to show your respect for our country, you can leave. Are you appalled by their blatant disrespect?"},{"comment_id":"1771313199818566","commenter_b":"Women just need excuses to be shirtless in public","commenter_a":"No.. He's not the ex-Stanford swimmer. He's a convicted rapist! Stop pampering the white boy FFS!!!","post_message":"We’re outside the Santa Clara County Jail where people are protesting the release of Brock Turner. He's the ex-Stanford swimmer who served three months after being convicted of sexually assaulting an unconscious woman."},{"comment_id":"1160837804033382","commenter_b":"This is so STUPID....If you dont like America LEAVE","commenter_a":"National Guard please.","post_message":"Protest in dc"},{"comment_id":"10154150780421028","commenter_b":"@username, she may be immoral and gross TOO but shes not running for president","commenter_a":"Just wondering if NBC will be firing Miley Cyrus from the Voice? There are some really raunchy offensive videos of her out there. Can't imagine why it's ok for her to put that filth out there recently, but he's being punished for something so old.","post_message":"Billy Bush is leaving the \"Today\" show following outrage over the leaked Donald Trump tape, the show's producer says. @webpagelink"},{"comment_id":"699418583582053","commenter_b":"Jaye you're a perfect example of a dumb blonde .....","commenter_a":"What in the heck did Obama do to deserve impeachment!!!! People are just RIDICULOUS!!!!!","post_message":"Obama's college records were finally publicized and what they say... This is exactly what he has been trying to cover up for so many years. Do you think Obama should be impeached?"},{"comment_id":"10157239899915725","commenter_b":"Democrat lives don't matter.","commenter_a":"Say it Mr President .","post_message":"ISIS exploded on Hillary Clinton's watch- she's done nothing about it and never will. Not capable!"},{"comment_id":"10153862948491523","commenter_b":"You think women put these objects in themselves? This was a product recommended and approved by from their doctors. STFU","commenter_a":"Stop putting foreign objects in your body!","post_message":"Some of the women experiencing adverse affects from Essure are relieved to get hysterectomies to get the coils out."}]
