[{"comment_id":"10154044965451717","commenter_b":"The school I taught at had GSA. Admin discovered they HAD to allow it because they had FCA (Fellowship of Christian Athletes). Best use of irony. If a school has a non-curricular club it must allow other non-curricular clubs on campus. Federal law!","commenter_a":"When I was in high school we had one, he next year we got a new principal and he shut it down","post_message":"The ACLU says the ruling strengthens the rights of middle school students, putting them on the same level as high school students."},{"comment_id":"10154220107672293","commenter_b":"@username idiot","commenter_a":"Like the Central Park rapists (5 young black boys) some years back that Trump railroaded into jail, then never apologized when someone else confessed.","post_message":"Cooper was wrongfully convicted of armed robbery in Indiana in 1997, and he is still waiting to be pardoned."},{"comment_id":"10153791461399607","commenter_b":"No the home owners are getting a 10 yr break on property taxes. Look up Eager Park Townhomes.","commenter_a":"Who the hell can afford it, hell I bet the city will hit you with a $5,000 a year property extortion, I mean tax..","post_message":"Johns Hopkins University is offering a $36,000 incentive to employees to purchase a home in the new Eager Park neighborhood in East Baltimore through its \"Live Near Your Work\" program."},{"comment_id":"10153264316296336","commenter_b":"Civil liberties can cram it where the sun don't shine! Freedom of speech for ALL.","commenter_a":"How about this group goes f@$#s it self","post_message":"A civil liberties group says this United States Air Force general should be court-martialed for speaking about how God has guided his career."},{"comment_id":"10153238960151438","commenter_b":"Ok clark. You win. All lesbians are fat hairy and ugly. That is completely accurate. No bullshit. You are a really smart person. So glad we had this talk.","commenter_a":"why are most queer women obese now thats a question","post_message":"Why don’t queer women flirt with other queer women?"},{"comment_id":"10157037705625725","commenter_b":"@username ILLEGALS","commenter_a":"This legal Latino is voting for Trump! Like if Donald Trump has revived your patriotism and faith in your country!","post_message":"We need strong borders to keep our country safe!"},{"comment_id":"10154267425314160","commenter_b":"Another nasty woman on the side of evil...GOOD WINS","commenter_a":"and you are Madeline Not So Bright","post_message":"\"There is a great term the Soviets used to use.\""}]
