[{"comment_id":"10153486926096770","commenter_b":"Conservative Populist? Lmfao","commenter_a":"Trump your next President.","post_message":"After acknowledging he will now raise money for the general election, presumptive Republican presidential nominee Donald J. Trump has named a national finance chairman who has a history with some organizations that could clash with his conservative populist message."},{"comment_id":"10153248513449087","commenter_b":"Stupid liberals so hope you run that old white socialist ass wipe.","commenter_a":"and democrats blame all the world's problems on Republicans, you old fart shut up","post_message":"'In their world, every problem that you can possibly imagine is caused by Barack Obama,” Bernie Sanders quipped at a campaign rally in Boston. 'If there is rain, if it’s too hot, if there’s a mosquito in the room, it is all Barack Obama.”"},{"comment_id":"10154014162531636","commenter_b":"Nope! Jeremy Corbyn.","commenter_a":"ISIS?","post_message":"BREAKING"},{"comment_id":"10152984956631378","commenter_b":"Alan. Yes, it is murder. Abortion isn't done at 8 months.","commenter_a":"If abortion is totally banned, get prepared for this kind of thing to happen far more often.","post_message":"POLICE: TEEN BEATEN TO ABORT BABY: Police say four family members were arrested after a 14-year-old girl impregnated by a relative was beaten in order to induce an abortion: 6abc.cm/1Q7wchn"},{"comment_id":"10153132227035326","commenter_b":"great white mess","commenter_a":"White Affirmative Action.. Donald Trump- another great White Hope! Trump joins a long list of rich entitled white boys who, were it not for their daddies, handing them everything on a silver platter, would have probably ended up on public assistance. Trump represents everything that is wrong with America. He is a gaudy bully and fake gold plated braggart who has showcased his business and moral acumen through a unending series of bankruptcies and divorces. He is a racist grifter and a criminal environmental rapist. In terms of patriotism and service to country, Bush, Romney, Cheney, Trump did not serve this country that they profess to love. But none of these fake ass patriots apparently have any qualms about sending other American children into harms way. For this crowd of 'real Americans' it's all about the Benjamins and what's in it for me. If America needs a cautionary tale as ...","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1225473394192695","commenter_b":"'@username you suck big donkey dicks","commenter_a":"A man of class, dignity, character, honesty...everything goid and positive. God bless our nominees, and the Unired States of America!","post_message":"Republican vice presidential candidate Mike Pence holds a town hall."},{"comment_id":"10153880251122217","commenter_b":"No. They should be pure. Virgin skinned, hairless.","commenter_a":"See John for the invisible tattoos.","post_message":"Send us photos of your tattoos! We'll be talking ink in the workplace with tattoo expert Dr Matt Lodder at 13:30 (BST) on #FacebookLive. We'll be showing some of your tattoos as part of our broadcast, so please email your snaps to yourpics@bbc.co.uk"}]
