[{"comment_id":"550023351824286","commenter_b":"Funny Denis.","commenter_a":"Good for North Korea, we have missiles why can't they","post_message":"The rocket was launched on a southward trajectory, as planned, passing over Japan's southern Okinawa islands."},{"comment_id":"10153143736247434","commenter_b":"Bitch, I will snatch the wig off your f'ing head! Don't come for us gays, whore. We don't play!!!","commenter_a":"Another example of LGBT being absolutely clueless when it comes to racism.","post_message":"These are by no means new rumors but now’s not the time for this, Alexis!"},{"comment_id":"1727798617495109","commenter_b":"She's a hottie","commenter_a":"Megyn Kelly is a dream come true.. Smart and beautiful","post_message":"“When I am wounded, I go after people hard, okay? And I try and ‘un-wound myself.’” — Donald J. Trump"},{"comment_id":"10152821814048717","commenter_b":"Lmao truth hurts!","commenter_a":"good job Rivas. leave the cheaters behind","post_message":"After helping the New England Patriots win the Super Bowl, Darrelle Revis has decided to go back to New York. The cornerback agreed to terms with the Jets Tuesday, his agent said. @webpagelink"},{"comment_id":"10154753364685225","commenter_b":"@username be quiet old hag","commenter_a":"This is what happens when you have real leadership in charge of the Country.","post_message":" is historic. The Dow Jones Industrial Average hits 20K for the first time. @webpagelink  #Dow20K"},{"comment_id":"10154280774612690","commenter_b":"Maybe you're not an American and you wouldn't understand anyway. Your fear is what leads you.","commenter_a":"After this election, the world has truly changed the way they see us. We have become a laughing stock for electing this idiot. If you can truly say you're okay, and you feel safe with Trump as president and his supporters on anew high, then I envy your privilege. Sit back and watch the fall of the American empire.","post_message":"In the largest Texas border city of El Paso, many people are reacting with fear and anger to the election of Donald Trump as president: @webpagelink"},{"comment_id":"10152746460981636","commenter_b":"Feminists are heavily invested in the rape culture narrative, the fact that they always attack rape prevention shows this","commenter_a":"Did you dare to suggest that the onus should be on the perpetrators of rape instead of the victims? Prepare for a tirade of comments accusing you of 'calling all men rapists'...","post_message":"Perhaps the focus should be on the perpetrators of rape, rather than potential victims?"}]
