[{"comment_id":"878409832218766","commenter_b":"Too lazy to be princess! Punish her to work at Royal Household!","commenter_a":"Like mother like daughter","post_message":"‘Scrounger’ Beatrice’s three holidays in a MONTH"},{"comment_id":"1195742003797367","commenter_b":"Nothing, they won't do anything to her. She is above the law.","commenter_a":"What difference does it make? It's only the law for everyone else, well non-liberals anyway.","post_message":"This literally just happened, folks!"},{"comment_id":"10154460904419411","commenter_b":"Nonsense. Religious claptrap has been indulged enough. They will never be satisfied.","commenter_a":"It's not OK. A country which excel in development like Swiss, must receive new minorities than traditional aliens. Therefore if you never had Buddhists, you will receive them make sure you also received their way of ideology. This is an article of Human Rights \"Freedom of Religion\".","post_message":" girls, whose names were not disclosed, said their religion prevents them from participating in compulsory swimming lessons with males in the pool at the same time.\""},{"comment_id":"10156572511460725","commenter_b":"You just hit a grand slam Ron! Trump 2017-2025","commenter_a":"Donald Trump - Think about it... will they stop him, Democrats and Republicans alike? This affects all Americans who get the short end of the stick Democrats and Republicans and Independents. Interesting take on Donald Trump Former U. S. Secretary of Education , William J. Bennett's frankly candid and shocking observations of Donald Trump's impact on the behavior of the entrenched Washington D. C. bureaucrats in both parties -- and the risk The Donald faces in so doing. William J. Bennett, Host of Bill Bennett's Morning in America Show, is one of America 's most important, influential, and respected voices on cultural, political, and education issues. He has one of the strongest Christian world views of any writer in modern times. What I See Happening In a Trump Presidency By Bill Bennett They will kill him before they let him be president. It could be a Republican or a Democrat ...","post_message":"What a great honor- the Reverend Jerry Falwell Jr. of Liberty University, one of the most respected religious leaders in our nation, has just endorsed me!"},{"comment_id":"481936961966259","commenter_b":"He was the saviour of Manchester last season You fickle lot Haha","commenter_a":"When i read what those nukes are capable of,and that there are people who'd use them,I honestly despair for the human race...","post_message":"Each warhead has an explosive power about 22 2/3 times larger than the Hiroshima blast."},{"comment_id":"10152780915443124","commenter_b":"the person who insists on letting everyone know their phone conversation in a public place #AmazonGiveaway","commenter_a":"The GravyMaster","post_message":"Add a name to the  and live like  by entering the Amazon.com  Blacklist Villain Sweepstakes for a chance to win a trip for you and a guest to NYC including airfare, hotel accommodations, and more. To enter for a chance to win, respond to this post in the comments below with one sentence or less naming your own The Blacklist villain (please include #AmazonGiveaway in your comments). @webpagelink  Don forget to watch  Blacklist, available on Blu-ray, DVD, and Amazon Instant Video US. @webpagelink  Ends 2/2/2015 at 11:59 PDT. We will reply to the winner's randomly selected comment with instructions on how to claim the prize. NO PURCHASE NECESSARY. See Official Rules: @webpagelink"},{"comment_id":"10157152156085354","commenter_b":"BUILD THAT WALL!!!","commenter_a":"I hope he is the first to meet with them. He will only make the news one more time.","post_message":"WOW"}]
