[{"comment_id":"10153155550251051","commenter_b":"Oh Erika bitch still has vagina","commenter_a":"HUGE.....SORRY ISRAEL...OUR PRESIDENT IS SETTING US UP FOR WAR....SORRY HES SUCH AN EVIL P.O.S....an i for one stand with my people an Israel....suk it obama....rot!!!!!","post_message":"Israel came out and called President Obama's nuclear deal with Iran a big mistake. Here's how they're going to respond to it. Do you agree or disagree with the idea that the Iran deal is a mistake?"},{"comment_id":"10154568418189062","commenter_b":"Your right...Then she may get out and have more kids","commenter_a":"You kill your kids and get 6 years.. Serve 2 maybe 3 and then go on with your life.. Sad","post_message":"JUST IN: Barbara Russo has pleaded guilty in the drowning deaths of her 14-month-old twin daughters. The mother entered pleas of guilty to two counts of criminally negligent homicide. She was sentenced to six years in prison. More: @webpagelink"},{"comment_id":"952953064797748","commenter_b":"She needs to be deported to Alaska. Just like her mother, she does not know what the are talking about!","commenter_a":"Bristol Palin should keep both her ignorant mouth and her legs closed.","post_message":"Apparently, a kind gesture towards a scared teenager is grounds for a political attack these days."},{"comment_id":"10153589057371615","commenter_b":"Yep I had a friend who took kick boxing classes 2x a week and she was in her late 60's ! Don't underestimate a woman nomatter how old 😋","commenter_a":"Ya I'm sure she was really able to get her leg high enough to kick you","post_message":"An 80-year-old Penn Township woman is accused of crashing her convertible while drunk … then kicking an officer in the groin while being placed in a patrol vehicle."},{"comment_id":"1288527907860500","commenter_b":"Melissa these manhating proabort feminists don't get the concept of responsibility","commenter_a":"As early as 9 weeks the baby in the womb has all the same organs as you and I but in an earlier stage of development. He/she has a head, ears, nose, eyes, arms, legs, heart, brain, lungs. So tiny and so beautiful. Denying his/her humanity is denying science. Denying a human being his/her rights is against a concept of civilized society.","post_message":"Isn't life precious?"},{"comment_id":"1563584047268472","commenter_b":"Our society does not need assault weapons!!!The politicians have blood on their hands, because of their inaction when it comes to the NRA!!!!","commenter_a":"President Obama tried to enforce stricter gun regulations but Congress voted against it. They voted for individuals on the terror watch list to keep rights to own assault weapons and now they're blaming Isis. How convenient.","post_message":"This is infuriating.  Image by Occupy Democrats, like our page for more."},{"comment_id":"10156255899575147","commenter_b":"I agree with you. It could have went awry. Maybe the mother has some mental issues. Only God knows what was in her mind. One thing for sure though, its alive n has chance to be somebody. Not just an aborted baby thrown in a trash can or its innocent body parts sold on the black market. Evil comes in all shapes n sizes. One of them is planned parenthood.","commenter_a":"I'm glad she didn't abort the baby, but this is still a sad story. Calling it a \"selfless\" act, as this article does, is a head scratcher. \"Desperate\" maybe, but if anything, abandoning a baby without notifying anyone is exactly the opposite of selfless. There are safe havens in NY where she could have turned over the baby to actual people","post_message":"\"I followed the cries. I walked to the little nativity home we had installed inside the church… I couldn’t believe my eyes.\""}]
