[{"comment_id":"10154592681344445","commenter_b":"Yup, they are trying to invade the US as we type. Better build that wall.","commenter_a":"Now that half the Republicans in the house have been officially brain-washed, his confirmation will take place. This country will be taken over by Islam, when it happens. Bad news for women and gays.","post_message":"'I am confident he will serve the American people with integrity and a steadfast commitment to justice,' the president said. @webpagelink"},{"comment_id":"10153372677575950","commenter_b":"And Kaye Townsend you are an example of an ignorant Bitch","commenter_a":"Screw going to the hospital to better anymore. Lets post getting shot and see how many likes i get","post_message":"Shortly after being shot in her car, a woman turned to Facebook to send a video message to loved ones: 'Mama I'm bleeding. I know they shot me but it's good. It's good.'"},{"comment_id":"10154593663574342","commenter_b":"Okay, she looks stupid with that dress, you ain't royalty Girl... that's something Kate would wear smh...or the Kennedy","commenter_a":"just hate the way he acts , cant even wait for his wife","post_message":"First Lady Melania Trump is wearing a sky blue, mock turtleneck Ralph Lauren dress as she walks into St. John's Church with President-elect Donald J. Trump.  Watch #Inauguration Day live-->@webpagelink"},{"comment_id":"1187848264597052","commenter_b":"Do you want to be responsible for a bus full of kids? Better to keep them home than risk it","commenter_a":"Why don't people buy chains? I don't get it","post_message":"JUST IN: Per the Flagstaff Unified School District, all FUSD schools will be closed on November 29th due to icy road conditions."},{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: 'This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.' Watch complete press conference here: @webpagelink"},{"comment_id":"10154890966160329","commenter_b":"Kacie Rodriguez","commenter_a":"Javier Maisonet oh Neville! ❤️❤️","post_message":"They out here. // Harry Potter"},{"comment_id":"10153743354289614","commenter_b":"He doesn't like illegals","commenter_a":"You know TRUMP is mad!","post_message":"BREAKING: Mexico has defeated the U.S., 3-2, in the CONCACAF Cup match at Rose Bowl Stadium in Pasadena."}]
