[{"comment_id":"10153842818632483","commenter_b":"The girl ran right up and smacked him.........you go girl !!!","commenter_a":"He needs his nuts cut off and ducked taped in his mouth till he bleeds out.","post_message":"Surveillance footage shows an oak tree at Toomer's Corner being set on fire after Auburn's win over LSU Saturday night. Read more here: @webpagelink"},{"comment_id":"10154258847492014","commenter_b":"Go ahead and lose money for a day. It don't prove we need illegal's coming here, not when Americans of all colors need a job and are living on the street. Before some moron says something stupid, yes there is Americans that will do the jobs illegals are doing for les money.","commenter_a":"Isn't it illegal to employ illegal immigrants? You are not paying taxes for those employees right? The people Trump wants deported are Criminals! Are those the employees you have working for you? Why don't we work together to find a way to get the immigrants who want to become American citizens and follow our laws a way to do that, like most of our grand and great grand parents did.","post_message":"\"It's snowballing into something huge and is sending a message about the importance of immigrants to the economy\""},{"comment_id":"10153703978899087","commenter_b":"How about the thousands that are killed by blacks themselves ! Never hear about that !","commenter_a":"Bernie listens, Hillary laughs and walks away!!'","post_message":"Emotional video posted by the Black Lives Matter movement shows Bernie Sanders comforting a woman whose brother was killed by police. READ MORE: @webpagelink"},{"comment_id":"10152998065516037","commenter_b":"Of course men are trying to tell a woman what to do with our bodies. Go shove it!!!","commenter_a":"The silent holocaust, women and men who are irresponsible killing a life because of inconveinence. They will pay for it if not in this life the next one.","post_message":"A new report out today from the Guttmacher Institute shows that 57% of women now live in a state considered to be hostile or extremely hostile to #abortion rights."},{"comment_id":"1202659629774507","commenter_b":"He should be impeached. If this neighborhood was all white they would have had clean water on day one","commenter_a":"Mr. Snyder you have not done your job so you must go. You looked pathetic.","post_message":"Why hasn't he been arrested?"},{"comment_id":"1002765619855375","commenter_b":"She's not that classy oh wait well anyways lmfao whatever get off the trip people smh","commenter_a":"I think it's funny how she's trying to show \"modesty\" When we've all seen her naked already. Lmao","post_message":"Social media thinks Melania is channeling Jackie O this morning. Your thoughts? @webpagelink"},{"comment_id":"1072808739397262","commenter_b":"Oppression? You are way off base here. It is oppressive to want it to be 1959. Here is the bottom line. Do what you want but you don't get others to do what your religious Far right cult says. And I am a Christian.","commenter_a":"Alas...another unintended consequence of liberalism. In their quest to \"help\" people, they made them worse off. To correct their unintended consequence, what will liberals recommend? They will recommend coercing the college into providing the students with birth control... And class...this is another example of liberalism leading to oppression...","post_message":"What would Jesus do?"}]
