[{"comment_id":"10153851537376162","commenter_b":"They are bad dogs they should exterminate that race!!!","commenter_a":"Let me guess it was a pit bull??","post_message":"PET ATTACK: A 34-year-old woman with physical disabilities is in critical condition after she was brutally attacked by her family pet on Chicago's Southwest side."},{"comment_id":"1180918395297096","commenter_b":"@username you come from immigrants, you really believe they should be sent out or kept out. Start packing. Show just how much you believe in this wall.","commenter_a":"Yes","post_message":"Agree or disagree: It's time to build Trump's wall at the border."},{"comment_id":"10153919372908352","commenter_b":"A REAL MESS..WOW","commenter_a":"Macho","post_message":"‘I feel like a princess!': Transgender teen crowned homecoming queen at Missouri high school"},{"comment_id":"10154091101902042","commenter_b":"Sarcasm at its finest, they should've pulled their pants up!","commenter_a":"All white guys I see","post_message":"THIS CRAZY BURGLARY! These burglars rammed a car through the gated front door of an Indianapolis clothing shop, and then about a dozen spilled in and grabbed whatever they could. It was all caught on tape. More details: @webpagelink"},{"comment_id":"487985148058732","commenter_b":"Why hell no, is that why he wants all the illegals in the USA.","commenter_a":"I've wondered if he might arrange some kind of false flag in order to declare martial law and thereby remain in office. I think he knows he couldn't get elected again in a fair election. But then again his lips were moving so he's probably lying anyway.","post_message":"What Obama just said about running for a third term is shocking.  Spread this, Obama doesn't want the public to know what he's planning.  Should Obama be allowed to run for a third term?"},{"comment_id":"10154530724213645","commenter_b":"Yes Ryleigh this is really awesome. Great job !","commenter_a":"Nam Breanne Ewing NAM @username did you see this? Ryleigh @username and I are sooo proud of you. This is fantastic! Congratulations!!! I hope we are going to see you again this year in June!!! @username","post_message":"Meet Ryleigh!   Despite her physical challenges, she's beating the odds and inspiring everyone she meets with her story."},{"comment_id":"10154529409364342","commenter_b":"There was 4 people in that house and one person died. It was one of those three","commenter_a":"I would sue too! His SISTER was murdered and this network is blindly claiming he did it.....WITH NO PROOF! Court of public opinion is harmful..... he's innocent he's never been put to trial it's not fair for this network to claim that this guy did it","post_message":"Burke Ramsey claims that his reputation was ruined as a result of the a series that accused him of killing his 6-year-old sister, JonBenet."}]
