[{"comment_id":"10155808489605968","commenter_b":"Exactly.","commenter_a":"Of course they knew.","post_message":"KEY POINT: \"The current and former officials said that although they believed that Pence was misled about the contents of Flynn’s communications with the Russian ambassador, they couldn’t rule out that Flynn was acting with the knowledge of others in the transition.\""},{"comment_id":"1561742504135313","commenter_b":"Gonna try this for sureeee","commenter_a":"@username yess","post_message":"Making your own crepes is the perfect way to start the weekend. (via Real Simple)"},{"comment_id":"1040961739305022","commenter_b":"Thats right. He you dont like it then get the hell out of MY COUNTRY","commenter_a":"I do want my country back...America...the land of the free from sea to shining sea, from mountain to desert...I want it all back, all the beauty and peace and sweat and hard work that we Americans have given this land...I want it back...my America...not some version that obammer thinks it is...not his America...my America..and if that offends anyone, that is just too damn bad.","post_message":"Americas Freedom Fighters"},{"comment_id":"822517567938820","commenter_b":"This woman is crazy saying Hillary is the most loved and respected woman in the world! She's been hanging around Hillary to much, and Hillary's lying is rubbing off!!","commenter_a":"Security should of threw her out on her ass. The demons must be running scared.","post_message":"Watch: Dem Chair Shows Up INSIDE GOP Convention Arena And Does The Unthinkable It is amazing to see to what extent the Democratic party will try to derail Trump's campaign. Do you stand behind Donald Trump?"},{"comment_id":"1079856352035375","commenter_b":"Wow","commenter_a":"White and gold","post_message":"o.O"},{"comment_id":"1267878706625395","commenter_b":"I'm pretty sure she wouldn't need your worthless vote anyway. Trash","commenter_a":"Can't wait til January 20th when your gone!! If you run for president in 2020 you won't get my vote! You put your nose into eating healthy school lunches thatgo into the trash everyday and restaurants.","post_message":"Happy Birthday to outgoing First Lady Michelle Obama!"},{"comment_id":"10150574072889999","commenter_b":"Exactly, politicians and police could learn a lot from thisman","commenter_a":"this is how a real man behaves - God Bless you Mr. Taylor","post_message":"Malcolm Taylor, a Baltimore city bus driver, was watching the riots unfold on television, and saw some of the players he coaches in youth football among the rioters. He gathered 15 friends, including some church pastors, and went to the riots near Mondawmin Mall to try to calm things down."}]
