[{"comment_id":"10153139725131037","commenter_b":"Hillary won't be in office. Smfh never that","commenter_a":"This guy actually thinks he is a good president. LOL","post_message":"Confident Obama predicts success in immigration appeal, has message for millions facing possible deportation @webpagelink"},{"comment_id":"10153683983505575","commenter_b":"This country is OWNED AND RAN by Muslims.... Obama will make you accept Terrorist Muslim Refugees... There is nothing you can do about it,,, UNLESS YOU FIGHT his Civil war ( Marshall Law ) he is forcing upon you..","commenter_a":"I think it time .... all the state stand up to penis head... fight for our freedom of speech and rights to bear arms.... protect our U.S....","post_message":"BREAKING. . . ."},{"comment_id":"10153293386166051","commenter_b":"And he should step down.....","commenter_a":"I'm with him!","post_message":"Do you agree or disagree with this judge's position on marriage?"},{"comment_id":"978112395570641","commenter_b":"Did all Muslims commit those crimes ?","commenter_a":"It's disrespectful not all Muslims are terrorist or bad people it's in terrible taste it's like me driving around with a plate that says fgirlscouts just cus one gave me the wrong cookies","post_message":"A personalized license plate in Minnesota which read 'FMUSLMS' has received condemnation from many, including the governor. Read more about how and why it was issued: @webpagelink"},{"comment_id":"455406524619303","commenter_b":"And guess what... that girl who got pinned to the ground.....yeah she has a pass to the pool.","commenter_a":"I love kicking people out from our community Pool. They are not allowed because of 'race' but because they don't own a house in our 'Gated' community and pay HOA fees.","post_message":"'The officer never asked any questions. He jumped out of the car and immediately started running to the black kids.'"},{"comment_id":"10153448230456680","commenter_b":"'@username Lucky for you these modern day Hitler's didn't murder you in your womb.","commenter_a":"The innocent handicapped underdeveloped should not be punished by death. Some are responsible and need to be punished. Donald J. Trump is correct again. Trump for president 2016.","post_message":"Planned Parenthood Action also issued a five-figure ad buy in partnership with Priorities USA Action – a super PAC supporting Hillary Clinton."},{"comment_id":"10153635543308132","commenter_b":"Yes...I'd bury my chin in her and set up camp!!!","commenter_a":"I love skinny (healthy) women. It's kind of silly to be that jealous of them. @username have all of their 40's n 50's to get 'thicker'.","post_message":"The endlessly quotable Amy Schumer!"}]
