[{"comment_id":"10153530026483707","commenter_b":"What have Senators Done??? over 30 some years.. Trump is 1000 percent Correct.","commenter_a":"McCain is a scumbag traitor. He was codenamed \"songbird\" by the NVA when he was a pampered guest at the hanoi hilton. He has done more harm to veterans as a senator than could be believed. He is no true American hero. Piece of filth.","post_message":"Congrats to my daughter Meghan on her new nationally-syndicated show, starting July 20th - very proud of you! Learn more:"},{"comment_id":"10153912277130329","commenter_b":"We should exile this dumb bitch to Syria!","commenter_a":"I rather vote for Kanye than for trump","post_message":"Kanye West revealed he would be running for president during last night's MTV VMAs."},{"comment_id":"10154436464143931","commenter_b":"The wall will stop a lot of illegal aliens because they don't usually go thru tunnels. The tunnels are for drugs. They don't want a lot of people knowing where the tunnels are because if the people get caught they will snitch on the tunnels location. That's why they use the tunnels for drugs not people","commenter_a":"The drugs are smuggled thru tunnels underground.","post_message":"A wall would do little, if anything, to stop the flow of illegal drugs - the majority of which are actually smuggled though checkpoints."},{"comment_id":"10155404890705354","commenter_b":"HHHAAAAAA just when you think these morons can't get any more stupid then they already are..HHHHAAAAAA......how about a lying bitch? is this phrase \"Off Limits\" personally I think it's really very descriptive of this...well...lying bitch....","commenter_a":"Bullshit!","post_message":"Hillary Clinton's digital thugs warn the media: using the word \"secretive\" is \"coded sexism.\" Take a gander at the rest of Hillary's laughable list of \"sexist\" words..."},{"comment_id":"10153986690345329","commenter_b":"Sebastian Franklin my hand on the way to the clippers game on the bus","commenter_a":"@username you","post_message":"You're not alone."},{"comment_id":"10153564798429614","commenter_b":"Don't crucify this jesus but put his head on a rope and pull him on a tall tree. Hope am communicating?","commenter_a":"Another senseless act of violence, may the victims RIP","post_message":"Two parents were killed and their daughter wounded when they stopped to help a man who appeared to be having car trouble on a road inside a Montana reservation. When the family approached Jesus Deniz Mendoza, he pulled out a gun and ordered them out of their car, the surviving daughter said. He then told them to walk away from their car. As they turned to leave, the daughter heard a gunshot. She looked back and saw her father lying in the road, she said. The next shot killed her mother. The third shot hit her in the back. Mendoza said he the victims because he was getting tired of waiting around, and because the daughter laughed at him, the criminal complaint says. Read KTLA's story here: @webpagelink"},{"comment_id":"1060173974080560","commenter_b":"You always do a fantastic job so thank you!","commenter_a":"Thank you for covering","post_message":"Christopher Heath WFTV has a look at the crowds waiting in Orlando for the Donald Trump rally, which is set to start at 4pm. More details here: @webpagelink"}]
