[{"comment_id":"10154344335198181","commenter_b":"And the public has every right to show their displeasure by not supporting a corrupt regime...","commenter_a":"He's stupid","post_message":"The White House Press Secretary Sean Spicer on Pres. Donald J. Trump's tweet criticizing Nordstrom after decision to no longer carry Ivanka Trump's clothing brand: \"This was less about his family's business than an attack on his daughter.\" @webpagelink"},{"comment_id":"10153591312367217","commenter_b":"The death of the GOP is fun to watch!","commenter_a":"I can explain it in fewer words - sore losers","post_message":"He's the presumptive nominee but not everyone's a fan of The Donald."},{"comment_id":"10153431114481782","commenter_b":"@username, so this is a woman? @webpagelink","commenter_a":"It means that a child who is enrolled as a girl goes to the girls' restroom and a boy goes to the boys' restroom, regardless of what's listed on their original birth certificate. Some kids are born with indeterminate sex and as they get older they transition from the sex they were assigned to the one that really fits. Don't make this something it's not.","post_message":"The Obama administration is telling public schools that they must allow transgender students to use bathrooms and locker rooms consistent with their gender identity. @webpagelink"},{"comment_id":"10153515225917994","commenter_b":"Then leave the country!!!!","commenter_a":"Another flag that represents racism and hatred.","post_message":"Confederate flags: History or discrimination?"},{"comment_id":"1628197660735785","commenter_b":"Typical woman. Always find something to complain about.","commenter_a":"I see no bacon...this game sux","post_message":""},{"comment_id":"1199547530099410","commenter_b":"They should all be missing persons by now. These people are NOT seeking refuge. They are invaders brought here by our own president.","commenter_a":"Need to all be deported ASAP!","post_message":"MINNESOTA: MOB OF SOMALIS RAGE Through Upscale Neighborhood Threatening To “Kidnap” And “Rape” Homeowners [VIDEO]"},{"comment_id":"10153021008650326","commenter_b":"Creepy man-woman!","commenter_a":"LOSER","post_message":""}]
