[{"comment_id":"1104176122983583","commenter_b":"Fire her sorry Ass!","commenter_a":"traitor, as a senator you have more of a way of fighting for what you believe in than 99.9% of us ....Do what you were elected to do and stand up for flag and country, or get the h out of the goverment","post_message":"What?! Man!!!"},{"comment_id":"1163050380483299","commenter_b":"@username, I'm quite happy with my wife of 33 years, but thanks for the suggestion.","commenter_a":"Honestly, I don't know anyone who wears Ivanka trump's clothing. This is the risk you run when you become part of the political process.","post_message":"A recent survey found that 57% of women refuse to buy Ivanka Trump branded merchandise following her father's controversial campaign."},{"comment_id":"1256931770993517","commenter_b":"Shut-up... and please die!....","commenter_a":"No laws we have on the books would have prevented what happened.","post_message":"\"People on the No-Fly list can walk into a store and buy a gun. That is insane,\" the president said."},{"comment_id":"10152633154612452","commenter_b":"You do know I meant loving","commenter_a":"@username living all the comments. Brian Williams lol","post_message":"DRAMATIC PHOTOS: Two police officers were able to save a woman trapped in a sinking BMW after smashing the vehicle's rear windshield. @webpagelink"},{"comment_id":"902512513119423","commenter_b":"Symbolism over substance. Can't solve problems in the real world. I hope her mommy and daddy are proud...and didn't convert her bedroom...'cause she gonna be needing it for the near future.","commenter_a":"good for them, they are not thinking of themselves but of all the other victims and future victims. God bless every one of them.","post_message":"Hint: The university president was not pleased."},{"comment_id":"10153193564170326","commenter_b":"Hell, they should move to texas!","commenter_a":"The GOP and their love for guns should move to Somalia where even children carry guns","post_message":"\"More guns\" is always the answer."},{"comment_id":"10153860204493598","commenter_b":"She probably has no problem selling those little body parts.I wonder how those people will answer God when they stand before Him!","commenter_a":"More like satan","post_message":"Wendy Davis is Dedicated to Promoting Abortions With God’s Help: “By God, We Get Back Up”"}]
