[{"comment_id":"10153471873556770","commenter_b":"@username - afraid your husband will be deported huh?","commenter_a":"These Clowns are hilarious Dracula aka Cruz and Cruella Devile aka Fiorina ....She was dying for some spotlight....Well she will get if for about another month...Then Bye Bye weirdos","post_message":"During Carly Fiorina’s acceptance speech for running mate with Sen. Ted Cruz, Fiorina sang a made up nursery rhyme to Cruz’s daughters."},{"comment_id":"463711880486059","commenter_b":"Not in my world, just send them all anywhere else but America. Muslims Need To Go. .....Get Them Gone.","commenter_a":"NO !","post_message":"Should The Words 'Bacon', 'Pork', 'Sausage' Be Banned?  Comment 'yes' or 'no'."},{"comment_id":"587813824710682","commenter_b":"Fuck Clooney! Trump 2016!!! Build that wall!!! Go Trump!!!!","commenter_a":"The rich have no idea because they live in there own world behind gates and walls take away all that and see how they feel","post_message":"“But the problem is all these other countries hear these things, and all of a sudden you see in France that [Jean-Marie] Le Pen is going, ‘Bravo,'” Clooney added. “You get all of these nutcases on the far-right fringe saying, ‘Well, if America thinks that…’ That is the real problem with Trump—his ideas bleed into the rest of the world.”"},{"comment_id":"10152979635977483","commenter_b":"Then ban the naacp bitch","commenter_a":"This flag was specifically adopted In response to the civil rights movement.. the confederate flag should be banned across the u.s point blank period","post_message":"\"Just by the outpouring of support I've gotten from all over the world, I know for a fact I'm doing the right thing,\" said Belinda Kennedy, owner of Alabama Flag & Banner."},{"comment_id":"10153539342225329","commenter_b":"Women should have the right to ban ear piercing among them also.","commenter_a":"This is such BS.. I had my daughter's ears pierced when she was an infant and she felt the pain for 30 seconds. She was completely calm and pain free afterwards. Her ears healed in less than a week bc of how fast her body grew at that time. She had less risk of infection then (she was too young to play w her ears) and less healing time. I, on the other hand, had mine pierced at 6 and ended up with problems bc I took them out when I shouldn't have..","post_message":"“Severe pain and fear is inflicted upon infants unnecessarily,” the petition states. (via BuzzFeed Trending)"},{"comment_id":"10153301053671770","commenter_b":"What do they call a female dog ?","commenter_a":"He wants back in the white house so he can shame us again.","post_message":"Clinton let out her inner dog during a speech Monday."},{"comment_id":"10154592640014411","commenter_b":"actually, feminists hate people forcing women to wear/do anything, which is kinda what a ban amounts to.","commenter_a":"Burkini is everyrhing that a feminist hates,so how can feminists agree for that?","post_message":"'...attempt to raise profits and exploit a gap in the over-saturated clothing market is selling and promoting allegiance to ISIS?'"}]
