[{"comment_id":"10154751454678010","commenter_b":"@username --You are a woman, but lady? Highly questionable.","commenter_a":"Aren't \"Indians\" a part of American History, whether or not their story is positive or negative? Why does every damn thing have to be racist? I think your article/argument would have been more effective if you had taken statements by full blooded Indians who are actually offended by this rather than just mention that the mascot and \"red face\" really \"do harm to actual people.\"","post_message":"Cleveland knows its mascot is racist. They removed \"Chief Wahoo\" from their caps at the beginning of the season.   And yet now he's reappeared on baseball's biggest stage.   via Los Angeles Times Opinion"},{"comment_id":"10153572355174575","commenter_b":"Look people I'm not trying to insult anyone but we have the most advanced technology in the world and your telling me that there is no way the government can find out 9f she sent classified e-mails or not? Who the f#### are we kidding. The truth is she did not and they want to put that thought in people's minds. Those that believe it must be stupid (no insult intended). They just do not want her to be president. Hillary Clinton out of all the candidates is qualified to run this country. I don't care what anyone says.. every one has a right to an opinion and this is mine. HILLARY CLINTON 2016","commenter_a":"Clear she is nothing but a lying scum bag","post_message":"“I am confident that I never sent nor received any information that was classified at the time it was sent and received.”   Democratic presidential candidate Hillary Clinton addressed media in Iowa on Saturday, adding that the latest controversy is an example of disagreement among various parts of the government about what should or should not be publicly released.  Her remarks come after The New York Times reported Thursday night that inspectors general for the intelligence community and the State Department had asked the Justice Department to launch a criminal investigation into Clinton’s possible mishandling of classified email."},{"comment_id":"1087648897921955","commenter_b":"Strange how our country hasn't been blown to pieces if all these Muslims are strapping bombs to themselves. I see your high school education didn't get you far. Must have been a sympathy pass..","commenter_a":"Send these filthy vermin back to the cesspool they came from","post_message":"The project was \"totally different from anything the government has ever done,\" Immigration Minister John McCallum said Wednesday."},{"comment_id":"10153438111440496","commenter_b":"STFU","commenter_a":"Always 3 sides to a story don't be quick to judge U ppl have no idea how students behave themselves at school unless u worked at schools Unbelievable not saying what that officer did was appropriate I haven't watched the video nor do I choose to Let them finish their investigation u stay out I choose to do the same","post_message":"Video shows a 6th-grade girl at a Texas middle school being grabbed and dropped by a school resource officer. The officer is now on leave."},{"comment_id":"1756436014601478","commenter_b":"Bye BITCH","commenter_a":"Makes me want to vote Trump","post_message":"The Fate of the Republic Hangs in the Balance..."},{"comment_id":"10153301839268854","commenter_b":"Why isn't sharpton in jail for not paying his taxes instead of running around free doing nothing but causing trouble. That is the question.","commenter_a":"Douche bag!","post_message":"Sharpton Calls for Federal Police Laws... 'There must be national policy'..."},{"comment_id":"1641329602799278","commenter_b":"Black lives matters ass bitch","commenter_a":"This person needs to be arrested!","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"}]
