[{"comment_id":"10153875809248352","commenter_b":"Thank you Doriaan. This bitch hatin ain't she?","commenter_a":"Instant reflex nigga don't touch me while I'm performing bitch you lucky that's all you got...KEVIN GATES THAT MOTHAFUCKING NIGGA","post_message":"RAPPER BRUTALLY KICKS FEMALE FAN BECAUSE SHE TOUCHED HIS SHORTS. REALLY? #DISGUSTING"},{"comment_id":"1672686459685954","commenter_b":"She once said she want to let more come in than Obama it is a joke that she cares about us. I would not mind a women in the white house, but not her. Also I do not want her husband messing around there. How could she make good decisions worrying about him cheating.","commenter_a":"Neither. It's Germany. @webpagelink","post_message":"The mother of a police officer who was killed by an illegal immigrant speaks out in support of Donald J. Trump due to his strong stance on illegal immigration. @webpagelink (via Fox & Friends)"},{"comment_id":"967111676633636","commenter_b":"What a couple of dicks....","commenter_a":"Bigots.","post_message":"It's that important, huh?"},{"comment_id":"10153465361664714","commenter_b":"I'm just sorry u all have to go thur you show up lifting an I'm praying they do not take it of. I've been in your shoes girls,an the ownly way is to move on is to try an find a way to forgive an forget,I. Found it in my bible there isn't one single person out there that donest havesomething bad or a secret hidden in their closet, I'm just sorry something as this is blown so far there,but I can say this ,I love the show an praying it back on u r like my family,an I'll miss u.","commenter_a":"In not excusing at all what he did, but how is he a pedophile or rapist? Kids touching kids around their own age aren't pedophiles. It's molestation, yes. When an adult touches a child in a sexual manner, that's a pedophile. A rapists is some one who rapes another person. He didn't have sex or oral with his sisters. He's not a rapists and he's not a pedophile. He was a molester. I'm not saying what he did was nothing, but can we call it what it is without adding false titles? The diggers called trans people pedophiles and we no that's bogus, but do we need to stoop down to their level? If we do, we're just as bad in our thinking as they are.","post_message":"More on the 19 Kids and Counting scandal."},{"comment_id":"10154812464086049","commenter_b":"Folks, it is a well known fact in the mental health community that many folks who take \" street drugs\" have an underlying UNDIAGNOSED psychiatric condition , such as depression, anxiety, etc. They are \"self-medicating\" themselves with street drugs. It is a shame, because many of these individuals could be helped with an early identification and treatments (therapy preferably and meds if needed).","commenter_a":"They should be charged with manslaughter if any of their \"customers\" died from overdoses. Sorry. These guys knew what they were selling kills people.","post_message":"HEROIN BUST: 9 people have been arrested in connection with a heroin and oxycodone drug ring on Staten Island. Prosecutors said they've selling for several months. Names of suspects: @webpagelink"},{"comment_id":"10153984542943690","commenter_b":"Stop stealing their land and tell the settlers to gtfo","commenter_a":"he knew the house would be demolished. he was selfish and brought it upon his family. The others thinking of attacking us should see this before they do anything they will regret","post_message":"\"Muhannad was killed but why do you have to destroy a house belonging to six others...what about the children and his elderly relatives?\"   @webpagelink"},{"comment_id":"670200283170550","commenter_b":"Yeah,Yeah,Yeah...I keep hearing this on FB but NOT anywhere on any news network....I just HOPE this true and NOT a fantasy!","commenter_a":"The sooner the better!!! Hopefully he will take Biden, Kerry, Pelosi, Killary, Harry Reid, Al and Jesse with him when he goes. Preferably out of the country. Let them go live with the Muslim terrorist that they love so much.","post_message":"Obama's time in the white house could be coming to a screeching halt.  This is the best news of the year. Get rid of him.  Would you be happy if Obama was forced out of office?"}]
