[{"comment_id":"10155835827900615","commenter_b":"About damn time they got these creeps off the air!","commenter_a":"Unfortunately another network will probably pick them up.","post_message":"BIG BREAKING NEWS –"},{"comment_id":"10154654026369160","commenter_b":"HOLLYWOOD ELITES..... TAKE DOWN YOUR WALLS AND YOUR GATES AROUND YOUR MANSIONS. We all want to have the right to walk onto your property, so that we can also enjoy the excessive good life that you live. We want to swim in your pools and relax in your hot tubs..... we want to sleep in your beds and wear your designer clothes.TAKE DOWN YOUR WALLS AND YOUR GATES!","commenter_a":"By the way the police had nothing to do with Nicole Brown and Ron Goldmans deaths. Awful nice of him in a past year how many officers lost their lives while just in their cars and were gunned down, 5 in Dallas protecting protesters against them, and 3 in Baton Rouge. Really thoughtful to attack the police which have been more of victims than offenders in this country.","post_message":"The director of \"O.J.: Made in America\" dedicated his Oscar to Nicole Brown Simpson and Ron Goldman, and then to \"the victims of police violence, police brutality, racially motivated violence and criminal injustice.\""},{"comment_id":"615120388649797","commenter_b":"I don't think it should be considered treason, I think it IS treason. How do you Snopes check this? And where is the link to the Washington Post article?","commenter_a":"Guys we have no choice. They are so advanced we have no choice","post_message":"This should be considered treason."},{"comment_id":"10153188022605329","commenter_b":"Great, now middle aged people are going to sag in huge pants. Now ass crack will be everywhere","commenter_a":"love them pants","post_message":"FINALLY!! // BuzzFeed Style"},{"comment_id":"1132568873502832","commenter_b":"Dont know. You went baiit an switch. Its about keeping these men out. Want more? @webpagelink","commenter_a":"To keep men pedophiles out womens bathrooms? Yes. I agree!","post_message":"How does this make ANY sense? Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1615919975382867","commenter_b":"Jake Jutras the first eagle has landed","commenter_a":"Virgil John Ariel John Monique John","post_message":"#BREAKING: The first eaglet has HATCHED! Harriet and her mate M15 were both at the nest during our first sighting of the eaglet, which is almost fully out of his or her shell. A New Year's Eve eaglet - SO EXCITING! Video: Southwest Florida Eagle Cam STORY: @webpagelink"},{"comment_id":"10153368767146694","commenter_b":"Those were not feminists, those were trolls.","commenter_a":"Meh to all the feminist crying. If you hate her characterization, you don't have to force the entire female gender into the issue. Also, the action figure industry is asinine. See how it screwed over Green Lantern TAS and Young Justice.","post_message":"Let's talk about The Avengers' Black Widow problem."}]
