[{"comment_id":"10153348075419255","commenter_b":"who would want texass anyway","commenter_a":"I laugh every time I see these two big wusses trying to play badass.","post_message":"Idiots."},{"comment_id":"636085169915395","commenter_b":"Fuck her .Nan I can't wait for her and her worthless ass husband to get out of office.","commenter_a":"I think her and her fucktard of a husband both have lost their fucking minds we are in America people if u don't like it get the fuck out!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"},{"comment_id":"1006387419398598","commenter_b":"Go away upchuckie!","commenter_a":"Where do these NUTS come from? Is there some unknown idiot tree orchard somewhere in the U.S.?","post_message":"'Schumer’s proposed anti-gun plan takes government “overreaching” to a whole new level.'  Blaze contributor Susan Calloway Knowles:"},{"comment_id":"10153127913913812","commenter_b":"Shut up Canadian","commenter_a":"Classless","post_message":"Leaving her head uncovered in Saudi Arabia, a country where women have few rights, the First Lady leads by example: @webpagelink"},{"comment_id":"10154741316933812","commenter_b":"Hillary will be president","commenter_a":"Remember when Hillary Clinton said the 50,000 emails she kept from the State Department (in violation of the Federal Records Act) were about yoga and her daughter's wedding? How many of the most recent set of 14,900 emails ordered made public by a federal court are about yoga or her daughter's wedding? I'm thinking zero. But hey: pertinent falsehoods under oath aren't criminal when you're aspiring to become the First Woman President (TM).","post_message":"Meet Meatball: The adorable, friendly and rotund pit bull mix that can't help but flash his brightest smile as soon as he sees a camera. 'As soon as the camera turns on he just gets this huge grin on his face.'"},{"comment_id":"10154164931281162","commenter_b":"with your last name you should go back where you came from...why are you here in the US","commenter_a":"Cuba please keep Obama and his family. Also don't forget the mother-in-law","post_message":"Pres. Obama touches down in Cuba, making him the first sitting president to set foot in the country in almost 90 years: @webpagelink"},{"comment_id":"1325725004111513","commenter_b":"They're both adulterers. Trump cheated on his first 2 wives","commenter_a":"It is actually possible for both to be true: Trump is a conniving, egomanical pig who won't stop at destroying others to get to the White House and Cruz is a lying adulterous pig who would also be a big hypocrite. Sigh. And all of it unfolding on Good Friday. You can't make this stuff up....","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
