[{"comment_id":"461301070747634","commenter_b":"They are ILLEGAL!!! It should not be allowed!","commenter_a":"No illegals have no right to vote in our country's elections. The democrats are destroying this country. Wake up is a phone worth your vote. Honestly look around are you better off now than 8 years ago. On the economy I blame both parties!","post_message":"BREAKING: Obama Launches Plan To Allow Illegals To Vote In Next Election They are not citizens of our country, and should not be allowed to vote. Do you think this is wrong?"},{"comment_id":"860171507364731","commenter_b":"Wow... really? So sad.. moms please be very careful who u leave ur kids with..","commenter_a":"she looks like she is a... \"few bricks short of a load\"","post_message":"This 18-year-old girl is accused of leaving her little sister in a hot car while her and her friend went shopping for swimsuits. Investigators say the 2-year-old's temperature was already at 100 degrees when she was rescued:"},{"comment_id":"1205428982807783","commenter_b":"Actually our laws are being ignored, all illegals by law are to be deported and anyone who employs them face prison time if the current laws were enforced","commenter_a":"DONALD TRUMP It is a shame that a billionaire ...regardless of politics or party ...can walk in, fund himself and blackmail the political process.... Is this the future of our country only self-funded billionaires can run for president from now on? If that is the case then this is no longer a republic and we are no longer operating through a democratic process TRUMP'S IGNORANCE on the world stage will begin to be seen now. JUST WHAT DOES THIS MAN KNOW? He knows how to conduct business and DIRTY business deals He knows how to declare bankruptcy He knows how to be a GOOD ANCHOR HUSBAND who takes young women the age of his daughter who are NOT CITIZENS and provide them with $$$$$ and a pathway to citizenship... THAT IS WHAT HE KNOWS TRUMP continues to show the world what a racist pig he is SANTORM and CRUZ and ...","post_message":""},{"comment_id":"1807825672796282","commenter_b":"If he gets in please let him build that wall to protect our Canadian women and girls from him and His followers.","commenter_a":"This is what I commented on his \"apology\": You literally said: you grab women by the p----. You kiss them and don't even wait. That sir is sexual assault. You should be apologizing for your behavior not your words. And what about the 13 year old who accused you of rape? Your own wife accused you of rape as well and you shut her up in your divorce settlement. You sir are a disgusting misogynist and will say what you need to to deflect the attention from your personal flaws. You are projecting onto Clinton what you've done yourself. And this isn't about Bill Clinton. This is about who should be the next president, you or Hillary. Your past behavior is proof that you don't care about the women of this country, and Hillary has shown she does. Additionally, President Obama yesterday just signed a bipartisan bill that passed the ...","post_message":"For hours on Friday night, the political world waited for the rarest of expressions from Donald J. Trump — a heartfelt apology. What viewers got was anything but."},{"comment_id":"10152871641536051","commenter_b":"My husband served 20 years for this country and then a bitch like u get the freedom. U need to get the hell out of here and there may be someone out there that will really get mad and look for u bitch.","commenter_a":"Then WHY IS SHE HERE??? OHHHHH!!!! Cause she makes her $$$$$ here. Proud Americans STOP SUPPORTING THIS LOSER!!!!","post_message":"This musician says she hates absolutely everything about America."},{"comment_id":"10150620952809999","commenter_b":"You people don't get it. Keep sticking your heads in the sand. You focus on what he says and not what Hillary has done","commenter_a":"Dump Trump.","post_message":"The P.G.A. became the first major golf organization to pull an event from one of Donald J. Trump's properties in response to his comments about Mexican immigrants."},{"comment_id":"572993952849381","commenter_b":"She needs a stiff dicken","commenter_a":"Such class....................................................NOT!","post_message":"This woman just needs to STFU."}]
