[{"comment_id":"10153554902129087","commenter_b":"Ha haaaa!!! I think it's funny you fools immediately claim racism when somebody wants to do something that doesn't suit you. Well get over it!!! ILLEGAL immigrants have no business being here! Come to this country LEGALLY or fuck off!!!!","commenter_a":"We paid Mexico for those borders and they let illegals in and tramp through their country to come here Yeah you will pay for it..","post_message":"\"I’m not going to pay for that f---ing wall,” former Mexican President Vicente Fox to Jorge Ramos during a fiery interview on Thursday. \"[Donald Trump] should pay for it. He’s got the money.\""},{"comment_id":"10153416110184705","commenter_b":"It took a woman to git r done!!!","commenter_a":"good","post_message":"A woman scaled the 30-foot flagpole outside South Carolina's Statehouse and pulled down the Confederate flag."},{"comment_id":"598047807050178","commenter_b":"@webpagelink/ maybe you should wake up","commenter_a":"This action taken against this marine n my opinion is shameful n should b a wake up call 2 the AMERICAN people !!!! WAKE UP AMERICA !!!","post_message":"Marine Arrested For Saying THIS About Obama [VIDEO]"},{"comment_id":"10153519316691037","commenter_b":"Disney isn't on my list of good companies either. They are firing Americans and hiring ILLEGALS. Really?","commenter_a":"Whatever happened to statute of limitations? If he did this, I certainly don't condone it, but this was 40 years ago.","post_message":"Disney's decision comes after court documents from 2005 were unsealed"},{"comment_id":"1474175135944775","commenter_b":"Two idiots,","commenter_a":"Hard to do when she said she wrote the speech herself, how did we get to this guy being nominee, wow","post_message":"Did they do it on purpose?"},{"comment_id":"1192108440886151","commenter_b":"He is going to be a great president","commenter_a":"He is the uneducated and ignorants president which apparently there is a lot of!","post_message":"WATCH LIVE: President-elect Donald J. Trump makes a statement from Mar-A-Lago estate"},{"comment_id":"10153739914549714","commenter_b":"@username I was going to say that. Both are smokin' tho.","commenter_a":"Cara looks like a dude without makeup","post_message":"Richard Madden was pretty critical of Cara Delevingne and her cringeworthy Good Day Sacramento interview."}]
