[{"comment_id":"10153803162214456","commenter_b":"There is a big difference between a legal immigrant and an illegal alien. Ivana trump was a legal immigrant.","commenter_a":"Thanks JENNIFER...this is what I am seeing and hearing. No matter how brash everyone thinks Donald Trump is...we have incompetent leadership in this country...I agree with him...","post_message":"BREAKING NEWS: French police have issued a wanted notice with a photo of a man suspected in the Paris attacks."},{"comment_id":"10153774603359714","commenter_b":"She needs to resign then!","commenter_a":"Right Fire her..she has a job to do and it was put into law then she should uphold it or go....fundamentalist zealot","post_message":"Kim Davis said she grasped Pope Francis' outstretched hand, and he told her to \"stay strong.\""},{"comment_id":"10154787098266438","commenter_b":"@username exactly, many of the \"1%ers\" are pro choice liberals, they can fund it.","commenter_a":"Just goes to prove, don't make women angry. We don't get even, we get revenge. Elected officials had no idea what they did. This is just a start. With Elizabeth Warren, Bernie Sanders, Schumer, and many others we will take our rights back. Ryan and Trump need to be scared, very scared.","post_message":"Huge crowds everywhere from D.C. to New York to Chicago to LA to Memphis to Nashville to Raleigh to Denver to Idaho ..."},{"comment_id":"10155605168240968","commenter_b":"Lock Em up!","commenter_a":"Liberals suck!","post_message":"\"If you see your friends or family falling into the chasm of cable news, perhaps parental lock is right for you.\""},{"comment_id":"10153306545444575","commenter_b":"Its hard to trust the justice system when everyone isn't treated equally","commenter_a":"I'm sure anyone could argue \"what the parent should have/have not been doing\"... It only takes a quick look away for something like a car accident or a child to run out in the street to happen. What's unfortunate , is that we as people, don't trust the justice system when we face situations as such and feel the need to take matters in our own hands. Praying for both of the families in this loss.","post_message":"A driver and his teen passenger were shot and killed by an unknown gunman while talking with police. Right before the shooting the driver hit and killed a toddler who ran into the street. “Today is not a good day — when an infant can lose his life, and then someone, a Good Samaritan tries to do the right thing and then all of a sudden a tragedy occurs,” said a city official."},{"comment_id":"458998460955114","commenter_b":"Jamie....... Your mamma should have swallowed !","commenter_a":"I got to admit governor Abbott has some big huevos and strong backbone exactly what is lacking in congress n Senate to stand up to that pos obama","post_message":"Texas is not playing GAMES..."},{"comment_id":"1068539523183857","commenter_b":"How can you support Hillary she lier and a crook! Trump trying to make a better America for all Americans. Hillary trying to make a better America for Hillary.","commenter_a":"Another libertard","post_message":"Actress Rosie Perez: “I really, honestly, want to understand how can you support someone who said such racist comments, who said such hateful comments,”"}]
