[{"comment_id":"10153973412478854","commenter_b":"Move your black Ass ,no one cares.","commenter_a":"U Have Become Despicable & Have No Class.","post_message":""},{"comment_id":"10153196800261051","commenter_b":"Shut up you bitch! !","commenter_a":"I thought for sure she would want to be a Ferguson protester!","post_message":"Michelle Obama was asked a simple question: If you could have any other job in the world, what would it be? Here's her response."},{"comment_id":"10153610824739087","commenter_b":"So, I guess u rather lying, murderous Hillary to get the nomination.","commenter_a":"They don't have to support the nominee anymore than we have to! If Old butthole lips Trump gets the nomination you can bet I'll write my candidate in!","post_message":"“We have candidates who believe that they’re on the pathway to grabbing all the delegates for the nomination. Whether it’s posturing or whatever, I expect that they’ll eventually support the nominee,\" said RNC chairman Reince Priebus. \"We’ve always been able to come together before.”"},{"comment_id":"10153482509219714","commenter_b":"The girl is a faker","commenter_a":"Once you go black you don't go back. She took it out of context.","post_message":"NAACP leader Rachel Dolezal is speaking out in the wake of controversy."},{"comment_id":"1248241848569316","commenter_b":"They are coming in on cargo planes in the dead of night and then being bused throughout our country. Once they reach \"refugee\" status they can roam throughout America without any restrictions. Refugee is just a word to make it look right........it is not. Illegals are just criminals and not the best for our country. The new immigrants are not the same that came over after WWII who felt blessed and were willing to be woven into the fabric of America. The new ones are coming for only the money and the Demos are only aiding and abetting them for the votes. Plain and simple.","commenter_a":"Trump is the biggest liar out there. \"We did not discuss paying for the wall\" - Trump \"I made it clear that Mexico will not pay for the wall.\" - Nieto \"Chicago Police told me crime will stop in one week\" - Trump \"We did not discuss stopping crime in one week\" - Chicago PD \"The NFL sent me a letter about the presidential debates\" - Trump \"We did not send any letter to Trump\" - NFL Promises on deportation of illegal immigrants, self-funding of his campaign, no teleprompter, muslim ban, and release of his tax returns, now confirmed LIES. Who still believes conman Trump? #LyingTrump Feel free to share.","post_message":"Donald J. Trump's claim that the federal government has no idea how many undocumented immigrants are in the United States is false."},{"comment_id":"915924881775941","commenter_b":"The buildings were resisting arrest, so they were executed!","commenter_a":"Justified. Those buildings and people around were obviously obstructing justice.","post_message":"More trigger happy cops? Time to unarm the cops? What do you think? Via: Police The Police <-- (y) Follow this page!"},{"comment_id":"1546688018681408","commenter_b":"If we are about to start following the Bible, can we get this woman to shut her mouth first ??","commenter_a":"I'd pay money to see the look on her face at the innoguration.","post_message":"\"Okay, Hillary, now that Donald J. Trump is looking to help you heal and help the nation heal, would it be fair to say – to use your own words – 'It's time to give Donald Trump his chance to lead'?\" – Judge Jeanine Pirro @webpagelink"}]
