[{"comment_id":"10157254857370354","commenter_b":"Punch that Bitch","commenter_a":"If he had a background like that, other wives would come forward. She wasn't going to get alimony...hummmm","post_message":"The latest twist..."},{"comment_id":"10153600714709087","commenter_b":"This lady represents Trump.","commenter_a":"Good! Pepper spray the idiots! There's a difference between protesters and violent rioters! Stand there with your picket signs! And speak your mind but stay out of an arena full of supporters who came to hear Trump speak! This is a travesty of the 1st amendment! No one in the media even shows and exposes the idiocy and rhetoric espoused at BLM movements where they threaten to assault or kill police! Or threaten and degrade black officers maintaining the peace. This is ridiculous! All of these protesters won't have enough time to protest when Trump is in office because they'll be put back to work!","post_message":"#BREAKING: As Donald Trump comes under fire for escalating violence at his rallies, video shows police in Kansas City, Mo., using pepper spray against protesters. WATCH:"},{"comment_id":"1279992562041213","commenter_b":"Notice how he always gets phone calls telling him he's doing great...","commenter_a":"Your headlines are as misleading as the mainstream media...","post_message":"After how much Trump has frustrated America these last few months, it’s great to see the tables turned."},{"comment_id":"1642069832709355","commenter_b":"I'm voting for Trump.Is it just me or is Sara palins voice extremely annoying?Like worse the that Kathy griffins creature.","commenter_a":"I approve this message. I am anxious to know Mr. Trump's running mate. Go, Donald!","post_message":"I am greatly honored to receive Sarah Palin's endorsement. She is a friend, and a high quality person whom I have great respect for. I am proud to have her support. #Trump2016 #MakeAmericaGreatAgain"},{"comment_id":"10153882312643690","commenter_b":"Say this to naked girls and bars in japan .","commenter_a":"What a mistake","post_message":"Islam has never made more than a marginal impact on Japan, although the history of Japanese relations with Muslims stretches back further than most people imagine, the Japanese included."},{"comment_id":"10153138669086378","commenter_b":"She gets off on it","commenter_a":"Weird","post_message":"BREASTFEEDING FRIEND'S SON: A photo of a Bala Cynwyd woman breastfeeding not only her own son, but her friend's son, is generating controversy.  See more about her decision, and let us know what YOU think in the comments below:"},{"comment_id":"10153687260803188","commenter_b":"He will make a great mayor of crazy town","commenter_a":"Glenn. Enough. We like Trump. We will figure this out . Let it be. Trump 2016.","post_message":"Oh, now I see why Donald Trump lashed out today.    He got bad coverage in the NYTimes and research on the conservative voting base.  I just thought it was a typical trump circus non sequitur.  I hadn't seen this story until now.  I feel sorry for him.   It just isn't going to end well for him.  Maybe I am wrong but I just don't think the American conservative likes the bully act.  Is everyone who disagrees with him:  fat, ugly, stupid, loser or failing?  It is amazing to see anyone not in the Obama White House with an \"enemies list\" this large.  Be fore he ran for president he was always a nice hotelier to me and my family.     I said four weeks ago that I did not want him on the show as the only thing to be gained was fifteen minutes of ratings and seeing that my ratings have never been higher nor have my commercial rates been higher, I didn't feel it was worth the trade of integrity.  He is welcome on many talk radio shows.  Not mine.  I will stick with Cruz, Carson, Fiorina, Santorium, Paul and tomorrow Bobby Jindal.  My audience rates Donald Trump consistently in tenth place in the race.   We have spend the last 16 years learning about progressives.  My audience is not fooled.  @webpagelink"}]
