[{"comment_id":"10152693166980047","commenter_b":"Get out of our lives and leave us alone you can not even run your own country leave our children alone also","commenter_a":"No way","post_message":"Schools are forcing our children to \"pretend\" to be Muslim for a day?  We must stop Islamic indoctrination in our schools.   Sign and Share the petition to defend the religious liberty of our students:  @webpagelink"},{"comment_id":"754838434706734","commenter_b":"Oh God, the taxes, the illegals working for him, the handicap man with evil intentions, and now a rape! Next anything against Mr. Trump, please, lol Your evil would not be able to destroy Mr. Trump! Don't waste your time!","commenter_a":"Wtf ever stop grasping","post_message":"BREAKING: Trump Engulfed In MASSIVE Rape Scandal   This could end his campaign right now. Let's show our support.  Can we get 30,000 'LIKES' for Donald Trump?"},{"comment_id":"10154600253629170","commenter_b":"All the hildebeast fears is losing the election and facing her well deserved comeuppance .","commenter_a":"The FBI said that she had no intent when she broke the law, but Trey Gowdy said in the documents they received from the FBI, that there were no questions to probe if there was any intent. No questions of why, she had a private server. No questions at all, to prove intent. Sounds very fishy. They ( the FBI) just threw that in, ( No intent ) to get her off , from all the crimes that she committed","post_message":"The one thing she fears the most."},{"comment_id":"10153829963431130","commenter_b":"@username The two go hand in hand. you would have to post a naked pic to really prove you point but I doubt that is going to happen. She has blubbery arms and obviously fat hips and thighs.","commenter_a":"She looks amazing. I am a size 6 and I don't look that good naked. She seriously has a bomb AF body","post_message":"“This is for anyone who has ever been called FAT.\""},{"comment_id":"10154012875581523","commenter_b":"Dawn did you see this mother fucker?","commenter_a":"Such a thug","post_message":"Was an Alabama man pushed to apologize because of public outrage over a social media post?  It sure seems that way."},{"comment_id":"1835391226744152","commenter_b":"Def not girl lol. I liked her back in the day but when she got that diva attitude and had the nerve to kill some of my brain cells with Glitter, I was done lol.","commenter_a":"Whether it was her fault or not, I'm glad she fell on her face. Maybe it will bring her diva attitude down a couple notches because she is annoying.","post_message":"WATCH: Mariah Carey's New Year's Eve mishap; what really happened during performance? abcn.ws/2hHJaGj"},{"comment_id":"982872948473970","commenter_b":"These people are what is wrong with America! I can't wait for them to occupy Canada","commenter_a":"these are the hate american soros funded kids who still live at home and hacve ebt cards and dont pay for health insurance..","post_message":"DEVELOPING: Leftist Radicals in New York City and Arizona launching anti-Trump uprisings...TRUMP PROTESTERS BLOCK ROADS TO PHOENIX RALLY....MORE..."}]
