[{"comment_id":"10155382822311729","commenter_b":"Dumb ass","commenter_a":"What legacy?? Racial divide war on our police officers open our boarders to ever illegal and terrorist trillions of dollars in debt millions on vacations for him and his family no decent jobs no affordable healthcare despicable treatment of our military and veterans... shall I continue I say good riddance finally this country is going to get a leader who's for American and its people we have hope finally","post_message":"Yes."},{"comment_id":"10153846038466336","commenter_b":"Smug calculated shrew. She's nothing short of evil. WHY ISN'T SHE IN PRISON?","commenter_a":"She is a lying self serving witch and she has a list of dead people that believed in her and knew to much that could destroy her and Bill.","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"598112180339217","commenter_b":"'@username buzz off back to the Rove hive","commenter_a":"How to Steal an Election 101...Despite winning Wyoming 56-44 percent on Saturday, Bernie Sanders will split the pledged delegates evenly with @username, plus Clinton gets the state's 4 superdelegates, tilting the delegate count to her favor, 11-7.","post_message":"We need a leader who will bring us together—not drive us apart."},{"comment_id":"10155217921896320","commenter_b":"she looks like my dust mop!!","commenter_a":"I love it when their hair gets like that. It's so pretty.","post_message":"Halle Berry showed off her new hairstyle at the Oscars, many on Twitter didn't like it.  What do you think?"},{"comment_id":"10153542533598352","commenter_b":"Wtf.....it's not like her f ing nipple is sowing or something.....how about telling the girl who come with the dress so short they can't bend down to pick up something.....how about telling the girl with their clothes so tight they can't breathe.....sweetheart enjoy your time screw them.....if they still messing with you just let hulk out and tare the place apart....well I would....I can't have fun no body having fun","commenter_a":"That's messed up they just trying to find things wrong","post_message":"Mother slams school officials who insisted her daughter's floor-length, long-sleeved prom dress was 'too revealing', claiming they 'targeted' her because she is 'plus-size'"},{"comment_id":"10153319630981135","commenter_b":"Take her car away!","commenter_a":"FOUND IN OHIO.","post_message":"Nancy Carfes was last seen around 8:30 a.m. Monday morning in the area of Wayne and Warren Roads."},{"comment_id":"10154773746046350","commenter_b":"That is so awesome-we need more of this-people helping other people-","commenter_a":"I was in an abusive relationship with an alcoholic constantly trying to keep him out of jail, take care of our 2 young children and working as a bartender. I lost a job due to not having a sitter while their father was in jail. Little did I know, 2 people who used to come into my old employment owned a small family bar and needed help. They contacted me and offered me a job. I had only been there for a short time and my boss lent me money to get my boyfriend out of jail. After a month when I reached the end of this relationship my boss lent me his car and more money to get a place and get on my feet. He never took the money I owed him out of my check. He told me to pay when I could. Every year for 3 ...","post_message":"What's the kindest thing that someone has ever done for you? Tell us in the comments below.    TODAY is kicking off our second annual #ShareKindness campaign with a goal of inspiring 1 million acts of kindness by the new year. @webpagelink    Our sponsor The Y is helping us out by committing to the first 10,000 acts."}]
