[{"comment_id":"10153548931652550","commenter_b":"my only solution to this and advice to the american government is to stop allowing foreigners to come into the united states... I think this country has the worst imigration problem.","commenter_a":"Who trusts the Obozo regime to make sure no terrorist enter our country masquerading as refugees?","post_message":"Welcome to America: New photo shows newly-married couple who killed 14 people in California last week in a suspected ISIS-inspired attack, entering the U.S. together for the first time last year ... @webpagelink"},{"comment_id":"1201354526579759","commenter_b":"Can't turn a hoe into a housewife should of known that!!! Smh Anyway in other news?","commenter_a":"When the goin gets tough the fake show true colors","post_message":"\"She's felt trapped for a while... She doesn't want to stay married.\""},{"comment_id":"1061033490639256","commenter_b":"We don't have Sharia law in America, so count your blessings and quit squawking. You're only 4-5 % of the population, so don't blame us if you are outnumbered by the straights.","commenter_a":"dont know who she is dont care","post_message":"“Being a gay American, I know what it means to look at the flag and not have it protect all of your liberties,” said soccer player Megan Rapinoe."},{"comment_id":"10153894921947217","commenter_b":"French problem they let them in","commenter_a":"Why you guys can't reports on the Massacre that taking place in Congo Beni region in Thr DRc","post_message":"The BBC's Richard Galpin was with protesters in Calais. Truckers, shop owners, farmers and police are blocking the motorway to the port and channel tunnel demanding the government find a solution to the problems caused by the migrant camp nearby. #FacebookLive"},{"comment_id":"624073524449893","commenter_b":"Leave Trump alone, We love him","commenter_a":"I love Fox News","post_message":"A Fox News reporter just left for this surprising reason. No matter we stand behind Fox News. Do you support Fox News?"},{"comment_id":"947304708651886","commenter_b":"I agree ,however the woman has he ultimate protection! POLITICAL PRIVILEGE!!","commenter_a":"then WHY isn't he requesting it/","post_message":"The pressure is growing..."},{"comment_id":"10152712712566545","commenter_b":"That was a WOMAN.","commenter_a":"That lady in the van just opened a can of Whoopass","post_message":"Here's the incredible ending to a nerve-wracking chase in Dallas County. We'll have the latest on News 8 at 4. TO WATCH/READ MORE: @webpagelink"}]
