[{"comment_id":"711971608993417","commenter_b":"The Liberals and Democrats are complete idiots. They've spent their entire lives destroying society and blaming everyone but themselves for the evilness they've generated.","commenter_a":"He is not a man - is a she","post_message":"Like if you agree."},{"comment_id":"10154403370309170","commenter_b":"She needs to go bye","commenter_a":"We're doomed!","post_message":"You have got to be kidding me. We actually elected people who believe stuff like this?"},{"comment_id":"10154390206939342","commenter_b":"Racism is at an all time high in this country and ignorant people have no shame when expressing their hate nor do they seem to understand that social media is the best place to go viral and get fired, keep em coming.","commenter_a":"This guy is a dirtbag and should be removed from office immediately.","post_message":"Parents want a school board member to be removed after a picture of him dressed in blackface hit social media."},{"comment_id":"1244207775611835","commenter_b":"That's why she wants to let them all in and use up our benefits and drain it. Enough is enough.","commenter_a":"Well just in case you needed another reason to NOT vote for Hillary here it is. But sadly, this nation is over run with uneducated and uninformed voters who will vote for free stuff that is anything but free to to american taxpayer.","post_message":"Obama used executive actions to grant amnesty to millions of illegal immigrants WITHOUT Congressional approval. Hillary Clinton says she will go EVEN FURTHER!"},{"comment_id":"1272561409477278","commenter_b":"Bitch stop lien ^","commenter_a":"Why not tell the full story instead of half?","post_message":"Over her son littering though? #WSHH #Texas #Cop"},{"comment_id":"10154466445410399","commenter_b":"@username Don't you have some wheelchairs to kick?","commenter_a":"The mom was an anti-Trump plant using her kid as a tool -- so it is another non-troversy for those fearful of the complete Clinton crushing coming tomorrow.","post_message":"“The crowd started chanting 'U-S-A' and pushing his wheelchair,” his mother said. “We were put out by security. Mr. Trump kept saying, 'Get them out.' \""},{"comment_id":"10153269533886833","commenter_b":"Obama is more dangerous to this country than any ammo.","commenter_a":"Topend Towing","post_message":"Since announcing its proposed ban on commonplace 5.56x45 mm ammunition, the Obama administration has been careful to claim that this attack on gun rights is in the interest of law enforcement officer safety. However, law enforcement doesn't seem to agree. The Executive Director of the Fraternal Order of Police National Legislative Office, James Pasco, was quoted by the Washington Examiner as stating: \"Any ammunition is of concern to police in the wrong hands, but this specific round has historically not posed a law enforcement problem.\" FOP's website describes the organization as \"the world's largest organization of sworn law enforcement officers, with more than 325,000 members in more than 2,100 lodges.\" #M855"}]
