[{"comment_id":"638229933016362","commenter_b":"Yeah. There just has to be some reason why hitliery didn't win other than the fact that she is a worthless lier.","commenter_a":"no they did not more lies","post_message":"The CIA says Russia intervened in the election in order to help Trump win. How do you feel about this?"},{"comment_id":"10153685759487439","commenter_b":"Lets ban all Muslims and Idiots like u that have no more brains cause u do to much drugs and u are just as evil as them.","commenter_a":"Ban all Mosques and Muslims from all western civilization.","post_message":"A member of the Iraqi Christian community in Michigan wrote to alert me of a proposed mega-mosque going up in a Chaldean Christian community in Michigan. How frightening it must be to them when their Chaldean brethren in Iraq and Syria are being systematically cleansed from their centuries-old homelands under Muslim rule. The genocide of the Chaldean Christians accompanied by this:"},{"comment_id":"1247749101912765","commenter_b":"It's so well done!","commenter_a":"@username Martha Elizabeth","post_message":"Periodic pumpkins!"},{"comment_id":"10153714584104087","commenter_b":"She's a pure Red in disguise.","commenter_a":"The PEOPLE are speaking. She's winning by a lot of votes.. doesn't matter what the internet thinks. Real people are voting, and real people are voting for her.","post_message":"Fresh off a commanding win in New York, Hillary Clinton has a 13-point edge in the biggest state up for grabs in next week's primaries."},{"comment_id":"10153291262602507","commenter_b":"Fools if was for your Common sense You will all Now speacks german and japonese","commenter_a":"Violence begets violence.","post_message":"Krugman ~ Why is it that terrorist acts go over right-wingers' heads?"},{"comment_id":"1163032473715499","commenter_b":"I hope Trump builds a wall 200 ft tall to keep these loosers out!!!!!!","commenter_a":"did the donald get him deported yet??","post_message":"Worker says he took a stand against Donald J. Trump and his immigration policies by hanging a Mexican flag at the Trump International Hotel in Vancouver. \"From the concrete pouring, finishing, drywall, taping, wood forming and general labour, Mexicans were there, building it.\""},{"comment_id":"10153571133258132","commenter_b":"Shut up Tina","commenter_a":"Regardless of what this family would've, could've, should've said...90% of you made your judgement the second you heard \"the news\". Until it happens in our own family, none of us have the right to judge. Just as I don't have the right to judge all of you with your incredibly hateful comments. So I won't.","post_message":" watched him like all the time. I took him to work with me. We just poured our life into him.\""}]
