[{"comment_id":"10152762362423645","commenter_b":"smh...","commenter_a":"Marlo","post_message":"Wow. That must have been a strange night. Kurt Busch testifies that his ex-girlfriend is a 'trained assassin' who returned from a mission in blood-splattered gown."},{"comment_id":"1157175910989546","commenter_b":"Why would ANYBODY admit they were a Republican after this years parade of idiots, never mind vote for them?","commenter_a":"Assholes are use of SHIT !!!!","post_message":"Three Republican presidential candidates befriend a pastor who just went on stage and gave the most bizarre anti-gay speech ever."},{"comment_id":"1879681238919909","commenter_b":"And these kind of people are what supported Hillary. No concern for the law, just like her.","commenter_a":"Animals.","post_message":"“What’s happening to America?” said David Wilcox, as he showed his wounds inflicted by the mob. “You’re supposed to be able to vote in peace! It’s supposed to be part of our democracy. And what happened is, I vote for somebody, and I get beaten, robbed, and my car stolen, and I have no way of getting my wife to and from work safe anymore,” he told the Chicago Tribune’s news crew."},{"comment_id":"10154446510547098","commenter_b":"Trump is a Nazi Hitler KKK. He does not care about you. Are you rich? You watch what that orange man does. President Obama is the best president the United States of America ever had!","commenter_a":"Liberals are very hateful and violent","post_message":"NIGHT OF CHAOS: Protestors broke windows, threw smoke bombs, and started a raging fire on the UC Berkeley campus last night...And now, President Trump is questioning funding for the school. Read more: @webpagelink"},{"comment_id":"10154256686314641","commenter_b":"What a horrible woman.","commenter_a":"i'hve ,ever seen something like that until she was suffer from mental illness","post_message":"\"Mr. Sheats will have to live the rest of his life with this horrible memory.\""},{"comment_id":"1083622038339883","commenter_b":"The girl who was supposedly GRABED claims ALL SORTS OF THINGS! I think she wants to live the American dream....SUE SOMEONE AND RETIRE! Little WITCH!","commenter_a":"Another liberal that makes me think in rare cases abortion maybe should have happened !!!!!!!!!!!!!","post_message":"BOOM!!"},{"comment_id":"10153834571832439","commenter_b":"Because we have a pussy in the White house","commenter_a":"Like no!","post_message":"Why? These migrants are coming to our countries from failed, devastated cultures. When and why was it decided that we have to mute and censor our traditions and mores for theirs - a failed society that suffocates and destroys."}]
