[{"comment_id":"10153611687931602","commenter_b":"And the fact that a grown woman liked it is equally disgusting. Grow up","commenter_a":"You know who also spoke his mind? ... Hitler.","post_message":"\"Trump? I love everything about him,'' said one voter. \"He speaks his mind and doesn't care if he offends anybody. He's saying, 'This is who I am — take it or leave it.'\""},{"comment_id":"10153855309638010","commenter_b":"too late on the troops - we're up to 5000 in country","commenter_a":"Just may be very well a Trump supporter making America GROSS again!","post_message":"The woman, who works for the Department of Corrections, was filmed ridiculing a Muslim man for praying and then hitting him with an umbrella and throwing coffee at him."},{"comment_id":"10152987846462483","commenter_b":"Stfu fat cunt","commenter_a":"Chattanooga did lower the flags. A presidential declaration is not necessary for every death that occurs unless it is someone who has national level. A state or city can lower the flags without a presidential declaration. People need to inform themselves about the flag lowering issues. If we lowered the flag for every person that got killed, the flag would never be flown at full staff.","post_message":"Former U.S. Navy SEAL Marcus Luttrell pleads on his Facebook page, \"Think on it. RIP brothers, your families will miss you, the country will mourn you, and those still wearing the uniform will never forget you...Oh one more thing, lower the FLAG!!!!!!!! Sir.\"   The flag has been lowered at the United States Capitol in Washington, D.C., but no word yet on whether the flag will be lowered at The White House."},{"comment_id":"847757325414844","commenter_b":"fly your flag and tell these invaders to get out","commenter_a":"Let him fly his flag, this is America","post_message":"There is nothing threatening about an American flag.  He wants to show his pride for his country, let the man!  Do you think he should be able to fly his flag?"},{"comment_id":"10153039868668984","commenter_b":"Bitch....","commenter_a":"Filthy rich don't need any more money but their filthy greed demand more and more.","post_message":"I can't believe she did this. There are plenty of people out there who would kill for even a small fraction off that money...."},{"comment_id":"1015593815224063","commenter_b":"impeach","commenter_a":"WORSE","post_message":"This is BRUTAL. Obama and his Zombies will NOT like this POLL. Which answer did you choose? This deserves 50,000K 'LIKES & SHARES!' @webpagelink"},{"comment_id":"10152875043501973","commenter_b":"My husband said he wished there was since we can't just hop in our car and get down there. :)","commenter_a":"Is there an online store too???","post_message":"The sale starts today at 9 a.m. for season ticketholders, 11 a.m. for the general public, and offers up a ton of Ducks' athletic gear."}]
