[{"comment_id":"607938739358501","commenter_b":"Then dont go watch guadian of the galaxy 2 ..groot hates you!","commenter_a":"Look! Its raw meat! Its eel on the grill.. so it is food! We human are mammal and also carnivore. So eat things raw is a way of eating. Only when you kill for fun and waste the meats of throw away too much leftover then that would consider a sin for others may not have enough to eat! If you think eating thing raw is immoral or gross then throw away your fruits, veggies because they are still living things and have souls and you may not know it! Damn you people with no understanding and misjudgement","post_message":"What. The. Hell."},{"comment_id":"1708937832702911","commenter_b":"I would like one illegal immigrant or one Mexican to please answer this question. Why is an American considered a racist because we want a wall to control the people that we allow in this country. You just can't have open borders and allow anybody and everybody to come in that is not a country anymore. Furthermore why is it that Mexico has a Huge fence with Barbwire and guards in towers with rifles by the Mexican Guatemala border??? What hypocrites!!! Maybe because Mexico does not want illegal immigrants coming into their country from the Guatemala border but Americans are racist if we don't want illegal immigrants coming into our country. Totally absurd!!","commenter_a":"And they have the Bundy 's in jail and killed Levoy . These violent protesters get to go home alive .","post_message":"HOW INSANE! Photos and videos you must see from last night:  @webpagelink"},{"comment_id":"10158544268330713","commenter_b":"Well she is a devil whore.","commenter_a":"I would have paid her to wear it if it have covered that ugly face...","post_message":"Progressives hate capitalism, except when they don't."},{"comment_id":"10153259880651162","commenter_b":"I wonder what he thought was going to happen to her after he beat her w/ the hammer?","commenter_a":"Hit her in the head with a hammer and get an I bond He's the real MC. HAMMER","post_message":"HAMMER BEATING: An 87-year-old man beats wife with hammer at a hospital to avoid her surgery ..@webpagelink"},{"comment_id":"10153737198202235","commenter_b":"Fucking dumb women.","commenter_a":"Carson will never be elected because the majority of American women will never vote for this clown","post_message":"What a horrible person he is. Just awful."},{"comment_id":"1295020463887979","commenter_b":"hes already done good and not even president yet","commenter_a":"Where is your white racist president that said he was going to send them all back out of the United States our country????","post_message":"Yikes..."},{"comment_id":"10153050931108984","commenter_b":"unbelievable .... if he would not have fought .. they would not have a chance to protest ... arrest them all, through them put of section 8 housing, take their welfare check and foodstamps away .. tye are scum bags of the worst !","commenter_a":"You can't fix culture none of them have served in the armed forces and never worked that's why they have no respect","post_message":"In case you missed it...This is absolutely disgusting. This hero deserves everyone's respect.  Do you support the brave men and women who fight for our freedom?"}]
