[{"comment_id":"10152945596811336","commenter_b":"most schools require children to be up to date on vaccines - if you want to enroll kids in school it has to be done. But it does need to be a parent's decision- there might be extenuating circumstances where they chose not to.","commenter_a":"When commenting on a liberals post, check your grammar and punctuation carefully because that's the only comeback they've got.","post_message":"Sen. Rand Paul got a booster shot just a day after he injected himself into the national vaccine debate: @webpagelink"},{"comment_id":"1296742057059213","commenter_b":"She is trifling","commenter_a":"This bitch stealing, got caught and now trying to act tough and threaten someone who is working to make a living for themselves. That bitch need to get a reality check and her welfare check taken. Cussing in front of her kid and possibly fighting and then what? Just sad.","post_message":"Rachet behavior at it's finest! #WSHH"},{"comment_id":"908907002538886","commenter_b":"Kool aid Oh Yea...","commenter_a":"Lol I love my president. ✊🏾","post_message":"“Bernie Sanders might run… apparently some folks really want to see a pot-smoking socialist in the White House. We could get a third Obama term after all.” - President Obama at the 2015 White House Correspondents' Dinner"},{"comment_id":"520161724799271","commenter_b":"Illinois State law Requires When a firearm is sold or transferred, the buyer is required to present their FOID card. This applies to private sales between individuals as well as to sales by Federal Firearms License (FFL) holders.[7] For firearm sales by an FFL holder, or at a gun show, the seller must perform an automated dial-up check with the State Police, to verify that the FOID card is valid, and to redo the background check of the buyer.[4] This additional checking is known as the Firearm Transfer Inquiry Program (FTIP).[8] For private sales not at a gun show, the seller must also verify the buyer's FOID card with the state police, and receive a transfer approval number, either via a web site or with a phone.. Once again the Anti_ Gun posters cannot get the story straight even if they tried.","commenter_a":"So glad we have Universal Background Checks! Next time the criminal will do a Universal Background Check before he beats the victim and steals all the other guns. You know so he is somehow legal?","post_message":"Before leaving, his attackers also took his gun safe and ammo. -Linda"},{"comment_id":"472497066265507","commenter_b":"I believe she had a choice before the seed got mixed. so don't start the problem in the middle start at the beginning...","commenter_a":"AMEN","post_message":"Every woman is entitled to control over her own body."},{"comment_id":"456764181180829","commenter_b":"Looking at that ugly bitch may stop people from going to McDonald's","commenter_a":"Ooh i just lost my appetite. Why would McDonalds allow this. She is so BSD about anything dealing with food and nutrition","post_message":"Would You Refuse To Eat An 'Obama' Burger? Comment 'yes' or 'no'."},{"comment_id":"971078176272942","commenter_b":"I am writing the facts and the reality. Muslims do not adapt to our culture, habits and language. There is one kind of human race which always cause problems: Muslims. The only thing Muslims do is fight. In your muslim countries, all what you guys do is fight, fight and fight. If you want to live according to the Islamic laws, go live in Muslim countries. There are enough Muslim countries where you can experience your believe . Let the people of Europe alone. Adjust or outside. Respect our Western culture.We do not need you. You are a cost for the European community. You make abuse of our social security. You have no added value for Europe.","commenter_a":"@username, All Muslims are terrorists. Muslim students have cheered in a Dutch school when they heard that the airport has been attacked in Brussels. Muslims have thrown stones at the police in Brussels at the time of the arrest of the terrorist Abdeslam.The situation in Europe is much worse than the media lets on. Muslims who commit such attacks are psychopaths. There is something seriously wrong in their heads. You can't negotiate With fools . There is only one way to deal with this. Eliminate! All the world has problems with the same human race: that are the Muslims. It is a fact and a reality. It is always with Muslims that the world has problems with. You forgot the attac in New York committed by Muslims coming from Brussels! Muslims are a threat to humanity. Please wake up Hillary. Face the reality of the danger!","post_message":"In our fight against radical jihadism, we have to do what actually works. One thing we know that does not work is offensive, inflammatory rhetoric that demonizes all Muslims. There are millions of peace-loving Muslims living, working, raising families, and paying taxes in this country. These Americans are a crucial line of defense against terrorism. They are the most likely to recognize the warning signs of radicalization before it’s too late, and the best positioned to block it. We need every American community invested in this fight, not fearful and sitting on the sidelines. So when Republican candidates like Ted Cruz call for treating American Muslims like criminals, and for racially profiling predominantly-Muslim neighborhoods, it’s wrong, it’s counter-productive, and it’s dangerous."}]
