[{"comment_id":"10153714584104087","commenter_b":"She's a pure Red in disguise.","commenter_a":"The PEOPLE are speaking. She's winning by a lot of votes.. doesn't matter what the internet thinks. Real people are voting, and real people are voting for her.","post_message":"Fresh off a commanding win in New York, Hillary Clinton has a 13-point edge in the biggest state up for grabs in next week's primaries."},{"comment_id":"10153050931108984","commenter_b":"unbelievable .... if he would not have fought .. they would not have a chance to protest ... arrest them all, through them put of section 8 housing, take their welfare check and foodstamps away .. tye are scum bags of the worst !","commenter_a":"You can't fix culture none of them have served in the armed forces and never worked that's why they have no respect","post_message":"In case you missed it...This is absolutely disgusting. This hero deserves everyone's respect.  Do you support the brave men and women who fight for our freedom?"},{"comment_id":"10153009688681051","commenter_b":"Of course hollis god says if you're not with me your against me.. you send yourself to hell .. Muslims will enjoy and do enjoy rape murder and torturing you then sending you to hell.","commenter_a":"How disgusting and disgraceful. Christians are always like keep Christ in christmas, being back the pledge and the nativity scene and I love rebel flags, but the moment another person who doesn't believe their same beliefs is shamed, they point fingers and laugh. all of these people that think deeply offending someone's religion is a joke don't deserve to bear the name of christian. Have some discipline...","post_message":"The Muslims who thought they were buying halal products at this store just found out they had been eating pork the whole time."},{"comment_id":"10153030983541051","commenter_b":"I would sue tjat fucking bitch and that guy","commenter_a":"Soooooo?! Why was that day different from any other?","post_message":"This woman turned to the Border Patrol officers and said: What are you going to do, arrest me? Turns out, they had something else in mind."},{"comment_id":"10153427555429087","commenter_b":"How the hell do you not get 1000 signatures? Hahahahahaha","commenter_a":"Fail @username","post_message":"A spokesman for the Ohio secretary of state has confirmed to The Hill that Martin O'Malley failed to get the necessary 1,000 signatures to appear on the March 15 ballot."},{"comment_id":"1007831625924362","commenter_b":"Aka: a bitch wasn't a slut cause she refused to go along ( re: politically, sexually, maternally, etcetera.)","commenter_a":"Never, even when I thought it of myself. Maybe since I'm \"of a different generation \" I'm prouder of some other word","post_message":"You keep using this word. I do not think it means what you think it means. - Alisha Huber"},{"comment_id":"10154761177058812","commenter_b":"She's a lying sick woman","commenter_a":"Amazing how you say you are happy to answer questions about the Clinton Foundation, but you NEVER DO! You have done more dirty deeds in your lifetime than one person can imagine. I love how you are like a child. You get called out for your own wrongdoings ( and then tell the FBI you have a concussion and cannot remember anything.. BS) so to take off the heat you try to point fingers at the other guy. If you win, American deserves what they get.","post_message":"In an exclusive interview with ABC News David Muir, Hillary Clinton calls for scrutiny of \"questionable\" Trump Foundation dealings in light of IRS fine: abcn.ws/2c4YKqd"}]
