[{"comment_id":"1668356646775381","commenter_b":"The truth will set you free and she spoke the truth.","commenter_a":"Fox should listen to its viewers. Go Stacey","post_message":"Stacey Dash has been suspended by Fox News for saying this to Obama. She needs our support. Should Stacey Dash be reinstated?"},{"comment_id":"10153632735051636","commenter_b":"@username typical this comes out after assignment submission","commenter_a":"Just wondering how many u turns this is now ?","post_message":"A good day to bury bad news"},{"comment_id":"1005620852830996","commenter_b":"Of course the wives are to blame! Sad that she hunts for weak married men because clearly she can't find one of her own! See picture !","commenter_a":"Correction - the person going out of their way to cheat is to blame for not trying to fix any problems their relationship may have, for not giving their partner a chance and lying. Women like her who go with men knowing they're are married give the rest of us a bad name, she should be ashamed of herself, coming out with drivel like that just proves she has no morals and is kind of desperate for any male attention, but she is not completely to blame here either. Fix what's wrong in your relationship and if it's unfixable then leave, DON'T CHEAT.","post_message":"Woman who has had 100 affairs with married men blames their wives"},{"comment_id":"10157388184590603","commenter_b":"That wall doesn't work. Many people coming in illegally from Mexico are actually from Cental America.","commenter_a":"I think it will help open discussion about illegal entry into the US. Mexico has a huge wall on its border with Guatemala for the same reason.","post_message":"Do you think think this trip will help or hurt Donald J. Trump?"},{"comment_id":"10152564935772217","commenter_b":"pussy","commenter_a":"D man is a fool is dis how you catch a thief","post_message":"Brave or stupid? This passer-by tackled a robber who'd just raided a jewellery shop in London: @webpagelink"},{"comment_id":"1795749220655470","commenter_b":"The point is assult rifles are banned already....","commenter_a":"Too bad what you carried in Iraq was a selective fire M4, not a semi-auto ArmaLite rifle, you can't teach common sense, but you can at least know the difference between an Assault rifle and a AR-15","post_message":"I know assault rifles. I carried one in Iraq. They have no place on America's streets. #Orlando"},{"comment_id":"10153908601902629","commenter_b":"Bye bye, bitch!","commenter_a":"Hope Cliven doesn't have any horse shit on those fancy kickers","post_message":"Cliven Bundy, the Nevada cattle rancher who birthed the Oregon militia movement in more ways than one, was arrested last night on felony conspiracy charges after he tried to join the standoff."}]
