[{"comment_id":"1043008155755713","commenter_b":"To prison. Oh that's right she is above she law.","commenter_a":"It wasn't a vacation it was a paid leave of absence. Hello Obama is any body home? You work for us just like Hillary. O yeah she doesn't do anything but lie.","post_message":"Tonight is the biggest fundraising deadline yet of this campaign. It isn’t about money, budgets, or even what our competitor might raise. It’s about you and me, working together to protect and build on President Obama’s progress—making sure our country is strong, safe, and fair. If you're with me, chip in $1 right now: hrc.io/1NXINOf -H"},{"comment_id":"880663015326781","commenter_b":"Alex Peterson hahahaha","commenter_a":"Tyler Simmonds @username Ashley Mckendrick","post_message":"Dolphin seduced me, claims man who had sex with marine mammal."},{"comment_id":"10154526253322464","commenter_b":"Want to bring some refugees? Bring the Yazidi!!!","commenter_a":"We want to live in peace I Yazidi from Iraq There's no one feels Us #StopYazidiGenocide #StandforYazidiWomen #StopYazidiGenocide #StandforYazidiWomen Nadia Murad","post_message":"Washington Examiner: Oklahoma Obamacare plans face 76 percent hike.  #FullRepeal: @webpagelink"},{"comment_id":"10153252921156833","commenter_b":"Good for the homeowner! Its time these THUGS learn that our homes ARE NOT THEIR PROPERTY AND THEY CAN'T ENTER WITHOUT OUR PERMISSION.","commenter_a":"Love this...","post_message":"An Albuquerque Police spokesperson says that a homeowner awoke to noise in his house and grabbed a firearm, thinking there was possibly an intruder. The homeowner checked the house and found a man, identified as 28-year-old Robert Bartley, crouching in his kitchen holding what the man said 'appeared to be knife.' According to police, Bartley approached the homeowner saying he was going to kill him."},{"comment_id":"10155189580834411","commenter_b":"'@username ... Crawl back down your sh!thole!","commenter_a":"Everyone should boycott Israel. They are an apartheid state with no regard for international law. The bulldozed over 100 homes in the first week of 2017.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153585034949497","commenter_b":"Eh you know how the hot chicks are...","commenter_a":"Area Gisele fails to properly deflate Tom Brady's balls","post_message":"The NFL has debuted new rules pertaining to the quantity, air pressure, inspection, labeling, and monitoring of game-day balls"},{"comment_id":"10153569786727522","commenter_b":"What do American soldiers have to do with restriction of future immigrants?","commenter_a":"Barbara Bell","post_message":"'When you question a mother's pain...you are attacking us.'"}]
