[{"comment_id":"10153733539132169","commenter_b":"\"thank you for your service\"","commenter_a":"Jasmine Taylor","post_message":"Join The National Memorial Day Concert (PBS) this Sunday at 8/7c for an evening of remembrance, featuring General Colin L. Powell, Renée Fleming, The Beach Boys, Katharine McPhee, Trace Adkins, S. Epatha Merkerson, Esai Morales, Alfie Boe, Trent Harmon Music, Maestro Jack Everly and co-hosted for the eleventh year by Joe Mantegna and Gary Sinise. Join the conversation at #MemDayPBS"},{"comment_id":"1793346000922790","commenter_b":"The only women that believe that they shouldn't be checked out are the ones that don't have to worry about it anyways.","commenter_a":"I got dress coded while still in school for my skirt being to short when i argued this saying that it was well pass my finger tips she agreed but since i had long legs the skirt looked short so i would have to change","post_message":"Portland just completely flipped the script on sexist school dress codes."},{"comment_id":"10153354052466770","commenter_b":"Who cares what a woman beater thinks fk off chrissy","commenter_a":"Racist lives matter","post_message":"He had nothing good to say."},{"comment_id":"349993335204181","commenter_b":"Since nobody will charge her with anything, she is above the law","commenter_a":"Yelp the Clintonss. Obama .Kerry's .. all do.","post_message":"Rand Paul says Hillary thinks She Above the Law"},{"comment_id":"1192273137481692","commenter_b":"Isn't this a dam foolish question to be asking of the citizens of US...why would we want Shariah law to begin with...they are taking over and our govt is allowing it...they have to conform to our CONSTITUTION here in America...can't do it, go back to your hole that practices Shariah wicked law..","commenter_a":"Yes! there is NO place in our country for Sharia law so take your laws home, Obay the constitution your in America.","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"980669235328527","commenter_b":"That is exactly what they should do no money","commenter_a":"I do not know who those three boys are but they sure made me a proud American--What angers me with these Administrators do not care that the cemeteries are full men and women who fought and died for what that flag represents--I with @username","post_message":"Tennessee School District Bans All Flags, Including the American Flag (VIDEO)  @webpagelink"},{"comment_id":"10153666093873132","commenter_b":"Please!!!! She is a rapist!","commenter_a":"Nik Gudel","post_message":"Altice's lawyer described her as a woman who was trapped in a bad marriage, saying she is \"troubled\" and \"has problems with viewing her own worth.\""}]
