[{"comment_id":"937487649627809","commenter_b":"NO, NO, NO. Why is there even a question about this. Too many illegals in this country already. Do you want more?????","commenter_a":"Everytime I think I hear the dumbest thing ever, something else trumps it. I cant believe how unpatriotic some folks are now days. America is for Americans. Become an American and then you can vote. No intelegent group would ever let an outsider make a decision for them. It doesent make sense.","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"},{"comment_id":"764036443733722","commenter_b":"Absolutely! Throw the Muslims off the bus. When will we be able to do as we please even if the stupid Muslims are offended. WE HAVE RIGHTS AND THE MUSLIMS OFFEND US.","commenter_a":"Were wrong. This is America. Freedom of speech.","post_message":"Woman And Daughter Kicked Off Bus For Singing Nursery Rhyme That Offended Muslim Passengers. She was just trying to soothe her daughter. Do you think this is wrong?"},{"comment_id":"1703915029828450","commenter_b":"Mitt you looking for your10 mintues of fame????.... you lost get over it.....How can you allohw a Party to say mine and millions of people vo te don't count.....????..we don't like Rubio.and by the way llook hard in Flordia about his pass!!! we don't like Ted Cruz.. which i think thie Chistian voter shows that... Donald Trump for President 2016 has grown your Party... I am 60yrs old i have been a Dem all my adult life.. this year,, i changed to Rep Party....to vote for Donald Trump for President 2016... and now it doesn't matter?? because the GOP says so.... pure Goverment !!! trying to hold on to there ways the hell wi th the people e.... ok i you keep your crap up.. just won't vote.....and we can have another 4 years of Obama... and i am sure i am not a lone on this....th an you have ...","commenter_a":"And I put a hundred hours and a lot of cash working for Romney. A RINO at heart and a man that can't close the deal.","post_message":"Donald J. Trump responded to Mitt Romney, calling him 'one of the dumbest and worst candidates in the history of Republican politics.'"},{"comment_id":"1052573001452785","commenter_b":"Absolutely fuck a gun i don't hit women but that ghetto trash should've been slapped in the face","commenter_a":"This is the norm for these racist cockroaches, get a gun people because we're at war whether you like it or not................It's all thanks to that sorry POS Obama and his corrupt administration that led us here!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO] Racebaiters will never say anything about this. What would you do in this situation?"},{"comment_id":"10153557938016438","commenter_b":"That woman is a criminal with a capital C.","commenter_a":"This is why I love Hillary Clinton!","post_message":"Clinton knows the only word a politician enmeshed in scandal needs."},{"comment_id":"10153921301277217","commenter_b":"'@username has lost their integrity!","commenter_a":"Hahaha.sorry for the laugh. But @username Please investigate first before you conclude on this report. These are all accusations to our beloved president . even his rival denied those witnesses that testified in the senate. sad to say our president's rival now is doing the best they can to destroy our only hope to have a drastic change in this country . BTW You need to go to our country first to know more abt the facts and whats really happening here. :3 -_- #PostResponsibly -_-","post_message":"Gruesome gangland-style hits, including feeding one victim to a crocodile, were described to a Senate hearing by a former death squad member."},{"comment_id":"10154855250569062","commenter_b":"please name a book that would represent all citizens lol come on now. Tennessee is like 81% christian so i think the book works fine @webpagelink/ it represents the people not the government, so there is your seperation :P","commenter_a":"Even when I was an atheist, the bible was a good read. Some of them just need to get their head out of their butt to look at things objectively.","post_message":"Good idea? Bad idea?"}]
