[{"comment_id":"10153370720431509","commenter_b":"Well the real word is cold and full of corruption and greed. This type of harvesting happens on a daily basis in 3rd world countries, poor desperate individuals selling their kidneys in back allies to rich benefactors. Most illegal organs are stolen form human trafficking.","commenter_a":"Organ harvesting and transport is complicated. You can't just slash a body and grab them out. This sounds like a ploy by the Iraqi govt to get headlines","post_message":"It's a startling claim. If true, what could be driving increasingly extreme tactics #ISIS is employing? @webpagelink"},{"comment_id":"10153266948641336","commenter_b":"Imagine that, another black defending them. WTG Angela, you thug.","commenter_a":"Stupid. So, they support arson, robbing and looting and destroying a city?","post_message":"Beyoncé and JAY Z reportedly paid Baltimore and Ferguson protesters' bail money, an activist claims."},{"comment_id":"597418893776211","commenter_b":"@username Jill stein is a communist and belongs in jail for vandalizing construction vehicles at standing rock and she's crazy","commenter_a":"Bernie needs to take a young politician under his wing and mentor them so one or two elections down the road the only politician in america with a moral bone in their body isn't pushing 90.","post_message":"Mr. Trump, you told working people you were on their side. You know what? Millions of us are going to demand you keep your promise."},{"comment_id":"10154486543656037","commenter_b":"Hillary has deceived all of u!!' Rosanna, this is what she wants. You're just as disgusting as her😎😎😎","commenter_a":"Trump has been saying the system aka Democraps is Rigged. I guess they gonna start saying build a wall next lol copy cat libtards!","post_message":"Elizabeth Warren: \"The system is rigged, and Donald J. Trump would make it worse.\" @webpagelink"},{"comment_id":"10154769435278812","commenter_b":"Does this lady ever stop lying roflmao","commenter_a":"and Hillary thinks her connection to black voters is carrying hot sauce in her purse.","post_message":"Addressing the National Baptist Convention in Kansas City, Hillary Clinton took a veiled shot at Donald J. Trump, who made his first trip to a black church on the campaign trail this past weekend and has been making a pitch for the African-American vote."},{"comment_id":"1062386963799539","commenter_b":"@username Much like one refinances one's house at a lower rate. Sure sounds Republican to me.","commenter_a":"And this political cartoon shows why he should. Personally I'd prefer that he wait and allow a Democrat president appoint him to the Supreme Court.","post_message":"Does this about sum it up?"},{"comment_id":"1099626483393732","commenter_b":"RINO revolt began with Romney. We shall soon see a series of similar dogs.","commenter_a":"Ventura is a jackass!","post_message":"Someone other than Michael Bloomberg is considering a run for president.  Could this controversial figure make an impact on the 2016 race?"}]
