[{"comment_id":"1120798904674131","commenter_b":"#NeverCrookedHillary #HillaryTheLiar","commenter_a":"If taxes will pay for it, and I pay taxes, shouldn't this read \"How much money will Hillary's plan cost you?\"","post_message":"Whether you already have student loan debt or you're preparing to go to school, Hillary's college plan can help you save money. Find out how much using our new calculator: hrc.io/2cH4yGX"},{"comment_id":"592897514209538","commenter_b":"That'll get a lot of these men shot in the ladies room !!! Hey ladies , keep shooting till you're sure they're dead","commenter_a":"A bunch of idiots!","post_message":"A bill to repeal a rule allowing transgender individuals in Washington state to use public bathrooms based on their gender identity has cleared a state Senate committee."},{"comment_id":"10156784755310354","commenter_b":"Fly on your Broomstick Hillary!!","commenter_a":"The fact that she has not been indicted by now with the mountain of evidence stacked against her is proof that it will NEVER happen, folks.","post_message":"There is zero irony in this story."},{"comment_id":"10153309026372452","commenter_b":"Please move out of Communist California.","commenter_a":"Hunter 😒😒😒😒😒","post_message":"The more you drive the more you pay? California could soon charge you for every mile you drive. abc7.la/1JjBX9b The state is looking for volunteers to test a new \"mileage tax.\" It's designed to replace the gas tax, but could you end up paying more? And how would they track every driver in the state?"},{"comment_id":"10153135004736756","commenter_b":"Henry Gallo- happy belated birthday! You have a lot of styling still to do!","commenter_a":"Great story Joe! Thanks for sharing.","post_message":"Zoe Spawton used to waitress at a café in Berlin where she would see Ali Akdeniz walk by every morning. He caught her eye because of his put-together, plucky apparel. She was so taken by his du jour ensembles she asked to take his picture. It became a daily ritual and the photos form the blog What Ali Wore."},{"comment_id":"1546688018681408","commenter_b":"If we are about to start following the Bible, can we get this woman to shut her mouth first ??","commenter_a":"I'd pay money to see the look on her face at the innoguration.","post_message":"\"Okay, Hillary, now that Donald J. Trump is looking to help you heal and help the nation heal, would it be fair to say – to use your own words – 'It's time to give Donald Trump his chance to lead'?\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"950976811609844","commenter_b":"Yes!!! Although these women should be considered normal size and healthy... Definitely not 'plus size'... Sick of all the labelling... How 'bout healthy, happy and active?!","commenter_a":"I don't care what anyone else thinks. I think she looks great. But I think the more important question is \"How does her personality, intelligence, etc. compare with her looks?\"","post_message":"So excited for The Official Ashley Graham Fan Page, the first \"plus-size\" model to have an ad in Sports Illustrated! AND for Robyn Lawley, who's the first \"plus-size\" Swimsuit Issue model! Here's why that's so exciting."}]
