[{"comment_id":"10153919933534342","commenter_b":"ABC 13 Houston could you please explain what \"stunning\" about a kid riding a bike?","commenter_a":"At least its a 2 stroke bike","post_message":"Stunning video captured the moment a teen rode a dirt bike through a HS campus.  For the FULL story --> @webpagelink"},{"comment_id":"1316090455150672","commenter_b":"Swamp monsters","commenter_a":"tells you a lot about this so called president","post_message":"Truly deplorable.  Thanks to 1533 Days."},{"comment_id":"10154364197411336","commenter_b":"Lady you are unbelievable","commenter_a":"Chris Kyle: American Liar","post_message":"A federal appeals court has thrown out a $1.8 million judgment awarded to Jesse Ventura, who says he was defamed in Navy SEAL Chris Kyle's book \"American Sniper.\""},{"comment_id":"10153477114308984","commenter_b":"She's obviously trashy","commenter_a":"Am I the only one that saw that woman get out of that scooter, clearly nothing wrong with her","post_message":"This woman's young son got involved in her brawl with another Walmart shopper, and the video took the internet by storm. Now she's speaking out to defend their actions...  Do you think her son's behavior was unacceptable?"},{"comment_id":"10152640565354135","commenter_b":"BOOO ! Fix our roads , decriminalize drug use ( since our prisons are flooded with NON violent offenders wasting everyones tax dollars on free room and board), allow Tesla Motors to do business in our state, handle the heroin epidemic going on in our cities and sub-urbs , preserve more forrest and farm land ............. He's not doing his job , he's pressed for his future candidacy for the white house , neglecting the nuances in his community.","commenter_a":"Go @username 2016","post_message":"America has been a nation that has always controlled events and yet today events control us. Why? Because leadership matters. It matters if we want to restore America's role in the world, find the political will to take on the entrenched special interests that continually stand in the way of fundamental change, reform entitlement spending at every level of government, and ensure that every child, no matter their zip code, has access to a quality education. So, today I am announcing the launch of the Leadership Matters for America PAC. The PAC's goal to get real leadership back in our country starts today. So, let's get to work! Join us at: @webpagelink"},{"comment_id":"10153428206108984","commenter_b":"She needs prison time!","commenter_a":"As far away as possible","post_message":"Looks like this is coming back to haunt her...  Do you think Hillary Clinton needs to stay far away from the White House?"},{"comment_id":"10154997509084626","commenter_b":"YOU ARE AN INSULT TO ALL WOMEN","commenter_a":"The embryo inside you, is not your body","post_message":"LIVE STREAM: Women's March on Washington"}]
