[{"comment_id":"10157769548850725","commenter_b":"Go kick her butt.","commenter_a":"you go donald !","post_message":""},{"comment_id":"10155343627345389","commenter_b":"She is to old to run for President. She is a liar and a cheaters.The women is another socialist like Obama. She need to go away for good.I'am sick of the Clinton and Bushes.","commenter_a":"She is a felon","post_message":"JUST IN: House panel subpoenas former Secretary of State Hillary Clinton's personal emails in Benghazi probe.  Question of the Day: Will the growing list of scandals hurt Clinton if she runs for president?"},{"comment_id":"10153294760143984","commenter_b":"Who gives a flying flip of these two self serving godless people? They are both the horse's ass and should be ignored! !!!","commenter_a":"I wonder how it got that way ???????","post_message":"It seems as though Wild Bill's love life wasn't the only thing that was out of control in the White House during the Clinton's tenure..."},{"comment_id":"10153664912304726","commenter_b":"There are Syrian refugees already there!!","commenter_a":"Yeah, let the refugees all live at the vatican. they got lots of money and plenty of room.","post_message":"The Vatican keeps out the throngs while the Pontiff urges the U.S. to open borders."},{"comment_id":"10152895452606051","commenter_b":"BANG! But since that didn't happen, \"drop the soap bitch.\"","commenter_a":"Coward!!! Thank God for good neighbors.","post_message":"This man grabbed a woman and began raping her. That's when a group of Good Samaritans heard her screams."},{"comment_id":"10154284247599575","commenter_b":"Throw her in with the hardened inmates. Id love to see how \"pretty \" shed look then","commenter_a":"Oh god not another one...","post_message":"This bad girl is getting lots of social media love for her attractive mugshot.  Just keep in mind she's charged with aggravated robbery, kidnapping, first degree battery, hindering prosecution, and tampering with physical evidence."},{"comment_id":"905881252841461","commenter_b":"Frigging Brainless Teabaggers!","commenter_a":"Wait, he's flying to Florida with all that has to travel with the president to give a speech about Earth Day? Wouldn't it be better to do it from Washington via satellite and NOT burn all that fuel getting there?","post_message":"With special guest Bill Nye the Science Guy! #EarthDay"}]
