[{"comment_id":"10153209922201491","commenter_b":"Yes, let's leave the talk up to celebrities. Why should parents teach their kids anything? Brilliant, world.","commenter_a":"Admins, please contact me through inbox messages","post_message":"Jessica Biel: \"We want girls to know what their [body is going through] so they don’t feel scared or ashamed or gross.\""},{"comment_id":"10153186882059641","commenter_b":"hmmm as long as it's not cooking drugs, printing fake marriage certificates, scamming, and turning young girls into prostitutes... #NOTOXENOPHOBIA AND ALL ILLEGAL ACTIVITIES","commenter_a":"I hope South Africans will not hear this, they will accuse the robot of taking their job and another xenophobia again.","post_message":"This robot chef will soon be able to cook 2,000 recipes. Pity it can’t eat them: @webpagelink"},{"comment_id":"10153962435457235","commenter_b":"ive got a few vulgar words for this trump ish.... can not stand her face, her voice, or any damned thing that comes out of her mouth. this woman is a vile creature that needs to crawl back under whatever rock she slithered out from.","commenter_a":"Founding father of porn.","post_message":"It's hard to imagine the GOP getting more juvenile than this -- but let's see what happens tomorrow!"},{"comment_id":"10153649615904199","commenter_b":"The employee aint do nuthin wrong. she got hit. ole white girl lucky she didnt get stomped harder.","commenter_a":"The employee should be fired. People need work ethics. Call for the customer to be removed!","post_message":"Warning this video contains graphic language."},{"comment_id":"10152917419231051","commenter_b":"Seriously the Husbands deserve same treatment. I am not saying the mistress didn't have it coming . Chinese ladies are crazy !!!","commenter_a":"I don't get it! What about her douchebag husband!!? He's the one married but still decided to sleep with her sooo....","post_message":"This wife decided to track down her husband’s mistress and make an example out of her."},{"comment_id":"10153255474016509","commenter_b":"Avi Cohen she has money my $45,000 a year is her daily parking fee money","commenter_a":"I need to find her and get her pregnant ... I wonder if she likes chocolate","post_message":"After all that back-and-forth about their billion-dollar divorce, oil tycoon Harold Hamm's ex-wife has finally cashed the check for $975 million. @webpagelink via CNNMoney"},{"comment_id":"1006176036165841","commenter_b":"Just why is this bitch here ??","commenter_a":"You're right. I didn't see anything about this on the news networks.","post_message":"You will DEFINITELY not see THIS on CNN. Nor, will you hear BHO condemn her violent, F-bomb laden, BS. @webpagelink"}]
