[{"comment_id":"10153173606151602","commenter_b":"Hartford rules, its a silly name just like every other name in the minor league. The only difference is that its unique and stands out a bit because it's so absurd. I'm still going to have to fun.","commenter_a":"I feel like I am constantly defending Hartford - telling people how far the city has come, and all of the neat things there are to do here. But this? This, I cannot defend. I was super excited for this stadium, and now, for the first time, I am truly embarrassed for and by this city that I have grown to love. Temporary attention that derives from a stupid name doesn't breed long term community commitment. It just gives jaded locals more things to complain about, instead of taking pride in their city. Such a shame.","post_message":"After weeks of waiting, we now know the name of Hartford's baseball team."},{"comment_id":"1023827831012269","commenter_b":"Darlene Daniel not fair to Americans. Take way American jobs with low wage illegal invaders","commenter_a":"We \"ALL\" know that Donald Trump is \"NOT\" afraid of Megyn Kelly. Actually it is just the opposite. Fox News is AFRAID OF DONALD TRUMP.","post_message":"Michael Moore chided Donald J. Trump for being afraid of Megyn Kelly and backing out of the upcoming Republican debate Tuesday night on \"The Kelly File.\""},{"comment_id":"606800519482594","commenter_b":"HILLARY you have no CREDIBILITY ! YOU LIE SO MUCH WE CAN'T TRUST YOU EVEN WHEN YOU DO TELL THE TRUTH YOU'VE LIED SO MUCH WE CAN'T TELL! SO GO POINT YOUR FINGER FULL OF BULL SHIT IN SOME ISLAMIC WORLD THAT BOUGHT AND SOLD YOURSELF TO ! DUMB ASS LIEING BITCH!","commenter_a":"This woman is a total disgrace to America and to all human beings!","post_message":"Hillary Clinton just said Donald Trump is too dangerous to be President of the United States. This is why."},{"comment_id":"504677803025508","commenter_b":"Can't stand Mcain","commenter_a":"John Mccain almost crying because he's losing his beloved mercenaries under Russian airstrikes - @webpagelink","post_message":"What is really going on?"},{"comment_id":"1738896129708338","commenter_b":"Abortion queen, and has no shame.","commenter_a":"this drunk, druggie idiot has comments that no one cares about. She is a has been,, and has been Had !!! Loser, Drunk","post_message":"Renowned moral philosopher Chelsea Handler condemns Trump.   The paragon of virtue also adds: \"Please buy my book, 'My Horizontal Life: A Collection of One Night Stands'\"..."},{"comment_id":"10153366619543635","commenter_b":"Nope. I thought you knew better than that.","commenter_a":"Quran (3:56) - \"As to those who reject faith, I will punish them with terrible agony in this world and in the Hereafter, nor will they have anyone to help.\"","post_message":"Hillary Clinton: 'Muslims Have Nothing to Do With Terrorism'"},{"comment_id":"10154302766323543","commenter_b":"@username The problem in California is that now illegals have driver's licenses and with that, they were simultaneously, automatically REGISTERED to VOTE as well. Thank to Jerry Brown. We in California are also overrun with Sanctuary Cities and BROKE due to these idiotic, liberal politicians!","commenter_a":"Regardless of the number, I am strongly in favor of requiring IDs for voting. NO ONE should be allowed to vote if they don't have the legal right to do so.","post_message":"Hillary Clinton garnered more than 800,000 votes from noncitizens on Nov. 8, an approximation far short of Donald J. Trump estimate of up to 5 million illegal voters but supportive of his charges of fraud. - via The Washington Times"}]
