[{"comment_id":"10154012875581523","commenter_b":"Dawn did you see this mother fucker?","commenter_a":"Such a thug","post_message":"Was an Alabama man pushed to apologize because of public outrage over a social media post?  It sure seems that way."},{"comment_id":"939606616115567","commenter_b":"Slaves to Islamic vermin. not MEN","commenter_a":"Sharia and Islam are only good for Muslim Males ................Males get all the advantages............... BUT .women, children, gays, Christians , Buddhists, Jews, Hindu and anyother religion not \"their \" brand of Islam will be punished , raped , enslaved , or killed . Women of the world wake up and see this truth . Fight for freedom .Women Fight for your life....Women you can be more than slaves to men ........","post_message":"They're just sweet refugees', they said. 'Who just want a better life', they said. Welcome, and then .... German girls... cover up... so you don't get raped by the 'refugees'?"},{"comment_id":"10154617717319255","commenter_b":"\"...ignorant and moronic assumption...\" \"...liberal mindset of free everything...\" I'll just leave that there where it belongs.","commenter_a":"I am a conservative who volunteers for children's charities, doesn't care if same sex couples marry, is pro-choice, owns a hand gun but doesn't believe any private citizen needs an Uzi, am a military spouse so obviously vehemently support our military (active and retired) and work in the public school system and believe those who work hard and succeed in high school deserve a break in college tuition. I'm sorry I don't fit in to your ignorant and moronic assumption that all conservatives are alike.","post_message":"Pretty much.   Thanks to Northern Michigan Progressives for sharing."},{"comment_id":"1368961776496629","commenter_b":"Obviously yours is up ur boyfriends ass you homo!","commenter_a":"IF YOU ONLY REPORTED REAL NEWS! ! ! !","post_message":"This scandal is only getting worse."},{"comment_id":"10156005617690725","commenter_b":"Loved Trump's speech!","commenter_a":"What's your thoughts on the confederate flag or the MS state flag, Mr Trump?","post_message":"#MakeAmericaGreatAgain #TrumpRallyAL"},{"comment_id":"1792270164372790","commenter_b":"She's an old nasty hag!","commenter_a":"Not worth it!","post_message":"SAY WHAT?"},{"comment_id":"10153279327706973","commenter_b":"Your saying this restaurant chain is hateful and kills animals when dozens of others do exactly the same thing? You do know that cows and fish are animals and killed in order to make the food you find at McDonald's, Burger King, Wendy's, Arby's, Subway, Taco Bell, Panda Express, Red Robin, Dennys, IHOP, etc. right?","commenter_a":"Don't do it! They're a little too conservative for our area. Do people really want to support a company that not-so-secretly opposes equal rights (not to mention the whole killing of animals thing...)? @webpagelink","post_message":"The fast-food chain is looking to to add one or two restaurants a year until there are 10 to 12 locations in the greater Portland area."}]
