[{"comment_id":"10152538895247014","commenter_b":"Suck his dick already","commenter_a":"I bet his pay didn't get any cuts","post_message":"In his state budget proposal, Gov. Doug Ducey announced some big cuts to the state's universities. Now, the Board of Regents responds."},{"comment_id":"10153544587506350","commenter_b":"Real women dont need all that! They are content with the gift of life they just grew in their body for months!!!! This is a little overkill.","commenter_a":"Oh good grief...isn't the baby enough to show off? Must one be materialistic to have to have a push ring?","post_message":"Push presents (the bling or gift an expectant mom is given for, um, pushing) are getting more and more popular."},{"comment_id":"10153134474569369","commenter_b":"@username so then bill Russell should be the greatest to ever play if where talking about rings you idiot SMH it's not about the rings stupid head","commenter_a":"M. J. Loyal to his team.","post_message":"It's one of the big sporting questions of our time."},{"comment_id":"1729302324008318","commenter_b":"@username like your sister & her boyfriend helped rape your niece!!!!","commenter_a":"If the kid is dumb enough to Climb into a gorilla pen, and the mother is dumb enough not to pay attention to a kid climbing into a gorilla pen.....then by all means that gorilla should have ripped the little kids head off, at least the gorilla would have had a better reason to get shot and killed","post_message":"After the Cincinnati Zoo gorilla incident, some want a sort of leash law for children. Your thoughts? Via CNN Opinion"},{"comment_id":"10155752220095603","commenter_b":"Black lives must not matter too much, stupid idiots cannot stop killing each other.","commenter_a":"Tired of all this carp. Can we get along for a change.","post_message":""},{"comment_id":"10153227343366770","commenter_b":"Oh them dumb white people they so racist! Sarc","commenter_a":"She looked so stupid. She clearly made a dumb open statement that wasn't true. Obama told her...it didn't stop her from getting a gun. Brain washed White people. You White Republicans vowed a sworn oath to not give anything to Obama before he took office. A sworn oath. Racist haters. A sworn oath. So don't blame the Black guy You hated and conspired before he took office to hate him. Now you act like you don't understand why he used Executive Orders. Dumb racist White supremist. Shes a NRA crash dummy. Wow....Whites really got no common Sense. Natural born Black haters. Trying to make her a hero...SHE SAID NOTHING NUT GOT SHUT DOWN BY OBAMA FOR QUOTING WHITE MEN AROUND HER. LOL. OBAMA GOT THE LAST WORD.","post_message":"Taya Kyle, the widowed wife of Navy SEAL Chris Kyle confronted Barack Obama Thursday at a CNN town hall event on guns Thursday night."},{"comment_id":"1100419663375801","commenter_b":"HUMMM correct me if I am wrong, but I believe Hillary sold russia 20 % of our uranium, why would she do that.","commenter_a":"Trump is a Liar, a Cheat and Putin adoring Traitor to his country but, he wants to make America White Again and that's all his supporters care about. He played the Race Purity Card and they said Deal Me In! Since then, nothing has changed their minds and nothing will. He's as corrupt as any politician we've ever seen and they just don't care, because they are just like him. They live their lives without a moral code.","post_message":"Chris Matthews: \"Birtherism is not, has not been, a theory; it has been an insistence of some sort of racial test.\" More from Hardball with Chris Matthews: @webpagelink"}]
