[{"comment_id":"10153576265156336","commenter_b":"Suck it up, buttercup.","commenter_a":"Wonder if this clown avoids baseball games","post_message":"Lambert’s Café is known as “Home of the Throwed Roll,” where servers at the restaurant are known for tossing the rolls to customers."},{"comment_id":"991707680869704","commenter_b":"Sorry ladies - simply not a fan and not willing to jump on her bandwagon because she seems to be the only female who's interested and has the ability to pursue it.","commenter_a":"Wouldn't vote for her if you paid me.","post_message":"If Republicans want to wage a war on women, they'll have to go through Hillary first."},{"comment_id":"557200064439948","commenter_b":"I think Donald Trump was building a wall for the excess humans.","commenter_a":"okay so you are planning to eliminate mosquitoes .. do u have any plan what you guys are going to do with the hundreds and thousands of excess humans?","post_message":"\"Eliminating mosquitoes could leave predators without prey.\""},{"comment_id":"10153975283176336","commenter_b":"Nothing will happen with her, its just a power game","commenter_a":"She disgusted me and betrayed all women who've suffered mistreatment at the hands of their men when she went back to that crumb of a husband of hers...they deserve each other!","post_message":"Earlier on 'America's Newsroom,' Fox News contributor Katie Pavlich said Hillary Clinton must answer for her role in former President Bill Clinton's scandals. What do you think? @webpagelink"},{"comment_id":"10154726386446729","commenter_b":"Evil witch!","commenter_a":"Sonny Blaze, happy Sunday","post_message":"But yeah, she's supposed to be a role model."},{"comment_id":"10153985264843984","commenter_b":"She is hot","commenter_a":"You go girl","post_message":"Fox News superstar Andrea Tantaros just hit Instagram with an awesome selfie.  She's pretty, but it's the t-shirt that makes the pic amazing."},{"comment_id":"10153316215802377","commenter_b":"\"We're\" what has he got to be mad about - he's part of the problem.","commenter_a":"I'm glad he didn't get it for president.","post_message":"\"Certainly part of what is behind the energy and the passion for Donald Trump on the Republican side and [Vermont Sen.] Bernie Sanders on the Democratic side is the frustration and anger people feel in this country,\" Mitt Romney said."}]
