[{"comment_id":"737825183044101","commenter_b":"I would let a refugee stay in my house.","commenter_a":"I thought all of you on the left were going to let them move into your houses","post_message":"Several refugees have lost fingers and hands from walking in sub-zero temperatures."},{"comment_id":"1061817873839223","commenter_b":"Insofar as the Hadron Collider is european, how would that help the US government?","commenter_a":"I hope 1.3 trillion dollars, since the U.S government can't seem to find it.","post_message":"What could we find?"},{"comment_id":"10153563776309170","commenter_b":"Oblowme you are such a disgusting pussy!!!!!!","commenter_a":"Of course he does. Anyone surprised?!?","post_message":"Remember: Nothing is ever his fault. The buck, without fail, stops somewhere else."},{"comment_id":"606686526157968","commenter_b":"@username I'm coming to rape and murder ur whole family","commenter_a":"Why not use that time, money, and tech to sniff out cancer, instead of destroying addicts lives by throwing them in a cell with rapists and murders?","post_message":"It's so powerful, it had to be calibrated in the pristine air of Antarctica — one of the few places in the world where it would read true zero."},{"comment_id":"10153820494546350","commenter_b":"i see Kate in her lol and Will in George","commenter_a":"Princess Charlotte looks like her daddy, adorable.","post_message":"Princess Charlotte has grown so much in six months! We just can't handle the royal cuteness! on.today.com/1IrSwdd"},{"comment_id":"10153904847648128","commenter_b":"100% true","commenter_a":"Miss Colombia says: happens for a reason. Now Steve Harvey, Miss Colombia, and Miss Philippines are more famous than if the crowning had been flub-free.","post_message":"This year's Miss Universe is Miss Philippines, Pia Alonzo Wurtzbach, but host Steve Harvey initially announced the runner-up, Miss Colombia, as the winner."},{"comment_id":"10153942859244024","commenter_b":"Let's ban YOU !","commenter_a":"Disgraceful","post_message":"He supposedly got \"PTSD\" from shooting an AR-15 and now wants to ban \"God Bless America\" from baseball games. @webpagelink"}]
