[{"comment_id":"1058499540933711","commenter_b":"@username ... You love those liars, don't you.","commenter_a":"Women, would you want your children to have Trump as their Teacher? Their Minister? How about as your kids Father? if you said no to any of those, then you don't want Trump as your president either.","post_message":"“And when you’re a star they let you do it,” Trump says. “Grab them by the p---y. You can do anything.”"},{"comment_id":"10158070336085231","commenter_b":"There is no Muslim Ban. Ban is against potential terrorists not against Muslims.","commenter_a":"This is what discrimination looks like to the Black's, sorry to see another people of color experience this!","post_message":"The American people are putting their money where their mouth's are."},{"comment_id":"852525808271329","commenter_b":"Fire the bitch","commenter_a":"not good","post_message":"She refused to hang his coat, but true patriots stepped in. This is how all of our vets, and active duty should be treated. Can we get 3,000 'LIKES' for our vets?"},{"comment_id":"368323690022592","commenter_b":"Who is this woman","commenter_a":"She is political posturing... Wants to be first Female President. (Well first elected. Hillery was first. Michelle ib second Unelected)","post_message":"Good God, Mr. President, we were once known as the leader of the free world, standing for what is right! You must not let America’s sacrifices be in vain. When will you learn that actions speak louder than your words?”"},{"comment_id":"900278129995043","commenter_b":"No","commenter_a":"They're great to look at and their love is cute and all but not sure if their personalities would work for a talk show. Maybe a dating game show would work better.","post_message":"Would You Watch? Boris Kodjoe And Nicole Ari Parker Get Their Own Talk Show On Fox"},{"comment_id":"1350025431679743","commenter_b":"Lmaoo thats why i say i cant be no girl","commenter_a":"See Babe Its Not Easy Being A Girl @username","post_message":"Women shouldn't have to spend a fortune on bras. Like ATTN: on Facebook."},{"comment_id":"10153517803776157","commenter_b":"Hmmm,,, just a little chance of rain Victoria Marshall? Need some rain in San Benito!! :))","commenter_a":"Light","post_message":"Meteorologist Victoria Marshall CBS 4 News is tracking the heat and the chance for rain in your forecast below:"}]
