[{"comment_id":"1783100141966543","commenter_b":"We should build a wall at the California line and put all the liberals in it...","commenter_a":"Wutttt ?????","post_message":"Game of Thrones actress Sophie Turner (Sansa Stark) attacked Trump saying that if she could fix the world, she would kick him \"out of the country. And we’d create a wall around him so he couldn’t escape.”"},{"comment_id":"10153201571853812","commenter_b":"Hes a witch!","commenter_a":"Ahmed Shannon Nathan Jake Conrad Robert Ya Ron Ronaldo","post_message":"WATCH: In Portland, Maine, it is cold. Very cold. THIS cold. -- [ VIDEO: Portland Police Department] - ABC News Weather"},{"comment_id":"10153882814429916","commenter_b":"You can tell she loves BREAD, not that she's inbred.","commenter_a":"Well just look at her, you can tell, she is inbred.","post_message":""},{"comment_id":"10152950745681717","commenter_b":"Just like allowing women turned it into a coffee klatsch, eh, Huck? With each passing day, Republicans make the USA more of a laughing stock and pariah state. If we didn't have this economy, we'd be treated like North Korea.","commenter_a":"What does he know about the US Military? He never served in it.","post_message":""},{"comment_id":"10153542094851509","commenter_b":"@username wow your German? That sucks Germans can't reproduce, their birthrate is below 0% by 2060 there will be more muslims in Germany than Germans. LMBAO enjoy your day.","commenter_a":"Oh yet another white on black crime receiving national.media coverage. Way to keep the racial divide strong. But i am glad to see some justice is being served.","post_message":"Demonstrators have flocked to North Charleston City Hall to protest the shooting death of Walter Scott. The following report contains graphic content. Viewer discretion is advised: @webpagelink"},{"comment_id":"1062158903821449","commenter_b":"And your a scrub. And Beyonce don't want no scrubs.","commenter_a":"Don't be scared of a bunch of freaking thugs, Beyonce is a thug herself .","post_message":"Tomi Lahren doubles down."},{"comment_id":"10152670187577483","commenter_b":"Or two women","commenter_a":"All of you people that back same sex marriage wouldn't even exist on this Earth right now if it wasn't for a man and woman making you like GOD intended for it to be. Just think if all of yalls parents would've been gay yall would have never existed.","post_message":"If you're trying to get married, check out this map before you go to the courthouse. The majority of counties have either suspended the issuance of all marriage licenses or are only accepting applications."}]
