[{"comment_id":"532937326855044","commenter_b":"She takes no responsibility. She whores and takes no responsibility because it is his fault. Logic?","commenter_a":"A Hole..step up to the plate and accept your responsibility!!","post_message":"What a piece of sh*t   | Liz"},{"comment_id":"10153389397913352","commenter_b":"This women is a rachett ass lier! What a waste of space on my news feed, ya girl aint tellin the truth boo","commenter_a":"So weed paralyzes now sheesh isn't this story bullshit hahahah lmfao weed cures not kills or 'paralyzes'","post_message":"Mother says her daughter, 17, has been left PARALYZED by a pot brownie she bought from a classmate at high school"},{"comment_id":"10153277362054170","commenter_b":"she is such STUPID IDIOT","commenter_a":"Her strategy, which has worked in the past, is to blame everything as due to 'Right-wing extremists' and denounce reports of her past as 'old news.' The liberal press will support her.","post_message":"Well, the much-awaited Hillary announcement video is out, and we've got it here. If you can find a rationale for a Hillary presidency anywhere in it, by all means let us know. We couldn't."},{"comment_id":"10153448214053984","commenter_b":"That lady has a problem nice in front of kids","commenter_a":"He was absolutely right in what he did. People like her should be called out. They have no respect for any rules, they think they don't apply to them.","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"679207482232542","commenter_b":"Criminal woman Brave !!","commenter_a":"Hillary is so brave for being a woman!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153440624016680","commenter_b":"'@username KILLERY LOVER<< YOUR SICK GO LIVE IN CANADA YOU LIBERAL IDIOT>>","commenter_a":"Donald Trump all the Way to the White House,,Heck with all the Haters and the Crooked Sander Backers,, and the ones that Love Hilary yea way to Support her a Criminal That Killed 4 American Servicemen,, she should be in prison,!!!!!!!!!!!!!!","post_message":"Donald J. Trump: Michelle Fields grabbed me."},{"comment_id":"10153480074973352","commenter_b":"She need the death penalty","commenter_a":"PROTECTED CUSTODY CAUSE YOUR ASS IS GRASSED BABY KILLER .","post_message":"Mother who drugged her two-year-old daughter and suffocated her because she was worried her ex's new girlfriends would take her place is jailed for 37 years"}]
