[{"comment_id":"1740170942902081","commenter_b":"Yeah! Say that to UN! They should go to thoses places rather than bothering Philippines!","commenter_a":"Philippine leader must have nothing better to do... He just want to become famous for a little bit...Do you want to see humans right violations every day? Do you want to see people getting kill by the government? Do you really want to help people because humans right violations?? Go to Cuba!!! Go to Venezuela!!!!!move to Central America!!!! You idiot!!!","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"1151245754895453","commenter_b":"Please like this page and visit this online clothing store and check the available stock. For all kind of Master replica and other beautiful stuff join us here. @webpagelink @webpagelink","commenter_a":"LOVE!!","post_message":"This 12-year-old boy — with no books and no money to get to the library — wanted to read so badly, he read junk mail. That was until his postman and the Internet stepped up to get him some books."},{"comment_id":"10154326925529586","commenter_b":"The same thing happened to me! A few neighbors found it funny to toss their firecrackers over the fence during some lunch party. We came home to find our poor baby scratched up and shaking - stuck between a rose bush and fence. Horrible horrible how lightly some people take this!","commenter_a":"I used to love July 4th until someone decided to throw firecrackers in the yard with my dog. She passed her fears on and my dogs are so afraid they huddle against me and shake. I dare not leave my home out of concern for what my pets go through.","post_message":"URGENT: Your dogs & cats can be TERRIFIED of fireworks. Keep them safe this #FourthOfJuly."},{"comment_id":"10153180250311051","commenter_b":"Bitch","commenter_a":"matt bac she couldnt control her husband, the whole usa wtf","post_message":"Here's what Hillary Clinton had to say about her State Department e-mail scandal. Simple question: Do you think she'll be the next President of the United States?"},{"comment_id":"10153406887426955","commenter_b":"Can't wait until someone drops a house on Hilary.","commenter_a":"I'm no detective, but my guess would be Hillary, I mean the wicked witch of the east.","post_message":"WHO STOLE DOROTHY'S SLIPPERS?"},{"comment_id":"10152708840057014","commenter_b":"The only ones wanting her are the freebie seekers. And the ILLEGALS !!!!!!!!","commenter_a":"Absolutely. Sorry to the GOP because all of their candidates are LOSERS","post_message":"Would you consider voting for Hillary for President?"},{"comment_id":"1688508021436310","commenter_b":"FIRE HER!!! She is a THUG!!!! DISGUSTING!!!!!!","commenter_a":"Fire her sorry hamburger flipping butt!","post_message":"This girl belongs in jail."}]
