[{"comment_id":"10153894447031130","commenter_b":"I'm sure that's very concerning to her. News flash: women aren't interested in your opinion of them.","commenter_a":"She is not attractive or funny to me at all.","post_message":"And Amy Schumer looks fab, of course."},{"comment_id":"10153470522401545","commenter_b":"I totally agree. It won't happen because it generates big money. A bunch of sick people","commenter_a":"And Porn is still accepted & allowed in our country & world ?!?! Porn is a horrible addiction causing harm to others. I want our elected officials to get porn out of our lives forever !","post_message":"In police documents obtained by WFAA, school bus driver Leonard Bradford told investigators he swam in a public pool with 40 to 60 children in the summers of 2014 and 2015. According to police, Bradford admitted to investigators that he purposefully rubbed his genitals on five girls."},{"comment_id":"1080515501999587","commenter_b":"Not going to stoop to your low, Rebio.","commenter_a":"Sounds like Rubio is gay. Wants to be in the bohemian group. Where all the rich billionaire and American leaders go and have a gay feast and worship something called mule. No woman are allowed.","post_message":"He went there..."},{"comment_id":"537911889728124","commenter_b":"Public service would be great; picking up road trash; working in the parks; finding real jobs and repaying money bilked from you and me. OR, whatever; probably don't need to put them in already over-crowded prisons; make them work, not get free room and board in jail.","commenter_a":"Yes indeed","post_message":"It's about time! Do you think all welfare abusers should be arrested?"},{"comment_id":"388258684695759","commenter_b":"We all need to ban to gather and kick all Muslims out of this country they have no say so in this country if they want say so they need to go back to their own country this is United States of America not Mohammed country","commenter_a":"You damn right. All states should do this","post_message":"It's time that all the states do the same..."},{"comment_id":"10153727750436336","commenter_b":"You do realize that without spiders the world would be overrun with bugs which do a lot of damage to the earth if not contained","commenter_a":"This happened to me before when I was a kid, I was riding my bike branch hit me by my ear. Felt something weird went to the bathroom spider came out half way to say \"hi\" then went back in when I screamed for mommy. Went to the doctors then I lay down and the spider came out itself! And yes I killed it with my bare hands!!","post_message":"Each attempt doctors made to remove the spider caused it to react violently, but they eventually were able to subdue the insect with medicine and pull it out with tweezers."},{"comment_id":"10155009435559910","commenter_b":"Andre Lopez illegal immigrants can't vote. That's a lie","commenter_a":"lollllll \"won by a large electoral college vote\" he CANNOT let it go that he is the BIGGEST LOSER OF THE POPULAR VOTE EVER.","post_message":"WATCH LIVE: President Trump and Canadian PM Justin Trudeau hold a joint press conference."}]
