[{"comment_id":"10153264300638433","commenter_b":"Ladies, please, you're both pretty.","commenter_a":"Hillary would say: what difference does it make!!","post_message":"We look at what readers have to say about our fact-checks of Hillary Rodham Clinton. What do you think? @webpagelink"},{"comment_id":"10153311857346323","commenter_b":"It's an attempt at humour, not political analysis. Lighten up.","commenter_a":"Guardian is now as bad as the Daily Mail , completely biased with dumb pointless analysis , just left versus right , I used to appreciate the Guardian but sadly it has lost its way","post_message":"Bill Brewster: \"The Milibands have arrived just in time for Ibiza's season opening parties, but there are plenty of issues on which they could campaign in Ibiza. There are the young workers on zero-hour contracts who flyer the beaches, often working on a basic of €50 per week. Then there’s the scandalous prices of the leading clubs, or the police, often accused of corruption and being heavy-handed. Mind you, after the campaign he’s just had, if I were him, I’d kick back the slingbacks and hit the horse drugs.\""},{"comment_id":"1028894700543062","commenter_b":"Is that a slit in her dress up to her you know what? Inappropriate for the First Lady. Not running for first slut!","commenter_a":"Moochie, it's gonna take more than $12000.00 to make you the Lady of Camelot.","post_message":"Woman of the People"},{"comment_id":"10153904523824705","commenter_b":"ask your \"celebrity\" wife to hand over some cash","commenter_a":"Boohoo rich boy! Would he have helped me out of my problems?","post_message":"#SaveKanye"},{"comment_id":"10154111897691813","commenter_b":"Do illegal aliens have constitutional rights?","commenter_a":"Good to know. But I was told one time, Border Patrol agents can effect a search of your vehicle WITHOUT a warrant, and up to 12 miles from an international border.","post_message":"ICE is targeting families who have fled some of the world’s deadliest countries – escaping persecution and uncontrolled domestic and gang violence. Know your rights.  More information at: @webpagelink"},{"comment_id":"1044606575560353","commenter_b":"Bwabhhhaaahhhhaaaaa.:O On 24/02/2015 1:30 AM, \"Facebook\" <","commenter_a":"Does category number 11 include parents?","post_message":"Who drinks the most coffee?  Image by I Love Coffee via AsapSCIENCE."},{"comment_id":"10153310022881051","commenter_b":"Why is this vermin still alive?","commenter_a":"Blow him off the face of this Gods earth!","post_message":"Al Qaeda's leader just called for a 'lone wolf' terror attack on the United States - and that's not even the worst thing he said. (via VICE News)"}]
