[{"comment_id":"1452044741482218","commenter_b":"You need to put down your crack pipe that crap has fried your brain; dumb witch","commenter_a":"Democrats r a bunch if liars ..republicans are honest and classy","post_message":"'I knew Ronald Reagan. I worked for Ronald Reagan. Donald Trump, you are no Ronald Reagan.'  -Republican Doug Elmets says he's voting for a Democrat for the first time in 40 years.  More: @webpagelink"},{"comment_id":"870850106350450","commenter_b":"She's desparate and we already know that she'll say anything to get a vote. I wouldn't be mad if she stroked out.","commenter_a":"Yeah ok","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153032098202483","commenter_b":"The same move is taught in the military to subdue someone not to injure them.","commenter_a":"The officer gave him an order it was not obeyed. Act first and ask questions later. If you wait to see if he has a weapon you end up shot.","post_message":"Have you seen the entire video?  Do you think it should be shown in court?"},{"comment_id":"10153492553852869","commenter_b":"Nope!","commenter_a":"Amen thanks to Obama. He rewarded themg for 9 11","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153666245398984","commenter_b":"All this just so the Dems can have more illegals to for for them....Could Trump be more dead on?","commenter_a":"Thank Obama for all these murders, he is the one responsible for letting thdm in the country!!!","post_message":"This is a horribly tragic story, especially since it involves an illegal who should never have been in this country. Please join us in sending thoughts and prayers to the families of the victims.  Are you against amnesty for illegals?"},{"comment_id":"1116798981710579","commenter_b":"She's feeding her baby. Shut the fuck up and move on","commenter_a":"Well it isn't racey,it's natural. This is ridiculous people need to approve of the way babies were intended to eat and get over it. When they do mom's will stop plastering feeding photos all over the internet.","post_message":"An interesting discourse here about nursing in public. What are your thoughts?"},{"comment_id":"10153178385132061","commenter_b":"Cheesy come back. You dumb blond.","commenter_a":"She's beautiful. I hope she still likes boys. Maybe she's transgender. Not that I care lol","post_message":"'She's not a girl playing football; she's a football player that's a girl. She plays the game hard, she plays the game tough.' Meet the teen who was only girl, and a co-captain, on her football team: @webpagelink"}]
