[{"comment_id":"10154654618245575","commenter_b":"@username are you by chance a Libetard? from cali ?","commenter_a":"The President to be mocks the loser that's really Presidential.","post_message":"TRUMP MOCKS HILLARY ON HER CANCELLED FIREWORKS SHOW! ---VIDEO"},{"comment_id":"437504329786414","commenter_b":"pinocchio wants guns taken from the citizens so we won't be able to defend ourselves against his \"refugee military\".","commenter_a":"Maybe that's why Obama wants stricter gun laws, after all isn't he always on the side of the criminals?","post_message":"Gun Bans are Ridiculous www.eaglerising.com"},{"comment_id":"1745739655705616","commenter_b":"The university should be pledging NOTHING for illegals! They are criminals. The university should be prosecuted for aiding and abetting crime!","commenter_a":"If anything, this should all be used for American students. They should be the first to receive help not illegals. This is wrong.","post_message":"University of California students criticised a university pledge of $25 million over 3 years to assisting illegal immigrant students as “not enough.”"},{"comment_id":"10152712712566545","commenter_b":"That was a WOMAN.","commenter_a":"That lady in the van just opened a can of Whoopass","post_message":"Here's the incredible ending to a nerve-wracking chase in Dallas County. We'll have the latest on News 8 at 4.  TO WATCH/READ MORE: @webpagelink"},{"comment_id":"536936909817584","commenter_b":"both plans are BS","commenter_a":"Interesting. Makes sense though. Someone has to pay for all the freeloaders and the Crap that the Dems promise them.","post_message":"Here's how much your taxes could decrease under Donald J. Trump and rise under Bernie Sanders. @webpagelink"},{"comment_id":"127969217779704","commenter_b":"@username go away criminal","commenter_a":"Great job police and K9. POS got what he deserved. Just hope the dog doesn't get any disease from the scumbag!!","post_message":"A police dog takes a big bite out of crime, subduing a carjacking suspect involved in a high-speed chase and spectacular injury crash.  Eyewitnesses capture the drama on camera as the suspect tries to flee. Eyewitness News live with the condition of the innocent driver injured in the La Puente crash. Tonight at 11 from ABC7. abc7.com/@username/"},{"comment_id":"10153580191021438","commenter_b":"You folks just restored my faith in humanity","commenter_a":"If I didn't live on exactly the opposite side of the USA (SC!) I'd totally be holding a sign up there with her.","post_message":"“I knelt down to a protester's kid and said, ‘Do you know about yeast infections?’”"}]
