[{"comment_id":"1448117561874659","commenter_b":"They generally don't prohibit it but they train the employees to give the robbers the money because the owners have insurance for that.","commenter_a":"Looks like 30 people who should have been able to defend themselves and their businesses.","post_message":"A trio of armed teenagers is now accused of more than 30 robberies across King and Pierce counties."},{"comment_id":"10153304939531350","commenter_b":"He's a combo look of Chandler from \"Friends\" and her ex-husband","commenter_a":"Courtney Cox marrying band member Johnny McDaid from Snow Patrol. My favorite \"Friends\" and my favorite band!","post_message":"\"She wants to be the flower girl, all the bridesmaids. She's very excited about it.\"  CC: The Ellen DeGeneres Show"},{"comment_id":"10154394358144062","commenter_b":"I don't trust these hoes","commenter_a":"\"According to the police report, Crowley was intoxicated and made inconsistent statements about Manziel's actions. \" Dem hoes!","post_message":"Johnny Manziel could face NFL discipline for Ohio incident..."},{"comment_id":"10153259534778145","commenter_b":"Hehe","commenter_a":"Happiest place on earth!!!!!!","post_message":"EPCOT BRAWL: Looks like these Disney guests weren't exactly having a blast at the happiest place on Earth. Three women were recorded having a full-fledged fistfight while waiting in line at the Test Track at Epcot. Watch the full video: @webpagelink"},{"comment_id":"769546029761706","commenter_b":"karmas a bitch","commenter_a":"Tolerance! Take their Allah and Mohammed, tear up and urinate on it. Then we will talk tolerance.","post_message":"Italy: Muslims Destroy and Urinate on Virgin Mary Statue   @webpagelink"},{"comment_id":"822624721167115","commenter_b":"The U S citizens land it crosses and Native Americans land it crosses should have the last word on this. Not some politician, or Lobbyist or any one who will make money off it. It looks to me that the land owners don't want it. VETO< VETO< VETO.","commenter_a":"Woot!","post_message":"A defiant GOP votes to fast-track Keystone."},{"comment_id":"10152995356441130","commenter_b":"some women think they'll be liked more (by men) if they act this way!!!! cause...ain't no way a woman believes this...EVER!!!","commenter_a":"CEO of the Dumbass Corp","post_message":"What the..."}]
