[{"comment_id":"1212113488867185","commenter_b":"Why is it that the LIBERALS are the one who ALWAYS scream the loudest whenever Voter I.D. is even mentioned let along being considered?","commenter_a":"DESPERATE DEMOCRATS KNOW THEY CANNOT WIN FAIR AND SQUARE, THEY RESORT TO UNDERHANDED AND DEMORALIZING TACTICS!!","post_message":"Libs everywhere were thrilled when Texas' voter ID law was struck down by the courts, which ruled it it was too restrictive. That's when they read the fine print, though...  All of a sudden, liberal jubilation turned to rage and tears."},{"comment_id":"1361756670528336","commenter_b":"Vengeance is mine saith the Lord.","commenter_a":"Disgusting and low class","post_message":"More tolerance from our friends on the left."},{"comment_id":"1753315408263301","commenter_b":"When u ugly as Fuck but because of your money u can fuck whatever hot girl you want! 😒😒😒","commenter_a":"😧we have become the laugh Hurd around the world..","post_message":"Nothing wrong with nude modeling, but could you imagine how they would scream if Michelle Obama had done this? Hypocrites..."},{"comment_id":"990097811101554","commenter_b":"That looks disgusting 😱","commenter_a":"@username BONG","post_message":"Not all heroes wear capes. 🍔+🌭"},{"comment_id":"10155302418745579","commenter_b":"lady, you need medication.","commenter_a":"My Grade for President Trump A-. Will go up to an A++ when those planted by the last administration to attempt a political coup are removed. My grade for Congress D- will go up when BOTH party's stop trying to slow down the executive branch and start working for the people .","post_message":"GOP Only: Your Grade of Pres. Trump & Congress?"},{"comment_id":"791848880944157","commenter_b":"The entire so called debate is a joke as always .FEAR CARD PLAYING BIG TIME .....VOTE BERNIE VOTE BLUE GIVE YOURSELF A CHANCE","commenter_a":"I feel like they act like they want to think of us but yet foot in mouth with trump!!","post_message":"Donald J. Trump is a chaos candidate, and he'd be a chaos president. #chaospresident"},{"comment_id":"418283194962942","commenter_b":"They are all criminals, that why they call them Illegals.","commenter_a":"So you want to prioritize sending back students & children before the criminals. I see.","post_message":"This Texas judge is boldly standing up to the White House. Should more follow his lead?"}]
