[{"comment_id":"952520861503939","commenter_b":"We need to send in a drone and level the place. I will be tainted now and need to be rebuilt anyway.","commenter_a":"Operation White Privilege hasn't had an accidental firearms discharge yet. That has to be some kind of record.","post_message":"Do you not want the government to 'Waco' you? Because this is how you get the government to 'Waco' you."},{"comment_id":"10153671007817452","commenter_b":"@username if ur really going to have a discussion please don't start with \"then how is it that...\" When you focus on the trees rather than the forest, ur def lost. If you haven't done research on average income, crimes by income, distribution of resources to low income, then this is above your level of comprehension. Start with census and BJS","commenter_a":"“If Black Lives Matter was truly concerned about black lives, they’d be concerned about black crime.”","post_message":"From Atlanta to Phoenix, to right here in L.A., protests are growing across the nation after this week's deadly officer-involved shootings. But not everyone is happy that protesters have hit the streets less than 24 hours after the Dallas bloodbath that left 5 police officers dead and 7 others wounded. Tonight the tense scenes from coast to coast - at 11 from ABC7 Eyewitness News. @webpagelink"},{"comment_id":"10154222477216717","commenter_b":"I want her and trump dropped in the middle of Aleppo ASAP.","commenter_a":"What swamp did this creature slime her way out of!!!' I wish she would slither back in!!'","post_message":"Trump advisor Kellyanne Conway also said that detained Muslim travelers would be \"disposed of\" on a case-by-case basis."},{"comment_id":"915559728526390","commenter_b":"Go f u co.yourself you ugly bitch","commenter_a":"I thought this might be a joke till I opened up and read more. This is absurd. I'm just saying","post_message":"Obama just announced that he is issuing you a new Muslim holiday that you must celebrate. This is ridiculous. He can't make us do anything. Will you refuse to celebrate this holiday?"},{"comment_id":"999021020109368","commenter_b":"This is legislature that should ONLY be debated and decided BY WOMEN!!","commenter_a":"mayam merouane ok @username","post_message":"What a brave woman"},{"comment_id":"508999315933206","commenter_b":"Well done Doc! I too wish you had more airtime, but we that follow you know!","commenter_a":"You are my 2nd favorite candate running. Would be 1st if not for you shaking hands and smiling with Al, Sharpton! Al Sharton!!!' What good can he possibly do for you?!!!!","post_message":"A leader listens when the American people speak. Unfortunately, our stage was filled with plenty of rhetoric and shouting politicians. I want We the People to know I hear you. Although I didn’t have much time to share my common sense solutions with you on stage, I look forward to continuing my clear, concise vision with the American people as I did tonight. Even more, it’s clear that the people were listening – we gained over 100,000 friends and patriots on Facebook during the debate. I am humbled by our over 400,000 Twitter followers that made us the Most Mentioned candidate on Twitter during the debate. We the People are fighting for freedom, and tonight is proof that the American people are winning."},{"comment_id":"10153259534778145","commenter_b":"Hehe","commenter_a":"Happiest place on earth!!!!!!","post_message":"EPCOT BRAWL: Looks like these Disney guests weren't exactly having a blast at the happiest place on Earth. Three women were recorded having a full-fledged fistfight while waiting in line at the Test Track at Epcot. Watch the full video: @webpagelink"}]
