[{"comment_id":"2130174917081223","commenter_b":"He is better off with out the old hag!","commenter_a":"Hell of a man","post_message":""},{"comment_id":"483171531871140","commenter_b":"Amen","commenter_a":"Ya, Right. would never believe this bullshit!","post_message":"Shocking!"},{"comment_id":"1415750351836830","commenter_b":"She was with the head writer of SNL and the woman who plays her on SNL skits. They All suck!!!","commenter_a":"id bet they were laughing at each other because they couldn't decide who was SKANKIEST.....","post_message":"Hillary raised a lot of eyebrows with her dinner guest..."},{"comment_id":"1455415254518218","commenter_b":"Define \"innocent\", please. Then I will explain to you the meaning of \"idiot\"","commenter_a":"The problem is that the conservative corporate controlled media has turned the conversation away from the police killing unarmed innocent citizens to this nonsense about kaepernick not standing. Where is the outrage against the police killing hundreds of innocent people?","post_message":"Megan Rapinoe said it was an intentional move to support 49ers' Colin Kaepernick"},{"comment_id":"10153179690136523","commenter_b":"So that one example involving you makes you come to the idea that lots of females lie..? And the proper way to handle that situation would be to go to the authorities and let them deal with it.","commenter_a":"Lots of girls lie about that stuff it happened to one of me old friends the bitch said he raped her be he really didn't there's lots of girls out there that's are like that","post_message":"19-year-old Owen Labrie, a former student at the elite St. Paul's School, appeared shaken as the verdict was read, at one point nodding his head and reaching for a tissue to wipe tears. At the time of the assault, the accuser was 15 and Labrie was an 18-year-old senior."},{"comment_id":"10154376323356509","commenter_b":"Screw this Stepford wife!","commenter_a":"I had expected @username to declare Hillary Clinton the winner of this State of the Union but to my surprise @username has decided to no longer boycot Bernie Sanders. Wolf Blitzer called him \"a new face\" and very underestimated by the general public. Yes Wolf, he is a new face on @username and he was underestimated by @username but not by the general public. We all saw this coming, you better explain why you didn't: ignorance or incompetence?","post_message":"5.) \"Many of our best corporate citizens are also our most creative.\" -- Barack Obama during his State of the Union or Nikki Haley during the GOP rebuttal? #SOTU"},{"comment_id":"1218923861503062","commenter_b":"I wonder if this woman realizes what a joke she is. Department of Justice my butt. She has ruined any respect she may have had from the American people. What she may not realize is the Clinton's would leave her holding the bag if it covered their tracks!","commenter_a":"We don't need Attorney Generals that don't represent WeThePeople and the truth.","post_message":"Loretta Lynch, Attorney General can't seem to get her story straight about Hillary Clinton. This is what it looks like when your career crumbles right in front of you. Let's get 2,000 SHARES to show that we don't need CROOKS in office!"}]
