[{"comment_id":"1828017460760580","commenter_b":"Care less what Martha Stewart has to say period!","commenter_a":"I like Martha Stewart a lot.","post_message":"We're here live with Martha Stewart, who's ready to answer all your veggie-related questions! Ask away in the comments."},{"comment_id":"10154297442132098","commenter_b":"Wow, that's crazy","commenter_a":"Mie Mie the mystery is solved","post_message":"CONDO FIRE: A massive fire broke out a Concord condominium this afternoon. Story: @webpagelink"},{"comment_id":"542505495955041","commenter_b":"@username you're a racist bitch. I hope you rot in hell.","commenter_a":"He was mentally ill he suffered from PTSD . Isn't that what they say when the white boys do it?","post_message":"Dallas Shooting Suspect Identified as 25-Year-Old Army Veteran Micah Xavier Johnson"},{"comment_id":"1569798589746550","commenter_b":"Lock her away...","commenter_a":"Common assault","post_message":"This is disgusting"},{"comment_id":"10153648380297293","commenter_b":"so that justifies a breach in privacy, Richard?","commenter_a":"Why keep nude images of yourself either on your device or your email inbox especially when you're a person of public interest. Stupidity warrants punishment.","post_message":"Jennifer Lawrence, Kate Upton, and Lea Michele were among the celebrities whose photos were said to be in the Celebgate dump."},{"comment_id":"515071932006619","commenter_b":"you make a good argument eugene. historically the philistines controlled the coast of israel. the jews the interior. but after the romans any historian would agree the jews were not a player in the region. after 2000 years i think the claim of europeans to the region is moot. its like me saying i should have land in ireland taken from my ancestors by the english,or land in france taken by the catholics. its not valid and if the united states funded a military machine to take back those places i think it might be wrong.. prior to world war 2 the jewish population in palestine was a distinct minority. the subjugation of the place by european jews was rubber stamped by the west but never ok with the people of that place or any country near it. israel currently recieves billions from the american taxpayer to operate their apartheid ...","commenter_a":"that mosque was in palestine. europeans invaded the country,committed genocide to steal it and now you sit on a high horse and judge the indigenous people it was stolen from because you are ignorant of history or a hypocritical shill.","post_message":"Such extremism isn’t limited to out-of-the-way mosques where radical clerics operate in the shadows. It is occurring in mainstream and leading mosques world-wide, including at one of the most important religious institutions in Islam, the Al Aqsa mosque in Jerusalem."},{"comment_id":"10154085649949203","commenter_b":"almost half of your stupid bitch ass country was from Mexico. We should take it back since ya'll going to hell with trump.","commenter_a":"My grandfather served in the punitive expedition. A forgotten incident in our history.","post_message":"It has been 100 years since the first act of terror on U.S. soil."}]
