[{"comment_id":"1313910325313867","commenter_b":"Some body give me one logical reason to have women in combat.","commenter_a":"There are some exceptional women who can and have performed well. However, truth in science shows overall. Men hold up better. Women break down faster. So many things women do better. Leave the grunt work to us grunts.","post_message":"When will \"the party of science\" accept the truths that science tells us?"},{"comment_id":"10152841074616051","commenter_b":"I am woman...hear me roar!!!","commenter_a":"Love my Hillary!!!","post_message":"A judge said that Hillary Clinton’s e-mail violations are punishable by jail time."},{"comment_id":"513297895525170","commenter_b":"common texans stop sharia now ! it's time to play cowboys and muslims !","commenter_a":"Way to go if they don't like it move back to Iran, Iraq or Saudi Arabia","post_message":"WAY TO GO TEXAS..."},{"comment_id":"1062576617115128","commenter_b":"I think if Americans knew the reason and how our fresh produce(picked by illegal and legal migrants) become contaminated with ecoli and other harmful filth- we would all choose trained Americans to harvest our FOOD. People pay more for organic produce, unsoiled produce is just as valuable.","commenter_a":"The farmers did it to themselves. They gave those jobs, back in the 60s, to illegals who worked for cents on the dollar - and American families were shoved out of the industry. Don't say there aren't people out there who won't do the work. There WERE people out there doing the work - and they threw them away. Let's FIRST - get rid of them ALL - and give it a year to play out to see where we actually NEED work visas. If american companies (and farmers) can show that they diligently TRIED to hire Americans and could not get the skill or number of people they needed - FINE, then they can apply to bring people in on VISAs.","post_message":"THE #1 ISSUE FACING AMERICA Recently, I joined Dr. Carson to discuss immigration. We met for 90-minutes. I shared my experiences, opinions, concerns, and solutions with him. Topics ranged from border security, terrorism, drug and human trafficking, the impact on jobs, wages, welfare, education, culture, and healthcare. HIGHLIGHTS OF WHAT I SHARED: 1. Last year, after announcing I’d explore running for president myself, Megyn Kelly asked why I wanted to be president? I replied, “I hold the sort of conservative values which America needs today. And in the same way Reagan kept his word by bringing home the hostages, I promise to secure the border and solve the immigration problem. I went on to say I'd protect the American people, their lives, their jobs, their health, and their children in the same manner I protect my own. I told her audience I was in love with America. Later that night ..."},{"comment_id":"1725694384382380","commenter_b":"Where have you been sweet thing? We have been giving black people reparations for decades. Who do you think has been putting money into your welfare accounts all these years? Come to me for reparations and your welfare will be permanently cancelled.","commenter_a":"They can kiss my white non-slavery butt","post_message":"All White People Owe Us Reparations, 'If You Don't Give It, We Are Coming To Take It' [VIDEO] They are demanding that we give them money for their ancestors slavery. Will you pay African Americans reparations?"},{"comment_id":"10154077939321636","commenter_b":"Oh and they found no drugs in her system. She was just another drunken slapper who thought she could get rich quick with this story. Oh well it's backfired. Good on him for fighting!","commenter_a":"Might have been found not guilty of rape but his actions on the night highlight that he is a the very least a sexual predator of women and his partner is a disgrace for standing by him, but hay ho she might be into that sort of thing!!!","post_message":"The judge gave the jury a 'route to verdict'"},{"comment_id":"1024247464301668","commenter_b":"Thats life woman ....","commenter_a":"Why do we have to broadcast everything? Is anything private anymore?","post_message":"The scar that saved a baby's life"}]
