[{"comment_id":"10154674776698010","commenter_b":"I've met a few bitches in my life Derek's mom and @username girl were both on that list.","commenter_a":"Pence basically saying hey I'm a rich white male never get stopped by police why should I care .","post_message":"Gov. Mike Pence spoke about police killings and the need for \"law and order\" at the debate. He ended by asking his opponent, \"Senator, please, enough of this seeking every opportunity to demean law enforcement.\" More debate updates: @webpagelink"},{"comment_id":"10155208741709255","commenter_b":"These people need to go!!!","commenter_a":"Cowards","post_message":"Face the music, fellas."},{"comment_id":"983273481708073","commenter_b":"She's just a lying skank!","commenter_a":"You need to be investigated from the beginning to the end","post_message":"You know Hillary is in trouble when her fellow Democrats stop protecting her!"},{"comment_id":"10154446510547098","commenter_b":"Trump is a Nazi Hitler KKK. He does not care about you. Are you rich? You watch what that orange man does. President Obama is the best president the United States of America ever had!","commenter_a":"Liberals are very hateful and violent","post_message":"NIGHT OF CHAOS: Protestors broke windows, threw smoke bombs, and started a raging fire on the UC Berkeley campus last night...And now, President Trump is questioning funding for the school. Read more: @webpagelink"},{"comment_id":"10154197437622426","commenter_b":"It's reality, white suburban women. It's not fair but it's a fact. If you're so concerned why don't you go down to Hillside Court and walk the kids home from the bus stop.","commenter_a":"School need more money but kids have 300$ shoes .500$ phones and say look at me and wonder why this happens.","post_message":"The robbers, described by police as young adults, threatened to beat-up the student if he did not take off his shoes and hand them over."},{"comment_id":"1329423637100902","commenter_b":"She owns them.","commenter_a":"Ivanka you rock and you are a great representative of a Jewish woman and princcess and MOm . G-d bless you and your family .NOOne has a perfect family and you exemplify derecho eretz.","post_message":"LIBERALS HAVE CONCLUSIVELY PROVEN DURING THEIR ELECTION MELTDOWN THAT THEY ARE THE SCUM OF THE EARTH!"},{"comment_id":"1105112639584987","commenter_b":"She's an embarrassment to all intelligent women","commenter_a":"Get over your love affair with Trump. It's not happening and @username looks super pathetic.","post_message":"Here's what happened in Iowa, according to Donald J. Trump."}]
