[{"comment_id":"1257260354293992","commenter_b":"You are illegal go away","commenter_a":"Oh yeah more guns to START shooting over the least thing or person ASSumed to be Muslim....................","post_message":"\"If more good people had concealed carry permits then we could end those Muslims before they walked in killing,\" Jerry Falwell Jr. said Friday."},{"comment_id":"1073538729332546","commenter_b":"Terri must not have kids to make a statement like she or he made. Shame on you putting the blame on the mother.","commenter_a":"School needs to be held accountable and the bus driver for forcing her off. This can never happen to another child. They are lucky the right person found this child and returned her.","post_message":"A #Seattle bus driver is now off his route --- after a 7-year-old was found wandering Capitol Hill, crying. >> kiro.tv/WrongStop"},{"comment_id":"1718830391702540","commenter_b":"Obama does not want to destroy it because he is part of it.","commenter_a":"Bill O'Reilly.the American. People should pay more attention what's going on around them. Train are self too be more open minded. These terrorists attracts are not going away. It's. Up too the America people too prevent these attracts. How. , communication system set up by naborhoods, friends. Basically by listing. You feel some one a subspect , call (911). Alearkness is the best defences. Maybe. So.","post_message":"Bill O'Reilly said America is under attack, and \"just because they don't use tanks and planes doesn't mean it isn't war. It is.\""},{"comment_id":"951958574839238","commenter_b":"These fuckin nazi like pigs make me sick my family came running from this 50 years later now look what the fuck is goin on the fourth reich vultures of america be killing our most loyal friends. Howcome We cant hurt their fukin dogs but they can jus come blast ours away word is bond kill my dogs look the fuck out","commenter_a":"Yanky fuckin cops","post_message":"This video is one of the most cowardly acts you will ever see. The poor dog was scared, ran and hid behind a table, and then was executed by a coward with a badge. The Free Thought Project.com (Y)"},{"comment_id":"10154198214815496","commenter_b":"Kid is gonna put u away","commenter_a":"This is crazy they get to do this","post_message":"Live | The trial of the mom and dad accused of locking their son in a room for almost two years continues. More on what you're watching (and updates when the stream is down): @webpagelink More on the case | @webpagelink"},{"comment_id":"10154712267998145","commenter_b":"@username no you're just a pussy","commenter_a":"And the trend has been set. Everybody just open fire at will. Don't worry about those pesky innocent bystanders and there's no need wasting tax dollars on a trial. Apparently stealing is an automatic death sentence. From diapers to Dodges citizens can now act as judge, jury and executioner. Smh.","post_message":"A man shot at least 18 times at someone who had stolen his pickup truck early Monday from an apartment complex, the Winter Garden Police Department said"},{"comment_id":"613516002130239","commenter_b":"Women wear ties","commenter_a":"Men are expected to wear ties, that's also sexist.","post_message":"Nicola Thorp says she was laughed at for asking if a male colleague was expected to wear heels too. 👠👠"}]
