[{"comment_id":"10153627054797217","commenter_b":"They were one of the best armys when Saddam was in power. Everything in Iraq lost its glory after him.","commenter_a":"It's a shame the Iraqi army is so awful otherwise they may actually succeed.","post_message":"To retake Falluja from the so-called Islamic State."},{"comment_id":"10153127480747411","commenter_b":"That's what boobs are for, to feed your children. Yet women can walk around in boob pasties and thongs but that's ok, get real!!!!","commenter_a":"Proud nursing in public Momma right here.. never feel shamed. If you want to cover, go for it. If you want to go in private, do it. If you want to feed your baby in front of the world, go right on ahead. It's boobs people. But you have no problem with bikinis that show WAY more of most women than when nursing their child. Grow up","post_message":"NURSING MOTHER: POLICE SHAMED ME A Nebraska mother breastfeeding her 4-month-old son in public says an officer threatened to cite her for indecent exposure if she refused to cover up. What do you think about this?"},{"comment_id":"559978767492171","commenter_b":"This @username guy can be on my tv screen anytime he likes. Hello, there 😍","commenter_a":"Hillary for President!","post_message":"Take a sneak peek at the MSNBC #DemDebate! Hillary Clinton and Bernie Sanders face off tonight at 9pm ET. Here's how to watch: @webpagelink"},{"comment_id":"870207206369309","commenter_b":"Congress won't pass it tho, cause big business wants those workers. The chicken and meat processing plants especially. This is by far the best way to stop so many illegals coming, but don't hold your breath till it happens","commenter_a":"Who are the other 39%. I'd like to report them to ISIS...","post_message":"71% of voters said they would be in favor of Congress passing a law making it illegal for businesses to hire illegal aliens. Don't you agree?"},{"comment_id":"10154151758449087","commenter_b":"@username Oh, please. Where are the arrests, the charges, the trials? Where are they? When did they happen? Where are the files? The proof? And here's the thing: Bill Clinton is NOT running for president. Whatever did or did not happen in the past is a \"he said, she said\" situation at this point. Or really a \"she said\" situation, and sadly, a LOT of women go after powerful men, married men, etc., and then cry \"rape\" when they don't get what they want. And I say that as a woman who would f**king kill a man who raped me. And once again, Bill Clinton is NOT running for POTUS. Donald Trump is a low-class disgusting creature who should NOT represent this great nation on the world stage.","commenter_a":"Let me know when Trump does something as bad as LEAVE 4 AMERICANS TO DIE..then you will hear my outrage..but you won't hear it over some locker room crap that Trump said.. Toughen up cupcakes..","post_message":"#BREAKING: Mike Pence was reportedly \"beside himself\" after hearing Trump's obscene remarks about women, and Pence's wife was \"furious.\""},{"comment_id":"1766281877023124","commenter_b":"Its not the bathrooms that rea really an issue, its the open locker roons with few changing stalls that people are really worried about since most transgenders do not get the full plumbing make over.","commenter_a":"Who is going to notice if this guy uses a men's room? I swear America is making more problems each day out of boredom. No one here in Germany gives a shit is your trans or taking your kids to the shitter. If a trans or better said a human being needs to pee I really don't care what gender they are or identify with. It's none of my fucking business.","post_message":"When it comes down to it, trans people just need to pee. That's all."},{"comment_id":"10153792156382439","commenter_b":"I would be pulling my children out of that school and looking for a different country to live in... preferably muslim free....","commenter_a":"Sounds a lot like how they kicked of the 3rd Reich.","post_message":"As part of a school project, German children are required to cook and clean and change the bed linens for refugees. The host country becomes subservient to the invaders. A letter written by the Schleswig-Holstein Ministry of Education and Vocational Training, says “pupils will spend a day in a transit accommodation and help for example, fix up as beds as well as help in the collection of donations.“"}]
