[{"comment_id":"10154156442975443","commenter_b":"We did trust remember all Far East and then look what happened American trained Far East pilots flew their planes into our building now because of ISIS we need to take measures don't take all this personal and if ISIs does get in who will be at fault well oh a big war and then how will you feel this is what happened we are too trusting this has nothing to do with RACE do you all have better way to stop this","commenter_a":"One brave Judge saved Muslims from being discriminated against contrary to the constitution. We really need some brave republican congressmen to save America from heading into disaster by stopping this man making hate and racism a normal thing. What we have seen so far and just today banning CNN and The New York times is no joking mater.","post_message":"\"The situation seems to be pretty bad after Trump took over as the U.S. president.\""},{"comment_id":"1518802311757226","commenter_b":"For people illegally here","commenter_a":"Especially if you are anyone other than the WORKING CLASS !!","post_message":"President Obama just addressed Donald Trump in a not-so-subtle way. Do you agree with the president?"},{"comment_id":"10153310344686157","commenter_b":"If she gets droped off by the bus shes to young for you bruh","commenter_a":"If her shoes light up when she walks she is too young for you bro.","post_message":"Investigators believe 23-year-old Estevan Garcia sent naked Instagram photos to a 14-year-old girl. He worked for the Donna school district as a security guard."},{"comment_id":"10152745228401615","commenter_b":"being lesbian doesn't make them superior... they could easily end up divorced single mothers too.","commenter_a":"Most marriages end up in divorce and children are raised mostly by struggling single mothers. Those mother's present the mother And father role. Having two mothers appears to be a blessing! :) Children need love, structure and room for growth. So, haters just sit down and if you love children so much the foster care and group homes have many of your neglected and abused children waiting to be adopted and loved.","post_message":"Yes, they're both pregnant, but about a year apart..."},{"comment_id":"10153811054249749","commenter_b":"Werent immigrants. They'd flown over to do this and some other jobs then planned to go back.","commenter_a":"Citizens arrest. Very good. Nice to see some black citizens using their fitness and strength to uphold the law. A good image for black people worldwide... Estonian immigrant eh? Well, well, I would contend it's a moot point whether or not he's 'enriched' the UK. He certainly is trying very hard to 'enrich' himself, although I think he should consider another profession to be honest... ;-)","post_message":"Police release CCTV footage showing members of the public in Leeds tackling an armed jewellery thief and pinning him until police arrived."},{"comment_id":"10153118428724641","commenter_b":"Those blood sucker should come to Malaysia to joining in our corrupt club here without fear... They really stupid because Malaysia only protect the corrupt rich...","commenter_a":"Must be getting ready for something if they want more people back to their country.","post_message":"150 corrupt Chinese officials may be hiding in the U.S. And China wants them back cnnmon.ie/1M6Of5q"},{"comment_id":"1754494444782298","commenter_b":"If you have to ask what's wrong with him then you need to get a checkup from the neck up and have your ears cleaned out","commenter_a":"I sure hope he's getting 2 a.m. calls in the morning from people who hate his guts","post_message":"THEY DID IT: #Anonymous just released all of Donald J. Trump's personal information to the public..."}]
