[{"comment_id":"654971807960745","commenter_b":"Fake fugly whore.","commenter_a":"can she get her face redone?","post_message":"This woman wears a corset for 23 hours a day. She has also had 4 breast enhancements, a gastric bypass, and two nose jobs. She says she finally has the most perfect body in the world.   Do you think she has a perfect body?"},{"comment_id":"10153444614011955","commenter_b":"It's a two part problem. Illegals and lazy Americans.","commenter_a":"Maybe those Americans should leave.","post_message":"Illegals outnumber unemployed in USA..."},{"comment_id":"968795919903853","commenter_b":"The woman is so stupid, only reason she is in because of her color.","commenter_a":"Punta","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response.  'LIKE' if you think Rep. Maxine Waters should be kicked out of office for showing such strong support of ShariaLaw."},{"comment_id":"10152525662890047","commenter_b":"So if God was in America, there would be no border, or ISIS problem? Just how would that happen?","commenter_a":"We need God in America!!!!!!!!!!!!","post_message":"ISIS poses a real threat to the United States, and a large weakness in our security is our porous borders.   Sign & Share our petition to protect the American people from the ISIS threat:  @webpagelink"},{"comment_id":"446969245501847","commenter_b":"We need a first lady with her boobs hanging out ?? Geeeez - that is classy","commenter_a":"Beautiful family! Trump got good taste when it comes to women!","post_message":"Thank you!!"},{"comment_id":"10154410865644091","commenter_b":"He better be ready for BIG POPPA'S in jail bc there gonna rip his A$$ for raping those little angels...Let's see how he likes it now! #ThrowAwayTheKey","commenter_a":"I hope you get yours in jail you pos","post_message":"JUST AWFUL: This Long Island man is accused of raping 2 young girls -- ages 6 and 7."},{"comment_id":"10154266056696051","commenter_b":"She looks dreadful!!!","commenter_a":"the VALUES are no 'right' unless they are YOUR values?? I don't think so...........the American people have spoke. Donald Trump Is Our President","post_message":"Hillary Clinton made her first major appearance since losing the presidential election last Tuesday. Do you agree with what she's saying?"}]
