[{"comment_id":"10155404890705354","commenter_b":"HHHAAAAAA just when you think these morons can't get any more stupid then they already are..HHHHAAAAAA......how about a lying bitch? is this phrase \"Off Limits\" personally I think it's really very descriptive of this...well...lying bitch....","commenter_a":"Bullshit!","post_message":"Hillary Clinton's digital thugs warn the media: using the word \"secretive\" is \"coded sexism.\" Take a gander at the rest of Hillary's laughable list of \"sexist\" words..."},{"comment_id":"10153811060584614","commenter_b":"Take the guns....and the illegal criminals will be the only ones with them...","commenter_a":"90% of the immigrants are Muslims male between 18 - 30..and are military savvy....the are probably guilty...a planned take over.....Germany is next...","post_message":"Update: At least 150 people were killed in Friday's Paris and Saint-Denis shootings and bombings, French officials say."},{"comment_id":"909912449057779","commenter_b":"She is a CRIMINAL LIAR !!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Poor, really, couldn't they spell abysmal?","post_message":"Well if the shoe fits..."},{"comment_id":"1744752812466666","commenter_b":"He can't he has to pay for all of Obama's muslims he let in here during his presidency. Also, all the illegals. Unless we get rid of all the illegals there is no money.. Oh and the muslims that Obama let in here..LOL","commenter_a":"Mr. @username, Like where you're going. I would 1st Cut Welfare 100% and give it all to the Vets, they have earned it. Close the border and start kicking out un-documented, non tax paying illegals. Bring jobs back to the U.S.A, and repeal oshitcare. Also free up the 2nd A. If you Hate this Country Ask the Government for a ONE WAY TICKET to anywhere in the world. Free of charge.","post_message":"A NATION WITHOUT BORDERS IS NOT A NATION AT ALL. WE MUST HAVE A WALL. THE RULE OF LAW MATTERS! -DJT"},{"comment_id":"10153315723671336","commenter_b":"God's hands sand feet here on earth. Do it for the least of these","commenter_a":"This is an American.","post_message":"Since Christmas, 28-year-old Nic Martinez has traveled along the East Coast in a 25-foot trailer re-fitted as a barbershop. Along the way, he stops and cuts hair for veterans and the homeless. #ProudAmerican"},{"comment_id":"1040495199380065","commenter_b":"Looks like only gays and uninformed women votes get this evil women.","commenter_a":"President Hillary Clinton","post_message":"A win for Hillary."},{"comment_id":"1825065494398013","commenter_b":"the people actually running for president and the SUPPORTERS of those candidates are two different things, dillan.","commenter_a":"The party of old white people is starting to show it's age","post_message":"BREAKING: 'I'm going to run in 2020. For president'"}]
