[{"comment_id":"10153602906656509","commenter_b":"You can buy them too.","commenter_a":"I think she means she wants to make a lot of money. Those GEDs aren't cheap.","post_message":"Is America ready for #marijuana moguls? Follow one young couple's journey as they attempt to franchise legal marijuana @webpagelink #HighProfits"},{"comment_id":"454178371439410","commenter_b":"Deport all savage backward ass cave dwelling Muslim","commenter_a":"Should ban all muslims completely","post_message":"Should The US Ban Islamic Veils In Public? Comment 'yes' or 'no'."},{"comment_id":"444043602465820","commenter_b":"Look at her satanic pointed teeth!","commenter_a":"Not surprising, coming from stupid, I mean her.","post_message":"Democrat Leader says Her Kids Weren't Human Beings while in Her Womb!"},{"comment_id":"1089311434439529","commenter_b":"This surprised me.....even a blind squirrel finds a nut.","commenter_a":"The view sucks all those asswipes on that show should move to Brussels if trump gets elected..","post_message":"\"I can't believe I’m feeling this way...\""},{"comment_id":"10155165703940603","commenter_b":"Whites can't be thugs Danny","commenter_a":"Thug, Keep posting it even if your White or Black. For some reason White people think all Blacks feel as if every Black is innocent. I'm pretty sure Blacks feel as if all Whites think all Whites are innocent. That's not true and if having to state that we think this guy is thug helps then I'll summit to that. I don't think anyone really believes that condoning violence is OK if the person is the same color. People may be right or wrong but it's not necessary a race thing, I think they truly believe the person is innocent but are poorly informed.","post_message":"Robert Clark is wanted for murder and may be hiding in out Missouri. Clark’s accused of brutally killing a couple in Ohio and is also reportedly connected to a string of violent robberies. Please share and call 911 if you see or know anything."},{"comment_id":"1209490769090378","commenter_b":"Hillary is no lady she is more of a whore.","commenter_a":"We've already learned that this lady is a huge liar. What she says, and what she can do, are 2 different things. Obama just got blocked, so, hopefully this we won't have to worry about it and Trump will just be elected. Fingers crossed.","post_message":"DON'T let this woman be elected!!! @webpagelink"},{"comment_id":"10153854560011378","commenter_b":"Hillary is nothing but a liar... Trump 2016","commenter_a":"I'll be so glad once Hillary Clinton wins and becomes our new president because her speech she gave the other night everything that she said about keeping the guns out of the hands of criminals terrorist and these bad people that shouldn't have guns in the first place she will keep us good people from getting shot will be great we need a change in America please God let Hillary Clinton get enough votes to win in November","post_message":"A shooting victim has died and one man was taken into custody after a police chase and crash in South Philadelphia."}]
