[{"comment_id":"868283350028908","commenter_b":"Those women are a group of sick , twisted bitches. But their outlook is the killary twist. Blame the victim . You bitches make all women look bad.","commenter_a":"Take conservative Fox with you","post_message":"This is absolutely shameful. Get this liberal trash off the air immediately. Can we get 30,000 'LIKES' to have this show shut down?"},{"comment_id":"10153010443401336","commenter_b":"I bet you don't even know what a p value is lmao.... Please don't reproduce...:)","commenter_a":"should be legal everywhere","post_message":"Possession of marijuana is no longer a crime in Alaska, but smoking it in public can lead to a $100 fine.  Should more states follow suit?"},{"comment_id":"10154342648916509","commenter_b":"Shut up","commenter_a":"The decision to continue with fireworks in spite of huge fire at hotel nearby shows the sadist attitude of Arub nation.","post_message":"#NewYearsEve fireworks display continues in #Dubai as nearby hotel is engulfed in flames @webpagelink"},{"comment_id":"10154244294358132","commenter_b":"I love me who do you love? Stop posting naked pictures of yourself you hoe!!!","commenter_a":"Omg! She doesnt know what to do to get attention!","post_message":"Kim Kardashian West is letting it all out."},{"comment_id":"1354028091302090","commenter_b":"Thank you for telling it like it was and appeared. I completely agree with your assessment. I am sure some women were just following what everyone else was doing: clueless, just part of the cattle drive to slaughter. Made me sick to my stomach seeing pictures of the filthy, vile costumes they paraded around wearing. Unbelievable, no shame whatsoever!! Hillary's minions!","commenter_a":"Straight talk: haven inspired me to join your cause, Hubbard went on. anything, you inspired me to run the other way.","post_message":"You've got to see this!"},{"comment_id":"910655875703037","commenter_b":"That is one UGLY Hillary","commenter_a":"@username @username Mac Barricini","post_message":"It's called \"Orgy Island,\" and there was already evidence linking Bill Clinton to it. Now, though, the FBI just dropped a bombshell involving Hillary Clinton and the sick island... and what agents are saying could turn the entire election in a VERY ugly way."},{"comment_id":"10153287154044714","commenter_b":"Nope. She's a woman!","commenter_a":"Your father is a man I don't care he changes","post_message":"An incredibly touching story"}]
