[{"comment_id":"10153662067420950","commenter_b":"Teresa you need a big fat,one stuck in your mouth so you can't talk but choke","commenter_a":"Trump's mouth is actually helping to elect Democrats in November. I wonder how many Republican leaders were meeting this morning and asking one another \"How in the hell can we shut this guy up?\"","post_message":"\"I'll say one thing about the Democratic Party,\" Trump observed. \"At least they stick together.\""},{"comment_id":"10153881330947434","commenter_b":"So funny how some morons predict an armageddon just because their feminist messiah didn't win.","commenter_a":"Except for the fact that Jill is only asking for recounts in places where Trump won narrowly and has continually ignored asking for recounts in areas where Hillary won by even less votes. It's not about electoral integrity, it's about a woman having an infantile, foot stomping temper tantrum because she didn't get her own way.","post_message":"Jill Stein herself, standing across the street from Trump Tower, encouraged the president-elect to support her campaign’s efforts to ensure that every vote is accurately counted. “There is nothing to be afraid of,” Stein said, “if you believe in democracy.”"},{"comment_id":"10152950589906051","commenter_b":"Let's throw her away with out anything too hope she go to hell","commenter_a":"This is true evil!","post_message":"Even the police were a little surprised that someone could be so cruel for no reason."},{"comment_id":"10153919484005950","commenter_b":"I'm not copying, I'm telling the truth. You also look like a witch. It's catching.","commenter_a":"Angelina ruined him once, now she's trying again. She should have kept her man eater claws out if his first \"real\" marriage. I swear, I think she's a dark witch, casting dark spells.","post_message":"The LAPD released a statement to Entertainment Tonight to clear up reports that they were investigating Brad Pitt for allegedly being physically and verbally abusive with one of his children."},{"comment_id":"10153781983829062","commenter_b":"Yeah!","commenter_a":"Oscar","post_message":"Heads up Ariana, fans... she's coming back to Texas this summer! Did you see her at the rodeo?"},{"comment_id":"848558051846284","commenter_b":"Ghetto booty......for ghetto trash!!!","commenter_a":"I think Michelle needs to follow her own advice on eating nutritious. She's a bit hefty from behind","post_message":"You won't believe how much you're paying for the #Obama family vacations.    This will leave you outraged!"},{"comment_id":"10153061326484586","commenter_b":"this is sick how the hell does this go unnoticed","commenter_a":"tangeneng yan!!!!!","post_message":"HARD TO BELIEVE:   Do people know that THIS could be what they're paying for when they buy leather?!   [Warning: Some of the most GRAPHIC footage] #DogLeather"}]
