[{"comment_id":"10153871154220329","commenter_b":"SHE is a WOMAN.","commenter_a":"No man can bear children. She's a woman, fact.","post_message":"\"One came from daddy's tummy and one came from mummy's tummy.\" (via BuzzFeed Trending)"},{"comment_id":"904790836280638","commenter_b":"Absolutely","commenter_a":"Obama care","post_message":"What's fair is fair! Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1236473219748126","commenter_b":"The police did what they needed to do. Woman was out of control","commenter_a":"Yes. NOT because of race, NOT because she is a woman, because she is resisting arrest. Have your day in court and don't try to get your justice in the street. It's just that simple.","post_message":"This Black Lives Thug Chick Gets Her FACE SLAMMED Into the Concrete... But after watching the video did she deserve it? We say yes! You decide! (VIDEO)"},{"comment_id":"10153846825321336","commenter_b":"We need him gone he don't give a damm about anything go home you muslim","commenter_a":"Obama is aiding and abetting the enemy. He is a traitor and should get what he deserves as such.","post_message":"“If you were waiting to hear a U.S. president say, 'I feel your pain' or…'it’s them or us,' that is not what you just heard.” – Bill Hemmer on President Barack Obama's speech on the Paris attacks @webpagelink"},{"comment_id":"1381562928548606","commenter_b":"Ya and they'll have to start paying for water or make their own from sea water. Of course northern Ca, will succeed, so all we will lose is the three out of control cities. Not bad","commenter_a":"3 trillion in debt CUT EM LOOSE","post_message":"Spread this everywhere!"},{"comment_id":"10153517171806336","commenter_b":"Shut up you stupid woman!","commenter_a":"They were only 160 ft. Away and actually they checked on the children throughout the night. It is said the mother visits the place where the child went missing to walk the streets hoping to find her. The parents are devastated over the loss. Just because you or I would not leave our children like this doesn't mean we should be so critical or unkind. They made a terrible mistake ( in this case perhaps a deadly one). We should show kindness and pray for them. I mean after all what if it were you/me. No one is beyond making mistakes. They are tortured enough. Walk a mile in their shoes.","post_message":"Based on an examination of the bones, Australian police determined the child was killed \"some time since the start of 2007\" – the same year Madeleine McCann disappeared."},{"comment_id":"10154713601071336","commenter_b":"For the tape no more no less!","commenter_a":"The sexual assault was words - big deal.","post_message":"Donald J. Trump says accusations of sexual assault may have been started by Hillary Clinton's campaign: \"I didn't even apologize to my wife...because I didn't do anything.\" #Debates2016 #FoxNews2016"}]
