[{"comment_id":"10155187133853029","commenter_b":"Your literally the only one what finds this funny","commenter_a":"@username listen to the end","post_message":"Video captures a Syrian mother and father preparing their two daughters, ages 7 and 9, for jihad suicide missions."},{"comment_id":"10153705912357217","commenter_b":"Morons.","commenter_a":"There needs to be an investigation into the biased remain reporting by the publically owned BBC, a petition is needed to force an investigation by the government that will hopefully result in the breakup and sell off of the corrupt paedophile luvies club and their bully boy licence fee tax collection department too, good riddance!! #ENDBBC!😡","post_message":"EU leaders say the UK must move swiftly to negotiate leaving the organisation bbc.in/euref #BBCShorts"},{"comment_id":"1164964563593106","commenter_b":"I saw them at Riverside too! I remember crying lol","commenter_a":"@username remember Riverside lol","post_message":"This is Paula first time on tour in 25 years!"},{"comment_id":"10154732730043132","commenter_b":"BUT is he jewish?!","commenter_a":"Daniel Foisset","post_message":"It looks like Aly Raisman has plans for after Rio!"},{"comment_id":"1134360159938174","commenter_b":"My comment here is in no way an attack on this guy. The reality is that he's working an entry level / minimum wage job so that's why he makes minimum-wage. I'm a disabled Marine Corps veteran myself and I spent four years in school so that I could earn enough money to support my family and give them a better life. For those that say that maybe he doesn't have the aptitude to go to college, there are trade schools out there that he would be more than qualified to go to. When fast food workers start making $15 an hour then entry-level welders need to be making $25 an hour and those that are currently making $25 an hour will then need to make $35 an hour and so on and so forth.","commenter_a":"This man risked all he had for this country, got wounded but continued to serve his country and now he gets $7.50/hour and cannot afford to support his family!!! :( While Mr. Cheney does not step his foot on the battlefield once, and his Halliburton makes nearly $40 billion dollars from the Iraq war!!!!!!!!!!!!!!!!!!!!!!!!! How can this country allow such extremely disproportionate treatment of its citizens???? I think the living wage is around $27 to $30 dollars/hour and that's what the veterans deserve....","post_message":"He fought in Iraq, but back home, he's struggling to get by. Fight for $15 advocates that everyone be paid a decent wage."},{"comment_id":"10153699957431336","commenter_b":"Muslims need to stay in the Middle East. Or hell. Same thing.","commenter_a":"The Tsarnaev brothers were \"refugees\". Don't forget that.","post_message":"Secretary of State John Kerry says the U.S. will accept 85,000 refugees from around the world next year, up from 70,000, and the number will rise to 100,000 in 2017."},{"comment_id":"10153591407472293","commenter_b":"So youre saying,sir , that you may agree with some of their values and not be aware that you do because of conditionally environmental blindness.","commenter_a":"We're seeing some of the results of Donald Trump's subpar education. He makes up for his lack of intelligence with bluster, but in the end it won't serve him or our country well. Next Trump will boast that he will make the trains run on time.","post_message":"Donald J. Trump's responses quickly prompted criticism from his Republican rivals and others."}]
