[{"comment_id":"1090268744329629","commenter_b":"at least all those illegals your allowing in here are getting to work.","commenter_a":"14.4 million part time jobs.","post_message":"Another positive jobs report out this morning. 215,000 private-sector jobs were added in March.  That's 73 straight months of private-sector job growth."},{"comment_id":"10154005509605575","commenter_b":"Go back to Canada you slimy rat","commenter_a":"THIS IS THE MAN THAT HELPED DEVELOPE NAFTA FOR THE BUSH'S IN ORDER THAT WE WILL HAVE OPEN BORDERS","post_message":"Trump blasts Natural born Canadian Ted Cruz..."},{"comment_id":"10153238831311051","commenter_b":"Typical Americans always thinking they are better than everyone. Have you simpletons ever stopped think why these immigrants come to America? A lot of these Hispanics come to this country for better lives and find work, work that half these lazy ass welfare sucking Americans won't do.","commenter_a":"We need to deport Trump","post_message":"Do you agree or disagree with Donald Trump?"},{"comment_id":"1005304559506884","commenter_b":"@username wow dude! go tell that to china, india, russia...they pollute the air you breathe in an astronomically higher number , last i checked, the earth only has one atmosphere.","commenter_a":"God be with you and your team as you go forward for our great state of Kentucky.","post_message":"\"They bribe us with our own money to stick it to ourselves. And we will not do that anymore in the state of Kentucky.\""},{"comment_id":"741809245917684","commenter_b":"THOSE 3 BITCHES...ARE GETTING THE SHIT GANG BANGED OUT OF THEM NOW.","commenter_a":"IS is recruiting sluts for sex only son","post_message":"Aqsa Mahmood, 20, left her home in Glasgow in 2013, and married an IS militant in Syria."},{"comment_id":"1038590639515127","commenter_b":"Jennifer BTW how is that being a bitch. Bitch?","commenter_a":"And ALL of their body guards carry guns","post_message":"This video is packed with more celebrities than we could count — and they have one powerful message for the world."},{"comment_id":"349993335204181","commenter_b":"Since nobody will charge her with anything, she is above the law","commenter_a":"Yelp the Clintonss. Obama .Kerry's .. all do.","post_message":"Rand Paul says Hillary thinks She Above the Law"}]
