[{"comment_id":"1028079707241669","commenter_b":"Yes oooo. They know what their children are up to. Let the people deport them.","commenter_a":"Damn right.","post_message":"French Mayor Says ‘No More Muslims’, Orders The Destruction Of The Infamous Calais Camps And Expulsion Of Over Seven Thousand Muslims  @webpagelink"},{"comment_id":"10157484651970725","commenter_b":"@username PAM she is already DESTROYING THE COUNTRY !","commenter_a":"Go trump ! So, 96% of Hillary's charitable donations went to the Clinton Foundation! Yeah, 96%, they donated to themselves.","post_message":"Unbelievable! Thank you Erie, Pennsylvania. This is a MOVEMENT! I have no doubt that we are going to WIN -- and MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"10154324674924916","commenter_b":"@username, She's actually the lesser of two evils.","commenter_a":"When you cast your vote for an out right bull shitter, who hasn't one damn idea of how he's going to run the country, except to say, \"it'll be better\", your one dumb son of a bitch, and your dragging the country into the gutter.","post_message":""},{"comment_id":"996595140397015","commenter_b":"These gun nutters are too chicken to go fight a REAL threat, so they try to intimate normal people. You freaks are just trying to intimidate people. Red beck, Inbreeds!","commenter_a":"You don'y have to give up your guns, and no one is proposing that (I'm a gun owner and a vet), to have sensible regulation.","post_message":"“I grew up in Tucson, Arizona, and I live there now. And I'm a gun owner and a supporter of the Second Amendment. But I couldn't give you more credit that we need to deal with the wrong people getting guns, especially with mental illness. As you know, in Tucson we had a person who had all kinds of trouble and was able to buy a gun. In Virginia Tech. In Louisiana… So from a gun owner, from a reddest of red states, and a person who owns guns, more power to you.” —an attendee at Hillary’s town hall on gun violence prevention in Manchester, NH"},{"comment_id":"1868656350045137","commenter_b":"Jealous lady...","commenter_a":"Whiney baby","post_message":"So great!"},{"comment_id":"1045431208809965","commenter_b":"This is not news worthy.","commenter_a":"Who cares?","post_message":"BREAKING> Beijing wins bid to host 2022 Winter Olympics. China's capital will be first city to host summer & winter games."},{"comment_id":"10153216649359705","commenter_b":"Heterosexuals have rights to same sex bathrooms","commenter_a":"PA-THE-TIC! Only country in the world that does this garbage!","post_message":"White House staff now have access to an all-gender bathroom. Here's why it's important."}]
