[{"comment_id":"907221015981906","commenter_b":"what woman would fantasize about being gang raped?","commenter_a":"And is that because that's his fantasy","post_message":"When Democratic presidential contender Bernie Sanders was 30-years-old, he wrote that women fantasize about being gang-raped. His office did not immediately respond to a request for comment from TheBlaze."},{"comment_id":"10154390282749411","commenter_b":"Yeah, only to let them in later since we have open borders with yhem","commenter_a":"@username Lessa Katherine but sure.. let them into europe haha","post_message":"'This is my sincere thought'"},{"comment_id":"10152776078426051","commenter_b":"Bet she's sorry after all those dollars were raised for his support. Selfish woman.","commenter_a":"Too bad that she thinks more of her secondary family then she does your husband in her own child","post_message":"Remember the woman who forced her husband to choose between her and a baby with Down syndrome? Well, here she is."},{"comment_id":"1185052468202276","commenter_b":"@username . Yes, it has worked out very well for me. My wife doesn't just not mind, she really likes my beard. As for the women \" that do were and are not interested\" in me- I couldn't care less, they are irrelevant. I have a beautiful wife. You are right in that everyone has physical preferences, I for one am not attracted to women with silicone breasts and/or mullets. Perhaps one day soon, when you hit the menopause, you might grow yourself a fine, full beard and be proud of it. All the best!","commenter_a":"If you can grow a beard, then why not? I really couldn't care less if someone finds my beard unsightly. You should be proud of your masculinity, not try and disguise it. I spend most of the daylight hours outside, the beard helps protects me from the elements and from those of a nervous disposition.","post_message":"Just one more reason to love beards!"},{"comment_id":"10153659892877093","commenter_b":"Woman","commenter_a":"Bomb that guy","post_message":"HOUR-LONG STANDOFF: The woman refused to get out of her SUV & cooperate with police. She tried to drive away and was finally taken into custody... @webpagelink"},{"comment_id":"10154627536394203","commenter_b":"And Hillary is in a self-serving line person all my God where are you woman you're in dreamland what are you smoking","commenter_a":"The man is entirely self-serving. His ego is his God. Bravo to Rev. Timmons for putting him in his place.","post_message":"Donald J. Trump's latest target? Rev. Faith Green Timmons of Bethel United Methodist Church."},{"comment_id":"825004334282616","commenter_b":"do that and u'll have gallstone in ur bladder","commenter_a":"Dose this truly work?","post_message":""}]
