[{"comment_id":"10153184918416336","commenter_b":"never believe this man promise. that's look errr. that's look that can behead you, rape your children and take your wives.","commenter_a":"The face of evil.","post_message":"Abdul Rahman Shalabi, who allegedly served as a bodyguard for Usama bin Laden, went before a parole board to ask for his release so he can marry and have a family."},{"comment_id":"10153356889206162","commenter_b":"But according to @username, only BLACKS are doing this foolishness...So I guess the Latin Kings, & the Sinoloa drug cartel, are peace-loving church groups...","commenter_a":"Im sorry but blacks enjoy killing their own over drug money gangs personal problems and ignorance. I do feel as sorry for those innocent people that have lost their lives due to the violence of this crappie city and ignorant people.","post_message":"DEVELOPING: 2 men are dead and a woman is injured after a shooting in North Lawndale: @webpagelink"},{"comment_id":"1051057634970056","commenter_b":"Poor woman","commenter_a":"Pro choice equals anti Christ. Stop having sex tie your tubes. No need to kill","post_message":"This is a win for women's reproductive rights."},{"comment_id":"1063012123817862","commenter_b":"It is under God not no damn allah you ignorant muslim cocksuckers. If you dont like our country,our anthem, our flag,and our laws then by all means get the fuck out and take the clintons and obamas with you","commenter_a":"WTF","post_message":"THIS IS THE UNITED STATES OF AMERICA! Our country was founded on Christian principles. 'LIKE' if you think this is wrong!"},{"comment_id":"10153159608716833","commenter_b":"Took out the trash.","commenter_a":"The guy with the gun did the right thing!","post_message":"Armed Citizen: Video has been released showing a man armed with a machete kicking in a Pocatello, Idaho, apartment door last year, then getting shot by the apartment resident."},{"comment_id":"10154515564959657","commenter_b":"Get a big boat and ship them back.","commenter_a":"Not sure if I'm buying this, I've heard multiple different stories from a couple of families to 10k of them.","post_message":"VIDEO===> Bus loads of refugees arrive in New Orleans today."},{"comment_id":"10154276693141037","commenter_b":"Hillary needs to start leaning a bit further left, and start actually addressing the issues that the voters she's not getting care about. Her 'don't be so pie-in-the-sky' attitude will cost her the election, and God only knows the price this country will pay with Trump in the Oval. Bernie is hanging tough because Hillary is not!","commenter_a":"I will only cast my vote for Bernie Sanders. Period. I will write him in if need be.","post_message":"Despite Hillary Clinton’s insurmountable delegate gap, Bernie Sanders coasted to victory on Tuesday, yet again."}]
