[{"comment_id":"876486519053475","commenter_b":"Lmao Andrea the slut","commenter_a":"Lmao. These hoodrats can have armpit hair all they want. They'll be single and starved for cock. Noone wants chewbaccagina.","post_message":"There's a viral discussion being had over sexism..."},{"comment_id":"10153798240092869","commenter_b":"Leave this woman alone . A human life always comes first ....","commenter_a":"I disagree raising children is a great responsibility and absolutely no one is perfect that is why we have axcidents. The zoo done what had to be done at the time they were not aware that a child could get into the cage or I'm sure it would have been fixed","post_message":"Cincinnati Zoo keepers had no choice but to kill a gorilla that might have harmed a small child that somehow got into its enclosure.  But the Internet has been lit aflame by animal lovers furious at the parents for allowing the situation to happen.  They’ve reportedly received death threats and demands that they be prosecuted.     But animal expert and TV host Jeff Corwin points out that it’s nothing new.  One study showed that 42% of deaths and injuries from captive tiger attacks involved visitors, many of them kids, and not zoo keepers.  He has an important message for all zoo visitors, especially parents:    “When you go to these places, the zoo is not your babysitter. You have a responsibility.”   I wonder if our constant immersion in TV, movies and virtual reality is making people forget how to behave in “real” reality. The same obliviousness that allows people to yak on cell phones in Broadway theaters just as if they’re sitting at home in front of their TVs is also leading them to assume that real zoo animals are no more dangerous than those in a video game.  In real reality, you don’t get to press the Reset button for an endless number of lives.        Read the full article for some possibly life-saving tips for your next real trip to the real zoo."},{"comment_id":"633906553463617","commenter_b":"Bitch got booooooom roasted!","commenter_a":"Gladys Bernieeeee","post_message":"Bernie Sanders: \"Do you think that if your family had not made hundreds of millions of dollars of contributions to the Republican Party, that you would be sitting here today?\""},{"comment_id":"10152720795558717","commenter_b":"According to the article, the mother actually administered cancer meds into the girl, as well as a feeding tube. That's where the endangering comes in.","commenter_a":"How is this lie endangering a child? I don't get it. I don't really know the story so I can't really say. Just going on headlines here.","post_message":"An Iowa woman who lied about her daughter's cancer diagnosis won't serve any time in prison for endangering the life of her child: @webpagelink"},{"comment_id":"10153203354164071","commenter_b":"I also voted for Romney and would do it again. The Presidency was 'stolen' from him.","commenter_a":"Vice President Romney","post_message":"Mitt Romney just unloaded on President Barack Obama's foreign-policy legacy."},{"comment_id":"10153515991569087","commenter_b":"Good. Get ridnof all these terrorists and their little terrors. Stay the hell out of America.","commenter_a":"That's real leadership So what's best for America, and not worry about pissing the liberals America come first, even above our bickering","post_message":"“I’m wondering if you would be able to look at [Syrian refugee children] in the face and tell them that they’re not allowed to go to school [here],” a voter asked Donald J. Trump. \"I can look in their face and say, ‘You can’t come here,’” Trump replied to applause."},{"comment_id":"1231532310220572","commenter_b":"And male or not, you're a cunt","commenter_a":"The dirtbag can pick anyone he wants, Congress has no obligation to endorse the fascist's choice. Speaking of the Constitution. GOP won't be re-elected if they pass any nominee appointed by Ovomit.","post_message":"BOOM!"}]
