[{"comment_id":"10156311109050354","commenter_b":"FUCK THEM.","commenter_a":"Another attack on the First Admenent","post_message":"\"You’re taking my rights. You’re taking what I am. My roots run Southern.”"},{"comment_id":"409554185871204","commenter_b":"Like we could depopulate people that breed like rats.","commenter_a":"Depopulate Mexico is the name of the game. Guess who benefits?","post_message":"The case of the 43 missing students in Mexico has galvanized discussion and efforts to locate thousands of others who remain missing."},{"comment_id":"896920230364507","commenter_b":"Never mix hillerie with religion, she's a sinner !","commenter_a":"Love has no bias, gender, race or labels. First Corinthians chapter 13.","post_message":"\"I was thrilled when you recently urged the Supreme Court to rule in favor of marriage equality. I was like 'That’s our gal.'\"—Mike Yowell, having coffee with Hillary in Council Bluffs, Iowa"},{"comment_id":"10153951989588701","commenter_b":"Is not like police had other things to do","commenter_a":"Seriously a 38 year old man. Grow up","post_message":"The Camas Police Department said every available officer responded to the scene and canvassed the neighborhood looking for a suspect that didn't even exist."},{"comment_id":"939244866171766","commenter_b":"The woman who jumped the young lady works as a loan officer for Bank of America. I guess she still has a job . Tyler thanks , it appears that in many of the comments throughout this post only one race was involved in \" trespassing\".","commenter_a":"Pool passes!!!!! I saw another comment somewhere else from an actual member at the pool. This was a members (HOA) only pool where there WAS several BLACK members and was present at the time. There was a private pool party going on where the DJ that was hired sent out a tweet about was he was doing. The pool was swarmed by kids from another neighborhood with no pass and uninvited. Which is technically \"trespassing\". They was asked to leave and started a fight in which the cops was called. The police had made several requests to leave with no luck. This girl ( if you watch the full video) was asked to leave several times and told the officer \" F-YOU\" and that's when the officer grabbed her. First off she and the rest was trespassing and second refused to leave when asked. @webpagelink","post_message":"A young woman who attended the McKinney pool party gives her explanation for \"how it all began.\" Watch the full interview here: @webpagelink"},{"comment_id":"907187719304084","commenter_b":"Nope. She shouldn't.","commenter_a":"She shouldn't have to apologize. *kanye shrug* Jay","post_message":"Lindsay Lohan Apologizes For Using The N-Word On Social Media While Referencing New Kanye Song"},{"comment_id":"1275439085806772","commenter_b":"Hopefully they'll rule it what it is, UNCONSTITUTIONAL and they can send all of the ILLEGALS back to where they came from. I don't know what it is about Liberals not understanding the concept of the word ILLEGAL! Maybe some of these Bleeding Heart Liberals that want these ILLEGALS here so badly will open up their checkbooks and homes to feed house and clothe these illegals. Oh wait, that's just wishful thinking...Liberals can't do anything without other peoples money.","commenter_a":"Sick of his abuse of the executive order. Be gone loser !!","post_message":""}]
