[{"comment_id":"603875656469680","commenter_b":"Get rid of her.","commenter_a":"Down with Miley and her shit. I remember when I was young and knew everything. If we all boycott her maybe she will have time to reflect on what she said in the past.","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"10153707738441680","commenter_b":"Pathological liar","commenter_a":"When I read these hate filled comments I want to cry. All this hate for a person you do not know and neither do I. I just know that I read bills and reports . I try to see what you all say about Hillary but I just do not see it. I am educated And I am a women I also know if all that is said about her is true men she has defeated would have locked her up a long time ago She is not perfect has she made mistakes sure Haven't we all. I will cont to listen and research and vote for who is best for my children and grandchildren That vote will go to Hillary","post_message":"Hillary Clinton: 'Whatever party you belong to, or if you belong to no party at all, if you share these beliefs, this is your campaign.'"},{"comment_id":"10153087285766491","commenter_b":"Hilarious female!","commenter_a":"Stop talking about her. Shes not funny get over it. Stop trying to make her famous by shoving her down our throats","post_message":"Interviewers, beware: do not mess with Amy Schumer."},{"comment_id":"10154190789236336","commenter_b":"This is so exaggerated. I bet this was seen as an opportunity and she had someone else bruise her. She did not almost go down and showed no pain or upset on the video. She also shouldn't have approached Trump like that in the crowd. His life has been threatened so someone would have pushed her back. Maybe she should stay home. Also it sounds like this is her M.O","commenter_a":"Too bad...she wasn't in ANY way hurt...she's shooting for her 15 minutes of fame...","post_message":"'We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,' Katie Pavlich said. 'This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.'"},{"comment_id":"10153404039272293","commenter_b":"'@username police kill blacks at a rate disproportionate to their total percentage of the population an assertion supported by The Guardian statistics. Police killed almost five black people per every million black residents of the U.S., compared with about 2 per million for both white and hispanic victims. @webpagelink","commenter_a":"Tamir was a 12 year old boy. TWELVE!!!","post_message":"'I saw the weapon in his hand coming out of his waistband,' one officer wrote in his statement. 'The threat to my partner and myself was real and active.'"},{"comment_id":"10153641975856234","commenter_b":"I don't know if it is objective or not. Some day we may find a genetic marker for transgendered people. In the mean time, you can travel to a state where you can find a chick with a dick to stand next to you as you pee.","commenter_a":"Interesting that the states with the lowest tax rates are places where I would NEVER want to live. I guess you really do get what you pay for.","post_message":"State and local taxes in the Garden State were 12.2 percent of income. See how that compares to other states."},{"comment_id":"1210507815635913","commenter_b":"No cop killers are by definition an individual who's killed a cop..An old lady with no criminal pass and bake cookies for the local fire department can be a cop killer if ever she kills a cop doesn't make her a thug though.You see by definition there not the same you can be one and not the other.","commenter_a":"RIP, condolences to his family. And, NBC would you please refer to him as a police officer and not a 'Cop'? That's disrespectful","post_message":"Officer Gregory Alia was shot and killed after responding to a call about a suspicious person inside a shopping mall."}]
