[{"comment_id":"1071556556193998","commenter_b":"So true , I love this","commenter_a":"It all starts within by releasing denial, accepting where we are, and then seeing what opportunities are there. <3","post_message":""},{"comment_id":"10153535805923352","commenter_b":"You dumb wet back bitch and @username you ugly bitch go ahead. Pink monkey bitch","commenter_a":"He is though. What happened to \"freedom of speech\"? Oh it's selective I see.","post_message":"Female middle school teacher forced to resign after telling students that President Obama is a ‘Muslim baby killer’"},{"comment_id":"423132557811339","commenter_b":"Al Sharpton is a racist !","commenter_a":"Afraid this will spread as it has in the past.","post_message":"Could this violence against police spread around the country?"},{"comment_id":"10155514073390354","commenter_b":"Oh darn...NOT!!! Good riddance!! Hopes they ALL go up in flames. Enjoy those virgins, buttholes!!!","commenter_a":"Another dead terrorist, WOO HOO!!! KILL THEM ALL, LET GOD SORT THEM OUT!","post_message":"Height: 5'11\" Chest: 40\" Waist: 32 Currently Not Available for Bookings"},{"comment_id":"10153070826933701","commenter_b":"hes a fag it","commenter_a":"Nope!","post_message":"Heisman winner Marcus Mariota on the loss of wide receiver Darren Carrington to a failed drug test: \"We'll get another guy that's ready to go.\""},{"comment_id":"10154827367754197","commenter_b":"@username your a tart.","commenter_a":"Trump's ignorance is astounding. He should stop tweeting narcissistic nonsense and start reading the security briefings. We are the laughing stock of the world now that we elected a buffoon as president. God help us.","post_message":"Donald J. Trump is very upset with the United Nations after a recent vote. Read his comments on WFSB.com and the Channel 3 app. Then, tell us your thoughts on the statements by the president-elect."},{"comment_id":"10153618625791130","commenter_b":"How many more will emerge before she is 30? She is off to an excellent start!","commenter_a":"Sarah Palin has banned all Liberals from entering Bristol Palin","post_message":"Sarah Palin used some very creative English in her Donald J. Trump endorsement."}]
