[{"comment_id":"950451268383973","commenter_b":"I look forward to never looking at this Obummer again!","commenter_a":"Why is it everybody is out to get Trump? It seems to me they are so scared he may get President they have stooped to the lowest ways to destroy him....it just wants me to vote for him more because they are scared he will and the fact is it will ruin the political garbage at the white house who are trying to bring our country down.....I want our Country back and the Constitution back to what it was meant to be!!!!!","post_message":"“Good luck with that…We’ve got serious problems here.” President Barack Obama addressed Donald J. Trump's plans to build a wall and get Mexico to pay for it."},{"comment_id":"971601666302233","commenter_b":"It seems like all the intelligent women with morals have been fired... This show needs to be cancelled!","commenter_a":"Yes","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"10153577383622061","commenter_b":"she is an african american woman and can clearly see the hand on the jacket is a white persons hand. Open your eyes","commenter_a":"This has to be photo shopped. The woman has 3 hands. 2 on her face and 1 on his coat. My father was a fireman too, but would not have been allowed to pull a stunt like this!","post_message":"WATCH: Firefighter goes to great heights, literally, to make one stunningly beautiful proposal!"},{"comment_id":"1019443361412045","commenter_b":"Let's use it to build the fuckin wall","commenter_a":"Twice as much as reported. The other half is getting sold back by corrupt DEA agents. Border Patrol did their job, now DEA will make it tougher for them.","post_message":"Guess high, REAL high."},{"comment_id":"1250130898332398","commenter_b":"Fuck off bitch!","commenter_a":"I voted for Bernie. I'm voting for whoever stops that White Nationalist Donald Trump. If Bernie is voting Hillary, so am I.","post_message":"Bernie just put the nail in the coffin for the Trump campaign. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152787741471130","commenter_b":"And please don't reproduce a$$hole!","commenter_a":"This makes my stomach churn. These poor dogs would have been better off on the streets!!!","post_message":"\"They were living in their feces, urine and there was nothing there.\""},{"comment_id":"699619480228630","commenter_b":"@username RE-MOVE HEAD FROM ASS","commenter_a":"....and, Obama let Putin become the Hero of this War on ISIS!","post_message":"Russia is relentless bombing ISIS until they are completely destroyed. We are fully behind them. This is what needs to happen. Can we get 75,000 'LIKES' for Russia?"}]
