[{"comment_id":"10153239420904087","commenter_b":"WooHoo - I'm stupid as hell says Trumpette fool hoping to be wife #4.","commenter_a":"Woohooo! #Trump2016","post_message":"“I think Donald J. Trump changed the opinions of the African-American pastors that were in the room,” Pastor Darrell Scott told CBN News. “They saw a side of him outside of the media depiction, and that they would give strong consideration in regards to supporting his presidency.\""},{"comment_id":"1695518967374741","commenter_b":"NOW do you understand why Ross Perot ran as an Independent in 1992? The parties are both corrupt and they control who gets elected, no matter how many citizen vote.","commenter_a":"All I'm hearing is boohoo I lost so now I have to blame it on something else. If your as smart as you claim you would have known the rules, moron! And look at all your inbred supporters, they have no idea how the laws or rules work either! Go Cruz!!!","post_message":"At least in Colorado they didn’t even pretend to care about what the voters think!"},{"comment_id":"1596643573967911","commenter_b":"She is a liar and should be behind bars!","commenter_a":"#Sethrich","post_message":"WATCH LIVE: Hillary Clinton reveals economic plan in Michigan — how will it differ from Donald J. Trump's?"},{"comment_id":"1143371025741432","commenter_b":"Can't stand this big ass getto fat bitch","commenter_a":"Illuminati whore","post_message":"Obama declared her a great role model for children, now Beyonce has released a sickening video.  But the violence and feminism in it isn't the worst part. Look who actually shows up in the video with her..."},{"comment_id":"10152987583472014","commenter_b":"If you don't want the responsibility of a baby, get yourself fixed or some type of contraceptive","commenter_a":"Punch her in the face","post_message":"A teen mother says she didn't know she was pregnant before delivering a baby girl, but court documents detail chilling details of her searching the Internet for ways to induce a miscarriage while 38 weeks pregnant."},{"comment_id":"10153122769748145","commenter_b":"Vote the hurricanes out!","commenter_a":"Already started ;)","post_message":"Today is the start of the 2015 Hurricane Season! Are you prepared if a big storm hits Central Florida? #WFTV Check out these must-have supplies: @webpagelink"},{"comment_id":"1003302019710656","commenter_b":"Sure let them get married. Let them suffer like the rest of the world. Oh and wait till they start getting divorced! HAHAHHAHHAHAHA Your welcome ass holes!! HAHAHHAHHAHHAHAHHAHHAH","commenter_a":"It’s My Right To Discriminate Against Republicans Since I Do Not Agree With Their Lifestyle Many conservatives who oppose equal rights for homosexuals do so based on “religious principles.” It’s a defense for ignorance that I always find amusing considering how many “biblical laws” are completely ignored because it would be almost impossible to abide by them. So, I've decided to use this right-wing ignorance to my benefit; I've decided that it’s my right to claim “religious freedom” to discriminate against many Republicans since I do not believe in the lifestyle choice they've made to be bigots. Republican and/or a bigot is a choice After all, in a state such an Indiana (which just legalized the right for citizens to discriminate against people with whom they disagree based upon their religious beliefs), shouldn't people in that state (or any other state with similar laws) then be allowed to discriminate against ...","post_message":"With the arguments for marriage equality heating up soon at the Supreme Court, TakePart.com has a handy \"here's what's up\" article full of background, context, and facts. Yay, learning!"}]
