[{"comment_id":"464203950436852","commenter_b":"No way. Let the Muslims get over it. If you don't like it here go back where you came from.","commenter_a":"We should shoot them with bullets dipped in bacon!","post_message":"Should The Words 'Bacon', 'Pork', 'Sausage' Be Banned? Comment 'yes' or 'no'."},{"comment_id":"10153030669318961","commenter_b":"Yeah, sure pal.","commenter_a":"Mother Jones - HAHAHAHA. That's about as credible as Mother Goose, in other words - a fairy tale.","post_message":"If you have time to read an article today, make it this one on the true costs of gun violence"},{"comment_id":"576566162546923","commenter_b":"I'm going to keep flossing every day. Brush three times, floss once. Usually more but oh well. When you get ten cavities per year, you do whatever could give you hope","commenter_a":"The AP can't get facts right about news events, so we should trust them about flossing?","post_message":""},{"comment_id":"711583065610489","commenter_b":"He hates America and the American people, why cant people see that...","commenter_a":"He is a Traitor and Muslim.","post_message":""},{"comment_id":"10154422800373132","commenter_b":"These women are smart?? Lol OK.","commenter_a":"This show is a flake need to be cancel asap.","post_message":"That's quite the family heirloom, Kim Kardashian West. (via PeopleStyle)"},{"comment_id":"600522876804958","commenter_b":"His girls should have to take the test and eat the same crap that Michelle thinks should be served at our schools. They are no more important than my kids are regardless who they are.","commenter_a":"Go ahead you slime bag daddy you","post_message":"Obama just waved this law for his daughters just because he can. No one is above the law. He is a criminal. Do you agree Obama is not above the law?"},{"comment_id":"1056310464431070","commenter_b":"AND THERE WILL BE MORE THANKS TO OBAMA AND CONGRESS","commenter_a":"Just kill him","post_message":"BREAKING: ACTUAL ISIS FIGHTER ARRESTED IN SACRAMENTO: Aws Mohamed Younis Al-Jayab Lied To Immigration Authorities ISIS is in the USA! We need TRUMP 2016 to eradicate them! @webpagelink"}]
