[{"comment_id":"10153763759623812","commenter_b":"Girl, shut up.","commenter_a":"Relax dad, she's not a teen, stupid and sad comment - life is about friends, why confuse a happy loving kid, who loves boys too as friends...","post_message":"This 2-year-old girl is crushed to hear that she can’t have a boyfriend, insists to her dad that she has someone special in her life. Her conviction is intense! @webpagelink"},{"comment_id":"10152878720003645","commenter_b":"Great american baboons","commenter_a":"There is something inherently wrong in the black community to promote this type of group violence. But then will cry racism at a drop of a hat...it is these very images that create the negative image of blacks. We are our own worst enemies not the \"white man\"...","post_message":" tenacity of placing something on video to shoot a young lady being beat down by six or seven young women is ludicrous in our community."},{"comment_id":"10153272244859071","commenter_b":"Women RUN the World.... All Hail the Queen....","commenter_a":"Ana Clara Mello","post_message":"Kurdish fighters have said ISIS is \"afraid of girls.\""},{"comment_id":"1098620013533448","commenter_b":"This is AMERICA AND AMERICANS should be able to fly OUR FLAG any time and any place in America we want to and if some foreigners don't like it then they can get the hell out of America now.","commenter_a":"The school should be ashamed. This is America and the flag is the symbol of freedom. Whoever is the leader of this school should be fired and never allowed to work in the school system again","post_message":"EPIC! The School Said The Flags Off Your Truck, His Response Set Em Straight (VIDEO) This is America! Don't like it then leave!"},{"comment_id":"10153505176486051","commenter_b":"I disagree with every thing she says, such a liar","commenter_a":"I hope she does get the dem. nom. that way repub. are guaranteed a win.","post_message":"Hillary Clinton believes Americans should wholeheartedly reject Trump's rhetoric on Muslims and immigrants. Do you agree or disagree?"},{"comment_id":"1125723030801501","commenter_b":"Lord, she's a vile woman.","commenter_a":"Does anyone have the balls to fire this woman for not doing her job. FIRE HER!!!!!","post_message":"Seems Kim Davis may be going back to jail..."},{"comment_id":"10154233852123445","commenter_b":"Eww shut up bitch i do but ive seen u more than her 👊😛","commenter_a":"@username @username @username @username haha hell yea i do !😂😂😂😂","post_message":""}]
