[{"comment_id":"10153363421176438","commenter_b":"Whore = prostitute. Whole other issue.","commenter_a":"yea its true...normal guys care and dont really want to settle down with a past whore","post_message":"Trainwreck says straight men care about their girlfriends’ “number.” Is that true?"},{"comment_id":"10154404205156130","commenter_b":"Holy crap, what a bunch of drama queens.","commenter_a":"Done","post_message":"It's a tiny gesture, but it speaks volumes."},{"comment_id":"10155052267050695","commenter_b":"This world was based on religious freedom I'm showing mine...","commenter_a":"Good but killing him is no better than taking the life of any one else... God will be his final judge","post_message":"Nine church members were shot and killed at Emanuel AME in downtown Charleston in 2015."},{"comment_id":"10152608268042452","commenter_b":"I know right she's thick not plus size","commenter_a":"She doesn't look so plus to some of us who are","post_message":"There's a big change coming to Sports Illustrated's swimsuit edition. For the first time, the magazine will feature a plus-sized model on its pages.  Model Ashley Graham will appear in a campaign for 'Swimsuits For All', heralding a new chapter in the magazine's famous swimsuit issue.  So what do you think about a plus-sized model gracing the pages of SI? A sneak peek tonight at 11 from ABC7 Eyewitness News. abc7.la/1zifFNK"},{"comment_id":"10153719642089091","commenter_b":"'@username so you've gotten an infection from using a public restroom ?","commenter_a":"Why would you let your 8 year old daughter go to a public bathroom by herself??!! Smdh.","post_message":"Thank goodness for the customers and staff members who helped rescue the 8-year-old after her mother heard her scream. Police say the man was caught carrying the unconscious girl into a bathroom stall."},{"comment_id":"10153801731062144","commenter_b":"'@username I know that every pedophile must have a defense attorney, but I don't want anyone that defended one as a president! I'd quit the freakin job, go hungry, and sleep in my car before I defend a pedophile! No real woman would do what she has done!","commenter_a":"How about talking about Hillary's ethics? Imagine your little girl was brutally raped and beaten, and you had to sit in a court room and listen to Hillary attack your child to get a rapist off. Would you vote for Hillary for president? Yes? Then you must be some kind of stupid. Go Bernie!","post_message":"Democrats just released a devastating ad against Donald Trump."},{"comment_id":"1571937346447279","commenter_b":"Get a new woman then!","commenter_a":"In the singing voice of Brad Paisley: Im gonna miss her.... I love my husband AND my guns!","post_message":"'Sex strike'  WATCH:"}]
