[{"comment_id":"10153693446321037","commenter_b":"Women on women issues unless it's Bills sexual affairs then she doesn't care.","commenter_a":"Maybe she should have first looked to tackle it at the White House when she was living there.","post_message":"Hillary Clinton is the first 2016 presidential contender to address the issue of campus sexual assault on the campaign trail, but she may not be alone for long."},{"comment_id":"1811602825768086","commenter_b":"@username they voted for TRUMP because Hillary is lying criminal that should be locked up","commenter_a":"not surprising.... the KKK IS a dem organization so it makes perfect sense that they would be able to get the uniforms.","post_message":""},{"comment_id":"546896738832150","commenter_b":"Don't worry just go vote under a dead guys name or pick up a few illegals and get them to vote too. What democrats do all the time .","commenter_a":"I accidentally vote for Cain, so the four percent is a little high.","post_message":"POLL: Who won the VP debate?"},{"comment_id":"10153509361000796","commenter_b":"GO GTFOH get GONE. WE don't want you !!!!","commenter_a":"A lot of \"thinking\" republicans are going to switch to hillary to keep him out of office... they feel she will be far less dangerous and damaging...","post_message":"Across the country, Republicans are coming to terms with presumptive presidential nominee Donald Trump, and prominent Maine party members began to rally around him yesterday after his last two challengers, Texas Sen. Ted Cruz and Ohio Gov. John Kasich, dropped out."},{"comment_id":"10153461006671717","commenter_b":"Welp since all the lesbians I see on here basically think its hilarious, and a silly hearted statement meant with no hate or bias I guess you're just one of those super bitchy \" right to be offended\" people that wake up everyday looking for a reason to be Cunty.","commenter_a":"I'm not buying it. I don't think the joke was just in good humor. There's enough language here to clearly see that he was being hateful towards the LGBT community. After all, he did say the word \"lesbian\". Isn't that enough to ban him and boycott him from everything? Shouldn't we be calling him hateful names for his aweful transgretions?","post_message":"Funny or die?"},{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"},{"comment_id":"10153275307228132","commenter_b":"You're a total dick!!!","commenter_a":"Junkie","post_message":"\"So funny, honest and loving. We lost a great one today.\""}]
