[{"comment_id":"10153661042541523","commenter_b":"You dumb white bitch!! THE SAME WAY YOU CELEBRATED CHRIS FAIRLY, AMY WINEHOUSE, AND THE REST OF THE HEROIN ADDICTS IN YOUR Neighborhoods......I will be so glad when your evil race is nearly extinct! Take your evil back to the caves of Europe!!!!","commenter_a":"RIDICULOUS!! The freak had mental issues and died of an overdose- why would a church celebrate this idiot??","post_message":"A Tulsa church’s tribute to Prince is going viral."},{"comment_id":"991442284225448","commenter_b":"Matthew Acheron","commenter_a":"Daniel Kulick","post_message":"Nintendo introduces Linkle, a female version of The Legend of Zelda's Link."},{"comment_id":"10153138669086378","commenter_b":"She gets off on it","commenter_a":"Weird","post_message":"BREASTFEEDING FRIEND'S SON: A photo of a Bala Cynwyd woman breastfeeding not only her own son, but her friend's son, is generating controversy.  See more about her decision, and let us know what YOU think in the comments below:"},{"comment_id":"596204130539541","commenter_b":"@username I think most people are okay with accepting refugees. PROVIDED, that they become members of the country they decide to make home. Non of this lets make Sharia law zones like back home bollocks. How do you separate the good from bad? Only allow families in? That hardly sounds fair. Just be aware that when you accept them in you accept responsibility for them. Anyone raped. Any bars burned down. Any cartoonists shot. You are responsible for those by knowingly understanding some of the bad is coming with those who need your countries protection.","commenter_a":"The assumption that these guys are all refugees is really telling. *Open your eyes a bit, these fuckers are homegrown. Isis is betting on you hating and attacking refugees to add fuel to their fire. You're all being played.","post_message":"Some experts say it's only a matter of time before the heart of the European Union sees tragedy."},{"comment_id":"836200936476160","commenter_b":"Don't think ANY woman could run this country as well as a man could.","commenter_a":"Bring on mashed potatoe legs","post_message":"“I’m ready for Hillary, are you? Are you coming?”  - Sarah Palin"},{"comment_id":"638502853006960","commenter_b":"I love this picture, can you see michael adams apple. Women do not have one.","commenter_a":"I wonder if she refers to her own mother that way. Btw, the mother who also lives in the White House at our expense.","post_message":"Michelle Obama just insulted mothers everywhere... You'll be furious.  We're sick and tired of hearing about her. Let's make her go away forever.  'LIKE' if we should kick Michelle out of the White House!"},{"comment_id":"10153411890906167","commenter_b":"Nah. Satan and the Mrs, would have had an abortion before bringing this creep into the world. ;)","commenter_a":"the son of satan.","post_message":"Troy Newman's views are so extreme that, as The New York Times reported in 2015, Australia cancelled Newman's visa over \"concerns that he might encourage violence against abortion providers or women seeking the procedures.\""}]
