[{"comment_id":"10152674104515667","commenter_b":"Leave her alone!","commenter_a":"She's not bald, she just had her hair pulled back. But even if she was bald she still looks beautiful.","post_message":"ICYMI: Michelle Obama looked a bit different on Wednesday's episode of \"Jeopardy!\""},{"comment_id":"10152515657266717","commenter_b":"Not really applicable but you forgot \"love\" ;)","commenter_a":"Game, Set, Match. Give it up.","post_message":"Join our mailing list for a daily news recap: lgbtqn.at/mail Follow us on Twitter: lgbtqn.at/tw"},{"comment_id":"10154069182538128","commenter_b":"You're disgusting!","commenter_a":"Disgusting crap Chris Rock!!","post_message":"Chris Rock didn’t waste any time diving into the controversy over the lack of diversity at this year’s Academy Awards."},{"comment_id":"10153944005826336","commenter_b":"@username Your cocksucking grandma needs to read the bible!!","commenter_a":"What is this world coming to?!","post_message":"Just a few weeks before Christmas, Labor Commissioner Brad Avakian wiped out the Klein family’s bank accounts – taking nearly $7,000."},{"comment_id":"10152765303355950","commenter_b":"@username, \"Ridiculous comment. The complete opposite of what we should take away from this as feminists. Imagine what would happen if all of the barricades were removed & women could advance the way men do. Even more women would be standing where she is.\" Okay, so support your putative position with evidence, versus just asserting it like your job is done.","commenter_a":"Great! Now feminists can see that it is by working hard, getting really lucky, and not giving up that we are best equipped to fulfill our dreams, rather than trying to reengineer society... like the whole thing is just broken. Even the grass can get through concrete... with enough time and the right conditions.","post_message":"At 19 years old, Elizabeth Holmes dropped out of college. She had a little money and a big idea. More than a decade later, she became the youngest female billionaire in the world."},{"comment_id":"10153354132661320","commenter_b":"Religion is fake!","commenter_a":"He's a fraud sorry","post_message":"\"I can dream as long as I want to. I can believe God as long as I want to. If I wanna believe God for a $65 million plane, you cannot stop me.\" Pastor Creflo Dollar is blasting critics who took him to task for wanting a fancy private jet. Read more: @webpagelink"},{"comment_id":"1178341715558004","commenter_b":"LOCK HER UP!","commenter_a":"You hate hillary (so do i) but you pick a man that can't beat hillary.. we've got big problems come election time.","post_message":"Donald J. Trump, Sen. Joni Ernst, and others campaign in Iowa at the Iowa senator's second annual Roast and Ride."}]
