[{"comment_id":"10156410831030725","commenter_b":"U not Gona win ginger bread","commenter_a":"Letssss go !!!!!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"},{"comment_id":"968036809901222","commenter_b":"Take the criminals away first","commenter_a":"FAST & FURIOUS ???","post_message":"This is one of those times where a picture is worth a 1,000 words!"},{"comment_id":"1146246835410774","commenter_b":"Yes is no and no is no! Stupid males! Raaarg","commenter_a":"Dennis Kiil Andersen Mats Hellan Tobias Berntsen @username Magnus Nadheim sykt at denne artikkelen faktisk er legit og ikke laget for tull","post_message":"It's not just 'no means no' and 'yes means yes.'"},{"comment_id":"10153981552219641","commenter_b":"I could care less how racist this is, but Belgium needs to deport every last Radical Muslim!","commenter_a":"Jai shri krishna Namaste.ji","post_message":"'We will do whatever is necessary to support our friend and ally Belgium...': U.S. President Barack Obama comments on Brussels terror attacks. @webpagelink"},{"comment_id":"10152947380749099","commenter_b":"Yes, because women never get pregnant on birth control....","commenter_a":"If women would practice birth control then these horrible things wouldn't happen. Bless their little souls. May God have them in his embrace.","post_message":"A man found two dead fetuses wrapped in a blanket on the street @webpagelink"},{"comment_id":"824468191027094","commenter_b":"she's so ignorant. Bet she doesn't even know where her clit is","commenter_a":"I Am probably going to make a lot of women mad over this. And yes. I happily voted Trump! My personal beliefs is that our home, church, and country should be the concerns of a MAN. Yes. There are not as many MEN around as there used to be. But my beliefs are that a woman is to further see that the teachings of the man, the guidance of the man, the protections of the man are done. And done correctly. I was very impressed with her work! She done exactly as she should! A very strong willed educated intelligent woman! He obviously has a lot of faith in her! Smart doing so also! Yet as we are saying, those on the left won't say a bit of praise to her. Smh","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"198765370606154","commenter_b":"Bye Bye!","commenter_a":"Also you suck at acting","post_message":"George Lopez is still angry about the outcome of the presidential election. Let's make 200,000 #SHARES if you Never want to see Lopez Again !!!!"}]
