[{"comment_id":"692872167570028","commenter_b":"It's NOT A WOMAN!!","commenter_a":"Moron nuts ops HeShe got balls . Sick , sick , sick . Woman of the year ? Bull crap ,disgusting , insulting to all women in the world . Hmmmmm maybe he should be castrated then but he will still be the same , a mangoman hehehe .","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"10153594866289641","commenter_b":"Ignore these followers of ayesha exploiter. their book says its good to drink camel piss and have sex with a goat.. dont mind these illegitimates children of arab savages","commenter_a":"WTF.....I know so many Hindus who drink cow's milk. ...n why shouldn't they eat beef. ...totally nonsense. .","post_message":"In Hinduism, cows are deemed sacred and their killing a sin."},{"comment_id":"1607625002874515","commenter_b":"Whole Lotta good talking to your imaginary friend in the sky did her...","commenter_a":"Man, I was on Atlantic and Nostrand earlier this year, when Girl must've have been under the influence of this mess dropped her pants and ran across Atlantic avenue into on coming traffic. It wasn't no one but the angels that carried her to the other side of that street... Idk what jumped in my soul, but all I could immediately do was pray over her.","post_message":"Some are calling it 'Zombieland.' Bed-Stuy in Brooklyn is where 33 people were seen wandering around Tuesday, in what police say appear to be K2 overdoses. This video shows some of those who were treated."},{"comment_id":"1509437802422806","commenter_b":"All you ladies with your agendas should probably put it to ACTUAL LEGITIMATE use and aim it where it belongs: at your incoming government. I for one, have never just gone around grabbing random pussy or publicly proclaimed that I wanna fuck my own offspring. Actions speak so much louder than your weak ass words. Pick the RIGHT battle, for once!","commenter_a":"Call me crazy, but this dudes most impressive moments happened in a wheelchair on a kids show. So...he's banging an old whore. Whoopity-Do! I don't get and never have gotten the hype. Lol","post_message":"Drake won 2016."},{"comment_id":"10156899433320354","commenter_b":"If you're a f****** illegal mexican, get the hell out!","commenter_a":"Illegal immigrants built part of this country cause people like Trumpet hired them! All of a sudden they're bad? Screw you all! Im proud to be a fucking Mexican!","post_message":"“[O]ne party has made it okay to say you can hate people, you can spit on them.” What would you like to tell Julieta Garibay? WATCH:"},{"comment_id":"10155216559835603","commenter_b":"I believe if you follow the rules it shouldn't matter if they have quotas.","commenter_a":"I never worked where there was a \"quota\". I could write as many as I felt necessary.","post_message":"Do you believe some police departments have ticket quotas? One police officer tells us tonight they absolutely do and he has the paperwork to prove it! News 4 Investigates this shady system: @webpagelink"},{"comment_id":"10152902121277098","commenter_b":"Do you know any white girls from the sticks? Smh!","commenter_a":"White girls from the sticks are certainly the most psychotic!","post_message":""}]
