[{"comment_id":"10153316443579170","commenter_b":"God, she is a worthless person!","commenter_a":"Sicker than sick.","post_message":"All you Bible believers better change the way you think! The queen-in-waiting has spoken!"},{"comment_id":"10153729819244753","commenter_b":"if miley cyrus is taking her place i will not watch the voice no more, she is trash","commenter_a":"I will no longer watch he voice with Miley Cyrus on it.","post_message":"Christina Aguilera will not return to The Voice for season 11, and ever since the announcement was made official, rumors have swirled, claiming the “Genie In A Bottle” singer’s alleged feud with Gwen Stefani and Blake Shelton may be to blame. In a recent report, it was alleged that Christina Aguilera’s feud with her co-stars had gotten so ugly that she had actually enlisted Miranda Lambert, the ex-wife of Shelton, to help her get back at them. “[Christina Aguilera’s] feud with Stefani is... @webpagelink"},{"comment_id":"10152849250926770","commenter_b":"Saul Alinsky a communist socialist died about 43 years ago, but his writings influenced those in political control of our nation today. Recall that Hillary Clinton did her college thesis on his writings and Barack Hussein Obama writes about him in his books. Died: June 12, 1972, Carmel-by-the-Sea, Ca Education: University of Chicago Spouse: Irene Alinsky. Books: Rules for Liberal Radicals Reveille for Radicals Anyone out there think that this stuff isn't happening today in the U.S. ? All eight rules are currently in play How to create a social state by Saul Alinsky There are eight levels of control that must be obtained before you are able to create a Liberal Socialist state. The first is the most important. 1) Healthcare : Control healthcare and you control the people. 2) Poverty : Increase the Poverty level as high as possible, poor people are easier to control and will not ...","commenter_a":"Maybe he was the main cause. Left himself out, didn't he.","post_message":"Excuse me?"},{"comment_id":"10152628059135667","commenter_b":"Dear Bill, are you having relations with that women?","commenter_a":"How can they release something they dont have.","post_message":"\"I want the public to see my email,\" Clinton tweeted."},{"comment_id":"10153697709133984","commenter_b":"He'd never make it to prison if that was my daughter or granddaughter. But since he will hopefully go to prison, its a shame someone never showed him an illustration on a blackboard about the size of your asshole before prison and the size it is when/if you get out. Maybe he would then have had sense enough not to rape a child. When he goes to prison he's going to find out what real rape is like...good.","commenter_a":"Castration sounds good to me. He wouldn't do it again","post_message":"This sick punk raped a young girl and admitted to it... but the disgusting thing is his absurd excuse. Our country is in deep trouble and this proves it... this little girl did nothing to deserve this."},{"comment_id":"10153425462103271","commenter_b":"When is she to be put in a mental institution for the rest of her life, if I had a family member killed I would come after her, she is probably in hiding by now. If a woman wants an abortion THAT IS HER RIGHT TO DO SO.","commenter_a":"This is how far out these repubs go to make themselves look good to their GOP base.","post_message":"WEIGH IN: In a Facebook post, JoAnn Windholz calls Planned Parenthood a \"culprit\" and \"the true instigator.\" Read the full statement. Your thoughts?"},{"comment_id":"10154953238254497","commenter_b":"Cthulhu. Keeping it super old school.","commenter_a":"@username Cthulhu or FSM?","post_message":" haste, before His Holiness is torn asunder by the dark horror."}]
