[{"comment_id":"970899619630870","commenter_b":"Deport ALL MUSLIMS everywhere!!!!!!!","commenter_a":"FULL CASTRATION!!!!!!!!","post_message":"Top Muslim Imam: \"We shall breed with Europeans to conquer their countries!\" (Video)"},{"comment_id":"876486519053475","commenter_b":"Lmao Andrea the slut","commenter_a":"Lmao. These hoodrats can have armpit hair all they want. They'll be single and starved for cock. Noone wants chewbaccagina.","post_message":"There's a viral discussion being had over sexism..."},{"comment_id":"480214172160463","commenter_b":"Angry old white woman, I wonder where her people came from? Hell?","commenter_a":"The old lady isn't smart enough to know another language.","post_message":"Portrait of a Donald Trump Supporter. (2015)"},{"comment_id":"10152612105311636","commenter_b":"Stupid women","commenter_a":"Because it causes serious mental health pronlems","post_message":"Remind us why this isn't legal in the UK again?  via Independent US"},{"comment_id":"1183433338419583","commenter_b":"@username Because they prefer her to Trump-- which is good.","commenter_a":"#HillaryClinton4President Bill Clinton's Presidency brought prosperity and economic stability leaving for the first time a projected surplus. George W Bush came along and reaped havoc on every financial sector, leaving millions losing their homes, Savings depleted and left America in the worst economic crisis since the great depression. Barack Obama won the Presidency and without any help from obstructionist Republicans, Obama saved America from another Depression and stabilized America's financial sectors. We need to Support and Vote Hillary Clinton for President of the United States to continue President Obama's Legacy and Policies, building on his successes and making America even greater than what it is. Republicans have been and continues to be America's Greatest Enemy! Twitter @sheriffali","post_message":"Bernie Sanders closes the gap slightly with Hillary Clinton this week following his victory in the Indiana."},{"comment_id":"667515520077863","commenter_b":"I hope she killed herself!","commenter_a":"Terrible","post_message":"This Texas mother and vocal gun advocate snapped and took the life of her own two children over a simple family argument after spending years criticizing Democrats for \"wanting to take her guns away\":  \"A family spat started inside the married couple’s Houston-area home and spiraled into gun violence that spilled out onto their street.  “It was a family argument that turned into a shooting,” Fort Bend County Sheriff Troy Nehls told the Houston Chronicle. “But we’re still trying to put the pieces together.”   Read more HERE: @webpagelink  Thanks to Point Counter Point."},{"comment_id":"10152726918051051","commenter_b":"She should really be charged with Involuntary Manslaughter...","commenter_a":"Some people should have no children Stupid ass how can she do that","post_message":"This woman left her 2 small kids alone to get her hair done. When she returned, there were firefighters everywhere."}]
