[{"comment_id":"10153312840067098","commenter_b":"My point is, YOU don't know what people do.","commenter_a":"How about we worry about our homeless vets and not other countries people.","post_message":"The results come amid a heated debate in the wake of the attacks in Paris..."},{"comment_id":"1392014810811452","commenter_b":"That is so inspiring.","commenter_a":" I despair, I remember that all through history the way of truth and love have always won. There have been tyrants and murderers, and for a time, they can seem invincible, but in the end, they always fall. Think of it--always. Mahatma Gandhi","post_message":"Just when you thought it couldn't get any worse!"},{"comment_id":"10153636855342426","commenter_b":"What a tragedy","commenter_a":"R.I.P. D'Marco you fought a good fight","post_message":"D'Marco Jackson passed away this morning. You may remember D'Marco from an inspirational speech he delivered last year at the Hermitage High School graduation.  “If I had to pick a singular piece of advice to give you all, I’d say this … do not let the realities of the past or the possibilities of the future negatively affect the peace, joy and happiness that the present has to offer,” he said.  Read more: @webpagelink"},{"comment_id":"10152920340851051","commenter_b":"What we can't stand u either ghetto bitch","commenter_a":"Sad part is my son is mixed with white......I wish I could do magic and make that part of him disappear.........cant stand white racist mtfhs","post_message":"This woman decided to break up a fight by taking out her gun and shooting into the crowd. The problem is, her son was in the crowd."},{"comment_id":"10153510448341130","commenter_b":"Because they turn away NO ONE. Because it cost a lot of money to give out free care. Or low income women can pay a small portion vs. going to a CLINIC where they want your soul before you get care. Many women are struggling to EAT. How long do you think they could do all that they do with out funds ?????????Gimme a break.","commenter_a":"Tell us something why a big corporation such as planned parenthood need my money?","post_message":"A big victory for Planned Parenthood."},{"comment_id":"1404176169614167","commenter_b":"We disgusted to look at you and your ugly ass fucking husband !!!!!","commenter_a":"Not sure who you are polling.. please tell me why democrats lost so big this election... because people were disgusted with her and her husband!!","post_message":"Michelle Obama continues to rank as one of America's most admired First Ladies. Do you admire her?"},{"comment_id":"10154645130189062","commenter_b":"Woman should be lucky for not being arrested ,for interfering with \"police business \".","commenter_a":"So he was a really nice guy she said. But, let's post this to social media to ensure really nice guy loses his job instead of giving him the opportunity to learn from his mistakes.","post_message":"\"The reason I pulled you over today...I just want to know, what's the emergency?\" said the woman."}]
