[{"comment_id":"10154092643775950","commenter_b":"FUCK OFF RACIST","commenter_a":"who cares, just get out","post_message":"What are Barack Obama's post-presidency plans? 'Take Michelle on vacation. Get some rest. Spend time with my girls and do some writing, do some thinking.' Watch more from his press conference in Peru: @webpagelink"},{"comment_id":"10154363011532908","commenter_b":"In America, the people are the government. We're a republic, where our elected officials are acting on our behalf. Otherwise, we're supposed to kick them out. Taxation is the idea that no one can amass keep lot of money without a central authority to provide the infrastructure to make wealth creation possible, or the security to make created wealth sustainable. No one gets rich by themselves, and the people who work to make the rich people rich, or to keep the rich people rich, deserve an infrastructure they can survive on, too. Taxation makes a society fair, stable, and full of opportunity.","commenter_a":"Bernie is not asking people to share. Sharing involves VOLUNTARILY giving away your possessions.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153882688775736","commenter_b":"Freedom of speech!!! Gotta love it!","commenter_a":"Performers are there to perform, and that's all we're paying for. I believe an audience member sharing their political views during a performance stands a good chance of being asked to leave. Why is it ok for them?","post_message":"A cast member responded to Trump's tweet, 'Conversation is not harassment sir. And I appreciate Mike Pence for stopping to listen.'"},{"comment_id":"1149152748439068","commenter_b":"Kegels engaged automatically","commenter_a":"not a big white shark, just a fox shark","post_message":"Just stay calm, nothing to be afraid of ..."},{"comment_id":"10152823501296130","commenter_b":"They're some weird people ..these should not reproduce so good for her weird ass","commenter_a":"I would rather marry for love than for desperations.......","post_message":"Taking matters into her own hands!"},{"comment_id":"10155052267050695","commenter_b":"This world was based on religious freedom I'm showing mine...","commenter_a":"Good but killing him is no better than taking the life of any one else... God will be his final judge","post_message":"Nine church members were shot and killed at Emanuel AME in downtown Charleston in 2015."},{"comment_id":"10152891097411491","commenter_b":"and because China is seizing Australian colonial territories in Antarctica which is morally wrong","commenter_a":"Asia is Asia, for the ASIANS. Why do we have to stick our noses in EVERYWHERE???? No wonder the U.S. is hated by so many countries.","post_message":"A historic debate over trade is now heating up in Washington."}]
