[{"comment_id":"764116903756422","commenter_b":"@username I don't see you birthing a baby out of your pee hole.","commenter_a":"I see all of these people shaming women for having an abortion, but it takes two. The woman just has to walk around with the evidence. So many are so quick to hold up signs and protest against a woman's choice yet we have so many unwanted children waiting to be adopted. Caring for children doesn't stop at a fetus. If you're going to protest and shame a woman for making, for some a very difficult choice, how about you go through an adoption process, pay for children's education and medical, etc. If you're not out there trying to adopt unwanted children, then you really shouldn't be shaming a woman for having an abortion or taking her right to choose. Perhaps if people and the government put this much attention toward education, and giving equal opportunities to all, we would have more successful people and less unplanned pregnancies.","post_message":"\"Women's health and rights are now one of the first casualties of the Trump administration.\""},{"comment_id":"10154208649726770","commenter_b":"She needs to go so she can do no more damage","commenter_a":"She will be dumped her country is tired of Muslims ruining their country raping their women","post_message":"Merkel's party is second in polls for the first time since 2010"},{"comment_id":"1015110755212120","commenter_b":"Stand tall Hillary!","commenter_a":"We got your back @username our next president of the United States of America !","post_message":"Send Hillary a message of support as she heads into the #DemDebate."},{"comment_id":"10153220980835950","commenter_b":"Calm your tits lady damn it's fuckin cup!","commenter_a":"I CARE ! That \"plain red cup\" represents the disdain that Starbucks and its homosexual CEO have for Conservative and Christian values. Except for the color red,Starbucks refuses to advertise any semblance of the Christmas season or what it represents..Well I don't intend to patronize their coffee shops again ! They can HAVE their liberal agenda and I\"ll continue with my Conservative principles !","post_message":"WATCH: At campaign rally, Donald J. Trump says maybe we should boycott Starbucks over plain red \"holiday\" cup design, promising: \"If I become president, we’re all going to be saying 'Merry Christmas' again, that I can tell you.\" @webpagelink"},{"comment_id":"10155018887269329","commenter_b":"Rehash rehash... blah blah you lefties, blah blah. We won blah blah. No new content. Regurgitation continued. Yawn.","commenter_a":"You'll fit in with the self-important Hollyweird glitterati JKR. The British have never been enamoured of their paid entertainers except for simply that, as entertainers, who are well paid for their craft. The disenchanted and disenfranchised led the way with Brexit. Believe me, those who formed this majority are not racist not are they Ill educated. Nor are they of the lower socio-economic strata of society. They are the majority who stopped being intimidated by the PC brigade. The U.S. followed and Europe is next. The pendulum has swung back in reaction to the rot spreading from the highest echelons of government down, aided and abetted by a dishonest press and a compliant and unrepresentative public service.","post_message":"J.K. Rowling has outdone herself."},{"comment_id":"10153505413366770","commenter_b":"She's an idiot","commenter_a":"Kelly girl get over yourself, now your show will be a flop.","post_message":"Kelly Ripa was dressed for a funeral."},{"comment_id":"10154653626394024","commenter_b":"oh hell no !","commenter_a":"I want him back in the WH .","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"}]
