[{"comment_id":"1095394503811232","commenter_b":"sounds racist to me. peggy pauley.","commenter_a":"I am so tired of people saying, we're going to take this country back, it's not been anywhere but here! Give it a break !!!!!!!!!!!","post_message":""},{"comment_id":"922274701162393","commenter_b":"Wait, she is the old hag looting America, and the rest of the world.","commenter_a":"@username - Such an inspiring woman. You are okay with a old hag looting America but not a woman with great accomplishment trying to occupy White Office. #Hillary4WH #MadamPresident","post_message":"Hillary's new favorite singer."},{"comment_id":"1201817856581131","commenter_b":"I had idiots spit on me and throw eggs, rocks etc when I protested illegal immigration peacefully in California. I do not care if you are a man, woman or someone confused about their gender, if you spit on me or attack me I am going to do my best to make you eat teeth. I am fed up with these anti american liberals illegal aliens etc etc acting like animals. I would be by myself protesting and be outnumbered by a pack of thugs like this and I stood my ground and waved MY FLAG. You scumbag liberals and illegal aliens want some come and get some.","commenter_a":"Fellow liberals, this violence against Drumpf minions needs to stop. We cannot stoop to their level. The GOP will use this violence to court people to their side and we cannot allow that to happen. I get your passion but we need to use more voices but no violence.","post_message":"One woman wearing a Trump jersey was cornered, spat on, and pelted with eggs and water bottles."},{"comment_id":"1296455407059683","commenter_b":"No they should be given sentences building the wall then deported for ever","commenter_a":"Agree","post_message":""},{"comment_id":"470490783141502","commenter_b":"Jail her useless ass dude. Fucking A","commenter_a":"@username Ha wow.","post_message":"Should All Welfare Abusers Be Arrested?  Comment 'yes' or 'no'."},{"comment_id":"1598931086790902","commenter_b":"The horrid hag hisses!","commenter_a":"The Blonde Deatheater attempted to weasel out of every single question. She couldn't even keep her lies straight (lies she was telling at the moment).","post_message":""},{"comment_id":"10154889313644411","commenter_b":"Well hes planning to shut alot of military bases around the world, and hes said hes not paying into nato waist of money he said, at the end of the day we all have to wait and see what hes going to do, you never know he might do a better job than all the other so called politicians in the past.....see how","commenter_a":"He has a point, and America needs a business man to balance the books and help the American people.","post_message":""}]
