[{"comment_id":"10154092848234087","commenter_b":"A special letter to Republican nominee Donald J. Trump: Dear Sir, In a way, you are no better than your narcissistic alter ego. When told what you say is considered sexist, racist, classless, hurtful, and you say it more, you are a self-centered narcissist. Speaking off the top of your head, yelling hurtful insults, slinging mud, your unsophisticated intellect comes as somewhat surprising. It is apparent there is no limit to what you will say. For starters you are unapologetically low class: women ooze blood Hillary cofounded ISIS \"Hillary Clinton is a bigot!\" punish women for abortions kill terrorists and their families proposed mass deportation force African Americans use food stamps extreme vetting of Muslim immigrants if Ivanka wasn't daughter, he'd date her Mexican immigrant murderer rapists cancel Obamacare (offers no alternative) \"you have to be wealthy in order to be great\" \"putting a wife to work is a dangerous ...","commenter_a":"WE ARE CONCERNED ABOUT YOUR QUESTIONABLE BUSINESS DEALINGS OVERSEAS AND YOUR FINANCIAL TIES TO THE MOB AND OTHER COUNTRIES 1.\\tWill you sever ties with your company linked to foreign leaders, questionable organizations, and criminals if you become president? 2.\\tHow will you handle non-cancelable contractual obligations with parties whose interests conflict with those of the United States? 3.\\tWhile refusing to release your tax returns, how will you confirm that you do not have dangerous financial ties to bad actors abroad? 4.\\tIf you were willing to work with Qaddafi known terrorist and dictator there anyone you aren't willing to make a deal with? Who? 5.\\tHow can you be tough on Iran, given your business partnership with someone connected to Iranian money laundering? 6.\\tGiven that you've already questioned our commitments to NATO allies, what is your answer to this? For example, how would you handle the millions of dollars flowing into your organization ...","post_message":"Bernie Sanders ripped the media for letting itself be manipulated so easily by Trump."},{"comment_id":"820665888078295","commenter_b":"Silly woman","commenter_a":"Wtf? Isn't non schooling illegal (and 5... That's stupid... once they are on solids why breastfeed?)","post_message":"Neither of her kids can read as she refuses to let them go to a mainstream school."},{"comment_id":"10156487496090615","commenter_b":"Give it up, David. If they'd vote for someone who votes for war, flip flops on the Keystone pipeline, takes money from Wall Street, and until very recently did not support marriage equality, I don't think they're interested in the truth. They'd rather just take their half truths and stir up crap, just like the candidate they support.","commenter_a":"So many Bernie fans complained that not enough debates were scheduled before the primaries. Now Bernie refuses to debate when the other two candidates are willing. Yet another reason I'll be voting for Hillary.","post_message":""},{"comment_id":"10156589848265354","commenter_b":"Lady, please don't be ignorant....","commenter_a":"Ted Cruz , and Marco Rubio are not eligible to be president , neither is Obama ! BOTH parents must be citizens of the United States !","post_message":"Ohhhh boy...."},{"comment_id":"10152814296572377","commenter_b":"Creepy lady","commenter_a":"and Obama has invited them...","post_message":"Geller stands tall saying \"Give Me Liberty or Give Me Death,\" even though she is being targeted by ISIS. But they aren't just coming for her she says..."},{"comment_id":"10154332643707686","commenter_b":"According to a new Congressional Research Service report entitled Executive Authority to Exclude Aliens, the last 5 presidents have used executive authority to limit or restrict the entry of immigrants and non-immigrants into the U.S. a total of 43 times. Ironically, it appears that President Barack Obama used this authority more frequently than any of his predecessors, exercising it a total of 19 times during his two terms in office. Here's the breakdown of how many times each of the past five presidents issued such orders: Ronald Reagan - Five times George H. W Bush - One time Bill Clinton - 12 times George W. Bush - Six times Barack Obama - 19 times","commenter_a":"Waters, Polosi, Shummer, Warren and a whole bunch of other libtards need to be slapped up side thier heads.","post_message":"Rep. Maxine Waters:  \"I have not called for the impeachment (of President Donald Trump) yet. ...\""},{"comment_id":"10152649909240950","commenter_b":"Yeah you stupid pussy!","commenter_a":"We'll all be speaking ISIS by Sunday","post_message":"Here is what would happen if DHS runs out of money on Friday:"}]
