[{"comment_id":"1101281803258742","commenter_b":"Bite me bitch. Ever heard of auto correct.","commenter_a":"This came from the Advocate (our local paper) and I am sharing it because it is exactly how most of us feel about Trump. The Media just doesn't get it....they can't believe that people are so angry that they can no longer be manipulated! Millions of trump supporters feel this way about Donald J. Trump..... \"We don't care if the guy swears... or how many times he's been married...or who he voted for, or what his income tax return shows. We want the problems fixed. Yes he's an egomaniac, but we don't care. We know he's not a racist, or bad to women, or all the other things the liberal media is trying to label him with. We know he's raised a good family, and that says a lot about him. The country is a mess because politicians suck, the Republican Party is two faced & gutless, and illegals are ...","post_message":"Even this focus group by Fox News's Frank Luntz agrees Hillary CRUSHED Trump. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153377124609705","commenter_b":"Women's restrooms are nastier than the men's.","commenter_a":"i don't have any issues with trans-friendly bathrooms. But unisex? Have you tried those? they're never clean!","post_message":"This intimate act is now a battleground for transgender acceptance."},{"comment_id":"10153366601141770","commenter_b":"Where is our freedom of speech??? Keep your rioters away from TRUMP! You all send them with your lies of deceit...so you can have business as usual in Washington! We Americans see right through you...the uneducated don't...or the naive youth..","commenter_a":"what happened to freedom of speech? trump had nothing to do with the violence at his rally in chicago these were paid punks to not let him speek","post_message":"Mitch McConnell told reporters he and Donald J. Trump spoke by phone Tuesday and he encouraged the New York businessman to “condemn” the “violent expressions” at some of his political rallies."},{"comment_id":"10154680684123797","commenter_b":"Lisa Austin","commenter_a":"Okay, now this stupid game of Chicken is getting out of control! 😡😡 Someone needs to blink or all of the children in Illinois are going to suffer!!😡😡","post_message":"#BREAKING: Chicago Public Schools will not open in the fall if Illinois fails to approve an education budget, CPS CEO Forrest Claypool told the Chicago Tribune Wednesday."},{"comment_id":"666105456853575","commenter_b":"This wench should go back to hell .... <3","commenter_a":"She sounds poorly educated. Does she know what a bigot Sharia Law is on women and gays??","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"10154400820486051","commenter_b":"@username Suck it up Buttercup, it's the middle class that pays the taxes that all you losers live on. President Trump has done more, so far than Obama has done in 8 years. Oh I forgot he (BHO) has flooded America with illegals that are: murderers, rapist and child molestersl. The best thing that can happen for the USA is the Big One hit and take California with it.","commenter_a":"Rock on Rosie! Trump is scum! All these despicable people supporting him would make america great again by leaving. They are what is wrong with our country.","post_message":"Rosie O'Donnell just made a very controversial accusation against Donald Trump."},{"comment_id":"10153314569635950","commenter_b":"Lol yup","commenter_a":"Trump is great at selling fear. Notice how there is almost a \"Trump's fear of the week\" going on? He's great at pitching things and selling himself. Republican voters are eating this up because they like to be scared because they love having an excuse to fight someone or something. Go ahead and cling to your guns and foam at the mouth screaming about the next conspiracy,. I'm over here sipping coffee and watching the GOP sink like the Titanic.","post_message":"\"I don't like anything having to do with changing our Second Amendment. We have plenty of rules and regulations.\""}]
