[{"comment_id":"10152987199648645","commenter_b":"We are fed up with illegals and their anchor babies.","commenter_a":"What an idiot!! Those poor children! Obviously the program was already english hence the translator for the parents. Have some compassion and MANNERS!!!","post_message":"Witnesses at the Kindergarten concert said the man stood up as a Spanish translator began speaking and repeatedly shouted ! English only!"},{"comment_id":"1827543604143155","commenter_b":"That's right, all you chowder-heads SEE and HEAR what you want to. If MALEIFCENT does win, it will be through 100% corruption...but then that doesn't matter as long ad she wins, right? That way all the unemployed, druggie, scumbags can keep up the anarchy. Well, hold on to your backpacks cause there's a shit storm coming, along with rude awakenings.","commenter_a":"Alexis Marie","post_message":"Even this focus group by Fox News's Frank Luntz agrees Hillary CRUSHED Trump. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1180908731937011","commenter_b":"YOU SUCK","commenter_a":"The Chinese asked the mongols the same thing","post_message":"ON IMMIGRATION: \"I have a hard line on this. We have a country or we don’t have a country. WALLS DO WORK! Just speak to the people in Israel. #GOPDebate"},{"comment_id":"1755814751326418","commenter_b":"Not my words but totally agree. Found this on another FBook site. VOTE YOUR CONSCIOUS NOT YOUR PARTY! Don't be influenced & persuaded, been going on far to long. WHY WOULD YOU VOTE FOR HILLARY WHEN.... Most cover ups & lies by a family in America's history. If you are #Gay, why are you voting for Hillary when she wants to bring in 1,000's of refugees that believe all Gays should be executed? Criminalizing Christians who don't believe this? If you are #Black, why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood when they want to abort as many black babies as possible. Exterminate the black race because they are like \"weeds\". Most of those clinics are in Black neighborhoods? If you are a #Christian, why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who dedicated his ...","commenter_a":"Can even stand to listen to her! *wave*","post_message":"Watch: Hillary Clinton speaks during a campaign rally."},{"comment_id":"923226521098446","commenter_b":"Shut up Loretta, now!","commenter_a":"Not only telling the truth - but the DOJ just blatantly stated that they will take away your First Amendment rights!! So DOJ is after our 1st Amendment rights, Obama wants to take away our 2nd Amendment rights, the list goes on and on.....the hits keep on coming!","post_message":"Criticism of Islam equals Islamophobia, and the attorney general of the United States, Loretta Lynch, has just warned that people will be prosecuted for criticism of Islam -- i.e., telling the truth that Islamic terrorism exists. You can be prosecuted if you tell the truth about Islam."},{"comment_id":"10153691718919062","commenter_b":"Maybe if you stopped seeing breasts as sex objects, this wouldn't be an object. Maybe if your dog of a husband can't stop looking at a breastfeeding woman, the issues lie in your relationship and not with the poor woman trying to feed her baby. Just saying.","commenter_a":"Not in public. I breast feed my daughter but some things should be private! When I go out to eat I dont care to be paying $80 and having to see someone elses boobs out of the corner of my eye. Then when you have younger children they point and ask why that mommys boob is showing & what is she doing? Then there are guys who get distracted by anything-anything at all. So- this is dinner and porn all in one. Thanks for ruining our night out.","post_message":"TONIGHT AT 10: A major apology from a Texas coffee house after a breastfeeding mother is told to cover up. Should breastfeeding be allowed anywhere, or should there be designated areas?"},{"comment_id":"1421316697902078","commenter_b":"Then go away Monica!","commenter_a":"I think both ladies look great. Love the pink dress and wish I had the shape to wear the red one.","post_message":"LIVE VIDEO: Watch as various entertainers perform at the Inaugural Ball before the arrival of President Donald Trump. @webpagelink"}]
