[{"comment_id":"10154249032461178","commenter_b":"She should be gangraped!","commenter_a":"Is the reverse also true?? Are you fair game if you disagree with my views?? What an idiot!","post_message":"A rapper with a history of controversy says violence against women is OK as long as they disagree with her politics."},{"comment_id":"1731050200496998","commenter_b":"Some mothers eat their young!","commenter_a":"Typical!","post_message":""},{"comment_id":"10153709197621336","commenter_b":"Was he having a stroke?","commenter_a":"Billynyvy Martinez","post_message":"WATCH: One Southwest Airlines employee could barely get through his safety spiel without nodding off and slurring his words."},{"comment_id":"10153564606248984","commenter_b":"She needs to be taking down. She not worried about what you doing. This needs to be done quickly","commenter_a":"She should not be allowed to run. She is a liar bad person evil evil !!!! If she gets in people pack your bags go anywhere don't stay here she will put the cherry on the demise of our country !!!!!!","post_message":"Hillary’s been caught in another blatant LIE regarding her private email server. In a recent interview, Hillary said she had not been subpoenaed by the Select Committee on Benghazi, but records indicate she was subpoenaed in March 2015. Even the press covered it!  Rep. Trey Gowdy won’t tolerate her deceit, and neither will we.   Send a message to Rep. Trey Gowdy telling him what you think!"},{"comment_id":"937512336383801","commenter_b":"What goes around comes around ppl remember that !! They will get theres !","commenter_a":"If I find out you were ask and turned them down I wiil. O longer listen to your music. Bon Joni is off my list. Even Adele since she supported Hillary.","post_message":"Seriously?!"},{"comment_id":"10154194496471336","commenter_b":"I don't know about you, but I can read and retain two stories at a time!","commenter_a":"Amazing how this makes news in Canada while 4 people including 2 Canadians are being held hostage by ISIS in the Philippines!","post_message":"VIDEO: Things heated up quickly at the New York International Auto Show when a Porsche 911 Turbo caught on fire. @webpagelink"},{"comment_id":"10153301628035496","commenter_b":"Really, Brenda, perhaps you should have looked at the message she was sending. Why should we have to be subjected to her cop bashing, Black Panther, Malcolm X etc. opinions. That's not talent. Perhaps we should go back to marching bands and perhaps you should think about reporting the news or even better retiring.","commenter_a":"Wow these comments are funny to me. Beyonce did not give a hateful message. You all are upset because of what you saw visually and what the media has told you what she is singing about. Have any of you even listened to the song or listened to her response to the media turning her song into hate? And she and her husband have done a lot for the black community. They just don't have the media around to show it because that is not what it's all about.","post_message":"Brenda's Last Word on Beyonce's so-called 'way too political' Super Bowl performance.  PHOTOS from the performance: @webpagelink"}]
