[{"comment_id":"714279835348897","commenter_b":"More trigger happy pigs.","commenter_a":"Better to be tried by twelve than carried by six. Today's cops are not the cool headed officers of old. They are post 911 trigger happy thugs who think Johny Jihad is around ever corner. DO NOT CALL KEYSTONE COPS until the threat is gone or dead and your guns are put away.","post_message":"A Huntsville woman seemed to have been perfectly justified in firing upon a violent ex who walked through a restraining order. Whether she was a threat when she turned towards responding officers with the shotgun still in her hands is under investigation."},{"comment_id":"10153722896533690","commenter_b":"How Iran can Accept refugees while Iran is very poor country and its people are migrating to Europe","commenter_a":"Europe is christian place so send rufugees there,, iran is a shia muslim country, so send refugees there. Why don't you send these refugees to sunni dominating countries like pakistan, turkey??????","post_message":"Opinion: \"Of the more than four million Syrian refugees, almost half of them, the largest concentration, have gone to Turkey. In addition to Turkey, Camp Zaatari in Jordan has received tens of thousands of Syrian refugees. There are also Syrian and other refugees scattered throughout the Arab and Muslim world, particularly in Lebanon. There is one glaring case of a Muslim country that is heavily involved in Syria but has yet to accept a single Syrian refugee, and that is the Islamic Republic of Iran.\" Hamid Dabashi, Hagop Kevorkian Professor of Iranian Studies and Comparative Literature at Columbia University, writes for Al Jazeera."},{"comment_id":"10153576684991323","commenter_b":"Life is harder for women? That's why they live longer on average than their male counterparts? :p Please. That generalisation is painful to read.","commenter_a":"\"... an air of misogyny among her predominantly male colleagues...\" Basically, trivial nonsense that women want to incessantly complain about as always. Guess what: circles of female friends/colleagues will ALSO make misandrist comments about their boyfriends and men in general. The difference? Their remarks are treated as levities and never deemed sexist, whereas men are pilloried for supposed misogyny. Double standards, anyone? Woman to her friends: 'No, I don't do any DIY. I get my man to do that!' (Socially acceptable). Man to his friends: 'No, I don't do any house cleaning. I get my woman to do that!' (Misogynistic).","post_message":"Sometimes leaving a job is easier than standing up to sexism – so what can women do about it?"},{"comment_id":"10152957985436316","commenter_b":"Ignorant bitch. Talk about crime? I haven't heard of an illegal immigrant shooting up an elementary school or a movie theater. Americans are using drugs that's why drugs are trafficked here. Can you read a sociology book and gain better insight into social issues than base your opinions on ignorance?","commenter_a":"and all the anchor babies..they pop out 5 or 6 kids and they have welfare for life, the low life dads beg to stay because his child is \"american citizen\" .. so 1 breeder, 6 kids, 6 dads> IS 14 ILLEGALS ON WELFARE< running drugs, chop shops, gangs...all of this in a 1 bedroom apt in a apt complex that has 500 units... Now much money is being sent down a rat hole????","post_message":"The number of illegal aliens residing and working in the United States now outnumbers Americans who are unemployed and looking for a job, an issue that is certain to be a priority for tens of millions of voters in the 2016 presidential election: @webpagelink"},{"comment_id":"756504414454641","commenter_b":"Ridiculous. Keep them out at all costs","commenter_a":"I'll sell them to them","post_message":"One company that produces razor wire actually turned down a contract with the Hungarian government that would have brought them over a half-million Euros in revenue."},{"comment_id":"10153913650358010","commenter_b":"Male, female, you are still a crazy bitch.","commenter_a":"Bill Clinton is the WHITE BILL COSBY and she is a LIAR","post_message":"We're 309 days away from Election Day."},{"comment_id":"236889993435379","commenter_b":"What a lousy excuse of a woman! You do not speak for me!","commenter_a":"What the hell was that","post_message":"Holy mother of batsh*t!"}]
