[{"comment_id":"483464435177470","commenter_b":"Fuck you cunt lips","commenter_a":"The reason you are seeing her all of a sudden is to take the heat off of Obama . When thing get sticky with Obama his handlers bring out Michelle, or Biden. It is to take our minds off of Obama. Don't be fooled, Michele has no power, she is a fixture . I would venture to say she and her husband have very little to do with each other. It's for the television camera only. She was bought and paid for just like he was but her thing is just until he leaves office..","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10154400468321509","commenter_b":"How does this help improve the economy, education, and create jobs! The battle is more than Hilary, let her stop dreaming!!!!!!!!!","commenter_a":"Go directly to jail","post_message":"Hillary Clinton: \"I will defend voting rights, and make it a priority... to get rid of Citizens United and its pernicious effects on our electoral system.\" Read her opinion piece on CNN: @webpagelink"},{"comment_id":"10154684991066077","commenter_b":"Women are awful","commenter_a":"If it was Chelsea Clinton line every talk show news media blah blah blah would be wearing them...funny Ivanka isnt even a republican.","post_message":"The decision to drop the line, which is owned by the Trump Organization, follows last week’s move by Nordstrom to discontinue sales of evocative Trump’s fashion brand."},{"comment_id":"10156520680400354","commenter_b":"Atheists can suck my balls.","commenter_a":"Why do all the liberal atheists shit on Christianity on this page so often? Why don't you dis Islam? Why not any other religion? It's pretty pathetic that you join a conservative page with one intent, to act like complete dicks to anyone with a conservative or a Christian belief. Are you trolls being paid?","post_message":"Not EVERYONE is afraid to stand up and be counted..."},{"comment_id":"10157050332450354","commenter_b":"This bitch is a PSYCHO!!!!!!!!! I am 100% convinced now ( before I couldn't be totally sure ) that those bruises on her forearm were made prior to Cory grabbing her. Corey grabbed her biceps the video shows more likely than her lower arm. She has 0 credibility and will never get a job as a respected journalist again","commenter_a":"You stupid bitch you need to let it go. There was no case and you should be the one arrested. You will be lucky if you can get a job delivering papers. Your a liar just trying to get more than your 15 which by the way is up. You didn't do what you were told to do just like every other common thug that feels they can what ever they want. Now shut up and go home before you make a even bigger ass of yourself","post_message":"“The entire situations just seem to me a little sketchy....\""},{"comment_id":"10153308445179342","commenter_b":"You right, had he been a negro, that M.F would be pushing up daisy right about now.","commenter_a":"If he was black I doubt he'd be alive to take pics","post_message":"SUSPECT PHOTO RELEASED: Kevin Daigle, 54, of Lake Charles was arrested for allegedly shooting a trooper in the head during a traffic stop. Charges against Daigle will include attempted murder of a police officer. DETAILS --> @webpagelink"},{"comment_id":"10154295592708132","commenter_b":"A woman's ribs shouldn't show like that. That is not a healthy body.","commenter_a":"I think she looks great - no doubt about that but remember she has access to so may resources such as chefs, nutritionist, top motivating trainers, laser tightening, etc. Not to mention there is definitely not a daily 9-5 job in her day and don't forget adding in a few nannies to help out as well. All of these resources help alleviate stress and carve out time for you to focus on yourself. All that alone is a great cocktail for motivation.","post_message":"Spring has sprung for Britney Spears!"}]
