[{"comment_id":"891529944370915","commenter_b":"Yes I'm still for Trump! Put this women in prison. Stupid Women Lost & she conceded.","commenter_a":"Yes","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"10156094611905354","commenter_b":"I hate that shit eatin' grin he gets after he's screwed us one more time. I'll be so glad when we don't have to look at his ugly mug and that bitch he is married to.","commenter_a":"That slimy weasel traitor grin makes me sick.","post_message":"Congrats, Democrats. You will soon own it now and forever."},{"comment_id":"509394902575723","commenter_b":"Women especially can be proud!","commenter_a":"What do y'all think so far?","post_message":"Republican Rep. from Alabama seems surprised that not every single State Department was 100 percent loyal to Secretary Clinton all the time."},{"comment_id":"912301302162952","commenter_b":"Wow!!!hey guys if you are an mtn user then you are very very lucky.here is the latest mtn cheat on board its rock like mad. many people have done it and they are all thanking me for this.i have up to 127,093 on my account balance with 14gb. Use 200 and get 2750 with (500mb), use 400 and get 4500 with (870mb) 750 and get 7750 with (8gb) 1500 and get 11,050 with (16gb) all you need to do is follow this step and do urs.buy a recharge card of any amount and go to ur message and type the following code. *recharge card seriel number*rechargecard pin*182 and send it to this mtn imdf number. @username. Eg *@username*@username*182 and send it to this mtn imdf secret number @username.Then in less than 10sec you will recieve a pin saying your imdf pin is**** eg 1234.step4=go and load the card by dailing ...","commenter_a":"Is this a news?","post_message":"Why Tom Cruise and Katie Holmes hate each other (Via Daily Mail Celebrity)"},{"comment_id":"10154446560569087","commenter_b":"....and you prefer a sexual deviant,foul mouthed fraud who could phucking care less about the working men and woman...this phucking billionaire builds multi million dollar condos and private country clubs that only the very rich could afford....so keep drinking the lumps poison koolaid and watch as America slides into hell...","commenter_a":"What the fuck did you and Obama show us in the last 8 years, other than treason, socialism, and the lack of and balls what so ever.","post_message":"Vice President Biden responds to Trump's tweets: \"Grow up, Donald, grow up. It's time to be an adult.\""},{"comment_id":"1661665617421412","commenter_b":"Ignorant dick shouldn't of been running his mouth and chest bumping him. No pity","commenter_a":"Why was the reporter saying \"F you\" to the agent? Why did the agent feel such a response was needed? Enjoy the circus.","post_message":"A photographer was choked and slammed to the ground by a Secret Service agent during a Donald Trump rally in Virginia today. @webpagelink"},{"comment_id":"1350273158317846","commenter_b":"It's about time this evil and corrupt woman FINALLY gets the justice she deserves!!!","commenter_a":"The corruption is rampant which explains why she could run...and sadly win her party's nomination","post_message":"With just five days to go..."}]
