[{"comment_id":"10154534822598132","commenter_b":"The only way,she should have stop him is by calling the authorities. She need to go to jail,knonkle head","commenter_a":"She is as guilty as that stupid dude!!! She knows a thing or two she should be charged!!!!","post_message":"The second wife of #Orlando killer Omar Mateen has reportedly said she pleaded with him not to do anything violent."},{"comment_id":"1704858546467924","commenter_b":"Ha-Ha! She is starting to look like James Earl Jones. Too bad she's a dumbass.","commenter_a":"Black Mrs Potato Head. yikes.","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"},{"comment_id":"885881534804929","commenter_b":"That what she said.","commenter_a":"Her neck looks like huge lips.","post_message":"She shared explicit messages and pictures with pupil after the schoolgirl came out to her"},{"comment_id":"1069898906439694","commenter_b":"Trump’s running out of nonwhite ethnics to demonize. And since he needs to keep interest piqued for his free media advertising to continue, I’ve thought of a few white demographics which would work for him: LGBT people are prime. Recently an evangelist speaker at a Ted Cruz related event called for the death penalty for them because the bible has passages calling for that. And there have been comments such as the one claiming that gays are responsible for most urban violent crime. Another is that they are trying to turn us all gay. So Trump could call for making anything but heterosex illegal. That should excite his base and get hyuge media coverage. Planned parenthood employees and doctors would be favorite victims. Trump could call for imprisonment of all PP employees and the death penalty for any doctor who has any abortions already on their record. They are totally ...","commenter_a":"\"He has not proven to be somebody that has a firm grasp of policy.\" Let alone reality.","post_message":"\"He has not proven to be somebody that has a firm grasp of policy.\"  - Jeremy Peters"},{"comment_id":"10153334990238132","commenter_b":"There will always be someone looking for the controversy in something as simple as a picture is a baby in a flag. Move on! Be proud of our flag and the POSITIVE way is being displayed. AMERICANS have done worse to our flag!!!","commenter_a":"Any true American can not dislike this photo. This photo is what patriotism is all about! Anyone that has an issue with this photo must not have been born here, because this is what patriotism is all about. Thank you sir for fighting for our freedom.","post_message":"What do you think of the controversy that this photo is creating?"},{"comment_id":"1625836147707451","commenter_b":"That would be very hard for her to do.","commenter_a":"Why wait, just blow your brains out. Wait, that's why you said that, you don't have a brain","post_message":"Typical Hollywood liberal with an overreaction to everything."},{"comment_id":"4646614632067289","commenter_b":"Need to enforce the laws illegal out of this country!","commenter_a":"Anybody coming into the United States should abide by all laws of the United States for the customs or any other law if not coming through customs legally stay out if you did not come through customs legally get out you have no right to be here illegally that's the law like it or not that's the law abide by it or stay out","post_message":"Do you agree?"}]
