[{"comment_id":"1841509832747191","commenter_b":"Cause you are a psycho bitch..","commenter_a":"because your a lying sack of shit!!","post_message":""},{"comment_id":"10154976296372789","commenter_b":"@username Wanting President Trump to fail is wicked. I don't ascribe to that just as I did not ascribe to it when the right vowed to block the former president and cause him to fail. But seeking truth and speaking truth to power is not wicked","commenter_a":"The left will fail. Wickedness will not prevail.","post_message":"'What I don't like about what is going on now, is there is an absolutely frenzied and concerted attempt to delegitimize, sabotage and destroy the Trump presidency before it even started.\"  Piers Morgan believes that the mainstream media is fueling \"hysterical\" attacks on President Donald J. Trump, and it's fundamentally \"un-American.\" What do you think? @webpagelink"},{"comment_id":"865380196838555","commenter_b":"You're a dumb b****.","commenter_a":"Islamists stand together...if he were to admit islamism, he might be called an apostate.","post_message":"There’s a far bigger issue involved here than going to the anti-terror march in Paris on Sunday. That is Obama’s persistent refusal to identify the enemy as what it really is: Islamic terrorism. It’s pathetic to see the contortions our president and various administration officials and spokesmen go through to avoid using the word “Islam” when talking about the people who are waging war on the West. @webpagelink"},{"comment_id":"10153235359857093","commenter_b":"Same procedure as a mandatory hurricane evac. Some people just have to cause issues tho","commenter_a":"Are they going to arrest people who do? It's interesting that the homeowners aren't allowed to determine if their own home is safe.","post_message":"The Garland Police Department is asking those people who are able to remain safely sheltered in their homes to do so.  Residents who leave the damaged area will not be allowed to return until it is deemed safe.  Officials are working to identify and secure any possible utility hazards such as gas leaks and downed power lines."},{"comment_id":"1246991831993261","commenter_b":"goodbye both...","commenter_a":"thats \"goodbye America\"...","post_message":""},{"comment_id":"10153369157063984","commenter_b":"Fire them all and make new hires sign a contract that if they are caught stealing anything they will pay back double the amount of the theft. The citizens work hard for their money and it is the taxes they pay that keeps those in Washington working.","commenter_a":"Hey, as long as they're paying for their gambling and \"adult entertainment\" out of their own pockets, well..... that's between them and God! But, if I'm paying for any part of it, then \"nail them to the wall\"!!!","post_message":"This has got to be a big embarrassment, and they probably thought they'd gotten away with it..."},{"comment_id":"1062574083799120","commenter_b":"Yay! Maybe your daughters can grow up to be war criminals! #progress","commenter_a":"I am joyfully and unabashedly with you Hillary! My two little girls are so excited. It means the world to watch them see the new possibilities in the US with you!","post_message":"The New York Times: Hillary offers \"a vision in which middle-class Americans have a real shot at prosperity, women’s rights are enhanced, undocumented immigrants are given a chance at legitimacy, international alliances are nurtured and the country is kept safe.\""}]
