[{"comment_id":"10153732380134091","commenter_b":"Perras mamadas no hay derecho probe criatura","commenter_a":"Terrible","post_message":"\"Take everything please. Don't kill me please.\" Those were the tragic dying words of an 11-year-old boy who was killed this week on his walk home from school."},{"comment_id":"10156326796940725","commenter_b":"Alexander Gregoire Well? Let's help the guy out and get that wall built! #MakeAmericaGreatAgain","commenter_a":"Soon, please.","post_message":"Eight Syrians were just caught on the southern border trying to get into the U.S. ISIS maybe? I told you so. WE NEED A BIG & BEAUTIFUL WALL!"},{"comment_id":"1747275395512005","commenter_b":"@username if it isn't Mr. Trump YOU will be voting in Hillary","commenter_a":"The only thing that needs to change is HIM OUT OF THE WHITE HOUSE.","post_message":"Obama says \"we\" need to pray for the \"strength to change.\" It's yet another of his disgusting refusals to acknowledge the realities we face."},{"comment_id":"10156137722715093","commenter_b":"(If we support refugees by letting them into our country ISIS wins.","commenter_a":"And if we accept Syrian refugees without adequate screening America loses.","post_message":""},{"comment_id":"910297725696643","commenter_b":"Girls can be just as bad","commenter_a":"Could have been worse","post_message":"'I cleaned my son's room and found... a Pringles  tube full of URINE'"},{"comment_id":"1240022466017781","commenter_b":"@username Yes, but less human.","commenter_a":"The correct term is undocumented immigrants. It is not right to say illegals. We are all part of the human race. As an American born citizen I say that Trump is wrong. Undocumented immigrants are very important to our work force. They work very hard. Some work harder than those born here. If we send all undocumented immigrants back it would put this nation under. Yes we have a immigration problem. But fix it the right way. Undocumented immigrants deserve a chance as we all do to live in a country like ours.","post_message":"Under the Eisenhower program, immigrants inside the U.S. were rounded up and deported to remote places, resulting in deaths and criticism of human rights abuses."},{"comment_id":"10152908801970927","commenter_b":"No body forced you to spread your legs; and, no body forced you to have unprotected sex!!!!","commenter_a":"Cross your legs","post_message":"It's no surprise that Satanists support Planned Parenthood, but what is SURPRISING is how they showed that support ..."}]
