[{"comment_id":"655169484673630","commenter_b":"Hope she is thrown in prision","commenter_a":"Yay! I really, really, really don't want her to be my Commander in Chief. EVERYTHING becomes disfunctional with someone like here at the helm.","post_message":"Hillary is officially paying the price for all the crimes she has committed.  Awesome. She is a criminal.  Can we get 10,000 'LIKES' for Hillary getting arrested?"},{"comment_id":"10153331816764087","commenter_b":"Time to make another donation to PP!","commenter_a":"and this is how our tax money is spent! Disgusting, we should defund all these Republicans, 1 month no pay for each time you waste our money on senseless, going nowhere bills. Aren't there bigger problems to solve?","post_message":"Senate Majority Leader Mitch McConnell on Tuesday dispelled speculation that Republicans might drop a provision defunding Planned Parenthood from an ObamaCare repeal package."},{"comment_id":"1164964563593106","commenter_b":"I saw them at Riverside too! I remember crying lol","commenter_a":"'@username remember Riverside lol","post_message":"This is Paula first time on tour in 25 years!"},{"comment_id":"10154970022528690","commenter_b":"The world and so call United Nation have no interest in alepo people just because they are muslim, if its christian region this is happening the UN will have take action, but we the muslims are just folding our arm doing nothing, the only thing is to back to Allah, by saying; HASBUNALLAHU WANI'IMAL WAKIL, WANI'IMAL MAULA WANI'IMAL WAKIL,","commenter_a":"there is tubelight, internet, electricity bla bla. it seemed she is speaking from hotel pan pacific Singapore. we didn't heard even a sound of bullet fired. weird.","post_message":"Residents of East Aleppo are giving their final messages to the world."},{"comment_id":"1667152256905944","commenter_b":"Why do we have this question. If they are illegal the only right is to be fed on their plane ride back home. On the other hand I have the right to protect my family, land and myself from these criminals. If they have kids then they have a choice, leave with the kid or leave without the kid and never see him or her again. All connections to the child will be erased from our records so you can't track them.","commenter_a":"They are NOT U.S. Citizens, so they shouldn't be allowed to vote.","post_message":"I agree!"},{"comment_id":"10153217644964411","commenter_b":"Lmfao ro. What about the natives in Mexico? Forget about them you spaniard?","commenter_a":"Fuck off back to America - youu are needed there to fight the police!","post_message":"'The whole purpose  is to assure those allies that live closest to the Bear that we are here,' Lt. Gen. Ben Hodges, commanding general of US Army Europe said."},{"comment_id":"1701996636715698","commenter_b":"'@username What kind of murder,Cuz whites kill in record numbers in one single act of violence.","commenter_a":"Imagine the riots and violence that would be rampaging across the country had police shot four African Americans overnight - even were they all legitimate uses of force.","post_message":"Ambushed for wearing the badge: Four police officers in cities across the country were shot overnight.   There’s a manhunt for a suspect who shot and killed San Antonio Detective Benjamin Marconi as he sat in his squad car outside police headquarters. @webpagelink"}]
