[{"comment_id":"10154654748316320","commenter_b":"What barbarians","commenter_a":"Savages","post_message":"SHOCKING:  Video posted on social media during demonstrations Wednesday night in Charlotte appears to show a group of protesters beating up a man and stripping him of his clothes as he begs for mercy.  @webpagelink"},{"comment_id":"10153161460796051","commenter_b":"You're stupid","commenter_a":"He's promoting this cause he knows him and his racist wife will end up in a cell very soon.","post_message":"Here's why President Obama says it's time to end mass incarceration in America. Do you agree or disagree with his message?"},{"comment_id":"10152759564322217","commenter_b":"Poor People :(","commenter_a":"May the victims be comforted by those of all faiths and races. A rare opportunity to share love","post_message":"More than 1,000 people have been killed in the Nepal earthquake. @webpagelink   * Deaths in Nepal, India, Bangladesh & Tibet  * Avalanche in Everest kills 8 * Centuries-old temples flattened"},{"comment_id":"10153237393021350","commenter_b":"Great idea but this lady ain't fat...","commenter_a":"You look fantastic!!","post_message":"This mom has become a swimsuit role model."},{"comment_id":"1824366427776560","commenter_b":"Build that wall starting January 20, 2017.","commenter_a":"Build that wall !!!!","post_message":"URGENT: Please vote now.  Do you support building a wall with Mexico?  A new national poll released today says 53% of Americans DO NOT want a wall along our southern border.  The question is, do you?"},{"comment_id":"486501341528450","commenter_b":"She's a skank. Thought she was going to leave the us if bush was elected. Leave the us bitch","commenter_a":"The fucking Libtards heads will explode when Trump gets elected. I will fucking LOVE IT!!!!","post_message":"You've GOT to see her characteristically snooty and elitist statement..."},{"comment_id":"1668611910083188","commenter_b":"She ain't done nothing I wouldn't have done. I do not think any red blooded American should have to put up with this nonsense!!","commenter_a":"Stacey said what we all think, good for her.","post_message":"Stacey Dash has been suspended by Fox News for saying this to Obama. She needs our support. Should Stacey Dash be reinstated?"}]
