[{"comment_id":"714422425388653","commenter_b":"Get out of this country!!! The USA was great until you damn Devils Muslims started to come here!!!","commenter_a":"I don't care. Take that shit off. What do you have to hide. You want to wear it , wear it at home.","post_message":"She filmed it.   WATCH the video very closely..."},{"comment_id":"10153108653466770","commenter_b":"Psycho woman.","commenter_a":"Ho hum!!!","post_message":"Debbie Wasserman Schultz says Donald J. Trump's “misogynistic comments” are “reflective of what the entire Republican Party stands for.”"},{"comment_id":"10154046898184199","commenter_b":"I think the verbal abuse has to be severe (to the point of verbal battery) before they will enforce it but this is how the state has defined it but I'm not a lawyer and if theres a lawyer reading this could you please explain it better the rcw codes tend to be confusing.","commenter_a":"Ok so for the internet lawyers out there, or real lawyers, riddle me this: If I start cursing out someone on the street, can a cop arrest me? Have I broken the law?","post_message":""},{"comment_id":"10153376704131051","commenter_b":"Someone needs to beat her the same way","commenter_a":"Dear God in heaven. God bless this poor child.","post_message":"Officials couldn't believe that someone would treat a child like this."},{"comment_id":"1297507013642106","commenter_b":"STFU dumb bitch","commenter_a":"That bitch & her sleazy family need to STFU","post_message":"Palin should leave President Obama and his family alone."},{"comment_id":"1143390539087332","commenter_b":"#HillaryALLTheWay #HillaryClinton2016 #ImWithHer #MadamPresident #Hillary2016 #OutForHillary #ShesWithUs #WomanCard #StandWithHillary! #TeamClinton #LoveTrumpsHate #Ready4MadamPresident #DealMeIn #GoHillary #HillaryForMe #HillaryForPresident #Rally4Hill2016","commenter_a":"Oh Lisa Lampanelli never fails....","post_message":"LOL! The look on his face is PRICELESS."},{"comment_id":"584218068426739","commenter_b":"For sure playing the women card. Wouldnt have 5% of the vote without a vagina. Whos voting for vagina????","commenter_a":"Are you going to play the women card for the rest of the election? it's getting really old really quick....","post_message":"Like a boss."}]
