[{"comment_id":"1229197387109219","commenter_b":"Putin to Obama stop protecting Muslims I know Putin he is insane. What do you want from 1st a Muslim then a racist 1/2 black 1/2 white that own family owned slaves. And a bi sexual with a jar of Vaseline in his side table","commenter_a":"And so how is this different from supporting Israel which is pro-pro abortion? How does the GOP electorate square Israel's pro-abortion record with U.S. Southern Christian position on abortion? @webpagelink","post_message":"\"If I told you in 2008 that Barack Obama would negotiate a deal that he acknowledges will fund terrorism, you'd have thought me a conspiracy theorist.\""},{"comment_id":"10155254328488690","commenter_b":"ALL THOSE WOMEN AND THEIR HUSBAND ARE ALL TERRORIST ..THEY SHOULD HELP THEM SELF'S AND SOLVE THEIR PROBLEMS NOTING ONE CAN DO TO STOP THEM FROM DOING EVIL IS INBORN IN THEM ....THEY ARE BORN WITH EVIL AND GROW UP WITH EVIL SO LET THEM PAY FOR THEIR EVILS","commenter_a":"Is today that you learned to join in hand to fight boko haram... What kind of leaders are you... You waste much time and innocent people lost their lives... The same thing happens in Libya president was been killed. Non of African leaders contribute a trip to help him... Everything UN and we gain nothing... Africa let's stand for our own... Bob Marley was a mixed blood yet he loves Africans and fight for you throughout his musical... Africa unit...","post_message":"\"The governments of Cameroon, Chad, Niger and Nigeria engaged in fighting against Boko Haram must take seriously their responsibilities to protect civilians.\"  - Winnie Byanyima & Jan Egeland"},{"comment_id":"10154196354922541","commenter_b":"She looks ridiculous","commenter_a":"love it!","post_message":"In case you missed it, Beyoncé’s pregnant."},{"comment_id":"653855578126234","commenter_b":"@username so you are ok with men grabbing women's genitalia.","commenter_a":"And this what mango Moussillini's said immediately after Michelle's speech. Trump on the People reporter who said he sexually assaulted her: \"Take a look. You take a look. Look at her. Look at her words. You tell me what you think. I don't think so.” He is grotesque. My husband never speaks like Trump - EVER. And Trumps cult is now tweeting repealrhe19th. Only weak sociopathic narcissist men like Trump, lie, talk and think like Trump. As for women that support it, are beyond words to me right now.","post_message":"Here's the incredible Michelle Obama speech Fox News refused to air: \"Strong men — men who are truly role models — don’t need to put down women to make themselves feel powerful.\""},{"comment_id":"1048024048598660","commenter_b":"Disgusting.","commenter_a":"The blessings of new life. I think it's wonderful","post_message":"\"It looks like an alien\""},{"comment_id":"1096976973728618","commenter_b":"No! You think this is a country of racism then take your black brethren with you and YOU all move out. You own colour sold and brought you here, stop acting like everyone else owes you something.","commenter_a":"Why?? Why would you tarnish your gold!! The first black woman and you trash your chance to be a roll model and a proud American! Wtf is wrong with you! You just ruined your chance at becoming everything I wished for you! You Dumb bitch!!!","post_message":"I can't even anymore with this garbage..."},{"comment_id":"613162948816887","commenter_b":"Try to imagine how little I care about anything this pre-teen brain has to say.","commenter_a":"She's a f*cking but job anyway....","post_message":"She is PSYCHO crazy folks."}]
