[{"comment_id":"10154415286659445","commenter_b":"I don't know I live in a 3 family Black family on the first floor Hispanics on the second & Im Italian but white on the third","commenter_a":"woah?!?!?","post_message":"WCVB presents a town hall meeting on #RaceInBoston in partnership with The Boston Foundation. Watch on WCVB and share your comments below. @webpagelink"},{"comment_id":"1088448164564744","commenter_b":"MOB VIOLENCE - MUSHY FRAUDULENT L A C K OF LEADERSHIP. VOTE THEM OUT OUT OUT !!!!!!","commenter_a":"Is this what we call, \"Today's Leaders?\"","post_message":"This guy is nuts!"},{"comment_id":"10153270179214087","commenter_b":"Wrong @username, when people come across any countries borders without proper papers in hand they are criminals hence they commit a crime. Trump is correct illegal immigration is the most pressing problem for this country of whi h it is not in the least ludicrous. If you are much wanting illegals here then why don't all you democrats join together, invite them to live with you and pay their way instead of demanding we tax payers pay for all the freebies they get, not to mention all those ancor babies that we have to pay for to be born then pay for them and all the freebies they will be getting for the rest of their live.","commenter_a":"real change like we have never seen before. Go Trump!","post_message":"When immigration activists began heckling Donald J. Trump for his remarks on illegal immigration at a rally Wednesday night, his supporters came to his defense."},{"comment_id":"1584230838542469","commenter_b":"DEPORT the illegal bitch.","commenter_a":"WTF!?","post_message":"In Obama's America, obeying the law and playing by the rules is for suckers."},{"comment_id":"761137067410204","commenter_b":"Good decision by the judge. This entitled brat needs to make better decisions.","commenter_a":"Just another teenage girl who never got proper parental guidance because the parents were too wrapped up in themselves.","post_message":"Outrage After Judge Orders Bristol Palin To Do THIS With Her Breast Milk This is just ridiculous. A mother should not be subjected to this. Do you agree or disagree with the judge?"},{"comment_id":"1202111446538878","commenter_b":"Ain't none OF these HOES VIRGINS!! EVERY GIRL BEEN WITH SOMEONE BEFORE YOU GOT IT . THIS DAY AND AGE..","commenter_a":"Everybody saying he having diddys seconds are dumb by that logic every girl you've been with is technically seconds sometimes more than seconds 😭😭😭😭 might be hundreds","post_message":"Damn! #WSHH"},{"comment_id":"10153517171806336","commenter_b":"Shut up you stupid woman!","commenter_a":"They were only 160 ft. Away and actually they checked on the children throughout the night. It is said the mother visits the place where the child went missing to walk the streets hoping to find her. The parents are devastated over the loss. Just because you or I would not leave our children like this doesn't mean we should be so critical or unkind. They made a terrible mistake ( in this case perhaps a deadly one). We should show kindness and pray for them. I mean after all what if it were you/me. No one is beyond making mistakes. They are tortured enough. Walk a mile in their shoes.","post_message":"Based on an examination of the bones, Australian police determined the child was killed \"some time since the start of 2007\" – the same year Madeleine McCann disappeared."}]
