[{"comment_id":"10153562430331350","commenter_b":"Shut up you stupid woman","commenter_a":"Why do white think they can break rules ? Anyone hunts is a savage, and they are going to suffer, that's the way they think you can treat black people also, you and your seeds will suffer, and it's long overdue, there is no way God gave me this same book to worship as the white man. Break the curse and burn the bible.","post_message":"Legal analyst Lisa Bloom explains what could be next for the dentist."},{"comment_id":"10153240103694575","commenter_b":"Don't nobody wanna hear that mess they need to charge her as an adult.","commenter_a":"You failed at parenting now it's time the state steps in with a real punishment!!! I don't know why that woman is trying to act like if someone beat her kids like that she wouldn't want to beat the crap out of them! Fact is you raised the one that did it. SHE MADE HER BED NOW IT'S TIME TO LAY IN IT!!","post_message":"Russ McQuaid spoke today with the mother and grandmother of the teen girl accused of attacking another girl and a young boy in Brookside Park.  The suspect's mother says her daughter suffers from PTSD and other ailments.  See more of the interview here: @webpagelink"},{"comment_id":"686618911486884","commenter_b":"Does this arbitrary terrorism not offend a large number of your customers, therby, justifying, really justifying firing such a dumb asshole?","commenter_a":"How much do he makes,","post_message":"This might be the worst CEO in the country and no, it’s not Papa John this time."},{"comment_id":"10156327692315725","commenter_b":"What are we going to do about that?","commenter_a":"You are right, Mr. Trump. I wish we could impeach Obama","post_message":"We need new leadership- fast!"},{"comment_id":"10153146580383352","commenter_b":"@username she is one lost soul,","commenter_a":"I Pray that evil spirt of homosexuality never come upon my kids, those demons had their way with that young boy, this is sad, when a person is not happy with who The Lord made them, an idol mind is the devil workshop, the devil does not care who he comes after, teach Boys to be boys and girls to be girls., no need to reply to comment with negative remarks, if you don't agree, but this is a sad and ridiculous situation.","post_message":"Suicide note of 17-year-old transgender girl is DELETED from her Tumblr page after her Christian parents demand message blaming them for her death be removed"},{"comment_id":"10156303577690354","commenter_b":"She should be in jail for her do nothing in Benghazi.She is a liar and I hope she gets what she deserves.She thinks She is above the laws the rest of us must follow.Oh and why is Sharpton not in jail for not paying his taxes.We've got to get rid of all of these politicians.","commenter_a":"Yes she did","post_message":"\"Clinton may have committed perjury, then, when she signed a sworn statement promising that she turned over all of her work-related emails pursuant to a Judicial Watch lawsuit for Clinton’s email records.\""},{"comment_id":"1394356603915019","commenter_b":"Odds Hillary Won Without Widespread Fraud: 1 in 77 Billion Says Berkeley, Stanford Studies After applying various statistical models to subsets of 2016 primary voting data several academic researchers conclude Hillary Clinton win was only possible through widespread vote fraud.","commenter_a":"#HillaryDNCRiggingCrooks","post_message":"It turns out that Bernie Sanders may not fight all the way to Philadelphia after all."}]
