[{"comment_id":"1262934473727561","commenter_b":"There is no 'weaker' version of the species. Both genders are the same species, just with physical differences.","commenter_a":"12,000 yrs. ago and they're still Lions 😭😭","post_message":"These images are just extraordinary. The cubs were just a few weeks old when they died."},{"comment_id":"1099534980113254","commenter_b":"Anderson cooper is a killery bitch","commenter_a":"The country will be dancing in the streets if that happens. If anyone can get the job done, it's Donald J. Trump!!","post_message":"Donald Trump says he will prosecute Hillary Clinton if he becomes President of the United States."},{"comment_id":"1184449068295865","commenter_b":"A greedy witch !","commenter_a":"Clinton just wants votes she doesn't care about the American People","post_message":"“He used every word in the book. Can you imagine if I said that?” asked Donald J. Trump."},{"comment_id":"1454919074525438","commenter_b":"That horrid bitch belongs in prison period.","commenter_a":"Harold Alan,you hit that one right on the nail. Hitler and Mussolini that's the way he want to to Govern the United States Of America if elected.","post_message":""},{"comment_id":"994057867406695","commenter_b":"3 americans tried to blow up a mosque in Kansas. No coverage here","commenter_a":"This is why we should NOT bring anymore refugees here and should return the ones that are here. We NEED to take care of our Americans first!","post_message":"An Iraqi refugee who planned to blow up two malls in Houston pleaded guilty to trying to help ISIS. @webpagelink"},{"comment_id":"1139906406032404","commenter_b":"you are an idiot!! AND STOP KILLING ANIMALS!! They have souls too you creep!!","commenter_a":"Ok. So release the previous 5 years. That will provide an accurate picture of what to expect when the audited returns are ready for release.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"10153004550474411","commenter_b":"U shts invaded our lands. Ur the problem.","commenter_a":"ban the Muslim black garbage bags","post_message":""}]
