[{"comment_id":"10153816577949160","commenter_b":"You believed that nonsense? Sue glad Donald never cheated at anything.","commenter_a":"When can we not have to listen to lying cheating Teds shrill voice cry over everything. Ted cheated on his wife then lied about it.","post_message":"Donald J. Trump just won Indiana. Here's what that means.  READ MORE: @webpagelink"},{"comment_id":"10153811229123433","commenter_b":"1. Hardly 'record' when the number of abortions is going DOWN. In 1990, there were 1.6 million abortions performed. Today, it's a little over a million. Numbers don't lie. 2. Hundreds of thousands of women were getting abortions BEFORE Roe V Wade legalized them. You are more likely to die due to childbirth/pregnancy complications than an abortion. 3. You are contributing to your own problem. Teens that had received comprehensive sex ed were 60% LESS LIKELY to get pregnant. The states with abstinence only education have HIGHER rates of teen pregnancy compared to states that actually teach sex ed. Why do women get abortions? Unwanted pregnancy. Much less likely to get pregnant when you're using contraception. It's not rocket science. 4. Abortion isn't free. The Hyde Amendment prohibits any federal funding of abortions except in the case of incest, rape, or danger to the life of the mother. They most ...","commenter_a":"What do you call 350k annually, or 10,000 late term per year how many is ' record'?@webpagelink","post_message":"From the trail in Iowa. Carly Fiorina wrongly claims that we're seeing 'record' abortions. @webpagelink"},{"comment_id":"10154637857483188","commenter_b":"He's been doing that since way before anybody else","commenter_a":"When are you going to report on Hillarys emails? Speeches? Ties with foreign governments?","post_message":"Tough situation."},{"comment_id":"1012656692115433","commenter_b":"Is it a female? Lord have mercy she's dog ugly","commenter_a":"Racist woman","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system.  Why? Because it's against a white guy. #DNC2016"},{"comment_id":"10152692514188299","commenter_b":"All this talk...............start calling your congressmen, bombard them with calls until they DO something....................","commenter_a":"What the hell is wrong with this guy? Most Americans are against this.","post_message":"Five More Terrorists Transferred Out of Gitmo … @webpagelink"},{"comment_id":"10154970022528690","commenter_b":"The world and so call United Nation have no interest in alepo people just because they are muslim, if its christian region this is happening the UN will have take action, but we the muslims are just folding our arm doing nothing, the only thing is to back to Allah, by saying; HASBUNALLAHU WANI'IMAL WAKIL, WANI'IMAL MAULA WANI'IMAL WAKIL,","commenter_a":"there is tubelight, internet, electricity bla bla. it seemed she is speaking from hotel pan pacific Singapore. we didn't heard even a sound of bullet fired. weird.","post_message":"Residents of East Aleppo are giving their final messages to the world."},{"comment_id":"10154064604487383","commenter_b":"Of course","commenter_a":"Well, so much for the 'Same standards'.","post_message":"The flexed-arm hang might be here to stay."}]
