[{"comment_id":"1049396555150863","commenter_b":"I thought you made a great partner to clint in fight movies rest in peace Jeff","commenter_a":"I like him. He was a good supporting actor. Underrated, in my opinion.","post_message":"Actor Geoffrey Lewis, known for his long working relationship with Clint Eastwood and for a slew of roles in television and film, has died at age 79. @webpagelink"},{"comment_id":"10156170491245206","commenter_b":"Shut up sexy","commenter_a":"I was pro @username but Carly I cant take you seriously unless you attack someone beside Hillary she is not the only one running who is bad for our country and until I see you attack Trump or Jeb who are you major competitors right now I am not going to take you seriously as a serious candidate.","post_message":"What are my thoughts on Hillary Clinton's speech this morning?"},{"comment_id":"10153927132326680","commenter_b":"She is nasty","commenter_a":"I rewound my tv three times when I heard this because I couldn't believe a presidential candidate would actually say something like this.","post_message":"Donald J. Trump to Hillary Clinton: \"Such a nasty woman.\""},{"comment_id":"10153631215978984","commenter_b":"Please take the baby away and never should she get back any of the children. Also, make sure that she cannot have any more kids.","commenter_a":"What a shame...","post_message":"The cops got the call so they went to this pregnant woman's home... but once they got there, they were stunned at what they saw. This was not something they had been trained for... they will never forget this."},{"comment_id":"410359492488277","commenter_b":"It's simple women why treat guys like crap then want to be with him poor guy didn't get none for years and this happen f all the women in the world cause if he look like Enrique Iglesias you will give it to him if he was in the street another story","commenter_a":"10 year in jail for him, at this age, is life imprisonment.","post_message":"If convicted, Bill Cosby faces up to 10 years in jail and a $25,000 fine."},{"comment_id":"10155229441268352","commenter_b":"She is a grown ass women","commenter_a":"For all j-lo haters y'all can go straight to hell she is in love","post_message":"Daaaayum! Drake and J-Lo are KILLING THE DANCE FLOOR… watch Drake GRIND ON J-Lo's FAMOUS BOOTY… then slow-dancing together like they about to go make babies!! (Video -- Super HOT!!) ----> @webpagelink"},{"comment_id":"10153752277268984","commenter_b":"Hell No!!! Women in combat will be a liability and not an asset!!! I am all about women achieving their highest, but to EVER say a woman physically has the same strength as a man, is absolutely false!! Our culture teaches males to protect females, our Military does NOT need that liability in battle!!!!!","commenter_a":"Sorry ladies but I feel that only a few of us can fit certain gender roles in many male jobs. No standards should be lowered to make women fit . Some can apply but not all can make it.","post_message":"Shortly after the US military lifted its ban on women serving in combat, the Marine Corps began a year-long experiment - here's the result... What do you think about women serving in combat?"}]
