[{"comment_id":"10153402845063352","commenter_b":"Sheila cant make a hoe a housewife lol","commenter_a":"Sheila Ryan Jonathan omg","post_message":"Boyfriend Sets Up GoFundMe Account Begging For $325 to Follow Girlfriend to SpringBreak to Make Sure She Doesn't Cheat!"},{"comment_id":"1082049255206943","commenter_b":"\"Claim to be Muslim\"??? Muslims marry 6 year old girls! Muslims think that women are 2nd class citizens! Muslims believe that women shouldn't be allowed to drive or leave the house alone! Muslims believe that the punishment for being gay is DEATH! Their culture and our culture can't coexist peacefully! Is there some part of that that you can't understand?!?!?!?","commenter_a":"It reminds me of Sodom and Gomorrah. The whole group would not allow the police to get to the BOY...What the fuck is wrong with these sick Bastards, that claim to be Muslim? Raping of young boys and girls is okay? I ned to re-read the Koran...","post_message":"Some of Obama's Muslim \"refugees\" were raping a 10-year-old boy when the cops were called.  The police arrived, but what they did once they got there has left the country furious.  It's time America learned the WHOLE truth..."},{"comment_id":"826344630889447","commenter_b":"We are sick and ;tierd of feeding these lazy women who just keep laying on their backs , letting free loaders get them Pregnant. We need to sterilize these women. We should pay to get them sterilized.","commenter_a":"Get a JOB, leeches.","post_message":"They are losing it. That's what happens when you mooch for your entire life.  Do you think this was a long time coming?"},{"comment_id":"10153363483281770","commenter_b":"Vincent N Laiza. He wants to stop illegals crossing the border for 1. Tax payers are taking care of them. We can't afford them 2. Many people coming across the border are criminals. 3. Many people carrying disease and have never had vacinations 4. Terrorists are sneaking into our country. All the above items do not just include just mexicans they are going through mexico to get in","commenter_a":"Florida, Ohio, Illinois, Missouri & North Carolina lets keep winning, vote Trump 2016. Full speed ahead Mr. Trump. We will do this, vote Trump 2016!","post_message":"BREAKING: Donald J. Trump wins the Florida Republican primary.  Read more: @webpagelink"},{"comment_id":"10155240272548132","commenter_b":"@username go away","commenter_a":"4 beautiful and classy young women! All 4 parents should be proud!","post_message":"The Bush Sisters wrote a heartfelt letter to the Obama Girlsand it's really sweet. @webpagelink"},{"comment_id":"10153054297358984","commenter_b":"Obama has always chosen the side of the terrorists from the very beginning. I can't help wondering if he was in on the planning and carrying out of the 1st 9/11 attack and just what his roll has been in other events like the shooting at Fort Hood, etc.","commenter_a":"If 3.7 million protestors and marchers didn't get Obama off his ass then nothing will. Not just any but those that support freedom and liberty.","post_message":"This man does not have a problem telling us how he really feels. And boy, does he have some harsh words for Obama...  Do you agree with what this Lt. Colonel just said about Obama?"},{"comment_id":"890357731026345","commenter_b":"Sorry, but this is America. You want to live here you can follow American law. If you want to live by YOUR ethnic rules, head back to where you came from. Way to go Texas!","commenter_a":"As if Texas was ever going to let them take over and see they did it so covertly their government never even realised what was going on...Wake up Australia it is no different here","post_message":"TEXAS: Bad News For The Islamic Tribunal In Texas, Muslims Furious   There only room for one governing law in the United states, we will have no side show from the Islamist who want Shari. If you want Shari then...  @webpagelink"}]
