[{"comment_id":"10153286881669641","commenter_b":"Suck my metaphorical dick @username","commenter_a":"Apparently people are paying more for cooking... Tess O' Connor @username","post_message":"Wealthy millennial women are more likely to make at least as much -- if not more -- than their husbands: cnnmon.ie/1HNES88"},{"comment_id":"697812187045401","commenter_b":"And the women who choose to cover their faces?","commenter_a":"Victory for the woman that are forced to cover their faces. Now they can feel the warmth of the sun, feel alive.","post_message":"Anyone caught will be fined about $541."},{"comment_id":"10155208349228690","commenter_b":"JEWS also believes in exactly the same GOD we worship,,,the one and only,,,,,They call him Hashem,,,,and have other name in Hebrew,,,,ISLAM allows MUSLIMS to EAT koshered MEAT ,,or animals slaughtered by Jewish rituals,,because they also recite name of our / their GOD,,,,,so this MEANS ,,Islam has accomadated both MUSLIMS JEWS christians to LIVE side by SIDE,,,understood,,but ones who LIE may NEVEr admit this,,,","commenter_a":"They steal their land, they're destroying their houses, they're spoiling their olivers, they're arresting children and abuse them, they're using chemical weapons against them, they're isolating them, making them starving, they're bombing hospitals, ... And they're blaming palestinians for throwing them stones and hating them ! Should they give you flowers?! Go ahead Palestinians! May Allah bless youuu","post_message":"Eshaq Abu Jibneh suffered the injuries in a brutal attack in a West Jerusalem public square last summer, belatedly recognised by Israeli authorities as a hate crime."},{"comment_id":"1292895457407386","commenter_b":"FFFFFFFFFFFFFFFFFFFUUUUUUUUUUUUU UGLY BITCH","commenter_a":"Frau Kraut...... you have destroyed Germany ... so shut up.","post_message":"Why would Merkel think issuing Trump a not-so-thinly veiled warning, on the day after his amazing win, was a good move politically?"},{"comment_id":"10154416316781833","commenter_b":"@username lmao there is no such thing as gun violence only violence. And back off gun control laws won't stop criminals or terrorists from getting guns. Your gun control laws only harm law abiding citizens and get people killed wake up. More states are banning gun control laws. I'm moving to Arizona. They have no gun control laws and have Constitutional carry. No permits no waiting periods no finger printing. Just a simple and quick background check and I'm free to get my gun. And I will buy loads of AR 15s and other types of guns. Gun control = death","commenter_a":"I don't see what the problem is with strict background checks and a ban on assault rifles. This guy was under investigation by the FBI twice for suspected terror affiliations. A background check would have certainly stopped him from obtaining such a weapon. Noone wants to take away anyone's guns, just keep them out of the hands of lunatics","post_message":"Americans were shocked and disgusted to learn of another act of terrorism on our soil. But calls for more gun control are a desperate attempt to create the false illusion that government - and politicians - can keep us safe at all times."},{"comment_id":"10154014597174203","commenter_b":"Lise stfu","commenter_a":"How about a story on the hundreds of black-on-black murders in Chicago every year...","post_message":"He planned to bomb black churches and Jewish synagogues."},{"comment_id":"10154406219790329","commenter_b":"She's taking the piss out of men who try to compensate for their little sausages, get it now?","commenter_a":"Jacqueline Boggs","post_message":"\"My vagina just sneezed, judging from my underwear.\""}]
