[{"comment_id":"1815590955374804","commenter_b":"@username good luck when the immigrants trying take over your country good luck","commenter_a":"People who don't like DT should move to Canada like all the other celebrities. I forgot nobody is moving. LOL.","post_message":"It's Inauguration week and The Donald is hard at work at Trump Tower making final preparations. Who is meeting the president-elect today?"},{"comment_id":"10153181309551350","commenter_b":"Sebrina Butler cute comments here. Marcella McFadden","commenter_a":"Breast feed, breast feed! Just do it! It's best for the baby's immune system.","post_message":"What do you wish you'd known before you had your baby? Read the top responses so far and join our new TODAY Parenting Team, sponsored by Johnson's Baby, to share your advice. @webpagelink"},{"comment_id":"898024070290648","commenter_b":"Scum","commenter_a":"What an ass","post_message":"Never, really?! Last night's theater shooting was a preventable tragedy. Louisiana has the weakest gun laws in the country, and one of the highest rates of gun violence. Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153730594409099","commenter_b":"Who are all these women stuffing their babies in bags?","commenter_a":"Thank god the baby was left somewhere where baby could be found alive unlike all these mothers stuffing them in bags killing them. This was a woman that loved the baby enough not to hurt it. Maybe she was afraid of something like deportation or something else. At least it was at a church not in a dumpster or alley. We don't know the circumstances or her story so lets not be aholes and judge at least someone can raise that baby who wants it.","post_message":"BABY IN A MANGER: A wailing newborn baby was found with its umbilical cord attached inside a nativity scene at a Queens church, police say ----> @webpagelink"},{"comment_id":"10153341236279170","commenter_b":"This guy needs to stay in London. I do not exactly agree with what Pam Geller did, but she was well within her rights. It's just like when the muslims were building their mosque down the street from the 9/11 Memorial. They were within their rights, even though that definitely was the wrong thing and wrong place to put it. Islam has no tolerance and so America should stop being tolerant to Islam.","commenter_a":"So according to the traitor liberals it is fine to offend Jesus Christ but it is wrong to offend Mohammed , only in the bs traitor mind of the socialists this makes sense.","post_message":"If you're one of the people saying we need to rein in the First Amendment so we don't offend Islamists, just watch this VIDEO and know that THIS is what you're trying to coddle."},{"comment_id":"1113947365314026","commenter_b":"@username you piss with the men, but u have no balls,bitch","commenter_a":"PRETTY SOON IT WILL BE A JOY TO VISIT NORTH CAROLINA","post_message":"North Carolina: Land of Fewer and Fewer Progressive Wingnuts by the Day!"},{"comment_id":"851850534874696","commenter_b":"Loads of respect for her now:) well done woman! Anything to wind those twats up makes my day","commenter_a":"Good","post_message":"Selena Gomez sparks fury by violating religious dress code in mosque."}]
