[{"comment_id":"10153389679411350","commenter_b":"the dirty creep is the one defending a perv family Linda!!!!!!","commenter_a":"Why is this even a question????","post_message":"Should TLC cancel 19 Kids and Counting?"},{"comment_id":"10154033192724087","commenter_b":"The white trash vote can win you the primary, just not a GE. They don't have enough Electoral votes.","commenter_a":"At this point, should really stop insisting he can't possibly become president. If we lived in a sane world, he wouldn't even be the nominee. But, here he is, and no matter what he does, people continue to support him.","post_message":"\"Donald Trump won’t be our next president come January 20, 2017, and here are 5 reasons why.\""},{"comment_id":"10153091462652507","commenter_b":"There she goes again, speaking truth to power. And for the poweless. You go, girl!","commenter_a":"Thank you Sen. Watrem","post_message":"Watch Senator Elizabeth Warren crush it on the Senate floor during the debate to defund Planned Parenthood: “Did you fall down, hit your head and think you woke up in the 1950s or the 1890s? Should we call for a doctor?”"},{"comment_id":"10153315723671336","commenter_b":"God's hands sand feet here on earth. Do it for the least of these","commenter_a":"This is an American.","post_message":"Since Christmas, 28-year-old Nic Martinez has traveled along the East Coast in a 25-foot trailer re-fitted as a barbershop. Along the way, he stops and cuts hair for veterans and the homeless. #ProudAmerican"},{"comment_id":"778598825583664","commenter_b":"Don't let Chump Trump know you Clown Car passengers responded to a Megan Kelly article...She is the enemy...Have you Repubics forgotten...Clown Car Rolls On","commenter_a":"Hey Tim, I like the pocket pool!!!","post_message":"Pulls no punches."},{"comment_id":"524602671063646","commenter_b":"this is america fuck islam","commenter_a":"Go Texas","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy. Let them be angry. This America and if you don't like it, get out. Do you agree that Muslims should assimilate or leave?"},{"comment_id":"821899111236478","commenter_b":"My wife would have really liked you","commenter_a":"I believe in god, i believe there is something good and benevolent surrounding all of the miracles of life....... I believe we all have a connection to god, and that means every, single, last, one of us........ No matter what race, color, sexual orientation, or faith. I refuse to believe god (a being of pure benevolence) would ever discriminate....... I believe god is the personification of good in people.... If you are gay, atheist, and black, and are someone who does good, you are far closer to god than someone who is straight, catholic, and white and spend your life discriminating and spreading hatred to those around you..... It's time to grow up, to live and let live, and to try to lead a life of compassion and understanding rather than judgement and contempt. People will be different, but people with good souls, deep inside, are always aligned, we are ...","post_message":"Share if you agree. Image by Occupy Democrats"}]
