[{"comment_id":"1760155984214134","commenter_b":"she makes money that way she is a media whore","commenter_a":"She is worse then a racist, bigot she hates whites and everything whites stand for. It the view comes on a channel any place I am at I change the channel I will not watch a racist show that she is on","post_message":"Whoopi Goldberg Insults TV Host For Being White, See What Happens Next. She is the biggest hypocrite. What a bigot. Do you think Whoopi is a racist?"},{"comment_id":"10152814272036973","commenter_b":"Dogs hurt others to protect themselves, their pack, or their belongings out of instinct. Humans have the ability to think before they hurt others, yet they still choose to do it. This is why I care about animals more than most people.","commenter_a":"To bad people don't care bout homeless people as much as they care about dogs. Smh","post_message":"Every day, on average, three dog bites serious enough to break this skin are reported to authorities in the Portland area. In round numbers that's roughly 1,000 people injured annually."},{"comment_id":"10153652003074203","commenter_b":"he's going to destroy both political parties!","commenter_a":"Hes for real gonna destroy the republican party... and all of us love him for it","post_message":"One thing is pretty clear: Donald J. Trump isn going away for awhile."},{"comment_id":"818380371637006","commenter_b":"These women supporting Hillary are the most delusion bunch I have ever encountered... I'll leave this video of a woman providing facts about Hillary, so that you know just how delusional to are, and if you still support her after watch this video, you are just as bad as she is. ALL WOMEN SHOULD WATCH THIS BEFORE VOTING FOR HILLARY CLINTON: @webpagelink","commenter_a":"I was delighted and elated to put my vote for y-o-u Hillary! Ive been waiting for this moment and plan to bake cookies to celebrate your election. Much love kindness snd goodwill, Jean","post_message":"'Get this Donald: Nasty women are tough. Nasty women are smart. And nasty women vote.' —Elizabeth Warren IWillVote.com"},{"comment_id":"10153474426766350","commenter_b":"u don't have 2 worry then bitch. your pathetic.","commenter_a":"sad and pathetic. marriage between homosexuals is wrong on any level and again the moral majority is forced to put up with this BS. i for one will give no male or female homosexual the time of day much less respect they don't deserve. it is wrong on any count for male and female homosexuals to marry.","post_message":"'Today is beautiful,' said Anna Kendrick."},{"comment_id":"1031660353527286","commenter_b":"I dunno, it seems like America went from a pretty nice country with polite, religious hardworking people to lazy, angry mean spirited race conscious materialists since those days. So I think there is nothing to celebrate in this 40 year decline since then.","commenter_a":"I am surprised the director of this movie which claims it is historical, heard recording of 1964 meeting between LBJ and MLK and knew Johnson cared deeply over black voting issue but she depicted him as indifferent! Why would she do that? I hear LBJ daughters and aides are furious!! We should all be!!!","post_message":"Our so-called #CivilRights president: I am surprised the new Selma Movie omits the Obama connection—oh wait, there isn't one!"},{"comment_id":"979982332037226","commenter_b":"Yawn. Y'know, feminism isn't out recruiting fuckwits today, to my knowledge.","commenter_a":"I will never call myself a feminist simply because feminism has no true definition. sure it has a dictionary definition but 9 times out of 10 people who support 'feminism' have a different approach to it and have values that don't support equality. Men aren't afraid of powerful women I wish there were more powerful women because I can't stand submissive people. If I could find a woman that would stand up to me (in a loving way not a psychopath way like a lot of women think they need too)I would be very happy. I will say this again and again feminism is not the way to gain equal rights for all, because of its aggressive nature it will always have people fighting against it. Also the word feminism does not need to exist if it simply means equality then we can just say equality. I refuse to label ...","post_message":"Well said.  Like ATTN: on Facebook."}]
