[{"comment_id":"1162022200542981","commenter_b":"Hillary Clinton's response would be \"What difference - at this point, what difference does it make?\" The crooked bitch would lie about it anyway!","commenter_a":"You don't know what he was doing!! Why did trump tell you ?","post_message":"Wow. A major discovery about the EgyptAir pilot was just made, and it could change everything. It's been revealed that he was doing something surprising before the plane went down, and it could explain a lot..."},{"comment_id":"10154319204506729","commenter_b":"And this should include Hillary as well. The woman has delusions of grandeur and is a serial liar. These are all distorted mental behaviors and both should be institutionalized.","commenter_a":"Psychosis: Possible symptoms include delusions, hallucinations, talking incoherently, and agitation. The person with the condition usually isn't aware of his or her behavior. Critical: consult a doctor for medical advice","post_message":""},{"comment_id":"10153281917270090","commenter_b":"And what does that have to do with what his stand on immigration has cost all tax payers!","commenter_a":"Illegal immigrants!","post_message":"All of the above! Choose Obama's #1 failure as president: @webpagelink"},{"comment_id":"10150604575769999","commenter_b":"Why do you suppose all those things are necessary for women? Come on, think!","commenter_a":"Overcoming the confidence gap? Thanks for your concern NYT but I'm doing just fine. I'm so sick of people telling me how disadvantaged I am as a woman. Women get alimony, the children, special scholarship opportunities, special mentorship opportunities, special conferences, support groups for violence against women, priority disembarking off the titanic, the seats on the crowed bus, and the list continues... Let's face it, men are disadvantaged now.","post_message":"While men often overvalue their strengths, women too frequently undervalue theirs. Call it a continuing confidence gap."},{"comment_id":"434449293346332","commenter_b":"Oh Cheryl chill out","commenter_a":"Anyone who thinks this is ok and there is at least one person here, (@username, seems to think so) is an idiot.","post_message":"When a student couldn't pay for her lunch, school officials decided to do this with the food instead."},{"comment_id":"466095273584336","commenter_b":"Good maybe that will keep a lot of those liberals and illegals out of the rest of America.","commenter_a":"Have it your way Jerry...","post_message":"Liberal California Governor Jerry Brown: ‘If Trump Wins, we’ll build a wall around California’"},{"comment_id":"10155360412381509","commenter_b":"She's a nasty looking monkwy","commenter_a":"Michelle Obama is the most elegant, intelligent and intellectual First Lady's ever to grace the White House. This family will be missed!! God bless them!","post_message":"Over the past eight years, former President George W. Bush and First Lady Michelle Obama have been seen becoming increasingly chummy."}]
