[{"comment_id":"10153404410236130","commenter_b":"@username All things you listed other than pot are legal. Yet why is it that while people...especially GOPers LOVE to scream bloody murder and point their fingers at those threatening to take away their guns and insist they not be persecuted the same way women who have abortions, gay men and women and birth control is seen as the devils idea. Guns kill people, The LGBT community hurts no one...all we want are equal rights and legal marriage, abortion in most cases saves unwanted children from being abused or just dumped in the trash and the GOP Congress has been trying to withhold food, shelter and a chance at a normal life from those born to poor unwed women. Where are those men and women when they see poor unnourished children who most likely are not wanted some being abused some being killed and some just starving to death. Instead ...","commenter_a":"To all those saying we have no gun problem - please review our statistics on mass shootings. We have more than the next few countries combined. And to those saying gun restrictions would not help because criminals would still get guns anyway: if you limit something at its source, if there are less guns being sold, period, statistically all criminals would have a much tougher time getting a gun. People with a history of physical violence and mental illness SHOULD NOT have access to guns, and today most can simply walk into a store and buy one as easily as anyone else - anyone who argues with these facts is part of the problem.","post_message":"What is standing in the way of meaningful gun reform?"},{"comment_id":"1929449190619936","commenter_b":"Trump will not get a record number of votes. No way. This is going to be the biggest landslide in modern American history.","commenter_a":"My prediction in this election is that Trump will get a record number of votes beating Hillary. But Hillary will get the electoral vote giving her the presidency. The electoral is there so the establishment gets final say. Sad but true. Isn't that right Bernie Sanders.","post_message":"Donald J. Trump says he would \"promise and pledge\" to accept the results of the election --- if he wins."},{"comment_id":"702885809874123","commenter_b":"Just as ugly as she is!","commenter_a":"Very ugly dress looks likes she's wearing a curtains.","post_message":"It caught everyone's attention because..."},{"comment_id":"982915058434909","commenter_b":"wake up ladies they use you","commenter_a":"Oh please. Look at him and look at her. Enough said.","post_message":"'I thought he was The One'"},{"comment_id":"902522343195539","commenter_b":"Smart pooch 😂😂😂","commenter_a":"Krissy Maree","post_message":"This Great Dane's having a Great Time on a trampoline.  Video: Jukin Media"},{"comment_id":"935619299833521","commenter_b":"TRAITORS!!","commenter_a":"I'm done with them !","post_message":"SENATOR: Disney Fired 250 American Workers So They Could Hire Foreigners  A US senator demanded an investigation of a US visa program that Walt Disney World used to replace 250 American workers with...  @webpagelink"},{"comment_id":"10153953664426509","commenter_b":"They will invade us with mountain goats!","commenter_a":"@username so scared ..lmao","post_message":"North Korea threatened the U.S. with attack if military exercises are conducted as planned. Get details here: @webpagelink"}]
