[{"comment_id":"10153948326234497","commenter_b":"I could totally help this bitch out","commenter_a":"'@username, you could help this chick out for sure.","post_message":"'I think I ready to put myself out there again.'"},{"comment_id":"1776409695942163","commenter_b":"'@username, sorry to say this but you might have missed the point.","commenter_a":"Michelle isn't even remotely in her category .. get real...sorry.?","post_message":"Nothing wrong with nude modeling, but could you imagine how they would scream if Michelle Obama had done this? Hypocrites..."},{"comment_id":"1362411960521719","commenter_b":"'@username Oh snap, you go mean girl. Can I sit next to you in the cafeteria? I didn't vote for the Orange white trash. but carry on with your brilliant repartee. I'm so put in my place. Yawn, on to the next idiot.","commenter_a":"Well, it's what I always say, 'if everybody says it, it must be wrong.' The only thing wrong with @username is they are PH.D. reporting to a Honey Boo Boo and Duck Dynasty population. We are a white trash nation, of course nobody watches.","post_message":"Would launching a trade war with China help 'make America great again'?"},{"comment_id":"1305722922778581","commenter_b":"Sean Connolly","commenter_a":"Logan Laybolt","post_message":"Tian Tian the panda enjoyed the snow this morning!  Video via the Smithsonian’s National Zoo and Conservation Biology Institute"},{"comment_id":"1143690625715878","commenter_b":"Good thing I'm pregnant!!!!","commenter_a":"Jennie!","post_message":"Warning!"},{"comment_id":"10156326796940725","commenter_b":"Alexander Gregoire Well? Let's help the guy out and get that wall built! #MakeAmericaGreatAgain","commenter_a":"Soon, please.","post_message":"Eight Syrians were just caught on the southern border trying to get into the U.S. ISIS maybe? I told you so. WE NEED A BIG & BEAUTIFUL WALL!"},{"comment_id":"375119059510655","commenter_b":"This woman is very wicked. You can see the evil spirit in her face. She is a demon from 'hell'!","commenter_a":"Worst people you can meet in your life are LIARS! This administration is full of them!😏","post_message":"CNN has HAD it with Conway and her lies."}]
