[{"comment_id":"1359337234126021","commenter_b":"Kids learn this behaviour. Violence/bullying maybe the norm in their households. Young bullies grow into big bullies unless they are dealt with","commenter_a":"Ban kicking , feet and bullying","post_message":"All because he stepped in to defend an autistic friend. Shocking."},{"comment_id":"1008404635861662","commenter_b":"Nasty ass bitches!","commenter_a":"Breastfeeding should be done in private. For God's sake this is an industrialized country. People should not be displaying public nudity (displaying breasts) while feeding a child. Yes it is natural to feed children breast milk. But have common decency about it!","post_message":"These defiant moms just occupied a food court to stand up for breastfeeding in public."},{"comment_id":"518916724963287","commenter_b":"Is she holding a sex toy???!!!!!","commenter_a":"I cannot believe facebook has stuped so low to put this kind of crap on their page, I'm thinking it might be time to leave.","post_message":"THIS IS DISGUSTING..."},{"comment_id":"1658752774184464","commenter_b":"Have you bothered -- of course you have not -- to realize the amount of business your new Fueher is doing in these very same countries? And continues to do so? At this moment anything HRC did is irrelevant.","commenter_a":"The Clinton Foundation accepts donations from the Saudi Arabian Royal family, who have had hundreds of people hung for being gay. But these moron Hillary supporters either don't know it or they're just willfully ignorant","post_message":"'I fully support Hamilton: An American Musical cast taking Mike Pence to task over equality, but..."},{"comment_id":"10153322465354575","commenter_b":"That's no lady.","commenter_a":"F that lady","post_message":"A veterinarian posted this picture on Facebook with the caption: \"My first bow kill, lol. The only good feral tomcat is one with an arrow through it's head! Vet of the year award ... Gladly accepted.\" The cat was a family pet named Tiger, and now she could face charges."},{"comment_id":"10153724479619614","commenter_b":"i hope that women go to jail for murder","commenter_a":"This person is not even human. She is garbage","post_message":"A New York woman who once worked for child protective services is accused of throwing her newborn daughter to her death from a seventh-floor window. Officials say the baby, her umbilical cord still attached, was alive when she was tossed from the building. Jennifer Berry, 33, was charged Tuesday with second-degree murder and manslaughter. The medical examiner says the little girl died from multiple blunt-force injuries consistent with a fall. Read KTLA's story here: @webpagelink"},{"comment_id":"1128902297147109","commenter_b":"go home...STFU!","commenter_a":"Kasich you are an idiot!!!!!","post_message":"John Kasich said of the idea: \"It doesn't feel right.\""}]
