[{"comment_id":"1390719824302205","commenter_b":"Our 4 rescue babies. We couldn't be happier, love them with all our heart.","commenter_a":"If I were granted 3 wishes it would be health and wealth for all my family and friends and that Clyde could talk. We stare into each other's eyes and I ask him about his family and living on the street and all his circumstance and history. I call him a bunch of names to see his reaction, Blackie, Shadow, Coal, Midnight. Larry hates that \"his name is Clyde, you're confusing him.\" I'm also proud to wear a tshirt that says \"all I want to do is drink wine and rescue dogs\" and it has a real red wine stain on the front!","post_message":"This comic shows a dog's heartwarming journey from the shelter to his forever home."},{"comment_id":"10153799805727623","commenter_b":"They need to be handcuffed at all times !","commenter_a":"Now report how many inmates are killed by correctional officers every year","post_message":"4 correctional officers are assaulted at a North Carolina prison:"},{"comment_id":"1802927083306226","commenter_b":"Well you got what you wanted...he called Illegal Aliens, \"Guests\" Now wallow in it.","commenter_a":"Only people glad he's gone are the criminals and illegals","post_message":"LIVE VIDEO: There's a new sheriff in town as Paul Penzone is sworn-in as Maricopa County's 37th sheriff after defeating Joe Arpaio in November's election. Arpaio served as sheriff for the last 24 years."},{"comment_id":"10155875894235354","commenter_b":"No one wants to see people in need suffer. But the time has come to stop illegal immigration and deal appropriately with those already here. ENOUGH! Impeach the whole lot of them for putting politics and \"special\" interests before the legitimate interests of the US citizen. COME TOGETHER PEOPLE!!","commenter_a":"dump her now,out of touch with the people,","post_message":"And We Support the Legal U.S. Citizens.   Bring it On, Nancy."},{"comment_id":"563855710491041","commenter_b":"Such a PIG","commenter_a":"POS!","post_message":"His response is simply \"deplorable.\""},{"comment_id":"1231022086976838","commenter_b":"Look at the size of that wood. Those are strong birds. Yet so very gentle with their chick.","commenter_a":"Menifee California","post_message":"BREAKFAST TIME! Looks like Momma Eagle is feeding her new hatchling. More info: @webpagelink Where are you watching from this morning?"},{"comment_id":"1462621683757857","commenter_b":"Facts !!! What a joke, just like her supporters...zombies","commenter_a":"CLINTON IS THE WORST THING FOR OUR COUNTRY.... LYING HILLARY","post_message":"They haven't voted for a Democratic president in two decades or more."}]
