[{"comment_id":"10153126746034071","commenter_b":"Girls, to get ahead, bare some skin. No lots of skin, get u some fillers and marry rich.","commenter_a":"Now imagine what Kim would say in 2020","post_message":"Michelle Obama had a powerful message for girls this week."},{"comment_id":"10152606948662093","commenter_b":"Idiot get a life","commenter_a":"Huh! Happy to hear that they didn't get shot. Wonder if they were white. ......","post_message":"There are good people all around us.... Carrollton Police officers found a family of three sleeping in a car, and instead of being told to leave, they put them in a hotel and bought them necessities."},{"comment_id":"10153328235374087","commenter_b":"Common ground to Ryan means all his way.","commenter_a":"Ass hole. One of the boys","post_message":"“You know, we have two ears and one mouth,” Paul Ryan said. “We got to use those in that proportion.”"},{"comment_id":"1048920205189554","commenter_b":"@username idiot!!!!","commenter_a":"It's not necessary to test on animals. Their bodies are not like ours.... it means nothing. Do the back study of how useless animal testing is, folks.","post_message":"This is the heart-touching moment 156 beagles are set free from an animal testing facility in India. Credit: Caters TV"},{"comment_id":"10153891492220575","commenter_b":"A DISGUSTING IDIOT RACIST TRADER WOMAN","commenter_a":"WHO HIRED HER RUBIO OR CRUZ?","post_message":"Surprise! So-called \"Trump supporter\" is a far left Union activist!!"},{"comment_id":"10154188982011954","commenter_b":"illegals only come here for free money ..stop the flow","commenter_a":"Can we cover the 2 million illegals registered to vote?? That has just been proven??","post_message":"Watch LIVE: Press Secretary Sean Spicer briefs reporters after the DHS secretary moved to implement immigration changes ordered by President Donald J. Trump. @webpagelink"},{"comment_id":"10153625105923128","commenter_b":"Stop bring toilet in every issue","commenter_a":"India should stop releasing Indian Movies in Pakistan long ago ..i don't knw why still they didn't do that","post_message":"Here's why an alleged Pakistani terror group wants a ban on an Indian movie."}]
