[{"comment_id":"10153721560403984","commenter_b":"We are protected by the Constitution. Christians founded this country. Gay people are harrassing HER, as there are dozens of other local offices that are issuiing these licenses for them. She is defending her faith and beliefs, not harrassing others. Do away with freedom of religion, and America is nothing.","commenter_a":"500%","post_message":"County Clerk Kim Davis has found herself at the center of a national firestorm after refusing to issue gay marriage licenses, even after the Supreme Court's decision. She's even being dragged to court herself, but she refuses to back down. Do you stand with Kim Davis?"},{"comment_id":"10154103102004170","commenter_b":"hillary is a pig liar","commenter_a":"Despicable HRC is! Oh, so despicable! 👎👎👎👎","post_message":"What kind of First Lady has so little class that she would say something nice about another First Lady, then apologize for saying the nice thing? Oh. Right."},{"comment_id":"1756054801276415","commenter_b":"Though what border did the Muslims come ?","commenter_a":"Don't mess with Texas!","post_message":"BREAKING: Texas Lt. Governor Announces That Texas Has Finally Shut Down The Border. It's about time. With or without a wall, we will protect our country. Do you think we need to close our borders to Mexico?"},{"comment_id":"10154274085621756","commenter_b":"Ok ok all color aside its true that all girls are trouble makers!!","commenter_a":"It's not race, but class. If two parents have to work, there's less support for childhood development. Every problem we have stems from a lack of appropriated resources while a fat cat sits happy.","post_message":"Black girls are punished at school at rates that are even more disproportionate than those experienced by black boys."},{"comment_id":"10153151930717426","commenter_b":"@username there is no double standard. One group enslaved, tortured, raped and brutalized a race, and fought a war to keep their slaves (states rights). And the other called a race that did all the above to them devils. No comparison.","commenter_a":"Who cares about the names of the schools? Does it further rasicsm? No. Are kids being taught rasicsm? No. Anything can be offensive as \"being offended\" is subjective. Will we then denounce anything named after Malcolm X because he was a Muslim who believed that all black people are Gods and the white man is of Satan? Now that's offensive.","post_message":"She argues the name represents a “history of racism.” There are also two local schools named after J.E.B. Stuart as well as other schools named for Confederate leaders. Do you think this will/should change?"},{"comment_id":"10153253016300329","commenter_b":"I can almost guarantee that this lady is nowhere near as big as this dress makes her look. I personally think she looks pretty average. Size 12 or 14. I'm not \"fat\" but I would probably look like that in that dress, thanks to the perfect little human I made. Haha. It just isn't flattering, that doesn't mean anything about her body.","commenter_a":"The dress is not for fat people that is the issue lol","post_message":"ICYMI"},{"comment_id":"1556960097657348","commenter_b":"This is a state with Making a Murderer. I'd be wary.","commenter_a":"Eternal rest grant unto HUSSAIN, O Lord, and let perpetual light shine upon HIM. May the souls of the faithful departed, through the mercy of God, rest in peace. AMEN!!","post_message":"Police say it's likely several people saw Alnahdi being beaten, but only one has come forward."}]
