[{"comment_id":"10156554094585615","commenter_b":"what an ass","commenter_a":"He's so wrong. I can judge him too.","post_message":"He calls declaring same-sex couples \"apostates\" just a \"policy disagreement.\" Meanwhile, LGBTQ kids are dying by suicide."},{"comment_id":"10153039322884753","commenter_b":"She doesn't have to pledge allegiance to the USA. So where is she pledging allegiance to, while getting a free education here. Hmmmmmmm","commenter_a":"I think she and her family should leave the country","post_message":"When a 14-year-old student decided she no longer was going to participate in the pledge of allegiance at her school, her teacher decided to punish her. Now the girl's parents are asking for an apology."},{"comment_id":"10153752724022016","commenter_b":"In her ear? Why the hell would she listen after she is elected, considering she's not even listening now, when she needs our vote? I doubt she'll hear a damn thing, once she swears that oath. The revolution isn't dead, but its not gonna happen through or in the DNC.","commenter_a":"SOCIALLY THERE IS NO OTHER CHOICE, ITS HILLARY WITH SANDERS AND WARREN IN HER EAR! THE REVOLUTION IS NOT DEAD! -?","post_message":"\"Emphasizing the negatives of Donald Trump, while certainly easy to do, will not be enough to get millennials to support Hillary Clinton. The Clinton campaign needs to unapologetically embrace issues that will inspire this critical millennial voting bloc to come her support.\"  Otherwise...."},{"comment_id":"10154292587651336","commenter_b":"@username he has submitted the required financial statements","commenter_a":"Running a country isn't the same as running a business. It'd better not be, since Trump has a habit of declaring bankruptcy...and that's not an option for the country. Sure, he's rich. However, he STARTED really rich and would be about as wealthy now or even more so if he didn't go into business at all, based on average stock market gains. @webpagelink/ With his unwillingness to release his tax returns and his inability have to have a serious discussion of policy, beyond 140-character tweets and repetition of: \"tremendous\", \"problems\", \"so many people tell me\", \"better deals\", and \"believe me\", Trump is most certainly NOT qualified for the job.","post_message":"\"I feel Mr. Trump can come and get us better deals. He is a businessman,\" former Kentucky councilman David Abbott said. \"I don't want my children Dave and Erika to grow up in debt all their lives.\""},{"comment_id":"1814101218857117","commenter_b":"When you walk into McDonalds they already had yo order ready , \"ay 3 big Macs to the front, this fatass just walked in here...\" built ass, you sitting down eating on a bean burrito & yo bitch walk in butt naked all you can do is *munch munch on food* \"uhh tf I'm supposed to do with that?\" Gay ass outta here","commenter_a":"What kinda fake ass pink sack of waste of human flesh trump supporting stds catching macaroni and cheese smellin diaper full of shit stain 'my dad a lawyer' \"Just bought 2 big nos tanks for my honda and added turbo that way when I drive it goes really fast like 300 mph\" lookin ass damnnn 'Daniel back at it again with the pink verses fruity man' head ass \"wanna hot dog on a stick?\" Head ass normie fuckboi made this meme?","post_message":"This man is a genius ahaha #WSHH"},{"comment_id":"533434026816552","commenter_b":"is that how YOU got in?? god dam roach.....","commenter_a":"Displaced... Bullshit . they are like Roach's spreading themselves out to bring their evil to more places","post_message":"\"Never has there been a greater need for tolerance, compassion and solidarity with people who have lost everything.\""},{"comment_id":"10154005509605575","commenter_b":"Go back to Canada you slimy rat","commenter_a":"THIS IS THE MAN THAT HELPED DEVELOPE NAFTA FOR THE BUSH'S IN ORDER THAT WE WILL HAVE OPEN BORDERS","post_message":"Trump blasts Natural born Canadian Ted Cruz..."}]
