[{"comment_id":"10152632992600927","commenter_b":"When has she even known what is going on? The woman is AWOL in the brain department.","commenter_a":"Iranians are our enemies you idiota","post_message":"She's backing Obama's Iran response.  What do you think?"},{"comment_id":"10153745269073984","commenter_b":"that bitch needs to be in prison, hell yeah she and this country need her to just go away.","commenter_a":"Yes. She is wasting our time!","post_message":"A Fox News correspondent just revealed one surprising thing about this Hillary event that you won't see on TV, and it's definitely an embarrassing moment for the Clinton campaign.  Do you think Hillary Clinton should drop out of the presidential race?"},{"comment_id":"10152732363406051","commenter_b":"...women who don't have vaginas? WHAT?!?!?!","commenter_a":"If he has a pussy and she has a pecker you call them 'heshe's! If he has neither a pussy or a pecker and she has neither a pecker or a pussy you call them awfully damn horney! In Another vernacular you might just call them freaks of nature! Them the question is what do you feed them? One thing is for sure! They won't reproduce!' Put them in a side show at the fair. Pay your money, go in, hoot and holler, laugh until you pee your pants. Now got to work Monday morning telling everyone what you did and saw! Then you will find out who the real freak is!","post_message":"This all-women's school will no longer perform the 'Vagina Monologues' because it doesn't want to offend women who don't have a vagina."},{"comment_id":"755872544562858","commenter_b":"Hes a special kind of stupid isn't he!!!","commenter_a":"I think I read Obama sent his people to Israel to interfear in their election. This is like the pot calling the kettle black. Put that is what Bullies do.","post_message":"President Barack Obama says the U.S. must and will take action against Russia in response to cyber interference with the election."},{"comment_id":"1583910615243254","commenter_b":"She's worth no comment","commenter_a":"Illuminate","post_message":"VIDEO! Cops are being slaughtered since Beyonce's Racist anti-cop performance. In 8 days 8 cops were murdered, and many more shot!  SHARE THIS EVERYWHERE!"},{"comment_id":"486035008253746","commenter_b":"Cover her ugly ass back up. Been eating too many Chitterlings","commenter_a":"Cover her face??","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"10154515564959657","commenter_b":"Get a big boat and ship them back.","commenter_a":"Not sure if I'm buying this, I've heard multiple different stories from a couple of families to 10k of them.","post_message":"VIDEO===> Bus loads of refugees arrive in New Orleans today."}]
