[{"comment_id":"10152934156123067","commenter_b":"Molested. Josh should not have Molested his sisters or any other person.","commenter_a":"Josh should not have touched his sisters.","post_message":"\"If I could build a time machine, this wouldn't have come out in the first place,\" Washington County Attorney Steve Zega told CNNMoney. @webpagelink"},{"comment_id":"1390855700937474","commenter_b":"RACIST!","commenter_a":"I can't imagine ever turning down an invitation to the White House no matter what! As an American I would consider it the highest honor!!! Can I go in his place?","post_message":"We know that Brady, Belichick, and Bob Kraft are friendly with President Trump. But one member of the Patriots doesn't seem so keen on going to the White House."},{"comment_id":"10153147409408812","commenter_b":"Terry is trollin trollin trollin, stfu","commenter_a":"2 billion years....lol make fun of me for believing in Santa Claus but you keep believing we could possibly ever know something was 2 billion years old.","post_message":"Scientists: Bacteria discovered that hasn't evolved in 2,000,000,000 years: @webpagelink"},{"comment_id":"474050886118825","commenter_b":"Good Idea !!!","commenter_a":"If a Muslim man sees a naked woman other than his wife, He must commit suicide. There for, call for a father daughter dance instead of having Easter, have all the Playboy Bunnies show up naked! Problem Solved!","post_message":"Muslims force this school to ban Christian holidays. America is under attack, this is treasonous. 'LIKE' if banning Easter is WRONG!"},{"comment_id":"878149845586082","commenter_b":":D mu mka kap hernia .. :'(","commenter_a":"Joe Jess","post_message":"This just shouldn't be possible..."},{"comment_id":"10153713889518869","commenter_b":"this particular immigrant is a whore.......you dont get a pass for being an immigrant......","commenter_a":"an Immigrant bar whore toy bought by Donald....the end.","post_message":"The couple's courtship story is as chaste as its backdrop is louche: Donald saw Melania at an event, he asked her for number, but Donald had arrived with another woman—so Melania refused. He persisted."},{"comment_id":"245227072596737","commenter_b":"She's a freaking retard!","commenter_a":"One thing he is not insecure, but you are Nancy","post_message":"\"I feel sorry for you. You're the president of the US and you're so insecure...I pray for your Mr. President. And more importantly, I pray for the United States of America.\" Do you think Trump is insecure?"}]
