[{"comment_id":"10154848442742235","commenter_b":"Duh, you think! Not a difficult prediction","commenter_a":"I'm sorry but GOOD. I hope this country is brought to its knees. Then maybe. Just maybe people will get their heads out of their asses","post_message":"A sociologist who predicted the collapse of the Soviet Union and 9/11 attacks warns that American global power will collapse under Donald Trump."},{"comment_id":"10154220107672293","commenter_b":"@username idiot","commenter_a":"Like the Central Park rapists (5 young black boys) some years back that Trump railroaded into jail, then never apologized when someone else confessed.","post_message":"Cooper was wrongfully convicted of armed robbery in Indiana in 1997, and he is still waiting to be pardoned."},{"comment_id":"10153512388783812","commenter_b":"She is not dark skinned!!! I sorry she is screwed up!","commenter_a":"Love her tan. What's her secret? Lol","post_message":"A timeline of Rachel Dolezal's transition from a young white girl with blond hair to a darker-skinned leader in the country’s oldest civil rights organization: @webpagelink"},{"comment_id":"10153504938416336","commenter_b":"This woman, is what evil looks like. They all must be shut down!!!!!!!!!!!!!!!!!!!!","commenter_a":"Wonder what she would do with video of Charlie boy's gang inside the Tate house? Give them medals? #FreeCharlie!","post_message":"Calif. AG Kamala Harris will use her office’s authority to regulate charity organizations to see if the organization that made the videos violated registration or reporting requirements, or broke any other rules."},{"comment_id":"1784321135174854","commenter_b":"No you not voting makes you a hypocrite","commenter_a":"I am so done with this mentality.","post_message":"\"...the oppressor isn't going to allow you to vote your way out of your oppression.\" Colin Kaepernick explains why he didn't vote."},{"comment_id":"10152707849071028","commenter_b":"With their family issues this's couple should not have children.","commenter_a":"\"Seven case workers were assigned to the family\" yet they didn't do a thing!","post_message":"The girl’s nose and part of her cheek were eaten away, while her upper lip was shredded. @webpagelink"},{"comment_id":"837415593047972","commenter_b":"what a lying hag she associates herself above everyone no matter color!!!!!!!","commenter_a":"Excuse me, is Hillary Clinton talking about humility ? - What a joke !","post_message":"Give me a break!"}]
