[{"comment_id":"549880968533529","commenter_b":"The ones who say they are refugees are young muslim men . I never see women or children in the pictures. This is what obummer wants to bring to America.","commenter_a":"It's funny how you people think all Muslims are bad, but I never heard you talk about all the Muslims in California who raised over 200k dollars for the victims of the San Bernardino shooting. Or what about the Muslims in Africa who protected Christians from getting shot on a bus.","post_message":"This makes me SICK!!!"},{"comment_id":"452509181540789","commenter_b":"Courtney i could care less what a fugly cunt, such as yourself thinks.","commenter_a":"No one wants to see ugly bitches without a top on.....maybe feminazis, but they don't count they're not people","post_message":"We support these brave and courageous women as they demonstrate against the rise of #policebrutality nationwide. What do you think about this form of protest? Effective?   Learn more → @webpagelink #SayHerName #FreeTheNipple #StopPoliceBrutality #TFTP"},{"comment_id":"10154566492298812","commenter_b":"'@username you keep drinking the kool-aid","commenter_a":"If you can't emotionally tolerate a black man reaching for his ID and you pee your pants like a 9 year old girl scout, and you shoot him without ever seeing a gun, it's time for you to take off the police uniform and get a job where you will not be harmful to human beings and to society.","post_message":"Pres. Barack Obama: Attacking police officers, even rhetorically, does 'disservice to the cause' of criminal justice reform. @webpagelink"},{"comment_id":"10153253749121800","commenter_b":"Heard this on 98 rock on way to work....halliarous!","commenter_a":"Masoud Jalali","post_message":"'To be clear, a guy on CNN just said, 'Hey, if people are looking for news, I'm sure they can find it somewhere.'' -- Jon Stewart"},{"comment_id":"10154617717319255","commenter_b":"'...ignorant and moronic assumption...' '...liberal mindset of free everything...' I'll just leave that there where it belongs.","commenter_a":"I am a conservative who volunteers for children's charities, doesn't care if same sex couples marry, is pro-choice, owns a hand gun but doesn't believe any private citizen needs an Uzi, am a military spouse so obviously vehemently support our military (active and retired) and work in the public school system and believe those who work hard and succeed in high school deserve a break in college tuition. I'm sorry I don't fit in to your ignorant and moronic assumption that all conservatives are alike.","post_message":"Pretty much.   Thanks to Northern Michigan Progressives for sharing."},{"comment_id":"1701375029922619","commenter_b":"tough woman hiding behind a mask and hooded sweatshirt, hopes she wears that same outfit in prison","commenter_a":"Why are most democrats fat, stupid, and ugly","post_message":"Obama has allowed STUPID to take over this country...and it's putting American lives in danger!"},{"comment_id":"501775896685267","commenter_b":"She is a POS!!!!!!!!LIAR too!!!!","commenter_a":"NO","post_message":"Hillary Clinton has been defying stereotypes about what women can accomplish her whole life. Would you like to see her do it again this November?"}]
