[{"comment_id":"724989260938156","commenter_b":"Honestly I wouldn't blame people for moving to canada if trump got presidency tonette kamakahi-gumapac","commenter_a":"Votefor Trump Happy Easter. Let's spend next Easter with Trump in the White House!","post_message":"Happy Easter to all, have a great day!"},{"comment_id":"10152914682658598","commenter_b":"So do women.","commenter_a":"Weak! Some guys need to man up and become responsible","post_message":"Man Kills His Own Unborn Child After He Secretly Puts Abortion Pill in Girlfriend’s Drink"},{"comment_id":"651982771617164","commenter_b":"SEND HER BACK TO WHERE EVER SHE CAME FROM ! LET HER WHINE ALL THE WAY HOME !","commenter_a":"Yap she's crazy..go home.","post_message":"Woman Goes On National TV And Blames Americans For Banning Sharia Law And Executing Kids In... This must be some kind of sick joke. Do you think she has completely lost her mind?"},{"comment_id":"1025383310891326","commenter_b":"Domestic terrorists!","commenter_a":"We need to bring the military to go against the Black Panthers they are a militant extremist group they are all converted over to Muslim and don't we have a problem with radicalized Muslims same as Isis this is a military action but of course we have a Muslim president that will do absolutely nothing but shift to new gun control","post_message":"Not a good sign."},{"comment_id":"970339789709457","commenter_b":"The media doesn't give Dr Carson a fair chance, disgusting and sad!","commenter_a":"All Trump supporters, pls get out and vote! This is a very critical time in America, we need to get back our White House, otherwise we gonna reach the point of no return!","post_message":"GOOD MORNING, America! Thank you for all of your support- in last nights #GOPDebate. If everyone gets out to vote in 2016-- there is no question that we will ALL be MAKING AMERICA GREAT AGAIN- soon enough!"},{"comment_id":"10154288935233984","commenter_b":"What a bitch!","commenter_a":"You will know for sure when we run out water","post_message":"Dem Sen. Barbara Boxer just laid into this Catholic priest for appearing to question Pope Francis's warning on the dangers of global warming. Do you think global warming is a hoax?"},{"comment_id":"1707925176144398","commenter_b":"The shemale will sit alone","commenter_a":"He has no right to assume that the people who have died from gun violence would not have wanted to be able to carry That they might have been AGAINST gun free zones.. It's again his agenda if one of my family members had been one lost to these acts of violence I would demand that they NOT SPEAK ON THEIR BEHALF...THAT THE PRESIDENT make reference to the fact that he DOES NOT SPEAK for ALL CITIZENS","post_message":"The Obamas never miss an opportunity to shamelessly politicize an event. At the next State of the Union, Michelle Obama will be sitting next to an empty chair; and the outrageous reason why will have you shaking your head... Are you glad this will be Obama's final State of the Union?"}]
