[{"comment_id":"10154859326468487","commenter_b":"We don't know wtf is out there - we could be in a giant terrarium","commenter_a":"And most American Christians are whiney little bitches. They have some nerve to plagiarize the Jesus myth and then steal all the pagan holidays that revolve around the axial tilt of the earth, and then pretend they're persecuted.","post_message":"Even though some Muslims have been in the United States for longer than many of the Protestant and Catholic descendants of German, Italian, and Irish immigrants, most Americans still believe Islam is odds with American values and way of life."},{"comment_id":"1707955089264613","commenter_b":"We have an American president now-thank god","commenter_a":"I wonder how quick INS would offer a job to an immigrant that came to this country LEGALLY? I'll be more than happy to deport the illegals.","post_message":"Entitled Immigrants Protesting Trump Are PISSED After They Just Got NASTY Surprise When They Showed Up To Work Today!"},{"comment_id":"10154705023546729","commenter_b":"WICKED WITCH ! Karma has a major task with this Evil Bitch !","commenter_a":"she is beyond disturbing.","post_message":"He told the truth folks."},{"comment_id":"10154967718641337","commenter_b":"Go fuck your self pussy","commenter_a":"Fuck him and his Walmart brand shit mustache, i'd stone cold stunner this redneck, put him in a coma and have Black Lives MAtter tattooed on his face. Only then i'd forgive this shitstain","post_message":"A stunning conclusion..."},{"comment_id":"1089383177744009","commenter_b":"eeeuuuuuuu - did she get that in her back yard?","commenter_a":"That looks awful.","post_message":"You as a parent do not know what's best for your kid. You don't know how to raise your kid right. You certainly do not know how to properly feed your child, and Michelle Obama and the government are going to do it for you and they're not gonna give you any choice in the matter."},{"comment_id":"1735673330034205","commenter_b":"the last thing this world needs is a liar like Hillary Clinton","commenter_a":"Hillary, we don't need any more of your failures! you've proven thru experience that you cannot lead anything!","post_message":"\"'Diversity' has come to mean that you have to be accepting of every different thing but you cannot, in any way, celebrate a traditional viewpoint.\" – Mike Huckabee"},{"comment_id":"949176475215531","commenter_b":"The some bitch had a beautiful bitch at home dammit quit taking up for this clown","commenter_a":"But he only talked about fuckin another chick. Shit people left and right young and old talk about wanting to bang women. I do it all the time? Bill followed through, no confirmation of trump cheating and/or raping/fucking another women. Hop off the high cloud, and take a step into reality.","post_message":"This is just horrible..."}]
