[{"comment_id":"10153519153652042","commenter_b":"Men go crazy over some pussy..smh","commenter_a":"Men gon wild..smh","post_message":"WANTED: This man allegedly shot the mother of his children twice in her face, police say."},{"comment_id":"1666670816943719","commenter_b":"Let's help protect the interns at the White House! Keep the Clinton's out!","commenter_a":"I can NO LONGER DRINK TRUMP'S POISON. Stupid me. Anyway, Donald, you are SATAN.","post_message":"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!"},{"comment_id":"10156311774755354","commenter_b":"you bitch","commenter_a":"POS","post_message":"PARTY TIME!!!"},{"comment_id":"1032518616814893","commenter_b":"Watch her pop that shit out right in the gym straining to hard","commenter_a":"People are so stuck on looking good they don't even take time out to enjoy being pregnant it's sad and looks nasty!","post_message":"Fitness Model Chontel Duncan Isn't Stopping Her Intense Workout Sessions Even During Her Pregnancy!"},{"comment_id":"10153036402924885","commenter_b":"excuse you? I am so sick of all that we went through when we brought the rams here, and they aren't that great a team to be trying to drum up public support for them again. If you're such a good fan, how bout you follow then to wherever they end up!","commenter_a":"Let 'em GO! Let 'em GO!","post_message":"Details of the plan for a new downtown football stadium were revealed today. Peacock called the project more than a football stadium: \"We are talking about a revitalization of our downtown.\" Take a look and let us know what you think."},{"comment_id":"465155073666373","commenter_b":"Tax and spend.....are investments in our society.","commenter_a":"The problem with liberals they preach their beliefs and are hypocrites. Look at All Gore with his huge carbon footprint. Yes science is real and climate change is real this coming from a conservative but unless we get our house in order this country won't survive. The answer from liberals is a carbon tax. Let's see gas and electricity go through the roof and see the gap between the rich, middle-class and poor widen even deeper. You have to live what you preach and ultimately politicians are out only for themselves. There poor decisions impact the masses and we all need to wakeup. The problem with liberals is they think everyone who doesn't believe exactly like them are bigots or racists and there is no compromise. Tax and spend is not the answer the rich just find new ways to hide it and the middle class families keep falling into ...","post_message":"More proof they can't deal with facts."},{"comment_id":"10153341180476545","commenter_b":"Didn't a Muslim refugees came to U.S.A and took part in 9/11? So yes we have seen American Idol attacked be a refugee","commenter_a":"Funny... I do treat people the way I wish to be treated, I have not once cut off anyone's head.","post_message":"Their voices: Both sides of the Richardson mosque protest VIDEO: @webpagelink"}]
