[{"comment_id":"1713956375559891","commenter_b":"I think ladies should have control over their bodies but what if your mama aborted you","commenter_a":"Bravo Guttier","post_message":"This is AMAZING. The ending is the best part. Share if you agree with Congressman Luis V. Gutierrez and give his page a LIKE! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154026090214087","commenter_b":"Obama give the worlds largest terror sponsor a nuke deal. What the hell is that shit about? I know whats going on. You are just stupid. Hillary's top aide huma is a fucking muslim terrorist. This bitch lived in the middle east and wrote for Islamic extremist magazine. She wrote all kinds of anti american articles. And you dumb dip shits run around blind as a damn bat. You people have some real issues. Liberals are whack.","commenter_a":"I think Obama being the first Black President/so awesome set the bar too high for the first female President. We know many stellar women before Hillary never got a shot in politics. Hopefully Hillary breaking the glass ceiling improves equality even tho shes not ideal.","post_message":"\"Hillary Clinton is still changing the way we thought about women as spouses and politicians.\""},{"comment_id":"466923970098864","commenter_b":"Do not let the Muslims take over our great country with their agenda. I'd look terrible in a burka!","commenter_a":"Carson is right!!!","post_message":"A major American Muslim group says Ben Carson should drop out of the presidential race unless he apologizes for saying Muslims shouldn't be president. Do you think Carson should comply with their request? Via Opposing Views"},{"comment_id":"1043808669085644","commenter_b":"Thankfully she kept her mouth shut and performed and the liberals are pissed? She's a liberal! It amazes me how they are quick to crucify her for making the decision to simply perform, keep some class during the halftime show unlike that ghetto trash bitch Beyonce","commenter_a":"The Hamilton cast members rocked just as hard as Gaga, and I loved their amendment.","post_message":"This is just sad..."},{"comment_id":"10154041877500586","commenter_b":"Oh really Dan... sounds like Nevia has your panties in a bunch, bc she struck the right nerve.","commenter_a":"Really Fox 13 this is your news let's hear about something that actually matters for once please","post_message":"So how many of your passwords made this list of the worst from 2015? It turns out, longer isn't always better."},{"comment_id":"627774310707730","commenter_b":"Kathleen, you're an illegal alien","commenter_a":"This is very offensive. 1) I am well educated- I even completed a College degree. 2) I am not a racist or a bigot. 3) I love America Deeply and believe in her core principals. I am voting for Trump. I voted for him in the primary's and I will vote for him at the national level if he makes the ballot. I have been a registered Republican Since GW was voted in Office. Now I can agree that Mr Donald Trump can at times speak without discernment; however it is my opinion rather my belief that he is best suited for the position given the day and age we live in. You can not practice Islam without shariah law- they go hand in hand. It surprises me that persons with liberal views- LGBT- Freedom and separation of Church and state- Equality for all races- ages and gender- would open ...","post_message":"Yep."},{"comment_id":"547147818822562","commenter_b":"Get rid of every illegal man woman or child then start the legal process maybe this country will fall back together after that","commenter_a":"Buddy, you are so far behind the curve by now, I'm not sure you can hear me shouting backwards. We're past issues of legality. We're past party lines. We're into basic human dignity and the essential morality of how human beings treat each other. Black lists, registration lists, and round ups and mass deportations are all tools of countries where the rule of law has broken down and democratically designed processes have failed - BY DEFINITION. Yes, illegal immigration is a huge issue and yes, there should be systems in place to allow due process of law to happen based on merit and compassion. Targeting entire groups of people and refusing to treat each person as an individual in assessing their rights and needs is the antithesis of our stated democratic ideal. So this mayor speaking out in defiance of the tools of mass oppression is an act of heroism. ...","post_message":"\"This is New York. We are always New York.\""}]
