[{"comment_id":"948553515267521","commenter_b":"Hillary is a big fat liar and she will never be president.","commenter_a":"Lol","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"},{"comment_id":"1035891609764351","commenter_b":"^ Africa has the most terrorism on the daily and Nigeria in particular last three months schools had radical Muslims go in and blast kids! Hundreds dead No Americans there...","commenter_a":"Terrorism in Canada is only in the mind and children shouldn't suffer because of a bunch of paranoid adults...","post_message":"The Edmonton Public School Board has put all trips on hold as well."},{"comment_id":"10153760611904087","commenter_b":"'@username not as big of a liar as HilLiary!! She's the queen of lying, pandering and flip flopping! #WhichHillary","commenter_a":"Thank you VP Joe Biden for saying: 'I feel confident that Hillary Clinton will be the nominee and I feel confident she'll be the next president'. Coming from you that's awesome!!!","post_message":"“I feel confident that [Hillary Clinton] will be the nominee and I feel confident that she’ll be the next president,” said Vice President Joe Biden."},{"comment_id":"1765122613748965","commenter_b":"NO YOU SHOULD SHUT THE F UP","commenter_a":"#Podesta should stfu...","post_message":"'I think the men and women of the FBI are doing a tremendous job out here across the country. But the leakers should shut up,' Podesta said"},{"comment_id":"10154514715036077","commenter_b":"You will be glad to know Trump is looking to hire people like you to build that wall. Jobs jobs jobs, and then he'll send you back and bum pay you. That's how he has gotten rich on the sweat of others people like you who believe his propaganda. According to him we are all here illegally. .and a bunch of low life criminals","commenter_a":"As American hispanics, we are tired of how all of these coward racist liberals that hate America like Obama, Clinton, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, we're supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of our skin... disgusting. That's why we elected President Donald J. Trump. Help us reach more people by following our great pro-America page '@username', the only true patriotic cartoon comic strip. And let's Make America Great Again! Thank you.","post_message":"It would take 37 electors nationwide currently pledged to Donald Trump to vote for someone else to derail the election results and trigger a vote in the U.S. House of Representatives"},{"comment_id":"10153257299639071","commenter_b":"'@username another Hilidiot who will blindly vote for a woman for no other reason than wanting a female president.","commenter_a":"Let's be honest about this. The only reason they gave back access is because a court battle over this would have revealed to the public that every democratic campaign had access to those records, and when the Sanders campaign reported it, nothing was done. Which would have highlighted not only the DNC favoritism of Clinton, but of the fact that they have been working to shut down Bernie at every turn. Which would have meant public acknowledgement of Bernie actually having a chance to win.","post_message":"Bernie Sanders sued, and the Democratic National Committee backed off, but it's not over yet."},{"comment_id":"10154961510296729","commenter_b":"Lying bitch!","commenter_a":"ALWAYS REMEMBER BENGHAZI","post_message":"And I'll tell you EXACTLY what difference it makes..."}]
