[{"comment_id":"1202133839801897","commenter_b":"Charley, you are a part of Racist America too !","commenter_a":"Republican piggish bigoted racist' hate !","post_message":"The vile legislation that is now before the Senate might as well be called the \"Donald Trump Act.\" Like the disgusting and outrageous language championed by Donald Trump, this legislation paints all immigrants as “criminals and rapists.”  Local law enforcement officials, domestic violence groups, immigrants’ rights groups, mayors, faith leaders and labor groups all oppose the \"Donald Trump Act.\" This bill does nothing to keep Americans safe, and it certainly does nothing to address our broken immigration system."},{"comment_id":"10154451806701336","commenter_b":"@username no he wants to ban people ! Refugees are properly vetted - since we have had close to a million come in since 911 !","commenter_a":"Something is wrong with the America I grew up in.. it's called liberalism!","post_message":"Just In: Elderly patient and nurse shot and killed at hospital in Titusville, Florida. Police have not released information on suspect or motive. More: @webpagelink"},{"comment_id":"1258337087519652","commenter_b":"Found the domestic enemy of our Constitution. As a soldier, I vowed to defend against you.","commenter_a":"Time to disband the Supreme Court. Time to hold all these people who violate our Constitutional rights accountable.","post_message":"The U.S. Supreme Court Monday handed a legal victory to advocates of banning firearms commonly known as assault weapons."},{"comment_id":"933893426670406","commenter_b":"I'm sure Myra Hindley was a serial killer @username, that's only one name, I could name a few. Woman r quite capable of becoming serial killers. The statement is true, most serial killers start with killing and torturing animals","commenter_a":"thats how serial killers start!","post_message":"'My first bow kill lol'"},{"comment_id":"10153742340973812","commenter_b":"Just drop your Facebook account. We'll all be happier and you can be crazy all by yourself with no interruptions.","commenter_a":"Please post worthy news and not perversion... Next will be pedophiles wanting to marry little kids.","post_message":"Meet James Yates and William Smith, Jr., the first same-sex couple to get marriage license in Rowan County, KY. This was their sixth attempt to get a marriage license."},{"comment_id":"10152708719122217","commenter_b":"If she was prettier she wouldn't have been charged.","commenter_a":"Who is the complainant? If it was witnessed in person fine. However if the person offended viewed the image on google, surely they are to blame for publishing the image?!","post_message":"She was charged after flashing a Google Street View car"},{"comment_id":"10154046383106509","commenter_b":"invasion of economical immigrants/social benefits leechers under camouflage of refugees","commenter_a":"Theres awfully a lot of Military age male in these \"refugees\".","post_message":"Germany to impose border controls with focus on its border with Austria. @webpagelink"}]
