[{"comment_id":"10153966184001037","commenter_b":"She is crazy & evil!","commenter_a":"Obama started the war in Iraq?","post_message":"Sarah Palin opens up about her son's arrest: “My son, like so many others, they came back a bit different.”"},{"comment_id":"897694810421095","commenter_b":"They don't belong here. We are just a safe place until they can outnumber us and overpower us","commenter_a":"She can leave.","post_message":"This is what happened when she refused for the National Anthem. If you don't respect our country, then you can leave. Do you think she should pack her bags?"},{"comment_id":"899136066791297","commenter_b":"What? C'mon! Can the girls join the Boy Scouts?","commenter_a":"This says nothing good for Girl Scout leadership. If the leaders were of strong character, they would say \"he'll no\".","post_message":"Why would ANYONE think this is a good idea?!"},{"comment_id":"818824291595686","commenter_b":"@username. I don't live it Kentucky Faggott. Ummmm, Self -Employed Trucker. You big and Bad, bring your punk Ass on. Scatter my Brains. You ALL talk, punk Bitch. Tell your mama, to get back on the Corner, her break is up!","commenter_a":"By Law, if the man is found not guilty, they cannot Execute him. This is a Bogus Site!!!","post_message":"SPREAD THIS LIKE WILD FIRE! This man is INNOCENT! Do not stop until this is HEADLINE NEWS in the #MainstreamMedia! NONE OF US ARE FREE UNTIL ALL OF US ARE FREE!"},{"comment_id":"10153771879894714","commenter_b":"@username shouldn't of made it seem like she gets to walk away from killing someone when they wrote the sentence with the link attached.","commenter_a":"but if Caitlyn Jenner wasn't famous then she would be treated like everyone else and serve jail time.","post_message":"Caitlyn Jenner will not face criminal charges in the February crash that resulted in the death of another driver."},{"comment_id":"1354573844595375","commenter_b":"wELL LET THEM TERRORIZE THEM AND THIER FAMILIES AND LET'S SEE HOW QUICK SHE REPEATS THIS ASSINIGNE REMARK","commenter_a":"Send these twits over there to give them love and hugs.","post_message":"Oh brother!"},{"comment_id":"1136331029759977","commenter_b":"Stupid Brazillian woman. I hope she was arrested.","commenter_a":"Karen Ramsden","post_message":"Don’t mess with my man!"}]
