[{"comment_id":"10153904523824705","commenter_b":"ask your 'celebrity' wife to hand over some cash","commenter_a":"Boohoo rich boy! Would he have helped me out of my problems?","post_message":"#SaveKanye"},{"comment_id":"10154900824501037","commenter_b":"Obama is playing on Americans. He wants to play a nice guy. He knew all powers for executive orders has been striped off him. He wants to turned american workers against trump's adminstration. And gain cheap popularity from clueless workers. Obama's intentions for america is bad. this is just a cover up. Watch out. He will try something like this again even wen he knew that he doesn't have power to do so. Just to make names for himself n pave ways for his wife 2020. Am one person obama can't fool. All his doing is to put trump in a tight corner n make him look like a bad guy. His a hypocrite and no one shud take him serious. Hilary and obams wants to make sure that trump did not succeed.","commenter_a":"I hope this judge dies of pancreatic cancer.","post_message":"A devastating blow to one of Barack Obama's signature achievements for boosting wages."},{"comment_id":"10153571769331545","commenter_b":"She prolly can throw baseball better than you","commenter_a":"'@username hope I look half as good as her if I make it to 105!!!","post_message":"She's 105 and about to make you smile!  Her story: @webpagelink"},{"comment_id":"1027522093954929","commenter_b":"And she REALLY makes Alaska look like it's full of idiots. How else did she get elected Governor in the first place?","commenter_a":"And to think that was John McCain's pick for VP. Embarrassing.","post_message":"This one is a CLASSIC."},{"comment_id":"10153573918196746","commenter_b":"Danny..she can speak for herself..thank u","commenter_a":"He speaks the truth...","post_message":"'We've been looking at it (race) the same way for 20 years and here's where we are. We both have to try and understand each other,' said former New York City Mayor Rudy Giuliani on Face the Nation."},{"comment_id":"1016766741752911","commenter_b":"'@webpagelink Ninja Warrior Winner Isaac Caldiero $1 million grand prize @webpagelink","commenter_a":"That is because gayness is a disease and not a protected group. I'm so sick of gays - nee homos - queers thinking that they are the same as everyone else. They chose that way.","post_message":"'Imagine if instead of denying a license to a gay couple, Ms. Davis had sought on religious grounds to deny a license to an interracial couple. She likely would have been fired on the spot, and no politicians would have rushed to stand by her side, no matter what her sincerely held religious convictions were.'  - George Takei on Kim Davis"},{"comment_id":"10153525074207994","commenter_b":"I have one get a wifeyou lesbian","commenter_a":"Gay people should respect non-gay people's Rights and don't be having sexually Haviar out in public keep it in your own home because I don't want to see it","post_message":"Pres. Obama's opening statement on #gaymarriage ruling: 'Our nation was founded on a bedrock principle: That we are all created equal.' Watch more: @webpagelink"}]
