[{"comment_id":"983083455063224","commenter_b":"Don't apologize, you have a right to feel the way you do, you are a woman","commenter_a":"GEEZE","post_message":""},{"comment_id":"559222970918198","commenter_b":"#WomenForTrump","commenter_a":"Wow, I worked for two presidential campaigns, also as a journalist covering campaigns and in the White House. If I had a dollar for every time I was pushed, grabbed or shoved. Campaign events are feeding frenzies, if you're a reporter covering a campaign event and you don't get pushed around a lot, literally, then you're not cut out for the job. It's par for the course! Thousands of people show up at campaign events and everyone is pushing and shoving to get a piece of the candidate and their staff has a duty to protect the candidate. I was in the White House in the Oval Office with the press pool one time and an aide or SS agent pushed me after I got too close to then Vice President Dick Cheney. It never even crossed my mind to file assault charges. If you watch the video, you can ...","post_message":"\"The culture of this campaign is – as Mr. Trump mentioned from the very beginning – it's not politically correct, and sometimes telling the truth inherently is belligerent.\" Trump campaign spokesperson Katrina Pierson defended campaign manager Corey Lewandowski, saying the incident \"is a '#NeverTrump' idea.\""},{"comment_id":"10154465806735530","commenter_b":"NO! Please God, NO!!!!! Don't come here!","commenter_a":"These comments certainly prove how classy and educated Trump supporters are, lol.","post_message":"Hillary Clinton will be in metro Detroit next week. @webpagelink"},{"comment_id":"10153353951364726","commenter_b":"She is adorable","commenter_a":"Uh oh!","post_message":"Tigger finds her dinner."},{"comment_id":"10153774603359714","commenter_b":"She needs to resign then!","commenter_a":"Right Fire her..she has a job to do and it was put into law then she should uphold it or go....fundamentalist zealot","post_message":"Kim Davis said she grasped Pope Francis' outstretched hand, and he told her to \"stay strong.\""},{"comment_id":"10154884648408984","commenter_b":"The old saying ...behind a good man is a great women.... nothing wrong with that","commenter_a":"Very impressive - I have watched her handle exceptionally tough and even hostile interviews exceptionally well. Great job!","post_message":"Trump's campaign manager, Kellyanne Conway, is the very first woman to run a victorious presidential campaign. After the election, she reveals why Trump chose her..."},{"comment_id":"1313943068640455","commenter_b":"Ol bitch ass!!! Now come love on meeeee","commenter_a":"@username Amber Nicole yo ass lol","post_message":"Her mood swings are real!"}]
