[{"comment_id":"555840684604224","commenter_b":"Look how christianity views woman it's almost as bad","commenter_a":"What confuses me is why women would want to stay in this horrific religion that view women and children less than animal's. Mohammed is dead he isn't coming back !!!","post_message":"Spread this..."},{"comment_id":"1196725563700232","commenter_b":"You left out the part where Trump plans on cutting taxes on the most wealthy as well., Then there are Trump plans for how trade with China and Mexico is going to be handled, yet even now all the products that bear Trumps name are being manufactured in China and Mexico. Perhaps to show he is working in good faith, don't you think he should have them manufactured here in the US? It is quite simple to say I'm going to do this I'm going to do that but it is far more difficult to actually do them. He might say it, if elected he might try and do it but I guarantee you he is not going to \"make\" the Mexicans pay for his wall, a wall that will actually do little to stop the flow of illegals. The gun he will hold to the Mexicans head to make ...","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, preserve the sanctity of the unborn life, preserve the sanctity of the 2nd amendment ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness","post_message":"Take a look at the companies that are partnering with this pro-amnesty open-borders group!   @webpagelink"},{"comment_id":"987027218019347","commenter_b":"No you dumb ass fuck, you named 3 individuals over a period of time, now open your local paper and tell me how many blacks are killed by other blacks \"everyday\" and tell me did they deserve it? Black people need to sweep our own porch first, once we show unity, they'll have to respect \"us\"! Hell how can we war with them, if we show up to the war and half of our troops are dead from other blacks","commenter_a":"I'm so tired of y'all reporting about police killings. I wake up everyday and see \"us\" killings!!","post_message":"Stay woke.   Report shows that 1,134 people were killed by police in 2015. About 47.2 percent of those who died were people of color. Another 53.6 percent of people of color who were killed by cops were unarmed.   The study shows that young African-American men are nine times more likely to be murdered by cops than other people in our country. DETAILS ---> @webpagelink"},{"comment_id":"10153785801499087","commenter_b":"U also allow rapist into the country everytime people born.","commenter_a":"Trump wants to protect Americans. Hillary wants to allow in illegals, including rapists, in exchange for votes. Who's the monster again?","post_message":"\"We are hearing some divisive and dangerous rhetoric in this election. We have a candidate who wants to tear families apart and forcibly deport 11 million undocumented immigrants, who calls Mexicans rapists, who talks about banning Muslims from entering the country,\" Hillary Clinton said in a new video."},{"comment_id":"1859557927611142","commenter_b":"Will be done if u pulled this shit lmao","commenter_a":"@username lol😂😂😂","post_message":"Cold! #WSHH"},{"comment_id":"10153310533507629","commenter_b":"Women beater","commenter_a":"He is the scumbag of the earth.","post_message":"Fox News anchor Bill O'Reilly has been accused of dragging his ex-wife by her neck down a staircase in the couple’s home."},{"comment_id":"10156257244825725","commenter_b":"\"Multiple woman.\"","commenter_a":"Is that dan blizerian","post_message":"A man is accused of secretly recording himself having sex with multiple woman. One who was informed that she had been recorded didn't even know a sexual encounter had occurred ----> @webpagelink"}]
