[{"comment_id":"915235905266169","commenter_b":"Womanizer","commenter_a":"The hundreds of thousands of people, millions voting for Trump are not going to vote for any other GOP candidate. If this chick succeeds in unseating Trump, she might as well work for Hillary Clinton. When American voters votes no longer count, it's no longer America","post_message":"Kendal Unruh is trying to do what 16 Republican presidential candidates and at least three super PACs spending more than $20 million could not do: take down Trump."},{"comment_id":"1011883318957553","commenter_b":"Justice should have been being served all along! Hillary should already be in Prison!","commenter_a":"I release the anointing here","post_message":"We've come too far to turn back now. Make sure you're registered to vote: IWillVote.com"},{"comment_id":"10153149843920090","commenter_b":"NOT this woman ;)","commenter_a":"too bad all the women will vote for her, for no reason other than shes a woman, like the minorities voted for Obama...with no reason other than he is black","post_message":"Share this with your friends & neighbors—take the pledge to Stop Hillary! Start here: @webpagelink"},{"comment_id":"932169176839778","commenter_b":"And, they won't ever listen to us when they have all these illegals voting for them! I hope the Democratice citizens are taking note of all that is going on in our country!","commenter_a":"Americans had better listen to Anne Coulter. She is right and she is warning Americans what I have also been saying. We are losing America to illegal immigrants because of obama.","post_message":"A new Pew Poll found that only 24% of Americans want to increase immigration to the U.S."},{"comment_id":"1052630838137004","commenter_b":"This bitch know all the new snacks before they hit the streets bitch be snoring and dont even sleep","commenter_a":"@username thug life overload","post_message":"Oh No: Big Girl Back At It Again & This Time She Has Lil Terrio Rapping!"},{"comment_id":"10150578591129999","commenter_b":"she has class","commenter_a":"Sexy","post_message":"Jennifer Lawrence in Dior couture at the Met Gala. See more photos: @webpagelink Credit: Josh Haner/ The New York Times"},{"comment_id":"967606389917498","commenter_b":"YOU're gross.","commenter_a":"gross. why did you have to post a photo?","post_message":"The most sexist obituary you've ever seen"}]
