[{"comment_id":"10153598373182232","commenter_b":"Tom and Debbie: the officer was not a customer of the establishment ... Both of you should read the story.","commenter_a":"Was he a customer?","post_message":"A post going viral on Facebook alleges that a Center City Starbucks refused to allow a uniformed Philadelphia Police officer to use the restroom at the coffee shop. Starbucks says they're aware of the incident and \"taking all necessary steps to ensure this doesn't happen in the future.\" DETAILS --> @webpagelink"},{"comment_id":"589804961210083","commenter_b":"If they don't like it then they can suck chuck","commenter_a":"Love my Marines.","post_message":"These Marines make huge stand and show Muslims they're not afraid. Love it. We need to spread this and show these Marines we have their back. Do you support our troops?"},{"comment_id":"1766871976928173","commenter_b":"We have no idea what he's going to do, he's never been given a chance, The Clintons however.....what have they done? Let's see, when in office 1 went on trial for impeachment. The other has numerous investigations against her for treason, putting our national security at risk multiple times, accusations of selling American uranium to Russian companies in exchange for massive donations to \"The Clinton Foundation\" who was soliciting funds to send to the Haitians who were devastated by one of the worst earthquakes in history, yet only received a small fraction of what was raised......and while consumed with sealing her deal with the Russians, neglected action in Benghazi which cost the lives of US soldiers......... So, I don't know what Trump will do, but if I had to pick between the lesser of two evils, I would say you can't get much more evil than that witch who camouflages ...","commenter_a":"We truely don't want him in our state. We have his lil brother John Bel Boma and that is enough. We'll just hold on until Trump wins.","post_message":"Dear Mr. President: How’s the vacation going on Martha’s Vineyard? Pretty swell place for sure. Ocean breeze, beautiful homes, and packed out with America’s top 1% of the 1%—you must be in your element. And golf? I’m sure you’re playing so much golf, you’re getting almost tired of it. But then, you never tire of golf. You just seem to tire of that “Presidency thing.” My neighbors in Louisiana aren’t having it so good, Mr. President. They are underwater—again. Historic floods that have impacted or destroyed 40,000 homes and left thousands of families homeless are sure ruining their hopes for a summer vacation this year. Probably will take away hopes for a summer vacation next year as well. Their once nice homes are now waterfront property. In fact their homes don’t just front the water—they are IN the water and the water is in them. I realize that in the ..."},{"comment_id":"10153518895070326","commenter_b":"And who believes her??? This must be a \"Clinton Joke\".","commenter_a":"the old scritch she does know how to lie though,,and has lots of crooked schemes up her sleeve","post_message":""},{"comment_id":"10153331151986336","commenter_b":"Take her out Carly . We need a trustworthy Woman in the whitehouse.","commenter_a":"Thanks for sharing this I will be praying God will greatly use Carly .","post_message":"\"Hillary Clinton has demonstrated over and over again that she is not transparent. She will clearly be the [Democratic] nominee, and somebody must take the fight to her.” – Carly Fiorina"},{"comment_id":"10153122527121051","commenter_b":"Freedom bitch do something about call for help911 ..","commenter_a":"Hey Gonzalez: take your ass back to Mexico since you think you should fly the American flag upside down and the Mexican flag next and in equal position to the American flag. I was born in Cuba but will never fly a Cuban flag. I am an American and there is only one flag for me. You want to disrespect my flag and fly that rag of yours, go the hell back. BTW, you think there is racism against Mexicans, look at the way you act and then see if you can come up with any reasons American citizens might have a problem with Mexicans.","post_message":"An outraged military veteran took one look at this man's flag display and intervened. Soon after, he got a visit from the police"},{"comment_id":"659276420929603","commenter_b":"I guess she could go back to Africa Ebola does that ring a bell","commenter_a":"Dam she's got lips like monkey boy.I bet she could suck the crome off a trailer hitch.","post_message":"This entitled woman just demanded a free drink... Because of slavery? This is absolutely ridiculous. We owe her nothing. Should she be compensated for slavery?"}]
