[{"comment_id":"10153030925550927","commenter_b":"She'll starve.","commenter_a":"Go back to sex worker ... Your jokes are not funny ....","post_message":"Comedian Margaret Cho admits she was once a \"sex worker,\" says \"There's no shame in it. ...\" But she didn't stop there!"},{"comment_id":"10154435925811509","commenter_b":"Stz! Sexually transmitted zombies","commenter_a":"This is it. This is how zombies start.","post_message":"CDC confirmed the first case of Zika virus being transmitted sexually in the U.S. Dr. Sanjay Gupta has been following this fast moving story closely and is here live to answer your questions. What do you want to know?"},{"comment_id":"10153621477392293","commenter_b":"Holy crap. Did you even read it?","commenter_a":"UCMJ does prohibit frat w subordinates. This was NOT RAPE. Rape is not consensual. She was consenting then because he pulled away? She claims rape?? Not fair. If she wanted to be an officer then suck it up buttercup.","post_message":"A Naval Academy teacher fights to prove he’s innocent of sexual misconduct. Then a lost cell phone is found."},{"comment_id":"10153889638518598","commenter_b":"You have it all wrong. The time to take-down Planned Parenthood and stop the murder of babies is now.","commenter_a":"Excellent! State's rights in action!!","post_message":"BREAKING: Kansas Governor Sam Brownback Signs Bill to Permanently De-Fund Planned Parenthood"},{"comment_id":"1148538801848206","commenter_b":"Get well soon.","commenter_a":"That was an amazing thing he did. He is too be commended. Oorah","post_message":"BREAKING NEWS"},{"comment_id":"958480264190210","commenter_b":"From this little shrimp? He couldn't lick his lips!","commenter_a":"The high-water-mark of this idiot's journalistic career was his appearance on \"My Name Is Earl.\"","post_message":"It is amazing that Fox keeps Geraldo around. He does this childish stuff all the time."},{"comment_id":"638139039652611","commenter_b":"They paid her less cause she sucked ass!","commenter_a":"It's true cause Brian Williams was there","post_message":"YEAH!!!!!!!!!"}]
