[{"comment_id":"10153640663754205","commenter_b":"#LetThemEatTrump #FuckTheDNC","commenter_a":"Hillary will have us in a war with Iran. We need to avoid Hillary at all cost.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1795749220655470","commenter_b":"The point is assult rifles are banned already....","commenter_a":"Too bad what you carried in Iraq was a selective fire M4, not a semi-auto ArmaLite rifle, you can't teach common sense, but you can at least know the difference between an Assault rifle and a AR-15","post_message":"I know assault rifles. I carried one in Iraq. They have no place on America's streets. #Orlando"},{"comment_id":"10153428454984087","commenter_b":"She is the biggest liar in history ,ashamed she was the first female to prove it.. Disgraceful bitch.","commenter_a":"Go go go >3","post_message":"'Do you believe that The State Department, on NEW YEAR'S EVE, just released more of Hillary's e-mails,' Donald J. Trump tweeted. 'They just want it all to end. BAD!'"},{"comment_id":"666544360165278","commenter_b":"'@username, Mexico has a wall on their Southern Border and they swear it has dropped the amout of illegals in their country from Guatemala by 2/3rds. That's 66% less illegals if you can't understand what 2/3rds is. And No, Mexico can't do us more harm, only our Politicians like Clinton, Johnson and Stein can. Don't let them give America away.","commenter_a":"Sadly, we have become a society where protecting borders is not even an issue. It must be done because of the outside terrorists. Then our people could concentrate efforts significantly more on internal ones. I cannot believe I just wrote that. Trust in God.","post_message":"Truth."},{"comment_id":"10153513195292439","commenter_b":"Too bad for the Muslims that look at a natural act of breast feeding as obscene. They can cut off heads and introduce their babies to horrific killings and slaughter and raise their kids as killers. That is what is obscene.","commenter_a":"Muslim women do NOT have tits.","post_message":"'@webpagelink"},{"comment_id":"10154321857710575","commenter_b":"Another loud mouth fat bitch and if you want to live se some weight cut off your head","commenter_a":"If you think this woman is a hero, go get your gun and shoot yourself with it, it is a better choice than what is coming","post_message":"Unbelievable . . ."},{"comment_id":"10155066406976509","commenter_b":"Don talking bull**** without proof !","commenter_a":"Everyone dopes in the Olympics China, USA, Germany you name it, everyone, the Russians were just dumb enough to get caught.","post_message":"BREAKING NEWS: Russia has failed in its quest to have a ban on its track and field athletes at the Rio 2016 Olympic Games overturned."}]
