[{"comment_id":"507357776079666","commenter_b":"This bitch","commenter_a":"What a whacko...and who says 'keen' anymore?!","post_message":"Look at me! Look at meeee! I'm better than Hillary!   -Linda"},{"comment_id":"10153846038466336","commenter_b":"Smug calculated shrew. She's nothing short of evil. WHY ISN'T SHE IN PRISON?","commenter_a":"She is a lying self serving witch and she has a list of dead people that believed in her and knew to much that could destroy her and Bill.","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"10153254400059228","commenter_b":"What a Negative Nancy!","commenter_a":"This is prolly the biggest lie I have heard yet.","post_message":"An Ohio woman searching for her biological mom got the surprise of her life Monday when she learned her mother was a coworker."},{"comment_id":"615120388649797","commenter_b":"I don't think it should be considered treason, I think it IS treason. How do you Snopes check this? And where is the link to the Washington Post article?","commenter_a":"Guys we have no choice. They are so advanced we have no choice","post_message":"This should be considered treason."},{"comment_id":"10155084835104203","commenter_b":"Has she tried cbd oil?","commenter_a":"My mom who has stage 4 cancer... Tried juicing for almost a year, cutting out eating 'real' food almost all together... Ended up doing more damage to her gut than good. Bodies are made to eat food and not meant to get over loaded with vitamins and nuetrints from juicing 40 carrots. I think in small doses it can be beneficial but not as a replacement","post_message":"Even in Trump's America, juicing is still awful."},{"comment_id":"10154951315667235","commenter_b":"Oh, well, let's just kill the bitch. Thank goodness there are smarter people in America than people like you. Pick a fight that matters.","commenter_a":"Not going to watch her. She has no credibility or can be trusted. She was part of the Obama hate and lies machine that paid her millions of dollars to create the monster who is going to be our president. I am not going to watch her. Get trusted news from FSTV.","post_message":"That time Megyn Kelly told children that Jesus and Santa were white?  It wasn't the only time..."},{"comment_id":"1672686459685954","commenter_b":"She once said she want to let more come in than Obama it is a joke that she cares about us. I would not mind a women in the white house, but not her. Also I do not want her husband messing around there. How could she make good decisions worrying about him cheating.","commenter_a":"Neither. It's Germany. @webpagelink","post_message":"The mother of a police officer who was killed by an illegal immigrant speaks out in support of Donald J. Trump due to his strong stance on illegal immigration. @webpagelink (via Fox & Friends)"}]
