[{"comment_id":"10155261002826509","commenter_b":"I can tell you as a white American that she's not going to help me or my family either.","commenter_a":"I love how all you white Trump supporters are trying to convince African Americans how Donald Trump can help them and Hillary Clinton can't when you probably have no freaking idea what the African American Community needs. Hysterical. I know you don't like the analogy, but it would be like Adolf Hitler's supporters trying to convince Jews that the Nazi party is better for them.","post_message":"Senator Jeff Flake says, 'I simply can't' support Donald J. Trump. cnnpolitics.com"},{"comment_id":"458537397670174","commenter_b":"NO She can Stick it !!!","commenter_a":"No way and the kids are not going to either.","post_message":"Will You Cave To Michelle And Only Eat Where She Wants?  Comment 'yes' or 'no'."},{"comment_id":"10153241147678984","commenter_b":"They can go crawl up a hog a-- with there counter parts the muslims.","commenter_a":"All the way !!!","post_message":"The stuff liberals are already saying about Ted Cruz is just disgusting...  Do you support Ted Cruz in the face of liberal criticism?"},{"comment_id":"1069087446447636","commenter_b":"Put her on the street .","commenter_a":"She looks flashy","post_message":"The liberal media loved Michelle Obama's tang SOTU dress.  Take a guess at how much it cost."},{"comment_id":"1538102683151787","commenter_b":"What a bitch","commenter_a":"That was totally uncalled for she was just trying to start trouble!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO]  Racebaiters will never say anything about this.  What would you do in this situation?"},{"comment_id":"1485178544875222","commenter_b":"Of course we had an impact in the region through corruption but Saudi armed Sunni rebels in Syria to overthrow Assad which formed ISIS, the US is supporting groups against Assad so that Saudi can build a pipeline to Europe and destroy Russia's main source of income","commenter_a":"It does make sense though, when you think about it. Would you just accept thousands of people without carrying out appropriate checks (ie checking if they have criminal record, etc)? You wouldn't. Seeing what has happened in Europe in the last year or so is all the more reason for countries to tighten their borders. Also, people have been spreading this meme for ages so it's nothing new.","post_message":"So crass"},{"comment_id":"968036809901222","commenter_b":"Take the criminals away first","commenter_a":"FAST & FURIOUS ???","post_message":"This is one of those times where a picture is worth a 1,000 words!"}]
