[{"comment_id":"10154261314153525","commenter_b":"He had it made on Howard channels. Then double crossed hogan with the tapes etc. Dirt bag. How many times can he use the connection with tony Stewart. He is a Howard copy cat with less talent.","commenter_a":"Jimmy","post_message":"JUST IN: Bubba the Love Sponge is off the air in the Tampa market. MORE: @webpagelink"},{"comment_id":"997479846960469","commenter_b":"Statements of a failed leader","commenter_a":"Not president U S president","post_message":"President Barack Obama said on Friday that the strategy adopted by Russia in Syria is a \"recipe for disaster.\""},{"comment_id":"10153023631106770","commenter_b":"She should leave right away!","commenter_a":"OHHH so you weren't bothered by the USA Planned Parenthood baby chopping business? You weren't bothered by Hillary's stupidity with her email? You weren't bothered by Racists looting and burning Ferguson? You aren't bothered by Miley Cyrus twerking on TV for young girls? I see. You were bothered by the GOP debate... Right.....","post_message":"Emily Blunt said becoming an American was “strange and slightly disarming.”"},{"comment_id":"10153825778449877","commenter_b":"So what now only black women have abortions! GTFOH!","commenter_a":"No words. Just disgust","post_message":"College Newspaper Cartoon Depicts Black Woman Being 'Late' for Her 'Abortion.' Oh, and she was wearing a Black Lives Matter T-shirt. Read the full details below. Grio fam, what in the world is going on here?"},{"comment_id":"481790668675893","commenter_b":"GET THIS TROUBLE MAKER OUT OF THIS COUNTRY ....BEHEAD iSLAM","commenter_a":"Now that is one hell of a costume","post_message":"ARREST HIM!!!!!!!"},{"comment_id":"1521185254588608","commenter_b":"You're talking dt supporters, wd you expect anything else?? RFLMAO!!","commenter_a":"Honest to god this is the dumbest shit I've ever seen.","post_message":"Starbucks is probably guffawing over how effective this isn’t."},{"comment_id":"517851475047476","commenter_b":"One ugly dumb coward.","commenter_a":"This guy should be selling catsup in his front yard .","post_message":"This is the fourth deadline extension since an interim deal was struck in April."}]
