[{"comment_id":"1137064162981260","commenter_b":"Mold on the apple","commenter_a":"Grrrrrreat. *head desk*","post_message":"A huge new study has confirmed that we are in the middle of an extinction event, the likes of which hasn't been seen since the dinosaurs went extinct."},{"comment_id":"10153046924231519","commenter_b":"'@username, when has Ann Coulter ever told the truth?","commenter_a":"I cannot stand the mind of Ann Coulter or the things that she says. But the personal attacks don't add anything to the argument. There's plenty of solid evidence to dispute among the things she says and has written. 'Old and sad,' 'horse face' and other things don't contribute to the discussion. They make the left look as bitter and unreasonable as the extreme right.","post_message":"This debate is a perfect example of how right-wing 'facts' make their way though the delusional echo chamber..."},{"comment_id":"619582968232282","commenter_b":"She has to go","commenter_a":"Yea","post_message":"Michelle was just caught red handed and is about to be charged with treason.  Good. It's about time she was exposed.  Do you agree Michelle Obama does not belong in the White House?"},{"comment_id":"10153884646907183","commenter_b":"Why you picking on us white folk here in Georgia? Keep that bitch far away from us!","commenter_a":"Katrina Pierson should be in Milwaukee or Georgia. The media is paid to review everything Trump said and to soil it. They don't care about the real news, another cop assassinated through race- baiting rhetoric from Obama and HRC. Milwaukee is rioting. The streets of Chicago are still killing fields. Clinton is racketeering money through the foundation in pay for play schemes. Yet Ms Pierson has only one thing to do on this Sunday. Find dirt on what Trump said and exploit it. Is this the kind of values we should accept from these UnAmerican sewer-valued people?","post_message":"Did you ever hear of a 'novelty tradition' in politics?"},{"comment_id":"1038590639515127","commenter_b":"Jennifer BTW how is that being a bitch. Bitch?","commenter_a":"And ALL of their body guards carry guns","post_message":"This video is packed with more celebrities than we could count — and they have one powerful message for the world."},{"comment_id":"10153987272260667","commenter_b":"Readup Trump's plans for America @webpagelink","commenter_a":"I'm over this, I am over ALL of this nonsense!!! This entire Campaign is an embarrassment to the world!! #AbrahamLincoln2016","post_message":"Here’s how it all started."},{"comment_id":"10154528974934062","commenter_b":"I want to meet Bruce Jenner aka caitlyn","commenter_a":"Don't care","post_message":"Jenner is apparently in town filming her new television show, 'I am Cait.'"}]
