[{"comment_id":"10153580270695575","commenter_b":"If this is true, which I'm sure it is, how sick. But this is what the female liberals want. Oh is saying female liberals not PC?","commenter_a":"The Missing link!","post_message":"The Gateway Pundit - Muslim Dad Kills 4 Year-Old Daughter for Not Covering Her Head"},{"comment_id":"1256135284407480","commenter_b":"Er, spider silk has almost nothing to do with a spider's reproductive system, other than if some species use it for mating rituals. So I don't think you can rape a spider. If they were to take off the harmless pins, it would find a corner and immediately start building a web, because it's a spider and it has no conscience. The closest I can relate to this spider is giving blood.","commenter_a":"Wow. That's horrific and pretty fucked up","post_message":"Poor spider!"},{"comment_id":"10158325140525725","commenter_b":"Yea !! Thank god that I wouldn't waist my time on those losers !!","commenter_a":"If they gave them to me I wouldn't go !!","post_message":"Looking to get out of last-minute Christmas shopping or away from your in-laws? Then Saturday's Chicago Bears home finale could be your answer."},{"comment_id":"10153624257330695","commenter_b":"She should have gone after her husband instead of the mistress. It takes 2 to tango","commenter_a":"i think she was pissed!!!!! people need to quit cheating on their spouses, i can relate to this!","post_message":"Carroll County deputies say she led them on a chase down I-20 before killing the woman and then herself."},{"comment_id":"684673561687958","commenter_b":"Your right I will vote female when it's right and it won't be Chelsea Clinton either. MAYBE IVANKA TRUMP.","commenter_a":"I would have no objection voting for a QUALIFIED female for president. However, I will not vote for anyone of any gender, color, or nationality that is a liar, is a thief, etc to run our country further into the ground. This election is not the time to vote for a female president.","post_message":"'For all you women out there who think that electing a female president will lift us all up, just ask yourselves if electing an African American president lifted up the blacks in this country.' – Judge Jeanine Pirro @webpagelink"},{"comment_id":"530286710492597","commenter_b":"When are we going to smarten up and deport Muslims and ban Islam once and for all.","commenter_a":"The Quran says it's ok to lie to the infidels . Can't believe anything they say","post_message":"'How would you stand before God and answer to your crimes against… thousands of innocent people – Muslims, Christians and other minorities? You do not speak for us. You do not represent us. You are an aberration. You are an outlaw.'  The CAIR  national director condemned ISIS and their supporters in the wake of the #OrlandoShooting."},{"comment_id":"10154239816884197","commenter_b":"'@username Oh, you're so right. High capacity horsepower cars are designed to kill people. High capacity weight vehicles are designed to kill people. We need to ban all cars. They are designed to kill people.","commenter_a":"Maybe we should hold automobile manufactures accountable for deaths caused by automobiles. We should hold knife manufactures accountable for stabbing deaths. Train manufacturers accountable for death by trains. I can keep going on but the PERSON is to blame not the object.","post_message":"It's been a hot topic. Where do you stand? Vote in our poll: @webpagelink"}]
