[{"comment_id":"10153866991751130","commenter_b":"@username You racists seem to always LOL, when you are exposed.","commenter_a":"Love this idea. I hope all the black LIES matter racists move to Canada. They can take all the haters, like Al Sharpton, Jesse Jackson, Louis Farrakhan, and Comrade Obama with them.","post_message":"Canada's black guy weighs in on race and politics in the U.S.  The Canada Party  Outspeak"},{"comment_id":"10153634923619885","commenter_b":"Nah she's a girl, but keep on denying. Y'all have a lovely day.","commenter_a":"That brat holding up that sign probably wouldn't want this person using their locker room either. So it's go with the ladies where you are not welcome, or go with the boys who will treat you like garbage. This is stupid. Leave this young person alone and let her get an education.","post_message":"Students at Hillsboro High School briefly walked out in protest Monday morning as part of a dispute over whether a transgender student should be able to use gender-specific locker rooms."},{"comment_id":"1192416514111710","commenter_b":"Then he cuffs the man after shooting him in the back smh","commenter_a":"How in the hell do you feel threatened by a man who is running in the other direction? This guy is full of crap.","post_message":"Former officer Michael Slager: \"What makes me upset is that nobody knows what actually happened.\""},{"comment_id":"10154557773663203","commenter_b":"Its like sayin that one is born an alcoholic or a chain smoker... It is a LEARNED action","commenter_a":"Uh...no, most Americans don't say that!","post_message":"Are gays ‘born that way’? Most Americans now say yes, but science says no"},{"comment_id":"10154363261003816","commenter_b":"Pack your bags libs, because the wall is going up.","commenter_a":"If you're to dumb to get an ID you don't deserve to vote","post_message":"In testimony and filings in the case, the plaintiffs said that blacks and Latinos make up 44% of those seeking a free ID to ensure they can vote but only 9% of the overall voting age population in Wisconsin."},{"comment_id":"10153400550747042","commenter_b":"Good thing those girls were white, if they were black they probably would've been arrested","commenter_a":"The cops are doing their job! These girls are breaking the law. Now let's give the cops a big round applause (being sarcastic)","post_message":"KIDS' STAND SHUT DOWN: They were trying to earn money to buy their dad a special gift for Father's Day."},{"comment_id":"822546624556646","commenter_b":"Trying to straight-wash and white wash the situation is terrible. Not only was this guy scoping out gay bars before, he also chose to go on Latinx night, when most of the patrons were PoC, generally of Latin descent. So this was a hate crime. It had to do with race, it had to do with sexual orientation. You trying to bury those facts is deplorable.","commenter_a":"This isn't a gay attack. It's a terrorist attack that's being portrayed as homophobic because that's a cause people will rally for. Anything to further your agenda. No one wants to believe it's radical Islam, but that's what this is. Of course his family and even his own tweets blame gays. A gay bar is a perfect target so we can blame homophobes and call it a a hate crime. Well terror is also a hate crime and gay or straight these people are dead.","post_message":"President Obama on Sunday morning's mass shooting at a gay nightclub in Orlando, Fla. It's the deadliest mass shooting in U.S. history. @webpagelink"}]
