[{"comment_id":"1033509070100318","commenter_b":"@username yes you god damn do! Women throw sex parties and drink alcohol through dick straws for Christ sake! Most women are guilty of cheating at some point in their life. That's what we as a species do, we eat and have sex. Like or hate it, men hunt for women and women love it","commenter_a":"I find it very sad that WOMEN are defending it, what the fuck is wrong with you? I'm sorry you feel that you should allow a man to have his way with you. It's sickening.","post_message":"EPIC! Oh, and the woman in red is a REPUBLICAN! This happened tonight on CNN. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"698556140299300","commenter_b":"shes a winner","commenter_a":"Recount now!","post_message":"We're at Trump Tower in NYC standing up for voting justice."},{"comment_id":"505614509629101","commenter_b":"Kendra Alison and Edward Michael Davila. The story continues.....","commenter_a":"Alison Anderson! Ann DuBay!","post_message":"Announcing the news today, his attorney tweeted in all-caps: \"WE WON A NEW TRIAL FOR ADNAN SYED!!!\""},{"comment_id":"916443248422431","commenter_b":"Wow what a bitch!","commenter_a":"@username sad","post_message":"SMH: Mother Tries To Abandon Her Son In The Street!"},{"comment_id":"10152610219894071","commenter_b":"Gabriel Emilio","commenter_a":"Bates PAPA Creighton","post_message":"They're killing it right now."},{"comment_id":"10153108575014726","commenter_b":"Obama working to hamstring America from fighting the Jihad @webpagelink","commenter_a":"obama is an appeaser and weakling","post_message":"WATCH: The Netanyahu speech that is throwing Obama off his game!"},{"comment_id":"636474266540179","commenter_b":"She's an idiot!!","commenter_a":"I watched her speech on the live stream and was absolutely blown away. Credit is definitely due to the writer, but Ashley's delivery was perfect. The emotion as well as strength behind those words brought tears to my eyes!","post_message":" am nasty like Susan, Elizabeth, Eleanor, Amelia, Rosa, Gloria, Condoleezza, Sonia, Malala, Michelle, Hillary! Ashley Judd at the Women's March on Washington"}]
