[{"comment_id":"1149773515076812","commenter_b":"Hillary should be in prison.","commenter_a":"Intelligent much??? I heard she said he was like an octopus...with six arms...omg","post_message":"OOPS! HILLARY'S HIT WOMAN LIED About Trump Groping Her…Eye-Witness Comes Forward: \"It was she that was the one being flirtatious”"},{"comment_id":"1162663783801971","commenter_b":"I stopped reading at \" good man \" Trump is far far removed from being a good man..","commenter_a":"Trump, regardless of what people who don't even know you say, I believe you're a good man & have good intentions for this country. Don't get sucked into what the government or anyone else wants you to do. You've called on Jesus to be your Lord & Savior & I'm proud of you for that because I know that the moment I did, He changed my life forever. Seek Him & all He is & He will give you all of your hearts desires. He's God, all His riches & glory will never compare to money, just stay focused on the Lord & you've got this! Trust me. He loves you.","post_message":"The spirit is amazing --- thank you to this homeowner in Florida for their support."},{"comment_id":"10154131291436756","commenter_b":"Dinosaurs eat man. Woman inherits the Earth.","commenter_a":"God creates Dinosaurs. God destroys Dinosaurs. God creates Man. Man destroys God. Man creates Dinosaurs.","post_message":"\"God made man, man rejected God, and God won't stop chasing man until he wins him back. And that's the simple story of God\" — the very story Franklin aims to tell with his music, without all the rules of religion."},{"comment_id":"10154456298447169","commenter_b":"I might add that she also stated that America was against immigration, that is a oxymoron statement, she's here!","commenter_a":"If a wall goes up, you are free to live on whichever side of it you want.","post_message":"\"Berlin didn't start out just with a wall coming up innocently, the Russians shooting everybody. It starts gradually and it gets worse and worse.\" \"The [Berlin] Wall was meant to keep people in because the Communist system was so horrible. This wall is being designed to protect our borders.\" An emotional debate broke out between participants at the \"First 100 Days\" Immigration Town Hall when comparing President Donald J. Trump's border wall plan & the Berlin Wall. Read more: @webpagelink"},{"comment_id":"1036060346447359","commenter_b":"No. They're asking for 80million guns to be pointed at their stupid ignorant ugly faces.","commenter_a":"Are they asking for another wounded knee?","post_message":" never seen anything like it, Cleveland resident Sheila Rodriguez told Fox News Latino. everyone is gathered in one place and everyone attention is focused on one place, a lot of things can happen."},{"comment_id":"622131437962489","commenter_b":"That's a women? Wtf","commenter_a":"Stevo Reed bruh","post_message":"Freddie Gray’s mother Gloria Darden pledged to keep fighting for her son after news broke that all remaining cases against the officers charged with his arrest and death would be dropped: @webpagelink"},{"comment_id":"771105652991563","commenter_b":"It would be a GREAT PLACE TO START.","commenter_a":"Yes","post_message":"It is widely known that George Soros was affiliated with the Nazi Party, and he's also a major financier of a number of democrat programs."}]
