[{"comment_id":"10153921301277217","commenter_b":"@username has lost their integrity!","commenter_a":"Hahaha.sorry for the laugh. But @username Please investigate first before you conclude on this report. These are all accusations to our beloved president . even his rival denied those witnesses that testified in the senate. sad to say our president's rival now is doing the best they can to destroy our only hope to have a drastic change in this country . BTW You need to go to our country first to know more abt the facts and whats really happening here. :3 -_- #PostResponsibly -_-","post_message":"Gruesome gangland-style hits, including feeding one victim to a crocodile, were described to a Senate hearing by a former death squad member."},{"comment_id":"10153560600894087","commenter_b":"DUDE ....PAYED FOR? ....REALLY? ....Hillary Clinton is the biggest political whore to ever walk the planet....SMARTIN UP","commenter_a":"Chris Christie is bought and paid for. Don't be surprised when he gets a position in Trump's cabinet. Donald Trump is used to paying off politicians. And some think he will change things in Washington. Lol. What a joke. \"I've got to give to them. Because when I want something, I get it. When I call, they kiss my ass.\" - Donald Trump on giving money to politicians.","post_message":"“Get in the plane and go home,” Donald J. Trump told Chris Christie after the New Jersey governor introduced the real estate mogul at a campaign rally. WATCH:"},{"comment_id":"10153982489146438","commenter_b":"talentless racist bitch","commenter_a":"talentless bitch","post_message":"It's an incredible visual album, but how is it as an aural album?"},{"comment_id":"10153396919359087","commenter_b":"X Liberal Pussies who Pimp for Islam! It's Simply one of the MOST Bizzzzaaarre Psychological Spectacles of our Time! The ODD Relationship (do I say \"Love Affair\") between ISLAM and LIBERALISM is a WEIRD thing to watch. HELLO!! Liberal FEMINIST Women!! Islam is a SEXIST Male Dominated, Woman TRASHING \"Religion\"!! Liberals MOCK, RIDICULE Christianity, then turn around and Protect Islam's 1400 Year \"War on Women\" which Treats women like Chattel, and Stones Women to DEATH for adultery. \"Honor Kills\" women when their men feel their women aren't obedient, Muslim MEN FORCE Women into castration, Slavery, to wear scarves, and Burkas!! Muslim Women aren't allowed to Drive and be Educated yet Liberals want to be \"tolerant\" to Islam, but want Christianity to CHANGE!!?? Oh, and GAYS end up on the wrong side of the Stones/BladesToo!!","commenter_a":"Thank you President Obama. I'm so glad I'm not a pussy like most of the commenters here that live in fear of the great big scary Muslims. It must suck to go to bed at night clinging to their guns and religion wetting their pants afraid that Muslims are coming to kill their family. I'm glad I have a president that rises above that childish fear. I'm blessed that God hasn't made me a coward like so many of my countrymen who would gladly trade their freedoms for the veined vail of security. Cowards all of you. And I already know their response. They will call me a delusional libtard that loves Muslims. Without realizing the irony that these were the same people that called white civil rights activists \"n***ger lovers\". This generation of dolts, will too, be wiped away with time.","post_message":"“It was so moving for Michelle and myself in part because it was so representative of the country. You had people from every background, every faith,” President Barack Obama  said after meeting the families of San Bernardino victims.  “Some described their loved ones who had come to this country as immigrants; others who had lived in the area all their lives — all of them extraordinarily proud of the work they were doing to keep people healthy and safe here in this community.”"},{"comment_id":"10154121936472894","commenter_b":"Yes... trip his ass!","commenter_a":"I don't understand why some dudes so quick to wanna shoot at other dudes over money & drugs.. BUT NO ONE HAS SHOT THIS FOOL YET! Some thug nigga, PLEASE COME BE MVP. Make that sacrifice. 😂😂😂😂","post_message":"George Zimmerman Kicked Out of a Bar After Calling the Manager a Ni*ger Lover"},{"comment_id":"10153475674267452","commenter_b":"Illegals for a living too.. And pay taxes and guess what they don't get a refund. Securing borders? Fix the immigration system it's hard becoming legal.. The system is he problem not the illegals..","commenter_a":"Congratulations on not being an illegal immigrant and working for a living. Trump is not against immigrants he and many other Americans are against ILLEGAL immigrants. Oh and your protest in Canada doesn't mean a thing in the USA.","post_message":"In protest of Donald Trump’s immigration policies, a construction worker hung a Mexican flag atop the Trump Tower in Vancouver, Canada. abc7.la/1W7pFVh  “While working on your tower, Mexicans didn't steal anything nor raped anyone. We just did the best work we could possibly do, for ourselves, our families and the future tenants in your building.”"},{"comment_id":"10155382822311729","commenter_b":"Dumb ass","commenter_a":"What legacy?? Racial divide war on our police officers open our boarders to ever illegal and terrorist trillions of dollars in debt millions on vacations for him and his family no decent jobs no affordable healthcare despicable treatment of our military and veterans... shall I continue I say good riddance finally this country is going to get a leader who's for American and its people we have hope finally","post_message":"Yes."}]
