[{"comment_id":"10153926157556337","commenter_b":"Ronda is the only person to go and ask patricks wife for permission to do the role and movie.","commenter_a":"Companies are trying to cash in on Patrick Swayze's death.. Since his Death they've remade Red Dawn Point Break And now they are remaking Dirty Dancing. I'm sure a Road House remake will be coming soon..","post_message":"SHOULD YOU SEE the Point Break remake? Only if you like to have fun..."},{"comment_id":"10154295725641162","commenter_b":"@username Says the ignorant person. I'm not trashy, so I won't stoop to your level.","commenter_a":"Time to take the trash out. Waited 8 years for this.","post_message":"Pres. Obama *literally* drops the mic at the end of his last White House Correspondent's Dinner: @webpagelink"},{"comment_id":"1318403084859330","commenter_b":"They wont be missed","commenter_a":"Awwww!","post_message":"There are some deaths that don't make us cry."},{"comment_id":"922010884502919","commenter_b":"If the perpetrator uses a handgun we get ban handguns, if he uses a magazine fed we get ban those, shotgun we get ban those, folding stalk we get ban those, black finish looks scary and military looking, we got to ban those! Where does it stop? We have millions of knives (problem in Japan) baseball bats, and cars in the U.S.! All can be used to do mass killing! Let us all be honest and cut the BS out of this subject! Gun free zones=shooting fish in a barrel! When POTUS and celebrities give up armed protection then they can give their opinion!","commenter_a":"As soon as all the criminals and government in the us get rid of all their weapons then we can talk about law abiding people curbing their guns. Until then you have completely missed the point of owning a gun for self defense. And BTW Roof got the gun illegally!!!!!! Writer doesn't understand what the word criminal means.","post_message":"COMMENTARY: Why you need to rethink some of your gun arguments. Agree?"},{"comment_id":"10153547473805950","commenter_b":"I meant she's about the most ignorant narcissistic female I've ever seen.","commenter_a":"She's about the most ignorant narcsisci femaale","post_message":"He's \"as much a scientist as I am.\""},{"comment_id":"1727638077485478","commenter_b":"Theyre cool. But they claw into you. Very clingy animals","commenter_a":"@username this is why i wana go Australia - want one asa pet lets get one","post_message":"Koala joey plays in baby basket. Via Symbio Wildlife Park"},{"comment_id":"10153166398548812","commenter_b":"If you want current news coverage, go to the news stations. Not Obama","commenter_a":"where is obama,why he is deadly silence now ?","post_message":"\"My best friend was killed and I don’t know why.\" Chapel Hill Shooting: @webpagelink"}]
