[{"comment_id":"10154412876021491","commenter_b":"Does this tour detour to the location of the White House MLK Bust? I hope they know where it is. Don't depend on Time, though.","commenter_a":"Shruti Maheshwari","post_message":"Here's how to score a major deal on a scenic getaway."},{"comment_id":"10153022135468635","commenter_b":"The Jesus I know of hung around with prostitutes, drunks and gamblers. I imagine he certainly wouldn't have used social media to put down homosexuals because he would have been too busy loving them.","commenter_a":"The strong homosexual, transgender movement today is not surprising. It is a sign of how there will be a new world order. It is disturbing but it also points closer to our seeing Lord Jesus.","post_message":"'Vines argues that while the Levitical code forbids homosexuality (Leviticus 18:22) it also forbids eating shellfish (Leviticus 11:9-12). Yet, he says, Christians no longer regard eating shellfish as wrong — so why can't we change our minds on homosexuality? Here Vines is rejecting the New Testament understanding that the ceremonial laws of Moses around the sacrificial system and ritual purity were fulfilled in Christ and no longer binding, but that the moral law of the Old Testament is still in force.'"},{"comment_id":"10153476921072217","commenter_b":"^^ dumb feminist","commenter_a":"Merge the competitions. Let's throw them all together and give them all a shot at the big bucks!! You'd be lucky to see any women get past the first round. Different competitions = different money! Dry your eyes ladies 😬👍🏼","post_message":"'Sport is not like most of the industries the rest of us work in.' 🎾"},{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."},{"comment_id":"10153677801340530","commenter_b":"Wow dicks can talk. .","commenter_a":"But, the SCOTUS said there is no racism in America.","post_message":"Community and city leaders are strongly condemning a racist flyer against blacks that was circulated in Southfield tied to an upcoming mayoral election."},{"comment_id":"1233979523321475","commenter_b":"'@username This is what I do know. He has had more than 1 stance on this. So Will the real Ted Cruz please stand up? Maybe you should learn a few things? Research... Trump does not have to do Cruz in. Give him enough rope and he will hang himself.","commenter_a":"Cruz will say anything to get elected so he can do nothing for the American people and everything for himself. Don't believe anything he said.","post_message":"Believe him?"},{"comment_id":"10153157305281636","commenter_b":"very wicked woman ! she deserve it.","commenter_a":"The states where the capital punishment extists are muderers on the level of the nation.","post_message":"Even Pope Francis made a last-minute appeal for clemency"}]
