[{"comment_id":"10153370313159071","commenter_b":"Elaine Daly 😂😂","commenter_a":"Excel is childish approach towards industry of information and finance. Furthermore the database tools it offers is fluid and prone to human mistakes.","post_message":"Mastering Excel puts you way ahead of the competition."},{"comment_id":"10154525745813893","commenter_b":"Your right ILLEGAL immigrants aren't eligible for benefits but the assumed identity they use is! Again seen it first hand! The children who are born here (AKA:Anchor Babies) are also eligible. With that in mind generally mom won't get deported and OUR government will assist her in getting a temp visa to stay. Then guess what she becomes eligible for the same benefits. Illegal documents are created at flea markets etc.","commenter_a":"Well.... Will the ILLEGAL immigrants also be boycotting emergency rooms, welfare, etc. today? If so we could save millions of tax payer dollars today..... I won't be holding my breath.","post_message":"\"Due to insufficient staffing levels, we will be closed today. Please come back and see us tomorrow,\" Torchy's Tacos - Houston Heights posted on Facebook."},{"comment_id":"828297687360808","commenter_b":"she should be dropped from Food Stamps and made to work to pay for everything she's destroyed that is not right she needs to lose a little weight anyway","commenter_a":"Jobs and multiple job... Life isn't free..","post_message":"This is exactly why people should not be given money for doing nothing.  Are you sick and tired of Welfare leeches taking your money?"},{"comment_id":"10152647999850950","commenter_b":"stupid, stupid girls. can't they read?","commenter_a":"The war on terror is taking our freedoms. The Terrorists are easily winning.","post_message":"A former chief of counterterrorism at the FBI told CBS News that he thinks some young Muslim girls are being lured toward jihad as a way of giving meaning to their lives: \"They are looking for adventure.\""},{"comment_id":"10154342648916509","commenter_b":"Shut up","commenter_a":"The decision to continue with fireworks in spite of huge fire at hotel nearby shows the sadist attitude of Arub nation.","post_message":"#NewYearsEve fireworks display continues in #Dubai as nearby hotel is engulfed in flames @webpagelink"},{"comment_id":"984804904949095","commenter_b":"They had the taser pointed at him which caused him to panic most likely why not use the taser??? The other 2 cops didn't shoot and did not feel they were endangered.","commenter_a":"@username keeps stirring the pot against cops. I hope one day, you folks need a cop. Crickets is all you'll hear.","post_message":"In 2013, Officer Randal Kerrick shot former Florida A&M University football player Jonathan Ferrell, who was unarmed, 10 times."},{"comment_id":"788206447982585","commenter_b":"The trump train is heading for the trump wall. toot toot.","commenter_a":"Hurry Hillary call Wall Street call @username call AL Sharpton because your gunna need all the help you can get. The Trump Train is rolling straight for the White House !!!","post_message":"Hillary Clinton and her allies are preparing for the fight against Donald J. Trump."}]
