[{"comment_id":"880499385321632","commenter_b":"100% yes.","commenter_a":"Absolutely","post_message":"Do you approve of this change?"},{"comment_id":"10154043419071336","commenter_b":"First, voter fraud exists. People have gone to jail for it. And for every 1 person caught, you know there are more who aren't caught. And yes, foreign nationals who broke our laws to come here ARE less trustworthy, THEY BROKE OUR LAWS. We have enough home grown US haters and uninformed voters, we don't need to add people here illegally to the mix. They have no right to vote. If we can't ensure legal elections we are not protecting our sovereignty. Add that to unsecured borders and there is no USA any more. Try going to Mexico (or any country) illegally, see if they welcome you and let you chose their leaders. We are not bad people for wanting the same protections in our country that other countries offer their citizens.","commenter_a":"You mean undocumented democratic voters, right? CA has now given the right to vote to illegals. Supposedly in local races only. Who really believes that BS? What safeguards are in place to prevent them from voting in national races? None. And allowing them to vote in the first place is against the constitution. Just like illegals holding office is against the constitution. I shudder to think that CA's PC crap will pour into other states.","post_message":"\"We believe that this new law increases safety on California roads by putting licensed drivers behind the steering wheel,\" a spokesman for the California Department of Motor Vehicles said."},{"comment_id":"10155061225139726","commenter_b":"The woman wearing this would probably be beaten to death. Better off carrying a gun!","commenter_a":"Women in America carry guns. What are we back to the middle ages? women at the time wore chastity belts to protect themselves from the muslim ancestors of the same ones today who were terrorizing Europe back then.","post_message":"It's a modern day chastity belt."},{"comment_id":"480329612157619","commenter_b":"deport all illegals","commenter_a":"and I went through 2 WTC bombings 5 months pregnant in the first one.. 2 back surgeries had and foot surgeries in the second and I could not get a dime to support myself and my daughter other than the Social Security Disability I worked for for 23 years ...in fact was told \"I made too much money to get any help\" Really????","post_message":"This illegal immigrant has been collecting welfare for 20 years... This is outrageous. Illegals on welfare should be kicked off and deported immediately. Should we deport all illegals collecting welfare?"},{"comment_id":"416198871873795","commenter_b":"I think those are pictures of women there supposed to be in capes ridiculous","commenter_a":"Why do so many pictures of ISIS soldiers depict them in clothing that would be of the worst kind for combat? Might as well give them a cape.","post_message":"ISIL’s Al-Khanssaa Brigade, an all-women fighting group, says women should only leave the house to practice medicine, teach or study religion"},{"comment_id":"10153203883521717","commenter_b":"I was raped by two women when I was 5 years old","commenter_a":"InB4 feminists saying men can't be raped.","post_message":"Human trafficker who forced men to have sex for 20 hours every day gets 11 years in prison"},{"comment_id":"10153114063969091","commenter_b":"Why wouldn't they? Everyone is scared to stand up for something. Sodomites wont be around my kids cause they're not gonna be in the scouts.","commenter_a":"Just close the organization down no one is going to send There kids with the Boy Scout leader who is gay, it's another thing to gay people have screwed up","post_message":"BREAKING NEWS: Boy Scouts expected to announce that it will allow openly gay adult leaders."}]
