[{"comment_id":"924000977633655","commenter_b":"WHY are their women like her???","commenter_a":"Why aren't ALL men like him? God bless him and that sweet, loving little angel","post_message":"His wife said she would leave if he kept their baby -> @webpagelink"},{"comment_id":"723743707725776","commenter_b":"@username Marco can't stand ya!","commenter_a":"Why don't they go after his immorality.. Didn't he cheat on two of his wives. He is no Christian and then also said he has never had to ask for forgiveness OMG Adultry is a Commandment","post_message":"Donald Trump started a mortgage company (that failed) at the worst possible time -- when the housing bubble was about to burst."},{"comment_id":"10155000451429228","commenter_b":"When the Ayatollah came to power in Iran, Iran had a major drug problem. They hung their way out of it; they didn't hang anywhere near all the addicts . . . It's just that, apparently, people can get the \"disease\" of the addiction under control if they see government is serious. **** The Nation of Islam cleaned up some housing projects in the 90s, again, with lots of negative reinforcement--then the ACLU and bleeding hearts put a stop to that. **** If such measures here could stop drug-related deaths and murders, and give people in projects safe places to live, we would have a net gain. Kindness to the guilty is cruelty to the innocent.","commenter_a":"Oh, well then . . . If criminals don't care, I guess we shouldn't punish them at all. ***** Getting real, living things seek pleasure and avoid pain. If negative reinforcement does not seem to be working, we're just not using enough of it.","post_message":"Missouri's new Governor is asking for tougher laws.  Some experts say criminals don't care."},{"comment_id":"10152908801970927","commenter_b":"No body forced you to spread your legs; and, no body forced you to have unprotected sex!!!!","commenter_a":"Cross your legs","post_message":"It's no surprise that Satanists support Planned Parenthood, but what is SURPRISING is how they showed that support ..."},{"comment_id":"1009572635788547","commenter_b":"That's terrible!!! I worry about my children everyday at school!!!!","commenter_a":"Really. Bullying. Is wrong","post_message":"A sixth-grader died Tuesday after a bully stomped on his chest during a P.E. class at a Colton elementary school, the boy's parents told KTLA.  \"This kid did it on purpose,\" said Jose Gallegos, whose 12-year-old son Dominick died after losing consciousness on the field.   However, detectives who went to the hospital where Dominick was taken said there was no evidence of an assault or physical injury that would have caused his death. Investigators are waiting for a report from the coroner's office.   Read KTLA's story here: @webpagelink"},{"comment_id":"10154664447603145","commenter_b":"Then LEAVE MY COUNRTY !!!","commenter_a":"Mr. Trump isn my president. I don mean it emotionally; I mean it literally. It not sloganeering; it observable truth. Mr. Trump has no intention of representing me, my family, the people I care about, or the majority of Americans, from the imperiled to the comfortable. It is a stretch to call him anyone president but his own. -Lindy West","post_message":"Every president since 1976 has released his tax returns."},{"comment_id":"10154004178307452","commenter_b":"Oh, but still lol what a sick hoe","commenter_a":"Her Bfs ex girlfriend is mad @username","post_message":"A Redlands woman woke up to a gruesome discovery when she walked out her front door to find pigs’ feet, fish heads and other animal parts scattered across her doorstep."}]
