[{"comment_id":"10153822554726800","commenter_b":"Linda you sound like a true feminist. If feminist hated all women who dressed nice and looked pretty. She is an attractive woman. I won't comment on her alternative income or employment. Selling your vagina to make money is about the most American and feminist thing I can think of. It's like eating an apple pie with a slice of American cheese on it that was baked by a bald eagle complimented by a nice mason jar of Kentucky moonshine.","commenter_a":"If President Obama needed a raw onion in the podium, what was John Boehner's excu.. er, where was his raw onion stashed the millio... um...many times he cried over far less than dead kids?","post_message":"Andrea Tantaros on President Barack Obama's tears during his speech on gun violence: 'I would check that podium for, like, a raw onion or some no more tears. I mean, it's not really believable.” @webpagelink"},{"comment_id":"902473139819442","commenter_b":"Even woodpeckers for fucks sake. If they're damaging your house, or your property, guess what, you can shoot it","commenter_a":"Bring back fox hunting - look at the state of this fox -","post_message":"Fox Busted In The Hen House Literally!"},{"comment_id":"1184087691636663","commenter_b":"Donald Trump doesn't smoke, drink or do drugs. One of biggest problems in USA. Golden Crescent (@webpagelink) Build that Wall....Fence Act of 2006...Ask yourself the ???? Make America Great Again! Corruption!!!! Stop Trump!!!!","commenter_a":"Well Done Donald.","post_message":"Thank you Republican National Committee."},{"comment_id":"1609502052678904","commenter_b":"That ole man wroke that check that his azz couldn't cash....","commenter_a":"shouldnt have been talkin shit","post_message":"Damn! Racist guy gets handled for saying the N-Word!  #WSHH"},{"comment_id":"844173412298350","commenter_b":"She's a witch!","commenter_a":"And she is a pig!","post_message":"NEW unpublished audio recordings of Clinton Foundation head Donna Shalala privately expressing concerns about Bill and Hillary Clinton’s mental state."},{"comment_id":"1351703334882522","commenter_b":"He should be raped to death by chainsaw","commenter_a":"Place him in the general population of prison. He won't last. That is the one crime they don't tolerate.","post_message":"Petition Created To Publicly Hang Benjamin Taylor, Who Raped 9-Month-Old To Death!  This guy is sick, its our duty to make sure he never harms another child."},{"comment_id":"10153361671334032","commenter_b":"There's a huge difference between hearing loss and deafness. Its nothing at all like your eyes that are fixed with glasses. Patti. There are resources. Tomorrow if I can remember and find this again I'll list them or PM you. I don't know what the current name for the former Self Help for the Hard of Hearing. I'm not sure if you still have hearing aids. If you do find a good audiologist ASAP and don't stop until you find someone who treats you like you are their only client and their business dependent on your satisfaction. Anything less you shouldn't accept. If you can ever afford new hearing aids you MUST get digital. They don't know how long the current ones last. They haven't been out long enough to start failing. 10+ years for the current Gen. The biggest and very common thing people with hearing loss do is ...","commenter_a":"I just want to interject that driving while hearing impaired is not any more dangerous than while hearing. Your freaking out while driving is only in your head.","post_message":"What could just one day with a slight hearing loss teach a woman about what it's like to live every day without one of her five senses?"}]
