[{"comment_id":"10153099972135329","commenter_b":"Nah, I don't think I will.","commenter_a":"Someone needs to give him his balls back.","post_message":"BuzzFeed Books editor Isaac Fitzgerlad wore makeup for a week, here is what he learned."},{"comment_id":"10153984129784497","commenter_b":"Area woman would have crashed car regardless of spider's presence.","commenter_a":"Area woman crashes car trying to get away from spider","post_message":"Report: Spider"},{"comment_id":"10153463579731130","commenter_b":"but who knows maybe if she doesn't get her orgasm, she'll cry rape, and because society is bent towards believing women only on their word alone, you will be sent to jail to get butt raped.","commenter_a":"Men don't \"owe\" you orgasms End sexual entitlement","post_message":"🙌"},{"comment_id":"10154415987472908","commenter_b":"DUMP TRUMP!","commenter_a":"Quite right. Remember Lincoln : \"A house divided agaisnt itself cannot stand\". Tell that to Trump who is SUPPOSED to be a Republican but he's a disgrace to their histoy.","post_message":"I do not want to see the frustration and the despair that so many people feel being picked apart by people like Donald Trump, preyed upon, in order to divide us again. A few months ago we were supposed to hate the Mexicans who according to Trump were all racists and criminals. And now we're supposed to hate the Muslims. That's not what this country is supposed to be about. We are strongest when we stand together."},{"comment_id":"10154602840309877","commenter_b":"It's not going against the majority, it's supporting a fascist bigot. Only a fool wouldn't know the difference! Girl bye! Your post was asinine.","commenter_a":"Dang....wow. That was unnecessary. Smh So if you go against the majority then you get fired or blackmailed. Yeah, okay. That's totally okay, just sit down, shut up and get on the broad path like everyone else.","post_message":"It was all good just a week ago."},{"comment_id":"1560174614269652","commenter_b":"They are both disgusting women!!!! Never watched the show!!","commenter_a":"Rosie has to be one of the Most grating obnoxious people on the planet.","post_message":"I love ABC for doing what's RIGHT!   Rosie O'Donnell & Whoopi Goldberg have no place on TV."},{"comment_id":"1139906406032404","commenter_b":"you are an idiot!! AND STOP KILLING ANIMALS!! They have souls too you creep!!","commenter_a":"Ok. So release the previous 5 years. That will provide an accurate picture of what to expect when the audited returns are ready for release.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."}]
