[{"comment_id":"10153101171403417","commenter_b":"Put sheldon Silver in JAIL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"I wonder why it seems that so many Americans take homeland security so lightly?","post_message":"Last night on CNN, I discussed the impact of #Blizzard2015 on Long Island as well as security concerns after a drone crashed on White House grounds. Watch: @webpagelink"},{"comment_id":"1756660697910009","commenter_b":"I hate everything about this wannabe she makes me sick","commenter_a":"I think I throw up in my mouth every time this convict opens her trap.","post_message":"\"Don't let anyone tell you that our country is weak. We're not. Don't let anyone tell you we don't have what it takes. We do. And most of all, don't believe anyone who says, 'I alone can fix it.'\" Hillary Clinton slammed Donald J. Trump, saying his words \"should set off alarm bells for all of us.\" @webpagelink"},{"comment_id":"10154153182021519","commenter_b":"The joke is going to be on the fools who think Trump is bringing their jobs back.","commenter_a":"... . : get uses to it, the next four years is going to be the Donald Trump Aion of the dead-letter-literal-interpretation Christian religious right fundamentalists. The poor rust-belt have-nots put Trump in office because of neoliberalism global economics And the religious right put Trump in the White House , because They want Supreme Court judges to turn back abortion and gay rights etc. . And neoliberal Wall Street buddy's of Trump will get what they want , deregulation for Wall Street and tax cuts. The right wing is in the candy store and everything is free . Like I said; the next political reality show startes after November. ~~~ ~","post_message":"Ted Cruz in the Supreme Court sounds like a nightmare."},{"comment_id":"10154088282393145","commenter_b":"@username, if we could just have put a wall up around the DNC convention center, we'd have a great start catching many of the illegal immigrants.","commenter_a":"Didn't See any American Flags on stage or anywhere anyone else notice that I guess showing pride for our country is out the window if your a democrat","post_message":"She took some hard digs at Donald J. Trump and didn't even mention his name. What did you think of her speech?"},{"comment_id":"10152905378740736","commenter_b":"Shes an idiot..lmao","commenter_a":"Send him home to Mexico please.","post_message":"Two young girls told security at an H&M store that the man was positioning his phone under women's skirts."},{"comment_id":"10157271699240354","commenter_b":"sure take foreign money and rule with foreign masters LOL NO way you fool.","commenter_a":"No you don't, it's payola, play for pay!","post_message":"WATCH Hillary Clinton's hatchet man, David Brock, concede 'Clinton Cash' is no conspiracy book and discuss how the Clinton Machine is hunkering down for Donald Trump's big Monday 'Clinton Cash' speech on Hillary's self-enrichment through the Clinton Foundation..."},{"comment_id":"1229522020425442","commenter_b":"I don't know about everyone else but I still think she looks good without make up.","commenter_a":"She's so beautiful! Why would she want to cover up that face? Who would, if they actually thought about it?","post_message":"\"Just a little concealer next time.\""}]
