[{"comment_id":"10153937537377894","commenter_b":"No wonder she's an Ex","commenter_a":"Wait. So she is saying he disrespected the flag, what he is doing is wrong, and after all of that she has the nerve to say he needs to be humble? The stupid ass Star Spangled Banner is NOT the Pledge of fucking Allegiance, first of all. I wish people would recognize that. Second, draft dodging is ILLEGAL, you \"allegedly\" advised Muhammad to do that and now you want to split hairs about the \"right way to protest\"? Third, how is he not humble and if he wasn't why should he be? Muhammad Ali famously talked all types of shit now she telling a nigga to humble himself, bih, go away.","post_message":"Girl, Bye! Muhammad Ali’s Ex-Wife Says Colin Kaepernick Should ‘Get Off His High Horse and Humble Himself’"},{"comment_id":"10153124758876336","commenter_b":"Inappropriate.","commenter_a":"This says she's not a very good golfer and is not really serious about golf as a vocation. Bet she gets a lot of offers for sex though.","post_message":"This week, \"GolfDigest\" unveiled a head-turning shot of one of golf's top young female stars, Lexi Thompson. What do you think of the controversial cover?"},{"comment_id":"10154780331641072","commenter_b":"Nm wait for her to have this baby lmfao","commenter_a":"Exactly Kelly","post_message":"Giraffe Watch: Is today the day? April the giraffe at Animal Adventure Park is expecting a calf anytime. More: on.kgw.com/aprilgiraffe"},{"comment_id":"10153220983921770","commenter_b":"@username Then why did her husband push Trump to run?","commenter_a":"Trump is nothing but a Clinton crony who is trying to split the Republican vote to ensure a Clinton win. He is NOT a Conservative! @webpagelink","post_message":"After PolitiFact found that Donald J. Trump's first television advertisement uses footage of immigrants pouring over the Morocco-Spain border instead of the U.S.-Mexico border, the Trump campaign gave a blunt response to NBC News."},{"comment_id":"10152615687001636","commenter_b":"575988169269274E575988169269274n575988169269274t575988169269274e575988169269274r575988169269274i575988169269274n575988169269274g575988169269274?@username?@username 575988169269274I575988169269274'575988169269274v575988169269274e575988169269274 575988169269274b575988169269274e575988169269274e575988169269274n575988169269274 575988169269274t575988169269274h575988169269274e575988169269274r575988169269274e575988169269274","commenter_a":"575988169269274A575988169269274n575988169269274d575988169269274 575988169269274B575988169269274r575988169269274u575988169269274c575988169269274e575988169269274 575988169269274J575988169269274e575988169269274n575988169269274n575988169269274e575988169269274r575988169269274 575988169269274i575988169269274s575988169269274 575988169269274p575988169269274i575988169269274s575988169269274s575988169269274e575988169269274d575988169269274!@username @username 575988169269274I575988169269274t575988169269274'575988169269274s575988169269274 575988169269274a575988169269274l575988169269274w575988169269274a575988169269274y575988169269274s575988169269274 575988169269274a575988169269274b575988169269274o575988169269274u575988169269274t575988169269274 575988169269274K575988169269274i575988169269274m575988169269274!@username","post_message":" are entering the curvy girl era\""},{"comment_id":"10152874635857894","commenter_b":"There's a reason she can't get and keep a man.","commenter_a":"Rob Spencer","post_message":"The Wife of Kenya Moore’s ‘Millionaire Matchmaker’ Boyfriend Speaks Out: ‘She Knew He Was Seeing Somebody!’"},{"comment_id":"10155290808369657","commenter_b":"How can you support Hillary who betrays our Country lies and cheats and breaks the law each day. Hillary who.doesnt defend our Cpuntry our peopke and wants to open our borders and let terrorist enyer our Country freely as they chant death to America. Hillary qho breaks security and shares top secret Information and endangers our Military andCpuntrys and helps arms Isis ?How would anybpdy think its ok to support a lieimg cheating crinal who should be hung for Treason against America be elected President with all the oiruption and criminal acts Hillary has committed. Seems you should be glad to Vote for Mr Trump as he is good american will make a great president.","commenter_a":"So another mindless elected person. stupid is as stupid does","post_message":""}]
