[{"comment_id":"10153776630979714","commenter_b":"Woman here. Would never get an abortion myself, but don't want to impose my beliefs on others so if others want to abort, go ahead. I do not feel the American tax payers should have to fund others abortions, though.","commenter_a":"You have no place to discuss abortion or planned parenthood unless you are a female.... If you're a man, shut the hell up because most of you cant even tell me how many days are in between menstral cycles.","post_message":"Do you, Lena Dunham."},{"comment_id":"1009473349173573","commenter_b":"This woman is an idiot.","commenter_a":"#ArrestHillary #NeverHillary #GladlyPayforHillaryInJail","post_message":"FBI Federal Bureau of Investigation Director James Comey testifies on Hillary Clinton Email Investigation before House Oversight Committee. Complete video here: @webpagelink"},{"comment_id":"10156026923975354","commenter_b":"She makes me sick .","commenter_a":"Sadly, the low information voters, which seems like 70% of the populace today, buys her act hook, line and sinker...Then again, if she is so naive about servers and cell phones, who on earth wants this dimwit in the White House (again)...","post_message":"A reporter asked if she had attempted to “wipe” her server. She replied, “What, like, with a cloth or something?” And she didn't stop there..."},{"comment_id":"10153288258378854","commenter_b":"I'm seeing a lot of CRAP posted by: Sumah Volmarius. Pretty sure she's an OBAMA COMMIE...!!!","commenter_a":"If this is true why haeve w not seen this on the news, this is outragious .","post_message":"New Executive Order: Obama Takes Total Control of Internet: Declares ‘National Cyber Security Emergency’"},{"comment_id":"10153135798986323","commenter_b":"oh no Claire Leivers you are being invaded by more vikings!","commenter_a":"Martin Theander ...thoughts ?","post_message":"A bridge too far?"},{"comment_id":"10153407342318352","commenter_b":"I meant, Beast-like BITCH.","commenter_a":"Nothing these beasts say even shocks me anymore.","post_message":"'I just don't like the black kids': Middle school vice principal is suspended after being filmed making outrageous comment on camera"},{"comment_id":"10152999790806167","commenter_b":"I would pay money to watch Nikki Haley and the vampire fight each other.","commenter_a":"conservative firebrand???lol whatever! she is a delusional racist self hating woman!","post_message":"Fact: Governor Nikki Haley was born in South Carolina."}]
