[{"comment_id":"10154156199607235","commenter_b":"Seriously? WTF?","commenter_a":"William Kenneth Dockery","post_message":"WHAT."},{"comment_id":"10153846533754641","commenter_b":"A VOTE FOR HILLARY WILL BE THE END OF WHAT WE KNOW OF A FREE AMERICA , NO MORALS, ONLY PROMISES AND MORE LIS ! I WAS SHOCKED AT HOW MANY PPL STILL VOTED FOR HER AFTER KNOWING SHE HAS COMMITED TREASON ALONG WITH OBAMA AND THOSE TOP SECURITY TAPES BEING EXPOSED FOR JUST ANYONE TO SEE , THEY CAUGHTBOTH OBAMA AND HER IN LIES WHEN ASKED ABOUT THOSES TAPES . EVEN IF SHE DID MAKE IT TO BE PRESIDENT SHE BETTER NOT GET SETTLED IN TO QUICK , iI HAVE A FEELING SHE WILL BE INDICTED AND OBAMA WILL BE ALSO !","commenter_a":"Every other one is a liar and owned by big $$. What will they do to help you directly? I don't know any millionaires so I guarantee #Bernie2016 s policies will give you more spendable money. He's not really giving anything away, we already pay for most of it and he's found ways to pay for MORE than the rest, the excess will pay down the deficit. He will create jobs and raise wages, which will lift millions of people out of poverty and they will rely less, or not at all, on welfare. (No, this will not cause massive job loss or inflation. When poor people earn more money, they spend it, giving businesses plenty more money to use to pay the higher wages, usually with little to no increase in price.) He will implement a small tax on wall street transactions and other UNEARNED income, and will invest ...","post_message":"Donald J. Trump after a projected 2nd-place finish at Iowa caucuses: \"We will go on to easily beat [ Hillary Clinton ] or [ Bernie Sanders ], or whoever the hell they throw up there.\"   Live updates from the Iowa caucuses: @webpagelink"},{"comment_id":"10154289426723797","commenter_b":"@username I am an alcohol manufacturer.","commenter_a":"They should never have been in prison to begin with.","post_message":"OBAMA COMMUTES DRUG SENTENCES: Nine people from Illinois are among the 95 whose prison sentences have been commuted by President Barack Obama."},{"comment_id":"10155618780610093","commenter_b":"Go stick your head back in the ground Anne...clearly you have failed to realize that unless ISIS is wiped out..they will not stop...period. And yes they want to strike us here. You want that? You rather they come here on our turf? Lady you better do a gut check and wake the hell up.","commenter_a":"Sorry but we should NOT have boots on the ground in Syria.","post_message":"\"It involved hand-to-hand combat, the jihadists tried to use women and children as human shields, and about a dozen jihadists were killed.\""},{"comment_id":"10153750563214497","commenter_b":"Liar. You're not a prostitute.","commenter_a":"As an African American prostitute I find this offensive.","post_message":"For more world-renowned reportage, visit theonion.com."},{"comment_id":"1170579889643596","commenter_b":"Haha I thought the same thing. She should cover up!!! Lol","commenter_a":"She shouldn't be breastfeeding in public.....she should cover up.......oh wait animals breastfeed their babies out in the open too and no one bats an eye. Sorry just had to","post_message":"Prague Zoo's 24-year-old gorilla, Shinda, gave birth unexpectedly to a baby girl. Zookeepers didn't know Shinda was pregnant; they thought she was just overweight. @webpagelink  Correction: Prague Zoo has not yet released the official name of the baby gorilla. Shinda, its mother, has been living at the zoo since 2001, not 2003."},{"comment_id":"10152606580602434","commenter_b":"The \"greedy bitch\" is a man.","commenter_a":"Getting married doesn't automatically entitle you to gifts or money, your guests will give what they can, if they can but surely their attendance is more important than receiving things from them? This is the most jacked up article I've read in a long time, far too much misdirected vitriol. Hope this greedy bitch gets nothing! Equating the whole situation of gift/money giving to 'living in sin' is so ridiculous and the amount of times people are directly cursed out is excessive. If you wanted to express your opinion so badly, you should have learned how to write first. Bridezilla!","post_message":"These people often fall in the same group as elitist jerks who think getting a dress from David's Bridal is \"tacky.\""}]
