[{"comment_id":"10153179149615399","commenter_b":"Most Conservative Women act childish.","commenter_a":"Right wing conservative instigator botox bitch.","post_message":"Actually, it's really not."},{"comment_id":"10154080065336051","commenter_b":"@username you just piss yourself when you see women.","commenter_a":"The \"man\" isn't qualified to even be mentioned for the job. Donald J Trump is a complete and utter embarrassment to our already great nation","post_message":"The majority of Americans say that Trump is not qualified for the presidency. Do you agree?"},{"comment_id":"1390855700937474","commenter_b":"RACIST!","commenter_a":"I can't imagine ever turning down an invitation to the White House no matter what! As an American I would consider it the highest honor!!! Can I go in his place?","post_message":"We know that Brady, Belichick, and Bob Kraft are friendly with President Trump. But one member of the Patriots doesn't seem so keen on going to the White House."},{"comment_id":"822517567938820","commenter_b":"This woman is crazy saying Hillary is the most loved and respected woman in the world! She's been hanging around Hillary to much, and Hillary's lying is rubbing off!!","commenter_a":"Security should of threw her out on her ass. The demons must be running scared.","post_message":"Watch: Dem Chair Shows Up INSIDE GOP Convention Arena And Does The Unthinkable It is amazing to see to what extent the Democratic party will try to derail Trump's campaign. Do you stand behind Donald Trump?"},{"comment_id":"1022890011112195","commenter_b":"well people you all know by now that the illegals are who and what is at the top of being cared for first and they receive what our own Military should be getting as well as the American people our men and women who risk their lives are just a # and after thought and these actions begins with THE PRESIDENT OF THE UNITED STATES who has no respect for any Military or the American people , prayers for all who serve and have served and and fought for this great Country and our freedom and what we stand for we need to clean out the Government offices starting with the WH oval office we need a real man put in that position one that will help America not destroy it","commenter_a":"its in my tat","post_message":"NEVER FORGOTTEN! The voice of the people"},{"comment_id":"10153225018458352","commenter_b":"Shut yo strong African ass up","commenter_a":"Stevie Ray Dirt this going to be me if you don't hurry tf up ! lmfao jk","post_message":"Strong Black Woman Marries HERSELF Cause She Couldn’t Find A Husband (True Story)"},{"comment_id":"10153818538521519","commenter_b":"She's ok with a total asshole who may blow up the world though apparently","commenter_a":"Her son did NOT even work for the State Department, he worked for the the CIA. Her comments and opinions about Hillary are completely irrelevant.","post_message":"Pat Smith at RNC: Hillary Clinton \"deserves to be in stripes\"..."}]
