[{"comment_id":"10152866241386094","commenter_b":"So what planet will the money mongers move to when this planet will not support human life?","commenter_a":"...while not witnessing the irony of the capitalist market as the driver of climate change… says nothing of the oil gas, mining, food industry's culpability in this mass earth murder","post_message":"Planetary distress has become the new normal."},{"comment_id":"10156578303710354","commenter_b":"Bill's actions are not the real issue ... how Hillary victimized Bill's victims is the real issue. Bill abused women, Hillary declared war on the women Bill abused.","commenter_a":"Hillary knew about bill and his abuse","post_message":"Silence, peasant!"},{"comment_id":"10153604606804024","commenter_b":"AFUCKINMEN ON THAT SHIT!","commenter_a":"OBAMA DOES NOT CARE---HE TREATS THE ENEMY BETTER THEN AMERICANS !!!!!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153575061332411","commenter_b":"I Won't Vote For Kirk, Either!!!!","commenter_a":"Oh come now, he's a multi-billionaire businessman he knows how to talk nice when he needs to","post_message":"\"Trump has not demonstrated the temperament necessary to assume the greatest office in the world,” Kirk said in a statement."},{"comment_id":"1114872955238500","commenter_b":"Dumb Bitch","commenter_a":"I'm rich. No I'm trans. No I'm rich. No I'm trans. Ahhh!","post_message":"um... Caitlyn Jenner Donald J. Trump"},{"comment_id":"632124420311470","commenter_b":"Of all the garbage o n tv every night and they r bitching about this, cmon really! This right here is the reason we need to get rid of the shit in govt","commenter_a":"That's funny, Liberals complaining about a woman uncrossing her legs When has this been an issue for them? This is why liberalism equals hypocrite.","post_message":"Liberals want FOX News taken down after yet another wardrobe malfunction. This is ridiculous. FOX News hosts are classy, we support them! Do you support ALL FOX News hosts?"},{"comment_id":"10153583167657623","commenter_b":"Tyler Hart","commenter_a":"Christine Striano","post_message":"A derailed train is blocking a number of intersections in Randleman after a number of train cars went off the tracks."}]
