[{"comment_id":"10153877851737217","commenter_b":"A girl has no name","commenter_a":"Don't you mean 'so called' Abu Mohammad al-Adnani. If you are going to pre fix names with 'so called' you might as well be consistent. Silly 'so called' BBC Lol","post_message":"Spokesman for so-called Islamic State Abu Mohammad al-Adnani has been killed in Syria, IS-affiliated media has said."},{"comment_id":"899136066791297","commenter_b":"What? C'mon! Can the girls join the Boy Scouts?","commenter_a":"This says nothing good for Girl Scout leadership. If the leaders were of strong character, they would say \"he'll no\".","post_message":"Why would ANYONE think this is a good idea?!"},{"comment_id":"10153619175294753","commenter_b":"I know right?? It kills brain cells!!!...lol","commenter_a":"I heard it was worse than 2 Broke Girls.... I don't know how that is humanly possible .......","post_message":"Fuller House, the spin-off of the classic ABC sitcom Full House, finally hit Netflix this past Friday and the reviews are in. With all apologies to John Stamos, there are a lot of critics out there that simply have no mercy for this nostalgic reboot (okay, that was a really bad pun). Fuller House picks up 21 years after Full House, which left television screens in 1995 after eight seasons on ABC. This time around, DJ (Candace Cameron Bure) takes the Danny Tanner (Bob Saget) role as she’s... @webpagelink"},{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"},{"comment_id":"10152597227421615","commenter_b":"Thank you....so are y'all! Oh I forgot...so is Y'all @username!","commenter_a":"Please use proper English...y'all is not a world in the English language! I guess I am racist, also!!","post_message":"#BREAKING NEWS UPDATE: A 17-year-old boy has been arrested and is facing adult charges in connection with a shooting at the Monroeville Mall last night. @webpagelink"},{"comment_id":"1114612235259607","commenter_b":"So wait, now they don't WANT jobs? All this time they've been saying they want equal opportunity and a piece of the pie. Clearly, this group do sent want to work for it. They just want a free piece of pie. Give me a break! At least those inside the church get it. The Democrats have kept blacks down for decades and more but the fools outside just can't see beyond their hate.","commenter_a":"Democrats always wanted all black not to progress so they can pen them for their vote every election for a hand out then abandon them for 3 to 4 years.And the cycle goes on and on.","post_message":"DETROIT POLICE FORCED To Call Out BOMB SQUAD To Protect Trump From Hillary Supporters Offended By Speech About Bringing Jobs Back To Blacks…Faith I don't remember seeing a bomb squad when Hillary recently visited Detroit… @webpagelink"},{"comment_id":"1576897572597356","commenter_b":"The only \"racist\" in this picture is Whoopi ! Chip on her shoulder bigger than her ego!!","commenter_a":"It's time for her to go. She never has anything nice too say and she isn't funny anymore.","post_message":"Will someone please take Whoopi Goldberg off TV?"}]
