[{"comment_id":"915924881775941","commenter_b":"The buildings were resisting arrest, so they were executed!","commenter_a":"Justified. Those buildings and people around were obviously obstructing justice.","post_message":"More trigger happy cops? Time to unarm the cops? What do you think? Via: Police The Police <-- (y) Follow this page!"},{"comment_id":"10153527313703525","commenter_b":"You can kiss my dick","commenter_a":"Florida has alot of crazy old out-dated laws that are on the books!! Check it out and you will see!!","post_message":"'SHACKING UP' LAW: As soon as the governor signs the bill, it will no longer be illegal to live with someone you're not married to. STORY: @webpagelink"},{"comment_id":"807798315963065","commenter_b":"ENOUGH IS ENOUGH, DO YOUR JOB CONGRESS!!!!","commenter_a":"HOW is this legal?","post_message":""},{"comment_id":"971032156302726","commenter_b":"The Liberals should be deported along with the rest of the illegals","commenter_a":"Monday morning i was at the Dmv here in NC,and while waiting for the examier was attending to other people,i was listening to the other people around me. Everyone of us was ask if they were register to vote or if not they can register you right there. Five people were asked and all refused to sign up ! I got on my soapbox to the amusment of the examiers and told them about our sacred right to vote, they said nothing !","post_message":"Liberals want illegals to vote so they can cancel out your well informed vote."},{"comment_id":"10157365304615389","commenter_b":"If the Democrats can do it they will try! These are the most evil people I have ever witness! Just like I have said many times it's Good and Evil fighting now! The good (Trump) will win!","commenter_a":"100% yes","post_message":"Question of the Day: In light of Donald J. Trump's comments, do you think the general election could be rigged? Weigh in below."},{"comment_id":"457954454329149","commenter_b":"and an Ass!","commenter_a":"Bush family is Scum....I'm a Reagan Republican.","post_message":"President George W. Bush dances to music performed by a high school band in New Orleans for the anniversary of Hurricane Katrina. Looks like he still has a spring in his step!"},{"comment_id":"10154625084044270","commenter_b":"To me she is worthless. And don't care for this evil women. End of story!","commenter_a":"On no that's like putting killary in charge. She is a very evil women. Not good for New Mexico or the air force.","post_message":"President Donald Trump announced he will nominate Heather Wilson, a former congresswoman and Air Force Academy graduate, as the new United States Air Force secretary."}]
