[{"comment_id":"1720045178285132","commenter_b":"She didn't make it running for president what makes her think she can do it for VP","commenter_a":"SHUT UP","post_message":"Donald Trump would be \"shellacked\" in a general election showdown with Democrat Hillary Clinton, Carly Fiorina said after being named Ted Cruz's running mate."},{"comment_id":"10153572018825695","commenter_b":"Yeah, it's like a 10 hour trip from here.","commenter_a":"@username we need to plan a trip there and check this out. Me you and Jason Snyder","post_message":"TRENDING: One lucky woman discovered the fifth largest diamond ever found at an Arkansas state park. @webpagelink"},{"comment_id":"10152956638371051","commenter_b":"Clueless jerk off!","commenter_a":"I\"d tell them to kiss my ass!!!!!!!!!!!!!!!!!","post_message":"When a mom received this note about her son from a neighbor, she thought it was a joke."},{"comment_id":"10153134555889753","commenter_b":"They should lock her down before she kills some one.","commenter_a":"Yes! This was a full on assault! When there is a minor present it is a felony. She should be tried to the fullest extent of the law!","post_message":"Do you think this teen should be tried as an adult?"},{"comment_id":"1152030998150262","commenter_b":"You wouldn't believe it even if it was released. You'd say it was staged. Let the girl rip.","commenter_a":"How about releasing ALL the footage of her before , DURING , and AFTER her untimely murder!!! Its easy to let America view when she was alive. BS!!","post_message":"\"This video should demonstrate that people who are out there going through a lot of trouble to spread lies and mis-truths on Waller County — we are not going to stand idly by and allow that to happen.\""},{"comment_id":"1090441274344209","commenter_b":"People keep saying this but it seems like Hillary IS our Trump-like candidate.","commenter_a":"Allow me devil's advocacy: 1. If the dems ever run a \"Trump\"like candidate, the super delegate system would be designed to stop that person. 2. Getting more than a small percentage of voters to the primary booths will make the dem party more democratic than overhauling the super delegate system","post_message":"Ending the superdelegate system is what will make the Democratic Party more democratic. This is the kind of grassroots democracy that will help the Democratic Party grow and win elections."},{"comment_id":"10153234463025779","commenter_b":"Amazing political argument Mark. You've persuaded me to support Trump with your carefully worded statement.","commenter_a":"Biff Trump is a Joke..","post_message":"It started out as a joke: Donald Trump running for president! What better way to spoof the thinness of the Republican field than to shove a bombastic reality star with orange hair, a sixth-grade vocabulary and no behavioral filter onto the GOP debate stage. But, as Matt Taibbi writes, the joke turned ugly fast."}]
