[{"comment_id":"10152889552848717","commenter_b":"Bringing a gun to a bomb explosion? Okay....","commenter_a":"Save natural causes, racism has directly or indirectly been the cause of death to every single black in this country. Ponder that statement for a minute, because it is the truth. If you are black, eventually racism will most likely lead to the cause of your death, whether it is diet, subsequently health, or murder. The degree of oppression will take its toll. Dying of a natural cause is a luxury that few blacks will enjoy, and by natural cause, I refer to old age only. The degree in which we are hated is only mildly expressed in this video. The odd man out is usually hated with a vengeance, and we been tasked with that role since day one. No matter whom we go to war and help this country fight, once the war is over, our citizenship status becomes less than that of the enemy whom we help ...","post_message":"President Obama's nomination of Loretta Lynch to become the country's first African-American woman attorney general is a historic pick."},{"comment_id":"608368836001258","commenter_b":"Rigged? Really?? LOL!! Of course ir was and the next ones will be also! Did you notice the \"Hill\" isn't even wearing an American Flag pin? She didn't have any American flags at the convention either till the media mentioned it. A real pice of S===!","commenter_a":"yep when hillery was wired so she could be told what to say","post_message":"A rigged election!!"},{"comment_id":"1270740256295648","commenter_b":"* \"You shut your whore mouth!\"","commenter_a":"Shut your damn mouth.","post_message":"We're going to talk about this one for a while."},{"comment_id":"10152944080940950","commenter_b":"You cant tell he has an accent?what a bitch!","commenter_a":"I know law enforcement still search for david sweat and richard matt 20 days after escape from Clinton Correctional Facility. I know correctional officer Gene Palmer has already arrested for possible help to david sweat and richard matt escape from prison. I say correctional officer, prison workers and prison staff never help to some inmates escape from prison. If correctional officer, prison workers and prison staff help to some inmates escape from prison and could be arrested add prosecutor attorney will announce charged against correctional officer, prison worker and prison staff.","post_message":"A guard charged in the New York prison escape \"knows that he made a mistake,\" his lawyer says: @webpagelink"},{"comment_id":"600522876804958","commenter_b":"His girls should have to take the test and eat the same crap that Michelle thinks should be served at our schools. They are no more important than my kids are regardless who they are.","commenter_a":"Go ahead you slime bag daddy you","post_message":"Obama just waved this law for his daughters just because he can. No one is above the law. He is a criminal. Do you agree Obama is not above the law?"},{"comment_id":"840225226093860","commenter_b":"Science is proving the bible and religion is a load of rubbish...!","commenter_a":"The Bible is just a story book... Religion is a fable... looking for God is like going into a dark room and looking for a black cat that does not exist ! what religion does to people is brain wash them..","post_message":""},{"comment_id":"941357532590662","commenter_b":"Yes, @username. Why don't we force all the women to wear burka. I hope yours fit you well. You probably need it.","commenter_a":"Every picture she has she has her cleavage out! Then blames the men for the 'unwanted attention'!!!","post_message":"She reported them to police because she said it made her walk to work an 'awful experience'"}]
