[{"comment_id":"10158220719125203","commenter_b":"Obama allowed illegals to move here, not President Trump. Obama told illegals to vote, not President Trump. During his campaign, President Trump said he was going to build the Wall, and deport illegal immigrants. They were warned. President Trump is not to blame when these criminals are arrested.","commenter_a":"Throw her ass back to Mexico","post_message":"WHOSE fault is this!? ===>"},{"comment_id":"10153807572957169","commenter_b":"@username , so all women should quit tomorrow and stay home with their kids. Yeah, that would work out well.","commenter_a":"No, they are not even close to equally important. Your job raising your kid is far more important.","post_message":"It’s time we acknowledge that working parents have two jobs — the one at work and the one at home — and both are equally important to our economy (From PBS NewsHour)"},{"comment_id":"460743430758281","commenter_b":"No! That's why you have insurance! If you don't want a kid and the responsibilities that go with it, don't have unprotected sex. Better yet, keep your legs together and your pecker in your pants!","commenter_a":"NO NO NO!!!!","post_message":"\"Whatever happens, this likely won’t be the last we hear from Notre Dame, or the Supreme Court, on the accommodation.\""},{"comment_id":"1371377862955264","commenter_b":"@username once a fraud always a fraud","commenter_a":"When will you people STOP this lunacy .. And that is WHAT it is.. He did NOT become a BILLIONAIRE by being stupid.. He WON the election. GET OVER IT SNOWFLAKE","post_message":"We need to stop giving this psychopath any ideas..."},{"comment_id":"505614509629101","commenter_b":"Kendra Alison and Edward Michael Davila. The story continues.....","commenter_a":"Alison Anderson! Ann DuBay!","post_message":"Announcing the news today, his attorney tweeted in all-caps: \"WE WON A NEW TRIAL FOR ADNAN SYED!!!\""},{"comment_id":"10153785044865950","commenter_b":"GO TRUMP","commenter_a":"The Clinton both were disbarred. All class. Lock her up","post_message":"Ivanka Trump, who's been dragged into the conversation, clearly established her position."},{"comment_id":"10154736430788984","commenter_b":"I think she's loosing her butt and I'm glad!","commenter_a":"So go be a Grandma and get out of the race.","post_message":"It took Hillary Clinton less than 15 words to show her debate strategy in a very clear way. Do you think Donald J. Trump is winning the debate?"}]
