[{"comment_id":"1664185713874789","commenter_b":"Mars, but unfortunately the earth will be trashed long before humans can get to it.","commenter_a":"Is there by any chance a spare planet any of you got around?","post_message":"This is not a drill – a bill has been drafted to “completely abolish” the Environmental Protection Agency before the end of 2018."},{"comment_id":"10155004670634203","commenter_b":"I can't stand the smug bitch. Liberal fake news network is perfect for her.","commenter_a":"She's got 11.5 months to decide whether Santa is still white.","post_message":"Note Megyn Kelly's use of the word \"journalists\" here..."},{"comment_id":"10152965639377690","commenter_b":"Evil women have already stole my soul. It's too late.","commenter_a":"Really? Really?","post_message":"Texans hold prayer vigil for Blue Bell Ice Cream after massive recall @webpagelink"},{"comment_id":"10153695789091336","commenter_b":"No women in combat puts the men at risk to protect them they are targets of the enemy..don't care how strong or tough you think you are you get in the enemy's hands you will see the truth","commenter_a":"There is no way a woman is as physically strong as a man. That is just the way it is. It is just common sense. A woman could be jeopardize the safety of other marines when in battle","post_message":"The U.S. Marine Corps would request a waiver to keep women excluded from infantry and artillery positions, but not armor positions like serving in tank units, according to an official."},{"comment_id":"10154291212970329","commenter_b":"hahahaha!! for real though!","commenter_a":"Hahaha @username Alyssa Purnell Mimi Zink @username @username","post_message":"oh heeyyyy (via So Relatable)"},{"comment_id":"577516445785152","commenter_b":"Sarasota canceled the witch!","commenter_a":"The pumkins look just like trumps he ad. Lol","post_message":"WATCH LIVE: Hillary Clinton continues to campaign in Florida, where she leads Donald Trump 45% to 44%, according to an NBC/WSJ/Marist poll reported by FOX News.  This morning, she's at the New Mt. Olive Baptist Church in Ft. Lauderdale."},{"comment_id":"10154070103774916","commenter_b":"Shillary can't beat Dumper because she can't hold on to the Bernie followers who will leave the DemoRatic Party as soon as she gets the nomination. We aren't Democrats and we won't vote for her. #MassExodusOfTheDNC","commenter_a":"Hillary Clinton and Demographics and the American people will CRUSH Racist Republican Lying Cowards Donald Trump or Cruz.Who are vile bigoted ignorant chicken hawks warmongers un-American racist hateful assholes. HILLARY 2016.","post_message":""}]
