[{"comment_id":"639736896151349","commenter_b":"That's great and all but how do these women make money now?","commenter_a":"yeah and there'll be some bleeding heart liberal who'll be out fighting for robots rights and defending human trafficking because \"pedophelia is a disease!\" and we \"shouldn't judge\".","post_message":"Experts believe that cyborg prostitution will help ‘clean up the industry’ by reducing sexually transmitted diseases and ending sex slavery."},{"comment_id":"455180294641926","commenter_b":"Why don't the Italians just feed them to the the lions or do they only do that to Christians?","commenter_a":"It's karma for Columbus.","post_message":"Nearly 6,000 people were rescued just this weekend alone."},{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"10158795471470206","commenter_b":"My smartphone is a machine-gun!","commenter_a":"Journalism....there's the headline, then there's the complete opposite being stated in the article. Maybe the journalist just didn't understand that big word 'refuted'.","post_message":"The Superior Court of Justice decided to punish the players for failing to play their match."},{"comment_id":"10153808886723984","commenter_b":"Idiot bitches","commenter_a":"You just GO Ben!","post_message":"Wow! You don't see Dr. Ben Carson get this fired up too often, but  he sure wasn't taking any of Whoopi Goldberg and Joy Behar's nonsense.  Do you stand with Ben Carson despite the constant attacks from the mainstream media?"},{"comment_id":"335857396538054","commenter_b":"There is no climate change that is your agenda","commenter_a":"Does this arrogant, smug, condescending community organizer and failed President REALLY want to compare resumes with the Donald? More evidence of how delusional he is and how stupid he thinks we all are.","post_message":"“I think foreign observers are troubled by some of the rhetoric that’s been taking place in these Republican primaries and Republican debates. I don’t think it’s restricted, by the way, to Mr. Trump.”  During a press conference earlier today, President Barack Obama slammed Donald J. Trump and other GOP presidential candidates while continuing to tout climate change. @webpagelink"},{"comment_id":"547039675478904","commenter_b":"trump is not going to build a wall or deport. sorry","commenter_a":"Make America great again build that wall","post_message":"\"I want America First - so do voters!\"  Hear from Donald J. Trump tonight on protesters, the Indiana primary and more at 10p ET. #Hannity @webpagelink"}]
