[{"comment_id":"10153792298068271","commenter_b":"The ignorance of those bottom feeding illegals is who are to go, or die. We are not talking of the folks here legally. Your ignorance is proven. No more handouts! !!!!! Work, or die. I approved this message. If you are illegal then get out now! !!!!! Or you might have to go the hard way. LOL. Lock N Load, Simper-FY! !!!! Burn the Mexican flag, you are either a American or your not. If you carry that fag, Ops, I meant Mexican flag, you should be returned to that filth country right away.","commenter_a":"According to the United States Census Bureau \" By the year 2050 (which is not that far off) one in every three Americans will be Hispanic \"legal and illegal, The Trump family will not be happy. Incidentally. Census bureau is a reliable and credible source. Celebrating Cinco de Mayo weekend :)","post_message":"\"His business was built on the backs of Latinos that helped him become successful and what he boils that down to is eating a taco salad.\""},{"comment_id":"1052489598132806","commenter_b":"A vote for Brad Thor is a vote for lying Hilary!","commenter_a":"beck cares about MONEY & POWER.he has to keep this mess up to TRY and stay in the limelight. just STOP-we want to WIN in nov. TRUMP 2016","post_message":"#Thor2016"},{"comment_id":"918479428207062","commenter_b":"\"If you don't have the guts to run for office on your ideas, then you shouldn't run for office at all.\" Thank you, @username. #realtalk","commenter_a":"The last two elections I couldn't get to the polls because of 14 hour workdays","post_message":"If you don't have the guts to run for office on your ideas, then you shouldn't run for office at all."},{"comment_id":"10152739817385047","commenter_b":"Signed! Stop abortions!!!!!","commenter_a":"Lord I pray that Congress will do the right thing here & save these babies. In Jesus' name I pray amen","post_message":"Late-term abortion is being put to a vote this Wednesday in Congress—potentially putting a stop to abortion at and after 20-weeks gestation. Sign & Share this critical petition to tell Congress to defend life: @webpagelink"},{"comment_id":"1725694384382380","commenter_b":"Where have you been sweet thing? We have been giving black people reparations for decades. Who do you think has been putting money into your welfare accounts all these years? Come to me for reparations and your welfare will be permanently cancelled.","commenter_a":"They can kiss my white non-slavery butt","post_message":"All White People Owe Us Reparations, 'If You Don't Give It, We Are Coming To Take It' [VIDEO] They are demanding that we give them money for their ancestors slavery. Will you pay African Americans reparations?"},{"comment_id":"760477217433112","commenter_b":"Why is this show still one who watches these whiny bitches anyway","commenter_a":"So tired of people who think they are celebrities and think they can use that to preach their stupid opinions. Just shut up.","post_message":"Joy Behar of 'The View' just said Donald Trump will bring “mental illness” to the White House."},{"comment_id":"10154335098801002","commenter_b":"Amy... are you serious?!?! IQ test?!? A lot of criminals have high IQ's when tested! It has NOTHING AT ALL TO DO WITH IQ! It has EVERYTHING to do with COMMONSENSE!!","commenter_a":"Why is she being charged it was completely the guns fault lol","post_message":"CHARGES: A woman who fired her gun at suspected shoplifters in a Home Depot parking lot has been charged."}]
