[{"comment_id":"10152778500617093","commenter_b":"@username lol! I saw this earlier. Had me crackin up. She was playin NO games with him","commenter_a":"He may not see it now but when he gets older, he will thank her. God bless them.","post_message":"Mom finds her son in the middle of the Baltimore riots... many are calling her Mom of the Year for what she does next. @webpagelink"},{"comment_id":"1220979514606949","commenter_b":"That's always the answer huh fellas,if you feel this strong about it how about throwing some fist,oh I forgot you can't fight without guns.","commenter_a":"Until the authorities start treating these \"protestors\" Like the domestic Terrorists they are the riots will continue. And they will get worse! Time to take off the PC shackles and get down to business! It all starts from the top. As long as the Democrats are in the White House this will get worse. Elect Trump 2016.","post_message":"Many people have been arrested in Charlotte, North Carolina after the past several days of protesting and rioting. 70% of those who have been arrested have something in common, and it leads to a lot more questions about who is really behind all this..."},{"comment_id":"1242854355764972","commenter_b":"WHO THE F^CK ARE YOU ANYWAYS GO LEAVE NOW MAKE AMERICA GREAT BY ALL YOU BUTT F^CKING TRAITORS LEAVE","commenter_a":"good by trash","post_message":"Looks like we're going to need a second Trump Train...one that takes all these people south of the border..."},{"comment_id":"1043787832310738","commenter_b":"So she cooks for him he does not eat rigjt away he showers then she but instead of making a plate of cooked food he decides to cook something different and its her fault.no he just know he can take advantage.nothibg wrong fixing a plate but he was petty.its childish","commenter_a":"This lady has time to waste, why is she asking the internet for advice when she could simply have a conversation with her man about this habit or preference. if she has an issue with making him a plate, then she should make it known..........geesh, communicate with the man instead asking us for our opinions since we do not know the whole story.","post_message":"Are his legs broken?! Anywho, what should this woman do?"},{"comment_id":"10153289871647894","commenter_b":"Lol","commenter_a":"Somebody tried to get with daddy.....lmao!","post_message":"‘Married to Medicine’ Star Dr. Heavenly Accused of Trying to Run Over Her Neighbor with Her Car"},{"comment_id":"687263024766984","commenter_b":"@username here's a fact for ya 100% of illegal immigrants are criminals","commenter_a":"\"What we are going to do is get the people that are criminal and have criminal records, gang members, drug dealers. … Probably 2 million, it could be even 3 million, we are getting them out of our country or we are going to incarcerate,” Trump said. “We’re getting them out of our country. They’re here illegally.” Don't see what the problem is with that.","post_message":"Immigrants rights groups say they're \"preparing for the worst.\""},{"comment_id":"960647347306835","commenter_b":"I can't find what I'm looking for now.","commenter_a":"I try not to think of them at all...","post_message":"What do you think of these massive new changes coming to your local Target store?"}]
