[{"comment_id":"10153583578957144","commenter_b":"they were chanting,Bernie,Bernie...:)","commenter_a":"Ah @username... no mention of the STANDING OVATION for Bernie at the end of the debate? You guys are so blatantly transparent in your shilling for HRC","post_message":"'I'm not even answering that question.'"},{"comment_id":"10153652043082452","commenter_b":"Ok....we'll make the insect kingdom pay for it.","commenter_a":"We must build a wall to keep them out!","post_message":"Southern California's iconic palm-tree landscape could be threatened by a new invasive pest migrating north from Mexico.  The South American weevil kills palm trees by eating their leaves and spreading disease. It's already made its way to San Diego after devastating palm trees in Tijuana."},{"comment_id":"10154294683907061","commenter_b":"Wow what a brilliant idea. Lets a build a wall to keep ILLEGAL people out! Sounds logical to me.","commenter_a":"We already have about 700 miles of border walls and fences. Maybe we should try actually enforcing our immigration laws before we go out and spend money we don't have on walls and fences that don't work.","post_message":"WATCH: President Donald Trump promises to 'build the wall;' will take action on immigration this afternoon: @webpagelink"},{"comment_id":"10153784197573132","commenter_b":"Dig these hard chicks","commenter_a":"Way to go ladies! Proud of you. You are true role models.","post_message":"True role models."},{"comment_id":"10153145419396323","commenter_b":"Fucktards","commenter_a":"Romantic assholes","post_message":"Colossally stupid."},{"comment_id":"1768830776662660","commenter_b":"Lock Her UP!","commenter_a":"Obama is starting civil unrest with the black lives matter movement in Milwaukee, Wisconsin. The black social movement killed one white man and more than hundreds were injured at the crazy riot yesterday.","post_message":"Live now: Governor Mike Pence holds a town hall in Albuquerque, New Mexico."},{"comment_id":"537696536420926","commenter_b":"I don't like her anyway no matter what. Don't trust her","commenter_a":"Its a joke this woman no never come out as president she's wasting her time in her money we all know nobody wants to Clinton back in the White House","post_message":"Hillary Clinton's sex slave just exposed her for doing THIS.  What a disgrace. She will never be president.  Can we get 20,000 'LIKES' to make sure Hillary never becomes president?"}]
