[{"comment_id":"10154948296594203","commenter_b":"all the illegals voted too..","commenter_a":"Hillary has 2,017,563 extra votes then Trump. The difference of extra Two Million+ vote which can give a decisive victory to a candidate 'anywhere else in the world' has ZERO value in America?","post_message":"BREAKING."},{"comment_id":"1746275522311169","commenter_b":"Larry, I didn't say 'fire a weapon,' I said 'purchase and carry a firearm' Should a gun shop sell a firearm to an 11 year old?","commenter_a":"Back then it was muskets against muskets. Now we have semi autos and the government has fully autos. Seems like we are already behind with the second amendment.","post_message":"#LiberalLogic"},{"comment_id":"10153621315776037","commenter_b":"Me either, but because of my mom, I've been around terminally ill people as I worked for her. This is a big deal and I believe it's important. Suffering through a long painful death is hard on families as well as patients.","commenter_a":"Death with dignity is a big deal to people. Unless you're living with a terminal illness, I suggest you leave your judgement at the door.","post_message":"Religious groups and advocates for people with disabilities opposed a nearly identical California bill earlier this year."},{"comment_id":"10153797502305779","commenter_b":"I wonder how people react to a naked hillary statue where you get to see that bitch in all her glory. Lol. Bet people would respond differently","commenter_a":"Gross!!!! The looks are uncanny!!!!!","post_message":"New naked Donald J. Trump statues appeared today, and now they're legal, backed by a mega-developer of their own."},{"comment_id":"10153387915812756","commenter_b":"I guess there's no zoning regulations ?","commenter_a":"Sad","post_message":"We learned on Monday that it was not the first time the owners of a home in Carbon County had animals removed from their property."},{"comment_id":"10153183802333188","commenter_b":"'The walking dead' are serving as most of our representatives in Washington, take a good look next time someone speaks to the Congress.","commenter_a":"Why do you think it's so good? It prepares us for what we might expect in a SHTF scenario.","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"10157235838770231","commenter_b":"Because they are white? And black thugs will get arrested because they are black very simple?","commenter_a":"Privileged, yes. I'm not convinced about the White part. Jameis Winston was accused of a much more serious crime but because he is an athlete he was shielded from those repercussions. And let's not even get into Bill Cosby.","post_message":"It must be nice to be white and entitled."}]
