[{"comment_id":"10153184382439255","commenter_b":"History has lots of examples of jobs we don't want. Thank of all those guys running the gas chambers who were out of work when the Nazi Death camps closed. You are truly pathetic.","commenter_a":"Stunning. You're actually in favor of businesses shutting their doors, laying off people and possibly going under all in your vendetta against one man? You are truly pathetic","post_message":"A sign of victory."},{"comment_id":"10153649297241756","commenter_b":"William, the real shame is that this woman has likely already procreated or will procreate and pass on her low level of intelligence and ignorant, backwards redneck beliefs onto her offspring.","commenter_a":"As a historical relic, it belongs in a museum. The Confederates lost the war. The only flags that should be flying at the South Carolina Capitol are the United States & South Carolina flags.","post_message":"The crowd chanted \"USA! USA!\" as the flag was lowered."},{"comment_id":"10157328778620354","commenter_b":"Kimberly Dawn Horvath Mullins , most Muslim immigrants are actually highly educated doctors, lawyers, computer engineers. Kimberly, you're just a mailman right? Soon you'll be replaced by a drone LMAO, and go back to your trailer living off welfare again LMAO.","commenter_a":"Still waiting for some idiot liberal to explain to me how importing hordes of stinking uneducated radical muslim savages is good for America. Other than dumbass mouthpiecees spouting the usual \"that's not who we are\" bullshit.","post_message":"\"How did we get in the position where we’re screwed if we’re not in the good graces of the Muslim community? Maybe we should stop doing that.\""},{"comment_id":"351086708348331","commenter_b":"All about the MONEY Honey.","commenter_a":"It has profited as much as it can.","post_message":"“One source confirmed to me Caitlyn Jenner has made whispers of ‘sex change regret,’ hinting she might go back to being Bruce Jenner.” - Ian Halperin"},{"comment_id":"10153628379818145","commenter_b":"Feed your own kid. Simple fix. And teach the little demon to sit still and learn.","commenter_a":"My son is 6, and gets recess twice a week!!!! Twice!!! He then gets in trouble because, as most 6 year old boys, he gets out of his seat and wiggles all day. But the kicker is what he's fed! Sugar sugar sugar for school breakfast! He's even come home and told me he had a freaking pop tart! What the crap! Then he's punished for their stupidity. Schools need to lay off the sugar, and allow for atleast 20 minutes for recess. I vote for 20 mins twice a day. My son would be SO much better for his teacher! (Oh, and I agree with many comments....get rid of this common core crap! It's just that....CRAP!!!)","post_message":"Do you think that Florida elementary schools should be required to provide 20 minutes of recess every day?"},{"comment_id":"1067105896689813","commenter_b":"She's a bitch !!!!","commenter_a":"I've always believed we get what we've paid for .","post_message":"Do you support or oppose the stand these officers are taking?  LIKE Opposing Views for more breaking news and anaylsis"},{"comment_id":"10153257299639071","commenter_b":"@username another Hilidiot who will blindly vote for a woman for no other reason than wanting a female president.","commenter_a":"Let's be honest about this. The only reason they gave back access is because a court battle over this would have revealed to the public that every democratic campaign had access to those records, and when the Sanders campaign reported it, nothing was done. Which would have highlighted not only the DNC favoritism of Clinton, but of the fact that they have been working to shut down Bernie at every turn. Which would have meant public acknowledgement of Bernie actually having a chance to win.","post_message":"Bernie Sanders sued, and the Democratic National Committee backed off, but it's not over yet."}]
