[{"comment_id":"10153232276610496","commenter_b":"Fire them, then keep your doors locked.................that is exactly why they do not need to be in this country.","commenter_a":"Not showing up for 3 days to work with no explanation...how is that part of religious freedom...that many accomodationa are not made for Christians...and if Christians prayed in front of Muslims at the same workplace, Muslims would say they were offended...kind of one sided thinking ...","post_message":"\"Prayer is the first priority to every Muslim. We can sustain without a job, but we cannot sustain without prayer.\""},{"comment_id":"10152836141061130","commenter_b":"A man loves getting molested by his women while he is sleeping he will wake with a bigger erection because he is not sure who is doing him.","commenter_a":"I like red haired, bears","post_message":"A man isn't strong unless he's also vulnerable."},{"comment_id":"1339369766115783","commenter_b":"There are so many other places to shop.A woman`s dignity is valuable to her self esteem.","commenter_a":"I still think this is another part of Obama's plan to cause unrest and confusion so he can carry on the New World Order Plan. Wake up folks the end is almost here.","post_message":"@webpagelink"},{"comment_id":"10152607726779071","commenter_b":"same here","commenter_a":"I've been dressing like a man for years and I assure you no one takes me seriously.","post_message":"The clothes you wear have a profound impact on how people perceive you."},{"comment_id":"10152852591771749","commenter_b":"no body know mr. president.... it depends if the people believed to have done the right thing","commenter_a":"United we stand as the greatest nation in the world. USA' USA' USA!","post_message":"Let's go."},{"comment_id":"1346770152082702","commenter_b":"Robert Best then take ur bitch cockservative ass 2 bed.....damn!!!!","commenter_a":"Sadly the same dimwits that voted for Trump still aren't listening...","post_message":"Trump has shoved his foot in his mouth once again."},{"comment_id":"809439485771743","commenter_b":"no sh-- sherlock, and obummer is running circles around the media....idiots.","commenter_a":"Andrea you are so astute! That is more than obvious, with that clown Kerry doing the negotiating!","post_message":"We could've told you that, Andrea. #Iran"}]
