[{"comment_id":"906562849439968","commenter_b":"Can't wait for more racial division from this fraud. She's Holder with a dress on. Worst choice ever.","commenter_a":"Wonderful","post_message":"BREAKING"},{"comment_id":"836657323038276","commenter_b":"She didnt get in trouble for the see through top. She got in trouble for her shoulders. Even if she did wear a shawl over it, it would still show the see through part","commenter_a":"I agree with the school","post_message":"Take a close look."},{"comment_id":"1232217873516420","commenter_b":"Female dog","commenter_a":"Convicted felon","post_message":"I want to see what you all come up with... Describe Hillary in just two words... Ready, set, go!"},{"comment_id":"10153623447343352","commenter_b":"Girl that's what kids do they fight...they just need to teach her ass how to swing back next time.","commenter_a":"I feel bad for the little girl but kids get into fights all the time. If that was the case we'd all be rich!!! Including my mom!! But 10 million is extreme. I can see her doctor bills being paid (if any) and maybe her going to a different school but that's just a bit much.","post_message":"Family files $10 MILLION lawsuit after their 9-year-old daughter is beaten up on a school bus"},{"comment_id":"10153081593500090","commenter_b":"She is also a terrible so called human being !","commenter_a":"esta esta mas choteada que cantante desafinado","post_message":"She may be hiding emails, but there's no hiding this fact: Hillary Clinton would make a terrible president.  Tell us WHY you don't want another Clinton in the White House: @webpagelink"},{"comment_id":"1046419898744877","commenter_b":"What a total moron !!! This woman really was an Amb. at one time ,what an asshol. she is !!!","commenter_a":"They already did you cow!!!!!!!","post_message":"Former Secretary of State Madeleine Albright says that 'nobody is going to die as a result of' Hillary Clinton's emails."},{"comment_id":"804306716336257","commenter_b":"I have no problem with that bitch being on Air Force one. If they are traveling for her campaign then she should be flipping the bill for the personnel onboard, food consumed and fuel. I would much rather see her ass sitting in a jail cell though.","commenter_a":"SCREW THEM BOTH","post_message":"Donald J. Trump's wondering why President Obama's allowed to hit the campaign trail with Hillary Clinton on Air Force One: 'Who pays?'"}]
