[{"comment_id":"10157069343155354","commenter_b":"@username that is exactly what I said she would be the second biggest mistake","commenter_a":"It is about time all realize all that comes out of his mouth are lies he has seven more months to tear our country apart I saw this before his first election do not make the same mistake twice to vote for Hillary she is a continuation of Obama and if she gets in the only way we can restore our fore fathers Constitution is through force I am a Veteran and will stand by the oath I took at enlistment to defend the Constitution against all enemies foreign or domestic so help me God do not screw with my country","post_message":"Obama is a global rock star no more..."},{"comment_id":"10153568531759705","commenter_b":"Umm for reals...","commenter_a":"10154509258848856Eva Sellers Uhm, clearly they missed the Jammie era.","post_message":"What's the sexiest decade of sleepwear?"},{"comment_id":"486778464846067","commenter_b":"@username Your a FREAKING DUMB EXCUSE FOR A SO CALLED HUMAN BEING!","commenter_a":"What do expect out of a Muslim bitch that won't even place her hand over her heart when National Anthem is sang.","post_message":"Michelle Obama just said something treasonous about the flag. This is ridiculous, that flag is the symbol of the greatest nation on Earth. Do you support the American Flag?"},{"comment_id":"1813306192269436","commenter_b":"Clinton lost because she is Hillary. End of story","commenter_a":"I don't understand why this is just going past everyone like it's ok! We need to do something. If a democrat did this they'd be ridiculed left and right","post_message":"EXCELLENT question! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153184314438984","commenter_b":"This lady is a disgrace to our country. She needs to retire or get voted out so she can get a real life.","commenter_a":"Nancy Pelosi needs to shut up. Who cares what she thinks. She knew what to expect of the speech, stay away. People were there to support the PM not to listen to her senseless sniveling.","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"1655877784709346","commenter_b":"Oh god between him and Trudeau ? That's not a choice , it's a bloody disaster looking for a place to happen Are there no good political leaders in this nation It would be the Canadian version of Clinton and Trump , to be fair to her she's a lot smarter than Trudeau","commenter_a":"Funny watching all the leftards do the exact same thing they did with trump with labels and lies and thinking we won't have the same results!","post_message":"Kevin O'Leary called Justin Trudeau a \"complete incompetent.\" Read more: @webpagelink"},{"comment_id":"10153141581576336","commenter_b":"This is because the Tri County area in Mi is one of the largest Muslim areas in the country. I'm sick of it too, this whole scenario is not going to end well for Christians.","commenter_a":"GARBAGE!","post_message":"Students at the University of Michigan successfully petitioned to cancel a campus screening of 'American Sniper' – claiming the film promotes anti-Muslim rhetoric and made them feel unsafe."}]
