[{"comment_id":"977430998961803","commenter_b":"Europe just \"undid\" what the last Christian Crusades accomplished. All who refuse to convert to islam will soon be put to the sword.","commenter_a":"Europe is not the Europe we knew yesterday, history has been made today. Europe will not longer be Europe it is now a Muslim world. We just lost the wonderful world of Germany, France, Spain, England, Poland, Austria, etc. It's sad, the only one fighting for their country is Hungary and I give them a lot of credit, they don't want to lose their Christian faith. And America is next, we will be taking in thousands but the problem is we don't know if we are getting terrorist or good people. All I can say is God Bless us all,","post_message":"Why are the \"refugees\" mainly fighting age men? Where are the women, children and elderly?"},{"comment_id":"893880777331086","commenter_b":"\"I kill ithith and bite their ears off\"","commenter_a":"I hope when he talks he doesn't sound like Mike Tyson or something. That would be a let down. LOL","post_message":"Yeah. That dude is pretty intimidating. ANGEL OF DEATH: Axe Wielding Militia Commander is Striking Fear Into ISIS Fighters"},{"comment_id":"10154290934583258","commenter_b":"She started it!!!","commenter_a":"Elizabeth, do not respond to Trump! Why are u engaging in this? It is beneath u.","post_message":"Donald J. Trump and Elizabeth Warren lobbed insults again on Twitter Wednesday."},{"comment_id":"10153238417336717","commenter_b":"Like regular hetero marriage is such a fountain of virtue. LOL","commenter_a":"What a nice slap in the face for marriage equality. They say they dont care what anyone thinks....I think they look like whores, when's number 4 coming?","post_message":"In case you missed it:"},{"comment_id":"10156200412990354","commenter_b":"Well she just proved what a stupid twat she is!","commenter_a":"Who?","post_message":"So loving and tender, those pro-abortion activists."},{"comment_id":"454539224670672","commenter_b":"After we bomb the hell out of them , before we put the truss in harms way, and have other countries fighting to. We are close to bankruptcy like Greece, we should not do it alone.","commenter_a":"Should be an option but not the only one. Tired of these numbskulls. So ready to use other people's blood but not their own The Bush family did that, the Obama. Ass did it even he said was not. Clinton did it. If The Saudis want to keep their kingdom let them do it, if the Turks want their country let them invest their oeople, Jordanians, yemens. AND STOP ALL IMIGRATION INTO THE USA","post_message":"Donald Trump wants to send more US ground troops to fight ISIS. Do you agree or disagree with his plan?"},{"comment_id":"1174271395944428","commenter_b":"The real Hillary afraid that the porn industry wont donate money to her or maybe they have some film!","commenter_a":"Perhaps under the advice from Bubba, he's planning ahead! Lol","post_message":"Hillary Clinton refused to sign a pledge Monday that would protect children from exploitation by the porn industry."}]
