[{"comment_id":"10153711190119411","commenter_b":"Put them on big boats & send them too the U.S. !! Time for the yanks & Jews too clean up there mess they created !!","commenter_a":"They are provided with bins and skips in most places, yet they just throw their shit everywhere. Dirty pigs","post_message":"NIMBY-syndrome grips little-mittel-Europeans"},{"comment_id":"10156662998260725","commenter_b":"Build that wall!!!","commenter_a":"Trump is going to do a great job 8 years later some other idiot is going to come and ruin it another 8 years Eric Trump is going to run !!! That's the plan!!! Go Trump!!!","post_message":"I have built so many great and complicated projects – creating tens of thousands of jobs in the process. Building a wall is A LOT easier than building a 64 story building! LET'S #MAKEAMERICAGREATAGAIN www.DonaldJTrump.com/Nevada"},{"comment_id":"1878063365760713","commenter_b":"All illegals have committed crimes, hence the term ILLEGAL!!!","commenter_a":"Trump is more concerned with illegals that have committed crimes and securing the borders if you think Trump is going to round up all the immigrants like cattle and send them packing then you haven't been paying attention to the news","post_message":"“There is a long tradition in American law enforcement of not breaking into churches in order to arrest someone unless the person is wanted for an act of violence,” Judge Andrew Napolitano said."},{"comment_id":"10153266437101336","commenter_b":"Real biker gangs are way more dangerous than the pretty actors on that show made them seem.","commenter_a":"They all must have watched a marathon of Sons of Anarchy this past weekend","post_message":"UPDATE: Police adjust the number of people arrested from 192 to 170. \"This is probably one of the most gruesome crime scenes I've ever seen in my 34 years of law enforcement.” – Waco police Sgt. W. Patrick Swanton @webpagelink"},{"comment_id":"1214784961920643","commenter_b":"all these woman marching i wish they would say samething about us senior that can not get out of the house to help fight for our medicare and social security","commenter_a":"Marching in Tucson, AZ!! Yea! Ladies!","post_message":"LIVE NOW: Women's March in D.C., just one day after Trump's inauguration. MORE MARCH INFO: @webpagelink"},{"comment_id":"10155298164813132","commenter_b":"This dumb broad just made her ignorance known.","commenter_a":"@username Kenya Hall I'm waiting for Riri to read her to filth.","post_message":"Azealia Banks shared several Instagram posts and a video attacking Rihanna for her post about Trump's immigration ban."},{"comment_id":"10153224206704726","commenter_b":"What is this surprising? That's what her husband preaches to us all... GIVE ME..GIVE ME","commenter_a":"She needs to be charged Millions for just being allowed to live in WH.","post_message":"WATCH: Obama: Michelle Upset She's Not Being Paid as First Lady"}]
