[{"comment_id":"1260466927330937","commenter_b":"@username agreed! She's a fecking CRIMINAL... PERIOD!","commenter_a":"Watergate would be jaywalking compared to the Clinton scandals","post_message":"Rudy Giuliani claims the Clinton Foundation scandal will be \"bigger than Watergate.\" Do you think there is truth to what he is saying?"},{"comment_id":"1069058776465409","commenter_b":"You an illegal alien?","commenter_a":"You can't uphold your weenie Trump","post_message":"I'll appoint judges who will uphold the Constitution of the United States."},{"comment_id":"10154340193151509","commenter_b":"Hillary has an estimated 70-80 pct of Hispanic votes , but only needs 40-45 pct according to experts. I'm just the messanger. Rand Paul is my pic.","commenter_a":"Not that I care for this socialist , but the Latino vote will bring Hillary over the top.","post_message":"Donald J. Trump has been tearing away at Bill and Hillary Clinton for more than a week"},{"comment_id":"910297725696643","commenter_b":"Girls can be just as bad","commenter_a":"Could have been worse","post_message":"'I cleaned my son's room and found... a Pringles  tube full of URINE'"},{"comment_id":"10153622998001323","commenter_b":"Don't give the bastard any ideas !","commenter_a":"This is why there are so few Tory comedians, they're about as funny as a burning orphanage.","post_message":"Barmpot."},{"comment_id":"1198210753566421","commenter_b":"She's a hack","commenter_a":"This isn't right. What is wrong with her?","post_message":"CNN HOST To Jill Stein: \"Have You Seen Any Direct Evidence That Anyone Hacked The Voting Systems In MI, WI And PA?\"...\"Um...no\" [VIDEO]   And then there's that whole issue with one of the states that only uses paper ballots...."},{"comment_id":"10153200958788837","commenter_b":"?","commenter_a":"That cop needs to be arrested for having an illegal \"agresive breed\"","post_message":"PUPPY THROWN - Local 10's Michael Seiden has the latest on a poor little puppy that was thrown from a passing car right near the North Miami Beach Police Department"}]
