[{"comment_id":"10153113348589885","commenter_b":"A gun saved mine and my families life one night. Guns save more lives than you know . You disarm innocent people, murders will rise.","commenter_a":"This was a hate crime. We should also talk about gun control. This guy was a gun enthusiast. He killed them execution style. He had power over them. Gun power. Do you think he would have approached them if he didn't have a gun?","post_message":"A crowd gathered Thursday night at St. Louis University to pray for three young Muslims who were shot in the head Tuesday in Chapel Hill, N.C."},{"comment_id":"10154592396721336","commenter_b":"What a concept...build a wall! Did they get the idea from President Bill Clinton?","commenter_a":"All borders need to be secured.","post_message":"In what could be a \"told you so\" moment for Donald J. Trump, the U.K. announced plans to build a \"big new wall\" at a border port in France to prevent migrants in nearby camps from sneaking aboard vehicles heading to Britain."},{"comment_id":"1036949889659355","commenter_b":"Mother fucker that shot him should be shot","commenter_a":":(","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"10154310279241409","commenter_b":"@username I'm not against deporting any illegal immigrant that cannot qualify for resident alien status. If they have minor children, the children should stay with their deported families, but be allowed the reenter the US after the age of 18 with the proper paperwork. Legal migrant workers are the backbone of many US industries which would not survive without that work force. We don't really need a wall we only need to change the orders that have been forced upon our border patrol officers which makes the ineffective in most interactions with illegal migrants.","commenter_a":"Does anyone know what it is that they are protesting? Do they have any suggestions on how to handle illegal immigration, and the vetting process of refugees and immigrates? This seems like it may just be a way to get a day off work and get on TV.","post_message":""},{"comment_id":"10150886165499999","commenter_b":"feminists are pro-islam, so of course this concerns them","commenter_a":"What does that word 'feminism* do here? Feminism does not say what you should or should not wear. Some feminists may have delusions of what is best for some, but it is still not the feminism itself, what people belive or does not belive.","post_message":"Our top 10 comments of the week."},{"comment_id":"10152769166208271","commenter_b":"Tauna Corbin so a dead woman can drive a car?","commenter_a":"She broke the law. She could have KILLED the officer if she ran over him. Its called consequences for YOUR PERSONAL CHOICR.","post_message":"#BREAKING Denver Police Chief Robert White spoke to the public about the shooting Monday that killed a teenage girl in a stolen car. We are updating this report: @webpagelink"},{"comment_id":"599734130175363","commenter_b":"she is such a idiot","commenter_a":"Repeat a lie long enough and loud enough . . . Welcome to Nazi America, 2015","post_message":"Temper, temper, Carly."}]
