[{"comment_id":"659146920942553","commenter_b":"Muslim terrorist","commenter_a":"YOU BET I AM!","post_message":"Members of ISIS are disguising themselves as refugees so that they can funnel into Europe. Terrorists have breached European borders, things are about to elevate. Are you worried Obama will let terrorists into our country?"},{"comment_id":"1707811955905494","commenter_b":"Sara are you looking in the mirror while you type???","commenter_a":"Yea its stressing me out my gosh what more does this man have to do before he actually gets in trouble??? OH AND THE FRUSTRATION THAT WE THE PEOPLE OF THE USA HAVE NO VOICE","post_message":"Two-thirds of Americans say that the future of the nation is a significant source of stress, according to a new poll."},{"comment_id":"1230461060352731","commenter_b":"Finish your comment. What type of women are these?","commenter_a":"I'm actually quite amazed at the amount of women attempting to justify this. As if abusive culture isn't hard enough on you. Just wow. Like demographic though.","post_message":"UPDATE: According to Rolesville Mayor Frank Eagles, the officer seen slamming a student to the ground is school resource officer Ruben De Los Santos, who has been placed on paid administrative leave. Follow this story>>wral.com/@username/"},{"comment_id":"526053707590689","commenter_b":"She needs to go back to the Chicago geto where she belongs!","commenter_a":"She is such a liar she acts socked but she has tapers in the White House","post_message":"\"I can't stop thinking about this. It has shaken to me to my core in a way that I couldn't have predicted,\" Michelle Obama said regarding Donald J. Trump bragging on a 2005 tape about his fame allowing him to \"do anything to women.”"},{"comment_id":"10154170827586756","commenter_b":"@username dont u have a planned parenthood office to firebomb like your christian boy did in denver? come at me asshat i'll beat your ass down and light your hairy persian ass on fire to worship in lol","commenter_a":"I hope American culture and goods don't start to flood Iran and ruin it","post_message":"NPR's Steve Inskeep revisits three Iranians he met last year to find out if their lives have changed because of Iran's nuclear agreement with world powers. \"We are actually in a new world,\" says one."},{"comment_id":"10154153182021519","commenter_b":"The joke is going to be on the fools who think Trump is bringing their jobs back.","commenter_a":"... . : get uses to it, the next four years is going to be the Donald Trump Aion of the dead-letter-literal-interpretation Christian religious right fundamentalists. The poor rust-belt have-nots put Trump in office because of neoliberalism global economics And the religious right put Trump in the White House , because They want Supreme Court judges to turn back abortion and gay rights etc. . And neoliberal Wall Street buddy's of Trump will get what they want , deregulation for Wall Street and tax cuts. The right wing is in the candy store and everything is free . Like I said; the next political reality show startes after November. ~~~ ~","post_message":"Ted Cruz in the Supreme Court sounds like a nightmare."},{"comment_id":"10153803162214456","commenter_b":"There is a big difference between a legal immigrant and an illegal alien. Ivana trump was a legal immigrant.","commenter_a":"Thanks JENNIFER...this is what I am seeing and hearing. No matter how brash everyone thinks Donald Trump is...we have incompetent leadership in this country...I agree with him...","post_message":"BREAKING NEWS: French police have issued a wanted notice with a photo of a man suspected in the Paris attacks."}]
