[{"comment_id":"10155243885678984","commenter_b":"@username excuse me ??? It's the fake news that is treating the president with utter disregard for his office ... they are bought & paid for that's why they say what the liberals are spouting ... makes one SICK !","commenter_a":"Oh boo freakin hoo! Shut the f#&@up all you newsies! You treat the President of the United States like a lowlife scumbag and expect him to kiss your collective asses to make nice! This is Donald Trump and you dummies just don't get it! Be fair and honest and quit making up crap and he will reciprocate! Wake up and smell the coffee!","post_message":"Fox News' Brett Baier just left many viewers speechless. This is going to get Donald Trump's attention..."},{"comment_id":"651982771617164","commenter_b":"SEND HER BACK TO WHERE EVER SHE CAME FROM ! LET HER WHINE ALL THE WAY HOME !","commenter_a":"Yap she's crazy..go home.","post_message":"Woman Goes On National TV And Blames Americans For Banning Sharia Law And Executing Kids In... This must be some kind of sick joke. Do you think she has completely lost her mind?"},{"comment_id":"10153810948993717","commenter_b":"Hillary wants to secure our border now - #TrumpWall - @webpagelink","commenter_a":"Great........I wonder which town he plans on hurting this time, forcing the tax payers to pay for his visit, and extra police security while he's here weather they like it or not....glad to see our state has a say in it......","post_message":"Donald Trump will be back in the Granite State on Monday: @webpagelink"},{"comment_id":"10152650775565496","commenter_b":"Agreed. They gave that lady not one, but TWO! black eyes. They liked to beat her brains in.","commenter_a":"Why are they out on bond? If I were the D.A. I would be pushing for attempted murder charges.","post_message":"The trio of woman accused in a brutal beating over a squished hamburger were scheduled for court this morning. UPDATE on the case: @webpagelink"},{"comment_id":"10154038089667293","commenter_b":"Unlikely? Really?","commenter_a":"I live abroad, and there is no escaping questions about Donald Trump on an almost daily basis. I'm often asked directly, \"He's not actually going to be President, though, is he? Can he be? Why are people supporting him?\" They think Americans have lost their minds, and there's tangible concern about what his presidency could mean for the world. Fortunately, I keep FiveThirtyEight handy and can show them how unlikely (currently) his election is, but American democracy has taken a huge (yuge?) credibility hit regardless.","post_message":"When your vacation turns into a lesson in \"Trump-splaining.\""},{"comment_id":"1650734271857952","commenter_b":"Fk her old dying ass","commenter_a":"This heifer is so predictable...\\\\","post_message":"Wasting no time..."},{"comment_id":"10153743132780950","commenter_b":"Fuck you Bitch!!!","commenter_a":"The entire staff cheats on that team !!! Even Bellicheck...fuck the entire Patriots organization!!!!","post_message":"New England Patriots quarterback announces latest move in wake of court rejecting appeal."}]
