[{"comment_id":"10154784802599575","commenter_b":"arrest her before she flees the country!","commenter_a":"If she had any tact, or respect for the people who voted for her she would of made a speech last night.","post_message":"Hillary Clinton is expected to speak very soon from New York after losing the election to Donald Trump. We will live stream her concession speech on our Facebook page and in this post."},{"comment_id":"1556960097657348","commenter_b":"This is a state with Making a Murderer. I'd be wary.","commenter_a":"Eternal rest grant unto HUSSAIN, O Lord, and let perpetual light shine upon HIM. May the souls of the faithful departed, through the mercy of God, rest in peace. AMEN!!","post_message":"Police say it's likely several people saw Alnahdi being beaten, but only one has come forward."},{"comment_id":"10153994821081409","commenter_b":"Voting should only be done in person with ID on paper ballots. Who marked that mail in ballot? Who is at the keyboard for online voting? Do you have a repeatable count of the votes? Again, voting in person with ID with paper ballot.","commenter_a":"Voting should be the same in every state, county, city, town, whatever. Mail in ballots should be available to everyone. I think eventually we should go to online voting if we can keep the republicans from tampering with it.","post_message":""},{"comment_id":"832286116867642","commenter_b":"Obama, \" I visited all 57 states.\" Pretty supid, huh a-hole?","commenter_a":"More of the same GOP = Stupid 游냥游냥游냥游냥游냥","post_message":"Rebuttals galore!"},{"comment_id":"10153358816899099","commenter_b":"Hide the women and children.","commenter_a":"Countdown until someone is groped/raped or a fight,","post_message":"These streets will be closed Sunday for the Puerto Rican Day parade @webpagelink"},{"comment_id":"10153054434811051","commenter_b":"So sorry he killed himself. The creeps that haunted him should all be rounded up and put in jail.","commenter_a":"Well I hope those bullies are proud of themselves. ...they know who they are and they all have blood on their hands. KIDS.... BE CAREFUL WHO YOU BULLY....THAT PERSON MAY BE YOUR BOSS SOMEDAY! In school everything that happens seems like its life altering end of the world BS. Guess what....it's just high school....life goes on....nothing is worse than suicide. ...sometimes the worst thing that happens turns out to be the best thing.","post_message":"This boy loved hunting and trapping, and other students made fun of him all the time for it. He just couldn't fit in with them. Eventually it became too much."},{"comment_id":"1808417692765360","commenter_b":"Disgusting.. . I'm sure she's a Trumpette....","commenter_a":"Why do you promote this kind of story NBC???? if you promote peace, all of the robots that follow the trends just may jump on the peace bandwagon. They are here!!! That won't change. What we must remember is they are humans. Each of us will reap what we sow.","post_message":"\"Go back to wherever the f*** you come from, lady.\" Watch a woman go on a racist tirade against two Latina shoppers at a JCPenney in Louisville, Kentucky. Read more about the incident: @webpagelink"}]
