[{"comment_id":"1769034086717767","commenter_b":"and this is terrifying","commenter_a":"It's here @username","post_message":"This robot wants a family...and to destroy humans."},{"comment_id":"1023434111010933","commenter_b":"someone can't read the headline in the article lolol","commenter_a":"Stop blaming anti vaccers, we are the ones smart enough not to inject ourself or others with the disease.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"957822790936024","commenter_b":"Let's get all them bitches","commenter_a":"👌👍👊","post_message":"Human excrement gets flushed! Australia's most wanted ISIS terrorists just got smoked in Iraq. ~Will"},{"comment_id":"912646568790348","commenter_b":"@username i have worked in kane country elections for Dems for 27 years I do my home work ! Bernie only got 8 bills passed in all his 40 years in the sen!!!! Hillary in 4 years got double that!!!! Bernie is ALL TALK NO ACTION!! He is in Bed with the NRA and voted against the brady bill 5 times and voted against amber alert!!! are you kidding amber alert!!!! Now that turns me WAY of Bernie!.And I dont HATE Bernie but Hillary I feel will get the job done and I would love to see what a woman can do!!!! And please dont call me DEAR!!","commenter_a":"Bernie is telling people what they want to hear not what he is capable to really get accomplished.His promises are not doable. They are unrealistic. Hillary has already accomplished many many good things for the poor and the middle class. Bernie is running on our ticket and using us. He is not a democrat and refuses to join our party, and has scorned our party for years. He is a left wing socialist. He voted against the Brady Bill and Amber Alert. He voted to protect the gun corporations and manufacturers against any and all law suits. He said that underage teenage girls should be allowed to have sex with their boyfriends not to get cancer. ( Wierdo) He also said toddlers should be allowed to to explore their sexuality with each other. He refused to serve in our military under concientious objection during the Viet Nam War when 55,000 ...","post_message":"It is clear that the views of the right wing do not reflect the views or the needs of the vast majority of the American people. The Koch brothers and the billionaire class are way, way out of touch with where the American people are."},{"comment_id":"10153023436556051","commenter_b":"Yep, as long as she is consenting, I couldn't care less.","commenter_a":"lol,,, BDSM. They must be on www.fetlife.com","post_message":"Mall-goers here were genuinely disturbed when they saw who this guy had on his leash."},{"comment_id":"10153902236123812","commenter_b":"The native Americans should have stopped accepting immigrants. They wouldn't have lost millions of life's by those terrorist immigrants!!!","commenter_a":"ISIS doesn't need to be in America. Has everyone forgotten about the mass shootings that happen almost every day now? They can easily recruit here and never step foot on American soil. Blind hatred is still hatred.","post_message":"LATEST: Mississippi joins Ohio, Florida, Illinois, Indiana, Louisiana, Arkansas, Michigan, Alabama and Texas in refusing to accept Syrian refugees in wake of #ParisAttacks."},{"comment_id":"10152762726845779","commenter_b":"Crystal","commenter_a":"Ash Cooper","post_message":"Nirvana's 'Unplugged' concert is often presented as the band's final show, but they actually played another month of American dates after that MTV taping and then headed over to Europe the following February. The band's last concert ever took place on March 1st, 1994 in Munich, Germany, at Terminal Einz, an airplane hanger that fit 3,050 people. Click through to listen to \"Heart Shaped Box,\" the encore from that show and the last song Kurt Cobain ever played in public."}]
