[{"comment_id":"612643332237670","commenter_b":"It's really crazy that some men are coming up with more excuses for this kid","commenter_a":"What, now alcohol is being used as an excuse to rape a girl. People still know right from wrong, drunk or not. Rape is illegal. Justice needs to be served. Disbar that judge, also.","post_message":"The judge, also a Stanford alum, noted that the defendant was intoxicated at the time of the assault."},{"comment_id":"10153700779194062","commenter_b":"No NOT all Latinos are Mexicanos but that would be the first place anyone of that Heritage will head too is that is MEXICO with the quickness !!! You can not hide here in TEXAS we can tell da difference now.. Everybody stands out now a days!!!","commenter_a":"So where is the other guy that was last seen with them now?","post_message":"More: Baytown Police said the bodies were found Thursday afternoon at FM 563 at Eagle Ferry."},{"comment_id":"10157147438325354","commenter_b":"Mariah, pull your panties out of your crack.","commenter_a":"LOL Calvin Klein clothing. Made for dainty feminine pajama boys with no shoulders and 24\" waists.","post_message":"Kendall Jenner, the lurid Calvin Klein PHOTOS, and the major PR backlash..."},{"comment_id":"10153701487053984","commenter_b":"She need to stay out of all business","commenter_a":"tell that ugly monkey to miind her own business","post_message":"Students have been complaining about Michelle O's lunch rules since they were implemented, but now it just got taken to a whole new level... Do you think schools should quit enforcing Michelle Obama's lunch rules?"},{"comment_id":"904212379645518","commenter_b":"These thugs and hoodlums should be arrested .","commenter_a":"Thugs","post_message":"He Wasn't Ready!"},{"comment_id":"1271419419547512","commenter_b":"Lil bitch","commenter_a":"12 jurors acquitted these guys based on the lack of evidence. This had nothing to do with white privilege, they were locked up in solitary confinement while rioters get away with burning down towns.","post_message":"Heavily armed ranchers forcefully occupied a federal building in Oregon, but they got acquitted because white privilege is real."},{"comment_id":"10153482895003908","commenter_b":"Diet is unhealthy less u r a ufc fighter needing to perform at peek potential. Im more ripped than 85% of ufc fighters cause i burn more calories than i ingest..","commenter_a":"Absolutely true!","post_message":"A powerful ad exposes everything that's wrong with the diet industry in just 31 seconds."}]
