[{"comment_id":"10153198594904342","commenter_b":"Really!!! Fix the F***** System. And make her suffer for what she did. Why let her out?","commenter_a":"If that's the case, then let her go 3 or 4 days w/o food. Just give her nothing but Water, and/Gatorade/Powerade. The Human Body can go 3 or 4 days without food; just not Liquids. The Human Body, can run off it's Reserves, If We have Excess weight, don't worry. You'll only feel hungry for a little while, then whenever Our Body's stop growling; that means, that your Body will start Eating off it's reserves.","post_message":"A story working on for Eyewitness News today -- a Houston mother is facing multiple charges on allegations of child abuse.  Investigators say her son  'like a prisoner of war who had been starved.'   @webpagelink"},{"comment_id":"1063632813696466","commenter_b":"Lol its the food colouring haha I wana try one of those, they're in Japan aren't they? X","commenter_a":"'@username fancy a green poo? x","post_message":"This is gross Burger King"},{"comment_id":"10154450153734411","commenter_b":"'@username Is there a government on this planet that is not - up to no good - ?","commenter_a":"Why are they bombing their own airport... ISIS Turks are weird","post_message":"BREAKING - #ATATURK #BLASTS:  - at least 50 dead - about 60 wounded - 2 explosions"},{"comment_id":"10153095274501600","commenter_b":"JERK","commenter_a":"there needs to be an (unlike button)","post_message":"“We are entering the curvy girl era and when all eyes are on the bikini babes of Sports Illustrated, it would be a great time to have the conversation about the rise of the curvy girl,” a spokeswoman for Sports Illustrated said."},{"comment_id":"10155029818006543","commenter_b":"Senator Wazzy got slapped on by Senator McMackinz. Tell a ho where she's at! @webpagelink","commenter_a":"Mitch McConnell email inbox is full. Let jam his faxes with the Coretta Scott King letter now. DC Office : (202) 224-2499","post_message":"In an extremely rare rebuke, U.S. Senator Elizabeth Warren was cut off while reading a 1986 letter by Coretta Scott King on the Senate floor @webpagelink"},{"comment_id":"10153645294706756","commenter_b":"why is it people still think illegals vote? they cannot unless they are registered, the only thing the federal gov't requires for illegals is emergency care at hospitals in case of sudden illness or accident, otherwise illegals do not get food stamps or welfare and why would they try to register to vote risking getting caught? some people need to get a new talking points, this one is old and stale","commenter_a":"The Republicans made a conscious decision to go after the angry white conservative male vote with everything they had. Now they get to live with that decision, riding into the sunset as a shrinking regional party based on anger and resentment. A modern version of the 'Know-Nothings', if you will.","post_message":"To put it one way: 'Republicans have been arguing since 2012 about — do we need to change the pizza or do we need to change the pizza box?' says David Frum, a former speechwriter for George W. Bush. 'And I think the correct answer is we need to change the pizza.'  But change, however they want it delivered, has come in fits and starts for the GOP."},{"comment_id":"10153865214066680","commenter_b":"Yea she can teach them how to lie, cheat, and steal.","commenter_a":"Oh yeah","post_message":"“Hillary has spent her entire career bringing folks together on behalf of our kids,' she says."}]
