[{"comment_id":"1051832858188283","commenter_b":"That's why we're in the place we are now,to no where.","commenter_a":"Sure makes some pretty good points","post_message":"This extremely popular \"Bernie\" meme has tens of thousands of likes and shares yet it reflects a SAD reality about young people today and the public education system in America. Watch as we expose the sad truth behind this meme. [READ]"},{"comment_id":"586386844881451","commenter_b":"This woman DOES NOT love America!","commenter_a":"YOUR A LIAR !!!","post_message":"\"My vision for America is an America where everyone has a place. This is the America that I know and love.\" —Hillary"},{"comment_id":"1506151063011899","commenter_b":"REAL AMERICANS guns will only be taken over their dead bodies.","commenter_a":"Let's see, how many honest, law abiding gun owners, did not commit a crime with a gun, yesterday. Or ever, for that matter. If the government takes your guns, the next thing that they will take, is you.","post_message":"Exploiting tragedy while surrounded by ARMED guards. Hypocrisy much, Obama?"},{"comment_id":"10152867281821051","commenter_b":"Give it your best shot bitches","commenter_a":"Full of crap","post_message":"ISIS just announced the specific targets they’re looking to blow up – including the American ones."},{"comment_id":"542586789241125","commenter_b":"Get off drugs!!! Our economy would crush!!","commenter_a":"Trump is not dropping out you idiots. The best you can hope for is Trump/Carson ticket.","post_message":""},{"comment_id":"1324204954284728","commenter_b":"This is the future of the Democratic Party. She's sick .","commenter_a":"Thank goodness she got what she deserved.","post_message":"While out preaching on the sidewalk, a man was shocked to see a woman quickly approaching. Unfortunately, things would take a horrifying turn as the vile woman pulled something from between her legs and decided to gift him with it – but she wouldn’t be laughing just a few short days later. @webpagelink"},{"comment_id":"10155551213935354","commenter_b":"If they kill all the whites who is going to work and pay thier welfare, food stamps, medical bills, and supply thier free housing? If they have to pay bills there won't be any money left over for drugs!","commenter_a":"black nation? you mean like haiti,or africa...or anyplace where they arn't feeding off white people..these freaks should have been extinct a hundred years ago,most are tired of feeding and housing them..","post_message":"SHOCKING...."}]
