[{"comment_id":"10158446067150354","commenter_b":"You little queer. I think my grandkids could fuck you up, fag!","commenter_a":"You won't stand a chance asshole come on bring it I'll save a hospital Bed it's waiting on you fucking RACIST RAT","post_message":"The shutdown of MILO event at UC Davis may be a preview of what to expect at next week inauguration of Donald Trump. Just who are these hooligans? Lee Stranahan investigates..."},{"comment_id":"1069291126441959","commenter_b":"WHEN DO WHITE PEOPLE GET TO TAKE THE COUNTRY BACK.......","commenter_a":"Rest well","post_message":"One of the Dallas police officers killed in the sniper attack has been identified as DART Officer Brent Thompson, 43. He is the first Dallas Area Rapid Transit officer to be killed in the line of duty. \"Our hearts are broken,\" DART spokesperson Morgan Lyons said in a statement. \"We have received countless expressions of support and sympathy from around the world through the evening. We are grateful for every message.\""},{"comment_id":"10153858711711162","commenter_b":"Hell Indianapolis too","commenter_a":"They would get killed in da Chi anyways","post_message":"Illinois will stop accepting Syrian refugees in wake of the Paris Attacks... @webpagelink"},{"comment_id":"10153008628783721","commenter_b":"of course I'm involved!","commenter_a":"Sara Kasperski are you involved? I know Shia is...","post_message":"The watchers become the watched."},{"comment_id":"388912451508467","commenter_b":"This woman won't win the next election.","commenter_a":"Tankes sister","post_message":"Angela Merkel: 'Islam is not the source of terrorism'. Merkel spoke at the Munich Security Conference about why cooperating with predominantly Muslim states is vital."},{"comment_id":"10153649421859138","commenter_b":"Why would you post such a thing Dan??? Wtf?","commenter_a":"Meanwhile in Chicago this weekend, more people were gunned down by those whose lives matter. But let's not protest that.","post_message":"The Twin Cities Marathon went on today without major disruptions, and police did not make any arrests."},{"comment_id":"1191296707568558","commenter_b":"Shawnee has some pretty crazy, unnecessary rules. Girls can't dye their hair to any color that is \"unnatural.\" They wouldn't of been able to walk either.","commenter_a":"So I wonder how many people could walk that have green or purple or blue hair but facial hair is not OK??","post_message":"Do you agree with the school's no-beard policy?"}]
