[{"comment_id":"10154465141311037","commenter_b":"Melania DUMP","commenter_a":"Think the media wants to sh!t all over this to distract the public on what's really going on...","post_message":"Did Donald J. Trump's campaign literally just RickRoll the nation?"},{"comment_id":"10156346841015725","commenter_b":"Build the wall","commenter_a":"America should close the borders. You do not lock the front door of your house because you hate the people outside. You lock it because you love the people inside. A country's border is its front door.","post_message":"From South Carolina last night- this is what I call a real supporter! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"464367687084172","commenter_b":"Please be specific and truthful. Trump is only against ILLEGAL immigration. Trump is only calling for a temporary hiatus on muslim immigration until we can ensure that terrorists aren't taking advantage of the opportunity to come to America. Otherwise peddle your bs somewhere else.","commenter_a":"And of course Trump said nothing of the sort. Bernie is a liar, plain and simple.","post_message":"Watch Bernie Sanders's explanation for Donald J. Trump's rise. -------- Read more on the third Democratic debate: @webpagelink"},{"comment_id":"10154036425721336","commenter_b":"Mary yes they will be out, and then be invited right back in as legals. We call that boomerang amnesty.","commenter_a":"Trump belongs in prison along with Hillary and Obama.","post_message":"TONIGHT: GOP presidential candidate Donald J. Trump like you’ve never seen him before – Don't miss 'Watters' World' at 5p and 8p ET."},{"comment_id":"10153117989439342","commenter_b":"Stfu","commenter_a":"Why is this breaking news??? So what!! You glorify more sin than good!! Tell the world about Jesus!! Stop caressing this foolishness like its normal! I see why God clearly warned us not to be of this world!!","post_message":"The first image of Caitlyn Jenner, formerly known as Bruce, has been released by Vanity Fair magazine --> @webpagelink"},{"comment_id":"10154090778463822","commenter_b":"@username Ummmm So your a priest and admitting being a child molester? Sound like a real POS...Find someone of legal age","commenter_a":"Penn State fans must be proud to cheer for a POS coach that condoned child molestation and rape. \"We Are....Child Molesters\"","post_message":"As soon as Paterno’s familiar image – shirt and tie, thick glasses and rolled-up pants – appeared,fans erupted and kept cheering...  GAME RECAP: @webpagelink"},{"comment_id":"1131317030222640","commenter_b":"Nice trolling bitch.","commenter_a":"If I want my kids taught fairy tales I will send them to church. As a Louisiana resident this does not come as a surprise.","post_message":"This is appalling."}]
