[{"comment_id":"10153440650715329","commenter_b":"What the fuck? Did you just call yourself a whore?","commenter_a":"This chick needs to get over herself. My mother was a lathe oporater at a pipe yard in the 70's and never whined about the way she was treated. Obviously this girl ain't from Texas. Suck it up buttercup.","post_message":"preach"},{"comment_id":"10154991280103812","commenter_b":"Make America Hate Again","commenter_a":"Hopefully trumps followers do not take this the wrong way and try to overturn the world if he looses.... smh","post_message":"In final campaign stop before Election Day, Donald J. Trump calls on working class to 'strike back.' \"Today is our Independence Day.\" @webpagelink"},{"comment_id":"1159435154076513","commenter_b":"Build the wall. Defend the borders. Kick the invaders out. Go back to your own country.","commenter_a":"Israel built a wall and it worked. We have to control who enters our country. Or we will be overrun.","post_message":"“Please, please, please do not fall for the idea that we are going to build a wall along the entire 2,000-mile border of the United States and Mexico ... It’s not feasible. It’s not practical. It’s too expensive. And by the way, I’ve never seen a fence or a wall that if a human being wanted to get over or around it that they couldn’t.”"},{"comment_id":"1672143779721068","commenter_b":"Holy cow. This woman is aging in dog years. In four years, she'll be a shrunken head.","commenter_a":"That's because only stupid woman will vote for her just because she's a woman.just like people voted for Obama just because he was black.","post_message":"A great defender of women's rights? You decide."},{"comment_id":"10153500455846336","commenter_b":"Mr Rubio: While it might be nice to possess 'class\", we don't need \"class\" as much as we need a \"leader\" who has the nerve to say what's on everyone's mind and then do something. It remains to be seen if he can get past the nefarious \"electoral college\" that elects the president no matter what the \"popular\" \"people's\" vote is.","commenter_a":"how about instead of commenting on another persons comments you actually tell us how you are going to fix all the crap wrong with our government, waste and abuse of tax payer dollars, so how are you any better??? so tried of you all","post_message":"Sen. Marco Rubio addressed immigration and Donald J. Trump's controversial comments. @webpagelink (via Fox & Friends)"},{"comment_id":"10153291024331509","commenter_b":"They are, dummy. You must be the next Nancy Grace.","commenter_a":"Fact is most of us don't drive around with hundreds of thousands in cash on us. The article barely mentions the fact that this program is geared towards getting drug dealers off the streets. Cops make mistakes because they're human but this article gives two examples that make it sound like cops are robbing innocent people daily of their cash. @username strikes again.","post_message":"You may have never heard of this program, but it's a widespread practice in which police can take your cash without any criminal charges: @webpagelink"},{"comment_id":"1150215321713025","commenter_b":"Yes and I only saw a women that look drugged","commenter_a":"YES YES YES! Are you guys blind. I only saw a pathetic man sniffing,drinking water, making faces. acting like the idiot he is. Never answered a question. Talked about himself. Never said what he would do as president. Next to him stood a confident women who answered questions, with plans for our country future.","post_message":"Would you like to see Hillary Clinton win big this November?"}]
