[{"comment_id":"10152932184944753","commenter_b":"BTW wasn't she on her way to see her Bf why not just let him pay for a cab instead of letting her ride on the subway while she's drunk and tired from all of the dancing in the party. I bet most of the people on that car where on the way to work and did not want any problems that early in the AM","commenter_a":"The foo recording is a straight both would've at least socked that lame ass predator","post_message":"What would you do if you witnessed this happening?"},{"comment_id":"10154001304876509","commenter_b":"She should be fired and arrested. No one else can break the law and get away with it.","commenter_a":"That is insubordination! She is not following the rules and duties depicted in her job description! Justified cause forr job termination! Her Supervision should file charges and she should be processed according to HR procedures which could lead to job termination.","post_message":"This Kentucky woman is still refusing to issue marriage licenses to same-sex couples on \"God's authority\" -- and in defiance of the Supreme Court. @webpagelink"},{"comment_id":"235119820270004","commenter_b":"Haaaaaaaa!!!!! Stupid, stupid lady.","commenter_a":"Too bad crybabies, he is your president. And I hated Obama but I am a grown-up and lived with him and his ugly family for 8 years. So grow up and shut up","post_message":"Trump has now set a record for the most hated president."},{"comment_id":"783948935040375","commenter_b":"I have seen girls wear a lot worse. Actually the dress is beautiful.","commenter_a":"She's beautiful and the dress is fine shame on the teacher for saying such a thing the teacher should have minded her own business !!!","post_message":"Do you have a problem with this dress? This young lady was shamed for wearing this dress to her senior prom. A teacher claimed it was too revealing and said \"Us big girls gotta cover up.\" More: @webpagelink"},{"comment_id":"10153206472131636","commenter_b":"Well said. If someone wants to dress from head to toe in black I have no problem with it, but full face coverage I find offensive and frightening. You can't read the expressions of a person with their face covered. Is it male or female? It's not necessary and definitely should be banned in the UK.","commenter_a":"There's a difference between Muslims who just wear the hijab (headscarf) and the niqab (face veil). The latter is simply cultural and is an import from Saudi Arabia and other countries that oppress woman (husbands don't like other men looking at their wives so will often make them wear one ) There is nothing in the Quran that says a woman has to wear one. I spend a lot of time in the Middle East and when in Rome and all that. It's not appropriate to have the niqab in our open society. British people might be tolerant but they don't have to be about absolutely everything. Women who wear the niqab segregate themselves from society. It's a barrier. The French have banned it and some other European countries have done the same. Britain should too. And before people start waving the \"islamophobic\" card. I happen to know a lot ...","post_message":"Staggeringly"},{"comment_id":"720244888107018","commenter_b":"they ran out on their bill and stiffed the waitress , who had to pay it from her own pocket ... THAT'S why they want to raise min . wage to 15, so waitresses at diners can afford to pay the tabs of these deadbeats","commenter_a":"LMBO","post_message":"Who paid the bill?"},{"comment_id":"10157170758630354","commenter_b":"This woman is psychotic.","commenter_a":"She's fucking disgusting to look at! A professional con artist like the Obama's and the privilege Clinton's they all should get tarred and featured in public !","post_message":"Want nightmares? WATCH:"}]
