[{"comment_id":"1612409662385087","commenter_b":"If we refuse service/sales to illegals we would be fined or jailed. They have rights, you know! More rights than American CITIZENS have!","commenter_a":"Hey...do not rent nor sell groceries or clothing or gas or anything else essential to their staying here....if we stick together their existence here will be short and sweet....","post_message":"This is stunning. After seeing this more countries might do the same. Do you think the two are connected?"},{"comment_id":"10153135601604575","commenter_b":"If they come here legally and are not criminals then they should be allowed to become citizens but if they just plan on breaking laws and feeding off everyone's tax dollars then no they should be shipped out regardless of where they come from.","commenter_a":"Well that sucks. Aside from the idiotic general opinion of the public, I've met more illegals that really want to be here to work and provide a better life for their families. Unlike many of the current inhabitants of this country that just can't wait for the first of the month for that government check. And let's be honest, we're a country of immigrants. Seems a bit hypocritical. And on the plus side at least immigrants want their children vaccinated.","post_message":"Thousands of immigrants seeking legalization through the U.S. court system have had their hearings canceled and are being told by the government that it may be 2019 or later before their futures are resolved. The increase in cancellations began late last summer after the Justice Department prioritized the tens of thousands of Central American families and unaccompanied children crossing the U.S.-Mexico border."},{"comment_id":"725221097581400","commenter_b":"This Latino American Women thinks its terrible that people here illegally are breaking laws & think its ok no its not..","commenter_a":"The petty haters whining about tax dollars need to just have a seat. And take a long, hard look at themselves. A) she's a CHILD B) she's going to go further in life than any of you small-minded simpletons because of her drive and determination, and her GPA and scholarships were a direct result of that. She didn't show up on free Yale day. She is smart, worked her butt off, and is on track for the kind of success she deserves.","post_message":"Larissa Martinez held a 4.95 GPA and took 17 AP classes over her McKinney Boyd High School career. She's also an undocumented immigrant who arrived in the U.S. in 2010 -- but only 10 of her classmates knew that before last week. After her speech, they gave her a standing ovation."},{"comment_id":"801914353278362","commenter_b":"Trump will crush this fat ugly lying lady","commenter_a":"Love how the little girl scout is pointing out the cookies to you. Rock on Hillary -supporting you in Colorado. Ignore the haters inWV","post_message":"Cookie stop in Kentucky. Picked up some tagalongs and samoas before heading across the border to West Virginia."},{"comment_id":"994807880648616","commenter_b":"Is that a fly?","commenter_a":"Della Blake","post_message":"This design student created his own 3D braces for only $60, and his teeth never looked better. (via NowThis)"},{"comment_id":"10153192741541336","commenter_b":"@username you sit there and bad mouth President Reagan about low wages and high debt well buddy you ain't seen nothing yet. obozo is bringing in all the illegals and he is giving all the companies a bonus to hire illegals over American citizens because they will work for lower wages so all wages will be kept low and where do you think obozo is getting all this money that he is passing out? It is not all taxes because if you don't work you don't pay taxes and the illegals don't pay taxes on what they earn. He is adding to the national debt by borrowing more money.","commenter_a":"I am 17 and a college student and this breaks my heart. Do people know what he did for the country? He was not perfect but he made America strong.","post_message":"Can you identify this man?"},{"comment_id":"10155435763498812","commenter_b":"I","commenter_a":"@username pretty horseys","post_message":"WATCH: When a donkey struggles to get over a fence at a non-profit animal protection sanctuary in Italy, he gets a helping hoof. @webpagelink"}]
