[{"comment_id":"886882338071488","commenter_b":"Go hug an illegal alien.","commenter_a":"Obama has done nothing for this country but make us the biggest joke in the world!!!! Hillary is worse!!! She wrote her memoirs and can't remember a thing about Whitewater, Bengazi and now the emails? Worse Secretary of State next to Kerry. How is she qualified? We have become the laziest country in the world and too much self entitlement.","post_message":"Democrats win. It's not even close! Data source: BLS and The Wall Street Journal Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"533672440152326","commenter_b":"You know that just the stupid negroes . The same ones who will kill their own .","commenter_a":"Who ever is sending the haha face this is not the place ... And you are part of the problem please show respect and leave this page","post_message":"The body of slain Dallas police officer Michael Krol is escorted to the church for his final funeral mass here in Michigan. He will be buried in Southfield later today: More: @webpagelink"},{"comment_id":"10153005291732235","commenter_b":"Why do we want to screw up a perfectly untapped planet. Look at what we have done to earth.","commenter_a":"Please don't start another unnecessary war ! Leave that planet alone!","post_message":"Attention earthlings: This is pretty cool."},{"comment_id":"10153982977694411","commenter_b":"This old bitch is an asswhole ..am sure you are having sex with your boy aren't you?","commenter_a":"go the hell home.. you are nothing but a bunch of bitchers, bellyachers.. shut up and get a life.. stop moaning and groaning and playing the pity card.. there's millions around the world that are worse off than you are.. keep moving until you find where it is Allah wants you.. dang.. are you all stupid ignorant imbeciles? can any Muslims think for themselves or do they all wait on what their God Allah/Poop Francis says.. rub your rosary beads and pray 5 times aday towards Mecca or better yet go there and shut the hell up.. freaks.","post_message":"'We were just standing outside and we all just started coughing and our eyes were burning. We were really confused about what was going on'"},{"comment_id":"10153330006631051","commenter_b":"11 died in the C130 crash in Afganistan today, thats 11 more murders for Obama.I had more respect for the Black Panthers than Obama.The Black Panthers at least admitted to being Racist and they did not murder our troops, as Obama has.","commenter_a":"More guns = less violence","post_message":"Does President Obama have a point here?"},{"comment_id":"10154015266906028","commenter_b":"Clearly you have ignored the riots that occur when sports teams win. Those are primarily white. It's incredibly difficult to understand any point you're trying to make, simply because you make no sense. @webpagelink","commenter_a":"Cops die on a daily basis stopping crime and just because there is some bad cops you assume all of them are bad ? What are you doing San Francisco 49ers Colin Kaepernick what are you doing to keep people safe or stopping crime ?","post_message":"After some fans took to social media to burn the jersey of the embattled quarterback because he refused to stand during the national anthem, photos of Colin Kaepernick's socks have surfaced and riled people up again. @webpagelink"},{"comment_id":"736002233211226","commenter_b":"She is such a wonderful bitch isn't she!?!!!","commenter_a":"I like Karma.","post_message":""}]
