[{"comment_id":"1807825672796282","commenter_b":"If he gets in please let him build that wall to protect our Canadian women and girls from him and His followers.","commenter_a":"This is what I commented on his \"apology\": You literally said: you grab women by the p----. You kiss them and don't even wait. That sir is sexual assault. You should be apologizing for your behavior not your words. And what about the 13 year old who accused you of rape? Your own wife accused you of rape as well and you shut her up in your divorce settlement. You sir are a disgusting misogynist and will say what you need to to deflect the attention from your personal flaws. You are projecting onto Clinton what you've done yourself. And this isn't about Bill Clinton. This is about who should be the next president, you or Hillary. Your past behavior is proof that you don't care about the women of this country, and Hillary has shown she does. Additionally, President Obama yesterday just signed a bipartisan bill that passed the ...","post_message":"For hours on Friday night, the political world waited for the rarest of expressions from Donald J. Trump — a heartfelt apology. What viewers got was anything but."},{"comment_id":"1925997537627031","commenter_b":"Hillary is a criminal who should be facing years behind bars.. I can't see why anyone would support a criminal for president.. Felons cannot vote let alone run for president.. How could we expect a actual change from what we have now with her? Never gonna happen. If Trump don't win the election, U.S. is gonna be in worse shape than it is now..","commenter_a":"Mr Trump, there is a stellar idea going around on FB about the possibility of flying in the families of the Benghazi victims to join you at the RNC Convention!! Consensus is strongly for this idea. I hope you or someone on your staff sees this comment..God Bless You.","post_message":"I will be making the announcement of my Vice Presidential pick on Friday at 11am in Manhattan. Details to follow."},{"comment_id":"992725720849341","commenter_b":"Who cares what they want........I hope every single one of those sniveling, useless, A-holes leave!!!!","commenter_a":"Who cares","post_message":"They really don't want Donald Trump to be president."},{"comment_id":"1032772820091472","commenter_b":"And white people killing white people. America is a violent country. One man can't change that! Sad, isn't it","commenter_a":"If he was still alive it still be the same thing black people killing black people so yea everything is the same thing it do not matter","post_message":"Absolutely!"},{"comment_id":"1152094041550315","commenter_b":"This is Trump he's racist or rapists he brings crime and does drugs is insane and sometimes maybe nice but lies all the time! He only hooks up with foreign women probably keeps them in the basement until needed no American woman would ever marry him no matter how much money he has!","commenter_a":"Make America great again by getting rid of Trump! Check out the smile on that white boys face makes me sick and I'm white! Trump is nothing but a trouble maker and an embarrassment for America! Do any of his supporters listen to him I mean really listen and heed what he says and does?? I doubt it must be mental illness","post_message":"The laughter of the Trump supporters will haunt you."},{"comment_id":"10153899395243701","commenter_b":"Please take time to familiarize yourself with actual case law on this subject. Anyone under the influence of drugs or alcohol cannot legally consent to any sexual act. It makes no difference if she got that way voluntarily or involuntarily. YOU CANNONT CONSENT IF YOU ARE IMPAIRED. This is called rape","commenter_a":"I question this case also .... According to the accuser, Cosby urged her to take pills and to drink wine...... Urged her to do so??!!! So she did it to herself! I highly doubt an educated woman would take pills and drink in a room with one man without knowing the out come!! Personal responsibility is what all these people are not understanding! Read more: @webpagelink","post_message":"JUST IN: Bill Cosby has now officially been charged with sexual assault more than a decade after a woman told police the comedian drugged and violated her at his home near Philadelphia."},{"comment_id":"10156623129805389","commenter_b":"He wrote an entire book about it. Would you like copy?","commenter_a":"Great. How? How exactly is he going to create jobs? This guy just says he's going to make things great without details. He is making hollow promises. You know who else did that? Obama. He did the same thing. Actually, he did it without insulting people and sounding like the middle linebacker of a high school running for class president on the platform of beating up nerds and gym class all day long.","post_message":"“I am going to be the greatest jobs president that God ever created.” WATCH the highlights from Donald J. Trump’s New Hampshire primary victory speech. #Hannity"}]
