[{"comment_id":"10153083977090950","commenter_b":"The costume? Stupid. Offensive? A man who think he's a woman when NUTURE decided MALE for him and no amount of procedures will change his MALE DNA. That's offensive. What is he a salmon? Science needs to come up with some kind of rehabilitation approach or program to try and fix this social diseases, including homosexuality.","commenter_a":"Why not it's holloween nway haha","post_message":"The \"Call Me Caitlyn\" costume faced Internet backlash, with some calling it \"transphobic.\" Stores, however, think the outfit \"celebrates her.\""},{"comment_id":"10153677956363961","commenter_b":"@username Yes, those stupid one.","commenter_a":"In case you haven't notice, Tom, Obama has given the \"middle finger\" to Americans since he's been in office, always going against the will of the majority. We'll remember you when your term is up.","post_message":"Proud to help secure a new federal grant to improve public transit and fix traffic lights in 10 Connecticut towns"},{"comment_id":"10156237549955231","commenter_b":"Apples and oranges. American problem vs not America's problem","commenter_a":"White Christians have committed more acts of terrorism in America than Muslims. Some of you are clearly stupid & misinformed","post_message":"It doesn't help that Trump has been \"fanning the flames\" with his anti-Muslim talk."},{"comment_id":"10153630936701955","commenter_b":"Idiots are using it for crack and other illegal substances !","commenter_a":"What a shitty headline. The doctors put him in a coma, not the e-cig. Drudge should have had more sense than to repost such drivel.","post_message":"Man In Coma After E-Cigarette Blows Up In His Face..."},{"comment_id":"10154209320467541","commenter_b":"Really? this may be your utopian vision of socialism for everyone nice try buddy. Congrats on taking the time to list Obamas wonderful accomplishments. I do not agree with 99% of Obama's policies and visions. Trump has the overwhelming support of people in this nation and Trump supporters are ready to make America great again. We shall begin by getting a handle on illegal immigration enforcing the Laws of this nation and doing what America does best. We are still the beacon of the free world, lets work on keeping it that way. Good luck with your Socialist views and a Globalist society.","commenter_a":"Funny the Trump haters appear to be a new crop of Liberal Morons. They are to young to be the old Bush bashers they must be the demon spawn of the Bashers!","post_message":"CAPTION CONTEST President Donald J. Trump casually mused on a \"nuclear holocaust\" and yelled at reporters in a surreal press conference earlier today. @webpagelink"},{"comment_id":"10153454020915329","commenter_b":"My favourite is free spirit - I might go with that one","commenter_a":"Bree Andrijich @username Amy Badock Monique Scott","post_message":"Sport fishing enthusiast?"},{"comment_id":"10152780926180779","commenter_b":"Dude I get it let it go","commenter_a":"Yet how many innocent black men have been killed for no reason other than for being black?","post_message":"Over 15 police officers were injured – six seriously – and over 200 people were arrested as riots broke out in West Baltimore yesterday following the funeral of Freddie Gray. Maryland Governor Larry Hogan declared a state of emergency in the city and requested that Maryland activate its National Guard."}]
