[{"comment_id":"1844278629192581","commenter_b":"Yep, only the melon and spice tips make sense.","commenter_a":"It's all a bounch of whooie! Put Kerry in the frig and forget about it!","post_message":"Check your fridge ASAP."},{"comment_id":"573913712787669","commenter_b":"Yada, yada, yada. This woman(?) Is so full of BS she makes me ill.","commenter_a":"Get over it!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153381837831770","commenter_b":"SHES A PROFESSOR ==== HEY KIDS DONT GOT TO THAT SCHOOL SHE WENT TOO SCHOOL WITH OBAMA AN HILLERY,","commenter_a":"Ladies and gentlemen if you want to see the face of Satan then look at this woman see how she can lie like that and never change her facial expressions. This woman I believe is either a muslim or a muslim symphothiser where do these people come up with such outlandish lies like this. This woman should be locked up. Make her produce evidence of her accusations and if she cannot then Lock Her Up For Slander.","post_message":"A queer theory professor in the department of women’s and gender studies on the Rutgers University campus in New Brunswick, N.J. believes that Israel has plundered the internal organs of dead Muslims."},{"comment_id":"1015814318563348","commenter_b":"Illegals are getting benefits. Its not my fault that youre too much of an idiot that you cant see that. And because of our backwards government giving handouts to everyone of these assholes, theres not enough resources left to give them to the people who really deserve them. Stop being such a dumb cunt. Every chance i have to take part in getting rid of these parasites, you better god damn well believe that i will!","commenter_a":"And illegal immigrants shouldnt be in the us either. Have you seen the jails in this country? If you break the law, they lock you in nasty, unsanitary cages like fucking animals. If you break yhe law, you get what you deserve!","post_message":"These conditions should not be allowed anywhere, especially in the U.S."},{"comment_id":"10154282425457439","commenter_b":"Pussy's","commenter_a":"They are clueless","post_message":"The Armenian and Greek genocide by the Muslim Turks is reason enough not to build such a mosque. And what makes these knuckleheaded officials so sure that the imam won't teach and preach jihad. The jihadic doctrine is a critical component of Islam."},{"comment_id":"933606760085373","commenter_b":"We should have dropped another one !","commenter_a":"He is the 1st president to do so, sometimes it takes a bigger man to start something else. Maybe after this the Japanese will come to Pearl Harbor and do the same. What is wrong with u people. The man is talking peace and yes what happened years ago was evil on both ends, it don't mean u can pay respects. I hope all presidents from around the world take a piece of what Obama has done to try and end hate because it seems like we are going backwards with trump being so popular. He's making it ok to be racist and hateful and it's not. Happy Friday y'all","post_message":"Pres. Barack Obama lays a wreath at the Hiroshima Peace Memorial, mourning the Japanese, Korean and U.S. victims of the world's first atomic blast in WWII. @webpagelink"},{"comment_id":"10152942237502452","commenter_b":"My question is.... Wtf was she doing in lake elsinore....","commenter_a":"Why was she in Lake Elsinore?","post_message":"The owner of Wolfee Donuts in Lake Elsinore wants an apology from Ariana Grande after surveillance video allegedly caught the pop star licking doughnuts at his shop. abc7.la/1CqmnVO   Grande also says 'What the **** is that? I hate Americans. I hate America' when a tray of doughnuts appears in front of her."}]
