[{"comment_id":"1667182103568902","commenter_b":"Obama doesn't like this country or anyone who isn't Muslim. Everything he has done has been to weaken this country. He has opened our doors to terrorists, communists, illegals and Ebola. He has no respect for our military at all. It doesn't take a genius to figure out what he's doing.","commenter_a":"Love Sheriff Clark.","post_message":"Barack Obama is a USELESS president. I am counting down the days till he's gone!"},{"comment_id":"10153950593368984","commenter_b":"MAXAMED : WITH THIS NAME YOU SHOULD NOT BE SHOWING OFF!! JEWS ASURE THE WHOLE PLANET BELONG TO THEM, WHAT SAY YOU? FIRST CHANGE YOUR RIDICULOUS NAME, THEN AFTERWARDS CUT YOUR PENIS, ONLY TO SAVE THE WORLD OF PEOPLE LIKE YOU.","commenter_a":"A simple answer: If Muslims need to be treated like Muslims, then they should commit their crimes in Muslim countries. When in America, do as Americans do!!!","post_message":"Muslim inmates decided they needed special treatment because an Islamic holiday was coming up, so they started making insane demands. That's when the jailers responded with some unexpected news..."},{"comment_id":"970468323009697","commenter_b":"@username PLEASE vote for Hillary she is on her way out, just ask Biden, ask Obama, ask Bernie, ask the FBI. So plz do us a favor and vote for her, she will need something to read in jail and your voting ballot will be perfect.","commenter_a":"She might have a college plan but how could she do it from jail?","post_message":"How much could your family save with Hillary’s college plan? In Oklahoma, a family earning $75,000 per year could save $22,300."},{"comment_id":"10155583130286509","commenter_b":". Unlike Obama, Trump has control of congress and can appoint to the Supreme court due to the opening. Obama never had that amount of power. Plus Obama was a moron. Trump needs to build that wall. Trump needs to build camps and round up all illegals that can be found. Put them in internment camps till they can be removed to their country of origin. Or just put them in prison like he said for 5 years if they come in the country illegally. We have our president now like the minorities had Obama.","commenter_a":"It is not Van Jones' job to correct people to take away their fears. It is the Trump camp's job to do so. Don't tell people when to feel afraid and when not. You have to make them feel safe and welcome. Donald Trump is the President now. Now he has to do his job for ALL.","post_message":"\"You need to back off.\" CNN's Van Jones exchanged hot words with a Donald J. Trump supporter who argued Jones ought to repudiate fears among protesters that a Trump administration would create camps for illegal immigrants. @webpagelink"},{"comment_id":"10153216754526167","commenter_b":"Madam President get used to it.","commenter_a":"But Hillary sucks","post_message":"Finally, everyone starting to agree that we need to shut it down. It's instructive to look at how we got to this point."},{"comment_id":"10152912675916051","commenter_b":"smith you ain't a pimple on my ass. Your pissed because everything I said is true. And I hope you need a cop and they make a stop on the way. Your not in my tax bracket, you don't have any skills ( unless having the government feed and house your little bastards ). All you good at is living off other people and their money. Your nothing but a waste of skin. Get a life and a job. Your the POS loser. And I can see you never served your country either, have you bitch?","commenter_a":"They said they filmed it. Were the hell is the rest of the film. It's funny they only show the cop saying something. What was said and what happened up to that time????","post_message":"When the guy in the car asked why he was being arrested, the officer didn't miss a beat: \"Because I feel like arresting you.\""},{"comment_id":"968043416588740","commenter_b":"I don't think the majority of people in England would believe any of this rubbish any more than you or I","commenter_a":"The danger of this kind of journalism is the Anti Scottish fervour that it builds up in England. English nationalism is not the civic nationalism that we are trying to achieve in Scotland. The feathers of the establishment have been rattled by,first the referendum, and then the GE. The audacity as the Mail sees it is for Scotland to be ungrateful subsidy junkies who have sent 56 SNP MPs to Westminster to represent their constituents. To carry on this vilification that Cameron promoted during the GE campaign, only months after love bombing Scotland, is to let a Genie out of a bottle that won't go back in. The union could and should end in an agreement between too friendly nations who share an island by the voting power of the people of Scotland, and not by this ever increasing acrimony fostered by the English press. It's a dangerous and unprincipled ...","post_message":"Did the Scottish National Party (SNP) hound Charles Kennedy to his death?"}]
