[{"comment_id":"690224757750904","commenter_b":"the only parasites and thieves are the palestinians and hamas","commenter_a":"Nice for starters!","post_message":"The US House of Representatives Armed Services Committee has approved $474 million for Israel’s anti-missile systems."},{"comment_id":"10153378197295950","commenter_b":"go home please","commenter_a":"When will she realize she is in the wrong party for the rights of women and minorities?","post_message":"\"I have battled breast cancer,\" Fiorina voice says in the ad as clips of the candidate at various campaign events play out. \"I have buried a child. I have read my Bible. I know the value of life.\""},{"comment_id":"10153451774798132","commenter_b":"Some lesbians dress like men everyday.... Just saying.","commenter_a":"HE SAY'S HE IS A WOMAN BY ALL MEANS, BUT STILL DRESSING IN MEN'S DRESS SHIRTS?? humm I don't get that","post_message":"Here's what everyone will be talking about tomorrow."},{"comment_id":"10154645517167599","commenter_b":"@username Trump should be in the swamp!!","commenter_a":"Everyone needs to be more like Romanians. At least they doing something about corruption in their government.","post_message":"We were live from the anti-government protests in the Romanian capital, Bucharest. The demonstrations are in response to the passing of a decree that will free dozens of officials jailed for corruption."},{"comment_id":"10153560718630950","commenter_b":"She SHOULD be acting like a professional woman!","commenter_a":"I'm with Kelly. Respect goes a long way. There is a right way and a wrong way and ABC and Michael Strahan chose the wrong way. Kelly has a right to be hurt.","post_message":"Kelly Ripa reportedly feels \"disgusted and angry\" that this was done behind her back."},{"comment_id":"1080515501999587","commenter_b":"Not going to stoop to your low, Rebio.","commenter_a":"Sounds like Rubio is gay. Wants to be in the bohemian group. Where all the rich billionaire and American leaders go and have a gay feast and worship something called mule. No woman are allowed.","post_message":"He went there..."},{"comment_id":"1419268561466221","commenter_b":"Stop reasoning like an idiot","commenter_a":"Nothing lasts forever...whatever goes up must come down.","post_message":"Serena and Venus Williams are KNOCKED OUT of Rio"}]
