[{"comment_id":"10153633737712464","commenter_b":"Go Cruz go. Tell the facts and let the media put a liberal spin on it. Planned Parenthood was meant to be racist by stopping more poor from the welfare rolls. \"HA!!!!\" They will say,\"It was an attempt to keep the Black Community from expanding the Voters Rights', or something like that. That's why Planned Parenthood buildings are in poor economic ares and not down the street from the $600,000-2 million dollar homes. Don't have to waste the fuel bills on buses that far out. Economics for the city. See it's not about lives. IF \"BLACK LIVES MATTER\", why is there even a dialogue about the killing of souls.","commenter_a":"Smarti - I aam not really interested in PP and I am sure you are looking up everything you can find to repudiate what Cruz says. Good for you if you think PP is on the up and up. I just don't understand paying all that money when it is not a gov operation. If it is a private business - great - let them fund themselves, don't use our money to help pay$ 600,000 salaries along without mentioning all the other expenses. I read $1.2 mil spent on things other than women's health. I really don't care about that stuff. I am more interested in what is going on in Syria etc.","post_message":"It says something about just how corrupt this administration is that there is not a soul on earth that believes the Obama Justice Department would even begin to investigate Planned Parenthood."},{"comment_id":"1702569516701619","commenter_b":"Soetoro the ineligibles wife did do that! But why are the D traitors who condone it with NFL players so upset??","commenter_a":"Oh yeah would of never heard the end of it.","post_message":"Oh, how they would SCREAM! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10158574220485206","commenter_b":"Ur a racist #sitthefuckdow","commenter_a":"We cannot wait for a Trump presidency. #WeThePeople must rise now & take back America which has been stolen from us!!! Trump touched me a year ago. He reached inside me and touched my heart and built a patriotic fire that flows deep through my veins and has given me hope that we can save America from the elitist New World Order Puppet Masters who would end our freedoms forever God bless Donald Trump!","post_message":"It would be a rare revolt."},{"comment_id":"10154155058901770","commenter_b":"Yep just what I thought!! Gets her hair color from a bottle! And still stupid","commenter_a":"I think melania trump should be taking clothing tips from a real Material Girl","post_message":"Madonna slammed Trump supporters, calling them “lazy and “un-unified.\""},{"comment_id":"10153396293173525","commenter_b":"@username, yes I do know that. It has never happened despite 45 of 50 states allowing open carry, and some that have NEVER PROHIBITED it since they became states. No open carrier has ever been \"taken out' by a criminal.","commenter_a":"Kinda think it's dumb. Makes you a target basically. Someone will see ur gun and be like let me take them out first... Ya kno... Element of surprise is better.","post_message":"OPEN CARRY: The same law that's being proposed here in Florida just went into effect in Texas, and to celebrate, several groups rallied at the State Capitol carrying their guns. STORY: @webpagelink"},{"comment_id":"811714602251233","commenter_b":"Shut up murdering swine","commenter_a":"You forgot to add that the sky is falling!!!","post_message":"So it begins... If you think the GOP bashing of President Obama has been bad, watch what they do to Hillary."},{"comment_id":"1752604474967964","commenter_b":"Feel bad that all she did went right over my head. We couldn't understand the words but we made many comments on her big butt and thighs! Someone that big should never wear what she was wearing on national TV!","commenter_a":"LL Cool JJ, what a douche. Looks like the Wayans brothers had this jackass pegged, way back when, with \" Momma's Gonna Kick Me Out ! \" Maybe on youtube? Funny stuff, but about right, apparently.","post_message":"LOOK who LL Cool J just compared Black Panther Party Supporter and radical BLM donor Beyonce to..."}]
