[{"comment_id":"10154061542714411","commenter_b":"\"Hey, Jews are getting their own country, let's all go be our typical fuckhead selves and try to butcher them all.... we'll need a name, someone go digging around and come up with something while I strap a bomb to my kid\" (The founding of Palestine).","commenter_a":"O God!!! hahahahahaha...Ignorant Mr.MP...","post_message":"Letters matter"},{"comment_id":"10154015419833869","commenter_b":"Having a hot flash doesn't mean she is not qualified!","commenter_a":"Yup","post_message":"The Borowitz Report: The same poll revealed that a broad majority of voters found an unconscious Donald Trump more fit to be President than a conscious one."},{"comment_id":"793004177467954","commenter_b":"cuck","commenter_a":"Go take some selfies Obama you fucking disgrace","post_message":"Obama is a _______________."},{"comment_id":"10155947178415354","commenter_b":"Nail her to the wall!","commenter_a":"Fry her","post_message":"Maybe they can add this as a post-credits scene in Michael Bay's Benghazi movie..."},{"comment_id":"915165211871817","commenter_b":"@username guns don't kill. Stupid demonRATs with guns kill.","commenter_a":"You're doing great, Bernie!","post_message":"“This may not be great politics, but I think the Secretary is right. And that is that the American people are sick of hearing about your damn emails.\" -Bernie #DebateWithBernie"},{"comment_id":"10158383797715093","commenter_b":"what do we care? get the wall built!","commenter_a":"I BET THE PEOPLE WHO LEAKED WERE DEMOCRATS","post_message":"\"It time for the constitutional system to work. It time for the legislative branch to investigate the executive. Simply put, it time for the truth.\""},{"comment_id":"10155175769803984","commenter_b":"and we are not giveing up our freedom just stoping people entering oir country...our constitution does not apply to immigrates","commenter_a":"*\"B4 you blame Trump read this\"* ******************** *I still DO NOT understand why there's so much noise about Trump's decision to ban refugees from Muslim countries?? There are '100,000 empty fully air conditioned tents' in Mina- Saudi Arabia capable of housing 3 million people yet Saudi Arabia refuses to take the refugees, who speaks same language, same culture, same tradition, same religion, yet Saudi Arabia feels it's 'a security risks to accept the refugees' but wants the Christian world to do so? I'm trying to understand this thing called 'common sense', how it's been used. Is Saudi Arabia not too wicked for turning it's back against its own? Why blaming the US? Remember it is part of Trump's election promises, yet the Americans voted for him, meaning dats what they want.* *Germany took over 1 million refugees and Saudi Arabia came up with a proposal of spending billions to build ...","post_message":"Donald J. Trump gave Iran 1 chance to straighten up, and they defied him.  So now he's made a massive move to teach them we're the ones in charge.  Thank the Lord for a president with an actual backbone!"}]
