[{"comment_id":"10154001146333598","commenter_b":"Give me a chance at her murderous body!","commenter_a":"Shame on you.","post_message":"This Abortionist Flies in to Planned Parenthood to Abort 31 Babies Every Day"},{"comment_id":"1012583592144355","commenter_b":"and if we stay in toltel control","commenter_a":"More false propagander to try to get us to vote to stay in. The damage has already been done the EU Commission is an unelected, self sustaining, beaurocratic, and vastly overexpensive power crazed clique that will not change its self no matter what this person says. The only way to free ourselves of this shower is to vote to leave!","post_message":"Has the EU meddled too much in the daily lives of its citizens? @webpagelink"},{"comment_id":"891529944370915","commenter_b":"Yes I'm still for Trump! Put this women in prison. Stupid Women Lost & she conceded.","commenter_a":"Yes","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"10153574405058352","commenter_b":"No lesson learned. Maybe she wore her moms shoes because she could not afford a pair of her own","commenter_a":"She should have stayed down and took those shoes OFF and kept it movin","post_message":"Lesson learned! Moment girl graduating from high school wobbles for 12 SECONDS in platform heels before crashing to ground"},{"comment_id":"10152977510376130","commenter_b":"Shut up meg","commenter_a":"I know what the show is about!!","post_message":""},{"comment_id":"10155183414820725","commenter_b":"A whole alot of whores","commenter_a":"He's an attention whore!","post_message":"Remember when Kanye interrupted Taylor Swift at the 2009 Video Music Awards? Well, he rushed the Grammy stage last night, showing off his sense of humor and impeccable timing: @webpagelink"},{"comment_id":"10153472333633352","commenter_b":"So how do you teach your girls how to be in a stable relationship?","commenter_a":"I have 3 daughters & until they grow up, no man will harm them under my roof. I sacrifice my dating a man or finding a love, so they can always feel safe. I won't allow a man to enter my life until my task is finished!","post_message":"Woman Murdered by Boyfriend After She Allegedly Asks Him If He Assaulted Her Daughter in a Sexual Manner – Daughter Also Murdered, Then Man Takes Own Life."}]
