[{"comment_id":"10153572356905329","commenter_b":"Yeah Cheryl. You stupid bitch.","commenter_a":"Not very honest of you @username - you have deliberately failed to mention the marginalization & persecution of christians & other groups who morally oppose same sex marriage, & the hardship & tyranny they now endure. You have also quite 'conveniently' chosen to ignore the increasing body of evidence that is emerging of the sense of loss, disadvantage & suffering, those raised in same sex relationships, & who have now reached adulthood, have & are experiencing - nor the vilification & persecution they can face for daring to speak out....","post_message":"Eighteen other countries have legalized same-sex marriage before America. Let's see how some of them are holding up."},{"comment_id":"915165211871817","commenter_b":"@username guns don't kill. Stupid demonRATs with guns kill.","commenter_a":"You're doing great, Bernie!","post_message":"“This may not be great politics, but I think the Secretary is right. And that is that the American people are sick of hearing about your damn emails.\" -Bernie #DebateWithBernie"},{"comment_id":"10153641389062994","commenter_b":"I still don't understand all the female supporters on here. He hates you.","commenter_a":"He did a great job!!!","post_message":"Donald J. Trump is in Birch Run and will take the stage in just moments. Watch what the GOP contender has to say about Michigan, this country, his campaign, and who knows what else."},{"comment_id":"392158754326577","commenter_b":"I hope Trump wins the nomination. Then The Americans will for sure vote for a demokrat, whether it be Hillary or Bernie. No way the Americans are that stupid!!","commenter_a":"Isn't his stand against Muslims prohibitive by the Constitution and therefore automatically eliminates him from presidential nomination?","post_message":"Let’s stop the racism. Let’s stop the xenophobia. Let's stop Trump. #GOPDebate"},{"comment_id":"10153584523586336","commenter_b":"I'm not an Alabama fan, but if I was, I'd be truly upset with this video..... Not one time did those girls say \"roll tide\".... I'd ban it too!! GBO #rockytop","commenter_a":"I just love when someone judges something they know nothing about.","post_message":"The recruitment video has been criticized for lacking diversity and objectifying women."},{"comment_id":"10153941813117042","commenter_b":"Cuz is not her child . evil face.","commenter_a":"My child is 8 n very timid n shy. The minute i find out some one hurt her in any way. God help them cause ima go after them.","post_message":"A day care director was caught on video hitting a child with toys. But then it gets even more disturbing from there.   Warning: Police described the video as difficult to watch."},{"comment_id":"1171676779558735","commenter_b":"What couples?Floyd has a harem of women like this in Vegas!!","commenter_a":"these celebrity couples are getting ridiculous.........i can understand the attraction to cash but at least try to hide it...","post_message":"Floyd Mayweather is dating a 19-year-old New Look sales assistant from the West Midlands."}]
