[{"comment_id":"10153650702998984","commenter_b":"The evil corrupt white witch.","commenter_a":"It's about time,","post_message":"All I can say is wow. I didn't think this was ever going to happen, but here it is. Hillary has to be terrified right about now... Are you glad the FBI is taking action against Hillary?"},{"comment_id":"10153925535020579","commenter_b":"Oh, he is VERY Republican. Hardly just in \"name only.\"","commenter_a":"another worthless rino.","post_message":"Clip from Speaker Paul Ryan's address to Congress. Watch full speech here: @webpagelink"},{"comment_id":"834047250056984","commenter_b":"NO MORE ILLEGALS IN THIS COUNTRY ON WELFARE!","commenter_a":"Ladies and gentlemen, the next president of the United States, Donald Trump. Trump train all the way to the white house!!!! #trump2016","post_message":"Thank you Illinois! #SuperTuesday #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"904059146360453","commenter_b":"She is earning her check! hahahahha WTF! I just can't with this crazy woman!","commenter_a":"Maybe she's trying to help Hilary??","post_message":"Donald J. Trump campaign manager Kellyanne Conway said she wished her candidate had more opportunities to debate and would \"be willing to do another one if somehow they can squeeze it in.\""},{"comment_id":"10152818942414342","commenter_b":"Slit her throat","commenter_a":"Sick! Sick! Sick! Hope she burns in hell.","post_message":"UNTHINKABLE CRIME: A mother accused of slitting the throats of her three young children, because, police say, she wanted them to stop crying. FULL STORY --> @webpagelink"},{"comment_id":"902249986464524","commenter_b":"ridiculous..she was good enough to lay down and have a child with but now she's a hoe?","commenter_a":"SMDH now that an action right there to piss her off more. No woman wants the father of her child disrespecting her on media outlets. Let's see how long she gonna ban him from seeing his son now. Some guys never learn. No matter how much he hate her he need to handle their business in private. Who wants to grow up with the public and their father throwing shade at the person that gave birth them. U cant stop what the world thinks of Amber but Wiz should act more mature and handle it since he a Dad now. They need a mediator ASAP","post_message":"“Instagram Turnin’ These Wives Into Hos”: Wiz Khalifa Takes Cheap Shots At Amber Rose On New Song, “For Everybody” :("},{"comment_id":"978050422232298","commenter_b":"NOT A FAN of this pro-Muslim woman PERIOD!!","commenter_a":"She is the new definition of cool. Drop that mic and walk away.","post_message":"Mic drop."}]
