[{"comment_id":"10153141733752293","commenter_b":"I think you all forget that even if abortion was illegal, it would still happen. Illegal abortions were horrible, many women died. And if you think that only poor women had them or only uneducated women had them, you are badly mistaken. They happened in every economic group. Abortion needs to be legal, safe and rare!!!","commenter_a":"Yay for more fake videos. Planned Parenthood is a great organization. These people trying to create fake and misleading videos are the real enemy.","post_message":"In the video, the group discusses a potential contract for fetal parts."},{"comment_id":"10153478052978984","commenter_b":"This girl is one ignorant PIG !!","commenter_a":"This spoiled brat is headed down the same road as Brittny and Lindsey. She needs prayers not publicity.","post_message":"Pop star Miley Cyrus just said something highly disturbing about Christians. It's especially sad when you consider where she came from..."},{"comment_id":"10152991512942377","commenter_b":"She broke the law just by living too long","commenter_a":"Do not pass go, do not collect $200M","post_message":"Hillary says she never received classified emails on her personal server. Do you believe her?"},{"comment_id":"10153405815803132","commenter_b":"about time....she is to good for him!","commenter_a":"Amanda Nicole Ross","post_message":"\"There have been problems for a while, so this was inevitable.\""},{"comment_id":"10153568531759705","commenter_b":"Umm for reals...","commenter_a":"10154509258848856Eva Sellers Uhm, clearly they missed the Jammie era.","post_message":"What's the sexiest decade of sleepwear?"},{"comment_id":"10153437079993984","commenter_b":"She can eat poop as far I care along with her piece of crap husband","commenter_a":"We need to vote more of these intellectual people into office. We should be so grateful to them for telling us what to eat...reckon they could help me pick out my clothes too?","post_message":"Wow. I will have to pass and stick to the original... Do you think the federal government should stay out of what Americans decide to eat?"},{"comment_id":"1203183663111217","commenter_b":"STFU","commenter_a":"Nothing Mr. Trump does compares with crimes Hillary and obama have committed.","post_message":"A prominent Republican who supports Donald Trump urged the candidate to start acting like “a potential leader of the United States.”"}]
