[{"comment_id":"10153022619096523","commenter_b":"She's white who cares... Get over it lady!!!","commenter_a":"This is so sad","post_message":"\"She told me not to blow her cover about the fact that she had this secret life or alternate identity. She told not to tell anybody about Montana or her family over there. She said she was starting a new life.\""},{"comment_id":"10153513922564087","commenter_b":"Typical obfuscation from a serial liar & all-around nasty woman,","commenter_a":"Bernie will release whatever you ask him to. He has nothing to hide!","post_message":"“Let everybody who’s ever given a speech to any private group under any circumstances release them,” Hillary Clinton said on ABC’s “This Week.” “We’ll all release them at the same time.”"},{"comment_id":"10153591312367217","commenter_b":"The death of the GOP is fun to watch!","commenter_a":"I can explain it in fewer words - sore losers","post_message":"He's the presumptive nominee but not everyone's a fan of The Donald."},{"comment_id":"10153761646217439","commenter_b":"Dorrie America is a christian country. No one has to live under Sharia law unless they desire to participate. Women that are abused need to run to a shelter with their children ASAP.","commenter_a":"Brilliant and brave that Ben Carson would say openly what a majority of Americans are to afraid to say about Islam. Obvious to non-politicians what the incompatibility is all about.","post_message":"Carson is the first presidential candidate ever – or perhaps since Thomas Jefferson – to show a detailed knowledge of Islam and Sharia: “Right now,” he said about the possibility of a Muslim President, “when you have something that is against the rights of women, against the rights of gays, subjugates other religions and a host of things that are not compatible with our Constitution, why in fact would you take that chance?” Brilliant. Contrast those clear and simple and accurate words to the Obama administration’s systematic and deliberate denial of the nature and reality of the jihad threat. The entire Obama response to the jihad is called “Countering Violent Extremism.” Note the glaring absence of any reference to Islam and jihad. Obama is trying to fight a war while pretending that the enemy is other than what he is, or even worse, is nameless, faceless, and bereft of ideology. ..."},{"comment_id":"1669966499994538","commenter_b":"Dumb. Completely fucking dumb if you vote for her. Please, take her and leave the country.","commenter_a":"WHAT A WEB WE ARE WEAVING , A WOMAN CAN BE PRES. JUST NOT THIS LYING WOMAN,WHO COULD BE PROUD OF HILLARY FOR PRESIDENT.","post_message":"Michelle Obama got emotional when speaking at the Democratic National Convention, as she remarked that \"Because of Hillary Clinton, my daughters...take for granted that a woman can be president.\" @webpagelink"},{"comment_id":"1495136007456674","commenter_b":"Just every woman with a family huh? Men with a family don't do more too?","commenter_a":"You all don't know what hard work is. Every woman that has a family does more than fast food workers, and fireman definitely do much more than fast food workers!!!","post_message":"\"Some people say paramedics don't even get $15 an hour and they save lives. So why should fast food workers get that?\" That question comes up a lot when we cover #FightFor15 rallies, like this one in Detroit. But Fox2's Roop Raj is having to defend himself just for asking it. Watch his whole report here and see what you think: @webpagelink"},{"comment_id":"10154422800373132","commenter_b":"These women are smart?? Lol OK.","commenter_a":"This show is a flake need to be cancel asap.","post_message":"That's quite the family heirloom, Kim Kardashian West. (via PeopleStyle)"}]
