[{"comment_id":"602032646612178","commenter_b":"It's a very very last resort. We would have to live with it for the rest of our life. I am a responsible gun owner. Guns are meant for hunting and in case of a immediate threat on your or someone else's life only. #Berniesanders","commenter_a":"The guns themselves don't worry me. It's the people who demand having them that worry me. They never have legitimate reasons. It always boils down to paranoia and delusions of grandeur based on violence. Not the kind of humans I want to see armed.","post_message":"Multiple other vehicles were hit by gunfire, too. How many other angry Little Fellers are out there with guns?  -Conover"},{"comment_id":"509824199177535","commenter_b":"^ Then stop posting your shit on our news, we honestly couldn't give a fuck about you dumb cunt Americans. Continue shooting each other, I need more wanking material.","commenter_a":"\"More guns!\" -Americans","post_message":"DEVELOPING: The search for the suspected gunman continues this morning."},{"comment_id":"10153105302477144","commenter_b":"Funny. I thought she sounded a lot like Hillary Clinton","commenter_a":"She is my number 2 choice. I am all about Bernie, but hif he doesn't get the nomination, I will give it all to get this woman in office bcause the alternative side is terrifying.","post_message":"\"The defining economic challenge of our time is clear. We must raise incomes for hard-working Americans so they can afford a middle-class life.\" — Hillary Clinton"},{"comment_id":"10153361671334032","commenter_b":"There's a huge difference between hearing loss and deafness. Its nothing at all like your eyes that are fixed with glasses. Patti. There are resources. Tomorrow if I can remember and find this again I'll list them or PM you. I don't know what the current name for the former Self Help for the Hard of Hearing. I'm not sure if you still have hearing aids. If you do find a good audiologist ASAP and don't stop until you find someone who treats you like you are their only client and their business dependent on your satisfaction. Anything less you shouldn't accept. If you can ever afford new hearing aids you MUST get digital. They don't know how long the current ones last. They haven't been out long enough to start failing. 10+ years for the current Gen. The biggest and very common thing people with hearing loss do is ...","commenter_a":"I just want to interject that driving while hearing impaired is not any more dangerous than while hearing. Your freaking out while driving is only in your head.","post_message":"What could just one day with a slight hearing loss teach a woman about what it's like to live every day without one of her five senses?"},{"comment_id":"10153510448341130","commenter_b":"Because they turn away NO ONE. Because it cost a lot of money to give out free care. Or low income women can pay a small portion vs. going to a CLINIC where they want your soul before you get care. Many women are struggling to EAT. How long do you think they could do all that they do with out funds ?????????Gimme a break.","commenter_a":"Tell us something why a big corporation such as planned parenthood need my money?","post_message":"A big victory for Planned Parenthood."},{"comment_id":"10154209285520969","commenter_b":"Madeline why then, where we're your masses in Nov. Your just sad","commenter_a":"Patricia slice that is such a lame fucking saying","post_message":"WATCH LIVE: The Senate votes on the nomination of Jeff Sessions for Attorney General after Republicans voted to silence Elizabeth Warren."},{"comment_id":"1673100576267383","commenter_b":"Happy Birthday Goldie, what a delight you have been over the years!","commenter_a":"Yep, gotta love our girrrrrl....","post_message":"Happy birthday, Goldie Hawn!"}]
