[{"comment_id":"1036339909720353","commenter_b":"Skye Waters Maite Roman","commenter_a":"You guys just love to look down your noses at others. Yes, it is an incorrect viewpoint, but ridicule is for idiots and children.","post_message":""},{"comment_id":"1269332673102189","commenter_b":"Becky, RAISE YOUR HEAD UP OUT YOUR BOYFRIENDS LAP, CHILD!","commenter_a":"Sorry but safety of USA citizens comes before everyone else!! This is All on Obumfuck!","post_message":"The youngest Nobel Prize winner says it perfectly."},{"comment_id":"10153564963769778","commenter_b":"Happy Birthday Andrew Thomas,thought you might like this. :D","commenter_a":"hahah xD oh i must watch i will feel the flow xD i know it!","post_message":"After reviewing dashcam footage, the Dover Police department in Delaware came across some interesting sights. \"We hope you enjoy this...and Taylor Swift, if you're watching...we're sorry.\""},{"comment_id":"1160841880602656","commenter_b":"Hello! Women pay taxes too!","commenter_a":"Not all bills in the House of Commons or Senate passes. This is a terrible bill, one that I wish not to pass. Our national anthem is fine the way it is, and does not need changing what so ever. The Honorable Member's health decline has nothing to do with this bill, and that headline is terrible to use. You wouldn't use the word healthy on any Honorable Member in the house, then why use his health attached to the bill?","post_message":"\"What a shame!\""},{"comment_id":"10153696558342629","commenter_b":"SO MANY fucking people are up in arms for this person. Unless her mental illness was so severe, that she couldn't have had the slightest idea that driving into a crowd of people was a BAD thing to do, then I don't think her being an angry, evil nut job is enough to let this thing off the hook.","commenter_a":"Is anyone surprised that Adacia Chambers already has a days-old Facebook support group? Yeah, me either.","post_message":"“The evidence suggests this was an intentional act, not an accident.”"},{"comment_id":"820316618158915","commenter_b":"Kick his ass out of this country,","commenter_a":"Black price of shit","post_message":"Trump Hating Thugs Split On Flag… Look What Happens Next [VIDEO]. If he was a real man and doesn't like this country or our flag he should leave. Do you think he should deported?"},{"comment_id":"1158183760868319","commenter_b":"Ya cause your a pussy","commenter_a":"Thanks Delta & united Airlines for the great work. U got my business.","post_message":"Humane Society's president said Delta \"has set a great example.\" \"No airline should provide a get-away vehicle for the theft of Africa's wildlife by these killers.\""}]
