[{"comment_id":"10153573613391037","commenter_b":"An interesting job for our President on how to get these kids off the street at night and up in the morning to go to school.","commenter_a":"If it's done the right way!!!!","post_message":"The president says helping America's minority youth and making sure young people have the opportunity to succeed is \"an economic imperative.\" Liz Goodwin details the push behind the My Brother's Keeper initiative."},{"comment_id":"1705728746332744","commenter_b":"The blacks elected him with help thinking they would have it made financially etc and now more are out of work and on welfare than ever. They have to stay in school and work hard like everyone else to get ahead and blacks don't see it. How do they think you get a position anywhere?","commenter_a":"Absolutely","post_message":"SHARE IF YOU AGREE!"},{"comment_id":"696428793854373","commenter_b":"Because his mother does what every south african women does ! Drink and try to get pregnant so they can qualify for more government grants so they can get more money for doing nothing and then they will leave a child at the grandparents for the full monty payout !","commenter_a":"At the end of the day. Why the hell why was a 3 month old its own.","post_message":"This is horrifying!"},{"comment_id":"714166885416447","commenter_b":"Most evil woman on the planet","commenter_a":"Only Crooked Hillary -she has to be the worst possessed women in the world of power and money -remember when they left the White House they were broke -now worth 250 Million-go figure","post_message":"A troubling taste of how the Clinton machine operates..."},{"comment_id":"10153337610537093","commenter_b":"Lol !!! Nice comeback April. #SpokenLikeATrueTenYearOld","commenter_a":"Not surprised at all Texas is a racist redneck controlling state!","post_message":"Rick Perry's good name has been restored... @webpagelink"},{"comment_id":"934315223319642","commenter_b":"Michelle Owen Nyki KiKi 😂😂😂😂","commenter_a":"AHAHAHAGA help","post_message":"Via The Everlasting GOP Stoppers"},{"comment_id":"1039031896153505","commenter_b":"How many immigrants do you personally know? I'm guessing none","commenter_a":"Every one of you idiots came from immigrants","post_message":"The immigrant population in the U.S. is more than 4 TIMES what it was in 1970."}]
