[{"comment_id":"10154137971976323","commenter_b":"You cannot stop it, it's a done deal. The pacific couldn't stop the TPPA, North Americans couldn't stop NAFTA. These deals are done above our heads, I very much doubt you would be allowed to leave the EU even if you wanted to.","commenter_a":"Have you read the EU's conditions on public services they want within TTIP? It looks to me as though these would offer considerable protection to NHS services; are we sure that our Government would have similar protections? See @webpagelink I was very much against TTIP and concerned about EU position until a colleague brought this to my attention.","post_message":"'If being in the EU has brought us TTIP, it has also brought us the means to stop it.'"},{"comment_id":"10153709063006350","commenter_b":"I can't stand Matt Lauer -- he's too much of a liberal for me.","commenter_a":"Hope not trump !!!","post_message":"'If I think for some reason it's not going to work, then I go back to my business,' Donald J. Trump told Matt Lauer about whether he would drop out of the presidential race. 'There's no question about that.'"},{"comment_id":"913163888732635","commenter_b":"Another NJ Dem on the take.","commenter_a":"n j Need to re think He will stand up to Obama. I wouldn't be surprise that Obama is behind this to start with","post_message":"Pressure is growing..."},{"comment_id":"484244465097180","commenter_b":"Why does anyone listen to her?","commenter_a":"PIG","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"404253609734988","commenter_b":"FEDERAL LAW says they shouldn't be here","commenter_a":"Sheriff Joe should deport himself.","post_message":"Judge blocks sheriff Arpaio's workplace raids of undocumented workers"},{"comment_id":"10156195234480093","commenter_b":"Guns are not only made here...","commenter_a":"People said America is full of nuts but before reading these comments i did not believe it. Take all the guns and destroy all the gun factories and find out what living in peace means","post_message":"Let's have an HONEST conversation about it."},{"comment_id":"1783407658566153","commenter_b":"Bitch!!! the only ones not giving up their power are You, Hillary, and Obama!! You need to give it up!! You lost!","commenter_a":"'The biggest way we give up our power is by not knowing we have it to start with.' --Alice Walker (paraphrased)","post_message":"This week's fireside chat is a call to action. Trump and his allies are trying to block the democratic process and our right to a vote we can trust.  If you are near New York City, join us at Trump Tower on Monday morning at 10 AM to stand up for democracy."}]
