[{"comment_id":"837415593047972","commenter_b":"what a lying hag she associates herself above everyone no matter color!!!!!!!","commenter_a":"Excuse me, is Hillary Clinton talking about humility ? - What a joke !","post_message":"Give me a break!"},{"comment_id":"10153635074276336","commenter_b":"Christina you are made of stupid. Those two things aren't even comparable.","commenter_a":"Good for her! Besides if they can deny hunting licenses because of convictions then they can deny marriage licenses for same sex couples for the same reason!","post_message":"“Some people have said I should resign, but I have done my job well,” Rowan County Clerk Kim Davis said in a statement."},{"comment_id":"537397173122691","commenter_b":"Letting illegals into the country","commenter_a":"Is there anything that does not get lefties in an uproar? Anything at all?","post_message":"This photo has San Francisco Leftists in an uproar!"},{"comment_id":"10154771677946602","commenter_b":"CB=gotohell!!","commenter_a":"Div 2. LMFAO!! Football is an abomination and now BB is a JOKE. What the HELL happened???","post_message":"For the second game in a row, sophomore Jalen Adams carried the offense. UConn Men's Basketball will play Oregon tomorrow."},{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: \"This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.\" Watch complete press conference here: @webpagelink"},{"comment_id":"10157534463145354","commenter_b":"Ass holes","commenter_a":"Tell the Lebanese to get the F off","post_message":"Antisemitism mars Rio Olympics... “The 2016 Olympics – a disgrace!!”"},{"comment_id":"591571124359879","commenter_b":"@username : Educate yourself on the economy No wall it would cost over 530 billion in trade between US and Mexico costing over a million lost jobs in US alone and cause more than 3 states to go bankrupt. You may get a new fortified entry program but no wall.","commenter_a":"Trump failure to get Mexico to back down makes him look like the man who can't makes deals even with friends instead He was laid out and embarrassed by President Nieto of Mexico right from the beginning when they talked about the wall and was told Nexico would not pay for the wall , Nieto put Trump in his place so bad that Trump said they did not talk about payment of the wall . Trump was so embarrassed that on his flight back to US he changed his speech for the Arizona rally . This is a sign of a Man who can't control his emotions and would and could lead us into a Nuclear War .","post_message":"Government access and favors will no longer be for sale, and important email records will no longer be deleted and digitally altered! -DJT"}]
