[{"comment_id":"1650734271857952","commenter_b":"Fk her old dying ass","commenter_a":"This heifer is so predictable...\\\\","post_message":"Wasting no time..."},{"comment_id":"1551402911832466","commenter_b":"You should check asians' homework","commenter_a":"I absolutely agree!! My husband and I found this to be a problem we felt,for our daughter. We were sending her to a private school until fifth grade,and we enrolled her in the public schools instead. I believe she had somewhat less homework in the public schools but it still seemed a lot. Children definitely need time to be children and to be able to play, make friends,and have free time.","post_message":"American school kids are drowning in homework compared to other countries. Like ATTN: on Facebook."},{"comment_id":"10155757237589062","commenter_b":"I guess your mother didn't raise you right then. I bet she's proud of the rude, ignorant, pathetic little girl you are.","commenter_a":"Congratulations PRESIDENT TRUMP! Glad our electors upheld THE VOICE OF THE PEOPLE.","post_message":"BREAKING: Donald Trump surpasses 270 votes in Electoral College to formally win presidency. @webpagelink"},{"comment_id":"2159179167640729","commenter_b":"Shut up you liberal ugly lying witch that THINKS she's as beautiful as Melania Trump (secretly jealous of her) get off the tv cause no one wants to look at or listen to you skank!","commenter_a":"Boo👀jk😊","post_message":"\"I feel like it was an attempted bullying.\""},{"comment_id":"10152872155116051","commenter_b":"She is a pig.","commenter_a":"Michelle Obama is a beautiful woman inside and out, and highly intelligent. Unlike most of these commentators!","post_message":"Raven-Symone’s take on Michelle Obama-Planet Of The Apes incident left the cast of The View at a loss for words."},{"comment_id":"10152921328085950","commenter_b":"Wow, Janet Fix, your comment just proves how uninformed you are. Or are you just trying to be obnoxious?","commenter_a":"lol If its Michelle Obama I'm asking for two fives.","post_message":"Move over, Alexander Hamilton... A woman is about to replace you on the $10 bill."},{"comment_id":"10156197191420354","commenter_b":"A CULT that needs to be extinguished!","commenter_a":"Islam is NOT a religion of peace!!!!!","post_message":"The full statement is SCORCHING..."}]
