[{"comment_id":"10153419994402426","commenter_b":"Because it is one agency that makes money, not cost the tax payers to operate.","commenter_a":"Theyre smart. When people are snowed in, they drink.","post_message":"Is Virginia sending a mixed message?"},{"comment_id":"810172682363901","commenter_b":"Send the illegal aliens back","commenter_a":"Illegal immigration is an old problem, the native Americans used to call it 'White People'","post_message":"It's as simple as that!  www.headlinepolitics.com"},{"comment_id":"1384744278251983","commenter_b":"I blame Obama, Jackson, Sharpton, Pelosi ...................","commenter_a":"Maryliz T. Curtis","post_message":"'It's a kind of anti-black mood'"},{"comment_id":"10154356585776509","commenter_b":"The mass shooter in California, were not by Americans. They should establish a law that anyone who comes into this country looking for citizenship should established themselves as Americans ,have at least 2 year or more waiting period. Until they do an extensive background check","commenter_a":"When black people kill white people and rape white women you don't see no tears from Obama. When Muslims terrorize and kill people cut Christians heads off you don't see no tears from Obama","post_message":"President Barack Obama wipes away tears while speaking about victims of gun violence: 'Every time I think about those kids it gets me mad.' @webpagelink"},{"comment_id":"10153889126257144","commenter_b":"'@username stfu ass!","commenter_a":"Obama is going there to give a speech about how the truck manufacturers have flooded the market, so it is easier to buy a truck than it is to buy a book.","post_message":"This is awful."},{"comment_id":"10152917140236051","commenter_b":"Go to jail bitch","commenter_a":"I did that once,you could be messing with the wrong person... Call police!","post_message":"When a man saw how this woman was treating a 3-year-old, he knew he had to intervene."},{"comment_id":"10153011614414586","commenter_b":"Yes!!! Yaay! Way to go Peta!!!","commenter_a":"Amen","post_message":"KORA NEEDS A HOME!  #PETA fieldworkers found Kora tied outside 24/7 with little shelter or water. Her chain was so tight that it had become partially embedded in her skin. :( She is now in foster care & looking for her FOREVER HOME.  SHARE to help her find one: @webpagelink"}]
