[{"comment_id":"1202153396486746","commenter_b":"It takes 2 to tango","commenter_a":"That's not news! Thats standard procedure.","post_message":""},{"comment_id":"10154177327588984","commenter_b":"Don't want her anywhere near the White House.","commenter_a":"Lies more lies everytime she opens her corrupted mouth","post_message":"Hillary's campaign is once again doing damage control...  Is Hillary Clinton one of the last people you'd want to become president?"},{"comment_id":"10158211660050725","commenter_b":"Ignorance= a basic understanding in economics.","commenter_a":"All the crying liberals on this feed is enough to make me skip my coffee and still be content at work today.","post_message":"President-elect Donald Trump is poised to take his victory lap today, appearing first in Indiana to salute workers at a factory that he made a campaign promise to save and then in Ohio on the first stop of a \"Thank You Tour\" to honor the supporters in states that gave him his stunning victory."},{"comment_id":"1235443589809328","commenter_b":"With any luck they'll find a a way to kill that Russian lapdog Erdgoan. Kurds have a right to exist without fear of those Muslim camel f**kers the Turks. Turkey was helping ISIS, buying their oil, and should pay for it.","commenter_a":"Long live Erdogan (y)","post_message":"Turkish President Tayyip Erdogan accused the United States of supplying more weapons to Kurdish fighters in northern Syria this week, delivering two plane loads of arms to what Ankara says is a terrorist group."},{"comment_id":"10153329101624087","commenter_b":"Shut em down and bulldoze em!","commenter_a":"HAHAHAHAHAHHAHAHAHAHAH HE HAS 0% CHANCE TO WIN!! WORRY NOT NON- RACISTS!!!!!","post_message":"\"You're going to have to watch and study the mosques, because a lot of talk is going on at the mosques,\" Donald J. Trump said. \"I would hate to [shut down the mosques], but it's something that you're going to have to strongly consider because some of the ideas and some of the hatred, the absolute hatred, is coming from these areas.\""},{"comment_id":"10155589079690354","commenter_b":"both pigs","commenter_a":"Odd is right Tyranny lives","post_message":"Adorable...."},{"comment_id":"10153107012089474","commenter_b":"By opening her mouth, we can generate all the revenue we need from the gas coming out of her.","commenter_a":"Hey, you nut job, take Sen, Boxer's lead and just retire.","post_message":"Right when Americans are finally feeling some relief at the pump, Nancy Pelosi wants to take it away with higher gas taxes!"}]
