[{"comment_id":"933345140100891","commenter_b":"Linda Farrell, do you really think that the lying millionaire has a clue or even care about our struggles? Putting her in office gives 4 more years of Obama , open borders and 65,000 more refugees in our country! It's called NEW WORLD ORDER look it up! I'll take the skittles and America the way it was! And yes I am women TRUMP 2016","commenter_a":"Hell no","post_message":"Do you want to see the Trumps become America's next First Family?"},{"comment_id":"889054771211302","commenter_b":"It doesn't happen to muslim women because they are all fugly uckers..","commenter_a":"Go fuck yourselves, dune coon","post_message":"ClashDaily.com"},{"comment_id":"1121252964608432","commenter_b":"Shouldn't he be taking on Hillary??? Just another dumb ass between the choice of two dumb asses","commenter_a":"Acting just like hillary","post_message":"Politics."},{"comment_id":"956678911036116","commenter_b":"Trump is right ! All 11 million illegals have to go !","commenter_a":"Trump Chopper in Air Salad toss on a stick taint Fear God Trucker Hat -.......... high-ku Reverend #TrumpTrain #GOPClownCar #iacaucus","post_message":"\"They have to go.\""},{"comment_id":"10153821325285329","commenter_b":"Beth Carpenter","commenter_a":"Arthur Smith -- perhaps Tiona might be interested in this.","post_message":"He says he plans to read every last book. (via BuzzFeed Trending)"},{"comment_id":"999021020109368","commenter_b":"This is legislature that should ONLY be debated and decided BY WOMEN!!","commenter_a":"mayam merouane ok @username","post_message":"What a brave woman"},{"comment_id":"839844146064134","commenter_b":"Women want it all, money,, looks, and a man who does everything right?, that has made me want all the same from a woman, sO far no luck, it's not a hero juzca person who shows love everyday, in everyway and a REAL woman not a Queen to appreciate it!","commenter_a":"If only we were all blessed with that. He's a hero plus a husband who gets it!!","post_message":"SO SWEET! The way to a man's heart may be his stomach, but one devoted husband has proven that women's love can come from a man who can"}]
