[{"comment_id":"978190742237455","commenter_b":"Hillary will win in 2016!","commenter_a":"Hillary 2016!","post_message":"“I should have used two accounts—one for personal, one for work related emails. That was a mistake, I’m sorry about that, I take responsibility, and I’m trying to be as transparent as I possibly can.” -Hillary on ABC World News Tonight with David Muir"},{"comment_id":"10153322835227994","commenter_b":"Sounds like something fishy. The devils monster wouldn't kill my kids before me.","commenter_a":"Don't strollers have brakes on the back I don't know this story is impossible to believe","post_message":"So sad. Her 18-month-old twins were killed."},{"comment_id":"1060964983967782","commenter_b":"I am a woman and I think your ugly Megan","commenter_a":"I think the evidence clearly shows she was moved away. Not beaten or mauled just moved away. Seems like a job hazard to me.","post_message":"\"This is the Trump campaign, where lies are told and then lies are told to cover up the lies, and then finally new lies are told in order to cover up the lies that were told about the lies,\" Ben Shapiro said."},{"comment_id":"1094565510598452","commenter_b":"This is what should happen to Debbie Wasserman Schultz - #PutThatWassholeInPrison","commenter_a":"More like its time for you to take what's yours. Go out on stage and be prepared to accept the nomination please. I hope you pull an FDR. I can't bear to see Clinton win after what wikileaks showed.","post_message":"In the State of New York 3 million Independent voters could not participate in the Democratic nominee. It's time for open primaries."},{"comment_id":"403409623179979","commenter_b":"And Hillary with Bill and Chelsia in tow is better. Maybe the icing looks better, but the cake is just as bad and tastes like crap.","commenter_a":"Do you ever wonder which one of the 14 GOP wannabes will get the nod. \"Please forget I'm a Bush, Bush; Mr. Personality Egomaniac Trump; etc. . Fourteen is a long list. I can't keep track. . .","post_message":"\"The crankiness of Scalia's insults run inverse to his intellectual consistency.\" Jon Stewart"},{"comment_id":"10152988203790861","commenter_b":"You act like kids don't figure stuff out.","commenter_a":"I can just see a kid planning it out to steal the gun and shoot up the classroom.","post_message":"A Texas school district wants to allow teachers to carry guns in the classroom. Tell us what you think about arming teachers."},{"comment_id":"818332488251250","commenter_b":"American exceptionalism...we can be batshit crazy and justify it with religious idiocy. We're special :)","commenter_a":"Have we gone completely nuts or completely American/Christian Taliban?","post_message":"Six states currently permit pharmacists to refuse prescribed contraception medication to a woman based on personal and/or religious beliefs."}]
