[{"comment_id":"10154378006503352","commenter_b":"What is a thot?","commenter_a":"Why do they have to call her a thot??? Ridiculous article","post_message":"New photos of Amber Rose Doing Naked Sunbathing Indicate She Might Have Been Wearing Booty Pads All Along – Her Behind Disappeared! (PHOTOS)"},{"comment_id":"10153222967261378","commenter_b":"Time for her to be shot in the face.","commenter_a":"Time for her to be released from her position.","post_message":"READY FOR MORE JAIL: Back at work and continuing to refuse same-sex marriage licenses, Kentucky clerk Kim Davis said she'll go back to jail again if that's what it comes to. Watch her tearful interview..."},{"comment_id":"1324741860927476","commenter_b":"You need to stop getting your news from the crazy woman on the View!","commenter_a":"No terrorists came out of the 7 countries he banned why doesn't he ban Saudi Arabia where most 911 terrorists were from. Also Egypt and two other countries. Neither was the ban about illegals people with valid visas and green cards were also detained, even the ex prime minister of Norway traveling on a diplomatic passport was detained for questioning..I support Washington states action. The president is not above the LAW .","post_message":"'We're not going to allow anyone in Washington, D.C. to trample on our rights as Washingtonians, President or otherwise.' Gov. Jay Inlsee reacts to the judge's ruling to temporarily block President Trump's travel ban. READ MORE >> @webpagelink"},{"comment_id":"884237154958166","commenter_b":"I would rather help pay his court fees than support all the illegals obummer opened the door for.","commenter_a":"Once Joe is gone the new one will see what it is costing the county and shut it down. The court problems Joe is going through now is just the beginning of his downfall.","post_message":"SOUND OFF: Tent City Jail turns 22 years old, and some people think it is time for Sheriff Joe to shut it down. Let us know what you think, then tune in to FOX 10 Arizona Morning and we will use some of your comments on the air."},{"comment_id":"686756008181644","commenter_b":"Yes she is a Scumbag!!","commenter_a":"Yes she is","post_message":"The father of a victim from Benghazi calls Hillary A 'Scumbag' We send our condolences for his loss.  Do you think Hillary Clinton is a scumbag?"},{"comment_id":"992775434136459","commenter_b":"That is all these losers have.","commenter_a":"Screw that ignorant pido, GO TRUMP GO","post_message":"Here are the 6 TWEETS..."},{"comment_id":"10153561445142093","commenter_b":"Really lady? Liberals and Muslims want to rewrite history? @webpagelink","commenter_a":"There are already people who say the holocaust didn't happen. With today's trend of re-writing history for political correctness, it may disappear in the next 50 years!","post_message":"A WW II vet was reunited with a Holocaust survivor who he helped liberate and the incredible moment was caught on camera...@webpagelink"}]
