[{"comment_id":"1488583267837295","commenter_b":"Are there ANY sane, normal, decent and honest people who want to do this job?","commenter_a":"He's angling for the Sec State slot if Trump gets elected.","post_message":"Most people don't really struggle with this question."},{"comment_id":"1015166015171076","commenter_b":"What I find so hilarious, is the amount of girls that are being tagged for this post!!! I LOVE IT!!!!! Squirt on ladies, squirt on!!","commenter_a":"I knew that shit was urine !!!! 😂😂😂😂😂😂","post_message":"Sorry folks."},{"comment_id":"10152889547313299","commenter_b":"I thought I could not dislike this so called woman any more than I do, but, taking a disabled parking spot is outrageous!!! Did she get a fine? Everyone else would have. Do you really want to see this self-centered, rule breaking murderer as president???","commenter_a":"Hilliary is entitled to be queen and all the common people are her court. she can be charming but she's Danger with a capital Dl . she is deceptive with a capital D and isn't that strange Democrats. Is a capital D too","post_message":"Hillary Parks in Handicap Spot ... @webpagelink"},{"comment_id":"1272820716123006","commenter_b":"Women like you make me so embarrassed for my gender! The same that screwed America with Obamacare. Truly disgusting","commenter_a":"There is a clear path of the Democratic Party to take the presidency, the house and the senate... This is the core issue why the FBI director was pressured to make the announcement... #Ihaveherback Grab them by the polls vote blue","post_message":"JUST IN: Federal investigators looking into Hillary Clinton email matter have obtained the warrant needed to start reviewing emails found on laptop used by Anthony Weiner and Huma Abedin."},{"comment_id":"898217656867757","commenter_b":"That dress >>>>>","commenter_a":"She looks absolutely stunning~","post_message":"And finally Miss Viola Davis! #HTGAWM #Oscars"},{"comment_id":"981651015256776","commenter_b":"Lol because people and companies don't donate cars and trucks for tax write offs","commenter_a":"God forbid American tax payer money goes towards improving lower and middle class families or stuff that actually benefits us, but check out the sweet new cars dps get to drive!","post_message":"Next time you pass a red Dodge Challenge or Yellow Ford Mustang GT, you might want to check your speed. DPS troopers now have two new unmarked vehicles for traffic enforcement."},{"comment_id":"899421576802371","commenter_b":"Stupid BITCH !!!","commenter_a":"Why don't you release your vitriolic hatered towards the real enemies the Muslims, the Obama administration, Hillary Clinton, the democrats, black lives matter and other groups like that and anyone on the left that thinks like you. Unfortunately the rest of us don't have the money to buy protection so we have to protect ourselves. There is not enough police to protect everyone. I use to like you but I don't anymore.","post_message":"Actress Rose McGowan Unloads Hate-Filled Rant Over Muslim Murderers Syed Rezwan Farook and Tashfeen Malik. Her target: American gun owners and Republicans.    Sorry, Rose, but we poor, regular folks can't afford ARMED bodyguards and a million dollar house like you and your Rich Hollywood Liberal pals.  #elitist #1Percenter"}]
