[{"comment_id":"1300544240024109","commenter_b":"She'll be kissing a whole lot of ass in jail","commenter_a":"The bitch lost - America knows she is a lying bitch now she has to kiss his ass to try to keep her out of jail","post_message":"It's over."},{"comment_id":"1760085394239423","commenter_b":"Is there anything we can actually wear without people and animals being exploited ???","commenter_a":"LETS CONTINUE SPREADING THIS PLEASE!!! IS OUR RESPONSABILITY TO STOP IT!","post_message":"BREAKING VICTORY! UNITED COLORS OF BENETTON announced they will BAN ANGORA after just 24 HOURS into #PETA campaign: @webpagelink THIS is why you should care."},{"comment_id":"886212474747508","commenter_b":"she is a trashy shank","commenter_a":"This guy rips her a new one. Good for you.","post_message":"Michelle Obama has no class, and he sets the record straight!"},{"comment_id":"988010784567676","commenter_b":"If they dislike our ways so much ,WHY HAVE THEY COME TO THE USA? We all should be telling them to go back to the country they came from.","commenter_a":"Death to Islam. Ban Islam in the USA","post_message":"BOOM!"},{"comment_id":"10155741989330192","commenter_b":"There are many democrats who share many of conservertive ideas.like ideas about gays ,abortions,veterans rights,the militery.","commenter_a":"They are called libtards for a reason... Those that oppose legal hunting are just bad shots.","post_message":"A group of conservationists is urging Gov. Rick Scott to cancel the bear hunt that is set to take place this fall."},{"comment_id":"735565289967382","commenter_b":"Dear God, kick this ignorant African so hard he gets back to Africa. He needs English as a second language. Also needs to be taught to not make threats. What a POS. Go back to where you came from.","commenter_a":"This guy is a fanatic. He'd better be stop or someone s going to get Bharat namely, him","post_message":"Knife wielding Muslim attacks Trump, but watched what happens next. I bet he never expected this. Let's show him our support. Can we get 30,000 'LIKES' Donald Trump?"},{"comment_id":"10154078774989877","commenter_b":"Besides reproduction and parts which aren't anyone's business, nothing in these comments state what makes a woman a woman.","commenter_a":"We should all be okay with this. Two words: Fairness and equality.","post_message":"Spelman College to consider admitting transgender women Grio fam, is it time HBCU's updated their views on gender identity? Sound off below!"}]
