[{"comment_id":"615120388649797","commenter_b":"I don't think it should be considered treason, I think it IS treason. How do you Snopes check this? And where is the link to the Washington Post article?","commenter_a":"Guys we have no choice. They are so advanced we have no choice","post_message":"This should be considered treason."},{"comment_id":"872917539471166","commenter_b":"Ohh @username shutup you miserable heifer","commenter_a":"This doesn't surprise me at all - and she looks great doing it !!!!","post_message":"Don't believe us just watch!"},{"comment_id":"961148523904901","commenter_b":"Every female I pursued that said \"No, I am not interested in more than being friends\" at some point had sexual relations with me and enjoyed it after I kept pursuing her in ways she WAS responsive to! some women want gifts and loads of flattery before they say. When they dont want to be friends, I stop pursuing them, until then its their choice to hang or not. The only clause is when they ended up being lesbian women!","commenter_a":"No means No! Some people don't get it. If someone is not interested in you move on.","post_message":"After a 14-year-old girl told her mom that a boy was aggressively pursuing her at school, her mom, a clinical sexologist and video blogger, decided to post a video to the boy on YouTube. >>@webpagelink"},{"comment_id":"961657090560706","commenter_b":"Ugly woman!","commenter_a":"I am sorry but on this point I do agree with her,but I do not agree with the fact she is on 20k a year,","post_message":"Benefits mum does not understand why we send money to Africa"},{"comment_id":"10154097033159117","commenter_b":"If you want to save money, deport Native-Born citizens. The immigrants cost less. @webpagelink","commenter_a":"our country is broke--go live somewhere else.","post_message":"\"So long as people are coming here to live peacefully and work peacefully, I think the government should have to show to us why they shouldn't be here.\" For the full video, go here: goo.gl/8DSL14"},{"comment_id":"903907673040205","commenter_b":"Just leave NOW you RACIST!! Forget Trump!","commenter_a":"leave now","post_message":"If it comes down to Trump and Hillary... Here's a BIG reason to vote for Trump. Take our poll! @webpagelink"},{"comment_id":"10150603929279999","commenter_b":"Aren't they real women? What's a real woman, and who doesn't qualify ?","commenter_a":"Perhaps a more diverse group by race, ethnicity and cultural but alarmingly the same re: the skinny, young and sullen look of mannequins rather than real women...","post_message":"Meet the woman behind the unconventional beauty of today's most successful models."}]
