[{"comment_id":"602134433280545","commenter_b":"Nina act like she fucking BERNIE GO HILLARY CLINTON FOR PRESIDENT OF UNITED STATES","commenter_a":"She just wanted to play Ted Cruz nobody needed that. Those that supported Bernie have to move forward and help defray trump this is what he's asking them to do. Let us not be divided and loose to trump.","post_message":"Bernie Sanders’ supporters say they are being severely mistreated at the DNC."},{"comment_id":"10154211946341523","commenter_b":"@username shut the hell up. U bitch","commenter_a":"I smell bullshit. Somebody lying","post_message":"“The mother says that in the moments before the crash, the bus driver said something to the effect of ‘Are you all ready to die?’  Seconds later, the bus was on its side and five kids were killed.\""},{"comment_id":"10154026224212869","commenter_b":"I agree! There are plenty of legitimate issues that should convince anyone paying attention that Clinton does not belong in the White House. I feel like spinning 100 different (and in many cases overwhelmingly mean spirited) conspiracy theories makes the relevant confirmed issues on either side carry a lot less weight. I'm not saying that I don't think her health may be an issue, or even that it shouldn't even be written about, but there are 100 different reasons for a vehicle like that to include a wheelchair lift.","commenter_a":"Is anyone else tired of these feeding frenzies, I for one am.","post_message":""},{"comment_id":"453308998193014","commenter_b":"She's in AMERICA and that gives her the right to display the flag. Leave it up !!!","commenter_a":"Yes","post_message":"Do You Support This Woman's Refusal To Remove Her Flag?  Comment 'yes' or 'no'."},{"comment_id":"10153694851768352","commenter_b":"A black woman wouldn't marry him because she doesn't want ugly kids! With his Ugly self....","commenter_a":"Trust me we won't! LOL ha ha ha #ugly","post_message":"‘I’m not a racist – but I wouldn’t marry a black woman, I want my children to look like me,’ says ‘white supremacist’ accused of inspiring Dylann Roof’s murder spree"},{"comment_id":"1150014791717682","commenter_b":"Can we class-action sue her for discrimination, like the gays do when you won't bake them a cake? And why not? What's the difference?","commenter_a":"Another idiot committing corporate suicide!","post_message":"Maine Restaurant Owner Bans Owners and Supporters of AR-15 From Restaurant"},{"comment_id":"930066893697318","commenter_b":"Screw Jeb Bush, just because he married a foreigner doesn't make it right for our borders to be infiltrated by illegals looking to live off of our hard earned dollars that we worked for all our lives. Vote for Donald Trump for President and he will end this and make our country strong and proud again.","commenter_a":"He needs to get in bed with the Democrats!! He's not a Republican","post_message":"\"Trump is wrong on this.”"}]
