[{"comment_id":"10153922019898812","commenter_b":"Anyone but Hillary!!","commenter_a":"The only thing I fear is a Republican getting elected in 2016","post_message":"President Barack Obama: \"We cannot and we will not succumb to fear.\" @webpagelink"},{"comment_id":"10154348215444609","commenter_b":"You only want your daughter to learn to suck dick?","commenter_a":"This is very wrong. If someone like same sex that's cool jus don't teach my child about it!!!!","post_message":"In case you missed it: Read about these newly approved changes in classroom instruction, put in place to comply with the nation's first law requiring public schools to include prominent gay people and LGBT rights milestones in history classes."},{"comment_id":"10154291489851130","commenter_b":"*woman","commenter_a":"I am a women and I agree with pence!","post_message":""},{"comment_id":"10153782447389094","commenter_b":"Ppl are making it one. So just fix it where only one person can use the restroom by themselves.","commenter_a":"Just make all businesses have two restrooms with one stall. And a lock on each door. Problem solved","post_message":"The states allege the government action has “no basis in law.”"},{"comment_id":"1067971246620705","commenter_b":"This is not a college campus, and she already dropped out of college. Go look, shiney object over there ...","commenter_a":"The media should be reporting on the despicable Republican Platform. #shameful","post_message":"The speechwriters who wrote the original speech are among the best, and weren't going to have their good name besmirched by Trump ..."},{"comment_id":"10153643721675399","commenter_b":"Couldna said it better! <3","commenter_a":"Well, Clinton IS the least batshit crazy Republican running...","post_message":"He also called Trump a \"narcissistic BULLYionaire\""},{"comment_id":"10154073349643132","commenter_b":"Piss off you twit and merry Christmas","commenter_a":"Why would you congratulate someone who goes out of their way to shame woman for pre-marital sex yet does it herself?","post_message":"Congratulations are in order for new mama Bristol Palin!"}]
