[{"comment_id":"696122653842743","commenter_b":"They will catch these 2 cowards soon. Police Force do maximum.","commenter_a":"Going Back to origin country, muslim are not belong to europe, they are many coming politecal, assylum in germany, they should send bact to origen country , there muslim,","post_message":"Report: Two armed suspects in Paris shooting located in northern France"},{"comment_id":"464688210388426","commenter_b":"Well yeah, I too would rather YOU be MORBIDLY OBESE and therefore die early........mental midgets like you guys just should NOT reproduce !","commenter_a":"Different if had medical problems, just being lazy isn't one","post_message":"Should This Family Be Taken Off Welfare? Comment 'yes' or 'no'."},{"comment_id":"853169931483995","commenter_b":"The article isnt dissing Melania, it's reflecting on a direct quote where Trump said giving Ivanna control of a business property was the end of his marriage, and he learned he didn't want a wife who was ambitious, who worked, because that meant she didn't focus 100% on him. Which is sexist af. But he wants his daughter to be an Ivanna, so ... also hypocritical. Should women be successful in business or not, according to Trump? Are successful woman attractive to men like Trump. Read the article, it's not made up.","commenter_a":"Such an interesting article Christine Johnson!!! I find it all fascinating, will be so interesting to be around in Nov - when the country decides! Hope to see u tomorrow? Ax","post_message":"The Trump family embodies a very old sexist hypocrisy: men who want one thing for their wives and another for their children. Read in The New York Times Opinion Section."},{"comment_id":"10153235408755090","commenter_b":"Can anyone tell me why Hillary wants to be President?","commenter_a":"Another \"heir apparent \" to the presidency.","post_message":"One question: Why don't you want Hillary Clinton to be president? Tell us here: @webpagelink"},{"comment_id":"1666670816943719","commenter_b":"Let's help protect the interns at the White House! Keep the Clinton's out!","commenter_a":"I can NO LONGER DRINK TRUMP'S POISON. Stupid me. Anyway, Donald, you are SATAN.","post_message":"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!"},{"comment_id":"10152547170886636","commenter_b":"@username. ..rode hard...and put away wet..too bad she didn't stay away wet","commenter_a":"This is a stupid law. If it gets passed. For the reasons you idiot liberals think. It is only a crime if you are wearing it in the commission of a crime. Think about that for a moment. If they charge you with a felony. They will add on a misdemeanor for wearing a hoodie. And then run it all together. So basically it's a nothing law","post_message":"Wearing your hoodie in public could soon be illegal in the state of Oklahoma"},{"comment_id":"1234345436618217","commenter_b":"They had a class on how to not rape women? Send the raping muslims home","commenter_a":"Stupid girl, wait until it happens to her or someone close to her, then she will change her tune.","post_message":"Watch as Red Cross spokeswoman cautions that this is just an isolated incident involving a teen who just didn't know any better...."}]
