[{"comment_id":"10154274085621756","commenter_b":"Ok ok all color aside its true that all girls are trouble makers!!","commenter_a":"It's not race, but class. If two parents have to work, there's less support for childhood development. Every problem we have stems from a lack of appropriated resources while a fat cat sits happy.","post_message":"Black girls are punished at school at rates that are even more disproportionate than those experienced by black boys."},{"comment_id":"963331227036554","commenter_b":"So could Samsung actually be catching up?","commenter_a":"Eh...not really impressed enough to upgrade from the 6. I'll wait till the 7!","post_message":"Our first look at Apple's new iPhones:"},{"comment_id":"1805658249719321","commenter_b":"Me muero!!!","commenter_a":"@username tu sueno","post_message":"Watch 23 adorable pandas make their public debut. @webpagelink"},{"comment_id":"1214214798614861","commenter_b":"From Chris (Author of this article) he mentioned \"dangerous batteries\". Well what did you know the whole world is putting blames on a company instead of the provider. Talented consumers indeed. Personally the problem probably lies with the performance output and the batteries supplying the phone. Note 7 is a heavy powerhorse so... overexerting the battery could damage it.","commenter_a":"This is worst than the BlackBerry disaster.","post_message":"BREAKING: Samsung ends production of the Galaxy Note 7."},{"comment_id":"10154713029439411","commenter_b":"Good on her. If only she had a shot gun or military rifle she may have got the others too.","commenter_a":"Looks good on him and them. These three losers garner no sympathy from me. Karma has been served.","post_message":"They picked the wrong house"},{"comment_id":"483277565194949","commenter_b":"Jesus wouldnt like that she kills babies for a living.","commenter_a":"So sorry you folks are tearing this young woman apart, would Jesus do this?","post_message":"What'd you think, folks?"},{"comment_id":"10154392424871130","commenter_b":"She has always been irrelevant!","commenter_a":"She is a Kellyanne wannabe. Open mouth, speak without thinking, non-stop, digressing, interrupting and not letting anyone else start or finish a thought. Hopefully very soon all of these people will be irrelevant.","post_message":"Mazel tov for (unintentionally) making us laugh before the election."}]
