[{"comment_id":"10153111641514138","commenter_b":"Bitchassniggas","commenter_a":"I'm glad they stopped him because he would go there get training and come back!! We already have had too many of them do that there's a lot that get caught that we don't know about.","post_message":"Arrested at Minneapolis-St. Paul International Airport with a one-way ticket to Somalia + a fake passport"},{"comment_id":"1420083668051377","commenter_b":"Oh shes a female.. whoops","commenter_a":"Muslims r like a football team. The radicals /terrorist r the strikers. The extremists r the midfielders who feed the radicals. The defenders r the moderate Muslims who create diversions, deflect, defend and save Islam from legitimate criticisms n any accusations. They work as a team though they create the perception that the defenders have nothing to do with the strikers. The Liberals r the goalies who jump in when the situation gets worse with statements like Islam is a religion of peace @ De Joe Int'l ur comment had to be repeated.","post_message":"'We march through the night to cut and behead... Allahu Akbar'"},{"comment_id":"10156393524070389","commenter_b":"Isis , of course,climate change is a myth! It gives obama something to talk about beside the real problem, his muslim brothers.","commenter_a":"Odummy is the Threat!!!!!!!!!!","post_message":"Question of the Day: Which do you think is a bigger threat: Climate change or ISIS?"},{"comment_id":"10154945952871037","commenter_b":"Wow, I honestly thought I was the only one.😢","commenter_a":"I was diagnosed with PTSD after being sexually assaulted as well. It disgusts me that so many people dismiss it as someone playing the victim card or seeking attention. Believe me, no one wants PTSD or to be sexually assaulted.","post_message":""},{"comment_id":"641541669369745","commenter_b":"She is a ass. Get her shit and get out","commenter_a":"Go back to where ever the hell you came from then you spoiled bitch. I'll pitch in on a plane ticket!","post_message":"This spoiled brat got exactly what she deserved. If you don't like our country you can leave. Do you agree this is karma?"},{"comment_id":"10154655136218984","commenter_b":"Makes you wonder why she's riding in a van! Not very comfortable and certainly not presidential.","commenter_a":"Not a Hillary fan but have you ever tried getting out of one of those van back seats?","post_message":"There's some new footage of Hillary Clinton making the rounds, and it's exactly what her campaign does NOT want America to see. Here's what happened to Hillary when she tried to get out of a van. This confirms a lot of things that we'd feared about the Democrat nominee..."},{"comment_id":"10155065586189657","commenter_b":"She is garbage","commenter_a":"Gun owners - mentally disturbed. A man dressing up like a woman - \" Normal \" This is leftism.","post_message":"This wasn't a mistake, this was done on purpose."}]
