[{"comment_id":"10154031292643132","commenter_b":"She still looks like a dude","commenter_a":"Good for her! She took care of herself, had a HEALTHY weight gain, and gets to enjoy the results.","post_message":"It's hard to believe this is just after ONE week!"},{"comment_id":"981019435266811","commenter_b":"she is an Idiot hussy","commenter_a":"That doesn't surprise me!","post_message":"This is SHOCKING!"},{"comment_id":"1697203373859671","commenter_b":"All dems want is their vote!","commenter_a":"YES. Now Nutsy Pelosi wants to have more programs to 'prop up' immigrants. How doing something for Americans for a change?","post_message":"Are you ready? It only makes sense!"},{"comment_id":"10153101086445736","commenter_b":"a burnt pussy lips","commenter_a":"Shannon Linda Harman","post_message":"Thanks to some 'Sound Prosthetics' Honey and Badger are on a roll."},{"comment_id":"10153673793456336","commenter_b":"Please don't find your way to StL!","commenter_a":"That is great, she prolly is afraid of going to prison!! She is about as racists as they come, she showed her true colors!!","post_message":"Breaking News: Baltimore Mayor Stephanie Rawlings-Blake announced Friday that she will not seek re-election.  @webpagelink"},{"comment_id":"10152999247891037","commenter_b":"Women dont fight wars....","commenter_a":"If a woman has a bright future she has an option to abort the baby, men don't. Give Men equal rights!!!","post_message":"A new report out today from the Guttmacher Institute shows that 57% of women now live in a state considered to be hostile or extremely hostile to #abortion rights."},{"comment_id":"10154601814298812","commenter_b":"Beaver girl you are the lowest BS, send you to middle east good luck, Israel girls know how to fight, and the Frenchie girls know how to fight, you know like the French under ground","commenter_a":"Maybe they could present plans to 'Make America Great/Safe/White/America again' Instead of hosting the 'We hate Hillary' show. They really do just pander do the lowest common denominator.","post_message":"So far, speakers have mentioned Hillary Clinton an average of just over six times in evening speeches at the GOP Convention."}]
