[{"comment_id":"10153931656668812","commenter_b":"This is way out of context y'all all sound ignorant specially the one starting this comment","commenter_a":"Waiting to see who blames Obama or immigrants....","post_message":"Long Island town demolishes U.S. Navy veteran's home while he was in Florida recovering from a knee replacement: @webpagelink"},{"comment_id":"10152557601575950","commenter_b":"Well they can't come back and tell the others that there are no virgins","commenter_a":"French terrorist ? I never heard viva la France during a plane hijacking and if I hear Allah Akbar I'm knocking that son of a bitch out","post_message":"There is evidence the three dead suspects -- brothers Said and Cherif Kouachi and grocery store gunman Amedy Coulibaly -- knew each other and shared common ties with known terrorists."},{"comment_id":"10153536976196336","commenter_b":"Talk to Moon beam aka governor Brown of California. It is in San Francisco that an illegal alien killed a beautiful person. He encourages sanctuary cities for illegal immigrants and lets them get drivers licenses and so with liberals it's take from the people who work and pay taxes and let them pay for all the illegals. I don't want to give my hard earned money to whatever the state chooses to spend it on but liberals will continue until they are ousted. And that goes for Republicans as well. No one in either party deserves to hold office if 'our' welfare doesn't come first. And I don't mean welfare as in free stuff.","commenter_a":"what...how can any illegal alien hold a government position? Oh yeah...California the land of goofballs.","post_message":"'This is worse than sanctuary cities. Now we're giving them sanctuary boards.' – Neil Cavuto"},{"comment_id":"1374717489237646","commenter_b":"Deport all Mexicans","commenter_a":"Alot of snowflakes on here. Trump!!!!!","post_message":"LIVE NOW: Donald Trump speaks at a 'Thank You Tour' rally in Mobile, Alabama."},{"comment_id":"1066102216758740","commenter_b":"DON'T choose Hillary!! Jump aboard the TRUMP TRAIN 2016! He will work for America!!!","commenter_a":"Why should we choose Hillary ???? Bill didn't he choose every other women BUT Hillary","post_message":"'She's a natural leader, she's a good organizer, and she's the best darn change-maker I ever met in my entire life.'  President Bill Clinton said Hillary Clinton is 'worth every single year she's put into making people's lives better.'"},{"comment_id":"1203426363052812","commenter_b":"'@username AND SHE WANTS TO BRING THOUSANDS MORE INTO THIS COUNTRY' WAKE UP PEOPLE","commenter_a":"The cop should have called for backup and arrested the whole lot of them for inciting a riot. They should have been told it was none of their business what the woman was wearing. If they can't live by the laws of the countries they are in, they should be sent back home where their laws are enforced.","post_message":"WATCH This Muslim Scumbag Harass Women or Wearing Jeans Deemed too Tight By Islamic Standard! Then The POLICE Show up and teach him a lesson on Freedom! (VIDEO)  This is the problem with islam, they believe EVERYONE is subject to their bullsh*t!"},{"comment_id":"750259701739305","commenter_b":"Until the GOOD cops police OUT theBAD COPS, these arrogant ignorant asshats will continue to terrorize our citizens. NO EXCUSE!!","commenter_a":"I wish he'd get fired!!!!!","post_message":"His tirade was caught on tape."}]
