[{"comment_id":"944665885579479","commenter_b":"There is something seriously wrong with this monster. Send him straight to the chair!","commenter_a":"the devil lives here","post_message":"#CharlestonShooting suspect #DylannRoof has arrived in Charleston, SC. Authorities released this new mugshot. @webpagelink"},{"comment_id":"1832240316996227","commenter_b":"Since you took the time to report this, why not put the effort to fix it? or educate us how to prevent this? Or are you one of those assholes that like to stir up nonsense to get recognitions?","commenter_a":"When I was young I vowed to kill all the bees. I see my plan is working.","post_message":"Do NOT scroll past this!! ✋✋ Source → @webpagelink #WakeUpCall | #SaveTheBees Join Us: The Free Thought Project"},{"comment_id":"720102644820493","commenter_b":"Niggaz","commenter_a":"Stupid ass liberal niggas..","post_message":"\"All White People Are Racist.\""},{"comment_id":"10153013739666336","commenter_b":"Those Iranians Wouldn't Be Dumb Enough To Fire Pop Shots At Our Ships!, That WOULD Be A GRAVE MISTAKE!,","commenter_a":"Haha good luck!!","post_message":"VIDEO: Iranian state TV showed footage of Iran’s Revolutionary Guard conducting a drill that struck a mock U.S. aircraft carrier with missiles. @webpagelink"},{"comment_id":"10152987263776130","commenter_b":"@axelnieto and @hugoaguilar. I never said people in Latin American countries aren't happy. I also never said that there is absolute no wealth or opportunity. I agree with you that it's not easy (which is what I was trying to make a point of to begin with) but it is there.","commenter_a":"They don't make work, wealth, and success important because their country doesn't give them the opportunity for that. Duh huffington post.","post_message":"\"Instead of making work, success and wealth the most important things in life, Latin Americans typically have family and community firmly at the top of their priority list.\""},{"comment_id":"1175706475803156","commenter_b":"But women shouldn't be able to get birth control or abortions...","commenter_a":"Now thats the Paul Ryan I know.","post_message":"WOW."},{"comment_id":"643301722461533","commenter_b":"Does the American flag represent millions of people that have done nothing wrong and try to survive under a fucked up government? Or does it represent something else? See, that's the beauty of this flag. It holds different values for different people. You don't value yourself, others, anything? You more then likely will despise what I say and verbally attack me.You blindly support atrocities committed by our shit-for-brains leaders, you'll probably verbally attempt to attack me. My point remains clear, for those with a mind to think for themselves.","commenter_a":"Just for shits and giggles. I want to see the love we all profess for one another.","post_message":"This is epic."}]
