[{"comment_id":"1854344181462778","commenter_b":"Trump!!! Build that wall!!!","commenter_a":"This time they'll just say \"we need to stop this black on black crime\"","post_message":"WARNING: This video is graphic and may be upsetting to some viewers. @webpagelink Officials released surveillance footage showing a violent takedown by an officer on a train platform in Houston. The officer resigned and authorities said the investigation was still ongoing."},{"comment_id":"590256634486210","commenter_b":"Haha america was never great and with you or Hilary as our president it will continue to never be great !","commenter_a":" Vote strong Vote Trump","post_message":"This is only the beginning. Hillary is CROOKED! She is not capable of making America great again. Sadly, she would do the opposite."},{"comment_id":"10153657606683984","commenter_b":"Bitch--boycott her--hurt her where it counts","commenter_a":"\"Big Mike\" is 200 lbs (after autopsy) of year old worm food. Nothing more no matter how many highways you block.","post_message":"This was probably NOT the outcome Beyonce was expecting when she shared this..."},{"comment_id":"1029601670427380","commenter_b":"Waiting for Drumpf to deport his first and third wife. Apparently jobs aren't the only thing he likes to outsource.","commenter_a":"Kurt Schultz think you may enjoy. Just saying. Miss you, partner","post_message":"Trevor unpacks Donald Trump's response to the mass shooting in Orlando. @webpagelink"},{"comment_id":"10154003076373812","commenter_b":"Actually women STFU if you can't take the heat dont attack....he has just as much right as her","commenter_a":"When it comes to women, Donald should just STFU.","post_message":"Donald Trump ramps up his attacks against Hillary Clinton and former Pres. Bill Clinton: \"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!\""},{"comment_id":"1093108914084558","commenter_b":"exterminate the cockroaches!!!!!!!!!!!!!!!!","commenter_a":"Muslims are a cancer.","post_message":"Top U.S. Commander In Europe: ISIS is Like Cancer Among Refugees @webpagelink"},{"comment_id":"10153731024366130","commenter_b":"Lmfao girl","commenter_a":"Camellia","post_message":"Contributor Laura A. Jacobs, on Caitlyn Jenner: \"Your visibility has gone from mildly annoying, to problematic, to atrocious, to outright detrimental, and so I ask you, politely: Stop trying to help though the media and public appearances. Please. Stop...\""}]
