[{"comment_id":"1551588725149374","commenter_b":"Rest in the arms of Jesus little man. The world is praying for your family.","commenter_a":"you are in my prayers little angel. So are your mommy and daddy.","post_message":"Our hearts go out to the family of 2-year-old Nebraskan boy, Lane Graves."},{"comment_id":"689624227852673","commenter_b":"They're not ladies either but you don't have a problem with that.","commenter_a":"I agree with British spelling (and actually use it here in the states) except on two accounts- Aluminium and Ladybirds. That's crazy, they're bugs. Ladybugs. They're not birds. Birds eat them. XD","post_message":"The last weekend of October sees ladybirds swarm public spaces, people's homes and ex-footballers."},{"comment_id":"915633041826559","commenter_b":"Nah she just pays for herself. Greedy money grabbing witch.","commenter_a":"And so............she pays her female staff less thrn her male staff. GOOD job hillary","post_message":"Equal pay isn't a women’s issue. It's a family issue. It's an American economic issue."},{"comment_id":"559259350942537","commenter_b":"Lord,bless this precious child, hold this family in your loving arms. In the name of Jesus. Amen","commenter_a":"Sad, she is a pretty young lady! Prayers for Hannah and her family!","post_message":"\"We have all been waiting and praying for a miracle,\" a post on the Facebook page 'Prayers for Hannah Katherine' said. \"We are now waiting for her to join the angels in heaven.\""},{"comment_id":"10152740103222507","commenter_b":"Have female genitals, potential prostitute","commenter_a":"Carry a gun....potential murderer. You won't be laughing when you child or grandchild gets killed","post_message":"Disturbed thinking."},{"comment_id":"10153451111339087","commenter_b":"@username, Keep telling yourself that!! She doent have a chance, get over it already, find yourself a job!! Killary for PRISON!!!","commenter_a":"Screw Hillary and Bill, they are criminals and I don't like either of them!","post_message":"“Hillary Clinton is my candidate for President of the United States. She is best positioned to continue the progress made by President Obama on a range of issues -- from strengthening our economy to making the right investments in our infrastructure to common-sense gun safety laws to ensuring a fair criminal justice system,” Transportation Secretary Anthony Foxx said."},{"comment_id":"1004293156333603","commenter_b":"Truth hurts if ou weren't an illegal you wouldn't have taken offense.","commenter_a":"Keep them out the US we have enough problems with illegals already. Deadbeats sucking the economy dry","post_message":"This year, nearly 200,000 people have landed on Greek shores, another 110,000 have arrived by sea to Italy and more than 120,000 by land to Hungary. Germany has just announced that it expects to receive 800,000 asylum applications in 2015."}]
