[{"comment_id":"10152880521321051","commenter_b":"What did this person drink in her baby bottle??","commenter_a":"I would trip if my kids rode with strangers even if they were cops. I don't trust anyone with my children. You can't trust anyone today.","post_message":"This woman is outraged that the police gave her daughters a ride to school."},{"comment_id":"10154448547351523","commenter_b":"I got attacked by a rott happens. Why are you so short thinking. Now walk away","commenter_a":"SO SAD - and here come the pit bull lovers who will blame everyone/everything to protect pit bulls - how many people have to be attacked/killed before something is done to stop these attacks?? I suffered a vicious attack by a pit bull and it breaks my heart every time I hear of another pit bull attack. Pit bulls killed 232 Americans between 2005 and 2015 - here are the FACTS: @webpagelink","post_message":"'Two pit bulls ran out after my dog and just ripped it apart.'"},{"comment_id":"768694459925723","commenter_b":"With alll the evil this Bitch has done. She should be disqualified from living!","commenter_a":"Since Hillary is under investigation she should be disqualified to run for President .","post_message":"Can America survive more of the same?"},{"comment_id":"10153257370521130","commenter_b":"She probably wouldn't be as beautiful as you are","commenter_a":"Mehul","post_message":"He said she looked very beautiful and attractive before marriage, but when he woke up in the morning and found that she had washed the [makeup] off her face, he was frightened as he thought she was a thief."},{"comment_id":"929005763900127","commenter_b":"Not as pathetic as your lying Hillary.","commenter_a":"Trump even takes a GOOD idea like term limits at EVERY level of elected governing and ruins it with his hate, ignorance, and by being the WORST candidate for President ever his pathetic nothingness and lack of depth daily shows how weak and what a fraud this TRUMP is. Pathetic. LISTEN LEARN THINK FEEL and VOTE smart.","post_message":"Donald J. Trump has vowed to limit House members to a 6 year term and Senators to 12 as part of his broader plan to 'drain the swamp' and reduce the amount of influence lobbyists have in Washington.  Read more: @webpagelink"},{"comment_id":"10154777446051336","commenter_b":"she's a prick","commenter_a":"It's disgusting Megan Kelly should shut up and be suspended with her biased comments shut her up! And stop playing Miley Cyrus music in the background! She said she is leaving if Trump wins. Bye Miley!","post_message":"'The American people have spoken and the American people have elected their new champion.'  Tonight, Vice President-Elect Mike Pence thanked the American people for his and Donald J. Trump's election victory, before introducing the President-Elect."},{"comment_id":"10153240747000326","commenter_b":"anything to keep a woman from being elected President!","commenter_a":"#feelthebern !!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
