[{"comment_id":"966104673465761","commenter_b":"Islam. Definitely will Dominate. ....... Hell of Course","commenter_a":"So America here is the hope and change policy everyone voted for. And the new world order. Question. When are we as voting and tax paying Americans going to say enough is enough. These punks can speak bad about God and Jesus. But God forbid if you speak bad about a child molesting prophet like mohmed. Or that false god like allah. Islam is a belief base and history and likes. We all know that Mohamed made promise to entice the people to fight lIke animals by promising them virgins. Where in the middle east are you going to find a virgin. All the goats are taken. Our courts need to grow a spine.","post_message":"Is Obama Trying to Establish Islam as our State Religion?"},{"comment_id":"10154236917854726","commenter_b":"Hillary must never be allowed into the White House.","commenter_a":"What about these rides on that billionnaires plane!","post_message":"Media pushes war-on-women narrative against GOP while ignoring indiscretions of Bill Clinton."},{"comment_id":"1199029986880444","commenter_b":"give out birth control pills....us older people didn't even have those in our days ....PPH sells baby parts so that's one reason they like abortions......","commenter_a":"And baby mortality will go down","post_message":"Cecile Richards: Maternal Mortality Will Increase if Planned Parenthood Defunded [VIDEO]"},{"comment_id":"10154475429571336","commenter_b":"One could only hope. But she seems to be too slimy to catch!","commenter_a":"Wikileaks founder, Julian Assange, has said that Wikileaks has obtained information that, when released soon, will guarantee a Hillary Clinton indictment. During a recent interview with ITV, Assange said his next release will “provide enough evidence” to see Hillary arrested.","post_message":"At the Veterans of Foreign Wars VFW convention, Donald J. Trump slammed Democrats for not mentioning ISIS during their DNC speeches. @webpagelink"},{"comment_id":"10155152237477042","commenter_b":"Everyone without documentation will get deported.","commenter_a":"Here in NY, we have a huge population of illegal immigrants from China, Russia, Israel, and the Middle East. Will they be rounded up too, or do the deportations apply only to Latinos?","post_message":"New guidelines under President Trump greatly expand the amount of people considered a priority for deportation.   Undocumented immigrant suspected, charged, or convicted of a crime (including minor traffic violations) will be at the top of the list."},{"comment_id":"10152938707421130","commenter_b":"So did God fall of his throne and let Obama take over until he's better . I think not Obamas words are and have the hissss of a ankle butting supreme.","commenter_a":"I agree with the president. BB is a dick","post_message":"President Barack Obama tells HuffPost that he dismisses Israeli Prime Minister Benjamin Netanyahu's backtrack on Palestinian statehood."},{"comment_id":"10153602244842894","commenter_b":"It's a lot of women who are really Jr.","commenter_a":"Ok, so she doesn't mind showing her man's good...That is indeed a fools game but ok. I am really trying to wrap my mind around how the baby girl is a JR. should I not be distracted by that?","post_message":"Oh My! Teyana Taylor Shares Snaps of Iman Shumpert Holding Baby Iman Jr, But His Big Ol’ Bulge Steals the Show [Photos]"}]
