[{"comment_id":"10153274768969312","commenter_b":"Doesn't look like it! !!!","commenter_a":"Dont inmates get free dental care?","post_message":"Police say 32-year-old Jemayle Johnson escaped from St. Ann jail around 11:30 last night."},{"comment_id":"1040475262630610","commenter_b":"Many women who can't do hormonal, do the copper IUD. 10 years in, less of a fail rate than a tubal!","commenter_a":"If only BC didn't have so many side effects tho. I had to get off, I almost had a stroke at 30. Not to mention I gained 40 lbs😟","post_message":"Today is the fifty year anniversary of a court case that changed everything"},{"comment_id":"10154005970128967","commenter_b":"I was just about to tag you in this haha","commenter_a":"Jack explains why he wanted out of Star wars :(","post_message":"It's no myth, Harrison Ford and Steven Spielberg are bringing Indiana Jones back."},{"comment_id":"742295419269809","commenter_b":"Herman. You read my mind. Agree completely!","commenter_a":"Banty McBotox seriously needs a reality check. Watching them as they form a circular firing squad is quite amusing. carry on.","post_message":"Please, Democrats. Keep repeating this. We want you to believe it with every fiber of your being. Don't change course. Don't learn your lesson. VIDEO!"},{"comment_id":"10153452410792235","commenter_b":"LOL He is such a nut","commenter_a":"Ted, I prescribe driving your chevy to the levy...","post_message":"You mad, bro?"},{"comment_id":"10153155208743010","commenter_b":"Ariel Sharon was the last Israeli leader who sincerely wanted peace with the Palestinians and strived for it despite the war hawks. Only thing the Jews want now is all of the Palestinians lands, without the Arabs of course. They are ethnic cleansing it as we speak. Sad that after the holocaust, modern Jews behave as the Nazis.","commenter_a":"Peace will only come with the return of CHRIST Jesus!'","post_message":"In this Q&A with Los Angeles Times World, former Israeli President Shimon Peres discusses the prospect of peace in his lifetime, plus other issues affecting Israel and the world:"},{"comment_id":"1208631035874947","commenter_b":"It's like they are in our brains.","commenter_a":"Hahahaha Donna Chin, @username @username! (Rix I think that number 9 & 11 will be very familiar to you Hahahaha)","post_message":"You know they're a real friend when you can be a dick to them."}]
