[{"comment_id":"783731095008773","commenter_b":"Because illegals are the only ones driving without insurance right... please i bet more illegals have insurnace on their vechile then citizens for the fact they want no problem with authority","commenter_a":"Idiot","post_message":"Should dreamer's driver's licenses include the label \"non-citizen\" on them? The debate over that question is heating up after a rookie lawmaker tweeted about an upcoming bill he's working on."},{"comment_id":"10154651718054203","commenter_b":"@username So afraid of smart, strong women that it's pathetic. #madampresident Get used to it, prick.","commenter_a":"They're desparate at this point. Killary's ship is sinking fast, and when Trump smokes her on Monday it will seal the deal.","post_message":"Take a deep breath."},{"comment_id":"1021280037910232","commenter_b":"Maybe Russia will take care of the roaches for us.","commenter_a":"Sad","post_message":"This is just sad. I never thought an American president would be seen as weaker than the Russian leader."},{"comment_id":"1142904239055165","commenter_b":"Cruz wants to stop illegal immigration. He or Trump will basically rescind all this lawless president's entire presidency in the first month.","commenter_a":"Don't bet on it. Remember, Cruz though he has his good points, he still \"wears the Republican & Special Interests chain\" he forged by accepting campaign contributions. Also, remember fort 7 long, long, long years...he didn't constatnly call for John Boehner (sober?) to call for The House Sergeant-at-Arms to arrest \"Barry O from Honolulu\" for multiple counts of High Treason, violation of The Presidential Oath of Office, failing to defend The Constitution, and counts of U.S. Treasuyr Embezzlement of Funds to illegally fund bogas business startups that failed, disappeared, and the money disappeared as well.","post_message":""},{"comment_id":"1183766191643735","commenter_b":"Hatred is strong in those with finacial short-comings, within their own community, makes you judges their contibution to their local enviroment, and their judgment in communal affairs.","commenter_a":"This will be resolved once and forever when President Trump builds the 12 foot high electrified fence between Canada and USA. Then future youths will be electrified. US Customs and Border Patrol's workload will be greatly diminished.","post_message":"Two youths unaware of their surroundings when they were playing Pokemon GO on their cell phones made an illegal border crossing this week from Canada into the United States in a remote part of Montana, U.S. Customs and Border Patrol said."},{"comment_id":"10154745395538984","commenter_b":"@username wow that's hot","commenter_a":"megan , why don't you lick hillary's ass , and ask trump about how he worships the devil in secret , like you believe , your a hack for clinton , move to cnn","post_message":"You don't see this every day. Trump's campaign manager went on \"The Kelly File\" to discuss Trump's debate tactics. Even though Megyn was on the attack, Kellyanne Conway came up with the PERFECT campaign strategy that Hillary definitely won't want to deal with. Do you think this could work?"},{"comment_id":"1329308387112427","commenter_b":"Muslims just can't adapt to modern society. Their value system is based on lower less evolved emotions and weaker minds","commenter_a":"Simple solution leave go back to where you came from","post_message":"DO THEY EVER STOP WHINING?"}]
