[{"comment_id":"596781463820482","commenter_b":"IF YOU HAVE A PENIS YOU DO NOT BELONG IN THE WOMAN BATHROOM! GIRLS NEED TO LEARN FOR THEIR OWN PROTECTION TO KICK A GUY IN HIS BALLS IF HE MAKES ANY MOVES TOWARD HER!","commenter_a":"Just asking for big trouble to start","post_message":""},{"comment_id":"10153734549101323","commenter_b":"Fucking Liberal fucks! Feminist whores! Leave Star Wars alone!","commenter_a":"I'm not sure whether the viewer would have got the right impression of Jabba if instead of enslaving Leia he'd have given her a thatcheresque power suit and asked for her opinion on current affairs!","post_message":"It's one of the most memorable, weird, gross and resonant moments from The Return of the Jedi, and from Star Wars in general – and Disney is working to disavow it."},{"comment_id":"598960046961241","commenter_b":"YES, fire him!!","commenter_a":"I agree he definitely needs to be fired","post_message":"Police chief announces that he going to enforce Shariah Law.  He can't get away with this. Shariah law has no place in America.  Do you think this police chief should be fired?"},{"comment_id":"10154991575839170","commenter_b":"Donald Trump our President will repeal it !!! And all politicians will live on the same policies","commenter_a":"He's a turncoat I do not trust him","post_message":"We didn't like it at the time, but let's compare what would have happened then to what's about to happen now."},{"comment_id":"10158125601040615","commenter_b":"America could only be so lucky.","commenter_a":"I think Trump is now afraid somebody just may be planning to 'take him out'. He should have thought of that before.Oh, yes, I forgot, he doesn't have a working brain!","post_message":"But..."},{"comment_id":"10153606211671509","commenter_b":"Gee I wonder where he gets his behavior from ?","commenter_a":"Good job mama :) the world needs more like u","post_message":"What do you think of this mom's actions? Taking matters into her own hands, her son got a heavy dose of discipline on live TV: @webpagelink"},{"comment_id":"10153840727706341","commenter_b":"Not allowed in Israel!","commenter_a":"Hmmmm,its agreed if the Arab (Muslims)will condone their daughters marrying a Jew husband.But how about the Jews too?will they agreed their daughters to marry an Arab?","post_message":"More than half of the French-Muslim adults surveyed would react positively if their daughter married a Jew."}]
