[{"comment_id":"10157769548850725","commenter_b":"Go kick her butt.","commenter_a":"you go donald !","post_message":""},{"comment_id":"508254089382552","commenter_b":"It's cheaper in the long run to deport them now.america can't continue to feed ,clothe,and give free everything to these people.Damn it our vets and needy in america should come first.","commenter_a":"We don't , and they don't assimilate ..","post_message":"NO."},{"comment_id":"10152910753726336","commenter_b":"Reality check!!!!","commenter_a":"REALLY! If you believe this I have beachfront propoerty to sell you in Arizona, can you say \"stupid Americans\"!","post_message":"Do you agree? #SOTU LIVE coverage: @webpagelink"},{"comment_id":"10154306058514062","commenter_b":"Women, always wear pants/skirts that have pockets. if they steal your purse and your gun is in it, you're screwed.","commenter_a":"And that's why I always have the Grim Ripper with me!!!","post_message":"So scary..."},{"comment_id":"1133897243307426","commenter_b":"Matt AtkinsonJack Nicholls looks like im moving","commenter_a":"Luis Barillas this reminds me of donuts after work. Hahaha","post_message":"Not recommended for our home viewers.... @webpagelink"},{"comment_id":"1025172404211543","commenter_b":"That old gal is an idiot.","commenter_a":"She must not love her freedom, or freedom of choice,","post_message":"FOLLOW US FOR UPDATES----> Freedom Daily This is Monica Ball she is a peace protestor outside of Bradley University in Peoria Illinois she hates the troops and doesn't care about her freedom..... Anyone see her? If so make sure you let her know where you stand. Show her some love @webpagelink"},{"comment_id":"10154230428956509","commenter_b":"To protect us from bringing terrorists here. How can you tell if a Muslim is not an extremist?","commenter_a":"I don't think they should have to be Christians, just not Muslim.","post_message":"\"I don't know if you can prove that they're Christian... How are they proving it?\" Donald J. Trump said about Syrian refugees. @webpagelink"}]
