[{"comment_id":"10154059836575667","commenter_b":"follow please Happiness is not that owns everything you see beautiful, but happiness can see all of its holdings beautifu","commenter_a":"What a nitwit, well good for him, a felony record for life, he earned it and deserves it !!! Hope he gets at least a year to boot !!","post_message":"Will the man who destroyed Donald Trump's star on the Hollywood Walk of Fame go to jail?"},{"comment_id":"10153474188676350","commenter_b":"But they can't make babies it takes a man and a woman to have s baby","commenter_a":"So wrong","post_message":"#BREAKING: Supreme Court makes same-sex marriage legal nationwide in landmark decision."},{"comment_id":"10153711190119411","commenter_b":"Put them on big boats & send them too the U.S. !! Time for the yanks & Jews too clean up there mess they created !!","commenter_a":"They are provided with bins and skips in most places, yet they just throw their shit everywhere. Dirty pigs","post_message":"NIMBY-syndrome grips little-mittel-Europeans"},{"comment_id":"988198774550796","commenter_b":"shes to stupid to even understand her own thought process...","commenter_a":"Learn self control, honey. Everybody was quick to pull out phones and record it! I have great respect for the lady who was talking to her but I have more for the woman who got up and got her kid out if there. This was just stupid, shouldn't of happened. Looking for a pay day.","post_message":"“She wouldn’t leave when asked and became more agitated throwing a paper she grabbed from over the counter and pulling away from PennDOT officials.”"},{"comment_id":"961966360614126","commenter_b":"I bet Walt Disney rolled over in his grave whenever he's found out what you become you are such a vulgar I can't even use the time lady because ladies do not act like that but I will come help you pack free of charge I don't care what you have and how many boxes how many trucks I will help free of charge just to get you out. And thank you for the promise","commenter_a":"Good","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"10153915924607217","commenter_b":"The most and popular muslim holy wars, were against the Romans and Persians. because they were arrogant and in face of God wills.","commenter_a":"Not forgetting the millions of Hindus killed by Muslims in India ..one of the world's greatest forgotten genocides","post_message":"The fire at the Islamic Center of Fort Pierce may have been timed to coincide with the Muslim holiday Eid al-Adha and the anniversary of the 9/11 attacks."},{"comment_id":"10156759727355354","commenter_b":"He might make good filler for potholes.","commenter_a":"Stick your head into a stump grinder? Please?","post_message":"HUMBLE"}]
