[{"comment_id":"929829353743480","commenter_b":"Gee, you'd think women would be smart enough to either (a) buy better shoes or (b) switch them out when they start to hurt. I guess not.","commenter_a":"I don't know why people wear them tbf,not if they're uncomfortable","post_message":"Time to switch to flats, ladies!"},{"comment_id":"10153435267083352","commenter_b":"Sick woman!","commenter_a":"Grr.","post_message":"Lady Sets Out to Murder Two Moms, Take Their Babies, Then Tell Her Former Man That the Kids Are Twins From Him Her Scheme Goes Horribly Wrong and One Baby Dies"},{"comment_id":"1397527680309345","commenter_b":"Give Facebook some competition techies.","commenter_a":"YOU BETTER LOOK AT THE FACTS ,TRUMP ALLOWS IMMAGRANTS IN ,BUT IT HAS TO BE LEGALLY ,WHATS WRONG WITH THAT ,AMERICAS SAFETY FIRST","post_message":"PISSED Off Facebook CEO Sends Giant YOU To Trump Didn Expect THIS To Happen Moments Later!"},{"comment_id":"10154125037012377","commenter_b":"Women are smarter than you think. This is always from a man's perspective that we are weaker. Always remember women birth your armies, their children suffer and die. The hands that rock the cradle rule the world. And when they send troops home blind and crippled, it's the woman wives and mother that take up the healing the grieving and the praying. God made us special that way. Someone has to have sense.","commenter_a":"I hope that Trump comes up with some way to penalize the Media when they publish lies.....They should not be able to get away with it.....they put up pictures that are not true with the stories.....the media has become a very negative view on anything with Trump...they dont have the truth in them......I have high hopes for President Trump and do believe he will do a great job.....It is time for all to quit all tthe stupid protesting and join together to help America!!!","post_message":"Americans reactions to President Donald Trump's inauguration were positive with more people saying they are now more hopeful about the next four years than those who are less hopeful, a Gallup Poll reveals."},{"comment_id":"1188852334521434","commenter_b":"These drugs are coming across the southern border.... #buildthewall","commenter_a":"I DON'T BLAME THEM I BLAME DRUG RULES TOO BAD","post_message":"The photos show a couple passed out in an SUV with a 4-year-old child sitting in the back seat."},{"comment_id":"10153614298213812","commenter_b":"muslims are animals","commenter_a":"They need to do this to all Muslims so they can't breed....gfu","post_message":"Experts say the ancient practice is not officially linked to religion in any way: @webpagelink"},{"comment_id":"10153151930717426","commenter_b":"@username there is no double standard. One group enslaved, tortured, raped and brutalized a race, and fought a war to keep their slaves (states rights). And the other called a race that did all the above to them devils. No comparison.","commenter_a":"Who cares about the names of the schools? Does it further rasicsm? No. Are kids being taught rasicsm? No. Anything can be offensive as \"being offended\" is subjective. Will we then denounce anything named after Malcolm X because he was a Muslim who believed that all black people are Gods and the white man is of Satan? Now that's offensive.","post_message":"She argues the name represents a “history of racism.” There are also two local schools named after J.E.B. Stuart as well as other schools named for Confederate leaders. Do you think this will/should change?"}]
