[{"comment_id":"10153869953961680","commenter_b":"I'd rather see him on the Supreme Court.","commenter_a":"My dream for \"O\" is that he picks up where MLK left off. That he becomes a source of moral courage and reconciliation and justice for all of us here in America and around the world.","post_message":"President Obama: “He knew better than the cynic that if you look at the arc of history, human beings should be filled not with fear but with hope.\""},{"comment_id":"10153494156593352","commenter_b":"Good story. Bitch is a lying though. I don't know one woman that would've let that bullshit go down...","commenter_a":"Why was she so close to a canal going downhill with her kids? This is a sad story but seemed like she made some careless mistakes.","post_message":"Mother was fighting off a BEE when she let go of her twins’ stroller and they rolled into canal and drowned"},{"comment_id":"10153138055390329","commenter_b":"You're an idiot, Michelle.","commenter_a":"Fuck you buzzfeed. Articles like this are the reason half the country has measles. So irresponsible for you to publish something like this","post_message":"Why would you ever want to get vaccinated? (WARNING: Contains images that some may find disturbing.)"},{"comment_id":"10154054009251337","commenter_b":"God Damn I want some fries now.","commenter_a":"Fuck Topher Grace. He ruined Venom.","post_message":"IT'S NOT A REUNION! Curb Your Enthusiasm's reunion for Seinfeld finally gets edited together..."},{"comment_id":"10154235206604203","commenter_b":"Black girl magic. Fucking lol.","commenter_a":"Kathryn, guuuurl. You can find me runway-walking down the street to your house with a bottle and a mission to witness this black girl magic. Let me stop by Red Lobster real quick, tho.","post_message":"Wow."},{"comment_id":"10154305700931729","commenter_b":"@username STFU you aussie pussy","commenter_a":"God (the real God) does not require one to pray a certain number of times. He's willing to listen at any time!","post_message":"Well, they probably won't do THAT again."},{"comment_id":"10157011618750354","commenter_b":"Would someone please tell me why these THUGS have not been arrested or gased?","commenter_a":"Dumb ass negros !","post_message":"WATCH the insane footage of the BLM radicals...  \"I will f*ck sh*t up!\""}]
