[{"comment_id":"677143662389195","commenter_b":"Shut Up!!!!!","commenter_a":"The Patriots are speaking! Donald Trump is our Patriot Leader! E-verify. Numbersusa.com. Arm all our military - - active, reserve, and veterans. Honor The Constitution / Bill of Rights, limited government, free enterprise, and USAmerican exceptionalism. Make The USA Great Again! Go, Trump! Support the Muslim Reform Movement. No more terrorists! m.facebook.com/Muslim-Reform-Movement-@username/ MuslimReformMovement.org","post_message":"If Donald J. Trump \"gets his way, it will be like Christmas in the Kremlin,\" says Hillary Clinton"},{"comment_id":"10157695745225354","commenter_b":"Kanye and his fat ass bitch are 2 POSs.","commenter_a":"Yezzy? I think he probably meant sleezy.","post_message":"FIRESTORM as Twitter backlash grows.   Read the TWEETS:"},{"comment_id":"765017110298136","commenter_b":"I agree. That would stop illegals dead in their tracks!","commenter_a":"If they would allow the soldier to shoot that vermin off the fence, that shit would end","post_message":"For some reason, this truth is lost on liberals, but what isn't?"},{"comment_id":"10155406778245231","commenter_b":"Couple? Ha! You are uninformed white women have been weaving in droves for years. Weave is weave texture is not a determining factor.","commenter_a":"Does that include white women too?","post_message":"But will he take their money when they purchase tickets?"},{"comment_id":"675876952588617","commenter_b":"Hillary is a lying bitch.","commenter_a":"Won't hear this at the debate.","post_message":"JUST IN!"},{"comment_id":"10153005003572377","commenter_b":"Obama in the Alaskan wilderness? Ha, Grylls will be smothered by the Obama entourage!","commenter_a":"Guess I won't be watching that show any more unless. .......Obama doesn't make it!","post_message":"President Obama will soon be running wild Bear Grylls in the Alaskan wilderness."},{"comment_id":"10152763067471051","commenter_b":"Let that bitch rot.","commenter_a":"So @username all she has to do is profess her love for Jesus and all is forgiven. Huh......smh","post_message":"When her fiance broke up with her, this woman decided to make his 3-year-old daughter pay."}]
