[{"comment_id":"1007061529350376","commenter_b":"Merry I'm very aware it won't be Carly. It's not time for a female President :-) No female running has the ability to do the job. They're both failures in their past jobs.","commenter_a":"The debate proved why we need a Republican President and not Hillary.","post_message":"If you watched yesterday’s debate, you know we can’t afford to have a Republican in the White House. Say you're with Hillary—add your name: @webpagelink"},{"comment_id":"478375502350743","commenter_b":"Ridiculous. Stop this nonsense","commenter_a":"Pay the fine..it's a small price to pay for all God has given us.","post_message":"Obama's America hating Christianity..."},{"comment_id":"10153712907532483","commenter_b":"'@username, you need be aware that the Christian Bible never tells us to go out and kill others or to be vengeful. Any Muslim who believes the Quran as I believe the Bible would truly be a danger to most Americans.","commenter_a":"I want to speak out and let people know that there are a plethora of southern baptist churches that are very diverse. My pastor adopted his kids from Africa and they are black while he is white. It's a fantastic GODLY southern baptist church. Don't condemn all churches or all baptist churches or all southern baptist churches for what these people have done. This is very sad.","post_message":"'There was pushback about... the types of children we were bringing in, and I was asked to not invite black children to [Vacation Bible School].'"},{"comment_id":"10153331851941509","commenter_b":"There's a law in Alabama that says a man has to walk fifty feet in front of an automobile waving a red flag, if a woman is driving. In Ca. You can't shoot jackrabbits from a moving streetcar.","commenter_a":"Honorable lawmakers. Do not longer exist. This is just a small example of how good taste, decency, decorum and such, form no longer part of our society.","post_message":"Congressman Alcee L. Hastings, citing a dildo law, among other things, has some harsh words for Texas lawmakers. Now Texas lawmakers are demanding an apology. @webpagelink"},{"comment_id":"909436415764813","commenter_b":"'@username is right. Our India is safe for females.","commenter_a":"India more safe than so-called muslim nations..its just that media show these news here and the other countries like pak n iran highlight such news of India.. they never show good things about India.","post_message":"The victim's mother said the men had harassed her daughter after they boarded the bus."},{"comment_id":"10154220387809312","commenter_b":"The girl should have been dealt with a lot sooner than 2 years!!","commenter_a":"They should have all bought headphones and blasted The Bible on tape.","post_message":"When the noise first became an issue about two years ago, Saylor said she would knock on the door and ask her neighbor to quiet down. It didn't help."},{"comment_id":"611945445596715","commenter_b":"To accept defeat to a liar, who had the questions ahead of time, who has lied over and over - HOW CAN HE ACCEPT IT? I doubt the American's will acept Hillary as president, as they rejected Obama!!!! Voter fraud is alive and well. NO voter ID? Illegals being PAID TO VOTE DEMOCRAT? HARDLY FAIR OR BALANCED.","commenter_a":"Why wasnt it asked to hillary..","post_message":"During the final Presidential debate, Trump refused to say if he would accept the results of the election. Many believe this will threaten the time-honored tradition in which the loser recognizes the legitimacy of his opponents election to office in order for a peaceful transfer of power to occur.   Should Trump accept the results of the election if he loses?"}]
