[{"comment_id":"804054019696293","commenter_b":"Dumb bitch...","commenter_a":"She just needs to shut her piehole take off her cloths and look pretty!","post_message":"Amy Schumer: you know what Americans are 'sickened' by? We dumb, poor, working class folk are 'sickened' by rich, elitist, Leftist 'celebrities' who can afford to live in million dollar homes with high-end security and bodyguards lecturing us for protecting our families and children. Sorry, Amy Schumer, that we can't afford to live in a gated mansion with state of the art alarm systems. But your pal Obama destroyed the American economy. So spare us the lectures!"},{"comment_id":"1829596377287822","commenter_b":"I don't think Zippy Goldberg never looked up anything and that's why she always sounds like an idiot that hates America I just hope that if white people finally start rioting , go to wherever she lives to take her things and burn her cars so she can get a feel for what it's really like.","commenter_a":"Who watches that nightlight anyway?","post_message":"Whoopi Goldberg just scolded millions of Americans on The View. Apparently if you voted for Trump, it's because you 'didn't do your homework' on Hillary."},{"comment_id":"10154129546231545","commenter_b":"Romo a true gentleman and it took alot for him to do that, better to be up and walking than being in sever pain the rest of your life. Thank you for being a model for the younger players! A true Cowboy. ..","commenter_a":"Luckily, he has someone very close by to talk to about the benefits of being a backup QB on a Super Bowl quality team.","post_message":"Today wasn't easy for Tony Romo.  He's not the starting quarterback for the Dallas Cowboys anymore.  But he handled the situation with dignity:"},{"comment_id":"1105899882819941","commenter_b":"'@username typo, bitch!","commenter_a":"Donald Trump 2016! Because as an American hispanic, I'm tired of how all of these coward racist liberals that hate America like Obama, Clinton, Sanders, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, I'm supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of my skin... disgusting. That's why I and others support Donald Trump. Please support the movement by getting the 'Trump Strong' t-shirt at:www.teespring.com/trumpstrong . And let's Make America Strong Again! Thank you.","post_message":"They do NOT want people to see this one!"},{"comment_id":"10154830070756337","commenter_b":"I feel good Hillary is going to win","commenter_a":"I'm with her!","post_message":"We're counting down to Tuesday's election. Tell us how you feel..."},{"comment_id":"10153778472068984","commenter_b":"She doesn't owe anyone anything, much less a fucking apology lol","commenter_a":"Carly, how can someone so well versed on most subjects, be so uninformed on Muslims? Even Muslims know Islam is not a religion but an ideology of submission only. Therefore you owe Ben Carson an apology for being correct when he said they are not covered under OUR constitution. READ the Quran for yourself Carly and you will find out that you are an Infidel and are to be killed if you do not SUBMIT to Allah. Does that sound like someone our constitution would support? I think NOT!","post_message":"Carly Fiorina just revealed what she thinks about Ben Carson's comments about a Muslim serving as President of the United States - and you might be surprised with where she stands...  Do you think Fiorina is showing her true colors?"},{"comment_id":"10154543040158812","commenter_b":"Not this woman!!","commenter_a":"Hillary and her husband are as dirty as dirty can be! Can't believe this lying, two faced, arrogant broad is the Democratic nominee for President! Thank you women voters for voting for gender instead of what was best for this Country!","post_message":"An impromptu meeting between President Bill Clinton and the nation's top cop could further undermine Hillary Clinton's efforts to convince voters to place their trust in her, highlighting perhaps her biggest vulnerability. @webpagelink"}]
