[{"comment_id":"1216942571674495","commenter_b":"Deceitful lying criminal. God have mercy on those who vote for monster Hillary. She will destroy this country with her crimes.","commenter_a":"How telling!","post_message":"Hillary v. Hillary!"},{"comment_id":"10155058445841509","commenter_b":"Well shoot - if Queen says no to him, how dare he run for President...lol - let the woman with the impeached husband take over!","commenter_a":"Not only was part of Melania Trump's speech plagiarized (word-for-word) from Michelle Obama... Also...Both the guitarist and the record company for Queen refused to authorize Trump Inc (and all political groups) to use their song \"We Are The Champions\"...but of course that boundary was disrespected by Trump. Is this a Prank Show ??? THIS is stranger than fiction. When are they going to say: \"Ta-Dahhh!!! Y'all just got Punk'd!!!\"","post_message":"JUST IN: Speaker Paul Ryan announces Donald J. Trump \"has been selected as the Republican party nominee for President of the United States.\" @webpagelink"},{"comment_id":"10155025843208734","commenter_b":"Oh I remember lol","commenter_a":"Thats Ari Moran! I know him! Great officer!!!","post_message":"We're live in studios with Fairfax County Police Department's new bloodhound, Juneau! 😍❤️🐶"},{"comment_id":"10154884349326509","commenter_b":"Donald Trump would not try to lock the WW2 vets from their own memorial or lock American school kids out of the WH like the pho9ny Obama & dem's did. Pelosi would not even talk to the vets because she was speaking to a group of illegals. However, the scourge is claiming a very fraudulent amount for her retirement, way up in the 6 digits.","commenter_a":"It's still related to DDay and that was sent around by far more than him. Get over it, at least he was honoring the event.","post_message":"Donald J. Trump tried to remember #DDay with a photo that wasn't from D-Day."},{"comment_id":"10153437815231680","commenter_b":"She is worthless!!","commenter_a":"Hillary... Who DA feck Cares!!!","post_message":"Hillary Clinton: \"Well, as one of the more than 65 million Americans who voted to reelect Barack Obama, I’d say my voice is being ignored right now because of their obstructionism.\""},{"comment_id":"10153817887769203","commenter_b":"Michelle will body slam Barry!","commenter_a":"Coming from the first female POTUS this is funny. Obummer, you can't handle your own angry wife let alone Putin....get out of the White House you effeminate jackass","post_message":" can handle a bunch of CNBC moderators at the debate. Let me tell you, if you can handle those guys, then I don think the Chinese and the Russians are going to be too worried about you."},{"comment_id":"10152839305921680","commenter_b":"Not this half latino nor his wife and father!","commenter_a":"And Latino will fall for it again.","post_message":"\"As a mother, grandmother, and American, I don’t know how a person can meet these young people ... and think of threatening them and their families with deportation,\" Hillary Clinton said."}]
