[{"comment_id":"1335636243169794","commenter_b":"Im tired of this bitch","commenter_a":"Yaneka Davis @username @username 😂😂😂😂😂","post_message":"She's calling out Kylie Jenner!  #WSHH #CatchMeOutside #KylieJenner"},{"comment_id":"1676343909290795","commenter_b":"I wish these other stories would come out! I read another one about a guy she accused of hacking her account and he said he would pass on all his emails etc to Trumps campaign guys lawyer. I think this chick is unbalanced and has issues","commenter_a":"You idjits are just gonna love the hell out of it when we burn this BS Republican party to the ground if a hijacking takes place at the convention in Cleveland. Tired of this party bending over and letting Obama drive deep, then talk about conservative values during the election. If Hillary wins this, look in the mirror. #TRUMP2016.","post_message":"\"We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,\" Katie Pavlich said. \"This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.\""},{"comment_id":"1213125935366328","commenter_b":"This old hoe has lost her mind.!!","commenter_a":"You can be the first one to be unprotected! Have your security do without their weapons to protect you & Bill!","post_message":"Hillary Clinton, front-runner for the Democratic Party presidential race, heartily endorsed the idea of high taxes for gun sales, along with high fees for gun dealers."},{"comment_id":"10155151407594575","commenter_b":"Illegals have to hide behind walls to avoid deportation. They build their own walls. Saw absolutely no effects from a day without immigrants, Guess they don't really matter.","commenter_a":"Awesome.","post_message":"Business owners are standing behind their decision to fire workers who participated in \"A Day Without Immigrants\" protests.  They say it's not a political stance but rather a business decision.  \"If you're going to stand up for what you believe in you have to be willing to pay the price.\""},{"comment_id":"10156102999530354","commenter_b":"If he's not an illegal, he should be. What a POS. If you feel uncomfortable around the American flag, then get the hell out of our country.","commenter_a":"while your education comes out of our pocket screw you anti american crap","post_message":"Look what Matthew Guevara has to say about the American flag..."},{"comment_id":"10157371541105231","commenter_b":"But they pay for it smh","commenter_a":"Sorry but if she was white I would still find this inappropriate. For me it has absolutely nothing to do with the color of her skin or the shape of her body as a human resources manager I have had to have many a talk with white, brown, and black women regarding their inappropriate attire. That's what dress codes in the workplace are for. FYI men also come to work in inappropriate attire. They tend to dress sloppy, they don't bath, and when they think they're sexy they tend to show us way more than we want to see. So it works both ways.","post_message":"It isn't the clothes they have an issue with."},{"comment_id":"10153797602872060","commenter_b":"Bless you Chase!","commenter_a":"Thanks Chase!","post_message":"Chase Landry of The History Channel's \"Swamp People\" hitched his 20-foot aluminum flat-bottom boat and has rescued more people than he can count."}]
