[{"comment_id":"10156004556150725","commenter_b":"Yes Please get RID of her!!","commenter_a":"Please get rid of Hillary Clinton....You rock @username","post_message":"Arriving to check out the border."},{"comment_id":"10153794621104726","commenter_b":"Thats the REAL ISSUE here..PRAYER and FAITH ..these guys are so far remoived from G-d its pathetic..This all has to do with the men in POWER.....has been since the beginning....even satan wanted to be above our creator..these followers of satan are no different","commenter_a":"Still another reason I'm a pub!","post_message":"Democrats come out against God"},{"comment_id":"1686879181550201","commenter_b":"It had to be a woman. Why couldn't have just come up with a $3 bill. Leave well enough alone.","commenter_a":"Of all the really great black statesman the US has ever produced, wonder why they didn't pick Frederick Douglas, MLK? Oh yeah, they were republicans and Douglas said any black that would vote democratic was an idiot. Of course people are so ignorant now I have read where people have stated the democrats drew up the legislation for the civil rights act, in reality passed by a republican congress with a reluctant Democrat, Johnson signing it. Ignorance abounds","post_message":"BREAKING: OBAMA SUCCESSFULLY WHITEWASHES AMERICAN HISTORY…”Racist” President Andrew Jackson To Be Replaced With Harriet Tubman On $20 Bill"},{"comment_id":"10152989254431438","commenter_b":"Where are women who are frightened of a man in the women's room supposed to pee?","commenter_a":"How exactly do you prove you're a trans person?","post_message":"It's one of the most viciously sadistic, hypocritical bills the Florida legislature has ever considered."},{"comment_id":"1323274761102106","commenter_b":"Hillary is for WALL STREET, BIG BANKS and CORPORATE WELFARE!!!! Bernie was right!!! Don't let her steal our COUNTRY🇺🇸#NEVERHILLARY","commenter_a":"I think it's great that the majority of America is holding him accountable for being a sexual predator.","post_message":"Hillary Clinton is leading Donald J. Trump by 15 points in Virginia, up 8 points from two weeks ago."},{"comment_id":"10154160813994657","commenter_b":"She is a criminal","commenter_a":"She's a disgrace, so are the people that support this nonsense","post_message":"Playing by her own rules?"},{"comment_id":"1034964553205670","commenter_b":"@username I do not know of anyone who has demanded to, \"get even\" with whites. Not sure who you are referring to.","commenter_a":"Idk, I was bullied and made fun of for being white by black girls. It's just racism, saying \"reverse\" racism implies that only white people can be racist. That's pretty racist, in of itself. :/","post_message":"News flash: Reverse racism doesn't exist."}]
