[{"comment_id":"864626500338540","commenter_b":"God says we must forgive the ones who ask forgiveness. We all make mistakes nobody is perfect. Mr Trump for you to come forward God sees and forgives you! I pray that everyone sees and not to judge it was very wrong what Mr Trump said. God sees his heart remember Saul who did horrible things. God forgiven him and turned him into Paul! Pray for America that our country changes for the better. Pray for our new President that he is on the right path makes the right decisions! We must pray for Mr Trump to show the women that he will help them in every way! For our children to have God back into schools no more hate but love one another in Jesus name!","commenter_a":"Who believes her empty words?","post_message":"On Donald J. Trump's campaign website, Melania Trump released a statement addressing her husband's controversial comments from 2005."},{"comment_id":"10154618646328812","commenter_b":"Europe will never be the same again thanks to refugees","commenter_a":"Ever notice how politicians insist on framing the narrative?","post_message":"French President François Hollande said today's attack and hostage situation at a church in Normandy was carried out by \"terrorists who claimed allegiance to ISIS.\""},{"comment_id":"10153884127193854","commenter_b":"I do not now abut you ..but me ? I am jew ...","commenter_a":"One day Michael Moore you're going to get what's coming to you youre a evil lowlife person and disgusting and Stephen Colbert had you on his show last night I wouldn't watch that democratic hypocrite of a show","post_message":""},{"comment_id":"1184765608230962","commenter_b":"That works too","commenter_a":"Jenni Mahtinez","post_message":"Have you ever wondered how voting in the caucus even works? Because the answer is pretty weird. - Jon Comulada"},{"comment_id":"928454370547645","commenter_b":"Because only girls can get raped","commenter_a":"I am so glad that I don't have a daughter. I'd be terrified for her in this world we live in. Heartbreaking.","post_message":"'The most disgusting, sickening' gang rape at Spring Break beach party"},{"comment_id":"10154874760616037","commenter_b":"He said he was deporting illegal CRIMINALS not all illegals.","commenter_a":"it would cause a shitstorm...seeing police officers pulling parents out of their homes while kid's look on crying...meanwhile it would be all over CNN...and the divide between people and officers would be even greater","post_message":"Officers are \"not going to engage in law enforcement activities solely based on somebody's immigration status.\""},{"comment_id":"1248622855149182","commenter_b":"@username not to mention more people have voted for her","commenter_a":"@webpagelink/ Bernie Sanders is SO close to winning the nomination, my fellow Berners! We will have a contested convention in July where both candidates will have the chance to sway the Super delegates. This is excellent news and shows that hard work does pay off. Our political revolution has put the country on the right track to put progressive policies in motion and that means we can have a better future by working together today. Join the movement! #notmeus #berniesanders","post_message":"Will tomorrow be the beginning of the general election? What’s next for Ted Cruz and John Kasich if Donald Trump wins today? What’s next for Bernie Sanders if Hillary Clinton wins today?  Our editor-in-chief Judd Legum and politics editor Aaron Rupar talk about the implications of the Indiana primary."}]
