[{"comment_id":"1213019208717830","commenter_b":"@username So...a ticket paid for means she can do whatever she wants and not follow rules and regulations. I'm pretty sure it is clearly stated in the paperwork you sign before sailing that you will be left behind if you are not back on the ship on time.","commenter_a":"Horrible. They waited a whole 30 minutes how about waiting til she's back. What if she had been kid napped or in a hospital. No compassion what so ever, makes me sick. If she can see that ship depart they are at fault.","post_message":"A woman looked on with horror as the cruise ship on which she was vacationing left a port in Bahamas, leaving her on the island while her children were on the ship."},{"comment_id":"10156761367765354","commenter_b":"quit giving her the time of day!!!","commenter_a":"Who knew behind the mask was a racist cop hating jerk, I heard Kanye needs some $$$$ since you gave the black panthers so much why don't you give $$$$$ to another cop hating jerk so he can lavish Kim.","post_message":""},{"comment_id":"10156157123040725","commenter_b":"Keep the illegals out","commenter_a":"I'm glad to get this input.","post_message":"Marco Rubio is weak on illegal immigration and will allow anyone into the country. Has worst attendance record in Senate- rarely there to vote on a bill!"},{"comment_id":"10153203949426782","commenter_b":"This is complete BS!!! They are illegals!! NOT undocumented.... In Oklahoma you have to prove you are here LEGALLY, not an illegal criminal to get an Oklahoma ID or DL. Sign up for a DL as an illegal and get deported.","commenter_a":"If Americans went to Mexico illegally, they would be thrown in jail, deported, if they're lucky, possibly shot and killed, but I can guarantee they wouldn't be given free medical, free schooling, welfare, jobs, driver's license, etc....all at the tax payer's expense.","post_message":"An Oklahoma City grassroots effort to get undocumented immigrants drivers licenses is gaining momentum."},{"comment_id":"10152777855631717","commenter_b":"Totally disgusting, the bastard should be locked up for life!","commenter_a":"Are you serious? Time to pull them off the bench!","post_message":""},{"comment_id":"1032281423464900","commenter_b":"Oh please. You gotta be kidding. I will say Madcow needs the ratings for sure.","commenter_a":"When you get the guts to go on Rachel Maddow's show, please let me know.","post_message":"I talked with Fox News’ Gretchen Carlson this afternoon about the House passage of the Homeland Security Appropriations bill. As I told her, we made a commitment in December to seek to block President Obama’s lawless, unconstitutional amnesty using the \"power of the purse.\" Today we upheld that promise by doing our part to pass the strongest, most conservative bill that we could. I hope you’ll take a moment to watch."},{"comment_id":"10153547017035950","commenter_b":"There is no excuse for paddling in school. Sounds like mom has serious issues too.","commenter_a":"He has missed 18 days of school, he's got in two fights this week, he spit on a kid and his mother is on the verge of going to jail not only because he has missed school but because of things she does in her personal life. If she doesn't want to be a parent to that child somebody has to be.","post_message":"\"It was not a spanking. It was abuse,\" said the boy's mother."}]
