[{"comment_id":"1275473112509215","commenter_b":"#GrabThemByThePussy #MakingSexualAssaultGreatAgain","commenter_a":"Deplorables say don't judge Trump for something he did ten years ago yet they keep bringing up something Bill Clinton did 20 years ago. Deplorables say Hillary is an enabler for standing by her cheating husband.... But Melania is a good wife for standing by her twice divorced husband who cheated on her while she was pregnant? Hypocrisy is the running mate of Donald Trump. And sexual assault. Don't forget that. #GrabThemByThePu$$y #MakeSexualAssaultGreatAgain","post_message":"\"Everyone knows how bright she is and how resilient she is, but...they're going to see how much she cares.\" —Joe Biden"},{"comment_id":"10153864923562490","commenter_b":"Women do not belong on boats or in combat this is just common sense and has everything to do with sex...","commenter_a":"Being a navy veteran, I don't agree with this. They already had a court martial case where enlisted male sailors were tried for taking pictures of female officer submariners showering....","post_message":"First enlisted women report for duty to sub force in early 2016."},{"comment_id":"10153162222096051","commenter_b":"I think it should be done in private. What's a woman going to do just flop it out in front of everybody","commenter_a":"You can breast feed in public without your boobs hanging out.","post_message":"This woman was shopping at her local Target when she noticed that the store had left a special message to its customers."},{"comment_id":"437859166374039","commenter_b":"For all the idiots out there who think its a good idea to burn people's shit FOR STARTERS BURN YOUR SHIT NOT OTHERS WHO WORK HARD FOR WHAT THEY HAVE... STOP TRYING TO SAY ITS FOR FREEDOM FOR THE BLACK RACE YOUR MAKING IT WORSE","commenter_a":"please, this country was founded because people rioted when their tea was being taxed LOL.","post_message":"\"This is not protesting, this is not first amendment rights.\""},{"comment_id":"2109805452578927","commenter_b":"Leave her alone!!","commenter_a":"Rosa","post_message":"World-renowned statistician Stevie Nicks declares a Hillary \"landslide.\" The mathematician also adds: \"Just like the white winged dove...Sings a song...Sounds like she's singing...Ooh ooh ooh.\""},{"comment_id":"1186141524764191","commenter_b":"That is right they would have convicted her already .","commenter_a":"IF there was anything to charge Hillary Clinton for related to Benghazi or her emails, (or anything else Fox Entertainment lies about) then wouldn't you think, after a decade of trying to convict her of something, the Republicans would have done it by now. There is NO basis to convict her of any wrong doing. The Republicans have lied about her for years and I'm sure they will continue. In the meantime I won't vote for anyone as repulsive as Donald Trump. He will, in my opinion, destroy this Country and our reputation around the World.","post_message":"How does this make ANY sense? From CNN: \"Donald Trump may say he's concerned about the little guy, but his tax plan would give the wealthy far bigger breaks than the middle class or working Americans. The Top 1% would see a whopping $275,250 reduction in their federal tax bill, or 17.5% of their after-tax income.\""},{"comment_id":"10150862465429999","commenter_b":"Here, here.","commenter_a":"The truth in the matter is that Washington is all about who has power and control of the agendas, no matter how awful their candidate. Withdrawing support from Awful Trump means conceding power to awful Hillary and the equally awful Democrats. The only way to break this power struggle is to elect more third party candidates that will force our elected public servants to compromise for the benefit of the American People.","post_message":"It's time for John McCain and other Republican leaders to set an example for their party by withdrawing support for Donald J. Trump, the Editorial Board writes in The New York Times Opinion Section."}]
