[{"comment_id":"10153227262005667","commenter_b":"@username where do you live? Come on your pry think we don't need crude oil any more either.","commenter_a":"If you think it's cute I will snare one and let you try to pet it. They are vermin and need to be killed or they will take over. Now they just eat your pets, if the numbers get out of control they will come after humans.","post_message":"The animal was spotted entering the baggage claim area and then ran across the ticket check-in area and toward the TSA checkpoint."},{"comment_id":"10153234862426336","commenter_b":"The prizes are pre set. Geesh people get a life and move along. Lady can sell it for something for fitting to her needs","commenter_a":"She's human. Just happened to be next prize. No discrimination there! Love that. She can sell it,use it for family members,etc.","post_message":"File this The Price Is Right moment under \"cringe-worthy.\""},{"comment_id":"10154567699055399","commenter_b":"cuts? cuts!? SS gave out a wonderful COLA increase for 2017 of ONLY .03%! That amounts to about $2.00 more per month while Medicare just raised their rates over 149%.....FAIR? It is insanity!","commenter_a":"Full severance packages for Medicare/Social Security recipients and contributors. Give them their money back and kiss them good bye. Get politicians out of the retirement/pension/health plans completely","post_message":"It would, among other things, gradually raise the retirement age from 67 to 69 on Americans 49 or younger at the present."},{"comment_id":"1259707477396285","commenter_b":"@username a much better caption for that sound","commenter_a":"Ali Finneran","post_message":"Once you hear it, you can’t un-hear it. It will be forever with you. Just a warning."},{"comment_id":"924171167620224","commenter_b":"It has to be big for him to screw this entire nation. Very very sad.","commenter_a":"What do you think this administration has on Justice Roberts that would make him vote twice for a law that is unconstitutional...","post_message":"John Roberts again sides with Obama."},{"comment_id":"934017173381331","commenter_b":"You keep having your exercise interrupted by having to go pee. There I said it","commenter_a":"Duh, coffee is a powerful drug, of course things feel better when yer buzzed","post_message":""},{"comment_id":"10153525332906323","commenter_b":"More like Donald Trump.","commenter_a":"Perhaps he must be having a midsummer's night dream?","post_message":"It takes a genius to know one..."}]
