[{"comment_id":"10153033074808837","commenter_b":"To those with negative comments : May your offspring never have any genetic challanges. I'd hate to think of your lack of support to them","commenter_a":"You are a great dad, she must see you as her hero.","post_message":"HOW GREAT IS THIS? A father looking to support his 6-year-old daughter got a tattoo matching the same implant device that she received in her ear."},{"comment_id":"10153475201369170","commenter_b":"Unreal. Liberal democrats are NOT AMERICANS!!","commenter_a":"And how many admirals and generals have been \"retired\" for their conservative, pro strong military views during the current administration?","post_message":"How can we have possibly let it get to this point?"},{"comment_id":"879507305458832","commenter_b":"she wants everyones money , she is so poor !","commenter_a":"Or Vince Foster. Can't forget her law partner who magically killed himself with an antique firearm that didn't function....Interesting.","post_message":""},{"comment_id":"1970418399684565","commenter_b":"Gorgeous dress","commenter_a":"Horrible dress","post_message":"Politics made it to the Grammys!"},{"comment_id":"477887179066242","commenter_b":"That is so sick why would anyone want abort a unborn baby must one that already born i'll tell you who a sick mf that's who","commenter_a":"They have abortions like it's nothing, no big deal. I used to work with a woman that loudly explained to 2 co-workers how her Dr gave her some pills. She took the pills over a weekend and when she went to the bathroom the fetus fell out. I couldn't believe what I was hearing and was stunned. Made life seem cheap.","post_message":"This is INSANE...STOP THEM NOW! PLEASE SHARE TO EXPOSE THEM!"},{"comment_id":"10155272434600652","commenter_b":"Testing. Testing. Forgive the interruption, but -- big surprise! -- something is all screwed up with my Facebook News Feed/Pages Feed and I read a suggestion that I should comment to get things to show up again.","commenter_a":"I can sum up the cause of China's rise in four words: \"American wants cheap crap.\"","post_message":"How to think about China's phenomenal rise:"},{"comment_id":"994492227347127","commenter_b":"Where is sound. Its just like showing a 360 picture.","commenter_a":"Watching from Yorkshire","post_message":"We were live at the demolition of one of the UK's tallest buildings. The Grain power station in Kent came down at approximately 11:00BST. Do you live in the area? Were you happy or sad to see it go? (Skip to 10 minutes in for the demolition moment)"}]
