[{"comment_id":"496072593916654","commenter_b":"send them to the toilets they came from","commenter_a":"Unless the Muslims can \"Swear allegiance\" to America, practice / observe their faith, while respecting & protecting the rights of Non-Muslims...YES, DEPORT THEM!","post_message":"Chaos ensues after Norway starts deporting Muslims.  Norway made a brave move, now the rest of the world needs to follow their example.  Do You Support Muslim Deportation In The United States?"},{"comment_id":"1397241813633169","commenter_b":"Shirley, this is the best comment I have read all morning. Thanks!","commenter_a":"That's why Christians should read Gods Word and trust the Lord and stop running around for a word . The Bible is Gods Word And you can get a Word from the Lord every day if you read it and Stay under your Paster if he is preaching the Gospel Of Jesus Christ","post_message":""},{"comment_id":"10153229988242293","commenter_b":"And who would that lady be? Certainly not this four times married adulterous who're?","commenter_a":"It takes lady to show the world what TRUE VALUES are; and how STAND UP in those VALUES ...!!","post_message":"Kim Davis entered the Carter County Detention Center under cover of night five days ago. She emerged to Survivor’s “Eye of the Tiger.”"},{"comment_id":"10155076076173987","commenter_b":"You do realize refugees are the ones fleeing the terrorists right?","commenter_a":"Well, Starbucks, you give 10,000 refugees easy access to kill 10,000 veterans. Yeah, great plan.","post_message":"“To those who would suggest Starbucks is not committed to hiring veterans, we are here to say: check your facts,\" the Starbucks Armed Forces Network wrote in a letter to customers."},{"comment_id":"10154229905709170","commenter_b":"Stop it. This kind of game playing makes you look more the fool. Most people today couldn't pick a transgender out of a line-up of people. They've been using our public bathrooms according to the sex they identify with, live and dress as, all these past decades to no uproar. Now all of the numskulls have come out of the woodwork claiming their women and children will be raped in the toilet stall because men are going to swarm into the ladies room because the law says they can. Get this: sexual predators don't follow laws in the first place and no law will stop them from getting their next victim be it in a bathroom or anywhere else.","commenter_a":"I will be packing better know what you are doing or you will be peeing like a girl for real !!!","post_message":"You want to try using the ladies' room, bro . . . the politicians and the media might be OK with you, but as for the ladies themselves, I wouldn't be so sure."},{"comment_id":"539209459602967","commenter_b":"why is everybody bendind over backwards for the muslims what about us true blue white americans everythingis for the forenners","commenter_a":"I dont understand why muslims are even here to begin with. Do they really think they are going to come to america and take our country? Good luck with that is all i have to say. They need to go back to their own country and worry about their own people and keep their crazy Godless religion to themselves. WE'RE NOT INTERESTED AND WE DONT CARE!","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"10153129217297377","commenter_b":"There are a couple of million people in prisons and jail right now (Google it). I'm pretty sure they were taken there and didn't voluntarily have themselves incarcerated. Don't say it's impossible. That said, I think it's improbable and impractical to plan on finding 12 million illegal immigrants as a whole and deport them. Just let them remain illegal and deport them as you find them. Let them stand in line with everybody else who is attempting to immigrate LEGALLY.","commenter_a":"I think lots of them will self deport. Especially those who are gang members and have been deported and came back illegally. Cut off benefits and the free loaders will leave. States can deport.","post_message":"\"You're going to have a deportation force, and you're going to do it humanely,\" Trump says."}]
