[{"comment_id":"10152607726779071","commenter_b":"same here","commenter_a":"I've been dressing like a man for years and I assure you no one takes me seriously.","post_message":"The clothes you wear have a profound impact on how people perceive you."},{"comment_id":"1686144921672620","commenter_b":"Sixty percent of the donations to his church are by mail. I'll wager sent in by those that can least afford it.","commenter_a":"I am thoroughly confused. Why does a preacher have to be a millionaire? Jesus did not need a million dollars to spread the Word of God and there is no other as Him. Nor did his disciples. They taught the Word and lived the Word and never did they live as lavishly as these preachers. Many of you are saying that IRS should not get involved and the people should do something about it. The problem is that no one is and the blatant greed and lavish lifestyles is out of control - and what is the absolute worst- it is all done \"in the name of the Lord\". Sorry folks, these are not churches. They are tax free money making machines that feed off of very good hearted Christian people that just want to do their best to live according to the Word and these \"preachers\" know just what ...","post_message":"I can't believe this is happening. Sending prayers for Joel Osteen and the rest of America's churches that are being attacked."},{"comment_id":"1212697888750239","commenter_b":"It's funny how the liberal low information voters want to take guns away from law abiding citizens, as if that will solve anything, yet they don't want to deport the illegal felons and criminals, or prevent them from being able to get guns in the first place; and you don't want to prevent a terrorist organisation that supports ISIS from getting ICBM nukes. Brazil has the world's most strict gun laws, yet people die almost every minute of the day due to gun violence there. You know why? BECAUSE CRIMINALS DON'T OBEY LAWS! That Oregon campus was a gun free zone in an area where open carry is legal. No one would have the guts to go on a shooting spree anywhere but in a gun free zone. Anytime there is a tragedy like thus, the Democrat solution is always more government tyranny. Europe has the same population size as ...","commenter_a":"So I'm sure someone on Facebook will say it's all his fault. Yeah right.","post_message":"A shooting at a school in Oregon is just the latest massacre that President Obama has had to respond to. Read full story: @webpagelink"},{"comment_id":"893860944043492","commenter_b":"Theres nothing \"hateful\" about 1) secure the border 2) Enforce the immigration laws. In fact every country, including Mexico, does this. People ARE angry. For good reason. As we see our country being ruined by endless millions of incading illegal aliens.","commenter_a":"Its very simple. 1) Enforce our immigration laws. 2) Secure our borders. By the way, that's how all the other countries try and deal with immigration. The rest of this nonsense is just typical liberal delusions","post_message":"End of a DREAM?"},{"comment_id":"949193028544815","commenter_b":"BLM is a terrorist organization, lets call it like it is.. Also the New Black Panthers are no better then blm..","commenter_a":"Good","post_message":"The Real Showdown with the BLM is about to Begin!. @webpagelink"},{"comment_id":"102010026995579","commenter_b":"Wanna borrow my gun?","commenter_a":"Go ahead Cher! I'm not stopping you.","post_message":"Famed singer and radical leftist Cher is at it again, making outrageous and unwarranted comments. @webpagelink"},{"comment_id":"10153625958496636","commenter_b":"This is why women shouldnt get involved: too emotional. Lets let everyone in...","commenter_a":"The Germans now are having a worse affect on Ireland than nazism did. They are diluting the nation state with mass immigration.70 million muslims from Turkey given visas, austerity and cheap labour frrom countries that should never have been allowed into EU.Dole tourists bleeding us dry . Most importantly our individuality is being merged into a multicultural nightmare","post_message":"Freedom is in decline across the planet"}]
