[{"comment_id":"10154964993289411","commenter_b":"What have they to complain about the weather in Greece is lovely.","commenter_a":"pablo escobar ?","post_message":"LIVE: Protesters rally in Athens to honor memory of teen killed by police COURTESY: Ruptly"},{"comment_id":"1251358764916884","commenter_b":"@username she is the epitome of EVIL...","commenter_a":"This happens when you are stressed and not comfortable with what you are saying. She has to stay in the race or she goes to jail. There are a lot of people depending on her to keep them out of jail. She will crack and meltdown if pushed long enough...","post_message":"@webpagelink"},{"comment_id":"1354157517952129","commenter_b":"Has Ann never looked in a mirror? She may be a skinny bitch, but look at that horse face of hers. Does anybody see the resemblance? She's got great hair, but hair can't cover up that horse face.","commenter_a":"Man Coulter is a vile excuse for a human being.","post_message":"Yes, really."},{"comment_id":"1770180839911909","commenter_b":"I will be disgusted if Hillary is the president!","commenter_a":"I'm still in disbelief! Thank you for your service to this country Hillary. I'm just disgusted that Trump will be president.","post_message":"Scripture tells us: Let us not grow weary in doing good, for in due season, we shall reap, if we do not lose heart."},{"comment_id":"10157240650595294","commenter_b":"Nice dress","commenter_a":"I hope we get rain.","post_message":"Will rain get in the way of your Fourth of July celebrations? Jenn Harcher, Meteorologist is going to let us know!"},{"comment_id":"10153722896533690","commenter_b":"How Iran can Accept refugees while Iran is very poor country and its people are migrating to Europe","commenter_a":"Europe is christian place so send rufugees there,, iran is a shia muslim country, so send refugees there. Why don't you send these refugees to sunni dominating countries like pakistan, turkey??????","post_message":"Opinion: \"Of the more than four million Syrian refugees, almost half of them, the largest concentration, have gone to Turkey. In addition to Turkey, Camp Zaatari in Jordan has received tens of thousands of Syrian refugees. There are also Syrian and other refugees scattered throughout the Arab and Muslim world, particularly in Lebanon. There is one glaring case of a Muslim country that is heavily involved in Syria but has yet to accept a single Syrian refugee, and that is the Islamic Republic of Iran.\" Hamid Dabashi, Hagop Kevorkian Professor of Iranian Studies and Comparative Literature at Columbia University, writes for Al Jazeera."},{"comment_id":"10152775597868299","commenter_b":"Who does she work for?","commenter_a":"How about you get a job darlin????","post_message":"Chelsea Asks for Clinton Foundation Cash ... @webpagelink"}]
