[{"comment_id":"10156470803785354","commenter_b":"They KISS ASS better then the others!!!","commenter_a":"There are thousands of kids bullied every day but Muslims are going to have our government defending them. That is so wrong. Why are they more important than the rest of the kids in our country. B.S.","post_message":"And check out Rush's epic take on this..."},{"comment_id":"1760652447526552","commenter_b":"'@username you can eat in a public restroom and listen to people pissing and shitting and sit there and smell it for 10 minutes!! I don't even use public restrooms for myself if I can avoid let alone for my baby to eat in! If everyone wants to be politically correct then make a bottle fed baby eat in a restroom with a blanket over their heads too! That bottle nipple is replica of a mother's real nipple, for a REASON!","commenter_a":"It's okay to breastfeed in public. Its the way your doing it that offends people. If you're gonna breastfeed in public at least have some decency to have at least something to cover that part of your body and the baby while nursing. Simple but effective.","post_message":"A Connecticut woman is speaking out after posting a viral video in which she was yelled at by a man for breastfeeding her baby in Target."},{"comment_id":"965007433534716","commenter_b":"2 pussy's","commenter_a":"Freya Mistry Rayan Mistry","post_message":"Donald Trump and Jeb Bush are fighting over who is tougher. What do you think?"},{"comment_id":"10153679733478967","commenter_b":"People really do get butt hurt in SF","commenter_a":"Carlos Salazar","post_message":"Well this didn't go very well."},{"comment_id":"682882035184939","commenter_b":"Until the war against christians ends. All countries should carefully screen all imigrants. Period","commenter_a":"Yes absolutely!","post_message":"Our children's future is at stake! YOU DECIDE!"},{"comment_id":"10154481500504199","commenter_b":"Your mom is overrated. #yesidoknow","commenter_a":"Overrated.","post_message":"Sorry, but we have to ask...  Who's planning on seeing Star Wars: The Force Awakens?! [via.q13fox.com/Iat0q]  Photo manipulation by Mara Leite Photography"},{"comment_id":"1107309912667398","commenter_b":"Testing , testing , are you awake America , if not you'd better be soon , ISIS is here an they're not gonna wait for us to realize it , to late is to stupid , time to shake the Muslins up to the fact that we've wasted enough time an lives on there nonsense arrest an deport where needed , tolerate nothing , they want changes send them home an let them change there own countries , leave us alone an we'll leave you alone too .","commenter_a":"'@username and trump piss off.","post_message":"Donald J. Trump says there may be more terror attacks across the country because 'we've been weak' and 'our leaders are...stupid!' @webpagelink"}]
