[{"comment_id":"711877645667193","commenter_b":"LETS PRAY TRUMP OUT OF OFFICE! !","commenter_a":"True","post_message":"Together, we will MAKE AMERICA GREAT AGAIN! SHARE = God Bless Rev. Graham !"},{"comment_id":"10156221471665725","commenter_b":"Trump is only enforcing a fedral law, by deporting illegals !!! This is already the law !!!","commenter_a":"I am inviting all of TRUMP FAN to PRAY , from the HEART everyday and all the time, he need it and we need him, please let get together , for our country and for our new president TRUMP, TRUMP 2016, AMEN !!!!","post_message":"I will be hosting Saturday Night Live on November 7th. Looking forward to it!"},{"comment_id":"10153896425024330","commenter_b":"Some women are idiots. Victim blaming is a disgusting habit.","commenter_a":"Some women are saying , what did he do to deserve that ...","post_message":"This woman is accused of setting her boyfriend on fire and police are searching for her. Warning, the details are disturbing. ---> @webpagelink"},{"comment_id":"1046837848719437","commenter_b":"'@username You must be trying to sound smart but if you are a Trumpeter... Oh well need I say it? Trump lies every single time he opens his ignorant mouth! I will take my chances with @username! At least she has a coherent campaign beside I am uh going to uuhh build a Wall YEAH a Great big wall DUH!","commenter_a":"When voters were asked to say the first word that came to mind when they thought of @username, the most popular responses were , , and .","post_message":"The fate of immigration reform—and millions of undocumented families—is in the hands of the next president."},{"comment_id":"1244573758893966","commenter_b":"I Absolutely agree! A party of the people. Even a small number of seats in the Senate will be very influential. This would apply to the House, state governors, all the way through to mayors and local city counsels are all controlled by big money politics. We must stop trans-national corporations, and their billionaire owners from sucking the life out of us! STop the vampire billionaires!","commenter_a":"There IS at least one viable and active third party, progressive and non-corporatist: The Green Party. but pundits don't like to acknowledge they exist. It's a weird denial-fetish.","post_message":"'We need third parties in this country. And by that I don't mean another third party supported by billionaires, that centrist, you know, in the sort of Ross Perot manner. I mean parties that represent different opinions on the spectrum in the manner of the populist party in the 1890s which was really the last time we saw a third party movement, that contested the ballot from the bottom all the way to the top and they were a real political party.   Unfortunately the techniques that the populists used are against the law in most states. If we were to repeal those laws you might have a vibrant third party scene again.' - Thomas Frank, author of the new book 'Listen Liberal' in a 2012 conversation with Bill Moyers."},{"comment_id":"1861021464115839","commenter_b":"Fits his class level.","commenter_a":"Ignorant","post_message":"WARNING: Graphic content"},{"comment_id":"1000660886660326","commenter_b":"Send her to Pluto to cool off!","commenter_a":"I bet her mother is sooooo proud...","post_message":"'I'm not really ashamed'"}]
