[{"comment_id":"10153173313535090","commenter_b":"<(\") Those whom approve of ILLEGALS in our country are either here illegally themselves Or are Profiting off of them in some way. The Government equates Illegals to two things, more tax revenue for them to spend & more votes for the democratic party. To insure this, they are flooding our society with individuals from every country possible. They couldn't care less about The American Citizens or LEGAL Immigrants. To Overpopulate any country places an undue burden on it's natural resources, it's firemen, it's police, it's agriculture ( food ), it's educational & medical centers. Obama Openly stated : I will immigrate 100,000 Muslims from the middle east annually for the next 8 years... :( He recently aided 100,000 Illegals prior to a Judge filing a stay of his executive order. He & Hilary Clinton are receiving money from Saudi Arabia & other middle eastern governments to insure their agenda ...","commenter_a":"51 million immigrants in the last 8 years! When are you guys going to do your jobs and stop this madness!!!","post_message":"Do what's best for your health.   Stand in opposition to Obama's government bureaucrats: @webpagelink"},{"comment_id":"10155030336677501","commenter_b":"Trash at its finest. Good job getting her off the street officers!","commenter_a":"Throw the key away","post_message":"WATCH: Activist Kathy Wray Coleman arrested on outstanding warrant during RNC demonstration in Public Square"},{"comment_id":"10153189927841336","commenter_b":"Mike.... yes all ILLEGALS should be deported.... We have immigration laws which are not being followed... We have a system for people who want to become citizens so I do not support those who break the laws of this country and expect to reep the rewards of citizenship off the backs of the American taxpayer...","commenter_a":"ACLU is out of their minds... abortion is murder!!! illegals need to be deported PERIOD...","post_message":"“The Catholic Bishops are taking millions of dollars in federal grants and then imposing their beliefs on this vulnerable population… that raises serious concerns under the separation of church and state provision in our Constitution,” said an ACLU Nationwide attorney."},{"comment_id":"10153604514287293","commenter_b":"@username Deport the illegal immigrants in Palestine, back to Minsk, Krakov, Vilnius and Brooklyn, where they were BORN.","commenter_a":"Stop all to the Israeli Colony.","post_message":"“Even the United States doesn’t have anything as complex, as sophisticated.”"},{"comment_id":"549294818565391","commenter_b":"Its not a womans choice to kill an unborn child if you dont want a child dont have sex its that simple","commenter_a":"It's each woman's choice.","post_message":"Today marks the 43rd anniversary of the Supreme Court's decision in Roe v. Wade. On this somber day, I know it's difficult not to be discouraged that the Supreme Court's decision in Roe still stands. But now is not the time to give up. We must work together to continue promoting a culture of life in Arkansas and America. Read more:"},{"comment_id":"10153321686504091","commenter_b":"They was trying to rob him","commenter_a":"Did anyone notice she looks around twelve?","post_message":"WANTED FOR TWERKING? Two women are being sought for sexual assault after twerking on an innocent man, police say.  WATCH --> @webpagelink"},{"comment_id":"10154509463236162","commenter_b":"Same Jen same","commenter_a":"@username... worried for @username","post_message":"HOT DOG RECALL: Put down the hot dogs!   372,000 pounds of hot dogs and corn dogs are being recalled over concerns of listeria contamination.  Bar-S Foods is recalling five chicken and pork products.   The recalled items include Bar-S bun-length and classic franks made with chicken and pork, Bar-S classic corn dogs and Signature Pick 5 corn dogs."}]
