[{"comment_id":"979011448820924","commenter_b":"she would have just committed suicide another time someplace else","commenter_a":"Had her relatives posted bail, she would still be with us today. Shame!","post_message":"So close to the holidays...  A Texas grand jury has decided not to issue any indictments in the mysterious prison cell death of Chicago woman, Sandra Bland. Despite video evidence showing a display of excessive force from the arresting officer, the case now remains at a standstill.  MORE ---> @webpagelink"},{"comment_id":"10153764021131509","commenter_b":"And as far as white women go.... I've quite seen a few black women with arm pits and legs full of hair. Jus sayin..","commenter_a":"WHITE-WOMEN! Tryinna start a trend....","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"},{"comment_id":"1082185285137594","commenter_b":"She dropped the dollar sign a long time ago. Its just Kesha now","commenter_a":"I'm telling you, all she has to do is use a different name. Use an S instead of a dollar sign or something. Prince did it in the early 90's when he figured out the labels were raping artists and wouldn't release him from his contract.","post_message":"The Bleachers and Fun. member is joining collaborator Taylor Swift and actually doing something to help. #FreeKesha"},{"comment_id":"10153041474101051","commenter_b":"Take away the baby and tie her up so she can see how that feels .","commenter_a":"I'm assuming she gave the baby dog food.","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"512585862199466","commenter_b":"Anyone who does homework works for his or her education.","commenter_a":"The man","post_message":"Thank you to everyone who has donated to my campaign- we have raised $51,000,000.00 in the month of June-- thanks to you! Lets MAKE AMERICA SAFE AND GREAT AGAIN! You can make secure donations here: @webpagelink"},{"comment_id":"10153636980216135","commenter_b":"I can't believe an older women like your self could be so ignorant. I've always been taught if you don't have anything nice to say DON'T SAY NOTHING AT ALL! How can those words even come from your mouth. Where is your morals?","commenter_a":"I'm so sorry for his family and friends, but what can you say about someone that stupid...?","post_message":"Police say the man was driving his car in reverse with the door open when he fell out."},{"comment_id":"10156058811190594","commenter_b":"Well maybe he tried to grab on one of their chicks or tried to take some out of pocket cheap swing prior to the film rolling. What does your sister's job have to do with the surrounding facts?","commenter_a":"I'd like to know the surrounding circumstances before passing judgment. Who knows maybe the Vikings fan said or did something to provoke the attack.","post_message":"Brutal fan brawl horrifies onlookers after 49ers game"}]
