[{"comment_id":"10153178962341833","commenter_b":"Oh and not to mention we wouldn't have lasted a day against the British without guns.","commenter_a":"People just don't get the fact that we are still a democracy after 240 years in part because we as a population have the constitutional right to be armed. Let's see how long we would have lasted otherwise.","post_message":"Thank you for helping us reach 4.2 Million LIKES on Facebook! Like and Share the news with your friends!"},{"comment_id":"10156300548230389","commenter_b":"Gilbert, go back to the ignorant liberal hole you slithered out of. You spineless snake.","commenter_a":"Who in the Hell is Race baiting? It is Fox Propaganda Channel and @username. Who in the Hell supported the Racist Tea Party? Fox Propaganda channel. I see by the comments that you are the problem, not Obama. Your commenters would rather cut off their heads to spite their faces. That is why they listen to you, for the same reason the German people listened to Hitler.","post_message":"Question of the Day: Do you think President Obama has made race relations better or worse in this country?"},{"comment_id":"10158155070740206","commenter_b":".. And why is anyone still endorsing hillary clinton?","commenter_a":"so the NYP takes a run at Ryan Lochte for lying but gives crooked Clinton a walk ? hmmmmm","post_message":"Liar liar, swim trunks on fire. @webpagelink"},{"comment_id":"879093232228004","commenter_b":"She is an ugly person!","commenter_a":"Maybe she can hire a personal assistant to help her with clothes and makeup...","post_message":"$20,000,000.00 a year?! Shoot, I wouldn't pay her $20 a year."},{"comment_id":"10154945952871037","commenter_b":"Wow, I honestly thought I was the only one.😢","commenter_a":"I was diagnosed with PTSD after being sexually assaulted as well. It disgusts me that so many people dismiss it as someone playing the victim card or seeking attention. Believe me, no one wants PTSD or to be sexually assaulted.","post_message":""},{"comment_id":"10153312839004203","commenter_b":"No way she's a stupid bitch","commenter_a":"You'd rather have Rand Paul , Jeb Bush or Ted Effing Cruz? Really? GO HILL!","post_message":"This is it."},{"comment_id":"704402909750287","commenter_b":"1st lady my ass","commenter_a":"She destroyed the school lunch program. Absolutely destroyed it...","post_message":"Michelle Obama gets blind sided with this devastating blow, it's over. No one cares about her. She is a disgrace. Are you tired of hearing about Michelle Obama?"}]
