[{"comment_id":"1080901341949487","commenter_b":"She let them die","commenter_a":"Donald Trump for President 2016! Make America great again and will work for FREE!","post_message":" Obama administration and Clinton officials hid this compelling Benghazi email for years, said Judicial Watch President Tom Fitton.   The email makes readily apparent that the military was prepared to launch immediate assistance. The fact that the Obama administration withheld this email for so long only worsens the scandal of Benghazi. Please SHARE!"},{"comment_id":"10153332084960736","commenter_b":"@username You seem to be missing the point. Those appear to be all Cows (baby factories if you would). Kill off all of those and there is no way to reproduce any more. Who ever told you the Elk were overpopulated? Did you read it in a newspaper somewhere? Or have a Fish Cop mention it? Or perhaps just another Liberal with a big mouth and an empty head.","commenter_a":"More like training the young wolves to kill. The meat is then left uneaten and wasted. That's a very good reason to get rid of the wolves before the Elk are extinct.","post_message":"Wildlife officials describe a 'surplus kill' as when animals kill more prey than they can eat, leaving the surplus."},{"comment_id":"838447029619520","commenter_b":"Why is that ugly cat so moist.","commenter_a":"Brittany Gallo","post_message":"WATCH: Obi the baby pygmy hippo has splashed into the water with his mother for the first time in front of viewers at the Melbourne Zoo in Australia."},{"comment_id":"10154455305884087","commenter_b":"Mike I'm with you exept the pre_existing what are people to do just die after the doctors and hospitals have done taking everything that is just morally wrong","commenter_a":"These people are so ignorant and out of touch it is ridiculous, that is one of the issues that got Trump elected. Repeal and replace, I am for a free market insurance health care. We do need to make sure that pre-existing conditions are covered, and letting parents insure their children until 26 is a good idea. If they need medical attention they are insured, and the taxpayer will not have to foot the bill.","post_message":"47 percent of Americans oppose repealing ObamaCare, while only 20 percent want it repealed immediately."},{"comment_id":"1030946370280768","commenter_b":"She's full of pride, disloyalty and all together wicked.","commenter_a":"I don't think she knows how to be honest","post_message":"Hillary claims she's always tried to tell the truth to the American people - but I think many of them would beg to differ...  Do you think Hillary Clinton has been dishonest?"},{"comment_id":"532019336988646","commenter_b":"I'm not catching that disease from her","commenter_a":"Fuck that bitch","post_message":"Michelle Obama thinks you should do this instead of going to church.  She is a disgrace. Get her out of the White House please.  Do you agree Michelle is an embarrassment?"},{"comment_id":"2180920135465808","commenter_b":"@username Where did you get that nonsense? She doesn't get a pension.","commenter_a":"Imagine if Michelle did this. They would say she doesn't love her country and she's disrespecting the The White House (as if that were a thing). Repugs are the biggest hypocrites ever","post_message":""}]
