[{"comment_id":"364315750438606","commenter_b":"Orrrrrrrrrrrrrrrr, build a big wall around it and let in any idiot who wants to live like an animal.","commenter_a":"Solution for Baltimore. Dismantle the police department and incorporate law enforcement into the Department of Social Services. Terminate all police officers. Fund the law inforcement portion of social services with Federal dollars. Social Services pay gang members $100,000 plus benefits and pension to each gang member, no identification or proof of residence required. Pay each adult $500,000 for new housing or relocation. No identification or proof of residence required. No follow up for use of housing fund. Encourage business owners to allow no cost to their merchandise (free) .","post_message":"Democrat Candidate for Senate in Maryland Blames Republican Governor for Baltimore Education Problems"},{"comment_id":"10154579846521337","commenter_b":"Uproxx spreading the word of obama lets keep stoking the fires of divison","commenter_a":"Why is the kid running? I mean...I personally see cops running towards me I'll probably freeze like a deer in headlights. The cops would've likely seen their theory was ridiculous once they got close to the kid and moved on.","post_message":"“I was scared for my life. I was thinking that they were going to shoot me.”"},{"comment_id":"10153464811106028","commenter_b":"'@username, yes, jail is vacation. You should go there when you get tired of working. Many of our jails are full of illegal immigrants waiting to be deported or just released back into society. You should really think before you open you mouth Mario. Some people are just plane dumb. To think jail or prison is a vacation. If we sent home the illegal immigrants that are currently in our jail system, we could close 20% of our jails and put that money to better use.","commenter_a":"More people would have been there but it was morning and they were sleeping. It's also not the 1st or 15th so they don't have their free government checks, so no gas to get there. I say deport them, if they are here illegally they need to go. I'm tired of paying tax for them to get a free ride. We don't even take care of our own vets as well as we take care of illegal immigrants. That's a bunch of bull.","post_message":"Immigration policy protests continued throughout the morning in downtown LA, forcing closures at Los Angeles and Main streets. Protesters in a circle at the intersection called for a stop to recent federal deportation raids: @webpagelink"},{"comment_id":"10153426857830329","commenter_b":"Faketalian !!! Grossest shit ever.","commenter_a":"'@username oh my gawd we need to go","post_message":"We all knead this."},{"comment_id":"10153434092834586","commenter_b":"First let's remove these beautiful creatures from these ugly hateful humans, then hook them up to the carriages to earn money. Ugly people with ugly hearts. Disrespectful pos.","commenter_a":"Its not fun for the poor horses","post_message":"This is what happens when you voice concern for injured carriage horses in #NYC.   What kind of person could do this?! #BanHorseCarriages"},{"comment_id":"10153332084960736","commenter_b":"'@username You seem to be missing the point. Those appear to be all Cows (baby factories if you would). Kill off all of those and there is no way to reproduce any more. Who ever told you the Elk were overpopulated? Did you read it in a newspaper somewhere? Or have a Fish Cop mention it? Or perhaps just another Liberal with a big mouth and an empty head.","commenter_a":"More like training the young wolves to kill. The meat is then left uneaten and wasted. That's a very good reason to get rid of the wolves before the Elk are extinct.","post_message":"Wildlife officials describe a 'surplus kill' as when animals kill more prey than they can eat, leaving the surplus."},{"comment_id":"10154456467843717","commenter_b":"Real Feminists Don't Kill Babies You just can't ban abortion. You can only ban safe abortion.","commenter_a":"You just can't ban abortion. You can only ban safe abortion.","post_message":"The ban is expected to be challenged in court."}]
