[{"comment_id":"841359735901368","commenter_b":"He just \"forgets\" that we are in the 21st century, not in the Middle Age. We've learned from the past and they don't.","commenter_a":"We are all aware that this President is ill informed and has had trouble when it comes to Historical accounts... Whether or not you believe the Crusades were meant to stop Islamic atrocities or to spread Christianity, that should not be the focus here. Suggestion: Truly read the differences between Christianity and the Islamic faiths and decide which spreads peace within its holy scriptures.... An interesting example below siting scripture from both religions (read in its entirety). ...Especially, the Ellen Mems comparison. This is a public FB debate between a Muslim and a Christian: Quoting \" Christianity & Islam A debate... Gamal Abouomar Who is Prophet Muhammad, may peace and blessings be upon him? He is the one who defended the rights of all humanity 1400 years ago. He defended men's, women's and children rights He commanded and fostered the love between relatives and neighbors He established a coexistence relationship ...","post_message":"Barack Obama's prayer breakfast comments about Christianity are causing some to perk up.   “Unless we get on our high horse and think this is unique to some other place, remember that during the Crusades and the Inquisition, people committed terrible deeds in the name of Christ.\""},{"comment_id":"10153230146462439","commenter_b":"Why do you say that?","commenter_a":"The use of the Neutron Bomb comes closer.....","post_message":"Iran is the world’s leading state sponsor of terrorism. Hizb’Allah is its client in Lebanon. Hussein Obama has apparently joined the axis of evil…and that will be his legacy. “Iran is placing guided warheads on Hezbollah rockets,'” by Yaakov Lappin, …"},{"comment_id":"10156436861080354","commenter_b":"Barbara is either asleep or as dumb as a box of rocks!","commenter_a":"BABA STREISAND is a LIBTARD MORON, Like her EVIL BUDDY HUSSEIN OBUMMER...!! EAT SHIT BABA SHEEP STEISAND..!!!","post_message":"You've GOT to see her characteristically snooty and elitist statement..."},{"comment_id":"10153040281701051","commenter_b":"And don't go back for her. Let her walk her crazy ass home.","commenter_a":"Dump her ass at the lake then go take care of your business","post_message":"This husband was so stunned by his wife’s behavior that he took out his phone and started recording the whole thing."},{"comment_id":"432105150316631","commenter_b":"Haul her a•s to jail ???","commenter_a":"I would love to jerk the whole outfit off. Would stop a lot of shoplifting for a start😡👳🏾","post_message":"NO SHARIA LAW IN AMERICA!"},{"comment_id":"10152852200292014","commenter_b":"Dylan Crane its not domestic terrorism its a hate crime. He killed them because they were black. He didn't kill them for political or even religious reasons. So uh oh your ignorance is showing. ...","commenter_a":"Let's see he's not muslim, black, mexican, or asian so that means this will get written off as a guy with a troubled childhood and mental issues like always and quickly swept under the rug and no \"terrorist\" or \"thug\" label given.","post_message":"Dylann Roof, the suspected of fatally shooting nine people at Emanuel AME Church last night has been arrested."},{"comment_id":"10154362431207293","commenter_b":"@username She may surprise you.","commenter_a":"Pennsylvania must be filled with idiots. The KKK and White Supremacists have always held high number of members in that state","post_message":"“Put in Trump and we’ll win again,\" one voter said."}]
