[{"comment_id":"10153564544001509","commenter_b":"I cannot stand her either.","commenter_a":"I find her extremely obnoxious.","post_message":"Actress Gwyneth Paltrow is trying to live on $29 worth of food for one week as part of the #FoodBankNYCChallenge. See what items she selected: @webpagelink What would you buy for $29 to feed your family for a week? Share your answers in the comments below."},{"comment_id":"10153422363668984","commenter_b":"It was a fake statement, you irrelevant moron of an actress.","commenter_a":"So you find an actress that is stupid. Duh","post_message":"One word -- wow. ADVISORY: This article contains unedited profanity and obscenity that may be offensive to some readers. Do you think Senator Ted Cruz deserves an apology from this actress?"},{"comment_id":"1011521052257456","commenter_b":"SHOWA. I would say if you didn't think it could happen again, it's happening again.","commenter_a":"INVADERS don't assimilate!!!","post_message":"Unreal. Stupid public schools ... celebrating the subjugation of women."},{"comment_id":"10153831819518598","commenter_b":"Glad she doesn't love me","commenter_a":"Love is always a good reason to murder someone isn't it.","post_message":"Woman Writes: “I Had an Abortion Because I Love My Son”"},{"comment_id":"10155243196880354","commenter_b":"If the border is not closed these terrorists will continue to come into America!!!","commenter_a":"Save the taxpayer some money and just shoot them. Don't tell the world, just shoot them and be done.","post_message":"Meanwhile, as Obama was snapping selfies...."},{"comment_id":"481914358685584","commenter_b":"That chick in the picture is going to fire up a joint , get high , go down and get her welfare check, then crash for a while, then get up and go to a anti-whatever rally and get arrested , then get out on an O/R and go cash her check and go get some more weed and start all over again. Thanks Gov. Brown for making California so great!","commenter_a":"Does that mean about 4 thousand attended?","post_message":"Attendees of the annual 4/20 pot celebration left behind almost 15,000 pounds of trash at the Golden Gate Park. PHOTOS/VIDEO:"},{"comment_id":"10154101869331323","commenter_b":"He's a cunt !!","commenter_a":"Look at that mugshot! THAT is the face of a man who has just been caught doing, pretty much anything imaginable...","post_message":"Chancellor George Osborne is facing calls to reveal whether he has ever benefited from offshore tax havens after the prime minister bowed to public pressure over the Panama Papers by releasing a summary of his tax returns."}]
