[{"comment_id":"647292048744709","commenter_b":"Only think Muslim country doesnt provide is Security Reason for us to move USA !","commenter_a":"There is a renewed campaign that's getting a lot of attention to get the Equal Rights Amendment (ERA) into the U.S. Constitution. Many candidates talk about their support for fair treatment of women, and this amendment would provide a fundamental guarantee of equal rights. If elected, will you actively support the ERA? #GOPDebate","post_message":"Don Lemon is taking you through the latest in Facebook trends ahead of tonight's #GOPDebate. Have questions? Ask him anything!"},{"comment_id":"10153806284196509","commenter_b":"He is representing the USA is a PATRIOT with money. MANY MANY AMERICANS R Rich! PRAISE GOD WHOM ALL BLESSINGS FALL! RICH People make employment for others! RICH people can pay well & most do! Rich people donate to causes that heal, give to the poor, spread for GOOD! They are AMERICAN CITIZENS with opinions that this country needs fueled now!","commenter_a":"TRUMP is an AMERICAN that is ENTITLED to a VOICE! We support TRUMP!","post_message":"Both co-hosts of Miss USA, Cheryl Burke and Thomas Roberts, have pulled out of the pageant in light of recent comments from Donald J. Trump. @webpagelink"},{"comment_id":"10152814040437293","commenter_b":"Especially among Liberals.","commenter_a":"It's not a surprise that Fox 'Faux' news should top the polls as the most trusted because most people (sheeples) are obviously dumb because common sense isn't in fact that common.","post_message":"Even among independents."},{"comment_id":"742199012637343","commenter_b":"No sharia law here. Go back where you came from.","commenter_a":"What many have said thy plan to take over the country. CAIR","post_message":"Muslims Trying To Enforce Sharia Law In America Just Got Some Very Bad News [VIDEO] If you are going to live in America, you will have to abide by our laws. Do you think Sharia Law has no place in America?"},{"comment_id":"1865774367000002","commenter_b":"If you think that way then you should leave as well. This Country actually belongs to the Native Americans.","commenter_a":"I am a lifetime member of the Sons of the American Revolution. My ancestors landed in 1732 and father and son fought in the revolution. All of you republicans whose family landed AFTER that revolution are not \"pure Americans\" and must get MY permission to remain. Ban half breed Americans..only the descendants of REAL patriots may remain","post_message":"\"We're not going to shut up. We're going to resist.\""},{"comment_id":"10158320001025294","commenter_b":"I agree!! If your DNA IS ON THE VICTIM..SPEEDY DEATH!!","commenter_a":"I beleive in crimes like this. Should be Swift justice if you're found guilty nothing less then the death penalty and in a short period of time 3 days fir greiveing for convicts family and then serve sentence out!","post_message":"The suspect is a registered sex offender. \"Our investigators didn’t stop. The culmination of their efforts is the arrest of a person who we need to make sure never touches our streets again,\" said Cleveland's police chief as he announced an arrest in the case."},{"comment_id":"985543698152769","commenter_b":"This old lady sounds like she's craving for big nigga dick :)","commenter_a":"See ya bitch... Cracker ass Cracker!","post_message":"Like housemother like house sons."}]
