[{"comment_id":"1093462474008096","commenter_b":"Yeah, please do?^","commenter_a":"They are more worried about bringing extinct animals but not help animals that are close to extinction. (rhino, tigers, wolf's, ect)","post_message":"Woolly mammoth genome has been decoded."},{"comment_id":"1449993195026187","commenter_b":"And we don't give a fuck about your racist ass!","commenter_a":"there are those of us who have nothing to \"get the F over\" because we don't give a \"F\" WHO or WHAT your granddaughter LIKES or doesn't like.","post_message":""},{"comment_id":"10156296694950293","commenter_b":"If all the grandkids reproduce themselves it could happen.","commenter_a":"The will be you soon @username","post_message":"A sweet story this morning. A grandmother hangs nearly 70 stockings on her wall every Christmas. Tell us about the traditions your family has!"},{"comment_id":"1324340430958054","commenter_b":"God will certainly Judge the U.S. for how this country decides to judge and treat people from other countries.","commenter_a":"It's not a forever ban. This is to send a message that we will not let the slightest possibly of another attack. And that if this is the only way then we will do it. We do not hate Muslims. We hate murders.","post_message":"SOUND OFF: President Trump has made a lot of changes this week, and his most recent executive order dealt with immigration. What do you think about his new policies?"},{"comment_id":"10154426235974369","commenter_b":"My Smith & Wesson says otherwise, son.","commenter_a":"If you support trump. Every time you Run or walk you will be Trampled","post_message":"Donald J. Trump really went after Hillary Clinton in his speech today."},{"comment_id":"10152682791936167","commenter_b":"The thing that pisses me off is he gets paid for his bullshit!","commenter_a":"That rules him out.","post_message":"How Rush Limbaugh talks about female politicians:"},{"comment_id":"1211880145496741","commenter_b":"No to illegals.","commenter_a":"Mr. Gowdy, enlist some of your \"sleeping\" colleagues to assist!","post_message":"Thank you!"}]
