[{"comment_id":"1197872970239356","commenter_b":"Whites will not destroy their own houses and businesses. Waste of time and money.","commenter_a":"Where is the outrage from Obama on this regarding this racial hate crime? Where are the white rioters?","post_message":"Let's hope that Obama expresses sympathy for the white victims of the #VirginiaShooting and not for the gay black shooter."},{"comment_id":"10154351189226051","commenter_b":"Lmao nope 😅","commenter_a":"Christine you didn't get this one did you! 😂","post_message":"When these parents took the doll out of the box, they were surprised at what they saw. Take a look for yourself and see if it's worthy of the controversy."},{"comment_id":"813461822117937","commenter_b":"Dream on billary Jr.","commenter_a":"Donald Trump for president thank you Jesus 2016","post_message":"Chelsea Clinton: Scalia’s Out of the Way, so now we can gut the Second Amendment @webpagelink"},{"comment_id":"10153639382745950","commenter_b":"Clever ladies..some of those pre rape drugs put you out for life.","commenter_a":"Good job ladies, we gotta stick together as women or we'll all parish to the hands of the evil ones. May GOD bless them all","post_message":"It doesn't matter if you're a friend or a stranger. When these 3 women noticed a man allegedly slip something into his date's drink, they couldn't just sit there and watch it happen."},{"comment_id":"1178825752155659","commenter_b":"Bitch is crazy","commenter_a":"Delusional!","post_message":"HILARIOUS"},{"comment_id":"10154703624496077","commenter_b":"These are all men! Lame. Almost any female is hotter than all of these (or does that make me sexist?)!","commenter_a":"Its the beard. Come on ladies, you know you love it!","post_message":"On Friday, Buzzfeed ranked our very own Kyle Clark #4 on their list of the hottest news anchors. We thought we'd share what we think makes Kyle so unique."},{"comment_id":"10154584993799497","commenter_b":"Thanks pussy","commenter_a":"U fuckin cucks","post_message":"Here what you need to know about the alt-right:"}]
