[{"comment_id":"546309585494081","commenter_b":"Another scenario: Let's raise minimum wage and keep everyone else's the same. That way their money is worthless and means less, as opposed to this minimal skill havin high school dropout with 6 kids with 4 different fathers/mothers so the price of goods will rise and you'll be in the same poverty stricken boat as you were but now you've lowered the entire middle class in it with you. And people can we get over the race thing? It's very tiresome and down right comical.","commenter_a":"This is complete and utter FAIL. If you work hard and make smart life decisions, you absolutely can succeed. What idiot came up with this B.S.?","post_message":"Seems legit."},{"comment_id":"937487649627809","commenter_b":"NO, NO, NO. Why is there even a question about this. Too many illegals in this country already. Do you want more?????","commenter_a":"Everytime I think I hear the dumbest thing ever, something else trumps it. I cant believe how unpatriotic some folks are now days. America is for Americans. Become an American and then you can vote. No intelegent group would ever let an outsider make a decision for them. It doesent make sense.","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"},{"comment_id":"979819422085921","commenter_b":"'@username don't curse Canada with the likes of people like her. Send them to mexico!","commenter_a":"Just because a person is an actor/actress does not mean they know their head from their a$$ ... proof right there in that statement","post_message":"Americas Freedom Fighters"},{"comment_id":"10153752322536523","commenter_b":"He sound dumb then a mfa","commenter_a":"#5 don't count on a police presence to deter being shot .","post_message":"Chief Flynn's four-point plan for not getting shot in Milwaukee is as follows, according to a statement from the Milwaukee Police Association:  1) Don't belong to a gang 2) Don't be a drug dealer 3) Don't carry an 'illegal' gun 4) Assure you're not going up against someone that has a worse arrest record than yours"},{"comment_id":"1165741570143303","commenter_b":"Why so serious... The whole world just needs to lighten up.. even if it's for 5 minutes.. colour is talked about so much it's actually part of the problem now.. just let it be...","commenter_a":"How the hell is this pic racist!!","post_message":"Opinion is divided ... (via BBC Trending)"},{"comment_id":"10153552105389087","commenter_b":"What an undemocratic woman.","commenter_a":"I can't stand her. She had no ideas other than the ones she stole from Sanders.","post_message":"Jeff Johnson, the head of the Washington State Labor Council, was scheduled to speak in at a pro-Bernie Sanders rally, but a pro-Hillary Clinton union affiliated with AFL-CIO threatened to take away funding from Johnson's group if he spoke at the event, forcing him to back out."},{"comment_id":"492872274234399","commenter_b":"Yes , but if an illegal begets an illegal. Guess what it's still an illegal in titled to nothing.","commenter_a":"Just because an illegal baby is born on uur soil does not make them a US CITIZEN. ........","post_message":"Breaking...WAY TO GO TEXAS!"}]
