[{"comment_id":"1746066945644780","commenter_b":"Sickening","commenter_a":"If Hillary wins we are fucked. All will end for this once dear nation. Adios America this nation is now a dump China & Russia are the leading nations now. Deceiving Hillary is going to backstab everyone. She will do anything to get your vote but at the end you will see her lies.","post_message":"Does Trump's violent rhetoric and bigotry remind you of something? Let's take a look back at history and find out... Big thanks to Marianne DeMarco for making this video."},{"comment_id":"10153322805023132","commenter_b":"She's still pregnant?","commenter_a":"I read it's a girl","post_message":"Do you think she's having a boy or girl?"},{"comment_id":"1264248823618692","commenter_b":"@username Trump lost the entire west coast, not just California. But, for the sake of your argument, such as it is, yes, take away California...take away the most populous state in the Union, the state with its own fucking economy, the state that has to give more than it takes from Federal coffers in order to support the welfare red states who take more than they give to Federal coffers...disenfranchise those people...disenfranchise the many for the few. Lady, and I use the term very loosely with you, that's how tyranny starts.","commenter_a":"Trump and his little army, are the most corrupt bunch. Electoral College...do your patriotic duty, the duty Alexander Hamilton intended you to do when faced with a Demagogue who has ties to our enemies in foreign lands. UPDATE: I have thoroughly enjoyed the response of you moronic Trumpbots...more than I know. You have validated my assessment of you folks...an assessment that can be summed up in one sentence, \"Dumb as a bag of rocks.\" So while y'all keep going on about Liberals, Dems, 'Killary', the bogus line about Hillary selling uranium, blah..blah...blah, \"We won, you lost,\" etc., etc., etc., a few pointers: You might have some valid points about some Liberals...if only you would learn to use proper analysis techniques and then had the ability to form a proper sentence to explain said analysis; yes, Dems can be as bad as Repukes...both are corrupt, and both sides are hypocrites...as are ...","post_message":"So: Shep Smith just called out Donald Trump's lies about Russian election interference on Fox News. \"It was brought up before the election. Over and over and over again.\""},{"comment_id":"1258751664191586","commenter_b":"i bet she can harvest a lot of trees on minecraft","commenter_a":"Look little bittt i wana see you actually fight some one as good","post_message":"Nice with the hands. #WSHH #Boxing"},{"comment_id":"10154060269921162","commenter_b":"BANG...! that's all","commenter_a":"Two things that are impossible... To rehabilitate a terrorist or a child molester. Both should be shot on sight...","post_message":"DISTURBING: Thousands of digital images that show children as young as 5 years old engaging in sex acts with adults were found in an Indiana man's home... @webpagelink"},{"comment_id":"10155741989330192","commenter_b":"There are many democrats who share many of conservertive ideas.like ideas about gays ,abortions,veterans rights,the militery.","commenter_a":"They are called libtards for a reason... Those that oppose legal hunting are just bad shots.","post_message":"A group of conservationists is urging Gov. Rick Scott to cancel the bear hunt that is set to take place this fall."},{"comment_id":"454539224670672","commenter_b":"After we bomb the hell out of them , before we put the truss in harms way, and have other countries fighting to. We are close to bankruptcy like Greece, we should not do it alone.","commenter_a":"Should be an option but not the only one. Tired of these numbskulls. So ready to use other people's blood but not their own The Bush family did that, the Obama. Ass did it even he said was not. Clinton did it. If The Saudis want to keep their kingdom let them do it, if the Turks want their country let them invest their oeople, Jordanians, yemens. AND STOP ALL IMIGRATION INTO THE USA","post_message":"Donald Trump wants to send more US ground troops to fight ISIS. Do you agree or disagree with his plan?"}]
