[{"comment_id":"844972862206722","commenter_b":"Why don't women have enough sense to take care of there sex life. U play u pay. Use birth control.","commenter_a":"The guy in the photo wants to be aborted NOW!!!","post_message":"“There are thousands of unborn babies who need us to fight.\""},{"comment_id":"10153573726630950","commenter_b":"bitch shut your half dead looking ass up !!!","commenter_a":"I am watching on television and I am seeing a lot of Mexican Flags. This is absolutely unacceptable. Last time I looked, California is still a state in the United States of America. If you want to fly the Mexican Flag, go back to Mexico!","post_message":"WATCH: Protesters are gathering outside of a Donald J. Trump event, shouting chants and clashing with police @webpagelink"},{"comment_id":"10154251661998144","commenter_b":"arrest them all","commenter_a":"These people mare a direct threat to our Country and the good honest people in it! Anything goes to move them! I'm fed up!","post_message":"Anti-Trump protesters blocked off an ambulance because they were upset about President Trump's executive orders"},{"comment_id":"10155525671531002","commenter_b":"@username It is my business when it is my tax dollars going to feed you .","commenter_a":"If you can eat it and drink it why is it anyone's business what you buy. I don't care and by the way, congress uses a food budget bigger than anyone that has food stamps can we say what they are allowed to use it for?","post_message":"A recent U.S. Department of Agriculture report on food stamps found soft drinks account for 5 percent of dollars spent on food."},{"comment_id":"10152574431526636","commenter_b":"but its ok for females to tell us how to sit? bit sexist.","commenter_a":"Alright, then women have to stop wearing leggings without a skirt..leggings by themselves looks trampy.","post_message":"Men, here's why you should close your legs on public transport..."},{"comment_id":"10154837209509657","commenter_b":"Gowdy did you just find out that democraps cant be trusted? I could have told that to you years ago.","commenter_a":"The only thing that will cause changes is to put Hillary Clinton in jail. Make an example of her. Set an example that shows that politicians cannot go around lying and mishandling classified information without dire consequences happening to them. You have got to get that train back up on its tracks.","post_message":"Desperate times call for desperate measures."},{"comment_id":"1619157871724827","commenter_b":"oh come on this is another lie and I would sue thevhekl out of Gloria and this bimbo! all these women have come back and stated they lied!! this bimbo wants her 15 minutes and she has no merit! ! he was right most Hollywood women will let you grope them for them to get ahead!! funny how all these women kept going around him time after time therefore it did not happen or they would not have wanted to be around him!!","commenter_a":"Blah blah blah,,,,, ummm what happened to all the other woman during the elections. Bye felicia","post_message":"WATCH LIVE: Donald J. Trump to face lawsuit from woman alleging sexual misconduct."}]
