[{"comment_id":"1034829756528494","commenter_b":"Yeah women!!!","commenter_a":"What about the father that wants to keep the baby? He has no rights...","post_message":"A win for choice"},{"comment_id":"10155085398339726","commenter_b":"I believe the term is illegal aliens... They are not immigrants. Immigrants come here legally.","commenter_a":"They spent billions of dollars on illegal immigrants every year and little to nothing on infrastructure.","post_message":"This is why you should care:"},{"comment_id":"10153291728974726","commenter_b":"Is it just me or is it beginning to look like it is just one group of \"slick\" parasites that is destroying America.","commenter_a":"Some people get it. Too bad the entitlement crowd isn't listening! They would rather consider themselves as victims of Whitey.","post_message":"VIDEO: Tavis Smiley: Government Programs Have Led to the Dissolution of the Black Family"},{"comment_id":"10154589153096336","commenter_b":"The only place Hillary should be is in prison! #trump2016","commenter_a":"MAY HAVE???????","post_message":"Newly released emails suggest a senior Hillary Clinton aide stage-managed her first hearing on Benghazi by feeding specific topics to Democratic Senator Robert Menendez. @webpagelink"},{"comment_id":"1438428362916880","commenter_b":"No, we, the REAL constituents, are not there and we are upset because we're working to pay our bills, support our families, fund illegal aliens, fund refugees, fund multi-generational welfare families, fund single mothers who don't know who their babies daddies are, pay for the prisons to hold baby daddies who make kids then get thrown in jail etcetera etcetera etcetera...","commenter_a":"Oops shouldn't have texted both when I offered 3","post_message":"Spot on."},{"comment_id":"10154174806427293","commenter_b":"Girl...you need some self respect letting yourself get played like that How much are you getting paid.You ARE getting paid right?","commenter_a":"Basically she saying HE'S CLUELESS","post_message":"Donald J. Trump's campaign manager was pushed today on \"Morning Joe\" to explain some of his recent comments."},{"comment_id":"1004981906294263","commenter_b":"Hillary DESTROYED him.","commenter_a":"I believe Trump won, but barely. What he should have pushed on and pushed really hard are three things. First, he should have looked directly into the camera and said, \"Mrs Clinton has said over and over that she is infinitely more qualified than I to be Commander in Chief. She could not and actually would not protect four lives let alone 320 million. Do YOU trust her with your lives and those of your children? Mrs Clinton has said over and over that she understands the plight of the inner cities and has worked hard to erase the despair that exists in our minority communities. Tell me, Chicago, Baltimore, East Saint Louis, and every other inner city, this woman has had nearly thirty years to help you and other than pander for your vote, exactly what has she done and are your lives better? And lastly, Mrs Clinton has ...","post_message":"The 1st presidential debate in 90 seconds.  Who do you think won – Hillary Clinton or Donald J. Trump?"}]
