[{"comment_id":"10153516438174087","commenter_b":"Only stupid people would let Syrian.people come to the U.S. Or illegals.","commenter_a":"Han er decideret syg i hovedet Oliver Dagn","post_message":"“I’m wondering if you would be able to look at [Syrian refugee children] in the face and tell them that they’re not allowed to go to school [here],” a voter asked Donald J. Trump. \"I can look in their face and say, ‘You can’t come here,’” Trump replied to applause."},{"comment_id":"951619314934321","commenter_b":"She is a moron.","commenter_a":"Fox news, God love em, is like all old line Republicans, afraid of the truth that Palin tells. Sarah may never be president, but she sure should be. She represents working Americans better than any other.","post_message":"Don't worry, Palin fans. You'll still be able to see “the First Lady of the Outdoors” on the Sportsman Channel."},{"comment_id":"10153774603359714","commenter_b":"She needs to resign then!","commenter_a":"Right Fire her..she has a job to do and it was put into law then she should uphold it or go....fundamentalist zealot","post_message":"Kim Davis said she grasped Pope Francis' outstretched hand, and he told her to \"stay strong.\""},{"comment_id":"1666312230322556","commenter_b":"what an idiot. she luck to b alive","commenter_a":"@username Whosoever","post_message":"This is why you don't mess with truckers."},{"comment_id":"10154137219211323","commenter_b":"Except I don't know any bores.","commenter_a":"How the shallow half lives. My parties are made up of kinder people and we include bores, shy people and those who feel rubbish but know they will be treated with kindness and respect.","post_message":"“They don’t know they’re bores, so they’re happy.\""},{"comment_id":"10153217086893984","commenter_b":"Get them outta there ,","commenter_a":"IDIOT.","post_message":"Unreal. Does she realize what she's doing? Is Michelle Obama bad for America?"},{"comment_id":"10154252490299778","commenter_b":"These horrible people who dare believe their status in a car is ever more important than a pedestrian need to be banished from all car transportation for the rest of their born days. If that were my kid, he'd be leaving town ASAP :(","commenter_a":"Get him","post_message":"A man is being sought after he ran over the top of a child and then sped out of the Arlington, McDonald's parking lot."}]
