[{"comment_id":"1508167409203284","commenter_b":"They'd kill all the children if it possibly meant no adult terrorists.","commenter_a":"Build them a safe place in their own country!!!","post_message":"“Every now and then, I’ll get a bad Skittle – but I don’t ban them all.”   - Rep. Luis Gutierrez made a dig at Donald Trump Jr.'s tweet about refugees and Skittles by chewing on the candy during a House Judiciary Committee hearing.   Read more here: @webpagelink"},{"comment_id":"10154356855773256","commenter_b":"She's an idiot","commenter_a":"She copied a kiwi who did this. Lame","post_message":"If others have the right to have their opinions of the divine reflected in their driver's license photos, then so should members of the Church of the Flying Spaghetti Monster."},{"comment_id":"10153215772461943","commenter_b":"I don't trust her, Should be tried for treason","commenter_a":"Was never any doubt, when her mouth moves, she is lying!","post_message":"** Now we have smoking gun proof of Hillary Clinton involvement in the lying Benghazi  points used by Susan Rice... Please SHARE this breaking news story! **"},{"comment_id":"10153263764260329","commenter_b":"But what does she think of fat bastard?","commenter_a":"Who is this bitch?? Oh yeah that's right... #Irrelevant","post_message":"Azealia Banks said a whole bunch of interesting stuff, but let's not ignore that startled cat 0_0"},{"comment_id":"10150609954164999","commenter_b":"He got elected because he was the best man for the job and he keeps proving it over and over.","commenter_a":"Spread the \"word.\" The \"word\" is love.","post_message":"\"Societies don’t overnight completely erase everything that happened two to 300 years prior,” President Barack Obama said."},{"comment_id":"1746704652254245","commenter_b":"Wow really Michelle Pugh, you put yourself in that situation for sleeping with her father\" a married man: but you won't tolerate public shaming Really looks like an excuse to try to squeeze money out of someone which is his daughter SMH say;s a whole lot of type person you are!!!!!!!!! No class!!!!!!!!!!!!!!!!!!!!","commenter_a":"Nasty is all I can say","post_message":"Michelle Pugh's life has changed dramatically in the short few months since her four-year affair with Ozzy Osbourne was revealed."},{"comment_id":"640803119402199","commenter_b":"She would make a prison cell look good","commenter_a":"A better inmate. Classified is classified and a crime is a crime. I'd be in jail or hiding in Russia if I did what she did.","post_message":"Do you think Hillary Clinton would make a great president?"}]
