[{"comment_id":"10153066092873445","commenter_b":"I bet the strippers were forced to strip and what not","commenter_a":"Okay... Retracting previous statement, these fucks need to be jailed... Illegal immigrants being forced into prostitution... Nope! Pigs","post_message":"More DEA Scandal!  DEA Agents Arrested for Lying About Owning a Strip Club"},{"comment_id":"998169870194483","commenter_b":"Dicks","commenter_a":"How the hell does anyone defend this crap?","post_message":"Their Orwellian alternative to paid family leave -->"},{"comment_id":"10154093101217452","commenter_b":"OMG. You must be a plant. No one could be that ridiculous.","commenter_a":"We are no longer fighting soviets obama. Russia is a friend in the war against ISIS.","post_message":"'Ronald Reagan would roll over in his grave.'"},{"comment_id":"384727298550424","commenter_b":"So twisted. Islam has been illegal here since 1952","commenter_a":"Not my pOtus not my kkk","post_message":"LIVE VIDEO: 'Not My Presidents Day' anti-Donald J. Trump protests are happening across the country.  WARNING: Viewer discretion is advised"},{"comment_id":"957541017614653","commenter_b":"I think she's a class act!","commenter_a":"I like all three of the non professional politician candidates and Ted Cruise and Scott Walker.","post_message":"Whoa..."},{"comment_id":"1025129017543627","commenter_b":"Preoccupied? Can women still vote? $$ facebook doesn't want you to see this $$ As long as America's richest 1%, who now possess 70% of the wealth and don't bother to vote, have the Senators in their pockets the United States Government isn't representing the will of the people, it's the 1% that's running the show. I stand with Bernie Sanders, 'We're governed by an Oligarchy.' The number of Americans living in poverty will continue to grow while the middle class will continue to shrink and working women will continue to enrich the wealthiest 1% for the next 20 years easily! (Able to afford the best and brightest, Hillary is a great political actor with a well rehearsed script.) Hillary Will make another Fortune!","commenter_a":"VOTEHfor both of US","post_message":"Women deserve access to the health care they need—without interference, intimidation, or violence. #StandWithPP -H"},{"comment_id":"10153544457476509","commenter_b":"Thanks","commenter_a":"Why are animals doing what animals do all of a sudden national news?","post_message":"What a catch! Hear photographer John Bailey describe stumbling onto the powerful sight of a bobcat pulling a shark from the ocean: @webpagelink"}]
