[{"comment_id":"1065116426845174","commenter_b":"She's thick. And frankly looks weird with the stretch marks photoshopped out.","commenter_a":"Ashley Graham, the model is size 16. She's NOT EVEN PLUS SIZE. That's what's wrong!!","post_message":"You decide..."},{"comment_id":"1000663273302101","commenter_b":"Fuck you pig boot licker.","commenter_a":"HAHAHAHAHA. Just because they be black,,,,,,,,you think yo sorry black asses BE safe with Islamists \"protecting\" yo ASSES? HAHAHAHAHA","post_message":"The police thought they were the only alternative for security. They just found out that there are many groups willing to do their jobs for them, for cheaper and with more accountability if they mess up! Do you support this move? Or will their be utter chaos without the police there? Follow >> (Y) Counter Current News for the latest!"},{"comment_id":"10156240783770389","commenter_b":"It was painful to watch! How annoying is Bernie??! Good Lord!!","commenter_a":"#PresidentTrump","post_message":"Dumb, dumber, and dumbest?"},{"comment_id":"1397527680309345","commenter_b":"Give Facebook some competition techies.","commenter_a":"YOU BETTER LOOK AT THE FACTS ,TRUMP ALLOWS IMMAGRANTS IN ,BUT IT HAS TO BE LEGALLY ,WHATS WRONG WITH THAT ,AMERICAS SAFETY FIRST","post_message":"PISSED Off Facebook CEO Sends Giant YOU To Trump Didn Expect THIS To Happen Moments Later!"},{"comment_id":"990159621088681","commenter_b":"Party affiliation is not THE ISSUE & what you should be voting on here Is Making America BETTER, PROSPEROUS & SAFER. IF YOU WANT MORE LIES..MORE CORRUPTION ...MORE $$$$$$$ GIVEN TO THE MIDDLE EAST...MORE WEAPONS SUPPLIED TO THE RADICAL GROUPS....MORE ILLEGALS COMING IN... MORE MURDERS..SANCTUARY CITIES... ...VOTE HILLARY.. YOU are the SHEEP. THE UNION HAS MADE YOU FOLLOWERS. SOUNDS LIKE MOST UAW MEMBERS ARE WISING UP. LOCAL 909 MEMBERS HAVE. EDUCATE YOURSELVES. WATCH: CLINTON CASH HILLARY THE MOVIE HILLARY'S AMERICA 13 HOURS READ: GUILTY AS SIN PARTNERS IN CRIME CRISIS OF CHARACTER ....and so much more... Investigate the CLINTON FOUNDATION.. HOW THEY HELPED (LOL) HAITI. They stole billionsof donations from these poor people. CLINTONS ARE FULL OF LIES. THEY MUST NOT BE TRUSTED! !! HILLARY CLINTON IS A WICKED WOMAN..for those who follow LOUIS FARRAKHAN, he States this fact, he also states how obama has failed his people. Look it ...","commenter_a":"Out of all the people in this work and these two clowns are the only choice","post_message":"Donald J. Trump is speaking this afternoon at Macomb Community College in Warren."},{"comment_id":"10154104825566336","commenter_b":"@username so you think the bible is nonsense. You better wake up before you meet your maker. - Bob","commenter_a":"Luke 8:17 What is done in the dark surely will be brought to light.","post_message":"Fox News confirms that a buried knife has been found on what used to be O.J. Simpson's property and is being tested by the LAPD. @webpagelink"},{"comment_id":"10152784811780927","commenter_b":"Why give a s**t? You act like he is relevant!","commenter_a":"Why do we care what he thinks?","post_message":"Another rock star goes on the attack against conservatives."}]
