[{"comment_id":"676191809238064","commenter_b":"I`ll say it agin, if the damn guns would stop shoten off there damn barrols!","commenter_a":"This father did not know his son was mentally ill and did not know his son was planning to commit mass murder with the dozen or so guns that unknown to this same father. This father is such a failure and out of touch with his son that his opinion doesn't count. He failed his son and now wants to put the blame some where else.","post_message":"The father of the shooter in Oregon just blamed guns for what happened. He must be out of his mind. This is a sick joke. Do you think his son is to blame?"},{"comment_id":"10152929906987377","commenter_b":"Kendal , another stupid liberal !","commenter_a":"You're OUT, Bobby..!","post_message":"Bobby Jindal is calling for tougher gun laws."},{"comment_id":"10153871094319705","commenter_b":"@username guys, also keep your pants up, before an INDIAN decides to rape you !","commenter_a":"Only one religion is at the ROOT of so much misery on this planet... STATISTICS that highlight the problem: In 2011, Sunni Muslims accounted for the greatest number of terrorist attacks and fatalities for the third year in a row. Over 5,700 incidents were committed by Sunni Muslims, responsible for nearly 56 percent of all attacks and about 70 percent of 12,533 fatalities.* Another 24 percent of the fatalities are on Shi Muslims. So in 2011, Muslims were responsible for 94 percent of the fatalities in terrorist attacks. Since 2011, with ISIS on the scene, the number of the fatalities victims of the Muslim terrorist attacks- sharply grew, together with Muslims share in the world terrorism that is steadily closing in on 100%. In 2013, according to the US Department of State, a total of 9,707 terrorist attacks occurred worldwide, resulting in more than 17,800 deaths and more than 32,500 ...","post_message":"So devastating."},{"comment_id":"678779465606192","commenter_b":"Woman you are so ignorant!","commenter_a":"Well hillary killed people so she should be arrested and u should be to for sticking up for her","post_message":"It's funny how that works, isn't it? Like Addicting Info for more great content!"},{"comment_id":"821129384591070","commenter_b":"Big whoop. The lady could sneeze, and the Left would twist it into a controversy!","commenter_a":"Some people are just so unhappy in their own lives they have to try and make others just as miserable. Get over yourself and get a REAL life!","post_message":"Sarah Palin kicks off 2015 with a little controversy..."},{"comment_id":"10154110742322439","commenter_b":"Cowards !! Stay to fight for your country !! You are Iran's puppets !!","commenter_a":"No problem. Enlist them in the French Foreign Legion - minimum 12 year enlistment; send them to Corsica for Basic and Combat training, and then deploy them to Libya to fight ISIS.","post_message":""},{"comment_id":"10153135004736756","commenter_b":"Henry Gallo- happy belated birthday! You have a lot of styling still to do!","commenter_a":"Great story Joe! Thanks for sharing.","post_message":"Zoe Spawton used to waitress at a café in Berlin where she would see Ali Akdeniz walk by every morning. He caught her eye because of his put-together, plucky apparel. She was so taken by his du jour ensembles she asked to take his picture. It became a daily ritual and the photos form the blog What Ali Wore."}]
