[{"comment_id":"908359942543967","commenter_b":"I'd love to meet and spit in her face. What a sick bitch","commenter_a":"Beast","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"964259683612268","commenter_b":"get them the hell out of our usa we dont want them here,take that scumbag obama with you.","commenter_a":"Probably headed to the Democrat Registration Office.","post_message":"Oy vey."},{"comment_id":"985323948188437","commenter_b":"Islam should not be in our school systems st all!!!!😯😯😯😯😯","commenter_a":"I don't think that our children need to know a lot about Islam. I think that our children need to be taught about our God - be they Christian or Jewish - also, they need to salute the flag and be educated to know that our men and women have sacrificed so much in order for us to be free.","post_message":"U.S. DEPARTMENT OF EDUCATION: Teachers Should Incorporate Islam In More Subjects"},{"comment_id":"583876271812949","commenter_b":"Niggah Please","commenter_a":"Um....why walmart though?","post_message":"Trump's #1 supporter has a disgusting warning for voters..."},{"comment_id":"1786349714946678","commenter_b":"Lol! She is a lunatic!","commenter_a":"She is a racist huh?","post_message":"Former Arkansas Gov. Mike Huckabee asked Monday if House Minority Leader Nancy Pelosi is racist after she said Housing and Urban Development Secretary nominee Ben Carson is \"disturbingly unqualified.\""},{"comment_id":"485707381619842","commenter_b":"Shariah Law is \"TORTURE OF WOMEN\". It demands that women be covered from the top of their heads to their toes. HOW STUPID is that. But this is just a small portion of the TORTURE. We are America. We will NOT HAVE SHARIAH LAW. BB","commenter_a":"No sharia !!!!!!!!!!","post_message":"Enough is enough. It's time we as Americans stand up and say 'NO' to Shariah Law. Spread the word and SHARE, we need people aware of radicals in this country. Do you agree Shariah Law should be banned from America?"},{"comment_id":"471958379619606","commenter_b":"People like carl can't help themselves... He is a result of stupid people having children.... they raise more stupid people... in turn that have more children.....which sadly are unleashed on the rest of us..... It's and incredible and sadly unstoppable event...... OR its that he has to call his mommy Aunt Mommy and his daddy Uncle Daddy... Showing us why incest is illegal... . either way they unleash these morons on the rest of us to deal with....","commenter_a":"Wow talk about prostituting your site @username. Look what I found as an advertisement on your story.","post_message":"Unbelievable."}]
