[{"comment_id":"10153364359422411","commenter_b":"Female castration","commenter_a":"What do they do about the women?","post_message":"A Republican from Alabama has introduced a bill that would require sex offenders to pay for their own surgical castration before being released from state custody."},{"comment_id":"741677189266873","commenter_b":"Really Rubio you must have a small dick. I feel sorry for your wife.","commenter_a":"Grow up, ! You are acting like a middle school boy.that is why you won't get anywhere","post_message":"Uncool. A new Rubio low...."},{"comment_id":"10153720423624312","commenter_b":"Thank you. I let my daughter go camping!","commenter_a":"Poor parenting skill for letting her daughter go camping, wow he is delusional.","post_message":"Shirley Fortner, 70, has re-lived the night of her daughter death five times during five prior parole hearings. Bret Arbuckle killed Angela Lyn Fortner in rural Ash Grove, Mo., in 1989."},{"comment_id":"1032023936930784","commenter_b":"Dear God if people did this to the Obama girls everyone would be pissed","commenter_a":"Sick freaking guy that Spinola..Ugh.","post_message":"Oh, Hell no..."},{"comment_id":"1808975196000308","commenter_b":"This news is pretty old. ..... hanging on by a thread NBC","commenter_a":"Chris El Paisitahh","post_message":"The painter who turned Donald Trump's penis into a viral sensation says she's received death threats and alleges one Trump supporter punched her."},{"comment_id":"1123835504398528","commenter_b":"Fuck that stupid ass","commenter_a":"You are a complete asshole if you think this is a political issue IS AN AMERICAN issue and every single one of us should have a problem with this!","post_message":"So if we want the truth, that makes us disloyal? Bullsh*t! --Andrew"},{"comment_id":"800733213450589","commenter_b":"Islam was banned from the US in 1952, but Obama doesn't want you to know that nor does he respect or uphold the U.S. law. The immigration and Nationality Act passed June 27, 1952 revised the laws related to immigration and naturalization and nationality for the United States. The act, which became Public Law 414, established both the law and the intent of congress regarding the immigration of aliens to the U.S. and remain in effect today. Among the many issues it cover, one in particular found in Chapter 2 section 212, the prohibition of entry to the U.S. if the alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means\" This, by it's very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House. Islamic immigration to the U.S. ...","commenter_a":"No! God gave them a place to make there home! we do not have the space!","post_message":"Dalai Lama Warns America And Europe About Muslim Refugees... Obama Shocked If this isn't a sign that we should close our borders than I don't know what is. Do you think we should let Muslim refugees into America?"}]
