[{"comment_id":"10154358010096037","commenter_b":"why would u put this animals pic on here??u people r the problem,neither his name nor his pic should be glorified","commenter_a":"Coward, plain and simple. Bury him in a casket of gay smut and pork.","post_message":"Omar Mateen, identified as the Orlando gunman, pledged his support for ISIS in 911 calls made amid his attack, according to the FBI. @webpagelink"},{"comment_id":"1067523319975236","commenter_b":"That must be beacause he dosent want to give his money away....she must have hit her face he self lol","commenter_a":"His family knew she was only with him for the money. She was a lesbian when they got married. I highly doubt he would be dumb enough to hit her where he left a mark. His other wife never accused him of this. How convenient he just did it when she is wanting a pay day to go back to get female lover","post_message":"Amber Heard kept her head high after filing a domestic violence restraining order against Johnny Depp."},{"comment_id":"10154608248221350","commenter_b":"Wonder how many people asked when he was born...'does he have hair'?","commenter_a":"Baby cute","post_message":"WATCH: Look at this little guy mane! @webpagelink"},{"comment_id":"10153968461605579","commenter_b":"Absurd! There are 50 muslim countries to accept muslim refugees!","commenter_a":"You know why I support the Syrian refugees coming to America? Because I'm not going to let the terrorists dictate my beliefs, ISIS doesn't scare me. What scares me is that we, Americans, are losing our sense of direction. I've thought about this refugee crisis for for quite some time now, if you don't believe me ask the Marines who I taught about the Syrian civil war in 2012. I've been aware of this conflict for quite awhile now, while the rest of the world turned a blind eye. Islamic extremists aren't going to scare me and they are not going to change my way of life or thinking. I am an American and I cower to nobody. When I see people fleeing danger I want to help, we as Americans want to help. If you turn away women and children fleeing death and destruction because of terrorist attacks then ...","post_message":"Should the U.S. accept Syrian refugees?  WATCH: U.S. House debate on #SyrianRefugees  LIVE on C-SPAN @webpagelink    WATCH: House Judiciary Committee SubCmte hearing on #SyrianRefugees,  LIVE on C-SPAN3 @webpagelink    Senate Homeland hearing on #ParisAttacks  LIVE at 2pm ET on C-SPAN3 @webpagelink"},{"comment_id":"987021391354390","commenter_b":"'@username: Once again, you can argue all you want day in, day out. And guess what will happen? The ongoing trend. It get's worse and worse year after year. The debt keeps climbing, yet some have their blind folders on like they can't see this way of thinking, and the economy is constantly nose diving, we are constantly going further and further in debt. Another fact, we in the South are tired of pressing 1 to listen to English while we live in America. If Hillary had it her way before she goes to jail, the mid-west and North would be in the same situation after she let them flood in and gives them drivers license, you too would be having to Dial 1, every single time you want to hear English. Think it wouldn't bother you? Think again, you'll question whether you are really living in America. After-all these ...","commenter_a":"Raise Minimum Wages - Put Small Businesses Out of Business, Take Jobs from Americans. Allow immigrants to flood the country, give them drivers licenses, and take jobs from Americans. Oppose the pipeline, Take Americans jobs. Do away with energy companies, Take Americans jobs. 'Hello, I'm @username, the hypocrite, I promise Americans jobs!'","post_message":"Time to invest in a clean energy future—not build a pipeline to carry our continent's dirtiest fuel across the US. I oppose Keystone XL. -H"},{"comment_id":"1241741129230844","commenter_b":"Donald Trump made racist white folks take they mask off, if you support Trump you are lowKey crazy and Racist, Trump's rich ass don't give a fck bout the poor, #BlackLivesMatter #Mexicans , he dont give a fck bout people from the bottom, the ones stuck in the hood, he only gives a fck bout the rich white and wealthy, ,...he started a Race war, he just motivated and inspired the KKK even more, kkk supports him to the fullest, he's gonna make this country more heated and more and more hatred between white people and the rest of the Race's , ...fck hillary too, but trust me Donald Trump is not a good option, he wanna make America white again","commenter_a":"Be a good time to start deporting.....thats how you catch illigals hold a Trump rally just bring in the busses and load them up....lmao","post_message":"Protesters remove their clothes at a Trump rally just before they flood the streets and destroy property."},{"comment_id":"10155247657250294","commenter_b":"Flush her down the toilet","commenter_a":"So very sad.","post_message":"When she was told she couldn't board the plane, police say a Florida woman did the unthinkable."}]
