[{"comment_id":"957822790936024","commenter_b":"Let's get all them bitches","commenter_a":"👌👍👊","post_message":"Human excrement gets flushed! Australia's most wanted ISIS terrorists just got smoked in Iraq. ~Will"},{"comment_id":"10152906901509270","commenter_b":"Unreal !!! This makes me sick !!!","commenter_a":"It's just Wrong. Wanna bet the Commander in Chief authorized this crap..","post_message":""},{"comment_id":"10153707738441680","commenter_b":"Pathological liar","commenter_a":"When I read these hate filled comments I want to cry. All this hate for a person you do not know and neither do I. I just know that I read bills and reports . I try to see what you all say about Hillary but I just do not see it. I am educated And I am a women I also know if all that is said about her is true men she has defeated would have locked her up a long time ago She is not perfect has she made mistakes sure Haven't we all. I will cont to listen and research and vote for who is best for my children and grandchildren That vote will go to Hillary","post_message":"Hillary Clinton: \"Whatever party you belong to, or if you belong to no party at all, if you share these beliefs, this is your campaign.\""},{"comment_id":"10153864065907042","commenter_b":"Really 😂😩 home boy was like f that","commenter_a":"Angelo Djresearch Ravioli smh","post_message":"QUEENS 'GRINCH' STEALS CHRISTMAS: A postal worker in Ozone Park, Queens threw away 1,000 pieces of mail -- all because he was \"overwhelmed by the holiday season.\""},{"comment_id":"1244912678938315","commenter_b":"... Hillary Clinton for 2016 ...","commenter_a":"A terrorist killed your son. A terrorist the FBI removed from the watch list.Sorry for your loss, it must be devastating but Obama and Hillary wants more terrorists to come here.","post_message":"\"Christopher's paternal grandparents met and fell in love in a Japanese internment camp, so it was in in DNA that love always trumps hate.\"  - Christine Leinonen remembers her son Christopher, who was killed in the shooting at Pulse Nightclub in Orlando  Watch as the DNC took on the gun lobby: @webpagelink"},{"comment_id":"10153636855342426","commenter_b":"What a tragedy","commenter_a":"R.I.P. D'Marco you fought a good fight","post_message":"D'Marco Jackson passed away this morning. You may remember D'Marco from an inspirational speech he delivered last year at the Hermitage High School graduation.  “If I had to pick a singular piece of advice to give you all, I’d say this … do not let the realities of the past or the possibilities of the future negatively affect the peace, joy and happiness that the present has to offer,” he said.  Read more: @webpagelink"},{"comment_id":"462985670577219","commenter_b":"I'm not pro 15, but we need to realize automation would have occurred with or without a min wage hike anyway. This just hastened it. The problem is most jobs can be made automated including yours too. I don't support give intervention but when pharmacists and construction workers find themselves out of jobs there made need to be some government regulation saying no to so much automation in the future. Human labor being supplemented by robots is not only a minimum wage concern, but one for everyone.","commenter_a":"They got what they wanted, you can't blame Wendy's. Or Wendy's could change the \"Dollar menu\" and make it \"Five dollar menu\" then maybe they could afford to keep all the help, but then nobody could afford to eat out. Oh well","post_message":"Congratulations, Democrats! Your push for a $15.00 an hour minimum wage has resulted in the destruction of Wendy's jobs at 6,000 stores!    \"...we work to offset any impacts of future wage inflation through technology initiatives,\" said Wendy's."}]
