[{"comment_id":"668184586705453","commenter_b":"Yes ; has been, is, and always will be!!! She is truly an ugly American.","commenter_a":"Nice eyebrows, plucked clean and then painted on............banchee","post_message":"Michelle Obama wants to destroy Halloween for kids across America.  There is no chance that we will let her take Halloween away from our kids.  Do you think Michelle Obama is a joke?"},{"comment_id":"688602181316881","commenter_b":"Bitch bye","commenter_a":"@username smh","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"10154413967139087","commenter_b":"The British started this mess, no one including the US wanted this \" trash of Europe so they found a desert to dump them in, let get along or die, who cares, why do we have to pay for these spoiled perpetual \" victims \"","commenter_a":"Israel will never be at peace, if they don't work for it. Sorry about the comparison but that sounds like something Hitler would do, obliterating a group of people to put your own. Have you ever heard about Divine intervention? God doesn't like when you prosecute His children.","post_message":"#BREAKING: The Israeli government says it plans to move forward with the construction of thousands of settlements in East Jerusalem despite a U.N. Security Council resolution demanding an end to settlements in the occupied territories."},{"comment_id":"883464781688982","commenter_b":"Research empathy Roger.. Apply it sometime.","commenter_a":"Just want to say that in your standup you talk a lot of trash about white people and shootings if I do recall correctly. So is racism just a white problem but black stand up comics are not. Check yourself before you tell me to check mine.","post_message":"It's not that easy to forget.  Do you think racism still exists? Let us know: @webpagelink"},{"comment_id":"1867778023454493","commenter_b":"Yeah, all those vacations, all of that golf. It must have been a real bitch.","commenter_a":"Yes We Can dear President Obama and Yes We Will. Thank you for your service and your hard work for this country, against the constant and relentless Republican opposition, dissent, disrespect, hatred and racism.","post_message":"\"I'm asking you to believe... YES WE CAN!\"  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1096660043788412","commenter_b":"A woman President, fine, BUT NOT HITLERY!!!","commenter_a":"It turns my stomach to think of Hillary as president","post_message":"\"Madame President Hillary Clinton.\"  Do you like or dislike the sound of that?"},{"comment_id":"10154534701938271","commenter_b":"Those seven countries on which the president issued the TEMPORARY ban weren’t picked out by him. They were picked in 2015 and 2016… by the Obama administration. Trump doesn’t even list those nations specifically in his executive order, he simply lists that he’s banning those nations named in the Terrorist Travel Prevention Act of 2015. ---> @webpagelink Trump’s TEMPORARY order specifically states that only refugees from 7 countries with ISIS controlled regions. (Syria, Iraq, Iran, Libya, Somalia, Sudan, and Yemen) ONLY AFFECT 12% OF THE WORLD’S MUSLIM POPULATION","commenter_a":"President Obama issued an order similar to President Trump’s in 2011 in response to a discovery that a known terrorist had entered the United States via the nation’s refugee program. It seems that much of the country’s forgotten about that, though even President Obama, himself, apparently.","post_message":"Obama's statement said he is \"heartened\" by citizens' civic engagement, but reiterated that policies should not discriminate against people based on religion."}]
