[{"comment_id":"904173296345590","commenter_b":"For the amount it too severe a sentence","commenter_a":"YES!!!!!","post_message":"Weldon Angelos is serving a 55-year-term for the sale of about $1,000 of marijuana. By the time he's out, he'll be in his 70s."},{"comment_id":"10153706895136680","commenter_b":"Go to hell","commenter_a":"We should be afraid of those 'people' who are different, they're culture and values are incompatible with western cultures and values, they claim their holy book teaches that we must convert of they must kill us... Sounds like these 'people' are going to be a great fit in our country... A nation that was built of immigrants who DID assimilate and welcome the new culture and values of the country they moved too","post_message":"New York Governor Andrew Cuomo says Donald Trump's campaign message is: \"Be afraid of people who are different.\""},{"comment_id":"909912449057779","commenter_b":"She is a CRIMINAL LIAR !!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Poor, really, couldn't they spell abysmal?","post_message":"Well if the shoe fits..."},{"comment_id":"10153843599995796","commenter_b":"@username - did white privilege cause 360,000 Union soldiers to die fighting to free the slaves?","commenter_a":"Black lives matter is a racist (by definition) organization funded by George Soros to spread a false narrative, agitate and wreak havoc. People who fall for it, like Ms. Hathaway, are never interested in \"having a conversation\".","post_message":"\"I believe the Black Lives Matter movement calls on us to acknowledge our white privilege and its unfairness, to listen to the lived experiences of our darker brothers and sisters and to help them to achieve a world in which people of all shades live in safety,\" Julia Hathaway writes in her OpEd."},{"comment_id":"10153468910666037","commenter_b":"Kids from low income communities and families qualify for free college education through goverment grants and programs... some choose to use those programs to better themselves and their famalies... others would rather point fingers and blame others... the only person to point the finger at in a capitalist society is the dude in the mirror because you can truly be anything you wanna be if you want it bad enough...","commenter_a":"This is awesome... more boots on the ground hopefully with the full support of the community and politicians to clean the crime up on the streets of this country... Every single city should follow in their footsteps!!","post_message":"The country's largest police force says it will also hire 400 administrative aides to take over desk jobs, which will free up more officers to walk the streets for community policing."},{"comment_id":"10154244908884778","commenter_b":"So even if u were be low society's best u would deserve to die ? That's where we should bring some type of responsibility to the government for bringing drugs into this country in order to rid certain races but we don't punish the king pin we look down on those trapped by the government SMDH!! Wake up people white black Puerto Rican Asian r all using drugs of some sort the majority of those being punished are black people & this has been going on for decades!! SLL LIVES MATTER @username I guess you & all your family is perfect so go to work or at least get off my post","commenter_a":"That's a COP OUT pun intended !! Those officers need to be accountable for their actions!! Money won't bring Freddie Gray back SMDH","post_message":"#BREAKING: Baltimore officials came to a $6.4 million wrongful death settlement with Freddie Gray's family on Tuesday, our news partners at the Washington Post report."},{"comment_id":"1144542405568548","commenter_b":"@username bull","commenter_a":"Hilary should start a new centrist party for disenfranchised republicans, and the DNC should back Bernie. He stands for unions, while she slept thru Walmart union negotiations and stayed mute. He marched and protested for civil liberties while she was a Goldwater Girl. And the Clintons made shady insider trading deals with Tyson way back in the day to kick start their career. The only thing that makes her a democrat is her stance on women's issues. When it comes to war, trade agreements, corporate welfare, and dark money, she's a republican.","post_message":"\"That's what the American people are saying.\""}]
