[{"comment_id":"1001794969843293","commenter_b":"Feminism is cancer.","commenter_a":"Sorry lady but I put my arm around my wife because I lover her. She does the same to me and we have been married for 49 years. Maybe you ought to try a little bit of love instead of hate.","post_message":"The Dame has spoken."},{"comment_id":"10153440650715329","commenter_b":"What the fuck? Did you just call yourself a whore?","commenter_a":"This chick needs to get over herself. My mother was a lathe oporater at a pipe yard in the 70's and never whined about the way she was treated. Obviously this girl ain't from Texas. Suck it up buttercup.","post_message":"preach"},{"comment_id":"963844390305083","commenter_b":"Atlanta housewives just ratchet!","commenter_a":"We got housewives of Orange County, Beverly Hills, And New York. Those women act like straight up fools. I'm wit you Lisa Ray but Uhmm hey morals are out the door when it comes towards cashing in","post_message":"She says she's trying to bridge the gap between \"us sistas,\" not take part in some of the controversial reality shows out there."},{"comment_id":"10154228719381545","commenter_b":"I, personally, am quite capable of disliking people of ANY color, @username, if the person deserves it. Stop with the cries of racism because somebody doesn't like a person born with more melanin. I would despise that woman if she'd been born gold-leafed. You're a relic. 'Cut it out.'","commenter_a":"I for one can't wait till they are gone. The money she spent from our taxes is overwhelming. And her lavish vacations are a discrase. I could go on bit I will stop there. Good bye get out!","post_message":"There are certain words that have been used to describe Michelle Obama: Open. Authentic. Unapologetic. It’s that last one that Oprah Winfrey zeroed in on."},{"comment_id":"753100741547170","commenter_b":"That whore cares so much about the us she built a school in Africa!!!!","commenter_a":"Fuck that","post_message":"Obama Wants To Put Oprah Winfrey’s Face On The New Dollar Bill.  This is ridiculous. Leave the dollar alone.  Do you think they should get the dollar bill as it is?"},{"comment_id":"1040915009338084","commenter_b":"@username your argument fails in a few ways. 1. A child is not a child until it is born. 2. Her body, her right. 3. What if she was suffering complications from said pregnancy? What if she was raped? What if it was incest? Would you still argue that she hasn't the right? Because if so, you're giving a living woman less bodily autonomy than a corpse.","commenter_a":"good","post_message":"There has been no time since Roe v. Wade when abortion hasn’t been under attack... But this moment is different."},{"comment_id":"10153415193876833","commenter_b":"I no Right, They Don't Want The Public Safe!!!!!! Then the Rioters and Looters would be Looting and Rioting even More and getting away with it as always!!!!","commenter_a":"Does this mean our murder rate will plummet because the gang members won't have guns?","post_message":"The U.S. Seventh Circuit Court of Appeals issued a decision on Monday allowing a Chicago-area gun and magazine ban to stand. Such bans are justifiable, according to the court, merely on the basis that they \"may increase the public's sense of safety.\""}]
