[{"comment_id":"635686593246783","commenter_b":"@username As much as you might want there to be, there is Nothing wrong with Hillary's e-mail account! Just ask Colin Powell and Condoleezza Rice, who operated the same way.","commenter_a":"if I vote, I want it to count and be counted, that's the promise, Every Vote Counts, well except when Bush was elected","post_message":"It is probably way overdue.  Conservatives Are Destroying Our Future"},{"comment_id":"10153302851129087","commenter_b":"@username Medicare advantage.","commenter_a":"The ACA made billions in cuts to medicare.......","post_message":"\"[W]hy do Republican politicians keep bringing up the idea of cutting or eliminating Medicare, a losing proposition among every voting group, including Republicans?\""},{"comment_id":"10153148951881990","commenter_b":"We should be worried about radical christian terrorists over some fake conservative progpaganda!! She can't fight for a lick of her life. Send her and all the Trump Supporters to fight ISIS or read the Koran. Stop the hate and be united...","commenter_a":"When your at a park you just want to be at peace not here anyone's religious views STFU! By the way they were not praying they were volunteering as bike stands and the lady was giving and example of white trash that needs to be recycled...please find humor in the worst of situations...or just stay angry all the time and keep saying this country is going down the drain","post_message":"Park police are recommending misdemeanor battery charges against a woman caught on video making anti-Islamic slurs then throwing coffee and an umbrella at a group of Muslim men. The woman works for California Department of Corrections: @webpagelink"},{"comment_id":"870170056373024","commenter_b":"Illegal aliens yes. Immigrants that come in legally and get properly documented should be allowed work as long as they don't have a disease or criminal record.","commenter_a":"Me too","post_message":"71% of voters said they would be in favor of Congress passing a law making it illegal for businesses to hire illegal aliens. Don't you agree?"},{"comment_id":"1254836874556782","commenter_b":"@username vote blue no matter who.","commenter_a":"Don't forget he also enjoys killing animals in Africa for fun, like elephants! And proudly posing for a picture with severed trunk. If that's not a dick, I don't know what is.","post_message":"Wow. Just wow."},{"comment_id":"1849193665299183","commenter_b":"White people are the biggest thieves known to man","commenter_a":"@username. as u know donny is completely unfit ...u dont care about your grandchildren smh sad","post_message":"WATCH LIVE: Electors are casting their ballots — will Donald J. Trump get the 270 he needs?"},{"comment_id":"10154044912016756","commenter_b":"Heterosexual couples also have anal sex.","commenter_a":"Anal sex greatly increases your chances of catching aids.","post_message":"A Christmas Eve first date. A Christmas proposal, three years later. And now, a first Christmas with their son."}]
