[{"comment_id":"1153775948001804","commenter_b":"She's still a turd.","commenter_a":"Nancy, your a turd!","post_message":"“Lady Justice has on a blindfold because all victims and all defendants are to be treated equally under the law,\" says Nancy Grace."},{"comment_id":"1174568802605235","commenter_b":"They are not Isis,just Philly scumbags ,perpetrating a fraud. shoot them violent criminals have no place on our planet","commenter_a":"We are at war people. It's gonna be us or them, I'm stocking up, bigtime.","post_message":"In Philly,  this group of MUSLIM thugs ATTACK patrons and yell \"We Belong To ISIS\"  Obama has imported over 1 million muslims since he became president... 'FUNDAMENTALLY TRANSFORMING AMERICA!'  Let's GET 5000 SHARES if we should BAN Muslim Immigration!"},{"comment_id":"10157640587160615","commenter_b":"#NeverHillary #BustTheDuopoly! She cares nothing for the populance as a whole and her smug haughty stance of needing a public and a private stance politically make me sick. Tack on her criminal past, and right wing agenda, and you bet your ass no progressive should consider voting for that pandering shill. Im done voting for a lesser evil, and will stay vigilant in ensuring a third party gets political funding, and grassroots activism because our system and the Dempublicans are controlled by a criminal elite and they are the enemy of Liberty, Justice and Freedom! #JillStein2016 #GreenNewDeal","commenter_a":"Down","post_message":"This Just In –"},{"comment_id":"10153187072706107","commenter_b":"How about a constitution change that says if both of your parents are illegal then you're illegal even if you're born here. No more anchor babies. No dream act, no in state tuition, nothing. The illegals are a slap in the face to the people who are legally trying to immigrate.","commenter_a":"Good Paul!","post_message":"Just minutes ago, on Fox News' On the Record, I announced I will introduce legislation this week to cut off ALL federal taxpayer funding for so-called \"sanctuary cities\" -- until they start abiding by federal law.  For taking this stand, I know I'm going to be attacked like never before.  But I think it's high time someone did something!  The truth is, for years politicians in BOTH parties have promised you and me secure borders.  But all we have to show for those promises is sheer lawlessness.  This President has time and again sought to go around Congress with illegal and unconstitutional executive actions regarding immigration.  And now many American cities are following in lockstep in open defiance of federal law!  These so-called \"sanctuary cities\" prohibit the use of funds to enforce federal immigration law, usually banning officers from even asking about a person's immigration status.  These cities become magnets for illegal immigrant criminals and gang members who have been deported multiple times, but know they're safe if they can just stay within a city's borders.  This can't be allowed to stand.  Not when we know terrorist organizations are looking at our porous southern border as a way to gain entry into the United States.  Not if we are to save the concept of rule by law.  My bill would end all federal taxpayer funding for these cities until they start ENFORCING federal immigration law.  I know these cities will shriek and moan that there shouldn't be any strings attached to all of your tax dollars.   They'll say they're entitled to pick and choose what laws they recognize.  And you can bet our national media will be on their side, and come after me with everything they have.  But it's time politicians cared more about keeping their promises to the American people than what our national media says.  If you agree, I need to hear from you right away.  Please sign your \"Enforce Immigration Law\" petition and agree to your most generous contribution of $20.16 IMMEDIATELY: @webpagelink"},{"comment_id":"10152797088006051","commenter_b":"Burn em all down. And roast a pig in the process.","commenter_a":"That is deplorable. He is entrusted to safeguard civilians, he does not have the right to pick and choose based on his personal beliefs and bigotry. One cannot condemn an entire religion because of a group of extremist radicals. EVERY religion has its bad...Catholics raping little boys, Christians murdering and blowing up abortion doctors and clinics. With the hateful logic all mosques should burn, burn all churches as well, right? I so sincerely hope he is removed from his station. Hate begets hate.","post_message":"This fireman tweeted out the first thing that popped into his head when he heard that an Islamic Center was on fire."},{"comment_id":"10153139326127293","commenter_b":"just facts he was no hunter just by what was done and his lousey shooting . he had no business hunting.","commenter_a":"he didnt know what he was doing and the guides were obviously dirty.","post_message":"How a dentist who killed Cecil the lion shelled out $50,000 for the trip."},{"comment_id":"845581582242351","commenter_b":"Dyson is a racist pig ! Don't let the media try to take the spotlight off of Hillery ! She is the CRIMINAL !","commenter_a":"The pits of academia!! But good students will learn despite him.","post_message":"This outburst would be laughable if you ignore the fact that he's a \"respected\" professor who gets to go on TV and say this."}]
