[{"comment_id":"1583527538618276","commenter_b":"Muslims please go back to your hell hole, you only make demands, cause problems , and bring terror","commenter_a":"You have freedom of religion in this country not freedom to shove your beliefs on others.","post_message":"They're not afraid of offending anyone, they stand behind their beliefs.  Do you agree with Lowes?"},{"comment_id":"10154744245648812","commenter_b":"If these thug out moms stop killing their kids everyday in the dam news","commenter_a":"And not one BLM protester was there. It's glaringly obvious that black lives really don't matter to them when it comes to black on black violence and by the way...contrary to popular belief and as told by one of those protesters black on black violence is not a myth, it is real and one should look no further than Chicago to see that black on black violence continues to rise at a rapid rate.","post_message":"Chicago saw its bloodiest month in two decades this August, with 90 murders, 384 shootings and 472 total shooting victims."},{"comment_id":"10152849864834342","commenter_b":"Woman can be evil also.","commenter_a":"Sad.","post_message":"Rebekah Holly Speer, 36, is charged with cruelty to animals after authorities say they found several dead dogs -- at least one shot and stabbed -- at a home in the 3500 block of Deep Anchor Way"},{"comment_id":"10153294684803132","commenter_b":"This witch is EVIL!","commenter_a":"She should be charged with murder.","post_message":"\"When he actually started to carry out the act, he got scared again and exited his truck, but instead of telling him to stay out of the truck ... Carter told him to 'get back in.'\""},{"comment_id":"1164001233718693","commenter_b":"Come on bitch follow the dress code","commenter_a":"Justin Drake pleaaaaase go off on her for being annoying","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."},{"comment_id":"1604700786499928","commenter_b":"@username ..more lies more propaganda blame islam,muslims..stop your fake and baseless propaganda..by 1890 jews were 5%in palestine...after belford declaration in 1917,they stormed to palestine,by 1935 jews were 25%..1946,47 32%to38%.these zombies invaded from europe.. caucasian zombies,khazars.go back to your daddys land with your fake hasbara propaganda..","commenter_a":"Hamas regime- is the selfish terror group from gaza that committing ruthless tactics against humanity and uses his people as Human shield..Hamas keep launching terror attacks and firing thousands of rockets into Israeli towns to kill civilians. Hamas terror regime is still smuggling heavy weapons into Gaza. They are also killing and torturing Palestinian opponents and using the USA and international aid to buy weapons and build more terror tunnels, Which worth millions of dollars..","post_message":"A spokesperson for the Palestinian health ministry says 17-yo Palestinian youth injured during Sunday night's raid @webpagelink"},{"comment_id":"10153013974226323","commenter_b":"Sam Dean Errrrrrrrr orthodox jews DO go around killing people and they are not fussy if it is children!. They have been doing so for decades while the world turns a blind eye to Israeli atrocities.But then probably too busy reporting extremists who are the minority in comparison.","commenter_a":"If a Jew does such things he is orthodox but if a Muslim happens to to involved in such things he is 'an extremist and even terrorist.Sheer madness and discrimination against female gender in Israel is DECENCY and MODESTY whereas a fraction of such acts in Muslim society is viewed and portrayed by so called free media as brutal discrimination against women .","post_message":"Something is missing here..."}]
