[{"comment_id":"1758834931015826","commenter_b":"A dude with a dick is what he is!!! Let's call a Ace an Ace & a spade a spade now!!","commenter_a":"Oh fuck this bullshit! Enough already! You're a chick with a dick we get it, not the first, nor the last. Ever been to fucking Thailand? Loaded with these fuckin things. Better looking too.","post_message":""},{"comment_id":"1247455158641980","commenter_b":"She's such a nasty woman!","commenter_a":"guess she needs to be held for terrorist threats","post_message":"MADONNA Tells Feminazis At DC #WomensMarch: \"I Have Thought an Awful Lot About BLOWING UP The WHITE HOUSE\" [VIDEO] @webpagelink"},{"comment_id":"1805658249719321","commenter_b":"Me muero!!!","commenter_a":"@username tu sueno","post_message":"Watch 23 adorable pandas make their public debut. @webpagelink"},{"comment_id":"10154010743370329","commenter_b":"Ooh I didn't know there would be another season?! Thought it was over!","commenter_a":"@username Aimee Fortune Jade Morgan @username","post_message":"Watch the first four minutes of the next season of Pretty Little Liars right now!"},{"comment_id":"989149777896374","commenter_b":"Es ist wie . Die REICHEN WERDEN IMMER REICHER UND DIE ARMEN IMMER . Die Schere geht immer weiter auseinander.....und dann sind die Leute noch so naiv und w diese Typen, die keine Ahnung haben, vom wirklichen Leben. ....und Leute wie Bernie Sanders, l man fallen.","commenter_a":"Raising wages does absolutely nothing. If you raise minimum wage to the argued $15 an hour, you would have to raise everyone else's wages the same percentage. Now that it costs more to pay workers, manufacturers now have to increase retail prices to make up the difference. This achieves nothing and you're back to square one. You get paid more, but products cost more. 1 to 1 is the same ratio as 4 to 4. Paying more money for the same exact thing is the precise definition of inflation. This mind set is why recessions exist in the countries that follow this policy.","post_message":"The Walton family, the owners of Wal-Mart, is the wealthiest family in America. Middle class taxpayers should not have to pay billions more in taxes in order to subsidize the wealthiest family in America. That's absurd."},{"comment_id":"1727638077485478","commenter_b":"Theyre cool. But they claw into you. Very clingy animals","commenter_a":"@username this is why i wana go Australia - want one asa pet lets get one","post_message":"Koala joey plays in baby basket. Via Symbio Wildlife Park"},{"comment_id":"10153416798099060","commenter_b":"I think they should be sent back to Africa. If they are fleeing Africa for political reasons, or because they fear for their lives, then and only then might they have a valid claim to stay in Europe. But if they're just fleeing because they're poor, they should move to Europe legally, or simply make the best of what they've got in Africa. Tough titties. That's just how the world works.","commenter_a":"never mind the consequences huh i bet those negotiating got paid well with plenty of overtime","post_message":"153,000 migrants have crossed into Europe this year alone, an increase of 149% on 2014. Yesterday, after seven expletive-laden hours of debate, European leaders forged a disappointingly modest resettlement agreement. @webpagelink"}]
