[{"comment_id":"759110204189419","commenter_b":"@username Don't come to America, lol","commenter_a":"Here's a counterpoint. If you un-sexualize all body parts no one will want sex as, hey that's just a hand and that a boob and that a....Well maybe this is what we need then to decrease the enlarged...population, LOL! Truth is, I don't respect anyone who sells themselves. Even a little bit.","post_message":"Women everywhere are freeing the nipple but Facebook doesn't want us to show it. #MicCheckDaily"},{"comment_id":"954073617997796","commenter_b":"Hate speech. What a classy woman....","commenter_a":"She makes Sarah Palin look smart","post_message":"Absolutely abhorrent."},{"comment_id":"10153410031966615","commenter_b":"Oh man. This breaks my heart. I FOUGHT for my baby to live and can't even begin to imagine this happening to my children. :(","commenter_a":"Horrible story, horrible people to treat their kid like that. But I still can't figure out where was that carseat? Is it so hard for wpxi to say if carseat was in the car or in the house? Every time I read the story it just says child was left in carseat.","post_message":"BREAKING: The parents of a 23-month-old girl who died after police said she was left in her car seat for 13 hours have been arrested -- and will face homicide charges. WPXI Cara Sapida is talking with police and will have the latest on Channel 11 at Noon."},{"comment_id":"10152702805232452","commenter_b":"No!!! Go away. ...far away","commenter_a":"Crystal Porras...No!!! Not SB!!","post_message":"A person who was being monitored by the Santa Barbara County Public Health Department for Ebola was being taken Sunday night to a Los Angeles area hospital as precautionary measure after displaying signs of illness. @webpagelink"},{"comment_id":"1031214057011772","commenter_b":"Keeps women from cheating lmao","commenter_a":"So, she wants to be registered, heavily taxed, and locked up at night?","post_message":"Pure gold..."},{"comment_id":"10153572594101051","commenter_b":"Gee, did you even graduate from high school????!!!!! You foul mouthed witch!!!!","commenter_a":"I dont blame them!! It probably sickens them that crazy angry trump uses their music while he talks his trash!!","post_message":"One of the world's most legendary rock bands just told Donald Trump they want nothing to do with him."},{"comment_id":"900706196692300","commenter_b":"So, David, share some more of your white Texan wisdom. What is a \"real woman.\" Please, mansplain it to us.","commenter_a":"I still have trouble with why anyone would want to become an elderly woman.","post_message":"\"I think [Bruce] Jenner has a right to do what Jenner wants to do, and the way Jenner wants to do it.\" -Jeffrey Tambor"}]
