[{"comment_id":"10153979531201680","commenter_b":"WARNING ! NEVER NEVER HILLARY ! America will have a very dark future /nightmare and dangerous as hell if hillary get elected. Note : RADICAL MUSLIMS, ISIS , TERRORISTS ARE PRAYING FOR HILLARY TO WIN SO THEY CAN DESTROY THIS COUNTRY AND YOU. Transcription of Brain Carn’s Prophetic Word for 2016 “What happened in California would become common place in America, and an event worse than 9/11 is coming to America. The Lord says that Islam has a definite problem. They will never shake this reputation of violence from themselves. Even innocent Muslims will endure hardship and persecution in the future and no longer see America the same. @username Muslims are gonna begin to gather to cities, like Dearborn, Michigan, and form new communities that contain the populous of their presence so as to guard the backlash from White Patriotic America. The Lord says that a witch hunt will be ...","commenter_a":"Says he wants to \"drain the swamp\" but brings out all of the old alligators and crocodiles from years ago-Newt, Rudy and Kellyanne Conway, whose husband was an advisor to Paula Jones!!! Listening to Conway is like listening to someone scratching fingernails on a chalkboard-very annoying!!!!!","post_message":"The race is deadlocked despite a Clinton advantage in early voting."},{"comment_id":"1015033255223089","commenter_b":"Tariq doesn't represent the real moderate Islam at all! I am Muslim and I do advocate humans rights no matter what sexuality, religion or colour they are","commenter_a":"I dont like ISIS but they did a very good job by killing the gay... Same sex is not permitted in any Heavenly Religion","post_message":"Blindfolded, bound and brutally murdered"},{"comment_id":"632506653599570","commenter_b":"Montreal did not support his effort to start a war","commenter_a":"What mosque shooting in Montreal? That never happened. You guys were pretty quick to condemn Conway for her comments about Bowling Green, yet you don't even know where the mosque shooting occurred.","post_message":"We couldn't agree more. Image by Occupy Democrats, LIKE our page for more."},{"comment_id":"10153576810758984","commenter_b":"Lot of good women out there but she's not one of them!!!","commenter_a":"Hillary is another Obama in a pantsuit. Maybe even worse! PPL didn't listen when Obama was exposed..... Will they listen now about Hillary?????","post_message":"I watched this over and over again to try and figure out what Hillary possibly could have been thinking. I'm still stumped. Like the news anchors reporting on this did, all I could do was laugh... Do you want to see Hillary suffer a resounding loss in 2016?"},{"comment_id":"891767890959271","commenter_b":"She is so evil ...","commenter_a":"Ps..any one remember Al Gore and how graciously he accepted defeat..and why would HIllary allow science and fact to get in the way..","post_message":"Fact-Check: Hillary Clinton’s claim that partial birth abortion should be protected due to a number of women who have serious health issues is not supported by research."},{"comment_id":"10153828127059749","commenter_b":"\"...coming to a fridge near you.\" No! No it's not! I don't associate with those they of people!","commenter_a":"George had this idea decades ago in form of Pudding skin singles :D","post_message":"We have reached new culinary lows."},{"comment_id":"1270740256295648","commenter_b":"* \"You shut your whore mouth!\"","commenter_a":"Shut your damn mouth.","post_message":"We're going to talk about this one for a while."}]
