[{"comment_id":"998442540272524","commenter_b":"She is bought and paid for and if she's president what happens then?","commenter_a":"She's a crook and lies about where money comes from and buys the illegal immigrants vote","post_message":"By the way, it ILLEGAL for foreign nations to influence the outcome of an election. Just so you know. @webpagelink"},{"comment_id":"10154244908884778","commenter_b":"So even if u were be low society's best u would deserve to die ? That's where we should bring some type of responsibility to the government for bringing drugs into this country in order to rid certain races but we don't punish the king pin we look down on those trapped by the government SMDH!! Wake up people white black Puerto Rican Asian r all using drugs of some sort the majority of those being punished are black people & this has been going on for decades!! SLL LIVES MATTER @username I guess you & all your family is perfect so go to work or at least get off my post","commenter_a":"That's a COP OUT pun intended !! Those officers need to be accountable for their actions!! Money won't bring Freddie Gray back SMDH","post_message":"#BREAKING: Baltimore officials came to a $6.4 million wrongful death settlement with Freddie Gray's family on Tuesday, our news partners at the Washington Post report."},{"comment_id":"10152653934397169","commenter_b":"A woman should never lose her chic!","commenter_a":"Go girl!","post_message":"Part of a growing trend of older fashion icons:"},{"comment_id":"1043167352401972","commenter_b":"She needs to be fired.","commenter_a":"Again I say\"get rid of her\". There are many patriotic qualified principals out there.","post_message":"A New York school principal has banned the Pledge of Allegiance, Thanksgiving and Santa. The school's PTA president Mimi Ferrer told 'Fox & Friends,' \"We are in America. We're supposed to be proud of where we are.” @webpagelink"},{"comment_id":"10153149843920090","commenter_b":"NOT this woman ;)","commenter_a":"too bad all the women will vote for her, for no reason other than shes a woman, like the minorities voted for Obama...with no reason other than he is black","post_message":"Share this with your friends & neighbors—take the pledge to Stop Hillary! Start here: @webpagelink"},{"comment_id":"1137251062961589","commenter_b":"Hillary Clinton for President!","commenter_a":"Hillary 2016... and trolls in 3.2.1..","post_message":"The 2016 Democratic candidate said that incomes have stalled even as corporate profits have skyrocketed, creating inequality that is \"a drag on our entire economy.\""},{"comment_id":"10154133163039032","commenter_b":"Ohhh waaaa, namecalling hurts soooo bad, better to be a pig and be free than to be \"hip\" and be a socialist. Again libtards are so out of touch with reality its scary, you all hate this country and the constitution but yet none of you have lived in anoyher country to compare. Like I said, try living in China or Cuba, or Greece, or Russia if you all think big government and socialism are so great. Btw, name calling and insults mean nothing.","commenter_a":"To the guy with \"the america was never great\" sign, why don't you go live in another country for awhile and then come back and waive that sign. Scary how delusional some people are.","post_message":"Music, signs and lots of confrontation between Trump protesters and rally attendees in Prescott Valley. @webpagelink"}]
