[{"comment_id":"10154771811749411","commenter_b":"Basket of this, Bucket of that...Ms. Clinton seems to have a container to stick all of us in. Apparently, we're not much to be concerned about. To my mind she's a big pile of ***t,...bring your own shovel. No need to place her in an urn or other bucket-like container, just toss it in with the other compost and let her continue to decompose.","commenter_a":"I've seen a number of articles on \"alternative\" news sites claiming wikileaks is falsifying all this stuff. Kind of sad that people would go so far to bury their heads in the sand rather than even consider the thought that a candidate which rigged a primary is capable of so much more. #HillaryforPrison","post_message":"The sheer number of insults in the email trove has left the Clinton campaign unable or unwilling to respond."},{"comment_id":"10154736458587300","commenter_b":"Clinton's own faith says she should not be elected. For it is told in the bible, \" For the love of money is the root of all evil; which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows.\" ...and Jesus said to the Money Changers that his house was a house of prayers and they had made it into a den of thieves\" There is no Baptist, Catholic, or any other Christian that should be voting for Hillary Clinton. Next class...Murdering children in the womb!","commenter_a":"Geraldine Donze Berlingeri this is amazing mom!","post_message":"Protons destroy cancer cells while avoiding healthy tissue and minimizing side effects."},{"comment_id":"1195181073877040","commenter_b":"Kick her ass out","commenter_a":"What does Jesus tell us about judging others. I get what your saying, but look in the mirrior and pull the plank out of your own eye before pulling the spec out of anothers. Peace","post_message":"Do you think she should be KICKED OUT of the Olympics??"},{"comment_id":"10153612165593984","commenter_b":"My, my, my....Welcome Home....but, don't ever come back!!!!","commenter_a":"Way to go kenya","post_message":"Wow. These 10 million Kenyans just sent Obama a VERY bold statement about his visit... they aren't pulling any punches.  Obama needs to pay attention to this...  Good for Kenya..."},{"comment_id":"10153720250674877","commenter_b":"And then his white gf walks in the video shot. Lmao","commenter_a":"He's a confused brother. I'm sad for him","post_message":"Black cop’s pro-Trump, anti-protester video goes viral: I felt safe with Trump fans!  Grio fam, what do you think of what he has to say? Would you feel safe at one of these rallies?  Share your thoughts below."},{"comment_id":"1191489804269278","commenter_b":"angelina illegal aliens? they want nothing more than death? you are so ignorant!! i dont recall illegals shooting up schools bombing up marathons or commiting any acts of terrorism. People like you make me sick. People dont come to this country to just commit crimes they come the same reason you or your ancestors came. your opinions are ignorant af","commenter_a":"America is now the land of sore losers and cry babies!!!","post_message":"Workers remove the Trump signage from 3 Trump Place apartment buildings in New York City after successful petition calling for removal. @webpagelink"},{"comment_id":"1759120751072019","commenter_b":"I don't want refugees coming in and I want Muslims out","commenter_a":"Wear a Make America Great Again hat! Fuckem!","post_message":"This was powerful!"}]
