[{"comment_id":"1704858546467924","commenter_b":"Ha-Ha! She is starting to look like James Earl Jones. Too bad she's a dumbass.","commenter_a":"Black Mrs Potato Head. yikes.","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"},{"comment_id":"1242392142481615","commenter_b":"Scumbag.","commenter_a":"Is that hair under her arm. Yuk!","post_message":"TRASHY, AGING Pop-Star Madonna Uses Picture Of Pubic Hair To Recruit Females For Anti-Trump Inauguration March  ***WARNING***Picture contains partial nudity."},{"comment_id":"1179483682071660","commenter_b":"And what is going to stop the criminals from getting guns????? All a gun ban would do is disarm us everyday, good citizens who want to protect ourselves from THE CRIMINALS with guns!!!!!!!","commenter_a":"Stop protecting guns over people. The NRA is laughing at you people every time you defend a gun over a life.","post_message":"A gunman opened fire on a reporter and cameraman during a live television broadcast in rural Virginia."},{"comment_id":"10153489348776756","commenter_b":"Only a woman could find something completely fucking trivial to bitch about a great thing.","commenter_a":"#FirstWorldNonProblems","post_message":"\"Can I just passively refuse to pass the beach balls back up until they collect around my feet in one incriminating pool? How coldly can I glare at the people who try to resurrect the beach balls I've silently condemned to the ground?"},{"comment_id":"1610489359249521","commenter_b":"Maybe she'll have a stroke.","commenter_a":"She has RECENTLY HAD 2 BLOOD CLOTS ON HER BRAIN, FROM WHEN SHE FELL AND HIT HER HEAD. SHE IS EASILY CONFUSED, STAMMERS, SHORT-CIRCUITS , AND IS DILLUSIONAL. She is not well. \"THOU SHALL BEHOLD AND SEE THE REWA.RD OF THE WICKED\" !!!!!! Psalm 91.","post_message":"Hillary Clinton apparently needed assistance standing up at a rally."},{"comment_id":"727863887335286","commenter_b":", WRONG, No way, get real, he had every right as well as a duty to make the case of Israel to America's ears. I learned more from his talk then from our ever non-transparent utopian president who believes the world will all sing kumbaya together because of his ever lovin idealistic, progressive, warped world view.","commenter_a":"Tha.no Mr john Boehner for inviting The PM. Thank you","post_message":"Do you agree? Jerusalem Post \\\\ Opinion & Blogs"},{"comment_id":"1566280200058671","commenter_b":"@username stop arguing with fools...","commenter_a":"It is being stolen. We have a President that won a large majority, that has high approval from Americans, and the GOP says it should be up to the guy that won a minority in an incredibly low turnout election.","post_message":"\"It's being stolen from the Obama administration and the construct of our Constitution. And it's being delivered to an administration that has no right to fill it.\""}]
