[{"comment_id":"765017110298136","commenter_b":"I agree. That would stop illegals dead in their tracks!","commenter_a":"If they would allow the soldier to shoot that vermin off the fence, that shit would end","post_message":"For some reason, this truth is lost on liberals, but what isn't?"},{"comment_id":"10154609681272300","commenter_b":"Actually she was not fat. The rules do not say you have to be a size 2.","commenter_a":"trump has no room to talk about calling anybody miss piggy especially when he posts pictures of him eating Mcdonalds and KFC on his private jets.","post_message":"Donald J. Trump called her “Miss Piggy” and “Miss Eating Machine” because she gained weight after winning the Miss Universe crown."},{"comment_id":"1163546927012391","commenter_b":"Janette Smith just wow I can't even!! U are delusional do u have kids? I hope not","commenter_a":"I hope he escapes.","post_message":"MISSING: Louis Dean Rende, 12, has run away from his Spring Hill home. He is 4-foot-6, and was wearing a red or orange shirt, dark shorts, and might be wearing hiking boots. He has a scar above the right knee. If you see him please call 911 or the Pasco sheriff at 727-847-8102. Leave a tip at 800-706-2488."},{"comment_id":"511047909019803","commenter_b":"Throw that racist bitch out the door!","commenter_a":"BLM, Black Panthers, Farrakhan -- any of those available? Why would you not use them since you hold them in high esteem?","post_message":"Beyonce bashed cops at the Super Bowl but is now asking for their help. They want her to find a way to protect herself."},{"comment_id":"10153842113264877","commenter_b":"She need to go away!","commenter_a":"Is Sinead even relevant anymore?","post_message":"Arsenio Hall Sues Sinead O'Connor For Millions For Claiming He Fueled Prince's Addiction And Drugged Her. Read more on the lawsuit here.   Grio fam, what do you make of this lawsuit and Sinead's claims?"},{"comment_id":"10152878332246130","commenter_b":"It's always the ugly women throwing shade. This chick has a light-bulb-shaped alien head. #haveseveralseats","commenter_a":"She should never have apologized for anything.","post_message":"We're still cringing."},{"comment_id":"1207855142586053","commenter_b":"I was going to reply but you guys have it under control. Stupid bitch","commenter_a":"Hahahaha!!! So much for Freedom when you are forced to stand. If folks cant decide for themselves, then it isnt freedom. Im fairly confident my father died for her right to sit if she feels ashamed of her farce of a military...even when one is enlisted. (I eagerly await your ignorant attacks.)","post_message":"A Navy sailor made national news when she decided to film herself not standing for the flag. Now, she's in trouble... here's the swift justice she received.  Do you think she got what she had coming to her?"}]
