[{"comment_id":"10154899725050329","commenter_b":"All of those children have worked since before they were 16. A simple Google search would have told you that. I love how everyone assumes shit like this.","commenter_a":"I bet Ivanka or Donal Jr never humbled them selves like Sasha. It's obviously not about the money but about her learning the definition of hard work. @username Santiago Wolf @username","post_message":"'You ain't lying around my house all summer.' —FLOTUS"},{"comment_id":"914001441995307","commenter_b":"Awsome woman!","commenter_a":"Barry Sheldon this was what I was talking about earlier","post_message":"BREAKING VIDEO: Mother Beats Her Son When She See Him Rioting in Baltimore  Mother of the Year Award? She goes straight hood on her son.   @webpagelink"},{"comment_id":"547039675478904","commenter_b":"trump is not going to build a wall or deport. sorry","commenter_a":"Make America great again build that wall","post_message":"'I want America First - so do voters!'  Hear from Donald J. Trump tonight on protesters, the Indiana primary and more at 10p ET. #Hannity @webpagelink"},{"comment_id":"626503050873607","commenter_b":"Man she's one ugly silver back","commenter_a":"I am sick of all the threats and lies on FB have you no shame? This President only has a year to go what do you gain with the BS about him and his family. Crawl back in your hole!","post_message":"Michelle Obama was just hit with a multi-million dollar law suit for this reason.  Totally justified. She deserves prison.  Do you agree Michelle Obama is a criminal?"},{"comment_id":"1103976636304606","commenter_b":"Man says something about women in sexual overtone, people are 'Shocked and Disgusted'. Welcome to planet earth.","commenter_a":"Who cares?","post_message":"Sen. John McCain has withdrawn his support for Donald Trump following the disclosure of a video recording in which the candidate made lewd comments about women."},{"comment_id":"10153210594174270","commenter_b":"Every female to attempt the Marine Corps Infantry Officer Course...failed. And that's a fact","commenter_a":"Come on you all should know that males have to make second attempts at ranger school sometimes. This is not a female only type thing. Please for your sake do at least a google search of something before acting like only females get the second attempt","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10155541308376002","commenter_b":"'@username or we could use the same money they giving all folks coming here to do the same thing . Plus we want the wall and not these folks that want to blow us up .","commenter_a":"He has an issue with executive pen on immigration but no issue when Obama was doing it? Also this executive order is for 60-120 days same thing Obama did. Obama before he left slowed down Cubans to come in, President Carter sent Iranian students back during the hostage crisis. Hell my own grandparents in the 1900s came over and we're sent back to Italy. Rather fix the VA first then global problems second. Immigration isn't a right, my taxpayer dollars doesn't want to go to a bunch of illegals","post_message":"Senate Minority Leader Chuck Schumer is holding a press conference to demand the reversal of President Donald Trump's immigration ban.   You can watch the press conference live here:"}]
