[{"comment_id":"10154044362479024","commenter_b":"Let's cleanse American by not letting his sorry ass back into the USA","commenter_a":"tell Will Smith that we were here frist , and to fuck off","post_message":"With video. Bad things usually happen when leftists start talking about \"cleansing...\""},{"comment_id":"975170995873379","commenter_b":"Boo you whore","commenter_a":"She's still a total train wreck? What change?","post_message":"This medicine changes the life of anyone that uses it."},{"comment_id":"10153980272751943","commenter_b":"Why is she smirking???? Are they really that sure that they'll get away with their crimes??","commenter_a":"Hillary has such a ditz as chief of staff? She \"wishes\"? She \"never thought about it\"???? Totally lame-brain in her knowledge regarding working in such a sensitive area...... She plays dumb...","post_message":"Hillary Clinton chief of staff during her time as secretary of state, Cheryl Mills, said she simply never thought about the prospect that some of Clinton private e-mail exchanges wouldn be retained under federal records laws. \"I wish I had thought about that subset,\" Mills said in a deposition released Tuesday by the conservative government transparency group Judicial Watch. \"I wish I had thought about the fact that someone could be nongovernment and records might be not being captured. - via Bloomberg"},{"comment_id":"10152829806276636","commenter_b":"U can't find african american in this kind of situation coz they are at home just waiting for their money from welfare...since when african american have their sense of urgency in going to work?","commenter_a":"Ironically, wasn't there a case in US of an african american single parent who was desperate for a job, left her children (older than this one) in car in car park so that she could attend interview....put in prison and her children removed, that just doesn't seem very fair does it?","post_message":"He'd got half an hour to work before making the realisation..."},{"comment_id":"10154083377471433","commenter_b":"Good keep your foreign diseases in your own countries","commenter_a":"Oh you mean the country that out right said ....\"Death to America\"??? WHO CARES!!!!","post_message":"BREAKING NEWS: Iran suggests it will limit issuing visas to American tourists in retaliation for President Donald Trump's ban on refugees from Muslim-majority countries."},{"comment_id":"10153108575014726","commenter_b":"Obama working to hamstring America from fighting the Jihad @webpagelink","commenter_a":"obama is an appeaser and weakling","post_message":"WATCH: The Netanyahu speech that is throwing Obama off his game!"},{"comment_id":"1220979514606949","commenter_b":"That's always the answer huh fellas,if you feel this strong about it how about throwing some fist,oh I forgot you can't fight without guns.","commenter_a":"Until the authorities start treating these \"protestors\" Like the domestic Terrorists they are the riots will continue. And they will get worse! Time to take off the PC shackles and get down to business! It all starts from the top. As long as the Democrats are in the White House this will get worse. Elect Trump 2016.","post_message":"Many people have been arrested in Charlotte, North Carolina after the past several days of protesting and rioting. 70% of those who have been arrested have something in common, and it leads to a lot more questions about who is really behind all this..."}]
