[{"comment_id":"10153647495544877","commenter_b":"'@username is fine. Off subject. .but i had to get that out there. Hey boo...","commenter_a":"Let's try something new black America. Let's not break the law and put yourself in a position to get shot and I bet pretty good money u will live. Lol","post_message":"Thousands of Asian-American Protesters Rally in Support of Officer who Killed Unarmed Man in Housing Stairwell. Watch how it all unfolded below.   Grio fam, protesters said this is '1 Tragedy, 2 Victims.' What's your reaction?"},{"comment_id":"1242392142481615","commenter_b":"Scumbag.","commenter_a":"Is that hair under her arm. Yuk!","post_message":"TRASHY, AGING Pop-Star Madonna Uses Picture Of Pubic Hair To Recruit Females For Anti-Trump Inauguration March  ***WARNING***Picture contains partial nudity."},{"comment_id":"798927580297819","commenter_b":"What a mouth","commenter_a":"Run those @ssholes out of the country...!!! Freedom of speech does not include burning our flag...!!!","post_message":"Protestors Start Burning American Flags, Immediately Receive Instant Justice From Patriotic Bikers [VIDEO]   Click the link below to watch the full video    @webpagelink/  SHARE this if you support these patriotic bikers!"},{"comment_id":"10153544665036159","commenter_b":"about as transparent as a full inkwell","commenter_a":"Because all requests and responses must be vetted by the White House. Who would ever imagined!","post_message":"Transparency?"},{"comment_id":"10154843667759170","commenter_b":"I'd like to kick whoopi in her dick..","commenter_a":"Whoopi is downright rude to Conservative guests. She has no shame. Conway handled Whoopi's mockery and aggression with class.","post_message":"Oh yes. If you must go on The View, at least make the most of it and do this:"},{"comment_id":"10154089965446336","commenter_b":"Yeah, lice likes very clean hair. If you put products in their hair it's likely they won't get it. Oily hair care products are","commenter_a":"It's not super lice it's called...ignorance. Schools inform by sending a note that lice has been found in the classroom. The person is not identified at all..not even to the parent. Infested child goes untreated. Why? The same reason some are abused and some are not, the same reason some parents care about their children and others don't. Children are going untreated and/or not treated properly. This has been going on for years.","post_message":"What can you do if your child is affected?"},{"comment_id":"10154592681344445","commenter_b":"Yup, they are trying to invade the US as we type. Better build that wall.","commenter_a":"Now that half the Republicans in the house have been officially brain-washed, his confirmation will take place. This country will be taken over by Islam, when it happens. Bad news for women and gays.","post_message":"'I am confident he will serve the American people with integrity and a steadfast commitment to justice,' the president said. @webpagelink"}]
