[{"comment_id":"901967236585038","commenter_b":"she has blood on her hands !!! Bengazi !!","commenter_a":"AWESOME","post_message":"In the just out Fox News Poll, I easily beat Hillary Clinton - and I havn't even focused on her yet. On our way: MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1186141524764191","commenter_b":"That is right they would have convicted her already .","commenter_a":"IF there was anything to charge Hillary Clinton for related to Benghazi or her emails, (or anything else Fox Entertainment lies about) then wouldn't you think, after a decade of trying to convict her of something, the Republicans would have done it by now. There is NO basis to convict her of any wrong doing. The Republicans have lied about her for years and I'm sure they will continue. In the meantime I won't vote for anyone as repulsive as Donald Trump. He will, in my opinion, destroy this Country and our reputation around the World.","post_message":"How does this make ANY sense? From CNN: \"Donald Trump may say he's concerned about the little guy, but his tax plan would give the wealthy far bigger breaks than the middle class or working Americans. The Top 1% would see a whopping $275,250 reduction in their federal tax bill, or 17.5% of their after-tax income.\""},{"comment_id":"975168282518593","commenter_b":"Better be sure. Our us h hospital are not allowing this.....What. If. Patient wants non Islamic nurse. Because is this practice?","commenter_a":"STOP with the offending of muslims.....this is the United States of America...land of the free.... Who gives a crap if your offended....","post_message":"Whoa!"},{"comment_id":"1185050781573456","commenter_b":"This lady is nothing but pure Evil","commenter_a":"Same ole same ole.","post_message":"A top official was just discovered dead... he was scheduled to testify against Hillary Clinton in an up coming corruption case. Our thoughts and prayers go out to his family...this is just terrible."},{"comment_id":"10154493907103352","commenter_b":"Amen and thank you Lord","commenter_a":"Amen","post_message":""},{"comment_id":"687088591481719","commenter_b":"She can pack up and go home and take her sharia law with her. And she can pay her own way, too!!","commenter_a":"Yes it doe's.","post_message":"Woman goes on TV and points the finger at Americans for this. She has some nerve. What a ridiculous statement. Does this infuriate you?"},{"comment_id":"10154942733646873","commenter_b":"Sally Yates we need more of you. Well done.","commenter_a":"We have a dictator as presidentDon't agree with him ,you are fired","post_message":"Sally Yates had said the Justice Department would not defend in court Trump's immigration order."}]
