[{"comment_id":"1878063365760713","commenter_b":"All illegals have committed crimes, hence the term ILLEGAL!!!","commenter_a":"Trump is more concerned with illegals that have committed crimes and securing the borders if you think Trump is going to round up all the immigrants like cattle and send them packing then you haven't been paying attention to the news","post_message":"“There is a long tradition in American law enforcement of not breaking into churches in order to arrest someone unless the person is wanted for an act of violence,” Judge Andrew Napolitano said."},{"comment_id":"1120443904657696","commenter_b":"Google Michael L. Robinson. Transvestite.","commenter_a":"Should say make the First Lady a LADY again. Take that Michael. Obama perpetrated the greatest fraud against America ever and will get away with it. You watch.","post_message":"Is this cartoon offensive?"},{"comment_id":"10153758962823445","commenter_b":"Trump wants to build a 30 trillion dollar wall. I'm guessing you thought that would be free....","commenter_a":"Everything should be free or according to Bernie. Typical politician lying out his ass just so he can get more young people votes. He needs to go back to the old folks home and have his depends changed He's so full of shit.","post_message":"Bernie Sanders: \"Pot Should Not Be a Federal Crime.\""},{"comment_id":"1050256608364201","commenter_b":"Lol. Ridiculous! Hillary2016! !!","commenter_a":"Hillary, Hillary, Hillary. Time to throw in the towel NOW, so when you eventually convicted there is still a Democrat in the White House to pardon you. Keep on campaigning and the Grey Bar Hotel has your name all over it. As I said in my post titled, Smoking Gun: Hillary E-mail Instructs Aide to Delete Classified Markings, I don think anyone really expected Hillary to get a prison sentence, even if indicted, and then convicted, not until the most recent email anyway. Several days ago, The Daily Caller Reported: [FBI] has so much information about criminal conduct by her and her staff that there is no way that they walk away from this, Joseph diGenova, formerly the District of Columbia U.S. Attorney, told Laura Ingraham in a Tuesday radio interview. are going to make a recommendation that people be charged and then Loretta Lynch is going to have the ...","post_message":"Thank you, Ellen DeGeneres."},{"comment_id":"823822871141623","commenter_b":"Every intelligent person knows about Hillary what she is. LONG TIME AGO SHE HAVE lost people trust","commenter_a":"YES, I SURE DO!!","post_message":"Once considered for Hillary's VP, this Navy Admiral wants nothing to do with her. Hillary is a criminal and belongs in jail. Do you support this Admiral's act of defiance?"},{"comment_id":"10153266437101336","commenter_b":"Real biker gangs are way more dangerous than the pretty actors on that show made them seem.","commenter_a":"They all must have watched a marathon of Sons of Anarchy this past weekend","post_message":"UPDATE: Police adjust the number of people arrested from 192 to 170. \"This is probably one of the most gruesome crime scenes I've ever seen in my 34 years of law enforcement.” – Waco police Sgt. W. Patrick Swanton @webpagelink"},{"comment_id":"1187260984619751","commenter_b":"Build the wall then bill his estate","commenter_a":"Build a wall on the edge.","post_message":"Tell the truth....what would you do?"}]
