[{"comment_id":"10154615680566880","commenter_b":"Like auto manufacturers too?","commenter_a":"People who believe that Musk is a genius should support him by staying fully invested. Those who distrust a business reliant on government subsidies should bail. This will be an excellent test case in the economics of government investments. A future under Hillary promises heavy government investments in the Musks of the world.","post_message":"There could be a disaster coming."},{"comment_id":"10153612983935329","commenter_b":"Where's the fat men in crop tops","commenter_a":"@username this is why buzzfeed is terrible lol. So hypocritical","post_message":"God bless you, Roberto Bolle. God bless the male body and also tights."},{"comment_id":"363912913812223","commenter_b":"This LOSER should not even be in this country!!!!!!","commenter_a":"I say disarm the cops on the same day that this turd becomes a vegitarian!","post_message":"Michael Moore Demands Cops Disarm!"},{"comment_id":"10154679365898797","commenter_b":"Let him alone","commenter_a":"Let him go! He did what any man would do for his wife! If that happened to me I'd have shot him! Either way the man would have died! Let him go!","post_message":"HUSBAND PROTECTS WIFE: A man has been arrested after beating and killing another man who had broken into his home and sexually assaulted his wife."},{"comment_id":"1255582551128439","commenter_b":"@username No that shooter was a Mentally Challenged person . Most of the MASS SHOOTERS have been Mentally Challenged. You ask why are they allowed to roam the streets? Well, they took the money to contain and treat them and gave to to the unwed mother to have 20 kids with and to provide Food Stamps. DO NOT under estimate the challenged ones. Some are very smart and great at solving problems. They just can't function in society.","commenter_a":"Here's what we now so far: Syed Farook and Tashfeen Malik met in Saudi Arabia. Farook was described as a devoutly religious Muslim (most likely Sunni). The third suspect, Tayyeep Bin Ardogan, is a 28-year-old native of Qatar. Only Farook was employed by the agency hosting the Christmas party. Multiple explosive devices were discovered at the scene of the massacre. IEDs (improvised explosive devices) are illegal in the State of California. IEDs take time to build. Obviously, there was some planning involved. IEDs are mass-casualty weapons that kill indiscriminately. They're not something you use when you're concerned about casualty mitigation and innocent bystanders. A coworker stated that Farook had grown out his beard over the last several months. The geniuses in the DOJ (namely the FBI) are trying to ascertain a motive. That's nice. Let's see how long it takes them to put the pieces together.","post_message":"The suspects in the San Bernardino shooting were armed with four guns and an explosive device in a \"well-planned\" attack, officials said."},{"comment_id":"10154000125138132","commenter_b":"That woman is a nut!!!","commenter_a":"Hope he doesn't take them on a nice \"trip\" to Monaco like Kelly Rutherford's ex did.","post_message":"Gavin Rossdale has a special Christmas trip planned for his kids!"},{"comment_id":"558632694347761","commenter_b":"Oh Karen, you drank the Kool-Aid!","commenter_a":"Clinton News Network is the Communist News Network! Suppressing the american people and the truth and shutting down live feed the minute anyone mentions anything negative about your Wicked Queen is disgraceful! Your network is just as bad as the National Inquirer with fake reporting! You continue to try and brainwash americans into believing the left wing propaganda. News Flash...millions of americans are starting to use their own brains, which you can no longer control! Continue to cheer for Killary, because you're proving to the american people that your network is as crooked as she is!","post_message":"“There’s no quote. You’re not gonna find a quote from me,” Donald J. Trump told Hillary Clinton. Well, we found a few. Watch 4 of Trump's statements from the debate stage that don't seem to match up with what he previously said @webpagelink"}]
