[{"comment_id":"10152700019752212","commenter_b":"While I understand what they are trying to do, forcing a certain body shape (or denying a certain body shape) under penalty of law is rather draconian. They might better serve the public through education.","commenter_a":"In this day of unrealistic, unattainable goals for what is beautiful, unless you go under the knife or starve yourself. I say Amen. Keep it real.","post_message":"HOT TOPICS: France has passed legislation banning models deemed excessively thin. The law also imposes steep fines and possible jail time for any agent and modeling agency who hire them. The law focuses on the model Body Mass Index (BMI) and bans anyone whose BMI is, according to the law, than levels proposed by health authorities and decreed by the ministers of health and labor. Opponents of the law think that the criteria for banning a model is too rigid; that BMI alone is not a good judge of who is and isn healthy. Others, though, say they happy the law is put in place. They think the law will stop glorifying an unhealthy body image. #9HotTopics What do you think? Robin Marsh and Lacie Lowry may share your comments today on News 9 at Four!"},{"comment_id":"10153941213411162","commenter_b":"Lacey why are women lazy for not changing their last name? You should speak for yourself only.","commenter_a":"isnt her name Erica Crosby.. ijs.., she was his wife.... right","post_message":"HUSBAND PLEADS GUILTY: Kyle Crosby, 29, has pleaded guilty to murdering his wife who went missing on New Year Eve, 2014. Erica Crippen body was found March 17. As part of a plea deal, charges against Crosby mother have been dropped. FULL STORY: @webpagelink"},{"comment_id":"1071771339501789","commenter_b":"@username Blacks are Americans, so are whites on assistance, and American Latinos. I would rather support 20 million of them than 1 illegal Anchor baby and it's Family. Maybe all those Americans on assistance wouldn't need assistance if the illegals weren't taking the jobs Americans need.","commenter_a":"My mother was a volunteer Pink Lady at the hospital in Weslaco Texas and she verified several times to me that Latinos routinely arrived in labor so they had no time to get back to Mexico. They wanted their babies born in America.","post_message":"Astonishing video proving Donald J. Trump is right... Ten percent of the people born in America today are to children of illegal aliens..."},{"comment_id":"10156718983275206","commenter_b":"@username's campaign is not particularly offensive to women neither is her platform desirable for America. Gender is a prominent component of her campaign. There is nothing even suggesting leadership ability; but everything suggesting bias and intractable partisanship.","commenter_a":"love your definition of feminism Carly, so true","post_message":"I know I’m not the liberal Left’s fantasy candidate. But a feminist is a woman who lives the life she chooses for herself—not the life that The View, or Hillary Clinton, or Planned Parenthood orders her to live. I told that to the women of The View last time I was there. It remains true today."},{"comment_id":"10153297410416770","commenter_b":"She a turd......she better be praying..wrong thing to say,vote Trump","commenter_a":"Too late and why would you support a total liar?????","post_message":"Former Secretary of State Madeleine Albright is trying to fix a mess she made when she told women at a Hillary Clinton rally there's a \"special place in hell\" for them if they don't vote for Clinton."},{"comment_id":"10153019047726130","commenter_b":"Not every cheerleader is a slut.","commenter_a":"meeting the cheerleader at the dance so you can go someplace else and apply what you have learned!!!!","post_message":"Young people still aren't getting much from sex ed."},{"comment_id":"477075479149699","commenter_b":"Go Greta Don't. Let the Liar.,,Dunce worry u","commenter_a":"Yes","post_message":"Greta Van Susteren's career was just threatened by Obama. Greta's under attack, she needs our help. Do you support Greta Van Susteren?"}]
