[{"comment_id":"255446914877983","commenter_b":"Criminal News Network or Crooked News Network is full of nothing but whiny ass snowflake safety pin wearing nutjob crybabies. #TRUMPWON #MAKEAMERICAGREATAGAIN #DEALWITHIT #SORELOSERS","commenter_a":"It's a ban. He knows it we know it. But that doesn't stop him from spinning the Don's con.","post_message":"CNN just proved that Trump is LYING when he says he’s not banning Muslims. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10153750734644369","commenter_b":"Ya, and you will go after corrupt windbags in D.C next? It looks good on paper, but it wont happen. There are laws in place that wont allow this to happen. Take the LLC for example, go after the company but cant get the person. But then again, when did laws ever apply to this administration.","commenter_a":"They need a home now!!","post_message":"It is a \"significant scaling up\" of the U.S. commitment to accept refugees from Syria."},{"comment_id":"10153607526077452","commenter_b":"What a good citizen! Love this.. Especially with the morons out there who have killed sea life by trying to get a good selfie!","commenter_a":"Hope he finds his mommy 😟","post_message":"A tour guide rescued a young dolphin stranded on a beach. @webpagelink His heroic effort ensured that the dolphin was able to swim another day."},{"comment_id":"10154013196294411","commenter_b":"Oh with hijab!absolutely she cover herself from you rapist pornographers.","commenter_a":"Americans should be blessed with islam for taking them to the right path","post_message":"They have always seen Iraq as a threat because it has the great potential to be a great regional independent power in its own right. (Op-Edge by Dan Glazebrook)"},{"comment_id":"660919517348095","commenter_b":"People who live in glass houses shouldn't throw rocks !","commenter_a":"Shame on this evil woman, in my opinion....Netanyahu is a friend, and what he has to say matters...If they, meaning the President, White House and Senators are worried about his visit, then WHAT ARE THEY COVERING UP? That is the question.....Bibi is an honorable man, and Americans trust him, more than someone like Feinstein.....Sit down, and let Bibi speak, Americans want to hear him.","post_message":"Senator Dianne Feinstein says Bibi is ‘arrogant’ when he claims to speak for all Jews. But, she still plans to attend the controversial speech."},{"comment_id":"10153850798269614","commenter_b":"we definitely need to build this wall and make Mexicans pay for it","commenter_a":"donald trump is right we need to get this people out of this country","post_message":"U.S.-born Syed Rizwan Farook, 28, was one of two suspects identified in the fatal shooting rampage at the Inland Regional Center, police said. He and a female suspect, 27-year-old Tashfeen Malik, later died in a shootout with authorities."},{"comment_id":"785950868181654","commenter_b":"Fuck you white Bitch! !","commenter_a":"DEMOCRATIC VOTERS ARE JUST FREE LOADERS...","post_message":"Don't worry John Travolta, we're also confunsed about what these people are doing!"}]
