[{"comment_id":"1131647630206805","commenter_b":"I know. He's been promoting terrorism all throughout his presidency. The liberals are dead set on destroying this country. Obama is'nt even a citizen of this country. All of his records are sealed.","commenter_a":"This pos along with the president who endorses cair need to be locked up or shipped off to a Muslim country where they won't have any problems getting along with their fellow Muslim brothers. Muslims commit more atrocities than any other religion in the world and she has the nerve to call our servicemen and women murderers. This organization is a terrorist group and should be disbanded and everyone of them deported!!!!","post_message":"This is guaranteed to be the most vile and despicable thing you see all day..."},{"comment_id":"741928785958028","commenter_b":"Stop calling it \"OBAMACARE\"! It's the AFFORDABLE CARE ACT!!!","commenter_a":"The people that voted for Trump knew that this repeal was part of his plan. You voted for him, don't cry now. Suck it up. Unfortunately the ones that didn't vote for him have to suffer too.","post_message":"The American people know that this is a matter of life-or-death, and they're letting Republicans know it."},{"comment_id":"1280473441987748","commenter_b":"Why is it that when someone makes a valid point. He or she is told to leave. His country was solely built on the backs of slaves. Leave a country you built. How bout leave a country you stole","commenter_a":"Don't like or agree then leave the country if shit offends you... like mama said I'm pretty sure the grass isn't greener on the other side but your more than welcome to check if ya don't like it here just don't let the door hit ya in the ass on the way out ....","post_message":"Massive respect to Colin Kaepernick for having the courage to speak out!!"},{"comment_id":"952148034847314","commenter_b":"How LOW can you go? What a dirtbag!","commenter_a":"Public Square Hanging is well deserved.","post_message":"EXPLOSIVE: Thief Stole Veteran Gravestones to Make Granite Flooring at His Home (VIDEO) @webpagelink"},{"comment_id":"10154376259328797","commenter_b":"Trust and believe it's lot more white women chasing black men. Even the ones that fool you into thinking they don't. What I see in the backroom of my job is hilarious! Then they go home and kiss their racist white husbands and little bundles of joy. lol","commenter_a":"A group of disgusting tramps that will suck a black man dry.","post_message":"OFFENSIVE PHOTO: A school district is taking disciplinary action after a photo of students spelling out a racial slur with T-shirts showed up on social media."},{"comment_id":"864050243704778","commenter_b":"We should have spoken up about the poor quality of the American diet sooner. GMO food & MSG should have been outlawed!","commenter_a":"TRADUCTION ARCHI NULE","post_message":"Well?"},{"comment_id":"10153907295491680","commenter_b":"@username your a bitter woman","commenter_a":"Another classless moron that thinks sexual abuse is ok 👌 way to go Rush, you are pathetic","post_message":"\"Men brag,\" Rush Limbaugh said on his long-running radio show."}]
