[{"comment_id":"1577140392594063","commenter_b":"She is not human, I look at her and see lie lie lie lie lie","commenter_a":"She has NO. SHAME. Once again, it's ALL about HER.","post_message":"Hillary Clinton slammed Republicans while talking about her health during a speech today."},{"comment_id":"1374717489237646","commenter_b":"Deport all Mexicans","commenter_a":"Alot of snowflakes on here. Trump!!!!!","post_message":"LIVE NOW: Donald Trump speaks at a \"Thank You Tour\" rally in Mobile, Alabama."},{"comment_id":"10153729819244753","commenter_b":"if miley cyrus is taking her place i will not watch the voice no more, she is trash","commenter_a":"I will no longer watch he voice with Miley Cyrus on it.","post_message":"Christina Aguilera will not return to The Voice for season 11, and ever since the announcement was made official, rumors have swirled, claiming the “Genie In A Bottle” singer’s alleged feud with Gwen Stefani and Blake Shelton may be to blame. In a recent report, it was alleged that Christina Aguilera’s feud with her co-stars had gotten so ugly that she had actually enlisted Miranda Lambert, the ex-wife of Shelton, to help her get back at them. “[Christina Aguilera’s] feud with Stefani is... @webpagelink"},{"comment_id":"1321112227930500","commenter_b":"I reckon there's still a chance he'll be persuaded to step aside, and Pence will be inaugurated on Jan. 20.","commenter_a":"Looking forward to the impeachment.","post_message":"It's official"},{"comment_id":"1140745955997895","commenter_b":"@username just who do you think you are? It's not over until the FAT lady sings.","commenter_a":"Are you kidding me? Trump nor Newt will NEVER get NEAR the White House!!!","post_message":"Would you like to see Newt Gingrich serve as Chief of Staff in a Trump administration?"},{"comment_id":"10152797115634117","commenter_b":"Matthew, most of you gun totters don't have the balls to pull the trigger. But if you need a gun to make you feel like a man, knock yourself out. Guns are there for men who's wives wont let them have a penis truck. Have a nice day.","commenter_a":"And the evil liberal Democrats want to take our guns away because the police are here to protect you.","post_message":"U.S. marshal's effort to censor a citizen's recording was foiled by yet another citizen recording in this small town that collects millions in asset forfeiture revenue."},{"comment_id":"10152852591771749","commenter_b":"no body know mr. president.... it depends if the people believed to have done the right thing","commenter_a":"United we stand as the greatest nation in the world. USA' USA' USA!","post_message":"Let's go."}]
