[{"comment_id":"418030251654903","commenter_b":"Why not, she gets away with murder!!","commenter_a":"Bad, evil, lying laugh quack! 👎","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"},{"comment_id":"898930746862951","commenter_b":"You sure use a lot of words to say \" I don't have a clue \". Don't you ?","commenter_a":"Take it to the Supreme Court. We only make them pass a background check to buy a gun. That's it. Gun purchasers have no other culpability. Why not a background check for ammo? If gun and ammo purchasers were held responsible for keeping their weapons out of the wrong hands, we wouldn't have as as many shootings. Right now, they pass the background check and then can hand the gun over to whoever they want. A simple law making a background check necessary to buy and use a specific gun would prevent this. Make the legal purchaser responsible to ensure that anyone using the gun has passed their check. Every shooting, trace the gun to the legal purchaser and throw them in jail, if the shooting wasn't the owner protecting themselves. We have technology that can recover removed serial numbers. Gun owners wouldn't let their guns out of their sight. ...","post_message":"Thanks, NRA!"},{"comment_id":"865303986949796","commenter_b":"She has the 2nd highest rated show on cable news and all YOU have is this little space on Trumpbart to air your idiotic views. Not hard to see who is more important.","commenter_a":"Grow up Megyn....as I have stated before...YOU went after him and lost ALL credibility you had. As important...your \"love fest\" with the disgusting Michael Moore was the last straw. Get over it...you just are not that important.","post_message":"Megyn Kelly tells Mediaite she worries that “someone’s gonna hurt me in the presence of my children.”"},{"comment_id":"10153531244887377","commenter_b":"If she wanted privacy then don't run hypocrite","commenter_a":"they nef to vote you also a has been","post_message":"Sen. Dianne Feinstein: Criticism against Hillary Clinton is taken out of context and she broke no laws."},{"comment_id":"943180705778182","commenter_b":"It's a ROCKET SHIP.... Feel the Bernie Ship!","commenter_a":"All I can say is Wow","post_message":"Bernie Sanders closes in on Hillary Clinton in a big way in this \"shocking\" new New Hampshire poll. Watch more here: @webpagelink"},{"comment_id":"1615187908768322","commenter_b":"She is big piece of shit","commenter_a":"Oprah will have to answer to God , I believe Judas turned his back on Jesus . Oprah will have her day","post_message":"WHOA! Take her off TV."},{"comment_id":"10152740114462623","commenter_b":"He dumb sis","commenter_a":"Bos Larry look...","post_message":"A Greensboro teen has been charged with inciting a riot for allegedly using social media to encourage followers to meet at a mall to loot stores and attack police this weekend."}]
