[{"comment_id":"10153715195470736","commenter_b":"NO>>NO..these are always a waste of tax payers money and benefit Corps...and I don't want MORE people here..","commenter_a":"NO!!! no no!!! such a waste.","post_message":"Would you want Oregon to host the summer Olympics in 2028?"},{"comment_id":"10153866703120575","commenter_b":"Yeah she has hate written all over her face. Smug bitch","commenter_a":"Megyn's dislike of Trump is obvious.,and a bit over the top, clouding her Demeanor, Neutrality, and Professionalism.,she may have to pay the Piper if Trump goes all the way,!! Though, I don't feel Trump is a Vengeful person,!!","post_message":"66,000 Signed Petition to Boot Megyn Kelly from FOX News Debate!"},{"comment_id":"1089399481081062","commenter_b":"Hahahaha","commenter_a":"Matthieu Sinclair","post_message":""},{"comment_id":"10153302995429255","commenter_b":"That is not proven, nor can it be.","commenter_a":"I got the rubella vaccine when I was 27 because that was the one childhood disease I didn't contract. At age 27 my body was able to handle the vaccine. NOW tell me PLEASE how the hell do you think its OK for an hours old baby to get vaccinated for a sexually transmitted disease, and then 48 more by age 18 months? Its seems to me KOS person, you have been bought by big pharma, or you are on a rant. Because this getting tedious","post_message":"A \"perfect storm\" is starting to brew. By Daily Kos user Lib Dem FoP"},{"comment_id":"163756660695086","commenter_b":"She's unbelievable. I swear she better not get into office. WAKE UP AMERICA!!!","commenter_a":"I think Hillary is channeling Marie Antoinette.","post_message":"Hillary Clinton just landed her plane in Nantucket... Almost immediately after people saw her, this HUGE problem went viral..."},{"comment_id":"10154001620082377","commenter_b":"I don't think that would work here, just look around now, pants below waist so nasty drawers complete with nasty skid marks being worn, woman with breasts hanging out of clothes and jeans with the butts completely exposed, (men and women), FU t-shirts, and on and on. Burkas would improve these types, so no, let them wear burkas.","commenter_a":"The thing is that it is part of their religion and I think we should respect their right to wear it, it is not indecent. I can think of a lot of people who benefit from it , you know to cover up too tight pants on someone who is obese and so on.","post_message":"Angela Merkel calls for Germany to join France, Belgium and others in banning the burqa. Should America be next?"},{"comment_id":"10152973367828271","commenter_b":"Now he will have to keep finding more blondes that look like his ex wife","commenter_a":"Where do I apply for this job. I have a lot of worthless information that I would love to be paid for. 😂","post_message":"It's over: @webpagelink"}]
