[{"comment_id":"10154087270880047","commenter_b":"Oh hell no - the responsibility lady falls on the dingbats having unprotected sex for hell sakes...","commenter_a":"Wonderful.... Just incredible how everyone is so consumed with life at conception. I have yet to hear a plan from the Pro-Life movement that will ensure these \"life begins at conception\" babies will receive all of the necessary love and care that a child so rightful needs & deserves. This becomes YOUR responsibility!","post_message":"VICTORY: The U.S. House of Representatives passed the \"No Taxpayer Funding of Abortion Act\" by a vote of 238-183.        This is a significant, bipartisan step forward for the pro-life movement."},{"comment_id":"1735996146651286","commenter_b":"@username You are just a Con Man Two Faced Liar who is spreading false hope promises with zero substance to back up what your saying. You are playing America the same way you played the Americans that went to your scam Trump University","commenter_a":"Clinton is a close friend of the big banks, big pharma, and everything else that corresponds to corporate capitalism, millions of Americans already struggling will sink even further under the waves. Rental and housing prices, already astronomical, will rise to more heights of unaffordability. Drug prices and health care costs, which soared under Obama. Then, police shootings. @webpagelink","post_message":"America led by Hillary will be an AMERICA where things get even WORSE than it is now.  Higher taxes, rampant TERRORISM and MORE CORRUPTION from Washington, DC!  TOGETHER, we WILL Make America Great Again!"},{"comment_id":"10154841543903984","commenter_b":"Go to prison Hillary! !","commenter_a":"This is proof this election is and will be rigged. There's absolutely no way Hillary is leading in the polls. She will win but by using massive voter fraud.","post_message":"Fox Business Network just took a serious swing at Hillary Clinton, and it definitely was NOT a miss. The network exposed on-air the one thing mainstream media would never show you, and Hillary does NOT want it seen."},{"comment_id":"10154780411199228","commenter_b":"She's Caucasian that's why...duhhh","commenter_a":"She is pretty enough she probably could have had any man she wanted. What on earth would posess her to choose a boy? Pretty sickening!","post_message":"The parents were allegedly \"accepting of their relationship,\" even inviting her to family gatherings."},{"comment_id":"426764770781451","commenter_b":"let the idiot walk home ! she does not deserve to be around others !","commenter_a":"Her Bus, Her Rules.","post_message":"This bus driver decided to teach a foul-mouthed teen some manners."},{"comment_id":"10153236038721336","commenter_b":"See this is what I mean, we know this guy is a terrorist. He admits so on TV and trains other MUSLIMS the most effective ways to be a terrorist. Why is he allowed to walk the streets? We need a force not answerable to normal athority that can move in on MUSLIM terrorist like this without constraints and not having to watch them for 10 years then wait a week after they attack to make an arrest. Get the job done and move on to the next one.","commenter_a":"Why giving your air time to this evil, wicked man","post_message":"Imam Choudary: \"The United States of America are the champions of murdering innocent people!\"  Muhammad contest organizer Pamela Geller: \"[We're] the champions of freedom, sir!\""},{"comment_id":"10153655061641336","commenter_b":"There not illegal immigrants, they are Illegal Aliens. Death penalty for them!!","commenter_a":"Deportation or jail time is not good enough, eye for an eye. Capital punishment","post_message":"“This was not a random incident,” Sheriff Mike Chapman said at a news conference Saturday. “The suspects and the victim were known to each other.”"}]
