[{"comment_id":"547039675478904","commenter_b":"trump is not going to build a wall or deport. sorry","commenter_a":"Make America great again build that wall","post_message":"'I want America First - so do voters!'  Hear from Donald J. Trump tonight on protesters, the Indiana primary and more at 10p ET. #Hannity @webpagelink"},{"comment_id":"1134556746600853","commenter_b":"She's no better.","commenter_a":"Trump is the devil...if he be elected to be the president...he's gonna start the world war III. HILLARY 2016-2020 !!!","post_message":"Estas son las promesas de Trump. Así podría ser su presidencia…."},{"comment_id":"611768719013707","commenter_b":"She's a piece of shit black bitch. That's all","commenter_a":"The Bitch is an idiot!!!!! Ignore her!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"},{"comment_id":"10153337726654726","commenter_b":"IF she had ANY self respect, she would NOT be making a fool of herself and making up LIES for obaloser and the rest of the liars!!!","commenter_a":"It disappeared. Hmmm...","post_message":"WATCH: State Department spokeswoman is laughed at while trying to give Obama credit!"},{"comment_id":"10153572355174575","commenter_b":"Look people I'm not trying to insult anyone but we have the most advanced technology in the world and your telling me that there is no way the government can find out 9f she sent classified e-mails or not? Who the f#### are we kidding. The truth is she did not and they want to put that thought in people's minds. Those that believe it must be stupid (no insult intended). They just do not want her to be president. Hillary Clinton out of all the candidates is qualified to run this country. I don't care what anyone says.. every one has a right to an opinion and this is mine. HILLARY CLINTON 2016","commenter_a":"Clear she is nothing but a lying scum bag","post_message":"“I am confident that I never sent nor received any information that was classified at the time it was sent and received.”   Democratic presidential candidate Hillary Clinton addressed media in Iowa on Saturday, adding that the latest controversy is an example of disagreement among various parts of the government about what should or should not be publicly released.  Her remarks come after The New York Times reported Thursday night that inspectors general for the intelligence community and the State Department had asked the Justice Department to launch a criminal investigation into Clinton’s possible mishandling of classified email."},{"comment_id":"10154277621163279","commenter_b":"Did you not see the video? Or are you just use to defending BS cops?","commenter_a":"If you fight with the cops and try to kill them they will shoot you every time. Still no one in the community says hey man don't fight the cops don;t try to kill cops and wave guns around and you won't end up dead.","post_message":"WATCH: Morehouse College's Marc Lamont Hill reacts to the police shooting deaths of #PhilandoCastile and #AltonSterling"},{"comment_id":"10152805684357377","commenter_b":"Bout time someone got a pair! Keep your ducks in a row bro. I'd like to see her in a 4x8 with obstructed view!","commenter_a":"They trying to stop Hillary at all cost.","post_message":"Klayman reveals the details on The Steve Malzberg Show. Watch Newsmax TV on DirecTV Ch. 349, DISH Ch. 223 and Verizon FiOS Ch. 115. Get Newsmax TV on your cable system."}]
