[{"comment_id":"889005157864717","commenter_b":"I remember the \" summer of love\". I hope I don't experience \"the summer of hate\". If you're looking for a change, this is the wrong guy for the job.","commenter_a":"He is not the establishment.","post_message":"Donald Trump Supporters: Why Are You Supporting Trump?"},{"comment_id":"785950868181654","commenter_b":"Fuck you white Bitch! !","commenter_a":"DEMOCRATIC VOTERS ARE JUST FREE LOADERS...","post_message":"Don't worry John Travolta, we're also confunsed about what these people are doing!"},{"comment_id":"1054779971229141","commenter_b":"Shes just crabby because no one will rape her","commenter_a":"And thank here for elevating race hatred to a new high!","post_message":"Ann Coulter actually said Hispanic immigrants were responsible for the \"browning of America.\""},{"comment_id":"10153573907066509","commenter_b":"She couldn't bring women down, only herself!","commenter_a":"I don't want to swear.... but.....way to go bringing the equality movement down a peg! !!! You really didn't think that one all the way thru!!!! :(","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"},{"comment_id":"10152957985436316","commenter_b":"Ignorant bitch. Talk about crime? I haven't heard of an illegal immigrant shooting up an elementary school or a movie theater. Americans are using drugs that's why drugs are trafficked here. Can you read a sociology book and gain better insight into social issues than base your opinions on ignorance?","commenter_a":"and all the anchor babies..they pop out 5 or 6 kids and they have welfare for life, the low life dads beg to stay because his child is \"american citizen\" .. so 1 breeder, 6 kids, 6 dads> IS 14 ILLEGALS ON WELFARE< running drugs, chop shops, gangs...all of this in a 1 bedroom apt in a apt complex that has 500 units... Now much money is being sent down a rat hole????","post_message":"The number of illegal aliens residing and working in the United States now outnumbers Americans who are unemployed and looking for a job, an issue that is certain to be a priority for tens of millions of voters in the 2016 presidential election: @webpagelink"},{"comment_id":"10152760483166051","commenter_b":"I guess she rubbed them the wrong way......","commenter_a":"They didn't arrest her but they issued her a citation.","post_message":"Police took one look at the video this girl posted from the Oregon State University library and arrested her immediately."},{"comment_id":"392884667560081","commenter_b":"Bitch!","commenter_a":"He certainly does, and the GOP deserves a kick in the ass!","post_message":"President Obama deserves a HUGE thank you!"}]
