[{"comment_id":"10153209825548445","commenter_b":"Not if you make the tincture right","commenter_a":"Don't make edibles at all. If you want an edible high, just buy/make tincture and eat it with cookies. Or just eat the weed in fillable capsules: 1. Decarboxylate your Dry herb 2. Fill swallable capsules with dry herb 3. swallow capsules with food and drink","post_message":"10 Commandments of #Marijuana Edible Safety"},{"comment_id":"933295990044593","commenter_b":"Most reusable bags are made from thick plastic. It makes me wonder how many thin bags it takes to make up one of those. Then how many if those are just thrown out because they become dirty or torn. Plus, as it was stated, the carbon footprint of these bags isn't helping anything. I think the best solution might be bags made biodegradable from corn or potato. I've seen some restaurants begin using those.","commenter_a":"when you walk a beach every day, as i do in seattle, it is clear that limiting the use of plastic bags is completely reasonable.","post_message":"Ah, the infamous \"paper or plastic\" question. It's way more complicated than we thought, and now scientists are throwing their hats into the ring to solve this environmental quandary."},{"comment_id":"988047007995144","commenter_b":"She's just womansplaining to him","commenter_a":"That stupid bitch next to him needs to respect other people's turn to speak. How are you going to disrespect another adult like that on national tv? Shushing him?? What a fucking cunt","post_message":"I've literally watched this about a dozen times now (and it gets better every single time)..."},{"comment_id":"10154045995555329","commenter_b":"@username No Danie, they're too scared to do anything because FEMINISTS THREATEN TO KILL THEM.","commenter_a":"As a man who would literally NEVER talk to a woman like this, I'm ashamed and embarrassed that men actually do. Makes me sick. I was always taught to treat women with respect. Guess that doesn't apply to my fellow man...","post_message":"ICYMI"},{"comment_id":"10152767856712426","commenter_b":"Hide yo kids hide yo wife","commenter_a":"Michelle Grider","post_message":"Startling!"},{"comment_id":"1535691416490982","commenter_b":"Go lick some boots","commenter_a":"I don't see how the video is BS you can clearly see him drop his hands down into his waistband and wasn't following police commands again showing the total disregard to authority so The only BS I see is ignorant people trying to act like they're above the law","post_message":"The media ALMOST had everybody fooled about Crutcher, but we found the truth.  And it's going to destroy the media's narrative on the Crutcher shooting..."},{"comment_id":"10155001030118908","commenter_b":"Angie ???","commenter_a":"Simon","post_message":"Science says practicing mindfulness exercises increases gray-matter density in the hippocampus!"}]
