[{"comment_id":"943377485718781","commenter_b":"Never Bernie. This Latina will vote for Hillary.","commenter_a":"@username mil veces mi voto para ti..!!","post_message":"\"Para el Señor Trump, solo tengo una palabra.\""},{"comment_id":"10153836733820950","commenter_b":"You are a sick women. Hope you burn in hell","commenter_a":"Disgusting","post_message":"The mother reportedly removed the infant from the closed fridge after 3 hours."},{"comment_id":"1260941960612940","commenter_b":"To unite for all the right concerns all of them with us in mind because is 100% for and by the people...please for your families...you have to check learn help in anyway you can act and share and share again...because species are disappearing everyday...everyday...for you your loved ones for the nation for the world the planet..hiring humans for humanity and peace for all not the few...www.jill2016.com","commenter_a":"What a lot of people don't know about Trump that support him is, that those same people would not survive him ...Trump would even eat his own kind....it's just his nature.","post_message":"This teen just figured out the perfect question to start asking Trump and his supporters."},{"comment_id":"10154822738529369","commenter_b":"You know she had to be shitting her pants up there","commenter_a":"Shell be alright it another Trump curve ball","post_message":"A Clinton campaign representative told NBC News that the campaign had \"no idea\" what Comey was referencing in the letter he sent Congress on Friday."},{"comment_id":"10153984611959614","commenter_b":"Walk in front of my car. Karma will get u","commenter_a":"You see how faithful this poor dog is his master was going to kill him.My brother told me one time as he was coming home from work.He saw a little dog on the road this truck purposely hit that little dog and killed him.What kind of animals do we have on the roads.I guess it speaks for it self","post_message":"A heartless driver shoved a dog out of an SUV, then sped away as the abandoned pet desperately scrambled to get back in.   The dog was struck by another vehicle as it chased after the driver on a Long Island road. Incredibly, the canine survived.   Suffolk County SPCA is offering a reward to find the person who abandoned the dog. The driver's vehicle is described only as a dark green, early 2000s Jeep Cherokee."},{"comment_id":"10153488967916336","commenter_b":"He does not love America, he should be removed from office. The President has a sworn duty to protect the Constitution and the People of this Republic which he never has. He serves illegals, thugs and his fellow Muslims.","commenter_a":"they served our country they need respect but cannot change stupid","post_message":"\"This administration’s decision on who gets memorialized and who doesn’t is puzzling,\" Todd Starnes wrote."},{"comment_id":"10153684804441336","commenter_b":"LGBT does not need to be taught in schools and if you read the Bible the lifestyle is an abomination to God.","commenter_a":"Those who are investigating him should be the ones being investigated. Teach our kids gay sex, Islam and the coach can't say a prayer? Freaking idiots.","post_message":"Bremerton High School assistant football coach Joe Kennedy, a 20-year U.S. Marine Corps veteran, said he has never asked students to join him in prayer; they do so voluntarily."}]
