[{"comment_id":"510102432525283","commenter_b":"What a dumbass!","commenter_a":"Well duh!!! I thought everyone knew the all you can eat means is all YOU, just you, only you, your stomach, can hold, I didn't realize that there were ppl stupid enough to think they could go into a restaurant and get the all you can eat whatever and feed 5 or 6 of your friends on YOUR all YOU can eat ....are ppl really out there that are that stupid ? If so for the love of God spay and neuter them so as to prevent them from bringing more ridiculously stupid ignorant ppl into this world","post_message":"The Denny's workers here repeatedly tried to explain the rules about all-you-can-eat-pancakes to this lady - and that's when she completely snapped."},{"comment_id":"10152820501225736","commenter_b":"And he signs new contract with Hair Club for Men.","commenter_a":"EEEEEEEEEE-HA!!!!!!!","post_message":"\"Due to the recent derogatory statements by Donald Trump regarding immigrants, NBCUniversal is ending its business relationship with Mr. Trump.\""},{"comment_id":"10153639349621636","commenter_b":"It was 25 degrees when I got off at Gatwick-hotter than the Med!","commenter_a":"What do you say POMY wimps!!","post_message":"'I think it might be too hot'"},{"comment_id":"10153572594101051","commenter_b":"Gee, did you even graduate from high school????!!!!! You foul mouthed witch!!!!","commenter_a":"I dont blame them!! It probably sickens them that crazy angry trump uses their music while he talks his trash!!","post_message":"One of the world's most legendary rock bands just told Donald Trump they want nothing to do with him."},{"comment_id":"886212474747508","commenter_b":"she is a trashy shank","commenter_a":"This guy rips her a new one. Good for you.","post_message":"Michelle Obama has no class, and he sets the record straight!"},{"comment_id":"10154018738645736","commenter_b":"Isn't that gorgeous.","commenter_a":"We need some housing Kate Brown.","post_message":"People are still flocking to the Beaver State."},{"comment_id":"10153465168796162","commenter_b":"She shouldn't have said anything. Should not have been on social media while working.","commenter_a":"It's not racist it's just ignorant, she could have just said these rude people","post_message":"Brookfield Zoo responds after an employee posted what some may call a racist comment on social media... @webpagelink"}]
