[{"comment_id":"1870199419930367","commenter_b":"@username I would argue that we are far worse than monkeys.","commenter_a":"What's truly is a tragedy is the length of time humans have been in existence, and we still haven't gotten very far and I don't think we're capable of forming a world based on simple human decency.","post_message":"A great nation is judged not by how many millionaires and billionaires it has, or by the size of its military budget. It is judged by how well it treats its weakest and most vulnerable citizens. A truly great nation is one that is filled with compassion and solidarity."},{"comment_id":"850014095139630","commenter_b":"Those illegals and Refugees are everywhere,and plenty of them,obama has been busy letting them in the last 8 hills,hillary killed off soldiers[American] and wanted muslims in,guess she wanted to kill babies that was full term so they would not grow up for the usa,,what a mess,in the usa,why don;t they stop all of this junk? This is America?","commenter_a":"So I have posted this many times.... How many of our citizens have to die or be injured before these Far Left Dems understand and see the light! These illegals and Refugees are not good people......","post_message":"John Kasich opened up Ohio's borders to refugees and himself to a tidal wave of Twitter hate..."},{"comment_id":"775973422593235","commenter_b":"Absolutely, she should be in prison anyway not headed to highest position in America","commenter_a":"Elated!","post_message":"BUSTED: Hillary Clinton Was Just Caught Read Handed For Being Linked To... This actually might stop her from running. Would you be happy if she had to back out of the race?"},{"comment_id":"1264161686965709","commenter_b":"Sounds like the brides need to chill the hell out lol i would rather go on a awesome honeymoon then spend that kinda money just to walk to a isle... But that's just me and I'm a very different kinda women.","commenter_a":"Retarded....","post_message":"And about $16,000 of that is for the venue alone... STORY: @webpagelink"},{"comment_id":"10153635584924575","commenter_b":"What about rap videos or BET...come on people","commenter_a":"All them white girls in one video.....thats RACIST","post_message":"A University of Alabama sorority has taken down a recruitment video after receiving a lot of criticism. One website described it as, \"Stepford Wives: College Edition. It’s all so…unempowering.\""},{"comment_id":"10154040024789160","commenter_b":"If you got a dick,,,, GO F- - K yourself","commenter_a":"Go sway","post_message":"It's Barack Obama's 55th birthday. What's your birthday message for him? (AP Photo)"},{"comment_id":"10154209320467541","commenter_b":"Really? this may be your utopian vision of socialism for everyone nice try buddy. Congrats on taking the time to list Obamas wonderful accomplishments. I do not agree with 99% of Obama's policies and visions. Trump has the overwhelming support of people in this nation and Trump supporters are ready to make America great again. We shall begin by getting a handle on illegal immigration enforcing the Laws of this nation and doing what America does best. We are still the beacon of the free world, lets work on keeping it that way. Good luck with your Socialist views and a Globalist society.","commenter_a":"Funny the Trump haters appear to be a new crop of Liberal Morons. They are to young to be the old Bush bashers they must be the demon spawn of the Bashers!","post_message":"CAPTION CONTEST President Donald J. Trump casually mused on a \"nuclear holocaust\" and yelled at reporters in a surreal press conference earlier today. @webpagelink"}]
