[{"comment_id":"10153810212319087","commenter_b":"stupid picture talking bitch. @webpagelink","commenter_a":"this is good. \"Rarely does a presidential election hit the unthinkable issues that can completely divide a nation and endanger the peace and security of that nation. It seems Donald Trump is poised to kick down doors concealing issues that mainstream media and mainstream candidates fear to even discuss. The competence level of our leaders in government and their weak attempt to compete in world markets is one of this countries forbidden issues. The other forbidden issue is the democratic party position that Islam has nothing to do with violence, as opposed to Donald Trump explosive position that hates us. It a good bet that America is about to get an education in what Islam represents and what its intentions are, as perceived by Donald Trump. I believe the two afore stated issues will sharply divide the American electorate and could possibly threaten the peace in some instances. Donald Trump ...","post_message":"Here are five of the most important primary fights to watch this month that could determine who will win this fall's battle for control of Congress."},{"comment_id":"10152908270740927","commenter_b":"Forced motherhood?! Are they frigging kidding me?! Nobody forced them to have sex unless they were raped. So stop with the ridiculous posters!","commenter_a":"Just who is forcing these women to get pregnant? No one is forcing \"Motherhood\". Try and show some responsibility if you are going to have sex.","post_message":"It's no surprise that Satanists support Planned Parenthood, but what is SURPRISING is how they showed that support ..."},{"comment_id":"1702951239953812","commenter_b":"Go to hell","commenter_a":"a liar and corrupt & a socialist what a pick for dems.","post_message":"Now it’s Hillary Clinton who has taken up the “white privilege” banner. During a recent Q&A she asserted that white people need to “recognize our privilege” and “practice humility.” Do you think Hillary is totally out of touch with reality?"},{"comment_id":"866645046728578","commenter_b":"an amazing climb","commenter_a":"Liam Boggans","post_message":"Gnarly pictures reveal the toll taken on El Capitan conquerors' hands"},{"comment_id":"1030585200364962","commenter_b":"DON'T TRUST HER ... Obama and Hillary want to rescue 200,000 Muslims. This is the same two that couldn't rescue four Americans in Benghazi. ... #VoteTrump2016","commenter_a":"Hillary's background If you happen to see the Bill Clinton 5-minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware. A person who was there for most of their presidency and knows them better than just about anyone has listed a few corrections. Bill says: \"In law school, Hillary worked on legal services for the poor.\" The facts are: Hillary's main extra-curricular activity in law school was helping the Black Panthers, on trial in Connecticut for torturing and killing a federal agent. She went to court every day as part of a law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: \"Hillary spent a year after graduation working on a children's rights project for poor kids.\" The facts are: Hillary interned with Bob Truehaft, the ...","post_message":"Hoy, el Departamento del Trabajo acaba de anunciar nuevas reglas laborales que garantizarán el pago de horas extras a trabajadores que ganan hasta $913 dólares a la semana o $47,476 al año. Esto es más del doble que el límite pasado de $455 a la semana. Hillary: \"Aplaudo al presidente Obama y al Secretario del Trabajo, Pérez, por estas reglas sobre horas extras laborales, las cuales levantarán a trabajadores a nivel nacional y ayudará a que los salarios aumenten nuevamente para las familias trabajadoras. Durante el primer año de la implementación de estas reglas, millones de trabajadores adicionales serán elegibles para el pago de horas extras, finalmente cobrando totalmente por las horas que le dedican a sus trabajos... Nadie que trabaje 40 horas a la semana debería tener que mantener una familia en la pobreza”."},{"comment_id":"10153601261735861","commenter_b":"LOSER!!!!","commenter_a":"boomer","post_message":"Oklahoma State slips in the AP Top 25- OU moves up"},{"comment_id":"10157371932040500","commenter_b":"Build that wall!","commenter_a":"Lithia FL","post_message":"WFLA Ian Oliver talking about Sunday weather and the latest on the tropics including Invest 99L."}]
