[{"comment_id":"10153203713812894","commenter_b":"She's a damn lie! Ain't nobody stupid! That's what's wrong with her lying ass all them babies and surgeries!","commenter_a":"What did she do to her face? She looks weird","post_message":"Kim Zolciak Reveals Doctors Discovered a Hole in Her Heart While She Was Hospitalized After Her Stroke"},{"comment_id":"1658663710820319","commenter_b":"The Obama presidency wasn't a failure. Facts suck if your opinion differs, but it doesn't mean you get to have your very own truth.","commenter_a":"After seeing our FLOTUS on Oprah and seeing once again her \"attempt\" to divide our nation.... She had me thinking.. It was nearly nine long years ago that Michelle Obama stated, \"for the first time in my adult life I am proud of my country because it feels like hope is finally making a comeback.” After nearly eight years of failed policies, I feel I can nearly say the same.... For the first time in eight years, I am proud of my country because it feels like hope is finally making a comeback.”","post_message":"As First Lady Michelle Obama prepares to depart The White House, here's a look back at the moments that made her go viral. Watch more here: @webpagelink"},{"comment_id":"10153206037935399","commenter_b":"Even if the fight is with a women","commenter_a":"Just like all of the allegations about his false claims about the Falklands and being at the suicide of the JFK witness etc..........","post_message":"O'Reilly isn't one to go down without a fight."},{"comment_id":"989149777896374","commenter_b":"Es ist wie . Die REICHEN WERDEN IMMER REICHER UND DIE ARMEN IMMER . Die Schere geht immer weiter auseinander.....und dann sind die Leute noch so naiv und w diese Typen, die keine Ahnung haben, vom wirklichen Leben. ....und Leute wie Bernie Sanders, l man fallen.","commenter_a":"Raising wages does absolutely nothing. If you raise minimum wage to the argued $15 an hour, you would have to raise everyone else's wages the same percentage. Now that it costs more to pay workers, manufacturers now have to increase retail prices to make up the difference. This achieves nothing and you're back to square one. You get paid more, but products cost more. 1 to 1 is the same ratio as 4 to 4. Paying more money for the same exact thing is the precise definition of inflation. This mind set is why recessions exist in the countries that follow this policy.","post_message":"The Walton family, the owners of Wal-Mart, is the wealthiest family in America. Middle class taxpayers should not have to pay billions more in taxes in order to subsidize the wealthiest family in America. That's absurd."},{"comment_id":"1068067499964996","commenter_b":"That's why it's called a Meltdown. Theoretically it is not supposed to stop until it reaches the center of the Earth. This may be a bit far fetched, though. Alien blood ain't got nothin' on a meltdown.","commenter_a":"Lennie","post_message":"Operators of the Fukushima nuclear power plant have identified a gaping hole in a reactor containment vessel, which has resulted in a drastic spike in radiation levels."},{"comment_id":"10153957381501336","commenter_b":"FAIR TAX on consumption, please. Get the hookers, pimps, drug dealers etc. To pay tax! They have to eat too.","commenter_a":"Make states lower property tax too. It's screwing me on buying a house","post_message":"“No deductions, no loopholes.” Dr. Ben Carson revealed his tax plan this morning and said he would replace the current tax code with a 14.9% flat tax. (Via: Fox & Friends)"},{"comment_id":"10154666136846833","commenter_b":"I'm thankful there isn't enough police to stop all crime! Because then we would be living in a police state!","commenter_a":"There is one more Woman who Had a gun to protect her Family, but a lot of Americans who will never be Able to protect there Family's for not owning a Gun. They live in a elusion of Safety that the Police have enough manpower to Protect them. Unfortunate there will never be enough Law enforce Officers to protect everyone. It is up to you to Protect yourself as much as possible.","post_message":"If three intruders break into your home and hold your spouse at gunpoint, what would you do? This Florida woman was faced with that dire scenario last week. Thankfully, she was able to run to the bedroom and grab her own firearm to end the ordeal and save her husband."}]
