[{"comment_id":"437504329786414","commenter_b":"pinocchio wants guns taken from the citizens so we won't be able to defend ourselves against his \"refugee military\".","commenter_a":"Maybe that's why Obama wants stricter gun laws, after all isn't he always on the side of the criminals?","post_message":"Gun Bans are Ridiculous www.eaglerising.com"},{"comment_id":"10152781653123717","commenter_b":"That girl needs some help!","commenter_a":"wtf is that on the bottom left?","post_message":"Manchester police say an investigation into prostitution in the Queen City led to the arrest of six people. @webpagelink"},{"comment_id":"1274512465962929","commenter_b":"Look at the fucking rat you idiot!","commenter_a":"Ray this is the first one I don't know if I would 😂","post_message":"Would you? #WSHH"},{"comment_id":"684042675091009","commenter_b":"Hillary is guilty as sin . She should be in prison along with all of her Clinton Crime Mafia.","commenter_a":"Maybe he is scared of being the next victim to die like the FBI suspected leaking the emails.","post_message":"BREAKING: CLINTON CLEARED...Was This A Coordinated Last Minute Trick To Energize Hillary's Base?   This only proves why we need TRUMP to DRAIN THE SWAMP! We are a Banana Republic!"},{"comment_id":"1306220052736740","commenter_b":"Trump has everything a person could want so he just wants to pay American back!! Hilary tried to steal furniture from the white house the first time around","commenter_a":"Hillary should be in prison! Treason and lying are her crimes. Benghazi will never be forgotten as she turned a deaf ear to our own and did absolutely nothing! Trump in 2016! 🇺🇸🇺🇸🇺🇸","post_message":"As of now, Donald Trump and Hillary Clinton appear headed for a showdown in November. Who gets your vote in this matchup: Trump or Clinton?  LIKE Opposing Views for more breaking news and analysis!"},{"comment_id":"607961416030479","commenter_b":"Make America Mexico! Isn't that what the dumbass idiots where chanting when they where protesting Donald trumps rallies! Trump 2016 build that fucking wall!","commenter_a":"God damn! @username","post_message":"The Zetas tortured and killed around 150 people, and then incinerated the bodies or dissolved them in acid."},{"comment_id":"10153277341923188","commenter_b":"I do believe the \"offended\" have been organized by an outsider to bombard anyone helping to stabilize the area. It is not Whole Foods, The National Guard or the Police who need scrutinized! It's the Promoters who keep unrest in the media way beyond the time it is newsworthy! Always seems to be when there is a \"Political\" issue, Ferguson-illegal aliens, Baltimore- Clinton Foundation and the very questionable donations. Of course the nuke treaty with Iran, etc.! Protesters in both cities started out fairly calm. Then hordes of people started pouring out of the woodwork, looting, burning, destroying, many were not even from that area! How did they get organized so quick? I agree that All Lives Matter in every community. I also believe a huge % of our Police Departments are doing what they have to do with the Thugs who lack any respect for our laws! Rap sheets ...","commenter_a":"So sad they were doing the right thing.","post_message":""}]
