[{"comment_id":"485248011623976","commenter_b":"Ugly little bitch.","commenter_a":"Bush murdered 4500 American soldiers for a lie in Iraq, got another 50,000 maimed, killed 100,000 innocent Iraquis, allowed 9-11 to happened, bungled the response to Katrina, bankrupted the nation, allowed our enemy bin Laden to literally go free, and had 9 US embassies/consulates attacked with over 90 dead, yet these mother fuckers stiil pretend to be outraged over this bullshit....republicans investigated this 9 mother fucking times, at a cost of millions of dollars, and found nothing. This is perverse. Conservatives are the worst enemy this country has ever faced.","post_message":"The GOP wants nothing less than the total destruction of Hillary. -Clay"},{"comment_id":"553000848198682","commenter_b":"More illegals are prosecuted in the state of Florida than any other state for voter fraud. It goes on everywhere though. I agree, there should be further evidence required to prove you are a citizen. Maybe a place on your driver's license should be reserved for this information. Not only are these illegals breaking the law to come here, they are electing people like Marco \"The Chihuahua\" Rubio to be their senator. Oh, and Google: \"Rubio Gay Arrest\" to see what Rubio likes to do in his spare time.","commenter_a":"Voter fraud has been proven in tx. People voting for trump are seeing their computer vote switched to Rubio, and cruz. And let's not forget, that the kkk is backed by the democratic party.","post_message":"We are #WINNING - #TrumpTrain! Thank you for your support. Lets keep this going! WE WILL MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1141907219179950","commenter_b":"So, she won 3rd and 5th place. So much for any supposed advantage she's supposed to have by having been born biologically male. She was beat by naturally born females.","commenter_a":"We're all equal so we must all be equal physically right? Yeah no.","post_message":"“What happened to protecting naturally born females?”"},{"comment_id":"10152859256761051","commenter_b":"Sick ! Needs the same done to her !","commenter_a":"They all deserve prison for life without parole!!!","post_message":"The judge looked this grandma in the eyes, called her the most evil person he had ever met and sentenced her to 4 life terms."},{"comment_id":"492872274234399","commenter_b":"Yes , but if an illegal begets an illegal. Guess what it's still an illegal in titled to nothing.","commenter_a":"Just because an illegal baby is born on uur soil does not make them a US CITIZEN. ........","post_message":"Breaking...WAY TO GO TEXAS!"},{"comment_id":"1687537648127046","commenter_b":"Allison Henn","commenter_a":"I had to solve this once lol","post_message":""},{"comment_id":"10153188400962894","commenter_b":"@username pediatricians have long ago said this is unsafe for children. Their immune systems cannot fight off adult germs. I am sure you want to keep your niece safe, right?","commenter_a":"North West is really cute. Kim should probably stopped letting Khloe kiss her baby in the mouth tho","post_message":"Kim Kardashian Shares Adorable New Photo Of North West With Her Curly Hair"}]
