[{"comment_id":"10154576995593812","commenter_b":"And Hillary gets away with what?","commenter_a":"#Belicheater","post_message":"A federal appeals court has rejected Tom Brady's attempt to get a new hearing on his 'Deflategate' suspension. @webpagelink"},{"comment_id":"10153177942114170","commenter_b":"Once a LIAR, always a LIAR! But what difference does it make at this point! Hillary is Obama in a skirt! Another Democrat that Bows to ISLAM and leaves Americans being attacked by Muslim Terrorists, TOO DIE!","commenter_a":"She should go to jail rather than the White House. Worst Secretary of State ever along with Obama the worst President ever.","post_message":"How stupid does she think we are?"},{"comment_id":"10154292221654411","commenter_b":"Aka....draw and quarter Snyder.....lil bitch","commenter_a":"Cunts are a shame....get rid of them...","post_message":"The problem isn infrastructure but rather 'a hate crime and mass poisoning of Black and poor people,'  filmmaker Michael Moore."},{"comment_id":"10153145409004342","commenter_b":"Woman why the hell are you on a Houston news site? Get the hell back to Arkansas.","commenter_a":"You have to kill someone because they pissed you off....seriously? Houston a breeding ground for mental cases","post_message":"Police say a man who was shot and killed while changing a flat tire may have been targeted due to an altercation at another location."},{"comment_id":"10152947957269342","commenter_b":"Kill her","commenter_a":"Deviks advocate. There are guidelines for murder. She didn't intend for the baby to die and took it to the hospital So the only real charge would be manslaughter, or murder 2/3 if the baby took unassisted breath which at that gestation isn't likely","post_message":"JUST IN -- Prosecutors say the woman accused of luring an expectant mother to a basement and cutting the baby from her belly will NOT be charged with murder.  FULL STORY ---> @webpagelink"},{"comment_id":"895076240539004","commenter_b":"Angela and Sheira close your fucking legs, Whores!!!!!!!!","commenter_a":"Unborn Baby's are Human at the time of conception.....Duh.....that's not hard to figure out. When you abort AKA MURDER a Baby at any time after conception it is very simple.....IT'S MURDER.....just watch our Court system when a drunk kills a pregnant woman they will be charged with the MURDER of the child as well. There are just some people that will argue against the facts to try to justify MURDER but make NO MISTAKE it's MURDER. Just because you get pregnant and it's inconvenient and you call it abortion, does not change the fact everyone knows in their heart IT'S MURDER.","post_message":"How cool is this?"},{"comment_id":"558942897646607","commenter_b":"If killery wins we WILL NOT HAVE A COUNTRY! !! ...NWO...WILL SUCK!!!!","commenter_a":"'@username, Hermain Cain is a staunch supporter of the Second Amendment!","post_message":"Live Now: Donald J. Trump's running mate Mike Pence addresses supporters at a rally in Atlanta, Georgia."}]
