[{"comment_id":"10152716358611680","commenter_b":"Red herring fallacy and straw man fallacy.","commenter_a":"This is sexist and Politico and the lib media are trying to hide this story. Nice try. @webpagelink","post_message":"Kelley Paul says 'to have that label put on him, that really upset me.' @webpagelink"},{"comment_id":"10153285740536336","commenter_b":"Gays can't create life? Hmm. I guess lesbians can't get pregnant or gay men can't inseminate a surrogate either. Anyone can create a life. But can they nuture a life? Plenty of gay parents out there do, while a shitload of straight parents don't.","commenter_a":"Sickening, YES! Just more proof of the changing times and how people deviated from their upbringing b/c they want to do what they want; not what is right...no respect for self or others....DISEASE!!!","post_message":"BREAKING NEWS: Ireland votes to legalize gay marriage. The traditionally Catholic nation saw 62.1 percent of Irish voters vote “yes” on gay marriage referendum in what is seen as a landslide victory for gay-rights advocates."},{"comment_id":"613869622133977","commenter_b":"She wants to, if you see the full speech, it is quite clear.","commenter_a":"I didn't vote for Angela Merkel but I have to come to her defence. I don't believe her aim is to discriminate anyone. She is speaking about 'Vollverschleierung' which means to completely cover the face. I don't think she wants to ban all veils.","post_message":"Elizabeth Plank explains her opposition to German Chancellor Angela Merkel's proposed veil ban."},{"comment_id":"931354546899967","commenter_b":"beggars can't be choosers. Get off food stamps and work harder if you want all hala food. Ungratefully, entitled beggar","commenter_a":"If you don't like what here already go home. We dont owe you anything.","post_message":"Shameful and UN-AMERICAN!"},{"comment_id":"733056316849024","commenter_b":"Bitch has a nasty vagina","commenter_a":"They're wondering how to explain to their daughter that Trump won. How do you explain an adult woman wearing a vaginal out in public? What the heck is wrong with these people?","post_message":"ClashDaily.com"},{"comment_id":"1054986811286811","commenter_b":"She is looking weak","commenter_a":"Hillary Clinton is as transparent as mud. She's so deplorable....no wait...I don't want her sharing my basket. Trump/Pence 2016","post_message":"Question of the Day: Do you think Hillary Clinton has been transparent about her health? Share your thoughts below!"},{"comment_id":"1531352266898026","commenter_b":"'She' don't have dicks, its a he","commenter_a":"Can we please stop misgendering her?","post_message":"'I had tits and a dick and was tattooed and alternative, and I could come over and over again on camera.'"}]
