[{"comment_id":"10157782729605725","commenter_b":"She's a fake!!","commenter_a":"Mlp","post_message":"An honor to be at the Polish National Alliance in Chicago, Illinois - meeting with & speaking to the Polish American Congress. Thank you!"},{"comment_id":"10154051866134087","commenter_b":"His bitch better get ready to be deported and come here the right way","commenter_a":"fuck you ass","post_message":"Trump says maybe his deportation task force will be able to deport Clinton. READ MORE: @webpagelink"},{"comment_id":"10155229441268352","commenter_b":"She is a grown ass women","commenter_a":"For all j-lo haters y'all can go straight to hell she is in love","post_message":"Daaaayum! Drake and J-Lo are KILLING THE DANCE FLOOR… watch Drake GRIND ON J-Lo's FAMOUS BOOTY… then slow-dancing together like they about to go make babies!! (Video -- Super HOT!!) ----> @webpagelink"},{"comment_id":"1935250666534672","commenter_b":"How about i kick you instead?","commenter_a":"Look like they're from the bloody Purge","post_message":"... But refuse to quit because they 'love the limelight'."},{"comment_id":"917667135033132","commenter_b":"The ignorance of this bitches statement is mind boggling","commenter_a":"No McDonald's worker anywhere on this planet deserves anything But minimum wage... How are you gonna demand a higher wage but you cant even make sure there are fries in the bag with my order.... Always giving people the wrong shit, no sauce, no straw... Please pull up and wait at our drive thro becuase we cant make fast food fast enough.... Get the fuck outta here... Give that extra money to doctors or something... They cant fuck up or your dead..... Absolutely ridiculous... Fast food isn't a damn Career.","post_message":""},{"comment_id":"560508577442430","commenter_b":"No, illegal immigrants might think it's OK, like they already do from FD up thinking.. Our economy isn't built to give, give, give to u and the illegals. So yeah, they should go back to mexico, duhhh.","commenter_a":"Ur working at a fn hotel of course there's no job security. Fn fools.. smh. Don't like ur current situation? Gtf off ur ass n change it stop waiting for someone else's hands out!! That's ppls problem now days, want everything handed to u without doing a fn thing to deserve it.","post_message":"\"How do I feel working for Trump? I'm an immigrant. It's a job...We don't have security.\""},{"comment_id":"10153344730251130","commenter_b":"The County Clerk who refuses to issue marriage licenses to gay couples makes the same argument. This job responsibility should be no surprise to her. If she can't do it, then she needs to be in a different job.","commenter_a":"Surely she knew when she took the job that serving alcohol was part of it. Go find a job that fits your lifestyle.","post_message":"\"No one should have to choose between their career and religion.\""}]
