[{"comment_id":"1006685692721909","commenter_b":"hahaha, that's not what i had in mind! Just thought it was cool!","commenter_a":"@username Ali Sharp cool concept","post_message":"This is wonderful <3"},{"comment_id":"1122482747785208","commenter_b":"Nice fat white chick.....the black man's kryptonire....","commenter_a":"\"He shouldn't be golfing he should be working. How dare he.\" Sincerely, Everyone who didn't care when GW Bush did the same thing while he was in office.","post_message":"WATCH: President Barack Obama sinks 40-foot chip shot on 18th hole while on Hawaiian vacation: @webpagelink"},{"comment_id":"1191302950909160","commenter_b":"Time for the Trump wall","commenter_a":"we don't care that much where they come from, we only care to DEPORT them ASAP","post_message":"UNREAL! Look how many illegals from other countries are now coming in through Mexico!! WHERE they are from is ALARMING! @webpagelink"},{"comment_id":"1513285485378585","commenter_b":"Mmmmmmmhm! I noticed that. Pussy","commenter_a":"How true","post_message":""},{"comment_id":"10153432953951130","commenter_b":"Its not hard at all. Check craiglast there everywhere. I can sell you mine. Thats the point!!","commenter_a":"It's such a pain in the ass to get guns now. Why would anyone want more gun laws?","post_message":"A majority of Americans want stricter gun laws, and now we have the poll numbers to prove it."},{"comment_id":"1402866583068901","commenter_b":"HOW DO YALL EXPLAIN RICE COMMITTING CRIME AGAINST THE U.S, HOW BOUT HOW OBAMA LIED ABOUT ASSAD NOT HAVEING CHEMICAL WEAPONS. OBAMA LIED ! HOW BOUT TRUMP BEING PROVEN RIGHT ABOUT THE SURVEILLANCE ON HIM AND TEAM! HOW DO YOU FELL ABOUT YOUR CHILDREN BEING TAUGHT SHIRA LAW IN SCHOOL. ECT....","commenter_a":"I am glad to see to the media is holding their ground and calling him out. We need them to stay strong and sound the bullshit alert as needed.","post_message":"Trump lied SO much today, CBS had to call him out. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153796772929411","commenter_b":"They kill civilians anywhere they go. Worse butchers then IS nearly..","commenter_a":"Terrible.","post_message":"US special operations analysts investigated #Kunduz hospital for days prior to the deadly October 3 attack, describing it as a base of operations for a Pakistani agent coordinating Taliban activities, despite despite repeated pleas by the MSF."}]
