[{"comment_id":"10154152866009575","commenter_b":"@username Maybe she did not know her hair was too long like to cover the screen? Where I live people ask me often to remove my hair from the seat at the bus because is too long so I have to because my hair does not move by itself. It is funny when they realize I am not a woman when I face them lol I say I am sorry and take my hair over my chest. No big deal and sooo what he was trying to watch anyway that was too mad, porn? hahahahaha :)","commenter_a":"People taking pictures and making a stink on social media instead of being an adult and asking someone to do something.","post_message":"An airplane passenger flung her ponytail over the back of her seat, covering the screen of the person behind her. That annoyed person snapped a picture and it's going viral. What are some of your biggest pet peeves?"},{"comment_id":"927164187324440","commenter_b":"A real woman appreciates foreskin and it's functions. I prefer a whole full functioning penis.","commenter_a":"Yeah well.. circumcised guys get blown more often scientific fact","post_message":"And now for a quick but fun history break from CollegeHumor. - Rollie Williams"},{"comment_id":"563081667216516","commenter_b":"Where the white woman at !!","commenter_a":"Markus please don't allow this on my pic I have very young children One is my 6 month old grandson. And 4 other grand kids. Please help Me out lets work to gather to stay Younger. Love auntie Diana","post_message":""},{"comment_id":"533141560209757","commenter_b":"Brainwashed stupid women!!!!!!!","commenter_a":"Let them go back to the country they came from if they want to wear their Burkas","post_message":"This Muslim woman refused to remove her veil, then something awesome happened. Good. There's no room for fanatical Islamic culture in the US. Do you support a Burka ban?"},{"comment_id":"1103808136307925","commenter_b":"Don't explain...just tell her to go, now!","commenter_a":"Why don't these people go now ??? It is no big loss !!!!","post_message":"Someone really, really, really needs to explain to her how this whole process works."},{"comment_id":"10154161281331636","commenter_b":"But if you are in line at the time of closing they have to stay open to allow you to vote. This orange plague on our Country needs to GO!","commenter_a":"Seriously he doesn't like democracy you elect him you'll have a dictator who you will have to overthrow","post_message":"BREAKING"},{"comment_id":"936217929734331","commenter_b":"Miley is the best white feminist ever! Also, Bangerz was a half-decent album","commenter_a":"She is really a sweetie has a good heart.","post_message":"There's a side of Miley Cyrus that just about everyone misses."}]
