[{"comment_id":"10154395372381656","commenter_b":"@username let me guess you stand on a corner and watch to see if there anyone putting up a sign after you park legal must work for city and help a 5 man team screw in a light bulb....","commenter_a":"Don't park in a tow zone and you'll be fine. lol.","post_message":"\"None of us has been arrested for stealing,\" he said."},{"comment_id":"10152876069325950","commenter_b":"Enjoy your retirement Bob","commenter_a":"A straight shooter w/ a sense of humor and a poet to boot. Sunday won't be the same. We'll miss you, Bob.","post_message":"Bob Schieffer's 46-year career at CBS ends this morning with the 10:30 a.m. ET broadcast of \"Face the Nation.\" As we say goodbye, here's a lighter reflection with some of his best bloopers across the years."},{"comment_id":"1166767616720554","commenter_b":"@username - Deceit + Greed = Hillary Clinton.","commenter_a":"Here is what a Real Poll looks like in America. Please take the Time to Read.. A Total of 50,000 people Polled in 50 States.... PG Farnsworth We have just completed our own poll since we cannot get factual information from the mainstream media!! We called 1000 homes in each of the 50 states and asked basic questions on the economy, terrorism, immigration and presidential pick. Economy was the number one factor that Americans are concerned about and terrorism was number two. Presidential pick was Trump by a large percentage. Trump 33478 votes 67% Clinton 9788 Votes 19% Undecided or other 6739 votes 13% My friends and I are all Graduate students from all walks of life we meet to discuss stuff. 13 people who like and have served in the Military. It took us most of two weeks to be sure our calls were to all people and not ...","post_message":"U.S. Department of State reports show that 2,340 Syrian refugees arrived last month in the United States."},{"comment_id":"10153731561481336","commenter_b":"You're an idiot Elizabeth!","commenter_a":"The shooter was a conservative republican. That seems to be a common theme in mass shootings.","post_message":"One law enforcement official described the shooter as an \"angry young man who was very filled with hate.\""},{"comment_id":"1140745955997895","commenter_b":"@username just who do you think you are? It's not over until the FAT lady sings.","commenter_a":"Are you kidding me? Trump nor Newt will NEVER get NEAR the White House!!!","post_message":"Would you like to see Newt Gingrich serve as Chief of Staff in a Trump administration?"},{"comment_id":"10157484651970725","commenter_b":"@username PAM she is already DESTROYING THE COUNTRY !","commenter_a":"Go trump ! So, 96% of Hillary's charitable donations went to the Clinton Foundation! Yeah, 96%, they donated to themselves.","post_message":"Unbelievable! Thank you Erie, Pennsylvania. This is a MOVEMENT! I have no doubt that we are going to WIN -- and MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"10153457336028525","commenter_b":"Brian","commenter_a":"Jose J Torres","post_message":"A cure for diabetes? It could happen, and they've already begun testing it in a small number of diabetic patients. STORY: @webpagelink"}]
