[{"comment_id":"1663378140627092","commenter_b":"wow cant wait to see u guys in 10 years w ur sugar daddy/ies, and ur lavish lifestyle its gonna be great","commenter_a":"@username time to sign up😂","post_message":"This summit actually teaches young women how to score a sugar daddy..."},{"comment_id":"10154333518999641","commenter_b":"It's about time america should have their own female leader, if they truly wanted a real change, that lady touch would make a real difference for a great nation to reach further.","commenter_a":"VOTE FOR HiLLARY CLINTON 2016 . Hillary for America","post_message":"\"We just put the biggest crack in that glass ceiling yet.” - Hillary Clinton appears via satellite at DNC in hat-tip to history @webpagelink"},{"comment_id":"10154378006503352","commenter_b":"What is a thot?","commenter_a":"Why do they have to call her a thot??? Ridiculous article","post_message":"New photos of Amber Rose Doing Naked Sunbathing Indicate She Might Have Been Wearing Booty Pads All Along – Her Behind Disappeared! (PHOTOS)"},{"comment_id":"1716476818593163","commenter_b":"Well she is a WITCH.","commenter_a":"what a joke. anyone with any brains would look at her trend to not do the right thing. we have had enough bad behavior in the white house the past 2 elections we do not need more.","post_message":"According to Hillary's campaign manager, voters trust Hillary because she's completely upstanding, honest, and scandal-free. Claims to the contrary are nothing more than a GOP witch hunt."},{"comment_id":"10154559910664087","commenter_b":"@username: Are Christian refugees beheading non-Christians?","commenter_a":"They can rewrite it. However, they still have the footage of Trump calling for a Muslim ban on the campaign trail.","post_message":"BREAKING: White House attorneys are working on rewriting the language of President Trump's immigration ban following yesterday's dramatic defeat in the appeals court."},{"comment_id":"10153618033509575","commenter_b":"Seriously? Have some compassion lady","commenter_a":"Dude! Buy an eye patch! Nobody wants to look at an empty socket.","post_message":"An Indianapolis veteran diagnosed with ocular melanoma has filed a tort claim against the VA.  By not ordering an MRI, he says they failed to diagnose a cancerous tumor that not only cost him his eyesight but will take his life."},{"comment_id":"10156442483085231","commenter_b":"Bitter Brother Committee..... If he didn't want a kid he should've strapped up....but since he wanted a souvenir from Ciara the singer, but not from Ciara the woman, he has a fiscal responsibility to provide for his kid....that's so 1940 to say \"she trapped him\" because a man can alleviate all of that by condom, vasectomy or not \"bussing it wide open\".....if they're so worried about \"getting trapped\", they should do something about it...I mean since \"females\" are sooooo devious","commenter_a":"She stay eating off her dudes... First it was Missy, then bow, then 50, then future, then Russell, now future again... That snatch is a trap... Russell better tread carefully","post_message":"Loose lips causes lawsuits. Ciara isn't playing when it comes to protecting her name and son."}]
