[{"comment_id":"585707061582274","commenter_b":"Zoe, your doctor told YOU not to lift that amount of weight. If the doctor told that woman not to, I'm pretty sure she'd stop. Everyone's body is different.","commenter_a":"This is just sad , smh more concerned about looking fit and all that , be healthy that's what that baby needs not for you to be fit. Wait till the baby is born and get to your regular routine. I really hope the baby comes out ok smh all that shaking and heavy lifting Pretty sure you just gave that child problems","post_message":"Fitness Model Chontel Duncan Isn't Stopping Her Intense Workout Sessions Even During Her Pregnancy!"},{"comment_id":"1098350870176382","commenter_b":"All ILLEGAL immigrants are criminals. Come here legally and I will welcome you with open arms and warm smile.","commenter_a":"anyone with common sense knows that all immigrants aren't criminals, just like all whites aren't bigots, all blacks aren't ignorant, and all hispanics aren't lazy.","post_message":"ICE program focused on ‘national security’ detains immigrants with zero criminal convictions."},{"comment_id":"1758399887778329","commenter_b":"Hillary Clinton is as corrupt as they come, she needs to be held accountable and put in a prison cell. Corruption in Washington is running rampant and WE THE PEOPLE are sick of it.","commenter_a":"Lol... At least she appears to be truthful with her daughter","post_message":"Hillary Clinton told her daughter in an email that there was a terror attack in Benghazi, according to an email provided to the Benghazi Select Committee. @webpagelink The GOP-led committee will discuss the report in a news conference at 10a ET."},{"comment_id":"10153483204295667","commenter_b":"Nardine","commenter_a":"Robert Taylor","post_message":"Do you see a ghost in this photo? Henry Yau took this photo at the Stanley Hotel, the real-life inspiration for Stephen King's 'The Shining.' Yau says no one was on the stairs."},{"comment_id":"10154195854358256","commenter_b":"Nice strawman Julia. Careful you don't smoke around that one.","commenter_a":"Palin is as irrelevant on the right as Debra Wasserman Schultz is on the left.","post_message":"Sarah Palin, take a seat."},{"comment_id":"10153722201678812","commenter_b":"He is a Hero..","commenter_a":"Prayers for family. The boy is a hero","post_message":"Charlie Finlayson had to leave his father and set off alone on a hiking mission to find help: @webpagelink"},{"comment_id":"1129680070463931","commenter_b":"I don't know where you get this clump of cells thing... maybe in the beginning... before a mother even knows she's pregnant, but by the time they would know that fetus reacts to pain and sounds (especially it's mother's voice)... fairly quickly it dreams... science has shown this... putting religion aside... before the end of the 1st trimester it is a living being and respirates like any other human (just gets its oxygen and nutrition differently). Much more than a lump of cells. At 18-22 week the child can be born and live a normal life 9 time s out of 10 even if the mother's life is in danger at this point there is no more dangers to birth over abortion. On top of that... healthy infants get adopted by people that want them...","commenter_a":"This has nothing whatsoever to do with humane treatment. It's another attempt at shaming the woman for making her own personal choice and finding a way to punish her. This is also another ill-fated attempt at giving a fetus, a few cells, personhood. A fetus nor a clump of cells can be made to be treated as a once living, breathing human being, nor should it be treated as such. As soon as these \"lawmakers\" can dictate that, it's a short road to personhood, to claiming murder and denying a woman a choice and having autonomy over her own body.","post_message":"About 35,000 public comments poured into the Texas Health and Human Services Commission about the rule change."}]
