[{"comment_id":"10153108653466770","commenter_b":"Psycho woman.","commenter_a":"Ho hum!!!","post_message":"Debbie Wasserman Schultz says Donald J. Trump's “misogynistic comments” are “reflective of what the entire Republican Party stands for.”"},{"comment_id":"10152929837961130","commenter_b":"He would be a hero. If he were a girl, she would be a heroine","commenter_a":"\"Hero\" or \"heroine\" or are you undecided?","post_message":"This just made our week."},{"comment_id":"10155378344568132","commenter_b":"As phoney as her boobs...","commenter_a":"That fantasy world u r capable of living in will soon have u filing for bankruptcy Missie!","post_message":"Mariah Carey says she's \"incapable of being in the real world and surviving."},{"comment_id":"10154767405540575","commenter_b":"So surprised (NOT)!","commenter_a":"That has been standard operating procedure for n0bama and his corrupt administration since day one........","post_message":"BREAKING NEW REPORT FROM FEDERAL AUDIT...  Stupid Facebook pulled in the old title which has a typo!"},{"comment_id":"10153553565406955","commenter_b":"I can't wait until a loonie lib woman gets attacked by a filthy Muslim","commenter_a":"Muslims versus liberals...this is going to be fun.","post_message":"Topless protesters disrupt Muslim conference in Paris..."},{"comment_id":"1392674554144410","commenter_b":"I assume Soros is paying for all the protests! The Koch brothers provide jobs!","commenter_a":"As Gomer Pyle would say....surprise, surprise surprise! Busted yet again. The little boy who cries wolf......","post_message":"We just found out who the REAL face of the Women's March is... see the funder who's pulling the strings.  Sadly, we should have seen this one coming."},{"comment_id":"10152729868175667","commenter_b":"Oh calm yer tits..it's just fun","commenter_a":"I may stop following USA Today because of this specific post. The guy isn't even old enough to run and you're reporting it like its important, which just means you made a joke out of yourself.","post_message":"President Flame would be a pretty epic name. Just saying."}]
