[{"comment_id":"10153114597787507","commenter_b":"I thought women were the snakes","commenter_a":"An old lady told me about 30 years ago: Some men would screw a snake if someone would hold the head. So there you go!","post_message":"Go get em!"},{"comment_id":"10153268633329197","commenter_b":"They are all dangerous!","commenter_a":"She was a nurse and still went tanning? I'm confused. Surely she knew it was bad","post_message":"This Alabama nurse was an avid user of tanning beds, sometimes going 5 times a week! Now, she has developed skin cancer and she wants to help stop others from getting the disease. See the graphic way she shared her story --->  @webpagelink (WARNING: this story contains graphic content)"},{"comment_id":"676035105920401","commenter_b":"they wouldn't be happy with anything they are a bunch of animals and don't want peace all they care about is destruction send them back where they came from give them nothing","commenter_a":"Don't like it go home!","post_message":"Muslim refugees are refusing to go into the shelter, demand they be given apartments. If they are seeking safety from a war zone, they should be happy with a shelter. Do you think this demand is ridiculous?"},{"comment_id":"1169322949765857","commenter_b":"I understand that the left hates and has an unnatural desire to control everyone around them. It's just what they do; and it's the reason they should never be allowed to hold any position of power. To hate for no good reason is insane. Obviously none of the people here who hate Trump have no idea WHY they hate him except maybe that they were manipulated to do so. You don't have to like him; you're not hiring someone to be your friend (although that might be the only way you can get friends); you're hiring a POTUS so vote with honest logic. Not feelings.","commenter_a":"There's no denying the fact that he's more wealthy than even the elitists in Washington can hope to be; AND it's obvious that if you're that wealthy; the IRS has already seen your taxes so there's nothing hidden about his returns except just like yours; they're not PUBLIC knowledge. The only ones who want to make a big deal about them are the people who are scraping the bottom of the barrel trying to find something they can twist into a questionable issue that the most ignorant of voter will be swayed with.","post_message":"“There’s nothing to learn from them,” said Donald J. Trump."},{"comment_id":"10153724288582577","commenter_b":"Your wife is ugly.","commenter_a":"Fuck you Zuckerberg. I'm gonna blast Facebook non stop u faggot piece of shit","post_message":"Facebook CEO Mark Zuckerberg was caught discussing the censorship of anti-migrant posts at the United Nations development summit Saturday while speaking with German Chancellor Angela Merkel."},{"comment_id":"10154830329021830","commenter_b":"wow what shit if a celb said something worth hearing then ok fine but most are just fucked up losers that cry for attention","commenter_a":"Anthony Turner","post_message":"Ashton Kutcher Helps Reiterate Why Tomi Lahren & Co Are Full Of Shit"},{"comment_id":"10154412876021491","commenter_b":"Does this tour detour to the location of the White House MLK Bust? I hope they know where it is. Don't depend on Time, though.","commenter_a":"Shruti Maheshwari","post_message":"Here's how to score a major deal on a scenic getaway."}]
