[{"comment_id":"602527166571478","commenter_b":"Certain ppl should stop reproducing","commenter_a":"'@username fuckin retard","post_message":"So Dumb: She Thought She Found A Hack To Charge Her Iphone!"},{"comment_id":"10153154499205047","commenter_b":"I agree, so strap on your guns and make sure we have at least 30 per mile waiting 24 hours a day, around 50,000 a day, and see how long we can do it until Trump gets the 7 billion dollar wall built, and then starve everyone, because we won't have anyone to work on our farms.","commenter_a":"It is obvious they are crossing our border and Washington is doing absolutely nothing to stop it. It is also obvious that there will be another attack here in America and Washington is doing nothing to stop it. Their solution is to take our guns away from us so we have no means of protection what so ever. America wake up! We must get rid of Obama before he gets us all killed, it is just that simple!!!","post_message":"We know ISIS wants to infiltrate our homeland, yet our borders remain unsecured.  It's time to take action.  It's time to guard our borders.    Sign our petition if you agree: @webpagelink"},{"comment_id":"10153756549625667","commenter_b":"No Trump No Hillary, any body else, American have the best.#","commenter_a":"like my page awlad nass","post_message":"As the Iowa State Fair got started 20 years ago, two people were shot dead in the exhibitor campgrounds."},{"comment_id":"741319736029564","commenter_b":"'@username. That's ridiculous.","commenter_a":"It's just sad. Sad. You are more worried about getting the United States into a war than you are taking care of the people of your own state. @username - makes a great point why, why Tom do you keep opening yourself up to this and then turning around and bragging about Trump being as good as his word. That's worked well for this country so far hasn't it?","post_message":"The president said we were putting Iran on notice, and I'm glad to see he's as good as his word. Iran's ayatollahs will stop their provocations only if the U.S. shows strength and resolve. These sanctions are long overdue, and they're sending the right message to the regime in Tehran: Cease and desist immediately."},{"comment_id":"10153103857862377","commenter_b":"I think a woman who has been victimized should be allowed to regain control of her life. She should not be required to Continue a pregnancy she doesn't want","commenter_a":"But what about the women in those cases! Shouldn't they be in control of their bodies after being violated so inhumanly? Of course they should! I just lost lots of respect for you! You can't make judgements on those women or decisions for them! Someone has to stand up for them!","post_message":"'Rape and incest, I would not be in favor of killing a baby because the baby came about in that way. And all you have to do is go and look up the many stories of people who have led very useful lives who were the result of rape or incest,' Carson said."},{"comment_id":"10153728622221336","commenter_b":"Women do have their own football league, Jake...","commenter_a":"A lot of sexist men just cried.","post_message":"The Oakland Athletics have hired Justine Siegal, MLB's first female coach.  Siegal is also the founder of Baseball For All, a nonprofit organization that provides meaningful instruction and opportunity in baseball, especially for girls. @webpagelink"},{"comment_id":"1204331449626601","commenter_b":"Lol","commenter_a":"I know I probably shouldn't but I find this diabolically hilarious.","post_message":"Someone sneaked up behind him  (via Daily Mail Australia)"}]
