[{"comment_id":"10153015715557452","commenter_b":"Why leave him alone???? He is an admitted rapist! !!!!","commenter_a":"Leave Pill Cosby Alone.","post_message":"Three more women who were allegedly sexually assaulted by Bill Cosby came forward during a press conference Wednesday, bringing the number of accusers up to nearly 50. abc7.la/1N4Pq51"},{"comment_id":"10152790517586051","commenter_b":"What a piece of crap he is. Cut his manhood off and feed it to him.","commenter_a":"we need a little eye for an eye justice","post_message":"This man broke in, put a knife to a woman’s throat and raped her as her husband lay right beside her. And he didn't stop there."},{"comment_id":"949558251844940","commenter_b":"All them women on the house wives shows","commenter_a":"@username Giselle Relleta","post_message":"Are you wearing dead animals on your EYELASHES?"},{"comment_id":"1075404492512556","commenter_b":"WTF was with that woman?!? She's just sitting in there? She should have been out of there so fast and getting those kids out. He had to keep yelling to get her out???? What a Moron. And they just stand there Casually once out??? I might be kissing the kids out of Gratitude that they were alive and Thanking the Officer that saved them. There is something Seriously WRONG with these women.","commenter_a":"So are they the baby sitters? They sure shouldn't be parents!","post_message":"Dramatic footage shows two women and two children being rescued by California Highway Patrol officer after their car catches fire."},{"comment_id":"10153748803376077","commenter_b":"Greed!!","commenter_a":"Whoa!!","post_message":"9NEWS Denver Broncos Insider Mike Klis has confirmed that quarterback Brock Osweiler is going to the Houston Texans."},{"comment_id":"944616275579231","commenter_b":"I don't see why modesty should be offensive to anyone but I do understand why nudity can be offensive or uncomfortable. I think in a respectful, civilized environment you find compromise. which I think we did for a very long time. Now everyone wants to right to be offensive while retaining the right not to be offended.","commenter_a":"I've never understood why people are offended by nudity. It's just a human body ffs everyone has one!","post_message":"Not sure I'd have the nerve, but it looks kinda freeing. - Maz Ali"},{"comment_id":"10153102979511545","commenter_b":"I heard of it last night on the news. Disgusting!!!","commenter_a":"@username have you heard about this?","post_message":"Just in: This is gross..."}]
