[{"comment_id":"10154130637278352","commenter_b":"I'm positive with all the comments you got some backlash lol, but keep in mind they're fucking disgusting bitches ha ha ha ha","commenter_a":"There's nothing wrong with breast feeding, but this is disgusting to put your almost 4 year old on the boob.... Want your child to drink your breast milk? invest in a pump....","post_message":"Mother defends breastfeeding her three-year-old son claiming cows' milk is bad for children as she encourages more women to feed toddlers this way"},{"comment_id":"10154730385206341","commenter_b":"Understand. Thank you.","commenter_a":"Hmmm, an army that establishes a state based on a single religious identity through violence and ethnic cleansing. Why does that sound familiar? Oh yah! Ding Ding Ding Ding! Is the big chief still living in the nineties? They already look like ISIS to most of the world, just a little less sloppy.","post_message":"\"The commanders are the ones who should set the rules of engagement, not politicians\""},{"comment_id":"936764406358981","commenter_b":"what tits. he was smelling her fart","commenter_a":"\"Joe stop staring at my tits, thanks.\" ~ Hillary","post_message":"Can you imagine?  Talk about our country going to hell in a handbasket…"},{"comment_id":"10153907516071178","commenter_b":"Colbert is out of touch with reality","commenter_a":"Colbert and Koppel who ?","post_message":"It's like a liberal media love-fest."},{"comment_id":"10153653816037377","commenter_b":"NO AMERICAN FLAGS!","commenter_a":"The color of Hillary stage is UN blue. No America to be found.","post_message":"As the Democratic National Convention entered its second day, presumptive presidential nominee Hillary Clinton's campaign is getting ready for Wikileaks to release more purloined emails and downplaying their potential impact."},{"comment_id":"10152863643681990","commenter_b":"Illegal immigrants should not be here to commit any crime. U. S. Citizens do not need the extra concern.","commenter_a":"Yes look at Dyllan Roof he looks Latino... He shoot 9 black people last month in church.","post_message":"IMMIGRANTS AND CRIME: Despite rhetoric in the Pier 14 shooting Francisco Sanchez case, immigrants do not commit more crimes that U.S. citizens. That's according to 100 years of research according to the American Immigration Council. @webpagelink"},{"comment_id":"1328638283841395","commenter_b":"Generational behavior.","commenter_a":"I've been saying that for over 20 years and people look at me like I've got two heads. Everyone feels entitled including the adults and they pass it on to their children and the problem get exponentially worse. Where and how does one put an end to this......","post_message":""}]
