[{"comment_id":"474933522694941","commenter_b":"No! We don't want any more of these people!","commenter_a":"AHH HELL NOO!!","post_message":"60,000? Can you imagine how many terrorists among them?"},{"comment_id":"1178310438875078","commenter_b":"Now we have to feed, clothe and house this murdering POS! Like the other 60 million illegal aliens aren't enough! Mexico's corrupt government couldn't keep track of him! Take him out to the desert and open fire!","commenter_a":"Get a rope!","post_message":"DRUG KINGPIN heading our way (until he escapes, of course) details: @webpagelink"},{"comment_id":"10153532910231336","commenter_b":"It's a food product, not plastic. Keep it real.","commenter_a":"It's not even real cheese anyway!! People, you're eating flavored plastic to begin with!","post_message":"RECALL ALERT: 36,000 cases of Kraft Singles cheese slices recalled after customers reported choking on the plastic wrapping. (via Fox Business)"},{"comment_id":"1739731709624496","commenter_b":"Dumb racist bitch","commenter_a":"I think she's stupid - like literally too lacking in intelligence to do more than jump onto an under informed, opportunist bandwagon.","post_message":"Don't let the door hit you..."},{"comment_id":"10153117067891350","commenter_b":"Lil cunt","commenter_a":"Abbey Maclean","post_message":"This is just too cool! Watch our own Natalie Morales transform into a zombie for The Walking Dead."},{"comment_id":"10154003017405575","commenter_b":"Liberal bitch!!","commenter_a":"The entire Clinton family needs to take their millions and go home and stay there.","post_message":"This should be a wake up call to the #NeverTrumpers. They're coming after your guns."},{"comment_id":"717054201797155","commenter_b":"Yeah, she'll get sammich stains all over the front.","commenter_a":"That's a strange dress to wear in a kitchen... Doesn't she know women are better off today than being nothing more than owned objects","post_message":"Kellyanne Conway dressed as the era Trump wants to take America back to. #InaugurationDay"}]
