[{"comment_id":"10155151407594575","commenter_b":"Illegals have to hide behind walls to avoid deportation. They build their own walls. Saw absolutely no effects from a day without immigrants, Guess they don't really matter.","commenter_a":"Awesome.","post_message":"Business owners are standing behind their decision to fire workers who participated in 'A Day Without Immigrants' protests.  They say it's not a political stance but rather a business decision.  'If you're going to stand up for what you believe in you have to be willing to pay the price.'"},{"comment_id":"10153238433806782","commenter_b":"So you have no problem sharing a restroom with men? That's not how I perceive most women feel","commenter_a":"Oh for Pete's sake, does government really belong in the restroom???? Work on something that really matters! Schools, roads, infrastructure, the things government does belong. Are you going to post guards in every bathroom and have to check your 'plumbing' to see what you are equipped with to make sure you are going to right one???","post_message":"A similar bill was filed in Oklahoma: @webpagelink"},{"comment_id":"10154736458587300","commenter_b":"Clinton's own faith says she should not be elected. For it is told in the bible, ' For the love of money is the root of all evil; which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows.' ...and Jesus said to the Money Changers that his house was a house of prayers and they had made it into a den of thieves' There is no Baptist, Catholic, or any other Christian that should be voting for Hillary Clinton. Next class...Murdering children in the womb!","commenter_a":"Geraldine Donze Berlingeri this is amazing mom!","post_message":"Protons destroy cancer cells while avoiding healthy tissue and minimizing side effects."},{"comment_id":"10153715291715950","commenter_b":"Sorry Sara Sterling you wouldn't know the NRA from a CPA. Guns were here before you and they'll be here long after you. They can pass all the unconstitutional laws they want the gun owners will not comply. If you don't like it well then your free to pack your sh*t and leave there isn't anybody forcing you to stay here. The earth is huge...","commenter_a":"CBS once again reaching with their BS agenda! Why don't you report how gun sales are at a record high? Obama is the best gun salesmen ever. If a government ever tells you to disarm yourself you need to arm yourself!","post_message":"This brother shares the story of his family's tragic trip to a gun range."},{"comment_id":"10156716294680725","commenter_b":"Trump is a scum bag who steals from Veterans!!! @webpagelink","commenter_a":"Never liked Cruz and I thought Rubio seemed like a nice guy. Not anymore...give em hell @username, your the only man that can pull this off. You have had my vote from the beginning.","post_message":"THANK YOU #TrumpTrain! Lets make it a great day! Preparing now for rally at Macomb Community College- here in Michigan!"},{"comment_id":"10153479315413984","commenter_b":"2 wonderful women !!! just shoot me now....","commenter_a":"Thank you Bristol ! Well said. We all need to start standing up to these people.","post_message":"BOOM! Bristol just dropped a major truth bomb on Miley, and there's NO way she can argue the young Palin's point...  Do you agree with what Bristol Palin said here?"},{"comment_id":"10153213322076051","commenter_b":"First of all, this is a fake.","commenter_a":"looks accurate to me what the problem? does the truth hurts there wittle feelings","post_message":"This is the 'memorial' for Michael Brown that went up on a police Facebook page."}]
