[{"comment_id":"1035959943168617","commenter_b":"@username Trumper Humpers have elected her through their ignorance.","commenter_a":"We will never forget scum like u Vote TRUMP","post_message":"Did Obamacare deliver lower premiums & more choices? No. Our office has done the research. Read our full report here: @webpagelink"},{"comment_id":"10154258976231770","commenter_b":"@username and for the record we did do something about, we went after the people responsible for it! It just took 10 years because these animals lives in caves, and theses lots of caves over there!","commenter_a":"Trump said he will take care of America first and he is he said he will deport Illegal aliens and he is he said he will bring back jobs to America and he is and he said he will build a wall on our southern boarder and he will !!! AMERICA FIRST !!!","post_message":"\"There are lots of constitutional questions that reasonable people can disagree about. Whether the president can exclude foreigners from seven terror-prone countries is not one of them,\" writes Ann Coulter."},{"comment_id":"10154146066447623","commenter_b":"@username Im against this executive order because it wasnt thought out very well at all and is just a blanket order to block everyone that is a citizen of certain countries from getting into America, even if theyve been here for years and just happen to be out of the US at the time. Im all for protection, but Trump's actions are based on nothing but his ignorance and fear. That is no way to live and that is no way to run a country.","commenter_a":"If DHS doesn't support this, isn't that a sign that maybe it's not the right thing to be doing? I'm pretty sure they're not a liberal organization, so this isn't a partisan issue. If you're scared of terrorists, I get that. But wouldn't it be better to open your mind a little and try to understand why so many people are against this?","post_message":"The Department of Homeland Security said Saturday it has suspended all actions to implement President Donald Trump’s immigration order."},{"comment_id":"440337219424652","commenter_b":"If your not Born in Africa, how are u African, He's right, I dont say I'm scottish, I say i'm an American, People need to stop playing this devide and conquer game the rich is playin thru the Media, which they own, thru the military with constant wars which profit the rich, and of CORSE MONEY, the one and only thing the rich care about. EAT THE RICH! They are the enemy!","commenter_a":"This is a very poorly written article","post_message":"A Florida Sheriff is in hot water after a 2013 racist rant he recorded on video has surfaced just before he begins to gear up for re-election. Watch the video then read our commentary by Lou Colagiovanni"},{"comment_id":"10155244013599384","commenter_b":"We the American people deserve to have accountability for all elected officials from all branches of Government!","commenter_a":"Thank you, @username, for doing your part in bringing this situation to light. I want nothing less than a full, thorough investigation of all possible inappropriate ties between Trump administration officials and foreign powers. Pursue this to completion, wherever that leads. Thank you again.","post_message":"Mike Flynn’s resignation was a step in the right direction – but there are many more questions that need to be answered before we can fully understand the relationship between the Trump Administration and Russia. Tune in now to watch my press conference on the topic live:"},{"comment_id":"1920123994941377","commenter_b":"Thought she was said she was leaving. Oh that's right she is an actress. Bad one at that.","commenter_a":"Hate to tell you this whippee but nobody really thinks you know anything you stupid bitch, and if you have any compassion for people at all, for God's sake cover your fugly ass face!","post_message":"Nobody saw this coming..."},{"comment_id":"10153478653615950","commenter_b":"Here come the pro-trump/Hillary is the devil comments. I stand by Hillary and will gladly vote for her in November. #Hillary2016","commenter_a":"She does not care, just wants them votes!!!","post_message":"Hillary Clinton  takes a swipe at Donald J. Trump's \"neutrality\" during her AIPAC speech: America \"can't ever be neutral when it comes to Israel's security or survival\" @webpagelink"}]
