[{"comment_id":"10153947557669753","commenter_b":"Police and your government bosses, STOP PREYING ON BLACK PEOPLE LIKE HUNTING WILD GAME AND SHOOTING US TO KILL!!!","commenter_a":"She is crying a hell of a lot more now that she is being interviewed than when sitting next to a dying man with her child in a car... Still say something fishy about the whole situation","post_message":"Police scanner recordings obtained by a local Minneapolis news station reveals that St. Anthony police officers pulled over Philando Castile not because of a busted tail light but because he looked similar to a robbery suspect due to his “wide nose.” The startling dispatch recording indicates that not only was Castile seemingly racially profiled for his “wide nose”, his girlfriend says that officers lied when they claimed the stop was for a tail light that was out as the tail light was seen... @webpagelink"},{"comment_id":"473513952773114","commenter_b":"She lied about her heritage stealing the opportunity from someone truly deserving and you thought she was principled. Lieing Hillary, Crooked Hiawatha!","commenter_a":"All it sealed was the fact that the vote I thought I'd be casting for Elizabeth Warren in 2020 will have to be cast elsewhere. Then Candidate Obama nailed it in 2008 when he said Hillary Clinton will change nothing, but say anything. A few pressers with Elizabeth Warren won't convince me that Hillary Clinton has suddenly become more progressive. It will just let me know that Elizabeth Warren isn't as principled as I had hoped and thought.","post_message":"Locked hand-in-hand in Ohio, Hillary Clinton and Elizabeth Warren sealed a powerful alliance Monday that could help unify the Democratic Party and give Donald J. Trump nightmares."},{"comment_id":"1009718899145010","commenter_b":"Well the Wicked Witch odf Washington has looked better noow hasn't she.....TRUMP will save America...For us Mericans. Yall can move to Canada.....","commenter_a":"The dumbing down of America, this is the people we take care of with government assistance, most are not capable of taking care of themselves let alone voting","post_message":"Woah. Donald Trump voters will be the end of America as we know it. Thanks to Mitchell Wiggs for the video. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1326442960748782","commenter_b":"She looks too white and pasty...","commenter_a":"Hope she burns to a crisp","post_message":"Kendall Jenner looks sensational as she soaks up the sun (via Daily Mail Celebrity)"},{"comment_id":"10153227651945329","commenter_b":"Ikr how dare she maintain a healthy lifestyle, the bitch.","commenter_a":"She can fuck off","post_message":"More like baby washboard, amiright?"},{"comment_id":"980094148726809","commenter_b":"@username Keep your dick in your pants!","commenter_a":"Well done! Any who object to a 'medieval theocracy' should take a good look at Northern Ireland if they want to see one in action. Bloody misogynist dinosaurs.","post_message":"Three women have handed themselves into a police station in Derry, stating they have procured and taken illegal abortion pills and requesting that they be prosecuted, in protest at Northern Ireland’s restrictive abortion laws."},{"comment_id":"10153468718801130","commenter_b":"Classy women.","commenter_a":"Gorgeous young women!","post_message":"\"They're not trying to look older than they are.\""}]
