[{"comment_id":"554818391394376","commenter_b":"@username you said it. Now it's trumps turn. AND HES GOING TO HEAR it... Loud and clear.","commenter_a":"@username TRUMP IS OUR PRESIDENT, Have some respect, stop showing our kids it's ok to disrespect our President, our country. Can't wait for the day, your boat sinks, and you hate mongering reporters drown.","post_message":"He wrote a book alleging corruption between the Clintons and their philanthropy. Now he says he sees similar conflicts of interest between Donald Trump and his business."},{"comment_id":"10154601974052690","commenter_b":"Could it be that she is still here illegally","commenter_a":"The other problem people need to understand is everyone that is Spanish is not from Mexico. This woman is from San Salvadora. Everyone automatically thinks Mexico. I wonder why? Could it be ignorance taught to them by ignorant people. There are so many \"illegal immigrants\" here that people assume are from Mexico when in fact they are not. Stop stereo typing and get educated.","post_message":"An undocumented woman in need of surgery to remove a brain tumor is being held at a North Texas Immigration and Customs Enforcement detention center, her attorney says."},{"comment_id":"10152820559047144","commenter_b":"To hell in a hand basket. The women will have to bale them out.","commenter_a":"Most of those pharma pain killers are just synthetic heroin.","post_message":"A recent study found heroin abuse was 19 times higher among people who had previously abused pain relievers."},{"comment_id":"1106010656085353","commenter_b":"Barf.","commenter_a":"Agreed @username.","post_message":"Seattle Seahawks players kneel together after a #beautiful win at home.  >> kiro.tv/SFvsSEAPhotos // >> @webpagelink  [Photo: Associated Press.]"},{"comment_id":"10154889313644411","commenter_b":"Well hes planning to shut alot of military bases around the world, and hes said hes not paying into nato waist of money he said, at the end of the day we all have to wait and see what hes going to do, you never know he might do a better job than all the other so called politicians in the past.....see how","commenter_a":"He has a point, and America needs a business man to balance the books and help the American people.","post_message":""},{"comment_id":"10153921301277217","commenter_b":"@username has lost their integrity!","commenter_a":"Hahaha.sorry for the laugh. But @username Please investigate first before you conclude on this report. These are all accusations to our beloved president . even his rival denied those witnesses that testified in the senate. sad to say our president's rival now is doing the best they can to destroy our only hope to have a drastic change in this country . BTW You need to go to our country first to know more abt the facts and whats really happening here. :3 -_- #PostResponsibly -_-","post_message":"Gruesome gangland-style hits, including feeding one victim to a crocodile, were described to a Senate hearing by a former death squad member."},{"comment_id":"745794202277824","commenter_b":"She a fat hoe nuttin moe","commenter_a":"Dumb song.","post_message":"Something DISTURBING Was Just Exposed About Beyonce's Halftime Song  This is sickening. She should be banned from performing at any sports events for this.  Do you Beyonce needs to learn some respect?"}]
