[{"comment_id":"10156390039050725","commenter_b":"That would be the best way to guarantee Hillary into the White House!","commenter_a":"I will!","post_message":"A new poll indicates that 68% of my supporters would vote for me if I departed the GOP & ran as an independent.   @webpagelink"},{"comment_id":"1787942078130672","commenter_b":"It's a good thing you are there, because you have no idea how evil and vile that woman is.","commenter_a":"I'm not from america , i live in morocco , but i hope from the bottom of my heart for clinton to win and she really deserves to be the president of the white house because if trump was elected he is gonna make america a hell place on the planet earth","post_message":"Barack Obama was elected the 44th President of the United States on this day 8 years ago."},{"comment_id":"10153864065907042","commenter_b":"Really 😂😩 home boy was like f that","commenter_a":"Angelo Djresearch Ravioli smh","post_message":"QUEENS 'GRINCH' STEALS CHRISTMAS: A postal worker in Ozone Park, Queens threw away 1,000 pieces of mail -- all because he was 'overwhelmed by the holiday season.'"},{"comment_id":"755539251303319","commenter_b":"Send the bitch to jail and strip the bed sheets off of her","commenter_a":"Your in US lady you must obey the law... I'm sure when your in Muslim country your not even allowed to drive ....","post_message":"Burqa-Clad Woman Pulls Race Card On Cop, Gets Brutal Wakeup Call That's not how it works in America... Sorry. Do you think she got what she deserved?"},{"comment_id":"10150671719984999","commenter_b":"Any idea the amount of time it takes to pluck the gorilla hairs off her body and face?","commenter_a":"Exquisite and Gorgeous..","post_message":"Michelle Obama has often made a point of wearing gowns by designers whose backgrounds and cultures reflect the countries being honored at state dinners.  Friday night was no exception. @webpagelink  Photos, clockwise from top: Jim Watson/AFP — Getty Images; Mark Wilson/Getty Images; Luke Sharrett for NYT"},{"comment_id":"1260437270671484","commenter_b":"come on something good has to happen, we had a failed bomb in a car earlier","commenter_a":"El mi nomas cesar godinez ok pinches lacras puro blu cabrones","post_message":"BREAKING: Police pursuit in Palmdale, CA (Viewer Discretion Advised)"},{"comment_id":"536832686498611","commenter_b":"Some of bernies supporters have been crazy lately","commenter_a":"Hillary Clinton MAY HAVE BEEN a liberal at one point. She no longer is. She is a bought subsidiary of large business. If Sanders isn't nominated I'm staying home. She won't get my vote. Edit: I also will never forget the racism and division of Hillary supporters who made the entire DNC kiss their ass to mend fences. It's not 'her turn' and if I had my way she would never ever see the White House.","post_message":"Let's not do the GOP's bidding."}]
