[{"comment_id":"10155894445780093","commenter_b":"Certainly grown women can make decisions. . And as soon as you grow up, become mature, recognize there is a world beyond our own noses and that maybe a person could be right, or, disturbing for some, a person could be wrong... then they can make decisions. But the arrogant ought to be circumspect.","commenter_a":"One simple question: for the Christians who believe that life begins at conception; if God wants every potential human \"life\" to be born so much so that you have to create laws that every American woman whether they believe the bronze age fairy story or not, why when god destroyed all life during the Noah flood did he kill pregnant women? Or innocent new borns? Weren't their lives so precious too? Square that circle.","post_message":"The deliberate killing of an innocent human being, with the killing performed in such a way as to preserve a of the most valuable parts. That sounds totally ethical, right?"},{"comment_id":"1686671934920265","commenter_b":"Hey Vincent, your situated right next to the greatest country of the world and your country is in shambles!! That alone tells us how F'ed up you and your country / society is. You'd think there would be something positive your country would pick up to your benefit. Fix your dump and make it so great and build a wall to keep us out. We'd appreciate it. Asshole!!","commenter_a":"Just put a tax on any money going back to Mexico or central America. Build that Wall Mr Trump.","post_message":"EX MEX PREX: 'NOT PAYING FOR FUC*ING WALL'"},{"comment_id":"555137491342104","commenter_b":"HELLARY ROTTEN CLINTON IS A SEXUAL PREDATOR AND A RAPIST CRY BABY","commenter_a":"We won fairly and stop saying it was the russians and trump. Stop filling your head with media lies","post_message":"WATCH LIVE: Members of the Electoral College in Texas gather at the statehouse in Austin to vote for the president and vice president of the United States. One Republican elector, Chris Suprun, has revealed his intention to vote for John Kasich instead of Donald J. Trump."},{"comment_id":"10154931623678812","commenter_b":"Everytime i check most people that like trump are not from the United States like yourself from Australia you moron","commenter_a":"Trump is much more liked on all social media then Clinton the media is clearly lying with these polls","post_message":"Hillary Clinton has vaulted to a double-digit advantage in the inaugural ABC News 2016 election tracking poll, boosted by broad disapproval of Donald J. Trump on two controversial issues: His treatment of women and his reluctance to endorse the election’s legitimacy."},{"comment_id":"10153135601604575","commenter_b":"If they come here legally and are not criminals then they should be allowed to become citizens but if they just plan on breaking laws and feeding off everyone's tax dollars then no they should be shipped out regardless of where they come from.","commenter_a":"Well that sucks. Aside from the idiotic general opinion of the public, I've met more illegals that really want to be here to work and provide a better life for their families. Unlike many of the current inhabitants of this country that just can't wait for the first of the month for that government check. And let's be honest, we're a country of immigrants. Seems a bit hypocritical. And on the plus side at least immigrants want their children vaccinated.","post_message":"Thousands of immigrants seeking legalization through the U.S. court system have had their hearings canceled and are being told by the government that it may be 2019 or later before their futures are resolved. The increase in cancellations began late last summer after the Justice Department prioritized the tens of thousands of Central American families and unaccompanied children crossing the U.S.-Mexico border."},{"comment_id":"662343567228023","commenter_b":"Great Woman!","commenter_a":"Wonderful tribute","post_message":"I wanted to highlight a few women in my life who inspire me every day. My wife, Columba, for her work to curb domestic violence and for so much more. My mother, Barbara, who has been a tireless advocate for literacy for a quarter century and Toni Jennings, who was a fantastic partner and Lt. Governor of Florida. These women are all examples of what can be achieved when we #LeanInTogether"},{"comment_id":"951284658242208","commenter_b":"She dished it out now she should be ready to take some of her own medicine, she purposely attacked Trump and and don't blame trump for no taking crap from her at all. None of what she did was professional.","commenter_a":"Megan Kelly was quite obviously biased against Trump. She was a horrible moderator as well...just horrible. I thought she ruined the entire debate. It was not really a debate at all any way. What a joke.","post_message":"Donald J. Trump declares war on Megyn Kelly after #GOPDebate."}]
