[{"comment_id":"10154133539156509","commenter_b":"She is high on drugs of stupidity!","commenter_a":"Lol..","post_message":"The Donald J. Trump superfan, \"I saw Mr. Trump only in my dreams\" @webpagelink"},{"comment_id":"10153564532183984","commenter_b":"@username All immigrants who enter LEGALLY are welcome!! We dont need or welcome ILLEGALS. There is a difference.","commenter_a":"I don't understand good, law-abiding Latinos taking a position against following our immigration law and supporting programs that shelter criminals just because they too are Latino. I would be incensed that my good name and that of my race was being damaged by those lawless usurpers.","post_message":"Donald Trump isn’t backing away from his position on illegal immigration and his disgust for sanctuary cities. These policies endanger the lives of innocent Americans, and they must be put to an end.   Obama needs to rethink his plans for amnesty before more Americans die at the hand of violent illegal immigrant criminals.   Sign the petition to block Obama’s plans for amnesty!"},{"comment_id":"1535691416490982","commenter_b":"Go lick some boots","commenter_a":"I don't see how the video is BS you can clearly see him drop his hands down into his waistband and wasn't following police commands again showing the total disregard to authority so The only BS I see is ignorant people trying to act like they're above the law","post_message":"The media ALMOST had everybody fooled about Crutcher, but we found the truth.  And it's going to destroy the media's narrative on the Crutcher shooting..."},{"comment_id":"10153123956077452","commenter_b":"🇺🇸😇❤️","commenter_a":"Jose","post_message":"BREAKING NEWS: A Marine has been found dead with a gunshot wound to the head at a shooting range at Camp Pendleton Marine Base."},{"comment_id":"10153022135468635","commenter_b":"The Jesus I know of hung around with prostitutes, drunks and gamblers. I imagine he certainly wouldn't have used social media to put down homosexuals because he would have been too busy loving them.","commenter_a":"The strong homosexual, transgender movement today is not surprising. It is a sign of how there will be a new world order. It is disturbing but it also points closer to our seeing Lord Jesus.","post_message":"\"Vines argues that while the Levitical code forbids homosexuality (Leviticus 18:22) it also forbids eating shellfish (Leviticus 11:9-12). Yet, he says, Christians no longer regard eating shellfish as wrong — so why can't we change our minds on homosexuality? Here Vines is rejecting the New Testament understanding that the ceremonial laws of Moses around the sacrificial system and ritual purity were fulfilled in Christ and no longer binding, but that the moral law of the Old Testament is still in force.\""},{"comment_id":"772068809592966","commenter_b":"the woman is not nearly as smart as a bucket of horse manure but is as pretty as one.","commenter_a":"Cher is still alive? ??","post_message":"As always.....leave it to Cruz to craft the most perfect response. ;)"},{"comment_id":"1730793227218701","commenter_b":"My dad years worked in the fields of Arizona I whent with him knights we would spent checking the water pipes it's hard work but he was a proud man I learned a lot from him the truth is they won't last a night it day in the fields they beg that's all they do lazy","commenter_a":"Yeah right !","post_message":"They wouldn't last a day!  Video by Occupy Democrats, LIKE our page for more!"}]
