[{"comment_id":"10153099385609255","commenter_b":"Of course there is climate change. It's been jumping around forever.","commenter_a":"The animals are a bit smarter than the scientists and they live in the weather not a lab","post_message":"Happy Groundhog Day—here's to six more weeks of winter. Thanks to Believing in imaginary friends and fairy tales is outside of my age bracket for sharing."},{"comment_id":"502672606580208","commenter_b":"Skinny African","commenter_a":"Chris, paddy maybe?","post_message":"Yes, marijuana gives you the munchies...but it can also make you thinner. Learn more here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"10153221106178812","commenter_b":"She'll get life,","commenter_a":"Lord She Need God In Her Life!","post_message":"JUST IN: Court again declares mistrial after hung jury in sentencing retrial of Jodi Arias - @webpagelink"},{"comment_id":"1005938356108252","commenter_b":"She looks like a evil witch","commenter_a":"She is \"special\" she doesn't not have to follow the law.","post_message":"GO TO PRISON!"},{"comment_id":"10153071705477093","commenter_b":"^ Alex I almost did but I knew she as well as many others wouldn't grasp that concept.","commenter_a":"\" AGAINST HATE\" in Dallas,Texas SEPTEMBER 14, 2015- MONDAY At the American Airlines Center At 5:30pm....all those that want to stand against hate are welcomed. march to the... American Airlines Center In Victory Square...from Cathedral of Guadalupe Off Ross St in Downtown. Police Department will be on site but I would like to note that everyone should be very cautious & on guard. There have been reports that peaceful protesters have been attacked by Trump supporters & some dressed like protesters & assult others within the crowd & reported spitting in their faces. Have your groups be alert & camera rolling just in case, if this happens, attackers can be on record & prosecuted! Thank you everyone & remain peaceful yet boldly stand for Justice. Arm & Arm. Wearing Red,White & Blue colors.","post_message":"A \"Dump Trump\" rally is now scheduled ahead of Trump's rally in downtown Dallas tomorrow."},{"comment_id":"254814161629338","commenter_b":"She is a big mouth stupid bitch . They all are","commenter_a":"Can't watch this show anymore...it's all about political bashing.","post_message":"The View host Joy Behar just launched an attack on Barron Trump. This is terrible. She should be absolutely ashamed. Can we get 10,000 'LIKES' to have The View cancelled!"},{"comment_id":"1418467401509379","commenter_b":"These could be conservative witches. You never know","commenter_a":"Liberals have lost their minds. Smh. Even the conservative didn't get this stupid.","post_message":"\"You don't have to believe in 'magic' to believe in the power of intent and community.\""}]
