[{"comment_id":"10157894599650291","commenter_b":"Every time a Democrat gets in, we lose more of our state and lively hood. Need to cut the head off of that green snake.","commenter_a":"how are you even still in office?...","post_message":"Today President Barack Obama placed the entire Chukchi Sea and the vast majority of the Beaufort Sea off-limits to energy development. The only thing more shocking than this reckless, short-sighted, last-minute gift to the extreme environmental agenda is that President Obama had the nerve to claim he is doing Alaska a favor. President Obama has once again treated the Arctic like a snow globe, ignoring the desires of the people who live, work, and raise a family there. I cannot wait to work with the next administration to reverse this decision."},{"comment_id":"10154185747461717","commenter_b":"@username why don't you grow the f****** up","commenter_a":"So tired of women using their children as excuse for staying in a abusive relationship. Now that she did nothing, she will be in jail and loose her son.","post_message":"Her uncle said that Noor Salman was physically and mentally abused by Mateen and that she stayed with him for fear of losing custody of their son."},{"comment_id":"10153234639738701","commenter_b":"Portland should be really embarrassed","commenter_a":"Really??? With all the real people who have contributed their time and energy to the Parade over the years all they can come up with is a old smelly piece of rug???????????????????","post_message":"Just in case you were starting to think Portland's obsession with the #pdxcarpet was over..."},{"comment_id":"10154001946984456","commenter_b":"Prez Barry will prolly nominate an America hating illegal alien.","commenter_a":"I really like Californas attorney genera for the job!!","post_message":"Who do you think the President should pick?"},{"comment_id":"10154880634893984","commenter_b":"Move out!","commenter_a":"So, who packs there bags first","post_message":"Just as Trump begins to defy the odds, Hollywood is losing it in an unforgettable way..."},{"comment_id":"1001556806534263","commenter_b":"A vagina is a sex organ. A boob is not. Stop comparing them.","commenter_a":"Society uses breast on ad to sell cars, burgers and every shits they want but when it comes to the natural uses, which is feeding a baby assholes loses their minds ? Should think twice before saying women who breastfeed don't have respect for themselves. What did our mothers/grandmothers did before powdered milk ?","post_message":"Women are brilliantly standing up to breast-feed shaming. Read a powerful example right here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"900098320056924","commenter_b":"What a stupid bitch","commenter_a":"Carmen Favela girls dick ride the shit out of drake 😂😂","post_message":"Drake Fan Calls Cops On Meek Mill & Rats Him Out To His Probation Officer For Threatening Drizzy!"}]
