[{"comment_id":"10153282671259087","commenter_b":"@username We, obviously, are not idiots. Kinda shows with other comments. I have a fgreat idea, let's let all the illegals move in with you. Open your arms, and say welcome!!!!!","commenter_a":"Facts that can't be argued about Donald Trump. The man has been under attack since the day he announced. He has exposed how special interest groups, lobbyists and campaign donations corrupt our government admitting he himself has purchased favors. He has exposed media to be the bias self-serving thing they are. We've seen that he is right. Trump has told us what needs to happen to turn this country around. It's the cold hard truth. Trump has spent decades negotiating billion dollar deals with the toughest business minds on the planet and come out on top huge. Bankruptcy? Never has Trump gone bankrupt. He has over decades purchased failing businesses and used bankruptcy laws to restructure those and prevented those from failing. But 4 out of hundreds? Let's say 100. That is a 96% success rate. What experience does he have? He has dealt with politicians, world leaders and perfected ...","post_message":"“If anyone else was in Trump’s position they’d be viewed as the inevitable nominee,” said one former Reagan administration official who supports Donald J. Trump. “I have never seen a group of people so obtuse as to what is going on outside of Washington that they feel comfortable writing Trump off. They’re finally just now coming to the realization that he’s going to win.”"},{"comment_id":"10152799476958598","commenter_b":"she is so un educated on what abortion is!!","commenter_a":"I beg to differ...","post_message":"What???"},{"comment_id":"828695877229020","commenter_b":"I would of kicked someone ass if that was my kids","commenter_a":"Jessica Bates daaammm","post_message":"The children were 4-6 years old."},{"comment_id":"10153680623219087","commenter_b":"@username Why should the gun industry be the only industry in our country to be granted blanket immunity?","commenter_a":"Ah yes, @username ready to go with its latest Bernie slam piece right after he wins Wisconsin and right after they post an article praising Hillary's graceful concession. Quality, non-agenda-filled journalism, lads and ladies.","post_message":"\"Shame on you, @BernieSanders try living one hour of our lives. Love, the #SandyHook Principal's Daughter,\" Erica Smegielski tweeted with links to the front page of Wednesday’s New York Daily News, with a headline reading: Bernie’s Sandy Hook Shame."},{"comment_id":"10153816646376336","commenter_b":"They think that are comedians!:) seriously??? They are not funny at all! These women on the view are ugly and boring! I am still at a loss who watches this show?","commenter_a":"Let's don't get started about people's looks .","post_message":"“If you meant [the] comment about my face being demented as a Halloween mask as humor, so be it… I have a real thick skin,\" Carly Fiorina fired back."},{"comment_id":"523357894521457","commenter_b":"She would be the worst ever.","commenter_a":"The people that will vote for Hillary, see nothing wrong with all his sex scandles.......... it dosen't faze them !","post_message":"Bill Clinton's promiscuous behavior could ruin Hillary's chances. Excellent. Help us spread this and make sure she never get's into office. Do you agree that Hillary would be a terrible president?"},{"comment_id":"1497908770268866","commenter_b":"Alina is converted or living with muslims , check her page.","commenter_a":"A mother of 3, just 26 years old..... Makes me wonder about her story. Don't believe everything you read in the media. If she really got raped the men must be punished, simple as that. Shouldn't she have stayed at home with her children in the first place in stead of wandering the streets? And going out all by herself without a friend? Mmmm","post_message":"Raped by 'migrants from Iraq, Syria and Bahrain' after her drink was spiked"}]
