[{"comment_id":"988932794475475","commenter_b":"black so slap on the wrist and tell her NO NO","commenter_a":"Thanks Obama! This is how you are destroying America! I hope you and all of your kind are happy. No wonder this nation is falling apart.","post_message":"She will pay for this!"},{"comment_id":"10157204409490206","commenter_b":"This chick is so full of crap.","commenter_a":"He makes John Lennon seem like a man and Ryan Leaf viable.\\b","post_message":"The disgraced quarterback allegedly hit his ex-girlfriend on the side of her face, rupturing her eardrum, and she's reportedly still unable to hear out of that ear."},{"comment_id":"10153678323388908","commenter_b":"Interesting - are Israelis more tightfisted than racis","commenter_a":"Luisa","post_message":"A cafe in Israel has decided to give a 50 percent discount to tables mixing Jewish and Arab diners, in an attempt to ease racial tension..."},{"comment_id":"1712662805615424","commenter_b":"What a drunk bitch. What is she? Fucking 3?!","commenter_a":"Leigh Mangubat","post_message":"Guy Records His Girlfriends Meltdown"},{"comment_id":"1128296473875405","commenter_b":"Hillary is a Crooked lying Killer, Put Her in Jail & Make America Safe Again!!!","commenter_a":"Quanell X, leader of the New Black Panther Party in Houston, Texas, said this week on a local news program that black Americans should examine Donald Trump outreach to the black community and the relationship that black voters have with the Democratic Party. @webpagelink","post_message":"What you need to know about the \"alt-right,\" and Donald J. Trump connections to white supremacy and hate groups: hrc.io/2c3kLXT"},{"comment_id":"685062714983869","commenter_b":"So...when will they let Ted Nugent or Trey Gowdy be a moderator?","commenter_a":"Why Matt Lyer? What a CREEP!","post_message":"CLINTON, TRUMP SQUARE OFF"},{"comment_id":"1015573841835697","commenter_b":"She'd be fiesty in bed","commenter_a":"Sam WantAndre Szukilojc10154044729995518","post_message":"Don’t you know who I am?   No!"}]
