[{"comment_id":"10158101758695291","commenter_b":"And you know this how?","commenter_a":"Amazed at the crowd who, like all Americans, except native Americans, are from somewhere else. Jesus would not only be proud of these marchers, he would march with them.","post_message":"Birmingham-Shuttlesworth International Airport immigration and refugee march"},{"comment_id":"10155256275191002","commenter_b":"She's a cunt","commenter_a":"I was there! It was great! So exciting, so much energy, great speakers and it was wonderful to see our future President in person! :) She is marvelous!","post_message":"LIVE: Hillary Clinton is set to speak at a rally in Eastern Market Corporation."},{"comment_id":"10153239564994369","commenter_b":"when you can't beat them, copy them!","commenter_a":"Made in china","post_message":"This is Samsung's newest phone"},{"comment_id":"793702420758020","commenter_b":"Safer boarders and no more refugees!!!!!!!!!!! WAKE UP AMERICA!!!","commenter_a":"Fox news! Enough said!","post_message":"Two Middle East refugees have been arrested on terror charges in California and Texas. fxn.ws/1Rnioji"},{"comment_id":"10153732430689117","commenter_b":"It is a completely legitimate discussion. In the 21st century private corporations have power equal to or even greater than a government's over people's platforms for speech and expression. In 10 years it is entirely possible that a single multi-national company will control all of the major social media platforms. Which means they could quite easily silence any viewpoint that they don't like. This in fact is already happening in many places around the world. Mark Zuckerberg will eagerly jump into bed with any ruthless dictator and agree to censorship on that country's population.","commenter_a":"There is no free speech war to be had. Twitter is a private entity and can ban who ever they like, for what ever reason. They do not have to abide but the first amendment, the government does.","post_message":"#FreeMilo just became a thing. Thanks, Twitter."},{"comment_id":"1014158221952970","commenter_b":"It's true doe","commenter_a":"Lol the amount of white people defending trump #whitetears","post_message":"Wendy slammed Ivanka Trump and her siblings over Donald."},{"comment_id":"851989354991641","commenter_b":"This is America period,,,all states should ban immediately!","commenter_a":"KEep IT UP","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"}]
