[{"comment_id":"10153547862267894","commenter_b":"This bitch cant act bye","commenter_a":"I think Nene should focus on her acting career. I enjoyed just having her pop up on a few episodes as a guest and not a wife.","post_message":"NeNe Leakes Reportedly Offered $2.5 MILLION to Return to ‘The Real Housewives of Atlanta’"},{"comment_id":"10153354132661320","commenter_b":"Religion is fake!","commenter_a":"He's a fraud sorry","post_message":"\"I can dream as long as I want to. I can believe God as long as I want to. If I wanna believe God for a $65 million plane, you cannot stop me.\" Pastor Creflo Dollar is blasting critics who took him to task for wanting a fancy private jet. Read more: @webpagelink"},{"comment_id":"10154596759964166","commenter_b":"Only applies to men though... Women can murder their babies. Just ask killery","commenter_a":"What is \"feticide\" ?","post_message":"JUST IN: The man accused of killing a pregnant teacher and dumping her body has bonded out of jail. His bond was set at $500,000."},{"comment_id":"10153493306391636","commenter_b":"Kd Ray what Arabs have to do with this?","commenter_a":"And Michigan shooter who drove uber said the app told him to kill people, mental illness comes in different shapes, this lady is terribly ill, not because she's Muslim!","post_message":"Horrific"},{"comment_id":"10153749043211159","commenter_b":"Our Country? Go back to Iran you POS!","commenter_a":"no","post_message":"The White House is back on it..."},{"comment_id":"1521502694809851","commenter_b":"And once again we don't riot , block busy streets and and make up bullshit like a certain group of people--- absolutely this is murder and a hate crime!!","commenter_a":"absolutely","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news. No riots, no protests, no media coverage. Do you think he should be charged with a hate crime?"},{"comment_id":"10155186975350809","commenter_b":"Great idea, I might even watch the show if they did that. However it will never happen. That would mean doing what you're preaching and Hollywood is the least likely group to do that . It's fine to give to charities at a safe distance, make photo ops with your body guards right outside the shot, but this would be invasive to their gilded lifestyle. So expect more of the same lectures from the podium and not much else.","commenter_a":"really @username???! @username?? Please!!!! Give me a break","post_message":"Conservative Hollywood actor Robert Davi throws down the gauntlet and calls Leftist Hollywood out on its hypocrisy with an incredible challenge: invite illegals and refugees to the Oscars and your private parties or admit you're a racist! Enjoy this delicious read..."}]
