[{"comment_id":"1236409066433862","commenter_b":"Clifford Maclean Losee","commenter_a":"Save your money you bunch of fruit cakes!!!! You might be able to afford things if you would quit donating to lost causes!","post_message":"Michigan certifies President-elect Donald J. Trump's win in the state, awarding him 16 electoral votes. @webpagelink"},{"comment_id":"10154011395049778","commenter_b":"Women get less pay than men so I guess the bill won't be worth the face value","commenter_a":"I really couldn't careless as long as the bill still spends the same.","post_message":"A woman will appear on the $10 bill beginning in 2020, the Treasury Department said Wednesday."},{"comment_id":"1024965370917718","commenter_b":"'@username Agreed!","commenter_a":"Being vegetarian doesn't change much in the lives of cattle however. Nor hens. It's better than being an omnivore, yes, but still not cruelty free. Although nothing truly is. From medical treatments, medicine, to our pets sustenance, to palm oil, to beauty and household products, etc. As for diet, we are naturally omnivorous. We would not have survived very well as a species without meat as sustenance and the remainder for clothing/tools, along with plants, fruits, nuts, etc. Especially in the North.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152911551916051","commenter_b":"Thats a Black Ass Dumb Bitch... Fry the Bitch.","commenter_a":"She needs a bullet. I hope they get that poor little the home and help he needs. This makes my stomach hurt","post_message":"This woman was embarrassed by her 9-year-old son’s disability – so she decided to torture him."},{"comment_id":"10153380454004270","commenter_b":"Well lady if you want the horrors of War you go for it.","commenter_a":"Can they take the mental pressure of War. And getting raped by someone like ISIS?","post_message":"'I think women are showing they can do the job. Physical capability is not the issue; it’s men’s acceptance of women that’s the issue.'"},{"comment_id":"10156253683750594","commenter_b":"Tickets better get cheaper!","commenter_a":"He got too confident and thought maybe too good and should have stayed a little more humble and kept his head down in his work. But the whole team was over hyped these last two seasons","post_message":"Just three years ago, Colin Kaepernick was considered the prototype for the quarterback of the future."},{"comment_id":"10153764229426323","commenter_b":"It certainly is for most women. :)","commenter_a":"To be brutally honest, the female body starts to prepare for a possible pregnancy every month growing a miniscule placenta in the womb. If the conception doesn't happen the pre-placenta is rejected as menstruation blood and all.","post_message":"'It's relief for a lot of us to finally see periods being talked about in a frank, forward-looking way.'"}]
