[{"comment_id":"480718348785412","commenter_b":"She needs to take her husband and leave go back to were ever their home is","commenter_a":"She has no right to tell anyone what they can or cannot eat. She needs to worry about herself.","post_message":"What Michelle Obama is banning now is just plain unacceptable.  The American people are tired and finally fighting back.  Do you agree Michelle Obama should mind her own business?"},{"comment_id":"886020504921859","commenter_b":"You are right Mary the bitch owes Haiti","commenter_a":"Shut it down.. take some of the millions and help Haiti which some of it was supposed to be used for. Then rehire ALL NEW PEOPLE IN THE VA HOSPITALS AND HELP OUR VETS. some of those people are the rudest uncaring and unhelpful people around hire enough to take care of the vets so they don't have enough to wait so long for appointments etc. Help Americans for God's sake.","post_message":"Hillary devastated after finding out this about her foundation.  It's all coming crashing down.  Do you think the Clinton foundation should be shut down?"},{"comment_id":"10152771526960950","commenter_b":"She didn't tell people to do this so she isn't responsible for what happens. She is only on the show since her older sisters were in the lime light to begin with and then as she got older she got in the light! It's not her fault these girls are dumb af!!! She paid money to get filler in her lips she didn't suck her lips into a bottle!","commenter_a":"I know kids who have done is following that crazy K lead. She should be held responsible if anyone becomes disfigured. Time for a public statement, Kylie.","post_message":"WARNING: Teens who participate in the #KylieJennerLipChallenge by suctioning their lips with a bottle or jar could be left permanently disfigured or deformed, doctors say."},{"comment_id":"598432576983363","commenter_b":"No it's only ok for racist rednecks to say shit like that. Those lost European immigrants who assume they're original Americans.","commenter_a":"Too bad Trump wasn't on it.","post_message":"'Looks like yet another terrorist attack,' Trump tweeted. French and Egyptian authorities have repeatedly warned against such speculation."},{"comment_id":"608933979286362","commenter_b":"Gennifer Flowers: Bill Clinton Told Me 'Hillary Had Eaten More Pu**y Than He Had'","commenter_a":"i like hillary clinton","post_message":"If we unite together, we will rise together."},{"comment_id":"10153448669913984","commenter_b":"All she had to do was say she was to fat to walk any farther and lazy. Should of called the cops and let them tow her.","commenter_a":"I want to have cards printed that say 'Congradulations! You have just won Jerk Of The Year Award for parking in a handicap parking space. Because of you my Mother could not get into her wheelchair. May you never have to be in the same situation.'","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"1069939893102262","commenter_b":"Agree ^^^","commenter_a":"More far right wing Christian terrorism supported by fox news and the NRA.","post_message":"Anti-Muslim rhetoric has spiked since San Bernardino."}]
