[{"comment_id":"10154194014766509","commenter_b":"*you're *themselves","commenter_a":"Why should everyone else have to be exposed to a trans person using the opposite bathrooms and locker rooms? If a person feels they are the opposite sex, get the full operation.","post_message":"The district has one month to provide access or they will lose federal funding."},{"comment_id":"10154229049319369","commenter_b":"Being against Christians isn't a religion.","commenter_a":"I am against Christianity so that means I can not serve Christians in Mississippi because it goes against my beliefs?? This law is stupid.","post_message":"The measure allows churches, religious charities and privately held businesses to decline services to people whose lifestyles violate their religious beliefs."},{"comment_id":"1104831912912258","commenter_b":"Muslims are scum!","commenter_a":"Check google about this. On site it says mother told husband to hit 10 year old if she denied her husband sex. Under Yemeni law this is not rape, wife's duty. Most sickening nationality. Her own family says face up to her duty and honour families commitment, don't shame her family. One girl 10 years old got away, went to court and filed for divorce. She won, husband was not prosecuted for raping a child, he was paid $200.00 compensation. Many of these kids die from bleeding to death from sex or during child birth.","post_message":"Why isn't Barrack Hussein Obama talking about this???!!"},{"comment_id":"10155909073040354","commenter_b":"Yea I've been seeing her dumb ass everywhere lately","commenter_a":"Mike Romano this woman is crazy.","post_message":"SHOCK! Nancy Pelosi backs Planned Parenthood."},{"comment_id":"10153110429289312","commenter_b":"Yes two ladies had a fight over some guy and one stabbed the other one. SMH","commenter_a":"Wasn't there another violent incident at a different CC couple weeks back?","post_message":"What we know about a shooting inside a Chuck E. Cheese's in St. Charles. We will continue to update this link with confirmed information. on.ksdk.com/1JwUWcj"},{"comment_id":"1195181073877040","commenter_b":"Kick her ass out","commenter_a":"What does Jesus tell us about judging others. I get what your saying, but look in the mirrior and pull the plank out of your own eye before pulling the spec out of anothers. Peace","post_message":"Do you think she should be KICKED OUT of the Olympics??"},{"comment_id":"10152991363976336","commenter_b":"We know what we have to do!So what's the holdup !! Being our borders are wide open where just gonna wait till it starts in America! The longer this builds the harder it will be to totally defeat!","commenter_a":"Well, we could talk about why the government is giving Tonto National forest to a foreign mining company. Gold?","post_message":"Attorney General Eric Holder lashed out at Fox News, defending the Obama administration's reluctance to say 'Islamic extremism.'  'If Fox didn't talk about this, they’d have nothing else to talk about,' Holder said."}]
