[{"comment_id":"928764863812971","commenter_b":"She would be a nightmare! She can't even run a business.","commenter_a":"No.","post_message":"It's official."},{"comment_id":"894618207261542","commenter_b":"yes i reject it and this ass too","commenter_a":"YES.","post_message":"Where do you stand? Vote here and make your voice heard."},{"comment_id":"10153712087136336","commenter_b":"That teacher should be ashamed of herself she is just a bully!!!","commenter_a":"So very, very sad. The teacher should be fired.","post_message":"Lloyd's mother, Nyesha Terry, found him seated at a desk away from other students wearing a trash bag a teacher had turned into a poncho."},{"comment_id":"10154917565918690","commenter_b":"how about stop raping women and build some toilets?","commenter_a":"Great job ....we feel proud of our national anthem..haters ...f****k offf","post_message":"\"The time has come, the citizens of the country realise that they live in a nation and are duty bound to show respect to the national anthem. @webpagelink"},{"comment_id":"10153562067157377","commenter_b":"@username She seems just as evil as Cecile Richards.","commenter_a":"The judge should have had Daleiden executed ,so the people in the clinic could sleep at night.","post_message":"\"This is a huge win for the pro-life movement,\" said Jared Woodfill, an attorney for Daleiden. \"The court recognized that the charges brought by the Harris County District Attorney's Office were flawed from their inception.\""},{"comment_id":"10154140064560579","commenter_b":"Seriously Facebook . .you need to put a 'DUH' button on here","commenter_a":"She's right, the game is rigged and I'm sick and tired of the power elite in this country, be it the politicians or the media, trying to tell us what to think. Regardless of whether it's her or someone else, we DO have to take our country back.","post_message":"\"This game is rigged.\" Carly Fiorina on not being able to participate in Saturday night's debate in New Hampshire. Watch complete video here: @webpagelink"},{"comment_id":"10154653626394024","commenter_b":"oh hell no !","commenter_a":"I want him back in the WH .","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"}]
