[{"comment_id":"10153395852497629","commenter_b":"aSSHOLE NIGGA LOVER!","commenter_a":"I think it's safe to say they are not accusations but are indeed facts","post_message":"The interview is expected to include Dolezal’s first major comments regarding accusations that the she lied about her race."},{"comment_id":"1107945392631847","commenter_b":"Even though the Stupid bitch cuts my sandwiches diagonally.","commenter_a":"Bernie is in my dead pool. Die Bernie... The sooner the better!!!","post_message":"Here's actor Mark Ruffalo and director Matthew Cooke on why Bernie Sanders is the right candidate at the right time. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"707988442725067","commenter_b":"Then they need to leave this country.","commenter_a":"This really makes me angry....","post_message":"The court has just ruled against the American flag. This is un-American. We stand for the flag forever and always. Can we get 30,000 'LIKES' for the American flag?"},{"comment_id":"10157322113810354","commenter_b":"She is the spitting image of miss piggy. Shut up bitch","commenter_a":"@username keep this irrelevant fat slam pig off my feed, k?","post_message":"Amy Schumer: you know what Americans are \"sickened\" by? We dumb, poor, working class folk are \"sickened\" by rich, elitist, Leftist \"celebrities\" who can afford to live in million dollar homes with high-end security and bodyguards lecturing us for protecting our families and children. Sorry, Amy Schumer, that we can't afford to live in a gated mansion with state of the art alarm systems. But your pal Obama destroyed the American economy. So spare us the lectures!"},{"comment_id":"954050234691229","commenter_b":"The N-word isn't flying over the state capital, Dumb Dennis! And you don't even know the majority of blacks.","commenter_a":"Cops didn't shoot her down. We're making progress.","post_message":"An activist in South Carolina has taken down the confederate flag at the State Capitol"},{"comment_id":"633140033543242","commenter_b":"That's Ok She will BURN IN\"HELL\" Along with All The Rest of the Sheep That Followed HER !","commenter_a":"Ugly inside and out AND GETTING WORSE EVERY DAY","post_message":"People are finally getting fed up with Oprah... Great. Let's get this hack off the air once and for all. Should Oprah be kicked off TV?"},{"comment_id":"10153580764828352","commenter_b":"She needs to be done same way but leave her in the fire crazy birch.....stand there and ask her how it feel s and eat snacks in front of her ass she burns","commenter_a":"She look deranged with that crazy psycho stare","post_message":"Woman arrested for burning 8-year-old’s hands over open flame because she ate a snack without permission"}]
