[{"comment_id":"1413133632042756","commenter_b":"I believe that the adult in this circumstances escalated the situation. Wrong to trample someone's lawn, wrong approach to correct the problem. Two wrongs do not make a right.","commenter_a":"That's not true Media saying wrong stuff The off duty officer was right When kids jump on him Then he fire to scare the kids He was waiting for on duty officers to arrived","post_message":"Horrifying new footage shows an off-duty cop shooting a gun at a group of teens in Anaheim, CA. It's going viral and sparking protests."},{"comment_id":"1238344686206387","commenter_b":"This is so nice to see. Females in this world matter very much.","commenter_a":"Jean Daniel Boixo","post_message":"These young Pakistani girls are aiming to knock out gender stereotypes. (via NowThis)"},{"comment_id":"1890218664531612","commenter_b":"Bitch please","commenter_a":"I wish they had either a dislike tag or a big BOO we could tag!","post_message":"By selecting this unqualified ideologue, Trump just declared war on public schools. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"714918215322687","commenter_b":"BUILD THE WALL","commenter_a":"Trump/Pence 2016... Enough of corrupt establishment politicians.","post_message":"Live: Donald J. Trump holds a rally in Manchester, New Hampshire."},{"comment_id":"10155073600242235","commenter_b":"Quit covering the bitch. Your continued coverage is not news, it is for personal gain. How long can one beat a dog?","commenter_a":"NO THANKS!","post_message":"There's only one reason why she wouldn't be reprimanded..."},{"comment_id":"10153064490042483","commenter_b":"Funny @username nowhere in your meme is there a picture of the woman you would force to become an incubator.","commenter_a":"Conservatives aren't pro life, they are just pro birth. They defund welfare and unemployment programs, don't support universal heathcare, want to deport \"anchor babies\" and so on. They need to stop pretending they care so much for unborn lives","post_message":"\"The federal government and several courts have made clear that a state cannot kick Planned Parenthood out of its Medicaid program simply because Planned Parenthood provides abortion,\" said Susan Watson, executive director of the ACLU of Alabama."},{"comment_id":"1026033040752819","commenter_b":"And all those boobs in a row on display.","commenter_a":"I feel like the word \"leggy\" came up a lot in this article. As if the author was sorta fixated on this one thing about the girls who tormented her and swift in particular in a sorta Freudian way. Like, \"The evil reign of Taylor Swift, with her forever legs, way too long to be street-legal, stretching between pencil skirts and slightly worn Converse, glossy in the pink-frosted Malibu dusk... Um, I mean, hen culture and mean girls and stuff.\" I don't necessarily disagree with what she's saying, but she is really, really aware of Taylor Swift's legs.","post_message":"If T Swift and her squad rub you the wrong way, you're not alone. Here's why."}]
