[{"comment_id":"10154905959166320","commenter_b":"Women hate liars...","commenter_a":"no they just hate the mean ones 😬","post_message":"What do you make of this? In an interview Madonna said, 'Women Betrayed Us' by Voting for Donald Trump.  Also she said that she has not had a good night's sleep since the election.  (Image: Fox News/AP)"},{"comment_id":"10156568887000725","commenter_b":"'@username STOP dreaming about Hillary, she's bad news, and will never get elected...thief, lier, does NOT care about the American people, WAKE UP !! TRUMP, 2016...","commenter_a":"Today - One Year from Today - Donald Trump will be in his second day in the White House as POTUS and the Obamacare bill will be burning in a barrel on the south lawn.","post_message":"Donald Trump 1st Republican Presidential Candidate to Beat the Iowa Bureaucracy and Figure Out How to Easily Access Caucus Locations. #Trump2016"},{"comment_id":"882724591787290","commenter_b":"Battered but still a warrior, great courage.","commenter_a":"This kid needed a gun and a CCL. So as to defend himself!....oh wait he lives in Newtongrange, Midlothian. Is that in....the UK? They not allowed to defend themselves with lethal force, from Thugs! Thanks to people that think like Piers Morgan.","post_message":"Left for dead with a battered face and multiple fractures by man he stopped to help"},{"comment_id":"866555523379870","commenter_b":"She is a disgrace can u imagine Laura Bush or Jackie Kennedy doing this ?","commenter_a":"We sure never seen Jackie Kennedy doing something like this. She had class","post_message":"No. Class.   Spread the word."},{"comment_id":"10153003184965671","commenter_b":"Remove the millions of illegals. It may be a smaller piece....but it is still huge.","commenter_a":"Somewhat comical given the subject. If you're really worried about climate change and water, STOP GRANTING BUILDING PERMITS that CONTINUE to INCREASE California's population and water requirements.","post_message":"'Longer fire seasons, extreme weather, and severe droughts aren’t on the horizon, they’re all here – and here to stay. This is the new normal. The climate is changing,' Brown wrote in a letter addressed to Donald J. Trump.   Thoughts?"},{"comment_id":"10154786755561438","commenter_b":"Fascist pigs.","commenter_a":"Just like China!","post_message":"All Interior Department Twitter accounts had been ordered shut after the inauguration."},{"comment_id":"10154374417982894","commenter_b":"Bitch u real life bitter","commenter_a":"Lol I hope someone run on stage and snatch that prosthetic belly off and expose her lying ass!!!!","post_message":"The Show Must Go On: Pregnant Beyoncé WILL Perform at Coachella...As of Now"}]
