[{"comment_id":"1494929760811093","commenter_b":"Isis isn't islam... Hahaha okay","commenter_a":"If Islam is a peaceful religion why is every Muslim country in turmoil and its citizens are totally controlled by the Imans and the Koran? Don't believe the lies of political correctness.","post_message":"\"Before you say, 'War is what ISIS wants,' realize that's simply an argument for inertia and putting off the inevitable. Does that make me a war-monger? Sure. It also makes me a global survival-monger.\" Last night on \"The Greg Gutfeld Show,\" Greg Gutfeld said radical Islam needs to be countered with \"radical Americanism.\" @webpagelink"},{"comment_id":"1714915928784727","commenter_b":"Looks like she fought with a lawnmower and lost! Seriously, she wants to look like that..... It looks horrendous","commenter_a":"UGH!","post_message":"What do you think of this extreme cut? Marketers are branding it “quirky, stylish and smooth.”"},{"comment_id":"1006685692721909","commenter_b":"hahaha, that's not what i had in mind! Just thought it was cool!","commenter_a":"@username Ali Sharp cool concept","post_message":"This is wonderful <3"},{"comment_id":"756693807767590","commenter_b":"Ian","commenter_a":"Joshua","post_message":"...bruh"},{"comment_id":"1815485588708872","commenter_b":"Kill your self woman!","commenter_a":"These are 2 polls of manyyyyyyy. These were outlier polls. The AP is a 14 pt spread in favor of Hillary. If they don't make this look like a horse race the last week or so, people won't watch. Nate Silver pointed this out last night. Go check out 538 polls. Imagine 100s of weather models predicting a snow storm predominately tracking east and 1 or 2 suddenly say west. Those are outliers and not a reflection of the whole. People are in here all excited bc they don't know what they are looking at.","post_message":"JUST IN: Florida and Nevada move back to Donald J. Trump's direction, with now six states and 87 electoral votes up for grabs"},{"comment_id":"10153729819244753","commenter_b":"if miley cyrus is taking her place i will not watch the voice no more, she is trash","commenter_a":"I will no longer watch he voice with Miley Cyrus on it.","post_message":"Christina Aguilera will not return to The Voice for season 11, and ever since the announcement was made official, rumors have swirled, claiming the “Genie In A Bottle” singer’s alleged feud with Gwen Stefani and Blake Shelton may be to blame. In a recent report, it was alleged that Christina Aguilera’s feud with her co-stars had gotten so ugly that she had actually enlisted Miranda Lambert, the ex-wife of Shelton, to help her get back at them. “[Christina Aguilera’s] feud with Stefani is... @webpagelink"},{"comment_id":"10154071992886770","commenter_b":"Clinton, Bushes, Obama took away citizen's rights. They betrayed our nation. The USA was hated while they were in office. We are better off turning our backs on these traitors and marching forward in the right direction.","commenter_a":"Thank you, you have more class than some of the others.","post_message":"Both Bushes, Jimmy Carter and Bill Clinton all attended Barack Obama's inauguration in 2009."}]
