[{"comment_id":"10152898071811336","commenter_b":"illegal aliens no doubt !","commenter_a":"Are you kidding me, do parents have any responsibly any more.","post_message":"The nation's second-largest school district is eyeing a move to offer dinner to students at every school."},{"comment_id":"10154391866961130","commenter_b":"One track mind girl!","commenter_a":"lawd hep us!!","post_message":"Mazel tov for (unintentionally) making us laugh before the election."},{"comment_id":"507182816138965","commenter_b":"ATTN clueless bitch.....shove it!","commenter_a":"ATTN: ATHEISTS: Get a head start and go straight to hell which is where you will end.. Satan is waiting for you....","post_message":"Christian principle under heavy fire from atheists after he did this. He's in serious trouble. Let's show him our support. Do you support this Christian principle?"},{"comment_id":"1260485777320174","commenter_b":"I can't wait for President elect Donald Trump to take office and start tossing out the undocumented illegals..........I hope this joker is the first to go.","commenter_a":"that is so sick they should kick them all out","post_message":"BOOM! (WATCH)"},{"comment_id":"783731095008773","commenter_b":"Because illegals are the only ones driving without insurance right... please i bet more illegals have insurnace on their vechile then citizens for the fact they want no problem with authority","commenter_a":"Idiot","post_message":"Should dreamer's driver's licenses include the label \"non-citizen\" on them? The debate over that question is heating up after a rookie lawmaker tweeted about an upcoming bill he's working on."},{"comment_id":"1015490965174099","commenter_b":"It takes a woman to clean up a big mess! I think she can do this!","commenter_a":"As usual, I am sure this is Not a accurate statement, as you have to factor in suicide and accidental shootings.","post_message":"Since the last #DemDebate, nearly 3,000 people have died from gun violence in the United States. It's time to act."},{"comment_id":"10153903187059218","commenter_b":"Criminals don't need a registration.","commenter_a":"California has registrations, tests, waiting periods, magazine limits and \"Assault Weapons\" ban how is this possible?","post_message":"Police confirm fatalities in the shootings at a San Bernardino, California, social services center. Follow updates on 11 News at 5:00 and online here >> @webpagelink"}]
