[{"comment_id":"750686755029933","commenter_b":"She's a racist","commenter_a":"I guess this only applies to black women since she declared \"Black girls rock\" instead of ALL GIRLS ROCK","post_message":"The \"Barack Obama\" move didn't go over so well."},{"comment_id":"606523686188854","commenter_b":"@username i will not vote for @username, he is NUTS . just like Hillary.","commenter_a":"Will you Chip in today?: @webpagelink","post_message":"First they ignore you, then they laugh at you, then they fight you, then..."},{"comment_id":"10153871094319705","commenter_b":"@username guys, also keep your pants up, before an INDIAN decides to rape you !","commenter_a":"Only one religion is at the ROOT of so much misery on this planet... STATISTICS that highlight the problem: In 2011, Sunni Muslims accounted for the greatest number of terrorist attacks and fatalities for the third year in a row. Over 5,700 incidents were committed by Sunni Muslims, responsible for nearly 56 percent of all attacks and about 70 percent of 12,533 fatalities.* Another 24 percent of the fatalities are on Shi Muslims. So in 2011, Muslims were responsible for 94 percent of the fatalities in terrorist attacks. Since 2011, with ISIS on the scene, the number of the fatalities victims of the Muslim terrorist attacks- sharply grew, together with Muslims share in the world terrorism that is steadily closing in on 100%. In 2013, according to the US Department of State, a total of 9,707 terrorist attacks occurred worldwide, resulting in more than 17,800 deaths and more than 32,500 ...","post_message":"So devastating."},{"comment_id":"1054180274641720","commenter_b":"Sam , isn't a lesbian so why would they have lesbian in the house?","commenter_a":"It's homophobic too, since there are no lesbians on the show either.","post_message":"Is The Bachelorette Australia RACIST? (via Daily Mail Australia)"},{"comment_id":"470600046463909","commenter_b":"I will refuse! They have already done enough to erode away our great United States of America. They need to go far away from Washington!","commenter_a":"She is \"one ugly motherfucker\".......to coin a phrase.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"1008378105905084","commenter_b":"She has more than a few screws loose!!!!","commenter_a":"Which Koran.","post_message":"Nancy Pelosi Quotes Mohammed and Pushes Islam at the National Prayer Breakfast"},{"comment_id":"1806931362926478","commenter_b":"I just can't believe that she uses children for her dirty political TV add. Her latest add children watching Donald Trump . She is the expert lol . Her lenguage puts sailors to shame. She is no Lady never was never will. Poletic is agly we all know that. But to involve children in an add how low can you sink??? I wouldn't let my children or great grand children watch TV dirty Poletic.... The would be in bed for sure not sitting in front of the TV all day long .what kind a mother and grandmother is she we should ask ourselves to use children in her dirty advertising against TRUMP they are children MADAM SECRETARY. SHOULD WE SHOW THE CHILDREN THAT YOU IGNORED THE DESPERATE CRY FOR HELP IN BENGHAZI?? YOU KNEW WAY BEFORE THEY WOULD NEED HELP RIGHT AWAY. WELL WHERE WERE YOU YOU WENT TO BED ...","commenter_a":"He's needs to walk away from the DNC at this point!!! They never had his back why should he have theirs? Stein /Sanders could change this country.","post_message":""}]
