[{"comment_id":"948144815307058","commenter_b":"@username I appreciate that... However even though the question was asked by one person and he answered her directly .. He did that in front of an audience... As a parent I get what he's trying to say... But as a woman it makes me angry .. The boys that are being raised need to be taught that when a girl is too drunk to give consent it can be considered rape - I say can because not every girl that has drunk sex is going to consider it rape - but some may - plus it's incredibly unrealistic to tell a college girl to stay away from a party with alcohol... U may as well send her to a convent ..","commenter_a":"This advice isn't blaming the victim. Advising someone to lock their doors at night is not preemptively blaming the home owner for a robbery. Should we live in a world where girls can go to drunken college parties and not worry about being sexually assaulted or raped? Absolutely. Is that the world we live in? No.","post_message":"John Kasich to student concerned about sexual violence: \"Don’t go to parties where there’s a lot of alcohol.\""},{"comment_id":"10153688828342014","commenter_b":"Is this a female prison?","commenter_a":"Enact everyone who knows our job, calls us all corrupt, tells us we're poorly trained, and blames us for the inmate's behavior in 5, 4, 3, 2, 1...","post_message":"ATTACKED: A PCSO officer is going to be OK after being violently attacked by two inmates STORY: @webpagelink"},{"comment_id":"504839586342663","commenter_b":"You slimy cocksucker","commenter_a":"The poor need to try harder","post_message":"\"We are the first generation in human history that can end extreme poverty.\""},{"comment_id":"10154803767550579","commenter_b":"Gary Johnson is scary and just as much a risk as any of them.","commenter_a":"Protect your Rights and Freedom, vote Libertarian Party, Gary Johnson and Bill Weld. 🔔 Give Freedom, Liberty and Justice a chance for a change! 🔔 Visit the FEELING THE JOHNSON Facebook page and give them a LIKE. Break the corrupt two-party system we're trapped in.","post_message":"CLIP: Donald J. Trump and Hillary Clinton debate the economy during the first presidential debate. Watch full video here: @webpagelink"},{"comment_id":"1790041197906165","commenter_b":"She should behead you #deplorable","commenter_a":"Hillary could behead a school bus full of children on national TV and she wouldn't get arrested.","post_message":"\"Based on our review, we have not changed our conclusions that we expressed in July with respect to Secretary Clinton,\" FBI Director James Comey wrote."},{"comment_id":"692662477538954","commenter_b":"This American Woman supports Trump and I feel more comfortable just thinking about Trump being the POTUS, then I have ever felt the whole time Obama has been POTUS","commenter_a":"As a woman, I wouldn't trust Obama unless I was armed. As a woman, I wouldn't vote for Hillary unless I was voting to send her to the nearest blackhole. Trump is not perfect, by any means. But he's infinitely better than what's currently fouling up the White House.","post_message":"What do you think about President Barack Obama's statements regarding Republican women and Donald J. Trump?"},{"comment_id":"10154274654574641","commenter_b":"criminals together the murderer of the children in iraq","commenter_a":"We will meet at Hague. ...together with Rumsfeld and Cheney","post_message":"\"I will be with you, whatever\" -- Tony Blair to George W. Bush, 28 July 2002"}]
