[{"comment_id":"10153227651945329","commenter_b":"Ikr how dare she maintain a healthy lifestyle, the bitch.","commenter_a":"She can fuck off","post_message":"More like baby washboard, amiright?"},{"comment_id":"641480782679805","commenter_b":"She bad as fk though!!!","commenter_a":"'@username wwyd? 😂😂😂","post_message":"What would you do???  #WSHH"},{"comment_id":"1062072083905575","commenter_b":"'@username this is the saddest thing I have ever seen","commenter_a":"AND SOME OF TH AUDIENCE LAUGHED? Grrrrrrr!","post_message":"UPDATE: See the response from Caleb's dad and school, plus CALEB GIVES HIS LAST LINE! WATCH: @webpagelink  PREVIOUS: A 6-year-old boy with autism was brought to tears on stage when a teacher grabbed the microphone away from him when he was about to speak during his school's Thanksgiving play. Caleb was dressed as a turkey, and just wanted to say, 'gobble, gobble.' STORY: @webpagelink"},{"comment_id":"840275132829730","commenter_b":"It took you people 8 years to realize that,lol He is a Muslim born in Kenya and should have never been aloud to run for President!! PERIOD","commenter_a":"Like it is a suprise Not . Fools at least over half of those that voted . Voted for at the least has sympathy . Sick the same people that killed thousands . Americans voted in one that was raised Muslim . Sad","post_message":"Damning new evidence has arisen regarding Obama. There is no question now that Obama is not who he says he is. Do you agree Obama is a Muslim?"},{"comment_id":"893334250795530","commenter_b":"'@username shut your dumbass up. She doesn't need to be in a nasty bathroom cause ur perverted ass can't keep walking and mind ur business. I'm sure you don't mind girls shaking their tits for u just not this baby doing what they were actually made for. Take your ignorant ass on.","commenter_a":"Do it in the bathroom where u have your privacy. Not in the cafe lady...and why are you filming it? Cause you want attention? Or go to the women's section and do it there. You knew you were going to Target, why didn't you bring some bottles with you?","post_message":"This stranger started harassing a woman because she was breastfeeding at Target  but customers and staff defended in the most beautiful way.  #MicBrights"},{"comment_id":"10154215455576770","commenter_b":"Lock her up","commenter_a":"As a retired military wife she Makes me sick!!! Like she ever cared about America!! She cares only for herself and if you support her I feel sorry for you!!!","post_message":"Hillary Clinton responded within minutes."},{"comment_id":"574693549357266","commenter_b":"Whores don't have souls, so yeah...","commenter_a":"so legalise drugs, legalise prostituion, are we just going to start legalising everything?","post_message":"'Being a sex worker isn't about lack of choice. If I really had no choice, I'd be working in a garment factory.'"}]
