[{"comment_id":"10154319112003812","commenter_b":"Cover that nipple, girl.","commenter_a":"Time and a place for everything that was not the place. Plain and simple.","post_message":"Woman says she was kicked out of a North Carolina courtroom for breastfeeding during a child custody hearing. \"Ma'am, you need to cover up.\""},{"comment_id":"10152868852711336","commenter_b":"I approve. What else should we call them? They are illegals.","commenter_a":"Americans should be able to freely shoot border jumpers no questions asked in protection of our country!","post_message":"A California newspaper will continue to use the term \"illegals\" to describe people who enter the U.S. without permission, despite an attack on its building by vandals believed to object to the term."},{"comment_id":"10154379213963812","commenter_b":"Go back to Europe. Lol","commenter_a":"Go TRUMP build the wal!! Deport illegal all of em Ban muslims Lets make america great again! !!","post_message":"Donald J. Trump announced on Good Morning America that he \"probably will take small contributions.\""},{"comment_id":"800077153428906","commenter_b":"Women....or bitch....","commenter_a":"Welcome to a Hillary Presidency: Day to day scandals and law breaking. But, the Dems are OK with that as long as their guy is in office.","post_message":"This is definitely raising eyebrows..."},{"comment_id":"10153306961394087","commenter_b":"Build that big beautiful wall!","commenter_a":"The Trump Haters are the biggest whiners and cry babies in America ! Say all you want ,Hate all you want !.. But you cannot stop the train from heading to the White House !.Donald J. Trump for President 2016 !","post_message":"\"I don't know if that's because she is incompetent, or she doesn't like me or maybe she's given instructions from up above,\" Donald J. Trump said about CNN reporter Sara Murray after accusing her of purposely not recording the large crowds outside Trump's book signing event in New York."},{"comment_id":"981038348622309","commenter_b":"All the prostitutes brainless Repugnicans were born from a cow. Have no brains no soul no dignity full of hate and hipocersy and a aberration against women . Why ? Their mothers are cows.","commenter_a":"Why do Ryan's wife and daughters stay with a man who has nothing but loathing for their gender? Can they not exert any influence over him? If THEY cannot, will he listen to anyone that opposes his point of view? I seriously hope his daughters are never raped, never need the assistance of Panned the Parenthood. He can evoke \"Family Leave\" and I am sure he will still receive full pay - pay that is provided by taxpayers who he wants to deny \"paid family leave\". He will also work against Social Security and Medicare, but when he retires I believe he will gladly accept it. Can his man be any further from someone we want to represent our interests in Congress? He has no interest in representing us. He has NO integrity.","post_message":"Examine his voting record and you’ll find Ryan to be anything but a representative of the American people. Especially when it comes to female Americans."},{"comment_id":"936551829771205","commenter_b":"The United States is a weapon of mass destruction. NO MORE WAR.","commenter_a":"So you can wittness more families lose their love ones and get richer doung so. How many of your children will you send.","post_message":"The war criminal has emerged from the shadows once again."}]
