[{"comment_id":"1538272953143656","commenter_b":"Benjamin Edward I do!!! I like this takes place in Brooklyn too!","commenter_a":"Benjamin Edward","post_message":"Mark Ruffalo and Bernie took a walk through the Brooklyn, New York school yards where Bernie grew up, and talked about his childhood, why he got involved in the Civil Rights Movement and how those experiences translated into his life in politics and this movement. (Directed by Matthew Cooke)"},{"comment_id":"1800107736923413","commenter_b":"FALSELY MY ASS... CNN ( CLINTON NEWS NETWORK) HAS BEEN LYING TO US (WE THE PEOPLE) FOR EIGHT YEARS! ENOUGH WITH POLITICAL PROPAGANDA, ENOUGH WITH PROPAGANDA. BRING BACK JOURNALISTIC INTEGRITY OR GET THE HELL OUT OF THE BUSINESS, WE WILL NOT GO DOWN THE ROAD TO SOCIALISM. WE WILL FIGHT, WE WILL WIN.","commenter_a":"Sieg heil!!! ;-)","post_message":"A free press is a pillar of democracy. So when Trump called CNN \"fake news,\" this Fox News anchor chose to stand by his fellow journalists."},{"comment_id":"10156924134420725","commenter_b":"@username The Wall Is Coming and Mexico Will Pay. No More Hand Outs To Mexico It's Time Mexico Starts Taking Care Of Their Own!!! Donald J Trump President of the United States of America and American People 2016!!!","commenter_a":"Don't Forget: DONALD TRUMP WANTS TO BANG HIS DAUGHTER.","post_message":""},{"comment_id":"10153310967161756","commenter_b":"Yes, yes I am. Suck it!","commenter_a":"Maybe but you get to tell everyone you're a vegan within 10 seconds of meeting them.","post_message":"Three activists, three answers on how veganism — or vegetarianism, or even just cutting way back on meat consumption — can actually make an impact for animals, and for global inequality."},{"comment_id":"899546906747398","commenter_b":"F muslims, and GTFO!!!","commenter_a":"Heck no he is in the grave why would you move him ..when the Muslim can be buried somenplace else .this is against his family to be removed.","post_message":"Pathetic! (MUST READ)"},{"comment_id":"10153212325922293","commenter_b":"Throw her off a tall skyscraper. She can't be rehabbed in jail. Ease the tax payers burden.","commenter_a":"Pure evil!","post_message":"“[If the police] read my messages with him I’m done. His family will hate me and I can go to jail.”"},{"comment_id":"944371082289036","commenter_b":"pig stupid bitch","commenter_a":"ass","post_message":"Conservatives really are the worst kind of people."}]
