[{"comment_id":"426081280913499","commenter_b":"Kiss my ass!!","commenter_a":"Not Surprised, a fight to fight, no reason just out of control. Using excuses for what is being done. If you were really protesting over the treatment of the men and women injured and or killed, you would be ranting about this, not burning up a city, and hurting people.","post_message":"Such a racist sign..."},{"comment_id":"10153234607601491","commenter_b":"Imagine... First lady of America has a sex video. No please!!! Cant call kim a lady!","commenter_a":"Lol","post_message":"Kanye and Kim Kardashian West are looking forward to redecorating the White House."},{"comment_id":"10154784936184614","commenter_b":"We keep building houses, taking away the land near the hills. where else are these animals supposed to go? if you want to live out there, keep your little ones inside. the animals were there first.","commenter_a":"Lol i guess those dogs was watching to much YouTube where people had their dogs chasing away mountain lions and big cats thinking they was really scared of a dog lol guess again.","post_message":"\"This video is heart wrenching,\" says a Rancho Cucamonga animal-lover whose security cameras captured his dog being dragged to its death by a coyote.   Oliver, a 9-year-old dachshund, was chasing the intruder coyote away from his sister dog when the wild animal grabbed him.  \"Even a 7- foot wall won't keep your pets safe,\" the homeowner warns.  Read KTLA's story here: @webpagelink"},{"comment_id":"10156482909420354","commenter_b":"Take your hijab and stick it where the sun does not shine.","commenter_a":"How about a \"dress American day\" for the Muslims? I thought not.","post_message":"Wear-a-Hijab-for-a-Day Events at Universities!"},{"comment_id":"1143690625715878","commenter_b":"Good thing I'm pregnant!!!!","commenter_a":"Jennie!","post_message":"Warning!"},{"comment_id":"506998642821762","commenter_b":"I'd say a feminist who pees themselves might be drunk.","commenter_a":"Well, that has to be uncomfortable. Only a mental moron would pee themselves. I'm telling you, libs are retarded.","post_message":"How stupid can some people be..."},{"comment_id":"10153978119022690","commenter_b":"I'm a hard working taxpaying citizen and I say every day this is the greatest country on the plant. America is Great proud to be an American.","commenter_a":"It's great for immigrants and illegals. Not for the hard working tax payers that pay for everything they get. And they keep raiding SS to pay for them too what's so great about that?? TRUMP MAKE OUR COUNTRY GREAT AGAIN!!","post_message":"First lady Michelle Obama at the DNC: \"Don let anyone ever tell you that this country isn great. That somehow we need to make it great again. Because right now, this is the greatest country on earth.\" @webpagelink"}]
