[{"comment_id":"10152785064574753","commenter_b":"Still, those girls can probably sue state of Montana.","commenter_a":"So when he was a sex offender where was social services to take the girls away! Now look at how he has damaged his grand children. He should be hung!","post_message":"A Montana man was sentenced to 200 years in prison for impregnating his 11-year-old granddaughter and sexually abusing her little sister. Although he was a previously convicted sex offender, authorities confirmed 55-year-old Makeal Shane Pruett was the legal guardian of both girls."},{"comment_id":"10153697405309712","commenter_b":"Libs can flush millions on social programs and illegal non-citizens, but get their panties in a bunch over a blimp downed for not paying \"air tax\".","commenter_a":"Ikr","post_message":"An Army surveillance balloon's escape seemed a bit of a lark, but the long running program has been beset by high costs, low reliability and questionable performance."},{"comment_id":"10153347814342426","commenter_b":"glad they got this on camera so she can't talk any bull about this officer!! crazy women","commenter_a":"Should've knocked all her teeth out period.....","post_message":"Going to the DMV can be stressful, but this Florida woman completely lost it at the counter. After she was asked to leave, the 31-year-old woman would not go without a fight -- with a Florida State Trooper."},{"comment_id":"897074360335805","commenter_b":"She is an creep and liar..NO FOR PRESIDENT..","commenter_a":"Treason :How about collecting those deleted e-mails .We know you can do it .Obama and few more need to go with her .Sheis not in the boat by herself .Communist","post_message":"Which Hillary Clinton scandal is bigger? Is it the one involving her likely illegal secreting and destruction of email records from her time as secretary of state, or is it the one involving the massive conflict of interest she wholeheartedly embraced by using her family’s nonprofit foundation to collect millions of dollars from foreign government donors — again, during her time as secretary of state? @webpagelink"},{"comment_id":"371202926416555","commenter_b":"^^^Suck one, racist prick !!!","commenter_a":"What's missing? Blacks!!","post_message":"Real Protest = No Damage www.eaglerising.com"},{"comment_id":"628929223957206","commenter_b":"By Bitch.","commenter_a":"And don't forget to take Rosie, Whoopi, Kanye and the rest of the we're-leaving-if-Trump-wins morons with you! Good riddance to all!","post_message":"Miley Cyrus packing her bags and taking off after trying to take on Donald Trump. Say goodbye! Good riddance. Can we get 30,000 'LIKES' to have Miley leave the country?"},{"comment_id":"1271814732856760","commenter_b":"she will be felon. unable to run for office.","commenter_a":"No! Just NO!","post_message":"Just when you thought it was over, look at this..."}]
