[{"comment_id":"10153897303435329","commenter_b":"Some girls are bigger than others","commenter_a":"You can open a bottle with any edge. Lighter, desk, door jam, bike pedal","post_message":"How To Open A Bottle With A Cigarette Lighter"},{"comment_id":"488461684677745","commenter_b":"There idiots ,this woman can handle a weapon and herself ,and shes beautiful to boot","commenter_a":"beside ,in front,behind shes good from any view, wish she was President ,one smart lady !","post_message":"Controversy erupts after this video of Palin surfaces. Sarah is in trouble. She needs our help. Do you stand behind Sarah Palin?"},{"comment_id":"10152997685931336","commenter_b":"Now we have the iic ( idiots in charge ) fighting the isis. Stop talking about it and just do it.","commenter_a":"I hope isis dont watch tv...","post_message":"A U.S. military official has outlined plans to retake the key Iraq city of Mosul from ISIS terrorists as early as April, but the move has swiftly drawn criticism that the Pentagon is revealing too much information. @webpagelink"},{"comment_id":"1322497724487878","commenter_b":"Lolololol congratulations trumplinas, you played yourself","commenter_a":"It's going to be just like the wall. Everyone will have insurance but you have it pay for it now and somehow we will be paid back later.","post_message":"He says all Americans will be \"beautifully covered.\""},{"comment_id":"976949909016658","commenter_b":"Female Opinions? Female Opinions Being Heard? Female Opinions Mattering? #BananaPeelSledToHell","commenter_a":"We need more where I live!!","post_message":"It's a slippery slope, America"},{"comment_id":"1110154855687296","commenter_b":"Knock that bitch out!","commenter_a":"@username @username let's fuck his shit up","post_message":"Would you do it? #WSHH"},{"comment_id":"10154242925578837","commenter_b":"The wall will cost billions and stop hundreds. Wao.","commenter_a":"A wall to stop terrorists, criminals and drugs from pouring into America, what a noble idea","post_message":"CONGRESS TO PAY FOR WALL - GOP leader Paul Ryan says congress will end up paying $12 billion to $15 billion for President Trump's border wall."}]
