[{"comment_id":"10153221473348812","commenter_b":"What British chick?","commenter_a":"Better a bigger body than a nasty attitude. Maybe someone can help that British chick with THAT.","post_message":"Kelly Clarkson fires back at fat shaming comments: @webpagelink"},{"comment_id":"10153574405058352","commenter_b":"No lesson learned. Maybe she wore her moms shoes because she could not afford a pair of her own","commenter_a":"She should have stayed down and took those shoes OFF and kept it movin","post_message":"Lesson learned! Moment girl graduating from high school wobbles for 12 SECONDS in platform heels before crashing to ground"},{"comment_id":"727349494120008","commenter_b":"are you kidding me. Get rid of these lowlife scum bags. It didn't have a dining room. well soon they will be Trumped.","commenter_a":"If this is true .they need to go pitch a couple tents ⛺️ somewhere . Give the house to someone who will be grateful to have a roof over there heads 😡😡","post_message":"This shows the welfare mentality at it's absolute WORST! This family has rejected 2 different taxpayer funded 5-bedroom houses and is now staying in a taxpayer funded hotel but they are making another VERY special demand..."},{"comment_id":"1232095813528626","commenter_b":"Deplorable bitch","commenter_a":"Corrupt politician","post_message":"I want to see what you all come up with... Describe Hillary in just two words... Ready, set, go!"},{"comment_id":"10155208741709255","commenter_b":"These people need to go!!!","commenter_a":"Cowards","post_message":"Face the music, fellas."},{"comment_id":"10153718216276680","commenter_b":"That woman is a lunatic just like donald duck","commenter_a":"She must have drank the Trump kool aid!!!!","post_message":"Donald Trump’s spokeswoman blamed the policies of President Barack Obama and Hillary Clinton for the death of Army Capt. Humayun Khan, despite the fact that Captain Khan died in 2004."},{"comment_id":"10156687877045725","commenter_b":"you are 100% illegal .","commenter_a":"Yeah you've hired illegal immigrants too","post_message":"I’m the only one on this stage who’s hired people. I’ve hired thousands of people! #GOPDebate"}]
