[{"comment_id":"1014917681925727","commenter_b":"Alex, it was a hot springs then we saw in the photograph.","commenter_a":"Christopher Sorrentino","post_message":"Hot springs have injured or killed more people in Yellowstone National Park than any other natural feature."},{"comment_id":"10154331295400695","commenter_b":"Praying","commenter_a":"Lord I pray for these families. Unless you have lost a child no one can even imagine the heart break they feel right now. I ask you Father to walk along side of each one of the family members wrap your arms around them to let them know you are right there for them to lean on you or carry them thru this. They have now entered the choir of angels . God bless all","post_message":"#PrayforUGA: We just received these photos of Christina Semeria, Halle Scott, Kayla Canedo and Brittany Feldman, the four UGA students killed in last night's tragic crash. Our hearts go out to their families and friends. @webpagelink"},{"comment_id":"1357029221003198","commenter_b":"Some more cry babies who need their blankie and bottle and their safety pin get over it!!!! God BLESS AMERICA AND GOD BLESS PRESIDENT TRUMP!!!!","commenter_a":"Like the cops dont have better things to do! Should arrest the little bitch \"barista\"!","post_message":"The anti-Trump movement enters Starbucks.  @webpagelink"},{"comment_id":"10154130637278352","commenter_b":"I'm positive with all the comments you got some backlash lol, but keep in mind they're fucking disgusting bitches ha ha ha ha","commenter_a":"There's nothing wrong with breast feeding, but this is disgusting to put your almost 4 year old on the boob.... Want your child to drink your breast milk? invest in a pump....","post_message":"Mother defends breastfeeding her three-year-old son claiming cows' milk is bad for children as she encourages more women to feed toddlers this way"},{"comment_id":"1753789991533439","commenter_b":"Well one less lesbian in the country .","commenter_a":"Stop getting our hopes up and just get the FUQ out! Useless waste of oxygen","post_message":"Rosie O'Donnell To Leave The Country For This Awesome Reason.  Good riddance. We don't want her anyway.  Would you be happy to see her go?"},{"comment_id":"1264368863598532","commenter_b":"GO straight to HELL...","commenter_a":"God has His own way to handle Him. This man is no match for God.","post_message":"This is why Trump won!"},{"comment_id":"10155084835104203","commenter_b":"Has she tried cbd oil?","commenter_a":"My mom who has stage 4 cancer... Tried juicing for almost a year, cutting out eating \"real\" food almost all together... Ended up doing more damage to her gut than good. Bodies are made to eat food and not meant to get over loaded with vitamins and nuetrints from juicing 40 carrots. I think in small doses it can be beneficial but not as a replacement","post_message":"Even in Trump's America, juicing is still awful."}]
