[{"comment_id":"10155541308376002","commenter_b":"'@username or we could use the same money they giving all folks coming here to do the same thing . Plus we want the wall and not these folks that want to blow us up .","commenter_a":"He has an issue with executive pen on immigration but no issue when Obama was doing it? Also this executive order is for 60-120 days same thing Obama did. Obama before he left slowed down Cubans to come in, President Carter sent Iranian students back during the hostage crisis. Hell my own grandparents in the 1900s came over and we're sent back to Italy. Rather fix the VA first then global problems second. Immigration isn't a right, my taxpayer dollars doesn't want to go to a bunch of illegals","post_message":"Senate Minority Leader Chuck Schumer is holding a press conference to demand the reversal of President Donald Trump's immigration ban.   You can watch the press conference live here:"},{"comment_id":"668184586705453","commenter_b":"Yes ; has been, is, and always will be!!! She is truly an ugly American.","commenter_a":"Nice eyebrows, plucked clean and then painted on............banchee","post_message":"Michelle Obama wants to destroy Halloween for kids across America.  There is no chance that we will let her take Halloween away from our kids.  Do you think Michelle Obama is a joke?"},{"comment_id":"1128755127223092","commenter_b":"They are stopping them by firing these loose mouth bigots.","commenter_a":"Now employers can terminate employees for not having the same politics and ideological dogma as their bosses. The Radical Left is destroying America. They must be stopped.","post_message":"“She has expressed values that are at odds with ours and she has compromised her ability to meet the teaching and patient care mission of the School of Medicine.”"},{"comment_id":"1225587407484516","commenter_b":"'@username @username ca vaut aussi pour les chats bande de cingle !","commenter_a":"Krushank Shah","post_message":"This is why you should stop letting your dog lick your face."},{"comment_id":"1207167835973058","commenter_b":"It's not true for entrepreneurs but workplace","commenter_a":"What if this statistic isn't true? Check out what John Stossel uncovered: @webpagelink","post_message":"Kristen Bell introduces Pinksourcing, where women are a bargain at the workplace, since you only have to pay them 77 cents on the dollar! It's the first episode of our new series, #CelebsHaveIssues."},{"comment_id":"10154324391116336","commenter_b":"This lady is nuts! His mom just died.","commenter_a":"Whoah not cool. The judge must have seen something he didn't like. :(","post_message":"Amber Heard was reportedly granted a temporary restraining order against Johnny Depp."},{"comment_id":"1044864242277400","commenter_b":"'@username Of course you haven't ever heard a group of 59 year old women bragging about 'popping a Tic-Tac' so they could forcibly kiss a handsome man. And never have I heard this same age group say, 'grab'em by the d*ck', nope, it doesn't happen...","commenter_a":"I am still trying to figure out how this man became a surgeon. Are you sure that his license and everything or legit cuz he is a total nut","post_message":"Ridiculous!  Video by Occupy Democrats, LIKE our page for more!"}]
