[{"comment_id":"10155104954104411","commenter_b":"Smoking is very bad but rapefugees are not. Damn wtf happened to Sweden..","commenter_a":"what about the vehicle emissions?","post_message":""},{"comment_id":"935633429829739","commenter_b":"No woman EVER asked for it.","commenter_a":"Of course her clothing doesn't mean she wants it. But, if she wears something low cut and is hanging those ta-tas out.... then she should not care, not get mad if guys look at them.","post_message":"Women prove that no matter what they are wearing, they are NEVER 'asking for it'"},{"comment_id":"10153080407966323","commenter_b":"No but seriously why the hell would a girl shave their face...?","commenter_a":"Um I've shaved my face for like 6 years and had no issues.. hair getting thicker from shaving is a myth.. the reason people think that is because hair tapers to a tip and when you shave that tip off the hair seems thicker.. but its not.. it's just the end of the hair and it has always been that size","post_message":"Is it a terrible idea for women to shave their faces? Yes, yes it is."},{"comment_id":"439236556264638","commenter_b":"Put her in prison where she belongs.","commenter_a":"We need Hillary this country can't survive another repuck in the white house","post_message":"This is INSANE..."},{"comment_id":"10156964298475557","commenter_b":"Unbelievable that she is allowed to be running for president if I did what she did they would have found me guilty and thrown the key away!! To think she could be our president, omg!!","commenter_a":"Political game playing and media bias. This woman should be in prison. Not on a pedestal. She is as corrupt as they come. Why are people so stupid?","post_message":"Hillary Clinton will become the first woman to top a presidential ticket after securing enough commitments Monday from delegates to become the presumptive Democratic nominee, The Associated Press reported."},{"comment_id":"1375821949123925","commenter_b":"Love and agree with your comment Sandy","commenter_a":"Will not stand for the disrespect and I'm totally disgusted by the inept commissioner. He wanted to fine players wanting to support something positive, Cowboys supporting the 6 policeman killed, but pats Kaepernick and his followers on the back. The entire NFL is ass backwards and I was a huge fan","post_message":"NFL says rating are down because of Trump and 2016 headlines. I think not. Read my op-ed + TAKE OUR POLL: @webpagelink"},{"comment_id":"10153587807310861","commenter_b":"If she wear a pasta strainer then.i will wear my niqub where only my eyes show.","commenter_a":"Expresses her beliefs....and remains single","post_message":"#LateNightLink Lindsay Miller says wearing the spaghetti strainer allows her to express her beliefs, like other religions are allowed to do."}]
