[{"comment_id":"10152804674496094","commenter_b":"Can't wait to put the clothesline back up...hard to hang dry all the time when you're in a deep freeze for several months of the year.","commenter_a":"Lets force them!","post_message":"Human beings are highly adaptable, but even in the face of climate change, many remain unwilling to do more than tweak their current lifestyles."},{"comment_id":"1495765340483209","commenter_b":"Wow ease up on the drugs girl, you're delusional.","commenter_a":"Hillary, is the only sane choice. Trump is the village idiot. Daily mail must be endorsing trump. Plus, what's wrong with being short?!!","post_message":"She hasn't got her way...and she won't get commercial breaks for coughing fits or fainting spells"},{"comment_id":"10153641389062994","commenter_b":"I still don't understand all the female supporters on here. He hates you.","commenter_a":"He did a great job!!!","post_message":"Donald J. Trump is in Birch Run and will take the stage in just moments. Watch what the GOP contender has to say about Michigan, this country, his campaign, and who knows what else."},{"comment_id":"432908550224359","commenter_b":"She is soooo very off base!!","commenter_a":"Trollette.","post_message":"This woman wants to be President. #NeverForget"},{"comment_id":"1561091183908226","commenter_b":"I'll contact everyone of these cunts. I'll fly our and found your bitch ass into the ground since they are so profoundly sure I am not the face of death they never danced with. Boom...","commenter_a":"Boo hoo, my pussy hurts because I didn't get my war queen!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152864725267623","commenter_b":"Bajajajajaja!!!! Girl white isn't in it either! Lol","commenter_a":"Lmfao!!!! I am loving how pressed these folks are over this!! Get over it people...and move on!! I'm so happy with my President!","post_message":"Check out what the Obama administration did to the White House:"},{"comment_id":"10152884468574877","commenter_b":"Happy birthday you beautiful queen","commenter_a":"Happy Birthday!!!!!","post_message":"We are wishing Lupita Nyong'o HAPPY BIRTHDAY today!!  The Academy Award winning actress received her masters degree in acting in 2012 from the Yale School of Drama and in 2014, she was named 'The Most Beautiful Woman' by People and 'Woman of the Year' by Glamour.  LIKE and SHARE to celebrate!! >>>@webpagelink"}]
