[{"comment_id":"10153831418716336","commenter_b":"The wall is a good thing and will create thousands of jobs on both sides of the border. It will diminish drug trafficking and illegal entries. Trump has many options with regard to financing this colossal project. Furthermore, there will be no need to round up and deport millions. Simply register and background check everyone that is here illegally. Anyone beyond the dead line to register will be deported when discovered during routine traffic stops for example. The remainder should pay into the system until they complete the legal entry process, whatever that may be.","commenter_a":"Bryan NY Chow","post_message":"'It's not only deportation. It's building a wall, and I mean a real wall. Mexico will pay for the wall.'  Tonight on 'Special Report with Bret Baier,' Donald J. Trump explained his plans for dealing with illegal immigration. @webpagelink"},{"comment_id":"550293038455179","commenter_b":"Keep waiting! Americans are on to this BS! We gonna put a stop to millions flooding in here every year!","commenter_a":"Millions of hard working immigrants are still waiting on that promised immigration reform. Remember? November 20th 2014. Merry Christmas Obama and family.","post_message":"'On behalf of Malia, Sasha, Bo, Sunny, Grandma, and everyone here at the White House, Merry Christmas.' —President Obama  Watch the weekly address."},{"comment_id":"1560631690895039","commenter_b":"Good for his ASS. I hope they rape him in prison nite and day. Carma is a BITCH lol","commenter_a":"the sentence is more lenient than what he deserves","post_message":"There is no punishment severe enough for these heinous crimes."},{"comment_id":"10155501902685389","commenter_b":"Tell her to go home & en joy her granddaughter","commenter_a":"Hopefully it will be the beginning of the Clinton END.","post_message":"Hillary Clinton is expected to officially announce that she is running for president this Sunday. How will Republicans respond?   Tune in tonight at 10p ET for more details!"},{"comment_id":"10154162076211943","commenter_b":"'@username IF 60 % of conservatives and church goers stay home and do not vote. She will win. In 2012 they did not want to vote for a Mormon. SO they allowed a muslim sympathizer to stay in the White House.","commenter_a":"Lold she will just put it in Chelsea's name......","post_message":"The Boston Globe Wednesday demanded that Hillary Clinton shut down her family foundation if she wins in November because the entity 'will always look too much like a conflict of interest for comfort.'  'The Clinton Foundation is also clearly a liability for Hillary Clinton as she seeks the presidency,' the newspaper said in an editorial. 'The foundation should remove a political  and actual  distraction and stop accepting funding.' - via Newsmax"},{"comment_id":"524518094380814","commenter_b":"Planned parenthood another way of saying murderous selfish bitch, or greed doctor. I think both. Revoke the doctors licences, and any woman getting an abortion gets a hysterectomy too. If you're willing to murder your own child once you don't deserve the privilege to have any at all.","commenter_a":"Hillary’s claiming credit for Planned Parenthood’s selling of fetal body parts. She says it’s a real money maker, and the only way she’s able to afford Starbucks....","post_message":"The top Planned Parenthood doctor whose face is all over the Internet because of an undercover video otherwise has left little mark on social media or elsewhere on the Web."},{"comment_id":"10154431413636323","commenter_b":"Both you ladies have proven the theory correct. Your periods are synched","commenter_a":"They're forever in shitty moods. This makes the theory correct","post_message":"Ever since Martha McClintock, a psychologist from Harvard University, published her 1971 study of 135 female undergraduates living in a college dormitory together, it has been accepted that menstrual cycles synchronise when women live together. Her study, based on an analysis of about eight cycles per woman, found that roommates and close friends saw the average number of days between the starts of their periods fall from eight or nine to five days. But is it really true?"}]
