[{"comment_id":"10155121941959614","commenter_b":"Over that wall!","commenter_a":"This is how Normal Americans see trump n trump supporters.","post_message":"Far from targeting only  hombres, as Trump has said repeatedly, his new order allows immigration agents to detain nearly anyone they come in contact with who has crossed the border illegally.  People could be booked into custody for using food stamps or if their child receives free school lunches."},{"comment_id":"914685108573277","commenter_b":"Speaking of the specter of 72 virgins...I wonder if the aforementioned knuckleheads ever consider whether those promised virgins are male or female?","commenter_a":"Take off and landing from a carrier is inherently very dangerous. Glad the rescue folks did their job successfully as trained. Go Navy!","post_message":"The US Navy says one of its fighter jets has crashed shortly after launching from an aircraft carrier in the Persian Gulf."},{"comment_id":"587813824710682","commenter_b":"Fuck Clooney! Trump 2016!!! Build that wall!!! Go Trump!!!!","commenter_a":"The rich have no idea because they live in there own world behind gates and walls take away all that and see how they feel","post_message":"“But the problem is all these other countries hear these things, and all of a sudden you see in France that [Jean-Marie] Le Pen is going, ‘Bravo,'” Clooney added. “You get all of these nutcases on the far-right fringe saying, ‘Well, if America thinks that…’ That is the real problem with Trump—his ideas bleed into the rest of the world.”"},{"comment_id":"10154082657224497","commenter_b":"The Hillary machine has infected ClickHole too? Thanks a lot, Obama!","commenter_a":"Only 7?","post_message":"Via ClickHole:"},{"comment_id":"976984712394583","commenter_b":"it was a $130,000 bust lol.... oooh what an impact. Responsible gun owners who will do things like \"not break the law\" and register their firearms, aren't going to buy them illegally on the black market. The people who are looking for guns to commit crimes with will continue to buy them on the black market. Changing any laws will not change this fact. In other news, water is wet.","commenter_a":"Holy silenced Uzis.","post_message":"This is why criminals get guns so easily."},{"comment_id":"1141577959271788","commenter_b":"Then do you forgive slavery?","commenter_a":"I see nothing wrong with it. It is inappropriate to judge a previous generation by the information and ethics of another generation.","post_message":"\"The first thing I thought when I stepped off the train was, 'I don’t belong here.' \"  - Jim Tanimoto, recounting his life spent behind the camp's barbed wire."},{"comment_id":"510973722424254","commenter_b":"Let's elect him and the boos will disappear, right along with all those illegals that are making the noise.","commenter_a":"Don't join conservative Tribune news bad to read","post_message":"Donald Trump handles this opposition like a CHAMP!!!"}]
