[{"comment_id":"10152738013846135","commenter_b":"I didn't even know there were still idiots who thought like this....holy crap. What is WRONG with people?!","commenter_a":"Blacks got their way again!!!!!!!","post_message":"Today's Baltimore Orioles game was the first ever game to be played without fans. It led to some crazy pictures! PHOTO GALLERY: @webpagelink"},{"comment_id":"396582543845311","commenter_b":"Richard J. Lindner She Did Commit Perjury, Destroyed Evidence Under Subpoena GET OFF THE H-TRAIN","commenter_a":"Repost: Federal Law: Title 18. Section 2071 Can it be any clearer? Former United States Attorney General Michael Mukasey tells MSNBC that not only is Hillary Clinton's private email server illegal, it \"disqualifies\" her from holding any federal office. Such as, say, President of the United States. \"If you do this or that bad thing, you've essentially disqualified yourself as being the leader of the free world,\" said Mukasey, referring to the illegal server and the illegal handling of classified materials. Mukasey specifically points to one federal law, Title 18. Section 2071. For those of us who do not have United States Code committed to memory, here's what it says: (a) Whoever willfully and unlawfully conceals, removes, mutilates, obliterates, or destroys, or attempts to do so, or, with intent to do so takes and carries away any record, proceeding, map, book, paper, document, or other thing, filed or deposited with ...","post_message":"BAM!"},{"comment_id":"10153635074276336","commenter_b":"Christina you are made of stupid. Those two things aren't even comparable.","commenter_a":"Good for her! Besides if they can deny hunting licenses because of convictions then they can deny marriage licenses for same sex couples for the same reason!","post_message":"“Some people have said I should resign, but I have done my job well,” Rowan County Clerk Kim Davis said in a statement."},{"comment_id":"10158187868175203","commenter_b":"Boo hoo bitch","commenter_a":"The Dems aren't going to stop. They're working their agenda to undermine our Constitutional Republic, the rule of law, and our civil society: @webpagelink","post_message":"Trump defends his travel ban."},{"comment_id":"825373110931702","commenter_b":"It's ok. Can't hurt anybody. He's irrelevant. Just laugh at him and move on.","commenter_a":"And this is why Trump won. Republicans are always told they must apologize, even by other Republicans.","post_message":"He's baaaaaack... WATCH:"},{"comment_id":"1129314157104004","commenter_b":"WAKE UP PEOPLE PLEASE","commenter_a":"I did hit like on purpose it was an accident.","post_message":"**Terrorist attack on US Soil! This just in!**"},{"comment_id":"865107826951175","commenter_b":"Who cares / she's useless","commenter_a":"And, Donald Trump(ish) is not racist, bigoted, arrogant, insensitive, and lacking in political comprehension ???","post_message":"Fauxcahontas."}]
