[{"comment_id":"10153155797009205","commenter_b":"Kill the whole breed .","commenter_a":"Always have your concealed firearm in case one of these beasts attack.","post_message":"Pit Bulls Maul Multiple Men [GRAPHIC]"},{"comment_id":"10152740103222507","commenter_b":"Have female genitals, potential prostitute","commenter_a":"Carry a gun....potential murderer. You won't be laughing when you child or grandchild gets killed","post_message":"Disturbed thinking."},{"comment_id":"1080143312021089","commenter_b":"Yep TRUMP 2016","commenter_a":"Looking forward to him becoming our next president asap.","post_message":""},{"comment_id":"923712007745578","commenter_b":"They and we need to not bring these people into our countries they can not and will not adapt to our cultures. Has there not been enough proof of that yet.","commenter_a":"Then, 10 infidels need to hunt down the five assholes that did this and, repay them ten fold.","post_message":"A Florida College Student Is Brutally Attacked By Five Muslims On Patrol Enforcing Sharia Law."},{"comment_id":"154804301701173","commenter_b":"Here we go again with the silly questions by the press , get the popcorn out","commenter_a":"We don't like racists","post_message":"LIVE: White House Press Secretary Sean Spicer's daily briefing. Topics include the economy, domestic policy agenda, transgender bathroom policy, state's rights and the Supreme Court."},{"comment_id":"1213366555426261","commenter_b":"More illegals equates to more democratic votes due to the dreams of entitlements and riches. Look at California (seems to start on the west coast), they are making it as easy as they can to give illegals the opportunity to vote...they even have a few illegals in city government! More democratic votes keep Dems in power, which means more taxes from the middle class which eventually places people closer to poverty...which places more government control over it's citizens...Hence the \"Democratic Agenda\". That \"Agenda\" puts us that much closer to the \"New World Order\"!!! Guess who would be the leaders of the \"New World Order\"?","commenter_a":"#TrumpOnTrumpingOn2016! BREAKING NEWS: \"Reince Priebus, Paul Ryan, Karl Rove, Stealing RNC Donation Money\"! ~ Hon. Roger Stone","post_message":"A country that for generations saw millions of its citizens cross into the U.S. is suddenly telling its southern neighbors they can no longer do the same."},{"comment_id":"10152873861987434","commenter_b":"Shit for brains","commenter_a":"Since when did weed start smelling like fish?","post_message":"After pulling Charnesia Corley over for running a stop sign, two Houston deputies held her legs apart and forcibly administered a body cavity search in public—all because her arresting officer suspected she had weed."}]
