[{"comment_id":"1117850661583687","commenter_b":"She is trash !!","commenter_a":"Or is it Michael Obama?","post_message":"Keep on Rockin In The Free World!"},{"comment_id":"1328913090468676","commenter_b":"You are kidding! Bush was criticised for reading to kids in a school soon after 9/11, which was actually thoughtful and humane. While Obama is on a world tour with the family!","commenter_a":"We have to be honest. If that was George Bush we wouldn't have cared. This doesn't bother me so much, he was being polite as a guest at a State Dinner. Gallivanting with communists just hours after the bombing (and his dismissive <60 second remarks) was disgraceful, though.","post_message":"Nero has nothing on this guy! Obama shows how he feels about the #BrusselsAttacks."},{"comment_id":"10153730231431337","commenter_b":"Because women should only pursue careers that focus on their looks, right?","commenter_a":"Fxxx her kickboxing career shes georgus","post_message":"TOO BIG? This MMA fighter's \"12-pound\" breasts are ruining her fighting career..."},{"comment_id":"10153828343101051","commenter_b":"You are a brave girl I'm happy you kids are out off that hell hole","commenter_a":"This so sick and so sad! I pray for these children are in a good foster home. The mother and the boyfriend and the other person go to jail for life. This child was very brave to email the teacher. Didn't anyone at school see that something was wrong with these kids? The boyfriend should be castrated! How can this happen in America?","post_message":"This teacher was reading her e-mails when she noticed a message from one of her students. Because of how young the kids in her class are, they rarely sent her e-mails. She realized almost immediately that something was wrong."},{"comment_id":"10154065483921770","commenter_b":"Welfare mothers make better lovers","commenter_a":"So does America. America doesn't revolve around the Clintons as they think it does . America is sick of them","post_message":"Even MSNBC is sick of hearing the Clintons' excuses: \"Seriously. Nobody cares. The game’s over. They lost.\""},{"comment_id":"760477217433112","commenter_b":"Why is this show still one who watches these whiny bitches anyway","commenter_a":"So tired of people who think they are celebrities and think they can use that to preach their stupid opinions. Just shut up.","post_message":"Joy Behar of 'The View' just said Donald Trump will bring “mental illness” to the White House."},{"comment_id":"963331227036554","commenter_b":"So could Samsung actually be catching up?","commenter_a":"Eh...not really impressed enough to upgrade from the 6. I'll wait till the 7!","post_message":"Our first look at Apple's new iPhones:"}]
