[{"comment_id":"1692664807687298","commenter_b":"She is evil...completely stupid","commenter_a":"She needs help that was sick","post_message":"This is SICK!   End the Cop-Hate NOW. #AllLivesMatter"},{"comment_id":"10152528871250667","commenter_b":"What union???","commenter_a":"They get enough through their union","post_message":"President Obama will call on Congress to require companies to give workers up to seven days of paid sick leave a year, a senior adviser said Wednesday. Obama will also take executive action to give at least six weeks of paid leave to federal employees after the birth or adoption of a child."},{"comment_id":"10153443636529087","commenter_b":"She is another racist B*t*&","commenter_a":"Influential? I think her 15 minutes were up some time ago.","post_message":"Influential conservative commentator Ann Coulter called claims that Ted Cruz was a natural born US citizen \"absolutely false,\" joining Donald Trump in questioning whether Cruz can legally run for president."},{"comment_id":"1829950227225236","commenter_b":"William, true but there were two shots to the head though.","commenter_a":"These are the kind of people that \"commit suicide\" with two gun shots to the back of the head.","post_message":"He joins a host of whistleblowers who have been saying this for YEARS!!"},{"comment_id":"1784144245187941","commenter_b":"Oh shut up!","commenter_a":"If African Americans don't understand that they're being exploited and used for their votes by this woman, well then they'll get what they deserve after they elect her, a lot of nothing! So sad to see them falling for this. She's using a black rapper to pull in votes, amongst other things. Using a group of people for a vote is so wrong, nothing more. She's disgusting to do this.","post_message":"Hillary Clinton quotes Jay-Z during Cleveland rally: “Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.”  Read more here: @webpagelink"},{"comment_id":"10153672504893812","commenter_b":"Demonstrators showing their ignorance.","commenter_a":"Jade helm time to test what you got","post_message":"JUST IN: State of emergency declared in St. Louis County due to Ferguson unrest: @webpagelink"},{"comment_id":"10153902979083812","commenter_b":"Then please answer the dreams of the other 49 states and build that wall around Texas and secede.","commenter_a":"Texas? Secede already will you?","post_message":"JUST IN: Texas Governor Greg Abbott joins the governors of Alabama and Michigan in saying his state will not accept any Syrian refugees in the wake of #ParisAttacks. @webpagelink"}]
