[{"comment_id":"10154373369462042","commenter_b":"I like Hillary. Good luck Hillary","commenter_a":"Love and support my President and #ImWithHer...","post_message":"President Barack Obama and Hillary Clinton make their first joint campaign appearance in North Carolina."},{"comment_id":"1728663384083911","commenter_b":"They can stick it!!","commenter_a":"No, no, hell no! If if offends them, just stay away!!","post_message":"Liberals Want To Ban The Most Iconic 9/11 Picture From Museum.  There is no reason on earth why it should be banned.  Can we get 30,000 'LIKES' to keep this picture in the Museum?"},{"comment_id":"10153600166447217","commenter_b":"^That is a true life goal","commenter_a":"@username And we're sat here watching tv and being casual XD","post_message":"Life goals."},{"comment_id":"10155066289616336","commenter_b":"@username is a dumb pussy","commenter_a":"Can't wait to hear!! PA deplorable here","post_message":"President Donald J. Trump has announced Judge Neil Gorsuch as his nominee for Supreme Court of the United States."},{"comment_id":"10153279358959087","commenter_b":"You're a stupid bitch","commenter_a":"Democrats have become the party that endorses Corrupt Liars. Next time a Democrat points a finger at Republicans they should point 5 back at themselves first.","post_message":"Nearly twice as many Americans say they are unsatisfied with Hillary Clinton’s response to the 2012 attacks in Benghazi as say they are satisfied, according to a new NBC News/Wall Street Journal poll released today."},{"comment_id":"10153956657931336","commenter_b":"Amen she needs to go to jail u r correct","commenter_a":"112 million raised and supposedly all from minorities and women. This woman is the single biggest threat to our country. She is actually worse than Obama and as we know that is as bad as it gets. The nazi queen needs to go to prison","post_message":"The Hillary Clinton campaign said that puts her total raised in 2015 to spend on the presidential primary campaign at $112 million."},{"comment_id":"10154015419833869","commenter_b":"Having a hot flash doesn't mean she is not qualified!","commenter_a":"Yup","post_message":"The Borowitz Report: The same poll revealed that a broad majority of voters found an unconscious Donald Trump more fit to be President than a conscious one."}]
