[{"comment_id":"1767519713512114","commenter_b":"She's a joke","commenter_a":"She is running the lowest, dirtiest campaign in USA history","post_message":"Clinton to voters: \"Reject the dark and divisive and hateful campaign that is being run by my opponent.\" What do you think?"},{"comment_id":"10153482227782377","commenter_b":"The corruption mongers who have like leeches suck the blood and financial life out of this country find being with Trump is of no benefit to them therefore its a matter of running scared when we find out who they are their done!","commenter_a":"were never conservitves in the first place @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@2","post_message":"In the wake of his Indiana primary victory, some Republicans are breaking with party tradition and refusing to support Donald Trump under any circumstances."},{"comment_id":"10153441968716756","commenter_b":"Then by your logic no couple on the street should be holding hands or kiss, or hug. You can't just say keep it to yourself. That has been the norm for years. They are tired of hiding. They want to be free like you and me. They want to walk down the street holding hands, they want to marry and they want you to keep your personal preferences to yourself.","commenter_a":"I don't care who you marry Just don't shove it down my throat.","post_message":"The briefs against bans on gay marriage come from the traditional allies -- and some surprising ones: small businesses, law enforcement officers and some Republicans."},{"comment_id":"10152698672020927","commenter_b":"This is the same dolt that though islands could over-populate and flip over.......Donkey","commenter_a":"Another out of touch dem.","post_message":"The GOP budget will cause riots?"},{"comment_id":"10153655296938854","commenter_b":"Kerry is no better than anyone else, if he was involved...Then buddyboy...fess up. This whole situation is starting to smell like Watergate. Where's Woodward and Bernstein...Let them have a crack at it!!! Somebody needs to tell Trey Howdy you have full reign, do whatever you need to do, just get to the bottom of this!! And I'll bet you BARACK OBAMA'S NAME is all over it, just like Richard Nixon's was in Watergate. The major difference between the two is that PEOPLE DIED IN BENGHAZI. And just to show the impertinence of Hillary when she said, \"What difference does it make now?!!\" The difference is you Communist is that AMERICANS DIED YOU HEARTLESS WITCH!!","commenter_a":"Elijah Cummings is one of the dumbest mf'rs on this planet....voted for by a large number of even dumber mf'rs in his illegally gerrymandered district. He is so stupid, that he has no business in congress, and along with the rest of the liberals in Congress and the white house, he should be swinging at the end of a rope. He knows what he's done....we know what he's done.....","post_message":"Elijah Cummings: “Shockingly Disrespectful” To Subpoena John Kerry About Benghazi…"},{"comment_id":"1795134364108592","commenter_b":"Lock them up! Bunch of crybabies","commenter_a":"Pull out a bull whip and whip these bitches","post_message":"FOX 12's Mega Sugianto is live as protesters march for a fifth night in downtown Portland."},{"comment_id":"1044948272235591","commenter_b":"The RINOS & Dumocrats ALL SLEEP IN THE SAME BED. THEY are disgraceful group of piglets!","commenter_a":"Your a lier just like Obama you have so many people out here out of work and homeless what planet are you living on why don't you idiots venture outside the District of Columbia and visit the real Americans.","post_message":"Get in line, Americans. Paul Ryan knows best."}]
