[{"comment_id":"10153270679648984","commenter_b":"Get rid of them","commenter_a":"Didn't look bcz I don't care much for trash","post_message":"Holy cow, I did not see this coming! After so many years lurking in the shadows!"},{"comment_id":"10152922358545927","commenter_b":"PLEASE GET RID OF THIS TRAITOR NOW.","commenter_a":"This guy is quickly becoming a fossil himself.","post_message":"Obama VOWS to \"convene other nations to meet THIS threat. ...\" Can you guess what \"THREAT\" Obama is trying to combat?"},{"comment_id":"10153294493981438","commenter_b":"I hate her as corporate whore and war monger.","commenter_a":"I like her as Nerd and Law Student!","post_message":"Nerds are cool, and that is Hillary’s true self. She should two-strap her way to the White House."},{"comment_id":"1016852955001727","commenter_b":"Calais wasn't a jungle before these muslim herds invaded it and consequently turned it into filthy, unsafe jungle!!! Let them go to muslim countries for a better life, they do not belong to Europe!!! They cannot and will not assimilate. EVER!!!","commenter_a":"Welcome to Europe, here you be safe and free","post_message":"\"It's slowly, slowly starting to become colder and I don't know what are their plans, these people, because if it starts snowing, most of the people, they're going to start coughing and getting sick and probably dying in that jungle.\" Read more: @webpagelink"},{"comment_id":"10153758605053132","commenter_b":"These woman work these jobs to get rich. Tigers Woods wife was a nanny Arnold Schwarzenegger's, house keeper, now this chick. These women plot & plan to insert themselves into the money by any means necessary.","commenter_a":"Bad woman what goes around comes around! She will be sorry! Down with Affleck and her!!","post_message":"She's staying busy."},{"comment_id":"1009393132499179","commenter_b":"Is this guy even alive? He looks like a bad wax figure.","commenter_a":"Trump set the tone and this jerks lowered the bar to a new level. He should be removed from his position immediately!","post_message":"This is definitely disturbing."},{"comment_id":"795518530581327","commenter_b":"There is definitely something wrong with this lady...","commenter_a":"Bully like Hily Holbrook from \"The Help\" except for the racism.","post_message":"I can't stop laughing.....at HER."}]
