[{"comment_id":"10152865341779342","commenter_b":"Mexicans do deserve some credit so here it is. Murder up 67%- committed by illegal aliens Child molestation up 97%- committed by illegal aliens Rape up 53%- committed by illegal aliens Gang violence up 78%- illegal aliens Robbery up 62%-committed by illegal aliens aliens Car thieft up72% - committed by illegal aliens Economy down - contributed by illegal aliens Jobs down - contribution illegal aliens aliens Welfare abuse up 98% - fraudulent claims filed by illegal aliens aliens I could keep going but I think you get the picture.","commenter_a":"Want Mexican music go to Mexico. Pretty simple don't you think?????","post_message":""},{"comment_id":"10156046538185389","commenter_b":"Sorry , but I don't think women belong in combat ! I am old fashion , I still believe in Chivalry ! :D","commenter_a":"Time to retire this so called..\" Top Admiral \"..too many PC types in the military now, arm chair leaders..!! Desk jockies..!!","post_message":"The U.S. Navy's top admiral said he believes female sailors should be welcome to join the service's elite SEAL teams, provided they can pass the training regimen."},{"comment_id":"485625238294723","commenter_b":"Deport her ass","commenter_a":"This woman is a trouble maker and more behind her... Send her back if she cannot obey our system. This goes for anyone, anyone's religion. By the way does she have automobile insurance>> Is she a Citizen of the USA??????","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."},{"comment_id":"10154069186973967","commenter_b":"Yeah how dare she have an opinion, why didn't your whore mother have that coat hanger abortion she wanted?","commenter_a":"Check your shit together before basing bias yo..she was more concerned about her own BS and not about Nintendo. Also you have to be THIS goddamn retarded to lose an awesome job at Nintendo","post_message":"Nintendo watched her become the center of a witch hunt and did nothing publicly to defend her."},{"comment_id":"1171676779558735","commenter_b":"What couples?Floyd has a harem of women like this in Vegas!!","commenter_a":"these celebrity couples are getting ridiculous.........i can understand the attraction to cash but at least try to hide it...","post_message":"Floyd Mayweather is dating a 19-year-old New Look sales assistant from the West Midlands."},{"comment_id":"1197017153648966","commenter_b":"Get her on board and watch him sink........","commenter_a":"Her only claim to fame is loosing and quitting.","post_message":""}]
