[{"comment_id":"1078041262207343","commenter_b":"Fire her now!","commenter_a":"Mandamus?","post_message":"She took an oath. And the oath didn't say: \"I will uphold the parts of the Constitution that I agree with and ignore the rest\""},{"comment_id":"10153789938206680","commenter_b":"yes there is, put her in jail.","commenter_a":"Former \"Bush\" defense official??? Go figure!","post_message":"The United States' adversaries, James Clad says, \"must never hear flippancy or ignorance in America’s voice.\""},{"comment_id":"10153478653615950","commenter_b":"Here come the pro-trump/Hillary is the devil comments. I stand by Hillary and will gladly vote for her in November. #Hillary2016","commenter_a":"She does not care, just wants them votes!!!","post_message":"Hillary Clinton  takes a swipe at Donald J. Trump's \"neutrality\" during her AIPAC speech: America \"can't ever be neutral when it comes to Israel's security or survival\" @webpagelink"},{"comment_id":"10152748268571491","commenter_b":"No","commenter_a":"Ok ill tryit..... When will the coffee maddness end????","post_message":"If you’re still hungry after your meal."},{"comment_id":"10153389617181509","commenter_b":"Tell the pigs this same info.....they dont seem to remember the law and if they need it,give them your info and have them subpoena it...like theyre legally required to do","commenter_a":"No Law or Rule against. As some police assume?","post_message":"A growing number of people are turning their cameras on cops. You can learn more via CNN's latest edition on #Snapchat. @webpagelink #CNNSnapchat"},{"comment_id":"10153233251546350","commenter_b":"No she don't she is a young hoe. Celine is why better the Ariana Grande","commenter_a":"I don't think so! Her voice lacks the richness of Celine's.","post_message":"Ariana Grande's impression of Celine Dion is spot on!"},{"comment_id":"932180273594983","commenter_b":"So these women thought it would be cute to be \"bad mom's\". It's a sad world we live in.","commenter_a":"Selfish mothers. Women who should not have children.","post_message":"\"No one had communicated that children under six were not allowed in R-rated movies,\" one of the moms said. \"We had breastfeeding moms with infants, one 4 weeks and one 7 months, and they refused them entry.\""}]
