[{"comment_id":"1090152371065873","commenter_b":"NO! All the illegals should be put there until they can be legalized.","commenter_a":"No,never.","post_message":"The White House says it is committed to closing Guantanamo Bay and will overcome the obstacles Congress is causing to prevent this. Should Guantanamo be closed?"},{"comment_id":"1701375029922619","commenter_b":"tough woman hiding behind a mask and hooded sweatshirt, hopes she wears that same outfit in prison","commenter_a":"Why are most democrats fat, stupid, and ugly","post_message":"Obama has allowed STUPID to take over this country...and it's putting American lives in danger!"},{"comment_id":"10153095975513606","commenter_b":"Unreal. Where I grew up the 'N' word was used frequently. Every time I was called that I retaliated. Im not a thug or a criminal. The teacher has to respect the students and vice versa. In hindsight the student should have went to the principal and then to his parents. Im in no way condoning what the student did but its a 2 way street. Dont bash the student when we dont know exactly what rhe teacher said. Racial slurs or any other forms of racism has no place in society. My kids or the kids I coach cant even say anything like that. Either way whatever was said isn't the problem. It was the lack of respect from the teacher and STUDENT.","commenter_a":"'@username you say teachers need to watch what they say. I don't get it. What about the child. Dosen't he need to be taught. I don't like what you said so I punch you. There are other ways of handling verbal abuse. This is disgraceful.","post_message":"Witnesses say a Prince George's County Schools student punched his teacher over a racially insensitive comment: @webpagelink"},{"comment_id":"665987530270126","commenter_b":"Don't forget though we will have to build an impervious penetrating wall around California to keep them there!","commenter_a":"So how about where ever the idiot pelosi lives at, lets make the area around her house and city a sanctuary city and move the unvetted refuges there. Put your monry where your mouth is wacko!","post_message":"Nancy Pelosi Has To Be The Stupidest Person To Ever Walk The Planet!"},{"comment_id":"10154370280236519","commenter_b":"Dear mikka, your existence proves that feminism is still very much needed in this day and age. As long as drooling troglodytes such as yourself still talk shit like this, there still is work to be done. Thanks for confirming.","commenter_a":"modern feminism is not related to feminism of the past..... modern feminism is pointless","post_message":"The plight of the bitter nerd."},{"comment_id":"10153254470474330","commenter_b":"I do not have girls, but if I did I would not let them wear either one of the dress below. they both look trashy, Asking for Trouble","commenter_a":"The guidelines may be appropriate.....yet they would have been honored if not considered had they come a month (or more) ago while these young women were shopping for the dresses!! Kids need to learn dress code acceptance to match the occasion...and while not promoting prudeism - if that is a word, my parents in the 60's would encourage us to leave some stuff to the imagination!","post_message":"Some controversy is brewing over prom dresses at Shelton High School. On Friday, the headmaster announced that dresses with slits, cutouts and backless styles wouldn't be allowed at prom. However, students and parents say the crackdown comes too late. They already bought the dresses. ---> @webpagelink  What do you think? Should the dresses be allowed or not?"},{"comment_id":"10153389055716770","commenter_b":"Wow is she stupid or what. Racist pig.","commenter_a":"Sure we can play with a bad bad boy and you will get bad results","post_message":"A CNN guest argued that her ex-CIA panel-mate was unqualified to talk about ISIS because he's white."}]
