[{"comment_id":"10154336382586729","commenter_b":"What a bitch...","commenter_a":"Maybe she could watch it from her prison cell!","post_message":"This woman...SMH"},{"comment_id":"874917705876659","commenter_b":"people need guns to protect them selves from this sort of scum. is this copper stil walking?","commenter_a":"I smell a wrongful death suit with a nice pay out cooking","post_message":"This is CRAZY! A unarmed boy's last moments were caught on bodycam, just before he was SHOT & KILLED by a TRIGGER HAPPY COP! Of course the cop will not be charged for any crimes. Blood boiling VIDEO: @webpagelink"},{"comment_id":"10153402450349456","commenter_b":"And he's out on bond in Montgomery and Elmore counties? What a joke","commenter_a":"Thug life is no good.","post_message":"One official said this is the worst case of home repair fraud he's ever seen. The suspect is also facing a murder charge in Elmore County."},{"comment_id":"659128370944408","commenter_b":"Ban them all through the U.S.!","commenter_a":"Yes!","post_message":"A town in Michigan just voted to ban mosques, this was the result. Things are about to get very controversial. Would you like to ban Mosques in your town?"},{"comment_id":"10153161330059270","commenter_b":"Women shouldn't be allowed in the special forces. Period","commenter_a":"No surprise.","post_message":"No women pass Army Ranger School."},{"comment_id":"10154145520606770","commenter_b":"Never, they're pigs. Tell them to oink off.","commenter_a":"When did they stop calling women like Kim who have no decency or moral compass pigs?","post_message":"The outfits that Kim Kardashian and Kendall Jenner wore were absolutely stunning."},{"comment_id":"10153106240459586","commenter_b":"Thank you for choosing adoption! <3","commenter_a":"Precious baby!! I have four rescued pets and must stop but it breaks my heart every time I see these posts..","post_message":"DON'T BREED OR BUY WHILE SHELTER DOGS DIE. @webpagelink CC: American Kennel Club & Westminster Kennel Club Dog Show SHARE if you ALWAYS #AdoptDontBuy!"}]
