[{"comment_id":"10153648874092060","commenter_b":"You made Nola.com Michelle!","commenter_a":"Tammy, we should have gone to target last night instead!","post_message":"Metairie Target shoppers got a little help with last-minute Father's Day shopping last night from a special guest – New Orleans Saints Quarterback Drew Brees."},{"comment_id":"10153189366828132","commenter_b":"Yes for real!!! That's hilarious.. but just a secret, I do it to. Except when they stare, I sing to them. And they sometimes laugh or look at me like","commenter_a":"I could so see Mervin doing Danielle!","post_message":"This police officer from Dover, Delaware, has some serious moves!"},{"comment_id":"10154169581782042","commenter_b":"@username dude are you serious?","commenter_a":"It will be shared with other waitress as a group in the restaurant where she most likely get $200 if there are 5 people working and 15 % to bar back #restaurantlife","post_message":"When an 18-year-old waitress saw a customer talking to her boss, she feared she had done something wrong. What happened next brought her to tears."},{"comment_id":"1698243613797536","commenter_b":"@username u racist chink","commenter_a":"Dimash Shayan we gotta do this","post_message":"Japan is hiring full-time ninjas!!!"},{"comment_id":"1056978507726395","commenter_b":"we Irish and Scottish built it","commenter_a":"Why does she have to keep using the \"I live in a house built by slaves\"? What about the whites, free blacks and immigrants who also helped build the White House? Stop playing the damn slave card already.","post_message":"Warning: Sharing this with your liberal Facebook friends may spontaneously burst bubbles..."},{"comment_id":"10152871641536051","commenter_b":"My husband served 20 years for this country and then a bitch like u get the freedom. U need to get the hell out of here and there may be someone out there that will really get mad and look for u bitch.","commenter_a":"Then WHY IS SHE HERE??? OHHHHH!!!! Cause she makes her $$$$$ here. Proud Americans STOP SUPPORTING THIS LOSER!!!!","post_message":"This musician says she hates absolutely everything about America."},{"comment_id":"606991596121137","commenter_b":"BLUE LIVES MATTER ! AMERICA SAY'S LOAD THEM UP , HEAD THEM OUT ! NO MORE ILLEGAL IMMIGRANTS BY AIR , LAND OR SEA ! NO MORE NICE GUYS , WE NEED THE RIGHT GUY TO GET THIS JOB DONE ! TRUMP IS THE ONLY CANDIDATE THAT WANTS TO DO THIS JOB / THAT CAN DO THIS JOB , VOTE TRUMP ! BUILD THE WALL AND NEVER FORGET WHAT verry husINsein oBUMa , Killery AND THE DEMislamOCRAPS HAVE DONE TO AMERICA ! PASS IT ON !! MAKE AMERICA SAFE AND GREAT AGAIN , IT'S YOUR VOTE FOR TRUMP THAT WILL MAKE AMERICA SAFE AND GREAT AGAIN !!! THERE IS NO PLACE FOR SHARIA LAW ANYWHERE IN AMERICA , THE CONSTITUTION IS THE LAW OF THE LAND EVERYWHERE IN AMERICA !","commenter_a":"Mr. Trump has this vote locked down in Florida ... hopefully the senators will get back to work soon because Mr. @username starts work on day 1... congress would be smart to have legislation ready to go across his desk","post_message":"GOOD MORNING AMERICA! New CBS poll just released. A strong indication that we are on our way to MAKING AMERICA GREAT AGAIN! Lets keep up the momentum, and have a great day!"}]
