[{"comment_id":"1734577893461739","commenter_b":"clinton continues to LIE- wikileaks has proved that-she should be in jail.","commenter_a":"His comeback sounded like something a 3 year old would say","post_message":"Hillary Clinton: \"Well that's because [Putin would] rather have a puppet as president of the United States.\" Donald J. Trump: \"No puppet, no puppet. You're the puppet.\" @webpagelink"},{"comment_id":"10153160535761491","commenter_b":"Shes nowhere close to finny. Shes more along the lines of annoying.","commenter_a":"Non stop coverage of Amy Schumer won't work. She's still not funny.","post_message":"\"Amy and I were creatively made for each other,\" Jennifer Lawrence said."},{"comment_id":"1705728746332744","commenter_b":"The blacks elected him with help thinking they would have it made financially etc and now more are out of work and on welfare than ever. They have to stay in school and work hard like everyone else to get ahead and blacks don't see it. How do they think you get a position anywhere?","commenter_a":"Absolutely","post_message":"SHARE IF YOU AGREE!"},{"comment_id":"10154165946748606","commenter_b":"Please don't stereotype. You can not speak for all Hispanics. We all don't \"love\" to drink and drive.","commenter_a":"RIP... The Hispanics love to drink and drive. Thank God mo one else involved this time.","post_message":"A car went airborne after hitting a beltway bridge abutment before landing on the roadway below, killing the driver. @webpagelink"},{"comment_id":"10153121291663984","commenter_b":"Not only false , but evil. Send them out of here !","commenter_a":"She has the right to distrust Muslims. Islam is a false religion it's really a terrorist organization.","post_message":"Her critics are attacking her mercilessly for what she said last week, but this Republican is standing by her comments. Do you agree with her?"},{"comment_id":"751075045025676","commenter_b":"@username I like the guy. He's obviously brilliant, but wasn't on top of his game last night. I'm glad he'll be able to survive it.","commenter_a":"Ben was kinda catatonic at the debate last night. Luckily, the liberal zealot moderators stole the show and the headlines.","post_message":"In 3......2......1.......BOOM!"},{"comment_id":"1050256608364201","commenter_b":"Lol. Ridiculous! Hillary2016! !!","commenter_a":"Hillary, Hillary, Hillary. Time to throw in the towel NOW, so when you eventually convicted there is still a Democrat in the White House to pardon you. Keep on campaigning and the Grey Bar Hotel has your name all over it. As I said in my post titled, Smoking Gun: Hillary E-mail Instructs Aide to Delete Classified Markings, I don think anyone really expected Hillary to get a prison sentence, even if indicted, and then convicted, not until the most recent email anyway. Several days ago, The Daily Caller Reported: [FBI] has so much information about criminal conduct by her and her staff that there is no way that they walk away from this, Joseph diGenova, formerly the District of Columbia U.S. Attorney, told Laura Ingraham in a Tuesday radio interview. are going to make a recommendation that people be charged and then Loretta Lynch is going to have the ...","post_message":"Thank you, Ellen DeGeneres."}]
