[{"comment_id":"521903667998585","commenter_b":"So much for ESPN claiming to be a 'all inclusive' company.","commenter_a":"We no longer have free speech. Opinions are free speech. These liberals are destroying the Consitution.","post_message":"The final straw came when Schilling shared a virulent anti-transgender meme on Facebook. via NBC Sports"},{"comment_id":"10154686033581336","commenter_b":"Yeah...nothing says 'witch hunt' like having your underlings whack up 13 mobile devices with a hammer...then giving those underlings immunity...then they all plead the 5th except for one who doesn't show up under subpoena.","commenter_a":"Trumps lewd comments must be getting old or too obvious, I woke up today hearing how No presidential candidate has ever threaten to put their opponent in jail, That is because the previous 44 elections there wasn't a candidate with a 30 year crime sheet. God I hate our media.","post_message":"WATCH: 'Mini-Trump' joins Donald J. Trump on stage at a rally. @webpagelink"},{"comment_id":"10155201901781162","commenter_b":"Maybe the writers can be more select on how they word their headlines. Maybe they do this on purpose cause they get a kick out of reading the comments. You never know.","commenter_a":"Reading is key... trumps pic did employ an illegal, but upon finding out ended her employment and aided in getting her assistance in getting legal status ... this is why america is the way it is... read a title and jump to conclusions... most of the people protesting can't really hold a conversation about why there out there.. other than 1 line headlines they repeat over and over... it's sad","post_message":"President Trump's labor secretary pick, Andrew Puzder, admits that he and his wife employed an undocumented housekeeper for years...@webpagelink"},{"comment_id":"10153244569769087","commenter_b":"Youare a fucking ignorant whore.","commenter_a":"Benjamin Netanyahu - is protecting the Free World while Hussein Obama wants the Deadly Suicide Pact with Iran. Wait until Iran hits America with their ICBM's, Iran can already Hit Israel.","post_message":"Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו delivered an intense silent protest of the Iran nuclear deal by staring down members of the United Nations General Assembly for nearly a minute without saying a word. WATCH:"},{"comment_id":"1079564272093616","commenter_b":"Keep the Government off our backs and away from our wallets President Trump, and put up that Wall, enforce The US Constitution, and Bill Of Rights and that should help Us all to have a Better 2016 !","commenter_a":"Happy New Year Mr. Trump! My son loves the Christmas card you sent him.. God bless you.. We love you! Trump 2016!!!!!!","post_message":"I would like to wish everyone A HAPPY AND HEALTHY NEW YEAR. WE MUST ALL WORK TOGETHER TO, FINALLY, MAKE AMERICA SAFE AGAIN AND GREAT AGAIN!"},{"comment_id":"424685420989386","commenter_b":"Not the smartest gal around","commenter_a":"It's a tough way to learn a had lesson. I pray she did and will soon have another job that she will probably appreciate.","post_message":"Was this lady unfairly dismissed?"},{"comment_id":"1064050356984826","commenter_b":"Karen why do you want a President that would say, 'single payer will never ever come to pass'? Despite over 58% of Americans supporting it, knowing it will save us money and insure everyone, and that every other industrialized country in the world has had it for years and years. @webpagelink Or someone who corporate lobbysists know will end up supporting the TPP? Do you know what this trade deal would do to my generations future? If you did you would not be voting for her. @webpagelink Please for my future and my generation future vote for Bernie in the primaries. #NoMoreTradeDealsThatSendJobsOverseas #HealthCareForAll #BernieForPresident #NinaTurnerForVP #WarrenForMajorityLeader","commenter_a":"It's Hillary's time! Bernie is good in the Senate.","post_message":"This is it—the Iowa caucus is today! If you’re standing with Hillary, share this."}]
