[{"comment_id":"10153018351676336","commenter_b":"Disgusts me to see girls acting like this and the bystanders with the cell phones out! Come on now","commenter_a":"As a parent, I would be MORTIFIED to see my child standing there videoing the fight! Doesn't anyone have compassion any more? \"Mean girls\"... smh... it's out of control! We should have evolved beyond this.....","post_message":"A shocking photo appears to show the moment a Texas mother pulled out a gun and pointed it at a high school student."},{"comment_id":"10157713910895354","commenter_b":"@username Palestine did exist until the state of Israel was founded in 1948.","commenter_a":"Come on haters, start shit talking a kid that was brought up right by patriotic parents. You would applaud him for waving a rainbow flag.","post_message":"LOVE THIS. How about a hand for this young man respecting the Pledge of Allegiance?"},{"comment_id":"1252133991511641","commenter_b":"Hillary Clinton for the next president","commenter_a":"Just like President Obama said, if his own campaign can't even trust him with a simple tweet, then why should we trust him with the nuclear codes? #VoteBlue","post_message":"Donald J. Trump's peek at Melania Trump's ballot inspired a flood of jokes"},{"comment_id":"10155016645768010","commenter_b":"Let's keep in mind the big picture here. Less illegals, the better.","commenter_a":"As we've learned from all his businesses, failures and bankruptcies...he is very good at spending other people's money.","post_message":"He wants to get Mexico to reimburse the U.S."},{"comment_id":"10154320018886323","commenter_b":"Fascist dictatorship and destruction of cabinet government system. Democracy under attack.","commenter_a":"I am okay I never voted either tyrant but that's that's English government","post_message":"\"The Tories are about to give us a second female prime minister while much of the left will say gender is an irrelevance or that there are many more important things to deal with. Women, know your limits!\""},{"comment_id":"899546906747398","commenter_b":"F muslims, and GTFO!!!","commenter_a":"Heck no he is in the grave why would you move him ..when the Muslim can be buried somenplace else .this is against his family to be removed.","post_message":"Pathetic! (MUST READ)"},{"comment_id":"10154764685995470","commenter_b":"Walls do work... ask any prisoner. They keep the bad guy's in and on the border they will keep the bad guy's out... and pregnant mothers wanting a free birth provided by an American hospital. The border invasion has to stop and Trump will stop it.. The wall is a cheap way to get the job done.","commenter_a":"I hope all the geniuses that voted for these clowns are ready to part with their hard earned money...","post_message":"House Speaker Paul Ryan says Congress will front the money for President Donald Trump's newly announced wall on the U.S.-Mexico border."}]
