[{"comment_id":"1140355262709675","commenter_b":"'@username, I see you as the Liberal that you are, crying for this BS, but you'd be the first one to file a complaint AFTER you've been accosted by a perv in the women's bathroom.","commenter_a":"No, I'm not done shopping at Target. Do all these people really believe they'll be attacked? Get over yourselves.","post_message":"Target just announced that transgenders will be able to use any bathroom they want. I'm pretty sure they were not expecting what happened immediately after their announcement...  Are you done shopping at Target?"},{"comment_id":"1349866401695684","commenter_b":"Ember Kellough When the left wants to bring in millions of illegals and Syrian's it isn't from having a heart but instead to eventually expand their voter base, all about power and control with the left. When they do gain that we can kiss our Country goodbye or stand up and fight them in another civil war. When over 60% of births are coming from liberals it's difficult to not see it coming. The commie left will turn America into another Detroit and Baltimore.","commenter_a":"Obama is: 1st.muslim 2.gay 3.communist Don't be surprised, he's doing exactly what he said, fundamentally transforming the country. America 'voted' for this.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"380130102360204","commenter_b":"And how much are we spending on the illegals and the refugees?? Probably a lot more than the wall and the homeless combined. Let's take care of Americans and America's needs FIRST!! After we take care of our Veterans, our homeless, our children and build the wall we can consider helping those that want to come here legally!! Resources should not be going to illegals until all Americans are taken care of.","commenter_a":"I can buy a candy bar for a dollar or give the dollar to a homeless person. Wait! I can do both!!!","post_message":"We could Build a Wall, or End Homelessness... I know which one I'd Choose, Do You?  Join Us: The Free Thought Project"},{"comment_id":"968194983273556","commenter_b":"The bitch sucks and is a liar and a cheat","commenter_a":"Is she your next President? I don't think so.","post_message":"She still managed to pay herself back the $1.3 million she lent her disastrous campaign."},{"comment_id":"10153467199834255","commenter_b":"Look bitch, I'm done with you. FACTS seem to hurt your little righty brain.","commenter_a":"I've been hearing these stupid comparisons for days now. How friggin ignorant can some people be? A racist flag flying over a state building and rap music?? Such utter fools.","post_message":"The stupid. It burns."},{"comment_id":"10156887460220093","commenter_b":"'@username @webpagelink","commenter_a":"Trump is a die hard Liberal","post_message":", I lived in New York City and Manhattan all my life, okay? So, you know, my views are a little bit different than if I lived in Iowa, perhaps. -- Donald J. Trump"},{"comment_id":"10154476827456636","commenter_b":"'@username the most powerful twat in the world more like.","commenter_a":"Whether Trump comes, makes a speech in parliament, or visits the queen, is irrelevant, it was the speed with which he was invited by May, that smacks of embarrassing desperation to me.","post_message":"More as we get it"}]
