[{"comment_id":"10154925152646320","commenter_b":"Omg bottom left woman.. I hope after seeing her fkn face she would stop doing drugs !!","commenter_a":"Dam, they should've left Tiffany Dawn Evans alone. If that girl can make money from sex, cudos to her.. poor thang!","post_message":"Almost a dozen people in South Carolina were arrested on prostitution charges. Some of them were also charged with drug-related offenses...  @webpagelink"},{"comment_id":"10154568442846336","commenter_b":"Stupid","commenter_a":"him","post_message":"During a press conference, Secretary of State John Kerry suggested the media should stop covering terrorism 'quite as much.' @webpagelink"},{"comment_id":"10153805945213908","commenter_b":"'@username While I agree you should be happy with your body, I suggest that this woman is also happy. Some tall women are naturally thin thighed.","commenter_a":"again...give this skinny woman some food...why do all naked women have to be super skinny ???","post_message":"A very powerful message here."},{"comment_id":"1282583651782104","commenter_b":"People are starting to pee on the streets, into fountains, garbage cans, on car tires, between parked cars, the state is stinking like a outhouse what if confused people take to shitting between parked cars?????","commenter_a":"If you go in the bathroom with my daughter I will.","post_message":"These people are literally threatening murder on a public forum."},{"comment_id":"10153468728217507","commenter_b":"By RIGHTS she should be arrested, Constititutionally tried on TV and executed for TREASON. The first woman","commenter_a":"Hillary is a disgrace","post_message":"47 more states to go!"},{"comment_id":"496097670580813","commenter_b":"better yet, remove them from the planet","commenter_a":"Damn muslims.","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"10154180246323984","commenter_b":"Ha ha bitch you lost .........","commenter_a":"This is why they Hate Donald Trump, He is upsetting the SCheme they have in PLACE! @webpagelink","post_message":"Many are predicting that Marco Rubio is going to lose his home state of Florida in tonight's primary. Rubio has a plan if that is the case, and it's going to surprise a lot of people.  Is it over for Rubio if he loses Florida?"}]
