[{"comment_id":"10154719758246729","commenter_b":"It's Kommiefornia. What do you expext! The same state that protects murdering illegals and ignores the FEDS!","commenter_a":"Yes, the word conceal is not used, however to bear arms is, so I guess we must be back to open carry, a 45 on every hip. I hope you don't mind if I should play the Rifleman as Chuck Connors can not.","post_message":"\"Shall not be infringed,\" right? Wrong."},{"comment_id":"10154376636126509","commenter_b":"I once heard, all Asian look alike!","commenter_a":"u killed innocent boy shame to those who disagree with Obama abt guns new law","post_message":"\"I just shot my son by accident.\" An Ohio father shot and killed his teenage son early Tuesday morning, apparently mistaking him for an intruder, Cincinnati Police said."},{"comment_id":"10156090164245354","commenter_b":"She not a little fat she a Big FatASS just saying.","commenter_a":"maybe she deserves execution,someone must think she has creepy perv eyes,and she,s fat","post_message":"Here's what we're dealing with, folks…"},{"comment_id":"10153736495329753","commenter_b":"Yes","commenter_a":"Of course he's backing Killary. He's a libtard!","post_message":"Incarcerated hip-hop artist Bobby Shmurda has endorsed Hillary Clinton’s 2016 presidential bid. The 21-year-old leader of the Brooklyn-based GS9 crew is the latest in a string of high-profile hip-hop artists to back the Democratic front-runner, including Snoop Dogg, Pharell and Eminem. According to Shmurda, Clinton is the most suitable candidate to take over the Oval Office in November because of her “strong mind” and empathetic nature. “I’m going for Hillary, man,” he told Vibe. “I like... @webpagelink"},{"comment_id":"10153117067891350","commenter_b":"Lil cunt","commenter_a":"Abbey Maclean","post_message":"This is just too cool! Watch our own Natalie Morales transform into a zombie for The Walking Dead."},{"comment_id":"10155119419651320","commenter_b":"Looks pumping","commenter_a":"THE ISSUE IS NOOOOTTTTT MUSLIM!!!!!","post_message":"Democrats hold an anti-Trump protest in Washington D.C."},{"comment_id":"1099534980113254","commenter_b":"Anderson cooper is a killery bitch","commenter_a":"The country will be dancing in the streets if that happens. If anyone can get the job done, it's Donald J. Trump!!","post_message":"Donald Trump says he will prosecute Hillary Clinton if he becomes President of the United States."}]
