[{"comment_id":"581422622060041","commenter_b":"Hahaha!! Funny!! \"Blacks are lazy\" \"Super Predators\" \"Heel\" -Hillary Clinton on blacks","commenter_a":"Make America dumb again is his slogan this guy caught on tape making fun of so many people she makes a mistake with emails an everyone losses their minds he's not for the people of different cultures he order his supporters to attack people an they did why are you voting for him that's the real ?","post_message":"With Medal of Honor recipients seated behind him, Donald J. Trump tells supporters: \"They're so much more brave than me. I wouldn't have done what they did. I'm brave in other ways ... I'm financially brave.\" @webpagelink"},{"comment_id":"10153456933913132","commenter_b":"Oh my word!!!!! What in the hell?! If you don't want your baby there are plenty of ways to give it up safely! I will never understand women!!","commenter_a":"@username wtf is wrong with people","post_message":"Kimberly Pappas reportedly stored her baby in a drawer after giving birth in a bathroom at work."},{"comment_id":"677264589079564","commenter_b":"If Muslims are offend by us they can leave and go else where....maybe Syria.","commenter_a":"He'll no","post_message":"Muslims Are OFFENDED By This Teams Fans Uniforms, Should They Be Forced To Change it? Take our poll!"},{"comment_id":"10155204940516337","commenter_b":"Well, those compys had gotten away before the story even started.","commenter_a":"I prefer the way the book ended.","post_message":"THE ORIGINAL ENDING of Jurassic Park might blow your mind..."},{"comment_id":"1134794909920596","commenter_b":"He bitch ya breathe smells like shit I can prove it.","commenter_a":"Well thats what the little shit gets for fucking with a monkey","post_message":"Angry baboon throws poop in little girl's face! #WSHH"},{"comment_id":"10154121936472894","commenter_b":"Yes... trip his ass!","commenter_a":"I don't understand why some dudes so quick to wanna shoot at other dudes over money & drugs.. BUT NO ONE HAS SHOT THIS FOOL YET! Some thug nigga, PLEASE COME BE MVP. Make that sacrifice. 😂😂😂😂","post_message":"George Zimmerman Kicked Out of a Bar After Calling the Manager a Ni*ger Lover"},{"comment_id":"577421592439857","commenter_b":"I don't believe anything this woman says.","commenter_a":"\"You can always point a finger. But there's three pointing back. Literally, If you point a finger at someone else, three of your fingers are pointing back at you. This also means that you need to stop blaming others and deal with your own issues to help yourself.\"","post_message":"Hillary Clinton and her running mate Tim Kaine have released their tax returns, as her campaign called on Donald J. Trump to do the same."}]
