[{"comment_id":"936091029833983","commenter_b":"Shut up LIBTARDS","commenter_a":"Trump 2016.","post_message":"We have a message for Donald J. Trump: We're going to do everything we can to make sure you never become president. Sign this letter if you agree: hrc.io/2aaJYl5"},{"comment_id":"10153700162853010","commenter_b":"By bring them here ,you are taking food out of the mouth of those poor people.","commenter_a":"Don't we have enough ,dogs here..","post_message":"The Humane Society International has apparently taken possession of more than 100 dogs from a South Korean farmer in recent months, paying the farmer to transition to other crops."},{"comment_id":"10153486926096770","commenter_b":"Conservative Populist? Lmfao","commenter_a":"Trump your next President.","post_message":"After acknowledging he will now raise money for the general election, presumptive Republican presidential nominee Donald J. Trump has named a national finance chairman who has a history with some organizations that could clash with his conservative populist message."},{"comment_id":"10157484651970725","commenter_b":"@username PAM she is already DESTROYING THE COUNTRY !","commenter_a":"Go trump ! So, 96% of Hillary's charitable donations went to the Clinton Foundation! Yeah, 96%, they donated to themselves.","post_message":"Unbelievable! Thank you Erie, Pennsylvania. This is a MOVEMENT! I have no doubt that we are going to WIN -- and MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"1452387791451811","commenter_b":"until they bring in these terriosts refugees here watch diseases spread","commenter_a":"Not vaccinated your all welcome","post_message":"Antivaxxers, don't fuck this up for us."},{"comment_id":"838491256240234","commenter_b":"Please go back to whatever planet you came from!!!! Haven't we had enough of her?","commenter_a":"Oy! She is no longer relevant, though she keeps trying to be. Now just looks foolsih. Very sad.....","post_message":"They're back! The Palins are trying to horn in on the Duggar spotlight, regardless of how grimy."},{"comment_id":"10154425895814087","commenter_b":"Let's all pretend Byrd didn't flip on racial issues. Let's pretend he didn't become a staunch advocate for civil rights. Byrd was honored by the NAACP. Your meme is fucking stupid.","commenter_a":"NEWS FLASH !!!! The only people happy with Trump are the ones that hide under sheets and dunce caps, while molesting children and raping disabled people, while burning crosses and churches! ! THIS IS BULLSHIT! !! LOCK TRAITOR TRUMP UP FOR TREASON! !!","post_message":"A spokesman for music producer Quincy Jones -- a Hillary Clinton supporter -- says he will not be attending Trump’s New Year’s Eve party and doesn't know why the Trump team said he would."}]
