[{"comment_id":"1384307571620555","commenter_b":"I think this woman just swallowed her safety pin.! Lol .","commenter_a":"Grow up you he she","post_message":"Give it a rest..."},{"comment_id":"10153070666326336","commenter_b":"Kill all the non believers Haider? That's killing innocents!!!","commenter_a":"if anyone believes Iran will not pursue nuclear power they are delusional...they are playing the obama admin the same as every politician before.","post_message":"'It is necessary that the stance of the U.S. administration be defined about this move.” - Iranian Foreign Minister Javad Zarif"},{"comment_id":"10154014162531636","commenter_b":"Nope! Jeremy Corbyn.","commenter_a":"ISIS?","post_message":"BREAKING"},{"comment_id":"10154213118095575","commenter_b":"Bingo","commenter_a":"Maher looks like a child molester","post_message":"Unbelievable!"},{"comment_id":"882254358503349","commenter_b":"My child would be instantly removed!","commenter_a":"Yes it would and yet silence from the sooo offended group.","post_message":"ISLAMIZATION: LA Public School: Teaching Kids  Is The One True God (VIDEO)  @webpagelink"},{"comment_id":"10153521099233010","commenter_b":"save your water for your illegal aliens...smfh","commenter_a":"Typical republican: 'entitled'.","post_message":"More than a dozen times, a white truck filled up at a Thousand Oaks hydrant and hauled the water to Selleck’s 60-acre ranch in Westlake Village -- court documents allege."},{"comment_id":"10154313146426045","commenter_b":"Lady Liberty not going to get you in HEAVEN","commenter_a":"For all the Christians out here, I thought you might need a reminder of what your God says about foreigners. Leviticus 19:33-34 ESV “When a stranger sojourns with you in your land, you shall not do him wrong. You shall treat the stranger who sojourns with you as the native among you, and you shall love him as yourself, for you were strangers in the land of Egypt: I am the Lord your God. Before anyone starts screaming Old Testiment. Mark 12:30-31 (NIV) 30 Love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’[a] 31 The second is this: ‘Love your neighbor as yourself.’[b] There is no commandment greater than these.”","post_message":"Mexican President Enrique Pena Nieto said his country  not pay for any wall, defying the claims U.S. President Donald Trump has made."}]
