[{"comment_id":"1137036859677480","commenter_b":"She is a nut case","commenter_a":"How many times must we see ..she is done..it's over..and the statement actually be true...","post_message":"BOOM!"},{"comment_id":"1041072545948147","commenter_b":"You look like a witch already","commenter_a":"this the third post i've seen with this baby and all the \"after\" babies are different babies...the jig is up!!! i'm starting to suspect the witchcraft claim is true...this baby has changed to even 3 different complexions and facial features or somebody has nothing to do by come up with lies to make themselves feel righteous!!!!","post_message":"A little positivity out of a horrible situation 🙏 Baby Hope, who was found starving on a street in Nigeria after he was abandoned by his family over accusations of witchcraft, makes extraordinary improvements since he was helped by Danish aid Anja Ringgren Lovén."},{"comment_id":"10153598643443812","commenter_b":"Hmmm....will it help us grow perfect women with nice titts?","commenter_a":"Cristian Reyes","post_message":"World's largest atom smasher detects new kind of subatomic particle called the 'pentaquark' -- a new form of matter: @webpagelink"},{"comment_id":"1358265534191667","commenter_b":"She is an ignorant cunt and let some one break into her house and use it up and then she will change her mind","commenter_a":" .. . The problem is not guns. It is hearts without G-o-d. It is homes without discipline. It is schools without p-r-a-y-e-r. It is courts without justice. It is Obama willful destruction of the economy and good jobs, families to flourish. It is Obama directive to not enforce gun laws, giving himself the perfect excuse to label guns as the problem. Right out of the Marxist Playbook. HE is the problem. HE is the greatest traitor in the history of human civilization.","post_message":"The founder of Moms Demand Action for Gun Sense in America says she's done wallowing in disappointment following Donald Trump's victory last week."},{"comment_id":"10154404367061037","commenter_b":"Get a life lady","commenter_a":"When trump loses I wonder what the trump voters that have outed themselves as racists and bullies are going to do, double down or deny it.","post_message":"Is Donald J. Trump's historic presidential run doomed to fail?"},{"comment_id":"10154799760844641","commenter_b":"Stop being such a yes woman","commenter_a":"Lol!!! It's Obama fault that a Multinational move jobs overseas!!!! Lol Let's blame Obama for the KKK, Osama, Sunspots, AIDS, making it late to work, and etc..... Daddy Trump is going to fix everything.... hahahhahahaha","post_message":"Some Rexnord workers said they felt left behind by President-elect Donald J. Trump"},{"comment_id":"1085472271464242","commenter_b":"If they are on there with consent, are actually single, or are polyamorous, this breech will not hurt any relationship. But this site advertises directly to cheaters.","commenter_a":"How many users on am are there with full consent of their partners? How many are actually single? How many are polyamorous? These things you don't know, and here you are cheering on this invasion of privacy for all am users, because you don't align morally with a subset of users. This kind of punishment never goes away, and that is especially a problem for those who don't deserve it.","post_message":"Will this hack be the one to get people to care about digital privacy?"}]
