[{"comment_id":"881902655289442","commenter_b":"Something is wrong with this woman's reasoning. If the plumbing says you are a man, you are a man.","commenter_a":"Just more of Obummer bullshit, today I feel like woman ,today I feel boy, today I feel privilege so today ogle little girls. ,today I'm black or am I white, damn asswipe..","post_message":"According to the attorney general, laws cannot be made to define gender because individual feelings trump the law.  What if I feel like I already paid my taxes, even if I didn't. Do I still have to pay them?"},{"comment_id":"10156528431575354","commenter_b":"Screw her","commenter_a":"Boo-fucking-hoo! Lifes tough on EVERYBODY! And not everyone drives their car up on the sidewalk! Now the media will make her out to be the victim! Put her ass in prison and throw away the key!!","post_message":"Changed Name from ‘Lakeisha Holloway’ to ‘Paris Paradise Morton’…"},{"comment_id":"10152847429722623","commenter_b":"Yeah because throwing fish chunks attracts puppies","commenter_a":"Jessica Kennedy South","post_message":"Check out this photo:"},{"comment_id":"10153715209333984","commenter_b":"Build a wall and send them home.","commenter_a":"You know illegal Mexicans come in this country illegally the women wait till about a month before delivering their child snake in this country have their child hoping to get birth rights I think if you come in this country out of another country if you have a child here your child is from your country not mine god bless the United States and we're going to try to keep it that way","post_message":"These Texas counties are doing something that has earned them a warning from Mexico, but it doesn't look like they're letting that stop them!  Do you support what these counties are doing?"},{"comment_id":"10152591855036636","commenter_b":"An attractive white girl dies. Everyone loses their minds.","commenter_a":"Oh dear . Was going to say . Oh my God . Hmmm. There are many people out there that need help . Just look around and you will be amazed . Some think that is the only way out . Look deep before before you criticise .","post_message":"Tragic."},{"comment_id":"10155955897895354","commenter_b":"The nasty b*tch just wanted attention and guess what? Now everybody is giving it to her.","commenter_a":"For the life of me I will never understand killing these magnificent animals. I just don't understand how it can be wonderful, thrilling, exciting or in any way fulfilling to kill an exotic animal. And then chop it's head off or whatever you do with that giraffe and have it mounted. Makes not one bit of sense let alone any kind of satisfaction.... Just don't get it.STOP IT NOW!!!!","post_message":"This hunter is single-handedly breaking the Internet today.   Check out the photos of her other controversial kills..."},{"comment_id":"1452387791451811","commenter_b":"until they bring in these terriosts refugees here watch diseases spread","commenter_a":"Not vaccinated your all welcome","post_message":"Antivaxxers, don't fuck this up for us."}]
