[{"comment_id":"10153804113241770","commenter_b":"Wasn't it Hillary yesterday stating that she has always been in favor of strong vetting of refugees? Obviously she sees which way the wind is blowing on that issue, so she's trying to get onboard. Wish she and Obama had been in favor of that when they started letting this evil, diseased crap into the country by the tens of thousands.","commenter_a":"I've always been amused at the people who say you shouldn't profile. But EVERYONE does it on a daily basis. That's a bit of reality for you... Yes to profiling, more stop and frisk.","post_message":"Republican presidential nominee Donald Trump called for profiling techniques to combat U.S. domestic terrorism threats during an appearance on Fox News Monday."},{"comment_id":"477526855778749","commenter_b":"@username It won't because its Racist...You that Dumb??","commenter_a":"Celebrating Diversity while excluding whites is NOT Diversity. It is Discrimination.","post_message":"“Seeking NON-WHITE men and women, ages 20s to 30s, for Broadway and upcoming Tours!” the casting notice for \"Hamilton the Musical\" read."},{"comment_id":"10154529062833132","commenter_b":"Your son probably won't even know what's going on unless he's seen the first one. Gtfo with your nonsense lady. I hope your son grows up to be a better adult then you.","commenter_a":"Cant they just leave the kids movie alone? Kid's dont need to see that. My son isn't going to see the movie now. I swear the gays have to take over","post_message":"Ellen DeGeneres is addressing the issue some people had after the recent Finding Dory trailer."},{"comment_id":"555525737965249","commenter_b":"@username for starters, voting for someone as corrupt as Hillary Clinton has proven to be is worse in the long run for this country than electing a fool like Donald Trump. He says stupid things, she does criminal things.","commenter_a":"The whole Republicans party think like Trump!!","post_message":"This should be required viewing for all Trump supporters. Shared by Occupy Democrats, SHARE to spread the message!"},{"comment_id":"10156161317710354","commenter_b":"the American police would be arrested for this.","commenter_a":"\"....it became clear to German authorities that a significant number of migrants they were trying to process were NOT Syrian refugees...\" They finally came to that conclusion?","post_message":"Chanting \"ALLAH HU AKBAR”...Pelting Police with Giant Rocks...MORE... Follow Breitbart London for up-to-the-minute breaking coverage of the migrant crisis..."},{"comment_id":"350626235140891","commenter_b":"She needs to be gone","commenter_a":"Then take Kenyatta West and get the hell out of the USA I think Iran would be a good place for you .","post_message":"Hip-Hop Artist Hates America, White Americans and Conservative People!"},{"comment_id":"1442770955748411","commenter_b":"Well he's better than that BITCH","commenter_a":"That's an insult to pigs!","post_message":""}]
