[{"comment_id":"10153869614430329","commenter_b":"She's not even made up of gasses, geez","commenter_a":"We throw the term \"star\" around way too often","post_message":"She tells BuzzFeed News, “I don’t regret it for a second.”"},{"comment_id":"10154190292923908","commenter_b":"My balls itch !","commenter_a":"perhaps they learned something from mother nature, (she fights back) with a swift justice. earthquake anyone else ;) it's time to rethink the old ways and start a new, where nature comes first <3","post_message":"Good..."},{"comment_id":"1254986011246599","commenter_b":"@username, Hillary was pandering the liberal black voter.......sickening to say the least! Hang the bitch till dead.","commenter_a":"I sense a lot of vigilantes are going to start taking matters into their own hands, since Obama, of course refuses to acknowledge blacks are the problem.","post_message":"This is the nightmare we all envision when thinking about being stuck in a riot. What would you do in the same situation..."},{"comment_id":"10155189089842439","commenter_b":"Please believe...that they are AT WAR with the rest of the non-islamic planet!!! The rest of the world will have to join together and obliterate them!!","commenter_a":"Why this evil group, can still perpetuate these senseless brutal killings of people, is difficult to fathom! This is one legacy!, Obama will be remembered for!....under him, the killings of human beings in the middle east became a sport! Obama, thank you very much!","post_message":"ISIS has released a new video showing a brutal execution of an Iraqi man. ISIS drowned the man in liquid detergent."},{"comment_id":"645397708975441","commenter_b":"Wow, does he have any world facts available to him?","commenter_a":"My 15 year old answered the question","post_message":"This is just laughable."},{"comment_id":"860171507364731","commenter_b":"Wow... really? So sad.. moms please be very careful who u leave ur kids with..","commenter_a":"she looks like she is a... \"few bricks short of a load\"","post_message":"This 18-year-old girl is accused of leaving her little sister in a hot car while her and her friend went shopping for swimsuits. Investigators say the 2-year-old's temperature was already at 100 degrees when she was rescued:"},{"comment_id":"10155964895995354","commenter_b":"Dumb ass bitches is right on!","commenter_a":"All you dumb ass bitches on the view.. Trump isn't against Latino's. He's not asking for Latino's to be thrown out of the country. He wants illegal immigration stopped. Kelly Osbourne is a racist. Imagine if Donald Trump had said that!!","post_message":"Here's what Hollywood really thinks of minorities... And one of the View's co-hosts is Latina! WATCH how well she takes it in this video:"}]
