[{"comment_id":"10154252810014749","commenter_b":"Women should do what they please and men can lump it.","commenter_a":"Burqa is not an Islamic thing it should go away, a women should dress modestly and cover her hair.","post_message":"15 countries have pledged to support the ban for security reasons, and there has hardly been any opposition among the Muslim community."},{"comment_id":"10153141821778352","commenter_b":"Fuck that!!! I will be in no way shape or form involved in any queer shit in my household!!!! Point blank period NO SON OF MINE WILL EVER BE A GIRL!!!","commenter_a":"I could never accept my son being A Gay!!!!! Hell naw I'm not raising no queer in my household !!! Goodbye go live ya life but not in my fuckin house!","post_message":"'We don't support that': Christian parents who were blamed in their transgender daughter's suicide note REFUSE to accept her female identity after she walked in front of truck, but insist they loved 'him'"},{"comment_id":"10151087068944999","commenter_b":"ALL ILLEGALS LEAVE AMERICA NOW!","commenter_a":"I wonder how many of them are legal immigrants. What's wrong with deporting illegal immigrants?","post_message":"On Thursday, foreign-born residents stayed home, or took to the streets, in protest of President Trump's immigration policies."},{"comment_id":"10153809290224753","commenter_b":"She's a greedy mama! She's pathetic!","commenter_a":"Why do people keep making this disgusting family rich? They have no talent, nothing but yet people are infatuated with them please STOP talking about them, no one cares what they do!! And let's not start with that disgusting Jenner dude/lady wanna be","post_message":"Kris Jenner is ready to cash in on son Rob Kardashian and Blac Chyna’s surprising baby news. According to a new report by People, Jenner is reportedly looking at Kardashian and Chyna’s pregnancy from a “financial perspective” and is seeing some major dollar signs both for herself and the newly engaged couple. While some of the Kardashian and Jenner family were a little skeptical over the news that Rob and Blac are preparing to give Jenner another grandchild, People revealed that “Kris is... @webpagelink"},{"comment_id":"10154292764041162","commenter_b":"No Theresa but implying that passing through narrow corridors and jumping fences is the only way immigrants \"cross the border\" is just idiotic. Again, not all undocumented immigrants \"jumped fences & crossed the desert\". Many overstay visas, meaning they went through a border check-point.","commenter_a":"\"I felt like I was crossing the border!\" Best line ever!!!","post_message":"WATCH: Trump comments on entering convention surrounded by protesters. \"It felt like I was crossing the border.\" @webpagelink"},{"comment_id":"1128902297147109","commenter_b":"go home...STFU!","commenter_a":"Kasich you are an idiot!!!!!","post_message":"John Kasich said of the idea: \"It doesn't feel right.\""},{"comment_id":"10155755235340725","commenter_b":"U mean I have to marry ur ass!? Ugh","commenter_a":"Patti McGough, let's meet at Daley center on tuesday.","post_message":"#BREAKING: Supreme Court rules all gay couples have a constitutional right to marry-----> @webpagelink"}]
