[{"comment_id":"1061821787247406","commenter_b":"fact, king obama ignored our federal immigration laws and gave amnesty to millions of illegal aliens including the illegal that killed Kate steinle. had he enforced our laws and put a stop to san Franciscos sanctuary city policies that woman would be ALIVE today. fact, obama blamed cops before the facts came in about doin their jobs. cops were killed after his comments. had king obama stood up for cops and denounced black violence those cops would be ALIVE! wake up Cynthia. who's to blame for this mess? every MORON that voted twice for king obama. 😡","commenter_a":"so when king obama blames police for doin their jobs and cops get killed it's not king Obama's fault? when king obama allowed illegal aliens to invade our communities and then kill innocent Americans like kate steinle it's not king Obama's fault? you leftest are MORONS and HYPOCRITES. 😄","post_message":"\"People have to understand that hateful rhetoric and words and harassment of doctors and harassment of women going to health centers have real implications.\" -Planned Parenthood President Cecile Richards"},{"comment_id":"467133756816336","commenter_b":"That is a disgusting fact. Those people should be ashamed to call themselves 741915279236631s","commenter_a":"That is a shocking testament of liberal standards & ethics!","post_message":"A new poll found 71 percent of Democratic voters believe Hillary Clinton should keep running even if indicted, a view shared by only 30 percent of Republicans. Where do you stand?"},{"comment_id":"1007015132691568","commenter_b":"They're a success for the home invaders, they don't have to worry about getting shot now.","commenter_a":"Sadly gun crime happens so many time in the USA one wonders why they just don't legislate for firmer gun laws, but then again that will never happen...","post_message":"'America is a financially failing filth farm', he ranted"},{"comment_id":"1066896063328404","commenter_b":"Get these suckers!","commenter_a":"Billie. Do you need to suck each and every bit of lefty nonsense and regurgitate it?","post_message":"Four House Democrats are calling for an investigation into the Center for Medical Progress (CMP) as the group’s deceptively edited video attacking Planned Parenthood continues to fall apart under public scrutiny."},{"comment_id":"1211880145496741","commenter_b":"No to illegals.","commenter_a":"Mr. Gowdy, enlist some of your \"sleeping\" colleagues to assist!","post_message":"Thank you!"},{"comment_id":"10153078698497994","commenter_b":"Ucs ? Every district around them closed! who are they competing with? This lady shouldn't be a superintendent of a kennel let alone of our children!!!","commenter_a":"378 schools closed today and a handful of are schools still open that has to be frustrating to parents, teachers and students. This is one situation it's not okay to stand out","post_message":"Nearly 300 schools are already closed this morning (including Detroit Public). You can check out the list here."},{"comment_id":"949029821890932","commenter_b":"@username Before you vote for Clinton remember this. a vote for her is vote for a another kilo of heroin across an open border polluting Americans and contributing to more crime.","commenter_a":"If you are privileged enough so that a Trump presidency doesn't matter to you, vote against him for the many people he will take advantage of if he wins.","post_message":"Most Americans, regardless of their political views, do not want to see us go backwards, and are not going to be supporting a candidate for president who has made bigotry the cornerstone of his campaign."}]
