[{"comment_id":"10153265757247061","commenter_b":"No, he was too busy lighting our disgraced white house Christmas tree.","commenter_a":"If you have no interest in hearing President Obama, why comment? I'm sure he's not reading your negative comments. He's much too busy and has other more important things to focus on, unlike you, who clearly have too much time on your hands!","post_message":"BREAKING: President Barack Obama to address the nation from the Oval Office on Sunday night at 8pm ET, White House says. @webpagelink"},{"comment_id":"10153544166434024","commenter_b":"NY is the capital of THE WORLD! If you don't want to spend money LIVE SOMEWHERE ELSE! As far as Cruz goes I thought Republicans want smaller government. ??? Good get out of our marriages and get out of our doctors offices. (Women's Drs offices)","commenter_a":"Freedom of speech... He's right about the liberals in NY. Who cares. NY is insanely wrong when it comes to taxes and wages... The truth hurts.","post_message":"WATCH: Ted Cruz slams Gov. Cuomo and Mayor de Blasio when asked about calls for an apology for his remarks on 'New York values.'  Your reaction to Cruz's latest comments?"},{"comment_id":"10153724968238145","commenter_b":"Wow the desperation of perverts grown woman don't want you so you seek a teenager . Get rid of scum bag .","commenter_a":"Glad they got him.","post_message":"BREAKING: This happened at the Publix on SR-434 and Wekiva Springs Road. Angela Jacobs will have a live report at 12pm."},{"comment_id":"870170056373024","commenter_b":"Illegal aliens yes. Immigrants that come in legally and get properly documented should be allowed work as long as they don't have a disease or criminal record.","commenter_a":"Me too","post_message":"71% of voters said they would be in favor of Congress passing a law making it illegal for businesses to hire illegal aliens. Don't you agree?"},{"comment_id":"10153437815231680","commenter_b":"She is worthless!!","commenter_a":"Hillary... Who DA feck Cares!!!","post_message":"Hillary Clinton: 'Well, as one of the more than 65 million Americans who voted to reelect Barack Obama, I’d say my voice is being ignored right now because of their obstructionism.'"},{"comment_id":"10154950558833256","commenter_b":"How on earth can you make this RACIAL?. It grabs EVERYONE!","commenter_a":"I wish I can say I am shocked; but just about every one black who's trying to make a difference is going through it' other races probably are also' its horrible '","post_message":"Calling the practice of intercepting cellphone information secretive and widespread, a federal lawsuit alleges Chicago has an 'arsenal' of cell site simulators (or 'Stingrays'). When deployed by police, these devices capture data from any phone in its range — not just the intended target.  'Government spying on its citizens without appropriate judicial oversight is inconsistent with the freedoms guaranteed by the Constitution,' said Jerry Boyle, a Chicago attorney who brought the case."},{"comment_id":"1937711623123134","commenter_b":"If Clinton is chosen over Trump, there will be a howl in the land like never heard before.....the fix would be in for the political elite and the upper 1%","commenter_a":"OMG. It's over. Get on with life.","post_message":"In Opinion, Harvard professor Lawrence Lessig says there is precedent for such a move."}]
