[{"comment_id":"10154729418265530","commenter_b":"Shut ur mouth Ried,!","commenter_a":"I guess in political land , it's against the law to investigate corruption and scandals to someone who broke the law , but can't be investigated because it may hinder the election ?? Lots and lots of question marks here ?????????","post_message":"\"Through your partisan actions, you may have broken the law,\" Harry Reid tells FBI Director James Comey: @webpagelink"},{"comment_id":"133746713872563","commenter_b":"Burn in Hell scumbag","commenter_a":"You mad!!!!!","post_message":"JUST WATCH: Here's a snippet from the sentencing of Michael Morgan, the man convicted of killing two children in a house fire. @webpagelink  What do you think?"},{"comment_id":"10153935429529726","commenter_b":"That motherfucker is insane. Period.","commenter_a":"It couldn't be her dishonesty and lack of personality.","post_message":"WATCH: Howard Dean: Sexism to Blame for Hillary's Communication Problems"},{"comment_id":"1650724908525555","commenter_b":"Let's see, she and Obama, on one hand, want to take our guns, and on the other hand, want open borders of illegal aliens and possible terrorists to enter the Country. They are aiming to make all of America a soft target. Whose side are they on, anyway? Never mind, I think we know. Vote out all liberal, progressive, Democrats. Obviously, they are mentally ill.","commenter_a":"Gun control my a$$ - We ALL need to be armed!","post_message":"Wasting no time..."},{"comment_id":"677143662389195","commenter_b":"Shut Up!!!!!","commenter_a":"The Patriots are speaking! Donald Trump is our Patriot Leader! E-verify. Numbersusa.com. Arm all our military - - active, reserve, and veterans. Honor The Constitution / Bill of Rights, limited government, free enterprise, and USAmerican exceptionalism. Make The USA Great Again! Go, Trump! Support the Muslim Reform Movement. No more terrorists! m.facebook.com/Muslim-Reform-Movement-@username/ MuslimReformMovement.org","post_message":"If Donald J. Trump \"gets his way, it will be like Christmas in the Kremlin,\" says Hillary Clinton"},{"comment_id":"600457780118425","commenter_b":"You fukn punks need to get out of our country. You are a disgrace to black people everywhere. You bitches are pathetic excuses for human beings.","commenter_a":"How much did Soros pay them??????","post_message":"Trump Hating Thugs Spit On Flag… Look What Happens Next [VIDEO].  If you don't respect Ole' Glory then you can leave our country.  Do you think these thugs should be deported?"},{"comment_id":"1035142053187556","commenter_b":"Either sit quietly or shoot em. Dont bitch until they get pissed to","commenter_a":"I know the cops were doing wrong but for fuck sake shut your damn mouths and calm down and shit wouldn't escalate","post_message":"WTF! Just because they \"smelled marijuana\"??? Full story here: @webpagelink"}]
