[{"comment_id":"630177530448762","commenter_b":"It is not surprising, if it was a terrorist attack the pilot would have tried to crash the plane into a very densely populated area i.e not the French Alps.","commenter_a":"I'm relieved (and surprised) that the pilot's last words weren't Allah Akbar.","post_message":"Aha! That's a BIG part of it I'm sure."},{"comment_id":"1306172506079052","commenter_b":"@username if immigrants want to come to America and live the American Dream they should work for it. Trump isn't against immigration he is against ILLEGAL undocumented immigrants. If u want to come here, come the right way.","commenter_a":"And when a pregnant illegal comes here and has a baby born here that baby is a citizen and then that baby is able to get welfare food stamps housing WIC fuel assist etc... All while the mom is an illegal but cuz child is born here it's entitled WAKE UP AMERICA","post_message":"Donald J. Trump responded Monday to the worst terror attack on U.S. soil since 9/11 with a tough call to clamp down on Muslim immigration. @webpagelink"},{"comment_id":"10153558491861051","commenter_b":"Holy hells crybaby slavery ended 150 plus years ago u were no slave no one in america today owned a slave sorry your ancestors got sold to whites by other blacks and were forced to come here and work but no one alive today is responsible for it how about a lil respect for the northern army who marched on thier own people to free the blacks i always hear the we were slaves evil white mans fault but when in history has a race fought itself to free another race?so many northerners died freeing blacks for what so theu can bitch and moan and blame all whites","commenter_a":"By legal you mean taken from Africa to work (no pay, against our will, beaten, raped, broke our families a part and more), on you fields of dreams (plantations), so that American can prosper because you sure tried to make it hards for blacks, than you are white I mean right Mr (Master) Tump","post_message":"Trump says he opposes all illegal immigration, but firmly believes that legal immigrants are the backbone of America. Do you feel the same way?"},{"comment_id":"10154784324202577","commenter_b":"First Amendment, Bitch!","commenter_a":"nothings going to change you yanks have been played for fools","post_message":"If Donald Trump truly wants to drain the swamp in Washington he must make an example out of this evil corrupt family and send a clear message that he is here to bring about real change."},{"comment_id":"10153243727475667","commenter_b":"@username Ireland built America, because the locals were too lazy. Shall we continue with stereo types, girls?","commenter_a":"I assume none of you gun-lovin' yeehars will ever come over and visit civilised nations. Just keep your gun addiction fetish stateside, and you won't have a problem. Try and set foot outside of your bunker, and your shiny, highly polished barrels will be removed from you. And so your manhood shall be no more. Bless your cotton socks. :)","post_message":"You can now open carry at ticketing and baggage claim."},{"comment_id":"1142481939134045","commenter_b":"F*** that nicole. That's not kool. Omg! 😨","commenter_a":"@username Logan Rose","post_message":"Would you? #WSHH"},{"comment_id":"10155415846376509","commenter_b":"Money time you know it","commenter_a":"Vinny","post_message":"New video shows power lines exploding on Merritt Island, Florida, as Hurricane #Matthew lingers just offshore. More footage from Florida as Matthew hits: @webpagelink"}]
