[{"comment_id":"870850106350450","commenter_b":"She's desparate and we already know that she'll say anything to get a vote. I wouldn't be mad if she stroked out.","commenter_a":"Yeah ok","post_message":""},{"comment_id":"1038357019610877","commenter_b":"If BERNIE goes Independent, or goes Green, then Good, Hillary is a bitch, a liar, a thief. BERNIE should do anything and everything he can to defeat the nasty bitch. #NeverHillary #BernieSanders2016","commenter_a":"We may still be able to achieve some things of value at the convention. Bernie's current top priority at the convention (as stated in a conference call with his delegates) is to change the Democratic party rules to \"un-rig\" future Democratic primaries so they will be fair to future Democratic party presidential candidates. For him (and our delegates) to have any chance of making future Democratic primaries more fair via votes in the rules committee at the convention, we need to get all our pledged Bernie delegates funded. We are still at risk of losing over 100 pledged Bernie delegate votes, purely due to lack of funds. That's down from over 200 a couple of weeks ago because we have never stopped trying to get them funded. For everyone who is #StillSanders, can you please consider donating $2.70, $5 or $10 (if you can spare a few dollars) to help ...","post_message":"We are building a movement because this country belongs to all of us - not just a handful of billionaires and wealthy campaign contributors. And I'm asking people across the nation to come together and organize an unprecedented grassroots movement."},{"comment_id":"10154394102516336","commenter_b":"So true having spent tons of time over there for many years it has changed to be almost unrecognizable sad that my grandkids will never know how wonderful London and England was","commenter_a":"We are next. TRUMP will win.","post_message":"“I think that the British people have had it. They fear terrorism just as the American people fear terrorism.”   Bill O'Reilly breaks down #Brexit, saying it’s not about economics but rather immigration. @webpagelink"},{"comment_id":"10154254253351336","commenter_b":"She's Nasty !","commenter_a":"White guilt is a real thing. Sad but true.","post_message":"“I’m a white lady. I’m an easy target,” Melissa Click said in an article."},{"comment_id":"1367333429993068","commenter_b":"^^^^ angry feminist.....who'da thunk it","commenter_a":"so much narcicism in society these days...so many women demanding to be seen as \"beautiful\"....its ridiculous. And the kicker, if youre a man, and you say they are fat and unattractive then you are a \"chauvanist\" or \"intolerant\" etc etc etc....but you know what, why do women not go crazy over fat rotund men??? where is the fat acceptance movement for those guys? I rest my case.....no ladies, that isnt attractive.","post_message":"'These are the women you've rolled your eyes at... or joked about with your friends'  (via Daily Mail Australia)"},{"comment_id":"10154493895401509","commenter_b":"He's not going to win the general election! Ha!!","commenter_a":"BOOM!!! #Trump2016","post_message":"BREAKING: CNN projects Donald J. Trump has won the #NVCaucus. @webpagelink"},{"comment_id":"968795919903853","commenter_b":"The woman is so stupid, only reason she is in because of her color.","commenter_a":"Punta","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response.  'LIKE' if you think Rep. Maxine Waters should be kicked out of office for showing such strong support of ShariaLaw."}]
