[{"comment_id":"10153383817802061","commenter_b":"Super cute","commenter_a":"Dad's are important too","post_message":"WATCH: Heartwarming and powerful new message with NFL's DeAngelo Williams, Jason Witten and Ben Watson on spending time with daughters, as they do their hair and bond with them."},{"comment_id":"10153875712703128","commenter_b":"Natalie Grace","commenter_a":"my iphone 6s lpus battey has not died on me. it has lasted me all day every day. they increased the battery life so if people are having problems then thats off","post_message":"With its entry into the battery case market, Apple finally admits that heavy iPhone users could use more juice. Its solution also fixes many of the issues present with third-party cases."},{"comment_id":"10154223634466770","commenter_b":"She's got great legs","commenter_a":"All these red carpet shows are about is who can have the most revealing, revolting and trashy outfit on! It's rare that there's a decent one, but I guess they're the ones not shown because they aren't revealing enough! Too bad these \"artists\" don't rely on talent!!!","post_message":"We didn't even know they made dresses this short."},{"comment_id":"10154975862774062","commenter_b":"That woman just wouldn't stop she makes the situation worse and keeps it going she brings it on herself if I were that man I would hit her too","commenter_a":"Men shouldn't punch animals like that. Poor cow..","post_message":"The confrontation quickly turned into a brawl."},{"comment_id":"10155204940516337","commenter_b":"Well, those compys had gotten away before the story even started.","commenter_a":"I prefer the way the book ended.","post_message":"THE ORIGINAL ENDING of Jurassic Park might blow your mind..."},{"comment_id":"10154160211386336","commenter_b":"Stfu feminist","commenter_a":"Thank you @username for backing Megyn Kelly. If the cry babies can't take the hard questions, they can watch the lamestream stations.","post_message":"Unbelievable. (Via: ViralHog)"},{"comment_id":"901335433248814","commenter_b":"It's time for YOU to answer AMERICA about BENGHAZI !! The four AMERICANS that lost their lives are on your clock and hands !!! It's time for YOU to answer AMERICA !! WHERE YOUR MILLIONS CAME FROM !! IT IS TIME FOR YOU TO TELL THE TRUTH ABOUT YOUR EMAIL CRIMES !! IT IS TIME FOR YOU TO ALLOW THIS COUNTRY TO BE MORAL AGAIN !!!","commenter_a":"If you are against he NRA, then you are for gun confiscation.","post_message":"“This has gone on too long and its time the entire country stand up against the NRA.”"}]
