[{"comment_id":"10154420630831378","commenter_b":"That's because she's a big liar too","commenter_a":"And less than 7 hours ago Kellyanne Conway said the White House has full confidence in Flynn.","post_message":"#BREAKING National security adviser Michael Flynn has resigned. @webpagelink"},{"comment_id":"1246473882081393","commenter_b":"TURN THEM LOOSE AN PAY THEM TO KILL AMERICANS !!!!","commenter_a":"Go figure that thank you Mr. Obama and miss Killory you guys are doing America so good","post_message":"REVEALED! Minnesota Mall Attacker ID'd As One Of Hillary's Somali Muslim Refugees!"},{"comment_id":"471958379619606","commenter_b":"People like carl can't help themselves... He is a result of stupid people having children.... they raise more stupid people... in turn that have more children.....which sadly are unleashed on the rest of us..... It's and incredible and sadly unstoppable event...... OR its that he has to call his mommy Aunt Mommy and his daddy Uncle Daddy... Showing us why incest is illegal... . either way they unleash these morons on the rest of us to deal with....","commenter_a":"Wow talk about prostituting your site @username. Look what I found as an advertisement on your story.","post_message":"Unbelievable."},{"comment_id":"10153792660631545","commenter_b":"Just like recent a white women in alexandria,la a manager at canes got stabbed by a black an but do they see us protesting and stuff.come on now","commenter_a":"Why do black people complain about their shootings??? Ever hear about Asians or white people being shot?? Do they protest like you do? Do they get anything specific??? No","post_message":"\"They had him pinned down,\" Abdullah Muflahi told CNN. \"He was out powered. There were two of them and there was one of him, and they were right on top of his chest.\""},{"comment_id":"10154323932234091","commenter_b":"I am so so so tired of the general public making excuses for these clowns and demanding we idolize them and refer to them as heroes. A LOT of them are just low IQ goons who made it through a few weeks of police academy and are let loose on the streets to act juvenile and bully citizens. And the more people worship them and expect the rest of us to, the more emboldened they feel to keep up this embarrassing and sometimes even deadly behavior.","commenter_a":"Yet another incompetent coward revenue collector.","post_message":"\"We thought (the officer) was texting on his phone. Because the whole three hours we were sitting here, he was the one standing there. We saw him on his phone, but we didn't think an officer would do that.\""},{"comment_id":"1060450227347787","commenter_b":"Media whore...can't help herself.","commenter_a":"Yup....Good old Alaska values.","post_message":"She chose to spend her time - not with her critically injured husband in Alaska - but thousands of miles away with Donald Trump."},{"comment_id":"10152898754710950","commenter_b":"For real, dude. She rolled up talking shit. Lmao!!!","commenter_a":"Why is she riding a motorized wheelchair if she can brawl? What a loser and gets the kid involved too. This will be used as an example of spandex white trash by the comedians.","post_message":"In a video of the incident, two women are heard yelling at one another before the argument escalates and gets physical. Then a 6-year-old gets involved; at one point, the boy is seen hitting a woman with a shampoo bottle as the women wrestle on the ground."}]
