[{"comment_id":"10154246766848797","commenter_b":"Denise unfortunately this is what your kid will probably end up doing! And you're beyond IGNORANT & clueless lady btw!!!!","commenter_a":"Black on black. Stop. We have to fight murder from the pd, ourselves, institutional genocide. Proverty. Racism. Chicago public schools. Residuals of enslavement. We are protesting all day and everyday.","post_message":"TUESDAY VIOLENCE: Five people were injured in shootings Tuesday on the South Side. Most recently, two teenage boys were shot in the Englewood neighborhood."},{"comment_id":"10152870782829091","commenter_b":"Who kill innocent people ... Im just saying .. Encourage them America ....this is why the world is crazy cuz of the way y'all( liberal whites ) think ..filthy animals","commenter_a":"What the hell is wrong with people..... She should of had her students send letters to our troops","post_message":"SHOCKING: A teacher in New Jersey has been suspended for having her third-grade class to write get well letters to a sick inmate convicted of killing a Philadelphia policeman: @webpagelink [PHOTO: Forest Street School]"},{"comment_id":"10155788720365405","commenter_b":"What are you smoking Kate!","commenter_a":"Let's all remember that when Reagan was inaugurated, within hours he was greeting our 50+ hostages held in Iran for more than 400 days. Gov. Walker, you may be the one that will greet them in those hours following your inauguration.","post_message":"In this bad Iran deal, Obama has given up a lot and he hasn't even managed to bring back our Americans currently held hostage in Iran's prisons. We have to stop this reckless and irresponsible deal today. Join me in calling on Congress to stop this deal: @webpagelink"},{"comment_id":"10153794663986491","commenter_b":"More reasons for not having a women as President....","commenter_a":"\"Good guy with a gun\" turned murderer in 20 seconds.","post_message":"\"It was a family argument that turned into a shooting.\""},{"comment_id":"10154745395538984","commenter_b":"@username wow that's hot","commenter_a":"megan , why don't you lick hillary's ass , and ask trump about how he worships the devil in secret , like you believe , your a hack for clinton , move to cnn","post_message":"You don't see this every day. Trump's campaign manager went on \"The Kelly File\" to discuss Trump's debate tactics. Even though Megyn was on the attack, Kellyanne Conway came up with the PERFECT campaign strategy that Hillary definitely won't want to deal with. Do you think this could work?"},{"comment_id":"10158040412050206","commenter_b":"I was thinking that too. Where is the Air Marshal?","commenter_a":"Good on the pilot.... but where the hell are some of the passengers to help??? Seriously....bunch of cowards.","post_message":"This 25-year-old passenger was restrained by a pilot after pushing and threatening a flight attendant on an American Airlines flight into Charlotte, North Carolina. @webpagelink"},{"comment_id":"10153816638906336","commenter_b":"They were to busy kissing her big a**s.","commenter_a":"Wonder what kind of \"humor\" the View women shot at Michelle Obama?","post_message":"“If you meant [the] comment about my face being demented as a Halloween mask as humor, so be it… I have a real thick skin,\" Carly Fiorina fired back."}]
