[{"comment_id":"702518316605413","commenter_b":"What is wrong with these kids???!!! They're turning into barbarians! Totally unacceptable!!!!","commenter_a":"Now the parents most likely were at the welfare office getting stamps like all the other unemployed shit they can't flip a burger over that's too hard","post_message":"Three students were arrested yesterday at William Allen High School In Pennsylvania.  Other students stood by and watched as they did this to her. Will you pray that this officer will be ok?"},{"comment_id":"631005147090064","commenter_b":"run him off. his wife also.","commenter_a":"he must be on drugs again.","post_message":"Obama said that America wants him to run for a third term, here's how they responded.  What a joke. This is absolutely ridiculous.  Do you think Obama should run a third term?"},{"comment_id":"456493334475707","commenter_b":"Fuck u bitch and that pedophile country PISSRAEL","commenter_a":"PISSRAEL","post_message":"In the following report, we’ve replaced references to Israel with the Islamic State of Iraq and Syria (ISIS) to make a point about how differently they are treated by the media and politicians."},{"comment_id":"10152505089467434","commenter_b":"So feminism is bs cuz this guy is an a-hole?","commenter_a":"Jefferson owned slaves, Ayn Rand's life was full of contradiction ... ideas are not contingent of the righteousness of the persons life, they are objective concepts.","post_message":"A knowledge of feminism doesn't always translate into expressions of feminist ideas."},{"comment_id":"10156316346195725","commenter_b":"@username , but Muslims will not vote for him","commenter_a":"We need you now Donald Trump!!!","post_message":"Remember, I was the one who said attack the oil (ISIS source of wealth) a long time ago. Everyone scoffed, now they're attacking the oil."},{"comment_id":"677232809133964","commenter_b":"The scumbag needs to be fired .... then she needs to be stripped of her teaching certification!!","commenter_a":"Fire her.","post_message":"This teacher threatened her student if they didn't submit to her beliefs.  She has absolutely no right to try and dictate what her students believe.  Do you think this teacher should be fired immediately?"},{"comment_id":"704906709652228","commenter_b":"What a joke this lady is. I bet she is protected by Guns every single day... But she doesn't want Americans to be able to protect themselves. Just ridiculous","commenter_a":"Yah, just fill out form ID-10T and they'll ship a gun right to your doorstep Mrs. Douchebag. This is exactly why the establishment left cannot have nice things.","post_message":"“You shouldn’t be able to exploit loopholes and evade criminal background checks by buying online or at a gun show…We have to make it harder for people who should not have those weapons of war.”  – Hillary Clinton reacts to the #OrlandoShooting @webpagelink"}]
