[{"comment_id":"539030936307389","commenter_b":"@username you're not paying for my uterus. Lol.","commenter_a":"So, Kaine, a Roman Catholic, has a moral conflict with his faith when it comes to the death penalty (killing criminals) but no qualm whatsoever promoting the killing of unborn babies?","post_message":"Mike Pence is a good man who had a strong performance tonight. This evening Tim Kaine demonstrated that he would serve as just another enabler of the failed Obama-Clinton policies that have hurt our economy, taken away our freedom, and weakened our security. The choice for Americans is clear. We cannot afford a third term of President Obama, and Clinton-Kaine would only continue the disastrous policies of the last eight years."},{"comment_id":"10153521942669369","commenter_b":"Criminals will just buy another brand.","commenter_a":"Good. Maybe less guns on the streets.","post_message":"It's the end of an era."},{"comment_id":"10154081618264087","commenter_b":"There's nothing wrong with her we all saw her open a jar of pickles","commenter_a":"Selfish move since her so called Pneumonia is very contagious . She was in a crowd, she hugged a small child. Not a good thing when you have Pneumonia.Just another lie, how can you believe anything the Clintons or their Clown say.","post_message":"\"I think it shows that she's not one who likes to call in sick.\""},{"comment_id":"1134554249934436","commenter_b":"Lol. She is a democrat. I hope you never wander into a voting booth","commenter_a":"We must stop the democrats and Hillarys war on women and the unborn!","post_message":"Every dollar goes toward making sure Donald J. Trump never becomes president."},{"comment_id":"10152596201106717","commenter_b":"He is the biggest coward that we have had as governor I hope all the gay republicans that voted for him are happy","commenter_a":"Let him sign it and flush his Walmart welfare state further down the toilet.","post_message":"\"If Governor Hutchinson allows this bill to take effect, it will amount to a giant, flashing 'Gays Stay Away' sign.\""},{"comment_id":"10157699168860294","commenter_b":"If you think he can do that with all the times she's been investigated over the last several years you're sadly mistaken.","commenter_a":"Trump is not for social society so I can't be for him","post_message":"“If I win, I am going to instruct my attorney general to get a special prosecutor to look into your situation because there has never been so many lies, so much deception.”"},{"comment_id":"10153428606317042","commenter_b":"Hell NO. They invited the idiot with the gun","commenter_a":"Yes.. including the idiot that set everything into motion causing the cancellation of the biggest time of their lives.. they could of ACCOMMODATED THEM INTO A ROYAL SWEET OR BALLROOM. ..I MEAN AT THE ASTORIA ...IM SURE THEY,SPENT A PRETTY PENNY. TRAUMATIZED AS WELL. SUE EVERYONE ... Not the doorman.... They were suppose to have a \"Dream Wedding and honeymoon\" ........ . Seriously.....","post_message":"COUPLE SUES HOTEL: The couple whose wedding was canceled after an accidental shooting in the Waldorf Astoria New York is filing a multimillion dollar lawsuit against the hotel. Do you think they should sue?"}]
