[{"comment_id":"10153193599506770","commenter_b":"I think Audrey had her brain aborted !","commenter_a":"Will she have an abortion since Grandma Hillary wants everybody to have abortions.","post_message":"Hillary's going to be a grandma again."},{"comment_id":"10153949050391037","commenter_b":"One word: uneducated","commenter_a":"Trump has had my vote from the start to finish ... Nothing anyone says can \" change \" my mind .... We need a business person in the seat to lead not be a tyrant.","post_message":"“During anxious times, it can be tempting to follow the siren call of the angriest voices. We must resist that temptation,\" Nikki Haley said."},{"comment_id":"10154307345026729","commenter_b":"I am a liberal and I totally agree with the poster, so why are you irritated with liberals; your reasoning doesn't make sense to me.","commenter_a":"Or becoming traitors and taking over federal buildings!","post_message":"This will definitely irritate liberals and the \"coexist\" crowd"},{"comment_id":"606223439551496","commenter_b":"Cough cough a lady? Your kidding me! She is one of the most evil murderous woman alive.","commenter_a":"Oh yes Vicente like a mother that does nothing. One who allows her children to run amuck without obeying any rules or following the law. One who lies and deceives others for her own monetary gain. A mother who blames others for her mistakes. Yes Former President Vicente Fox this is your kind of Mother. Your people would continue to invade America. Our country would suffer greatly. Your drugs would kill and maim our children and others. She is just the Mother for you. However in America we want a different leader. We want Donald Trump. He will protect and defend America where others would not.","post_message":"\"I envision the presidency of the United States to be like a good [loving] and caring mother, a real lady,” said Vicente Fox."},{"comment_id":"10153126028062235","commenter_b":"Shame on her !!!","commenter_a":"Oh please! Hahahahahah!","post_message":""},{"comment_id":"10155222410880354","commenter_b":"Oobama and his stupid bastards.","commenter_a":"Deport EVERY SINGLE ONE!","post_message":"Obama Administration Sets Up Hotline for Illegals Seeking Amnesty Under Obama's New Policy."},{"comment_id":"1048920205189554","commenter_b":"@username idiot!!!!","commenter_a":"It's not necessary to test on animals. Their bodies are not like ours.... it means nothing. Do the back study of how useless animal testing is, folks.","post_message":"This is the heart-touching moment 156 beagles are set free from an animal testing facility in India. Credit: Caters TV"}]
