[{"comment_id":"10154858585008797","commenter_b":"If they are here illegal. they are just deported . That's why I care if they are here illegal!! they'll just come back in to commit more crimes..","commenter_a":"How many are legal citizens","post_message":"GANG BUST: After nearly three years of undercover investigation, a total of 96 felony charges have been filed against 16 gang members."},{"comment_id":"10153127976631162","commenter_b":"You sound ignorant you stupid old lady","commenter_a":"A 3, 2, year old and she is 8 months pg. give her birth control.","post_message":"TODDLER SHOOTS PARENTS: A 3-year-old boy shot his dad and his 8-months-pregnant mom when he found a loaded handgun in her purse while looking for an iPod. READ MORE: @webpagelink"},{"comment_id":"10153661151756167","commenter_b":"Ditzy Daisy, throw her out! Keep her coat! Knock the cr*p out of her! Go ahead back to your momma! Drag her outta here! Ditzy Daisy, she's really nuts folks, really nuts. Yep, that's how Drumpf would handle her...","commenter_a":"That goes for all you communists who call us racists and if you spell president trumps name wrong again. The democrats are the party of anti american hate mongering. Now we can sue yo ass.","post_message":"Trump’s plan to “open up our libel laws” is just the beginning."},{"comment_id":"10153199958166051","commenter_b":"The bitch is lucky to be alive","commenter_a":"Why sue the apt for our own stupidity??? You don't block windows with any furniture you know in case of FIRES!!!! Geeze what a stupid smuck","post_message":"This woman fell out of bed, though an open window and three stories down to the hard ground below. Now she's suing."},{"comment_id":"10153157843033984","commenter_b":"I am thrilled! I pray someone stops the madness. We must enforce our immigration laws abs seal our borders.","commenter_a":"A judge with Balls","post_message":"Obama received a major smackdown last week! Amnesty plans halted!! Are you as happy about this ruling as we are?"},{"comment_id":"10153051540886028","commenter_b":"The employee probably had no idea what the Isis flag looked like. Uneducated people who have no idea about current events would have no idea. With the whole Confederate \"battle\" flag all employees probably got a notice with its picture on it saying why Walmart wants nothing to do with it. Common sense people. Also total set up to prove a point that we choose at the moment what we're going to have a hissy fit about and how worse things could totally go under the radar because of the uneducated and ignorant people out there. I guarantee you most people couldn't recognize 3 out of any of the 50 state flags and I'm being generous with that! Sad truly sad!","commenter_a":"Freedom of speech and the 1st Amendment take precedence here....any and all cakes should be baked without political correctness.....","post_message":"\"Hi, Walmart, you've got some explaining to do.\" One man is calling out Walmart for refusing to make him a cake decorated with the Confederate flag along with the caption, \"Heritage not hate,\" only to say yes to making an ISIS flag cake. \"I’ve got proof. Went back yesterday and managed to get an ISIS battle flag printed. ISIS happens to be somebody we’re fighting against right now who are killing our men and boys overseas and are beheading Christians.\" Now, the chain is apologizing and says the ISIS cake \"should not have been made.\" @webpagelink"},{"comment_id":"636474266540179","commenter_b":"She's an idiot!!","commenter_a":"I watched her speech on the live stream and was absolutely blown away. Credit is definitely due to the writer, but Ashley's delivery was perfect. The emotion as well as strength behind those words brought tears to my eyes!","post_message":" am nasty like Susan, Elizabeth, Eleanor, Amelia, Rosa, Gloria, Condoleezza, Sonia, Malala, Michelle, Hillary! Ashley Judd at the Women's March on Washington"}]
