[{"comment_id":"10152902814047623","commenter_b":"some whites were brought here as slaves cheese whiz","commenter_a":"Well the NAACP is racist but we arent trying take away their heritage or bill of rights","post_message":"Someone scrawled the word “racist” in black paint on a Confederate monument in uptown Charlotte overnight, officials said."},{"comment_id":"1713956375559891","commenter_b":"I think ladies should have control over their bodies but what if your mama aborted you","commenter_a":"Bravo Guttier","post_message":"This is AMAZING. The ending is the best part. Share if you agree with Congressman Luis V. Gutierrez and give his page a LIKE! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1068924329809654","commenter_b":"I would hope so Peter! Because she is a women","commenter_a":"I've always considered myself conservative, I box, hunt, camp, work hard, and don't support socialism, but I believe Bernie is the best canidate.. I know for a fact I'm more manly than the person who typed this weak paper","post_message":"An open letter from a real woman to \"male adults\": \"We can and we should cherish men who exhibit traditionally masculine characteristics. They have made the world what it is today. I raise my glass to you gents. I've even made you a sandwich. But on the flip side of these strapping, rugged men there's you. A Bernie Sanders sycophant with not quite enough self-worth to fill an egg cup. Or a teaspoon. Certainly not enough to fill your bong. Take a good long puff before you read the rest of this, it's not going to get any better. I'm not going to make you a sandwich either. May I recommend a Hot Pocket? What is a man? A man, as defined by this woman, exemplifies the evolutionary behavior of a provider. This can take one of two forms (maybe both) of hunting and/or gathering. The more successful the man ..."},{"comment_id":"10153406065866800","commenter_b":"Already happened. That's the point.","commenter_a":"Wow, ok. So it's ok for a black person. To be racist, but if a white comedian made any of these jokes in reverse he'd be chased off the stage by pitchforks. Really guys? It goes both ways.","post_message":"\"For some reason black people need a white person to get their message out. I'm going to make this work for me, I'm going to hire a helper whitey.\" -- Jessica Williams"},{"comment_id":"10153811229123433","commenter_b":"1. Hardly \"record\" when the number of abortions is going DOWN. In 1990, there were 1.6 million abortions performed. Today, it's a little over a million. Numbers don't lie. 2. Hundreds of thousands of women were getting abortions BEFORE Roe V Wade legalized them. You are more likely to die due to childbirth/pregnancy complications than an abortion. 3. You are contributing to your own problem. Teens that had received comprehensive sex ed were 60% LESS LIKELY to get pregnant. The states with abstinence only education have HIGHER rates of teen pregnancy compared to states that actually teach sex ed. Why do women get abortions? Unwanted pregnancy. Much less likely to get pregnant when you're using contraception. It's not rocket science. 4. Abortion isn't free. The Hyde Amendment prohibits any federal funding of abortions except in the case of incest, rape, or danger to the life of the mother. They most ...","commenter_a":"What do you call 350k annually, or 10,000 late term per year how many is \" record\"?@webpagelink","post_message":"From the trail in Iowa. Carly Fiorina wrongly claims that we're seeing \"record\" abortions. @webpagelink"},{"comment_id":"1576836375956014","commenter_b":"And yes, you will pay for that f'n wall!","commenter_a":"Fox apologized to Trump and invited him in May. He is a liar","post_message":"The former president of Mexico, Vicente Fox Quesada, says Donald J. Trump is using his visit to Mexico with President Enrique Peña Nieto to boost his sinking poll numbers. @webpagelink"},{"comment_id":"961966360614126","commenter_b":"I bet Walt Disney rolled over in his grave whenever he's found out what you become you are such a vulgar I can't even use the time lady because ladies do not act like that but I will come help you pack free of charge I don't care what you have and how many boxes how many trucks I will help free of charge just to get you out. And thank you for the promise","commenter_a":"Good","post_message":"THEY'RE OUTTA HERE!"}]
