[{"comment_id":"1242932969112927","commenter_b":"shes a nigga","commenter_a":"the origin of dream locks is india; not africa, not jamaica, not america. that girl is ignorant.","post_message":"Black student filmed confronting white student because of his hairstyle"},{"comment_id":"594411744025341","commenter_b":"You probably have one between your legs Shannon!","commenter_a":"Who cares! It's an inanimate object! Ever heard of idolatry? This is it!!!! True followers of Christ don't kneel before a statue, they kneel before the one true God.","post_message":"What does sheer animalistic Muslim hatred against Christians look like? Story below."},{"comment_id":"10153283394148984","commenter_b":"She needs to be in the big house not the white house","commenter_a":"Grill her ass !","post_message":"Trey Gowdy has invited Hillary Clinton to testify, in private, on her decision to delete thousands of emails from her private server as well as the full scope of her responsibility in the 2012 attacks at Benghazi. Let Rep. Trey Gowdy know how you feel and customize an email just for him!"},{"comment_id":"10155106719593132","commenter_b":"She probably was in on it. What woman in her right mind would move in with a man whose wife mysteriously \"disappeared\" just 2 months prior? Both had to know she wasn't coming back.","commenter_a":"Girlfriend needs to be scared now. Similar to the Lacy Peterson case. Very sad!!","post_message":"Elizabeth Sullivan appeared to have vanished two years ago without a trace."},{"comment_id":"1807011322902281","commenter_b":"In what part did she say super predators? Actually finish watching the video instead of make false accusations!!","commenter_a":"Do you guys have one recorded incident of Trump saying anything negative towards the black community like this? We have a recording of Hillary calling African-American super predators and saying to a group of black people that if they did not like what she had to say then she would just go talk to white people. @webpagelink","post_message":"BREAKING: Trump's own rental agent just told MSNBC that the Trumps told him: \"WE DON'T RENT TO N-WORDS\" Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153007024072894","commenter_b":"He dumb why have that baby get close to him if he didn't know for sure if she is his baby he should've got that done first","commenter_a":"Maury would have done it for free","post_message":"Chris Brown Files Petition to Establish Paternity of Daughter Royalty"},{"comment_id":"924961764238223","commenter_b":"Some companies are specifically recruiting unskilled migrants because they know they can get away with paying them next to nothing! Also these entrepreneurs you speak of often pay such little to their employees so they can get rich themselves!","commenter_a":"70% tax from working people to pay while we have so many lazy unemployed sitting at home seems fair","post_message":"She says injustice and inequality makes her \"as angry as the Hulk\"..."}]
