[{"comment_id":"1136350429757739","commenter_b":"She needs to excuse herself from this case.. this is a total conflict of interest!!","commenter_a":"Crooked ass administration...don't force us \"We The People \" have had enough","post_message":"What the WHAT?! This cannot stand."},{"comment_id":"10155106719593132","commenter_b":"She probably was in on it. What woman in her right mind would move in with a man whose wife mysteriously \"disappeared\" just 2 months prior? Both had to know she wasn't coming back.","commenter_a":"Girlfriend needs to be scared now. Similar to the Lacy Peterson case. Very sad!!","post_message":"Elizabeth Sullivan appeared to have vanished two years ago without a trace."},{"comment_id":"466923970098864","commenter_b":"Do not let the Muslims take over our great country with their agenda. I'd look terrible in a burka!","commenter_a":"Carson is right!!!","post_message":"A major American Muslim group says Ben Carson should drop out of the presidential race unless he apologizes for saying Muslims shouldn't be president. Do you think Carson should comply with their request? Via Opposing Views"},{"comment_id":"10154056167770329","commenter_b":"For Christ's sake lady give it a rest!!! Please get yourself fixed and do my reproduce we don't anymore people like you. And if you've already reproduced I pray for your children. Now kindly fuck off and go find someone else to annoy. Seriously anyone else. The other girl got the message why can't you??","commenter_a":"So stupid. Blackface doesn't make someone racist.","post_message":"IMPORTANT REMINDER: It's never okay to wear blackface!"},{"comment_id":"10153286881869197","commenter_b":"the mother better be caring about who next door than what on facebook the people she see everyday","commenter_a":"That not discipline that torture and making a mockery of her child in front of the world what if she cause harm to herself mom can discipline at home not on Facebook","post_message":"VIRAL VIDEO: A 13-year-old girl secretly posted racy photos to #Facebook. Check out what her mother did when she found out: @webpagelink What do you think? Too harsh... or effective punishment?"},{"comment_id":"10153707986556491","commenter_b":"Brainless sheep! I like that","commenter_a":"Fabulous, great sense of humor and brains; trump is the icon of decadence under a cheap (very cheap) speech, only brainless sheeps follow him.","post_message":"“I have built a papier-mâché wall for Mexico. It costs $17.99. Fabulous!”"},{"comment_id":"10153185971496955","commenter_b":"shoot the illegals","commenter_a":"...and they wonder why we don't trust the police...!","post_message":"California Deputies Are Taped Beating Man in Bizarre Desert Horse Chase... 'Ugly'..."}]
