[{"comment_id":"1277939352272817","commenter_b":"Its gangster in this bitch I better go before MFs pull they emojis out on my ass.","commenter_a":"Were are the white folk at? What's they excuse for this bull shit? Fucking dumbass idiots. I hope they sue the shit out of them!!!","post_message":"This bad cop narrative continues to evoke frustration. #WSHH #NYPD"},{"comment_id":"10153400467734228","commenter_b":"Why would anyone expect there are appropriate records if baby stealing was happening? Poor women!","commenter_a":"Records are only as good as your charting if it's not written down it didn't happen ! That's law never said it was a good law so a lot could have been left out","post_message":"\"You are trying to kill my character. You`re trying to lie and say I was at one hospital and you can keep up your records that good.\""},{"comment_id":"10154745395538984","commenter_b":"@username wow that's hot","commenter_a":"megan , why don't you lick hillary's ass , and ask trump about how he worships the devil in secret , like you believe , your a hack for clinton , move to cnn","post_message":"You don't see this every day. Trump's campaign manager went on \"The Kelly File\" to discuss Trump's debate tactics. Even though Megyn was on the attack, Kellyanne Conway came up with the PERFECT campaign strategy that Hillary definitely won't want to deal with. Do you think this could work?"},{"comment_id":"10152929906987377","commenter_b":"Kendal , another stupid liberal !","commenter_a":"You're OUT, Bobby..!","post_message":"Bobby Jindal is calling for tougher gun laws."},{"comment_id":"10153250160727235","commenter_b":"sue and angela, dumb bitchs","commenter_a":"I'm a gun owner and have a permit to carry. I'm also sick and tired of the gun nuts. There is absolutely no accountability on their part for the tens of thousands who die by guns every year. The NRA can kiss my ass also. Just a bunch of crazies and I'm sick of their crap. I also used to be a member. Time to grow up America and hold people accountable.","post_message":"What kind of people would be enraged because of a benefit for dead children? OH."},{"comment_id":"1655877784709346","commenter_b":"Oh god between him and Trudeau ? That's not a choice , it's a bloody disaster looking for a place to happen Are there no good political leaders in this nation It would be the Canadian version of Clinton and Trump , to be fair to her she's a lot smarter than Trudeau","commenter_a":"Funny watching all the leftards do the exact same thing they did with trump with labels and lies and thinking we won't have the same results!","post_message":"Kevin O'Leary called Justin Trudeau a \"complete incompetent.\" Read more: @webpagelink"},{"comment_id":"10158316177600725","commenter_b":"So who was the \"Grown-UP\" the past eight years? We have had the most un-American couple in the White House, so glad to see them go! (It's a shame they will still be in the country.)","commenter_a":"Definitely need a growth up and not a coward. Glad we finally will have one that fits both","post_message":"In one of her final interviews as first lady, Michelle Obama revealed just how much the election has reshaped her view of her husband's administration."}]
