[{"comment_id":"10153222485020329","commenter_b":"George Bush","commenter_a":"How come the penis got a fun name but not the vagina???? You're all Sexist Pistols.","post_message":"Urethra Franklin FTW. (A BuzzFeed BFF original.)"},{"comment_id":"10153204502459087","commenter_b":"Mar G Her go back to mexico. this country is for LEGAL immigrants who want to be Americans.","commenter_a":"Trump is for all Americans, whether you're democrat or republican. Go Trump 2016!","post_message":"GOP front-runner Donald J. Trump continues to pull away from the rest of the Republican pack, drawing 33 percent support in the latest Washington Post/ABC News poll."},{"comment_id":"10153655061641336","commenter_b":"There not illegal immigrants, they are Illegal Aliens. Death penalty for them!!","commenter_a":"Deportation or jail time is not good enough, eye for an eye. Capital punishment","post_message":"“This was not a random incident,” Sheriff Mike Chapman said at a news conference Saturday. “The suspects and the victim were known to each other.”"},{"comment_id":"10153404039272293","commenter_b":"'@username police kill blacks at a rate disproportionate to their total percentage of the population an assertion supported by The Guardian statistics. Police killed almost five black people per every million black residents of the U.S., compared with about 2 per million for both white and hispanic victims. @webpagelink","commenter_a":"Tamir was a 12 year old boy. TWELVE!!!","post_message":"'I saw the weapon in his hand coming out of his waistband,' one officer wrote in his statement. 'The threat to my partner and myself was real and active.'"},{"comment_id":"10153845645645871","commenter_b":"I would say that since both ladies are jewish and liberal, they don't really care about the women who are raped, stoned, disfigured and killed because they are Muslim. I believe ini just telling it like it is.","commenter_a":"Have any of you followed Naomi Wolf's facebook page? I have for the past couple of years. She's an anti-Israel bigot, and she ignores women's issues whenever they involved Islam. I called her out on it many times. Here's an example.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152756329021615","commenter_b":"I hope she was telling him to go home!!!","commenter_a":"For sure","post_message":"This video showing a mother slapping her son during the Baltimore riots is going viral...we're hearing what the police commissioner has to say about it now on Channel 11 Morning News.  SEE FULL VIDEO: @webpagelink LATEST: @webpagelink"},{"comment_id":"903785579812018","commenter_b":"OH BUT HE'S BLACK HE DON'T KNOW NO BETTER.SHIT HANG HIS ASS","commenter_a":"So sad","post_message":"She was shot down in cold blood and there were never any riots. This was a tragedy, and she will never be forgotten. Can we get 10,000 'LIKES' in her memory?"}]
