[{"comment_id":"10153953096951336","commenter_b":"So according to your logic @username driving home after having a few beers is equivalent to shooting a gun into a crowd of people? Am I understanding you correct? I bet you still believe Marijuana makes people go crazy.","commenter_a":"People who drink and drive should serve prison time. At least a 1to 5 year minimum . And if they kill or hurt someone while driving drunk they should serve life in prison.","post_message":"\"Social media led us straight to this suspect to stop him before he was able to hurt himself or others,\" the Franklin County Sheriff's office said."},{"comment_id":"10153132227035326","commenter_b":"great white mess","commenter_a":"White Affirmative Action.. Donald Trump- another great White Hope! Trump joins a long list of rich entitled white boys who, were it not for their daddies, handing them everything on a silver platter, would have probably ended up on public assistance. Trump represents everything that is wrong with America. He is a gaudy bully and fake gold plated braggart who has showcased his business and moral acumen through a unending series of bankruptcies and divorces. He is a racist grifter and a criminal environmental rapist. In terms of patriotism and service to country, Bush, Romney, Cheney, Trump did not serve this country that they profess to love. But none of these fake ass patriots apparently have any qualms about sending other American children into harms way. For this crowd of \"real Americans\" it's all about the Benjamins and what's in it for me. If America needs a cautionary tale as ...","post_message":""},{"comment_id":"10153834639439255","commenter_b":"Fuck her!","commenter_a":"for being called out, really !!!!!!","post_message":"How did we get so many sociopaths running for President in one year, anyway?  By Daily Kos user barskin"},{"comment_id":"10153180114156636","commenter_b":"Easy to say coming from a white man whose ancestors were the criminals. I bet if that was your ancestors murdered on a genocidal level by the NATIVE Americans, you would not be saying this. Stand out for justice, even if it's against yourself.","commenter_a":"Do your self a favor find a another date, maybe in November, with Thanksgiving...Columbus day is here to stay, and will stay; we are not about to change our History....Christopher Columbus had to vision, the world was not flat, that is why we have the Americas' North and South.","post_message":"'Far too often the contributions of indigenous peoples’ go unrecognized in our history and textbooks'"},{"comment_id":"494820657375181","commenter_b":"She needs to shut that big mouth","commenter_a":"She need s to keep her friggin mouth shut","post_message":"Michelle Obama's tries to enforce this on her hometown, but they aren't backing down.  If they can stand up to her, so should the rest of the country.  Do agree Michelle needs to be silenced?"},{"comment_id":"10154535471263812","commenter_b":"I'm a white female, and I sure as hell don't trust her","commenter_a":"\"Voters of Donald Trump are sexist idiots that rather vote for a fellow idiot than a woman\"","post_message":"Poll shows 18% of people who say they will vote for Donald J. Trump think the real estate mogul is not qualified to be president."},{"comment_id":"10154433105394087","commenter_b":"I'm an independent, but republicans are completely full of shit. And they don't mind the smell. Their platform is based on racial deportation.","commenter_a":"100% TRUTH","post_message":"\"Unless more leaders in the black church recognize that blindly supporting one party, which has done nothing to earn that support, is not benefiting those that they serve, the church will continue to lose its political influence.\""}]
