[{"comment_id":"10153392413471748","commenter_b":"Abortion is safe cause ha aint getting in","commenter_a":"Historically, once extremism takes hold, it is very, VERY difficult to put the genie back into the bottle. As long as the extremists face no serious consequences, they will just get more and more radical in their pronouncements and actions. Only when there is a very strong backlash is there any chance of them backing down, as we saw when the anti-communist witch hunts were finally contained. But religious extremism like Huckabee's is much harder to deal with (as Goldwater presciently saw), because they regard all resistance as persecution and attacks by spiritual enemies. Sadly there is a chance, even if it is small at the moment, that America will ride the tiger of extremism to disaster. And unlike Germany after WW2, there would be unlikely to be any second chances, any opportunity for redemption, because a radical, apocalyptic, theocratic USA would almost certainly initiate WW3.","post_message":"Mike Huckabee thinks that as president, he could prevent literally all abortion."},{"comment_id":"10152685223867894","commenter_b":"That Bitch Messy Asl !!","commenter_a":"Tameka Lovinglife Mccraney These Celebrity Couples And Exes Are So Messy Lol","post_message":"Naya Rivera Announces Her Pregnancy on the Same Day as Big Sean's Album Release [Photos]"},{"comment_id":"10152734015363525","commenter_b":"going to get cold tonight!!","commenter_a":"Wtf...???","post_message":"Road trip to Lakewood Ranch. Who's in?"},{"comment_id":"10153570672510667","commenter_b":"Are you kidding!? Heartbreak isn't legal punishment - she needs to be jailed!&","commenter_a":"This is horrific! My heart aches for the mother...I know they all should have had their seat belts on, but they were old enough to know this. I don't think the mother should be charged because she will relive this over and over and over and over again...it will haunt her for the rest of her life. God be with her.","post_message":"Three girls were killed and six others injured when an SUV carrying 11 people had a tire malfunction and crashed on I-95 in Titusville, Fla. @webpagelink"},{"comment_id":"995007177263648","commenter_b":"@username if you are still pro refugees after this video, I don't know what to do with you.... And this are things that are not only happening in France, but in Austria, Germany, and several other countries","commenter_a":"All you Obama haters suck!! Just another bunch of racists who want to vent there vile shit.. Any excuse.. Like yeah if your Muslim your a terrorist if your black your a mugger or rapist.. Retards!!","post_message":"Obama Doesn't Want You To See This: The Muslim Refugee Crisis in Europe"},{"comment_id":"10154427050921037","commenter_b":"Illegals do jobs that the \"Americans\" won't do!!! Besides I have never seen any white person working in the field picking your precious organic fruit and vegetables","commenter_a":"no not working and supporting their families in the states and the ones back home. here I thought they just come over and sit around doing nothing but taking naps and drinking beer. lmao this is a joke.","post_message":"The ~11 million unauthorized immigrants in America are not “taking” jobs from US citizens, either."},{"comment_id":"1137064162981260","commenter_b":"Mold on the apple","commenter_a":"Grrrrrreat. *head desk*","post_message":"A huge new study has confirmed that we are in the middle of an extinction event, the likes of which hasn't been seen since the dinosaurs went extinct."}]
