[{"comment_id":"10154648260827550","commenter_b":"That's fine! Welcome to all who want to come to America LEGALLY.","commenter_a":"Grew up in a farming family. I admired and respected the migrant workers' desire to find a better life here in the United States.","post_message":"Do you support a border wall with Mexico?"},{"comment_id":"485435508313696","commenter_b":"She is a dangerous racist!,","commenter_a":"Yes","post_message":"Oprah is going after white people on live television. The hypocrisy is overwhelming. We need to show her we're not going to stand for this. Do you agree Oprah is a racist?"},{"comment_id":"10153736495329753","commenter_b":"Yes","commenter_a":"Of course he's backing Killary. He's a libtard!","post_message":"Incarcerated hip-hop artist Bobby Shmurda has endorsed Hillary Clinton’s 2016 presidential bid. The 21-year-old leader of the Brooklyn-based GS9 crew is the latest in a string of high-profile hip-hop artists to back the Democratic front-runner, including Snoop Dogg, Pharell and Eminem. According to Shmurda, Clinton is the most suitable candidate to take over the Oval Office in November because of her “strong mind” and empathetic nature. “I’m going for Hillary, man,” he told Vibe. “I like... @webpagelink"},{"comment_id":"10154104100243132","commenter_b":"#2. he likes ugly chicks","commenter_a":"Just be happy... The beginnings are the best!","post_message":"New year, new romance for Amy Schumer!"},{"comment_id":"10154627182156509","commenter_b":"287877634908162s, as a native (Blackfoot) I encourage you to stay out of 'our' business. Immigrant......","commenter_a":"Does @username cares even a bit about Sanders? All this channel talks about is Donald Trump.","post_message":"This is the decade when Donald J. Trump thinks America was great."},{"comment_id":"10153643322467434","commenter_b":"@username, I am an actress...I can rip you apart in iambic pentameter. Words do matter and so do definitions. In order for RAPE to occur, SEX has to happen...or it is considered MOLESTATION...","commenter_a":"Wow...semantics. Yes, Brock Turner DID have sexual relations...or else he couldn't have RAPED her. Sex is kind of a requirement...the headline does NOT say \"consensual\". #GoodGrief","post_message":"Just because the law smiled upon a man who had sex with an unconscious woman behind a dumpster doesn’t mean this group of angry, armed protesters will do the same."},{"comment_id":"593997884104848","commenter_b":"God help us all...God please Bless America! No Hillary!!!","commenter_a":".......President means MAN! .amen.","post_message":"Nancy Pelosi said confidently today that Hillary Clinton will be the next president of the United States. Do you hope she's right?"}]
