[{"comment_id":"10154566603193645","commenter_b":"Most murders in US is commited by non Immigrant. Sandy Hook was by a mentally unstable person. Charleston commited by a Rasist unrepentant kkk inspite of the grace afforded him by the people he killed and their families. Florida commited by mentally unstable guy. The guns remain a major problem . Why is there no Presidential order banning guns. No NRA sponsored their election. Why ban muslims but allow christians. A a Christian myself I see this as very wrong. Saudi Arabia had 15 of the 19 killers of 911. Why is Saudi Arabia not included. Something is not right . I am Proud of the brilliant Judges. No one is above the Law.","commenter_a":"They should be thrown out and replaced. They can run for a political office if they want to push a political agenda","post_message":"BREAKING: A 3-judge panel just unanimously ruled against reinstating Trump's Muslim travel order. Do you support or oppose the court's ruling?"},{"comment_id":"10153616192149342","commenter_b":"I can count the ppl, I can really count on on 1 hand.... With fingers to spare for a hot chick!","commenter_a":"Some of your \"real friends\" don't either. js","post_message":"How's your Facebook friend list?  #abc13"},{"comment_id":"967810213254438","commenter_b":"Phony bitch","commenter_a":"Good new Ian you can now give blood from your arm instead of your B-hole. Joe Mark and @username can give you a ride","post_message":"There's still a lot of controversy around this."},{"comment_id":"10156487496090615","commenter_b":"Give it up, David. If they'd vote for someone who votes for war, flip flops on the Keystone pipeline, takes money from Wall Street, and until very recently did not support marriage equality, I don't think they're interested in the truth. They'd rather just take their half truths and stir up crap, just like the candidate they support.","commenter_a":"So many Bernie fans complained that not enough debates were scheduled before the primaries. Now Bernie refuses to debate when the other two candidates are willing. Yet another reason I'll be voting for Hillary.","post_message":""},{"comment_id":"10154343776387061","commenter_b":"@username , just wait till he is done,The Republican Party!","commenter_a":"He was a great president, didn't help republicans but republicans don't help democrats. I'd like it if people met in the middle more rather than so far right or left. Obama is professional, polite, and articulate none of that fits Trump. And now that the new Trumpism is \"Alternative Facts,\" I am concerned.","post_message":"A look inside the Washington, D.C. residence the Obamas are moving to: @webpagelink"},{"comment_id":"10158911278605206","commenter_b":"@username, would you feel that way too if you were on an airplane and didn't like the pilot? According to you lilies Trump will destroy America. You might want to hold off on purchasing any party supplies. According to you dandelion's Putin will take over America because of Trump. You daffodils won't be allowed to throw any party's if that's true...","commenter_a":"The world deserves Donald Trump. No doubt about it.","post_message":""},{"comment_id":"10155938644580354","commenter_b":"OF COURSE NOT! Did anyone actually think these weasels with their blood money in their pockets would do anyting to regulate Planned Parenthood? LOLOLOLOL Fell off the dumb truck, did ya?","commenter_a":"Go back to work useless bastards","post_message":"GOP consultants who hate the grassroots--and their values--continually boast about the historic majority they won in the House, purely by their own DC insider wisdom.  But if these are the best results we can get from that majority, what have they actually accomplished?"}]
