[{"comment_id":"10153730746224087","commenter_b":"She oozes EVIL!","commenter_a":"He is right, nobody would accept this corruption if it was another man versus Bernie Sanders","post_message":"'It’s not sexist. It’s true,” Donald J. Trump said, repeating comments he made Tuesday about Hillary Clinton. “If she were a man, she’d get less than 5 percent.”"},{"comment_id":"1702718559987828","commenter_b":"Vote Trump & #MakeAmericaHateAgain","commenter_a":"Enjoyed seeing everyone and the interaction. Refreshing to see and will support Trump all the way. Vote Trump and let's Make America Great!!","post_message":"GOOD MORNING! If you missed last nights #TrumpFamily Town Hall on CNN with Anderson Cooper- you can watch the full version here! My family and I had a wonderful time. Enjoy!"},{"comment_id":"1824334044515363","commenter_b":"She won't do anything","commenter_a":"Undocumented immigrants pay more taxes than Donald Trump plus a lot of them bring fresh vegetable and cheap food to american tables.. Hillary President !!","post_message":"Donald J. Trump on immigration during final presidential #debate: 'We have some bad hombres' @webpagelink"},{"comment_id":"853572084739045","commenter_b":"Lol! Wow!","commenter_a":"I agrees with the Judge! Come here by the proper channels! WTH","post_message":"Here's a breakdown of what the immigration ruling means."},{"comment_id":"465186890273018","commenter_b":"This....this is brilliant lol","commenter_a":"No this nation was bast of God an build around it get it right dumbass","post_message":"The Anti-Media radio show is live at NOW! Listen from your computer or phone here: www.UCY.tv/TAMR  Call in and join the conversation: 1-718-717-8296  via Murica Today"},{"comment_id":"10150659306454999","commenter_b":"'@username ..her lips not legs","commenter_a":"She is right, raising your arms doesn't mean a lot. Her getting multiple corporate donations to sway the way she passes bills does. U.S. Senator Bernie Sanders pointing out that every other politician does the same thing, and he is attempting to change the precedent does. What a lame attack from Clinton. This just made my opinion of her lower, not raise.","post_message":"Hillary Clinton also said that the candidacy of Donald J. Trump was a 'bad development for our American political system.'"},{"comment_id":"10158325140525725","commenter_b":"Yea !! Thank god that I wouldn't waist my time on those losers !!","commenter_a":"If they gave them to me I wouldn't go !!","post_message":"Looking to get out of last-minute Christmas shopping or away from your in-laws? Then Saturday's Chicago Bears home finale could be your answer."}]
