[{"comment_id":"1023820500989519","commenter_b":"Ask Planned Parenthood to pay for it - Bitch.","commenter_a":"There are enough uber wealthy Dems to pay this. Why not hit up Oprah? This is spare change for Holliwood.","post_message":""},{"comment_id":"10152694220270736","commenter_b":"She doesn't have a soul.","commenter_a":"I'll be dead because of you then crashing sounds pretty intentional to me. How this person can even consider entertaining not guilty is beyond me. May the terror and the guilt of this tragedy eat her soul.","post_message":""},{"comment_id":"10154262416956037","commenter_b":"Remember if you need some hot sauce Hilbilary carries it in her purse!","commenter_a":"Why? So this is the type of journalism Yahoo gives us after laying off 25% of their staff?","post_message":"Yahoo News reporter Hunter Walker is heading to the Trump Tower Grill for a Facebook live stream to get reaction to Donald J. Trump's Cinco de Mayo fiesta. Tune in soon ..."},{"comment_id":"10154682808296037","commenter_b":"@username. We don't need male genitalia to be smarter than you. Go run along and play, now.","commenter_a":"In his hand against his thigh. Plain as day. Please save and share for the ignorant.","post_message":"Charlotte police release body camera and dashboard videos of fatal shooting of Keith Lamont Scott."},{"comment_id":"10153809969273984","commenter_b":"Keep the apology. Fire her.","commenter_a":"Professors are the most ignorant people out there","post_message":"Unbelievable. The left is always calling conservatives bigots, meanwhile they're saying things like this? Should this professor apologize?"},{"comment_id":"1062292093806211","commenter_b":"DON'T NEED ANOTHER BILL CLINTON","commenter_a":"Lol! Trumps hands are not looking so small now. Hehehe","post_message":"Breaking News!"},{"comment_id":"1701200686777335","commenter_b":"Gun laws will not effect non-American \"Crazy\" residents taking advantage of our Freedoms.","commenter_a":"What do you think the USA has done all over the planet.....we have bombed and killed thousands upon thousands of innocents and we are the victims? I think not","post_message":"“They want to blow up our country. They want to blow up our cities. They want to knock down our buildings, and [Pres. Barack Obama’s] worried about global warming. We have somebody that’s not in touch.” – Donald J. Trump"}]
