[{"comment_id":"10153833449353145","commenter_b":"Ignorant uniformed woman!","commenter_a":"Totally stupid. It's an illegal drug! Small amounts lead to large amounts. Bad enough there is a jerky a.. Attorney who is trying to legalize marijuana in Orlando. Get a grip. Bad enough this state is number one in the country with the worst drug problem!!","post_message":"This would be a major change in Orlando, but is it a step in the right direction or should leaders nip this in the bud? Let us know what you think."},{"comment_id":"1011692715642632","commenter_b":"My family has been here for 10 generations and I voted for. Hillary. So stfu you hateful witch.","commenter_a":"I had 4 grandparents all born in America. I did NOY vote Trump!","post_message":"Fact check!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10156048486720389","commenter_b":"Anyone is smarter than she is!","commenter_a":"YES!!! She knowingly wiped her server clean or had someone way smarter than her...do it for her!!!!","post_message":"Question of the Day: Do you think Hillary Clinton knowingly wiped her server clean?"},{"comment_id":"10153715291715950","commenter_b":"Sorry Sara Sterling you wouldn't know the NRA from a CPA. Guns were here before you and they'll be here long after you. They can pass all the unconstitutional laws they want the gun owners will not comply. If you don't like it well then your free to pack your sh*t and leave there isn't anybody forcing you to stay here. The earth is huge...","commenter_a":"CBS once again reaching with their BS agenda! Why don't you report how gun sales are at a record high? Obama is the best gun salesmen ever. If a government ever tells you to disarm yourself you need to arm yourself!","post_message":"This brother shares the story of his family's tragic trip to a gun range."},{"comment_id":"10153799327541336","commenter_b":"He was not hitting her I hope.she spends years in jail,she could have killed that officer","commenter_a":"Got Her.","post_message":"A woman used her car as a weapon and knocked over an Auburn Hills police officer to flee a traffic stop. Breianna Smart was caught and arrested."},{"comment_id":"10156032956110500","commenter_b":"I got pulled over last night for four miles an hour over the speed limit and my license plate light out. I was courteous to the officer and he to me. In the end I simply got a warning from and a thank you for my courtesy towards him. I told him thanks for only a warning and for letting me know the light was out cuz I really didn't know it was. Common decency goes a long way. That woman is lucky she didn't get taken to jail for the speeding infraction. Hope she tries to challenge the ticket in court and that video gets played","commenter_a":"think she was black is what I think","post_message":"SAY WHAT? You might find it hard to believe what a driver said to a Palm Beach County Sheriff's Office deputy.  WATCH VIDEO-> 8.wfla.com/1FylO8y  What do you think of the woman's comment to the deputy?"},{"comment_id":"1128755127223092","commenter_b":"They are stopping them by firing these loose mouth bigots.","commenter_a":"Now employers can terminate employees for not having the same politics and ideological dogma as their bosses. The Radical Left is destroying America. They must be stopped.","post_message":"“She has expressed values that are at odds with ours and she has compromised her ability to meet the teaching and patient care mission of the School of Medicine.”"}]
