[{"comment_id":"10153891729051680","commenter_b":"While Melania was pregnant.","commenter_a":"Right, because he was just a young, naïve, 59-year-old predator.","post_message":"Donald Trump released a video statement apologizing for his sexually aggressive comments about women, saying the words caught on tape in 2005 do not regret who he is."},{"comment_id":"1796926360545603","commenter_b":"I well tell you some thing... The isis was made by usa","commenter_a":"Vote Trump. .... what's the matter killary fans u guys worried. ... U should be","post_message":"We are going to get rid of ISIS! America needs real leadership. #MakeAmericaSafeAgain"},{"comment_id":"836575966473062","commenter_b":"Crooked Hillary is the scum of the Earth","commenter_a":"His campaign is a trainwreck.","post_message":"Meet Trump's new campaign chief: a man whose \"news\" organization, Breitbart, is known for its racist, homophobic, conspiracy-peddling stories."},{"comment_id":"1063012123817862","commenter_b":"It is under God not no damn allah you ignorant muslim cocksuckers. If you dont like our country,our anthem, our flag,and our laws then by all means get the fuck out and take the clintons and obamas with you","commenter_a":"WTF","post_message":"THIS IS THE UNITED STATES OF AMERICA! Our country was founded on Christian principles. 'LIKE' if you think this is wrong!"},{"comment_id":"10153500455846336","commenter_b":"Mr Rubio: While it might be nice to possess 'class\", we don't need \"class\" as much as we need a \"leader\" who has the nerve to say what's on everyone's mind and then do something. It remains to be seen if he can get past the nefarious \"electoral college\" that elects the president no matter what the \"popular\" \"people's\" vote is.","commenter_a":"how about instead of commenting on another persons comments you actually tell us how you are going to fix all the crap wrong with our government, waste and abuse of tax payer dollars, so how are you any better??? so tried of you all","post_message":"Sen. Marco Rubio addressed immigration and Donald J. Trump's controversial comments. @webpagelink (via Fox & Friends)"},{"comment_id":"457572411058203","commenter_b":"I hate that vile bitch. Dumbest wokman on the planet.","commenter_a":"Sarah and her offspring are all a blight on humanity and whatnot, but the dog doesn't seem bothered. That said I still wouldn't stand on a dog..","post_message":"Just when you thought Sarah Palin couldn't sink any lower, this happens. If this woman can't teach her own kids to have respect for animals, she has no business even thinking about running for anything in 2016.  ~Darrell"},{"comment_id":"1176004315773372","commenter_b":"And make Texas pay for the wall","commenter_a":"I think we should just let all the gun nuts go to Texas and secede from the Union. They already have their own power grid, so we could build a bullet proof wall around the state and let them shoot all they want.","post_message":"Nugent's response to the San Bernardino shooting is to call for a new American civil war."}]
