[{"comment_id":"10150772965449999","commenter_b":"She's going to wear the same shoes every day forever? What if her feet keep changing?","commenter_a":"If you paid $1000 for shoes you will have the rest of your life, you got a bargain. If you hadn't you would have spent more on shoes that didn't fit, hurt, were too high, and you wouldn't wear them. Not extravagant at all; I would say it was smart shopping.","post_message":"\"I know I am going to take a lot of heat for what I am about to tell you, but I just spent almost $1,000 for a pair of custom shoes.\""},{"comment_id":"1343052442401891","commenter_b":"@username She also stated that she was going to get her 'presidential kneepads' Brenda. She knew exactly what she was doing! So, get over it already. Trump has cheated on both previous wives, and is now with the scary looking mrs strumpit.","commenter_a":"I love watching Bill do things like that. he's so good at it","post_message":"Because it's fun to watch them squirm."},{"comment_id":"10152894841766636","commenter_b":"So they should ! Sex with a drunken person should never happen !","commenter_a":"It's funny, you could have had drunken sex over there without fear of prosecution. But if that new law comes in over here in the UK? A guy potentially could be charged with rape even though it was consensual at the time?!","post_message":"RIP Shagaluf."},{"comment_id":"10153196800261051","commenter_b":"Shut up you bitch! !","commenter_a":"I thought for sure she would want to be a Ferguson protester!","post_message":"Michelle Obama was asked a simple question: If you could have any other job in the world, what would it be? Here's her response."},{"comment_id":"566760130115693","commenter_b":"lol women are objectifying themselves! they love the attention! women are one the most hypocrite creatures in the world!","commenter_a":"Females are excepting this behavior. It goes both ways..","post_message":"The #WomenNotObjects campaign wants advertisers to know that consumers are fed up with how females are portrayed in the media."},{"comment_id":"960936923986215","commenter_b":"She is loud!!! Trump!!!","commenter_a":"Now I'm really confused, Trump is not the true conservative, and I thought Palin was.","post_message":"Sarah Palin is ready for someone who can take down ISIS and #MakeAmericaGreatAgain- are you?"},{"comment_id":"10154985893890629","commenter_b":"@username Now he blamed \"fake news\" again. Only this time it was real \"fake news\".","commenter_a":"Our president is making speeches based on something he says he heard on Fox News? OMG, he has access to 1st hand intelligent briefings and he's getting his information from the news? What in the world is even happening?","post_message":"President Trump said he cited a nonexistent terrorism incident in Sweden as a reason for his travel ban after he saw a segment about immigration in the country on Fox News."}]
