[{"comment_id":"10154427870651491","commenter_b":"She was deported because she is a felon!!","commenter_a":"Now if only the Native Americans could some how deport the illegal descendants who settled in America and forcibly stole their tribal lands in violation of Native American law, because that would be poetic justice.","post_message":"She inspired protests in Phoenix, Arizona when she was detained on Wednesday."},{"comment_id":"10153955448341350","commenter_b":"She's a cold, calculating bitch.","commenter_a":"From her big warm embracing feminine heart ... are you kidding me? Voting for Hillary because she is a woman, makes no sense at all.","post_message":"\"I want my president of the United States to make decisions on my behalf based on her experience, her command, her intelligence, and from her big, warm, embracing, feminine heart.\""},{"comment_id":"10153597569599411","commenter_b":"@Zoran...again, you get a life...we are pretty happy and fine. Not like a poor illegal immigrants as Zoran trying to stay in the west....","commenter_a":"No one should feed barbarian Russian junta fascism invaders.","post_message":""},{"comment_id":"985326574853829","commenter_b":"Girlfriend you are out of your simple, bigoted, tea bagging mind! Go crawl back under your rock...","commenter_a":"No senator. No SCOUS nominations from this America-hating muslim currently in residence at our White House. No. Never.","post_message":"Today I stood with U.S. Senator Chris Coons in Philadelphia to call on Republicans to do their job and give fair consideration to Chief Judge Merrick Garland. Their obstruction is inconsistent with our duty as senators and bad for our judiciary."},{"comment_id":"464203950436852","commenter_b":"No way. Let the Muslims get over it. If you don't like it here go back where you came from.","commenter_a":"We should shoot them with bullets dipped in bacon!","post_message":"Should The Words 'Bacon', 'Pork', 'Sausage' Be Banned? Comment 'yes' or 'no'."},{"comment_id":"695871927257910","commenter_b":"Josiah Meek","commenter_a":"Laurie Fink","post_message":"DESK GOALS. @webpagelink"},{"comment_id":"1113874841966859","commenter_b":"Beck, that British English is English English, as in the correct way to speak ENGLISH. ;)","commenter_a":"I’m with everyone else, “Learnt”?","post_message":"How many of these were you taught?"}]
