[{"comment_id":"833696443343651","commenter_b":"What a sick statement, what a horrible woman!","commenter_a":"Hillary Clinton was awarded the Margaret Sanger award for her abortion stance.","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"1073538729332546","commenter_b":"Terri must not have kids to make a statement like she or he made. Shame on you putting the blame on the mother.","commenter_a":"School needs to be held accountable and the bus driver for forcing her off. This can never happen to another child. They are lucky the right person found this child and returned her.","post_message":"A #Seattle bus driver is now off his route --- after a 7-year-old was found wandering Capitol Hill, crying. >> kiro.tv/WrongStop"},{"comment_id":"10153939512524087","commenter_b":"@username .... Why would anyone vote for Hilary the war monger ? She stands for nothing that benefits American citizens... all she talks about is illegals and bringing in Muslims... blacks are totally used by her.... She dumps illegals in poor black communities... but will never have Muslims or illegals where she and her friends live.... people like you are a joke.. total fools.. and Trump is not a racist stick that card up your asss... its old used outdated game...","commenter_a":"After Trump loses in the election I wonder what's next for Republicans. Atleast he brung out the closest racist and exposed the Republican party for what it is","post_message":"Prominent Donald J. Trump critic GOP Sen. Jeff Flake had kind words to say about Trump following last night's nomination speech at the Republican convention."},{"comment_id":"1247857341977182","commenter_b":"The radical Christians in this country would throw gays off of rooftops too if they wouldn't go to jail for it. If you think that's wrong read the comments on any article about them.","commenter_a":"Now all the Christians will throw the pope under the bus for stating the obvious","post_message":"\"It's like a mixed fruit salad. There is a bit of everything. There are violent people in all religions,\" Pope Francis said."},{"comment_id":"817253511741162","commenter_b":"@username she isn't running. Stupid! Trump's wife is a ditzy bimbo... Not relevant.","commenter_a":"Hello!!! The Liberals are the ones voting for him. He is a danger to our country. I know many Conservatives who feel the same way about this democrat posing as a republican. Don't be stupid with your vote. The Liberals will still want to leave over Cruz being elected. Why not go that route? Or change your page to the Comical Former Conservative.","post_message":"Rosie and Whoopi too......one can dream..."},{"comment_id":"10152608851681636","commenter_b":"we need freedom from jews.","commenter_a":"Mocking the prophet of as violent cult is different to mocking the deaths of 6 million people.","post_message":""},{"comment_id":"1662312500687681","commenter_b":"She can leave now!","commenter_a":"Thats the best news I've heard all day. !","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"}]
