[{"comment_id":"10154521011917098","commenter_b":"You a hoe","commenter_a":"Hahahahaha trying to get his dick wet but caught a case of the zzzzzzz","post_message":"#HEARTBREAKING: When police arrived, they found the 17-year-old dead in the foyer."},{"comment_id":"10154001365909497","commenter_b":"There are plenty of nice average looking women that \"nice\" average looking guys ignore because they chase hot chicks. It works both ways.","commenter_a":"Local man who would be good provider for area woman`s kid friendzoned while area woman dates unemployed band members. Area woman complains about lack of good men.","post_message":"\"If they find a cure for Zika tomorrow, it not like I can afford to get pregnant under my current insurance plan.\""},{"comment_id":"536178543246730","commenter_b":"Meg Whitman is a disgrace and a lousy CEO.Bitch needs to shut the hell up.","commenter_a":"She's a fool","post_message":"SICK & SHAMEFUL"},{"comment_id":"1016134698454262","commenter_b":"She'll just speak to someone else. Challenge her!","commenter_a":"I hate Hopkins as much or more than they do. But this behaviour is just babyish. If you want to defeat her, debate her with facts and the moral superiority of your argument. This is just forfeiting the chair to a racist moron.","post_message":"Brunel students just gave us all a masterclass in how to deal with Hopkins"},{"comment_id":"1131317030222640","commenter_b":"Nice trolling bitch.","commenter_a":"If I want my kids taught fairy tales I will send them to church. As a Louisiana resident this does not come as a surprise.","post_message":"This is appalling."},{"comment_id":"1066828243360262","commenter_b":"I agree Diane..... but she is NO Lady!","commenter_a":"are you kidding me lady,Do you not get that Obama started this whole thing between races.there shouldn't be black or white there should be strictly American.","post_message":"VIDEO: Cokie Roberts has apparently gone completely insane."},{"comment_id":"10155076076173987","commenter_b":"You do realize refugees are the ones fleeing the terrorists right?","commenter_a":"Well, Starbucks, you give 10,000 refugees easy access to kill 10,000 veterans. Yeah, great plan.","post_message":"“To those who would suggest Starbucks is not committed to hiring veterans, we are here to say: check your facts,\" the Starbucks Armed Forces Network wrote in a letter to customers."}]
