[{"comment_id":"1359940970684036","commenter_b":"wish they would lock her up and throw away the key.","commenter_a":"That Lady makes 18 million maybe she could give up some of her salary for the poor kids that need pen to not die...something wrong with this.","post_message":"UK's price: $69 Germany's price: $218 America's price: $600"},{"comment_id":"10152977510376130","commenter_b":"Shut up meg","commenter_a":"I know what the show is about!!","post_message":""},{"comment_id":"1244441208928501","commenter_b":"@username, women can't do anything they want to men. Are you saying that because you can't get laid, you should be allowed to kick a woman down the stairs?","commenter_a":"There's no excuse for this. No, none whatsoever. #MisogynySucks #EndViolenceTowardsWomen #TreatHerKindly #TreatHerWithDignity #TreatHerWithRespect Only a #Caveman would do that.","post_message":"A man in Berlin kicked an unsuspecting woman from behind, sending her flying down the stairs."},{"comment_id":"10152672442592169","commenter_b":"she works my nerves! MAKE HER STOP!!!","commenter_a":"mismatch, think that Mary and He should get together","post_message":"New Downton Abbey video -- do you think Branson and Bunting should be together? The cast give their thoughts. (A new episode airs Sunday at 9/8c on MASTERPIECE | PBS (Masterpiece Theatre))"},{"comment_id":"620704854748480","commenter_b":"agree","commenter_a":"Agree","post_message":"Enough said."},{"comment_id":"678910242299554","commenter_b":"She needs to ban herself and all the other idiots","commenter_a":"She has no authority to actually ban anything.","post_message":"You'll never believe what Michelle is trying to ban now... Ridiculous. She has no right and no authority to do this. Should we kick Michelle out of the White House?"},{"comment_id":"10153354540679087","commenter_b":"U PEOPLE NEED TO WAKE THE FUCK UP","commenter_a":"Let's see how far his numbers drop when people realize that there will not be 100 Black Leaders endorsing him on Monday!!! They are pisses about that whopper of a lie!!","post_message":"Donald J. Trump claimed future generations are “going to know about Barack Hussein Obama” when they look back at today’s financial problems. “They're going to be thinking about, 'Obama really blew it.'\""}]
