[{"comment_id":"10154473534223812","commenter_b":"@username a female misogynist is what you are","commenter_a":"there are many good women in politics - not Hillary or Elizabeth Warren however.","post_message":"JUST IN: Elizabeth Warren endorses Hillary Clinton for president. Clinton is not ruling out the prospect of having her on her ticket as vice president."},{"comment_id":"866625743399544","commenter_b":"Shut up you dumb f*** spread your poison somewhere else","commenter_a":"Ever wonder why it is that for two millenia Christians and then Moslems have pillaged, raped and murdered millions of people in the name of God? Ever wondered why Christians and Moslems, both claiming to own the truth, have no qualms about trying to force others to believe as they do? Holiness is not spread by force, and people that attempt to do so are not holy. Jesus was not a prophet. He was a religious Jew and political activist who was against Roman rule and the political establishment that existed in Judea. Years later his followers rewrote history and invented a religion. Christianity is not divine and it is therefore falsehood. Mohammed was not a prophet. He attempted to gain a following among the Jews, but when he failed he became violent. Mohammed, like his followers, was a murderer, a thief and apparently psycholigically impaired. Islam is not divine ...","post_message":"ISLAMO-REALISM: ISIS Defends Burning Jordanian Pilot: Mohammed Burned People Alive, We  The Footsteps Of Allah Messenger  @webpagelink"},{"comment_id":"944012942300794","commenter_b":"I definitely would pitch in for her ticket BACK to HER country. If she said this crap in HER country, she'd have her tongue cut out or be-headed, or better yet killed . Get the blank blank outta MY country. Thank you to all our service men who give their lives for OUR COUNTRY.......","commenter_a":"Don't like it leave !!!!","post_message":"A Muslim woman confronted a female cashier about her flag pin... What happened next is going VIRAL!"},{"comment_id":"10155254328488690","commenter_b":"ALL THOSE WOMEN AND THEIR HUSBAND ARE ALL TERRORIST ..THEY SHOULD HELP THEM SELF'S AND SOLVE THEIR PROBLEMS NOTING ONE CAN DO TO STOP THEM FROM DOING EVIL IS INBORN IN THEM ....THEY ARE BORN WITH EVIL AND GROW UP WITH EVIL SO LET THEM PAY FOR THEIR EVILS","commenter_a":"Is today that you learned to join in hand to fight boko haram... What kind of leaders are you... You waste much time and innocent people lost their lives... The same thing happens in Libya president was been killed. Non of African leaders contribute a trip to help him... Everything UN and we gain nothing... Africa let's stand for our own... Bob Marley was a mixed blood yet he loves Africans and fight for you throughout his musical... Africa unit...","post_message":"\"The governments of Cameroon, Chad, Niger and Nigeria engaged in fighting against Boko Haram must take seriously their responsibilities to protect civilians.\"  - Winnie Byanyima & Jan Egeland"},{"comment_id":"10158544268330713","commenter_b":"Well she is a devil whore.","commenter_a":"I would have paid her to wear it if it have covered that ugly face...","post_message":"Progressives hate capitalism, except when they don't."},{"comment_id":"10153478899444342","commenter_b":"Liberals are actually MURDERING people with their stance. The liberals are the real murderers. Did I say that ENOUGH? @webpagelink","commenter_a":"I am not a veteran. These are Christopher's words Christopher Allard 23 hrs · Edited · I don't typically go on rants or express my political beliefs here, but I just have to get this off my mind. As some of you know, I'm active duty Army. Aside from that, I am a medic. I've spent 3 years of my life overseas in both Afghanistan and Iraq. I've seen some pretty atrocious sites caused by war, from both sides. I've picked up blown up body parts of friends and I've saved the lives of guys who were trying to kill me and my guys right before I was keeping them from their 72 virgins or whatever they believe awaits them on the other side. Here is an unbiased truthful view to the Syrian refugee situation. My first deployment to Iraq, in 2006, my unit voluntarily ran a childrens burn clinic ...","post_message":"President Obama is vowing to veto a bill from House Republicans that would increase screening for Syrian and Iraqi refugees before they enter the United States. #abc13"},{"comment_id":"1088733604470282","commenter_b":"If these teachers are not immediately fired, you can assume that there is something pretty sinister going on at that school. And just where are they getting their lesson plans, and who is allowing this?","commenter_a":"Muslims are the fastest growing bloc of Immigrants published by the Center for Immigration Studies. Also another study by American Community Survey (ACS) finds that foreign-born population in the U.S. hit a new record high 42.4 million in July 2014. Since 2008-2013, according to (ORR) Office of Refugee Resettlement, U.S. has admitted 115,617' Refugees from the Middle East and granted another 10,026 asylum. Granted Green Cards to 308,805 immigrants from the Middle Eastern countries identified by ORR as Refugee Nations making them lawful Permanent resident (LPR`s) eligible for citizenship in [5] years and petition their family members to come to the U.S.. Middle Eastern Refugees are immediately eligible for Public benefits -to the U.S. particularly the Syrian Refugees. ORR defines asylaes from the Middle East as being: Afghanistan, Iran, Iraq, Jordan, Kuwait, Lebanon, Saudi Arabia, Turkey and Yemen. As of 2013, top ten Countries for admission to the U.S. were ...","post_message":"Middle school instructs students to create ISIS propaganda"}]
