[{"comment_id":"905881252841461","commenter_b":"Frigging Brainless Teabaggers!","commenter_a":"Wait, he's flying to Florida with all that has to travel with the president to give a speech about Earth Day? Wouldn't it be better to do it from Washington via satellite and NOT burn all that fuel getting there?","post_message":"With special guest Bill Nye the Science Guy! #EarthDay"},{"comment_id":"10153361519746813","commenter_b":"That's the point. You said it yourself. Men have been using the men's room and women have been using the ladies room without an issue since forever without any problems. My point is that the law allows for men to use the ladies room and women to use the men's room, that is the basis of this law.","commenter_a":"I want to know why this is such a 'hateful' law. The 'party of science' is arguing against a law that basically says 'You know this restroom that's for boys/men? Only boys/men can use it. You know this bathroom that's for girls/women? It's only for girls/women'. So you think if women feel uncomfortable that a man that says 'Hey, I feel like a woman' goes into a woman's locker room must hate LGBT people? Really? It's not the trans people I'm concerned about. It's the people POSING as trans people. Why should women be made to feel uncomfortable just so a man that thinks he's a woman can use the women's restroom/bathroom? Wanting people to use the bathroom of the sex they were BORN with (and actually STILL are, as science dictates) does NOT = hate.","post_message":"After nationwide outcry about North Carolina's harmful anti-LGBT law, Gov. McCrory said let's 'work on solutions that will make this bill better' because NC is 'a state of inclusiveness, openness and diversity.' Let’s make it clear - that means REPEAL HB2. Keep the pressure on. Add your name: @webpagelink"},{"comment_id":"1703915029828450","commenter_b":"Mitt you looking for your10 mintues of fame????.... you lost get over it.....How can you allohw a Party to say mine and millions of people vo te don't count.....????..we don't like Rubio.and by the way llook hard in Flordia about his pass!!! we don't like Ted Cruz.. which i think thie Chistian voter shows that... Donald Trump for President 2016 has grown your Party... I am 60yrs old i have been a Dem all my adult life.. this year,, i changed to Rep Party....to vote for Donald Trump for President 2016... and now it doesn't matter?? because the GOP says so.... pure Goverment !!! trying to hold on to there ways the hell wi th the people e.... ok i you keep your crap up.. just won't vote.....and we can have another 4 years of Obama... and i am sure i am not a lone on this....th an you have ...","commenter_a":"And I put a hundred hours and a lot of cash working for Romney. A RINO at heart and a man that can't close the deal.","post_message":"Donald J. Trump responded to Mitt Romney, calling him 'one of the dumbest and worst candidates in the history of Republican politics.'"},{"comment_id":"560619820771155","commenter_b":"Happy Thanksgiving Dr. Carson and family!","commenter_a":"God bless and keep you both always,many more Thanksgiving to share our blessings.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154793363900575","commenter_b":"Fucking right a wall","commenter_a":"You have a wall? Why you so upset ?","post_message":"THE WALL JUST GOT 10 FEET TALLER..."},{"comment_id":"10156887460220093","commenter_b":"'@username @webpagelink","commenter_a":"Trump is a die hard Liberal","post_message":", I lived in New York City and Manhattan all my life, okay? So, you know, my views are a little bit different than if I lived in Iowa, perhaps. -- Donald J. Trump"},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"'@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. 'We hope and pray the U.S. Coast Guard is able to bring Samantha home.' @webpagelink"}]
