[{"comment_id":"1796145143964177","commenter_b":"If this one was another girl we would probably try one more time and call it quits bc three is the most I could possibly handle EVER. I'm still iffy on having a third bc I can't possibly handle another Jacey lmao she crazy","commenter_a":"@username at least we got lucky","post_message":"A Brazilian couple has 13 sons and won't stop having kids until they have a girl."},{"comment_id":"1009473349173573","commenter_b":"This woman is an idiot.","commenter_a":"#ArrestHillary #NeverHillary #GladlyPayforHillaryInJail","post_message":"FBI Federal Bureau of Investigation Director James Comey testifies on Hillary Clinton Email Investigation before House Oversight Committee. Complete video here: @webpagelink"},{"comment_id":"10155083954441509","commenter_b":"Bernie sanders , Hillary Clinton,barrack Obama , Set out a bobber in the middle of a HUGE democratic lake , And caught a HUGE amount of sucker fish from the Bernie Campaign, just to find out it was a catch and release campaign ! \"Awesome\" Hand the election to Donald J Trump , Cause it's over for the Democrats Thanks Bernie","commenter_a":"HIllary Rodham Clinton is going to be the 45th~! Putin is manipulating the US presidential election as the De Facto Master manipulator behind Wikileaks- exclusively for his Neo-colonial ambitions. Under Trump's erratic, contradictory rhetoric there is disregard for the 1945 Yalta/1949 Armistice Agreements Border Treaties. A new deal with Putin will re-allocate all former USSR-European domains unless they contribute a \"protection-fee\" Mafia-Culture, upsetting the political/ climate balance of the entire planet;-)","post_message":"Protesters chanting “No TPP” disrupt Representative Elijah E. Cummings' speech at the Democratic National Convention in Philadelphia. @webpagelink #DemsInPhilly"},{"comment_id":"555638054626774","commenter_b":"monkey bitch","commenter_a":"Seriously? Get a life! This is none of your concern....","post_message":"After this Obama staffer quit, he leaked something disturbing secret about Michelle. This is a joke. She needs to be kicked out of the White House. Do you agree Michelle Obama is a disgrace?"},{"comment_id":"1159474340740147","commenter_b":"we don't give flyin fk what she does lmfbo she is a pig an evil ugly witch","commenter_a":"Donald Trump CNN just reported you declined an invitation to speak at the NAACP convention. Are you nuts? Hillary accepted, you declined. All I hear about is how hillary is sensitive to the American people and even though she is a liar, there are a whole lot of American people that believe her. Right now I hear her speaking in a calm mature voice how this country is divided. Wow is she tearing your character completely apart. It's all about you she is saying. All this is about you. I got to tell you Trump old man, she is using every lying skill she has to make you look bad. Real bad. A bad guy. Yeah a real bad guy.","post_message":"I agree! Lets MAKE AMERICA GREAT AGAIN...VOTE FOR TRUMP! Thank you for your support- it means the world! DJT"},{"comment_id":"10153831793476438","commenter_b":"Celine O'Hara maybe you are the one biggest fucking idiot !!!","commenter_a":"After he was done introducing Trump, I fully expected Trump to say to him, \"Now shut up and go home.\"","post_message":"Will somebody please help Chris Christie? Seriously: Is this a hostage situation? @webpagelink Christie does not seem to enjoy serving as Donald Trump’s hype man. Like, not at all. Do you see any hint of joy as he introduces Trump at his press conference in Palm Beach tonight? This is a hostage who is reading a statement with a gun pressed to his back."},{"comment_id":"1341308765907356","commenter_b":"Al Franken was a terrible comedian and an even worse senator. What a worthless piece of crap!","commenter_a":"Ouch!","post_message":"Stuart Smalley never had a chance."}]
