[{"comment_id":"10153686038898984","commenter_b":"DO NOT PASS GO....DO NOT COLLECT ANY MORE OF OUR MONEY......GO DIRECTLY TO JAIL....GITMO.......HOPEFULLY....barack HUSSEIN ......WILL FOLLOW !!!!","commenter_a":"YES!","post_message":"Wow. It looks like winning the presidency is about to become the last thing on Hillary's mind... Do you think Hillary should be indicted?"},{"comment_id":"10153493964774060","commenter_b":"And she could have foiled the whole dastardly plot by wearing a seatbelt!","commenter_a":"it's a shame the British had her murdered...","post_message":"On this day in 1981, Lady Diana Spencer married Prince Charles. At the time, The Economist gushed \"God save the next queen\". It was not to be. Read our obituary from 1997 @webpagelink"},{"comment_id":"10153055472862293","commenter_b":"Shut Up..get outta here!!!! Lol...forgive blacks..?? psscvhh","commenter_a":"Should \"White America\" forgive racist blacks?","post_message":"\"If we really believe that black lives matter, we won’t devalue our reality and cheapen our forgiveness by giving it away so quickly and easily.\" via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"10156195156160615","commenter_b":"LMAO! Look at that old Mary!","commenter_a":"Being that he's gay, \"they\" should be \"we\"- \"I don't know why we need special protections.\" Also, \"special\" should be \"the same as\", since lgbts are just asking for the same as everyone else - \"I don't know why we need the same protections as everyone else.\" That's what he said, decoded.","post_message":"\"I don’t know why they feel they need special protections\""},{"comment_id":"10153423597850779","commenter_b":"Who is that chick on the left","commenter_a":"Sasha Banks, who is the by far the best wrestler male or female in the WWE, is Snoop's first cousin. I'm guessing a storyline should emerge.","post_message":"WWE has confirmed that Snoop Dogg will be inducted into the WWE Hall of Fame's celebrity wing, joining a list of alumni that includes Pete Rose, Mike Tyson, Arnold Schwarzenegger and Donald J. Trump."},{"comment_id":"1180802641955155","commenter_b":"Don't let this wicked woman get away !!!!!!","commenter_a":"BETTER LATE THAN NEVER!!!!!!","post_message":"GET HER!"},{"comment_id":"10153685759487439","commenter_b":"Lets ban all Muslims and Idiots like u that have no more brains cause u do to much drugs and u are just as evil as them.","commenter_a":"Ban all Mosques and Muslims from all western civilization.","post_message":"A member of the Iraqi Christian community in Michigan wrote to alert me of a proposed mega-mosque going up in a Chaldean Christian community in Michigan. How frightening it must be to them when their Chaldean brethren in Iraq and Syria are being systematically cleansed from their centuries-old homelands under Muslim rule. The genocide of the Chaldean Christians accompanied by this:"}]
