[{"comment_id":"1281953805157000","commenter_b":"Fuck Obama and his white trash skank bitch Hillary","commenter_a":"Our wonderful President, sorry to see you and your family go.","post_message":"President Obama has been known to break into song from time to time..."},{"comment_id":"650948841696821","commenter_b":"Yup","commenter_a":"'@username smh crazy sheeeet","post_message":"Damn."},{"comment_id":"10154039827188984","commenter_b":"I hope it was a woman that pulled the trigger","commenter_a":"I am so grateful to my Lord that I do not have to live in a war torn place like this... never feeling safe and never knowing when you went to market if a suicide boomer was going to show up and kill you and others!! Never knowing when you rhusband was going to demand sex or molest your little daughter!! What a horrible life that would be!","post_message":"This terrorist fighter was excited to show off his machine gun skills to his buddies.  He stepped out beside a building, started to open fire, and then there was a CRACK followed by a dull thud."},{"comment_id":"931439316891490","commenter_b":"And the POPE lives in the woods!]","commenter_a":"It may as well be true. He always lies and is immoral and evil.","post_message":"Is this true?"},{"comment_id":"10154103585977015","commenter_b":"They have ruined these children's life....they should be deported and banned from returning!!! If they return, they should be executed.","commenter_a":"LEAD POISONING BETWEEN THEIR EYES IS THE ONLY SOLUTION ! !","post_message":"Members of a Muslim rape gang shouted  akbar in court yesterday as they were jailed for raping girls aged 11 and 13..."},{"comment_id":"10153753361057464","commenter_b":"That's right! Those are AR-15s. These gun control people just don't have a clue.","commenter_a":"Ted you need to do something about this gun control crap. Like stop it","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"533434026816552","commenter_b":"is that how YOU got in?? god dam roach.....","commenter_a":"Displaced... Bullshit . they are like Roach's spreading themselves out to bring their evil to more places","post_message":"'Never has there been a greater need for tolerance, compassion and solidarity with people who have lost everything.'"}]
