[{"comment_id":"10155061225139726","commenter_b":"The woman wearing this would probably be beaten to death. Better off carrying a gun!","commenter_a":"Women in America carry guns. What are we back to the middle ages? women at the time wore chastity belts to protect themselves from the muslim ancestors of the same ones today who were terrorizing Europe back then.","post_message":"It's a modern day chastity belt."},{"comment_id":"10153638608000667","commenter_b":"That must be why one out of every three women will have one.","commenter_a":"Abortion needs to be under attack! The murder of innocent babies is atrocious. It has no place in a civilized society.","post_message":"\"Abortion is still under attack all over the place.\""},{"comment_id":"10152727190457452","commenter_b":"This is why women do NOT belong in an all male environment. You uptight B****s can't even take a joke.","commenter_a":"Is she going to use a flag or a kitchen rag?","post_message":"Meet Sarah Thomas, the first woman hired as an NFL official, according to reports. @webpagelink"},{"comment_id":"10153758605053132","commenter_b":"These woman work these jobs to get rich. Tigers Woods wife was a nanny Arnold Schwarzenegger's, house keeper, now this chick. These women plot & plan to insert themselves into the money by any means necessary.","commenter_a":"Bad woman what goes around comes around! She will be sorry! Down with Affleck and her!!","post_message":"She's staying busy."},{"comment_id":"1001578793209206","commenter_b":"I should hope so. I thought charges had been brought before the court. Let's hope these 2 black women thugs go away for a long while and go to finishing school. Sarcasm intended","commenter_a":"Way to be behind in the news. Also i believeit was in indianapolis and the girl has been arrested on an unrelated charge. Yup mainstream news media at its best","post_message":"Shocking video out of Texas where a woman holding a child was assaulted by two other women."},{"comment_id":"10154218894306350","commenter_b":"Oooooh Emmmmmm Geeeeeee YES Cara!!","commenter_a":"@username we must try these!","post_message":"Find out when you can buy them!"},{"comment_id":"1068539523183857","commenter_b":"How can you support Hillary she lier and a crook! Trump trying to make a better America for all Americans. Hillary trying to make a better America for Hillary.","commenter_a":"Another libertard","post_message":"Actress Rosie Perez: “I really, honestly, want to understand how can you support someone who said such racist comments, who said such hateful comments,”"}]
