[{"comment_id":"1211550438923490","commenter_b":"Hope they kicked her muslim loving ass!","commenter_a":"It's all about lying and money....HO B. Are they peace loving people haha.!!!!","post_message":"In Indiana, a Muslim woman is making news after she thought the rules didn't apply to her. She demanded special treatment from an establishment and got something very, very different... what this manager gave her instead is going viral, and not everyone is in agreement with it."},{"comment_id":"10153366169796336","commenter_b":"This chick is STUPID!!!!!!","commenter_a":"Now all the blacks who have been passing themselves off as white will come forward to get media attention!","post_message":"\"She's been white all the way up until 2011, when she started to change the way she looked with the clothes she wore.\" Rachel Dolezal's brother joined \"The Kelly File\" to address his sister's recent claims to reporters."},{"comment_id":"1661665617421412","commenter_b":"Ignorant dick shouldn't of been running his mouth and chest bumping him. No pity","commenter_a":"Why was the reporter saying \"F you\" to the agent? Why did the agent feel such a response was needed? Enjoy the circus.","post_message":"A photographer was choked and slammed to the ground by a Secret Service agent during a Donald Trump rally in Virginia today. @webpagelink"},{"comment_id":"10152593040747093","commenter_b":"Both need supervision. That dog could have killed that child.","commenter_a":"Can't blame a 3 year old.","post_message":"Parents of a 3-yr-old attacked by a dog are not happy...b/c the dog’s owners aren't going to get rid of the pet… @webpagelink"},{"comment_id":"843269965740273","commenter_b":"How do you know it's a woman?","commenter_a":"It's so sad to see how judgmental people are. Opinions are like belly buttons. Everyone has one and they're filled with lint. To call this woman names and degrading her by calling her IT, is shameful. Not everyone lives inside the box or mold of society. \"Free your mind, and the rest will follow!\"","post_message":"Today's culture is damn sickening. This thing is straight from hell and should be sent back. This is ridiculous..not even funny"},{"comment_id":"10153329720368701","commenter_b":"They should drop the drinking age to 18 instead. Only Islamic countries are as strict as the US when it comes to drinking age. Raising the tobacco age will simply result in sneak smoking just like raising the drinking age resulted in binge drinking. Adults need to be adults.","commenter_a":"how about the state legislature concentrate on what it was elected to do: keep a balanced budget and not waste taxpayer money.","post_message":"What do you think, should Oregon and Washington follow suit?"},{"comment_id":"10153527225684255","commenter_b":"pre-civil rights and more white privilege.","commenter_a":"War. Environmental disdain. Injustice for all but 'ordinary white folks'. Coat hanger abortions. Dirt roads. Family 'secrets'. Weapons. Vigilantes. Klansmen, those gallant white knights of chivalrous times. Tarring and feathering of \"revenues\". Constitutionally inspired militia to kill picketers and whining war vets. Cold hearted popes. Freedom to convert Jews to Jesus by whatever means necessary. Make hatred cool again.","post_message":"What do they mean when they say that? To which supposed golden age of America do they want to return? Who can say what is in the hearts of such people? #DailyKosClassics By Daily Kos user Steven D"}]
