[{"comment_id":"1203286669686614","commenter_b":"I am not sure where you, Harry Reid are coming from. This bill is not for or against immigration, it is against illegal immigration. Why are you against protecting the USA against illegal acts? The best thing we can do for the USA is have the exact same law for illegal immigrants as our neighbors to the south. Let us have the same illegal immigrant laws as Mexico, then there will be no thought or comments about being wrong or too tough. Yes?","commenter_a":"The vilest thing in the Congress are you sir!","post_message":"The vile legislation that is now before the Senate might as well be called the \"Donald Trump Act.\" Like the disgusting and outrageous language championed by Donald Trump, this legislation paints all immigrants as “criminals and rapists.” Local law enforcement officials, domestic violence groups, immigrants’ rights groups, mayors, faith leaders and labor groups all oppose the \"Donald Trump Act.\" This bill does nothing to keep Americans safe, and it certainly does nothing to address our broken immigration system."},{"comment_id":"1166520376798072","commenter_b":"Grow up you sick witch. Get a life of your own.","commenter_a":"Congratulations men. One psycho off the market.","post_message":"HAHAHAHAHAHA... HAHAHAHAHAHAHAAAA!!! @webpagelink"},{"comment_id":"791518854323422","commenter_b":"@username She won't even make it out of 2016 before being arrested!!","commenter_a":"When I voted in Virginia on 10/13/2016, they never checked my ID. Just sayin folks .................. better watch these cheating people .... just in case!!!!!","post_message":"Live Now: Donald J. Trump speaks at a rally in Johnstown, Pennsylvania."},{"comment_id":"10156129057215389","commenter_b":"Uhh...nope!!!...I was born also...but not today!","commenter_a":"Yes, it might cost her a lot like not greeting to be president.","post_message":"Question of the Day: Do you believe Hillary Clinton is really sorry about her server scandal?"},{"comment_id":"10153444828331770","commenter_b":"Ignorant blacks thugs","commenter_a":"G.U.N. ?","post_message":"\"Man, I got that sh*t on camera, bro!\""},{"comment_id":"10156142090560594","commenter_b":"I know","commenter_a":"Go back to Brooooooooklyn. Where you belong.","post_message":"If we can't have San Francisco Giants postseason wins, this is the next best thing."},{"comment_id":"10155209080925652","commenter_b":"mast! :D","commenter_a":"Ashay Gangwar @username check this out!","post_message":"These maps offer the most enjoyable route, not the fastest:"}]
