[{"comment_id":"10154716628348812","commenter_b":"Cynthia, please please do not vote or reproduce.","commenter_a":"Republicans are throwing everything at Hillary trying to see if it will stick. They know they will lose the election in November, and this is the only way they can come up with crap to try to cast doubt on her campaign. It is not America's fault that the only person representing their party is a certified lunatic. :D","post_message":"The various iterations of the Clinton Foundation are coming under scrutiny as Hillary Clinton runs for The White House."},{"comment_id":"1027684670588211","commenter_b":"Sadly it's true though. The American education system is poor and it's not the citizen's fault.","commenter_a":"Who did this survey? You just want to make fun of Americans and make others feel superior. By the way, your Grand Canyon photo is too dark, poorly done.","post_message":"Do you know where these major national landmarks are?@webpagelink"},{"comment_id":"10154256753938701","commenter_b":"ONLY IN AMERICA RACIST GET REWARDED","commenter_a":"Regardless of if you think the shooting was justified or not this is just callous and tacky. He honestly makes me feel ill.","post_message":"UPDATE: The gun listing has been taken down from the auction site."},{"comment_id":"10153638977331336","commenter_b":"Who said I only talked to one? I only mentioned ONE conversation","commenter_a":"Their apology means nothing if the employee was not fired immediately.","post_message":"The Pembroke Pines Police Department says that a uniformed officer was refused service at an Arby's simply for being a police officer."},{"comment_id":"1211860118868990","commenter_b":"Hopefully Bernie can take control of congress, and we can keep moving this country forward! #DontPushAmericaBackwardsAgain","commenter_a":"It's gonna be ... Huge ...!","post_message":"I hope today we defeat Donald Trump, and we defeat him badly. iwillvote.com"},{"comment_id":"916180815144838","commenter_b":"She is still the best when compared to the other guys. Run, Hillary, Run.","commenter_a":"Rut-roh!","post_message":"Are Clinton's numbers doing better or worse since she formally entered the 2016 race?"},{"comment_id":"10153337610537093","commenter_b":"Lol !!! Nice comeback April. #SpokenLikeATrueTenYearOld","commenter_a":"Not surprised at all Texas is a racist redneck controlling state!","post_message":"Rick Perry's good name has been restored... @webpagelink"}]
