[{"comment_id":"10153271515149087","commenter_b":"Stfu old bitch","commenter_a":"God help America if Hillary or Sanders ever become president","post_message":"Bernie Sanders is leading Hillary Clinton by a stunning 30 points among voters under 30, according to NBC's first post-debate poll."},{"comment_id":"1264747770240434","commenter_b":"where are you people getting married? That's way tooo much for a wedding.","commenter_a":"save that money for a down payment on a starter home. have a small personal wedding. in the longrun no one is going to remember crystal chandeliers, wine glasses or the color of the bridesmaid dresses. only you. in 35 years your husband won't remember that----only the credit card bills. Have a wonderful time no matter what you do.","post_message":"And about $16,000 of that is for the venue alone... STORY: @webpagelink"},{"comment_id":"726384220793520","commenter_b":"Mostly things that happen bad in this country always happen in Texas are with someone from Texas","commenter_a":"That kinda stuff goes on all the time in Texas","post_message":"Terrible."},{"comment_id":"10154686052869586","commenter_b":"Get this bear out of there now","commenter_a":"Holding animals in captivity is inhumane. Do not support zoos.","post_message":"Thousands of people visit daily to take selfies & knock on the glass :("},{"comment_id":"10158855992795206","commenter_b":"Your taste is all in your mouth. This woman lies quicker than a spider can grab it's prey. Karma will be, her children practice her art, on her.","commenter_a":"Role model, amazing mother, classy and smart. Love her! #MAGA","post_message":"Today, Donald Trump named Kellyanne Conway as presidential counselor. Here are some interesting facts about her:"},{"comment_id":"10156238965050354","commenter_b":"Hillary isn't change She is Washington She is the establishment Everything that is wrong with America Is what Hillary represents!!!!!!","commenter_a":"Are lawmakers going to allow themselves to be sued when a citizen is killed because they can't protect themselves?","post_message":"DEVELOPING..."},{"comment_id":"10152746962915950","commenter_b":"We get your point. She is NOT a man. Therefore she must be a Woman. Congratulations to her.","commenter_a":"She's not a female pilot, she's a Marine Corp Aviator! Semper Fi!","post_message":"Meet the first female pilot in the Navy's Blue Angels' 69-year history, Marine Corps Capt. Katie Higgins: @webpagelink"}]
