[{"comment_id":"10154385949804087","commenter_b":"@username I think he ran away like a little bitch","commenter_a":"If all you ding-bat liberals would have acted like mature adults, all the EXTRA security wouldn't be needed and costs would have been much less. But no, you all ad to act like psychotic juveniles so this is what you get.","post_message":"The New York Police Department is blasting Republicans in Congress for refusing to cover costs to protect Trump."},{"comment_id":"10153096842961748","commenter_b":"The only thing that is happening is Bigots are being exposed, and shown for what they are!","commenter_a":"As ALWAYS - it is just the opposite! Conservatives are attacking the laws that protect EVERYONE, including themselves, from discrimination. Gays are challenging those attacks in order to preserve and PROTECT freedom. Only backwoods IDIOTS would not understand that.","post_message":"Gay people are lighting America on fire! According to a new anti-gay \"documentary,\" anyone who owns a business or holds public office is under attack."},{"comment_id":"10155491748590354","commenter_b":"Karma catching up with this Idiot, good !!!!!!!!!!!!!!","commenter_a":"she must be taking lessons from sharpton","post_message":"Pro tip: when bashing others to pay their \"fair share\" in taxes, it might be wise to do so yourself."},{"comment_id":"10154189753241130","commenter_b":"Hillary is way too smart, too tough and too focused on governing well to let these kinds of insults throw her. And Tina Fey said it best: Yes, she's a bitch and that's great because bitches get things done!! I think Hillary should own it and we should all get behind her! I'm ready to get my bitch on, how about you?! #I'MWITHHER Vote for Hillary Clinton!","commenter_a":"Already seen and heard it.","post_message":"If Hillary Clinton wins in November, brace yourselves."},{"comment_id":"10154978803416509","commenter_b":"@username even your pussy is ugly...","commenter_a":"Anyone who is upset, mad or sad about this, please evolve otherwise you are apart of the pedophile culture.","post_message":"In a nod to a more modern approach, the Miss Teen USA pageant is ending the swimsuit portion of its competition."},{"comment_id":"10156171659485354","commenter_b":"Get the f away from American . I brought my religion to this country !?? I keep mine in side , Don't wear that ugly scary thing over your face !!! That scares me wear it inside or with you groups . You weren't born with it you're gonna die for not wearing it !?? I don't I promised to accept and care for what was in America . I ve got to see with my eyes . It is deadly scary to me , can't be around them .","commenter_a":"It was a fake bomb the next one won't be if that was a white kid he would be jailed you can't even point your finger because it represents a gun and you get kick out of school. So what gives with this","post_message":"Have the media given you the police's side of this story?"},{"comment_id":"1719361974988639","commenter_b":"Fucking vegans","commenter_a":"Bit dramatic? Eggs are extremely good for you, provide income for a lot of people, and battery farming is on the decline","post_message":"We're just going to leave this here."}]
