[{"comment_id":"1338210979551629","commenter_b":"Lady your way too old to be a cheerleader!!!!","commenter_a":"This woman is not well","post_message":"HOLY SMOKES! NANCY PELOSI: Orders People to Clap, Repeats Words Then Calls John Kasich The Gov. of Illinois [Video] This is embarrassing! She scolds the audience!"},{"comment_id":"402875396503722","commenter_b":"silly sarah sure is a pompus bitch","commenter_a":"Rather look at her vs Billary! What a pompous bitch!","post_message":"Sarah Palin had some strong views on Hillary Clinton's email accounts. Is this as big an issue as she claims?"},{"comment_id":"10152923499612217","commenter_b":"Are you tired of that excess fat in your body,having serious menstrual pain, weak erection, stretch mark,insomnia, stroke,fertility problem,pimples or any rough skin? We have the best and most affordable products for you.To get any of our products contact @username, BBM -2BDA0E2A.","commenter_a":"deepest sympathies to the families of all of the victims.......","post_message":"What we know about some of those who died #RememberTunisia"},{"comment_id":"1552538175033296","commenter_b":"bitch i had to work and my husband had to work get off your fcking ass bitch and nobody needs 15 kids that doesnt have a job thats why this fcking foodstamps got to stop","commenter_a":"GET A JOB LOSER !!!","post_message":"This is why we need LESS welfare handouts."},{"comment_id":"10153724515436770","commenter_b":"She has no womb or ovaries.","commenter_a":"Transgenders are just psychologically \"challenged\" individuals with a normal complement of either male or female sex chromosomes. A genetically male transgender would (quite correctly) not be allowed to compete in a woman's race whereas a genetically female transgender would only get beaten were she to compete in a male race. Caster is (it seems) totally different. If an intersex she has two X chromosomes that would normally make a female but, unlike true females she also possesses male Y chromosomes that will give some male characteristics. If she has Y chromosomes then she isn't qualified to compete in female races but, as with female transgenders, there is little point in her trying (and she should not with two X chromosomes) to compete in male races.","post_message":"South African runner Caster Semenya dominated the women's 800-meter final Saturday in Rio, finishing well ahead of the competition to take home the gold medal. Turns out Semenya is widely believed to be “intersex.\""},{"comment_id":"642882945885651","commenter_b":"Not really. Go read history..that's a facade...","commenter_a":"LOVE the Bush family! So presidential, respectful, and patriotic. Something I've missed for the last 8 years and the coming 4 years.","post_message":"President Obama, President George W. Bush, First Lady Michelle Obama, former First Lady Laura W. Bush, and others speak at the opening ceremony of the Smithsonian National Museum of African American History and Culture."},{"comment_id":"726130267546926","commenter_b":"Bitch go make me a sandwich hold the mustard.","commenter_a":"I love how a bunch of \"men\" feel so threatened by strong women!!!!","post_message":"Demonstrations took place in England, Ireland, the Netherlands, Italy, Kenya, Mexico, Canada, Brazil, the United States, Australia and many other countries."}]
