[{"comment_id":"10153566641994456","commenter_b":"Pure ignorance! Women should not let a man in their car that they don't know, much less 2 men!!!","commenter_a":"I don't stop at this Pilot Travel Center, even in the daytime. Lot Lizards and beggars are like running water, 24/7, even with the police watching.","post_message":"A Birmingham woman's act of kindness resulted in her car and wallet being stolen at gunpoint. @webpagelink"},{"comment_id":"1445788068782419","commenter_b":"If that bitch wins it will not be USA any more cause she will screw it over and over. Immigrants will take over.","commenter_a":"Never Hillary","post_message":"ELECTION POLL! Who should win the 2016 Presidential election?  LIKE Qpolitical for the results."},{"comment_id":"10153315672229091","commenter_b":"It's not cheap, it's very expensive. the apartments on either side, below and floors above have to be treated to truly eradicate the pest from the building. All that cost big $$$$ It's not funny. I don't blame her for looking for an inexpensive way to kill them. She should have done more research tho","commenter_a":"Theres people laughing and then I'm reading \"Stop being cheap and call an exterminator...... Who knows if this woman call an exterminator for an estimate and it was way above her budget none of us know that everyone go through different things I wouldn't recommend dousing yourself in rubbing alcohol but I'm sure if she would have looked on line she could have found a more better way. I don't understand how people can sit here and judge the next person like as if their better than the next. At least she apologized if that's the case and if thats how you feel then you should reach out and help her afford an exterminator","post_message":"The woman said doused herself with rubbing alcohol before it was ignited by a stove and oven. She said she had turned on the stove and oven the previous day to heat up her apartment, on advice from a neighbor, as part of the effort to kill the bedbugs."},{"comment_id":"10155048729377235","commenter_b":"I cannot and will not even listen to this lying disgusting woman! I cannot watch her on TV for even three seconds, she makes me wanna puke!","commenter_a":"Oh shut up!","post_message":"The Trump administration just doubled-down on their attack on one of America's biggest allies."},{"comment_id":"10153898443761770","commenter_b":"In GOD we TRUST....Vote for Trump/Pence 2016..Hillary hate guns because dangerous to the toddlers!!! But In the GOD's name why she's ok to rip out the unborn 9 months in the womb...and Hillary sharing our national classify to others and exchange to pay her ...GOD bless American people to support Trump... because only Trump/Pence can stop government corrupt, bring job, boom the economy, protect our family and help veterans, military and make America safe and great again... that Hillary been extremely careless to protect our national security....and Trump will stop Hillary accepting money from foreign country that treat LGBTQ and women like animal... and Hillary call all my Africa-American friends \"SUPER PREDATOR \" and insulting all my Latinos & Latinas \"NEEDY & BOWL of TACO\"","commenter_a":"Who gives a damn","post_message":"Nate Schmidt of the Washington Capitals sits down with David Hookstead to talk about life as an NHL player."},{"comment_id":"10153970480428734","commenter_b":"support the blue, let her pay for her own security!","commenter_a":"Too bad for Miami, they will just lose all of the tax revenue they would gain by Beyonce performing in their city. She doesn't need them they need her and the police want the overtime pay. All talk.","post_message":"Law enforcement around the country have been critical of the singer since her Super Bowl half-time performance, which referenced the Black Lives Matter movement, Malcolm X and the Black Panthers."},{"comment_id":"844173412298350","commenter_b":"She's a witch!","commenter_a":"And she is a pig!","post_message":"NEW unpublished audio recordings of Clinton Foundation head Donna Shalala privately expressing concerns about Bill and Hillary Clinton’s mental state."}]
