[{"comment_id":"562038433961848","commenter_b":"Melissa Jayawardane","commenter_a":"Point is that this 'triad' is nothing special: we are given a pseudo-statement.","post_message":"Machiavellianism, narcissism, and psychopathy. Where do you rank?"},{"comment_id":"1144427122283701","commenter_b":"Seriously this woman obviously needs help.","commenter_a":"My cat thinks she's a human","post_message":"She hisses at dogs and often crawls on all fours"},{"comment_id":"10153442792427232","commenter_b":"Have you seen all the arrest of that originations leaders?","commenter_a":"Much like their spoksperson...LoL","post_message":"The civil rights group approved the measure Saturday at its national convention in Philadelphia to end the boycott of tourism and other economic activity. STORY HERE: @webpagelink"},{"comment_id":"1089067221104747","commenter_b":"it's only good enough for those of us that don't pray to the gun god!","commenter_a":"Republicans; 'Carry a gun everywhere, except near us.'","post_message":"If conservatives are so convinced that gun-free zones attract killers, then why do so many conservative places and events ban guns?"},{"comment_id":"10153232684759030","commenter_b":"'Run, bitch! RUN FOR YA LIFE! GET SOME HELP!'","commenter_a":"Kristian Pollard Elisha Lloyd","post_message":"#ThrowbackThursday to Wayne Brady using the ATM on Chappelle's Show. #TBT"},{"comment_id":"764404957026018","commenter_b":"I support 100 percent bitch!","commenter_a":"I mean seriously if you support trump you're probably as stupid as a Clinton supporter","post_message":"Geez...what caused this?"},{"comment_id":"1886511228246156","commenter_b":"Illegal aliens.","commenter_a":"What your liberal brains are to small to realize is there is no defending illegal immigrants. They have no right to a trial. They have no right to a defense. They are automatically guilty and only entitled to deportation. If you want to be American there is a legal way. It is not easy nor will it be quick. But if you are willing to do it the legal way then you get to become an American and stay without fear of deportation.","post_message":"Janet Napolitano says the University of California will vigorously protect illegal immigrants."}]
