[{"comment_id":"1626581144301352","commenter_b":"Amy shular should just go do porn. Nothing else it will shut her pie hole with a dick in her mouth.","commenter_a":"Of course they won't leave. They won't be treated like \" royalty\" ( said sarcastically ) anywhere else 😩😩😩","post_message":"It was only a matter of time..."},{"comment_id":"541297862703293","commenter_b":"All wall must be built before the country is lost!","commenter_a":"We lived in Mercedes . Know exactly what you are going thru !!!","post_message":"We need a wall fast to stop ILLEGAL IMMIGRATION and ILLEGAL DRUGS from entering our country. Its just common sense!"},{"comment_id":"10153351807966130","commenter_b":"*you're behind a foolish *woman","commenter_a":"GO GIRL. WE'RE BEHIND YOU!!'","post_message":"Ashley Burnham was the first Canadian and aboriginal contestant to win the Mrs. Universe contest."},{"comment_id":"740023432800293","commenter_b":"That is just an act! She could use some for real but that isn't going to happen!","commenter_a":"Your dead soul of an ass shouldn't have constitutional rights either you f*#king hag. Isn't it time for you to leave? Lucifer has GOT to be worried about where his ugly little daughter ran off to.","post_message":"Where's that \"love and kindness\" Hillary is always lecturing Americans about?"},{"comment_id":"1103608743035479","commenter_b":"Just going off the man's statement. And yes some of my statement is assumption because of some of the stuff he has said.","commenter_a":"You do know like every neighborhood in America Muslim community are already patrolled. They patrolled by cops. An if did know this after 9/11 the FBI and NAS already monitor communication it those communities than to the Patriot Act. So what Ted Cruz is talk is already being done. What Ted Cruz really wants to do like communist leaders would do in term of monitor arrest you and in prison you with any form of guilt. He want to doing like Castro. It's funny Ted Cruz father escaped Cuba to get away from communism. No Ted Cruz is advocating the same communist view his father escaped from. If you look at his policies Ted Cruz is nothing more than a communist pretending to be a Republican.","post_message":"Ted Cruz was blasted this week for saying Muslim neighborhoods should face extra patrolling to prevent extremism. Here's why Cruz says those critics are wrong. Do you support or oppose Cruz's plan?"},{"comment_id":"1161479583891497","commenter_b":"BUILD THAT WALL! BUILD THAT WALL! BUILD THAT WALL! #MexicoWillPayOneWayOrTheOther #Trump2016","commenter_a":"Time to just hand out some good old justice and let them be found in a roadside ditch back across the border","post_message":"GROUP OF ILLEGALS GANG RAPE 13-YEAR OLD GIRLS. sickening details: @webpagelink"},{"comment_id":"10153525332906323","commenter_b":"More like Donald Trump.","commenter_a":"Perhaps he must be having a midsummer's night dream?","post_message":"It takes a genius to know one..."}]
