[{"comment_id":"10152966596170399","commenter_b":"And all these illegal f$^%ers are going to Disneyland!","commenter_a":"Hire a illegal alien get a $5000 fine! A New Border Surge Opens Us To Surge Of Epidemics Border Surge: Secretary of State John Kerry warns of a new surge of illegals, just as Central America is being hit by a new wave of epidemics. No doubt about it: President Obama's open-borders policy is exposing us to disease, too. It's plain what's bringing up this great wave of diseases: immigration politics. President Obama is so obsessed with winning Latino votes for Democrats by neglecting border laws that he's unwittingly opened the U.S. up to a variety of third-world diseases. He's released tens of thousands of medically unscreened illegal immigrants into the U.S., supposedly to prepare for their immigration hearings, which 70% never show up for. The epidemics are small now, but the risk is rising. And with a new wave of illegals in the pipeline, where's the will to stop ...","post_message":"\"Anti-vaccination is tailormade for deeply selfish people, because it gives them a chance to show off how superior they think they are while shifting the cost of their choice on other people.\""},{"comment_id":"866091750103560","commenter_b":"What do ya expect Dennis. I go out most days an feel I'm surrounded by backwoods hicks!! It kinda sucks being from a big city","commenter_a":"Its a LED light, idiots!","post_message":"A Tennessee mom claims she saw pentagrams in her kid's school bus brake lights. She says it's a threat to God and parents should be outraged: @webpagelink What do YOU think?"},{"comment_id":"10154151244455579","commenter_b":"A fool and her money are soon parted.","commenter_a":"Just now donated $20 for Hillary Clinton and committed to caucus in my state hope you do the same right now:) I am voting for Hillary because I fell she is the best qualified person. Three Supreme Court Justices will mostly likely be appointed and I want a democrat to be the one to select the appointees. She can do it better than Bernie plus backwards and in High Heels. We have made such progress under President Obama I would like to see how much more we can continue to do and I trust her and honestly know she will be the best Person and successor to Barack Obama additionally she has devoted her \"entire life\" to bettering the lives of the American People.","post_message":"Hillary Clinton: \"We are going to fight for every vote in every state.\" Full video here: @webpagelink #CSPANfan"},{"comment_id":"1444053418948017","commenter_b":"That's why those guys never meet a MULAN their whole life. They could not handle a strong woman anyway.","commenter_a":"He's blaming Mulan for progressiveness and equal woman's rights. Someone thinks we belong in the kitchen barefoot and pregnant.","post_message":"Donald J. Trump running mate Mike Pence slammed the kid's film as the brainchild of a \"mischievous liberal at Disney\" bent on causing \"a quiet change in the next generation's attitude about women in combat.\""},{"comment_id":"767405186757001","commenter_b":"Get them out of America","commenter_a":"At least she learned some ENGLISH😜","post_message":"WIFE OF MUSLIM Immigrant Screams: “F*CK AMERICA!” After Husband Is Threatened With Deportation For Major Food Stamp Fraud In NY [VIDEO]"},{"comment_id":"10153222967261378","commenter_b":"Time for her to be shot in the face.","commenter_a":"Time for her to be released from her position.","post_message":"READY FOR MORE JAIL: Back at work and continuing to refuse same-sex marriage licenses, Kentucky clerk Kim Davis said she'll go back to jail again if that's what it comes to. Watch her tearful interview..."},{"comment_id":"10153184020474726","commenter_b":"What a disgusting a hole.","commenter_a":"what a piece of dog feces","post_message":"\"He didn't win, did he?\"    Harry Reid confronted on his lies, with no regrets."}]
