[{"comment_id":"460743430758281","commenter_b":"No! That's why you have insurance! If you don't want a kid and the responsibilities that go with it, don't have unprotected sex. Better yet, keep your legs together and your pecker in your pants!","commenter_a":"NO NO NO!!!!","post_message":"\"Whatever happens, this likely won’t be the last we hear from Notre Dame, or the Supreme Court, on the accommodation.\""},{"comment_id":"10152977390881130","commenter_b":"#fatgirlwasted","commenter_a":"@username YASSSSSS!","post_message":"Stoners, rejoice!"},{"comment_id":"10153702195241336","commenter_b":"What a WANKER .","commenter_a":"No , they either are true to their faith or to their country , not both !","post_message":"\"Mr. Carson may be a good doctor but he is not ready to lead a great nation.\" Today on \"Sunday Morning Futures with Maria Bartiromo,\" Sen. Lindsey Graham responded to Dr. Ben Carson's comments that a Muslim should not serve as a president. @webpagelink"},{"comment_id":"1773052759611713","commenter_b":"Rosemary cant even spell.....","commenter_a":"To the ones claiming that the \"media picks him apart\", news flash guys... the media doesn't have to do anything! Every time he opens his mouth terrible things come out, its not the media, its him!","post_message":"Donald J. Trump and his aides refused to allow reporters to travel with him to D.C. yesterday, breaking decades of traditional press protocol and setting a new precedent for coverage of his administration."},{"comment_id":"1237060979686981","commenter_b":"Felicity Odgers! See, your friend would go viral with 'fox'","commenter_a":"the \"mole freckle\" on youtube is more amusing.","post_message":"That's definitely not right!"},{"comment_id":"775509592583157","commenter_b":"@username they are home how about the real immigrants go home for a change ?","commenter_a":"Illegals come here from Mexico looking for a better life yet they want to turn the U.S. into Mexico...freakin' crazy, and stupid!","post_message":"\"The American taxpayers have reached a boiling point. We are tired of illegals taking American jobs. We are tired of illegals living off our tax dollars. We are tired of illegals causing mayhem in our streets,\" says Todd Starnes. Do you agree?"},{"comment_id":"10153399368892964","commenter_b":"I'm sorry but I didn't see a post about the TPA for the last vote or this one coming up probably this next week to put it in...do you think there is a reason for that? Something this important? And nowhere else to post so I would guess that means he doesn't want to hear it. But it's his job, so yes he is going to hear about it whether he wants to or not!","commenter_a":"We need to keep OUR laws and get rid of these fake \"free trade\" treaties that make us beholden to an unelected foreign tribunal that frowns on anything that allows us to favor buying American, calls it unfair and forces us to change our laws or pay through the nose for the privilege of keeping them. You need to STOP this subversive attempt to undermine our Constitution NOW and vote NO on the TPA Revote...this does not need to go to an up or down vote! @webpagelink","post_message":"I successfully added a measure protecting jobs at the Lighthouse for the Blind to the National Defense bill."}]
