[{"comment_id":"1442770955748411","commenter_b":"Well he's better than that BITCH","commenter_a":"That's an insult to pigs!","post_message":""},{"comment_id":"10156784755310354","commenter_b":"Fly on your Broomstick Hillary!!","commenter_a":"The fact that she has not been indicted by now with the mountain of evidence stacked against her is proof that it will NEVER happen, folks.","post_message":"There is zero irony in this story."},{"comment_id":"10153874445353132","commenter_b":"Women WE MUST UNITE AGAINST STUPIDITY!,","commenter_a":"Did y'all read the article or just start running off at the mouth?! I, too, had the same reaction until I actually read the article. This congressman did not come up with this if his own accord. It was reported to him by the ones who trained them. THEY said there was special treatment.....not the congressman.","post_message":"\"Fighters must be prepared and capable. If they are not, people will die.\""},{"comment_id":"789366324587278","commenter_b":"Jesus, doesn't anyone see a pattern here & this dirty insane hobag. I wouldn't vote for her if u paid me. She's evil..I pray Trump wins and try her and Ovomit for TREASON and HANG their sorry asses!!!","commenter_a":"And before everyone gets Butt hurt over this one lets just reminisce some history about the Clinton's... And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock Rose Law firm. Died of a gunshot wound to the head, ruleda suicide. 4 Ron Brown Secretary of Commerce and former DNC ...","post_message":"Clinton Mistress Reveals Herself, Drops Major Bombshell Right On Top Of Hillary This will completely derail her campaign. Do you think the last thing America needs right now is another Clinton?"},{"comment_id":"1078994498821381","commenter_b":"This is OHBLOWME's army!!","commenter_a":"Obama has blood on his hands","post_message":"BATON ROUGE KILLER'S SOCIAL MEDIA Bought Into Obama's Anti-Cop \"JUSTICE\" Rhetoric [Video] Obama is heard by people like this killer...blood on Obama's hands!"},{"comment_id":"1391127634238463","commenter_b":"You poor Republicans. You are so lost in your stupor that all you can do is harp again and again over Hillary's e-mails. Sure, it was a mistake. But in the final analysis you can not find any harm caused by that. In the mean time just consider the damage caused to our nation by the rigidity caused by the Republican Congress over the past eight years. Your solution is to nominate a man devoid of any moral compass. Thanks Republicans. I can only hope that what rises from the ashes of the Grand Old Party will come closer to Abe's vision and that Rush L. stays buried in the ashes.","commenter_a":"I just do not understand how any true red blooded America could even think about voting for Hillary after her cover up of Benghazi and Emails !! The only thing she has proven is she is a BIG lair and above the law ! She is truly a woman of zero integrity and belongs in prison NOT running for our president !","post_message":"\"It took the socialist to remind us that you supported the trade agreements that cost millions of American jobs and millions of dollars.\" Last night on \"Justice,\" Judge Jeanine Pirro slammed Hillary Clinton over her Wall Street ties, failure to help the Middle Class, and backtracking over her husband's crime bill. @webpagelink"},{"comment_id":"728450517283994","commenter_b":"While I can appreciate that there is a flip-side to the coin on reproductive rights, I cannot fathom why or how you in your position can support an organization that works to outright dupe the public with false assertions, false information, or would work to purposely hurt a woman to meet their agenda. To pursue a pregnancy at the cost of the mother's life is not right when you can do something about it. The premise makes women disposable.","commenter_a":"No abortions mean women are not allowed to vote","post_message":"Inspired by the work of the Carolina Pregnancy Center in Spartanburg. We must do more to foster a culture of life."}]
