[{"comment_id":"10154732145028690","commenter_b":"@username he will never be found guilty of those accusations. He's too powerful. That family is too powerful. And when it's the word of the victim against the word of the powerful accused, especially in cases of rape and sexual assault, we all know the public will side with the powerful beloved, charming, charismatic Bill. Especially when his wife is about to win a historic election. This speaks volumes about the rape culture in this country. This is the same story played across this country everyday. This is why so many women remain silent. As someone who values national security and the reputation and values of this country, I can't in good conscience vote for either of these abhorrent people. Trump is the orange muppet love child of Ford Fairlaine and Biff from Back to the Future, and the Clintons are the example of a powerful enterprise who represents ultimate ...","commenter_a":"Bill Clinton isn't up for election, that argument is lame and dead as some are trying to compare these events. What Trump said amounts to sexual assault...\"you grab them by the pu***.\" Trump has been accused many times of sexual assault and rape, with the latest accusation raping a 13 year old girl. If guilty, Trump should be spend the rest of his menial life in prison. Trump is unfit.","post_message":"\"Horrific\", \"sickening\", \"poisonous\" - Donald Trump blasted over lewd and sexually charged comments he made about women @webpagelink"},{"comment_id":"1834672043468268","commenter_b":"Well if she wants to waste her money.... Whatever","commenter_a":"wasted money","post_message":"Actress Meryl Streep loves throwing her money into politics. Particularly when it involves Barack Obama and Hillary Clinton."},{"comment_id":"1624321510961305","commenter_b":"She's a P I G!","commenter_a":"She has a lot of gall, wearing a crusifix on that neck........","post_message":""},{"comment_id":"10153949819826770","commenter_b":"Trump is not against Muslims. He wants Muslims coming into the country right now to be stopped and vetted completely with what is going around in the world. He wants all the law breakers in the country that are illegally gone. And its not just them it means everyone for now till we can get a handle on jihadists trying to come in to the country. What is wrong with that!??","commenter_a":"A woman protesting in New York City just said she was protesting because Trump doesn't represent her beliefs! Well that's why we had an election yesterday and America spoke clear and loud that they were fed up with the way our country was going. The American people are tired of the murder of our unborn children. We voted!! The American people are tired of people who don't work being rewarded while people who do work are being punished. We voted!! The American people are tired of activists judges making new laws without the approval of we the people. We voted!! The American people are tired of foreigners being treated like first class citizens while our veterans needs are put on the back burner. We voted!! The American people are tired of our enemies disrespecting us. We voted!! The American people are tired of our policemen and other law enforcement people ...","post_message":"Asra Nomani is sick of the \"liberal honor brigade\" turning a blind eye to radical Islamic terrorism..."},{"comment_id":"238983709893436","commenter_b":"Assholes. Shame on them...they got their education...the Hell with our future!","commenter_a":"pride in ownership republicans push education backwards.","post_message":"Was YOUR senator one of them? Spread their shame!"},{"comment_id":"10156527615820206","commenter_b":"She's getting my vote. I want a woman in the White House.","commenter_a":"Seeing Carly on Tuesday, can't wait!!","post_message":"Such a great welcome from supporters in Mackinac Island, Michigan today!"},{"comment_id":"10153477026528352","commenter_b":"She should be buried under the jail,","commenter_a":"She's a LOSER.... There's no copping out of the fact that SHE murdered her kids.. Whether dad was around or not is irrelevant.. Plenty of women like myself are single moms and we aren't doing crazy shit like this","post_message":"Mother in court for ‘killing two of her kids and putting them in freezer’ has to be removed after flying into a rage over their absent father"}]
