[{"comment_id":"10153143510309575","commenter_b":"That's a woman?","commenter_a":"Good","post_message":"An Indianapolis mother was sentenced to 60 years Friday in connection with the death of her 2-year-old daughter.  In January, she was found guilty of murder, battery and neglect of a dependent."},{"comment_id":"824413534273149","commenter_b":"She should point those racist fingers back at self!","commenter_a":"Do you really expect anything else from her? I'm not shocked at all. She's an idiot.","post_message":"This speech is shocking... even for her!  What Michelle says at this graduation ceremony will make you cringe!"},{"comment_id":"10153860133856336","commenter_b":"He just figured this out LOL i knew ever since he took office.","commenter_a":"Absolutely.","post_message":"Do you agree with Mike Huckabee?"},{"comment_id":"10155893621460231","commenter_b":"That's her prerogative ....","commenter_a":"Take it are leave it! but get a life.","post_message":"The singer—along with a lot of other people—isn’t buying it."},{"comment_id":"10153511062521336","commenter_b":"None of them, should be able to Vote, till they Pay American Taxes for at least 10 years, then They would Understand, how We all feel, about having to Pay for their being here!","commenter_a":"Here is a photo and article - Are our elections being unfairly skewed through legal and illegal immigration ? @webpagelink","post_message":"Show us in one photo what you think needs to change in America and your photo could be featured in the first Republican presidential debate. Submit it here: @webpagelink  Don’t miss the Fox News-Facebook debate live from Cleveland August 6th on Fox News Channel!"},{"comment_id":"10153980841689062","commenter_b":"Good glad yall didn't. One thing you can't replace is a life/lives. Hopefully everyone understands","commenter_a":"'@username did u still go to Houston","post_message":"Hail is coming down with heavy rainfall off Beltway 8 and Antoine as heavy storms begin to move into the area. Stay safe out there!  Radars: @webpagelink Share your pics/videos: photos@khou.com."},{"comment_id":"10152608166460667","commenter_b":"This is about as bad as actresses who make 10 million a film talking about income inequality","commenter_a":"American Sniper sucked! It was full of conservative propaganda. I'm shocked it was even nominated.","post_message":"Oscars count: Grand Budapest Hotel: 4 Birdman: 4 Whiplash: 3 Boyhood: 1 The Imitation Game: 1 Selma: 1 The Theory of Everything: 1"}]
