[{"comment_id":"838491256240234","commenter_b":"Please go back to whatever planet you came from!!!! Haven't we had enough of her?","commenter_a":"Oy! She is no longer relevant, though she keeps trying to be. Now just looks foolsih. Very sad.....","post_message":"They're back! The Palins are trying to horn in on the Duggar spotlight, regardless of how grimy."},{"comment_id":"10153507396631323","commenter_b":"She wears real fur....therefore she's a selfish bitch with no regard for the lives of others. I've never liked her. Seems I'm not alone in that here.","commenter_a":"I really couldn't care less about her, she's contributed nothing positive to this world.","post_message":"Why do newspapers hate Kate Moss so much?"},{"comment_id":"10155589843380231","commenter_b":"That Saltine needs to o put on her white sheet and HOOD and shut the hell up.","commenter_a":"Which is why she's scared to show her face...stand by your convictions woman!","post_message":"At least one McKinney resident is standing by the police, insisting that the actions taken were appropriate."},{"comment_id":"10152813313326523","commenter_b":"Glad everyone shared that video and got this no good nasty tramp bitch arrested!","commenter_a":"Black lives matter","post_message":"“It’s almost like they plan these fights, they want these fights to be on tape where they can put it on social media. This is horrible.”"},{"comment_id":"10154602642789062","commenter_b":"They need to close all of them they are evil an come from tha devil","commenter_a":"I hate Walmart.","post_message":"Wal-Mart is closing 269 stores, more than half of them in the U.S. - YOUR THOUGHTS?  UPDATE: 2 Houston stores closing -> @webpagelink"},{"comment_id":"386189561505639","commenter_b":"Keep it open and all prisoners.","commenter_a":"Open","post_message":"Do you think Guantanamo Bay prison should be closed as promised or kept open?"},{"comment_id":"10154119887406167","commenter_b":"LOCK HER UP!","commenter_a":"Why hasn't Hillary been arrested for money laundering and racketeering?","post_message":"It's not just Trump that's the problem -- it's his family too."}]
