[{"comment_id":"10152975467087232","commenter_b":"Would you like them to put a gas grill up there! Get a life California your state has more problems to deal with other than a treehouse","commenter_a":"Their property it should be their choice","post_message":"This California family's treehouse is pretty sweet! But a judge ruled it has got to change. DETAILS---> @webpagelink"},{"comment_id":"10154647718578132","commenter_b":"Ahhhh...women tearing other women down! How mature!","commenter_a":"At least she did the mop on her head somewhat decent tonight","post_message":"First Lady Michelle Obama delivered an unusually personal and emotional speech at tonight's #DNC."},{"comment_id":"10152731106111051","commenter_b":"Yet if you speak out against it, you are \"behind the times\" or \"living in the past\". We need to turn the clock back about 50 years to see what a moral society looks like and I am not just talking about the gay agenda. I am talking about adultery, divorce, teenage pregnancy, children born out of wedlock and anything else that used to be immoral that we are forced to accept today.","commenter_a":"Um, did they leave the word \"incest\" out of the story on accident??","post_message":"This girl never really knew her father – until they ended up dating."},{"comment_id":"10152963839226051","commenter_b":"What is going on with these ungrateful wretches. They act worse than animals.Shut down the frat houses, they are all acting disrespectful","commenter_a":"cut their dicks off the young punks.","post_message":"Things just went from bad to worse for the frat boys who spit on wounded veterans and their service dogs before urinating on the American flag."},{"comment_id":"10153212114294087","commenter_b":"You're a vile fucking stupid bitch.","commenter_a":"this Pope is insane he's the worst one ever he says blasphemous stuff no wonder that idiot Obama ass licker biden likes him","post_message":"Joe Biden: \"I admire Pope Francis deeply and I'm excited about his upcoming visit. Pope Francis has become a moral rudder for the world on some of the most important issues of our time, from inequality to climate change.\""},{"comment_id":"10152474320835927","commenter_b":"The ones I know aren't allowed to voice an opinion.","commenter_a":"The rest can't say anything 'cause they're still in boot camp.","post_message":"Does President Obama deserve this low approval rating for military personnel? Leave a comment... Read More: @webpagelink"},{"comment_id":"10153877851737217","commenter_b":"A girl has no name","commenter_a":"Don't you mean 'so called' Abu Mohammad al-Adnani. If you are going to pre fix names with 'so called' you might as well be consistent. Silly 'so called' BBC Lol","post_message":"Spokesman for so-called Islamic State Abu Mohammad al-Adnani has been killed in Syria, IS-affiliated media has said."}]
