[{"comment_id":"1552392261455878","commenter_b":"You forgot to show the filthy, disgusting women in vagina costumes.","commenter_a":"I'm sick of vagina.","post_message":"Congratulations to the women marching around the world today. We will not go back to the days when women had to risk their lives to end a pregnancy. The decision to have an abortion must remain one for a woman, not the government. And we will not go backward to a time before Planned Parenthood, when millions of women had no access to birth control or cancer screenings. We must go forward to ensure full reproductive justice for all women."},{"comment_id":"10153467160786323","commenter_b":"All I am saying is there is a lot of Muslim women who use to wear more colourful suits dresses in this country who are now covering themselves up in black!","commenter_a":"I remember the days when asian women proudly wore their beautiful coloured saris and gold bangles. We have only seen this change of dress code of wearing the Hijab and Burka since 9/11.","post_message":"\"I am wearing the hijab because I want to. Not because I am forced to. Yes, really.\""},{"comment_id":"1338481856248063","commenter_b":"Another woman with no self- respect!","commenter_a":"Typical racist coward","post_message":"He said the controversial chant he was heard yelling had nothing to do with Jews."},{"comment_id":"10154056074359749","commenter_b":"Your a hoe lets be honest","commenter_a":"Hope u keep some pics for your kids to see when they grow","post_message":"\"I am a mother. I am a wife, a sister, a daughter, an entrepreneur and I am allowed to be sexy.\""},{"comment_id":"1398961996812250","commenter_b":"Hhhh u wish loser umais .. our heels over u and ur terrorists logic","commenter_a":"So what stopped Iran from making a grand Muslim Allaince against Terrorists? Unfortunately Iran gave it a secterian touch by involving only shias in the fight against daesh. Iran did not reach out to any Muslim country to come and help them in fight against daesh or did they?","post_message":"Pakistan’s Defense Minister has confirmed that the country’s former Army Chief has been appointed as commander of a so-called Saudi-led military coalition."},{"comment_id":"10153405273244203","commenter_b":"@username those aren't feminists.","commenter_a":"What an absolute idiot! Feminism is the opposite of equality. Equality is equality, that's it.","post_message":"\"So to me, feminism is probably the most important movement that you could embrace, because it just basically another word for equality.\" Taylor Swift"},{"comment_id":"1719470721658124","commenter_b":"There illegals Zachary King..... there scared to death.....","commenter_a":"#Trump2016 TRUMP TRAIN","post_message":"Donald J. Trump has revealed how he would make Mexico pay for the wall. @webpagelink"}]
