[{"comment_id":"474408059350901","commenter_b":"Stay off their land!","commenter_a":"Err... They only kill white people because their other fellow tribes who join the \"democratic\" world suffered a lot of losses and they warned them. There is a documentary on this. You should check it out.","post_message":"Anyone who has ever tried to come ashore the island was attacked or even killed."},{"comment_id":"1113965658660810","commenter_b":"Arrest them sum bitches","commenter_a":"I don't know who wrote this, but it is fantastic! This is WHY Trump has such a following. Many have asked me if I support the republican party? Here is a letter someone sent to the RNC. You be the judge. Dear Representative, From the time I was able to vote I voted republican. I am 80 and have a great deal of respect and influence with hundreds of senior ball players who also network with thousands of others around the country. I received your questionnaire and request for money and strongly agree with every question as I have since Obama was elected. Unfortunately the one question that was missing is “What has the republicans done for the American people?” We gave you a majority in the house and senate and you never listened to us. Now you want our money. You should be more concerned about our votes not ...","post_message":"About 20 protesters were arrested on Thursday night outside a Donald Trump rally in southern California, where the Republican presidential front-runner was vowing to get tough on illegal immigration. Will this hurt Trump's campaign?"},{"comment_id":"1051849191502758","commenter_b":"Dirty lady lol","commenter_a":"I WANT PICTURES !!","post_message":"How do you measure up?"},{"comment_id":"10154350204712994","commenter_b":"Have mercy. We need the capital punishment you kill you should be killed","commenter_a":"Carl. , I feel the same way .","post_message":"She was with a friend, and they got in an argument with some people at a liquor store. They left -- but the group followed them for a few blocks and then started shooting."},{"comment_id":"555840684604224","commenter_b":"Look how christianity views woman it's almost as bad","commenter_a":"What confuses me is why women would want to stay in this horrific religion that view women and children less than animal's. Mohammed is dead he isn't coming back !!!","post_message":"Spread this..."},{"comment_id":"10154230428956509","commenter_b":"To protect us from bringing terrorists here. How can you tell if a Muslim is not an extremist?","commenter_a":"I don't think they should have to be Christians, just not Muslim.","post_message":"\"I don't know if you can prove that they're Christian... How are they proving it?\" Donald J. Trump said about Syrian refugees. @webpagelink"},{"comment_id":"10153648435169705","commenter_b":"Whatever!!!! She's 140 lbs. That's not fat at all. Smfh","commenter_a":"She is definitely not fat","post_message":"Don't ever tell Ronda Rousey what to do with her body."}]
