[{"comment_id":"10152730591461545","commenter_b":"^^Is there some kind of cream for that you think? LOL","commenter_a":"Just because it's on paper doesn't mean it is acceptable to God. Period.","post_message":"Sarah Goodfriend and Suzanne Bryant became Texas' first same-sex couple to receive a marriage license this morning. This is them speaking at a press conference in Austin.  MORE: @webpagelink"},{"comment_id":"1697203373859671","commenter_b":"All dems want is their vote!","commenter_a":"YES. Now Nutsy Pelosi wants to have more programs to 'prop up' immigrants. How doing something for Americans for a change?","post_message":"Are you ready? It only makes sense!"},{"comment_id":"10154366000234166","commenter_b":"Idiots. Careless. I will be glad to raise the baby.","commenter_a":"Betsy Carver ..unreal","post_message":"Police said neighbors found the toddler outside in 96-degree weather with no water. He was screaming, crying, and trying to get inside."},{"comment_id":"10153935063641636","commenter_b":"There is more evidence for the existence of spongebob than your nonsense.","commenter_a":"(B.A. Bible/Biology)* NOT MILLIONS OF YEARS OLD! Evolutionary dating methods are not infallible science, are based on certain built-in assumptions, and have been proven to be contradictory and inconsistent. Please read my popular Internet article, ARE FOSSILS REALLY MILLIONS OF YEARS OLD? There a lot of evidence that the fossil layers were not deposited by gradual floods, which would have required millions of years. Rather, the evidence strongly points to a one world-wide flood that fossilized species, just as the Bible teaches. The fossil layers in the real world are not even found in the sequence taught in evolutionary textbooks. There are many places where fossils of complex creatures are found beneath simpler ones, and there are fossils of mixed species existing in the same stratum which classic evolutionary textbooks teach should have been separated by millions of years. There is absolutely no proof of macro-evolution in the fossil record. ...","post_message":"BREAKING"},{"comment_id":"10153186263669411","commenter_b":"And what happens when two monsters get together? another monster!!","commenter_a":"ha ha ha America is a father England is a mother isis is a child isreal is a nanny","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154116667236002","commenter_b":"If this is true (drowning and family defense) she and her family need to be removed from the gene pool","commenter_a":"If people witnessed her letting her children drown, why didn't they help them?","post_message":"The family of a Texas woman accused of allowing three of her children to drown in a swimming pool is defending her."},{"comment_id":"679207482232542","commenter_b":"Criminal woman Brave !!","commenter_a":"Hillary is so brave for being a woman!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
