[{"comment_id":"10153806862081167","commenter_b":"Maybe the whole NRA could be recalled.","commenter_a":"The Cash Box Rules! ' Let's Make America Great Again' yeah right!","post_message":"After we called them out yesterday, Bud Light seems to realize that Ted Nugent's hate is bad for business."},{"comment_id":"1877645852479520","commenter_b":"Me thinks Conservatives protest to much! There was no outrage when Sen.Foley was exposed for pedophilia, in fact 36 other senators wrote impassioned letters begging for mercy for Foley. Trump bragged about oggling young girls naked at Teen Miss America and 46 million people didn't think it was a big enough issue to prevent a pedophile from becoming President. It is clear Conservatives sexual icing children is okay!","commenter_a":"Karma!","post_message":"BREAKING"},{"comment_id":"10153869125358812","commenter_b":"Why are Christians punished for praying. No one says others have to follow.","commenter_a":"Wow","post_message":"High school football coach suspended for praying at games attends as a spectator while  Satanists gathered outside of the stadium: @webpagelink"},{"comment_id":"834253316765245","commenter_b":"Send her back where she came from","commenter_a":"Put her in jail","post_message":"This is as low as it gets.  She is a traitor.   What do you think her punishment should be?"},{"comment_id":"10154648123623812","commenter_b":"'@username if Hillary would've have been held accountable 14 years ago, she'd be in prison.","commenter_a":"ABC news and the Washington Post- Lies. ABC headline is ridiculous. Newt Gingrich still backs Trump. The media is banking on people only reading the headline, and not the story.","post_message":"Newt Gingrich, one of Donald J. Trump's most ardent supporters and once rumored to be his vice-presidential pick, says Trump is 'proving he is more unacceptable' than Hillary Clinton."},{"comment_id":"1176020919129046","commenter_b":"People are saying trump is unfit to lead the country","commenter_a":"Guys I'm scared... Polls are showing crooked Hillary leading by double digits now.... Someone please give me a virtual hug and tell me everything is going to be okay","post_message":"Many people are saying that the Iranians killed the scientist who helped the U.S. because of Hillary Clinton's hacked emails."},{"comment_id":"1084090904983990","commenter_b":"TheresaStephens I don't know how you can say that. The police might have something on him and if they have he should be charged and locked up for life. And all the tax payers money your going on about let Cliff Richard pay for it if he's guilty, let the police seize all he's wealth and money and all go in police funds. If he is guilty he's nothing else but a dirty old C@@@ I don't care about he's Christian lifestyle if he is guilty he should go away. After all Theresa God hates sexual immortality","commenter_a":"Oh for goodness sake leave the man alone. I'm not a fan but, your innocent till proven guilty. So far they haven't proven a thing. I am sure there are plenty of unturned stones in the police force that need investigating?!","post_message":"Just in...."}]
