[{"comment_id":"10152655147557267","commenter_b":"Plain english","commenter_a":"No bill should be over ten pages long, nothing else added and in plain English a fifth grader could read","post_message":"I voted ‘no’ on final passage of H.R. 240, the Department of Homeland Security Appropriations Act of 2015, which was ultimately stripped of provisions to stop the President’s executive action on immigration. Read my full statement here: @webpagelink #idpol"},{"comment_id":"434665249991403","commenter_b":"Like Ms. Richards said \" get over it\"","commenter_a":"The supreme court has been and is political. It has jettisoned the straight forward and logical meaning of the Constitution in a growing social activism. The concept of heterosexual marriage has been intact from the beginning of historical time...until the present attempts to normalize the homosexual perversion . Legal liasons by contract have always been possible to all persons but the attempts to socially institutionalize and legally legitimize homosexual marriage as an equal and legitimate alternative to heterosexual marriage will never legitimize it. It may legalize it - but unborn baby murder is legal but will never be morally normal nor moral.","post_message":"Rick Santorum thinks that Congress should fight the Supreme Court if the court rules in favor of gay marriage. Is he right or wrong?"},{"comment_id":"10154212548441496","commenter_b":"You. Have got to be kidding He is a traitor to America and it's people","commenter_a":"That's a joke","post_message":"Agree or disagree: America is a stronger country after eight years of Obama."},{"comment_id":"10152961665786336","commenter_b":"Why would any of you morons disagree with Dr. Carson? As long as kids get vaccinated and as long as adults have already been vaccinated this Country can be protected from these diseases. Time for Obama to guarantee that anyone illegal immigrant be vaccinated...","commenter_a":"Just another reason why we need to CLOSE the borders, ENFORCE the laws already on the books and DEPORT all illegals. That means, NO AMNESTY for anyone.","post_message":"Fox News Sunday EXCLUSIVE: Dr. Ben Carson joins Chris Wallace with his stance on the vaccine debate and his plans for 2016. Check your local listings or tune in to Fox News Channel at 2p and 6p ET."},{"comment_id":"810137155781996","commenter_b":"If we wouldn't have killed them you would be dead by now","commenter_a":"Jebs brother George gave the go ahead to invade Iraq for something they didn't do leading to the death of over 500'000 innocent civilians. Jebs brother George. Jebs brother.......... Let that sink in. 500'000 men, women and children.","post_message":"The Obama-Clinton-Kerry team's stance towards Israel has been a disgrace. I’ll rebuild this crucial alliance."},{"comment_id":"1251860331547386","commenter_b":"She probably cheated..can't blame him","commenter_a":"Seems like all the guys in Berlin are pussies","post_message":"Cold blooded! #WSHH"},{"comment_id":"1323967450977057","commenter_b":"Golden showers for a golden girl!!!! LOL!","commenter_a":"He's gonna cry.........all the way to the Whitehouse!!!! LOL!","post_message":"Trump has never looked so pathetic."}]
