[{"comment_id":"1121293104578213","commenter_b":"A girl?!?? Good at a SPORT?!? Better insult her appearance!!","commenter_a":"Talking bout that horse face","post_message":"WNBA star Elena Delle Donne shared her free-throw secret and the encouraging words that drive her. - Erin Canty"},{"comment_id":"700385996818645","commenter_b":"We in America should do that too. The tree is evil, the fruit is isis and radical muslems.","commenter_a":"Thats what they want it makes them stronger. Causes more hate.","post_message":"Muslims are doing everything to stop him, but he won't relent. This might be what they have to do. Do you agree with his movement?"},{"comment_id":"10154141343121336","commenter_b":"Trump won every state TONIGHT and barely lost Ohio.. why is it even still a question of who WE THE PEOPLE want and NEED to get behind?? Wake up! #NoHillary","commenter_a":"Trump is a buffoon. Hillary will bury him in a landslide. We must nominate a person who could win in November...a ticket like Kasich/Rubio, Kasich/Cruz, or Kasich/Fiorina.","post_message":"“Here’s our vision for America: It’s an America with a brighter future. It’s an America with greater opportunity for our kids… It’s an American with more liberty and more safety and more security. It is America that is greater tomorrow than it is today and than it was yesterday.” – Ted Cruz"},{"comment_id":"743297559178019","commenter_b":"Dumbest fucking answer. Trump met with the black panther party and several top gang members from Chicago to reduce body counts and help fix the black community. Dumb asses mistake for deportation of illegals vs legal immigration. Left supporters are the dumbest people on the planet.","commenter_a":"Good !!! Just makes More room for the REAL PATRIOTS","post_message":"\"I'm not going to the White House. I don't feel accepted in the White House.\""},{"comment_id":"1056321337718549","commenter_b":"Racist bitch!!","commenter_a":"republicans say they are not scientists. Then they should keep their mouths shut about science.","post_message":""},{"comment_id":"10158514408340354","commenter_b":"@username first Trump wasn't ever going to win. Then he would never build a wall. Then Mex will never pay us back... See where this is going, fk nuts?","commenter_a":"A wall is a slab of steel reinforced concrete buried in dirt This man builds skyscrapers for a living What did those neanderthals think was going to happen lol","post_message":"WOW. WATCH:"},{"comment_id":"1705288253066676","commenter_b":"@username Building a wall is doable? Finding and deporting millions of illegals is doable? Banning Muslims is doable? Explain how","commenter_a":"So good looks qualify you to be VP of the USA? More reason to be afraid for our country. In addition to being racist and ignorant, this guy is shallow and beyond stupid (although we knew about the stupid part before)","post_message":"\"She’s got the beautiful looks,\" Eric Trump said. \"She's got — she’s smart. She's smart smart smart smart. ... She’s certainly got my vote.\""}]
