[{"comment_id":"10153470330831130","commenter_b":"Divorce first, then be a whore.","commenter_a":"To y'all bashing her.. this line right here says it all, \"In my marriage, I felt alone.\" - Divorce was inevitable. Period. THEN it says she met him when she was 17, they dated while she was in college, and got married once she graduated. Can you imagine if you married the person you dated at 17? It wouldn't work for a LOT of people.","post_message":"\"And just like that, my plans to spend the rest of my life with the man I loved and my best friend were crushed.\""},{"comment_id":"502242713299642","commenter_b":"Fire him","commenter_a":"Break his legs then he will have an excuse not to stand.","post_message":"This Muslim NBA Star refuses to stand for the U.S. National Anthem. How disrespectful. Regardless of religion, you need to respect our country. Do you agree this NBA player needs to learn some respect?"},{"comment_id":"10153003636601167","commenter_b":"Conspiracy--Huh,,,, Just MORE REPUBLICAN,,,LIES !!!!!------Why don\"t republicans want \" Regular Americans \" to have Obamacare ( ACA) ?????--HATE for the BLACK MAN, in the White House !!!!! Republicans,, STILL INSIST,,,,Racism Doesn\"t Exist ---YEA,,RIGHT !!!","commenter_a":"Not again \".,(;#!!:#$,:that Damn Obama. Lol","post_message":"LOL."},{"comment_id":"10153737001138812","commenter_b":"This lady is still working there??????????????","commenter_a":"why not go ask a Muslim cleric to marry them get married in a mosque","post_message":"Another gay Kentucky couple denied marriage license by controversial clerk: @webpagelink"},{"comment_id":"10154315361436656","commenter_b":"Shes a bi**h fr","commenter_a":"Let it go nothing or know one is perfect, and we surely can't do what she does on a good day! Let it go... Damn media!","post_message":"\"I'm trying to be a good sport here.\""},{"comment_id":"10155627747429778","commenter_b":"Suck it up snowflakes","commenter_a":"So great!","post_message":"#BREAKING Donald Trump surpasses 270 votes in Electoral College to officially win Presidency"},{"comment_id":"10154199913475530","commenter_b":"You told me about them n we used to look for my Riverland park","commenter_a":"@username Remember us searching for these when we were kids?! Lol","post_message":"Get outside and train your eyes onto the forest floor. Morel season is on in Michigan."}]
