[{"comment_id":"10155653992935389","commenter_b":"Obama's clusterf*ck !","commenter_a":"@username, I do not think either one of them have any care at all about this.","post_message":"Question of the Day: Do President Obama and Hillary Clinton owe the families of fallen troops an apology for pulling out of Iraq?"},{"comment_id":"697812187045401","commenter_b":"And the women who choose to cover their faces?","commenter_a":"Victory for the woman that are forced to cover their faces. Now they can feel the warmth of the sun, feel alive.","post_message":"Anyone caught will be fined about $541."},{"comment_id":"10154119917737234","commenter_b":"Donna anther corrupt politician","commenter_a":"Marine Waters","post_message":"Who Will Be The Next DNC Chair? The Vote Is Happening Now"},{"comment_id":"10153937537377894","commenter_b":"No wonder she's an Ex","commenter_a":"Wait. So she is saying he disrespected the flag, what he is doing is wrong, and after all of that she has the nerve to say he needs to be humble? The stupid ass Star Spangled Banner is NOT the Pledge of fucking Allegiance, first of all. I wish people would recognize that. Second, draft dodging is ILLEGAL, you \"allegedly\" advised Muhammad to do that and now you want to split hairs about the \"right way to protest\"? Third, how is he not humble and if he wasn't why should he be? Muhammad Ali famously talked all types of shit now she telling a nigga to humble himself, bih, go away.","post_message":"Girl, Bye! Muhammad Ali’s Ex-Wife Says Colin Kaepernick Should ‘Get Off His High Horse and Humble Himself’"},{"comment_id":"924300044274003","commenter_b":"Duh...He's a Liberal!!! He wants Fox to continue pying him, even thought he won't kick his alcohol and drug problem!!!","commenter_a":"Can you send Juan Williams with him?","post_message":"Bob Beckel isn't going to stay silent in the face of a harsh Fox News statement announcing his departure form the network."},{"comment_id":"10153644073950861","commenter_b":"They can get married with benefits now. What the hell else do they want?","commenter_a":"The Florda man is at it again","post_message":"The display, based on the holiday depicted in \"Seinfeld\", will be 6-feet tall, wrapped in the colors of the gay pride rainbow flag and topped with a disco ball."},{"comment_id":"10153081703864024","commenter_b":"AMEN!!! Don't let these racist win, because all the cops are going to do is profile and stop people that are poor or of color","commenter_a":"Mayor wrong direction","post_message":"The mayor made clear he's not planning a return to stop & frisk policing, saying “Going back to an unconstitutional, alienating approach is not only inappropriate and unfair to the populace, it doesn’t work.\""}]
