[{"comment_id":"1110454952404615","commenter_b":"She is nasty and mean.","commenter_a":"Yes she has","post_message":"MULTIPLE CHOICE QUIZ time, kiddies! Which answer did YOU choose? A or B? Enjoy and SHARE with 1M peeps! @webpagelink"},{"comment_id":"610314089143994","commenter_b":"How embarrassing for all women! Their class level is as low as Trump's. Is there an emoji of a puking face?!","commenter_a":"LOL. I wouldn't count on them voting for Trump. I doubt they've ever been in a voting booth.","post_message":"People started freaking out when the hashtag #TrumpGirlsBreakTheInternet started trending Sunday night."},{"comment_id":"1018381961551666","commenter_b":"Monthly periids dont count woman. Come up with another strategy","commenter_a":"Yeah.... you've got such a stellar record from Benghazi, who wouldn't want to go into battle at your direction?","post_message":"We can defeat global terrorism—but only if we don’t let fear drive our response."},{"comment_id":"493375190853061","commenter_b":"Ban muslims from holding a job AND ban them from welfare benefits! Starve them out of our country!!!","commenter_a":"Now I know why CVS has become so powerful in the insurance business. Owned by Muslims, friends of Obama. So many large companies are now making their employees use only CVS to get their medications. CVS charges more for all their medications. So wrong.","post_message":"His Muslim boss tried to harass him for being Christian, be he wouldn't back down.  Amazing. Let's show him we have his back.  Do you support his stand against his Muslim supervisor?"},{"comment_id":"10153302851129087","commenter_b":"@username Medicare advantage.","commenter_a":"The ACA made billions in cuts to medicare.......","post_message":"\"[W]hy do Republican politicians keep bringing up the idea of cutting or eliminating Medicare, a losing proposition among every voting group, including Republicans?\""},{"comment_id":"10155124264189679","commenter_b":"Lock this old hag up....","commenter_a":"No No No","post_message":"LIKE to support, comment to discuss."},{"comment_id":"10153703978899087","commenter_b":"How about the thousands that are killed by blacks themselves ! Never hear about that !","commenter_a":"Bernie listens, Hillary laughs and walks away!!'","post_message":"Emotional video posted by the Black Lives Matter movement shows Bernie Sanders comforting a woman whose brother was killed by police. READ MORE: @webpagelink"}]
