[{"comment_id":"1275227535851049","commenter_b":"she can go back to sleeping with cruz! lol","commenter_a":"When he loses, I hope this woman just disappears into obscurity, and gets to feel what it's like to be left behind by Trump. She's an ignorant tool.","post_message":"She had a meltdown after the host repeated Trump’s words verbatim."},{"comment_id":"1210989268913328","commenter_b":"Impeach this !!!!!!! Donkey Dicks ! Vote Trump","commenter_a":"How can you Impeach Trump??? He's not even President!!! Impeach the one in there now!! What the heck is the matter with people now a days??!! No common sense, want everything free, think they are entitled, scream racism at everything, destroy property with no remorse, get mad and just shoot people, not responsible for anything they do wrong, always due to their past or otherwise, no morals................ect..........And now talk of impeaching someone who isn't even President!!! America stand up and be counted for what is real, true, moral and right!! All Whiners can leave!!! Of course just my opinion! I know all will not agree, but \"Freedom of Speech!! My country, my Right!!","post_message":"Donald Trump doesn't have the GOP nomination and he hasn't been elected yet. But that is not stopping the effort to have him impeached the moment he might be sworn in as president"},{"comment_id":"10154938661994328","commenter_b":"She is so cold look at her eyes they are evil!!!! They are illegal they have already committed a crime breaking our law.","commenter_a":"These left-wing liberals keep saying illegals should not be asked about their immigration papers, or lack of, because then they won't bear witness against criminals. HeII, they don't anyway! The last thing illegals are interested in is going into a Court of Law! These people will suffer in silence before testifying against one of their own. It's time for a change. In Europe, everybody has a PassPort or legit I.D. And cops and soldiers can stop you at any time. You produce that I.D. or you go to jail. Simple. Time for a national I.D. in the States!","post_message":"Democrat leader sides with illegal aliens over mom whose son was murdered by one."},{"comment_id":"455025114688069","commenter_b":"yes","commenter_a":"CNN sucks","post_message":"Should Networks Like CNN Be Shut Down?  Comment 'yes' or 'no'"},{"comment_id":"10153622542063188","commenter_b":"No","commenter_a":"Get serious","post_message":"Would you sign it?"},{"comment_id":"10154964857609885","commenter_b":"Stfu","commenter_a":"Best. Winter. Classic. Ever.","post_message":"St. Louis and the Blues nailed this one."},{"comment_id":"10153762499342483","commenter_b":"@username but she taking millions of dollars from terrorist country and support Obama funding Iran and terrorist","commenter_a":"Why would anyone vote for lying Hillary","post_message":"Forecasters give Hillary Clinton a big chance to win, noting that the odds of her losing the race are about the same as an NFL kicker missing a field goal from the 20-yard line."}]
