[{"comment_id":"1624197824544119","commenter_b":"During the debate season, Hillary Clinton will mop Donald Trump off of the floor and dump him into the sewer with the mop water because she is 20x smarter than he is. She went thru 12 hours of gruesome testimonies with congressional republicans and didn't even break a sweat and was able to squash all of them like cockroaches. On the other hand, Donald Trump choked during a 1 hour meeting with the Mexican President and he choked and sweated bullets while being interviewed by Faux News Megan Kelly.","commenter_a":"Jordan Elum","post_message":"#Repost Ivanka Trump #Instagram ••••••••••••••••••••••••• Smooches from baby Theodore. 😘 #Latergram"},{"comment_id":"10154704030031323","commenter_b":"'@username Or you could just admit that you are fundamentally incorrect. That would be the mature thing to do here. You can't just use the serious topic of misogyny and sexism as an argument whenever you like. It plays a great disservice to the genuine areas where such a discourse is absolutely valid. This is about holding a proven heavily corrupted, belligerent war-mongerer to account, who happens to be a woman. End of story.","commenter_a":"Sorry Guardian, but no one actually buys the 'its because she's a woman' argument when it comes to Clinton. There are actually legitimate reasons why many do not like her. You're wasting your time.","post_message":"'Hillary Clinton irritates people not just because of her gender, but because we simply can’t process her narrative. There are no stories that prepare us for her trajectory through life and, therefore, we react to her as if she’s a disruption in our reality, rather than a person. We love public women best when they are losers, when they’re humiliated, defeated, or (in some instances) just plain killed. Yet Clinton, despite the disapproval that rains down on her, continues to go out there and chalk up wins.'"},{"comment_id":"1683593111700811","commenter_b":"That's why they have a little pill now called Plan B...take that the day after you're raped if you can't stand to carry the baby and put it up for adoption to a family who doesn't care how the child was conceived! Abortions, especially late term abortions are cruel and inhumane!","commenter_a":"It's planned parent hood they do a lot more then abortions. And @username women chose well some prolly forced so @username women got knocked up because they didn't practice safe sex. I thought women wanted the right to chose what they do with there bodies planned parent hood also helps with women's health who can't afford insurance or hospitals the government cut there funding right? So how can they help these people and if they closed right now you don't think @username people won't find someone else to do abortions. I promise if there not smart enough to use protection and pph closed you would see a lot of dumb young women ending up in ER with a coat hanger hanging out of them. Americans are such pussies anymore of it is not your baby or body and you don't know the person making there chose mind your fucking business","post_message":"Ugh why?!"},{"comment_id":"10156208561685354","commenter_b":"So is this a rally call to hate blacks or something? I mean, if SHE said it, then EVERYBODY in the black race must feel the same way, right? You extremists only care about the opinions of other extremists. Fuck a race war, fuck a holy war, fuck an unnecessary war.","commenter_a":"There is the face of a true racist.....","post_message":"“Right now we declare, it’s open season on a motherf–king cracker. All you motherf–king crackers y’all need to watch your motherf–king heads.”"},{"comment_id":"10152950804022434","commenter_b":"Just a bunch of liberal bitches that have no fucking brains. Their full of their self","commenter_a":"The view is always just a bunch of dumb bitches!","post_message":"Eggland's Best Eggs and Johnson & Johnson have pulled out as show sponsors."},{"comment_id":"401636356691325","commenter_b":"The rule applies to everyone. She needs to 'DEAL WITH IT!' End of story!","commenter_a":"All should live by the laws!","post_message":"'I don't want to take off my Muslim Head Covering in Court'..."},{"comment_id":"10153782447389094","commenter_b":"Ppl are making it one. So just fix it where only one person can use the restroom by themselves.","commenter_a":"Just make all businesses have two restrooms with one stall. And a lock on each door. Problem solved","post_message":"The states allege the government action has “no basis in law.”"}]
