[{"comment_id":"10153040394173984","commenter_b":"She needs to resign","commenter_a":"Starting with Obama","post_message":"This is downright despicable. Wait until you see how she's associated with Obama... Do you support removing this racist politician from office?"},{"comment_id":"867487780024323","commenter_b":". #TooChickenToDebate #ChickenTrump #ChickenShitTrump #ChickenHillary #ChickenShitHillary","commenter_a":"God bless you for being you Hillary.","post_message":"\"I have fought for the rights of women and girls here at home and around the world. It really maters whether women are treated with respect and equality, because when we do that, we are all better off, our economy is better off, our democracy is better off.\" —Hillary"},{"comment_id":"967763486668466","commenter_b":"Smart, educated women are actually voting for Hillary. Don't fool yourselves.","commenter_a":"What is it about the Democratic platform that is appealing? Higher taxes, weaker security, open borders, murdering babies, a very real risk of WWIII... ya'll must really hate America","post_message":"\"Get this Donald: nasty women are smart, nasty women are tough, and nasty women vote.” —Elizabeth Warren"},{"comment_id":"1259567494078669","commenter_b":"Just stop the CRYING,We didnt cry when Obama got in.Grow up!!","commenter_a":"Stupid is as stupid does.","post_message":"This just in..."},{"comment_id":"1120933471338794","commenter_b":"Lol","commenter_a":"These uneducated hillbillies dont care because they cant afford to buy a trailer anyway...","post_message":"Millions upon millions of his poorest voters just got terrible news."},{"comment_id":"10152955356009071","commenter_b":"I know I said LMAO, but really hit me up... could use the help. ;-)","commenter_a":"Dear anyone... please contact me if you're up for some pro bono work to sharpen your skills! Lmao!","post_message":"It's a known fact that hacking makes money. But how much money?"},{"comment_id":"10153029424263445","commenter_b":"You're a stupid ass welfare bitch. I can tell by your reaction","commenter_a":"Fuck you. You can't dictate what people do with their money. Plus, how do you know they don't have a kid with an awful disorder that benefit from pot? Your ignorance is showing. Check your privilege.","post_message":"ICYMI - Colorado Bans Use of EBT Cards at #Pot Shops"}]
