[{"comment_id":"1193174800771119","commenter_b":"@username and deport them","commenter_a":"Sounds to me like she's taken some pages out of Hitlers book: Meine Kaumph. Don't know if that is spelled right, but you get the idea. And I wonder how she'll feel about it when she reaches 80. (if she ever does).","post_message":"What's up with leftists having no problem 'taking people out'?"},{"comment_id":"485687248279822","commenter_b":"The problem is when she decided to do this job the law was different. Leave her alone. Why should she be penalized for her beliefs?","commenter_a":"she, does not want to work....so go home lady","post_message":"If you can't do your job, maybe you shouldn't have it..."},{"comment_id":"10154330471404087","commenter_b":"....because in a hostile foreign environment you may well have to...I say it's sound advice.","commenter_a":"We will make this World great again!","post_message":"Retired Gen. James “Mad Dog” Mattis once explained his life philosophy to fellow Marines as: “Be polite, be professional, but have a plan to kill everybody you meet.”"},{"comment_id":"901304566673644","commenter_b":"A woman's right to KILL her alive yet unborn child!!!","commenter_a":"Save the fetus- starve the child. They're not pro-life, they're pro-birth.","post_message":"Accurate."},{"comment_id":"10154296658174411","commenter_b":"@username Actually, no it wasn't in response to that comment. I wasn't responding to Andy Shitman anyway.","commenter_a":"imagine a group of 4 thousand russian troops on a boat alongside new york..... and then telling the us theyre acting aggressive.. LOL","post_message":"'Russia is acting in an extraordinarily provocative behavior'"},{"comment_id":"1203183663111217","commenter_b":"STFU","commenter_a":"Nothing Mr. Trump does compares with crimes Hillary and obama have committed.","post_message":"A prominent Republican who supports Donald Trump urged the candidate to start acting like “a potential leader of the United States.”"},{"comment_id":"10154780678681509","commenter_b":"The day has finally come when guys can legally go into a womans bathroom lol thats amazing","commenter_a":"There's no recorded incidents of trans people doing anything untoward in rest rooms - Republican Christian politicians on the other hand, there's lots! Ban them.","post_message":"It's deadline day for North Carolina Gov. Pat McCrory. The U.S. Justice Department says the state's controversial bathroom law is in violation of the Civil Rights Act and gave him until today to respond. McCrory says what he chooses to do goes beyond the Tar Heel state -- it will affect the majority of Americans."}]
