[{"comment_id":"10154056167770329","commenter_b":"For Christ's sake lady give it a rest!!! Please get yourself fixed and do my reproduce we don't anymore people like you. And if you've already reproduced I pray for your children. Now kindly fuck off and go find someone else to annoy. Seriously anyone else. The other girl got the message why can't you??","commenter_a":"So stupid. Blackface doesn't make someone racist.","post_message":"IMPORTANT REMINDER: It's never okay to wear blackface!"},{"comment_id":"1074625052604249","commenter_b":"Send tits hoe","commenter_a":"The title said don't ruin it. Dumbasses can't read or see a blunt 🙄","post_message":"Don't spoil!"},{"comment_id":"1342533789196332","commenter_b":"It's all the evil devil and god. God controls everything so all Christian's say. So he was obviously murdering babies in Syria with an American fleg while satana Satana was makin googoo sing good lol. It's the devil but. Fuk away aff to your backward bible ye balloons and leave the rest the world out your hilariously illogical book of fairytales. Batter still. Get one your mates to stab you in the eyeball so you get t meet Jesus sooner and save us having to see an read your hilarious pish from the days before people could read. Pol","commenter_a":"They all signed in blood, sold they're souls! Devils!","post_message":"Someone Removed Background Music From Lady Gaga’s Superbowl Show, And It’ll Give You Goosebumps"},{"comment_id":"10152864140411051","commenter_b":"She should be afraid not to file for divorce!","commenter_a":"Is time that she buys a gun and it will be the last time that he ever hurts her again.","post_message":"A mom was picking up her children from daycare when, all of a sudden – boom."},{"comment_id":"10153677754598037","commenter_b":"All these females asking for equality. \"Wait, we don't want that equality.\" Sleep in the bed you make.","commenter_a":"Why are you women saying no? Cry for equal rights then don't want the same responsibilities as men.","post_message":"Do you support requiring women to register for the draft? If passed, 459,000 women in Texas would be eligible."},{"comment_id":"1240086616006505","commenter_b":"Animals r strange voters... They will vote with the Jews.","commenter_a":"Who? Never heard of him.","post_message":"And then he said where he promises to MOVE if Trump DOES win..."},{"comment_id":"992971160795677","commenter_b":"Jean Russ Awwww Jean you're so sweet. But Cruz has just shot himself in the foot again with the phony Obama-Rubio photo shot. What is this guy Cruz doing? Sabotaging his own political aspirations? Digging a hole like a mole; no eyes; no direction; tunneling is a blind panic of a junior Senator?","commenter_a":"I just voted for the best GOP candidate in 32 years! I voted for @username!!!","post_message":"TOMORROW: Join me and Phil Robertson \"The Duck Commander\" in Myrtle Beach or Charleston. RSVP here: tedcruz.org/south-carolina"}]
