[{"comment_id":"1265311083486900","commenter_b":"Why would the GOP, composed exclusively of embittered liars, care?","commenter_a":"IT'S CALLED THE TRUMP BUBBLE, AND IT'S FILLED WITH A LOT OF HOT AIR...","post_message":"Truth, logic, reason and consistency don’t seem to count for very much in our political discourse these days - especially when it comes to Donald J. Trump. Author and media commentator Neal Gabler explains why the mainstream media is letting Trump get away with it."},{"comment_id":"10154051337399411","commenter_b":"Are you sane, woman?","commenter_a":"A scientific theory is a well-substantiated explanation of some aspect of the natural world that is acquired through the scientific method and repeatedly tested and confirmed through observation and experimentation.","post_message":"If you have proof: bring it. If you do not: acknowledge openly that you have theory perhaps a well-honed, much loved theory, but a theory nonetheless. (Op-Edge by Sam Gerrans)"},{"comment_id":"827089443993145","commenter_b":"First Lady??? Really","commenter_a":"Ignore ....WHAT A WASTE OF CIVILATION","post_message":"Is she serious?"},{"comment_id":"10153290189835329","commenter_b":"Ja, desv :'(","commenter_a":"Kathrine Malmqvist passer det?","post_message":"BREAKING: Zayn Malik is officially leaving One Direction."},{"comment_id":"10153379437614411","commenter_b":"To Turchinov's bitches.","commenter_a":"Ukraine have just had a 175 Billion dollar loan about 3 weeks ago, Plus a 1.8 billion dollars this week from the EU and now they are getting ready to default on these debts. Could someone please tell me where all the money has gone in such a short space of time????","post_message":""},{"comment_id":"1858429714391337","commenter_b":"Canadian has no say. Go home","commenter_a":"He's a fat, ugly, ignorant pig. Hit the sty.","post_message":"Simply pathetic."},{"comment_id":"1276041149107332","commenter_b":"Just another moronic Hollywood actress.","commenter_a":"Idiot no but of Obama and kilary have their way then you need to worry cause people like me want save you from the Muslims you help let in our country","post_message":"SARAH JESSICA PARKER FEARS She'll Be Attacked And Killed If Trump Is Elected…LOL! Has She Not Seen MULTIPLE TRUMP Supporters Who've Been Bloodied By Hillary's Lib Mobs? [VIDEO]"}]
