[{"comment_id":"10157348799105354","commenter_b":"Liberals shouldn't be allowed to breed..","commenter_a":"Yay! We can murder the helpless!","post_message":"Here are their celebratory pro-abortion tweets..."},{"comment_id":"10153530679413984","commenter_b":"I hope she gets jail time!","commenter_a":"Some beasty mom will kick her face in I'm sure. As a Juvinal little will happen to her in our current legal system.","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"},{"comment_id":"1208055202644589","commenter_b":"F*** GLOBALISM","commenter_a":"This country is in bad shape","post_message":"And the brainwashing starts. Included in the curriculum will be globalism too. Yaaaayyy... @webpagelink"},{"comment_id":"10152564279192623","commenter_b":"Notice everytime it moves up and down is when she brakes. It falls forward when she brakes. And honestly this woman in the front car has been a menace for a while now! It's about time someone got proof of her ridiculousness.","commenter_a":"the cops were called. she started in back of driver redneck lady tried to run lady and child off road first time. and slowed down to let the other in front. the phone was in a dashboard holder while taping driver not holding phone.","post_message":"WATCH: Road rage out of Randleman.   Just tilt you head and wait until about the 3-minute mark.  Egads.  Warning: Language and gestures may be offensive to some."},{"comment_id":"10156887460220093","commenter_b":"@username @webpagelink","commenter_a":"Trump is a die hard Liberal","post_message":", I lived in New York City and Manhattan all my life, okay? So, you know, my views are a little bit different than if I lived in Iowa, perhaps. -- Donald J. Trump"},{"comment_id":"10153197145938721","commenter_b":"My Eulogy: @webpagelink","commenter_a":"Welcome HTML5 banners.","post_message":"With Google putting the brakes on Flash in Chromethe world most popular web browseradvertisers will need to seek other ways to get their messages out."},{"comment_id":"10152881213667894","commenter_b":"Ciara can't sing, same songs to a different beat. She can compare herself to Mya or Ashanti who is and was a bigger artist then Ciara","commenter_a":"Hits yes, talent, no","post_message":"Do You Agree? Ciara Says She’s Had Hits 'Just as Big' as Beyoncé and Rihanna"}]
