[{"comment_id":"10153270009391770","commenter_b":"This woman is nuts!","commenter_a":"The is one key word in all this ....... ILLEGAL. not legal It's very simple if your here illegally you get sent home. There are proper ways to become a citizen. Many many people have done it. If two illegals have a baby that baby is not now a citizen. If 2 people break in you house and have a baby. Is that baby now part of your family well. No","post_message":"MSNBC host Melissa Harris-Perry on Saturday likened the Obama administration’s deportation of illegal immigrants to “a fugitive slave law” during a discussion about Flint, Michigan’s illegal immigrant community being reluctant to accept clean water aid out of fear of being deported.  Read more: @webpagelink"},{"comment_id":"10154465654928908","commenter_b":"@username Now you want to talk about owning slaves, I don't know, maybe you do, but it is the year 2016... time for major changes in this world....","commenter_a":"Is this a good thing or a bad thing... killing of new born male chickens is a bad thing, but now genetically creating only females doesn't seem right... maybe people should just quit eating chickens.....","post_message":"Newly developed technology will determine the sex of each fertilized egg before the chick inside develops - enabling the removal of all male-identified eggs from the hatchery. This will eliminate the industry need to heartlessly grind male chicks once hatched"},{"comment_id":"10154478047941051","commenter_b":"Well one girl just said that is white privilege so thats why you got to play with guns.","commenter_a":"I never liked Sarah Palin but don't see her grandson playing with a toy gun as an issue(key word being TOY here). I recall having a few toy guns as a kid myself and certainly didn't grow up to be a serial killer or anything of the sort.","post_message":"Bristol Palin is coming under fire after what her 8-year-old son is doing in this viral picture"},{"comment_id":"1026504997444125","commenter_b":"God Bless this good hearted little boy. May he heal fast. 🙏❤️","commenter_a":"in my prayers...","post_message":"So sad.  A 7-year-old boy who spent 2 years growing his hair out to make wigs for cancer victims has found out he has cancer too.  Prayers for little Vinny. Details:  @webpagelink"},{"comment_id":"10153596385394740","commenter_b":"She lied on the form. If she is able to pass a background check she is going to pass a background check. It's not going to stop her from buying it for someone who can't legally buy it. Criminals will get guns no matter what laws are passed.","commenter_a":"This can't be! Everyone knows that background checks stop gun crime!","post_message":"Prosecutors say her boyfriend, a convicted felon, gave her money and told her what to buy."},{"comment_id":"516205071910642","commenter_b":"The white lady isn't a part of the scam, but she made upwards of a million dollars in a year, okay ojay,we believe that the white woman's hands are clean, not!!!","commenter_a":"This a way to steal African children, a form of modern day slavery. African children was stolen from their parents over 400 years ago, and they were paid to do that then. What is wrong with you people?","post_message":"Watch How Thousands of Children Are Currently Being Stolen From Africa"},{"comment_id":"10154789574398132","commenter_b":"Sick people. Why do they need a child when they are idiots","commenter_a":"This is disgusting!!! Hope they rot!! That poor baby. I'm sure he has seen this many times in his short life. I'm sad for him.","post_message":"Ohio police have posted shocking photos of unconscious adults  who they believe overdosed on heroin."}]
