[{"comment_id":"10153753103761037","commenter_b":"@username tell me that in 12 months... no Bernie, no Trump, no Clinton and no JEB... then who's left? Let's talk again when there's only days left of this nonsense.","commenter_a":"Jim Webb won this debate: he got more exposure out of the media tonight than he has had since he began his candidacy. Compared to Clinton he looks honorable, compared to Sanders he looks responsible. Since those two are the media darlings, those are the only two he needs to be compared to until he can get out of single digit polls. If any of those candidates expect to get moderate Independent and Republican voters next fall, they need Webb on the ticket… unless Trump manages to stay in the race.","post_message":"Bernie Sanders defends his record on guns after Hillary Clinton pounces. #DemDebate"},{"comment_id":"943090809073276","commenter_b":"Why do women need to vote anyway?","commenter_a":"I would say that's higher than 44%","post_message":"Yep..."},{"comment_id":"1229557370394944","commenter_b":"The GOP doesn't like it when the democrats do to them what they had been doing to the democrats since Obama was elected.","commenter_a":"Games. . .ugh! Both sides need to just stop them!","post_message":""},{"comment_id":"10155247808221729","commenter_b":"Jill stein was just in it for the money! She pulled one over on her own people.","commenter_a":"When will these #NOTMYPRESIDENT jerks learn. Get over it. If Hillary would've won we would be over it and preparing for all the bad she'd unleash on the USA!","post_message":"EPIC FAIL."},{"comment_id":"1835608856683220","commenter_b":"What shut the fuck up","commenter_a":"Nazi Supremacy! Disgusting Asshats!","post_message":"The university stated that Richard Spencer's views are 'in direct conflict with our core values.'"},{"comment_id":"610785519070224","commenter_b":"Check that woman's mouth for raw....","commenter_a":"Keep in mind, these people are not working real jobs.","post_message":"Has anyone seen this Fox host's soul? It appears to be missing.   -Conover"},{"comment_id":"668184586705453","commenter_b":"Yes ; has been, is, and always will be!!! She is truly an ugly American.","commenter_a":"Nice eyebrows, plucked clean and then painted on............banchee","post_message":"Michelle Obama wants to destroy Halloween for kids across America.  There is no chance that we will let her take Halloween away from our kids.  Do you think Michelle Obama is a joke?"}]
