[{"comment_id":"10153832983220950","commenter_b":"Bitch u just said a bunch of racist shit now","commenter_a":"Yes, he did behave badly but, those two athletes who chose to speak out against the country they were sent to represent, the country that has supported their goals, trained them and gave them the tools they needed to succeed in their sport, should face the same fate as Lochte.","post_message":"Speedo wished Ryan Lochte well, but said it \"cannot condone behavior that is counter to the values this brand has long stood for.\""},{"comment_id":"10154595808829445","commenter_b":"Pot head moms, guiding their children. What a joke ........","commenter_a":"Craig Roberts Me as a parent.","post_message":"This mom clearly thought it was high time for the kids to go back to school @webpagelink"},{"comment_id":"10156981805725725","commenter_b":"Someone should exterminate these lowlifes","commenter_a":"You sorry protesters making violence! Mr. Trump paid for that rally in Cali you only making yourself look bad @username will even make America great for you guys. Stop making yourselves look like fools!! Thanks Bernie for the awesome soundbite!! I think that is personally the best campaign slogan to help @username. \"Hillary Clinton had bad judgement.\" @username 2016!! MAGA! Get out and vote Indiana and California!!! We are behind you 100% Mr. Trump in Mississippi!! My in laws in California are voting for @username!! Across the nation Trump 2016!! Your vote matters love America and vote Trump!","post_message":"Thank you Costa Mesa, California! 31,000 people tonight with thousands turned away. I will be back! #Trump2016"},{"comment_id":"10153935063641636","commenter_b":"There is more evidence for the existence of spongebob than your nonsense.","commenter_a":"(B.A. Bible/Biology)* NOT MILLIONS OF YEARS OLD! Evolutionary dating methods are not infallible science, are based on certain built-in assumptions, and have been proven to be contradictory and inconsistent. Please read my popular Internet article, ARE FOSSILS REALLY MILLIONS OF YEARS OLD? There a lot of evidence that the fossil layers were not deposited by gradual floods, which would have required millions of years. Rather, the evidence strongly points to a one world-wide flood that fossilized species, just as the Bible teaches. The fossil layers in the real world are not even found in the sequence taught in evolutionary textbooks. There are many places where fossils of complex creatures are found beneath simpler ones, and there are fossils of mixed species existing in the same stratum which classic evolutionary textbooks teach should have been separated by millions of years. There is absolutely no proof of macro-evolution in the fossil record. ...","post_message":"BREAKING"},{"comment_id":"10153207458909135","commenter_b":"Cindy- don't conern yourself with the three blind mice","commenter_a":"What lies are you planning on telling today? How are those donors and polls coming along?","post_message":"On the radio with Laura Ingraham now. Listen live here: @webpagelink"},{"comment_id":"10153203354164071","commenter_b":"I also voted for Romney and would do it again. The Presidency was 'stolen' from him.","commenter_a":"Vice President Romney","post_message":"Mitt Romney just unloaded on President Barack Obama's foreign-policy legacy."},{"comment_id":"697292770461301","commenter_b":"I hope you're right Jim!! God help us all if she gets in!!","commenter_a":"She is a major disgrace to the Democratic party. If she is all they got, Forget next year's election. They don't a chance in hell.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"}]
