[{"comment_id":"10154459292584138","commenter_b":"Right!!!","commenter_a":"What about bengizi, emails, her picks for judges, say goodbye to our Constitution, and gun rights, i could go on and on. Can anyone name 1 thing she has done positive for this country.....","post_message":"At CHS Field, people are casting their votes - with bobbleheads! People can 'vote' and get a bobblehead of Donald Trump or Hillary Clinton at the door. The first bobblehead to run out wins the 'Bobblection.'"},{"comment_id":"968715303188218","commenter_b":"There's a problem with this ???? Just a couplah boyz havin' some fun !!!","commenter_a":"Now thats how you settle a score without using violence. !","post_message":"This is NOT what fireworks are for"},{"comment_id":"10155895547455354","commenter_b":"Prayer's for his family and the woman that survived this crime. Where is the FBI, the commander in chief & brother Sharpton?","commenter_a":"There are no words for this outrageous act of hate. Hope they find the black sons of britches that caused this. Praying for the family......GOD BLESS YOU","post_message":"The other person in the car, who survived the wreck, says it wasn't an accident..."},{"comment_id":"966904363440661","commenter_b":"Says the liberal tard cat lady","commenter_a":"What would you expect from a woman with 1000's of nude/lesbian porn pics on the internet to wear? She's a hoe and trump a con artist. The Whitehouse is going from class to trash.","post_message":"When people saw what Melania Trump wore to mass, they were simply outraged. Do you think what she wore was appropriate?"},{"comment_id":"401125753409052","commenter_b":"Josh go live with the muzzies and obey THEIR laws in their land!!!","commenter_a":"It should be like that in America, too!","post_message":"'I don't want to take off my Muslim Head Covering in Court'..."},{"comment_id":"10153975283176336","commenter_b":"Nothing will happen with her, its just a power game","commenter_a":"She disgusted me and betrayed all women who've suffered mistreatment at the hands of their men when she went back to that crumb of a husband of hers...they deserve each other!","post_message":"Earlier on 'America's Newsroom,' Fox News contributor Katie Pavlich said Hillary Clinton must answer for her role in former President Bill Clinton's scandals. What do you think? @webpagelink"},{"comment_id":"10154343066022507","commenter_b":"'@username But they were to be submissive to white brutes if married to them. And she was married to a white brute. Her lies did not influence either Till's murder or the trial's outcome.","commenter_a":"People are quick to point out how different things were back then for blacks but don't forget how different they were for women, especially in the Deep South. What she did was horrendous, don't get me wrong, but I have no doubt that she feared for her own life. She was married to a man that could commit that kind of a crime. The article said that she was hidden away around the time of the trial with HER HUSBAND'S FAMILY. Don't you think she was threatened by them? I have no doubt of it. Being a women, even a white woman, was only marginally better than being black down there at that time. She will answer to God but, have no doubt, she has had to live with the knowledge of what she's done and had reminders along the way of what that entailed with reminders in her own ...","post_message":"60 years after this poor boy was brutally murdered, she finally admits the truth?"}]
