[{"comment_id":"344636695739845","commenter_b":"all of these OLD STUPID WOMEN & MEN sould be fired for not doing their job","commenter_a":"I saw her on TV....She's an Idiot !","post_message":"Democrat Leader Calls Israeli Leader and says He Doesn for Her"},{"comment_id":"1099414256845409","commenter_b":"No. We will still vote Republican democrat too far away from Christian beliefs","commenter_a":"DNC thugs started the riots.","post_message":"“I will respect that he’s the President, but I’m going to fight every single day to make sure he’s one-term,” a New York protester said of Donald J. Trump's election victory @webpagelink"},{"comment_id":"10156440483580492","commenter_b":"Elouise faux? Why even post this garbage?","commenter_a":"Nah, it was just ratatouille ...","post_message":"Rats may love eating our finest delicacies, but they don't belong INSIDE of them."},{"comment_id":"1080954051971524","commenter_b":"We will celebrate when she leaves the White House!","commenter_a":"How about a national party when they move out of our house???","post_message":"Would you be COOL with this? Or does the thought of this make you gag?"},{"comment_id":"1113642245398693","commenter_b":"Ummm....which part of the Constitution did he need help reading again ? Seems like the Constitution is only good for these biggots when it works in their favor...picking and choosing again...no wonder this Country is in such shambles right now. Get over it Ted Cruz...get over it.","commenter_a":"The thing is, how do Republicans make the, \"follow the constitution\" argument after this? The constitution is clear, that the President must nominate a Supreme Court Justice when there is a vacancy. Where in the constitution does it set a time limit based on when the vacancy occurs?","post_message":"Senator Ted Cruz tweeted: \"Justice Scalia was an American hero. We owe it to him, & the Nation, for the Senate to ensure that the next President names his replacement.\""},{"comment_id":"475322915991622","commenter_b":"Tell them to go home","commenter_a":"If they do not like it then go back where you came from","post_message":"Muslims on welfare have finally gone too far. Enough is enough. We need to let these Muslims know that they can't come into our country and force their beliefs on us. Do you support Muslim deportation?"},{"comment_id":"461301070747634","commenter_b":"They are ILLEGAL!!! It should not be allowed!","commenter_a":"No illegals have no right to vote in our country's elections. The democrats are destroying this country. Wake up is a phone worth your vote. Honestly look around are you better off now than 8 years ago. On the economy I blame both parties!","post_message":"BREAKING: Obama Launches Plan To Allow Illegals To Vote In Next Election They are not citizens of our country, and should not be allowed to vote. Do you think this is wrong?"}]
