[{"comment_id":"1214061615292067","commenter_b":"@username Just WHAT is racist about wanting to put up a wall to help keep illegals out of our country? What is racists about wanting to deport those illegals who are here? Since when did ILLEGAL become a race?","commenter_a":"I got my country back and I'm not giving it up to some drunk retarded ignorant fool like Palin","post_message":"Sarah Palin says it's time for everyday citizens to take our government back. Do you feel the same way?"},{"comment_id":"1150215321713025","commenter_b":"Yes and I only saw a women that look drugged","commenter_a":"YES YES YES! Are you guys blind. I only saw a pathetic man sniffing,drinking water, making faces. acting like the idiot he is. Never answered a question. Talked about himself. Never said what he would do as president. Next to him stood a confident women who answered questions, with plans for our country future.","post_message":"Would you like to see Hillary Clinton win big this November?"},{"comment_id":"10153708782186350","commenter_b":"Michelle ovomit is the washed out hag!","commenter_a":"Michelle Obama is a wonderful woman who deserves respect. She didn't do anything to you. Stop acting like 12 year old bullies and grow the hell up","post_message":"Find out what Michelle Obama can't wait to do once she leaves The White House."},{"comment_id":"1083781141676265","commenter_b":"It has proven once more that U.S are serving the Wahhabism in the region in return it get many from the Saudi Royal family. no matter to U.S how dangerous the wahabi are what extreme threat poses to civilization.","commenter_a":"Muricaaaa","post_message":"The Russian foreign ministry said the attack had jeopardised the US-Russia agreement on Syria."},{"comment_id":"1920926941484648","commenter_b":"Worst president ever... and she's never been a First Lady... low class trash is what she is!","commenter_a":"Not at all","post_message":"Are the Obamas a good representation of the American people?"},{"comment_id":"10153773404108984","commenter_b":"You Gotta Love America !!! :) I Do !!!","commenter_a":"Go Obama.","post_message":"The head of the National Sheriff's Association just threw down and issued a blunt threat to Barack Obama. This cop isn't going to take Obama's anti-cop attitude any longer, and now he's going to do something about it. This is awesome."},{"comment_id":"1182572491799444","commenter_b":"Mj we are talking about the ones that come here and are here illegally. You became a marine and I bet you did it the right way. Now we have a big problem with terrorist that are sneaking into all the countries. Sorry but we have to take care of all Americans first. You have to admit a country can only hold so many. Thank you for your service I am a vet myself so are my son and daughter.","commenter_a":"All these racist comments and generalizations. You should all be ashamed. I am cuban and came to the US. Im sure not many of you can say the same but i actually benefitted from government programs. I served our countries military as a marine, i hold three different degrees - accounting, finance and im a registered nurse- sonif an immigrant is taking your jobs then you didnt take full advantage of what the US has to offer, no just arrived unprepared laborer will ever take any of thoae jobs from me. I love thia country but i hate people like you that put down immigranta that only want to make a better life for themselves and family. You are whats wrong with the US today!","post_message":"Right?"}]
