[{"comment_id":"10155637604520354","commenter_b":"BO is merely the `uncriticisable blackface` of liberalism. Hillary is much more evil because she knows what she is doing.","commenter_a":"Obama has a plan....and it's working.","post_message":"This is what Obama calls \"defeating ISIS\"?"},{"comment_id":"10153622787011336","commenter_b":"Michelle Obama and Obama need to go!","commenter_a":"Both the schooling and the feeding of the children of the USA should remain at the local levels. We don't need an untrained fool to tell us how to raise our kids.","post_message":"Public schools are continuing to serve the federally mandated fruits and vegetables, but a new study claims the fresh produce is going into trash cans more than tummies."},{"comment_id":"10154403030526523","commenter_b":"@username your a pussy.","commenter_a":"TRUMP IS A FLAMING HOMO","post_message":"President-elect Donald Trump responds to a new poll from CNN/ORC which found that he has an approval rating of just 40% ahead of his Friday inauguration. @webpagelink"},{"comment_id":"10152736436045496","commenter_b":"negative much?","commenter_a":"Where was the GoFundMe started for her? She lost her job after having a gun shoved in her face, did anyone start a fundraiser? If they did was the link shared? Hundreds of thousands of dollars raised in the name of hate and not one single penny raised for a working MARRIED mother who valued her life over a companies money. Yep, this is indeed a \"Christian Nation\".","post_message":"The pregnant Popeyes manager, who was fired less than 36 hours after a robbery, has been offered her job back. See more: @webpagelink Would you go back to work for the restaurant?"},{"comment_id":"10153190438888812","commenter_b":"Plus many red states consider sand and salt a slippery slope toward Socialism.","commenter_a":"All the Yankees talking about \"that isn't snow!\" Must not realize how right they are. It's ice. It's infinitely more dangerous and icy in the south than it ever gets in the north.","post_message":"WATCH: \"It's over\" -- Snow and ice are still triggering dangerous, cringeworthy conditions on roads in much of the eastern US, including this Huntsville, Alabama, neighborhood - ABC News Weather"},{"comment_id":"902128633188334","commenter_b":"I talked to my next door neighbors about the illegals. They were very verbally upset with the illegals. You see their whole family was born in Mexico and they all moved to Oklahoma Legally. The man told me it took them almost 12 years to get the whole family here. BUT they could have paid smugglers and had them all here in 2 years. They hate the illegals also. They said they give the rest of the Mexicans a bad rep.","commenter_a":"Welcome and thank you for doing it the right way","post_message":"Americas Freedom Fighters"},{"comment_id":"1121854401168903","commenter_b":"Stfu fat bitch","commenter_a":"Is it because they're assholes?","post_message":"They spend their lives eating rotten meat - so why don't they get sick?"}]
