[{"comment_id":"667824530017395","commenter_b":"THROW them out of the country after incarceration. This disgusting behaviour does NOT belong here","commenter_a":"Yet no justice for the douggler girls.......","post_message":"GROSS."},{"comment_id":"10153826016756680","commenter_b":"Trump's no. 1 fan has a warning for us. David Duke Warns If Hillary Is Elected Black Men Will Rise Up, Kidnap White Women From Walmart And Rape Them ! The Republicans little secret that Trump exposed. 40 percent of them are racist and were dormant waiting for an opportunity like Trump. Vote blue from the top of the ticket to the bottom","commenter_a":"Thank you Hillary. As a gay man I understood it took you a while to get where you are, but I applaud you for your commitment to stand up for LGBT rights. #ImWithHer","post_message":"The NCAA announced it will relocate all of its championship events from North Carolina scheduled for the current year."},{"comment_id":"10155339234553132","commenter_b":"Why have this girl on TV really it is ridiculous !","commenter_a":"Take all her electronics away....and Danielle's too!","post_message":"Danielle Bregoli is back, and she not mincing words."},{"comment_id":"10154141762806162","commenter_b":"Wild animals!!!!! trump is the wild animal causing all this bs PIED PIPER !!!","commenter_a":"People need to stop blaming Trump for the actions of low life people. They get out of hand, then don't want to own up to their actions. It's the generation of placing the blame elsewhere. Trump didn't tell them to act like wild animals. That's just how they act.","post_message":"'We're going to take our country back from 'these people,'' Trump told supporters after his canceled Chicago rally. 'These are bad, bad people.'"},{"comment_id":"1065131623520589","commenter_b":"R.I.P.","commenter_a":"Awwww, RIP, Al","post_message":"RIP Al from Happy Days. He passed away on Friday at age 96."},{"comment_id":"10152962989707014","commenter_b":"Get rid of illegal non English speaking students whose parents pay no taxes and there will be loads of $ and all the scores will magically rise. I wonder what it would be like if American students were able to get attention in class?","commenter_a":"My daughter started at a Charter school when she was 4 years old K-6, proceeded to a public school in Jr High which she had to test into she was then placed in ALL honor classes and has maintained a 4.0 gpa now on her way to High School on Wednesday at the age of 13....So thanks Charter schools!!!!","post_message":"There's a huge waiting list to get into in a Valley Charter school. Find out why some 1,000 parents hope to get their kids enrolled."},{"comment_id":"1729274910624261","commenter_b":"'@username well then","commenter_a":"Donate this to where the world needs 😩","post_message":"Science at work - The LifeStraw.  The LifeStraw removes at least of 99.99999% of waterborne bacteria and 99.9% of waterborne protozoan parasites. It can filter up to 1000L of water.   Throughout the world, an estimated 884 million people still do not have access to clean sources of water. This device contains no chemicals or batteries and makes it possible to drink safely from any river, lake or puddle.  Buy them here: bit.ly/1YbTja9  For every unit sold, two children in the developing world will be supplied with clean drinking water for a year."}]
