[{"comment_id":"10153283394148984","commenter_b":"She needs to be in the big house not the white house","commenter_a":"Grill her ass !","post_message":"Trey Gowdy has invited Hillary Clinton to testify, in private, on her decision to delete thousands of emails from her private server as well as the full scope of her responsibility in the 2012 attacks at Benghazi. Let Rep. Trey Gowdy know how you feel and customize an email just for him!"},{"comment_id":"10154134849200695","commenter_b":"Sorry that you have to know the pain :( if you want to follow along like my page @username Walks ..I'll be posting updates there along the way","commenter_a":"I am walking across America this year in honor of my sister who died of an overdose. I am going from Delaware to California and telling people about this epidemic and about Good Samaritan laws that protect people from going to jail if they call 911 for help when they see someone overdosing. @webpagelink","post_message":"A powerful new drug is triggering a spike in overdose deaths in Atlanta & across Georgia. Where the pills are coming from and the urgent warning from experts at the CDC, today at 5."},{"comment_id":"932964430158104","commenter_b":"I wish we could deport ALL these crazy ass idiots!","commenter_a":"This woman and Palin and others like her are enemies of the state in my opinion! Shame on them for spewing their damage.","post_message":"WOW."},{"comment_id":"10152731106111051","commenter_b":"Yet if you speak out against it, you are \"behind the times\" or \"living in the past\". We need to turn the clock back about 50 years to see what a moral society looks like and I am not just talking about the gay agenda. I am talking about adultery, divorce, teenage pregnancy, children born out of wedlock and anything else that used to be immoral that we are forced to accept today.","commenter_a":"Um, did they leave the word \"incest\" out of the story on accident??","post_message":"This girl never really knew her father – until they ended up dating."},{"comment_id":"10153408842481162","commenter_b":"Beautiful and God BLESS you both!!!","commenter_a":"Wonderful","post_message":"BEST. GIFT. EVER! Steven Turner Jr. was set to walk across the stage at his high school graduation, when there was a pause in the ceremony. \"I got really worried and nervous, I thought she forgot my name,\" Turner said. But on stage there was more than his diploma waiting for him. His mom, Petty Officer 2nd Class Vera Turner, surprised him with open arms. She had been deployed with the Navy for the past 9 months, and returned home just in time to see her son graduate. FULL STORY: @webpagelink"},{"comment_id":"892607410865802","commenter_b":"As far as an analogy, this is not \"I don't agree with you so I get to beat you.\" This was more like \"you're an abusive boss and I will not be quiet about it.\"","commenter_a":"I find it funny how these pro Trumpers freak out and say how violent Bernie supporters are when in reality it is Trump's hate filled rhetoric that instigates this reaction. God help us all.","post_message":"Californians are having none of Donald Trump's bigoted hate speech."},{"comment_id":"1125811740844678","commenter_b":"That is one crazy bitch!","commenter_a":"Am I dreaming?! Bernie supporters BOOED Nancy Pelosi?! Well, YAY! Be still my trembling heart! It couldn't happen to a \"nicer\" Democrat...except for ol' Hillary!!","post_message":"Hard not to enjoy this"}]
