[{"comment_id":"1194642483887307","commenter_b":"Still need to deal this evil bitch a Blow","commenter_a":"easy defense... animal was not collared, violated leash laws, and was a threat to their own pets and property.","post_message":"She killed the cat because she believed it was a stray and became a nuisance, but a couple who testified in court this week said “Tiger” was their pet."},{"comment_id":"997724686914554","commenter_b":"Natenyahu, be a man and accept refugees to Israel!","commenter_a":"Hungry is right!","post_message":"A Syrian father laid to rest his wife and his two little boys in Kobani after they drowned as they tried to flee to Europe. This, as desperation and anger deepens among people escaping conflict and poverty. Read more: @webpagelink"},{"comment_id":"10156823156490594","commenter_b":"I don't want my great-granddaughters going into to bathrooms where males are also present. I'm not talking about transgender; there are sick people that will use that as an excuse to be were they shouldn't","commenter_a":"I never really shopped at Target's, I will now. I'm glad your taking a stand for the transgender population. So sad that people's lack of knowledge or fear make them judge.","post_message":"'Inclusivity is a core belief at Target,' said the retailer in a statement. 'It's something we celebrate.'"},{"comment_id":"10153664920821636","commenter_b":"The appointment of this known Moldovan pimp and thug proves beyond any doubt that the so called 'Jewish state' is actually a fascist state built on violence ,murder and colonialism.","commenter_a":"Hitler would be so proud of these two!!","post_message":"In 2016"},{"comment_id":"10154102515036409","commenter_b":"She knows how to promote something unreal as real!","commenter_a":"Yes! Prepare to have big business be hit with a steel chair! Bring Main St back to America!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1560631690895039","commenter_b":"Good for his ASS. I hope they rape him in prison nite and day. Carma is a BITCH lol","commenter_a":"the sentence is more lenient than what he deserves","post_message":"There is no punishment severe enough for these heinous crimes."},{"comment_id":"10154093507981337","commenter_b":"She's not hot enough","commenter_a":"I love Daisy. She's gorgeous. She'd be perfect for the role.","post_message":"Daisy Ridley as Lara Croft in a new Tomb Raider?? She's been having conversations about it..."}]
