[{"comment_id":"504319243082965","commenter_b":"So many of these republiCANTS are using the same old debunked arguments lol Here let's clear up some bullshit and hopefully reach new dialogue on how to possibly prevent further mass shootings: -we've all seen the \"scaring us into dictorship memes\" Our government is corrupt but giving up on how far we've come as a country just to say fuck it let's start a new government here and deal with THAT transition process instead of getting rid of something that Americans are rightfully pissed off keep killing their kids and neighbors. -Yes, when guns are gone crime will still be a thing. Shootings MAY be a thing. Google search the COUNTRY OF AUSTRALIA and stop lying to yourselves. If you have any solutions for stopping all crime please let the class know motherfucker. For now can we ONLY focus on preventable mass shootings? Less guns means less gun related crime, ...","commenter_a":"But they said guns don't kill people!?","post_message":"Who sold this guy his gun?"},{"comment_id":"10157197688465354","commenter_b":"I hope the Police Officers NEVER help her out again!!","commenter_a":"That bitch looks like she is having seizures when she dances! Prince way, way, way better","post_message":"~~UPROAR~~"},{"comment_id":"10153535731001157","commenter_b":"I don't 100% agree , but same happens when they send my child home from school with nothing but Spanish letters in a supposed \"Bilingual\" setting .","commenter_a":"Look's like a fag","post_message":"An Arizona mayor has refused an invitation to a meeting of U.S. and Mexican border city mayors because it was written in both English and \"Spanish/Mexican.\""},{"comment_id":"1062046730518522","commenter_b":"Hillary To Prison!","commenter_a":"You have my vote, @username. As a United States senator and a cabinet secretary, you learned how to compromise and work with your rivals. With you, we know what we are getting authentic experience.","post_message":"I got into this race because I want to improve the lives of all Americans—and I’m going to continue to work my heart out. I hope you’ll join me. Onward to Iowa. -H"},{"comment_id":"10153386864707235","commenter_b":"Eww","commenter_a":"They probably wanted to sniff it.","post_message":"This should not be legal."},{"comment_id":"10153277843683352","commenter_b":"LMFAOOOOOOO black women stay losing","commenter_a":"Nothing is wrong with being ghetto and loud, you just gotta know when to show it!","post_message":"LADIES IF YOU'RE ALONE OR WITH A SORRY MAN! HERE'S WHY‼️‼️ #VALENTINES"},{"comment_id":"10153095086985496","commenter_b":"I ain't never seen a man look like her from the neck down. Really???","commenter_a":"Just don't get how people beating the crap out of each is a sport and other makes them role models, I always taught my kids not to fight.","post_message":"The reaction may surprise you (then again, it might not): @webpagelink"}]
