[{"comment_id":"629211877227588","commenter_b":"If you were born to an married father who was a citizen of the US, I'm pretty sure you're a natural born american, until and unless you and/or your parents renounce it.","commenter_a":"Being a naturalized citizen is not the same as being a natural BORN citizen. I'm a naturalized citizen, born in the UK to a British mother and an American father. I am not a natural born citizen and would not be eligible to run for President. How did he ever get in this race to begin with?","post_message":"It's like a circular firing squad!"},{"comment_id":"537038436486736","commenter_b":"PUKEBAG, Tax-evading, racist POS!","commenter_a":"What A Joke HE IS DEFINATELY TALKING OUT HIS ASS NOW","post_message":"Dr. Alveda slams Al Sharpton for comparing himself to MLK on live TV. Al Sharpton and MLK should never be used in the same sentence. Do your agree Al Sharpton is a criminal?"},{"comment_id":"10154630383678145","commenter_b":"She can Rot in prison too!!! Throw everything you can at her!!","commenter_a":"LOCK HER UP THROW AWAY THE KEY.","post_message":"Officials believe LaKensha Smith-Loyd knows where her uncle, accused cop killer Markeith Loyd, is but she has so far refused to tell them."},{"comment_id":"10155319935565294","commenter_b":"No! Our kids are getting more stupid every passing day! They NEED ALL the education they can get!!! :)","commenter_a":"No","post_message":"Should schools switch to a four-day week? Tell us what you think."},{"comment_id":"1067844663241313","commenter_b":"Texas i never would have u of all states would let muslims take over u capital and Texas read there korah they hate sll non muslims u have been fooled ,they use our laws againest us to get into our goverment , the woman had a right to speak she is a American citizens talking about God and Jesus his son , and u made her leave i bet her family fit 4 our freedom can u say the same about ur muslims that were there ,muslims use people like u all falling 4 there garabage ,i bet they are not even citizens , Texas ur idiots make no mistake the muslims will try to take texas over ,then where are ur Texas Rangers ,","commenter_a":"I see everyone praising this woman, and it's cool I respect her opinion and her right to her actions. But why use the name of Jesus for all the hatred rants. Like when the illegal kids on the bus came to the U.S. and got screamed at and booed by \"Christians\" I wonder if Jesus came down here would be ranting with his Christians or would he be loving everyone?? I think you should do your hatred rants in your name. Not the Lords name.","post_message":""},{"comment_id":"10154553926556729","commenter_b":"Shes an ugly bitch","commenter_a":"I think her and Fiorina fell out of the same tree.","post_message":"Thank you, President Obama!"},{"comment_id":"1173449382693296","commenter_b":"ANTI CHRIST HILLARY CLINTON IS BEING PROTECTED BY UN AND OBAMA! ISIS IS THEIR CHILD OF HATRED TOWARDS THE WORLD AND IS GROWING BY THE MIN THEY ARMED ISIS!","commenter_a":"Hmmm","post_message":"Should the US pull out of the United Nations over this?"}]
