[{"comment_id":"1096148677171405","commenter_b":"Trump should avoided all those snakes in the swamps.. They are traitors like Judas..","commenter_a":"No. No. Not at all!","post_message":"Question of the Day: Should President-elect Donald J. Trump trust people like President Obama, Al Gore, Rahm Emanuel and Mitt Romney?"},{"comment_id":"1520211998272919","commenter_b":"Amanda Murphy Maldonado they can take their kids with them. No families have to be busted up. Then when they kid is of age he can come back as a citizen. LAWS are LAWS...what laws are you CHOOSING to break?","commenter_a":"SEND THEM HOME. This isn't just \"politics\" anymore, this is the deliberate destruction of America from within. When they jumped the wall the broke the law!","post_message":"Breaking News: The Supreme Court says it will review President Barack Obama's orders to shield up to 5 million illegal immigrants from deportation. @webpagelink"},{"comment_id":"914457525280663","commenter_b":"she put it there herself those i sue you i sue you money on those lazy people.","commenter_a":"So granny doesn't love metal sausage.Why?","post_message":"Definitely not lovin' it"},{"comment_id":"10153362253533132","commenter_b":"Please dont let her walk free like Casey Anthony is walking free. If she wants to kill herself let her. She is not a mother. A mother doesnt kill her children AND take pictures of it!!","commenter_a":"Leah Stevens","post_message":"In the arrest report, detectives reported finding an open journal with an entry addressed \"To My Family.\" According to authorities, Jessica McCarty apologized for what she was about to do."},{"comment_id":"10154289975556336","commenter_b":"She agreed to follow the dress code if she was unable to wear heels then she should have asked for an accommodation.","commenter_a":"Dress code violation..if you don't like the dress code find another job. I'd rather not wear pants to work, but I have to anyway because it's the dress code. Suck it up.","post_message":"Dress code violation or sexism?"},{"comment_id":"10154204294889778","commenter_b":"Then let her pay for it","commenter_a":"They need to get over it! Rename something of their own! Confederates were a part of history too! If this is the case, let's change every building's name that offends every confederate soldier's family too!!! I Have Had Enough of this - so crazy & ridiculous!!!","post_message":"Actress Julianne Moore and Hollywood producer Bruce Cohen want a new name for their old high school in Virginia, named for a Confederate general."},{"comment_id":"1106010656085353","commenter_b":"Barf.","commenter_a":"Agreed @username.","post_message":"Seattle Seahawks players kneel together after a #beautiful win at home.  >> kiro.tv/SFvsSEAPhotos // >> @webpagelink  [Photo: Associated Press.]"}]
