[{"comment_id":"10152760994092144","commenter_b":"That first comment wins stupid comment of the month on the internet. But you will call a cop who has a gun to save your sorry ass. You won't take any responsible actions to save yourself or family, but you will pay someone ELSE to put their life on the line to do it for you.","commenter_a":"Screw the nra.MELT THE GUNS!!!","post_message":"\"We're basically being forced to repeal these laws at gunpoint… Every local gun law must go!\""},{"comment_id":"10154048285749087","commenter_b":"She's a flippin' wreck yust waiting to happen....","commenter_a":"Lol they are dragging on the L for her fans","post_message":"BREAKING NEWS: Another very bad poll for Clinton."},{"comment_id":"10153716841688132","commenter_b":"Sorry but he's not BLACK!!","commenter_a":"Ok President Obamas mother was white.His Grandparents were white.How can white people who say he does not care about white people Really ! You r all pissed because our President is Black?thats the issue with ignorant people who continue to blame our President.Im sure George Bush would not have done anything","post_message":"Barack Obama won't be intervening in Kelly Rutherford's international custody battle."},{"comment_id":"10153866356179087","commenter_b":"@username elillegal means\" elite illegal immigrants living in comfort due to free dows from Obama government, at the expense of us tax payers!","commenter_a":"LOL...Trump is a con artist...serial adulter...pathological liar...crooked businessman who preys on the less fortunate . He uses our vets as campaign props and lies about giving them donations. He funds his own businesses with his political campaign. He refuses to make his tax returns public. Be serious. Trump is the most corrupt individual to be running for office.","post_message":"Donald J. Trump gets standing ovation after saying Hillary Clinton \"may be the most corrupt person ever to seek the presidency of the United States.\""},{"comment_id":"692144217642823","commenter_b":"A lesbian trap in a mans body...say what.","commenter_a":"How can Caitlyn get the award for woman of the year if she still has a dick ????","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award.  This is what our world has come to. It doesn't get more absurd than this.  Do you think this is wrong?"},{"comment_id":"1243719872306934","commenter_b":"I would kill radical's in a minute for these women!","commenter_a":"These guys need to be exterminated!","post_message":"Of all the atrocities committed by ISIS, this just might be the most horrific of all. Kidnapped girls and women caged like animals and then set on fire for refusing to have sex with their Islamic captors"},{"comment_id":"10153468910666037","commenter_b":"Kids from low income communities and families qualify for free college education through goverment grants and programs... some choose to use those programs to better themselves and their famalies... others would rather point fingers and blame others... the only person to point the finger at in a capitalist society is the dude in the mirror because you can truly be anything you wanna be if you want it bad enough...","commenter_a":"This is awesome... more boots on the ground hopefully with the full support of the community and politicians to clean the crime up on the streets of this country... Every single city should follow in their footsteps!!","post_message":"The country's largest police force says it will also hire 400 administrative aides to take over desk jobs, which will free up more officers to walk the streets for community policing."}]
