[{"comment_id":"10153689692760530","commenter_b":"Are you on crack?","commenter_a":"15","post_message":"Fill in the blank: The Michigan State Spartans will finish with ___ wins this season."},{"comment_id":"649524331880703","commenter_b":"She and Bernie are behind these riots. Why do we listen to her? She is a liar!","commenter_a":"You got that all right. Randy Webster","post_message":"Disappointing to hear."},{"comment_id":"1194642483887307","commenter_b":"Still need to deal this evil bitch a Blow","commenter_a":"easy defense... animal was not collared, violated leash laws, and was a threat to their own pets and property.","post_message":"She killed the cat because she believed it was a stray and became a nuisance, but a couple who testified in court this week said “Tiger” was their pet."},{"comment_id":"868283350028908","commenter_b":"Those women are a group of sick , twisted bitches. But their outlook is the killary twist. Blame the victim . You bitches make all women look bad.","commenter_a":"Take conservative Fox with you","post_message":"This is absolutely shameful. Get this liberal trash off the air immediately. Can we get 30,000 'LIKES' to have this show shut down?"},{"comment_id":"1044972152190462","commenter_b":"My penis book says the penis breaks off and swims after her! !Get away from me you dick!!","commenter_a":"lol","post_message":"Via Sciencegasm."},{"comment_id":"10153670096417869","commenter_b":"Can we share this with credit of course?","commenter_a":"It been a busy week. In the past ten days, the Trump Campaign joined the KKK, sucker-punched a Bernie supporter, attacked peaceful protestors, abandoned NATO, exported nuclear weapons to Japan and South Korea, spilled-the-beans on Heidi Cruz, outted Ted Cruz in a sex scandal, beat-up a female reporter, dropped nukes on Europe and the Middle East, and punished women for having abortions. These acts would be incomprehensible were it not for the fact that Donald Trump hates Mexicans, hates our trading partners, hates our stupid leaders, hates Muslims, hates women, hates blacks, hates reporters and Bernie supporters, and hates women having abortions. How can he claim to want to Make America Great Again, when he so clearly - hates Americans? There is no answer. Unless we look to the words of the candidate himself. According to The Donald: 1) He disavowed KKK David Duke endorsement; 2) He didn mind a ...","post_message":"There are a couple of twists in the story of Trump campaign manager Corey Lewandowski, accused of misdemeanor battery for allegedly grabbing the wrist of former Breitbart reporter Michelle Fields.  He was not arrested as some outlets initially reported, but voluntarily signed a “notice to appear,” a misdemeanor summons.  And an anonymous Secret Service agent on Trump’s detail claims that what Fields did could have easily resulted in a much harsher response.  This story has the latest:"},{"comment_id":"10153434419026051","commenter_b":"How does such an ugly and lazy guy find that many women to breed with him.","commenter_a":"Can you say 'vasectomy'..and a 'JOB'","post_message":"This guy has 26 kids with 15 women and has been getting $50,000 per year in benefits. Now he’s getting a brand new special gift."}]
