[{"comment_id":"10154570947183822","commenter_b":"his ass should of been hung long ago.....his mother should of been charged as an accomplice too.. she knew damn well those officers would be walking into an ambush.","commenter_a":"Yeah...and I want a million dollars....sorry buddy...you earned it. No remorse ...no care....there are no words...","post_message":"The man convicted of killing three police officers in Stanton Heights appeared in court today. Richard Poplawski wants all charges against him dropped, and declared \"Let's Go Pens\" as he was led into court."},{"comment_id":"10153702258075779","commenter_b":"Sadly, you're probably right!","commenter_a":"He has been proven over and over to be a business failure, a liar, a walking contradiction, unfit foreign negotiator, bigot, mysoginistist, nuke-happy clown! Does the man have to eat a live baby before people get the hint?","post_message":"We all know for-profit colleges are shady, but how bad can they really get? A former for-profit professor explains why Donald J. Trump's is the worst."},{"comment_id":"730165010456352","commenter_b":"@username I love women who are well read xxx","commenter_a":"Is price to paid, for this people, crazy,terrorist! ! I don't blame cpd.just keep us safe!!","post_message":"One minute a Chicago Muslim woman was running to catch her train. The next, she was tackled by Chicago police, and it didn't end there. Itemad \"Angel\" ALmatar said she faced more humiliation at the hands of police before being arrested."},{"comment_id":"10152900911316336","commenter_b":"Jane looked to further her movie career ,it didn't work.Scumbag","commenter_a":"Traitor!","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."},{"comment_id":"10154086298502541","commenter_b":"I find this horrific but please take down the pictures","commenter_a":"Where is Al Sharpton when you need him. Lol","post_message":"Police spokesman Anthony Guglielmi said that while the suspects made “terrible racist statements” against white people during the attack, it does not appear to be racially motivated."},{"comment_id":"10154102450848984","commenter_b":"OMG, Hillary is so very, very, very White !","commenter_a":"She just wants to be president, talks a lot of BS.","post_message":"Wow. Hillary Clinton was caught doing something next to Al Sharpton that is fueling the criticism that she is a complete fraud... and it was all caught on camera. Do you think Hillary will be the Democratic nominee?"},{"comment_id":"1066896063328404","commenter_b":"Get these suckers!","commenter_a":"Billie. Do you need to suck each and every bit of lefty nonsense and regurgitate it?","post_message":"Four House Democrats are calling for an investigation into the Center for Medical Progress (CMP) as the group’s deceptively edited video attacking Planned Parenthood continues to fall apart under public scrutiny."}]
