[{"comment_id":"985288268192005","commenter_b":"she looks like the Queen of Qualudes.","commenter_a":"Or if she is in jail","post_message":"The Democrat Party WILL NOT let Bernie Sanders be the nominee – no matter how many States he wins, how many delegates he has or an other reason.   Watch this and tell me if you agree:"},{"comment_id":"10153918981451509","commenter_b":"Illegals are a huge problem","commenter_a":"Where is Donald Trump and his outrage????? Ohhh wait, you got to be illegal for him to care who gets killed!!!!!!","post_message":"The suspect in a shooting in an Antioch, Tennessee, movie theater is dead, Nashville police say. @webpagelink"},{"comment_id":"10156589848265354","commenter_b":"Lady, please don't be ignorant....","commenter_a":"Ted Cruz , and Marco Rubio are not eligible to be president , neither is Obama ! BOTH parents must be citizens of the United States !","post_message":"Ohhhh boy...."},{"comment_id":"609328869267784","commenter_b":"Racist woman","commenter_a":"It's always been great.","post_message":"Beyoncé appeared Monday night at the Grammys and led a visual and musical performance celebrating motherhood."},{"comment_id":"729100880559027","commenter_b":"Damn right! Put that bitch in office and watch what \"We the people\" do!","commenter_a":"If Hillary wins, it will be because the electoral college was bought out!! The government has already bought the media and they are lying about the margin between Trump and Hillary---Trump is way ahead. The American people are fed up!","post_message":"“I am winning. I am beating everybody and, in my opinion, beating Hillary is easier than beating [my Republican adversaries],\" GOP front-runner Donald J. Trump said."},{"comment_id":"10153047000946336","commenter_b":"Send her to Iraq for a month.","commenter_a":"Yeah, that'll piss ya off !","post_message":"A social worker at an Indianapolis VA clinic was disciplined earlier this year after sending emails to colleagues that contained photos of an elf figurine posed to mock the mental health problems of combat veterans."},{"comment_id":"10156497004350294","commenter_b":"Looks like we need to start banning vehicles. All of these vehicles just hitting and killing people is unacceptable!","commenter_a":"So sad... prayers for the families","post_message":"The woman and a man were crossing the street when a vehicle hit them. Anyone with more information is asked to step forward:"}]
