[{"comment_id":"1324643474244952","commenter_b":"Do you need money?","commenter_a":"We're going to get back at a companies CEO for endorsing a different candidate by buying their product! Genius! I'm a registered Democrat. Why don't you throw some money at me while you're at it. Morons.","post_message":"Supporters of Donald J. Trump are getting back at Starbucks but putting the President-elect's name on the company's cups and filming any barista who refuses."},{"comment_id":"1269577516395609","commenter_b":"So your saying CO2 is NOT a gas?? Where did you study chemistry?","commenter_a":"If that was gas.... the fireworks would have gone off as soon as the air was saturated enough to be visible.","post_message":"No, that's not fog. It's a gas leak.  @webpagelink"},{"comment_id":"941945919231796","commenter_b":"Lol. They immigrated too #landbridge","commenter_a":"Should learn wut? Now listen here sis... You are just brainles jerky What the hell is American? You mean English????","post_message":"She fits right in with Donald Trump."},{"comment_id":"10154923446001337","commenter_b":"No I didn't miss the point Sorry somebody got killed but I live in a town that that happens every day every single day. I'm so used to it that I'm tired of hearing about it. The human species will keep killing each other forever and there's nothing nobody can do about it so why I get pissy.","commenter_a":"So fucking what. There are bigger things in this world to worry about.. it's a fucking word. Nothing else","post_message":"YIKES. The Joe McKnight case took another strange turn..."},{"comment_id":"10154439047219342","commenter_b":"I will reject him too He doesn't fit the norm","commenter_a":"@username isnt he the cutest thing ever??? 😍 Hes a model now! I love it!","post_message":"Remember little Asher Nash?   He's the 15-month-old with Down Syndrome who was rejected by a talent agency.  After thousands of people rallied behind him, here is his new ad campaign and it will melt your heart!"},{"comment_id":"606469089512450","commenter_b":"Cus Beyoncé just another weak ass bitch in the guise of some sort of strong independent woman.","commenter_a":"Except she didn't do any of this and stayed with the man that's been cheating on her (and before the beehive goes crazy, I love Beyoncé...but what I said is also very true...) soooo you can't be a strong independent woman who brushes aside the fuck boy...when you're still married to him. Now if she comes out and says that they are still married cause it's business but they sleep in separate rooms and have an open relationship then awesome for them...but it's not empowering women...its perpetuating the stereotype","post_message":"14 Beyoncé \"Lemonade\" Lyrics For When Your Ex Texts You"},{"comment_id":"1419494658112647","commenter_b":"Show your junk to one of my babies and I promise you will sit to pee the rest of your sick life touch one and you will meet your maker and it won't be GOD","commenter_a":"You're one sick son of a b****","post_message":"CNN Believes That Little Girls Should Be Exposed To Male Genitals, Here The DISGUSTING Reason They Are Pushing This!"}]
