[{"comment_id":"10153544587506350","commenter_b":"Real women dont need all that! They are content with the gift of life they just grew in their body for months!!!! This is a little overkill.","commenter_a":"Oh good grief...isn't the baby enough to show off? Must one be materialistic to have to have a push ring?","post_message":"Push presents (the bling or gift an expectant mom is given for, um, pushing) are getting more and more popular."},{"comment_id":"10153260664437885","commenter_b":"Phuck that man cunt.","commenter_a":"I thought traitorous dogs got shot!","post_message":"Not a DuffelBlog....this is real"},{"comment_id":"10157388184590603","commenter_b":"That wall doesn't work. Many people coming in illegally from Mexico are actually from Cental America.","commenter_a":"I think it will help open discussion about illegal entry into the US. Mexico has a huge wall on its border with Guatemala for the same reason.","post_message":"Do you think think this trip will help or hurt Donald J. Trump?"},{"comment_id":"10153938458440695","commenter_b":"Go home Barbara. You're drunk.","commenter_a":"We're checking on the condition of the other child injured in the crash for the Channel 2 Action News Nightbeat at 11.","post_message":"HEARTBREAKING: Police say a 12-year-old critically injured in a crash on I-285 today has died. Please keep her family in your thoughts and hug your loved ones tight tonight. @webpagelink"},{"comment_id":"943485965686825","commenter_b":"Hillary wants to have DNA test to see if Chelsea is hers!!! DUH!!!","commenter_a":"Lol..she looks like Bill.","post_message":"Incredible!"},{"comment_id":"1716657778577521","commenter_b":"no not true.I have seen proof LOL","commenter_a":"When faced with criticism of their candidate, Trump fans are quick to argue that Trump is better suited to be president than Obama or Hillary. The choice is NOT between Trump and Obama or Trump and Hillary. The GOP is choosing THEIR standard-bearer. The choice before us AT THIS CRITICAL MOMENT is between Trump and anyone of three other Republican contenders. Who will have the moral character to stand up against Hillary or Bernie? I choose CRUZ!","post_message":"Is there a real connection between hand size and penis size? We decided to investigate what the science says on the matter..."},{"comment_id":"10154330799961756","commenter_b":"Not true she's probably going to make more blackmailing than having sex eventually","commenter_a":"Why do you do this, it will never go away, it is a fact of our lives. Make it legal, tax it and provide health regulations~","post_message":"Clients will be fined about $1,700 for the first offense."}]
