[{"comment_id":"10154978803416509","commenter_b":"@username even your pussy is ugly...","commenter_a":"Anyone who is upset, mad or sad about this, please evolve otherwise you are apart of the pedophile culture.","post_message":"In a nod to a more modern approach, the Miss Teen USA pageant is ending the swimsuit portion of its competition."},{"comment_id":"468867053307454","commenter_b":"Transgender are idiots knockem in the head throw em in a ditch.","commenter_a":"This world is filled with way too many idiots. Please EDUCATE yourself. All of a sudden this is a problem? Where do you think trans people have been going to the bathroom? But ACTUAL pedophiles who like boys is okay? Stop being hypocrites and spreading hate","post_message":"A pledge calling to boycott Target has now reached over 1 million signatures. @webpagelink"},{"comment_id":"10152889447368837","commenter_b":"How about sending your black people to Africa forever ever, so they don't rob, kill , root and continue destroying this country!","commenter_a":"Since the US is working with Cuba, the government needs to eliminate the wet foot dry foot policy. Make sure any Cuban who comes here get citizenship so they can pay taxes versus living here off the grid and sending monies home to screw up the Social Security, retirement and Medicare funded programs built for Americans in this country. Black White Hispanic Asian Haitian alike.","post_message":"Dangerous Voyage."},{"comment_id":"539180629598484","commenter_b":"Good one. That made me chuckle.","commenter_a":"Because nothing screams, \"I'm protecting the environment\" like flying your private jet to accept an environmental award.... lol","post_message":"Some eyebrows were raised when DiCaprio took a private jet from Cannes to New York City to pick up an award from Robert De Niro's clean water advocacy group."},{"comment_id":"10156268992405093","commenter_b":"What is it..?...A Witch would go down nice.","commenter_a":"She is just ordinary folk like us. See, she can laugh at herself (not really) and wants everybody to see how much she is like us and SO down to earth. Oh my how have we misjudged her all this time?! What a fraud!!!!!","post_message":"It's just.... It's just too easy."},{"comment_id":"968324823259627","commenter_b":"Bitch please","commenter_a":"This is ridiculous! Trump can beat Hillary or Bernie with one arm tied behind his back. America has made their choice. No more corrupt, lying, manipulative, smooth talking politicians. We want our country back! We have a real shot with Trump, and we're not going to be tricked any more.","post_message":"“Let me be clear on one thing tonight. This campaign is just beginning,” Bernie Sanders said. “When we come together, and don't let people like Donald Trump try to divide us, we can create an economy that works for all of us and not just the top 1 percent.\""},{"comment_id":"1814101218857117","commenter_b":"When you walk into McDonalds they already had yo order ready , \"ay 3 big Macs to the front, this fatass just walked in here...\" built ass, you sitting down eating on a bean burrito & yo bitch walk in butt naked all you can do is *munch munch on food* \"uhh tf I'm supposed to do with that?\" Gay ass outta here","commenter_a":"What kinda fake ass pink sack of waste of human flesh trump supporting stds catching macaroni and cheese smellin diaper full of shit stain 'my dad a lawyer' \"Just bought 2 big nos tanks for my honda and added turbo that way when I drive it goes really fast like 300 mph\" lookin ass damnnn 'Daniel back at it again with the pink verses fruity man' head ass \"wanna hot dog on a stick?\" Head ass normie fuckboi made this meme?","post_message":"This man is a genius ahaha #WSHH"}]
