[{"comment_id":"988329747869113","commenter_b":"she should be arrested for making false statement, amd be fired from her job. This crab is getting old.","commenter_a":"She lied","post_message":"WOW this lady...shamelessly LIED about her entire encounter with the Police Officers..and here's the proof! What a fool."},{"comment_id":"1758399887778329","commenter_b":"Hillary Clinton is as corrupt as they come, she needs to be held accountable and put in a prison cell. Corruption in Washington is running rampant and WE THE PEOPLE are sick of it.","commenter_a":"Lol... At least she appears to be truthful with her daughter","post_message":"Hillary Clinton told her daughter in an email that there was a terror attack in Benghazi, according to an email provided to the Benghazi Select Committee. @webpagelink The GOP-led committee will discuss the report in a news conference at 10a ET."},{"comment_id":"1338050419567745","commenter_b":"Ladies don't behave like that..","commenter_a":"Why are they so darned angry? It doesn't make sense.","post_message":"LIBERAL YOUNG LADY GOES ON RAMPAGE & DESTROYS TRUMP TABLE at COLLEGE (video) @webpagelink"},{"comment_id":"1059948200694894","commenter_b":"She isn't a women, if she was slick Willie would deny ever having sex with her","commenter_a":"Unlike him, she should be under federal indictment and disallowed from running for any office at all.","post_message":"It's getting downright catty between Hillary Clinton and Donald Trump."},{"comment_id":"10154025197726717","commenter_b":"She leaked information about innocent people being murdered!!! I see nothing wrong with that!!!","commenter_a":"Fuck her, she leaked secrets. It's against the law, doesn't matter how you identify or what's between your legs","post_message":"Manning recently asked President Obama to commute her sentence, and supporters worry what a Trump presidency will mean for her."},{"comment_id":"1060479207341941","commenter_b":"@username you are stupid and Crystal takeaway from drugs looking for help never is to late for live free of drugs jajajaja jajajaja jajajaja.","commenter_a":"Hillary for Iowa the best candidate for president and 2016. Go @username go.","post_message":"5 days to Iowa!"},{"comment_id":"1132568873502832","commenter_b":"Dont know. You went baiit an switch. Its about keeping these men out. Want more? @webpagelink","commenter_a":"To keep men pedophiles out womens bathrooms? Yes. I agree!","post_message":"How does this make ANY sense? Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"}]
