[{"comment_id":"503579846468637","commenter_b":"Why argue with this man child?","commenter_a":"Remember the outrage over the clock kid? Let us see if libtards and media worry so much about Christians being singled out to die.","post_message":"\" He seemed skittish, always looking over his shoulder to see if anyone was watching.\""},{"comment_id":"1422614517766820","commenter_b":"Turn off your speakers when Hillary starts speaking or she will break your ear drum","commenter_a":"Maybe every issue liberals care about like letting men in girls showers and rest rooms","post_message":"A Donald J. Trump presidency would pull us backward on nearly every issue we care about. We can't let that happen."},{"comment_id":"10154310787426130","commenter_b":"I'm very disappointed with Meg Ryan. She must be in the pocket.","commenter_a":"Actual, I think Richard Dreyfus won that one (see his tweet at the end of the article).","post_message":"Megyn Kelly set him straight."},{"comment_id":"10153978069921178","commenter_b":"Rosa, that is not your place to say","commenter_a":"andyou need to get out of the United States","post_message":"Michael Moore goes off the rails (more than usual) in bizarre interview."},{"comment_id":"10154416362313984","commenter_b":"It's so so wrong these thugs get by with this lawless This is Obamas America If it were white folks going against ANY minority's you can believe the law would be doing there job . But this is what Obama wants anything to keep Trump shown as the one causing all the trouble . Loretta Lynch is his puppet ( what can I do to please you master Obama? ) All Americans should be outraged at this complete lawless . I pray Trump can win.Not because he republican but Hillary will carry out this lawless policy . She wants Power folks power over you great Americans that work so hard to support your families and give to every illegal that comes in our country She wants 65,000 Muslims in without vetting them . It's all about votes","commenter_a":"SHERRIF CLARKE!!! YAGOTITRITE!!!! STICK TO YOU GUNS!!!! We are all PROUD OF YOU!!!!!","post_message":"Sheriff Clarke just took down the United States Department of Justice and Barack Obama in one fell swoop...  Do you agree with what Sheriff David Clarke just said?"},{"comment_id":"10153659904056770","commenter_b":"PEOPLE GUESS WHAT SHE WORKS FOR HILLARY NOW...","commenter_a":"Interesting Demcratic take on LGBT, since it's rumored that Hilary herself might fall into this category!","post_message":"Recently leaked emails from the Democratic National Committee revealed staffers had some less than LGBT-friendly comments."},{"comment_id":"1533770763589743","commenter_b":"Stupid!!!","commenter_a":"Idiots. I don't watch or care about that crap.","post_message":"Tonight at the Oscars, celebrities will be wearing gun control bracelets (paid for by the anti-gun group Brady Campaign), while being surrounded by massive amounts of armed security. Think any of them will note the irony?"}]
