[{"comment_id":"1014917681925727","commenter_b":"Alex, it was a hot springs then we saw in the photograph.","commenter_a":"Christopher Sorrentino","post_message":"Hot springs have injured or killed more people in Yellowstone National Park than any other natural feature."},{"comment_id":"10153900801473445","commenter_b":"Never mind I've heard it only the oil and certain illness so it's shit like Ga.","commenter_a":"'@username get you a card!","post_message":"Big News! Ohio Becomes the 26th State to Legalize Medical Marijuana"},{"comment_id":"10154231827133797","commenter_b":"How you like them bad apples","commenter_a":"So all of you WANT another war? The Obama hate is getting really old. Let me guess. Your all republican wealthy suburban mini van driving ,entitled Starbucks drinking pricks. I like how you alllll forget Bush's presidency. By far the worst president. Ever.","post_message":"OBAMA ADDRESSES PARIS ATTACKS: President Barack Obama says putting large numbers of U.S. troops on the ground to combat the threat from the Islamic State would be 'a mistake.'"},{"comment_id":"1569633279990452","commenter_b":"U a fat bitch.u hater.k.k.k.","commenter_a":"Oprah is a racist bitch","post_message":"Way to go Carrie Underwood!"},{"comment_id":"10153969905469575","commenter_b":"Translation ?","commenter_a":"The bus should not pass that test bc there was something wrong if bus driver try back out but it's still jump forward an hit students an a frav principal an it's be proof on wthr new long time ago when they was look why bus have problems pass the test!","post_message":"In their inspection last night, police found nothing mechanically wrong with the bus involved in the fatal crash at Amy Beverland Elementary School.  Police are still awaiting the toxicology results from the mandatory blood draw, but the bus driver showed no signs of impairment."},{"comment_id":"933893426670406","commenter_b":"I'm sure Myra Hindley was a serial killer @username, that's only one name, I could name a few. Woman r quite capable of becoming serial killers. The statement is true, most serial killers start with killing and torturing animals","commenter_a":"thats how serial killers start!","post_message":"'My first bow kill lol'"},{"comment_id":"1001534043242046","commenter_b":"Nice thought but it's an AMERICAN FLAG on a WHITE MAN'S PROPERTY that's also a VETERAN. Need I say more Nick as sad as it is he is still defending his FREEDOM, his CONSTITUTIONAL RIGHTS, the AMERICAN FLAG and this ONE NATION UNDER GOD.","commenter_a":"I just hope he called the cops because it could be a hate crime, and its attempted arson,","post_message":"Marine Vet Who Flown an American Flag in His Front Yard for 15 Years Wakes Up to a Sad Sight:  Can They Do That? (VIDEO)  PROUD AMERICANS ARE UNDER ATTACK!   @webpagelink"}]
