[{"comment_id":"10153181956571162","commenter_b":"I guess it depends on how you speak to your mother.","commenter_a":"I thought it was great. Normal mom and daughter banter. They are human after all.","post_message":"50 SHADES OF AWKWARD! Dakota Johnson and Melanie Griffith on-camera spat on Oscars red carpet: @webpagelink"},{"comment_id":"10153262313634497","commenter_b":"Alan there's no way for Cubans to legally immigrate to the US.","commenter_a":"Ted Cruz the Canadian born of a Cuban and an American that doesn't like immigrants.","post_message":"Texas senator Ted Cruz announced Monday that he will run for president in 2016. Here is what you should know about the first-term senator:"},{"comment_id":"1017809398240071","commenter_b":"Thought it was a low-res depiction of a chicken...","commenter_a":"Lexi Langlinais !!!","post_message":"A huge asteroid is set to pass close to Earth."},{"comment_id":"10154551576694030","commenter_b":"White people love mayo and ranch. I lovvee ranch bruh.","commenter_a":"I didn't see this as particularilly white. Like people of color don't use mayo?????","post_message":"You can't help who you are. Kyle Kinane's Loose in Chicago premieres tonight at 12a/11c."},{"comment_id":"10157942641385354","commenter_b":"Horseshit. Grow a set wussie. You give me a bad name.","commenter_a":"Danika Pearson","post_message":"Wake Up, Gun Owners. This is No Joke."},{"comment_id":"897694810421095","commenter_b":"They don't belong here. We are just a safe place until they can outnumber us and overpower us","commenter_a":"She can leave.","post_message":"This is what happened when she refused for the National Anthem. If you don't respect our country, then you can leave. Do you think she should pack her bags?"},{"comment_id":"10153479348993812","commenter_b":"Nobody wants to see your tears lady, we are saving them for the hero you murdered and left to die. Piece of crap.","commenter_a":"She got what she so obviously deserves!!!","post_message":"Woman charged with murder, accused of killing US Navy sailor in fit of road rage: @webpagelink"}]
