[{"comment_id":"10154543039398132","commenter_b":"Two jerks","commenter_a":"Stay joyful! Happy birthday Blake","post_message":"Gwen Stefani celebrated Blake Shelton's big 4-0 with some epic throwbacks."},{"comment_id":"517994265057820","commenter_b":"she is a pig","commenter_a":"She is an idiot, why does anyone give her the chance to prove it and get her 15seconds of publicity?????","post_message":"Mike Brown's mom just said something infuriating about the two cops who were just shot. This is absolutely disgraceful. No wonder her kid was a thug. Do you agree Mike Brown's mom is totally out of line?"},{"comment_id":"10154533631771756","commenter_b":"Well, it's not final yet, but research has shown that kids in 3rd world countries have fewer food allergies because they have had hookworm infections. The hookworm releases enzymes that actully turn off parts of your dna that determine food allergies and other autoimmune diseases. It's in the worm's best interest to keep the host able to eat many things so that the worm can enjoy them, too.","commenter_a":"Tina Pak","post_message":"A research powerhouse attempts to solve the huge mystery of why food allergies have been skyrocketing in recent years."},{"comment_id":"10154958123446037","commenter_b":"Go away troll 🤣🤣🤣🤣🤣","commenter_a":"Why should the taxes I pay be used to pay for security for a billionaire that pays no taxes?","post_message":"“New York City taxpayers should not be on the hook for 80 percent of the national bill to protect [Donald J. Trump] and his family’s residence.\""},{"comment_id":"10154887847131729","commenter_b":"Take your head rag with you. Ungrateful bitch","commenter_a":"You are disgrace to my country! Pack your bags and go to one of the Muslim countries where you will be treated like a dog because you are female. What an ungrateful idiot.","post_message":"Seriously?"},{"comment_id":"945524792158383","commenter_b":"Kill all the white people, then they will only have each other to blame and kill. Brilliant!","commenter_a":"Idiots","post_message":"[Watch] New Black Panther Party Urging Blacks to Get Ready to Kill for a Black Nation"},{"comment_id":"1070333876354408","commenter_b":"She makes my ears hurt.","commenter_a":"She will say anything and she will lie to America like she's always there","post_message":""}]
