[{"comment_id":"10153253749121800","commenter_b":"Heard this on 98 rock on way to work....halliarous!","commenter_a":"Masoud Jalali","post_message":"\"To be clear, a guy on CNN just said, 'Hey, if people are looking for news, I'm sure they can find it somewhere.'\" -- Jon Stewart"},{"comment_id":"10154274374674445","commenter_b":"Meant north Falmouth not Nana! These txt terms get ahead of me lol!","commenter_a":"Granddaughters & sister-in-law-,law live in E,& Nana Falmouth have to check it out!, saw on local TV Chronicle last night!","post_message":"Chronicle on WCVB Channel 5 is exploring the beauty of Cape Cod. What's your favorite spot to visit each year?   Watch live: @webpagelink"},{"comment_id":"10153395040141336","commenter_b":"Because she and her mother are bible thumping morality pushing hypocrites. That's why.","commenter_a":"Why is it Bristol Palin gets pregnant and the liberals trash her, YET are proud of all the welfare momma's who have a half dozen kids, with several different donor dads, at the taxpayers expense? Bristol supports herself.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child.  “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"10153615775017235","commenter_b":"In actuality, the video is being shown in reverse to make the officer look bad. He was actually using his gun to pull bullets out of the man in an attempt to save his life.","commenter_a":"I can show you a video where it looks like a deputy shoved a mans face into the wall. Then when you see it from the other angles you will see that the man tripped and the deputy tried to reach for him.","post_message":"Watch this. This is awful"},{"comment_id":"10154173951544199","commenter_b":"I agree.....and you know that kind of thing is coming....gender nutral bathrooms.","commenter_a":"I think this is just another poor choice.If I am going to buy a toy for a child its helpful to know where I'm going.If I want one for my grandson or grand daughter it saves me time knowing which section to go to.Kind of like going to grocery shop and trying to find a specific item but every aisle just says \"Groceries\".","post_message":" change is a step towards removing gender limitations in childhood, but when one of the world largest retailers does this, the ripple effect will be significant."},{"comment_id":"10153544587506350","commenter_b":"Real women dont need all that! They are content with the gift of life they just grew in their body for months!!!! This is a little overkill.","commenter_a":"Oh good grief...isn't the baby enough to show off? Must one be materialistic to have to have a push ring?","post_message":"Push presents (the bling or gift an expectant mom is given for, um, pushing) are getting more and more popular."},{"comment_id":"10154319378806337","commenter_b":"Mfs are crazy someone please give this puppy mf a show so i can laugh everyday as he humps his wifes leg and smell her butt. Wait i do all those things. This guy is normal","commenter_a":"Oh what the fuck happened to this world..lol","post_message":"UHHHH..."}]
