[{"comment_id":"236462700148781","commenter_b":"I heard he won by a lot and everyone is happy. Next please","commenter_a":"Dagmar! Free Press just means that they can't be censored or jailed! He doesn't have to speak to the press! No ....NO VIOLATION OF THE 1ST!!","post_message":"Join us as President Donald J. Trump delivers the Weekly Address."},{"comment_id":"704085629782015","commenter_b":"She is Disgusting. Can't stand to look at this woman","commenter_a":"This whole family is a DISGRACE to this Country!","post_message":"Our first lady just disrespected all the white women in our country. She is a hypocrite and a racist. We miss Laura Bush. Do you agree Michelle Obama is a disgrace of a first lady?"},{"comment_id":"10153095086985496","commenter_b":"I ain't never seen a man look like her from the neck down. Really???","commenter_a":"Just don't get how people beating the crap out of each is a sport and other makes them role models, I always taught my kids not to fight.","post_message":"The reaction may surprise you (then again, it might not): @webpagelink"},{"comment_id":"10153853522001336","commenter_b":"Your Governor says yes to more refugees.","commenter_a":"I just found out that approximately 130 Syria refugees are here in PA .","post_message":"“What I want is a watch list. I want surveillance programs. Obviously there are a lot of problems. I want a database for the Syrian refugees that Obama’s gonna let in.” Donald J. Trump went “On the Record’ to clarify his recent comments, emphasizing that he wants to keep track of the Syrian refugees entering the United States, not all U.S. Muslims. @webpagelink"},{"comment_id":"10152745228401615","commenter_b":"being lesbian doesn't make them superior... they could easily end up divorced single mothers too.","commenter_a":"Most marriages end up in divorce and children are raised mostly by struggling single mothers. Those mother's present the mother And father role. Having two mothers appears to be a blessing! :) Children need love, structure and room for growth. So, haters just sit down and if you love children so much the foster care and group homes have many of your neglected and abused children waiting to be adopted and loved.","post_message":"Yes, they're both pregnant, but about a year apart..."},{"comment_id":"10154741052673812","commenter_b":"Angela, your an idiot","commenter_a":"I love the comments so far. These folks probably have no idea that we have the largest prison population in the world filled with non violent offenders.","post_message":"NEW: Pres. Barack Obama grants commutation of sentences to 111 individuals. He's now commuted sentences for 673 people - more than the past 10 presidents combined. abcn.ws/2bPG0zc"},{"comment_id":"10153689322651162","commenter_b":"Typical female cant let another female live. Lol","commenter_a":"Stupid a@@! She probably walks faster than the Barbie Jeep.","post_message":"WOW: A 20-year-old college student's license was suspended when she was busted for a DUI... So she decided to get around campus on a Barbie Jeep instead: @webpagelink"}]
