[{"comment_id":"10153190415066037","commenter_b":"#TooBadBitch","commenter_a":"Please let him lose !","post_message":"BREAKING Israel Prime Minister Netanyahu and center-left opposition tied in election exit polls"},{"comment_id":"10153270035730779","commenter_b":"Oh! And what about all those potential babies killed when wankers like you spill your seed onto barren ground?! #EverySpermIsSacred","commenter_a":"Forty million dead babies can't be wrong. An entire generatation of Americans has been murdered in the womb.","post_message":"Yes, Martin O'Malley, Bernie Sanders and Hillary Clinton are all pro-choice, but that isn't good enough. Simply promising to veto abortion restrictions passed by a Republican Congress isn't how we protect access to abortion, not when state legislatures are making it increasingly difficult for the most vulnerable women to get one. It's time debate moderators talked about it."},{"comment_id":"10154007566964091","commenter_b":"Sick women..","commenter_a":"Something is really wrong with this world.","post_message":"The mom claims she and her daughter \"hit it off.\" She lost custody of her children when they were young, and had only recently reconnected with her."},{"comment_id":"10153649800077894","commenter_b":"Such a hateful bitch","commenter_a":"So Janet Jackson cancels her tour, gets pregnant and then has the nerve to drop a new video that was basic as all get out......Janet will see you after the baby because 2016 is not for you.","post_message":"Janet Jackson – Dammn Baby [New Video]"},{"comment_id":"467950796728834","commenter_b":"Don't deport them-KILL THEM! They will only return if we don't . Simple truth","commenter_a":"He'll yes. Send them back were they came from. We are running out of bed sheets. Lol","post_message":"Do You Support Muslim Deportation In The United States? Comment 'yes' or 'no'."},{"comment_id":"722580014574620","commenter_b":"Illegals voted here for Obama...","commenter_a":"Proof of Citizenship or Naturalization of Citizenship is the only way you can vote in National elections. Try going to any other country and vote in their elections, YOU CAN NOT. Period end of report","post_message":"Will someone steal your vote when you cast your ballot on Election Day? Voter fraud can drastically influence the outcome of elections."},{"comment_id":"10153480378764071","commenter_b":"The only reason I stick with BI! The comments are classic! Love it.","commenter_a":"These comments are killing me!!! 😂😂😂","post_message":"The pricier your brand, the better customer service you provide."}]
