[{"comment_id":"10152871405466717","commenter_b":"I remember seeing this it really touched my heart loved it!!! And those moms can suck it!","commenter_a":"Moms... eat shit and die! Hypocritical, bigoted ass-holes..... 1,000,000 Moms = about 12 homophobic morons!","post_message":""},{"comment_id":"10153347624056509","commenter_b":"No.","commenter_a":"Hate crime. obviously","post_message":"Angry family members insist this had nothing to do with a parking spot, and a spokesperson said the suspect had threatened the victims before: @webpagelink What do you think? Share your thoughts in the comments."},{"comment_id":"10152771119936051","commenter_b":"Lady, when in America, do as Americans do. Our country was founded on a theocracy. Deal with it.","commenter_a":"Happy to hear it! American laws and rules apply here. NO others. Don,t like it then leave!","post_message":"This woman demanded that she be allowed to swear on the Quran before testifying. Well, she got her answer."},{"comment_id":"10153792156382439","commenter_b":"I would be pulling my children out of that school and looking for a different country to live in... preferably muslim free....","commenter_a":"Sounds a lot like how they kicked of the 3rd Reich.","post_message":"As part of a school project, German children are required to cook and clean and change the bed linens for refugees. The host country becomes subservient to the invaders. A letter written by the Schleswig-Holstein Ministry of Education and Vocational Training, says “pupils will spend a day in a transit accommodation and help for example, fix up as beds as well as help in the collection of donations.“"},{"comment_id":"10154618294282577","commenter_b":"hey bitch","commenter_a":"Fu","post_message":"First Lady Michelle Obama hit out at Republican nominee Donald Trump dismissing several of his comments at the recent presidential debate."},{"comment_id":"941357532590662","commenter_b":"Yes, @username. Why don't we force all the women to wear burka. I hope yours fit you well. You probably need it.","commenter_a":"Every picture she has she has her cleavage out! Then blames the men for the 'unwanted attention'!!!","post_message":"She reported them to police because she said it made her walk to work an 'awful experience'"},{"comment_id":"1790748334489343","commenter_b":"So go.","commenter_a":"Goodbye to all the rif-raf. America will be great again!","post_message":"SHARE THIS IF YOU WILL BE HAPPY TO SEE THEM GO!"}]
