[{"comment_id":"755392124560784","commenter_b":"Happy New year","commenter_a":"Go Bernie..he's the right person for the job!!","post_message":""},{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: \"Oh for goodness, that is not going to happen. I'm not even answering that question.\" #DemDebate"},{"comment_id":"10156996522130354","commenter_b":"I will not vote for Ryan ... he is a socialist....","commenter_a":"Yep!","post_message":"TED CRUZ: PEOPLE WILL ‘REVOLT’ IF NOMINEE NOT ME OR TRUMP..."},{"comment_id":"1036028619826340","commenter_b":"Keep walking it back Donald, pretty soon the wall will be some bushes and a couple signs","commenter_a":"Dump Trump","post_message":"I have never liked the media term 'mass deportation' - but we must enforce the laws of the land!"},{"comment_id":"1139514676096919","commenter_b":"#TrumpThatBitch","commenter_a":"Hillary is dirt","post_message":"Hillary Clinton and Donald Trump clashed repeatedly over the economy, tax cuts for the wealthy and ISIS in the first of three highly anticipated presidential debates. Read KTLA's story here: @webpagelink"},{"comment_id":"947484675311281","commenter_b":"This is why so many people are against Muslims. I've sat and ate meals with people from all over the world with differnt faiths and never had a cross word. It's all about give and take yet some Muslims can't grasp the idea of peace and harmony. The reason why they all want to come to England and screw our little island up is the free hand outs. VOTE UKIP and maybe we can stamp the minority out and make it harder for these people to enter our island.","commenter_a":"This not surprising. What surprising is he is not in jail for what he just said.","post_message":"Sean Hannity: 'You want her to die!?'"},{"comment_id":"1518802311757226","commenter_b":"For people illegally here","commenter_a":"Especially if you are anyone other than the WORKING CLASS !!","post_message":"President Obama just addressed Donald Trump in a not-so-subtle way. Do you agree with the president?"}]
