[{"comment_id":"907221015981906","commenter_b":"what woman would fantasize about being gang raped?","commenter_a":"And is that because that's his fantasy","post_message":"When Democratic presidential contender Bernie Sanders was 30-years-old, he wrote that women fantasize about being gang-raped. His office did not immediately respond to a request for comment from TheBlaze."},{"comment_id":"761137067410204","commenter_b":"Good decision by the judge. This entitled brat needs to make better decisions.","commenter_a":"Just another teenage girl who never got proper parental guidance because the parents were too wrapped up in themselves.","post_message":"Outrage After Judge Orders Bristol Palin To Do THIS With Her Breast Milk This is just ridiculous. A mother should not be subjected to this. Do you agree or disagree with the judge?"},{"comment_id":"10153603093348132","commenter_b":"You are not that smart are you?","commenter_a":"DONT RUN","post_message":"\"We feel the system is working but it doesn't bring him back.\""},{"comment_id":"1029438293779366","commenter_b":"Keep Bill away from those girls Hillary!! You know he acts around other girls!!","commenter_a":"The next Americans president and expected cabinet members came 2015","post_message":"On the set of Broad City season 3 with Abbi, Ilana and Amy! #yas"},{"comment_id":"10155104140119497","commenter_b":"Build that wall, watch all the libs fall on ground kicking ...priceless..let the shit show begin...popcorn anyone?","commenter_a":"I thought the Onion was supposed to be funny.","post_message":"How The Border Wall Will Be Built"},{"comment_id":"1270203316353471","commenter_b":"she cant and is a skank","commenter_a":"Say what you want about Miley--those pipes of hers are GOLD. period. And, she's been a sole advocate of LGBT and homeless rights. She's young and finding her voice but good for her for wading into the advocacy pool! Applause!!","post_message":"She may be an attention seeking diva with a voice like nails on a chalkboard, but she's also a politically active advocate for women's rights who despises Donald Trump."},{"comment_id":"1242224722465203","commenter_b":"\"because they make decisions based on gut feeling and emotions\" - And here come the Facebook comments that'll prove just that. *sigh*","commenter_a":"I'm sure some don't, same with men.","post_message":"This person is also a board member of Women in Science and Engineering. -_-"}]
