[{"comment_id":"1827275810826011","commenter_b":"Fuck you, bitch. Your head is up your little ass.","commenter_a":"vote for none of the above, the masses need to start a revolution and jail the corrupt 1% who pretend to give democracy in a nwo dictatorship , wake up and fight for your human rights","post_message":""},{"comment_id":"769057633200701","commenter_b":"She deserved to be sterilized or shot.","commenter_a":"AMAZING THAT THEY WERE THERE TO HEAR THE BABY THANK GOD, BURY THE MOTHER NOW ALIVE! ANGERS ME","post_message":"A newborn girl thought to be only 36 to 48 hours old was found  alive in Compton on Friday.   The baby muffled cries led sheriff deputies to find her buried under pieces of asphalt and rubble inside a crevice near a riverbed.   Detectives are now asking anyone with information to come forward.  this post to alert others.   Read KTLA story here: @webpagelink"},{"comment_id":"1024542317579852","commenter_b":"@username, Planned Parenthood doesn't sell body parts and those that say they do are lying","commenter_a":"Thanks to the fact that the local Planned Parenthood clinic was closed down in Scottsburg, testing for AIDS and other diseases was nearly nonexistent in Scott County. And now Republicans are wanting to defund Planned Parenthood despite the fact that abortions make up only 3% of what PP does. SMH... @webpagelink","post_message":"In recent weeks, the American people have learned more about the barbaric practices Planned Parenthood uses to take innocent human life. Despite the outrage of millions of Americans, Planned Parenthood’s response has been to blame the messenger or the videographer, without addressing the barbaric practice of harvesting aborted body parts.  We need to let Planned Parenthood know that the American people do not support these inhumane practices. Congress should vote to end federal funding for Planned Parenthood before we leave for August recess. I urge Senate leadership to give every Senator the opportunity to affirm that life is a sacred and precious gift that must be protected."},{"comment_id":"1796926360545603","commenter_b":"I well tell you some thing... The isis was made by usa","commenter_a":"Vote Trump. .... what's the matter killary fans u guys worried. ... U should be","post_message":"We are going to get rid of ISIS! America needs real leadership. #MakeAmericaSafeAgain"},{"comment_id":"736103763189471","commenter_b":"I hope the police are called for every item he, or anyone else, takes to school that appears to be an explosive device of any sort. Truly Americans can't be this ignorant. Oh, wait! We are! Obama is president and was not only elected once, but twice! For those that truly believe in tolerance and are willing to allow Islam to infiltrate our country, just wait and see how tolerant they are of you, your children, and your children's children when they become the majority. Remember this, Obama is moving in thousands of \"refugees: next year and the current Muslim population is already having children at a much higher rate than the average American family. SURPRISE!!!!!","commenter_a":"No, comments.","post_message":"Of COURSE."},{"comment_id":"1394774427201577","commenter_b":"She shouldn't even have a job because she is an illegal alien.","commenter_a":"Frank tokar maybe if you were in her parents situation would do the same , you do anything to make sure sure your children are safe and have the best you can give them , USA is a líder no a low un respectful selfish heartless country thanks god no every American think that way USA is a country of opportunities no one takes your jobs away all depends on you how hard you work .","post_message":"Rick Santorum and Anna Navarro engage in a passionate exchange with a DREAMer who says she may lose her career if the new administration ends DACA. @webpagelink"},{"comment_id":"694737757326072","commenter_b":"Unemployment is down because you can't get it silly woman.","commenter_a":"That's all of ya dumbass president who ya voted for should've just kept the house republican","post_message":"WHAT?!??!!?"}]
