[{"comment_id":"1601888236769214","commenter_b":"I personally like the idea of amnesty for those already here, then very strict implementation of immigration laws and immigration reform after that. Breaking up families is not a solution to this problem. These raids will just cause more pain and foster bad feelings. If they're here, let them stay, get them legalized so they help support the system they're using. Then lock it down and form a clear, sensible, reasonable, doable path to citizenship. we don't need a wall. We need penalties on companies that hire illegals, and serious reform on the \"war on drugs\" that incubates environments that force people to flee their homes. We have to stop blaming people who are looking for a better life, and start finding ways to help our neighbors reach the same level of community peace that we enjoy.","commenter_a":"I know this is going to be unpopular, but I know many Hispanics who agree with me. There is a legal way to come to the country, and contrary to some of the attacks I have seen on other posts, it does affect our low income Black, Hispanic, and White communities. They are used to a more extreme poverty, so they are willing to work for less than minimum wage, and are off the books, so taxes, SS are not paid. This means an American citizen or legal immigrant is denied a job. When so many of our jobs are being sent to Mexico, China, India how can we not address the issue of those who came here illegally. My nephew's wife is from Mexico. 2 of my nephews have dual citizenship. US/Brazil. I am far from racist or anti-immigration, but our own citizens and legal immigrants are suffering. We ...","post_message":"This week the media reported something that I find not just wrong, but inhumane: President Obama is currently planning \"a month-long series of raids in May and June to deport hundreds of Central American mothers and children\" who came to our country fleeing that same violence.  Sending women and children back into harm's way after they already fled horrendous violence in Central America is painful and inhumane, and must be stopped.  Sign my petition asking President Obama to stop these raids and to make sure that families fleeing violence in Central America are protected from deportation."},{"comment_id":"581929555264971","commenter_b":"They need to be sent back to their own country, period! !","commenter_a":"I am getting to the point I really do dislike the new media, they are a bunch of useless asses","post_message":"The city of Twin Falls first made headlines when Muslim migrants sexually assaulted a five-year-old. Now another sex crime, this time against a disabled girl, has rocked the community. You won't see this story in the mainstream media."},{"comment_id":"971619749553192","commenter_b":"Wtf","commenter_a":"Saudi Arabia is holy land and not a country prepared for war, and have no military status. Iran should know better and could not even beat Sadaam at the time","post_message":"\"Because a war between Saudi Arabia and Iran is the beginning of a major catastrophe in the region... For sure we will not allow any such thing.\" @webpagelink"},{"comment_id":"10153486672691336","commenter_b":"What do we have in place for allowing Muslims into the United States? I would like ALL OF THEM to be on a watch list. Same with anyone else coming here to settle. Also, what are we going to do with these illegals coming over our borders?? Until you are a United States citizen you should not be receiving benefits!!","commenter_a":"Why aren't race crimes punished on both whites and blacks? I know this question will not make it due to the fear of what will be said but it needs to be asked.","post_message":"What is YOUR one question for the candidates? Fox News and Facebook are teaming up to bring you the first GOP presidential debate. Submit your question in the comments below or click here: @webpagelink to upload a photo or video. It could be featured in the debate August 6th on Fox News Channel!"},{"comment_id":"10153239579440329","commenter_b":"Bitches be trippin'","commenter_a":"@username @username Cayla Ray hmmm I don't know anyone like this","post_message":"That One Co-worker who gets weird when people touch their stuff."},{"comment_id":"1711755495764368","commenter_b":"Where all her pussy friends at doeeeee 🤔😂😂","commenter_a":"@username 😂","post_message":""},{"comment_id":"10153834511188721","commenter_b":"Suck on these nuts","commenter_a":"@username Beetje bullshit dat \"size of the earth\" Nog steeds wel zieke shit, though!","post_message":"Space, folks. (via Mic)"}]
