[{"comment_id":"10153009294016680","commenter_b":"Why doesn't he run for Lt. Governor and Dog Catcher, while he's at it! 😡","commenter_a":"Who says money can't buy you elections - er, I mean, caucuses. Now he can continue to get paid for doing a job he won't be doing while he is attempting to further his political ambitions.","post_message":"Rand Paul is closer to getting his way. | AP Photo @webpagelink"},{"comment_id":"466812640175338","commenter_b":"Hang tee bitch.","commenter_a":"Close all borders indefinitely. NOW","post_message":"Muslim Refugee Beats And Rapes Woman In North Dakota While Yelling 'Allahu Akbar' [VIDEO] It's starting to happen in America. We cannot allow any more refugees into the U.S. Do you think we should close our borders to refugees?"},{"comment_id":"1281193278643588","commenter_b":"THAT is what Hillary said she is going to do. People out there are saying she wants to abolish the 2nd amendment...which couldn't be done by anybody.","commenter_a":"Gun Control? How about enforcing the current laws. Statistically less than 25% of the current federal firearms laws & regulations are enforced. If all of them were enforced gun violence would be almost nonexistent.","post_message":"Summer vacation is over, and it's time for Congress to get to work."},{"comment_id":"1652752338307075","commenter_b":"Wow what a dumb bitch. She's also so stupid that she thinks all Muslims are from other countries. That's funny. Pretty sure my Muslim aunt was born and raised American and so are her children!","commenter_a":"LOL They must be Muslim, people are loosing their minds, they come to a western country, because they don't like there Muslim rules, now they want to change things hear. Can we petition to Ban all Muslims???? Maybe they are color blind!!!!!","post_message":"Students sign petition to ban the song \"White Christmas.\" This is how crazy political correctness is on campuses today!"},{"comment_id":"10153636723007507","commenter_b":"^This is feminism. Mmmmm smell the equality!","commenter_a":"You know what? Doctors have been ignoring women's pain as imaginary forever. Everything is not about race.","post_message":"The need to constantly reiterate black humanity—because that’s what this comes down to—is both fatiguing, and frankly, infuriating."},{"comment_id":"10154148489244060","commenter_b":"@username I just think OUR country needs to find a way for its CITIZENS to be productive, if we want to limit immigration ..just an idea","commenter_a":"You are forgetting that Rodney King was drunk and high on PCP. He also attacked the cops, that is clearly seen on video. White people who are drunk and high on drugs are beaten by the police when they resist arrest too... Please tell all the story of you are going to tell it. As for the Black Lives Matter movement goes, they just increase tension and stir things up. All Lives Matter, end of story. Where are the BLM protesters when two black kids are shot in their front yard in a gang-related shooting and there are no leads in the case? Nowhere. If a white police officer isn't involved, they don't care. They just want headlines, not community building. And that community is all of us, not just one ethnic group.","post_message":"Rodney King, an American taxi driver, was beaten by four LAPD officers after being caught speeding. He suffered a fractured facial bone, a broken right ankle and severe bruising and lacerations. It sparked a global conversation about police brutality; two of the officers were found guilty of violating King’s civil rights on April 16th 1993"},{"comment_id":"798386106976830","commenter_b":"MORONIC BITCH","commenter_a":"That shrill is so revolting! Don't know who is more disgusting, Conway or Trump!","post_message":"Maybe she really doesn't know better? Or is just plain stupid?"}]
