[{"comment_id":"670286056475622","commenter_b":"@username Andrew Givney","commenter_a":"Jordan Monroe","post_message":"'Tis the season to turn up."},{"comment_id":"10153196646006336","commenter_b":"Illegal Immigration !!","commenter_a":"the only thing i want this guy to speak is about cuban and latino massive immigration to USA !","post_message":"“The purpose of our laws is to protect our right not just to worship, but to live our faith as citizens of this country.” 2016 presidential candidate Marco Rubio spoke with FNC’s John Roberts about religious freedom today at the Faith and Freedom Summit in Iowa, saying that we’ve reached an era of growing religious intolerance."},{"comment_id":"1146391592075725","commenter_b":"ANOTHER RACIST TO PODIUM","commenter_a":"Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry","post_message":"LIVE: Presidential Nominee Donald J. Trump is in Warren to speak to supporters just 8 days before election day. More info: bit.ly/TrumpvisitsMCC"},{"comment_id":"10156328907740354","commenter_b":"This cheap harlot is getting a high price for her prostitution. I can only expect less from someone as low as her.","commenter_a":"Nasty skank!","post_message":"Surely Scarlett Johansson is working on a Koran version as well. Surely that's happening, right?"},{"comment_id":"10150710732969999","commenter_b":"@username Under Trump she would probably be stopped from entering the US.","commenter_a":"Now watch Trump dismiss this intelligent young Muslim woman with a bigoted insult as his ignorant fans cheer him on.","post_message":"\"Well, that’s really tragic that you hear these comments which are full of hatred, full of this ideology of being discriminative towards others,\" Malala Yousafzai said in response to Donald J. Trump's remarks on Muslims."},{"comment_id":"470527006471213","commenter_b":"This lady thinks she is the president,this too shall pass just like her food for the kids at lunch time.","commenter_a":"I still want to know who elected the bitch","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10157370299475725","commenter_b":"@username Here in the Houston area too. This is wrong. Build the wall!!!!","commenter_a":"I thank God for Mr.Trump, being I live here on the border in the San Diego area, we need to take our country back, illegals are everywhere, coming up here to have there baby's. its so wrong! Please help us","post_message":"This is a MOVEMENT - to take back our country! We are going to go non-stop -- all the way up to November 8, 2016 --- and beginning in January 17th, we are going to MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"}]
