[{"comment_id":"928965170496565","commenter_b":"They where good and did what they meant to do make us laugh, well done ladys","commenter_a":"As a woman seeing women strip down does not make me proud to be a woman. Keeping their clothes on and becoming doctors, lawyers, or a different type of role model would.","post_message":"'You make us proud to be women'"},{"comment_id":"10153527225684255","commenter_b":"pre-civil rights and more white privilege.","commenter_a":"War. Environmental disdain. Injustice for all but 'ordinary white folks'. Coat hanger abortions. Dirt roads. Family 'secrets'. Weapons. Vigilantes. Klansmen, those gallant white knights of chivalrous times. Tarring and feathering of \"revenues\". Constitutionally inspired militia to kill picketers and whining war vets. Cold hearted popes. Freedom to convert Jews to Jesus by whatever means necessary. Make hatred cool again.","post_message":"What do they mean when they say that? To which supposed golden age of America do they want to return? Who can say what is in the hearts of such people? #DailyKosClassics By Daily Kos user Steven D"},{"comment_id":"1136778326378278","commenter_b":"Mizo I am not shia. But i am sure shia love this place aswell I can never imagine they can do this cowardly act it is time to hug each other regardless of there beleive let Allah to decide and guide us all the ryt path. I am in the favor of a united muslims across the world regardless of there beleive. Muslims getting butchered across the world. Innocent children women are getting bombed every single day. For God sake be united. May Allah protect all the muslims across the world.","commenter_a":"inshallah everything would be alright because the Angels of Allah look after our prophet house so I have suggest to King of Saudi to whip Shia from Saudi Arabia to somewhere else","post_message":"It exploded near the Prophet's Mosque, one of Islam's holiest sites. Update at 23:00 BST: Interior ministry has confirmed four security officers have been killed and five others injured."},{"comment_id":"1427954837264260","commenter_b":"I consider reading this page to be a spectator sport. ;)","commenter_a":"Such a disgusting Olympics. The committee needs higher standards.","post_message":"And you thought Rio's green pool was worrying!"},{"comment_id":"10156270295245354","commenter_b":"Illegals voting in California this should give the liberals some help. GO Trump !!!","commenter_a":"They focus on Gun Control, in the Debate, they will lose the Election","post_message":"Here's what's on deck for tonight's Democrat presidential debate..."},{"comment_id":"10153081703864024","commenter_b":"AMEN!!! Don't let these racist win, because all the cops are going to do is profile and stop people that are poor or of color","commenter_a":"Mayor wrong direction","post_message":"The mayor made clear he's not planning a return to stop & frisk policing, saying “Going back to an unconstitutional, alienating approach is not only inappropriate and unfair to the populace, it doesn’t work.\""},{"comment_id":"10155018887269329","commenter_b":"Rehash rehash... blah blah you lefties, blah blah. We won blah blah. No new content. Regurgitation continued. Yawn.","commenter_a":"You'll fit in with the self-important Hollyweird glitterati JKR. The British have never been enamoured of their paid entertainers except for simply that, as entertainers, who are well paid for their craft. The disenchanted and disenfranchised led the way with Brexit. Believe me, those who formed this majority are not racist not are they Ill educated. Nor are they of the lower socio-economic strata of society. They are the majority who stopped being intimidated by the PC brigade. The U.S. followed and Europe is next. The pendulum has swung back in reaction to the rot spreading from the highest echelons of government down, aided and abetted by a dishonest press and a compliant and unrepresentative public service.","post_message":"J.K. Rowling has outdone herself."}]
