[{"comment_id":"10154388349554657","commenter_b":"Put the witch on a stick and burn her.","commenter_a":"Should be incarserating her.","post_message":"It is the political story that just won’t go away for Hillary Rodham Clinton:"},{"comment_id":"1735235890068335","commenter_b":"Liberals are the TRUE racists......","commenter_a":"The Democratic Party should be so proud of their supporters. Trashing Police Cars, yep, you Democrats are awesome !!! And you wonder why Trump is doing so well, Idiots..","post_message":"WATCH the chaos that erupted in Southern California outside a Donald J. Trump rally where at least 20 people were arrested. @webpagelink"},{"comment_id":"1344780435541174","commenter_b":"Yes For Hillary!!!!!!","commenter_a":"Vote Hillary","post_message":"Watch: Hallie Jackson gives a special preview of what's to come on #ElectionDay from NBC News HQ in New York! Full coverage all day: @webpagelink"},{"comment_id":"10156082273560354","commenter_b":"Why in truth is it impossible to build this wall and yet we can send people to the moon???????????????????????????????","commenter_a":"UNIVISION owns Rick Perry now?","post_message":"\"It’s 1,933 miles from Tijuana to El Paso to Brownsville and you’re not going to build a wall on that distance. What you are going to do is...\""},{"comment_id":"10154238918214411","commenter_b":"truth hurts huh","commenter_a":"Republicans are nothing but Bible toting A HOLES who care nothing for other people you know that the party is a minority why you ask because the only way these jerks get elected is because of voter apathy if everybody would vote the Republican jerks would dry up and blow away","post_message":"Cheer up Republicans. The presidential race may be a mess, but you controlling state legislatures..."},{"comment_id":"10153842022041336","commenter_b":"@username. You are a blooming idiot fool!!","commenter_a":"Too egotistical! He will never resign but, he will go down in history as the most Anti-American and incompetent man ever to reside in Our White House without doubt!!","post_message":"“We are in World War III,” Michael Goodwin said on 'The Real Story.' “And if America is not going to lead, who is?”"},{"comment_id":"10153820420328816","commenter_b":"they are whores","commenter_a":"without the John Doe investigation we never find out the Walker's deputy cheif of staff steels $50,000 from a Veterns organization, Walker and his bunch are the worse kind of pigs.","post_message":"Scott Walker signed legislation Friday curtailing the ability of district attorneys to use the John Doe law to launch investigations like the probes they have conducted of his campaign and his aides and associates."}]
