[{"comment_id":"10153548009250575","commenter_b":"Women need to be cooking and cleaning for a man. Free time and they just get weird.","commenter_a":"That's just fkn nasty!!!!","post_message":"The Gateway Pundit - GROSS. Leftist Artist Uses Her Menstrual Blood to Paint Angry Portrait of Donald Trump"},{"comment_id":"10153104689788855","commenter_b":"WTF? The Advocate (or at least the staff involved in this article) clearly don't know what \"Twink\" is. These men are just aging well and don't have the outward appearance of what one would typically expect of their numerical age.","commenter_a":"Daryl Stephens is a hot man","post_message":"Sometimes, twink is forever (right, Darryl Stephens?)"},{"comment_id":"826031280920782","commenter_b":"She's just disgusting to look at..","commenter_a":"About time now she can pack so she can leave !!#!!","post_message":"Liberal trash has no place on tv.  This is the best news all year.  Do you think Whoopi deserves to be kicked off the air?"},{"comment_id":"1105360966151580","commenter_b":"this is some amazballs shit man!!!","commenter_a":"Heh. I know the guy getting his arm controlled. Had some classes with him in high school. Punniest guy I've ever met.","post_message":"Control someone else's arm with your brain, with relatively little equipment."},{"comment_id":"10154148875398721","commenter_b":"Vagitarian: when you vote for her because she has a vagina.","commenter_a":"In your lying phony dreams","post_message":"For many older women, voting for Hillary Clinton on Tuesday is about making history."},{"comment_id":"1649214788452320","commenter_b":"She is one ugly mofo ..lol","commenter_a":"So true -- just the respect HE deserves, not his (temporary) office.","post_message":"No problem, Crazy Lady."},{"comment_id":"10153237445176323","commenter_b":"Godddd she's so needy. That hoe def aint loyal. We all know what happens to hoes like that...they get burnt","commenter_a":"@username @username dam Cheryl is annoying... Defriend straight away","post_message":"When is Cheryl's birthday?"}]
