[{"comment_id":"718075635009295","commenter_b":"Mrs Trump has nice Tits too lol","commenter_a":"Mrs. Trump, what an elegant peaceful person, a very classy confident individual...reminds me of Nancy Reagan!!!","post_message":"Michelle Obama will be remembered as the most vile and arrogant First Lady in US history!!! Let's get 4,000 SHARES to support our NEW First Lady Melania TRUMP!"},{"comment_id":"10153358491932217","commenter_b":"where were these anti-facists when Women were attacked in Cologne","commenter_a":"Natalie","post_message":"Bricks were thrown as far-right & anti-racism protesters clashed in Dover."},{"comment_id":"10153814775523797","commenter_b":"A woman being drunk is not a license to violate her. Go Sit Down somewhere....","commenter_a":"exactly she was drunk she dk what he was saying or doing she just wanted n excuse to sue these officers n live off our tax dollars rest of her life n not work","post_message":"CITY PAYS DRUNK WOMAN: Well, not exactly. #Chicago taxpayers will shell out money to compensate an inebriated woman who accused two police officers of sexually assaulting her. What do you think? Details here:"},{"comment_id":"10153086796225927","commenter_b":"That's funny cause white asain Mexican Irish an all the others can do it..but somehow the black father is the victim for leaving families an going to make another broken home","commenter_a":"That's crap. You choose your own way like everybody else.","post_message":"LISTEN as Reverend Cecil Blye CONDEMNS government's role in destroying the black family:  \"[T]here can be no Great Society when government involvement incentivizes family disintegration, making it more profitable to cohabit than to be married. ...\""},{"comment_id":"10153317149514087","commenter_b":"@username Ok I demand that and also anyone who rents to an illegal be punitively fined. Good enough? Oh yeah and build that wall and shovel the illegal bastards out of the country. Ok Tommy-boy?","commenter_a":"No the majority of Americans do not want to keep the illegal bastards, but they do want immigration reform- it's called a wall! To hell with Sanders vote Trump!","post_message":"“We cannot and must not sweep up millions of men, women and children, many of whom have been here for years, and throw them out of this country,” Bernie Sanders said Monday. “As president, passing a legislative solution to our broken immigration system will be a top priority. But, let me be clear—I will not wait around for Congress to act.”"},{"comment_id":"10154963463661320","commenter_b":"Prayers yes! How about the right time defend themselves with firearms?????","commenter_a":"Praying for peace once again. Sorry for all the victims and their families.","post_message":"The people of Berlin are in our thoughts after today's deadly truck attack at a Christmas market."},{"comment_id":"10153664203915950","commenter_b":"And you should be judged because you're a moron, Mary.","commenter_a":"How are you going to ban an American Muslim???!!!!! Wake up Mr. Trumpo!","post_message":"Donald J. Trump is pointing to the deadly Orlando attack to reiterate his support for the Muslim immigration ban he proposed last winter."}]
