[{"comment_id":"1242442195775531","commenter_b":"Some people like me are deathly afraid of spiders!!! Black widows can kill people!","commenter_a":"These foods are from plants. They grow outside on a farm. There are bugs and animals outside. Bugs crawl on plants! Good grief. Dump your produce in a colander in the sink and wash it.","post_message":"YIKES! A Bothell woman tells KIRO 7 she found a black widow spider hiding in her package of grapes.  Gary Horcher is talking to the woman, who has a warning for shoppers. >> @webpagelink"},{"comment_id":"10153765573361336","commenter_b":"ISRAEL WAKE UP FOR EVER Israel must wake up, get up, 90% Arab are Terrorists !! ISRAEL Must Destroy your enemies, terrorists and traitors in your country and out, do not sleep, do not sleep !! Palestinians & Obama are the Biggest Lie in History ! Jerusalem Never mentioned in the Muslim Koran !! Jerusalem is written thousands of times in the Torah, Jewish Bible !!! No loyalty = no citizenship !!!! Israel You are Lucky !I the Arab leadership Started today to murder Jews.!! in 2020, then the Jews would have found sleeper, wake up ! Never were Palestinians ! tribals killers today call themselves Palestinians ! Different tribes of killers arrived in Israel since 85 years and they want a country !? Please Supreme Power Main, Creator of All the worlds & Souls, please GOD Bless the IDF and ISRAEL for Good. Destroy all the enemies of Israel ...","commenter_a":"It's absolutely BS that I had to go to Afghanistan twice in order to afford college. Making public higher education institutions tuition free isn't a bad idea at all. If we can pay for a war in Iraq then we can definitely pay for college. It's an investment in America. That's the first step on how you make America great again. #feelthebern #bernie2016","post_message":"President Barack Obama's message to U.S. troops in Afghanistan: 'I do not send you into harm’s way lightly… but as your commander in chief, I believe this mission is vital to our national security interests.' @webpagelink"},{"comment_id":"1209775645709130","commenter_b":"I vote they electrify the fences and start allowing the military to shoot them. Let those ragheads stay in their sandboxes.","commenter_a":"It is an invasion!","post_message":"'This is not a refugee crisis or a migrant crisis, it's a mass popular movement with an unlimited supply of people.'"},{"comment_id":"1023389334348744","commenter_b":"freaking australia","commenter_a":"How so they come up with 95 millions years?","post_message":"This bizarre species of shark is thought to date back at least 95 million years."},{"comment_id":"1004981906294263","commenter_b":"Hillary DESTROYED him.","commenter_a":"I believe Trump won, but barely. What he should have pushed on and pushed really hard are three things. First, he should have looked directly into the camera and said, 'Mrs Clinton has said over and over that she is infinitely more qualified than I to be Commander in Chief. She could not and actually would not protect four lives let alone 320 million. Do YOU trust her with your lives and those of your children? Mrs Clinton has said over and over that she understands the plight of the inner cities and has worked hard to erase the despair that exists in our minority communities. Tell me, Chicago, Baltimore, East Saint Louis, and every other inner city, this woman has had nearly thirty years to help you and other than pander for your vote, exactly what has she done and are your lives better? And lastly, Mrs Clinton has ...","post_message":"The 1st presidential debate in 90 seconds.  Who do you think won – Hillary Clinton or Donald J. Trump?"},{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."},{"comment_id":"1229557370394944","commenter_b":"The GOP doesn't like it when the democrats do to them what they had been doing to the democrats since Obama was elected.","commenter_a":"Games. . .ugh! Both sides need to just stop them!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
