[{"comment_id":"868204976635103","commenter_b":"wow u got gender-feminists handing out federally funded dildos and rubbers to 6th graders...and you say \"porn' is the public health hazard?? lol","commenter_a":"Hey hey, this is a serious problem now, let's stop everything and focus on this!","post_message":"What do you think of this development?"},{"comment_id":"10154892796939927","commenter_b":"Hi Kay Facebook Animal Adventure Park","commenter_a":"When the hooves start to come out they are gonna go live from a ground cam, if u like their page u can turn on notifications for videos so u will get a notification to make sure u don't miss it :)","post_message":"LIVE: Giraffe Cam! We continue to watch and wait for April the giraffe to deliver her new bundle of joy."},{"comment_id":"430612380465476","commenter_b":"And what about the.over a million citizen muslims already here?","commenter_a":"Muslim immigration should be halted in this country and every other civilized country. Radical Islam is killing the world's people while government ignorance (Political Correctness) stands by and allows it to happen. Obama needs to stop apologizing for America and start protecting the American people.","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"},{"comment_id":"10153594349921162","commenter_b":"Yolo","commenter_a":"Cesar Orozco @username @username","post_message":"Tomorrow could be the hottest day in nearly 2 years - if we reach 93!"},{"comment_id":"10153536976196336","commenter_b":"Talk to Moon beam aka governor Brown of California. It is in San Francisco that an illegal alien killed a beautiful person. He encourages sanctuary cities for illegal immigrants and lets them get drivers licenses and so with liberals it's take from the people who work and pay taxes and let them pay for all the illegals. I don't want to give my hard earned money to whatever the state chooses to spend it on but liberals will continue until they are ousted. And that goes for Republicans as well. No one in either party deserves to hold office if \"our\" welfare doesn't come first. And I don't mean welfare as in free stuff.","commenter_a":"what...how can any illegal alien hold a government position? Oh yeah...California the land of goofballs.","post_message":"\"This is worse than sanctuary cities. Now we're giving them sanctuary boards.\" – Neil Cavuto"},{"comment_id":"1017389715024162","commenter_b":"@username Muslim terrorist ? Kill them simple.","commenter_a":"When you head to the polls in November, remember, Hillary Clinton tweeted this : \"Let’s be clear: Islam is not our adversary. Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" — Hillary Clinton (@HillaryClinton) November 19, 2015..","post_message":"Newt Gingrich said President Barack Obama and Hillary Clinton are \"misleading\" the American people about the #OrlandoShooting by refusing to say \"radical Islamic terrorism.\" @webpagelink"},{"comment_id":"10153347814342426","commenter_b":"glad they got this on camera so she can't talk any bull about this officer!! crazy women","commenter_a":"Should've knocked all her teeth out period.....","post_message":"Going to the DMV can be stressful, but this Florida woman completely lost it at the counter. After she was asked to leave, the 31-year-old woman would not go without a fight -- with a Florida State Trooper."}]
