[{"comment_id":"1837423903207723","commenter_b":"She speaks in a strange language called hooking and whoring.","commenter_a":"Jackie Kennedy: BA in Arts Hilary Clinton: graduate Yale Law Michelle Obama: graduate Harvard law Laura Bush: degree in eduction, Masters in library science Pat Nixon: worked odd jobs to put herself through college including sweeping the floor of a bank! Graduated with the equivalent of a masters degree from the University of Southern Cali. Lady Bid Johnson: BA in journalism from the university of Texas Nancy Raegan: drama and English major graduate of Smith Melania Trump: college dropout. Model, married her sugar daddy, excuses his misogyny as \"boys will be boys\" lies on command. I don't care if she's posed nude so long as she has integrity. If she's honest. If she's got a mind of her own. But she doesn't. And that's a problem. Yep. Awesome role model. AWESOME. 🙄 #GiveMeABreak","post_message":"Liberal or conservative, misogyny is misogyny."},{"comment_id":"807827122679666","commenter_b":"@username I think that the Muslims that really care must get out the message open the Mosque no more secreats or hit the F g road and go home two sharia law","commenter_a":"I'm so sorry for any Muslim reading these comments. Truly. People are so horrible. I can't belive I identify as a Republican along with this people. You are welcome in my world.","post_message":"Ban all Muslims? Seriously, Donald J. Trump? #GOPDebate"},{"comment_id":"10154026090214087","commenter_b":"Obama give the worlds largest terror sponsor a nuke deal. What the hell is that shit about? I know whats going on. You are just stupid. Hillary's top aide huma is a fucking muslim terrorist. This bitch lived in the middle east and wrote for Islamic extremist magazine. She wrote all kinds of anti american articles. And you dumb dip shits run around blind as a damn bat. You people have some real issues. Liberals are whack.","commenter_a":"I think Obama being the first Black President/so awesome set the bar too high for the first female President. We know many stellar women before Hillary never got a shot in politics. Hopefully Hillary breaking the glass ceiling improves equality even tho shes not ideal.","post_message":"\"Hillary Clinton is still changing the way we thought about women as spouses and politicians.\""},{"comment_id":"10153837082186130","commenter_b":"Just like a woman - fickle and gossipy.","commenter_a":"I'd like to see a woman president too. The right woman president. Someone so awesome she makes everyone wonder why we waited so long for that woman. I don't think we've found that woman yet.","post_message":"It's not neccessarily an endorsement for Hillary Clinton, but..."},{"comment_id":"10155151069049575","commenter_b":"If she can't raise her kid right she should have not ever been pregnant","commenter_a":"Single moms struggling to pay bills and work where she has to work long days just get by on 8.00 dollars an hour with no time left for teenagers out of control who know everything, i vote with helping the mom , the hardest job on any day.","post_message":"Teen who was among five arrested in downtown fights Saturday night admits she needs help. 16-year-old describes it as, \"scariest night\" of her life."},{"comment_id":"1146391592075725","commenter_b":"ANOTHER RACIST TO PODIUM","commenter_a":"Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry","post_message":"LIVE: Presidential Nominee Donald J. Trump is in Warren to speak to supporters just 8 days before election day. More info: bit.ly/TrumpvisitsMCC"},{"comment_id":"10153053080376336","commenter_b":"She should have been thrown put on her fat a**.","commenter_a":"How about firing the witch for inappropriate behavior toward our Veterans! She's disgusting!","post_message":"\"Had she been a veteran herself or served in the military, she would probably have a different thought on how she treats our veterans.\" The Veterans Affairs manager in Indiana who mocked her patients’ mental health has been placed on paid administrative leave."}]
