[{"comment_id":"10153333676096680","commenter_b":"Yep, karma is a bit*h !!","commenter_a":"This is the best election ever! The irony of Republicans being upset about the Pope questioning the religion of a politician is absolutely overwhelming...considering the constant questioning and outright ignorance about the faith of President Obama. And do not get me started on them running a Canadian after 8 years of racist birthers.","post_message":"He's mad."},{"comment_id":"683548041835774","commenter_b":"Let them go home!","commenter_a":"Don't like Halloween, keep your children & yourselves in the house with the lights off....","post_message":"Halloween has been banned in this state as not to 'offend Muslims'. This must be some kind of joke. They can't stop us from celebrating. Will you celebrate Halloween regardless?"},{"comment_id":"10153517289928352","commenter_b":"They needa kill your ignorant ass.","commenter_a":"Idk but kill it","post_message":"An alien-like creature fished out of a toxic river or a neglected bear: What IS this scary looking beast which can chew through its steel cage?"},{"comment_id":"10154720750937235","commenter_b":"Michael M you r an ass hole !!! No one cares what you think !! You r ugly and evil with no soul just like Hillary !!! You and Meghan r made for each other !!! You r a disturbed individual !! Making fun of hard working people struggling because of Obamas policies !!!. We all should boycott. All your crap . I will . Those hard working people paid to see your movies ! Thats how u got rich !! Thanks to the deplorable's. You 😤😤ASSHOLE !!","commenter_a":"Michael Moore will do anything for media attention and money.","post_message":"You've no doubt seen folks in your Facebook feed who believe Michael Moore is making the case for Trump.   That is a LIE."},{"comment_id":"480250615511785","commenter_b":"she is a lier","commenter_a":"She's teflon!","post_message":"It really doesn't make any sense... www.eaglerising.com"},{"comment_id":"10153101255675779","commenter_b":"Tailgate Savannah only time will tell i like ronda but she is getting a bit arrogant t","commenter_a":"ronda rousey is gonna lose to holly like if you agree","post_message":"Ronda Rousey visited the The Tonight Show Starring Jimmy Fallon last night to promote her upcoming fight with Holly Holm and discussed Floyd Mayweather and challenged Fallon to a Mario Kart match. Watch below."},{"comment_id":"1117171088374939","commenter_b":"Amen","commenter_a":"Sir where have you been to be so incredibly deceived?","post_message":"Live from the MGM Grand Las Vegas lazy river pool: Dana Perino and Chris Stirewalt record their pre-debate podcast, 'I'll Tell You What.' #debates"}]
