[{"comment_id":"10154325852416323","commenter_b":"The woman is a perpetually grinning dimwit. She'll probably become PM.","commenter_a":"Fucking moron","post_message":"\"At least 50% of her public statements sound as if they were said for a dare. 'Let’s banish pessimists.' 'Boris Johnson is a lovely man.' The rest sound like she’s assembling endtimes magnetic fridge poetry.\""},{"comment_id":"1115942415111321","commenter_b":"You are a woman, you are worthless, you shouldn't vote. See? That's how you sound. Btw, #hillaryforjail.","commenter_a":"I did not know Gov. Mike Pence. Thanks @username, I like his backbone. Voting Trump/Pence Donald J. Trump thanks for standing firm for the safety of America.","post_message":"If you ever had any doubts about Donald J. Trump sticking with his divisive and dangerous plan for America—say hello to his new running mate."},{"comment_id":"1194642483887307","commenter_b":"Still need to deal this evil bitch a Blow","commenter_a":"easy defense... animal was not collared, violated leash laws, and was a threat to their own pets and property.","post_message":"She killed the cat because she believed it was a stray and became a nuisance, but a couple who testified in court this week said “Tiger” was their pet."},{"comment_id":"10153270822682061","commenter_b":"My neighbors steal them!","commenter_a":"I had a neighbor take mine. To prevent it from getting stolen. I'm glad I had neighbors watching out for me.","post_message":"WATCH: 'Bait packages' used to catch thieves stealing deliveries from front doors. What is being done to stop this from happening as we enter the holiday season: @webpagelink"},{"comment_id":"1717609118507402","commenter_b":"She can move her wretched ass OUT!","commenter_a":"Please","post_message":"Michelle Obama: Every single day, \"I wake up in a house that was built by slaves.\""},{"comment_id":"780559568801287","commenter_b":"Get a Real Job Bitch!!","commenter_a":"on welfare??? guess how much those tattoos cost>>???","post_message":"Welfare Recipients In THIS State Just Received Some DEVASTATING News  It is unethical to leech off the hard work of others.  Are you fed up with welfare moochers?"},{"comment_id":"10155048083994182","commenter_b":"she's a jerk","commenter_a":"The only person it would be a stock to is the teachers union . Because they do not really care about the children it's all about them.","post_message":"Elizabeth Warren has been outspoken against Betsy DeVos. But there was once a time she was in favor of school choice....  What changed?"}]
