[{"comment_id":"941236165936132","commenter_b":"Je vais m'y opposer a son mariage ! Ce n'est pas normal qu'il est pas pense a nous...","commenter_a":"@username il nous a meme pas invite","post_message":"Congratulations Nikki Reed and Ian Somerhalder!"},{"comment_id":"417410465107501","commenter_b":"Should be shut down!! YEA---YOU'RE CHRISTIAN! !! ---- NOT!!!","commenter_a":"This is America and our two party system decides us all. No wonder that there are those who would help this business owner. Now let's see if this upright Republican claims all of it in taxes. My guess is that like most Republicans she will lie about it and cheat the government.","post_message":"Sadly, bigotry pays."},{"comment_id":"10152740585827426","commenter_b":"You are happy a man is now dead? Does that make you better than him? If you claim that he was a bad man, how do u know the people he wanted dead weren't bad men too? I'm glad you find satisfaction in a human beings death like some sort of animal","commenter_a":"Heck yeah!","post_message":"An internal investigation into Shannon Crane’s death is underway."},{"comment_id":"177307306103129","commenter_b":"Wrong! Never said in his first 30 days","commenter_a":"Didn't he defeat ISIS already? He said he would in his first 30 days.","post_message":"Join us as President Donald J. Trump delivers the Weekly Address."},{"comment_id":"1743922275826047","commenter_b":"150 million + illegal immigrants and 150+ million legal citizens out of work. Do the math its a wash get em out. Deport everyone last one of them and void any overstayed visas. Goodbye and goodluck","commenter_a":"These thugs are pay by George Soro's the Super Pac for Hillary, and the Bernie idiots that have nothing better to do.......the point is you will never see Republicans act like these IDIOTS!! This only pisses more people off to vote for Trump!! Trump for President 2016!!","post_message":"***SHOCK VIDEO***  Anti-Trump protestors in Albuquerque, New Mexico stomp on police cars, light Donald Trump signs on fire, wave Mexican flags...."},{"comment_id":"10154858254049497","commenter_b":"Hopefully, I last a little longer than 24 hours. 🤔","commenter_a":"@username :) Honestly, I admire this about you. You explore things and excel at them. But it's just kinda funny.","post_message":" crazy. He throwing himself into cooking and collecting vinyl when he only had his microbrewing kit 24 hours."},{"comment_id":"10153722294756350","commenter_b":"Nobody is forcing people to contribute","commenter_a":"This is what has been attained from people feeling low, down & out. Preacher Joel Osteen had amassed a fortune of $56,508,500 and lives in a $10,500,000 mansion in River Oaks. River Oaks is the wealthiest and most expensive community in Texas.","post_message":"Are you going through a tough time? Pastor Joel Osteen has some advice. (cc: Joel Osteen Ministries)"}]
