[{"comment_id":"1769292306444953","commenter_b":"With you in that thought...sad but so true. In jail all his basic needs would be met and even medical. Sad we treat jailbirds better than the homeless.","commenter_a":"Imagine if he'd actually been trying to steal the food so he could go to jail and have a roof over his head and food in his belly. But good on the judge anyways for showing some compassion in a world that is lacking these days.","post_message":"A bit of compassion in the courts can go a long way."},{"comment_id":"10155578231251509","commenter_b":"Leave then illegal.","commenter_a":"If Trump wins I'm leaving the country. If Hillary wins I'm still leaving the country. This isn't a political comment, I just want to travel.","post_message":"Watch Donald J. Trump supporters in Cincinnati, Ohio, react to the candidate's projected win in that state.  Live election results and coverage: @webpagelink"},{"comment_id":"10155501902685389","commenter_b":"Tell her to go home & en joy her granddaughter","commenter_a":"Hopefully it will be the beginning of the Clinton END.","post_message":"Hillary Clinton is expected to officially announce that she is running for president this Sunday. How will Republicans respond?   Tune in tonight at 10p ET for more details!"},{"comment_id":"10153516025754705","commenter_b":"No wonder you don't have any friends woman","commenter_a":"I hope this creature is captured and eaten by the Japanese","post_message":"What a spectacular creature."},{"comment_id":"1847137338904678","commenter_b":"Everywhere these devils go, they rape and murder the rest of the people. Just ask the Native Americans, the Aboriginies of Australia, and the countless number of African countries that still suffer from the effects of all the death and destruction caused by what the devils call imperialism and colonization. The devil who comes disguised as white people is absolutely disagreeable to live with in peace. It's been proven time and time again.","commenter_a":"Didn't take long for the racial comments on a post that has nothing to do with race. You are the people that make today's issues more of an issue than it needs to be. This man is disgusting","post_message":"SHOCKING! A sheriff's deputy is charged after he allegedly posted video of himself performing a sex act with a dog."},{"comment_id":"10154678664866037","commenter_b":"#CutHerLoose","commenter_a":"She should stay in jail where she belongs.","post_message":"Tulsa police officer Betty Shelby turns herself in after being charged with first-degree manslaughter — but has since been released on $50,000 bond."},{"comment_id":"946732062040088","commenter_b":"Right. Because all those women raped enjoyed it. *eyeroll*","commenter_a":"If you don't want to get pregnant that is a choice. If you don't want to get pregnant, don't have sexual intercourse. There's other ways to find physical satisfaction than sexual intercourse & they won't create a baby. Abortion IS NOT a means of birth control. It's murder. For those who are for abortion as a woman's choice, what about the choice of all of those female babies that have been aborted?","post_message":"So true."}]
