[{"comment_id":"10158232325655646","commenter_b":"Didn't one of those illegals walk back in and rape and murder a woman whose husband was a official of the government...This should not be able to happen in this country.","commenter_a":"Surprisingly enough nobody see's the resemblance to how the Jews were being taken during one of the Schutzstaffel's (S.S.) \"routine sweeps\" History Repeats itself my friends! We let it happen!","post_message":"Immigration and Customs Enforcement officials have yet to release details on how many people agents arrested Thursday, but advocates say more than 100 immigrants were taken into custody as ICE conducted home raids in Santa Paula, Oxnard, Van Nuys, Downey and San Bernardino. Those detained were either illegal immigrants with deportation orders but no criminal background, or family members of those sought who were home during the raids and told officials they lacked documentation, according to the Coalition for Humane Immigrant Rights of Los Angeles."},{"comment_id":"10153515225917994","commenter_b":"Then leave the country!!!!","commenter_a":"Another flag that represents racism and hatred.","post_message":"Confederate flags: History or discrimination?"},{"comment_id":"1178825752155659","commenter_b":"Bitch is crazy","commenter_a":"Delusional!","post_message":"HILARIOUS"},{"comment_id":"628439843967466","commenter_b":"Yep criminals think like that That is why she pointed a gun at the polw. @webpagelink","commenter_a":"Because they don't have anyone to be accountable to!!!","post_message":"This is for all of the victims of #PoliceMurder and #PoliceBrutality who never make national headlines in the mainstream media! @webpagelink"},{"comment_id":"10153590629541336","commenter_b":"Lady?","commenter_a":"How the hell is this \"lady\" not behind bars","post_message":"Ed Henry: “You were the official in charge. Did you wipe the server?” Hillary Clinton: “Like with a cloth or something?” WATCH: Today at a news conference, Ed Henry pressed Hillary Clinton as to whether or not she wiped emails from her personal server."},{"comment_id":"10153140992043645","commenter_b":"If this a show of 'real women' will they also let the hair on their legs grow??","commenter_a":"Sick.","post_message":"On a less serious note,... Armpit hair is a growing trend for women. Will you participate? Or heck no !?"},{"comment_id":"1259466750760461","commenter_b":"@username=republitard shitbag","commenter_a":"Really? Last I checked, this is still Obama's America...... Next year you can call it Trump's but for now it's ALL Obama......","post_message":"Welcome to Donald Trump’s America."}]
