[{"comment_id":"467950796728834","commenter_b":"Don't deport them-KILL THEM! They will only return if we don't . Simple truth","commenter_a":"He'll yes. Send them back were they came from. We are running out of bed sheets. Lol","post_message":"Do You Support Muslim Deportation In The United States? Comment 'yes' or 'no'."},{"comment_id":"10154963089002619","commenter_b":"basically right","commenter_a":"Israel will have no true peace except for a short while when the Antichrist sets up his kingdom there during the tribulation period Israel will have a false peace for 3 1/2 years.Jerusalem will again be trampled down by the gentiles for a short spell and then Armageddon.and then Christs return to stop the madness.","post_message":"“The chain of attacks from Paris to San Bernardino, from Istanbul to the Ivory Coast and now to Brussels, and the daily attacks on Israel, this is one continuous assault on all of us.”"},{"comment_id":"10153399487739411","commenter_b":"wrong , Britain has nothing to be ashamed about, its not British people planting bombs and blowing their own kind up, if you haven't got anything useful to say except the usual stereo typical crap then stfu and go away, preferably to the middle east if you think the people are so great. Its funny how people such as yourself preach \"tolerance\", care to show an example of tolerance shown by Islam or its followers","commenter_a":"To that ignorant little britain first shitbag you do not represent my country, Britain is built on the back of slavery, racism and bigoted xenophobic imperialism but today it SHOULD stand for tolerance, cosmopolitanism and living in peace with our collective of ethnicities from all corners of the former empire (Including Wales and ireland, remember when it was fashionable to hate the Irish too, wake up muppet divide and conquer is as old as politics itself.)","post_message":""},{"comment_id":"10153944195789456","commenter_b":"Wht a woman will do against their children over a man. Smfh","commenter_a":"They should be stoned to death!! Wasting bullets on them is too humane....","post_message":"HORRIBLE: A 3-year-old was found duct taped in a trash bag in a closet in Arizona, and was surrounded by feces. Here’s the disgusting reason the suspect allegedly hid the child:"},{"comment_id":"10153422129686636","commenter_b":"legal migrants not border jumping criminals","commenter_a":"Trump is a right wing extremist who perpetrates racial stereotypes about minorities to serve an agenda. Trump is an opportunistic bigot who has historically enjoyed good relations with Muslims but to become elected, he has jumped on the bandwagon of Islamaphobia. Attacking the Mexican community is also another opportunistic attempt to create hatred, division and anger. The most beautiful thing about America is its a nation of immigrants. A melting pot of many nationalities and a true leader would do everything in their power to unite all of us as opposed to dividing through religious and racial hatred.","post_message":"Well played, Canada"},{"comment_id":"10154493614517235","commenter_b":"How about just sending all of the whites back to their mother countries and leave the Americas to the Natives!","commenter_a":"I've always believed conservatives would destroy this country and it would appear they are well on their way to doing it - maybe we should boot the old confederacy out and let them make it on their own - if Mexico wants texas back, if france wants louisiana, spain wants florida or great britain wants the southern colonies, hey guys don't call us yankees - you got what you wanted LOL","post_message":"BUSTED."},{"comment_id":"10154796550641509","commenter_b":"Liberals must leave the country !!!!!","commenter_a":"Are you interested in joining the illuminati to be rich and to achieve your desires in life? If yes, Add me and Message me now so I can introduce you to the gate way to success.","post_message":"Experts warn that these labels do not really mean very much and can even be misleading in some cases"}]
