[{"comment_id":"766826556749286","commenter_b":"pigs","commenter_a":"Thug scum! Their families should suffer for the suffering they've caused others!","post_message":"So disturbing."},{"comment_id":"10153482643681130","commenter_b":"its on your page Joseph Zawistan","commenter_a":"\"Recent graduate initiated hunger strike\"....Lol. Why don't you use your degree and go get a fuckin.job and concentrate on future like you're supposed to do when you graduate.","post_message":"There's been a call for three top Student Senate leaders to resign, and a recent graduate initiated a hunger strike."},{"comment_id":"555451794642427","commenter_b":"About 40% of the nation supports Drumpf. The educated States should secede from the Union - ignorant racist are a cancer that needs to be excised.","commenter_a":"Suicide by obstructionist behavior.","post_message":"A lot of discussion has centered around the fact that we might be witnessing the death of the Republican Party. What would that look like?"},{"comment_id":"10153085724024228","commenter_b":"let her leave, she's the one who will suffer","commenter_a":"Let's not forget child-support from Miss congeniality.","post_message":"After holding baby Leo's hand for the first time, his dad fell in love."},{"comment_id":"576869582486929","commenter_b":"BULLSHIT !","commenter_a":"And who's to pay for the insurance? Oh forgot the WORKING CLASS WITH TAX THAT'S WHO!!!!","post_message":"Congress Approves Bill Offering Free Cars To Welfare Recipients. Your tax dollars hard at work. Does this disgust you?"},{"comment_id":"1792973144264831","commenter_b":"Come on Virginia We all know that Donald Trump is going to be president so let's rally behind him","commenter_a":"Those who vote for Crooked Hillary, are also crooked with a hidden agenda! TRUMP 2016!","post_message":"Terrific news in Virginia. Thank you for your tremendous support! I have a lot of amazing memories in Virginia - and I look forward to campaigning with you in the general!"},{"comment_id":"933155700053185","commenter_b":"go Hillary....... TO PRISON!","commenter_a":"I hope Hillary will serve her Prison Time as Gracefully as Martha Stewart did! She might even make some new girlfriends!","post_message":"THIS is who liberals want?"}]
