[{"comment_id":"1559248597428498","commenter_b":"Trump is a friggen rapist!","commenter_a":"Donald Trump and Hillary Clinton walk in to a bar. Donald leans over, and with a smile on his face, says, \"The media is really tearing you apart for that Scandal.\" Hillary: \"You mean my lying about Benghazi?\" Trump: \"No, the other one.\" Hillary: \"You mean the massive voter fraud?\" Trump: \"No, the other one.\" Hillary: \"You mean the military not getting their votes counted?\" Trump: \"No, the other one.\" Hillary: \"Using my secret private server with classified material to Hide my Activities?\" Trump: \"No, the other one.\" Hillary: \"The NSA monitoring our phone calls, emails and everything Else?\" Trump: \"No, the other one.\" Hillary: \"Using the Clinton Foundation as a cover for tax evasion, Hiring Cronies, And taking bribes from foreign countries?\" Trump: \"No, the other one.\" Hillary: \"You mean the drones being operated in our own country without The Benefit of the law?\" Trump: \"No, the other one.\" ...","post_message":"A 36-foot model of Donald J. Trump holding Hillary Clinton's head was burned during annual bonfire celebrations in a British town."},{"comment_id":"378947809141289","commenter_b":"Alex check your fact on the cost","commenter_a":"Yes","post_message":"It is now being estimated that a border wall will cost $21.6 billion, which is much higher than Trump's initial estimate of $12 billion. Would you support the wall being built at this cost?"},{"comment_id":"1174610022559026","commenter_b":"Build a wall , deport all illegal but no one will believe you","commenter_a":"Send them and their anchor babies home where they belong ,, Trump in 2016 ,,, I'll help with the roundup for free ,,,","post_message":"@JebBush faces Trump-led headwinds in attempt to change the GOP's tone on immigration."},{"comment_id":"10153308747171037","commenter_b":"Failing to report 1,100 donations and $145 million in donations isn't sinister. It's just a small bookkeeping error. This is how totally out of touch this moron and his wife are.","commenter_a":"And, I did not have sexual relations with that lady, Miss Lewinski.","post_message":"Former President Bill Clinton used his first interview since Hillary Clinton announced her 2016 campaign to address questions about the Clinton Foundation - by Dylan Stableford in Yahoo Politics."},{"comment_id":"10153180740642894","commenter_b":"GTFOH. what she suppose to tell the Man not to come around cuz of the media. She ain't playing house she wit a man that has morals and wants to marry her.","commenter_a":"He telling truth i don't know why have something negative to say in all ciara interview she like drama and she was put her son in the middle that's crazy😬😬😬","post_message":"Future Covers ‘XXL’, Says Ciara Tried to Overshadow the Success of His ‘DS2’ Album [Photo]"},{"comment_id":"536832686498611","commenter_b":"Some of bernies supporters have been crazy lately","commenter_a":"Hillary Clinton MAY HAVE BEEN a liberal at one point. She no longer is. She is a bought subsidiary of large business. If Sanders isn't nominated I'm staying home. She won't get my vote. Edit: I also will never forget the racism and division of Hillary supporters who made the entire DNC kiss their ass to mend fences. It's not \"her turn\" and if I had my way she would never ever see the White House.","post_message":"Let's not do the GOP's bidding."},{"comment_id":"10153100561240329","commenter_b":"She's a pornstar","commenter_a":"I'm like how'd she land that job..like what conversation took place..how's was the interview conducted..do u interview her or her vagina","post_message":"¯\\\\_(ツ)_/¯"}]
