[{"comment_id":"933533113336146","commenter_b":"Humans suck","commenter_a":"I donate to Amur leopards monthly. I hope we can save these lovely creatures!","post_message":"We need to take action now or risk losing some of the most beautiful citizens of our world."},{"comment_id":"10154010909024916","commenter_b":"I said it first along time ago. Its better for her to be Sanders VP then Hillary's. Two women running is dicey for guy voters. Plus hillary is too conservative for Elizabeth. it wouldn't work. Just Sanders/Warren. and secret service knows they would work to protect them the same as blacks running for president.","commenter_a":"Elizabeth Warren would make a great Vice-President and the next great President after Bernie!","post_message":""},{"comment_id":"10153008307071130","commenter_b":"Justifying double standards while still playing the perpetual victim. Yay modern feminism.","commenter_a":"Are we not gonna talk about how a 50+ year old lady forced herself on a 20 something guy? Because if it was the other way around, I'm sure you'd have milked it every possible way.","post_message":"In the ongoing saga of things brands should never tweet..."},{"comment_id":"533146616873631","commenter_b":"She is a racist nigga pig","commenter_a":"Not that he's is so bad give up the race crap","post_message":"I AM SICK AND TIRED OF THIS BS..."},{"comment_id":"849566101841798","commenter_b":"Ignore Spenser Jeffery, he's bankrupt, c);-)","commenter_a":"God Bless this wonderful man! God bless his family and many friends. You truly lost a good man. Prayers and all the respect in the world to him and his family!! Please holy father, take this wonderful soul into your loving arms, amen and amen.","post_message":"\"I swear to God I love this city but I wonder if this city loves me,\" slain officer Montrell Jackson wrote on Facebook earlier this month."},{"comment_id":"10153200218821636","commenter_b":"Not even a single Scottish one who wrote this article....","commenter_a":"@username waaaay yours didn't get a mention","post_message":"Warning: reading this will make you hungry"},{"comment_id":"1107945392631847","commenter_b":"Even though the Stupid bitch cuts my sandwiches diagonally.","commenter_a":"Bernie is in my dead pool. Die Bernie... The sooner the better!!!","post_message":"Here's actor Mark Ruffalo and director Matthew Cooke on why Bernie Sanders is the right candidate at the right time. Video shared by Occupy Democrats, LIKE our page for more!"}]
