[{"comment_id":"992434430797029","commenter_b":"That woman needs to be locked up in the nearest lunatic asylum.","commenter_a":"Pathetic & scary scenario is these lunatics own guns! She probably packs a gun in her Walmart plastic purse! When these nut jobs escalate as she did, back up & run!","post_message":"Something tells me this nut is a Tea Partier."},{"comment_id":"10152779839917093","commenter_b":"Looks like young man, yes respectful,young man was very patient with his mother for not striking her Yes that was courageous of her to find her child and protect him. God bless you guys. I hope you can see that there is so much unspoken love in this video.","commenter_a":"A mom who cares. Very brave woman!","post_message":"Mom finds her son in the middle of the Baltimore riots... many are calling her Mom of the Year for what she does next. @webpagelink"},{"comment_id":"1742093019366838","commenter_b":"SUCKS","commenter_a":"Lisa Nicklas Villota!!!!!","post_message":"Thank you to the LGBT community! I will fight for you while Hillary brings in more people that will threaten your freedoms and beliefs."},{"comment_id":"10153593606745575","commenter_b":"@username That would require the removal of the colored beast as well as the illegals as they are responsible for 49/50 murders in NYC ofr instance. 96% of all crimes in that city and a whopping 98% of all gun assaults. Liberal American preaches these two species are to be housed, fed, clothed, educated and given the best medical treatment in return for their confusion between acting civilized and acting like animals.","commenter_a":"You women need to vote Republican or this will become common.","post_message":""},{"comment_id":"604077913107506","commenter_b":"Heather: have you been living under a rock, or have you just somehow managed to not notice Hillary trashing her husband's mistresses (or victims, depending on how you want to look at it)? You're right, sexism IS still at large in this country, yet you want to vote for a woman who openly bashes other women and stands by her cheating, lying, scandalous husband? I'm not saying I like Trump, but dear God woman, have some respect for yourself. If you really think Hillary is going to stand for your rights any more than Trump will, then you obviously need to do a little more research.","commenter_a":"And it is unfathomable that a man with such decency, courage and leadership, as exhibited by her husband, has so often been disparaged and attacked by the right while they embrace a fraudulent sexual predator.","post_message":"\"I can’t stop thinking about this — it has shaken me to my core,\" Michelle Obama said of lewd remarks by Donald J. Trump."},{"comment_id":"1180369135336890","commenter_b":"She needs to go home, sit on a rocking chair on her front porch and wave to the people in Russia.","commenter_a":"They should be confined together in a room with no outside communication, in or out for at least ten years! Trump and Palin; both ignorant buffoons!","post_message":"Palin tries to take on the “spineless pundits” criticizing Trump - and fails miserably."},{"comment_id":"1003038786410224","commenter_b":"Boycott George Clooney!","commenter_a":"Doesn't he still support Clinton?","post_message":"George Clooney is right: the powerful influence of money in politics is obscene, and it is my belief that you cannot do away with big money in politics if your campaign is funded by big money."}]
