[{"comment_id":"10154473898974411","commenter_b":"@username stick to your supermarket shopping you dumb f","commenter_a":"So many ignorant people commenting on this. This is a traditional harvest of one of the only renewable resources the inhabitants of this barren rock can survive from. Educate yourselves.","post_message":"'The ordeal began this morning when locals spotted a pod of between 100-150 pilot whales'"},{"comment_id":"10153095297087908","commenter_b":"What's your problem with little girls?","commenter_a":"A bunch of bitchy little girls.","post_message":""},{"comment_id":"10152715320866636","commenter_b":"Bc she is a twat!","commenter_a":"But how is this possible? Our esteemed governor immediately came back with, \"Nope, can't afford it,\" when the idea of building storm shelters for the schools was put before her...","post_message":"When an E-F 3 tornado passed dangerously close to El Reno Schools, the district took steps to ensure that if it ever happens again, students and staff will be safe."},{"comment_id":"10153451405011336","commenter_b":"The sooner the better. We're going to need them to bail us out.","commenter_a":"When are we joining the European Union?","post_message":"JUST IN: The Confederate flag will be taken down Friday. @webpagelink"},{"comment_id":"510825025771036","commenter_b":"Exactly!","commenter_a":"The Greatest Good Common Sense is being questioned. Hope these will be at the FUNERALS of those killed by their bad rhetoric.","post_message":"Dr. Ben Carson weighed in on President Barack Obama's open door policy to refugees. What do you think about his comments?"},{"comment_id":"10154734900826509","commenter_b":"U know muslims r gangraping british girls in UK","commenter_a":"RIP europe, immigrants will destroy europe, it has started from turkey , so i request all people to visit europe before it gets turn into europistan , after there would be many restrictions of burqua etc. And be ready to see ETHNIC EUROPEAN MIGRANTS LEAVING EUROPE FOR ELESWHERE.","post_message":"Terror suspect Salah Abdeslam has been extradited from Belgium to France, Belgian authorities say. The Belgium-born French citizen faces prosecution there in relation to the Paris terror attacks in November."},{"comment_id":"881902208536195","commenter_b":"At least he is not a puppet, says the supporter of Marxist-Leninism.","commenter_a":"Funny how the enemy jumps straight to laugh..at what seems to be normal..we love you BOB born to be stronger, born to live longer...91years of age...and still fit ...let them laugh...You are the GREAT ZIMBABWE WALL..you don't need to go to care home...unlikely some white folks at your age will die alone in their care home...without grand kids....","post_message":"Robert Mugabe orders the internet to delete images of him falling over at event... and this is how it responds."}]
