[{"comment_id":"1283029891737480","commenter_b":"It is so embarassing to see some women with such low IQ and/or low self-esteem.","commenter_a":"TRUMP for PRESIDENT...GO TRUMP","post_message":"The crowd cheered."},{"comment_id":"1252197194828825","commenter_b":"One of the 2 things I don't like","commenter_a":"Smokers are disgusting","post_message":"WARNING TO PET OWNERS: It's not just second-hand smoke that's harmful for your four-legged friends. Pets are also at risk for being exposed to residue that lingers on skin, clothes, carpets, and other household items."},{"comment_id":"1044606575560353","commenter_b":"Bwabhhhaaahhhhaaaaa.:O On 24/02/2015 1:30 AM, \"Facebook\" <","commenter_a":"Does category number 11 include parents?","post_message":"Who drinks the most coffee?  Image by I Love Coffee via AsapSCIENCE."},{"comment_id":"1260437270671484","commenter_b":"come on something good has to happen, we had a failed bomb in a car earlier","commenter_a":"El mi nomas cesar godinez ok pinches lacras puro blu cabrones","post_message":"BREAKING: Police pursuit in Palmdale, CA (Viewer Discretion Advised)"},{"comment_id":"1308930149151726","commenter_b":"Smug asshole !","commenter_a":"and why is anyone voting for this self centered fool ....","post_message":"His response is simply \"deplorable.\""},{"comment_id":"10153579944776438","commenter_b":"If he hates it that much, he can step down and we can keep his paycheck.","commenter_a":"lol @ headline","post_message":"\"He hates it.\""},{"comment_id":"10156243420205389","commenter_b":"For what? So they can keep turning a blind eye to little boys & girls being raped every day over there? If we're not PROTECTING the innocent anymore, it's time to leave.","commenter_a":"I do not believe he is a Muslim, he is a puppet for the Muslim brotherhood without a doubt and he does hate America","post_message":"President Obama will extend the U.S. military’s stay in Afghanistan beyond the end of 2016, casting aside his promise to end the war on his watch."}]
