[{"comment_id":"582952285239212","commenter_b":"Vote Trump! Not crooked Hillary","commenter_a":"Trump is nothing but a narcissistic coward. He likes to dish it out but he can't take it. Semper Fi","post_message":"Watch: POWERFUL and MOVING... This WWII Veteran and former POW is literally brought to tears in this impassioned plea to Americans to keep Donald Trump away from the presidency. Let's make this brave veteran go viral.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153618174361051","commenter_b":"America will pay. Cheaper to build wall than to keep paying for the illegals.","commenter_a":"There will only be a wall if the Donald pays for it,because Mexico says they will NOT pay for any wall!","post_message":"Donald Trump reiterated this week: If he becomes president, he's building a wall at the border. Would you be for or against the wall?"},{"comment_id":"10153129775024877","commenter_b":"yeah big black women are ugly","commenter_a":"why they didn't get a plus size white girl in there too ??","post_message":"Target is using 'real' models in its new summer swimwear collection.  Grio fam - do you think it's time more major retailers used body positive advertising? Or is this just a passing fad of acceptance? Sound off below!"},{"comment_id":"10154521229303318","commenter_b":"Start building the wall","commenter_a":"The idiot has border fences all along southern Mexico whats that for. They think they can just come to America an send the money back.","post_message":"Mexico's president just cancelled his meeting with President Trump.  He told Trump Mexico \"does not believe in walls\" and \"demands respect.\"  Do you support or oppose Trump's dedication to the wall?"},{"comment_id":"519848751523867","commenter_b":"Zel Zainoor and Arez Ezman does this help?","commenter_a":"Psyco people now have an excuse to feel normal.","post_message":"Don't you just want to squeeze him?"},{"comment_id":"1140838815950861","commenter_b":"@username now you're gay bashing but Muslims love male goats","commenter_a":"I bet Obama won't send anyone to her funeral...crickets. RIP Sister in Blue We have the watch from here.","post_message":"A Virginia officer who was on her first shift with the Prince William County Police Department was shot and killed Saturday and two other officers were wounded in a standoff stemming from a call about a domestic-related incident."},{"comment_id":"10154251408229726","commenter_b":"Shave her head and tar and feather her!","commenter_a":"You gotta love how this whole event has been mis characterized by the libs. If you can afford the home-- mortgage it shouldn't matter what the value may rise or drop to. The libs set people up to fail by simply forcing lenders to lend. Then you have an angry hypocrite like this creep ignore facts just to throw a dart. One day these stupid politicians are going to realize they are helping Trump.","post_message":"Massachusetts senator blasts businessman for making money, but she omits her own house-flipping past."}]
