[{"comment_id":"10152969881283188","commenter_b":"Leave Sarah alone!","commenter_a":"I agree with ya Glenn. Any dog will let you know if they don't like being bothered- for whatever reason. If the dog had wanted to move, he would have done so. Some people just like causing grief for others.","post_message":"On hate and Sarah Palin  In seeing that we have not seen or spoken to one another in maybe two years, sadly, I would not describe Sarah and I as 'friends'.   With that being said, 'lay off her!'  As a huge dog lover myself, and two dogs that are like members of the family, I know that NO dog is going to lay around or take abuse.   For their dogs to lay down and allow trig to 'use him as a stepping stone' shows that this dog loves, understands and is one with trig.  What is wrong with people.  Don't you have any cops to shout down, or chant 'kill, kill, kill' or worse yet, don't you have any cops to gun down and execute in cold blood?'  Where is the outrage?  Where is the media?  Where is our God?  Forgive me.  I know where he is.  We have exchanged Him for a cheap electronic, silicon filled or Wall Street version of God.     'The gods of the copy book heading with terror and slaughter return.'  Look out here they come.  I have been unplugged from the news for two weeks.  As I am making my final leg home with my dogs by my side, I decide that I would catch up on the news only to click on this story on the blaze.  What a mistake.  My wife always says, 'stop looking, it will all still be there in a week or two.'   How right she is.  Look at what we have become.   Get a life.   Stop hating people.  We are not all going to agree.  As I said, the well between Sarah and I was poisoned by those who wished to control and hate.  I think.  Maybe I did something to poison it myself.  Could be.  I have done stupid stuff in the past without realizing it.  Her, them or me, makes no difference.  History bends toward justice and this it will all sort itself out.   That is okay.  We are not meant to agree nor am I someone that 'needs' celebrity friends.   She doesn't always agree with me I am sure AND THAT IS OKAY!     I bring this up for all those on the left that think that we are all cut from the same cloth politically or socially.  We are not.   I have nothing to gain politically here, what I do have in common with Sarah is what I have in common with you too ... HUMANITY.    Do we even understand that concept anymore?  This has nothing to do with dogs, and if it does, you don't know what the hell you are talking about.  Maybe you have one of those little purse dogs.  This is a lab.    A boy and his dog.  This is all about hate for the Palins.    What is the meaning of diversity on the planet on which you live?    Sure there are crazy haters on the right and it is up to those who choose to set examples to shun them from our own personal ranks, but Personally, I have found the most violent and hateful are those who preach tolerance.   If you think it is horrible what a little sweet boy is doing with his dogs permission, Let me show you what millions of girls and women are doing to their children in the death camps of planned parenthood,  Black lives matter!   White lives matter!   Blue lives matter!    ALL LIVES MATTER!  I despise what we are allowing ourselves to become.  I will not join any one on this journey to the gates of hell.    LOVE and charity, forgiveness and understanding are the answers.  We all want to belong to something bigger and better than what we currently see.  We want to know we are being heard and can make an impact and we want control of our lives.  No one in Washington, republican or democrat, is helping us build that world.  The parties, universities and the media are shaping a culture of the silence of the lambs.    I reject that view and personally, because I can only effect me and those around me, I will take the beam out of my own eye first.   I have changed how I say and approach much of what I do, with the understanding that tables need to be upturned from time to time, but I will also work to wake those willing to be awakened about who is helping shape this culture.  Defund the GOP.  Democrats, unite.  When you clean out your house and we clean out ours, with malice toward none and charity toward all, we will be on the road of recovery and maybe our children will be able to live in a world where you income, sexuality, gender or political leanings mean exactly what they should mean:  NOTHING.  'Forgive them Father, for they know not what they do.' @webpagelink"},{"comment_id":"10153598670708822","commenter_b":"Woman driving a junk Kia SUV","commenter_a":"Awesome driving right there!","post_message":"It was a shocking sight… and some tense moments for people inside the Greenfield Giant Eagle.  An out-of-control SUV ended up on the building’s roof this afternoon, leading to evacuations over gas leak concerns: cbsloc.al/1RQuE9o"},{"comment_id":"10153888604683812","commenter_b":"Bye dumbass. Take the illegals with you, of ALL nationalities","commenter_a":"I respect our president and all past Presidents. I will respect all future Presidents. ( unless Donald Trump is elected, I will move to MEXICO AND HELP BUILD THE WALL!!!!!!)","post_message":"President Obama has joined Facebook! Here's what the President wrote in his very first post: @webpagelink"},{"comment_id":"1156511254368903","commenter_b":"The land belong to native american until white screw it up.","commenter_a":"NO TO CHINA!!!! Our land is for the American People!! and Washington State's water belongs to THEM!","post_message":"Farmers from drought-parched California are finding greener pastures in the Pacific Northwest. And so are buyers from China."},{"comment_id":"936584933056721","commenter_b":"Well bye bye you illegal immigrant because your ancestors aren't from here .","commenter_a":"Black life's matter movement is a threat to law enforcement! The Obama administration is a threat to law enforcement! Islam is a threat to law enforcement! Illegal immigration is a threat to law enforcement!...... This man is not!","post_message":"In a video he apparently posted last week on Facebook, Jon Ritzheimer calls out New York-based The Islamic Post for calling him the 'American Taliban.' Now the FBI has issued an alert, citing he is a  threat to law enforcement."},{"comment_id":"10155118024265231","commenter_b":"No","commenter_a":"It depends on the relationship the bride has with the mother of her fiance's child. If they get along great! If she is simple and has secret feelings for him then no. There are so many different scenarios. What works for one group may not work for others. And it may not have to do with maturity.","post_message":"Your fiance's 'baby mama' wants to attend your wedding. Do you let her? #AskDemetria"},{"comment_id":"10152854969571051","commenter_b":"Let behead these scumbags..What the F**k is wrong with people..Your parents should get their asses kicked","commenter_a":"Tell me where they live. I'll do the rest...","post_message":"These teens beheaded a puppy with a machete and posted the video to Snapchat. Then they picked up another puppy and did it again. And they didn’t stop there."}]
