[{"comment_id":"10152584446122014","commenter_b":"No money for illegals!","commenter_a":"He's not an immigrant. He's a POS rock-throwing illegal alien coyote that's had 14 prior incidents with the border patrol.","post_message":"The judge ruled that the officer was not justified in opening fire on the immigrant who was crossing illegally into Arizona."},{"comment_id":"1031268323551304","commenter_b":"Why is it OK for transsexuals to lure gays into gay bars and not women to attract straight men into a restaurant?.........libtards double standard!","commenter_a":"Uhhh.. What's the problem?? We know this... They know this.. They know that we know this.. Who's getting hurt by this? Do much for women being empowered. They're not helpless..You can't have it both ways.","post_message":"This leaked memo says it all"},{"comment_id":"10153873551727550","commenter_b":"Scores girls accept nothing less!","commenter_a":"As long as liquor stores, bartenders, strippers and cigar shops accept them who cares who is on the twenty dollar bill?","post_message":"ABC News has confirmed through a Treasury spokesman that Harriet Tubman will replace Andrew Jackson as the face of the $20 bill.  Full Story --> @webpagelink"},{"comment_id":"726868034170441","commenter_b":"It's our Flag. If it offends someone they need to look the other way until they LEAVE OUR COUNTRY!!!","commenter_a":"Fly high Old Glory!","post_message":"Texas man ordered to take down American flag because it offends Muslims. In our country we fly our flag. This is absurd. Do you think this is ridiculous?"},{"comment_id":"652127268253788","commenter_b":"To you Mrs. Michele Obama I say name me just one all white college. I am not racist, I do have several black friends. Being white of course I do have more white friends, then black friends. They seem to under stand my point. But for blacks to say they can't go here or there. I don't see those barriers. I wish we all can stop this racist name calling g and pointing fingers, at each other. I know I can name at least 4 black colleges. I just want to know if anyone can name me just one all white college.","commenter_a":"why is she there? go home & drink some tea","post_message":"A race baiter who is not proud of her country."},{"comment_id":"1214141488640014","commenter_b":"See what happens when the Muslim population increases? Get It?","commenter_a":"FYI","post_message":"WOMEN IN FRANCE Fight Back After Muslim Men BAN Them From Sharing Public Spaces [VIDEO]"},{"comment_id":"10154374417982894","commenter_b":"Bitch u real life bitter","commenter_a":"Lol I hope someone run on stage and snatch that prosthetic belly off and expose her lying ass!!!!","post_message":"The Show Must Go On: Pregnant Beyoncé WILL Perform at Coachella...As of Now"}]
