[{"comment_id":"10154129008215329","commenter_b":"Sharon lol i couldnt find the woooorrddd","commenter_a":"I'm 15... i mean, i know how to use a CD player, and i know how to listen to a CD. i also know how to use a cassette and all but now a days, most computers don't even have a slot... we also got rid of our CD player ages ago... i haven't bought a movie on DVD in soooo long because everything is digital now","post_message":"So you've purchased Adele's \"compact disc\"..."},{"comment_id":"877374009072027","commenter_b":"What they should do is put them to work while they are on welfare and lowering government al expenses! A few hours here and there will save a bundle! Stop giving them a free handout and not allowing them to contribute to society! Eventually, get them a regular job and get them off welfare!","commenter_a":"Yes! To all of them!","post_message":"Do you support drug testing for welfare recipients?"},{"comment_id":"802250076569145","commenter_b":"You two should be sterilized","commenter_a":"Here comes the next Republican Party split. The birth of idocracy, with trump being the first idiocrat. All right America... Goodbye.","post_message":"On the morning after #SuperTuesday, one thing is clear: the GOP is at a crossroads."},{"comment_id":"1095553313863196","commenter_b":"How many men has she had in how long?","commenter_a":"Find a new girl who really love you.Don\"t be sad.","post_message":"It's over!"},{"comment_id":"1013220235397406","commenter_b":"She is an ugly witch. No wonder Bill looks elsewhere.","commenter_a":"Hillary is a has been Murder Embezzlement List ghost oes on","post_message":"ISIS just needs a hug..."},{"comment_id":"10153753811221051","commenter_b":"So tell me, how does a colored woman have a bronzed beachy glow? They want whites only.","commenter_a":"Oh lame. So now every ad for everything (make-up, sports, clubs, restaurants...) has to have a picture of male and female, old and young, straight and gay and transgendered, and ever single culture/race, etc. on EVERY single ad so as not to exclude? STOP IT.","post_message":"It only took a few hours for this photo to spark outrage. Take a look and decide for yourself if it's worthy of the controversy."},{"comment_id":"1054874157886389","commenter_b":"Well lets start with little jebs mommy! She is one horrible excuse for a human being!!","commenter_a":"whatever happened to divided CHURCH and STATE,,???","post_message":"A Republican strategist had the gall to defend Jeb Bush for supporting the public shaming of women who don't live up to his strict conservative \"Christian\" standards."}]
