[{"comment_id":"1706307999389223","commenter_b":"That girl behind him tho hahahaahahaa","commenter_a":"Really people who cares how he looks!!","post_message":"Ashton Kutcher testifies at Senate hearing on ending modern slavery."},{"comment_id":"1075404492512556","commenter_b":"WTF was with that woman?!? She's just sitting in there? She should have been out of there so fast and getting those kids out. He had to keep yelling to get her out???? What a Moron. And they just stand there Casually once out??? I might be kissing the kids out of Gratitude that they were alive and Thanking the Officer that saved them. There is something Seriously WRONG with these women.","commenter_a":"So are they the baby sitters? They sure shouldn't be parents!","post_message":"Dramatic footage shows two women and two children being rescued by California Highway Patrol officer after their car catches fire."},{"comment_id":"10153036681682235","commenter_b":"You bitch I hope he shoots you right between your eyes.","commenter_a":"it is a sick movie about a truly sick man who was used by his government. Instead of treating his sickness they increased it and used it to kill.","post_message":"Fox News host gets off on killing."},{"comment_id":"10154553926556729","commenter_b":"Shes an ugly bitch","commenter_a":"I think her and Fiorina fell out of the same tree.","post_message":"Thank you, President Obama!"},{"comment_id":"903890666313022","commenter_b":"She better bring a big army.","commenter_a":"Well michelle said before she is out of the White House she is going to have guns taken away from the American people","post_message":"Outrageous!"},{"comment_id":"1666312230322556","commenter_b":"what an idiot. she luck to b alive","commenter_a":"@username Whosoever","post_message":"This is why you don't mess with truckers."},{"comment_id":"1791974164423219","commenter_b":"@username Mexico has a wall at the south boarder but yet it's all ok for them? They built it to keep the freeloaders out, but it's so wrong for America to do it? Sorry if you want to be over run with illegals go move to Mexico. Otherwise support YOUR COUNTRY FIRST!","commenter_a":"Difference Clinton isn't a racist all Hispanics rapist, murders and thieves. Name one nation that has put a wall to keep a bordering country out. If every country in Europe can their border without a wall so can we.","post_message":"Controlled immigration wasn't \"extreme\" 20 years ago and its not \"extreme\" today..."}]
