[{"comment_id":"10153484658844060","commenter_b":"Let me clue you in on something: just saying \"I won, you lost\" doesn't make it so. In the adult world, you must present logic, facts and empirical evidence, which I did. Which enables me to say \"I win, you lose.\" It's ludicrous to even debate about how badly CA has done over the past 20 years due to liberal socialist policies. They're more in debt than most third world countries. Jobs and people are fleeing the state and illegal immigrants are destroying CA. I'd no more debate this than 2 +2 = 5. In summary, you're not only a loser but a leftist idiot. Ciao stronzo.","commenter_a":"America is the same. Some strong states like CA and some very weak states like SD.","post_message":"This week's KAL's cartoon @webpagelink"},{"comment_id":"838550182928031","commenter_b":"i feel bad 4 you girls cuz i used my dick tip","commenter_a":"Christoffer Kindmark","post_message":"@webpagelink"},{"comment_id":"1267665493274190","commenter_b":"Well Dana maybe if us \"poor white Trump supporters\" didn't have to pay so much in taxes to support all the welfare democratic trash (of all races) and all benefits for the illegals we would be able to live more the style of the freeloaders or better!","commenter_a":"lindo","post_message":"We are going to build a wall - and make America SAFE again!"},{"comment_id":"10153107912406051","commenter_b":"I hope she gets eaten by a carnivorous flower","commenter_a":"Or go egg free. Its possible. Vegan all the way!!","post_message":"We're going through the worst egg shortage in US history. What does that mean? It means get ready to pay a lot more for all your food."},{"comment_id":"821114344592574","commenter_b":"She doesn't owe anyone an explanation!","commenter_a":"Mustn't piss off the militant feminists","post_message":"\"Anyone that truly knows me, knows my heart and knows what I meant.”"},{"comment_id":"10153180740642894","commenter_b":"GTFOH. what she suppose to tell the Man not to come around cuz of the media. She ain't playing house she wit a man that has morals and wants to marry her.","commenter_a":"He telling truth i don't know why have something negative to say in all ciara interview she like drama and she was put her son in the middle that's crazy😬😬😬","post_message":"Future Covers ‘XXL’, Says Ciara Tried to Overshadow the Success of His ‘DS2’ Album [Photo]"},{"comment_id":"10154369349733812","commenter_b":"Take your hate, elsewhere, lady.","commenter_a":"Big f'n deal","post_message":"Pres. Barack Obama and First Lady Michelle Obama announce their daughter Malia will attend Harvard University in the fall of 2017, taking a gap year after her high school graduation next month."}]
