[{"comment_id":"1269427259813296","commenter_b":"SOME OF YOU IMBECILES SICKEN ME WITH YOUR OPEN MINDEDNESS TO ALLOW MORE REFUGEES AND WHICH ARE TERRORISTS COME INTO THIS COUNTRY!! WAKE UP UNLESS YOU WANT TO BECOME ENSLAVED TO THE RELIGION OF ISLAM AND LOSE ALL YOUR FREEDOM ,BE BEATEN,BE RAPED ,BE BEHEADED..ETC...ETC...THERE'S NO PLACE IN THIS GREAT COUNTRY FOR YOU UNTIL CHRIST'S RETURN,THEN SHALL YOUR FATE BE DELIVERED AND ETERNAL HELL AND DAMNATION WILL BE UPON YOURSELVES,NOT 72,000 VIRGINS AS YOU THINK !! THE ONLY VIRGINS YOU RECEIVE ARE THE INNOCENT LITTLE GIRLS 6,7,8,9,10 YEARS OLD THAT YOU ARE RAPING AND DESERVE DEATH TO YOURSELVES FOR!!","commenter_a":"STFU he said he does not reveal plan! STFU","post_message":"Broken campaign promise!"},{"comment_id":"10152950805022452","commenter_b":"Donald Trump should be proud that an \"Illegal Immigrant\" did not win. We don't want them to take the jobs from the \"White\" women! Next year they are going to have a new catagory called guess who is behind the sheets.","commenter_a":"Awesome","post_message":"Miss Oklahoma, Olivia Jordan, has won the 64th annual Miss USA contest. @webpagelink  This year's contest, held in Baton Rouge, Louisiana, had been largely overshadowed by comments made by pageant co-owner and real estate mogul Donald Trump while running for president."},{"comment_id":"10153826016756680","commenter_b":"Trump's no. 1 fan has a warning for us. David Duke Warns If Hillary Is Elected Black Men Will Rise Up, Kidnap White Women From Walmart And Rape Them ! The Republicans little secret that Trump exposed. 40 percent of them are racist and were dormant waiting for an opportunity like Trump. Vote blue from the top of the ticket to the bottom","commenter_a":"Thank you Hillary. As a gay man I understood it took you a while to get where you are, but I applaud you for your commitment to stand up for LGBT rights. #ImWithHer","post_message":"The NCAA announced it will relocate all of its championship events from North Carolina scheduled for the current year."},{"comment_id":"10153634923619885","commenter_b":"Nah she's a girl, but keep on denying. Y'all have a lovely day.","commenter_a":"That brat holding up that sign probably wouldn't want this person using their locker room either. So it's go with the ladies where you are not welcome, or go with the boys who will treat you like garbage. This is stupid. Leave this young person alone and let her get an education.","post_message":"Students at Hillsboro High School briefly walked out in protest Monday morning as part of a dispute over whether a transgender student should be able to use gender-specific locker rooms."},{"comment_id":"10153430601099255","commenter_b":"Proving again that ALL FOOLS AREN'T DEAD YET","commenter_a":"Evil attention seeker. Jealous of President Obama.","post_message":"This guy seems so pleasant."},{"comment_id":"10157390239980354","commenter_b":"Strip their citizenship and deport them. They do not deserve to be American citizens.","commenter_a":"BLM must be destroyed as a movement...just like the mob, or any other organized terrorist group.","post_message":"The BLM radicals shut down a CA freeway and vandalized an Oakland police station..."},{"comment_id":"1166718606737699","commenter_b":"Why?","commenter_a":"Anyone realize some veterans actually support Kaepernick. Also if you think this is the best country in the world you must be ignoring the debt, constant war, and division of society by ethnicity, race, sex, religion etc. that is plaguing this country. So if you think this country is not oppressive then you are wrong. If you think this country represents equality you are wrong. If you think this country represents democracy you are wrong. If you think this country represents the bourgeoisie elite and capitalist greed then you are right and that is why I won't support the flag not to disrespect the troops who died but to respect them because they died only for greed and American imperialism.","post_message":"Allen West Republic"}]
