[{"comment_id":"1207855142586053","commenter_b":"I was going to reply but you guys have it under control. Stupid bitch","commenter_a":"Hahahaha!!! So much for Freedom when you are forced to stand. If folks cant decide for themselves, then it isnt freedom. Im fairly confident my father died for her right to sit if she feels ashamed of her farce of a military...even when one is enlisted. (I eagerly await your ignorant attacks.)","post_message":"A Navy sailor made national news when she decided to film herself not standing for the flag. Now, she's in trouble... here's the swift justice she received.  Do you think she got what she had coming to her?"},{"comment_id":"10154171433698701","commenter_b":"Crazy! :-)","commenter_a":"86 in Woodland, WA","post_message":"As of 2 p.m. today, Portland is hotter than Palm Springs, CA; Albuquerque, NM and Atlanta, GA! Stay up-to-the-minute with the FOX 12 Weather App: @webpagelink"},{"comment_id":"914159775273545","commenter_b":"She is labeled as dumb!","commenter_a":"Lort.","post_message":"“I’m From Every Continent In Africa” Raven-Symone Continues To Put Her Foot In Her Mouth"},{"comment_id":"10154522868449087","commenter_b":"Fuck this old communist bastard!!!!","commenter_a":"Your anti Muslim propaganda does that! Trump is anti Radical Islamic Jihadists! Got a problem?","post_message":"Bernie Sanders: 'Trump's anti-Muslim order plays into the hands of fanatics wishing to harm America. Love and compassion trump hatred and intolerance.'"},{"comment_id":"10152928005661615","commenter_b":"Btw, @username, go blue!","commenter_a":"Hahaha haha hahaha haha hahaha haha hahaha haha hahaha! !!","post_message":"“It hit my wife and knocked her over, and punched my daughter”   The 'it' was a DOLPHIN that jumped out of the ocean -- and into the family's boat, breaking the woman's ankles."},{"comment_id":"10152941725546051","commenter_b":"I feel for him. The cops and courts don't help. He stopped him once and for all.","commenter_a":"I would have done the same ~ if our laws were CORRECT pedophiles wouldn't be as big a problem! He should NOT be the one in jail !","post_message":"“I just want you to know, I ridded one less (expletive) child molester from the (expletive) earth that (expletive) with my little brother,” he said. “Alright? That's all I got to say. I don’t give a (expletive) how much time they give me. Doing time is the easy (expletive) part.'"},{"comment_id":"10153378758554575","commenter_b":"Would this woman have been willing to pay the stewardess' salary when the stewardess got fired for allowing her to make the phone call? Bet not....","commenter_a":"Why is she leaving if her husband was suicidal","post_message":"A woman says Southwest Airlines refused to let her call her husband after she received a troubling text message shortly before her flight was scheduled to take off.  The woman said the text read, “Karen, please forgive me for what I am about to do, I am going to kill myself…” She said she replied 'no' and immediately tried to call her husband, before a steward 'slapped the phone down' and told her to put her phone on airplane mode."}]
