[{"comment_id":"1008549135942537","commenter_b":"Stupid..and when it doesn't work do they turn in their brooms?","commenter_a":"Pray for our president every day!","post_message":"Witches Plan To Cast A ‘Binding Spell’ On Trump And His Supporters Every Month During The Crescent Moon @webpagelink"},{"comment_id":"864050243704778","commenter_b":"We should have spoken up about the poor quality of the American diet sooner. GMO food & MSG should have been outlawed!","commenter_a":"TRADUCTION ARCHI NULE","post_message":"Well?"},{"comment_id":"1215472705166021","commenter_b":"No, slutty women are.","commenter_a":"I wonder how many these so called rape or incest abortions our taxes go to are really that or women lying. I'm sure planned slaughterhood and other abortion providers don't perform parternity tests.","post_message":"Like and Share if you agree!"},{"comment_id":"1377095295664272","commenter_b":"And she will WIN !","commenter_a":"killery is an ass...panders to any voter cause","post_message":"Clinton isn’t letting this bigotry go unnoticed."},{"comment_id":"10154090302722452","commenter_b":"So someone purchased a ticket for this bear, and the TSA couldn't screen it so it could go on the plane?!","commenter_a":"If he bought a ticket then he should have been allowed to bring it on the plane","post_message":"A YouTube star bought a plane ticket for a massive teddy bear as a stunt, but was forced to abandon the bear at LAX."},{"comment_id":"10155256275191002","commenter_b":"She's a cunt","commenter_a":"I was there! It was great! So exciting, so much energy, great speakers and it was wonderful to see our future President in person! :) She is marvelous!","post_message":"LIVE: Hillary Clinton is set to speak at a rally in Eastern Market Corporation."},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"}]
