[{"comment_id":"659128370944408","commenter_b":"Ban them all through the U.S.!","commenter_a":"Yes!","post_message":"A town in Michigan just voted to ban mosques, this was the result. Things are about to get very controversial. Would you like to ban Mosques in your town?"},{"comment_id":"10153513064987629","commenter_b":"Put your damn sticker and tongue away woman.","commenter_a":"Wait! Wait! WAIT A GOD DAMN MINUTE HERE! So cops can be wrong or even worse racist liars? Our judicial system can fail at the expense of innocent citizens? I need to take a seat. Bear with me for a second...","post_message":"\"They’re so wrapped up in a different culture than—what I’m trying to say is, the right culture, the better one to pick from.\""},{"comment_id":"924082021021384","commenter_b":"and hate smart women.","commenter_a":"What happened with the great Sara Palin she not running lol","post_message":"They might need a bigger stage..."},{"comment_id":"10153725968361717","commenter_b":"Stupid women....","commenter_a":"IF THEY ARE REFUSING TO DO THEIR JOB ( I do NOT care how fucking religious you are) IF YOU ARE NOT DOING YOUR DAMN JOB YOU WERE ELECTED, HIRED, OR NOMINATED FOR YOU WILL BE FORCIBLY REMOVED FROM OFFICE! GOT IT ASSHOLES? Or didn't your religion TEACH you that ASSHOLE!","post_message":"Like Kim Davis, the Wyoming judge has cited religious beliefs in her refusal to marry same-sex couples."},{"comment_id":"10154034476612144","commenter_b":"@username you are a freaking trumpette woman which is disgusting. Go away","commenter_a":"Journalist should ask Trump for all his business and private emails when he demands Hillary's. Then point out she has released decades of tax returns and when is he going to pony up like a real candidate. The public has no more right to Hillary's private emails than they do to Trump's.","post_message":"No one is talking about this, but Donald Trump just screwed up and admitted the truth about his taxes."},{"comment_id":"1047910738660847","commenter_b":"Exactly who would this little girl call if a robber happened to storm into her place of employment and point a gun at her, another employee or patron? Who would she be begging to step in between herself and a threat? Who would be more than willing to lay down his life for her? The answer is the man she refused to serve. I'm glad she lost her job. I hope others learn from her foolish mistake.","commenter_a":"hahahah yes!","post_message":"An Alabama Taco Bell employee who refused to serve police officers has been fired."},{"comment_id":"10156484375905354","commenter_b":"MmmmHmmm so should welfare bitch!","commenter_a":"Chicago thugs on welfare should be fedubded.","post_message":"\"One of our major demands is that police be defunded and that that money used to fund police be used to fund black futures....\""}]
