[{"comment_id":"1061814317192373","commenter_b":"Also...let's not forget...Obama is to blame for your mama giving birth to a shit head like you....you should have been aborted","commenter_a":"Another Jack A**** heard from","post_message":"Frequent Fox News guest Jesse Lee Peterson says that Obama is to blame for the South Carolina mass shooting at a black church because he insists on pointing out that racism is a problem in America."},{"comment_id":"484244465097180","commenter_b":"Why does anyone listen to her?","commenter_a":"PIG","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1726142824304062","commenter_b":"These are 'outrageous'? Come on! Blacks, African-American, People of Color, or whatever is the nonoffensive way they are referred to these days, often get a pass for calling each other the 'N-word'. What the hell is going on here! Odd double standard. Remember 'Colored People', bad!!!, 'People of Color', GOOD!!! Wow, what crap!!!","commenter_a":"She thought she had a friend","post_message":"Fox News chief allegedly referred to Stacey Dash as ‘the black girl’, called another anchor an 'angry black woman'  Grio fam, are you surprised by any of this? Check out the other outrageous things coming out in this new lawsuit!"},{"comment_id":"559128170957362","commenter_b":"Real easy there big mouth, you don't like it here then PLEASE get out NOW you punk.","commenter_a":"You will get nothing from me OR anyone I know,you punk loud mouth but we have something for you. See you soon.","post_message":"WHITE PEOPLE OWE REPARATIONS. IF YOU DON GIVE IT, WE COMING TO TAKE IT."},{"comment_id":"753100741547170","commenter_b":"That whore cares so much about the us she built a school in Africa!!!!","commenter_a":"Fuck that","post_message":"Obama Wants To Put Oprah Winfrey’s Face On The New Dollar Bill.  This is ridiculous. Leave the dollar alone.  Do you think they should get the dollar bill as it is?"},{"comment_id":"1016766741752911","commenter_b":"'@webpagelink Ninja Warrior Winner Isaac Caldiero $1 million grand prize @webpagelink","commenter_a":"That is because gayness is a disease and not a protected group. I'm so sick of gays - nee homos - queers thinking that they are the same as everyone else. They chose that way.","post_message":"'Imagine if instead of denying a license to a gay couple, Ms. Davis had sought on religious grounds to deny a license to an interracial couple. She likely would have been fired on the spot, and no politicians would have rushed to stand by her side, no matter what her sincerely held religious convictions were.'  - George Takei on Kim Davis"},{"comment_id":"10154373142406509","commenter_b":"It's bc she's white and rich.","commenter_a":"When you have money the law work for you and when you're poor it don't","post_message":"Tonya Couch, the mother of so-called 'affluenza' teen Ethan Couch, had her bond lowered from $1 million to $75,000 at a hearing on Monday."}]
