[{"comment_id":"1753310708283376","commenter_b":"F all them towel heads and illegal immigrants. It's time to Trump all your dumb asses","commenter_a":"What did you expect of an ILLEGAL, MUSLIM, ALIEN who should be IMPEACHED AND TRIED FOR TREASON AGAINST THE USA! HOWEVER, the ELECTED OFFICIALS WILL DO \"NOTHING\" AGAINST THIS \"TERRORIST\"!","post_message":"Obama Admits He Is Embarrassed By Americans [VIDEO].  He is the worst president in the history of our country.  Do you think Obama is the embarrassment?"},{"comment_id":"906697222720307","commenter_b":"Only people with integrity should be allowed to immigrate to our country! If they don't respect our immigration laws, what other laws will they break? They must be ready to work and learn English to contribute to the economy and not leach off of the welfare system. Cut welfare and close the border. Enforce a high standard for admittance for immigrants .","commenter_a":"Yes","post_message":"Click to see where most American voters stand on immigration..."},{"comment_id":"661168074035043","commenter_b":"She has problems","commenter_a":"Dylan Ballzy","post_message":"Ermmmm..."},{"comment_id":"10153798375353984","commenter_b":"She looks like saying anything about anything .she's a criminal herself.","commenter_a":"She has been untruthful about alot. Wonder about the taxes for them. Why is the government supporting their foundation. Need to separate them from government.","post_message":"Hillary just got caught admitting she would do something BIG to guns in America and the NRA if elected, and it's going to have conservative's heads spin.  Do you think a Hillary Clinton presidency would be one of the worst things that could happen to America?"},{"comment_id":"10154492398684199","commenter_b":"Wolves are not endangered.They kill livestock.","commenter_a":"Holly","post_message":"A federal judge in Tacoma has rejected plans to increase the killing of wolves in Washington state by a federal agency."},{"comment_id":"766656443467536","commenter_b":"When the hell do CRIMINALS ABIDE BY LAWS????? Dumbasses","commenter_a":"Utterly completely fucking useless President. His brain =","post_message":"You have to see it to believe it."},{"comment_id":"1083743574979986","commenter_b":"nah, bitch. not now.. just getting going :)","commenter_a":"forced depopulation by way of financial and imprisonment threats.. sad..","post_message":"The Australian government will tighten the rules requiring children to be vaccinated in order for parents to receive welfare payments and childcare subsidies."}]
