[{"comment_id":"10154382417947293","commenter_b":"Meanwhile Russia is laughing so hard all the way to the bank. Hope everyone who helped put this unstable Trump into this position will enjoy learning their new language of Russian cause now Russia owns us.","commenter_a":"Infighting violence much Washington post?????","post_message":"2016 might really be our own 1914."},{"comment_id":"10154298408534060","commenter_b":"Actually, it's incredibly efficient for what it is.","commenter_a":"All meat is a waste of energy and thus unsustainable.","post_message":"Human consumption of farmed fish has overtaken that of beef. In fact, aquaculture may be the only way to supply mankind with enough protein in the future"},{"comment_id":"10154369959116509","commenter_b":"Trump will eat her alive!","commenter_a":"So ... u think u luv Hilary Clinton .... u like Hillary Clinton .. u want to vote for Hillary Clinton ... u r impressed how the liberal media only shows u her smiles ... well.... here is some of her smiles ... enjoy ... @webpagelink","post_message":"Former Rep. Gabby Giffords and her husband Mark Kelly endorse Hillary Clinton on Sunday, she is the only \"candidate for president that has the determination and toughness to stand up to the corporate gun lobby -- and the record to prove it.\""},{"comment_id":"10154518044354342","commenter_b":"An animal gives birth to its young......will care for it, and not abandon its young. Humans are worse than animals..........spay this thing at once, she needs not tpo reproduce again, EVER!!!!","commenter_a":"Praying for healing.","post_message":"UPDATE: Police say the mother of a baby born in a Walmart bathroom, then left in a trashcan has been arrested. The baby is still alive, but in critical condition."},{"comment_id":"636835003152516","commenter_b":"In these cases the police are the terrorists","commenter_a":"Balck white man woman cop civilian.. the real enemy is Terrorism.. and they are using all this crap to keep us from conentrating on them","post_message":"An important conversation for America. President Obama participates in special town hall event on race, justice, and policing. @webpagelink #POTUStownhall"},{"comment_id":"857720034363387","commenter_b":"This crap has to stop!!!!We do NOT need hillary and another 4 years of obozo and their evil ways-they have destroyed this country--we can not afford all these immigrants---we have to take care of our own first!!!!!","commenter_a":"They'll vote for Gary before Hillary.","post_message":"Exclusive: Federal immigration officials may be working overtime to swear in as many new \"citizen voters\" as possible before the presidential election, according to an internal Obama administration email disclosed to FoxNews.com by Republican Sen. Ron Johnson of Wisconsin."},{"comment_id":"10153243373545950","commenter_b":"Go Hillary...to JAIL","commenter_a":"BREAKING NEWS: Donald Trump, Republican presidential candidate drowned today, apparently he was trying to learn to waterboard.","post_message":"President Obama banned the practice of waterboarding and other so-called \"enhanced interrogation techniques\" after he took office. But Donald J. Trump said he would \"bring it back\" to fight ISIS."}]
