[{"comment_id":"831083283688817","commenter_b":"Just a bunch of fat people eating fat food. No incumbents in 2016 november.","commenter_a":"America runs on Dunkin!!","post_message":"Elizabeth Warren repped Massachusetts by bringing Dunkin' Donuts to the House sit-in."},{"comment_id":"10153113291310667","commenter_b":"He needs nothing...but some of his followers want to contribute anyway..Trump for president 2016!...","commenter_a":"Only person that can change America.","post_message":"He says he doesn't need the money -- he's getting it anyway."},{"comment_id":"10154083070804160","commenter_b":"Go to Hell","commenter_a":"Won't this trump puppet go jump off a cliff already","post_message":"\"Bow down.\""},{"comment_id":"1142812899111790","commenter_b":"Jade White Ali omg & before ?? Ur a nun then now !","commenter_a":"It's all false to get people to make racist comment, and it's illegal in UK to have more than one wife it's called bigamy","post_message":"Men with more than one wife to get bigger benefits"},{"comment_id":"1487874397904733","commenter_b":"A vote for stein is a vote for trump. Besides,google her. She is no prize!","commenter_a":"If any Bernie supporter will support Trump after reading this, they were never a Bernie supporter. If they say they will vote for Stein, they are not a Bernie supporter. Bernie was an independent. He got into this race as a democrat because he said A 3RD PARTY CANDIDATE CANNOT WIN.","post_message":"Wow, he went there."},{"comment_id":"10156662998260725","commenter_b":"Build that wall!!!","commenter_a":"Trump is going to do a great job 8 years later some other idiot is going to come and ruin it another 8 years Eric Trump is going to run !!! That's the plan!!! Go Trump!!!","post_message":"I have built so many great and complicated projects – creating tens of thousands of jobs in the process. Building a wall is A LOT easier than building a 64 story building! LET'S #MAKEAMERICAGREATAGAIN www.DonaldJTrump.com/Nevada"},{"comment_id":"10153167764854714","commenter_b":"Well,please make sure neither of you go out in a bikini then.","commenter_a":"Empowering her to be a porn star. Tacky tacky tacky","post_message":"Model Hannah Davis says her Sports Illustrated Swimsuit Issue cover is “empowering.” What do you think? @webpagelink"}]
