[{"comment_id":"970236133016859","commenter_b":"Dumber than dumb. She thinks she is a republican because...?","commenter_a":"I'll bet dollars to donuts that she'll still vote republican in the next election. Dimwits gotta be dim......","post_message":"To save Obamacare, we need many, many more people like Erin to come forth."},{"comment_id":"805771119613465","commenter_b":"The woman has no class.","commenter_a":"Laura Bush...a REAL FIRST LADY WITH CLASS...not the thing we have now , a disgrace!","post_message":"Laura Bush SLAMS Michelle Obama Right To Her Face In Front Of Everyone. This is awesome. We love her. Can we get 5,000 'LIKES' for Laura Bush?"},{"comment_id":"1782906415286798","commenter_b":"Old bitch","commenter_a":"I have to believe this woman is mentally ill. I can't find any other way to wrap by head around it. I mean can sane people be this cruel?","post_message":"So awful."},{"comment_id":"680629115421379","commenter_b":"She needs to just go away already.","commenter_a":"We can let her become president","post_message":"Hillary Clinton slammed Donald J. Trump's \"I'm with you\" proclamation, writing on Twitter, \"Not included: women, African Americans, LGBT people, Muslims, Latinos, immigrants...\""},{"comment_id":"10155729304999638","commenter_b":"Trump is another Hitler in the making! Shame on all those Americans who brought him into power!!! Wonder what his next steps will be - Muslim concentration camps!?","commenter_a":"Hey Donald does this sound familiar! \"An evil exists that threatens every man, woman, and child of this great nation. We must take steps to ensure our domestic security and protect our homeland.\" -Hitler Racist big Donald and his racist supporters all deserve to go to hell!","post_message":"Donald J. Trump's controversial \"Muslim ban\" just hit a major legal roadblock."},{"comment_id":"918479428207062","commenter_b":"\"If you don't have the guts to run for office on your ideas, then you shouldn't run for office at all.\" Thank you, @username. #realtalk","commenter_a":"The last two elections I couldn't get to the polls because of 14 hour workdays","post_message":"If you don't have the guts to run for office on your ideas, then you shouldn't run for office at all."},{"comment_id":"10154467699462675","commenter_b":"Let's be clear to all Trumpicans about at least one thing: not all terrorists are or have been Muslim. America isn't the only country to be attacked by terrorists. Terrorists have one thing they all share, they're Terror-ISTS","commenter_a":"guess what, you should leave too. you are an imagrant. give this country back to its rightful people, the native indian. !!!!!!!!!!!!","post_message":"British Foreign Minister Boris Johnson addresses parliament on President Trump's immigration policy. President Trump's executive order bans U.S. entry to migrants, refugees and green-card holders from seven predominantly Muslim nations."}]
