[{"comment_id":"1217472704997930","commenter_b":"WE MUST STOP CORRUPT CROOKED LYING KILLARY...If she gets into OUR White House she will appoint the nest Supreme Court Judge...GOD Forbid it be the MUSLIM POS OVOMIT. This will affect US, OUR CHILDREN and OUR GRAND CHILDREN for years to come. She will do her best to cost us OUR SECOND AMENDMENT RIGHTS, While keeping the Secret Service ARMED to protect HER SORRY ASS !!!! She will FLOOD OUR COUNTRY WITH SYRIANS, TERRORISTS, and ILLEGALS.... OUR Borders will NEVER BE CLOSED. AND all of this we will be FORCED TO PAY for with her PROMISED RISE IN TAXES on the MIDDLE CLASS. if that DOESN'T KILL US, we can always be BOMBED, BEHEADED, RAPED or MURDERED by ISIS....GET A CLUE, OPEN YOUR EYES, SEE HILLARY'S AMERICA , BUT THINK TWICE BEFORE YOU VOTE FOR THIS TRAITOROUS B*TCH !!!!!!....TRUMP 2016 !!!!!","commenter_a":"TOO many martinis & pills.","post_message":"Democrats are in full-on panic mode after reporters scooped a picture of Hillary Clinton literally UNABLE to stand. This is going to intensify speculation about her health BIG TIME.  Do you think that Hillary Clinton is fit to serve?"},{"comment_id":"10153716806409749","commenter_b":"What's wrong with a black lady ?","commenter_a":"Wasn't the judge a black lady???!!!","post_message":"'There will probably be a book. It will talk of his love for Reeva. And the awful feelings of loss and guilt, that will stay with him forever.'"},{"comment_id":"10153780693499071","commenter_b":"Nina Puspita","commenter_a":"They look for kindred spirits of greed, just ask Hillary.","post_message":"Here's what Goldman Sachs looks for in a résumé."},{"comment_id":"600606456772491","commenter_b":"Takeaways from the Texas GOP Debate *Donald Trump looked like an absolute buffoon in a nice suit. It was also clear that he has talked out of both sides of his mouth so much, that he cannot even remember what he has said in the past. We heard all the same old talking points and we heard more insults and name calling designed to shame his opponents; and Trump even classless attacked the moderators for asking reasonable questions. The Trump diehards will rush to the Internet to vote for him as the winner. People who were actually listening to him, will change their vote if they thought about supporting him, or be happy with their decision to vote for someone else. * Ted Cruz was once again the most substantive and clear debater. He was unfairly treated by Wolf Blitzer by Blitzer inability to control Trumps interruptions. Ted Cruz was ...","commenter_a":"Good job tonight I wish we could of heard more","post_message":"Real compassion is providing people a ladder of opportunity to climb up from a state of dependency. #GOPDebate   Visit bencarson.com/issues to learn more."},{"comment_id":"10152703657281051","commenter_b":"This woman is clearly abusing the system!","commenter_a":"Christine I enjoyed reading your comment I too came from a family of 11 I'm number 10 my daddy was the sole provider he injured himself and was off of work for a couple of months my mom said they had to get assistance which was very hard for my father when he returned to work he paid every cent back its funny how people can respond so quickly maybe we should just pray","post_message":"This mother of 11 lives almost entirely off government benefits. Last week, she announced some big news."},{"comment_id":"1091990537522616","commenter_b":"Fat lady has not even cleared her throat yet.","commenter_a":"Jesus Bernie. You've given up. You're turning into what you've said you despise. All of us fought for you, not so you could buckle up like a belt and endorse Hillary. I refuse to vote for Hillary. You are letting us all down, all because of a back-room conversation where Barack likely asked you to 'fall in line'. I'm concerned, but still very hopeful that you get up on that stage at the DNC, and demand that your followers vote 3rd party!!!!!","post_message":"I want to express my pride in what we have accomplished together over the last year. But so much more must be done to make our vision a reality. Now more than ever our country needs our movement — our political revolution. As you have throughout this historic campaign, I ask for your ongoing support as we continue through the fall and beyond."},{"comment_id":"10152839812269753","commenter_b":"It's the POLIC WHO ARE PAID TO USE EXTRA FORCE (excessive force). It's not the job of employees, unless it's a security guard. They can RESTRAIN A PERSON UNTIL THE POLICE GET THERE.","commenter_a":"no she deserves it","post_message":"Even though she was able to successfully open the driver’s door of her getaway car, the man did not allow her to get much farther than that. He grabbed the shoplifting woman as she opened the door, turned her on her back and slammed her on the ground seconds later.  You think he used excessive force?"}]
