[{"comment_id":"10153268633329197","commenter_b":"They are all dangerous!","commenter_a":"She was a nurse and still went tanning? I'm confused. Surely she knew it was bad","post_message":"This Alabama nurse was an avid user of tanning beds, sometimes going 5 times a week! Now, she has developed skin cancer and she wants to help stop others from getting the disease. See the graphic way she shared her story --->  @webpagelink (WARNING: this story contains graphic content)"},{"comment_id":"1390719824302205","commenter_b":"Our 4 rescue babies. We couldn't be happier, love them with all our heart.","commenter_a":"If I were granted 3 wishes it would be health and wealth for all my family and friends and that Clyde could talk. We stare into each other's eyes and I ask him about his family and living on the street and all his circumstance and history. I call him a bunch of names to see his reaction, Blackie, Shadow, Coal, Midnight. Larry hates that 'his name is Clyde, you're confusing him.' I'm also proud to wear a tshirt that says 'all I want to do is drink wine and rescue dogs' and it has a real red wine stain on the front!","post_message":"This comic shows a dog's heartwarming journey from the shelter to his forever home."},{"comment_id":"832106660178720","commenter_b":"We the people don't need regulations on the internet, stay out of out business!","commenter_a":"execute them","post_message":"YOU HAVE TO PASS IT TO FIND OUT WHAT IS IN IT!.. INTERNET REGULATIONS!  @webpagelink"},{"comment_id":"10153539209048487","commenter_b":"Oh please tell us what you know about Locheed /Martin!","commenter_a":"Cuz Lockheed Martin sucks","post_message":"The F-35 was supposed to be inexpensive, adaptable, and reliable. How did it become the most expensive aircraft in history?"},{"comment_id":"824413534273149","commenter_b":"She should point those racist fingers back at self!","commenter_a":"Do you really expect anything else from her? I'm not shocked at all. She's an idiot.","post_message":"This speech is shocking... even for her!  What Michelle says at this graduation ceremony will make you cringe!"},{"comment_id":"1092318047486497","commenter_b":"The chick in the limo is smokin...","commenter_a":"Yet he still left the guns...","post_message":"Now THIS is how you get out of a bad date. Mat Best MBest11x always taking it to the extreme. ~Will"},{"comment_id":"685645904949943","commenter_b":"Go fuck your sister","commenter_a":"59% don't care to show his taxes!!! But I put money on that same percentage CARED about his birth certificate!!!! People of this country make me sick!","post_message":"The Rachel Maddow Show is right –– this is an 'unimaginable corruption scandal.'  Shared by Occupy Democrats, LIKE our page for more!"}]
