[{"comment_id":"10153971100801600","commenter_b":"If we won when I was a kid my parents would have kept me out. My son deserved to be there... I was more than happy to take him!","commenter_a":"Shouldn't of had school","post_message":"The numbers are in. Should parents have taken kids out of school for the parade?"},{"comment_id":"1090710841025167","commenter_b":"Sanders' wife was not known for \"fiscal responsibility while president of Burlington\" as she allegedly overstated pledge donations while filing a loan with the Burlington Diocese of the Catholic Church and forced them to reportedly eat a loss of up to $2 million. Sanders and Wife Accused of Mishandling Campaign Money @webpagelink","commenter_a":"🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸Donald Trump For President 2016/2020","post_message":"Iowa may not be on \"Cruz\" control..."},{"comment_id":"1808417692765360","commenter_b":"Disgusting.. . I'm sure she's a Trumpette....","commenter_a":"Why do you promote this kind of story NBC???? if you promote peace, all of the robots that follow the trends just may jump on the peace bandwagon. They are here!!! That won't change. What we must remember is they are humans. Each of us will reap what we sow.","post_message":"\"Go back to wherever the f*** you come from, lady.\" Watch a woman go on a racist tirade against two Latina shoppers at a JCPenney in Louisville, Kentucky. Read more about the incident: @webpagelink"},{"comment_id":"915924881775941","commenter_b":"The buildings were resisting arrest, so they were executed!","commenter_a":"Justified. Those buildings and people around were obviously obstructing justice.","post_message":"More trigger happy cops? Time to unarm the cops? What do you think? Via: Police The Police <-- (y) Follow this page!"},{"comment_id":"722398331226681","commenter_b":"Miley Cyrus is so gross. She's going to be a washed up disgusting old lady if she makes it that far.","commenter_a":"Who would believe anything that raunchy ugly thing says anyway ?","post_message":"Class act, that Cyrus!"},{"comment_id":"10153593433561323","commenter_b":"when people are in the process of migrating from one spot to another they are sometimes referred to as migrants.","commenter_a":"because it describes a particular group of people. Like descibing a group of people from Norway as Norwegian or whatever. jeez","post_message":"\"You will still see the word 'migrants' or 'migration' in the Guardian as a general expression to cover people who for whatever reason have moved, or are moving, from the country of which they are nationals to another. But 'refugees', 'displaced people' and 'asylum seekers', all of which have clear definitions, are more useful and accurate terms than a catch-all label like 'migrants', and we should use them wherever possible.\" - David Marsh, Guardian style guide editor."},{"comment_id":"908413552551727","commenter_b":"Omg poor man i hope she gets sent to prison","commenter_a":"Poor man. I hope his wife gets a nice long prison sentence.","post_message":"A year on, he still has scars..and some of them will never fade"}]
