[{"comment_id":"609328869267784","commenter_b":"Racist woman","commenter_a":"It's always been great.","post_message":"Beyoncé appeared Monday night at the Grammys and led a visual and musical performance celebrating motherhood."},{"comment_id":"1730793227218701","commenter_b":"My dad years worked in the fields of Arizona I whent with him knights we would spent checking the water pipes it's hard work but he was a proud man I learned a lot from him the truth is they won't last a night it day in the fields they beg that's all they do lazy","commenter_a":"Yeah right !","post_message":"They wouldn't last a day!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"484244465097180","commenter_b":"Why does anyone listen to her?","commenter_a":"PIG","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154500289369091","commenter_b":"Build that wall","commenter_a":"Trump is making up his own stories !! What would he like the ppl to do with the Syrians kill them ? They are human beings ! Smh.. All the other countries took them in ...Trump has No heart , Maybe we should put him in Syria and see how he likes it !","post_message":"Swedes have been ridiculing President Trump's remarks at his rally yesterday that suggested a major incident had happened in the Scandinavian country."},{"comment_id":"1210841148970887","commenter_b":"Be honest, if it was anyone other than Trump, would you STILL vote for her? Fact is she would have already packed up her tent and left town to sell more books if this was 't Donald frigging Trump she was running against? That's something to be proud of? The second worst? You see that's where a candidate needs to be a good candidate to get my vote. In my book she's not, if your Presidential standards are that much lower, ok, vote for her. Mine aren't.","commenter_a":"Sorry Bernie, but I can't sit here and watch you degrade yourself into just another shill for her. You used to hate what she stands for. Now you endorse it. I hope you find your way again Bernie. But for now. I gotta unlike ya.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153404466085950","commenter_b":"Go Trump!!! Scared?? Everyone's voting for him!!!! I'm scared of Hillary lying Clinton!!!! Speak for yourself sweetheart","commenter_a":"I'm hoping that if he's the Republican candidate, people will be scared to vote Republican and will therefore vote Democrat.","post_message":"BREAKING: Donald J. Trump will win the South Carolina Republican primary, CBS News projects @webpagelink"},{"comment_id":"427202340738140","commenter_b":"Pharmaceutical companies cannot profit so much that's why they do not do what they are supposed to do is protect the public","commenter_a":"Lauren Martin","post_message":"This video is from a new documentary The Culture High which looks at both sides of the marijuana prohibition argument."}]
