[{"comment_id":"1260941960612940","commenter_b":"To unite for all the right concerns all of them with us in mind because is 100% for and by the people...please for your families...you have to check learn help in anyway you can act and share and share again...because species are disappearing everyday...everyday...for you your loved ones for the nation for the world the planet..hiring humans for humanity and peace for all not the few...www.jill2016.com","commenter_a":"What a lot of people don't know about Trump that support him is, that those same people would not survive him ...Trump would even eat his own kind....it's just his nature.","post_message":"This teen just figured out the perfect question to start asking Trump and his supporters."},{"comment_id":"10153252207146509","commenter_b":"Look at yourself and get off your high horse, lady.","commenter_a":"It's only free for freeloaders and illegal immigrants! The rest of us r still going to be up to our eyeballs in debt!","post_message":"President Barack Obama says he'll propose making two years of community college free 'for those willing to work for it.' Do you agree? More details will be announced Friday: @webpagelink via CNNMoney"},{"comment_id":"10155392185178352","commenter_b":"'@username she still immigrant . She come in visa and hurry married for papers like any other person.","commenter_a":"He better deport his wife too","post_message":"It's open season on illegal immigrants: Trump declares that ANYONE in the US illegally can be deported, regardless of whether they've committed a crime"},{"comment_id":"828087617226661","commenter_b":"Do you think if someone wrung her neck her face would pop off???","commenter_a":"I can't see her face without wanting to punch her in it.","post_message":"A perfect example of the difference between Democrats and Republicans.  This is how they treat allies:"},{"comment_id":"743009682482479","commenter_b":"Our military needs to follow the example of General Pershing in 1911. Soak the bullets in swing blood, kill them, pack their cavities with sausage and bury them with a pig. This would stop the rest of them from whining. This guys is a loser from the start.","commenter_a":"Don't worry ducky, soon you will join your comrades in line waiting for your non-existing virgins. Will a couple old goats do?","post_message":"Boo-Frickin'-Hoo. You think life sucks now... @webpagelink"},{"comment_id":"10152892067227144","commenter_b":"Far more competent and capable than anyone out there on either side!","commenter_a":"If she is the best we dems can do, we are in bad shape.","post_message":"The time has come."},{"comment_id":"10156214197580725","commenter_b":"Right!!...She belong in JAIL, PERIOD!! PERIOD!!!!","commenter_a":"You're all ignorant","post_message":"Check out OAN and compare to what you are watching now! #DemDebate"}]
