[{"comment_id":"10154170724496409","commenter_b":"@username, according to YOUR new president, we can all drop by your house and grab your pussy...Don't get mad at me, trump said it was alright.","commenter_a":"Obummer sucks. DONALD TRUMP. None of you can change that. Poor pitiful liberals you really do make yourselves look desperate and ridiculous","post_message":""},{"comment_id":"1761764947438429","commenter_b":"@username you do realize Hilary wants to deport illegal immigrants too right? She announced it this last week.","commenter_a":"Women should feel insulted that the first female ever to be nominated also happens to be a corrupt, cold, calculating, ruthless, lying crook. If we're going to give the distinction of 'first woman nominee' or, God forbid, 'first woman president' to anyone, she is, quite literally, the last woman in the country who deserves the honor.","post_message":""},{"comment_id":"1657355931148625","commenter_b":"We are armed. Don't kid yourself Mitchell. The difference is that we would take up arms to protect the land by preventing poaching, over-grazing and unsustainable resource extraction, whereas these fucks want unregulated access to sensitive ecosystems.","commenter_a":"Oregon is an open carry state. These Militia men aren't doing anything wrong. The BLM outpost is on public property and was unlocked. There was no violent takeover. They are protesting just like the black lives matter movement that all you libs support The only difference is these men are willing to fight for their land","post_message":"\"We're planning on staying here for years.\""},{"comment_id":"1765902270312370","commenter_b":"Asshole","commenter_a":"P","post_message":"The message from Ted Cruz and Donald Trump is clear: If either of them become president, Guantanamo Bay won't just stay open -- it will be expanded. Does that sound good to you?"},{"comment_id":"10152745138297093","commenter_b":"Way to go Steve!! You put this guy on blast!!! Look out people.","commenter_a":"Busted !","post_message":"Consumer reporter Steve Noviello was invited to a demo for a safety and security window film, but things didn't quite go as planned... @webpagelink"},{"comment_id":"10153285740536336","commenter_b":"Gays can't create life? Hmm. I guess lesbians can't get pregnant or gay men can't inseminate a surrogate either. Anyone can create a life. But can they nuture a life? Plenty of gay parents out there do, while a shitload of straight parents don't.","commenter_a":"Sickening, YES! Just more proof of the changing times and how people deviated from their upbringing b/c they want to do what they want; not what is right...no respect for self or others....DISEASE!!!","post_message":"BREAKING NEWS: Ireland votes to legalize gay marriage. The traditionally Catholic nation saw 62.1 percent of Irish voters vote “yes” on gay marriage referendum in what is seen as a landslide victory for gay-rights advocates."},{"comment_id":"10153007103196336","commenter_b":"Yes, teachers do hve input as to curriculum. No teacher nor educator has the right to instill their political views on to their students.","commenter_a":"These teachers need to be replaced if they are inserting their political views in the classroom and have only One answer which the see as correct whether it is correct or not! This is MY opinion! This does Not need to be taught in school anymore than religion! Go argue on someone elses opinion if you don't like mine. I will Not be called ignorant by anyone!","post_message":"“The Democrat is building. The Republican is destroying.”  According to an 8th-grade teacher in Wisconsin, this was the correct answer for a social studies assignment on immigration policy."}]
