[{"comment_id":"1402181823177264","commenter_b":"He wants all Muslim refugees to stay there......","commenter_a":"GOOD FOR THEM , EVERY STATE IN THE UNION SHOULD DO THIS !!","post_message":"Victory for the Constitution!!"},{"comment_id":"10156094482870354","commenter_b":"Throw that fat stank ass pig in the pen!","commenter_a":"She deserves the same","post_message":"***UPDATE***"},{"comment_id":"10153414242381130","commenter_b":"And another. Oh those terrible feminists. @webpagelink","commenter_a":"Considering the male comments on this article, women aren't your equals. Thankfully.","post_message":"Ability? Absolutely. Opportunity? Nope."},{"comment_id":"10153197491081051","commenter_b":"She's already proven she's delusional","commenter_a":"Nancy - Have Another Drink !","post_message":"Nancy Pelosi says President Obama's Iran deal is simply brilliant. Agree or disagree with her?"},{"comment_id":"827683380698175","commenter_b":"@username, so this guy should use the woman's bathroom?","commenter_a":"XY, XX there is nothing more, deal with it","post_message":"The American College of Pediatricians just made a SHOCKING statement about transgendering young children. Liberals are going to be pretty upset over this."},{"comment_id":"1273163526055538","commenter_b":"Amen we owe them big time, send illegals back to their oun country , start shooting at the border that will stop them lol","commenter_a":"I have been given the option to use an outside provider when they weren't able to get me in within 30 days.","post_message":""},{"comment_id":"992230870799703","commenter_b":"Naw...she's right and yet...people keep fuckin around with white people. Get smart. Leave the crazy bastards alone. Duh.","commenter_a":"Jason, maybe whites should stop shooting up their own movie theaters and schools. And show me evidence of blacks attacking police officers. I suggest you worry and take out your own trash before you start with racist bullshit. Serial killers, rapist and mass murders Mostly white.","post_message":"Rebel Wilson's usually so funny so this awful joke about police and black lives came as a huge shock. #VMAs #BlackLivesMatter"}]
