[{"comment_id":"1048491781950666","commenter_b":"thats the look we give when they let Kellanne dumbass talk..why they ever listen to that dumb blonde i will never understand..","commenter_a":"That is after barfing.","post_message":"So true!"},{"comment_id":"734527313335610","commenter_b":"Corina doesn't have a head occupying her brain. She doesn't seem to be aware that Jews have been \"occupying\" that region for 4000 years.","commenter_a":"State who creates biggest terror in the world since 1948 doesn't know anything about human rights.","post_message":"Iranian President Hassan Rouhani famously said in 2013 that ethnicities, all religions, even religious minorities, must feel justice..."},{"comment_id":"10153380286877293","commenter_b":"You sound like a sensible woman out of all the waste of sperms in your state","commenter_a":"Should they all be Christian? Should they all be Muslim? How about the fact that they're human? However, we need to be sure that terrorists are not infiltrating and posing as refugees. THAT is the concern for our national security.","post_message":"Season’s greetings. A cartoon by Tom Toles via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"437859166374039","commenter_b":"For all the idiots out there who think its a good idea to burn people's shit FOR STARTERS BURN YOUR SHIT NOT OTHERS WHO WORK HARD FOR WHAT THEY HAVE... STOP TRYING TO SAY ITS FOR FREEDOM FOR THE BLACK RACE YOUR MAKING IT WORSE","commenter_a":"please, this country was founded because people rioted when their tea was being taxed LOL.","post_message":"\"This is not protesting, this is not first amendment rights.\""},{"comment_id":"1214110285315058","commenter_b":"Great that's sounds good to me.Now tell him to tell his people to tell the kids and tell the hate groups,especially the kkk and others to stop yelling white power and build a wall and bulling people.Tell him to stop terrorizing people from Mexico that have been here for years that he is going break up families.That a good start.That's not God's ways.This is an America for all.","commenter_a":"God gave us a choice and decent rules to go live by but unfortunately some people just don't follow God's rules and a trump is produced.Using Vile language,threatening people,a wife that is no example to little girls but everybody in the republican camp adores him.He's gonna save the world.Not!","post_message":"If you claim to be a “Christian” but support Donald Trump and all the hate and bigotry he embodies, you’re a hypocrite."},{"comment_id":"906670476046247","commenter_b":"And you just said you are not for choice. You care less for the hungry And homeless. You want them killed. You want them to have no choice. Giving money to kill the child of someone who really wants to keep their child but can't because you gave money to have it murdered instead of giving money to her to help her with her choice to keep her child. Yeah. Pro abort!!!! Force abort!!!! Force te 11 year old against her will. Give money to murder mills to force a helpless woman have no other option because people like you pay to kill her child and not help support it.","commenter_a":"Stop Death Camps For The Unborn!!! Abortionists Are No Better Then Murderers!!!!!","post_message":""},{"comment_id":"10155752505360354","commenter_b":"He is done by wanting Oprah as his VP! He shot himself in the foot in one day;","commenter_a":"A man who's made billions... yea, that's what we need, another corporate hive-mind in a leadership position. Wake up.","post_message":"Think Donald Trump lacks serious policy proposals? Think again."}]
