[{"comment_id":"10154838480761729","commenter_b":"Nothing will stop this because they want to become martyrs and are ready to die for Allah. Killing them before they kill you is the only solution.","commenter_a":"Here we go again, it's the guns! Oh wait, I thought ALL guns were illegal in Germany? They need to tell these criminals that they are not supposed to have guns! How dare them break the law and get illegal guns! They need to make more gun laws because that will make it harder to get guns.","post_message":"UDPATE: Authorities warning MASS TERROR ATTACK UNDERWAY  Manhunt underway, public transit shut down..."},{"comment_id":"10154520353580329","commenter_b":"All humans have breasts, relax","commenter_a":"Not all people with boobs/breasts identify as women.","post_message":"I love you AND I hate you."},{"comment_id":"10153815674903299","commenter_b":"Funny how y'all are judging but if you think you're perfect you're wrong. Trump may not be perfect but at least he's not selling out to the ones trying to take away our Christian beliefs.he wants Christian morals back in our schools and families and I don't care about the rest. God will handle the rest. If Hillary gets in you better learn Sharia law because shes already sold out. At least we have a chance with trump.","commenter_a":"1168434116541793maybe you should research Hillary 100% lies","post_message":"'What you really have to do is you have to pray to get everybody out to vote for one specific person.'"},{"comment_id":"10153975105390950","commenter_b":"Lock her up for life","commenter_a":"Sounds like she should have found a new career. A long time ago","post_message":"In one incident, the woman hung up on a caller reporting a robbery at a convenience store. The man called back and spoke to a different operator, but by the time police arrived, the store manager was dead."},{"comment_id":"983233615058995","commenter_b":"Well, she is guilty and they are doing their jobs.","commenter_a":"Get obama to let the fbi to arest her","post_message":"“I think the bigger problem is not just the media, it’s the FBI.”"},{"comment_id":"1480806588645751","commenter_b":"'@username, Nancy is not well educated. Clinton or Trump presidency will lead to WWlll. We need to stop voting for the lesser of the two evils. I bet Nancy has never heard of Machiavelli.","commenter_a":"And Hitlery wants to bring thousands of Syrian refugees to our country. This has to be stopped!! TRUMP/PENCE 2016","post_message":"Manhattan bombing in Chelsea has similarities to the Boston Marathon bombings of 2013, say explosives experts"},{"comment_id":"1723610494573092","commenter_b":"Thanks a fucking lot to the woman who decided to skip her period and have this douche","commenter_a":"Marihuana is not physically addictive, but isn't pshycologically just as dangerous!?! Just because one bad and dangerous thing(alcohol) is legal - does not mean that legalizing another is a good idea!!!","post_message":"Alcohol is 114 times more deadly than marijuana.  Like ATTN: on Facebook."}]
