[{"comment_id":"710250332447494","commenter_b":"She's an idiot and should get out of our country","commenter_a":"what drug is she on ?","post_message":"Woman Goes On National TV And Blames Americans For Banning Sharia Law And Executing Kids In...  This must be some kind of sick joke.  Do you think she has completely lost her mind?"},{"comment_id":"1100928479922812","commenter_b":"Do you even beleive in smart women?","commenter_a":"Maybe compared to all the stupid people who support them they seem smart. The one eyed man is king in the land of the blind !","post_message":"I am not one of these people that thinks Hillary Clinton is The Smartest Woman in the World.  I don't think Elizabeth Warren's The Smartest Woman in the World.  What happens here is that whatever liberal female rises to prominence, it's just standard operating procedure that the media and everybody's gonna refer to them as The Smartest Woman in the World."},{"comment_id":"10155618780610093","commenter_b":"Go stick your head back in the ground Anne...clearly you have failed to realize that unless ISIS is wiped out..they will not stop...period. And yes they want to strike us here. You want that? You rather they come here on our turf? Lady you better do a gut check and wake the hell up.","commenter_a":"Sorry but we should NOT have boots on the ground in Syria.","post_message":"\"It involved hand-to-hand combat, the jihadists tried to use women and children as human shields, and about a dozen jihadists were killed.\""},{"comment_id":"10153059782796770","commenter_b":"She's a lier","commenter_a":"She is a crook always has been!","post_message":"Hillary Clinton: “I have gone further than anybody that I’m aware of in American history … to try to be as transparent as possible”"},{"comment_id":"10153896425024330","commenter_b":"Some women are idiots. Victim blaming is a disgusting habit.","commenter_a":"Some women are saying , what did he do to deserve that ...","post_message":"This woman is accused of setting her boyfriend on fire and police are searching for her. Warning, the details are disturbing. ---> @webpagelink"},{"comment_id":"1096005223798926","commenter_b":"Here we go with the wall...","commenter_a":"Trump would have never left that Marine in Mexico like Obama did...","post_message":"Donald J. Trump and Mexican President Enrique Peña Nieto give statements after meeting in Mexico City."},{"comment_id":"460760697382304","commenter_b":"Ummm... Not sure what that has to do with the U.N. but ok.","commenter_a":"The UN has been one of the greatest propaganda tools in history! They serve no actual purpose other than releasing statements from time to time with the appearance of having morality supporting it.","post_message":"The UN commission claims that Israel exercised \"great restraint\" while bombing elementary schools in Gaza which resulted in the deaths of 519 Palestinian children last summer."}]
