[{"comment_id":"10153465142866037","commenter_b":"Regina just stfu. Idc","commenter_a":"who cares. its their country their rules. i dont see why people like to police other countries because they find their practices to be disgusting. no different than people consuming pigs, goats, cows and chicken. don like it? donate other possible food sources then. if not stfu","post_message":"\"There are all sorts of cultural norms about what you can eat; you eat turkey, so why are you trying to force us to not eat dog meat?\""},{"comment_id":"10156248973870354","commenter_b":"that bitch!","commenter_a":"i was sexually harassed by Ashley Judd, she had her way with me, then tossed me aside","post_message":"When will liberal Hollywood stop its War on Women?"},{"comment_id":"1217766195006823","commenter_b":"DISGUSTIMG CLASSLESS PIGLETS UNREAL","commenter_a":"Congrats to the left,You've just proven to the world,you don't need Obama to make America look foolish,you can do it all on your own.","post_message":"ClashDaily.com"},{"comment_id":"10155026272596320","commenter_b":"Loose lips sink ships!","commenter_a":"There saying nothing","post_message":"REPLAY: Senate hearing on Russian hacking. Office of the Director of National Intelligence NSA - National Security Agency"},{"comment_id":"584112685109576","commenter_b":"Nah that was Sanders @username. Hillary will lead us into an even more corporate America with a short economy and allow foreign threats to come in while the middle class die and Hillary and the elite get richer and richer.","commenter_a":"Clinton will lead us into corruption, loss of independence and freedo,... she will lead us into a socialist communist state bowing to russia and north korea. Vote Trump and save our future.","post_message":"If you've ever wondered what Hillary's like as a friend, you could ask Janelle."},{"comment_id":"10153105200194497","commenter_b":"I couldn't stand this chick.","commenter_a":"Tom Lombard","post_message":"From our sister publication: \"Next Week On ClickHole\""},{"comment_id":"10152574431526636","commenter_b":"but its ok for females to tell us how to sit? bit sexist.","commenter_a":"Alright, then women have to stop wearing leggings without a skirt..leggings by themselves looks trampy.","post_message":"Men, here's why you should close your legs on public transport..."}]
