[{"comment_id":"538334903023756","commenter_b":"Yes....throw her ass in jail.","commenter_a":"That's what happens when you engage you mouth before your brain","post_message":"The Baltimore prosecutor is about to go down in flames after this.  She is a criminal, just like the rest of them.  Do you agree she should serve time?"},{"comment_id":"10153307059689714","commenter_b":"Women are bad","commenter_a":"Girls at my school were not allowed to wear just leggings either.. I'm not scratching my head..don't really understand why this is a viral story..?","post_message":"Scratching our heads"},{"comment_id":"10153003040749091","commenter_b":"Thugs","commenter_a":"Soon will catch this people what a shame.","post_message":"HOME INVASION: Men break into South Bronx home, steal necklaces, PlayStation. Watch the surveillance video of the suspects.   FULL STORY: @webpagelink"},{"comment_id":"10152870861243837","commenter_b":"You guys are brainwashed.","commenter_a":"Shows were priorities are. You guys should some great stories about our fallen heroes soldiers and what the community is doing to help but let's trade BBQ ideas. But that's Florida for ya. I'm sooo happy I moved to TX were we are actually having memorials ,recreations, events, to show the generations what our soldiers went thru. Houses here show proudly displayed flags. Remember the fallen for if it wasn't for their sacrifice we wouldn't be the land of free.","post_message":"Tips for people looking to fire up the grill on Memorial Day @webpagelink"},{"comment_id":"10153394437991336","commenter_b":"Illegal aliens aint welcome to merica deport them back!!!","commenter_a":"Univision responds to Mexico or the US? These guys are wrong. AMERICA first! If you dont like it, go back.","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"1190463677676992","commenter_b":"Immigration laws are not being in forest because it only applies to legals and not illegals. It's time to make stronger laws and strongly in force them. Also illegals shouldn't be given drivers licenses or any form of ID until they become American citizens.","commenter_a":"The way I see it is this, if people come here and they are illegals SEND THEM BACK TO WHERE EVER IT WAS THAT THEY CAME FROM, the next step is build a wall that's high enough with barbwire around it so they can't try anything","post_message":"Do you agree?"},{"comment_id":"398088506982411","commenter_b":"Send them back to where they came from. They have no rights....they aren't AMERICAN citizens!!","commenter_a":"deport every one them but their country dont want them either they dont know the meaning of being human it seems","post_message":"This is not a good image for those who are trying to support the rights of illegal aliens."}]
