[{"comment_id":"10154153179614445","commenter_b":"She is a female plain and simple dna dont lie!!!!!","commenter_a":"Good sorry but proud of the boys for standing up for their rights...you are a boy not a girl therefore no you shouldnt have the right to be king ...go home and sit in a corner and cry","post_message":"A transgender teen and his peers are protesting their high school’s decision to deny his bid for prom king. Hear Ash’s story: @webpagelink"},{"comment_id":"10153619254387439","commenter_b":"You stupid son of a bitch. She will never do a day in jail. Dream on asshole.","commenter_a":"FBI didn't seize a fucking thing, they were voluntarily turned over to the FBI and justice department. Geller is a rotten crotched liar.","post_message":"// google_ad_client = \"ca-pub-@username\"; google_ad_slot = \"@username\"; google_ad_width = 336; google_ad_height = 280; // ]]> // // ]]> Hillary is such a tool for jihad and a knave to her lover pal Huma Abedin, I don t care how this destroyer gets her comeuppance, as long as she does. Like Capone and tax evasion charges. It was hardly the worst of what he did, but it got him put away. She should be sitting in prison for Benghazi, but if this is the best we can do, so be it. Although I hardly trust the DoJ. WASHINGTON As pressure builds on Hillary Clinton to explain her official use of personal email while serving as secretary of state, she faced new complications Tuesday. It was disclosed her top aides are being drawn into a burgeoning federal inquiry and that two emails on her private account have been classified as “Top Secret.” ..."},{"comment_id":"1261955857213973","commenter_b":"Sounds good....illegal alien it is.","commenter_a":"It's illegal alien. As in not from this country. An immigrant is one who has applied for entry into this country legally before they left their home port/border.","post_message":"USC Professor Warns Students, Don’t Use Term “Illegal Immigrant” On Final"},{"comment_id":"1739262919647781","commenter_b":"Hilary is a Republican. She votes like one on war and trade deals. I can find examples if you would like","commenter_a":"Dear Democrats. Bernie Sanders is \"not\" a Democrat. Bernie applied as a conscientious objector in the Vietnam war and did until he was too old to be drafted. In July 1985, Bernie Sanders traveled to Nicaragua, where he attended an event that one wire report dubbed an -U.S. rally. In 1981, he won a shocking victory by only 10 votes to become mayor of Vermont largest city, Burlington. Sanders was elected on a socialist platform and led a mayoral administration that he boasted was radical than any other in the country. And he had a vision! Sanders believed his work in Burlington could spread socialism throughout America. In April 1985, the Los Angeles Times published a lengthy interview with Sanders in which he outlined his plan to spark change. That is exactly what he is trying to do now. Show a tiny bit of his plan and drastically change America ...","post_message":"Back-to-back poll results suggest that Hillary Clinton is on the cusp of a pivotal victory that would help her regain momentum after a string of embarrassing defeats and that would deliver a blow to Bernie Sanders as the two Democrats gear up for the final stretch of voting."},{"comment_id":"1273398092695609","commenter_b":"Rosie is one of the most disgusting women","commenter_a":"protect your kid not your pigs","post_message":"Rosie is disgusting!"},{"comment_id":"753368658095076","commenter_b":"Some people should not be allowed to breed, let alone having these many kids. Birth control should have avoided all these tragedies. Imagine the mental damage done to the remaining children.","commenter_a":"\"F\" er...period.IF...this is true...","post_message":"She confronted the father of one of her kids in court."},{"comment_id":"1178752805478081","commenter_b":"Sick the American get off this privacy","commenter_a":"If someone comes to my door wearing that outfit,I will personally egg them.......","post_message":"It's nowhere near October, but one ensemble is already on track to be named the most controversial Halloween costume of 2015."}]
