[{"comment_id":"10154199374772894","commenter_b":"Women need to stop playing themselves. He only wants money on his books.","commenter_a":"Well it's the thought that count.. At least she know that and accept it for what it is... But some of these hoes don't know bout that tho","post_message":"ICYMI: Apollo Nida Gave His New Fiancée an Engagement Ring Made Out of Paper Towels [Photos]"},{"comment_id":"10153189234471491","commenter_b":"I still want my coke 0. Gitty up !!!","commenter_a":"Hahaha! European countries welcoming muslim refugees beware! In a few years time......","post_message":"She filed a discrimination complaint."},{"comment_id":"10154133402331770","commenter_b":"She needs to pull up her big girl panties,get over herself,go sit in a corner an SHUT UP!!!!","commenter_a":"she must have a lot of pull huh? Get of your bandwagon and properly take care of your children why don't you.","post_message":"Should Obama declare martial law and prevent Trump from being president \"UNTIL TRUMP IS 'CLEARED' OF ALL CHARGES\" as Rosie O'Donnell argues?"},{"comment_id":"10156660915665354","commenter_b":"The woman should thank Ms Palin for keeping her employed. If she didn't resemble Sarah she wouldn't be working. Since there isn't much talent there.","commenter_a":"Sure, Sarah made Tina famous and rich. But Tina helped do the same for Sarah. I believe Sarah is laughing all the way to the bank....just as much as Tina is. Sarah did look a bit disjointed at the endorsement and Tina jumped on the opportunity to mock her. But Tina....sorry. You failed miserably. Didn't laugh at all. SNL is just sad. Don't watch any longer. The constant right bashing is boring and predictable.","post_message":"You saw this, right?"},{"comment_id":"1323629084344227","commenter_b":"and pretty much any woman could be a better president than Hillary.","commenter_a":"Not only can a woman be president but Hillary can be a better president than most men in fact the only MAN that can be a better president than her IS Bernie","post_message":"Stay classy, Bernie fans!"},{"comment_id":"512673055591027","commenter_b":"She's such a joke.","commenter_a":"Why can't this woman get a job and shut up?","post_message":"Sarah Palin says she will work to defeat House Speaker Paul Ryan by backing his primary opponent in Wisconsin. @webpagelink"},{"comment_id":"1640586052910285","commenter_b":"Close them.Then make it tough to come to America.Its to DAMN easy now,,that's why were lousy with illegals.","commenter_a":"NO!","post_message":"Senator Tom Cotton just introduced Trump's immigration proposal through the Senate! Sign the petition SUPPORTING the bill HERE: @webpagelink"}]
