[{"comment_id":"10154872503577042","commenter_b":"If the child is deemed not viable for life outside the womb they will grant an abortion however get this there is nothing written into this law to protect the mother or take her health into consideration at all. It is a disgrace!! Turning women into human incubators whose body is controlled by the government.","commenter_a":"Wow are people really so uninformed? What if the baby has a condition incompatible with life or if the mother's life is at risk? What if it's an ectopic pregnancy that isn't always known by 6 weeks?","post_message":"Ohio lawmakers have passed a bill that would ban abortions in that state from the moment the heartbeat of a fetus can be detected."},{"comment_id":"10153811054249749","commenter_b":"Werent immigrants. They'd flown over to do this and some other jobs then planned to go back.","commenter_a":"Citizens arrest. Very good. Nice to see some black citizens using their fitness and strength to uphold the law. A good image for black people worldwide... Estonian immigrant eh? Well, well, I would contend it's a moot point whether or not he's 'enriched' the UK. He certainly is trying very hard to 'enrich' himself, although I think he should consider another profession to be honest... ;-)","post_message":"Police release CCTV footage showing members of the public in Leeds tackling an armed jewellery thief and pinning him until police arrived."},{"comment_id":"631512343684752","commenter_b":"That last one is not a fact. It's a talking point. I am a white Christian and I hate his policies. Not him. I hate socialism. It's working do well in Venezuela. The dems are the ones throwing the race card around to get people's minds off the facts. For example, a few people have health care now that didn't before. But more people lost their health care than gained it. Obama care is forcing insurers nd doctord out of the market which cause a loss of coverage.","commenter_a":"Bahahaha...I would LOVE to see legitimate sources.","post_message":"Facts suck, huh?"},{"comment_id":"1369422333077793","commenter_b":"Witch Hillary and hubby slick Willie..","commenter_a":"#Trumphasmyvote","post_message":"Is there any stopping Hillary Clinton and Donald J. Trump now? Let's take a look at the math."},{"comment_id":"10154653626394024","commenter_b":"oh hell no !","commenter_a":"I want him back in the WH .","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153739079978812","commenter_b":"Waste of my energy girl..","commenter_a":"Hillary","post_message":"A new poll produced for ABC News/ Washington Post suggests negative views of Hillary Clinton have jumped since midsummer, while Donald Trump's popularity has grown more polarized along racial and ethnic lines: @webpagelink"},{"comment_id":"10153337350877217","commenter_b":"This is like a long running sentance And Jimmy saville is still dead.this often crops up in papers.","commenter_a":"Yaw hear about Colbert Chischilly?","post_message":"Tributes were paid to Leslie Nielsen today but he died 5 years ago..."}]
