[{"comment_id":"1753488154905363","commenter_b":"Bush signed NAFTA. Trump is supposed have a moron.","commenter_a":"Deplorable from Ohio","post_message":"Donald J. Trump speaks to the press after touring the Flint Water Plant and Facilities."},{"comment_id":"857951050917630","commenter_b":"She needs to be beaten and slammed on the floor, I VOLUNTEER TO DO IT !!!!","commenter_a":"Linda that's not meth,bad acne","post_message":"A 26-year-old mom is accused of beating her son and slamming their 1-month-old puppy against the floor, because she did not want to clean up after the pet: @webpagelink"},{"comment_id":"1776736589270843","commenter_b":"People don't care it shows what our country has become. Hillary will get plenty of votes","commenter_a":"Charged with 24 counts of fraud and still got 39% of vote. Unbelievable","post_message":"So long, farewell..."},{"comment_id":"1368444483166524","commenter_b":"Best line of the day....Hillary: \"RELEASE YOUR TAX RETURNS.\" TRUMP: \"I EMAILED THEM TO YOU.\" HAHAHAHAHA","commenter_a":"One reason I support Trump is not because he knows everything, but because I agree with his position on most things. I like his energy and desire to solve problems, and he seems to be willing to change when something isn't working..unlike most politicians who refuse to admit when they're wrong. However, (and this is an example) when Hillary says he doesn't believe in climate change, he needs to back up his position with facts on why. Sure she can say scientists believe in it..well not all of them do. Trump needs to bring up scientists that don't support that theory. Also I would like to see him release his taxes, so she can't bring it up anymore.","post_message":"'CNBC, Time magazine online polls say Donald Trump won the first presidential debate' via The Washington Times."},{"comment_id":"624073524449893","commenter_b":"Leave Trump alone, We love him","commenter_a":"I love Fox News","post_message":"A Fox News reporter just left for this surprising reason. No matter we stand behind Fox News. Do you support Fox News?"},{"comment_id":"1338210979551629","commenter_b":"Lady your way too old to be a cheerleader!!!!","commenter_a":"This woman is not well","post_message":"HOLY SMOKES! NANCY PELOSI: Orders People to Clap, Repeats Words Then Calls John Kasich The Gov. of Illinois [Video] This is embarrassing! She scolds the audience!"},{"comment_id":"1666670816943719","commenter_b":"Let's help protect the interns at the White House! Keep the Clinton's out!","commenter_a":"I can NO LONGER DRINK TRUMP'S POISON. Stupid me. Anyway, Donald, you are SATAN.","post_message":"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!"}]
