[{"comment_id":"10153603093348132","commenter_b":"You are not that smart are you?","commenter_a":"DONT RUN","post_message":"\"We feel the system is working but it doesn't bring him back.\""},{"comment_id":"10153730594409099","commenter_b":"Who are all these women stuffing their babies in bags?","commenter_a":"Thank god the baby was left somewhere where baby could be found alive unlike all these mothers stuffing them in bags killing them. This was a woman that loved the baby enough not to hurt it. Maybe she was afraid of something like deportation or something else. At least it was at a church not in a dumpster or alley. We don't know the circumstances or her story so lets not be aholes and judge at least someone can raise that baby who wants it.","post_message":"BABY IN A MANGER: A wailing newborn baby was found with its umbilical cord attached inside a nativity scene at a Queens church, police say ----> @webpagelink"},{"comment_id":"10153707986556491","commenter_b":"Brainless sheep! I like that","commenter_a":"Fabulous, great sense of humor and brains; trump is the icon of decadence under a cheap (very cheap) speech, only brainless sheeps follow him.","post_message":"“I have built a papier-mâché wall for Mexico. It costs $17.99. Fabulous!”"},{"comment_id":"10156077468780354","commenter_b":"She'll be worse then Obama","commenter_a":"We can all hope that she is 80% of the way to the Big House!","post_message":"Before a single vote is cast?"},{"comment_id":"10153611062907217","commenter_b":"#LetAmericabebadagain trump2016","commenter_a":"If you vote in this racist idiot as your president , Your country will be going down the shitter for many many years to come. The guy is a nut job who hasn't got a clue !! He's a threat to world peace ... Anyway good luck America","post_message":"\"I am offended. Those are very rude statements.\""},{"comment_id":"10153815696151336","commenter_b":"I don't know about that. I think this election we have many that will go up against HRC. She ruined her own chances. Everyone's sick of the shenanigans","commenter_a":"\"DESPERTA FERRO\"..., AWAKEN IRON!!! Christian Battle Cry of the Crusades. Unite and Fight people. WIPE THIS DEMOCRAP FILTH FROM AMERICA!","post_message":"“I am Hillary Clinton‘s worst nightmare — a conservative woman who will take her on on her track record and her policies and her lies.” – Carly Fiorina"},{"comment_id":"10152984234114726","commenter_b":"Deport all Muslims!","commenter_a":"Muslims can live in their Muslim lands in the Middle East. Europe must expel these terrorists. Unlike the Nazis, these Islamists will NOT be sent to concentration or death camps. They will be sent to their homes to stop their invasion of other lands. But we must say things that are NOT politically correct and follow those with actions if we are to survive these Islamic horde. Once they have enough power to resist, then it would be too late. Now is the time to deport, expel or arrest them. Now not later.","post_message":"VIDEO: RAW footage from the terrorist attack in Paris!"}]
