[{"comment_id":"10153379974755329","commenter_b":"You have a baby in your belly. No more goofing off!","commenter_a":"Michael Aragona @username @username how do you like that?","post_message":"Thank you, restaurant gods."},{"comment_id":"10155049967862619","commenter_b":"Is that how they saying thank you to Israel for taking care of there refuges and is nobody can have Golan except Israel because were given to Chosen People God so Syria,Palestinian and all Muslim keep your hands away from Israel territories.Amen.","commenter_a":"BE STRONG GOD ALWAYS WITH YOU''","post_message":"Benjamin Netanyahu - בנימין נתניהו responds to Syria!  -VirtualJerusalem.com"},{"comment_id":"10152984956631378","commenter_b":"Alan. Yes, it is murder. Abortion isn't done at 8 months.","commenter_a":"If abortion is totally banned, get prepared for this kind of thing to happen far more often.","post_message":"POLICE: TEEN BEATEN TO ABORT BABY: Police say four family members were arrested after a 14-year-old girl impregnated by a relative was beaten in order to induce an abortion: 6abc.cm/1Q7wchn"},{"comment_id":"602931503228475","commenter_b":"I have never heard of or seen a cow attack a person!!! No Good Worthless Muslims!!!","commenter_a":"Those men will burn in hell one day","post_message":"Two Men Were Stabbing a Girl in “Honor Killing” When This Cow DID THIS to Stop Them…"},{"comment_id":"10153445196113984","commenter_b":"She has no right to control any thing!","commenter_a":"Not only does she not have any class, she is ugly and gross! I do not care if she is republican or democrat she is just nasty!","post_message":"This has to be very embarrassing for the First Lady. Hopefully this doesn't make her try even harder to control Americans...  Do you think Michelle Obama as First Lady is bad for America?"},{"comment_id":"1244894375530590","commenter_b":"all the illegals are not accounted for, so this is false!!!","commenter_a":"Hope it's true","post_message":"There was one big reason for leaving."},{"comment_id":"788608041305150","commenter_b":"Seems like a good time to turn off the tap to these law breaking cities. Go Trump!","commenter_a":"STOP THE INSANITY! Defund them and arrest those in charge that are breaking the law!","post_message":"A new study shows that more than 100 sanctuary cities across America received a total of $27 billion in federal grants and direct payments in one year."}]
