[{"comment_id":"10153532246695779","commenter_b":"She looks ugly with that hairdo","commenter_a":"This was a beautiful version! She added her touch yet kept the timelessness of this classic in tact. Bravo","post_message":"Sia has covered the Nat King Cole standard 'Unforgettable' for the upcoming Finding Dory the long-awaited sequel to the Pixar hit Finding Nemo. Watch her debut the track below, during an appearance on 'The Ellen DeGeneres Show.'"},{"comment_id":"10152954231420399","commenter_b":"Paybacks are a bitch!","commenter_a":"Karma isn't it great","post_message":"An extraordinary act of trolling:"},{"comment_id":"1090370634418986","commenter_b":"'@username lol nah it's the bitchy women that make good men run from all women.","commenter_a":"The man is my younger brother and this girl is a psycho. She broke into his house, they WERE engaged but not living together, and she stole $2.1 MILLION worth of jewelry. And this stuff happened AFTER he paid off her house and bought her a business, (just a nail salon). My brother was married for over 20 years and his x will tell you just as I will that he is the most laid back and passive guy you'll ever meet. She sent the jewelry to her parents via UPS and now they're in just as much trouble. The stolen merchandise was never recovered","post_message":"This woman has said her ex-fiance hit her, causing a black eye and other injuries. But now his attorney says this home surveillance video tells a different story.  It's the latest round in a legal battle involving allegations of millions of dollars in stolen jewelry that's unfolding in a Bay Area courtroom: @webpagelink"},{"comment_id":"10153480074973352","commenter_b":"She need the death penalty","commenter_a":"PROTECTED CUSTODY CAUSE YOUR ASS IS GRASSED BABY KILLER .","post_message":"Mother who drugged her two-year-old daughter and suffocated her because she was worried her ex's new girlfriends would take her place is jailed for 37 years"},{"comment_id":"10153070666326336","commenter_b":"Kill all the non believers Haider? That's killing innocents!!!","commenter_a":"if anyone believes Iran will not pursue nuclear power they are delusional...they are playing the obama admin the same as every politician before.","post_message":"'It is necessary that the stance of the U.S. administration be defined about this move.” - Iranian Foreign Minister Javad Zarif"},{"comment_id":"10153090058473984","commenter_b":"Fry her dam ass","commenter_a":"GOOD!!!","post_message":"She probably thought she had gotten away with it. Not so fast, Hillary...  Should she face criminal charges for this?"},{"comment_id":"1414587195226950","commenter_b":"2 all the women in pink why not just pack up ur pink panties and move 2 Cuba now that we have relations again I hear it's a paradise.","commenter_a":"GROW UP","post_message":"Female supporters of President Donald Trump aren’t sure why the Women’s March was necessary."}]
