[{"comment_id":"10153598011598812","commenter_b":"She is like.... Told you to stay away from those blonde white bitc... lol","commenter_a":"With his mommy right beside him worried about where her money is going to come from now","post_message":"Former FSU quarterback says \"I totally should have walked away\" after video surfaces showing him punching woman in the face."},{"comment_id":"10154752862228941","commenter_b":"No Weapon formed against us shall prosper...witches have absolutely no power over men of God","commenter_a":"These people are not REAL witches. They do not know what they are doing and only will cause harm to themselves. Real witches look to help and heal. What they put out comes back three fold. These people are just plain evil and should not be considered as witches.","post_message":"The forms of protests against President Donald J. Trump are just getting weirder and weirder..."},{"comment_id":"10153380286877293","commenter_b":"You sound like a sensible woman out of all the waste of sperms in your state","commenter_a":"Should they all be Christian? Should they all be Muslim? How about the fact that they're human? However, we need to be sure that terrorists are not infiltrating and posing as refugees. THAT is the concern for our national security.","post_message":"Season’s greetings. A cartoon by Tom Toles via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"10153792306655329","commenter_b":"Love watching this grossness!","commenter_a":"Tom Genaway","post_message":"jlskjerssjklrjsl"},{"comment_id":"10153226808856378","commenter_b":"Get over yourself Sarah","commenter_a":"Smart, caring woman who made a point in a positive way","post_message":"INSPIRING ACT OF KINDNESS: A woman says she was at the coffee shop with her 22-month-old child when two women behind her in line started making mean, hushed comments about her looks. Rather than returning hate with hate, the woman decided to be a role model for her child and show the women kindness."},{"comment_id":"984777404931920","commenter_b":"Our weak border has made Mexico Drug Cartel stronger and made Mexico's government weak with corruption. Mexico has some of the most beautiful beaches in the world that are controlled by some of the most deadliest drug cartels. Mexico is losing billions in tourism because of the Cartel. Mexico is a culturally rich country that is being destroyed by these drug cartels. By building this wall it will help both the Mexican and the American economies by stopping drug trade. The Cartels will lose many because supply will be cut of and Mexico will gain strength. 95% of illegal drugs that come across the border will be stopped by a wall. It will in turn save our communities and our youth. Our youth will be able to flourish instead of turning to drugs. Americans will no longer have to depend on Liberal Politicians asking for help, they will be able ...","commenter_a":"Take away handouts and people committing welfare fraud and put them to work. Seems like there's quit a bit of places hiring where I live. I do believe trump is our our hope and is the best choice for president. Bernie is a joke and Hillary is a liar.","post_message":"I will bring our jobs back to the U.S., and keep our companies from leaving. Nobody else can do it. Our economy will \"sing\" again."},{"comment_id":"10156247602125354","commenter_b":"Waaah, send them home","commenter_a":"Ha ha ha ha ha","post_message":"Newsflash: you wouldn't BE in jail had you not illegally entered the country."}]
