[{"comment_id":"10154069182538128","commenter_b":"You're disgusting!","commenter_a":"Disgusting crap Chris Rock!!","post_message":"Chris Rock didn’t waste any time diving into the controversy over the lack of diversity at this year’s Academy Awards."},{"comment_id":"10153853099981680","commenter_b":"Abedin: she \"could not use a computer\" So much for Hillary being the great email mastermind.","commenter_a":"Ok, so what!! There is no federal statute that prohibits this! There is an executive rule, which if this article is true the Executive who created said rule exempted by communicating with Clintons private email. That said using a pseudonym may create legal issues for Obama that have never been thought about by lawmakers","post_message":"#Breaking: Obama used a pseudonym in emails with Clinton, FBI documents reveal @webpagelink"},{"comment_id":"459523527541329","commenter_b":"Because so many criminals in this country. That's why I'm so confused why so many foreigners want to come here and live. Just stay in your own country and make it better there.","commenter_a":"Drugs and drug dealing. No good role models. Role models that are drug dealers ,pimps and prostitutes. Ex. Jay zeee. Beyonce, barrack oboma. All thugs. That promote drug use and degrade women.","post_message":"The U.S. incarcerates more people than any other country in the world. One in three African-American males born today are expected to go to jail or prison at some point in their lives."},{"comment_id":"1087981781280741","commenter_b":"This has nothing to do with \"political correctness\" and everything to do with the agenda of those who wish to bring this country to its knees. Offend Who? Immigrants - legal and illegal? Muslims? Persons like George Soros? These are schools being attacted; our children, our countries highest symbol.","commenter_a":"How can u even think of not flying our flag anywhere in this country. If u have no respect for our flag get the heck out of my USA.","post_message":"Old Glory just got banned from High School football games for the most despicable reason imaginable. What do you think about this and how should students and their parents react?"},{"comment_id":"1395648327124620","commenter_b":"You're pretty much a stupid whore. I feel bad for your kids","commenter_a":"WAHT DONT U GET?????????????????SHE IS ILLEGAL.......Rayos has been required to check in with ICE every year since 2008, when she was caught working under a fake Social Security number...................NO ONE EVEN KNEW SHE WAS HERE UNTIL 2008....WAKE UP STUPID AMERICANS","post_message":"The 36-year-old mother of two is among the first undocumented immigrants to be deported under Trump strict new policies."},{"comment_id":"10154721377651320","commenter_b":"Don't forget Al Sharpton hanging there too.. shes a joke!","commenter_a":"Really ? So how do you handle having Jay Z in the Whitehouse with the crap that comes out of his mouth that he makes money off. Shaken to your bones ?","post_message":"Thoughts?"},{"comment_id":"10153430683108812","commenter_b":"@username Bryant Carchi","commenter_a":"Clarette Gaviola COLOMBIA!!! :)","post_message":"WATCH: Dramatic moments as members of Colombia's national police run along the rushing Liboriana River near Salgar after this dog fell in the river: @webpagelink A landslide May 18 devastated the area, killing at least 83 people -- (click video for audio)"}]
