[{"comment_id":"10153361395611107","commenter_b":"Class on the left, and no class on the right. She is just another, inept, liberal, lying skank. I put her in the samne group with that traitor, Hanoi Jane.","commenter_a":"Better yet , hit her at her cankles. Paul/Trump ... Trump/Paul for America, not the establishment","post_message":"Guess who I ran into? Tune in to @CBS now to find out why I think she should forever be precluded from being potus"},{"comment_id":"10156555816055354","commenter_b":"A radical muslim wants to kill you. A moderate muslim wants a radical muslim to kill you.","commenter_a":"Wake up and smell the coffee.","post_message":"This is what we're up against, gang..."},{"comment_id":"1267200936634248","commenter_b":"Childhood whooping cough measles mumps etc","commenter_a":"There is no mention of what vaccinations it is about, only that it will be forced. I don't really see this article as useful to anyone lol","post_message":"No jabs, no benefits."},{"comment_id":"728450517283994","commenter_b":"While I can appreciate that there is a flip-side to the coin on reproductive rights, I cannot fathom why or how you in your position can support an organization that works to outright dupe the public with false assertions, false information, or would work to purposely hurt a woman to meet their agenda. To pursue a pregnancy at the cost of the mother's life is not right when you can do something about it. The premise makes women disposable.","commenter_a":"No abortions mean women are not allowed to vote","post_message":"Inspired by the work of the Carolina Pregnancy Center in Spartanburg. We must do more to foster a culture of life."},{"comment_id":"460205810854230","commenter_b":"The law should be to only give welfare to an American citizen. Then, take the American abusers off of welfare.","commenter_a":"But not as much as those in government office positions of welfare.","post_message":"The average immigrant household consumes 33% more in cash welfare, 57% more in food assistance, and 44% more in Medicaid, according to a new study by The Center for Immigration Studies."},{"comment_id":"998513920215363","commenter_b":"girl needs to sit down","commenter_a":"LOL @username","post_message":"Yeah, Um....No."},{"comment_id":"10154351539851336","commenter_b":"The fact that this women he raped was not aware of what was going to happen to her! makes him a horrible rapist!! even if she was drunk!! the same thing happens when a doctor rapes a women after they been under anesthesia and an adult raping a child is just as bad!! this young adult knew what he was doing, and now practically gets a pat on the back! by his ather and the Judge!! telling him yeah it's okay, you did nothing wrong let's just give you 6 months in jail so that we can get the media and people off our backs!! high five son!! you got my back and I got yours!! how disgusting and bad education coming from his parent!! this world is small and one day he will have a kids one day of his own, he better pray that your babies never ever ...","commenter_a":"I haven't looked at this in detail. No one should have an opinion about this until you look into it yourself. I don't go by what the media says, neither should anyone. Judge not less ye be judged. So if you haven't looked at this in detail, yourself, you can't possibly know the truth.","post_message":"Pastor John Pavlovitz wrote a powerful open letter to the Stanford University rapist's father, who said his son was paying \"a steep price...for 20 minutes of action.\""}]
