[{"comment_id":"1038927489460337","commenter_b":"As for your statement about businesses being free to do what they want, I very respectfully suggest that you read some civil rights history. Businesses used to post signs such as \"Help Wanted--Irish Need Not Apply\" or of course Jim Crow laws. Would you seriously be okay with the return of Jim Crow? Businesses have discriminated in horribly blatant ways. Up until just a few years ago women weren't allowed to be members of all sorts of organizations even though there was nothing about the organization that was impossible for women (they were mostly golf and country clubs). We've had 50 years of the Civil Rights Act which people seem happy to toss out the window. If that were to happen, you yourself could easily be discriminated against with no recourse. Please read some civil rights history and see what incredibly horrible things were said and done to decent, hard-working ...","commenter_a":"I thought a private business owner reserved the right to refuse service to anyone for any reason. We have a sign up at work that says exactly that. I may think his is a dumb reason (even though to him it is not), but he is a private business owner operating on private property and should have the right to do business with whomever he wishes, and not do business with whomever he doesn't wish to do business with. That being said, I wonder what he'd say if he tried to go into a diner for lunch and saw a sign that said \"No Christians allowed.\"","post_message":"A Florida gun supply owner says his store is now a “Muslim-free zone” -- after the deadly shooting in Tennessee. Here's what an American-Islamic group had to say in response: kiro.tv/GunStore What do you think of the owner's actions?"},{"comment_id":"10153529907489087","commenter_b":"Anybody is more trustworthy than Hillary","commenter_a":"Bernie is the only one to stand up to corruption, and is honest. Hillary changes her opinion like the wind to appeal to voters, she is bought and sold. Nothing she says is genuine.","post_message":"Bernie Sanders is still seen as the more trustworthy candidate, according to a new poll, with an overwhelming 75 percent of respondents agreeing he is “honest and trustworthy.”"},{"comment_id":"620543131446096","commenter_b":"She's a LIAR!!!!!","commenter_a":"So, she's going to declare bankruptcy and drop out of the presidential race???","post_message":"Wow. I don't think she thought this one through... Do you think a Hillary Clinton presidency would be terrible for America?"},{"comment_id":"10153152736641955","commenter_b":"Who was her IASO? Who was responsible for patching and maintenance? Who setup the firewalls and data encryption? Put this bitch in jail!!","commenter_a":"U can still, get it back.","post_message":"HILLARY 'WIPED HER SERVER CLEAN'"},{"comment_id":"10152609562277452","commenter_b":"Can you believe woman these days","commenter_a":"Wtf Hurray for this man.. bless his heart, and for a better woman to come to them..","post_message":"After a father refused to give up his newborn son, who was born with Down syndrome, the mother left both of them. abc7.la/1DEs3a0"},{"comment_id":"1779050492377737","commenter_b":"She can suck a large hot dog my dog is smarter than her","commenter_a":"He can sue her and make her prove it.","post_message":"Star Wars actress Carrie Fisher speculated Sunday night that Donald Trump’s occasional sniffling during the second presidential debate stems from the fact that he is “absolutely” a cocaine user..."},{"comment_id":"10153457138529342","commenter_b":"With clothing like this... Close the borders!","commenter_a":"Ya'll do know that \"Mexican\" isn't a race, it's a nationality...","post_message":"Have you seen Jonathan Figueroa? He's believed to be driving a maroon Ford Taurus. He's a person of interest after a mother and child were found dead in a southeast Houston home. #abc13 FULL STORY---> @webpagelink"}]
