[{"comment_id":"10154136814559411","commenter_b":"'@username how is Rupert Murdoch theses days in sunny oz.","commenter_a":"Valdimir Putin will be proud!!! But this this newspaper is tied to a very sinister movement. Not all papers crytical of the government are shut down.","post_message":"Turkish authorities took control of Zaman last Friday, sales drop from 650,000 to 6,000 a day"},{"comment_id":"10153009843726378","commenter_b":"A female can't be a predator","commenter_a":"So if a forty year old woman had sex with your sons you'd cheer him on and joke? What about a forty year old man that had sex with your 15 year old daughter? Because according to these comments no one cares about female predators.","post_message":"GUILTY PLEA: A former Baltimore Ravens cheerleader pleads guilty to raping a 15-year-old boy."},{"comment_id":"10153187072706107","commenter_b":"How about a constitution change that says if both of your parents are illegal then you're illegal even if you're born here. No more anchor babies. No dream act, no in state tuition, nothing. The illegals are a slap in the face to the people who are legally trying to immigrate.","commenter_a":"Good Paul!","post_message":"Just minutes ago, on Fox News' On the Record, I announced I will introduce legislation this week to cut off ALL federal taxpayer funding for so-called 'sanctuary cities' -- until they start abiding by federal law.  For taking this stand, I know I'm going to be attacked like never before.  But I think it's high time someone did something!  The truth is, for years politicians in BOTH parties have promised you and me secure borders.  But all we have to show for those promises is sheer lawlessness.  This President has time and again sought to go around Congress with illegal and unconstitutional executive actions regarding immigration.  And now many American cities are following in lockstep in open defiance of federal law!  These so-called 'sanctuary cities' prohibit the use of funds to enforce federal immigration law, usually banning officers from even asking about a person's immigration status.  These cities become magnets for illegal immigrant criminals and gang members who have been deported multiple times, but know they're safe if they can just stay within a city's borders.  This can't be allowed to stand.  Not when we know terrorist organizations are looking at our porous southern border as a way to gain entry into the United States.  Not if we are to save the concept of rule by law.  My bill would end all federal taxpayer funding for these cities until they start ENFORCING federal immigration law.  I know these cities will shriek and moan that there shouldn't be any strings attached to all of your tax dollars.   They'll say they're entitled to pick and choose what laws they recognize.  And you can bet our national media will be on their side, and come after me with everything they have.  But it's time politicians cared more about keeping their promises to the American people than what our national media says.  If you agree, I need to hear from you right away.  Please sign your 'Enforce Immigration Law' petition and agree to your most generous contribution of $20.16 IMMEDIATELY: @webpagelink"},{"comment_id":"10153567910251130","commenter_b":"I think you're Ricky Gervais pretending to be a guy a named @username! (Please do not take that as an insult! You look like an incredibly fun dude)","commenter_a":"Kid admiring hard working men before society pollutes his brain with the sad gift of being judgemental. Future empath right there. Well done son.","post_message":"Starstruck!"},{"comment_id":"739998596133321","commenter_b":"Jesus Christ the arguments against guns here are fucking stupid. To fellow pro 2a people, don't play into their hands like this. Look. Let's pretend you were right. That the good guy with a gun scenario doesn't really deter anything. fine. Let's pretend you are right. That having guns so that people can defend themselves against tyranny isn't going to do anything. Fine. Let's pretend that we can depend on our government officials to protect us against foreign invaders 100 percent of the time without fail. Fine. Let's also pretend that you get all the gun control laws you want passed. Done. Now let's pretend that so far a vast majority of the recent shootings weren't perpetrated by individuals who up until the shooting had little to no signs of deteriorating mental health and zero criminal history. Let's also pretend that those same individuals did not purchase their firearms LEGALLY ...","commenter_a":"Liberal code. NEVER TAKE RESPONSIBILITY!!! Blame blame blame","post_message":"I know he's a grieving father but this is so WRONG."},{"comment_id":"434085210113797","commenter_b":"You've gotta love all the women on here tooting their own horns, huh? lol","commenter_a":"My kids aren't teens quite yet (11 and 6 year old).. But people always thing thy're my brothers... They're in shock when I tell them I've been married for 12 years and my actual age LOL","post_message":"Mom genes.  Which of these women gave birth to the other two?"},{"comment_id":"10152701811618067","commenter_b":"What about Asians! We have more wealth than whites! ;)","commenter_a":"CNN thought process: Pot? Check. Ladle? Check. Add racial mixture. Add perceived racial sleight. Stir vigorously. Serve on CNN Special, '[fill in gap] in America'","post_message":"The latest report about financial inequality makes for uncomfortable reading... @webpagelink"}]
