[{"comment_id":"1097693670320210","commenter_b":"Triple gross, have their hair all over my sheets, NO WAY!!!!","commenter_a":"Gross","post_message":"One New York couple has successfully acquired a bed large enough so that they and all 8 of their rescue pups can sleep comfortably. 'They love to just be near us. So however we can make that happen, they're happy.'"},{"comment_id":"10153190819521602","commenter_b":"Telling you..bitches love it!!","commenter_a":"Personally i think they should have beat her like Rodney King. Broads really like that!","post_message":"The officer was placed on desk duty after video images showed him taking a 15-year-old girl to the ground during an arrest at a St. Patrick's Day parade."},{"comment_id":"10158609012850725","commenter_b":"What an ignorant old hag smfh","commenter_a":"Time to round up all the black scum and jail them all. If found having done a crime they get death. The faster we get rid if those in jail too by death the better it is. They all are scum and should all be destroyed.","post_message":"A suspect has been charged with the murder of Karina Vetrano, whose gruesome death shocked the community and set off a six month search for her killer."},{"comment_id":"1047246341998727","commenter_b":"Illegals should have NO rights in voting, wokring or anything here....PERIOD.","commenter_a":"You gotta get all the brainless and illegals to stop voting democrats, its the democrats that arm criminals but prevent legal law abiding people to legaly arm themselves","post_message":"Hillary and Bernie want taxpayers to cover healthcare for illegal aliens. What do you think?"},{"comment_id":"10153019122102060","commenter_b":"So full of it. There are other Drs who can xray women.","commenter_a":"Because god knows in a state as poor as Louisiana, keeping women from accessing basic reproductive care is a GREAT idea. That won't have any long term consequences. Heckuva job, Bobby.","post_message":"Gov. Bobby Jindal's office has announced Louisiana is terminating its Medicaid provider contract with Planned Parenthood."},{"comment_id":"10153724329286336","commenter_b":"How about all countries fight isis and then the refugees CAN STAY HOME !","commenter_a":"The last time Russia was in the battle with the Muslim''''''''''''''''s they lost. They run back home and was broke after a decade. I say let them do it again while we rebuild our defense up again.","post_message":"'If he wants to fight ISIS, let him fight ISIS – why do we always have to do everything?'  Donald J. Trump told Bill O'Reilly that the U.S. has invested trillions of dollars and thousands of American lives in the Middle East, and he thinks it’s great that Vladimir Putin wants to take over what America has started. @webpagelink"},{"comment_id":"1709641872647327","commenter_b":"I cannot believe what is happening in this country. From this moment forward, when my wife or daughters-in-law or granddaughters are in the women's room of any public facility, I will guard the door, and woe to the man who tries to enter while they are in there. There will be blood!","commenter_a":"We are full of IDIOTS in America !","post_message":"'There isn any doubt that this law was designed to be DISCRIMINATORY ...'"}]
