[{"comment_id":"10153831550149474","commenter_b":"I don't believe my dog trust Hillary","commenter_a":"I remember she slapped her husband's face at the White House. Lol.","post_message":"Simple. Share if you agree."},{"comment_id":"10153060673305329","commenter_b":"Sharon Needles bitch!","commenter_a":"Oh my gosh @username and Tavian Broderick you got to take this shit- i got Bianca","post_message":"Good luck, and DON'T f**k it up."},{"comment_id":"1324340430958054","commenter_b":"God will certainly Judge the U.S. for how this country decides to judge and treat people from other countries.","commenter_a":"It's not a forever ban. This is to send a message that we will not let the slightest possibly of another attack. And that if this is the only way then we will do it. We do not hate Muslims. We hate murders.","post_message":"SOUND OFF: President Trump has made a lot of changes this week, and his most recent executive order dealt with immigration. What do you think about his new policies?"},{"comment_id":"959924910733924","commenter_b":"Nonsense don't believe the Hype. why don't you start a campaign to get rid of us Scots? You will be doing us a favour. For the record were not antiEnglish were antiWestminster","commenter_a":"All paid for by us Nice English people No wonder they voted against independent They would be mugs to leave their gravy train","post_message":"How Scotland got RICHER during austerity thanks to English taxpayers"},{"comment_id":"10152925277511336","commenter_b":"Let it go, let it go!","commenter_a":"WELL YOU FORGOT TO MENTION THE SNOW THAT WE HAD IN wc/PA.","post_message":"JUST IN: Travel bans in New York and New Jersey have been lifted. Blizzard predictions that kept millions of people home are now being downgraded. @webpagelink Time-lapse video taken Tuesday morning shows a deserted Times Square:"},{"comment_id":"10154522869261051","commenter_b":"The only thing Melania will do as first lady is give free head and hand jobs","commenter_a":"He can't handle being President is a joke just like his supporters he is being a reality show president","post_message":"This is not what Donald Trump wanted to hear today."},{"comment_id":"1157609597663965","commenter_b":"Go Grab your mother's Pussy","commenter_a":"Dumb a$$ people - looking to start a war here on our home land - won't be happy until they do - hope they are truly ready for it - and hope they know what that will really mean.","post_message":"BREAKING: A massive protest of President-Elect Donald Trump is happening in downtown Chicago. It started outside the Trump Tower and is growing @webpagelink"}]
