[{"comment_id":"10152882647786234","commenter_b":"Hypocrite. ^^^ She let 4 Americans die. You dummy.","commenter_a":"Christie goin down. I always said he would.","post_message":"David Wildstein admitted to conspiring with others to \"punish\" the Fort Lee mayor for not endorsing Governor Chris Christie in his re-election bid."},{"comment_id":"890066024388849","commenter_b":"Our own government is gonna put us in a civil war to survive all this mess.....SOMEBODIES GOT to be making dirty money off all this illegal stuff going on....unbelievable","commenter_a":"Send all of them packing NOW.","post_message":"ILLEGAL TSUNAMI 2.0: 12,509 Illegal Kids Already Over Border In New Wave (VIDEO)  The next explosion of illegal teen border crossing is in full swing, but just one-in-six are being sent home, with most of the rest settled in the United States,...  @webpagelink"},{"comment_id":"894715537301698","commenter_b":"The best thing you are doing, Mr. Trump, is weeding the un-Americans out from our society. You are already making the change for America being great.","commenter_a":"@username how was your preteen sexparty with you friend Epstein. It sound s you got a problem dude. Defloration of a 12 year old girl is not ok, if you know what I mean","post_message":"The \"protesters\" in California were thugs and criminals. Many are professionals. They should be dealt with strongly by law enforcement!"},{"comment_id":"584420751713216","commenter_b":"STOP muslim immigration permanently !","commenter_a":"Yes!!!! And not just muslins!!!!","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"},{"comment_id":"10155458466225354","commenter_b":"Just a bunch of average women.","commenter_a":"I still cannot wrap my head around the positive reinforcement people give instead of being honest and constructive. Don't take her to dinner, take her to the gym.","post_message":"\"They’re no angels—and they own it\""},{"comment_id":"1382362188508980","commenter_b":"You ass dont belong on a road unless it has wheels on it who raised these nuts?","commenter_a":"Yes","post_message":"Liberal protesters are furious after a new bill introduced by a state lawmaker... here's why this could cause a lot more \"accidents\" when these lefties block highways.  Do you support this bill?"},{"comment_id":"1074056242615386","commenter_b":"Because people destroy their habitat and poach them for money.","commenter_a":"Wild animals shouldn't be kept captive! They should be in the wild if people want to see them why don't they go to there homelands instead of leaving them kept in cages!","post_message":"This gorgeous little jaguar cub made his public debut this week at the San Diego Zoo."}]
