[{"comment_id":"10152734015363525","commenter_b":"going to get cold tonight!!","commenter_a":"Wtf...???","post_message":"Road trip to Lakewood Ranch. Who's in?"},{"comment_id":"604709916395876","commenter_b":"Is it all the bleach that makes Trump women stupid? They should do a study...","commenter_a":"This speech is ridiculous he's supposed to be a leader he's dividing people thinking he has power I'm embarrassed to say he thinks he represents all of us","post_message":"\"We are going to be the first state in the country to fight back on Washington.\" Boston Mayor Marty Walsh gave impassioned remarks at the rally ahead of the Boston Women's March for America.  @webpagelink"},{"comment_id":"527181674109539","commenter_b":"Illegal immigration","commenter_a":"I wanna kick all of them out.. 100% every single one out. .","post_message":"A Pew Poll shows that 83% of the public believes the annual baseline level of legal immigration (1 million per year) should either be frozen or reduced."},{"comment_id":"10152826928132061","commenter_b":"Happy Mother's day!!!! Smart women.","commenter_a":"I'm so glad that the person taking the order was ALERT!","post_message":"Woman held hostage with her children alerts police of hostage situation through Pizza Hut app. abcn.ws/1F5PzSV"},{"comment_id":"10153765437796336","commenter_b":"Then stop bringing in hundreds of thousands of illegals, then bring the jobs back to America.","commenter_a":"I agree, put people back to work and stop giving them freebees from the Government. Make them responsible for their own lives.","post_message":"Billionaire Charles Koch joined \"The Kelly File\" tonight for a rare interview, and said progress will depend on the American people understanding what is fair and what makes their lives better."},{"comment_id":"10153279901571955","commenter_b":"Good! You made that bed now sleep in it scumbags!","commenter_a":"Excellent! Expose the darkness, Lord of Light.","post_message":"Hacked Adult FriendFinder database reveals extramarital affairs of millions"},{"comment_id":"1385476598133803","commenter_b":"@username Total dumb ass","commenter_a":"I say that's bullshit, race problem was minimal until we got this racist Muslim traitor idiot in the white house, Obama administration and his friends are the problem with this country now.","post_message":"The majority of Americans say there's still widespread racism against African-Americans in our country. Do you agree or disagree?"}]
