[{"comment_id":"10157152156085354","commenter_b":"BUILD THAT WALL!!!","commenter_a":"I hope he is the first to meet with them. He will only make the news one more time.","post_message":"WOW"},{"comment_id":"10153950458738690","commenter_b":"Actually another problem is that we have a long border with Afghanistan which is called Durand Line and Afghanistan does not accept it as an International Border and those terrorists move in between both countries and attack and then we blame to each others.","commenter_a":"This the same Pakistan my country Nigeria, training army to fight terrorism, have Pakistan already solved there Taliban terrorist? Terrorist are political party, negotiations is the solution to terrorism.","post_message":"At least 12 dead as suicide bomber on a motorbike crashes into government office."},{"comment_id":"1696699610390161","commenter_b":"She deserves prison put her there please then we won't have to see that disgusting face of hers","commenter_a":"Total investigation","post_message":"Does she deserve to go to PRISON for breaking the law?"},{"comment_id":"10153959517171337","commenter_b":"\"Drink the kool-aid.. Sheep.. Libtard... Scandals...\" Meanwhile, there's Trump. All of those things wrapped into on ball of hair. HA HA HA!!","commenter_a":"Haha that bitch will do anything for votes. She's trying to win the young/urban vote lol tomorrow she'll be in overalls with a straw in here teeth talking to some farmers. Line up kids, get your blow job from Hillary !!!","post_message":"R.I.P Dabbing  @webpagelink   (2015-2016)"},{"comment_id":"1197370603617282","commenter_b":"Larissa Elliot","commenter_a":"Amy Batchelor","post_message":"An attempt to reproduce 100 psychology studies published in leading journals couldn't match the results in almost two thirds of cases."},{"comment_id":"1151019624929597","commenter_b":"Krissy L Gucciardo Nice mouth. Do you eat with that filthy mouth.","commenter_a":"I actually had a friend say she never sees him with his hand over his heart during the Pledge of Allegiance. I then supplied her with about 25 pics of different events, all with his hand over his heart. I told her google is her friend, and Fox news is not.","post_message":"\"What EXACTLY has Obama ruined in this country?!?!\"  Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"947076032050956","commenter_b":"I agree @username. Just like the woman said about the women that doesn't help other women. Hillary thought that was cute.","commenter_a":"We need to come together against the Republican Establishment to deny Trump and Cruz of the nomination. Their strategy is despicable but simple, keep either candidate from garnering enough delegates and have a contested convention where they will steal the nomination from both men. We Trump and Cruz supporters are wanting an outsider to try to fix the corruption in the political parties and our government. We need to come together to deny the Establishment their strategy. In the meantime, have faith in both of our candidates....Trump and Cruz are both very smart men and understand exactly what the Establishmen plan is. I have hopes that within two to three weeks they will work out an agreement among themselves to make a clear pathway to victory for one of them...to help them do this we need to come together as conservatives who are sick and tired of the corruption and ...","post_message":"Shannon Bream here live from Detroit on the Fox News Facebook page! Hit 'subscribe' in the top right corner to make sure you catch all of our live videos. We'll talk to the moderators during tonight's #GOPDebate and you won't want to miss that!"}]
