[{"comment_id":"785950868181654","commenter_b":"Fuck you white Bitch! !","commenter_a":"DEMOCRATIC VOTERS ARE JUST FREE LOADERS...","post_message":"Don't worry John Travolta, we're also confunsed about what these people are doing!"},{"comment_id":"10152700014751167","commenter_b":"Also there, Christians killing Hindus .","commenter_a":"And there was that situation in India a few years ago with Buddhists and Hindus killing each other.","post_message":"\"When you take Christianity, Judaism, Hinduism, Buddhism, whatever, their combined killings in the name of religion -- well, that would be zero.” #FoxNewsFacts"},{"comment_id":"742612555896157","commenter_b":"We need women unless you enjoy cocks in your ass","commenter_a":"FINALLY WE CAN GET RID OF THE PLAGUE CALLED WOMEN","post_message":"The infants were carried to full term, and seem to have no health problems."},{"comment_id":"10155347376155389","commenter_b":"She certainly is a cow!","commenter_a":"I would vote for a dead cow before id vote for her. Oh I forgot she is one.","post_message":"It's your turn to answer Sean's Question of the Day! Will the growing list of scandals hurt Hillary Clinton if she runs for president?"},{"comment_id":"1777641695853675","commenter_b":"Shirley Awalt Tuggle Check this out mama!","commenter_a":"Sidni Schneider Amber Kerstin Brown","post_message":"She's every inch a queen. Victoria, starring Jenna Coleman, Rufus Sewell, and Tom Hughes, premieres January 15th on MASTERPIECE | PBS. Watch a preview:"},{"comment_id":"10154736430788984","commenter_b":"I think she's loosing her butt and I'm glad!","commenter_a":"So go be a Grandma and get out of the race.","post_message":"It took Hillary Clinton less than 15 words to show her debate strategy in a very clear way. Do you think Donald J. Trump is winning the debate?"},{"comment_id":"418116258312969","commenter_b":"Heaven help us if voter fraud (no picture ID) elects this incompetent lady","commenter_a":"Zero chance","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"}]
