[{"comment_id":"966205513390919","commenter_b":"Ms Quintana what a selfish, entitled attitude you have. Who is going to pay to train the temp, who is going to have to take on the extra duty of getting them up to speed, and who is going to pick up the slack while they get adjusted? Someone has to make up for that lost productivity. So the woman makes a decision to have a baby, and everyone around her pays for that decision. How is that fair? And not only that, but she expects to waltz back in a year later like nothing happened! She will most likely have to be retrained, creating yet another burden on top of kicking out the person who has done her job for the past year. Why should that temp have to step aside because queen mommy came back? Shouldn't that be HER job now? Why should she have to step aside ...","commenter_a":"How very 'pro-life' of them ;). It's no wonder some women need abortions, if you can lose your job or be forced to go on unpaid leave while pregnant, and there's no maternity leave after you have your child... having a child can seriously cause you financial distress to the point of ruin! States need to pick one or the other! You can't be pro-life if you're not going to support a woman who has a child at all.","post_message":"'I loved my job. I was really hurt.”"},{"comment_id":"1422900164405547","commenter_b":"My integrity will not allow such a travesty. She is a war monger.","commenter_a":"We can't , CANNOT, be punitive at this time in history and not vote for Clinton. I KNOW Bernie would have been a WAY better President, but I will hold my nose and vote for Clinton.","post_message":"I don't know if it's a world record but Donald Trump has been sued more than 3,500 times over the past 30 years. This isn't someone who should be president."},{"comment_id":"10154697358601037","commenter_b":"Where's Hitlery?-Oh Yea, Taking ANOTHER Sick Day Because Yesterday She Had 300 Supporters Show Up To One Of Her Rallies While President Trump Was Speaking To 3 THOUSAND Of His Supporters.....#Laughable #HitleryIsToast #RepublicansWinning","commenter_a":"In business you make profits If you don't. Then you not in Business.","post_message":"“Can you imagine Ronald Reagan ... saying, ‘It’s good business to take advantage of people’s misery’? Rooting for that misery?” — Joe Biden on Donald J. Trump"},{"comment_id":"10153257299639071","commenter_b":"'@username another Hilidiot who will blindly vote for a woman for no other reason than wanting a female president.","commenter_a":"Let's be honest about this. The only reason they gave back access is because a court battle over this would have revealed to the public that every democratic campaign had access to those records, and when the Sanders campaign reported it, nothing was done. Which would have highlighted not only the DNC favoritism of Clinton, but of the fact that they have been working to shut down Bernie at every turn. Which would have meant public acknowledgement of Bernie actually having a chance to win.","post_message":"Bernie Sanders sued, and the Democratic National Committee backed off, but it's not over yet."},{"comment_id":"588768351310241","commenter_b":"Put her in Jail !! I didn't ok that she can walk","commenter_a":"This is all Barry!","post_message":"Judicial Watch President Tom Fitton is LIVE discussing major court developments in our Clinton email case and Obama travel uses.  Tune in for the Weekly Update below."},{"comment_id":"10153902236123812","commenter_b":"The native Americans should have stopped accepting immigrants. They wouldn't have lost millions of life's by those terrorist immigrants!!!","commenter_a":"ISIS doesn't need to be in America. Has everyone forgotten about the mass shootings that happen almost every day now? They can easily recruit here and never step foot on American soil. Blind hatred is still hatred.","post_message":"LATEST: Mississippi joins Ohio, Florida, Illinois, Indiana, Louisiana, Arkansas, Michigan, Alabama and Texas in refusing to accept Syrian refugees in wake of #ParisAttacks."},{"comment_id":"979819422085921","commenter_b":"'@username don't curse Canada with the likes of people like her. Send them to mexico!","commenter_a":"Just because a person is an actor/actress does not mean they know their head from their a$$ ... proof right there in that statement","post_message":"Americas Freedom Fighters"}]
