[{"comment_id":"519371271599548","commenter_b":"He did not mention deporting a large number of illegals, he did not mention anything about building walls, that's why he failed to stop the influx of illegal immigrants that we have now. Nothing is impossible, if we want to do it. If we can dig tunnels below, we can build walls above.","commenter_a":"It doesn't sound like trump at all. That's most probably what trump should have said. Everything bill Clinton said has been implemented. He doesn't mention deporting 12 million people (impossible to execute), he doesn't mention building a wall (idiotic and impossible to execute)... So no, doesn't sound like trump at all. This sounds like someone that actually has a executable plan, unlike trump. Not to mention calling a whole nation rapists, murders and drug dealers.","post_message":"Do you think this sounds a lot like Donald J. Trump?   MORE: @webpagelink"},{"comment_id":"484066138450614","commenter_b":"'@username any woman who needs a leader is not going to be the best wife.","commenter_a":"If that was my husband, he'd know his place, and it wouldn't be in my house. More like on the pavement.","post_message":"Kirk Cameron:  'Wives shouldn't tell their husband how he ought to be a better husband'"},{"comment_id":"1521164361521907","commenter_b":"11, MILLION illegal immigrants, @username. I won't write it out, you might have trouble counting the zeros. That would cost the US 4+ BILLION dollars, but hey- you might not realize how much money that is. Once the current illegals are removed from the work force, it would cost 1.4 TRILLION dollars and the likes of a recession no one in our lifetime has ever seen, but in the meantime, you rock on with your idiot self.","commenter_a":"Good fella for calling his royal Ass out on such ridiculousness.","post_message":"Kudos to the NBC reporter for calling Trump out to his face. Earlier today, Trump said he wouldn't rule out creating a national registry of Muslims, or giving them special IDs. That's NOT the American way. Spread his shame.  Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"473948236146716","commenter_b":"Go die old bitch","commenter_a":"lost all respect for superbowl....half times and commercials...all just the liberal agenda PU not worth staying up to watch...won't bother with any of the sports hype next yr.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"562653790568588","commenter_b":"That's bad...right :-) Bernie is a moron, a pandering moron.","commenter_a":"idiots topped with lie pudding","post_message":"No, this wasn't Saturday Night Live. Bernie Sanders actually said this in a real debate..."},{"comment_id":"10156410898495725","commenter_b":"'@username he does not have to insult Hillary's looks. She does a good job of insulting herself.","commenter_a":"I would love to watch Donald Trump debate Hillary Clinton! He will tear her a new one!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"},{"comment_id":"10153817887769203","commenter_b":"Michelle will body slam Barry!","commenter_a":"Coming from the first female POTUS this is funny. Obummer, you can't handle your own angry wife let alone Putin....get out of the White House you effeminate jackass","post_message":"can handle a bunch of CNBC moderators at the debate. Let me tell you, if you can handle those guys, then I don think the Chinese and the Russians are going to be too worried about you."}]
