[{"comment_id":"10153155614114411","commenter_b":"Circumcision removes most of the nerve endings from the penis - so no, it is not good for intercourse.","commenter_a":"curcumstich is good for the sexual intercorse between man woman. But the preast outbreath and homosex agenda and child melest could make Even God leave the churche..and the girls virganity and boys firs blow job...fuck them. Herpes is an evel sicknes related both to rosesicknes that makes your body ..","post_message":"Via RT America: City health officials said 17 cases of infant herpes since 2000 have been connected to the traditional Orthodox practice of sucking blood from the circumcision wounds of infants penises."},{"comment_id":"990097811101554","commenter_b":"That looks disgusting 😱","commenter_a":"@username BONG","post_message":"Not all heroes wear capes. 🍔+🌭"},{"comment_id":"579405548899257","commenter_b":"@username smart woman","commenter_a":"\"Mr. Trump what would you like for dinner?\" Trump: \"I'm building a wall.\" \"Mr. Trump why don't you like Mexicans?\" Trump: \"I'm building a wall.\" \"Mr. Trump why don't you ever answer questions?\" Trump: \"I'm building a wall.\" \"Mr. Trump tell us something relevant about this presidential race.\" Trump: \"I'm building a wall.\" \"Mr. Trump are you building a wall?\" Trump: \"I'm going to make America great again!\" Well, that pretty much sums up everything this \"man\" has said all along and people will continue following his ignorance. #makeamericahateagain","post_message":"Donald J. Trump insists a judge born in Indiana is Mexican."},{"comment_id":"10154793363900575","commenter_b":"Fucking right a wall","commenter_a":"You have a wall? Why you so upset ?","post_message":"THE WALL JUST GOT 10 FEET TALLER..."},{"comment_id":"10154092643775950","commenter_b":"FUCK OFF RACIST","commenter_a":"who cares, just get out","post_message":"What are Barack Obama's post-presidency plans? \"Take Michelle on vacation. Get some rest. Spend time with my girls and do some writing, do some thinking.\" Watch more from his press conference in Peru: @webpagelink"},{"comment_id":"679238678931090","commenter_b":"I have been drinking Pepsi since 1966! I will NEVER BUY IT AGAIN, not because of what she said , but because TRUMP HAS SAID FROM THE BEGINNING , This country has sold out to foreign countries that hate us AND PEPSI HAS THIS WOMAN IN CHARGE OF AN AMERICAN COMPANY!!","commenter_a":"When will they ever learn.. Boycotts work..","post_message":"INSTANT JUSTICE... Let's get 5,000 SHARES for TRUMP!"},{"comment_id":"10153904097708984","commenter_b":"She's an American. Deportation isn't an option","commenter_a":"DEPORT THIS TRASH","post_message":"She's the biggest female star in Hollywood right now, and she just made a sickening claim about Christians and the cross of Christ.  This is just disgusting.   She has a new movie out. Let's make sure she doesn't make a dime off of us!"}]
