[{"comment_id":"10153209825548445","commenter_b":"Not if you make the tincture right","commenter_a":"Don't make edibles at all. If you want an edible high, just buy/make tincture and eat it with cookies. Or just eat the weed in fillable capsules: 1. Decarboxylate your Dry herb 2. Fill swallable capsules with dry herb 3. swallow capsules with food and drink","post_message":"10 Commandments of #Marijuana Edible Safety"},{"comment_id":"1420023134696147","commenter_b":"She really believes she has the right to treat that man disrespectfully because she disagrees with his views. What is wrong with people? Great job by the airline.","commenter_a":"Need to see more in many other places.","post_message":"WATCH! Anti-Trump Hag Gets Kicked Off Flight After Threatening TRUMP Supporter...Passengers Clap! [Video]"},{"comment_id":"956678911036116","commenter_b":"Trump is right ! All 11 million illegals have to go !","commenter_a":"Trump Chopper in Air Salad toss on a stick taint Fear God Trucker Hat -.......... high-ku Reverend #TrumpTrain #GOPClownCar #iacaucus","post_message":"\"They have to go.\""},{"comment_id":"1756628007939155","commenter_b":"Stop and think!....before you vote for Hillary just to have a female as President...You are hanging yourself for women making it again in the future. Stop and think!","commenter_a":"DUNP THE TRUMP & GUILIANI!","post_message":"MAYOR RUDY GIULIANI STATEMENT ON LATEST CLINTON FOUNDATION DONOR SCANDAL:                           (New York, NY) – Former New York City Mayor and U.S. Attorney Rudy Giuliani today released the following statement on the Associated Press’ analysis revealing that 55 percent of Hillary Clinton’s non-government meetings while at the State Department were Clinton Foundation donors whose contributions totaled at least $156 million:   “From the facts revealed to-date, it is impossible to figure out where the Clinton Foundation ends and the State Department begins. It is now abundantly clear that the Clintons set up a business to profit from public office. They sold access and specific actions by and to them for money. This makes a mockery of her promise to Congress and the President to keep the Clinton Foundation and the Clinton State Department entirely separate. In other words, they merged the two into the Clinton Family racketeering enterprise. The need for a Special Prosecutor to investigate these apparent crimes mounts with every passing day and the revelation of new sets of e-mails and phone logs. I’m sure all we’ve seen is the tip of the iceberg and there will be more to follow.” -Rudy Giuliani"},{"comment_id":"10152877245671051","commenter_b":"The woman with the prosthetic leg should be able to get a first floor apartment as soon as one is available, and the other person should be evicted.","commenter_a":"Boy there are some sick people out there! I would evict her!","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"10153222485020329","commenter_b":"George Bush","commenter_a":"How come the penis got a fun name but not the vagina???? You're all Sexist Pistols.","post_message":"Urethra Franklin FTW. (A BuzzFeed BFF original.)"},{"comment_id":"10157822759390389","commenter_b":"She is a joke","commenter_a":"Evil woman","post_message":""}]
