[{"comment_id":"10153362031969087","commenter_b":"BAN ISLAM! BAN MUSLIMS! CLOSE THE MOSQUES NOW!!!","commenter_a":"I see we owe the NRA and Republican a big thank you for allowing another mass shooting DROP DEAD YOU MOTHER FUCKERS","post_message":"\"Upwards of 14\" people are dead and \"upwards of 14\" people are injured after \"up to three people\" opened fire at a holiday party inside the Inland Regional Center building in #SanBernardino, California. WATCH LIVE:"},{"comment_id":"10154350184251336","commenter_b":"She won the nomination because of Super delegates like Nancy Pelosi. Should have done in on pledged delegates only. The AP announcing her win the day before the final primaries didn't help, but that was her plan all along. How many Sanders supporters stayed home and didn't vote because of that well planned news flash. This woman will do ANYTHING to get her way. God help us all if this Country elects her as President.","commenter_a":"Killary is done and she knows it!!!","post_message":"“The stakes in this election are high, and the choice is clear. Donald J. Trump is temperamentally unfit to be president and commander-in-chief.”  Hillary Clinton took shots at Trump during her victory speech after clinching the Democratic nomination."},{"comment_id":"948144815307058","commenter_b":"@username I appreciate that... However even though the question was asked by one person and he answered her directly .. He did that in front of an audience... As a parent I get what he's trying to say... But as a woman it makes me angry .. The boys that are being raised need to be taught that when a girl is too drunk to give consent it can be considered rape - I say can because not every girl that has drunk sex is going to consider it rape - but some may - plus it's incredibly unrealistic to tell a college girl to stay away from a party with alcohol... U may as well send her to a convent ..","commenter_a":"This advice isn't blaming the victim. Advising someone to lock their doors at night is not preemptively blaming the home owner for a robbery. Should we live in a world where girls can go to drunken college parties and not worry about being sexually assaulted or raped? Absolutely. Is that the world we live in? No.","post_message":"John Kasich to student concerned about sexual violence: \"Don’t go to parties where there’s a lot of alcohol.\""},{"comment_id":"10154302631811234","commenter_b":"Wife ?.. haha I hope a woman or anybody would be smart enough to let u suffer in your own hate alone ... jump off","commenter_a":"There's plenty of jobs in colorodo also I haven't seen under $12 jobs even fast food starts at 10$ .. this one place said they would pay me $15 n up to start .. a pizza place .. but I have a degree .. I just like cooking but ever I need I kno where to go ..","post_message":"These employers left and took their jobs with them."},{"comment_id":"495634957263126","commenter_b":"u get the fuck away from us first we will leave ur shit","commenter_a":"Muzzies. This is why these scum don't belong in the West, they refuse to assimilate.","post_message":"\"We've kind of been forced back to the primitive ways of schooling.\""},{"comment_id":"10153035169591051","commenter_b":"Execute her how could she","commenter_a":"They are raising a bunch of animals!","post_message":"This 14-year-old killed a 2-month-old because she didn't want her mother to adopt the baby girl."},{"comment_id":"1777765929177182","commenter_b":"Hillary Clinton is pure evil! Most vile, lieing, thieving, corrupt witch on the planet!","commenter_a":"She lied and lied and has lied about her lies, all the while breaking the law, and half America still thinks she should be president. I would as soon a bank robber or one who had commited treason be president. Her lawbreaking and lying has been such a lifestyle for so long I can't imagine her being president no matter what skunk is running against her.","post_message":"An iconic photograph of Hillary Clinton using her BlackBerry while wearing sunglasses on a military plane prompted an official in her office to inquire about whether Clinton had been assigned a government email address...  The information came out in sworn testimony in a Judicial Watch deposition of Karin Lang, a former State Department official. Please SHARE!"}]
