[{"comment_id":"10153715209333984","commenter_b":"Build a wall and send them home.","commenter_a":"You know illegal Mexicans come in this country illegally the women wait till about a month before delivering their child snake in this country have their child hoping to get birth rights I think if you come in this country out of another country if you have a child here your child is from your country not mine god bless the United States and we're going to try to keep it that way","post_message":"These Texas counties are doing something that has earned them a warning from Mexico, but it doesn't look like they're letting that stop them!  Do you support what these counties are doing?"},{"comment_id":"10153109185578812","commenter_b":"I hope people know the women in Iowa aren't all like her.","commenter_a":"I'm from Iowa. So embarrassing!","post_message":"The Republican Response to #SOTU2015: Who is Joni Ernst?"},{"comment_id":"10154362944566880","commenter_b":"Leonardo Gai","commenter_a":"Vasilis Sotiriou","post_message":"$39 billion and rising."},{"comment_id":"1803336319885605","commenter_b":"@username \"She can watch the oath from a cell like she deserves\" Proof or you're a dirty liar.","commenter_a":"I borrowed these words from Daniel Greenfield who wrote them a few months ago in Front Page Magazine: Clinton has spent a third of her adult life trying to become president. are hoping that Hillary will go to jail. But the anger, frustration and bitterness that will gnaw on her after wasting decades and a small fortune on two failed efforts to win the White House in which she had every advantage only to lose before even leaving the starting gate will be worse than any prison. January 2017, Hillary Clinton will be sitting in front of a television set watching someone else take the oath of office. Nothing the penal system has to offer would be a harsher punishment than that moment.","post_message":"Six of the biggest takeaways from the FBI's investigation."},{"comment_id":"10153387915812756","commenter_b":"I guess there's no zoning regulations ?","commenter_a":"Sad","post_message":"We learned on Monday that it was not the first time the owners of a home in Carbon County had animals removed from their property."},{"comment_id":"10154357824606037","commenter_b":"Trump doesnt want muslims in the US..period..so","commenter_a":"Trump... ISIS...Today","post_message":"A man armed with guns and explosives told police he was in the area for West Hollywood's gay pride parade."},{"comment_id":"1593183134313238","commenter_b":"Lol, not true bitchhhhh.","commenter_a":"Jensen Beale","post_message":"\"5 minutes\" "}]
