[{"comment_id":"422148361459748","commenter_b":"Disgusting 😡 Hope they lose their seats next election! #CrookedBastards","commenter_a":"Continued disappointment!","post_message":"Republicans just sold our public schools to the highest bidder.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153088404166770","commenter_b":"Yeah really. She's more worried about herself than anyone. More lies from Billary!!!!","commenter_a":"They only lose sleep about how to deal with Clinton when she is elected President!!!","post_message":"'I would imagine that I’ve thought about what happened more than all of you put together. I’ve lost more sleep than all of you put together. I have been wracking my brain about what more could have been done or what should have been done.'"},{"comment_id":"10153349534435667","commenter_b":"Nice rack, Mary","commenter_a":"Bengazi butcher leading the uneducated I assume because a smart common sense person would never vote for her.","post_message":"'We're not taking anyone, and we're not taking anything, for granted.'"},{"comment_id":"1006387419398598","commenter_b":"Go away upchuckie!","commenter_a":"Where do these NUTS come from? Is there some unknown idiot tree orchard somewhere in the U.S.?","post_message":"'Schumer’s proposed anti-gun plan takes government “overreaching” to a whole new level.'  Blaze contributor Susan Calloway Knowles:"},{"comment_id":"10154491854776002","commenter_b":"Yeah, she's a great mother!?!? Ha. Get those poor kids away from her immediately; lock her away with the scum husband.","commenter_a":"Seriously-not only her but her husband has committed the same crime-hurting thousands of others-stealing money from the government and she wants a break?!!!!!!","post_message":"Washington is asking the judge for a massive break. The judge ordered her to serve four years in prison, but she is asking not to go to turn herself in for five years so she can stay home with the kids while their father serves his time for the same crime."},{"comment_id":"772068809592966","commenter_b":"the woman is not nearly as smart as a bucket of horse manure but is as pretty as one.","commenter_a":"Cher is still alive? ??","post_message":"As always.....leave it to Cruz to craft the most perfect response. ;)"},{"comment_id":"10153585954722994","commenter_b":"White people are the terrorist.....not Muslims","commenter_a":".","post_message":"After last week's attack in Tennessee, this man showed up at a military recruitment center with his AR-15 - but preventing another attack isn't why he did it."}]
