[{"comment_id":"949029821890932","commenter_b":"@username Before you vote for Clinton remember this. a vote for her is vote for a another kilo of heroin across an open border polluting Americans and contributing to more crime.","commenter_a":"If you are privileged enough so that a Trump presidency doesn't matter to you, vote against him for the many people he will take advantage of if he wins.","post_message":"Most Americans, regardless of their political views, do not want to see us go backwards, and are not going to be supporting a candidate for president who has made bigotry the cornerstone of his campaign."},{"comment_id":"659276420929603","commenter_b":"I guess she could go back to Africa Ebola does that ring a bell","commenter_a":"Dam she's got lips like monkey boy.I bet she could suck the crome off a trailer hitch.","post_message":"This entitled woman just demanded a free drink... Because of slavery? This is absolutely ridiculous. We owe her nothing. Should she be compensated for slavery?"},{"comment_id":"10154858559120259","commenter_b":"Good! I hope they lock that bitch up for as long as they can!","commenter_a":"Time for prison.","post_message":"Student Nikki Yovino claimed she was raped by two football players, both of whom lost their scholarships and maintained the sex was consensual. Now, Yovino admits it was a lie designed to gain sympathy from another man she liked. She now faces charges that could bring 5 years in prison if convicted."},{"comment_id":"1145080512196207","commenter_b":"@username, no. The crime is to be caught crossing the border into this country. Once you're in the country, it is a CIVIL offense and people are due a hearing and disposition before a judge.","commenter_a":"It'll literally distract them from focusing on real crimes","post_message":"\"If the federal government takes a more aggressive role on deportation, then they’ll have to do that on their own.\""},{"comment_id":"850412481815995","commenter_b":"Ungrateful bitch deserve to be slaped","commenter_a":"Y can't fix stupid","post_message":"If you disrespect our troops, you don't deserve to live in this country. They are the reason you have freedom. They keep us safe. What do you think her punishment should be?"},{"comment_id":"10154181766797093","commenter_b":"It's non violent offenses .","commenter_a":"What about victims? Can you erase their memory?","post_message":"If you have a criminal record, a group of Dallas county judges will help people with criminal records get their lives back on track. bit.ly/2li0sJ9"},{"comment_id":"10154791254721756","commenter_b":"And cue the superficial bitch...","commenter_a":"He's ugly as fuuuuck though. Great actor though... Turkey neck goes gobble gobble","post_message":"\"It's a perfect role,\" Jeffrey Tambor says. \"... I thought I was gonna do Lear, but I'm gonna do Maura.\" Season 3 of Transparent comes out on Friday."}]
