[{"comment_id":"10152904243581636","commenter_b":"If she wanted to kill herself she would have hope she frys!","commenter_a":"Those poor babies. This poor woman. I can't say I understand killing her babies, but she is very obviously severely depressed. I only wish she had gotten the medical attention she so clearly needs before she took such drastic measures.","post_message":"Officials say a Connecticut mother who allegedly murdered her two children left a suicide note next to the children bodies, explaining why she killed them."},{"comment_id":"10152981521492235","commenter_b":"Surpising?! I think not.","commenter_a":"No surprises here. The sad thing is so many of today's Democrats and Republicans choose to ignore their party's histories and instead make excuses for it - such as saying because things happened years ago it was acceptable.","post_message":"What these presidents said in private and what they did in public were often sharply at odds."},{"comment_id":"10154191985279497","commenter_b":"Your a bitch","commenter_a":"obamas a piece of dog shit","post_message":" no need to be nervous; it a nice place, and I sure everyone will be very friendly to you. Barack Obama"},{"comment_id":"10153635316283812","commenter_b":"\"It's Just Lunch\" was already taken...","commenter_a":"The name is stupid....Couldn't come up with something a little more interesting!??","post_message":"Earlier this year, the Kang sisters, co-founders of the dating app \"Coffee Meets Bagel,\" turned down a $30 million \"Shark Tank\" investment offer. Here's what they have been up to since the show, and where their app is changing online dating: @webpagelink"},{"comment_id":"10153080401256051","commenter_b":"There is a hog epidemic going on in the U.S. there destroying farms everyday...there's a big need to keep the population down. Quit crying your not the ones who's life's are being destroyed","commenter_a":"The ribs are good .. smokin low and slow.","post_message":"These hunters have one message and one message only for their critics: get over it."},{"comment_id":"1208229205939996","commenter_b":"CRIMINALS DON'T OBEY GUN LAWS OR ANY LAWS!","commenter_a":"Somebody went postal in Orlando last night. Another mass shooting, our country has so many. I have to have a licence to drive a car, to prove I am not so crazy as to kill people with it needlessly. But any idiotic crazy person can own a gun, or lots of them, with no accountability. The second amendment was not written to cover high capacity assault rifles, designed only for killing people.","post_message":"LATEST: Approximately 20 people are dead and scores wounded after a gunman opened fire and took hostages at a gay nightclub in Orlando."},{"comment_id":"1181685188533567","commenter_b":"This picture is missing a muzzle for that big mouth!","commenter_a":"Her eye bags and pouchy cheeks disappear somewhat when her mouth is open like this. But then you see her overbite and buck teeth.","post_message":"It's happening!"}]
