[{"comment_id":"811770395611301","commenter_b":"Kennites ! Caine's offspring is the remnant. Numbers 33 : 50 - 56 God told the Jewish people when entering the Promised Land. God said - Run the Inhabitants out of God's Land. Destroy all pagan Idols. Destroy all pagan high religious places. Possess the Promised Land ! May God bless Israel !","commenter_a":"Sons of Satan who want their own Caliphate hiding behind religious to commit atrocities again fellow humans.","post_message":"Women taken captive in Iraqi town Mosul. #Sexslave #ISIS #Iraq"},{"comment_id":"1049313658417628","commenter_b":"Too true!","commenter_a":"I see an IRS audit in staples future. ...","post_message":"Staples announces that because of Obamacare they're having to make some changes in the structure of their employees, and Obama does not like it and he takes out after them. \"Obama Slams Staples for Reducing Hours to Avoid Obamacare,\" and Staples responded."},{"comment_id":"10153858591813279","commenter_b":"Clinton is a republicrat! When will people realize she is only \"progressive\" when it comes to lining the pockets of Wall Street, big corporations & the ultra rich?","commenter_a":"\"When [Clinton] says let talk about issues and let look forward, what she really saying is let not talk about my campaign financing, or my policy history, because it won bear the scrutiny my new, new, new progressive brand demands.\"Look, let get this straight. It wasn't very long ago when Hillary Clinton favored the TPP, the Keystone XL Pipeline and the death penalty. She also opposed gay marriage and reinstating Glass-Steagall. Her foreign policy is closer to the neocons who got us into Iraq (which she voted for) than what the American people favor. She flipped on immigration, gun control, and NAFTA. That not progressive. She attributes her changes towards progressivism to as a result of information. But as Politico points out, for most of these issues, there was no new information. For example, what changed on gay marriage, other than public opinion? It also begs a question: if Sanders ...","post_message":"The most heated exchange during last night's MSNBC Democratic presidential debate began after Bernie Sanders accused Hillary Clinton of being part of the political establishment."},{"comment_id":"10154185430309062","commenter_b":"Why force a woman to ruin her body if she doesnt want to","commenter_a":"Conservative's be like \"I demand you to keep that baby\" nine months later \"I don't want my tax dollars paying for those babies\"","post_message":"NEW: Another hidden camera video taken at a Planned Parenthood facility was just posted online, and Governor Greg Abbott has already responded."},{"comment_id":"1132111446809033","commenter_b":"Anyone who thinks this monster deserves peace to live her life free is more fucked up than she is!","commenter_a":"You people are sad! Leave her alone already, she deserves the right to be rehabilitated. Still watch her closely, but leave her alone.","post_message":"The convicted killer has changed her name several times since her 2005 release."},{"comment_id":"10154930045761037","commenter_b":"Don, you can get you point across without being condescending and juvenile. Just ask Bernie Sanders.","commenter_a":"Watch the trumpettes ignore the financial FACTS and whine that everybody isn't bowing down to their orange cheeto god. LOL at them. Hey trumpettes: you were conned. Again. Told you so.","post_message":"WATCH: Donald J. Trump tours Carrier plant, gives speech after company agrees to keep 1,100 jobs in Indiana."},{"comment_id":"10153106111768717","commenter_b":"Ha Ariana Grande get out of America and don't come back and American people should boy cot all her music","commenter_a":"Well if she can lick donuts then it is the shop's problem in leaving them where she can do this, so the shop should be the ones facing criminal charges.....","post_message":"A doughnut shop owner wants Ariana Grande to face criminal charges for licking and spitting on doughnuts -- @webpagelink"}]
