[{"comment_id":"1021077537953055","commenter_b":"Stupid assbag thug asshole !! Stupid is as stupid does !","commenter_a":"yes","post_message":"Chevez Antwann Fiason wasn’t expecting this homeowner to be armed. This is why Americans have the right to bear arms. Can we get 70,000 ‘LIKES’ for the Second Amendment?"},{"comment_id":"10154448995838812","commenter_b":"@username what makes her uneducated?","commenter_a":"And people seriously want to elect him president?!? Get a clue!!!","post_message":"New York's attorney general says he won't be deterred in pursuing the state’s case against Donald J. Trump and Trump University, just because the defendant is campaigning to be President of the United States."},{"comment_id":"10153895109342994","commenter_b":"Let Canada take in all the refugees - America doesn't want or need them.","commenter_a":"That's Canada! Friendly and welcoming people :) Wish the rest of the world was like that..","post_message":"A church in Canada is making a statement in the holiday season that's brewing controversy - and they're going beyond the church sign."},{"comment_id":"1694209280599095","commenter_b":"Illegal aliens have to register for the draft as do green card holders and U.S. citizens or immigrants who are born male and have changed their gender to female! You want to see a run for the border, get a good skirmish started in NK and use a military draft to man it, you'll see the mad rush to leave the U.S. by freebie wanters.","commenter_a":"And \" The last person that wants to play the nuclear card...is me. But you can never take cards off the table \" - Donald Trump -","post_message":"\"America's commitments to defending our allies remain iron clad.\""},{"comment_id":"10153860997211756","commenter_b":"He is a hero","commenter_a":"Traitor!","post_message":"Snowden tweeted \"Can you hear me now?\" then had an exchange with astrophysicist Neil deGrasse Tyson covering Mars, cat pics and labels."},{"comment_id":"10154243663794160","commenter_b":"I bet he's caring a lot more women. As a woman, couldn't vote for Clinton. As a woman, she's an embarrassment to women.","commenter_a":"I pray, I pray, I pray","post_message":"Donald J. Trump is losing female voters."},{"comment_id":"1152602824750026","commenter_b":"You betcha! Right on the money! She's.a proven liar , Fraudster and a money/ power hungry bitch !!","commenter_a":". Blame Democrats for Flint Water Crisis says Michael Moore?....Democrats knew the water was poisoned for 18 months Moores tweet --> @webpagelink","post_message":"Is Sanders worried that Clinton is not honest, trustworthy?"}]
