[{"comment_id":"10155376064740389","commenter_b":"She's needs to be prosecuted for breaking the law!","commenter_a":"OF COURSE..... She is a huge narcissist, just like Obama. I am thoroughly disgusted!!!","post_message":"The White House tried to push past the Hillary Clinton email controversy on Wednesday, with Press Secretary Josh Earnest telling reporters he's 'not particularly interested in' discussing the issue.   Question of the Day: Do you believe the former secretary of state's explanation for using one email account for work and personal use?"},{"comment_id":"497783407099419","commenter_b":"Kill the pigs.","commenter_a":"Killing of police officers is WAY UNACCEPTABLE!!!! I am sure that he didn't know if these police officers were empathizing with the protesters but was doing their sworn duty to protect and serve!","post_message":"'Oh my god. There's people laying on the ground.' Video from #Dallas via Twitter user @allisongriz includes audio of what sounds like multiple gunshots. @webpagelink"},{"comment_id":"10152781185011748","commenter_b":"A woman named Ann Coulter taught me to hate the republican party!","commenter_a":"Why is it still speaking?","post_message":"Ann Coulter slams college loans as a 'scam' meant to make kids hate white people and Republicans"},{"comment_id":"786188861571691","commenter_b":"That is stupid why can't the welfare people get a job and beside who going to pay for their car insurance and car payment get real","commenter_a":"This is not true.if so think about the timing of it Killary is losing against Donald Trump and she is going to try and bye your votes but we are all to smart for that","post_message":"Congress Approves Bill Offering Free Cars To Welfare Recipients. Your tax dollars hard at work. Does this disgust you?"},{"comment_id":"10154945345047439","commenter_b":"How about America waking up? You have elected a Muslim President and Muslim administration twice, and sat back idly whilst a Muslim has destroyed America and flooded it with millions of Muslims and illegals. Unbelievably, after 9/11 with almost three thousand victims, America elected a Muslim, built a further 1000 mosques and sent $770 million of US tax payers money, to restore mosques overseas. Since 9/11, you have suffered a further 51 Islamic related/honour killing attacks, with another long list of victims. Millions of illegals have simply walked into America and massively include, rapists, drug users, hardened criminals and sex traffickers. Despite thousands upon thousands of unscreened Syrians entering America each month, millions of white Americans are voting a 550% increase in unscreened Muslims, amnesty to over 11 million illegals and 650 miles of open borders. Trump is telling the world that American's are an absolute embarrassment, on how they ...","commenter_a":"Europe needed to wakeup 10 years ago, at this rate they are FINISHED, I hate to say it but this is what You get when You let Females rule countries... I know that sounds sexist, but there are not many M. Thatchers out there!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"702034983304927","commenter_b":"So you ladies that said you'd leave the country, hurry and get the hell out. We don't care for you or need you. Good bye","commenter_a":"These so-called celebrities exist only too the insignificant people they entertain","post_message":"Yes, it's as bad as you imagine..."},{"comment_id":"1775783539370851","commenter_b":"Idiots arrest them all","commenter_a":"White lives matter more!","post_message":"WATCH LIVE:  Protesters have gathered in downtown Atlanta. We have several Channel 2 Action News reporters with a group that is marching near the King Center and we'll have live coverage starting at 11."}]
