[{"comment_id":"1357815300916697","commenter_b":"LOSER. MOVE ALONG NOW!!!","commenter_a":"Made this myself fits them perfectly","post_message":"Stein planned to make an announcement about the Pennsylvania recount Monday outside the Trump Tower in New York."},{"comment_id":"10153910838991336","commenter_b":"And slap her face!","commenter_a":"Bless her heart...","post_message":"Carly Fiorina says tech companies need to be asked “to bring the best and brightest, the most recent technology to the table.” #GOPDebate"},{"comment_id":"10154933648690695","commenter_b":"Stay in your lane lady","commenter_a":"I keep saying this and I will say it again ... why arent people protesting their brothers killing each other every night? Where are the Black lives matter groups? Or is that just when it involves a white man or police officer because I'm confused. I'm pissed that this man can't even go out in Atlanta to celebrate his new job! Why arent more people mad about this???!!!! Please tell me. They should have been looking up to this man for having his priorities straight! #alllivesmatter #theviolencehastostop #getyourneighborinorder","post_message":"Mitchell Mormon Jr. was celebrating a new job when police say someone shot and killed him."},{"comment_id":"10154064327489575","commenter_b":"Rape him then burn his sick a$$","commenter_a":"Justice.","post_message":"A jury found William Gholston guilty of murdering 15-year-old Ben Davis High School student Dominique Allen. Allen’s burned body was found in the backyard of a near west side home in 2014. She had been strangled and her feet and hands were bound with a wire."},{"comment_id":"997192570318083","commenter_b":"She should run","commenter_a":"The horrifying thing about Ann Coulter is that.....someone has sex with her. The more horrifying thing is....there's a chance it's consensual.","post_message":"Many of Ann Coulter's fans were not happy with her dream ticket."},{"comment_id":"10153543784611130","commenter_b":"Bitch where?","commenter_a":"Why are some Android users so concerned with Apple? I know as an Apple user, I could care less about what Android does. It's not really the competition some make it out to be if it's one-sided...","post_message":"Great news for Android."},{"comment_id":"984777404931920","commenter_b":"Our weak border has made Mexico Drug Cartel stronger and made Mexico's government weak with corruption. Mexico has some of the most beautiful beaches in the world that are controlled by some of the most deadliest drug cartels. Mexico is losing billions in tourism because of the Cartel. Mexico is a culturally rich country that is being destroyed by these drug cartels. By building this wall it will help both the Mexican and the American economies by stopping drug trade. The Cartels will lose many because supply will be cut of and Mexico will gain strength. 95% of illegal drugs that come across the border will be stopped by a wall. It will in turn save our communities and our youth. Our youth will be able to flourish instead of turning to drugs. Americans will no longer have to depend on Liberal Politicians asking for help, they will be able ...","commenter_a":"Take away handouts and people committing welfare fraud and put them to work. Seems like there's quit a bit of places hiring where I live. I do believe trump is our our hope and is the best choice for president. Bernie is a joke and Hillary is a liar.","post_message":"I will bring our jobs back to the U.S., and keep our companies from leaving. Nobody else can do it. Our economy will \"sing\" again."}]
