[{"comment_id":"1017645858352192","commenter_b":"This she bitch should be locked up.","commenter_a":"Every one knows what to expect from you. Nothing good.","post_message":"ClashDaily.com"},{"comment_id":"988452247844232","commenter_b":"If you have a daughter tell her to free her nipple in public and the pervs will come flocking to take pictures. Which will be legal if in a public space. Maybe you should look up Voyeur on pornhub or something and girls of all ages are being creep'd on.","commenter_a":"These sexist comments are appalling. Especially from the women. Keep letting society tell you what's proper and where your naked parts belong. As long as I'm concerned breast were designed to feed a new born. A man can do whatever the hell he wants but a woman has to be restricted to pretty much anything that might make her comfortable because revealing clothing means she's \"asking for it\" and showing her nipples, which are both called the areola on both men and females by the way, would just make men go into a frenzy. Instead of instilling this belief that breast and skin of women are meant to appeal to the eyes of men, teach men and instill in them self control, consent, and respect for women.","post_message":"Here are the nipples so scandalizing that Facebook won let us show them to you. (To see the uncensored version, click here: @webpagelink) #FreeTheNipple"},{"comment_id":"1237783792909359","commenter_b":"Now the Muslims are going to come here and outbread us? ....is that their big 1000 yr plan? ....lol","commenter_a":"Tell that to my neighbors in Roanoke,VA that got stabbed this weekend . The terrorist is being investigated by the FBI for terrorism....Only when the national news reported the terrorist attempted to behead not stab the man did the local liberal rag paper update their reporting.","post_message":"The United States faces many threats, but terrorism is not chief among them, according to VP Joe Biden. @webpagelink"},{"comment_id":"10153621396858352","commenter_b":"Look little girl you came out me with your dumb ass statement, you the one feel some type of way bitch because gow I feel and what I know. Now I understand your 16......young and dumb like I said","commenter_a":"Oh let me guess....its not about race, her people's have money.....yea right, its all about race and for those dum ass white people who says its not......go eat a dick.....this some bullshit","post_message":"Parents’ fury after girl, 16, who killed three friends in crash while driving SUV without a license is ordered to write an ESSAY instead of serving jail time"},{"comment_id":"1048574538534260","commenter_b":"Please vote for Trump , Wisconsin !","commenter_a":"The career politicians in the runnng - all of them except Mr. Trump, have had many opportunities to do their job of protecting us, providing good paying jobs, help get a handle on the ever-increasing debt - - and they have done Nothing, but bask in the political paradise they have created - - getting paid with our valuable tax dollars to do nothing but make matters worse. I hope Wisconsin voters will not allow themselves to be bamboozled into voting for more of the same for the next 4 years. I don't think this country could take it. Trump 2016 !c","post_message":"My new radio ad, airing today in Wisconsin! See you soon! #MakeAmericaGreatAgain"},{"comment_id":"10153982167589203","commenter_b":"What a pussy cant go against his witch of a wife!!!!","commenter_a":"@username Lorenzo Antonino","post_message":"\"If we're not a part of the solution, we're a part of the problem.\""},{"comment_id":"10153784012776337","commenter_b":"Bitch you won't riot. You'll cry !","commenter_a":"if you kill glen we riot","post_message":"HE TRIED! One The Walking Dead character would still be alive if producers had listened to Andrew Lincoln..."}]
