[{"comment_id":"1527434820649594","commenter_b":"@username she's a cow","commenter_a":"They are like at least 5 articles about Kim Kardashian every day.. Kinda tired of this. She was robbed and shes still rich and has millions in the bank. Its not the end of the world. They are things & news that are MORE important than Kim's life!","post_message":"Kim Kardashian West's friends are rallying around her"},{"comment_id":"10153227966933984","commenter_b":"The woman is a fukin crook","commenter_a":"I want a moral person leading our country!!","post_message":"Well, here's BIG news that will turn a lot of heads. Do you hope this marks the final chapter of the Clinton saga?"},{"comment_id":"10154517651704166","commenter_b":"Ash, Nc","commenter_a":"Hi from","post_message":"Mother of son hit with books at school speaks out"},{"comment_id":"1142481939134045","commenter_b":"F*** that nicole. That's not kool. Omg! 😨","commenter_a":"@username Logan Rose","post_message":"Would you? #WSHH"},{"comment_id":"10153402345983812","commenter_b":"Women are to careless & I don't try to twist anything!!!This is a 10 year old girl,not an Adult woman..In most cases ppl could prevent getting pregnant but they do NOT!!I do not even see how would be possible for this child to carry a baby to full term..I think if you are old enough to spread your legs you should be responsible enough for the outcome..Like I said this is a baby not an Adult!!Not going to argue the difference!!!","commenter_a":"I'm totally against abortion but in a case like this her being so young she does not need to carry that baby!!","post_message":"10-year-old girl who was allegedly raped and impregnated by her stepfather has been denied an abortion: @webpagelink"},{"comment_id":"10152831511530496","commenter_b":"She is ugly","commenter_a":"While we understand that there are various strong opinions on this topic, we ask that everyone express them with in a respectful manner. Memes and inappropriate comments will be blocked from view. Those posting slurs or otherwise offensive comments will have their posting access to our Facebook page blocked.","post_message":"Caitlyn Jenner, the Olympic athlete formerly known as Bruce, makes her debut as a transgender woman, posing in a swimsuit on the cover of Vanity Fair. Take a look: @webpagelink"},{"comment_id":"10153949050391037","commenter_b":"One word: uneducated","commenter_a":"Trump has had my vote from the start to finish ... Nothing anyone says can \" change \" my mind .... We need a business person in the seat to lead not be a tyrant.","post_message":"“During anxious times, it can be tempting to follow the siren call of the angriest voices. We must resist that temptation,\" Nikki Haley said."}]
