[{"comment_id":"10153861358541680","commenter_b":"@username killary has had her head inside hitlers butt","commenter_a":"He'd tap that","post_message":"President Bill Clinton and Melania Trump greet one another before the first presidential debate begins."},{"comment_id":"10153460551006051","commenter_b":"It's nobody's damn business what she does with her home","commenter_a":"He should get out of this woman's property . However by all accounts it is not her home. She could rent it out, she could house a family . It doesn't seem right just to let the house sit there when so many are in need.","post_message":"This guy stole a 70-year-old woman’s home. On Wednesday, a judge decided whether he could keep it."},{"comment_id":"10153767433373132","commenter_b":"go girl.","commenter_a":"You are the most. Beautiful one there your Hair your. Clothes shoes. You go Rock it Beautiful!!!","post_message":"Counting down the days to New York Fashion Week."},{"comment_id":"944552658926615","commenter_b":"People always wanna go after the other person. .. well guess what? .... THE DAUGHTER WAS THE ONE WHO HAD HER 16 YEAR OLD LEGS OPEN. AND WHAT 16 YEAR OLD BOY GONNA SAY NO TO PUSSY? smh","commenter_a":"I've got 4 daughters and a handfull of granddaughters--put me on her jury!","post_message":"MAD MOTHER: Police say say she beat up a boy after finding him in bed with her daughter. After he ran away, they say she took a baseball bat to his car."},{"comment_id":"10153739914549714","commenter_b":"@username I was going to say that. Both are smokin' tho.","commenter_a":"Cara looks like a dude without makeup","post_message":"Richard Madden was pretty critical of Cara Delevingne and her cringeworthy Good Day Sacramento interview."},{"comment_id":"1055064891200649","commenter_b":"Time to take them away before she kills them and why you are at it tie her tubes! Not smart enough to have children!","commenter_a":"Well try her in there for five minutes w/0 her iPhone, mirror and other items you know she thinks are indispensable....don't forget, no designer water, either!!!","post_message":"A Virginia mother left her two children unattended in a hot car, with windows rolled up as she turned herself in for leaving one of the children unattended in a hot car while she went shopping last month."},{"comment_id":"10153328651014342","commenter_b":"wonder if her phone was busy? congress write the laws why is no one talking about them?","commenter_a":"Well he calls after someone writes the words to say....the deputy was killed on Friday night and this is Monday....","post_message":"Today, President Obama called the widow of fallen Harris County Sheriff's Office Deputy #DarrenGoforth. After that, he released the following statement: \"This afternoon, on my way to Alaska, I called Kathleen Goforth, the widow of Harris County Deputy Sheriff Darren Goforth - a veteran law enforcement officer who was contemptibly shot and killed over the weekend. On behalf of the American people, I offered Mrs. Goforth my condolences, and told her that Michelle and I would keep her and her family in our prayers. I also promised that I would continue to highlight the uncommon bravery that police officers show in our communities every single day. They put their lives on the line for our safety. Targeting police officers is completely unacceptable - an affront to civilized society. As I said in my State of the Union Address, we've got to be able to put ourselves in the shoes of ..."}]
