[{"comment_id":"10152904940001636","commenter_b":"Death penalty. Make em think twice. We need to set an example out of these murderers.","commenter_a":"Charge the worthless parents. What was he doing alone in a public park with a pellet gun like that and no orange tip and a pistol none the less. Horrible parents","post_message":"A judge found probable cause for multiple charges against the officers involved in the killing of 12-year-old Tamir Rice."},{"comment_id":"10153905891802629","commenter_b":"Hahahah. Have you seen Trump's demographics?","commenter_a":"Those bitches are sexist not voting for a woman","post_message":"Ladies be Bernin'."},{"comment_id":"10153708694531955","commenter_b":"Stop all immigration","commenter_a":"Stupid people.","post_message":"Congress to vote on right of Muslims to migrate..."},{"comment_id":"10156451475900500","commenter_b":"Fire her","commenter_a":"So this woman or all the people she was ordering food for did not have a cell phone to order lunch? It should have never been done with a 911 phone.","post_message":"DANGEROUS SITUATION- What do you think of her punishment?  @webpagelink"},{"comment_id":"620315121449719","commenter_b":"Would make a great couple . Two freaks .","commenter_a":"HE likes. HE likes. HE aint a SHE!!!","post_message":"Caitlyn Jenner says she likes Ted Cruz because “he's very conservative, and a great constitutionalist.” @webpagelink"},{"comment_id":"10156335806925725","commenter_b":"ahahah im sorry you said lead... omg kill yourself please xD","commenter_a":"President Obama is being a leader - something that Donald Trump only dreams of.","post_message":"What is our President doing?"},{"comment_id":"1677003925887340","commenter_b":"'@username, why do many Americans believe that Obama isn't concerned about protecting America? He has given no indication whatsoever that this is the case. As a matter of fact, he does just the opposite. Do you seriously believe that building a wall at the Mexican border and not accepting any refugees will do anything to stop terrorism? The roots of terrorism are not illegal immigrants or refugees. The roots of terrorism are Americas interferences in the middle east. The roots of terrorism are people who say 'bomb them and take their oil'. How would you feel if someone would say this about the USA? Terrorists can be fought with weapons but terrorism can only be fought with education. And this is exactly what Obama does. Educating people...by talking about Islam, by visiting a mosque, by saying he will stand with the Muslim Americans. That doesn't mean he hates Christians or ...","commenter_a":"Congratulations Mr. TRUMP. We look forward to seeing you here in SC. Our country needs a strong leader that's going to make this country great again. We need someone in the white house that actually is a christian, strengthens our military and will secure our borders. Take care of our people first, the great people of the United States.","post_message":"Good morning America! THANK YOU for your vote, New Hampshire! We will MAKE AMERICA GREAT AGAIN! Off to South Carolina today. Everyone have a GREAT DAY, and again- thank you!"}]
