[{"comment_id":"10154047243421990","commenter_b":"Your moms desperate.","commenter_a":"Out of all California, he gets a \"band\" from Hilmar, CA. I'm sure the musicians are talented but...LMAO!","post_message":"Who will be marching in Donald J. Trump's inaugural parade? Here's your answer: @webpagelink"},{"comment_id":"10153743824977093","commenter_b":"Ain't no snake ever hurt no one. My niece Becky got bit by a dog","commenter_a":"Am glad y'all found this snake","post_message":"UPDATE: The missing king cobra has been found. That time your deadly pet snake escaped the house.. bit.ly/2bPTSGW"},{"comment_id":"10153073286297894","commenter_b":"I think the idustry favors her and is partial to her music but there is no room for disrespect to anyone.","commenter_a":"I can't get past \"somewhat respect me\". Either he respects you or not! ByeTaylor","post_message":"Taylor Swift Talks Kanye West in ‘Vanity Fair': I Felt We Couldn’t Be Friends Until He Somewhat Respected Me"},{"comment_id":"1708500929417584","commenter_b":"My native American vote for Trump Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not stirring a race war. Trump did not leave any US soldiers in Benghazzi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion dollars. ...","commenter_a":"Trump is the worst person in the world.","post_message":"Unfortunately - when some people do not like what they hear, they have a tendency to smear the facts. As your next President of the United States of America - you will be proud of your leadership in Washington, D.C. - and know that our best interests will be for you, the AMERICAN PEOPLE. WE will be WORKING FOR YOU!"},{"comment_id":"10153903407251336","commenter_b":"Her teeth are still loose she can't knaw on a steak... Cheap date. (y)","commenter_a":"She could have easily ducked her commitment, all things considered, but didn't. I gained more respect for Ronda over this classy gesture in the face of her recent defeat and widespread public mockery, than any of her knockout wins. Much love to her and our Armed Forces.","post_message":"UFC superstar Ronda Rousey kept her promise and accompanied U.S. Marine Lance Cpl. Jarrod Haschert to his Marine Corps Ball in South Carolina on Friday."},{"comment_id":"10154736430788984","commenter_b":"I think she's loosing her butt and I'm glad!","commenter_a":"So go be a Grandma and get out of the race.","post_message":"It took Hillary Clinton less than 15 words to show her debate strategy in a very clear way. Do you think Donald J. Trump is winning the debate?"},{"comment_id":"10153625958496636","commenter_b":"This is why women shouldnt get involved: too emotional. Lets let everyone in...","commenter_a":"The Germans now are having a worse affect on Ireland than nazism did. They are diluting the nation state with mass immigration.70 million muslims from Turkey given visas, austerity and cheap labour frrom countries that should never have been allowed into EU.Dole tourists bleeding us dry . Most importantly our individuality is being merged into a multicultural nightmare","post_message":"Freedom is in decline across the planet"}]
