[{"comment_id":"10152884468574877","commenter_b":"Happy birthday you beautiful queen","commenter_a":"Happy Birthday!!!!!","post_message":"We are wishing Lupita Nyong'o HAPPY BIRTHDAY today!! The Academy Award winning actress received her masters degree in acting in 2012 from the Yale School of Drama and in 2014, she was named \"The Most Beautiful Woman\" by People and \"Woman of the Year\" by Glamour. LIKE and SHARE to celebrate!! >>>@webpagelink"},{"comment_id":"864523933643860","commenter_b":"Judy. Are you really that stupid? She's a doormat that stayed with a moral less husband for decades just for power. You have low standards.","commenter_a":"Hillary is such a threat to them, they will do anything to hurt her.","post_message":"“Secretary Clinton used one email account when corresponding with anyone, from Department officials to friends to family. A month after she left the Department, Gawker published her email address and so she changed the address on her account.” -Clinton attorney David Kendall"},{"comment_id":"10153253318118188","commenter_b":"I don't see women chomping at the bit to be garbage men, roughnecks, boilermakers, crab fishers, or construction workers.","commenter_a":"She's a joke!","post_message":"ICYMI:"},{"comment_id":"1621412104829954","commenter_b":"She needs to go and climb under a rock","commenter_a":"This woman is disgusting.....","post_message":"Lady Gaga just stunned her fans when she wore this out in public..."},{"comment_id":"10152573528821717","commenter_b":"Greg Abbott in Texas! POS!","commenter_a":"He really is quite the Gov, is there a secret contest between him and Walker to who can screw a state more?","post_message":"Click here to follow LGBTQ Nation on Twitter: lgbtqn.at/tw"},{"comment_id":"10153703275114384","commenter_b":"Whine, whine, whine. All the illegals will vote for hand outs, what more do you corrupt fools need? Lying POS!","commenter_a":"BLUE ALL THE WAY!!!","post_message":"It is inexcusable for Republicans to have left town without acting to restore the Voting Rights Act. Click LIKE if you agree: Nothing should stand between American citizens and their most sacred right to vote."},{"comment_id":"699044636944748","commenter_b":"But will he be deported!","commenter_a":"Kill them all!","post_message":"HORROR IN MINNEAPOLIS! Somali Refugee in U.S. for Only 3 Months RAPES American Woman! This is what OBAMA has done to our cities! He imported this Muslim rapist!! TRUMP WAS RIGHT!"}]
