[{"comment_id":"10153262054135779","commenter_b":"It's funny cuz it's true.","commenter_a":"\"...MTV then responded by phasing music out altogether over the course of the next few decades, essentially defeating the entire point of why they're there in the first place.\"","post_message":"In 1983, while promoting 'Let's Dance,' David Bowie takes the then two-year-old network MTV to task for playing virtually no videos by black artists. Watch the amazing interview below."},{"comment_id":"1220005224782920","commenter_b":"She was a fucking stripper! Yeah, real class!!!","commenter_a":"Yes, what a wonderful change. And so does Mellania - what a classy First Lady we have!","post_message":"ClashDaily.com"},{"comment_id":"10153715327517894","commenter_b":"These hoes kill me acting like they the only one with a fucking opinion and that their opinion is the only one that's right bitch you got me fucked up Alex Carey and when I see some breast then I'll refer to transgender!","commenter_a":"I love @username, but I don't expect anything objective about Mariah Carey to come out here because @username and Mariah are besties. I'm sure there's more to the story than this.","post_message":"Nick Cannon Is Refusing to Sign Off on Mariah Carey Divorce Papers"},{"comment_id":"10150802483299999","commenter_b":"Takes one to know one.","commenter_a":"Takes one to know one!","post_message":"Ted Cruz called Donald J. Trump a “pathological liar\" and a “narcissist at a level I don’t think this country has ever seen.”"},{"comment_id":"624507887756570","commenter_b":"She's a globalist evil one","commenter_a":"Obama don't put the flag on either!!","post_message":"Did you notice THIS?!?!"},{"comment_id":"10153234463025779","commenter_b":"Amazing political argument Mark. You've persuaded me to support Trump with your carefully worded statement.","commenter_a":"Biff Trump is a Joke..","post_message":"It started out as a joke: Donald Trump running for president! What better way to spoof the thinness of the Republican field than to shove a bombastic reality star with orange hair, a sixth-grade vocabulary and no behavioral filter onto the GOP debate stage. But, as Matt Taibbi writes, the joke turned ugly fast."},{"comment_id":"10152876069325950","commenter_b":"Enjoy your retirement Bob","commenter_a":"A straight shooter w/ a sense of humor and a poet to boot. Sunday won't be the same. We'll miss you, Bob.","post_message":"Bob Schieffer's 46-year career at CBS ends this morning with the 10:30 a.m. ET broadcast of \"Face the Nation.\" As we say goodbye, here's a lighter reflection with some of his best bloopers across the years."}]
