[{"comment_id":"10154475125548812","commenter_b":"STOP GLORIFYING THIS RAPIST POS.","commenter_a":"I don't think it's real remorse probably embarrassment. Which is great. So it means that the power of social media is effecting thing Even the Vice President commented eloquently. So keep it up share this post pictures and sign the petitions","post_message":"Women who provided character witness statements for the Stanford University swimmer convicted of sexually assaulting an unconscious woman on campus are expressing regret for supporting him."},{"comment_id":"933293890039082","commenter_b":"And any criminal will just turn in their guns! Like they do in Chicago and California!","commenter_a":"Clinton is so clueless!! This isn't about gun control bitch. This is about Obama allowing Muslims to come here knowing the repercussion of this. They were making IED'S in their garage you stupid fuck Clinton. Better start putting a ban on IED'S. Now all these Syrians Obama? Your the terrorist and the democrats are all equally guilty for putting you in and backing you. Come get my guns. You will get them no problem there but you won't be walking away. Black lives matter and Muslims are all terrorist.","post_message":"Wasting no time..."},{"comment_id":"10153042217565047","commenter_b":"JH move to Israel","commenter_a":"Because our communist muslim pig so called president is one if them. America stand for Israel Defy the leadership of this commie government and fight for what is right. Stand with Gods people.","post_message":"The terrorist-led Palestinian Authority (PA) has ended its peace with Israel.  War could be imminent, so why are we still sending millions of dollars to the PA?   We must stand with Israel.  SIGN & SHARE our petition to stand with us: @webpagelink"},{"comment_id":"10154129877777377","commenter_b":"I hope this woman lives in Fear for quite awhile.","commenter_a":"I am not a Trump fan by any means, and both the Obama and Bush daughters had their fair share of bashing on social media, but this crossed the line.","post_message":"Katie Rich has been suspended indefinitely from her job as a writer on NBC's 'Saturday Night Live' after making a tweet about Donald Trump's 10-year-old son, Barron, the Chicago Sun-Times reports."},{"comment_id":"10154035210569024","commenter_b":"Tap her phone - stop her from murdering people","commenter_a":"Well police next time you see this lard ass limo cross the line pull it over and ticket HER. She is an EX Senators EX dept of state she has NO PROTECTION rights from being stopped and charged.","post_message":"“AFTER SPENDING A ENTIRE YEAR COURTING BLACK LIVES MATTER…”"},{"comment_id":"10152632904466636","commenter_b":"Natasha Rebecca","commenter_a":"Zee Gee","post_message":"'She was on a mission,' said the owner of the determined little miniature schnauzer..."},{"comment_id":"10154608447428690","commenter_b":"'@username - Did I hurt your feelings? While you're defending her she's planning on how she'll enjoy all her wealth somewhere in the world while you'll be paying taxes up the wonker. It's called Sod's law.","commenter_a":"She is every color on the a--hole rainbow.","post_message":"'I am innocent, I am an honest person and I have never committed a crime.' @webpagelink"}]
