[{"comment_id":"10153776813241336","commenter_b":"Bye-bye!","commenter_a":"Good riddance!","post_message":"Ahmed Mohamed’s family released a statement saying they had accepted a foundation's offer to pay for his high school and college in Doha, Qatar."},{"comment_id":"10154144133589060","commenter_b":"@username I agree. She's one big mess. But they will elect her. Everyone loves a winner","commenter_a":"Lets make no mistake - Hillary has LOTS and LOTS of experience with many, many, many male (and some woman) leaders.","post_message":"Sanders espouses bold positions; Clinton talks about the world leaders she has met"},{"comment_id":"10153121325909411","commenter_b":"in ur ass","commenter_a":"White Americans are terrorists trained by CIA to kill people","post_message":"'We are concerned that attacks against the Muslim community are taking place in a heightened climate of Islamophobia and hatred.' - Sabby Dhalu, an organizer for Stand up to Racism."},{"comment_id":"10153397675031323","commenter_b":"sure!our women too commit crimes like women in any part of the world and when caught,they go to prison","commenter_a":"Disgusting! I live in Iraq and our prisons are never like that! huh! and they teach us democracy!","post_message":"\"Even though keeping inmates clean would seem to be in the prison’s self-interest, prisons control their wards by keeping sanitation just out of reach. Stains on clothes seep into self-esteem and serve as an indelible reminder of one’s powerlessness in prison\""},{"comment_id":"424495247675070","commenter_b":"No, it's us white people's fault................we don't give them enough !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Right on!","post_message":"Could Bill O'Reilly be causing more harm than good by saying this?"},{"comment_id":"10153655201276323","commenter_b":"Ha! Real men have curves, lol!","commenter_a":"The typically sexist depiction of what women want men to be... not what men are.","post_message":"Romance isn't dead, but it is dehydrated. What's it like to be be the hunk on the front of 414 romance novels?"},{"comment_id":"10154467163611051","commenter_b":"Madonna this is a women who invaded her on body with a cross,scum is all i can say ,yes she should be in jail","commenter_a":"trump does not have moral privilege to call anyone an ugly name, since he owns every ugly name one can muster to describe his repugnant behavior. Madonna does not come close to the names lying trump has called President Obama. Madonna \"tells it like it is\" and that is too much for Right wing nut bags.","post_message":"Donald Trump says he has only one word to describe Madonna."}]
