[{"comment_id":"10154435925811509","commenter_b":"Stz! Sexually transmitted zombies","commenter_a":"This is it. This is how zombies start.","post_message":"CDC confirmed the first case of Zika virus being transmitted sexually in the U.S. Dr. Sanjay Gupta has been following this fast moving story closely and is here live to answer your questions. What do you want to know?"},{"comment_id":"10155373271046509","commenter_b":"Megan Kelly spoke with her for less than five minutes and all that was uncovered was that this chick lied. That's enough for me.","commenter_a":"cheap attention. sorry, but this is pathetic","post_message":"\"He was really aggressive. He was really rude. He was a bad person with me.\""},{"comment_id":"10154367782019071","commenter_b":"@username...you go girl!","commenter_a":"there u go again with ur propaganda...trying to launch a smere campaign on donald trump..main stream media is pathetic..lol","post_message":"Before becoming Donald J. Trump's chief strategist, Bannon wanted to make a movie with Mel Gibson."},{"comment_id":"10154280732936336","commenter_b":"Agree100%","commenter_a":"How is this discriminatory? Use the bathroom according to your plumbing not your frame of mind. What about the civil rights of those who don't want to share the restroom with those of another gender? If a transgender earns money they pay taxes according to their earning not what they think they should pay. I'm really tired of a few people re-writing the moral and cultural standards for the nation.","post_message":"\"I’ll make a decision in 24 hours.\""},{"comment_id":"1777601655795113","commenter_b":"Hilary is such a hypocrite. She is lighting the matches.","commenter_a":"But hey, Hillary over Trump for sure.","post_message":"The divisive rhetoric and encouragement of violence we're hearing from Donald Trump isn't just wrong—it's dangerous."},{"comment_id":"1805658249719321","commenter_b":"Me muero!!!","commenter_a":"@username tu sueno","post_message":"Watch 23 adorable pandas make their public debut. @webpagelink"},{"comment_id":"10152828817287426","commenter_b":"Omgosh..I am not a violent person..BUT I would beat the Sh** out of that woman....first of all...I NEVER gave into my kids when they threw fits...that's how they learn to NOT get what they want all the time.....This woman is sick sick sick....part of parenting means to not give in..","commenter_a":"@username U seen this uet","post_message":"“There’s nothing wrong with that child, it just needs to be beat,” the woman, who claims to be Kathleen Smith, said in the video."}]
