[{"comment_id":"10153722294756350","commenter_b":"Nobody is forcing people to contribute","commenter_a":"This is what has been attained from people feeling low, down & out. Preacher Joel Osteen had amassed a fortune of $56,508,500 and lives in a $10,500,000 mansion in River Oaks. River Oaks is the wealthiest and most expensive community in Texas.","post_message":"Are you going through a tough time? Pastor Joel Osteen has some advice. (cc: Joel Osteen Ministries)"},{"comment_id":"1725568321015816","commenter_b":"I see lots of people who are saying \"see a wall won't help..\" Well the truth is the government doesn't give a crap about drugs coming into this country. They will make their money off addicts and death and jail time. What the government won't make money off of is illegal immigrants not paying taxes. That's the only reason for the wall. The government just wants their cut.","commenter_a":"Nick Cal","post_message":"800-yard-long tunnel found between Mexico and San Diego containing 1 ton of cocaine and 7 tons of marijuana. It's believed to be the longest cross-border tunnel ever discovered. @webpagelink"},{"comment_id":"977190145651659","commenter_b":"Hey ship them all to Canada they like the trouble makers. Attention Muslims get out of the USA we don't want you here!","commenter_a":"Private school or home school. It's worth the sacrifice.","post_message":"#IStandWithAhmed was trending on social media nationwide as people expressed their support for the teenager."},{"comment_id":"1141907219179950","commenter_b":"So, she won 3rd and 5th place. So much for any supposed advantage she's supposed to have by having been born biologically male. She was beat by naturally born females.","commenter_a":"We're all equal so we must all be equal physically right? Yeah no.","post_message":"“What happened to protecting naturally born females?”"},{"comment_id":"10153159279537452","commenter_b":"^^ wrong house","commenter_a":"How about the government stay out of our homes.","post_message":"THIS JUST IN: The Los Angeles City Council unanimously voted to require guns that are stored at home to be kept in locked containers, disabled with a trigger lock. abc7.la/1GGHSUi"},{"comment_id":"760258614149329","commenter_b":"She need to be grabbed by the pussy","commenter_a":"Agree! Stop whining you liberals!","post_message":"Nicole Kidman: “I would just say he’s now elected, and we as a country need to support whoever the president is, because that’s what the country’s based on.”"},{"comment_id":"234297206973807","commenter_b":"I can't stand this woman. She makes me sick","commenter_a":"Lying bitch","post_message":"Kellyanne Conway just took \"alternative facts\" to a whole new level by mentioning a massacre that never happened."}]
