[{"comment_id":"10155187473209614","commenter_b":"Your armpit makes me gag hahahhaha","commenter_a":"let them do their job.... and yes if you are on list ...GOOD BYE !!!!!!!!!! SUPPORT ICE FOR THE MAKING AMERICA GREAT AGAIN...","post_message":"Los Angeles' top elected officials cosigned a letter  urge in the strongest possible terms that ICE immediately cease this practice in our city.  Since the late 1970s, L.A. police have worked to build trust within the city large immigrant community so those in the country illegally can report crimes and offer information to police without fear of deportation."},{"comment_id":"10153482045808984","commenter_b":"She is a nut","commenter_a":"I would hate to have lived under her roof , she is not fit to be president. Or anything else.","post_message":"Hillary Clinton is known for her liberal view on just about every topic she chooses to sink her teeth into. And looking at this, her next move might be to include children in her agenda...  Do you think Hillary needs to be stopped?"},{"comment_id":"10154532123498271","commenter_b":"Oh, you're so compassionate from your suburban home, Kim. Here's to hoping they move in next door to YOUR family.","commenter_a":"So green card holders and those with dual citizenship are our enemies? And regardless of that, these people, they are us. We or generations ago of us were standing on this land as immigrants. They are us.","post_message":"\"This is not about religion - this is about terror and keeping our country safe,\" says President Donald J. Trump in new statement.   @webpagelink"},{"comment_id":"10152653855300950","commenter_b":"Good! That mother is a monster!","commenter_a":"I don't know that it's child abuse, so much as poor parenting. Different religions physically discipline their children, pursuant to their faith - there's a line where it become child abuse, but I don't know that that threshold has been met. As to the poor parenting - yeah, she really should not have done this. Humiliation of a child is not ever going to be the correct form of discipline. And, it will likely result in later life issues. This is a private matter, which should have remained in the home. If the girl had friends, then they should have been told in private, not through a public shaming. And I would hope the mother focuses less on the letter grade and more on the actual learning. If your child thinks that \"allowed\" and \"aloud\" are the same thing - your problem is bigger than you realize.","post_message":"A mother is facing child abuse charges after she sent her daughter to middle school wearing a \"public shaming\" t-shirt for getting \"F's in all of [her] classes.\""},{"comment_id":"633540503462936","commenter_b":"Whoooo so what. It's not like he left guys to die in Benghazi.","commenter_a":"Jesus who cares. How many years ago was it? Too many! I don't care what crap they find out about him, I will still vote TRUMP!","post_message":"Did he or didn't he? Listen to the recordings here and weigh in below: @webpagelink  (CC: Donald J. Trump)"},{"comment_id":"1765146687072705","commenter_b":"Do it dools ya pussy","commenter_a":"Dooley Whitton","post_message":"What you need to know about Flakkathe alleged drug used by an FSU student who fatally stabbed a couple."},{"comment_id":"1158864987513588","commenter_b":"\"You're the problem\" lol sound like a bitch","commenter_a":"You guys missed the full story here. See what happened was the person who served the food dropped them exact three fries on the floor, that lady was actually being a good Samaritan and helping the cop and taking the dirty fries away for him so he did not get sick. Long story short don't do anything nice for cops because they are assholes and will do everything they can to abuse their power and fuck over the average civilian. I made all of this up of course but all of us know never even talk to a cop unless you absolutely have to because they are just looking for a opportunity to arrest anyone because they are bored. She should have just waited for her own fries. Stupid decisions get stupid results.","post_message":"A woman was arrested in Northwest D.C. for stealing three French fries from a police officer who was dining at a U Street eatery. #WSHH"}]
