[{"comment_id":"10153200218821636","commenter_b":"Not even a single Scottish one who wrote this article....","commenter_a":"@username waaaay yours didn't get a mention","post_message":"Warning: reading this will make you hungry"},{"comment_id":"1222800194406675","commenter_b":"we want some in the NW!!!","commenter_a":"Noooooooooooooooo","post_message":"Millions of Americans woke to chilly temperatures Saturday, and many could see (gulp) snow before the weekend is over."},{"comment_id":"915117481938364","commenter_b":"One day her money,scheming,and life of cards will come crumbling down in front of the world. How can billy bob clinton show his adulteress face. They are shamefull. And not the only ones. They better get their life righ fir the next.","commenter_a":"yes...why should Hillary get away with what she has done,if it was any of us we would go to prison,so yes send her to prison along with Obama","post_message":"No wonder The Hildebeest hates... The Donald. @webpagelink"},{"comment_id":"10153312021701756","commenter_b":"Please Sharon, share sources of actual statistics/studies for this belief. Thanks.","commenter_a":"How about environmental impact? How about helping ourselves? It seems apparent to me that most people truly do not care about animal welfare.","post_message":"Three activists, three answers on how veganism — or vegetarianism, or even just cutting way back on meat consumption — can actually make an impact for animals, and for global inequality."},{"comment_id":"10154665799440141","commenter_b":"We need to stand by our country and our values. Anyone who is allowed into the United States needs to be totally vetted first. I'm sorry, all of you \"open-minded\" people, this just makes sense. Because we are 'Merica!!!","commenter_a":"Islam is evil","post_message":"“All over Europe, all over America we have seen the devastation of evil in our time which is radical Islamic terror.\" Sean Hannity hosted this heated panel on the rise of radial Islamic terrorism."},{"comment_id":"987580134720040","commenter_b":"Send illegals home","commenter_a":"Send the illegal scum back home.","post_message":"\"The massive influx of immigrants, both legal and illegal, has been demonstrably bad for the employment prospects of low-skilled Americans...\""},{"comment_id":"1109262989140148","commenter_b":"Crazy woman- Good match for Trump","commenter_a":"What an imbecilic shallow fool! Has she ever gone a day without knowing where she will sleep for the night or whether she will find a meal before the end of the day? God! Someone just shut her up!","post_message":"\"Knowing that Trump won on [immigration], it should empower you to go ahead and ask the candidates, 'What the heck are you thinking, candidates? What are you thinking when you're going ahead and actually asking for more immigrants, illegal immigrants, welcoming them in, even inducing and seducing immigrants with gift baskets of teddy bears and soccer balls?' \" Sarah Palin said."}]
