[{"comment_id":"1728040457449467","commenter_b":"She is bad to the bone","commenter_a":"She is bad to he bonem","post_message":"“Here’s Hillary Clinton campaigning in favor of women, while the foundation that she and Bill own pays men 38% more than women.”  Newt Gingrich shared some shocking statistics with Sean Hannity regarding the Clinton Foundation."},{"comment_id":"1841512796060882","commenter_b":"@username till the wall is complete lol there isn't going to be anyone picking lettuce you better grow your own","commenter_a":"Well Boston Mayor...... you are not the President so you don't get to decide what he focuses on. He's up holding his priority promises to his supporters first then comes the rest. Not the Democrats vision the Trump vision","post_message":"Boston Mayor Marty Walsh says President Trump should focus more on creating jobs and addressing urban issues such as homelessness.  Watch more: @webpagelink"},{"comment_id":"10154282807343984","commenter_b":"You need to think about the children you putting in danger ,it would be taking advantage of !!!!!!! NC don't back off","commenter_a":"@username my head hurts over all the rucus about this law. My suggestion was to make it ALL about bathrooms and leave the employment issues out of it. I was happy to see he is still standing by his decision to keep bathrooms limited to the actual sex you are physically. I have been amazed by the number of employers threatening to leave and all the other boycotts. At least I still don't have to worry about a man walking into the friggin ladies room. Urghhhhhh","post_message":"North Carolina has come under INTENSE criticism lately for its stance on the LGBT community. After weeks of outrage, the state's governor has just come out with a stunning announcement that ANGER many Americans.  Do you support North Carolina's governor?"},{"comment_id":"10156005617690725","commenter_b":"Loved Trump's speech!","commenter_a":"What's your thoughts on the confederate flag or the MS state flag, Mr Trump?","post_message":"#MakeAmericaGreatAgain #TrumpRallyAL"},{"comment_id":"1181580438601675","commenter_b":"That's not true but i'm glad she got away with it,I can't wait till she starts debating Trump.","commenter_a":"Not","post_message":"True story..."},{"comment_id":"489008974557030","commenter_b":"Our Government has NO IDEA of how many muslims (refugees, immigrants, migrants, legal or illegal) are Already in OUR country!!!!","commenter_a":"Trump","post_message":"Cheney:  think this whole notion that somehow we can just say no more Muslims, just ban a whole religion, goes against everything we stand for and believe in. Do you agree with Cheney or Trump on this issue?"},{"comment_id":"10154378724845575","commenter_b":"This woman is pathetic","commenter_a":"Yet if the employer gets caught with them they are breaking the law. Obama's people have to go. Trump 2016","post_message":"Unbelievable . . ."}]
