[{"comment_id":"1242932969112927","commenter_b":"shes a nigga","commenter_a":"the origin of dream locks is india; not africa, not jamaica, not america. that girl is ignorant.","post_message":"Black student filmed confronting white student because of his hairstyle"},{"comment_id":"821893891240198","commenter_b":"Yes she does I don't believe not one of them dumb as hoes","commenter_a":"If Phylicia Rashad wasn't present when these incidents (allegedly) occurred, (but I would bet they did), then she has nothing of concrete value to say.","post_message":"“Forget these women. What you’re seeing is the destruction of a legacy.\" - Phylicia Rashad"},{"comment_id":"10154754813479369","commenter_b":"She is ALL Talk!!! A PERFECT Politician!","commenter_a":"I can't wait until he is prosecuted for all of the crimes he has committed. Will that happen? With a just justice system it will.","post_message":"Trump to Clinton: 'You'd be in jail' if I was in charge."},{"comment_id":"1350273158317846","commenter_b":"It's about time this evil and corrupt woman FINALLY gets the justice she deserves!!!","commenter_a":"The corruption is rampant which explains why she could run...and sadly win her party's nomination","post_message":"With just five days to go..."},{"comment_id":"10152786318205736","commenter_b":"She's a nut","commenter_a":"That's what I said about her","post_message":"What are your thoughts on race identification?"},{"comment_id":"10152665844280667","commenter_b":"If only she would run Elisabeth Warren would get my vote.","commenter_a":"Can't sstnd this women! She DOES NOT and WILL NEVER, EVER vote for her!!! Liar, liar, pants on fire!","post_message":"56% of women have a favorable opinion of Hillary Clinton, a Gallup Poll finds."},{"comment_id":"10153243373545950","commenter_b":"Go Hillary...to JAIL","commenter_a":"BREAKING NEWS: Donald Trump, Republican presidential candidate drowned today, apparently he was trying to learn to waterboard.","post_message":"President Obama banned the practice of waterboarding and other so-called \"enhanced interrogation techniques\" after he took office. But Donald J. Trump said he would \"bring it back\" to fight ISIS."}]
