[{"comment_id":"10154786755561438","commenter_b":"Fascist pigs.","commenter_a":"Just like China!","post_message":"All Interior Department Twitter accounts had been ordered shut after the inauguration."},{"comment_id":"10152941725546051","commenter_b":"I feel for him. The cops and courts don't help. He stopped him once and for all.","commenter_a":"I would have done the same ~ if our laws were CORRECT pedophiles wouldn't be as big a problem! He should NOT be the one in jail !","post_message":"“I just want you to know, I ridded one less (expletive) child molester from the (expletive) earth that (expletive) with my little brother,” he said. “Alright? That's all I got to say. I don’t give a (expletive) how much time they give me. Doing time is the easy (expletive) part.'"},{"comment_id":"707783986078846","commenter_b":"Ugly bitch man!!!!","commenter_a":"Just plain stupoid","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"10153540502734411","commenter_b":"Wow--look at that face. That woman needs to smile more.","commenter_a":"Links of blood and marriage tied Battenbergs/Mountbattens to Germany/or.also Saxe-Coburg-Gotha into 'Windsor' didn't transform Edward..","post_message":"'She was a child when this film was shot, long before the atrocities of the Nazis became widely known. But Edward was already welcoming the regime as Prince of Wales in 1933 and remained pro-Nazi after war broke out in 1939. He could well be teaching the Queen and Princess Margaret how to do the salute.'"},{"comment_id":"939707739399900","commenter_b":"It used to be fairly common to have a cross on the flag pole representing the same thing as Christ above all.","commenter_a":"I am a Christian but, no flags are to be flown over the flag of the United States. I DO feel his frustration but, this is a no-no. God Bless America !","post_message":"Are you OK with this?"},{"comment_id":"10153797001880329","commenter_b":"This bitch you can order your kid what you want ...she's ignorant as hell I would have whooped her ass","commenter_a":"It was called marcy's diner in maine and this is what the owner posted. Threatening to get physical. She is a dumb cunt. And this is someone from maine.","post_message":"Neugebauer's diner has recently become the center of a massive controversy after she yelled at a screaming child."},{"comment_id":"620617391457056","commenter_b":"Cleavage queen","commenter_a":"Just once I would love to see Mariah dressed in a turtleneck !","post_message":"It really is the most wonderful time of the year!"}]
