[{"comment_id":"10153221680277217","commenter_b":"@username: Why do Muslim women feel desperate?","commenter_a":"So, are Muslim women ALLOWED to choose to be child free?? Not being sarcastic, it's a real question. This meme seems misleading. By the way, I think ALL women should be allowed to choose, and I think people who don't want kids shouldn't have them. However, everything I've ever read suggests this isn't an option for Muslim women (as well as in some other religions). Would like input on the realities.","post_message":"\"Don't get me wrong, I love children - just as long as they aren't mine\" #100Women"},{"comment_id":"10153847085126162","commenter_b":"Girl stfu ^^^ u dumb. That's not y.","commenter_a":"As long as her son has a decnt funeral, I dont judge her for using donations for what she needed besides funeral expenses. If it was enough for her to buy a house out of the hood Im sure she would have done that too! If she is partying and gloating about thats not cool. But a scandal after tour the death is kind of hard to deal with so...i cast no judgement.","post_message":"9-year-old Tyshawn Lee's mom is accused of spending money donated for her son's funeral expenses on a new car. FULL STORY: @webpagelink"},{"comment_id":"1300941689949097","commenter_b":"She is to evil to regret anything !","commenter_a":"Angela merkel is romancing with muslims. She will regret later","post_message":"CAN THERE BE A DUMBER COUNTRY ON THIS PLANET?"},{"comment_id":"802434323195863","commenter_b":"I support neither group. Blacks and whites need to get along. We are in a failing country that is falling apart.we need to get rid of this racism and focus on the big picture here","commenter_a":"As a member of the Armed Forces and a decorated war veteran...she does not owe me an apology. She used her platform to deliver a message while honoring a historic Black-ran group on their 50th anniversary during the one month Black history seems to be relevant. Coldplay honored the LGBT community in their performance but ironically there was no uproar over that. If anything @username you owe me, the Armed Forces, and the Veterans an apology for posting this crap and trying rally up sympathizers to further your racist agenda. Radical? Hardly....maybe you should brush up on some history and ask yourself why these organizations began in the first place before posting....oh and this...","post_message":"***BLACK PANTHER PARTY SUPPORTER AND BLM RADICAL DONOR BEYONCE OWES AMERICA'S POLICE, ARMED FORCES, & VETERANS AN APOLOGY***"},{"comment_id":"10155879050540354","commenter_b":"Stop these muslims from coming into our country. Please. Trojan horse.","commenter_a":"I can't wait to force them to bake my gay wedding cake.","post_message":"Some truly shocking statistics in this article..."},{"comment_id":"902128633188334","commenter_b":"I talked to my next door neighbors about the illegals. They were very verbally upset with the illegals. You see their whole family was born in Mexico and they all moved to Oklahoma Legally. The man told me it took them almost 12 years to get the whole family here. BUT they could have paid smugglers and had them all here in 2 years. They hate the illegals also. They said they give the rest of the Mexicans a bad rep.","commenter_a":"Welcome and thank you for doing it the right way","post_message":"Americas Freedom Fighters"},{"comment_id":"10154526330973352","commenter_b":"I also stated that this evil woman deserves prison because she knew damn well what she was doing!!!","commenter_a":"This isn't mental health issue. She knew what she did was wrong as she hid the bodies. That's not mental health issues. First thing everyone wants to make of horrible crimes like this is that It's mental health issues. Bull shit. This woman knew what she was doin so call it what it is....it's EVIL. She is an evil woman who got tired of being a mom and decided to kill her children. No empathy for this murderer. Call it what it is. There are just evil people in the world sometimes. Not mental health impairments every time a parent murders their child. She needs to rot to death in a jail.","post_message":"Pictured: The 'pregnant' Phoenix mom, 29, and her three young sons that she 'stabbed to death before stuffing their dismembered bodies in a closet and suitcase and trying to kill herself'"}]
