[{"comment_id":"10152629454892894","commenter_b":"She mad @username don't believe that hoe","commenter_a":"Aliah Tamartian Trainer Toi Magee-Taylor","post_message":"Coupled Up? Keke Palmer & August Alsina are Ridin' Around & Gettin' It [Photos]"},{"comment_id":"1046533445373310","commenter_b":"that's not fair to pres o","commenter_a":"MLK would be ASHAMED of those useless race-baiters. He would spit in their eyes himself, if he were still alive.","post_message":"How I wish we had a Martin Luther King today instead of thugs and scam-artists like Sharpton, Jackson, Holder—and Obama."},{"comment_id":"10153621477392293","commenter_b":"Holy crap. Did you even read it?","commenter_a":"UCMJ does prohibit frat w subordinates. This was NOT RAPE. Rape is not consensual. She was consenting then because he pulled away? She claims rape?? Not fair. If she wanted to be an officer then suck it up buttercup.","post_message":"A Naval Academy teacher fights to prove he’s innocent of sexual misconduct. Then a lost cell phone is found."},{"comment_id":"10153678796416491","commenter_b":"If its a libby female like killary, she'll be fine on the side of the road ;-)","commenter_a":"Dude. You left a lady on the side of the road. I don't know how you were raised, but someone needs to kick your teeth in.","post_message":"The driver said the woman was “obviously a socialist”"},{"comment_id":"350626235140891","commenter_b":"She needs to be gone","commenter_a":"Then take Kenyatta West and get the hell out of the USA I think Iran would be a good place for you .","post_message":"Hip-Hop Artist Hates America, White Americans and Conservative People!"},{"comment_id":"10152821539741051","commenter_b":"who teaches bulling in school better than teachers?there are people out there that have no business interacting with young people at all. she should be put in the stocks, in school, let her feel what he felt. sue them all back to rubble","commenter_a":"Unbelievable, how could this type of bulling be tolerated? That school needs new policy's.","post_message":"When this woman found out that her grandson had been publicly punished like this, she couldn't believe it."},{"comment_id":"10153834062371337","commenter_b":"You win the Internet today!!!","commenter_a":"Well, maybe when they introduce an HIV vaccine, she can get vaccinated.... Oh, wait...nevermind.","post_message":"Jenny McCarthy is not taking the Charlie Sheen news well..."}]
