[{"comment_id":"10152700491620779","commenter_b":"Heavens to Betsy, woman. Have you tried Fortitude?","commenter_a":"Thanks @username. I'm currently watching BB. Yes, I really am.","post_message":"Let's face it: We are currently living in the all-you-can-eat-smorgasbord era of TV viewing choices. The downside is that the abundance of stuff at our fingertips also makes it easier for jaw-dropping, mind-expanding small-screen masterpieces to come and go without so much as a peep. From a British gangster thriller to a surreal riff on twentysomething single life, click through for 10 shows you should be watching this year."},{"comment_id":"10153379026314205","commenter_b":"Seriously , I don't know how these fraudsters were able to deceive their unsuspecting poor followers. Acquiring jets and planes at their expense. This is exploitation. The worst is that , it is these followers of them that will come and defend them. So sad indeed.","commenter_a":"I posted that video a few weeks ago. Shameless. I'm bustin' a gut. Hee, hee","post_message":"Televangelists: God Says We Need Another Private Jet!"},{"comment_id":"10153576810758984","commenter_b":"Lot of good women out there but she's not one of them!!!","commenter_a":"Hillary is another Obama in a pantsuit. Maybe even worse! PPL didn't listen when Obama was exposed..... Will they listen now about Hillary?????","post_message":"I watched this over and over again to try and figure out what Hillary possibly could have been thinking. I'm still stumped. Like the news anchors reporting on this did, all I could do was laugh... Do you want to see Hillary suffer a resounding loss in 2016?"},{"comment_id":"10154080065336051","commenter_b":"@username you just piss yourself when you see women.","commenter_a":"The \"man\" isn't qualified to even be mentioned for the job. Donald J Trump is a complete and utter embarrassment to our already great nation","post_message":"The majority of Americans say that Trump is not qualified for the presidency. Do you agree?"},{"comment_id":"10154249804566509","commenter_b":"And they say white men can't jump.","commenter_a":"He just proved obama has crappy security. There have been tons of jumpers since obama became president. You would think they would have increased security by now.","post_message":"This photo shows the White House fence jumper in the middle of his attempt to go over the barrier on #Thanksgiving. @webpagelink"},{"comment_id":"1532736620362438","commenter_b":"Cool ! I am sure he wants no more illegals!","commenter_a":"Build the wall and lock your self in there","post_message":"Donald Trump speaks live at Indiana State Fairgrounds. For a close-up view, watch our stream on our website: @webpagelink"},{"comment_id":"10153337350877217","commenter_b":"This is like a long running sentance And Jimmy saville is still dead.this often crops up in papers.","commenter_a":"Yaw hear about Colbert Chischilly?","post_message":"Tributes were paid to Leslie Nielsen today but he died 5 years ago..."}]
