[{"comment_id":"10156085666465354","commenter_b":"@username Nah ..shes a Wanna be Black!!","commenter_a":"Why are these F*%^ ers not being hunted down, arrested and prosecuted as the 60's radicals were? Why do we even have an FBI????","post_message":"“The revolution is on…Off the pigs.”"},{"comment_id":"10157484651970725","commenter_b":"@username PAM she is already DESTROYING THE COUNTRY !","commenter_a":"Go trump ! So, 96% of Hillary's charitable donations went to the Clinton Foundation! Yeah, 96%, they donated to themselves.","post_message":"Unbelievable! Thank you Erie, Pennsylvania. This is a MOVEMENT! I have no doubt that we are going to WIN -- and MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"10154702328234411","commenter_b":"Trump build that wall","commenter_a":"ONLY IF THEY'RE SWIMMING BACK ACROSS THE OPEN SEWER!","post_message":"\"This policy de facto creates an open border with Mexico.\""},{"comment_id":"10153884149866130","commenter_b":"Its a joke you stupid bitches. Get over yaselfs.","commenter_a":"Ummm, kinda defeats the purpose of going out to the bar to get drunk if the bar is going to try and deter me from drinking. Wtf. Thats like my weed dealer explaining the importance of not smoking so I dont get cancer, smh. Dumb. Lol.","post_message":"One bar is getting patrons to think twice about drunk-driving by setting up a live-stream with a convicted felon."},{"comment_id":"1270891722952389","commenter_b":"@username says the woman whose profile pic says \" Make America Kind Again\"","commenter_a":"You know being born in this country is a requirement to be president.. There is no requirement to provide tax returns just in case you were wondering. If the dems win and Hillary is president you liberals better be ready to open your homes to refugees because they will be stuffing them into this country and fast as they can. The dems only care about one thing.. Power.. Staying in power and keeping others from having any including the citizens which is who should have the power. Take a look at what's happening in Europe right now it's not long before its happening here.. But the media won't report it because the dems will try to keep it from you. That's right the media is biased.. All media one way or the other.. So drink your flavor of koolaid and get ready because the liberals in this country are coming ...","post_message":"Great question, Mr. President. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153271978657411","commenter_b":"White trash.","commenter_a":"I don't really care.","post_message":"HAPPY BIRTHDAY, #FLOTUS! First Lady Michelle Obama is celebrating her 52nd birthday today!"},{"comment_id":"396582543845311","commenter_b":"Richard J. Lindner She Did Commit Perjury, Destroyed Evidence Under Subpoena GET OFF THE H-TRAIN","commenter_a":"Repost: Federal Law: Title 18. Section 2071 Can it be any clearer? Former United States Attorney General Michael Mukasey tells MSNBC that not only is Hillary Clinton's private email server illegal, it \"disqualifies\" her from holding any federal office. Such as, say, President of the United States. \"If you do this or that bad thing, you've essentially disqualified yourself as being the leader of the free world,\" said Mukasey, referring to the illegal server and the illegal handling of classified materials. Mukasey specifically points to one federal law, Title 18. Section 2071. For those of us who do not have United States Code committed to memory, here's what it says: (a) Whoever willfully and unlawfully conceals, removes, mutilates, obliterates, or destroys, or attempts to do so, or, with intent to do so takes and carries away any record, proceeding, map, book, paper, document, or other thing, filed or deposited with ...","post_message":"BAM!"}]
