[{"comment_id":"1930654800491749","commenter_b":"Those idiots need to be kicked out of our country, not immigrants","commenter_a":"What a creepy group of corruption.","post_message":"That was quick –> Most national security advisors spend more than two and a half years in the job. Mike Flynn topped out at 24 days before resigning last night. President Donald Trump and Vice President Mike Pence claim they did not understand that Flynn was regularly in contact with Russian officials, including on the day Barack Obama imposed sanctions on Russia for interfering with the US election. That relationship could become the subject of investigation in Congress — at least one Republican, Marco Rubio, wants more information and has suggested combining it with a broader investigation into Russian meddling. To echo a Watergate-era inquiry from the late Sen. Howard Baker, “What did the president know and when did he know it?”"},{"comment_id":"10152824862457212","commenter_b":"Yes of course. The middle aged woman who comes from a upper middle class family. Is going to tell people how to make it. Please go on.....................","commenter_a":"Cue the Conservatives of this state to tell how they worked so hard for their money, and it is everyone elses fault the don't have the means they do. In 1...2...3...","post_message":"Seeking to assess if the Horatio Alger, 'rags to riches' narrative...remains viable, researchers measured the odds of a child born to parents in the bottom 20% of income earners reaching the top 20%. They then contrasted the chances of climbing the ladder in the U.S. to that in other developed countries. #News9 #CBSNews"},{"comment_id":"980977625292266","commenter_b":"Send them all back to where they came from. We don't need the ANY illegals","commenter_a":"once again in the world of idiots we see how stupid people can get. illegal in country, on welfare, sucking tax payers money and they say they have rights? the only right they have is to get the hell out","post_message":"A group of illegal aliens filed a federal law suit in Georgia for what they claim to be a violation of their constitutional rights by denying them driver's licenses."},{"comment_id":"474511766072737","commenter_b":"Can't do that until you remove the Muslim president who encourages them to take over.","commenter_a":"we need to take our Country back. We outnumber them let stop the insanity. Dont let any mosks be built in this country. We cant build Churches in theirs. If they dont like it here than leave. No one would care.","post_message":"Muslims force this school to ban Christian holidays.  America is under attack, this is treasonous.  'LIKE' if banning Easter is WRONG!"},{"comment_id":"10155029818006543","commenter_b":"Senator Wazzy got slapped on by Senator McMackinz. Tell a ho where she's at! @webpagelink","commenter_a":"Mitch McConnell email inbox is full. Let jam his faxes with the Coretta Scott King letter now. DC Office : (202) 224-2499","post_message":"In an extremely rare rebuke, U.S. Senator Elizabeth Warren was cut off while reading a 1986 letter by Coretta Scott King on the Senate floor @webpagelink"},{"comment_id":"10153301053671770","commenter_b":"What do they call a female dog ?","commenter_a":"He wants back in the white house so he can shame us again.","post_message":"Clinton let out her inner dog during a speech Monday."},{"comment_id":"10155108703501320","commenter_b":"Take a good look at the non Christians. What ever you do this the least of theas you do to me","commenter_a":"No one, has the right to decide about the live of a anborn child. Every one has the right to live and be loved","post_message":"WATCH LIVE: We're at the The March for Life where thousands of anti-abortion activists are marching on Washington."}]
