[{"comment_id":"10155014119221178","commenter_b":"Democrats have always gotten away with MURDER!!","commenter_a":"Accountability was not a word he knew--or enjoyed.","post_message":"Talk about a major understatement from The Daily Beast."},{"comment_id":"10152734015363525","commenter_b":"going to get cold tonight!!","commenter_a":"Wtf...???","post_message":"Road trip to Lakewood Ranch. Who's in?"},{"comment_id":"922573247835730","commenter_b":"Two women had enough of him, despite his wealth, and headed for the hills.","commenter_a":"I dont understand how a man with everything can be filled with so much hatred","post_message":"Yep, that just about sums up Donald Trump's campaign.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"928454370547645","commenter_b":"Because only girls can get raped","commenter_a":"I am so glad that I don't have a daughter. I'd be terrified for her in this world we live in. Heartbreaking.","post_message":"'The most disgusting, sickening' gang rape at Spring Break beach party"},{"comment_id":"10153593873146130","commenter_b":"Bobby McDonald. you are 100% wrong. the only way felons and nut jobs can get guns illegally is through criminal connections which already increase their chances of arrest. why you would rather want to get rid of BGCs so criminals can get guns in a Walmart is something so irrational and naive i simply cant understand that kind of thinking.","commenter_a":"It's incredible that there are people out there that call themselves responsible gun owners but have a problem with background checks","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153948812912434","commenter_b":"'@username you are a AntiWhite and you are for White Genocide that is why you call me a Nazi. ALL White countries and ONLY White countries are being flooded with third-world non-whites, and Whites are forced by law to integrate with them so as to “assimilate,” i.e. intermarry and be blended out of existence. Massive immigration and forced assimilation is genocide when it’s done to Tibetans in Tibet. When it’s done to Whites in White countries, it’s called “diversity.” By UN Convention, it’s genocide: “Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part.” Diversity is a code word for #WhiteGenocide!","commenter_a":"White genocide is real and we can prove it. Learn the truth. @webpagelink","post_message":"The threat of ‘white genocide’ is a conspiracy theory, promoted by elements of the so-called alt-right and fueled by anxiety over fertility and immigration trends, that was popularized by South Carolina segregationist Bob Whitaker. The idea also comes up in the writings of Dylann Roof, who murdered nine black parishioners at a church in Charleston."},{"comment_id":"10154132565089087","commenter_b":"Thats it?? Popping a bottle of champagne??? He wasn't fucking any one...SHE WAS....GIVE ME A BREAK!!!","commenter_a":"Treasonous Clinton is going to be burned on Bills rapping of women when he was the AG of Arkansas that right Clinton you covered it up","post_message":"'There’s been a lot of talk about sex tapes today and in a strange turn of events, only one adult film has emerged today and its star is Donald Trump,' said the Hillary Clinton campaign in a statement."}]
