[{"comment_id":"10152797657587144","commenter_b":"Those 'additives' include vitamins and minerals. I'll take it.","commenter_a":"Oh yeah, I just remembered why I unliked @username in the first place.","post_message":"'A jug of almond milk containing roughly 39 cents worth of almonds, plus filtered water and additives, retails for $3.99.'"},{"comment_id":"1641330872574045","commenter_b":"His payment for the presidency","commenter_a":"I just love hearing you babies cry. 8 years of total bullshit from your man Obama, and we never rioted, burned down neighborhoods, dressed up as vaginas and marched (like a bunch of embarassing idiots), destroy businesses, drag old men out of their cars to beat the shit out of them for an Obama sticker, and the list of shame goes on. Trump hasn't been president for 90 damn days and you crybabies are already curled up in the fetal position, sucking your thumbs, squealing and kicking like little piglets. You guys make me smile real big. You're the biggest pile of disrespectful pussies on the planet! Suck it up buttercups, TRUMP IS YOUR PRESIDENT! AND GOD BLESS DONALD TRUMP!","post_message":"This isn't a joke."},{"comment_id":"682546678578123","commenter_b":"Historical facts, not rumors, not hearsay just plan undeniable facts. (This is just a small percentage of a much longer list ) Of the two candidates running for president... Only @username was caught lying to congress. Only @username was fired from a job for being unethical. Only @username deleted 30 some thousand emails after she was ordered to hand them over to the Fed. Only @username had that same computer wiped clean by professionals. Only @username got the rapist of a teenage girl off on rape charges then laughed about it. Only @username lied to the American people about Benghazi. Only @username lied to the American people about her emails. Only @username lied about being under sniper fire. Only @username lied about lying to the American people. Only @username was involved in ' Cash Cow ' Only @username has a long list of scandals. Only @username nationally belittled her husband's ...","commenter_a":"If you hate her so much why do you sad feckers bother to be here? And have you actually looked at Trump? The rest of the world are scared shitless that he'll get in. Oh, apart from Russia.","post_message":"Born before women could vote, Ruline just cast her ballot for Hillary in Iowa today. Join her: IWillVote.com"},{"comment_id":"10157410522280294","commenter_b":"Love these type of storms..","commenter_a":"Thanks for the pictures. Please stay safe. If you have reports of any damage please let us know","post_message":"Dark storm clouds roll into the Cleveland area"},{"comment_id":"1665137810414324","commenter_b":"Beyonce is a racist and a cop hater.","commenter_a":"God Bless You.","post_message":"Whoa, this outspoken Obama critic didn't hold back at all when discussing Beyonce's Super Bowl halftime performance... and he pointed out EXACTLY what made it so hypocritical.  If you thought Beyonce's halftime performance was unacceptable, spread this video far and wide,,,"},{"comment_id":"10154886159283010","commenter_b":"Hippie bitch is a nobody","commenter_a":"The left is still jockeying for attention...and this is the best they've got..Less than impressive..","post_message":"A political twist on a holiday classic."},{"comment_id":"495965727273607","commenter_b":"we don't want that pussy here anyway","commenter_a":"Whatever","post_message":"Bruce Springsteen and Bryan Adams are HUGE Hypocrites!!!  They play their 'music' in countries that throw gay people off buildings, but ban perverts from going into a little girls room and all of a sudden they got a problem???P"}]
