[{"comment_id":"10157208654565294","commenter_b":"Preach!","commenter_a":"God I wish we could stop talking about this guy. Who cares he's a waste and obviously doesn't want to try and help himself in anyway. Glad he's at least not on the Browns any more.","post_message":"\"I hate to say it but I hope he goes to jail. I mean, that would be the best place for him.\""},{"comment_id":"1480804778605937","commenter_b":"FEAR-MONGERING ULTRA-RIGHT FASCISTS!","commenter_a":"Well, there's this...@webpagelink","post_message":"Washington State Republican Party chair Susan Hutchison​ is holding a news conference after the Washington state attorney general announced a lawsuit against President Donald Trump over the immigration executive order. >> kiro.tv/WASuesTrump"},{"comment_id":"848078538560940","commenter_b":"Only fucking idiots want her","commenter_a":"Am I the only person who likes her? Yikes.","post_message":"Hillary Clinton could finally shatter that glass ceiling."},{"comment_id":"10153444962923984","commenter_b":"Yes since he is their best muslim buddy","commenter_a":"Duh Yeah","post_message":"Well, this is worrisome. It's bad news for pretty much the entire Middle East, except for ISIS.  Do you think Obama has entirely botched the ISIS situation?"},{"comment_id":"612744012249511","commenter_b":"Absolutely! Prison is where she belongs for many reasons.","commenter_a":"And she should go to the one named after her husband and put in solitary confinement so we never have to hear from this troll again","post_message":"A judge just presented new evidence that could put Hillary away for good.  Finally. Put her in jail already.  Do you agree Hillary belongs in prison?"},{"comment_id":"10153147282168701","commenter_b":"Shut up Leah Jesus Christ.","commenter_a":"GUILT BY ASSOCIATION! I GUESS IN AMERICA YOU CAN BE HELD RESPONSIBLE FOR WHAT OTHERS DO, I THOUGHT YOU WHERE INOCENT UNTIL PROVEN GUILTY, BUT THE WHORES OF SOCIETY-AKA THE NEW STATIONS, REPORTERS, OREGONIAN, HAVE TRIED, COVICTED, AND SENTENCED A MAN FOR CRIMES HIS GIRLFRIEND COMMITTED, SOME PRIOR TO THEM EVEN MEETING BUT SOME HOW IT IS HIS CRIME, SHAME ON YOU WHORES!!!!","post_message":"Here's the full resignation letter from Gov. John Kitzhaber, who says: \"I understand that I have become a liability to the very institutions and policies to which I have dedicated my career and, indeed, my entire adult life.\""},{"comment_id":"10153200495384411","commenter_b":"leave the fukers there ,revoke their passports","commenter_a":"They weren't British....","post_message":""}]
