[{"comment_id":"1005063259586728","commenter_b":"I don't mean In Syria. Whatever safe country they might be in. Buy them something Since ur gov has voted against letting refugees in the USA.","commenter_a":"Or buy them a home where they are.","post_message":"Kudos to Moore for taking a stand in the name of American compassion."},{"comment_id":"10152748736401051","commenter_b":"To bad. You live in this Country and better ahear to our Laws. If you do not want to do it \"go back out of the US.","commenter_a":"Sucks to be her.","post_message":"This woman is very offended by what police asked her to do. The police say they did nothing wrong. Decide for yourselves who is right."},{"comment_id":"10154267425314160","commenter_b":"Another nasty woman on the side of evil...GOOD WINS","commenter_a":"and you are Madeline Not So Bright","post_message":"\"There is a great term the Soviets used to use.\""},{"comment_id":"919624348099683","commenter_b":"They don't want to assimilate; they want to take over. That's why ovomit is here","commenter_a":"Quit allowing Muslims into our nation as immigrants...we do not need people that will never assimilate into our culture....their god Is not our God!","post_message":"ISLAMIC TERRORISM: Texas Gunman Mother Says He Wasn Religious Until Attending Phoenix Mosque, Meeting Elton Simpson @webpagelink"},{"comment_id":"1185646658122029","commenter_b":"Yeah, thanks fer nuthin'. Don't need some guy's forgiveness for anything. Not lookin' for it, ain't askin' for it.","commenter_a":"No one but God can forgive sins. The Pope and priests are men.","post_message":"BREAKING NEWS: Pope Francis will allow Roman Catholic priests to absolve women who have had abortions if they seek forgiveness, the Vatican announced Tuesday."},{"comment_id":"10154489000406336","commenter_b":"She shouldn't even be in this election she should be in prison.","commenter_a":"We all have to watch Hillary very closely as she will surely try to rig the general election like she had done during the primaries. What was recently exposed at the DNC she most definitely should be disqualified. Goes to show that the Clintons are corrupt, above the law and play by their own rules.","post_message":"\"I think what I'm offering are proven results. I think what I'm offering is that we can build on where we are.\" On \"Fox News Sunday,\" Hillary Clinton slammed Donald J. Trump, claiming that he has offered nothing to help people, while she has an agenda to increase jobs, increase incomes, and make the economy grow and be more fair. @webpagelink"},{"comment_id":"991037997658085","commenter_b":"Bitch didn't get cheated, she got outplayed. Sour grapes!","commenter_a":"The American people have had enough I being manipulated by candidates that don't know how to quit when they're beaten. Hey Idon't know where thus 2nd ballot thing comes from but they better knock it off before they a billion pissed off Americans !!","post_message":"CRUZ POACHES NEARLY ALL AZ DELEGATES Jan Brewer: 'I Got Cheated!'..."}]
