[{"comment_id":"1663378140627092","commenter_b":"wow cant wait to see u guys in 10 years w ur sugar daddy/ies, and ur lavish lifestyle its gonna be great","commenter_a":"@username time to sign up😂","post_message":"This summit actually teaches young women how to score a sugar daddy..."},{"comment_id":"879835912051831","commenter_b":"I wish her big mouth would go away ; what a disgusting woman","commenter_a":"A message for Rosie. It is one thing for people to think you ignorant and it is another for you to open your mouth and prove it.","post_message":"Tom Selleck is awesome!"},{"comment_id":"1793816267524585","commenter_b":"Amy you should be ashamed for trying to get people to vote for that criminal!!! The things she's going to do to our country aren't going to effect you because you have money !!!","commenter_a":"I'd be much more concerned if I voted for someone who was indited and convicted of high crimes against the United States and humanity!","post_message":"\"Your voting history is public record.\""},{"comment_id":"10155254328488690","commenter_b":"ALL THOSE WOMEN AND THEIR HUSBAND ARE ALL TERRORIST ..THEY SHOULD HELP THEM SELF'S AND SOLVE THEIR PROBLEMS NOTING ONE CAN DO TO STOP THEM FROM DOING EVIL IS INBORN IN THEM ....THEY ARE BORN WITH EVIL AND GROW UP WITH EVIL SO LET THEM PAY FOR THEIR EVILS","commenter_a":"Is today that you learned to join in hand to fight boko haram... What kind of leaders are you... You waste much time and innocent people lost their lives... The same thing happens in Libya president was been killed. Non of African leaders contribute a trip to help him... Everything UN and we gain nothing... Africa let's stand for our own... Bob Marley was a mixed blood yet he loves Africans and fight for you throughout his musical... Africa unit...","post_message":"\"The governments of Cameroon, Chad, Niger and Nigeria engaged in fighting against Boko Haram must take seriously their responsibilities to protect civilians.\"  - Winnie Byanyima & Jan Egeland"},{"comment_id":"10156096512215725","commenter_b":"NNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNN","commenter_a":"NNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNN","post_message":"Thank you New Hampshire! Together we will #MakeAmericaGreatAgain !"},{"comment_id":"387651254692803","commenter_b":"Really Kathy tell that to the vets that the repubs cut spending on you dumb woman!","commenter_a":"GOP don't give a G/D about anyone America please wake up !!!","post_message":"What did you think of this response to the President's State of the Union address?"},{"comment_id":"642456822585523","commenter_b":"ong! snd the PC powers that be will make a laughing-stock yet again of America & our Right to defend Our Laws!!!","commenter_a":"You get detained or arrested for saying the word \"bomb\" in an airport and this turd gets away with this? If it were a white boy, we'd never hear the end of it.","post_message":"JUST IN..."}]
