[{"comment_id":"1706668932888007","commenter_b":"Hillary is just another branch of the incompitent Obama tree. Only difference is she's a criminal and she'll be far worse for this country because she'll have to prove a point soley because she's a woman. Sorry, but I don't vote based on race or sex and I certainly won't vote for someone who has spent most of their political career filled with lies and cover ups.","commenter_a":"I CALL B.S....HILLARY HOMERS,...VOTE Donald Trump 2016..'THE MAN FOR AMERICA'.","post_message":"Donald J. Trump's odds of winning the Republican nomination dropped 3 points on the Political Prediction Market after the #GOPDebate. Meanwhile Ted Cruz's odds ticked upward..."},{"comment_id":"1285345191558532","commenter_b":"She is the Bitch.!","commenter_a":"love Hillary...Kill Babies.... $$$$$%","post_message":"The star actress makes an excellent point.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153325885524087","commenter_b":"Such an ignorant cow!","commenter_a":"Hideous hag.","post_message":"“They can wait if they like until next November for the actual balloting, but Donald J. Trump   was elected president tonight.” Ann Coulter tweeted."},{"comment_id":"127969217779704","commenter_b":"'@username go away criminal","commenter_a":"Great job police and K9. POS got what he deserved. Just hope the dog doesn't get any disease from the scumbag!!","post_message":"A police dog takes a big bite out of crime, subduing a carjacking suspect involved in a high-speed chase and spectacular injury crash.  Eyewitnesses capture the drama on camera as the suspect tries to flee. Eyewitness News live with the condition of the innocent driver injured in the La Puente crash. Tonight at 11 from ABC7. abc7.com/@username/"},{"comment_id":"1283735711683013","commenter_b":"horrible woman","commenter_a":"How bitchy she is...very bad attitude though","post_message":"The Hungarian camerawoman who tripped and kicked migrants has been sentenced."},{"comment_id":"10155183488410725","commenter_b":"He's an idiot and so is she. Standing there looking at him talk his crap. It's ridiculous.","commenter_a":"He's a freaking moron","post_message":"Kanye West's rushing the stage at last night's Grammys wasn't a joke after all, it seems----> @webpagelink"},{"comment_id":"10153475674267452","commenter_b":"Illegals for a living too.. And pay taxes and guess what they don't get a refund. Securing borders? Fix the immigration system it's hard becoming legal.. The system is he problem not the illegals..","commenter_a":"Congratulations on not being an illegal immigrant and working for a living. Trump is not against immigrants he and many other Americans are against ILLEGAL immigrants. Oh and your protest in Canada doesn't mean a thing in the USA.","post_message":"In protest of Donald Trump’s immigration policies, a construction worker hung a Mexican flag atop the Trump Tower in Vancouver, Canada. abc7.la/1W7pFVh  “While working on your tower, Mexicans didn't steal anything nor raped anyone. We just did the best work we could possibly do, for ourselves, our families and the future tenants in your building.”"}]
