[{"comment_id":"10153631429237098","commenter_b":"Get your mind out of the gutter ladies.","commenter_a":"What a pig, No little girl's first introduction to sex should be with some slime like this.","post_message":"#BREAKING - The dental assistant was arrested over the weekend for allegedly molesting a sedated 8-year-old girl  Police say there may be more potential victims"},{"comment_id":"10153335574974384","commenter_b":"A complete waste of good female human flesh.","commenter_a":"Communist scum.","post_message":"Celebrating Women’s History Month by honoring women of \"Supreme\" achievements! Indeed, an inspiration to us all."},{"comment_id":"10153874531382464","commenter_b":"IF YOU ARE REALLY WORRIED ABOUT AMERICA CHRISSY ....... DUMP THE TRUMP!!","commenter_a":"Cruz lied about what he did with Carson! CNN fact checked and it was just like everyon knew it was. Cruz is a Liar and a terrible man! He threw Carson under the bus! Rubio puts out the same speech he and his family migrated here and had no money and how he supposedly walked dogs for spare change whileforgetting to mention that the dogs he walked were gaurd dogs for his mother and fathers drug dealings. Both which spent time in prison and were with a Cartel. I am not saying that as a child Rubio was guilty of the drug dealings.What I am saying is that he is giving peoplea false storyof some made up life. Anyone can fact check eitherof these two lying cheating thieves. I wouldn't let either of them wpe my dogs paws! Both are liars and career politicians. As for Bush, His familyuses eminant ...","post_message":"A super sale for #SB50. Get your #TeamCruz jersey for just $50: @webpagelink"},{"comment_id":"673748802758301","commenter_b":"She is probably really a white man","commenter_a":"Bitch is dumb and racist","post_message":"Give it up Mosby."},{"comment_id":"10153412861986167","commenter_b":"A bunch of false prophets and their followers, sickening.","commenter_a":"First of all, for those who wish to criticize my typos complain to google translate. I'm dictating this and I don't have time to go back and correct typos. When it comes to SOCIAL ISSUES, topics like gun control, abortion, gay marriage etc voters who latch on to these things miss the big picture. The big picture involves having a viable economy in which to have debate about social issues. An economy cannot survive on social issue focus. It is a fact that 70% of all entitlement Dollar goes to bureaucrats not to the poor. @webpagelink To this day paychecks from the government are being dispersed to illegal immigrants, prisoners and dead people. There are perhaps hundreds to thousands of programs that have been budgeted by the government which always end up taking longer to implement and always cost more than expected. Under Hillary Clinton and Obama, six billion dollars ...","post_message":"He also thanked the star of Duck Dynasty."},{"comment_id":"10153996640170326","commenter_b":"Illegal aliens have Constitutional rights?","commenter_a":"Why is it every time Donald gives a semi sane speech, the media says he's pivoting? How many times is this now? His speeches are the same old thing. I'm going to build the wall. I'm going to ban Muslims. I don't care about constitutional rights. I will trample over all those that oppose me. I will be ruler of America!","post_message":""},{"comment_id":"10154796294188256","commenter_b":"Hahaha poor Kellog was trying to introduce cereal to inbreds that eat steaks and drink Budweiser for breakfast. I bet they realized that was a wade of money!","commenter_a":"That will not bring in any more business, only lose customers..","post_message":"Kellogg is pulling its ads from the website Breitbart News, the right-wing news organization whose former chairman Steve Bannon was tapped as a top adviser to President-elect Donald Trump ."}]
