[{"comment_id":"10153661042541523","commenter_b":"You dumb white bitch!! THE SAME WAY YOU CELEBRATED CHRIS FAIRLY, AMY WINEHOUSE, AND THE REST OF THE HEROIN ADDICTS IN YOUR Neighborhoods......I will be so glad when your evil race is nearly extinct! Take your evil back to the caves of Europe!!!!","commenter_a":"RIDICULOUS!! The freak had mental issues and died of an overdose- why would a church celebrate this idiot??","post_message":"A Tulsa church’s tribute to Prince is going viral."},{"comment_id":"10153448398281350","commenter_b":"She lied to get jobs","commenter_a":"Why is ok for Bruce Jenner to claim to be a woman and not ok for Rachel to be black if that is what she wants ?","post_message":"\"I did feel at some point I would need to address the complexity about my identity.\""},{"comment_id":"10153134477163984","commenter_b":"Already too late!! Enforce the law that is already on the books, secure the border and there would be no need for immigration reform and less deportations!!! No jobs for the American Citizens now, so let's grant amnesty to 5 million illegals!! That will get the economy and the job market rollin!!!","commenter_a":"No person has every done more to harm the best nation in the world than this man ! I am surprised a patriot has not shot him by now ?","post_message":"This is one of the scariest things I have read in a long time. If Americans don't wake up, it could soon be too late.  Spread the word about this danger."},{"comment_id":"716457901822319","commenter_b":"You the ugly one!","commenter_a":"She know she UgMo...lol..","post_message":"Isn't this a great response when they questioned Serena about her beauty?"},{"comment_id":"10153180567873690","commenter_b":"its for this reason lisa muslims want to have it all they fight amongst each other blame the west and on top of it want sympathy from westerners as you said americans fought to be where america is today we still struggle with our own issues but theres a constant progression all be it slow .. why is it that muslims are dying to come here ? why cant they look around at the state of their people and see its something wrong with their way of life ? why is the rest of the world capable of governing their own but arab leaders oppress and steal from their citizens speak to arabs off record they all say they hate arabs and wish they werent arab .. very telling .","commenter_a":"my favorite is when muslims say 1400 years ago christians did this or that f off! the world has moved on everyone except muslims. ha and ohh in the time of muhammed this or that again f off that was 3500 years ago not relevant .","post_message":"Opinion: The religious identity of violent perpetrators is only highlighted when they're Muslim. @webpagelink"},{"comment_id":"10153374746118812","commenter_b":"Reality check she removed all courage and self respect leadership. What is he but a man in training....... Whites love when we humiliate each other to protect the massa. She need to know she planted a seed that will resp bitter fruit","commenter_a":"Asllan Kacanolli Flamur Kacanolli","post_message":"He's the boy seen around the world being forcefully pushed from the Baltimore riots by his mother. And this is what he has to say about it..."},{"comment_id":"10154739340963812","commenter_b":"HES STICKING TO BUILDING IT GOOD FOR YOU TRUMP BUILD THE WALL BUILD IT TALL","commenter_a":"Cause both of them know a wall isn't gonna happen, whether he wins or not!","post_message":"Donald J. Trump says that while he had a \"constructive\" meeting with the Mexican president, they \"didn't discuss\" who would pay for the border wall."}]
