[{"comment_id":"1225877584098936","commenter_b":"Build a wall!! That'll stop em!! Bahahaha","commenter_a":"El Chapo was there.","post_message":"The 'super tunnel' – eight football fields in length – was discovered along the U.S-Mexico border south of San Diego.  via NBC 7 San Diego"},{"comment_id":"1400798166615856","commenter_b":"Bye bye bitch","commenter_a":"KICK ROCKS, THAT'S RIGHT RUN RABBIT RUN","post_message":"BYE! You won't be missed."},{"comment_id":"10153978466591002","commenter_b":"These are Outlaw Motorcycle Gangs..not Motorcycle Clubs..Outlaw Gangs are nothing but Thugs","commenter_a":"I am in the minority here, but I feel safer with motorcycle clubs than I would anyone else. I would not turn away of I walked into a place of business and seen club memebrs in the same place. They don't just go out and rob and kill people because they want to. You can't compare existing clubs to SAMCRo from Sons of Anarchy. This is a TV show. Hell, we should have the clubs patrol the streets. Think about that one!","post_message":"After the Waco shootout this weekend, outlaw motorcycle gangs are again in the spotlight. Roger Weber takes a look at local biker gangs: @webpagelink"},{"comment_id":"10153861731493352","commenter_b":"Beat you make ass. Seems like that's what the people in the world needs.. #anasswhipping","commenter_a":"Haha. Wow.","post_message":"Woman frantically calls police after she finds a naked intruder inside her house taking a shower and doing his laundry"},{"comment_id":"1174478745905487","commenter_b":"The hormonal teenager that's checking people's bags is supposed to make us feel secure?","commenter_a":"I would rather be inconvenienced than shot why I watched a movie","post_message":"The chain said the procedure would inconvenience guests but provide better security."},{"comment_id":"1295020463887979","commenter_b":"hes already done good and not even president yet","commenter_a":"Where is your white racist president that said he was going to send them all back out of the United States our country????","post_message":"Yikes..."},{"comment_id":"1038851362838059","commenter_b":"Merry Christmas from your Muslim neighbors! Fighting for #AmericanUnity Like us on FB #AMOT American Muslims in Opposition of Terror","commenter_a":"Merry Christmas, Hillary & to your family!","post_message":"Can't think of a better day than one with family, food, and the best gift of all: a new grandchild on the way! Merry Christmas. -H"}]
