[{"comment_id":"10153723307413037","commenter_b":"RideAustin doesn't even have an Android app yet. On the other hand, Fare has an app like Uber & Lyft, does the required background checks, offeres a way to schedule an upcoming ride and to choose preferred drivers....and it is all working now...as in this minute. Download the app and use me for a reference: Lynne3. @webpagelink","commenter_a":"Give our City Council a call...maybe they will give you a ride. @webpagelink","post_message":"The company says it will pay for fingerprint checks. Are you likely to give this company a try?"},{"comment_id":"10153948150211680","commenter_b":"Someone has butt hurt, I'll keep licking my windows while you keep hoping for your 72 virgins.","commenter_a":"Is Trump seriously just now realizing his supporters are a bunch of window-licking water heads? Donald, you are talking to the craziest people in the country. You could literally take off your shoe mid-speech, hold it up to your ear, say you’re getting a call from Batman and they would be quiet until you hung up your shoe.","post_message":"Donald J. Trump: \"Premiums are going to go up at 116%...Unless I get elected, in which case, you won't have to worry about it.\""},{"comment_id":"1069240676520375","commenter_b":"I'm confident Mr. Trump is the answer to America's future. With Obama (or Clinton) . . . America had no future. God Bless President Elect Trump.","commenter_a":"Depends on whom U ask?! Do not TRUST him. He will NOT b under a microscope as Pres. Obama was. He will NOT make America great...agn This country will never UNIFIED....","post_message":"Yes or no: Will Donald Trump be a good president?"},{"comment_id":"10154818512036729","commenter_b":"Some people are just slow to get it.","commenter_a":"Polls should mean nothing, she should be in jail. She represents everything wrong in government.","post_message":"Whoa!"},{"comment_id":"1238033529550008","commenter_b":"Cute blonde catching giant gator. There's no race problem here, chill out!","commenter_a":"If this \"Aligator\" was black the outcome certainly would have been different!","post_message":"'Godzilla' did not take kindly to being restrained by alligator hunter Christy Kroboth @webpagelink"},{"comment_id":"10152744164338645","commenter_b":"@username....Sounds like you are the racist here calling @username \"Mr. White Man\" with the pea brain...maybe you are the one with the pea brain!","commenter_a":"Please don't shoot the young black ARMED CRIMINAL, it might start another riot!","post_message":"Police investigate an early morning armed robbery at an area Wal-Mart store."},{"comment_id":"10154566623729877","commenter_b":"Copycats!","commenter_a":"Obsessed with Obama like the petulant envious kid trying to copy everything related to their nemesis!","post_message":"The Trumps just don't plagiarize speeches — they also lack originality when it comes to cakes. Go figure."}]
