[{"comment_id":"10156216618090389","commenter_b":"She'll get away with everything , just wait and see.","commenter_a":"I bet she gets away with it that's the way the Clinton's roll","post_message":"Those emails might not be about yoga or Chelsea's wedding. Do you think Hillary is finally feeling the heat?"},{"comment_id":"10153961406315695","commenter_b":"Praying now!","commenter_a":"@username Redemption Baptist Church Carissa Byrd please pray for this baby. She is Ron's daughter's cousin.","post_message":"“I just laid down with him and gave him one finger and told him to squeeze and just stay with us. Just keep looking at me,\" the boy's father said."},{"comment_id":"10152633233581680","commenter_b":"women are human beings that can die from forced pregnancy.","commenter_a":"A baby is not a CHOICE its a human being thats alive.","post_message":"“Congrats, you’ve earned this for trying to deny women their right to choice,” the note inside read. “Mind your own uterus.”"},{"comment_id":"10154394005871337","commenter_b":"I love Salma Hayek's ass.","commenter_a":"i like the scene in wild wild west, where salma hayek shows her naked behind. nice butt.","post_message":"Will Smith is really, really sorry about Wild Wild West..."},{"comment_id":"1075861685791148","commenter_b":"#Bernieorbust #NeverHillary #HandcuffHillary","commenter_a":"Remember any Bernie supporter who does not support the Democratic nominee is doing a disservice to their candidate.........Maybe they tune out the part of every rally of Bernie's that \"slams\" Donald Trump..........","post_message":""},{"comment_id":"498847790306569","commenter_b":"Scott, the guy was born and raised in New York City, the \"Wall\" you speak of would ideally be built to keep Mexican citizens from illegally entering the U.S. The \"Wall\"you speak of will not keep U.S born citizens off of the terrorist list, nor will it keep them from being bigoted disgusting pieces of shit who intentionally hunt down large groups of unarmed people and kill them because of their sexual orientation.","commenter_a":"I blame that peice of shit obama.stop letting in these fucking idiots. Build a fucking wall now! !!!","post_message":"Officials have started removing bodies from inside an Orlando nightclub where 50 people were shot and killed.  Sunday night, workers brought four bodies on stretchers out of club Pulse and loaded them into white vans. The action was repeated over and over."},{"comment_id":"1018807534853645","commenter_b":"RIP what a good man","commenter_a":"Inspiration for more acts of random kindness towards strangers. What an amazing guy. So sad :(","post_message":"\"I still cannot believe it. I thought for sure I would get the chance to see him again, give him a hug and thank him at least once more in person.\""}]
