[{"comment_id":"10154306785891130","commenter_b":"Hillary's crimes against women will get the best of her.","commenter_a":"Bush was 33, Trump was 59, its easier to fall and be impressed by a rich man at that age Trump should have act like the grown up. Trumps ego will get the best of him yet.","post_message":"But Donald J. Trump is still a presidential candidate."},{"comment_id":"1665486166837473","commenter_b":"Globalization needs to be ended for this country. Fight against UN agenda 2021/30 with every breathe you have!!!!","commenter_a":"It's a new day the second revolution has come we are taking back America and there will be some changes around here.Joinn us or leave us it's your choice.","post_message":"Everyday patriots..."},{"comment_id":"10153695954333984","commenter_b":"Carly should be in the prime time debate","commenter_a":"We need a female leader on that stage who isn't whining \"i'm so week and gutless I need a man or goverment to get me better pay and by my birth control for me.\" A real grown up woman who can take a blow and still be standing. Go Carly go","post_message":"Despite a pretty big poll surge, this 2016 Republican candidate may be kept off main debate stage again...  Do you hope to see Carly Fiorina in the next debate?"},{"comment_id":"10153653127786336","commenter_b":"Obama should be deported with all of the illegals...","commenter_a":"make me sick","post_message":"\"The Obama administration is very friendly to individuals who are transgendered who are illegal immigrants. They provide them taxpayer-funded hormone treatments [and] special accommodations.\" – Tom Fitton, president of Judicial Watch, Inc."},{"comment_id":"1129640290462357","commenter_b":"My absolute joy will be when (not IF) Madame President is officially elected and we can all look back and say, once upon a time, Trump took out 15 Republican men, but 1 Democratic woman is the one who took HIM out. Music to my ears!!! I can't wait!!! All the haters NEED to get used to hearing Madame President. PERIOD, END OF DISCUSSION.","commenter_a":"I don't know what I'm more excited for- that Hillary is practically a guaranteed win or that I get to watch Trump fail miserably in front of the entire country.","post_message":"The Republican end times are here."},{"comment_id":"10154260914771130","commenter_b":"@username and she's gonna tell her fake mom too!","commenter_a":"@username and @username this reminds me of some of our students.","post_message":"Boy, bye. 👋"},{"comment_id":"10153584221598352","commenter_b":"Throw her dumb ass in jail.... She'll get a lot of attention","commenter_a":"Aye u had sum true to heart good ass friends. U messed up big time","post_message":"Fraudster who made her friends shave their heads in her honor after claiming she was dying of cancer admits she made it up for attention"}]
