[{"comment_id":"2471637393058961","commenter_b":"@username still better than that lying bitch you voted for","commenter_a":"Why do you guys keep asking the same stupid question...I guarantee you no one on the right has changed their minds...now maybe some on the left came to their senses","post_message":"Would you like to see this duo in the White House again?"},{"comment_id":"10155303364265603","commenter_b":"For exposing corruption and telling the truth...","commenter_a":"He should sue the pants off of Eric Holder.","post_message":"JUST IN: Ferguson Police Chief Tom Jackson resigns, effective March 19. Lt Col. Al Eickhoff will serve as acting chief as the City of Ferguson begins a nationwide search. We will carry the 5:30p press conference LIVE on-air and online. STORY: @webpagelink"},{"comment_id":"1311796595543533","commenter_b":"#DontBoo #VoteHillary #NastyWomenVote","commenter_a":"we are not going backward, we are going forward , Best of luck The world President @username \"I am sick and tired of the negative, dark, divisive, dangerous vision and behaviour of people who support Donald J. Trump","post_message":"Don’t miss out! Join them: hillaryclinton.com/makeaplan"},{"comment_id":"10157239899915725","commenter_b":"Democrat lives don't matter.","commenter_a":"Say it Mr President .","post_message":"ISIS exploded on Hillary Clinton's watch- she's done nothing about it and never will. Not capable!"},{"comment_id":"1155027644532693","commenter_b":"ignorants are eating Donald shit with lying pence","commenter_a":"NEW RULE : MAKE GRABBING PUSSY GREAT AND SAFE AGAIN.....LYING PENCE IS DONE FROM EATING DONALD SHIT .....BREAKING NEWS : HURRICANE DONALD DUMB IS ENDING THE PRESIDENTIAL RACE AND IT IS MORE POWERFUL THAN MATTHEW HURRICANE .... PAUL RYAN AND THE RNC CHAIR WASHED THEIR SMALL HANDS FROM DONALD DUMB AFTER WATCHING DUMB TRUMP PUSSY GRABBER CLIP ..... THE RACE IS OVER ...CONGRATULATION I ANNOUNCE .HILLARY CLINTON IS THE PRESIDENT OF USA ,,DONALD JOKE DUMB HIJACKED REPUBLICAN PARTY (LINCOLN AND REGAN PARTY ) LIKE ISIS HIJACKED ISLAM AND KKK HIJACKED CHRISTIANITY ,, I AM CALLING FOR COMPLETE SHUT DOWN OF DONALD JOKE DUMB FROM TALKING TO ANY WOMAN UNTIL WE FIGURE OUT WHAT THE HELL IS GOING ON .INCLUDING DEBATING WITH PRESIDENT Hillary Clinton","post_message":"She wants textbooks changed."},{"comment_id":"1576836375956014","commenter_b":"And yes, you will pay for that f'n wall!","commenter_a":"Fox apologized to Trump and invited him in May. He is a liar","post_message":"The former president of Mexico, Vicente Fox Quesada, says Donald J. Trump is using his visit to Mexico with President Enrique Peña Nieto to boost his sinking poll numbers. @webpagelink"},{"comment_id":"10153059465629614","commenter_b":"Just because u are a police dose not mean that u have the right to break the laws n u say that police need a break well who give use a break","commenter_a":"She doesn't no her traffic sings lo hahaha","post_message":"A sheriff deputy is under investigation after cell phone video showed her getting into a patrol car that was parked in a disabled parking space at a Circle K store in Sacramento. always park in handicap when you not on a call? A man can be heard saying in the video. allowed to get breaks, the deputy replies. The Sacramento undersheriff said he was disappointed and that punishment could range anywhere from documented counseling all the way to termination. Watch KTLA video here: @webpagelink"}]
