[{"comment_id":"1143828785650872","commenter_b":"Funny how they show all this stuff because its TRUMP...I am sure that there was stuff like this when Obama was running oh ya it has been bad for 7 years since he has been President...GROW UP PEOPLE...you are making bad examples for our future kids...","commenter_a":"Common sense: Using seat belts, texting and driving, drinking, smoking, walking in traffic....should I go on? You are responsible for your actions, not some politician!!!!!!!!! WAKE UP AMERICA......","post_message":"This protester was sucker-punched and kicked by a Trump supporter as he was escorted out of yesterday's rally in Arizona. You have to see the video of the violent confrontation."},{"comment_id":"10154246053623797","commenter_b":"They are being peaceful.","commenter_a":"No reason to protest. Have a vigil. Be peaceful!!","post_message":"#CHICAGO PROTESTS: Protesters swarm the Chicago Police HQ"},{"comment_id":"1044585922265355","commenter_b":"Poor little Marco.","commenter_a":"Senator Rubio, please stop getting in the gutter. Your recent comments make you sound like like you are 5 years old. You are better than that and I am so very disappointed.","post_message":"\"And you know what they say about guys with small hands...\" Marco Rubio said of Donald J. Trump."},{"comment_id":"1015160651860508","commenter_b":"@username go be stupid with your blond friends elsewhere","commenter_a":"If the little brat would have respected the teachers authority in the first place the cop wouldn't have even needed to be there.","post_message":"No matter how smarmy some snot-nosed teenager might be, even if she’s burning off the teacher’s time, the class time and her own time, there’s never a moment in which it’s appropriate for a law enforcement officer to try out his best WWE moves in order to bring her to heel — even if she takes a swing at him. @webpagelink"},{"comment_id":"10156964298475557","commenter_b":"Unbelievable that she is allowed to be running for president if I did what she did they would have found me guilty and thrown the key away!! To think she could be our president, omg!!","commenter_a":"Political game playing and media bias. This woman should be in prison. Not on a pedestal. She is as corrupt as they come. Why are people so stupid?","post_message":"Hillary Clinton will become the first woman to top a presidential ticket after securing enough commitments Monday from delegates to become the presumptive Democratic nominee, The Associated Press reported."},{"comment_id":"901967236585038","commenter_b":"she has blood on her hands !!! Bengazi !!","commenter_a":"AWESOME","post_message":"In the just out Fox News Poll, I easily beat Hillary Clinton - and I havn't even focused on her yet. On our way: MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1079326368771039","commenter_b":"Devil women","commenter_a":"that will be a cold day in Hell!","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More ‘Comfortable’. This is just getting ridiculous. Do you think they should keep the cross in our Churches?"}]
