[{"comment_id":"10152995083802869","commenter_b":"Isn't there something about judging a tree by the fruit it bears. This sir, is what you stand for and represent.","commenter_a":"I can't believe he found a woman stupid enough to marry and procreate with him.","post_message":"Janet and I want to affirm our support for the Duggar family.  Josh’s actions when he was an underage teen are as he described them himself, 'inexcusable,' but that doesn’t mean 'unforgivable.'  He and his family dealt with it and were honest and open about it with the victims and the authorities.  No purpose whatsoever is served by those who are now trying to discredit Josh or his family by sensationalizing the story.  Good people make mistakes and do regrettable and even disgusting things.  The reason that the law protects disclosure of many actions on the part of a minor is that the society has traditionally understood something that today’s blood-thirsty media does not understand—that being a minor means that one's judgement is not mature.  No one needs to defend Josh’s actions as a teenager, but the fact that he confessed his sins to those he harmed, sought help, and has gone forward to live a responsible and circumspect life as an adult is testament to his family’s authenticity and humility.  Those who have enjoyed revealing this long ago sins in order to discredit the Duggar family have actually revealed their own insensitive bloodthirst, for there was no consideration of the fact that the victims wanted this to be left in the past and ultimately a judge had the information on file destroyed—not to protect Josh, but the innocent victims.  Janet and I love Jim Bob and Michelle and their entire family.  They are no more perfect a family than any family, but their Christian witness is not marred in our eyes because following Christ is not a declaration of our perfection, but of HIS perfection.  It is precisely because we are all sinners that we need His grace and His forgiveness.  We have been blessed to receive God’s love and we would do no less than to extend our love and support for our friends.  In fact, it is such times as this, when real friends show up and stand up.  Today, Janet and I want to show up and stand up for our friends.  Let others run from them.  We will run to them with our support."},{"comment_id":"10153440852086051","commenter_b":"@username If you are a woman voting Republican then your a full blown retard with helmet","commenter_a":"When major and I mean MAJOR republicans are threatening to vote democrat . Because of Trump something is wrong with the party.","post_message":"Here's how Donald Trump wants to deal with the families of terrorists."},{"comment_id":"1683593111700811","commenter_b":"That's why they have a little pill now called Plan B...take that the day after you're raped if you can't stand to carry the baby and put it up for adoption to a family who doesn't care how the child was conceived! Abortions, especially late term abortions are cruel and inhumane!","commenter_a":"It's planned parent hood they do a lot more then abortions. And @username women chose well some prolly forced so @username women got knocked up because they didn't practice safe sex. I thought women wanted the right to chose what they do with there bodies planned parent hood also helps with women's health who can't afford insurance or hospitals the government cut there funding right? So how can they help these people and if they closed right now you don't think @username people won't find someone else to do abortions. I promise if there not smart enough to use protection and pph closed you would see a lot of dumb young women ending up in ER with a coat hanger hanging out of them. Americans are such pussies anymore of it is not your baby or body and you don't know the person making there chose mind your fucking business","post_message":"Ugh why?!"},{"comment_id":"486861261504454","commenter_b":"She wouldn't make a pimple on the queens ass","commenter_a":"YES","post_message":"The Jordanian Queen just put Michelle Obama to shame.  Good. Our first lady is classless. In no way does she represent our country.  Would the Jordanian Queen make a better First Lady?"},{"comment_id":"1657934121091027","commenter_b":"What did they expect???? Idiot Merkel....","commenter_a":"A bunch of neanderthals","post_message":"The reports of assaults have added fuel to Germany's migration debate."},{"comment_id":"1098657656855065","commenter_b":"She's a DOPE, I don't know about Doped up.","commenter_a":"So stupid Andddddddddddddddd Hillary nearly fell stepping off the podium She looks doped up","post_message":"UNREAL! WATCH JOE BIDEN Point Out The Guy Who \"Follows\" Him Around With The NUCLEAR CODES Right After Saying TRUMP Couldn't Handle The Codes [Video]  And we have THIS clown in charge?"},{"comment_id":"10153580270695575","commenter_b":"If this is true, which I'm sure it is, how sick. But this is what the female liberals want. Oh is saying female liberals not PC?","commenter_a":"The Missing link!","post_message":"The Gateway Pundit - Muslim Dad Kills 4 Year-Old Daughter for Not Covering Her Head"}]
