[{"comment_id":"948311541870934","commenter_b":"If they want to live in our country then they need to live by our laws. Things should not be changed to accommodate them! If they don't want to live by our laws they should live elsewhere! We have to abide by the laws...so should they!","commenter_a":"I don't think so .. Not in Fla","post_message":"This state is allowing burkas in driver license photos!  THIS SHOULDN'T BE ALLOWED IN AMERICA..."},{"comment_id":"10153525353934170","commenter_b":"Hillary Rodham Clinton: Not qualified to clean my toilet.","commenter_a":"That picture looks like she has an empty head. Oh! That's Hillary Clinton! !!!","post_message":"CNN asks Hillary about tax policy, spending, the collapse of Greece, the Iran nuclear deal, the future of ObamaCare . . . just kidding! They didn't ask about any of this. They wasted almost the entire interview on trivial nonsense. The VIDEO will have you shaking your head."},{"comment_id":"10153702004727464","commenter_b":"He is my Prince.","commenter_a":"Conservative....I don't think that word means what you think it means.","post_message":"Act out a scene from The Princess Bride?  As you wish..."},{"comment_id":"1746481058744968","commenter_b":"Get out of here","commenter_a":"Traduction: Our thoughts are with the people of ISIS","post_message":"Our thoughts are with the people of Aleppo"},{"comment_id":"1079209208779497","commenter_b":"She got them takin away bc of her psychological problems","commenter_a":"Run, mom, run. I was involved in a custody battle with my ex who had money and guess what? I lost!!","post_message":"Hillsborough Sheriff's detectives are asking for the public's help locating two missing twin girls who are believed to be with their biological mother who just lost custody of the girls."},{"comment_id":"352745464928968","commenter_b":"Her lips weigh more than my kids\"!!!!","commenter_a":"Who cares what she wants. She needs to minf her own business.","post_message":"Michelle Obama Wants to Weigh Your Fat Kids"},{"comment_id":"10153784197573132","commenter_b":"Dig these hard chicks","commenter_a":"Way to go ladies! Proud of you. You are true role models.","post_message":"True role models."}]
