[{"comment_id":"487710868083187","commenter_b":"Shut up.","commenter_a":"Supporting Bernie is supporting a blow FOR the middle class.","post_message":"It's a mistake to treat the \"black vote\" as a monolith."},{"comment_id":"879492268908016","commenter_b":"I wouldn't vote for the loud mouth scumbag for trash collector. She is the most unlady like female ever. All she does is run her big (I mean BIG) mouth. She just needs to go away with her non American husband and disappear.","commenter_a":"Donald","post_message":"There's a huge movement supporting Michelle making a run at POTUS in 2020. Who would you vote for, Donald Trump or Michelle Obama?"},{"comment_id":"10153166751996336","commenter_b":"CIA is the source of evil, they create such groups like ISIS, Al-Qaida to fight its dirty proxy war in other countries","commenter_a":"Haha go ahead smash the headstones. They are just mad the one thing they can't take is our eternal life with Jesus.","post_message":"ISIS continues with their calculated campaign of terror across the Middle East, destroying Christian graves in the Iraqi city of Mosul."},{"comment_id":"1726976590895675","commenter_b":"@username Drama queen.","commenter_a":". LETTERMAN'S TOP 10 REASONS TO VOTE DEMOCRAT 10. I vote Democrat because I love the fact that I can now marry whatever I want. I've decided to marry my German Shepherd. 9. I vote Democrat because I believe oil companies profits of 4% on a gallon of gas are obscene, but the government taxing the same gallon at 15% isn't. 8. I vote Democrat because I believe the government will do a better job of spending the money I earn than I would. 7. I vote Democrat because Freedom of Speech is fine as long as nobody is offended by it. 6. I vote Democrat because I'm way too irresponsible to own a gun, and I know that my local police are all I need to protect me from murderers and thieves. I am also thankful that we have a 911 service that gets police to your home in ...","post_message":"Good morning America! Big day ahead! Join me at 11amE - as I officially announce my Vice Presidential choice- Governor Mike Pence! Watch here: @webpagelink"},{"comment_id":"1349378628409086","commenter_b":"If the left gets anymore crazier than it already is, they will probably force all heterosexual women who got impregnated the natural way from a heterosexual male to undergo an abortion, and only lesbians and transgender \"men\" can have babies. They want a world where only lesbians, homosexual men, and transgenders exist.","commenter_a":"The day is going to come when it will be possible to determine if your child will turn out like \"They\" before they are born. We shall see how much the left loves abortion then.","post_message":"This is getting out of hand..."},{"comment_id":"1135734373128367","commenter_b":"Luke Brandon he's going his own way","commenter_a":"She has been nothing but a big disappointment and embarrassment to herself since she divorced her first husband. He built her and her career has gone nowhere but down the tubes since that divorce, as she insist on living the life of shame and sleaze.","post_message":"Claims Mariah Carey's keeping the HUGE engagement ring"},{"comment_id":"995099337179781","commenter_b":"Crazy dumb old witch.","commenter_a":"I think democrats are more like terrorist. Terrorist maim and tear people's bodies apart. Democrats do the same thing to unborn babies by allowing Planned Parenthood to Harvest baby body parts. As far as I know no terrorist organization sells body parts. Guess that makes Democrats and Hillary Clinton worse than terrorist.","post_message":"BREAKING: Hillary Clinton says GOP candidates are like terrorists because they're...pro-life?"}]
