[{"comment_id":"10154945952871037","commenter_b":"Wow, I honestly thought I was the only one.😢","commenter_a":"I was diagnosed with PTSD after being sexually assaulted as well. It disgusts me that so many people dismiss it as someone playing the victim card or seeking attention. Believe me, no one wants PTSD or to be sexually assaulted.","post_message":""},{"comment_id":"10153292336206680","commenter_b":"Given he is so concered about conditions in Eurpose how about opening the borders to more refugees in desperate need . Sharing the burden rather than slamming to door to hope shut.","commenter_a":"I've been to Brussels. I was essentially homeless there for one night as I passed through -- I camped at a vacant fairground. Not a single Muslim tried to commit a violent act against me. The real world isn't nearly as scary as Trump seems to think it is.","post_message":"POLITICO Europe Donald Trump defended his proposed Muslim ban."},{"comment_id":"10153828694670779","commenter_b":"So was Hillary's. But don't see you bitching about her. Oh that's right, you're for her, lol. They both suck! And war is coming. Hope you all are ready!","commenter_a":"Poor Frump supporters. At least they have the right temperament. :-D","post_message":"Donald J. Trump's debate conduct is destined to become a future candidate-training video of what not to do. The man dismissed as the most ignorant, uncivil and unprepared major-party candidate in history could not have conducted himself more poorly."},{"comment_id":"10154480088981636","commenter_b":"female subjugation, taught from birth, how disgusting","commenter_a":"I hope they wear something to let people know they are the police","post_message":"Brilliant"},{"comment_id":"1251358764916884","commenter_b":"@username she is the epitome of EVIL...","commenter_a":"This happens when you are stressed and not comfortable with what you are saying. She has to stay in the race or she goes to jail. There are a lot of people depending on her to keep them out of jail. She will crack and meltdown if pushed long enough...","post_message":"@webpagelink"},{"comment_id":"10153024704310927","commenter_b":"Bill; do you understand that the 08 housing crash was the result of the 01 dot-con crash and that crash was preceded by the savings & loan crash and crash backwards it goes back to drilling nuclear holes in the ground & Vietnam and then disasters back to 1913 non-federal reserve bank. That to sustain the illusion the fiat currency denominator had to be divided by greater volume than gold, then oil and now QE zero interest ether ?? Destroying the ME extends the time line that said nations can once again convert away from the bankrupt US dollar ??","commenter_a":"Just more political theatre. It has already been shown that the IRS did not target conservative groups. The were doing their jobs and broke no laws.","post_message":"Rep. Jason Chaffetz UNLOADS on IRS Commissioner John Koskinen while introducing resolution of impeachment: violated the public trust ... Impeachment is the appropriate tool to restore public confidence in the IRS ... .\""},{"comment_id":"1117421238280665","commenter_b":"Mary please do your homework. It would be great to have a woman president but not her. She's a chameleon. If she hasn't flip flopped on something that matters to you just wait...","commenter_a":"Hillary Clinton is the single most qualified candidate in the race, and of the last 60 years. she is the right woman for the job, and in 284 days, i will be proud to call her Madam President.","post_message":"EXCLUSIVE: Vice President Joe Biden reveals what he thinks about the US electing a female president. \"This country's ready for a woman.\""}]
