[{"comment_id":"10153739914549714","commenter_b":"@username I was going to say that. Both are smokin' tho.","commenter_a":"Cara looks like a dude without makeup","post_message":"Richard Madden was pretty critical of Cara Delevingne and her cringeworthy Good Day Sacramento interview."},{"comment_id":"10153894125869205","commenter_b":"Another whiny bitch.","commenter_a":"Hey dummy it's not that you are reporting about him it is you only complain about him. Where as with Hillary you are sold out to her just like Bernie.","post_message":"After getting $2 billion in free advertising from the corporate-controlled media, Donald Trump is now whining about the fact that they’re being super mean to him (by doing nothing more than reporting on what he says.) The Ring of Fire’s Farron Cousins discusses this."},{"comment_id":"10153196622799753","commenter_b":"FUCK U CUNT.......","commenter_a":"She committed suicide now let it go.","post_message":"Do you think Sandra Bland was murdered?"},{"comment_id":"1168788129800109","commenter_b":"******TRUMP..... 2016 **** DESTROY ISLAM AMEN....pass the ammo \"SWIPER NO SWIPING\" *no illegals voting Quote..DORA THE EXPLORER *BLACK LIVES MuRDER ...jokes","commenter_a":"Lol She should have to wear a lie detector at all time....that zaps her when she fibbs","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"636098806550073","commenter_b":"#FuckDonaldTrump","commenter_a":"You people are celebrating this? He has not done anything to you. Anyone applauding a man loosing a fortune for standing up for his beliefs is soiling their own humanity. By ruining his life, you are staining your own soul. All of you are behaving much worse than anything you are accusing him of (falsely I might add). Those lambasting him are the ugly ones. I have seen much more vulgar behavior from the anti-trump crowd than anything that has been used as ammunition against him, true or not (most of it is false).","post_message":"The numbers say that Trump casinos, stores, and golf courses have suffered most."},{"comment_id":"1193851514016933","commenter_b":"You losers already get my money in taxes. I pay for your food stamps and slow check every month!","commenter_a":"We wuz kangs","post_message":"Just in time for Christmas!"},{"comment_id":"10153575842934087","commenter_b":"If she withdraws we can toss her and Bernie a Peanut.","commenter_a":"Of course, who wants to be a target for Hillary shaming?","post_message":"Pressure is building on Democrats to rally behind front-runner Hillary Clinton after her strong Super Tuesday showing, but 22 House members and five senators are holding back."}]
