[{"comment_id":"506647236198456","commenter_b":"That will get her dinner at the White House.","commenter_a":"I want proof. Then it's not just a vague fb post...","post_message":"Beyonce Posted Letter Hours Before Dallas Shooting, Calling Blacks to  Against Police, That Murder Should Not Go   CHARGE HER WITH INCITING VIOLENCE!   Let's get 5000 SHARES if you think she should be held accountable!"},{"comment_id":"10153398198117377","commenter_b":"Trump will never win. A vote for trump is a vote for Hillary..","commenter_a":"why wasn't Priebus fired after Obama won re-election? It was unreal that Obama wins re-election and the RNC looks the other way. Priebus will be gone after Trump becomes President.","post_message":"Reince Priebus is an amateur and lightweight who has been a \"disaster\" as chairman of the Republican National Committee, says Christopher Ruddy, CEO of Newsmax. “We never would've been in the situation we're in today,” if the RNC had a strong leader Ruddy told Newsmax TV. Read the full story: @webpagelink"},{"comment_id":"853431768039181","commenter_b":"I notice that there were over 5,000 views I'm sure with the government controlled internet that is about 5,700 over raided so like no one cares.... BUT more scandals and more lies... she will be just like obama,,, she wants to take your right's away just like obama... and she will win by the votes of all the illegals that MUSLIM obama let in..","commenter_a":"Scandal after scandal after scandal from the early years until now. No wonder 57% of all of American's find her untrustworthy !!! The other 43% are Liberal morons.","post_message":"New York Times reporter Maggie Haberman says that Hillary Clinton looked “very defensive” answering questions."},{"comment_id":"1041804329212648","commenter_b":"The same family will bring in refugees, no doubt, and will regret that as well.","commenter_a":"At the shelter in my city they put all pits and even half pits to sleep, they don't even adopt them out.","post_message":"Pit bull rescued from 'death row' attacks daughter just minutes after arriving at family home"},{"comment_id":"10153540502734411","commenter_b":"Wow--look at that face. That woman needs to smile more.","commenter_a":"Links of blood and marriage tied Battenbergs/Mountbattens to Germany/or.also Saxe-Coburg-Gotha into \"Windsor\" didn't transform Edward..","post_message":"'She was a child when this film was shot, long before the atrocities of the Nazis became widely known. But Edward was already welcoming the regime as Prince of Wales in 1933 and remained pro-Nazi after war broke out in 1939. He could well be teaching the Queen and Princess Margaret how to do the salute.'"},{"comment_id":"1264368863598532","commenter_b":"GO straight to HELL...","commenter_a":"God has His own way to handle Him. This man is no match for God.","post_message":"This is why Trump won!"},{"comment_id":"848788448587668","commenter_b":"@username is trying to use bully tactics to shut up anyone that doesn't agree with him. It won't work. We're fed up!! We will not call evil good and good evil, so crawl back to your safe space and stay out of the women's bathrooms!!","commenter_a":"I am NOT a bigot and i hate being told i am because i do not like what Target did.. that is crazy !! i really do not care what they do.. but not in the little girls room","post_message":"I hope this video makes the rounds....Target has completely LOST IT at this point....shame on them."}]
