[{"comment_id":"1113642245398693","commenter_b":"Ummm....which part of the Constitution did he need help reading again ? Seems like the Constitution is only good for these biggots when it works in their favor...picking and choosing again...no wonder this Country is in such shambles right now. Get over it Ted Cruz...get over it.","commenter_a":"The thing is, how do Republicans make the, \"follow the constitution\" argument after this? The constitution is clear, that the President must nominate a Supreme Court Justice when there is a vacancy. Where in the constitution does it set a time limit based on when the vacancy occurs?","post_message":"Senator Ted Cruz tweeted: \"Justice Scalia was an American hero. We owe it to him, & the Nation, for the Senate to ensure that the next President names his replacement.\""},{"comment_id":"10153605576555796","commenter_b":"Then why is she a waitress.Dumb ass.","commenter_a":"Maybe if he didn't by guns , his idiot wife wouldn't have to waitress. He's such a friggen looser.","post_message":"Gov. Paul LePage said his reaction whenever the debate begins anew is to head to a sporting goods store. “Every time there’s a big gun battle about one of these incidents, I go buy a gun,” LePage said to applause from the audience. “I have a big safe of them. I have five that I bought and I haven’t shot them.”"},{"comment_id":"10153117633836051","commenter_b":"I think Cindy is jealous cuz her double wide doesn't have a closet! And Barbara, don't join the dumbass train, I clearly cannot teach this old dog new tricks, but if she has the right to call people queer then I have the right to call her stuff, correct?","commenter_a":"Shame on the Queers.","post_message":"A CNN host went on a lengthy rant about spotting an ISIS flag at a gay pride event this weekend. There's just one problem."},{"comment_id":"1811712189111334","commenter_b":"She is a poor excuse for a women","commenter_a":"News-Flash! When you're talking about liberals, \"best\" is a relative term!","post_message":"THIS is the best the Left can do?!"},{"comment_id":"10153386864707235","commenter_b":"Eww","commenter_a":"They probably wanted to sniff it.","post_message":"This should not be legal."},{"comment_id":"10153469031994705","commenter_b":"Everything is wrong with McDonald's.","commenter_a":"Well I love mc donalds There's nothing wrong with mc donalds","post_message":"McDonald's big secret isn't so secret anymore."},{"comment_id":"914235348632517","commenter_b":"So sad","commenter_a":"He'll claim it was medicinal for his PTSD.","post_message":"Bowe Bergdahl, the U.S. soldier who was released in a prisoner exchange in Afghanistan for five Taliban detainees, wound up in the middle of a pot raid earlier this week @webpagelink"}]
