[{"comment_id":"1270891722952389","commenter_b":"@username says the woman whose profile pic says \" Make America Kind Again\"","commenter_a":"You know being born in this country is a requirement to be president.. There is no requirement to provide tax returns just in case you were wondering. If the dems win and Hillary is president you liberals better be ready to open your homes to refugees because they will be stuffing them into this country and fast as they can. The dems only care about one thing.. Power.. Staying in power and keeping others from having any including the citizens which is who should have the power. Take a look at what's happening in Europe right now it's not long before its happening here.. But the media won't report it because the dems will try to keep it from you. That's right the media is biased.. All media one way or the other.. So drink your flavor of koolaid and get ready because the liberals in this country are coming ...","post_message":"Great question, Mr. President. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1493294134044387","commenter_b":"She is pure evil & should be put to death.","commenter_a":"Hillary is done the writings on the wall god look at the rallies know it's there for her no signs no bumper stickers no T-shirts and say Hillary for prison. She's a criminal and should prosecuted","post_message":"Wow!"},{"comment_id":"10154610047733132","commenter_b":"This breaks my heart seeing this adorable fella like this.","commenter_a":"Help him !!!!","post_message":"Just one look in this poor guys' eyes tells you he's deeply unhappy. (via PEOPLE Pets)"},{"comment_id":"429495940593558","commenter_b":"The racists are AGAINST Trumo!","commenter_a":"The days of Nazi Germany are coming back if we don't stop this racist Trump. Blacks and Latinos must unite power to end this nonsense.","post_message":"The Secret Service rushed to shield Donald J. Trump after someone tried to jump a barrier during an Ohio rally on Saturday."},{"comment_id":"1457667300971814","commenter_b":"Or fire her!","commenter_a":"I am ashamed of NBC. Rather than addressing the crude and disputable comment by one of your employees, you just champion Chelsea. Do the right thing fire Katie Rich and issue and apology","post_message":"\"Barron Trump deserves the chance every child does - to be a kid.\""},{"comment_id":"10153738741461491","commenter_b":"women, so weak they shouldn't even be acknowledged in movies as worthy of a fight...","commenter_a":"I don't see it as offensive. It depicts two super heros fighting. Although everyone has a right to voice their own opinions.","post_message":"\"The fact that no one flagged this is offensive and frankly, stupid.\""},{"comment_id":"10156660915665354","commenter_b":"The woman should thank Ms Palin for keeping her employed. If she didn't resemble Sarah she wouldn't be working. Since there isn't much talent there.","commenter_a":"Sure, Sarah made Tina famous and rich. But Tina helped do the same for Sarah. I believe Sarah is laughing all the way to the bank....just as much as Tina is. Sarah did look a bit disjointed at the endorsement and Tina jumped on the opportunity to mock her. But Tina....sorry. You failed miserably. Didn't laugh at all. SNL is just sad. Don't watch any longer. The constant right bashing is boring and predictable.","post_message":"You saw this, right?"}]
