[{"comment_id":"631512343684752","commenter_b":"That last one is not a fact. It's a talking point. I am a white Christian and I hate his policies. Not him. I hate socialism. It's working do well in Venezuela. The dems are the ones throwing the race card around to get people's minds off the facts. For example, a few people have health care now that didn't before. But more people lost their health care than gained it. Obama care is forcing insurers nd doctord out of the market which cause a loss of coverage.","commenter_a":"Bahahaha...I would LOVE to see legitimate sources.","post_message":"Facts suck, huh?"},{"comment_id":"1809746189282784","commenter_b":"Why you wait until today to do this stupid you are old and stupid my God how a woman do these stupid thing","commenter_a":"Stupid stupid","post_message":"#LIVE VIDEO: Attorney Gloria Allred is holding a press conference with a woman who accuses Donald J. Trump of sexual misconduct."},{"comment_id":"1146502822036413","commenter_b":"We can make the illegals pay taxes.","commenter_a":"He can just file bankruptcy when it's done being built.","post_message":"Constructing an impassable wall along the U.S.-Mexico border would be a tall order — even for master real estate developer and 2016 GOP presidential candidate Donald J. Trump."},{"comment_id":"1011157232323867","commenter_b":"I heard this interview last night. It was in reference to him making less money.","commenter_a":"LOL","post_message":"That'll convince voters."},{"comment_id":"10153009343111130","commenter_b":"My mother was too. But her mother was an even bigger bitch, so I got it.","commenter_a":"My mother is a bitch!! There I said it!","post_message":"\"I realized how much the fragility and vulnerability of females is exposed fully in the mother-daughter relationship.\""},{"comment_id":"470890583106641","commenter_b":"@username YOU'RE the looser ! And that's why you'll loose in November also !","commenter_a":"Hillary Clinton all the way to the White House !!!!","post_message":"WATCH LIVE: Hillary Clinton answers question LIVE in commercial break!"},{"comment_id":"629803473847253","commenter_b":"she is a bitch to treat that young woman like that","commenter_a":"What a bitch!","post_message":"MUST WATCH: Hillary doesn't like being challenged by black woman. Welcome to the DEMOCRAT plantation."}]
