[{"comment_id":"10154416316781833","commenter_b":"@username lmao there is no such thing as gun violence only violence. And back off gun control laws won't stop criminals or terrorists from getting guns. Your gun control laws only harm law abiding citizens and get people killed wake up. More states are banning gun control laws. I'm moving to Arizona. They have no gun control laws and have Constitutional carry. No permits no waiting periods no finger printing. Just a simple and quick background check and I'm free to get my gun. And I will buy loads of AR 15s and other types of guns. Gun control = death","commenter_a":"I don't see what the problem is with strict background checks and a ban on assault rifles. This guy was under investigation by the FBI twice for suspected terror affiliations. A background check would have certainly stopped him from obtaining such a weapon. Noone wants to take away anyone's guns, just keep them out of the hands of lunatics","post_message":"Americans were shocked and disgusted to learn of another act of terrorism on our soil. But calls for more gun control are a desperate attempt to create the false illusion that government - and politicians - can keep us safe at all times."},{"comment_id":"10153433467800950","commenter_b":"Lmfao living in the hood ...Girl u crazy ..","commenter_a":"I don't care how you spin it...I feel for this man...we send our children off to defend a country that doesn't give two shits about the lives of those we send!!! We expect them to come home the same as when they left after killing people and watching theirs friends die...REALLY?! He was a kid who got caught up in and then taken against his will..He suffered years of torture and now we want to punish him more...I'm sorry but that is as wrong as you can get!!!!!","post_message":"In October, the leading GOP candidate called Bergdahl a \"traitor, a no-good traitor, who should have been executed.\""},{"comment_id":"327851404005511","commenter_b":"Trump supported assault weapon ban","commenter_a":"And you guys don't have an enemies list? Apparently, Trump is at the top of your list. You really have to quit with the Hitler and Facist rhetoric. All that does is make me want to vote for Trump even more.","post_message":"Erick Erickson, you said it. Fascists and tyrants always have enemies lists."},{"comment_id":"623726524464132","commenter_b":"LOCK HER UP ---THROW AWAY THE KEY","commenter_a":"That kind of memory or lack thereof makes her a danger to herself and others.","post_message":"Tom Fitton is LIVE discussing Hillary Clinton's response to Judicial Watch questioning under oath and more in our Weekly Update. [for higher volume touch sound icon on screen or turn your speakers up ]"},{"comment_id":"10153035493893822","commenter_b":"Gross. She needs to go back.","commenter_a":"Why isn't she in jail?","post_message":"Connellsville woman charged for having sex with a 14 year old boy. The boy actually dated the woman's late daughter, who died back in June of 2014."},{"comment_id":"10152844274493525","commenter_b":"Burn the witch!!!!!!!","commenter_a":"good....now put him to sleep!","post_message":"The 30 verdicts for Dzhokhar Tsarnaev in the Boston Marathon bombings trial are as follows: Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty."},{"comment_id":"10153917800769087","commenter_b":"Suck Ass Fox (lol)","commenter_a":"the people who think trump is a joke need to get smart....in a hurry. the only vote that will count in november is the one cast to defeat, no, destroy trump. i don't think jill stein will do that. hillary will. hold your noses people and do the right thing. for the wrong reasons perhaps, but do it. after the dust settles and trump, god forbid, wins, it will be too late to hear you whining.","post_message":"Dozens of the most prominent people in Silicon Valley signed an open letter on Thursday warning that Donald J. Trump \"would be a disaster for innovation.\""}]
