[{"comment_id":"1724919811095083","commenter_b":"^^ for a woman that's a very clever reply","commenter_a":"I think a more interesting question would be, will women cycle differently on other planets? I'm no scientitian, but it seems to me it's a helluva coincidence (that we take for granted) that the female menstrual cycle is in line with the lunar cycle. Our bodies are 2/3rds water and the moon controls the tides. Am I talking out my ass if I suggest maybe the moon can can influence the fluids in our bodies? So on a dfferent planet, with different moons (and presumably after having been there for several generations), would women cycle differently?","post_message":""},{"comment_id":"10153309653924614","commenter_b":"She doesn't love him if she's trying to take off his mask","commenter_a":"About time.","post_message":"A Baltimore mother is being praised after cameras captured her berating and smacking her son after reportedly seeing him throw rocks at police during the city violent protests.   wish I had more parents that took charge of their kids out there tonight, the police commissioner said.   Nearly 200 people were arrested on Monday after more than 140 vehicles were set on fire and at least 15 police officers were injured during the protests.   Read KTLA story here: @webpagelink"},{"comment_id":"822517567938820","commenter_b":"This woman is crazy saying Hillary is the most loved and respected woman in the world! She's been hanging around Hillary to much, and Hillary's lying is rubbing off!!","commenter_a":"Security should of threw her out on her ass. The demons must be running scared.","post_message":"Watch: Dem Chair Shows Up INSIDE GOP Convention Arena And Does The Unthinkable  It is amazing to see to what extent the Democratic party will try to derail Trump's campaign.  Do you stand behind Donald Trump?"},{"comment_id":"10152868852711336","commenter_b":"I approve. What else should we call them? They are illegals.","commenter_a":"Americans should be able to freely shoot border jumpers no questions asked in protection of our country!","post_message":"A California newspaper will continue to use the term \"illegals\" to describe people who enter the U.S. without permission, despite an attack on its building by vandals believed to object to the term."},{"comment_id":"443037622487945","commenter_b":"Lol leftist get out","commenter_a":"Wrong, it isn't the IRS it is all the rich corporate fascists. The pentagon spends how much on the military? I hardly think taxation on the regular guy is so bad, but when the rich fail to pay and the greedy steal it all well, you gotta blame somebody, right?","post_message":"The Anti-Media radio show from tonight can be heard here: @webpagelink"},{"comment_id":"10153170547614170","commenter_b":"She will find a way to get out of it!!","commenter_a":"The Clintons are just like Obama, Lerner & Holder who all believe they are above the law.","post_message":"I don't know if people realize how big this is. It's such a serious violation of the law, even the New York Times is calling her on it And it's all because this woman is an obsessive control freak."},{"comment_id":"1368961776496629","commenter_b":"Obviously yours is up ur boyfriends ass you homo!","commenter_a":"IF YOU ONLY REPORTED REAL NEWS! ! ! !","post_message":"This scandal is only getting worse."}]
