[{"comment_id":"1175128772557320","commenter_b":"This one nah woman?","commenter_a":"You didn't lose because you're a woman. You lost because of all the horrible things you did. Trump might have said a couple bad things, but you did many bad things. You spend our enemies money bashing him and he funded himself. I can't wait till he's in office and saying Merry Christmas is ok again and don't have to worry about offending someone for saying it. He WILL make America great again. GOD bless him.","post_message":"Scripture tells us: Let us not grow weary in doing good, for in due season, we shall reap, if we do not lose heart."},{"comment_id":"10153807891284062","commenter_b":"He served our country well and is our Founding Father.","commenter_a":"Only one problem with having to be a dead president. Ben Franklin was never president.","post_message":"Which of these women would you like to see on the $20, if any?"},{"comment_id":"10153944005826336","commenter_b":"@username Your cocksucking grandma needs to read the bible!!","commenter_a":"What is this world coming to?!","post_message":"Just a few weeks before Christmas, Labor Commissioner Brad Avakian wiped out the Klein family’s bank accounts – taking nearly $7,000."},{"comment_id":"10154305617489205","commenter_b":"Filthy slut!","commenter_a":"The world ends tomorrow","post_message":"Donald Trump Appears At Pre-Inauguration Lincoln Memorial Concert"},{"comment_id":"10153446133962550","commenter_b":"Because it's hilarious","commenter_a":"So no crime and no charges....Why is news then?","post_message":"Police found the 22-year-old man curled in a fetal position on the floor, groaning and surrounded by snacks that included Doritos, Pepperidge Farm Goldfish crackers, and Chips Ahoy cookies."},{"comment_id":"10154205810731179","commenter_b":"Ah misogynist women are the *best*.","commenter_a":"Don't flatter yourself lmao. Look at his wife 😍😍","post_message":"#WomensMarch"},{"comment_id":"1002924903097372","commenter_b":"Sad part is there are a lot of people in denial and they will actually vote for this idiot woman","commenter_a":"All today has shown America is that @username will make an outstanding president and that the Republicans are vindictive liars. The Republicans have admitted to spending over 4.5 million dollars of taxpayers money to fund a \"witch hunt\" designed solely to discredit Secretary Clinton and take down her poll numbers. They have confessed to this.","post_message":"Hillary has been testifying at the House Select Committee on Benghazi for hours, and what have we learned? That she was a Secretary of State devoted to upholding our nation's values abroad, practicing smart foreign policy, and keeping our diplomats as safe as possible. Add your name to say you're with her: hrc.io/201PFma"}]
