[{"comment_id":"10155216559835603","commenter_b":"I believe if you follow the rules it shouldn't matter if they have quotas.","commenter_a":"I never worked where there was a \"quota\". I could write as many as I felt necessary.","post_message":"Do you believe some police departments have ticket quotas? One police officer tells us tonight they absolutely do and he has the paperwork to prove it! News 4 Investigates this shady system: @webpagelink"},{"comment_id":"1338050419567745","commenter_b":"Ladies don't behave like that..","commenter_a":"Why are they so darned angry? It doesn't make sense.","post_message":"LIBERAL YOUNG LADY GOES ON RAMPAGE & DESTROYS TRUMP TABLE at COLLEGE (video) @webpagelink"},{"comment_id":"10153889494331438","commenter_b":"I just don't understand how people who vote for these whackjobs can imagine living in the world that they want to create. Talk about a hellhole..","commenter_a":"Ted Cruz's campaign statement that \"Muslim neighborhoods\" should be patrolled and militarized is possibly the least American thing I have read today. Land of the free, home of the brave? Nope, not so much because those brown people scare me! And who determines how many Muslims in one neighborhood is enough to warrant this police state attention? I live in a very nice neighborhood and although I don't know for sure (you can't tell someone's religion by looking, folks) there are possibly 4 or 5 Muslim families in my little 2 mile square housing tract. Would that qualify as a \"Muslim neighborhood\"? Jesus, these guys are scary. Bomb, kill, torture, create Muslim ghettos inside the United States. Ugh!","post_message":"Ted Cruz and Donald Trump have particularly harsh responses to the Brussels attacks."},{"comment_id":"1067594940000226","commenter_b":"#DumpTrump","commenter_a":"The ultra right wing justices that have been appointed to the court over the past 5 decades have done more harm then all the republican obstructionism. Obama needs to fill the seat ASAP with someone who will defend Roe v Wade, and keep the EPA on track to clean up our air and water for once and for all.","post_message":"Republican hypocrisy in a nutshell... Thanks to Democratic Underground."},{"comment_id":"690224757750904","commenter_b":"the only parasites and thieves are the palestinians and hamas","commenter_a":"Nice for starters!","post_message":"The US House of Representatives Armed Services Committee has approved $474 million for Israel’s anti-missile systems."},{"comment_id":"10153855606886336","commenter_b":"How come you mother fu*kers can't just go to school and stfu?","commenter_a":"Yes","post_message":"Are students demanding too much power?"},{"comment_id":"901769206549495","commenter_b":"Perhaps in fantasyland he's becoming a woman, but not down here where I spend my time - ON EARTH.","commenter_a":"Sorry Bruce, you're NOT becoming a woman - that's impossible. Your just taking hormones, and chopping your John-Thomas off.","post_message":"'Hey, guys, I'm becoming a woman' (Via Daily Mail Celebrity)"}]
