[{"comment_id":"10153696423508717","commenter_b":"And are spelled out for me in MY bible","commenter_a":"Hi! I'm an ignorant Facebook commenter. I disagree with/HATE anything that makes me uncomfortable and refuse to believe studies that are in contradiction of my beliefs. Only studies that agree with me are real. God bless!","post_message":"A new study in the Journal of Developmental and Behavioral Pediatrics finds that the kids really are alright."},{"comment_id":"10153416517971051","commenter_b":"She should not face any charges. She protects her child.","commenter_a":"You go girl he got off easy","post_message":"When this wife discovered what her husband did to her 7-year-old, she set him on fire."},{"comment_id":"1354400067935066","commenter_b":"Just try it you fucking bitch! Just try it!","commenter_a":"PRESIDENT TRUMP, PRESIDENT TRUMP, PRESIDENT TRUMP!!!! WE THE PEOPLE SAID SO!","post_message":"Discuss.   SHARE THIS and FOLLOW US at Reverb Press and Stories That Resonate for progressive news and opinion that you can trust."},{"comment_id":"665287136906749","commenter_b":"sadistic bastards will rot in hell.......","commenter_a":"Horrifying...","post_message":"The religion of peace continues to disappoint. @webpagelink"},{"comment_id":"10153475546708734","commenter_b":"So why is she crying rape now? It's not going to get her out of the ticket, is it?","commenter_a":"Sorry but she is not a victim! And the so-called officer is a POS!","post_message":"The female victim initially agreed to engage in a sex act in exchange for money. Then during that encounter, Tucker allegedly pointed a gun at her and forced her to engage in another sex act against her will."},{"comment_id":"963507617048798","commenter_b":"Black women live in public housing for generations it is time to let them live in the streets like white people do. 5 year limits on public housing so it does not continue as a breeding center for black skanks.","commenter_a":"Why do we have so many homeless? if our country has immediate help and housing for All the refugees then this country should have housing and help for all Americans immediately. No American citizen should be homeless, take care of our own First. Homelessness breeds all kind of crimes.","post_message":"Three teenage brothers suspected of a fatal attack in a #Seattle homeless camp known as ‘the Jungle’ have been charged with first-degree murder and assault. Michelle Millman reports what we know >> kiro.tv/JungleCharges"},{"comment_id":"10152731683061234","commenter_b":"Hey Mary... Go suck some cock","commenter_a":"yes, we the teachers, fire fighters, and police tried to tell you all! He is a liar and a crook and a bully","post_message":"Gov. Christie is probably hoping his 2016 presidential aspirations don't hinge on New Jersey voters. That's because a new Rutgers-Eagleton poll shows most Garden State voters believe he's a poor fit for the Oval Office."}]
