[{"comment_id":"1279992562041213","commenter_b":"Notice how he always gets phone calls telling him he's doing great...","commenter_a":"Your headlines are as misleading as the mainstream media...","post_message":"After how much Trump has frustrated America these last few months, it’s great to see the tables turned."},{"comment_id":"1141429345895300","commenter_b":"Why doesn't he close the border and escort all of the illegals & especially Muslims out of our country?","commenter_a":"TIME TO DOWNSIZE DHS. Secret police full of pussies. The whole thing is useless.","post_message":"BREAKING NEWS:"},{"comment_id":"825435090838373","commenter_b":"Low life piece of craps lock her away and throw away the key.","commenter_a":"Sick sick sick! Just beat her senseless for this. That poor innocent little girl. Hopes she rots in hell!","post_message":"This woman allegedly faked cancer to cover up a horrific crime:"},{"comment_id":"10154338661984087","commenter_b":"Keep sucking off your Arab whore","commenter_a":"Raper of Ex Wives and groper in chief","post_message":"“Look to his past to see what he will do for women in this country,” Omarosa said about Trump."},{"comment_id":"10152691528182293","commenter_b":"Shocking","commenter_a":"The poor isn't merely poor in finance & chance; more problematically, they are poor in thinking & vision making them poor all in their life.","post_message":"There is little empathy at the top."},{"comment_id":"10155939290119012","commenter_b":"No he's creating a disaster!! You cannot fix something that has been left go for decades! You can find a way to manage it and try and prevent the same things to keep happening! That is why Obama was smarter about it! He deported the ones that were a threat not a mother with kids! But I don't expect the right to understand this! You think acting like a dictator is going to help this country your dumber than I thought!","commenter_a":"Yes.","post_message":"YES or NO: Is President Trump making America safer?"},{"comment_id":"1095394503811232","commenter_b":"sounds racist to me. peggy pauley.","commenter_a":"I am so tired of people saying, we're going to take this country back, it's not been anywhere but here! Give it a break !!!!!!!!!!!","post_message":""}]
