[{"comment_id":"1022535797795443","commenter_b":"hahaha good one, and accurate.","commenter_a":"I flushed something more qualified than both of them this morning.","post_message":"LOL..."},{"comment_id":"10150832975979963","commenter_b":"Something tells me that the Bulletin of Atomic Scientists probably knows more about \"international nuclear weapons relations\" than you do.","commenter_a":"Anyone who thinks that this is \"Trumps fault\" doesn't know much about international nuclear weapons relations and the money exchange that goes with it, be it legal or not. Trump wasn't president then....","post_message":"According to the Doomsday Clock there's an increasing probability that the world will observe nuclear conflict."},{"comment_id":"10153589260353822","commenter_b":"Rebecca .... get out of the basement ....","commenter_a":"Requiring people to carry a concealed weapons permit is just another way the government can get your money. Do people actually think that criminals pay to carry a concealed weapon?? No, they don't. I think this is a great law, go WV!!","post_message":"Effective late May, people in West Virginia will be able to legally carry concealed guns in public without permits or training."},{"comment_id":"1182026965223689","commenter_b":"Those Redumblicans are getting worse everyday!","commenter_a":"He deserves what he got !","post_message":"Here's some more of those \"family values.\""},{"comment_id":"10153959018846341","commenter_b":"The problem that Islam faces is that it is continuously moving backwards. Even in the Islamic golden era, the economy was reliant on slaves and infidels. The only successful Islamic countries today are the ones that have massive oil reserves. Muslims living in countries with no resources tent to live in poverty. This is why you always see Muslims migrating into infidel lands but you don't see infidels moving into Islamic lands. I do believe that Islam will dominate Europe. I have no doubt. Firstly the countries will be split into two with one being Islamic and the other being Christian but the Muslims will continue to migrate into the Christian countries because they will be poverty stricken. Because sharia is so retrograde Europe will imminently turn into another failed Islamic state as they have no resources. European winters can be very hard If everyone wants to pray 5 times ...","commenter_a":"unfortunate though, but this is the same way Palestinians are wailing, groaning and moaning everyday yet no one seems to care. Let's not unite in periods like this alone but all the time.","post_message":"The residents of Belgium capital city woke up Wednesday morning to a new reality, on the day after the terrorist attacks that killed at least 31 people."},{"comment_id":"10153185123243984","commenter_b":"For all the rhetoric and obfuscation, will Gowdy, or anyone else, really have the stones to put this bitch in jail? Lord knows she and many others in this government belong there!","commenter_a":"Please... don't tease me.","post_message":"Trey Gowdy just hit Hillary Clinton with an attack that could end her presidential ambitions... Do you have Trey Gowdy's back?"},{"comment_id":"537911889728124","commenter_b":"Public service would be great; picking up road trash; working in the parks; finding real jobs and repaying money bilked from you and me. OR, whatever; probably don't need to put them in already over-crowded prisons; make them work, not get free room and board in jail.","commenter_a":"Yes indeed","post_message":"It's about time! Do you think all welfare abusers should be arrested?"}]
