[{"comment_id":"10154096555057452","commenter_b":"@username Hillary lost, get over it.","commenter_a":"This man needs to be brought up on charges of treason! He's against his own country and has sold his soul to the devil. How can he take an oath to uphold and defend this country and the Constitution when he doesn't even know what it says?","post_message":"President-elect Donald Trump tweeted that China should keep the U.S. Navy drone they seized in international waters.  China has already agreed to return the drone after the United States objected to the seizure."},{"comment_id":"10153271300604497","commenter_b":"Sadia","commenter_a":"Bmc Covert Joe Sanders","post_message":"\"Mom and Dad are going to be thrilled when I bring literally anyone home to meet them.\""},{"comment_id":"10157095473970206","commenter_b":"Because she's a lying scumbag","commenter_a":"GOP IGNORES CARLY FIORINA - WHY?","post_message":"The professional political class says whatever they need to do to win and then does whatever they please. We need to return to citizen government. Stand with me. Fight with me. Vote for me."},{"comment_id":"10154075665287377","commenter_b":"Denounce your US Citizenship,,proclaim illegal alien status anf receive FREE Medical from the Government!!!!","commenter_a":"Can't repeal it fast enough for me! My own insurance costs went up 700 bucks once Obamacare kicked in. Seems I'm paying for some family that can't afford their own insurance. Well... I can't afford their insurance either!","post_message":"Sen. Rand Paul slammed the Affordable Care Act, also known as Obamacare, saying Congress will, \"as its first course of action, vote to repeal Obamacare. It cannot happen soon enough.\""},{"comment_id":"10154278123559497","commenter_b":"so sorry, I hate seeing girls do this to gay guys","commenter_a":"As a gay man, this was the majority of high school. Being dragged along by my female best friend. Apparently as a gay guy I was supposed to Enjoy whole foods, Bloomingdales, frozen yogurt and Mac lol. Also always being asked for advice by every girl on guy issues.","post_message":"\"You just never know where the day is going to go with Paul.\""},{"comment_id":"1687154254839815","commenter_b":"To spy over the Congress and international leaders is a serious matter and the Congress should really act immediately to resolve it !","commenter_a":"Try him for his CRIMES!!","post_message":"Obama used the NSA to SPY on members of Congress to ram through his unpopular and disastrous Iran nuclear deal.   What do you want your Congress to do in response?"},{"comment_id":"1256741554345872","commenter_b":"Says the guy who looks like Peter griffin....","commenter_a":"So, liberals are proud of the filthy mouthed losers who interrupted good people coming to hear a speaker? Makes sense - birds of a feather flock together and liberals are losers. That is why people who seek to succeed hang around republicans and others who are successful.","post_message":"Watch Donald Trump get interrupted by protesters during his North Carolina rally on Friday. By the end of the night, Trump was heckled 10 different times.  Read full story: @webpagelink"}]
