[{"comment_id":"10153525074207994","commenter_b":"I have one get a wifeyou lesbian","commenter_a":"Gay people should respect non-gay people's Rights and don't be having sexually Haviar out in public keep it in your own home because I don't want to see it","post_message":"Pres. Obama's opening statement on #gaymarriage ruling: 'Our nation was founded on a bedrock principle: That we are all created equal.' Watch more: @webpagelink"},{"comment_id":"861173230647951","commenter_b":"She is crazy","commenter_a":"Just 12 years? WTF","post_message":"8-year-old Julie died the same day she was going to be a flower girl at a wedding. Her mom has admitted to killing her daughter."},{"comment_id":"10154486543656037","commenter_b":"Hillary has deceived all of u!!' Rosanna, this is what she wants. You're just as disgusting as her😎😎😎","commenter_a":"Trump has been saying the system aka Democraps is Rigged. I guess they gonna start saying build a wall next lol copy cat libtards!","post_message":"Elizabeth Warren: 'The system is rigged, and Donald J. Trump would make it worse.' @webpagelink"},{"comment_id":"1030297853698998","commenter_b":"Wow NOW THIS IS A TRAGEDY! A YOUNG BOY GUNED DOWN FOR NO REASON BY A THUG GANG MEMBER ! I GUESS IF A BLACK MAN KILLS A BLACK CHILD IT DOESN'T MATTER! BUT IF A WHITE COP KILLS A BLACK THUG COMMITTING A CRIME IT'S A BIG DEAL ! LORD FATHER GOD TAKE THIS PRECIOUS CHILD AND HOLD AND CHERISH HIM IN YOUR ARMS ! COMFORT HIS FAMILY AND SEE THE JUSTICE IS FOUND FOR THIS CHILD ! AMEN","commenter_a":"So where is the Black Lives Matter group now?","post_message":"Chicago Black Gang Member Lured Child From Playground And Executed Him Point Blank  You mean #blackLivesMatter protestors are not rallying for this 9 year old boy who was executed by a thug! I guess his Black Life Didn't matter   @webpagelink"},{"comment_id":"10153247991679342","commenter_b":"Abortion is good. They should abort all babies born before the mother is 25","commenter_a":"here we go, 'all these people worried about worms in the water and nobody cares that planned parenthood is selling dead babies!'","post_message":"One woman said she first noticed the worms yesterday in her bathtub and after collecting a few, she heard neighbors found the same thing.   @webpagelink"},{"comment_id":"993754734001845","commenter_b":"Yep she is the one who will carry on his legacy and bring in as many illegals and muslims for us to support until we no longer have a country to call out own while she and Billy relax in their luxury cabin located in some foreign land,, NO THIS bitch can not be allowed into any public office after this!","commenter_a":"I hope when they arrest her they freeze all her assets.","post_message":"“Hillary Clinton is my candidate for President of the United States. She is best positioned to continue the progress made by President Obama on a range of issues -- from strengthening our economy to making the right investments in our infrastructure to common-sense gun safety laws to ensuring a fair criminal justice system,” Transportation Secretary Anthony Foxx said."},{"comment_id":"1202021696499916","commenter_b":"Whos paying her","commenter_a":"as your house comes crumbling down","post_message":"An open letter..."}]
