[{"comment_id":"1236456179783965","commenter_b":"I was expecting a stripper jump on a pole. Boring.","commenter_a":"Nice speech, all lies","post_message":"Melania Trump speaks at the Republican National Convention. Watch the full live stream here: @webpagelink"},{"comment_id":"1334294883276632","commenter_b":"What a joke Hillary Clinton is! She's allowed to continue running while there is a fbi criminal investigation?! I wouldn't even be able to apply for a job at McDonald's if I were under a FBI criminal investigation! Nail that bitch!","commenter_a":"the traitorous bitch looks and sounds just like Nixon.","post_message":"BREAKING: Hillary Clinton holds press conference about FBI reopening email probe. VIDEO OF HER STATEMENT: @webpagelink"},{"comment_id":"519047684966878","commenter_b":"I wanna know what is fallacious about my statement. If we can't afford social programs to help the people of this country, how the fuck are we gonna pay for a war? Not a Bernie fan, but you can't trash one candidate because \"We can't afford him\" when Trump wants to cut shitloads of taxes, and THEN try to finance a mass deportation, a war, and then a wall. Don't even get me started on how prices will shoot up on produce, as well as anything illegal immigrants touch.","commenter_a":"Honestly Bernie Sanders not winning would make me lose complete hope for the US. They are being presented with one of the most honest, genuine, good hearted humans possible, yet they prefer to give the likes of Donald Drumpf and Hillary Cliton their attention. Jesus help these poor people.","post_message":"Sanders doesn't think the delegate count matters right now."},{"comment_id":"1648471502112051","commenter_b":"It never bothered Hillary, at least he recognizes it and is willing to seek advice.","commenter_a":"He's getting bald.","post_message":"This is not normal. This is not normal. This is not normal."},{"comment_id":"10152717878976770","commenter_b":"Too many nut-jobs in higher education these days. Bet she sues the school if she gets sunburn.","commenter_a":"Stupid is as stupid does and we all know you can't fix stupid.","post_message":"We're pretty sure that's not going to work..."},{"comment_id":"10153560422922629","commenter_b":"Hell yeah bitch","commenter_a":"This post glorifies violent masculinity.","post_message":"Two apparent members of the U.S. Marine Corps reportedly overpowered and halted the gunman."},{"comment_id":"10153080401256051","commenter_b":"There is a hog epidemic going on in the U.S. there destroying farms everyday...there's a big need to keep the population down. Quit crying your not the ones who's life's are being destroyed","commenter_a":"The ribs are good .. smokin low and slow.","post_message":"These hunters have one message and one message only for their critics: get over it."}]
