[{"comment_id":"10154026224212869","commenter_b":"I agree! There are plenty of legitimate issues that should convince anyone paying attention that Clinton does not belong in the White House. I feel like spinning 100 different (and in many cases overwhelmingly mean spirited) conspiracy theories makes the relevant confirmed issues on either side carry a lot less weight. I'm not saying that I don't think her health may be an issue, or even that it shouldn't even be written about, but there are 100 different reasons for a vehicle like that to include a wheelchair lift.","commenter_a":"Is anyone else tired of these feeding frenzies, I for one am.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153854379994486","commenter_b":"Criminal Hillary, silly Bernie out, Biden in without costing him a cent","commenter_a":"Good!","post_message":"If they're not panicking yet..."},{"comment_id":"10154534822598132","commenter_b":"The only way,she should have stop him is by calling the authorities. She need to go to jail,knonkle head","commenter_a":"She is as guilty as that stupid dude!!! She knows a thing or two she should be charged!!!!","post_message":"The second wife of #Orlando killer Omar Mateen has reportedly said she pleaded with him not to do anything violent."},{"comment_id":"1191348794238924","commenter_b":"She should keep her mouth shut and her daughter her legs shut","commenter_a":"Here is how I see it: The rediculous right always has an angle of deceit. Their only honor is to ones self and personal greed. No matter what they put out in propaganda the real truth about them shines in their actions and public statements. The problem with the left is they won't get up and go vote even by absentee ballot and let the post man do all the waiting in line when the religious right blocks off all the bathrooms.","post_message":"Sarah Palin wants you to fight against haters who want to take Christ out of Christmas by buying her ridiculous book."},{"comment_id":"10153003498236051","commenter_b":"He can be somebodys bitch in jail!","commenter_a":"Hang the SOB!","post_message":"This guy picked up a big concrete block and threw it. It landed right on a 7-month-old girl's head."},{"comment_id":"10154410865644091","commenter_b":"He better be ready for BIG POPPA'S in jail bc there gonna rip his A$$ for raping those little angels...Let's see how he likes it now! #ThrowAwayTheKey","commenter_a":"I hope you get yours in jail you pos","post_message":"JUST AWFUL: This Long Island man is accused of raping 2 young girls -- ages 6 and 7."},{"comment_id":"10152856815999753","commenter_b":"Lol. A lot of people. A perk of being a sociopath is the ability to manipulate people like butter. She's mentally unstable. The worst they do is put her in a padded room until they believe her meds and treatment are good enough to let her back out in society.","commenter_a":"Smfh.. Good! Let's see who she can manipulate like that behind bars!!! R.I.P.","post_message":"Michelle Carter said all the right things when her friend Conrad committed suicide. She even organized a fundraiser in the teen's name. Then police discovered the texts she had sent him."}]
