[{"comment_id":"10153906940493812","commenter_b":"Are you American? If your pro bringing terrorists into the country and giving them free benefits like Medicaid etc. while American citizens starve, how about we send a few to stay with you? Wait... I get it... 'Nuff said!","commenter_a":"After all, some Americans do have a heart. Way to go Pres. Obama.","post_message":"\"Apparently, they are scared of widows and orphans coming into the United States of America.\""},{"comment_id":"502464629957050","commenter_b":"NOOOOOOOOOOOO GO HOME WHERE YOU RUINED YOUR OWN COUNTRY","commenter_a":"If they are offended by the anthem of the country they chose to live in....the country that is giving them the right to spew their BS....the country that provides their safety and many welfare services....then I guess they can just GTFO.......","post_message":"Multiple Choice Quiz time, kiddies! Which answer did you chose? A or B?"},{"comment_id":"10153608463849440","commenter_b":"You are so uneducated, illiterate and pathetic. Worthless. Parasite. A rodent of no worth or accomplishment.Stop #WhiteGenocide 14/88","commenter_a":"Colorado is the epicenter of #WhiteGenocide and the GOP here is allowing it because they're afraid of calling Amy E. Brown and her #Blacklivesmatter5280 terrorist friends out.","post_message":"Editorial: Colorado Republicans made a big mistake in abandoning the 2016 presidential caucus."},{"comment_id":"619358388197343","commenter_b":"All he did was to let Iran know about our constitution .......","commenter_a":"It was well deserved. #1traitor of #47traitors","post_message":"What the heck is wrong with this dude?!"},{"comment_id":"10153244569769087","commenter_b":"Youare a fucking ignorant whore.","commenter_a":"Benjamin Netanyahu - is protecting the Free World while Hussein Obama wants the Deadly Suicide Pact with Iran. Wait until Iran hits America with their ICBM's, Iran can already Hit Israel.","post_message":"Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו delivered an intense silent protest of the Iran nuclear deal by staring down members of the United Nations General Assembly for nearly a minute without saying a word. WATCH:"},{"comment_id":"1318642101490448","commenter_b":"No dumbass that's why she lost","commenter_a":"No she is to crooked","post_message":"Honest question: Do you think Hillary Clinton would have been a better president than Trump?"},{"comment_id":"10155922805640725","commenter_b":"He will. Ana Smith . you are sick. Nasty mouth.","commenter_a":"Trump 2016 !! Make this country GREAT again!","post_message":"My #GOPDebate Facebook question for the other candidates-"}]
