[{"comment_id":"10154478047941051","commenter_b":"Well one girl just said that is white privilege so thats why you got to play with guns.","commenter_a":"I never liked Sarah Palin but don't see her grandson playing with a toy gun as an issue(key word being TOY here). I recall having a few toy guns as a kid myself and certainly didn't grow up to be a serial killer or anything of the sort.","post_message":"Bristol Palin is coming under fire after what her 8-year-old son is doing in this viral picture"},{"comment_id":"1304158649677186","commenter_b":"Pretty woman with a dirty mouth, ,, Perfect Clinton supporter","commenter_a":"Trump had this election stolen. He rigged it. He tampered with an election. That is punishable by law. Why isn't he being prosecuted? His evidence is on his computer. Why haven't they confiscated that and checked it out? This is a joke!! This whole voting system is a scam. We the people have no rights in our voting. Trump was right. It is rigged...in his favor!","post_message":"This is a must read for every disappointed Democrat."},{"comment_id":"1089823474413307","commenter_b":"Rhonda, your ignorance of reality is amazing!","commenter_a":"This administration MUST GO, PERIOD. Why is O allowed to take actions that have harmed this country in the eyes of the world???","post_message":"Yesterday, the Pentagon announced that the Russians could be told the location of our ground Special Operations troops in Syria, so that their Russian Air Force avoids them. This is a grave mistake. Once again, the President's administration demonstrates their inability to lead as Commander-in-Chief. Because he does not have an effective strategy for defeating ISIL/ISIS, he is putting troops on the ground without the protection of our air forces and asking the Russians, politely, to not bomb them. For over 50 years, our air forces have ensured no member of the American military has been killed by an enemy airstrike. I hope the Administration’s poor decision-making does not change this fact.  @webpagelink"},{"comment_id":"10153882907494024","commenter_b":"The monkey bitch and her brood can't be gone soon enough for my taste.","commenter_a":"She complains about the \"house\" she lives in. Is she chained to the wall-?? Just move, bitch-!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1272011979492601","commenter_b":"Not a fan of the Dixie chicks!!! Stay out of politics!","commenter_a":"This lady is disgusting. Don","post_message":"Natalie Maines of the Dixie Chicks said she was \"ashamed Ted Cruz is from America\" on Saturday, a comment that echoed her famous comments about President George W. Bush in 2003."},{"comment_id":"1149152748439068","commenter_b":"Kegels engaged automatically","commenter_a":"not a big white shark, just a fox shark","post_message":"Just stay calm, nothing to be afraid of ..."},{"comment_id":"1018949481459396","commenter_b":"Bitch","commenter_a":"So men are the most evolved. We do it since birth. Maybe that's why women never let us forget shit because they're living in the past.","post_message":"And that's why men have nipples!  Via Curiosity."}]
