[{"comment_id":"1017389715024162","commenter_b":"'@username Muslim terrorist ? Kill them simple.","commenter_a":"When you head to the polls in November, remember, Hillary Clinton tweeted this : 'Let’s be clear: Islam is not our adversary. Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.' — Hillary Clinton (@HillaryClinton) November 19, 2015..","post_message":"Newt Gingrich said President Barack Obama and Hillary Clinton are 'misleading' the American people about the #OrlandoShooting by refusing to say 'radical Islamic terrorism.' @webpagelink"},{"comment_id":"996990363669718","commenter_b":"'@username, if those that come from Mexico are such a hard working people like liberals claim, then they should use all the energy to fix their own place. Mexico required voter ID which in turn gives them capabilities of voting people into office. Fast forward to illegals here from Mexico claiming that is racist to require voter ID, while their own place mandate that they have one. Is all about getting free stuff without any output. For that reason I say screw everyone of them that break the law and move here.","commenter_a":"I live in a Muslim country here is like a hell because of being Muslims. Killing, kidnaping and beheading is an usuall action. If you want to be safe, don't let any Muslim live in America.","post_message":"NOT IN OUR COUNTRY."},{"comment_id":"10153692790361323","commenter_b":"I have a rare photo of Barack Obama actually working as President instead of playing golf. Rarest thing around. Unfortunately, as with everything connected to Obama, it is worth SQUAT.","commenter_a":"lovely","post_message":"Henry McCarty, known in Wild West lore as Billy the Kid, lived a brief and violent life, stealing and killing before his death in a gunfight aged 21. He lived with a gun in his hand – and sometimes, it seems, a croquet mallet.  Read the extraordinary story of how only the second photo ever authenticated as showing Billy the Kid came to light: @webpagelink"},{"comment_id":"10153644969898812","commenter_b":"Those flags do not represent the United States that I love.","commenter_a":"The church did not request it. The church is private property. Why does anyone think that TRASH should be placed on church property? If it is so much 'Southern heritage,' why was it placed on a predominantly black church? Is that like burning a cross on someone's lawn?","post_message":"Four Confederate flags were discovered this morning by the Ebenezer Baptist Church and the Martin Luther King, Jr. Center: @webpagelink"},{"comment_id":"1827275810826011","commenter_b":"Fuck you, bitch. Your head is up your little ass.","commenter_a":"vote for none of the above, the masses need to start a revolution and jail the corrupt 1% who pretend to give democracy in a nwo dictatorship , wake up and fight for your human rights","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"706998779490700","commenter_b":"I'll help her pack!!! Don't let the door hit your big fat ass on the way out!!!!","commenter_a":"She is as big a piece of shit as her husband","post_message":"Michelle Obama was caught bad mouthing America in this newly surfaced video. If she doesn't like America, she can leave. Would you be happy if Michelle was gone?"},{"comment_id":"10154095475454575","commenter_b":"Fry him.with low power so he feel the pain .","commenter_a":"Just fry him. No need for him to live another day","post_message":"The toddler and the 14-year-old have been diagnosed with HIV, genital herpes and chlamydia."}]
