[{"comment_id":"10152725766556636","commenter_b":"I know of at least one Christian religion that forbids voting. There's only a big deal being made about it because it's Islam. Having said that, I don't know what else this preacher has said.","commenter_a":"So voting is something that happend 1400 yrs ago.","post_message":"Apparently it's a 'sin'..."},{"comment_id":"10154504498488655","commenter_b":"@username You can tell 84Lumber just how much we don't need illegal immigration: www.84Lumber. com","commenter_a":"Hmmm if they wanted to show people on the path to becoming legal Americans, why didn't they show them going to the embassy and applying for a visa? Some dramatic music while they fill out paperwork","post_message":"Who didn't see right through that?"},{"comment_id":"1809165166033201","commenter_b":"You want healthcare get a job why should we pay for others","commenter_a":"You just say it and think it us true???? Lies!!!","post_message":"President Barack Obama holds news conference at The White House ahead of overseas trip. @webpagelink"},{"comment_id":"10153078951184255","commenter_b":"Soon...","commenter_a":"This is a problem for men too. Imagine the state taking your testes and telling you what you can do with them.","post_message":"American women, in states both red and blue, have been detained, imprisoned, and even forced to undergo unwanted surgery because they have been guilty of being pregnant."},{"comment_id":"1357769630924322","commenter_b":"This story is a distraction tactic to pull attention away from the real story. Americans seem to fall for it every time. Next week it will be something else..keeps us divvied and look we are.","commenter_a":"Oh, and another thing Far Left Liberals. The Head Muslim wants to destroy USA with his crazy Muslim immigration scheme so the U.S. \"can be lowered to the standard of the rest of the world\" is lunacy! Obama is a Muslim, this is not a Muslim state although he is trying to make it so..that is his Legacy. That is why Trump was elected. We are not the Muslim States of America!","post_message":"Hell has officially frozen over. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152995429007507","commenter_b":"So you won't procreate?","commenter_a":"Ha-ha.","post_message":"Clock started...."},{"comment_id":"1270991109602974","commenter_b":"You are full of BS. Damm Obama imported these terrorists and should be charged and prosecuted!","commenter_a":"It doesn't matter what kind of statement Trump makes if it's not from the heart and just words he thinks people want to hear it meant nothing at all. When our PresidentObama sends his condolences and express his deepest regrets it is from the heart. Trump on the other hand is only putting on a show to try to make President Obama look bad because that is what all the Repugs do!! Won't work!!!","post_message":"This is what a real leader does!"}]
