[{"comment_id":"10153153963941336","commenter_b":"***SCHEXNAYDER SPEAKS ON: HILLIARY*** ========================================= Is that the same Hil-liar-y who was fired from the Watergate Staff? The same weasel who could not find Rose Law Firm records for years? The same shrill potty mouth who said “I don’t recall” 23 times under oath to avoid answering? The same feminist who stayed with a known 30 year serial adulterer, bold liar and pure slime ball? Who lied and trashed women abused by her horndog perjurer hubby? Who wrote the book on arrogance with refusals and rants? Who, at the very minimum, enabled Benghazi? It is! And her 2015 slime update…HRC had an ILLEGAL private server for her State Dept. e mail! Hillary won't take questions -- at event honoring journalism... Drama over e-mail intensifies... Committee: 'Scheme To Conceal'... Violated 'clear-cut' State Dept. rules... Clinton Internal Cable Banned Use! Team Evaded Records With Instant Message... FLASHBACK: Hillary Bashes Bush Officials for ...","commenter_a":"It is obvious that @username and the other main stream media are supporting Hillary. After all, how many times do the public have to be told that she is running. It is apparent that you all are anxious to keep her name in the public eye.","post_message":"BREAKING NEWS: Hillary Clinton announces 2016 presidential campaign. @webpagelink"},{"comment_id":"10153516705331337","commenter_b":"I'm sorry but what did he expect...how sad that I grew up.on this family show N all his family n friends stood by him while he lied","commenter_a":"Bye asshole.","post_message":"FALL FROM GRACE: The Bill Cosby saga continues as word has broke that the comedian's talent agency has cut ties with him over his sexual allegations..."},{"comment_id":"10154979163784712","commenter_b":"@username she has given no reason for anyone to respect her. She is disrespectful, offensive and rude.","commenter_a":"Ugh .... for fucks sake ... \" the tax payers are funding this \" you fucking idiots!! He is gutting federal funding from science to build this stupid fucking wall ... p.s most illegal aliens are here from over stayed visas ! From countries they took planes from ! Besides don't you watch international news ? Cartels use tunnels now to bring in drugs you fucking dummies !","post_message":"Trump will sign executive orders enabling construction of a border wall and targeting sanctuary cities."},{"comment_id":"10153633737712464","commenter_b":"Go Cruz go. Tell the facts and let the media put a liberal spin on it. Planned Parenthood was meant to be racist by stopping more poor from the welfare rolls. \"HA!!!!\" They will say,\"It was an attempt to keep the Black Community from expanding the Voters Rights', or something like that. That's why Planned Parenthood buildings are in poor economic ares and not down the street from the $600,000-2 million dollar homes. Don't have to waste the fuel bills on buses that far out. Economics for the city. See it's not about lives. IF \"BLACK LIVES MATTER\", why is there even a dialogue about the killing of souls.","commenter_a":"Smarti - I aam not really interested in PP and I am sure you are looking up everything you can find to repudiate what Cruz says. Good for you if you think PP is on the up and up. I just don't understand paying all that money when it is not a gov operation. If it is a private business - great - let them fund themselves, don't use our money to help pay$ 600,000 salaries along without mentioning all the other expenses. I read $1.2 mil spent on things other than women's health. I really don't care about that stuff. I am more interested in what is going on in Syria etc.","post_message":"It says something about just how corrupt this administration is that there is not a soul on earth that believes the Obama Justice Department would even begin to investigate Planned Parenthood."},{"comment_id":"1328476607175126","commenter_b":"Lachy are you mad?! Let's do the gym like this next year! A Christmas wonderland","commenter_a":"@username Lachy Munro","post_message":"You think you love Christmas? This couple has more than 100 Christmas trees in their house."},{"comment_id":"10154404411899877","commenter_b":"Well said","commenter_a":"We have a long way to go when race and sexual identification are listed when recognizing someone for a new position. Only time sexual orientation should be consider is when trying to hook someone up on a blind date.","post_message":"A black, queer woman being named EIC is one of the biggest media brands in the world is EPIC!"},{"comment_id":"10154126092428132","commenter_b":"So sorry to hear your loss and prayers goes out to you and your family God bless","commenter_a":"Prayers for your brother so sorry.","post_message":"The news comes just a day after Celine Dion lost her husband, Rene Angelil, to the disease."}]
