[{"comment_id":"849893008534609","commenter_b":"Donna Lee Hendee is it A law in Mexico that they speak Spanish ? Is it a law in Germany that they speak German? We have so many laws that are already not enforced what are they going to do arrest people that don't speak English. Sounds a little ridiculous to me.","commenter_a":"I thought it already was. What school did this idiot go to? Anyone that was born here should already know this. So we need a law to make this politically correct ....go for it and if it doesn't pass anyone that didn't vote for it should be deported to the country that speaks the language of their choice.","post_message":"He is going to make this the official language of our country. This is ridiculous. We stand behind him. 'LIKE' if you support him!"},{"comment_id":"10153330405506130","commenter_b":"Exactly. Plus her job is simply to determine if a couple qualify for marriage under the law, not to marry them. She isn't advocating gay marriage by signing the licenses, her signature simply states they are lawfully allowed to wed. Her fucking religious views don't even apply to her job, the fucktard! She is simply trying to use religion to justify her bigoted attempt to judge others and not do her job. She is an employee of her state/county, and bound to the law. If she wants to have her religious views dictate her job she needs to be a clerk for a church. Then she can be a bigot all she wants.","commenter_a":"She is a public servant...to serve ALL the people...not just the ones she agrees with...there's a little thing called \"separation of church and state\"...","post_message":"\"We cannot be held hostage to the theatrics of religious extremists.\""},{"comment_id":"10153048383476336","commenter_b":"women are beaten in the us lot more than in the arab countries","commenter_a":"She won't get hurt... this guy is not isis ... he is just a scholar. .. she tried to make a point but he was right they promised him more time to get his point clear... they had no patience both because the show time was short just a huge misunderstanding. .. people like him show Islam bad because he wasn't showing Islamic real manners ... he was disrespectful and impatient. ..","post_message":"We may have found the Middle Eastern Megyn Kelly."},{"comment_id":"10157009352015557","commenter_b":"Did you not read the article? Duh","commenter_a":"They need to arrest the parents of these minors who gift him their child","post_message":"A Bucks County man is facing multiple sex charges after police say a dozen girls were found in his home, including one girl who was \"gifted\" to the man by her parents."},{"comment_id":"10152999859350090","commenter_b":"He is gone. Concentrate on what is happening NOW!","commenter_a":"yes , in my lifetime. Teddy Roosevelt runs neck and neck. different reasons.","post_message":"Tell us if the Gipper tops your list. The Historical Presidents Poll: @webpagelink"},{"comment_id":"10157007075205725","commenter_b":"#BOGOSale - FINAL CLEARANCE: Hypocrite Hillary AND Slick Willie = two for the price of one!! CLEARING THEM OUTt!! #TrumpTrain #MakeAmericaGreatAgain","commenter_a":"Trump versus Hillary, lets do this voters. We do NOT need Hillary (Obama) Clinton in the White House. Thanks Mr. Trump. Vote Trump...lets get him to Washington!","post_message":"So interesting that Sanders beat Crooked Hillary in Indiana. The dysfunctional system is totally rigged against him!"},{"comment_id":"10153462530999255","commenter_b":"The Chinese will be happy to take its place!","commenter_a":"Is that dog shittin in the flag. Thats just wrong just wrong.lol","post_message":"You don't see Nazi memorabilia on the Antiques Roadshow for a reason."}]
