[{"comment_id":"10153594366538352","commenter_b":"Kiss my black ass old lady!","commenter_a":"Wait let me get this straight well never mind because I know if he was black it would've been reported when he took a crayon from school because that's how deep they dig! #BlackManCantFartWithoutBeingCalledAnAnimal","post_message":"Biker killed in Waco shoot-out was a law-abiding decorated Vietnam veteran with Purple Heart, records reveal – despite police claims that all 9 dead were criminals"},{"comment_id":"1229225200430841","commenter_b":"I do agree though a little white girl wouldn't have been thrown to the ground...","commenter_a":"While the student was wrong in her choices to be disruptive, disrespectful, ignorant and arrogant. The officer also was wrong in the amount of force that he exuded on a MINOR. Regardless of the ignorance and attitude shown by this student. I worked in a school and have 6 children of my own. Some children nowadays are extremely difficult to manage and teach. I agree. My own children know better than to even entertain the thought of being disrespectful, they know their behavior has consequences. Not all children are raised in that type of loving environment. That is NO excuse for this child acting like a spoiled brat with a chip on her shoulder who obviously has authority issues. That being said, back to the police officer who felt the need to use his authority and man handle a child. Simply because you're annoyed and irritated that a child defies ...","post_message":"This video taken from inside a South Carolina high school classroom on Monday shows a police officer body slamming a female student and dragging her across a classroom. The chorus of parties angry over the confrontation continues to grow, as the sheriff's department investigates. @webpagelink"},{"comment_id":"10156349678780354","commenter_b":"They can cut off their cocks all they want. DNA will still say male no matter what. Liberals always want to Goto science to try and disprove the Bible but don't with this sick shit. God bless Texas for taking a stand!","commenter_a":"I'll show you mine if you show me yours. President Obama said it's perfectly alright.","post_message":"How upside down is the world when this even had to be voted on in the first place?  That said, LOOK at the percentage of Houston voters who voted for and against this..."},{"comment_id":"10153496846973132","commenter_b":"I highly doubt they kept having them JUST to have a girl.","commenter_a":"How selfish, to keep having kids only hoping for a gender. That 13th boy will someday realize he was only born because his parents hoped he'd be a girl.","post_message":"Maybe the 14th time's the charm?"},{"comment_id":"10155940729650354","commenter_b":"Sick disgusting bitch","commenter_a":"hahahaha yes she was tim...","post_message":"Unbelievable...."},{"comment_id":"1159718984066336","commenter_b":"Hang that ugly devil.","commenter_a":"go figure","post_message":"Disgusting."},{"comment_id":"798433503628356","commenter_b":"What the hell is wrong with women???","commenter_a":"Well said Kimberly!","post_message":"Hundreds of thousands of Americans are marching on the streets of the nation's biggest cities for the Women's March"}]
