[{"comment_id":"708523179338260","commenter_b":"Bust his ass .","commenter_a":"kick its ass out of the school","post_message":"Cross dressing boy entered girl's locker room and did this.  This is wrong. The boundaries need to be drawn.  Would you want this boy in your little girl's locker room?"},{"comment_id":"10153244539676756","commenter_b":"And women like @username have no problem eating corn on the cob with those buck teeth!!","commenter_a":"Glad I live in the U.S.!!","post_message":"In Russia, women are prohibited from doing 456 types of work.   In Nigeria, it's not a crime to hit your wife for the purpose of \"correcting\" her.   In Iran, a woman can be jailed for not following the Islamic dress code, which includes wearing a hijab."},{"comment_id":"549469748549029","commenter_b":"That's y he got molested in jail for being a fucking bitch... Some1 should at least throw some boiling water on him so he can see how that feels","commenter_a":"Ryan Smith","post_message":"Heartless: Scumbag Throws Boiling Hot Water On A Cat!"},{"comment_id":"1150774161677077","commenter_b":"She needs to be unseated","commenter_a":"Trump will get rid of the Democrats and Republicans that have been in the Senate and Congress way too long and Barbara Boxer is one to go for sure. All of a sudden because Hillary lost the election now the Electoral votes have to go, maybe if you picked a candidate that wasn't crooked and a continual liar you might have had a better chance. Enough of the liberal bulls--t accept the loss and move on.","post_message":"This comes after Hillary Clinton won the popular vote, but lost the election."},{"comment_id":"10152982491580927","commenter_b":"She is only interested in Pelosi.","commenter_a":"She wouldn't know, hers never started","post_message":"Pelosi:  think I know more about this subject than you, with all due respect."},{"comment_id":"352745464928968","commenter_b":"Her lips weigh more than my kids\"!!!!","commenter_a":"Who cares what she wants. She needs to minf her own business.","post_message":"Michelle Obama Wants to Weigh Your Fat Kids"},{"comment_id":"10154027986557293","commenter_b":"She might Not be a ten but she still has Some Nice tits","commenter_a":"Can i drAw your Attention to an unrelated issue though; Chelsea , Being a mildly Hot Chick, is married to a nerdy looking dude with Glasses. I absolutely hate iT when beauriful women marry or have a relationship with nerdy looking men","post_message":"Ivanka Trump says she supports working moms. The women who design her fashion line don’t get paid maternity leave."}]
