[{"comment_id":"10154533749294062","commenter_b":"Lilly Cantor your a dumb young blond and still blind to the horror the earth has to offer so let me educate you . Among these people that actually need help there are terrorist trying to infiltrate us to attack us . So while your feeling bad terrorist are coming over plotting an attack . Bam attack happens then your like awww so sad but don't realize among these refugees there were terrorist . Terrorist are cowards that attack dirty . There goal is killing as many people as they can . So before you let people into our house AKA United states might want to consider would I let these people in my own house not knowing who they are","commenter_a":"Thank you Canada! It will take all of us to save these people from the horror of ISIS. They have already suffered so much and lost everything. The least we can do is welcome them With compassion.","post_message":"Canada will allow 25,000 refugees to resettle in the nation by February, with up to another 25,000 by the end of 2016."},{"comment_id":"1246596595370794","commenter_b":"I commend you for being relentless and honorable. It is a very hard row you hoe in the cesspool in Washington D.C. I hope you have hazmat insurance. With deep respect, SFL","commenter_a":"Hon Gowdy, you have the support of the American people, Why, please tell, has the Congress of the United State, officials that we, the American people elected to represent us th the American peo have not brought charges against the current Administration, contempt, treason, murder, deriliction of duty, incompentence, assisting the enemies of the United States, Why Senator? Why? Why are you with the help of the rest of Washington letting us down?","post_message":"It’s taken way too long and way too much of our energy in simply gaining access to #Benghazi documents and witnesses. There continues to be time wasted negotiating with executive branch entities who do not want to give us what I believe Congress is entitled to."},{"comment_id":"10153956285791880","commenter_b":"@username I'm white. I'm not mad bro. But was that kid in Ferguson mo a thug and literally just robbed. Convenience store? Sure back lives matter.. I'm indifferent tho.. Any race, sex or creed comes at me Wrong I'll end you. Period.","commenter_a":"All the white ppl mad!! Lmao, after the 400+yrs of oppression that they weren't victims of, they want to be included in a black lives matter movement... Smh, never been discriminated against, but black lives matter is a racist cult?? Can't c the forest from the trees...","post_message":"The Facebook CEO issued a companywide memo chastising employees who have been crossing out the phrase “black lives matter” and writing “all lives matter.”"},{"comment_id":"10153676761856623","commenter_b":"I just don't understand how people would want to vote for this lying deceitful person with a terrible plot up her sleeve! She is a lying snake! Now I'm not saying a support trump either but this lady is just flat out terrible!","commenter_a":"I also keep two calendars, one for business one for personal stuff.","post_message":"Hillary Clinton kept two calendars when she was secretary of state — one for the public, but another that included meetings with political donors and loyalists, Wall Street bankers and Clinton Foundation contributors."},{"comment_id":"1719601761432898","commenter_b":"Similar... squeeze out a parasite living off the host....","commenter_a":"I don't know which news item is more intriguing - this, or Kim Kardashian's wanting a divorce from Kanye West. It's so hard to keep up, with so much happening these days.","post_message":"Oh no. (from Elite Daily)"},{"comment_id":"10153648565856320","commenter_b":"Gather them up like cattle. Send them to Iran or where ever and let them find isis","commenter_a":"Just stop with the protests and move on. If they only knew how ridiculous they look continuing to honor a criminal.","post_message":" recent acts of violence will not be tolerated in a community that has worked so tirelessly over the last year to rebuild and become stronger. - St. Louis County Executive Steve Stenger State of Emergency issued in St. Louis County, Mo., as they prepare for a second night of protests in Ferguson. More Details: @webpagelink"},{"comment_id":"10156583768975389","commenter_b":"Build #TRUMPWALL","commenter_a":"Google Trends data shows Donald Trump was the most searched candidate during the debate, both in Iowa and across the country.","post_message":""}]
