[{"comment_id":"1091470624223610","commenter_b":"I beg the differ sir! Here's one for Trump!! I want at first, but as this plays out, he is the only out sider I trust!!","commenter_a":"You are so wrong again. Stop you are losing all credibility. Your own hate for Trump, is going to be the end for you.","post_message":"\"You're damn right.\""},{"comment_id":"10155391661993797","commenter_b":"What a shame send this animal to jail .","commenter_a":"Very sad","post_message":"A young mother is facing child abuse charges after police say she kicked her 4-year-old daughter in the stomach for not brushing her teeth. The girl is hospitalized in critical condition."},{"comment_id":"10153624513811336","commenter_b":"Now the world knows what Cheryl is all about when it comes to black people..","commenter_a":"We also have a president who has made it open season on our police officers.","post_message":"This week on Fox News Sunday: Gov. Chris Christie discusses his 2016 strategy, the government and more. Check your local listings or tune in to Fox News Channel at 2p/6p ET."},{"comment_id":"10152907297842507","commenter_b":"look at them idiots......fff","commenter_a":"we need a new classification. White-Black-Latino-Asian-Native American-Loser.","post_message":"Anyone want to weigh in?"},{"comment_id":"1092357044118639","commenter_b":"Except the assholes wouldnt drown. They'd just move to your neighborhood. I'd rather have them where they are right now.","commenter_a":"So basically where all the assholes in the U.S. live would be underwater. Anyway we can make this happen overnight?","post_message":"Would your city survive? What would Earth look like?"},{"comment_id":"1064358433623633","commenter_b":"TRUMP GO back TO Hell","commenter_a":"Can these idiots be any more reprehensible?! The Repugs care only about the top 1%.","post_message":"The right's hostility toward the working poor is now front and center."},{"comment_id":"10157519592720206","commenter_b":"Lol You're aware this is in America. Not illegal here.","commenter_a":"It's actually illegal for major super markets to charge for a plastic bag because for example say tescos they can't charge you because your advitizing tescos through the bags also store laws are to provide bags for customers not well not sell them to us","post_message":"Get ready to pay 5 cents for a plastic bag."}]
