[{"comment_id":"1270740256295648","commenter_b":"* \"You shut your whore mouth!\"","commenter_a":"Shut your damn mouth.","post_message":"We're going to talk about this one for a while."},{"comment_id":"10153877840551337","commenter_b":"I always hated rousey I'm glad her ass got knock the fuck out","commenter_a":"Truth is holly Holm is a real fighter n Dana white thought he picked another easy girl for Ronda to destroy well plan back fired ,Holm is a real fighter and real champion now let's see her n cyborg fight two top fighters Rousey is finished","post_message":"DAMN: Holly Holm didn't hold back with these comments about Ronda Rousey."},{"comment_id":"10152912675916051","commenter_b":"smith you ain't a pimple on my ass. Your pissed because everything I said is true. And I hope you need a cop and they make a stop on the way. Your not in my tax bracket, you don't have any skills ( unless having the government feed and house your little bastards ). All you good at is living off other people and their money. Your nothing but a waste of skin. Get a life and a job. Your the POS loser. And I can see you never served your country either, have you bitch?","commenter_a":"They said they filmed it. Were the hell is the rest of the film. It's funny they only show the cop saying something. What was said and what happened up to that time????","post_message":"When the guy in the car asked why he was being arrested, the officer didn't miss a beat: \"Because I feel like arresting you.\""},{"comment_id":"918244381576759","commenter_b":"She is a freaking fat ass I've seen pictures of her shoveling food in her fat face the fat bitch","commenter_a":"Serve it or she'll dip her balls in the mashed potatoes and gravy!","post_message":"Michelle Obama Orders Schools To Feed Children Her Slop Or She Will... Ugh. Totally gross! SPREAD THIS EVERYWHERE! @webpagelink"},{"comment_id":"1092696630813956","commenter_b":"Ur aunt eats them out of a can","commenter_a":"Quan Lawson","post_message":"This massive octopus escaped through a tiny hole in a fishing boat."},{"comment_id":"1185052468202276","commenter_b":"@username . Yes, it has worked out very well for me. My wife doesn't just not mind, she really likes my beard. As for the women \" that do were and are not interested\" in me- I couldn't care less, they are irrelevant. I have a beautiful wife. You are right in that everyone has physical preferences, I for one am not attracted to women with silicone breasts and/or mullets. Perhaps one day soon, when you hit the menopause, you might grow yourself a fine, full beard and be proud of it. All the best!","commenter_a":"If you can grow a beard, then why not? I really couldn't care less if someone finds my beard unsightly. You should be proud of your masculinity, not try and disguise it. I spend most of the daylight hours outside, the beard helps protects me from the elements and from those of a nervous disposition.","post_message":"Just one more reason to love beards!"},{"comment_id":"10153271978657411","commenter_b":"White trash.","commenter_a":"I don't really care.","post_message":"HAPPY BIRTHDAY, #FLOTUS! First Lady Michelle Obama is celebrating her 52nd birthday today!"}]
