[{"comment_id":"978723315520750","commenter_b":"With photographs like that, she ain't no lady!","commenter_a":"too much hate toward this young lady. Racist white pigs","post_message":"It's the pool party that forced a police officer to resign...but the organiser has got a modeling contract out of it"},{"comment_id":"745372418902804","commenter_b":"Throw the Illegals out. Send them all to Germany and have Merkel deal with them!","commenter_a":"Why the smirks???? Like saying I know something you don't know.","post_message":"Austrian police says 6,500 people crossed into the country on Saturday, with the number predicted to rise to 10,000; most en route to Germany"},{"comment_id":"10154048103696409","commenter_b":"Hey Betty eat a dick","commenter_a":"Lovely Family ! May God continue His Blessings on them!","post_message":""},{"comment_id":"1255582551128439","commenter_b":"@username No that shooter was a Mentally Challenged person . Most of the MASS SHOOTERS have been Mentally Challenged. You ask why are they allowed to roam the streets? Well, they took the money to contain and treat them and gave to to the unwed mother to have 20 kids with and to provide Food Stamps. DO NOT under estimate the challenged ones. Some are very smart and great at solving problems. They just can't function in society.","commenter_a":"Here's what we now so far: Syed Farook and Tashfeen Malik met in Saudi Arabia. Farook was described as a devoutly religious Muslim (most likely Sunni). The third suspect, Tayyeep Bin Ardogan, is a 28-year-old native of Qatar. Only Farook was employed by the agency hosting the Christmas party. Multiple explosive devices were discovered at the scene of the massacre. IEDs (improvised explosive devices) are illegal in the State of California. IEDs take time to build. Obviously, there was some planning involved. IEDs are mass-casualty weapons that kill indiscriminately. They're not something you use when you're concerned about casualty mitigation and innocent bystanders. A coworker stated that Farook had grown out his beard over the last several months. The geniuses in the DOJ (namely the FBI) are trying to ascertain a motive. That's nice. Let's see how long it takes them to put the pieces together.","post_message":"The suspects in the San Bernardino shooting were armed with four guns and an explosive device in a \"well-planned\" attack, officials said."},{"comment_id":"10153367741477411","commenter_b":"Good. Disgusting woman","commenter_a":"I say she probably didn't know anything about it! My sisters ex husband was a cop and she knew nothing about the \"dirty deeds done dirt cheap\"!","post_message":"Fox Lake lieutenant Joe Gliniewicz's widow Melodie faces several conspiracy charges as well as charges on money laundering and the misuse of charitable funds."},{"comment_id":"10155790641929778","commenter_b":"Were you guys offended when Obama did it? This is why nobody trusts the media, it's completely bias!","commenter_a":"If you, or anyone you know, is personally affected by this ban, please reach out to us. Message us on Facebook or email newstips@wusa9.com.","post_message":"More than 30 protesters are holding signs against President Donald J. Trump's immigration plan at Washington Dulles International Airport. @webpagelink"},{"comment_id":"10154557994494087","commenter_b":"She is a lunatic! Ugh","commenter_a":"Jeff Sessions was that racist that prosecuted the KKK and has many black friends who defend him, yet Senator Warren throws the racist term around while pretending to be a native American? I don't get it. If you just hate someone just say it. Calling him a racist simply makes Ms Warren a racist and someone who stole from native Americans in order to further her financial coffers. You ma'am have Skelton's in your closet, live in a glass house yet you cast the first stone. Remember those HS days and your words Senator Warren.","post_message":"Elizabeth Warren: “Consider this MY warning: We won’t be silent. We will speak out. And we WILL persist.”"}]
