[{"comment_id":"947484675311281","commenter_b":"This is why so many people are against Muslims. I've sat and ate meals with people from all over the world with differnt faiths and never had a cross word. It's all about give and take yet some Muslims can't grasp the idea of peace and harmony. The reason why they all want to come to England and screw our little island up is the free hand outs. VOTE UKIP and maybe we can stamp the minority out and make it harder for these people to enter our island.","commenter_a":"This not surprising. What surprising is he is not in jail for what he just said.","post_message":"Sean Hannity: 'You want her to die!?'"},{"comment_id":"10153256924124726","commenter_b":"What a jackass","commenter_a":"None of them were born in Africa.","post_message":"WATCH: Obama on Baltimore: \"Too Many Instances\" of Police Target Poor African Americans"},{"comment_id":"10155012522801944","commenter_b":"It's now about money Obama laid out a lot of this deportation and Trump has to bite the bullet. Now back to money. Only ones going to make money on the deportation of illegals are LAWYERS. Lose. Lose situation for the illegals. Serves them right? Our forefathers and mothers came in legally Any questions ?","commenter_a":"Id like to see 365 days without illegal immigrants. enforce the law deport illegals.","post_message":"Serves 'em right."},{"comment_id":"10152862008521336","commenter_b":"I'm so glad they caught those scumbags without more bloodshed. It still is b@llshit that some people think shooting at cops is an appropriate action to try and prove a point. If you want a lawless society I'm sure there is some third world country that will accept your dumb@ss.","commenter_a":"He Could Be Obama's Son!","post_message":"UPDATE: Two suspects are in police custody Tuesday for allegedly shooting two plainclothes NYPD officers responding to a robbery."},{"comment_id":"1147470615320800","commenter_b":"For one I'm not a dumb ass.So don't call me names.Im a lady.And I will vote Hillary","commenter_a":"Clinton for president","post_message":"BREAKING: ANONYMOUS Set To Drop MOTHER LODE On Hillary TOMORROW... Here's What We Know [VID] \"EVIDENCE EXPOSING THE LARGEST COVER-UP IN AMERICAN HISTORY!\""},{"comment_id":"1166185690114851","commenter_b":"I agree Awesome comment thanks :/","commenter_a":"OG gives zero fucks","post_message":"Uber driver loses it after man smokes weed in his car"},{"comment_id":"10154376040464641","commenter_b":"making of The Taken 3 (Must watch Unbelievable) @webpagelink","commenter_a":"That's what we should be doing focusing on the dummies in the audience, the cockroaches","post_message":"Donald J. Trump's controversial \"Second Amendment people\" comment made Darrell Vickers' bearded jaw drop."}]
