[{"comment_id":"10153856032800329","commenter_b":"Yea I agree. They should of had variety of women. Not all overweight women have round faces. Chubby face yes. They are all pretty but some of those cuts I wouldn't do on most women, regardless of their size.","commenter_a":"A round face shape doesn't mean you are over weight. And these cuts were not exactly flattering to these women. Ijs.","post_message":"Warning: this post will make you want to get your hair did asap."},{"comment_id":"10154575281024877","commenter_b":"Melania looks like Caitlyn Jenner. !! !!","commenter_a":"Jobin, I fell the same way sometime it takes something to open her eyes maybe this is it","post_message":"This is one of the main reasons we need to stop treating Melania like a helpless victim."},{"comment_id":"10154108644646178","commenter_b":"This is where GWB, Dickhead Cheney and all those racist MURDERER Cops belongs. They are the real MURDERERS !!!","commenter_a":"Stupidity abounds in the liberal media. Wake up folks!","post_message":"\"Well, actually, again, if you are a terrorist you belong in Guantanamo Bay. That where they should stay....\""},{"comment_id":"935532149828645","commenter_b":"No refugees immigtants.We're your great great.oh Grandparents Irish immigrant ?","commenter_a":"NO REFUGEES, NONE ! We Americans do not need more problems in our country. Stop them, am I CLEAR ?","post_message":"Our nation has always been welcoming, but we can’t let terrorists take advantage of our compassion. We should not bring Syrian refugees into this country unless we can be 100 percent confident that they are not here to do us harm."},{"comment_id":"10153124217341051","commenter_b":"Ive seen women pulling crap everything from getting a friend to flirt to wrecking a guys car.Stupid and insecure....","commenter_a":"she was watching too much titanic","post_message":"This woman wanted to test her boyfriend's love for her by climbing over the railing on a cruise ship to see if he'd come to her rescue. You can probably guess how that worked out."},{"comment_id":"10153642078228132","commenter_b":"So sad for them.","commenter_a":"Nathaniel Gaytan","post_message":"EXCLUSIVE: It's the end of the road for Ben Affleck and Jennifer Garner."},{"comment_id":"10156170491245206","commenter_b":"Shut up sexy","commenter_a":"I was pro @username but Carly I cant take you seriously unless you attack someone beside Hillary she is not the only one running who is bad for our country and until I see you attack Trump or Jeb who are you major competitors right now I am not going to take you seriously as a serious candidate.","post_message":"What are my thoughts on Hillary Clinton's speech this morning?"}]
