[{"comment_id":"961273403971266","commenter_b":"Very funny.","commenter_a":"It would be a GREAT pick....! Watching Liberals heads spin and POP will be fun..! Plus Newt would wipe the floor with Hill-Lie-ary and anyone she chooses for VP.","post_message":"Trump has been asking confidants for input on Gingrich as a potential pick."},{"comment_id":"10157769548850725","commenter_b":"Go kick her butt.","commenter_a":"you go donald !","post_message":""},{"comment_id":"10153765705598132","commenter_b":"Don't care what her point is/was... No woman should do that. It's nasty and probably a health hazard as well. Koo koo.","commenter_a":"Should have been declared a Health Hazzard and disqualified. What a disqusting thing to subject others to. And can someone tell me how being a ragless woman is going to get sanitary napkins to 3rd world woman? I bet if they don't have tampons they don't have TV either... Stupid Stupid Stupid","post_message":"She thinks critics only prove her point."},{"comment_id":"10153064956677217","commenter_b":"When we shoot the last of them in the wild you'll be thankful for the necessary evil that is zoos","commenter_a":"\"Five-month-old baby Hippopotamus imprisoned for human entertainment.\" You must be SO proud SDZ. How about we lock you up instead? I'd pay double to stand & point.","post_message":"Five-month-old baby hippopotamus entertains visitors at San Diego Zoo"},{"comment_id":"10156264408410725","commenter_b":"The smart Americans will vote for Trump and Cruz. And that includes the \"legal\" Hispanics here. Trump wants to deport the millions of \"illegal\" immigrants..the ones who sneak in undocumented, or overstay their visas, or get deported and sneak back in...THE ONES THAT KEEP KILLING INNOCENT AMERICANS and drain our system! Get them the hell out.","commenter_a":"Go Trump!!! Hispanics for Trump 2016","post_message":"Join me Tuesday, November 3rd at 12PM in Trump Tower New York. I'll be signing copies of my new book CRIPPLED AMERICA. Don't miss it!"},{"comment_id":"10154456330994445","commenter_b":"I'm a female! Hilary needs to stay home and crochet something ya crazy hag","commenter_a":"I notice most of the haters of Hillary are men, you must have Momma issues!","post_message":"President Obama made the case for Hillary Clinton, saying there there's no other person more qualified for the most powerful office in the world. @webpagelink"},{"comment_id":"1264843663556103","commenter_b":"Christianity will not be dead, extremist Islam will keep it from dying and drying out. BTW atheist here.","commenter_a":"Because \"Christmas break\" is very Biblical. -.- I am so sick of these people hijacking God and MY Faith for their asshattery and hate. It's repulsive and they are such an embarrassment. And this is why Christianity will be dead in the US within the next 50-75 years.","post_message":"This kind of ignorance has no business influencing school children."}]
