[{"comment_id":"840187412685267","commenter_b":"How about no sex till your married. No need for pills or protection. Problem solved","commenter_a":"you can't fool Mother Nature","post_message":"New commentary from Matt Walsh on birth control. \"Where is the feminist outrage when you need it?\""},{"comment_id":"847139551999340","commenter_b":"You can get rid of your living organism in your uterus all you want to and in 5 states up to 40 weeks. . It still doesn't take away from the fact that you chose to end this living organisms life. Basic biology hun","commenter_a":"Question: A six week old BABY and a six week old EMBRYO are about to be thrown from a very tall building. You can only save one. Which one would you choose?","post_message":"Isn't this amazing?"},{"comment_id":"1109554819065528","commenter_b":"Bitch please,","commenter_a":"To everyone hating on Superman, you don't have shit.","post_message":""},{"comment_id":"10154913521679714","commenter_b":"In the end you can have Nina Dobrev","commenter_a":"Happy the way God made me.","post_message":"This is what \"the most desirable face in the world\" looks like."},{"comment_id":"963821730369705","commenter_b":"we need Ben Carson to give us hope.","commenter_a":"Liberals did it.","post_message":"MIT professor and noted left-wing academic Noam Chomsky attributes Donald Trump’s wild popularity to “fear, and the breakdown of society during the neoliberal period.”"},{"comment_id":"10155757237589062","commenter_b":"I guess your mother didn't raise you right then. I bet she's proud of the rude, ignorant, pathetic little girl you are.","commenter_a":"Congratulations PRESIDENT TRUMP! Glad our electors upheld THE VOICE OF THE PEOPLE.","post_message":"BREAKING: Donald Trump surpasses 270 votes in Electoral College to formally win presidency. @webpagelink"},{"comment_id":"10155960556545500","commenter_b":"They need protection from poachers! You are really dumb for supporting this.","commenter_a":"Shut down. Place animals in a REAL SANCTUARY.","post_message":"ABUSE ACCUSATIONS against the 'Wild things' - @webpagelink"}]
