[{"comment_id":"698556140299300","commenter_b":"shes a winner","commenter_a":"Recount now!","post_message":"We're at Trump Tower in NYC standing up for voting justice."},{"comment_id":"925264027533346","commenter_b":"So skinny women aren't real?","commenter_a":"oh look real women","post_message":"Large ladies in lingerie are No Angels"},{"comment_id":"404568359667759","commenter_b":"They all need to go somewhere else!","commenter_a":"what is wrong with the United States flag this is United States we have the right to fly our flag just like any other country","post_message":"Why do some people want to ban our flag?"},{"comment_id":"10153531344506077","commenter_b":"Well said!","commenter_a":"Apparently some of the people on this thread see this move by the Colorado governor as a humanitarian move. Well when the carnage starts in Colorado, we will see just how humane the move was. Every citizen of this country that has a gun needs to lock and load because what happened in Paris is coming here! If you can't see the truth then you are just as blind and ignorant as our so called leaders! I hope you do not suffer in pain long when your ignorance comes back to bite you in the butt.","post_message":"JUST IN: Colorado will NOT join the growing number of states that are refusing to accept Syrian refugees following the Paris terrorist attacks."},{"comment_id":"1191420990909535","commenter_b":"Really??? I use my pants to hide this dick!!!!","commenter_a":"I'm sorry","post_message":"Military intelligence... isn't. ~Will"},{"comment_id":"10153110239287093","commenter_b":"It should be removed","commenter_a":"Wow anyone that wears this is a sorry person. I fully support our men and women in Blue. I think the teacher made a great call . Better safe than sorry . I expert even looked at the \"clock\" and said it is a count down read about it. Also who makes a clock these days that looks like it would be a bomb.","post_message":"It was only a matter of time!! If you wear this costume to school, be careful who you show it to. @webpagelink"},{"comment_id":"10154000125138132","commenter_b":"That woman is a nut!!!","commenter_a":"Hope he doesn't take them on a nice \"trip\" to Monaco like Kelly Rutherford's ex did.","post_message":"Gavin Rossdale has a special Christmas trip planned for his kids!"}]
