[{"comment_id":"1040232792739639","commenter_b":"Maybe the politicians should take a course in medical health","commenter_a":"She needs to have her nurses license taken away.","post_message":"“You cannot forcibly incarcerate someone if it’s not based on legal grounds” - Kaci Hickox on why she's suing Chris Christie"},{"comment_id":"1602329080072552","commenter_b":"Didn't he say \"it's easy for us to be around this everyday. It's hard for them to adjust after coming back from war\".","commenter_a":"Vote for Hillary...to finish the job on America that Obama started....","post_message":"Trump's message to veterans with PTSD isn't just wrong. It's dangerous. - Jon Comulada"},{"comment_id":"10153705260739218","commenter_b":"All Lives Mater...another life ended and another life over.","commenter_a":"Every man woman and child makes their own decisions in life...don't know the circumstances but he has to deal with the outcome..not his father...prAyers to both families","post_message":"The son of a Baltimore Police Department commander has been charged with murder, sources have confirmed to the 11 News I-Team on Tuesday >> @webpagelink"},{"comment_id":"513245792199334","commenter_b":"ALL MUSLIM PIGS Get the HELL outa MY country!!!!!!","commenter_a":"Screw you, give her her job back, this is a disgrace to the AMERICAN people! Anyone can make a mistake!","post_message":"A lunch lady was fired for serving pork to a Muslim student. We are in America, give that poor lady her job back. Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"918244381576759","commenter_b":"She is a freaking fat ass I've seen pictures of her shoveling food in her fat face the fat bitch","commenter_a":"Serve it or she'll dip her balls in the mashed potatoes and gravy!","post_message":"Michelle Obama Orders Schools To Feed Children Her Slop Or She Will... Ugh. Totally gross! SPREAD THIS EVERYWHERE! @webpagelink"},{"comment_id":"10153557407432964","commenter_b":"Did they really come legally? I think not. America was first inhabited by the Indians. Christopher Columbus discovered this country by chance and we were not invited, so legally I would think not. We took over, slaughtered many Indians in the take over. So please don't go there. If immigrants come to America I agree we need to now come legally and apply for citizenship, but that is not the issue. The issue is the children born here! This is where they were born and with that they are American! Period!","commenter_a":"I'm not sure I agree with that statement because regardless of whether their parents are immigrants, they too have the ability to become Americans. The children who are born in this country are born on American soil and should be considered Americans, just my thoughts. After all we were all once immigrants and at one time even if we ourselves are not immigrants, we were born on American soil from an ancestry of immigrants and for that reason we too are Americans. I agree with many things about you Senator Vitter, but I have to say on this I don't agree.","post_message":"I think it's flat out wrong for children of illegal immigrants to become U.S. citizens just because they were born here, especially when it’s justified using a false technicality of the Constitution. I made this argument in a guest column in USA Today. Read more:"},{"comment_id":"10153091745866523","commenter_b":"You're a pig!!!","commenter_a":"This whole thing was started by a Lawyer whose wife was a Teacher and a School Board Member. She was hysterically crying over the whole...Act 10 thing, so her dutiful hubby wasted millions of our tax dollars to pull out a witch hunt. Which begs the question: Did his wife put out after all that? Because I want to know if my tax dollars amounted to a 'Happy Ending' for most dutiful hubby.","post_message":"JUST IN: Wisconsin Supreme Court ends probe into 2012 recall campaign of Gov. Walker."}]
