[{"comment_id":"10153391212533984","commenter_b":"Dumb ass!!!","commenter_a":"Another actor who thinks his opinion matters to anyone with an IQ over that of a houseplant....sooooo sorry George, but you really should stick to acting.","post_message":"This might lose George a few fans. What's worse than announcing he'll give this candidate 'whatever they want,' was the claim he made about a scandal that surrounds this particular 2016 hopeful..."},{"comment_id":"10154535880412235","commenter_b":"Get your story straight. Us woman shouldn't raised our hands on a man and expect not to get hit back. That's what's wrong with our society.","commenter_a":"She's doing to him the same thing that easy-to-use girl did to Kobe Bryant. She was \"admiring\" his jewelry a little too damn much.","post_message":"THIS JUST IN..."},{"comment_id":"1346208208805563","commenter_b":"@username If you can even get in to see the surgeon!","commenter_a":"Its funny cause in Mexico, the full of thugs and criminals and rapists Mexico you can get major surgeries for free. Yes you need to wait a few weeks but you do get it free if you pay your fee (about 8% of your salary goes for health, another 8% for retirement and house)","post_message":""},{"comment_id":"10154996363431337","commenter_b":"We have a incest pedohpile leading USA. The ignorants have come out from their caves.","commenter_a":"At least he'll bring back jobs!- every ignorant trump supporter.","post_message":"Donald J. Trump really shouldn't be tweeting about nuclear weapons..."},{"comment_id":"10154467754523010","commenter_b":"@username .... Look who's talking?! Trump got his mistress pregnant, that's were his second daughter came from. Malania said, in her plagiarized speech, that she Trump had been together 18yrs....Trump was still married to wife number two at that time! Children with three different women!!!!! Can you imagine what the Republicans would be saying, if that was Hillary?! Hypocrites!!","commenter_a":"He and Bill should hang out since they both cheated on their wives multiple times. Nothing like knocking up the maid. #NeverHillary #ImAgainstHer #VoteTrump","post_message":"Not quite hasta la vista to the Republican party."},{"comment_id":"1090441274344209","commenter_b":"People keep saying this but it seems like Hillary IS our Trump-like candidate.","commenter_a":"Allow me devil's advocacy: 1. If the dems ever run a \"Trump\"like candidate, the super delegate system would be designed to stop that person. 2. Getting more than a small percentage of voters to the primary booths will make the dem party more democratic than overhauling the super delegate system","post_message":"Ending the superdelegate system is what will make the Democratic Party more democratic. This is the kind of grassroots democracy that will help the Democratic Party grow and win elections."},{"comment_id":"10157544751020354","commenter_b":"wasn't lady gaga also a crack fiend before she made shitty music and supported domestic terrorists?","commenter_a":"No one gives a shit what the fucking rich liberal is said.","post_message":"Here are Lady Gaga's tweets supporting the BLM radicals..."}]
