[{"comment_id":"10153405273244203","commenter_b":"@username those aren't feminists.","commenter_a":"What an absolute idiot! Feminism is the opposite of equality. Equality is equality, that's it.","post_message":"\"So to me, feminism is probably the most important movement that you could embrace, because it just basically another word for equality.\" Taylor Swift"},{"comment_id":"10153197495351378","commenter_b":"Why Yall want her to get charged so bad , ..Focus On them Cop killers niggaz","commenter_a":"Thats really strange... Ive never even heard that song!!","post_message":"VIDEO: A woman slammed on her brakes and then stepped out of her car while it was still moving in a bizarre crash caught on a dashboard camera. @webpagelink"},{"comment_id":"726800087419505","commenter_b":"@username get 'em, girl!","commenter_a":"BERNIE SANDERS AMERICAS ONLY HONEST CHOICE 2016","post_message":"Hillary Clinton campaign's \"abuela\" post sparks #NotMyAbuela hashtag."},{"comment_id":"10153320820056051","commenter_b":"Think it's a good idea, then neighbors can tattle on those. We must find some way to catch the thieves. And I agree with Marilyn , also. And there are many, many whites on welfare that shouldn't be,also.","commenter_a":"I like to see what I am buying and if ny money is well spent or wasted.","post_message":"This mayor is going to make the names and addresses of all welfare recipients public."},{"comment_id":"10154363624237501","commenter_b":"This is getting Old. What will she want next a Movie? This lady is a $$$$ hungry Biotch","commenter_a":"Why oh why do you continue to post this?","post_message":"As testimony comes in and new evidence is provided, has your opinion about the shooting changed over time?"},{"comment_id":"1034964553205670","commenter_b":"@username I do not know of anyone who has demanded to, \"get even\" with whites. Not sure who you are referring to.","commenter_a":"Idk, I was bullied and made fun of for being white by black girls. It's just racism, saying \"reverse\" racism implies that only white people can be racist. That's pretty racist, in of itself. :/","post_message":"News flash: Reverse racism doesn't exist."},{"comment_id":"10154191515199087","commenter_b":"If Hillary gets elected Bill will be coming to the white house with her lets not repeat history.","commenter_a":"Unfortunately it's not Bill Clinton who's running for the President but it's Hillary Clinton, and Nobody cares what Bill Clinton did.","post_message":"The former reporter came forward today for the first time to accuse Bill Clinton of groping her on multiple occasions."}]
