[{"comment_id":"10154913059491350","commenter_b":"Shawna Cargill","commenter_a":"Nick Shanahan","post_message":"CHICKEN. TOT. PIE."},{"comment_id":"528596753997571","commenter_b":"Yes the airline acted as they should have! If these people don't want to be put into ituations like this they should dress in such a way as not to bring question upon themselves. They should also understand the airlines concern where muslims are involved from prior experience. Personally, I think all illegals should be deported along with Obama!","commenter_a":"Yes. They've already proven they cannot b trusted","post_message":"These Muslims were thrown off the plane for this frightening reason.  It is always better to take necessary safety precautions.  Would you want them off your plane too?"},{"comment_id":"1390719824302205","commenter_b":"Our 4 rescue babies. We couldn't be happier, love them with all our heart.","commenter_a":"If I were granted 3 wishes it would be health and wealth for all my family and friends and that Clyde could talk. We stare into each other's eyes and I ask him about his family and living on the street and all his circumstance and history. I call him a bunch of names to see his reaction, Blackie, Shadow, Coal, Midnight. Larry hates that 'his name is Clyde, you're confusing him.' I'm also proud to wear a tshirt that says 'all I want to do is drink wine and rescue dogs' and it has a real red wine stain on the front!","post_message":"This comic shows a dog's heartwarming journey from the shelter to his forever home."},{"comment_id":"1297424046964731","commenter_b":"Not a Christian. He's a low-life creep!","commenter_a":"That doesn't sound very much like what Jesus would say","post_message":"WOW!"},{"comment_id":"10153183200188812","commenter_b":"They want marijuana sellers to be kept on jail for the lesson to make sure that they won't save lives of people who needs it, so more people can rely on prescription pills... There are cruel rich doctors out there who would pay the cops for good amount of money to keep their business running. Money ruins everything.. 55 years is too much. Child rapist should spend 55 years, not marijuana sellers. People sell drugs to provide for their families. Not everyone do it to get rich for themselves. Low income families has it harder when providing family because of health issues.. Some marijuana sellers could be good people too, it is just unfair to put them in jail for 55 years. How ironic that McDonald and other fast food chain restaurants sells junk food that can harm a lot of people while marijuana harms less people... But they can ...","commenter_a":"Those that advocate for and enforce these cruelties are the real criminals.","post_message":"“We have escalated punishments to the point that it’s crazy…' -- The cost of a 55-year sentence for marijuana: @webpagelink - Tonight on Nightline"},{"comment_id":"1125267834218418","commenter_b":"His old ladies big ass!!","commenter_a":"Oh puleeze.....","post_message":"Obama posted this 'Happy Easter' pic on Sunday, but it didn't take long before people started noticing 1 enormous problem.  Did he just get caught in a sickening lie? Probably... but decide for yourself."},{"comment_id":"10154559910664087","commenter_b":"'@username: Are Christian refugees beheading non-Christians?","commenter_a":"They can rewrite it. However, they still have the footage of Trump calling for a Muslim ban on the campaign trail.","post_message":"BREAKING: White House attorneys are working on rewriting the language of President Trump's immigration ban following yesterday's dramatic defeat in the appeals court."}]
