[{"comment_id":"10153625218767464","commenter_b":"That was their land. The other middle eastern countries opened their jails and put those people there to taunt Israel. Know your history if you're going to insult a Nation using their systemic slaughter as a punch line.","commenter_a":"The genocide of the Jews does not justify hem killing the Palestinians. What's the difference between a cow and the Holocaust? You can't milk a cow for 70 years.","post_message":"I'm proud to stand with PM Benjamin Netanyahu - בנימין נתניהו and the nation of Israel. LIKE if you are too!"},{"comment_id":"589287567920858","commenter_b":"Wanted to see the dogs lock jaw these pos","commenter_a":"Click bait everywhere goddamn","post_message":"A man was slashed after coming to the defense of a dog. Surveillance video shows the two men punching, kicking and beating dogs on Staten Island."},{"comment_id":"460063127508901","commenter_b":"I bet the GOP hate her since she actually has a heart.","commenter_a":"Well said","post_message":"Wow is right."},{"comment_id":"10153163380586336","commenter_b":"ANIMAL! wait is that Obama's son??","commenter_a":"Hang em on national TV.","post_message":"UPDATE: A third man has been charged with sexually assaulting a woman during spring break in Panama City Beach, Florida, that was captured on cellphone video, authorities said."},{"comment_id":"390922764595794","commenter_b":"Amen","commenter_a":"Amen","post_message":""},{"comment_id":"1005938356108252","commenter_b":"She looks like a evil witch","commenter_a":"She is \"special\" she doesn't not have to follow the law.","post_message":"GO TO PRISON!"},{"comment_id":"10153903187059218","commenter_b":"Criminals don't need a registration.","commenter_a":"California has registrations, tests, waiting periods, magazine limits and \"Assault Weapons\" ban how is this possible?","post_message":"Police confirm fatalities in the shootings at a San Bernardino, California, social services center. Follow updates on 11 News at 5:00 and online here >> @webpagelink"}]
