[{"comment_id":"1367266676644002","commenter_b":"Why do you think we have any right to tell another country anything?","commenter_a":"Why afford them any opportunity to keep growing their attempts for long range missiles?","post_message":"North Korea continues their aggression."},{"comment_id":"1002821876430463","commenter_b":"There it is. He's going to protect her lying corrupt butt.","commenter_a":"They will only indict her if she losses Iowa and New Hampshire to Bernie then Bloomberg will join. Politics are so filled with crime it's sickening 🇺🇸","post_message":"FUBAR."},{"comment_id":"10153242618583132","commenter_b":"First Dr. Nancy Snyderman and now Brian Williams betrayed us!","commenter_a":"Yea a permanent one lol","post_message":"Brian Williams tells staffers that he is taking a break from NBC Nightly News amid his recent scandal."},{"comment_id":"10154315697078984","commenter_b":"That whore needs to go to hell","commenter_a":"She DOES NOT HAVE THE AUTHORITY TO DO THIS. ALL WE NEED TO DO IS IGNORE HER. KEEP BUYING IT SHE WILL BE GONE IN 8 MONTHS","post_message":"Michelle Obama has been messing with our children's food for years, but now she's gone to far.  She just banned one of America's favorite cereals, and there's not a darn thing anyone can do about it.  It's time to throw her and her America-hating husband out of the White House for good."},{"comment_id":"1236747943048399","commenter_b":"#NeverEverHillary #CrookedHillary #LockHerUp","commenter_a":"I can't believe the uneven coverage you get. Trump lies daily and people don't care. You don't even have to do anything wrong and the republicans and media blow it out of proportion.","post_message":""},{"comment_id":"10153054297358984","commenter_b":"Obama has always chosen the side of the terrorists from the very beginning. I can't help wondering if he was in on the planning and carrying out of the 1st 9/11 attack and just what his roll has been in other events like the shooting at Fort Hood, etc.","commenter_a":"If 3.7 million protestors and marchers didn't get Obama off his ass then nothing will. Not just any but those that support freedom and liberty.","post_message":"This man does not have a problem telling us how he really feels. And boy, does he have some harsh words for Obama...  Do you agree with what this Lt. Colonel just said about Obama?"},{"comment_id":"10154037346055329","commenter_b":"See bitch William Huybers","commenter_a":"Andria Gamuza Kimberly C Lin","post_message":"ewww...."}]
