[{"comment_id":"964070213702162","commenter_b":"She is dumb as a fox! Crooked doesnt require brains! Just dishonesty!","commenter_a":"Ha! Ha! Poor Hilary Rotten Clinton!","post_message":"Does anyone know that Crooked Hillary, who tried so hard, was unable to pass the Bar Exams in Washington D.C. She was forced to go elsewhere!"},{"comment_id":"10155823678825354","commenter_b":"SUCK a Long donkey Eva ..","commenter_a":"She knows nothing about Hitler but she can run her mouth","post_message":"Desperate..."},{"comment_id":"1060964983967782","commenter_b":"I am a woman and I think your ugly Megan","commenter_a":"I think the evidence clearly shows she was moved away. Not beaten or mauled just moved away. Seems like a job hazard to me.","post_message":"\"This is the Trump campaign, where lies are told and then lies are told to cover up the lies, and then finally new lies are told in order to cover up the lies that were told about the lies,\" Ben Shapiro said."},{"comment_id":"10153022619096523","commenter_b":"She's white who cares... Get over it lady!!!","commenter_a":"This is so sad","post_message":"\"She told me not to blow her cover about the fact that she had this secret life or alternate identity. She told not to tell anybody about Montana or her family over there. She said she was starting a new life.\""},{"comment_id":"10154160211386336","commenter_b":"Stfu feminist","commenter_a":"Thank you @username for backing Megyn Kelly. If the cry babies can't take the hard questions, they can watch the lamestream stations.","post_message":"Unbelievable. (Via: ViralHog)"},{"comment_id":"10155050203774369","commenter_b":"It wouldn't have meant a thing if Hillary didn't lie to the congressional hearing. She's the one that committed perjury and gave Russia the opportunity. .","commenter_a":"All I can say if they didn't have anything to hide, why so angry?","post_message":"The 2016 U.S. election was NOT the first to be the object of \"malicious cyber activity,\" Barack Obama said."},{"comment_id":"10154453575369087","commenter_b":"I love it.","commenter_a":"And Trump is right once again! Meryl Streep is a piece of s***!","post_message":"Donald J. Trump: \"Meryl Streep, one of the most over-rated actresses in Hollywood, doesn't know me but attacked last night at the Golden Globes. She is a Hillary flunky who lost big.\""}]
