[{"comment_id":"780004342132746","commenter_b":"He said he wants all immigrants to be required to carry an ID with their status, which sounds logical to me and he repeated what others said. 'We know not all muslims are terrorists but it appears all of the terrorists are muslims'. When was the last time you saw a Buddhist terrorist, or a sikh terrorist, or for that matter an atheist terrorist? You just don't. Our biggest threats come from the middle east right now. It was perfectly fine while we were at war with the Japanese to pay extra attention to them. It was perfectly fine during WWII to keep an eye on immigrant Germans. What is the difference now? Why are we going to try and justify keeping our sovereign nation secure. Every other country does it. There is no law that says we have to accept immigrants. We are allowed to pick and choose, just ...","commenter_a":"Well, all was well and good until the part that was speaking of hate speech from the presidential candidate. Well he was obviously speaking of Mr. Trump. Unfortunately he is completely wrong. Mr. Trump used no hate speech at all. The only thing said was that he thinks we should stop the middle eastern refugee immigration until we could confidently vet them. This would be a temporary action. But of course the way the bleeding heart liberal media spins it, is that he want to cut off all immigration. This is another one of those stories that is attempting to drive the narrative and falsely force people to have negative opinions without the facts. The media wants people to believe that Mr. Trump said these awful things because the media hasn't been able to manipulate him and force him to fall into step. The media and the establishment are scared ...","post_message":"It's the little things... ;)"},{"comment_id":"930066070388844","commenter_b":"ANd Every one seems to have forgotten the 11 airliners still unaccounted for close to a year now","commenter_a":"That means trouble","post_message":"UPDATE: Hundreds of TSA badges missing at airports (VIDEO)  @webpagelink"},{"comment_id":"10155007854069170","commenter_b":"Suck it up and move on lady","commenter_a":"this occurs when they go off their medication","post_message":"Enjoy this video. Watch it repeatedly. Savor it like a fine wine..."},{"comment_id":"796156163908294","commenter_b":"Yeah and make all those fat bitch bags move to another country","commenter_a":"No one watching it anyway put whoopi on a plane","post_message":"'The View' Made THIS One Fatal Mistake, And Will Likely Be Shut Down Because Of It  Good. Get this liberal trash off the air. We've had enough.  Would you be happy to see the View get thrown off the air?"},{"comment_id":"696088307225578","commenter_b":"So because this woman stooped so low as to call Obama a name in public all of you are doing the same thing. You're not any different than she is.","commenter_a":"Unbelievable.............speechless","post_message":"Apparently, saying something really racist will only get you fired for a little while."},{"comment_id":"10154556133417235","commenter_b":"Good bye you old hag","commenter_a":"It could only have happened more quickly. Thank God for small miracles. Goodby. God Bless, where ever 'He' .Kisses.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1838073153099439","commenter_b":"Well, she's certainly dum enough for the part!","commenter_a":"But she looks like Hulk Hogan","post_message":"Amy Schumer has been cast to play a blonde doll with impossibly perfect physical proportions...."}]
