[{"comment_id":"1495082587178156","commenter_b":"Its not a city...its King County....so it wouldn't be the city that pays itd be king county...","commenter_a":"How big would the fine be if a private corporation had done this? Make the city pay that! This should never happen to our waters. (edit added: I was mistaken in my initial post. King County is responsible for the treatment plant, not Seattle).","post_message":"Roughly 100 million gallons of untreated sewage and rainwater has dumped into the Puget Sound after an equipment failure at a sewage plant near Discovery Park. >> kiro.tv/SewageIntoSound For a report on KIRO 7 News at 5, Graham Johnson is finding out what’s being done to get the plant working again. Watch on-air or kiro.tv/LiveNews"},{"comment_id":"487880261407401","commenter_b":"He got her ass good","commenter_a":"@username bruhhh lol","post_message":"Barack Obama just hilariously roasted Bernie Sanders and Hillary Clinton. #WHCD"},{"comment_id":"483365738520673","commenter_b":"Worthless hoe bag","commenter_a":"MYOB WITCH!","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"945417468827008","commenter_b":"Whomever is behind this un-American idea, should be investigated for insanity and on legal terms. The people (or group) seem not to have any interest in America. Has Obama contaminated this too?","commenter_a":"This maybe a big mistake, he is the only one who is not under control of big labor groups and unions, plus I feel the American people are tried of the same old crap, time for a big change.","post_message":"NOOOOOOOO!!!!"},{"comment_id":"1099534980113254","commenter_b":"Anderson cooper is a killery bitch","commenter_a":"The country will be dancing in the streets if that happens. If anyone can get the job done, it's Donald J. Trump!!","post_message":"Donald Trump says he will prosecute Hillary Clinton if he becomes President of the United States."},{"comment_id":"10153515610223984","commenter_b":"Tough shxt! If you want Muslim crap, go back to the sand fleas, get the hell out of America!","commenter_a":"If I was to go to another country would they change their laws for me change their religion.. NO THEY WOULD NOT!! SO WHY ON EARTH WILL AMERICA CHANGE WHY !! GOD FORGIVE AMERICA FOR THEY RE GOVERNMENT IS STUPID!","post_message":"I have to admit, I was quite startled when I saw these numbers. It seems that a real problem could be brewing... Is Sharia law in America a major concern of yours?"},{"comment_id":"990398314328597","commenter_b":"Fucking what the hell why u have to hit a poor guys damn this US is freedom fucking basdard try to find me I kick their ass to hell","commenter_a":"That fuck up stupid cop","post_message":"Listen to an MMA fighter break down the poor training of law enforcement. Source → @webpagelink Filming Cops (Y) Police The Police (Y) H/T Gracie Breakdown"}]
