[{"comment_id":"769057633200701","commenter_b":"She deserved to be sterilized or shot.","commenter_a":"AMAZING THAT THEY WERE THERE TO HEAR THE BABY THANK GOD, BURY THE MOTHER NOW ALIVE! ANGERS ME","post_message":"A newborn girl thought to be only 36 to 48 hours old was found  alive in Compton on Friday.   The baby muffled cries led sheriff deputies to find her buried under pieces of asphalt and rubble inside a crevice near a riverbed.   Detectives are now asking anyone with information to come forward.  this post to alert others.   Read KTLA story here: @webpagelink"},{"comment_id":"804054019696293","commenter_b":"Dumb bitch...","commenter_a":"She just needs to shut her piehole take off her cloths and look pretty!","post_message":"Amy Schumer: you know what Americans are \"sickened\" by? We dumb, poor, working class folk are \"sickened\" by rich, elitist, Leftist \"celebrities\" who can afford to live in million dollar homes with high-end security and bodyguards lecturing us for protecting our families and children. Sorry, Amy Schumer, that we can't afford to live in a gated mansion with state of the art alarm systems. But your pal Obama destroyed the American economy. So spare us the lectures!"},{"comment_id":"1084755811580947","commenter_b":"She well be Charming President .","commenter_a":"Unless Democrats want to see President Obama hand over the keys to the White House to Donald Trump, we Bernie and Hillary supporters had better start aiming attacks at Trump and the Republicans, and not at each other.","post_message":"\"She cares. She tries. She perseveres. And now she has a chance to tell the story she’s always wanted about America: the story about a country that found the courage to turn away from our darkest impulses; that chose to embrace our growing diversity as a strength, not a weakness; that pushed the boundaries of opportunity outward and upward, until there are no more barriers, and no more ceilings.\" —Jon Favreau, President Obama's former speechwriter"},{"comment_id":"10156346030730725","commenter_b":"@username We know you're illegal, Pack your bags buddy you're getting deported!!","commenter_a":"We love you here in South Carolina Mr Trump! #MAKEAMERICAGREATAGAIN #TRUMP2016","post_message":"THANK YOU for your support this evening Myrtle Beach, South Carolina! My family and I had a fabulous time with you this evening. Together we will #MakeAmericaGreatAgain!"},{"comment_id":"10155152237477042","commenter_b":"Everyone without documentation will get deported.","commenter_a":"Here in NY, we have a huge population of illegal immigrants from China, Russia, Israel, and the Middle East. Will they be rounded up too, or do the deportations apply only to Latinos?","post_message":"New guidelines under President Trump greatly expand the amount of people considered a priority for deportation.   Undocumented immigrant suspected, charged, or convicted of a crime (including minor traffic violations) will be at the top of the list."},{"comment_id":"1178173242225154","commenter_b":"That's what whores do","commenter_a":"She shoulda put sum lil shorts on underneath that dress if she gonna be doin all that twistin round..she knew damn well that shit is more like a shirt than anything on her.","post_message":"Big booty problems."},{"comment_id":"10153064039634411","commenter_b":"Apart from the many proven lies? He was a cold blooded killer, how's that heroic?","commenter_a":"That bit about Jewish controlled media ... Whoa! How repetitive. And untrue. A sniper's job is to reduce the length of war by taking out one person at a time who appears to be aiding the killing of Americans. Thus Not mowing down a big group, thus not continuing backlash. Yes, he died young, at age 38. The movie is portraying the truth.","post_message":""}]
