[{"comment_id":"10154024404718352","commenter_b":"Does that look like a white family bitch???? Go fuck your self","commenter_a":"Truth is that Mom's don't know, my stepfather abused me from 4-12 and I never said a word till I was 19 although my mom asked us many of times had anyone ever touched us we always said No because not only was their sexual abuse there was physical abuse, we we're scared he was going to kill us or or mom would kill him we were worried we'd have no one... 10 is so young if she did have a stomach her mother didn't notice nor did her teachers until the birth.... All I can say is he'd be dead once I found out","post_message":"10-YEAR OLD GIRL BIRTHS BABY AT SCHOOL AFTER THINKING IT WAS JUST A TUMMY ACHE"},{"comment_id":"10153847161829203","commenter_b":"He probably didn't know the virgins are 20 year-old males who still play Pokemon.","commenter_a":"Enjoy the virgins, shithead.","post_message":"CONFIRMED: Paris Mastermind Dead"},{"comment_id":"1055522267818446","commenter_b":"We're sick of Reruns. Turn the channel. Clintons are history. Make them go away.","commenter_a":"Close, but no cigar","post_message":"“Donald Trump has called your dad an abuser of women, and your mom his enabler. What do you think of his attacks on your parents?”"},{"comment_id":"1078709322150078","commenter_b":"we r so screwed if cancer is cured... prepare for the brand new disease! xD","commenter_a":"Gus Fielding","post_message":"A small trial for a cancer vaccine has been successful."},{"comment_id":"10153666671338797","commenter_b":"But Jennifer Fillpone u did not lose he's a smart man Rham don't vote just for race.","commenter_a":"Ha~ha :) :)","post_message":"#BREAKING: Mayor Rahm Emanuel did not receive the 50 percent majority needed to avoid a runoff election.   Emanuel has been forced into a runoff with Jesus Chuy Garcia. Details here:"},{"comment_id":"10153876506189726","commenter_b":"Alas, McCain's time as a politician has lasted too long--- in fact, it was too long the day he took office.","commenter_a":"Tell McCain to shut up","post_message":"WATCH: John McCain Has Doubts About Ted Cruz's Citizenship"},{"comment_id":"10155069293808010","commenter_b":"@username well since trump is saying illegals voted for Hilary!!! I'm being sarcastic you Troll!!","commenter_a":"Oh let me guess they were illegal immigrants 2","post_message":"He operated the scheme for two years from behind bars. He and an accomplice made more than $600,000."}]
