[{"comment_id":"1204517232921065","commenter_b":"he's not alone. He has a lot of support!","commenter_a":"He is not alone..he has millions on his side... You got this Mr President..","post_message":"Can Trump do this alone?  @webpagelink"},{"comment_id":"1511171265602298","commenter_b":"The Swiss do not have to do anything any muslim may demand! These muslims making demands that is not their place.Who the hell do they thik they are, they leave their land and move unwanted into another and they make demands? Sorry bacon lovers that is all the world will offer you. take it or leave!","commenter_a":"Works for me ?!... what hat ?!!!........ @webpagelink","post_message":"Ridiculous!"},{"comment_id":"10153583578957144","commenter_b":"they were chanting,Bernie,Bernie...:)","commenter_a":"Ah @username... no mention of the STANDING OVATION for Bernie at the end of the debate? You guys are so blatantly transparent in your shilling for HRC","post_message":"\"I'm not even answering that question.\""},{"comment_id":"10153337670592061","commenter_b":"Omg your so ignorant lady!","commenter_a":" I've had enough of this 'let's show black crimes in the news disproportionately bs' what's up with those occupy federal land militia and who's going to right the Steve Avery corruption wrongs. What he has to be an affluenza to qualify for civil rights in America?","post_message":"WATCH: Kidnap victim explains how she escaped after an alleged carjacker jumped into her car and forced her to drive nearly 150 miles: @webpagelink"},{"comment_id":"1066627293358281","commenter_b":"You killed a clumsy one. No more clumsy spiders","commenter_a":"How is that possible? The spider isn't going to breed after it gets killed. Shouldn't TRYING to kill spiders have that effect?","post_message":"Just sayin."},{"comment_id":"497783407099419","commenter_b":"Kill the pigs.","commenter_a":"Killing of police officers is WAY UNACCEPTABLE!!!! I am sure that he didn't know if these police officers were empathizing with the protesters but was doing their sworn duty to protect and serve!","post_message":"\"Oh my god. There's people laying on the ground.\" Video from #Dallas via Twitter user @allisongriz includes audio of what sounds like multiple gunshots. @webpagelink"},{"comment_id":"10153873551727550","commenter_b":"Scores girls accept nothing less!","commenter_a":"As long as liquor stores, bartenders, strippers and cigar shops accept them who cares who is on the twenty dollar bill?","post_message":"ABC News has confirmed through a Treasury spokesman that Harriet Tubman will replace Andrew Jackson as the face of the $20 bill.  Full Story --> @webpagelink"}]
