[{"comment_id":"650282881785927","commenter_b":"She is such a fool. And not even a human. She needs to be in jail","commenter_a":"Putin looks at Killary, like you are in way over your head old lady. Don't even try to match wits with me.","post_message":"Busted: Clinton News Network's \"Fact-Check\" Proven 100% False!"},{"comment_id":"1514959711853944","commenter_b":"This reminded me of The Series of Unfortunate Events .... But this way wayyy cuter","commenter_a":"Alicia Thomas","post_message":"This is so cute!"},{"comment_id":"709686039165167","commenter_b":"@username Illegals don't have insurance.","commenter_a":"Norway has a single payer health system as does every other civilized country in the world but us. Get insurance companies out of the middle of my health care. They jack up the prices on everything, not just drugs. UPDATE: every other civilized country has either single payer or two-tier system. I included a link below. Scroll down.","post_message":"U.S. drug prices are higher for 93% of 40 top branded drugs compared to Norway. That is unacceptable. We should use our buying power to get better deals for the American people."},{"comment_id":"935619299833521","commenter_b":"TRAITORS!!","commenter_a":"I'm done with them !","post_message":"SENATOR: Disney Fired 250 American Workers So They Could Hire Foreigners  A US senator demanded an investigation of a US visa program that Walt Disney World used to replace 250 American workers with...  @webpagelink"},{"comment_id":"10153987081447894","commenter_b":"D muthafucka!!! Learn to speak English!! Well Muthafuck you!!!!","commenter_a":"My condolences to his family and friends 🙏🏽😔","post_message":"Actor Bill Nunn, Best Known as Radio Raheem in ‘Do the Right Thing,’ Dead at 62 [Photos]"},{"comment_id":"10153434994756636","commenter_b":"I do hope she gets all the care she needs. These countries are very poor and need all the help they can get. Imagine if you lived over there and your own children where sick. This is just heartbreaking no matter what.","commenter_a":"Her immune system must be shot to pieces - I do hope they can sort out the problem and eventually cure her. She deserved the best possible care.","post_message":"Pauline Cafferkey's in hospital for a third time"},{"comment_id":"597841083739804","commenter_b":"OBAMA IS THE SAME ALL ARE THE SAME CORRUPTS AND CRIMINALS WHAT HAPPEN IS PEOPLE WANT'S TO BE CORRUPTS AND HAVE POWER AND ABUSE OF POWER THAT IS WHY THEY LIKE THEM CONGRATULATION LOOK AT THE WORLD HOW IT LOOKS AND THINK A LITLE NOT TO MUCH AND SEE WHAT IS GOING ON","commenter_a":"Damn right!","post_message":"George W. Bush was right, there were weapons of mass destruction.  We always had his back. He is a great man, and a true patriot.  Do you support George W. Bush?"}]
