[{"comment_id":"782996508468592","commenter_b":"'@username You know nothing fool.","commenter_a":"U.S. Attorney General Loretta Lynch is an idiot. Her and the Obama Gang are clearly violating the US Constitution and disregarding the rights and safety concerns of women and children. She should be hauled into congress for questioning.","post_message":"Just in: U.S. Attorney General Loretta Lynch announces that the Justice Department is suing North Carolina over bathroom law. 'This action is about a great deal more than bathrooms.' @webpagelink"},{"comment_id":"1173282172788559","commenter_b":"Sick sick woman","commenter_a":"How evil can these people be","post_message":"Oh. My. Gosh. Things just got weird really quick. @webpagelink"},{"comment_id":"10153794102616051","commenter_b":"Agree,she should be in prison","commenter_a":"AGREE","post_message":"Donald Trump says Hillary Clinton's record of scandals make her unqualified to be president. Do you agree or disagree?"},{"comment_id":"10153041474101051","commenter_b":"Take away the baby and tie her up so she can see how that feels .","commenter_a":"I'm assuming she gave the baby dog food.","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"766656443467536","commenter_b":"When the hell do CRIMINALS ABIDE BY LAWS????? Dumbasses","commenter_a":"Utterly completely fucking useless President. His brain =","post_message":"You have to see it to believe it."},{"comment_id":"10154383170579877","commenter_b":"Right","commenter_a":"He didn't become 'more racist', he already was. Trump just brought out their TRUE COLORS throughout his campaign. Big difference.","post_message":"This woman claims her ex became a 'monster' during Trump's campaign."},{"comment_id":"10153512540611491","commenter_b":"Blow this mf off the face of the earth","commenter_a":"'@username Camangyan","post_message":"'The only way for defending the sovereignty of our nation and its right to existence under the present extreme situation is to bolster up nuclear force.'"}]
