[{"comment_id":"10155065586189657","commenter_b":"She is garbage","commenter_a":"Gun owners - mentally disturbed. A man dressing up like a woman - \" Normal \" This is leftism.","post_message":"This wasn't a mistake, this was done on purpose."},{"comment_id":"10157076515550354","commenter_b":"Agree . No one uglier or nasty except her daughter !","commenter_a":"Where's my $$$? Ohhhh...she wants online trolls who will say something good about her....my mistake...","post_message":"SURPRISE!"},{"comment_id":"10154512976631943","commenter_b":"YES!!!!..... LOCK HER UP!!!...LOCK HER UP!!!!...HILLARY FOR PRISON NOW!!!!...IT MUST BE PROVEN TO ALL THAT NO ONE IS ABOVE THE LAW IN OUR AMERICA!!!....HILLARY'S CORRUPTION WILL NEVER STOP TILL SHE IS BEHIND BARS!!!!!.........TRUMP IS THE PRESIDENT AMERICA DESERVES!!!....GOD BLESS OUR NEW PRESIDENT!!!!.","commenter_a":"Mr. Trump we can't let her go Free!! She's trying to destroy you every chance she gets.. Let Gowdy loose on her","post_message":"Share if you agree!"},{"comment_id":"10155910391265725","commenter_b":"Take America back. STOP buying crap from other countries.","commenter_a":"DONALD TRUMP: Speaking what everyone is thinking. TAKE AMERICA BACK.","post_message":"Wow, some new and even greater polls-- thank you!"},{"comment_id":"1310434322356653","commenter_b":"@username you brought the feminism in when you started defending being a hoe","commenter_a":"Only one thing I disagree is he could have waited till the sun came out more to take her and the kids out. I don't blame him for his actions if his busting his ass to provide for her and the kids. If they your kids. Please don't abandon them. And she should be grateful he didn't hurt her. I'm praying they work it out for the kids if their his.","post_message":"He felt the punishment fit the crime. #WSHH #Cheating"},{"comment_id":"10156237879600594","commenter_b":"Her posture? She's not modeling, she's out on a boat with her nieces. I doubt they would have been in the picture if the intent was to be \"sexy\". She wearing a bathing suit. So what?","commenter_a":"The body is fine, the bikini is ugly and her posture is horrible.","post_message":"Ariel Winter takes the online hate and spins it into a message for all the bullied girls out there: \"YOU ARE BEAUTIFUL\""},{"comment_id":"778166008983598","commenter_b":"Huge wall!","commenter_a":"Obama is the racist pos","post_message":"“Has anybody tried that wine? How good can that wine be?” President Obama poked fun at Donald J. Trump and the GOP at a fundraiser in Texas."}]
