[{"comment_id":"819559654746124","commenter_b":"PS I certainly hope he doesn't think he's in the same league as Martin Luther King he's not fit to carry his shoes","commenter_a":"MLK Jr. Yes, Al Hell No !!!","post_message":"Martin Luther King, Jr. was a principled Christian who stood for his morals and convictions when fighting the Jim Crow in the Democrat-controlled South. For his courageous efforts, he paid the ultimate price.   Do you support MLK, Jr. and oppose Al Sharpton?"},{"comment_id":"1644623019109095","commenter_b":"Dear: Mr. trump; you have a nice fire burning for yourself, why open the damper and burn it out?","commenter_a":"Mr. Trump :If you truly believe in America, stop the hate talk: read, or have read to you, both the Constitution of these United States and the Declaration of Independence. My Uncles served in World War 2 to protect us from the Fascists (Dad had medical issues and couldn't serve in the military: worked for the government instead!) : by posting this, I'm hoping someone will connect the dots and know that's what you are!","post_message":"Statement on Preventing Muslim Immigration:"},{"comment_id":"10152737995296519","commenter_b":"Whore's goal. A quick happy ending, get the john outta there.","commenter_a":"Yep and when you have it down real well, men cum in one minute instead of two.....grrreeeaaaatt.","post_message":"'Those who master it walk away armed with strong sexual skillsets, and even stronger vaginas'"},{"comment_id":"10156418277360354","commenter_b":"Hey Rhonda! Cool last name!","commenter_a":"Which is exactly why Obama wants our guns...So we CAN'T take them out.","post_message":"This is slated to air tonight on '60 Minutes,' and it's going to INFURIATE liberals..."},{"comment_id":"10154930329184411","commenter_b":"eeehh how much cost an ukranian whore that can make this? 20 euros?","commenter_a":"OH someone throw these naked chicks money and maybe they'll start dancing to finally enterain us","post_message":"'Ukraine to EU', 'Break the Wall': The one-woman demonstration."},{"comment_id":"10153252592734138","commenter_b":"R u mad or naw?","commenter_a":"All the white people would try to escape n end up north side n get beat up","post_message":"Today, Gov. Mark Dayton blasted Newberger's remarks, calling them 'disgraceful.'"},{"comment_id":"10154481356497098","commenter_b":"You a dumb hoe kris","commenter_a":"The awkward moment when you spent all of your infrastructure funds on illegal immigrants and government handouts. 😂 #ihopetrumpmakesyougetonyourkneesandbeg","post_message":"FEDERAL FUNDS REQUESTED: Gov. Jerry Brown is asking the Trump administration for federal assistance in responding to a potential failure of a spillway at the Oroville Dam in Northern California."}]
