[{"comment_id":"968496726540356","commenter_b":"That thinking, @username, is why so many illegals come here. They know if they have their 'anchor' baby here, they will get to stay because that baby needs parents to care for it. More illegals come, have their babies, and get to stay...it's an endless invasion!!!","commenter_a":"If you are born in the United States and not on foreign soil like an Embassy, then you are an American, but that doesn't mean your parents or the rest of your family are!","post_message":"A few of the candidates have come out against birthright citizenship so far.  Message your Rep and make your voice heard!"},{"comment_id":"1015796225098514","commenter_b":"Funny... I keep hearing people say that Climate Change is George W. Bush's fault.","commenter_a":"What's funny is climate change was never a political issue before the republicans made it one after Obama was elected. Even Bush admitted it is real, but the sheeple just keep to their marching orders from fox.","post_message":"Get ready"},{"comment_id":"10154012875581523","commenter_b":"Dawn did you see this mother fucker?","commenter_a":"Such a thug","post_message":"Was an Alabama man pushed to apologize because of public outrage over a social media post?  It sure seems that way."},{"comment_id":"525067284350518","commenter_b":"Leave our country. Go home and behead your own.","commenter_a":"Leave!","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy.  Let them be angry. This America and if you don't like it, get out.  Do you agree that Muslims should assimilate or leave?"},{"comment_id":"10152883949732507","commenter_b":"John, it's entirely secret to protect children and families. Social workers are ethically obligated to not share more than they have to, and why should they when sharing information can often cause more harm than good?","commenter_a":"Home schooling wasn't the reason. You can home school, live in a tent, even be homeless. There were other reasons. Living in filth, broken glass, all stated in a copy of the letter the mom posted to her Facebook. I read it earlier in another article. I work for children's services, nothing is as clear as it seems.","post_message":"This should spark a lot of debate."},{"comment_id":"10153495156678132","commenter_b":"Gosh, her voice is so heavily autotuned in this song, it sounds robotic!","commenter_a":"I dont get how she has music contract when literally all of her songs are autotuned. That means you're not a good singer. Anyone can sing when their voice is manipulated like that.","post_message":"Don't expect us to get anything done for the rest of the afternoon."},{"comment_id":"836657323038276","commenter_b":"She didnt get in trouble for the see through top. She got in trouble for her shoulders. Even if she did wear a shawl over it, it would still show the see through part","commenter_a":"I agree with the school","post_message":"Take a close look."}]
