[{"comment_id":"589887647811084","commenter_b":"Please don't breed...","commenter_a":"Well I'd show an officer my id when asked, but some people feel differently and it's their right to walk away if they've done nothing wrong. Obviously she was never charged with \"jaywalking\", so in retrospect, she did nothing wrong according to her court hearing. Just saying.","post_message":"Are you kidding me?"},{"comment_id":"10153063738641135","commenter_b":"Ladies","commenter_a":"Except, it turns out she is not a very kind person either. Her facebook is private now but before this story broke and it was visible, she had posted many things making fun of those with disabilities. She is also appears to be a 9/11 conspiracy theorist. I wish news outlets would look into this before constantly sharing this story.","post_message":"ICYMI: A Michigan mom bought coffee for two women behind her at a Tim Hortons despite insulting comments made about her looks. STORY: @webpagelink"},{"comment_id":"10154011395049778","commenter_b":"Women get less pay than men so I guess the bill won't be worth the face value","commenter_a":"I really couldn't careless as long as the bill still spends the same.","post_message":"A woman will appear on the $10 bill beginning in 2020, the Treasury Department said Wednesday."},{"comment_id":"10156284992790354","commenter_b":"Shes an ugly man","commenter_a":"You can't unwatch. But you can refuse to watch.","post_message":"If you've ever said to yourself, \"Gee, today I really want to see a 74-year-old Socialist disco dance,\" then today is your lucky day. If, on the other hand, you said, \"For once, I'd like to see Democrats not seek to destroy their own country,\" well...no such luck."},{"comment_id":"10153527137233717","commenter_b":"Hell no! The real woman for the job is Hillary! #Hillary2016","commenter_a":"Please support Carly Fiorina tomorrow! Non establishment, proven leadership. Fight against the machine with a level headed conservative. Please support Carly! She needs your help to place in the top 4!","post_message":"Donald J. Trump is holding a rally at the Verizon Wireless Arena in Manchester. Watch live: @webpagelink"},{"comment_id":"10153080401256051","commenter_b":"There is a hog epidemic going on in the U.S. there destroying farms everyday...there's a big need to keep the population down. Quit crying your not the ones who's life's are being destroyed","commenter_a":"The ribs are good .. smokin low and slow.","post_message":"These hunters have one message and one message only for their critics: get over it."},{"comment_id":"10154948296594203","commenter_b":"all the illegals voted too..","commenter_a":"Hillary has 2,017,563 extra votes then Trump. The difference of extra Two Million+ vote which can give a decisive victory to a candidate \"anywhere else in the world\" has ZERO value in America?","post_message":"BREAKING."}]
