[{"comment_id":"1765071860379740","commenter_b":"damn elizabeth coming out swinging","commenter_a":"That was EXACTLY what happened to another person that was supposed to be deposed and speak out against the Clintons years ago, and was found three days later by the FBI after the guy missed his deposition:-(","post_message":"Do you think the Clinton's were involved in his death?"},{"comment_id":"639140816274210","commenter_b":"Just like your whore mother.","commenter_a":"She is a pig.","post_message":"I am sick and tired of Michelle Obama and her family in the White House...GET OUT!"},{"comment_id":"10154114787935329","commenter_b":"LOL Chad.... Mom I'd be so mad!!!","commenter_a":"Chad Stacy Mike Deb don't buy these for the girls!!","post_message":"'Her butt-length hair is now chin length. I was lucky to save that much.'"},{"comment_id":"2049822328577410","commenter_b":"'@username Mexican rapists.","commenter_a":"My question is, why is the inauguration not being cancelled until all of this has been investigated and charges brought together? Why is nothing being done?","post_message":"'Either Donald J. Trump and friends have engaged in treasonous acts or America’s intelligence officials are guilty of a colossal lapse in judgment — or worse, a conspiracy against Trump. Either way — whether any of these allegations are true or false — the entire matter must be investigated thoroughly and immediately.' - Bill Moyers and Michael Winship"},{"comment_id":"1023434111010933","commenter_b":"someone can't read the headline in the article lolol","commenter_a":"Stop blaming anti vaccers, we are the ones smart enough not to inject ourself or others with the disease.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"10155244013599384","commenter_b":"We the American people deserve to have accountability for all elected officials from all branches of Government!","commenter_a":"Thank you, @username, for doing your part in bringing this situation to light. I want nothing less than a full, thorough investigation of all possible inappropriate ties between Trump administration officials and foreign powers. Pursue this to completion, wherever that leads. Thank you again.","post_message":"Mike Flynn’s resignation was a step in the right direction – but there are many more questions that need to be answered before we can fully understand the relationship between the Trump Administration and Russia. Tune in now to watch my press conference on the topic live:"},{"comment_id":"10153490516091337","commenter_b":"You mean unlike theAmerican Killers of babies, rapist, serial killers, the ones signing up to be terrorist! Jake you're a blinded fool!!","commenter_a":"Illegal immigrants are coming in from all over South America , through Mexico, and the Mexican government is doing nothing to prevent it. And if you people watched anything besides cnn and msnbc, you would know that a lot of them, not all, maybe not a majority, but a lot, are killers, rapists, or drug cartel agents, and since crossing our border which is leaking like a sieve have continued those harmful activities in the US. But obviously Trump is a bigot for describing what is really occurring. The fact is he is one of the few candidates who has described a coherent plan for what he would do as president, and been more open to the media by far in the short time since announcing his candidacy than Hillary ever has. I hope he blasts her back into the Stone Age in the general election if he wins the ...","post_message":"'It’s not Mexicans necessarily. They’re coming from all over.'  2016 GOP presidential candidate Donald J. Trump talked about 'killers' and 'rapists' again..."}]
