[{"comment_id":"1525627194121061","commenter_b":"no one wants californians","commenter_a":"Why, Canadian provinces are constantly talking about seceding from Canada.","post_message":"Canadians are inviting Washington, Oregon, and California to secede and join Canada."},{"comment_id":"564263730449143","commenter_b":"She prolly snuck it in in her lady part","commenter_a":"Pam murdered Russ Farias wife Betsy and framed Russ","post_message":"Pam Hupp charged with murder - O'Fallon, Missouri Police and St. Charles County Prosecuting Attorney's Office hold a press conference on charges related to last week's shooting. Hupp has been charged with 1st degree murder in the shooting death of Louis Gumpenberger. She was arrested Tuesday. She was a central figure in a highly publicized murder trial covered extensively by Fox 2 News."},{"comment_id":"633021916884133","commenter_b":"Handler is not someone who the 1st lady would want to meet with. Talk about the trash...","commenter_a":"Chelsea Handler who is a hardcore supporter of Hillary Clinton and a Democrat. She is actually a racist.","post_message":"Wow..."},{"comment_id":"1614611835509066","commenter_b":"you're welcome u baster","commenter_a":"I'm going to the toilet and leaving my phone on charge, I expect loads of likes when I'm back. Thank you","post_message":"US President-elect Donald J. Trump will soon be accompanied at all times by a military aide carrying the nuclear \"football,\" enabling him to order a nuclear strike at a moment's notice."},{"comment_id":"10155447635791509","commenter_b":"She just needs to shut up. She's backing a rapist wife","commenter_a":"Wikileaks is Hillary's nightmare","post_message":"\"I can't believe that I am saying that a candidate for President of the United States has bragged about sexually assaulting women,\" Michelle Obama, speaking in New Hampshire, addresses the Donald J. Trump tape @webpagelink"},{"comment_id":"10153642344498132","commenter_b":"You can put lipstick on a pig but, it's still a pig!!","commenter_a":"He looks kind of mean as a woman :(","post_message":"Caitlyn Jenner, can we borrow that mini?"},{"comment_id":"637787356403576","commenter_b":"She's a psychopath","commenter_a":"She's correct. We're living in an era when a significant number of Americans simply refuse to acknowedge facts, or even the existence of facts. It's the populist wave.","post_message":"Hillary Clinton: \"It's now clear that so-called fake news can have real world consequences.\""}]
