[{"comment_id":"10153190415066037","commenter_b":"#TooBadBitch","commenter_a":"Please let him lose !","post_message":"BREAKING Israel Prime Minister Netanyahu and center-left opposition tied in election exit polls"},{"comment_id":"10154403370309170","commenter_b":"She needs to go bye","commenter_a":"We're doomed!","post_message":"You have got to be kidding me. We actually elected people who believe stuff like this?"},{"comment_id":"1317807834918571","commenter_b":"Hillary Clintin is a nasty Woman, I like the sound of that truth.","commenter_a":"TRUMP = TRUTH","post_message":"WATCH LIVE: Donald J. Trump's campaign manager tells Bianna Golodryga about the \"rigged election\" claims."},{"comment_id":"976609702473803","commenter_b":"Most black people i know WANT self segregation. They want a unified black country within the country and that is completely ok. White people make up 70 percent of this country so by proxy their is going to be areas without minorites. That's completely ok too. What we need to admit is that as a main rule forced integration doesn't work. In areas which are more racially undiverse there are fewer racially based crimes. It doesnt mean we all can't be friends it means we aren't all the same culture. And that is fine!","commenter_a":"what's the points of hate we all go to die one day, so enjoy the trip we call LIFE","post_message":"Top 10 Most Segregated Cities in the US"},{"comment_id":"10154298408534060","commenter_b":"Actually, it's incredibly efficient for what it is.","commenter_a":"All meat is a waste of energy and thus unsustainable.","post_message":"Human consumption of farmed fish has overtaken that of beef. In fact, aquaculture may be the only way to supply mankind with enough protein in the future"},{"comment_id":"859144567515130","commenter_b":"I did walk in the shoes of a LEGAL immigrant. We get that money gets you here either way legal or illegal. But when you lack respect for laws you come here illegally when you respect them you come here legally. Trust me I get the escaping from violence and your family is in danger side of it. There are avenues if that is the case in these days for emergency immigration if you fit the criteria.","commenter_a":"Si se puede! We are all immigrants and thats what makes up the USA !","post_message":"\"We love this country. We want to belong. We want to come right with the law...we don't like living in fear. We want to be out of the shadows.\" -Gaby Pacheco, DREAMer"},{"comment_id":"10154169792132629","commenter_b":"@username bye bitch","commenter_a":"BernieOrBust! We are giving the people in the remaining states the opportunity to make the right choice! This is not a threat, its promise! Thanks to social media we are constantly talking to each other, organizing and planning our next steps! The bigger picture doesn't have the Democratic Party playing a role if they are adamant about representing the 1%! Those of us who are Bernie or bust have no party loyalties! We don't care about what happens to the party if they don't care about us in the primary! It's just that simple Trump does not scare us. We plan to vote a bunch of Progressive's in the House to block his agenda, but Hillary scares us more! The ultrarich neocons in the right wing love her and hate Trump! That's a problem! She will get a lot of center right policies signed into law! And we will never ...","post_message":"Hillary Clinton won no delegates, because Washington Democrats already awarded them based on party caucuses in March."}]
