[{"comment_id":"1101493276543118","commenter_b":"More than possible! I always thought this would be the case when he first got put in jail. Been praying for his release and for all those associated with him. Been praying for his family.","commenter_a":"Is it possible that GOD used Saeed to bring the gospel to the prisoners...,GOD works in mysterious way?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153605944168984","commenter_b":"No more abortions no more planparnthood","commenter_a":"My niece had a baby at four months completely formed , she is still so sad about it death , they held and took pictures. I don't know how this is not murder in the womb ? Cause a abortion is! !!","post_message":"Even with all evidence going against them, Planned Parenthood keeps on coming out with one unbelievable excuse after another.  Do you think it's time to defund and get rid of Planned Parenthood?"},{"comment_id":"10150671719984999","commenter_b":"Any idea the amount of time it takes to pluck the gorilla hairs off her body and face?","commenter_a":"Exquisite and Gorgeous..","post_message":"Michelle Obama has often made a point of wearing gowns by designers whose backgrounds and cultures reflect the countries being honored at state dinners.  Friday night was no exception. @webpagelink  Photos, clockwise from top: Jim Watson/AFP — Getty Images; Mark Wilson/Getty Images; Luke Sharrett for NYT"},{"comment_id":"934086226709659","commenter_b":"Put more women in your cabinet!","commenter_a":"I AM MY SISTERS VOICE VOTE DEM :::::::::::REVELATION 21 = THE TWO ARE ONE = TWO TRUMP AND WALKERIGHT ONLYESATANACYES <DID 911 SATANACYESEENTHREE THE FATHER THE SON THE HOLYESPIRIT <<< THEY DID IT NY INDYESHUALLHEARTRUTHEART:::::KY DC = DOVESON CHRIST < TRUE IN THE FLEASH CAME ON THE 3RDAYESON ROCKING < THE TRUTH USABLE <++++}:::::::::::::::::::::::::::::::>ART<:::::::::::::::::::::::::::::::{+++>:<>","post_message":"Born five years before most women could vote in America, Shirley has lived through the Great Depression, two world wars, the Civil Rights Movement, and the moon landing. Today, she’s rooting for something she never thought she’d live to see: the first woman president of the United States."},{"comment_id":"10154307345026729","commenter_b":"I am a liberal and I totally agree with the poster, so why are you irritated with liberals; your reasoning doesn't make sense to me.","commenter_a":"Or becoming traitors and taking over federal buildings!","post_message":"This will definitely irritate liberals and the 'coexist' crowd"},{"comment_id":"10153400582321051","commenter_b":"She's a bitch? Really???","commenter_a":"Have fun in jail bitch","post_message":"When this man's wife discovered he was cheating on her, here's how she decided to handle it."},{"comment_id":"10154242646146336","commenter_b":"Lots of ladies in Texas have CHL (concealed handgun license) enter at your own risk!","commenter_a":"Caitlyn Jenner is harmless. But lots of creeps out there will go into the women's room to do things other than pee. It's only a matter of time before we hear the horror stories. Be careful ladies.","post_message":"Donald J. Trump said this morning that he does not agree with North Carolina passing a law on bathroom use by transgender people.  He added that if Caitlyn Jenner visited Trump Tower she could use whichever bathroom she prefers. @webpagelink"}]
