[{"comment_id":"2202427943315983","commenter_b":"@username go beat your wife old man","commenter_a":"The ole draft dodger than said McCain wasn't a war hero because he was captured in battle. Yeah he really respects our military to nominate someone who is already part of the problem with the VA. I am a Republican at heart but I'm not going to blindly follow this man like some are. Words have meaning.","post_message":"Watch: President-elect Donald J. Trump and Vice President-elect Mike Pence lay a wreath to honor the nation's fallen soldiers at Arlington National Cemetery."},{"comment_id":"10153467245366770","commenter_b":"@username are you doing your homework?","commenter_a":"According to Roger Stone, 182919686769s Mens Fashion Editor and the only named \"source\" in the National Enquirer smear story about Ted Cruz cheating on his wife with five women. Ted Cruz doesn't have time for that crap, he's too busy pushing back the establishment.","post_message":"\"Despite the old guard and amateur pundits blaming Donald J. Trump and the majority of GOP voters who support him, much of the rift in the Republican Party has been caused by Texas Senator Ted Cruz conning nationalists into believing he is one of them.\""},{"comment_id":"10152934239186336","commenter_b":"If O had a son!! Hold the phone he would have to be heterosexual!!!","commenter_a":"Home grown terrorist!","post_message":"A former taxi driver from Virginia has been added to FBI's list of most-wanted terrorists."},{"comment_id":"10155955897895354","commenter_b":"The nasty b*tch just wanted attention and guess what? Now everybody is giving it to her.","commenter_a":"For the life of me I will never understand killing these magnificent animals. I just don't understand how it can be wonderful, thrilling, exciting or in any way fulfilling to kill an exotic animal. And then chop it's head off or whatever you do with that giraffe and have it mounted. Makes not one bit of sense let alone any kind of satisfaction.... Just don't get it.STOP IT NOW!!!!","post_message":"This hunter is single-handedly breaking the Internet today.   Check out the photos of her other controversial kills..."},{"comment_id":"957758620983859","commenter_b":"I don't mean to sound rude on the subject but I'm soooo tired of women having kids (multiple times) and complaining about life is so hard for them. Like honestly, if you wanna take cum and get pregnant maybe you should think before just doing","commenter_a":"If you have kids you deserve the struggle. Don't have kids until you feel ready or accomplished enough to bring a new life into the world. If you have kids before the age of 21 then you are a complete idiot and shouldn't get help from anyone cause stupidity isn't worth saving","post_message":"Great point!"},{"comment_id":"355920354532026","commenter_b":"She does not care about you!","commenter_a":"okay, the need and movement for change I support and believe in, but sorry HILARY CLINTON no vote from me","post_message":"“We’re hoping that we can partner with Hillary to get some true change for all people.” —Maria Hamilton, mother of Dontre Hamilton"},{"comment_id":"10152777603232093","commenter_b":"Idiots","commenter_a":"I say bring a fire truck and water there down. Keep then at a distance.","post_message":"15 officers have been injured in Baltimore riot, 2 still in hospital; 2 dozen arrested..... @webpagelink"}]
