[{"comment_id":"1390855700937474","commenter_b":"RACIST!","commenter_a":"I can't imagine ever turning down an invitation to the White House no matter what! As an American I would consider it the highest honor!!! Can I go in his place?","post_message":"We know that Brady, Belichick, and Bob Kraft are friendly with President Trump. But one member of the Patriots doesn't seem so keen on going to the White House."},{"comment_id":"949119691868046","commenter_b":"@username You cant be this obtuse. It was a joke. Have you seen any of her material? What was disgusting was her response to a KID.","commenter_a":"She's famous, making a great living for herself and it is because of the fans. If she doesn't want attention or people taking pictures of her / with her then she should have chose a different profession. She should be humbled that someone likes her enough to stop her on the street for a picture, not post a picture ridiculing a fan on her instagram for thousands of people to see. Poor taste.","post_message":"Find out what made Amy Schumer put an end to fan pics."},{"comment_id":"10152998520246037","commenter_b":"Rules are rules. But the airline's inconsistency in enforcing those rules is the real issue. It was ok to hold the child on the way down, it should have been the same on the way back. BUT I find the attention mongering of this mom downright pathetic. Totally disgusted. Not everyone is a world traveler, and I also get confused by the ever changing rules of the sky. Seems to me the mom holding her daughter was pretty clear that now she knows the airline's policy she will have a safety seat with her in the future. No further big deal made of it, issue was put to rest. Until this attention whore feels compelled to one-up her and try to publicly shame her. Disgracefull, classless and pathetic. If the woman went on and on and on about how she should be allowed to hold her child anyway, Yada yasa ...","commenter_a":"I agree with most of you, if she has a child with special needs then they shouldn't have been seperated in the first place. Secondly if the flight attendant had let that happen and something happened, then who would've been at fault then??","post_message":"\"The attention mongering schemes of Elit Kirschenbaum, who took to Twitter last week lambasting a United Airways flight attendant for refusing to allow her to hold her disabled three year old daughter on her lap during take off, make me want to puke.\""},{"comment_id":"10154220777628487","commenter_b":"u rude fuck","commenter_a":"I always find it irritating that a typical response to vegetarians/vegans is something along the lines of \"it's fine as long as you don't push your views on others.\" As a lifelong vegetarian for ethical reasons, I go about my day constantly reminded that the vast majority of the people I encounter are active proponents of what I consider to be systematic violence that trumps the holocaust. Imagine believing that and being expected never to mention it. I actually don't mention it, because I've found that people simply do not give a fuck about the suffering of animals, and it is far too depressing to endure such conversations. But it continues to irritiate me when people say, it's fine, just don't push your views on others.","post_message":"Russell Simmons, founder of Def Jam and author of \"The Happy Vegan\", teaches us how to defend the plant-based diet that many love to hate."},{"comment_id":"10152776226595047","commenter_b":"stupid anti Christians !","commenter_a":"Can't let them get away with this.","post_message":"General Craig Olson thanked God for his military successes, and asked for prayer for those being deployed at a National Day of Prayer event. Because of his public declaration of his beliefs, an anti-Christian group is demanding he face a court martial. This is outrageous. SIGN & SHARE the petition to fight back: @webpagelink"},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."},{"comment_id":"10154624761426336","commenter_b":"What a dumb woman...","commenter_a":"Its her policy that allows these people in our country to kill us.","post_message":"Hillary Clinton addressed the latest bombings in New York City and New Jersey and emphasized that Donald J. Trump's comments are being used to recruit terrorists. @webpagelink"}]
