[{"comment_id":"10153091643525496","commenter_b":"This woman is unreal and needs to get a life!!!","commenter_a":"Bet he won't be excited to see her any more! What kind of aunt does that! She should be ashamed!!","post_message":"The woman says her nephew, whose mother died last year, was so excited to see her arriving at his birthday party that he caused her to break her wrist: @webpagelink"},{"comment_id":"940305309340143","commenter_b":"Muslims should be ban from Guns & Knives !","commenter_a":"Nice sentiment, but It'll never stand. If People can be forced to bake a cake against their beliefs, the muslum-loving bunch in D.C. won't allow this!","post_message":"\"I will not arm and train those who wish to do harm to my fellow patriots.”"},{"comment_id":"10152960759722377","commenter_b":"this traitor could add votes from the foreign countries that paid her bribe money to her and bills family charity, like she will add the illegals vote here in the US when the election rolls around","commenter_a":"#ClintonResign","post_message":"The former secretary of state is looking for a more aggressive way to increase her poll numbers."},{"comment_id":"733367520187159","commenter_b":"we need to get these low lifes out of our country","commenter_a":"I am offended by them. I don't want to take them down but can we send them home. I m gladly contribute with the air fair","post_message":"Muslims Make Massive Move To Change The Flag Because It's Offensive If you don't like the flag you can leave. Do you think this is absurd?"},{"comment_id":"1858429714391337","commenter_b":"Canadian has no say. Go home","commenter_a":"He's a fat, ugly, ignorant pig. Hit the sty.","post_message":"Simply pathetic."},{"comment_id":"809483035820491","commenter_b":"Send her little ass over there to stay and take her ma ma with her","commenter_a":"NO FOR GOD SAKES , NO MORE CLINTON'S.","post_message":"Send Chelsea to Benghazi! Dc Gazette (y)"},{"comment_id":"1745001682421383","commenter_b":"Just when I think I had seen stupid, I look at a news feed like this, and all you libtards take stupid to a whole new level. All you lazy Daisy's don't want Trump in because your welfare checks will go away, and a you illegals will be deported home to build that WALL!!!!","commenter_a":"Trump is hammering her, love it! All she can do is smile & laugh because she has nada","post_message":"\"I will release my tax returns – against my lawyer's wishes – when she releases her 33,000 emails that have been deleted.\" Donald J. Trump hit at Hillary Clinton's email issue in the first presidential debate. #Debates2016 @webpagelink"}]
