[{"comment_id":"10153029047279032","commenter_b":"Olivia Jean Plassmeyer how sad","commenter_a":"She looks evil... Yikes!","post_message":"PUPPY MILL ARREST: Authorities say a Wittmann woman is facing more than 200 charges of animal abuse and neglect."},{"comment_id":"10154324674924916","commenter_b":"@username, She's actually the lesser of two evils.","commenter_a":"When you cast your vote for an out right bull shitter, who hasn't one damn idea of how he's going to run the country, except to say, \"it'll be better\", your one dumb son of a bitch, and your dragging the country into the gutter.","post_message":""},{"comment_id":"1172494429493450","commenter_b":"These dumbasses should be ashamed ... No one will ever vote for either of these liars again . No Honor ..No Vote","commenter_a":"These three men will never get my vote in the future. Anyone that is with her is corrupt... Republican or not you need to go.","post_message":"GOP 'Never Trump' Candidates get a Warning"},{"comment_id":"10153520082123132","commenter_b":"YES CANCEL, PLEEEEASE!! ONCE A CHILD MOLESTER ALWAYS A CHILD MOLESTER!!! CHILD MOLESTERS NEVER GET REHABILITATED!!! IT'S BEEN PROVEN!!!","commenter_a":"NO!!!","post_message":"Do you think TLC should cancel 19 Kids and Counting?"},{"comment_id":"667325733458005","commenter_b":"Gloria I agree. Get their muslim butt back where they came from","commenter_a":"Muslims if you don't like the way America's are then leave. Clint Eastwood has every right to be artistic and make true movies about who you really are then leave AMERICA. We have freedoms you do not have so leave because we will not stop being Americans. The movie was very well done and true to the ooint.","post_message":"This angry Muslim group wants Clint's head, but he's not backing down.  He is a true American, and a real patriot.  Can we get 125,000 'LIKES' for Clint Eastwood?"},{"comment_id":"794164403965442","commenter_b":"F%%+ white people !!!","commenter_a":"This is why I hate white people!!!","post_message":"In an update to our previous coverage; ASU Police Officer Stewart Ferrin's administrative leave has been extended. His case was passed over to the new ASU Police Chief who will decide on the officer's fate."},{"comment_id":"1727638077485478","commenter_b":"Theyre cool. But they claw into you. Very clingy animals","commenter_a":"@username this is why i wana go Australia - want one asa pet lets get one","post_message":"Koala joey plays in baby basket. Via Symbio Wildlife Park"}]
