[{"comment_id":"601311203355417","commenter_b":"What a dumb bitch","commenter_a":"I know lets get someone to shoot at her then we can see if she is right","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s.  This is the most ridiculous thing I've ever heard.  Are you offended by this?"},{"comment_id":"10154453767181729","commenter_b":"Liar liar pants in flames","commenter_a":"BHO will pardon her.","post_message":"And she still thinks she's going to get off scot-free..."},{"comment_id":"10153461070784614","commenter_b":"Yup they should FRY !!! Not next week not next year but NOW !! Those are extremely sick people who can do that and don't deserve to breathe air .","commenter_a":"Sick. There are really some evil people in this world. God rest his soul","post_message":"A good Samaritan who offered his help as an AA sponsor was lured to a downtown L.A. hotel by a couple for the purpose of fulfilling 'long-held fantasy' of dismembering a body, prosecutors say.  Edward Garcia was convicted of murder Tuesday in the torture and dismemberment death of Herbert Tracy White.  Prosecutors say Garcia carved up White's body with a 3 1/2-inch blade and dissected and sliced a piece of leg muscle from the bone.  Hotel employees found White's severed arms and a backpack full of flesh in the room. Under the blood-soaked bed was White's torso riddled with scratches and small punctures.  'It was a bloodbath,' prosecutor John McKinney said. 'They took this man apart.'  Read KTLA's story here: @webpagelink"},{"comment_id":"10154985023891192","commenter_b":"Because life on Earth is the only life we can observe and study, so it makes sense to look for other life within the scope of life as we know it. How could we even begin to look for other forms of life if we don't have a clue what to look for?","commenter_a":"I really don't understand the definition of 'alien life' and why scientists think the environment needs to be remotely similar to ours to support 'life'. HUMANS need the right temperature and water.... 'aliens' may not....??!","post_message":"BREAKING"},{"comment_id":"989968744373799","commenter_b":"I will be keeping the guns thank you.","commenter_a":"We need anti knife and anti-texting while driving legislation.","post_message":"Commentary from Blaze contributor and pastor Jarrid Wilson."},{"comment_id":"10153642816391130","commenter_b":"Fk this bitch","commenter_a":"What a horrible article.","post_message":"One reason? Bernie Sanders is 'too old.'"},{"comment_id":"10153051145414094","commenter_b":"And if gun laws don't work, why have any safety laws? Should hardware stores sell nuclear material because the bad guys will get anyways? Should we not have traffic laws because the bad drivers will run a stop light anyways and crash into a school bus?","commenter_a":"While Republicans were defending the lack of sensible gun laws and calling this an 'accident', the families and communities of this Church showed such dignity and Christian values by first saying that they forgive the shooter. They are such an amazing example and inspiration to this country. God bless them.","post_message":"Relatives of people killed in a shooting at a black church in Charleston, S.C., addressed the suspect in court Friday In an extraordinary display of grief and forgiveness."}]
