[{"comment_id":"1339247516091906","commenter_b":"America is turning vile and to bad for those who can't see it. If we keep it up we all lose .","commenter_a":"That is because it's a love fest! Everyone eventually comes around and loves Trump! He will be our greatest president in modern history! #trump2016","post_message":"Fox News host Megyn Kelly and Republican presidential candidate Donald J. Trump met in New York City on Wednesday morning."},{"comment_id":"10155180907040649","commenter_b":"@username You are right but the other way around Soros running Obama and Hillary. They all need to go. God be with us all. Trump needs us more now than ever. Pray people and I mean pray as hard and often as you can. We will also fight them tooth and nail if need be and its looks like we are going to have to. Just stay awake, stand up no giving up and no giving in, we will not be taken down and we will win.","commenter_a":"They're rioters, not protesters. Well paid radical left-wing thugs. Call it like it is...and find out who's backing these people.","post_message":"Question of the Day: Do you think President Barack Obama and Hillary Clinton should condemn the violent left-wing protesters?"},{"comment_id":"1120823271280022","commenter_b":"What you actually mean is that all women are idiots","commenter_a":"Proof that republican women are idiots.","post_message":"If we're going to be honest here, the thing that might be most shocking is that ANY women could look at ANY of these candidates in a favorable light."},{"comment_id":"1170311373061915","commenter_b":"Bitch, YOU'VE been punked and you're too stupid to grasp that fact!!!","commenter_a":"Will has a right to do what he wants to do.!!!!!!!!!! Who the f- -k does Trump think he is?!!!!!!!!!!!! It's time he kept his trap shut.!!!!!","post_message":"Brilliantly played, George Will!"},{"comment_id":"10158155475600615","commenter_b":"Man baby. Strong women make them crazy.","commenter_a":"No surprise! We might respect the office of the President, but that's not \"carte blanche\" for Trump to do whatever pleases his whim.","post_message":"Check out these images from Women's Marches around the world."},{"comment_id":"10153362958101955","commenter_b":"I agree. The Barbarians are within.","commenter_a":"Our own government is the biggest terror threat we've ever had.","post_message":"House Intel Committee Chair: US Is at 'Highest Threat Level We Have Ever Faced'..."},{"comment_id":"985973531519425","commenter_b":"All republicans should stand behind \"the people's \" choice!!!","commenter_a":"Who needs him I hope he gets fired","post_message":"What do you think? Is it too late? @webpagelink"}]
