[{"comment_id":"941727655948060","commenter_b":"the reason Trump is doing so well is that most Conservatives like me are sick of the way our country has gone down for the last 7 years..it got worse not better. Veterans treated shamefully especially the wounded in our VA hospitals. THe amount of our money that has been given to terrorist countries that hate us. And the flooding of our country with illegals who are given everything when we have many poor who could use help. Plus we do not know who or what has been coming here. Some that could be dangerous to our citizens and have been..","commenter_a":"Trump!!","post_message":"The Indiana primary may be the end -- and it's THIS WEEK. Make your voice heard by clicking the link & voting now."},{"comment_id":"1398961996812250","commenter_b":"Hhhh u wish loser umais .. our heels over u and ur terrorists logic","commenter_a":"So what stopped Iran from making a grand Muslim Allaince against Terrorists? Unfortunately Iran gave it a secterian touch by involving only shias in the fight against daesh. Iran did not reach out to any Muslim country to come and help them in fight against daesh or did they?","post_message":"Pakistan’s Defense Minister has confirmed that the country’s former Army Chief has been appointed as commander of a so-called Saudi-led military coalition."},{"comment_id":"10153391027640950","commenter_b":"THEY DONT WANT CONTROL FOLKS.","commenter_a":"CBS, you need to get control of that audience, they really are ruining the debate. I want to listen to the candidates, not to cheers and jeers","post_message":"Marco Rubio to Ted Cruz: I don’t know how you know what I said on Univision because you don’t speak Spanish. Immediately, Cruz responds…in Spanish @webpagelink"},{"comment_id":"10153619663514877","commenter_b":"maybe he got 3 ugly wives.","commenter_a":"he int even cute, so his game must be strong, lol, just divorce the loser, with three wives he will not have an account, hahahah","post_message":"Man charged with being married to three women after second wife catches him on Facebook. Grio fam, what would you do if you found out your spouse was married to someone else via social media? Sound off below!"},{"comment_id":"717585195090025","commenter_b":"With your logic, then what about all those moms bringing their little boys into women's locker rooms and bathrooms? They have penises and they don't belong there. Send them by themselves into a men's room and wish them good luck with the pedophiles who might be there.","commenter_a":"Just because it happens in YOUR family doesn't mean the whole of the rest of society must have their mores changed because YOUR bro/sis has identity issues. This is not and access issue. This is not and equality issue. This is a PERSONAL issue to approx 1.6 million adults and unless your bro/sis has had their genitals 'fixed' I don't want them wagging about in the locker room with my grand kids and great grands. After the 'fix' is in and they've chemically changed themselves to be more like what they think/want to be, I have less of an issue with it. mym","post_message":"Speaking out."},{"comment_id":"10154162654734087","commenter_b":"Yep, we saw how Liberal women threw their crotches at Bill Clinton with votes right? My guess is most would have gladly changed places with Monica Lewinsky. Sucks to be a hypocrital non-critical thinking Lib woman. That's Lib Feminism I guess.","commenter_a":"Yes, when a bigoted, neo-fascist, sexual predator runs for president on the GOP ticket, Democrats are loyal to their party and independents and moderate Republicans stream to join us to stop him as well...funny how that works.","post_message":"\"With the exception of cheating Bernie out of the nom the Dems have always proven to be far more loyal to each other than the Republicans!\" Trump tweeted."},{"comment_id":"10158232325655646","commenter_b":"Didn't one of those illegals walk back in and rape and murder a woman whose husband was a official of the government...This should not be able to happen in this country.","commenter_a":"Surprisingly enough nobody see's the resemblance to how the Jews were being taken during one of the Schutzstaffel's (S.S.) \"routine sweeps\" History Repeats itself my friends! We let it happen!","post_message":"Immigration and Customs Enforcement officials have yet to release details on how many people agents arrested Thursday, but advocates say more than 100 immigrants were taken into custody as ICE conducted home raids in Santa Paula, Oxnard, Van Nuys, Downey and San Bernardino. Those detained were either illegal immigrants with deportation orders but no criminal background, or family members of those sought who were home during the raids and told officials they lacked documentation, according to the Coalition for Humane Immigrant Rights of Los Angeles."}]
