[{"comment_id":"1365633703532878","commenter_b":"@username...Such a joke!!! Hillary should just accept it...it's over...Trump won!!!","commenter_a":"“Anyone not willing to accept the results of an election is a danger to democracy.” - Hillary Clinton","post_message":"As Wisconsin prepares for a recount..."},{"comment_id":"10154883031433010","commenter_b":"Illegal Immigrants have been paying taxes for the longest time. Look it up. I suppose you don't want that money either.","commenter_a":"Those law makers assume that all Californians want this, many of us don't want lawless immigration, no matter what country they are from. We don't like that our laws aren't being enforced and our budget and resources for our state are being given away to non-Americans.","post_message":"California's fighting back."},{"comment_id":"1260055474038645","commenter_b":"Wonder who will pay her and the teachers salaries, and provide security and law enforcement if all the \"white people\" leave","commenter_a":"Have you seen it ? They can have it.","post_message":"Chicago Teachers Union Karen Lewis This City belongs” To Black People And Not White People."},{"comment_id":"10154466524309203","commenter_b":"She's disgusting","commenter_a":"Enough of the hate and racism. Every time they open their mouths, garbage comes out.","post_message":"CNN political commentator Hughes: \"hoping I not going to have to [brush up on] my #DoratheExplorer to understand some of the speeches given this week. #DNC #TimKaine"},{"comment_id":"10153864649566336","commenter_b":"God places all sorts of obstacles in our path, so that we may become stronger and have a better understanding of faith.","commenter_a":"Ironic that people are praying for God to bless her, if he could do anything don't you think he would've avoided her getting it at all??????","post_message":"“I hope that I can fight it off,” eight-year-old Chrissy said."},{"comment_id":"10152828817287426","commenter_b":"Omgosh..I am not a violent person..BUT I would beat the Sh** out of that woman....first of all...I NEVER gave into my kids when they threw fits...that's how they learn to NOT get what they want all the time.....This woman is sick sick sick....part of parenting means to not give in..","commenter_a":"@username U seen this uet","post_message":"“There’s nothing wrong with that child, it just needs to be beat,” the woman, who claims to be Kathleen Smith, said in the video."},{"comment_id":"10153123341393433","commenter_b":"If the GOP and Faux news had been fighting the ACA every step of the way it would have probably met expectations. I have a neighbor that continually puts Obamacare down but when questioned on specifics she doesn't know anything about it.","commenter_a":"Survivor - Republican Nomination Edition! See the candidates squirm at questions about evolution! See them deny climate change! See them lambast Obama and try desperately not to even mildly criticize each other! See them try to criticize Jeb Bush while lusting after his millions! See them scurry and grovel for billionaire dollars! See them coordinate-not-coordinate with their PAC's! Watch as they kiss the ring of Sheldon and the behinds of the Koch's! See them on their knees begging and groveling for your vote! See them slap each other silly in the final rounds! See them bow out, tails between their legs, defiantly trying to sound manly and tough! See them in the green room, crying and sobbing and wailing... Oh wait, that's when they're on stage. See them try and start a war with Iran! See them argue about who gives Bibi the best blowjob! See them trying to be ...","post_message":"Did the health care law kill jobs? Does everyone have access to coverage? Monday marks the fifth anniversary of Obamacare, so here's a look at the predictions that were right and that ones that missed their mark. bit.ly/1HbvOsO"}]
