[{"comment_id":"10154732730043132","commenter_b":"BUT is he jewish?!","commenter_a":"Daniel Foisset","post_message":"It looks like Aly Raisman has plans for after Rio!"},{"comment_id":"1015033255223089","commenter_b":"Tariq doesn't represent the real moderate Islam at all! I am Muslim and I do advocate humans rights no matter what sexuality, religion or colour they are","commenter_a":"I dont like ISIS but they did a very good job by killing the gay... Same sex is not permitted in any Heavenly Religion","post_message":"Blindfolded, bound and brutally murdered"},{"comment_id":"1208229205939996","commenter_b":"CRIMINALS DON'T OBEY GUN LAWS OR ANY LAWS!","commenter_a":"Somebody went postal in Orlando last night. Another mass shooting, our country has so many. I have to have a licence to drive a car, to prove I am not so crazy as to kill people with it needlessly. But any idiotic crazy person can own a gun, or lots of them, with no accountability. The second amendment was not written to cover high capacity assault rifles, designed only for killing people.","post_message":"LATEST: Approximately 20 people are dead and scores wounded after a gunman opened fire and took hostages at a gay nightclub in Orlando."},{"comment_id":"1698243613797536","commenter_b":"@username u racist chink","commenter_a":"Dimash Shayan we gotta do this","post_message":"Japan is hiring full-time ninjas!!!"},{"comment_id":"1190103767694524","commenter_b":"SOROS supposedly promised her the election so that is why she thinks she has it. THEY WERENT COUNTING ON TRUMP TO TAKE OVER!!! LOL GO TO HELL BITCH> WE NEED TRUMP NOT SOME GANGSTER BITCH AND HER CULT!!!","commenter_a":"Nobody bothers to mention that the last time the Clintons were in the white house they stole furniture and silverware and were forced to pay or return it.","post_message":"Hillary thinks she's already won. This kind of sick behavior is UNACCEPTABLE in a constitutional republic!"},{"comment_id":"1135734373128367","commenter_b":"Luke Brandon he's going his own way","commenter_a":"She has been nothing but a big disappointment and embarrassment to herself since she divorced her first husband. He built her and her career has gone nowhere but down the tubes since that divorce, as she insist on living the life of shame and sleaze.","post_message":"Claims Mariah Carey's keeping the HUGE engagement ring"},{"comment_id":"10153308267139641","commenter_b":"Give her a million and send her on her way.","commenter_a":"Probably be on ID How I almost got away with it","post_message":"Russia's richest man faces $7 billion divorce bill: @webpagelink"}]
