[{"comment_id":"10154319204506729","commenter_b":"And this should include Hillary as well. The woman has delusions of grandeur and is a serial liar. These are all distorted mental behaviors and both should be institutionalized.","commenter_a":"Psychosis: Possible symptoms include delusions, hallucinations, talking incoherently, and agitation. The person with the condition usually isn't aware of his or her behavior. Critical: consult a doctor for medical advice","post_message":""},{"comment_id":"10153892614846323","commenter_b":"Heartless bitch","commenter_a":"you failed your child it is your job to teach them not to go to strangers homes do not trust people over the internet and so on","post_message":"\"My heart breaks to think how scared he must have been.\""},{"comment_id":"10153603093348132","commenter_b":"You are not that smart are you?","commenter_a":"DONT RUN","post_message":"\"We feel the system is working but it doesn't bring him back.\""},{"comment_id":"10153264316296336","commenter_b":"Civil liberties can cram it where the sun don't shine! Freedom of speech for ALL.","commenter_a":"How about this group goes f@$#s it self","post_message":"A civil liberties group says this United States Air Force general should be court-martialed for speaking about how God has guided his career."},{"comment_id":"10153181458311336","commenter_b":"leave her with isis now she has become an enemy of this state..to bring her back is only to have join other nuts that are here to do harm to alll ..she wanted to go be with them well let her learn what she goin into maybe that will open other women eyes what isis is about SEX AND RAPE","commenter_a":"Peaceful muslims.","post_message":"\"This is worse than losing the life of a child,\" a spokesman for the parents said."},{"comment_id":"1087981781280741","commenter_b":"This has nothing to do with \"political correctness\" and everything to do with the agenda of those who wish to bring this country to its knees. Offend Who? Immigrants - legal and illegal? Muslims? Persons like George Soros? These are schools being attacted; our children, our countries highest symbol.","commenter_a":"How can u even think of not flying our flag anywhere in this country. If u have no respect for our flag get the heck out of my USA.","post_message":"Old Glory just got banned from High School football games for the most despicable reason imaginable. What do you think about this and how should students and their parents react?"},{"comment_id":"10154486445542994","commenter_b":"There is no male. It is a transgendered woman.","commenter_a":"they beat his anus","post_message":"Courtney Purvis says she was attacked outside of a bar in Dearborn because she identifies herself as transgender."}]
